[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya orang-orang yang mencelamu dalam mekanisme pembagian sedekah mau ridha dengan mekanisme bagaimana Allah dan rasulNya membagiakn kepada mereka dan mereka mengatakan, ”cukuplah Allah bagi kami, Allah akan memberikan kepada kami sebagian dari karuniaNYa dan rasulNya akan memberikan kepada kami dari apa yang Allah berikan kepadanya, sesungguhnya kami ingin Allah melapangkan karunia pada kami, lalu memberikan kecukupan kepada kami, sehingga tidak butuh terhadap sedekah dan sedekah-sedekah dari manusia,” sekiranya mereka melakukan semua itu, pastilah akan lebih baik dan lebih bermanfaaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Seandainya orang-orang munafik yang mencelamu dalam pembagian zakat itu mau menerima apa yang Allah tetapkan untuk mereka dan apa yang rasul-Nya berikan kepada mereka dengan sukarela dan berkata, \"Cukuplah Allah bagi kami. Dia lah yang akan memberi kami sebagian dari karunia-Nya menurut kehendak-Nya. Dan rasul-Nya akan memberi kami sebagian dari apa yang Allah berikan kepadanya. Sesungguhnya hanya kepada Allah kami berharap bahwa Dia akan memberikan sebagian dari karunia-Nya kepada kami\", seandainya mereka melakukan hal itu niscaya hal itu akan lebih baik bagi mereka daripada melontarkan celaan kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Seandainya orang-orang munafik yang mengkritikmu dalam pembagian sedekah dan zakat itu merasa puas dengan apa yang telah Allah tetapkan dan yang telah Allah berikan bagi mereka dengan mengatakan: 'Allah yang akan mencukupi kami, Dia akan memberikan karunia-Nya kepada kami sesuai dengan kehendak-Nya, dan Rasulullah akan memberikan kepada kami apa yang telah Allah berikan kepadanya. Hanya kepada Allah kami mengharap karunia.' Seandainya mereka berlaku demikian niscaya itu lebih baik bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَلَوْ أَنَّهُمْ رَضُوا۟ مَآ ءَاتَىٰهُمُ اللهُ وَرَسُولُهُۥ (ikalau mereka sungguh-sungguh ridha dengan apa yang diberikan Allah dan Rasul-Nya kepada mereka) Yakni apa yang Allah tetapkan bagi mereka dan yang Rasulullah berikan untuk mereka maka itu lebih baik bagi mereka. وَقَالُوا۟ حَسْبُنَا اللهُ(dan berkata: “Cukuplah Allah bagi kami) Yakni cukuplah Allah bagi kami. سَيُؤْتِينَا اللهُ مِن فَضْلِهِۦ وَرَسُولُهُۥٓ( Allah akan memberikan sebagian dari karunia-Nya dan demikian (pula) Rasul-Nya) Allah akan memberi kami karunia-Nya, dan setelah itu Rasulullah akan memberi kami sesuai dengan apa yang kami harapkan tanpa mencela. إِنَّآ إِلَى اللهِ رٰغِبُونَ (sesungguhnya kami adalah orang-orang yang berharap kepada Allah,”) Yakni berharap agar Allah memberi kami karunia-Nya seperti apa yang kami harapkan. Jika mrereka berkata demikian niscaya hal itu lebih baik bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Kalau orang-orang munafik itu rela dengan apa yang diberikan Rasulallah SAW kepada mereka berupa rampasan perang, mereka akan berkata: “Allah telah mencukupi kami, Dia akan memberi kami banyak hal dari keutamaanNya dan rasulNya akan memberi kami lebih banyak dari sebelumnya. Kami senang jika Allah memberi kami” Sungguh itu baik bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka benar-benar ridha dengan apa yang diberikan Allah dan RasulNya kepada mereka, dan berkata,“Cukuplah Allah bagi kami} cukuplah Allah bagi kami {Allah akan memberi kami sebagian dari karuniaNya, dan juga RasulNya. Sesungguhnya kami adalah orang-orang yang berharap kepada Allah.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Dan di sini Dia berfirman, “Jikalau mereka sungguh-sungguh ridha dengan apa yang diberikan Allah dan RasulNya kepada mereka,” besar atau kecil, “dan berkata, ‘Cukuplah Allah bagi kami’.“ Yakni Allah yang mencukupi kami, maka kami pun rela dengan pembagian dariNya. Dan hendaklah mereka berharap karunia dan kebaikanNya kepada mereka dengan berkata, “Allah akan memberikan kepada kami sebagian dari karuniaNya dan demikian (pula) RasulNya, sesungguhnya kami adalah orang-orang yang berharap kepada Allah,’ (tentulah yang demikian itu lebih baik bagi mereka).” Yakni kami merendahkan diri dalam mengharap kebaikan dan menolak keburukan (niscaya mereka selamat dari kemunafikan, dan niscaya mereka ditunjukkan kepada iman dan keadaan-keadaan yang tinggi). Kemudian Allah menerangkan tata cara pembagian sedekah wajib (zakat), Dia berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 59: Sedikit atau banyak, baik dari ghanimah maupun lainnya. Yakni kami ridha dengan pembagian-Nya, sambil kami berharap kepada karunia dan ihsan-Nya. Dari ghanimah yang lain. Agar Dia memberikan kecukupan kepada kami. Jawaban kalimat di atas adalah, “Tentu yang demikian lebih baik bagi mereka” atau “tentu mereka akan selamat dari kemunafikan serta akan ditunjukkan kepada keimanan dan keadaan-keadaan yang utama.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 59",
    "description": "Padahal, sekiranya mereka benar-benar rida atau menerimanya dengan puas dengan apa yang diberikan kepada mereka oleh Allah dan rasul-Nya, dan berkata, cukuplah Allah bagi kami sebagai sandaran hidup kami, sebab Allah pasti akan memberikan kepada kami sebagian dari karunianya dan juga rasul-Nya dengan memberi bagian kepada kami, baik dari zakat maupun ganimah, dan sesungguhnya kami orang-orang yang ber-harap kepada Allah, maka alangkah baik dan indahnya seandainya mereka bersikap seperti itu. Namun, kenyataannya mereka tidak melakukan demikiansetelah ayat sebelumnya menyatakan bagaimana orang-orang munafik telah mencela rasul dalam persoalan pembagian harta, baik zakat maupun ganimah, maka ayat ini menjelaskan secara terperinci siapa sesungguhnya yang berhak menerima zakat itu. Sesungguhnya zakat itu hanyalah untuk orang-orang fakir, yaitu orang yang tidak memiliki pekerjaan tetap sehingga kebutuhan primernya tidak terpenuhi, orang miskin, yakni orang yang memiliki penghasilan namun tidak cukup untuk memenuhi kebutuhan hidupnya secara layak, baik kedua kelompok itu meminta-minta maupun tidak, amil zakat, orang-orang yang ditugaskan untuk mengelola dana zakat, yang dilunakkan hatinya atau orang yang baru masuk islam, untuk memerdekakan hamba sahaya, untuk membebaskan orang yang berutang demi memenuhi kebutuhan primernya yang jumlahnya melebihi penghasilannya, untuk orang yang aktivitasnya berada di jalan Allah dan untuk orang yang sedang dalam perjalanan dengan perjalanan yang mubah dan kehabisan bekal. Zakat itu sebagai kewajiban dari Allah bagi setiap muslim yang mampu. Allah maha mengetahui apa saja yang terkait dengan kemaslahatan hambahamba-Nya, mahabijaksana atas segala aturan dan kebijakan-Nya."
  }
]