[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila salah seorang diantara kaum musyrikin yang halal darah dan harta benda mereka meminta masuk dalam perlindunganmu (wahai rasul), dan dia ingin merasa aman, maka penuhilah permintaannya itu hingga ia dapat mendengar al-qur’an al-karim dan mengetahui petunjuk hidayahnya, kemudian kembalikan dia ketempat berasal dalam keadaan aman. Tindakan tersebut ditunjukan untuk menegakan hujjah di hadapan dirinya. Demikian itu disebabkan bahwa sesungguhnya orang-orang kafir adalah kumpulan manusia-manusia bodoh yang tidak memahami hakikat-hakikat ajaran islam. Mungkin saja mereka akan memilih islam ketika ketidaktahuan itu sirna dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Jika ada orang musyrik yang halal darah dan hartanya menemuimu -wahai Rasul- dan meminta perlindungan kepadamu, maka penuhilah permintaannya agar ia mendengar (bacaan) Al-Qur`ān, kemudian kirimlah ia ke tempat yang aman baginya. Hal itu karena orang-orang kafir adalah kaum yang tidak mengetahui hakikat (fakta yang sebenarnya tentang) agama ini. Jika mereka mengetahuinya melalui bacaan Al-Qur`ān yang didengarnya boleh jadi mereka mendapatkan hidayah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Setelah Allah memerintahkan untuk membunuh orang-orang musyrik dimanapun mereka berada, menawan, dan mengepung mereka; maka kemudian Allah menyebutkan keadaan di mana merea tidak boleh dibunuh atau ditawan. Allah memerintahkan rasul-Nya jika salah seorang di antara mereka meminta darinya keamanan dan perlindungan, maka hendaklah dia memberinya keamanan dan baginya dan bagi hartanya, agar dia dapat mendengar dakwah Islam, karena ini adalah kesempatan untuk berdakwah. Jika dia mendapat petunjuk dan beriman secara suka rela, maka itulah tujuannya; namun jika dia tidak beriman, maka sampaikanlah dia ke tempat yang aman baginya, sehingga dia dapat menjalankan kepercayaannya, sebab orang-orang beriman tidak dapat memaksanya karena dia adalah kaum yang jahil, yang tidak mengetahui apa itu kitab Allah dan apa itu keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ (Dan jika seorang diantara orang-orang musyrikin itu meminta perlindungan kepadamu, maka lindungilah ia) Yakni jadilah pelindungnya sehingga ia tidak mendapat kezaliman sedikitpun. حَتَّىٰ يَسْمَعَ كَلٰمَ اللهِ(supaya ia sempat mendengar firman Allah) Yakni mendengar darimu, agar ia mentadabburinya dengan sebenar-benarnya dan mengetahui hakikat seruan yang ditujukan kepadanya. ثُمَّ أَبْلِغْهُ مَأْمَنَهُۥ ۚ( kemudian antarkanlah ia ketempat yang aman baginya) Yakni ke tempat yang aman baginya setelah ia mendengar firman Allah, apabila ia tetap tidak beriman setelah kamu membawanya ketempat yang aman maka kamu boleh membunuhnya kerena ia telah keluar dari perlindunganmu dan telah mendapat keamanan. ذٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ(Demikian itu disebabkan mereka kaum yang tidak mengetahui) Yakni tidak mengetahui ilmu yang bermanfaat yang dapat membedakan antara yang baik dan yang buruk. Perlindungan bagi orang-orang kafir ini bermanfaat bagi sebagian mereka yang belum mengetahui hakikat dakwah Islam, dan apabila ia telah mengetahuinya bisa jadi ia akan masuk Islam dan bisa jadi ia akan menjelaskan kepada orang lain pengetahuan yang ia dapatkan sehingga orang yang dikehendaki Allah mendapat kebaikan itu dapat masuk Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6 Jika seorang diantara orang-orang musyrikin itu meminta perlindungan kepadamu, maka lindungilah ia supaya ia sempat mendengar dan memahami firman Allah, kemudian antarkanlah ia ke tempat yang aman baginya. Demikian itu disebabkan mereka kaum yang tidak mengetahui Islam dan hakikatnya, serta tidak bisa membedakan mana baik atau buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika seseorang di antara orang-orang musyrik ada yang meminta pelindungan kepadamu} meminta keamanan dan penjagaanmu {maka lindungilah dia} maka terimalah dan berilah keamanan {supaya dapat mendengar firman Allah kemudian antarkanlah dia ke tempat yang aman baginya} kembalikan dia ke rumah yang aman baginya {Demikian itu karena sesungguhnya mereka adalah kaum yang tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. ketika sudah ada firmanNya, “Apabila sudah habis bulan-bulan haram, bunuhlah orang-orrang musyrikin itu dimana saja kamu jumpai mereka, dan tangkaplah mereka, kepunglah mereka, dan intailah tempat pengintaian”, (At-Taubah:5) adalah perintah yang bersifat umum dalam segala kondisi dan untuk semua orang dari mereka, maka Allah menyatakan bahwa jika memang ada kemalahatan dalam mendekati sebagian sebagian dari mereka, maka hal itu di bolehkan, bahkan wajib, Dia berfirman, “dan jika seorang di antara orang-orang musrikin itu meminta pertolongan kepadamu.” Yakni, meminta agar kamu menjagannya dan menjamin pengjagaannya agar dia melihat Kalamullah dan keadaan Islam, “maka lindungilah dia suapaya dia sempat mendengar firman Allah,” kemudian jika dia masuk Islam, maka itulah yang diharapkan, jika tidak, maka antarkan dia ketempat yang aman. Penyebabnya adalah orang-orang kafir adalah kaum yang tidak mengetahui, bisa jadi kekufuran yang mereka ikuti itu dikarenakan kejahilan mereka, jika kejahilan ini lenyap maka bisa jadi mereka memilih Islam, oleh karena itu Allah memerintahkan RasulNya dan umatnya untuk mengikutinya, agar melindungi orang-orang yang mendengar Kalamullah. Ini adalah dalil yang sangat jelas bagi madzhab Sunnah wal jama’ah yang menyatakan bahwa Al-Qur’an adalah Kalamullah bukan makhluk, karena Allah-lah yang berbicara dengannnya dan menisbatkannya kepada diriNya sebagai bentuk sifat kepada pemiliknya. Ini sekaligus menunjukan kebhatilan madzhab Mu’thaziah dan orang-orang yang mengikuti pendapat mereka bahwa Al-Qur’an adalah makhluk. Dan banya sekai dalil yang menunjukan kebatilan pendapat ini, namun bukan disini tempat untuk membeberkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 6: Pada ayat 5 di surat ini, Allah Subhaanahu wa Ta'aala memerintahkan kaum muslimin untuk memerangi kaum musyrik di mana saja mereka temui, dan pada ayat ini Allah Subhaanahu wa Ta'aala menerangkan bahwa jika maslahat menghendaki untuk mendekatkan mereka kepada Islam, maka boleh bahkan harus dilakukan. Yakni meminta kepadamu agar engkau melindunginya dan mencegahnya dari bahaya agar ia dapat mendengar firman Allah dan melihat ajaran Islam. Dalam ayat ini terdapat dalil bahwa Al Qur’an adalah firman Allah bukan makhluk. Yaitu tempat kaumnya agar dia berpikir jernih. Tidak mengenal agama Allah, oleh karena itu mereka harus diperkenalkan agama Allah dengan dibacakan Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 6",
    "description": "Meski Allah mewajibkan kaum muslim untuk menyerang kaum musyrik setelah habis masa tenggang waktu atau disebabkan mereka merusak perjanjian, hal itu bukan berarti mereka tidak punya kesempatan untuk memperoleh perlindungan keamanan sedikit pun. Dan jika di antara kaum musyrik ada yang meminta perlindungan kepadamu, setelah habisnya masa tenggang waktu empat bulan, maka lindungilah agar dia dapat mendengar firman Allah sehingga dengan begitu diharapkan mereka tertarik dan bisa insaf. Namun begitu, kamu tidak boleh memaksanya jika ternyata dia tidak mau masuk islam. Bahkan, setelah dia tinggal bersama kaum muslim beberapa lama kemudian dia minta pulang ke tempat asalnya, maka antarkanlah dia ke tempat yang aman baginya. Demikian itu karena sesungguhnya mereka kaum yang tidak mengetahui tentang kebenaran islam. Setelah ayat sebelumnya menjelaskan tentang pemutusan perjanjian dengan kaum musyrik mekah juga yahudi bani quraidhah dan seruan untuk memerangi mereka setelah lewat masa tenggang empat bulan, maka ayat ini menunjukkan alasan mengapa pemutusan perjanjian itu harus dilakukan. Bagaimana mungkin ada perjanjian yang dimuliakan di sisi Allah dan rasul-Nya bagi orang-orang musyrik yang telah sedemikian meresapnya kemusyrikan tersebut sehingga mereka tidak merasa bersalah setiap kali merusak perjanjian' jika demikian, perjanjian damai tidak boleh dilanjutkan lagi, kecuali dengan orang-orang musyrik yang kamu telah mengadakan perjanjian dengan mereka di dekat masjidilharam, yakni dalam perjanjian hudaibiyah, maka selama mereka berlaku jujur dengan tetap memegang perjanjian atau tidak khianat terhadapmu, hendaklah kamu berlaku jujur pula terhadap mereka. Sungguh, Allah menyukai orang-orang yang bertakwa, yang memiliki sifat-sifat terpuji, antara lain dengan senantiasa jujur dan memegang perjanjian dengan siapa pun, bahkan dengan mereka yang berkhianat sekalipun."
  }
]