[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya zakat-zakat wajib hanya diberikan kepada : orang-orang yang membutuhkan yang tidak memiliki apapun, kaum miskin yang tidak memiliki sesuatu yang mencukupi mereka dan menutupi kebutuhan mereka, para petugas yang sibuk mengumpulkannya, orang yang dilembutkan hatinya sehingga diharapkan keislamannya, atau diharapkan keimanannya bertambah kuat, atau orang yang diharapkan bermanfaat bagi kaum muslimin, atau kalian dapat menepis dengannya keburukan seseorang terhadap kaum muslimin, untuk membebaskan hamba sahaya dan budak-budak yang ingin menebus dirinya, orang-orang yang terkena tuntutan hutang dalam rangaka memperbaiki persengketaan, atau orang yang terbebani oleh hutang-hutang yang tidak dipakai untuk kerusakan maupun di hambur-hamburkan, lalu mereka kesulitan untuk melunasinya, para pejuang di jalan Allah, serta musafir yang kehabisan bekal perjalanan. Pembagian ini adalah merupakan kewajiabn yang diwajibkan oleh Allah dan ditetapkanNya. Dan Allah mahamengetahui maslahat-maslaahat hamba-hambaNya, nahabijaksana dalam pengaturan dan ajaran syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. \"Sesungguhnya zakat-zakat yang wajib itu harus diberikan kepada orang-orang fakir, yaitu orang-orang yang membutuhkan (bantuan), yang sebenarnya mereka mempunyai harta dari profesi atau pekerjaan mereka tetapi tidak bisa mencukupi kebutuhan mereka namun kondisi mereka itu tidak kelihatan; kepada orang-orang miskin yang nyaris tidak mempunyai apa-apa dan keadaan mereka bisa diketahui orang lain dengan melihat kondisi mereka atau ucapan mereka; kepada para petugas yang ditugaskan oleh pemerintah untuk menghimpun zakat; kepada orang-orang kafir yang diluluhkan hatinya supaya mau memeluk Islam, atau orang-orang mukmin yang lemah iman supaya imannya menjadi kuat, atau orang-orang yang dikhawatirkan kejahatannya; kepada para budak yang ingin memerdekakan dirinya; kepada orang-orang yang terlilit hutang yang tidak berlebih-lebihan dan tidak digunakan untuk kemaksiatan apabila mereka tidak mampu membayar hutangnya; kepada pihak-pihak yang bertugas menyiapkan perbekalan bagi orang-orang yang berjihad di jalan Allah; dan kepada para musafir yang kehabisan bekal di tengah perjalanan. Membatasi pembagian harta zakat pada golongan-golongan tersebut adalah kewajiban dari Allah. Dan Allah Maha Mengetahui kemaslahatan hamba-hamba-Nya, lagi Maha Bijaksana dalam pengaturan dan penetapan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Setelah mereka mengkritik Rasulullah dalam pembagian sedekah dan zakat, kemudian Allah menjelaskan kepada mereka orang-orang yang berhak mendapatkannya: \"Sesungguhnya harta zakat wajib diberikan kepada orang-orang fakir yang tidak memiliki harta benda; orang-orang miskin yang hartanya tidak dapat mencukupi kehidupan mereka; para petugas zakat yang diutus oleh pemimpin untuk mengumpulkan zakat; orang-orang kafir yang diharapkan mau masuk Islam, atau orang-orang yang memiliki iman yang lemah agar iman mereka menjadi kuat, atau orang yang diberi zakat agar tidak mengganggu agama Islam; para budak agar dapat memakai harta zakat itu untuk memerdekakan diri; orang-orang yang memiliki hutang yang diambil bukan untuk berfoya-foya atau kemaksiatan jika mereka tidak mampu membayar utang tersebut; para mujahid yang berperang di jalan Allah; dan para musafir yang telah habis bekalnya. Pembagian harta zakat hanya diberikan kepada mereka sebagai ketentuan Allah yang wajib diterapkan. Allah Maha Mengetahui kemaslahatan bagi hamba-hamba-Nya dan Maha Bijaksana dalam ketetapan-Nya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. إِنَّمَا الصَّدَقٰتُ لِلْفُقَرَآءِ (Sesungguhnya zakat-zakat itu, hanyalah untuk orang-orang fakir) Ketika orang-orang munafik mencela Rasulullah dalam pembagian sedekah (zakat), Allah kemudian menjelaskan kepada mereka orang-orang yang berhak mendapatkannya untuk mencegah tuduhan mereka dan menghentikan perbuatan buruk mereka. Zayad bin Harist berkata: “seseorang mendatangi Rasulullah seraya berkata: “berilah aku sebagian harta zakat”. Rasulullah menjawab: “sesungguhnya Allah tidak rela menjadikan ketetapan seorang Nabi atau selainnya dalam hal zakat sampai Allah sendiri yang menetapkannya, dan Allah telah membaginya untuk delapan golongan, jika kamu termasuk satu dari golongan-golongan tersebut maka aku akan memberimu”.” لِلْفُقَرَآء وَالْمَسٰكِينِ(untuk orang-orang fakir dan orang-orang miskin) Orang fakir adalah orang yang tidak memiliki apapun. Dalam sebuah hadist disebutkan: para sahabat bertanya: “siapakah orang yang disebut sebagai orang miskin Wahai Rasulullah?”. Rasulullah menjawab: “dia adalah orang yang tidak dapat mencukupi kebutuhannya, namun tidak menunjukkan kemiskinannya sehingga orang lain dapat bersedekah untuknya, dan ia tidak meminta-minta”. وَالْعٰمِلِينَ عَلَيْهَا(pengurus-pengurus zakat) Mereka adalah para petugas yang dikirim oleh penguasa untuk mengumpulkan zakat. وَالْمُؤَلَّفَةِ قُلُوبُهُمْ(para mu’allaf yang dibujuk hatinya) Mereka adalah orang-orang kafir yang dibujuk hatinya oleh Rasulullah agar mau memeluk Islam dan mereka masuk Islam karena berharap untuk diberi harta zakat. وَفِى الرِّقَابِ(untuk (memerdekakan) budak) Yaitu dengan dipakai untuk membeli para budak untuk dimerdekakan. وَالْغٰرِمِينَ(orang-orang yang berhutang) Mereka adalah orang-orang yang telah menumpuk hutangnya namun tidak mampu melunasinya. Adapun orang yang terlilit hutang karena keborosannya maka ia tidak boleh diberi harta zakat atau sedekah sampai ia bertaubat dan berhenti dari keborosannya. Rasulullah juga telah memberikan sedekah kepada orang yang bekerja memikul beban, dan memerintahkan untuk menolongnnya. وَفِى سَبِيلِ اللهِ(untuk jalan Allah) Mereka adalah orang-orang yang berperang dan berjaga-jaga di perbatasan, mereka diberi bagian harta zakat untuk membiayai perang dan penjagaan mereka meskipun mereka orang-orang kaya. وَابْنِ السَّبِيلِ ۖ( dan untuk mereka yuang sedang dalam perjalanan) Dia adalah orang yang perbekalannya habis dalam perjalanan dari negerinya, dia diberi bagian harta zakat meski dia di negerinya adalah orang yang kaya. فَرِيضَةً مِّنَ اللهِ ۗ( sebagai suatu ketetapan yang diwajibkan Allah) Yakni pembagian zakat hanya untuk golongan-golongan ini merupakan hukum tetap yang diwajibkan Allah kepada hamba-hamba-Nya dan melarang mereka untuk melanggarnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah menciptakan jiwa-jiwa dan mengajarkan bagaimana ia mencintai harta; namun Ia tidak mewakilan pembagiaannya kepada siapapun, melainkan Allah lah yang berwenang atas tempat perginya harta itu, sebagaimana Ia yang menentukan langsung pembagian harta warisan : { يُوصِيكُمُ اللَّهُ فِي أَوْلَادِكُمْ ۖ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ } \"Allah mensyari’atkan bagimu tentang (pembagian pusaka untuk) anak-anakmu. Yaitu: bahagian seorang anak lelaki sama dengan bagahian dua orang anak perempuan\" [ An-Nisa : 11 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Sesungguhnya membayar zakat wajib itu hanya untuk 8 ashnaf (golongan), yaitu orang-orang fakir yang tidak memiliki apapun, orang-orang miskin yang memiliki harta yang tidak mencukupi, orang yang khusus mengumpulkan zakat, orang-orang kafir yang disadarkan seorang Imam untuk masuk Islam (muallaf) atau orang-orang Islam sedangkan mereka adalah orang-orang yang lemah dalam Islam, atau untuk memerdekakan budak atau melepaskan perbudakan mereka dan memerdekakan mereka, orang-orang yang berhutang yang meminta pinjaman untuk diri sendiri dan tidak mampu membayar hutang-hutang mereka, orang-orang yang berjihad dan berjuang di jalan Allah, dan orang yang keluar dari negerinya untuk bepergian sekalipun dia orang kaya di negerinya. Allah mewajibkan pembagian ini sebagai kewajiban dan ketentuan yang diperintahkan. Dan Allah itu Maha Mengetahui kemaslahatan ciptaanNya dan Maha Bijaksana dalam mengatur urusan-urusan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya zakat itu} zakat yang diwajibkan itu {hanyalah untuk orang-orang fakir} orang-orang yang sangat membutuhkan dan tidak memiliki apapun {orang-orang miskin} orang-orang yang tidak memiliki sesuatu yang cukup untuk mereka sehingga kebutuhan mereka terhalang {para amil zakat} orang yang berusaha mengumpulkan zakat {orang-orang yang dilunakkan hatinya} orang-orang yang hatinya terpikat untuk masuk Islam sebagaimana orang yang diharapkan keislamannya dan bertambah keimanannya {untuk para hamba sahaya} untuk memerdekakan hamba sahaya dan menebus tawanan {untuk orang-orang yang berhutang} orang-orang yang berhutang yang tidak melebihi batas dan tidak melanggar, yaotu orang-orang yang tidak mampu melunasinya {untuk jalan Allah} untuk memberi persediaan para mujahid di jalan Allah {dan untuk orang-orang yang dalam perjalanan} musafir yang telah habis hartanya {sebagai kewajiban dari Allah. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Allah berfirman, “Sesungguhnya zakat-zakat itu”, yakni zakat yang wajib dengan dalil bahwa sedekah yang dianjurkan itu diberikan kepada siapa saja tanpa pengkhususan, sedangkan di dalam ayat ini disebutkan adanya pengkhususan, yakni “Sesunguhnya zakat-zakat itu”, adalah untuk mereka, tidak untuk yang lain, karena Allah membatasinya pada mereka, yaitu delapan golongan berikut ini: Pertama dan kedua: Fakir dan miskin. Di tempat ini keduanya adalah dua golongan yang berbeda. Fakir lebih membutuhkan daripada miskin, karena Allah menyebutkannya di awal, dan suatu perkataan tidak dimulai kecuali dengan yang lebih penting, lalu baru yang penting berikutnya. Fakir adalah orang yang tidak memiliki apa pun untuk memenuhi kebutuhannya, atau memiliki kurang dari setengahnya, sedangkan miskin, maka dia memiliki setengah lebih tetapi belum mencukupi, karena jika dia memilikinya berarti dia adalah orang kaya. Keduanya diberi zakat yang bisa menghilangkan kefakiran dan kemiskinannya. Ketiga: Amil zakat, dia adalah setiap orang yang bekerja dan sibuk pada urusan zakat, mulai dari penjaga, penarik dari muzakki (pembayar zakat), penggembala, pembawa, penulis, dan petugas lainnya, dia diberi karena pekerjaannya, ia adalah gaji dari pekerjaannya dalam mengurusi zakat. Keempat: (Orang yang sedang dibujuk hatinya) dia adalah pembesar yang ditaati oleh kaumnya yang diharapkan keislamannya, atau ditakutkan kejahatannya, atau dia diberi dengan harapan agar imannya kuat, atau orang yang sepertinya masuk Islam, atau zakat bisa ditarik dari orang yang tidak memberikannya, dia diberi sekedar bisa menarik hatinya dan meraih kemaslahatan. Kelima: Riqab, yaitu hamba sahaya mukatab yang menebus dirinya dari tuan (pemilik) nya, yang berusaha keras agar bisa membebaskan dirinya, maka dia dibantu dari zakat. Membebaskan tawanan Muslimin dari tangan orang-orang kafir termasuk di dalamnya, bahkan ia lebih layak. Termasuk dalam hal ini boleh memerdekakan hamba sahaya walaupun dia bukan mukatab, karena ia termasuk dalam FirmanNya, “Untuk memerdekakan budak.” Keenam: Gharim, jenis ini terbagi menjadi dua: Pertama :orang yang mengeluarkan harta demi mendamaikan dua kelompok yang bertikai dan berselisih, lalu seseorang menengahi untuk mendamaikan dengan mengeluarkan harta untuk salah satu kelompok atau untuk keduanya, maka dia diberi bagian dari zakat agar hal itu menjadi peneguh dan penyemangat bagi tekadnya, dia diberi walaupun dia kaya. Yang kedua adalah orang yang berhutang harta untuk dirinya sendiri, kemudian dia bangkrut (tidak bisa melunasi hutang), dia diberi apa yang cukup untuk menutupi hutangnya. Ketujuh: orang yang berperang di jalan Allah, yang berperang dengan suka rela tanpa ada departemen yang membawahinya. Dia diberi zakat secukupnya untuk membantunya berperang, untuk mendapatkan senjata atau kendaraan atau nafkah untuknya dan keluarganya, agar dia focus dengan tenang dalam jihadnya. Banyak fuqaha yang menyatakan, “JIka orang yang mampu bekerja memutuskan untuk berkonsentrasi mencari ilmu, maka dia diberi dari zakat, karena menuntut ilmu termasuk ke dalam jihad di jalan Allah.” Mereka juga berkata, “Orang miskin di beri zakat untuk haji.” Namun pendapat ini perlu dikaji kembali. Kedelapan: Ibnu Sabil, yaitu orang asing yang kehabisan bekal dan sedang tidak di negerinya, dia diberi dari zakat yang dapat menyampaikannya ke negerinya. Mereka inilah delapan golongan yang mana zakat diberikan kepada mereka saja. “Sebagai sesuatu ketetapan yang diwajibkan Allah.” Allah mewajibkannya dan menentukan kadarnya sesuai dengan ilmu dan hikmahNya. “Dan Allah Maha Mengetahui lagi Mahabijaksana.” Ketahuilah, bahwa delapan golongan ini kembali kepada dua hal, pertama: yang diberi karena kaebutuhan dan keperluannya seperti fakir miskin dan semisalnya. Dan yang kedua adalah yang diberi karena memang dibutuhkan dan untuk kepentingan Islam. Allah mewajibkan bagian ini atas harta orang-orang kaya untuk menutupi kebutuhan khusus dan umum bagi Islam dan kaum Muslimin. Seandainya orang-orang kaya itu mau membayarkan zakatnya sesuai dengan ketentuan syar’I, niscaya tidak ada lagi orang fakir dari kalangan kaum Muslimin, niscaya akan terkumpul harta untuk mengamankan perbatasan dan melawan orang-orang kafir serta terwujudnya seluruh kepentingan agama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 60: Sedekah di sini maksudnya adalah zakat, karena sedekah sunat tidak hanya ditujukan kepada delapan asnaf ini. Yang berhak menerima zakat adalah: Orang yang fakir Orang fakir yaitu orang yang tidak mampu/sengsara (tidak memiliki harta untuk mencukupi kebutuhan dirinya dan kebutuhan orang yang ditanggungnya) disamping tidak punya tenaga untuk memenuhi penghidupannya, seperti orang tua jompo dan yang cacat badannya. Orang yang miskin Orang miskin adalah orang yang tidak cukup penghidupannya dan dalam keadaan kekurangan, tidak pandai bekerja dan tidak mau meminta-minta. Ibnu Jarir dan ulama lainnya memilih mengatakan bahwa orang fakir adalah orang yang menjaga diri dan tidak meminta-minta kepada manusia (padahal ia sangat butuh), sedangkan orang miskin adalah orang yang meminta-minta, berkeliling dan mencari manusia (agar diberi). Menurut yang lain, bahwa fakir adalah orang yang tidak memiliki harta untuk mencukupi kebutuhannya dan tidak mampu bekerja untuk menutupi kebutuhannya, sedangkan orang miskin adalah orang yang lebih ringan kebutuhannya daripada orang fakir. Singkatnya, orang miskin posisinya di bawah orang fakir dari sisi kebutuhannya, ia mampu mencari nafkah, tetapi penghasilannya tidak mencukupi baik bagi diri maupun keluarganya. Catatan: Ukuran seseorang dikatakan fakir dan miskin adalah ketika ia tidak memiliki harta seukuran senishab zakat setelah dikurangkan dengan kebutuhan pokoknya baik bagi dirinya maupun anak-anaknya berupa makan, minum, pakaian, tempat tinggal, kendaraan, perangkat untuk kerjanya dan sebagainya yang diperlukan olehnya. Amilin/pengurus zakat Orang yang diberi tugas menarik zakat dari masyarakat, dan yang menyalurkannya kepada yang berhak atau orang yang sibuk mengurus zakat. Termasuk orang yang sibuk mengurus zakat adalah penjaga, pengurus maupun pencatatnya. Kecuali jika mereka mendapat gaji dari pemerintah terhadap tugas itu, maka tidak diberikan. Mu’allaf (orang yang dibujuk ke dalam Islam agar masuk Islam atau untuk mengokohkan imannya atau menghindarkan gangguan darinya ataupun untuk menarik manfaat dengan diberikan zakat kepadanya seperti menjadikan yang lain ikut masuk Islam) Mu’allaf ini terbagi dua; ada yang muslim dan ada yang kafir. Mu’allaf yang muslim terdiri dari 4 golongan: q Tokoh masyarakat dari kalangan kaum muslimin. q Tokoh masyarakat yang masih lemah imannya, di mana ia sangat disegani oleh masyarakat, dengan diberikan zakat kepadanya diharapkan imannya semakin kuat. q Kaum muslimin yang tinggal di perbatasan antara negeri kaum muslimin dan negeri musuh. Diharapkan dengan diberikan zakat kepada mereka, mereka mau membela kaum muslimin ketika musuh menyerang. q Kaum muslimin yang memiliki pengaruh, apabila diberikan zakat kepada mereka, maka yang lain akan mengeluarkan zakatnya sehingga mempermudah untuk memungut zakat. Sedangkan mu’allaf yang kafir terdiri dari 2 golongan: q Orang-orang yang diharapkan masuk Islam dengan diberikannya zakat kepada mereka. q Orang-orang yang dikhawatirkan kejahatannya, dengan diberikannya zakat kepada mereka diharapkan mereka tidak berbuat jahat kepada kaum muslimin. Untuk memerdekakan budak ( Fir Riqab ) Yakni budak-budak mukaatab (yaitu budak yang mengadakan perjanjian dengan tuannya, apabila ia (yakni budak tersebut) membayar uang sejumlah sekian maka ia akan bebas), maka agar mereka dapat lepas dari perbudakan dibantu dari zakat. Orang islam yang terlilit hutang ( Gharimin ) Ghaarimin adalah orang yang berhutang dan tidak sanggup membayarnya, mereka ada beberapa macam: Ada yang memikul hutang, ada juga yang menjamin hutang orang lain sehingga hartanya habis atau membuatnya jadi berhutang, atau orang yang berhutang untuk suatu maksiat kemudian bertobat dan tidak ada biaya untuk melunasi hutangnya. Demikian pula orang yang berhutang untuk mendamaikan dua pihak yang bersengketa, lalu orang itu maju menengahi mereka dengan berjanji akan memberikan harta kepada salah seorang di antara mereka atau semuanya. Maka orang ini diberikan bagian dari zakat, meskipun ia kaya. Dalam perjuangan di jalan Allah (fi sabilillah) Di antaranya adalah para mujahidin yang sukarela berjuang menegakkan agama Allah atau untuk kepentingan pertahanan Islam dan kaum muslimin di mana mereka tidak mendapat gaji dari negara (baik mereka orang kaya maupun orang miskin). Adapula di antara ulama yang menggolongkan penuntut ilmu ke dalam fii sabilillah. Adapun pembangunan masjid, penggalian sungai atau kepentingan umum lainnya maka menurut Abu ’Ubaid dalam Al Amwal, zakat tidak bisa diberikan kepadanya. Ibnu Sabil (musafir) Ibnu Sabil adalah orang yang kehabisan perbekalan dalam perjalanan yang bukan maksiat sehingga tidak bisa melanjutkan perjalanan. Diberikan kepadanya zakat agar ia bisa kembali ke tempat asalnya. Faedah: Delapan golongan yang disebutkan di atas jika disimpulkan menjadi dua bagian: - Mereka yang diberikan zakat untuk memenuhi kebutuhan pribadinya (hajat khashshsah), seperti orang fakir, miskin, dsb. - Mereka yang diberikan zakat untuk kebutuhannya, di mana agama Islam memperoleh manfaat darinya (hajat ‘ammah). Sungguh besar sekali manfaat zakat, di mana jika disalurkan sesuai syar’i, maka akan berkurang kemiskinan dan agama Islam menjadi tegak dan terjaga. Golongan yang tidak Berhak Menerima Zakat Orang-orang yang tidak berhak menerima zakat adalah : q Orang kafir (Namun boleh diberikan kepada orang kafir sedekah sunat, bukan sedekah wajib (zakat)), dikecualikan apabila tergolong mu’allafah quluubuhum (lihat no. 4 tentang orang yang berhak menerima zakat). q Keluarga Nabi Muhammad shallallahu ‘alaihi wa sallam (yaitu istri Beliau dan keturunannya, juga setiap muslim dan muslimah keturunan Bani Hasyim dan Bani Muththalib, seperti keluarga Ali, keluarga Ja’far, keluarga ‘Aqiil, keluarga Al Harits dan keluarga Abbas dst. ke bawah termasuk pula maula (orang yang dimerdekakan) mereka) baik zakat maupun sedekah sunat. q Orang-orang yang kaya (kecuali apabila sebagai ‘amil zakat, membelinya dari orang miskin, orang yang berhutang, orang yang berperang di jalan Allah atau zakat yang diberikan dari orang miskin kepada si kaya). Seseorang disebut “kaya”apabila memiliki harta mencapai satu nishab setelah dikurangkan dengan kebutuhan mendesak dan hutangnya. q Orang yang kuat dan mampu berusaha untuk mencukupi kebutuhannya. q Orang yang nafkahnya di bawah tanggungjawabnya, seperti kedua orang tua, istri dan anak. q Orang kafir dan fasik seperti yang meninggalkan shalat dan yang mengejek syari’at Islam. Dalam tindakan-Nya. Oleh karena itu, zakat tidak boleh dialihkan kepada selain mereka yang disebutkan itu, dan salah satu golongan di antara 8 golongan itu tidak dihalangi memperolehnya ketika ada, maka dari itu, imam membagikannya secara sama (semuanya memperolehnya), namun ia juga boleh melebihkan sebagiannya di atas yang lain. Menurut penyusun tafsir Al Jalaalain, huruf lam (yakni pada kata lil fuqaraa’) menunjukkan bahwa masing-masing golongan harus memperoleh zakat, akan tetapi tidak wajib bagi pemilik harta ketika membagikannya harus memberikan kepada masing-masingnya karena yang demikian menyulitkan, bahkan ia cukup memberikan paling sedikit tiga golongan daripadanya (tidak kurang daripadanya) berdasarkan shighat (bentuk) jama’nya. Catatan: Untuk zakat fitri lebih diutamakan kepada orang-orang fakir dan miskin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 60",
    "description": "Setelah ayat sebelumnya menyatakan bagaimana orang-orang munafik telah mencela rasul dalam persoalan pembagian harta, baik zakat maupun ganimah, maka ayat ini menjelaskan secara terperinci siapa sesungguhnya yang berhak menerima zakat itu. Sesungguhnya zakat itu hanyalah untuk orang-orang fakir, yaitu orang yang tidak memiliki pekerjaan tetap sehingga kebutuhan primernya tidak terpenuhi, orang miskin, yakni orang yang memiliki penghasilan namun tidak cukup untuk memenuhi kebutuhan hidupnya secara layak, baik kedua kelompok itu meminta-minta maupun tidak, amil zakat, orang-orang yang ditugaskan untuk mengelola dana zakat, yang dilunakkan hatinya atau orang yang baru masuk islam, untuk memerdekakan hamba sahaya, untuk membebaskan orang yang berutang demi memenuhi kebutuhan primernya yang jumlahnya melebihi penghasilannya, untuk orang yang aktivitasnya berada di jalan Allah dan untuk orang yang sedang dalam perjalanan dengan perjalanan yang mubah dan kehabisan bekal. Zakat itu sebagai kewajiban dari Allah bagi setiap muslim yang mampu. Allah maha mengetahui apa saja yang terkait dengan kemaslahatan hambahamba-Nya, mahabijaksana atas segala aturan dan kebijakan-Nya. Ayat sebelumnya menjelaskan tuduhan orang-orang munafik kepada rasulullah yang dianggapnya telah berbuat curang atau tidak adil berkenaan dengan pembagian zakat atau ganimah, berikut ini diuraikan kembali ucapan dan gangguan orang-orang munafik ketika berada di tengah-tengah rasulullah. Dan di antara mereka, orang-orang munafik, ada orang-orang yang menyakiti hati nabi Muhammad padahal beliau adalah sosok yang agung. Mereka telah menuduh beliau tidak adil dan juga mengatakan kepada kaum mukmin atau sesama orang munafik, nabi itu terlalu cepat untuk memercayai semua apa yang didengarnya hanya karena diperkuat dengan sumpah, padahal belum dicek kebenarannya. Namun, beliau hanya memercayai apa saja yang membawa kebaikan dan kemaslahatan umatnya. Karena itu, katakanlah, wahai nabi Muhammad, kepada mereka, memang benar, kalau dia selalu mendengarkan setiap informasi yang disampaikan kepadanya dengan penuh perhatian, namun, dia tidaklah seperti yang kamu tuduhkan itu, sebab dia hanya mempercayai semua atau apa saja yang baik bagi kamu, dia beriman kepada Allah dan tentunya juga malaikat yang menyampaikan informasi, memercayai orang-orang mukmin yang dengan iman itulah mereka terhalang untuk melakukan kebohongan dan menjadi rahmat bagi orang-orang yang beriman di antara kamu. Dan orang-orang yang menyakiti rasulullah, baik di kala beliau masih hidup maupun sudah wafat, baik dengan ucapan maupun sikap, akan mendapat azab yang pedih di akhirat kelak. Sebab, perasaan cinta itulah yang akan melahirkan penghormatan yang tulus kepada yang dicintai dan tidak akan pernah menyakitinya."
  }
]