[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang munafik ada sekelompok orang yang menyakiti rasulullah , melalui ucapan mereka, semabri mengatakan, ”sesungguhnya dia menyimak setiap apa yang dikatakan kepadanya lalu mempercayainya,” katakanlah kepada mereka (wahai nabi), ”sesungguhnya Muhammad adalah manusia yang mendengarkan setiap kebaikan, dia beriman kepada Allah dan mempercayai kaum mukminin atas berita yang mereka sampaikan. Dan dia adalah rahmat bagi orang yang mengikutinya dan mengambil petunjuk dari hidayahnya. Dan orang-orang yang menyakiti rasulullah, Muhammad dengan bentuk gangguan apapun, bagi mereka siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan di antara orang-orang munafik itu ada orang yang menyakiti Rasulullah -ṣallallāhu 'alaihi wa sallam- dengan kata-kata. Tatkala melihat kesantunan Rasulullah -ṣallallāhu 'alaihi wa sallam-, mereka mengatakan bahwa beliau mendengarkan ucapan siapa saja dan mempercayainya, tidak bisa membedakan mana yang benar dan mana yang salah. Katakanlah -wahai Rasul- kepada mereka, \"Sesungguhnya rasul itu hanya mendengarkan ucapan yang baik. Dia percaya kepada Allah dan mempercayai apa yang disampaikan oleh orang-orang mukmin yang tulus serta menyayangi mereka.\" Dan sesungguhnya beliau diutus sebagai rahmat bagi yang beriman kepadanya. Dan orang-orang yang menyakitinya -ṣallallāhu 'alaihi wa sallam- dalam bentuk apa pun akan mendapatkan azab yang sangat menyakitkan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Kemudian Allah menyebutkan hal lain yang menunjukkan kebodohan orang-orang munafik, Dia menjelaskan bahwa sebagian orang-orang munafik menyakiti Rasulullah dengan perkataan mereka karena melihat kesabarannya: \"Dia (Rasulullah) mendengar perkataan siapa saja dan mempercayainya tanpa membedakan antara yang benar dan yang batil.\" Hai Rasulallah, katakanlah kepada mereka: \"Sesungguhnya Rasulullah tidak mendengar kecuali perkataan yang baik, dia mempercayai Allah dan mempercayai apa yang dikatakan orang-orang beriman kepadanya. Sedangkan orang-orang yang menyakitinya dengan cara apapun, maka bagi mereka azab yang pedih.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَمِنْهُمُ الَّذِينَ يُؤْذُونَ النَّبِىَّ وَيَقُولُونَ هُوَ أُذُنٌ ۚ (Di antara mereka (orang-orang munafik) ada yang menyakiti Nabi dan mengatakan: “Nabi mempercayai semua apa yang didengarnya”) Ini merupakan ciri-ciri lain dari orang-orang munafik. Dikatakan seseorang sebagai (أذن) apabila ketika ia mendengar perkataan setiap orang, ia mempercayainya dan tidak dapat membedakan antara yang benar dan yang salah. Mereka menyebut Rasulullah dengan hal ini karena mereka terlena oleh kesabaran Rasulullah dalam menghadapi mereka dan pemberian maaf beliau atas kejahatan-kejahatan mereka sebagai bentuk kelembutan dan mengabaikan mereka. قُلْ أُذُنُ خَيْرٍ لَّكُمْ(Katakanlah: “Ia mempercayai semua yang baik bagi kamu) Yakni, benar ia mendengarkan sesuatu yang baik namun tidak mendengarkan sesuatu yang buruk. يُؤْمِنُ بِاللهِ وَيُؤْمِنُ لِلْمُؤْمِنِينَ(ia beriman kepada Allah, mempercayai orang-orang mukmin) Yakni membenarkan Allah dan orang-orang beriman serta mendengarkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Dan sebagian orang-orang munafik itu memfitnah Nabi SAW bahwa beliau mendengarkan perkataan setiap orang dan membenarkannya. Katakanlah (wahai nabi): “Benar, dia menyimak (ucapan) setiap orang, namun dia hanya mendengarkan yang baik bukan yang buruk. Dia beriman kepada Allah dan mempercayai apa yang yang dikabarkan oleh orang-orang mukmin. Dia itu mengasihi orang yang beriman di antara kalian. Dan orang-orang yang menyakiti rasulullah SAW dengan ucapan atau tindakan, maka bagi mereka itu azab yang pedih dan menyakitkan di neraka Jahanam. Ayat ini turun terkait Nabtal bin Al-Harits yang duduk di dekat Rasulallah SAW, lalu beliau mendengarkan ucapannya, kemudian dia menyampaikan percakapan itu kepada orang-orang munafik”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka ada orang-orang yang menyakiti Nabi} di antara orang-orang munafik ada suatu kaum yang menyakiti Rasulullah SAW dengan ucapannya {dan mengatakan,“Dia adalah telinga} yang mendengar apa yang dikatakan kepadanya dan membenarkannya tanpa merenunginya {Katakanlah,“ telinga yang baik bagi kalian} pendengar yang baik dan benar bagi kalian bukan pendengar yang buruk dan rusak {dia beriman kepada Allah, memercayai orang-orang mukmin} mempercayai orang-orang mukmin terkait apa yang mereka beritahukan kepadanya {dan menjadi rahmat bagi orang-orang yang beriman di antara kalian.” Orang-orang yang menyakiti Rasulullah, bagi mereka itu azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Yakni di antara orang-orang munafik itu “Ada yang menyakiti Nabi”, dengan ucapan buruk, mencelanya dan mencela agamanya. “Dan mengatakan, ‘Nabi mempercayai semua apa yang didengarnya.” Yakni mereka tidak peduli dengan hinaan yang mereka katakan kepada Nabi, kata mereka, “Jika ada ucapan kita yang sampai kepadanya maka kita minta maaf kepadanya, pasti dia akan memaafkan, karena dia menerima apa saja yang dikatakan kepadanya, tanpa membedakan antara yang benar dan yang dusta. Maksud mereka – semoga Allah menimpakan keburukan kepada mereka-, bahwa mereka tidak mempedulikan dan memperhatikan hal itu, karena jika ucapan itu tidak didengar Nabi, maka inilah yang mereka cari, jika ia sampai, maka cukuplah dengan meminta maaf dengan cara yang batil. Mereka telah melakukan keburukan dari banyak sisi: Yang paling besar adalah, menyakiti Nabi yang hadir untuk memberi hidayah kepada mereka dan mengeluarkan mereka dari kesengsaraan dan kebinasaan kepada hidayah dan kebahagiaan. Di antaranya adalah, ketidakpedulian mereka dalam hal itu, ia tidak sekedar menyakiti, tapi lebih dari itu. Di antaranya juga adalah, cibiran mereka terhadap akal Nabi yang –kata mereka- tidak bisa membedakan antara yang benar dan yang dusta, padahal Nabi adalah orang yang memiliki akal paling sempurna, ilmu paling lengkap, dan pandangan yang paling tajam. Oleh karena itu Allah berfirman, “Katakanlah, ‘Ia mempercayai semua yang baik bagi kamu’ . “ yakni menerima siapa yang berkata benar dan baik kepadanya. Adapun berpalingnya Nabi dan tidak menyalahkan kebanyakan orang munafik yang meminta maaf dengan alasan-alasan yang dusta, maka hal itu karena kelapangan akhlaknya, ketidakpeduliannya kepada mereka dan karena mengamalkan Firman Allah, \"Kelak mereka akan bersumpah kepadamu dengan nama Allah, apabila kamu kembali kepada mereka, supaya kamu berpaling dari mereka. Maka berpalinglah dari mereka; karena sesungguhnya mereka itu adalah najis dan tempat mereka jahannam; sebagai balasan atas apa yang telah mereka kerjakan.\" (At-Taubah:95). Adapun hakikat apa yang ada di dalam hati dan pikirannya, maka Allah berfirman tentangnya, “Dia beriman kepada Allah, mempercayai orang-orang Mukmin”, yang benar dan membenarkan, dia mengetahui yang jujur dan yang dusta meskipun dia sering berpaling dari orang-orang yang diketahui kebohongannya dan kedustaannya, “dan menjadi rahmat bagi orang-orang yang beriman di antara kamu.” Karena mereka mengambil petunjuk darinya dan meneladani akhlaknya. Adapun orang-orang yang tidak beriman, maka mereka tidak mau menerima rahmat ini, bahkan mereka menolaknya, maka mereka rugi dunia dan akhirat. “Dan orang-orang yang menyakiti Rasulullah itu”, dengan perkataan dan perbuatan “bagi mereka azab yang pedih”, di dunia dan di akhirat, dan di antara azab yang pedih adalah dibunuhnya orang yang menyakiti Nabi dan mencelanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 61: Dengan kata-kata buruk, mencela Beliau dan mencela agamanya. Ketika mereka dilarang dari perbuatan demikian agar tidak sampai kepada Beliau. Yakni mempercayai semua perkataan dan menerimanya. Oleh karena itu, jika kami bersumpah bahwa kami tidak mengucapkannya, niscaya Beliau membenarkan kami. Tidak yang buruk. Oleh karena itu, Beliau hanya menerima perkataan yang baik dan benar terhadap Beliau. Sikap berpaling Beliau (tidak menanggapi) dan tidak bersikap keras terhadap sebagian besar kaum munafik yang mengemukakan uzur yang dusta adalah karena akhlaknya yang mulia dan tidak perhatian terhadap mereka serta mengikuti firman Allah Ta’ala, “Kelak mereka akan bersumpah kepadamu dengan nama Allah, apabila kamu kembali kepada mereka, agar kamu berpaling dari mereka (tidak mencela mereka). Maka berpalinglah dari mereka; karena sesungguhnya mereka itu adalah najis dan tempat mereka Jahannam; sebagai Balasan atas apa yang telah mereka kerjakan.” (Terj. At Taubah: 95) Dalam semua kabar yang mereka (kaum mukmin) sampaikan, tidak selain mereka. Di mana melalui Beliau, mereka mendapatkan petunjuk dan dengan akhlaknya yang mulia mereka dapat meniru. Baik dengan perkataan maupun dengan perbuatan. Di dunia dan akhirat, termasuk azab yang pedih pula adalah hukuman mati kepada mereka yang mencaci maki Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 61",
    "description": "Ayat sebelumnya menjelaskan tuduhan orang-orang munafik kepada rasulullah yang dianggapnya telah berbuat curang atau tidak adil berkenaan dengan pembagian zakat atau ganimah, berikut ini diuraikan kembali ucapan dan gangguan orang-orang munafik ketika berada di tengah-tengah rasulullah. Dan di antara mereka, orang-orang munafik, ada orang-orang yang menyakiti hati nabi Muhammad padahal beliau adalah sosok yang agung. Mereka telah menuduh beliau tidak adil dan juga mengatakan kepada kaum mukmin atau sesama orang munafik, nabi itu terlalu cepat untuk memercayai semua apa yang didengarnya hanya karena diperkuat dengan sumpah, padahal belum dicek kebenarannya. Namun, beliau hanya memercayai apa saja yang membawa kebaikan dan kemaslahatan umatnya. Karena itu, katakanlah, wahai nabi Muhammad, kepada mereka, memang benar, kalau dia selalu mendengarkan setiap informasi yang disampaikan kepadanya dengan penuh perhatian, namun, dia tidaklah seperti yang kamu tuduhkan itu, sebab dia hanya mempercayai semua atau apa saja yang baik bagi kamu, dia beriman kepada Allah dan tentunya juga malaikat yang menyampaikan informasi, memercayai orang-orang mukmin yang dengan iman itulah mereka terhalang untuk melakukan kebohongan dan menjadi rahmat bagi orang-orang yang beriman di antara kamu. Dan orang-orang yang menyakiti rasulullah, baik di kala beliau masih hidup maupun sudah wafat, baik dengan ucapan maupun sikap, akan mendapat azab yang pedih di akhirat kelak. Sebab, perasaan cinta itulah yang akan melahirkan penghormatan yang tulus kepada yang dicintai dan tidak akan pernah menyakitinya. Rangkaian ayat berikut ini memaparkan sifat buruk yang lain dari orang-orang munafik. Mereka bersumpah palsu kepadamu dengan nama Allah, untuk tidak turut serta dalam perang tabuk, semata-mata untuk menyenangkan kamu dan orang-orang beriman, padahal Allah dan rasulnya lebih pantas bagi mereka untuk dicari keridaan-Nya dengan menaati segala perintah Allah dan rasul-Nya meskipun berat, jika mereka benarbenar orang mukmin dengan keimanan yang mantap."
  }
]