[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik bersumpah dengan sumpah-sumpah dusta dan mengajukan alasan-alasan yang tidak karuan, supaya mereka diridoi oleh orang-orang mukmin, padahal Allah dan rasulNya lah yang lebih berhak dan lebih pantas untuk mereka dapatkan keridhaannya dengan beriman kepada keduanya dan taat kepada keduanya, jika memang mereka orang-orang mukmin yang sebenarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Orang-orang munafik itu bersumpah demi Allah di hadapan kalian -wahai orang-orang mukmin- bahwa mereka tidak pernah mengatakan sesuatu yang menyakiti nabi -ṣallallāhu 'alaihi wa sallam-. Hal itu mereka lakukan agar kalian rida kepada mereka. Padahal Allah dan rasul-Nya lebih berhak mereka harapkan ridanya dengan cara beriman dan beramal saleh, jikalau mereka benar-benar beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Hai orang-orang beriman, orang-orang munafik akan bersumpah kepada kalian dengan nama Allah bahwa mereka tidak mengatakan sesuatu yang menyakiti Rasulullah, sumpah mereka ini hanya untuk mendapat keridhaan kalian, padahal Allah dan rasul-Nya lebih utama untuk mereka cari keridhaannya, dengan beriman dan beramal saleh, jika mereka benar-benar termasuk orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. يَحْلِفُونَ بِاللهِ لَكُمْ لِيُرْضُوكُمْ (Mereka bersumpah kepada kamu dengan (nama) Allah untuk mencari keridhaanmu) Hal ini karena orang-orang munafik ketika menyendiri mereka menjelek-jelekkan Rasulullah, dan jika hal itu sampai pada orang-orang beriman, mereka datang dan bersumpah bahwa mereka tidak menjelek-jelekkan Rasulullah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَنْ يُرْضُوهُ } \"padahal Allah dan Rasul-Nya itulah yang lebih patut mereka cari keridhaannya\" jika anda memperhatikan kebanyakan manusia, sesungguhnya mereka hanya melihat dan menuntut hak mereka kepada Allah, namun mereka tidak sekali-kali memperhatikan bahwa hak Allah atas mereka lebih besar dan lebih utama, sehingga dengan demikian mereka menjauh dan memutuskan hubungan dengan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Ketika fitnahan orang-orang munafik terhadap Nabi SAW sampai kepada orang-orang mukmin, mereka akan mendatangi kalian dengan bersumpah demi Allah wahai orang-orang mukmin bahwa mereka tidak mengatakan ucapan yang telah sampai kepada kalian, untuk mendapatkan keridhaan kalian dengan menampakkan keimanan mereka, padahal Allah dan rasulNya itu lebih berhak dimintai keridhaan jika mereka benar-benar beriman. Ayat ini turun terkit perkara orang-orang munafik yang memuji orang-orang yang mengundurkan diri di perang Tabuk. Mereka berkata: “Jika saja yang dikatakan Muhammad itu benar atas saudara-saudara kita yang merupakan tuan dan orang pilihan kita, sungguh kita ini lebih buruk daripada keledai”, lalu ketika mereka ditanyai Nabi SAW, mereka mengingkarinya, lalu ayat ini turun untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah dengan (nama) Allah kepada kalian untuk membuat kalian ridha, padahal Allah dan RasulNya lebih pantas mereka (raih) keridaanNya jika mereka adalah orang-orang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Mereka bersumpah kepada kamu dengan (Nama) Allah untuk mencari keridhaanmu.” Lalu mereka mengklaim berlepas diri dari menyakiti Nabi dan lainnya yang mereka lakukan. Tujuan mereka adalah agar kamu ridha kepada mereka. “Padahal Allah dan RasulNya itulah yang lebih patut mereka cari keridhaannya jika mereka adalah orang-orang yang Mukmin.” Karena seorang Mukmin tidak mendahulukan sesuatu pun di atas ridha Allah dan RasulNya. Ini menunjukkan bahwa iman mereka tidak ada, di mana mereka mendahulukan ridha selain Allah dan RasulNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 62: Dalam perkara yang sampai kepada kamu dari mereka berupa menyakiti Rasulullah shallallahu 'alaihi wa sallam, yakni bahwa mereka tidak melakukannya, agar kamu tidak membenci mereka. Dengan menaatinya. Disebutkan dhamirnya dengan bentuk mufrad karena talazumnya (terikat bersama) dua keridhaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 62",
    "description": "Rangkaian ayat berikut ini memaparkan sifat buruk yang lain dari orang-orang munafik. Mereka bersumpah palsu kepadamu dengan nama Allah, untuk tidak turut serta dalam perang tabuk, semata-mata untuk menyenangkan kamu dan orang-orang beriman, padahal Allah dan rasulnya lebih pantas bagi mereka untuk dicari keridaan-Nya dengan menaati segala perintah Allah dan rasul-Nya meskipun berat, jika mereka benarbenar orang mukmin dengan keimanan yang mantap. Tidakkah mereka, orang-orang munafik, mengetahui betul bahwa barang siapa menentang, tidak menaati perintah Allah dan perintah rasulnya serta menyakiti hatinya, maka sesungguhnya neraka jahanamlah baginya, dia kekal di dalamnya. Itulah kehinaan dan kecelakaan yang besar."
  }
]