[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah orang-orang munafik itu , mengetahui bahwa tempat kembali orang-orang yang memerangi Allah dan rasulNya adalah neraka jahanam, yang merupakan tempat mereka mendapatkan siksaaan abadi di dalamya? tempat kembali tersebut merupakan tempat kehinaan dan kenistaan yang besar. Dan diantara bentuk memerangi adalah melancarkan gangguan terhadap rasulullah dengan mencela dan merendahkan kehormatannya. Kita berlindung Hanya kepada Allah dari hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Tidakkah orang-orang munafik itu menyadari bahwa dengan perbuatan mereka itu berarti mereka sedang melawan Allah dan rasul-Nya, dan bahwa orang yang melawan Allah dan rasul-Nya kelak akan masuk ke dalam Neraka Jahanam di hari Kiamat untuk selama-lamanya? Itulah kehinaan dan kenistaan yang besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Tidakkah orang-orang munafik itu mengetahui bahwa perbuatan mereka itu telah menjadikan mereka memusuhi Allah dan rasul-Nya; dan barangsiapa yang memusuhi Allah dan rasul-Nya, pada hari kiamat akan masuk neraka jahanam selama-lamanya, dan itulah kehinaan yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَلَمْ يَعْلَمُوٓا۟ أَنَّهُۥ مَن يُحَادِدِ اللهَ وَرَسُولَهُۥ (Tidaklah mereka (orang-orang munafik itu) mengetahui bahwasanya barangsiapa menentang Allah dan Rasul-Nya) Yakni yang menentang keduanya. ذٰلِكَ (Itu adalah) Yakni azab itu. الْخِزْىُ الْعَظِيمُ(kehinaan yang besar) Yakni kehinaan dan kerendahan apabila menimpa orang yang angkuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Apakah orang-orang munafik itu tidak tahu bahwa barangsiapa menentang Allah dan rasulullah, maka baginya itu neraka Jahannam, mereka abadi di dalamnya. Azab tersebut sangat rendah dan hina."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak mengetahui bahwa siapa yang menentang} mendurhakai dan menentang {Allah dan RasulNya, maka sesungguhnya neraka Jahanam baginya. dia kekal di dalamnya. Itulah kehinaan} kerendahan dan kehinaan {yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Ini adalah penentangan dan permusuhan kepada Allah, dan Allah telah mengancam orang yang menentangnya dengan FirmanNya, “Tidakkah mereka (orang-orang munafik itu) mengetahui bahwasanya barangsiapa menentang Allah dan RasulNya,” di mana dia berada di jalur dan jalan yang menjauhkan dari Allah dan RasulNya, dengan meremehkan perintah Allah dan melakukan laranganNya, “maka sesungguhnya Neraka Jahanamlah baginya, dia kekal di dalamnya,” dan “itu adalah kehinaan yang besar”, yang tiada kehinaan yang lebih buruk dan lebih jelek daripadanya, di mana mereka kehilangan nikmat yang kekal, dan meraih azab Neraka Jahim. Kita berlindung kepada Allah dari keadaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 63",
    "description": "Tidakkah mereka, orang-orang munafik, mengetahui betul bahwa barang siapa menentang, tidak menaati perintah Allah dan perintah rasulnya serta menyakiti hatinya, maka sesungguhnya neraka jahanamlah baginya, dia kekal di dalamnya. Itulah kehinaan dan kecelakaan yang besarorang-orang munafik itu sadar bahwa sesungguhnya mereka bohong, sehingga mereka takut jika diturunkan suatu surah yang menerangkan, mengungkap, dan membeberkan apa yang tersembunyi di dalam hati mereka yang tidak sesuai dengan ucapan dan perilakunya. Katakanlah, wahai nabi Muhammad, kepada mereka, teruskanlah berolok-olok terhadap Allah dan rasul-Nya sesuka hatimu. Sesungguhnya Allah akan menurunkan ayat-ayat-Nya kepada rasul-Nya untuk mengungkapkan apa yang kamu takuti untuk diungkap itu, yakni sikap kemu-nafikanmu."
  }
]