[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik takut akan turun terkait kelakuan mereka suatu surat yang menerangkan apa yang mereka sembunyikan di dalam hati-hati mereka berupa kekafiran. Katakanlah kepada mereka (wahai nabi), ”bertahanlah kalian di atas perbuatan kalian berupa kebiasaan mengolok-ngolok dan menertawakan, sesungguhnya Allah akan mengungkapkan hakikat perkara yang kalian khawatirkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Orang-orang munafik itu takut jikalau Allah akan menurunkan kepada rasul-Nya satu surah yang memberitahukan kepada orang-orang mukmin perihal kekafiran yang mereka sembunyikan di dalam hati mereka. Katakanlah -wahai Rasul- kepada mereka, \"Teruslah kalian -wahai orang-orang munafik- mengolok-olok agama. Karena Allah akan menyingkap apa yang kalian takutkan dengan cara menurunkan surah atau memberitahu rasul-Nya tentang hal itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Setelah Allah menjelaskan perbuatan orang-orang munafik yang suka menghina, kemudian Allah menjelaskan kelompok lain dari orang-orang munafik yang lebih ringan kemunafikannya dan masih mendekati keimanan. Dia berfirman: \"Orang-orang munafik khawatir Jika Allah menurunkan kepada rasul-Nya satu surat yang memberitahukan kekafiran yang mereka sembunyikan kepada orang-orang beriman. Hai Rasulullah Katakanlah, hai orang-orang munafik, teruslah menghina dan mencela, karena Allah akan melakukan apa yang kalian takutkan dengan menurunkan suatu surat atau memberitahu Rasulullah tentang hal itu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. يَحْذَرُ الْمُنٰفِقُونَ أَن تُنَزَّلَ عَلَيْهِمْ سُورَةٌ (Orang-orang yang munafik itu takut akan diturunkan terhadap mereka sesuatu surat) Yakni diturunkan kepada Rasulullah tentang urusan orang-orang munafik. تُنَبِّئُهُم(yang menerangkan) Urusan mereka tersebut. بِمَا فِى قُلُوبِهِمْ ۚ( apa yang tersembunyi dalam hati mereka) Tentang apa yang mereka sembunyikan dan terlebih lagi tentang apa yang mereka nampakkan. Yakni menampakkan kepada mereka bahwa orang-orang beriman telah mengetahui apa yang ada dalam hati orang-orang munafik tersebut. قُلِ اسْتَهْزِءُوٓا۟ إِنَّ اللهَ مُخْرِجٌ مَّا تَحْذَرُونَ(Katakanlah kepada mereka: “Teruskanlah ejekan-ejekanmu (terhadap Allah dan rasul-Nya)”. Sesungguhnya Allah akan menyatakan apa yang kamu takuti itu) Baik itu dengan munurunkan sebuah surat al-Qur’an atau dengan memberitahu Rasulullah tentang hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Orang-orang munafik itu khawatir dan takut bila Allah menurunkan untuk mereka surah yang memberitahu orang-orang mukmin tentang kemunafikan dalam hati mereka, dan menampakkan kepada orang-orang mukmin tentang sesuatu dalam diri mereka. Wahai Rasullah, katakanlah kepada mereka dengan memberi ancaman: “Teruslah mengejek sesuai kehendak kalian, sesungguhnya Allah akan menampakkaan apa yang kalian takutkan untuk ditampakkan, yaitu kemunafikan” As-Sadiy berkata: “Sebagian orang-orang munafik berkata:” Demi Allah, saya lebih suka bila aku didera seratus kali, lalu tidak diturunkan di antara kita ayat yang membongkar rahasia kita.” Lalu Allah menurunkan ayat ini.” Hal ini menunjukkan tentang keimanan mereka, bahwa rasulullah benar-benar menerima wahyu dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang munafik khawatir} takut {jika diturunkan suatu surah yang mengungkapkan kepada mereka} memberitahu kepada mereka {apa yang ada dalam hati mereka. Katakanlah,“Olok-oloklah. Sesungguhnya Allah pasti akan mengeluarkan} menampakkan {apa yang kalian khawatirkan itu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Surat yang mulia ini dulunya dinamakan al-Fadhihah karena ia membongkar rahasia orang-orang munafik dan membuka kedok mereka. Allah berfirman, “Di antara mereka, di antara mereka …” dan menjelaskan sifat-sifat mereka. Hanya saja Dia tidak menyebut perindividu mereka karena dua faidah: Pertama: Allah Maha Menutupi, Dia menyukai menutup aib hambaNya. Kedua: Bahwa celaannya ditujukan kepada siapa saja yang memiliki sifat tersebut, baik dari kalangan orang-orang munafik yang di mana Firman Allah pertama kali tertuju padanya dan juga kepada selain mereka sampai Hari Kiamat. Maka menyebut sifat (tanpa pelakunya) lebih umum dan lebih sesuai agar mereka benar-benar takut. Allah berfirman, \"Sesungguhnya jika tidak berhenti orang-orang munafik, orang-orang yang berpenyakit dalam hatinya dan orang-orang yang menyebarkan kabar bohong di Madinah (dari menyakitimu), niscaya Kami perintahkan kamu (untuk memerangi) mereka, kemudian mereka tidak menjadi tetanggamu (di Madinah) melainkan dalam waktu yang sebentar, dalam keadaan terlaknat. Di mana saja mereka dijumpai, mereka ditangkap dan dibunuh dengan sehebat-hebatnya.\"(Al-Ahzab:60-61). Dia berfirman disini, “Orang-orang yang munafik itu takut akan diturunkan terhadap mereka sesuatu surat yang menerangkan apa yang tersembunyi dalam hati mereka.” Yakni yang memberitakan dan membuka kedok serta menjelaskan rahasia-rahasia mereka sehingga ia menjadi terbuka bagi hamba-hamba Allah dan menjadi pelajaran bagi orang yang mengambil pelajaran. “Katakanlah kepada mereka, ‘Teruskanlah ejekan-ejekanmu (terhadap Allah dan RasulNya)’.” Yakni lanjutkan ejekanmu dan hinaanmu yang kamu lakukan. “Sesungguhnya Allah akan menyatakan apa yang kamu takuti itu.” Allah telah memenuhi janjiNya. Dia menurunkan surat yang menjelaskan keadaan mereka dan membongkar aib mereka serta membuka kedok mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 64: Surat At Taubah disebut sebagai surat Al Faadhihah (membuka aib), karena dalam surat ini disebutkan rahasia-rahasia yang disembunyikan oleh kaum munafik. Allah Subhaanahu wa Ta'aala senantiasa menyebutkan, “Dan di antara mereka… dst.”, menyebutkan sifat-sifat mereka, hanya saja Dia tidak menyebutkan secara ta’yin (orang perorang) karena beberapa faedah, di antaranya: - Allah Subhaanahu wa Ta'aala adalah As Sittir, Dia suka menutupi aib hamba-hamba-Nya. - Celaan yang Allah sebutkan tidak hanya mengena kepada kaum munafik di waktu itu saja, tetapi mengena pula kepada selain mereka (kaum munafik yang datang setelahnya) sampai hari kiamat. - Tidak membuat mereka berputus asa dari bertobat. Berupa kemunafikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 64",
    "description": "Orang-orang munafik itu sadar bahwa sesungguhnya mereka bohong, sehingga mereka takut jika diturunkan suatu surah yang menerangkan, mengungkap, dan membeberkan apa yang tersembunyi di dalam hati mereka yang tidak sesuai dengan ucapan dan perilakunya. Katakanlah, wahai nabi Muhammad, kepada mereka, teruskanlah berolok-olok terhadap Allah dan rasul-Nya sesuka hatimu. Sesungguhnya Allah akan menurunkan ayat-ayat-Nya kepada rasul-Nya untuk mengungkapkan apa yang kamu takuti untuk diungkap itu, yakni sikap kemu-nafikanmu. Kalaulah suatu saat sikap buruk mereka terungkap yang berakibat munculnya kecaman dari orang-orang mukmin, maka mereka akan berdalih seperti diungkap pada ayat ini. Dan jika kamu, wahai nabi Muhammad, dan siapa saja menanyakan kepada mereka tentang sikap dan ucapan mereka itu, niscaya mereka akan menjawab, sesungguhnya kami, dengan ucapan-ucapan itu hanya bersenda-gurau dan bermain-main saja. Kami tidak sungguh-sungguh mengolok-olok. Atas jawaban itu, mereka justru dikecam dan bahkan Allah memerintahkan rasul-Nya. Katakanlah, kepada mereka, mengapa kepada Allah dan ayat-ayat-Nya serta rasul-Nya kamu selalu berolo."
  }
]