[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kamu bertanya kepada mereka (wahai nabi), tentang apa yang mereka ucapkan berupa penghinaan terhadap kehormatanmu dan kehormatan sahabat-sahabtmu, tentulah mereka benar-benar akan mengatakan, ”sesungguhnya kami hanya sekedar berbicara dengan ucapan yang tidak ada kesengajaan dari kami padanya.” Katakanlah kepada mereka (wahai nabi), ”apakah kepada Allah , ayat-ayatNya dan rasulNya kalian mengolok-ngolok?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Sungguh jikalau kamu -wahai Rasul- bertanya kepada orang-orang munafik tentang tuduhan dan celaan yang mereka layangkan kepada orang-orang mukmin setelah Allah memberitahukan hal itu kepadamu, pasti mereka akan menjawab, \"Ketika itu kami hanya bercanda dan tidak bersungguh-sungguh.\" Katakanlah -wahai Rasul- kepada mereka, \"Apakah Allah, ayat-ayat-Nya, dan rasul-Nya kalian jadikan sebagai bahan olok-olok?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Hai Rasulallah, jika kamu bertanya kepada orang-orang munafik itu tentang tuduhan yang mereka katakan dan hinaan mereka terhadap orang-orang beriman setelah Allah memberitahumu tentang itu, niscaya mereka akan menjawab: 'Sesungguhnya kami hanya bergurau dalam perkataan itu'. Hai Rasulullah katakanlah kepada mereka: \"Apakah Allah, ayat ayatnya, dan rasulnya kalian jadikan sebagai bahan gurauan dan hinaan?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَلَئِن سَأَلْتَهُمْ (Dan jika kamu tanyakan kepada mereka) Tentang tuduhan terhadap agama yang mereka katakan dan hinaan mereka terhadap orang-orang beriman setelah Allah menjelaskan kepadamu tentang hal itu. لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ ۚ( tentulah mereka akan manjawab, “Sesungguhnya kami hanyalah bersenda gurau dan bermain-main saja”) Dan kami sama sekali tidak berbicara tentang kamu atau orang-orang beriman. قُلْ أَبِاللهِ وَءَايٰتِهِۦ وَرَسُولِهِۦ كُنتُمْ تَسْتَهْزِءُونَ(Katakanlah: “Apakah dengan Allah, ayat-ayat-Nya dan Rasul-Nya kamu selalu berolok-olok?”) Rasulullah tidak menerima pengingkaran mereka sebab mereka berdusta dalam mengungkapkannya, namun menganggap mereka seakan-akan telah mengakui perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Wahai Nabi, jika kamu bertanya kepada orang-orang munafik tentang ejekan mereka terhadap agama, Al-Qur’an dan terhadapmu di tengah perjalananmu menuju perang Tabuk, sungguh mereka akan berkata seraya meminta maaf: “Sesungguhnya kami bercakap-cakap sebagai hiburan dan bergembira agar perjalanannya tidak terasa” Katakanlah kepada mereka: “Apakah kalian mengolok-olok dengan nama Allah, ayat-ayatNya dan rasulNya? Bukankah kalian punya hal lain untuk dibicarakan selain itu?” Ini untuk menggagalkan keingkaran mereka dan memaksa mereka mengakui hal tersebut. Ayat ini turun terkait orang-orang munafik di perang Tabuk yang berkata: “Apakah lelaki ini berharap menaklukkan kerajaan-kerajaan dan benteng-benteng negeri Syam? Mustahil itu dilakukan olehnya” Lalu Allah menampakkan hal tersebut kepada nabiNya dan menanyakannya kepada mereka, lalu menjawab: “Wahai Rasulullah, Sesungguhnya kami hanya bersenda gurau dan bersenang-senang saja” Kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya jika kalian menanyakan kepada mereka, mereka pasti akan menjawab,“Sesungguhnya kami hanya bersenda gurau} bersenda gurau dalam percakapan supaya jarak perjalanan terasa pendek {dan bermain-main”} bercanda {Katakanlah,“Apakah terhadap Allah, ayat-ayatNya, dan RasulNya kalian selalu mengolok-olok”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-66. “Dan jika kamu tanyakan kepada mereka (tentang apa yang mereka lakukan itu)”, tentang hinaan mereka terhadap kaum Muslimin dan agama mereka. Sekelompok dari mereka berkata di perang Tabuk, “Kami tidak melihat seperti para qari kami itu –maksudnya adalah Nabi dan sahabat-sahabatnya – paling besar perutnya, paling dusta ucapannya, dan paling penakut pada saat perang… dan ejekan-ejekan lain semisalnya. Ketika mereka mengetahui bahwa Nabi telah mengetahui apa yang mereka katakan, mereka datang meminta maaf dan berkata, “Sesungguhnya kami hanyalah bersenda gurau dan bermain-main saja.” Yakni kami mengatakan ucapan yang kami tidak bermaksud mencela dan menghina. Allah membantah dengan menjelaskan ketidakbenaran alasan mereka dan kebohongan mereka dalam hal itu. “Katakanlah”, kepada mereka, ‘Apakah dengan Allah, ayat-ayatNya, dan RasulNya kamu selalu berolok-olok?’ tidak usah kamu meminta maaf, karena kamu kafir sesudah beriman.” Karena mengolok-olok Allah dan RasulNya adalah kekufuran yang mengeluarkan dari Islam, Karena pondasi Islam terbangun di atas sikap pengaguman Allah, agama dan RasulNya, sementara memperolok-olok sesuatu darinya sangat bertentangan dan bertabrakan dengan pondasi utama ini, oleh karena itu, begitu mereka datang kepada Rasul untuk meminta maaf dengan ucapan itu, Rasul hanya menjawab, “Apakah dengan Allah, ayat-ayatNya, dan Rasul kamu selalu berolok-olok?’ tidak usah kamu meminta maaf, karena kamu kafir sesudah beriman.” FirmanNya, “jika kami memaafkan segolongan dari kamu (lantaran mereka taubat)”, menyesal dan memohon ampunan kepada Allah, “niscaya kami akan mengazab golongan-golongan yang lain,” dari kalian di sebabkan mereka “adalah orang-orang yang selalu berbuat dosa”, dan selalu berdiri di atas kekufuran dan kemunafikan. Ayat-ayat ini menunjukan bahwa barangsiapa menyimpan rahasia buruk, khususnya rahasia makar terhadap agamaNya, mengolok-olokNya, ayat-ayatNya, serta RasulNya, maka Allah akan menampakkannya, membeberkannya, dan menghukum pelakunya dengan keras. Dan bahwa barangsiapa yang menghina sesuatu dari Kitabullah atau Sunnah Rasul yang shahih darinya atau memperolok-olok Rasul atau merendahkannya, maka dia adalah kafir kepada Allah yang Maha Agung, dan bahwa taubat akan di terima dari segala dosa, meskipun dosa itu besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 65: Ibnu Abi Hatim meriwayatkan dari Abdullah bin Umar radhiyallahu 'anhuma ia berkata, “Suatu hari ada seseorang yang berkata dalam perang Tabuk di sebuah majlis, “Saya belum pernah melihat orang yang lebih rakus perutnya, lebih dusta lisannya dan lebih pengecut ketika menghadapi musuh daripada para pembaca Al Qur’an ini, “ lalu ada seseorang yang berkata di majlis itu, “Engkau dusta, engkau adalah munafik, saya akan menyampaikan kepada Rasulullah shallallahu 'alaihi wa sallam.” Maka sampailah berita itu kepada Rasulullah shallallahu 'alaihi wa sallam dan ayat Al Qur’an pun turun. Abdullah berkata, “Saya melihat orang itu berpegangan dengan sabuk unta Rasulullah shallallahu 'alaihi wa sallam dalam keadaan tersandung oleh batu, sambil berkata, “Wahai Rasulullah, kami hanya bersenda gurau dan bermain-main saja.” Sedangkan Rasulullah shallallahu 'alaihi wa sallam bersabda, “Mengapa kepada Allah, dan ayat-ayat-Nya serta Rasul-Nya kamu selalu berolok-olok?\" (Hadits ini para perawinya adalah para perawi kitab shahih selain Hisyam bin Sa’ad, maka Muslim tidak memakainya selain hanya sebagai syahid (penguat) sebagaimana diterangkan dalam Al Mizan. Hadits ini disebutkan pula oleh Thabari dari jalannya juz 10 hal. 172. Hadits ini memiliki syahid yang hasan dalam riwayat Ibnu Abi Hatim juz 4 hal. 64 dari hadits Ka’ab bin Malik). Untuk mengisi waktu kosong di perjalanan dan tidak sengaja mengucapkan demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 65",
    "description": "Kalaulah suatu saat sikap buruk mereka terungkap yang berakibat munculnya kecaman dari orang-orang mukmin, maka mereka akan berdalih seperti diungkap pada ayat ini. Dan jika kamu, wahai nabi Muhammad, dan siapa saja menanyakan kepada mereka tentang sikap dan ucapan mereka itu, niscaya mereka akan menjawab, sesungguhnya kami, dengan ucapan-ucapan itu hanya bersenda-gurau dan bermain-main saja. Kami tidak sungguh-sungguh mengolok-olok. Atas jawaban itu, mereka justru dikecam dan bahkan Allah memerintahkan rasul-Nya. Katakanlah, kepada mereka, mengapa kepada Allah dan ayat-ayat-Nya serta rasul-Nya kamu selalu beroloatas sikap dan perilaku burukmu itu tidak perlu kamu meminta maaf kepada siapa pun, sebab kamu sejatinya sudah tahu kalau alasan yang kamu ajukan itu tidak benar. Meski kamu mengajukan seribu satu alasan, kamu tetap tidak bisa terselamatkan dari dosa besar, karena kamu dengan sikapmu itu telah benar-benar kafir setelah kamu menampakkan dirimu sebagai orang beriman. Jika kami memaafkan sebagian dari kamu karena telah tobat, niscaya kami akan tetap mengazab golongan yang lain karena sesungguhnya mereka adalah orang-orang yang selalu berbuat dosa yang menjadikan mereka terhalang dari bertobat."
  }
]