[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah kalian mencari alasan (wahai kaum munafik), tidak ada gunanya alasan kalian. Sebab, sesungguhnya kalian telah kafir dengan ucapan yang kalian lontarkan sebagai bahan olokan tersebut. Bila kami memaafkan segolongan dari kalian yang meminta maaf dan ikhlas dalam bertaubat, kami akan tetap menyiksa golongan lain disebabkan kejahatan buruk mereka dengan ucapan jahat lagi salah tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Janganlah kalian mengemukakan alasan-alasan palsu tersebut. Karena kalian telah memperlihatkan kekafiran dengan olok-olok itu setelah kalian menyembunyikannya. Apabila Kami mengampuni sebagian dari kalian karena telah meninggalkan kemunafikannya, bertobat darinya dan menunjukkan keikhlasannya kepada Allah, maka Kami akan menghukum sebagian dari kalian karena kekerasan hatinya dalam mempertahankan kemunafikannya dan tidak mau bertobat darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Setelah Allah menyifati mereka sebagai orang-orang munafik, Allah menegaskan hal itu dengan sifat mereka yang tidak bersegera untuk bertaubat, padahal bertaubat adalah sifat seorang mukmin; dan mereka juga sangat berani membantah, padahal yang berkata kepada mereka adalah orang yang sangat mulia dan sempurna. Kemudian Allah berfirman: \"Janganlah kalian beralasan dengan alasan-alasan bohong ini, karena kekafiran kalian yang dahulu kalian sembunyikan telah tampak dengan hinaan yang kalian lakukan. Jika Kami mengampuni sebagian dari kalian karena telah meninggalkan kemunafikan dan bertaubat darinya, maka Kami akan mengazab sebagian kalian yang tetap berada dalam kemunafikan dan enggan bertaubat darinya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. لَا تَعْتَذِرُوا۟ (Tidak usah kamu minta maaf) Karena hal itu tidak diterima dari kalian. قَدْ كَفَرْتُم (karena kamu kafir) Yakni kalian telah menunjukkan kekafiran dengan melakukan olok-olok tersebut. بَعْدَ إِيمٰنِكُمْ ۚ (sesudah beriman) Setelah kalian menampakkan keimanan. إِن نَّعْفُ عَن طَآئِفَةٍ مِّنكُمْ(Jika Kami memaafkan segolongan kamu (lantaran mereka taubat)) Mereka adalah orang-orang yang memurnikan keimanan mereka dan meninggalkan sifat kemunafikan serta bertaubat dari hal itu. نُعَذِّبْ طَآئِفَةًۢ بِأَنَّهُمْ كَانُوا۟ مُجْرِمِينَ(niscaya Kami akan mengazab golongan (yang lain) disebabkan mereka adalah orang-orang yang selalu berbuat dosa) Sebab mereka berlarut-larut dalam kemunafikan dan tidak bertaubat. Abdullah bin Umar berkata: suatu hari seseorang berkata di suatu perkumpulan saat perang Tabuk: “kami tidak pernah melihat orang yang lebih menyukai makan, lebih pendusta lisannya, dan lebih pengecut dalam menghadapi musuh, memebihi para pembaca al-Qur’an itu”. Maka seseorang dalam perkumpulan itu menjawab: “kamu telah berdusta, dan kau adalah orang munafik! Sungguh aku akan memberitahu Rasulullah”. Lalu ia menyampaikannya kepada Rasulullah. Maka turunlah al-Qur’an. Abdullah bin Umar melanjutkan: “maka aku melihat orang tersebut menggantung pada tali dari unta Rasulullah dan bebatuan tertendang-tendang kakinya hingga berdarah, seraya ia berkata: “Wahai Rasulullah, Sesungguhnya kami hanya bersenda gurau dan bermain-main saja”. Rasulullah menjawab: “Apakah dengan Allah, ayat-ayat-Nya dan Rasul-Nya kamu selalu berolok-olok?”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kecintaan seseorang kepada Allah dan rasul-Nya adalah lumrah dan pasti ada dalam hati setiap mukmin, dan ia tidak mungkin menolak cinta itu jika ia benar-benar beriman, dan diantara bukti adanya kecintaan itu ketika ia mendapati seseorang menghina Rasulullah atau berusaha mencelakai beliau, atau seseorang menghina Allah dan mengatakan sesuatu yang tidak pantas ia ucapkan untuk Allah; maka bagi seorang mukmin ia harus marah atas penghinaan itu melebihi marahnya ia ketika sesorang menghina ayahnya atau ibunya. 2 ). As-Sa'di dalam tafsirnya mengatakan : Penghinaan itu menghilangkan pengagungan, penghinaan kepada Allah adalah kufur yang dapat mengeluarkan seseorang dan agama ini; karena asal agama dibagun diatas pengagungan kepada Allah dan pengagungan terhadap agama dan rasul-Nya, maka penghinaan ini benar-benar menyalahi asal agama ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Janganlah meminta maaf wahai orang-orang munafik. Permohonan maaf kalian itu tidak diterima. Sungguh kalian telah kufur dengan ejekan tersebut, meskipun usai menyatakan keimanan kalian. Jika Kami memaafkan segolongan dari kalian yang bertaubat dan meninggalkan kemunafikan (Ini adalah dorongan untuk bertaubat), niscaya Kami akan mengazab golongan lainnya karena kejahatan dan keteguhan mereka atas kekufuran serta tidak mau bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian membuat-buat alasan karena kalian telah kafir sesudah beriman} kalian menampakkan kekufuran dengan mengolok-olok kalian setelah kalian menampakkan keimanan {Jika Kami memaafkan} membiarkan {sebagian dari kalian, niscaya Kami akan mengazab golongan lain, karena sesungguhnya mereka adalah orang-orang yang berbuat dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-66. “Dan jika kamu tanyakan kepada mereka (tentang apa yang mereka lakukan itu)”, tentang hinaan mereka terhadap kaum Muslimin dan agama mereka. Sekelompok dari mereka berkata di perang Tabuk, “Kami tidak melihat seperti para qari kami itu –maksudnya adalah Nabi dan sahabat-sahabatnya – paling besar perutnya, paling dusta ucapannya, dan paling penakut pada saat perang… dan ejekan-ejekan lain semisalnya. Ketika mereka mengetahui bahwa Nabi telah mengetahui apa yang mereka katakan, mereka datang meminta maaf dan berkata, “Sesungguhnya kami hanyalah bersenda gurau dan bermain-main saja.” Yakni kami mengatakan ucapan yang kami tidak bermaksud mencela dan menghina. Allah membantah dengan menjelaskan ketidakbenaran alasan mereka dan kebohongan mereka dalam hal itu. “Katakanlah”, kepada mereka, ‘Apakah dengan Allah, ayat-ayatNya, dan RasulNya kamu selalu berolok-olok?’ tidak usah kamu meminta maaf, karena kamu kafir sesudah beriman.” Karena mengolok-olok Allah dan RasulNya adalah kekufuran yang mengeluarkan dari Islam, Karena pondasi Islam terbangun di atas sikap pengaguman Allah, agama dan RasulNya, sementara memperolok-olok sesuatu darinya sangat bertentangan dan bertabrakan dengan pondasi utama ini, oleh karena itu, begitu mereka datang kepada Rasul untuk meminta maaf dengan ucapan itu, Rasul hanya menjawab, “Apakah dengan Allah, ayat-ayatNya, dan Rasul kamu selalu berolok-olok?’ tidak usah kamu meminta maaf, karena kamu kafir sesudah beriman.” FirmanNya, “jika kami memaafkan segolongan dari kamu (lantaran mereka taubat)”, menyesal dan memohon ampunan kepada Allah, “niscaya kami akan mengazab golongan-golongan yang lain,” dari kalian di sebabkan mereka “adalah orang-orang yang selalu berbuat dosa”, dan selalu berdiri di atas kekufuran dan kemunafikan. Ayat-ayat ini menunjukan bahwa barangsiapa menyimpan rahasia buruk, khususnya rahasia makar terhadap agamaNya, mengolok-olokNya, ayat-ayatNya, serta RasulNya, maka Allah akan menampakkannya, membeberkannya, dan menghukum pelakunya dengan keras. Dan bahwa barangsiapa yang menghina sesuatu dari Kitabullah atau Sunnah Rasul yang shahih darinya atau memperolok-olok Rasul atau merendahkannya, maka dia adalah kafir kepada Allah yang Maha Agung, dan bahwa taubat akan di terima dari segala dosa, meskipun dosa itu besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 66: Hal itu, karena mengolok-olok Allah, ayat-ayat-Nya dan Rasul-Nya merupakan kekafiran yang mengeluarkan dari Islam, karena agama dibangun di atas dasar pengagungan kepada Allah, agama-Nya dan Rasul-Nya, sedangkan mengolok-olok bertentangan dengan dasar ini dan sangat berlawanan sekali. Oleh karena itulah, ketika kaum munafik itu datang kepada Rasulullah shallallahu 'alaihi wa sallam meminta maaf terhadap ucapan ini, Rasulullah shallallahu 'alaihi wa sallam membacakan ayat di atas, “Mengapa kepada Allah, dan ayat-ayat-Nya serta Rasul-Nya kamu selalu berolok-olok? Tidak perlu kamu meminta maaf, karena kamu telah kafir setelah beriman\" Beliau tidak menoleh kepadanya dan tidak berkata lebih. Ayat ini juga menunjukkan bahwa di antara permintaan maaf, ada yang tidak pantas diterima maafnya, yakni jika dimaafkan bukan malah memperbaiki dirinya, tetapi malah semakin jauh dari kebaikan. Meskipun hukum asalnya, jika ada yang meminta maaf harus dikasihani dan dimaafkan, namun orang yang seperti ini tidak layak dimaafkan. Yakni tidak bisa dima’afkan semuanya dan segolongan di antara kamu perlu dihukum. Meskipun kalau mereka bertobat, maka tobatnya diterima. Dalam ayat ini juga terdapat dalil bahwa barang siapa yang membicarakan secara rahasia yang isinya membuat makar terhadap agama, mengolok-olok Allah, ayat-ayat-Nya dan Rasul-Nya, maka Allah Subhaanahu wa Ta'aala akan menampakkannya dan membuka aibnya serta menghukumnya dengan hukuman yang berat. Demikian pula terdapat dalil bahwa mengolok-olok salah satu dari kitabullah atau sunnah Rasul-Nya yang sahih, melecehkanya, merendahkannya, atau mengolok-olok Rasulullah shallallahu 'alaihi wa sallam atau merendahkannya, maka dia kafir kepada Allah. Di samping itu, ayat di atas juga menunjukkan bahwa tobat diterima dalam semua dosa meskipun besar. Selalu berbuat kufur dan nifak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 66",
    "description": "Atas sikap dan perilaku burukmu itu tidak perlu kamu meminta maaf kepada siapa pun, sebab kamu sejatinya sudah tahu kalau alasan yang kamu ajukan itu tidak benar. Meski kamu mengajukan seribu satu alasan, kamu tetap tidak bisa terselamatkan dari dosa besar, karena kamu dengan sikapmu itu telah benar-benar kafir setelah kamu menampakkan dirimu sebagai orang beriman. Jika kami memaafkan sebagian dari kamu karena telah tobat, niscaya kami akan tetap mengazab golongan yang lain karena sesungguhnya mereka adalah orang-orang yang selalu berbuat dosa yang menjadikan mereka terhalang dari bertobat. Setelah memaparkan beberapa perilaku buruk orang-orang munafik, ayat ini menerangkan kesamaan orang munafik laki-laki dan perempuan dalam hal sifat, sikap, perilaku dan akhlak. Orang-orang munafik laki-laki dan perempuan, satu dengan yang lain adalah memiliki kesamaan, yaitu mereka senantiasa menyuruh berbuat yang mungkar dan mencegah perbuatan yang makruf dan mereka selalu menggenggamkan tangannya karena kekikirannya. Mereka telah melupakan kebesaran Allah, petunjuk-petunjuk agama-Nya. Mereka juga lupa kalau semua perilaku buruknya akan mendapatkan balasan di akhirat kelak, maka Allah juga akan melupakan mereka di akhirat kelak dengan menjauhkan mereka dari rahmat-Nya. Sesungguhnya orang-orang munafik yang sudah jelas kemunafikannya itulah orang-orang yang fasik, yakni orang-orang yang benar-benar keluar dari ketaatan kepada Allah, bahkan sifat buruk mereka melebihi orang-orang kafir."
  }
]