[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik laki-laki dan orang-orang munafik perempuan adalah sama dalam hal mengumumkan keimanan dan menyembunyikan kekafiran, mereka memerintahkan kekafiran kepada Allah dan mendurhakai rasulNya, melarang dari keimanan dan ketaatan, menahan tangan mereka untuk berinfak di jalan Allah. Mereka lupa kepada Allah, tidak mengingat-ingatNya, maka Dia pun melupakan mereka dari rahmatNya, Dia tidak memberikan taufik kepada mereka menuju kebaikan. Sesungguhnya orang-orang munafik adalah orang-orang yang telah keluar dari keimanan kepada Allah dan rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Orang-orang munafik laki-laki dan wanita memiliki kesamaan dalam hal kemunafikan. Sifat mereka bertolak belakang dengan orang-orang mukmin. Karena orang-orang munafik itu gemar menyuruh berbuat mungkar dan mencegah berbuat yang makruf. Mereka kikir dengan harta mereka, sehingga mereka tidak mau mendermakannya di jalan Allah. Mereka tidak patuh kepada Allah, sehingga, maka Allah tidak memberikannya petunjuk ke jalan yang benar. Sesungguhnya orang-orang munafik itu tidak taat kepada Allah dan keluar dari jalan yang benar ke jalan maksiat dan jalan yang sesat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Orang-orang munafik dari kaum laki-laki dan perempuan memiliki sifat yang sama, mereka kebalikan dari orang-orang beriman. Mereka memerintahkan orang lain untuk berbuat kemungkaran dan melarang perbuatan baik serta sangat kikir sehingga mereka tidak menginfakkan harta mereka di jalan Allah. Mereka berpaling dan lalai dari Allah sehingga mereka hanya sedikit sekali mengingat Allah, maka Allah pun melalaikan mereka dari rahmat-Nya. Sesungguhnya orang-orang munafik itu telah keluar dari ketaatan Allah dan dari jalan kebenaran menuju kemaksiatan dan jalan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. الْمُنٰفِقُونَ وَالْمُنٰفِقٰتُ بَعْضُهُم مِّنۢ بَعْضٍ ۚ (Orang-orang munafik laki-laki dan perempuan. sebagian dengan sebagian yang lain adalah sama) Laki-laki dari mereka seperti wanita mereka, keadaan mereka sama, mereka sangat munafik dan jauh dari keimanan. وَيَقْبِضُونَ أَيْدِيَهُمْ ۚ (dan mereka menggenggamkan tangannya) Yakni mereka pelit dan kikir untuk mengeluarkan harta mereka untuk berzakat, menyambung silaturrahim, dan berjihad. نَسُوا۟ اللهَ(Mereka telah lupa kepada Allah) Sehingga tidak terbesit dalam pikiran mereka tentang ketakwaan kepada-Nya. فَنَسِيَهُمْ ۗ( maka Allah melupakan mereka) Yakni melalaikan mereka dari rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Orang-orang munafik laki-laki dan perempuan itu saling serupa sifat kemunafikannya dan jaraknya yang jauh dari keimanan. Mereka menahan diri untuk berinfak di jalan Allah seperti jihad, silaturahim dan sedekah. Mereka tidak taat kepada Allah, sehingga Dia mengabaikan mereka dari rahmat dan pahalaNya. Sesungguhnya orang-orang munafik itu orang-orang yang membangkang dan tidak mau taat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang munafik laki-laki dan perempuan, satu bagian dengan yang lain} perkara mereka satu untuk berkumpul atas kemunafikan {Mereka menyuruh pada kemungkaran dan mencegah dari perbuatan yang baik. Mereka menggenggam tangannya mereka} mereka menggenggam tangan mereka untuk untuk berinfak di jalan Allah {Mereka telah melupakan Allah, maka Allah melupakan mereka} mereka meninggalkan ketaatan kepada Allah, maka Allah tidak memberi tuntunan dan petunjuk kepada mereka {Sesungguhnya orang-orang munafik adalah orang-orang yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Allah berfirman, “orang-orang yang munafik laki-laki dan perempuan, sebagian dengan sebagian yang lain”, karena mereka bersekutu dalam kemunafikan, maka merekapun saling mendukung. Ini adalah pemutus bagi orang yang beriman dari pengangkatan mereka menjadi teman. Kemudian Allah menyebutkan sifat umum orang munafik yang tidak keluar darinya orang besar dan orang kecil dari kalangan mereka. Dia berfirman, “mereka menyuruh berbuat yang munkar.” Yaitu kekufuran, kefasikan, dan kemaksiatan. “Dan melarang berbuat yang ma’ruf”, yaitu iman, akhlak yang mulia, amal yang shalih dan adab-adab yang luhur. ”Dan mereka menggemgamkan tangannya,” dari sedekah dan jalan-jalan kebaikan, ciri mereka adalah kekikiran. “mereka telah lupa kepada Allah”, tidak mengingat kecuali sedikit, “maka Allah melupakan mereka”, dari rahmatNya, Dia tidak membimbing mereka kepada kebaikan dan tidak memasukannya kedalam Surga, akan tetapi membiarkan mereka dilapisan neraka paling bawah, kekal dan dikekalkan di dalamnya. “Sesungguhnya orang-orang munafik itulah orang-orang fasik.” Kefasikan dibatasi dari mereka lebih besar dari kefasikan selain mereka, buktinya adalah azab mereka lebih berat dari azab yang lainnya dan bahwa orang Mukmin sangat di sulitkan oleh mereka jika mereka hidup dikalangan orang-orang Mukmin dan untuk menghindari mereka yang sulit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 67: Dalam ayat ini terdapat sesuatu yang mendorong kaum mukmin untuk tidak berwala’ (mencintai dan membela) kepada mereka (orang-orang munafik). Yaitu kekafiran dan kemaksiatan. Yaitu keimanan, ketaatan, amal yang saleh, akhlak yang mulia, dan adab yang baik. Dari bersedekah dan dari mengeluarkan harta di jalan-jalan kebaikan. Yakni meninggalkan ketaatan kepada-Nya atau mereka tidak mengingat-Nya kecuali karena terpaksa dan bermalas-malasan melakukannya. Membiarkan mereka; tidak memberi rahmat-Nya, tidak memberi mereka taufik kepada kebaikan, dan di akhirat mereka akan dibiarkan di dalam siksaan tidak dipedulikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 67",
    "description": "Setelah memaparkan beberapa perilaku buruk orang-orang munafik, ayat ini menerangkan kesamaan orang munafik laki-laki dan perempuan dalam hal sifat, sikap, perilaku dan akhlak. Orang-orang munafik laki-laki dan perempuan, satu dengan yang lain adalah memiliki kesamaan, yaitu mereka senantiasa menyuruh berbuat yang mungkar dan mencegah perbuatan yang makruf dan mereka selalu menggenggamkan tangannya karena kekikirannya. Mereka telah melupakan kebesaran Allah, petunjuk-petunjuk agama-Nya. Mereka juga lupa kalau semua perilaku buruknya akan mendapatkan balasan di akhirat kelak, maka Allah juga akan melupakan mereka di akhirat kelak dengan menjauhkan mereka dari rahmat-Nya. Sesungguhnya orang-orang munafik yang sudah jelas kemunafikannya itulah orang-orang yang fasik, yakni orang-orang yang benar-benar keluar dari ketaatan kepada Allah, bahkan sifat buruk mereka melebihi orang-orang kafir. Atas perilaku mereka itulah Allah menjanjikan hukuman bagi orangorang munafik laki-laki dan perempuan dan juga orang-orang kafir dengan neraka jahanam. Mereka kekal di dalamnya. Cukuplah neraka itu bagi mereka. Di sanalah Allah melaknat mereka, dan mereka mendapat azab yang kekal sebagai balasannya yang setimpal."
  }
]