[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sengsungguhnya perbuatan-perbuatan kalian itu (wahai orang-orang munafik), berupa olokan dan kekafiran itu serupa dengan perbuatan-perbuatan umat-umat terdahulu yang dari segi keuatan fisik, harta, dan anak-anak, mereka lebih besar daripada kalian, lalu mereka meresakan ketentraman di dalam kehidupan dunia dan bersenang-senang dengan yang apa ada di dalamnya berupa bagian-bagian mereka dan kesenangan-kesenangan. Kalianpun wahai orang-orang munafik, telah bersenang-senang dengan bagian kalian berupa kenikmatan-kenikmatan yang fana, sebagian orang-orang terdahulu bersenang-senang dengan bagian mereka yang fana itu, dan kalian larut dalam kedustaan terhadap Allah seperti umat-umat sebelum kalian larut di dalamnya. Orang-orang yang bersifat demikian, mereka itulah orang-orang yang lenyap kebaikan-kebaikan mereka di dunia dan di akhirat. Dan mereka itulah orang-orang yang merugi lantaran menjual kenikmatan akhirat dengan kesenangan-kesenanangan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Kalian -wahai orang-orang munafik- sama seperti orang-orang kafir sebelum kalian dalam mengingkari dan mengolok-olok agama Allah. Mereka dahulu lebih kuat dan mempunyai anak lebih banyak dari kalian. Mereka telah menikmati kenikmatan dan kesenangan duniawi yang telah ditetapkan untuk mereka. Kemudian kalian juga menikmati kenikmatan dan kesenangan duniawi yang ditetapkan untuk kalian -wahai kaum munafik- sebagaimana orang-orang kafir di masa lalu menikmati bagian mereka. Tindakan kalian mendustakan kebenaran dan menghina utusan Allah, serupa dengan tindakan mereka yang mendustakan kebenaran dan menghina utusan-utusan Allah. Orang-orang yang memiliki sifat-sifat tercela itu adalah orang-orang yang amal perbuatannya akan hangus karena dinilai rusak oleh Allah akibat kekafiran mereka. Dan mereka adalah orang-orang yang benar-benar merugi. Karena mereka menjerumuskan diri mereka sendiri ke dalam jurang kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Karena orang-orang munafik itu lebih memilih dunia karena dapat mereka rasakan secara langsung, dan berpaling dari akhirat karena tidak dapat mereka lihat saat ini, sehingga mereka sama seperti umat-umat terdahulu sebelum mereka; maka Allah menjelaskan kepada mereka kesudahan buruk umat-umat tersebut karena amalan mereka lenyap dan sirna: Hai orang-orang munafik, kekafiran dan hinaan yang kalian lakukan seperti umat-umat sebelum kalian yang mendustakan kami. Dahulu mereka lebih kuat dari kalian dan lebih banyak harta dan keturunannya daripada kalian, kemudian mereka menikmati bagian kenikmatan dan syahwat dunia yang telah ditetapkan bagi mereka; maka nikmatilah bagian yang telah ditetapkan bagi kalian sebagaimana umat-umat terdahulu menikmatinya. Kalian juga tenggelam dalam pendustaan terhadap kebenaran yang penghinaan terhadap Rasulullah, sebagaimana tenggelamnya umat-umat terdahulu itu di dalamnya. Orang-orang yang memiliki sifat-sifat buruk tersebut, amalan mereka lenyap di sisi Allah akibat kekafiran yang mereka perbuat. Mereka adalah orang-orang yang merugikan diri sendiri dengan menjerumuskannya ke dalam kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. كَالَّذِينَ مِن قَبْلِكُمْ ((keadaan kamu hai orang-orang munafik dan musyrikin) adalah seperti keadaan orang-orang sebelum kamu) Kalimat ini ditujukan bagi orang-orang munafik. Yakni orang-orang kafir sebelum kalian lebih banyak harta dan keturunannya daripada orang-orang munafik di zaman Rasulullah. وَأَكْثَرَ أَمْوٰلًا وَأَوْلٰدًا فَاسْتَمْتَعُوا۟ (dan lebih banyak harta dan anak-anaknya dari kamu. Maka mereka telah menikmati) Yakni berfoya-foya. بِخَلٰقِهِمْ(bagian mereka) Yakni dengan bagian mereka yang diberikan Allah kepada mereka dari kenikmatan dunia. فَاسْتَمْتَعْتُم(dan kamu telah menikmati) Wahai orang-orang munafik. بِخَلٰقِكُمْ(bagian kamu) Yakni dengan bagian kalian yang telah ditetapkan Allah bagi kalian. كَمَا اسْتَمْتَعَ الَّذِينَ مِن قَبْلِكُم بِخَلٰقِهِمْ(sebagaimana orang-orang yang sebelummu menikmati bagiannya) Kalian menikmatinya sebagaimana Mereka menikmatinya. Allah mencela kedua golongan tersebut yang telah tenggelam dalam kenikmatan itu sehingga lalai dari menunaikan kewajiban terhadap Allah Sang Pemberi nikmat. وَخُضْتُمْ كَالَّذِى خَاضُوٓا۟ ۚ( dan kamu mempercakapkan (hal yang batil) sebagaimana mereka mempercakapkannya) Yakni kalian tenggelam dalam mencari kenikmatan dunia serta dalam sendagurau dan main-main sebagaimana mereka berbuat demikian. Pendapat lain mengatakan, yakni sebagaimana mereka menyimak ayat-ayat Allah dengan penuh kebohongan. أُو۟لٰٓئِكَ(Mereka itu) Yakni yang memiliki sifat-sifat tersebut. حَبِطَتْ أَعْمٰلُهُمْ(amalannya menjadi sia-sia) Yakni amalan mereka lenyap. Dan yang dimaksud adalah amalan yang mereka lakukan yang nampak sebagai amal ketaatan. فِى الدُّنْيَا وَالْاٰخِرَةِ ۖ( di dunia dan di akhirat) Lenyapnya di dunia adalah karena apa yang mereka harapkan untuk bisa menjadi sebab kekayaan malah menjadi kemiskinan, dan kemuliaan menjadi kehinaan, serta kekuatan menjadi kelemahan. Sedangkan lenyapnya di akhirat adalah karena mereka akhirnya merasakan azab neraka dan amalan mereka yang mereka sangka adalah sebuah ketaatan ternyata tidak bermanfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Wahai orang-orang munafik, sesungguhnya perbuatan kalian itu seperti perbuatan orang-orang kafir sebelum kalian yang lebih kuat, lebih, lebih memiliki banyak harta dan anak. Mereka menikmati bagian mereka berupa kenikmatan dunia, dan kalian juga telah menikmati bagian kalian berupa kenikmatan, syahwat dan nasib di dunia sebagaimana orang-orang sebelum kalian menikmati bagiannya dengan kenikmatan dan syahwat dunia. Dan kalian memasukkan kebathilan dan perkataan menohok kepada Nabi SAW seperti percakapan mereka terkait kenikmatan, hiburan, dan kesenangan dunia serta pendustaan terhadap ayat-ayat Allah. Mereka itu sia-sia amalnya di dunia dan akhirat, tidak ada pahalanya. Mereka itu adalah orang-orang yang merugi di dunia dan akhirat, sehingga kemuliaan mereka di dunia menjadi kehinaan dan di akhirat mereka di azab dengan azab neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seperti orang-orang sebelum kalian} wahai orang-orang kafir kalian itu serupa dengan orang-orang sebelum kalian {Mereka lebih besar daripada kalian kekuatannya dan lebih banyak daripada kalian harta dan anak-anaknya. Mereka telah menikmati bagian mereka} mereka menikmati bagian mereka berupa kenikmatan dunia {dan kalian telah menikmati bagian kalian} bagian kalian berupa kenikmatan dunia {sebagaimana orang-orang yang sebelum kalian menikmati bagian mereka. Kalian mempercakapkan (hal-hal yang batil)} kalian memasukkan kepada orang-orang mukmin hal bathil, dusta terhadap Allah dan RasulNya serta ejekan {sebagaimana mereka mempercakapkannya} sebagaimana orang-orang sebelum kalian mempercakapkannya {Mereka itu sia-sia} sia-sia {amal mereka di dunia dan di akhirat. Mereka itulah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. Allah berfirman memperingatkan orang-orang munafik dari azab yang akan menimpa mereka seperti yang telah menimpa umat-umat pendusta sebelumnya, “yaitu kaum Nuh, ‘Ad, Tsamud, kaum Ibrahim, penduduk madyan, dan penduduk-penduduk negeri yang telah musnah?” yakni, desa-desa kaum Luth, semuanya “telah datang kepada mereka rasul-rasul dengan membawa keterangan yang nyata.” Yakni, dengan keterangan yang nyata, jelas, terang, yang menjelaskan perkara-perkara, namun mereka mendustakannya, maka terjadilah kepada mereka apa yang Allah ceritakan kepada kita. Perbuatanmu mirip dengan perbuatan mereka, “Dan kamu menikmati begianmu” dari dunia, kamu menggambilnya dengan penuh kelezatan dan kenikmatan tanpa memikirkan tujuannya, kamu memakainya untuk bermaksiat kepada Allah. Keinginan dan perhatianmu hanyalah untuk mendapatkan kenikmatan tersebut, sebagaimana yang di lakukan oleh orang-orang sebelummu. “Dan kamu mempercakapkan hal yang bathil sebagaimana mereka mempercakapkannya.” Yakni kamu membahas kebatilan dan keburukan dan kamu berdebat dengan kebatilan demi melenyapkan kebenaran. Inilah perbuatan dari ilmu mereka: menikmati bagian hidup dan bercakap dengan keatilan, maka merekapun berhak di binasakan dan di hukum sebelum orang mereka yang melakukan perbuatan-perbuatan yang sama dengan mereka. Adapun orang-orang yang beriman, walaupun menikmati jatah hidup mereka dan nikmat dunia yang diberikan kepada mereka, namun itu di gunakan sebagai penunjang untuk ketaatan kepada Allah. Adapun ilmu mereka maka ia ilmu adalah para Rasul, yaitu meraih keyakinan dalam segala tuntutan luhur dan berdebat dengan kebenaran untuk melenyapkan kebatilan. FirmanNya, “Maka Allah tidak sekali-kali menganiayan mereka”, jika Dia menimpakan hukuman yang DIa timpakan. “Akan tetapi merekalah yang menganiaya diri sendiri.” Dimana mereka berani bermaksiat kepadaNya, bermaksiat kepada Rasul-Rasul mereka, dan menuruti semua perintah penguasa yang sewanang-wenang lagi menentang kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 69: Dalam ayat ini, Allah Subhaanahu wa Ta'aala memperingatkan kaum munafik agar mereka menyadari bahwa jika mereka tetap di atas sikapnya itu, mereka bisa memperoleh azab seperti yang menimpa generasi sebelum mereka yang mendustakan para rasul. Termasuk di antaranya mencela Rasulullah shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 69",
    "description": "Keadaan orang-orang munafik yang terpedaya oleh kenikmatan duniawi sehingga berani menentang kebenaran adalah seperti orang-orang terdahulu sebelum kamu. Mereka memiliki fisik lebih kuat daripada kamu, dan lebih banyak harta dan anak-anaknya. Maka dengan kenikmatan duniawi itu mereka telah menikmati bagiannya, dan kamu juga telah menikmati bagianmu sebagaimana orang-orang yang sebelummu menikmati bagiannya sehingga melalaikanmu dari ayat-ayat Allah dan petunjuk rasul-Nya, dan kamu mempercakapkan hal-hal yang batil sebagaimana mereka juga mempercakapkannya. Padahal, dengan itu semua, mereka dan juga kamu itu benar-benar telah sia-sia amalnya di dunia karena tidak dilandasi dengan keikhlasan dan sia-sia di akhirat karena tidak dilandasi iman yang benar. Mereka itulah orang-orang yang rugi. Kemudian, melalui ayat ini, Allah mengingatkan orang-orang munafik sekaligus sebagai ancaman, jika mereka tetap bersikap seperti itu. Apakah tidak sampai kepada mereka berita tentang orang-orang yang sebelum mereka yang telah dibinasakan oleh Allah akibat mendustakan para rasul' mereka itu adalah kaum nuh, 'ad, samud, kaum ibrahim, penduduk madyan, dan penduduk negeri-negeri yang telah musnah, yang di antaranya masih bisa dibuktikan peninggalannya' padahal telah datang kepada mereka rasul-rasul dengan membawa bukti-bukti yang nyata, namun sayang, mereka mendustakannya lalu Allah membinasakannya. Demikian ini, karena Allah tidak pernah sedikit pun menzalimi mereka, tetapi merekalah yang menzalimi diri mereka sendiri."
  }
]