[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak sepatutnya kaum musyrikin memiliki perjanjian damai di sisi Allah dan di sisi RasulNya, kecuali orang-orang yang kalian telah mengadakan perjanjian perdamaian di dekat masjidil haram dalam peristiwa perdamaian hudaibiyah. Selama mereka tegak menepati isi perjanjian dengan kalian, maka tetaplah kalian menepati terhadap mereka seperti itu. Sesungguhnya Allah mencintai orang-orang yang bertakwa yang memenuhi perjanjian-perjanjian mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Orang-orang yang menyekutukan Allah dengan sesuatu tidak dibenarkan memiliki perjanjian (damai) dan jaminan keamanan di sisi Allah dan rasul-Nya, kecuali perjanjian yang kalian -wahai orang-orang Islam- adakan bersama orang-orang musyrik itu di dekat Masjidilharam dalam Perjanjian Hudaibiyah. Maka sepanjang mereka menghormati perjanjian yang kalian buat dengan mereka itu dan tidak melanggarnya maka kalian pun harus menghormatinya dan tidak boleh melanggarnya. Sesungguhnya Allah mencintai hamba-hamba-Nya yang bertakwa, yang menjalankan perintah-perintah-Nya, dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Karena perkara pelanggaran perjanjian adalah hal yang membuat heran, maka menjadi hal yang mengherankan bagaimana orang-orang musyrik memiliki perjanjian dengan kalian, sedangkan mereka selalu berniat melanggar perjanjian mereka; kecuali perjanjian yang kalian buat di Masjidil Haram dengan Bani Kinanah dan Bani Dhamrah, karena mereka tetap berpegang pada perjanjian tersebut dan tidak ikut melanggar perjanjian antara Rasulullah dengan kaum Quraisy di Hudaibiyah. Maka mereka ini cukuplah awasi mereka dan jangan memerangi mereka selama mereka tetap berpegang pada perjanjian, karena kalian tidak boleh melanggar perjanjian terlebih dahulu. Sesungguhnya Allah menyukai orang-orang yang menjauhkan diri dari pengkhianatan dan pelanggaran perjanjian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ اللهِ وَعِندَ رَسُولِهِۦٓ (Bagaimana bisa ada perjanjian (aman) dari sisi Allah dan Rasul-Nya dengan orang-orang musyrikin) Yakni tidak mungkin perjanjian dengan mereka akan bertahan lama karena mereka merupakan musuh-musuh kalian yang menyimpan pengkhianatan dalam hati mereka, selalu menunggu kesempatan untuk melanggar perjanjian dengan kalian. Oleh sebab itu mereka tidak mengharapkan perjanjian itu dan sama sekali tidak terbesit dalam diri mereka. إِلَّا الَّذِينَ عٰهَدتُّمْ عِندَ الْمَسْجِدِ الْحَرَامِ ۖ( kecuali orang-orang yang kamu telah mengadakan perjanjian (dengan mereka) di dekat Masjidil haraam) Sedang mereka tidak melanggar dan tidak membatalkannya maka janganlah kalian memerangi mereka. فَمَا اسْتَقٰمُوا۟ لَكُمْ(maka selama mereka berlaku lurus terhadapmu) Yakni selama mereka tetap menjalankan perjanjian yang kalian sepakati dengan mereka. فاستقيموا لهم (hendaklah kamu berlaku lurus (pula) terhadap mereka) Terdapat pendapat mengatakan mereka adalah orang-orang dari Bani Kinanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7 Bagaimana bisa ada perjanjian aman dari sisi Allah dan Rasul-Nya dengan orang-orang musyrikin, sebab mereka menghianati janji. Kecuali orang-orang yang kamu telah mengadakan perjanjian dengan mereka di dekat Masjidil haram pada hari Hudaibiyah? Mereka adalah Bani Dhomroh dan Kinanah. maka selama mereka berlaku lurus terhadap janji kepadamu, hendaklah kamu berlaku lurus pula terhadap mereka atas janji itu. Sesungguhnya Allah menyukai orang-orang yang bertakwa dan menjaga aturan Allah dan yang menepati janji."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana mungkin} tidak {ada perjanjian untuk orang-orang musyrik di sisi Allah dan RasulNya, kecuali untuk orang-orang yang kalian telah membuat perjanjian dengan mereka di dekat Masjidil haram. Selama mereka berlaku lurus terhadap kalian} selama mereka berlaku lurus terhadap kalian atas perjanjian yang terjadi antara kalian dan mereka, dan mereka tidak membatalkannya {maka berlaku luruslah pula terhadap mereka} maka berlaku luruslah kepada mereka untuk memenuhi perjanjian itu sampai waktunya berakhir {Sesungguhnya Allah mencintai orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Ini adalah penjelasan tentang hikmah yang mengharuskan berlepasnya Allah dan RasulNya dari orang-orang musrik. Dia berfirman, “bagaimana bisa ada perjanjian aman dari sisi Allah dan RasulNya dengan orang-orang musyrikin.” Apakah mereka melakukan kewajiban iman? Apakan mereka tidak menyakiti Rasululoh dengan orang-orang yang beriman? Bukankah mereka memerangi kebenaran dan menyokong kebatilan? Bukankah mereka telah melakukan kerusakan di muka bumi? Maka sudah selayaknya Allah berlepas diri dari mereka, dengan hendak mereka tidak memiliki jaminan dari Allah dan RasulNya, “kecuali dengan orang-orang yang telah kamu mengadakan perjanjian dengan mereka, dari kaum musrikin di dekat Masjidil Haram?” maka mereka memiliki perjanjian, khususnya di tempat yang mulia ini yang seharusnya di jaga. “maka selama mereka berlaku lurus terhadapmu, hendaklah kamu berlaku lurus pula kepada mnereka. Sesunggungya Allah menyukai orang-orang yang bertakwa.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 7: Sedangkan mereka kafir kepada Allah dan Rasul-Nya, mengganggu rasul dan kaum mukmin, lagi mengingkari janji. Oleh karena itu, Allah layak berlepas diri dari mereka, dan tidak mengadakan perjanjian aman dengan orang-orang musyrik. Dari kalangan musyrikin. Yang dimaksud dengan dekat Masjidilharam adalah Al-Hudaibiyah, suatu tempat yang terletak dekat Makkah di jalan ke Madinah. Pada tempat itu Nabi Muhammad shallallahu 'alaihi wa sallam mengadakan perjanjian gencatan senjata dengan kaum musyrikin selama 10 tahun. Dengan mengindahkan perjanjian dan tidak merusaknya. Dengan memenuhi janji dan tidak melanggarnya. Nabi shallallahu 'alaihi wa sallam berlaku lurus terhadap mereka dengan mengindahkan perjanjian sampai mereka melanggarnya dengan menolong Bani Bakar melawan Khuza’ah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 7",
    "description": "Setelah ayat sebelumnya menjelaskan tentang pemutusan perjanjian dengan kaum musyrik mekah juga yahudi bani quraidhah dan seruan untuk memerangi mereka setelah lewat masa tenggang empat bulan, maka ayat ini menunjukkan alasan mengapa pemutusan perjanjian itu harus dilakukan. Bagaimana mungkin ada perjanjian yang dimuliakan di sisi Allah dan rasul-Nya bagi orang-orang musyrik yang telah sedemikian meresapnya kemusyrikan tersebut sehingga mereka tidak merasa bersalah setiap kali merusak perjanjian' jika demikian, perjanjian damai tidak boleh dilanjutkan lagi, kecuali dengan orang-orang musyrik yang kamu telah mengadakan perjanjian dengan mereka di dekat masjidilharam, yakni dalam perjanjian hudaibiyah, maka selama mereka berlaku jujur dengan tetap memegang perjanjian atau tidak khianat terhadapmu, hendaklah kamu berlaku jujur pula terhadap mereka. Sungguh, Allah menyukai orang-orang yang bertakwa, yang memiliki sifat-sifat terpuji, antara lain dengan senantiasa jujur dan memegang perjanjian dengan siapa pun, bahkan dengan mereka yang berkhianat sekalipun. Ayat berikut ini memberikan alasan lain mengapa harus dilakukan pemutusan perjanjian dengan kaum musyrik. Bagaimana mungkin kamu tetap melakukan perjanjian damai dengan kaum musyrik mekah yang jelas-jelas memusuhimu dan merusak perjanjian, padahal, di samping memusuhimu, mereka juga selalu menyembunyikan sikap khianat kepada kalian. Hal ini bisa dilihat dari sikap mereka. Jika mereka memperoleh kemenangan atas kamu, mereka tidak memelihara hubungan kekerabatan denganmu dan tidak pula mengindahkan perjanjian. Di samping itu, ketika mereka masih lemah, mereka juga senantiasa menunjukkan sikap menipu dengan cara menyenangkan hatimu baik dengan mulut maupun sikapnya, sedang hatinya menolak. Demikian ini, karena kebanyakan mereka adalah orang-orang fasik, yaitu mereka yang keluar dari ketaatan kepada Allah. '"
  }
]