[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Belumkah datang kepada orang-orang munafik berita orang-orang yang telah berlalu dari kaum Nuh, bangsa Ad, bangsa Tsamud, kaum Ibrahim, para penduduk Madyan dan kaum Luth, ketika datang kepada mereka rasul-rasul dengan membawa wahyu dan ayat-ayat Allah, lalu mereka mendustakan mereka? Akibatnya, Allah menurunkan kepada mereka semua siksaNya, sebagai balasan bagi mereka akibat perbuatan mereka. Allah tidak menzhalimi mereka, kan tetapi merekalah yang menzalimi diri mereka dengan pendustaan dan penentangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Tidakkah orang-orang munafik itu mendengar kabar tentang apa yang telah diperbuat oleh umat-umat yang kafir di masa lalu dan hukuman apa yang menimpa mereka? Yaitu kaum Nuh, kaum Hud, kaum Ṣāleḥ, kaum Ibrahim, penduduk Madyan, dan permukiman kaum Lūṭ. Mereka telah didatangi oleh rasul-rasul mereka dengan membawa bukti-bukti yang nyata dan hujah-hujah yang jelas. Allah tidak pernah menzalimi mereka karena rasul-rasul mereka telah memberikan peringatan kepada mereka. Tetapi mereka sendirilah yang menzalimi diri mereka sendiri dengan ingkar kepada Allah dan mendustakan rasul-rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Belum sampaikah kepada orang-orang munafik kisah tentang apa yang telah dilakukan oleh umat-umat terdahulu yang mendustakan Kami, dan tentang azab yang menimpa mereka; yaitu kaum Nuh, kaum Hud, kaum Sholih, kaum Ibrahim, penduduk Madyan, dan negeri kaum Luth; para rasul telah datang kepada mereka dengan membawa bukti-bukti dan hujjah-hujjah yang jelas, sehingga Allah sama sekali tidak menzalimi mereka, karena mereka telah mendapat peringatan dari para rasul. Akan tetapi merekalah yang menzalimi diri mereka sendiri karena telah mengingkari Allah dan mendustakan para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. أَلَمْ يَأْتِهِمْ (Belumkah datang kepada mereka) Yakni kepada orang-orang munafik. نَبَأُ الَّذِينَ مِن قَبْلِهِمْ(berita penting tentang orang-orang yang sebelum mereka) Yakni kisah yang penting bagi mereka, yaitu tentang apa yang orang-orang terdahulu itu lakukan dan bagaimana mereka dibalas. Disebutkan disini tujuh kaum yang kisah-kisahnya telah sampai kepada orang-orang Arab. قَوْمِ نُوحٍ (yaitu) kaum Nuh) Mereka telah dibinasakan dengan ditenggelamkan oleh banjir bandang. وَعَادٍ (‘Aad) Mereka telah dibinasakan dengan angin ribut. وَثَمُودَ(Tsamud) Mereka telah disiksa dengan suara yang memekikkan telinga. وَقَوْمِ إِبْرٰهِيمَ(kaum Ibrahim) Allah telah menghancurkan mereka dengan serangan nyamuk-nyamuk. وَأَصْحٰبِ مَدْيَنَ(penduduk Madyan) Yakni kaum Nabi Syu’aib. Mereka diazab dengan goncangan gempa. وَالْمُؤْتَفِكٰتِ ۚ( dan negeri-negeri yang telah musnah) Yakni negeri-negeri kaum Nabi Luth. Allah membinasakan mereka dengan hujan batu. Negeri-negeri tersebut dinamai dengan (المؤتفكات) karena negeri-negeri tersebut dibalik tanahnya sehingga permukaan tanahnya terletak dibagian bawah. أَتَتْهُمْ رُسُلُهُم بِالْبَيِّنٰتِ ۖ( Telah datang kepada mereka rasul-rasul dengan membawa keterangan yang nyata) Yakni rasul-rasul bagi tujuh kau mini. فَمَا كَانَ اللهُ لِيَظْلِمَهُمْ(maka Allah tidaklah sekali-kali menganiaya mereka) Karena para rasul mereka telah memperingati dan mengingatkan mereka. وَلٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ(akan tetapi merekalah yang menganiaya diri mereka sendiri) Karena kekafiran mereka kepada Allah dan tidak taat kepada para rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Apakah tidak sampai kepada orang-orang munafik itu kabar tentang orang-orang sebelum mereka, seperti kaum Nuh yang ditenggelamkan dengan banjir bandang, kaum ‘Ad, yaitu kaumnya Hud yang dibinasakan dengan angin yang sangat kencang, kaum Tsamud, yaitu kaumnya Shaleh yang dibinasakan dengan getaran atau jeritan, kaum Ibrahim yang dibinasakan dengan dan dirampas kenikmatannya, dan penduduk Madyan, kaumnya Syuaib yang dibinasakan dengan azab di hari yang gelap atau dengan getaran, dan penduduk Mu’tafikat, yaitu negeri kaum Luth yang dibalik dan ditenggelamkan dengan penduduknya sehingga bagian atasnya menjadi bagian di bagian bawah. Rasul-rasul dari 6 golongan tersebut telah membawakan mukjizat dan bukti yang menunjukkan kepada keesaan Allah, lalu mereka didustakan. Dan Allah tidak mengazab mereka tanpa sebab suatu dosa, melainkan karena mereka menzalimi diri sendiri dengan melakukan dosa, ingkar kepada Allah, dan mendustakan para rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah tidak sampai kepada mereka} apakah tidak sampai kepada orang-orang munafik itu {berita} kabar {orang-orang sebelum mereka, yaitu kaum Nuh, ‘Ad, Tsamud, kaum Ibrahim, penduduk Madyan, dan yang kota-kotanya dijungkir balikkan} negeri kaum Luth {Telah datang kepada mereka rasul-rasul dengan membawa bukti-bukti nyata} dalil-dalil dan bukti-bukti yang jelas {Allah tidak akan pernah menzalimi mereka, tetapi merekalah yang selalu menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. Allah berfirman memperingatkan orang-orang munafik dari azab yang akan menimpa mereka seperti yang telah menimpa umat-umat pendusta sebelumnya, “yaitu kaum Nuh, ‘Ad, Tsamud, kaum Ibrahim, penduduk madyan, dan penduduk-penduduk negeri yang telah musnah?” yakni, desa-desa kaum Luth, semuanya “telah datang kepada mereka rasul-rasul dengan membawa keterangan yang nyata.” Yakni, dengan keterangan yang nyata, jelas, terang, yang menjelaskan perkara-perkara, namun mereka mendustakannya, maka terjadilah kepada mereka apa yang Allah ceritakan kepada kita. Perbuatanmu mirip dengan perbuatan mereka, “Dan kamu menikmati begianmu” dari dunia, kamu menggambilnya dengan penuh kelezatan dan kenikmatan tanpa memikirkan tujuannya, kamu memakainya untuk bermaksiat kepada Allah. Keinginan dan perhatianmu hanyalah untuk mendapatkan kenikmatan tersebut, sebagaimana yang di lakukan oleh orang-orang sebelummu. “Dan kamu mempercakapkan hal yang bathil sebagaimana mereka mempercakapkannya.” Yakni kamu membahas kebatilan dan keburukan dan kamu berdebat dengan kebatilan demi melenyapkan kebenaran. Inilah perbuatan dari ilmu mereka: menikmati bagian hidup dan bercakap dengan keatilan, maka merekapun berhak di binasakan dan di hukum sebelum orang mereka yang melakukan perbuatan-perbuatan yang sama dengan mereka. Adapun orang-orang yang beriman, walaupun menikmati jatah hidup mereka dan nikmat dunia yang diberikan kepada mereka, namun itu di gunakan sebagai penunjang untuk ketaatan kepada Allah. Adapun ilmu mereka maka ia ilmu adalah para Rasul, yaitu meraih keyakinan dalam segala tuntutan luhur dan berdebat dengan kebenaran untuk melenyapkan kebatilan. FirmanNya, “Maka Allah tidak sekali-kali menganiayan mereka”, jika Dia menimpakan hukuman yang DIa timpakan. “Akan tetapi merekalah yang menganiaya diri sendiri.” Dimana mereka berani bermaksiat kepadaNya, bermaksiat kepada Rasul-Rasul mereka, dan menuruti semua perintah penguasa yang sewanang-wenang lagi menentang kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 70: 'Aad adalah kaum Nabi Hud, Tsamud adalah kaum Nabi Shaleh; Madyan adalah kaum Nabi Syu'aib, dan penduduk negeri yang telah musnah adalah kaum Nabi Luth alaihimus salam. Lalu mereka mendustakannya, maka Allah membinasakan mereka. Dengan mengazab tanpa dosa. Dengan mengerjakan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 70",
    "description": "Kemudian, melalui ayat ini, Allah mengingatkan orang-orang munafik sekaligus sebagai ancaman, jika mereka tetap bersikap seperti itu. Apakah tidak sampai kepada mereka berita tentang orang-orang yang sebelum mereka yang telah dibinasakan oleh Allah akibat mendustakan para rasul' mereka itu adalah kaum nuh, 'ad, samud, kaum ibrahim, penduduk madyan, dan penduduk negeri-negeri yang telah musnah, yang di antaranya masih bisa dibuktikan peninggalannya' padahal telah datang kepada mereka rasul-rasul dengan membawa bukti-bukti yang nyata, namun sayang, mereka mendustakannya lalu Allah membinasakannya. Demikian ini, karena Allah tidak pernah sedikit pun menzalimi mereka, tetapi merekalah yang menzalimi diri mereka sendiri. Ayat sebelumnya menjelaskan sikap buruk orang-orang munafik disertai ancaman, sedang ayat ini menjelaskan kebalikannya, yakni hakikat orang-orang mukmin. Dan orang-orang yang beriman, dengan iman-Nya yang sempurna, dari laki-laki dan perempuan, sebagian mereka menjadi penolong bagi sebagian yang lain dalam hal-hal kebenaran dan kebaikan. Secara jelas dapat dilihat dalam sikap dan perilakunya, yaitu mereka menyuruh berbuat yang makruf, dan mencegah dari yang mungkar, melaksanakan salat, menunaikan zakat, dan taat kepada Allah dan rasulnya. Mereka itulah yang akan senantiasa diberi rahmat oleh Allah. Sungguh, Allah mahaperkasa untuk melindungi mereka dengan rahmat-Nya, mahabijaksana dalam setiap pemberian-Nya."
  }
]