[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang mukmin, laki-laki maupun perempuan, yang beriman kepada Allah dan RasulNya, sebagian mereka merupakan penolong bagi sebagian yang lain. Mereka memerintahkan manusia untuk beriman dan mengerjakan amal shalih serta melarang mereka dari perbuatan kafir dan maksiat-maksiat, menjalankan shalat, memberikan zakat, taat kepada Allah dan RasulNya dan mereka menghindar dari perkataan yang mereka dilarang melakukanya. Mereka itu akan di rahmati oleh Allah, lalu dia akan menyelamatkan mereka dari siksaNya dan memasukan mereka ke dalam surgaNya, lsesungguhnya Allah Maha perkasa dalam kerajaannNya agi Maha Bijaksana dalam penetapan ajaran-ajaran syariat dan hukum-hukumNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Orang-orang mukmin laki-laki dan orang-orang mukmin wanita satu sama lain saling mendukung, karena mereka disatukan oleh iman. Mereka menyuruh berbuat yang makruf, yaitu segala sesuatu yang dicintai Allah -Ta'ālā-, seperti menjalankan ajaran tauhid dan salat, mencegah perbuatan yang mungkar, yaitu segala sesuatu yang dibenci Allah -Ta'ālā-, seperti menjalankan kekafiran dan praktik riba, mereka menunaikan salat dengan sebaik-baiknya, taat kepada Allah, dan taat kepada rasul-Nya. Orang-orang yang memiliki sifat-sifat terpuji itu akan Allah masukkan ke dalam rahmat-Nya. Sesungguhnya Allah Maha Perkasa, tidak ada sesuatu pun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menciptakan makhluk-Nya, mengatur alam semesta, dan menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Setelah Allah menjelaskan bahwa orang-orang munafik senantiasa melakukan perbuatan buruk, maka kemudian Allah menyebutkan dalam ayat ini sifat orang-orang beriman yang baik dan menyukai perbuatan baik, dan menyebutkan apa yang telah Allah siapkan bagi mereka berupa pahala dan kenikmatan yang kekal: Dan orang-orang beriman dari kalangan laki-laki dan perempuan, mereka saling tolong-menolong, memerintahkan untuk berbuat ma'ruf -yaitu segala sesuatu yang diketahui sebagai hal yang baik, baik itu berupa aqidah yang benar, amal shalih, maupun akhlak yang mulia-, melarang perbuatan munkar -yaitu segala sesuatu yang bertentangan dengan hal yang ma'ruf, baik itu berupa aqidah yang batil, amalan buruk, maupun akhlak yang tercela-, mendirikan salat dengan sempurna, dan mentaati Allah dan rasul-Nya. Orang-orang yang memiliki sifat-sifat terpuji tersebut akan Allah masukkan ke dalam rahmat-Nya. Allah Maha Perkasa, tidak ada yang dapat mengalahkan-Nya; dan 6maha Bijaksana terhadap makhluk dan ketetapan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَالْمُؤْمِنُونَ وَالْمُؤْمِنٰتُ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۚ (Dan orang-orang yang beriman, lelaki dan perempuan, sebahagian mereka (adalah) menjadi penolong bagi sebahagian yang lain) Yakni hati mereka bersatu dalam kasih sayang karena agama dan iman kepada Allah mempersatukan mereka. يَأْمُرُونَ بِالْمَعْرُوفِ(ereka menyuruh (mengerjakan) yang ma’ruf) Yakni segala amal baik menurut pandangan syariat seperti mentauhidkan Allah dan tidak mnyekutukan-Nya. وَيَنْهَوْنَ عَنِ الْمُنكَرِ(mencegah dari yang munkar) Yakni perbuatan mungkar menurut agama. وَيُطِيعُونَ اللهَ وَرَسُولَهُۥٓ ۚ (dan mereka taat pada Allah dan Rasul-Nya) Dengan menjalankan apa yang diperintahkan kepada mereka. أُو۟لٰٓئِكَ(Mereka itu) Yakni orang-orang yang memiliki sifat-sifat tersebut. سَيَرْحَمُهُمُ اللهُ ۗ( akan diberi rahmat oleh Allah) Dengan memenuhi janji-Nya kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seluruh kaum muslim yang berada di timur dan barat adalah hati-hati mereka bersatu, mereka setia kepada Allah dan rasul-Nya dan kepada setiap hamba-hamba Allah yang beriman, mereka memusuhi musuh-musuh Allah dan rasul-Nya dan musuh-musuh orang-orang beriman, dan hati-hati mereka senantiasa tulus, dan doa-doa mereka selalu yang baik-baik; karena sesungguhnya itulah prajurit yang tidak terkalahkan dan bala tentara yang tidak akan diterlantarkan, sesungguhnya mereka adalah golongan yang selalu menang hingga hari kiamat. 2 ). Dari ayat ini kita mengetahui bahwa, tugas menyerukan kepada kebaikan dan melarang dari kemungkaran bukan tugas khusus yang dilakukan hanya kaum laki-laki, melainkan juga merupakan tugas bagi kaum perempuan, tentunya dalam batasan mereka sesama perempuan dan dalam wilayah yang boleh dijamah oleh mereka saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Orang-orang mukmin dan laki-laki dan perempuan adalah penolong satu sama lain. Mereka saling mendukung karena persatuan agama dan sama-sama beriman kepada Allah. Mereka menyuruh kebaikan, yaitu setiap amal shalih yang diperintahkan syariat, seperti bertauhid dan beribadah, dan mencegah kemunkaran, yaitu setiap ucapan atau tindakan yang dilarang oleh syariat, seperti kezaliman dan kekejian. Mereka menunaikan shalat fardhu pada waktunya, menunaikan zakat wajib, dan menaati Allah dan rasulnya di segala perintah dan larangannya. Mereka yang digambarkan itu akan dikasihi Allah dengan menunaikan janjiNya, yaitu kenikmatan surga. Sesungguhnya Allah Maha Kuat, tiada apapun yang mampu melemahkanNya, dan Maha Bijaksana dalam ciptaan dan aturanNya, sehingga tidak akan meletakkan sesuatu kecuali pada tempatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang mukmin laki-laki dan perempuan, sebagian mereka menjadi penolong bagi sebagian yang lain. Mereka menyuruh pada kebaikan dan mencegah dari kemungkaran, menegakkan shalat, menunaikan zakat, dan taat kepada Allah dan RasulNya. Mereka akan dirahmati oleh Allah. Sesungguhnya Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. ketika Allah menyebutkan bahwa orang-orang munafik, sebagian dengan yang lain adalah sama saja, Dia menyebutkan bahwa orang-orang Mukmin sebagian dari mereka adalah penolong bagi sebagian yang lain, Allah menyifati mereka dengan sifat yang bertentangan dengan sifat orang-orang munafik. Allah berfirman, “Dan orang-orang yang beriman, lelaki dan perempuan, sebagian mereka (adalah) menjadi penolong bagi sebagian yang lain”, dalam kecintaan, loyalitas, dukungan, dan bantuan. “Mereka menyuruh (mengerjakan) yang ma’ruf.” Ma’ruf adalah sebuah nama yang mencakup semua yang diketahui kebaikannya, berupa akidah yang lurus, amal yang shalih, dan akhlak yang luhur, dan yang masuk pertama kali ke dalam perkara mereka adalah diri mereka sendiri. “Dan mencegah dari yang mungkar”, yaitu semua yang bertentangan dan bertabrakan dengan yang ma’ruf, berupa akidah yang batil, amal yang buruk, dan akhlak yang tercela. “Dan mereka taat kepada Allah dan RasulNya.” Yakni mereka selalu taat kepada Allah dan RasulNya secara terus menerus. “Mereka itu akan diberi rahmat oleh Allah.” Yakni, Allah akan memasukkan mereka ke dalam rahmatNya dan menaunginya dengan kebaikanNya. “Sesungguhnya Allah Mahaperkasa lagi Mahabijaksana.” Yakni Mahakuat dan Mahakuasa, walau begitu Dia Mahabijaksana, meletakkan segala sesuatu pada tempatnya yang sesuai, yang Dia dipuji atas apa yang Dia ciptakan dan Dia perintahkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": ""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 71: Dia kuasa mewujudkan janji dan ancaman-Nya. Dia tidak meletakkan sesuatu kecuali pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 71",
    "description": "Ayat sebelumnya menjelaskan sikap buruk orang-orang munafik disertai ancaman, sedang ayat ini menjelaskan kebalikannya, yakni hakikat orang-orang mukmin. Dan orang-orang yang beriman, dengan iman-Nya yang sempurna, dari laki-laki dan perempuan, sebagian mereka menjadi penolong bagi sebagian yang lain dalam hal-hal kebenaran dan kebaikan. Secara jelas dapat dilihat dalam sikap dan perilakunya, yaitu mereka menyuruh berbuat yang makruf, dan mencegah dari yang mungkar, melaksanakan salat, menunaikan zakat, dan taat kepada Allah dan rasulnya. Mereka itulah yang akan senantiasa diberi rahmat oleh Allah. Sungguh, Allah mahaperkasa untuk melindungi mereka dengan rahmat-Nya, mahabijaksana dalam setiap pemberian-Nya. Allah menjanjikan kepada orang-orang mukmin yang benar-benar mantap imannya, dari kalangan laki-laki dan perempuan, akan mendapatkan surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, dan mendapat tempat yang baik di surga 'adn. Dan sesungguhnya keridaan Allah yang diperoleh di akhirat kelak itu lebih besar daripada kenikmatan surga itu sendiri. Itulah keberuntungan yang agung. Ayat ini mengajarkan bahwa tujuan hidup seorang mukmin adalah menggapai keridaan-Nya, juga keberuntungan yang hakiki adalah jika apa yang dilakukan dan dihasilkan itu bisa mengantarkannya menuju surga."
  }
]