[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alah menjanjikan bagi orang mukmin laki-laki dan orang mukmin perempuan yang beriman kepada Allah dan RasulNya, suga-surga yang mengalir di bawah istana-istana dan pohon-pohonnya sungai-sungai, mereka tinggal di dalam selamanya, kenikmatan tidak akan lenyap dari mereka dan tempat-tempat tinggal yang berbangunan indah, nyaman di tempati di dalam surga-surga yang abadi. Dan keridhaan dari Allah lebih besar lebih agung daripada kenikmatam yang mereka berada di dalamnya. janji tersebut berupa pahala akhirat dan keberuntungan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Allah berjanji kepada orang-orang yang beriman kepada-Nya, baik laki-laki maupun wanita, bahwa Dia kelak pada hari Kiamat akan memasukkan mereka ke dalam taman-taman surga yang di bawah bangunan-bangunan istananya mengalir sungai-sungai. Mereka akan menetap di sana untuk selama-lamanya. Di sana mereka tidak akan pernah mati dan kenikmatan yang mereka terima tidak akan pernah habis. Allah berjanji untuk memasukkan mereka ke dalam rumah-rumah yang bagus di dalam surga-surga yang kekal. Namun rida yang Allah anugerahkan kepada mereka lebih besar dari itu semua. Balasan tersebut adalah kemenangan besar yang tidak tertandingi oleh kemenangan apa pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Pada ayat sebelumnya disebutkan secara umum balasan yang dijanjikan bagi orang-orang beriman, maka pada ayat ini Allah memperinci hal tersebut: Allah berjanji kepada orang-orang beriman dari kalangan laki-laki dan perempuan untuk memasukkan mereka pada hari kiamat ke dalam surga-surga yang mengalir sungai-sungai dibawah istana-istananya, mereka akan tinggal di dalamnya selama-lamanya tanpa merasakan kematian dan kenikmatan bagi mereka tidak akan terhenti, dan Allah akan memasukkan mereka ke dalam tempat tinggal yang indah di dalam surga. Dan keridhaan yang Allah berikan kepada mereka lebih besar nilainya dari itu semua. Balasan-balasan yang disebutkan itu merupakan kemenangan besar yang tidak tertandingi oleh kemenangan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَعَدَ اللهُ الْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ جَنّٰتٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ (Allah menjanjikan kepada orang-orang mukmin, lelaki dan perempuan, (akan mendapat) surga yang dibawahnya mengalir sungai-sungai) Yakni sungai- sungai tersebut mengalir di bawah pohon-pohon dan ruangan-ruangan dalam surga tersebut. وَمَسٰكِنَ طَيِّبَةً (dan (mendapat) tempat-tempat yang bagus) Yang tidak ada keburukan sedikitpun, mereka mendapatkan kenikmatan di dalamnya. فِى جَنّٰتِ عَدْنٍ ۚ( di surga ‘Adn) yakni di negeri ‘And, yaitu negeri untuk tinggal secara kekal. وَرِضْوٰنٌ(Dan keridhaan) Meski hanya sedikit dari keridhaan Allah yang lebih besar dari segala yang diberikan Allah kepada mereka. Mereka aman dari kemurkaan Allah selama-lamanya. Dan keridhaan Allah yang paling sedikit lebih baik daripada segala kenikmatan jasmani yang besar. ذٰلِكَ(itu) Yakni surga-surga dan keridhaan Allah. هُوَ الْفَوْزُ الْعَظِيمُ(adalah keberuntungan yang besar) Segala keberuntungan yang dibayangkan oleh manusia lebih rendah dari keberuntungan ini. Dalam hadist Bukhari dan Muslim dari Abu Sa’id ia berkata: Rasulullah bersabda: “Allah berfirman kepada para penghuni surga: “wahai para penghuni surga”. Mereka menjawab: “kami penuhi panggilan-Mu, dan segala kebaikan di tangan-Mu”. Allah berfirman: “apakah kalian telah ridha?”. Mereka menjawab: “Ya Tuhan kami, bagaimana kami tidak ridha, sedangkan Engkau telah memberi kami apa yang belum Engkau berikan kepada seorangpun dari hamba-hamba-Mu”. Allah berfirman: “maukah kalian Aku beri yang lebih baik dari itu?”. Mereka berkata: “Ya Tuhan kami, adakah yang lebih baik dari hal ini?”. Allah berfirman: “Aku akan memberi kalian keridhaan-Ku sehingga Aku tidak akan murka kepada kalian selama-lamanya”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Allah menjanjikan orang-orang mukmin laki-laki dan perempuan dengan memasukkan mereka ke surga-surga yang di bawah pohon-pohon dan bilik-biliknya mengalir sungai-sungai, dan memberi tempat-tempat yang bangunannya bagus, dan baik untuk ditempati, yaitu di surga-surga dengan abadi selamanya tanpa terputus-putus, dan dengan diberi keridhaan Allah yang merupakan hal paling besar dan paling agung dari semuanya, karena keridhaan itu adalah sebab kemenangan dan kebahagiaan. Yang dijanjikan Allah itu, yaitu surga, tempat-tempat indah, dan keridhaan itu adalah satu-satunya kemenangan agung yang tidak bisa disamakan dengan yang lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menjanjikan kepada orang-orang mukmin laki-laki dan perempuan, surga-surga yang mengalir sungai-sungai di bawahnya, mereka kekal di dalamnya, dan tempat-tempat yang baik} yang baik {di surga ‘Adn} untuk tinggal {dan keridhaan dari Allah lebih besar. Itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Kemudian Allah menyebutkan pahala yang Dia sediakan untuk mereka, Dia berfirman, “Allah menjanjikan kepada orang-orang yang Mukmin lelaki dan perempuan, (akan mendapat) Surga yang dibawahnya mengalir sungai-sungai”, yang mengumpulkan seluruh kenikmatan dan kebahagiaan, bebas dari gangguan dan kesedihan, di bawah istana-istananya dan pohonnya mengalir sungai-sungai yang deras, yang mengairi kebun-kebun yang indah, di mana kebaikan dan keberkahan padanya tidak ada yang mengetahui kecuali Alllah, “mereka kekal di dalamnya.” Mereka tidak ingin berpindah darinya. “Dan (mendapat) tempat-tempat yang bagus di Surga ‘Adn.” Yang indah dan dihiasi dengan berbagai macam perhiasan yang disediakan bagi hamba-hamba Allah yang bertakwa, indah dilihat, nyaman ditinggali dan dihuni, tersedia di dalamnya perabot-perabot tempat tinggal elit yang orang-orang tidak lagi berharap lebih dari itu. Allah telah menyediakan untuk mereka ruangan-ruangan yang sangat indah dan bagus, bagian dari luarnya dapat dilihat dari dalam dan bagian dalamnya dapat dilihat dari luarnya. Inilah tempat-tempat tinggal yang indah yang membuat jiwa kerasan, hati menjadi betah, dan rohani pun mengharapkannya, karena ia “di Surga ‘Adn.” Yakni tempat tinggal, tidak pergi dan tidak berpindah darinya. “Dan keridhaan Allah”, yang Dia berikan kepada penghuni Surga “adalah lebih besar”, daripada nikmat Allah yang mereka rasakan, karena nikmat mereka belum sempurna sebelum mereka melihat Allah dan mendapatkan ridhaNya, karena ia adalah target yang dicari oleh orang-orang yang mencintai. Keridhaan Allah Rabb langit dan bumi adalah lebih besar daripada nikmat Surga. “Itu adalah keberuntungan yang besar”, yang mana mereka mendapatkan semua yang dicari dan selamat dari setiap yang tidak diinginkan, segala perkara dari mereka baik dan indah. Kita memohon kepada Allah agar Allah menjadikan kita bersama mereka dengan kemurahanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 72: Di antaranya adalah kamar yang jernih dan indah, bagian luar dapat terlihat dari dalam dan bagian dalam dapat terlihat dari luar. ‘Adn artinya tinggal (iqamah), yakni mereka berada di surga tanpa ada keinginan pindah darinya, bahkan senang menetap di sana. Ya Allah, masukkanlah kami ke dalam surga-Mu dan jauhkanlah kami dari neraka, masukkan pula ya Allah ke dalam surga, anak dan istri kami, bapak dan ibu kami serta saudara-saudara kami. Kumpulkanlah kami di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 72",
    "description": "Allah menjanjikan kepada orang-orang mukmin yang benar-benar mantap imannya, dari kalangan laki-laki dan perempuan, akan mendapatkan surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya, dan mendapat tempat yang baik di surga 'adn. Dan sesungguhnya keridaan Allah yang diperoleh di akhirat kelak itu lebih besar daripada kenikmatan surga itu sendiri. Itulah keberuntungan yang agung. Ayat ini mengajarkan bahwa tujuan hidup seorang mukmin adalah menggapai keridaan-Nya, juga keberuntungan yang hakiki adalah jika apa yang dilakukan dan dihasilkan itu bisa mengantarkannya menuju surga. Setelah Allah menjelaskan secara beriringan sifat orang-orang munafik dan orang-orang mukmin disertai balasan masing-masing, maka ayat ini menyeru kepada nabi Muhammad agar berjihad menghadapi mereka. Hal ini, disebabkan perilaku buruk mereka terhadap rasulullah dan kaum mukminin, yang sudah berulang kali menyakitinya secara fisik maupun psikis, bahkan tidak jarang tindakan mereka mengancam keselamatan beliau. Karena itu, wahai nabi dan kaum mukmin, berjihadlah melawan orang-orang kafir dan orang-orang munafik disebabkan perkataan dan perbuatan mereka yang nyata-Nyata menantang kamu, dan bersikaplah keras dan tegas terhadap mereka dalam berjihad agar mereka menghentikan perilaku buruknya sehingga tidak berani mengulanginya. Jika mereka terbunuh dan mati dalam keadaan kafir dan munafik, maka tempat mereka adalah neraka jahanam. Dan itulah seburukburuk tempat kembali. Perintah jihad itu bersifat kondisional dan bukan semata-mata tanpa sebab."
  }
]