[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Nabi, perangilah orang-orang kafir dengan pedang, dan orang-orang munafik dengan keterangan dan hujjah, dan tekanlah kedua golongan itu dengan keras. Dan tempat kembali mereka adalah nereka jahanam, dan seburuk buruk tempat kembali adalah tempat kemdali mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Wahai Rasul! Berjihadlah melawan orang-orang kafir dengan cara memerangi mereka dengan senjata. Berjihadlah melawan orang-orang munafik dengan menggunakan lisan dan hujah. Dan hadapilah kedua golongan itu dengan tegas, karena mereka pantas mendapatkan perlakuan seperti itu. Kelak tempat tinggal mereka di hari Kiamat ialah Neraka Jahanam dan seburuk-buruk tempat kembali ialah tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Hai Rasulallah, berjihadlah melawan orang-orang kafir dengan memerangi mereka menggunakan pedang, dan berjihadlah melawan orang-orang munafik dengan lisan dan hujjahmu. Bersikaplah keras kepada dua golongan itu, karena mereka layak mendapatkannya. Tempat mereka pada hari kiamat adalah neraka jahanam, dan seburuk-buruk tempat adalah tempat mereka itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. يٰٓأَيُّهَا النَّبِىُّ جٰهِدِ الْكُفَّارَ وَالْمُنٰفِقِينَ (Hai Nabi, berjihadlah (melawan) orang-orang kafir dan orang-orang munafik itu) Dan berjihad melawan orang-orang kafir adalah dengan memerangi mereka sampai mereka masuk Islam. Sedangkan berjihad melawan orang-orang munafik adalah dengan menegakkan hujjah atas mereka, dan menegakkan hukum had kepada mereka karena mereka adalah orang-orang yang paling banyak melanggar had sebab mereka tidak takut kepada Allah. وَاغْلُظْ عَلَيْهِمْ (dan bersikap keraslah terhadap mereka) Makna (الغلط) yakni hati yang keras dan sikap yang tegas; beginilah seharusnya muamalat orang-orang beriman kepada dua golongan ini (orang kafir dan munafik) di dunia, dan bagi mereka azab neraka di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Wahai nabi, berjihadlah melawan orang-rang kafir dengan berbagai cara, berupa harta, jiwa dan lisan, yaitu dengan perang atau perkataan. Berjihadlah juga melawan orang-orang munafik dengan perkataan, argumentasi, dan menegakkan hujjah dan batas-batas Allah. Dan bersikap keraslah terhadap mereka dalam perkataan dan tindakan, yaitu dengan tegas dan keras. Tempat mereka itu di nerqaka Jahanam, yaitu seburuk-buruk tempat kembali yang akan mereka datangi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, berjihadlah (melawan) orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka} bersikap keraslah atas dua kelompok itu {Tempat mereka adalah neraka Jahanam. Seburuk-buruk tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Allah berfirman kepada NabiNya sholallohu alaihi wasallam, “Hai Nabi, berjihadlah (melawan) orang-orang kafir dan orang-orang munafik itu.” Yakni bersungguh-sungguhlah dalam berjihad melawan mereka dan bersikap keras kepada mereka jika memang kondisinya menuntut itu, termasuk dalam jihad ini adalah jihad dengan tangan dan jihad dengan hujjah dan argumentasi. Siapa di antara mereka yang terang-terangan memerangi, maka dia dijihadi dengan tangan, lisan, pedang dan tombak, dan barangsiapa tunduk kepada Islam dengan perjanjian damai (dengan membayar jizyah) maka dia dijihadi dengan argument dan hujjah, dijelaskan kepadanya kebaikan Islam dan keburukan, kesyirikan, dan kekufuran. Ini yang mereka dapatkan di dunia. “Dan” adapun di akhirat maka tempat mereka ialah, “Neraka Jahanam.” Dan mereka tidak keluar darinya. “Dan itulah tempat kembali yang seburuk-buruknya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 73: Dengan perang. Dengan lisan dan hujjah. Dengan bentakan dan sikap marah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 73",
    "description": "Setelah Allah menjelaskan secara beriringan sifat orang-orang munafik dan orang-orang mukmin disertai balasan masing-masing, maka ayat ini menyeru kepada nabi Muhammad agar berjihad menghadapi mereka. Hal ini, disebabkan perilaku buruk mereka terhadap rasulullah dan kaum mukminin, yang sudah berulang kali menyakitinya secara fisik maupun psikis, bahkan tidak jarang tindakan mereka mengancam keselamatan beliau. Karena itu, wahai nabi dan kaum mukmin, berjihadlah melawan orang-orang kafir dan orang-orang munafik disebabkan perkataan dan perbuatan mereka yang nyata-Nyata menantang kamu, dan bersikaplah keras dan tegas terhadap mereka dalam berjihad agar mereka menghentikan perilaku buruknya sehingga tidak berani mengulanginya. Jika mereka terbunuh dan mati dalam keadaan kafir dan munafik, maka tempat mereka adalah neraka jahanam. Dan itulah seburukburuk tempat kembali. Perintah jihad itu bersifat kondisional dan bukan semata-mata tanpa sebab. Orang-orang munafik akan melakukan apa saja demi menutupi keburukan perilaku dan ucapannyanya. Bahkan, mereka berani bersumpah dengan nama Allah di hadapan engkau, wahai nabi, bahwa mereka tidak pernah mengatakan sesuatu yang menyakiti engkau, padahal sumpah itu bohong belaka. Sungguh, mereka telah mengucapkan perkataan kekafiran, yaitu mencela nabi Muhammad dan agama islam, dan telah menjadi kafir dengan terkuaknya kebusukan hati mereka setelah sebelumnya mereka menutupinya dengan pura-pura mengikuti ajaran islam, dan mereka juga sangat menginginkan apa yang mereka tidak dapat mencapainya, yaitu membunuh rasulullah. Mereka tidak mencela, melainkan didorong oleh rasa iri dan dengki karena Allah dan rasul-Nya melimpahkan karunia-Nya kepada mereka dengan jumlah lebih kecil, tidak sesuai dengan yang mereka harapkan. Maka, jika mereka bertobat dari sikap kemunafikan dan menyesalinya, sehingga tobatnya akan diterima, itu adalah lebih baik bagi mereka, dan jika mereka berpaling dari iman serta tetap dalam kemunafikannya, niscaya Allah akan mengazab mereka dengan azab yang pedih di dunia dengan berbagai bentuk dan di akhirat dengan neraka jahanam, dan mereka tidak mempunyai pelindung dan tidak pula penolong di bumi jika azab menimpa mereka."
  }
]