[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik bersumpah dengan nama Allah bahwa sesungguhnya mereka tidak mengatakan apapun yang menyakiti rasulullah dan kaum muslimin,sesungguhnya mereka itu benar-benar dusta. sesungguhnya mereka telah mengatakan kalimat kekafiran dan dengan itu mereka murtad keluar dari islam, dan berusha melancarkan mudarat terhadap rasulullah Muhammad, namun Allah tidak memberi kesempatan mereka untuk itu. Orang-orang munafik tidak mendapati sesuatu yang dapat mereka cela dan kritik, hanya saja Allah memberikan karunia kepada mereka, dan Dia mencukupi mereka dengan apa yang dibukakan Allah bagi nabiNya berupa kebaikan dan keberkahan. Apabila orang-orang kafir itu kembali menuju keimanan dan taubat, maka itu lebih baik bagi mereka. Dan apabila mereka berpaling dan bertahan dalam keadaan mereka itu, niscaya Allah akan menyiksa mereka dengan siksaan yang pedih di dunia melalui tangan-tangan kaum mukminin, dan di akhirat dengan nereka jahanam. Dan mereka tidak memiliki penyelamat yang menyelamatkan mereka dan penolong yang menghalangi siksaan buruk dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Orang-orang munafik itu bersumpah palsu dengan nama Allah bahwa mereka tidak pernah mengatakan caci maki terhadapmu dan mencela agamamu sebagaimana berita yang sampai ke telingamu. Padahal mereka benar-benar mengatakan sesuatu yang sampai ke telingamu, yaitu mengatakan kata-kata yang dapat menjerumuskan mereka ke dalam kekafiran. Mereka memperlihatkan kekafiran setelah mereka memperlihatkan keimanan. Mereka benar-benar mengharapkan sesuatu yang belum berhasil mereka capai yaitu menyerang Nabi -ṣallallāhu 'alaihi wa sallam-. Tidaklah mereka mengingkari sesuatu kecuali sesuatu yang tidak mungkin diingkari. Yaitu bahwa Allah telah melimpahkan karunia-Nya kepada mereka dengan memberi mereka kekayaan yang berasal dari harta rampasan perang yang Allah berikan kepada nabi-Nya. Jika mereka bertobat kepada Allah dan meninggalkan kemunafikan mereka, niscaya tobat mereka itu akan lebih baik bagi mereka daripada mempertahankan kemunafikan. Jika mereka enggan bertobat kepada Allah, niscaya Allah akan menghukum mereka dengan azab yang sangat menyakitkan di Akhirat dengan memasukkan mereka ke dalam Neraka, sedangkan mereka tidak memiliki siapa pun yang dapat menyelamatkan dan melindungi mereka dari azab tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Setelah Allah menyebutkan dalil secara umum mengenai keburukan orang-orang munafik, kemudian Allah menyebutkan dalil secara khusus: “Orang-orang munafik itu bersumpah dengan nama Allah dengan sumpah dusta bahwa mereka tidak melakukan penghinaan terhadapmu dan agamamu sebagaimana berita yang sampai kepadamu. Namun sebenarnya mereka telah mengatakan sesuatu yang telah membuat mereka kafir dan menampakkan kekafiran setelah sebelumnya menampakkan keimanan. Mereka telah berusaha untuk membunuh Rasulullah, namun tidak berhasil. Mereka tidak mengingkari melainkan sesuatu yang tidak dapat dipungkiri, bahwa Allah telah memberi mereka kekayaan dengan harta ghanimah yang Allah karuniakan kepada Rasulullah. Jika mereka bertaubat kepada Allah dari kemunafikan mereka, maka taubat mereka lebih baik daripada tetap dalam kemunafikan. Dan jika mereka enggan bertaubat kepada Allah, maka Dia akan mengazab mereka dengan azab yang pedih di dunia dengan terbunuh di medan perang atau tertawan, dan azab yang pedih di akhirat dengan api neraka. Mereka tidak memiliki seorang penolongpun untuk menolong mereka dari azab tersebut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. يَحْلِفُونَ بِاللهِ مَا قَالُوا۟ (Mereka (orang-orang munafik itu) bersumpah dengan (nama) Allah, bahwa mereka tidak mengatakan (sesuatu yang menyakitimu)) Ayat ini turun karena ucapan sebagian orang-orang munafik: “jika Muhammad itu benar terhadap saudara-saudara kami yang merupakan pemimpin-pemimpin dan orang-orang terbaik kami maka sungguh kami lebih buruk daripada keledai”. Maka ucapan ini sampai kepada Rasulullah, lalu orang yang mengatakan ini mulai bersumpah atas nama Allah bahwa ia tidak mengatakannya. Pendapat lain mengatakan bahwa sebab turunnya ayat ini bukanlah kisah ini. وَلَقَدْ قَالُوا۟ كَلِمَةَ الْكُفْر(Sesungguhnya mereka telah mengucapkan perkataan kekafiran) Telah dijelaskan tentang ucapan mereka ini. وَكَفَرُوا۟ بَعْدَ إِسْلٰمِهِمْ (dan telah menjadi kafir sesudah Islam) Yakni mereka melakukan apa yang membuat mereka menjadi kafir jika keislaman mereka memang diperhitungkan. وَهَمُّوا۟ بِمَا لَمْ يَنَالُوا۟ ۚ (dan mengingini apa yang mereka tidak dapat mencapainya,) Terdapat pendapat mengatakan bahwa mereka berencana untuk membunuh Rasulullah di malam Aqabah pada perang Tabuk. وَمَا نَقَمُوٓا۟ إِلَّآ أَنْ أَغْنَىٰهُمُ اللهُ وَرَسُولُهُۥ مِن فَضْلِهِۦ ۚ( dan mereka tidak mencela (Allah dan Rasul-Nya), kecuali karena Allah dan Rasul-Nya telah melimpahkan karunia-Nya kepada mereka) Yakni mereka tidak mencela dan mengingkari kecuali kepada sesuatu yang sebenarnya layak untuk mendapatkan pujian dan sanjungan, yaitu berupa kecukupan hidup yang diberikan Allah kepada mereka dari karunia-Nya. Orang-orang munafik tersebut dulunya mereka dalam kesempitan hidup, dan ketika Rasulullah berhijrah ke kota Madinah kehidupan mereka menjadi lapang dan harta mereka menjadi banyak. فَإِن يَتُوبُوا۟ يَكُ خَيْرًا لَّهُمْ ۖ( Maka jika mereka bertaubat, itu adalah lebih baik bagi mereka) Yakni bertaubat lebih baik bagi mereka daripada kemunafikan yang mereka lakukan. وَإِن يَتَوَلَّوْا۟( dan jika mereka berpaling) Berpaling dari taubat dan keimanan. يُعَذِّبْهُمُ اللهُ عَذَابًا أَلِيمًا فِى الدُّنْيَا (niscaya Allah akan mengazab mereka dengan azab yang pedih di dunia) Dengan terbunuh atau tertawan. وَالْاٰخِرَةِ ۚ (dan akhirat) Dengan azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Orang-orang munafik itu bersumpah palsu demi Allah, yaitu bahwa mereka tidak mengatakan sesuatu yang telah sampai kepadamu berupa kutukan dan kata-kata sia-sia. Sungguh mereka telah mengucapkan kata-kata kufur, yaitu mengutuk Nabi SAW, dan mengatakan hal sia-sia tentang agama. Mereka menampakkan kekufuran setelah menampakkan keislamannya. Dan mereka menginginkan sesuatu yang tidak bisa dicapai, yaitu membunuh nabi SAW di malam ‘Aqabah di tengah perang Tabuk, mereka berjumlah sekitar puluhan laki-laki. Mereka bermaksud mengusir orang-orang mukmin dari Madinah. Mereka tidak mencela, membenci, dan ingkar kecuali mendapatkan sesuatu yang harus disyukuri dan dipuji, yaitu mereka diberi kekayaan Allah dari keutamaanNya berupa rampasan perang, setelah mereka berada dalam kesempitan hidup. Maka jika mereka mau bertaubat dan beriman, maka iman tersebut baik bagi mereka, namun jika mereka menolak beriman, maka Allah akan menghukum mereka dengan azab yang pedih di dunia, dengan dibunuh dan ditawan, dan diazab dengan azab neraka di akhirat. Dan tidaklah mereka memiliki penolong yang menyelamatkan mereka di dunia. Tidak ada pula penyelamat yang menyelamatkan dan melindungi mereka dari azab. Ayat ini turun terkait orang-orang munafik di tengah perjalanan menuju perang Tabuk, yaitu ketika mereka mengutuk rasulullah SAW dan para sahabatnya dan berkata sia-sia tentang agama. Lalu Hudzaifah menyampaikan apa yang mereka katakan kepada rasulullah, lalu beliau bertanya kepada mereka: “Wahai orang munafik, apakah maksud ucapan kalian yang sampai kepadaku ini?”, kemudian mereka bersumpah tidak mengatakan hal itu, lalu turunlah ayat ini untuk menampik sumpah mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah dengan (nama) Allah bahwa mereka tidak mengatakan (sesuatu yang menyakitimu). Sungguh mereka benar-benar telah mengucapkan perkataan kekafiran dan mereka menjadi kafir setelah masuk Islam. Mereka menginginkan apa yang tidak mereka capai} orang-orang munafik itu menginginkan apa yang tidak mereka capai yaitu memerangi Rasulullah SAW ketika kembali dari perang Tabuk {Mereka tidak mencela} Mereka tidak mengutuk {melainkan karena Allah dan RasulNya telah melimpahkan karuniaNya kepada mereka. Maka jika mereka bertaubat, maka itu lebih baik bagi mereka. Jika mereka berpaling} berpaling dari keimanan dan taubat {niscaya Allah akan menghukum mereka dengan azab yang pedih di dunia dan akhirat. Tidak ada bagi mereka pelindung dan tidak pula penolong di bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Mereka (orang-orang munafik itu) bersumpah dengan (Nama) Allah, bahwa mereka tidak mengatakan (sesuatu yang menyakitimu). Sesungguhnya mereka telah mengucapkan perkataan kekafiran.” Yakni jika mereka mengucapkan ucapan seperti ucapan sebagian mereka, \"benar-benar orang yang kuat akan mengusir orang-orang yang lemah dari padanya\"(Al-Munafiqun:8). Dan perkataan yang mereka katakan satu demi satu yang menghina Rasulullah dan agamanya, jika dia mengetahui bahwa Nabi telah mendengar apa yang diucapkannya, maka dia datang kepada beliau bersumpah bahwa dia tidak mengatakannya, maka Allah membantah ucapan mereka, “Sesungguhnya mereka telah mengucapkan perkataan kekafiran dan telah menjadi kafir sesudah Islam.” Islam mereka yang lalu secara lahir memang mengentaskan mereka dari lingkaran kekufuran, akan tetapi ucapan mereka yang akhir membatalkan Islam mereka dan memasukkan mereka ke dalam kekufuran. “Dan mereka menginginkan apa yang mereka tidak dapat mencapainya.” Hal itu ketika mereka ingin mencelakai Nabi di perang Tabuk, Allah menceritakan perihal mereka kepada Nabi, maka beliau pun memerintahkan sebagian sahabat untuk menghalang-halangi maksud mereka. “Dan” keadaan mereka sesungguhnya adalah “mereka tidak mencela (Allah dan RasulNya)”, dan menjelek-jelekkan Rasulullah, “kecuali karena Allah dan RasulNya telah melimpahkan karuniaNya kepada mereka.” Setelah sebelumnya mereka adalah orang-orang miskin dan papa, ini termasuk perkara yang mengherankan, di mana mereka melecehkan orang yang menjadi penyebab keluarnya mereka dari kegelapan menuju cahaya dan penyebab kekayaan mereka setelah sebelumnya miskin. Padahal yang seharusnya mereka lakukan adalah menghormatinya, memuliakannya, dan beriman kepadanya, sehingga terkumpul faktor pendorong kekuatan (beragama) dan keluhuran kemanusiaan. Kemudian Allah menawarkan taubat kepada mereka, Dia berfirman, “Maka jika mereka bertaubat, itu adalah lebih baik bagi mereka”, karena taubat adalah dasar kebahagiaan dunia dan akhirat. “Dan jika mereka berpaling”, dari taubat dan dari kembali kepada Allah “niscaya Allah akan mengazab mereka dengan azab yang pedih di dunia dan di akhirat.” Di dunia dengan kesedihan, kecemasan, dan kemarahan atas pertolongan Allah terhadap agamaNya dan dukunganNya kepada NabiNya serta kegagalan mereka meraih apa yang mereka inginkan, dan di akhirat adalah dengan azab yang membakar. “Dan mereka sekali-kali tidak mempunyai pelindung di muka bumi”, yang mengurusi perkara-perkara mereka dan mewujudkan keinginan mereka, “dan tidak (pula) penolong”, yang menolak perkara yang tidak diinginkan. Apabila mereka telah terputus dari pertolongan Allah, maka yang ada adalah kesengsaraan, kerugian, keburukan, dan kemelaratan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 74: Ibnu Jarir berkata: telah menceritakan kepadaku Ayyub bin Ishaq bin Ibrahim, ia berkata: telah menceritakan kepada kami Abdullah bin Rajaa’, ia berkata: telah menceritakan kepada kami Israil dari Simak dari Sa’id bin Jubair dari Ibnu Abbas, ia berkata, “Rasulullah shallallahu 'alaihi wa sallam pernah duduk di bawah naungan sebuah pohon dan bersabda, “Sesungguhnya akan datang kepada kalian seseorang yang memandang dengan kedua mata setan. Apabila dia datang, maka janganlah berbicara dengannya.” Tidak lama kemudian datanglah seorang laki-laki yang nampak biru, lalu Rasulullah shallallahu 'alaihi wa sallam memanggilnya dan bersabda, “Atas dasar apa kamu dan kawan-kawanmu memakiku?” Maka orang itu pun pergi dan kembali dengan membawa kawan-kawannya. Mereka pun bersumpah dengan nama Allah, bahwa mereka tidak mengucapkannya dan tidak melakukannya, maka Rasulullah shallallahu 'alaihi wa sallam memaafkan mereka. Alah Subhaanahu wa Ta'aala lantas menurunkan ayat, “Yahlifuuna billahi maa qaaluu…dst.” kemudian menyifai mereka semua sampai akhir ayat. Dalam Ash Shahihul Musnad oleh Syaikh Muqbil disebutkan, “Ayyub bin Ishaq bin Ibrahim bin Safiri adalah guru At Thabari. Ibnu Abi Hatim berkata, “Kami mencatat tentangnya ketika di Ramalah, dan saya sebutkan kepada bapak saya, lantas ia mengenalinya dan berkata, “Ia seorang yang sangat jujur.” Sedangkan Abdullah bin Raja’ Abu ‘Amr, Abu Zur’ah berkata, “Hasan haditsnya dari Israil,” Abu Hatim berkata, “Tsiqah”, dan Ya’qub bin Sufyan berkata, “Tsiqah.” Seperti perkataan mereka, “Sungguh, orang yang kuat akan mengusir orang-orang yang lemah.” Orang-orang yang lemah yang mereka maksud adalah Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya. Demikian pula olok-olokkan mereka kepada Allah, ayat-ayat-Nya dan Rasul-Nya. Maksudnya mereka ingin membunuh Nabi Muhammad shallallahu 'alaihi wa sallam sepulang dari Tabuk. Jumlah mereka ketika itu dua belas orang. Mereka mencoba membunuh Beliau pada malam ‘Aqabah ketika Beliau pulang dari Tabuk, di mana ketika itu, Beliau melewati ‘aqabah (jalan di atas bukit), sedangkan para sahabat yang lain melewati jalan lembah. Ketika itu, ‘Ammar bin Yasir dan Hudzaifah bin Al Yaman bersama Beliau memegang unta Beliau dan mengarahkannya. Tiba-tiba mereka mendengar serangan orang-orang yang meutup muka dari belakang, maka Beliau mengirim Hudzaifah, kemudian Hudzaifah memukul muka unta-unta mereka dengan tongkatnya, maka Allah menaruh rasa takut ke dalam hati mereka dan mereka pun lari ketakutan. Kemudian Rasulullah shallallahu 'alaihi wa sallam menyebutkan nama-nama mereka itu dan maksud mereka melakukan hal itu kepada Hudzaifah, oleh karenanya Hudzaifah disebut shaahib sir (orang yang mendapat rahasia) Rasulullah shallallahu 'alaihi wa sallam. Sungguh aneh, mengapa mereka mencela Rasulullah shallallahu 'alaihi wa sallam; orang yang menjadi sebab keluarnya mereka dari kebodohan kepada cahaya, menjadikan mereka kaya setelah sebelumnya miskin. Bukankah seharusnya orang yang berjasa kepada mereka dimuliakan, dipercayai dan dihormati; tidak dicela, dan pantaskah air susu dibalas dengan air tuba? Dari kemunafikan dan beriman kepadamu. Di ayat ini, Allah Subhaanahu wa Ta'aala menawarkan mereka untuk bertobat meskipun mereka telah melakukan perbuatan yang demikian buruk. Dengan mendapatkan kesedihan, kegelisahan dan kekecewaan karena menangnya agama Allah dan apa yang mereka harapkan tidak tercapai. Dengan dimasukkan ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 74",
    "description": "Orang-orang munafik akan melakukan apa saja demi menutupi keburukan perilaku dan ucapannyanya. Bahkan, mereka berani bersumpah dengan nama Allah di hadapan engkau, wahai nabi, bahwa mereka tidak pernah mengatakan sesuatu yang menyakiti engkau, padahal sumpah itu bohong belaka. Sungguh, mereka telah mengucapkan perkataan kekafiran, yaitu mencela nabi Muhammad dan agama islam, dan telah menjadi kafir dengan terkuaknya kebusukan hati mereka setelah sebelumnya mereka menutupinya dengan pura-pura mengikuti ajaran islam, dan mereka juga sangat menginginkan apa yang mereka tidak dapat mencapainya, yaitu membunuh rasulullah. Mereka tidak mencela, melainkan didorong oleh rasa iri dan dengki karena Allah dan rasul-Nya melimpahkan karunia-Nya kepada mereka dengan jumlah lebih kecil, tidak sesuai dengan yang mereka harapkan. Maka, jika mereka bertobat dari sikap kemunafikan dan menyesalinya, sehingga tobatnya akan diterima, itu adalah lebih baik bagi mereka, dan jika mereka berpaling dari iman serta tetap dalam kemunafikannya, niscaya Allah akan mengazab mereka dengan azab yang pedih di dunia dengan berbagai bentuk dan di akhirat dengan neraka jahanam, dan mereka tidak mempunyai pelindung dan tidak pula penolong di bumi jika azab menimpa mereka. Ayat ini membicarakan sifat buruk lain kaum munafik. Dan di antara mereka, orang-orang munafik, ada orang yang telah berjanji kepada Allah, sesungguhnya jika Allah memberikan sebagian dari karunia-Nya kepada kami, niscaya kami akan bersedekah dan niscaya kami termasuk orang-orang yang saleh dengan selalu berinfak, menjaga hubungan kekerabatan, tetap ikut serta dalam berjihad dan perbuatan-perbuatan baik lainn."
  }
]