[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara orang-orang munafik yang fakir miskin, ada orang yang menegaskan ikrar pada dirinya, bahwa apabila Allah memberikan kepadanya harta, pasti dia akan menyedekahkan dan akan benar-benar berbuat selayaknya orang shalih berbuat dengan harta-harta mereka, dan akan benar-benar berjalan di jalan kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Di antara orang-orang munafik itu ada orang-orang yang berjanji kepada Allah seraya berkata, \"Sungguh, jika Allah memberikan sebagian karunia-Nya kepada kami, niscaya kami benar-benar akan menyedekahkannya kepada orang-orang yang membutuhkan, dan kami benar-benar akan menjadi orang-orang saleh yang amalannya baik.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Dan sebagian orang-orang munafik berjanji kepada Allah dengan berkata: “Jika Allah memberi kami karunia-Nya, niscaya kami akan bersedekah kepada orang-orang yang membutuhkan dan kami akan menjadi orang-orang shalih yang banyak berbuat baik.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَمِنْهُم مَّنْ عٰهَدَ اللهَ لَئِنْ ءَاتَىٰنَا مِن فَضْلِهِۦ لَنَصَّدَّقَنَّ (Dan diantara mereka ada orang yang telah berikrar kepada Allah: “Sesungguhnya jika Allah memberikan sebahagian karunia-Nya kepada kami, pastilah kami akan bersedekah) Terdapat pendapat mengatakan ayat ini turun untuk Tsa’labah bin Hathib, salah seorang penduduk Madinah yang ikut mendirikan masjid Dhirar. Ibnu Jarir meriwayatkan kisah singkatnya dengan menyebutkan sanad-sanadnya, dari Abu Umamah al-Bahily ia berkata: “Tsa’lab bin Hatib mendatangi Rasulullah lalu bekata: “Wahai Rasulullah, mohonlah kepada Allah agar aku diberi rezeki harta yang banyak, demi Dzat yang mengutusmu dengan kebenaran, jika Allah memberiku harta yang banyak niscaya aku akan memberi sebagiannya kepada orang yang berhak mendapatkannya”. Rasulullah menjawab: “celakalah kamu hai Tsa’labah! Harta yang sedikit yang kau syukuri lebih baik daripada harta yang banyak namun kau tak mampu mensyukurinya”. Ia berkata: “Wahai Rasulullah, mohonkanlah kepada Allah”. Maka rasulullah berdoa: “Ya Allah berilah ia rezeki harta yang banyak”. Abu Umamah berkata: maka Tsa’labah memelihara kambing lalu kambing itu berkembang seperti cacing yang berkembang, sampai-sampai kota Madinah terasa sempit bagi kambing-kambingnya, kemudian kambing itu semakin berkembang sehingga ia membawanya tinggal di luar Madinah, dan ia menjadi tidak ikut melaksanakan sholat jum’at atau mengurus jenazah. Rasulullah kemudian bersabda: “celakalahTsa’labah bin Hathib, celakalah Tsa’labah bin Hathib”. Lalu Rasulullah mengutus dua orang untuk mengambil zakat kepada Tsa’labah, namun ia menanggapi keduanya dengan berkata: “ini merupakan jizyah”. Maka kedua utusan itu kembali ke Madinah. Ketika Rasulullah melihat mereka berdua, Beliau berkata sebelum berbicara kepada keduanya: “celakalah Tsa’labah bin Hathib”. Maka Allah menurunkan tiga ayat ini (ayat 75-77) menerangkan tentang dirinya. Kemudian para kerabat Tsa’labah mendengar ayat ini lalu mendatangi Tsa’labah seraya berkata: “celakalah engkau Tsa’labah, telah diturunkan ayat ini dan ini yang menerangkan tentang dirimu”. Abu Umamah berkata: maka Tsa’labah mendatangi Rasulullah seraya berkata: “Wahai Rasulullah, ini adalah zakat dari hartaku”. Rasulullah bersabda: “sesungguhnya Allah telah melarangku untuk menerima zakat darimu”. Maka Tsa’labah menangis sambil menuangkan tanah ke atas kepalanya. Abu Bakar juga tidak menerima zakatnya di masa kepemimpinannya, begitu pula Umar bin Khattab dan Utsman. Dan ia meninggal di zaman pemerintahan Utsman bin Affan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "75-77 1 ). Berapa banyak orang yang telah mencapai derajat yang tinggi di dunia namun tidak mampu menunaikan apa yang menjadi kewajiaban baginya, sehingga pencapaian yang ia gapai adalah musibah-dan semua ini terjadi dalam perkara dunia-, sebagaimana firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ } \"Dan diantara mereka ada orang yang telah berikrar kepada Allah: \"Sesungguhnya jika Allah memberikan sebahagian karunia-Nya kepada kami, pastilah kami akan bersedekah\". 2 ). Banyak orang yang memilih bersumpah ketika perkara yang ia hadapi menjadi buruk, padahal hadits telah menyebutkan bahwa tindakannya itu tidak lain kecuali mendatangkan keburukan lain, hal ini dikuatkan oleh firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Dan di antara orang-orang munafik itu ada yang berjanji kepada Allah “Jika Dia (Allah) memberi kami keutamaan dan kemuliaanNya, sungguh kami akan mengeluarkan zakat mal dan menunaikan pekerjaan orang-orang shalih dengan mengeluarkan setiap harta yang wajib dengan pasti. Ayat ini turun terkait para lelaki munafik yaitu Nabtal bin Al-Harits, Wajad bin Qays, dan Mu’tab bin Qusyair."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka} di antara orang-orang munafik {ada yang telah berjanji kepada Allah,“Sungguh jika Dia memberikan sebagian dari karuniaNya kepada kami, niscaya kami akan benar-benar bersedekah dan benar-benar termasuk orang-orang yang shalih.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Yakni, di antara orang-orang munafik itu ada yang berjanji kepada Allah “Sesungguhnya jika Allah memberikan sebagian karuniaNya kepada kami”, dari dunia, lalu Dia melapangkannya dan membentangkannya untuk kami, “Pastilah kami akan bersedekah dan pastilah kami termasuk orang-orang yang shalih.” Kami akan bersilaturahim, menjamu tamu, membantu orang yang mendapatkan musibah, dan melakukan amalan-amalan yang baik lagi shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 75: Yakni melapangkan rezeki-Nya kepada kami dan mengayakan kami. Seperti melakukan sedekah, menyambung tali silaturrahim, menjamu tamu, membantu pembela kebenaran dan mengerjakan amal saleh lainnya. Faedah/catatan: Sebagian ahli tafsir menyebutkan, bahwa ayat ini turun berkenaan dengan seseorang yang bernama Tsa’labah, ia datang kepada Nabi shallallahu 'alaihi wa sallam agar didoakan menjadi orang yang kaya. Ia berjanji kepada Allah, jika Allah menjadikannya kaya, maka ia akan bersedekah, menyambung tali silaturrahim, dan menolong penegak kebenaran, maka Nabi shallallahu 'alaihi wa sallam mendoakannya. Ia memiliki seekor kambing yang kemudian berkembang biak menjadi banyak yang membuatnya sibuk sampai tidak hadir shalat berjama’ah kecuali beberapa waktu saja, dan kemudian ia bertambah sibuk sampai tidak sempat shalat berjama’ah selain shalat Jum’at saja, dan bertambah sibuk lagi sampai ia tidak shalat Jum’at dan shalat berjamaah. Maka Nabi shallallahu 'alaihi wa sallam mencarinya dan mengirimkan orang untuk mengambil zakat darinya, namun Tsa’labah tidak memberikan. Ketika ayat ini urun, maka sebagian keluarganya menyampaikan ayat ini kepadanya, maka ia pun datang membawa zakatnya, namun Nabi shallallahu 'alaihi wa sallam tidak menerimanya. Setelah Nabi shallallahu 'alaihi wa sallam wafat, maka ia datang membawa zakat kepada Abu Bakar, namun Abu Bakar tidak menerimanya, dan kemudian kepada Umar, namun ia juga tidak menerimanya. Kisah ini meskipun masyhur, namun sesungguhnya tidak shahih. Kisah ini didha’ifkan oleh para pakar ahli hadits, seperti Ibnu Hazm, Baihaqi, Qurthubi, Haitsami, Al ‘Iraqi, Ibnu Hajar, As Suyuthi, Al Manawi dan lainnya. Mereka menerangkan bahwa dalam isnadnya terdapat Ali bin Zaid seorang yang dha’if, sebagaimana di antara perawinya ada yang bermana Ma’aan bin Rifaa’ah dan Al Qaasim bin Abdurrahman, di mana keduanya adalah dha’if (lihat ta’liq Abdurrahman bin Mu’allaa Al Luwaihiq terhadap kitab tafsir As Sa’diy pada tafsir ayat 75-78 dari surat At Taubah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 75",
    "description": "Ayat ini membicarakan sifat buruk lain kaum munafik. Dan di antara mereka, orang-orang munafik, ada orang yang telah berjanji kepada Allah, sesungguhnya jika Allah memberikan sebagian dari karunia-Nya kepada kami, niscaya kami akan bersedekah dan niscaya kami termasuk orang-orang yang saleh dengan selalu berinfak, menjaga hubungan kekerabatan, tetap ikut serta dalam berjihad dan perbuatan-perbuatan baik lainn namun, ternyata mereka mengingkari janji. Buktinya, ketika Allah memberikan kepada mereka sebagian dari karunia-Nya, mereka menjadi kikir. Jangankan berinfak, zakat pun tidak mereka keluarkan sesuai dengan janjinya sendiri, dan bahkan mereka berpaling dari Allah dan rasulnya dan selalu menentang kebenaran."
  }
]