[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Allah memberikan kepada mereka sebagian karuniaNya, mereka kikir untuk memberikan sedekah dan menginfakan harta dalam jalan kebaikan, bahkan mereka berbalik ke belakang, berpaling dari islam"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Kemudian tatkala Allah -Subḥānahu- memberikan sebagian karunia-Nya kepada mereka, ternyata mereka tidak menepati janji mereka kepada Allah. Sebaliknya, mereka justru kikir dan enggan menyedekahkan harta mereka sedikit pun, dan mereka pun enggan beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Namun setelah Allah memberi mereka karunia-Nya, mereka tidak memenuhi janji mereka kepada Allah, namun mereka berbuat kikir sehingga sama sekali tidak bersedekah, dan mereka berpaling dari keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. بَخِلُوا۟ بِهِۦ (mereka kikir dengan karunia itu) Sehingga ia tidak mengeluarkan zakat dari hartanya, tidak sebagaimana sumpah mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "75-77 1 ). Berapa banyak orang yang telah mencapai derajat yang tinggi di dunia namun tidak mampu menunaikan apa yang menjadi kewajiaban baginya, sehingga pencapaian yang ia gapai adalah musibah-dan semua ini terjadi dalam perkara dunia-, sebagaimana firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ } \"Dan diantara mereka ada orang yang telah berikrar kepada Allah: \"Sesungguhnya jika Allah memberikan sebahagian karunia-Nya kepada kami, pastilah kami akan bersedekah\". 2 ). Banyak orang yang memilih bersumpah ketika perkara yang ia hadapi menjadi buruk, padahal hadits telah menyebutkan bahwa tindakannya itu tidak lain kecuali mendatangkan keburukan lain, hal ini dikuatkan oleh firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Lalu ketika Allah memberi mereka harta dari keutamaanNya, mereka pelit dan tidak menginfakkannya sedikitpun sebagaimana yang mereka janjikan dan tidak mau taat kepada Allah. Mereka adalah orang-orang yang menyangkal ucapan dan janji mereka, dan tidak mau menepatinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah menganugerahkan kepada mereka sebagian dari karuniaNya, mereka menjadi kikir, berpaling dan menjadi penentang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “Maka setelah Allah memberikan kepada mereka sebagian dari karuniaNya”, mereka ingkari ucapan mereka sendiri, bahkan mereka “kikir” dan “berpaling”, dari ketaatan dan ketundukan, “dan mereka memanglah orang-orang yang selalu membelakangi (kebenaran)”, yakni tidak melihat kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 76: Dan tidak memenuhi janjinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 76",
    "description": "Namun, ternyata mereka mengingkari janji. Buktinya, ketika Allah memberikan kepada mereka sebagian dari karunia-Nya, mereka menjadi kikir. Jangankan berinfak, zakat pun tidak mereka keluarkan sesuai dengan janjinya sendiri, dan bahkan mereka berpaling dari Allah dan rasulnya dan selalu menentang kebenaran. Maka sebagai akibat dari kekikirannya itu, Allah menanamkan kemunafikan dalam hati mereka sehingga semakin bertambahlah keburukan yang dilakukan, sampai akhirnya kemunafikannya tidak bisa dikendalikan sampai pada waktu mereka menemui-Nya, yakni ajal menjemputnya. Demikian ini, karena mereka telah mengingkari janji yang telah mereka ikrarkan kepada-Nya, yakni kesediaan untuk bersedekah jika mereka memperoleh karunia-Nya dan juga karena mereka selalu berdusta dalam setiap ucapan-ucapan dan janji-janjinya."
  }
]