[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka balasan perbuatan mereka dan kesudahan nasib mereka, adalah Dia menambahkan kemunafikan di atas kemunafikan mereka, sehingga mereka tidak mampu melepaskan diri darinya hingga Hari perhitungan amal tiba. Hal itu disebabkan oleh pengingkaran mereka terhadap janji yang sudah mereka ikrarkan dengan kuat pada diri mereka, dan disebabkan kemunafikan dan kedustaan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Akibatnya kemunafikan mereka tetap bertahan di dalam hati mereka sampai hari Kiamat. Hal itu merupakan hukuman bagi mereka atas pengingkaran janji mereka kepada Allah dan kebohongan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Maka Allah membalas mereka dengan kemunafikan yang menetap dalam hati mereka hingga hari kiamat, sebagai balasan atas keingkaran mereka terhadap janji kepada Allah dan atas kebohongan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فَأَعْقَبَهُمْ (Maka Allah menimbulkan) Sebab kebakhilan dan pelanggaran perjanjian mereka dangan-Nya maka Allah menimbulkan kemunafikan yang terus-menerus dalam hati mereka sampai hari pertemuan dengan Allah. فِى قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْنَهُۥ(pada hati mereka sampai kepada waktu mereka menemui Allah) Yakni sampai hari kiamat, hari ketika mereka bertemu dengan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "75-77 1 ). Berapa banyak orang yang telah mencapai derajat yang tinggi di dunia namun tidak mampu menunaikan apa yang menjadi kewajiaban baginya, sehingga pencapaian yang ia gapai adalah musibah-dan semua ini terjadi dalam perkara dunia-, sebagaimana firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ } \"Dan diantara mereka ada orang yang telah berikrar kepada Allah: \"Sesungguhnya jika Allah memberikan sebahagian karunia-Nya kepada kami, pastilah kami akan bersedekah\". 2 ). Banyak orang yang memilih bersumpah ketika perkara yang ia hadapi menjadi buruk, padahal hadits telah menyebutkan bahwa tindakannya itu tidak lain kecuali mendatangkan keburukan lain, hal ini dikuatkan oleh firman Allah : { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Kebakhilan tersebut menumbuhkan yang sangat kokoh dalam hati mereka, sampai mati karena mengingkari apa yang mereka janjikan kepada Allah berupa sedekah dan perbuatan baik, atau Dia menambahi kemunafikan mereka sampai hari kiamat, yaitu hari dimana mereka bertemu Tuhan akibat mengingkari janji dan berdusta, yaitu ingkar janji dan tidak mau menepatinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Dia menimbulkan} menjadikan {kemunafikan dalam hati mereka sampai pada hari mereka menemuiNya} pada hari mereka menemui Allah melalui kematian {karena mereka telah mengingkari apa yang telah mereka ikrarkan kepada Allah dan karena mereka selalu berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Karena mereka tidak menepati apa yang mereka janjikan kepada Allah, Allah menghukum mereka dan “Allah menimbulkan kemunafikan pada hati mereka sampai kepada waktu mereka menemui Allah, karena mereka telah memungkiri terhadap Allah apa yang telah mereka ikrarkan kepadaNya dan (juga) karena mereka selalu berdusta.” Maka hendaknya seorang Mukmin mewaspadai sifat buruk ini, yaitu berjanji kepada Allah jika maksudnya yang begini dan begini tercapai, maka dia tidak akan melakukan ini dan itu, kemudian dia tidak menepati, karena bisa jadi Allah menghukumnya dengan kemunafikan seperti mereka. Dan sungguh Nabi Muhammad sholallohu alaihi wasallam telah bersabda dalam hadits yang shohih : \"tanda munafiq itu ada tiga : jika berbicara dia berdusta, jika berjanji dia ingkar, dan jika diberi amanat dia khianat\" Munafik ini berjanji kepada Allah jika Dia memberikan karuniaNya kepadanya niscaya dia akan bersedekah dan menjadi orang yang shalih, dia berbicara lalu berdusta, dia melakukan suatu perjanjian lalu mengkhianati, dan dia berjanji lalau tidak menepati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 77: Oleh karena itu, seorang mukmin harus berhati-hati, jangan sampai ketika ia berjanji kepada Allah, bahwa jika keinginannya dikabulkan Allah, maka ia akan melakukan ini dan itu, lalu ia tidak melakukannya, karena bisa saja Allah menanamkan kemunafikan dalam hatinya sebagaimana yang menimpa mereka. Nabi shallallahu 'alaihi wa sallam bersabda: آيَةُ الْمُنَافِقِ ثَلاَثٌ : إِذَا حَدَّثَ كَذَبَ ، وَإِذَا وَعَدَ أَخْلَفَ ، وَإِذَا اؤْتُمِنَ خَانَ “Tanda orang munafik itu tiga; apabila berbicara berdusta, apabila berjanji mengingkari, dan apabila dipercaya khianat.” (HR. Bukhari-Muslim) Nah, orang tersebut melakukan yang demikian, ia berjanji namun mengingkari dan berbicara namun berdusta. Berdasarkan ayat ini, maka perbuatan-perbuatan tersebut meskipun sebagai nifak ‘amali namun bisa menjadi jembatan ke arah nifak akbar, yaitu nifa i’tiqadiy, nas’alullahs salaamah wal ‘aafiyah. Oleh karena itu, dalam ayat selanjutnya Allah mengancam mereka yang memiliki sifat-sifat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 77",
    "description": "Maka sebagai akibat dari kekikirannya itu, Allah menanamkan kemunafikan dalam hati mereka sehingga semakin bertambahlah keburukan yang dilakukan, sampai akhirnya kemunafikannya tidak bisa dikendalikan sampai pada waktu mereka menemui-Nya, yakni ajal menjemputnya. Demikian ini, karena mereka telah mengingkari janji yang telah mereka ikrarkan kepada-Nya, yakni kesediaan untuk bersedekah jika mereka memperoleh karunia-Nya dan juga karena mereka selalu berdusta dalam setiap ucapan-ucapan dan janji-janjinya. Mereka berani melakukan kemunafikan. Tidakkah mereka mengetahui bahwa Allah mengetahui rahasia dan bisikan mereka yang mendorong kepada keburukan dan kejahatan, dan bahwa Allah mengetahui segala yang gaib' sungguh, mereka mengetahui akan hal itu."
  }
]