[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah orang-orang munafik itu tahu bahwa sesengguhnya Allah mengetahui apa yang mereka sembunyikan dalam hati mereka dan apa yang mereka ceritakan di tempat-tempat berkumpul mereka, berupa tipu daya dan makar jahat, dan sesungguhnya Allah mahamengetahui perkara-perkara ghaib? kemudian Dia akan memberi balasan kepada mereka atas perbuatan-perbuatan yang telah Allah perhitungkan atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Tidakkah orang-orang munafik itu menyadari bahwa Allah mengetahui tipu daya dan makar yang mereka sembunyikan di tempat-tempat berkumpul mereka, dan sesungguhnya Allah -Subḥānahu- Maha Mengetahui perkara-perkara gaib? Maka tidak ada sedikit pun amal perbuatan mereka yang luput dari pengetahuan-Nya dan Dia akan memberi mereka balasan yang setimpal dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Tidakkah orang-orang munafik itu mengetahui bahwa Allah Maha Mengetahui tipu daya dan makar yang mereka rahasiakan di majelis-majelis mereka dan Maha Mengetahui segala hal ghaib? Sehingga tidak ada yang tersembunyi dari-Nya, dan Allah akan membalas mereka atas apa yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. أَلَمْ يَعْلَمُوٓا۟ (Tidaklah mereka tahu) Yakni orang-orang munafik. أَنَّ اللهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَىٰهُمْ(bahwasanya Allah mengetahui rahasia dan bisikan mereka) Yakni tuduhan atas Rasulullah, para sahabatnya, dan agama Islam yang mereka bisikkan diantara mereka. وَأَنَّ اللهَ عَلّٰمُ الْغُيُوبِ(dan bahwasanya Allah amat mengetahui segala yang ghaib.) Sehingga tidak ada yang tersembunyi bagi-Nya, termasuk apa yang diperbuat oleh orang-orang munafik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Apakah orang-orang munafik itu tidak tahu bahwa Allah mengetahui apa yang terselip dalam dada mereka berupa kekufuran dan niat jahat, dan apa yang mereka bicarakan secara rahasia di rumah mereka berupa pembicaraan sia-sia tentang Islam, Nabi SAW dan orang-orang mukmin. Dan sesungguhnya tidak ada sesuatu pun yang luput dari Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak mengetahui bahwa Allah mengetahui rahasia mereka} apa yang mereka sembunyikan dalam diri mereka {dan bisikan mereka} apa yang mereka bicarakan di antara mereka secara rahasia {dan sesungguhnya Allah Maha Mengetahui sesuatu yang ghaib"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Karena itu Allah mengancam orang yang melakukan hal ini dengan FirmanNya, “Tidakkah mereka tahu bahwasanya Allah mengetahui rahasia dan bisikan mereka, dan bahwasanya Allah amat mengetahui segala yang ghaib?” Allah akan membalas mereka atas apa yang mereka kerjakan yang diketahui oleh Allah. Ayat-ayat ini turun mengenai seorang munafik yang bernama Tsa’labah, dia datang kepada Nabi memohon kepadanya untuk berdoa kepada Allah agar memberinya karunia, dan bahwa jika Allah memberinya maka dia akan bersedekah, bersilaturahim, dan menolong orang yang dalam musibah, maka Nabi mendoakannya. Dia memiliki kambing, kambingnya itu terus berkembang biak sehingga dia menggembalakannya sampai ke luar Madinah, akibatnya dia tidak menghadiri kecuali sebagian shalat lima waktu, lalu dia semakin menjauh, akibatnya dia tidak lagi menghadiri kecuali Shalat Jum’at, kambingnya bertambah banyak maka dia semakin jauh menggembalakannya, akibatnya adalah dia tidak menghadiri jamaah dan Jum’at. Nabi merasa kehilangan dia, beliau diberi tahu tentang keadaannya, maka Nabi mengutus orang untuk mengambil zakat dari orang-orang yang wajib zakat. Ketika mereka mendatangi Tsa’labah, maka Tsa’labah berkata, “Ini tidak lain kecuali jizyah. Ini tidak lain kecuali saudaranya jizyah.” Ketika Tsa’labah tidak mau membayar zakat, mereka datang kepada Nabi dan menyampaikan hal itu. Ketika ayat ini turun padanya dan pada orang semisalnya, maka sebagian keluarganya menyampaikannya kepada Tsa’labah. Dia pun datang membawa zakatnya kepada Nabi, tetapi Nabi tidak mau menerimanya. Setelah Nabi wafat, zakatnya dibawa kepada Abu bakar, Abu bakar juga tidak mau menerimanya, lalu kepada Umar setelah Abu Bakar, dan Umar pun tidak mau menerimanya. Dikatakan bahwa Tsa’labah meninggal pada masa Utsman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 78: Seperti bisikan mereka yang isinya mencela Nabi shallallahu 'alaihi wa sallam dan para sahabat, serta mencela agama Islam. Sehingga Dia akan membalas semua amal mereka meskipun tersembunyi bagi orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 78",
    "description": "Mereka berani melakukan kemunafikan. Tidakkah mereka mengetahui bahwa Allah mengetahui rahasia dan bisikan mereka yang mendorong kepada keburukan dan kejahatan, dan bahwa Allah mengetahui segala yang gaib' sungguh, mereka mengetahui akan hal itu. Ayat sebelumnya menjelaskan sifat-sifat buruk orang-orang munafik, antara lain kikir, bersumpah palsu, dan tidak bersyukur. Bukan saja itu, di antara mereka bahkan ada yang secara terus-menerus mencela orang-orang beriman yang memberikan sedekah dengan sukarela dengan menyebutnya pamrih jika yang disedekahkan besar; dan juga mencela orang-orang yang tidak mendapatkan harta untuk disedekahkan kecuali sekadar kesanggupannya, maka orang-orang munafik itu menghina mereka, orang-orang mukmin. Akibat perbuatannya itulah Allah akan membalas penghinaan mereka di dunia dengan tersingkapnya kebusukan hatinya, dan mereka akan mendapat azab yang pedih di akhirat kelak."
  }
]