[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersama bakhilnya orang-orang munafik itu, orang-orang yang bersedekah juga tidak bebas dari gangguan mereka. Apabila orang-orang kaya bersedekah dengan harta yang banyak, mereka mencelanya dan menuduh mereka berbuat riya, dan apabila orang-orang fakir bersedekah sesuai dengan kemampuan mereka, mereka mengolok-ngolok mereka dan berkata sebagai ejekan terhadap mereka, ”apa yang dapat diperbuat oleh sedekah mereka itu?” Allah pasti membalas ejekan orang-orang munafik itu, dan mereka juga akan mendapatkan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Orang-orang yang mencela kaum mukminin yang dengan sukarela memberikan sedekah dalam jumlah yang sedikit, karena hanya sedikit itulah kemampuan mereka, maka orang-orang itu menghina orang-orang mukmin dengan mengatakan, \"Apa gunanya sedekah mereka itu?\" Allah pasti menghina mereka sebagai balasan atas penghinaan mereka terhadap orang-orang mukmin. Dan mereka akan mendapatkan azab yang sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Kemudian Allah menyebutkan perbuatan buruk lainnya yang dimiliki orang-orang munafik, yaitu merendahkan orang yang bersedekah dengan suka rela. Mereka merendahkan orang-orang beriman yang bersedekah dengan sedikit barang karena itulah yang mereka miliki dan mereka mampu; sehingga orang-orang munafik itu merendahkan mereka dengan berkata: “Apa yang dapat dimanfaatkan dari sedekah kalian itu?” Maka Allah merendahkan mereka sebagai balasan telah merendahkan orang-orang beriman, dan mereka akan mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ (yaitu orang-orang yang mencela orang-orang mukmin yang memberi sedekah dengan sukarela) Dahulu mereka mencela orang-orang beriman apabila menyedekahkan harta mereka yang sedikit atau mengeluarkannya untuk zakat. Orang- orang munafik itu berkata: “Allah tidak butuh pada harta semacam ini”. Dan apabila seseorang dari orang beriman bersedekah dengan harta yang banyak, maka orang-orang munafik itu berkata: “dia melakukan itu untuk pamer saja”. وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ (dan (mencela) orang-orang yang tidak memperoleh (untuk disedekahkan) selain sekedar kesanggupannya) Mereka tidak mendapatkan sesuatu untuk disedekahkan kecuali sesuatu yang sedikit sesuai dengan kemampuan mereka. سَخِرَ اللهُ مِنْهُمْ (Allah akan membalas penghinaan mereka itu) Allah akan menghinakan dan mengazab mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seperti itulah orang munafiq : selalu berbuat buruk kepada kaum muslimin, tatkala melihat orang yang berbuat baik mereka mencelanya, begitu juga kepada orang yang belum sanggup mengeluarkan kebaikan mereka juga mencelanya, sungguh orang munafiq adalah seburuk-burunya manusia, mereka pasti akan ditempatkan di tempat yang paling rendah di neraka, dan jika melihat sesorang yang senantiasa berbuat baik dan meyebarkan dakwah, senantiasa menyerukan kepada kebaikan dan melarang dari kemungkaran; para munafiq itu mengatakan : sesungguhnya mereka terlalu keras dalam beragama, mereka ushuliyun, dan mereka roj'iyyun, dan sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Orang-orang yang mencela orang-orang mukmin yang memberikan sedekah. Jika orang-orang mukmin memberi sesuatu yang remeh, mereka berkata: “Hal ini tidak dibutuhkan Allah!” namun jika orang-orang mukmin menyedekahkan sesuatu yang banyak, maka mereka berkata: “Apa yang mereka lakukan ini tidak lain kecuali pamer” Mereka juga mencela orang-orang yang tidak bisa memberi kecuali hanya sedikit dan sesuai kemampuan mereka, Orang-orang munafik itu menghina dengan berkata: “Sesungguhnya Allah itu ituk butuh sedekah mereka” Allah membalas atas hinaan mereka, mengazab mereka, dan menghinakan mereka. Bagi mereka itu azab yang pedih di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mencela} mencela {orang-orang mukmin yang memberi dengan sukarela} orang-orang yang sukarela {dan orang-orang yang tidak mendapatkan (untuk disedekahkan) melainkan kesanggupannya} sesuatu yang mudah sesuai kemampuan mereka {lalu mereka mengejek mereka. Maka Allah mengejek mereka dan bagi mereka azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Ini juga termasuk keburukan orang-orang munafik, mereka –Semoga Allah menimpakan keburukan kepada mereka- tidak membiarkan perkara apa pun dalam Islam dan Kaum Muslimin yang mungkin mereka bicarakan, kecuali mereka membicarakannya dan mencelanya dengan landasan kezhaliman dan kedengkian. Ketika Allah dan RasulNya mengajak bersedekah, kaum Muslimin bersegera melakukannya. Mereka memberikan hartanya masing-masing sesuai dengan kemampuannya. Ada yang memberi banyak, ada pula yang sedikit. Maka orang-orang munafik itu mencela orang Mukmin yang bersedekah banyak dengan mengatakan bahwa maksudnya adalah riya dan sum’ah. Sementara kepada yang bersedekah sedikit mereka mengatakan bahwa Allah tidak memerlukan sedekah ini, maka Allah menurunkan FirmanNya, “(orang-orang munafik) yaitu orang-orang yang mencela orang-orang Mukmin yang memberi sedekah dengan sukarela.” Orang-orang munafik berkata, mereka adalah orang-orang yang pamer, maksud mereka bersedekah adalah riya dan kesombongan. “Dan” mencela, orang-orang yang tidak memperoleh (untuk disedekahkan) selain sekedar kesanggupannya”, sehingga mereka bersedekah dengan apa yang mampu mereka berikan, maka orang-orang munafik itu berkata, “Allah tidak membutuhkan sedekahnya.” “Maka orang-orang munafik itu menghina mereka.” Maka Allah membalas mereka dengan hal yang sama, yaitu dengan menghina mereka. “dan untuk mereka azab yang pedih.” Karena sesungguhnya mereka mengumpulkan dalam ucapan mereka banyak larangan: Di antaranya adalah, memata-matai kehidupan kaum Muslimin untuk memperoleh peluang memperolok-olok mereka. Allah berfirman, \"Sesungguhnya orang-orang yang ingin agar (berita) perbuatan yang amat keji itu tersiar di kalangan orang-orang yang beriman, bagi mereka azab yang pedih di dunia dan di akhirat. Dan Allah mengetahui, sedang, kamu tidak mengetahui.\" (An-Nur:19). Di antaranya, celaan mereka terhadap orang-orang yang beriman hanya karena mereka beriman, hal itu dilandasi oleh kekufuran kepada Allah dan kebencian kepada Islam. Di antaranya, bahwa mencela adalah haram, bahkan dalam perkara dunia ia termasuk dosa besar, adapun dalam perkara ketaatan, maka ia lebih buruk lagi. Di antaranya, bahwa barangsiapa yang menaati Allah dan melakukan salah satu kebaikan dengan sukarela, semestinya dia dibantu dan disemangati, sementara orang-orang munafik itu bermaksud menggembosi mereka dengan celaan tersebut. Di antaranya juga, bahwa pernyataan mereka bahwa orang yang berinfak banyak adalah orang-orang yang riya adalah kesalahan fatal, vonis yang berdasar kepada ketidaktahuan dan hanya dugaan semata. Adakah keburukan yang lebih besar dari ini? Di antaranya juga, ucapan mereka kepada orang yang bersedekah sedikit, bahwa Allah tidak memerlukan sedekah ini. Ini adalah ucapan yang tujuannya adalah kebatilan, karena pada hakikatnya Allah memang tidak memerlukan sedekah seseorang, yang sedikit maupun yang banyak, bahkan Dia tidak memerlukan penduduk langit dan bumi, akan tetapi Allah memerintahkan hamba-hambaNya kepada apa yang mereka sendiri butuhkan, meskipun Allah tidak memerlukan, akan tetapi merekalah yang memerlukan, \"Barangsiapa yang mengerjakan kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan)nya.\" (Az-Zalzalah:7). Ucapan ini jelas sekali mengandung penggembosan dari berbuat baik. Oleh karena itu balasan mereka adalah Allah menghinakan mereka dan “untuk mereka azab yang pedih.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 79: Imam Bukhari meriwayatkan dari Abu Mas’ud radhiyallahu 'anhu ia berkata: Ketika turun ayat sedekah, kami berusaha mengangkutkan barang (agar memperoleh imbalan untuk disedekahkan), lalu datang seseorang yang bersedekah dengan jumlah yang besar, maka mereka (orang-orang munafik) menimpali, “Orang ini riya’.” Kemudian datang seseorang yang bersedekah dengan satu sha’ (gantang), mereka pun menimpali, “Sesungguhnya Allah tidak butuh terhadapnya.” Maka turunlah ayat, “Alladziina yalmizuuna…dst.” Dalam celaan mereka terhadap kaum mukmin terdapat beberapa keburukan, di antaranya: - Mencari-cari sikap orang mukmin agar dapat mencela mereka, - Celaan mereka kepada orang mukmin karena iman yang ada dalam diri mereka merupakan kekufuran kepada Allah Ta’ala dan benci terhadap agama, - Mencela sendiri merupakan perkara haram, bahkan dosa besar dalam urusan dunia, dan jika dalam perkara taat, maka lebih besar lagi dosanya. - Orang yang taat kepada Allah dan melakukan amalan secara sukarela seharusnya dibantu dan didorong, bukan malah dilemahkan. - Buruk sangka yang tinggi terhadap orang yang berbuat baik. Oleh karena itulah, Allah akan menghina mereka sebagai balasan penghinaan mereka terhadap orang-orang mukmin, dan bagi mereka azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 79",
    "description": "Ayat sebelumnya menjelaskan sifat-sifat buruk orang-orang munafik, antara lain kikir, bersumpah palsu, dan tidak bersyukur. Bukan saja itu, di antara mereka bahkan ada yang secara terus-menerus mencela orang-orang beriman yang memberikan sedekah dengan sukarela dengan menyebutnya pamrih jika yang disedekahkan besar; dan juga mencela orang-orang yang tidak mendapatkan harta untuk disedekahkan kecuali sekadar kesanggupannya, maka orang-orang munafik itu menghina mereka, orang-orang mukmin. Akibat perbuatannya itulah Allah akan membalas penghinaan mereka di dunia dengan tersingkapnya kebusukan hatinya, dan mereka akan mendapat azab yang pedih di akhirat kelak. Kemudian ditegaskan bahwa orang-orang munafik itu hukumnya sama dengan orang-orang kafir, yakni tidak berhak memperoleh ampunan. Karena itu, diingatkan kepada beliau bahwa engkau, wahai nabi Muhammad, memohonkan ampunan bagi mereka atau tidak memohonkan ampunan bagi mereka adalah sama saja. Ketetapan Allah telah terjadi bagi mereka, walaupun engkau memohonkan ampunan bagi mereka tujuh puluh kali, bahkan tak terhitung jumlahnya, Allah tetap tidak akan memberi ampunan kepada mereka. Yang demikian itu karena mereka ingkar, kafir, kepada Allah dan rasul-Nya. Dan Allah tidak memberi petunjuk dan bimbingan kepada orang-orang yang fasik, yaitu mereka yang keluar dari ketaatan kepada Allah."
  }
]