[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya karakter kaum musyrikin adalah mereka akan patuh dengan perjanjian-perjanjian selama kemenangan menjadi milik pihak lain. Numun, apabila mereka merasa kuat di atas kaum mukminin, maka mereka tidak akan memperhatikan hubungan kerabat dan perjanjian yang ada. Maka janganlah kalian terpedaya dengan gaya interaksi mereka kepada kalian ketika mereka takut terhadap kalian. Sebab sesungguhnya mereka itu melontarkan ucapan dengan lisan-lisan mereka agar kalian suka kepada mereka. Akan tetapi, hati mereka menolaknya. Dan kebanyakan dari mereka keras menolak terhadap islam lagi melanggar perjanjian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Bagaimana mungkin mereka memiliki perjanjian damai dan jaminan keamanan, sedangkan mereka adalah musuh kalian? Dan sekiranya mereka berhasil mengalahkan kalian pasti mereka tidak akan mengacuhkan Allah, hubungan kekerabatan maupun perjanjian apa pun dalam memperlakukan kalian, melainkan mereka akan menimpakan azab yang sangat buruk kepada kalian. Mereka menyenangkan hati kalian dengan kata-kata manis yang mereka ucapkan, sedangkan hati mereka tidak sejalan dengan mulut mereka. Mereka tidak pernah menepati apa yang mereka ucapkan. Dan kebanyakan dari mereka tidak taat kepada Allah, karena mereka suka melanggar perjanjian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Setelah Allah mengingkari orang-orang musyrik, maka Dia kemudian menjelaskan sebab pengingkaran itu dengan penuh penegasan. Bagaimana mereka masih memiliki perjanjian sah di sisi Allah dan harus dijaga di sisi Rasulullah, sedangkan mereka terkenal dengan akhlak dan perbuatan mereka bahwa jika mereka lebih kuat dan dapat mengalahkan kalian, mereka sama sekali tidak peduli lagi terhadap Allah dan hubungan kekerabatan dalam melanggar perjanjian? Namun jika mereka dalam keadaan lemah, mereka berkata kepada kalian dengan perkataan manis yang mereka rasa dapat membuat kalian ridha, baik itu dengan perjanjian atau sumpah yang tegas, sedangkan hati mereka dipenuhi kedengkian dan kebencian. Jika mereka menang dari kalian, mereka melanggar perjanjian dan menyelisihi sumpah serta mengkhianati kalian sebisa mungkin. Mereka melakukan itu karena sebagian besar mereka keluar dari ikatan perjanjian dan melanggar batas kejujuran dan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. كَيْفَ وَإِن يَظْهَرُوا۟ عَلَيْكُمْ (Bagaimana bisa (ada perjanjian dari sisi Allah dan Rasul-Nya dengan orang-orang musyrikin), padahal jika mereka memperoleh keunggulan terhadap kamu) Yakni dengan kemenangan atas kalian. لَا يَرْقُبُوا۟ فِيكُمْ(mereka tidak memelihara terhadap kamu) Yakni tidak mempedulikan kalian. إِلًّا (hubungan kekerabatan) Makna (الإل) yakni kekerabatan. وَلَا ذِمَّةً ۚ (dan tidak (pula mengindahkan) perjanjian) Yakni perjanjian. يُرْضُونَكُم بِأَفْوٰهِهِمْ(Mereka menyenangkan hatimu dengan mulutnya) Yakni mereka mengatakan dengan lisan mereka perkataan yang mengandung sanjungan dan pujian bagi kalian, demi mengharapkan keridhaan kalian dan kebaikan hati kalian. وَتَأْبَىٰ قُلُوبُهُمْ(sedang hatinya menolak) Yakni menolak dan menyelisihi hal itu, dan menginginkan keburukan dan mudharat bagi kalian. وَأَكْثَرُهُمْ فٰسِقُونَ (Dan kebanyakan mereka adalah orang-orang yang fasik) Allah menetapkan sifat kefasikan bagi mereka, yaitu kedurhakaan dan penentangan terhadap Allah, dan keluar dari kebenaran dengan melanggar parjanjian-parjanjian mereka, serta tidak mempedulikan perjanjian-parjanjian tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8 Bagaimana bisa ada perjanjian dari sisi Allah dan Rasul-Nya dengan orang-orang musyrikin dan ada kewajiban untuk memenuhinya, padahal jika mereka memperoleh kemenangan terhadap kamu, mereka tidak akan memelihara hubungan kekerabatan terhadap kamu dan tidak pula mengindahkan perjanjian. Mereka menyenangkan hatimu dengan mulutnya yang manis, sedang hatinya menolak untuk menepati. Dan kebanyakan mereka adalah orang-orang yang fasik yaitu tidak menepati perjanjian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana mungkin, padahal jika mereka memperoleh kemenangan atas kalian} menang atas kalian {mereka tidak memelihara} mereka tidak memelihara {hubungan terhadap kalian} hubungan kekerabatan {dan tidak pula perjanjian} tidak juga perjanjian {Mereka menyenangkan kalian dengan mulut mereka, sedangkan hati mereka enggan. Kebanyakan mereka adalah orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Bagaimana\" bisa ada perjanjian di sisi Allah dan RasulNya dengan orang-orang musrikin, padahal \"jika mereka memperoleh kemenangan terhadap kamu”, dengan kekuatan dan kekuasaan, mereka tidak mengasihimu, dan “dan mereka tidak memelihara hubungan kekerabatan terhadap kamu dan tidak pula mengindahkan perjanjian.” Tidak dalam perjaijian dan tidap pula dalam kekerabatan, serta mereka takut kepada Allah dalam memperlakukan kamu, justru mereka menimpakan kepadamu siksaan yang buruk. Ini adalah keadaanmu bersama mereka, jika mereka menang. Janganlah kamu tertipu dengan sikap mereka pada waktu mereka takut kepadamu, karena mereka “menyenangkan hatimu dengan mulutnya, sedang hatinya menolak.” Yakni, hati mereka sama sekali tidak cenderung maupun cinta kepadamu, bahkan mereka adalah musuh yang sebenarnya, yang membencimu dengan sebenarnya. “dan kebanyakan mereka adalah orang-orang fasik.” Tidak memiliki agama maupun muru’ah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 8: Bahkan mereka akan mengganggumu semampunya. Yakni jangan tertipu oleh basa-basi mereka karena mereka dalam keadaan takut kepadamu. Mereka sesungguhnya adalah musuhmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 8",
    "description": "Ayat berikut ini memberikan alasan lain mengapa harus dilakukan pemutusan perjanjian dengan kaum musyrik. Bagaimana mungkin kamu tetap melakukan perjanjian damai dengan kaum musyrik mekah yang jelas-jelas memusuhimu dan merusak perjanjian, padahal, di samping memusuhimu, mereka juga selalu menyembunyikan sikap khianat kepada kalian. Hal ini bisa dilihat dari sikap mereka. Jika mereka memperoleh kemenangan atas kamu, mereka tidak memelihara hubungan kekerabatan denganmu dan tidak pula mengindahkan perjanjian. Di samping itu, ketika mereka masih lemah, mereka juga senantiasa menunjukkan sikap menipu dengan cara menyenangkan hatimu baik dengan mulut maupun sikapnya, sedang hatinya menolak. Demikian ini, karena kebanyakan mereka adalah orang-orang fasik, yaitu mereka yang keluar dari ketaatan kepada Allah. ' sikap kefasikan itu juga menjadikan mereka berani memperjualbelikan ayat-ayat Allah dengan harga murah, yakni ditukar dengan hal-hal yang bersifat duniawi, padahal ayat-ayat tersebut secara jelas telah menjadi bukti atas keesaan Allah dan kerasulan nabi Muhammad. Maka, dengan sikapnya itu sesungguhnya mereka telah menghalang-halangi mereka sendiri dan orang lain dari jalan Allah. Sungguh, sikap yang demikian itu menunjukkan betapa buruknya apa yang mereka kerjakan, yakni perilaku sesat dan menyesatkan."
  }
]