[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mintakanlah ampunan olehmu (wahai rasul) bagi orang-orang munafik atau kamu tidak memohonkan ampunan bagi mereka, Allah sekali-kali tidak akan mengampuni mereka, seberapa banyakpun istighfarmu bagi mereka dan berulang-ulang. Karena sesungguhnya mereka telah kafir kepada Allah dan rasulNYa. Dan Allah tidak memberikan taufik menuju hidayah kepada orang-orang yang keluar dari ketaatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Mintalah -wahai Rasul- ampunan untuk mereka, atau tidak usah kamu meminta ampunan untuk mereka. Seandainya kamu meminta ampunan sebanyak tujuh puluh kali, maka jumlah permintaan ampunan yang banyak itu tidak akan menjadikan Allah mengampuni mereka, karena mereka kafir kepada Allah dan rasul-Nya, sedangkan Allah tidak akan memberikan petunjuk ke jalan yang benar kepada orang-orang yang sengaja menyimpang dari syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Hai Rasulullah, Jika kamu meminta ampunan kepada Allah bagi mereka atau tidak, maka itu sama saja. Meski kamu banyak memohonkan ampunan bagi mereka, Allah tetap tidak akan mengampuni mereka karena mereka kafir terhadap Allah dan mendustakan Rasul-Nya. Allah tidak akan memberi taufik kepada orang-orang yang melawan agama-Nya dan enggan mentaati-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ (Kamu memohonkan ampun bagi mereka atau tidak kamu mohonkan ampun bagi mereka (adalah sama saja)) Yakni permohonan ampun bagi orang-orang munafik atau tidak adalah sama saja. Hal itu karena mereka bukanlah orang-orang yang layak untuk dimintakan ampun dan tidak pula berhak untuk mendapat ampunan dari Allah. إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللهُ لَهُمْ ۚ (Kendatipun kamu memohonkan ampun bagi mereka tujuh puluh kali, namun Allah sekali-kali tidak akan memberi ampunan kepada mereka) Yakni Allah tidak akan mengampuni mereka meski kamu memohonkan ampun bagi mereka sebanyak-banyaknya. ذٰلِكَ بِأَنَّهُمْ كَفَرُوا۟ بِاللهِ وَرَسُولِهِۦ ۗ( Yang demikian itu adalah karena mereka kafir kepada Allah dan Rasul-Nya) Yakni disebabkan kekafiran mereka terhadap Allah dan rasul-Nya. وَاللهُ لَا يَهْدِى الْقَوْمَ الْفٰسِقِينَ(Dan Allah tidak memberi petunjuk kepada kaum yang fasik) Yakni yang durhaka dan tidak enggan untuk taat. Sebab kefasikan mereka sehingga mereka tidak diberi taufik untuk mendapatkan petunjuk yang mengantarkan kepada sesuatu yang diharapkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Wahai Rasul, meski kamu memintakan mereka ampunan atau tidak, mereka tetaplah bukanlah orang yang layak dimintakan ampun begitu juga tidak mendapat ampunan dari Allah, sekalipun kamu memintakan ampun sebanyak 7 kali atau bahkan lebih, sesungguhnya Allah tetap tidak akan mengampuni mereka, melainkan akan menghukum mereka. Demikian itu, yaitu tidak adanya permohonan ampun atau doa bagi mereka, akibat kekufuran mereka kepada Allah dan rasulNya, serta kematian mereka dalam keadaan kafir. Dan Allah tidak menuntun orang yang memberontak dengan berbuat kufur dan tidak mau taat kepada kebaikan dan hidayah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu memohonkan ampunan bagi mereka atau tidak memohonkan ampunan bagi mereka tujuh puluh kali, Allah tidak akan mengampuni mereka. Demikian itu karena mereka kafir kepada Allah dan RasulNya. Allah tidak akan memberi petunjuk kepada kaum yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Kamu memohonkan ampun bagi mereka atau tidak kamu mohonkan ampun bagi mereka (adalah sama saja). Kendatipun kamu mohonkan ampun bagi mereka tujuh puluh kali”, ini menunjukkan pernyataan berlebihan, jika tidak demikian, maka sebenarnya ia tidak memiliki arti, “namun Allah sekali-kali tidak akan memberi ampun kepada mereka.” Sebagaimana Allah berfirman di ayat lain, \"Sama saja bagi mereka, kamu mintakan ampunan atau tidak kamu mintakan ampunan bagi mereka. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang fasik.\" (Al-Munafiqun:6). Kemudian Allah menyebutkan sebab yang menghalangi mereka diampuni. Dia berfirman, “Yang demikian itu adalah karena mereka kafir kepada Allah dan RasulNya.” Istighfar dan amal tidak berguna bagi orang kafir selama dia kafir. “Dan Allah tidak memberi petunjuk kepada kaum yang fasik.” Orang-orang yang kefasikan telah menjadi sifat mereka, di mana mereka tidak memilih apa pun selainnya dan tidak mau mencari gantinya, kebenaran yang jelas telah datang kepada mereka namun mereka tolak, maka Allah menghukum mereka dengan tidak memberi taufik kepada mereka sesudah itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 80: Sehingga permintaan ampun untuk mereka dan amal mereka tidak bermanfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 80",
    "description": "Kemudian ditegaskan bahwa orang-orang munafik itu hukumnya sama dengan orang-orang kafir, yakni tidak berhak memperoleh ampunan. Karena itu, diingatkan kepada beliau bahwa engkau, wahai nabi Muhammad, memohonkan ampunan bagi mereka atau tidak memohonkan ampunan bagi mereka adalah sama saja. Ketetapan Allah telah terjadi bagi mereka, walaupun engkau memohonkan ampunan bagi mereka tujuh puluh kali, bahkan tak terhitung jumlahnya, Allah tetap tidak akan memberi ampunan kepada mereka. Yang demikian itu karena mereka ingkar, kafir, kepada Allah dan rasul-Nya. Dan Allah tidak memberi petunjuk dan bimbingan kepada orang-orang yang fasik, yaitu mereka yang keluar dari ketaatan kepada Allah. Setelah ayat sebelumnya menerangkan kebusukan sifat dan sikap orang-orang munafik, maka ayat ini kembali menunjukkan sifat buruk mereka yang lain yaitu tidak turut berperang. Orang-orang yang ditinggalkan, yakni tidak ikut berperang karena alasan-alasan yang dibuat-buat sehingga beliau mengizinkan untuk tidak ikut perang atau beliau memang tidak ingin mereka ikut dalam perang tabuk tersebut, merasa gembira dengan duduk-duduk diam tidak turut berperang sepeninggal atau setelah keberangkatan rasulullah beserta pasukan muslim menuju medan perang. Mereka memang tidak suka berjihad dengan menyumbangkan harta dan mempertaruhkan jiwa dan raga mereka di jalan Allah dan bahkan mereka berusaha menghalang-halangi teman-temannya dengan berkata, janganlah kamu berangkat pergi berperang dalam panas terik ini. Demi menanggapi perkataan mereka, beliau diperintahkan, katakanlah wahai nabi Muhammad, api neraka jahanam lebih panas, jika mereka mengetahui dan menyadari akan ancaman tersebut tentulah mereka akan turut berperang."
  }
]