[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "telah bergembira orang-orang yang tinggal yang tidak ikut bersama rasulullah dengan tetap berada di Madinah, mereka menyelisihi rasulullah dan mereka tidak menyukai berjihad bersamanya dengan harta benda mereka dan jiwa raga mereka di jalan Allah. Dan sebagian dari mereka berkata kepada sebagain yang lain, ”janganlah kalian berangkat pada saat yang panas ini,” waktu itu perang tabuk terjadi pada musim yang amat panas. Katakanlah kepaada mereka (wahai rasul) ”api neraka jahanam itu lebih panas,” seandainya mereka itu mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Orang-orang munafik yang tidak ikut dalam perang Tabuk merasa bangga dengan ketidakhadiran mereka di medan jihad fi sabilillah seraya menyalahi seruan Rasulullah. Mereka enggan berjihad dengan harta dan jiwa mereka sebagaimana jihad yang dilakukan oleh orang-orang mukmin. Mereka menghasut kawan-kawan mereka sesama orang-orang munafik dengan mengatakan, \"Janganlah kalian pergi di tengah cuaca yang panas.\" Perang Tabuk saat itu bertepatan dengan waktu musim panas. Katakanlah -wahai Rasul kepada mereka, \"Neraka Jahanam yang menanti kedatangan orang-orang munafik lebih panas dari cuaca panas yang mereka hindari itu, sekiranya mereka mengetahuinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Orang-orang munafik yang tidak mengikuti perang Tabuk merasa senang dapat duduk di rumah mereka tanpa harus pergi berjihad di jalan Allah, dan mereka tidak menyukai berjihad di jalan Allah dengan harta dan jiwa mereka sebagaimana orang-orang beriman berjihad. Mereka berkata kepada teman-teman mereka sesama kaum munafikin untuk menurunkan semangat mereka: “Janganlah kalian pergi pada waktu terik seperti ini.” Dan perang Tabuk terjadi pada waktu terik dan panas. Hai Rasulullah, katakanlah kepada mereka: “Api neraka Jahannam yang menunggu orang-orang munafik itu lebih panas daripada terik matahari yang mereka jauhi, seandainya mereka mengetahui hal itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلٰفَ رَسُولِ اللهِ (Orang-orang yang ditinggalkan (tidak ikut perang) itu, merasa gembira dengan tinggalnya mereka di belakang Rasulullah) Mereka adalah orang-orang munafik yang meminta izin kepada Rasulullah untuk tidak mengikuti perang. Maka Rasulullah mengizinkan mereka dan meninggalkan mereka di Madinah pada perang Tabuk. Yakni orang-orang yang ditinggalkan itu meresa senang dengan ketidak-ikutsertaan mereka dari Rasulullah. وَكَرِهُوٓا۟ أَن يُجٰهِدُوا۟ بِأَمْوٰلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ اللهِ(dan mereka tidak suka berjihad dengan harta dan jiwa mereka pada jalan Allah) Hal itu disebabkan karena mereka kikir terhadap harta dan jiwa mereka, tidak memiliki keimanan dan keikhlasan, serta sifat kemunafikan mereka. وَقَالُوا۟ لَا تَنفِرُوا۟ فِى الْحَرِّ ۗ( dan mereka berkata: “Janganlah kamu berangkat (pergi berperang) dalam panas terik ini”) Orang-orang munafik berkata kepada golongan mereka ucapan ini untuk menakut-nakuti mereka dan sebagai nasehat diantara mereka agar menyelisihi perintah Allah dan Rasul-Nya. قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ( Katakanlah: “Api neraka jahannam itu lebih sangat panas(nya)”) Yakni, Wahai orang-orang munafik, mengapa kalian lari dari panas yang tak seberapa ini sedangkan neraka Jahannam yang akan kalian masuki selamanya jauh lebih panas, panasnya tak terhingga dan kekal selama-lamanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَقَالُوا لَا تَنْفِرُوا فِي الْحَرِّ } \"dan mereka berkata: \"Janganlah kamu berangkat (pergi berperang) dalam panas terik ini\" begitulah yang diucapkan oleh orang-orang munafiq tatkala mereka mendengarkan panggilan untuk pergi berperaang! Dan orang-orang semisal mereka pada hari ini begitu banyak! Ketika terik panas matahari membakar kulit seorang mukmin (ayat ini menjadi pengingat) bagaimna orang-orang munafiq kabur meninggalkan kewajiban mereka menolong agama ini, namun para sahabat dengan gagah berani dibawah panasnya matahari memperjuangkan kemenangan agama ini, maka apakah ada sesuatu yang dapat kita berikan untuk agama ini sedang kita berada dalam kenikmatan ?. 2 ). { وَقَالُوا لَا تَنْفِرُوا فِي الْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ لَوْ كَانُوا يَفْقَهُونَ } \"dan mereka berkata: \"Janganlah kamu berangkat (pergi berperang) dalam panas terik ini\". Katakanlah: \"Api neraka jahannam itu lebih sangat panas(nya)\" jika mereka mengetahui.\" menjadi fenomena baru zaman ini ketika orang-orang mulai menyempatkan waktu mereka untuk bepergian disaat cuaca yang cukup panas, tetapi fenomena ini sangat berbeda antara bepergian pada musim panas untuk mencari kesenangan, dan menunaikan keinginan syahwat mereka dengan perkara yang diharamkan, namun ketika mereka dipanggil untuk kepentingan agama dan kemaslahatan umma mereka menolak dengan alasan cuaca panas! dan antara orang yang bepergian untuk menyerukan kepada kebaikan! dan sungguh kedua golongan ini akan mengetahui akibat dari bepergian keduanya pada hari ketika segala bukti akan ditampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Orang-orang yang mengundurkan diri dari perang Tabuk senang dengan tinggalnya mereka di belakang Rasulullah SAW dalam berjihad, dan benci berjihad dengan harta dan jiwa di meninggikan kalimat Allah. Orang-orang munafik berkata kepada saudara-saudaranya: “Janganlah kalian pergi berjihad di musim panas.” Katakanlah kepada mereka wahai Rasulullah: “Neraka Jahanam itu lebih panas daripada panasnya medan perang Tabuk. Dan jika kalian melarikan diri dari perang yang remeh ini, maka neraka jahanam yang akan kalian masuki kelak itu lebih panas dari medan perang yang kalian hindari.” Kalau mereka menyadari dan memahami rahasia-rahasia perintah Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ditinggalkan merasa gembira} orang-orang munafik yang meninggalkan perang Tabuk {dengan duduk-duduk} dengan meninggalkan jihad di jalan Allah {setelah kepergian} kepergian {Rasulullah. Mereka tidak suka berjihad dengan harta dan jiwa mereka di jalan Allah dan mereka berkata,“Janganlah berangkat} Janganlah kalian berangkat untuk berjihad di jalan Allah {di tengah panas” Katakanlah,“Api neraka Jahanam itu lebih panas” Jika mereka memahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Allah berfirman menjelaskan kekurang ajaran orang-orang munafik dengan tidak berangkat berjihad dan tidak adanya perhatian mereka dalam hal itu, yang menunjukkan tidak adanya iman pada mereka dan bahwa mereka memilih kekufuran di atas keimanan. “Orang-orang yang ditingggalkan (tidak ikut berperang) itu merasa gembira dengan tinggalnya mereka di belakang Rasulullah.” Ini tidak sekedar tidak mau berangkat perang, akan tetapi ia lebih dari itu, tidak berangkat berperang ini adalah haram hukumnya, dan lebih dari itu ia menunjukkan kerelaan dengan perbuatan dosa dan membanggakannya. \"Dan mereka tidak suka berjihad dengan harta dan jiwa mereka pada jalan Allah.” Lain halnya dengan orang-orang yang beriman, yang jika tidak bisa ikut berperang –meski dengan alasan yang benar- mereka pasti bersedih dan menyesali dengan kesedihan dan penyesalan yang dalam, orang-orang Mukmin menyukai berjihad di jalan Allah dengan harta dan jiwa mereka, karena hati mereka yang diselimuti oleh keimanan dan mereka berharap karunia Allah, kebaikan, nikmat, dan rizkiNya. “Dan mereka berkata”, yakni orang-orang munafik, “Janganlah kamu berangkat (pergi berperang) dalam panas terik ini.” Yakni mereka berkata bahwa berangkat berjihad adalah kesulitan atas kami karena terik matahari, mereka mendahulukan istirahat yang pendek yang pasti habis daripada istirahat yang abadi lagi sempurna, mereka lebih takut panas yang bisa dilindungi oleh naungan dan lenyap oleh pagi dan petang hari daripada panas yang panasnya tidak terukur yaitu neraka yang menyala-nyala. Oleh karena itu Allah berfirman, “Katakanlah, ‘Api Neraka Jahanam itu lebih sangat panas (nya),’ jikalau mereka mengetahui.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 81: Hal ini menunjukkan ketidakadaan iman dalam hati mereka dan lebih memilih kekufuran daripada keimanan. Perbuatan mereka ini mengandung banyak perkara dosa, dari mulai takhalluf (meninggalkan Rasulullah shallallahu 'alaihi wa sallam), ridha di atas sikap itu dan bergembira. Mereka lebih suka istirahat yang sebentar daripada istirahat yang kekal"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 81",
    "description": "Setelah ayat sebelumnya menerangkan kebusukan sifat dan sikap orang-orang munafik, maka ayat ini kembali menunjukkan sifat buruk mereka yang lain yaitu tidak turut berperang. Orang-orang yang ditinggalkan, yakni tidak ikut berperang karena alasan-alasan yang dibuat-buat sehingga beliau mengizinkan untuk tidak ikut perang atau beliau memang tidak ingin mereka ikut dalam perang tabuk tersebut, merasa gembira dengan duduk-duduk diam tidak turut berperang sepeninggal atau setelah keberangkatan rasulullah beserta pasukan muslim menuju medan perang. Mereka memang tidak suka berjihad dengan menyumbangkan harta dan mempertaruhkan jiwa dan raga mereka di jalan Allah dan bahkan mereka berusaha menghalang-halangi teman-temannya dengan berkata, janganlah kamu berangkat pergi berperang dalam panas terik ini. Demi menanggapi perkataan mereka, beliau diperintahkan, katakanlah wahai nabi Muhammad, api neraka jahanam lebih panas, jika mereka mengetahui dan menyadari akan ancaman tersebut tentulah mereka akan turut berperang. Karena itu, wahai nabi Muhammad, biarkanlah mereka tertawa sejenak karena merasa senang dengan tidak ikut berperang tetapi tidak dicela, dan kelak di akhirat mereka akan menangis yang sebanyakbanyaknya, sebagai balasan terhadap apa yang selalu mereka perbuat di dunia, seperti mencela, berdusta, menghasut, termasuk membuatbuat alasan agar diizinkan tidak ikut jihad."
  }
]