[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "hendaknya tertawa-tawa sebentar orang-orang munafik yang tidak ikut berangkat bersama rasulullah dalam perang tabuk itu di kehidupan dunia yang fana ini, dan silahkan mereka menangis banyak-banyak di dalam neraka jahanam, sebagai balasan atas apa yang mereka usahakan di dunia berupa kemunafikan dan kekafiran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Maka hendaklah orang-orang munafik yang menolak pergi ke medan jihad itu tertawa sedikit saja di dunia yang fana ini. Hendaklah mereka menangis sebanyak-banyaknya kelak di Akhirat yang kekal, sebagai balasan atas kekafiran, kemaksiatan, dan dosa-dosa yang telah mereka perbuat di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Biarkanlah orang-orang munafik yang tidak ikut berjihad itu tertawa sejenak di kehidupan dunia yang fana ini, karena mereka akan banyak menangis di kehidupan akhirat mereka yang kekal, sebagai balasan atas kekafiran, kemaksiatan, dan dosa-dosa yang telah mereka lakukan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. فَلْيَضْحَكُوا۟ قَلِيلًا وَلْيَبْكُوا۟ كَثِيرًا (Maka hendaklah mereka tertawa sedikit dan menangis banyak) Yakni di akhirat mereka hanya akan sedikit tertawa, namun akan banyak menangis seperti banyaknya tawa mereka di dunia yang telah menjadikan agama mereka sebagai bahan olokan dan senda gurau. Dan ini merupakan sesuatu yang pasti. جَزَآءًۢ بِمَا كَانُوا۟ يَكْسِبُونَ(sebagai pembalasan dari apa yang selalu mereka kerjakan) Berupa kemaksiatan-kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Dan konsekuensi dari perbuatan orang-orang munafik yaitu mereka akan sedikit tertawa di dunia dengan pengunduran diri mereka dari jihan dan akan banyak menangis di akhirat akibat senda gura dan ejekan mereka terhadap agama Allah, sebagai balasan atas perbuatan mereka berupa dosa-dosa dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka biarkanlah mereka tertawa sedikit} di dunia {dan menangis yang banyak} di akhirat {sebagai balasan atas apa yang selalu mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. ketika mereka lebih mendahulukan yang fana daripada yang kekal, ketika mereka lari dari kesulitan yang ringan yang berujung kepada kesulitan yang berat yang tak berujung, maka Allah berfirman, “Maka hendaklah mereka sedikit tertawa dan banyak menangis.” Yakni silahkan mereka bersuka cita di dunia yang pasti fana ini, berbahagia dengan kenikmatannya, dan bermain dengan permainannya, karena mereka akan menangis panjang di azab yang pedih “sebagai pembalasan dari apa yang selalu mereka kerjakan”, berupa kekufuran, kemunafikan, dan ketidaktundukan kepada perintah Allah, Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 82: Di dunia. Di akhirat. Berupa kekufuran, kemunafikan dan tidak mau taat kepada perintah Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 82",
    "description": "Karena itu, wahai nabi Muhammad, biarkanlah mereka tertawa sejenak karena merasa senang dengan tidak ikut berperang tetapi tidak dicela, dan kelak di akhirat mereka akan menangis yang sebanyakbanyaknya, sebagai balasan terhadap apa yang selalu mereka perbuat di dunia, seperti mencela, berdusta, menghasut, termasuk membuatbuat alasan agar diizinkan tidak ikut jihad. Setelah ayat yang lalu mengungkap kebusukan hati kaum munafik, maka sebagai hukumannya Allah melarang mereka ikut dalam barisan kaum muslimin. Maka jika Allah mengembalikanmu, nabi Muhammad, kepada suatu golongan dari mereka, orang-orang munafik yang tidak ikut berperang, kemudian mereka meminta izin kepadamu untuk ikut keluar pergi berperang, maka katakanlah, kamu tidak boleh keluar untuk ikut berperang bersamaku selama-lamanya dan juga tidak boleh ikut memerangi musuh bersamaku. Sesungguhnya kamu telah rela atau lebih senang untuk tidak pergi berperang sejak semula. Karena itu duduklah atau tinggAllah bersama orang-orang yang tidak ikut berperang karena adanya uzur yang dibenarkan, yaitu orang-orang tua, orang yang sedang sakit, kaum perempuan, dan anak kecil."
  }
]