[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika Allah mengembalikanmu (wahai rasul), dari peperanganmu untuk berjumpa dengan segolongan dari orang-orang munafik yang tetap bertahan diatas kemunafikan, lalu mereka meminta izin kepadamu untuk ikut berangkat perang menuju peperangan yang lain pasca perang tabuk, maka katakanlah kepada mereka, ”kalian tidak akan pernah keluar bersamaku selamanya dalam suatu peperanganpun, dan kalian tidak akan pernah berperang bersamaku untuk melawan musuh dari semua musuh; karena sesungguhnya kalian lebih rido untuk tidak berangkat perang sejak pertama kali. Maka tinggalah kalian bersama orang-orang yang tidak ikut serta dalam berjihad bersama rasulullah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Jika Allah mengembalikanmu -wahai Rasul- kepada sekelompok orang-orang munafik yang tetap mempertahankan kemunafikan mereka, kemudian mereka meminta izin kepadamu untuk pergi ke medan jihad bersamamu dalam perang lain, maka katakanlah kepada mereka, \"Kalian -wahai orang-orang munafik- tidak akan pergi bersamaku ke medan jihad fi sabilillah untuk selama-lamanya sebagai hukuman untuk kalian dan juga sebagai antisipasi terhadap potensi kerugian-kerugian yang timbul akibat keberadaan kalian bersamaku. Karena kalian sudah puas dengan penolakan kalian untuk pergi ke medan perang Tabuk. Maka tetaplah kalian duduk bersama orang-orang yang sakit, para wanita, dan anak-anak.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Hai Nabi, Jika Allah mengembalikanmu kepada orang-orang munafik itu, sedangkan mereka tetap dalam kemunafikan; lalu mereka meminta izin untuk ikut berperang bersamamu pada perang yang lain, maka katakanlah kepada mereka: “Hai orang-orang munafik, kalian tidak akan pergi berjihad di jalan Allah bersamaku selama-lamanya, sebagai hukuman bagi kalian dan untuk menjauhkan keburukan yang terjadi ketika kalian bersamaku. Kalian telah rela untuk duduk dan tertinggal dari perang Tabuk, maka tetaplah duduk dan tinggal bersama orang-orang yang sakit, para wanita, dan anak-anak.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَإِن رَّجَعَكَ اللهُ إِلَىٰ طَآئِفَةٍ مِّنْهُمْ (Maka jika Allah mengembalikanmu kepada suatu golongan dari mereka) Allah berfirman dengan menyebut “suatu gologan dari mereka” karena sebagian mereka bertaubat dari kemunafikan dan menyesal atas ketidak ikutsertaan mereka dalam peperangan. فَاسْتَـْٔذَنُوكَ لِلْخُرُوجِ(kemudian mereka minta izin kepadamu untuk keluar (pergi berperang)) Yakni untuk pergi bersamamu di peperangan yang lain setelah perang ini. فَقُل(maka Katakanlah) Yakni katakanlah kepada mereka. لَّن تَخْرُجُوا۟ مَعِىَ أَبَدًا وَلَن تُقٰتِلُوا۟ مَعِىَ عَدُوًّا ۖ( Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku) Sebagai hukuman bagi mereka dan karena dengan membawa mereka ke medan perang mengandung banyak kemudharatan. إِنَّكُمْ رَضِيتُم بِالْقُعُودِ أَوَّلَ مَرَّةٍ(Sesungguhnya kamu telah rela tidak pergi berperang kali yang pertama) Yakni pada perang Tabuk. فَاقْعُدُوا۟ مَعَ الْخٰلِفِينَ(Karena itu duduklah bersama orang-orang yang tidak ikut berperang) Yakni yang tidak ikut berperang seperti orang-orang sakit, para wanita dan anak-anak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَقُلْ لَنْ تَخْرُجُوا مَعِيَ أَبَدًا وَلَنْ تُقَاتِلُوا مَعِيَ عَدُوًّا } \"maka Katakanlah: \"Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku\" tiada kehinaan yang lebih buruk dari seseorang yang di tolak oleh syari'at, seperti unta cacat yang ditolat untuk diqurbankan. 2 ). Tidakkah takut orang-orang yang memiliki sikap negatif untuk tidak menunaikan apa-apa yang Allah tuntut dari mereka; sebagaimana yang diperbuat oleh munafiqin, kemudian Allah menurunkan kemarahan-Nya kepada mereka ? tidak kah mereka memahami ayat ini : { فَقُلْ لَنْ تَخْرُجُوا مَعِيَ أَبَدًا وَلَنْ تُقَاتِلُوا مَعِيَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُمْ بِالْقُعُودِ أَوَّلَ مَرَّةٍ فَاقْعُدُوا مَعَ الْخَالِفِينَ } \"maka Katakanlah: \"Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku. Sesungguhnya kamu telah rela tidak pergi berperang kali yang pertama. Karena itu duduklah bersama orang-orang yang tidak ikut berperang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Maka jika Allah mengembalikanmu dari perang Tabuk kepada suatu golongan dari orang-orang munafik itu, wahai Nabi dan mereka belum bertaubat dari kemunafikannya, dan masih enggan berjihad dengan tinggal di Madinah, lalu meminta ijin kepadamu untuk ikut perang lainnya, maka katakanlah kepada mereka: “Kalian tidak akan pergi berjihad dan berperang bersamaku melawan musuh di setiap tempat selamanya” Itu sebagai hukuman bagi mereka dan berlepas diri dari kerusakan mereka. “Sesungguhnya awalnya kalian rela untuk diam di saat perang Tabuk. Maka diamlah bersama orang-orang yang mengundurkan diri dari perang, yaitu orang-orang yang lemah, para perempuan dan anak-anak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka jika Allah memulangkanmu} wahai Muhammad, Allah mengembalikanmu dari perang Tabuk {ke satu golongan dari mereka} dari orang-orang munafik yang tinggal di Madinah {kemudian mereka meminta izin kepadamu untuk keluar. Katakanlah,“Kalian tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku. Sesungguhnya sejak awal kalian telah ridha duduk. Jadi duduklah bersama orang-orang yang tidak ikut”} tidak ikut jihad mereka sakit, perempuan, dan anak-anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. “Maka jika Allah mengembalikan kepada satu golongan dari mereka”, yaitu orang-orang yang tidak berjihad tanpa alasan dan tidak menyesalinya, “kemudian mereka minta izin kepadamu untuk keluar (pergi berperang)”, untuk perang yang lain yang mungkin lebih mudah, “maka katakanlah”, kepada mereka sebagai hukuman, “kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku,” karena Alllah akan mencukupkanku darimu. “Sesungguhnya kamu telah rela tidak pergi berperang kali yang pertama. Karena itu duduklah (tinggallah) bersama orang-orang yang tidak ikut berperang.” Ini seperti yang difirmankan Allah, \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\" (Al-An’am:110). Orang yang merasa keberatan yang tidak melakukan apa yang diperintahkan, pada saat kesempatan itu terbuka, dia tidak akan diberi taufik kepadanya dan pada kesempatan berikutnya dia akan dihalangi darinya, ini sekaligus sebagai hukuman ta’zir bagi mereka, karena jika terbukti di kalangan kaum Muslimin bahwa mereka itu termasuk orang-orang yang dicekal untuk berangkat berjihad karena kedurhakaan mereka, maka hal itu merupakan tamparan, aib dan celaan bagi mereka, dan agar tidak ada seorang pun yang melakukan seperti yang mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 83: Disebutkan suatu golongan, karena di antara mereka ada yang bertobat dari kemunafikan dan menyesali sikap mereka meninggalkan berperang, maka sebagai hukuman bagi mereka, mereka tidak diizinkan ikut berperang. Setelah Nabi Muhammad shallallahu 'alaihi wa sallam selesai dari perang Tabuk dan kembali ke Madinah lalu bertemu segolongan orang-orang munafik yang tidak ikut perang, mereka meminta izin kepada Beliau untuk ikut berperang pada peperangan yang lain, maka Nabi Muhammad shallallahu 'alaihi wa sallam dilarang oleh Allah untuk mengabulkan permintaan mereka, karena mereka sejak awal tidak mau berperang sebagai hukuman bagi mereka, di samping itu ikut sertanya mereka menimbulkan mafsadat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 83",
    "description": "Setelah ayat yang lalu mengungkap kebusukan hati kaum munafik, maka sebagai hukumannya Allah melarang mereka ikut dalam barisan kaum muslimin. Maka jika Allah mengembalikanmu, nabi Muhammad, kepada suatu golongan dari mereka, orang-orang munafik yang tidak ikut berperang, kemudian mereka meminta izin kepadamu untuk ikut keluar pergi berperang, maka katakanlah, kamu tidak boleh keluar untuk ikut berperang bersamaku selama-lamanya dan juga tidak boleh ikut memerangi musuh bersamaku. Sesungguhnya kamu telah rela atau lebih senang untuk tidak pergi berperang sejak semula. Karena itu duduklah atau tinggAllah bersama orang-orang yang tidak ikut berperang karena adanya uzur yang dibenarkan, yaitu orang-orang tua, orang yang sedang sakit, kaum perempuan, dan anak kecil. Dan juga jika kelak mereka meninggal dunia, maka janganlah engkau, wahai nabi Muhammad, melaksanakan salat jenazah untuk seseorang yang mati di antara mereka, orang-orang munafik, selama-lamanya dan janganlah engkau mengantar jenazahnya serta berdiri untuk mendoakan di atas kuburnya yang berarti memohon rahmat dan ampunan, padahal sesungguhnya mereka telah ingkar kepada Allah dan rasul-Nya, baik melalui ucapan maupun tindakan, dan tidak sempat bertobat sehingga mereka mati dalam keadaan fasik, yaitu keluar dari ketaatan kepada Allah, baik lahir maupun batin, makanya mereka tidak layak disalatkan dan didoakan. Ayat ini menjadi landasan hukum haramnya mendoakan seseorang yang mati dalam keadaan kafir. (lihat: surah at-taubah/9: 113)."
  }
]