[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah sekali-kali kamu menshalati (wahai rasul) salah seorang yang telah mati dari kalangan orang-orang munafik untuk selamanya, dan janganlah kamu berdiri di kuburnya untuk mendoakan kebaikan baginya. Sebab, sesungguhnya mereka itu telah kafir kepada Allah dan kepada rasulNya, dan mereka mati dalam keadaan fasik. Inilah hukum secara umum pada orang yang sudah diketahui kemunafikannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Janganlah kamu -wahai Rasul- menyalatkan mayat orang munafik untuk selama-lamanya dan janganlah kamu berdiri di dekat makamnya untuk mendoakannya. Hal itu dikarenakan mereka telah ingkar kepada Allah, ingkar kepada rasul-Nya, dan mati dalam kondisi durhaka kepada Allah. Orang (yang mati dalam kondisi) semacam itu tidak perlu disalatkan dan tidak pula didoakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Allah melarang Rasulullah untuk menyolatkan orang munafik yang meninggal dunia, dan melarangnya berdiri di kuburan mereka untuk memohon ampun bagi mereka. Hal ini karena mereka kafir terhadap Allah dan rasul-Nya, dan mati dalam keadaan berpaling dari ketaatan Allah. Dan orang yang mati dalam keadaan seperti itu maka tidak berhak disholatkan dan didoakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَلَا تُصَلِّ عَلَىٰٓ أَحَدٍ مِّنْهُم مَّاتَ أَبَدًا (Dan janganlah kamu sekali-kali menyembahyangkan (jenazah) seorang yang mati di antara mereka) Dalam hadist Imam Bukhari dan Muslim, dari Ibnu Abbas ia berkata: aku mendengar Umar bin Khattab berkata: “ketika Abdullah bin Ubay meninggal, Rasulullah diminta untuk menyolati jenazahnya, dan ketika ia telah berdiri untuk menyolatkan aku berkata kepadanya: “apakah engkau akan menyolatkan Abdullah bin Ubay yang telah berkata ini dan itu, dan berucap ini dan itu” dan aku menyebutkan bagaimana dia selama hidupnya, sedangkan Rasulullah tetap tersenyum. Sampai ketika aku telah banyak sekali menceritakan tentangnya, beliau bersabda: “Hai Umar, mundurlah karena aku masih diberi pilihan, telah diwahyukan kepadaku “Kamu memohonkan ampun bagi mereka atau tidak kamu mohonkan ampun bagi mereka (adalah sama saja). Kendatipun kamu memohonkan ampun bagi mereka tujuh puluh kali, namun Allah sekali-kali tidak akan memberi ampunan kepada mereka”, andai saja aku tahu jika aku menambah dari tujuh puluh permohonan itu kemudian ia akan diampuni niscaya aku akan menambahnya”. Kemudian Rasulullah menyolatinya dan ikut mengantar ke makamnya dan berdiri di makamnya sampai selesai. Umar berkata: aku sendiri heran terhadap diriku dan keberanianku terhadap Rasulullah –dan Allah dan Rasul-Nya lebih mengetahui”— demi Allah tidak lama setelah itu turunlah dua ayat ini –ayat 83-84— “Dan janganlah kamu sekali-kali menyembahyangkan (jenazah) seorang yang mati di antara mereka, dan janganlah kamu berdiri (mendoakan) di kuburnya” (ayat 84). Maka setelah itu Rasulullah tidak pernah menyolatkan orang munafik. وَلَا تَقُمْ عَلَىٰ قَبْرِهِۦٓ ۖ( dan janganlah kamu berdiri (mendoakan) di kuburnya) Rasulullah apabila menguburkan mayit, beliau berdiri di samping kuburan tersebut lalu mendoakan si mayit. Maka di sini Allah melarang beliau untuk berdiri di kuburan orang munafik siapapun itu untuk mendoakannya. وَمَاتُوا۟ وَهُمْ فٰسِقُونَ (dan mereka mati dalam keadaan fasik) Allah mensifati mereka dengan sifat kefasikan setelah mensifati mereka dengan kekafiran, karena bisa jadi orang kafir mempunyai sifat adil dalam agamanya, adapun kebohongan, kemunafikan, tipu daya, kepengecutan, dan kelicikan adalah sifat-sifat yang buruk dalam setiap agama."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagian ulama menyimpulkan dari ayat yang ditujukan kepada kaum munafiqin ini : { وَلَا تُصَلِّ عَلَىٰ أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلَا تَقُمْ عَلَىٰ قَبْرِهِ ۖ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ } , bahwa ayat ini menunjukkan disyari'atkannya shalat jenazah; tatkala ayat ini melarang dishalatkannya munafiqin hukum kemudian berubah dan syari'at mengabarkan bahwa shalat jenazah hanya dilakukan untuk orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Dan jangan sampai kamu menyalati salah seorang munafik yang mati, wahai Nabi, yaitu shalat jenazah, dan janganlah kamu berhendi di kuburannya untuk mendoakannya. Sesungguhnya mereka itu kufur kepada Allah dan rasulNya. Mereka keluar jalan keadilan dan jalan yang lurus. Dan mereka mati dalam keadaan tersebut. Ayat ini turun karena Nabi SAW menyalati pemimpin orang-orang munafik, yaitu Abdullah bin Ubay. Lalu setelah itu beliau tidak menyalati orang-orang munafik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah kamu melaksanakan shalat untuk seseorang yang mati di antara mereka selamanya dan janganlah kamu berdiri} berhenti {di atas kuburnya. Sesungguhnya mereka ingkar kepada Allah dan RasulNya dan mereka mati dalam keadaan fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Allah berfirman, “Dan janganlah kamu sekali-kali menshalatkan (jenazah) seorang yang mati di antara mereka,” orang-orang munafik. “Dan janganlah kamu berdiri (mendo'akan) di kuburnya,” setelah dikubur untuk mendo'akannya, karena do'a dan berdiri di atas kubur mereka adalah syafaat darinya kepada mereka, sementara tak berguna lagi syafaat bagi mereka. Begitulah, siapa pun yang diketahui bahwa dia adalah kafir dan munafik, maka dia tidak dishalatkan (ketika mati). Di dalam ayat ini terdapat dalil disyariatkannya shalat jenazah atas orang-orang yang beriman dan berdiri di atas kubur mereka untuk mendoakan mereka, sebagaimana Nabi melakukan hal itu kepada orang-orang yang beriman, karena pembatasan larangan pada orang-orang munafik menunjukkan bahwa hal itu dibolehkan untuk orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 84: Ayat ini turun ketika Nabi Muhammad shallallahu 'alaihi wa sallam menyalatkan Abdullah bin Ubay bin Salul, tokoh munafik. Imam Bukhari meriwayatkan dari Ibnu Umar radhiyallahu 'anhuma, bahwa ketika Abdullah bin Ubay wafat, maka anaknya datang kepada Nabi shallallahu 'alaihi wa sallam dan berkata, “Wahai Rasulullah, berikanlah gamismu agar aku kafankan dia dengannya. Salatkanlah dia dan mintakanlah ampunan untuknya.” Maka Nabi shallallahu 'alaihi wa sallam memberikan gamisnya dan bersabda, “Beritahukan saya (jika sudah selesai dikafankan), agar saya menyalatkannya.” Maka diberitahukanlah kepada Beliau. Ketika Beliau hendak menyalatkannya, maka Umar radhiyallahu 'anhu menarik Beliau dan berkata, “Bukankah Allah melarang engkau menyalatkan orang-orang munafik?” Beliau bersabda, “Aku berada di antara dua pilihan. Dia berfirman, “(Sama saja) engkau (Muhammad) memohonkan ampunan bagi mereka atau tidak memohonkan ampunan bagi mereka. Walaupun engkau memohonkan ampunan bagi mereka tujuh puluh kali, Allah tidak akan memberi ampunan kepada mereka.” Maka Beliau pun menyalatkannya, kemudian turunlah ayat kepada Beliau, “Wa laa tushalli ‘alaa ahadim minhum...dst.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 84",
    "description": "Dan juga jika kelak mereka meninggal dunia, maka janganlah engkau, wahai nabi Muhammad, melaksanakan salat jenazah untuk seseorang yang mati di antara mereka, orang-orang munafik, selama-lamanya dan janganlah engkau mengantar jenazahnya serta berdiri untuk mendoakan di atas kuburnya yang berarti memohon rahmat dan ampunan, padahal sesungguhnya mereka telah ingkar kepada Allah dan rasul-Nya, baik melalui ucapan maupun tindakan, dan tidak sempat bertobat sehingga mereka mati dalam keadaan fasik, yaitu keluar dari ketaatan kepada Allah, baik lahir maupun batin, makanya mereka tidak layak disalatkan dan didoakan. Ayat ini menjadi landasan hukum haramnya mendoakan seseorang yang mati dalam keadaan kafir. (lihat: surah at-taubah/9: 113). Setelah Allah melarang untuk menyalatkan kaum munafik, kemudian dia mengingatkan agar juga tidak terpedaya oleh kekayaan mereka. Dan janganlah engkau, wahai nabi Muhammad dan juga kaum mukmin, kagum terhadap harta mereka sebanyak apa pun dan juga anak-anak mereka. Sesungguhnya dengan itu, yakni harta dan anak-anak tersebut, Allah hendak menyiksa mereka di dunia sehingga berani menyombongkan diri dengan menolak kebenaran dan agar dalam keadaan bergelimang harta itu juga nyawa mereka melayang, sedang mereka mati dalam keadaan kafir."
  }
]