[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu (wahai rasul) takjub terhadap harta benda orang-orang munafik dan anak-anak mereka. Sesungguhnya Allah hanyalah menghendaki untuk menyiksa mereka dengan itu di dunia lantaran harus mengarungi kesulitan-kesulitan dalam menanganinya, dan lantaran kematian mereka diatas kekafiran kepada Allah dan rasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Janganlah kamu -wahai Rasul- takjub dengan kekayaan dan anak-anak orang-orang munafik itu. Karena sesungguhnya Allah hendak menjadikannya sebagai sarana untuk mengazab mereka di dunia. Yaitu dengan segala kesulitan yang mereka hadapi dalam mencarinya, berbagai musibah yang menimpa mereka di dunia, dan keluarnya nyawa dari raga mereka dalam keadaan kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Hai Rasulullah, janganlah takjub dengan harta dan keturunan orang-orang munafik, karena Allah hendak mengazab mereka dengan hal itu di kehidupan dunia, yaitu dengan penderitaan dan musibah yang mereka rasakan demi mendapatkannya, dan agar mereka mati dalam keadaan kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَلَا تُعْجِبْكَ أَمْوٰلُهُمْ (Dan janganlah harta benda mereka menarik hatimu) Telah dijelaskan tafsirnya pada ayat 55 dalam surat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Jangan sampai kamu tergoda terhadap nikmat yang Kami berikan kepada mereka berupa harta benda dan anak-anak. Sesungguhnya Allah ingin menjadikan hal itu sebagai sebab untuk mengazab mereka di dunia dengan menurunkan musibah, kegelisahan, dan penderitaan, lalu ruh-ruh mereka keluar dan mati dalam keadaan kufur tanpa merenungi akibat dari perkara mereka, kemudian mereka dilemparkan dalam neraka Jahanam. Itulah jenis orang munafik lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya dengan itu Allah berkehendak untuk menyiksa mereka di dunia dan nyawa mereka melayang dalam keadaan kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Yakni, janganlah kamu silau dengan harta dan anak-anak yang Allah berikan kepada mereka di dunia, karena hal itu bukan karena mereka mulia di sisiNya, akan tetapi hal itu justru penghinaan dariNya untuk mereka. “Sesungguhnya Allah menghendaki akan mengazab mereka di dunia dengan harta dan anak-anak itu.” Mereka lelah dalam mendapatkannya, takut kehilangan, dan tidak tenang karenanya. Bahkan mereka senantiasa mendapatkan kesulitan dan kesengsaraan karenanya, ia melalaikan mereka dari Allah dan alam akhirat sampai mereka berpindah dari dunia. “Dan agar melayang nyawa mereka dalam keadaan kafir.” Kecintaan terhadap segala sesuatu telah membinasakan mereka, dan mereka pun mati sementara hati mereka terkait padanya dengan penuh nafsu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 85: Yakni jangan tertipu hanya karena mereka diberikan harta dan anak, yang demikian bukanlah karamah untuk mereka, bahkan penghinaan dari-Nya untuk mereka. Sehingga mereka bersusah payah untuk memperolehnya, takut jika apa yang mereka peroleh hilang, dan tidak merasa nikmat dengannya. Lebih dari itu, mereka senantiasa memperoleh kepenatan dan kesusahan. Harta dan anak mereka juga membuat mereka sibuk dan lupa dari mengingat Allah dan mengingat akhirat, sehingga mereka meninggalkan dunia dalam keadaan kafir, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 85",
    "description": "Setelah Allah melarang untuk menyalatkan kaum munafik, kemudian dia mengingatkan agar juga tidak terpedaya oleh kekayaan mereka. Dan janganlah engkau, wahai nabi Muhammad dan juga kaum mukmin, kagum terhadap harta mereka sebanyak apa pun dan juga anak-anak mereka. Sesungguhnya dengan itu, yakni harta dan anak-anak tersebut, Allah hendak menyiksa mereka di dunia sehingga berani menyombongkan diri dengan menolak kebenaran dan agar dalam keadaan bergelimang harta itu juga nyawa mereka melayang, sedang mereka mati dalam keadaan kafir. Ayat yang lalu menjelaskan sikap buruk kaum munafik, maka ayat ini menjelaskan sikap buruk lainnya, terutama dari mereka yang terpandang di masyarakat. Dan apabila diturunkan suatu surah yang memerintahkan kepada orang-orang munafik, berimanlah kepada Allah dan berjihadlah bersama rasul-Nya, niscaya orang-orang munafik, terutama yang kaya dan berpengaruh di antara mereka, meminta izin kepadamu untuk tidak berjihad dan mereka berkata, biarkanlah kami berada bersama orang-orang yang duduk tinggal di rumah, tidak ikut berjihad."
  }
]