[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila turun surat kepada Muhammad yang memerintahkan untuk beriman kepada Allah, ikhlas kepadaNya dan berjihad bersama rasulullah , maka meminta izin kepadamu (wahai rasul) orang-orang yang kaya dari kalangan orang-orang munafik sembari berkata ”tinggalkanlah kami bersama orang-orang yang tinggal lagi tidak berdaya untuk berangkat perang.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Apabila Allah menurunkan surah kepada nabi-Nya, Muhammad -ṣallallāhu 'alaihi wa sallam-, yang berisi perintah untuk beriman kepada Allah dan berjihad fi sabilillah, maka orang-orang kaya mereka meminta izin kepadamu untuk tidak menyertaimu. Mereka berkata, \"Biarkan kami tinggal bersama orang-orang yang punya uzur, seperti orang-orang yang lemah dan orang-orang jompo.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Dan jika Allah menurunkan suatu surat yang mengandung perintah untuk beriman kepada Allah dan berjihad di jalan-Nya; niscaya orang-orang yang memiliki kekayaan di antara mereka akan meminta izin untuk tidak mengikuti jihad, dengan berkata: “Biarkanlah kami tetap tinggal bersama orang-orang yang memiliki uzur, seperti orang-orang lemah dan tua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَإِذَآ أُنزِلَتْ سُورَةٌ (Dan apabila diturunkan suatu surat) Terdapat pendapat mengatakan yang dimaksud adalah surat at-Taubah ini. اسْتَـْٔذَنَكَ أُو۟لُوا۟ الطَّوْلِ مِنْهُمْ (niscaya orang-orang yang sanggup di antara mereka meminta izin kepadamu) Yakni orang-orang yang memiliki kesanggupan dan kelapangan. Pendapat lain mengatakan mereka adalah para pemimpin, dan para pembesar. وَقَالُوا۟ ذَرْنَا نَكُن مَّعَ الْقٰعِدِينَ(dan mereka berkata: “Biarkanlah kami berada bersama orang-orang yang duduk) Yakni bersama orang-orang yang tidak mengikuti perang karena suatu uzur seperti orang-orang lemah dan lansia. Sehingga kami bisa duduk dan tidak mengikuti perang bersamamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Tatkala turun suatu surah atau sebagian surah Al-Qur’an yang memerintahkan mereka untuk beriman kepada Allah dan berjihad bersama rasulullah, maka orang yang memiliki keutamaan, kelapangan, dan kemampuan untuk berjihad dengan jiwa dan harta akan meminta ijin kepadamu untuk mengundurkan diri dari jihad. Mereka akan berkata: “Tinggalkanlah kami bersama orang-orang yang tidak mampu berperang dan dimaafkan, seperti orang-orang yang lemah, anak-anak dan perempuan” Ini adalah bukti kepengecutan, kerendahan dan kehinaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika diturunkan suatu surah agar mereka beriman kepada Allah dan berjihad bersama RasulNya, niscaya orang-orang yang berkemampuan} orang-orang yang memiliki kekayaan dan kesejahteraan {meminta izin kepadamu dan berkata,“Biarkanlah kami} tinggalkanlah kami {bersama orang-orang yang duduk”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Allah berfirman menjelaskan sikap orang-orang munafik yang terus menerus merasa berat dalam melaksanakan ketaatan, dan bahwa surat-surat dan ayat-ayat tidak berpengaruh pada mereka, “dan apabila diturunkan sesuatu surat (yang memerintahkan kepada orang munafik itu)”, yang padanya mereka diminta untuk beriman kepada Allah dan berjihad di jalanNya, “niscaya orang-orang yang sanggup di antara mereka meminta izin kepadamu (untuk tidak berjihad).” Yakni orang-orang yang berharta yang tidak beruzur, padahal Allah telah memberi mereka harta dan anak-anak, mengapa mereka tidak bersyukur kepada Allah, memujiNya, dan melakukan apa yang diwajibkanNya dan yang telah dimudahkan atas mereka? Akan tetapi mereka enggan kecuali bermalas-malasan dan meminta izin untuk tidak berangkat. “Dan mereka berkata, ‘Biarkanlah kami berada bersama orang-orang yang duduk’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 86: Ada yang mengatakan, bahwa maksudnya adalah surat At Taubah ini. Maksudnya: bersama orang-orang yang tidak ikut berperang dari kalangan orang-orang yang beruzur, seperti orang-orang yang lemah dan orang yang sakit menahun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 86",
    "description": "Ayat yang lalu menjelaskan sikap buruk kaum munafik, maka ayat ini menjelaskan sikap buruk lainnya, terutama dari mereka yang terpandang di masyarakat. Dan apabila diturunkan suatu surah yang memerintahkan kepada orang-orang munafik, berimanlah kepada Allah dan berjihadlah bersama rasul-Nya, niscaya orang-orang munafik, terutama yang kaya dan berpengaruh di antara mereka, meminta izin kepadamu untuk tidak berjihad dan mereka berkata, biarkanlah kami berada bersama orang-orang yang duduk tinggal di rumah, tidak ikut berjihad. Mereka rela senang berada bersama orang-orang yang tidak pergi berperang, yaitu orang tua, orang sakit, kaum perempuan, dan anak-anak, dan hati mereka telah tertutup dari hidayah disebabkan sikap-sikap kemunafikan sehingga mereka tidak memahami balasan bagi orang yang beriman dan berjihad berupa kebahagiaan surgawi."
  }
]