[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik lebih senang celaan melekat pada diri mereka, lantaran mereka tinggal bersama di rumah-rumah bersama wanita-wanita, anak-anak, dan orang-orang yang terhalang udzur. Dan Allah mengunci hati-hati mereka disebabkan kemunafikan mereka dan berpalingnya mereka dari berjihad dan berangkat bersama rasulullah di jalan Aallah. Mereka itu tidak memahami apa-apa yang mengandung kebaikan dan hidayah lurus bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Orang-orang munafik itu dengan senang hati menempatkan diri mereka di dalam kehinaan dan kenistaan manakala mereka dengan senang hati duduk berpangku tangan bersama orang-orang yang berhalangan (dan tidak pergi ke medan perang). Allah mengunci mati hati mereka disebabkan oleh kekafiran dan kemunafikan mereka. Mereka sama sekali tidak mengetahui kepentingan mereka di sana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Orang-orang munafik itu rela untuk mendapat kehinaan dan kerendahan bagi diri mereka, ketika mereka rela untuk tetap tinggal bersama para wanita dan orang-orang yang memiliki uzur. Allah telah menutup hati mereka akibat kekafiran dan kemunafikan mereka; sehingga mereka tidak mengetahui sesuatu yang mendatangkan kebaikan dan manfaat bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ الْخَوَالِفِ (Mereka rela berada bersama orang-orang yang tidak berperang) Yakni karena kemunafikan dan apa yang ada dalam hati mereka berupa penyakit hati, keraguan, dan kepengecutan; mereka tidak enggan untuk tetap tertinggal dari Rasulullah seperti para wanita yang tertinggal dari suami mereka dan hanya duduk di rumah mereka. فَهُمْ لَا يَفْقَهُونَ (maka mereka tidak mengetahui) Bahkan mereka layaknya hewan ternak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Mereka rela berdiam diri bersama para wanita yang mengundurkan diri di rumah. Allah mengunci hati mereka dengan kekufuran, sehingga tidak akan mau lagu berbuat kebaikan. Mereka tidak berpikir dan tidak mengetahui keutamaan dalam jihad, serta kekurangan dan aib mengundurkan diri dari perang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka ridha berada bersama orang-orang yang tidak pergi} para perempuan {telah dikunci} dikunci {hati mereka sehingga mereka tidak memahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah berfirman, “Mereka rela berada bersama orang-orang yang tidak pergi berperang.” Yakni, bagaimana mereka rela diri mereka tetap bersama para wanita yang tidak berangkat berjihad? Apakah mereka itu memiliki akal dan pengertian yang menunjukkan mereka untuk ikut berperang ataukah “hati mereka telah dikunci mati”, hingga hati itu tidak memahami kebaikan, tidak terdapat keinginan untuk melakukan kebaikan dan meraih keberuntungan, sehingga mereka tidak mengerti kemaslahatan mereka. Jika mereka benar-benar mengerti, niscaya mereka tidak rela terhadap keadaan ini yang menurunkan harkat mereka sebagai laki-laki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 87: Karena kemunafikan mereka dan karena apa yang ada dalam hati mereka berupa penyakit, keraguan, dan sifat pengecut sehingga membuat mereka senang meninggalkan Rasulullah shallallahu 'alaihi wa sallam. Yaitu wanita-wanita, anak-anak, orang-orang lemah, orang-orang yang sakit dan orang-orang yang sudah tua. Mereka tidak memahami hal yang bermaslahat bagi mereka dan tidak ada lagi keinginan untuk mengerjakan perbuatan yang di sana terdapat kebaikan dan keberuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 87",
    "description": "Mereka rela senang berada bersama orang-orang yang tidak pergi berperang, yaitu orang tua, orang sakit, kaum perempuan, dan anak-anak, dan hati mereka telah tertutup dari hidayah disebabkan sikap-sikap kemunafikan sehingga mereka tidak memahami balasan bagi orang yang beriman dan berjihad berupa kebahagiaan surgawi. Demikianlah keadaan kaum munafik itu, akan tetapi rasul dan orang-orang yang beriman bersama beliau, mereka berjihad dengan harta dan jiwa demi menegakkan kalimat Allah dan semata-mata mengharap keridaan-Nya. Mereka itu memperoleh kebaikan baik di dunia berupa kemenangan dan kemuliaan, maupun di akhirat kelak berupa kesenangan surgawi. Mereka itulah orang-orang yang beruntung."
  }
]