[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika orang-orang munafik tetap berpaling dari berperang, maka sesungguhnya rasulullah dan kaum mukminin yang bersamanya telah berjihad dengan harta benda dan jiwa raga mereka. Dan bagi mereka kemenangan dan harta rampasan di dunia serta surga dan kemuliaan di akhirat. Dan mereka itulah orang-orang yang beruntung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Sedangkan Rasulullah dan orang-orang yang beriman bersamanya tidak enggan pergi ke medan jihad fi sabilillah seperti orang-orang munafik itu. Orang-orang mukmin telah berjihad di jalan Allah dengan harta dan jiwa mereka, maka balasan yang mereka terima dari Allah ialah tercapainya keuntungan-keuntungan duniawi untuk mereka, seperti kemenangan dan rampasan perang, tercapainya keuntungan-keuntungan ukhrawi, seperti masuk Surga, tercapainya apa yang diinginkan, serta terhindar dari apa yang ditakutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Adapun Rasulullah dan orang-orang beriman yang menyertainya tidak tertinggal untuk berjihad di jalan Allah layaknya orang-orang munafik itu. mereka berjihad di jalan Allah dengan harta dan jiwa mereka; sehingga balasan bagi mereka di sisi Allah adalah kebaikan-kebaikan di dunia berupa kemenangan dan harta ghanimah, dan kebaikan kebaikan di akhirat dengan dapat meraih surga dan mendapatkan apa yang mereka inginkan serta selamat dari apa yang mereka takuti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَأُو۟لٰٓئِكَ لَهُمُ الْخَيْرٰتُ ۖ (Dan mereka itulah orang-orang yang memperoleh kebaikan) Yakni segala kebaikan yang meliputi manfaat dunia dan agama. Pendapat lain mengatakan yang dimaksud adalah para bidadari yang cantik jelita di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Akan tetapi rasulullah dan orang-orang yang beriman kepada risalahnya berjihad dengan harta dan jiwa mereka. Maka mereka berhak menerima pujian dan pahala yang agung. Bagi mereka itu kebaikan dan manfaar yang sangat melimpah di dunia dan akhirat, berupa pertolongan, rampasan perang, dan surga Firdaus yang tinggi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi Rasul dan orang-orang yang beriman bersamanya. Mereka berjihad dengan harta dan jiwa mereka. Mereka memperoleh berbagai kebaikan} manfaat di dunia dan akhirat {Mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Allah berfirman, jika orang-orang munafik itu tidak berangkat jihad, maka Allah tidak membutuhkan mereka, Allah memiliki hamba-hamba khusus yang dikhususkanNya dengan karuniaNya yang melaksanakan perkara ini, mereka adalah “Rasul” Muhammad “dan orang-orang yang beriman bersamanya”, mereka berjihad “dengan harta dan diri mereka,” tanpa merasa berat dan malas, bahkan mereka berbahagia dan optimis, mereka itu adalah “orang-orang yang memperoleh kebaikan”, yang banyak di dunia dan akhirat. Dan mereka itu adalah “orang-orang yang beruntung”, yang meraih keinginan tertinggi dan impian yang mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 88: Yakni, jika orang-orang munafik itu enggan berjihad, maka sesungguhnya Allah tidak butuh kepada mereka, dan Allah memiliki hamba-hamba pilihan-Nya yang siap mengemban tugas itu. Hal ini sama seperti ayat, “Jika orang-orang (Quraisy) itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya.” (Terj. Al An’aam: 89) Yakni kebaikan yang banyak; baik di dunia maupun di akhirat. Merekalah orang-orang yang memperoleh apa yang mereka cita-citakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 88",
    "description": "Demikianlah keadaan kaum munafik itu, akan tetapi rasul dan orang-orang yang beriman bersama beliau, mereka berjihad dengan harta dan jiwa demi menegakkan kalimat Allah dan semata-mata mengharap keridaan-Nya. Mereka itu memperoleh kebaikan baik di dunia berupa kemenangan dan kemuliaan, maupun di akhirat kelak berupa kesenangan surgawi. Mereka itulah orang-orang yang beruntung. Allah telah menyediakan bagi mereka, orang mukmin, surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah kemenangan yang besar. Keberuntungan hakiki adalah ketika amal seseorang menyelamatkannya dari neraka dan mengantarkannya ke surga."
  }
]