[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari kiamat, Allah menyediakan bagi mereka surga-surga yang mengalir di bawah istana-istana dan pohon-pohonnya sungai-sungai, mereka tinggal di dalamnya selamanya. Itulah keberuntungan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Allah telah menyiapkan untuk mereka (orang-orang mukmin) surga-surga yang di bawah istana-istananya mengalir sungai-sungai. Mereka akan tinggal di sana untuk selama-lamanya dan mereka tidak akan binasa. Balasan itu adalah keberuntungan besar yang tidak tertandingi oleh keberuntungan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Kemudian Allah menjelaskan kemenangan yang paling besar, dengan berfirman: “Allah menyiapkan bagi mereka surga-surga yang di dalamnya terdapat sungai-sungai mengalir di bawah istana-istana; mereka akan hidup di sana selamanya. Demikianlah balasan berupa kemenangan yang tidak tertandingi oleh apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Allah mempersiapkan orang-orang mukmin yang berjihad surga-surga yang di bawah kebun-kebun dan bilik-biliknya mengalir sungai-sungai. Demikian itu adalah kemenangan agung yang tidak ada kemenangan lagi setelahnya dan itu adalah derajat yang tinggi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menyediakan bagi mereka surga yang mengalir sungai-sungai di bawahnya. Mereka kekal di dalamnya. Itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. “Allah telah menyediakan bagi mereka Surga yang mengalir di bawahnya sungai-sungai, mereka kekal didalamnya. Itulah kemenangan yang besar.” Celakalah orang yang tidak berminat kepada apa yang mereka minati, dia merugi agama, dunia, dan akhiratnya. Ini mirip dengan Firman Allah, \"Katakanlah: \"Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,\" (Al-Isra:107) dan \"Jika orang-orang (Quraisy) itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya.\" (Al-An’am:89)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 89: Oleh karena itu, rugilah bagi mereka yang tidak menginginkan seperti yang mereka inginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 89",
    "description": "Allah telah menyediakan bagi mereka, orang mukmin, surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya. Itulah kemenangan yang besar. Keberuntungan hakiki adalah ketika amal seseorang menyelamatkannya dari neraka dan mengantarkannya ke surga. Ayat ini menjelaskan sifat-sifat munafik kaum arab badui atau yang disebut a'ra'biy. Dan di antara orang-orang arab badui datang kepada nabi Muhammad mengemukakan alasan yang dibuat-buat agar diberi izin untuk tidak pergi berpe-rang, sedang orang-orang yang mendustakan Allah dan rasul-Nya dari kaum munafik duduk berdiam diri saja tidak mengajukan alasan mengapa tidak ikut berjihad. Kelak orang-orang yang kafir di antara mereka, yakni penduduk madinah yang munafik dan penduduk arab badui, akan ditimpa azab yang pedih."
  }
]