[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menukarkan ayat-ayat Allah dengan kekayaan dunia yang tidak bernilai, lalu mereka menghalang-halangi dari kebenaran dan mencegah orang-orang yang berkeinginan masuk islam dan memeluknya. maka alangkah buruk perbuatan mereka dan itulah seburuk-buruk perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Mereka menukar dan mengganti kesediaan mereka untuk mengikuti ayat-ayat Allah, termasuk menepati janji dengan harga yang sangat murah. Yaitu harta benda yang mereka gunakan untuk mendapatkan kesenangan dan kepuasan hati mereka. Mereka menghalang-halangi diri mereka sendiri dari kebenaran dan berpaling darinya. Dan mereka juga menghalang-halangi orang lain dari kebenaran. Sungguh buruk perbuatan yang telah mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. mereka menukar ayat-ayat Allah yang agung dan hikmah-hikmahnya yang berharga dengan sedikit kesenangan dunia berupa kemewahan hidup dan harta yang melimpah; sehingga mereka menghalangi diri mereka dari Islam dan penegakan perjanjian akibat jual beli rendahan yang mereka lakukan ini, mereka juga menghalangi orang lain. Sungguh buruk perbuatan yang mereka lakukan dengan menjual keimanan dengan kekafiran, dan petunjuk dengan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. اشْتَرَوْا۟ بِـَٔايٰتِ اللهِ ثَمَنًا قَلِيلًا (Mereka menukarkan ayat-ayat Allah dengan harga yang sedikit) Yakni menukar ayat-ayat al-Qur’an yang termasuk didalamnya adalah ayat yang mengandung perintah untuk menepati perjanjian dengan harga yang rendah, yaitu harta dunia yang mereka utamakan. فَصَدُّوا۟ عَن سَبِيلِهِۦٓ ۚ (lalu mereka menghalangi (manusia) dari jalan Allah) Yakni berpaling dari jalan kebenaran dan memalingkan orang lain darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9 Mereka menukarkan ayat-ayat Allah dengan harga yang sedikit untuk tujuan dunia, lalu mereka menghalangi manusia dari jalan Allah. Sesungguhnya amat buruklah apa yang mereka kerjakan itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menukarkan} menukarkan {ayat-ayat Allah dengan harga yang murah} hal duniawi yang remeh {lalu mereka menghalangi dari jalanNya} mereka merintangi manusia dari agama Allah {Sesungguhnya sangat buruk apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “mereka menukarkan ayat-ayat Allah dengan harga yang sedikit.” Yakni mereka memilih bagian yang fana lagi hina di dunia daripada iman kepada Allah, dan RasulNya, dan ketundukan kepada ayat-ayatNya. “lalu mereka menghalangi”, diri mereka sendiri dan orang lain “dari jalan Allah. Sesungguhnya amat buruklah apa yang mereka kerjakan itu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 9: Mereka memilih kesenangan dunia daripada beriman kepada Allah dan Rasul-Nya serta tunduk kepada ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 9",
    "description": "Sikap kefasikan itu juga menjadikan mereka berani memperjualbelikan ayat-ayat Allah dengan harga murah, yakni ditukar dengan hal-hal yang bersifat duniawi, padahal ayat-ayat tersebut secara jelas telah menjadi bukti atas keesaan Allah dan kerasulan nabi Muhammad. Maka, dengan sikapnya itu sesungguhnya mereka telah menghalang-halangi mereka sendiri dan orang lain dari jalan Allah. Sungguh, sikap yang demikian itu menunjukkan betapa buruknya apa yang mereka kerjakan, yakni perilaku sesat dan menyesatkanmereka bukan saja memperjualbelikan ayat-ayat Allah, menghalanghalangi orang lain dari jalan Allah, bahkan mereka juga tidak memelihara hubungan kekerabatan dengan orang mukmin dan tidak pula mengindahkan perjanjian. Sikap mereka itulah bisa dianggap sebagai sikap orangorang yang melampaui batas."
  }
]