[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan datanglah sekelompok orang dari suku-suku arab yang berada di sekitar Madinah, mereka mengajukan alasan kepada rasulullah dan menerangkan kepada beliau keadaan mereka yang lemah dan tidak mampu keluar untuk ikut berperang. Dan satu kaum tinggal (tidak ikut berangkat perang) tanpa alasan yang mereka sampaikan, lantaran kepongahan mereka terhadap rasulullah . Orang-orang kafir dari mereka akan ditimpa siksaan pedih di dunia berupa terbunuh dan yang lainnya, dan di akhirat dengan neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Sejumlah orang Arab Badui Madinah dan sekitarnya datang kepada Rasulullah -ṣallallāhu 'alaihi wa sallam- untuk meminta izin tidak pergi ke medan jihad fi sabilillah. Ada sejumlah orang lainnya sama sekali tidak meminta izin kepada beliau untuk tidak pergi ke medan jihad, karena mereka tidak percaya kepada nabi dan tidak percaya akan janji Allah. Mereka itu akan mendapatkan azab yang sangat menyakitkan akibat kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Orang-orang badui Madinah mendatangi Rasulullah dengan mengemukakan berbagai alasan agar Rasulullah mengizinkan mereka untuk tidak ikut berjihad di jalan Allah. Dan terdapat kaum yang lain yang duduk saja tanpa mengemukakan alasan karena kebebalan mereka. Orang-orang kafir dari kaum badui yang mengemukakan alasan-alasan batil dan orang-orang yang tidak mengutarakan alasan itu akan mendapat azab yang pedih di dunia dan azab neraka di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَجَآءَ الْمُعَذِّرُونَ (Dan datang (kepada Nabi) orang-orang yang mengemukakan ‘uzur) Mereka adalah orang-orang yang mengemukakan alasan padahal sebenarnya tidak memiliki alasan. Mereka mengemukakan alasan bohong yang tak berdasar. Yakni orang-orang Arab badui itu datang dengan membawa alasan-alasan baik itu alasan yang benar atau bohong agar Rasulullah dapat mengizinkan mereka untuk tidak mengikuti peperangan. Dan gologan lain tidak mengemukakan alasan namun tidak turut serta dalam perang tanpa alasan, mereka adalah orang-orang munafik arab badui. وَقَعَدَ الَّذِينَ كَذَبُوا۟ اللهَ وَرَسُولَهُۥ ۚ (sedang orang-orang yang mendustakan Allah dan Rasul-Nya, duduk berdiam diri saja) Mereka tidak beriman tidak pula mempercayai. Mereka telah berbaiat kepada Rasulullah untuk mendengarkan dan mentaatinya, kemudian tersingkap dengan tidak ikutnya mereka dalam peperangan tanpa memiliki alasan, bahwa mereka adalah orang-orang yang berdusta. سَيُصِيبُ الَّذِينَ كَفَرُوا۟ مِنْهُمْ(Kelak orang-orang yang kafir di antara mereka itu akan ditimpa azab yang pedih) Yakni dari gologan orang-orang arab badui. Mereka adalah orang-orang yang mengajukan alasan-alasan bohong dan orang-orang yang sama sekali tidak mengajukan alasan. Dan mereka telah mendustakan Allah dan Rasul-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ سَيُصِيبُ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ } \"Kelak orang-orang yang kafir di antara mereka itu akan ditimpa azab yang pedih\" Allah mengatakan dalam potongan ayat ini : { مِنْهُمْ } \"diantara mereka\" ; karena Allah mengetahui bahwa sebagian dari mereka akan beriman dan akan terbebas dari azab, maka Allah kemudian menggunakan lafazh (من) sebagai isyarat yang menunjukkan tab'idh (berlaku untuk sebahagian saja)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Dan datang kepada Nabi SAW orang-orang Baduwi yang mengajukan uzur dengan benar supaya beliau memberi ijin mereka untuk mengundurkan diri dari perang Tabuk. Dan orang-orang munafik Baduwi tidak mau berperang tanpa mengemukakan uzur. Mereka itu adalah orang-orang yang tidak beriman kepada Allah dan rasulNya, melainkan berdusta dalam pengakuan keimanan mereka. Orang-orang Baduwi yang ingkar yang mengemukakan uzur palsu maupun yang tidak mengemukakan uzur itu akan ditimpa azab yang menyakitkan di dunia dan akhirat. Mujahid berkata: “Mereka adalah kelompok dari Bani Ghifar atau Bani Ghatfan yang mengemukakan uzur, lalu Allah SWT tidak memberi ijin mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang membuat-buat alasan} orang-orang yang membuat-buat alasan {dari orang-orang Arab} Badui {datang agar diberi izin} untuk tidak pergi berjihad. Dan orang-orang yang mendustakan Allah dan RasulNya duduk. Orang-orang yang ingkar di antara mereka akan ditimpa azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. Allah berfirman, “Dan datang (kepada Nabi) orang-orang yang mengemukakan udzur, yaitu orang-orang Arab Badui agar diberi izin bagi mereka (untuk tidak pergi berjihad).” Yakni orang-orang yang meremehkan dan melalaikan jihad datang agar mereka diizinkan untuk tidak berperang, tanpa mempedulikan apa alasannya karena mereka memang berhati keras, tidak tahu malu, dan karena keimanan mereka yang lemah. Adapun orang-orang yang mundustakan Allah dan RasulNya, maka mereka sama sekali tidak berangkat berperang dan tidak pula mengajukan udzur. Ada kemungkinan makna Firman Allaah, “orang-orang yang mengemukakan udzur”, adalah orang-orang yang beruduzur, mereka datang kepada Nabi agar dimaklumi, dan kebiasaan Nabi adalah memaklumi orang yang berudzur. “sedang orang-orang yang mendustakan Allah dan RasulNya, duduk berdiam diri saja”, padahal mereka mengklaim beriman yang seharusnya menuntut mereka untuk berjihad namun mereka tidak mengamalkannya. Kemudian Allah mengancam mereka dengan FirmanNYa, “Kelak orang-orang yang kafir di antara mereka itu akan ditimpa azab yang pedih”, di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 90: Orang-orang Arab baduwi yang kurang peduli terhadap agama datang menghadap Rasulullah shallallahu 'alaihi wa sallam agar mereka diberi izin untuk tidak berperang. Mereka tidak peduli dengan alasan yang mereka kemukakan karena sifat kasar mereka, serta sifat tidak punya malu dan karena iman mereka yang lemah. Kata-kata “mu’adzdzirun” juga bisa berarti orang-orang yang mempunyai alasan yang sesungguhnya tidak bisa dijadikan alasan agar Rasulullah shallallahu 'alaihi wa sallam memberi izin mereka, dan kebiasaan Beliau adalah memberi izin mereka yang mengemukakan alasan. Yakni golongan yang lain dari kalangan kaum munafik Arab baduwi. Mereka duduk-duduk saja dan sama sekali tidak mengemukakan ‘uzur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 90",
    "description": "Ayat ini menjelaskan sifat-sifat munafik kaum arab badui atau yang disebut a'ra'biy. Dan di antara orang-orang arab badui datang kepada nabi Muhammad mengemukakan alasan yang dibuat-buat agar diberi izin untuk tidak pergi berpe-rang, sedang orang-orang yang mendustakan Allah dan rasul-Nya dari kaum munafik duduk berdiam diri saja tidak mengajukan alasan mengapa tidak ikut berjihad. Kelak orang-orang yang kafir di antara mereka, yakni penduduk madinah yang munafik dan penduduk arab badui, akan ditimpa azab yang pedih. Inilah kelompok yang diizinkan untuk tidak ikut perang. Tidak ada dosa karena tidak pergi berperang atas orang yang lemah, baik karena usianya sudah tua maupun lemah fisik seperti kaum perempuan dan anak-anak, orang yang sakit dan orang miskin yang tidak memperoleh apa, yakni biaya atau bekal, yang akan mereka infakkan untuk berjihad juga untuk keluarga yang ditinggalkan, apabila mereka ikhlas dalam niat dan imannya kepada Allah dan senantiasa menunjukkan sikap ketaatan kepada rasul-Nya, maka tidak ada alasan apa pun untuk menyalahkan dan mencela mereka, sebab sejatinya mereka itu adalah orang-orang yang berbuat baik dan tidak membenci perintah jihad. Dan Allah maha pengampun, maha penyayang. Ini merupakan hukum yang berlaku bagi semua taklif agama, sebab pada dasarnya manusia itu tidak memperoleh beban di atas kesanggupannya."
  }
]