[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada dosa atas orang-orang yang mempunyai alasan benar, seperti orang-orang yang lemaah fisik, orang-orang yang sakit, orang-orang fakir yang tidak memiliki sesuatu untuk mereka pergunakan sebagai persiapan berangkat jihad untuk tidak berperang, bila mereka bersikap ikhlas kepada Allah dan rasulNya, serta mengerjakan syariatNya.Tidak ada jalan untuk menyalahkan dan menghukum orang yang berbuat baik dari orang yang terhalangi keadaan untuk berjihad bersama rasulullah , sedang dia seorang yang bersikap baik kepada Allah dan rasulNya.Dan Allah maha pengampun bagi orang-orang yang berbuat baik lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Para wanita, anak-anak, orang-orang sakit, orang-orang jompo, orang-orang buta, dan orang-orang miskin yang tidak memiliki harta untuk membiayai jihadnya, mereka semua tidak berdosa bila tidak pergi ke medan jihad, karena mereka memiliki alasan yang dibenarkan, apabila mereka benar-benar tulus kepada Allah dan rasul-Nya dan menerapkan syariat-Nya. Tidak ada alasan untuk menjatuhkan hukuman kepada orang-orang yang benar-benar memiliki alasan kuat itu. Dan Allah Maha Pengampun lagi Maha Penyayang kepada orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Para wanita, anak-anak, orang-orang sakit, para lansia, orang-orang buta, dan orang-orang miskin yang tidak memiliki harta untuk melakukan perjalanan menuju medan jihad; mereka semua tidak berdosa karena tidak pergi berjihad, sebab alasan mereka dapat diterima jika mereka ikhlas beriman kepada Allah dan Rasul-Nya, dan menjalankan syariat-Nya. Orang-orang baik yang memiliki alasan tersebut tidak berdosa dan tidak akan disiksa. Allah Maha mengampuni dosa-dosa orang yang baik dan mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. لَّيْسَ عَلَى الضُّعَفَآءِ (Tiada dosa (lantaran tidak pergi berjihad) atas orang-orang yang lemah) Mereka adalah para wanita dan anak-anak. وَلَا عَلَى الْمَرْضَىٰ( orang-orang yang sakit) Mereka adalah orang-orang tua, renta, buta, pincang, dan lain sebagainya. Yakni tidak berdosa bagi mereka untuk tidak ikut pergi berperang karena mereka memiliki alasan yang dibenarkan, yaitu alasan yang menimpa badan mereka. Kemudian Allah menyebutkan alasan lain yang berasal dari harta benda dan bukan disebabkan badan mereka dengan firman-Nya: “dan tidak ada dosa bagi orang-orang yang tidak memiliki harta untuk dikeluarkan”. وَلَا عَلَى الَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ(dan atas orang-orang yang tidak memperoleh apa yang akan mereka nafkahkan) Allah menjelaskan bahwa kewajiban berjihad gugur dari mereka dengan adanya alasan-alasan ini. إِذَا نَصَحُوا۟ لِلّٰهِ وَرَسُولِهِۦ ۚ( apabila mereka berlaku ikhlas kepada Allah dan Rasul-Nya) Nasehat kepada Allah adalah dengan beriman kepada-Nya, menjalankan syariat-Nya, dan meninggalkan segala sesuatu yang menyelisihinya, dan masuk didalamnya adalah menasehati hamba-hamba-Nya, mencintai orang yang berjuang di jalan-Nya dan menasehati mereka dalam urusan jihad mereka serta tidak membantu musuh-musuh mereka dengan cara apapun. Sedangkan nasehat kepada Rasulullah adalah dengan membenarkan kenabiannya dan apa yang dibawanya, mentaatinya dalam setiap perintah dan larangannya, mencintai orang yang dicintainya dan membenci orang yang dibencinya, mencintainya, mengagungkan sunnah-sunnahnya dan menghidupkan sunnah-sunnah tersebut setelah kematiannya sesuai kemampuan. Disebutkan dalam hadist shahhih, Rasulullah bersabda: “agama adalah nasehat”. Para sahabat bertanya: “untuk siapa nasehat itu wahai Rasulullah?”. Beliau menjawab: “untuk Allah, untuk kitab-kitab-Nya, untuk Rasul-Nya, dan untuk para pemimpin kaum muslimin dan mereka semuanya”. مَا عَلَى الْمُحْسِنِينَ مِن سَبِيلٍ ۚ( Tidak ada jalan sedikitpun untuk menyalahkan orang-orang yang berbuat baik) Yakni tidak ada alasan untuk menghukum dan menyiksa orang-orang yang memiliki uzur, begitu pula orang-orang yang berbuat baik selain mereka. Dan pahala berperang tetap mereka dapatkan karena mereka sebenarnya berharap untuk ikut serta kalaulah uzur itu tidak menahan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini menunjukkan asal hukum yang dibebaskan dari seseorang yang tidak mampu menunaikan satu kewajiban syar'i, maka setiap yang lemah dan tidak mampu mengerjakan suatu kewajiban dalam syari'at maka hukum tidak dijatuhkan kepadanya, sekalipun terkadang ia mampu mengerjakannya, dan dikesempatan lain ia tidak mampu, hukum yang berlaku hanya ketika ia mampu dan memiliki kekuatan untuk mengerjakannya, dan tidak ada perbedaan antara kemampuannya dari segi jasmani ataupun dari segi kepemilikan harta. 2 ). { مَا عَلَى الْمُحْسِنِينَ مِنْ سَبِيلٍ } \"Tidak ada jalan sedikitpun untuk menyalahkan orang-orang yang berbuat baik\" pada potongan ayat ini menunjukkan diangkatnya hukuman dari orang yang berbuat kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Tiada dosa bagi orang-orang lemah (Orang tua yang renta, para perempuan dan anak-anak) untuk meninggalkan jihad, tidak berdosa pula orang yang sakit seperti orang yang sakit-sakitan dan orang buta, dan tidak juga orang-orang fakir yang tidak bisa menafkahi diri sendiri. Apabila mereka ikhlas dalam keimanannya dan ikrarnya hanya kepada Allah, mengakui rasulullah sebagai Nabi dengan nubuwwahnya, menaati keduanya (Allah dan rasulullah) dalam perintah dan larangannya, maka tidaklah atas orang-orang yang ikhlas hanya kepada Allah dan rasulnya, yaitu mereka yang uzur itu, suatu dosa, celaan, dan teguran karena mundur dalam jihad. Dan Allah Maha Pengampun lagi Maha Penyayang bagi mereka dengan memberikan keleluasaan bagi mereka dan tidak memberi beban yang tidak mampu mereka tanggung. Ayat ini turun terkait orang buta yang datang menanyai rasulullah SAW tentang aturan peperangan yang sebenarnya, lalu turunlah ayat {Laisa ‘alad dhu’afa’}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa} dosa {bagi orang-orang yang lemah} orang-orang yang lemah {tidak pula orang-orang yang sakit dan yang tidak mendapatkan apa yang akan mereka infakkan. jika mereka ikhlas} ikhlas {kepada Allah dan RasulNya. Tidak ada jalan} jalan untuk menghukum dan menyiksa {bagi orang-orang yang berbuat baik. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Ketika Allah menyebutkan orang-orang yang mengemukakan udzur untuk tidak ikut berjihad, mereka ada dua golongan: golongan yang alasannya diterima oleh syariat dan golongan yang alasannya ditolak, maka hal itu dijelaskan dengan FirmanNya, “Tiada dosa (lantaran tidak pergi berjihad) atas orang-orang yang lemah”, jasmani dan penglihatannya, tidak mempunyai kemampuan untuk pergi berperang “atas nama orang-orang yang sakit.” Ini mencakup seluruh jenis sakit yang mana penderitanya tidak mampu keluar berjihad, seperti pincang, buta, demam, radang selaput dara, mati separuh dan lain-lain. “Dan atas orang-orang yang tidak memperoleh apa yang akan mereka nafkahkan.” Yakni mereka tidak mendapatkan bekal dan kendaran untuk menempuh perjalanan jihad. Mereka itu tiada berdosa dengan syarat berlaku ikhlas kepada Allah dan RasulNya, yaitu beriman dengan iman yang benar, dengan niat dan tekad jika seandainya mereka mampu niscaya mereka akan berjihad, dan mereka melakukan apa yang mereka mampu, yaitu memberikan dorongan, ajaran, serta semangat kepada orang lain untuk berjihad. “Tidak ada jalan sedikit pun untuk menyalahkan orang-orang yang berbuat baik.” Yakni jalan untuk disalahkan, karena dengan kebaikan mereka terkait dengan hak Allah dan hak para hamba membuat mereka tidak disalahkan, jika seorang hamba melakukan apa yang dia mampu dengan baik, maka gugurlah kesalahan pada apa yang dia tidak mampu. Ayat ini dijadikan sebagai dalil atas sebuah kaidah, yaitu bahwa barangsiapa yang berbuat kebaikan kepada orang lain pada jiwanya atau pada hartanya dan lainnya, lalu kebaikannya itu menimbulkan kekurangan atau kerusakan, maka dia tidak bertanggung jawab (menanggung) karena dia berbuat baik, dan tidak ada jalan untuk menyalahkan orang-orang yang berbuat baik. Sebagaimana ayat ini juga menunjukkan bahwa orang yang berbuat buruk seperti orang yang lalai, maka dia harus menanggungnya. “Dan Allah Maha Pengampun lagi Maha Penyayang.” Di antara ampunan dan rahmatNya adalah bahwa Dia memaafkan orang-orang yang lemah dan memberi mereka pahala dengan niat kuat mereka, sama dengan pahala orang-orang yang mampu melakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 91: Setelah Allah menyebutkan tentang orang-orang yang memiliki uzur, dan bahwa mereka terbagi menjadi dua bagian; ada orang yang tidak dapat diterima uzurnya dan ada pula yang diterima uzurnya menurut syara’, maka di ayat ini Allah Subhaanahu wa Ta'aala menyebutkan tentang mereka yang diterima uzurnya menurut syara’. Seperti orang yang lemah badan (sudah tua) dan lemah penglihatannya (buta), di mana mereka tidak memiliki kekuatan lagi untuk pergi berperang. Penyakit ini mencakup penyakit yang membuat orangnya tidak sanggup berangkat perang, seperti pincang, buta, demam, penyakit pada lambung (dzaatul janbi), lumpuh, dsb. Yakni mereka tidak memiliki bekal dan kendaraan yang dapat digunakan untuk berangkat, maka tidak ada dosa bagi mereka dengan syarat mereka berlaku tulus kepada Allah dan Rasul-Nya, yaitu imannya benar, dalam hati mereka ada keinginan bahwa jika mereka mampu, maka mereka akan berjihad dan akan melakukan hal yang mampu mereka lakukan, seperti memberikan dorongan kepada yang lain untuk berjihad, tidak melemahkan dan tetap taat. Baik terhadap hak Allah maupun hak hamba-hamba Allah. Apabila seorang hamba telah berbuat baik sesuai kesanggupannya, maka gugurlah darinya sesuatu yang tidak disanggupinya. Syaikh As Sa’diy rahimahullah menerangkan, bahwa dari ayat ini dapat diambil kaidah, yaitu barang siapa berbuat ihsan terhadap orang lain, baik pada diri orang lain maupun hartanya, dsb. kemudian ada yang kurang atau rusak, maka dia tidak menanggungnya karena telah berbuat baik. Demikian juga dapat diambil kaidah, bahwa orang yang tidak baik, seperti mereka yang meremehkan (padahal mempunyai tugas memperhatikannya), maka ia wajib menanggung. Karena Dia Maha Pengampun dan Penyayang, Dia memaafkan orang-orang yang tidak sanggup, dan membalas mereka dengan balasan yang sama seperti orang yang mampu dan melakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 91",
    "description": "Inilah kelompok yang diizinkan untuk tidak ikut perang. Tidak ada dosa karena tidak pergi berperang atas orang yang lemah, baik karena usianya sudah tua maupun lemah fisik seperti kaum perempuan dan anak-anak, orang yang sakit dan orang miskin yang tidak memperoleh apa, yakni biaya atau bekal, yang akan mereka infakkan untuk berjihad juga untuk keluarga yang ditinggalkan, apabila mereka ikhlas dalam niat dan imannya kepada Allah dan senantiasa menunjukkan sikap ketaatan kepada rasul-Nya, maka tidak ada alasan apa pun untuk menyalahkan dan mencela mereka, sebab sejatinya mereka itu adalah orang-orang yang berbuat baik dan tidak membenci perintah jihad. Dan Allah maha pengampun, maha penyayang. Ini merupakan hukum yang berlaku bagi semua taklif agama, sebab pada dasarnya manusia itu tidak memperoleh beban di atas kesanggupannya. Dan begitu juga tidak ada dosa atas orang-orang miskin yang tidak memiliki kendaraan untuk digunakan berjihad lalu datang kepadamu, nabi Muhammad, agar engkau memberi kendaraan kepada mereka, lalu engkau berkata, aku tidak memperoleh atau tidak memiliki kendaraan untuk membawamu ikut berjihad, lalu mereka meninggalkan rasulullah kembali ke rumahnya, sambil mata mereka bercucuran air mata karena sedih, disebabkan mereka tidak memperoleh apa yang akan mereka infakkan untuk ikut berperang."
  }
]