[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian pula, tidak ada dosa atas orang-orang yang bila mereka datang kepadamu untuk memohon agar kamu menolong mereka dengan membawa mereka menuju medan jihad, lalu kamu katakan kepada mereka, ”aku tidak mendapati tunggangan untuk ku gunakan mengangkut kalian,” lalu mereka pergi dari sisimu, sedang mata mereka bercucuran air mata, lantaran perasaan kecewa terhadap apa yang mereka lewatkan dari kemuliaan jihad dan pahalanya, dikarenakan mereka tidak mendapatkan sesuatu yang dapat mereka infakan dan apa yang bisa mengangkut mereka untuk keluar berjihad di jalan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Tidak ada dosa bagi orang-orang yang tidak pergi ke medan perang bersamamu -wahai Rasul- apabila mereka datang kepadamu untuk meminta kendaraan yang bisa mengangkut mereka ke medan jihad, sedangkan kamu berkata kepada mereka, \"Aku tidak menemukan kendaraan yang dapat mengangkut kalian.\" Mereka pergi dari hadapanmu sambil berurai air mata. Mereka sangat menyesal karena tidak memiliki harta untuk membiayai jihad mereka, baik dari harta pribadi mereka maupun dari sisimu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Dan tidak ada dosa pula atas orang-orang yang tidak pergi berjihad yang mendatangimu agar kamu memberi mereka hewan tunggangan untuk berjihad, kemudian kamu berkata kepada mereka: “Aku tidak memiliki hewan tunggangan yang dapat kalian pakai.” Kemudian mereka pergi darimu dengan bercucuran air mata karena tidak memiliki harta untuk pergi berjihad dan tidak mendapatkannya darimu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَلَا عَلَى الَّذِينَ إِذَا مَآ أَتَوْكَ لِتَحْمِلَهُمْ (dan tiada (pula) berdosa atas orang-orang yang apabila mereka datang kepadamu, supaya kamu memberi mereka kendaraan) Mereka adalah sekelompok orang dari kaum Anshar yang meminta Rasulullah untuk memberi mereka hewan tunggangan. Pendapat lain mengatakan bahwa mereka meminta perbekalan dari Rasulullah. Dan pendapat lain mengatakan mereka hanya meminta alas kaki dari Rasulullah. قُلْتَ لَآ أَجِدُ مَآ أَحْمِلُكُمْ عَلَيْهِ(lalu kamu berkata: “Aku tidak memperoleh kendaraan untuk membawamu”) Termasuk orang-orang yang mendapat uzur adalah mereka yang mendatangimu agar kamu dapat mengangkut mereka diatas tunggangan untuk berperang, namun kamu tidak memiliki apa yang mereka minta. تَوَلَّوا۟ وَّأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ(lalu mereka kembali, sedang mata mereka bercucuran air mata) Yakni mereka kembali setelah kamu berkata kepada mereka “aku tidak memiliki hewan tunggangan untuk mengangkut kalian”, sedang mereka dalam keadaan menangis. حَزَنًا أَلَّا يَجِدُوا۟ مَا يُنفِقُونَ(karena kesedihan, lantaran mereka tidak memperoleh apa yang akan mereka nafkahkan) Baik itu harta dari mereka atau darimu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Apakah kamu melihat dari ayat ini bahwa Allah menyi-nyiakan keyakinan yang kuat ini ? dan kecintaan yang mendalam ini ? sesungguhnya niat yang baik telah diatetapkan baginya balasan yang sama besarnya dengan balasan orang-orang berjihad. 2 ). Kesedihan yang dirasakan seorang mukmin karena terlewatkan oleh ketaatan adalah buah dari kecintaannya kepada ketaatan tersebut, dan perhatiannya untuk menunaikan ketaatan itu; karena seseorang tidaklah ia bersedih kecuali pada sesuatu yang sangat bernilai baginya. 3 ). { تَوَلَّوْا وَأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلَّا يَجِدُوا مَا يُنْفِقُونَ } \"lalu mereka kembali, sedang mata mereka bercucuran air mata karena kesedihan, lantaran mereka tidak memperoleh apa yang akan mereka nafkahkan\" begitulah mereka menangis dikarenakan ketaatan kepada Allah yang belum mampu mereka tunaikan disebabkan oleh kemiskinan harta! dan berapa kali kah kita menangis karena ketaatan yang terlewatkan tetapi tidak ada udzur yang berlaku ?! bahkan selidiki lah dan kamu pasti akan mendapati betapa banyak diantara manusia mereka menangis karena terlewatkan oleh kemaksiatan dan syahwat!!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Tiada dosa pula bagi sekelompok kaum Anshar yang meminta kepada nabi hewan melata yang dapat mereka kendarai untuk ikut dalam berjihad. Lalu ketika kamu berkata kepada mereka: “Aku tidak mendapati unta atau semacamnya yang bisa mengangkut kalian” Lalu mereka bertebaran seraya menangis sedih karena mereka tidak mempunyai sesuatu yang bisa mereka nafkahkan untuk diri sendiri dalam berjihad akibat kefakiran mereka, tidak ada sesuatu bagi mereka atau orang lain. Ayat ini turun terkait 7 orang kaum Anshar yang menangis, mereka berkata kepada rasulullah: “Bawalah kami” Lalu Rasulullah bersabda: “Demi Allah, aku tidak mendapati sesuatu yang bisa aku gunakan untuk mengangkut kalian” Lalu mereka berpaling dan menangis. Mereka tersiksa karena tidak bisa berjihad, sedangkan mereka tidak mendapati nafkah atau kendaraan. Lalu Allah menerima uzur mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak juga bagi orang-orang yang ketika mereka datang kepadamu agar kamu membawa mereka} agar kamu memberi mereka sesuatu yang dapat mereka kendarai untuk berjihad bersamamu {lalu kamu berkata,“Aku tidak mendapatkan sesuatu untuk membawa kalian.” Lalu mereka pergi} mereka pergi {dan air mata mereka bercucuran} mengalir deras {karena sedih tidak mendapatkan apa yang akan mereka infakkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Dan tiada pula (dosa) atas orang-orang yang apabila mereka datang kepadamu, supaya kamu memberi mereka kendaraan”, ternyata kamu tidak memiliki apa pun. “Lalu kamu berkata”, dalam rangka meminta maaf. “’Aku tidak memperoleh kendaraan untuk membawamu,’ lalu mereka kembali, sedang mata mereka bercucuran air mata karena kesedihan, lantaran mereka tidak memperoleh apa yang akan mereka nafkahkan.” Mereka adalah orang-orang yang tidak mampu tetapi mereka bersedia mengorbankan dirinya, bahkan mereka bersedih dan sangat berat hati sebagaimana yang Allah sebutkan. Mereka itu tiada dosa atasnya, dan jika dosa telah gugur dari mereka, maka perkaranya kembali kepada asalnya, yaitu bahwa siapa yang berniat melakukan kebaikan, dan niat kuatnya telah diikuti dengan usaha sebatas kemampuannya kemudian dia tidak mampu maka dia disamakan dengan orang yang melakukannya dengan sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 92: Mereka adalah tujuh orang Anshar, ada yang mengatakan, bahwa mereka adalah Bani Muqarrin. Maksudnya mereka bersedih hati karena tidak mempunyai harta yang akan diinfakkan dan kendaraan untuk membawa mereka pergi berperang. Mereka memiliki niat baik dan berusaha melakukannya semampunya, namun niatnya tidak tercapai, maka ia dianggap seperti orang yang melakukannya secara sama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 92",
    "description": "Dan begitu juga tidak ada dosa atas orang-orang miskin yang tidak memiliki kendaraan untuk digunakan berjihad lalu datang kepadamu, nabi Muhammad, agar engkau memberi kendaraan kepada mereka, lalu engkau berkata, aku tidak memperoleh atau tidak memiliki kendaraan untuk membawamu ikut berjihad, lalu mereka meninggalkan rasulullah kembali ke rumahnya, sambil mata mereka bercucuran air mata karena sedih, disebabkan mereka tidak memperoleh apa yang akan mereka infakkan untuk ikut berperang. Sesungguhnya alasan untuk menyalahkan hanyalah terhadap orangorang yang meminta izin kepadamu untuk tidak ikut berperang padahal mereka orang kaya yang menyediakan kendaraan untuk berperang dan dirinya juga bukan termasuk golongan yang boleh tidak ikut berperang. Mereka justru rela atau lebih senang berada bersama orang-orang yang tidak ikut berperang karena adanya uzur yang dibenarkan. Dan Allah telah mengunci hati mereka, akibat sikap mereka sendiri sehingga mereka tidak mengetahui akibat perbuatan mereka itu."
  }
]