[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dosa dan celaan hanyalah tertuju kepada orang-orang kaya yang datang kepadammu (wahai rasul), meminta izin kepadamu untuk tidak berperang, dan mereka itu adalah orang-orang munafik yang kaya raya. Mereka lebih memilih untuk dirinya sendiri untuk tinggal bersama wanita-wanita dan orang-orang yang memiliki udzur. Dan Allah mengunci hati mereka dengan kemunafikan, sehingga tidak ada keimanan yang memasukinya. Mereka itu tidak menyadari buruknya kesudahan mereka akibat sengaja tidak ikut serta bersamamu dan meningglkan jihad bersamamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Tatkala Allah menjelaskan bahwa kalangan yang berhalangan untuk berjihad tidak layak dihukum, Allah juga menerangkan kalangan yang berhak menerima hukuman serta sangsi, seraya berfirman, \"Sesungguhnya hukuman dan sangsi hanya dijatuhkan kepada mereka yang meminta izin kepadamu -wahai Rasul- untuk tidak pergi ke medan perang, sedangkan mereka memiliki kemampuan untuk itu dan mempunyai harta untuk membiayai jihadnya.\" Mereka merelakan dirinya berada dalam kehinaan dan kenistaan dengan berdiam diri di rumah bersama yang lain. Allah benar-benar telah mengunci mati hati mereka sehingga tidak tersentuh oleh nasihat dan peringatan. Dan karena hati mereka telah dikunci mati, maka mereka tidak tahu apa yang baik bagi mereka untuk mereka pilih dan apa yang buruk bagi mereka untuk mereka hindari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Sesungguhnya dosa dan aib itu adalah bagi orang-orang yang meminta izin kepadamu untuk tidak ikut berjihad, padahal mereka adalah orang-orang yang memiliki harta untuk pergi berjihad. Mereka tidak memiliki alasan dan rela dengan kehinaan yang mengurangi kehormatan lelaki. Mereka duduk di rumah mereka seperti para lansia, wanita, dan anak-anak. Allah telah menutup hati mereka sehingga mereka tidak dapat mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. إِنَّمَا السَّبِيلُ (Sesungguhnya jalan (untuk menyalahkan)) Yakni alasan untuk menghukum atau menyalahkan. عَلَى الَّذِينَ يَسْتَـْٔذِنُونَكَ(hanyalah terhadap orang-orang yang meminta izin kepadamu) Untuk tidak ikut berperang. وَهُمْ أَغْنِيَآءُ ۚ( padahal mereka itu orang-orang kaya) Yakni memiliki apa yang bisa mereka pakai untuk perbekalan. رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ الْخَوَالِفِ(Mereka rela berada bersama orang-orang yang tidak ikut berperang) Bersama para wanita yang duduk-duduk di rumah. فَهُمْ (maka mereka) Disebabkan sikap mereka ini. لَا يَعْلَمُونَ (tidak mengetahui) Tidak mengetahui mana yang terdapat keuntungan bagi mereka, sehingga ia memilih apa yang merugikan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Sesungguhnya jalan hukuman dan celaan itu hanya untuk orang-orang yang meminta ijin kepadamu untuk mengundurkan diri dari jihad, sedangkan mereka memiliki harta dan kemampuan untuk berperang. Mereka lebih rela bersama orang-orang yang mengundurkan diri karena uzur seperti para perempuan. Hal ini diulang untuk menambah penghinaan terhadap mereka dan menggambarkan bahwa mereka seperti perempuan. Dan dalam hal ini terdapat sesuatu yang sangat hina bagi bangsa Arab. Dan Allah mengunci hati mereka sehingga mereka tidak bisa melihat kebenaran, dan tidak mengetahui keutamaan-keutamaan jihad dan kehinaan dari tindakan mengundurkan diri untuk bertemu musuh. Mereka juga tidak menyadari manfaat-manfaatnya sehingga mereka disuguhkan kepada kerugian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya jalan} cara untuk menghukum dan menyiksa {orang-orang yang meminta izin kepadamu, padahal mereka adalah orang-orang kaya. Mereka ridha untuk berada bersama orang-orang yang tidak ikut berperang. Allah telah mengunci hati mereka sehingga mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. “Hanyasanya jalan” yang diarahkan untuk menyalahkan “orang-orang yang meminta izin kepadamu, padahal mereka itu orang-orang kaya,” yang mampu untuk pergi berperang, dan tidak memiliki udzur. “Mereka rela”, untuk diri mereka dan agama mereka “berada bersama-sama orang-orang yang tidak ikut berperang”, seperti wanita, anak-anak dan semisalnya. “Dan” mereka rela dengan keadaan itu karena Allah telah mengunci mati “hati mereka.” Yakni menstempel hati mereka, sehingga tiada kebaikan yang masuk kepadanya dan tidak merasakan kemaslahatan mereka di dunia dan akhirat. “Maka mereka tidak mengetahui (akibat perbuatan mereka)”, sebagai hukuman atas apa yang mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 93: Lagi mampu berperang. Sehingga tidak mungkin dimasuki oleh kebaikan dan tidak mengetahui hal yang bermaslahat bagi mereka baik agama maupun dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 93",
    "description": "Sesungguhnya alasan untuk menyalahkan hanyalah terhadap orangorang yang meminta izin kepadamu untuk tidak ikut berperang padahal mereka orang kaya yang menyediakan kendaraan untuk berperang dan dirinya juga bukan termasuk golongan yang boleh tidak ikut berperang. Mereka justru rela atau lebih senang berada bersama orang-orang yang tidak ikut berperang karena adanya uzur yang dibenarkan. Dan Allah telah mengunci hati mereka, akibat sikap mereka sendiri sehingga mereka tidak mengetahui akibat perbuatan mereka itu usai menjelaskan tentang orang-orang yang pantas dikecam karena tidak ikut perang tabuk, Allah memberitakan kepada nabi bahwa mereka, orang munafik yang tidak ikut berperang, akan terusmenerus mengemukakan alasannya kepadamu ketika kamu telah kembali kepada mereka dari perang tabuk. Katakanlah kepada mereka wahai nabi, janganlah kamu mengemukakan alasan; kami tidak percaya lagi kepadamu, karena kalian sudah sering berbohong, sungguh, Allah telah memberitahukan kepada kami tentang beritamu yang sebenarnya. Dan Allah akan melihat pekerjaanmu yang akan datang seperti dia melihat pekerjaanmu yang sudah lewat, demikian pula rasul-Nya juga akan melihat pekerjaan kamu. Kemudian kamu dikembalikan kepada Allah yang maha mengetahui segala yang gaib dan yang nyata, lalu dia memberitakan kepadamu apa yang telah kamu kerjakan selama hidup di dunia."
  }
]