[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "telah mengajukan alasan kepada kalian (wahai orang-orang mukminin) orang-orang yang tidak ikut serta untuk memerangi kaum musyrikin, dengan kedustaan-kedustaan, ketika kalian kembali dari peperangan kalian dari perang Tabuk. Katakanlah kepada mereka (wahai Rasul), “ janganlah kalian mengajukan alasan, kami sekali-kali tidak akan mempercayai kalian terhadap yang kalian katakan. Sesungguhnya Allah telah mengabarkan kepada kami tentang urusa kalian yang menegaskan kepada kami kedustaan kalian. Dan Allah dan RasulNya akan melihat perbuatan kalian, jika kalian bertaubat dari kemunafikan kalian atau kalian bertahan diatas kemunafikan, dan Dia akan mempertontonkan perbuatan kalian di dunia, kemudian kalian akan kembali setelah kematian kalian kepada Dzat yang tidak tersembunyi bagiNya urusan-urusan kalian yang tersembunyi dan urusan-urusan kalian yang di tampak. Kemudian Dia akan memberikan balasan kepada kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Orang-orang munafik yang tidak pergi ke medan jihad mengajukan alasan-alasan yang lemah kepada kaum muslimin yang kembali dari medan jihad. Allah memberikan petunjuk kepada nabi-Nya dan orang-orang mukmin agar menjawab ucapan mereka dengan mengatakan, \"Jangan membuat alasan-alasan palsu. Kami tidak akan percaya pada apa yang kalian sampaikan kepada kami. Allah telah memberitahu kami sebagian dari apa yang ada di dalam hati kalian. Allah dan rasul-Nya akan melihat apakah kalian akan bertobat kemudian tobat kalian diterima oleh Allah, ataukah kalian akan terus mempertahankan kemunafikan kalian? Kemudian kalian akan dikembalikan kepada Allah yang mengetahui segala sesuatu. Lalu Dia akan memberitahu kalian perihal apa yang telah kalian perbuat, dan Dia akan memberikan balasan yang setimpal kepada kalian. Maka segeralah bertobat kepada Allah dan mengerjakan amal saleh.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Hai orang-orang beriman, orang-orang munafik yang tidak ikut berjihad itu akan mengemukakan alasan mereka kepada kalian, ketika kalian telah kembali dari perang Tabuk. Hai Rasulullah, katakanlah kepada mereka: “Janganlah kalian mengutarakan alasan apapun, karena kami tidak akan menerima alasan itu. Allah telah memberitahukan kami melalui wahyu hakikat dari kebohongan kalian. Allah dan Rasul-Nya akan melihat amalan kalian lain kali, apakah kalian akan bertaubat dari memunafikan atau akan tetap melakukannya? Setelah itu kalian akan kembali kepada Allah yang Maha Mengetahui segala yang tersembunyi dan tidak, kemudian Dia akan memberitahu kalian kabar yang besar tentang keburukan amal kalian, dan Dia akan membalas amalan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. يَعْتَذِرُونَ إِلَيْكُمْ (Mereka (orang-orang munafik) mengemukakan ‘uzurnya kepadamu) Ini merupakan pemberitahuan dari Allah bahwa orang-orang munafik akan mengajukan berbagai alasan kepada orang-orang beriman setelah kembali dari perang. لَن نُّؤْمِنَ لَكُمْ (kami tidak percaya lagi kepadamu) Yakni kami tidak akan percaya kepada kalian. قَدْ نَبَّأَنَا اللهُ مِنْ أَخْبَارِكُمْ (sesungguhnya Allah telah memberitahukan kepada kami beritamu yang sebenarnya) Yakni karena Allah telah mengabarkan kami lewat wahyu-Nya bahwa kalian tidak jujur dalam mengemukakan alasan. وَسَيَرَى اللهُ عَمَلَكُمْ وَرَسُولُهُۥ(Dan Allah serta Rasul-Nya akan melihat pekerjaanmu) Yakni pekerjaan kalian setelah ini, apakah kalian akan berhenti dari kebutukan kalian ini atau akan tetap mengulanginya. ثُمَّ تُرَدُّونَ إِلَىٰ عٰلِمِ الْغَيْبِ وَالشَّهٰدَةِ(kemudian kamu dikembalikan kepada Yang mengetahui yang ghaib dan yang nyata) Yakni Allah Ta’ala yang mengetahui segala sesuatu yang mereka sembunyikan atau mereka tampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Orang-orang munafik yang gagal itu akan mengemukakan uzur kepada orang-orang mukmin setelah mereka kembali dari perang Tabuk. Katakanlah kepada mereka: “Janganlah kalian mengajukan uzur apapun, sungguh kami tidak akan mempercayai kalian, karena sesungguhnya Allah telah memberitahu kami tentang perkara dan keadaan kalian sebenarnya melalui wahyu. Allah dan rasulNya akan melihat perbuatan kalian setelahnya, apakah kalian akan bertaubat atau masih tetap dalam kemunafikan?! Inilah kesempatan untuk bertaubat, lalu setelah mati dan dibangkitkan kalian akan kembali kepada Allah yang Maha Mengetahui yang ghaib dan yang tampak, lalu Dia akan memberitahu kalian tentang amal kalian dan membalas kalian atas amal itu dengan balasan buruk dan azab.” Ayat ini turun terkait 80 laki-laki munafik. Nabi SAW memerintahkan orang-orang mukmin ketika kembali ke Madinah agar tidak duduk dan berbicara dengan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka membuat-buat alasan kepada kalian ketika kalian kembali kepada mereka. Katakanlah,“Janganlah membuat-buat alasan. Kami tidak akan percaya kepada kalian} Kami tidak akan mempercayai kalian {Sungguh Allah telah memberitahu} memberitahu {kami sebagian berita kalian. Allah akan melihat amal kalian, dan Rasul-Nya. Kemudian kalian dikembalikan kepada Dzat Yang Maha Mengetahui segala yang ghaib dan yang nyata, lalu Dia memberitakan} mengabarkan {kepada kalian apa yang selama ini kalian kerjakan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Manakala Allah menyebutkan orang-orang munafik yang mampu tetapi tidak mau pergi berperang, dan bahwa mereka tidak memiliki alasan, maka kemudian Dia menyampaikan bahwa mereka akan mengemukakan alasannya “kepadamu, apabila kamu telah kembali kepada mereka”, dari medan perang. “katakanlah”, kepada mereka “Janganlah kamu mengemukakan udzur, kami tidak percaya lagi kepadamu”, yakni Kami tidak akan mempercayai alasan dustamu. “(Karena) sesungguhnya Allah telah memberitahukan kepada kami beritamu yang sebenarnya.” Dan Dia Mahabenar dalam perkataanNya, jadi tiada berguna lagi alasan yang bertentangan dengan apa yang dinyatakan oleh Allah, dan mustahil mereka benar dalam perkara di mana mereka menyelisihi berita Allah yang merupakan tingkatan paling tinggi dalam hal kebenaran. “Dan Allah serta RasulNya akan melihat pekerjaanmu”, di dunia, karena timbangan kebenaran dan kedustaan adalah amal perbuatan, adapun ucapan saja tidak menunjukkan hal tersebut. “Kemudian kamu dikembalikan kepada Yang Mengetahui yang ghaib dan yang nyata”, yang tiada sesuatu pun yang samar bagiNya. “Lalu Dia memberitakan kepadamu appa yang telah kamu kerjakan,” baik dan buruknya, Dia akan membalasnya dengan keadilan dan karuniaNya tanpa menzhalimimu sedikit pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 94: Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang sikap kaum munafik yang tidak mau berperang dengan mengemukakan uzur yang sebenarnya tidak dapat diterima, maka di ayat ini Allah Subhaanahu wa Ta'aala menerangkan bahwa mereka akan datang mengemukakan uzur setelah Beliau pulang dari perang. Dan berita yang disampaikan-Nya adalah berita yang paling benar. Apakah setelahnya kamu akan berhenti dari perbuatan buruk yang kamu lakukan atau tetap terus? Dan Pekerjaan atau perbuatan merupakan ukuran benar-tidaknya kata-kata yang diucapkannya. Oleh karena itu, Dia akan memberikan balasan terhadapnya tanpa menzalimi sedikit pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 94",
    "description": "Usai menjelaskan tentang orang-orang yang pantas dikecam karena tidak ikut perang tabuk, Allah memberitakan kepada nabi bahwa mereka, orang munafik yang tidak ikut berperang, akan terusmenerus mengemukakan alasannya kepadamu ketika kamu telah kembali kepada mereka dari perang tabuk. Katakanlah kepada mereka wahai nabi, janganlah kamu mengemukakan alasan; kami tidak percaya lagi kepadamu, karena kalian sudah sering berbohong, sungguh, Allah telah memberitahukan kepada kami tentang beritamu yang sebenarnya. Dan Allah akan melihat pekerjaanmu yang akan datang seperti dia melihat pekerjaanmu yang sudah lewat, demikian pula rasul-Nya juga akan melihat pekerjaan kamu. Kemudian kamu dikembalikan kepada Allah yang maha mengetahui segala yang gaib dan yang nyata, lalu dia memberitakan kepadamu apa yang telah kamu kerjakan selama hidup di dunia. Untuk memperkuat dalih yang mereka kemukakan, mereka akan bersumpah kepadamu dengan nama Allah, ketika kamu kembali kepada mereka dari perang tabuk, agar kamu berpaling dari mereka, dengan memaafkan dan tidak mengecam serta tidak memberi hukuman kepada mereka. Dalih dan sumpah mereka itu adalah tipu daya dan kebohongan, maka berpalinglah dari mereka; karena sesungguhnya mereka itu berjiwa kotor lantaran kemunafikan mereka dan tempat mereka di akhirat nanti adalah neraka jahanam, sebagai balasan atas dosa dari apa yang telah mereka kerjakan, yakni kebohongan dan sumpah palsu dengan menggunakan nama Allah."
  }
]