[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik akan bersumpah kepada kalian dengan nama Allah –dengan dusta dan mencari cari alasan-, apabila kalian kembali kepada mereka dari peperangan, agar kalian membiarkan mereka tanpa intenvigasi. Maka jauhilah mereka dan berpalinglah dari mereka sebagai bentuk penghinaan bagi mereka; sebab sesungguhnya mereka adalah manusia-manusia yang berbatin kotor, dan tempat mereka yang akan mereka tinggali di akhirat kelak adalah Neraka Jahanam, sebagai balasan atas apa yang mereka usahakan berupa dosa-dosa dan pelangaran-pelangaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Orang-orang yang tidak pergi ke medan jihad itu akan bersumpah demi Allah ketika kalian -wahai orang-orang mukmin- kembali dari medan jihad. Hal itu mereka lakukan untuk memperkuat alasan-alasan palsu mereka untuk menghindari celaan dan kecaman kalian. Maka tinggalkanlah mereka dan jauhilah mereka dengan tegas. Karena mereka adalah orang-orang yang najis dan buruk hatinya. Dan tempat tinggal yang akan mereka tempati ialah Neraka Jahanam. Itulah balasan atas kemunafikan dan dosa-dosa yang telah mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Dalam ayat ini Allah memperingatkan dari tidak mengikuti jihad tanpa ada alasan yang diterima syariat: Mereka akan bersumpah kepada kalian dengan nama Allah, sebagai penguat alasan yang mereka buat ketika kalian kembali kepada mereka. Hal ini agar kalian memaafkan mereka dan tidak mengolok mereka. Namun tinggalkanlah mereka karena mereka memiliki perkataan dan perbuatan yang buruk. Tempat kembali mereka adalah neraka sebagai balasan atas kejahatan dan dosa-dosa besar yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. سَيَحْلِفُونَ بِاللهِ لَكُمْ إِذَا انقَلَبْتُمْ إِلَيْهِمْ (Kelak mereka akan bersumpah kepadamu dengan nama Allah, apabila kamu kembali kepada mereka) Yakni mereka akan menekankan alasan dusta yang mereka kemukakan agar orang-orang beriman berpaling dari mereka dan tidak menjelek-jelekkan mereka, serta tidak menghukum mereka atas ketidak ikutsertaan dalam perang dan agar orang-orang beriman menunjukkan keridhaan terhadap mereka. فَأَعْرِضُوا۟ عَنْهُمْ ۖ (Maka berpalinglah dari mereka) Yang dimaksud adalah meninggalkan dan menghentikan interaksi dengan mereka, dan bukan berarti meridhai mereka dan memaafkan kesalahan mereka. إِنَّهُمْ رِجْسٌ ۖ( mereka itu adalah najis) Yakni seluruh amal perbuatan mereka itu najis dan buruk. Karena mereka berlaku seperti itu maka mereka tidak layak untuk menerima petunjuk kepada kebaikan dan peringatan dari keburukan. Sehingga mereka layak untuk dipalingkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Mereka kelak akan bersumpah kepadamu dengan nama Allah untuk menegaskan uzur mereka yang palsu ketika kalian kembali kepada mereka dari perang Tabuk supaya kalian membiarkan dan memaafkan mereka, tidak menjelekkan mereka dan menampakkan keridhaan kalian kepada mereka. Maka abaikanlah dan tinggalkanlah mereka dengan baik, dan janganlah duduk-duduk dengan mereka, sesungguhnya mereka itu orang-orang kotor dan busuk. Pekerjaan mereka itu kotor lagi buruk, dan tempat kembali dan peristirahatan mereka adalah neraka sebagai balasan atas apa yang ditawarkan mereka berupa dosa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka akan bersumpah dengan (nama) Allah kepada kalian ketika kalian kembali} kalian kembali {kepada mereka agar kalian berpaling dari mereka} agar kalian tidak menegur dan menyalahkan mereka {Maka berpalinglah dari mereka} maka janganlah berbicara dan berkumpul dengan mereka {Sesungguhnya mereka kotor} kotoran yang mengotori bathin {dan tempat mereka} tempat kembali dan tempat peristirahatan mereka {adalah neraka Jahanam sebagai balasan atas apa yang selama ini mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Ketahuilah, bahwa orang yang berbuat salah dan dosa mempunyai tiga kemungkinan: Bisa jadi ucapan dan alasannya diterima secara lahir dan batin, lantas dia dimaafkan di mana seolah-olah dia tidak berdosa (keadaan inilah yang disebutkan di sini terkait dengan orang-orang munafik bahwa alasan mereka tidak diterima dan bahwa telah terbukti keadaan mereka yang busuk dan perbuatan mereka yang buruk). Bisa jadi mereka diberi hukuman dan ta’zir secara fisik atas dosa mereka. Bisa pula mereka tidak dihiraukan dan tidak diberi hukuman atas perbuatan mereka secara fisik. Kemungkinan yang ketiga inilah yang diperintahkan oleh Allah dalam menyikapi terhadap orang-orang munafik, oleh karena itu Dia berfirman, “Kelak mereka akan bersumpah kepadamu dengan nama Allah, apabila kamu kembali kepada mereka, supaya kamu berpaling dari mereka. Maka berpalinglah dari mereka.” Jangan salahkan mereka, jangan dicambuk dan jangan dibunuh. “Karena sesungguhnya mereka itu adalah najis.” Mereka itu adalah kotoran dan sampah, tidak layak untuk diperhatikan, nasihat dan hukuman tidak berguna bagi mereka. “Dan”, cukuplah sebagai hukuman “tempat mereka Jahanam, sebagai balasan atas apa yang telah mereka kerjakan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 95: Ibnu Jarir meriwayatkan, bahwa Abdullah bin Ka’ab berkata: Aku mendengar Ka’ab bin Malik berkata, “Ketika Rasulullah shallallahu 'alaihi wa sallam pulang dari Tabuk, Beliau duduk menghadap orang-orang. Ketika Beliau sedang berbuat begitu, tiba-tiba orang-orang yang tidak ikut berperang datang dan mengemukakan uzur sambil bersumpah. Jumlah mereka ada delapan puluh orang lebih, maka Rasulullah shallallahu 'alaihi wa sallam menerima lahiriah mereka, membai’at mereka dan memintakan ampunan untuk mereka, serta menyerahkan batin mereka kepada Allah, sedangkan aku berkata jujur.” Ka’ab melanjutkan kata-katanya, “Demi Allah, tidak ada nikmat yang Allah berikan kepadaku yang paling besar bagiku setelah ditunjukkan-Nya ke dalam Islam daripada kejujuranku, sehingga aku tidak berkata dusta yang membuatku binasa sebagaimana mereka yang berdusta binasa. Sesungguhnya Allah berfirman kepada mereka yang berdusta ketika Dia menurunkan wahyu dengan firman-Nya yang lebih keras dari apa yang difirmankan-Nya kepada seseorang, “Sayahlifuuna billahi lakum idzanqalabtum ilaihim…dst. Sampai Fa innallaha laa yardhaa ‘anil qaumil faasiqiin.” (At Taubah: 95-96). (Hadits ini para perawinya adalah para perawi kitab shahih). Dari beberapa ayat di atas dapat diketahui, bahwa pelaku dosa tersebut (yakni mereka yang tidak berperang) disikapi dengan beberapa sikap; ada yang diterima kata-kata dan uzurnya, ada yang diberi hukuman dan ta’zir (sanksi menurut ijtihad hakim) terhadap dosa mereka, dan ada pula yang ditinggalkan (yakni tidak dipedulikan) dan tidak usah dihukum karena najis (kotor)nya batin dan amal mereka sebagaimana yang disebutkan dalam ayat di atas, dan inilah yang paling buruk, wal ‘iyaadz billah. Yakni dari Tabuk, bahwa mereka tidak ikut karena beruzur. Yakni tidak mencela mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 95",
    "description": "Untuk memperkuat dalih yang mereka kemukakan, mereka akan bersumpah kepadamu dengan nama Allah, ketika kamu kembali kepada mereka dari perang tabuk, agar kamu berpaling dari mereka, dengan memaafkan dan tidak mengecam serta tidak memberi hukuman kepada mereka. Dalih dan sumpah mereka itu adalah tipu daya dan kebohongan, maka berpalinglah dari mereka; karena sesungguhnya mereka itu berjiwa kotor lantaran kemunafikan mereka dan tempat mereka di akhirat nanti adalah neraka jahanam, sebagai balasan atas dosa dari apa yang telah mereka kerjakan, yakni kebohongan dan sumpah palsu dengan menggunakan nama Allah. Lalu setelah itu mereka akan bersumpah kembali kepadamu agar kamu bersedia menerima mereka bergabung kembali dan mendapat tempat di hatimu. Tetapi sekalipun kamu menerima mereka, sungguh Allah tidak akan rida dan murka kepada mereka, karena mereka adalah orang-orang fasik dan Allah tidak rida kepada orang-orang yang fasik, yakni mereka yang bergelimang dosa."
  }
]