[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik akan bersumoah dengan dusta di hadapan kalian (wahai kaum mukminin) agar kalian menerima mereka, dan jika kalian menerima mereka (karena kalian tidak mengetahui kedustaan mereka), maka sesungguhnya Allah tidak meridhai mereka dan kaum selain mereka yang terus menerus diatas kefasikan dan keluar dari ketaatan kepadaNya dan dari ketaatan kepada Rasulnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Orang-orang yang tidak pergi ke medan jihad itu bersumpah di hadapan kalian -wahai orang-orang mukmin- supaya kalian rida kepada mereka dan mau menerima alasan mereka. Oleh karena itu janganlah kalian rida kepada mereka. Jika kalian rida kepada mereka, kalian telah menyelisihi Tuhan kalian. Sesungguhnya Dia tidak rida kepada orang-orang yang membangkang kepada-Nya dengan memilih menjadi kafir dan munafik. Maka jangan sekali-kali kalian -wahai orang-orang mukmin- rida kepada orang-orang yang tidak Allah ridai."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Hai orang-orang beriman, orang-orang munafik itu akan bersumpah kepada kalian dengan sumpah bohong demi mendapat kerelaan dan perasaan kalian, agar kalian tidak membeberkan aib mereka. Namun jika kalian menerima alasan mereka, maka sungguh Allah telah murka terhadap mereka, oleh sebab itu janganlah kalian ridha terhadap orang-orang yang menyelisihi hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. فَإِن تَرْضَوْا۟ عَنْهُمْ(Tetapi jika sekiranya kamu ridha kepada mereka) Sebagaimana yang mereka harapkan. فَإِنَّ اللهَ لَا يَرْضَىٰ عَنِ الْقَوْمِ الْفٰسِقِينَ(sesungguhnya Allah tidak ridha kepada orang-orang yang fasik itu) Yang dimaksud adalah larangan bagi orang-orang beriman untuk meridhai mereka, karena meridhai orang yang tidak diridhai Allah bukanlah perbuatan orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Wahai orang-orang mukmin, mereka itu bersumpah kepada kalian dengan iman yang palsu untuk meminta keridhaan kalian dan agar tetap bisa berinteraksi dengan kalian. Jika kalian meridhai dan memaafkan mereka maka sesungguhnya Allah itu marah terhadap kaum yang murtad dan tidak mau menaatiNya sehingga keridhaan kalian tidak berguna bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka akan bersumpah kepada kalian agar kalian ridha kepada mereka. Jika kamu ridha kepada mereka, sesungguhnya Allah tidak akan ridha kepada kaum yang fasik} orang-orang yang tidak taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. FirmanNya, “Mereka akan bersumpah kepadamu, agar kamu ridha kepada mereka.” Yakni mereka juga mempunyai maksud yang lain darimu di samping agar kamu meridhai mereka seolah-olah mereka itu tidak melakukan dosa apa-apa. “Tetapi jika sekiranya kamu ridha kepada mereka, maka sesungguhnya Allah tidak ridha kepada orang-orang yang fasik itu.” Yakni, maka tidak sepantasnya bagimu hai orang-orang yang beriman meridhai orang yang tidak diridhai Allah, bahkan kamu harus mengikuti Rabbmu dalam sikap ridha dan marah. Perhatikanlah bagaimana Allah berfirman, “Maka sesungguhnya Allah tidak ridha kepada orang-orang yang fasik itu.” Dan tidak berkata, “Maka sesungguhnya Allah tidak meridhai mereka.” Ini untuk menunjukkan bahwa pintu taubat masih tetap terbuka, selama mereka atau siapa pun bertaubat, maka Allah akan mengampuni dan meridhai mereka. Akan tetapi selama mereka itu tetap fasik, selama itu Allah tidak meridhai mereka karena adanya penghalang bagi ridhaNya, yaitu menyimpangnya mereka dari iman dan ketaatan yang diridhai Allah kepada syirik, nifak, dan maksiat yang dibenci Allah. Alhasil dari apa yang disebutkan oleh Allah adalah bahwa orang-orang munafik yang tidak berangkat berjihad tanpa alasan, jika mereka meminta maaf kepada orang-orang Mukmin dan mereka mengakui mempunyai alasan dalam ketidak berangkatannya, maksud orang-orang munafik adalah agar kamu berpaling dari mereka (yakni, membiarkan mereka) dan meridhai serta menerima alasan mereka. Adapun memaklumi dan meridhai mereka, maka janganlah dilakukan, karena mereka tidak memiliki kecintaan dan kehormatan. Adapun berpaling dari mereka, maka orang-orang yang beriman berpaling dari mereka seperti orang-orang Mukmin berpaling dari perkara-perkara buruk dan kotor. Ayat-ayat ini mengandung penetapan sifat Kalam bagi Allah pada FirmanNya, \"(karena) sesungguhnya Allah telah memberitahukan kepada kami beritamu yang sebenarnya\" (At-Taubah:94). Ayat-ayat ini juga mengandung penetapan perbuatan ikhtiari bagi Allah yang terlaksana dengan kodrat dan kehendakNya, sebagaimana terkandung dalam Firman Allah di atas dan dalam FirmanNya, \"Dan Allah serta Rasul-Nya akan melihat pekerjaanmu\" (At-Taubah:94) Allah memberitahukan bahwa Allah dan RasulNya akan melihatnya setelah ia terjadi. Dan di dalam ayat ini juga terdapat penetapan sifat ridha bagi Allah kepada orang-orang yang baik dan sifat marah serta murkaNya kepada orang-orang fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 96: Ridhamu terhadap mereka tidaklah bermanfaat jika Allah murka, dan lagi tidak sepatutnya seorang mukmin ridha kepada orang yang tidak diridhai Alah, bahkan seharusnya ridha mereka mengikuti keridhaan Allah sebagaimana kebencian mereka mengikuti kebencian-Nya. Ayat ini juga menunjukkan bahwa kalau pun uzur mereka diterima dan mereka diridhai oleh kaum mukmin, maka bukan berarti mereka dicintai dan bukan sebagai kemuliaan bagi mereka. Perhatikan kata-kata “Fa innallaha laa yardhaa ‘anil qaumil faasiqiin” (artinya: sesungguhnya Alah tidak ridha kepada orang-orang yang fasik), Allah tidak mengatakan, “Fa innallaha laa yardhaa ‘anhum” (artinya: Allah tidak ridha kepada mereka) untuk menunjukkan bahwa pintu tobat terbuka, dan bahwa jika mereka bertobat, maka Allah akan menerima tobat dan meridhai mereka. Tetapi jika mereka tetap berbuat fasik, yakni keluar dari ketaatan, maka Allah tidak ridha kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 96",
    "description": "Lalu setelah itu mereka akan bersumpah kembali kepadamu agar kamu bersedia menerima mereka bergabung kembali dan mendapat tempat di hatimu. Tetapi sekalipun kamu menerima mereka, sungguh Allah tidak akan rida dan murka kepada mereka, karena mereka adalah orang-orang fasik dan Allah tidak rida kepada orang-orang yang fasik, yakni mereka yang bergelimang dosa. Pada ayat sebelumnya dijelaskan tentang kebohongan dan sumpah palsunya orang-orang munafik, lalu dijelaskan tentang orang arab badui dan keimanan mereka. Orang-orang arab badui itu hidup dalam suasana kekerasan alam, tinggal di daerah yang jauh dari perkotaan, jauh dari nabi Muhammad sumber informasi ajaran agama dan, lebih kuat kekafiran dan kemunafikannya, dan sangat wajar tidak mengetahui hukumhukum yang diturunkan Allah kepada rasul-Nya, karena kurangnya informasi ajaran-ajaran agama. Allah maha mengetahui keadaan mereka dan mahabijaksana dalam memberikan ketetapan hukum kepada mereka."
  }
]