[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Arab Badui, yaitu para penduduk pendalaman, lebih keras kekafiran dan kemunafikannya daripada para penghuni perkotaan. Demikian itu dikarenkan kekerasan perilaku dan kerasnya hati mereka dan jauhnya mereka dari ilmu dan ulama serta majelis nasihat dan tempat-tempat berdzikir. Karena latar belakang tersebut, mereka lebih besar kemungkinan tidak mengetahui rambu-rambu agama dan apa yang Allah turunkan berupa ajaran-ajaran syariat dan hukum-hukum. Dan Allah Maha Mengetahui keadaan mereka semua, Mahabijaksana dalam pengaturaNya terhadap urusan-urusan hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Jikalau orang-orang badui memilih menjadi kafir atau munafik tentu kekafiran dan kemunafikan mereka lebih parah daripada orang-orang yang tinggal di perkotaan, karena orang-orang badui tersebut kemungkinan besar tidak paham perihal ilmu agama, dan lebih berpotensi untuk tidak mengetahui kewajiban-kewajiban, sunnah-sunnah, dan ketentuan-ketentuan hukum yang Allah turunkan kepada rasul-Nya. Hal itu karena mereka memiliki watak yang keras, kasar, dan kurang bergaul. Allah Maha Mengetahui hal ihwal mereka, tidak ada sesuatu pun yang luput dari pengetahuan-Nya, lagi Dia Maha Bijaksana dalam mengatur makhluk-Nya dan menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Sebagian penduduk baduwi lebih besar kekafirannya daripada penduduk kota, sebab tempat mereka jauh dari ilmu dan para ulama; dan mereka pantas jika tidak mengetahui hukum-hukum dan syariat yang Allah turunkan kepada Nabi Muhammad. Allah Maha Mengetahui keadaan hamba-hamba-Nya dan Maha Bijaksana dalam mengatur urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. الْأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا (Orang-orang Arab Badwi itu, lebih sangat kekafiran dan kemunafikannya) Yakni kekafiran dan kemunafikan mereka lebih besar dari selain mereka, karena mereka memiliki hati yang sangat keras, tabiat yang sangat buruk, ucapan yang sangat bengis, dan lebih jarang mendengar ayat-ayat kitab Allah dan apa yang dibawa oleh para rasul. Orang Arab badui adalah orang yang tinggal di pedalaman arab. Orang yang tinggal di perkampungan disebut orang arab, sedangkan yang tinggal di pedalaman disebut orang arab badui. وَأَجْدَرُ أَلَّا يَعْلَمُوا۟ حُدُودَ مَآ أَنزَلَ اللهُ(dan lebih wajar tidak mengetahui hukum-hukum yang diturunkan Allah kepada Rasul-Nya) Berupa syariat-syariat dan hukum-hukum, karena mereka tinggal di tempat yang jauh dari tempat-tempat para nabi dan turunnya wahyu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Penduduk padang pasir atau orang Baduwi itu lebih dahsyat kekufuran dan kemunafikannya daripada orang lain, karena kekerasan hati, kekolotan, ketidaktahuan dan terasingnya mereka dari pengetahuan dan kota. Barangsiapa menjadikan negeri Arab sebegai tempat tinggal maka dia adalah orang Arab, dan orang yang tinggal di padang pasir maka mereka adalah orang Baduwi. Mereka itu lebih pantas untuk tidak mengetahui batas-batas yang ditentukan Allah berupa syariat dan hukum karena keterasingan mereka dari pengetahuan dan tempat para nabi. Dan Allah Maha Mengetahui keadaan mereka, lagi Maha bijaksana dalam mengatur urusan-urusan makhlukNya. Ayat ini turun terkait orang-orang Baduwi, yaitu Bani Asad dan bani Ghatfan dan terkait orang-orang Baduwi yang datang ke Madinah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang Arab} Badui {lebih kuat kekufuran dan kemunafikannya, serta sangat wajar} lebih pantas dan lebih sesuai {tidak} tidak {mengetahui batas-batas yang diturunkan Allah kepada RasulNya. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Allah berfirman, “orang-orang Arab Badui itu”, yaitu mereka yang tinggal di pelosok dan pedalaman “lebih sangat kekafiran dan kemunafikannya”, daripada orang kota meskipun mereka juga ada yang kafir dan munafik, hal itu karena beberapa sebab, di antaranya adalah jauhnya mereka dari pengetahuan tentang syariat-syariat agama, amal perbuatan dan hukum-hukum, maka mereka lebih layak, “dan lebih wajar tidak mengetahui hukum-hukum yang diturunkan Allah kepada RasulNya,” berupa dasar-dasar iman dan hukum-hukum perintah dan larangan. Lain halnya dengan orang-orang yang tinggal di kota, mereka lebih mungkin mengetahui hukum-hukum yang diturunkan Allah kepada RasulNya. Dengan ilmu ini, muncul pada mereka gambaran-gambaran yang baik dan keinginan kepada kebaikan yang mereka ketahui hal mana itu tidak ada di pedalaman. Pada orang-orang kota juga terdaapat tabiat yang lembut dan ketundukan kepada penyeru yang mana hal itu tidak terdapat pada orang-orang pedalaman. Orang kota juga bergaul dengan ahli iman dan berinteraksi lebih banyak daripada orang yang tinggal di pedalaman. Oleh karenanya orang-orang kota lebih layak mengetahui kebaikan daripada orang-orang di pedalaman, meski di kota dan di desa tetap ada orang-orang munafik dan kafir, hanya saja yang di pedalaman lebih keras dan lebih sangat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 97: Orang-orang Badui adalah orang-orang Arab yang berdiam di padang pasir yang hidupnya selalu berpindah-pindah. Daripada penduduk kota atau kampung karena sifat kasar mereka, dan tabi’at mereka yang keras serta jauhnya mereka dari mendengarkan Al Qur’an; dari mengetahui syari’at maupun hukum-hukum Islam. Berbeda dengan penduduk kota atau kampung, di mana mereka dekat dengan ilmu agama, oleh karenanya mereka memiliki bayangan mana yang baik dan ada keinginan mengerjakan kebaikan karena banyak mengetahui jalan-jalan kebaikan, tabi’at mereka lembut, dsb. Meskipun demikian, di daerah kota dan badui ada saja orang-orang kafir dan munafik. Berupa hukum-hukum dan syari’at."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 97",
    "description": "Pada ayat sebelumnya dijelaskan tentang kebohongan dan sumpah palsunya orang-orang munafik, lalu dijelaskan tentang orang arab badui dan keimanan mereka. Orang-orang arab badui itu hidup dalam suasana kekerasan alam, tinggal di daerah yang jauh dari perkotaan, jauh dari nabi Muhammad sumber informasi ajaran agama dan, lebih kuat kekafiran dan kemunafikannya, dan sangat wajar tidak mengetahui hukumhukum yang diturunkan Allah kepada rasul-Nya, karena kurangnya informasi ajaran-ajaran agama. Allah maha mengetahui keadaan mereka dan mahabijaksana dalam memberikan ketetapan hukum kepada mereka. Dan di antara orang-orang arab badui itu ada yang memandang apa yang diinfakkannya di jalan Allah sebagai suatu kerugian karena mereka tidak percaya adanya pahala atas amal saleh, sehingga mereka beranggapan bahwa harta yang diinfakkan akan lenyap begitu saja. Dia menantinanti marabahaya menimpamu, yakni nabi Muhammad dan umat islam, karena keengganan mereka membayar zakat dan karena kebencian mereka kepadamu. Padahal merekalah yang akan ditimpa marabahaya, dengan semakin tersebarnya ajaran agama islam dan mereka akan mendapat siksa di akhirat. Allah maha mendengar perkataan mereka, maha mengetahui perbuatan mereka."
  }
]