[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara orang-orang Badui itu ada yang mengira bahwa apa yang di keluarkan di jalan Allah sebagai bentuk jeratan dan kerugian yang tidak mendatangkan pahala baginya dan tidak menolak siksaan dari diriNya, dan diapun menunggu-nunggu kejadian-kejadian buruk dan bencan-bencana menimpa kalian. Akan tetapi, keburukan berputar atas mereka, bukan pada kaum muslimin. Dan Allah Maha Mendengar apa yang mereka katakan , juga MahaMengatahui niat-niat buruk mereka"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Sebagian dari orang-orang badui yang munafik itu beranggapan bahwa harta yang mereka infakkan di jalan Allah adalah kerugian dan beban yang memberatkan, karena ia beranggapan bahwa Allah tidak akan memberinya balasan apabila ia menginfakkan hartanya dan tidak akan memberinya hukuman apabila ia enggan menginfakkan hartanya di jalan Allah. Meskipun demikian ia terkadang berinfak dengan tujuan ria dan berpura-pura. Ia selalu menunggu-nunggu waktu dimana kalian -wahai orang-orang mukmin- ditimpa bencana supaya ia bisa melepaskan diri dari kalian. Akan tetapi Allah justru membuat musibah serta perputaran masa yang akhirnya tidak terpuji yang mereka harapkan menimpa orang-orang mukmin itu menimpa mereka sendiri, bukan menimpa orang-orang mukmin. Allah Maha Mendengar apa yang mereka ucapkan dan Maha Mengetahui apa yang mereka sembunyikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Sebagian orang baduwi menganggap berinfak di jalan Allah merupakan suatu kerugian. Dan mereka senantiasa menunggu turunnya musibah kepada kalian; namun Allah mengembalikan harapan mereka itu kepada mereka sendiri. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala perbuatan dan niat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. وَمِنَ الْأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًا (Di antara orang-orang Arab Badwi itu ada orang yang memandang apa yang dinafkahkannya (di jalan Allah), sebagi suatu kerugian) Yakni ia menyangka bahwa harta yang ia infakkan di jalan Allah adalah sebuah kerugian namun tetap mengeluarkan infak untuk riya’ dan taqiyah (menyembunyikan jati dirinya). وَيَتَرَبَّصُ بِكُمُ الدَّوَآئِرَ (dan dia menanti-nanti marabahaya menimpamu) Yakni menanti perputaran keadaan dari kenikmatan menjadi musibah. عَلَيْهِمْ دَآئِرَةُ السَّوْءِ ۗ( merekalah yang akan ditimpa marabahaya) Allah menjadikan balasan bagi mereka seperti apa yang mereka inginkan bagi kaum muslimin, merekalah yang ditimpa kekalahan dan keburukan, azab dan musibah, dan hal-hal yang tak diinginkan. وَاللهُ سَمِيعٌ (Dan Allah Maha Mendengar) Mendengar apa yang mereka katakan. عَلِيمٌ (lagi Maha Mengetahui) Mengetahui apa yang mereka sembunyikan dalam hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Sebagian orang Baduwi yang menganggap bahwa nafkahnya di jalan Allah itu merupakan sebuah hukuman dan kerugian itu karena tidak berpedoman pada pahala yang diterimanya, melainkan mendapatkan dorongan untuk pamer dan menunjukkan kekuatan. Dia menunggu waktu dimana musibah akan melingkupi kalian, sehingga dia terlepas dari infaq. Tapi dialah yang akan menerima waktu musibahnya berupa kekalahan, bencana dan hal yang buruk. Itu adalah doa yang serupa dengan apa yang dia tunggu-tunggu dari orang-orang muslim. Allah itu maha Mendengar ucapan mereka lagi Maha mengetahui perbuatan dan niat-niat buruk mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara orang-orang Arab Badui ada yang menganggap apa yang diinfakkannya sebagai suatu kerugian} kerugian {dan menunggu} menunggu {kalian mendapat giliran} perubahan waktu yang disertai bencana {Merekalah yang pasti akan ditimpa giliran buruk} musibah yang selalu berputar dan menyakiti mereka {Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Di antara sebab yang lain juga adalah bahwa orang-orang Arab Badui lebih kikir dan lebih berambisi dalam urusan harta, di antara mereka terdapat “orang yang memandang apa yang di nafkahkannya (di jalan Allah)”, berupa zakat, nafkah di jalan Allah, dan lain-lain “sebagai suatu kerugian.” Yakni dia memandangnya sebagai kerugian dan kekurangan, tidak berharap pahala dari Allah, tidak berharap dengannya Wajah Allah, dan hampir tidak dilaksanakan kecuali dengan terpaksa. “Dan dia menanti-nanti marabahaya menimpamu.” Yakni di antara bukti permusuhan dan kebencian mereka kepada orang-orang yang beriman adalah bahwa mereka menginginkan dan menanti-nantikan musibah dan marabahaya yang ditimpakan kepada orang-orang Mukmin. Justru yang terjadi sebaliknya. “Merekalah yang akan ditimpa marabahaya.” Adapun orang-orang Mukmin, maka mereka akan meraih hasil baik atas musuhnya dan akibat yang menggembirakan. “Dan Allah Maha Mendengar lagi Maha Mengetahui.” Mengetahui niat manusia dan amal yang dilakukannya, apakah ia ikhlas atau tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 98: Karena mereka tidak mencari keridhaan Allah dan mengharapkan pahalanya, bahkan mengeluarkannya karena terpaksa. Seperti yang dilakukan Bani Asad dan Ghatfan. Karena bencinya mereka kepada kaum mukmin. Dia mengetahui niat semua hamba dan amalan yang muncul darinya berupa keikhlasan atau selainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 98",
    "description": "Dan di antara orang-orang arab badui itu ada yang memandang apa yang diinfakkannya di jalan Allah sebagai suatu kerugian karena mereka tidak percaya adanya pahala atas amal saleh, sehingga mereka beranggapan bahwa harta yang diinfakkan akan lenyap begitu saja. Dia menantinanti marabahaya menimpamu, yakni nabi Muhammad dan umat islam, karena keengganan mereka membayar zakat dan karena kebencian mereka kepadamu. Padahal merekalah yang akan ditimpa marabahaya, dengan semakin tersebarnya ajaran agama islam dan mereka akan mendapat siksa di akhirat. Allah maha mendengar perkataan mereka, maha mengetahui perbuatan mereka. Dan di antara orang-orang arab badui itu ada yang beriman kepada Allah dan hari kemudian dengan selalu berusaha memelihara keimananan itu, dan memandang apa yang diinfakkannya di jalan Allah sebagai jalan mendekatkan diri kepada Allah dan sebagai jalan untuk memperoleh doa rasul, karena rasul selalu mendoakan orang yang menyalurkan zakat dan infak. Ketahuilah, sesungguhnya infak itu suatu jalan bagi mereka untuk mendekatkan diri kepada Allah. Kelak Allah akan memasukkan mereka ke dalam rahmat, yakni surga-Nya, lantaran keikhlasan mereka dalam berinfak; sesungguhnya Allah maha pengampun dosa orang-orang yang bertobat dengan sungguh-sungguh, maha penyayang, karena selalu memberi rahmat kepada orang yang bertobat."
  }
]