[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara orang-orang Badui, ada yang beriman kepada Allah dan mengakui kesaanNya dan Hari kebangkitan setelah kematian, juga pahala dan siksaan serta dia mengharap pahala dari apa yang mereka infakan berupa harta benda dan memerangi kaum musyrikin, dengan mengharap ridha Allah dan cintaNya dengan itu, dan menjadikanya sebagai sarana untuk mengharp doa kebaikan dari Rasul baginya. Ketahuilah, sesungguhnya amal-amal ini akan mendekatkan diri mereka kepada Allah Allah akan memasukan mereka ke syurgaNya. Sesungguhnya Dia Maha pengampun terhadap dosa-dosa yang mereka perbuat, jugaMaha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Ada di antara kalangan badui tersebut, orang yang beriman kepada Allah, beriman kepada hari Kiamat, dan menjadikan harta yang ia infakkan di jalan Allah sebagai ketaatan untuk mendekatkan dirinya kepada Allah dan sebagai sarana untuk mendapatkan doa dan istigfar dari Rasulullah -ṣallallāhu 'alaihi wa sallam-. Ketahuilah bahwa apa yang ia infakkan di jalan Allah dan doa Rasulullah untuknya adalah sarana untuk mendekatkan dirinya kepada Allah. Dia kelak akan mendapatkan balasannya di sisi Allah, yaitu akan memasukkannya ke dalam rahmat-Nya yang luas yang meliputi ampunan-Nya dan Surga-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Dan sebagian orang baduwi beriman kepada Allah dan kepada hari kebangkitan, dan menganggap infak di jalan Allah adalah suatu ketaatan dan untuk mendapat keridhaan Allah serta menjadi sebab doa Rasulullah bagi mereka. Ketahuilah bahwa infak mereka dan doa Rasulullah bagi mereka dapat mendekatkan mereka kepada Allah. Allah berjanji akan memasukkan mereka ke dalam rahmat-Nya yang luas dan surga-Nya yang mulia. Dia Maha Pengampun dan Pengasih bagi orang yang bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَمِنَ الْأَعْرَابِ مَن يُؤْمِنُ بِاللهِ وَالْيَوْمِ الْاٰخِرِ (Di antara orang-orang Arab Badwi itu ada orang yang beriman kepada Allah dan hari kemudian) Ini merupakan golongan kedua dari orang-orang badui. Yaitu yang mempercayai Allah dan hari akhir. وَيَتَّخِذُ مَا يُنفِقُ(dan memandang apa yang dinafkahkannya (di jalan Allah) itu) Yakni menjadikan apa yang mereka infakkan di jalan Allah. قُرُبٰتٍ(sebagai jalan untuk mendekatkannya kepada Allah) Makna (القربات) yakni apa yang dapat mendekatkan diri kepada Allah. وَصَلَوٰتِ الرَّسُولِ ۚ( dan sebagai jalan untuk memperoleh doa Rasul) Yakni menjadikan doa dan permohonan ampun dari Rasulullah kepada Allah bagi mereka adalah sesuatu yang dapat mendekatkan mereka kepada Allah karena besarnya keimanan mereka kepada Allah dan Rasul-Nya. أَلَآ إِنَّهَا قُرْبَةٌ لَّهُمْ ۚ( Ketahuilah, sesungguhnya nafkah itu adalah suatu jalan bagi mereka untuk mendekatkan diri) Yakni harta yang mereka infakkan dan doa dari Rasulullah untuk mereka merupakan pendekatan diri yang diterima Allah. سَيُدْخِلُهُمُ اللهُ فِى رَحْمَتِهِۦٓ ۗ( Kelak Allah akan memasukan mereka kedalam rahmatNya) Yakni berupa kasih sayang dengan orang-orang beriman dan kebaikan yang mereka dapatkan di dunia serta masuknya mereka ke dalam surga di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Dan ada jenis kedua dari orang Baduwi seperti kabilah Juhainah dan Muzainah. Mereka beriman kepada Allah dan akhirat. Mereka menjadikan infak mereka di jalan Allah sebagai wasilah untuk mendekatkan diri kepada Allah SWT dan agar dimintakan ampun dan didoakan kebaikan oleh rasulullah. Ingatlah sesungguhnya nafkah dan permohonan doa mereka kepada rasul sebagai jalan mendekat (kepada Allah) itu diterima di sisi Allah SWT. Allah akan memasukkan mereka ke dalam surgaNya yang luas. Sesungghnya Allah itu Maha Pengampun lagi Maha Penyayang bagi orang-orang yang taat. Ayat ini turun terkait Bani Muqarrin yang mana diturunkan ayat tentang mereka yaitu ayat {Wa laa ‘alalladziina Idza maa atauka litahmilahum} [At-Taubah ayat 92]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara orang-orang Arab Badui ada yang beriman kepada Allah dan hari akhir. Dia memandang apa yang diinfakkannya untuk mendekatkan diri kepada Allah} sebagai sebab utnuk mendekatkan diri kepada Allah SWT {dan doa-doa Rasul} sebab agar didoakan dan dimintakan ampunan Rasulullah {Ketahuilah sesungguhnya hal itu bagi mereka untuk mendekatkan diri. Allah akan memasukkan mereka ke dalam rahmatNya} surgaNya {Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Namun tidak semua orang-orang Arab Badui itu tercela, di antara mereka “ada orang yang beriman kepada Allah dan Hari Kemudian.” Maka dia selamat dari kekufuran dan kemunafikan dan melakukan tuntutan iman. “Dan memandang apa yang dinafkahkannya (di jalan Allah) itu, sebagai jalan mendekatkannya kepada Allah.” Yakni, dia berharap pahala dari Allah dengan infaknya dan mencari Wajah Allah serta kedekatan kepadaNya. “Dan” menjadikannya sebagai jalan untuk memperoleh doa “Rasul.” Dan permohonan keberkahan (kepada Allah) untuk mereka. Allah berfirman menjelaskan manfaat doa Rasul. “Ketahuilah, sesungguhnya nafkah itu adalah suatu jalan bagi mereka untuk mendekatkan diri (kepada Allah).” Mendekatkan mereka kepada Allah, mengembangkan harta mereka dan memberkahinya. “Kelak Allah akan memasukkan mereka ke dalam rahmat (Surga) Nya”, dalam golongan hamba-hambaNya yang shalih. “Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Dia mengampuni dosa-dosa besar bagi yang bertaubat kepadaNya, menaungi hamba-hambaNya dengan rahmatNya yang meliputi segala sesuatu dan mengkhususkan hamba-hambaNya yang beriman dengan rahmatNya yang membimbing mereka kepada kebaikan, melindungi mereka dari penyimpangan, serta memberi mereka balasan yang besar. Ayat ini mengandung dalil bahwa orang-orang Arab Badui sama dengan orang-orang kota. Di antara mereka ada yang tercela dan ada yang terpuji. Allah tidak mencela mereka hanya karena mereka arab badui, akan tetapi karena meninggalkan perintah-perintah Allah dan mereka kemungkinan besar melakukan itu. Di antaranya: bahwa kekufuran dan kemunafikan dapat bertambah dan berkurang, menguat dan melemah, berdasarkan kondisi. Di antaranya: Keutamaan ilmu, dan bahwa orang yang tidak berilmu lebih dekat kepada keburukan daripada orang yang berilmu, karena Allah mencela orang-orang Arab Badui dan menyatakan bahwa mereka lebiih keras kekufuran dan kemunafikannya serta menjelaskan penyebabnya dan bahwa mereka layak untuk tidak mengetahui hukum-hukum yang Allah turunkan kepada Rasul Nya. Di antaranya: Bahwa ilmu bermanfat yang merupakan ilmu yang paling bermanfaat adalah mengetahui hukum-hukum yang diturunkan oleh Allah kepada RasulNya yang meliputi dasar-dasar dan cabang agama seperti mengetahui batasan-batasan Iman, Islam, Ihsan, takwa, keberuntungan, ketaatan, kebaikan, berbuat baik, silaturahim, kekufuran, kemunafikan, kefasikan, kemaksiatan, zina, khamar, riba dan lain-lain, karena dengan mengetahuinya ia bisa dilaksanakan jika ia diperintahkan dan dijauhi jika ia adalah larangan, serta memungkinkan pula untuk memerintahkannya atau melarangnya. Di antaranya juga: Hendaknya seorang hamba yang beriman melaksanakan hak-haknya dengan lapang dada, jiwa tentram, berusaha meraih untung dan tidak merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat At-Taubah ayat 99: Tidak semua orang-orang Arab badui tercela, bahkan di antara mereka ada yang mukmin, dirinya selamat dari kekafiran dan kemunafikan serta mengerjakan konsekwensi keimanan. Seperti suku Juhainah dan Muzainah. Sebagai jalan untuk mencari keridhaan-Nya dan sebagai jalan untuk mendekatkan diri kepada-Nya. Ayat ini menunjukkan bahwa Allah tidak mencela mereka karena tinggal mereka di daerah badui, akan tetapi Dia mencela mereka karena meninggalkan perintah Allah. dan bahwa mereka berada di tempat yang jauh dari ilmu sehingga berpeluang besar untuk terjatuh ke dalam maksiat. Ayat ini juga menunjukkan keutamaan ilmu agama, dan bahwa orang yang jauh dari ilmu lebih dekat kepada keburukan. Demikian juga menunjukkan bahwa ilmu yang paling bermanfaat adalah mengetahui hukum-hukum yang diturunkan Allah kepada Rasul-Nya, seperti dasar-dasar agama (Aqidah), dan furu’nya (fiqh), di mana dengan mengetahuinya seseorang dapat mengamalkannya. Demikian pula bahwa sepatutnya seorang mukmin melakukan kewajiban dengan dada yang lapang, jiwa yang tenang, dan tidak menganggapnya sebagai suatu kerugian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Taubah Ayat 99",
    "description": "Dan di antara orang-orang arab badui itu ada yang beriman kepada Allah dan hari kemudian dengan selalu berusaha memelihara keimananan itu, dan memandang apa yang diinfakkannya di jalan Allah sebagai jalan mendekatkan diri kepada Allah dan sebagai jalan untuk memperoleh doa rasul, karena rasul selalu mendoakan orang yang menyalurkan zakat dan infak. Ketahuilah, sesungguhnya infak itu suatu jalan bagi mereka untuk mendekatkan diri kepada Allah. Kelak Allah akan memasukkan mereka ke dalam rahmat, yakni surga-Nya, lantaran keikhlasan mereka dalam berinfak; sesungguhnya Allah maha pengampun dosa orang-orang yang bertobat dengan sungguh-sungguh, maha penyayang, karena selalu memberi rahmat kepada orang yang bertobat. Ayat sebelumnya menjelaskan bahwa orang arab badui ada yang imannya lemah dan ada yang kuat, lalu Allah menjelaskan sekelompok orang yang imannya sangat kuat. Mereka adalah orang-orang yang terdahulu berhasil meraih dan melaksanakan kebajikan sebelum yang lainnya melaksanakan, lagi yang pertama-tama masuk islam di antara orang-orang muhajirin dari mekah ke habasyah (ethiopia) dan ke madinah, dan kaum ansar, yakni penduduk madinah yang menerima dan membela umat islam, dan orang-orang yang mengikuti mereka dengan baik dengan iman dan amal saleh serta mau berkorban untuk membela Allah dan rasul-Nya. Allah rida kepada mereka, yakni menerima amal saleh mereka dan mereka pun rida kepada Allah atas anugerah iman yang memenuhi hati mereka. Anugerah yang lebih besar lagi adalah Allah menyediakan bagi mereka surga-surga yang mengalir di bawahnya sungaisungai. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung. (lihat: surah al-wa'qi'ah/56: 10-14)"
  }
]