[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan hari perhitungan amal dan pembalasan. Allah juga bersumpah dengan jiwa beriman yang bertakwa yang mengkritik pemiliknya saat meninggalkan ketaatan dan melakukan kemaksiatan, bahwa manusia akan dibangkitkan. Apakah manusia kafir itu menyangka Kami tidak kuasa mengumpulkan tulang belulangnya sesudah ia berserakan? Dugan itu salah besar, sebaliknya Kami akan mengumpulkannya, Kami Mahakuasa sesudah mengumpulkannya dan menyatukannya untuk membentuk dan menyusun kembali jari-jari dan ruas-ruasnya sebagaimana sebelum dia mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan hari Kiamat, hari di mana manusia berdiri menghadap Rabb alam semesta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah bersumpah dengan hari kiamat, yaitu hari kebangkitan dan pembalasan; dan bersumpah dengan jiwa orang beriman yang menyesali diri sendiri karena melalaikan banyak kesempatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. لَآ أُقْسِمُ بِيَوْمِ الْقِيٰمَةِ (Aku bersumpah demi hari kiamat) Kata (لا) adalah sebagai tambahan. Maknanya adalah Aku bersumpah dengan hari kiamat. Allah memakai sumpahnya dengan hari kiamat untuk mengagungkan hari itu, dan Allah berhak untuk bersumpah dengan makhluk-Nya yang manapun sesuai dengan kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Aku bersumpah demi hari kiamat. Huruf lam adalah tambahan, bermakna Allah bersumpah demi hari kiamat, sumpah ini bermaksud untuk mengagungkan hari kiamat. Bertujuan untuk menegaskan kebenaran hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bersumpah} Aku bersumpah, huruf \"Laa\" digunakan untuk menguatkan sumpah {demi hari Kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Kata ‘La’ disisni bukan ‘La’ nafiyah dan bukan pula tambahan. Kata ‘La’ disebut hanya sebagai pembukaan dan perhatian atas apa yang setelahnya. Karena kata ini sering digunakan untuk sumpah, bukan berarti asing bila digunakan sebagai kata pembuka, meski pada asalnya tidak dipakai untuk kata pembuka. Yang dijadikan sumpah dalam ayat ini adalah obyek sumpah, yaitu Hari Kebangkitan setelah kematian, yakni bangkitnya manusia dari kubur dan berdirinya mereka untuk menanti putusan Allah pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 1: 1-4. Allah mengawali surat ini dengan sumpah, Allah berkata : Aku bersumpah dengan hari kiamat, hari perhitungan dan balasan, dimana tidak ada keraguan dalam kejadaiannya. Allah bersumpah dengan jiwa manusia yang suci dan beriman, yang banyak berharap kepada-Ku, yang mencela dirinya sendiri atas kesalahan dan kekurangan dalam melaksanakan hak Allah. Sungguh kalian wahai jin dan manusia, akan dibangkitkan dan saling dihitung atas seluruh amalan-amalan kalian. Ketahuilah oleh kalian bahwa orang yang kafir ini menyangka bahwa Allah tidak kuasa mengumpulkan tulang-belulang setelah bercerai-berai yang kemudian dihidupkan kembali untuk kali yang lain; Maka ketahuilah bahwa Allah Maha Kuasa atas apa yang dianggap menakjubkan (oleh manusia) atas hal itu; Sungguh Allah kuasa mengembalikan jari-jemari dengan sendi-sendinya secara sempurna, dimana tidak ada yang menyamapai satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, kata ‘Laa’ di ayat tersebut bukanlah laa naafiyah (yang berarti ‘tidak’), bukan pula laa zaa’idah (sebagai tambahan), bahkan digunakan kata ‘Laa’ ini untuk memulai dan agar kalimat setelahnya diperhatikan. Oleh karena kata ‘Laa’ sering dipakai bersama sumpah, maka tidaklah dipandang aneh memulai dengannya meskipun pada asalnya tidak dipakai untuk memulai. Yang dipakai sumpah dalam ayat ini adalah perkara yang merupakan isi sumpah, yaitu hari Kiamat, hari dimana manusia dibangkitkan setelah matinya; bangun dari kuburnya dan berdiri menunggu keputusan Rabbul ‘aalamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 1",
    "description": "1-2. Akhir surah al-Muddasir menguraikan tentang kiamat serta betapa mengerikannya peristiwa itu, namun kaum pendurhaka mendustakannya. Segala argumen sudah dipaparkan, kalau mereka tetap tidak beriman, maka ayat ini menunjukkan Allah, tidak akan meladeni mereka lagi. Aku bersumpah dengan kepastian hari kiamat karena semuanya sudah jelas, dan aku juga bersumpah dengan jiwa yang selalu menyesali dirinya sendiri. Sungguh manusia pasti akan dibangkitkan"
  }
]