[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Hanya kepada Rabbmu -wahai Rasul- pada hari itu tempat kembali untuk perhitungan amal perbuatan dan pembalasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِلَىٰ رَبِّكَ يَوْمَئِذٍ الْمُسْتَقَرُّ (Hanya kepada Tuhanmu sajalah pada hari itu tempat kembali) Yakni tempat kembali dan tempat berakhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11-12. Tidak ada jalan! Untuk mencela mereka bahwa tidak ada jalan untuk melarikan diri. Tidak ada tempat untuk melarikan diri dari itu semua. Hanya Tuhanmu-lah tempat kembali pada hari itu, dan tempat berpulang yang abadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kepada Tuhanmulah pada hari itu temoat kembali} tempat kembali dan menetap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. “Sekali-kali tidak! Tidak ada tempat berlindung,” yakni tidak ada tempat untuk mendapatkan perlindungan untuk siapa pun kecuali kepada Allah. “Hanya kepada Rabbmu sajalah pada hari itu tempat kembali,” untuk seluruh manusia. Tidak mungkin bagi seorang pun untuk sembunyi atau lari dari tempat itu. Semua pasti akan berdiri di situ untuk mendapatkan balasan atas amal perbuatannya. Karena itu Allah berfirman, “Pada hari itu diberitakan kepada manusia apa yang telah dikerjakannya dan apa yang dilalaikannya,” yakni seluruh perbuatannya yang baik dan yang buruk dari pertama kali hingga terakhir kalinya. Manusia diberitakan sesuatu yang tidak bisa ia ingkari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 12: 11-13. Maka dikatakan pada orang kafir ini : Sekali-kali tidak; Tidaklah urusannya sebagaimana engkau angan-angankan, sungguh Allah tidak akan memberikan tempat perlindungan dan juga aman dari hari manusia dihisab dan dibalas di hadapan Rabb semesta alam. Kemudian kepada Allah saja lah tempat kembali seluruh makhluk dan mereka semua akan menetapi hari kiamat yang tidak ada tempat untuk meloloskan diri darinya. Kemudian dibalaslah sesuai dengan apa yang dikerjakan (di duna). Pada hari yang besar ini, manusia akan dikabarkan tentang apa yang telah lalu dari amalan-amalan mereka (baik dan buruknya), dari awalnya sampai akhirnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk dihisab dan diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 12",
    "description": "11-13. Pertanyaan manusia pada akhir ayat yang lalu, diberikan jawab-annya pada ayat-ayat ini. Sekali-kali tidak! tidak ada tempat berlindung kecuali pada Allah semata! hanya kepada tuhanmu sajalah yang selama ini berbuat baik kepadamu wahai manusia, tidak kepada siapa pun selain-Nya, tempat kembali pada hari itu. Allah yang akan memutuskan seadil-adilnya atas segala urusan manusia. Pada hari itu diberitakan secara jelas dan tegas kepada manusia apa yang telah dikerjakannya dan apa yang dilalaikannya"
  }
]