[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Manusia adalah hujjah yang terang atas dirinya sendiri yang mengikatnya dengan apa yang dia lakukan dan apa yang dia tinggalkan, sekalipun dia menghadirkan segala alasan atas kejahatannya, ia tidak bermanfaat baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Meski dia mengemukakan alasan-alasannya untuk membantah kesaksian dirinya sendiri bahwa dia tidak melakukan perbuatan buruk, tapi hal itu tidak bermanfaat baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَوْ أَلْقَىٰ مَعَاذِيرَهُۥ (meskipun dia mengemukakan alasan-alasannya) Yakni meski ia beralasan atau menbela diri, tetap tidak berguna baginya, sebab ada yang akan membantah alasannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15 Bahkan manusia menjadi saksi bagi diri mereka sendiri. Mereka bersaksi atas segala apapun yang menjadi tanggungjawab mereka baik tentang iman atau kekufuran, ketaatan atau kemaksiatan yang mereka lakukan. Hati (bashirah), menjadi saksi yang jelas untuk mengatakan segala perbuatannya. Meskipun tentang segala yang mereka dustakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{walaupun dia mengemukakan alasan-alasan} meski mendatangkan setiap alasan yang digunakan untuk melindungi dirinya, hal itu tidak diterima"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. “Bahkan manusia itu menjadi saksi atas dirinya sendiri,” yakni sebagai saksi dan yang menghisab, “meskipun dia mengemukakan alasan-alasannya,” semua alasan-alasannya tidak diterima, dan ia akan mengakui amalannya sendiri dan menegaskannya sebagaimana disebutkan dalam Firman Allah,” \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu\".” -Al-isra:14- Meski manusia mengingkari dan beralasan atas apa yang telah dilakukan, keingkaran dan alasan tersebut sama sekali tidak berguna, sebab perbuatannya disaksikan oleh pendengaran, penglihatan, dan seluruh anggota badannya atas apa yang telah diperbuat, karena waktu penyesalan sudah berakhir dan tidak lagi berguna. “Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka, dan tidak pula mereka diberi kesempatan bertaubat lagi.” -Arrum: 57-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 15: 14-15. Allah mengabarkan bahwa manusia akan melihat setiap amalan mereka di dunia sendiri-sendiri yang dipaparkan di hadapannya. Pada hari itu, amalan tersebut yang menentukan hukum atas dirinya; Karena dirinya lebih mengetahui akan amalan baik dan buruknya, dan tidak berguna orang-orang yang meminta ampun jika mereka mencoba untuk memohon ampunan, atau mencoba mendebat, atau menyembunyikan atau berusaha melindungi dirinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak akan diterima alasan-alasannya, sebagaimana firman Allah Ta’ala, “Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka, dan tidak pula mereka diberi kesempatan bertobat lagi.” (Terj. Ar Ruum: 57)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 15",
    "description": "14-15. Sebenarnya setiap orang sudah mengetahui keadaan diri mereka masing-masing, tidak perlu diberitahu, bahkan manusia menjadi saksi atas dirinya sendiri, anggota tubuh mereka akan berbicara dan menjadi saksi atas perbuatan mereka. (lihat surah yasin/36, 65. An-nur/24, 24. Fusssilat/41, 20-21). Dan meskipun dia mengemukakan alasan-alasannya, dengan argumen yang kuat, namun itu tidak akan membantu meringankan azab yang mereka terima. 16-17. Kalau ayat-ayat yang lalu menjelaskan tentang orang-orang yang enggan memperhatikan Al-Qur'an, kelompok ayat ini menjelaskan tentang yang sangat memperhatikan Al-Qur'an. Jangan engkau, wahai nabi Muhammad, gerakkan lidahmu untuk membaca Al-Qur'an sebelum malaikat jibril selesai membacakannya, karena hendak cepat-cepat menguasainya. Sesungguhnya kami yang akan mengumpulkannya di dadamu dan membacakannya, sehingga engkau menjadi pandai dan lancar dalam membacanya."
  }
]