[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-19. Jangan menggerakan lisanmu (wahai Nabi) untuk membaca al-Quran saat wahyu turun, agar kamu bisa menghapalnya dengan cepat karena kamu khawatir ia akan terlewatkan darimu. Sesungguhnya kewajiban Kamilah mengumpulkannya di dalam dadamu, kemudian Kami membacakannya dengan lisanmu kapan kamu berkehendak. Bila Rasul Kami, Jibril, membacakannya kepadamu, maka dengarkanlah bacaannya dan diamlah, kemudian bacalah sebagaimana dia membacakannya kepadamu, kemudian Kami-lah yang akan menjelaskan apa yang musykil bagimu pemahamannya dari makna-makna dan hukum-hukumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Jika Jibril telah menyelesaikan bacaannya, maka diamlah untuk mendengar bacaannya dan perhatikanlah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Jika Jibril membaca ayat-ayat, maka dengarkanlah dengan seksama -hai Nabi yang mulia-, dengarkanlah bacaannya hingga selesai, dan ketika itu ayat-ayat itu telah menetap di hatimu, maka bacalah kembali dan sampaikanlah kepada umatmu sebagaimana yang diperintahkan kepadamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فَإِذَا قَرَأْنٰهُ (Apabila Kami telah selesai membacakannya) Yakni jika Kami sedang membacanya untukmu melalui lisan Jibril. فَاتَّبِعْ قُرْءَانَهُۥ (maka ikutilah bacaannya itu) Yakni dengarkan dan simaklah bacaannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Apabila Kami membacakan kepadamu melalui lisan Jibril, maka simaklah dengan seksama dengan sikap yang tenang tanpa tergesa-gesa dalam tahapnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apabila Kami telah selesai membacakannya, ikutilah bacaannya itu} Apabila utusan Kami Jibril membacakannya untukmu maka dengarkanlah dia dan diamlah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-19. Ketika Jibril mendatangi Nabi untuk menyampaikan wahyu dan hendak mulai membacakannya pada Nabi, beliau bersegera membacanya dengan penuh perhatian sebelum Jibril selesai membaca. Nabi mengikuti bacaan Jibril. Kemudian Allah melarang hal itu seraya berfirman dalam ayat yang lain, “Maka Maha Tinggi Allah Raja Yang sebenar-benarnya, dan janganlah kamu tergesa-gesa membaca Al qur'an sebelum disempurnakan mewahyukannya kepadamu, dan katakanlah: \"Ya Tuhanku, tambahkanlah kepadaku ilmu pengetahuan\".” -Thaha: 114- Dan dalam surat ini Allah berfirman, “Janganlah kamu gerakkan lidahmu untuk (membaca) al-Quran karena hendak cepat-cepat (menguasai) nya.” Allah memberi jaminan bahwa Rasulullah pasti menghapalnya, membacanya, dan Allah akan mengumpulkannya di dalam hati Rasulullah seraya berfirman, “Sesungguhnya atas tanggungan Kamilah mengumpulkannya ( di dadamu) dan (membuatmu pandai) membacanya,” maka kegigihan yang ada dalam benakmu hanyalah disebabkan oleh kekhawatiran akan lenyapnya hafalan dan lupa, (namun) karena Allah telah menjamin hal itu padamu, maka tidak perlu dilakukan. “Apabila Kami telah selesai membacakannya, maka ikutilah bacaannya itu,” yakni ketika JIbril telah menyampaikan wahyu secara keseluruhan, pada saat itu ikutilah bacaannya. Kemudian Rasulullah membacanya. “Kemudian, sesungguhnya atas tanggungan Kamilah penjelasannya,” yaitu penjelasan makna-maknanya. Allah memberi janji bahwa Rasulullah akan menhafal kata-kata dan maknanya dan inilah puncak tertingginya. Rasulullah kemudian melaksanakan ajaran Rabbnya. Bila Jibril membacakan wahyu kepadanya setelah ini, beliau diam mendengar, dan setelah Jibril usai, beliau baru membacanya. Dalam ayat ini terkandung etika menuntut ilmu, yaitu murid tidak boleh langsung bertanya pada guru sebelum usai memberi penjelasan. Setelah guru selesai, murid boleh menanyakan apa yang tidak dipahami. Begitu juga bila ada sesuatu di awal pembicaraan mengharuskan diberi tanggapan, sebaiknya tidak langsung ditanggapi atau diterima terlebih dahulu sebelum guru selesai bicara atau salah. Di samping itu agar murid bisa memahami penjelasan gurunya secara benar. Di dalam ayat ini juga terkandung penjelasan bahwa Nabi sebagaimana memberi penjelasan kata-kata wahyu pada umat, beliau juga menjelaskan makna-maknanya pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 18: 16-19. Kemudian Allah memberikan petunjuk atas Nabi-Nya ﷺ tentang tata cara mengikuti wahyu dalam membaca Al Qur’an. Allah memerintahkan kepadanya agar tidak menggerak-gerakkan lisannya dengan bacaan Al Qur’an ketikan dibacakan oleh Jibril Al Qur’an itu; Dimana ﷺ membalas bersamaan dengan bacaan Jibril, dengan sebab Nabi menginginkan untuk segera menghafalnya, karena takut lupa; Kemudian Allah melarang akan hal tersebut. Kemudian Allah mengabarkan urusan Nabi ﷺ, bahwasanya Nabi dibebani untuk menghafal Al Qur’an di dalam dadanya, dengan bacaaan sesuai jalannya wahyu. Allah mengabarkan kepada Nabi-Nya ﷺ, bahwa ia dibebani supaya menjelaskan apa yang dirasa sulit dari memahami makna-makna Al Qur’an dan hukum-hukumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Melalui bacaan malaikat Jibril ‘alaihis salam. Yakni dengarkanlah bacaannya. Maka Rasulullah shallallahu 'alaihi wa sallam melaksanakan adab yang diajarkan Allah, oleh karena itu ketika malaikat Jibril membacakan Al Qur’an, Beliau pun diam memperhatikan, setelah itu Beliau membacanya. Dalam ayat ini terdapat adab menimba ilmu, yaitu seorang pelajar hendaknya tidak segera bertanya kepada guru sebelum guru selesai menerangkan. Demikian pula ketika di awal ucapannya ada yang perlu dibetulkan atau dianggap bagus, ia pun tidak segera membetulkan atau menerimanya bahkan sampai ucapan itu selesai agar jelas yang hak dan yang batil dan agar ia memahami keadaan yang sesungguhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 18",
    "description": "18-19. Caranya adalah apabila kami melalui malaikat jibril telah selesai membacakannya kepadamu maka ikutilah bacaannya itu dengan lidah serta pikiran dan hatimu secara sungguh-sungguh. Kemudian sesungguhnya kami yang akan menjelaskan makna-maknanya"
  }
]