[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-19. Jangan menggerakan lisanmu (wahai Nabi) untuk membaca al-Quran saat wahyu turun, agar kamu bisa menghapalnya dengan cepat karena kamu khawatir ia akan terlewatkan darimu. Sesungguhnya kewajiban Kamilah mengumpulkannya di dalam dadamu, kemudian Kami membacakannya dengan lisanmu kapan kamu berkehendak. Bila Rasul Kami, Jibril, membacakannya kepadamu, maka dengarkanlah bacaannya dan diamlah, kemudian bacalah sebagaimana dia membacakannya kepadamu, kemudian Kami-lah yang akan menjelaskan apa yang musykil bagimu pemahamannya dari makna-makna dan hukum-hukumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Kemudian Kami-lah yang bertanggung jawab untuk menerangkannya kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah berjanji akan menetapkan ayat-ayat al-Qur’an dalam hati Rasulullah dan menjelaskan makna-maknanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُۥ (Kemudian, sesungguhnya atas tanggungan Kamilah penjelasannya) Yakni tafsir kandungannya berupa halal dan haram serta penjelasan tentang apa yang tidak kamu pahami. Setelah ayat ini turun, Rasulullah kemudian diam menyimak jika Jibril turun kepadanya, dan jika Jibril telah pergi beliau kemudian membacanya sebagaimana yang Allah perintahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kemudian, sesungguhnya Kami yang akan menjelaskan makna, hukum, halal maupun haram dari ayat-ayat wahyu itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian sesungguhnya tugas Kamilah menjelaskannya} penjabaran dari apa yang kamu pahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-19. Ketika Jibril mendatangi Nabi untuk menyampaikan wahyu dan hendak mulai membacakannya pada Nabi, beliau bersegera membacanya dengan penuh perhatian sebelum Jibril selesai membaca. Nabi mengikuti bacaan Jibril. Kemudian Allah melarang hal itu seraya berfirman dalam ayat yang lain, “Maka Maha Tinggi Allah Raja Yang sebenar-benarnya, dan janganlah kamu tergesa-gesa membaca Al qur'an sebelum disempurnakan mewahyukannya kepadamu, dan katakanlah: \"Ya Tuhanku, tambahkanlah kepadaku ilmu pengetahuan\".” -Thaha: 114- Dan dalam surat ini Allah berfirman, “Janganlah kamu gerakkan lidahmu untuk (membaca) al-Quran karena hendak cepat-cepat (menguasai) nya.” Allah memberi jaminan bahwa Rasulullah pasti menghapalnya, membacanya, dan Allah akan mengumpulkannya di dalam hati Rasulullah seraya berfirman, “Sesungguhnya atas tanggungan Kamilah mengumpulkannya ( di dadamu) dan (membuatmu pandai) membacanya,” maka kegigihan yang ada dalam benakmu hanyalah disebabkan oleh kekhawatiran akan lenyapnya hafalan dan lupa, (namun) karena Allah telah menjamin hal itu padamu, maka tidak perlu dilakukan. “Apabila Kami telah selesai membacakannya, maka ikutilah bacaannya itu,” yakni ketika JIbril telah menyampaikan wahyu secara keseluruhan, pada saat itu ikutilah bacaannya. Kemudian Rasulullah membacanya. “Kemudian, sesungguhnya atas tanggungan Kamilah penjelasannya,” yaitu penjelasan makna-maknanya. Allah memberi janji bahwa Rasulullah akan menhafal kata-kata dan maknanya dan inilah puncak tertingginya. Rasulullah kemudian melaksanakan ajaran Rabbnya. Bila Jibril membacakan wahyu kepadanya setelah ini, beliau diam mendengar, dan setelah Jibril usai, beliau baru membacanya. Dalam ayat ini terkandung etika menuntut ilmu, yaitu murid tidak boleh langsung bertanya pada guru sebelum usai memberi penjelasan. Setelah guru selesai, murid boleh menanyakan apa yang tidak dipahami. Begitu juga bila ada sesuatu di awal pembicaraan mengharuskan diberi tanggapan, sebaiknya tidak langsung ditanggapi atau diterima terlebih dahulu sebelum guru selesai bicara atau salah. Di samping itu agar murid bisa memahami penjelasan gurunya secara benar. Di dalam ayat ini juga terkandung penjelasan bahwa Nabi sebagaimana memberi penjelasan kata-kata wahyu pada umat, beliau juga menjelaskan makna-maknanya pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 19: 16-19. Kemudian Allah memberikan petunjuk atas Nabi-Nya ﷺ tentang tata cara mengikuti wahyu dalam membaca Al Qur’an. Allah memerintahkan kepadanya agar tidak menggerak-gerakkan lisannya dengan bacaan Al Qur’an ketikan dibacakan oleh Jibril Al Qur’an itu; Dimana ﷺ membalas bersamaan dengan bacaan Jibril, dengan sebab Nabi menginginkan untuk segera menghafalnya, karena takut lupa; Kemudian Allah melarang akan hal tersebut. Kemudian Allah mengabarkan urusan Nabi ﷺ, bahwasanya Nabi dibebani untuk menghafal Al Qur’an di dalam dadanya, dengan bacaaan sesuai jalannya wahyu. Allah mengabarkan kepada Nabi-Nya ﷺ, bahwa ia dibebani supaya menjelaskan apa yang dirasa sulit dari memahami makna-makna Al Qur’an dan hukum-hukumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menjanjikan Beliau dapat menghapal maknanya setelah menghapal lafaznya. Dengan memahamkannya kepadamu. Dalam ayat ini terdapat dalil, bahwa Nabi shallallahu 'alaihi wa sallam sebagaimana menerangkan kepada umat lafaz-lafaz wahyu, maka Beliau juga menerangkan kepada umat makna atau kandungannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 19",
    "description": "18-19. Caranya adalah apabila kami melalui malaikat jibril telah selesai membacakannya kepadamu maka ikutilah bacaannya itu dengan lidah serta pikiran dan hatimu secara sungguh-sungguh. Kemudian sesungguhnya kami yang akan menjelaskan makna-maknanya. 20-21. Ayat ini kembali menceritakan tentang orang-orang yang mengabaikan petunjuk Al-Qur'an. Tidak! bahkan kamu terlalu mencintai kehidupan dunia yang fana ini, dan mengabaikan kehidupan akhirat yang sempurna dan abadi."
  }
]