[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan hari perhitungan amal dan pembalasan. Allah juga bersumpah dengan jiwa beriman yang bertakwa yang mengkritik pemiliknya saat meninggalkan ketaatan dan melakukan kemaksiatan, bahwa manusia akan dibangkitkan. Apakah manusia kafir itu menyangka Kami tidak kuasa mengumpulkan tulang belulangnya sesudah ia berserakan? Dugan itu salah besar, sebaliknya Kami akan mengumpulkannya, Kami Mahakuasa sesudah mengumpulkannya dan menyatukannya untuk membentuk dan menyusun kembali jari-jari dan ruas-ruasnya sebagaimana sebelum dia mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan Allah bersumpah dengan nafsu baik yang mencela dirinya karena kurang sempurna melakukan amal saleh dan melakukan perbuatan buruk, Allah bersumpah dengan dua hal ini bahwa Allah akan membangkitkan manusia semua untuk perhitungan amal perbuatan dan pembalasannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَلَآ أُقْسِمُ بِالنَّفْسِ اللَّوَّامَةِ (dan aku bersumpah dengan jiwa yang amat menyesali (dirinya sendiri)) Yang dimaksud adalah jiwa orang yang beriman yang menyesali apa yang terlewat darinya; jiwa itu akan memarahi dirinya atas keburukan yang dilakukannya “mengapa kamu melakukannya!” dan memarahi dirinya atas kebaikan “mengapa kamu tidak memperbanyaknya.” Muqatil berpendapat: yang dimaksud adalah jiwa orang kafir yang memarahi dan menyesali dirinya di akhirat atas kelalaiannya dalam menjalankan kewajiban dari Allah. Atau yang dimaksud adalah Allah bersumpah dengan keduanya sekaligus yaitu dengan jiwa orang beriman dan jiwa orang kafir, bahwa Dia akan mengumpulkan tulang belulang kemudian menghidupkan seluruh manusia untuk Dia memberinya perhitungan dan balasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Aku (Allah) bersumpah demi jiwa yang selalu menyesali dirinya sendiri dalam keteledorannya untuk menjalankan ketaatan. Jiwa itu seharusnya senantiasa terjaga untuk selalu melakukan ketaatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bersumpah demi jiwa yang sangat menyesali} jiwa mukmin yang mencela sahabatnya, yaitu ketika beramal shalih, dia berkata,\"Tidaklah bertambah\", dan jika beramal buruk, dia berkata,\"Celakalah kamu jangan melakukan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dan Aku bersumpah dengan jiwa yang amat menyesali (dirinya sendiri),” ini mencakup seluruh jiwa yang baik dan yang keji. Disebut sebagai jiwa yang amat menyesali karena banyaknya berganti warna dan berulang-ulang dan tidak berada dalam satu keadaan, dan karena jiwa ini mencela orangnya pada saat meninggal dunia atas apa yang telah dilakukan. Sedangkan jiwa orang yang beriman mencela orangnya ketika berada di dunia atas kemalasan atau tidak menunaikan kewajiban secara sempurna atau karena kelalaian. Dalam ayat ini sumpah atas pembalasan dan balasan disatukan dan juga antara pembalasan dengan orang yang berhak mendapatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 2: 1-4. Allah mengawali surat ini dengan sumpah, Allah berkata : Aku bersumpah dengan hari kiamat, hari perhitungan dan balasan, dimana tidak ada keraguan dalam kejadaiannya. Allah bersumpah dengan jiwa manusia yang suci dan beriman, yang banyak berharap kepada-Ku, yang mencela dirinya sendiri atas kesalahan dan kekurangan dalam melaksanakan hak Allah. Sungguh kalian wahai jin dan manusia, akan dibangkitkan dan saling dihitung atas seluruh amalan-amalan kalian. Ketahuilah oleh kalian bahwa orang yang kafir ini menyangka bahwa Allah tidak kuasa mengumpulkan tulang-belulang setelah bercerai-berai yang kemudian dihidupkan kembali untuk kali yang lain; Maka ketahuilah bahwa Allah Maha Kuasa atas apa yang dianggap menakjubkan (oleh manusia) atas hal itu; Sungguh Allah kuasa mengembalikan jari-jemari dengan sendi-sendinya secara sempurna, dimana tidak ada yang menyamapai satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, jika ia berbuat kebaikan ia menyesal mengapa tidak berbuat lebih banyak, apalagi kalau ia berbuat kejahatan. Jawaban (isi) terhadap sumpah tersebut adalah, “Kamu pasti akan dibangkitkan.” Dinamakan jiwa tersebut dengan ‘lawwamah’ karena keadaan jiwa tersebut yang selalu menyesali dirinya, tidak tetapnya berada di atas satu keadaan. Di samping itu, ketika mati jiwa itu menyesali perbuatannya. Bahkan jiwa orang mukmin menyalahkan dirinya ketika di dunia karena apa yang dilakukannya berupa sikap meremehkan, kurang memenuhi hak, lalai dsb. Di ayat ini, Allah Subhaanahu wa Ta'aala menggabung antara bersumpah dengan pembalasan, pembalasan itu sendiri dan orang yang berhak mendapatkan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 2",
    "description": "1-2. Akhir surah al-Muddasir menguraikan tentang kiamat serta betapa mengerikannya peristiwa itu, namun kaum pendurhaka mendustakannya. Segala argumen sudah dipaparkan, kalau mereka tetap tidak beriman, maka ayat ini menunjukkan Allah, tidak akan meladeni mereka lagi. Aku bersumpah dengan kepastian hari kiamat karena semuanya sudah jelas, dan aku juga bersumpah dengan jiwa yang selalu menyesali dirinya sendiri. Sungguh manusia pasti akan dibangkitkan. 3-4. Atas penegasan tentang kepastian hari kiamat mestinya manusia percaya, tetapi banyak yang ingkar. Apakah manusia mengira, bahwa kami tidak akan mengumpulkan kembali tulang-belulangnya yang telah berserakan setelah kematiannya' jangankan hanya mengumpulkan kembali tulang-belulang, bahkan kami mampu menyusun kembali jari jemarinya dengan sempurna."
  }
]