[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Perkaranya tidak sebagaimana yang kalian klaim (wahai kaum musyrikin) bahwa tidak ada kebangkitan, dan tidak ada pembalasan amal, sebaliknya kalian adalah orang-orang yang mencintai dunia dan perhiasannya, meninggalkan dan melalaikan akhirat dengan segala kenikmatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Sekali-kali tidak demikian, perkaranya tidak sebagaimana yang kalian duga dalam hal mustahilnya terjadi kebangkitan. Kalian tahu bahwa Żat Yang Mahakuasa untuk menciptakan kalian dari semula tidak akan kesulitan untuk menghidupkan kalian setelah kematian kalian, akan tetapi sebab pendustaan kalian terhadap kebangkitan adalah kecintaan kalian terhadap kehidupan dunia yang cepat berlalu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Ayat-ayat ini dimulai dengan cercaan dan larangan mengingkari hari kebangkitan yang telah jelas bukti-bukti keberadaannya. Dan yang membuat manusia mengingkarinya adalah kecintaan mereka kepada dunia, dan kenikmatan serta syahwatnya, sehingga mereka melupakan akhirat dan melalaikan amal shalih untuk menyambutnya. Dua ayat ini ditunjukan kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Tidak! Untuk mencela manusia yang mencintai kehidupan dunia. Tapi kalian wahai orang kafir justru memilih dan mencintai kehidupan dunia dan segala tipu dayanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekali-kali tidak. Bahkan, kalian mencintai kehidupan yang cepat} kehidupan dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Maknanya, inilah yang menyebabkan kalian lalai dan berpaling dari nasihat dan peringatan Allah, karena sesungguhnya kalian “sebenarnya kamu (hai manusia) mencintai kehidupan dunia,” kalian berusaha untuk mendapatkan kenikmatan-kenikmatan dan kesenangan-kesenangannya. Kalian lebih mementingkan dunia daripada akhirat sehingga kalian tidak beramal untuk akhirat, karena kenikmatan dan kesenangan dunia memang disegerakan. Manusia silau dalam mencintai sesuatu yang bersifat segera sedangkan akhirat dilalaikan, padahal di sanalah tempat kenikmatan abadi. Karena itulah kalian melalaikannya dan kalian meninggalkannya seolah-olah kalian tidak diciptakan untuk akhirat. Dan seolah-olah dunia ini adalah tempat keabadian yang mengharuskan usia-usia berharga dicurahkan untuknya siang dan malam. Dengan demikian, kebenaran terbalik bagi kalian dan kalian mendapatkan kerugian. Andai kalian lebih mementingkan akhirat daripada dunia dan bisa melihat resiko berbagai perbuatan secara mendalam dan dengan akal, niscaya kalian akan berhasil dan mendapatkan keuntungan yang tidak terselip adanya kerugian dan niscaya kalian akan mendapatkan kemenangan yang tidak disertai kesengsaraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 20: 20-21. Sekali-kali tidak, wahai orang-orang musyrik, perkaranya tidak sebagaimana kalian katakan bahwa : Bahwasanya kalian tidak akan pernah dibangkitkan setelah kematian kalian. Akan tetapi, manusia yang menyeru kalian seperti ini adalah dia (manusia) yang mencintai kehidupan dunia dan perhiasannya, meninggalkan amalan shalih untuk akhirat dan hanyut dalam kenikmatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata ‘kalla’ di ayat ini bisa diartikan ‘Ingatlah’. Inilah yang membuat kamu lalai dan berpaling dari nasihat Allah dan peringatan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 20",
    "description": "20-21. Ayat ini kembali menceritakan tentang orang-orang yang mengabaikan petunjuk Al-Qur'an. Tidak! bahkan kamu terlalu mencintai kehidupan dunia yang fana ini, dan mengabaikan kehidupan akhirat yang sempurna dan abadi"
  }
]