[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan kalian meninggalkan kehidupan Akhirat yang jalan mencapainya adalah dengan menjalankan segala ketaatan yang diperintahkan Allah dan meninggalkan segala perbuatan haram yang dilarang-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Kalian juga meninggalkan perbuatan dan bekal kehidupan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mengabaikan akhirat} dan kalian mengabaikan negeri akhirat dan beramal untuknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-21. Maknanya, inilah yang menyebabkan kalian lalai dan berpaling dari nasihat dan peringatan Allah, karena sesungguhnya kalian “sebenarnya kamu (hai manusia) mencintai kehidupan dunia,” kalian berusaha untuk mendapatkan kenikmatan-kenikmatan dan kesenangan-kesenangannya. Kalian lebih mementingkan dunia daripada akhirat sehingga kalian tidak beramal untuk akhirat, karena kenikmatan dan kesenangan dunia memang disegerakan. Manusia silau dalam mencintai sesuatu yang bersifat segera sedangkan akhirat dilalaikan, padahal di sanalah tempat kenikmatan abadi. Karena itulah kalian melalaikannya dan kalian meninggalkannya seolah-olah kalian tidak diciptakan untuk akhirat. Dan seolah-olah dunia ini adalah tempat keabadian yang mengharuskan usia-usia berharga dicurahkan untuknya siang dan malam. Dengan demikian, kebenaran terbalik bagi kalian dan kalian mendapatkan kerugian. Andai kalian lebih mementingkan akhirat daripada dunia dan bisa melihat resiko berbagai perbuatan secara mendalam dan dengan akal, niscaya kalian akan berhasil dan mendapatkan keuntungan yang tidak terselip adanya kerugian dan niscaya kalian akan mendapatkan kemenangan yang tidak disertai kesengsaraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 21: 20-21. Sekali-kali tidak, wahai orang-orang musyrik, perkaranya tidak sebagaimana kalian katakan bahwa : Bahwasanya kalian tidak akan pernah dibangkitkan setelah kematian kalian. Akan tetapi, manusia yang menyeru kalian seperti ini adalah dia (manusia) yang mencintai kehidupan dunia dan perhiasannya, meninggalkan amalan shalih untuk akhirat dan hanyut dalam kenikmatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga kamu tidak beramal untuknya seakan-akan kamu diciptakan bukan untuknya, dan seakan-akan dunia adalah tempat menetap yang perlu untuk diberikan pengorbanan pikiran dan tenaga sehingga hakikat menjadi berubah di hadapanmu dan kamu pun mendapatkan kerugian. Kalau sekiranya kamu mengutamakan akhirat di atas dunia, kamu melihat akibat (akhir) dari sesuatu sebagaimana orang yang berakal melihat, tentu kamu akan beruntung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 21",
    "description": "20-21. Ayat ini kembali menceritakan tentang orang-orang yang mengabaikan petunjuk Al-Qur'an. Tidak! bahkan kamu terlalu mencintai kehidupan dunia yang fana ini, dan mengabaikan kehidupan akhirat yang sempurna dan abadi. 22-23. Setelah mengecam orang yang durhaka, ayat ini menjelaskan tentang keadaan manusia di akhirat sesuai dengan amalnya ketika di dunia. Wajah-wajah orang mukmin pada hari itu di akhirat berseri-seri karena rasa bahagia yang ada padanya ketika memandang tuhannya."
  }
]