[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-23. Wajah orang-orang yang berbahagia pada Hari Kiamat akan berbinar, bersuka cita dan bergembira, wajah-wajah itu akan melihat Penciptanya dan pemegang urusannya, maka wajah-wajah itu mendapatkan kenikmatan karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Wajah-wajah orang yang beriman dan yang berbahagia pada hari itu terang bercahaya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Kemudian Allah menjelaskan sebagian keadaan orang-orang yang bahagia dan yang menderita pada hari kiamat: Wajah orang-orang yang mendapat kebahagiaan dan kenikmatan akan bersinar dan berseri-seri. Mereka akan melihat Tuhan Yang Maha Agung, Maha Indah, dan Maha Sempurna, sehingga mereka sangat menikmatinya sebab dapat melihat Allah ketika di surga merupakan kenikmatan yang terbesar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وُجُوهٌ يَوْمَئِذٍ نَّاضِرَةٌ (Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri) Yakni wajah yang bersinar dan berseri-seri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Pada hari kiamat, wajah-wajah orang mukmin sangat bercahaya penuh kegembiraan atas kabar nikmat yang akan mereka dapatkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wajah-wajah} wajah-wajah orang yang berbahagia {pada hari itu} pada hari kiamat {berseri-seri} cemerlang dan memancarkan cahaya"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "22-23. Kemudian Allah menyebutkan apa-apa yang menumbuhkan semangat untuk lebih mementingkan akhirat dan menjelaskan kondisi penghuninya serta tingkatan-tingkatan mereka. Allah berfirman tentang balasan orang-orang yang lebih mementingkan akhirat daripada dunia, “wajah-wajah (orang-orang Mukmin) pada hari itu berseri-seri,” yakni berseri, cerah dan bercahaya, karena dalam diri mereka terdapat kenikmatan hati, kebahagiaan jiwa, serta kenikmatan ruhani. “Kepada Rabbnyalah mereka melihat,” yakni mereka memandang Rabb mereka berdasarkan tingkatan mereka. Ada di antara mereka yang memandang setiap hari, di pagi dan di sore hari. Ada di antara mereka yang memandang pada hari Jumat saja, mereka bersenang-senang dengan melihat Wajah Allah Yang Mahamulia dan keindahanNya yang jelas yang tidak ada sesuatu pun menyerupaiNya. Ketika para penghuni surga melihatNya, mereka lupa akan kenikmatan dan kebahagiaan yang tidak bisa diungkapkan dengan kata-kata. Wajah-wajah mereka kian berseri dan indah. Kita memohon kepada Allah agar menjadikan kita bersama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 22: 22-23. Allah mengabarkan bahwa wajah orang-orang yang gembira pada hari kiamat berseri-seri, mereka melihat kepada Tuhan mereka dengan mata kepala mereka tanpa penghalang, dengan pandangan senang dan suka-cita, inilah sebesar-besar nikmat yang Allah berikan kenikmatan ini kepada penghuni surga pada hari kiamat. Kami memohon kepada Allah Al Karim dari karunia-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang mengutamakan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 22",
    "description": "22-23. Setelah mengecam orang yang durhaka, ayat ini menjelaskan tentang keadaan manusia di akhirat sesuai dengan amalnya ketika di dunia. Wajah-wajah orang mukmin pada hari itu di akhirat berseri-seri karena rasa bahagia yang ada padanya ketika memandang tuhannya"
  }
]