[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-23. Wajah orang-orang yang berbahagia pada Hari Kiamat akan berbinar, bersuka cita dan bergembira, wajah-wajah itu akan melihat Penciptanya dan pemegang urusannya, maka wajah-wajah itu mendapatkan kenikmatan karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Melihat kepada Rabb mereka, menikmati pemandangan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِلَىٰ رَبِّهَا نَاظِرَةٌ (Kepada Tuhannyalah mereka melihat) Yakni melihat Allah. Dan telah banyak hadits yang sampai pada derajat mutawatir yang menyatakan bahwa orang-orang shalih akan melihat Tuhan mereka pada hari kiamat, sebagaimana ketika mereka melihat bulan purnama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Mereka mendapat nikmat paling agung untuk melihat Dzat Tuhannya langsung tanpa penghalang apapun. Banyak riwayat hadis sahih yang meriwayatkan tentang nikmat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(karena) memandang Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. Kemudian Allah menyebutkan apa-apa yang menumbuhkan semangat untuk lebih mementingkan akhirat dan menjelaskan kondisi penghuninya serta tingkatan-tingkatan mereka. Allah berfirman tentang balasan orang-orang yang lebih mementingkan akhirat daripada dunia, “wajah-wajah (orang-orang Mukmin) pada hari itu berseri-seri,” yakni berseri, cerah dan bercahaya, karena dalam diri mereka terdapat kenikmatan hati, kebahagiaan jiwa, serta kenikmatan ruhani. “Kepada Rabbnyalah mereka melihat,” yakni mereka memandang Rabb mereka berdasarkan tingkatan mereka. Ada di antara mereka yang memandang setiap hari, di pagi dan di sore hari. Ada di antara mereka yang memandang pada hari Jumat saja, mereka bersenang-senang dengan melihat Wajah Allah Yang Mahamulia dan keindahanNya yang jelas yang tidak ada sesuatu pun menyerupaiNya. Ketika para penghuni surga melihatNya, mereka lupa akan kenikmatan dan kebahagiaan yang tidak bisa diungkapkan dengan kata-kata. Wajah-wajah mereka kian berseri dan indah. Kita memohon kepada Allah agar menjadikan kita bersama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 23: 22-23. Allah mengabarkan bahwa wajah orang-orang yang gembira pada hari kiamat berseri-seri, mereka melihat kepada Tuhan mereka dengan mata kepala mereka tanpa penghalang, dengan pandangan senang dan suka-cita, inilah sebesar-besar nikmat yang Allah berikan kenikmatan ini kepada penghuni surga pada hari kiamat. Kami memohon kepada Allah Al Karim dari karunia-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka merasakan nikmat melihat Allah yang tidak ada sesuatu pun yang serupa dengan-Nya. Ketika mereka melihatnya, maka mereka lupa terhadap semua kenikmatan dan mereka mendapatkan kenikmatan dan kegembiraan yang tidak dapat diungkapkan oleh lisan, wajah mereka pun semakin berseri dan bertambah indah, maka kita meminta kepada Allah Yang Mahamulia agar Dia menjadikan kita bersama mereka, Aamiin yaa Rabbal ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 23",
    "description": "22-23. Setelah mengecam orang yang durhaka, ayat ini menjelaskan tentang keadaan manusia di akhirat sesuai dengan amalnya ketika di dunia. Wajah-wajah orang mukmin pada hari itu di akhirat berseri-seri karena rasa bahagia yang ada padanya ketika memandang tuhannya. 24-25. Dan ada juga wajah-wajah orang kafir pada hari itu muram karena mereka lengah terhadap akhirat. Mereka merasa yakin bahwa akan ditimpakan kepadanya malapetaka yang sangat dahsyat. Dimana mereka tidak dapat mengelak sama sekali."
  }
]