[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Sedangkan wajah orang-orang yang sengsara pada Hari Kiamat bermuram durja dan cemberut, wajah-wajah itu yakin akan ditimpa musibah besar yang menghancurkan tulang punggung mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan wajah-wajah orang kafir dan yang sengsara pada hari itu tampak masam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Sedangkan wajah orang-orang yang mendapat penderitaan akan menjadi gelap dan suram, mereka menunggu-nunggu azab yang berat sebelum dimasukkan ke dalam neraka; dan musibah besar akan menghancurkan tulang punggung mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَوُجُوهٌ يَوْمَئِذٍۭ بَاسِرَةٌ (Dan wajah-wajah (orang kafir) pada hari itu muram) Yakni wajah yang muram dan penuh kegalauan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24-25 Namun pada hari itu, juga ada wajah-wajah yang buruk rupa, sangat masam, sangat muram. Wajah-wajah yang mengetahui bahwa mereka akan mendapatkan bencana yang besar yang menghancurkan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wajah-wajah} wajah-wajah orang yang sengsara {pada hari itu muram"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25. Allah berfirman tentang orang-orang yang lebih mementingkan kehidupan dunia, “Dan wajah-wajah (orang kafir) pada hari itu muram,” yakni bermuka masam, lusuh, tunduk, dan hina, “mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang amat dahsyat,” yakni siksaan berat dan azab yang pedih. Karena itulah wajah mereka berubah dan menjadi muram."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 24: 24-25. Adapun wajah para pendosa, pada hari kiamat cemberut dan menghitam dengan sangat. Mereka adalah orang-orang yang mengetahui akan kesengsaraan diri-diri mereka. Mereka akan ditimpa secara tiba-tiba dengan musibah yang besar yang akan mencelakakan mereka dan (sehingga) mereka sengsara dan nampak pada mereka keresahan dan kerasanya (adzab hari kiamat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman tentang orang-orang yang mengutamakan dunia daripada akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 24",
    "description": "24-25. Dan ada juga wajah-wajah orang kafir pada hari itu muram karena mereka lengah terhadap akhirat. Mereka merasa yakin bahwa akan ditimpakan kepadanya malapetaka yang sangat dahsyat. Dimana mereka tidak dapat mengelak sama sekali"
  }
]