[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Sedangkan wajah orang-orang yang sengsara pada Hari Kiamat bermuram durja dan cemberut, wajah-wajah itu yakin akan ditimpa musibah besar yang menghancurkan tulang punggung mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Meyakini bahwa wajah-wajah itu akan tertimpa siksa yang besar dan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. تَظُنُّ أَن يُفْعَلَ بِهَا فَاقِرَةٌ (mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang amat dahsyat) Makna (الفاقرة) yakni musibah yang besar, sampai seakan-akan tulang punggung mereka patah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24-25 Namun pada hari itu, juga ada wajah-wajah yang buruk rupa, sangat masam, sangat muram. Wajah-wajah yang mengetahui bahwa mereka akan mendapatkan bencana yang besar yang menghancurkan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masam dan murung {mereka yakin} yakin {akan ditimpakan kepadanya malapetaka} musibah agung yang bisa meremukkan punggung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25. Allah berfirman tentang orang-orang yang lebih mementingkan kehidupan dunia, “Dan wajah-wajah (orang kafir) pada hari itu muram,” yakni bermuka masam, lusuh, tunduk, dan hina, “mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang amat dahsyat,” yakni siksaan berat dan azab yang pedih. Karena itulah wajah mereka berubah dan menjadi muram."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 25: 24-25. Adapun wajah para pendosa, pada hari kiamat cemberut dan menghitam dengan sangat. Mereka adalah orang-orang yang mengetahui akan kesengsaraan diri-diri mereka. Mereka akan ditimpa secara tiba-tiba dengan musibah yang besar yang akan mencelakakan mereka dan (sehingga) mereka sengsara dan nampak pada mereka keresahan dan kerasanya (adzab hari kiamat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu azab yang pedih dan keras sehingga wajah mereka berubah menjadi muram, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 25",
    "description": "24-25. Dan ada juga wajah-wajah orang kafir pada hari itu muram karena mereka lengah terhadap akhirat. Mereka merasa yakin bahwa akan ditimpakan kepadanya malapetaka yang sangat dahsyat. Dimana mereka tidak dapat mengelak sama sekali. 26-30. Ayat di atas mengingatkan siapa saja untuk tidak terlalu mencintai dunia karena setiap saat maut bisa datang. Sekali-kali tidak, yaitu tidak akan berlanjut kehidupan dunia ini, apabila nyawa seseorang telah sampai ke kerongkongan, dan ketika itu dikatakan kepadanya, 'siapa yang dapat menyembuhkan sakaratul maut ini'' dan dia yakin bahwa itulah waktu perpisahan dengan dunia yang dicintainya, dan bertaut betis kiri dengan betis kanan, karena hebatnya penderitaan pada saat akan mati dan ketakutan akan meninggalkan dunia dan menghadapi akhirat, dan kepada tuhanmulah pada hari itu kamu dihalau ke surga bagi yang taat dan ke neraka bagi yang durhaka."
  }
]