[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-30. Benar, ketika ruh telah naik ke dada bagian atas, sebagian hadirin berkata kepada sebagian lainnya, “Adakah peruqyah yang bisa meruqyah dan menyembuhkan apa yang dialaminya?” yang bersangkutan yakin bahwa apa yang terjadi padanya adalah perpisahannya dengan alam dunia, karena dia telah menyaksikan malaikat maut dengan matanya, beban berat perpisahan dunia bertemu dengan beban berat awal perjumpaan dengan akhirat. Hanya kepada Allah semata para hamba akan dikumpulkan, selanjutnya surga atau neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Dan orang yang mengalami sakaratul maut meyakini bahwa itu adalah perpisahan dunia dengan kematian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَظَنَّ أَنَّهُ الْفِرَاقُ (dan dia yakin bahwa sesungguhnya itulah waktu perpisahan) Yakni orang yang nafasnya telah sampai di kerongkongan itu yakin bahwa saat itu adalah waktu baginya berpisah dengan dunia serta dengan istri, anak, dan hartanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Orang yang mengalami sekarat itu meyakini bahwa itulah saat perpisahannya dengan dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan dia yakin} orang yang dihadirkan itu meyakini {bahwa itulah waktu perpisahan} berpisah dengan dunia dengan kematian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-30. Allah memberi petuah kepada para hambaNya dengan menyebutkan orang yang kedatangan ajal, ketika ia sedang dalam keadaan berbaring dan ruhnya telah mencapai “kerongkongan” yaitu tulang tempat lubang kerongkongan, yang pada saat itu bencana kian dahsyat, ia mencari segala cara dan sebab yang dikira bisa menyembuhkan dan memberi kenikmatan. Karena itu Allah berfirman, “Dan dikatakan kepadanya, ‘Siapakah yang dapat menyembuhkanmu’,” yakni siapa yang meruqyahnya, karena angan-angannya sudah terputus dari berbagai sebab normal, ia pun bergantung pada sebab-sebab ilahiyah. Sayangnya, bila ketentuan dan takdir telah dipastikan dan berlaku, tidak ada yang bisa menangkalnya. “Dan dia yakin bahwasanya itulah waktu perpisahan (dengan dunia),” berpisah dengan dunia, “dan bertaut betis kiri dengan betis kanan,” yakni segala musibah menyatu dan bertaut, masalah kian membesar, bencana kian memuncak serta menginginkan agar ruh tetap saja ada bersamanya. Kemudian ia digiring menuju Allah agar seluruh amal perbuatannya dibalas dan ditegaskan. Ini adalah peringatan keras dari Allah dengan tujuan menggiring hati kepada keselamatan dan peringatan keras Allah dari segala sesuatu yang membinasakannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 28: 26-28. Allah mengabarkan tentang kondisi manusia ketika sakaratul maut, Allah berkata : Sungguh benar wahai orang-orang musyrik, jika telah sampai ruh di kerongkongan, maka akan berpisah dari jasad. Dan berkata sebagian dai mereka yang hadir melihatnya : Apakah ada sesuatu yang dapat menyembuhkan sakaratul maut ? Maka sungguh orang yang mengalami sakaratul maut akan bepisah dengan jasadnya di dunia, karena orang yang mengalaminya akan melihat malaikat maut di hadapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 28",
    "description": "26-30. Ayat di atas mengingatkan siapa saja untuk tidak terlalu mencintai dunia karena setiap saat maut bisa datang. Sekali-kali tidak, yaitu tidak akan berlanjut kehidupan dunia ini, apabila nyawa seseorang telah sampai ke kerongkongan, dan ketika itu dikatakan kepadanya, 'siapa yang dapat menyembuhkan sakaratul maut ini'' dan dia yakin bahwa itulah waktu perpisahan dengan dunia yang dicintainya, dan bertaut betis kiri dengan betis kanan, karena hebatnya penderitaan pada saat akan mati dan ketakutan akan meninggalkan dunia dan menghadapi akhirat, dan kepada tuhanmulah pada hari itu kamu dihalau ke surga bagi yang taat dan ke neraka bagi yang durhaka"
  }
]