[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan hari perhitungan amal dan pembalasan. Allah juga bersumpah dengan jiwa beriman yang bertakwa yang mengkritik pemiliknya saat meninggalkan ketaatan dan melakukan kemaksiatan, bahwa manusia akan dibangkitkan. Apakah manusia kafir itu menyangka Kami tidak kuasa mengumpulkan tulang belulangnya sesudah ia berserakan? Dugan itu salah besar, sebaliknya Kami akan mengumpulkannya, Kami Mahakuasa sesudah mengumpulkannya dan menyatukannya untuk membentuk dan menyusun kembali jari-jari dan ruas-ruasnya sebagaimana sebelum dia mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Apakah manusia mengira bahwa Kami sekali-kali tidak akan mengumpulkan tulang-belulangnya setelah kematiannya untuk dibangkitkan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Orang yang kafir mengingkari hari kebangkitan dan perhitungan, dan merasa yakin tulang belulangnya tidak akan dapat dikumpulkan kembali setelah hancur. Pertanyaan dalam ayat ini adalah sebagai olokan dan bantahan dari Allah bahwa Dia Maha Kuasa untuk menjadikan tubuhnya yang telah hancur kembali seperti semula; Dia Mampu untuk mengembalikan jari jemari dan hal-hal kecil lainnya dalam tubuhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. أَيَحْسَبُ الْإِنسٰنُ أَلَّن نَّجْمَعَ عِظَامَهُۥ (Apakah manusia mengira, bahwa Kami tidak akan mengumpulkan (kembali) tulang belulangnya?) Yakni setelah menjadi tulang yang hancur kemudian akan Kami ciptakan kembali. Ini merupakan sangkaan yang batil dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Apakah orang-orang yang mengingkari hari kebangkitan itu menyangka bahwa Kami tidak akan mengumpulkan kembali tulang belulang mereka setelah menjadi mayat yang sudah hancur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah manusia mengira} mengira {bahwa Kami tidak akan mengumpulkan tulang-belulangnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Kemudian Allah memberitahukan bersamaan dengan hal di atas bahwa sesungguhnya sebagian orang-orang menentang dan mendustakan Hari Kiamat seraya berfirman, “Apakah manusia mengira bahwa Kami tidak akan megumpulkan (kembali) tulang belulangnya,” setelah kematian, sebagaimana disebutkan dalam Firman lain,” Dan ia membuat perumpamaan bagi Kami; dan dia lupa kepada kejadiannya; ia berkata: \"Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\"” -Yasin:78- Karena kebodohan dan permusuhannya, ia menganggap mustahil kemampuan Allah untuk menciptakan tulang yang merupakan tonggak raga. Allah membantahnya dengan berfirman, “Bukan demikian, sebenarnya Kami kuasa menyusun (kembali) jari jemarinya dengan sempurna,” yakni ujung-ujung jari dan tulangnya sekalipun. Hal itu mengharuskan penciptaan seluruh anggota badan, karena bila ujung-ujung jari ada, berarti penciptaan raga sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 3: 1-4. Allah mengawali surat ini dengan sumpah, Allah berkata : Aku bersumpah dengan hari kiamat, hari perhitungan dan balasan, dimana tidak ada keraguan dalam kejadaiannya. Allah bersumpah dengan jiwa manusia yang suci dan beriman, yang banyak berharap kepada-Ku, yang mencela dirinya sendiri atas kesalahan dan kekurangan dalam melaksanakan hak Allah. Sungguh kalian wahai jin dan manusia, akan dibangkitkan dan saling dihitung atas seluruh amalan-amalan kalian. Ketahuilah oleh kalian bahwa orang yang kafir ini menyangka bahwa Allah tidak kuasa mengumpulkan tulang-belulang setelah bercerai-berai yang kemudian dihidupkan kembali untuk kali yang lain; Maka ketahuilah bahwa Allah Maha Kuasa atas apa yang dianggap menakjubkan (oleh manusia) atas hal itu; Sungguh Allah kuasa mengembalikan jari-jemari dengan sendi-sendinya secara sempurna, dimana tidak ada yang menyamapai satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya, Allah Subhaanahu wa Ta'aala memberitahukan bahwa sebagian manusia mendustakan kebangkitan atau hari Kiamat. Yakni orang kafir. Untuk dibangkitkan dan dihidupkan. Ia menganggap hal itu mustahil karena kebodohannya terhadap kekuasaan Allah Subhaanahu wa Ta'aala. Oleh karena itulah, pada ayat selanjutnya Allah Subhaanahu wa Ta'aala membantah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 3",
    "description": "3-4. Atas penegasan tentang kepastian hari kiamat mestinya manusia percaya, tetapi banyak yang ingkar. Apakah manusia mengira, bahwa kami tidak akan mengumpulkan kembali tulang-belulangnya yang telah berserakan setelah kematiannya' jangankan hanya mengumpulkan kembali tulang-belulang, bahkan kami mampu menyusun kembali jari jemarinya dengan sempurna"
  }
]