[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Orang kafir itu tidak beriman kepada Rasul dan al-Quran, serta dia menunaikan kewajiban shalat untuk Allah, sebaliknya dia malah mendustakan al-Quran, berpaling dan menolak beriman, kemudian dia kembali kepada keluarganya dengan berjalan penuh kesombongan. Celakalah kamu dan celakalah, kemudian celakalah kamu dan celakalah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Akan tetapi ia mendustakan apa yang dibawa oleh Rasulnya dan berpaling darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَلٰكِن كَذَّبَ وَتَوَلَّىٰ (tetapi ia mendustakan (Rasul) dam berpaling (dari kebenaran)) Yakni mendustakan Rasul dan risalah yang dia bawa, dan enggan untuk taat dan beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31-32 Karena dahulu mereka tidak mau beriman kepada yang Allah perintahkan untuk mereka imani, dan tidak melaksanakan shalat wajib. Justru mendustakan dan menolak beriman kepada Alquran dan Rasul Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi, dia mendustakan dan berpaling} berpaling dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-33. Tapi orang yang membangkang yang tidak berguna baginya tanda-tanda kebesaran tetap saja berada dalam kesesatan, kekufuran, dan pembangkangan. “Dan ia tidak mau membenarkan (Rasul dan al-Quran),” yakni tidak beriman pada Allah, malaikat, para rasul, Hari Akhir, dan takdir baik maupun buruk, “dan tidak mau mengerjakan shalat, tetapi ia mendustakan (Rasul),” dan kebenaran, bukan malah membenarkan, “dan berpaling (dari kebenaran),” berpaling dari perintah dan larangan. Inilah orang yang hatinya tenang dan tidak takut pada Rabbnya, bahkan ia “pergi kepada ahlinya dengan berlagak (sombong),” yakni tidak ada sesuatu pun di benaknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 32: 31-33. Allah menjelaskan sebagian sebab-sebab adzab yang buruk pada kafir yang keras kepala ini adalah mengingkari hari kebangkitan, Allah mengabarkan bahwa ia (kafir) tidak membenarkan Al Qur’an dan tidak shalat karena Allah; Bahkan ia mendustakan Al Qur’an dan menolak keimanan, kemudian ia pergi menuju kepada keluarganya dengan gembira, ia berjalan dengan sombong karena dakwah (Nabi) tidak memberi dampak padanya, dan ia tetap di atas kekafirannya dan pengingkarannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan tenang hatinya tanpa rasa takut kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 32",
    "description": "31-33. Ayat ini menjelaskan beberapa sebab mengapa para pendurhaka diseret ke neraka. Karena dia dahulu tidak mau membenarkan Al-Qur'an dan rasul dan juga tidak mau melaksanakan salat, tetapi justru dia mendustakan rasul dan berpaling dari kebenaran. Bukan hanya sampai di situ, bahkan kemudian dia pergi kepada keluarganya dengan sombong. Dapat juga diartikan bahwa ayat 31-32, menggambarkan hubungannya yang buruk terhadap Allah, sedangkan ayat 33 menggambarkan buruknya hubungan sosial"
  }
]