[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-35. Orang kafir itu tidak beriman kepada Rasul dan al-Quran, serta dia menunaikan kewajiban shalat untuk Allah, sebaliknya dia malah mendustakan al-Quran, berpaling dan menolak beriman, kemudian dia kembali kepada keluarganya dengan berjalan penuh kesombongan. Celakalah kamu dan celakalah, kemudian celakalah kamu dan celakalah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Kemudian Allah mengulangi kalimat-Nya sebagai penegasan dengan firman-Nya: \"Kemudian kecelakaanlah bagimu (hai orang kafir) dan kecelakaanlah bagimu.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35 Kecelakan dan kebinasaanlah bagi mereka. Ini adalah penegasan untuk kalimat pertama dan menjadi ancaman atas perbuatan mereka. Adapun kalimat kedua bermaksud untuk menegaskan lagi. Abu Jahal pernah berkata: Apa yang akan engkau gunakan untuk mengancamku? Engkau maupun Tuhanmu tidak akan mampu berbuat apa-apa kepadaku, karena aku adalah orang paling mulia di negeri ini. Namun Abu Jahal terbunuh ketika perang Badar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, celakalah kamu. Maka celakalah} Kehancuran dan azab bagimu, kehancuran dan azab bagimu wahai orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. Kemudian Allah mengancamnya dengan FirmanNya, “Kecelakaanlah bagimu (hai orang kafir) dan kecelakaanlah bagimu, kemudian kecelakaanlah bagimu (hai orang kafir) dan kecelakaanlah bagimu.” Ini adalah kata-kata ancaman. Dan Allah mengulang untuk menegaskan ancamanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 35: 34-35. Allah mengancam orang kafir ini yang sombong dan celaka, Allah berkata : Sungguh musibah di atas musibah; Sungguh engkau telah dimuliakan dengan permisalan apa yang Allah perintahkan, agar engkau selamat dari api neraka dan lolos (darinya) dengan ridha dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kutukan terhadap orang kafir ini diulang-ulang sampai empat kali: (1) Pada saat ia akan mati, (2) Ketika berada dalam kubur, (3) Pada waktu hari berbangkit, dan (4) Di dalam neraka Jahanam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 35",
    "description": "34-35. Atas sikapnya yang buruk terhadap Allah dan sesama khususnya kepada keluarga, ayat ini menggambarkan kecaman yang diterimanya. Celakalah kamu! maka celakalah! sekali lagi, celakalah kamu hai manusia durhaka! maka celakalah! kalimat dalam ayat-ayat ini tertuju kepada setiap orang yang durhaka dan mengingkari keniscayaan kiamat. 36. Pembuktian keniscayaan kiamat pada ayat ini ditekankan pada hikmahnya. Manusia yang durhaka menduga bahwa hidup hanya di dunia setelah itu selesai. Ayat ini mengecam hal tersebut. Apakah manusia mengira, dia akan dibiarkan begitu saja tanpa pertanggungjawaban'."
  }
]