[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-40. Apakah manusia pengingkar kebangkitan ini menyangka akan dibiarkan begitu saja, tidak diperintah dan tidak dilarang, tidak dihisab dan tidak dihukum? Bukankah manusia itu dulunya hanya setetes air hina dari sperma yang dikeluarkan dan dimasukkan ke rahim, kemudian ia menjadi segumpal darah yang beku, lalu Allah menciptakan dari manusia ini dua jenis; laki-laki dan wanita. Bukankah Tuhan yang menciptakan segala sesuatu ini Mahakuasa untuk mengembalikan seluruh makhluk sesudah mereka fana? Tentu, karena sesungguhnya Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Kemudian menciptakan dari jenisnya dua macam; laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39-40. Kemudian Allah jadikan dari manusia yang sempurna susunannya itu dua jenis laki-laki dan juga perempuan. Bukankah dengan Allah kuasa untuk berbuat demikian, Allah-pun juga berkuasa untuk menghidupkan manusia dari kematiannya? Bukankah menghidupkan kembali itu justru lebih mudah dari pada menciptakan? (Tentu saja, karena Allah Maha Kuasa atas segala sesuatu). Qaul ini terdapat dalam hadis Nabi SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Dia menjadikan darinya laki-laki dan perempuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-40. Kemudian Allah mengingatkan manusia pada penciptaan awal seraya berfirman, “Apakah manusia mengira, bahwa ia akan dibiarkan begitu saja (tanpa pertanggung jawaban),” yakni dilalaikan tanpa diberi perintah dan larangan, tidak di beri pahala dan juga siksaan? Ini adalah dugaan keliru dan dugaan terhadap Allah yang tidak sesuai dengan ke MahabijaksanaanNya. “Bukankah dia dahulu dari setetes mani yang ditumpahkan (ke dalam rahim), kemudian mani itu menjadi segumpal darah, lalu Allah menciptakannya,” menciptakan makhluk hidup dari air mani dan menyempurnakannya. “Lalu Allah menjadikan dari padanya sepasang laki-laki dan perempuan. Bukankah (Allah yang berbuat) demikian,” yakni Yang telah menciptakan manusia dan membuatnya melalui berbagai fase ini, “berkuasa (pula) menghidupkan orang mati?” tentu, karena Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 39: 36-40. Allah menjelaskan pada akhir surat ini dengan hikmah dari hari pembalasan dan hisab, dan menjelaskan dari sisi kekuasaan-Nya, Allah berkata : Apakah ia menyanga bahwa Allah menciptakannya kemudian meninggalkannya tanpa sebab, tidak diperintah dan tidak juga dilarang , dan juga tidak dihisab akan amalannya ? Bukankah ia diciptakan dari air mani dari tulang ekor bapaknya yang ditumpahkan ke dalam rahim, kemudian jadilah segumpal darah, kemudian jadilah manusia yang dapat bicara, mendengar dan melihat dengan izin Allah; Kemudian Allah jadikan memiliki keturunan baik laki-laki maupun perempuan. Apakah Allah yang menjadikan ciptaannya ini dari ketiadaan menjadi ada, dari air mani, segumpal darah yang lemah, tidak mampu mengembalikannya sebagaimana awal diciptakannya ? Bukankah mengembalikan itu lebih mudah daripada menciptakan ?. Dari Abu Hurairah, bahwasanya Rasulullah ﷺ berkata : Siapa di antara kalian yang membaca أَلَيْسَ ذَ‌ٰلِكَ بِقَـٰدِرٍ عَلَىٰٓ أَن يُحْۦِىَ ٱلْمَوْتَىٰ, yang artinya : Bukankah (Allah yang berbuat) demikian berkuasa (pula) menghidupkan orang mati ?. Mereka (para sahabatnya) berkata : Benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 39",
    "description": "37-40. Kalau manusia menduga seperti itu, sungguh itu adalah dugaan yang keliru. Bukankah dia mulanya hanya setetes mani yang ditumpahkan ke dalam rahim, kemudian mani itu setelah bertemu dengan sel telur menjadi sesuatu yang melekat, lalu Allah yang mahakuasa menciptakannya dan menyempurnakan kejadiannya, lalu dia menjadikan darinya sepasang laki-laki dan perempuan. Begitulah siklus reproduksi manusia yang diberi kesempatan hidup di dunia untuk diberi tugas dan tanggung jawab. Dan pastilah akan dibangkitkan untuk dimintai pertanggung jawaban. Bukankah Allah yang berbuat demikian hebat dan menakjubkan, berkuasa pula menghidupkan orang mati' kalau manusia masih tetap durhaka, berarti sudah tertutup mata hatinya"
  }
]