[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Bukan demikian, Kami sungguh kuasa untuk mengembalikan ujung jari-jemarinya persis berbentuk seperti sediakala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. بَلَىٰ قٰدِرِينَ (Bukan demikian, sebenarnya Kami kuasa) Yakni namun Kami mampu mengumpulkannya. عَلَىٰٓ أَن نُّسَوِّىَ بَنَانَهُۥ (menyusun (kembali) jari jemarinya dengan sempurna) Yakni Kami berkuasa untuk menyatukan jemarinya dan menjadikannya seperti kaki unta, namun Kami memberinya kenikmatan berupa jari-jemari yang lentur dan terdiri dari ruas-ruas dan kuku, serta urat yang lentur dan tulang yang kecil. Pendapat lain mengatakan bahwa ini adalah perigatan dari Allah bahwa sidik jari jemari setiap orang berbeda dengan sidik jari jemari orang lain, seandainya Allah menghendaki niscaya Dia mampu menjadikannya sama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Bahkan Kami-pun kuasa untuk mengumpulkan kembali dengan sempurna. Kami juga kuasa untuk menyusun kembali jari-jemari mereka seperti sedia kala. ‘Adi bin Rabiah berkata kepada Nabi SAW: Wahai Muhammad, beritahu aku kapan hari kiamat itu akan terjadi. Maka Rasul menjawab dengan jawaban beliau. Kemudian ‘Adi bin Rabiah berkata kembali: Jikalaupun kabar tentang hari kiamat itu sudah jelas waktunya, aku tidak akan pernah membenarkanmu, juga tidak akan mempercayai hari kiamat itu. Bagaimana mungkin Allah mampu mengumpulkan kembali tulang-belulang setelah sekian lama terkubur? Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tentu, Kami mampu menyusun jari-jemarinya dengan sempurna} Kami mengembalikan ujung jari-jarinya yang menjadi ciptaan yang sempurna seperti sebelumnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. Kemudian Allah memberitahukan bersamaan dengan hal di atas bahwa sesungguhnya sebagian orang-orang menentang dan mendustakan Hari Kiamat seraya berfirman, “Apakah manusia mengira bahwa Kami tidak akan megumpulkan (kembali) tulang belulangnya,” setelah kematian, sebagaimana disebutkan dalam Firman lain,” Dan ia membuat perumpamaan bagi Kami; dan dia lupa kepada kejadiannya; ia berkata: \"Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?\"” -Yasin:78- Karena kebodohan dan permusuhannya, ia menganggap mustahil kemampuan Allah untuk menciptakan tulang yang merupakan tonggak raga. Allah membantahnya dengan berfirman, “Bukan demikian, sebenarnya Kami kuasa menyusun (kembali) jari jemarinya dengan sempurna,” yakni ujung-ujung jari dan tulangnya sekalipun. Hal itu mengharuskan penciptaan seluruh anggota badan, karena bila ujung-ujung jari ada, berarti penciptaan raga sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 4: 1-4. Allah mengawali surat ini dengan sumpah, Allah berkata : Aku bersumpah dengan hari kiamat, hari perhitungan dan balasan, dimana tidak ada keraguan dalam kejadaiannya. Allah bersumpah dengan jiwa manusia yang suci dan beriman, yang banyak berharap kepada-Ku, yang mencela dirinya sendiri atas kesalahan dan kekurangan dalam melaksanakan hak Allah. Sungguh kalian wahai jin dan manusia, akan dibangkitkan dan saling dihitung atas seluruh amalan-amalan kalian. Ketahuilah oleh kalian bahwa orang yang kafir ini menyangka bahwa Allah tidak kuasa mengumpulkan tulang-belulang setelah bercerai-berai yang kemudian dihidupkan kembali untuk kali yang lain; Maka ketahuilah bahwa Allah Maha Kuasa atas apa yang dianggap menakjubkan (oleh manusia) atas hal itu; Sungguh Allah kuasa mengembalikan jari-jemari dengan sendi-sendinya secara sempurna, dimana tidak ada yang menyamapai satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami akan menyusun kembali tulang-belulangnya seperti semula meskipun bagian tulang yang kecil seperti jari. Apabila Allah Subhaanahu wa Ta'aala berkuasa menyusun kembali tulang-belulang yang kecil, lalu bagaimana dengan tulang belulang yang besar?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 4",
    "description": "3-4. Atas penegasan tentang kepastian hari kiamat mestinya manusia percaya, tetapi banyak yang ingkar. Apakah manusia mengira, bahwa kami tidak akan mengumpulkan kembali tulang-belulangnya yang telah berserakan setelah kematiannya' jangankan hanya mengumpulkan kembali tulang-belulang, bahkan kami mampu menyusun kembali jari jemarinya dengan sempurna. 5-6. Kepastian kiamat tidak diragukan lagi, tetapi manusia hendak membuat maksiat terus-menerus. Manusia tidak menyadari sama sekali atas akibat perbuatannya. Justru dengan nada menantang dia bertanya, 'kapankah hari kiamat yang diancamkan itu''."
  }
]