[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Manusia mengingkari kebangkitan, dia ingin tetap berbuat dosa pada umurnya yang tersisa, orang kafir ini bertanya sebagai ungkapan tidak mungkinnya Hari Kiamat terjadi, “Kapankah Hari Kiamat?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Justru dengan keingkarannya terhadap kebangkitan, manusia ingin melakukan kejahatannya terus-menerus tanpa berhenti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Orang kafir yang mengingkari hari kebangkitan itu agar tetap dapat berada di atas kesesatan dan tenggelam di dalam syahwat tanpa peduli terhadap peringatan yang ada. Oleh sebab itu dia bertanya tentang waktu terjadinya hari kiamat sebagai bentuk hinaan dan pendustaan darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. بَلْ يُرِيدُ الْإِنسٰنُ لِيَفْجُرَ أَمَامَهُۥ (Bahkan manusia itu hendak membuat maksiat terus menerus) Yakni manusia ingin untuk berbuat kemaksiatan di waktu mendatang, dia terus bermaksiat dan menunda taubat, ia ingin agar dapat bermaksiat sepanjang hidupnya tanpa mengingat kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Tetapi manusia justru ingin hidup selamanya untuk terus bermaksiat selamanya, dan mengingkari hari kebangkitan dan hari akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan tetapi, manusia hendak berbuat maksiat terus-menerus} terus-menerus berbuat maksiat di masa mendatang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Keingkarannya pada Kuasa Allah bukan karena kurangnya dalil dan bukti yang menunjukkan atas hal itu, tapi keingkarannya berasal dari dirinya sendiri, karena tujuan dan maksudnya memang untuk mendustakan Hari Kebangkitan yang ada di hadapan matanya. ‘Al-fujuur’ berarti berdusta secara sengaja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 5: 5-6. Allah mengabarkan bahwa orang kafir mengingkari hari kebangkitan dan perhitungan (hisab). Ia tidak hanya mengingkari kebangkitan, akan tetapi tetap melanjutkan atas dosa dan hawa nafsunya serta melakukan kemaksiatan apapun yang ia mau. Oleh karena itu engkau akan tahu bahwa ia akan bertanya dengan pertanyaan yang menyindir, mengolok-olok dan mengajak untuk menjauhi urusannya, kafir itu berkata : Kapan sebenarnya hari kiamat itu ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan mendustakan apa yang ada di depannya, yaitu hari Kiamat. Pendustaan mereka terhadapnya bukanlah karena kurangnya dalil yang menunjukkan demikian, tetapi memang manusia itu lebih menginginkan mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 5",
    "description": "5-6. Kepastian kiamat tidak diragukan lagi, tetapi manusia hendak membuat maksiat terus-menerus. Manusia tidak menyadari sama sekali atas akibat perbuatannya. Justru dengan nada menantang dia bertanya, 'kapankah hari kiamat yang diancamkan itu''5-6"
  }
]