[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-10. Ketika pandangan mata terbelalak, terkejut ketakutan melihat kengerian pada Hari Kiamat, rembulan hilang cahayanya, matahari dan rembulan dikumpulkan, cahaya keduanya sama-sama hilang, tidak ada lagi cahaya bagi keduanya; saat itu manusia bertanya, “Kemana tempat berlari dari azab?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Jika mata telah bingung dan terbelalak tatkala melihat apa yang pernah mereka dustakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-9. Akibat dari kejadian hari kiamat itu, mata manusia akan terbelalak karena melihat kengerian yang terjadi; dan juga karena cahaya bulan yang sirna sehingga menjadi gelap gulita, kemudian bergabung dengan matahari, sehingga matahari dan bulan menjadi satu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَإِذَا بَرِقَ الْبَصَرُ (Maka apabila mata terbelalak (ketakutan)) Yakni ketika matanya terbelalak ketika kematian atau ketika ia dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Maka apabila mata mereka terbelalak ketakutan setelah melihat kejadian yang sebelumnya mereka dustakan, ketika hari itu bulan menjadi gelap dan hilang sinarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mata terbelalak} penglihatan kacau dan terkejut karena takut terhadap kengerian hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-10. Maksudnya, “maka apabila” tiba Hari Kiamat, “mata terbelalak (ketakutan),” yakni mata terbelalak (melotot) oleh kengerian karena huru-hara besar, dan terbelalak tidak terpejam, sebagaimana disebutkan dalam Firman Allah yang lain,” Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak, mereka datang bergegas-gegas memenuhi panggilan dengan mangangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong.” -Ibrahim:42-43- “Dan apabila bulan telah hilang cahayanya,” yakni hilang sinar dan kekuatannya, “dan matahari dan bulan dikumpulkan,” keduanya sejak diciptakan Allah tidak pernah disatukan, dan pada Hari Kiamat Allah akan menyatukan keduanya. Cahaya rembulan dilenyapkan, matahari digulung, kemudian keduanya dilemparkan ke dalam neraka agar semua manusia mengetahui bahwa keduanya adalah dua ciptaan dan hamba Allah yang ditundukkan, dan agar orang-orang yang menyembah keduanya mengetahui bahwa mereka berdusta. “Pada hari itu manusia berkata,” ketika melihat hal-hal mengerikan, “Kemana tempat lari?” yakni, kemanakah tempat lari dan terlepas dari semua yang akan menimpa kami?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qiyamah ayat 7: 7-10. Allah mengkhususkan pensifatan untuk orang kafir ini pada hari kiamat, Allah berkata : Ketahuilah wahai orang yang ingkar akan hari kiamat, bahwasanya hari kiamat terjadi jika mata terbelalak yang kemudian mata tersebut enggan (berpaling) dai apa yang nampak, dan hilangnya cahaya bulan, dan dikumpulkan antara matahari dan bulan dengan hilangnya cahaya keduanya. Pada hari itu engkau akan berkata wahai orang yang ingkar : Dimana tempat untuk meloloskan diri dan menyelamatkannya dari ketetapan Allah dan kuasa Allah serta adzab dan hisab-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan tentang keadaan pada hari Kiamat. Karena melihat apa yang telah didustakannya atau karena melihat peristiwa yang dahsyat dan mengerikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qiyamah Ayat 7",
    "description": "7-10. Atas pertanyaan kaum pendurhaka yang tujuannya untuk mengejek maka ayat ini menegaskan ancamannya kepada mereka. Maka apabila mata terbelalak karena ketakutan, dan bulan pun telah hilang cahayanya, lalu matahari dan bulan dikumpulkan, dan saat itulah kiamat terjadi. Pada hari itu manusia berkata, 'kemana tempat lari untuk menyelamatkan diri'' sama sekali tidak ada tempat yang aman"
  }
]