[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami memberimu (wahai Rasul) kemenangan yang nyata, dalam kemenangan itu Allah meninggikan agamamu dan memenangkanmu atas musuhmu. Kemenangan ini adalah perjanjian damai Hudaibiyah yang menjamin keamanan manusia sebagian dari sebagian yang lain, yang membuat lingkaran dakwah Islam menjadi meluas, siapa yang ingin mengetahui kebenaran Islam bisa mengetahuinya, dalam masa tersebut manusia masuk ke dalam agama Allah dalam jumlah besar, karena itu Allah menamakannya dengan kemenangan yang nyata, yakni tampak dan jelas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sesungguhnya Kami telah memberikan kemenangan kepadamu -wahai Rasul- dengan kemenangan yang nyata dengan perjanjian Hudaibiyah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah memberi kabar gembira bagi Rasulullah dan orang-orang beriman berupa penakhlukan yang akan terjadi: “Hai Rasulullah, Kami -dengan keagungan dan kuasa Kami- akan memberimu penakhlukan yang besar dengan kemenangan kebenaran atas kebatilan pada perjanjian Hudaibiyah, karena ia akan mendatangkan kemaslahatan yang besar dan akan terealisasi penakhlukan-penakhlukan yang datang berturut-turut, dan penakhlukan itu membutuhkan usaha yang besar, agar Allah mengampuni dosamu yang telah berlalu dan yang akan datang. Ayat ini juga mengandung kabar gembira lain bagi Rasulullah, bahwa beliau mendapat keistimewaan ampunan ini dan Allah akan menyempurnakan kenikmatan baginya dengan memerangkan agama Islam dan menyebarkannya, memberi beliau petunjuk kepada agama Islam, dan menolong beliau dengan pertolongan yang kuat. Diriwayatkan dari Anas, maksud dari (إنا فتحنا لك فتحا مبينا) yakni perjanjian Hudaibiyah. (Shahih al-Bukhari, kitab tafsir, surat al-Fath, bab (ayat ini) 8/447 no. 4834. Dan al-Bukhari meriwayatkannya juga dari al-Barra’ (Shahih al-Bukhari, kitab peperangan-peperangan, perang Hudaibiyah, no. 4150))."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Surat ini turun kepada Nabi SAW setelah perjanjian Hudaibiyah. Diriwayatkan dari Ahmad dan Bukhori dan lainnya, dari Umar bahwa Nabi SAW bersabda: “Kemarin malam telah turun surat yang lebih aku cintai dari pada dunia seisinya, yaitu surat Inna fatahna laka...” 1. Sesungguhnya Kami telah menganugerahkan kepadamu kemenangan yang nyata, berupa pertolongan dari orang-orang musyrik melalui peristiwa Huadaibiyah. Surat Al fath ini turun di antara Makkah dan Madinah pada saat peristiwa Hudaibiyah dari awal hingga akhir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menganugerahkan kepadamu kemenangan yang nyata} Kami telah memberimu keputusan yang agung kepadamu dengan perjanjian Hudaibiyah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Kemenangan yang disebutkan di atas adalah Perjanjian Hudaibiyah yaitu ketika kaum musyrikin mencegah Rasulullah yang hendak melaksanakan umrah sebagaimana yang tertera dalam kisah yang panjang. Di akhir kisahnya Rasulullah berdamai dengan mereka untuk tidak berperang di antara kedua belah pihak dalam waktu sepuluh tahun. Rasulullah umrah pada tahun mendatang, bagi siapa pun yang ingin masuk dalam pihak kaum Quraisy dipersilahkan dan bagi siapa pun yang ingin masuk dalam pihak Rasulullah dipersilahkan. Dampak baik dari perjanjian ini adalah ketika semua pihak saling memberi rasa aman satu sama lain, kawasan dakwah untuk agama Allah pun semakin lluas, sehingga semua orang yang ingin masuk Islam di wilayah mana pun kala itu bisa melakukannya, dan dimungkinkan bagi yang memiliki tekad bulat untuk untuk mendalami hakikat Islam. Kemudian pada waktu itu orang-orang pun masuk ke dalam Agama Allah secara bergelombang, dan karena itulah disebut oleh Allah sebagai kemenangan dan juga kemenangan nyata, yaitu kemenangan yang jelas dan Nampak. Karena yang dimaksudkan dari penaklukan negeri-negeri kaum musyrikin adalah agar Agama Allah tegak dan kaum Muslimin meraih kemenangan di mana hal ini tercapai dalam kemenangan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 1: Allah memulai surat ini dengan kabar yang dikabarkan kepada Nabi ﷺ bahwa Allah menaklukkan dengan membuka dengan jelas dan nampak sebagai pemisah antara yang haq dan bathil. Yaitu sebuah perjanjian yang sempurna di Hudaibiyyah dan yang setelahnya adalah masuknya manusia dalam agama Allah secara berbondong-bondong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Habib bin Abi Tsabit ia berkata, “Aku mendatangi Abu Wa’il untuk bertanya kepadanya, lalu ia berkata, “Kami berada di Shiffin, lalu ada seorang yang berkata, “Tidakkah engkau melihat orang yang diajak kepada kitab Allah Ta’ala.” Maka Ali berkata, “Ya (aku lebih berhak kembali kepadanya).” Sahl bin Hunaif berkata (kepada orang-orang yang mengusulkan dilanjutkan peperangan), “Salahkanlah diri kamu! Sungguh, kami telah menyaksikan keadaan kami pada hari Hudaibiyah –yakni perjanjian damai yang terjadi antara Nabi shallallahu 'alaihi wa sallam dengan kaum musyrik-, kalau sekiranya kami melihat bahwa berperang (lebih baik), tentu kami melakukannya.” Kemudian (ketika itu) Umar datang dan berkata, “Bukankah kita di atas yang hak, sedangkan mereka di atas yang batil, dan bukankah orang yang terbunuh di antara kita di surga dan orang yang terbunuh di antara mereka di neraka?” Beliau menjawab, “Ya.”Ia (Umar) berkata, “Lalu mengapa kita memberikan kerendahan dalam agama kita dan kita pulang, sedangkan Allah belum memberikan keputusan di antara kita?” Beliau menjawab, “Wahai Ibnul Khaththab, sesungguhnya aku Rasulullah dan Dia tidak akan menyia-nyiakan aku selamanya.” Maka Umar kembali dalam keadaan marah, dan tidak sabar sampai ia datang kepada Abu Bakar, dan berkata, “Wahai Abu Bakar! Bukankah kita di atas yang hak, sedangkan mereka di atas yang batil?” Abu Bakar menjawab, “Wahai Ibnul Khaththab! Sesungguhnya Beliau adalah Rasulullah dan Allah tidak akan menyia-nyiakan Beliau selamanya.” Maka turunlah surah Al Fat-h. (Hadits ini diriwayatkan pula oleh Muslim, dan di sana disebutkan, “Maka turunlah Al Qur’an kepada Rasulullah shallallahu 'alaihi wa sallam, lalu Beliau mengirim seseorang kepada Umar untuk membacakan surah itu kepadanya. Maka Umar berkata, “Wahai Rasulullah, apakah itu pertanda kemenangan?” Beliau menjawab, “Ya.” Maka senanglah hatinya.) Menurut Pendapat sebagian ahli tafsir yang dimaksud dengan kemenangan itu ialah kemenangan penaklukan Mekah, dan ada yang mengatakan penaklukan negeri Rum dan ada pula yang mengatakan perdamaian Hudaibiyah. tetapi kebanyakan ahli tafsir berpendapat bahwa yang dimaksud di sini ialah perdamaian Hudaibiyah. Menurut Syaikh As Sa’diy, Kemenangan yang disebutkan ini adalah perdamaian Hudaibiyah saat orang-orang musyrik menghalangi Rasulullah shallallahu 'alaihi wa sallam datang berumrah ke Mekah, dimana hal ini berujung dengan diadakan perjanjian damai antara Beliau dengan kaum musyrik selama sepuluh tahun, dan Beliau harus berumrah pada tahun depan, dan bahwa siapa saja yang ingin masuk ke dalam ikatan dan sekutu orang-orang Quraisy silahkan masuk ke dalamnya, dan barang siapa yang ingin masuk ke dalam ikatan dan sekutu Rasulullah shallallahu 'alaihi wa sallam, maka silahkan masuk ke dalamnya. Dengan sebab itu, orang-orang merasakan kemananan dan dakwah kepada agama Allah semakin meluas, setiap mukmin dapat dengan bebas melakukannya, dan orang yang ingin mengetahui hakikat Islam dapat mengetahuinya sehingga pada masa itu banyak orang-orang yang memeluk Islam. Oleh karena itulah, Allah Subhaanahu wa Ta'aala menamainya dengan kemenangan dan menyifatinya bahwa kemenangan tersebut adalah kemenangan yang nyata, yakni jelas. Hal itu, karena maksud menaklukkan negeri-negeri orang-orang musyrik adalah untuk menguatkan agama Allah dan memenangkan kaum muslimin, dan hal ini tercapai dengannya. Dari Fath-h (kemenangan) ini, Allah Subhaanahu wa Ta'aala mewujudkan beberapa hal, firman-Nya, “Agar Allah memberikan ampunan kepadamu (Muhammad) atas dosamu yang lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan menunjukimu ke jalan yang lurus,”Hal itu –wallahu a’lam- disebabkan ketaatan yang banyak yang dihasilkannya, dan masuknya manusia ke dalam agama Allah dalam jumlah besar, dan karena Rasulullah shallallahu 'alaihi wa sallam siap memikul syarat-syarat yang tidak ada yang sabar kecuali para rasul ulul ‘azmi, dan hal ini termasuk keutamaan dan kemulian Beliau yang besar, bahkan Allah Subhaanahu wa Ta'aala telah mengampuni dosa-dosa Beliau yang lalu maupun yang akan datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 1",
    "description": "Sungguh, kami telah memberikan kepadamu kemenangan yang nyata yang tidak ada keraguan sedikitpun tentang kemenangan itu. 2-3. Agar Allah memberikan ampunan kepadamu, wahai nabi Muhammad atas dosamu, yakni kekeliruan yang dapat dianggap sebagai dosa sesuai dengan kedudukanmu yang mulia, baik kekeliruan yang terjadi di masa yang lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dengan meluhurkan agamamu dan menunjukimu ke jalan yang lurus yang membimbingmu kepada keridaan tuhan, dan agar Allah menolongmu terhadap musuh-Musuhmu dengan pertolongan yang kuat yang tidak dapat dikalahkan oleh siapa pun."
  }
]