[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang membai’atmu (wahai Nabi) di Hudaibiyah untuk berperang, hakikatnya mereka membai’at Allah, mengikrarkan akad janji kepadaNya demi mendapatkan surga dan ridha Allah. Tangan Allah di atas tangan mereka. Allah bersama mereka mendengar perkataan-perkataan mereka, melihat tempat mereka, mengetahui lahir dan batin mereka. Barangsiapa membatalkan bai’at nya, akibat buruknya hanya akan kembali kepada dirinya sendiri. Sebaliknya, barangsiapa memenuhi apa yang telah dia janjikan kepada Allah berupa kesabaran saat bertemu musuh di jalan dan menolong NabiNya, Muhammad, niscaya Allah memberinya pahala besar, yaitu surga. Dalam Ayat ini menetapkan sifat “tangan” bagi Allah sesuai dengan keagunganNya tanpa menyamakan dan menentukan bentuk dan caranya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya orang-orang yang berjanji setia kepadamu -wahai Rasul- dalam Bai’atur Riḍwān untuk memerangi penduduk Makkah yang musyrik, sesungguhnya mereka berjanji setia kepada Allah, karena Dia lah yang memerintahkan untuk memerangi kaum musyrikin dan Dia yang memberi pahala kepada mereka. Tangan Allah berda di atas tangan mereka saat berjanji setia, dan Dia mengetahui kondisi mereka, tidak ada sedikitpun yang tersembunyi bagi-Nya dari mereka. Maka barangsiapa mengingkari janjinya dan tidak menepati apa yang telah dijanjikan kepada Allah untuk menolong agama-Nya, maka sesungguhnya dampak buruk pengingkarannya terhadap janji setianya dan pengingkarannya terhadap perjanjiannya kembali kepada dirinya sendiri, sementara Allah sama sekali tidak mendapat dampak buruknya. Dan barangsiapa menepati apa yang telah dijanjikan kepada Allah untuk menolong agama-Nya, maka Allah akan memberikan kepadanya pahala yang besar, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Hai Rasulullah, orang-orang yang berbai’at kepadamu pada peristiwa Hudaibiyah untuk mendengar dan mentaatimu, sesungguhnya mereka sedang berbai’at kepada Allah dan melakukan kesepakatan yang menguntungkan dengan-Nya, demi meraih keridhaan-Nya. Tangan Allah di atas tangan mereka, Dia mengetahui perjanjian itu, maka barangsiapa yang merusak perjanjian itu maka akibatnya akan kembali pada dirinya sendiri, dan barangsiapa memenuhi perjanjian itu dengan mentaati Rasulullah maka Allah akan memuliakannya dengan surga yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّ الَّذِينَ يُبَايِعُونَكَ (Bahwasanya orang-orang yang berjanji setia kepada kamu) Yakni baiat ridwan yang terjadi di Hudaibiyah, mereka membaiat Rasulullah untuk siap mempertaruhkan nyawa, Pendapat lain mengatakan bahwa mereka membaiat untuk tidak akan lari. Dan dua pendapat ini mengarah pada satu tujuan. إِنَّمَا يُبَايِعُونَ اللهَ(sesungguhnya mereka berjanji setia kepada Allah) Karena mereka menjual diri mereka kepada Allah untuk mendapatkan surga. يَدُ اللهِ فَوْقَ أَيْدِيهِمْ ۚ( Tangan Allah di atas tangan mereka) Yakni perjanjian mereka dengan Rasulullah seperti perjanjian mereka dengan Allah, tanpa ada perbedaan. فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفْسِهِۦ ۖ (maka barangsiapa yang melanggar janjinya niscaya akibat ia melanggar janji itu akan menimpa dirinya sendiri) Yakni barangsiapa yang melanggar perjanjiannya maka sebenarnya ia merugikan dirinya sendiri karena akibatnya akan kembali pada dirinya sendiri. وَمَنْ أَوْفَىٰ بِمَا عٰهَدَ عَلَيْهُ اللهَ(dan barangsiapa menepati janjinya kepada Allah) Yakni barangsiapa menepati perjanjiannya dengan Allah dalam membaiat Rasulullah. فَسَيُؤْتِيهِ أَجْرًا عَظِيمًا (maka Allah akan memberinya pahala yang besar) Yaitu surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya orang-orang berjanji setia kepadamu dengan keridhaan wahai nabi saat perjanjian Hudaibiyah untuk tetap berjihad melawan kafir Quraisy itu juga berjanji setia kepada Allah. Berjanji kepada nabi itu layaknya berjanji kepada Allah. Tangan Allah di atas mereka. Maknanya yaitu bahwa Allah menerima janji mereka dan ini perupakan penegas bagi suatu perjanjian. Barang siapa melanggar perjanjian, maka sesungguhnya dia juga merusah dirinya sendiri. Maknanya malapetaka dan keburukan akan menimpanya. Namun orang yang setia dengan janjinya dengan tetap menatap peperangan dan tetap melawan musuh maka Allah akan memberinya pahala yang agung yaitu surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang berjanji setia kepadamu} berikar dengan ridha pada perjanjian Hudaibiyah {sesungguhnya mereka itu berjanji setia kepada Allah. Tangan Allah di atas tangan mereka. Maka siapa saja yang melanggar janji} melanggar janjiNya {maka sesungguhnya (akibat) pelanggaran itu hanya akan menimpa dirinya sendiri} kemudharatan dari pelanggaran itu akan menimpa dirinya {Siapa saja yang menepati janjinya kepada Allah, maka Dia akan menganugerahkan kepadanya pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Baiat yang diisyaratkan oleh Allah dalam ayat ini adalah Bai’at ar-Ridhwan, di mana para sahabat berbai’at setia kepada Rasulullah untuk tidak lari meninggalkan beliau. Bai’at ini adalah khusus yang diantara tuntutannya adalah agar tidak lari meski hanya sedikit yang tersisa dan meski mereka berada dalam kondisi boleh lari. Allah berfirman, “Sesungguhnya orang-orang yang berjanji setia (berbai’at) kepada kamu,” pada dasarnya mereka “berjanji setia (berbai’at) kepada Allah.” Mereka mengadakan janji setia terhadap Allah, dan begitu tegasnya hal itu hingga Allah berfirman, “Tangan Allah di atas tangan mereka.” Artinya, seolah-olah mereka membai’at Allah dan menjabat TanganNya dalam perjanjian itu. Semua penjelasan ini sebagai penegas dan penguat serta mengharuskan mereka untuk menetapinya. Karena itu Allah berfirman, “Maka barangsiapa yang melanggar janjinya,” dan tidak menepati janjinya kepada Allah, “niscaya akibat ia melanggar janji itu akan menimpa dirinya sendiri,” karena akibat buruk dari pelanggaran janji itu kembali pada mereka dan hukumannya juga akan menimpa mereka. “Dan barangsiapa menepati janjinya kepada Allah,” yakni, menepati dan melaksanakannya secara penuh, “maka Allah akan memberinya pahala yang besar,” yang besarnya hanya diketahui oleh yang memberi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 10: Ketahuilah wahai nabi Allah, bahwasanya mereka yang membaiatmu kemudian mati, mereka berada di jalan Allah mendapatkan surga-Nya dan digolongkan sebagai Syuhada yang mati di jalan Allah; sesungguhnya tidaklah mereka yang terbaik dan menepati perjanjian dengan Allah untuk taat kepadanya menjalankan perintahnya. Dan maksud dari bai'at ini adalah baiat Ridwan yang disempurnakan oleh Nabi di hudaibiyah di bawah pohon, dinamakan perjanjian atau baiat karena bertumpuknya tangan di atas tangan yang lain. Kemudian Allah menjelaskan bahwasanya barang siapa yang menyelisihi baiat ini setelah kesepakatan bersama, maka sungguh Allah akan mengadzabnya, Adapun barang siapa yang kokoh di atas perjanjiannya kepada Allah dan sabar ketika bertemu dengan musuh; maka Allah akan memberikan karunia balasan yang besar yaitu surga-Nya yang luas seluas bumi dan langit. Dan pada ayat ini menetapkan sifat tangan bagi Allah sesuai dengan kemuliaannya dengan tanpa menyerupakan dan menanyakan bagaimana nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu melakukan Bai’atur ridhwan di Hudaibiyah. Pada bulan Zulkaidah tahun keenam Hijriyyah Nabi Muhammad shallallahu 'alaihi wa sallam beserta pengikut-pengikutnya hendak mengunjungi Mekkah untuk melakukan umrah dan melihat keluarga-keluarga mereka yang telah lama ditinggalkan. Setelah sampai di Hudaibiyah beliau berhenti dan mengutus Utsman bin Affan lebih dahulu ke Mekah untuk menyampaikan maksud kedatangan Beliau dan kamu muslimin. Mereka menanti-nanti kembalinya Utsman, tetapi tidak juga datang karena Utsman ditahan oleh kaum musyrikin kemudian tersiar lagi kabar bahwa Utsman telah dibunuh. Oleh karena itu, Nabi shallallahu 'alaihi wa sallam menganjurkan agar kamu muslimin melakukan bai'at (janji setia) kepada beliau. Mereka pun mengadakan janji setia kepada Nabi shallallahu 'alaihi wa sallam, dan mereka akan memerangi kamu Quraisy bersama Nabi shallallahu 'alaihi wa sallam sampai kemenangan tercapai dan tidak akan mundur. Perjanjian setia ini telah diridhai Allah sebagaimana tersebut dalam ayat 18 surat ini, karena itu disebut Bai'atur Ridwan. Bai'atur Ridwan ini menggetarkan kaum musyrikin, sehingga mereka melepaskan Utsman dan mengirim utusan untuk mengadakan perjanjian damai dengan kaum muslimin. Perjanjian ini terkenal dengan Shulhul Hudaibiyah. Orang yang berjanji setia biasanya berjabatan tangan. Cara berjanji setia dengan Rasul ialah meletakkan tangan Rasul di atas tangan orang yang berjanji itu. Maksud tangan Allah di atas mereka ialah bahwa mereka seakan-akan membai’at Allah, dan bahwa berjanji dengan Rasulullah sama dengan berjanji dengan Allah yang mengharuskan untuk dipenuhi. Hendaklah diperhatikan bahwa Allah Mahasuci dari segala sifat-sifat yang menyerupai makhluk-Nya. Karena akibat dan hukumannya kembali kepada dirinya. Dimana besar dan ukurannya tidak diketahui kecuali oleh Allah yang memberikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 10",
    "description": "Bahwa orang-orang yang berjanji setia kepadamu, wahai nabi Muhammad, sesungguhnya mereka pada hakikatnya hanya berjanji setia kepada Allah. Karena tujuan berjanji setia kepada rasul adalah untuk menaati perintah Allah. Tangan Allah, yakni kekuasaan-Nya, di atas tangan-tangan mereka, dia akan menolong orang yang berjanji itu dalam melaksanakan janjinya. Maka barangsiapa melanggar janji yang telah diucapkan kepada nabi maka sesungguhnya dia melanggar atas janji sendiri, dan akibat pelanggaran itu akan menimpa diri sendiri; dan barangsiapa menepati janjinya kepada Allah, dan menunaikannya dengan sempurna, maka dia akan memberinya pahala yang besar, yaitu surga. 11. Orang-orang badui yang tertinggal di madinah, yaitu mereka yang tidak turut serta bersama nabi pergi ke hudaibiyah, akan berbohong dan berkata kepadamu, wahai nabi Muhammad, 'kami telah disibukkan oleh upaya memelihara harta dan keluarga kami, jika kami pergi maka harta kami akan lenyap dan keluarga kami akan terlantar. Maka mohonkanlah ampunan untuk kami atas kesalahan kami. ' menanggapi kebohongan itu, Allah menegaskan bahwa mereka mengucapkan sesuatu dengan mulutnya apa yang tidak ada dalam hatinya. Bahwa alasan mere-ka tidak ikut pergi ke hudaibiyah adalah alasan yang dibuat-buat saja. Maka katakanlah kepada mereka yang berbohong itu, 'maka siapa-kah yang dapat menghalang-halangi kehendak Allah jika dia menghendaki bencana terhadap kamu, dengan melenyapkan hartamu dan membinasakan keluargamu, atau jika dia menghendaki keuntungan bagimu, de-ngan menyelamatkan hartamu dan keluagamu, walaupun kamu tidak menjaganya secara langsung' sungguh, Allah mahateliti dengan apa yang kamu kerjakan. ' dia mengetahui bahwa alasan yang kamu yang kamu nyatakan itu adalah kebohongan belaka sebagai dalih untuk mengelak dari kecaman."
  }
]