[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan berkata kepadamu (wahai Nabi) orang-orang yang menolak berangkat bersamamu ke makkah dari kalangan orang-orang Arab Badui, jika kamu menegur mereka, “Harta dan keluarga kami telah menyibukkan kami. Mintalah ampunan kepada Tuhanmu untuk kami atas ketertinggalan kami.” Mereka mengucapkannya dengan lisan mereka tanpa diyakini oleh hati mereka. Katakanlah kepada mereka, “Siapa yang memiliki kesanggupan untuk melindungi kalian dari Allah bila Allah menginginkan keburukan atau kebaikan atas kalian?” perkaranya tidak sebagaimana yang dikira oleh orang-orang munafik itu, bahwa Allah tidak mengetahui apa yang mereka simpan dalam dada mereka, yaitu kemunafikan, sebaliknya Allah Mahateliti terhadap apa yang mereka kerjakan, tidak ada sedikitpun dari amal-amal makhlukNya yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Orang-orang Badui tidak ikut menemani perjalananmu ke Mekah akan berkata kepadamu -wahai Rasul- jika kamu menghardik mereka, “Tugas menjaga harta dan anak-anak kami telah melalaikan kami dari keluar untuk berjuang bersamamu, maka mohonkan ampunan dari Allah bagi kami terkait dosa-dosa kami.” Mereka berkata dengan lisan mereka apa yang tidak ada di dalam hati mereka berupa permintaan ampunan Nabi -ṣallallāhu 'alaihi wa sallam- untuk mereka, karena mereka tidak bertobat dari dosa-dosa mereka. Katakan kepada mereka, “Tidak ada seorangpun yang mampu menghalangi dari kalian apabila Allah menghendaki kebaikan untuk kalian atau menghendaki keburukan untuk kalian, bahkan Allah Maha Mengetahui apa yang kalian kerjakan, tidak ada sedikitpun dari amal perbuatan kalian yang luput dari-Nya meski kalian menyembunyikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah memberi peringatan kepada Rasulullah dari tipu daya orang-orang munafik yang tidak ikut pergi bersamanya ke Hudaibiyah, mereka berkata: “Kami disibukkan urusan harta dan keluarga sehingga tidak dapat pergi bersamamu, maka mohonkanlah ampunan dari Allah bagi kami.” Mereka mengatakan hal yang bertentangan dengan kedustaan yang mereka sembunyikan. Hai Rasulullah, katakanlah kepada mereka: “Siapa yang dapat melindungi kalian jika Allah menetapkan keburukan atau kebaikan bagi kalian? Hal yang sebenarnya bukan seperti yang kalian katakan, dan Allah Maha Melihat keburukan dan aib kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الْأَعْرَابِ (Orang-orang Badwi yang tertinggal (tidak turut ke Hudaibiyah) akan mengatakan) Mereka adalah orang-orang yang tidak dikehendaki Allah untuk ikut pergi bersama Rasulullah pada saat terjadinya baiat Hudaibiyah; mereka adalah sebagian orang badui yang tinggal di sekitar Madinah. شَغَلَتْنَآ أَمْوٰلُنَا وَأَهْلُونَا(“Harta dan keluarga kami telah merintangi kami) Yakni harta, istri, dan anak-anak kami menghalangi kami untuk pergi bersamamu, sebab tidak ada yang menggantikan kami untuk mengurus mereka. فَاسْتَغْفِرْ لَنَا ۚ( maka mohonkanlah ampunan untuk kami) Agar Allah mengampuni kami yang telah berhalangan untuk ikut bersamamu karena hal tersebut. يَقُولُونَ بِأَلْسِنَتِهِم مَّا لَيْسَ فِى قُلُوبِهِمْ ۚ( mereka mengucapkan dengan lidahnya apa yang tidak ada dalam hatinya) Ini merupakan perbuatan orang-orang munafik. قُلْ فَمَن يَمْلِكُ لَكُم مِّنَ اللهِ شَيْـًٔا(Katakanlah: “Maka siapakah (gerangan) yang dapat menghalang-halangi kehendak Allah) Yakni siapa yang dapat melindungi kalian dari kebaikan atau keburukan yang dikehendaki Allah bagi kalian. إِنْ أَرَادَ بِكُمْ ضَرًّا (jika Dia menghendaki kemudharatan bagimu) Yakni menurunkan kemudharatan bagi kalian seperti harta yang hilang atau meninggalnya keluarga. أَوْ أَرَادَ بِكُمْ نَفْعًۢا ۚ( atau jika Dia menghendaki manfaat bagimu) Yakni memberi kemenangan atau harta ghanimah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Orang-orang Baduwi di sekitar Madinah yang tidak ikut denganmu menuju perjanjian Hudaibiyah atau menuju Mekah untuk umrah, yaitu orang Islam dari kabilah Juhainah, Ghifar, Asyja’ dan Dzayyal itu beralasan sibuk dengan urusan harta dan keluarga mereka yaitu istri dan anak mereka sehingga tidak bisa keluar mengikutimu. Mereka akan berkata kepadamu wahai Rasulallah: “Tidak ada yang menjaga mereka (harta dan keluarga kami) jadi mintakanlah ampun kepada Allah untuk kami karena tidak dapat ikut denganmu” Kemudian Allah mengabaikan permohonan ampun mereka. Sesungguhnya mereka mengatakan hal itu hanya dengan lisan mereka dan tidak mengatakan yang sebenarnya sesuai yang ada dalam hati mereka, yaitu suatu kepura-puraan. Maka katakanlah wahai nabi: “Lalu siapa yang akan mencegah apa yang dikehendaki Allah untuk kalian baik itu kebaikan atau keburukan? Maknanya tidak ada satupun yang dapat menghalang-halangi kehendakNya bagi kalian, jika itu berupa kemudharatan bagi kalian yang lebih memilih keluarga, harta benda dan diri sendiri. Kemudharatan itu bisa jadi pembunuhan, kehancuran, keadaan buruk dan kehilangan. Atau jika Allah menghendaki kemanfaatan kalian dengan melindungi diri harta benda dan keluarga kalian, memudahkan kalian untuk mendapatkan harta dari rampasan perang atau mewujudkan kemenangan atas pertolonganNya, namun Allah adalah Dzat yang Maha Membeitahu tentang amal ibadah kalian. Tidak ada yang dapat disembunyikan dariNya”. FirmanNya {faman yamliku} adalah istifham yang bermakna nafi. Maknanya tidak ada yang menghalang-halangi untuk kalian. {Bal} berfungsi untuk berpindah dari suatu perkara ke perkara lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ditinggalkan} orang-orang yang tertinggal untuk keluar bersamamu menuju Mekkah dari golongan orang Arab Badui} orang Badui {akan berkata kepadamu,“Kami telah disibukkan oleh harta dan keluarga kami, maka mohonkanlah ampunan untuk kami” Mereka mengucapkan dengan mulut mereka tentang apa yang tidak ada dalam hati mereka. Katakanlah,“Siapakah yang mampu menghalangi Allah jika Dia menghendaki kemudharat atau menghendaki manfaat bagi kalian {Bahkan Allah Maha Mengetahui apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mencela mereka yang tidak ikut jihad bersama Rasulullah dari kalangan orang-orang pedalaman (badui), mereka yang imannya lemah, di hati mereka terdapat penyakit dan berburuk sangka terhadap Allah, dimana mereka akan datang mengajukan alasan, yaitu alasan harta dan keluarga mereka menyibukkan mereka untuk pergi berjihad di jalan Allah. Mereka juga mengharap supaya Rasulullah memintakan ampunan untuk mereka, Allah berfirman, “Mereka mengucapkan dengan lidahnya apa yang tidak ada dalam hatinya.” Karena permintaan istigfar mereka dari Rasulullah menunjukkan penyesalan mereka serta mereka mengakui dosa mereka, perbuatan mereka yang tidak mengikuti jihad itu memerlukan taubat dan istigfar. Andai saja hal itu terdapat dalam hati mereka, tentu istigfar yang dilakukan Rasulullah bermanfaat bagi mereka, karena mereka bertaubat dan kembali kepada Allah, namun adanya mereka tidak ikut pergi jihad adalah karena berburuk sangka terhadap Allah, mereka mengira, “bahwa Rasul dan orang-orang Mukmin sekali-sekali tidak akan kembali kepada keluarga mereka selama-lamanya.” Artinya, mereka akan terbunuh. Dugaan ini tetap menghiasi hati mereka, hati mereka juga tenang dengan dugaan itu hingga menguat. Hal itu disebabkan oleh dua hal: Pertama, karena mereka adalah “kaum yang binasa,” artinya kaum yang celaka, yang tidak ada kebaikannya. Andai saja pada diri mereka terdapat kebaikan, tentu penyakit ini tidak terdapat dalam hati mereka. Kedua, lemahnya keimanan serta keyakinan mereka terhadap janji Allah serta tiidak menolong agamaNya dan menjunjung kalimatNya. Karena itulah Allah berfirman, “Dan barangsiapa yang tidak beriman kepada Allah dan RasulNya,” artinya, maka ia adalah orang kafir yang berhak menerima azab. “Maka sesungguhnya Kami menyediakan untuk orang-orang yang kafir neraka yang bernayala-nyala.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 11: Allah mengabarkan kepada nabinya bahwasanya akan ada manusia yang menyelisihi beliau, yaitu keluar bersamamu wahai nabi Allah yang meminta udzur yang bohong; Di mana mereka akan berkata kepadamu: Kami tidak akan menyelisihi mu karena sebab kami memilih urusan yang menyibukkan kami dari harta harta kami dan keluarga kami; kemudian mereka meminta dari nabi agar nabi memohonkan ampun kepada Allah atas dosa ini, kemudian Allah menjelaskan bahwasanya mereka yang berkata ini hanyalah menipu dan memiliki kemunafikan, dan tidak ada kebenaran dalam hatinya, maka katakan kepada mereka wahai nabi Allah : Maka siapakah yang akan menghalangi kehendak Allah kepada kalian jika Allah berkehendak kepada kalian keburukan atau kebaikan ?, dan ketahuilah oleh kalian bahwasanya Allah Maha Mengetahui rahasia-rahasia kalian atas apa apa yang kalian sembunyikan; tidaklah tersembunyi bagi Allah sesuatupun atas amalan-amalan makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mencela orang-orang yang meninggalkan Rasul-Nya dalam berjihad fii sabilillah dari kalangan orang-orang Arab badui yang lemah imannya, dimana dalam hati mereka ada penyakit, prsangka yang buruk kepada Allah Ta’ala, dan bahwa mereka akan meminta uzur kepada Nabi shallallahu 'alaihi wa sallam, bahwa harta dan keluarga mereka membuat mereka sibuk sehingga tidak dapat ikut berjihad, dan bahwa mereka akan meminta agar Rasulullah shallallahu 'alaihi wa sallam memintakan ampunan untuk mereka. Yang tinggal di sekitar Madinah. Sehingga tidak bisa ikut bersamamu. Yakni mereka dusta dalam ucapannya, karena permintaan mereka agar Rasulullah shallallahu 'alaihi wa sallam memintakan ampunan untuk mereka seharusnya menunjukkan mereka menyesal, dan mengakui bahwa mereka berdosa, dan bahwa mereka telah melakukan perbuatan yang butuh diiringi dengan tobat dan istighfar. Kalau seandainya seperti ini yang ada dalam hati mereka, tentu istighfar Rasulullah shallallahu 'alaihi wa sallam bermanfaat bagi mereka, karena mereka telah bertobat dan kembali, akan tetapi yang ada dalam hati mereka adalah bahwa mereka tidak ikut itu karena mereka berprasangka buruk kepada Allah. Mereka menyangka, bahwa Rasulullah shallallahu 'alaihi wa sallam dan kaum mukmin tidak akan kembali lagi setelah itu kepada keluarganya selama-lamanya karena terbunuh, dan sangkaan ini telah terhias dalam diri mereka sehingga mereka tetap tidak mau ikut dengan Rasulullah shallallahu 'alaihi wa sallam dan kaum mukmin. Sebabnya adalah karena dua hal: Pertama, mereka adalah kaum yang binasa, yakni tidak ada kebaikannya. Jika ada kebaikan dalam hati mereka, tentu tidak akan ada seperti ini dalam hati mereka. Kedua, lemahnya iman dan keyakinan mereka terhadap janji Allah, yaitu bahwa Dia akan memenangkan agama-Nya dan akan meninggikan kalimat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 11",
    "description": "Orang-orang badui yang tertinggal di madinah, yaitu mereka yang tidak turut serta bersama nabi pergi ke hudaibiyah, akan berbohong dan berkata kepadamu, wahai nabi Muhammad, 'kami telah disibukkan oleh upaya memelihara harta dan keluarga kami, jika kami pergi maka harta kami akan lenyap dan keluarga kami akan terlantar. Maka mohonkanlah ampunan untuk kami atas kesalahan kami. ' menanggapi kebohongan itu, Allah menegaskan bahwa mereka mengucapkan sesuatu dengan mulutnya apa yang tidak ada dalam hatinya. Bahwa alasan mere-ka tidak ikut pergi ke hudaibiyah adalah alasan yang dibuat-buat saja. Maka katakanlah kepada mereka yang berbohong itu, 'maka siapa-kah yang dapat menghalang-halangi kehendak Allah jika dia menghendaki bencana terhadap kamu, dengan melenyapkan hartamu dan membinasakan keluargamu, atau jika dia menghendaki keuntungan bagimu, de-ngan menyelamatkan hartamu dan keluagamu, walaupun kamu tidak menjaganya secara langsung' sungguh, Allah mahateliti dengan apa yang kamu kerjakan. ' dia mengetahui bahwa alasan yang kamu yang kamu nyatakan itu adalah kebohongan belaka sebagai dalih untuk mengelak dari kecaman. 12. Sebenarnya tidak ikut sertanya kamu pergi ke mekah bukan karena sebab yang kamu nyatakan. Sesungguhnya kamu menyangka akan terjadi peperangan, bahkan semula kamu menyangka bahwa rasul dan orang-orang mukmin sekali-kali tidak akan kembali lagi kepada keluarga mereka di madinah selama-lamanya, karena terbunuh dalam peperang-an dengan orang-orang musyrik di mekah. Sangkaan itu keliru dan dijadikan oleh setan terasa indah yang demikian itu di dalam hatimu, sehingga kamu memandangnya benar. Kamu menyangka bahwa rasul dan orang-orang mukmin akan terbunuh dalam peperangan dengan orang-orang musyrik dan kamu, dengan sangkaan yang demikian itu, telah berprasangka dengan prasangka yang buruk, karena itu kamu menjadi kaum yang binasa, bejat hatinya dan tidak pantas untuk memperoleh kebaikan."
  }
]