[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah benar sebagaimana yang kalian klaim, yaitu karena kesibukan kalian dengan harta dan keluarga kalian, akan tetapi sebaliknya kalian mengira bahwa rasulullah dan para sahabat yang bersamanya akan binasa, tidak pulang kepada kalian selamanya. Setan membaguskan hal itu dalam hati kalian. Kalian menduga dengan dugaan buruk bahwa Allah tidak akan menolong hambaNya, Muhammad dan para sahabatnya atas musuh-musuh mereka. Kalian memang orang-orang celaka yang tidak ada kebaikan pada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Apa yang kalian jadikan alasan berupa kesibukan menjaga harta dan anak-anak bukanlah sebab dari ketertinggalan kalian untuk keluar bersama Nabi, justru kalian mengira bahwa Rasul dan para shahabat akan binasa semuanya dan tidak kembali kepada keluarganya di Madinah. Setan telah menjadikan hal itu indah di hati kalian, kalian telah berprasangka buruk terhadap Rabb kalian bahwa Dia tidak akan menolong Nabi-Nya, dan kalian menjadi kaum yang binasa karena keberanian kalian berprasangka buruk terhadap Allah dan tidak mau keluar bersama Rasul-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah membongkar apa yang disembunyikan orang-orang munafik: “Bahkan kalian mengira Rasulullah dan para sahabatnya tidak akan kembali pulang ke Madinah dalam keadaan hidup, dan setan telah menghiasi prasangka buruk yang ada dalam diri kalian itu, dan kalian juga berprasangka buruk terhadap Allah bahwa Dia tidak akan menolong Rasulullah. Sungguh kalian adalah kaum yang akan binasa akibat prasangka buruk itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. بَلْ ظَنَنتُمْ أَن لَّن يَنقَلِبَ الرَّسُولُ وَالْمُؤْمِنُونَ إِلَىٰٓ أَهْلِيهِمْ أَبَدًا (Tetapi kamu menyangka bahwa Rasul dan orang-orang mukmin tidak sekali-kali akan kembali kepada keluarga mereka selama-lamanya) Namun kalian mengira musuh akan membinasakan semua orang-orang beriman sehingga tidak ada yang akan kembali kepada keluarganya, oleh sebab itu kalian enggan untuk ikut pergi, dan bukan karena alasan-alasan palsu yang telah kalian sebutkan sebelumnya. وَزُيِّنَ ذٰلِكَ فِى قُلُوبِكُمْ(dan syaitan telah menjadikan kamu memandang baik dalam hatimu persangkaan itu) Yakni setan menghiasi prasangka yang ada di dalam hati kalian, lalu kalian menerimanya. وَظَنَنتُمْ ظَنَّ السَّوْءِ(dan kamu telah menyangka dengan sangkaan yang buruk) Yakni mereka mengira Allah tidak akan menolong rasul-Nya. وَكُنتُمْ قَوْمًۢا بُورًا (dan kamu menjadi kaum yang binasa) Yakni orang-orang yang binasa di sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Bahkan kalian menyangka wahai orang-orang munafik bahwa rasulallah dan orang-orang mukmin tidak akan pernah kembali ke negeri dan keluarga mereka, yaitu keluarga dan kerabat mereka selamanya, dan juga berharap mereka ditaklukkan oleh orang-orang musyrik. Setan menghiasi hati-hati kalian untuk mencegah kalian agar tidak keluar berperang. Kalian berprasangka buruk sebagaimana yang disebutkan bahwa mustahil Allah menyelamatkan rasulNya. Di sisi Allah kalian adalah kaum yang akan dikancurkan karena prasangka ini, kalian berakidah rusak dan berniat busuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan kalian menyangka bahwa Rasul dan orang-orang mukmin tidak akan kembali} kembali {lagi kepada keluarga mereka selama-lamanya, dan dijadikan terasa indah yang demikian itu di dalam hatimu. Kalian telah berprasangka buruk. Maka kalian menjadi kaum yang binasa} binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mencela mereka yang tidak ikut jihad bersama Rasulullah dari kalangan orang-orang pedalaman (badui), mereka yang imannya lemah, di hati mereka terdapat penyakit dan berburuk sangka terhadap Allah, dimana mereka akan datang mengajukan alasan, yaitu alasan harta dan keluarga mereka menyibukkan mereka untuk pergi berjihad di jalan Allah. Mereka juga mengharap supaya Rasulullah memintakan ampunan untuk mereka, Allah berfirman, “Mereka mengucapkan dengan lidahnya apa yang tidak ada dalam hatinya.” Karena permintaan istigfar mereka dari Rasulullah menunjukkan penyesalan mereka serta mereka mengakui dosa mereka, perbuatan mereka yang tidak mengikuti jihad itu memerlukan taubat dan istigfar. Andai saja hal itu terdapat dalam hati mereka, tentu istigfar yang dilakukan Rasulullah bermanfaat bagi mereka, karena mereka bertaubat dan kembali kepada Allah, namun adanya mereka tidak ikut pergi jihad adalah karena berburuk sangka terhadap Allah, mereka mengira, “bahwa Rasul dan orang-orang Mukmin sekali-sekali tidak akan kembali kepada keluarga mereka selama-lamanya.” Artinya, mereka akan terbunuh. Dugaan ini tetap menghiasi hati mereka, hati mereka juga tenang dengan dugaan itu hingga menguat. Hal itu disebabkan oleh dua hal: Pertama, karena mereka adalah “kaum yang binasa,” artinya kaum yang celaka, yang tidak ada kebaikannya. Andai saja pada diri mereka terdapat kebaikan, tentu penyakit ini tidak terdapat dalam hati mereka. Kedua, lemahnya keimanan serta keyakinan mereka terhadap janji Allah serta tiidak menolong agamaNya dan menjunjung kalimatNya. Karena itulah Allah berfirman, “Dan barangsiapa yang tidak beriman kepada Allah dan RasulNya,” artinya, maka ia adalah orang kafir yang berhak menerima azab. “Maka sesungguhnya Kami menyediakan untuk orang-orang yang kafir neraka yang bernayala-nyala.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 12: Allah mengabarkan bahwasanya urusannya tidak sebagaimana yang kalian klaim dan penjelasan kalian dalam minta udzur bukanlah karena tersibukkannya diri kalian atas harta harta dan anak-anak kalian (orang-orang munafik), akan tetapi hakikat urusan kalian: Bahwasanya kalian menyangka dengan sangkaan yang buruk; Dimana kalian menyangka bahwasanya musuh akan mengalahkan Rasulullah dan siapa yang bersamanya dari orang-orang yang beriman. Maka janganlah kalian menyangka demikian, sungguh setan telah membuat indah sangkaan kalian dalam hati-hati kalian sampai kalian menyangka demikian, dan sungguh kalian adalah kaum yang celaka, yang fasik, yang tidak ada kebaikan pada diri kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena terbunuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 12",
    "description": "Sebenarnya tidak ikut sertanya kamu pergi ke mekah bukan karena sebab yang kamu nyatakan. Sesungguhnya kamu menyangka akan terjadi peperangan, bahkan semula kamu menyangka bahwa rasul dan orang-orang mukmin sekali-kali tidak akan kembali lagi kepada keluarga mereka di madinah selama-lamanya, karena terbunuh dalam peperang-an dengan orang-orang musyrik di mekah. Sangkaan itu keliru dan dijadikan oleh setan terasa indah yang demikian itu di dalam hatimu, sehingga kamu memandangnya benar. Kamu menyangka bahwa rasul dan orang-orang mukmin akan terbunuh dalam peperangan dengan orang-orang musyrik dan kamu, dengan sangkaan yang demikian itu, telah berprasangka dengan prasangka yang buruk, karena itu kamu menjadi kaum yang binasa, bejat hatinya dan tidak pantas untuk memperoleh kebaikan. 13. Dan barang siapa tidak beriman kepada Allah dan rasul-Nya, tidak membenarkan perkataan Allah dan rasul-Nya dan tidak beramal se-suai dengan perintah Allah dan rasul-Nya, maka sesungguhnya kami telah menyediakan untuk orang-orang kafir itu neraka yang menyala-Nyala sebagai balasan atas kekafirannya. Dan barang siapa yang beriman secara benar kepada Allah dan rasul-Nya, maka Allah menyediakan untuknya pahala yang besar."
  }
]