[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "barangsiapa tidak membenarkan Allah dan apa yang dibawa oleh Rasulullah, serta tidak mengamalakn syariatNya, maka sesungguhnya dia adalah kafir dan berhak untuk diazab. Sesungguhnya Kami menyiapkan azab yang membakar di neraka bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan barangsiapa tidak beriman kepada Allah dan Rasul-Nya, maka ia adalah orang kafir. Dan Kami telah menyiapkan bagi orang-orang kafir kepada Allah pada hari Kiamat neraka yang menyala, mereka disiksa di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan barangsiapa yang tidak beriman kepada Allah dan rasul-Nya dengan keimanan yang dibuktikan dengan perkataan dan ketaatan, maka Kami telah menyiapkan azab yang membara di neraka Jahannam bagi orang-orang yang mendustakan Allah dan Rasul-Nya dari kalangan munafiqin dan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَمَن لَّمْ يُؤْمِنۢ بِاللهِ وَرَسُولِهِۦ فَإِنَّآ أَعْتَدْنَا لِلْكٰفِرِينَ سَعِيرًا (Dan barangsiapa yang tidak beriman kepada Allah dan Rasul-Nya maka sesungguhnya Kami menyediakan untuk orang-orang yang kafir neraka yang bernyala-nyala) Yakni barangsiapa yang tidak beriman kepada Allah dan rasul-Nya sebagaimana yang dilakukan oleh orang-orang munafik, maka balasan bagi mereka adalah azab neraka yang bergejolak yang telah disiapkan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Barangsiapa tidak beriman kepada Allah dan rasulallah dan menyembunyikan kemunafikan dan keragu-raguan atas pertolongan Allah kepada hamba-hambaNya yang mukmin, maka kami akan menyiapkan neraka yang menyala-nyala dan sangat membara bagi orang-orang kafir itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa yang tidak beriman kepada Allah dan RasulNya, sesungguhnya Kami telah menyediakan} Kami telah mempersiapkan {untuk orang-orang kafir itu neraka Sa‘ir} neraka yang menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-13. Allah mencela mereka yang tidak ikut jihad bersama Rasulullah dari kalangan orang-orang pedalaman (badui), mereka yang imannya lemah, di hati mereka terdapat penyakit dan berburuk sangka terhadap Allah, dimana mereka akan datang mengajukan alasan, yaitu alasan harta dan keluarga mereka menyibukkan mereka untuk pergi berjihad di jalan Allah. Mereka juga mengharap supaya Rasulullah memintakan ampunan untuk mereka, Allah berfirman, “Mereka mengucapkan dengan lidahnya apa yang tidak ada dalam hatinya.” Karena permintaan istigfar mereka dari Rasulullah menunjukkan penyesalan mereka serta mereka mengakui dosa mereka, perbuatan mereka yang tidak mengikuti jihad itu memerlukan taubat dan istigfar. Andai saja hal itu terdapat dalam hati mereka, tentu istigfar yang dilakukan Rasulullah bermanfaat bagi mereka, karena mereka bertaubat dan kembali kepada Allah, namun adanya mereka tidak ikut pergi jihad adalah karena berburuk sangka terhadap Allah, mereka mengira, “bahwa Rasul dan orang-orang Mukmin sekali-sekali tidak akan kembali kepada keluarga mereka selama-lamanya.” Artinya, mereka akan terbunuh. Dugaan ini tetap menghiasi hati mereka, hati mereka juga tenang dengan dugaan itu hingga menguat. Hal itu disebabkan oleh dua hal: Pertama, karena mereka adalah “kaum yang binasa,” artinya kaum yang celaka, yang tidak ada kebaikannya. Andai saja pada diri mereka terdapat kebaikan, tentu penyakit ini tidak terdapat dalam hati mereka. Kedua, lemahnya keimanan serta keyakinan mereka terhadap janji Allah serta tiidak menolong agamaNya dan menjunjung kalimatNya. Karena itulah Allah berfirman, “Dan barangsiapa yang tidak beriman kepada Allah dan RasulNya,” artinya, maka ia adalah orang kafir yang berhak menerima azab. “Maka sesungguhnya Kami menyediakan untuk orang-orang yang kafir neraka yang bernayala-nyala.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 13: Ketahuilah Wahai Manusia bahwasanya barangsiapa yang tidak beriman kepada Allah dan hari akhir, membenarkan utusannya dengan apa yang didatangkan kepadanya; Maka dia telah kafir dan berhak untuk mendapatkan azab Allah dengan adzab yang pedih di neraka yang menyala-nyala apinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 13",
    "description": "Dan barang siapa tidak beriman kepada Allah dan rasul-Nya, tidak membenarkan perkataan Allah dan rasul-Nya dan tidak beramal se-suai dengan perintah Allah dan rasul-Nya, maka sesungguhnya kami telah menyediakan untuk orang-orang kafir itu neraka yang menyala-Nyala sebagai balasan atas kekafirannya. Dan barang siapa yang beriman secara benar kepada Allah dan rasul-Nya, maka Allah menyediakan untuknya pahala yang besar. 14. Dan hanya milik Allah kerajaan langit dan bumi. Dia memeliharanya dan mengaturnya sesuai ketentuan-Nya. Dia mengampuni siapa yang dia kehendaki, tanpa ada yang menghalangi kehendak-Nya dan akan mengazab siapa yang dia kehendaki, tanpa ada siapa pun yang dapat menolaknya. Dan Allah senatiasa maha pengampun lagi maha penyayang kepada orang yang mau bertobat dan kembali kepada-Nya."
  }
]