[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah kerajaan langit dan bumi serta apa yang ada pada keduanya. Dia memaafkan dengan rahmatNya siapa yang di kehendaki lalu menutupi dosanya, dan mengazab dengan keadilan-Nya siapa yang Dia kehendaki. Allah Maha Pengampun bagi siapa yang bertaubat kepadaNya lagi Maha Penyayang kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan hanya milik Allah sajalah kerajaan langit dan kerajaan bumi, Dia mengampuni dosa-dosa siapa yang dikehendaki-Nya dari hamba-hamba-Nya dan memasukkannya ke dalam Surga dengan anugerah-Nya, dan Dia menyiksa siapa yang dikehendaki-Nya dari hamba-hamba-Nya dengan keadilan-Nya. Dan Allah Maha Pengampun dosa-dosa orang yang bertobat dari hamba-hamba-Nya sebagai bentuk kasih sayang-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Hanya milik Allah kerajaan tujuh langit dan bumi, Dia dengan rahmat-Nya mengampuni hamba-hamba-Nya yang beriman dan bertaubat, dan dengan keadilan-Nya mengazab orang-orang yang kafir dan munafik. Allah Maha Mengampuni dan Mengasihi hamba-hamba-Nya yang bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Hanya milik Allah langit dan bumi itu. Dia mengatur dan menyusunnya sesuai kehendakNya. Dia mengampuni (menutupi) dosa-dosa orang yang dikehendaki dan mengazab orang yang dikehendaki juga dengan keadilanNya. Allah adalah Dzat yang Maha luas ampunanNya dan selalu diberikan kepada setiap orang yang bertaubat dan pasrah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Milik Allahlah kerajaan langit dan bumi. Dia mengampuni siapa saja yang Dia kehendaki dan mengazab siapa saja yang Dia kehendaki. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Artinya, hanya Allah semata pemilik kerajaan langit dan bumi. Semua hukum takdir, syariat, dan balasan diberlakukan Allah kepada langit dan bumi sesuai kehendakNYa, karena itulah Allah menyebutkan hukum balasan sebagai akibat dari hukum syariat seraya berfirman, “Dia memberi ampun kepada siapa yang dikehendakiNya,” bagi orang yang melaksanakan perintah Allah, “dan mengazab siapa yang dikehendakiNya,” bagi orang yang meremehkan perintah Allah. “Dan Allah Maha Pengampun lagi Maha Penyayang,” artinya, itulah sifat yang melekat pada Allah, memberikan ampunan dan rahmat dan tidak pernah terlepas dariNya. Allah senantiasa memberikan ampunan bagi para pendosa kapan pun juga, memaafkan mereka yang banyak memiliki kesalahan, menerima taubat orang-orang yang kembali padaNya, serta menurunkan kebaikanNya di malam dan di siang hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 14: Ketahuilah Bahwasanya Allah saja yang memiliki kerajaan di langit maupun di bumi, dan apa yang ada pada keduanya, Allah menghukumi keduanya dengan apa yang Allah inginkan, maka Allah mengampuni bagi siapa yang mentauhidkan Allah dan beriman kepada-Nya, dan mengadzab bagi siapa yang kufur serta bermaksiat kepadanya. Dialah Allah yang memiliki banyak ampunan bagi hamba-Nya yang berdosa, yang telah bertaubat dan yang memiliki banyak rahmat kepada hamba-Nya yang memohon ampun kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala yang sendiri memiliki kerajaan langit dan bumi, Dia bertindak pada keduanya dengan apa yang Dia kehendaki berupa hukum-hukum qadari, hukum-hukum syar’i, dan hukum-hukum jaza’i (balasan). Oleh karena itu, Dia menyebutkan hukum jaza’i terhadap hukum-hukum syar’i-Nya, firman-Nya, “Dia mengampuni siapa yang Dia kehendaki,” yaitu orang yang mengerjakan perintah Allah. Firman-Nya, “dan akan mengazab siapa yang Dia kehendaki,” yaitu orang yang meremehkan perintah Allah. Sifat-Nya mengampuni dan menyayangi senantiasa melekat pada-Nya dan tidak akan lepas. Oleh karena itu, Dia senantiasa di setiap waktu mengampuni orang-orang yang bersalah dan memaafkan kesalahan orang-orang yang berdosa, menerima tobat orang-orang yang bertobat, menurunkan kebaikan-Nya yang berlimpah di malam dan siang hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 14",
    "description": "Dan hanya milik Allah kerajaan langit dan bumi. Dia memeliharanya dan mengaturnya sesuai ketentuan-Nya. Dia mengampuni siapa yang dia kehendaki, tanpa ada yang menghalangi kehendak-Nya dan akan mengazab siapa yang dia kehendaki, tanpa ada siapa pun yang dapat menolaknya. Dan Allah senatiasa maha pengampun lagi maha penyayang kepada orang yang mau bertobat dan kembali kepada-Nya. 15. Apabila kamu wahai nabi Muhammad, berangkat menuju ke khaibar bersama-sama dengan rombongan yang pergi ke hudaibiyah untuk mengambil barang rampasan, orang-orang badui yang tertinggal di madinah itu akan berkata, 'biarkanlah kami mengikuti kamu untuk mengambil harta rampasan itu. ' mereka hendak mengubah janji Allah, bahwa harta rampasan perang di khaibar hanya diperuntukkan bagi rombongan yang ikut ke hudaibiyah. Katakanlah, wahai nabi Muhammad, 'kamu, wahai orang-orang badui yang tidak ikut pergi ke hudaibiyah, sekali-kali tidak boleh mengikuti kami untuk mengambil harta rampasan di khaibar. Demikianlah ketentuan yang telah ditetapkan Allah sejak semula, yakni sejak lama sebelum diucapkan permintaanmu untuk pergi bersama kami. Mendengar keputusan itu maka mereka akan berkata, 'itu bukan keputusan Allah, melainkan kehendakmu. Sebenarnya kamu dengki kepada kami, kalau kami memperoleh harta rampasan itu. ' bukan karena kedengkian, melainkan karena mereka tidak mengerti perkara agama atau latar belakang keputusan itu melainkan sedikit sekali. Kalau mereka mengetahuinya niscaya mereka tidak mengatakan kepada rasul ucapan yang demikian itu."
  }
]