[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang tidak berangkat berjihad akan berkata kepadamu (wahai Nabi) manakala kamu dan para sahabatmu berangkat untuk mengambil harta rampasan Perang Khaibar yang telah Allah janjikan kepada kalian, “Izinkanlah kami bersama kalian ke Khaibar.” Mereka hendak merubah janji Allah kepada kalian. Katakanlah kepada mereka, “Kalian tidak boleh ikut (berangkat) bersama Kami ke Khaibar, karena Allah telah berfirman kepada kami sebelum kami pulang ke Madinah bahwa harta rampasan perang Khaibar hanya untuk siapa yang ikut dalam perjanjian HUdaibiyah bersama kami.” Mereka akan berkata, “Perkaranya tidak seperti itu, Allah tidak memerintahkannya kepada kalian. Kalian hanya ingin menghalang-halangi kami berangkat karena kalian hasad terhadap kami, agar kami tidak mendapatkan harta rampasan perang bersama kalian.” Urusannya tidak seperti yang mereka sangka, mereka memang tidak memahami dari Allah apa yang menjadi hak mereka dan apa yang menjadi kewajiban mereka dari masalah agama, kecuali sedikit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Orang-orang yang dibiarkan Allah tertinggal akan berkata, “Jika kalian -wahai orang-orang yang beriman- berangkat untuk mengambil harta rampasan perang Khaibar yang telah dijanjikan oleh Allah untuk kalian setelah perjanjian Hudaibiyah, maka biarkan kami keluar bersama kalian untuk mendapat bagian darinya.” Orang-orang yang tertinggal itu -dengan permintaan mereka ini- ingin merubah janji Allah yang telah dijanjikan untuk orang-orang yang beriman sesudah perjanjian Hudaibiyah agar Allah memberikan harta rampasan perang hanya kepada mereka saja. Katakan -wahai Rasul- kepada mereka, “Kalian sekali-kali tidak akan mengikuti kami menuju harta rampasan itu. Allah telah menjanjikan kepada kami bahwa harta rampasan perang Khaibar adalah untuk orang yang hadir dalam perjanjian Hudaibiyah.” Mereka akan berkata, “Larangan kalian terhadap kami untuk mengikuti kalian menuju Khaibar bukanlah perintah dari Allah, akan tetapi dikarenakan kedengkian kalian terhadap kami.” Padahal perkaranya bukan seperti yang diklaim oleh orang-orang yang tertinggal itu, akan tetapi mereka tidak mengerti perintah-perintah Allah dan larangan-larangan-Nya kecuali hanya sedikit, karena itulah mereka terjerumus ke dalam kemaksiatan terhadap-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Allah menyingkap tipu daya orang-orang munafik dan ketamakan mereka terhadap harta ghanimah: Orang-orang yang tidak ikut perang Uhud dan Hudaibiyah itu akan berkata kepada Nabi dan para sahabatnya, “Jika kalian pergi untuk mengambil harta ghanimah Khaibar yang Allah janjikan kepada kalian maka biarkanlah kami pergi bersama kalian.” Dengan begitu mereka ingin mengubah janji Allah bagi orang-orang yang mengikuti peristiwa Hudaibiyah, agar mereka dapat menerima harta ghanimah juga. Hai Rasulullah, katakanlah kepada mereka: “Kalian tidak akan pergi bersama kami menuju Khaibar, demikianlah yang Allah perintahkan kepada kami.” Namun orang-orang munafik itu membantah: “Allah tidak memerintahkan hal itu, namun kalian mengatakannya karena sifat dengki kalian, sehingga kami tidak dapat pergi bersama kalian untuk mendapat harta ghanimah.” Kenyataannya bukan seperti yang mereka kira, namun mereka adalah orang-orang yang tidak mengerti kebenaran kecuali sesekali saja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. سَيَقُولُ الْمُخَلَّفُونَ إِذَا انطَلَقْتُمْ إِلَىٰ مَغَانِمَ لِتَأْخُذُوهَا (Orang-orang Badwi yang tertinggal itu akan berkata apabila kamu berangkat untuk mengambil barang rampasan) Hai orang-orang beriman mereka akan berkata ketika kalian pergi ke Khaibar untuk mengambil ghanimah dan membaginya. ذَرُونَا نَتَّبِعْكُمْ ۖ( Biarkanlah kami, niscaya kami mengikuti kamu”) Dan kami akan turut serta bersama kalian dalam perang Khaibar. Kisah berasal ketika Rasulullah bersama kaum muslimin pergi dari Hudaibiyah, dan Allah menjanjikan mereka penakhlukan Khaibar dan menjadikan harta ghanimahnya hanya bagi orang-orang yang ikut ke Hudaibiyah. Saat Rasulullah berangkat ke Khaibar, orang-orang yang tidak ikut serta ke Hudaibiyah mengatakan: “Biarkanlah kami mengikuti kalian” يُرِيدُونَ أَن يُبَدِّلُوا۟ كَلٰمَ اللهِ ۚ( mereka hendak merubah janji Allah) Yang dimaksud adalah mereka ingin mengganti janji Allah bagi orang yang ikut ke Hudaibiyah yang dikhususkan bagi mereka harta ghanimah Khaibar. Yakni Allah memerintahkan Rasulullah agar tidak pergi ke Khaibar kecuali hanya bersama orang-orang yang mengikutinya ke Hudaibiyah ketika itu. قُل لَّن تَتَّبِعُونَا كَذٰلِكُمْ قَالَ اللهُ مِن قَبْلُ ۖ( Katakanlah: “Kamu sekali-kali tidak (boleh) mengikuti kami, demikian Allah telah menetapkan sebelumnya”) Yakni Allah telah memberitahukan kami sebelum kami pulang dari Hudaibiyah bahwa harta ghanimah Khaibar hanya bagi orang-orang yang ikut ke Hudaibiyah, selain mereka tidak memiliki againn darinya. فَسَيَقُولُونَ(mereka akan mengatakan) Yakni orang-orang munafik akan mengatakan ketika mendengar perkataan ini. بَلْ تَحْسُدُونَنَا ۚ( “Sebenarnya kamu dengki kepada kami”) Yakni kalian tidak mengizinkan kami untuk pergi bersama kalian hanya karena kedengkian kalian terhadap kami, agar kami tidak mendapat harta ghanimah itu. بَلْ كَانُوا۟ لَا يَفْقَهُونَ إِلَّا قَلِيلًا(Bahkan mereka tidak mengerti melainkan sedikit sekali) Yakni mereka hanya memiliki sedikit pengetahuan, yaitu pengetahuan tentang urusan dunia saja. Adapun tentang peperangan karena Allah, memperbaiki niat, dan keimanan yang benar, maka kalian tidak mengerti sama sekali tentang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Orang-orang yang tidak ikut mendatangi perjanjian Hudaibiyah tersebut akan berkata saat kalian pergi untuk mengambil rampasan perang Khaibar: “Sisakanlah (harta itu) untuk kami. Kami akan ikut kalian untuk mengambilnya.” Mereka ingin mengubah Kalam Allah, yaitu janjiNya yang dikhususkan untuk orang yang ikut perjanjian Hudaibiyah. Allah akan mengganti rampasan perang Mekah dengan rampasan perang Khaibar. Katakanlah kepada mereka wahai Rasulallah: “Kalian tidak akan ikut dengan kami untuk mengambil rampasan perang Khaibar. Hal itu disampaikan Allah kepada kami bahwa rampasan perang Khaibar hanya diperuntukkan untuk orang-orang yang ikut perjanjian Hudaibiyah.” Saat mendengar hal itu, orang-orang munafik itu akan berkata: “Sesungguhnya kalian mencegah kami untuk ikut dan keluar bersama kalian. Kalian iri sehingga tidak mengikutsertakan kami untuk mengambil rampasan perang Khaibar.”. Akan tetapi faktanya mereka tidak mengetahui tentang hukum-hukum agama kecuali hanya sedikit, yaitu hukum yang berhubungan dengan rampasan perang saja."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kamu nanti berangkat untuk mengambil harta rampasan perang} harta rampasan perang {orang-orang tertinggal itu akan berkata,“Biarkanlah kami} biarkaanlah kami {mengikuti kalian” Mereka hendak mengubah} mengganti {janji Allah} janji Allah untuk orang yang mengikuti perjanjian Hudaibiyah dengan menjadikan harta rampasan Khaibar itu khusus untuk mereka {Katakanlah,“Kalian tidak boleh mengikuti kami. Demikianlah yang telah difirmankan Allah sebelumnya” Maka mereka akan berkata,“Sebenarnya kalian dengki kepada kami” padahal mereka tidak mengerti kecuali sedikit sekali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Setelah Allah menyebutkan orang-orang yang tidak pergi berjihad serta mencela mereka, selanjutnya Allah menyebutkan sebagian hukuman duniawi untuk mereka yaitu bahwa Rasulullah dan para sahabatnya ketika mendapatkan berbagai harta rampasan perang tanpa peperangan, mereka menginginkan agar disertakan, mereka berkata, “Biarkanlah kami, niscaya Kami mengikuti kamu,” mereka hendak (ingin) dengan cara itu “merubah janji Allah.” Karena telah memutuskan hukuman bagi mereka dan Allah telah mengkhususkan harta rampasan perang hanya untuk para sahabat yang beriman menurut ketentuan syariat dan takdir. “Katakanlah” kepada mereka “Janganlah kalian mengikuti kami.’ Seperti itulah yang difirmankan Allah sebelumnya.” Sesungguhnya kalian terhalang untuk mendapatkan harta rampasan perang karena perbuatan dosa yang kalian lakukan terhadap diri kalian dan karena kalian tidak ikut pergi berperang pada mulanya. “Maka mereka akan berkata,” seraya menjawab pernyataan yang melarang mereka untuk ikut berperang tersebut, “Sebenarnya kalian iri pada kami,” terhadap harta rampasan perang, dan inilah puncak pengetahuan mereka tentang berperang. Andai mereka mengerti dan memahami, tentu mereka tahu bahwa penyebab yang membuat mereka terhalang untuk mendapatkan harta rampasan perang adalah karena kemaksiatan yang mereka lakukan. Orang-orang yang melakukan kemaksiatan berhak mendapatkan hukuman dunia dan akhirat. Karena itulah Allah berfirman, “Tetapi mereka itu tidak mengerti kecuali hanya sedikit.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 15: Allah mengabarkan kepada nabi-Nya atas apa yang akan dikatakan oleh mereka yang menyelisihi yaitu mereka badui, yang keluar bersamamu; Setelah Allah menyingkap keburukan sangkaan mereka, mereka mencari cara agar mereka dapat pulang dengan selamat menuju Mekkah; Sungguh mereka akan berkata kepadamu: Jika engkau telah pergi bersama sahabatmu wahai Muhammad, menuju harta ghanimah khaibar yang Allah telah janjikan kepada kalian maka panggilah kami, kami akan keluar bersama kalian untuk membantu kalian mengumpulkan harta ghanimah tersebut. Tujuan mereka atas hal ini adalah merubah janji Allah kepada kalian, akan harta-harta rampasan perang khaibar yang diperuntukkan bagi saksi-saksi yang ikut perang hudaibiyah; Maka katakan kepada mereka wahai Nabi Allah: Kalian tidak akan keluar bersama kami karena Allah kabarkan kepada kami bahwasanya harta-harta rampasan khaibar adalah milik saksi-saksi yang ikut pada perjanjian hudaibiyah dan ini adalah hukuman bagi kalian atas maksiat yang telah kalian kerjakan dengan penolakan kalian yaitu keluarnya kalian ke Mekah, dan karena sebab keburukan sangkaan kalian yang menginginkan untuk berkata: Sesungguhnya Allah tidak memerintahkan kami keluar bersama kalian; akan tetapi kalian adalah orang-orang yang menahan kami karena hasad dengan sebab harta-harta ghanimah ini. Ketahuilah wahai Nabi Allah bahwasanya urusannya tidak sebagaimana yang mereka klaim; Bahkan sesungguhnya mereka adalah suatu kaum yang berjalan di muka bumi dengan kebodohan, mereka tidak faham atas urusan urusan agama kecuali hanya sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan orang-orang yang tidak ikut berjihad di jalan-Nya dan mencela mereka, maka Dia menyebutkan bahwa hukuman dunia untuk mereka adalah ketika Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya pergi mengambil harta rampasan perang yang di sana sudah tidak ada peperangan lagi, maka mereka meminta agar diikutsertakan sambil berkata, “Biarkanlah kami mengikuti kamu,” Maksudnya, barang rampasan perang di Khaibar. Yakni agar kami boleh mengambilnya. Yakni janji Allah untuk memberikan ghanimah (harta rampasan perang) Khaibar untuk orang-orang yang menghadiri Hudaibiyah saja secara syara’ dan qadar. Yakni kamu dihalangi darinya karena kejahatanmu kepada dirimu dan karena kamu tidak mau berperang pertama kali. Yakni “jika kami ikut mengambil ghanimah bersama kamu.” Inilah ujung pengetahuan mereka, kalau seandainya mereka cerdas tentu mereka akan mengetahui bahwa dihalanginya mereka dari mendapatkan ghanimah adalah karena kemaksiatan mereka, dan bahwa maksiat itu memiliki hukuman baik terkait dengan dunia maupun agama. Oleh karena itulah Allah Subhaanahu wa Ta'aala berfirman, “Padahal mereka tidak mengerti melainkan sedikit sekali.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 15",
    "description": "Apabila kamu wahai nabi Muhammad, berangkat menuju ke khaibar bersama-sama dengan rombongan yang pergi ke hudaibiyah untuk mengambil barang rampasan, orang-orang badui yang tertinggal di madinah itu akan berkata, 'biarkanlah kami mengikuti kamu untuk mengambil harta rampasan itu. ' mereka hendak mengubah janji Allah, bahwa harta rampasan perang di khaibar hanya diperuntukkan bagi rombongan yang ikut ke hudaibiyah. Katakanlah, wahai nabi Muhammad, 'kamu, wahai orang-orang badui yang tidak ikut pergi ke hudaibiyah, sekali-kali tidak boleh mengikuti kami untuk mengambil harta rampasan di khaibar. Demikianlah ketentuan yang telah ditetapkan Allah sejak semula, yakni sejak lama sebelum diucapkan permintaanmu untuk pergi bersama kami. Mendengar keputusan itu maka mereka akan berkata, 'itu bukan keputusan Allah, melainkan kehendakmu. Sebenarnya kamu dengki kepada kami, kalau kami memperoleh harta rampasan itu. ' bukan karena kedengkian, melainkan karena mereka tidak mengerti perkara agama atau latar belakang keputusan itu melainkan sedikit sekali. Kalau mereka mengetahuinya niscaya mereka tidak mengatakan kepada rasul ucapan yang demikian itu. 16. Katakanlah kepada orang-orang badui yang tertinggal, yaitu mereka yang tidak ikut pergi ke hudaibiyah, 'kamu akan diajak untuk pergi menuju suatu kaum yang mempunyai kekuatan yang besar dan keberanian yang luar biasa. Ketika itu kamu harus memerangi mereka kecuali mereka menyerah dan masuk islam. Jika kamu patuhi ajakan itu Allah akan memberimu pahala yang baik, berupa kemuliaan dan harta rampasan di dunia, dan di akhirat berupa surga. Tetapi jika kamu berpaling seperti yang kamu perbuat sebelumnya, yakni ketika nabi mengajakmu ke hudaibiyah dia akan mengazab kamu dengan azab yang pedih, berupa kehinaan di dunia dan neraka di akhirat. '"
  }
]