[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada orang-orang yang tidak berangkat berperang dari orang-orang Arab Badui, “Kalian akan diajak berperang melawan suatu kaum yang punya kekuatan besar dalam peperangan, kalian memerangi mereka atau mereka akan masuk Islam tanpa perang. Bila kalian menaati Allah terhadap apa yang Dia serukan kepada kalian, yaitu memerangi kaum tersebut, niscaya Allah memberi kalian surga, namun bila kalian bermaksiat kepadaNya sebagaimana yang kalian lakukan saat kalian menolak berangkat Rasulullah ke Makkah, niscaya Allah mengazab kalian dengan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Katakan -wahai Rasul- kepada orang-orang yang tertinggal dari kalangan Badui untuk keluar bersamamu menuju Makkah, sebagai bentuk ujian bagi mereka, “Kalian akan dipanggil untuk mengikuti peperangan melawan kaum yang mempunyai kekuatan besar dalam perang, kalian memerangi mereka di jalan Allah atau mereka mau masuk Islam tanpa ada peperangan. Jika kalian menaati Allah dalam panggilan-Nya untuk memerangi mereka, maka Allah akan memberikan pahala yang besar, yaitu Surga. Dan jika kalian berpaling dari ketaatan kepada-Nya -sebagaimana kalian berpaling saat kalian tertinggal untuk keluar bersama Rasulullah ke Makkah- maka Allah akan menyiksa kalian dengan siksa yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Hai Rasulullah, katakanlah kepada orang-orang badui yang tidak ikut berperang: “Kalian akan diperintahkan untuk memerangi kaum yang memiliki kekuatan besar dan tekat yang kuat di medan perang; Allah mensyariatkan agar kalian berjihad melawan mereka dan kalian akan meraih kemenangan, atau mereka memeluk agama Islam tanpa harus kalian perangi. Jika kalian menyambut perintah ini dan pergi ke medan jihad maka Allah akan memberi kalian rezeki berupa harta ghanimah, surga, atau kedua-duanya. Namun jika kalian enggan untuk berjihad sebagaimana keengganan kalian pada perang Uhud dan Hudaibiyah maka Allah akan mengazab kalian dengan azab yang pedih.” Namun orang-orang yang memiliki uzur, seperti orang buta, pincang, dan sakit, maka mereka tidak berdosa jika tidak ikut berjihad. Dan barangsiapa yang mentaati Allah dan rasul-Nya, maka Allah akan memasukkannya ke dalam surga-surga yang di bawah pepohonannya terdapat sungai-sungai air tawar yang mengalir. Sedangkan orang yang enggan berjihad di jalan Allah bersama orang-orang beriman, maka Allah akan mengazabnya dengan azab yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قُل لِّلْمُخَلَّفِينَ مِنَ الْأَعْرَابِ (Katakanlah kepada orang-orang Badwi yang tertinggal) Mereka adalah orang-orang munafik yang disebutkan sebelumnya. سَتُدْعَوْنَ إِلَىٰ قَوْمٍ أُو۟لِى بَأْسٍ شَدِيدٍ (“Kamu akan diajak untuk (memerangi) kaum yang mempunyai kekuatan yang besar) Yaitu kabilah Hawazin dan Ghathafan, pada perang Hunain. Peperangan yang terjadi melawan mereka setelah penakhlukan kota Makkah pada tahun ke-8 H. Az-Zuhri berpendapat: mereka adalah Bani Hanifah yang menghuni Yamamah yang merupakan sekutu Musailamah. Dan peperangan yang terjadi melawan mereka adalah pada masa kepemimpinan khalifah Abu Bakar as-Shiddiq. تُقٰتِلُونَهُمْ أَوْ يُسْلِمُونَ ۖ( kamu akan memerangi mereka atau mereka menyerah (masuk Islam)) Yakni pilihan bagi mereka hanya dua, berperang atau masuk Islam; tidak ada pilihan yang ketiga. Hukum ini berlaku bagi orang-orang kafir yang tidak membayar Jizyah. Dan penarikan harta Jizyah juga disyariatkan dari orang selain Arab. فَإِن تُطِيعُوا۟ يُؤْتِكُمُ اللهُ أَجْرًا حَسَنًا ۖ( Maka jika kamu patuhi (ajakan itu) niscaya Allah akan memberikan kepadamu pahala yang baik) Yaitu harta ghanimah di dunia dan surga di akhirat. وَإِن تَتَوَلَّوْا۟( dan jika kamu berpaling) Yakni jika kalian enggan. كَمَا تَوَلَّيْتُم مِّن قَبْلُ (sebagaimana kamu telah berpaling sebelumnya) Yakni pada saat mereka enggan untuk pergi ke Hudaibiyah. يُعَذِّبْكُمْ عَذَابًا أَلِيمًا (niscaya Dia akan mengazab kamu dengan azab yang pedih) Dengan terbunuh di peperangan, tertawan, dan terkalahkan di dunia; serta dengan azab neraka di akhirat; akibat dosa kalian yang berlipat ganda."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai nabi, katakanlah kepada orang-orang Baduwi yang tinggal di gurun yang tidak ikut mendatangi perjanjian Hudaibiyah itu (Hal ini diulang sebagai wujud pernyataan hiperbola untuk mengecam mereka dan menunjukkan keburukan tertinggal perang): “Kalian mengajak (kami) berperang melawan kaum yang memiliki kekuatan besar dan bertekad kuat dalam peperangan hanya dengan memberi 2 pilihan saja yaitu Islam atau mati.” Jika kalian menaati apa yang diperintahkan Allah dan rasulNya dan bersabar untuk menghadapi musuh, maka Allah akan memberi kalian pahala yang besar, yaitu rampasan perang di dunia dan surga di akhirat kelak. Jika kalian menolak dan meninggalkannya sebagaimana kalian tidak ikut perjanjian Hudaibiyah maka Allah akan mengazab kalian dengan azab yang pedih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada orang-orang yang tertinggal dari golongan Arab Badui itu,“Kalian akan diajak untuk (memerangi) kaum yang mempunyai kekuatan yang besar} memiliki kekuatan dan kemampuan dalam berperang {Kalian akan memerangi mereka atau mereka menyerah. Jika kalian mematuhi, Allah akan memberi kalian balasan yang baik. Dan jika kalian berpaling} berpaling {seperti yang kalian berpaling} kelian telah berpaling {sebelumnya, maka Dia akan mengazab kalian dengan azab yang pedih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Setelah Allah menyebutkan tentang orang-orang dari kalangan badui yang tidak turut pergi berperang di jalan Allah, mereka mengutarakan alasan yang tidak benar dan mereka meminta untuk turut serta berperang jika tidak disertai persenjataan dan peperangan tapi hanya untuk mendapatkan harta rampasan perang saja, maka Allah berfirman mencela mereka, “Katakanlah kepada orang-orang badui yang tertinggal, ‘Kamu akan diajak untuk (memerangi) kaum yang mempunyai kekuatan yang besar’.” Artinya, Rasulullah dan para penggantinya dari kalangan Khulafa’ Rasyidin serta para pemimpin akan mengajak kalian, dan mereka itu adalah pasukan Persia dan Romawi serta orang-orang semacam mereka, “kamu akan memerangi mereka atau mereka menyerah (masuk Islam),” artinya, kemungkinan yang ini atau yang itu. Dan inilah realitanya, jika mereka pada saat memerangi para musuh dan dapat dikalahkan, maka kaum Muslimin tidak boleh menerima jizyah dari mereka, tapi alternatifnya adalah mereka para musuh itu masuk Islam atau dibunuh karena kekufuran mereka. Setelah kaum Muslimin berhasil mengalahkan mereka, mereka pun tunduk dan kehilangan kekuatan sehingga mereka harus masuk Islam atau membayar jizyah. “Maka jika kamu patuhi (ajakan itu),” yakni, ajakan orang yang menyeru kalian memerangi musuh, “niscaya Allah akan memberikan kepadamu pahala yang baik,” yaitu balasan yang diberikan Allah dan RasulNya karena berjihad di jalan Allah. “Dan jika kamu berpaling sebagaimana kamu telah berpaling sebelumnya,” untuk memerangi kaum yang diserukan oleh Rasulullah agar diperangi, “niscaya Dia akan mengazab kamu dengan azab yang pedih.” Ayat ini menunjukkan keutamaan para Khulafa’ Rasyidin yang menyerukan untuk memerangi kaum yang memiliki kekuatan besar, di mana seruan itu wajib untuk ditaati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 16: Katakanlah wahai nabi Allah kepada mereka yang menyimpang dari jihad dan peperangan : Kalian akan diajak untuk berperang melawan kaum yang memiliki kekuatan dan keras dalam berperang, kalian akan memerangi mereka, maka mungkin kalian akan selamat dan mungkin kalian akan kalah. Maka jika kalian memenuhi seruan untuk berperang maka Allah akan memberikan balasan kebaikan di dunia berupa harta rampasan perang dan di akhirat dimasukkan dalam surga dan tinggal di dalamnya, dan jika kalian menolak sebagaimana alasan kalian sebelumnya dalam perang hudaibiyah; maka Allah akan mengazab kalian dengan azab dengan azab yang pedih, di dunia terhina, terbunuh dan tertawan sedangkan di akhirat diazab dengan azab neraka dan itulah seburuk buruk tempat kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa orang-orang Arab badui itu tidak mau berjihad di jalan-Nya serta mengemukakan uzur (alasan) yang sebenarnya bukan uzur, dan bahwa mereka meminta ikut keluar jika di sana tidak ada peperangannya, bahkan ikutnya mereka hanya menginginkan ghanimah saja, maka Allah Subhaanahu wa Ta'aala berfirman menguji mereka, “Katakanlah kepada orang-orang Badui yang tertinggal, \"Kamu akan diajak untuk (memerangi) kaum yang mempunyai kekuatan yang besar…dst.” Baik oleh Rasulullah shallallahu 'alaihi wa sallam maupun yang menjadi penggantinya, yaitu para khulafa’ur raasyidin dan para imam (pemerintah) kaum muslimin. Menurut Syaikh As Sa’diy, ayat ini menunjukkan keutamaan para khulafaa’ur raasyidin yang mengajak berjihad melawan orang-orang yang mempunyai kekuatan yang besar, dan bahwa mereka wajib ditaati dalam hal tersebut. Tentang maksud orang-orang yang mempunyai kekuatan yang besar ada beberapa pendapat dari para mufassir, di antaranya: - Orang-orang Hawazin. - Kaum Tsaqif. - Bani Hanifah. - Bangsa Persia. - Bangsa Romawi. - Para penyembah berhala. Baik dengan masuk Islam atau membayar jizyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 16",
    "description": "Katakanlah kepada orang-orang badui yang tertinggal, yaitu mereka yang tidak ikut pergi ke hudaibiyah, 'kamu akan diajak untuk pergi menuju suatu kaum yang mempunyai kekuatan yang besar dan keberanian yang luar biasa. Ketika itu kamu harus memerangi mereka kecuali mereka menyerah dan masuk islam. Jika kamu patuhi ajakan itu Allah akan memberimu pahala yang baik, berupa kemuliaan dan harta rampasan di dunia, dan di akhirat berupa surga. Tetapi jika kamu berpaling seperti yang kamu perbuat sebelumnya, yakni ketika nabi mengajakmu ke hudaibiyah dia akan mengazab kamu dengan azab yang pedih, berupa kehinaan di dunia dan neraka di akhirat. ' 17. Tidak ada dosa atas orang-orang yang buta apabila mereka tidak memenuhi ajakan itu, demikian juga atas orang-orang yang pincang, yakni cacat, dan atas orang-orang yang sakit apa pun jenis penyakitnya, apabila tidak ikut berperang. Barang siapa taat kepada Allah dan rasul-Nya, melaksanakan perintah dan menjauhi larangan-Nya, dia akan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai; tetapi barangsiapa berpaling mengabaikan perintah dan larangan-Nya dia akan mengazabnya dengan azab yang pedih."
  }
]