[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada dosa atas orang buta, pincang dan sakit dari kalian (wahai manusia) bila yang bersangkutan tidak berangkat berjihad bersama orang-orang beriman, karena mereka tidak memiliki kesanggupan. Barangsiapa menaati Allah dan RasulNya, niscaya Allah memasukannya ke dalam surga-surga yang sungai-sungai mengalir di bawah istana-istana dan pohon-pohonnya, dan barangsiapa mendurhakai Allah dan RasulNya, dimana dia tidak berangkat berjihad bersama orang-orang beriman, niscaya Allah mengazabnya dengan azab pedih yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tidak ada dosa bagi orang yang mempunyai alasan karena kebutaan, pincang atau sakit untuk tidak ikut perang di jalan Allah. Dan barangsiapa menaati Allah dan menaati Rasul-Nya niscaya Dia akan memasukkannya ke dalam surga-surga yang di bawah istana-istananya dan pepohonannya mengalir sungai-sungai. Dan barangsiapa berpaling dari ketaatan terhadap keduanya niscaya Allah menyiksanya dengan siksa yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. لَّيْسَ عَلَى الْأَعْمَىٰ حَرَجٌ وَلَا عَلَى الْأَعْرَجِ حَرَجٌ وَلَا عَلَى الْمَرِيضِ حَرَجٌ ۗ (Tiada dosa atas orang-orang yang buta dan atas orang yang pincang dan atas orang yang sakit (apabila tidak ikut berperang) Yakni orang-orang yang tidak ikut berperang karena alasan-alasan ini tidak mendapatkan dosa sebab mereka tidak memiliki kemampuan. وَمَن يُطِعِ اللهَ وَرَسُولَهُۥ(Dan barangsiapa yang taat kepada Allah dan Rasul-Nya) Dalam segala perintah dan larangan-Nya. يُدْخِلْهُ جَنّٰتٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ ۖ وَمَن يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا (niscaya Allah akan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai dan barang siapa yang berpaling niscaya akan diazab-Nya dengan azab yang pedih) Yakni barangsiapa yang enggan untuk taat maka Allah akan mengazabnya dengan azab yang pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Tidaklah bagi orang yang ijin untuk meninggalkan jihad karena lemah dan tidak mampu itu dosa dan hinaan. Mereka yaitu orang buta, pincang dan sakit. Barangsiapa yang menaati apa saja yang diperintahkan dan menjauhi apa saja yang dilarang Allah dan rasulNya, maka dia akan dimasukkan ke dalam surga-surga yang mengalir sungai-sungai di bawah ruangan-ruangan dan taman-tamannya. Barangsiapa yang menoolak untuk taat, maka Allah akan mengazabnya dengan azab yang pedih di neraka Jahanam. Ibnu Abbas berkata: “Saat ayat {Wa in Tatawallau kamaa tawallaitum min qabl} [QS Al-Fath 48/16] diturunkan, orang orang yang cacat berkata: “Bagaimana dengan kami wahai Rasulallah?” Lalu Allah menurunkan ayat {Laisa ‘Alal A’ma harajun}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa atas orang-orang yang buta, tidak pula atas orang-orang yang pincang} dosa karena tertinggal untuk berjihad {dan orang-orang yang sakit. Siapa saja yang taat kepada Allah dan RasulNya, Allah akan memasukkannya ke dalam surga yang mengalir bawahnya sungai-sungai. Dan siapa saja yang berpaling, maka Dia akan mengazabnya dengan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Selanjutnya Allah menyebutkan berbagai macam udzur yang diperkenankan bagi seorang hamba untuk tidak turut berjihad, Allah berfirman, “Tiada dosa atas orang-orang yang buta dan atas orang-orang yang pincang dan atas orang-orang yang sakit (apabila tidak ikut berperang).” Yakni, untuk tidak turut berjihad karena adanya udzur yang menghalangi mereka. “Dan barangsiapa yang taat kepada Allah dan RasulNya,” dalam melaksanakan perintahNya dan menjauhi laranganNya, “niscaya Allah akan memasukkan mereka ke dalam surga yang mengalir di bawahnya sungai-sungai,” di dalam surga terdapat berbagai hal yang diinginkan jiwa dan dipandang nikmat oleh mata. “Dan barangsiapa yang berpaling,” dan tidak menaati Allah serta RasulNya, “niscaya Dia akan mengazabnya dengan azab yang pedih.” Kebahagiaan seluruhnya terletak pada menaati perintah Allah dan kesengsaraan terletak pada kemaksiatan serta menentang perintah Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 17: Allah menyebutkan orang-orang yang meminta udzur yang hakiki, menjelaskan bahwasanya tidak ada dosa bagi mereka untuk tidak berjihad, sedangkan keimanan dan amal saleh mereka sama sebagaimana keimanan dari selain mereka yang berperang bersamaan Nabi. Allah menyebutkan sebagian dari orang-orang yang meminta uzur adalah orang buta, cacat, sakit, kemudian Allah menjelaskan bahwasanya orang-orang yang mentaati Allah dan rasulnya dalam mengerjakan perintah-perintah keduanya ( Allah dan rasul ) serta menjauhi apa yang Allah dan Rasul-Nya larang; maka sungguh mereka akan memasuki surga yang mengalir di bawahnya pepohonan dan istananya sungai-sungai. Adapun mereka yang menolak dari ketaatan kepada Allah dan rasul-Nya maka mereka terjatuh ke dalam dosa dan maksiat, diantaranya adalah orang-orang yang menyelisihi jihad di jalan Allah, maka sungguh Allah akan mengazabnya dengan azab yang mengerikan, menyakitkan, yang tidak diketahui kecuali Allah yang maha kuasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan uzur seseorang boleh tidak ikut berjihad. Di dalamnya terdapat apa yang diinginkan oleh jiwa dan hal yang menyejukkan pandangan. Dari taat kepada Allah dan Rasul-Nya. Oleh karena itu, kebahagiaan seluruhnya terletak pada ketaatan kepada Allah dan Rasul-Nya, sebaliknya ksengsaraan terletak pada maksiat kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 17",
    "description": "Tidak ada dosa atas orang-orang yang buta apabila mereka tidak memenuhi ajakan itu, demikian juga atas orang-orang yang pincang, yakni cacat, dan atas orang-orang yang sakit apa pun jenis penyakitnya, apabila tidak ikut berperang. Barang siapa taat kepada Allah dan rasul-Nya, melaksanakan perintah dan menjauhi larangan-Nya, dia akan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai; tetapi barangsiapa berpaling mengabaikan perintah dan larangan-Nya dia akan mengazabnya dengan azab yang pedih. 18. Sungguh, Allah telah meridai orang-orang mukmin, yaitu para sahabat nabi ketika mereka berjanji setia kepadamu wahai nabi Muhammad untuk meluhurkan agama islam dan memerangi musuh-Musuhnya. Janji setia itu berlangsung di di bawah pohon di tempat bernama hudaibiyah, ketika nabi dan para sahabat dihalangi oleh kaum musyrik mekah melaksanakan umrah. Dia mengetahui apa yang ada dalam hati mereka menyangkut keteguhan iman dan keikhlasan berbaiat, lalu dia memberikan ketenangan atas mereka dan ketabahan dalam menghadapi musuh dan memberi balasan dengan kemenangan yang dekat, yaitu dalam peperangan di khaibar, tidak lama sesudah mereka kembali dari hudaibiyah."
  }
]