[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sungguh Allah telah meridhai orang-orang beriman saat mereka membai’atmu (wahai Nabi) dibawah pohon itu. Bai’at ini adalah bai’at ar-Ridhwan di Hudaibiyah. Allah mengetahui apa yang ada di dalam hati orang-orang beriman tersebut, yaitu iman, kejujuran, dan kesetiaan. Maka Allah menurunkan ketenangan kepada mereka, meneguhkan hati mereka dan menjanjikan mengganti apa yang tidak terwujud dengan perjanjian Hudaibiyah dengan sebuah kemenangan yang dekat, yaitu kemenangan pada Perang Khaibar dan harta rampasan perang yang besar yang mereka raih dari harta orang-orang Yahudi Khaibar. Allah MahaPerkasa dalam membalas musuh-musuhNya, Mahabijaksana dalam mengatur urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Allah telah meridai orang-orang beriman yang mengucapkan janji setia kepadamu di Hudaibiyah dalam Bai’atur Riḍwān di bawah pohon, dan Allah mengetahui keimanan, keikhlasan dan kejujuran yang ada di dalam hati mereka, lalu Allah menurunkan ketenangan ke dalam hati mereka dan menganugerahi kemenangan yang dekat karena hal itu, yaitu kemenangan dalam perang Khaibar, sebagai ganti atas kegagalan mereka untuk memasuki Makkah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Sungguh Allah telah meridhai orang-orang beriman, ketika mereka berbai’at kepadamu di bawah pohon yang ada di Hudaibiyah. Allah Mengetahui kepatuhan dan ketaatan yang ada dalam hati mereka, sehingga Allah menurunkan ketentraman bagi mereka dan membalas mereka atas bai’at yang mereka lakukan dengan penakhlukan Khaibar -yang terletak di selatan kota Madinah sejauh 160 km- dan penakhlukan yang lain setelah itu, serta harta ghanimah yang banyak dari harta orang-orang Yahudi Khaibar dan lainnya yang dapat mereka ambil. Allah Maha Perkasa dalam memberi balasan bagi musuh-musuh-Nya, dan Maha Bijaksana dalam mengatur segala urusan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. لَّقَدْ رَضِىَ اللهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ (Sesungguhnya Allah telah ridha terhadap orang-orang mukmin ketika mereka berjanji setia kepadamu di bawah pohon) Yakni Allah meridhai mereka saat terjadi baiat tersebut, yaitu baiat ridwan yang terjadi di Hudaibiyah. Baiat itu berisi bahwa mereka harus memerangi kaum kafir Quraisy dan tidak kabur dari mereka, dan diriwayatkan pula bahwa Rasulullah membaiat mereka untuk siap kehilangan nyawa. Adapun kisah secara lengkap disebutkan dalam kitab-kitab hadits dan sejarah Islam. فَعَلِمَ مَا فِى قُلُوبِهِمْ(maka Allah mengetahui apa yang ada dalam hati mereka) Berupa kejujuran dan penepatan janji. فَأَنزَلَ السَّكِينَةَ عَلَيْهِمْ(lalu menurunkan ketenangan atas mereka) Yakni ketenangan dan ketentraman jiwa, sebagaimana telah dijelaskan sebelumnya. وَأَثٰبَهُمْ فَتْحًا قَرِيبًا(dan memberi balasan kepada mereka dengan kemenangan yang dekat) Yaitu penakhlukan kota Khaibar setelah mereka pergi dari Hudaibiyah. Pendapat lain mengatakan yang dimaksud adalah penakhlukan kota Makkah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Allah sungguh meridhai orang-orang mukmin dari sahabat-sahabat yang berjanji untuk setia kepadamu dengan penuh kerelaan di bawah pohon saat perjanjian Hudaibiyah. Mereka tetap mau berperang melawan kafir Quraisy. Allah mengetahui apa yang ada dalam hati mereka yang berupa keimanan, kesetiaan dan keikhlasan dalam melakukan perjanjian, sehingga Allah memberi ketenangan dan keamanan mereka, menenangkan jiwa mereka, dan membalas mereka dengan penaklukan Khaibar dan penyebaran Islam seketika sesudah perdamaian Hudaibiyah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah benar-benar telah meridhai orang-orang mukmin ketika mereka berjanji setia kepadamu} berikrar dengan ridha pada perjanjian Hudaibiyah {di bawah sebuah pohon. Dia mengetahui apa yang ada dalam hati mereka, lalu Dia menganugerahkan ketenangan} ketenangan {kepada mereka dan memberi balasan berupa kemenangan yang dekat} kemenangan Khaibar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Allah mengabarkan tentang karunia, rahmat, serta keridhaanNya terhadap kaum Mukminin yang berbai’at setia kepada Rasulullah dalam persitiwa pembai’atan yang membuat wajah mereka putih bersinar, dan dengan bai’at itu pun mereka mendapatkan kebahagiaan dunia dan akhirat. Penyebab bai’at ini, yaitu yang dikenal dengan Bai’at ar-Ridhwan adalah karena Allah ridha terhadap kaum Mukminin yang melakukan Bai’at setia itu. Disebut juga bai’at orang-orang yang berada di sekitar pohon, yaitu pada saat pembicaraan antara Rasulullah dan kaum musyrikin berlangsung dalam perjanjian Hudaibiyah mengenai sebab kedatangan Rasulullah ke Makkah, Rasulullah tidak datang untuk memerangi seorang pun, Rasulullah datang hanya untuk mengunjungi Baitullah serta untuk mengagungkannya. Kemudian Rasulullah mengirim Utsman bin Affan ke Makkah untuk mengutarakan tujuan kedatangan Rasulullah. Kemudian tersiar berita bohong bahwa Utsman dibunuh. Kemudian Rasulullah mengumpulkan kaum Mukminin yang turut bersama Rasulullah yang jumlahnya sekitar seribu lima ratus orang, dan mereka pun berbai’at setia kepada Rasulullah di bawah sebatang pohon untuk memerangi kaum musyrikin dan tidak akan lari hingga mereka gugur sekalipun. Kemudian Allah memberitahukan bahwa Dia ridha terhadap kaum Mukminin pada saat itu yang mana bai’at itu merupakan salah satu ketaatan terbesar serta ibadah paling luhur. “Maka Allah mengetahui apa yang ada di dalam hati mereka,” yakni, Allah mengetahui keimanan mereka, “lalu menurunkan ketenangan atas mereka,” sebagai rasa terima kasih Allah terhadap keimanan yang terdapat dalam diri mereka, Allah menambahkan petunjuk pada mereka dan Allah juga mengetahui kesedihan dalam benak mereka karena isi-isi perjanjian yang disyaratkan oleh kaum musyrikin terhadap Rasulullah, kemudian Allah menurunkan ketenangan yang membuat hati mereka kokoh dan damai, “dan memberi balasan kepada kepada mereka dengan kemenangan yang dekat (waktunya).” Yaitu penaklukan Khaibar yang hanya diikuti oleh orang-orang yang ikut serta dalam peristiwa Hudaibiyah, sehingga harta rampasannya khusus bagi mereka sebagai balasan untuk mereka dan sebagai ucapan terima kasih atas ketaatan terhadap Allah serta menunaikan amalan yang membuatNya ridha yang dilakukan oleh kaum Mukminin, “serta harta rampasan yang banyak yang dapat mereka ambil. Dan Allah Mahaperkasa lagi Mahabijaksana.” Allah memiliki keperkasaan dan kekuasaan yang memaksa segala sesuatu. Andai Allah berkehendak, tentu kaum Muslimin akan dapat mengalahkan kaum kafir dalam setiap peperangan, namun Allah Mahabijaksana, yang menguji sebagian mereka dengan yang lain; Allah menguji orang-orang Mukmin dengan kemenangan orang kafir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 18: Allah mengabarkan bahwa Allah Ridho dengan orang-orang yang beriman ketika mereka membaiat Rasul untuk berjihad dan mati di jalan Allah, dan mereka waktu itu di bawah pohon yang terletak di hudaibiyah. Ini adalah baiat yang dinamakan dengan baiatur ridwan; kemudian Allah menjelaskan sebab dari keridhaan-nya pada mereka yang bahwasanya Allah mengetahui apa yang ada dalam hati-hati mereka yaitu dari kejujuran, keimanan dan keikhlasan; maka Allah menurunkan ketenangan bagi mereka dan ketetapan langkah-langkah mereka, dan sebagai pengganti atas amalan mereka Allah memberikan penaklukan yang dekat kepada musuh Allah yaitu ditaklukkannya khaibar, yang Allah berikan setelah perjanjian hudaibiyah sebagai balasan bagi mereka atas perjanjian tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan karunia dan rahmat-Nya dengan meridhai kaum mukmin ketika mereka membaiat Rasulullah shallallahu 'alaihi wa sallam dalam bai’at yang menjernihkan wajah-wajah mereka. Sebab bai’at yang dikenal dengan nama “Bai’aturridhwan” atau “Bai’at Ahlisy syajarah” adalah ketika terjadi pembicaraan antara Rasulullah shallallahu 'alaihi wa sallam dengan kaum musyrik pada hari Hudaibiyah tentang kedatangannya, dan bahwa kedatangan Beliau bukan untuk memerangi seorang pun, tetapi maksudnya untuk menziarahi Baitullah sambil memuliakannya, maka Rasulullah shallallahu 'alaihi wa sallam mengirimkan Utsman bin ‘Affan ke Mekah untuk menyampaikan maksudnya, lalu sampailah berita yang tidak benar, yaitu bahwa Utsman dibunuh oleh kaum musyrik. Maka Rasulullah shallallahu 'alaihi wa sallam mengumpulkan kaum mukmin yang ada bersamanya yang jumlahnya kurang lebih 1500 orang, lalu mereka membaiat Beliau di bawah sebuah pohon untuk memerangi kaum musyrik sampai titik darah penghabisan dan tidak akan melarikan diri. Maka Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia ridha kepada kaum mukmin terhadap sikap mereka itu, dimana hal itu merupakan ketaatan yang besar dan ibadah yang agung. Di Hudaibiyah. Berupa keimanan, kejujuran dan memenuhi janji. Sebagai syukur-Nya kepada mereka karena apa yang ada dalam hati mereka itu. Dia juga menambahkan petunjuk kepada mereka. Dia mengetahui rasa sedih yang mendalam di hati mereka ketika mereka menerima syarat yang berat yang diajukan kaum musyrik, maka Dia menurunkan ketenangan kepada mereka yang mengokohkan mereka dan menenangkan hati mereka. Yang dimaksud dengan kemenangan yang dekat ialah kemenangan kaum muslimin pada perang Khaibar setelah pulang dari Hudaibiyah. Mereka yang hanya memperoleh ghanimahnya, tidak selain mereka sebagai balasan bagi mereka dan syukur-Nya karena mereka taat kepada Allah Subhaanahu wa Ta'aala dan mengerjakan hal yang diridhai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 18",
    "description": "Sungguh, Allah telah meridai orang-orang mukmin, yaitu para sahabat nabi ketika mereka berjanji setia kepadamu wahai nabi Muhammad untuk meluhurkan agama islam dan memerangi musuh-Musuhnya. Janji setia itu berlangsung di di bawah pohon di tempat bernama hudaibiyah, ketika nabi dan para sahabat dihalangi oleh kaum musyrik mekah melaksanakan umrah. Dia mengetahui apa yang ada dalam hati mereka menyangkut keteguhan iman dan keikhlasan berbaiat, lalu dia memberikan ketenangan atas mereka dan ketabahan dalam menghadapi musuh dan memberi balasan dengan kemenangan yang dekat, yaitu dalam peperangan di khaibar, tidak lama sesudah mereka kembali dari hudaibiyah. 19. Dan kepada mereka dianugerahkan harta rampasan perang yang banyak yang akan mereka peroleh dalam peperangan itu. Dan Allah mahaperkasa, tidak ada yang dapat menghalangi kehendak-Nya mahabijaksana dalam segala ketetapan-Nya."
  }
]