[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sungguh Allah telah meridhai orang-orang beriman saat mereka membai’atmu (wahai Nabi) dibawah pohon itu. Bai’at ini adalah bai’at ar-Ridhwan di Hudaibiyah. Allah mengetahui apa yang ada di dalam hati orang-orang beriman tersebut, yaitu iman, kejujuran, dan kesetiaan. Maka Allah menurunkan ketenangan kepada mereka, meneguhkan hati mereka dan menjanjikan mengganti apa yang tidak terwujud dengan perjanjian Hudaibiyah dengan sebuah kemenangan yang dekat, yaitu kemenangan pada Perang Khaibar dan harta rampasan perang yang besar yang mereka raih dari harta orang-orang Yahudi Khaibar. Allah MahaPerkasa dalam membalas musuh-musuhNya, Mahabijaksana dalam mengatur urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan Allah memberikan kepada mereka harta rampasan yang banyak yang mereka ambil dari penduduk Khaibar, dan Allah Maha Perkasa, tidak ada seorangpun yang bisa mengalahkan-Nya, Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan pengaturan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَغَانِمَ كَثِيرَةً يَأْخُذُونَهَا ۗ( Serta harta rampasan yang banyak yang dapat mereka ambil) Yakni dan Allah membalas kalian dengan harta ghanimah yang banyak, yaitu harta ghanimah dari kota Khaibar. وَكَانَ اللهُ عَزِيزًا حَكِيمًا(Dan adalah Allah Maha Perkasa lagi Maha Bijaksana) Yakni Maha Perkasa yang perbuatan dan firman-Nya penuh dengan hikmah dan kebijaksanaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah memberi imbalan kepada mereka juga berupa rampasan perang yang sangat banyak. Mereka mengambilnya (rampasan perang Khaibar) setelah menaklukannya pada tahun ke-7 Hijriyah dan melakukan perdamaian dengan musuh dengan memberi separuh dari hasil buminya yang berupa buah-buahan dan tanama. Allah adalah Dzat yang Maha Kuat, tidak ada yang mampu mengungguliNya dan Maha Bijaksana dalam mengatur urusan-urusan ciptaanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan harta rampasan perang yang banyak yang dapat mereka ambil. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Allah mengabarkan tentang karunia, rahmat, serta keridhaanNya terhadap kaum Mukminin yang berbai’at setia kepada Rasulullah dalam persitiwa pembai’atan yang membuat wajah mereka putih bersinar, dan dengan bai’at itu pun mereka mendapatkan kebahagiaan dunia dan akhirat. Penyebab bai’at ini, yaitu yang dikenal dengan Bai’at ar-Ridhwan adalah karena Allah ridha terhadap kaum Mukminin yang melakukan Bai’at setia itu. Disebut juga bai’at orang-orang yang berada di sekitar pohon, yaitu pada saat pembicaraan antara Rasulullah dan kaum musyrikin berlangsung dalam perjanjian Hudaibiyah mengenai sebab kedatangan Rasulullah ke Makkah, Rasulullah tidak datang untuk memerangi seorang pun, Rasulullah datang hanya untuk mengunjungi Baitullah serta untuk mengagungkannya. Kemudian Rasulullah mengirim Utsman bin Affan ke Makkah untuk mengutarakan tujuan kedatangan Rasulullah. Kemudian tersiar berita bohong bahwa Utsman dibunuh. Kemudian Rasulullah mengumpulkan kaum Mukminin yang turut bersama Rasulullah yang jumlahnya sekitar seribu lima ratus orang, dan mereka pun berbai’at setia kepada Rasulullah di bawah sebatang pohon untuk memerangi kaum musyrikin dan tidak akan lari hingga mereka gugur sekalipun. Kemudian Allah memberitahukan bahwa Dia ridha terhadap kaum Mukminin pada saat itu yang mana bai’at itu merupakan salah satu ketaatan terbesar serta ibadah paling luhur. “Maka Allah mengetahui apa yang ada di dalam hati mereka,” yakni, Allah mengetahui keimanan mereka, “lalu menurunkan ketenangan atas mereka,” sebagai rasa terima kasih Allah terhadap keimanan yang terdapat dalam diri mereka, Allah menambahkan petunjuk pada mereka dan Allah juga mengetahui kesedihan dalam benak mereka karena isi-isi perjanjian yang disyaratkan oleh kaum musyrikin terhadap Rasulullah, kemudian Allah menurunkan ketenangan yang membuat hati mereka kokoh dan damai, “dan memberi balasan kepada kepada mereka dengan kemenangan yang dekat (waktunya).” Yaitu penaklukan Khaibar yang hanya diikuti oleh orang-orang yang ikut serta dalam peristiwa Hudaibiyah, sehingga harta rampasannya khusus bagi mereka sebagai balasan untuk mereka dan sebagai ucapan terima kasih atas ketaatan terhadap Allah serta menunaikan amalan yang membuatNya ridha yang dilakukan oleh kaum Mukminin, “serta harta rampasan yang banyak yang dapat mereka ambil. Dan Allah Mahaperkasa lagi Mahabijaksana.” Allah memiliki keperkasaan dan kekuasaan yang memaksa segala sesuatu. Andai Allah berkehendak, tentu kaum Muslimin akan dapat mengalahkan kaum kafir dalam setiap peperangan, namun Allah Mahabijaksana, yang menguji sebagian mereka dengan yang lain; Allah menguji orang-orang Mukmin dengan kemenangan orang kafir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 19: Allah mengabarkan bahwasanya Dia memberikan kepada mereka rezeki rupa harta-harta rampasan perang yang mereka dapatkan dari harta harta peninggalan yahudi khaibar, Allah Maha Kuat dan Maha bijak dalam menjaga urusan makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia memiliki keperkasaan dan kekuasaan, dimana dengannya Dia tundukkan segala sesuatu. Jika Dia menghendaki, Dia mampu memenangkan kaum muslimin dalam setiap pertempuran, akan tetapi Dia Mahabijaksana, Dia uji sebagiannya dengan sebagian yang lain dan menguji orang mukmin dengan orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 19",
    "description": "Dan kepada mereka dianugerahkan harta rampasan perang yang banyak yang akan mereka peroleh dalam peperangan itu. Dan Allah mahaperkasa, tidak ada yang dapat menghalangi kehendak-Nya mahabijaksana dalam segala ketetapan-Nya. 20. Allah menjanjikan kepadamu harta rampasan perang yang banyak yang dapat kamu ambil dari negeri-negeri yang kamu taklukkan di masa yang akan datang. Akan tetapi Allah tidak membiarkan kamu sekalian menunggu berlama-lama, maka dia segerakan harta rampasan perang ini untukmu yaitu dalam perang khaibar. Dan dia menahan tangan manusia dari membinasa'kanmu agar kamu mensyukuri-Nya dan agar menjadi bukti bagi orang-orang mukmin bahwa Allah senantiasa menjaga dan menolong mereka atas musuh-Musuh-Nya dan agar dia oleh karena ketaatanmu kepada Allah dan rasul-Nya menunjukkan kamu ke jalan yang lurus."
  }
]