[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Kami memberimu kemenangan itu dan memudahkannya bagimu, karena Allah hendak mengampuni dosa-dosamu yang telah berlalu dan yang akan datang, sebab kemenangan ini mengandung ketaatan-ketaatan yang banyak dan terwujud melalui perjuangan yang melelahkan. Allah menyempurnakan nikmatNya atasmu dengan meninggikan agamamu dan memenangkanmu atas musuh-musuhmu, membimbingmu ke jalan yang lurus, agama yang tidak bengkok. Allah memenangkanmu dengan kemenangan yang kuat yang padanya Islam tidak melemah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Agar Allah mengampuni dosamu yang telah lalu sebelum kemenangan ini dan yang akan datang dan menyempurnakan kenikmatan-Nya kepadamu dengan kemenangan agamamu serta menuntunmu kepada jalan yang lurus, tidak ada bengkoknya, yaitu jalan Islam yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. لِّيَغْفِرَ لَكَ اللهُ (supaya Allah memberi ampunan kepadamu) Yakni agar bersama dengan ampunan itu terkumpul padamu kesempurnaan nikmat berupa penakhlukan, petunjuk ke jalan yang lurus, dan kemenangan yang besar; agar terkumpul padamu kemuliaan dunia dan akhirat. مَا تَقَدَّمَ مِن ذَنۢبِكَ(terhadap dosamu yang telah lalu) Yakni sebelum terjadinya penakhlukan. وَمَا تَأَخَّرَ(dan yang akan datang) Yakni setelah penahklukan. Pendapat lain mengatakan yang dimaksud dengan dosa yang telah lalu adalah dosa sebelum diutus sebagai rasul, dan yang akan datang adalah setelah menjadi rasul. وَيُتِمَّ نِعْمَتَهُۥ عَلَيْكَ(serta menyempurnakan nikmat-Nya atasmu) Dengan memenangkan agamamu di atas agama-agama yang lain. Pendapat lain mengatakan yakni dengan penakhlukan kota Makkah, kemudian kota Thaif di masa selanjutnya, sebab penakhalukan Hudaibiyah memudahkan terjadinya penakhlukan selanjutnya. Dan kesempurnaan nikmat adalah dengan penakhlukan Makkah. وَيَهْدِيَكَ(dan memberimu petunjuk) Yakni mengokohkanmu di atas petunjuk hingga Allah mencabut nyawamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Supaya Allah memberi ampunan atas dosa-dosamu sebelum dan sesudah anugerah kemenangan ini. Maksud dari dosa di sini adalah melakukan hal yang masih menjadi perselisihan utama dan dan lebih afdhal karena keistimewaan sebagai nabi. Allah menyempurnakan anugerah nikmat-Nya kepadamu dengan menampakkan kejayaan Islam. Allah juga telah memberi petunjuk kepada jalan yang lapang untuk menyiarkan risalahmu. Maksudnya adalah agar kamu mendapat tiga nikmat sekaligus. Tiga nikmat ini adalah pertolongan yang nyata, kesempurnaan nikmat dalam mendapat kemenangan dan mensyiarkan agama, dan petunjuk jalan yang lapang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Allah memberikan ampunan kepadamu atas dosamu yang lalu dan yang akan datang, menyempurnakan nikmatNya atasmu, dan menunjukkanmu ke jalan} jalan {yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Atas kemenangan itu, Allah menyebutkan beberapa hal berikutnya seraya berfirman, “Supaya Allah memberi ampunan kepadamu terhadap dosa yang telah lalu dan yang akan datang ,” hal itu disebabkan –wallahu a’alam- karena dampak baik perjanjian Hudaibiyah berupa berbagai ketaatan dan banyaknya orang yang masuk ke dalam Agama Allah, dan juga karena kesabaran Rasulullah dalalm menanggung beban butir-butir perjanjian yang tidak akan bisa dipikul melainkan oleh rasul-rasul ulul azmi (yang memiliki keteguhan hati). Dan inilah salah satu kehebatan dan karamah Rasulullah, yaitu dosa-dosa yang telah berlalu dan yang akan datang telah diampuni oleh Allah, “serta menyempurnakan nikmatNya atasmu,” dengan mengokohkan Agamamu dan memberikan kemenangan kepadamu atas musuh-musuhmu serta memperluas dakwahmu, “dan memimpin kamu kepada jalan yang lurus,” dengan jalan itu engkau mendapatkan kesenangan dan keberuntungan abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 2: Ketahuilah wahai Nabi bahwa jihad, perjuangan dan sabar ini serta apa yang kamu bawa dalam penaklukkan ini Allah telah mudahkan bagimu; Agar Allah mengampuni dosamu yang lalu dan yang akan datang, dan agar Allah menyempurnakan nikmat-Nya atasmu dengan menampakkan agamamu (Islam); Dan juga agar Allah memberikan petunjuk kepadamu di atas jalan yang lurus yang tidak bengkok dan menyimpang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menguatkan agama-Nya, menolong Beliau terhadap musuh-musuhnya dan menjadikan kalimat-Nya tinggi. Dimana dengannya seseorang akan mendapatkan kebahagiaan yang kekal dan keberuntungan yang selamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 2",
    "description": "2-3. Agar Allah memberikan ampunan kepadamu, wahai nabi Muhammad atas dosamu, yakni kekeliruan yang dapat dianggap sebagai dosa sesuai dengan kedudukanmu yang mulia, baik kekeliruan yang terjadi di masa yang lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dengan meluhurkan agamamu dan menunjukimu ke jalan yang lurus yang membimbingmu kepada keridaan tuhan, dan agar Allah menolongmu terhadap musuh-Musuhmu dengan pertolongan yang kuat yang tidak dapat dikalahkan oleh siapa pun"
  }
]