[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Allah menjanjikan harta rampasan perang yang besar kepada kalian yang kalian ambil pada saat yang telah Allah tetapkan, maka Allah menyegerakan harta rampasan Perang Khaibar dan Allah menahan tangan-tangan manusia dari kalian, kalian tidak ditimpa keburukan yang disembunyikan oleh musuh-musuh kalian, yaitu peperangan, mereka juga tidak mengganggu apa yang kalian tinggalkan di belakang kalian di Madinah, agar kekalahan musuh kalian, kemenangan kalian atas mereka dan harta rampasan perang yang kalian dapat bisa menjadi sebuah pelajaran bagi kalian, petunjuk bahwa Allah menjaga dan melindungi kalian, membimbing kalian ke jalan lurus yang tidak bengkok. Allah juga menjanjikan kalian harta rampasan perang yang lain yang kalian tidak berkuasa atasnya tetapi Allah menguasainya, ia dibawah pengaturan Allah dan kekuasanNya. Allah menjanjikan kepada kalian, dan apa yang Allah janjikan pasti akan terjadi. Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkanNYa. Bila orang-orang kafir Quraisy memerangi kalian di Makkah, niscaya mereka akan kalah dan memberi kalian punggung-punggung mereka (karena melarikan dri dan kalah), sebagaimana yang dilakukan oleh pihak yang kalah dalam perang, kemudian mereka tidak memiliki penolong dan pembela selain Allah untuk membantu mereka memerangi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Allah telah menjanjikan kepada kalian -wahai orang-orang yang beriman- harta rampasan yang banyak yang kalian ambil dalam peperangan-peperangan Islam yang akan datang, Allah telah menjadikan untuk kalian harta rampasan Khaibar, menahan tangan orang-orang Yahudi ketika mereka hendak mencelakai keluarga kalian setelah kalian pergi, supaya rampasan yang disegerakan ini menjadi tanda bagi kalian atas pertolongan Allah dan peneguhan-Nya untuk kalian dan supaya Allah menunjuki kalian ke jalan yang lurus, yang tidak ada bengkoknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Allah memberi kabar gembira bagi orang-orang beriman dengan janji mulia-Nya berupa keberhasilan mendapatkan banyak harta ghanimah berkat jihad dan kesabaran mereka. Allah menyegerakan pemenuhan janji ini bagi para sahabat berupa harta ghanimah Khaibar, dengan menghalangi tangan-tangan musuh untuk melakukan keburukan terhadap mereka, sehingga mereka dapat mengambil harta ghanimah tanpa melakukan jihad dan peperangan; dan agar harta ghanimah ini menjadi bukti yang jelas atas kuasa Allah dalam menolong orang-orang beriman dan memberi mereka petunjuk menuju jalan yang benar yang dapat mengantarkan ke surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَعَدَكُمُ اللهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا (Allah menjanjikan kepada kamu harta rampasan yang banyak yang dapat kamu ambil) Dengan harta ghanimah dari tempat yang akan ditakhlukkan sampai hari kiamat kelak, yang akan mereka ambil pada waktu terjadinya penakhlukan itu. فَعَجَّلَ لَكُمْ هٰذِهِۦ(maka disegerakan-Nya harta rampasan ini untukmu) Yaitu harta ghanimah Khaibar. وَكَفَّ أَيْدِىَ النَّاسِ عَنكُمْ(dan Dia menahan tangan manusia dari (membinasakan)mu) Yakni Allah menahan tangan-tangan orang Quraisy dari kalian pada perang di Hudaibiyah dengan perjanjian damai. Pendapat lain mengatakan bahwa Allah menahan tangan-tangan penduduk Khaibar dan sekutu-sekutunya sehingga tidak dapat memerangi kalian, dan Allah memasukkan ketakutan ke dalam hati mereka. Allah juga menahan tangan ‘Uyainah bin Hishn al-Fazari dan ‘Auf bin Malik an-Nashri serta orang-orang yang bersamanya ketika mereka datang untuk menolong penduduk Khaibar saat Rasulullah mengepung mereka. وَلِتَكُونَ ءَايَةً لِّلْمُؤْمِنِينَ(dan agar hal itu menjadi bukti bagi orang-orang mukmin) Sehingga dengan itu mereka mengetahui kebenaran Rasulullah dalam segala yang dia janjikan kepada mereka. وَيَهْدِيَكُمْ صِرٰطًا مُّسْتَقِيمًا(dan agar Dia menunjuki kamu kepada jalan yang lurus) Yakni dengan bukti itu Allah menambah hidayah kalian, atau meneguhkan hidayah kalian menuju jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai orang-orang mukmin Allah menjanjikan kalian rampasan perang yang banyak yang dapat kalian ambil dari musuh-musuh kalian sebagai hasil dari penaklukan-penaklukan (kalian) sampai hari kiamat. Lalu Allah memberi kalian rampasan perang Khaibar dan mencegah tangan-tangan orang Quraisy, Yahudi dan orang-orang Baduwi di sekitar Madinah yang tidak ikut berperang dengan mendatangkan teror dalam hati mereka agar tidak cepat-cepat mengambil harta rampasan ini dan mencegar orang Yahudi untuk mengambilnya, sebagai bukti kebenaran semua janji Allah SWT dan rasulNya yang telah dijanjikan kepada mereka sebelumnya. Allah juga menunjukkan kalian jalan yang lurus dengan bukti (tanda-tanda) tersebut supaya kalian menaati dan ridha terhadapNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menjanjikan kepada kalian harta rampasan perang yang banyak yang dapat kalian ambil, maka Dia menyegerakan ini} harta rampasan Khaibar {untuk kalian. {Dia menahan} Dia menahan {tangan manusia dari kalian, agar menjadi bukti bagi orang-orang mukmin} tanda atas pertolongan Allah bagi orang-orang mukmin {dan menunjukkan kalian ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Allah menjanjikan kepada kamu harta rampasan yang banyak yang dapat kamu ambil.” Harta rampasan perang tersebut mencakup semua harta rampasan perang yang didapatkan oleh seluruh kaum Muslimin hingga Kiamat, “maka disegerakanNya harta rampasan ini,” yakni, harta rampasan perang Khaibar. Janganlah kalian mengira harta rampasan itu hanya satu-satunya harta rampasan perang, namun masih terdapat berbagai harta rampasan perang lain setelahnya. “Dan,” pujilah Allah pada saat, “Dia menahan tangan manusia,” yakni mampu memerangi kalian dan berkeinginan untuk memerangi kalian, “dari (membinasakan) mu.” Ini merupakan nikmat dan keringanan yang diberikan pada kalian, “dan agar itu,” yakni harta rampasan perang “menjadi bukti bagi orang-orang Mukmin,” yang dengan bukti itu orang-orang Mukmin dapat mengetahui benarnya berita Allah dan janjiNya yang haq, serta balasanNya yang akan diberikan kepada orang-orang yang beriman. Dan bahwasanya Allah yang menakdirkan hal itu juga akan menakdirkan yang lainnya, “dan agar Dia menunjuki kamu,” dengan berbagai sebab yang ditetapkan pada kalian “kepada jalan yang lurus,” berupa ilmu, Iman, dan amal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 20: Ketahuilah Bahwasanya Allah menjanjikan kepada kalian wahai orang-orang yang beriman harta-harta rampasan perang yang banyak yang diambil setelah penaklukan, yang Allah sempurnakan dihadapan kalian pada suatu saat nanti, dan diantara karunia yang diberikan kepada kalian adalah Allah menyegerakan harta rampasan perang kepada kalian dengan tanpa jihad dan juga tanpa peperangan, pada saat itu Allah memberikan rasa takut di hati-hati mereka ( yahudi ) ; di mana Allah bukakan benteng-benteng mereka yang kemudian mereka menyerah. ketahuilah bahwa karunia Allah yang diberikan kepada kalian dengan cepat dan mencukupi untuk kalian adalah sebagai tanda bahwasanya Nabi kalian adalah orang yang benar, dan bahwasanya Allah menjaga kalian, menolong kalian, serta memberikan petunjuk yaitu jalan yang terang di antara jalan yang menyimpang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari penaklukkan-penaklukkan yang dilakukan. Hal ini mencakup semua ghanimah yang diperoleh kaum muslimin sampai hari Kiamat. Maksudnya, Allah menjanjikan harta rampasan yang banyak kepada kaum muslimin, sebagai pendahuluan dari harta rampasan yang banyak yang dikaruniakan-Nya itu, Allah memberikan harta rampasan pada perang Khaibar itu dengan segera. Pujilah Dia, karena Dia menahan tangan manusia dari membinasakan kamu. Yang berkuasa memerangi kamu. Itu adalah nikmat dan keringanan untukmu. Maksudnya, ketika Nabi shallallahu 'alaihi wa sallam hendak pergi menuju Khaibar dan mengepung penduduknya, maka beberapa suku dari suku Asad dan Ghatfan hendak menyerang keluarga kaum muslimin di Madinah, maka Allah Subhaanahu wa Ta'aala menahan mereka dari melakukan penyerangan dengan menanamkan rasa takut ke dalam hati mereka. Ada pula yang menafsirkan, bahwa Allah Subhaanahu wa Ta'aala menahan tangan manusia, yakni penduduk Mekah dari membinasakanmu dengan adanya perjanjian damai. Terhadap kemenangan mereka. Yakni agar kaum mukmin berdalil dengannya terhadap kebenaran berita Allah, janji-Nya yang benar, dan pahalan-Nya untuk kaum mukmin, dan bahwa yang menaqdirkan demikian akan menaqdirkan lagi yang lain. Dengan sebab yang ditetapkan-Nya. Berupa ilmu, iman maupun amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 20",
    "description": "Allah menjanjikan kepadamu harta rampasan perang yang banyak yang dapat kamu ambil dari negeri-negeri yang kamu taklukkan di masa yang akan datang. Akan tetapi Allah tidak membiarkan kamu sekalian menunggu berlama-lama, maka dia segerakan harta rampasan perang ini untukmu yaitu dalam perang khaibar. Dan dia menahan tangan manusia dari membinasa'kanmu agar kamu mensyukuri-Nya dan agar menjadi bukti bagi orang-orang mukmin bahwa Allah senantiasa menjaga dan menolong mereka atas musuh-Musuh-Nya dan agar dia oleh karena ketaatanmu kepada Allah dan rasul-Nya menunjukkan kamu ke jalan yang lurus. 21. Dan Allah telah menjanjikan pula harta rampasan yang lain yang kamu peroleh dari kemenangan-kemenangan atas negeri-negeri lain yang tidak dapat kamu perkirakan, seperti kemenangan atas negeri persia dan romawi, tetapi sesungguhnya Allah telah menentukannya dengan ilmu-Nya dan kekuasaan-Nya. Dan Allah mahakuasa atas segala sesuatu, tidak ada yang menghalangi kehendak-Nya."
  }
]