[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Allah menjanjikan harta rampasan perang yang besar kepada kalian yang kalian ambil pada saat yang telah Allah tetapkan, maka Allah menyegerakan harta rampasan Perang Khaibar dan Allah menahan tangan-tangan manusia dari kalian, kalian tidak ditimpa keburukan yang disembunyikan oleh musuh-musuh kalian, yaitu peperangan, mereka juga tidak mengganggu apa yang kalian tinggalkan di belakang kalian di Madinah, agar kekalahan musuh kalian, kemenangan kalian atas mereka dan harta rampasan perang yang kalian dapat bisa menjadi sebuah pelajaran bagi kalian, petunjuk bahwa Allah menjaga dan melindungi kalian, membimbing kalian ke jalan lurus yang tidak bengkok. Allah juga menjanjikan kalian harta rampasan perang yang lain yang kalian tidak berkuasa atasnya tetapi Allah menguasainya, ia dibawah pengaturan Allah dan kekuasanNya. Allah menjanjikan kepada kalian, dan apa yang Allah janjikan pasti akan terjadi. Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkanNYa. Bila orang-orang kafir Quraisy memerangi kalian di Makkah, niscaya mereka akan kalah dan memberi kalian punggung-punggung mereka (karena melarikan dri dan kalah), sebagaimana yang dilakukan oleh pihak yang kalah dalam perang, kemudian mereka tidak memiliki penolong dan pembela selain Allah untuk membantu mereka memerangi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan Allah juga menjanjikan kepada kalian harta-harta rampasan lain yang belum kalian dapatkan pada saat ini, hanya Allah saja yang Mahakuasa atas hal itu, dan itu semua berada dalam pengetahuan-Nya dan pengaturan-Nya, dan Allah Mahakuasa atas segala sesuatu, tidak ada yang melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. hai orang-orang beriman, Allah telah menjanjikan kalian harta ghanimah yang lain yang belum dapat kalian ambil saat ayat ini turun, namun Allah Maha Mengetahui bahwa harta itu akan menjadi milik kalian dengan izin Allah. Allah Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Nya. Ibnu ‘Abbas meriwayatkan (وأخرى لم تقدروا عليها قد أحاط الله بها) yakni penakhlukan-penakhlukan yang terjadi hingga hari ini. (Diriwayatkan oleh Abu Daud at-Thayalisi, sanad para perawinya tsiqat kecuali Sammak al-hanafi yang haditsnya masih dapat diterima, sehingga sanadnya adalah hasan. Lihat: Tafsir Ibnu Katsir 4/191-192. Dan diriwayatkan oleh al-Baihaqi dengan lafadz: “Yakni penakhlukan yang kalian dapatkan setelahnya”. Kitab Dala’il an-Nubuwwah 4/163)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَأُخْرَىٰ لَمْ تَقْدِرُوا۟ عَلَيْهَا (Dan (telah menjanjikan pula kemenangan-kemenangan) yang lain (atas negeri-negeri) yang kamu belum dapat menguasainya) Ibnu ‘Abbas dan Mujahid mengatakan: yang dimaksud adalah penakhlukan-penakhlukkan yang diberikan Allah bagi kaum muslimin setelah itu. Pendapat lain mengatakan yang dimaksud adalah penakhlukan kota Makkah itu sendiri. قَدْ أَحَاطَ اللهُ بِهَا ۚ (yang sungguh Allah telah menentukan-Nya) Yakni Allah telah mengepungnya bagi kalian agar kalian dapat menakhlukkannya dan mengambil ghanimahnya. Meskipun negeri-negeri itu belum mampu mereka kalahkan namun ia telah terkepung dan tidak dapat lolos dari mereka. Dan Allah mengetahui bahwa negeri-negeri itu akan menjadi milik mereka. وَكَانَ اللهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرًا(Dan adalah Allah Maha Kuasa atas segala sesuatu) Tidak ada yang mampu mengalahkan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Allah juga menjanjikan untuk kalian penaklukan dan rampasan perang lainnya yaitu rampasan perang melawan Persia, Roma, serta suku Hawazin dan Tsaqif saat perang Hunain. Kalian belum bisa menaklukkan mereka sekerang karena musuh-musuh itu masih terlalu kuat. Akan tetapi Allah memberitahu kaiian bahwa penaklukan itu akan menjadi milik kalian. Allah selalu berkuasa sepenuhnya atas sesuatu. Tidak ada yang bisa melemahkanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan yang lain} harta rampasan lain {yang kalian belum dapat menguasainya, tetapi sungguh Allah telah menguasainya. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Dan (telah menjanjikan pula kemenangan-kemenangan) yang lain,” artinya, allah menjanjikan harta rampasan lain, “(atas negeri-negeri) yang kamu belum dapat menguasainya,” di waktu atar ini turun, “yang sungguh Allah telah menentukanNya.” Artinya, Allah Mahakuasa atas hal itu dan hal itu berada di bawah pengaturan serta kekuasaanNya yang dijanjikan kepada kalian, karena itu janji Allah pasti akan terlaksana karena Kuasa Allah Yang Mahasempurna. Karena itulah Allah berfirman, “Dan Allah Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 21: Allah menjelaskan bahwasanya dia menjanjikan pada kalian harta-harta rampasan perang yang lainnya, tapi tidak sama dengan kondisi yang sebelumnya, maksudnya adalah Fathul Mekah; dimana Allah membukakan kepada kalian setelah peperangan sebelumnya, dan diantara karunia Allah adalah menjaga kalian, Allah Maha Kuasa atas segala sesuatunya, Allah tidak dapat dilemahkan dengan sesuatu apapun baik di bumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kemenangan terhadap bangsa Persia dan Romawi. Maksudnya, Allah telah menjanjikan kepada kaum muslimin untuk menaklukkan negeri-negeri yang lain yang di waktu itu mereka belum dapat menaklukkannya; tetapi negeri-negeri itu telah dipastikan Allah untuk ditaklukkan oleh kaum muslimin dan dijaga-Nya dari penaklukan-penaklukan orang-orang lain karena sempurnanya kekuasaan Allah Subhaanahu wa Ta'aala. Janji Allah ini telah terbukti dengan ditaklukkannya negeri-negeri Persia dan Rumawi oleh kaum muslimin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 21",
    "description": "Dan Allah telah menjanjikan pula harta rampasan yang lain yang kamu peroleh dari kemenangan-kemenangan atas negeri-negeri lain yang tidak dapat kamu perkirakan, seperti kemenangan atas negeri persia dan romawi, tetapi sesungguhnya Allah telah menentukannya dengan ilmu-Nya dan kekuasaan-Nya. Dan Allah mahakuasa atas segala sesuatu, tidak ada yang menghalangi kehendak-Nya. 22. Dan sekiranya orang-orang yang kafir itu yakni kaum musyrik mekah yang telah menandatangani perjanjian hudaibiyah memerangi kamu, pastilah mereka akan berbalik melarikan diri karena takut kepadamu dan mereka tidak akan mendapatkan pelindung yang melindungi mereka dari kebinasaan dan penolong dapat menolong mereka dari kekalahan."
  }
]