[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-22. Allah menjanjikan harta rampasan perang yang besar kepada kalian yang kalian ambil pada saat yang telah Allah tetapkan, maka Allah menyegerakan harta rampasan Perang Khaibar dan Allah menahan tangan-tangan manusia dari kalian, kalian tidak ditimpa keburukan yang disembunyikan oleh musuh-musuh kalian, yaitu peperangan, mereka juga tidak mengganggu apa yang kalian tinggalkan di belakang kalian di Madinah, agar kekalahan musuh kalian, kemenangan kalian atas mereka dan harta rampasan perang yang kalian dapat bisa menjadi sebuah pelajaran bagi kalian, petunjuk bahwa Allah menjaga dan melindungi kalian, membimbing kalian ke jalan lurus yang tidak bengkok. Allah juga menjanjikan kalian harta rampasan perang yang lain yang kalian tidak berkuasa atasnya tetapi Allah menguasainya, ia dibawah pengaturan Allah dan kekuasanNya. Allah menjanjikan kepada kalian, dan apa yang Allah janjikan pasti akan terjadi. Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkanNYa. Bila orang-orang kafir Quraisy memerangi kalian di Makkah, niscaya mereka akan kalah dan memberi kalian punggung-punggung mereka (karena melarikan dri dan kalah), sebagaimana yang dilakukan oleh pihak yang kalah dalam perang, kemudian mereka tidak memiliki penolong dan pembela selain Allah untuk membantu mereka memerangi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Jika seandainya orang-orang kafir kepada Allah dan Rasul-Nya memerangi kalian -wahai orang-orang yang beriman- niscaya mereka akan berbalik melarikan diri dalam keadaan kalah di hadapan kalian, kemudian mereka tidak mendapatkan pelindung yang melindungi urusan mereka dan tidak pula mendapatkan penolong yang menolong mereka dalam memerangi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Allah menjelaskan perlindungan-Nya bagi Rasulullah dan orang-orang beriman: Andai saja orang-orang kafir Makkah memerangi kalian niscaya mereka akan kalah dan lari ketakutan, kemudian mereka tidak akan mendapatkan orang yang melindungi mereka dan membantu mereka untuk berperang. Sunnatullah yang telah berlaku bagi umat-umat terdahulu bahwa Allah akan menolong hamba-hamba-Nya yang beriman, dan mengalahkan musuh-musuh-Nya yang kafir. Sunnatullah ini tidak akan berubah bagi seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَوْ قٰتَلَكُمُ الَّذِينَ كَفَرُوا۟ لَوَلَّوُا۟ الْأَدْبٰرَ (Dan sekiranya orang-orang kafir itu memerangi kamu pastilah mereka berbalik melarikan diri ke belakang) Yakni orang-orang kafir Quraisy pada saat di Hudaibiyah. ثُمَّ لَا يَجِدُونَ وَلِيًّا(kemudian mereka tiada memperoleh pelindung) Yang melindungi mereka untuk memerangi kalian. وَلَا نَصِيرًا(dan tidak (pula) penolong) Yang menolong mereka dalam melawan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Jika sekirannya orang-orang kafir Quraisy itu menyerang kalian saat perjanjian Hudaibiyah, sungguh mereka pasti akan melarikan diri dan ditaklukkan, lalu tidak akan ditemukan di antara mereka seorang yang dapat melindungi dan mencegah mereka dari kekalahan dan kehinaan, serta menolong mereka dari serangan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekiranya orang-orang yang ingkar itu memerangi kalian, sungguh mereka akan berbalik} sungguh mereka akan dikalahkan dan berpaling ke belakang {kemudian mereka tidak akan mendapati pelindung dan penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Ini merupakan berita gembira dari Allah untuk hamba-hambaNya yang beriman, bahwasanya Allah akan memberikan kemenangan untuk orang-orang yang beriman terhadap para musuhnya yang kafir, dan bahwasanya jika orang-orang yang beriman menghadapi dan memerangi orang-orang kafir, “pastilah mereka berbalik melarikan diri kebelakang (kalah) kemudian mereka tiada memperoleh pelindung,” yang dapat menjaga mereka, “ dan tidak (pula) penolong,” yang dapat menolong dan membantu mereka dari serangan orang-orang Mukmin; mereka justru akan direndahkan dan dikalahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 22: Ketahuilah wahai orang-orang yang beriman bahwasanya seandainya kalian berperang yaitu memerangi orang-orang kafir dari penduduk Mekkah, sungguh mereka tidak akan melawan kalian (berhadapan secara langsung) dan juga mereka tidak akan bertahan dalam peperangan, mereka akan mencoba menyerang kalian dari belakang; maka ketika tidak mereka dapati celah untuk berperang memerangi kalian, dan tidak ada juga penolong yang menolong mereka atas kalian, mereka akan berhenti memerangi kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan kabar gembira dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya yang mukmin, yaitu bahwa Dia akan menolong mereka terhadap musuh mereka, dan bahwa orang-orang kafir itu jika maju menghadapi kaum mukmin tentu mereka akan berbalik melarikan diri. Yang membantu dan mendorong mereka untuk berperang, sehingga mereka senantiasa terlantar –wal ‘iyaadz billah- dan kalah, dan ini adalah sunnatullah pada umat-umat terdahulu, dan kita tidak akan menemukan terjadinya perubahan pada sunnatullah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 22",
    "description": "Dan sekiranya orang-orang yang kafir itu yakni kaum musyrik mekah yang telah menandatangani perjanjian hudaibiyah memerangi kamu, pastilah mereka akan berbalik melarikan diri karena takut kepadamu dan mereka tidak akan mendapatkan pelindung yang melindungi mereka dari kebinasaan dan penolong dapat menolong mereka dari kekalahan. 23. Demikianlah hukum Allah, yakni ketetapan Allah senantiasa menolong orang-orang yang beriman dan membinasakan orang-orang yang mendustakan-Nya. Itu adalah kebiasaan yang telah berlaku sejak dahulu, kamu sekali-kali tidak akan menemukan perubahan pada hukum Allah itu."
  }
]