[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sunnah Allah yang Dia tetapkan berlaku sebelumnya, bahwa Dia menolong dan memengkan bala tentaraNya atas musuh-musuhNya. Dan kamu wahai Nabi, tidak akan menemukan perubahan pada Sunnah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kemenangan orang-orang yang beriman dan kekalahan orang-orang kafir adalah hal yang pasti dalam setiap masa dan di setiap tempat, itu adalah ketetapan Allah dalam umat-umat yang telah lalu sebelum para pendusta itu. Dan engkau -wahai Rasul- tidak akan mendapati perubahan dalam sunnatullah (ketetapan Allah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. سُنَّةَ اللهِ الَّتِى قَدْ خَلَتْ مِن قَبْلُ ۖ (Sebagai suatu sunnatullah yang telah berlaku sejak dahulu) Bahwa Allah akan menolong kekasih-kekasih-Nya dalam melawan musuh-musuh-Nya. وَلَن تَجِدَ لِسُنَّةِ اللهِ تَبْدِيلًا(kamu sekali-kali tiada akan menemukan perubahan bagi sunnatullah itu) Namun ketetapan itu akan tetap berlaku dan tidak akan berganti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Inilah hukum-hukum dan undang-undang Allah yang telah umum dan berlaku sejak dulu yang berupa pertolongan terhadap orang-orang mukmin dan penaklukan terhadap orang-orang kafir yang menentang. Kamu tidak akan pernah mendapati perubahan bagi sunnatullah yang kekal dan bersifat umum ini. Sesungguhnya sunnatullah ini kekal dan terus berkelanjutan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Demikianlah) sunatullah} cara Allah dan ketentuan Allah dengan menolong para waliNya atas musuh-musuhNya {yang sungguh telah berlaku} berlaku {sebelumnya. Kalian sekali-kali tidak akan menemukan perubahan padanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Hal itu merupakan Sunnatullah terhadap berbagai umat sebelumnya, yaitu para tentara Allah pasti menang, “ dan kamu sekali-kali tiada akan menemukan perubahan bagi Sunnatullah itu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 23: Ketahuilah bahwasanya ini semua adalah sunnatullah yang telah diberikan kepada umat-umat sebelumnya yaitu pertolongan Allah bagi hamba-Nya yang beriman. Maka jika mereka kokoh di atas perintah-perintah Allah, Allah akan menghinakan orang-orang kafir. Dan itu adalah sunnatullah yang tetap abadi dan tidak didapati bahwasanya sunnatullah tergantikan, serta tidak akan didapati bahwasanya sunnatullah akan berubah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sunnatullah artinya hukum Allah yang telah ditetapkannya, yaitu bahwa kaum mukmin akan menang dan kaum kafir akan kalah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 23",
    "description": "Demikianlah hukum Allah, yakni ketetapan Allah senantiasa menolong orang-orang yang beriman dan membinasakan orang-orang yang mendustakan-Nya. Itu adalah kebiasaan yang telah berlaku sejak dahulu, kamu sekali-kali tidak akan menemukan perubahan pada hukum Allah itu. 24. Dan dialah yang mencegah tangan mereka yakni orang-orang musyrik mekah yang berangkat untuk menyerbu tentara rasulullah di hudaibiyah, dari membinasakan kamu dan mencegah tangan kamu dari membinasakan mereka ketika kamu berada di tengah kota mekah setelah Allah memenangkan kamu atas mereka, yakni menjadikan kamu memperoleh apa yang kamu inginkan dari mereka melalui perjanjian hudaibiyah. Dan Allah maha melihat apa yang kamu kerjakan."
  }
]