[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah yang menahan tangan (kejahatan) orang-orang musyrik terhadap kalian dan tangan kalian tehadap mereka di lembah Makkah sesudah kalian menangkap mereka, sehingga mereka berada dibawah kekuasaan kalian. Orang-orang musyrik itu adalah orang-orang yang hendak menyerang markas Rasulullah di Hudaibiyah, namun kaum Muslimin menangkap mereka, tetapi kaum Muslimin tidak membunuh mereka, sebaliknya melepaskan mereka, jumlah mereka sekitar 80 orang. Allah Maha Melihat perbuatan kalian, tidak ada sesuatu yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan Dia lah yang menahan tangan orang-orang musyrik dari diri kalian ketika datang kurang lebih delapan puluh orang dari mereka untuk mencelakai kalian di Hudaibiyah, dan menahan tangan kalian dari mereka sehingga kalian tidak membunuh mereka dan tidak menyakiti mereka, justru mereka kalian lepaskan setelah Allah menjadikan kalian mampu menawan mereka. Dan Allah Maha Melihat apa yang kalian kerjakan, tidak ada sedikitpun dari amal perbuatan kalian yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Allah-lah yang melindungi kalian dari tangan orang-orang musyrik yang berusaha menghancurkan kalian dan menahan tangan kalian dari mereka pada perjanjian Hudaibiyah sehingga kalian mengampuni mereka setelah kalian dapat mengalahkan mereka. Allah Maha Melihat segala yang kalian perbuat, tidak ada yang tersembuyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَهُوَ الَّذِى كَفَّ أَيْدِيَهُمْ عَنكُمْ وَأَيْدِيَكُمْ عَنْهُم بِبَطْنِ مَكَّةَ مِنۢ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ ۚ (Dan Dialah yang menahan tangan mereka dari (membinasakan) kamu dan (menahan) tangan kamu dari (membinasakan) mereka di tengah kota Mekah sesudah Allah memenangkan kamu atas mereka) Yakni Allah menghalangi tangan-tangan kaum musyrikin dari kaum muslimin dan tangan-tangan kaum muslimin dari kaum musyrikin ketika mereka datang untuk menghalangi Rasulullah dan orang-orang yang bersamanya untuk memasuki baitullah pada perang Hudaibiyah, dan Hudaibiyah inilah yang dimaksud dengan (بطن مكة). Terdapat 80 lelaki dari penduduk Makkah yang menuju Rasulullah dari sisi gunung Tan’im dengan persenjataan lengkap, mereka berharap Rasulullah dalam keadaan lalai dari musuh, namun kaum muslimin menghalangi mereka, dan akhirnya meninggalkan mereka. وَكَانَ اللهُ بِمَا تَعْمَلُونَ بَصِيرًا(dan adalah Allah Maha Melihat apa yang kamu kerjakan) Tidak ada yang tersembunyi dari-Nya sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Allah adalah Dzat yang mencegah tangan-tangan orang kafir untuk menyakiti kalian dan mencegah tangan-tangan kalian untuk menyakiti mereka di lembah Hudaibiyah yang dekat dengan Mekah ketika mereka datang menghentikan Rasulallah SAW dan sahabat-sahabatnya untuk menuju Baitul Haram setelah menunjukkan kepada kalian kekuatan mereka lalu membuat kalian menunjukkan bahwa kalian juga lebih unggul atas mereka. Saat itu, 8 lelaki Mekkah mengelilingi pasukan-pasukan muslim untuk memukul mereka, lalu beberapa pasukan muslim menantang mereka sehingga mereka pergi. Allah mengetahui dengan jelas apa yang kalian perbuat dalam mengatasi urusan-urusan kalian. Imam Muslim dan lainnya dari Anas berkata: Saat hari perjanjian Hudaibiyah, 8 orang laki-laki turun dari Jabal Tan’inm menghadang Rasulallah SAW. Mereka ingin menipu Rasulallah SAW, lalu kaum muslim mencegah mereka, kemudian mereka pergi. Setelah itu, ayat ini turun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menahan} mencegah {tangan mereka dari kalian dan menahan tangan kalian dari mereka di tengah Mekkah} pada perjanjian Hudaibiyyah di dekat Mekkah {setelah Dia memenangkan kalian atas mereka} membuat kalian berkuasa untuk menawan mereka dan mereka sekitar delapan puluh laki-laki {Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Allah berfirman memberikan keselamatan bagi hamba-hambaNya dari keburukan kaum kafir serta peperangan mereka, dimana Dia berfirman, “dan Dia-lah yang menahan tangan mereka,” yaitu para penduduk Makkah” dari (membinasakan) kamu dan (menahan) tangan kamu dari (membinasakan) mereka di tengah kota Makkah sesudah Allah memenangkan kamu atas mereka,” yakni, setelah kalian mengalahkan mereka sehingga mereka berada dalam kekuasaan kalian meski tanpa perjanjian, mereka berjumlah sekitar 80 orang, mereka berusaha menyusup ke dalam kaum Muslimin agar dapat mengalahkan mereka kala mereka lengah, namun mereka melihat kaum Muslimin senantiasa waspada hingga mereka pun tertangkap lalu dilepaskan dan tidak dibunuh, semua itu adalah sebagai rahmat Allah terhadap kaum Mukminin karena tidak membunuh para musuh itu. “dan Allah Maha Melihat apa yang kamu kerjakan.” Allah akan membalas semua orang berdasarkan amalnya dan Allah akan mengatur kalian orang-orang yang beriman secara baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 24: Ketahuilah Dialah yang menahan tangan mereka dari (membinasakan) kamu dan (menahan) tangan kamu dari (membinasakan) mereka di tengah kota Mekah sesudah Allah memenangkan kamu atas mereka, dan adalah Allah Maha Melihat apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman memberikan nikmat perlindungan kepada hamba-hamba-Nya dari kejahatan orang-orang kafir dan dari penyerangan mereka. Yaitu penduduk Mekkah. Yaitu di Hudaibiyah. Imam Ahmad meriwayatkan dari Anas bin Malik radhiyallahu 'anhu ia berkata: Pada hari Hudaibiyah ada 80 orang penduduk Mekah yang bersenjata mendatangi Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya dari arah gunung Tan’im dengan maksud menyerang mereka (Rasul shallallahu 'alaihi wa sallam dan para sahabat) secara tiba-tiba, lalu Beliau mendoakan keburukan atas mereka, kemudian mereka tertangkap.” ‘Affan berkata, “Maka Beliau memaafkan mereka. Dan turunlah ayat ini, “Dan Dia-lah yang mencegah tangan mereka dari (membinasakan) kamu dan (mencegah) tangan kamu dari (membinasakan) mereka di tengah kota Mekah, setelah Allah memenangkan kamu atas mereka.” Dia akan membalas orang yang beramal dengan amalnya dan mengatur kamu wahai kaum mukmin dengan pengaturan-Nya yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 24",
    "description": "Dan dialah yang mencegah tangan mereka yakni orang-orang musyrik mekah yang berangkat untuk menyerbu tentara rasulullah di hudaibiyah, dari membinasakan kamu dan mencegah tangan kamu dari membinasakan mereka ketika kamu berada di tengah kota mekah setelah Allah memenangkan kamu atas mereka, yakni menjadikan kamu memperoleh apa yang kamu inginkan dari mereka melalui perjanjian hudaibiyah. Dan Allah maha melihat apa yang kamu kerjakan. 25. Merekalah orang-orang kafir yang menghalang-halangi kamu memasuki masjidilharam untuk melaksanakan umrah dan menghambat hewan-hewan kurban sebanyak 70 onta yang akan kamu sembelih dan dagingnya kamu bagikan kepada fakir miskin untuk sampai ke tempat penyembelihannya yang paling utama di marwah. Dan kalau bukanlah karena ada beberapa orang beriman laki-laki dan perempuan yang kesemuanya menetap di kota mekah yang tidak kamu ketahui sosoknya secara pasti dan me-reka bertempat tinggal berbaur dengan orang-orang mekah yang sebagian masih kafir, tentulah kamu akan membunuh mereka yang menyebabkan kamu ditimpa kesulitan seperti penyesalan dan kewajiban membayar diyat akibat membunuh mereka tanpa kamu sadari bahwa mereka adalah saudaramu seiman. Bahwa Allah mencegah tanganmu dari membinasakan mereka adalah karena Allah hendak memasukkan siapa yang dia kehendaki ke dalam rahmat-Nya dengan memeluk islam. Sekiranya mereka terpisah, tidak bercampur baur antara yang mukmin dan yang kafir tentu kami akan mengazab orang-orang yang kafir di antara mereka, penduduk mekah itu, dengan azab yang pedih, dengan membunuhnya atau menjadikan mereka sebagai tawanan dan merampas harta bendanya."
  }
]