[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir Quraisy adalah orang-orang yang mengingkari keesaan Allah, menghalang-halangi kalian dari Masjidil Haram di hari Hudaibiyah, menghalang-halangi hewan hadyu, menahannya sehingga tidak bisa sampai ke tempat penyembelihannya, yaitu daerah al-Haram. Kalau bukan karena orang-orang lemah yang beriman dan kaum wanita yang beriman yang berada di tengah-tengah kaum musyrikin di Makkah yang menyembunyikan imannya karena takut terhadap diri mereka dan kalian tidak mengetahui mereka, lalu kalian menyerang Makkah dengan pasukan kalian dan membunuh mereka, akibatnya kalian melakukan dosa dan kerugian tanpa ilmu, niscaya Kami menguasakan kalian atas orang-orang musyrik tersebut. Allah hendak memasukkan siapa yang Dia kehendaki kedalam rahmatNya, Dia membimbing mereka kedalam iman sesudah kekafiran. Seandainya orang-orang beriman; laki-laki dan perempuan itu bisa dibedakan dengan orang-orang musyrik Makkah dan meninggalkan mereka, niscaya Kami mengazab orang-orang yang kafir dan mendustakan di antara mereka dengan azab yang pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Mereka adalah orang-orang yang kafir terhadap Allah dan Rasul-Nya, menghalangi kalian dari Masjidil Haram dan menghalangi hewan sembelihan sehingga tertahan untuk sampai ke tanah haram, tempat penyembelihannya. Kalaulah tidak karena adanya orang-orang lelaki dan perempuan yang beriman kepada Allah yang tidak kalian ketahui yang akan terbunuh oleh kalian bersama orang-orang kafir, sehingga kalian mendapatkan dosa karena membunuhnya dan harus membayar diyat, tanpa kalian sadari, niscaya Allah mengizinkan kalian untuk masuk Makkah agar Allah memasukkan orang-orang yang dikehendaki-Nya ke dalam rahmat-Nya seperti orang-orang beriman yang berada di Makkah. Jika nampak perbedaan yang jelas antara orang-orang kafir dengan orang-orang yang beriman di Makkah niscaya Kami menyiksa orang-orang yang kafir kepada Allah dan Rasul-Nya dengan siksa yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Orang-orang kafir Makkah itulah yang mendustakan Allah dan menghalangi kalian melakukan thawaf di Masjidil Haram serta menghalangi hewan-hewan hadyu untuk sampai di tempat penyembelihannya di tanah haram. Kalaulah bukan karena mukminin dan mukminat yang tidak kalian ketahui, yang hidup bersama orang-orang kafir di Makkah dengan menyembunyikan keimanan mereka karena takut dari siksaan orang-orang kafir, agar mereka tidak kalian bunuh bersama orang-orang kafir sehingga kalian melakukan dosa tanpa kalian sadari, niscaya Kami akan memerintahkan kalian untuk memerangi mereka, agar Allah memasukkan hamba-Nya yang Dia kehendaki ke dalam rahmat-Nya, dengan menyelamatkan orang-orang beriman dan menjadikan banyak dari orang-orang kafir itu memeluk Islam. Seandainya orang-orang beriman tidak bersama orang-orang kafir dengan memisahkan diri dari mereka, niscaya Kami akan mengazab orang-orang kafir dengan azab yang keras, yaitu dengan terbunuh atau tertawan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. هُمُ الَّذِينَ كَفَرُوا۟ وَصَدُّوكُمْ عَنِ الْمَسْجِدِ الْحَرَامِ (Merekalah orang-orang yang kafir yang menghalangi kamu dari (masuk) Masjidil Haram) Orang-orang kafir Makkah menghalangi kaum muslimin untuk bertawaf dan bertahallul dari umrah mereka. وَالْهَدْىَ مَعْكُوفًا أَن يَبْلُغَ مَحِلَّهُۥ ۚ( dan menghalangi hewan korban sampai ke tempat (penyembelihan)nya) Dan mereka mencegah hewan hadyu untuk sampai pada tempat penyembelihannya, yaitu di tanah haram. Hewan hadyu ketika itu berjumlah 70 ekor unta. Maka Allah memberi mereka rukhshoh sehingga membolehkan mereka untuk menyembelihnya di tempat mereka berada, yaitu di Hudaibiyah, meskipun masih di luar tanah haram. Hal ini sebagaimana firman Allah: فإن أحصرتم فما استيسر من الهدي “Jika kamu terkepung (terhalang oleh musuh atau karena sakit), maka (sembelihlah) korban yang mudah didapat” (Al-Baqarah: 196) وَلَوْلَا رِجَالٌ مُّؤْمِنُونَ وَنِسَآءٌ مُّؤْمِنٰتٌ(Dan kalau tidaklah karena laki-laki yang mukmin dan perempuan-perempuan yang mukmin) Yakni orang-orang beriman yang tidak memiliki kekuatan yang masih berada di dalam kota Makkah. لَّمْ تَعْلَمُوهُمْ(yang tiada kamu ketahui) Yakni tidak kalian kenal. Atau tidak kalian ketahui bahwa mereka adalah orang-orang beriman. أَن تَطَـُٔوهُمْ(bahwa kamu akan membunuh mereka) Yakni membunuh atau menyerang mereka. Yakni jika orang-orang beriman yang bersama Rasulullah menyerang kota Makkah dengan pedang niscaya mereka tidak akan dapat membedakan antara orang-orang beriman dengan orang-orang kafir yang ada di sana, dan bisa jadi mereka akan membunuh orang beriman sehingga mereka harus membayar kaffarat, atau sebagian mereka akan ikut tertawan. Dan ini merupakan maksud dari firman Allah: فَتُصِيبَكُم مِّنْهُم(yang menyebabkan kamu) Karena mereka. مَّعَرَّةٌۢ( ditimpa kesusahan) Yakni kesusahan seperti harus membayar kafarat atau menanggung aib, karena orang-orang musyrik akan mengatakan: “kaum muslimin telah membunuh orang yang seagama dengan mereka.” بِغَيْرِ عِلْمٍ ۖ( tanpa pengetahuanmu) Yakni seandainya bukan karena hal itu maka Allah akan mengizinkan kalian untuk memerangi mereka, agar mereka tertimpa kekalahan. لِّيُدْخِلَ اللهُ فِى رَحْمَتِهِۦ مَن يَشَآءُ ۚ( Supaya Allah memasukkan siapa yang dikehendaki-Nya ke dalam rahmat-Nya) Yakni akan tetapi Allah mencegah tangan-tangan kalian dari memerangi mereka agar Allah memasukkan hamba-hamba-Nya yang Dia kehendaki ke dalam rahmat-Nya, yaitu hamba-hamba-Nya yang beriman yang masih berada di dalam kota Makkah, sehingga Allah menyempurnakan pahala mereka dan membebaskan mereka dari penawanan. لَوْ تَزَيَّلُوا۟ لَعَذَّبْنَا الَّذِينَ كَفَرُوا۟ مِنْهُمْ عَذَابًا أَلِيمًا (Sekiranya mereka tidak bercampur-baur, tentulah Kami akan mengazab orang-orang yag kafir di antara mereka dengan azab yang pedih) Yakni jika orang-orang beriman terbedakan dari orang-orang kafir niscaya Kami akan mengazab orang-orang kafir dengan kematian karena terbunuh oleh musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Mereka adalah orang-orang kafir Mekah yang ingkar kepada Allah dan rasulNya. Mereka mencegah orang-orang muslim untuk thawaf di Baitul Haram dan mencegah hewan kurban (unta atau semacamnya) untuk sampai ke tempatnya, yaitu tempat penyembelihannya, yang mana penyembelihan kurban itu halal, tidak haram. Hewan kurban itu sebanyak 70 ekor unta. Kemudian Allah membolehkan mereka untuk menyembeli hewan kurbannya di lembah Hudaibiyah di luar daerah masjidil haram. Jika tidak karena ada laki-laki dan perempuan mukmin tidak bersalah di Mekah yang tidak kalian ketahui sedang berbaur dengan orang-orang musyrik sehingga sebaiknya kamu tidak juga membinasakan mereka, sungguh kami sudah memerintahkan kalian untuk memerangi mereka. Karena keberadaan orang-orang tidak bersalah itu kalian mengalami penderitaan tanpa kalian ketahui sebabnya. Lalu orang-orang musyrik akan berkata: “Sesungguhnya orang-orang muslim telah membunuh saudara seagamanya sendiri”. Jika orang-orang mukmin itu memisahkan diri dari orang-orang kafir, sungguh kami akan mengazab orang-orang kafir Mekah dengan membinasakan mereka sebagai wujud azab yang menyakitkan. Abu Ja’far Habib bin Saba’ berkata: “Telah terbunuh di sisi nabi SAW di permulaan siang seorang kafir, kemudian setelah itu di akhir siap seorang muslim dan jumlah kami adalah 30 laki-laki dan 7 perempuan. Kemudian turunlah ayat {Wa law laa rijaalun mu’minuun} untuk kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Merekalah orang-orang yang ingkar dan menghalang-halangi kalian} menghalangi kalian {dari Masjidil haram dan hewan-hewan kurban} dan mencegah sapi-sapi yang diantar oleh Rasulullah SAW pada tahun Hudaibiyah untuk dikirimkan di Masjidil Haram {yang terkumpul} yang ditahan {sampai ke tempatnya} tempatnya yang diperbolehkan untuk menyembelihnya yaitu di Masjidil haram {Seandainya tidak ada beberapa orang laki-laki dan perempuan yang beriman yang tidak kalian ketahui} kalian kenali {kalian akan membunuh mereka} membunuh mereka beserta orang-orang kafir {sehingga kalian ditimpa kesulitan karena mereka} dosa dan diyat {tanpa kalian ketahui, karena Allah hendak memasukkan siapa saja yang Dia kehendaki ke dalam rahmatNya. Sekiranya mereka terpisah} terpisah {tentu Kami akan mengazab orang-orang kafir di antara mereka dengan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Selanjutnya Allah menyebutkan berbagai factor pendorong untuk memerangi kaum kafir, yaitu kekufuran mereka terhadap Allah dan RasulNya, mereka menghalangi Rasulullah dan kaum Mukminin yang turut serta untuk mengunjungi Baitullah seraya mengagungkannya dengan berhaji dan umroh, mereka juga adalah orang-orang yang “menghalangi hewan kurban sampai ke tempat (penyembelihan) nya,” yaitu tertahan untuk sampai ke tempat penyembelihannya yang berada di Makkah, di tempat itulah semua hewan kurban umroh di sembelih, tapi orang-orang musyrik menghalanginya secara zhalim dan menentang. Semua hal inilah yang mengharuskan dan mendorong untuk memerangi kaum musyrikin. Hanya saja terdapat satu penghalang untuk memerangi mereka, yaitu keberadaan orang-orang yang berada di tengah kaum musrikin. Orang-orang seperti ini tentu tidak bisa di bedakan pada saat di serang, andai saja bukan karena kalangan lelaki dan wanita yang beriman yang tidak diketehui orang-orang mukmin itu “bahwa kamu akan membunuh kereka,” yakni khawatir jika kalian membunuh mereka, “yang menyebabkan kamu di timpa kesusahan tanpa pengetahuanmu,” (tentulah). Yang dimaksud kesusahan dalam ayat ini adalah memerangi dan meyerang orang-orang yang beriman yang berbaur dengan orang-orang musrik Makkah. Terdapat faidah lain dalam hal itu. ”supaya Allah memasukan siapa saja yang dikehendakinya,” dimana Allah memberi karunia berupa keimanan terhadap mereka yang sebelumnya kufur, Allah memberikan pertunjukan petunjuk kepada mereka setelah sebelumnya berada dalam kesesatan, dan kerena faktor inilah kalian dilarang untuk menyerang mereka. “Sekiranya mereka tidak bercampur baur,” andai mereka tidak berada di tengah-tengah kaum musrikin, ”tentulah kami akan mengazab orang-orang kafir diantaramereka dengan azab yang pedih,” dengan cara kami memberi izin kepada kalian orang-orang yang beriman untuk memerangi orang-orang kafir itu dan memberikan kemenangan untuk kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 25: Allah menjelaskan bahwasanya orang-orang kafir Mekah mereka adalah orang-orang yang menolak ke-Maha Tunggalan Allah, dan mendustakan Rasul-Nya, dan memalingkan kalian untuk tidak umroh dan thawaf di Ka'bah, serta menahan kalian dari menyembelih hewan kalian. Setiap perbuatan mereka orang-orang kafir adalah kezaliman dan permusuhan, dan kalau tidak karena laki-laki yang mukmin dan perempuan-perempuan yang mukmin yang tiada kamu ketahui, bahwa kamu akan membunuh mereka yang menyebabkan kamu ditimpa kesusahan tanpa pengetahuanmu (tentulah Allah tidak akan menahan tanganmu dari membinasakan mereka). Akan tetapi Allah tidak mengizinkan kalian untuk memerangi mereka disebabkan kasih sayang Allah terhadap orang-orang yang beriman dan orang-orang yang lemah di Mekah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan beberapa perkara yang mendorong untuk memerangi kaum musyrik, yaitu kafirnya mereka kepada Allah dan Rasul-Nya, penghalangan mereka terhadap Rasulullah shallallahu 'alaihi wa sallam dan kaum mukmin untuk mendatangi Baitullah serta penghambatan hewan-hewan kurban untuk sampai ke tempat sembelihannya, yaitu Mekah. Mereka menghalanginya dengan zalim dan aniaya. Semua ini sebab yang mengharuskan memerangi mereka, namun di sana ada penghalang, yaitu keberadaan orang-orang yang beriman baik laki-laki maupun perempuan di tengah orang-orang musyrik. Yang berada di Mekah bersama orang-orang kafir. Bersama orang-orang kafir, tentu Dia mengizinkan kamu menaklukkan Mekah. Ada yang menafsirkan dengan “dosa.” Yakni agar mereka tidak mendapat dosa, dan agar Allah memasukkan ke dalam rahmat-Nya siapa yang Dia kehendaki, yaitu dengan melimpahkan nikmat iman kepada mereka setelah kekafiran, dan melimpahkan nikmat petunjuk setelah kesesatan. Oleh karena sebab inilah, Dia melarang kamu memerangi mereka. Dari orang-orang musyrik. Yaitu dengan mengizinkan kamu menaklukkan Mekah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 25",
    "description": "Merekalah orang-orang kafir yang menghalang-halangi kamu memasuki masjidilharam untuk melaksanakan umrah dan menghambat hewan-hewan kurban sebanyak 70 onta yang akan kamu sembelih dan dagingnya kamu bagikan kepada fakir miskin untuk sampai ke tempat penyembelihannya yang paling utama di marwah. Dan kalau bukanlah karena ada beberapa orang beriman laki-laki dan perempuan yang kesemuanya menetap di kota mekah yang tidak kamu ketahui sosoknya secara pasti dan me-reka bertempat tinggal berbaur dengan orang-orang mekah yang sebagian masih kafir, tentulah kamu akan membunuh mereka yang menyebabkan kamu ditimpa kesulitan seperti penyesalan dan kewajiban membayar diyat akibat membunuh mereka tanpa kamu sadari bahwa mereka adalah saudaramu seiman. Bahwa Allah mencegah tanganmu dari membinasakan mereka adalah karena Allah hendak memasukkan siapa yang dia kehendaki ke dalam rahmat-Nya dengan memeluk islam. Sekiranya mereka terpisah, tidak bercampur baur antara yang mukmin dan yang kafir tentu kami akan mengazab orang-orang yang kafir di antara mereka, penduduk mekah itu, dengan azab yang pedih, dengan membunuhnya atau menjadikan mereka sebagai tawanan dan merampas harta bendanya. 26. Ayat yang lalu menyatakan bahwa Allah akan mengazab orang-orang kafir dengan siksaan yang pedih. Ayat ini menjelaskan kapan waktunya, yaitu ketika orang-orang yang kafir menanamkan kesombongan dalam hati mereka yaitu kesombongan jahiliah yang ditandai dengan menolak keesaan Allah, tidak percaya kepada diutusnya para nabi dan perbuatan menghalangi orang beriman mengunjungi baitullah maka Allah menurunkan ketenangan, kesabaran, dan ketenteraman, kepada rasul-Nya, dan kepada orang-orang mukmin sehingga terlaksana perjanjian hudaibiyah dengan sempurna; dan Allah mewajibkan kepada mereka tetap taat menjalankan kalimat takwa, yaitu kalimat tauhid sehingga mereka terpelihara dari kemusyrikan, dan mereka lebih berhak dengan kalimat takwa itu dan patut memilikinya sebagaimana ditunjukkan oleh ucapan dan perbuatannya. Dan Allah maha mengetahui segala sesuatu."
  }
]