[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "ketika orang-orang kafir itu mempertahankan fanatisme jahiliyah di dalam hati mereka, karena mereka tidak ingin mengakui risalah Muhammad, di antara buktinya adalah penolakan mereka untuk menulis dalam perjanjian Hudaibiyah ‘Bismillahirrahmanirrahim’. Mereka juga menolak ucapan, “Ini adalah perjanjian Muhammad Rasulullah.” Allah menurunkan ketenangan kepada Rasulullah dan orang-orang yang beriman bersamanya, membuat mereka memegang teguh kalimat La ilaha illallah yang merupakan pangkal segala ketakwaan. Rasulullah dan orang-orang yang beriman bersamanya lebih berhak atas kalimat takwa daripada orang-orang musyrik. Dan orang-orang beriman memang pemilik sah kalimat ini, bukan orang-orang musyrik. Dan Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Tatkala orang-orang yang kafir terhadap Allah dan Rasul-Nya menjadikan di dalam hati mereka pertahanan diri yaitu pertahanan jahiliah yang tidak berhubungan dengan menegakkan kebenaran akan tetapi berhubungan dengan hawa nafsu, sehingga mereka menghalangi Rasulullah masuk ke tempat mereka pada tahun perjanjian Hudaibiyah, mereka khawatir akan mendapat kehinaan karena terkalahkan. Lalu Allah menurunkan ketenangan dari sisi-Nya untuk Rasul-Nya dan menurunkan ketenangan untuk orang-orang yang beriman, sehingga kemarahan mereka tidak menjadikan mereka membalas kaum musyrikin dengan balasan yang semisal dengan perbuatan mereka, dan Allah mengharuskan orang-orang yang beriman mengucapkan kalimat kebenaran, yaitu ucapan \"tiada tuhan yang berhak disembah selain Allah,\" dan untuk melaksanakan hak-hak kalimat ini, maka mereka pun melaksanakannya. Dan orang-orang yang beriman lebih berhak atas kalimat ini dari selain mereka, dan mereka adalah pemiliknya yang sebenarnya karena kebaikan yang Allah ketahui di dalam hati mereka. Dan Allah Maha Mengetahui atas segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Ketika orang-orang kafir menjadikan keangkuhan dan kesombongan dalam hati mereka, yang merupakan sifat jahiliyah, maka Allah menjadikan kesabaran dan ketentraman bagi Rasulullah dan para sahabatnya, dan mewajibkan mereka untuk mengucapkan dan menegakkan kalimat ‘Laa ilaaha illaa Allah’; orang-orang beriman lebih berhak atas kalimat ini daripada orang-orang kafir. Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu di tujuh langit dan bumi yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. إِذْ جَعَلَ الَّذِينَ كَفَرُوا۟ فِى قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجٰهِلِيَّةِ (Ketika orang-orang kafir menanamkan dalam hati mereka kesombongan (yaitu) kesombongan jahiliyah) Para penduduk Makkah berkata: “Mereka telah membunuh anak-anak dan saudara-saudara kita serta memasuki rumah-rumah kita, sehingga orang-orang Arab memperbincangkan kita bahwa mereka telah memasuki pemukiman kita tanpa keridhaan kita? Demi Laata dan Uzza, mereka tidak boleh memasuki pemukiman kita.” Inilah kesombongan jahiliyah yang dimasukkan ke dalam hati mereka. فَأَنزَلَ اللهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى الْمُؤْمِنِينَ(lalu Allah menurunkan ketenangan kepada Rasul-Nya, dan kepada orang-orang mukmin) Allah menurunkan ketenangan dan ketentraman ke dalam hati Rasulullah dan orang-orang beriman sehingga kesombongan jahiliyah tidak masuk ke dalam hati mereka sebagaimana yang terjadi pada orang-orang kafir. Dan Allah meneguhkan mereka di atas keridhaan dan penyerahan diri. وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَىٰ( dan Allah mewajibkan kepada mereka kalimat-takwa) Kalimat takwa yaitu kalimat ‘Laailaaha illaallah, Muhammadurrasulullah’, Dan yang dimaksud adalah Allah mewajibkan mereka untuk mengagungkan tanah haram dan tidak berperang di dalamnya, serta tidak terpancing perbuatan orang-orang kafir sehingga mereka menistakan kehormatan tanah haram. وَكَانُوٓا۟ أَحَقَّ بِهَا وَأَهْلَهَا ۚ( dan adalah mereka berhak dengan kalimat takwa itu dan patut memilikinya) Yakni orang-orang beriman lebih berhak terhadap kalimat tersebut daripada orang-orang kafir. Dan mereka merupakan pemilik kalimat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Azab itu dimulai saat orang-orang kafir yang musyrik itu menanamkan dalam diri mereka kebanggaan (kebanggaan bodoh) yang menumbuhkan kesombongan dan dusta dan ketika mereka mencegah orang-orang muslim memasuki masjidil haram saat perjanjian Hudaibiyah. Kemudian Allah memberikan ketenangan, keridhaan dan keteguhan hati bagi rasulNya dan orang-orang mukmin, yang mana mereka tidak tertipu dan tidak tersulut amarahnya. Kami perintahkan mereka dengan kalimat takwa dan kami selaraskan hati mereka dengan kalimat itu, yaitu (Laa ilaaha illallah, muhammadurrasulullah) karena kalimat itu adalah sebab dan dasar-dasar ketakwaan. Kalimat yang memerintahkan pada kesetiaan dan janji. Mereka menjadi orang yang paling layak dan paling mulia dengan kalimat itu. Mereka menjadi orang yang selalu mengucap kalimat itu dan mendapatkan segala sesuatu yang ditimbulkan olehnya berupa janji kesetiaan. Mereka Allah adalah Dzat yang Maha mengetahui segala sesuatu, tidak ada yang luput dariNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika orang-orang kafir menanamkan dalam hati mereka kesombongan} keangkuhan {kesombongan} keangkuhan {jahiliah, lalu Allah menurunkan ketenangan} ketenangan dan keteguhan {kepada RasulNya dan orang-orang mukmin dan menetapkan atas mereka kalimat taqwa} kalimat taqwa yaitu Laa ilaaha Illallah {Mereka lebih berhak atas kalimat itu dan patut memilikinya. Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah berfirman, “Ketika orang-orang kafir menanamkan di dalam hati mereka kesombongan (yaitu) kesombongan jahiliyah,” karena mereka menghapus tulisan “Bismillahirrahmmanirrahim” seta melarang Rasululloh serta orang-orang yang beriman untuk mendatangi Makkah pada tahun itu agar orang –orang tidak mengatakan bahwa kaum muslimin berhasil masuk Makkah karena telah mengalahkan kaum Quraisy. Hal-hal semacam ini adalah termasuk ke jahiliyahan yang tetap tertanam dalam benak mereka sehingga mendorong mereka melakukan berbagai kemaksiatan. ”Kemudian Allah menurunkan ketenangan kepada RasulNya dan kepada orang-orang Mukmin,” sehingga mereka tidak terpancing untuk melawan orang-orang musyrikin sebagaimana kaum musyrikin memperlakukan mereka dahulunya, tapi kaum Muslimilin bersabar atas ketentuan Allah serta konsisten terhadap perjanjian yang berisi mengagungkan keharaman Allah meski apa pun yang terjadi, mereka tidak peduli terhadap perkataan dan celaan orang. “Dan Allah mewajibkan kepda mereka dua kalimat syhadat.” Yaitu kaliamat la ilaha illallah diharuskan menunaikanya. Dan mereka pun menunaikannya serta konsisten dalam menunaikannya. “Dan mereka lebih berhak dengan kalimat takwa itu,” daripada orang lain, “ dan patut memilikinya,” yakni mereka adalah orang-orang yang berhak memilikinya karena Allah mengetahui kebaikan yang ada dalam hati mereka, dank arena itulah Allah berfirman, “dan Allah Mahamengetahui segala sesuatu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 26: Ingatlah wahai manusia pada hari dijadikannya hati mereka orang-orang kafir sombong tidak mau menerima kebenaran; Mereka menolak untuk menulis perjanjian di secarik kertas: Bismillahirohmanirohim; mereka menolak untuk menetapkan kerisalahan Muhammad, dan menolak orang-orang yang masuk dalam barisan kaum muslimin yang mereka datang dari kelompoknya. Maka Allah menurunkan ketenangan keridhaan di dalam hati orang-orang yang beriman. Mereka orang-orang beriman menetapi syarat-syarat yang terdapat di dalam perjanjian hudaibiyah sebagai pengagungan kepada Allah untuk menetapi di atas perjanjian. Dan mereka tetap menetapi kalimat Taqwa yaitu Lailahaillallah dan hak-haknya. Sungguh Allah Maha Tahu atas segala sesuatu, tidaklah tersembunyi dari-Nya meskipun sebesar biji atom di langit maupun di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menghalangi Nabi shallallahu 'alaihi wa sallam dan para sahabat dari Masjidilharam pada tahun itu. Demikian pula mereka tolak tulisan “Bismillahirrahmaanirrahim” dan kata-kata “Rasulullah” dalam surat perjanjian itu. Mereka tidak marah dalam menghadapi sikap kaum musyrik, bahkan bersabar kepada ketetapan Allah dan melaksanakan syarat-syarat yang tertulis dalam perjanjian itu serta tidak peduli apa yang akan dikatakan oleh orang-orang. Kalimat takwa ialah kalimat tauhid dan memurnikan ketaatan kepada Allah. Karena Allah Subhaanahu wa Ta'aala mengetahui kebaikan yang ada dalam hati mereka. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Dan Allah Maha Mengetahui segala sesuatu.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 26",
    "description": "Ayat yang lalu menyatakan bahwa Allah akan mengazab orang-orang kafir dengan siksaan yang pedih. Ayat ini menjelaskan kapan waktunya, yaitu ketika orang-orang yang kafir menanamkan kesombongan dalam hati mereka yaitu kesombongan jahiliah yang ditandai dengan menolak keesaan Allah, tidak percaya kepada diutusnya para nabi dan perbuatan menghalangi orang beriman mengunjungi baitullah maka Allah menurunkan ketenangan, kesabaran, dan ketenteraman, kepada rasul-Nya, dan kepada orang-orang mukmin sehingga terlaksana perjanjian hudaibiyah dengan sempurna; dan Allah mewajibkan kepada mereka tetap taat menjalankan kalimat takwa, yaitu kalimat tauhid sehingga mereka terpelihara dari kemusyrikan, dan mereka lebih berhak dengan kalimat takwa itu dan patut memilikinya sebagaimana ditunjukkan oleh ucapan dan perbuatannya. Dan Allah maha mengetahui segala sesuatu. 27. Sungguh, Allah akan membuktikan kepada rasul-Nya yaitu nabi Muhammad tentang kebenaran mimpinya yang diwahyukan Allah bahwa kamu, wahai sahabat-sahabat nabi yang turut serta ke hudaibiyah, pasti akan memasuki masjidilharam pada tahun yang akan datang, jika Allah menghendaki dalam keadaan aman, yakni pada saat memasukinya kamu tidak dihalangi orang siapa pun. Sebagian dari kamu memasuki masjidilharam dengan menggundul rambut kepala dan sebagian dari kamu dengan memendekkannya, sedang kamu tidak merasa takut kepada siapa pun. Maka Allah mengetahui apa yang tidak kamu ketahui dan selain itu dia telah memberikan kemenangan yang dekat, yakni kemenangan di hudaibiyah ini atau kemenangan di khaibar segera sesudah terjadinya perjanjian hudaibiyah."
  }
]