[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah membenarkan mimpi NabiNya yang Dia perlihatkan padanya dengan kebenaran bahwa engkau dan para sahabatmu pasti akan masuk ke Baitullah al-haram dengan aman; di mana kalian tidak takut terhadap orang-orang musyrik, kalian mencukur dan memendekkan rambut kalian. Allah mengetahui kebaikan dan kemaslahatan (di balik kegagalan kalian masuk Makkah pada tahun tersebut dan masuknya kalian pada tahun berikutnya) apa-apa yang tidak kalian ketahui. Allah menjadikan kegagalan kalian masuk makkah yang telah Dia janjikan kepada kalian pada tahun tersebut sebagai kemenangan yang dekat, yaitu perjanjian Hudaibiyah dan kemenangan pada Perang Khaibar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sungguh Allah akan membuktikan kepada Rasul-Nya kebenaran mimpinya dengan sebenarnya saat Allah menampakkannya di dalam tidurnya dan telah diberitahukan olehnya kepada para shahabatnya, bahwa dia dan para shahabatnya akan masuk Baitullah al-Haram dalam kondisi aman dari gangguan musuh kalian. Di antara kalian ada yang menggunduli kepalanya, dan ada yang mencukur pendek rambutnya sebagai bukti selesainya manasik mereka. Allah mengetahui maslahat kalian -wahai orang-orang yang beriman- apa yang tidak kalian ketahui. Dan di samping terbuktinya mimpi untuk masuk Makkah pada tahun itu, Allah menjadikan kemenangan dalam waktu dekat, yaitu perjanjian Hudaibiyah yang dirancang oleh Allah lalu diikuti dengan kemenangan perang Khaibar untuk orang-orang beriman yang menghadiri perjanjian Hudaibiyah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Sungguh Allah menjadikan mimpi Rasulullah menjadi kenyataan, yaitu mimpi Rasulullah dan para sahabatnya memasuki Masjidil Haram dalam keadaan aman dari musuh dan dengan kepala tercukur atau rambut yang terpotong setelah melaksanakan thawaf dan sa’i dalam umrah. Allah mengetahui kemaslahatan yang ada dalam penundaan umrah yang tidak kalian ketahui, yaitu menjadikan masuknya kalian ke dalam kota Makkah yang dijanjikan bagi kalian itu adalah penakhlukan yang sebentar lagi terjadi, yakni setelah perjanjian Hudaibiyah dan penakhlukan Khaibar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. لَّقَدْ صَدَقَ اللهُ رَسُولَهُ الرُّءْيَا بِالْحَقِّ (Sesungguhnya Allah akan membuktikan kepada Rasul-Nya, tentang kebenaran mimpinya dengan sebenarnya) Para ahli tafsir mengatakan bahwa Allah memperlihatkan kepada Rasulullah ketika masih di Madinah sebelum pergi ke Hudaibiyah seakan-akan dia dan para sahabatnya telah mencukur dan memotong rambut mereka. Maka Rasulullah mengabarkan ini kepada para sahabatnya, sehingga mereka merasa senang dan menganggap bahwa mereka akan memasuki Makkah pada tahun itu. setelah mereka kembali dari Hudaibiyah dan tidak berhasil memasuki Makkah, maka orang-orang munafik berkata: “Demi Allah, kita tidak dapat mencukur atau memotong rambut dan tidak pula dapat memasuki masjidil haram.” Maka Allah menurunkan ayat ini. لَتَدْخُلُنَّ الْمَسْجِدَ الْحَرَامَ(bahwa sesungguhnya kamu pasti akan memasuki Masjidil Haram) Yakni setelah tahun ini. إِن شَآءَ اللهُ(insya Allah) Ini merupakan penggantungan waktu terjadinya hal itu dengan kehendak Allah, untuk mengajarkan hamba-hamba Allah apa yang wajib mereka katakan. Tsa’lab berkata: Allah memfirmankan dengan pengecualian ‘insyaallah’ dalam hal yang telah Dia ketahui agar hamba-hamba-Nya mengecualikannya dalam hal yang tidak mereka ketahui. ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمْ وَمُقَصِّرِينَ(dalam keadaan aman, dengan mencukur rambut kepala dan mengguntingnya) Yakni aman dari serangan musuh, dan sebagian kalian mencukur rambutnya dan sebagian lain hanya memotongnya saja. لَا تَخَافُونَ ۖ( sedang kamu tidak merasa takut) Yakni kalian tidak merasa takut dari orang-orang musyrik dalam perjanjian kalian dengan mereka. فَجَعَلَ مِن دُونِ ذٰلِكَ(dan Dia memberikan sebelum itu) Yakni sebelum kalian melakukan ibadah umrah. فَتْحًا قَرِيبًا (kemenangan yang dekat) Yakni dengan penakhlukan Khaibar, dan kalian dapat mengambil harta ghanimah dari sana. Dan Allah menangguhkan penakhlukan kota Makkah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Allah mewujudkan mimpi rasulallah dan tidak mendustakannya. Kamu sungguh akan masuk ke dalam Masjidil Haram pada tahun depan bersama sahabat-sahabatmu wahai nabi dengan kehendak Allah. Sebagian kalian akan mencukur habis semua rambutnya, dan sebagian lainnya mencukur pendek rambutnya. Kalian tidak akan merasa takut selama-lamanya. Lalu Allah mengajarkan kalian apa yang belum kalian tahu berupa hikmah di akhir peristiwa itu. Sebagai ganti tidak bisa masuk Masjidil Haram dan penaklukkan Mekah, Allah memberikan kalian penaklukkan lain yang dekat yaitu penaklukan Khaibar dan menjadikan perdamaian Hudaibiyah sebagai penaklukkan terbesar untuk penyebaran Islam. Mujahid berkata: “Saat di lembah Hudaibiyah Nabi SAW dipertunjukkan (oleh Allah) bahwa beliau dan sahabat-sahabatnya yang terpercaya memasuki kota Mekah. Mereka mecukur rambut mereka dan memendekkannya. Lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah benar-benar akan membuktikan kepada RasulNya tentang kebenaran mimpinya dengan sebenar-benarnya, kamu pasti akan memasuki Masjidil haram, jika Allah menghendaki dalam keadaan aman, dengan mencukur rambut kepala kalian dan memendekkannya, dan kalian tidak merasa takut. Allah mengetahui apa yang tidak kalian ketahui dan menjadikan sebelum itu} sebelum kalian memasuki Masjidil haram {kemenangan yang dekat} perdamaian Hudaibiyah dan kemenangan Khaibar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Allah berfirman, “sesungguhnya Allah akan membuktikan kepada RasulNya tentang kebenaran mimpinya dengan sebenarnya.” Hal ini adalah karena sebelumnya Rasulullah bermimpi ketika berada di Madinah kemudian diberitahukan kepada para sahabatnya, bahwa mereka akan masuk Makkah dan berthawaf ke Baitullah. Namun ketika terjadi peristiwa dalam perjanjian Hudaibiyah tersebut dan mereka kembali lagi ke Madinah tanpa bisa memasuki Makkah hingga mereka pun menanyakan hal itu kepada Rasulullah, “Bukankah engkau pernah memberitahu kami bahwa kita akan mendatangi dan berthawaf di Baitullah?” Rasulullah menjawab, “Apakah aku memberitahukan kepada kalian bahwa itu terjadi pada tahun ini?” para sahabat menjawab, “Tidak.” Rasulullah menjawab, “Sesungguhnya kalian pasti akan mendatangi dan berthawaf di Baitullah.” Dalam ayat ini Allah berfirman, “Sesungguhnya Allah akan membuktikan kepada RasulNya tentang kebenaran mimpinya dengan sebenarnya,” yakni, pasti akan terjadi dan benar meski terlambatnya penjelasan hal itu tidak memburamkan hal itu, “(yaitu) bahwa sesungguhnya kamu pasti akan memasuki Masjidil Haram, insya allah dalam keadaan aman, dengan menguris rambut kepala dan mencukurnya,” yakni, pada saat itu yang mengharuskan kalian untuk mengagungkan baitul haram, menunaikan dan menyempurnakan manasik dengan mencukur dan menggunting rambut tanpa disertai rasa takut. “Maka Allah mengetahui” berbagai kepentingan dan manfaat, “apa yang tiada kamu ketahui dan Dia memberikan sebelum itu,” yakni, masuk dengan keadaan seperti itu sebagai “kemenangan yang dekat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 27: Allah mengabarkan akan memberikan Wahyu kepada rasulnya di dalam mimpi beliau; di mana nabi melihat dalam mimpinya masuk ke dalam Mekkah dan berthawaf di Ka'bah, maka beliau mengabarkan akan hal ini kepada para sahabatnya; beliau mengabarkan kepada sahabatnya untuk meyakinkan bahwasanya mimpinya adalah kebenaran yang akan terwujud di tahun ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu maslahat dan manfaat. Selang beberapa lama sebelum terjadi perdamaian Hudaibiyah, Nabi Muhammad shallallahu 'alaihi wa sallam bermimpi bahwa beliau bersama para sahabatnya memasuki kota Mekah dan Masjidil Haram dalam Keadaan sebagian mereka bercukur rambut dan sebagian lagi menggunting. Nabi shallallahu 'alaihi wa sallam mengatakan bahwa mimpi beliau itu akan terjadi nanti. kemudian berita ini tersiar di kalangan kaum muslim, orang-orang munafik, orang-orang Yahudi dan Nasrani. Setelah terjadi perdamaian Hudaibiyah dan kaum muslimin waktu itu tidak sampai memasuki Mekah, maka orang-orang munafik mengolok-olokkan Nabi shallallahu 'alaihi wa sallam dan menyatakan bahwa mimpi Nabi yang dikatakan beliau pasti akan terjadi itu adalah bohong belaka. Maka turunlah ayat ini yang menyatakan bahwa mimpi Nabi itu pasti akan menjadi kenyataan di tahun yang akan datang. Dan sebelum itu dalam waktu yang dekat Nabi shallallahu 'alaihi wa sallam akan menaklukkan kota Khaibar. Seandainya pada tahun terjadinya perdamaian Hudaibiyah itu kaum Muslim memasuki kota Mekah, maka dikhawatirkan keselamatan orang-orang yang menyembunyikan imannya yang berada dalam kota Mekah waktu itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 27",
    "description": "Sungguh, Allah akan membuktikan kepada rasul-Nya yaitu nabi Muhammad tentang kebenaran mimpinya yang diwahyukan Allah bahwa kamu, wahai sahabat-sahabat nabi yang turut serta ke hudaibiyah, pasti akan memasuki masjidilharam pada tahun yang akan datang, jika Allah menghendaki dalam keadaan aman, yakni pada saat memasukinya kamu tidak dihalangi orang siapa pun. Sebagian dari kamu memasuki masjidilharam dengan menggundul rambut kepala dan sebagian dari kamu dengan memendekkannya, sedang kamu tidak merasa takut kepada siapa pun. Maka Allah mengetahui apa yang tidak kamu ketahui dan selain itu dia telah memberikan kemenangan yang dekat, yakni kemenangan di hudaibiyah ini atau kemenangan di khaibar segera sesudah terjadinya perjanjian hudaibiyah. 28. Dialah yang mengutus rasul-Nya, nabi Muhammad, dengan membawa petunjuk, ilmu yang bermanfaat dan amal saleh, dan agama yang benar, yaitu agama islam agar dimenangkan-Nya terhadap semua agama. Dan cukuplah Allah sebagai saksi bahwa nabi Muhammad adalah utusan-Nya."
  }
]