[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah Yang mengutus RasulNya, Muhammad, dengan penjelasan yang terang dan agama Islam, untuk Allah menangkan atas seluruh agama. Cukuplah Allah bagimu wahai Nabi, sebagai saksi bahwa Dia pasti menolongmu dan memenangkan agamamu atas semua agama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Allah lah yang mengutus Rasul-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- dengan keterangan yang jelas dan agama kebenaran yaitu Islam supaya Allah meninggikannya di atas semua agama-agama lain yang menyelisihinya. Allah telah bersaksi atas hal itu, dan cukuplah Allah sebagai saksi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Dengan kemurahan dan karunia-Nya, Allah mengutus Nabi Muhammad dengan membawa petunjuk menuju kebaikan dan agama Islam, untuk memenangkannya atas agama-agama yang lain. Cukuplah Allah sebagai saksi bagi kebenaran risalahmu dan Penolongmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. هُوَ الَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِالْهُدَىٰ (Dialah yang mengutus Rasul-Nya dengan membawa petunjuk) Maka Rasulullah mendatangkan kalian dengan petunjuk itu dan menununjukkan kepada kalian bahwa di dalamnya mengandung keridhaan Tuhan kalian. وَدِينِ الْحَقِّ(dan agama yang hak) Yakni agama Islam. لِيُظْهِرَهُۥ عَلَى الدِّينِ كُلِّهِۦ ۚ( agar dimenangkan-Nya terhadap semua agama) Yakni meninggikan agama Islam di atas seluruh agama yang lain. Pendapat lain mengatakan, yakni agar Allah memenangkan Rasul-Nya. Dan dengan segala puji bagi Allah, agama Islam telah menang di atas segala agama lainnya. وَكَفَىٰ بِاللهِ شَهِيدًا(Dan cukuplah Allah sebagai saksi) Atas kemenangan yang dijanjikan bagi orang-orang Islam ini, serta atas kebenaran kenabian Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Allah adalah Dzat yang mengutus utusanNya Muhammad SAW dengan Al-Qur’an dan agama Islam yang benar untuk meninggikannya di atas semua agama. Cukup Allah yang menjadi saksi atas terwujudnya janjiNya dan kebenaran wahyu utusanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang mengutus RasulNya dengan membawa petunjuk} keterangan yang jelas {dan agama yang benar agar Dia mengunggulkannya atas semua agama.} untuk meninggikannya di atas semua agama {Cukuplah Allah sebagai saksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Mengingat peristiwa ini memperkeruh hati sebagian orang Mukmin di mana mereka tidak dapat mengetahui hikmahnya, Allah pun menjelaskan hikmah dan manfaatnya dan seperti itulah halnya seluruh hukum-hukum syariat, semua hukum adalah petunjuk dan rahmat yang diberitahukan secara umum. Allah berfirman, “Dialah yang mengutus RasulNya dengan membawa petunjuk,” yaitu dengan ilmu yang bermanfaat yang bisa menyelamatkan manusia dari kesesatan serta menjelaskan berbagai jalan yang baik dan buruk, “ dan agama yang haq,” yaitu agama yang disifati dengan kebenaran yang berupa keadilan, kebaikan dan rahmat, semuanya adalah amal shalih yang bisa membersihkan hati , menyucikan jiwa, menumbuhkan akhlak baik dan meninggikan derajat diri, “agar dimenangkanNya,” dengan membawa agama yang diembankan oleh Allah “terhadap semua agama,” dengan hujjah dan bukti nyata yang menjadi penyebab untuk menundukkan mereka, baik dengan pedang, dan lisan. “ Dan cukuplah Allah sebagai saksi.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 28: Ketahuilah wahai manusia bahwa Allah dialah yang mengutus nabi nya Muhammad dengan petunjuk yaitu ilmu yang bermanfaat yang menunjuki dari jalan kesesatan, dan melindungi sesuatu yang berbahaya dan beliau juga membawa agama yang benar yaitu agama Islam untuk meninggikan kalimatullah di atas semua agama. Cukuplah Allah yang jadi saksi atas kebenaran yang dibawa oleh utusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena peristiwa itu membuat hati kaum mukmin menjadi bingung dan mereka tidak mengetahui hikmahnya, maka Allah Subhaanahu wa Ta'aala menerangkan hikmahnya dan manfaatnya -demikian pula semua hukum-hukum syar’i isinya petunjuk dan rahmat- Maka Allah Subhaanahu wa Ta'aala memberitahukan dengan hukum yang umum, firman-Nya, “Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar agar dimenangkan-Nya terhadap semua agama.” Yaitu ilmu yang bermanfaat; yang menunjuki seseorang agar tidak tersesat dan menerangkan jalan yang baik dan jalan yang buruk. Yakni agama yang keadaannya hak (benar), penuh dengan keadilan, ihsan dan rahmat. Agama yang hak di sini maksudnya menurut mufassir adalah amal saleh yang menyucikan hati, membersihkan jiwa, memperbaiki akhlak dan meninggikan kedudukan. Dengan hujjah dan bukti serta dengan kekuatan. Bahwa engkau wahai Muhammad adalah Rasul-Nya shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 28",
    "description": "Dialah yang mengutus rasul-Nya, nabi Muhammad, dengan membawa petunjuk, ilmu yang bermanfaat dan amal saleh, dan agama yang benar, yaitu agama islam agar dimenangkan-Nya terhadap semua agama. Dan cukuplah Allah sebagai saksi bahwa nabi Muhammad adalah utusan-Nya. 29. Nabi Muhammad adalah utusan Allah yang membawa rahmat bagi seluruh alam, dan orang-orang yang bersama dengan dia yakni sahabat-sahabat-Nya bersikap keras dan tegas terhadap orang-orang kafir yang menentang agama-Nya, tetapi berkasih sayang dan saling mencintai sesama mereka yang beriman. Kamu senantiasa melihat mereka rukuk dan sujud dan itu dilakukan semata-mata untuk mencari karunia Allah dan keridaan-Nya. Engkau saksikan pada wajah mereka tampak tanda-tanda bekas sujud berupa cahaya yang menunjukkan ketakwaan dan kesalehannya. Demikianlah sifat-sifat mereka yang sangat agung yang diungkapkan dalam taurat yang diturunkan kepada nabi musa. Dan sifat-sifat me-reka yang diungkapkan dalam injil, yaitu seperti benih yang mengeluarkan tunasnya, kemudian tunas itu semakin kuat lalu menjadi besar dan tegak lurus di atas batangnya. Demikian perumpamaan orang-orang mukmin pengikut nabi Muhammad. Sesungguhnya mereka itu mula-Mula sedikit saja, kemudian ia bertambah semakin banyak, bagaikan tunas yang menumbuhkan tanaman yang subur dan banyak buahnya. Tanaman itu menyenangkan hati penanam-penanamnya. Sifat-sifat yang luhur dan mulia dinyatakan karena Allah hendak menjengkelkan hati orang-orang kafir dengan menunjukkan semakin banyaknya jumlah orang-orang mukmin dan semakin besarnya kekuatan mereka dari masa ke masa. Demikianlah akhir surah al-fat' ini ditutup dengan janji Allah bahwa Allah menjanjikan kepada orang-orang yang beriman dan mengerjakan kebajikan di antara mereka, ampunan atas dosa dan kesalahan mereka dan pahala yang besar yaitu surga. Semoga kami termasuk orang-orang yang memperoleh anugerah yang agung itu."
  }
]