[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Kami memberimu kemenangan itu dan memudahkannya bagimu, karena Allah hendak mengampuni dosa-dosamu yang telah berlalu dan yang akan datang, sebab kemenangan ini mengandung ketaatan-ketaatan yang banyak dan terwujud melalui perjuangan yang melelahkan. Allah menyempurnakan nikmatNya atasmu dengan meninggikan agamamu dan memenangkanmu atas musuh-musuhmu, membimbingmu ke jalan yang lurus, agama yang tidak bengkok. Allah memenangkanmu dengan kemenangan yang kuat yang padanya Islam tidak melemah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan agar Allah menolongmu menghadapi musuh-musuhmu dengan pertolongan yang kuat, tidak ada seorangpun yang bisa menolaknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَيَنصُرَكَ اللهُ نَصْرًا عَزِيزًا (dan supaya Allah menolongmu dengan pertolongan yang kuat) Yakni pertolongan yang tidak akan terkalahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Agar Allah menolongmu dengan pertolongan diiringi dengan kemuliaan, kekuatan dan kemenangan yang besar. Maksudnya bahwa kemenangan ini sulit didapat oleh orang-orang selain engkau (Nabi SAW)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan agar Allah menolongmu dengan pertolongan yang besar} yang unggul lagi memberi perlindungan, tidak ada kerendahan setelahnya selama-lamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan supaya Allah menolongmu dengan pertolongan yang kuat,” yaitu pertolongan yang kuat yang dengannya Islam tidak tergoyahkan, justru akan diperoleh kemenagan sempurna serta menundukkan, merendahkan serta mengurangi jumlah orang-orang kafir, di samping terpenuhi dan berkembangnya kekuatan kaum Muslimin serta banyaknya harta mereka. Selanjutnya Allah menyebutkan dampak baik perjanjian ini atas orang-orang Mukmin seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 3: Begitu juga jihad, kesabaran ini wahai Nabi Allah, Allah telah menolongmu dari musuh-musuh Allah dengan pertolongan yang sempurna, kokoh, dan tidak lemah dan juga meminta perlindungan dari selain-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga Islam tidak menjadi rendah, bahkan akan menang, dan orang-orang kafir akan terkalahkan, hina dan rendah, sedangkan kaum muslimin semakin kuat, banyak jumlahnya dan berkembang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 3",
    "description": "2-3. Agar Allah memberikan ampunan kepadamu, wahai nabi Muhammad atas dosamu, yakni kekeliruan yang dapat dianggap sebagai dosa sesuai dengan kedudukanmu yang mulia, baik kekeliruan yang terjadi di masa yang lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dengan meluhurkan agamamu dan menunjukimu ke jalan yang lurus yang membimbingmu kepada keridaan tuhan, dan agar Allah menolongmu terhadap musuh-Musuhmu dengan pertolongan yang kuat yang tidak dapat dikalahkan oleh siapa pun. 4. Dialah yang telah menurunkan yakni mewujudkan dan memantapkan ketenangan ke dalam hati orang-orang mukmin sehingga mereka tidak gentar menghadapi dan memerangi musuh untuk menambah keimanan atas keimanan mereka tentang kebesaran Allah. Dan milik Allah-lah bala tentara langit dan bumi, yang senantiasa patuh melaksanakan perintah-Nya untuk dan memberikan pertolongan kepada orang beriman. Dan Allah maha mengetahui keadaan makhluk-Nya, mahabijaksana dalam pengaturan dan perbuatan-Nya."
  }
]