[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah Allah Yang menurunkan ketenangan pada hati orang-orang yang beriman kepada Allah dan RasulNya di hari Hudaibiyah, hati mereka pun menjadi tenang, keyakinan bersemayam kokoh didalamnya, agar pembenaran mereka kepada Allah dan sikap mereka mengikuti RasulNya semakin bertambah di samping pembenaran dan sikap mengikuti mereka yang sudah ada. Hanya milik Allah-lah bala tentara langit dan bumi, yang dengan mereka Allah memenangkan hamba-hambaNya yang beriman. Allah Maha Mengetahui kebaikan hamba-hambaNya, Mahabijaksana dalam pengaturan dan penciptaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Allah lah yang menurunkan keteguhan dan ketenangan di dalam hati orang-orang yang beriman supaya keimanan mereka bertambah lebih dari keimanan mereka sebelumnya, dan hanya milik Allah sajalah tentara langit dan bumi, dengannya Allah menguatkan hamba-hamba-Nya yang dikehendaki-Nya. Dan Allah Maha Mengetahui maslahat para hamba-hamba-Nya dan Maha Bijaksana dalam memberikan pertolongan dan keteguhan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-6. Allah yang menurunkan ketentraman ke dalam hati para sahabat pada perang Hudaibiyah, agar keyakinan mereka semakin bertambah. Dan milik Allah pasukan di tujuh langit dan bumi yang berupa para malaikat, jin, gunung berapi, air yang menenggelamkan, dan lain sebagainya yang dapat dikerahkan untuk menolong agama-Nya. Allah Maha Mengetahui segala keadaan makhluk-Nya dan Maha Bijaksana dalam mengatur urusan mereka. Allah mengatur semua ini untuk memasukkan orang-orang beriman ke dalam surga-surga selamanya yang di dalamnya terdapat sungai-sungai mengalir di bawah pepohonannya, dan untuk mengampuni kesalahan-kesalahan mereka. Kedudukan mulia di sisi Allah ini merupakan kemenangan yang besar. Dan agar Allah dapat mengazab orang-orang munafik dan musyrik yang selalu berprasangka buruk kepada Allah dengan menyakini bahwa Allah akan menghinakan orang-orang beriman dan membiarkan ghanimah bagi orang-orang kafir, maka siksaan Allah hanya akan menimpa mereka. Allah murka terhadap mereka akibat kekafiran yang mereka lakukan, dan menjauhkan mereka dari rahmat-Nya, serta menyiapkan neraka Jahannam bagi mereka, sungguh itu adalah sebutuk-buruk tempat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. هُوَ الَّذِىٓ أَنزَلَ السَّكِينَةَ فِى قُلُوبِ الْمُؤْمِنِينَ (Dialah yang telah menurunkan ketenangan ke dalam hati orang-orang mukmin) Yakni ketenangan dan ketentraman yang memudahkan mereka untuk melakukan penakhlukan, agar jiwa mereka tidak gentar ketika mendapat serangan dari musuh. لِيَزْدَادُوٓا۟ إِيمٰنًا مَّعَ إِيمٰنِهِمْ ۗ( supaya keimanan mereka bertambah di samping keimanan mereka (yang telah ada)) Yakni agar dengan ketentraman itu Allah menambah keimanan bagi mereka keimanan di atas keimanan mereka sebelumnya. وَلِلّٰهِ جُنُودُ السَّمٰوٰتِ وَالْأَرْضِ ۚ( Dan kepunyaan Allah-lah tentara langit dan bumi) Untuk menolong rasul-Nya dengan apa yang Dia kehendaki, meski tanpa peperangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dia-lah Allah yang telah menurunkan dan menghadirkan ketenangan dan ketetapan di dalam hati orang-orang mukmin. Mereka adalah orang-orang yang ikut serta dalam peristiwa Hudaibiyah. Mereka yang berbaiat kepadamu, mereka ridho atas ketetapan dalam berperang hingga datangnya pertolongan. Agar keimanan mereka semakin bertambah atas datangnya pertolongan, kemuliaan dan kelapangan jalan tersebarnya Islam. Hanya milik Allah –lah tentara langit dan bumi yang telah melaksanakan segala perintah-Nya. Tentara Allah itu adalah para malaikat, manusia, para jin, bebatuan dan goncangan serta lainnya. Allah telah mengatur urusan mereka dan menuntun mereka sesuai kehendak-Nya. Allah Maha Tahu atas keadaan makhluk-Nya. Allah Maha Bijakasana atas segala apa yang Allah lakukan. Maksud dari tentara Allah adalah yang telah menolong orang-orang mukmin (la’alla ash shawab)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Dzat yang telah menurunkan ketenangan} ketenangan dan keteguhan {ke dalam hati orang-orang mukmin untuk menambah keimanan atas keimanan mereka. Milik Allahlah bala tentara langit dan bumi dan Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah mengabarkan karuniaNya kepada kaum mukminin dengan menurunkan ketenangan di hati mereka, ketenangan itu berupa kedamaian serta ketenangan hati saat musibah menggertarkan serta berbagai hal berat menerpa mereka yang mengusik hati, mengganggu pikiran dan melemahkan jiwa. Di antara nikmt-nikmat Allah yang diberikaNya kepada hamba-hambaNya dalam situasi seperti ini adalah dengan keteguhanya dan mengikat keteguhan tersebut di hati mereka dan menurunkan ketenagan agar berbagai beban berat tersebut bisa mereka hadapi dengan hati yang kokoh yang tenang sehingga siap untuk menunaikan perintah Allah pada situasi sulit seperti itu. Dengan perrtolongan seperti itu, keimana mereka semakin bertambah dan keyakinan mereka semakin sempurna. Para sahabat saat terjadinya peristiwa antara Rosululoh dengan kaum musrik dengan berbagai butir-butir kesepakatan yang nampaknya merendahkan dan meremehkan kemampuan mereka itu, hampir membuat jiwa mereka tidak sabar, tatkala mereka menghadapinya dengan sabar dan mereka menguatkan diri, keimanan merekapun semakin bertambah. Firman Allah ”Dan kepunyaan Allah-lah langit dan bumi,” yakni, semuanya berada dalam penguasanya, maka jangan sekali-kali orang-orang musrik mengira bahwa Allah tidak akan menolong Agamanya dan NabiNya, Karena sesungguhnya Allah Maha Mengetahui dah Maha Bijaksana, yang kebijaksanaanNya mengharuskan adanya pergantian kemenangan diantara manusia serta menunda kemenangan kaum muslimin di waktu lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 4: Ketahuilah bahwa Allah dengan karunia dan kemuliaan-Nya, Dialah yang menurunkan ketenangan dan keridhaan atas hati seorang hamba yang beriman, agar tidak bergejolak jiwa-jiwa mereka, dan menyimpang dari perjanjian, agar Allah menambah ketenangan dalam keimanan yang bertambah atas keimanan yang sebelumnya. Kemudian Allah menjelaskan bahwa Allah memiliki tentara di langit dan bumi, dan Allah Maha Tahu terhadap ciptaan-Nya, tidak tersembunyi dari urusan-Nya sesuatu apapun, dan Allah Maha Bijaksana terhadap orang-orang yang dicintai-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan atsar (pengaruh) dari fat-h tersebut. Allah Subhaanahu wa Ta'aala memberitahukan nikmat-Nya kepada kaum mukmin dengan menurunkan ketenangan ke dalam hati mereka dan keteguhan ketika menghadapi ujian dan cobaan serta perkara-perkara yang sulit yang mengacaukan hati dan menggelisahkan pikiran serta melemahkan jiwa. Termasuk nikmat Allah Subhaanahu wa Ta'aala kepada hamba-Nya dalam kondisi ini adalah diteguhkan-Nya hati mereka serta diturunkan-Nya ketenangan agar siap menerima beban-beban yang berat itu dengan hati yang kokoh dan jiwa yang tenang, sehingga hamba-Nya siap menegakkan perintah Allah dalam keadaan ini, imannya menjadi bertambah dan keyakinannya menjadi sempurna. Para sahabat radhiyallahu 'anhum ketika Rasulullah shallallahu 'alaihi wa sallam mengadakan perjanjian damai dengan orang-orang musyrik yang tampaknya merendahkan kemuliaan mereka, dimana hal itu membuat hati setiap orang menjadi tidak kuat bersabar, namun ketika mereka bersabar dan menyiapkan hati mereka untuknya, maka iman mereka menjadi bertambah. Yakni semuanya milik-Nya, di bawah kepengaturan-Nya dan kekuasaan-Nya. Oleh karena itu, orang-orang musyrik jangan mengira bahwa Allah tidak akan menolong agama-Nya dan nabi-Nya, akan tetapi Allah Subhaanahu wa Ta'aala Maha Mengetahui lagi Mahabijaksana. Hikmah-Nya menghendaki adanya penggiliran bagian pada manusia dan ditunda-Nya kemenangan kaum mukmin sampai waktu tertentu. Adapun yang dimaksud dengan tentara langit dan bumi ialah penolong yang diadakan Allah untuk orang-orang mukmin seperti malaikat-malaikat, binatang-binatang, angin topan dan sebagainya. Yakni jika Dia ingin membela agama-Nya dengan selain kaum mukmin, Dia juga bisa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 4",
    "description": "Dialah yang telah menurunkan yakni mewujudkan dan memantapkan ketenangan ke dalam hati orang-orang mukmin sehingga mereka tidak gentar menghadapi dan memerangi musuh untuk menambah keimanan atas keimanan mereka tentang kebesaran Allah. Dan milik Allah-lah bala tentara langit dan bumi, yang senantiasa patuh melaksanakan perintah-Nya untuk dan memberikan pertolongan kepada orang beriman. Dan Allah maha mengetahui keadaan makhluk-Nya, mahabijaksana dalam pengaturan dan perbuatan-Nya. 5. Agar dia masukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga untuk tinggal di sana selama-lamanya yang mengalir di bawah istananya sungai-sungai. Mereka kekal di dalamnya dan dia akan menghapus kesalahan-kesalahan yang pernah mereka lakukan agar mereka masuk ke dalam surga tanpa noda. Dan yang demikian itu, yakni surga dan ampunan Allah menurut Allah suatu keuntungan yang besar."
  }
]