[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah hendak memasukkan orang-orang beriman; laki-laki dan perempuan ke dalam surga-surga yang sungai-sungai mengalir di bawah istana-istana dan pohon-pohonnya, mereka tinggal disana selamanya. Allah menghapus keburukan yang pernah mereka kerjakan, sehingga Dia tidak menghukum mereka atasnya. Balasan tersebut di sisi Allah merupakan keselamatan dari segala kepedihan dan kemenangan meraih segala yang diinginkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Supaya Allah memasukkan orang-orang laki-laki dan perempuan yang beriman kepada Allah dan Rasul-Nya ke dalam Surga yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai dan menghapuskan kesalahan-kesalahan mereka sehingga Dia tidak membalas mereka karenanya. Dan yang disebutkan itu; dari mulai mendapatkan apa yang diinginkan yaitu Surga, dan dijauhkan dari yang tidak disukainya yaitu dibalasnya kesalahan-kesalahan mereka, merupakan kemenangan yang besar di sisi Allah, tidak ada lagi kemenangan yang mendekatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. لِّيُدْخِلَ الْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ جَنّٰتٍ تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ (supaya Dia memasukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga yang mengalir di bawahnya sungai-sungai) Jabir berkata, Rasulullah bersabda: “tidak akan masuk neraka seorangpun yang ikut berbaiat di bawah pohon (baiatussyajarah)”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah menguji para tentara-Nya yang Dia kehendaki agar mereka dimasukkan ke dalam surga yang dialiri sungai-sungai di bawah bilik-bilik dan kebun-kebunnya. Allah menutupi dosa mereka, tidak ditampakkan dan tidak diazab. Janji surga dan ampunan adalah janji dari Allah. Dalam ketetapannya itu terdapat keberuntungan yang tidak sebanding dengan keberuntungan lain. Jabir berkata: Nabi SAW bersabda: “Orang-orang yang telah berbaiat di bawah pohon (peristiwa Hudaibiyah) tidak akan masuk neraka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Dia memasukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya. Dia akan menghapus} menghapus {kesalahan-kesalahan mereka. Yang demikian itu menurut Allah suatu kemenangan yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Supaya Dia memasikan orang-orang Mukmin laki-laki dan perempuan ke dalam surga yang di bawahnya mengalir sungai-sungai mereka kekal didalamnya dan supaya mereka menutupi kesalahan-kesalahan mereka.” Inilah karunia terbesar yang di peroleh kaum Mukminin, mereka mendapatka apa-apa yang diinginkan dan di harapkan dengan masuknya ke dalam surga, dan ketakutan mereka dihilangkan dengan cara penghapusan kesalahan-kesalahan yang mereka miliki “dan yang demikian itu.” Balasan yang disebut bagi kaum Mukminin, “di sisi Allah adalah keberuntungan yang besar.” Inilah yang dilakukan Allah terhadap orang-orang Mukmin pada peristiwa kemenangan yang nyata itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 5: Allah menjelaskan bahwa Dia menurunkan ketenangan atas hati-hati orang-orang yang beriman dan menjadikan tentara-Nya baik di langit maupun di bumi dibawah kekuasaan-Nya dan kerajaan-Nya; Untuk supaya Allah memasukkan orang-orang beriman laki-laku dan perempuan ke dalam surga-Nya yang mengalir di bawah pepohonan dan istananya sungai-sungai. Mereka tinggal di dalamnya dan tidak keluar selamanya, tidak berubah dan tidak juga binasa di dalam surga. Allah juga menghapuskan keburukan-keburukan mereka, dan menghilangkan dosa-dosa mereka. Dan di sisi Allah terdapat kemenangan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Anas, bahwa ayat ini turun kepada Nabi shallallahu 'alaihi wa sallam saat Beliau pulang dari Hudaibiyah, sedangkan para sahabat diliputi kesedihan dan kedukaan, dimana mereka dihalangi dari mendatangi kampung halaman mereka, mereka sembelih hewan hadyu di Hudaibiyah, yaitu ayat, “Sungguh, Kami telah memberikan kepadamu kemenangan yang nyata.” Sampai ayat, “Shiraatam mustaqiimaa.” Beliau bersabda, “Sungguh, telah diturunkan kepadaku dua ayat yang keduanya lebih baik daripada dunia seluruhnya.” Saat Beliau membacakannya, lalu ada seseorang yang berkata, “Mudah-mudahan hal itu menyenangkanmu wahai Rasulullah, Dia telah menjelaskan kepadamu apa yang Dia lakukan untukmu, lalu apa yang Dia lakukan untuk kami? Maka Allah ‘Azza wa Jalla menurunkan ayat setelahnya, “Agar Dia memasukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga yang mengalir di bawahnya sungai-sungai….dst.” Ini merupakan hasil terbesar yang diperoleh kaum mukmin, yakni memperoleh semua yang diinginkan dengan masuk ke surga serta disingkirkan semua yang ditakuti dengan dihapuskan kesalahan-kesalahannya. Yakni balasan yang disebutkan untuk kaum mukmin itu. Inilah yang Allah lakukan untuk kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 5",
    "description": "Agar dia masukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga untuk tinggal di sana selama-lamanya yang mengalir di bawah istananya sungai-sungai. Mereka kekal di dalamnya dan dia akan menghapus kesalahan-kesalahan yang pernah mereka lakukan agar mereka masuk ke dalam surga tanpa noda. Dan yang demikian itu, yakni surga dan ampunan Allah menurut Allah suatu keuntungan yang besar. 6. Dan dia, yakni Allah yang maha kuasa, mengazab orang-orang munafik laki-laki dan perempuan, dan juga orang-orang musyrik laki-laki dan perempuan dengan azab di dunia dan akhirat. Mereka adalah orang-orang yang berprasangka buruk terhadap Allah dan menyangka bahwa Allah tidak menepati janji-Nya memberikan pertolongan kepada orang-orang mukmin. Mereka akan mendapat giliran azab kebinasaan yang buruk dan Allah murka kepada mereka dan mengutuk mereka sehingga mereka tersiksa di dunia ini serta menyediakan kelak di akhirat neraka jahanam bagi mereka. Dan neraka jahanam itu seburuk-buruk tempat kembali."
  }
]