[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mengazab orang-orang munafik; laki-laki dan perempuan, orang-orang musyrik; laki-laki dan perempuan yang berburuk sangka kepada Allah bahwa Allah tidak akan memenangkan NabiNya dan orang-orang beriman yang bersamanya atas musuh-musuhnya, dan Allah tidak akan meninggikan agamaNya. Orang-orang tersebut akan dikepung oleh azab dan apa yang memburukkan mereka, Allah murka terhadap mereka, mengusir mereka dari rahmatNya, menyiapkan bagi mereka api Neraka Jahanam sebagai tempat kembali, dan itu adalah tempat tinggal paling buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan supaya Allah menyiksa orang-orang munafik laki-laki dan perempuan serta menyiksa orang-orang yang musyrik laki-laki dan perempuan kepada Allah yang berprasangka buruk kepada Allah bahwa Allah tidak akan menolong agama-Nya, tidak meninggikan kalimat-Nya dan bahwa giliran kekalahan ada pada orang-orang yang beriman, namun ternyata giliran kekalahan ada pada mereka. Dan Allah murka pada mereka disebabkan kekufuran mereka dan prasangka buruk mereka dan Allah mengusir mereka dari rahmat-Nya serta menyiapkan bagi mereka di Akhirat neraka Jahanam yang mereka masuki selama-lamanya di dalamnya, dan neraka Jahanam adalah seburuk-buruk tempat mereka kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَيُعَذِّبَ الْمُنٰفِقِينَ وَالْمُنٰفِقٰتِ وَالْمُشْرِكِينَ وَالْمُشْرِكٰتِ (dan supaya Dia mengazab orang-orang munafik laki-laki dan perempuan dan orang-orang musyrik laki-laki dan perempuan) Dengan kegundahan dan kemuraman yang menimpa mereka akibat apa yang mereka saksikan berupa kemenangan Islam dan kekalahan musuhnya, dan akibat kekalahan mereka serta terbunuh dan tersandera setelah peperangan, serta bagi mereka azab Jahannam di akhirat. الظَّآنِّينَ بِاللهِ ظَنَّ السَّوْءِ (yang mereka itu berprasangka buruk terhadap Allah) Yakni prasangka mereka bahwa Rasulullah akan kalah, dan kekafiran akan mengalahkan Islam. عَلَيْهِمْ دَآئِرَةُ السَّوْءِ ۖ( Mereka akan mendapat giliran (kebinasaan) yang amat buruk) Yakni apa yang mereka prasangkakan terhadap orang-orang beriman akan kembali kepada mereka sendiri. وَغَضِبَ اللهُ عَلَيْهِمْ وَلَعَنَهُمْ وَأَعَدَّ لَهُمْ جَهَنَّمَ ۖ وَسَآءَتْ مَصِيرًا(dan Allah memurkai dan mengutuk mereka serta menyediakan bagi mereka neraka Jahannam. Dan (neraka Jahannam) itulah sejahat-jahat tempat kembali)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Allah akan menyiksa orang-orang munafik dan pelaku kesyirikan di dunia dengan kedukaan, kekalahan/pemaksaan, pemenjaraan dan pembunuhan. Adapun azab di akhirat adalah dimasukkan ke neraka Jahannam. Orang-orang yang berprasangka buruk bahwa Allah tidak akan menolong nabi-Nya, juga yang menyangka bahwa keyakinan orang-orang kafir akan mulia maka mereka akan mendapatkan giliran kebinasaan sebagaimana yang telah mereka sangka. Mereka akan mendapatkan murka Allah, dan tertolak dari rahmat Allah. Allah akan memasukkan mereka ke neraka Jahannam. Tempat yang paling buruk sudah menanti mereka di akhirat sebagai tempat tinggal mereka. Dairatus sau’ adalah tipu daya yang mereka lakukan sendiri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengazab orang-orang munafik laki-laki dan perempuan serta orang-orang musyrik laki-laki dan perempuan yang berprasangka terhadap Allah dengan prasangka buruk} prasangka buruk bahwa Allah tidak menolong nabi Muhammad dan para sahabatnya {Mereka akan mendapat giliran (azab) yang buruk} bagi mereka itu giliran azab dan kehancuran {Allah murka kepada mereka, melaknat mereka} mengusir mereka dari rahmatNya {dan menyediakan neraka Jahanam bagi mereka. Itulah seburuk-buruk tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Adapun orang-orang munafik, baik lelaki maupun perempuan dan juga orang-orang musyrik, baik lelaki maupun perempuan, akan disiksa oleh Allah karena kemunafikan serta kekufuran mereka dan akan memperlihatkan kepada mereka pemandangan yang mengerikan bagi mereka, karena tujuan dan maksud mereka adalah ingin merendahkan kaum Mukminin, mereka juga menyangka buruk terhadap Allah bahwa Allah tidak akan menolong agamaNya dan tidak meninggikan kalimatNya, mereka juga mengira bahwa orang-orang batil akan menguasai orang-orang yang benar. Ternyata Allah membalikkan dugaan mereka, kekalahan pun menimpa mereka. “Dan Allah memurkai mereka,” dengan menjauhkan mereka dari rahmatNya, “serta menyediakan bagi mereka Neraka Jahanam. Dan (Neraka jahanam) itulah seburuk-buruk tempat kembali.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 6: Allah menjelaskan bahwa Allah mengadzab orang-orang munafik baik laki-laki maupun perempuan, laki-laki musyrik maupun perempuan yang mereka dengki kepada orang-orang yang beriman dan yang mereka menyerang kaum muslimin, dan yang mereka menyangka dengan sangkaan buruk kepada Allah yang bahwasanya mereka menganggap bahwa Allah tidak akan menolong agama-Nya, tidak juga meninggikan kalimat-Nya, dan Allah menjadikan pengikut kebenaran di atas pengikut kebathilan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu menyangka bahwa Allah Subhaanahu wa Ta'aala tidak akan menolong Rasul-Nya dan kaum mukmin. Kaum munafik laki-laki maupun perempuan, demikian pula kaum musyrik laki-laki maupun perempuan, maka Allah akan mengazab mereka dan memperlihatkan kepada mereka sesuatu yang menyakitkan mereka, karena maksud mereka adalah agar kaum mukmin terlantar dan karena mereka berprasangka buruk kepada Allah, yakni bahwa Allah tidak akan menolong agama-Nya, tidak akan meninggikan kalimat-Nya, dan bahwa orang yang berada di atas kebatilan akan terus berada di atas orang-orang yang berada di atas yang hak. Karena perbuatan mereka menentang Allah dan Rasul-Nya. Yakni menjauhkan mereka dari rahmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 6",
    "description": "Dan dia, yakni Allah yang maha kuasa, mengazab orang-orang munafik laki-laki dan perempuan, dan juga orang-orang musyrik laki-laki dan perempuan dengan azab di dunia dan akhirat. Mereka adalah orang-orang yang berprasangka buruk terhadap Allah dan menyangka bahwa Allah tidak menepati janji-Nya memberikan pertolongan kepada orang-orang mukmin. Mereka akan mendapat giliran azab kebinasaan yang buruk dan Allah murka kepada mereka dan mengutuk mereka sehingga mereka tersiksa di dunia ini serta menyediakan kelak di akhirat neraka jahanam bagi mereka. Dan neraka jahanam itu seburuk-buruk tempat kembali. 7. Dan milik Allah-lah bala tentara langit dan bumi, yang terdiri dari para malaikat, jin dan manusia, tanda-tanda alam seperti petir dan gempa yang jika Allah memerintahkan mereka untuk membinasakan musuh-Musuh Allah niscaya mereka patuh melaksanakan perintah-Nya. Dan Allah maha mengetahui keadaan makhluk-Nya, mahabijaksana dalam pengaturan dan perbuatan-Nya."
  }
]