[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memiliki bala tentara langit dan bumi, yang dengan mereka Allah menolong hamba-hambaNya. Allah Mahaperkasa atas makhlukNya lagi Mahabijaksana dalam mengatur urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan milik Allah sajalah tentara langit dan bumi, dengannya Allah menguatkan hamba-hamba-Nya yang dikehendaki-Nya, dan Allah Maha Perkasa, tidak ada seorangpun yang mampu mengalahkan-Nya, dan Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan pengaturan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hanya milik Allah pasukan yang ada di tujuh langit dan bumi, untuk menolong agama-Nya dan menghancurkan musuh-musuh-Nya. Allah Maha Perkasa dalam memberi balasan dan Maha Bijaksana dalam mengatur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَلِلّٰهِ جُنُودُ السَّمٰوٰتِ وَالْأَرْضِ ۚ (Dan kepunyaan Allah-lah tentara langit dan bumi) Berupa malaikat, manusia, jin, setan, dan segala sesuatu yang memiliki kekuatan dan yang dapat melawan musuh-Nya, serta angin, petir, dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Milik Allah-lah tentara yang ada di langit dan bumi. Mereka adalah para malaikat, halilintar, goncangan dan penenggelaman. Allah Maha Perkasa dan tidak terkalahkan. Allah Maha Bijaksana dalam segala yang Dia lakukan, maka sungguh tidak sama orang-orang mukmin dengan orang kafir. Maksud perbedaan ini adalah untuk ancaman bagi orang musyrik, juga pemberian pelajaran tentang keadaan orang-orang terdahulu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Milik Allahlah bala tentara langit dan bumi. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah mengulang-ulang memberikan kabar bahwa milik-Nya lah kerajaan langit dan bumi serta semua tentara yang ada pada keduanya agar semua hamba mengetahui bahwa Allah adalah yang memberikan pertolongan dan yang memberikan kehinaan dan supaya para hamba mengetahui bahwa tentara-tentaraNya akan mendapatkan pertolongan sebagaimana yang disebutkan dalam Firman Allah, \"Dan sesungguhnya tentara Kami itulah yang pasti menang,\" -Ash-Shaffat:173- “Dan Allah Mahaperkasa.” Mahakuat, Maha Mengalahkan, Maha Menundukkan segala sesuatu. Meski Mahaperkasa dan Mahakuat, Allah adalah Mahabijaksana terhadap para makhlukNya. pengaturanNya berlaku sesuai dengan kebijakan hikmah dan kesempurnaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 7: Ketahuilah bahwasanya Allah memiliki tentara di langit dan di bumi, dan tidaklah tentara-tentara Tuhanmu diketahui kecuali hanya Dia yang mengetahui. dan Allah menolong hamba-hambanya yang beriman dari tentara tentara Allah. Dan sungguh Allah Maha gagah, Maha Kuat, yang menguasai segala sesuatu, yang memiliki hikmah dalam penciptaan-Nya dan membimbing para kekasihnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengulang berita-Nya bahwa milik-Nya kerajaan langit dan bumi dan apa yang ada di antara keduanya agar para hamba mengetahui bahwa Dia Yang memuliakan dan menghinakan, dan bahwa Dia akan menolong orang yang menolong agama-Nya sebagaimana firman-Nya, “Dan sesungguhnya tentara Kami itulah yang pasti menang,” (Terj. Ash Shaaffaat: 173) Yakni Dia Mahakuat lagi Maha Mengalahkan. Di samping Dia Mahaperkasa lagi Mahakuat, Dia juga Mahabijaksana dalam ciptaan-Nya dan dalam pengaturan-Nya; sehingga berjalan sesuai hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 7",
    "description": "Dan milik Allah-lah bala tentara langit dan bumi, yang terdiri dari para malaikat, jin dan manusia, tanda-tanda alam seperti petir dan gempa yang jika Allah memerintahkan mereka untuk membinasakan musuh-Musuh Allah niscaya mereka patuh melaksanakan perintah-Nya. Dan Allah maha mengetahui keadaan makhluk-Nya, mahabijaksana dalam pengaturan dan perbuatan-Nya. 8. Sungguh kami mengutus engkau wahai nabi Muhammad sebagai saksi atas kebenaran, pembawa berita gembira bahwa mereka akan memperoleh surga apabila mereka beriman dan pemberi peringatan bahwa mereka akan disiksa apabila mereka membangkang."
  }
]