[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Sesungguhnya Kami mengutusmu (wahai Rasul) sebagai saksi atas umatmu bahwa kamu telah menyampaikan, juga sebagai penjelas bagi mereka tentang apa yang dengannya Kami mengutusmmu kepada mereka, juga sebagai pemberi kabar gembira berupa surga bagi siapa yang menaatimu, juga sebagai pemberi peringatan berupa azab dunia dan akhirat bagi siapa yang mendurhakaimu; agar kalian beriman kepada Allah dan RasulNya, menolong Allah dan menolong agamaNya, mengagungkan Allah, dan bertasbih kepadaNya, di pagi dan petang hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya Kami mengutusmu -wahai Rasul- sebagai saksi, engkau bersaksi atas umatmu pada hari Kiamat dan sebagai pemberi kabar gembira untuk orang-orang yang beriman dengan apa yang telah disediakan bagi mereka di dunia berupa pertolongan dan keteguhan, dan dengan apa yang telah disediakan untuk mereka di Akhirat berupa kenikmatan, serta sebagai pemberi rasa takut kepada orang-orang kafir atas apa yang telah disediakan bagi mereka di dunia berupa kehinaan dan kekalahan dari orang-orang yang beriman, dan dengan apa yang telah dijanjikan bagi mereka di akhirat berupa siksa pedih yang menunggu mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Hai Rasulullah, Kami -dengan keagungan dan kuasa Kami- mengutusmu sebagai saksi atas seluruh makhluk bahwa Kami telah menyampaikan risalah, sehingga tidak ada alasan lagi bagi oarng-orang yang menyelisihi syariatmu; sebagai penyampai kabar gembira berupa surga yang penuh dengan kenikmatan; dan sebagai pemberi peringatan bagi orang-orang fasik dari neraka Jahannam; agar kalian beriman kepada Allah -hai para hamba-, dan mengakui keesaan Allah dan risalah Rasulullah, serta agar kalian menghormati dan mengagungkan Rasulullah, dan bertasbih kepada Allah di pagi dan sore hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّآ أَرْسَلْنٰكَ شٰهِدًا (Sesungguhnya Kami mengutus kamu sebagai saksi) Yakni kamu akan bersaksi atas umatmu bahwa kamu telah menyampaikan risalah kepada mereka. وَمُبَشِّرًا(pembawa berita gembira) Berupa surga bagi orang-orang yang taat. وَنَذِيرًا(dan pemberi peringatan) Bagi orang-orang yang bermaksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya Kami telah mengutus engkau wahai Rasul sebagai saksi atas ummatmu dengan menyampaikan risalah ini. Engkau juga diutus sebagai pemberi kabar gembira bagi orang-orang yang taat kepadamu dengan balasan surga. Juga sebagai pemberi peringatan bagi orang yang mendurhakaimu dengan balasan neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami mengutusmu sebagai saksi, pembawa berita gembira, dan pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Sesungguhnya Kami mengutus kamu,” wahai rasul yang mulia, “sebagai saksi,” untuk umatmu terhadap apa yang mereka perbuat, baik dan buruknya, juga sebagai saksi atas segala ucapan dan berbagai masalah, benar dan batilnya, dan sebagai saksi untuk Allah atas keesaanNya dan hanya Dia semata yang memiliki kesempurnaan dari segi segala segi, “dan pembawa berita gembira,” bagi yang mau menaatimu dan taat kepada Allah dengan pahala duniawi, agama dan ukhrawi, dan juga pemberi peringatan bagi yang mendurhakai Allah dengan siksa yang disegerakan (di dunia) dan yang ditunda (diakhirkan). Di antara kesempurnaan kabar gembira dan peringatan adalah menjelaskan amal dan akhlak yang disebutkan dalam berita gembira dan peringatan, dan Rasulullah adalah penjelas untuk kebaikan dan keburukan, kegembiraan dan kesengsaraan, kebenaran dan kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 8: Ketahuilah wahai nabi Allah, bahwasanya Allah telah mengutusmu sebagai saksi atas umatmu dan engkaulah saksi atas keimanan, dan engkau juga sebagai saksi bagi orang-orang yang sombong dan kufur serta memusuhi dakwahmu, engkaulah penyampai kabar gembira bagi orang-orang yang sholeh yang mereka telah disiapkan oleh Allah surga dan balasan yang besar atas mereka, engkau juga sebagai orang yang memberi peringatan kepada pelaku maksiat dengan neraka dan adzab yang pedih dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi umatmu pada hari Kiamat terhadap perbuatan yang mereka lakukan, baik atau buruk, demikian pula sebagai saksi terhadap berbagai perkataan dan permasalahan, serta menjadi saksi terhadap keesaan Allah dan sendiri-Nya Dia dengan kesempurnaan dari berbagai sisi. Bagi orang yang taat kepada Allah dan taat kepada Rasul-Nya dengan balasan dunia, agama dan akhirat. Bagi orang yang durhaka kepada Allah dengan hukuman yang segera atau lambat. Di antara sempurnanya pemberian kabar gembira dan peringatan adalah menerangkan amal dan akhlak yang mendapatkan kabar gembira atau peringatan. Dengan demikian, Beliau adalah yang menerangkan kebaikan dan keburukan, yang hak dan yang batil. Oleh karena itulah Allah Subhaanahu wa Ta'aala melanjutkan dengan firman-Nya, “Agar kamu semua beriman kepada Allah dan Rasul-Nya,” yakni disebabkan dakwah Rasulullah shallallahu 'alaihi wa sallam kepada kamu dan pengajarannya terhadap hal yang bermanfaat bagimu. Allah Subhaanahu wa Ta'aala mengutus Beliau agar manusia beriman kepada Allah dan Rasul-Nya yang menghendaki untuk taat kepada Allah dan Rasul-Nya dalam semua urusan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 8",
    "description": "Sungguh kami mengutus engkau wahai nabi Muhammad sebagai saksi atas kebenaran, pembawa berita gembira bahwa mereka akan memperoleh surga apabila mereka beriman dan pemberi peringatan bahwa mereka akan disiksa apabila mereka membangkang. 9. Aku mengutusmu dengan membawa pesan ini agar kamu semua beriman kepada Allah dan rasul-Nya dengan menaati perintah-Nya, me-nguatkan agama-Nya menghadapi segala musuhnya, dan membesarkan-Nya dengan sungguh-sungguh, dan bertasbih menyucikan kepada-Nya di waktu pagi dan petang, yakni sepanjang waktu."
  }
]