[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Sesungguhnya Kami mengutusmu (wahai Rasul) sebagai saksi atas umatmu bahwa kamu telah menyampaikan, juga sebagai penjelas bagi mereka tentang apa yang dengannya Kami mengutusmmu kepada mereka, juga sebagai pemberi kabar gembira berupa surga bagi siapa yang menaatimu, juga sebagai pemberi peringatan berupa azab dunia dan akhirat bagi siapa yang mendurhakaimu; agar kalian beriman kepada Allah dan RasulNya, menolong Allah dan menolong agamaNya, mengagungkan Allah, dan bertasbih kepadaNya, di pagi dan petang hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dengan harapan kalian beriman kepada Allah dan beriman kepada Rasul-Nya, mengagungkan Rasul-Nya, meninggikannya dan mensucikan Allah pada permulaan siang dan akhirnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. لِّتُؤْمِنُوا۟ بِاللهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ (supaya kamu sekalian beriman kepada Allah dan Rasul-Nya, menguatkan (agama)Nya, membesarkan-Nya) Yakni agar kalian mengagungkan Rasulullah. Qatadah berkata: yakni agar kalian menolong dan melindunginya dari setiap orang yang ingin mencelakainya. وَتُسَبِّحُوهُ(Dan bertasbih kepada-Nya) Yakni agar kalian menyucikan Allah. بُكْرَةً وَأَصِيلًا(di waktu pagi dan petang) Yakni pada setiap pagi dan petang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kami mengutusmu dengan risalah ini agar kalian semua beriman kepada Allah semata, Yang tidak ada sekutu baginya. Juga agar beriman kepada pemungkas para nabi. Agar kalian membantu dan memuliakannya, juga agar kalian mensucikan nama Allah dari segala sesuatu yang tidak layak untuk-Nya, baik di waktu pagi maupun sore, atau setiap waktu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar kalian beriman kepada Allah dan RasulNya, menguatkanNya} menolongNya dengan cara menolong agamaNya {membesarkanNya} mengagungkan dan meninggikanNya {dan bertasbih kepadaNya, pagi maupun petang} permulaan dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Karena itulah diteruskan dengan FirmanNya, “Supaya kamu sekalian beriman kepada Allah dan RasulNya.” Maksudnya, karena dakwah Rasul yang disampaikan pada kalian dan ajarannya terhadap apa yang membawa manfaat bagi kalian, Kami mengutusnya agar kalian beriman kepada Allah dan RasulNya yang mengharuskan untuk menaati Allah dan RasulNya dalam berbagai hal. “Menguatkannya dan membesarkannya.” Artinya, supaya kalian menguatkan Rasulullah dan mengagungkan dan memuliakannya dengan menunaikan hak-haknya sebagaimana Allah memberikan karunia besar kepada kalian dengan menjaga kalian, “dan bertasbih kepadaNya,” yaitu memahasucikan Allah “di waktu pagi dan petang,” yakni, dipermulaan dan penghujung siang. Dalam ayat ini Allah menyebutkan hak bersama antara hak Allah dan hak RasulNya, yaitu beriman kepada keduanya, hak yang khusus untuk Rasulullah adalah dengan menolong dan memuliakannya, sedangkan hak yang khusus bagi Allah adalah dengan memahasucikanNya dengan Shalat dan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fath ayat 9: Dan sebagaimana Allah mengutusmu wahai nabi Allah, sebagai saksi atas umatmu dan sebagai pemberi kabar gembira, dan juga pemberi peringatan bagi mereka; Begitu juga Allah mengutusmu untuk berdakwah kepada manusia, yaitu menyeru kepada tauhid dan mengajarkan kepada mereka urusan-urusan agama mereka; Agar mereka beriman kepada Allah dan rasulnya dan agar mereka menolong agama Allah dan mengagungkan rasulnya serta mentaati dan menjalankan hak-haknya; dimana nabi disifati dengan kesempurnaan, disucikan dari kesyirikan dan dari kekurangan baik di awal maupun di akhir. Dan mereka terus menerus bertasbih kepada Allah dan mensucikan-Nya dari apa yang tidak pantas bagi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dhamir (kata ganti nama) “nya” bisa kembali kepada Allah atau Rasul-Nya. Jika kembali kepada Rasulullah shallallahu 'alaihi wa sallam adalah, agar kamu memuliakan Beliau, menghormatinya, memenuhi hak-haknya karena Beliau memiliki jasa yang besar terhadap kamu. Dhamir ini kembali kepada Allah Subhaanahu wa Ta'aala. Syaikh As Sa’diy berkata, “Allah menyebutkan dalam ayat ini hak yang tergabung antara Allah dan Rasul-Nya, yaitu beriman kepada keduanya. Yang khusus bagi Rasul adalah dimuliakan dan dihormati, sedangkan yang khusus bagi Allah adalah mentasbihkan dan mensucikan-Nya baik dengan shalat maupun lainnya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fath Ayat 9",
    "description": "Aku mengutusmu dengan membawa pesan ini agar kamu semua beriman kepada Allah dan rasul-Nya dengan menaati perintah-Nya, me-nguatkan agama-Nya menghadapi segala musuhnya, dan membesarkan-Nya dengan sungguh-sungguh, dan bertasbih menyucikan kepada-Nya di waktu pagi dan petang, yakni sepanjang waktu. 10. Bahwa orang-orang yang berjanji setia kepadamu, wahai nabi Muhammad, sesungguhnya mereka pada hakikatnya hanya berjanji setia kepada Allah. Karena tujuan berjanji setia kepada rasul adalah untuk menaati perintah Allah. Tangan Allah, yakni kekuasaan-Nya, di atas tangan-tangan mereka, dia akan menolong orang yang berjanji itu dalam melaksanakan janjinya. Maka barangsiapa melanggar janji yang telah diucapkan kepada nabi maka sesungguhnya dia melanggar atas janji sendiri, dan akibat pelanggaran itu akan menimpa diri sendiri; dan barangsiapa menepati janjinya kepada Allah, dan menunaikannya dengan sempurna, maka dia akan memberinya pahala yang besar, yaitu surga."
  }
]