[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Pada hari kiamat wajah wajah orang beriman bersuka cita, Karena mereka berusaha di dunia dengan ketaatan-ketaatan, dan mereka ridha di akhirat, Di dalam surga yang tempat dan kedudukannya tinggi. Tidak terdengar satu pun kata sia-sia, Di sana ada mata air yang memancar airnya, Ada ranjang-ranjang yang tinggi, gelas-gelas yang disiapkan untuk orang-orang yang mau minum, bantal-bantal yang tersusun,yang satu didamping yang lain, dan juga permadani-permadani yang terhampar banyak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Di dalam Surga terdapat pula dipan-dipan yang tinggi,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-16. Dalam surga ini terdapat dipan-dipan yang cukup bagi orang yang bersandar di atasnya; dipan-dipan itu jauh dari tanah untuk menambah kenyamanannya. Pada penghuni surga akan meminum khamr yang ada di gelas-gelas yang telah dipersiapkan untuk diminum, gelas-gelas itu tidak akan diambil dari tangan mereka sehingga kenikmatannya tidak akan terhenti. Telah disiapkan bagi mereka bantal-bantal yang berdekatan sebagai tempat bersandar, dimanapun penghuninya hendak duduk atau bersandar maka dia mendapatinya. Disiapkan pula karpet-karpet yang ditenun dari benang lembut yang berwarna, karpet-karpet itu dihamparkan di tanah sebagai hiasan, pembuatannya sangat detail dan hati-hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12-13. Di surga ada mata air yang mengalir air minum yang sangat lezat. Juga ada dipan-dipan yang ditinggikan tempat dan derajatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di sana ada dipan-dipan yang ditinggikan} tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-16. Sedangkan ahli kebajikan, wajah-wajah mereka pada Hari Kiamat, “berseri-seri,” yakni karena indahnya kenikmatan yang mereka dapatkan, maka raga mereka berseri dan wajah-wajah mereka berbinar dan amat gembira “karena usahanya,” yang dilakukan di dunia berupa amal baik dan kebajikan terhadap hamba-hamba Allah, “Ia merasa senang,” karena mendapatkan pahalanya yang disimpan ternyata berlipat ganda, sehingga terpujilah kesudahan amalnya dan tercapailah segala sesuatu yang diharapkan. Hal itu karena balasan amal baiknya berada “dalam surga,” yang mencakup berbagai macam kenikmatan secara keseluruhan, “yang tinggi,” tempat dan kedudukannya. Kedudukannya berada di tingkatan paling atas dan tempat nya adalah kediaman-kediaman tinggi yang memiliki berbagai kamar. Di atas kamar terdapat kamar lain, dari kamar itu terlihat kemuliaan yang disediakan oleh Allah untuk mereka. (Dalam ayat lain) “Buah-buahannya dekat.” (Al-Haqqah: 23), yakni banyak buah-buahan lezat yang mengeluarkan buah-buahan indah dan mudah dipetik sekira penghuni surga bisa memetiknya dalam berbagai kondisi mereka. Tidak perlu memanjat dan buahnya pun tidak sulit dipetik. “Tidak kamu dengar di dalamnya,” yakni, di dalam surga, “perkataan yang tidak berguna,” yakni kata-kata tidak bermanfaat dan batil, apalagi kata-kata yang diharamkan. Perkataan para penghuni surga adalah kata-kata indah dan berguna yang mencakup dzikir mengingat Allah, menyebut nikmat Allah yang amat banyak. Menggunakan etika baik di antara sesama penghuni surga yang menggembirakan hati dan melapangkan dada. “Di dalamnya ada mata air yang mengalir.” Ini adalah isim jenis (kata umum). Yaitu di dalam surga terdapat berbagai mata air yang dipancarkan oleh penghuni surga dan mereka gunakan sebagaimana yang mereka kehendaki dan dialirkan kemanapun yang mereka inginkan. “Di dalamnya ada tahta-tahta yang ditinggikan.” Yaitu tempat-tempat duduk yang tinggi dari segi dzatnya dengan berbagai permadani halus dan lembut. “Dan gelas-gelas yang terletak (di dekatnya),” yakni gelas-gelas yang berisi penuh dengan berbagai jenis minuman lezat diletakkan di hadapan mereka, disediakan untuk mereka, dan tunduk dibawah kehendak serta pilihan mereka. Anak-anak kecil yang kekal mengelilingi mereka. “Dan bantal-bantal sandaran yang tersusun,” yakni bantal-bantal yang terbuat dari sutra tebal dan sutra tipis serta dari bahan lain yang hanya diketahui oleh Allah. Bantal-bantal itu disusun untuk diduduki dan dijadikan sandaran. Para penghuni surga tidak perlu meletakkan dan menatanya. “Dan permadani-permadani yang terhampar,” adalah permadani indah yang terhampar. Yaitu, permadani-permadani itu memenuhi tempat duduk mereka dari segala penjuru."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فِيهَا سُرُرٌ } Dan didalam surga itu terdapat tahta-tahta { مَرْفُوعَةٌ } yang tinggi dan empuk, mereka duduk diatasnya dengan nikmat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فِيهَا سُرُرٌ مَرْفُوعَةٌ (13) وَأَكْوَابٌ مَوْضُوعَةٌ (14) وَنَمَارِقُ مَصْفُوفَةٌ (15) وَزَرَابِيُّ مَبْثُوثَةٌ (16) \" Di dalamnya ada takhta-takhta yang ditinggikan, dan gelas-gelas yang terletak (di dekatnya), dan bantal-bantal sandaran yang tersusun, dan permadani-permadani yang terhampar.\" Perhatikanlah untuk membandingkan فِيهَا سُرُرٌ مَرْفُوعَةٌ \" Di dalamnya ada takhta-takhta yang ditinggikan \" (dipan-dipan) yang tinggi, mereka duduk di atasnya sambil saling bergurau. هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ \" Mereka dan istri-istri mereka berada dalam tempat yang teduh, bertelekan di atas dipan-dipan.\"(QS. Yasin: 56)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 13: 8-16. Kemudian datang (menceritakan) kejadian kelompok manusia yang kedua. Wajah mereka pada hari itu berseri-seri; Dengan kata lain terdapat kenikmatan, kebahagian dan kegirangan yang terlihat pada mereka, yaitu sebuah kenikmatan. Ia adalah wajah-wajah orang beriman. Pada wajah ini terdapat amalan yang mereka amalkan di dunia dengan ridha; Dikarenakan mereka telah mendapatkan balasan atas apa yang mereka ridha (di dunia). Lalu Allah menerangkan sebagian dari macam-macam kenikmatan yang diberikan oleh Allah atas pemiliki wajah-wajah ini, Allah berkata : Ketahuilah bahwa pemilik wajah-wajah ini tempatnya di surga yang tinggi kedudukannya, tempat tinggalnya dan derajatnya. (Mereka) tidak akan mendengar di dalamnya perkataan yang sia-sia dan bathil, di dalamnya ada mata air yang airnya mengalir, menyembur dan tidak akan habis ketika mereka ingin (minum) dengan bagaimanapun yang mereka inginkan. Di dalamnya juga terdapat dipan-dipan tinggi untuk mereka duduk dan bersandar. Di dalamnya juga terdapat gelas-gelas yang diletakkan untuk mereka minum dan disediakan (untuk mereka). Dan di dalamnya ada bantal (terbuat) dari sutra, tebal dan selainnya, yang tersusun sebagiannya di samping sebagian yang lain. Di dalamnya juga terdapat banyak permadani yang terhampar dengan indah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat duduk yang tinggi dengan dilapisi permadani yang lunak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 13",
    "description": "Di surga sana ada dipan-dipan yang ditinggikan, baik posisinya maupun derajatnya, sebagai tempat mereka duduk dan berbaring. 14. Dan di sana ada pula gelas-gelas berisi bermacam minuman yang tersedia di dekat mereka. Mereka tidak perlu beringsut untuk mengambilnya."
  }
]