[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Apakah orang orang kafir yang mendustakan itu tidak melihat kepada unta, bagaiman dia diciptakan menajdi makhluk yang menakjubkan? Dan kepada langit,manakala ia dic iptakan dengan kokohnya? Dan juga kepada gunung-gunung,bagaimana ia ditancapkan dengan tegak sehingga karenanya bumi menjadi tenang dan seimbang? Dan kepada bumi, bagaimana ia dibentangkan dan dihamparkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan melihat kepada langit bagaimana Allah mengangkatnya sehingga berada di atas mereka sebagai atap yang terjaga, tidak runtuh menimpa mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَإِلَى السَّمَآءِ كَيْفَ رُفِعَتْ (Dan langit, bagaimana ia ditinggikan?) Yakni ditinggikan di atas bumi tanpa tiang dengan cara yang tidak dapat dijangkau akal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Apakah mereka tidak melihat penciptaan langit, bagaimana bisa berdiri tegak tanpa penyangga, dan bisa tergantung di atasnya bintang-bintang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana langit ditinggikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-20. Allah berfirman seraya memberi dorongan pada orang-orang yang tidak percaya pada Rasulullah dan untuk orang lain agar merenungkan makhluk-makhluk Allah yang menunjukkan atas keesaanNya, “Maka apakah mereka tidak memperhatikan unta bagaimana ia diciptakan,” artinya, apakah mereka tidak memperhatikan penciptaannya yang sempurna dan bagaimanakah Allah menundukannya untuk manusia untuk berbagai kepentingan yang mereka perlukan. “Dan gunung-gunung bagaimana ia ditegakkan,” dengan bentuk yang begitu indah yang dengannya bumi bisa tenang dan kokoh tidak berguncang. Di dalamnya Allah menyimpan begitu banyak manfaat. “Dan bumi bagaimana ia dihamparkan,” yaitu dibentangkan secara luas agar manusia merasa tenang berada di atasnya dan bisa mengolahnya untuk bercocok tanam, membuat bangunan dan menempuh jalan-jalan di atasnya. Perlu diketahui, hamparan bumi tidak menafikan wujudnya yang bulat yang dilingkupi oleh berbagai bintang dari berbagai sisinya sebagaimana ditunjukkan oleh dalil akal, indera dan kesaksian dan sebagaimana diketahui oleh banyak orang, khususnya di masa sekarang di mana banyak orang mencapai berbagai penjuru jauh dengan alat-alat yang dikaruniakan Allah pada mereka yang bisa mendekatkan jarak yang jauh. Bentuk hamparan hanya menafikan bulatan sesuatu yang kecil, yang seandainya dibentangkan tidak lagi berbentuk bulat. Lain halnya dengan bentuk bumi ini yang amat besar dan luas. Sehingga bentuk bumi ini adalah bulat terhampar. Kedua hal tersebut tidak saling menafikan satu sama lain sebagaimana hal itu diketahui oleh para ahlinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِلَى السَّمَاءِ } Dan kepada langit yang tujuh { كَيْفَ رُفِعَتْ } bagaimana ia diangkat dan diangkat dengan kokohnya, tujuh lapis langit Allah ﷻ menjadikannya sebagai atap bagi bumi tanpa ada tiang sebagai penyangganya, maha besar Allah ﷻ dengan segala kuasa-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ \" Dan langit, bagaimana ia ditinggikan?\" Dan mencermati langit bagaimana ditinggikan dengan bintang-bintang yang ada di sana, matahari, bulan dan benda lainnya berupa tanda-tanda (kuasa Allah) yang besar yang belum jelas kebanyakannya hingga sekarang, kita tidak mengatakan bahwa tanda-tanda dilangit tersebut adalah seluruh tanda, bahkan mungkin disana ada-ada ciptaan-ciptaan Allah yang sangat besar yang tidak kita jangkau hingga saat ini, dan firman-Nya كَيْفَ رُفِعَتْ \" bagaimana langit ditinggikan?\" Maknanya: ditinggikan dengan ketinggan yang sangat tinggi seperti itu, meski begitu ia tidak ditopang oleh tiang, padahal biasanya atap-atap tidak bisa berdiri kecuali dengan tiang, tetapi atap yang besar ini (yaitu langit) dapat berdiri tanpa adanya tiang penopang اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا \" Allah-lah Yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat,\"(QS. Ar-Ra'ad: 2)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 18: 17-20. Setelah Allah menyebutkan dua golongan yang telah lalu, Ia berkata kepada orang-orang yang mendustakan yang mereka menganggap mustahil dapat dihidupkan kembali tulang-belulang yang telah hancur berserakan serta jasad-jasad yang telah menjadi tanah. Allah berkata kepada mereka :Apakah mereka tidak melihat unta dan ia adalah makhluk yang mengherankan, maka pikirkan olehmu bagaimana Allah menciptakannya dengan sebaik-baik penciptaan dan memiliki tubuh yang besar ? Dan lihatah langit yang indah dipandang, maka pikirkan olehmu bagaimana Allah meninggikan dan membinanya ? Dan langit itu tinggi tanpa tiang dan kokoh (tanpa penyangga) apakah mereka tidak melihat ? Dan gunung yang tinggi besar ketika dilihat, maka pikirkan olehmu bagaimana bisa diletakkan dengan tepat dan kokoh tidak berguncang (berpindah) dari tempatnya ? Dan kepada bumi yang dihamparkan, maka pikirkankan bagaimana bisa terhampar untuk urusan yang membawa kebaikan (yaitu) menetap (diatasnya) dan mengambil manfaat darinya ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 18",
    "description": "Dan tidakkah pula mereka memperhatikan langit, bagaimana ditinggikan' Allah menjadikan langit sebagai atap bumi yang kukuh meski tanpa penopang. Di sana matahari, bulan, planet, dan berbagai benda langit beredar. Allah menghiasinya dengan bintang yang dapat menjadi petunjuk arah bagi para musafir. Dari langit itu pula turun hujan yang sangat bermanfaat bagi kehidupan di bumi. 19. Dan tidakkah mereka memperhatikan gunung-gunung, bagaimana ditegakkan' gunung, dengan akarnya yang menancap kukuh dan kuat di dalam perut bumi, berfungsi sebagai pasak yang menahan bumi agar tidak bergoncang dan dengan demikian bisa menjadi tempat tinggal yang nyaman (lihat pula: an-nahl/16: 15, 82)."
  }
]