[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Apakah orang orang kafir yang mendustakan itu tidak melihat kepada unta, bagaiman dia diciptakan menajdi makhluk yang menakjubkan? Dan kepada langit,manakala ia dic iptakan dengan kokohnya? Dan juga kepada gunung-gunung,bagaimana ia ditancapkan dengan tegak sehingga karenanya bumi menjadi tenang dan seimbang? Dan kepada bumi, bagaimana ia dibentangkan dan dihamparkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan melihat kepada gunung-gunung bagaimana Allah menegakkannya dan dengannya bumi menjadi stabil, tidak membuat manusia terguncang di atasya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ (Dan gunung-gunung bagaimana ia ditegakkan?) Yakni ditegakkan di atas permukaan bumi dengan kokoh, tidak bergoncang, bergeser atau lenyap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Apakah mereka juga tidak memperhatikan bagaimana gunung-gunung itu diciptakan sehingga bisa berdiri tegak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana gunung-gunung ditegakkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-20. Allah berfirman seraya memberi dorongan pada orang-orang yang tidak percaya pada Rasulullah dan untuk orang lain agar merenungkan makhluk-makhluk Allah yang menunjukkan atas keesaanNya, “Maka apakah mereka tidak memperhatikan unta bagaimana ia diciptakan,” artinya, apakah mereka tidak memperhatikan penciptaannya yang sempurna dan bagaimanakah Allah menundukannya untuk manusia untuk berbagai kepentingan yang mereka perlukan. “Dan gunung-gunung bagaimana ia ditegakkan,” dengan bentuk yang begitu indah yang dengannya bumi bisa tenang dan kokoh tidak berguncang. Di dalamnya Allah menyimpan begitu banyak manfaat. “Dan bumi bagaimana ia dihamparkan,” yaitu dibentangkan secara luas agar manusia merasa tenang berada di atasnya dan bisa mengolahnya untuk bercocok tanam, membuat bangunan dan menempuh jalan-jalan di atasnya. Perlu diketahui, hamparan bumi tidak menafikan wujudnya yang bulat yang dilingkupi oleh berbagai bintang dari berbagai sisinya sebagaimana ditunjukkan oleh dalil akal, indera dan kesaksian dan sebagaimana diketahui oleh banyak orang, khususnya di masa sekarang di mana banyak orang mencapai berbagai penjuru jauh dengan alat-alat yang dikaruniakan Allah pada mereka yang bisa mendekatkan jarak yang jauh. Bentuk hamparan hanya menafikan bulatan sesuatu yang kecil, yang seandainya dibentangkan tidak lagi berbentuk bulat. Lain halnya dengan bentuk bumi ini yang amat besar dan luas. Sehingga bentuk bumi ini adalah bulat terhampar. Kedua hal tersebut tidak saling menafikan satu sama lain sebagaimana hal itu diketahui oleh para ahlinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِلَى الْجِبَالِ } Dan kepada gunung-gunung yang Allah ﷻ telah tetapkan tempatnya dibumi, deretan gunung-gunung { كَيْفَ نُصِبَتْ } bagaimana ia didirikan diatas bumi ini, Allah ﷻ menjadikan gunung-gunung itu seagai pasak untuk bumi agar tidak tergucang dan tidak berhamburan isisnya, dan dari gunung-gunung itu manusia banyak mengambil manfaat, itulah tanda-tanda kekuasaan Allah ﷻ , dan ia juga salah satu ciptaan Allah ﷻyang paling besar"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ \" Dan gunung-gunung bagaimana ia ditegakkan?\" Gunung-gunung yang besar ini, yang membawa banyak batu-batu besar dan ia bersanding satu dengan lainnya juga berjauhan, gunugn-gunung terdiri dari bebatuan yan gbanyak dan unsur-unsur lainnya, di dalamnya terdapat barang tambang yang bermacam-macam, dia juga saling berdekatan, meski begitu anda akan dapati misalnya pada garis ini di tengah batu besar, anda dapati di dalamnya mengandung berbagai jenis tambang yang tidak di dapati pada batu di dekatnya, ini lebih diketahui oleh ahli ilmu tingkatan-tingkatan bumi (geologi) bagaimana Allah menancapkan gunung-gunung yang besar ini, Allah Jalla wa 'Alaa tancapkan dengan ketianggian seperti itu agar menjadi pasak-pasak bumi agar tidak goyang, menimpa manusia. Jika saja Allah 'Azza Wa Jalla tidak menciptakan gunung-gunung, pasti bumi akan goyang bersama dengan pengduduknya, karena bumi ini di tengah perairan, air mengelilinginya dari segala sisi, kira-kira bagaimana menurut anda tentang bola yang diletakan di tenganya air, ia akan bergerak dan goncang, dan terkadang bergulung, dan berbalik , tetapi Allah menjadikan gungung-gunung sebagai pasak yang menahan bumi layaknya pasak-pasak tenda, gunung-gunung itu sebagai pasak yang kokoh dan besar menahan yang menerpa bumi berupa badai besar yang dapat meratakan bangunan-bangunan yang didirikan oleh manusia, tetapi gunung-gunung itu goncang, tetap kokoh seandainya badai akhin datang. Bahkan di antara faedah-faedahnya: Gunung-gungung tersebut menghalangi angin-angin besar yang datang dari lautan atau dari selain lautan agar tidak menghempaskan manusia. Ini perkara yang nampak. Anda kan melihat orang-orang yang berada di lereng-lereng gunung dan di bawahnya di bumi, anda akan dapati mereka aman dari angin-angin besar yang datang dari belakang gunung. Karenanya, anda akan mendapati manfaat-manfaat pada gunung-gunung. Andai saja semua orang bersatu untuk membuat rangkaian pembangunan dalam merencanakan membuat gunung-gunung, pasti mereka tidak akan mampu melakukannya, sehebat apapun teknologi, kekuatan, kemampuan dan panjangnya waktu mereka, sesungguhnya mereka tidak akan mampu mendatangkan yang semisal dengan gungung-gunung tersebut. Sebagian peneliti mengatakan: Sungguh gunung-gunung itu menancap ke bumi sebanding dengan ketinggiannya ke langit, yaknibahwa gunung memiliki akar di dalam bumi yang kedalamannya sama dengan panjang tingginya ke langit, ini tidak jauh, yang mana Allah memberikan kekokohan untuk gunung tersebut di bumi hingga bandingannya sesuai tingginya ke langit agar tidak digoyang oleh angin, oleh karenanya Allah 'Azza Wa Jalla berfirman: وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَأَنْهَارًا وَسُبُلًا لَعَلَّكُمْ تَهْتَدُونَ (15) وَعَلَامَاتٍ وَبِالنَّجْمِ هُمْ يَهْتَدُونَ \" Dan Dia menancapkan gunung-gunung di bumi supaya bumi itu tidak guncang bersama kamu, (dan Dia menciptakan) sungai-sungai dan jalan-jalan agar kamu mendapat petunjuk,dan (Dia ciptakan) tanda-tanda (penunjuk jalan). Dan dengan bintang-bintang itulah mereka mendapat petunjuk.\"(QS. An-Nahl: 15-16)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 19: 17-20. Setelah Allah menyebutkan dua golongan yang telah lalu, Ia berkata kepada orang-orang yang mendustakan yang mereka menganggap mustahil dapat dihidupkan kembali tulang-belulang yang telah hancur berserakan serta jasad-jasad yang telah menjadi tanah. Allah berkata kepada mereka :Apakah mereka tidak melihat unta dan ia adalah makhluk yang mengherankan, maka pikirkan olehmu bagaimana Allah menciptakannya dengan sebaik-baik penciptaan dan memiliki tubuh yang besar ? Dan lihatah langit yang indah dipandang, maka pikirkan olehmu bagaimana Allah meninggikan dan membinanya ? Dan langit itu tinggi tanpa tiang dan kokoh (tanpa penyangga) apakah mereka tidak melihat ? Dan gunung yang tinggi besar ketika dilihat, maka pikirkan olehmu bagaimana bisa diletakkan dengan tepat dan kokoh tidak berguncang (berpindah) dari tempatnya ? Dan kepada bumi yang dihamparkan, maka pikirkankan bagaimana bisa terhampar untuk urusan yang membawa kebaikan (yaitu) menetap (diatasnya) dan mengambil manfaat darinya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan bentuknya yang besar sehingga tidak terjadi kegoncangan pada bumi. Allah Subhaanahu wa Ta'aala juga menyimpan berbagai manfaat yang besar di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 19",
    "description": "Dan tidakkah mereka memperhatikan gunung-gunung, bagaimana ditegakkan' gunung, dengan akarnya yang menancap kukuh dan kuat di dalam perut bumi, berfungsi sebagai pasak yang menahan bumi agar tidak bergoncang dan dengan demikian bisa menjadi tempat tinggal yang nyaman (lihat pula: an-nahl/16: 15, 82). 20. Dan tidakkah mereka memperhatikan bumi, bagaimana dihamparkan' di bumi itu manusia tinggal, beraktivitas, bercocok tanam, dan sebagainya. Di bumi Allah menciptakan beraneka flora, fauna, sungai, sumber air, dan lain sebagainya untuk kepentingan makhluk hidup."
  }
]