[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Apakah orang orang kafir yang mendustakan itu tidak melihat kepada unta, bagaiman dia diciptakan menajdi makhluk yang menakjubkan? Dan kepada langit,manakala ia dic iptakan dengan kokohnya? Dan juga kepada gunung-gunung,bagaimana ia ditancapkan dengan tegak sehingga karenanya bumi menjadi tenang dan seimbang? Dan kepada bumi, bagaimana ia dibentangkan dan dihamparkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan melihat kepada bumi bagaimana Allah menghamparkannya dan menjadikannya siap untuk dihuni manusia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Dan juga memperhatikan bagaimana bumi itu dihamparkan, sehingga menjadi hamparan yang baik untuk dihuni."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bagaimana bumi dihamparkan} dihamparkan dan dibentangkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-20. Allah berfirman seraya memberi dorongan pada orang-orang yang tidak percaya pada Rasulullah dan untuk orang lain agar merenungkan makhluk-makhluk Allah yang menunjukkan atas keesaanNya, “Maka apakah mereka tidak memperhatikan unta bagaimana ia diciptakan,” artinya, apakah mereka tidak memperhatikan penciptaannya yang sempurna dan bagaimanakah Allah menundukannya untuk manusia untuk berbagai kepentingan yang mereka perlukan. “Dan gunung-gunung bagaimana ia ditegakkan,” dengan bentuk yang begitu indah yang dengannya bumi bisa tenang dan kokoh tidak berguncang. Di dalamnya Allah menyimpan begitu banyak manfaat. “Dan bumi bagaimana ia dihamparkan,” yaitu dibentangkan secara luas agar manusia merasa tenang berada di atasnya dan bisa mengolahnya untuk bercocok tanam, membuat bangunan dan menempuh jalan-jalan di atasnya. Perlu diketahui, hamparan bumi tidak menafikan wujudnya yang bulat yang dilingkupi oleh berbagai bintang dari berbagai sisinya sebagaimana ditunjukkan oleh dalil akal, indera dan kesaksian dan sebagaimana diketahui oleh banyak orang, khususnya di masa sekarang di mana banyak orang mencapai berbagai penjuru jauh dengan alat-alat yang dikaruniakan Allah pada mereka yang bisa mendekatkan jarak yang jauh. Bentuk hamparan hanya menafikan bulatan sesuatu yang kecil, yang seandainya dibentangkan tidak lagi berbentuk bulat. Lain halnya dengan bentuk bumi ini yang amat besar dan luas. Sehingga bentuk bumi ini adalah bulat terhampar. Kedua hal tersebut tidak saling menafikan satu sama lain sebagaimana hal itu diketahui oleh para ahlinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِلَى الْأَرْضِ } Dan kepada bumi { كَيْفَ سُطِحَتْ } bagaimana ia di hamparkan dan diluaskan untuk kemaslahan ummat manusia, Allah ﷻ berfirman : { وَالْأَرْضَ مَدَدْنَاهَا وَأَلْقَيْنَا فِيهَا رَوَاسِيَ وَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ بَهِيجٍ } ( Dan Kami hamparkan bumi itu dan Kami letakkan padanya gunung-gunung yang kokoh dan Kami tumbuhkan padanya segala macam tanaman yang indah dipandang mata ) [ Qaf : 7 ] , bumi dijadikan sebagai tempat tinggal bagi manusia, juga sebagai ladang bagi mereka untuk bercocok tanam, dibumi ini mereka menanam berbagai macam sayuran dan buah-buahan serta biji-bijian, dan dibumi pula Allah ﷻ menitipkan kepada manusia begitu banyak mineral tambang, ada ada yang cair dan ada pula yang padat, semua itu hanya untuk kemaslahatan ummat manusia, dari bumi ini kita dapat mengambil berbagai macam pelajaran yang bermanfaat, Allah ﷻ berfirman : { وَفِي الْأَرْضِ آيَاتٌ لِلْمُوقِنِينَ } ( Dan di bumi itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang yakin ) [ Az Zariyat : 20 ] . Lalu apakah semua ayat-ayat kauniyah yang telah disebutkan sebelumnya muncul di alam semesta ini tanpa ada yang menciptakannya, dan tanpa ada yang mengaturnya ? Jawabannya adalah : semua yang telah disebutkan dalam surah ini ada yang menciptakannya, dialah Allah ﷻ yang mewujudkan semua makhluk di alam semesta ini, dan dia juga lah yang mengaturnya, hal ini mengisyaratkan akan keagungan dan kekuasaan Allah ﷻ, pada ayat-ayat kauniyah itu ada pelajaran dan nasehat yang sangat bermanfaat bagi manusia . Dalam surah ini Allah ﷻ menyebutkan langit, dan menyebutkan bumi, dan di surah lain Dia ﷻ menyebutkan bintang, matahari, bulan, semua itu adalah makhluk ciptaan Allah ﷻ . Para pemandu kebodohan hari ini, para pemerhati alam dan lingkungan, sebagian besar dari mereka adalah orang-orang yang tidak percaya adanya langit yang tujuh lapis itu, mereka tidak meyakini adanya ciptaan yang besar itu, mereka hanya memahami adanya tata surya yang pusatnya adalah matahari, dan bintang-bintang dan planet-planet berputar mengitarinya, dan hal ini menyalahi Al-Qur'an, karena sesunguhnya matahari adalah bagian dari bintang-bintang yang berputar di ruang angkasa, dan bintang-bintang serta planet-planet lainnya berpusat ke bumi dan berputar pada orbitnya masing-masing, dan bumi adalah pusat tata surya itu yang sesungguhnya, Allah ﷻ menyebut bumi dalam AL-Qur'an, dan juga langit, dan Allah ﷻ juga menyebut bintang-bintang, semua itu memiliki keostimewaannya masing-masing, dan itu tertulis dalam Al-Qur'an yang merupakan perkataan sang pencipta alam semesta ﷻ, maka siapakah yang mesti kita percaya ? , apakah perkataan orang-orang bodoh itu atau perkataan Tuhan pencipta alam semesta ?! Muncul perkara lain yang dipermasalhkan oleh sebagian orang, mereka mengatakan : bahwasanya bumi itu bulat, dan bahwasanya bintang-bintang yang ada di ruang angkas itu berpusat ke bumi, begitupun dengan matahari, bulan, dan planet-planet lainnya, semuanya berpusat ke bumi, sedangkan di ayat ini dikatakan : { وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ } ( Dan bumi bagaimana ia dihamparkan? ) , maka difahami bahwa apa yang mereka katakan tidak sesuai dengan makna ayat ini, dan kita dapat menyimpulkan bahwa bumi itu datar, bahkan dengan ukuran bumi ini yang sangat besar dan luas kita tidak dapat merasakan bahwa bumi ini bulat, semua ini terjadi atas kuasa Allah ﷻ . Sungguh penciptaan langit dan bumi beserta bintang-bintang yang ada disekitarnya adalah merupakan bukti dan dalil akan kuasa Allah ﷻ sang pencipta alam semesta ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah 'Azza Wa Jalla berfirman: وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ \" Dan bumi bagaimana ia dihamparkan?\" Maknanya: Perhatikanlah, bagaiamana Allah membentangkan bumi yang luas ini, menjadikannya terbentang luas agar manusia bisa hidup di atasnya dengan bercocok tanam, membangun dan hal lainnya. Bagaimana kira-kira menurut anda jika bumi bergelombang tidak terhampar, seperti pegunungan, harus mendaki dan turun, pasti akan memberatkan dan manusia tidak bisa menetap di atasnya, tetapi Allah 'Azza Wa Jalla menjadikannya terhampar membentang bagi manusia. Sebagian ulama menjadikan ayat ini sebagai dalil bahwa bumi tidaklah bulat, tetapi rata terbentang, tetapi pendalilan ini perlu ditinjau, karena di sana, banyak ayat-ayat yang menunjukkan bahwa bumi itu bulat, dan kenyataannya membuktikan bahwa bumi bulat, Allah 'Azza Wa Jalla berfirman: يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ \" Dia menutupkan malam atas siang dan menutupkan siang atas malam\"(QS. Az-Zumar: 5) Maksud takwir (menutupkan) adalah memutar, dan telah diketahui bahwa siang dan malam itu silih berganti di bumi, jika keduanya berputar (menutupi) Maka konsekuensinya adalah bumi berbentuk bulat . Allah Tabaaraka Wa Ta'ala berfirman: إِذَا السَّمَاءُ انْشَقَّتْ (1) وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ (2) وَإِذَا الْأَرْضُ مُدَّتْ (3) وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ Apabila langit terbelah, dan patuh kepada Tuhannya, dan sudah semestinya langit itu patuh, dan apabila bumi diratakan, dan memuntahkan apa yang ada di dalamnya dan menjadi kosong,\"\"(QS. Al-Insyiqaq: 1-4) Allah berfirman: وَإِذَا الْأَرْضُ مُدَّتْ \" dan apabila bumi diratakan,\" Terdapat hadits yang menyatakan bahwa itu terjadi pada hari kiamat, bumi dihamparkan seperti dibentangkannya kulit sehingga tidak ada lagi pengunungan, lembah pepohonan dan bangunan, Rabb 'Azza Wa Jalla akan menjadikannya rata, tidak akan yang menonjol dan tidak ada yang menjorok, maka firman Allah: إِذَا السَّمَاءُ انْشَقَّتْ \" Apabila langit terbelah,\" Langit tidak akan terbelah kecuali pada hari kiamat, sedangkan saat ini tidaklah terbelah, dengan demikian maka firman Allah: وَإِذَا الْأَرْضُ مُدَّتْ (3) وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ \" dan apabila bumi diratakan, dan memuntahkan apa yang ada di dalamnya dan menjadi kosong,\" Maksudnya: hari kiamat, maka bumi saat ini tidaklah rata terbentang, tetapi dia bulat, dan kenyataan yang dirasaan juga diyakini saat ini bahwa dia berbentuk bulat tidak diragukan, Buktinya adalah jika anda berjalan lurus ke depan dari sini dari mamlakah arab saudi ke arah barat, maka anda akan datang dari arah timur, anda akan mengelilingi bumi, kemudian akhirnya anda akan berhenti dititik keberangkatan anda, begitu juga sebaliknya, seandanya anda berjalan ke arah timur anda akan mendapatkan diri anda kembali ke titik dimana anda pertama berdiri dari arah barat, dengan demikian tidak diragukan lagi bahwa bumi ini berbentuk bulat. Jika ada seseorang yang mengatakan: Jika yang kamu sebutkan benar bahwa bumi bulat, maka bagaimana mungkin air di lautan bisa menetap (tidak tumpah) sedangkan bumi bulat? Kita katakan dalam menjawabnya: Sesungguhnya yang menahan langit jatuh ke bumi kecuali dengan seizinnya Dia pun menahan lautan sehingga tidak meluap membanjiri manusia kemudian menggelamkan mereka, sedangkan Allah maha kuasa atas segala sesuatu. Sebagian ulama mengatakan: وَإِذَا الْبِحَارُ سُجِّرَت (QS. At-Takwir: 6) Maknanya: Ditahan sehingga tidak meluap kepada manusia, seperti sesuatu yang diikat, yang terpenting adalah bahwa kuasa ilahi tidak mungkin kita elakkan. Kita katakan: Kuasa Allah 'Azza Wa Jalla yang telah menahan lautan ini tidak meluap ke penduduk bumi sehingga menghanyutkan mereka, meskipun bumi berbentuk bulat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 20: 17-20. Setelah Allah menyebutkan dua golongan yang telah lalu, Ia berkata kepada orang-orang yang mendustakan yang mereka menganggap mustahil dapat dihidupkan kembali tulang-belulang yang telah hancur berserakan serta jasad-jasad yang telah menjadi tanah. Allah berkata kepada mereka :Apakah mereka tidak melihat unta dan ia adalah makhluk yang mengherankan, maka pikirkan olehmu bagaimana Allah menciptakannya dengan sebaik-baik penciptaan dan memiliki tubuh yang besar ? Dan lihatah langit yang indah dipandang, maka pikirkan olehmu bagaimana Allah meninggikan dan membinanya ? Dan langit itu tinggi tanpa tiang dan kokoh (tanpa penyangga) apakah mereka tidak melihat ? Dan gunung yang tinggi besar ketika dilihat, maka pikirkan olehmu bagaimana bisa diletakkan dengan tepat dan kokoh tidak berguncang (berpindah) dari tempatnya ? Dan kepada bumi yang dihamparkan, maka pikirkankan bagaimana bisa terhampar untuk urusan yang membawa kebaikan (yaitu) menetap (diatasnya) dan mengambil manfaat darinya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga dengan keadaannya yang bulat dapat ditempati manusia, digarap tanahnya dan dibuatkan bangunan di atasnya serta dilalui jalan-jalannya untuk mencapai suatu tempat yang mereka tuju. Dari sana seharusnya mereka mengetahui akan kekuasaan Allah Subhaanahu wa Ta'aala dan keesaan-Nya. Menurut penyusun tafsir Al Jalaalain, didahulukan ‘unta’ dari yang lainnya, karena unta lebih sering mereka gunakan daripada selainnya (sehingga mudah diperhatikan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 20",
    "description": "Dan tidakkah mereka memperhatikan bumi, bagaimana dihamparkan' di bumi itu manusia tinggal, beraktivitas, bercocok tanam, dan sebagainya. Di bumi Allah menciptakan beraneka flora, fauna, sungai, sumber air, dan lain sebagainya untuk kepentingan makhluk hidup. 21. Semestinya dengan memperhatikan fenomena-fenomena itu manusia bersedia mengabdi kepada Allah. Allah meminta nabi untuk terus berdakwah meski banyak manusia yang ingkar. Maka berilah peringatan kepada mereka yang tetap ingkar meski bukti-bukti tentang kekuasaan Allah mereka saksikan setiap hari. Ingatkanlah mereka karena sesungguhnya engkau hanyalah pemberi peringatan."
  }
]