[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Nasihatilah (wahai rasul) ,orang orang yang berpaling dengan apa yang kamu diutus dengannya. Jangan bersedih karena mereka berpaling, karena kamu hanyalah pemberi nasihat bagi mereka,bukan tugasmu memaksa mereka untuk beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka nasihatilah mereka -wahai Rasul- dan takutilah mereka dengan siksa dari Allah, karena sesungguhnya engkau hanyalah pemberi peringatan. Tidak diminta darimu selain memberi peringatan kepada mereka, adapun kepastian mereka mendapatkan keimanan, itu hanya ada di tangan Allah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Allah memerintahkan Rasulullah untuk senantiasa memberi peringatan bagi kaumnya. Maka tidak layak bagimu -hai Rasulullah- berputus asa akibat keberpalingan mereka; sebab kamu hanyalah pemberi peringatan bagi mereka, kamu bukanlah orang yang harus memaksa mereka untuk memperoleh hidayah. Dan janganlah kamu merasa berat akibat kesesatan mereka, dan kamu tidak akan mempertanggung-jawabkan kebebalan mereka di atas kekafiran; kamu juga tidak dapat menciptakan keimanan dalam hari mereka; namun kewajibanmu hanya menyampaikan risalah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. فَذَكِّرْ (Maka berilah peringatan) Yakni maka berilah mereka peringatan dan pelajaran hai Muhammad. إِنَّمَآ أَنتَ مُذَكِّرٌ (karena sesungguhnya kamu hanyalah orang yang memberi peringatan) Tidak dibebankan kepadamu kecuali hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Maka peringatkanlah wahai nabi, dengan ayat-ayat-Ku yang berwujud dan ayat-ayat-Ku dari Al-quran. Juga dari berbagai nikmat-Ku dan bukti ke-Esa-an-Ku agar mereka takut. Sesungguhnya engkau hanyalah pemberi peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka berilah peringatan} berilah pelajaran {karena sesungguhnya kamu hanyalah pemberi peringatan} pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. “Maka berilah peringatan, karena sesungguhnya kamu adalah orang yang memberi peringatan,” artinya, ingatkan manusia, beri mereka nasihat, sampaikan ancaman dan berita gembira pada mereka, karena engkau diutus untuk menyeru manusia menuju Allah dan memberi peringatan pada mereka. Engkau tidak diutus untuk berkuasa atas mereka dan mewakili amal perbuatan mereka. Bila engkau telah menunaikan kewajibanmu, tidak ada celaan bagimu setelah itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ berkata kepada Rasul-Nya dengan kata perintah : { فَذَكِّرْ إِنَّمَا أَنْتَ مُذَكِّرٌ } Maka berilah peringatan wahai Muhamad, karena sesungguhnya kamu hanya sebagai pemberi peringatan, Allah ﷻ memerintahkan kepada Rasul-Nya untuk memberi peringatan kepada kaum kuffar dan musyrikin, memperigati mereka dengan nasehat yang dengannya mereka selamat dari siksaan api neraka, menjelaskan kepada mereka tentang syari'at yang Allah ﷻ tetapkan atas hamba-Nya di muka bumi, yaitu syariiat yang dapat menyelamatkan mereka dari kesengsaraan dunia dan mengutamakan kemaslahatan bagi mereka, Rasulullah dipenrintahkan untuk menyampaikan kepada ummatnya tentang risalah Allah ﷻ yang menjelaskan kewajiban mereka sebagai hamba, itulah tugas utama seorang Rasulullah sebagai pemberi peringatan, Allah ﷻ berfirman : { فَإِنْ أَعْرَضُوا فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ } ( Jika mereka berpaling maka Kami tidak mengutus kamu sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah) ) [ Asy Syura : 48 ] , Rasulullah hanya menyampaikan risalah, sedangkan urusan diterimanya risalah itu kembali kepada Allah ﷻ , hati-hati para penguasa tidak akan menerima risalah itu kecuali Allah ﷻ yang menggerakkannya, Dialah yang memberikan hati-hati itu hidayah sehingga mau menerima peringatan dari Rasulullah, dan Dia juga lah yang menyesatkan dan membutakan hati siapapun yang Dia kehendaki, tetapi hal itu tergantung bagaimana mereka menggunakan hati mereka dengan baik."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian setelah menjelaskan di antara tanda-tanda kuasa-Nya adalah empat tanda yaitu unta, langit, pegunungan dan bumi, Allah berfirman kepada Nabi-Nya shallallaahu 'alaihi wa sallam: فَذَكِّرْ \" Maka berilah peringatan\" Allah memerinhkan kepadanya agar memberikan peringatan, dan tidak disebutkan secara khusus untuk siapa peringatan itu diberikan, maksudnya: Allah tidak mengatkan berilah peringatan kepada fulan dan fulan, peringatan ini luas untuk siapa pun, karena Rasul shallallaahu 'alaihi wa sallam diutus kepada seluruh manusia. Maknanya: Berilah peringatan keaoda semua orang di setiap waktu dan di setiap tempat. Maka Nabi 'alaihissholaatu wassalaam memberikan peringatan, dan para khulafa penerusnya pun memberi peringatan pada ummatnya dalam ilmu, beramal dan berdakwah, tetapi peringatan itu apakah akan bermanfaat bagi semua manusia? Jawabannya: tidak, وَذَكِّرْ فَإِنَّ الذِّكْرَى تَنْفَعُ الْمُؤْمِنِينَ \" Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman. \"(QS. Adz-Dzariyat: 55) Ada pun selain orang yang beriman, maka peringatan adalah sebagai penegak hujjah atas dirinya tetapi tidak akan bermanfaat baginya, peringatan tidak akan bermanfaat kecuali bagi orang yang beriman. Dan kita katakan: Jika anda melihat hatimu tidak ingat dengan peringatan maka tuduhlah ia, karena Allah berfirman: وَذَكِّرْ فَإِنَّ الذِّكْرَى تَنْفَعُ الْمُؤْمِنِينَ \" Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman. \" Jika anda diberi peringatan dan anda tidak mendapati bekas dan manfaat darinya maka salahkanlah dirimu, ketahuilah bahwa pada dirimu terdapat kekurangan iman, karena kalau saja imanmu sempurna, pasti peringatan akan bermanfaat bagimu, karena peringatan pasti bermanfaat bagi orang-oran g yang beriman. إِنَّمَا أَنْتَ مُذَكِّرٌ \" karena sesungguhnya kamu hanyalah orang yang memberi peringatan.\" Maksudnya: Bahwa Muhammad 'alaihissholaatu wassalaam tidak lain hanya pemberi juga penyampai peringatan, ada pun hidayah maka itu di tangan Allah 'Azza Wa Jalla لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ \" Bukanlah kewajibanmu menjadikan mereka mendapat petunjuk, akan tetapi Allah-lah yang memberi petunjuk (memberi taufik) siapa yang dikehendaki-Nya.\" (QS. Al-Baqarah; 272) Rasulullah shallallaahu 'alaihi wa sallam telah mengingatkan dan memberi peringatan hingga ujung akhir hayatnya, sampai sampai beliau bersabda di akhir hayatnya: اَلصَّلَاةَ الصَّلاَةَ وَمَا مَلَكَتْ أَيْمَانُكُمْ \" Jagalah shalat, jagalah sholat, dan jagalah (hak-hak) budak-budak kalian\"(1) sampai-sampai beliau ucapkan di detik-detik nyawa terlepas darinya 'alaihissholatu wassalaam, Beliau telah memberikan peringatan sejak awal beliau diutus dikatakan kepada beliau: قُمْ فَأَنْذِرْ \" bangunlah, lalu berilah peringatan!\"(QS. Al-Mudatsir: 2) sampai Allah mewafatkannya, tidak pernah meninggalkan usaha memberi peringatan di setiap tempat dan di setiap waktu karena yang menimpanya berupa gangguan dari kaumnya dan dari selain kaumnya. Orang yang membaca sejarah sirah nabi mengetahui apa-apa yang menimpanya berupa gangguan dari penduduk mekah dari kaumnya yang mena mereka adalah orang-orang terdekatnya sendiri, yang mengenalnya betul, yang menjulukinya al-amin (orang yang terpercaya), mereka menjulukinya dengan julukan itu dan mereka mempercayainya, hingga mereka memutuskan dialah yang berhak menaruh hajar aswad di ka'bah, ketika mereka merobohkan ka'bah dan sampai di bagian hajar aswad, mereka berkata: Siapa yang menruh batu ini? Mereka saling berselisih antar suku-suku, setiap suku mengatakan: kamilah yang menaruh batu itu ke tempatnya, hinggga datanNabi shallallahu 'alaihi wa sallam dan mereka pun menjadikan Nabi sebagai penetukeputusan di antara mereka, beliau memerintahkan untuk menaruh batu itu di sebuah kain, lalu setiap suku memegang ujung kain sehingga mereka semua mengangkatnya, ketika mereka mengangkatnya hingga posisinya dekat dengan tempatkan, barulah beliau mengambil dengan tangannya yang mulia dan menaruhnya di tempatnya, mereka pun menjulukinya dengan sebutan al-amin. Namun setelah Allah Ta'ala memuliakannya dengan kenabian, itu berubah menjadi ejekan-ejekan. Mereka berubah mengatakan: Bahwa beliau adalah penyihir, peramal, panyair, orang gila dan pendusta, mereka mereka menuduhnya dengan berbagai cacian, Rasul 'alaihissholaatu wassalaam memberi peringatan, kewajiban beliau hanya memberi peringatan, dari sini kita mengambil kesimpulan bahwa hidayah itu di tangan Allah, tidak mungkin bagi kita memberi hidayah taufik kepada orang terdekat dengan kita إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ \" Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya,\"(QS. Al-Qashas: 56) Maka janganlah kita mengeluh jika kita sudah memberikan peringatan kepada seseorang, dan kita dapati dia menentang, membantah atau mengatakan: Aku berbuat sesuka ku atau semisalnya. (1) Dikeluarkan Ibnu Majah (2698) dari hadits Ali radhiyallaahu 'anhu, Al-Albani mengatakan dalam shahih at-targhiib (2285): Shahih lighairihi"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 21: 21-22. Setelah Allah menjelekkan urusan mereka kaum musyrikin, Allah perintahkan Nabi-Nya ﷺ agar selalu terus menerus menasihati mereka orang-orang yang tersesat dan agar membuat mereka takut kepada Allah dan adzab-Nya yang pedih. Kemudian Allah menjelaskan bahwa urusan dan tugas (Muhammad ﷺ) adalah hanya menasihati, memberikan petunjuk, dan menyampaikan risalah, dan tidak ada kewajiban baginya memaksakan kehendak atas mereka sesuai kemauannya (Muhammad ﷺ), maka engkau wahai Nabi hanyalah sebagai yang menyampaikan dan di sisi Allah lah hisabnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut penyusun tafsir Al Jalaalain, “Berilah mereka peringatan dengan (mengingatkan) nikmat-nikmat Allah dan dalil-dalil terhadap keesaan-Nya.” Syaikh As Sa’diy berkata, “Berilah peringatan kepada manusia dan nasihatilah mereka, berikan peringatan dan kabar gembira kepada mereka, karena engkau diutus untuk mengajak manusia kepada Allah dan mengingatkan mereka. Tidak diutus sebagai penguasa dan tidak sebagai orang yang diserahkan memperhatikan amal mereka. Jika engkau telah melaksanakan kewajibanmu, maka engkau tidak lagi mendapatkan celaan setelahnya. Hal ini seperti firman Allah Ta’ala, “Kami lebih mengetahui tentang apa yang mereka katakan, dan kamu sekali-kali bukanlah seorang pemaksa terhadap mereka. Maka berilah peringatan dengan Al Quran orang yang takut dengan ancaman-Ku.” (Terj. Qaaf: 45)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 21",
    "description": "Semestinya dengan memperhatikan fenomena-fenomena itu manusia bersedia mengabdi kepada Allah. Allah meminta nabi untuk terus berdakwah meski banyak manusia yang ingkar. Maka berilah peringatan kepada mereka yang tetap ingkar meski bukti-bukti tentang kekuasaan Allah mereka saksikan setiap hari. Ingatkanlah mereka karena sesungguhnya engkau hanyalah pemberi peringatan. 22. Wahai nabi, engkau bukanlah orang yang berkuasa atas mereka. Engkau tidak bisa memaksa mereka beriman, demikian juga para dai setelah dirimu, karena sesungguhnya hidayah adalah urusan Allah."
  }
]