[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Nasihatilah (wahai rasul) ,orang orang yang berpaling dengan apa yang kamu diutus dengannya. Jangan bersedih karena mereka berpaling, karena kamu hanyalah pemberi nasihat bagi mereka,bukan tugasmu memaksa mereka untuk beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Engkau bukanlah orang yang berkuasa atas mereka sehingga mampu memaksa mereka untuk beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. لَّسْتَ عَلَيْهِم بِمُصَيْطِرٍ (Kamu bukanlah orang yang berkuasa atas mereka) Sehingga kamu dapat memaksa mereka untuk beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu kebodohan bagi siapa yang menempatkan ayat ini tidak pada tempatnya, yaitu orang yang menjadikan ayat ini sebagai pegangan untuk berdalil atas kebebasan beragama diantara komunitas muslim, padahal perbedaan antara keadaan kaum musyrikin dan muslimin sangatlah jauh, maka barangsiapa yang ingkar terhadap islam setelah masuk kedalamnya, maka diminta kepadanya untuk bertobat, jika tidak bertobat, halal untuk dibunuh, dan jika hal itu tidak diberlakukan atasnya, maka setiap muslim harus mengasingkannya, dan memperlakukannya dengan perlakuan selayaknya orang yang diperangi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Engkau tidak akan bisa menentukan keimanan mereka sesuai apa yang engkau inginkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bukanlah orang yang berkuasa atas mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-22. “Maka berilah peringatan, karena sesungguhnya kamu adalah orang yang memberi peringatan,” artinya, ingatkan manusia, beri mereka nasihat, sampaikan ancaman dan berita gembira pada mereka, karena engkau diutus untuk menyeru manusia menuju Allah dan memberi peringatan pada mereka. Engkau tidak diutus untuk berkuasa atas mereka dan mewakili amal perbuatan mereka. Bila engkau telah menunaikan kewajibanmu, tidak ada celaan bagimu setelah itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yang menguasai mereka adalah Allah ﷻ , sedangkan tugas kamu wahai Muhammad hanyalah pemberi nasehat dan peringatan, itulah tugas seorang Rasul yang diutus oleh Allah ﷻ, dan Rasulullah Muhammad ﷺ telah meksanakan tugas mulia itu, beliau telah meninggalkan ummatnya dalam keadaan selamat dan dan mereka berada dijalan yang terang benderang, Rasulullah ﷺ telah menjalankan tugas itu dengan sempurna ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah ta'ala berfirman kepada Nabi-Nya: لَعَلَّكَ بَاخِعٌ نَفْسَكَ أَلَّا يَكُونُوا مُؤْمِنِينَ \" Boleh jadi kamu (Muhammad) akan membinasakan dirimu, karena mereka tidak beriman.\"(QS. Asy-Syu'ara: 3) Jangan membinasakan dirimu jika mereka neggan beriman, keimanan mereka untuk mereka dan kekufuran mereka bukan tanggunganmu, oleh kerenanya Allah berfriman: لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ \" Kamu bukanlah orang yang berkuasa atas mereka,\" maksudnya: Kamu tudak memiliki kuasa dan mengatur mereka, kuasa itu milik Allah Rabbul'aalamin, bebanmu hanyalah menyampaikan, sedangkan penguasaan mereka milik Allah 'Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 22: 21-22. Setelah Allah menjelekkan urusan mereka kaum musyrikin, Allah perintahkan Nabi-Nya ﷺ agar selalu terus menerus menasihati mereka orang-orang yang tersesat dan agar membuat mereka takut kepada Allah dan adzab-Nya yang pedih. Kemudian Allah menjelaskan bahwa urusan dan tugas (Muhammad ﷺ) adalah hanya menasihati, memberikan petunjuk, dan menyampaikan risalah, dan tidak ada kewajiban baginya memaksakan kehendak atas mereka sesuai kemauannya (Muhammad ﷺ), maka engkau wahai Nabi hanyalah sebagai yang menyampaikan dan di sisi Allah lah hisabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 22",
    "description": "Wahai nabi, engkau bukanlah orang yang berkuasa atas mereka. Engkau tidak bisa memaksa mereka beriman, demikian juga para dai setelah dirimu, karena sesungguhnya hidayah adalah urusan Allah. 23-24. Engkau tidak kuasa memberi mereka hidayah, kecuali jika ada orang yang berpaling dari ajakanmu dan memilih untuk tetap kafir kepada Allah dan hari akhir, maka Allah akan mengazabnya dengan azab yang besar dan tak tertahankan. Azab itu bukanlah bentuk kezaliman Allah karena dia telah memaparkan kepada mereka bukti-bukti eksistensi dan keesaan Allah dan kebenaran risalah nabi Muhammad, namun mereka masih ingkar dan membangkang, bahkan menantang dan menyakiti nabi."
  }
]