[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Orang yang berpaling dari peringatan dan nasihat,terus mempertahankan kekafirannya, Allah akan mengazabnya dengan azab yang berat didalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Akan tetapi orang-orang yang berpaling dari iman dan ingkar kepada Allah dan Rasul-Nya,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Dan barangsiapa yang enggan menerima peringatan dan tetap di atas kekafirannya, maka Allah akan membalasnya dengan azab berat yang lebih dari biasanya. Ini merupakan bantahan bagi orang yang mengira telah bebas dari pertanggungjawaban atas kelalaiannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِلَّا مَن تَوَلَّىٰ وَكَفَرَ (tetapi orang yang berpaling dan kafir) Yakni akan tetapi orang yang berpaling dari peringatan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23-24. Namun orang-orang yang ingkar dan membangkang terhadap ayat Al-quran, maka Allah akan mengazabnya pada hari kiamat dengan azab yang pedih, yaitu azab neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berkuasa, sehingga kamu bisa memaksa mereka untuk beriman {Akan tetapi orang yang berpaling dan ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. Firman Allah, “Tetapi orang yang berpaling dan kafir,” yaitu, tetapi orang yang berpaling dari ketaatan dan kufur terhadap Allah, “maka Allah akan mengazabnya dengan azab yang besar,” yakni yang amat sangat dahsyat dan terus menerus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kecuali siapa yang berpaling dari peringatan itu dan tetap berada dalam kekfiran, maka Allah ﷻ akan menyiksa mereka dengan azab yang paling besar, yaitu azab neraka yang sangat pedih dan sangat panas apinya, karena azab kubur adalah azab yang paling rendah derajatnya, sedangkanazab yang paling besar adalah azab akhirat, Allah ﷻ berfirman : { وَلَنُذِيقَنَّهُمْ مِنَ الْعَذَابِ الْأَدْنَىٰ } ( Dan Sesungguhnya Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) ) yakni azab kubur { دُونَ الْعَذَابِ الْأَكْبَرِ } ( sebelum azab yang lebih besar (di akhirat) ) [ Assajdah : 21 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِلَّا مَنْ تَوَلَّى وَكَفَرَ (23) فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ \" tetapi orang yang berpaling dan kafir, maka Allah akan mengazabnya dengan azab yang besar. \" Para ulama mengatakan: إِلّاَ [Illa] di sini bermakna لَكِن [Lakin] maksudnya: Bahwa istitsna (pengcualian) pada ayat ini terputus tidak tersambung, perbedaan pengecualin yang bersambung dengan yang terputus adalah bahwa yang bersambung itu terjadi ketika mustatsna (pengecualian itu) masih sejenis dengan mustastna Munhu (sesuatu yang dikecualikan), sedangkan mustatsnaa yang munqathi' (terputus) bukan dari mustatsnaa minhu.Misalnya kita coba saja jika itu muttasil, maka makna ayat tersebut adalah: Anda bukanlah yang menguasai mereka kecuali orang yang berpaling dan kafir anda dapat menguasainya. Sedangkan perkaranya tidaklah demikian, tetapi makna yang benar: Tetapi orang yang berpaling dan kafir setelah engkau beri peringatan kepadanya, maka Allah akan mengazabnya dengan azab yang besar, maka siapa saja yang berpaling dan kafir setalah disampaikan wahyu yang turun kepada Rasulullah shallallaahu 'alaihi wa sallam, maka ia akan disiksa. إِلَّا مَنْ تَوَلَّى وَكَفَرَ \" tetapi orang yang berpaling dan kafir,\" Maknanya berpaling, ia enggan mengarah kepada kebenaran, enggan menerima kebenaran dan enggan mendengarkan kebenaran, andai ia mendengarkan kebenaran dengan telinganya, ia tetap tidak mendengarnya dengan hatinya, sebagaimana Allah Ta'ala berfirman: يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَرَسُولَهُ وَلَا تَوَلَّوْا عَنْهُ وَأَنْتُمْ تَسْمَعُونَ (20) وَلَا تَكُونُوا كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لَا يَسْمَعُونَ (21) إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ \" Hai orang-orang yang beriman, taatlah kepada Allah dan Rasul-Nya, dan janganlah kamu berpaling daripada-Nya, sedang kamu mendengar (perintah-perintah-Nya), dan janganlah kamu menjadi sebagai orang-orang (munafik) yang berkata: \"Kami mendengarkan, padahal mereka tidak mendengarkan.\"(QS. Al-Anfal: 20-21) Maknanya: Mereka tidak patuh, dalam ayat tersebut Allah 'Azza Wa Jalla berfirman: إِلَّا مَنْ تَوَلَّى وَكَفَرَ \" tetapi orang yang berpaling dan kafir,\" Tawalla berarti berpaling, dan kafir maknanya: Sombong dan tidak menerimaapa-apa yang dibawa oleh Rasul 'alaissholaatu wassalaam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 23: 23-24. Ketahuilah wahai Nabi Allah barangsiapa yang berpaling dari mereka (orang-orang musyrik) dan menolak dari peringatan dan menolak kebenaran, maka Allah akan mengadzabnya dengan adzab yang besar di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari menaati atau beriman. Kepada Allah dan kitab-Nya Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 23",
    "description": "23-24. Engkau tidak kuasa memberi mereka hidayah, kecuali jika ada orang yang berpaling dari ajakanmu dan memilih untuk tetap kafir kepada Allah dan hari akhir, maka Allah akan mengazabnya dengan azab yang besar dan tak tertahankan. Azab itu bukanlah bentuk kezaliman Allah karena dia telah memaparkan kepada mereka bukti-bukti eksistensi dan keesaan Allah dan kebenaran risalah nabi Muhammad, namun mereka masih ingkar dan membangkang, bahkan menantang dan menyakiti nabi"
  }
]