[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Orang yang berpaling dari peringatan dan nasihat,terus mempertahankan kekafirannya, Allah akan mengazabnya dengan azab yang berat didalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka Allah akan menyiksa mereka pada hari Kiamat dengan siksa yang agung dengan memasukkan mereka ke dalam Neraka, kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَيُعَذِّبُهُ اللَّـهُ الْعَذَابَ الْأَكْبَر (maka Allah akan mengazabnya dengan azab yang besar) Yakni azab neraka Jahannam yang kekal."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang 'alim berkata : Allah menyebut azab orang-orang musyrik dengan azab yang lebih besar, karena mereka mendapat azab yang lebih daripada azab yang dijatuhkan kepada orang lain, mereka di dunia diazab dengan kelaparan dan kekeringan dan azab lainnya yang akan membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23-24. Namun orang-orang yang ingkar dan membangkang terhadap ayat Al-quran, maka Allah akan mengazabnya pada hari kiamat dengan azab yang pedih, yaitu azab neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "lalu Allah akan mengazabnya dengan azab yang paling besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. Firman Allah, “Tetapi orang yang berpaling dan kafir,” yaitu, tetapi orang yang berpaling dari ketaatan dan kufur terhadap Allah, “maka Allah akan mengazabnya dengan azab yang besar,” yakni yang amat sangat dahsyat dan terus menerus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka Allah ﷻ mengazab mereka dengan azab yag paling besar, mereka diazab karena pembangkangan dan kekafiran yang ada pada diri mereka, sekali-kali mereka tidak mendengar risalah yang Rasulullah ﷺ sampaikan, mereka kufur kepada Allah ﷻ . diri mereka sendirilah yang menyebabkan azab itu datang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ \" maka Allah akan mengazabnya dengan azab yang besar.\" Azab terbesar hari kiamat, di sini Allah berfirman الْعَذَابَ الْأَكْبَرَ \"azab yang terbesar\" tidak menyebutkan azab yang lebih ringan, maksudnya tidak mengatakan: Lebih basar dari seperti ini, ini menunjukkan siksa itu mencapai tingkat tertinggi dalam besar, berat dan kehinaannya. Setiap orang yang berpaling dan kafir, Allah akan mengazabnya dengan azab yang terbesar, dan di sana terdapat azab terkecil di dunia, terkadang orang yang berpaling ditimpa penyakit-penyakit di tubuhnya, atau di akalnya, di keluarganya, di hartanya, pada masyarakatnya, semua itu jika dibandingkan dengan azab neraka, itu hanyalah azab terkecil, sedangkan azab terbesar hanya terjadi pada hari kiamat,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 24: 23-24. Ketahuilah wahai Nabi Allah barangsiapa yang berpaling dari mereka (orang-orang musyrik) dan menolak dari peringatan dan menolak kebenaran, maka Allah akan mengadzabnya dengan adzab yang besar di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu azab di akhirat. Adapun azab yang kecil adalah azab di dunia seperti terbunuh dan tertawan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 24",
    "description": "23-24. Engkau tidak kuasa memberi mereka hidayah, kecuali jika ada orang yang berpaling dari ajakanmu dan memilih untuk tetap kafir kepada Allah dan hari akhir, maka Allah akan mengazabnya dengan azab yang besar dan tak tertahankan. Azab itu bukanlah bentuk kezaliman Allah karena dia telah memaparkan kepada mereka bukti-bukti eksistensi dan keesaan Allah dan kebenaran risalah nabi Muhammad, namun mereka masih ingkar dan membangkang, bahkan menantang dan menyakiti nabi. 25. Engkau tidak bisa memaksa manusia untuk beriman. Janganlah bersedih atas keingkaran mereka. Sungguh, setelah mereka mati, hanya kepada kamilah mereka kembali. Kamilah yang akan membalas dan menentukan nasib mereka di akhirat nanti."
  }
]