[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Sesungguhnya hanya kepada Kami lah tempat kembali mereka sesudah mati, kemudian tanggungan Kami lah pembalasan atas apa yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sesungguhnya hanya kepada Kami semata mereka kembali setelah kematian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Dan karena Nabi tidak dibebani untuk memaksa mereka menerima peringatan, maka Kami akan meminta pertanggungjawaban mereka ketika mereka telah kembali kepada Kami di akhirat. Siksaan mereka mungkin saja akan tertunda, namun itu bukanlah kelalaian Kami atau keselamatan mereka dari siksaan. Allah-lah yang akan memberi perhitungan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنَّ إِلَيْنَآ إِيَابَهُمْ (Sesungguhnya kepada Kami-lah kembali mereka) Yakni setelah kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25-26. Sesungguhnya, setelah mereka mati, hanya kepada Kami-lah tempat mereka kembali. Kami yang berkuasa memberi balasan atas amal mereka di padang Mahsyar. Kami akan membalas segala perbuatan mereka di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kepada Kamilah mereka kembali} kembalinya mereka setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Sesungguhnya kepada Kami-lah mereka kembali,” yakni kembali dan berkumpulnya manusia pada Hari Kiamat. “Kemudian sesungguhnya kewajiban Kami-lah menghisab mereka,” atas kebaikan dan keburukan yang mereka lakukan. Segala puji bagi Allah semata, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kepada kami lah mereka akan kembali pada hari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "oleh karenanya Allah berfirman setelahnya: إِنَّ إِلَيْنَا إِيَابَهُمْ \" Sesungguhnya kepada Kami-lah kembali mereka,\" Maknanya: kepulangan mereka, kembali kepada Allah, bagaimanapun ia berlari, maka sungguh dia pasti akan kembali kepada Rabbnya 'Azza Wa Jalla, Andai kehidupannya panjang kembali kepada Allah, oleh karenanya Allah Ta'ala berfirman: يَا أَيُّهَا الْإِنْسَانُ إِنَّكَ كَادِحٌ إِلَى رَبِّكَ كَدْحًا فَمُلَاقِيهِ \" Hai manusia, sesungguhnya kamu telah bekerja dengan sungguh-sungguh menuju Tuhanmu, maka pasti kamu akan menemui-Nya.\"(QS. Al-Insyiqaq: 6) Maka persiapkan wahai saudaraku untuk pertemuan itu, karena anda akan menemui Rabbmu, Rasulullaah shallallaahu 'alaihi wa sallam telah bersabda: مَا مِنْكُمْ إِلَّا سَيُكَلِّمُهُ رَبُّهُ لَيْسَ بَيْنَهُ وَبَيْنَه تُرْجَمَانُ \"Tidak ada seorang pun dari kalian kecuali pasti Rabbnya akan berbicara dengannya, tidak ada perantara di antara keduanya\" Secara langsung tanpa ada perantara, yang Allah berbicara dengannya pada hari kiamat, فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ، وَيَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ وَيَنْظُرُ فَلَا يَرَى إِلَّا النَّارَ تِلْقَاءَ وَجْهِهِ، فَاتَّقُوا النَّارَ وَلَوْ بِشَقِّ التَّمْرَ \" Ia melihat ke sebelah kanannya, ia tidak melihat kecuali yang telah ia perbuat, lalu ia melihat ke sebelah kirinya, ia pun tidak melihat keculai yang telah ia perbuat, lalu ia melihat kecuali neraka ada di hadapannya, maka takutilah neraka walau pun sekedar sepotong kurma\"(1) Setiap kita akan berdua-duaan dengan Rabbnya 'Azza Wa Jalla pada hari kiamat, dan menetapkan dosa-dosanya, Allah befirman: Engkau telah berbuat ini pada hari ini, sampai ia pun mentapkan dan mengakuinya, ketika ia berikrar dan mengakuinya, Allah Ta'ala berfirman: قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ \"Sungguh telah aku tutupi atas mu di dunia dan aku mengampuninya untukmu pada hari ini\"(2) Betapa banyak dosa yang Allah 'Azza Wa Jalla tutupi, betapa banyak dosa yang kita lakukan yang tidak diketahi oleh siapa pun tetapi Allah mengetahuinya, sikap kita terhadap dosa-dosa tersebut adalah kita memohon ampunan kepada Allah 'Azza Wa Jalla, dan kita memperbanyak amal-amal saleh yang dapat menghapus dosa-dosa sehingga kita bertemu Allah 'Azza Wa Jalla dalam keadaan memperoleh ridha-Nya subhaanahu Wa Ta'ala. (1) Dikeluarkan Bukhari (1413) dan Muslim (1016) dari hadits Adi Bin Hatim radhiyallaahu 'anhu. (2) Dikeluarkan Bukhari (2441) dan Muslim (2768) dari hadits Abdullah Bin Umar radhiyallaahu 'anhuma."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 25: 25-26. Kemudian Allah tutup surat ini dengan penjelasan bahwa tempat kembali mereka (hamba) pada hari kiamat adalah hanya kepada Allah saja. Dan penolakan mereka, hanya Allah saja yang akan menghisabnya dan menghukumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah mereka mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 25",
    "description": "Engkau tidak bisa memaksa manusia untuk beriman. Janganlah bersedih atas keingkaran mereka. Sungguh, setelah mereka mati, hanya kepada kamilah mereka kembali. Kamilah yang akan membalas dan menentukan nasib mereka di akhirat nanti. 26. Kemudian, sesungguhnya kamilah pula yang akan membuat perhitungan atas mereka. Kami akan memberi mereka balasan sesuai tingkat kedurhakaan mereka supaya mereka tahu bahwa kehidupan ini bukan untuk bermain-main, melainkan harus dijalani dengan serius dan bertanggung jawab."
  }
]