[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Sesungguhnya hanya kepada Kami lah tempat kembali mereka sesudah mati, kemudian tanggungan Kami lah pembalasan atas apa yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Kemudian hanya Kami semata yang memberi perhitungan atas amal perbuatan mereka, bukan hakmu maupun hak seseorang selainmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُم (kemudian sesungguhnya kewajiban Kami-lah menghisab mereka) Yakni yang melakukan perhitungan amalan mereka, kemudian Kami akan membalas amalan mereka setelah mereka dibangkitkan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25-26. Sesungguhnya, setelah mereka mati, hanya kepada Kami-lah tempat mereka kembali. Kami yang berkuasa memberi balasan atas amal mereka di padang Mahsyar. Kami akan membalas segala perbuatan mereka di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian sesungguhnya Kamilah yang menghisab mereka}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Sesungguhnya kepada Kami-lah mereka kembali,” yakni kembali dan berkumpulnya manusia pada Hari Kiamat. “Kemudian sesungguhnya kewajiban Kami-lah menghisab mereka,” atas kebaikan dan keburukan yang mereka lakukan. Segala puji bagi Allah semata, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidak ada kewajiban bagimu wahai Muhammad melainkan hanya menyampaikan nasehat dan peringatan dari Allah ﷻ , sedangkan pertanggung jawaban amal dan dosa akan kembali kepada Allah ﷻ, Allah ﷻ yang akan menghisab amalan hamba-Nya didunia, Dia akan meminta keterangan dari hamba-Nya yang taat dan yang berdusta, dan Dia ﷻ akan membalas amalan baik orang-orang bertaqwa dengan kebaikan pula, dan akan membalas keburukan dan kemasiatan yang diperbuat oleh para pelaku maksiat dengan keburukan pula, Allah ﷻ berfirman : { وَلَا يَظْلِمُ رَبُّكَ أَحَدًا } ( Dan Tuhanmu tidak menganiaya seorang juapun”. ) [ Al-Kahfi : 49 ] tidak seorang pun akan disiksa dengan dosa orang lain, dan tidak pula seseorang akan mendapatkan surga dengan kebaikan orang lain, karena Allah ﷻ menginginkan kedudukan orang baik itu bertambah, dan tidak dengan orang-orang berdosa tanpa ada kebaikan yang mereka perbuat, Dia ﷻ memperlakukan orang-orang kafir dengan seadil-adilnya, dan memperlakukan orang-orang beriman dengan sangat istimewa. Dari keistimewaan surah ini adalah mencakup banyak hal yang berkaitan dengan nasehat-nasehat dan peringatan, surah ini juga menjelas perihal tempat kembali manusia di hari kiamat kelak . Maka seharusnya setiap muslim mentadabburi surah ini dan surah-surah lainnya dalam Al-Qur'an, karena selurunya adalah perkataan Allah ﷻ, dan seluruhnya adalah pelajaran penting, Al-Qur'an juga membahas tentang hukum-hukum syari'at islam, juga mencakup berita-berita yang nyata, Al-Qur'an ini sluruhnya adalah hikmah, Al-Qur'an juga mengandung peringatan-peringatan dan nasehat, mengandung berita gembira untuk orang-orang beriman, serta ancaman bagi orang-orang kafir dan pelaku kesyirikan, inilah Al-Qur'an yang mulia, yang merupakan ucapan Tuhan seluruh alam, { لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ } ( Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji. ) [ Fussilat : 42 ] , dan tidak satupun yang bisa mengubah isi kandungan Al-Qur'an, Allah ﷻ berfirman : { إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ } ( Sesungguhnya Kami-lah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya ) [ Al-Hijr : 9 ] . Dan ilmu pengetahuan modern sekalipun tidak akan bisa berdusta untuk menjatuhkan keajaiban-keajaiban yang ada pada Al-Qur'an, akan tetapi Al-Qur'an lah yang mampu mengalahkan semua itu, dengan Al-Qur'an semua pengetahuan modern akan diketahui kebenarannya, begitupun dengan akal sehat manusia tidak akan mampu membantah kebenaran yang terkandung dalam Al-Qur'an, bahkan akal sehat akan selalu sejalan dengan aturan yang dituliskan dalam Al-ur'an, sedangkan akal yang rusak tidak akan dipandang kebenarannya. Fitrah manusia adalah sepakat dengan apapun yang dikandung oleh Al-Qur'an, dia akan selalu merasa nikmat dengan Al-Qur'an, keajaiban-keajaiban yang terkandung dalam Al-Qur'an adalah salah satu nikmat Allah ﷻ yang paling besar, dan Al-Qur'an seluruhnya adalah keajaiban. dan hanya Allah ﷻ lah pemilik semua pengetahuan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ \" kemudian sesungguhnya kewajiban Kami-lah menghisab mereka.\" Kami akan menghisabnya, Para ulama mengatakan: Cara menghisabnya bukan dengan berdebat, karena jika seorang insan didebat ia berarti akan disiksa, kalau Allah 'Azza Wa Jlla mendebatmu atas setiap hisab maka anda akan disiksa, andai anda dituntut pada sebuah nikmat dari nikmat-nikmat ini seperti penglihatan, anda tidak akan mungkin amalan apapun yang anda lakukan dapat mengimbangi nikmat pandangan, nikmat bernafas yang keluar dan masuk tanpa kesulitan dan beban sedikit pun, seorang insan berbicara dan tidur, makan dan minum, walau pun demikian, ia tidak merasakan nafas, dan tidak tahu betapa berharganya nafas kecuali setelah terkena penyakit yang menghalangi pernafasan, saat itulah baru menyadari nikmat Allah, tetapi selama dia sehat ia mengatakan: ini sesuatu yang bersifat alamiah, tetapi kalau saja dia terkena sesak nafas barulah ia sadar akan kenikmatan itu. Jika ia didebat, pasti akan di azab, sebagaiman Nabi 'alaihissholaatu wassalaam berkata kepada 'Aisyah: مَنْ نُوقِشَ الْحِسَابَ هَلَكَ \"Siapa saja yang didebat (saat hisab) akan binasa \" atau bersabda عُذِّبَ \"diazab\"(1) Namun proses hisab: ada pun orang yang beriman maka Allah Ta'ala akan bedua-duaan dengannya tidak ada seorang pun bersama mereka, mengikrarkan dosa-dosa, engkau telah berbuat ini, engkau telah berbuat ini, engkau telah berbuat ini sampai ia mengakuinya, Allah Ta'ala berfirman قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ \"Sungguh telah aku tutupi atas mu di dunia dan aku mengampuninya untukmu pada hari ini\" Ada pun orang-orang Kafir: Mereka tidak dihisab dengan hisab ini, karena mereka tidak mempunyai kebaikan yang menghapus keburukan mereka, tetapi amalan-amalam mereka itu akan dihitung, dan mereka mengikrarkannya di hadapan alam dan mereka menghitungnya, dan akan diteriakkan di hadapan khalayak ramai: ُ هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ أَلَا لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ \" Orang-orang inilah yang telah berdusta terhadap Tuhan mereka\". Ingatlah, kutukan Allah (ditimpakan) atas orang-orang yang zalim.\"(QS. Hud: 18) Kita berlindung kepada Allah dari tidak memperoleh pertolongan-Nya. Dengan demikian, selesailah pembahasan tentang surat yang agung ini, surat ini adalah salah satu dari dua surat yang nabi shallallaahu 'alaihi wa sallam membacanya di sholat-sholat berjamaah besar, Beliau senantiasa membacanya di dua sholat ied: سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى \" Sucikanlah nama Tuhanmu Yang Maha Tinggi,\" dan هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ \" Sudah datangkah kepadamu berita (tentang) hari pembalasan?\" begitu juga saat sholat jum'at (2) . terkadang juga saat sholat dua ied beliau membaca ق وَالْقُرْآنِ الْمَجِيد \" Qaaf. Demi Al Qur'an yang sangat mulia.\" dan اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ \" Telah dekat (datangnya) saat itu dan telah terbelah bulan.\"(3) dan saat jum'at membaca surat al-Jumu'ah dan al-Munafiqun(4), beliau membacanya berganti-ganti antara surat-surat tersebut. Kita memohon kepada Allah Subhaanahu Wa Ta'ala agar menjadikan kita termasuk orang-orang yang wajah-wajahnya menikmati, ridha terhadap usahanya, dan memberi kita perlindungannya di dunia dan akhirat, sesungguhnya Dia maha kuasa atas segala sesuatu. (1) dikeluarkan Muslim (2876) dari hadits Aisyah radhiyallaahu 'anha. (2) dikeluarkan Muslim (878) dari hadits Nu'man Bin Basyir radhiyallaahu 'anhuma. (3) dikeluarkan Muslim (891) dari hadits Abu Waqid al-Laitsiy radhiyallaahu 'anhu. (4) dikeluarkan Muslim (2876) dari hadits Ibnu Abbas radhiyallaahu 'anhuma."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 26: 25-26. Kemudian Allah tutup surat ini dengan penjelasan bahwa tempat kembali mereka (hamba) pada hari kiamat adalah hanya kepada Allah saja. Dan penolakan mereka, hanya Allah saja yang akan menghisabnya dan menghukumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami yang menghisab mereka atas apa yang mereka kerjakan baik atau buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 26",
    "description": "Kemudian, sesungguhnya kamilah pula yang akan membuat perhitungan atas mereka. Kami akan memberi mereka balasan sesuai tingkat kedurhakaan mereka supaya mereka tahu bahwa kehidupan ini bukan untuk bermain-main, melainkan harus dijalani dengan serius dan bertanggung jawab. 1-4. Demi fajar, yaitu awal mula terangnya bumi setelah kegelapan malam sirna. Pada waktu ini manusia memulai aktivitasnya. Di balik kemunculan fajar itu pasti ada zat yang mahaperkasa. Demi malam yang sepuluh, yaitu sepuluh hari pertama bulan zulhijah. Mereka yang beramal saleh pada hari-hari tersebut akan mendapat pahala yang sangat agung. Demi yang genap dan yang ganjil dari semua hal. Bisa juga dipahami bahwa yang genap itu adalah makhluk Allah, sedangkan yang ganjil adalah Allah. Dia maha esa dan tanpa bandingan. Allah tidak membutuhkan apa dan siapa pun, sedang makhluk sangat bergantung pada yang lain. Demi malam apabila berlalu dan digantikan siang."
  }
]