[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-7. Pada hari itu,wajah orang orang kafir terhina oleh azab, Lelah dan cape karena bekerja, Di bakar api yang bergejolak, Diberi minum dengan mata air yang panas, Penduduk neraka tidak diberi makan kecuali dari tumbuhan berduri yang merayap dibumi, ia termasuk makanan paling buruk dan jelek, Tidak menggemukkan badan pemakannya dan tidak menutupi rasa lapar dan kepayahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Tampak kepayahan dan ketegangan karena rantai yang mengikat dan borgol yang membelenggu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Orang-orang sengsara itu menampakkan keadaan yang lesu letih, akibat kesulitan yang mereka hadapi pada hari kiamat. Mereka enggan tunduk kepada Allah dan enggan berlelah-lelah di dunia dalam menjalankan ketaatan; sehingga balasan mereka pada hari kiamat adalah kehinaan dan keletihan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. عَامِلَةٌ نَّاصِبَةٌ(bekerja keras lagi kepayahan) Dahulu mereka berlelah-lelah dalam ibadah, namun mereka tidak mendapat pahala dari ibadah itu akibat kekafiran dan kesesatan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 ). Suatu ketika Khalifah Umar bin khattab melewati suatu perkumpulan yang didalamnya ada seorang rahib, kemudian beliau berhenti dan berkata kepada rahib : \"wahai rahib ini adalah pemimpin kaum muslimin\" , tatkala Umar melihat kepada sang rahib diapun menangis, dan seseorang berkata kepadanya : wahai amirul mukmini dia adalah seorang nasrani, mengapa engkau menangis atasnya ?, kemudian beliau menjawab, ya saya tahu akan hal itu, akan tetapi saya merasa kasihan kepadanya tatkala aku mengingat firman Allah : { عَامِلَةٌ نَاصِبَةٌ .تَصْلَى نَارًا حَامِيَةً . } , aku kasihan dengan kedudukan dan kerja kerasnya yang akhirnya hanya menjerumuskannya kedalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Mereka akan disiksa di neraka dengan penuh kepayahan. Mereka akan disiksa berulang-ulang dan dibelenggu di dalamnya. An nashabu: kepayahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{berusaha keras lagi kepayahan} bersungguh-sungguh lagi kelelahan dalam beramal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-7. Allah berfirman tentang sifat penghuni neraka, “banyak muka pada hari itu,” yakni pada Hari Kiamat, “tunduk terhina,” yakni karena terhina, tercela, dan nista. “bekerja keras lagi kepayahan,” yakni lelah dalam siksaan, dan diseret di atas wajahnya. Kemungkinan lain maksud firman Allah, “Banyak muka pada hari itu tunduk terhina. Bekerja keras lagi kepayahan,” adalah di dunia, karena mereka adalah ahli ibadah dan amal ketika berada di dunia, tapi karena syaratnya tidak dipenuhi, yaitu iman, maka ibadah dan amalan tersebut menjadi debu yang beterbangan (sia-sia). Meski kemungkinan maksud tersebut benar dari segi makna tapi tidak ditunjukkan oleh konteks ayat. Yang benar dan pasti adalah makna pertama karena teks tersebut di batasi dengan kata keterangan waktu, yaitu Hari KIamat, karena maksud dari ayat tersebut adalah penjelasan tentang penghuni neraka secara umum dan karena konteks ayat menjelaskan kondisi manusia pada saat diliputi oleh Hari Kiamat sehingga tidak mencakup kondisi mereka ketika berada di dunia. Firman Allah, “Memasuki api yang sangat panas (neraka),” yaitu amat panas dan meliputi mereka dari segala penjuru. “Diberi minum dengan air dari sumber yang sangat panas,” yakni benar-benar panas. Itulah minuman mereka. Dan makanan mereka, “mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.” Hal itu karena tujuan makan adalah satu dari dua hal berikut; menghilangkan lapar dan rasa sakitnya lapar atau menggemukkan badan. Sedangkan makanan neraka tersebut sama sekali tidak memiliki kedua tujuan itu. Lebih dari itu, makanan ini amat sangat pahit, berbau busuk dan menjijikkan. Kita memohon semoga Allah menganugerahkan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Diantara mereka ada juga yang { عَامِلَةٌ } bersusah payah, akan tetapi bukan pada kebenaran, pendapat lain mengatakan : diantara manusia ada yang bersusah payah untuk menghindar dari azab, mereka berusaha dengan keras melakukan amalan untuk terbebas dari siksaan, mereka berusaha untuk bertaubat akan tetapi taubat merek pada hari itu sama sekai tidak memberikan hasill dan manfaat, kesempatan mereka telah habis didunia. { نَاصِبَةٌ } Mereka pun lelah dengan azab yang ditimpakan kepada mereka, atau mereka lelah dengan amalan yang mereka dilakukan pada hari itu dan tidak memberikan manfaat bagi diri mereka, dan sesungguhnya jika amalan manusia tidak lagi bermanfaat bagi diri mereka, maka itu adalah azab, dan penghuni surga tidak akan merasakan lelah dan letih selamanya, Allah ﷻ berfirman : { لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ } ( Mereka tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan daripadanya ) [ Al-Hijr : 48 ] penghuni surga tidak akan merasakan lelah dan mereka akan kekal didalamnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "عَامِلَةٌ نَاصِبَةٌ \" bekerja keras lagi kepayahan \" Bekerja dengan pekerjaan yang melelahkan. Ulama mengatakan: di hari kiamat mereka akan dibebankan dengan meyeret rantai-rantai dan belenggu-belenggu, dan ditenggelamkan ke dalam api nereka jahanna, sebagaimana seseorang diceburkan ke dalam lumpur. Ia telah bekerja dengan lelah dari pekerjaannya yang membebaninya, karena itu adalah pekerjaan berupa siksa dan hukuman, maknanya bukanlah sebagaimana dikatakan oleh sebagian orang bahwa maksudnya adalah orang-orang kafir yang usaha di kehidupan dunianya sia-sia sedangkan mereka menyangka telah berbuat baik. Itu karena Allah di sini mengaitkannya dengan firman-Nya وُجُوهٌ يَوْمَئِذٍ Maknanya: pada hari itu datang goncangan yang dahsyat, ini tidaklah terjadi keculai pada hari kiamat, dengan demikian maka maknanya adalah yang bekerja keras, dengan pekerjaan berupa menyeret rantai-rantai, belenggu-belenggu dan diceburkan ke dalam neraka jahannam, semoga Allah melindungi kita darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 3: 1-7. Surat ini dimulai dengan keadaan-keadaan hari kiamat, Allah berkata : Apakah telah sampai padamu (wahai Nabi ﷺ) tentang kabar hari (yang di dalamnya) terdapat musibah yang besar yaitu hari kiamat, dimana semua makhluk ketakutan dengan kondisinya yang mengerikan ?. Kemudian Allah menjelaskan bahwa manusia pada hari itu terbagi menjadi dua kelompok, kelompok yang wajahnya tertunduk kebawah terhina dan ia adalah wajah orang kafir dan musyrik, karena mereka melihat akibat (amalan mereka) dengan ketakutan. Wajah orang-orang ini adalah wajah yang sudah keterlaluan dalam kesesatan, pada saat di dunia beramal dengan amalan yang buruk dan merasa tidak betah (dengan amalan yang baik). Mereka mengira bahwa mereka telah berbuat kebaikan; Dimana setan telah menjadikan indah amalan-amalan kebathilan mereka. Kemudian Allah menejelaskan bahwa pemilik wajah ini tempat kembalinya adalah neraka hamiyah yang telah disiapkan panas nyala apinya. Dan ketika mereka kehausan, mereka akan diberikan air dari mata air yang bersumer dari panas api neraka. Dan apabila mereka merasakan lapar, mereka makan dengan makanan yang namanya adalah dhari’, dan ia adalah macam dari tumbuhan berduri yang buruk yang biasa dimakan oleh binatang liar, dan makanan ini tentut membahayakan mereka dan tidak menjadikan manfaat bagi mereka, tidak juga mengenyangkan tubuh, dan tidak pula mengobati rasa lapar mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, yakni kelelahan dalam azab sambil menyeret mukanya, sedangkan mukanya diliputi oleh api. Bisa juga maksud firman Allah Ta’ala, “Pada hari itu banyak wajah yang tertunduk terhina-- (karena) bekerja keras lagi kepayahan.” Adalah di dunia, karena keadaan mereka di dunia sebagai ahli ibadah dan suka beramal, namun karena tidak ada syaratnya, yaitu iman, maka pada hari Kiamat menjadi debu yang dihambur-hamburkan. Maksud ini meskipun secara makna bisa saja, namun tidak ditunjukkan oleh siyaaqul kalaam (susunan kalimatnya), bahkan yang benar dan sudah pasti adalah maksud pertama karena dibatasi dengan zharf (keterangan waktunya), yaitu pada hari Kiamat. Di samping itu, maksud yang diinginkan di sini adalah menerangkan sifat penghuni neraka secara umum, sedangkan kemungkinan maksudnya seperti itu adalah bagian kecil dari penghuni neraka jika melihat kepada para penghuninya. Demikian juga karena kalimatnya sedang menerangkan meratanya malapetaka hari Kiamat, sehingga tidak ada pembicaraan mengenai keadaan mereka di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 3",
    "description": "Raut wajah mereka kusut seperti orang yang telah bekerja keras lagi kepayahan karena beban berat yang menimpa mereka. 4. Wajah-wajah dan tubuh-tubuh mereka akan memasuki api neraka yang sangat panas. Kadar panasnya tidak tergambarkan, jauh melebihi panas api dunia."
  }
]