[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-7. Pada hari itu,wajah orang orang kafir terhina oleh azab, Lelah dan cape karena bekerja, Di bakar api yang bergejolak, Diberi minum dengan mata air yang panas, Penduduk neraka tidak diberi makan kecuali dari tumbuhan berduri yang merayap dibumi, ia termasuk makanan paling buruk dan jelek, Tidak menggemukkan badan pemakannya dan tidak menutupi rasa lapar dan kepayahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Wajah-wajah itu masuk ke dalam Neraka yang panas, merasa tersiksa dengan panasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Mereka akan memasuki neraka yang tingkat kepanasannya jauh melebihi api yang mereka ketahui di dunia yang dapat berhenti panasnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 ). Suatu ketika Khalifah Umar bin khattab melewati suatu perkumpulan yang didalamnya ada seorang rahib, kemudian beliau berhenti dan berkata kepada rahib : \"wahai rahib ini adalah pemimpin kaum muslimin\" , tatkala Umar melihat kepada sang rahib diapun menangis, dan seseorang berkata kepadanya : wahai amirul mukmini dia adalah seorang nasrani, mengapa engkau menangis atasnya ?, kemudian beliau menjawab, ya saya tahu akan hal itu, akan tetapi saya merasa kasihan kepadanya tatkala aku mengingat firman Allah : { عَامِلَةٌ نَاصِبَةٌ .تَصْلَى نَارًا حَامِيَةً . } , aku kasihan dengan kedudukan dan kerja kerasnya yang akhirnya hanya menjerumuskannya kedalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Mereka memasuki neraka yang sangat amat panas dan diberi minum dari air yang mendidih. Al mau al aniy bermakna air yang suhunya paling tinggi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka memasuki api neraka} mereka memasukinya dan merasakan panasnya {yang sangat panas} sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-7. Allah berfirman tentang sifat penghuni neraka, “banyak muka pada hari itu,” yakni pada Hari Kiamat, “tunduk terhina,” yakni karena terhina, tercela, dan nista. “bekerja keras lagi kepayahan,” yakni lelah dalam siksaan, dan diseret di atas wajahnya. Kemungkinan lain maksud firman Allah, “Banyak muka pada hari itu tunduk terhina. Bekerja keras lagi kepayahan,” adalah di dunia, karena mereka adalah ahli ibadah dan amal ketika berada di dunia, tapi karena syaratnya tidak dipenuhi, yaitu iman, maka ibadah dan amalan tersebut menjadi debu yang beterbangan (sia-sia). Meski kemungkinan maksud tersebut benar dari segi makna tapi tidak ditunjukkan oleh konteks ayat. Yang benar dan pasti adalah makna pertama karena teks tersebut di batasi dengan kata keterangan waktu, yaitu Hari KIamat, karena maksud dari ayat tersebut adalah penjelasan tentang penghuni neraka secara umum dan karena konteks ayat menjelaskan kondisi manusia pada saat diliputi oleh Hari Kiamat sehingga tidak mencakup kondisi mereka ketika berada di dunia. Firman Allah, “Memasuki api yang sangat panas (neraka),” yaitu amat panas dan meliputi mereka dari segala penjuru. “Diberi minum dengan air dari sumber yang sangat panas,” yakni benar-benar panas. Itulah minuman mereka. Dan makanan mereka, “mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.” Hal itu karena tujuan makan adalah satu dari dua hal berikut; menghilangkan lapar dan rasa sakitnya lapar atau menggemukkan badan. Sedangkan makanan neraka tersebut sama sekali tidak memiliki kedua tujuan itu. Lebih dari itu, makanan ini amat sangat pahit, berbau busuk dan menjijikkan. Kita memohon semoga Allah menganugerahkan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ تَصْلَىٰ نَارًا } Mereka akan dibakar didalam neraka { نَارًا حَامِيَةً } pada hakikatnya jika disebutkan : siksaan api neraka, telah cukup dan difahami bahwa itu sangatlah panas, akan tetapi jika disebutkan sifat tambahan untuk neraka itu { حَامِيَةً } maka sesungguhnya maksud dari penyebutan neraka dengan sifat tambahan itu bahwasnya neraka yang dimmaksud adalah neraka yang panasnya bergejolak, panasnya melebihi sifat api itu pada umumnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "تَصْلَى نَارًا حَامِيَةً \" memasuki api yang sangat panas (neraka),\" Maknanya: memasuki neraka jahannam, neraka yang panas yang suhu panasnya lebih panas sembilan puluh sembilan kali lebih panas dari api dunia, yakni: Api dunia seluruhnya dengan segala yang ada di dalamnya itu tidak lebih panas daripada panasnya neraka jahannam, yang panasnya 99 kali lipat. Yang menunjukkanmu betapa panasnya neraka adalah bahwa panas matahari sampai kepada kita walau pun jaraknya sangat jauh, padahal sorotannya melewati suhu-suhu yang dingin, yang sangat, tetap sampai kepada kita panas yang dirasakan, terlebih saat musim panas, maka dari itu neraka suhunya sangatlah panas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 4: 1-7. Surat ini dimulai dengan keadaan-keadaan hari kiamat, Allah berkata : Apakah telah sampai padamu (wahai Nabi ﷺ) tentang kabar hari (yang di dalamnya) terdapat musibah yang besar yaitu hari kiamat, dimana semua makhluk ketakutan dengan kondisinya yang mengerikan ?. Kemudian Allah menjelaskan bahwa manusia pada hari itu terbagi menjadi dua kelompok, kelompok yang wajahnya tertunduk kebawah terhina dan ia adalah wajah orang kafir dan musyrik, karena mereka melihat akibat (amalan mereka) dengan ketakutan. Wajah orang-orang ini adalah wajah yang sudah keterlaluan dalam kesesatan, pada saat di dunia beramal dengan amalan yang buruk dan merasa tidak betah (dengan amalan yang baik). Mereka mengira bahwa mereka telah berbuat kebaikan; Dimana setan telah menjadikan indah amalan-amalan kebathilan mereka. Kemudian Allah menejelaskan bahwa pemilik wajah ini tempat kembalinya adalah neraka hamiyah yang telah disiapkan panas nyala apinya. Dan ketika mereka kehausan, mereka akan diberikan air dari mata air yang bersumer dari panas api neraka. Dan apabila mereka merasakan lapar, mereka makan dengan makanan yang namanya adalah dhari’, dan ia adalah macam dari tumbuhan berduri yang buruk yang biasa dimakan oleh binatang liar, dan makanan ini tentut membahayakan mereka dan tidak menjadikan manfaat bagi mereka, tidak juga mengenyangkan tubuh, dan tidak pula mengobati rasa lapar mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang meliputi mereka dari segala tempat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 4",
    "description": "Wajah-wajah dan tubuh-tubuh mereka akan memasuki api neraka yang sangat panas. Kadar panasnya tidak tergambarkan, jauh melebihi panas api dunia. 5. Panas api neraka membuat mereka haus. Saat itulah mereka diberi minum dengan air dari sumber mata air yang sangat panas, membuat kerongkongan dan organ pencernaan mereka lebur."
  }
]