[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-7. Pada hari itu,wajah orang orang kafir terhina oleh azab, Lelah dan cape karena bekerja, Di bakar api yang bergejolak, Diberi minum dengan mata air yang panas, Penduduk neraka tidak diberi makan kecuali dari tumbuhan berduri yang merayap dibumi, ia termasuk makanan paling buruk dan jelek, Tidak menggemukkan badan pemakannya dan tidak menutupi rasa lapar dan kepayahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Diberi minum dari air yang sangat panas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Orang-orang yang memiliki wajah yang tertunduk hina yang tersiksa dalam api neraka itu akan meminta minuman, maka minuman yang diberikan kepada mereka adalah air yang sangat panas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. تُسْقَىٰ مِنْ عَيْنٍ ءَانِيَةٍ (diberi minum (dengan air) dari sumber yang sangat panas) Yakni dari mata air yang sangat panas airnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Mereka memasuki neraka yang sangat amat panas dan diberi minum dari air yang mendidih. Al mau al aniy bermakna air yang suhunya paling tinggi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{diberi minum dari sumber mata air yang sangat panas} air yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-7. Allah berfirman tentang sifat penghuni neraka, “banyak muka pada hari itu,” yakni pada Hari Kiamat, “tunduk terhina,” yakni karena terhina, tercela, dan nista. “bekerja keras lagi kepayahan,” yakni lelah dalam siksaan, dan diseret di atas wajahnya. Kemungkinan lain maksud firman Allah, “Banyak muka pada hari itu tunduk terhina. Bekerja keras lagi kepayahan,” adalah di dunia, karena mereka adalah ahli ibadah dan amal ketika berada di dunia, tapi karena syaratnya tidak dipenuhi, yaitu iman, maka ibadah dan amalan tersebut menjadi debu yang beterbangan (sia-sia). Meski kemungkinan maksud tersebut benar dari segi makna tapi tidak ditunjukkan oleh konteks ayat. Yang benar dan pasti adalah makna pertama karena teks tersebut di batasi dengan kata keterangan waktu, yaitu Hari KIamat, karena maksud dari ayat tersebut adalah penjelasan tentang penghuni neraka secara umum dan karena konteks ayat menjelaskan kondisi manusia pada saat diliputi oleh Hari Kiamat sehingga tidak mencakup kondisi mereka ketika berada di dunia. Firman Allah, “Memasuki api yang sangat panas (neraka),” yaitu amat panas dan meliputi mereka dari segala penjuru. “Diberi minum dengan air dari sumber yang sangat panas,” yakni benar-benar panas. Itulah minuman mereka. Dan makanan mereka, “mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.” Hal itu karena tujuan makan adalah satu dari dua hal berikut; menghilangkan lapar dan rasa sakitnya lapar atau menggemukkan badan. Sedangkan makanan neraka tersebut sama sekali tidak memiliki kedua tujuan itu. Lebih dari itu, makanan ini amat sangat pahit, berbau busuk dan menjijikkan. Kita memohon semoga Allah menganugerahkan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ تُسْقَىٰ } Minuman mereka adalah { مِنْ عَيْنٍ آنِيَةٍ } dari mata air yang sangat panas, Allah ﷻ berfirman : { وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ ۚ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا } ( Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek ) [ Al-Kahfi : 29 ] mereka diberi minum dari air mendidih yang sangat panas, juga dari nanah yang busuk, Allah ﷻ berfirman : { وَيُسْقَىٰ مِنْ مَاءٍ صَدِيدٍ } ( dan dia akan diberi minuman dengan air nanah ) [ Ibrahim : 16 ] , nanah akan menjadi minuman bagi para penghuni neraka ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah menjelaskan tempat mereka, bahwa mereka berada di dalam neraka yang sanga panas, Allah menjelaskan makanan dan minuman mereka: تُسْقَى مِنْ عَيْنٍ آنِيَةٍ (5) لَيْسَ لَهُمْ طَعَامٌ إِلَّا مِنْ ضَرِيعٍ \" diberi minum (dengan air) dari sumber yang sangat panas. Mereka tiada memperoleh makanan selain dari pohon yang berduri,\" تُسْقَى مِنْ عَيْنٍ آنِيَةٍ \"Disiramkan\" Maknanya: Ke wajah mereka مِنْ عَيْنٍ آنِيَةٍ \"Dari sumber yang sangat panas\" Maknanya: Sangat panas, Ini adalah minuman mereka, walau pun begitu minuman ini tidak mudah didapatkan, atau mereka diberikan minuman ini setiap mereka merasakan kehausan, tapi minuman tersebut diberikan ketika mereka sudah merasakan kehausan dan mereka meminta bantuan, sebagaiman Allah Ta'ala berfirman: وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا \" Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek. \"(QS. Al-Kahfi: 29) Air tersebut jika didekatkan ke wajah-wajah mereka, maka akan memanggangnya, dan merontokkan dagingnya, dan jika masuk ke kerongkongannya maka akan memutusnya, Allah Azza Wa Jalla berfirman: وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُم \" dan diberi minuman dengan air yang mendidih sehingga memotong-motong ususnya? \"(QS. Muhammad: 15) mereka tidak mengambil manfaat darinya baik lahir mau pun batin, raganya tidak merasa dingin, perutnya pun tidak pernah lepas dahaga, tetapi mereka wal-'iyaadzu billaah diberi minuman seperti itu, oleh karenanya Allah befirman: تُسْقَى مِنْ عَيْنٍ آنِيَةٍ \"diberi minuman dari sumber yang sangat panas\" Jika ada orang yang berkata: Bagaimana mungkin sumber air ini dari neraka jahannam, padahal biasanya air memadamkan api? Pertama: Perkara-perkara akhirat tidak bisa dibandingkan dengan perkara-perkara dunia, seandainya pun diukur dengan perkara-perkara dunia, kita tidak akan mampu menggambarkannya akan jadi seperti apa, bukankah matahari nanti di harikiamat akan di dekatkan dengan kepala-kepala manusia, sedekat 1 mil, mil ini bisa berarti mil inci, sebanding dengan panjang setengah jari, atau mil yang berarti jarak 1,3 kilo mater atau sebagainya, meski begitu, andai saja akhirat menyerupai dunia, maka manusia bisa benar-benar terpanggang, tetapi akhirat tidaklah dibandingkan dengan dunia. Manusia pun juga akan dikumpulkan di satu tempat di hari kiamat nanti, di antara mereka ada yang ditempatkan di tempat yang sangat gelap, di antara mereka juga ada yang ditempatkan di cahaya نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ \" cahaya mereka memancar di hadapan dan di sebelah kanan mereka, \"(QS. At-Tahriim: 8) Mereka dikumpulkan di satu tempat, mereka berkeringat, di antara mereka ada yang keringatnya hingga mata kaki, di antara mereka ada yang keringatnya sampai ke dua lutut, adajuga yang sampai ke pinggang, meski begitu mereka berada di satu tempat, dengan demikian, maka kondisi-kondisi dunia tidak dapat diserupakan dengan kondisi-kondisi akhirat. Kedua: Allah Maha kuasa atas segala sesuatu, kita lihat saat ini kita dapat melihat pohon yang hijau dapat mengobarkan api, sebagaimana Allah Ta'ala berfirman: الَّذِي جَعَلَ لَكُمْ مِنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنْتُمْ مِنْهُ تُوقِدُونَ \" yaitu Tuhan yang menjadikan untukmu api dari kayu yang hijau, maka tiba-tiba kamu nyalakan (api) dari kayu itu. \"(QS. Yasin: 80) Pohon yang hijau bersifat lembab (basah), meski begitu, bila digesekkan satu sama lain, atau digesekkan dengan dengan batang kering ia akan mengeluarkan api panas yang bersifat kering, padahal pohon itu hijau dan lembab, Allah maha kuasa atas segala sesuatu. Mereka diberi menum dari sumber air yang sangat panas dari neraka. Itu tidak saling bertentangan atas kuasa Allah 'Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 5: 1-7. Surat ini dimulai dengan keadaan-keadaan hari kiamat, Allah berkata : Apakah telah sampai padamu (wahai Nabi ﷺ) tentang kabar hari (yang di dalamnya) terdapat musibah yang besar yaitu hari kiamat, dimana semua makhluk ketakutan dengan kondisinya yang mengerikan ?. Kemudian Allah menjelaskan bahwa manusia pada hari itu terbagi menjadi dua kelompok, kelompok yang wajahnya tertunduk kebawah terhina dan ia adalah wajah orang kafir dan musyrik, karena mereka melihat akibat (amalan mereka) dengan ketakutan. Wajah orang-orang ini adalah wajah yang sudah keterlaluan dalam kesesatan, pada saat di dunia beramal dengan amalan yang buruk dan merasa tidak betah (dengan amalan yang baik). Mereka mengira bahwa mereka telah berbuat kebaikan; Dimana setan telah menjadikan indah amalan-amalan kebathilan mereka. Kemudian Allah menejelaskan bahwa pemilik wajah ini tempat kembalinya adalah neraka hamiyah yang telah disiapkan panas nyala apinya. Dan ketika mereka kehausan, mereka akan diberikan air dari mata air yang bersumer dari panas api neraka. Dan apabila mereka merasakan lapar, mereka makan dengan makanan yang namanya adalah dhari’, dan ia adalah macam dari tumbuhan berduri yang buruk yang biasa dimakan oleh binatang liar, dan makanan ini tentut membahayakan mereka dan tidak menjadikan manfaat bagi mereka, tidak juga mengenyangkan tubuh, dan tidak pula mengobati rasa lapar mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat lain disebutkan, “Jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.” (Terj. Al Kahfi: 29)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 5",
    "description": "Panas api neraka membuat mereka haus. Saat itulah mereka diberi minum dengan air dari sumber mata air yang sangat panas, membuat kerongkongan dan organ pencernaan mereka lebur. 6. Tidak ada makanan bagi mereka selain dari pohon yang berduri, yang rasanya pahit, panas, menjijikkan, dan berbau tidak sedap. Para penghuni neraka itu memakannya, di samping memakan pohon zaqq'm (lihat: ad-dukh'n/44: 43) dan 'gisl'n' (lihat: al-ma''rij/70: 36)."
  }
]