[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-7. Pada hari itu,wajah orang orang kafir terhina oleh azab, Lelah dan cape karena bekerja, Di bakar api yang bergejolak, Diberi minum dengan mata air yang panas, Penduduk neraka tidak diberi makan kecuali dari tumbuhan berduri yang merayap dibumi, ia termasuk makanan paling buruk dan jelek, Tidak menggemukkan badan pemakannya dan tidak menutupi rasa lapar dan kepayahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Mereka tidak mendapatkan makanan yang bisa mereka makan selain makanan yang paling buruk dan tanaman yang sangat busuk yang bernama Syibriq, jika tanaman ini kering maka ia menjadi beracun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Mereka tidak mendapatkan makanan melainkan tanaman kering yang berduri; tanaman ini tidak dapat menggemukkan orang yang memakannya dan tidak dapat mengobati tubuh mereka dari luka bakar, tidak pula dapat menghilangkan rasa lapar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍ (Mereka tiada memperoleh makanan selain dari pohon yang berduri) Yaitu sejenis pohon berduri yang dalam bahasa orang Quraisy disebut dengan (الشبرق) jika masih basah, dan jika telah kering disebut dengan (الضريع)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Mereka tidak diberi makanan apapun kecuali makanan yang pahit, menyedihkan, dan penuh duri. Adl dlari’ bermakna makanan berduri yang kering, yang dimakan unta bila tidak ada makanan lagi. Makanan ini tidak ada manfaatnya bagi tubuh. Namun bila makanan ini basah disebut asy syabra"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada makanan bagi mereka selain dari pohon yang berduri} tanaman yang buruk, berduri dan melekat di tanah, disebut tanaman Syibriq"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-7. Allah berfirman tentang sifat penghuni neraka, “banyak muka pada hari itu,” yakni pada Hari Kiamat, “tunduk terhina,” yakni karena terhina, tercela, dan nista. “bekerja keras lagi kepayahan,” yakni lelah dalam siksaan, dan diseret di atas wajahnya. Kemungkinan lain maksud firman Allah, “Banyak muka pada hari itu tunduk terhina. Bekerja keras lagi kepayahan,” adalah di dunia, karena mereka adalah ahli ibadah dan amal ketika berada di dunia, tapi karena syaratnya tidak dipenuhi, yaitu iman, maka ibadah dan amalan tersebut menjadi debu yang beterbangan (sia-sia). Meski kemungkinan maksud tersebut benar dari segi makna tapi tidak ditunjukkan oleh konteks ayat. Yang benar dan pasti adalah makna pertama karena teks tersebut di batasi dengan kata keterangan waktu, yaitu Hari KIamat, karena maksud dari ayat tersebut adalah penjelasan tentang penghuni neraka secara umum dan karena konteks ayat menjelaskan kondisi manusia pada saat diliputi oleh Hari Kiamat sehingga tidak mencakup kondisi mereka ketika berada di dunia. Firman Allah, “Memasuki api yang sangat panas (neraka),” yaitu amat panas dan meliputi mereka dari segala penjuru. “Diberi minum dengan air dari sumber yang sangat panas,” yakni benar-benar panas. Itulah minuman mereka. Dan makanan mereka, “mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.” Hal itu karena tujuan makan adalah satu dari dua hal berikut; menghilangkan lapar dan rasa sakitnya lapar atau menggemukkan badan. Sedangkan makanan neraka tersebut sama sekali tidak memiliki kedua tujuan itu. Lebih dari itu, makanan ini amat sangat pahit, berbau busuk dan menjijikkan. Kita memohon semoga Allah menganugerahkan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ لَيْسَ لَهُمْ طَعَامٌ } Mereka tidak diberi makan { إِلَّا مِنْ ضَرِيعٍ } kecuali dari pohon yang berduri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Sedangkan makanan mereka, Allah berfirman: لَيْسَ لَهُمْ طَعَامٌ إِلَّا مِنْ ضَرِيعٍ (6) لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ \" Mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.\" Dharii', mereka mengatakan: Itu adalah pohon berduri besar, jika mongering tidak dapat diberikan ke hewan ternak, jika masih hijau maka dapat dimakan unta, kita biasa menyebutnya dengan syibriq. Penduduk neraka –wal'iyaadzu billaah- di neraka nanti tidak mendapatkan mekanan kecuali dari pohon berduri tersebut, tapi jangan anda kira pohon berduri yang berada di neraka sama seperti yang ada dunia, ia jauh berbeda, oleh karenanya Allah berfirman لَا يُسْمِنُ \" tidak menggemukkan \" secara lahirnya ia tidak memberikan manfaat kepada tubuh وَلَا يُغْنِي مِنْ جُوعٍ \" dan tidak pula menghilangkan lapar.\" Tidak bermanfaat juga secara batinnya, pohon itu tidak ada baiknya sama sekali, tidak ada kecuali duri dan berat saat ditelan, pahit, dan berbau busuk yang tidak bisa diambil manfaatnya sama sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 6: 1-7. Surat ini dimulai dengan keadaan-keadaan hari kiamat, Allah berkata : Apakah telah sampai padamu (wahai Nabi ﷺ) tentang kabar hari (yang di dalamnya) terdapat musibah yang besar yaitu hari kiamat, dimana semua makhluk ketakutan dengan kondisinya yang mengerikan ?. Kemudian Allah menjelaskan bahwa manusia pada hari itu terbagi menjadi dua kelompok, kelompok yang wajahnya tertunduk kebawah terhina dan ia adalah wajah orang kafir dan musyrik, karena mereka melihat akibat (amalan mereka) dengan ketakutan. Wajah orang-orang ini adalah wajah yang sudah keterlaluan dalam kesesatan, pada saat di dunia beramal dengan amalan yang buruk dan merasa tidak betah (dengan amalan yang baik). Mereka mengira bahwa mereka telah berbuat kebaikan; Dimana setan telah menjadikan indah amalan-amalan kebathilan mereka. Kemudian Allah menejelaskan bahwa pemilik wajah ini tempat kembalinya adalah neraka hamiyah yang telah disiapkan panas nyala apinya. Dan ketika mereka kehausan, mereka akan diberikan air dari mata air yang bersumer dari panas api neraka. Dan apabila mereka merasakan lapar, mereka makan dengan makanan yang namanya adalah dhari’, dan ia adalah macam dari tumbuhan berduri yang buruk yang biasa dimakan oleh binatang liar, dan makanan ini tentut membahayakan mereka dan tidak menjadikan manfaat bagi mereka, tidak juga mengenyangkan tubuh, dan tidak pula mengobati rasa lapar mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 6",
    "description": "Tidak ada makanan bagi mereka selain dari pohon yang berduri, yang rasanya pahit, panas, menjijikkan, dan berbau tidak sedap. Para penghuni neraka itu memakannya, di samping memakan pohon zaqq'm (lihat: ad-dukh'n/44: 43) dan 'gisl'n' (lihat: al-ma''rij/70: 36). 7. Itulah makanan yang sama sekali tidak memberi manfaat bagi pemakannya. Makanan itu tidak menggemukkan badan dan tidak pula menghilangkan rasa lapar."
  }
]