[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-7. Pada hari itu,wajah orang orang kafir terhina oleh azab, Lelah dan cape karena bekerja, Di bakar api yang bergejolak, Diberi minum dengan mata air yang panas, Penduduk neraka tidak diberi makan kecuali dari tumbuhan berduri yang merayap dibumi, ia termasuk makanan paling buruk dan jelek, Tidak menggemukkan badan pemakannya dan tidak menutupi rasa lapar dan kepayahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Tidak membuat gemuk orang yang memakannya dan tidak pula menghilangkan rasa laparnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dengan makanan itu, mereka tidak pernah kenyang dan tidak menggemukkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang tidak menggemukkan dan tidak pula menghilangkan lapar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-7. Allah berfirman tentang sifat penghuni neraka, “banyak muka pada hari itu,” yakni pada Hari Kiamat, “tunduk terhina,” yakni karena terhina, tercela, dan nista. “bekerja keras lagi kepayahan,” yakni lelah dalam siksaan, dan diseret di atas wajahnya. Kemungkinan lain maksud firman Allah, “Banyak muka pada hari itu tunduk terhina. Bekerja keras lagi kepayahan,” adalah di dunia, karena mereka adalah ahli ibadah dan amal ketika berada di dunia, tapi karena syaratnya tidak dipenuhi, yaitu iman, maka ibadah dan amalan tersebut menjadi debu yang beterbangan (sia-sia). Meski kemungkinan maksud tersebut benar dari segi makna tapi tidak ditunjukkan oleh konteks ayat. Yang benar dan pasti adalah makna pertama karena teks tersebut di batasi dengan kata keterangan waktu, yaitu Hari KIamat, karena maksud dari ayat tersebut adalah penjelasan tentang penghuni neraka secara umum dan karena konteks ayat menjelaskan kondisi manusia pada saat diliputi oleh Hari Kiamat sehingga tidak mencakup kondisi mereka ketika berada di dunia. Firman Allah, “Memasuki api yang sangat panas (neraka),” yaitu amat panas dan meliputi mereka dari segala penjuru. “Diberi minum dengan air dari sumber yang sangat panas,” yakni benar-benar panas. Itulah minuman mereka. Dan makanan mereka, “mereka tiada memperoleh makanan selain dari pohon yang berduri, yang tidak menggemukkan dan tidak pula menghilangkan lapar.” Hal itu karena tujuan makan adalah satu dari dua hal berikut; menghilangkan lapar dan rasa sakitnya lapar atau menggemukkan badan. Sedangkan makanan neraka tersebut sama sekali tidak memiliki kedua tujuan itu. Lebih dari itu, makanan ini amat sangat pahit, berbau busuk dan menjijikkan. Kita memohon semoga Allah menganugerahkan keselamatan bagi kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ لَا يُسْمِنُ } Makanan itu tidak menjadikan mereka gemuk { وَلَا يُغْنِي مِنْ جُوعٍ } dan tidak pula melindungi mereka dari bahaya, makanan yang disajikan kepada penghuni neraka tidak memberi mereka manfaat dan tidak pula melindungi mereka dari bahaya, yaitu rasa lapar, mereka memakannya tapi seakan-akan mereka tidak makan apa-apa, makanan dan minuman itu adalah azab bagi mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Telah disebutkan pada ayat sebelumnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Ghasyiyah ayat 7: 1-7. Surat ini dimulai dengan keadaan-keadaan hari kiamat, Allah berkata : Apakah telah sampai padamu (wahai Nabi ﷺ) tentang kabar hari (yang di dalamnya) terdapat musibah yang besar yaitu hari kiamat, dimana semua makhluk ketakutan dengan kondisinya yang mengerikan ?. Kemudian Allah menjelaskan bahwa manusia pada hari itu terbagi menjadi dua kelompok, kelompok yang wajahnya tertunduk kebawah terhina dan ia adalah wajah orang kafir dan musyrik, karena mereka melihat akibat (amalan mereka) dengan ketakutan. Wajah orang-orang ini adalah wajah yang sudah keterlaluan dalam kesesatan, pada saat di dunia beramal dengan amalan yang buruk dan merasa tidak betah (dengan amalan yang baik). Mereka mengira bahwa mereka telah berbuat kebaikan; Dimana setan telah menjadikan indah amalan-amalan kebathilan mereka. Kemudian Allah menejelaskan bahwa pemilik wajah ini tempat kembalinya adalah neraka hamiyah yang telah disiapkan panas nyala apinya. Dan ketika mereka kehausan, mereka akan diberikan air dari mata air yang bersumer dari panas api neraka. Dan apabila mereka merasakan lapar, mereka makan dengan makanan yang namanya adalah dhari’, dan ia adalah macam dari tumbuhan berduri yang buruk yang biasa dimakan oleh binatang liar, dan makanan ini tentut membahayakan mereka dan tidak menjadikan manfaat bagi mereka, tidak juga mengenyangkan tubuh, dan tidak pula mengobati rasa lapar mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tujuan dari makan adalah agar tercapai salah satu di antara kedua tujuan ini; menghilangkan lapar atau menggemukkan badannya dari kurus. Adapun makanan penghuni neraka, maka tidak dapat memenuhi tujuan itu, bahkan makanannya pahit, bau dan busuk, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ghasyiyah Ayat 7",
    "description": "Itulah makanan yang sama sekali tidak memberi manfaat bagi pemakannya. Makanan itu tidak menggemukkan badan dan tidak pula menghilangkan rasa lapar. 8. Di sisi lain, para penghuni surga mendapat kebahagiaan yang tiada tara. Pada hari itu banyak pula wajah yang berseri-seri penuh kebahagiaan."
  }
]