[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya, janganlah kalian memutuskan sebuah perkara mendahului Allah dan RasulNya dalam syariat agama kalian, karena dengan itu kalian terjatuh kedalam tindakan membuat bid’ah. Takutlah kalian kepada Allah dalam perkataan dan perbuatan kalian, jangan sampai menyelisihi Allah dan RasulNya. Sesungguhnya Allah Maha mendengar perkataan-perkataan kalian, Maha mengetahui niat dan perbuatan kalian. Ini merupakan peringatan kepada orang-orang beriman agar tidak melakukan bid’ah dalam agama, atau membuat syariat dalam agama yang tidak Allah izinkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai orang-orang yang beriman kepada Allah dan mengikuti apa yang disyariatkan! Janganlah kalian mendahului Allah dan Rasul-Nya dengan ucapan atau perbuatan, dan bertakwalah kepada Allah dengan menaati segala perintah-Nya dan menjauhi segala larangan-Nya. Sesungguhnya Allah Maha Mendengar segala ucapan kalian dan Maha Mengetahui segala perbuatan kalian, tidak ada sedikitpun dari perbuatan kalian yang luput dari-Nya, dan Dia akan membalas kalian karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah memberi petunjuk bagi orang-orang beriman dalam adab berbicara dengan Nabi Muhammad; Allah melarang mereka terburu-buru dalam segala hal ketika berada di hadapan beliau, dan melarang mereka memutuskan perkara agama tanpa ada perintah dari Allah dan Rasulullah, serta memerintahkan mereka untuk bertakwa kepada Allah dengan mentaati perintah dan larangan-Nya. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala keadaan dan perbuatan. Allah juga melarang mereka meninggikan suara ketika berbicara dengan Rasulullah melebihi suara beliau, dan melarang mereka mengeraskan suara ketika memanggil beliau seperti kebiasaan mereka memanggil sesama mereka sendiri, maka hendaklah mereka memanggil Rasulullah dengan cara yang sesuai dengan derajat kenabiannya, agar amalan mereka tidak terhapus sedangkan mereka tidak menyadarinya. Ibnu ‘Asyur berkata: Dengan larangan ini Allah memerintahkan untuk merendahkan suara ketika di hadapan Rasulullah, karena yang dimaksud dari larangan ini bukanlah agar mereka diam tanpa berbicara ketika di hadapannya. (at-Tahrir wa at-Tanwir 26/183)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تُقَدِّمُوا۟ بَيْنَ يَدَىِ اللهِ وَرَسُولِهِۦ ۖ (Hai orang-orang yang beriman, janganlah kamu mendahului Allah dan Rasulnya) Yakni janganlah kalian memutuskan suatu perkara tanpa menyertakan Allah dan Rasul-Nya, dan janganlah kalian terburu-buru melakukan itu sedangkan Rasulullah bersama kalian. وَاتَّقُوا۟ اللهَ ۚ (dan bertakwalah kepada Allah) Dalam setiap urusan kalian. إِنَّ اللهَ سَمِيعٌ(Sesungguhnya Allah Maha Mendengar) Segala suara. عَلِيمٌ (lagi Maha Mengetahui) Segala hal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Wahai orang-orang yang beriman dengan Allah dan rasulNya jangan memutuskan hukum untuk masalah kalian sebelum Allah dan rasulNya menentukan hukum hal itu. Takutlah kepada Allah dalam segala urusan kalian dengan mengerjakan apa yang diperintahNy dan meninggalkan apa yang dilarangNya. Sesungguhnya Allah itu Maha Mendengar ucapan-ucapan kalian dan Maha Mengetahui tindakan-tindakan kalian. Imam Bukhari dan lainnya dari Abdullah bin Zubair berkata: “Seseorang dari Bani Tamim ingin bertemu nabi SAW, lalu Abu Bakar berkata: “Perintahkanlah Al-Qa’qa’ bin Ma’bad” dan Umar berkata:”Jangan tapi perintahlah Aqra’ bin Habis”. Kemudian Abu Bakar berkata: “Kamu hanya ingin berbeda denganku”, lalu Umar berkata: “Aku tidak bermaksud berbeda denganmu” kemudian keduanya saling berdebat sampai-sampai mereka meninggikan suaranya, kemudian Allah menurunkan surah ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah mendahului Allah dan RasulNya} janganlah mendahului di depan Allah dan RasulNya dalam perkataan maupun perbuatan {dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah memerintahkan hamba-hambaNya yang beriman sesuai dengan tuntutan keimanan terhadap Allah dan RasulNya dengan menjalankan semua perintahNya dan menjauhi laranganNya serta harus berjalan di belakang perintah-perintah Allah dan mengikuti Sunnah Rasulullah dalam semua urusan mereka, agar tidak mendahului Allah dan RasulNya, tidak mengatakan sesuatu pun hingga Allah dan Rasulullah menyatakan, dan tidak memerintah apapun hingga Allah dan rasulullah memerintah. Inilah hakikat etika wajib terhadap Allah dan RasulNya dan itulah alamat kebahagiaan dan keberuntungan seorang hamba. Jika etika tersebut tidak dimiliki oleh seorang hamba, maka dia tidak akan mendapatkan kebahagiaan abadi dan kenikmatan kekal. Dalam hal ini terdapat larangan keras untuk mendahului perkataan Rasulullah sebelum beliau mengucapkan. Manakala Sunnah Rasululllah telah jelas, maka ia wajib diikuti dan harus didahulukan atas yang lainnya, tidak peduli siapa pun orangnya. Kemudian Allah memerintahkan untuk takwa secara umum, yaitu sebagaimana yang dikatakan oleh Thalq bin Habib yang berkata, “Takwa itu adalah bahwa anda mengerjakan ketaatn kepada Allah di atas dasar cahaya dari Allah dimana anda hanya berharap pahala balasan Allah, dan bahwa anda meninggalkan kemaksiatan kepada Allah berdasarkan cahaya dari Allah di mana anda takut kepada azabNya. Dan Firman Allah “Sesungguhnya Allah Maha Mendengar,” yakni, semua jenis suara dan dalam semua waktu sekalipun dalam tempat dana rah yang sama. “lagi Maha Mengetahui,” yakni apa-apa yang zahir dan apa-apa yang bersifat batin, yang telah berlalu maupun yang akan datang, yang wajib secara aqli dan juga yang mustahil dan mubah secara aqli. Dalam penyebutan dua nama Allah yang mulia ini setelah didahului dengan larangan mendahului Allah dan RasulNya, kemudian perintah untuk bertakwa kepadaNya, Allah mendorong untuk melaksanakan perintah-perintah yang baik tersebut dan juga adab-adab yang bagus, serta ancaman dari lawannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 1: Surat ini dimulai dengan petunjuk bagi orang-orang yang beriman untuk memuliakan nabi dengan sebenar-benar pemuliaan karena kedudukan beliau; di mana surat ini dimulai dengan seruan kecintaan agar mereka menjadi orang-orang yang beriman, Allah berkata: Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, janganlah kalian mengerjakan urusan yang tidak diperintahkan oleh Allah dan Rasul-Nya, yaitu dari urusan agama dan janganlah kalian mengawali urusan agama tanpa izin dari Allah, berkata Ibnu Abbas: janganlah kalian yaitu ucapan maupun perbuatan kalian mendahului ucapan Allah atau Rasul Nya beserta perbuatannya. Maka jika telah sampai suatu dalil maka wajib orang-orang mukmin tidak mendahulukan pendapat di atas pendapat Nabi. Kemudian Allah memerintahkan hambanya yang beriman untuk takut kepada Allah dalam ucapan mereka, perbuatan dan seluruh keadaan mereka; Karena Allah mendengar apa yang mereka ucapkan, mengetahui gerak-gerik mereka dari perbuatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abi Mulaikah, bahwa Abdullah bin Az Zubair memberitahukan mereka, bahwa ada rombongan orang dari Bani Tamim datang kepada Nabi shallallahu 'alaihi wa sallam, lalu Abu Bakar berkata, “Angkatlah Qa’qa’ bin Ma’bad bin Zurarah.” Lalu Umar berkata, “Bahkan, angkatlah Aqra’ bin Habis.” Abu Bakar berkata, “Engkau tidak menginginkan selain menyelisihiku.” Umar menjawab, “Aku tidak bermaksud menyelisihimu.” Maka keduanya berbantah-bantahan sampai suaranya keras, kemudian turunlah tentang hal itu ayat, “Wahai orang-orang yang beriman! Janganlah kamu mendahului Allah dan Rasulnya…dst.” Syaikh As Sa’diy menerangkan, “Ayat ini mengandung adab terhadap Allah Ta’ala dan adab terhadap Rasulullah shallallahu 'alaihi wa sallam, membesarkan Beliau, menghormatinya dan memuliakannya. Maka Allah memerintahkan hamba-hamba-Nya yang mukmin sesuatu yang menjadi konsekwensi beriman kepada Allah dan Rasul-Nya, yaitu mengikuti perintah Allah dan menjauhi larangan-Nya, dan agar mereka berjalan di belakang perintah Allah sambil mengikuti sunnah Rasulullah shallallahu 'alaihi wa sallam dalam semua urusan mereka. Demikian pula agar mereka tidak mendahului Allah dan Rasul-Nya, tidak berkata sampai Beliau berkata, dan tidak memerintahkan sampai Beliau memerintahkan. Inilah hakikat adab yang wajib terhadap Allah dan Rasul-Nya, dan ini merupakan tanda kebahagiaan seorang hamba dan keberuntungannya, dan jika hilang, maka hilanglah kebahagiaan yang abadi dan kenikmatan yang kekal. Dalam ayat ini terdapat larangan yang keras mendahulukan ucapan selain Rasul shallallahu 'alaihi wa sallam di atas ucapan Beliau. Oleh karena itu, kapan saja jelas sunnah Rasulullah shallallahu 'alaihi wa sallam, maka wajib diikuti dan didahulukan di atas yang lainnya siapa pun dia. Selanjutnya Allah memerintahkan untuk bertakwa kepada-Nya secara umum, yaitu sebagaimana yang dikatakan Thalq bin Habib (tentang takwa), “Kamu mengerjakan ketaatan kepada Allah di atas cahaya dari Allah dan kamu mengharapkan pahala Allah. Demikian pula kamu menjauhi durhaka kepada Allah di atas cahaya dari Allah sambil takut kepada siksaan Allah.” Maksudnya orang-orang mukmin tidak boleh menetapkan sesuatu hukum, sebelum ada ketetapan dari Allah dan Rasul-Nya. Yakni semua suara dengan berbagai bahasa. Baik yang tampak maupun yang tersembunyi, yang berlalu maupun yang baru, yang mesti, mustahil maupun yang mungkin. Disebutkan kedua nama ini “Samii’un ‘Aliim” setelah larangan mendahului Allah dan Rasul-Nya serta perintah bertakwa kepada-Nya adalah untuk mendorong mengerjakan perkara-perkara yang baik, adab yang indah serta menakut-nakuti agar tidak mendurhakai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 1",
    "description": "Pada permulaan surah al-hujur't ini Allah mengajarkan akhlak kepada kaum muslim ketika berhubungan dengan Allah dan rasul-Nya. Wahai orang-orang yang beriman! janganlah kamu mendahului Allah dan rasul-Nya, yakni jangan kamu tergesa-gesa dalam memutuskan suatu perkara sebelum mendapat keputusan Allah dan rasul-Nya, dan bertakwalah kepada Allah dengan melaksanakan semua perintah-Nya dan menjauhi semua larangan-Nya. Sungguh, Allah maha mendengar ucapan kamu, maha mengetahui segala gerak-gerik dan perbuatan kamu. Dalam ayat ini Allah memerintahkan kepada kaum muslim agar ja-ngan mendahului Allah dan rasul-Nya dalam menetapkan hukum keagamaan atau persoalan duniawi yang menyangkut kehidupan me-reka. Hal ini bertujuan agar keputusan mereka tidak menyalahi syariat islam sehingga menimbulkan kemurkaan Allah. 2. Ayat ini menekankan tata krama yang harus dipatuhi oleh kaum muslim ketika berbicara dengan rasulullah. Wahai orang-orang yang ber-iman! janganlah kamu meninggikan suaramu melebihi suara nabi pada saat terjadi percakapan antara kamu dengan beliau, dan janganlah kamu berkata kepadanya dengan suara keras sebagaimana kerasnya suara sebagian kamu terhadap yang lain. Janganlah kamu memanggilnya de-ngan namanya, tetapi panggilah beliau dengan panggilan yang disertai penghormatan dan pengagungan. Apabila kamu tidak berlaku hormat kepada nabi, dikhawatirkan nanti, pahala segala amalmu bisa terhapus sedangkan kamu tidak menyadari."
  }
]