[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang Mukmin itu bersaudara dalam agama, karena itu, bila mereka bertikai, maka damaikanlah di antara saudara-saudara kalian itu. Takutlah kepada Allah dalam segala urusan kalian agar kalian dirahmati olehNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya orang-orang yang beriman itu bersaudara, dan persaudaraan dalam Islam itu berkonsekuensi atas kalian -wahai orang-orang yang beirman- untuk mendamaikan antara dua saudara kalian yang sedang bertikai. Bertakwalah kepada Allah dengan mengerjakan segala perintah-Nya dan menjauhi segala l;arangan-Nya dengan harapan kalian akan dirahmati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Kemudian Allah menegaskan kembali bahwa sesama orang beriman adalah saudara seagama, maka wajib memperbaiki hubungan antar saudara. Lalu Allah memerintahkan mereka untuk bertakwa kepada-Nya dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, agar mereka dapat meraih rahmat Allah yang luas. Dalam ayat ini mengandung dorongan untuk melakukan perdamaian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ (Orang-orang beriman itu sesungguhnya bersaudara) Yakni mereka semua kembali kepada satu asal, yaitu kemanan, oleh sebab itu mereka adalah bersaudara karena berada dalam agama yang sama. فَأَصْلِحُوا۟ بَيْنَ أَخَوَيْكُمْ ۚ( Sebab itu damaikanlah (perbaikilah hubungan) antara kedua saudaramu itu) Yakni antara dua orang Islam yang saling berselisih. Begitu pula kelompok yang membelot terhadap pemimpin, mereka adalah kelompok yang zalim jika mereka membelot tanpa alasan yang benar, namun mereka tetaplah bersaudara dengan orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya orang-orang mukmin itu saling bersaudara dalam agama dan akidah. Berdamailah dengan saudara kalian saat terjadi perselisihan dan pertentangan. Bertakwalah kepada Allah saat terjadi perselisihan tentang hukum-hukumNya dan berlakulah sebagai penengah, supaya kalian dirahmati dan ditolongNya dalam menciptakan perdamaian, sebagai hasil dari ketakwaan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang mukmin itu bersaudara, maka damaikanlah kedua saudara kalian dan bertakwalah kepada Allah agar kalian dirahmati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Sesungguhnya orang-orang Mukmin adalah bersaudara.” Ini adalah perjanjian yang ditunaikan Allah di antara sesame orang-orang yang beriman. Siapa pun orangnya yang berada di belahan timur bumi ataupun barat yang beriman kepada Allah, Malaikat, kitab-kitab, rasul-rasulNya, serta beriman kepada Hari akhir, maka ia adalah saudara orang-orang yang beriman lainnya, persaudaraan yang mengharuskan orang-orang mencintainya sebagaimana mereka mencintai diri mereka sendiri serta tidak menyukai apa pun mengenainya sebagaimana diri mereka sendiri tidak suka terkena hal itu. Oleh karean itu Rosululloh bersabda memerintahkan untuk bersaudara atas dasar keimanan \"Janganlah kalian saling dengki, saling menipu, saling marah dan saling memutuskan hubungan. Dan janganlah kalian menjual sesuatu yang telah dijual kepada orang lain. Jadilah kalian hamba-hamba Allah yang bersaudara. Seorang muslim adalah saudara bagi muslim yang lainnya, (dia) tidak menzaliminya dan mengabaikannya, tidak mendustakannya dan tidak menghinanya.\" (HR. bukhori No. 6064, Muslim No. 2559) Dan hadits yag lain \"seorang mukmin bagi mukmin yang lain itu seperti bagunan yang saling menguatkan satu dan lainnya\" lalu beliau menyilangkan jari-jarinya. (HR. Bukhori No. 6026, Muslim No. 1999) Allah dan RasulNya memerintahkan untuk menunaikan hak-hak kaum Mukminin satu sama lain yang bisa mewujudkan persatuan, saling mencintai dan saling menyambung di antara mereka. Semua itu dimaksudkan untuk memperkokoh hak-hak sesame mereka. Untuk itu, jika terjadi peperangan di antara sesame kaum Mukminin yang bisa menyebabkan perpecahan hati, saling membenci serta saling membelakangi satu sama lain, maka hendaklah kaum Mukiminin lainnya mendamaikan saudara-saudaranya serta berusaha untuk melenyapkan kedengkian di antara mereka yang saling berperang. Selanjutnya Allah memerintahkan mereka untuk bertakwa secara umum serta menyebutkan kasih sayang sebagai akibat dari menunaikan ketakwaan serta hak-hak kaum Mukminin. Allah berfirman, “Supaya kamu mendapat rahmat.” Jika telah mendapatkan rahmat, maka kebaikan dunia dan akhirat pun didapat. Hal itu menunjukkan bahwa tidak menunaikan hak-hak kaum Mukminin merupakan salah satu penyebab terbesar terhalangnya rahmat. Terdapat berbagai faidah yang dipetik dari kedua ayat tersebut yang tidak terdapat dalam penjelasan di atas, yaitu: pertama, peperangan yang terjadi antara sesame kaum Mukminin menafikan persaudaraan keimanan, karena itulah berperang dengan sesame Mukmin termasuk salah satu dosa besar. Keimanan dan persaudaraan keimanan tidak hilang dengan adanya peperangan sesame Mukmin, seperti halnya dengan dosa-dosa besar lain selain syirik. Dan inilah pendapat yang dianut oleh Ahlus Sunnah wal Jamaah. Manfaat kedua, adalah wajib mendamaikan sesame Mukmin yang bertikai secara adil dan wajib memerangi pihak yang berbuat aniaya hingga mereka mau kembali pada perintah Allah. Jika mereka kembali pada selain perintah Allah seperti merujuk pada hukum yang tidak diakui oleh syariat, maka hal itu tidak diperbolehkan. Meski demikian, harta mereka tetap terjaga, karena Allah hanya menghalalkan darah mereka saja, bukan harta, pada saat mereka terus membelot."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 10: Ketahuilah wahai manusia bahwasanya orang-orang yang beriman adalah saudara di dalam agama, dan persaudaraan ini diwajibkan bagi mereka untuk mencintai saudaranya sebagaimana dia mencintai dirinya sendiri, dan membenci apa yang ada pada saudaranya sebagaimana ia membenci atas dirinya sendiri, maka jika terjadi perselisihan diantara 2 muslim dengan saling bermusuhan dan berperang; maka wajib untuk mendamaikan keduanya, dan menjadikan mereka agar takut kepada azab Allah dengan mencegahnya yaitu mentaati perintah-perintah Allah dan menjauhi larangan-larangan Allah; semoga dengan itu kalian mendapatkan rahmat Allah dan ampunan Allah serta keridhoan dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan ikatan yang Allah ikat antara kaum mukmin, yaitu apabila ada seseorang baik berada di timur maupun di barat bumi jika dia beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, para rasul-Nya dan hari Akhir serta beriman kepada qadar yang baik dan yang buruk, maka dia adalah saudaranya, dimana hal ini menghendaki untuk diberikan sesuatu yang disukainya sebagaimana ia suka mendapatkan hal itu serta tidak menyukai hal buruk menimpanya sebagaimana dirinya tidak suka mendapatkannya. Oleh karena itu, Nabi shallallahu 'alaihi wa sallam memerintahkan melaksanakan hak keimanan, Beliau bersabda: لَا تَحَاسَدُوا وَلَا تَنَاجَشُوا وَلَا تَبَاغَضُوا وَلَا تَدَابَرُوا وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ وَلَا يَحْقِرُهُ التَّقْوَى هَاهُنَا وَيُشِيرُ إِلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ دَمُهُ وَمَالُهُ وَعِرْضُهُ “Jangan kamu saling hasad, saling najsy (menipu agar barang dagangan laku), saling marah, saling membelakangi dan jangan kamu menjual barang yang sudah dijual oleh orang lain. Jadilah kamu hamba-hamba Allah yang bersaudara. Orang muslim yang satu dengan lainnya adalah bersaudara, tidak boleh dizalimi, ditelantarkan dan dihinakan. Takwa itu di sini, -Beliau berisyarat ke dadanya- 3X, “Cukuplah seseorang telah melakukan kejahatan kalau menghina saudaranya yang muslim. Setiap muslim adalah terpelihara darahnya, hartanya dan kehormatannya.” (HR. Muslim) Beliau shallallahu 'alaihi wa sallam juga bersabda: الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا “Seorang mukmin terhadap mukmin lainnya seperti bangunan, dimana yang satu dengan yang lain saling menguatkan.” (HR. Bukhari dan Muslim) Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk menegakkan hak-hak kaum mukmin yang satu dengan yang lain dan memerintahkan sesuatu yang dengannya dapat terwujud rasa cinta dan persatuan, di antaranya adalah apabila terjadi peperangan di antara mereka yang dapat menimbulkan perpecahan dan kebencian, maka hendaknya kaum mukmin mendamaikannya dan berusaha melakukan sesuatu yang dapat menghilangkan kebencian di antara mereka. Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan untuk bertakwa secara umum serta menerangkan hasil dari memenuhi hak kaum mukmin dan bertakwa kepada Allah, yaitu mendapatkan rahmat sebagaimana firman-Nya di akhir ayat. Apabila telah tercapai rahmat, maka akan tercapai kebaikan dunia dan akhirat. Ayat ini juga menunjukkan, bahwa tidak memenuhi hak kaum mukmin merupakan penghalang besar mendapatkan rahmat. Kedua ayat di atas (ayat 9 dan 10) terdapat beberapa faedah selain yang telah disebutkan di atas, yaitu: - Berperang antara kaum mukmin bertentangan dengan ukhuwwah (persaudaraan) seiman. Oleh karena itu, hal tersebut termasuk dosa yang besar. - Iman dan persaudaraan seiman tidaklah hilang meskipun terjadi peperangan sebagaimana jika terjadi dosa-dosa besar yang lain di bawah syirk. - Wajibnya mendamaikan kaum mukmin yang bertengkar dengan adil. - Wajibnya memerangi pemberontak agar mereka kembali kepada perintah Allah. - Harta mereka adalah ma’shum (terpelihara), karena Allah hanyalah membolehkan darah mereka ketika berlangsungnya sikap zalim mereka saja, dan tidak harta mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 10",
    "description": "Ayat yang lalu menjelaskan perlunya melakukan perdamaian antara dua kelompok orang mukmin yang berperang. Hal itu perlu dilakukan sebab sesungguhnya orang-orang mukmin itu bersaudara, sebab mereka itu satu dalam keimanan, karena itu damaikanlah antara kedua saudaramu yang sedang beselisih atau bertikai satu sama lain dan bertakwalah kepada Allah dengan melaksanakan perintahnya antara lain mendamaikan kedua golongan yang saling bermusuhan itu agar kamu mendapat rahmat persudaraan dan persatuan. 11. Setelah Allah menerangkan bahwa orang-orang mukmin adalah bersaudara, ayat ini menjelaskan tuntunan agar persaudaraan itu tetap terjaga. Wahai orang-orang yang beriman! janganlah suatu kaum, yakni kelompok pria, mengolok-olok kaum, yakni kelompok pria yang lain karena boleh jadi mereka yang diperolok-olokkan lebih baik dari mereka yang mengolok-olok, dan jangan pula perempuan-perempuan mengolok-olokkan perempuan lain karena boleh jadi perempuan yang diperolok-olokkan lebih baik dari perempuan yang mengolok-olok. Janganlah kamu saling mencela satu sama lain dengan ucapan, perbuatan atau isyarat, dan janganlah saling memanggil dengan gelar-gelar yang dinilai buruk buruk oleh orang yang kamu panggil itu sehingga menyakiti hatinya. Seburuk-buruk panggilan adalah panggilan yang buruk fasik setelah iman. Yakni seburuh-buruk panggilan kepada orang-orang mukmin adalah bila mereka disebut orang-orang fasik sesudah mereka dahulu disebut sebagai golongan yang yang beriman. Dan barangsiapa tidak bertobat, setelah melakukan kefasikan, maka mereka itulah orang-orang yang zalim kepada diri sendiri dan karena perbuatannya itu maka Allah menimpakan hukuman atasnya."
  }
]