[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, janganlah orang-orang Mukmin mengejek orang-orang Mukmin lainnya, karena boleh jadi orang-orang yang diejek adalah lebih baik daripada yang mengejek. Dan janganlah wanita-wanita yang beriman mengejek janganlah wanita-wanita yang beriman lainnya, karena boleh jadi orang-orang yang diejek adalah lebih baik daripada yang mengejek. Janganlah pula sebagian dari kalian mencela sebagian lainnya, jangan pula sebagian dari kalian memanggil memanggil sebagian yang lain dengan panggilan (gelar) yang dia benci. Seburuk-buruk nama dan sifat adalah kefasikan, yaitu penghinaan, perendahan dan pemanggilan dengan gelar buruk, sesudah kalian masuk Islam dan memahaminya. Barangsiapa tidak bertaubat dari penghinaan, perendahan dan pemanggilan dengan julukan buruk, maka mereka adalah orang-orang yang menzhalimi diri mereka sendiri dengan melanggar larangan-larangan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan! Janganlah suatu kaum dari kalian menghina kaum yang lain karena bisa jadi kaum yang dihina itu lebih baik di sisi Allah, dan yang diperhitungkan adalah yang ada pada sisi Allah. Dan janganlah sekelompok wanita menghina sekelompok yang lain, karena bisa jadi kelompok yang dihina itu lebih baik di sisi Allah, dan janganlah kalian mencela saudara-saudara kalian sendiri, karena kedudukan mereka seperti kalian sendiri, serta janganlah sebagian dari kalian memanggil sebagian yang lain dengan julukan yang tidak disukainya, sebagaimana yang dilakukan oleh kaum Anṣār sebelum kedatangan Rasulullah -ṣallallāhu 'alaihi wa sallam-. Barangsiapa di antara kalian melakukannya, maka ia adalah orang fasik. Seburuk-buruk sifat adalah sifat kefasikan setelah keimanan. Barangsiapa tidak bertobat dari maksiat ini maka mereka adalah orang-orang yang menganiaya diri mereka sendiri dengan menceburkan diri mereka ke dalam sumber-sumber kehancuran disebabkan kemaksiatan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Karena penghinaan merupakan salah satu sebab yang menimbulkan pertikaian, maka Allah melarang orang-orang beriman menghina orang lain, karena bisa jadi orang yang dihina lebih baik daripada orang yang menghina. Dan janganlah seorang wanita menghina wanita lain, karena bisa jadi wanita yang dihina lebih baik daripada wanita yang menghina. Janganlah kalian saling mencela kekuarangan orang lain dan jangan saling menghina dengan memberi sebutan dan panggilan yang tidak disukai. Seburuk-buruk sebutan dan panggilan adalah yang mengandung kefasikan, yaitu sebutan dan panggilan yang dilarang agama, padahal mereka telah menjadi orang-orang yang beriman. Dan barangsiapa yang tidak bertaubat dari memberi sebutan dan panggilan buruk ini maka mereka adalah orang-orang yang jauh dari kebenaran, yang menzalimi diri mereka sendiri dengan melakukan hal-hal yang haram."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا يَسْخَرْ قَوْمٌ مِّن قَوْمٍ عَسَىٰٓ أَن يَكُونُوا۟ خَيْرًا مِّنْهُمْ (Hai orang-orang yang beriman, janganlah sekumpulan orang laki-laki merendahkan kumpulan yang lain, boleh jadi yang ditertawakan itu lebih baik dari mereka) Yakni bisa jadi orang yang diremehkan lebih baik di sisi Allah daripada orang yang meremehkan. وَلَا نِسَآءٌ مِّن نِّسَآءٍ (Dan jangan pula sekumpulan perempuan merendahkan kumpulan lainnya) Yakni dan jangan para wanita meremehkan wanita lainnya. عَسَىٰٓ أَن يَكُنَّ (boleh jadi yang direndahkan itu) Yakni wanita yang diremehkan itu. خَيْرًا مِّنْهُنَّ ۖ( lebih baik dari mereka) Yakni lebih baik daripada wanita yang meremehkan. وَلَا تَلْمِزُوٓا۟ أَنفُسَكُمْ(Dan janganlah suka mencela dirimu sendiri) Yakni janganlah kalian saling mencela dan meremehkan. وَلَا تَنَابَزُوا۟ بِالْأَلْقٰبِ ۖ( dan jangan memanggil dengan gelaran yang mengandung ejekan) Yakni janganlah kalian saling memberi julukan yang buruk yang membuat marah orang yang dijuluki tersebut. Allah melarang hal ini karena dapat menjadi sebab permusuhan; semisal memanggil seorang muslim dengan panggilan “hai fasik” atau “hai munafik”, atau memanggil orang yang baru masuk Islam “hai Yahudi” atau “hai Nasrani”, atau dengan panggilan “hai anjing”, “hai keledai”, atau “hai babi”. Terkecuali panggilan yang telah dikenal luas dan tidak membuat marah orang yang dipanggil, maka boleh menggunakan panggilan tersebut, seperti al-A’masy (orang yang sakit mata) atau al-A’raj (orang pincang), ini adalah panggilan dua orang perawi hadits. بِئْسَ الِاسْمُ الْفُسُوقُ بَعْدَ الْإِيمٰنِ ۚ( Seburuk-buruk panggilan adalah (panggilan) yang buruk sesudah iman) Yakni panggilan yang paling buruk adalah seseorang yang dipanggil kafir atau pezina setelah ia beriman atau bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Wahai orang-orang yang beriman, janganlah kelompok laki-laki kalian merendahkan yang lainnya. Bisa jadi, orang-orang yang direndahkan itu lebih baik di sisi Allah daripada orang-orang yang merendahkan. Suatu kelompok perempuan juga jangan merendahkan kelompok lainnya. Bisa jadi yang direndahkan itu lebih baik dari yang merendahkan. Janganlah kalian saling menghujat satu sama lain dengan perkataan ataupun isyarat. Janganlah juga kalian memberi julukan dengan julukan-julukan yang buruk dan tidak disukai. Seburuk-buruk penamaan seseorang adalah panggilan fasik dan kafir, sedangkan dia beriman. Barangsiapa tidak bertaubat dari apa yang dilarang oleh Allah, maka mereka adalah orang-orang yang menzalimi diri mereka sendiri dengan menyiapkannya untuk diazab. Ayat imi diturunkan untuk utusan Bani Tamim yang diingatkan dengan surah yang membahas tentang perkara mereka. Mereka mengolok-olok sahabat-sahabat yang fakir, saat melihat kondisi pakaian mereka. Ayat ini juga diturunkan bagi orang-orang beriman yang ada di antara mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah suatu kaum mengolok-olok} mengejek {kaum yang lain, boleh jadi mereka (yang diolok-olok) itu lebih baik daripada mereka (yang mengolok-olok) dan jangan pula perempuan-perempuan mengolok-olok terhadap perempuan lain, boleh jadi perempuan (yang diolok-olok) itu lebih baik daripada mereka. Janganlah saling mencela diri kalian} janganlah saling mencela satu sama lain {dan saling memanggil dengan julukan yang buruk} dan janganlah saling mengejek satu sama lain dengan julukan yang dibenci {Seburuk-buruk panggilan} penyebutan {adalah fasik setelah beriman. Siapa saja yang tidak bertaubat, mereka itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Ini juga merupakan hak-hak di antara sesame kaum Mukminin, yaitu agar “janganlah suatu kaum mengolol-olokkan kaum yang lain,” dengan perkataan, ucapan, maupun perbuatan yang menunjukkan sikap menghina sesame saudara Muslim, karena hal itu haram dan tidak diperbolehkan. Menghina menunjukkan rasa kagum pihak yang menghina terhadap dirinya sendiri yang bisa saja pihak yang dihina lebih baik dari yang menghina dan itulah yang lazim terjadi, sebab penghinaan itu hanya dilakukan oleh orang yang hatinya dipenuhi akhlak-akhlak tidak baik dan tercela, jauh dari akhlak-akhlak yang baik. Oleh karena itu Nabi bersabda \"cukuplah seorang berbuat bburuk saat dia mencela saudaranya sesame muslim\" (HR. Muslim No. 2564) Allah berfirman, “Dan janganlah kamu mencela dirimu sendiri,” artinya, janganlah kalian saling mencela. ‘allamzu’ adalah mencela dengan perkataan, sedangkan ‘alhamzu’ adalah mencela dengan perbuatan. Keduanya terlarang dan haram serta diancam akan dimasukkan ke dalam neraka bagi yang melakukannya. Sebagaimana disebutkan dalam firman Allah, \"Kecelakaanlah bagi setiap pengumpat lagi pencela,\" Al humazah:1. Seorang muslim disebut sebagai diri bagi saudaranya karena orang-orang yang beriman itu seharusnya seperti itu kondisiinya, laksana satu tubuh (satu diri), jika ada seorang Mukmin yang menghina saudaranya, maka hal itu mengharuskan yang lain untuk menghinanya juga, sehingga dialah yang menyebabkannya. “Dan janganlah kamu panggil memanggil dengan gelar-gelar yang buruk.” Artinya, janganlah salah satu dari kalian menghina saudaranya dan jangan memberinya julukan yang tidak disukai. Inilah yang disebutkan sebagai pemberian julukan yang terpuji tidak termasuk dalam ayat ini. “Seburuk-buruk panggilan ialah (panggilan) yang buruk sesudah iman.” Maksudnya, perbuatan yang paling buruk adalah merubah keimanan dan pengamalan syariat yang di antaranya mengharuskan kita untuk mengerjakan perintah dan menjauhi larangan dengan nama yang tidak baik serta berbuat durhaka yaitu disebut sebagai ‘attanaabuzu’ (saling memberikan julukan yang tidak baik). “Dan barangsiapa yang tidak bertaubat, maka mereka itulah orang-orang yang zhalim.” Inilah yang wajib dilakukan oleh setiap hamba, yaitu bertaubat kepada Allah serta membebaskan diri dari tanggungan hak saudaranya dengan cara meminta dihalalkan serta memohon ampunan dan memuji yang bersangkutan sebagai kompensasi atas celaan yang dilakukan terhadapnya. “Dan barangsiapa yang tidak bertaubat, maka mereka itulah orang-orang yang zhalim,” terdapat dua golongan manusia; zhalim terhadap dirinya tapi tidak bertaubat dan orang yang bertaubat yang mendapatkan keberuntungan. Tidak ada golongan yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 11: Wahai orang-orang yang membenarkan Allah dan rasul-Nya serta beramal dengan syariaNya, ketahuilah oleh kalian bahwasanya barangsiapa yang menetapi hak-hak orang-orang yang beriman sebagian atas sebagian yang lain: bahwasanya agar tidak merendahkan laki-laki di antara kalian dan selain laki-laki, dan tidak juga merendahkan perempuan di antara kalian, dan tidak menampakan aib sebagian atas kalian atas sebagian yang lainnya, dengan segala macamnya yang berhubungan dengan aib; sama saja apakah dengan kehadiran orang yang memiliki aib ataupun tidak hadirnya dia, dan tidak juga memanggil salah satu dari kalian dengan lafadz yang dibenci olehnya seperti penghinaan dan perendahan. Maka barangsiapa yang tidak bertaubat dari keburukan ini, maka mereka adalah orang-orang yang dzolim yaitu menzolimi diri mereka sendiri dengan melakukan yang dilarang dimana para ulama mengharamkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini juga menerangkan hak-hak kaum mukmin satu sama lain, yaitu hendaknya sebagian mereka tidak mengolok-olok, baik dengan ucapan maupun perbuatan yang menunjukkan penghinaan terhadap seorang muslim, karena yang demikian haram, dan menunjukkan bahwa orang yang mengolok-olok merasa ujub (bangga diri) dengan dirinya, padahal bisa saja yang diolok-olok itu lebih baik daripada yang mengolok-olok sebagaimana seperti itu pada umumnya dan kenyataannya. Hal itu, karena mengolok-olok tidaklah terjadi kecuali dari hati yang penuh dengan akhlak yang buruk dan tercela. Oleh karena itulah Nabi shallallahu 'alaihi wa sallam bersabda, “Cukuplah seseorang telah melakukan kejahatan kalau menghina saudaranya yang muslim.” Jangan mencela dirimu sendiri maksudnya ialah mencela antara sesama mukmin karana orang-orang mukmin seperti satu tubuh. Mencela itu bisa dengan ucapan dan bisa dengan perbuatan. Kedua-duanya adalah haram dan diancam dengan neraka sebagaimana firman Allah, “Wailul likulli humazatil lumazah.” Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada Abu Jabirah bin Adh Dhahhak ia berkata, “Ada salah seorang di antara kami yang memiliki dua nama atau tiga, lalu dipanggil dengan sebagiannya maka sepertinya ia tidak suka, sehingga turunlah ayat ini, “Dan janganlah saling memanggil dengan gelar-gelar yang buruk.” Tirmidzi berkata, “Hadits ini hasan shahih.” Yakni janganlah salah seorang di antara kamu mencela saudaranya dan menggelarinya dengan gelar yang buruk, dimana orang yang digelari itu tidak suka jika disebut dengannya. Adapun gelar yang tidak tercela, maka tidak termasuk dalam ayat ini. Panggilan yang buruk ialah gelar yang tidak disukai oleh orang yang digelari, seperti panggilan kepada orang yang sudah beriman, dengan panggilan, “Hai fasik, hai kafir” dan sebagainya. Inilah yang wajib dilakukan seorang hamba, yaitu bertobat kepada Allah Ta’ala dan keluar dari hak saudaranya, yaitu dengan meminta dihalalkan atau meminta dimaafkan, memujinya setelah mencelanya. Ayat ini menerangkan bahwa manusia ada dua golongan; yaitu orang yang berbuat zalim kepada dirinya dan orang yang bertobat, dan tidak ada yang ketiganya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 11",
    "description": "Setelah Allah menerangkan bahwa orang-orang mukmin adalah bersaudara, ayat ini menjelaskan tuntunan agar persaudaraan itu tetap terjaga. Wahai orang-orang yang beriman! janganlah suatu kaum, yakni kelompok pria, mengolok-olok kaum, yakni kelompok pria yang lain karena boleh jadi mereka yang diperolok-olokkan lebih baik dari mereka yang mengolok-olok, dan jangan pula perempuan-perempuan mengolok-olokkan perempuan lain karena boleh jadi perempuan yang diperolok-olokkan lebih baik dari perempuan yang mengolok-olok. Janganlah kamu saling mencela satu sama lain dengan ucapan, perbuatan atau isyarat, dan janganlah saling memanggil dengan gelar-gelar yang dinilai buruk buruk oleh orang yang kamu panggil itu sehingga menyakiti hatinya. Seburuk-buruk panggilan adalah panggilan yang buruk fasik setelah iman. Yakni seburuh-buruk panggilan kepada orang-orang mukmin adalah bila mereka disebut orang-orang fasik sesudah mereka dahulu disebut sebagai golongan yang yang beriman. Dan barangsiapa tidak bertobat, setelah melakukan kefasikan, maka mereka itulah orang-orang yang zalim kepada diri sendiri dan karena perbuatannya itu maka Allah menimpakan hukuman atasnya. 12. Selanjutnya Allah memberi peringatan kepada orang-orang ber-iman supaya mereka menjauhkan diri dari prasangka terhadap orang-orang yang beriman. Wahai orang-orang yang beriman! jauhilah banyak dari prasangka buruk kepada manusia yang tidak disertai bukti atau tanda-tanda, sesungguhnya sebagian prasangka, yakni prasangka yang tidak disertai bukti atau tanda-tanda itu adalah dosa dan janganlah kamu mencari-cari kesalahan orang lain yang sengaja ditutup-tutupi untuk mencemoohnya dan janganlah ada di antara kamu yang menggunjing, yakni membicarakan aib, sebagian yang lain. Apakah ada di antara kamu yang suka memakan daging saudaranya yang sudah mati' tentu kamu merasa jijik. Karena itu hindarilah pergunjingan karena itu sama de-ngan memakan daging saudara yang telah mati. Dan bertakwalah kepada Allah, sesungguhnya Allah maha penerima tobat kepada orang yang bertobat, maha penyayang kepada orang yang taat."
  }
]