[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan SyariatNya, jauhilah banyak prasangka buruk kepada orang-orang beriman, karena sesungguhnya sebagian dari dugaan tersebut adalah dosa. Jangan mencari-cari aurat (aib) kaum Muslimin. Jangan pula sebagian dari kalian berbicara tentang sebagian yang lain di belakangnya dengan sesuatu yang dia benci. Apakah seseorang di antara kalian mau makan daging saudaranya yang sudah mati? Kalian tidak menyukai itu, maka tinggalkanlah ghibah. Takutlah kalian kepada Allah dalam perintah dan laranganNya. Sesungguhnya Allah Maha Penerima taubat hamba-hambaNYa yang beriman dan Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan! Hindarilah kebanyakan dari tuduhan tanpa ada sebab-sebab dan alasan yang tepat, karena sebagian dari prasangka itu dosa seperti berburuk sangka kepada orang yang secara lahir tampak baik. Janganlah kalian mencari-cari aib orang-orang yang beriman. Janganlah salah seorang dari kalian menyebutkan tentang saudaranya dengan hal yang tidak disukainya, karena menyebutkannya dengan apa yang tidak disukainya itu seperti makan bangkai saudaranya. Sukakah salah seorang di antara kalian makan bangkai saudaranya sendiri? Maka hindarilah menggunjingnya karena hal itu semisal makan bangkai saudara sendiri. Bertakwalah kepada Allah dengan mengerjakan segala perintah-Nya dan menjauhi segala larangan-Nya, sesungguhnya Allah Maha Menerima tobat dari hamba-hamba-Nya yang bertobat kepada-Nya, Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah memperingatkan orang-orang beriman dari prasangka buruk terhadap sesama mukmin, jauhilah perbuatan itu, karena sebagian prasangka itu akan menjerumuskan pelakunya ke dalam dosa. Dan Allah melarang mereka untuk tidak mencari-cari aib dan keburukan sesama muslim; melarang mereka menyebutkan hal yang tidak dia sukai dari saudaranya seagama ketika dia tidak bersamanya (menggunjingnya), dan Allah memperingatkan dengan berfirman: Hai kaum muslimin, apakah salah satu dari kalian suka memakan daging saudaranya seiman yang telah meninggal?! Sebagaimana kalian tidak menyukainya, maka demikianlah kalian seharusnya tidak menyukai ghibah/menggunjingnya. Bertakwalah kepada Allah dengan mentaati perintah-Nya. Allah Maha Mengampuni dan Mengasihi hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ اجْتَنِبُوا۟ كَثِيرًا مِّنَ الظَّنِّ (Hai orang-orang yang beriman, jauhilah kebanyakan prasangka) Yaitu berprasangka buruk terhadap orang baik. Adapun terhadap orang jahat dan fasik maka kita diperbolehkan berprasangka sesuai apa yang nampak dari mereka. إِنَّ بَعْضَ الظَّنِّ إِثْمٌ ۖ( karena sebagian dari prasangka itu dosa) Yakni sebagian prasangka yang mengandung dosa ini adalah prasangka buruk terhadap orang baik. وَلَا تَجَسَّسُوا۟( Dan janganlah mencari-cari keburukan orang) Makna (التجسس) yakni mencari-cari aib dan keburukan yang tersembunyi. وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ( dan janganlah menggunjingkan satu sama lain) Yakni janganlah kalian saling membicarakan keburukan orang lain tanpa sepengetahuannya. Makna menggunjing yakni membicarakan keburukan seseorang ketika ia tidak bersama orang yang membicarakan itu, meskipun apa yang dibicarakan benar-benar ada dalam diri orang tersebut. Adapun jika apa yang dibicarakan itu tidak benar maka itu termasuk tuduhan terhadapnya. أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا(Adakah seorang diantara kamu yang suka memakan daging saudaranya yang sudah mati?) Allah mengumpamakan ghibah (menggunjing) seperti orang yang memakan bangkai orang yang sudah mati; sebab orang yang sudah mati tidak akan mengetahui bahwa dagingnya dimakan, begitu pula orang yang digunjing tidak mengetahui gunjingan tersebut, sehingga ia tidak mampu membela dirinya seperti mayat yang dimakan dagingnya. Adapun orang yang hadir dalam perbincangan bisa jadi ia mampu membela diri dari ucapan buruk yang ditujukan kepadanya. Ayat ini adalah sebagai penjauh seseorang agar tidak melakukannya. Sebab memakan daging manusia merupakan hal yang dijauhi oleh tabiat manusia yang sehat, disamping itu adalah hal haram secara syariat. فَكَرِهْتُمُوهُ ۚ( Maka tentulah kamu merasa jijik kepadanya) Yakni sebagaimana kalian tidak menyukai hal ini maka janganlah kalian menggunjingnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai orang-orang mukmin jauhilah anggapan-anggapan yang terlalu banyak, yang mana itu adalah anggapan buruk kepada orang-orang yang berbuat baik. Sesungguhnya sebagian dosa itu mengarahkan pada dosa yang pelakunya harus dihukum, yaitu anggapan buruk bagi orang-orang yang berbuat baik. Adapun orang yang berbuat keburukan dan kefasikan itu maka anggapan buruk itu diperbolehkan sebagai tanda sebagaimana yang tampak dari diri mereka. Janganlah kalian mencari-cari aib dan aurat orang lain yang seharusnya tetap tertutupi. Janganlah menggunjing satu sama lain. Gunjingan yaitu saat kamu menyebut saudaramu dengan hal yang dibenci olehnya. Apa salah satu kalian suka memakan daging saudaranya yang sudah menjadi bangkai. Sesungguhnya menggunjing itu menyerupai memakan bangkai manusia. Ini adalah gambaran perbuatan menggunjing dengan gambaran paling buruk dalam watak dan akalnya. Memakan daging manusia itu adalah sesuatu haram yang sangat kotor, hal itu serupa dengan menggunjing. Keduanya itu buruk. Bertakwalah kepada Allah dengan mengikuti perintahNya dan menjauhi laranganNya. Sesungguhnya Allah Dzat yang menerima taubat dan Maha Menyayangi hamba-hambaNya yang bertaubat. Ibnu Juraij berkata: “Mereka beranggapan bahwa ayat ini diturunkan untuk Salman Al-Farisi yang makan lalu tertidur pulas. Kemudian seorang laki-laki menyebutkan makannya dan tidurnya Salman, lalu turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jauhilah banyak berprasangka. Sesungguhnya sebagian prasangka itu dosa. Janganlah mencari-cari kesalahan orang} janganlah kalian membuaka aurat orang-orang muslim {dan janganlah ada yang menggunjing sebagian kalian kepada yang lain} dan janganlah sebagian kalian menyebutkan apa yang dibenci sebagian lainnya ketika dia tidak ada {Apakah ada di antara kalian yang suka memakan daging saudaranya yang sudah mati. Kalian pasti membenci hal itu. Bertakwalah kepada Allah. Sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah melarang banyak berprasangka tidak baik terhadap orang-orang Mukmin, karena “sesungguhnya sebagian prasangka itu adalah dosa,” seperti praduga yang jauh dari kenyataan dan tidak ada indikasinya, seperti juga prasangka buruk yang diikuti dengan perkataan dan perbuatan yang diharamkan. Prasangka buruk yang tetap berada di hati seseorang tidak hanya cukup sampai disitu saja bagi yang bersangkutan, bahkan akan mendorongnya untuk mengatakan yang tidak seharusnya dan mengerjakan yang tidak sepatutnya yang di dalam hal itu juga tercakup berburuk sangka, membenci dan memusuhi saudara sesame Mukmin yang seharusnya tidak demikian. “Dan janganlah kamu mencari-cari kesalahan orang lain,” yakni, janganlah kalian mengorek kesalahan kaum Muslimin dan jangan mencari-carinya, biarkan orang Muslim tetap berada pada kondisinya sendiri dan gunakanlah cara melalaikan kekeliruannya yang jika dikuak akan Nampak sesuatu yang tidak sepatutnya. “Dan janganlah sebagian kamu menggunjing sebagian yang lain,” Ghibah itu sebagaimana sabda Nabi adalah \"engkau menyebutkan saudaramu tentang sesuatu yang dia tidak sukai walaupun hal tersebut benar-benar terjadi\" HR. Muslim No. 2589 Selanjutnya Allah menyebutkan perumpamaan agar kita menjauhi ghibah seraya berfirman, “Sukakah salah seorang di antara kamu memakan daging saudaranya yang sudah mati. Maka tentulah kamu merasa jijik kepadanya.” Ghibah itu laksana memakan daging bangkai saudaranya sendiri yang sangat tidak disukai oleh jiwa karena ghibah yang dilakukan. Karena kalian tidak ingin memakan daging saudara sendiri khususnya yang sudah tidak ada nyawanya, maka hendaklah kalian jangan melakukan ghibah dan memakan dagingnya hidup-hidup . “Dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang.” Maha Penerima Taubat, yakni yang memberi izin hambaNya untuk bertaubat dan diberi pertolongan untuk bertaubat kemudian taubatnya diterima, Maha Penyayang terhadap hamba-hambaNya karena diserukan kepada sesuatu yang membawa manfaat bagi mereka serta menerima taubat mereka. Di dalam ayat ini terdapat peringatan keras dari melakukan ghibah, karena ghibah tergolong dosa besar di mana Allah menyamakannya dengan memakan daging bangkai, yang mana memakan bangkai adalah termasuk dosa besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 12: Allah memerintahkan hambanya yang beriman, yaitu yang mereka membenarkan Allah dan rasul-Nya dan beramal dengan syariat-Nya agar menjauhkan diri mereka dari sangkaan yang buruk kepada orang-orang mukmin. Ketahuilah oleh kalian bahwasanya kebanyakan dari sangkaan-sangkaan akan terjatuh ke dalam dosa dan hanya menilai manusia dari penampakannya secara zahir dan tidak memeriksa apa yang menjadi penyebab yang ada pada dirinya. Maka wajib bagi kalian menjauhkan diri dari ghibah karena sesungguhnya ghibah kepada sesama muslim seperti orang yang memakan daging bangkai saudaranya. Dan tidak diragukan lagi bahwa kalian dilarang atas hal itu, dan takutlah kepada Allah wahai orang-orang yang beriman atas apa yang telah diperintahkan kepada kalian dan dilarang dari-Nya. Karena sesungguhnya Allah menerima taubat bagi hambNya yang beriman dan merahmati mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala melarang banyak dari prasangka terhadap kaum mukmin, karena sebagian dari prasangka adalah dosa, seperti sangkaan yang kosong dari hakikat dan qarinah, bersangka buruk yang diiringi dengan ucapan dan perbuatan yang diharamkan, karena bersangka buruk di hati tidak sebatas sampai di situ, bahkan terus menjalar sehingga ia mengatakan kata-kata yang tidak patut dan melakukan perbuatan yang tidak layak dilakukan, disamping sebagai sikap su’uzzhan terhadap seorang muslim, membencinya dan memusuhinya, padahal yang diperintahkan adalah kebalikannya. Seperti suu’uzzhan (bersangka buruk) kepada orang-orang yang baik dari kalangan kaum mukmin, berbeda dengan orang fasik, maka tidak mengapa pada apa yang mereka tampakkan. Yakni biarkanlah kaum muslimin dengan keadaannya dan gunakanlah sikap merasa lengah terhadapnya, dimana jika dikaji malah tampak perkara yang tidak patut. Yaitu dengan menyebutkan hal yang tidak disukainya meskipun ada padanya. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan perumpamaan untuk menjauhkan sesorang dari ghibah. Yakni sebagaimana kamu tidak suka dan merasa jijik memakan bangkai saudaramu yang sudah mati, maka seperti itulah seharusnya sikap kamu terhadap ghibah (menggunjing saudaramu). Ayat ini menunjukkan ancaman yang keras terhadap ghibah, dan bahwa ghibah termasuk dosa yang besar karena Allah mengumpamakannya seperti memakan daging saudaranya yang telah mati. Allah adalah At Tawwab, yakni Dia yang mengizinkan tobat hamba-Nya, lalu Dia memberinya taufiq kepadanya, kemudian menerima tobatnya. Dia Maha Penyayang kepada hamba-hamba-Nya, dimana Dia mengajak mereka kepada sesuatu yang bermanfaat bagi mereka dan menerima tobat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 12",
    "description": "Selanjutnya Allah memberi peringatan kepada orang-orang ber-iman supaya mereka menjauhkan diri dari prasangka terhadap orang-orang yang beriman. Wahai orang-orang yang beriman! jauhilah banyak dari prasangka buruk kepada manusia yang tidak disertai bukti atau tanda-tanda, sesungguhnya sebagian prasangka, yakni prasangka yang tidak disertai bukti atau tanda-tanda itu adalah dosa dan janganlah kamu mencari-cari kesalahan orang lain yang sengaja ditutup-tutupi untuk mencemoohnya dan janganlah ada di antara kamu yang menggunjing, yakni membicarakan aib, sebagian yang lain. Apakah ada di antara kamu yang suka memakan daging saudaranya yang sudah mati' tentu kamu merasa jijik. Karena itu hindarilah pergunjingan karena itu sama de-ngan memakan daging saudara yang telah mati. Dan bertakwalah kepada Allah, sesungguhnya Allah maha penerima tobat kepada orang yang bertobat, maha penyayang kepada orang yang taat. 13. Ayat yang lalu menjelasakan tata krama pergaulan orang-orang yang beriman, ayat ini beralih menjelaskan tata krama dalam hubung-an antara manusia pada umumnya. Karena itu panggilan ditujukan kepada manusia pada umumnya. Wahai manusia! sungguh, kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, yakni berasal dari keturunan yang sama yaitu adam dan hawa. Semua manusia sama saja derajat kemanusiaannya, tidak ada perbedaan antara satu suku dengan suku lainnya. Kemudian kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal dan dengan demikian saling membantu satu sama lain, bukan saling mengolok-olok dan sa-ling memusuhi antara satu kelompok dengan lainnya. Allah tidak menyukai orang yang memperlihatkan kesombongan dengan keturunan, kekayaan atau kepangkatan karena sungguh yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Karena itu berusahalah untuk meningkatkan ketakwaan agar menjadi orang yang mulia di sisi Allah. Sungguh, Allah maha mengetahui segala sesuatu baik yang lahir maupun yang tersembunyi, mahateliti sehingga tidak satu pun gerak-gerik dan perbuatan manusia yang luput dari ilmu-Nya."
  }
]