[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia, sesungguhnya Kami menciptakan kalian dari satu bapak, yaitu Adam dan satu ibu yaitu Hawwa. Maka janganlah merasa lebih utama di antara sebagian kalian atas sebagian yang lain dari sisi nasab. Kami menjadikan kalian berbangsa-bangsa dan bersuku-suku melalui proses berketurunan, agar sebagian dari kalian mengenal sebagian yang lain. Sesungguhnya orang yang paling mulia di antara kalian di sisi Allah adalah yang paling bertakwa kepada Allah. Sesungguhnya Allah Maha Mengetahui orang-orang yang bertakwa dan Maha teliti terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Wahai manusia! Sesungguhnya Aku menciptakan kalian dari satu laki-laki, yaitu bapak kalian Adam, dan satu wanita, yaitu ibu kalian Hawa, jadi nasab kalian itu satu, maka janganlah sebagian dari kalian menghina nasab sebagian yang lain. Dan kemudian Kami menjadikan kalian suku-suku yang banyak dan bangsa-bangsa yang menyebar agar sebagian dari kalian mengenal sebagian yang lain, bukan untuk saling merasa lebih tinggi, karena kedudukan yang tinggi itu hanya didapat dengan ketakwaan. Sesungguhnya orang yang paling mulia dari kalian di sisi Allah adalah orang yang paling bertakwa di antara kalian, sesungguhnya Allah Maha Mengetahui segala kondisi kalian, Maha Mengenal kelebihan dan kekurangan kalian, tidak ada sesuatu pun dari hal itu yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Setalah Allah memerintahkan orang-orang beriman untuk menjadi saudara, mendamaikan dua kolompok dari mereka yang bertikai, dan melarang mereka dari menghina, mengejek, berprasangka buruk, mencari-cari kesalahan, dan menggunjing; maka Allah menyebutkan kepada mereka asal dari persaudaraan mereka secara nasab yang dikuatkan oleh persaudaraan seagama. Allah menyampaikan kepada manusia: Kami -dengan keagungan dan kekuasaan Kami yang sempurna- menciptakan kalian dari satu orang laki-laki yaitu Adam, dan satu orang perempuan yaitu Hawa, maka janganlah kalian saling merasa unggul dalam hal nasab. Dan Kami menjadikan kalian berbagai bangsa melalui perkembangbiakan, dan dari bangsa-bangsa itu menjadi berbagai kabilah dan suku; agar kalian saling mengenal. Sungguh yang paling baik derajatnya di sisi Allah adalah orang yang paling bertakwa di antara kalian. Allah Maha Mengetahui hamba-hamba-Nya dan keadaan serta urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. يٰٓأَيُّهَا النَّاسُ إِنَّا خَلَقْنٰكُم مِّن ذَكَرٍ وَأُنثَىٰ (Hai manusia, sesungguhnya Kami menciptakan kamu dari seorang laki-laki dan seorang perempuan) Keduanya adalah Adam dan Hawa, yang menjadi penyatu bapak dan ibu; sehingga tidak ada alasan untuk membanggakan nasab dan garis keturunan, sebab semua orang sama. وَجَعَلْنٰكُمْ شُعُوبًا وَقَبَآئِلَ(dan menjadikan kamu berbangsa-bangsa dan bersuku-suku) Makna (الشعب) yakni sekumpulan besar manusia yang terdiri dari beberapa kabilah, seperti bangsa Mudhar dan Rabi’ah. Sedangkan (القبيلة) lebih kecil dari itu seperti kabilah Bani Bakar dari bansa Mudhar, dan Bani Tamim dari bansa Rabi’ah. Pendapat lain mengatakan makna (الشعب) yakni suku orang-orang selain Arab. Sedangkan (القبيلة) adalah suku orang-orang Arab. لِتَعَارَفُوٓا۟ ۚ( supaya kamu saling kenal-mengenal) Yakni hanya untuk saling mengenal bahwa ia dari kabilah ini. Bukan untuk saling membanggakan garis keturunan. إِنَّ أَكْرَمَكُمْ عِندَ اللهِ أَتْقَىٰكُمْ ۚ( Sesungguhnya orang yang paling mulia diantara kamu disisi Allah ialah orang yang paling takwa diantara kamu) Yakni perbedaan diantara kalian hanyalah karena ketakwaan. Maka janganlah kalian saling berbangga dengan nasab kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai manusia, sesungguhnya Kami menciptakan kalian dari satu asal keluarga yaitu Adam dan Hawa. Maka Janganlah kalian saling membanggakan nasab di antara kalian. Kami menjadikan kalian berbangsa-bangsa dan bersuku-suku supaya kalian saling berkenalan. Kami menciptakan kalian untuk saling berkenalan, tidak untuk saling membanggakan nasab. Syu’ub maknanya adalah umat besar seperti Bani Rabi’ah, Bani Mudhar dan Bani Khuzaimah tergabung dari banyak suku. Al-Qabail itu adalah kelompok selain Syu’ub seberti Bani Bakr yang merupakan bagian dari bangsa Rabi’ah dan Bani Tamim yang merupakan bagian dari bangsa Mudhar, Sesungguhnya yang paling utama dan paling tinggi posisinya di sisi Allah adalah ketakwaan kalian kepadaNya. Sesungguhnya Allah Maha Mengetahui adatas segala sesuatu dan Maha Memberitahu tantang urursan-urusan yang tersembunyi dan rahasia. Ayat ini diturunkan saat terjadi ejekan terhadap Bilal yang menaiki Ka’bah pada hari penaklukkan Mekah untuk mengumandangkan adzan, Kemudian Nabi SAW memanggil dan menegur mereka (yang mengejek) agar tidak membanggakan nasab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, sesungguhnya Kami telah menciptakan kalian dari seorang laki-laki dan perempuan. Kemudian Kami menjadikan kalian berbangsa-bangsa dan bersuku-suku agar kalian saling mengenal} agar kalian saling mengenal satu sama lain {Sesungguhnya yang paling mulia di antara kalian di sisi Allah adalah orang yang paling bertakwa. Sesungguhnya Allah Maha Mengetahui lagi Maha mengenal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Allah memberitahukan bahwa Dia menciptakan anak cucu Adam dari asal usul dan diri yang satu, semua keturunan Adam berasal dari lelaki dan perempuan yang silsilah semuanya merujuk pada Adam dan Hawa. Allah mengembangbiakkan dari keduanya lelaki dan perempuan yang banyak, mereka kemudian disebar dan dijadikan “berbangsa-bangsa dan bersuku-suku,” yakni suku-suku nyang besar dan kecil. Yang demikian itu bertujuan agar saling mengenal satu sama lain, sebab andai masing-masing orang menyendiri, tentu tidak akan tercapai tujuan saling mengenal satu sama lain yang bisa menimbulkan saling tolong menolong, bahu-membahu, saling mewarisi satu sama lain serta menunaikan hak-hak kerabat. Adanya manusia dijadikan berbangsa-bangsa dan bersuku-suku bertujuan agar berbagai hal positif tersebut bisa terwujud yang bergantung pada proses saling mengenal satu sama lain serta pemaduan nasab. Namun ukuran kemuliaan di antara mereka adalah takwa. Orang yang paling mulia di antara sesame adalah yang paling bertakwa kepada Allah, paling banyak melakukan ketaatan serta paling mampu mencegah diri dari kemaksiatan, bukan yang paling banyak kerabat serta kaumnya, bukan yang keturunannya paling terpandang (karena level social). Dan mengenai semua itu Allah “Maha Mengetahui lagi Maha Mengenal.” Allah mengetahui siapa di antara mereka yang bertakwa kepada Allah baik secara lahir maupun batin, serta siapa di antara mereka yang tidak menunaikannya, baik secara lahir maupun batin. Masing-masing akan diberi balasan yang sesuai. Di dalam ayat ini terdapat dalil yang menunjukkan bahwa mengetahui nasab itu diharuskan secara syariat, karena Allah menjadikan manusia berbangsa-banngsa dan bersuku-suku itu dengan tujuan demikian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 13: Ketahuilah wahai orang-orang yang beriman bahwasanya aku (kata Allah), menciptakan kalian dari bapak yang satu yaitu Adam dan dari ibu yang satu yaitu Hawa, maka tidak ada pengutamaan satu sama lain diantara kalian dalam urusan nasab atau rupa atau fisik, dan Allah menjadikan kalian bersuku-suku dan berkabilah-kabilah, maka sebagian dari kamu mengetahui atas sebagian yang lain atas keutamaan (kalian), dan kalian mengetahui nasabnya untuk menyambungkan nasab di antara kalian serta untuk saling tolong menolong di atas kebaikan dan ketakwaan. Dan dapat dipahami atas hal ini bahwasanya Allah menjadikan kalian suku-suku dan berkabilah-kabilah agar dapat saling mengenal, dan tidak untuk saling meninggalkan atau saling berbangga diri satu sama lain. Kemudian Allah menjelaskan bahwasanya manusia yang mulia dan terhormat serta tinggi derajatnya di sisi Allah mereka adalah orang-orang yang bertakwa dan diampuni. Sungguh Allah mengetahui keadaan kalian dan mengetahui orang-orang yang bertakwa di antara kalian dan yang terbaik di antara kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia yang menciptakan Bani Adam dari asal yang satu dan jenis yang satu. Mereka semua dari laki-laki dan perempuan dan jika ditelusuri, maka ujungnya kembali kepada Adam dan Hawa’. Allah Subhaanahu wa Ta'aala menyebarkan dari keduanya laki-laki dan perempuan yang banyak dan memisahkan mereka serta menjadikan mereka berbangsa-bangsa dan bersuku-suku agar mereka saling kenal-mengenal sehingga mereka bisa saling tolong-menolong, bantu-membantu dan saling mewarisi serta memenuhi hak kerabat. Meskipun demikian, orang yang paling mulia di antara mereka adalah orang yang paling takwa, yakni mereka yang paling banyak ketaatannya kepada Allah dan meninggalkan maksiat, bukan yang paling banyak kerabat dan kaumnya dan bukan yang paling mulia nasabnya. Dalam ayat ini terdapat dalil bahwa mengetahui nasab adalah disyariatkan, karena Allah Subhaanahu wa Ta'aala menjadikan mereka berbangsa-bangsa dan bersuku-suku adalah untuk itu. Oleh karena itu, janganlah saling berbangga karena tingginya nasab, bahkan yang dapat dibanggakan adalah ketakwaan. Dia mengetahui siapa di antara mereka yang melaksanakan ketakwaan kepada Allah baik zahir maupun batin dengan orang yang hanya di zahir (luar) saja bertakwa kepada Allah, sehingga Dia membalas masing-masingnya dengan balasan yang pantas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 13",
    "description": "Ayat yang lalu menjelasakan tata krama pergaulan orang-orang yang beriman, ayat ini beralih menjelaskan tata krama dalam hubung-an antara manusia pada umumnya. Karena itu panggilan ditujukan kepada manusia pada umumnya. Wahai manusia! Sungguh, Kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, yakni berasal dari keturunan yang sama yaitu Adam dan Hawa. Semua manusia sama saja derajat kemanusiaannya, tidak ada perbedaan antara satu suku dengan suku lainnya. Kemudian Kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal dan dengan demikian saling membantu satu sama lain, bukan saling mengolok-olok dan sa-ling memusuhi antara satu kelompok dengan lainnya. Allah tidak menyukai orang yang memperlihatkan kesombongan dengan keturunan, kekayaan atau kepangkatan karena sungguh yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Karena itu berusahalah untuk meningkatkan ketakwaan agar menjadi orang yang mulia di sisi Allah. Sungguh, Allah Maha Mengetahui segala sesuatu baik yang lahir maupun yang tersembunyi, Mahateliti sehingga tidak satu pun gerak-gerik dan perbuatan manusia yang luput dari ilmu-Nya.14. Setelah pada ayat yang lalu dijelaskan bahwa orang yang paling mulia di sisi Allah adalah adalah orang yang paling bertakwa, ayat ini menjelaskan hakikat iman yang melekat pada orang yang bertakwa. Ayat ini dikemukakan dalam konteks penjelasan terhadap serombong-an orang-orang Badui yang datang kepada Nabi yang menyatakan bahwa mereka telah beriman dengan benar. Orang-orang Arab Badui berkata kepadamu, ?Kami telah beriman.? Allah menegaskan melalui firman-Nya, Katakanlah kepada mereka, wahai Nabi Muhammad, ?Kamu belum beriman sebab hati kamu belum sepenuhnya percaya, dan perbuatan kamu belum mencerminkan iman sesuai apa yang kamu katakan tetapi katakanlah ?Kami telah tunduk kepadamu.' Ucapan se-perti itu lebih pantas kamu katakan, karena iman belum masuk ke dalam hatimu. Dan jika kamu benar-benar taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikit pun pahala amal perbuatanmu. Sungguh, Allah Maha Pengampun kepada orang yang bertobat, Maha Penyayang kepada orang yang taat.?"
  }
]