[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang arab Badui berkata, “Kami beriman kepada Allah dan rasulNya dengan iman sempurna.” Katakanlah kepada mereka (wahai nabi) “jangan mengklaim iman sempurna untuk diri kalian, akan tetapi katakanlah, ‘Kami masuk islam.’ Karena iman belum masuk ke dalam hati kalian. Dan jika kalian menaati Allah dan rasulNya, niscaya Allah tidak mengurangi pahala amal perbuatan kalian sedikit pun. Sesungguhnya Allah Maha Pengampun bagi siapa yang bertaubat dari dosa-dosanya dan Maha Penyayang kepadanya.” Dalam ayat ini terkandung hardikan terhadap orang-orang yang memperlihatkan iman dan mengikuti as-Sunnah, tetapi amal perbuatannya menyelisihinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sebagian orang-orang Badui berkata ketika menghadap kepada Nabi -ṣallallāhu 'alaihi wa sallam-, “Kami beriman kepada Allah dan Rasul-Nya.” Katakan -wahai Rasul- kepada mereka, “Kalian belum beriman, akan tetapi ucapkanlah 'kami pasrah dan tunduk', karena keimanan belum masuk ke dalam hati kalian dan belum terbayang masuknya iman itu ke dalam hati kalian. Jika kalian -wahai orang-orang Badui- menaati Allah dan Rasul-Nya dalam keimanan dan amal saleh serta menghindari hal-hal yang diharamkan, niscaya Allah tidak akan mengurangi sedikitpun dari pahala amal perbuatan kalian. Sesungguhnya Allah Maha Pengampun bagi hamba-hamba-Nya yang bertobat, Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Sebagian penduduk badui berkata: “Kami beriman kepada Allah dan rasul-Nya sepenuhnya dengan perkataan dan perbuatan.” Hai Rasulullah, katakanlah kepada mereka: “Kalian belum mencapai derajat keimanan, maka katakanlah, ‘Kami telah memeluk Islam’, sebab keimanan yang sempurna belum memasuki hati kalian. Jika kalian mentaati Allah dan rasul-Nya, maka Allah tidak akan mengurangi pahala amalan kalian sedikitpun. Allah Maha Mengampuni dan Mengasihi orang-orang yang bertaubat dari dosa-dosa mereka.” Kemudian Allah menunjukkan kepada mereka tingkatan keimanan: Orang-orang beriman adalah orang-orang yang percaya kepada Allah dan rasul-Nya dan menjalankan syariat-Nya, kemudian mereka tidak ragu sama sekali, dan ikut berjihad dengan harta dan jiwa mereka demi menolong agama Allah. Orang-orang yang memiliki derajat yang tinggi itu adalah orang-orang yang benar dalam imannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قُل لَّمْ تُؤْمِنُوا۟ (Katakanlah: “Kamu belum beriman) Yakni kalian belum percaya dengan sepenuh hati dan kesucian niat. وَلٰكِن قُولُوٓا۟ أَسْلَمْنَا(tapi katakanlah ‘kami telah tunduk’) Yakni kami baru mengucapkan dua kalimat syahadat saja. وَلَمَّا يَدْخُلِ الْإِيمٰنُ فِى قُلُوبِكُمْ ۖ (karena iman itu belum masuk ke dalam hatimu) Yakni hanya mengatakan dengan lisan tanpa keyakinan yang benar dan niat yang tulus. لَا يَلِتْكُم مِّنْ أَعْمٰلِكُمْ شَيْـًٔا ۚ (Dia tidak akan mengurangi sedikitpun pahala amalanmu) Yakni Allah tidak akan mengurangi pahala perbuatan kalian sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Orang-orang Baduwi (penduduk lokal) berkata: “Kami mengimani apa yang datang bersamamu wahai Rasulallah dan menjalankan perintah”. Katakanlah kepada mereka: “Katakanlah, kami meninggikan Islam hanya bagian luarnya saja, Kami tunduk hanya bagian zhahir saja. Iman yang benar belum merasuk kedalam hati kalian. Jika kalian menaati Allah dan rasulNya dengan ikhlas dan meninggalkan kemunafikan, maka Allah tidak akan mengurangi pahala amal ibadah kalian. Sesungguhnya Allah Maha Pengampun atas apa yang telah kalian lalaikan. Jika kalian bertaubat, maka Dia akan mencurahkan keutamaanNya untuk kalian dengan menerima taubat orang yang bertaubat dan orang-orang yang meminta ampuanan”. Ayat ini diturunkan bagi pembenci dari Bani Asad bin Khuzaimah. Mereka datang ke Madinah saat masa-masa gersang. Mereka menampakkan ungkapan syahadatain, namun mereka belum beriman dalam hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang Arab Badui} Badui {berkata,“Kami telah beriman” Katakanlah,“Kamu belum beriman, tetapi katakanlah,”Kami baru berislam” dan keimanan belum masuk ke dalam hati kalian. Jika kalian taat kepada Allah dan RasulNya, Dia tidak akan mengurangi sedikit pun amal perbuatan kalian”} tidak mengurangi pahala amal kalian {Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Allah mengabarkan tentang perkataan orang-orang Arab Badui. Mereka adalah orang-orang yang masuk Islam di masa Rasulullah tanpa disertai pengetahuan dan tidak menunaikan kewajiban dan tuntutan keimanan, meski demikian mereka mengklaim seraya berkata, “Kami telah beriman,” dengan keimanan yang sempurna yang memenuhi semua perkaranya. Inilah maksud dari perkataan mereka. Maka Allah memerintahkan RasulNya untuk membantah mereka, “Katakanlah (kepada mereka), ‘Kamu belum beriman’.” Artinya, janganlah kalian mengklaim kedudukan iman yang sempurna pada diri kalian, baik secara lahir maupun batin, ”tetapi katakanlah, ‘Kami telah tunduk’,” yaitu telah masuk Islam dan cukupkan pada batasan itu, “dan,” penyebab hal itu adalah karena ” Iman itu belum masuk ke dalam hatimu.” Kalian hanya baru masuk Islam karena takut atau mengharap sesuatu dan lainnya yang menjadi penyebab keimanan kalian, karena itulah pancaran keimanan belum merasuk ke dalam hati kalian. Firman Allah, ”Iman itu belum masuk ke dalam hatimu,” yakni pada waktu kalian mengutarakan pembicaraan ini. Dalam ayat ini terdapat isyarat tentang hal ihwal mereka setelah itu, sebab tidak sedikit dari mereka yang diberi keimanan hakiki oleh Allah serta berjihad di jalanNya, “dan jika kamu taat kepada Allah dan RasulNya,” dengan mengerjakan kebaikan dan meninggalkan keburukan, “Dia tiada akan mengurangi sedikitpun (pahala) amalanmu,” yakni, tidak menguranginya sebesar biji atom pun, justru Allah akan menyempurnakannya untuk kalian hingga kalian tidak akan kehilangan pahala amalan yang besar maupun yang kecil. “Sesungguhnya Allah Maha Pengampun terhadap orang yang bertaubat dan kembali padaNya serta Maha Penyayang padanya karena taubatnya diterima."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 14: Allah mengabarkan bahwasanya sebagian orang-orang Arab yaitu badui yang mereka masuk Islam dan berkata: Kami beriman dan kami menerima Islam, maka katakanlah: Sesungguhnya kalian tidak mendapatkan keimanan yang sempurna, akan tetapi kalian masuk ke dalam Islam dan tidak sampai pada derajat keimanan secara sempurna. Ketahuilah bahwasanya kalian jika mentaati Allah dan rasul-Nya maka sungguh Allah tidak mengurangi sedikitpun dari pahala amalan-amalan kalian, Sesungguhnya Allah Maha Pengampun atas dosa-dosa hamba-Nya yang bertaubat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan perkataan orang-orang Arab badui yang masuk ke dalam Islam di zaman Rasulullah shallallahu 'alaihi wa sallam, dimana masuknya mereka tidak di atas kesadaran dan pengetahuan akan kebenaran Islam. Yakni ‘kami telah membenarkan dengan hati kami.’ Atau ‘kami telah beriman secara sempurna yang mencakup semua perkara keimanan,’ maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya menjawab, bahwa mereka belum beriman. Yakni janganlah kamu mendakwakan diri beriman secara zhahir maupun batin dan beriman secara sempurna. Yakni kami telah tunduk zhahir(lahiriah)nya. Atau ‘kami telah masuk ke dalam agama Islam.’ Yakni karena kamu beriman hanyalah karena takut atau berharap sesuatu. Hal ini ketika di awal mereka masuk Islam, namun setelahnya banyak di antara mereka yang menjadi mukmin hakiki dan berjihad di jalan Allah. Dengan mengerjakan perbuatan baik dan meninggalkan keburukan. Dia Maha Pengampun bagi orang yang bertobat dan kembali kepada-Nya, dan Dia Maha Penyayang, dimana Dia menerima tobatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 14",
    "description": "Setelah pada ayat yang lalu dijelaskan bahwa orang yang paling mulia di sisi Allah adalah adalah orang yang paling bertakwa, ayat ini menjelaskan hakikat iman yang melekat pada orang yang bertakwa. Ayat ini dikemukakan dalam konteks penjelasan terhadap serombong-an orang-orang Badui yang datang kepada Nabi yang menyatakan bahwa mereka telah beriman dengan benar. Orang-orang Arab Badui berkata kepadamu, ?Kami telah beriman.? Allah menegaskan melalui firman-Nya, Katakanlah kepada mereka, wahai Nabi Muhammad, ?Kamu belum beriman sebab hati kamu belum sepenuhnya percaya, dan perbuatan kamu belum mencerminkan iman sesuai apa yang kamu katakan tetapi katakanlah ?Kami telah tunduk kepadamu.' Ucapan se-perti itu lebih pantas kamu katakan, karena iman belum masuk ke dalam hatimu. Dan jika kamu benar-benar taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikit pun pahala amal perbuatanmu. Sungguh, Allah Maha Pengampun kepada orang yang bertobat, Maha Penyayang kepada orang yang taat.? 15. Selanjutnya ayat ini menjelaskan siapa yang benar-benar sempurna imannya. Sesungguhnya orang-orang mukmin yang sebenarnya adalah me-reka yang beriman kepada Allah dan meyakini semua sifat-sifat-Nya dan membenarkan apa yang disampaikan oleh Rasul-Nya. Kemudian dalam berlalunya waktu mereka tidak ragu-ragu sedikitpun dan tidak goyah pendiriannya dan mereka berjihad dengan menye-rahkan harta dan me-ngorbankan jiwanya di jalan Allah. Mereka itulah orang-orang yang benar dalam ucapan dan perbuatan mereka."
  }
]