[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang Mukmin itu adalah yang membenarkan Allah dan RasulNya dan melaksanakan syariatNya, kemudian mereka tidak ragu-ragu dalam iman mereka, mengorbankan harta dan jiwa mereka dalam jihad di jalan Allah, ketaatan dan (usaha meraih) keridhaanNYa. Mereka itulah orang-orang yang benar imannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya orang-orang yang beriman hanyalah orang-orang yang beriman kepada Allah dan Rasul-Nya, kemudian tidak mencampuri keimanannya dengan keraguan dan berjuang dengan hartanya dan jiwanya di jalan Allah serta tidak kikir dengan sesuatupun darinya. Orang-orang yang mempunyai sifat-sifat demikian ini adalah orang-orang yang jujur dalam keimanan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ ءَامَنُوا۟ بِاللهِ وَرَسُولِهِۦ (Sesungguhnya orang-orang yang beriman itu hanyalah orang-orang yang percaya (beriman) kepada Allah dan Rasul-Nya) Yakni yang beriman dengan keimanan yang benar dan tulus, yang hatinya sesuai dengan lisannya. ثُمَّ لَمْ يَرْتَابُوا۟( kemudian mereka tidak ragu-ragu) Yakni tidak ada keraguan yang masuk ke dalam hati mereka. وَجٰهَدُوا۟ بِأَمْوٰلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ اللهِ ۚ( dan mereka berjuang (berjihad) dengan harta dan jiwa mereka pada jalan Allah) Yakni pada ketaatan-Nya dan mengharap keridhaan-Nya. أُو۟لٰٓئِكَ(Mereka itulah) Yakni orang-orang yang ada dalam dirinya hal-hal tersebut. هُمُ الصّٰدِقُونَ(orang-orang yang benar) Yakni benar dalam pengakuannya sebagai orang yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya orang-orang mukmin sesungguhnya adalah mereka yang beriman kepada Allah dan rasulNya, lelu mereka tidak mengeluhkan sedikitpun tentang iman dan berjihadn untuk menaati Allah dan mencari ridhaNya dengan harta benda dan diri mereka. Mereka itu adalah orang-orang yang benar keimanannya, bukan orang yang berkata: “Kami beriman, namun hati kami tidak” Tidak ditemukan apapun dalam diri mereka kecuali Islam yang secara zhahir saja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang mukmin adalah orang-orang yang beriman kepada Allah dan RasulNya, kemudian mereka tidak ragu-ragu} tidak ragu tentang apa yang mereka imani {dan mereka berjihad dengan harta dan jiwa mereka di jalan Allah. Mereka itulah orang-orang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Sesungguhnya orang-orang yang beriman,” yakni secara hakiki, ialah “orang-orang yang beriman kepada Allah dan RasulNya kemudian mereka tidak ragu-ragu dan mereka berjihad dengan harta dan jiwa mereka pada jalan Allah.” Yakni, orang yang menyatukan antara keimanan terhadap Allah dan RasulNya dengan jihad di jalanNya; sebab orang yang menegakkan jihad terhadap kaum kafir itu menunjukkan kesempurnaan imannya di dalam hati. Sebab orang yang memerangi kaum kafir atas nama Islam dan iman serta menunaikan syariat-syariat Allah itu, tentu sudah pasti telah berjihad terhadap dirinya sendiri. Orang yang tidak mampu berjihad menunjukkan kelemahan imannya. Dalam beriman, Allah mensyaratkan tidak adanya keraguan, karena iman yang bermanfaat itu adalah tekad bulat dan keyakinan terhadap perintah Allah untuk beriman padaNya yang tidak disertai dengan keraguan sedikit pun. Firman Allah, “Mereka itulah orang-orang yang benar,” yakni, orang-orang yang membuktikan keimanan mereka dengan perbuatan-perbuatan baik. Kejujuran adalah pengakuan besar terhadap segala hal yang diakui, dan orang yang jujur memerlukan hujjah dan bukti, dan bukti terbesar adallah klaim keimanan yang merupakan pusat kebahagiaan dan kemenangan abadi, maka siapa pun yang mengaku beriman dan mengerjakan kewajiban serta keharusan iman, maka ia adalah orang jujur dan Mukmin sejati. Sebaliknya orang yang tidak demikian halnya dapat diketahui bahwa pengakuannya tidak benar, sehingga pengakuannya tidak berguna sama sekali, sebab keimanan dalam hati itu hanya diketahui oleh Allah semata. Maka penegasan atau penafian keimanan (di sini) adalah tindakan yang mengajari Allah terhadap sesuatu yang ada di dalam hati dan ini merupakan etika dan dugaan yang tidak baik terhadap Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 15: Allah mengabarkan sifat dari hambanya yang beriman secara benar, Allah berkata: sesungguhnya orang-orang yang beriman secara hakiki mereka adalah yang beriman kepada Allah dengan jujur, membenarkan rasul-Nya, tidak masuk dalam relung hati mereka keraguan, dan tidak bercampur padanya kerancuan. Kemudian setelah itu mereka adalah orang-orang yang berjihad di jalan Allah dengan harta-harta mereka dan diri-diri mereka, serta mendahulukan apa yang Allah mudahkan; Maka merekalah orang-orang yang jujur dalam keimanan, di mana mereka membenarkan keimanan mereka dengan amalan-amalan yang nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yani mukmin hakiki. Hal itu karena jihad membuktikan benar dan kuatnya iman mereka. Sebalikanya, orang yang tidak kuat berjihad, maka yang demikian menunjukkan imannya lemah. Dalam ayat tersebut Allah Subhaanahu wa Ta'aala mensyaratkan iman mereka dengan tidak ragu-ragu, karena iman yang bermanfaat adalah keyakinan yang pasti kepada apa saja yang diperintahkan Allah untuk diimani, dimana hal itu tidak dicampuri oleh keraguan sedikit pun. Yang membenarkan iman mereka dengan amal mereka yang baik. Kejujuran adalah dakwaan yang besar dalam segala sesuatu, dimana pelakunya butuh kepada hujjah dan bukti, dan yang paling besar dalam hal ini adalah dakwaan beriman yang merupakan pusat kebahagiaan dan keberuntungan. Oleh karena itu, barang siapa yang mengaku beriman, mengerjakan kewajiban dan lawazim (yang menjadi bagiannya), maka dialah yang benar imannya atau mukmin hakiki. Jika tidak demikian, maka dapat diketahui, bahwa dia tidak benar dalam dakwaannya dan tidak ada faedah pada dakwaannya, karena iman dalam hati tidak ada yang mengetahuinya selain Allah Ta’ala. Dengan demikian, menetapkan dan menafikannya termasuk memberitahukan kepada Allah apa yang ada dalam hati, dan ini merupakan adab dan sangkaan yang buruk kepada Allah Subhaanahu wa Ta'aala. Oleh karena itulah pada ayat selanjutnya Dia berfirman, “Katakanlah (kepada mereka), \"Apakah kamu akan memberitahukan kepada Allah tentang agamamu (keyakinanmu), padahal Allah mengetahui apa yang ada di langit dan apa yang ada di bumi; dan Allah Maha Mengetahui segala sesuatu.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 15",
    "description": "Selanjutnya ayat ini menjelaskan siapa yang benar-benar sempurna imannya. Sesungguhnya orang-orang mukmin yang sebenarnya adalah me-reka yang beriman kepada Allah dan meyakini semua sifat-sifat-Nya dan membenarkan apa yang disampaikan oleh rasul-Nya. Kemudian dalam berlalunya waktu mereka tidak ragu-ragu sedikitpun dan tidak goyah pendiriannya dan mereka berjihad dengan menye-rahkan harta dan me-ngorbankan jiwanya di jalan Allah. Mereka itulah orang-orang yang benar dalam ucapan dan perbuatan mereka. 16. Katakanlah, wahai nabi Muhammad, kepada orang-orang badui yang mengaku beriman itu, 'apakah kamu akan memberitahukan kepada Allah dan menjelaskan tentang agamamu serta keyakinanmu seperti yang engkau katakan kepada nabi, padahal yang demikian itu tidak perlu karena Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan Allah maha mengetahui segala sesuatu. \""
  }
]