[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Nabi) kepada orang-orang Badui itu, “Apakah kalian akan memberitahu Allah tentang agama kalian dan apa yang ada di dalam hati kalian, padahal Allah mengetahui apa yang ada di langit dan di bumi? Allah Maha mengetahui segala sesuatu, tidaklah samar bagiNya apa yang ada dalam hati kalian berupa iman atau kekafiran, kebaikan atau kecenderungan kepada dosa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Katakanlah -wahai Rasul- kepada orang-orang Badui itu, “Apakah kalian memberitahukan kepada Allah dan menjelaskan kepada-Nya tentang agama kalian? Sementara Allah mengetahui apa yang ada di langit dan mengetahui apa yang di bumi, dan Allah Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari-Nya, maka Dia tidak butuh kepada pemberitahuan kalian tentang agama kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Hai Rasulullah, katakanlah kepada orang-orang badui itu: “Apakah kalian akan memberitahukan keimanan dan keislaman kalian kepada Allah, padahal Allah Maha Mengetahui segala yang ada di langit dan bumi yang tujuh? Allah Maha Mengetahui segalanya, tidak ada yang tersembunyi dari-Nya.” Mereka merasa berjasa terhadapmu karena mereka telah masuk Islam dan memberimu pertolongan. Katakanlah kepada mereka: “Janganlah kalian merasa berjasa terhadapku karena telah kalian masuk Islam; namun Allah-lah yang telah berjasa terhadap kalian karena Dia memberi petunjuk bagi kalian sehingga kalian beriman kepada-Nya dan kepada rasul-Nya, jika kalian memang benar-benar beriman.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قُلْ أَتُعَلِّمُونَ اللهَ بِدِينِكُمْ (Katakanlah: “Apakah kamu akan memberitahukan kepada Allah tentang agamamu) Yakni apakah kalian akan memberitahukan kepada-Nya agar Allah mengetahui setelah kalian berkata “kami telah beriman” وَاللهُ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ( padahal Allah mengetahui apa yang di langit dan apa yang di bumi) Maka bagaimana Allah akan lalai dari kebenaran pengakuan kalian tentang keimanan kalian itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Katakanlah kepada mereka wahai Rasulallah: “Apakah kalian akan memberitahu Allah dengan hanya berkata: “Kami beriman”? Sesungguhnya Allah Mengetahui hal itu dan segala sesuatu di langit dan bumi. Allah adalah Dzat yang luas pengetahuanNya tentang segala sesuatu. Tidak ada yang luput dariNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah kalian akan memberi tahu Allah tentang agama kalian} Apakah kalian akan memberitahu Allah tentang agama kalian yang telah kalian anut {padahal Allah mengetahui apa yang ada di langit dan yang ada di bumi serta Allah Maha Mengetahui segala sesuatu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Karena itulah Allah berfirman, “Katakanlah (kepada mereka), ‘Apakah kamu akan memberitahukan kepada Allah tentang agamamu (keyakinanmu), padahal Allah mengetahui apa yang ada di langit dana pa yang ada di bumi dan Allah Maha Mengetahui segala sesuatu?” ini mencakup segala sesuatu termasuk keimanan, kekufuran, kebaikan, dan keburukan. Semua itu diketahui oleh Allah dan akan memberikan balasannya, balasan baik akan diberikan pada amalan baik dan balasan buruk diberikan pada amalan buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 16: Allah memerintahkan Nabi Muhammad ﷺ agar mengatakan kepada mereka orang-orang Badui: Apakah kalian telah dikabarkan oleh Allah atas keimanan kalian sehingga kalian mengetahui atas hal itu dan merasakannya? Padahal Allah lah yang mengetahui apa yang ada dilangit dan dibumi, dan mengetahui rahasia-rahasia kalian serta apa yang nampak dari diri kalian, Sesungguhnya Allah mengetahui apa yang kalian sembunyikan dan Allah Maha Tahu apa yang kalian sembunyikan, tidak sembunyi atasnya sesuatu apapun dari niat-niat, ucapan-ucapan dan amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk di dalamnya apa yang ada dalam hati manusia berupa keimanan dan kekafiran, kebaikan dan keburukan, maka Allah Subhaanahu wa Ta'aala mengetahui semua itu dan akan membalasnya. Jika baik, maka Dia balas dengan kebaikan dan jika buruk, maka Dia balas dengan keburukan. Inilah salah satu keadaan di antara keadaan orang yang mengaku mukmin padahal tidak demikian, dimana hal ini berkemungkinan, dia memberitahukan Allah, padahal Allah Subhaanahu wa Ta'aala mengetahui segala sesuatu, dan bisa juga maksud ucapan mereka itu adalah menunjukkan jasanya kepada Rasulullah shallallahu 'alaihi wa sallam, yakni mereka telah mengorbankan sesuatu untuk Beliau shallallahu 'alaihi wa sallam padahal yang demikian untuk keberuntungan dirinya sendiri. Ini merupakan berhias dengan sesuatu yang tidak menghiasinya dan berbangga dengan sesuatu yang tidak pantas dibanggakan kepada Rasul-Nya shallallahu 'alaihi wa sallam, karena sesungguhnya yang demikian itu adalah nikmat dari Allah atas mereka, yakni sebagaimana Dia telah memberi nikmat kepada mereka dengan menciptakan dan memberi mereka rezeki serta nikmat-nikmat yang tampak maupun tersembunyi, Dia juga memberi nikmat kepada mereka dengan menunjukkan mereka kepada Islam dan iman, dimana nikmat ini merupakan nikmat paling besar. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman di ayat selanjutnya, “Mereka merasa berjasa kepadamu dengan keislaman mereka. Katakanlah, \"Janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 16",
    "description": "Katakanlah, wahai nabi Muhammad, kepada orang-orang badui yang mengaku beriman itu, 'apakah kamu akan memberitahukan kepada Allah dan menjelaskan tentang agamamu serta keyakinanmu seperti yang engkau katakan kepada nabi, padahal yang demikian itu tidak perlu karena Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan Allah maha mengetahui segala sesuatu. \" 17. Mereka tidak ragu-ragu mengaku bahwa mereka merasa berjasa telah memberi nikmat kepadamu, yakni kepada nabi Muhammad, dengan keislaman mereka. Maka kepada nabi diperintahkan untuk mengatakan kepada mereka: katakanlah, 'janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebab manfaat keislamanmu bukan kepadaku tetapi untuk kamu sendiri dan sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar dalam ucapanmu. ' sungguh, Allah senantiasa mengetahui apa yang gaib di langit dan di bumi. Dan Allah senantiasa maha melihat apa yang kamu kerjakan."
  }
]