[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Arab Badui itu merasa berjasa kepadamu (wahai Nabi) dengan keislaman, dengan mengikutimu dan bantuan mereka kepadamu. Katakanlah kepada mereka, “Jangan memandang keislaman kalian sebagai jasa atasku, karena manfaatnya bukan untukku akan tetapi untuk kalian sendiri. Justru Allah-lah yang telah melimpahkan nikmat kepada kalian dengan membimbing kalian kepada iman kepadaNYa dan RasulNya, bila kalian memang benar dalam iman kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Orang-orang Badui itu merasa telah memberimu -wahai Rasul- karunia dengan masuknya mereka ke dalam Islam. Katakan kepada mereka, “Janganlah kalian merasa telah memberiku karunia dengan masuknya kalian ke dalam agama Islam, karena manfaatnya -jika memang ada- kembali kepada kalian. Justru Allah-lah yang memberikan karunia kepada kalian dengan memberikan taufik kepada kalian untuk masuk ke dalam agama-Nya, jika kalian jujur dengan pengakuan kalian bahwa kalian telah masuk Islam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. يَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا۟ ۖ (Mereka merasa telah memberi nikmat kepadamu dengan keislaman mereka) Yakni mereka menganggap bahwa keislaman mereka adalah kenikmatan yang mereka berikan kepadamu, dengan mengatakan kepadamu: “kami mendatangimu dengan membawa barang-barang dan keluarga, dan kami tidak memerangimu sebagaimana Bani ini dan Bani itu yang memerangimu.” قُل لَّا تَمُنُّوا۟ عَلَىَّ إِسْلٰمَكُم ۖ( Katakanlah: “Janganlah kamu merasa telah memberi nikmat kepadaku dengan keislamanmu) Yakni janganlah kalian menganggapnya sebagai kenikmatan yang kalian berikan kepadaku. بَلِ اللهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَىٰكُمْ لِلْإِيمٰنِ(ebenarnya Allah, Dialah yang melimpahkan nikmat kepadamu dengan menunjuki kamu kepada keimanan) Yakni Allah telah memberi kalian taufik agar menerima agama Islam dan melapangkan dada kalian untuk itu. إِن كُنتُمْ صٰدِقِينَ (jika kamu adalah orang-orang yang benar) Yakni benar dalam apa yang kalian anggap. Dan Allah-lah yang memberi kalian nikmat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Mereka memberikan nikmat kepadamu (yaitu orang-orang Baduwi dengan keislaman mereka). Mereka menganggap bahwa hal itu adalah pemberian dan nikmat dari mereka. Dengan manis mereka berkata: “Anak cucu orang itu ingin membunuhmu, sedangkan kami tidak”. Katakanlah kepada mereka: “Kalian sama sekali tidak memberiku kenikmatan atas Islam kalian, namun Allahlah yang memberi kalian nikmat dengan menuntun dan menolong kalian menuju keimanan, jika kalian memang benar-benar beranggapan sudah beriman.” Al-Munnu adalah mempersiapkan nikmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka merasa berjasa kepadamu dengan keislaman mereka. Katakanlah,“Janganlah merasa berjasa kepadaku dengan keislaman kalian. Sebenarnya Allahlah yang melimpahkan nikmat kepada kalian dengan menunjukkan kalian kepada keimanan, jika kalian adalah orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Ini merupakan kondisi orang yang mengaku beriman padahal sebenarnya tidak. Pengakuan tersebut dilakukan adakalanya untuk mengajari Allah, padahal Allah Maha Mengetahui segala sesuatu, adakalanya juga pengakuan itu dimaksudkan sebagai karunia atas RasulNya dan mereka telah mencurahkan segala sesuatu dan menyumbangkan segala sesuatu yang bukan untuk kepentingan akhiratnya, namun untuk hal-hal keduniaan. Pengakuan ini adalah basa-basi yang tidak baik serta kebanggaan yang tidak sepatutnya dibanggakan pada rasulNya, karena sesungguhnya karunia dan pemberian itu milik Allah semata, karena Allah lah yang memberikan karunia kepada mereka dengan menciptakan mereka, memberi rizki dan berbagai nikmat baik yang Nampak maupun tidak, oleh karena itu pemberian karunia berupa petunjuk agama Islam dan keimanan merupakan karunia yang terbesar. Karena itulah Allah berfirman, “Mereka telah merasa memberi nikmat kepadamu dengan keislaman mereka. Katakanlah, ‘Janganlah kamu merasa telah memberi nikmat kepadaku dengan keislamanmu, sebenarnya Allah, Dia-lah yang melimpahkan nikmat kepadamu dengan menunjuki kamu kepada keimanan jika kamu adalah orang-orang yang benar’.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 17: Ketahuilah wahai nabi Allah sesungguhnya mereka badui mengungkapkan keislaman mereka dengan ketidakjujuran dalam hati mereka karena sebab mereka beriman dengan tanpa berjihad, maka katakanlah wahai nabi mereka: Janganlah kamu merasa telah memberi nikmat kepadaku dengan keislamanmu, sebenarnya Allah, Dialah yang melimpahkan nikmat kepadamu dengan menunjuki kamu kepada keimanan jika kamu adalah orang-orang yang benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 17",
    "description": "Mereka tidak ragu-ragu mengaku bahwa mereka merasa berjasa telah memberi nikmat kepadamu, yakni kepada nabi Muhammad, dengan keislaman mereka. Maka kepada nabi diperintahkan untuk mengatakan kepada mereka: katakanlah, 'janganlah kamu merasa berjasa kepadaku dengan keislamanmu, sebab manfaat keislamanmu bukan kepadaku tetapi untuk kamu sendiri dan sebenarnya Allah yang melimpahkan nikmat kepadamu dengan menunjukkan kamu kepada keimanan, jika kamu orang yang benar dalam ucapanmu. ' sungguh, Allah senantiasa mengetahui apa yang gaib di langit dan di bumi. Dan Allah senantiasa maha melihat apa yang kamu kerjakan. -."
  }
]