[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan syariatNya, janganlah meninggikan suara kalian di atas suara nabi saat kalian berbicara kepadanya, jangan memanggilnya dengan keras seperti panggilan sebagian kalian kepada sebagian lainnnya, bedakanlah dia dalam pembicaraan kalian kepadanya, sebagaimana beliau berbeda dari kalian, karena Allah telah memilih beliau sebagai nabi dan rasulNya, mewajibkan atas kalian beriman kepadanya, mencintainya, menaatinya dan meneladaninya. (semua itu karena) dikhawatirkan amal-amal akan batal sementara kalian tidak menyadarinya dan merasakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Wahai orang yang beriman kepada Allah dan mengikuti apa yang disyariatkan, sopanlah terhadap Rasul-Nya. Janganlah kalian meninggikan suara kalian di atas suara Nabi -ṣallallāhu 'alaihi wa sallam- ketika berbicara dengannya. Jangan kalian memanggil namanya sebagaimana kalian saling memanggil di antara kalian, tetapi panggillah dia dengan sebutan Nabi dan Rasul secara halus, karena dikhawatirkan pahala amal kalian menjadi sia-sia disebabkan hal itu sementara kalian tidak merasa akan batalnya pahala amal perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَرْفَعُوٓا۟ أَصْوٰتَكُمْ فَوْقَ صَوْتِ النَّبِىِّ (Hai orang-orang yang beriman, janganlah kamu meninggikan suaramu melebihi suara Nabi) Sebab itu menunjukkan kurangnya rasa malu dan rasa hormat; sedangkan merendahkan suara merupakan tanda penghormatan dan pemuliaan. وَلَا تَجْهَرُوا۟ لَهُۥ بِالْقَوْلِ كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ(dan janganlah kamu berkata kepadanya dengan suara yang keras, sebagaimana kerasnya suara sebagian kamu terhadap sebagian yang lain) Jika kalian berbicara dengannya. Seperti yang kalian biasa lakukan ketika berbicara dengan sesama kalian. Allah memerintahkan mereka untuk merendahkan suara mereka dan berbicara dengannya dengan penuh ketenangan dan penghormatan. Pendapat lain mengatakan bahwa yang dimaksud adalah janganlah kalian memanggilnya “hai Muhammad” atau “hai Ahmad”, namun panggillah dengan “hai Nabi Allah” atau “hai Rasulullah” sebagai penghormatan baginya. أَن تَحْبَطَ أَعْمٰلُكُمْ(supaya tidak hapus (pahala) amalanmu) Allah melarang mereka mengeraskan suara di hadapannya agar pahala amalan mereka tidak terhapus. وَأَنتُمْ لَا تَشْعُرُونَ(sedangkan kamu tidak menyadari)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Wahai orang-orang yang beriman, jangan kalian tinggikan suara kalian di atas suara nabi saat kalian berbicara untuk menjaga kehormatan dan harga dirinya dan untuk menghindari terjadinya konfik serta untuk memuliakannya dan merendah di hadapannya. Jangan kalian keraskan suara kalian kepadanya sebagaimana kalian berbicara keras dengan sebagian kalian dan janganlah kalian memanggilnya dengan menggunakan namanya saja melainkan dengan sifatnya kenabian dan kerasulannya. Janganlah kalian berbincang dengannya layaknya kalian berbincang dengan sebagian kalian untuk memuliakannya, Hal itu dikhawatirkan akan merusak pahala amal perbuatan kalian sedangkan kalian tidak merasakan bahwa pahala amal kalian hilang dan sia-sia. Qatadah berkata: “Mereka berbicara kepadanya dengan lantang dan meninggikan suara mereka, lalau Allah menurunkan ayat {Laa tarfa’uu ashwaatakum}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah meninggikan suara kalian melebihi suara nabi dan janganlah mengeraskan suaara ketika berkata kepadanya sebagaimana kerasnya suara sebagian kalian terhadap yang lain. Dikhawatirkan akan membatalkan} ditakutkan hal itu membataalkan {amal kalian dan kalian tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Selanjutnya Allah berfirman, “Hai orang-orang yang beriman, janganlah kamu meninggikan suaramu lebih dari suara Nabi, dan janganlah kamu berkata padanya dengan suara keras.” Ini adalah adab terhadap Rasulullah ketika berbicara dengan beliau. Artinya, orang yang berbicara dengan Rasulullah tidak boleh meninggikan suaranya melebihi suara Rasulullah dan tidak boleh mengeraskan suara di hadapan Rasulullah, ketika berbicara dengan Rasulullah suara harus dilirihkan dengan sopan, lembut seraya mengagungkan dan memuliakan, karena Rasulullah bukan seperti salah seorang dari kalian, untuk itu bedakanlah ketika berbicara dengannya sebagaimana kalian membedakan hak-haknya terhadap umatnya, kalian wajib mencintainya dengan kecintaan di mana keimanan tidak bisa sempurna tanpanya. Karena tanpa melaksanakan hal itu dikhawatirkan akan bisa menggugurkan amalan seorang hamba sedangkan dia tidak merasa, sebagaimana beretika terhadap Rasulullah juga merupakan salah satu penyebab mendapatkan pahala dan diterimanya amalan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 2: Kemudian Allah mengarahkan seruan yang lain kepada orang-orang yang beriman, menjelaskan atas kewajiban orang-orang yang beriman untuk menghormati dan memuliakan Rasul ﷺ; di mana Allah melarang meninggikan suara-suara mereka di atas suara Nabi, yaitu ketika di majelis dan di hadapan beliau, maka jika mereka berbicara satu sama lain, Allah melarang mereka untuk mengeraskan ucapannya kepada nabi sebagaimana mereka mengucapkan kepada selain dari nabi. Dan bagi kalian wajib di dalam menyeru, untuk menyeru dengan seruan wahai nabi Allah atau wahai Rasul Allah. kemudian Allah menjelaskan bahwasanya Allah melarang bagi orang-orang yang beriman dari meninggikan suaranya kepada rasul, agar mereka takut akan amalan-amalan mereka yang lebur sedangkan mereka tidak mengetahui dan juga menghitung atas amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abi Mulaikah ia berkata, “Hampir saja dua orang yang dipilih membuat Abu Bakar dan Umar binasa radhiyallahu 'anhuma, keduanya mengeraskan suaranya di hadapan Nabi shallallahu 'alaihi wa sallam ketika rombongan dari Bani Tamim datang kepada Beliau, lalu yang satu menunjuk Aqra’ bin Habis saudara Bani Mujaasyi’, sedangkan yang satu lagi menunjuk yang lain. Nafi’ (perawi hadits) berkata, “Saya tidak hapal namanya.” Lalu Abu Bakar berkata kepada Umar, “Engkau tidak bermaksud selain menyelisihiku.” Umar menjawab, “Aku tidak bermaksud menyelisihimu.” Suara keduanya pun semakin keras dalam hal itu, maka Allah Ta’ala menurunkan ayat, “Wahai orang-orang yang beriman! Janganlah kamu meninggikan suaramu…dst.” Ibnuz Zubair berkata, “Maka Umar tidak lagi memperdengarkan (mengeraskan suaranya) kepada Rasulullah shallallahu 'alaihi wa sallam setelah ayat ini, sampai Beliau meminta kejelasan (kata-katanya).” Ia tidak menyebutkan hal itu dari bapaknya, yakni Abu Bakar (Abdullah bin Abi Mulaikah atau Abdullah bin Az Zubair, tidak menyebutkan dari bapaknya yang tergolong sahabat).” (Syaikh Muqbil menjelaskan, hadits ini diriwayatkan pula oleh Tirmidzi juz 4 hal. 185, dan di sana disebutkan secara tegas bahwa Abdullah bin Abi Mulaikah diceritakan oleh Abdullah bin Az Zubair, dan ia (Tirmidzi) menghasankannya. Demikian pula diriwayatkan oleh Ahmad juz 4 hal. 6, Thabrani juz 26 hal. 119, di sana disebutkan ucapan Nafi’, bahwa Ibnu Abi Mulaikan telah menceritakan kepadanya dari Ibnuz Zubair, sehingga diketahui bersambungnya hadits ini sebagaimana diisyaratkan oleh Al Haafizh dalam Al Fat-h juz 10 hal. 212). Ayat ini merupakan adab terhadap Rasulullah shallallahu 'alaihi wa sallam dalam berbicara dengan Beliau, yakni janganlah orang yang berbicara dengan Beliau meninggikan suaranya di atas suara Beliau, demikian pula jangan mengeraskan suara kepada Beliau, bahkan harus merendahkan suaranya, berbicara kepadanya dengan sopan dan lembut, dengan memuliakan dan menghormati serta mengagungkan, dan agar jangan menganggap Rasulullah shallallahu 'alaihi wa sallam seperti kawan sesama mereka, bahkan mereka harus membedakan Beliau dalam berbicara sebagaimana Beliau harus dibedakan daripada yang lain tentang haknya yang wajib dilakukan oleh umat Beliau, dan wajibnya beriman kepada Beliau serta mencintai Beliau. Hal itu, karena jika tidak melakukan adab tersebut terdapat bahaya dan dikhawatirkan akan hapus amal seorang hamba tanpa disadarinya. Sebaliknya, beradab dengan Beliau termasuk sebab memperoleh pahala dan diterimanya amal. Ketika kamu berbicara. Meninggikan suara lebih dari suara Nabi atau berbicara keras terhadap Nabi adalah suatu perbuatan yang menyakiti Nabi shallallahu 'alaihi wa sallam. Oleh karena itu, dilarang melakukannya dan dapat menyebabkan hapusnya amal perbuatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 2",
    "description": "Ayat ini menekankan tata krama yang harus dipatuhi oleh kaum muslim ketika berbicara dengan rasulullah. Wahai orang-orang yang ber-iman! janganlah kamu meninggikan suaramu melebihi suara nabi pada saat terjadi percakapan antara kamu dengan beliau, dan janganlah kamu berkata kepadanya dengan suara keras sebagaimana kerasnya suara sebagian kamu terhadap yang lain. Janganlah kamu memanggilnya de-ngan namanya, tetapi panggilah beliau dengan panggilan yang disertai penghormatan dan pengagungan. Apabila kamu tidak berlaku hormat kepada nabi, dikhawatirkan nanti, pahala segala amalmu bisa terhapus sedangkan kamu tidak menyadari. 3. Ayat ini menguraikan dampak positif yang diraih oleh mereka yang merendahkan suaranya di hadapan nabi didorong oleh penghormatan kepada beliau. Allah menyatakan, sesungguhnya orang-orang yang senantiasa merendahkan suaranya di sisi rasulullah, didorong oleh motivasi penghormatan dan pengagungan kepada beliau mereka itulah orang-orang tinggi kedudukannya yang telah diuji hatinya yakni dibersihkan oleh Allah dengan bermacam-macam ujian dan cobaan untuk menjadi orang bertakwa. Mereka akan memperoleh ampunan atas kesalahannya dan pahala yang besar atas ketaatan yang dilakukannya."
  }
]