[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang merendahkan suara mereka di depan Rasulullah, mereka adalah orang-orang yang Allah uji hati mereka dan Allah memilihnya untuk menerima takwa. Bagi mereka ampunan dari dosa-dosa mereka dan pahala yang besar, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya orang-orang yang merendahkan suara mereka di sisi Rasulullah -ṣallallāhu 'alaihi wa sallam-, mereka adalah orang-orang yang Allah telah menguji hati mereka untuk ketakwaan kepada-Nya dan menjadikan mereka ikhlas bertakwa kepada-Nya. Bagi mereka pengampunan atas dosa-dosa mereka sehingga Allah tidak membalasnya dan bagi mereka pahala yang besar pada hari Kiamat, yaitu Allah memasukkan mereka ke dalam Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Allah menegaskan pujian-Nya bagi para sahabat yang merendahkan suara ketika di hadapan Rasulullah. Orang-orang yang memiliki derajat yang tinggi itu adalah mereka yang Allah pilih hati mereka untuk bertakwa kepada-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. mereka akan mendapat ampunan atas dosa-dosa mereka dan pahala yang besar berupa surga yang penuh dengan kenikmatan. Kemudian Allah menegaskan celaan bagi orang-orang yang memanggil Rasulullah dari belakang rumah para istri beliau dengan suara yang keras. Allah menyebut kebanyakan dari mereka sebagai orang-orang yang tidak memahami adab berinteraksi dengan Rasulullah dan tidak mengetahui kedudukannya. Ibnu ‘Asyur berkata: Yang dimaksud bahwa mereka tidak berakal adalah tidak memahami adab yang harus mereka lakukan ketika berinteraksi dengan Rasulullah. (at-Tahrir wa at-Tanwir 26/188)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. أُو۟لٰٓئِكَ الَّذِينَ امْتَحَنَ اللهُ قُلُوبَهُمْ لِلتَّقْوَىٰ ۚ (mereka itulah orang-orang yang telah diuji hati mereka oleh Allah untuk bertakwa) Yakni orang-orang yang Allah sucikan hati mereka agar mereka bertakwa, sebagaimana amas yang disucikan dengan api sehingga ketorannya keluar darinya. Demikianlah orang-orang yang senantiasa menghormati Rasulullah dan merendahkan suara mereka di hadapannya demi menjalankan perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sesungguhnya orang-orang yang memelankan suaranya saat berbicara dengan rasulallah itu sedang bersopan santun dengannya. Allah melatih hati mereka agar mampu memikul penderitaan dan beban sehingga mereka dapat ikhlas dalam bertakwa, yaitu berlaku taat dan menajauhi maksiat. Bagi mereka itu ampunan bagi dosa-dosa mereka dan pahala yang agung sebagai balasan atas ketaatan mereka. Ayat ini diturunkan untuk Tsabit bin Qais yang duduk menangi karena takut meninggikan suaranya di atas suara nabi, karena dia memiliki suara yang lantang. Kemudian Rasulallah SAW memanggilnya dan bertanya kepadanya: “Apakah kamu ridha jika dirimu hidup terhormat, mati syahid dan masuk surga?” Dia menjawab: “Aku ridha dan aku tidak akan pernah meninggikan suaraku di atas suara rasulallah SAW” Kemudian Allah menurunkan ayat {Innalladziina yaghudhuuna}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang merendahkan} mengurangi {suaranya di sisi Rasulullah, mereka itulah orang-orang yang telah diuji} diuji {hatinya oleh Allah untuk bertakwa. Bagi mereka itu ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Kemudian Allah memuji orang yang merendahkan suaranya di hadapan Rasulullah bahwasanya Allah menyebutkan bahwa orang seperti ini hatinya tengah diuji untuk ketakwaan sehingga hasilnya bisa terlihat dengan jelas, yaitu hati mereka menjadi layak untuk bertakwa. Selanjutnya Allah menjanjikan ampunan bagi dosanya yang mencakup lenyapnya keburukan dan hal-hal yang tidak diinginkan serta bisa mendatangkan pahala besar yang sifatnya tidak diketahui kecuali hanya Allah semata, yang mencakup didapatkannya semua hal yang diinginkan. Disini terdapat dalil yang menunjukkan bahwa Allah menguji hati dengan perintah, larangan dan ujian. Siapa pun yang terus menunaikan perintah Allah, mencari ridhaNya, menyegerakan hal itu serta mendahulukannya di atas keinginannya, maka ia akan terpilih untuk diberi ketakwaan sehingga hatinya layak untuk bertakwa, namun siapa pun yang tidak seperti itu, maka bisa diketahui bahwa orang itu tidak layak untuk bertakwa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 3: Allah memuji orang-orang yang merendahkan suara-suara mereka di hadapan nabi dan ketika menyeru nabi ﷺ. Allah mengabarkan bahwa mereka yang merendahkan suara-suara mereka di hadapan nabi, mereka adalah orang-orang yang Allah berikan atas hati-hati mereka pelajaran dan keikhlasan untuk bertakwa kepada Allah dan mentaatinya; Allah menjelaskan bahwa mereka orang-orang yang merendahkan suara suara mereka adalah orang-orang yang diampuni dosa-dosa mereka, mendapatkan balasan yang besar dari Allah, yaitu surga Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memuji orang yang merendahkan suaranya di hadapan Rasulullah shallallahu 'alaihi wa sallam, yaitu bahwa Allah menguji hati mereka untuk bertakwa, sehingga jelaslah keadaannya, yaitu menjadi cocoknya hati mereka untuk bertakwa. Allah Subhaanahu wa Ta'aala juga menjanjikan untuk mereka itu ampunan yang di dalamnya mengandung penyingkiran terhadap keburukan dan hal yang tidak diinginkan, serta pahala yang besar yang tidak diketahui sifatnya kecuali oleh Allah Ta’ala, dan dalam pahala yang besar itu terdapat hal yang dicintai hamba. Dalam ayat ini terdapat dalil bahwa Allah Subhaanahu wa Ta'aala menguji hati manusia dengan perintah, larangan dan cobaan-cobaan, maka barang siapa yang tetap mengerjakan perintah Allah dan mengikuti keridhaan-Nya serta bersegera kepadanya dan mendahulukannya di atas keinginan hawa nafsunya, maka menjadi bersih dan sucilah hati tersebut sehingga bisa bertakwa. Jika tidak demikian, maka dapat diketahui, bahwa hatinya tidak cocok untuk bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 3",
    "description": "Ayat ini menguraikan dampak positif yang diraih oleh mereka yang merendahkan suaranya di hadapan nabi didorong oleh penghormatan kepada beliau. Allah menyatakan, sesungguhnya orang-orang yang senantiasa merendahkan suaranya di sisi rasulullah, didorong oleh motivasi penghormatan dan pengagungan kepada beliau mereka itulah orang-orang tinggi kedudukannya yang telah diuji hatinya yakni dibersihkan oleh Allah dengan bermacam-macam ujian dan cobaan untuk menjadi orang bertakwa. Mereka akan memperoleh ampunan atas kesalahannya dan pahala yang besar atas ketaatan yang dilakukannya. 4-5. Setelah ayat yang lalu memuji orang-orang yang berlaku sopan kepada nabi dengan merendahkan suaranya ketika berbicara dengan beliau, ayat ini mengecam orang-orang yang berlaku tidak sopan. Sesungguhnya orang-orang yang memanggil engkau dengan cara yang tidak sopan dari luar kamar kediamanmu dan kediaman istri-istrimu kebanyakan mereka tidak mengerti tata krama penghormatan dan peng-agungan yang seharusnya dilakukan kepadamu. Dan sekiranya mereka bersabar, yakni tidak memanggil-manggil namamu sampai engkau keluar dari kamarmu untuk menemui mereka, tentu akan lebih baik bagi mereka di sisi Allah. Dan itu tidak dilakukan oleh mereka, namun Allah tidak menyiksa mereka. Allah maha pengampun bagi siapa yang bertobat, maha penyayang kepada hamba-Nya yang taat. Berkaitan dengan ayat ini terdapat riwayat bahwa sekelompok rombongan bani tamim datang untuk menemui nabi dan mereka memanggil-manggil dari luar kamarnya, 'hai Muhammad, keluarlah untuk menemui kami'. Nabi dengan berat hati menemui mereka, padahal ketika itu beliau sedang beristirahat. Ayat ini mengecam sikap mereka yang berlaku tidak sopan kepada rasulullah."
  }
]