[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang memanggilmu (wahai Nabi) dari balik kamar-kamarmu dengan suara tinggi, kebanyakan dari mereka tidak memiliki akal yang membuat mereka bersopan santun kepada Rasulullah dan menghormatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya orang-orang yang memanggilmu -wahai Rasul- dari kalangan orang Badui dari balik kamar istri-istrimu, kebanyakan dari mereka tidak berakal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنَّ الَّذِينَ يُنَادُونَكَ مِن وَرَآءِ الْحُجُرٰتِ (Sesungguhnya orang-orang yang memanggil kamu dari luar kamar(mu)) Mereka adalah orang-orang yang keras dari Bani Tamim yang memanggil Rasulullah untuk bersikap angkuh di hadapannya. أَكْثَرُهُمْ لَا يَعْقِلُونَ(kebanyakan mereka tidak mengerti) Karena kebodohan yang mereka miliki dan kerasnya tabiat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya orang-orang yang memanggilmu dari belakang atau dari luar ruangan yang kamu tempati saat istirahat itu kebanyakan adalah orang-orang bodoh yang tidak berpikir tentang apa yang sebaiknya dia jaga kehormatannya, yaitu berupa sopan santun dan hormat kepadamu. Zaid bin Arqam berkata: “Banyak orang Baduwi mendatangi rumah nabi SAW dan memanggil-manggilnya: “Wahai Muhammad, Wahai Muhammad” lalu Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang memanggilmu dari luar kamar} rumah-rumah perempuan kalian {kebanyakan mereka tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Ayat-ayat yang mulia ini turun berkenaan dengan segolongan orang dari kalangan baduwi yang sifatnya disebutkan Allah sebagai berwatak keras, mereka layak untuk tidak mengetahui batasan-batasan yang diturunkan Allah kepada RasulNya. Suatu ketika mereka mendatangi Rasulullah, mereka mendapatkan nabi sedang di dalam kamranya Bersama istri-istrinya, mereka tidak bersabar dan tidak sopan hingga Rasulullah keluar menemui, bahkan mereka memanggil dengan suara keras, “Hai Muhammad, hai Muhammad!” Maksudnya, keluarlah dan temui kami. Allah mencela mereka sebagai orang-orang yang tidak berakal yang tidak mengerti etika sopan santun terhadap Allah dan RasulNya serta tidak menghormatinya, karena di antara tanda orang berakal adalah menggunakan etika bersopan santun, etika sopan santun seseorang adalah tanda bahwa orang itu berakal dan Allah menghendaki kebaikan padanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 4: Ketahuilah wahai nabi Allah bahwasanya mereka yang menyeru engkau dari belakang tempat istri-istri mu dengan suara yang tinggi, adalah mereka yang kebanyakan tidak memiliki akal untuk beradab kepadamu; mereka adalah orang-orang yang memiliki akal tapi tidak digunakan untuk beradab dan juga tidak dapat memahami hingga mereka keluar. Disebutkan oleh ahli tafsir: Bahwasanya 2 ayat yang lalu ( 2 dan 3 ) , turun kepada utusan Bani Tamim yang mereka datang dan diutus kepada nabi. Mereka meninggikan suara kepada nabi di kamar-kamar istri-istri nabi. Bahkan mereka meninggikan suara suara mereka dengan berkata: Wahai Muhammad keluarlah kepada kami, hormatilah kami. Datang juga dari mereka seorang khotib dan penyair dan yang menakjubkan, bahwasanya Rasulullah berbicara dengan halus kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diterangkan dalam Tafsir Al Jalaalain, bahwa ayat ini turun berkenaan dengan orang-orang yang datang di siang hari, sedangkan Nabi shallallahu 'alaihi wa sallam di dalam rumahnya, lalu mereka memanggilnya. Syaikh As Sa’diy berkata, “Beberapa ayat yang mulia ini (ayat 4 dan 5) turun berkenaan dengan beberapa orang Arab badui yang Allah Ta’ala sifati mereka dengan sifat kasar, dan bahwa mereka pantas tidak mengetahui batasan-batasan yang Allah turunkan kepada Rasul-Nya. Mereka datang kepada Rasulullah shallallahu 'alaihi wa sallam sebagai utusan, lalu mereka mendapati Beliau berada dalam rumahnya dan di kamar istrinya. Mereka pun tidak sabar sampai Beliau keluar dan tidak memiliki sopan santun, bahkan memanggil, “Wahai Muhammad, wahai Muhammad!” maksudnya, keluarlah menghadap kami. Maka Allah mencela mereka dengan tidak mengerti, dimana mereka tidak mengerti adab dari Allah terhadap Rasul-Nya shallallahu 'alaihi wa sallam dan tentang menghormatinya, sebagaimana termasuk berakal dan menjadi tandanya adalah mempraktekkan sopan santun. Oleh karena itu, beradabnya seorang hamba merupakan tanda berakalnya dan bahwa Allah menginginkan kebaikan padanya. Maka dari itu, Allah Subhaanahu wa Ta'aala berfirman, “Dan sekiranya mereka bersabar sampai engkau keluar menemui mereka, tentu akan lebih baik bagi mereka. Dan Allah Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 4",
    "description": "4-5. Setelah ayat yang lalu memuji orang-orang yang berlaku sopan kepada nabi dengan merendahkan suaranya ketika berbicara dengan beliau, ayat ini mengecam orang-orang yang berlaku tidak sopan. Sesungguhnya orang-orang yang memanggil engkau dengan cara yang tidak sopan dari luar kamar kediamanmu dan kediaman istri-istrimu kebanyakan mereka tidak mengerti tata krama penghormatan dan peng-agungan yang seharusnya dilakukan kepadamu. Dan sekiranya mereka bersabar, yakni tidak memanggil-manggil namamu sampai engkau keluar dari kamarmu untuk menemui mereka, tentu akan lebih baik bagi mereka di sisi Allah. Dan itu tidak dilakukan oleh mereka, namun Allah tidak menyiksa mereka. Allah maha pengampun bagi siapa yang bertobat, maha penyayang kepada hamba-Nya yang taat. Berkaitan dengan ayat ini terdapat riwayat bahwa sekelompok rombongan bani tamim datang untuk menemui nabi dan mereka memanggil-manggil dari luar kamarnya, 'hai Muhammad, keluarlah untuk menemui kami'. Nabi dengan berat hati menemui mereka, padahal ketika itu beliau sedang beristirahat. Ayat ini mengecam sikap mereka yang berlaku tidak sopan kepada rasulullah"
  }
]