[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya mereka bersabar hingga kamu keluar menemui mereka, niscaya hal itu lebih baik bagi mereka di sisi Allah, karena Allah telah memerintahkan mereka agar memuliakanmu. Allah Maha Pengampun terhadap dosa-dosa dari pelanggaran etika yang mereka lakukan karena tidak tahu, lagi Maha Penyayang kepada mereka karena Allah tidak menyegerakan azab kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kalau saja orang-orang yang memanggilmu -wahai Rasul- dari balik kamar-kamar istri-istrimu mau bersabar, dan mereka tidak memanggilmu hingga engkau keluar untuk menemui mereka, lalu mereka berkata kepadamu dengan suara yang pelan, niscaya hal itu akan lebih baik bagi mereka daripada memanggilmu dari balik kamar-kamar, karena di dalamnya terdapat penghormatan yang besar. Dan Allah Maha Pengampun atas dosa-dosa orang yang bertobat dari mereka atau dari selain mereka, dan Maha Pengampun kepada mereka karena ketidaktahuan mereka dan Maha Penyayang kepada mereka"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Seandainya orang-orang yang mengeraskan suara itu menunggu Rasulullah hingga keluar rumah untuk menemui mereka, maka itu lebih baik bagi mereka di sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَلَوْ أَنَّهُمْ صَبَرُوا۟ حَتَّىٰ تَخْرُجَ إِلَيْهِمْ لَكَانَ خَيْرًا لَّهُمْ ۚ (Dan kalau sekiranya mereka bersabar sampai kamu keluar menemui mereka sesungguhnya itu lebih baik bagi mereka) Yakni lebih baik bagi agama dan dunia mereka, karena menjaga adab yang baik terhadap Rasulullah dan menjaga kedudukannya yang mulia, serta menjalankan penghormatan kepada orang yang berhak mendapatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Meskipun mereka tengah menunggu kamu keluar, sesungguhnya kesabaran mereka lebih baik daripada keburu-buruan mereka. Dimana di dalamnya terdapat tata krama dan suatu pengagungan terhadap derajatmu. Allah adalah Dzat yang luas ampunanNya bagi orang-orang yang meminta ampunan dan memiliki keluasan rahmat bagi orang-orang yang bertaubat. Hal ini hanya sebatas nasehat dan teguran bagi orang-orang yang buruk tata kramanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya mereka bersabar sampai kamu keluar menemui mereka, sungguh itu lebih baik bagi mereka. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Karena itulah Allah berfirman, “Dan kalau sekiranya mereka bersabar sampai kamu keluar menemui mereka sesungguhnya itu adalah lebih baik bagi mereka, dan Allah Maha Pengampun lagi Maha Penyayang.” Yakni, Maha Pengampun atas segala dosa yang dilakukan hamba-hambaNya serta sikapnya yang tidak beradab, Maha Penyayang terhadap mereka karena tidak menyegerakan azab karena dosa-dosa yang mereka lakukan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 5: Ketahuilah wahai nabi Allah seandainya mereka itu adalah orang-orang yang meninggikan suara mereka di balik kamar-kamar istri-istri mu, perintahkan mereka untuk bersabar sampai engkau keluar menemui mereka, dan sungguh perkara mereka menjadi baik di sisi Allah,. Oleh karena itu Allah memberikan ampunan kepada mereka dengan kasih sayang-Nya. Dan sungguh Allah mengampuni hamba-hambanya yang melakukan keburukan ketika hamba tersebut bertaubat rujuk kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengampuni dosa yang muncul dari hamba-Nya dan sikap kurang adabnya, serta Maha Penyayang kepada mereka, dimana Dia tidak segera menyiksa mereka karena dosa-dosa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 5",
    "description": "4-5. Setelah ayat yang lalu memuji orang-orang yang berlaku sopan kepada nabi dengan merendahkan suaranya ketika berbicara dengan beliau, ayat ini mengecam orang-orang yang berlaku tidak sopan. Sesungguhnya orang-orang yang memanggil engkau dengan cara yang tidak sopan dari luar kamar kediamanmu dan kediaman istri-istrimu kebanyakan mereka tidak mengerti tata krama penghormatan dan peng-agungan yang seharusnya dilakukan kepadamu. Dan sekiranya mereka bersabar, yakni tidak memanggil-manggil namamu sampai engkau keluar dari kamarmu untuk menemui mereka, tentu akan lebih baik bagi mereka di sisi Allah. Dan itu tidak dilakukan oleh mereka, namun Allah tidak menyiksa mereka. Allah maha pengampun bagi siapa yang bertobat, maha penyayang kepada hamba-Nya yang taat. Berkaitan dengan ayat ini terdapat riwayat bahwa sekelompok rombongan bani tamim datang untuk menemui nabi dan mereka memanggil-manggil dari luar kamarnya, 'hai Muhammad, keluarlah untuk menemui kami'. Nabi dengan berat hati menemui mereka, padahal ketika itu beliau sedang beristirahat. Ayat ini mengecam sikap mereka yang berlaku tidak sopan kepada rasulullah. 6. Setelah kelompok ayat-ayat yang lalu menguraikan tuntunan bagai-mana bertatakrama dengan rasullah, kelompok ayat ini menguraikan bagaimana berlaku dengan sesama manusia, termasuk kepada orang fasik. Diawali dengan tuntunan bagaimana menghadapi orang fasik, Allah berfirman, wahai orang-orang yang beriman! jika seseorang yang fasik datang kepadamu membawa suatu berita yang penting, maka ja-nganlah kamu tergesa-gesa menerima berita itu, tetapi telitilah terlebih dahulu kebenarannya. Hal ini penting dilakukan agar kamu tidak mence-lakakan suatu kaum karena kebodohan atau kecerobohan kamu mengikuti berita itu yang akhirnya kamu menyesali perbuatanmu itu yang terlanjur kamu lakukan. Ayat ini memberikan tuntunan kepada kaum muslim agar berhati-hati dalam menerima berita terutama jika bersumber dari orang yang fasik. Perlunya berhati-hati dalam menerima berita adalah untuk menghindarkan penyesalan akibat tindakan yang diakibatkan oleh berita yang belum diteliti kebenarannya."
  }
]