[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila orang fasik datang kepada kalian dengan membawa sebuah berita, maka periksalah beritanya sebelum membenarkan dan menukilnya agar kalian mengetahui kebenarannya, dihawatirkan kalian bisa melakukan tindakan zhalim terhadap suatu kaum yang tidak bersalah, akibatnya kalian akan menyesalinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Wahai orang-orang yang beriman kepada Allah dan mengerjakan apa yang disyariatkan, jika seorang yang fasik datang kepadamu dengan membawa kabar tentang suatu kaum maka periksalah kebenaran kabar berita tersebut dan janganlah tergesa-gesa membenarkannya, karena dikhawatirkan kalian akan menimpakan musibah kepada suatu kaum tanpa kalian ketahui yang sebenarnya apabila kalian membenarkan kabar itu tanpa menelitinya terlebih dahulu, sehingga setelah menimpakan musibah kepada mereka kalian menjadi menyesal ketika mengetahui kebohongan kabar itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah memperingatkan orang-orang beriman dari kabar yang dibawa oleh orang fasik, mereka harus memastikan kebenaran kabar itu sebelum mempercayai dan menyebarkannya, agar kabar ini tidak menjerumuskan mereka ke dalam perbuatan zalim terhadap orang yang tidak bersalah, sehingga mereka menjadi menyesal akibat sifat terburu-buru."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِن جَآءَكُمْ فَاسِقٌۢ ( jika datang kepadamu orang fasik) Orang fasik adalah orang yang banyak berbuat dosa. Sebab mereka tidak mempedulikan lagi kebohongan yang mereka lakukan. بِنَبَإٍ (membawa suatu berita) Yakni berita yang mengandung mudharat bagi seseorang. فَتَبَيَّنُوٓا۟ أَن تُصِيبُوا۟ قَوْمًۢا بِجَهٰلَةٍ (maka periksalah dengan teliti agar kamu tidak menimpakan suatu musibah kepada suatu kaum tanpa mengetahui keadaannya) Yakni pastikanlah kebenarannya. Dan termasuk dari memastikan adalah bersikap tenang tanpa tergesa-gesa, dan memperhatikan urusan yang terjadi dan berita yang ada, sehingga dapat jelas kebenarannya. فَتُصْبِحُوا۟ عَلَىٰ مَا فَعَلْتُمْ (sehingga atas perbuatanmu itu) Agar kalian tidak menimpakan mudharat kepada mereka yang tidak harus mereka dapatkan. نٰدِمِينَ(kamu menjadi menyesal) Atas apa yang kalian timpakan dengan salah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Wahai orang-orang yang beriman, jika kalian mendapatkan berita penting dari orang fasik yang telah menyimpang dari batas-batas agama maka jangan tergesa-gesa untuk percaya, namun carilah penjelasan sebenarnya dan pastikanlah kebenaran berita itu sebelum terpengaruh olehnya. Dikhawatirkan kalian yang merupakan kaum tidak bersalah ikut tertimpa keburukan dan hal-hal yang makruh sehingga kalian menyesal dan bersedih atas kesalahan yang kalian perbuat dan berharap hal itu tidak pernah terjadi. Ayat ini diturunkan untuk Walid bin ‘Uqbah bin Abi Mu’aith yang diutus Rasulallah SAW kepada Bani Mushthaliq sebagai orang kepercayaan (untuk mengambil zakat kambing). Saat mereka mendengar hal itu, mereka mendekatinya, lalu ‘Uqbah takut dengan mereka dan kembali. Dia berkata: “Sesungguhnya kaum itu ingin membunuhku dan mencegah sedekah mereka”, Lalu Rasulallah SAW ingin menyerang mereka, kemudian datanglah utusan mereka dan berkata: “Wahai Rasulallah, kami mendengar utusanmu, lalu kami mendekatinya untuk memuliakannya dan mau melaksanakan apa yang dia sampaikan, yaitu sedekah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jika seorang fasik datang kepada kalian membawa berita} berita {maka pastikanlah kebenarannya} maka pastikanlah kebenaran beritanya {agar kalian tidak mencelakakan} dikhawatirkan kalian akan mencelakai {suatu kaum karena ketidaktahuan, sehingga kalian menyesali perbuatan kalian itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Ini juga merupakan adab dan sopan santun yang harus diteladani dan dilakukan oleh orang-orang yang berakal, yaitu ketika ada orang yang fasik membawa suatu berita, hendaklah berita itu dicek dan tidak diterima begitu saja, karena hal itu bisa menimbulkan bahaya yang besar serta menjerumuskan dalam lembah dosa. Karena berita yang dibawa orang fasik itu jika disamakan dengan berita yang dibawa orang terpercaya dan lurus serta hukumnya dilakukan berdasarkan berita tersebut, maka hal itu akan membahayakan jiwa dan harta tanpa haknya disebabkan oleh berita itu yang menimbulkan penyesalan. Yang harus dilakukan ketika ada berita yang dibawa orang fasik adalah dicek dan diperjelas, jika terdapat berbagai bukti serta indikasi atas kebenaran berita itu, maka diamalkan dan dipercayai, namun jika berbagai bukti serta indikasi menunjukkan kebohongan berita itu, maka tidak boleh dilaksanakan dan harus didustakan. Di sini juga terdapat dalil yang menunjukkan bahwa berita orang jujur itu bisa diterima, berita pendusta ditolak, sedangkan berita orang fasik harus ditahan terlebih dahulu sebagaimana yang telah dijelasan di atas. Karena itulah banyak ulama salaf yang menerima riwayat orang-orang Khawarij yang dikenal sebagai orang-orang jujur meski mereka adalah orang-orang fasik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 6: Kemudian Allah menegur kabar-kabar yang tidak benar dengan berkata: Wahai orang-orang yang beriman kepada Allah dan rasulnya, jika telah datang kepada kalian orang-orang fasik yang mereka tidak pernah kalian anggap sebagai pembohong akan kabar yang dibawanya, maka benarkanlah atas apa yang telah kalian dengar dari mereka. Periksalah oleh kalian akan kebenaran apa yang mereka katakan khususnya bagi kabar-kabar yang penting agar supaya tidak menjadikan kaummu permusuhan dan kejahatan sehingga berakibat penyesalan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini juga sama menerangkan adab yang harus diperhatikan oleh orang-orang yang berakal, yaitu apabila ada orang fasik yang memberitahukan kepada mereka suatu berita, maka hendaknya mereka menelitinya dan tidak langsung menerima beritanya, karena jika demikian terdapat bahaya yang besar dan terjatuh ke dalam dosa. Hal itu karena jika berita orang fasik menempati posisi berita orang yang yang benar lagi adil sehingga dibenarkan dan dilanjutkan konsekwensinya tentu akan menimbulkan bahaya, seperti binasanya jiwa dan harta tanpa alasan yang benar sehingga membuat seseorang menyesal. Oleh karena itu, yang wajib dalam menerima berita orang fasik adalah tatsabbut (meneliti), jika ada dalil dan qarinah (tanda) yang menunjukkan kebenarannya, maka diberlakukan dan dibenarkan. Tetapi jika dalil dan qarinah menunjukkan kedustaannya, maka didustakan dan tidak diberlakukan. Dalam ayat ini terdapat dalil bahwa berita orang yang jujur adalah diterima dan bahwa berita orang yang berdusta adalah ditolak, sedangkan berita orang fasik, maka tergantung dalil dan qarinah. Oleh karena itulah, kaum salaf sampai menerima banyak riwayat dari orang-orang Khawarij yang terkenal kejujurannya meskipun fasik, demikianlah yang diterangkan oleh Syaikh As Sa’diy."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 6",
    "description": "Setelah kelompok ayat-ayat yang lalu menguraikan tuntunan bagai-mana bertatakrama dengan rasullah, kelompok ayat ini menguraikan bagaimana berlaku dengan sesama manusia, termasuk kepada orang fasik. Diawali dengan tuntunan bagaimana menghadapi orang fasik, Allah berfirman, wahai orang-orang yang beriman! jika seseorang yang fasik datang kepadamu membawa suatu berita yang penting, maka ja-nganlah kamu tergesa-gesa menerima berita itu, tetapi telitilah terlebih dahulu kebenarannya. Hal ini penting dilakukan agar kamu tidak mence-lakakan suatu kaum karena kebodohan atau kecerobohan kamu mengikuti berita itu yang akhirnya kamu menyesali perbuatanmu itu yang terlanjur kamu lakukan. Ayat ini memberikan tuntunan kepada kaum muslim agar berhati-hati dalam menerima berita terutama jika bersumber dari orang yang fasik. Perlunya berhati-hati dalam menerima berita adalah untuk menghindarkan penyesalan akibat tindakan yang diakibatkan oleh berita yang belum diteliti kebenarannya. 7-8. Selanjutnya ayat ini memberi nasihat kepada orang yang beriman untuk mengikuti rasulullah dalam semua petunjuknya. Dan ketahuilah olehmu bahwa di tengah-tengah kamu ada rasulullah, yang sepatutnya dihormati dan dipatuhi semua petunjuknya karena beliau senantiasa dalam bimbingan wahyu ilahi. Kalau dia menuruti kemauan kamu dalam banyak hal, pasti kamu akan mendapatkan kesusahan. Tetapi dengan bimbingan rasulullah, Allah menjadikan kamu, wahai para sahabat yang setia, cinta kepada keimanan dan menjadikan iman itu indah dalam hatimu sehingga kamu mudah menjaga diri dari dosa serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan sehingga mudah bagi kamu melakukan ketaatan. Mereka itulah orang-orang yang mengikuti secara mantap jalan yang lurus. Hal yang demikian itu adalah sebagai karunia dan nikmat dari Allah. Dan Allah maha mengetahui siapa yang pantas mendapat anugerah-Nya, mahabijaksana dalam mengatur se-gala urusan."
  }
]