[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketahuilah, bahwa diantara kalian ada Rasulullah, bersikaplah sopan kepadanya, sesungguhnya dia lebih mengetahui tentang apa yang baik bagi kalian daripada diri kalian sendiri, dia menginginkan kebaikan bagi kalian, sedangkan kalian terkadang menginginkan keburukan dan kemudaratan yang tidak disetujui oleh Rasulullah. Seandainya Rasulullah menuruti kalian dalam banyak perkara yang kalian inginkan, niscaya ia membuat kalian kesulitan, tetapi Allah membuat hati kalian mencintai iman dan memandangnya baik, maka kalian pun beriman, dan Allah membuat hati kalian membenci kekafiran, keluar dati ketaatan kepada-Nya dan kemaksiatan. Orang-orang yang memiliki sifat-sifat di atas adalah orang-orang yang lurus yang berjalan di atas jalan yang benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Ketahuilah -wahai orang-orang yang beriman- bahwa di tengah kalian ada Rasulullah yang kepadanya diturunkan wahyu, maka hati-hatilah dari berdusta sehingga wahyu diturunkan kepadanya, mengabarkan tentang kedustaan kalian. Beliau lebih mengetahui apa yang menjadi maslahat bagi kalian. Jika beliau menerima sebagian besar usulan kalian niscaya kalian akan terjerumus ke dalam kesulitan yang tidak diridainya untuk kalian. Akan tetapi Allah dengan anugerah-Nya telah menjadikan kalian mencintai keimanan dan menjadikan keimanan ini terasa indah di hati kalian sehingga kalian beriman, serta menjadikan kalian membenci kekufuran, keluar dari ketaatan, dan juga menjadikan kalian membenci kemaksiatan terhadap-Nya. Orang-orang yang mempunyai sifat-sifat demikian adalah orang-orang yang meniti jalan yang lurus dan benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Hai orang-orang beriman, ketahuilah bahwa di antara kalian terdapat Rasulullah, maka agungkan dan hormatilah dia, dan taatilah perintahnya; sebab dia lebih mengetahui kemaslahatan bagi kalian, karena Allah tidak memerintahkan rasul-Nya melainkan sesuatu yang mendatangkan kemaslahatan. Andai saja Rasulullah mengikuti usulan kalian dalam banyak perkara, niscaya kalian akan jatuh ke dalam kesusahan dan kesulitan; akan tetapi Allah -dengan karunia-Nya- membuat kalian mencintai keimanan dan menghiasinya dalam hati kalian, dan membuat kalian benci segala bentuk kesesatan, seperti kekafiran, kemaksiatan, dan keengaanan melakukan ketaatan. Orang-orang yang memiliki derajat yang tinggi itu adalah orang-orang yang mendapat petunjuk kepada kebenaran. Petunjuk ini merupakan karunia yang mulia dan kenikmatan dari Allah. Allah Maha Mengetahui segala keadaan hamba-hamba-Nya dan Maha Bijaksana dalam mengatur urusan mereka. Dari Abu Sa’id al-Khudri, ketika ia membaca ayat: وَٱعْلَمُوٓا۟ أَنَّ فِيكُمْ رَسُولَ ٱللَّهِ ۚ لَوْ يُطِيعُكُمْ فِى كَثِيرٍ مِّنَ ٱلْأَمْرِ لَعَنِتُّمْ Dan ketahuilah olehmu bahwa di kalanganmu ada Rasulullah. Kalau ia menuruti kemauanmu dalam beberapa urusan benar-benarlah kamu mendapat kesusahan. Ia berkata: “Ayat ini menjelaskan antara Nabi Muhammad sang penerima wahyu dengan para pemimpin terbaik kalian. Seandainya Rasulullah mengikuti mereka dalam banyak perkara, niscaya mereka akan terjerumus dalam kesulitan. Maka bagaimana halnya dengan kalian saat ini?” (Diriwayatkan oleh at-Tirmidzi dan ia berkata hadits ini hasan shahih gharib. as-Sunan 5/388-389, kitab tafsir, bab surat al-Hujurat, no. 3269. Dishahihkan oleh al-Albani dalam Shahih Sunan at-Tirmidzi)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَاعْلَمُوٓا۟ أَنَّ فِيكُمْ رَسُولَ اللهِ ۚ (Dan ketahuilah olehmu bahwa di kalanganmu ada Rasulullah) Maka janganlah kalian mengatakan ucapan yang batil, dan janganlah kalian tergesa-gesa ketika mendengar suatu kabar tanpa memastikan kebenarannya. لَوْ يُطِيعُكُمْ فِى كَثِيرٍ مِّنَ الْأَمْرِ لَعَنِتُّمْ(Kalau ia menuruti kemauanmu dalam beberapa urusan benar-benarlah kamu mendapat kesusahan) Yakni seandainya ia mengikuti kabar-kabar dan pendapat-pendapat kalian yang sering kali tidak benar, niscaya kalian akan terjerumus ke dalam kesusahan, dosa, dan kebinasaan; namun ia sering kali tidak mengikuti kemauan kalian sebelum jelas kebenarannya dan tidak terburu-buru menyikapi kabar yang sampai padanya sebelum mencermatinya. وَلٰكِنَّ اللهَ حَبَّبَ إِلَيْكُمُ الْإِيمٰنَ(tetapi Allah menjadikan kamu cinta kepada keimanan) Yakni Allah menjadikan keimanan sebagai hal yang paling kalian cintai, sehingga kalian tidak berbuat melainkan sesuai dengan keimanan, seperti melakukan perbuatan yang baik dan tidak terburu-buru menyebarkan berita tanpa memastikan kebenarannya. وَزَيَّنَهُۥ فِى قُلُوبِكُمْ(dan menjadikan keimanan itu indah di dalam hatimu) Yakni Allah menjadikannya baik berkat taufik-Nya. وَكَرَّهَ إِلَيْكُمُ الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ۚ( serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan) Yakni Allah menjadikan semua itu sebagai sesuatu yang kalian benci. أُو۟لٰٓئِكَ هُمُ الرّٰشِدُونَ(Mereka itulah orang-orang yang mengikuti jalan yang lurus) Makna (الرشد) yakni beristiqamah di atas jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Ketahuilah wahai orang-orang mukmin bahwa di antara kalian itu ada rasulallah, maka janganlah kalian berkata bathil, karena sesungguhnya Allah akan memberitahunya tentang hal itu. Kalau dia menuruti banyak perkara yang kalian beritahukan kepadanya dan itu berbeda dengan kenyataan, maka kalian pasti berada dalam kesusahan, yaitu kesusahpayahan dan penderitaan, serta kehancuran dan kesakitan. Akan tetapi Allah memperbaiki keimanan kalian, membuat kalian cinta pada keimanan, menanamkannya di dalam hati kalian, dan membuat kalian membenci kekufuran (menyelubungi nikmat Allah SWT dengan mengingkarinya), kefasikan (keluar dari batas-batas agama. yang dimaksud disini adalah kebohongan), dan kemaksiatan (pertentangan, kemaksiatan dan perbuatan dosa. Kata ini merupakan sesuatu yang umum untuk menyebut sesuatu yang khusus). Sebagian orang yang dijelaskan itu adalah orang-orang yang berpegang teguh pada agama mereka dan orang-orang yang ditunjukkan kepada keutamaan dan sopan santun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah bahwa di tengah-tengah kalian ada Rasulullah. Seandainya dia menuruti kalian dalam banyak hal, sungguh kalian akan kesusahan} sungguh kalian akan terjerumus dalam kesusahan {Akan tetapi Allah menjadikan kalian cinta pada keimanan dan menjadikannnya indah} menjadikannya bagus {dalam hati kalian serta menjadikan kalian benci pada kekufuran, kefasikan, dan kemaksiatan. Mereka itulah orang-orang yang mengikuti jalan kebenaran} orang-orang yang berjalan di jalan petunjuk dan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Artinya, hendaklah kalian mengetahui bahwa “Rasulullah,” ada di tengah-tengah kalian, dialah Rasul mulia, lagi baik dan berakal yang menginginkan kebaikan pada kalian, menasihati kalian, di mana kalian menginginkan keburukan serta kejelekan terhadap diri kalian sendiri, namun hal itu tidak sesuai dengan yang dikehendaki Rasulullah. “ Kalau menuruti (kemauan) kamu dalam beberapa urusan,” tentu akan terasa berat dan membebani kalian, tapi Rasulullah menunjukkan kalian. Dan Allah menjadikan kalian cinta kepada “keimanan dan menjadikan iman itu indah dalam hatimu,” karena rasa cinta terhadap kebenaran serta lebih mengedepankan kebenaran yang tertanam dalam benak kalian serta tegaknya hati di atas kebenaran dengan berbagai saksi dan dalil yang menunjukkan kebenarannya serta diterimanya oleh hati dan fitrah serta pertolongan yang diberikan Allah kepada kalian agar kalian kembali kepadaNya. Allah menjadikan “kamu benci kepada kekafiran dan kefasikan,” yaitu dosa-dosa besar, “dan kedurhakaan,” yaitu dosa-dosa kecil karena rasa benci terhadap keburukan yang ditanamkan Allah dalam hati kalian, kalian tidak ingin untuk melakukannya serta berbagai dalil dan saksi yang ditegakkan oleh Allah yang menunjukkan rusak dan berbahayanya hal itu serta tidak sesuai dan tidak bisa diterima oleh fitrah, serta karena Allah menanamkan kebencian pada hati kalian untuk tidak menyukai hal itu. “Mereka itulah,” orang-orang yang hatinya dihiasi oleh Allah dengan keimanan dan Allah menjadikan keimanan itu dicintai oleh mereka dan menjadikan mereka membenci kekufuran, kefasikan, dan kedurhakaan, “orang-orang yang mengikuti jalan yang lurus,” yakni orang-orang yang ilmu dan amalnya baik, tegak di atas Agama dan jalan yang lurus. Kebalikan dari mereka adalah orang-orang sesat yang di dalam hatinya diberi rasa senang terhadap kekufuran, kefasikan, dan kedurhakaan serta benci terhadap keimanan. Dosa yang mereka lakukan itu adalah dosa mereka sendiri, sebab ketika mereka berbuat kefasikan, maka kefasikan itu dibentuk oleh Allah dalam hati mereka, ketika mereka sesat, maka Allah menyesatkan hati mereka, dank arena mereka tidak beriman pada kebenaran yang datang pada mereka pada pertama kalinya, maka Allah membalikkan hati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 7: Ketahuilah Wahai orang-orang yang beriman bahwasanya Nabi yang Allah utus dirinya memberikan petunjuk kepada kalian menuju kebenaran dan jalan yang lurus; Maka seandainya kalian tidak mentaati Rasul ﷺ dalam banyak perkara yang kalian dengar darinya, sungguh kalian akan mendapatkan musibah. Akan tetapi Allah mengunggulkan bagi kalian dan mencintai kalian yang beriman yang memiliki kebaikan di dalam hati-hati kalian. Dan Allah benci dari kalian yang kafir yang keluar dari agama Allah dan orang-orang yang fasik yaitu orang-orang yang keluar dari ketaatan kepada Allah, bermaksiat kepada Allah dan rasul-Nya serta perintah keduanya, maka mereka orang-orang yang disifati dengan sifat ini mereka adalah orang-orang yang mendapatkan petunjuk menuju jalan kebenaran yang lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni hendaknya kamu tetap mengetahui, bahwa Rasulullah shallallahu 'alaihi wa sallam masih berada di tengah-tengah kamu; dimana Beliau adalah orang yang baik, mulia, cerdas dan menginginkan kebaikan bagi kamu, sedangkan kamu menginginkan yang buruk bagimu yang Beliau tidak setuju dengannya. Kalau sekiranya, Beliau menaati kamu dalam banyak hal, tentu yang demikian akan memberatkan kamu dan menyusahkan kamu, akan tetapi Beliau membimbing dan memilihkanyang terbaik bagimu. Dan Allah Ta’ala yang menjadikan kamu cinta kepada keimanan dan menghiasinya di hati kamu. Dia telah menanamkan ke dalam hatimu rasa cinta kepada kebenaran dan mengutamakannya, disamping Dia telah menegakkan syahid (penguat) dan bukti yang menunjukkan kebenarannya, dan siapnya hati serta fitrah untuk menerimanya. Demikian juga karena Dia telah memberikan taufik kepada kamu untuk kembali kepada-Nya, dan karena Dia telah membuat kamu benci kepada kekafiran dan kefasikan (dosa-dosa besar) serta kemaksiatan (dosa-dosa kecil), Dia telah menanamkan rasa benci terhadapnya ke dalam hatimu, tidak ada keinginan untuk melakukannya dan karena Dia telah menegakkan dalil dan syahid yang menunjukkan kebatilannya, disamping itu, fitrah juga tidak mau menerimanya. Oleh karena itu, janganlah berkata yang batil, karena Allah akan memberitahukannya segera. Seperti mengikuti berita yang kamu sampaikan yang tidak sesuai dengan kenyataan. Bisa juga diartikan, tentu kamu berdosa, bukan Beliau. Yaitu orang-orang yang telah dihiasi (dijadikan indah) oleh Allah keimanan dalam hatinya, dibuat cinta kepadanya, serta dibuat benci kepada kekafiran, kefasikan dan kemaksiatan. Yaitu mereka yang baik ilmu dan amalnya, tetap lurus di atas agama dan jalan yang lurus. Kebalikan dari mereka adalah orang-orang yang sesat, dimana Dia telah menjadikan mereka cinta kepada kekafiran, kefasikan dan kemaksiatan serta menjadikan mereka benci kepada keimanan. Dosanya adalah dosa mereka, karena ketika mereka berbuat fasik, maka Allah Subhaanahu wa Ta'aala mengunci hati mereka sebagaimana firman-Nya, ”Wa lammaa zaaghu azaaghallahu quluubahum” (ketika mereka menyimpang, maka Allah menyimpangkan hati mereka), dan karena mereka tidak beriman kepada kebenaran saat ia datang pada pertama kali, maka Allah balikkan hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 7",
    "description": "7-8. Selanjutnya ayat ini memberi nasihat kepada orang yang beriman untuk mengikuti rasulullah dalam semua petunjuknya. Dan ketahuilah olehmu bahwa di tengah-tengah kamu ada rasulullah, yang sepatutnya dihormati dan dipatuhi semua petunjuknya karena beliau senantiasa dalam bimbingan wahyu ilahi. Kalau dia menuruti kemauan kamu dalam banyak hal, pasti kamu akan mendapatkan kesusahan. Tetapi dengan bimbingan rasulullah, Allah menjadikan kamu, wahai para sahabat yang setia, cinta kepada keimanan dan menjadikan iman itu indah dalam hatimu sehingga kamu mudah menjaga diri dari dosa serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan sehingga mudah bagi kamu melakukan ketaatan. Mereka itulah orang-orang yang mengikuti secara mantap jalan yang lurus. Hal yang demikian itu adalah sebagai karunia dan nikmat dari Allah. Dan Allah maha mengetahui siapa yang pantas mendapat anugerah-Nya, mahabijaksana dalam mengatur se-gala urusan"
  }
]