[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kebaikan yang mereka dapatkan ini merupakan karunia Allah dan nikmatNya. Allah Maha Mengetahui siapa yang mensyukuri nikmatNya lagi Mahabijaksana dalam mengatur urusan-urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Apa yang terjadi pada kalian -berupa memandang indah kebaikan di hati kalian dan membenci kejahatan- merupakan anugerah dari Allah yang dianugerahkan kepada kalian dan merupakan kenikmatan yang diberikan kepada kalian. Allah Maha Mengetahui hamba-hamba-Nya yang mensyukuri nikmat-Nya, lalu Dia memberikan taufik kepada-Nya, dan Maha Bijaksana karena telah meletakkan segala sesuatu pada tempat yang sesuai dengannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَضْلًا مِّنَ اللهِ وَنِعْمَةً ۚ (sebagai karunia dan nikmat dari Allah) Yakni Allah menjadikan kalian cinta dan benci kepada hal-hal tersebut berkat karunia dan rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Allah membuat kalian cinta dengan apa yang dicintaiNya dan membenci apa yang dibenciNya itu merupakan keutamaan dan nikmat dariNya. Allah itu Maha Mengetahui urusan-urusan dan keadaan hambaNya yang berbeda-beda dan Maha Bijaksana dalam menciptakan hal itu untuk mereka dengan memberi kenikmatan dan pertolongan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jalan petunjuk dan kebenaran {sebagai karunia dan nikmat dari Allah. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Firman Allah, “Itu adalah sebagai karunia dan nikmat dari Allah.” Artinya, kebaikan yang mereka dapatkan itu merupakan karunia dan kebaikan Allah kepada mereka, bukan karena usaha dan kekuatan mereka. “Dan Allah Maha Mengetahui lagi Mahabijaksana,” yakni, Maha Mengetahui orang yang bersyukur atas nikmatNya sehingga akan diberi pertolongan untuk mendapatkannya, berbeda dengan orang yang tidak bersyukur sehingga kenikmatan itu tidak layak untuknya sehingga karunia Allah pun lenyap sesuai dengan kebijaksanaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 8: Ketahuilah wahai orang-orang yang beriman, bahwasanya kebaikan yang Allah berikan ini adalah kecintaan terhadap kalian dan kemudahan bagi kalian serta pertolongan bagi kalian serta keburukan yang Allah palingkan dari kalian. Sesungguhnya semua kebaikan itu adalah karunia dari Allah kepada kalian dan kebaikan dari-Nya. Sesungguhnya Allah Maha mengetahui atas hamba-Nya dan apa yang bermanfaat bagi mereka, Allah Maha Bijaksana dalam mengatur urusan makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, kebaikan yang diperoleh mereka adalah karena karunia Allah dan ihsan-Nya kepada mereka, bukan karena usaha dan kekuatan mereka. Dia mengetetahui siapa yang mensyukuri nikmat sehingga Dia memberinya taufik dengan orang yang tidak mensyukurinya, sehingga Dia meletakkan karunia-Nya sesuai kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 8",
    "description": "7-8. Selanjutnya ayat ini memberi nasihat kepada orang yang beriman untuk mengikuti rasulullah dalam semua petunjuknya. Dan ketahuilah olehmu bahwa di tengah-tengah kamu ada rasulullah, yang sepatutnya dihormati dan dipatuhi semua petunjuknya karena beliau senantiasa dalam bimbingan wahyu ilahi. Kalau dia menuruti kemauan kamu dalam banyak hal, pasti kamu akan mendapatkan kesusahan. Tetapi dengan bimbingan rasulullah, Allah menjadikan kamu, wahai para sahabat yang setia, cinta kepada keimanan dan menjadikan iman itu indah dalam hatimu sehingga kamu mudah menjaga diri dari dosa serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan sehingga mudah bagi kamu melakukan ketaatan. Mereka itulah orang-orang yang mengikuti secara mantap jalan yang lurus. Hal yang demikian itu adalah sebagai karunia dan nikmat dari Allah. Dan Allah maha mengetahui siapa yang pantas mendapat anugerah-Nya, mahabijaksana dalam mengatur se-gala urusan. 9. Setelah Allah memperingatkan kepada orang mukmin supaya berhati-hati dalam menerima berita yang disampaikan orang fasik, maka Allah menerangkan pada ayat ini tentang apa yang bisa terjadi akibat berita itu. Misalnya pertikaian antara dua kelompok yang kadang-kadang menyebabkan peperangan. Dan apabila ada dua golongan orang-orang mukmin berperang atau bertikai satu sama lain maka damaikanlah antara keduanya dengan memberi petunjuk dan nasihat ke jalan yang benar. Jika salah satu dari keduanya, yakni golongan yang bermusuhan itu terus menerus berbuat zalim terhadap golongan yang lain, maka pera-ngilah golongan yang berbuat zalim itu, yang enggan menerima kebenar-an, sehingga golongan itu kembali kepada perintah Allah. Jika golongan itu telah kembali kepada perintah Allah, yakni menerima kebenaran maka damaikanlah antara keduanya dengan adil, sehingga terjadi hubungan baik antara keduanya, dan berlakulah adil dalam segala urusan agar putusan kamu diterima oleh semua golongan. Sungguh, Allah mencintai orang-orang yang berlaku adil dalam perbuatan mereka dan memberi balasan kepada mereka dengan balasan yang sebaik-baiknya."
  }
]