[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila dua kelompok dari orang-orang yang beriman bertikai, maka kalian (wahai orang-orang beriman) harus mendamaikan mereka, dengan menyeru mereka agar berhakim kepada Kitabullah dan Sunnah Rasulullah dan rela menerima hukum keduanya. Bila salah satu dari kedua kelompok melanggar dan menolak seruan kepada Allah dan Rasulullah, maka perangilah mereka hingga mereka kembali kepada hukum Allah dan Rasulullah. Bila mereka telah kembali, maka damaikanlah mereka dengan adil. Berlaku adillah dalam hukum kalian, jangan melampaui hukum Allah dan Rasulullah dalam mengambil keputusan. Sesungguhnya Allah mencintai orang-orang yang berlaku adil dalam hukum mereka yang memutuskan dengan keadilan diantara makhlukNya. Dalam ayat ini terdapat penetapan sifat “mahabbah” bagi Allah secara hakiki sesuai dengan keagungan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Jika ada dua kelompok dari orang-orang yang beriman saling berperang, maka damaikanlah -wahai orang-orang yang beriman- di antara keduanya dengan mengajak keduanya kepada hukum Allah untuk menyelesaikan pertikaian di antara keduanya. Jika salah satu enggan dan melanggar maka perangilah kelompok yang melanggar hingga ia kembali kepada hukum Allah. Jika telah kembali kepada hukum Allah maka damaikan antara keduanya dengan adil dan tidak memihak, berbuat adillah dalam memutuskan hukum antara keduanya, sesungguhnya Allah menyukai orang-orang yang berbuat adil dalam membuat keputusan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah mendorong orang-orang beriman agar melakukan perdamaian jika dua kelompok dari mereka saling bertikai. Kelompok yang lain dari orang-orang beriman wajib melakukan perdamaian yang Allah ridhai. Allah menegaskan kewajiban melakukan perdamaian ini, dan jika terdapat salah satu kelompok yang menzalimi kelompok lain dan tidak menerima perdamaian, maka kelompok yang zalim ini harus diperangi hingga ia mau kembali menerima hukum dari Allah dan Rasulullah. dan jika kelompok yang zalim itu telah berhenti dari kezalimannya maka perbaikilah hubungan kedua kelompok yang berselisih itu dengan ketetapan yang adil, yaitu dengan memberikan hak kepada pemiliknya dengan adil. Allah Maha Mencintai orang-orang yang berbuat adil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَإِن طَآئِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا۟ (Dan kalau ada dua golongan dari mereka yang beriman itu berperang) Yakni jika dua golongan dari orang-orang Islam yang saling berselisih maka hendaknya mereka senantiasa berusaha untuk melakukan perdamaian dan mengajak untuk memutuskan perkara dengan hukum Allah. Dan jika terjadi kezaliman yang dilakukan salah satu golongan setelah itu terhadap golongan lain dan tidak menerima perdamaian bahkan meminta sesuatu yang bukan haknya, maka hendaklah kaum muslimin yang lain memerangi golongan yang zalim itu hingga ia mau kembali kepada hukum Allah; jika golongan ini mau kembali kepada hukum Allah maka hendaklah kaum muslimin bersikap adil kepada kedua golongan itu dalam memberi keputusan dan bersungguh-sungguh dalam mencari kebenaran sesuai hukum Allah, kemudian menghentikan kezaliman golongan yang zalim itu dan mengembalikan hak golongan yang terzalimi. وَأَقْسِطُوٓا۟ ۖ إِنَّ اللهَ يُحِبُّ الْمُقْسِطِينَ (dan hendaklah kamu berlaku adil; sesungguhnya Allah mencintai orang-orang yang berlaku adil) Yakni dan adillah dalam mengambil keputusan di antara dua golongan itu, karena Allah mencintai orang-orang yang adil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Jika ada dua golongan mukmin saling berselisih, maka damaikanlah mereka wahai orang muslim dengan memberi mereka nasehat dan menuntunnya untuk beramal sesuai perintah Allah dan meridhai ketentuanNya. Jika salah satu golongan kezalimannya melampaui batas kepada golongan lainnya dan menolak untuk berdamai, maka perangilah golongan yang melampaui batas itu, sampai dia mau menaati perintah Allah. Jika golongan itu mau kembali, maka damaikanlah mereka berdua secara adil dengan memberi golongan yang melampaui batas balasan atas pertentangannya. Berlaku adillah kalian, sesungguhnya Allah mencintai orang-orang yang berlaku adil. Maknanya akan memberikan balasan yang baik atas perbuatan mereka. Ayat ini diturunkan untuk dua laki-laki dari kaum Anshar yang saling bermusuhan tentang hak antara mereka berdua. Masing-masing mereka meminta bantuan keluarga. Kemudian mereka saling melemparkan pukulan dan sepatu, bukan pedang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika ada dua golongan} dua golongan {orang-orang mukmin bertikai, maka damaikanlah antara keduanya. Jika salah satu dari keduanya berbuat aniaya} melampaui batas {terhadap yang lain, maka perangilah orang yang berbuat aniaya itu} yang melampaui batas tersebut {sehingga dia kembali kepada perintah Allah} kembali pada ketentuan Allah {Jika golongan itu telah kembali} telah kembali pada ketentuaan Allah {maka damaikanlah antara keduanya dengan adil. Bersikaplah adil} bersikaplah adil {Sesungguhnya Allah mencintai orang-orang yang bersikap adil} orang-orang yang adil dalam keputusan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Ini mengandung larangan bagi orang-orang yang beriman untuk saling menzhalimi satu sama lain dan untuk saling menyerang satu sama lain. Jika ada dua kubu dari orang-orang beriman yang saling berperang, maka diwajibkan atas orang-orang beriman lainnya untuk melenyapkan keburukan besar ini dengan cara didamaikan serta ditengahi secara baik sehingga perdamaian bisa terwujud dan agar mereka yang saling berperang bisa menempuh jalan yang menggiring pada perdamaian. Jika keduanya berdamai, maka itulah yang terbaik, namun “Jika salah satu dari kedua golongan itu berbuat aniaya terhadap golongan yang lain, maka perangilah golongan yang berbuat aniaya itu sehingga golongan itu kembali kepada perintah Allah.” Maksudnya, kembali pada ketentuan Allah dan RasulNya dengan mengerjakan kebaikan dan meninggalkan keburukan di mana yang terbesar adalah perang. Firman Allah, “Jika golongan itu telah kembali (kepada perintah Allah), maka damaikanlah antara keduanya dengan adil.” Ini adalah perintah untuk berdamai serta bersikap adil dalam perdamaian, sebab bisa saja perdamaian dibuat namun tidak adil, tapi dibuat secara zhalim untuk salah satu dari kedua belah pihak yang bertikai; ini bukan perdamaian yang diperintahkan. Untuk itu salah satu dari kedua belah pihak yang bertikai tidak boleh memperhatikan faktor kekeluargaan, etnis atau kepentingan-kepentingan lain yang akan menyebabkan kedua belah pihak melenceng dari keadilan. “Sesungguhnya Allah menyukai orang-orang yang berlaku adil,” yakni, bersikap adil dalam memutuskan perkara di antara sesame dan di seluruh kekuasaan yang dipegang bahkan bisa dimasukkan juga dalam pengertian adilnya seseorang terhadap keluarga dan orang-orang yang menjadi tanggungannya serta adil dalam menunaikan kewajiban-kewajibannya. Dan dalam hadits shohih \"orang yang berlaku adil di sisi Allah berada di atas mimbar-mimbar dari cahaya, yaitu orang-orang yang berlaku adil dalam hukumnya, keluarganya dan apa yang diurusinya\" (HR . Muslim No. 1827)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Hujurat ayat 9: Allah mengabarkan jika terjadi peperangan dua kelompok di antara orang-orang yang beriman; maka wajib bagi pemimpin untuk mengajak mereka berdamai, dan menyeru keduanya kepada hukum Al Quran dan As-Sunnah nabi-Nya; maka jika salah satu diantara 2 kelompok tersebut menolak maka wajib bagi kalian wahai orang-orang yang beriman untuk memerangi kelompok yang menolak tersebut agar kembali kepada hukum Allah dan rasulnya, tunduk kepada-Nya. Maka jika mereka telah kembali kepada hukum Allah dan rasulnya maka wajib bagi kalian untuk mendamaikan keduanya dengan berlapang dada, dan wajib bagi kalian bersikap adil dalam setiap permasalahan hukum yang bahwasanya mereka tidak diperkenankan untuk melanggar hukum Allah dan rasul-Nya. Dan ketahuilah bahwasanya Allah mencintai orang-orang yang adil, yang mereka meletakkan kebenaran pada setiap tempatnya. Maka pada ayat ini terdapat ketetapan kata sifat cinta bagi Allah sebagaimana yang layak atas kemuliaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya dari Anas radhiyallahu 'anhu ia berkata, “Dikatakan kepada Nabi shallallahu 'alaihi wa sallam, “Sekiranya engkau mendatangi Abdullah bin Ubay.” Maka Nabi shallallahu 'alaihi wa sallam pergi mendatanginya dan menaiki keledai, dan kaum muslimin ikut pergi berjalan bersama Beliau. Ketika itu, tanah yang dilewati adalah tanah yang tidak menumbuhkan tanaman. Saat Nabi shallallahu 'alaihi wa sallam mendatanginya, maka Abdullah bin Ubay berkata, “Menjauhlah dariku. Demi Allah, bau keledaimu telah menggangguku.” Lalu salah seorang Anshar di antara mereka berkata, “Demi Allah, keledai Rasulullah shallallahu 'alaihi wa sallam lebih wangi baunya daripada kamu.” Maka salah seorang dari kaum Abdullah (bin Ubay) ada yang marah untuknya dan memakinya, sehingga masing-masing kawannya saling marah. Ketika itu, antara keduanya saling pukul-memukul dengan pelepah kurma, sandal, dan tangan. Lalu disampaikan kepada kami, bahwa telah turun ayat, “Dan kalau ada dua golongan dari mereka yang beriman itu berperang hendaklah kamu damaikan antara keduanya!” (Terj. Al Hujurat: 9) Ayat ini mengandung larangan berbuat zalim antara sesama kaum mukmin dan larangan bagi mereka untuk saling berperang, dan bahwa jika di antara dua golongan mukmin saling berperang, maka kaum mukmin yang lain harus memadamkan keburukan besar ini dengan mendamaikan mereka dan bersikap tengah-tengah secara sempurna sehingga terwujud perdamaian, dan hendaknya mereka menempuh jalan yang mengarah kepadanya. Jika kedua golongan itu berdamai, maka sangat baik sekali, tetapi jika salah satu dari keduanya berbuat zalim terhadap (golongan) yang lain, maka perangilah (golongan) yang berbuat zalim itu sehingga golongan itu, kembali kepada perintah Allah, yaitu kembali kepada ketetapan Allah dan Rasul-Nya berupa mengerjakan kebaikan dan meninggalkan keburukan yang di antaranya adalah berperang. Ayat ini terdapat perintah untuk berdamai dan perintah berlaku adil dalam shulh (perdamaian), karena terkadang shulh ada namun tidak adil, bahkan dengan berlaku zalim atau memihak kepada salah satu di antara kedua golongan. Jika demikian, maka bukanlah shulh yang diperintahkan, ia wajib tidak memihak hanya karena hubungan kekerabatan, sesuku atau karena maksud dan tujuan tertentu yang membuatnya menyimpang dari keadilan. Yaitu mereka yang adil dalam memberikan keputusan di antara manusia dan dalam memimpin, bahkan termasuk pula adilnya seorang suami kepada istri dan anaknya dalam memenuhi hak mereka. Rasulullah shallallahu 'alaihi wa sallam bersabda: إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِى حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا “Sesungguhnya orang-orang yang adil di sisi Alah berada di atas mimbar-mimbar dari cahaya di sebelah kanan Ar Rahman ‘Azza wa Jalla, dan kedua Tangan-Nya adalah kanan. Mereka itu adalah orang-orang yang adil dalam memberikan keputusan, dalam bersikap kepada keluarga mereka dan dalam hal yang mereka pimpin.” (HR. Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hujurat Ayat 9",
    "description": "Setelah Allah memperingatkan kepada orang mukmin supaya berhati-hati dalam menerima berita yang disampaikan orang fasik, maka Allah menerangkan pada ayat ini tentang apa yang bisa terjadi akibat berita itu. Misalnya pertikaian antara dua kelompok yang kadang-kadang menyebabkan peperangan. Dan apabila ada dua golongan orang-orang mukmin berperang atau bertikai satu sama lain maka damaikanlah antara keduanya dengan memberi petunjuk dan nasihat ke jalan yang benar. Jika salah satu dari keduanya, yakni golongan yang bermusuhan itu terus menerus berbuat zalim terhadap golongan yang lain, maka pera-ngilah golongan yang berbuat zalim itu, yang enggan menerima kebenar-an, sehingga golongan itu kembali kepada perintah Allah. Jika golongan itu telah kembali kepada perintah Allah, yakni menerima kebenaran maka damaikanlah antara keduanya dengan adil, sehingga terjadi hubungan baik antara keduanya, dan berlakulah adil dalam segala urusan agar putusan kamu diterima oleh semua golongan. Sungguh, Allah mencintai orang-orang yang berlaku adil dalam perbuatan mereka dan memberi balasan kepada mereka dengan balasan yang sebaik-baiknya. 10. Ayat yang lalu menjelaskan perlunya melakukan perdamaian antara dua kelompok orang mukmin yang berperang. Hal itu perlu dilakukan sebab sesungguhnya orang-orang mukmin itu bersaudara, sebab mereka itu satu dalam keimanan, karena itu damaikanlah antara kedua saudaramu yang sedang beselisih atau bertikai satu sama lain dan bertakwalah kepada Allah dengan melaksanakan perintahnya antara lain mendamaikan kedua golongan yang saling bermusuhan itu agar kamu mendapat rahmat persudaraan dan persatuan."
  }
]