[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Turunnya al-quran hanyalah dari Allah yang maha perkasa dalam kuasaNya dan pembalasanNya, juga mahabijaksana dalam pengaturan dan hukum-hukumNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Al-Qur`ān ini diturunkan dari Allah yang Maha Perkasa, yang tidak seorang pun mengalahkan-Nya, Maha Bijaksana dalam penciptaan, pengaturan dan syariat-Nya, bukan diturunkan dari selain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Al-Qur’an diturunkan dari Allah Yang Maha Perkasa dalam kuasa dan pembalasan-Nya, Maha Bijaksana dalam mengatur dan menetapkan hukum-Nya. Kami menurunkan kepadamu -wahai Muhammad- al-Qur’an yang memerintahkan kebenaran dan keadilan, maka sembahlah Allah semata, dan esakanlah Dia dalam peribadatan dan agamamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تَنزِيلُ الْكِتٰبِ (Kitab (Al Quran ini) diturunkan) Yakni ini adalah penurunan al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah Az-Zumar: diriwayatkandari An-Nasa’I, Dari ‘Aisyah RA bertanya: Rasulullah SAW berpuasa, sampai kami bertanya: engkau berkenan berbuka dengan apa wahai Rasul?, dan beliau berbuka sampai kami bertanya: siapa yang mau berpuasa?, Rasulullah SAW setiap malam membaca: surah Bani Israi’l (surah al-Isra’) dan Az Zumar. Sebab penamaan surat Az Zumar tertera dalam dua ayat (71 dan 73). 1. Ayat ini diturunkan Allah yang Maha Kuasa di KerajaanNya yang tidak tertandingi, Maha bijaksana di singgasanaNya, Dialah Allah yang tidak menciptakan sesuatu dengan gurauan (permaianan)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diturunkannya kitab} Al-Qur’an {dari Allah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah menginformasikan tentang keagungan al-Quran dan keagungan Tuhan yang telah berbicara dengannya dan bahwa ia turun dariNya, dan sesungguhnya ia turun “dari Allah Yang Mahaperkasa lagi Mahabijaksana.” Maksudnya, yang sifatNya adalah uluhiyah bagi semua makhluk. Yang demikian itu adalah karena keagungan dan kesempurnaanNya dank arena keperkasaan yang dengannya Dia mengalahkan semua makhluk dan segala sesuatu tunduk kepadaNya; dank arena hikmah (kebijaksanaan) di dalam penciptaan dan perintahNya. Al-Quran ini turun dari TUhan yang seperti itu sifatNya, sedangkan al-kalam (bicara) itulah sifat bagi pembicara, dan sifat selalu tak terpisahkan dari maushuf (yang disifati). Oleh karena Allah itu sempurna dari segala sisi, yang tiada tandingan bagiNya, maka demikian pula, kalam (pembicaraan, Firman) Nya sempurna dari segala sisinya, tiada tandingannya. Yang satu ini saja sudah cukup untuk menyifati al-Quran, membuktikan kedudukannya yang agung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 1: (Turunnya Kitab ini) yakni Alquran; berkedudukan sebagai Mubtaba (dari Allah) berkedudukan sebagai Khabar dari Mubtada (Yang Maha Perkasa) di dalam kerajaan-Nya (lagi Maha Bijaksana) dalam tindakan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang keagungan Al Qur’an, keagungan Tuhan yang berfirman dan yang menurunkannya, yaitu Allah ‘Azza wa Jalla, dan bahwa Al Qur’an turun dari Allah Yang Mahaperkasa lagi Mahabijaksana, yang berhak disembah oleh seluruh makhluk karena keagungan dan kesempurnaan-Nya, dan karena keperkasaan-Nya yang dengannya Dia tundukkan semua makhluk, dan Dia juga Mahabijaksana baik dalam menciptakan maupun memerintahkan. Al Qur’an turun dari Tuhan yang seperti itu sifat-Nya. Al Qur’an adalah firman-Nya, dan berfirman adalah salah satu sifat-Nya, sedangkan sifat mengikuti yang disifati. Oleh karena Allah Subhaanahu wa Ta'aala Mahasempurna dari segala sisi, di mana tidak ada yang sebanding dengan-Nya, maka firman-Nya pun sempurna dari segala sisi dan tidak ada bandingannya. Ini saja sebenarnya sudah cukup dalam menyifatkan Al Qur’an dan menunjukkan kedudukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 1",
    "description": "Menyambung topik pada bagian akhir surah s'd tentang posisi Al-Qur'an sebagai peringatan bagi seluruh alam, Allah mengawali surah az-zumar dengan penegasan bahwa Al-Qur'an turun dari sisi Allah. Sesungguhnya kitab Al-Qur'an ini diturunkan oleh Allah yang mahamulia, mahaperkasa dalam kerajaan-Nya, dan mahabijaksana dalam menciptakan sehingga tidak sedikit pun ciptaan-Nya yang sia-sia. 2. Wahai nabi Muhammad, sesungguhnya kami menurunkan kitab suci Al-Qur'an kepadamu melalui perantara jibril dengan membawa kebenar-an berita maupun petunjuk. Maka, sembahlah Allah yang maha esa dan mahakuasa dengan tulus ikhlas dalam beragama, menjauhi kemusyrikan dan keingkaran, serta taat dan patuh hanya kepada-Nya."
  }
]