[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12 Katakanlah (wahai rasul) kepada manusia, ”sesungguhnya Allah telah memerintahkanku dan orang-orang yang mengikutiku agar mengikhlaskan ibadah kepadaNYa semata, bukan kepada selainNya juga memerintahkanku agar menjadi orang pertama yang berserah diri kepadaNya dari umatku, tunduk dengan mentauhidkaNNya dan mengihlaskan ibadah kepadaNya serta berlepas diri dari segala macam tuhan yang disembah selain Allah.’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Katakanlah -wahai Rasul- “Sesungguhnya Allah memerintahkanku agar menyembah-Nya semata dengan mengikhlaskan ibadah hanya kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-13. Hai Muhammad, katakanlah kepada manusia: “Allah memerintahkanku dan pengikutku untuk menyembah Allah semata, dan memerintahkanku agar aku menjadi orang yang pertama kali memeluk Islam di antara umatku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قُلْ إِنِّىٓ أُمِرْتُ أَنْ أَعْبُدَ اللهَ مُخْلِصًا لَّهُ الدِّينَ (Katakanlah: “Sesungguhnya aku diperintahkan supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama) Yakni Allah memerintahkanku untuk beribadah kepada-Nya dengan ibadah yang terbebas dari kemusyrikan, riya’ dan lain sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Katakanlah wahai Muhammad: sesungguhnya aku diperintahkan untuk menyembah Allah yang Esa, dengan penuh ketaatan kepadaNya dalam beribadah dan menjalankan agama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Sesungguhnya aku diperintahkan untuk menyembah Allah dengan ikhlas kepadaNya} taat dan beribadah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Yakni, “katakanlah” wahai rasul, kepada manusia, “Sesungguhnya aku diperintahkan supaya menyembah Allah dengan memurnikan ketaatan kepadaNya dalam menjalankan agama,” yaitu (yang telah disebutkan) pada FirmanNya pada awal surat ini: “Maka sembahlah Allah dengan memurnikan ketaatan kepadaNya dalam menjalankan agama.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 11: (Katakanlah sesungguhnya aku diperintahkan supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya) dari perbuatan syirik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan tidak berbuat syirk di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 11",
    "description": "11-12. Katakanlah, wahai nabi Muhammad, 'sesungguhnya aku diperintahkan agar menyembah Allah dengan tulus dan penuh ketaatan, berserah diri hanya kepada-Nya, dan konsisten dalam melaksanakan ajaran agama. Dan aku pun diperintahkan agar menjadi orang yang pertama-tama berserah diri, patuh, dan tunduk kepada-Nya. '11-12"
  }
]