[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15 Katakanlah (wahai rasul) kepada manusia “sesungguhnya aku menyembah Allah semata yang tidak ada sekutu bagiNya dengan mengikhlaskan iabadah dan ketaatanku hanya untukNya” maka sembahlah oleh kalian (wahai orang-orang musyrik) apa yang kalian ingin sembah selain Allah berupa berhala-berhala, patung-patung dan makhluk-mahklukNya yang lain, hal itu tidak merugikanku sedikitpun. ini adalah ancaman keras terhadap siapa yang menyembah selain Allah dan mempersekutukannya dengan Allah. katakalnlah (wahai rasul), ”sesungguhnya orang-orang yang benar-benar merugi adalah orang-orang yang merugikan diri sendiri dan keluarga mereka di hari kiamat dan hal itu dengan menyesatkan mereka dan mengahalang-halangi mereka dari beriman di dunia.” ketahuilah, bahwa kerugian orang-orang musyrik itu pada diri dan keluarga mereka di hari kiamat adalah kerugian yang jelas dan nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Katakanlah -wahai Rasul- “Sesungguhnya aku menyembah Allah semata dengan mengikhlaskan ibadah hanya kepada-Nya, aku tidak menyembah selain-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. hai Muhammad, katakanlah kepada mereka: “Aku hanya menyebah Allah semata tanpa menyekutukan-Nya, menyembah dan mentaati-Nya dengan penuh keikhlasan. Hai orang-orang musyrik, sembahlah apa yang ingin kalian sembah selain Allah; baik itu berhala, patung, maupun makhluk lainnya; itu semua tidak akan mendatangkan mudharat bagiku, namun sebaliknya akan mendatangkan mudharat bagi kalian.” Dan katakanlah kepada mereka: “Sungguh orang-orang yang merugi adalah mereka yang kerugiannya menimpa diri mereka sendiri dan keluarganya pada hari kiamat akibat menyekutukan Allah. Inilah kerugian yang jelas, karena tidak akan mendapat keuntungan selamanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قُلِ اللهَ أَعْبُدُ (Katakanlah: “Hanya Allah saja Yang aku sembah) Yakni aku tidak menyembah selain Allah, baik itu dengan menyembah selain-Nya atau dengan menyekutukan-Nya. مُخْلِصًا لَّهُۥ دِينِى (dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agamaku”) Yakni ibadahku hanya untuk Allah, tidak mengandung kemusyrikan, riya’, maupun hal lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Katakanlah: \"Aku hanya menyembah Allah, dengan penuh ketaatan kepadaNya, dengan tidak merusak dengan kesyirikan dan riya’, maka aku tidak akan menyembah selain Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Hanya Allah yang aku sembah dengan ikhlas kepadaNya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. “Katakanlah, ‘Hanya Allah saja yang aku sembah dengan memurnikan ketaatan kepadaNya dalam menjalankan agamaku. Maka sembahlah olehmu apa yang kamu kehendaki selain Dia’.” Ini sebagaimana difirmankanNya di dalam surat yang lain, Katakanlah: \"Hai orang-orang yang kafir aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah. Untukmulah agamamu dan untukkulah agamaku\". (Al-Kafirun:1-6). “Katakanlah, ‘Sesungguhnya orang-orang yang rugi” yang sesungguhnya ialah “orang-orang yang merugikan diri mereka sendiri” di mana mereka mencegahnya mendapat pahala dan karena itu mereka berhak mendapat siksa yang sangat buruk “dan keluarganya pada Hari Kiamat.” Yakni, dicerai-beraikan di antara mereka, dan mereka sangat bersedih sesudahnya, dan bahkan tidak ada keselamatan padanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 14: (Katakanlah, \"Hanya Allah saja yang aku sembah dengan memurnikan ketaatan kepada-Nya\") dari perbuatan syirik atau menyekutukan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 14",
    "description": "13-14. Katakanlah pula wahai nabi, kepada manusia, 'sesungguhnya aku takut akan murka Allah dan azab yang menimpa pada hari yang sangat besar lagi dahsyat yaitu hari kiamat jika aku durhaka kepada tuhanku dengan melanggar perintah-Nya. ' katakanlah pula kepada mereka, 'hanya Allah yang aku sembah dengan penuh ketaatan kepada-Nya dan istikamah serta tulus dalam menjalankan agamaku. '15. Wahai manusia, jika kamu enggan mengikuti ajakanku untuk menyembah Allah dan lebih memilih jalan kekafiran dan kemusyrikan, maka sembahlah selain dia sesukamu! katakanlah, wahai nabi, kepada mereka, 'sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya karena melakukan perbu-atan yang menjerumuskan mereka ke dalam azab dan siksa pada hari kiamat. ' ingatlah! kerugian orang kafir yang demikian itu adalah kerugian yang nyata karena hanya azab kekal di neraka yang akan mereka terima di akhirat nanti."
  }
]