[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15 Katakanlah (wahai rasul) kepada manusia “sesungguhnya aku menyembah Allah semata yang tidak ada sekutu bagiNya dengan mengikhlaskan iabadah dan ketaatanku hanya untukNya” maka sembahlah oleh kalian (wahai orang-orang musyrik) apa yang kalian ingin sembah selain Allah berupa berhala-berhala, patung-patung dan makhluk-mahklukNya yang lain, hal itu tidak merugikanku sedikitpun. ini adalah ancaman keras terhadap siapa yang menyembah selain Allah dan mempersekutukannya dengan Allah. katakalnlah (wahai rasul), ”sesungguhnya orang-orang yang benar-benar merugi adalah orang-orang yang merugikan diri sendiri dan keluarga mereka di hari kiamat dan hal itu dengan menyesatkan mereka dan mengahalang-halangi mereka dari beriman di dunia.” ketahuilah, bahwa kerugian orang-orang musyrik itu pada diri dan keluarga mereka di hari kiamat adalah kerugian yang jelas dan nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Kalian -wahai kaum musyrikin- silahkan menyembah apa yang kalian kehendaki selain Allah berupa berhala-berhala. (Ini adalah perintah ancaman) Katakanlah -wahai Rasul- “Sesungguhnya orang-orang yang benar-benar merugi adalah orang-orang yang kehilangan dirinya dan kehilangan keluarganya, Mereka tidak akan saling bertemu selamanya, karena keluarganya meninggalkannya dengan masuk Surga atau keluarganya ikut dengannya masuk Neraka, mereka tidak akan bertemu selamanya. Ketahuilah bahwa hal itu adalah kerugian sejati yang nyata yang tidak ada kesamaran padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَاعْبُدُوا۟ مَا شِئْتُم (Maka sembahlah olehmu (hai orang-orang musyrik) apa yang kamu kehendaki) Yakni sembahlah siapa yang kalian kehendaki untuk kalian sembah. مِّن دُونِهِۦ ۗ( selain Dia) Kalimat ini adalah sebagai ancaman dan olokan bagi mereka. قُلْ إِنَّ الْخٰسِرِينَ الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيٰمَةِ ۗ( Katakanlah: “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat”) Yakni mereka adalah orang-orang yang benar-benar merugi, sebab orang yang masuk neraka adalah orang yang telah rugi terhadap dirinya dan keluarganya. أَلَا ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ(Ingatlah yang demikian itu adalah kerugian yang nyata) Yakni kerugian yang sangat besar yang tidak ada lagi kerugian yang lebih besar dari itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Maka sembahlah kalian semua jika kalian menyembah selain Allah, dan ini sebagai ancaman dan celaan. Katakanlah wahai Nabi (Muhammad). Sesungguhnya orang-orang yang merugi adalah mereka yang berada dalam kesesaatan dan kerabat merekaa pun dalam kesesatan, mereka semua (akan) masuk dalam neraka. Bukankah yang demikian itu merupakan kerugian yang nyata bagi orang yang melampaui batas?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sembahlah sesuatu yang kalian kehendaki selain Dia. Katakanlah,“Sesungguhnya orang-orang yang rugi adalah orang-orang yang merugikan diri sendiri dan keluarganya pada hari kiamat” Ingatlah, yang demikian itu adalah kerugian yang nyata} yang nyata dan jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. “Katakanlah, ‘Hanya Allah saja yang aku sembah dengan memurnikan ketaatan kepadaNya dalam menjalankan agamaku. Maka sembahlah olehmu apa yang kamu kehendaki selain Dia’.” Ini sebagaimana difirmankanNya di dalam surat yang lain, Katakanlah: \"Hai orang-orang yang kafir aku tidak akan menyembah apa yang kamu sembah. Dan kamu bukan penyembah Tuhan yang aku sembah. Dan aku tidak pernah menjadi penyembah apa yang kamu sembah. Dan kamu tidak pernah (pula) menjadi penyembah Tuhan yang aku sembah. Untukmulah agamamu dan untukkulah agamaku\". (Al-Kafirun:1-6). “Katakanlah, ‘Sesungguhnya orang-orang yang rugi” yang sesungguhnya ialah “orang-orang yang merugikan diri mereka sendiri” di mana mereka mencegahnya mendapat pahala dan karena itu mereka berhak mendapat siksa yang sangat buruk “dan keluarganya pada Hari Kiamat.” Yakni, dicerai-beraikan di antara mereka, dan mereka sangat bersedih sesudahnya, dan bahkan tidak ada keselamatan padanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 15: (Maka sembahlah oleh kalian apa yang kalian kehendaki selain Dia) selain-Nya. Di dalam ungkapan ayat ini terkandung makna ancaman bagi orang-orang musyrik dan sekaligus sebagai pemberitahuan, bahwa mereka tidak menyembah Allah swt. (Katakanlah, \"Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari kiamat\") karena mereka akan menjadi penghuni neraka yang abadi, dan karena mereka tidak memperoleh bidadaribidadari yang disediakan buat mereka, jika mereka beriman.- (Ingatlah yang demikian itu adalah kerugian yang nyata) jelas sekali ruginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Perintah ini bukanlah menurut arti yang sebenarnya, tetapi sebagai pernyataan kemurkaan Allah terhadap kaum musyrikin yang telah berkali-kali diajak kepada tauhid tetapi mereka selalu ingkar. Ayat ini sama seperti kandungan surah Al Kafirun. Yaitu dengan menjadikan diri mereka kekal di neraka dan tidak memperoleh kenikmatan dan bidadari yang telah disiapkan Allah di surga bagi orang-orang yang beriman. Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya, karena tidak ada kerugian yang menyamainya. Ia adalah kerugian yang terus menerus dan tidak ada keberuntungan setelahnya, bahkan tidak ada keselamatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 15",
    "description": "Wahai manusia, jika kamu enggan mengikuti ajakanku untuk menyembah Allah dan lebih memilih jalan kekafiran dan kemusyrikan, maka sembahlah selain dia sesukamu! katakanlah, wahai nabi, kepada mereka, 'sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya karena melakukan perbu-atan yang menjerumuskan mereka ke dalam azab dan siksa pada hari kiamat. ' ingatlah! kerugian orang kafir yang demikian itu adalah kerugian yang nyata karena hanya azab kekal di neraka yang akan mereka terima di akhirat nanti. 16. Di neraka itu orang kafir akan merasakan siksa yang datang dari segala penjuru. Di atas mereka ada lapisan-lapisan penutup dari api dan di bawahnya juga ada lapisan-lapisan tikar dari api yang disediakan bagi mereka di akhirat (lihat pula: surah al-'ankab't/29: 55; al-a'r'f/7: 41). Demikianlah Allah mengancam hamba-hamba-Nya dengan azab yang pedih, 'wahai hamba-hamba-ku, takutlah akan azab Allah yang akan menimpamu. Agar kamu selamat maka bertakwalah kepada-ku secara maksimal. '."
  }
]