[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang merugi itu pada hari kiamat berada di dalam neraka jahanam dimana mereka akan mendapatkan potongan-potongan azab neraka dari atas mereka seperti atap yang memayungi, dari bawah mereka juga demikian. Dengan azab yang seperti itulah Allah mempertakutkan hamba-hambaNya agar mereka mewaspadainya, wahai hamab-hambaku bertakwalah kepadaku dengan menjalankan perintah-perintah-Ku dan menjauhi larangan-larangan-Ku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dari atas mereka ada asap, kobaran api dan panas yang membara, sedangkan dari bawah mereka ada asap, kobaran api dan panas yang membara. Dengan azab seperti inilah Allah menakut-nakuti hamba-hamba-Nya. Wahai hamba-hamba-Ku, bertakwalah kalian kepada-Ku dengan melaksanakan perintah-perintah-Ku dan meninggalkan larangan-larangan-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Orang-orang yang merugi pada hari kiamat itu akan mendapatkan azab yang besar, berupa potongan-potongan neraka yang menyelimuti mereka dari atas seperti naungan yang menaungi mereka dan juga dari bawah. Azab yang menakutkan ini Allah gunakan untuk memberi peringatan kepada hamba-hamba-Nya. Maka wahai hamba-hamba-Ku, bertakwalah kepada-Ku dengan menjalankan perintah-Ku dan menjauhi larangan-Ku, agar kalian selamat dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. لَهُم مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ (Bagi mereka lapisan-lapisan dari api di atas mereka) Makna (الظلل) adalah lapisan-lapisan api yang membakar mereka. وَمِن تَحْتِهِمْ ظُلَلٌ ۚ( dan di bawah merekapun lapisan-lapisan (dari api)) Api yang ada di bawah mereka disebut sebagai lapisan-lapisan (naungan) karena api ini menaungi penghuni neraka yang ada di tingkat yang ada di bawahnya. Sebab pada setiap tingkatan neraka terdapat golongan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bagi mereka orang-orang yang merugi mereka menghuni tingkatan-tingkatan neraka, diatas dan di bawah. Mereka merasakan haus, yang disebut menaungi bawah mereka. Karena ia menaungi orang di bawahnya yang disiksa di neraka, itulah adzab bagi orang yang takut yaitu orang-orang mukmin agar mereka bertaqwa kepadaNya, perintah taqwa dalam ayat (yaa 'ibaadi fattaquun) (wahai hambaKu bertaqwalah padaKu)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di atas mereka ada lapisan-lapisan} lapisan-lapisan {dari api dan di bawah mereka juga ada lapisan-lapisan. Demikianlah Allah memperingatkan hamba-hambaNya dengan itu. “Wahai hamba-hambaKu, bertakwalah kepadaKu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Kemudian Allah menjelaskan betapa dahsyatnya kesengsaraan yang mereka alami, seraya berfirman, “Bagi mereka lapisan-lapisan dari api di atas mereka,” maksudnya, lempengan-lempengan api neraka seperti awan tebal “dan di bawah mereka pun lapisan-lapisan. Demikianlah.” Yakni gambaran yang Kami uraikan tentang azab para penghuni neraka tersebut adalah cambuk yang dengannya Allah menghalau hamba-hambaNya menuju rahmatNya. “Allah mempertakuti hamba-hambaNya dengan azab itu. Maka bertakwalah kepadaKu hai hamba-hambaKu.” Maksudnya, Allah menjadikan apa yang telah Dia sediakan untuk orang-orang yang celaka itu berupa azab sebagai pembawa hamba-hambaNya menuju takwa dan sebagai peringatan dari apa-apa yang bisa menyebabkan aab. Mahasuci Allah yang telah merahmati hamba-hambaNYa dalam segala hal! Dan telah memudahklan jalan-jalan yang bisa mengantarkan mereka kepadaNya, mendorong mereka untuk menelusurinya dan merangsang mereka dengan segala bentuk rangsangan (motivasi) yang dirindukan oleh jiwa dan didambakan oleh kalbu, serta memperingatkan mereka dari beramal kepada selain Dia dengan sebenar-benar peringatan dan menjelaskan kepada mereka segala sebab yang bisa menjadi pendorong untuk meninggalkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 16: (Bagi mereka gumpalan-gumpalan di atas mereka) lapisan-lapisan (dari api dan di bawah mereka pun gumpalangumpalan) lapisan-lapisan dari api. (Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu) yakni hamba-hambaNya yang beriman, supaya mereka bertakwa kepada-Nya; pengertian ini disimpulkan dari firman selanjutnya, yaitu, (Maka bertakwalah kepada-Ku hai hamba-hamba-Ku)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan kesengsaraan yang akan mereka peroleh. Agar mereka bertakwa kepada-Nya. Maka Mahasuci Allah yang merahmati hamba-hamba-Nya dalam segala hal, memudahkan untuk mereka jalan yang menyampaikan kepada-Nya dan mendorong mereka menempuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 16",
    "description": "Di neraka itu orang kafir akan merasakan siksa yang datang dari segala penjuru. Di atas mereka ada lapisan-lapisan penutup dari api dan di bawahnya juga ada lapisan-lapisan tikar dari api yang disediakan bagi mereka di akhirat (lihat pula: surah al-'ankab't/29: 55; al-a'r'f/7: 41). Demikianlah Allah mengancam hamba-hamba-Nya dengan azab yang pedih, 'wahai hamba-hamba-ku, takutlah akan azab Allah yang akan menimpamu. Agar kamu selamat maka bertakwalah kepada-ku secara maksimal. '17-18. Demikianlah azab yang Allah janjikan bagi orang musyrik. Dan adapun orang-orang yang menjauhi tagut'yaitu setan dan apa saja yang dipertuhankan'serta tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira berupa ampunan dan surga dari Allah. Sebab itu, sampaikanlah kabar gembira itu kepada hamba-hamba-ku, yaitu mereka yang mendengarkan perkataan, yakni ajaran Al-Qur'an maupun hadis, lalu mengikuti apa yang paling baik di antaranya karena wahyu Allah adalah perkataan yang terbaik. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai pikiran sehat dan tidak diliputi kekeruhan."
  }
]