[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18 Dan orang-orang yang menolak untuk taat kepada setan dan tidak menyembah kepada selain Allah, sebaliknya mereka bertaubat kepadaNya dengan beribadah kepadaNya seraya mengikhlasakn agama untukNya, bagi mereka adalah berita gembira dalam kehidupan dunia ini dengan sanjungan yang bagus dan taufik dari Allah dan di akhirat mereka mendapatkan ridha Allah dan kenikmatan yang abadi di dalam surga. Maka sampaikanlah berita gembira (wahai nabi) kepada hamba-hambaku yang mendengarkan perkataaan lalu mengikuti yang paling lurus darinya; dan sebaik-baik perkataan dan sekaligus paling lurus adalah firman Allah kemudian sabda rasulNya, mereka itulah orang-orang yang Allah berikan taufik kepada jalan yang lurus, Allah menunjukan kepada mereka akhlak dan perbuatan terbaik, dan mereka adalah orang-orang yang memiliki akal yang sempurna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan orang-orang yang menjauhi penyembahan berhala-berhala dan segala yang disembah selain Allah, serta mereka kembali kepada Allah dengan bertobat, ,maka bagi mereka berita gembira Surga saat kematian, di alam kubur dan pada hari Kiamat. Kabarkanlah -wahai Rasul- berita gembira ini kepada hamba-hamba-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Sedangkan orang-orang yang menjauhi ketaatan kepada setan dan penyembahan kepada selain Allah, bertaubat dan kembali kepada-Nya dengan menyembah-Nya semata tanpa menyekutukan-Nya; maka mereka akan mendapatkan kabar gembira di dunia berupa taufik dan hidayah serta pujian baik, dan di akhirat berupa keridhaan Allah dan kenikmatan surga. Hai Muhammad, sampaikanlah kabar gembira kepada hamba-hamba-Ku yang mendengarkan perkataan, kemudian mengikuti perkataan yang paling baik; dan perkataan yang paling baik adalah firman Allah dan sabda Rasulullah. Mereka adalah orang-orang yang Allah beri taufik menuju kebenaran dan petunjuk, Allah memberi mereka hidayah untuk mengikuti perkataan dan perbuatan yang terbaik, mereka adalah orang-orang yang memiliki akal yang sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَالَّذِينَ اجْتَنَبُوا۟ الطّٰغُوتَ أَن يَعْبُدُوهَا (Dan orang-orang yang menjauhi thaghut (yaitu) tidak menyembahnya) yakni orang-orang yang menolak untuk menyembah berhala dan setan dan hanya menyembah Allah. وَأَنَابُوٓا۟ إِلَى اللهِ(dan kembali kepada Allah) Mereka beribadah kepda Allah dan berpaling dari selain-Nya. لَهُمُ الْبُشْرَىٰ ۚ( bagi mereka berita gembira) Berupa pahala yang besar, yaitu surga. Dan kabar gembira ini bisa merupakan kabar gembira yang disampaikan oleh para Rasul, atau ketika kematian mendatangi mereka, atau juga ketika mereka dibangkitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan orang-orang yang menjauhi thaghut yaitu: apa-apa yang di sembah selain Allah, seperti patung, berhala, dan lainnya. Mereka kembali pada Allah dan tidak menyembahNya, mereka pantas mendapatkan kabar gembira, dengan pahala surga. Baik dari khabar para Rasul ataupun dari para Auliya’. Diturunkan di tiga masa. Pada zaman Jahiliyah mereka berkata: laa ilaa ha illallaah (tiada Tuhan selain Allah), yaitu Zaid bin umar bin Nufail, Abu Dzar al Ghifari, Salman al Farisi, maka sampaikanlah kabar gembira ini pada hambaKu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menjauhi Thaghut} berhala-berhala {(yaitu) tidak menyembahnya dan kembali kepada Allah} kembali kepada Allah dengan bertaubat {maka bagi mereka itu kabar gembira} kabar gembira di surga {Maka sampaikanlah kabar gembira itu kepada hamba-hambaKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Setelah Allah menjelaskan kondisi orang-orang yang berdosa, maka di sini Allah menjelaskan kondisi orang-orang yang berinabah (kembali) kepada Allah dan pahala untuk mereka, seraya berfirman, “Dan orang-orang yang menjauhi thagut, tidak menyembahnya.” Yang dimaksud thagut di sini adalah beribadah (penyembahan dan pengabdian) kepada selain Allah. Lalu mereka menjauhinya, tidak menyembahnya. Ini merupakan penjagaan (perlindungan, pemeliharaan) yang sangat indah dari Allah, sebab pujian di atas meliputi orang yang menjauhi thagut dengan cara tidak menyembahnya. “Dan kembali kepada Allah” dengan beribadah kepadaNya dan memurnikan kepatuhan kepadaNya dalam menjalankan agama. Keinginan-keinginan mereka berpaling (menjauh) dari peribadahan kepada berhala menuju ibadah kepada Yang Maharaja lagi Maha Mengetahui; dan syirik serta maksiat-maksiat menuju tauhid dan ketaatan. “Bagi mereka berita gembira,” yang tidak dapat diukur nilainya dan tidak dapat mengetahui ungkapannya kecuali orang yang dimuliakan oleh Allah dengan berita gembira itu. Ini mencakup berita gembira di dalam kehidupan dunia ini dalam bentuk pujian yang baik, mimpi-mimpi yang baik dan inayah (perhatian) rabbani dari Allah yang mereka rasakan dari celah-celahnya bahwasanya Allah hendak memuliakan mereka di dunia dan di akhirat; dan mereka juga memperoleh berita gembira di akhirat: saat menjelang kematian, saat berada di dalam kubur, dan pada saat Hari Kiamat. Dan puncak berita gembira itu adalah apa yang diberitakan oleh Allah Yang Maha Pemurah, yaitu terus menerusnya keridhaan Allah, kebaikan, dan karuniaNYa serta ditemukannya segala cita-citanya di surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 17: (Dan orang-orang yang menjauhi thaghut) yakni berhala-berhala (yaitu tidak menyembahnya dan kembali) menghadap (kepada Allah, bagi mereka berita gembira) yaitu mendapatkan surga (sebab itu sampaikanlah berita itu kepada hamba-hamba-Ku)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang-orang yang berdosa, maka Dia menyebutkan keadaan orang-orang yang kembali kepada Allah dan balasan bagi mereka. Thaghut ialah setan dan apa saja yang disembah selain Allah Subhaanahu wa Ta'aala. Dengan beribadah kepada-Nya dan berbuat ikhlas di dalamnya. Dengan demikian, mereka beralih dari syirk menuju tauhid, dari maksiat menuju taat, dan dari bid’ah menuju Sunnah. Yang tidak dapat diukur dan diketahui sifatnya karena demikian besar. Berita gembira ini mencakup berita gembira di dunia seperti pujian yang baik, mimpi yang baik, perhatian dari Allah yang mereka lihat di sela-sela hidup mereka, bahwa Dia bermaksud memuliakan mereka di dunia dan akhirat. Mereka juga memperleh berita gembira di akhirat, yaitu ketika mati, ketika di kubur, ketika pada hari Kiamat dan diakhiri dengan berita gembira oleh Tuhan Yang Maha Pemurah, yaitu selalu mendapatkan keridhaan-Nya, kebaikan-Nya, ihsan-Nya dan memperoleh keamanan dari-Nya di surga. Ya Allah, berikanlah yang demikian itu kepada kami, sesungguhnya kami membutuhkannya. Setelah Allah Subhaanahu wa Ta'aala memberitahukan bahwa bagi mereka berita gembira, maka Allah Subhaanahu wa Ta'aala memerintahkan Nabi-Nya untuk menyampaikan berita gembira itu dan menyebutkan sifat orang yang mendapat berita gembira itu. Dalam ayat ini terdapat anjuran memberikan berita gembira kepada orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 17",
    "description": "17-18. Demikianlah azab yang Allah janjikan bagi orang musyrik. Dan adapun orang-orang yang menjauhi tagut'yaitu setan dan apa saja yang dipertuhankan'serta tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira berupa ampunan dan surga dari Allah. Sebab itu, sampaikanlah kabar gembira itu kepada hamba-hamba-ku, yaitu mereka yang mendengarkan perkataan, yakni ajaran Al-Qur'an maupun hadis, lalu mengikuti apa yang paling baik di antaranya karena wahyu Allah adalah perkataan yang terbaik. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai pikiran sehat dan tidak diliputi kekeruhan"
  }
]