[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-18 Dan orang-orang yang menolak untuk taat kepada setan dan tidak menyembah kepada selain Allah, sebaliknya mereka bertaubat kepadaNya dengan beribadah kepadaNya seraya mengikhlasakn agama untukNya, bagi mereka adalah berita gembira dalam kehidupan dunia ini dengan sanjungan yang bagus dan taufik dari Allah dan di akhirat mereka mendapatkan ridha Allah dan kenikmatan yang abadi di dalam surga. Maka sampaikanlah berita gembira (wahai nabi) kepada hamba-hambaku yang mendengarkan perkataaan lalu mengikuti yang paling lurus darinya; dan sebaik-baik perkataan dan sekaligus paling lurus adalah firman Allah kemudian sabda rasulNya, mereka itulah orang-orang yang Allah berikan taufik kepada jalan yang lurus, Allah menunjukan kepada mereka akhlak dan perbuatan terbaik, dan mereka adalah orang-orang yang memiliki akal yang sempurna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang yang mendengar perkataan dan memilah-milah antara yang baik dan yang buruk, lalu mereka mengikuti yang terbaik karena ia yang bermanfaat. Mereka yang memiliki sifat-sifat tersebut adalah orang-orang yang Allah bimbing kepada hidayah. Mereka adalah orang-orang yang memiliki akal yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُۥٓ ۚ (yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya) Yakni yang mendengar perkataan yang benar dari kitab Allah atau dari sunnah Rasulullah, kemudian mereka menjalankan kebaikan yang diperintahkan kepada mereka dan mengamalkannya. Pendapat lain mengatakan bahwa ini adalah orang yang mendengar perkataan baik dan buruk, lalu dia hanya berkata dengan perkataan yang baik dan meninggalkan perkataan yang buruk. أُو۟لٰٓئِكَ الَّذِينَ هَدَىٰهُمُ اللهُ ۖ وَأُو۟لٰٓئِكَ هُمْ أُو۟لُوا۟ الْأَلْبٰبِ (Mereka itulah orang-orang yang telah diberi Allah petunjuk dan mereka itulah orang-orang yang mempunyai akal) Mereka adalah orang-orang yang diantarkan Allah kepada kebenaran dan orang-orang yang memiliki akal yang sehat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka ialah orang-orang yang mendengarkan wahyu yang disampaikan dari Al Qur’an dan Sunnah, maka ikutilah kebaikan dari apa yang disampaikan pada kalian, mereka yang banyak melakukannya mendapat pahala, ialah orang yang diberikan taufiq oleh Allah di agama, dan merekalah orang-orang yang memiliki pemikiran yang tajam. Jabir berkata: ketika ayat ini turun: (surga (itu) memiliki 7 pintu) al hijr 15/44. Seorang laki-laki anshar mendatangi Nabi dan bertanya: wahai Rasul, aku memiliki 7 kerajaan, dan setiap pintu ada kerajaan-kerajaan, kemudian turunlah ayat: (sebab itu sampaikanlah kabar gembira itu kepada HambaKu..)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yaitu) orang-orang yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai akal sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Setelah Allah mengabarkan bahwa untuk mereka adalah berita gembira, maka Allah memerintah Nabi untuk menyampaikan berita gembira ini kepada mereka dan Dia sebutkan juga karakter (sifat) yang karenanya mereka berhak mendapat berita gembira, seraya berfirman, “Sebab itu sampaikanlah berita itu kepada hamba-hambaKu, yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya.” Ini adalah kata jenis (nama umum) yang mencakup segala perkataan. Jadi mereka mendengarkan dengan baik segala jenis perkataan untuk dibeda-bedakan mana yang layak didahulukan dan mana yang layak ditinggalkan. Maka dari itu, termasuk ketegasan dan kecerdasan akal mereka adalah, mereka mengikuti yang terbaik darinya, dan yang paling baik secara mutlak adalah kalamullah (Firman Allah) dan sabda Rasulullah, sebagaimana yang dikatakan oleh Allah di dalam surat ini, “Allah telah menurunkan perkataan yang paling baik (yaitu) Al Qur'an yang serupa (mutu ayat-ayatnya) lagi berulang-ulang, gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka di waktu mengingat Allah. Itulah petunjuk Allah, dengan kitab itu Dia menunjuki siapa yang dikehendaki-Nya. Dan barang siapa yang disesatkan Allah, maka tidak ada seorang pun pemberi petunjuk baginya.” (Az-Zumar:23). Pada ayat ini ada satu poin penting, yaitu bahwa setelah Allah memberitahu tentang orang-orang yang dipuji, bahwa mereka mendengarkan perkataan lalu mengikuti yang terbaik di antaranya maka seakan-akan ada suatu pertanyaan: apakah termasuk jalan (cara) untuk bisa mengetahui perkataan yang terbaik itu adalah kita harus berkarakter seperti karakter-karakter orang-orang yang berakal, dan kita harus mengetahui bahwa siapa saja yang mengutamakan perkataan yang terbaik itu kita yakini bahwa dia adalah termasuk orang-orang yang berakal? Jawabannya: Ya! Yang terbaik adalah apa yang telah ditegaskan oleh Allah dalam FirmanNya, “Allah telah menurunkan perkataan yang paling baik (yaitu) Al Qur'an yang serupa (mutu ayat-ayatnya) lagi berulang-ulang, gemetar karenanya kulit orang-orang yang takut kepada Tuhannya, kemudian menjadi tenang kulit dan hati mereka di waktu mengingat Allah. Itulah petunjuk Allah, dengan kitab itu Dia menunjuki siapa yang dikehendaki-Nya. Dan barang siapa yang disesatkan Allah, maka tidak ada seorang pun pemberi petunjuk baginya.” (Az-Zumar:23). Merekalah orang-orang, “yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Itulah orang-orang yang telah diberi petunjuk oleh Allah” menuju akhlak dan amal yang paling mulia, “dan mereka itulah orang-orang yang mempunyai akal.” Artinya, akal yang suci, yang di antara isi dan sikap tegasnya adalah mereka dapat mengetahui yang baik dari yang lainnya dan mereka lebih mengutamakan apa yang pantas diutamakan atas apa yang tidak pantas. Inilah tanda (orang) berakal. Bahkan sebenarnya tidak ada tanda (ciri) bagi akal selain itu. Maka sesungguhnya orang yang tidak bisa membedakan antara perkataan-perkataan yang baik dan buruk, tidak termasuk orang yang mempunyai akal sehat, atau nafsu syahwatnya sehingga akalnya tetap mengikuti syahwatnya sehingga tidak mengutamakan yang terbaik, maka orang itu berarti kurang berakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 18: (Yaitu, orang-orang yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya) mengikuti sesuatu yang mengandung kemaslahatan bagi mereka. (Mereka itulah orang-orang yang telah diberi Allah petunjuk dan mereka itulah orang-orang yang mempunyai akal) yang mempunyai pikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya ialah mereka yang mendengarkan ajaran-ajaran Al Quran dan ajaran-ajaran yang lain, tetapi yang diikutinya ialah ajaran-ajaran Al Quran karena ia adalah ajaran yang paling baik sebagaimana yang diterangkan dalam ayat 23 surah ini. Inilah orang-orang yang berakal sehat, yaitu orang-orang yang mampu membedakan mana yang baik dan mana yang tidak baik, mana yang mesti didahulukan dan mana yang tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 18",
    "description": "17-18. Demikianlah azab yang Allah janjikan bagi orang musyrik. Dan adapun orang-orang yang menjauhi tagut'yaitu setan dan apa saja yang dipertuhankan'serta tidak menyembahnya dan kembali kepada Allah, mereka pantas mendapat berita gembira berupa ampunan dan surga dari Allah. Sebab itu, sampaikanlah kabar gembira itu kepada hamba-hamba-ku, yaitu mereka yang mendengarkan perkataan, yakni ajaran Al-Qur'an maupun hadis, lalu mengikuti apa yang paling baik di antaranya karena wahyu Allah adalah perkataan yang terbaik. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai pikiran sehat dan tidak diliputi kekeruhan. 19-20. Tugas rasul tidak lebih dari sekadar menyampaikan dakwah kepada umatnya. Hanya Allahlah yang memberi hidayah kepada yang dia kehendaki. Maka apakah orang-orang yang telah dipastikan mendapat azab karena kekafiran mereka; apakah engkau akan mampu menye-lamatkan orang yang dipastikan berada dalam api neraka' tentu tidak mampu. Tetapi, orang-orang yang bertakwa kepada tuhannya dengan melaksanakan perintah dan menjauhi larangan-Nya, mereka mendapat kamar-kamar di surga yang di atasnya terdapat pula kamar-kamar yang dibangun bertingkat-tingkat, yang mengalir di bawahnya sungai-sungai dengan aneka rasa dan warna (lihat pula: surah mu'ammad/47: 15). Itulah janji Allah yang sebenar-benarnya. Allah tidak akan pernah memungkiri janji-Nya."
  }
]