[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "apakah orang yang berhak mendapatkan keputusan azab, karena dia terus menerus di atas kesesatan dan penenentangannya, sesungguhnya tidak ada cara bagimu (wahai rasul) untuk memberinya petunjuk; maka apakah kamu mampu menyelamatkan dari neraka? tidak, kamu tidak kuasa untuk melakukan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Siapa yang pasti mendapat azab karena dia bersikukuh dalam kekufuran dan kesesatannya, maka kamu -wahai Rasul- tidak mampu untuk memberinya hidayah dan membimbingnya. Apakah kamu -wahai Rasul- mampu menyelamatkan orang yang sifatnya demikian dari siksa Neraka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Orang yang pasti mendapat azab akibat keingkarannya terhadap ayat-ayat Allah, tidak akan dapat kamu selamatkan dari neraka. Kamu bukanlah orang yang bertanggung jawab atasnya, sebab dia telah rela mendapat kebinasaan bagi dirinya. Sedangkan orang -orang yang bertakwa kepada Tuhan mereka -dengan mentaati dan hanya menyembah-Nya-, maka mereka akan mendapat di dalam surga ruangan-ruangan yang dibangun saling bertingkat, dibawahnya mengalir sungai-sungai. Allah menyiapkannya bagi hamba-hamba-Nya yang bertakwa, sebagai janji yang pasti terpenuhi, karena Allah tidak mengingkari janji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ (Apakah (kamu hendak merubah nasib) orang-orang yang telah pasti ketentuan azab atasnya?) Ketentuan azab yang dimaksud adalah firman Allah kepada iblis: لأملأن جهنم منك وممن تبعك منهم أجمعين “Sesungguhnya Aku pasti akan memenuhi neraka Jahannam dengan jenis kamu dan dengan orang-orang yang mengikuti kamu di antara mereka kesemuanya.” (Sad:85) Ayat ini merupakan penghibur bagi Rasulullah karena dia sangat ingin agar kaumnya beriman, maka Allah mengabarkannya bahwa orang yang telah ditetapkan Allah dan kalimat azab telah ditentukan baginya maka Rasulullah tidak akan mampu menjadikannya orang yang beriman di dunia atau untuk menggapai tangannya agar dapat mengeluarkannya dari neraka di hari kiamat. Maka tidak ada gunanya bersedih terhadap mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Maka apakah engkau akan mengubah nasib, orang-orang yang dipastikan mendapatkan adzab, karena mereka kafir, itulah firman Allah ta’ala: (maka kalian benar-benar akan memenuhi neraka jahannam), al a’raf (18/7) apakah engkau (Muhammad) akan menyelamatkan orang-orang yang berada dalam neraka?. Makna kata (afaman) (bukankah orang) berfaidah istifham inkari untuk nafi, apakah kamu berhak memilah milih diantara manusia? Dan firman Allah (bukankah kamu) bermakna menguatkan makna inkar dan nafi, ayat tersebut menyiratkan kesedihan Rasul yang menjaga keimanan umatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah orang-orang yang telah dipastikan} wajib {atasnya suatu azab. Ataukah kamu akan menyelamatkan} membebaskan {orang yang berada di dalam neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Maksudnya, orang-orang yang telah pasti ketentuan azab atasnya, karena ia terus dalam kesesatan, menentang dan kekufuran, maka kamu (Nabi) sama sekali tidak mempunyai jalan untuk memberinya petunjuk dan tidak pula kamu mampu menyelamatkannya dari neraka; dan itu pasti!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 19: (Apakah orang yang telah pasti ketentuan azab atasnya?) termasuk orang-orang yang digolongkan oleh firman-Nya, \"Sesungguhnya akan Aku penuhi neraka jahanam...\" (Q.S. As-Sajdah, 13). (Apakah kamu akan menyelamatkan) maksudnya, mengeluarkan (orang yang berada dalam neraka) kalimat ayat ini menjadi Jawab Syarath, kemudian di dalamnya terdapat Isim Zhahir yaitu lafal Man yang menduduki tempat Isim Mudhmar; dan Hamzah Istifham di sini menunjukkan makna ingkar, yakni, kamu tidak akan mampu memberikan hidayah kepadanya sehingga ia dapat kamu selamatkan dari neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena terus menerus di atas kesesatan, pembangkangan dan kekafiran setelah peringatan disampaikan berkali-kali. Maksudnya adalah bahwa Nabi Muhammad shallallahu 'alaihi wa sallam tidak mampu memberi petunjuk orang yang telah ditetapkan sesat yang akan masuk neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 19",
    "description": "19-20. Tugas rasul tidak lebih dari sekadar menyampaikan dakwah kepada umatnya. Hanya Allahlah yang memberi hidayah kepada yang dia kehendaki. Maka apakah orang-orang yang telah dipastikan mendapat azab karena kekafiran mereka; apakah engkau akan mampu menye-lamatkan orang yang dipastikan berada dalam api neraka' tentu tidak mampu. Tetapi, orang-orang yang bertakwa kepada tuhannya dengan melaksanakan perintah dan menjauhi larangan-Nya, mereka mendapat kamar-kamar di surga yang di atasnya terdapat pula kamar-kamar yang dibangun bertingkat-tingkat, yang mengalir di bawahnya sungai-sungai dengan aneka rasa dan warna (lihat pula: surah mu'ammad/47: 15). Itulah janji Allah yang sebenar-benarnya. Allah tidak akan pernah memungkiri janji-Nya"
  }
]