[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami menurunkan kepadamu (wahai rasul) al-qur’an yang memerintahkan kepada kebenaran dan keadilan. maka sembahlah Allah semata dan ikhlaskanlah segala ketaatan hanya kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sesungguhnya Kami menurunkan kepadamu -wahai Rasul- Al-Qur`ān yang berisi kebenaran, semua beritanya benar dan hukum-hukumnya adil. Maka sembahlah Allah dengan mentauhidkan-Nya, membersihkan tauhid tauhid tersebut dari kemusyrikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. إِنَّآ أَنزَلْنَآ إِلَيْكَ الْكِتٰبَ بِالْحَقِّ (Sesunguhnya Kami menurunkan kepadamu Kitab (Al Quran) dengan (membawa) kebenaran) Yakni yang mengandung kebenaran, yaitu segala yang ada didalamnya adalah benar, berupa pernyataan tentang keesaan Allah, kenabian, hari kebangkitan, dan berbagai kewajiban. Yakni Kami tidak menurunkannya sia-sia. فَاعْبُدِ اللهَ مُخْلِصًا لَّهُ الدِّينَ(Maka sembahlah Allah dengan memurnikan ketaatan kepada-Nya) Ikhlas yakni meniatkan amalannya karena Allah dan tidak demi tujuan lain. Yang dimaksud dengan (الدين) di sini adalah ibadah dan ketaatan, dan yang paling utama adalah mengesakan Allah dan meyakini bahwa Dia tidak mempunyai sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Sesungguhnya Kami telah menurunkan padamu hai Nabi, yaitu Al-Qur’an yang penuh dengan kebenaran. Didalamnya terkandung ajaran tauhid, kenabian, hari kebangkitan dan kewajiban-kewajiban. Kami tidak menurunkan Al-Qur’an secara bathil, tanpa tujuan. Maka sembahlah Allah yang Maha Esa dengan tulus beribadah dan taat, dan jangan sekali-kali menyekutukan Allah dan berbuatriya’"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami menurunkan kitab} Al-Qur’an {kepadamu dengan benar. Maka sembahlah Allah dengan ikhlas hanya kepadaNya} bertauhid kepadaNya dengan melakukan ketaatan dan ibadah sehingga tidak menyekutukannya dengan apapun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Dan bersama ini, makin jelas kesempurnaannya dengan orang yang al-quran itu diturunkan kepadanya, yaitu Nabi Muhammad yang merupakan manusia termulia. Maka dapat diketahui bahwa al-Quran adalah kitab termulia, dan dengan membawa apa ia diturunkan, yaitu kebenaran. Al-Quran turun dengan membawa kebenaran yang tidak diragukan lagi, untuk mengeluarkan manusia dari berbagai kegelapan menuju nur (cahaya terang); ia turun membawa kebenaran di dalam kabar-kabarnya yang benar dan hukum-hukum (aturan-aturan) nya yang adil. Maka semua apa yang ditunjukannya adalah merupakan kebenaran yang paling agung dari seluruh tuntutan ilmiah; dan tidak ada sesudah kebenaran selain kesesatan. Oleh karena ia turun dari Yang Mahabenar, mengandung kebenaran untuk memberi petunjuk kepada manusia melalui manusia yang paling mulia, maka kenikmatan yang terdapat di dalamnya sangat agung dan sangat besar dan wajib disyukuri, yaitu dengan menuluskan ketaatan hanya kepada Allah. Maka dari itu Dia berfirman, “Maka sembahlah Allah dengan memurnikan ketaatan kepadaNya,” maksudnya, tuluskanlah kepada Allah semua agamamu, baik berupa syariat yang Nampak dan syariat yang tidak Nampak, yaitu Islam, Iman, dan Ihsan, dengan cara mengesakan Allah dengannya dan dengan niat mengharapkan keridhaanNya, bukan niat-niat apa pun yang lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 2: (Sesungguhnya Kami menurunkan kepadamu) hai Muhammad (Kitab Alquran dengan membawa kebenaran) lafal Bilhaqqi berta'alluq kepada lafal Anzalnaa. (Maka sembahlah Allah dengan memurnikan ketaatan kepada-Nya) yakni dari kemusyrikan, maksudnya mentauhidkan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di samping keadaan Al Qur’an seperti yang sudah dijelaskan, Allah Subhaanahu wa Ta'aala menambahkan penjelasan tentang kesempurnaannya dengan menyebutkan orang yang diturunkan Al Quran kepadanya, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam, di mana Beliau adalah manusia yang paling mulia, sehingga dapat diketahui bahwa Al Quran adalah sebaik-baik kitab, ditambah lagi dengan turunnya yang membawa kebenaran. Al Qur’an turun dengan membawa kebenaran, sehingga tidak perlu diragukan lagi untuk mengeluarkan manusia dari kegelapan kepada cahaya, isinya benar, berita-beritanya benar dan hukum-hukumnya adil, maka semua yang ditunjukkannya adalah kebenaran yang paling agung. Oleh karena Al Qur’an turun dengan membawa kebenaran untuk membimbing dan mengarahkan manusia, dan turun kepada manusia yang paling mulia (Nabi Muhammad shallallahu 'alaihi wa sallam), maka semakin besarlah kenikmatan yang Allah berikan kepada manusia dan mengharuskan untuk disyukuri, yaitu dengan memurnikan ibadah hanya kepada Allah Subhaanahu wa Ta'aala saja sebagaimana diterangkan dalam ayat di atas. Yakni dengan tidak berbuat syirk (menyembah selain Allah) dan mengerjakan ibadah baik yang terdiri dari syariat yang tampak (yang terkait dengan anggota badan) maupun syariat yang tersembunyi (terkait dengan hati) dengan ikhlas karena mengharapkan wajah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 2",
    "description": "Wahai nabi Muhammad, sesungguhnya kami menurunkan kitab suci Al-Qur'an kepadamu melalui perantara jibril dengan membawa kebenar-an berita maupun petunjuk. Maka, sembahlah Allah yang maha esa dan mahakuasa dengan tulus ikhlas dalam beragama, menjauhi kemusyrikan dan keingkaran, serta taat dan patuh hanya kepada-Nya. 3. Ingatlah, hanya milik Allah agama yang murni tanpa dicampuri kemusyrikan. Dan orang-orang yang mengambil pelindung serta penolong selain dia dengan menuhankan berhala, patung, dan benda-benda lainnya berdalih, 'kami mengakui Allah sebagai pencipta, tetapi dia terlalu tinggi untuk kami dekati sehingga kami harus menyembah berhala-berhala tersebut. Kami tidak menyembah mereka melainkan agar mereka membantu mendekatkan kami kepada Allah dengan sedekat-dekatnya. ' sungguh, Allah akan memberi putusan di antara mereka yang mengesakan Allah dan yang mempersekutukan-Nya tentang apa yang mereka perse-lisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta yang menuhankan berhala, orang yang meyakini Allah memiliki anak, dan orang yang sangat ingkar terhadap kekuasaan dan keesaan Allah."
  }
]