[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi orang-orang yang bertakwa kepada tuhan mereka (dengan menaatiNya dan mengihklasakn ibadahnya hanya kepadaNya) bagi mereka di surga memperoleh kamar-kamar, sebagain darinya dibangun di atas sebagin yang lain, yang mana sungai-sungai mengalir dari bawah tempat tinggal dan kamar-kamar mereka, semua itu Allah janjikan kepada hamba-hambaNya yang bertakwa sebagi janji yang pasti, dan Allah tidak akan menyelisihi janjiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Akan tetapi orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, bagi mereka derajat-derajat yang tinggi, sebagian darinya di atas sebagian yang lain, di bawah mereka mengalir sungai-sungai. Allah menjanjikan hal itu sebagai janji yang pasti dan Allah tidak menyelisihi janji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. لٰكِنِ الَّذِينَ اتَّقَوْا۟ رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ (Tetapi orang-orang yang bertakwa kepada Tuhannya mereka mendapat tempat-tempat yang tinggi, di atasnya dibangun pula tempat-tempat yang tinggi) Sebab surga memiliki tingkatan-tingkatan yang sebagiannya di atas sebagian lainnya. Surga ini dibangun dengan asas dan pondasi yang kuat, dan bangunan yang ada di dunia sama sekali tidak ada bandingannya. تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ ۖ( di bawahnya mengalir sungai-sungai) Yakni di bawah tempat-tempat yang tinggi itu. dan ini merupakan penyempurna dan penambah keindahannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Tetapi mereka yang taat kepada Tuhannya, mereka mendapatkan kamar-kamar di surga, sebab surga berisikan kedudukan-kedudukan, dibawah kamar-kamar tersebut mengalir air sungai yang sejuk, mereka penuh dengan kesenangan dan keindahan, itulah janji Allah yang pasti, dan Allah tidak meningkari janjiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi orang-orang yang bertakwa kepada Tuhan mereka, maka bagi mereka itu kamar-kamar} tempat-tempat yang tinggi di surga {di atasnya terdapat kamar-kamar yang dibangun, dan mengalir di bawahnya sungai-sungai. (Itulah) janji Allah. Allah tidak akan mengingkari janji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Akan tetapi puncak keberuntungan dan puncak kemenangan adalah bagi orang-orang yang bertakwa, yaitu orang-orang yang telah Allah sediakan karamah dan berbagai macam kenikmatan untuk mereka yang tidak bisa dinilai kadarnya. “Mereka mendapat tempat-tempat yang tinggi,” yakni, kedudukan-kedudukan yang tinggi yang terukir indah, yang karena keindahan, kemegahan, dan kebeningannya sehingga bagian luarnya tampak dari bagian dalamnya dan bagian dalamnya tampak dari bagian luarnya; dan karena ketinggiannya hingga ia terlihat sebagaimana tampaknya bintang yang jauh berada di ufuk timur atau bintang yang jauh berada di ufuk barat. Maka dari itu Allah berfirman, “Di atasnya dibangun pula tempat-tempat yang tinggi,” maksudnya, sebagiannya berada di atas sebagian yang lain, “yang dibangun” dengan emas dan perak, sedangkan pewanginya adalah minyak kasturi yang sangat istimewa, “yang di bawahnya mengalir sungai-sungai,” yang mengalir mengairi kebun-kebun nan rindang dan pohon-pohon nan bersih, sehingga menghasilkan berbagai macam buah-buahan yang lezat-lezat dan buah-buahan yang masak. “Allah telah berjanji dengan sebenar-benarnya. Allah tidak akan mengingkari janjiNya.” Dia telah menjanjikan kepada orang-orang yang bertakwa pahala ini, maka pasti ditepatiNya. Maka hendaklah mereka memenuhi sifat-siifat takwa, agar Allah memenuhi pahala untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 20: (Tetapi orang-orang yang bertakwa kepada Rabbnya) yaitu bertakwa melalui jalan taat kepada-Nya (mereka mendapat tempat-tempat yang tinggi, di atasnya dibangun pula tempat-tempat yang tinggi, di bawahnya mengalir sungai-sungai) artinya sungai-sungai yang mengalir, baik di bawah tempat-tempat yang teratas maupun di tempat-tempat yang terbawah (sebagai janji Allah) lafal Wa'dallaahi dinashabkan oleh Fi'il yang diperkirakan keberadaannya pada sebelumnya (Allah tidak akan memungkiri janji-Nya) atau mengingkarinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saking indah, elok dan bersihnya tempat itu sampai-sampai bagian luarnya dapat dilihat dari dalam dan bagian dalam dapat dilihat dari luar, dan saking tingginya, tempat-tempat itu dilihat sebagaimana dilihat bintang di langit. Yang memancar dan menyirami kebun-kebun dan pepohonan, sehingga kebun-kebun itu mengeluarkan buah-buahan yang lezat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 20",
    "description": "19-20. Tugas rasul tidak lebih dari sekadar menyampaikan dakwah kepada umatnya. Hanya Allahlah yang memberi hidayah kepada yang dia kehendaki. Maka apakah orang-orang yang telah dipastikan mendapat azab karena kekafiran mereka; apakah engkau akan mampu menye-lamatkan orang yang dipastikan berada dalam api neraka' tentu tidak mampu. Tetapi, orang-orang yang bertakwa kepada tuhannya dengan melaksanakan perintah dan menjauhi larangan-Nya, mereka mendapat kamar-kamar di surga yang di atasnya terdapat pula kamar-kamar yang dibangun bertingkat-tingkat, yang mengalir di bawahnya sungai-sungai dengan aneka rasa dan warna (lihat pula: surah mu'ammad/47: 15). Itulah janji Allah yang sebenar-benarnya. Allah tidak akan pernah memungkiri janji-Nya. 21. Wahai manusia, apakah engkau tidak memperhatikan bahwa Allah menurunkan air hujan dari langit, lalu diaturnya air hujan itu menjadi sumber-sumber air yang memancar dan sungai-sungai yang mengalir di bumi, kemudian dengan air itu ditumbuhkan-Nya tanam-tanaman yang bermacam-macam warnanya, kemudian tumbuhan itu berubah menjadi kering dan layu, lalu engkau melihatnya kekuning-kuningan setelah segar kehijauan, kemudian dijadikan-Nya tumbuhan itu mati dan hancur berderai-derai. Sungguh, pada proses penciptaan yang demikian bertahap-tahap itu terdapat pelajaran berharga dan nasihat bermanfaat bagi orang-orang yang mempunyai akal sehat dan fitrah yang lurus."
  }
]