[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak melihat (wahai rasul), bahwa sesungguhnya Allah menurunkan hujan dari langit, lalu Dia memasukannya ke dalam tanah, menjadikannya mata air yang memancar dan air yang mengalir, kemudian dengan air ini Allah menumbuhkan tanam-tanaman yang beraneka ragam jenis dan warnanya, kemudian ia pun mengering setelah ia hijau segar, kamu melihatnya menguning, kemudian Allah menjadikannya kayu bakar yang lapuk dan hancur? sesungguhnya pada apa yang Allah lakukan itu benar-benar terkandung peringatan dan nasihat bagi orang-orang yang memiliki akal yang selamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Sesungguhnya kalian tahu melalui apa yang kalian saksikan bahwa Allah menurunkan air hujan dari langit, lalu memasukkannya ke dalam mata air dan aliran sungai. Kemudian dengan air ini Allah menumbuhkan tanaman-tanaman yang beraneka ragam. Kemudian tanaman-tanaman itu mengering. Kamu -wahai orang yang menyaksikan- melihatnya berwarna kuning setelah sebelumnya hijau. Kemudian Allah menjadikannya patah dan lapuk setelah kering. Sesungguhnya dalam kisah yang disebutkan itu terdapat peringatan bagi orang-orang yang memiliki hati yang hidup."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Hai Muhammad, tidakkah kamu melihat bahwa Allah menurunkan air dari langit kemudian memasukkannya ke dalam tanah dan menjadikannya mata air yang mengalir, kemudian dengan air ini, tumbuhlah tanaman yang beraneka ragam jenis dan warnanya. Lalu tanaman itu mengering setelah sebelumnya hijau berseri, sehingga kamu dapat melihatnya menguning, kemudian Allah menjadikannya kering dan hancur. Sungguh pemandangan ini merupakan ibrah dan peringatan bagi orang-orang yang memiliki akal sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَلَمْ تَرَ أَنَّ اللهَ أَنزَلَ مِنَ السَّمَآءِ مَآءً (Apakah kamu tidak memperhatikan, bahwa sesungguhnya Allah menurunkan air dari langit) Yakni menurunkan air dari awan. فَسَلَكَهُۥ يَنٰبِيعَ فِى الْأَرْضِ(maka diaturnya menjadi sumber-sumber air di bumi) Maka Allah memasukkannya ke dalam tanah dan menyimpannya di sana. Makna (الينابيع) yakni sumber-sumber mata air atau tempat-tempat yang memancarkan air. ثُمَّ يُخْرِجُ بِهِۦ زَرْعًا مُّخْتَلِفًا أَلْوٰنُهُۥ(kemudian ditumbuhkan-Nya dengan air itu tanam-tanaman yang bermacam-macam warnanya) Yakni dengan air itu Allah mengeluarkan tanaman-tanaman dengan berbagai warna seperti kuning, hijau, putih, atau merah. Atau Allah mengeluarkan gandum, dan lain sebagainya jika yang dimaksud dengan (الألوان) adalah jenis-jenisnya. ثُمَّ يَهِيجُ(lalu menjadi kering) Yakni mengering. فَتَرَىٰهُ مُصْفَرًّا(lalu kamu melihatnya kekuning-kuningan) Yakni kamu melihatnya menjadi kekuningan padahal sebelumnya berwarna hijau dan indah. ثُمَّ يَجْعَلُهُۥ حُطٰمًا ۚ( kemudian dijadikan-Nya hancur berderai-derai) Yakni menjadi hancur lebur. إِنَّ فِى ذٰلِكَ لَذِكْرَىٰ لِأُو۟لِى الْأَلْبٰبِ(Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran bagi orang-orang yang mempunyai akal) Yakni apa yang telah disebutkan itu adalah pelajaran yang bermanfaat bagi orang yang memiliki akal yang sehat, mereka mengetahui bahwa kehidupan dunia seperti tanaman yang sangat cepat sirna dan hilang keindahannya, dan mereka sama sekali tidak meragukan bahwa Allah berkuasa untuk membangkitkan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Wahai Muhammad, tidakkah engkau menyaksikan apa-apa yang diturunkan Allah dari langit, lalu Allah atur mata air, sumber-sumber: mata air, kemudian dari bumi itu tumbuh tumbuhan-tumbuhan yang bermacam-macam, kuning, hijau, putih, merah, lalu yang basah dan kering. Dan kau melihatnya menguning setelah hijau, kemudian Allah jadikan tumbuhan itu membusuk dan hancur, sesungguhnya yang demikian itu menjadi perenungan dan peringatan bagi mereka yang berfikir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa Allah menurunkan air dari langit, lalu Dia mengalirkannya menjadi sumber-sumber air} lalu Allah memasukkannya menjadi sumber-sumber air dan memancarkan air {di bumi. Kemudian, dengan air itu} air itu {Dia menumbuhkan tanaman yang bermacam-macam warnanya, kemudian menjadi kering} menjadi keringa {kamu melihatnya kekuning-kuningan, kemudian Dia menjadikannya hancur berderai} hancur menjadi butiran {Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran} benar-benar terdapat peringatan bagi orang-orang yang berakal sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Allah mengingatkan kepada orang-orang yang mempunyai akal apa yang telah diturunkanNya dari langit berupa air (hujan) lalu Dia mengaturnya menjadi sumber-sumber air di bumi. Maksudnya, Allah menyimpannya di dalamnya sebagai mata air yang dapat dikeluarkan dengan mudah dan gampang, “kemudian ditumbuhkanNya dengan air itu tanaman-tanaman yang bermacam-macam warnanya,” seperti gandum, jagung, padi, dan lain-lain, “lalu ia menjadi kering” ketika sudah tua atau ketika ditimpa penyakit, “lalu kamu melihatnya kekuning-kuningan, kemudian dijadikanNya hancur berderai-derai,” berserakan. “Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran bagi orang-orang yang mempunyai akal,” dimana dengan itu mereka dapat mengingat perhatian Allah, Rabb mereka dan rahmatNya kepada hamba-hambaNya, di mana Dia telah memudahkan air bagi mereka dan menyimpannya di dalam perut bumi sesuai dengan tuntutan kemaslahatan mereka; dan dengannya pula mereka dapat mengingat kemahasempurnaan kekuasaanNya, dan bahwa sesungguhnya Dia akan menghidupkan kembali orang-orang yang sudah mati sebagaimana Dia akan menghidupkan kembali orang-orang yang sudah mati sebagimana Dia telah menghidupkan bumi setelah kematian (kegersangan) nya; dan juga dengan itu mereka dapat mengetahui bahwa yang berbuat demikian itulah yang berhak diibadahi. Ya Allah, jadikanlah kami termasuk orang-orang yang mempunyai akal, sebagaimana yang telah Engkau sebutkan, dan telah Engkau beri hidayah melalui akal yang telah Engkau karuniakan kepada mereka, dan telah engkau perlihatkan kepada mereka rahasia-rahsia Kitab SuciMu dan keindahan ayat-ayatMu yang tidak dicapai oleh selain mereka, sesungguhnya Engkau-lah Yang Maha Memberi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 21: (Apakah kamu tidak memperhatikan) maksudnya tidak mengetahui (bahwa sesungguhnya Allah menurunkan air dari langit, maka diatur-Nya menjadi sumber-sumber) yakni, dia memasukkan air itu ke tempat-tempat yang dapat menjadi sumber air (di bumi kemudian ditumbuhkan-Nya dengan air itu tanam-tanaman yang bermacam-macam warnanya, lalu ia menjadi kering) menjadi layu dan kering (lalu kamu melihatnya) sesudah hijau menjadi (kekuning-kuningan kemudian dijadikan-Nya hancur berderai) yakni rontok (Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran) peringatan (bagi orangorang yang mempunyai akal) bagi orang-orang yang mau mengambil pelajaran darinya untuk menyimpulkan keesaan dan kekuasaan Allah swt."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala mengingatkan ulul albaab (orang-orang yang berakal sehat). Dengan memperhatikan hal tersebut, maka orang-orang yang berakal sehat dapat mengingat betapa besarnya perhatian Allah dan rahmat-Nya kepada hamba-hamba-Nya, dimana Dia telah memudahkan kepada mereka air tesebut dan menyimpannya di dalam bumi untuk maslahat mereka. Dari sana, mereka (orang-orang yang berakal sehat) dapat mengetahui sempurnanya kekuasaan Allah, dan bahwa Dia sanggup menghidupkan orang-orang yang telah mati sebagaimana Dia mampu menghidupkan bumi setelah matinya, dan dari sana mereka juga mengetahui bahwa yang berbuat demikian adalah yang berhak diibadahi. Ya Allah, jadikanlah kami termasuk orang-orang yang berakal sehat yang engkau sering sebut mereka dalam kitab-Mu, yang Engkau tunjuki mereka dengan memberikan kepada mereka akal yang ehat. Engkau pula yang memperlihatkan kepada mereka rahasia kitab-Mu dan keindahan ayat-ayat-Mu yang tidak dapat dicapai oleh selain mereka, sesungguhnya Engkau Maha Pemberi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 21",
    "description": "Wahai manusia, apakah engkau tidak memperhatikan bahwa Allah menurunkan air hujan dari langit, lalu diaturnya air hujan itu menjadi sumber-sumber air yang memancar dan sungai-sungai yang mengalir di bumi, kemudian dengan air itu ditumbuhkan-Nya tanam-tanaman yang bermacam-macam warnanya, kemudian tumbuhan itu berubah menjadi kering dan layu, lalu engkau melihatnya kekuning-kuningan setelah segar kehijauan, kemudian dijadikan-Nya tumbuhan itu mati dan hancur berderai-derai. Sungguh, pada proses penciptaan yang demikian bertahap-tahap itu terdapat pelajaran berharga dan nasihat bermanfaat bagi orang-orang yang mempunyai akal sehat dan fitrah yang lurus. 22. Tidaklah sama antara para pendurhaka yang tidak mengambil pelajaran dari kejadian di sekitarnya dengan orang-orang yang mempunyai akal sehat dan mempergunakannya untuk beriktibar. Maka apakah orang-orang yang dibukakan hatinya oleh Allah untuk menerima agama islam dan mengamalkan ajarannya lalu dia mendapat cahaya dari tuhannya sehingga mau mengikuti petunjuk rasulullah sama dengan orang yang hatinya membatu' tentu tidak sama. Maka, celakalah mere-ka yang hatinya telah membatu karena enggan untuk mengingat Allah dan menyimpang dari jalan-Nya. Mereka itu berada dalam kesesatan yang nyata karena tidak mendapat taufik dan hidayah Allah untuk menerima kebenaran."
  }
]