[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang Allah lapangkan dadanya sehingga dia berbahagia dengan menerima islam tunduk dan beriman kepadaNya, sehingga Dia berjalan dengan ilmu yang jelas dan kehidupannya dan hidayah dari tuhannya, apakah dia sama dengan orang yang tidak seperti itu? tentu tidak sama. Celaka dan binasalah orang yang keras hatinya dan berpaling sehingga tidak mengingat Allah mereka adalah orang-orang yang berjalan di atas kesesatan yang jelas dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Apakah orang yang Allah lapangkan dadanya untuk Islam, dia terbimbing kepada Islam, dia di atas cahaya dari Rabbnya, apakah dia seperti orang yang hatinya keras untuk mengingat Allah? Keduanya tidak sama selama-lamanya. Keselamatan bagi orang yang mendapat petunjuk, sedangkan kerugian bagi orang yang hatinya keras untuk mengingat Allah. Orang kedua itu berada di atas kesesatan yang nyata dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Apakah orang yang telah Allah lapangkan dadanya sehingga dia bahagia dalam memeluk Islam, dan beriman dan taat kepada Allah, sehingga dia berada di atas cahaya Tuhannya dan petunjuk-Nya; sama seperti orang yang tidak demikian? Tentu tidak sama, sungguh kebinasaan bagi orang-orang yang keras hatinya dan berpaling dari mengingat Allah. Mereka berada dalam kesesatan yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. أَفَمَن شَرَحَ اللهُ صَدْرَهُۥ لِلْإِسْلٰمِ (Maka apakah orang-orang yang dibukakan Allah hatinya untuk (menerima) agama Islam) Yakni Allah melapangkan hatinya bagi Islam sehingga ia menerimanya dan menjadikannya petunjuk. فَهُوَ (lalu ia) Dengan kelapangan hati tersebut. عَلَىٰ نُورٍ مِّن رَّبِّهِۦ ۚ (mendapat cahaya dari Tuhannya) Yakni cahaya Tuhannya yang menyinarinya. Apakah dia seperti orang yang keras hatinya akibat pilihannya yang buruk, sehingga dia berada dalam gelapnya kesesatan dan musibah kebodohan. فَوَيْلٌ لِّلْقٰسِيَةِ قُلُوبُهُم مِّن ذِكْرِ اللهِ ۚ( Maka kecelakaan yang besarlah bagi mereka yang telah membatu hatinya untuk mengingat Allah) Mereka adalah setiap orang yang keras hatinya dan enggan berzikir kepada Allah yang dapat melapangkan dada."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Apakah kalian tidak bisa membedakan dan melihat, maka Allah jadikan hatinya terbuka menerima Islam, itu adalah dari petunjuk Tuhannya, sebagaimana orang yang keras dan sempit hatinya, maka iman tidak akan masuk dalam dirinya, apakah itu pilihan yang buruk? Yakni tidak sama diantara keduanya. Maka kerusakan dan siksa akan menimpa mereka yang berpaling dari Al-Qur’an, mereka adalah orang-orang yang keras hatinya, ragu-ragu, jauh dari kebenaran. (afaman) adalah istifham inkari bermakna nafi, istifham dalam lafadz tersebut disesuaikan dengan konteks. Ayat setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah orang yang dibuka} diluaskan {hatinya oleh Allah untuk (menerima) agama Islam, lalu mendapat cahaya} penglihatan {dari Tuhannya. Maka celakalah} maka celaka dan merugilah {bagi yang hatinya membatu dari mengingat Allah} bagi orang-orang yang hatinya tertutup dan tidak mau menerima mengingat Allah {Mereka itu dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Maksudnya, apakah sama orang yang dilapangkan dadanya oleh Allah untuk menerima agama Islam, sehingga ia menjadi lapang untuk menerima (mempelajari) hukum-hukum Allah dan mengamalkannya dengan lapang dada dan senang hati berdasarkan pengetahuan yang jelas terhadap perintahNya yang dimaksud dari FirmanNya, “Lalu ia mendapat cahaya dari Rabbnya,” dengan orang yang tidak seperti itu; berdasarkan FirmanNya, “Maka kecelakaan yang besarlah bagi mereka yang membatu hatinya untuk mengingat Allah,” yaitu hatinya tidak tunduk kepada kitabNya dan tidak pula mengambil pelajaran dari ayat-ayatNya serta tidak tenang dengan mengingatNya, melainkan ia berpaling dari TUhannya, beralih kepada selain Dia, maka bagi mereka azab yang sangat berat dan keburukan yang sangat besar. “Mereka itu dalam kesesatan yang nyata.” Kesesatan apalagi yang lebih besar daripada daripada kesesatan orang yang berpaling dari tuhannya, padahal sesungguhnya kebahagiaan itu hanya terdapat pada menghadap kepadaNya. Hatinya membatu, tidak bisa mengingatNya dan justru dia terfokus kepada segala yang berakibat buruk padanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 22: (Maka apakah orang-orang yang dibukakan Allah hatinya untuk menerima Islam) sehingga ia mendapat petunjuk (lalu ia mendapat cahaya dari Rabbnya) sama dengan orang yang hatinya dikunci mati; pengertian ini tersimpul dari firman selanjutnya (Maka kecelakaan yang besarlah) artinya, azab yang besarlah (bagi mereka yang telah membatu hatinya untuk mengingat Allah) maksudnya, untuk menerima Alquran. (Mereka itu dalam kesesatan yang nyata) nyata sekali sesatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Siap menerima syariat Allah dan mengamalkannya dengan dada yang lapang dan hati yang tenang. Yakni di atas ilmu atau pandangan yang tajam yang diberikan oleh Allah Subhaanahu wa Ta'aala. Hatinya tidak lunak ketika mendengarkan firman Allah, tidak mau memperhatikan ayat-ayat-Nya dan tidak merasa tenang dengan mengingat-Nya, bahkan ia berpaling dari Tuhannya dan beralih kepada selain-Nya, maka bagi mereka kecelakaan yang besar. Kesesatan apa yang lebih besar daripada kesesatan orang yang berpaling dari Tuhannya, berpaling dari kebahagiaan kepada kesesatan, hatinya keras dari mengingat Allah dan mendatangi semua yang merugikannya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 22",
    "description": "Tidaklah sama antara para pendurhaka yang tidak mengambil pelajaran dari kejadian di sekitarnya dengan orang-orang yang mempunyai akal sehat dan mempergunakannya untuk beriktibar. Maka apakah orang-orang yang dibukakan hatinya oleh Allah untuk menerima agama islam dan mengamalkan ajarannya lalu dia mendapat cahaya dari tuhannya sehingga mau mengikuti petunjuk rasulullah sama dengan orang yang hatinya membatu' tentu tidak sama. Maka, celakalah mere-ka yang hatinya telah membatu karena enggan untuk mengingat Allah dan menyimpang dari jalan-Nya. Mereka itu berada dalam kesesatan yang nyata karena tidak mendapat taufik dan hidayah Allah untuk menerima kebenaran. 23. Allah telah menurunkan perkataan yang memiliki susunan kata dan kandungan paling baik, yaitu Al-Qur'an yang serupa keindahan susunan antara ayat-ayatnya lagi disebut berulang-ulang baik redaksi, hukum, pelajaran, maupun kisahnya agar membawa pengaruh kuat pada diri pembacanya. Allah menurunkan Al-Qur'an yang gemetar karenanya kulit orang-orang yang takut kepada tuhannya ketika mendengar per-ingatan dan ancaman di dalamnya, kemudian menjadi tenang kulit dan hati mereka ketika mengingat Allah dan mendengar berita serta janji yang menggembirakan. Itulah petunjuk Allah bagi orang-orang yang mau mendengarkan; dengan kitab itu dia memberi petunjuk kepada siapa yang dia kehendaki. Dan barang siapa dibiarkan sesat dari jalan kebenaran oleh Allah lantaran lebih memilih jalan kesesatan dan berpaling dari kebenaran daripada mengikuti tuntunan rasulullah, maka tidak seorang pun yang dapat memberi-Nya petunjuk dan menuntunnya menuju jalan kebenaran."
  }
]