[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah lah yang menurunkan perkataan yang terbaik, yaitu al-qur’an yang agung sebagian yang lainnya mirip dengan sebagian yang lain dalam kebagusan, ketetapan hukumnya dan ketiadaan pertentangan di dalamnya, terkandung kisah-kisah yang diulang-ulang, hukum-hukum, hujjah hujjah dan keterangan-keterangan yang tilawahnya diulang namun jiwa tidak merasa bosan sekalipun sering di ulang-ulang, membuat merinding kulit orang-orang yang takut kepada tuhan mereka saat mendengarnya, karena mereka terpengaruh dengan ancaman siksa yang ada di dalamnya kemudian kulit dan hati mereka melunak karena berbagahagia dengan janji Allah yang ada di dalamnya, pengaruh al-qur’an terhadap diri itu merupakan hidayah Allah kepada hamba-hambaNya. dan Allah memberikan petunjuk kepada siapa yang Dia kehendaki dari hamba-hambaNya dengan al-qur’an dan barang siapa yang disesatkan oleh Allah dari beriman kepada Al-qur’an ini karena kekafiran dan penentangannya, maka tidak ada satupun yang bisa memberinya hidayah dan memberinya taufik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Allah menurunkan kepada rasul-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- Al-Qur`ān yang merupakan pembicaraan paling bagus. Allah menurunkannya setara, sebagian darinya menyerupai sebagian yang lain dalam kebenaran, kebaikan, keserasian dan tanpa kontradiksi. Di dalamnya terdapat beragam kisah dan hukum, janji pahala dan ancaman siksa, sifat-sifat pengikut kebenaran dan sifat-sifat pengikut kebatilan, dan lainya. Kulit orang-orang yang takut kepada Rabb mereka menjadi merinding manakala mereka mendengar ancaman dan peringatan di dalamnya, kemudian kulit dan hati mereka melunak untuk mengingat Allah manakala mereka mendengar harapan dan kabar gembira. Al-Qur`ān yang demikian pengaruhnya adalah hidayah Allah yang Dia berikan kepada siapa yang Dia kehendaki. Barangsiapa Allah biarkan dan tidak bimbing kepada hidayah, maka tidak ada pemberi hidayah baginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah-lah yang menurunkan al-Qur’an yang merupakan sebaik-baik perkataan, karena ia adalah kalamullah. Allah menurunkannya dengan keserupaan dalam keindahan dan hukum-hukum-Nya, pada hafadznya, kisah dan hukum-hukum, hujjah, dan penjelasannya terulang-ulang. Ketika mendengarnya, kulit orang-orang yang takut kepada Allah akan bergetar, karena ancaman yang terkandung di dalamnya, kemudian kulit dan hati mereka menjadi tenang dengan mengingat Allah karena janji pahala yang ada di dalamnya. Kesan dan pengaruh ini merupakan hidayah dari Allah bagi hamba-hamba-Nya. Allah memberi hidayah dengan al-Qur’an ini bagi makhluk-Nya yang Dia kehendaki. Dan barangsiapa yang Allah sesatkan dari keimanan kepada al-Qur’an ini akibat kekafiran dan pembangkangannya, maka dia tidak akan menemukan orang yang dapat memberi petunjuk kepada agama Islam dan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. اللهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ (Allah telah menurunkan perkataan yang paling baik) Yakni al-Qur’an. Allah menyebutnya sebagai perkataan karena Rasulullah menyampaikannya kepada kaumnya dan mengabarkan mereka ayat al-Qur’an yang diturunkan kepadanya. Dan ia merupakan perkataan yang paling baik karena mengandung banyak keberkahan. كِتٰبًا مُّتَشٰبِهًا(Al Quran yang serupa) Yakni isinya serupa dalam hal keindahan, kebenaran maknanya, kekuatan lafadznya, dan ketinggian balaghahnya. مَّثَانِىَ(lagi berulang-ulang) Yakni mengandung kisah-kisah yang berulang-ulang, pelajaran dan hukum-hukum yang berulang-ulang, dan dibaca berulang-ulang namun tidak menimbulkan rasa bosan bagi orang yang mendengar maupun yang membacanya. تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ(gemetar karenanya kulit orang-orang yang takut kepada Tuhannya) Dikatakan (اقشعر جلده) jika kulitnya bergetar dan menciut karena rasa takut atau kedinginan. Az-Zajjaj berkata: jika dibacakan ayat tentang azab maka kulit orang-orang yang takut kepada Allah akan bergetar. ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ اللهِ ۚ( kemudian menjadi tenang kulit dan hati mereka di waktu mengingat Allah) Yakni ketika mereka mengingat rahmat, pahala, dan surga Allah. Qatadah mengatakan bahwa ini adalah sifat dari para kekasih Allah; Allah menyebutkan bahwa kulit mereka akan gemetar kemudian hati mereka akan tenang ketika mereka mengingat Allah. Dan Allah tidak menyebutkan hilangnya kesadaran mereka sebagaimana yang dilakukan oleh para pelaku bid’ah, sebab itu datangnya dari setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Allah telah menurunkan Al-Qur’an dan menamainya sebagai hadits (khabar) karena Nabi SAW mengabarkan Al-Qur’an kepada kaumnya, dan menyampaikan berita dari yang diturunkan padanya. Al-Qur’an berisi hukum-hukum dan sebagian yang lain berisi kebaikan-kebaikan. Aturan yang bermakna penguatan atas petunjuk pada kebaikan. Yang kisah-kisah didalamnya diulang-ulang nasehat-nasehat dan hukum-hukum, membacanya selalu diulang-ulang setiap malam tanpa jenuh dan bosan. Menjadikan ketakutan bagi orang-orang yang hatinya takut kepada Allah ketika mengingatNya, lalu merindinglah bulu-bulu orang-orang yang takut kepada Allah ketika membaca ayat-ayat Al-Qur’an, itulah Al-Qur’an kitab yang penuh hidayah bagi orang yang dikehendaki mendapat hidayah oleh Allah, dan orang yang menyia-nyiakan untuk iman pada Al-Qur’an maka ia tidak mendapat petunjuk dan tidak mendapatkan taufiq pada jalan kebenaran. Sa’ad bin Abi Waqash berkata: al-Qur’an diturunkan pada Nabi Muhammad dan kami membacanya sepanjang waktu, maka para kaum bertanya: wahai Rasulullah bagaimana engkau bercerita pada kami? Kemudian turunlah ayat: Allahlah yang menurunkan sebaik-baiknya khabar (berita)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah telah menurunkan perkataan yang terbaik} Al-Qur’an yang agung {kitab yang serupa} yang saling serupa dalam mengandung kebaikan, hukum dan tidak ada pertentangan {lagi berulang-ulang} diulang-ulang di dalamnya untuk menyebut janji dan yang dijanjikan, perintah dan larangan, serta berita-berita dan hukum {Lalu gemertarlah} bergetar dan menggigil {kulit orang yang takut kepada Tuhan mereka. Kemudian melunak} menjadi damai dan tenang {kulit dan hati mereka ketika mengingat Allah. Itulah petunjuk Allah yang dengannya Dia memberi petunjuk kepada siapa saja yang Dia kehendaki. Siapa saja yang dibiarkan sesat oleh Allah, maka tidak ada satu pun pemberi petunjuk baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah mengabarkan tentang kitabNya yang diturunkanNya, yaitu bahwa ia merupakan “perkataan yang paling baik,” secara mutlak. Jadi sebaik-baik Kitab yang diturunkan dari Firman Allah tersebut adalah al-Quran ini. Apabila al-Quran adalah yang terbaik, maka dapat diketahui bahwa lafazh-lafazhnya merupakan lafazh-lafazh yang paling fasih dan paling jelas; dan sesungguhnya bermakna-maknanya (kandungannya) merupakan makna-makna yang paling mulia, sebab al-Quran adalah perkataan yang terbaik dalam lafazh dan maknanya. “Yang serupa” dari segi keindahan, keserasian dan tidak adanya perselisihannya dari sisi manapun, hingga setiap kali seorang perenung mencoba merenungkannya dan seorang yang berpikir mencoba memikirkannya, niscaya ia melihat kesesuainnya, hingga pada makna-maknanya yang rumit sekalipun; yang mencengangkan orang-orang yang menghayatinya, dan ia memastikan bahwa al-Quran itu tidak berasal kecuali dari Yang Maha Mengetahui. Inilah yang dimksud tasyabuh (yang serupa) pada ayat ini. Adapun yang dimaksudnya dalam FirmanNya, “Dia-lah yang menurunkan Al Kitab (Al Qur'an) kepada kamu. Di antara (isi) nya ada ayat-ayat yang muhkamaat itulah pokok-pokok isi Al Qur'an dan yang lain (ayat-ayat) mutasyaabihaat.” (Ali Imran:7), maka maksudnya adalah yang samar bagi pemahaman banyak orang, dan ia tetap samar kecuali kalau sudah dikembalikan kepada yang muhkamat. Maka dari itu Dia berfirman, “Di antara (isi) nya ada ayat-ayat yang muhkamat, itulah pokok-pokok isi al-Quran dan yang lain (ayat-ayat) mutasyabihat.” (Ali Imran:7) Di ayat ini Allah menjadikan kesamaran pada sebagian ayat-ayatnya, sedangkan pada ayat 23 (dari az-Zumar) ini Allah menjadikannya semuanya mutasyabih, maksudnya, serupa dalam keindahannya. Sebab Allah mengatakan, “Perkataan yang terbaik,” ia adalah surat-surat dan ayat-ayat, yang kesemuanya; sebagian darinya serupa dengan sebagian yang lain, sebagaimana telah kami jelaskan. “Lagi berulang-ulang,” maksudnya, kisah-kisah, hukum-hukum, janji, ancaman, sifat-sifat orang-orang yang cinta kepada kebaikan dan sifat-sifat orang-orang yang cinta kejahatan diulang-ulang di dalamnya. Diulang-ulang pula di dalamnya nama-nama Allah dan sifat-sifatNya. Ini merupakan keagungan dan keindahan al-Quran. Sebab, Allah, tatkala Dia mengetahui kebutuhan manusia kepada kandungan-kandungan (makna-makna) nya yang dapat menyucikan hati lagi menyempurnakan akhlak, dan sesungguhnya makna-makna tersebut bagi hati laksana air bagi minuman pepohonan. Sebagaimana pepohonan, apabila ia makin jauh dari air, maka makin berkuranglah ia, bahkan bisa jadi ia musnah. Dan semakin ia banyak mendapat air, maka ia menjadi indah dan membuahkan berbagai jenis buah-buahan yang bermanfaat, demikian pula halnya dengan hati, ia selalu membutuhkan berulang-ulangnya makna-makna Firman Allah padanya; dan sesungguhnya kalau satu makna hanya berulang satu kali kepadanya dalam seluruh isi al-Quran, niscaya hati tidak merasakan apa-apa dan ia sama sekali tidak akan memperoleh hasil apa pun darinya. Maka dari itu, dalam penulisan tafsir saya menggunakan metode yang sangat indah ini, dengan mencontoh apa yang menjadi tafsiran baginya. Maka dari itu anda tidak akan menjumpai di dalam tafsir ini hawalah (petunjuk, rujukan, footnote) kepada satu tema bahasan, melainkan setiap tempat anda akan menjumpai tafsirannya sendiri dengan makna yang sempurna tanpa memperhatikan tafsiran-tafsiran yang terdahulu yang serupa dengannya. Namun, sebagian topik ada yang lebih sederhana (tafsirannya) daripada yang lainnya dan lebih banyak faidahnya. Maka dari itu hendaknya para pembaca al-Quran, yang merenungkan makna-maknanya jangan mengabaikan perenungan pada seluruh topik-topik dari al-Quran, sebab dengan begitu ia akan mendapatkan banyak kebaikan dan manfaat yang sangat banyak sekali. Oleh karena al-Quran yang agung ini seperti ini keagungan dan kebesarannya, maka ia berpengaruh di dalam hati orang-orang yang mempunyai pikiran lagi mendapat petunjuk. Maka dari itu Allah berfirman, “Gemetar karenanya kulit orang-orang yang takut kepada Rabbnya,” karena di dalamnya terdapat ancaman, hal-hal yang menakutkan yamg sangat mengerikan, “kemudian menjadi tenang kulit dan hati mereka di waktu mengingat Allah,” yaitu di saat disebutkan harapan dan dorongan (berbuat baik) di dalamnya. Al-Quran itu kadang-kadang memotivasi mereka untuk melakukan kebaikan dan kadang-kadang mempertakuti mereka dari perbuatan jahat. “Itu,” yakni yang dijelaskan oleh Allah tersebut, berupa pengaruh al-Quran kepada mereka “adalah petunjuk Allah,” maksudnya, hidayah dariNya kepada hamba-hambaNya, dan ia termasuk dalam deretan karunia dan kebaikanNya kepada mereka. “Dia menunjuki dengannya,” maksudnya, melaluinya “siapa yang dikehendakiNya” di antara hamba-hambaNya. Boleh juga bahwa yang dimaksud dari FirmanNya, ”itu” adalah al-Quran yang telah Kami ungkapkan kepada kalian itu. “adalah petunjuk Allah” yang tidak ada jalan lain yang bisa mengantarkan kepada Allah kecuali dari al-Quran itu. “Dia menunjuki dengannya siapa yang dikehendakiNya” di antara hamba-hambaNya yang niatnya baik, sebagaimana telah Dia Firmankan, “Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridaan-Nya ke jalan keselamatan” (Al-Maidah:16). “Dan barangsiapa yang disesatkan Allah, maka tidak ada seorang pun pemberi petunjuk baginya,” sebab tidak ada jalan yang bisa mengantarkan kepadaNya kecuali taufikNya. Dan taufik itu sendiri adalah untuk mau menerima kitabNya. Kalau hal ini tidak ia peroleh, maka tidak ada jalan menuju hidayah, maka yang ada kemudian hanyalah kesesatan yang nyata dan kesengsaraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 23: (Allah telah menurunkan perkataan yang paling baik yaitu Kitab) Alquran; lafal Kitaaban menjadi Badal lafal Ahsanal Hadiitsi (yang serupa) satu sama lainnya sama dalam hal Nuzhum dan hal-hal lainnya (lagi berulang-ulang) diulang-ulang di dalamnya janji dan ancaman serta hal-hal lainnya (gemetarlah karenanya) yakni gemetar karena takut di kala disebutkan ancaman-Nya (kulit orang-orang yang takut) yang merasa takut (kepada Rabbnya, kemudian menjadi tenang kulit dan kalbu mereka di waktu mengingat Allah) sewaktu ingat akan janji-Nya. (Itulah) kitab Alquran itu (petunjuk Allah, dengan Kitab itu Dia menunjuki siapa yang dikehendaki-Nya. Dan barang siapa yang disesatkan Allah, niscaya tak ada baginya seorang pemberi petunjuk.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kitab yang diturunkan-Nya, bahwa ia adalah perkataan yang paling baik secara mutlak dan sebagai kitab yang terbaik di antara kitab-kitab yang diturunkan. Jika Al Qur’an merupakan kitab yang terbaik, maka dapat diketahui bahwa lafaz-lafaznya adalah lafaz yang paling fasih dan jelas, dan bahwa maknanya adalah makna yang paling agung, karena ia adalah sebaik-baik perkataan baik pada lafaz maupun maknanya. Baik dalam hal indahnya maupun kesamaannya dan tidak ada pertentangan di dalamnya dari berbagai sisi. Oleh karena itu, setiap kali orang yang mememikirkannya melakukan tadabbur dan tafakkur, maka ia akan mengetahui kesamaannya, bahkan pada maknanya yang tersembunyi yang dapat membuat tercengang orang-orang yang memperhatikannya, dan dapat membuat seseorang memastikan bahwa Al Qur’an ini berasal dari Tuhan Yang Mahabijaksana lagi Maha Mengetahui. Inilah maksud mutasyaabih (kemiripan) dalam ayat tersebut. Adapun tentang firman Allah Ta’ala, “Dia-lah yang menurunkan Al kitab (Al Quran) kepada kamu. di antara (isi) nya ada ayat-ayat yang muhkamaat, itulah pokok-pokok isi Al Qur'an dan yang lain (ayat-ayat) mutasyaabihaat.” (Terj. Ali Imran: 7) maksud mutasyabihat di ayat ini adalah yang masih samar dipahami oleh kebanyakan manusia, dan kesamaran ini tidaklah hilang kecuali dengan mengembalikan kepada ayat-ayat yang muhkamat (jelas). Demikian yang dijelaskan oleh Syaikh As Sa’diy. Maksud berulang-ulang di sini ialah hukum-hukum, pelajaran dan kisah-kisah itu diulang-ulang dalam Al Quran agar lebih kuat pengaruhnya dan lebih meresap, demikian pula diulang-ulang janji dan ancaman, targhib (dorongan) dan tarhib (menakuti-nakuti), sifat orang-orang yang baik dan sifat orang-orang yang buruk, serta nama-nama Allah dan sifat-Nya. Sebagian ahli tafsir mengatakan bahwa maksudnya bahwa ayat-ayat Al Quran itu diulang-ulang membacanya dalam shalat seperti halnya surat Al Faatihah. Allah Subhaanahu wa Ta'aala mengetahui kebutuhan makhluk kepada makna dan kandungan Al Qur’an yang menyucikan hati dan menyempurnakan akhlak, dan bahwa makna-maknanya bagi hati ibarat air bagi tumbuh-tumbuhan yang butuh sering disiram. Jika penyiraman dilakukan berulang kali, maka tentu hasil tumbuhannya akan baik; mengeluarkan berbagai macam buah-buahan yang bermanfaat. Oleh karena keadaan Al Qur’an begitu agung dan mulia, maka ia berpengaruh sekali bagi hati ulul albab yang mendapatkan petunjuk, sehingga membuat hati merea bergetar. Maksudnya orang-orang yang takut kepada Allah bergemetar kulitnya ketika mengingat ancaman Allah Subhaanahu wa Ta'aala dan menjadi tenang ketika mengingat janji-Nya. Kata dzaalika (itu) di ayat ini bisa kembalinya kepada Al Qur’an yang telah disebutkan sifatnya, dan bisa juga kembali kepada pengaruh yang dihasilkan oleh Al Qur’an. Dimana tidak ada jalan yang menyampaikan kepada Allah selain jalan yang ditunjukkannya. Yang baik niatnya sebagaimana firman Allah Ta’ala di ayat yang lain, “Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridhaan-Nya ke jalan keselamatan, dan (dengan kitab itu pula) Allah mengeluarkan orang-orang itu dari gelap gulita kepada cahaya yang terang benderang dengan seizin-Nya, dan menunjuki mereka ke jalan yang lurus.” Karena tidak ada jalan yang dapat menyampaikan kepada-Nya kecuali dengan taufiq-Nya dan taufiq-Nya untuk mendatangi kitab-Nya. Jika tidak memperoleh taufiq untuk itu, maka tidak ada jalan untuk memperoleh petunjuk, dan tidak ada lagi setelahnya selain kesesatan dan kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 23",
    "description": "Allah telah menurunkan perkataan yang memiliki susunan kata dan kandungan paling baik, yaitu Al-Qur'an yang serupa keindahan susunan antara ayat-ayatnya lagi disebut berulang-ulang baik redaksi, hukum, pelajaran, maupun kisahnya agar membawa pengaruh kuat pada diri pembacanya. Allah menurunkan Al-Qur'an yang gemetar karenanya kulit orang-orang yang takut kepada tuhannya ketika mendengar per-ingatan dan ancaman di dalamnya, kemudian menjadi tenang kulit dan hati mereka ketika mengingat Allah dan mendengar berita serta janji yang menggembirakan. Itulah petunjuk Allah bagi orang-orang yang mau mendengarkan; dengan kitab itu dia memberi petunjuk kepada siapa yang dia kehendaki. Dan barang siapa dibiarkan sesat dari jalan kebenaran oleh Allah lantaran lebih memilih jalan kesesatan dan berpaling dari kebenaran daripada mengikuti tuntunan rasulullah, maka tidak seorang pun yang dapat memberi-Nya petunjuk dan menuntunnya menuju jalan kebenaran. 24. Maka, apakah orang-orang yang tangannya terbelenggu lalu berusaha melindungi diri dengan wajahnya untuk menghindari azab yang buruk pada hari kiamat sama dengan orang mukmin yang selamat dari azab dan berhasil masuk surga' tentu tidak sama. Dan dikatakan kepada orang-orang yang berbuat zalim dan syirik, 'rasakanlah olehmu balasan atas apa yang telah kamu kerjakan berupa kekafiran dan kemusyrikan di dunia. '."
  }
]