[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang dicampakan kedalam api neraka dalam keadaan terbelenggu, sehingga dia tidak bisa melindungi diri dari neraka kecuali dengan wajahnya, karena kekafiran dan kesesatannya, lebih baik daripada orang yang mendapatkan kenikmatan di dalam surga karena Allah memberinya petunjuk? di hari itu dikatakan kepada orang-orang yang zhalim, ”rasakanlah akibat buruk dari kemaksiatan-kemaksiatan yang dulu kalian usahakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Apakah orang yang Kami beri petunjuk dan taufik di dunia serta Kami masukkan dia ke dalam Surga pada hari Kiamat seperti orang yang kafir dan mati di atas kekufurannya, lalu Kami memasukkannya ke dalam Neraka dengan kedua tangan dan kedua kaki terbelenggu sehingga dia tidak bisa melindungi dirinya dari Neraka kecuali dengan wajahnya yang dia terjungkir di atasnya? Dikatakan kepada orang-orang yang menganiaya diri mereka dengan kekufuran dan kemaksiatan sebagai celaan terhadap mereka, “Rasakanlah akibat dari perbuatan kalian, yaitu kekufuran dan kemaksiatan, ini adalah balasan untuk kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Apakah orang yang dilempar ke dalam neraka dalam keadaan tangan terbelenggu sehingga dia tidak dapat menghindari neraka melainkan dengan wajahnya akibat kekafiran dan kesesatannya, dia itu lebih baik, atau orang yang mendapat kenikmatan di surga berkat taufik dan hidayah dari Allah? Pada hari itu akan dikatakan kepada orang-orang zalim: “Rasakanlah akibat dari perbuatan maksiat dan dosa yang dulu kalian lakukan di dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَفَمَن يَتَّقِى بِوَجْهِهِۦ سُوٓءَ الْعَذَابِ يَوْمَ الْقِيٰمَةِ ۚ (Maka apakah orang-orang yang menoleh dengan mukanya menghindari azab yang buruk pada hari kiamat) Yakni apakah dia seperti orang yang aman dan tidak tertimpa azab itu sedikitpun serta tidak perlu untuk menghindar karena ia telah selamat dari segala keburukan dan tenang di surga Allah dan keridhaan-Nya. وَقِيلَ لِلظّٰلِمِينَ ذُوقُوا۟ مَا كُنتُمْ تَكْسِبُونَ(Dan dikatakan kepada orang-orang yang zalim: “Rasakanlah olehmu balasan apa yang telah kamu kerjakan”)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Maka apakah orang-orang yang melindungi wajahnya anggota tubuhnya yang lain menghindari adzab yang buruk ketika mereka bertemu di neraka tangannya terbelenggu ke lehernya, sebagaimana orang yang beriman dengan tanpa kebencian, selamat dari segala keburukan. Karena masuk surga. Dan dikatakan pada orang-orang yang dzalim dan kaum musyrikin Makkah dan lainnya: rasakanlah balasan dari amal yang telah kalian perbuat selama di dunia, yakni dosa kufur dan maksiat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang yang menghindari azab yang buruk dengan wajahnya pada hari kiamat} Apakah orang yang menjaga dirinya menggunakan wajahnya dari azab paling dahsyat pada hari kiamat karena tangannya terikat di lehernya seperti orang yang beriman yang tidak ditimpa apapun dari hal itu {Dikatakan kepada orang-orang yang zalim,“Rasakanlah (balasan) sesuatu yang telah kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Maksudnya, apakah sama orang yang diberi hidayah oleh Allah dan diberi taufik dariNya untuk menempuh jalan yang bisa mengantarkan ke negeri kemuliaanNya dengan orang yang berada dalam kesesatan dan terus dalam sikap keras kepalanya hingga Hari Kiamat datang, lalu azab yang sangat besar menimpanya, lalu ia menghindarkan wajahnya yang merupakan anggota tubuh yang paling mulia, yang sekecil apa pun azab dapat berpengaruh terhadapnya, dan ia memalingkan wajahnya dari azab yang sangat buruk itu, padahal kedua tangan dan kedua kakinya sudah dibelenggu?! “Dan dikatakan kepada orang-orang yang zhalim” terhadap dirinya dengan melakukan kekafiran dan kemaksiatan, sebagai hinaan dan cercaan, “Rasakanlah olehmu balasan apa yang telah kamu kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 24: (Maka apakah orang yang menghindarkan) supaya jangan dilemparkan (dirinya ke dalam azab yang paling buruk di hari kiamat), azab yang paling keras, seumpamanya ia dicampakkan ke dalam neraka dalam keadaan terbelenggu tangannya disatukan dengan kepalanya, sama dengan orang yang beriman kepadanya yang dimasukkan ke dalam surga? (Dan dikatakan kepada orang-orang yang aniaya) yakni orang-orang kafir Mekah (\"Rasakanlah oleh kalian balasan apa yang telah kalian kerjakan\") sebagai pembalasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu ia kesulitan menghindarkan mukanya dari azab karena tangan dan kakinya dibelenggu. Yang menzalimi diri mereka dengan kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 24",
    "description": "Maka, apakah orang-orang yang tangannya terbelenggu lalu berusaha melindungi diri dengan wajahnya untuk menghindari azab yang buruk pada hari kiamat sama dengan orang mukmin yang selamat dari azab dan berhasil masuk surga' tentu tidak sama. Dan dikatakan kepada orang-orang yang berbuat zalim dan syirik, 'rasakanlah olehmu balasan atas apa yang telah kamu kerjakan berupa kekafiran dan kemusyrikan di dunia. '25. Tidakkah orang-orang musyrik mekah itu mengambil pelajaran dari kehancuran umat-umat durhaka terdahulu' orang-orang yang hi-dup sebelum mereka telah mendustakan rasul-rasulnya sebagaimana me-reka mendustakan nabi Muhammad, maka saat mereka lengah datang-lah kepada mereka azab Allah secara tiba-tiba dari arah yang tidak mereka sangka."
  }
]