[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26 Orang-orang sebelum kaummu (wahai rasul) juga telah mendustakan rasul-rasul mereka, lalu azab datang kepada mereka dari arah dimana mereka tidak menyangka bahwa ia akan datang, kemudian Allah membuat umat-umat yang mendustakan itu mencicipi azab dan kehinaan di dunia, dan di akhirat Allah menyediakan siksa yang lebih pedih dan lebih keras. Sekiranya orang-orang musyrik itu mengetahui bahwa apa yang menimpa mereka disebabkan kekafiran dan pendustaan mereka, niscaya mereka akan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Umat-umat sebelum kaum musyrikin itu telah mendustakan, maka azab datang kepada mereka secara tiba-tiba di mana mereka tidak menyadarinya sehingga mereka bisa menghadapinya dengan bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Hai Muhammad, orang-orang sebelum kaummu juga telah mendustakan para rasul mereka, maka azab menimpa mereka ketika mereka tidak menyadari kedatangannya; sehingga umat-umat yang mendustakan itu merasakan azab dan kehinaan di dunia; dan Allah telah menyiapkan bagi mereka azab yang lebih berat di akhirat. Seandainya mereka mengetahui apa yang telah menimpa mereka akibat kekafiran dan pendustaan yang mereka lakukan, niscaya mereka akan menjadikannya pelajaran dan ibrah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ (Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul)) Yakni orang-orang kafir sebelum zaman Nabi Muhammad telah mendustakan rasul-rasul mereka. فَأَتَىٰهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ (maka datanglah kepada mereka azab dari arah yang tidak mereka sangka) Yakni dari arah yang tidak mereka sangka akan datang azab darinya, yaitu di saat mereka dalam keadaan lalai dan merasa aman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Orang-orang penduduk Makkah sebelum mereka telah mendustakan Rasul-Rasul, maka turunlah adzab dari Allah dari segala arah yang tidak mereka sangka-sangka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang sebelum mereka} sebelum orang-orang kafir Mekkah {telah mendustakan (rasul). Lalu datang kepada mereka} lalu datang kepada mereka {azab dari arah yang tidak mereka sadari} yang tidak mereka perkirakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Orang-orang sebelum mereka telah mendustakan,” maksudnya, umat-umat terdahulu, sebagaimana mereka (kaum kafir Quraisy) mendustakan, “maka datanglah kepada mereka azab dari arah yang tidak mereka sangka,” datang menimpa mereka saat mereka lalai di pagi hari atau di saat mereka tidur siang hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 25: (Orang-orang yang sebelum mereka telah mendustakan) rasul-rasulnya yang mengatakan bahwa azab pasti datang (maka datanglah kepada mereka azab dari arah yang tidak mereka sangka) yang tidak mereka duga sedikit pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana mereka yang mendustakan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 25",
    "description": "Tidakkah orang-orang musyrik mekah itu mengambil pelajaran dari kehancuran umat-umat durhaka terdahulu' orang-orang yang hi-dup sebelum mereka telah mendustakan rasul-rasulnya sebagaimana me-reka mendustakan nabi Muhammad, maka saat mereka lengah datang-lah kepada mereka azab Allah secara tiba-tiba dari arah yang tidak mereka sangka. 26. Maka Allah menimpakan kepada mereka azab dan kehinaan pada kehidupan dunia serta menyiapkan bagi mereka azab yang pedih di akhirat. Dan sungguh, azab akhirat lebih besar daripada azab dunia. Kalau saja mereka mengetahui hal itu niscaya mereka akan beriman dan berbuat baik. Hanya kebodohan dan ketundukan pada hawa nafsu yang membuat mereka tersesat."
  }
]