[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26 Orang-orang sebelum kaummu (wahai rasul) juga telah mendustakan rasul-rasul mereka, lalu azab datang kepada mereka dari arah dimana mereka tidak menyangka bahwa ia akan datang, kemudian Allah membuat umat-umat yang mendustakan itu mencicipi azab dan kehinaan di dunia, dan di akhirat Allah menyediakan siksa yang lebih pedih dan lebih keras. Sekiranya orang-orang musyrik itu mengetahui bahwa apa yang menimpa mereka disebabkan kekafiran dan pendustaan mereka, niscaya mereka akan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Maka Allah menimpakan kepada mereka azab yang menghinakan dan memalukan di kehidupan dunia ini, dan azab Akhirat yang menanti mereka lebih besar dan lebih berat seandainya mereka mengetahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَأَذَاقَهُمُ اللهُ الْخِزْىَ (Maka Allah merasakan kepada mereka kehinaan) Yakni kerendahan dan kehinaan. فِى الْحَيَوٰةِ الدُّنْيَا ۖ( pada kehidupan dunia) Dengan kutukan, penenggelaman ke dalam bumi, terbunuh dalam perang, tertawan, dan lain sebagainya. وَلَعَذَابُ الْاٰخِرَةِ أَكْبَرُ ۚ (Dan sesungguhnya azab pada hari akhirat lebih besar) Sebab azab itu sangat berat dan kekal. لَوْ كَانُوا۟ يَعْلَمُونَ (kalau mereka mengetahui) Yakni seandainya mereka termasuk orang yang mau berfikir dan beramal sesuai dengan ilmunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Maka Allah menimpakan kehinaan kepada mereka di dunia, seperti pembunuhan, pengucilan, kerugian, kerusakan dan lain sebagainya, sdang adzab akhirat benar-benar pedih dan kekal, dan adzab akhirat lebih besar bagi mereka atas apa yang mereka dustakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Allah menimpakan kepada mereka kehinaan} kehinaan dan kerendahan {di kehidupan dunia. Sungguh azab akhirat lebih besar jika mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Maka Allah merasakan kepada mereka” dengan azab tersebut “kehinaan pada kehidupan dunia,” dimana mereka benar-benar dipermalukan di hadapan Allah dan di hadapan makhlukNya. “Dan sungguh azab pada hari akhirat lebih besar kalau mereka mengetahui,” maka hendaklah mereka waspada dari sikap terus mendustakan, karena mereka akan ditimpa azab seperti yang telah menimpa umat-umat terdahulu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 26: (Maka Allah merasakan kepada mereka kehinaan) artinya, mereka dihina dan direndahkan dengan berupa kutukan, pembunuhan dan lain sebagainya (pada kehidupan dunia. Dan sesungguhnya azab pada hari akhirat lebih besar kalau mereka) yakni orang-orang yang mendustakannya (mengetahui) azab akhirat, dan niscaya kalau mereka mengetahuinya maka mereka tidak akan mendustakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan azab itu. Mereka menjadi hina di hadapan Allah dan di hadapan makhluk-Nya. Oleh karena itu, hendaknya mereka yang mendustakan itu berhati-hati jika tetap mendustakan, sehingga mereka ditimpa azab sebagaimana yang menimpa umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 26",
    "description": "Maka Allah menimpakan kepada mereka azab dan kehinaan pada kehidupan dunia serta menyiapkan bagi mereka azab yang pedih di akhirat. Dan sungguh, azab akhirat lebih besar daripada azab dunia. Kalau saja mereka mengetahui hal itu niscaya mereka akan beriman dan berbuat baik. Hanya kebodohan dan ketundukan pada hawa nafsu yang membuat mereka tersesat. 27-28. Al-qur'an adalah kitab yang berisi tuntunan hidup bagi umat manusia, salah satunya dengan jalan menyajikan perumpamaan. Dan sungguh, telah kami buatkan dalam Al-Qur'an ini segala macam perum-pamaan tentang umat-umat terdahulu yang Allah binasakan. Perumpamaan itu kami tujukan bagi umat manusia agar mereka dapat memperoleh pelajaran lalu menyadari kesalahannya. Kitab tersebut yaitu Al-Qur'an yang redaksinya tersusun dalam bahasa arab; tidak ada kebengkokan atau ajaran yang salah di dalamnya. Kami turunkan Al-Qur'an itu agar mereka bertakwa kepada Allah dan meninggalkan kekafiran."
  }
]