[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah membuat perumpamaan, yaitu seorang hamba sahaya yang dimiliki beberapa sekutu yang bertikai, sehingga hamba sahaya ini bingung dalam membuat mereka semuanya ridha, dan dengan seorang hamba lainnya yang hanya dimiliki oleh seorang pemilik saja, dia mengetahui apa yang diinginkan dan diridhoinya. Apakah mereka sama? Tentu saja tidak sama. Begitulah orang-orang musyrik, dia dalam kebingungan dan kebimbangan, sementara orang mukmin dalam ketenangan dan ketentraman. Maka pujian yang sempurna lagi lengkap hanyalah milik Allah semata, sebaliknya orang-orang musyrik tidak mengetahui kebenaran sehingga mereka tidak mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Allah membuat perumpamaan bagi orang musyrik dan orang yang bertauhid seorang hamba sahaya yang dimiliki oleh dua majikan yang berbeda kepentingan, bila dia mencari kerelaan sebagian dari mereka, maka dia membuat marah sebagian yang lainnya, hamba sahaya ini dalam kebingungan dan kegoncangan. Dan seorang hamba sahaya yang dimiliki oleh satu orang majikan saja, dia adalah pemilik tunggalnya, dia mengetahui keingiannya, maka dia tenang dan tenteram. Tentu saja kedua hamba sahaya tersebut tidak sama. Segala puji bagi Allah, akan tetapi kebanyakan dari mereka tidak mengetahuinya, karena itu mereka menyekutukan Allah dengan selain-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah membuat perumpamaan dengan seorang budak yang dimiliki oleh dua tuan yang saling berselisih, sehingga budak itu merasa bingung dalam melayani kedua tuannya. Sedangkan budak lain dimiliki oleh satu tuan saja, sehingga dia tau apa yang diinginkan dan disukai tuannya. Apakah kedua budak ini sama keadaannya? Sungguh tidak sama. Demikian pula orang musyrik, dia berada dalam keraguan dan kebingungan. Sedangkan orang beriman berada dalam keyakinan dan ketentraman. Kebenaran sepenuhnya dan pujian yang sempurna hanya milik Allah semata; akan tetapi orang-orang musyrik tidak mengetahui kebenaran itu dan tidak mendapat petunjuk kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. رَّجُلًا فِيهِ شُرَكَآءُ مُتَشٰكِسُونَ (seorang laki-laki (budak) yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan) Yakni Allah membuat perumpamaan bagi orang musyrik yang menyembah lebih dari satu tuhan dengan seorang budak yang dimiliki oleh beberapa orang yang selalu berselisih dan bertentangan. وَرَجُلًا سَلَمًا لِّرَجُلٍ(n seorang budak yang menjadi milik penuh dari seorang laki-laki (saja)) Dan Allah membuat perumpamaan bagi orang yang mengesakan Allah dengan seorang budak yang dimiliki oleh satu orang saja. هَلْ يَسْتَوِيَانِ مَثَلًا ۚ( Adakah kedua budak itu sama halnya?) Yakni budak yang dimiliki oleh orang banyak yang memiliki sifat yang berbeda-beda dan niat yang berbeda-beda pula, dan budak itu dipekerjakan namun setiap mereka tidak puas dengan pekerjaannya, apakah budak ini sama dengan budak yang hanya dimiliki oleh satu orang yang tidak berselisih dengan pemilik lain, jika budak ini mentaatinya maka ia akan puas dan ridha, dan jika dia melanggar perintahnya maka ia memaafkannya. Perbedaan antara dua budak ini sangat jelas, tidak akan ada orang berakal yang mampu menyatakan bahwa keduanya sama. Dan inilah perumpamaan orang yang menyembah Allah semata dengan orang yang menyembah tuhan yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Allah membuat perumpamaan bagi orang musyrik yaitu: suatu keadaan asing yang tidak sama dengan keadaan lainnya – seorang lelaki yang memiliki kerajaan yang dimiliki oleh beberapa orang yang berserikat, dan diantara mereka terjadi perbedaan sebab buruknya akhlak dan tabiat mereka, setiap dari mereka menginginkan harta tersebut untuk digunakannya, dan seorang lelaki yang memiliki satu kerajaan yang tidak ada perserikatan didalamnya, apakah diantara kedua laki-laki tersebut sama, orang-orang yang berserikat dalam perselisihan, dengan orang yang menjadi pemilik penuh dari seorang saja? Ada perbedaan jelas diantara keduanya, pertama: yang ingin berkhidmah kepada para tuan-tuannya seperti kemusyrikan, dan kedua yang ingin sedikit berkhidmah kepada hanya satu tuannya saja, keduanya berbeda, segala puji bagi Allah yang Esa yang tidak ada sekutu bagiNya, akan tetapi mereka kaum musyrikin kebanyakan tidak mengamalkan kebenaran, mereka menyekutukan Allah, sebab lalainya mereka dalam kebodohannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah membuat perumpamaan, seorang laki-laki yang dimiliki oleh beberapa orang yang berserikat} hamba sahaya yang dibiliki oleh orang-orang yang berserikat {yang dalam keadaan berselisih} bertentangan {dan seorang laki-laki yang menjadi milik seorang} yang murni milik satu orang saja, tidak ada yang berselisih tentang dirinya {Apakah keduanya sama. Segala puji bagi Allah, tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Kemudian Allah memberikan perumpamaan bagi syirik dan tauhid, seraya berfirman, “Allah membuat perumpamaan yaitu seorang laki-laki,” yakni, budak sahaya, “yang dimiliki oleh beberapa orang yang berserikat yang dalam perselisihan”; mereka banyak dan mereka tidak sepakat pada satu perkara pun dan tidak pula sepakat pada satu kondisi yang bisa memberikan ketenangan hatinya, malah mereka bertengkar dan berselisih mengenainya, masing-masing mempunyai tuntutan yang hendak ia laksanakan, sedangkan yang lain menghendaki lain dari itu. Bagaimana menurut anda keadaan si budak sahaya tadi dalam menghadapi orang-orang yang berserikat lagi berselisih kemauan? “Dan seorang budak yang menjadi milik penuh dari seorang laki-laki saja,” maksudnya, murni miliknya dan sahaya itu mengetahui maksud (tujuan) tuannya sehingga ia memperoleh rasa tenang yang sempurna; “Apakah kedua budak itu sama.” Maksudnya, apakah kedua budak itu sama “halnya?” jelas keduanya tidak sama. Demikian juga orang-orang yang musyrik kepada Allah, ia memiliki banyak sembahan-sembahan yang berbeda-beda. Ia berdoa kepada sembahan yang satu, lalu berdoa kepada sembahan yang lain! Maka anda melihatnya tidak mempunyai kemantapan, dan hatinya tidak tenang pada satu keadaan. Sedangkan orang yang bertauhid tulus kepada Rabbnya, Allah telah melepaskannya dari perbuatan mempersekutukanNYa dengan yang lain, sehingga ia berada dalam kondisi sangat lapang dan sangat tenang. “Adakah keduanya sama halnya? Segala puji bagi Allah” atas penjelasan yang haq dari yang batil dan arahanNya kepada orang-orang yang bodoh. “Tetapi kebanyakan mereka tidak mengetahui.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 29: (Allah telah membuat) bagi orang yang musyrik dan orang yang bertauhid (perumpamaan yaitu seorang laki-laki) lafal Rajulan ini menjadi Badal dari lafal Matsalan (yang menjadi budak milik beberapa orang yang berserikat dalam perselisihan) yaitu mereka terlihat di dalam persengketaan dan akhlak mereka sangat buruk (dan seorang budak laki-laki yang menjadi milik penuh) milik sepenuhnya (dari seorang laki-laki saja; adakah kedua budak itu sama halnya?) lafal Matsalan berkedudukan menjadi Tamyiz maksudnya, tentu saja tidak sama antara seorang budak yang menjadi milik suatu kelompok dengan seorang budak yang menjadi milik penuh seorang saja. Sesungguhnya, budak yang pertama tadi apabila disuruh oleh masing-masing dari pemilik dirinya secara sekaligus; ia bingung, siapakah yang harus ia layani di antara mereka. Ini adalah perumpamaan orang yang musyrik sedangkan budak yang kedua adalah perumpamaan bagi orang yang bertauhid. (Segala puji bagi Allah) semata (tetapi kebanyakan mereka) penduduk Mekah (tidak mengetahui) azab apakah yang akan menimpa mereka akibat kemusyrikannya, oleh karena itu mereka berbuat kemusyrikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidaklah sama antara seorang hamba milik orang banyak dengan seorang hamba sahaya milik seorang saja, karena yang pertama (seorang hamba milik orang banyak) jika diminta oleh para pemiliknya dalam waktu yang sama, tentu ia akan bingung siapakah di antara pemiliknya yang lebih dulu ia layani, dan ia tidak mungkin dapat istirahat, sedangkan mereka semua minta dilayani pada saat itu. Ini adalah perumpamaan untuk orang musyrik, di mana ia berdoa kepada sembahan yang ini, lalu sembahan yang itu, kemudian yang di sini, kemudian yang di sana, sedangkan orang yang kedua (hamba sahaya miliki seorang saja) adalah perumpamaan untuk orang yang bertauhid. Mereka tidak mengetahui akibat dari perbuatan mereka, sehingga mereka berani berbuat syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 29",
    "description": "Allah membuat perumpamaan dalam Al-Qur'an tentang orang-orang yang menyekutukan Allah dan yang mengesakan-Nya. Perumpamaan itu berupa seorang budak laki-laki dewasa dan kuat yang dimiliki oleh beberapa orang yang berserikat, yang diperebutkan dalam perselisihan, membuat budak itu bingung menentukan siapa yang harus ia ikuti, dan perumpamaan satunya berupa seorang hamba sahaya lain yang menjadi milik penuh dari seorang saja sehingga ia tahu pasti siapa tuannya. Adakah kedua hamba sahaya itu sama keadaannya' tentu tidak sama. Segala puji bagi Allah yang telah membuat perumpamaan yang jelas itu sebagai pelajaran, tetapi kebanyakan mereka tidak mengetahui pelajaran yang dipaparkan sehingga mereka tersesat. 30-31. Wahai nabi Muhammad, sesungguhnya engkau akan mati dan kembali ke hadirat tuahnmu, dan mereka yang ingkar itu pun akan mati pula. Kemudian, sesungguhnya kamu semua pada hari kiamat akan berbantah-bantahan di hadapan tuhanmu, kemudian dia akan memberi keputusan secara adil; orang beriman akan mendapatkan surga dan orang kafir akan mendapatkan siksa neraka. []."
  }
]