[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah hanya milik Alah semata segala ketaatan yang sempurna yang bebas dari syirik , dan orang-orang yang mempersekutukan Allah dengan selainnya dan mengangkat sekutu-sekutu selainNya berkata ’Kami tidak menyembah tuhan-tuhan itu bersama Allah kecuali agar ia memberi syafaat kepada Kami di sisi Allah dan mendekatkan kedudukan Kami di sisiNya. Akibatnya mereka menjadi kafir karena itu, sebab ibadah dan syafaat hanya milik Allah semata. Sesungguhnya Alah menetapkan keputusanNya diantara orang-orang yang beriman yang ikhlas dengan orang-orang yang menyekutukanNya dengan sesuatu di hari kiamat dalam perkara yang mereka perselisihkan terkait dengan ibadah mereka, lalu Dia membalas masing-masing sesuai dengan haknya. Sesungguhnya Allah tidak memberikan taufik kepada jalan yang lurus bagi siapa yang berdusta atas nama Allah lagi kafir kepada ayat-ayat dan hujjah-hujjahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ingatlah bahwa hanya milik Allah agama yang bersih dari noda-noda syirik. Orang-orang yang mengangkat wali selain Allah berupa berhala dan ṭagut yang mereka sembah selain Allah, mereka beralasan ketika menyembah berhala-berhala itu dengan mengatakan, \"Kami tidak menyembah mereka melainkan karena mereka mendekatkan kedudukan kami di sisi Allah, menyampaikan hajat kami kepada Allah, membantu kami di sisi Allah. Sesungguhnya Allah menetapkan keputusan-Nya di antara orang-orang Mukmin yang bertauhid dengan orang-orang kafir yang musyrik pada hari Kiamat dalam perkara yang mereka perselisihkan, yaitu Tauhid. Sesungguhnya Allah tidak membimbing pada kebenaran orang yang berdusta atas nama Allah dengan menisbahkan sekutu bagi-Nya, mengingkari nikmat-nikmat Allah atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. ketaatan penuh yang bersih dari kesyirikan hanya bagi Allah Semata; adapun orang-orang yang menyembah selain Allah dan membuat penolong-penolong selain-Nya serta berkata ‘Kami tidak menyembah tuhan-tuhan itu disamping menyembah Allah kecuali agar mereka memberi syafaat kepada kami di sisi Allah, mendekatkan kami kepada-Nya dan meninggikan derajat kami di sisi-Nya’, maka sungguh mereka telah kafir akibat perkataan itu; sebab ibadah dan syafaat hanya bagi Allah, Dia tidak akan ridha dipersekutukan dengan yang lain. Syubhat ini telah jelas kebatilannya, Allah tidak akan memberi hidayah kepada agama-Nya bagi orang yang berdusta terhadap Allah dan mengingkari ayat-ayat dan risalah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. أَلَا لِلّٰهِ الدِّينُ الْخَالِصُ ۚ (Ingatlah, hanya kepunyaan Allah-lah agama yang bersih (dari syirik)) Yakni ibadah yang penuh keikhlasan bagi Allah yang terbebas dari segala kesyirikan, adapun agama-agama selain ini bukanlah agama Allah yang Dia perintahkan untuk menjalankannya. وَالَّذِينَ اتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآء(Dan orang-orang yang mengambil pelindung selain Allah (berkata)) Yakni berpalinglah dari selain Allah, yaitu dari berhala-berhala yang mereka sembah. مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَآ إِلَى اللهِ زُلْفَىٰٓ (“Kami tidak menyembah mereka melainkan supaya mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya”) Jika dikatakan kepada mereka: “siapa Tuhan dan pencipta kalian, dan siapa yang menciptakan langit dan bumi serta menurunkan air dari langit?” Mereka akan mengatakan: “Allah.” Dan jika mereka ditanya lagi: “lalu mengapa kalian menyembah berhala-berhala itu?” mereka menjawab: “agar berhala-berhala itu mendekatkan kami kepada Allah dan memberi kami syafa’at di sisi-Nya. إِنَّ اللهَ يَحْكُمُ بَيْنَهُمْ (Sesungguhnya Allah akan memutuskan di antara mereka) Yakni antara orang-orang yang mengesakan Allah dan orang-orang yang menyekutukan-Nya. فِى مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ (apa yang mereka berselisih padanya) Yakni tentang perselisihan mereka dalam beragama, antara yang menyesakan Allah dan yang menyekutukan-Nya; sebab setiap golongan dari mereka mengaku berada dalam kebenaran. إِنَّ اللهَ لَا يَهْدِى مَنْ هُوَ كٰذِبٌ كَفَّارٌ(Sesungguhnya Allah tidak menunjuki orang-orang yang pendusta dan sangat ingkar) Yakni Allah tidak akan memberi petunjuk bagi orang yang berdusta yang mengatakan bahwa tuhan-tuhan itu dapat mendekatkan mereka kepada Allah, dan bagi orang yang kafir akibat menjadikan mereka tuhan-tuhan dan sekutu-sekutu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. ingatlah! Haanya milik Allah ajaran yang murni, dari syirik dan riya’. Wahai orang-orang yang menyembah dan meminta pertolongan kepada selain Allah, kepada patung-patung yang disembah, kepadakesesatan-kesesatan dengan tidak mengEsakan Allah, merekaberkata: kami tidak menyembah mereka, melainkan berharap mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya, dan mereka memberi kami syafaat, Allah tidak menunjukkan hidayah pada yang demikian, yaitu pada para pendusta yang nyata, dan pada orang yang sangat ingkar untuk menyembah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketahuilah hanya untuk Allah agama yang murni itu} ketaatan dan ibadah yang bersih dari kemusyrikan {Orang-orang yang mengambil pelindung selain Dia} tuhan selain Allah {(berkata) “Kami tidak menyembah mereka, kecuali agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya”} tempat yang dekat {Sesungguhnya Allah akan memberi keputusan di antara mereka tentang apa yang mereka perselisihkan. Sesungguhnya Allah tidak memberi petunjuk} tidak membimbing {kepada pendusta lagi sangat ingkar} sangat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Ingatlah, hanya kepunyaan Allah-lah agama yang bersih.” Ini adalah penegasan perintah ikhlas dan penjelasan bahwasanya Allah, sebagaimana halnya kepunyaanNya-lah semua kesempurnaan dan karunia atas hamba-hambaNya dari segala sisi, maka demikian juga, hanya milikNya-lah agama yang bersih lagi bebas dari segala noda. Itulah agama yang diridhaiNya dan diridhai oleh manusia pilihanNya dan yang diperintahkan kepada mereka, sebab ia berisi mempertuhankan Allah dalam mencintaiNya, takut dan berharap kepadaNya, berinabah (kembali) kepadaNya dalam beribadah kepadaNya dan berinabah kepadaNya dalam mencari segala kebutuhan hamba-hambaNya. Itulah yang bisa memperbaiki kalbu, membersihkan dan menyucikannya; kecuali mempersekutukanNya dalam ibadah apa pun, karena Allah anti darinya dan persekutuan itu sedikit pun tidak layak bagi Allah. Sebab, Dia adalah Tuhan yang paling tidak membutuhkan syirik (persekutuan) dan syirik itu merusak kalbu, ruh, dunia dan akhirat dan sangat menyengsarakan jiwa dengan kesengsaraan yang paling menyakitkan. Maka dari itu, setelah Allah memerintahkan tauhid dan ikhlas, Allah melarang syirik kepadaNya (mempersekutukanNYa) dan Dia menginformasikan celaan terhadap siapa pun yang mempersekutukanNya, seraya berfirman, “Dan orang-orang yang mengambil pelindung selainNYa,” maksudnya, berlindung kepada mereka dengan menyembah dan berdoa kepada mereka, sambil mengemukakan pembelaan terhadap diri mereka dan berkata, “Kami tidak menyembah mereka melainkan supaya mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya,” maksudnya, agar mereka mengajukan segala kebutuhan kami kepada Allah dan menjadi pemberi syafaat bagi kami di sisiNya, kalau bukan demikian, maka sesungguhnya kami mengetahui bahwasanya berhala-berhala itu tidak bisa menciptakan sesuatu, tidak memberi rizki dan tidak memiliki sesuatu apa pun. Maksudnya, orang-orang musyrik itu telah mengabaikan apa yang telah Allah perintahkan, yaitu ikhlas (tauhid), dan mereka dengan lancang telah berani melakukan perbuatan haram yang paling besar, yaitu syirik. Mereka mengkiaskan Tuhan yang tidak ada sesuatu apa pun yang menyerupaiNya, Yang Maharaja nan Mahagung dengan raja-raja (para penguasa). Mereka beranggapan berdasarkan akal mereka yang rusak dan pikiran mereka yang sakit, bahwasanya kalaulah para raja tidak mungkin bisa langsung ditemui kecuali melalui orang-orang terdekatnya, orang-orang kepercayaannya dan para menterinya yang mengajukan berbagai kepentingan (tuntutan) rakyatnya, dan membujuknya untuk mengasihani rakyatnya serta memudahkan segala permasalahan dalam hal tersebut, maka demikian juga Allah. Analogi (kiyas) seperti ini adalah analogi yang paling rusak; karena mengandung makna penyetaraan sang Khaliq (Pencipta) dengan makhluk, padahal sudah pasti terdapat perbedaan yang sangat besar antara keduanya secara akal, syari dan fitrah. Para raja membutuhkan perantara (para pembantu) yang menghubungkan mereka dengan rakyatnya, sebab mereka tidak mengeathui kondisi rakyat, maka dari itu dibutuhkan orang yang memberitahu mereka tentang kondisi rakyat secara langsung; dan barangkali tidak ada rasa kasih saying di dalam hati mereka kepada orang yang mempunyai keperluan (tuntutan), sehingga dibutuhkan orang yang bisa membuat hati mereka kasihan kepada orang itu dan membahasakan keperluannya kepada mereka. Dan mereka membutuhkan para pembantu dan para menteri, dan rakyat takut kepada mereka, sehingga para raja mau memenuhi kebutuhan orang-orang yang berperantara kepada mereka demi menghormati dan menjaga perasaan mereka. Para raja itu juga sebenarnya orang-orang fakir, kadang menahan sesuatu karena takut miskin. Adapun, Rabb, Allah Dia-lah yang pengetahuanNya meliputi segala sesautu, baik terhadap perkara-perkara yang Nampak maupun perkara-perkara yang tidak Nampak. Dia tidak membutuhkan kepada orang yang menginformasikan kepadaNya tentang keadaan hamba-hambaNya, dan Dia juga adalah Yang Maha Pengasih, Maha Pemurah, tidak membutuhkan kepada salah seorang makhlukNya untuk menjadikanNya mengasihi hamba-hambaNya. Bahkan Dia lebih kasih (saying) kepadac mereka daripada diri mereka sendiri dan daripada kedua orangtua mereka. Dia-lah yang menghimbau dan mengajak mereka untuk melakukan sebab-sebab yang dengannya mereka bisa mendapat rahmat (kasih bsayang) Nya, dan Dia menghendaki kemaslahatan mereka yang tidak mereka kehendaki untuk diri mereka. Dia-lah yang Mahakaya, yang milikNya-lah kekayaan yang sempurna lagi absolut (mutlak), yang kalau seandainya seluruh manusia dari yang terdahulu hingga yang terkemudianberkumpul di satu tempat lalu semuanya memohon kepadaNya, kemudian Dia beri masing-masing permohonan dan harapannya, maka mereka tidak mengurangi sedikitpun kekayaanNya kecuali seperti berkurangnya samudra apabila sebilah jarum ditenggelamkan ke dalamnya (lalu diangkat). Dan seluruh pemberi syafaat takut kepadaNya, sehingga tidak seorang pun di antara mereka dapat memberikan syafaat kecuali dengan izinNya, dan milikNYa-lah seluruh syafaat. Dengan perbedaan-perbedaan ini dapat diketahui kebodohan orang-orang musyrikin, kedangkalan pikiran mereka dan betapa lancangnya mereka kepada Allah. Dan juga diketahui hikmah (rahasia di balik) kenapa syirik itu tidak diampuni Allah, yaitu karena syirik mengandung arti melecehkan Allah. Maka dari itu Dia berfirman seraya memberikan keputusan antara kedua golongan orang-orang yang bertauhid dan orang-orang musyrik, dan di dalamnya terdapat ancaman bagi kaum musyrikin, “Sesungguhnya Allah akan memutuskan di antara mereka tentang apa yang mereka berselisih padanya.” Sudah dimaklumi bahwa keputusanNya adalah bahwa orang-orang beriman yang berlaku ikhlas ditempatkan di dalam surge-surga kenikmatan, sedangkan siapa saja yang mempersekutukan Allah, maka Allah telah mengharamkan surge baginya dan tempat tinggalnya adalah neraka. “Sesungguhnya Allah tidak memberi petunjuk,” maksudnya, tidak membimbing menuju hidayah pada jalan yang ingkar.” Maksudnya, orang yang karakternya adalah dusta atau kufur, di mana nasihat-nasihat dan ayat-ayat sampai kepadanya, namun apa yang menjadi karakternya tidak pernah hilang darinya. Dan Allah memperlihatkan kepadanya tanda-tanda (mukjizat) namun ia mengingkari, kafir dan mendustakannya. Maka orang yang seperti ini, bagaimana mungkin bisa mendapat petunjuk, karena dia telah menutup pintu rapat-rapat atas dirinya sendiri, dan ia dihukum dengan ditutup oleh Allah akan hatinya, maka dari itu ia tidak beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 3: (Ingatlah, hanya kepada Allahlah ketaatan yang murni itu) tiada seorang pun yang berhak menerimanya selain-Nya. (Dan orang-orang yang mengambil selain-Nya) yang mengambil berhala-berhala (sebagai pelindung) mereka adalah orang-orang kafir Mekah yang mengatakan, (\"Kami tidak menyembah mereka melainkan supaya mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.\") yakni untuk mendekatkan diri kami kepada-Nya. Lafal Zulfaa adalah Mashdar yang maknanya sama dengan lafal Taqriiban/mendekatkan diri. (Sesungguhnya Allah akan memutuskan di antara mereka) dan kaum Muslimin (tentang apa yang mereka berselisih padanya) tentang masalah agama, maka kelak orang-orang yang beriman akan masuk surga dan orang-orang yang kafir akan masuk neraka. (Sesungguhnya Allah tidak menunjuki orang yang pendusta) yaitu orang yang mengatakan terhadap Allah, bahwa Dia mempunyai anak (lagi sangat ingkar) karena menyembah kepada selain-Nya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan taqrir (penguatan) perintah untuk berbuat ikhlas (beribadah hanya kepada Allah dan ikhlas dalam menjalankannya), sekaligus untuk menerangkan bahwa Allah Subhaanahu wa Ta'aala sebagaimana Dia memiliki semua kesempurnaan dan karunia atas hamba-hamba-Nya, maka milik-Nya pula agama yang bersih dari campuran syirk. Agama yang bersih dari syirk itulah agama yang diridhai-Nya bagi Diri-Nya dan bagi makhluk pilihan-Nya, dan Dia memerintahkan manusia untuk memeluknya. Hal itu karena agama tersebut mengandung peribadatan kepada Allah, mencintai-Nya, takut dan berharap kepada-Nya, serta kembali kepada-Nya dalam beribadah dan kembali kepada-Nya untuk mencapai segala kebutuhan hamba. Agama tersebut adalah agama Islam yang memerintahkan tauhid dan menjauhi syirk. Agama Islam inilah yang memperbaiki lahir dan batin manusia, bukan agama syirk yang Allah berlepas darinya. Adapun agama syirk, apa pun nama agamanya maka ia merusak lahir dan batin manusia, merusak kehidupan dunia dan akhiratnya dan membuatnya sengsara. Setelah Allah Subhaanahu wa Ta'aala memerintahkan tauhid dan berbuat ikhlas, maka Dia melarang syirk dan memberitahukan tercelanya orang-orang yang berbuat syirk. Seperti halnya orang-orang musyrik Mekah yang menyembah patung dan berhala. Maksud mereka adalah agar patung-patung dan berhala yang mereka sembah itu mengangkat kebutuhan mereka kepada Allah dan menjadi perantara antara mereka dengan Allah Subhaanahu wa Ta'aala. Mereka menyamakan antara Allah dengan raja-raja di dunia, di mana raja-raja di dunia memiliki perantara yang mengantarkan permohonan rakyat kepada rajanya. Penyamaan ini adalah qiyas yang paling fasid (rusak), karena menyamakan antara Pencipta dengan makhluk yang berbeda jauh keadaannya baik secara akal, dalil maupun fitrah. Jika kita perhatikan, para raja di dunia butuh perantara antara mereka dengan rakyatnya karena mereka (para raja) tidak mengetahui keadaan rakyatnya yang datang, sehingga perlu perantara yang memberitahukan keadaan rakyat yang datang itu. Demikian pula terkadang dalam hati mereka (para raja) tidak ada rasa kasihan kepada orang yang butuh, sehingga orang yang butuh itu mencari perantara yang berusaha melunakkan hati raja. Adapun Allah Subhaanahu wa Ta'aala, maka pengetahuan-Nya meliputi yang tampak maupun yang tersembunyi, tidak butuh diadakan makhluk yang memberitahukan keadaan hamba-Nya, dan Dia juga Yang Paling Penyayang dan Paling Pemurah, tidak butuh mengadakan makhluk yang menjadi penyayang hamba-hamba-Nya, bahkan Allah Subhaanahu wa Ta'aala lebih sayang kepada mereka daripada diri mereka dan ibu-bapak mereka. Dia pula yang mendorong dan mengajak mereka mendatangi sebab-sebab untuk memperoleh rahmat-Nya, dan Dia menginginkan hal yang terbaik untuk mereka. Dia Mahakaya dan tidak membutuhkan makhluk-Nya, bahkan kalau seandainya semua makhluk berkumpul di tanah yang lapang, lalu meminta keperluan mereka kepada-Nya, kemudian Dia memberikan masing-masingnya kebutuhan mereka, maka tidaklah berkurang apa yang ada di sisi-Nya kecuali sebagaimana jarum yang dicelupkan ke lautan kemudian diangkat, di mana hal ini menunjukkan tidak berkurang sedikit pun, padahal Dia senantiasa memberi dan terus memberi dari sejak Dia menciptakan langit dan bumi. Di samping itu, makhluk yang diberi izin memberi syafaat sangat takut kepada-Nya, sehingga tidak ada seorang pun yang berani memberikan syafaat kecuali dengan izin-Nya, dan lagi semua syafaat milik-Nya. Berdasarkan perbedaan ini dapat diketahui kebodohan kaum musyrik dan beraninya mereka kepada Allah Subhaanahu wa Ta'aala. Dari sini pun kita mengetahui hikmah mengapa Allah Subhaanahu wa Ta'aala tidak mengampuni dosa syirk, yaitu karena di dalamnya terdapat pencacatan kepada Allah Subhaanahu wa Ta'aala. Oleh karena itu, pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala berfirman akan memberikan keputusan antara dua golongan yang berselisih, yaitu antara orang-orang yang berbuat ikhlas dengan orang-orang musyrik, sekaligus memberikan ancaman keras terhadap kaum musyrik. Keputusan-Nya nanti adalah Dia akan memasukkan orang-orang yang berbuat ikhlas ke dalam surga, sedangkan orang yang berbuat syirk, maka Allah akan mengharamkan surga baginya dan tempatnya adalah neraka. Yakni tidak akan memberi taufiq untuk menempuh jalan yang lurus. Seperti orang yang mengatakan bahwa Allah punya anak. Yaitu orang-orang yang menyembah selain Allah Subhaanahu wa Ta'aala. Pendusta dan orang yang ingkar ini setelah diberi nasehat dan ditunjukkan ayat, namun ia tetap mengingkarinya dan berdusta, maka bagaimana mungkin orang yang seperti ini akan memperoleh hidayah, sedangkan dia telah menutup pintunya terhadap dirinya serta mendapat hukuman Allah dengan dicap hatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 3",
    "description": "Ingatlah, hanya milik Allah agama yang murni tanpa dicampuri kemusyrikan. Dan orang-orang yang mengambil pelindung serta penolong selain dia dengan menuhankan berhala, patung, dan benda-benda lainnya berdalih, 'kami mengakui Allah sebagai pencipta, tetapi dia terlalu tinggi untuk kami dekati sehingga kami harus menyembah berhala-berhala tersebut. Kami tidak menyembah mereka melainkan agar mereka membantu mendekatkan kami kepada Allah dengan sedekat-dekatnya. ' sungguh, Allah akan memberi putusan di antara mereka yang mengesakan Allah dan yang mempersekutukan-Nya tentang apa yang mereka perse-lisihkan. Sungguh, Allah tidak memberi petunjuk kepada pendusta yang menuhankan berhala, orang yang meyakini Allah memiliki anak, dan orang yang sangat ingkar terhadap kekuasaan dan keesaan Allah. 4. Sekiranya Allah hendak mengambil anak, sebagaimana anggapan orang-orang musyrik, tentu dia akan memilih apa yang dia kehendaki dari apa yang telah diciptakan-Nya, bukan menuruti apa yang menjadi anggapan orang musyrik. Mahasuci dia dari segala yang menyerupai-Nya. Dialah Allah yang maha esa tanpa sekutu, mahaperkasa dalam menciptakan alam raya."
  }
]