[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada seseorang yang lebih zhalim daripada orang yang membuat kebohongan atas Nama Allah dengan menisbahkan sesuatu kepada Allah yang tidak patut denganNya seperti sekutu dan anak, atau dia berkata, “Aku diberi wahyu.” Padahal dia tidak diberi wahyu apa pun. Dan tidak ada seorang pun yang lebih zhalim daripada seseorang yang mendustakan kebenaran yang turun kepada Muhammad. Bukankah neraka adalah tempat kembali dan tempat tinggal orang-orang yang kafir kepada Allah, tidak membenarkan Muhammad dan tidak melaksanakan apa yang dia bawa? Benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Tidak ada seorang pun yang lebih zalim daripada orang yang menuduhkan kepada Allah sesuatuyang tidak layak bagi-Nya, seperti sekutu, istri dan anak, dan mendustakan Al-Qur`ān. Tidak seorang pun yang lebih zalim daripada orang yang mendustakan wahyu yang dibawa oleh Rasulullah -ṣallallāhu 'alaihi wa sallam-. Bukankah di Neraka tersedia tempat kembali dan tempat tinggal bagi orang-orang yang kafir kepada Allah dan tidak membenarkan risalah yang dibawa oleh Rasulullah? Ya, sesungguhnya tempat kembali dan tempat tinggal bagi mereka di Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Allah mengingkari dan mengolok orang-orang yang mendustakan-Nya: “Tidak ada orang yang lebih zalim daripada mereka dan daripada orang yang mendustakan al-Qur’an. Bukankah di neraka terdapat tempat bagi orang-orang yang mendustakan itu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى اللهِ (Maka siapakah yang lebih zalim daripada orang yang membuat-buat dusta terhadap Allah) Yakni tidak ada orang yang lebih zalim daripada orang yang berdusta terhadap Allah, yang mengatakan bahwa Dia memiliki anak, sekutu, atau pasangan. وَكَذَّبَ بِالصِّدْقِ إِذْ جَآءَهُۥٓ ۚ( dan mendustakan kebenaran ketika datang kepadanya?) Yakni apa yang didatangkan Rasulullah seperti seruannya kepada Tauhid, perintahnya untuk menjalankan kewajiban-kewajiban syari’at, larangannya dari segala hal haram, dan berita yang beliau sampaikan tentang hari kebangkitan. أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكٰفِرِينَ(Bukankah di neraka Jahannam tersedia tempat tinggal bagi orang-orang yang kafir?) Makna (المثوى) yakni tempat tinggal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Tidak ada yang lebih zalim dari pada orang yang membuat-buat kebohongan terhadap Allah, dengan menganggap bahwa Allah mempunyai sekutu, atau memiliki anak, atau memiliki teman. Ketika mendengarkan bacaan Alquran, mereka mendustakan kebenaran Alquran yang dibawa oleh nabi Muhammad SAW. Bukankah neraka Jahannam itu tempat tinggal untuk orang-orang kafir? Benar, Jahannam adalah tempat mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka siapakah yang lebih zalim} maka tidak ada yang lebih zalim {daripada orang yang membuat kebohongan terhadap Allah} membuat-buat kebohongan terhadap Allah, lalu beranggapan bahwa Dia memiliki anak dan sekutu {dan mendustakan kebenaran} Al-Qur’an {ketika datang kepadanya. Bukankah di neraka Jahanam terdapat tempat tinggal} tempat tinggal dan menetap {bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berfirman mewanti-wanti dan mengabarkan bahwasanya tidak ada yang lebih zhalim dan lebih sadis kezhalimannya “daripada orang yang membuat-buat dusta terhadap Allah,” maupun dengan cara menyandarkannya kepada apa yang tidak layak bagi kebesaranNya, atau dengan cara mengaku menjadi nabi, atau menginformasikan bahwasanya Allah telah mengatakan ‘begini’ atau menginformasikan ‘begitu’ atau memutuskan ‘begini’, padahal dia berdusta. Ini masuk dalam Firman Allah, “dan (mengharamkan) mengada-adakan terhadap Allah apa yang tidak kamu ketahui\". (Al-A’raf: 33), meskipun dia adalah orang bodoh. Kalau tidak, maka dia lebih keji dan lebih keji. Atau “mendustakan (kebenaran) ketika datang kepadanya,” maksudnya, tidak ada yang lebih zhalim daripada orang yang sampai kepadanya kebenaran yang diperkuat dengan bukti-bukti lalu ia mendustakannya. Pendustaan yang dilakukannya itu sendiri adalah kezhaliman yang sangat besar darinya, sebab ia menolak kebenaran setelah kebenaran itu menjadi jelas baginya. Dan jika ia melakukan keduanya: berdusta terhadap Allah dan mendustakan kebenaran, maka itu adalah kezhaliman (zhalim yang sangat parah). “Bukankah di NEraka Jahanam tersedia tempat tinggal bagi orang-orang kafir?,” yang menyebabkan mereka akan menjerit-jerit dan diberi pembalasan terhadap setiap orang yang zhalim dan yang kafir atas hak Allah. “sesungguhnya mempersekutukan (Allah) adalah benar-benar kelaliman yang besar\". (Luqman: 13)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 32: (Maka siapakah) artinya, tiada seorang pun (yang lebih aniaya daripada orang yang membuat-buat dusta terhadap Allah) dengan cara menisbatkan kepada-Nya mempunyai sekutu dan anak (dan mendustakan kebenaran) Alquran (ketika datang kepadanya. Bukankah di neraka Jahanam tersedia tempat tinggal) yakni tempat menetap (bagi orang-orang yang kafir?) tentu saja disediakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman memberikan peringatan dan memberitahukan bahwa tidak ada yang lebih zalim daripada orang yang mengadakan kedustaan terhadap Allah Subhaanahu wa Ta'aala. Seperti menisbatkan sekutu dan anak kepada-Nya atau menisbatkan sesuatu yang tidak layak lainnya kepada-Nya. Termasuk pula mengaku menjadi nabi atau memberitahukan bahwa Allah berfirman begini dan begitu atau memutuskan ini dan itu, padahal ia dusta. Hal ini termasuk ke dalam firman Allah Ta’ala “Wa antaquuluu ‘alallahi maa laa ta’lamuun” (dan (termasuk dosa besar) kamu berkata terhadap Allah apa yang tidak kamu ketahui). Yakni tidak ada yang lebih zalim daripada orang yang mendustakan kebenaran ketika datang dengan membawa bukti-buktinya, karena sama saja ia menolak kebenaran setelah jelas baginya, dan jika ia menggabung antara berdusta terhadap Allah dan mendustakan yang hak, maka berarti zalim ditambah zalim. Di sana hak Allah akan diambil dari orang zalim dan kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 32",
    "description": "Pada ayat yang lalu digambarkan bahwa nanti di hari kemudian manusia akan saling berbantah-bantahan di hadapan Allah, lalu Allah memberi putusan-Nya. Keputusan itu berupa anugerah bagi yang berbuat baik dan sanksi bagi yang berbuat zalim. Maka siapakah yang lebih zalim daripada orang yang membuat-buat kebohongan terhadap Allah dengan mengatakan bahwa da mempunyai sekutu, dan mendustakan kebenaran, yakni Al-Qur'an, yang datang kepadanya melalui rasul' bukankah mereka sudah diberitahu bahwa neraka jahanam tempat tinggal bagi orang-orang kafir' inilah sanksi yang ditimpakan Allah bagi orang-orang kafir. 33. Dan berbeda dengan orang-orang kafir itu, ada orang yang membawa kebenaran, yakni nabi Muhammad, dan orang yang membenarkannya, yakni orang-orang yang beriman dan menjadi pengikutnya yang setia. Mereka itulah orang yang bertakwa."
  }
]