[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang yang datang membawa kebenaran pada perkataan dan perbuatannya dari kalangan para nabi dan para pengikut mereka dan sekaligus membenarkannya dengan beriman dan mengamalkannya, mereka adalah orang-orang yang menggabungkan antara sifat-sifat takwa, dan dideretan depan dari mereka adalah penutup para nabi dan para rasul, Muhammad dan orang-orang yang beriman kepadanya, yang melaksanakan SyariatNya dari kalangan para sahabat serta orang-orang yang datang sesudah mereka hingga Hari Pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Orang yang datang membawa kebenaran dalam perkataan dan perbuatan, baik dia dari kalangan para Nabi atau selain mereka, membenarkannya dan beriman kepadanya, mengamalkan apa yang menjadi konsekuensinya, mereka adalah orang-orang bertakwa yang sebenarnya, yang melaksanakan perintah Rabb mereka dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-35. Allah memuji Nabi dan orang-orang beriman: “Orang yang datang membawa kebenaran berupa perintah untuk mentauhidkan Allah, yaitu Nabi Muhammad, serta orang-orang yang beriman kepadanya dan mengikuti sunnahnya; mereka yang memiliki derajat yang tinggi itu adalah orang-orang yang benar-benar bertakwa, mereka akan meraih apa yang mereka inginkan di surga. Kedudukan yang tinggi itu merupakan balasan bagi orang-orang yang baik dalam perkataan dan perbuatannya. Allah akan mengampuni dosa-dosa mereka dan membalas mereka dengan surga atas ibadah mereka di surga dengan balasan yang lebih baik daripada apa yang telah mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَالَّذِى جَآءَ بِالصِّدْقِ (Dan orang yang membawa kebenaran (Muhammad)) Yang dimaksud adalah Rasulullah. وَصَدَّقَ بِهِۦٓ ۙ (dan membenarkannya) Yang dimaksud adalah para pengikut Rasulullah. أُو۟لٰٓئِكَ هُمُ الْمُتَّقُونَ (mereka itulah orang-orang yang bertakwa) Pendapat lain mengatakan bahwa orang yang membawa kebenaran adalah Rasulullah dan yang membenarkannya adalah Abu Bakar ash-Shiddiq. Dan pendapat lainnya mengatakan bahwa ini ditujukan bagi siapapun yang menyeru kepada tauhid dan menunjukkan syari’at yang diwajibkan bagi para hamba Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Pembawa Al-quran, yaitu nabi Muhammad dan orang-orang yang membenarkannya, yaitu para mukmin, merekalah yang bertakwa untuk tidak berbuat syirik dan terbebas dari siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang yang datang dengan kebenaran} dalam ucapan dan tindakannya dari golongan para nabi ataupun bukan nabi {dan yang membenarkannya} mengimani dan mengamalkan kandungannya {mereka itulah orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Setelah Allah menjelaskan orang yang berdusta lagi mendustakan tentang orang yang jujur lagi membenarkan dan pahalanya, seraya berfirman, ”Dan orang yang membawa kebenaran” di dalam pembicaraan dan perbuatannya. Masuk ke dalam kelompok ini adalah para Nabi dan orang-orang yang menduduki posisi mereka di antara orang-orang jujur dalam pembicaraannya tentang informasi dari Allah dan hukum-hukumNya, dan dalam apa yang dilakukannya dari karakter-karakter kejujuran. “Dan membenarkannya,” maksudnya, membenarkan kebenaran; sebab bisa saja seseorang datang dengan kebenaran namun ia sendiri tidak membenarkannya disebabkan kesombongannya atau karena ia meremehkan orang yang mengatakannya dan datang dengannya. Maka dalam memuji harus (dari dua sisi:) benar dan membenarkan. Kebenaran (kejujuran) nya membuktikan ilmu dan keadilannya, sedangkan pembenarannya membuktikan sikap tawadhu’ (rendah diri) dan tidak mempunyai sikap sombong. “Mereka itulah,” yakni orang-orang yang dianugerahi dua perkara di atas adalah “orang-orang yang bertakwa,” karena sesungguhnya karakter-karakter takwa kembali kepada sifat jujur kepada kebenaran dan membenarkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 33: (Dan orang yang membawa kebenaran) yaitu Nabi saw. (dan membenarkannya) orang-orang mukmin. Lafal Al-Ladzii di sini bermakna Al-Ladziina, yakni jamak (mereka itulah orang-orang yang bertakwa) maksudnya, yang menghindarkan diri dari kemusyrikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan orang yang berdusta lagi mendustakan kebenaran serta kejahatannya dan hukuman terhadapnya, maka Allah Subhaanahu wa Ta'aala menyebutkan orang yang benar lagi membenarkan dan balasan baginya. Baik dalam ucapannya maupun amalnya. Kebenarannya menunjukkan keilmuan dan keadilannya. Yaitu kaum mukmin. Pembenarannya menunjukkan ketawadhu’an dan tidak sombong."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 33",
    "description": "Dan berbeda dengan orang-orang kafir itu, ada orang yang membawa kebenaran, yakni nabi Muhammad, dan orang yang membenarkannya, yakni orang-orang yang beriman dan menjadi pengikutnya yang setia. Mereka itulah orang yang bertakwa. 34. Sebagai penghargaan dari Allah, mereka memperoleh apa saja yang mereka kehendaki yang terdapat di sisi tuhannya. Demikianlah karunia yang besar sebagai balasan dan anugerah bagi orang-orang yang berbuat baik."
  }
]