[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi mereka apa yang mereka inginkan di sisi Tuhan mereka berupa berbagai bentuk kelezatan dan kesenangan. Itulah balasan orang yang menaati Tuhannya dengan sebenar-benarnya dan menyembahNya dengan sebanar-benarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Mereka akan mendapatkan apa yang mereka kehendaki di sisi Rabb mereka berupa kesenangan yang abadi. Itulah balasan orang-orang yang berbuat baik dalam amal-amal mereka kepada Rabb mereka dan kepada hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ۚ (Mereka memperoleh apa yang mereka kehendaki pada sisi Tuhan mereka) Seperti ditinggikan derajatnya, dijauhkan dari mudharat, diampuni kesalahannya, dan dimasukkan ke dalam surga. ذٰلِكَ جَزَآءُ الْمُحْسِنِينَ(Demikianlah balasan orang-orang yang berbuat baik) Yakni orang-orang yang membaikkan amalan-amalannya. Dalam hadits shahih disebutkan bahwa Rasulullah bersabda: “Ihsan adalah dengan kamu menyembah Allah seakan-akan kamu melihat-Nya, dan jika kamu tidak melihat-Nya maka sesungguhnya Dia melihatmu.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Mereka memperoleh apa yang telah mereka inginkan dari Tuhan mereka. Mereka mendapatkan surga dengan berbagai kenikmatan dan derajat yang luhur. Itu semua adalah balasan untuk amal perbuatan baik yang telah mereka lakukan di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka itu apa saja yang mereka kehendaki di sisi Tuhan mereka. Itulah balasan bagi orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Mereka memperoleh apa yang mereka kehendaki pada sisi Rabb mereka,” berupa pahala yang belum pernah dilihat mata, tidak pernah didengar telinga dan tidak pula pernah terlintas di dalam hati manusia. Semua yang digandrungi oleh kemauan dan kehendaknya dari berbagai jenis kelezatan dan hal-hal yang menggiurkan, semuanya pasti mereka peroleh dan telah disiapkan untuk mereka. “DEmikianlah balasan orang-orang yang berbuat baik,” yaitu orang-orang yang beribadah kepada Allah seakan-akan mereka melihatNYa, dan jika mereka tidak bisa melihatNya, maka (mereka meyakini) bahwa Dia melihat mereka, dan orang-orang yang berbuat baik kepada sesame hamba-hamba Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 34: (Mereka memperoleh apa yang mereka kehendaki pada sisi Rabb mereka. Demikianlah balasan orang-orang yang berbuat baik) untuk diri mereka sendiri, berkat keimanan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berbagai kesenangan yang mereka inginkan akan mereka peroleh dan telah disiapkan. Yaitu mereka yang beribadah kepada Allah seakan-akan mereka melihat-Nya, jika mereka tidak merasakan begitu, maka sesungguhnya Dia melihat mereka. Di samping berbuat ihsan dalam beribadah, mereka juga berbuat ihsan kepada hamba-hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 34",
    "description": "Sebagai penghargaan dari Allah, mereka memperoleh apa saja yang mereka kehendaki yang terdapat di sisi tuhannya. Demikianlah karunia yang besar sebagai balasan dan anugerah bagi orang-orang yang berbuat baik. 35. Di samping itu, orang-orang yang bertakwa juga beroleh janji, agar Allah senantiasa menghapus, yakni memberikan pengampunan atas perbuatan mereka yang paling buruk yang pernah mereka lakukan, dan juga memberi pahala kepada mereka dengan yang terbaik daripada apa yang mereka kerjakan selama hidup di dunia."
  }
]