[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah hendak menghapus perbuatan terburuk yang mereka kerjakan di dunia disebabkan mereka bertaubat dan kembali kepada Allah dengan meninggalkan keburukan yang mereka lakukan dan Allah membalas atas ketaatan mereka di dunia dengan balasan terbaik, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Allah hendak menghapus dari mereka kemaksiatan terburuk yang mereka kerjakan semasa hidup di dunia, karena mereka telah bertobat darinya dan kembali kepada Rabb mereka, membalas mereka dengan memberikan pahala terbaik atas amal-amal saleh yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. لِيُكَفِّرَ اللهُ عَنْهُمْ أَسْوَأَ الَّذِى عَمِلُوا۟ (agar Allah akan menutupi (mengampuni) bagi mereka perbuatan yang paling buruk yang mereka kerjakan) Jika Allah mengampuni amalan mereka yang paling buruk maka ampunan Allah atas amalan buruk yang lebih ringan dari itu adalah lebih utama. وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ الَّذِى كَانُوا۟ يَعْمَلُونَ (dan membalas mereka dengan upah yang lebih baik dari apa yang telah mereka kerjakan) Allah membalas mereka atas amalan-amalan kebaikan mereka dan tidak membalas keburukan. 36. أَلَيْسَ اللهُ بِكَافٍ عَبْدَهُۥ ۖ (Bukankah Allah cukup untuk melindungi hamba-Nya) Yang dimaksud adalah Rasulullah. وَيُخَوِّفُونَكَ بِالَّذِينَ مِن دُونِهِۦ ۚ( Dan mereka mempertakuti kamu dengan (sembahan-sembahan) yang selain Allah?) Yakni maka janganlah kamu takut terhadap tuhan-tuhan mereka dan bala tentaranya yang dengannya mereka menakut-nakutimu. Sebab Allah mampu untuk melindungimu dari segala yang membahayakanmu, sedangkan tuhan-tuhan mereka tidak dapat memberi manfaat dan mudharat. وَمَن يُضْلِلِ اللهُ فَمَا لَهُۥ مِنْ هَادٍ(Dan siapa yang disesatkan Allah maka tidak seorangpun pemberi petunjuk baginya) Yakni barangsiapa yang layak untuk ditetapkan untuk menjadi orang yang tersesat maka tidak akan ada orang yang mampu memberinya petunjuk dan mengeluarkannya dari kesesatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Agar Allah menutupi dan mengampuni perbuatan buruk dan dosa mereka. Juga memberi pahala atas ketaatan dan amal baik yang telah mereka lakukan di dunia. Sebagai balasan yang lebih baik dari pada amal mereka sendiri sebab keimanan dan keikhlasan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Allah menghapus} menghapus {(dosa) perbuatan mereka yang paling buruk yang pernah mereka lakukan dan memberi pahala kepada mereka dengan yang lebih baik daripada apa yang dahulu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Agar Allah akan menutupi bagi mereka perbuatan yang paling buruk yang mereka kerjakan dan membalas mereka dengan upah yang lebih baik dari apa yang telah mereka kerjakan.” Amal perbuatan manusia itu mempunyai tiga kondisi, yaitu: Terburuk, atau terbaik, atau tidak terburuk dan tidak pula terbaik. Bagian yang terakhir ini adalah bagian yang mubah-mubah dan yang tidak ada kaitannya dengan pahala ataupun siksa. Sedangkan yang terburuk adalah semua maksiat, dan yang terbaik adalah semua ketaatan. Maka dengan uraian ini makna ayat di atas menjadi jelas, dan bahwa FirmanNYa, “Agar Allah akan menutupi bagi mereka perbuatan yang paling buruk yang mereka kerjakan,” maksudnya adalah dosa-dosa kecil dan dosa-dosa besar, disebabkan ihsan (perbuatan baik) dan ketakwaan mereka, “dan membalas mereka dengan upah yang lebih baik dari apa yang telah mereka kerjakan,” maksudnya, semua perbuatan baik mereka. “Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar”. (An-Nisa:40)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 35: (Agar Allah menutupi mengampuni bagi mereka perbuatan buruk yang mereka kerjakan dan membalas mereka dengan upah yang baik dari apa yang telah mereka kerjakan) lafal Aswa-a dan Ahsana bermakna As-Sayyi dan Al-Hasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Amal yang dikerjakan manusia ada tiga macam; buruk, baik, dan yang bukan baik dan bukan buruk, yaitu amal yang mubah (boleh) dimana tidak ada pahala dan siksa terhadapnya. Yang buruk adalah semua maksiat, yang baik adalah semua ketaatan. Karena ihsan dan ketakwaan mereka. Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar.” (Terj. An Nisaa’: 40)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 35",
    "description": "Di samping itu, orang-orang yang bertakwa juga beroleh janji, agar Allah senantiasa menghapus, yakni memberikan pengampunan atas perbuatan mereka yang paling buruk yang pernah mereka lakukan, dan juga memberi pahala kepada mereka dengan yang terbaik daripada apa yang mereka kerjakan selama hidup di dunia. 36. Setelah menjelaskan anugerah bagi orang-orang bertakwa, Allah menyatakan pada ayat ini bahwa dialah pelindung hamba-hamba-Nya dengan mencukupi segala keperluan mereka. Bukankah Allah yang mahakuasa dan maha pemurah itu telah mencukupi segala sesuatu yang diperlukan oleh hamba-Nya' mereka, orang-orang musyrikin mekah itu, menakut-nakutimu wahai nabi Muhammad, dengan tuhan-tuhan yang selain dia. Barang siapa yang dibiarkan secara bebas memilih kesesatan oleh Allah dan hatinya cenderung kepada kesesatan itu, maka tidak ada seorang pun yang dapat memberi petunjuk kepadanya."
  }
]