[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukankah Allah telah menjaga hambaNya, Muhammad dari tipu daya dan makar orang-orang musyrik sehingga mereka tidak kuasa menimpakan keburukan kepadanya? Benar, sesungguhnya Allah mencukupkan untuknya baik dalam urusan agama dan dunianya, membelanya dari siapa yang hendak bertindak buruk terhadapnya. Dan mereka wahai Rasul, menakut-nakutimu dengan tuhan-tuhan mereka di mana mereka mengatakan bahwa ia akan menyakitimu. Barangsiapa yang dibiarkan oleh Allah lalu disesatkannya dari jalan kebenaran, maka tidak ada satu pun yang bisa memberinya petunjuk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Bukankah Allah telah mencukupkan urusan agama dan dunia bagi hamba-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- dan melindunginya dari musuhnya? Benar, Dia telah mencukupkannya. Mereka menakut-nakutimu -wahai Rasul-, karena kebodohan dan kedunguan mereka, dari berhala-berhala yang mereka sembah selain Allah, bahwa berhala-berhala tersebut akan marah dan menimpakan keburukan kepadamu. Barangsiapa yang Allah hinakan dan tidak Dia bimbing kepada hidayah, maka tidak ada baginya orang yang menuntun dan membimbingnya kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Allah menyampaikan kabar gembira kepada Rasulullah, bahwa Dia adalah Penjaganya dari tipudaya dan makar orang-orang musyrik: “Bukankah Allah cukup bagi hamba dan Rasul-Nya dari makar orang-orang musyrik? Hai Rasulullah, orang-orang musyrik menakut-nakuti kalian dengan berhala dan pasukan mereka. Barangsiapa yang Allah sesatkan dari kebenaran maka tidak ada baginya penolong dan pemberi petunjuk. Dan barangsiapa yang Allah beri petunjuk ke jalan yang benar maka tidak akan ada yang dapat menyesatkannya. Bukankah Allah Maha Perkasa dalam kerajaan-Nya, dan akan membalas orang-orang pendosa?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. أَلَيْسَ اللهُ بِكَافٍ عَبْدَهُۥ (Bukankah Allah cukup untuk melindungi hamba-Nya) Yang dimaksud adalah Rasulullah. وَيُخَوِّفُونَكَ بِالَّذِينَ مِن دُونِهِۦ( Dan mereka mempertakuti kamu dengan (sembahan-sembahan) yang selain Allah?) Yakni maka janganlah kamu takut terhadap tuhan-tuhan mereka dan bala tentaranya yang dengannya mereka menakut-nakutimu. Sebab Allah mampu untuk melindungimu dari segala yang membahayakanmu, sedangkan tuhan-tuhan mereka tidak dapat memberi manfaat dan mudharat. وَمَن يُضْلِلِ اللهُ فَمَا لَهُۥ مِنْ هَادٍ(Dan siapa yang disesatkan Allah maka tidak seorangpun pemberi petunjuk baginya) Yakni barangsiapa yang layak untuk ditetapkan untuk menjadi orang yang tersesat maka tidak akan ada orang yang mampu memberinya petunjuk dan mengeluarkannya dari kesesatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Bukankah Allah Yang menjaga hamba-Nya (nabi Muhammad SAW) dari segala tipu daya orang musyrik? Tentu, mereka orang-orang musyrik selalu menakut-nakutimu bahwa berhala dan sesembahan mereka dapat memberi keburukan kepadamu wahai Nabi. Maka janganlah takut, Allah selalu menjagamu dari segala yang membahayakanmu. Tuhan dan sesembahan mereka sama sekali tidak mampu memberi kemanfaatan maupun kemadhorotan. Barangsiapa yang dibiarkan dalam kesesatan oleh Allah, maka tidak ada seorangpun yang dapat memberi petunjuk kepadamu. Ayat ini turun ketika orang musyrik berkata kepada Nabi SAW: “Hentikan segera kutukan kalian terhadap tuhan-tuhan kami atau akan kami minta tuhan kami agar membuat kalian menderita.” Hamzah pada kata alaysa adalah sebagai kata tanya yang bermakna mengingkari atau menyangkal. Melihat bahwa laysa juga bermakna mengingkari, ssehingga pengingkarannya pengingkaran yang tetap, sehingga bermakna Allahlah yang mencukupi hamba-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Allah yang mencukupi hambaNya} dengan menjaga Rasulullah Muhammad SAW {Mereka menakut-nakutimu dengan sesembahan selain Dia. Siapa yang dibiarkan sesat oleh Allah maka tidak ada satu pun yang memberi petunjuk kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. “BUkankah Allah cukup untuk melindungi hambaNya?” maksudnya, bukankah termasuk dari bagian kebaikan, kemurahan dan perhatianNYa kepada hambaNya yang melaksanakan pengabdian (Penghambaan) kepadaNya, mematuhi perintah-perintahaNya dan menjauhi larangan-laranganNya, terutama kepada manusia paling sempurna ubudiyahnya kepada Rabbnya, yaitu Muhammad, bahwasanya Allah cukup untuk melindunginya dalam perkara agama dan dunianya, dan membelanya dari orang-orang yang menghendaki keburukan terhadapnya? “Dan mereka mempertakuti kamu dengan yang selain Allah,” seperti berhala dan sembahan-sembahan, bahwa ia akan menimpakan keburukan terhadapmu. Ini benar-benar bagian dari kezhaliman kesesatan mereka. “Dan siapa yang disesatkan Allah, maka tidak seorang pun yang dapat memberi petunjuk baginya. Dan barangsiapa yang diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya.” Karena hanya di Tangan Allah wewenang hidayah dan penyesatan, Dia-lah Yang apa saja yang dikehendakiNya pasti terjadi dan apa saja yang dikehendakiNYa pasti tidak akan terjadi. “Bukankah Allah Mahaperkasa,” kepunyaanNya keperkasaan yang sempurna yang dengannya DIa mengalahkan segala sesuatu, dan dengan keperkasaanNya pula DIa melindungi hambaNya dan menoilak tipudaya mereka terhadapnya, “lagi mempunyai pembalasan” terhadap orang yang mendurhakaiNYa. Maka waspadalah terhadap perbuatan-perbuatan yang dapat mendatangkan pembalasanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 36: (Bukankah Allah cukup untuk melindungi hamba-Nya) yakni Nabi saw. tentu saja, (Dan mereka mempertakuti kamu) khithab ini ditujukan kepada Nabi saw. sendiri (dengan sesembahan-sesembahan yang selain Allah) yakni, berhala-berhala; maksud mereka, bahwa berhala-berhala itu akan membunuhnya atau akan membuatnya cacat. (Dan siapa yang disesatkan Allah maka tidak seorang pun pemberi petunjuk baginya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bukankah Allah Subhaanahu wa Ta'aala karena kemurahan dan perhatian-Nya kepada hamba-Nya Dia yang mencukupkan hamba-Nya baik urusan agama maupun dunianya serta menghindarkan bahaya dari orang yang memusuhinya. Terlebih hamba di sini adalah hamba yang paling sempurna kehambaannya kepada Tuhannya, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Yaitu bahwa sesembahan-sesembahan tersebut akan menimpakan bahaya atau bencana. Anggapan ini muncul karena kesesatan dan kebodohan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 36",
    "description": "Setelah menjelaskan anugerah bagi orang-orang bertakwa, Allah menyatakan pada ayat ini bahwa dialah pelindung hamba-hamba-Nya dengan mencukupi segala keperluan mereka. Bukankah Allah yang mahakuasa dan maha pemurah itu telah mencukupi segala sesuatu yang diperlukan oleh hamba-Nya' mereka, orang-orang musyrikin mekah itu, menakut-nakutimu wahai nabi Muhammad, dengan tuhan-tuhan yang selain dia. Barang siapa yang dibiarkan secara bebas memilih kesesatan oleh Allah dan hatinya cenderung kepada kesesatan itu, maka tidak ada seorang pun yang dapat memberi petunjuk kepadanya. 37. Dan sebaliknya, barang siapa yang hatinya sudah diberi petunjuk oleh Allah, maka tidak akan ada seorang pun yang dapat menyesatkannya. Bukankah Allah mahaperkasa dan mempunyai kekuasaan untuk menghukum orang-orang yang memilih jalan kesesatan'."
  }
]