[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa diberikan taufik oleh Allah kepada iman dan melaksanakan kitabNya dan mengikuti rasulNya, maka tidak ada seorang pun yang bisa menyesatkannya dari jalan kebenaran yang telah dipijaknya. Bukankah Allah itu Mahaperkasa dalam pembalasanNya terhadap orang-orang yang kafir diantara makhluk-Nya dan yang bermaksiat kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Barangsiapa yang Allah bimbing kepada hidayah, maka tidak ada yang mampu menyesatkannya. Bukankah Allah Maha Perkasa, tidak seorang pun bisa mengalahkan-Nya, Maha membalas siapa yang kafir dan mendurhakai-Nya? Benar, Dia Maha Perkasa dan membalas siapa yang durhaka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَمَن يَهْدِ اللهُ فَمَا لَهُۥ مِن مُّضِلٍّ ۗ (Dan barangsiapa yang diberi petunjuk oleh Allah, maka tidak seorangpun yang dapat menyesatkannya) Yakni yang dapat mengeluarkannya dari petunjuk dan menjerumuskannya ke dalam kesesatan. أَلَيْسَ اللهُ بِعَزِيزٍ(Bukankah Allah Maha Perkasa) Yakni yang Berkuasa atas segalanya. ذِى انتِقَامٍ (lagi mempunyai (kekuasaan untuk) mengazab?) Yakni Allah akan membalas orang yang bermaksiat kepadanya dengan azab dan siksaan yang ditimpakan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Barangsiapa telah ditetapkan Allah dalam petunjuk, keimanan dan amal shalih maka tidak ada sesuatu apapun yang dapat memasukkannya dalam kesesatan. Bukankah Allah Maha Menguasai segala sesuatu? Yang Maha Membalas musuh-Nya dan para pendurhaka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang saja yang diberi petunjuk oleh Allah maka tidak ada satu pun yang menyesatkannya. Bukankah Allah Maha perkasa lagi Maha Memiliki (kekuasaan) untuk membalas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. “BUkankah Allah cukup untuk melindungi hambaNya?” maksudnya, bukankah termasuk dari bagian kebaikan, kemurahan dan perhatianNYa kepada hambaNya yang melaksanakan pengabdian (Penghambaan) kepadaNya, mematuhi perintah-perintahaNya dan menjauhi larangan-laranganNya, terutama kepada manusia paling sempurna ubudiyahnya kepada Rabbnya, yaitu Muhammad, bahwasanya Allah cukup untuk melindunginya dalam perkara agama dan dunianya, dan membelanya dari orang-orang yang menghendaki keburukan terhadapnya? “Dan mereka mempertakuti kamu dengan yang selain Allah,” seperti berhala dan sembahan-sembahan, bahwa ia akan menimpakan keburukan terhadapmu. Ini benar-benar bagian dari kezhaliman kesesatan mereka. “Dan siapa yang disesatkan Allah, maka tidak seorang pun yang dapat memberi petunjuk baginya. Dan barangsiapa yang diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya.” Karena hanya di Tangan Allah wewenang hidayah dan penyesatan, Dia-lah Yang apa saja yang dikehendakiNya pasti terjadi dan apa saja yang dikehendakiNYa pasti tidak akan terjadi. “Bukankah Allah Mahaperkasa,” kepunyaanNya keperkasaan yang sempurna yang dengannya DIa mengalahkan segala sesuatu, dan dengan keperkasaanNya pula DIa melindungi hambaNya dan menoilak tipudaya mereka terhadapnya, “lagi mempunyai pembalasan” terhadap orang yang mendurhakaiNYa. Maka waspadalah terhadap perbuatan-perbuatan yang dapat mendatangkan pembalasanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 37: (Dan barang siapa yang diberi petunjuk oleh Allah, maka tidak seorang pun yang dapat menyesatkannya. Bukankah Allah Maha Perkasa) Maha Menang atas semua perkara-Nya (lagi mempunyai pembalasan) terhadap musuh-musuh-Nya. Tentu benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena di Tangan Allah-lah hak memberi hidayah dan menyesatkan, dimana apa yang Dia kehendaki pasti terjadi dan yang tidak Dia kehendaki tidak akan terjadi. Dia memiliki keperkasaan yang sempurna, dimana dengan keperkasaan-Nya Dia tundukkan segala sesuatu dan dengan keperkasaan-Nya Dia cukupkan hamba-Nya dan memberikan perlindungan kepadanya. Kepada orang-orang yang durhaka kepada-Nya. Oleh karena itu, berhati-hatilah terhadap sesuatu yang menyebabkan hukuman-Nya datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 37",
    "description": "Dan sebaliknya, barang siapa yang hatinya sudah diberi petunjuk oleh Allah, maka tidak akan ada seorang pun yang dapat menyesatkannya. Bukankah Allah mahaperkasa dan mempunyai kekuasaan untuk menghukum orang-orang yang memilih jalan kesesatan'38. Ayat yang lalu diakhiri dengan sebuah pertanyaan retorik, bukankah Allah mahaperkasa lagi maha memiliki pembalasan' maka berkaitan dengan itu, ayat-ayat berikut menegaskan bahwa Allah adalah pencipta alam semesta. Argumen tentang itu adalah jawaban yang diberikan oleh orang-orang musyrikin mekah sendiri yang menyembah berhala. Dan sungguh, jika engkau, wahai nabi Muhammad, tanyakan kepada mereka orang-orang musyrikin mekah itu, 'siapakah yang menciptakan langit dan bumi'' niscaya mereka pasti menjawab, 'pencipta langit dan bumi adalah Allah. ' oleh sebab itu, katakanlah kepada mereka, 'kalau begitu, tahukah kamu bagaimana cara menerangkan kepadaku tentang kekuasaan apa yang dimiliki oleh berhala yang kamu sembah selain Allah itu, jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka berhala-berhala itu dapat mencegah rahmat-Nya'' katakanlah, wahai nabi Muhammad, 'cukuplah Allah yang maha esa dan mahaperkasa itu bagiku. Hanya kepada-Nyalah orang-orang yang bertawakal berserah diri setelah berusaha sekuat kemampuannya. '."
  }
]