[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kamu (wahai rasul), bertanya kepada orang-orang musyrik yang menyembah selain Allah itu, “Siapa yang menciptakan langit dan bumi?” niscaya mereka menjawab, “Allah yang menciptakannya.” Mereka mengakui yang Maha Pencipta. Maka katakanlah kepada mereka, “Apakah tuhan-tuhan yang kalian persekutukan dengan Allah itu mampu menjauhkan gangguan dariku yang telah Allah takdirkan kepadaku atau menimpakan keburukan atasku? Apakah ia mampu menahan manfaat yang Allah mudahkan kepadaku atau mencegah rahmat Allah kepadaku?” mereka akan menjawab, “Tidak mampu.” Maka katakanlah kepada mereka, “Allah yang mencukupkan dan menjagaku, kepadaNya-lah orang-orang bersandar dalam mendatangkan kemaslahatan dan menolak kemudaratan mereka. Maka Allah Yang di TanganNya semata ada kecukupan, cukup bagiku dan Dia akan melindungiku dari segala perkara yang membuatku berduka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Bila kamu -wahai Rasul- bertanya kepada kaum musyrikin, “Siapa yang menciptakan langit dan bumi?” Maka mereka akan menjawab, “Allah yang menciptakannya.” Katakanlah kepada mereka untuk menunjukkan kelemahan tuhan-tuhan mereka, “Katakanlah kepadaku tentang berhala-berhala yang kalian sembah selain Allah, jika Allah hendak menimpakan malapetaka kepadaku apakah berhala-berhala itu sanggup mengangkatnya dariku, atau Allah hendak memberiku kebaikan sebagai rahmat dari-Nya, apakah berhala-berhala itu mampu menghalang-halanginya dariku?” Katakanlah kepada mereka, “Allah yang mencukupiku, hanya kepada Allah aku bersandar dalam segala urusanku seluruhnya, hanya kepada Allah semata orang-orang yang bertawakal bersandar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-40. Hai Rasulullah, sungguh jika kamu bertanya kepada kaummu yang musyrik: “Siapa yang menciptakan tujuh langit dan bumi?” niscaya mereka akan menjawab: “Allah”. Katakanlah kepada mereka: “katakan kepadaku apa yang kalian sembah selain Allah; jika Allah menghendaki kesusahan bagiku, apakah yang kalian sembah itu dapat menyingkirkan kesusahan itu dariku? Atau jika Allah menghendaki kebaikan bagiku, apakah yang kalian sembah itu dapat menghalangi kebaikan itu dariku?” Katakanlah kepada mereka: “Cukuplah Allah bagiku, hanya kepada-Nya aku bertawakkal.” Dan katakanlah kepada mereka: “Lanjutkanlah apa yang telah kalian lakukan itu, dan aku akan tetap melakukan apa yang Tuhanku perintahkan kepadaku; dan kelak kalian akan mengetahui siapa yang akan ditimpa azab yang menghinakan dan mendapat azab neraka yang kekal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ لَيَقُولُنَّ اللهُ ۚ (Dan sungguh jika kamu bertanya kepada mereka: “Siapakah yang menciptakan langit dan bumi?”, niscaya mereka menjawab: “Allah”) Allah menyebutkan pengakuan mereka jika mereka ditanya tentang pencipta sesungguhnya bahwa itu adalah Allah, padahal mereka menyembah berhala-berhala. Bagaimana akal mereka dapat membenarkan penyembahan kepada sesuatu yang tidak dapat menciptakan apapun dan penyekutuan Sang Pencipta dengan makhluk-Nya dalam ibadah? قُلْ أَفَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ اللهِ إِنْ أَرَادَنِىَ اللهُ بِضُرٍّ هَلْ هُنَّ كٰشِفٰتُ ضُرِّهِۦٓ( Katakanlah: “Maka terangkanlah kepadaku tentang apa yang kamu seru selain Allah, jika Allah hendak mendatangkan kemudharatan kepadaku, apakah berhala-berhalamu itu dapat menghilangkan kemudharatan itu) Apakah berhala-berhala itu mampu mengangkat musibah yang Allah kehendaki untukku? أَوْ أَرَادَنِى بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكٰتُ رَحْمَتِهِۦ ۚ( atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat menahan rahmat-Nya) Sehingga rahmat itu tidak sampai kepadaku? Dan yang dimaksud dengan rahmat yakni kenikmatan dan kesejahteraan. قُلْ حَسْبِىَ اللهُ ۖ( Katakanlah: “Cukuplah Allah bagiku”) Yakni cukuplah Allah bagiku dalam segala urusanku untuk mencari kenikmatan dan menolak kemudharatan. عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ (Kepada-Nya-lah bertawakkal orang-orang yang berserah diri) Hanya kepada-Nya orang-orang yang berserah diri itu bersandar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Jika engkau bertanya kepada orang-orang musyrik wahai Nabi: “Siapa yang telah menciptakan langit dan bumi?” Mereka pasti akan menjawab: “Allah-lah yang menciptakan keduanya.” Maka setelah mereka berikrar seperti itu katakan kepada mereka: “Beritahu aku mengenai sesembahan kalian selain Allah, yaitu berhala. Jika Allah menimpakan musibah kepadaku apakah sesembahan kalian itu bisa menyelamatkanku? Juga jika Allah memberi kenikmatan kepadaku, apakah sesembahan kalian itu bisa mengambilnya dariku? Tidak.” Maka katakanlah, Allah-lah yang mencukupiku, Dia-lah Yang memberiku kemanfaatan atau menolak keburukan yang menimpaku. Hanya kepada-Nya lah semua bergantung, bukan kepada siapa-siapa yang telah dijadikan sandaran selainyNya. Mereka benar-benar akan tahu bahwa segala sesuatu adalah atas izin-Nya. Muqatil berkata : “Mereka ditanya seperti itu oieh Nabi, kemudian mereka terdiam. Sehingga turunlah ayat ini.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika bertanya kepada mereka siapa yang menciptakan langit dan bumi, niscaya mereka menjawab,“Allah.” Katakanlah,“Apakah kalian mengetahui tentang apa yang kalian sembah selain Allah jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat mencegah} mencegah {rahmatNya” Katakanlah,“Cukuplah bagiku} cukuplah bagiku {Allah. Hanya kepadaNya orang-orang yang bertawakal berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Maksudnya, jika kamu tanyakan kepada mereka kesesatan yang mereka pertakutkan terhadapmu dengan sembahan-sembahan selain Allah dan engkau tegakkan terhadap mereka dalil (argument) dari diri mereka sendiri dengan mengatakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” maka mereka sama sekali tidak akan menetapkan penciptaan sedikit pun kepada sembahan-sembahan mereka itu, (dan) “niscaya mereka menjawab, ‘Allah’,” semata yang telah menciptakannya. “Katakanlah” kepada mereka seraya menyatakan kelemahan sembahan-sembahan mereka setelah engkau jelaskan kekuasaan Allah, “Maka terangkanlah kepadaku,” maksudnya, beritahukanlah kepadaku, “tentang apa yang kamu nseru selain Allah, jika Allah hendak mendatangkan kemudaratan kepadaku,” yakni kemudaratan apa pun, “apakah berhala-berhalamu itu dapat menghilangkan kemudaratan itu,” menghilngkannya secara total atau meringankannya dari satu kondisi ke kondisi yang lebih ringan? “Atau jika Dia hendak memberi rahmat kepadaku,” Dia sampaikan suatu manfaat kepadaku dalam perkara agama atau duniaku dengan rahmat itu, “apakah mereka dapat menahan rahmatNya” dan dapat menghalanginya dariku? Mereka akan menjawab, Tidak, mereka tidak bisa menghilngkan marabahaya dan tidak pula dapat menghalangi rahmat. Lalu katakanlah kepada mereka setelah argumentasi telak itu jelas bagi mereka, bahwa sesungguuhnya hanya Dia semata yang berhak disembah, dan sesungguhnya Dia-lah sang Pencipta semua makhluk, Yang Maha Memberi manfaat lagi kuasa menimpakan marabahaya, sedangkan selain Dia lemah tidak berdaya dari segala sisinya, tidak mampu menciptakan, memberikan manfaat atau menimpakan marabahaya, sambil mengharapkan perlindunganNya dan memohon pembelaanNya atas tipu daya dan makar mereka, “Katakanlah, ‘Cukuplah Allah bagiku. kepadaNya-lah orang-orang yang berserah diri bertawakal,” maksudnya, hanya kepadaNya-lah orang-orang yang berserah diri menyerahkan dirinya dalam mencari manfaat dan menolak marabahaya. Maka Tuhan yang hanya di TangaNya perlindungan, cukuplah Dia bagiku, Dia akan mencukupi apa yang aku perlukan dan apa yang tidak perlu bagiku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 38: (Dan sungguh jika) huruf Lam bermakna qasam (kamu tanyakan kepada mereka, \"Siapakah yang menciptakan langit dan bumi?\" Niscaya mereka menjawab, \"Allah.\" Katakanlah, \"Maka terangkanlah kepadaku tentang apa yang kalian seru) yang kalian sembah (selain Allah) yakni berhala-berhala (jika Allah hendak mendatangkan kemudaratan kepadaku, apakah berhalaberhala kalian itu dapat menghilangkan kemudaratan itu) tentu saja tidak (atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat menahan rahmat-Nya?) tentu saja tidak pula. Menurut suatu qiraat dibaca Kaasyifaati Dhurrihii dan Mumsikaati rahmatihii (Katakanlah, \"Cukuplah Allah bagiku. Kepada-Nyalah bertawakkal orang-orang yang berserah diri\") yaitu orang-orang yang percaya hanya kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bertanya kepada mereka yang sesat itu yang menakut-nakutimu dengan sesembahan selain-Nya dan engkau ingin menegakkan dalil kepada mereka dari diri mereka sendiri. Kepada mereka yang berbuat syirk sambil menetapkan kelemahan sesembahan mereka setelah jelas kemahakuasaan Allah. Secara keseluruhan atau hanya sedikit saja. Seperti manfaat yang terkait dengan agama maupun dunia. Tentu mereka (sesembahan-sesembahan) itu tidak akan mampu menghindarkan bencana dan tidak akan dapat menahan rahmat-Nya. Yakni katakanlah kepada mereka setelah jelas dalilnya bahwa Allah yang berhak disembah, dan bahwa Dia Pencipta semua makhluk, yang memberi manfaat dan berkuasa menimpakan madharat, sedangkan selain-Nya lemah dari berbagai sisi, baik menciptakan, memberi manfaat dan menimpakan madharat sambil meminta kepada Allah pencukupan-Nya dan meminta kepada-Nya agar dihindarkan makar dan tipu daya mereka. Dalam menyelesaikan masalah yang membuatku sedih dan gelisah. Yakni kepada-Nya orang-orang yang bertawakkal bersandar dalam menghasilkan maslahat dan menghindarkan madharat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 38",
    "description": "Ayat yang lalu diakhiri dengan sebuah pertanyaan retorik, bukankah Allah mahaperkasa lagi maha memiliki pembalasan' maka berkaitan dengan itu, ayat-ayat berikut menegaskan bahwa Allah adalah pencipta alam semesta. Argumen tentang itu adalah jawaban yang diberikan oleh orang-orang musyrikin mekah sendiri yang menyembah berhala. Dan sungguh, jika engkau, wahai nabi Muhammad, tanyakan kepada mereka orang-orang musyrikin mekah itu, 'siapakah yang menciptakan langit dan bumi'' niscaya mereka pasti menjawab, 'pencipta langit dan bumi adalah Allah. ' oleh sebab itu, katakanlah kepada mereka, 'kalau begitu, tahukah kamu bagaimana cara menerangkan kepadaku tentang kekuasaan apa yang dimiliki oleh berhala yang kamu sembah selain Allah itu, jika Allah hendak mendatangkan bencana kepadaku, apakah mereka mampu menghilangkan bencana itu, atau jika Allah hendak memberi rahmat kepadaku, apakah mereka berhala-berhala itu dapat mencegah rahmat-Nya'' katakanlah, wahai nabi Muhammad, 'cukuplah Allah yang maha esa dan mahaperkasa itu bagiku. Hanya kepada-Nyalah orang-orang yang bertawakal berserah diri setelah berusaha sekuat kemampuannya. '39. Penjelasan ayat di atas menggambarkan posisi nabi Muhammad ketika berhadapan dengan orang-orang musyrikin mekah yang me-nyembah berhala. Untuk mempertegas posisi itu, Allah memerintahkan kepada nabi Muhammad agar menyampaikan kepada kaumnya untuk mengerjakan apa yang ingin mereka kerjakan dan nabi mengerjakan apa yang nabi kerjakan. Katakanlah wahai nabi Muhammad, 'wahai kaumku! berbuatlah menurut kedudukanmu dan sikap hidup kalian, aku pun berbuat demikian sesuai dengan sikap hidup dan keperca-yaan yang telah dihidayahkan Allah kepadaku. Kelak kamu akan mengetahui apa hasil perbuatan tersebut."
  }
]