[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Katakanlah (wahai Rasul) kepada kaummu yang menentang keras, “Beramallah sesuai dengan keadaan kalian yang kalian ridhai untuk diri kalian, di mana kalian menyembah sesuatu yang tidak berhak disembah dan tidak memiliki dari urusan hidup sedikit pun, sementara aku juga menjalankan apa yang diperintahkan kepadaku, yaitu menghadapkan wajahku hanya kepada Allah semata dalam perkataan-perkataan dan perbuatan-perbuatanku, maka kalian akan mengetahui siapa yang akan didatangi oleh azab yang menghinakannya di dunia, sedangkan di akhirat dia akan ditimpa siksa yang abadi, tidak berakhir dan tidak berkesudahan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Katakanlah -wahai Rasul-, “Wahai kaumku! Beramallah di atas kesyirikan yang kalian ridai untuk diri kalian, sesungguhnya aku juga beramal di atas perintah dari Rabbku, aku berdakwah kepada Tauhid, mengikhlaskan ibadah hanya kepada Allah, kalian pasti akan mengetahui akhir dari setiap pilihan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. قُلْ يٰقَوْمِ اعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ (Katakanlah: “Hai kaumku, bekerjalah sesuai dengan keadaanmu) Yakni sesuai dengan kepercayaan kalian. إِنِّى عٰمِلٌ ۖ( sesungguhnya aku akan bekerja (pula)) Yakni sesuai dengan kepercayaanku. فَسَوْفَ تَعْلَمُونَ (maka kelak kamu akan mengetahui)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Katakanlah wahai Nabi: “ Wahai kaumku, berbuatlah sesuai kedudukan dan posisi kalian. Aku pun juga akan berbuat sesuai posisi dan tugasku. Kelak kalian akan tahu buruknya tempat tinggal kalian, dan kalian akan tahu balasan baik yang akan aku terima."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai kaumku, berbuatlah menurut kedudukan kalian} keadaan yang kalian sukai berupa menyekutukan Allah {Sesungguhnya aku pun berbuat. Kelak kalian akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “katakanlah” kepada mereka wahai Rasul, “Hai kaumku, bekerjalah sesuai dengan keadaanmu.” Maksudnya, menurut keadaan kalian yang kalian suka untuk diri kalian, yaitu beribadah kepada sembahan yang tidak berhak diibadahi sedikitpun dan tidak pula dia mempunyai kekuasaan sedikit pun. “Sesungguuhnya aku akan bekerja pula” menurut apa yang aku serukan kepada kalian, yaitu menuluskan ketaatan Bergama hanya kepada Allah, “maka kelak kamu akan mengetahui” untuk siapa kesudahan yang baik dan “siapa yang akan mendapat siksa yang menghinakannya,” di dunia ini, “dan lagi ditimpa” di akhirat “oleh azab yang kekal,” yang dia tidak dipindah darinya dan tidak pernah ada habis-habisnya. Ini adalah ancaman yang sangat berat bagi mereka, dan mereka mengetahui bahwa sesungguhnya merekalah yang berhak mendapat azab yang kekal, akan tetapi kezhaliman dan sikap keras kepala telah menghalangi mereka untuk beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 39: (Katakanlah, \"Hai kaumku, bekerjalah sesuai dengan keadaan kalian) kondisi kalian (sesungguhnya aku akan bekerja pula) sesuai dengan keadaanku (maka kelak kalian akan mengetahui)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya menurut keadaan kamu yang kamu ridhai untuk dirimu, seperti menyemba sesuatu yang tidak berhak diibadahi dan tidak berkuasa apa-apa. Yakni mengerjakan apa yang aku serukan kepadamu, yaitu mengikhlaskan ibadah kepada Allah Subhaanahu wa Ta'aala saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 39",
    "description": "Penjelasan ayat di atas menggambarkan posisi nabi Muhammad ketika berhadapan dengan orang-orang musyrikin mekah yang me-nyembah berhala. Untuk mempertegas posisi itu, Allah memerintahkan kepada nabi Muhammad agar menyampaikan kepada kaumnya untuk mengerjakan apa yang ingin mereka kerjakan dan nabi mengerjakan apa yang nabi kerjakan. Katakanlah wahai nabi Muhammad, 'wahai kaumku! berbuatlah menurut kedudukanmu dan sikap hidup kalian, aku pun berbuat demikian sesuai dengan sikap hidup dan keperca-yaan yang telah dihidayahkan Allah kepadaku. Kelak kamu akan mengetahui apa hasil perbuatan tersebut. 40. Yaitu mengetahui siapa yang mendapat siksa yang menghinakan dalam kehidupan dunia, dan siapa pula yang kepadanya ditimpakan azab yang kekal di kehidupan akhirat. '."
  }
]