[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Allah hendak mengangkat seorang anak, niscaya Dia memilih siapa yang Dia kehendaki dari makhlukNya maha suci Allah lagi maha tinggi dari kepemilikan terahadap anak, karena Dia maha esa lagi maha tunggal, dimana seluruh makhluk bergantung kepadaNya, yang maha perkasa yang menundukan seluruh makhlukNya dengan kuasaNya, maka segala sesuatu tunduk dan patuh kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Seandainya Allah hendak mengangkat anak, niscaya Allah akan memilih siapa yang Dia kehendaki dari makhluk-Nya, lalu menjadikannya seperti anak. Mahasuci Allah lagi Mahatinggi dari perkataan kaum musyrikin. Allah Maha Esa pada Żat, nama-nama dan sifat-sifat-Nya, tidak ada sekutu bagi Allah, Mahakuat atas segala makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Seandainya Allah hendak mengangkat seorang anak, niscaya Allah akan memilihnya dari makhluk-Nya yang Dia kehendaki. Maha Suci Allah dari memiliki anak, karena Dia Maha Esa, Tempat Bergantung, tidak beranak dan tidak diperanakkan; Dia Maha Kuasa atas makhluk-Nya, segala sesuatu tunduk dihadapan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. لَّوْ أَرَادَ اللهُ أَن يَتَّخِذَ وَلَدًا لَّاصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ ۚ (Kalau sekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang dikehendaki-Nya di antara ciptaan-ciptaan-Nya) Yakni Allah memilih di antara makhluk-makhluk-Nya siapa yang Dia kehendaki sehingga Dia tidak butuh terhadap seorang anak. Dan juga tidak ada sesuatu di dunia ini selain-Nya melainkan ia adalah makhluk-Nya, dan makhluk tidak layak menjadi anak dari Sang Pencipta, sehingga tidaklah Allah memilih seseorang kecuali dia adalah hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Apabila Allah ingin mengambil anak, sebagaimana yang disangkakan oleh kaum musyrik, maka Allah akan memilih anak dari yang Dia kehendaki dari makhlukNya. Dan mereka semua lainnya bertanya: para malaikat itu adalah anak Allah, Uzairanak Allah, Masih (Isa) anak Allah, menunjukkan bahwa keistimewaan bagi Allah untuk mengambil anak. Dialah Allah yang Maha Esa yang Maha Perkasa Bagi setiap makhluk ciptaanNya. Maksudnya: ketika Allah berkehendak mengambil anak, maka Allah harus lebih Qadim dibanding ayahnya, dan mustahil, makhluk yang diciptakan lebih Qadim dari Penciptanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Allah hendak mengambil anak, pasti akan memilih} pasti akan memilih {yang Dia kehendaki dari yang Dia ciptakan. Maha suci Dia} Maha suci dan Maha bersih Dia dari anggapan bahwa Dia memiliki anak {Dialah Allah Yang Maha Esa lagi Maha Mengalahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Kalau sekiranya Allah hendak mengambil “anak,” sebagaimana diyakini oleh makhluk-makhluk yang dungu, “tentu Dia akan memilih apa yang dikehendakiNya di antara ciptaanNya.” Maksudnya, niscaya Dia memilih salah satu ciptaanNya yang Dia kehendaki dan Dia istimewakan untuk diriNya dan menjadikannya seperti anak dan tidak perlu mengambil istri. “Mahasuci Dia” dari apa-apa yang didugakan oleh orang-orang kafir atau dari apa-apa yang dinisbatkan kepadaNya oleh orang-orang yang mulhid. “Dia-lah Allah, Yang Maha Esa lagi Maha Mengalahkan.” Yakni, Yang Esa dalam DzatNya, dalam nama-nama dan sifat-sifatNya serta dalam perbuatanNya, maka tidak ada yang serupa sedikitpun denganNya dalam hal itu dan tidak ada pula yang semisal denganNya. Maka kalau ia mempunyai anak, niscaya ia harus serupa denganNya dalam keesaanNya, karena anak adalah merupakan sebagian dariNya dan bagian dariNya. Yang Maha Mengalahkan seluruh alam atas (langit) dan alam bawah (bumi). Kalau seandainya Dia punya anak, maka anak itu tidak akan dikalahkan dan sudah tentu ia sangat dimanjakan oleh bapaknya. Padahal keesaan Allah dan kemahatidakterkalahkanNya itu adalah satu kesatuan. Jadi, yang Esa itu tidak mungkin ada kecuali Maha Mengalahkan; dan yang Maha Mengalahkan itu tidak mungkin ada kecuali pasti ESa. Yang demikian ini menafikan persekutuan bagiNYa dari segala sisinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 4: (Kalau sekiranya Allah hendak mengambil anak) seperti apa yang mereka katakan, yaitu sebagaimana yang disitir oleh firman-Nya, \"Tuhan Yang Maha Pemurah telah mengambil (mempunyai) anak...\" (Q.S. Al-Anbiya, 26) (tentu Dia akan memilih apa yang dikehendaki-Nya di antara ciptaan-ciptaan yang diciptakan-Nya) untuk dijadikan-Nya anak; bukan seperti apa yang telah mereka katakan, bahwa para malaikat itu adalah anak-anak perempuan Allah, Uzair itu putra Allah dan juga Al-Masih adalah putra Allah (Maha Suci Allah) kalimat ini memahasucikan-Nya dari mengambil anak (Dialah Allah Yang Maha Esa lagi Maha Mengalahkan) semua makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana yang disangka oleh orang-orang yang kurang akal. Dari mempunyai anak. Baik zat-Nya, nama-Nya, sifat-Nya maupun perbuatan-Nya. Sehingga tidak ada sesuatu pun yang serupa dengan-Nya. Sekiranya Dia mempunyai anak, tentu anak itu akan sama dalam keesaannya, karena bagian darinya. Ternyata tidak demikian. Dia berkuasa terhadap alam semesta, baik alam bagian atas maupun alam bagian bawah, sekiranya Dia mempunyai anak tentu anak tersebut tidak akan terkalahkan. Dengan demikian, Allah Maha Esa, Allah adalah Tuhan yang semua makhluk bergantung kepada-Nya, Dia tidak beranak dan tidak diperanakkan dan tidak ada seorang pun yang setara dengan Dia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 4",
    "description": "Sekiranya Allah hendak mengambil anak, sebagaimana anggapan orang-orang musyrik, tentu dia akan memilih apa yang dia kehendaki dari apa yang telah diciptakan-Nya, bukan menuruti apa yang menjadi anggapan orang musyrik. Mahasuci dia dari segala yang menyerupai-Nya. Dialah Allah yang maha esa tanpa sekutu, mahaperkasa dalam menciptakan alam raya. 5. Di antara bukti kuasa Allah menciptakan, mengurus, dan mengatur alam semesta adalah bahwa dia menciptakan langit dan bumi dengan tujuan yang benar. Dia senantiasa memasukkan malam atas siang sehingga gelap berganti terang, dan senantiasa memasukkan siang atas malam sehingga terang berganti gelap, dan menundukkan matahari dan bulan; masing-masing patuh pada hukum Allah, beredar pada porosnya, dan berjalan menurut waktu yang ditentukan. Ingatlah, Allah menyempurnakan dan membaguskan ciptaan-Nya. Dialah yang mahamulia, maha pengampun, lagi maha penyayang."
  }
]