[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Katakanlah (wahai Rasul) kepada kaummu yang menentang keras, “Beramallah sesuai dengan keadaan kalian yang kalian ridhai untuk diri kalian, di mana kalian menyembah sesuatu yang tidak berhak disembah dan tidak memiliki dari urusan hidup sedikit pun, sementara aku juga menjalankan apa yang diperintahkan kepadaku, yaitu menghadapkan wajahku hanya kepada Allah semata dalam perkataan-perkataan dan perbuatan-perbuatanku, maka kalian akan mengetahui siapa yang akan didatangi oleh azab yang menghinakannya di dunia, sedangkan di akhirat dia akan ditimpa siksa yang abadi, tidak berakhir dan tidak berkesudahan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Kalian pasti akan mengetahui siapa yang ditimpa oleh azab yang merendahkan dan menghinakannya di dunia, sedangkan di Akhirat ditimpa azab yang abadi, yang tidak terputus dan tidak berakhir.“"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ (siapa yang akan mendapat siksa yang menghinakannya) Yakni azab yang merendahkan dan menghinakannya di dunia setelah keangkuhan dan kesombongannya. Ketika itu akan terlihat jelas bahwa ia adalah pihak yang salah, dan lawannya berada pada pihak yang benar. وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ (dan lagi ditimpa oleh azab yang kekal”) Yakni azab yang terus menerus di akhirat yang berupa azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Kalian akan tahu siapa yang akan menerima azab dunia yang menghinakan dan merendahkan, juga yang akan menerima siksa akhirat selamanya, yaitu azab neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang akan mendapat siksa yang menghinakannya} yang menghinakan dan merendahkannya ddi dunia {dan yang akan ditimpa} dan akan ditimpa di akhirat {azab yang kekal”} kekal selamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “katakanlah” kepada mereka wahai Rasul, “Hai kaumku, bekerjalah sesuai dengan keadaanmu.” Maksudnya, menurut keadaan kalian yang kalian suka untuk diri kalian, yaitu beribadah kepada sembahan yang tidak berhak diibadahi sedikitpun dan tidak pula dia mempunyai kekuasaan sedikit pun. “Sesungguuhnya aku akan bekerja pula” menurut apa yang aku serukan kepada kalian, yaitu menuluskan ketaatan Bergama hanya kepada Allah, “maka kelak kamu akan mengetahui” untuk siapa kesudahan yang baik dan “siapa yang akan mendapat siksa yang menghinakannya,” di dunia ini, “dan lagi ditimpa” di akhirat “oleh azab yang kekal,” yang dia tidak dipindah darinya dan tidak pernah ada habis-habisnya. Ini adalah ancaman yang sangat berat bagi mereka, dan mereka mengetahui bahwa sesungguhnya merekalah yang berhak mendapat azab yang kekal, akan tetapi kezhaliman dan sikap keras kepala telah menghalangi mereka untuk beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 40: Lafal Man adalah Isim Maushul (yang akan mendapat siksa yang menghinakannya dan lagi ditimpa) yakni ia ditimpa (oleh azab yang kekal\") yang abadi, yaitu azab neraka; dan sungguh Allah telah menghinakan mereka di dalam perang Badar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dunia. Di akhirat. Ayat ini merupakan ancaman keras untuk mereka, sedangkan mereka mengetahui bahwa mereka berhak mendapatkan azab yang kekal, akan tetapi kezaliman dan pembangkangan itulah yang menghalangi mereka dari beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 40",
    "description": "Yaitu mengetahui siapa yang mendapat siksa yang menghinakan dalam kehidupan dunia, dan siapa pula yang kepadanya ditimpakan azab yang kekal di kehidupan akhirat. '41. Pada ayat yang lalu Allah memerintahkan nabi Muhammad untuk bekerja bersungguh-sungguh menyampaikan kebenaran yang ditugaskan Allah kepada beliau. Ayat-ayat berikut seakan mempertegas tugas beliau tersebut dengan Al-Qur'an yang sudah berada di tangan beliau. Sungguh, kami telah menurunkan kepadamu, wahai nabi Muhammad, kitab, yakni Al-Qur'an dengan benar (lihat: surah az-zumar/39 :1-2), serta membawa kebenaran untuk manusia; barang siapa memilih untuk mendapat petunjuk, maka petunjuk itu untuk dirinya sendiri, dan siapa yang memilih jalan sesat, maka sesungguhnya kesesatan itu juga semata-mata untuk dirinya sendiri, dan engkau, wahai nabi Muhammad, bukanlah orang yang bertanggung jawab terhadap kesesatan yang telah mereka pilih."
  }
]