[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami telah menurunkan kepadamu (wahai Rasul), al-Qur’an dengan kebenaran sebagai hidayah bagi alam semesta kepada jalan yang lurus. Maka barangsiapa mengambil hidayah dari cahayanya, dan beramal dengan apa yang dikandungnya, serta beristiqamah di atas manhajnya, maka manfaatnya kembali kepada dirinya, dan sebaliknya barangsiapa tersesat setelah petunjuk itu jelas baginya, maka mudaratnya akan kembali menimpa dirinya sendiri, dia tidak sedikit pun akan memudaratkan Allah. Dan kamu (wahai rasul) bukanlah penjaga yang bertugas mengurusi amal perbuatan mereka, kamu tidak dihisab karenanya dan tidak kuasa melindungi siapa yang kamu kehendaki, karena tugasmu hanyalah menyampaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Sesungguhnya Kami menurunkan kepadamu -wahai Rasul- Al-Qur`ān untuk manusia dengan kebenaran agar kamu memperingatkan mereka. Barangsiapa yang mendapat hidayah maka faedah hidayah itu kembali kepada dirinya sendiri. Petunjuk itu tidak bermanfaat bagi Allah, karena Dia tidak memerlukannya. Sebaliknya barangsiapa tersesat, maka bahaya kesesatan itu berpulang kepada dirinya, kesesatannya tidak merugikan Allah sedikit pun. Kamu juga bukan pengawas mereka sehingga kamu bisa memaksa mereka untuk mendapatkan hidayah, kamu hanya sebatas menyampaikan kepada mereka apa yang diperintahkan kepadamu untuk kamu sampaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Dengan keagungan dan kekuasaan Kami yang sempurna, Kami menurunkan kepadamu -hai Rasulullah- al-Qur’an bagi para hamba dengan kebenaran yang jelas yang tidak tercampur dengan kebatilan. Barangsiapa yang memperoleh petunjuk dengan cahayanya maka manfaatnya akan kembali kepada dirinya; dan barangsiapa yang berpaling dari jalan kebenaran maka akibat buruknya akan menimpa dirinya sendiri, dan kamu bukanlah orang yang bertanggungjawab atas mereka untuk memaksa mereka menerima hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. إِنَّآ أَنزَلْنَا عَلَيْكَ الْكِتٰبَ لِلنَّاسِ (Sesungguhnya Kami menurunkan kepadamu Al Kitab (Al Quran) untuk manusia) Yakni demi manusia untuk menjelaskan apa yang diwajibkan atas mereka. فَمَنِ اهْتَدَىٰ فَلِنَفْسِهِۦ ۖ (siapa yang mendapat petunjuk maka (petunjuk itu) untuk dirinya sendiri) Yakni barangsiapa yang mengetahui jalan yang benar lalu menapakinya. وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ( dan siapa yang sesat maka sesungguhnya dia semata-mata sesat buat (kerugian) dirinya sendiri) Yakni barangsiapa yang tersesat dari jalan kebenaran maka kemudharatan dari kesesatannya itu hanya dia sendiri yang akan menanggungnya. وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ (dan kamu sekali-kali bukanlah orang yang bertanggung jawab terhadap mereka) Yakni kamu tidak dituntut untuk memberi mereka petunjuk, namun kewajibanmu hanya menyampaikan risalah, dan itu telah kamu lakukan. Ayat-ayat yang berkenaan dengan ini telah dinasakh (hapus) hukumnya dengan ayat yang memerintahkan untuk memerangi orang-orang kafir. Allah telah memerintahkan Rasulullah untuk memerangi mereka sampai mereka mengucapkan Laailaaha illaallah dan menjalankan hukum-hukum Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Sungguh Kami telah menurunkan Al-quran kepadamu untuk manusia, juga sebagai penjelas terhadap perintah Kami kepada mereka. Agar kehidupan dunia juga akhirat mereka terarah dalam kebaikan. Kami telah menurunkan Al-quran dengan kebenaran, barang siapa mengambil petunjuk darinya, maka sesungguhnya membuka jalan lurus untuk dirinya sendiri. Namun barangsiapa sesat dan menyimpang dari Al-quran maka sesungguhnya kesesatan itu pada diri mereka sendiri. Engkau tidak akan dimintai pertanggungjawaban atas perbuatan manusia, engkau tidak akan bisa memaksa mereka untuk mengikuti petunjukmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah menurunkan kepadamu kitab} Al-Qur’an {untuk manusia dengan benar. Siapa saja yang mendapat petunjuk, maka itu untuk dirinya} maka petunjuk itu berguna bagi dirinya {dan siapa saja yang tersesat, sesungguhnya kesesatan itu untuk dirinya} kemudharatan dari kesesatan itu akan kembali kepada dirinya {Kamu bukanlah penanggung jawab mereka} penjaga dan pengawas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah mengabarkan bahwasanya Dia telah menurunkan kepada RasulNya al-Kitab yang mengandung kebenaran dalam berita-beritanya, perintah-perintah dan larangan-laranganNYa, yang merpakan materi hidayah dan penjelasan bagi orang yang menginginkan sampai kepada Allah dan kepada negeri kemuliaanNYa, dan sesungguhnya dengan al-Kitab tersebut berarti tegaklah hujjah atas segenap umat manusia. “Barangsiapa yang berpedoman,” kepada cahayanya dan mengikuti perintah-perintahnya, maka sesungguhnya manfaatnya akan kembali kepada dirinya sendiri “dan siapa yang sesat” setelah hidayah menjadi jelas baginya, “maka sesungguhnya dia semata-mata sesat buat dirinya sendiri,” tidak membahyakan Allah sedikitpun. “Dan kamu sekali-kali bukanlah orang yang bertanggung jawab terhadap mereka,” untuk menjaga amal perbuatan mereka, yang akan menghisab mereka atas amal perbuatannya dan juga tidak bisa memaksa mereka untuk menganut apa yang kamu kehendaki, sebab kamu hanya seorang penyampai, kamu menyampaikan kepada mereka apa-apa yang diperintahkan kepada kamu (untuk menyampaikannya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 41: (Sesungguhnya Kami menurunkan kepadamu Alkitab untuk manusia dengan membawa kebenaran) lafal Bil haqqi berta'alluq kepada lafal Anzalnaa (siapa yang mendapat petunjuk maka untuk dirinya sendiri) yakni hidayahnya itu untuk dirinya sendiri (dan siapa yang sesat maka sesungguhnya dia semata-mata sesat buat kerugian dirinya sendiri, dan kamu sekali-kali bukanlah orang yang bertanggung jawab terhadap mereka) lalu karenanya kamu dapat memaksa mereka untuk menerima hidayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia menurunkan kepada Rasul-Nya kitab yang mengandung kebenaran, baik pada beritanya, perintah maupun larangan. Di dalamnya terdapat materi hidayah dan penyampai bagi orang yang ingin sampai kepada Allah dan tempat istimewa-Nya (surga), dan dengan Al Qur’an tegaklah hujjah kepada alam semesta. Dari cahaya Al Qur’an dan mengikutinya. Setelah jelas petunjuk baginya. Hal itu, tidaklah merugikan Allah sedikit pun. Yakni engkau (Muhammad shallallahu 'alaihi wa sallam) bukanlah yang menjaga dan menghisab amal mereka atau memaksa mereka kepada yang engkau inginkan. Engkau hanyalah penyampai yang menyampaikan apa yang diperintahkan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 41",
    "description": "Pada ayat yang lalu Allah memerintahkan nabi Muhammad untuk bekerja bersungguh-sungguh menyampaikan kebenaran yang ditugaskan Allah kepada beliau. Ayat-ayat berikut seakan mempertegas tugas beliau tersebut dengan Al-Qur'an yang sudah berada di tangan beliau. Sungguh, kami telah menurunkan kepadamu, wahai nabi Muhammad, kitab, yakni Al-Qur'an dengan benar (lihat: surah az-zumar/39 :1-2), serta membawa kebenaran untuk manusia; barang siapa memilih untuk mendapat petunjuk, maka petunjuk itu untuk dirinya sendiri, dan siapa yang memilih jalan sesat, maka sesungguhnya kesesatan itu juga semata-mata untuk dirinya sendiri, dan engkau, wahai nabi Muhammad, bukanlah orang yang bertanggung jawab terhadap kesesatan yang telah mereka pilih. 42. Karena nabi Muhammad dinyatakan tidak bertanggung jawab atas kesesatan manusia, ayat ini menegaskan bahwa hanya Allah saja yang bertanggung jawab dan menggenggam hidup manusia, semenjak kehidupan dunia sampai ke kehidupan akhirat. Hanya Allah-lah yang memegang nyawa seseorang pada saat kematiannya dan nyawa seseorang yang belum mati ketika dia tidur, maka dia tahan nyawa orang yang telah dia tetapkan kematiannya ketika dia mati, dan dia lepaskan nyawa yang lain sampai waktu yang ditentukan ketika dia tidur. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi kaum yang mau berpikir."
  }
]