[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah- lah Yang mencabut nyawa saat ajalnya tiba. Wafat besar ini adalah wafat kematian saat ajal telah habis, dan Allah juga menahan arwah yang belum mati dalam tidurnya, dan ini adalah wafat kecil. Dari kedua arwah tersebut Allah menahan salah satu arwah yang ditetapkan kematiannya, yaitu arwah orang yang mati dan melepaskan yang lain untuk menyempurnakan ajal dan rizkinya dan hal itu dengan mengembalikannya ke jasad pemiliknya. Sesungguhnya dipegangnya arwah orang yang mati dan orang yang tidur, dilepaskannya arwah orang yang tidur dan ditahannya arwah orang yang mati oleh Allah mengandung petunjuk yang sangat jelas atas Kuasa Allah bagi siapa yang merenung dan berpikir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Allah mengambil arwah saat ajalnya tiba dan mengambil arwah yang ajalnya belum tiba saat ia tidur. Lalu Allah menahan arwah orang yang Allah tetapkan kematiannya dan melepaskan arwah yang belum Dia tetapkan kematiannya hingga masa tertentu yang Allah ketahui dalam ilmu-Nya. Sesungguhnya dalam tindakan menahan, melepaskan, mematian dan menghidupkan itu terdapat bukti-bukti bagi kaum yang memikirkan bahwa yang melakukan semua itu kuasa untuk membangkitkan manusia dari alam kubur mereka untuk menghadapi hisab dan menerima pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Allah yang mencabut nyawa dari jasadnya ketika ia mati; dan mewafatkan jiwa yang belum mati dalam tidurnya. Dia menggenggam jiwa yang telah ditetapkan kematiannya, dan mengembalikan jiwa orang yang tidur ke jasadnya saat ia terbangun hingga waktu tertentu, yaitu hingga datang ajal kematiannya yang sesungguhnya. Sungguh pada hal agung ini terdapat tanda-tanda kekuasaan Allah bagi orang yang menghayatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. اللهُ يَتَوَفَّى الْأَنفُسَ حِينَ مَوْتِهَا (Allah memegang jiwa (orang) ketika matinya) Yakni Allah menahan ruh seseorang dan mengeluarkannya dari badannya ketika ajalnya telah datang. وَالَّتِى لَمْ تَمُتْ فِى مَنَامِهَا ۖ( dan (memegang) jiwa (orang) yang belum mati di waktu tidurnya) Dan Allah juga menahan ruh orang yang belum datang ajalnya, yaitu ketika dia sedang tidur. فَيُمْسِكُ الَّتِى قَضَىٰ عَلَيْهَا الْمَوْتَ(maka Dia tahanlah jiwa (orang) yang telah Dia tetapkan kematiannya) Yakni tidak mengembalikan ruh itu ke badannya. وَيُرْسِلُ الْأُخْرَىٰٓ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ( dan Dia melepaskan jiwa yang lain sampai waktu yang ditetapkan) Yakni mengembalikan ruh orang yang tidur. Terdapat perbedaan pendapat tentang perbedaan antara jiwa dan ruh, apakah hakikat keduanya adalah dua hal yang sama atau dua hal yang berbeda. إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pada penahanan dan pengembalian ruh itu. لَاٰيٰتٍ (terdapat tanda-tanda kekuasaan Allah) Tanda-tanda yang menakjubkan yang menunjukkan kekuasaan Allah yang Maha Besar. لِّقَوْمٍ يَتَفَكَّرُونَ (bagi kaum yang berfikir) Yakni yang berfikir dan menghayati hal ini serta menggunakannya sebagai petunjuk atas keesaan Allah dan kesempurnaan kuasa-Nya, sebab penahanan dan pengembalian ruh ini adalah pelajaran dan peringatan bagi orang yang mau mengambil pelajaran dan peringatan. Imam Bukhari dan Muslim meriwayatkan hadits dari Abu Hurairah ia berkata, Rasulullah bersabda: “Jika salah seorang dari kalian hendak beristirahat di atas kasurnya, maka hendaklah ia mengibasnya dengan ujung sarungnya, sebab ia tidak tau apa yang sebelumnya ada di atas Kasur itu. kemudian hendaklah ia berdo’a: “Dengan nama-Mu Wahai Tuhanku aku rebahkan tubuhku, dan dengan nama-Mu aku bangun. Jika Engkau menahan jiwaku maka rahmatilah ia, dan jika engkau mengembalikannya maka jagalah ia sebagaimana Engkau menjaga hamba-hamba-Mu yang shalih”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Allah menggenggam ruh-ruh sesudah ajal mereka, Allah mematikan jiwa-jiwa yang masih hidup ketika mereka tidur. Allah menahan ruh orang-orang yang telah Dia tetapkan kematiannya, Dia tidak mengembalikan ruh itu kepada jasadnya. Allah akan menempatkannya dalam kenikmatan atau siksa. Allah juga meletakkan ruh orang-orang yang tertidur kembali ke jasadnya agar manusia dapat terbangun lagi dan sadar kembali. Jiwa dan ruh adalah satu kesatuan dalam pendapat kebanyakan ulama’ dan berbeda dalam pandangan beberapa ulama. Makna dari kematian ketika tidur adalah pengembalian ruh dari badan secara dhohir saja, sehingga mereka tidak bisa bergerak secara sadar saja. Ketika mereka terbangun mereka akan sadar kembali setelah tertidur dalam beberapa waktu. Umur itu telah ditetapkan dan kematian pasti akan terjadi. Semua kejadian yang telah disebutkan di atas mengenai penahanan, pencabutan, dan pengembalian ruh adalah bukti Kesempurnaan dan Kemahakuasaan Allah dan hikmah-Nya. Itu semua diperuntukkan bagi orang-orang yang mau berfikir mengenai kehidupan dan kematian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah menggenggam nyawa} menggenggam nyawa {pada saat kematiannya dan yang belum mati ketika dia tidur. Dia menahan nyawa yang telah Dia tetapkan kematiannya dan Dia melepaskan nyawa yang lain} dan dia mengembalikan nyawa lain yang belum Dia tetapkan kematiannya kepada jasadnya {sampai waktu yang ditentukan} sampai waktu kematiannya {Sesungguhnya pada yang demikian itu benar-benar terdapat ayat-ayat Allah bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah mengabarkan bahwa hanya Dia semata yang bertindak mengatur hamba-hambaNya pada saat mereka terjaga dan tidur, serta saat mereka hidup dan mereka mati, seraya berfirman, “Allah memegang jiwa ketika matinya,” yakni kematian besar atau meninggal dunia, dan pemberitahuan dariNya bahwasanya Dia-lah yang mewafatkan jiwa. Dan penyadaran perbuatan (mematikan) kepada DiriNya tidak berlawanan dengan kenyataan bahwa sesungguhnya Dia telah menugaskan malaikat maut dan para pembantunya untuk mematikan tersebut, sebagaimana FirmanNya, “Katakanlah: \"Malaikat maut yang diserahi untuk (mencabut nyawa) mu akan mematikan kamu; kemudian hanya kepada Tuhanmulah kamu akan dikembalikan.” (As-Sajdah:11) “sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan oleh malaikat-malaikat Kami, dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya.” (Al-An’am:61). Hal itu karena Allah menisbatkan banyak hal kepada DiriNya dengan melihat kepada kenyataan bahwa Dia-lah Pencipta lagi Pengatur; dan Dia juga (kadang) menisbatkannya kepada seba-sebabnya dengan melihat pada kenyataan bahwa di antara sunnah dan hikmahNya adalah Dia menjadikan sebab-musabab bagi tiap-tiap sesuatu. Dan firmanNya, “Dan jiwa yang belum mati di waktu tidurnya,” dan ini adalah kematian kecil, maksudnya, Dia menahan jiwa yang belum mati di saat tidur, “maka Dia tahanlah” dari dua jiwa ini, jiwa “yang telah Dia tetapkan kematiannya,” yaitu jiwa orang yang telah mati atau telah ditetapkan untuk mati di dalam tidurnya, “dan Dia melepaskan” jiwa “yang lain sampai waktu yang ditentukan.” Maksudnya, hingga rizki dan ajalnya sempurna. “SEsungguhnya pada yang demikian itu terdapat tanda-tanda bagi kaum yang berpikir,” atas kemahakuaasaanNYa dan atas KuasaNya menghidupkan kembali orang-orang yang sudah mati. Di dalam ayat ini terdapat satu dalil yang menunjukkan bahwa ruh dan jiwa merupakan jism (makhluk) yang berdiri sendiri, yang esensinya sangat berbeda dengan esensi tubuh, dan bahwasanya ia adalah makhluk yang bdikendalikan. Allah mengendalikannya dalam mematikan, menahan ndan melepasnya, dan bahwa sesungguhnya ruh orang-orang yang hidup dan orang-orang yang mati saling berjumpa di alam barzakh, mereka berkumpul dan saling berbicara, kemudian Allah melepas ruh-ruh orang-orang yang hidup dan menahan ruh-ruh orang-orang yang sudah mati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 42: (Allah mematikan jiwa orang ketika matinya dan) memegang (jiwa orang yang belum mati di waktu tidurnya) artinya Allah memegangnya di waktu ia tidur (maka Dia tahan jiwa orang yang telah Dia tetapkan kematiannya dan melepaskan jiwa yang lain sampai waktu yang ditentukan) bagi kematiannya. Jiwa yang dilepaskan itu hanyalah dimatikan perasaannya saja, tetapi ia masih hidup, berbeda dengan jiwa yang benar-benar dimatikan. (Sesungguhnya pada yang demikian itu) pada hal-hal yang telah disebutkan itu (terdapat tanda-tanda) yang menunjukkan akan kekuasaan Allah (bagi kaum yang berpikir) maka karenanya mereka mengetahui, bahwa yang berkuasa melakukan hal tersebut berkuasa pula untuk membangkitkannya; dan orang-orang kafir Quraisy tidak memikirkan hal ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia yang sendiri mengurus hamba-hamba-Nya baik saat mereka jaga maupun tidur, baik saat mereka hidup dan mati. Ini adalah kematian kubra (besar). Syaikh As Sa’diy berkata, “Pemberitahuan Allah bahwa Dia memegang nyawa manusia pada saat kematiannya, dan perbuatan itu disandarkan kepada Diri-Nya tidaklah menafikan bahwa Dia telah menyerahkan pekerjaan itu kepada malaikat maut dan para pembantunya sebagaimana firman Allah Ta’ala, “Katakanlah: \"Malaikat maut yang diserahi untuk (mencabut nyawa)mu akan mematikanmu,” (Terj. As Sajdah: 11), dan “Sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan oleh malaikat-malaikat Kami, dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya.” (Terj. Al An’aam: 61) Karena Allah Subhaanahu wa Ta'aala menyandarkan berbagai perkara kepada Diri-Nya karena melihat sisi Dia sebagai Pencipta dan Pengaturnya, dan Dia menyandarkannya kepada sebab-sebabnya karena melihat sisi termasuk sunnah Allah Subhaanahu wa Ta'aala dan hikmah-Nya Dia mengadakan sebab untuk semua perkara.” Ini adalah kematian shughra (kecil), Dia menahan nyawa orang yang belum mati ketika tidurnya. Maksudnya, orang-orang yang mati itu ruhnya ditahan Allah sehingga tidak dapat kembali kepada tubuhnya; dan orang-orang yang tidak mati hanya tidur saja, ruhnya dilepaskan sehingga dapat kembali lagi kepadanya dan terus hidup sampai sempurna rezeki dan ajalnya. Dari sana mereka dapat mengetahui, bahwa yang kuasa melakukan hal itu, maka berarti kuasa pula membangkitkan manusia yang telah mati, namun orang-orang kafir tidak memikirkan hal itu. Dalam ayat ini terdapat dalil bahwa ruh atau nyawa adalah tubuh yang berdiri sendiri berbeda dengan tubuh badan (lahiriah/jasmani manusia), dan bahwa ruh tersebut diciptakan dan diatur Allah. Allah bertindak padanya pada saat wafat, pada saat memegangnya dan pada saat melepaskannya, dan bahwa ruh orang yang hidup dan orang yang mati dapat saling bertemu di alam barzakh, sehingga berkumpul dan berbincang-bincang, lalu Allah melepaskan ruh orang yang masih hidup dan menahan ruh orang yang telah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 42",
    "description": "Karena nabi Muhammad dinyatakan tidak bertanggung jawab atas kesesatan manusia, ayat ini menegaskan bahwa hanya Allah saja yang bertanggung jawab dan menggenggam hidup manusia, semenjak kehidupan dunia sampai ke kehidupan akhirat. Hanya Allah-lah yang memegang nyawa seseorang pada saat kematiannya dan nyawa seseorang yang belum mati ketika dia tidur, maka dia tahan nyawa orang yang telah dia tetapkan kematiannya ketika dia mati, dan dia lepaskan nyawa yang lain sampai waktu yang ditentukan ketika dia tidur. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi kaum yang mau berpikir. 43. Kendatipun sudah dijelaskan berulang-ulang bahwa Allah itu mahakuasa lagi mahaperkasa yang mengatur perjalanan alam semesta dan hidup manusia, namun orang-orang musyrik mekah itu tetap saja tidak mau mengakuinya. Mengapa demikian' ataukah hal itu disebabkan karena mereka telah mengambil berhala-berhala sebagai penolong selain Allah' katakanlah wahai nabi Muhammad, 'apakah kamu masih mengambilnya juga sebagai perantara meskipun mereka berhala-berhala itu tidak memiliki sesuatu apa pun dan juga tidak mengerti karena memang berhala-berhala itu hanyalah benda mati''."
  }
]