[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang menyekutukan Allah dengan tuhan-tuhan mereka yang mereka sembah itu mengangkat tuhan-tuhan itu sebagai pemberi syafa’at bagi mereka yang akan membantu menunaikan hajat mereka di hadapan Allah? katakanlah kepada mereka (wahai Rasul), “Apakah kalian akan tetap mengangkat mereka sebagai para pemberi syafa’at sekalipun tuhan-tuhan itu tidak memiliki apa pun dan tidak memahami ibadah kalian kepada mereka?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Kaum musyrikin menjadikan berhala-berhala mereka sebagai pemberi syafaat, mereka mengharapkan manfaat dari berhala-berhala itu selain Allah. Katakanlah kepada mereka -wahai Rasul-, “Apakah kalian akan tetap mengangkat mereka sebagai para pemberi syafaat sekalipun mereka itu tidak berkuasa apa pun atas diri kalian dan atas diri mereka, dan mereka juga tidak berakal, karena mereka adalah benda mati murni yang tidak berbicara, tidak mendengar, tidak melihat, tidak mendatangkan manfaat dan mudarat?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43-44. Allah mengolok dan mengingkari orang-orang musyrik karena enggan mentadabburi; bahkan mereka menjadikan berhala-berhala sebagai pemberi syafaat. Hai Rasulullah, katakanlah kepada mereka: “Apakah kalian tetap menjadikan mereka sebagai pemberi syafaat meski mereka tidak memiliki apapun dan tidak memahami peribadatan yang ditujukan bagi mereka?” Dan katakanlah kepada mereka: “Syafaat hanya milik Allah semata, Dia Pemilik kerajaan tujuh langit dan bumi, kemudian kepada-Nya kalian akan kembali pada hari kiamat untuk menjalani hisab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. أَمِ اتَّخَذُوا۟ مِن دُونِ اللهِ شُفَعَآءَ ۚ (Bahkan mereka mengambil pemberi syafa’at selain Allah) Yakni apakah mereka menjadikan tuhan-tuhan selain Allah itu sebagai pemberi syafa’at di sisi Allah? قُلْ أَوَلَوْ كَانُوا۟ لَا يَمْلِكُونَ شَيْـًٔا وَلَا يَعْقِلُونَ (Katakanlah: “Dan apakah (kamu mengambilnya juga) meskipun mereka tidak memiliki sesuatupun dan tidak berakal?”) Yakni mengapa kalian menjadikan mereka pemberi syafaat di sisi Allah padahal mereka tidak memiliki syafaat itu atau lainnya, bahkan mereka tidak memahami syafaat atau hal lain sebab mereka hanyalah benda mati yang tidak berakal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Namun apakah mereka orang-orang musyrik justru menyembah Tuhan selain Allah, serta menjadikan sesembahan mereka sebagai penolong mereka dari azab Allah? Katakanlah wahai Nabi: “Apakah kalian akan tetap menjadikan sesembahan kalian sebagai penolong kalian, meskipun mereka tidak mampu memberi pertolongan, bahkan tidak memiliki kekuasaan apapun. Mereka juga tidak mempunyai akal, apakah dengan begitu kalian tetap akan menyembahnya?” Am memiliki makna dua huruf, yang pertama adalah hamzah sebagai kata tanya yang bermaksud menyanggah dan juga menghina. Yang kedua bermakna bal untuk mengacu dari perkataan awal ke perkataan berikutnya seperti di atas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka menjadikan penolong selain Allah. Katakanlah,“Apakah meskipun mereka tidak memiliki suatu apa pun dan tidak mengerti”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah mengingkari orang yang menjadikan selain Dia sebagai pemberi syafaat, dengan bergantung kepada mereka, memohon kepada mereka, dan menyembah mereka. “Katakanlah” kepada mereka sambil menjelaskan kebodohan mereka dan bahwa sesungguhnya mereka sama sekali tidak berhak diibadahi (disembah). “Dan apakah meskipun mereka,” yakni, apa-apa yang kalian jadikan sebagai pemberi syafaat itu “tidak memiliki sesuatu pun,” maksudnya, sebesar biji sawi sekalipun di langit dan tidak pula di bumi ini, dan tidak pula lebih kecil darinya, apalagi yang lebih besar! Bahkan mereka tidaik mempunyai akal yang karenanya mereka berhak dipuji, sebab mereka adalah benda-benda mati yang terbuat dari batu, pohon, gambar dan orang-orang mati? Maka apakah bisa dikatakan, bahwa sesungguhnya orang yang menyembahnya itu mempunyai akal, atau dia adalah benar-benar manusia yang paling sesat-paling bodoh, dan paling besar kezhalimannya ?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 43: (Bahkan) tetapi (mereka mengambil selain Allah) yaitu berhala-berhala sebagai tuhan-tuhan (pemberi syafaat) di hadapan Allah nanti, menurut dugaan mereka. (Katakanlah) kepada mereka, (\"Apakah) mereka dapat memberikan syafaat (meskipun mereka tidak memiliki sesuatu pun) daripada syafaat itu dan tidak memiliki hal-hal lainnya pula (dan tidak berakal\") yakni, kalian hanya menyembah mereka tidak ada alasan lain, hal ini tentu saja tidak patut bagi kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingkari orang yang mengambil penolong selain Allah, seperti patung-patung dan berhala-berhala dimana mereka bergantung, meminta dan menyembah kepada mereka. Seperti berhala-berhala, dimana mereka menganggap bahwa berhala-berhala itu pemberi syafaat bagi mereka di sisi Allah Subhaanahu wa Ta'aala. Yakni menerangkan kepada mereka kebodohan mereka dan bahwa benda-benda itu tidak pantas disembah. Bagaimana mereka memiliki sesuatu atau mengerti sesuatu sedangkan mereka hanya sebuah batu, sebuah pohon, sebuah gambar, orang-orang yang telah mati, kuburan dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 43",
    "description": "Kendatipun sudah dijelaskan berulang-ulang bahwa Allah itu mahakuasa lagi mahaperkasa yang mengatur perjalanan alam semesta dan hidup manusia, namun orang-orang musyrik mekah itu tetap saja tidak mau mengakuinya. Mengapa demikian' ataukah hal itu disebabkan karena mereka telah mengambil berhala-berhala sebagai penolong selain Allah' katakanlah wahai nabi Muhammad, 'apakah kamu masih mengambilnya juga sebagai perantara meskipun mereka berhala-berhala itu tidak memiliki sesuatu apa pun dan juga tidak mengerti karena memang berhala-berhala itu hanyalah benda mati''44. Oleh sebab itu, katakanlah kepada mereka wahai nabi Muhammad, 'pertolongan itu hanya milik Allah saja semuanya, karena dia adalah pemilik mutlak. Dia memiliki kerajaan langit dan bumi. Kemudian hanya kepada-Nya kamu akan dikembalikan. '."
  }
]