[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Katakanlah (wahai Rasul) kepada orang-orang musyrik itu, “Hanya milik Allah seluruh syafa’at itu. Hanya milikNya apa yang ada di langit dan di bumi dan segala apa yang ada pada keduanya. Maka segala urusan adalah milik Allah semata, tidak seorang pun yang memberi syafa’at di sisiNya kecuali dengan izinNya, Dia-lah Pemilik langit dan bumi, Dia yang mengatur apa yang ada pada keduanya. Maka semestinya syafa’at itu diminta kepada Allah sebagai Pemiliknya dengan mengikhlaskan ibadah hanya kepadaNya dan tidak diminta dari tuhan-tuhan yang tidak bisa mendatangkan manfaat atau mudarat. Hanya kepada Allah kalian akan kembali setelah kematian untuk menghadapi perhitungan dan pembalasan amal.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Katakanlah -wahai Rasul- kepada orang-orang musyrikin, “Hanya Allah semata pemilik syafaat seluruhnya, tidak seorang pun memberikan syafaat di sisi Allah kecuali dengan izin-Nya, dan syafaat hanya diberikan kepada siapa yang Allah ridai. Bagi-Nya semata kerajaan langit dan bumi, kemudian hanya kepada Allah semata kalian akan kembali pada hari Kiamat untuk menghadapi hisab dan menerima balasan. Allah memberi balasan kalian atas amal perbuatan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. قُل لِّلّٰهِ الشَّفٰعَةُ جَمِيعًا (Katakanlah: “Hanya kepunyaan Allah syafa’at itu semuanya) Yakni tidak ada seorangpun yang dapat memberi shafaat kecuali orang yang telah diridhai dan diizinkan Allah untuk memberi syafaat atau mendapat syafaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Wahai Nabi, katakanlah: “Yang berkuasa memberi pertolongan hanyalah Allah. Tidak ada yang bisa memberi pertolongan maupun mendapat pertolongan kecuali atas izin dari Allah. Kerajaan langit dan bumi hanyalah milik Allah, Dialah Sang Raja dari semua raja dan Penguasa segalanya. Tidak ada yang bisa berkata apa-apa kecuali atas izin Allah. Hanya kepada-Nya lah semua akan kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Hanya milik Allah semua pertolongan itu. MilikNyalah kerajaan langit dan bumi. Kemudian hanya kepadaNya kalian dikembalikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Katakanlah” kepada mereka, “Hanya kepunyaan Allah syafa’at itu semuanya,” karena semua urusan adalah kepunyaan Allah, dan setiap pemberi syafa’at pasti takut kepadaNya, dan tidak seorang pun dapat memberikan syafaat di sisiNya kecuali berdasarkan izin dariNya. Apabila Dia menghendaki rahmat (belas kasih) bagi hambaNya, maka Dia memberi izin kepada pemberi syafaat terhormat di sisiNya untuk memberikan syafaat, sebagai rahmat dariNya kepada keduanya. Kemudian Allah menetapkan bahwasanya semua syafaat adalah milikNya berdasarkan FirmanNya, “KepunyaaNya kerajaan langit dan bumi.” Maksudnya, semua apa yang ada di dalamnya, berupa benda, perbuatan, mdan sifat. Maka yang wajib adalah, syafaat diminta kepada siapa yang memilikinya dan ibadah diikhlaskan hanya kepadaNya. “Kemudian kepadaNYa-lah kamu dikembalikan,” lalu Dia akan menmberikan balasan kepada orang yang ikhlas kepadaNya dengan pahala yang berlipat ganda, dan kepada orang yang mempersekutukanNYa dengan azab yang membinasakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 44: (Katakanlah, \"Hanya kepunyaan Allahlah syafaat itu semua) maksudnya, syafaat itu khusus bagi Dia, maka tiada seorang pun yang dapat memberikannya melainkan dengan seizin Dia. (Kepunyaan-Nya kerajaan langit dan bumi. Kemudian kepadaNya pulalah kalian dikembalikan.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu tidak ada yang berani memberi syafaat kecuali dengan izin Allah Subhaanahu wa Ta'aala. Milik-Nya semua yang ada di sana baik zatnya, perbuatannya maupun sifatnya. Oleh karena itu, seharusnya pertolongan diminta dari yang memilikinya, yaitu Allah Subhaanahu wa Ta'aala dan beribadah hanya kepada-Nya. Lalu Dia memberikan balasan kepada orang yang ikhlas dengan pahala yang besar dan membalas orang yang berbuat syirk dengan azab yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 44",
    "description": "Oleh sebab itu, katakanlah kepada mereka wahai nabi Muhammad, 'pertolongan itu hanya milik Allah saja semuanya, karena dia adalah pemilik mutlak. Dia memiliki kerajaan langit dan bumi. Kemudian hanya kepada-Nya kamu akan dikembalikan. '45. Ayat-ayat yang lalu menjelaskan penurunan Al-Qur'an secara hak dan pengingkaran kaum musyrik mekah terhadap kebenaran yang dibawanya. Ayat-ayat berikut lebih memerinci bentuk kesesatan mereka melalui sikap buruk yang mereka punyai. Dan apabila yang disebut hanya nama Allah, tanpa menyebut nama berhala-berhala yang mereka sembah, maka kesal sekali hati orang-orang yang tidak beriman kepada akhirat itu. Namun apabila nama-nama sembahan selain Allah yang mereka jadikan perantara menyembah Allah disebut, tiba-tiba mereka menjadi bangga dan bergembira."
  }
]