[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Nama Allah semata disebut, maka akan menjauh hati orang-orang yang tidak beriman kepada kebangkitan setelah kematian. Namun bila berhala-berhala, patung-patung dan para wali yang disembah selain Allah itu disebut, maka mereka akan bersuka cita, karena syirik sesuai dengan hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Bila nama Allah semata disebut, maka berontaklah hati kaum musyrikin yang tidak beriman kepada Akhirat dan apa yang ada padanya berupa kebangkitan, hisab dan pembalasan amal perbuatan. Namun bila nama berhala-berhala yang mereka sembah selain Allah disebut, maka mereka bersuka cita dan bergembira."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Dan jika dikatakan di depan orang-orang musyrik “Tidak ada Tuhan yang berhak disembah selain Allah”, atau disebutkan nama Allah saja tanpa disebutkan berhala-berhala mereka; maka hati mereka akan berpaling dan merasa terganggu. Namun jika berhala-berhala mereka disebut, maka mereka akan merasa senang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَإِذَا ذُكِرَ اللهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ ۖ (Dan apabila hanya nama Allah saja disebut, kesallah hati orang-orang yang tidak beriman kepada kehidupan akhirat) Yakni jika dikatakan kepada mereka ‘Laailaahaillallaah’ mereka kabur dan lari. Kemudian Allah menyebutkan kebahagiaan mereka jika berhal-berhala mereka disebut, Allah berfirman: وَإِذَا ذُكِرَ الَّذِينَ مِن دُونِهِۦٓ( dan apabila nama sembahan-sembahan selain Allah yang disebut) Yakni tuhan-tuhan yang mereka ada-adakan seperti al-Laata dan al-Uzza. إِذَا هُمْ يَسْتَبْشِرُونَ(tiba-tiba mereka bergirang hati) Yakni mereka merasa senang dan gembira."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Apabila yang disebut hanya asma Allah, bukan sesembahan mereka, maka menjadi kesal hati orang-orang yang tidak beriman kepada hari akhirat. Namun sebaliknya, jika yang disebut adalah nama selain Allah yaitu para berhala sesembahan mereka maka mereka menjadi gembira dan senang. Kata idza menunjukkan efek/respon yang cepat terhadap stimulus yang ada. Mujahid berkata: Ayat ini turun ketika Nabi membaca surat An-najm di depan Ka’bah yang membuat hati orang-orang musyrik itu gembira ketika sampai pada ayat: “Apakah engkau tidak memperhatikan Lata dan Uza, juga Manat sebagai anak perempuan Allah.” An-Najm:19-20"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila hanya Allah yang disebut, maka akan kesal} menolak dengan penuh kebencian {hati orang-orang yang tidak beriman kepada akhirat. Dan apabila sesembahan selain Allah disebut, maka tiba-tiba mereka bergembira} senang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. Allah menyebutkan kondisi orang-orang musyrikin dan apa yang ditimbulkan oleh kesyirikan mereka, yaitu bahwa sesungguhnya mereka “apabila nama Allah saja yang disebut” untuk mengesakanNya dan sebagai perintah untuk mengikhlaskan ketaatan hanya kepadaNya serta meninggalkan apa-apa yang disembah selain Dia, mereka merasa kesal, bosan, dan sangat tidak menyukainya. “Dan apabila nama sembahan-sembahan selain Allah yang disebut” seperti berhala dan pujaan-pujaan, da nada penyeru yang menyerukan supaya menyembah dan memujinya, “tiba-tiba mereka bergirang hati” karenanya, karena senang sembahan-sembahan mereka disebut dan karena syirik sejalan dengan hawa nafsu mereka. Kondisi seperti ini adalah kondisi yang paling jahat dan paling keji; namun saat mereka adalah di Hari Pembalasan nanti! Di sanalah hak akan diambil dari mereka dan dilihat, apakah tuhan-tuhan mereka itu berguna bagi mereka yang dahulu mereka sembah dari selain Allah?! Maka dari itu Dia berfirman, “Katakanlah, ‘Ya Allah, Pencipta langit dan bumi’,” Pencipta dan PEngelola keduanya, “Yang mengetahui yang ghaib” yaitu yang lepas dari jangkauan penglihatan dan pengetahuan kita “dan yang nyata,” yang dapat kita saksikan, “Engkau-lah Yang memutuskan antara hamba-hambaMu tentang apa yang selalu mereka perselisihkan.” Sesungguhnya dia antara perselisihan yang sangat besar adalah perselisihan orang-orang yang bertauhid yang tulus ikhlas yang meyakini bahwa apa yang mereka anut itulah yang haq, dan bahwa milik merekalah al-husna (surge) di akhirat, bukan milik orang lain; dengan orang-orang musyrikin yang menjadikan selain Engkau sembahan-sembahan dan berhala, mereka menyamakan denganMu siapa yang sama sekali tidak sama sedikitpun, dan mereka benar-benar melecehkanMu dengan sebenar-benar pelecehan, mereka bersenang hati di kala sembahan-sembahan mereka disebut, dan mereka kesal ketika Engkau disebutkan. Sudah seperti itu keadaannya, mereka beranggapan bahwa mereka berada di atas kebenaran, sedangkan yang lain di atas kebatilan, dan bahwa surge adalah milik mereka. Allah berfirman, “Sesungguhnya orang-orang beriman, orang-orang Yahudi, orang-orang Shaabi-iin, orang-orang Nasrani, orang-orang Majusi dan orang-orang musyrik, Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu.: (Al-Hajj:17). Dan Allah telah menginformasikan kepada kita akan adanya pemberian keputusan di antara mereka sesudahnya, melalui FirmanNya, “Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi, matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata dan sebagian besar daripada manusia? Dan banyak di antara manusia yang telah ditetapkan azab atasnya. Dan barang siapa yang dihinakan Allah maka tidak seorang pun yang memuliakannya. Sesungguhnya Allah berbuat apa yang Dia kehendaki. Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Tuhan mereka. Maka orang kafir akan dibuatkan untuk mereka pakaian-pakaian dari api neraka. Disiramkan air yang sedang mendidih ke atas kepala mereka. Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka). Dan untuk mereka cambuk-cambuk dari besi. Setiap kali mereka hendak keluar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan): \"Rasailah azab yang membakar ini\". Sesungguhnya Allah memasukkan orang-orang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang dibawahnya mengalir sungai-sungai. Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas dan mutiara, dan pakaian mereka adalah sutera.” (Al-Hajj:19-23), dan Allah juga telah berfirman, “Orang-orang yang beriman dan tidak mencampur adukkan iman mereka dengan kelaliman (syirik), mereka itulah orang-orang yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk.” (Al-An’am:82). “Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah, maka pasti Allah mengharamkan kepadanya surga, dan tempatnya ialah neraka, tidaklah ada bagi orang-orang lalim itu seorang penolong pun.” (Al-Maidah:72). Pada ayat ini terkandung penjelasan tentang keumuman (keluasan cakupan) ciptaan Allah, kemutlakan ilmuNya dan keumuman hukumNya yang berlaku di antara hamba-hambaNya. MahaKuasaNya yang dariNya semua makhluk ini terlahir dan ilmuNya yang meliputi segala sesuatu membuktikan adanya keputusanNya di antara hamba-hambaNya, kebangkitan mereka dan ilmu pengetahuan Allah kepada amal-amal perbuatan mereka yang baik dan buruk, dan ukuran-ukuran balasannya. ciptaanNya membuktikan ilmuNya; tidakkah Tuhan yang menciptakan itu mengetahui?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 45: (Dan apabila disebutkan nama Allah semata) tanpa menyebut nama tuhan-tuhan mereka kesal) mendongkol dan anti pati (hati orang-orang yang tidak beriman kepada kehidupan akhirat, dan apabila nama-nama sembahan-sembahan selain Allah yang disebut) yakni berhala-berhala (tiba-tiba mereka bergirang hati.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan orang-orang musyrik dan perbuatan yang dikehendaki oleh syirk mereka. Yakni hanya Allah saja yang dikatakan berhak disembah dan bahwa selain-Nya tidak berhak disembah, kemudian mereka diperintahkan untuk beribadah hanya kepada-Nya serta meninggalkan sesembahan selain-Nya. Hal itu karena syirk sesuai hawa nafsu mereka. Keadaan ini merupakan keadaan yang paling buruk dan paling keji. Akan tetapi untuk pembalasan mereka sudah ada waktunya yaitu hari Kiamat, dimana akan diambil hak itu dari mereka dan mereka akan melihat, apakah berhala dan patung yang mereka sembah di dunia dapat menolong mereka atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 45",
    "description": "Ayat-ayat yang lalu menjelaskan penurunan Al-Qur'an secara hak dan pengingkaran kaum musyrik mekah terhadap kebenaran yang dibawanya. Ayat-ayat berikut lebih memerinci bentuk kesesatan mereka melalui sikap buruk yang mereka punyai. Dan apabila yang disebut hanya nama Allah, tanpa menyebut nama berhala-berhala yang mereka sembah, maka kesal sekali hati orang-orang yang tidak beriman kepada akhirat itu. Namun apabila nama-nama sembahan selain Allah yang mereka jadikan perantara menyembah Allah disebut, tiba-tiba mereka menjadi bangga dan bergembira. 46. Guna menghadapi sikap buruk mereka itu, Allah memerintahkan nabi Muhammad untuk berdoa. Katakanlah atau berdoalah, 'ya Allah, pencipta langit dan bumi, engkaulah zat yang mengetahui segala yang gaib dan yang nyata, hanya engkaulah, tidak ada yang lain, yang memutuskan di antara hamba-hamba-Mu. Dengan perkenan-Mu ya Allah, jatuhkanlah putusan tentang apa yang selalu mereka perselisihkan. '."
  }
]