[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Ya Allah, Pencipta langit dan bumi dan Pembuat keduanya tanpa contoh sebelumnya, Yang mengetahui yang rahasia dan yang nyata, Engkau menetapkan keputusan diantara hamba-hambaMu di Hari Kiamat dalam perkara-perkara yang mereka perselisihkan tentang perkataan terhadapMu, keagunganMu, kekuasaanMu, iman kepadaMu dan kepada RasulMu, bimbinglah aku kepada kebenaran dalam apa yang diperselisihkan, sesungguhnya Engkau membimbing siapa yang Engkau kehendaki ke jalan yang lurus.” Ini adalah diantara doa Rasulullah dan ia adalah pengajaran kepada para hamba agar bersandar kepada Allah dan berdoa kepadaNya dengan nama-namaNya yang sangat baik dan sifat-sifatNya yang Mahatinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Katakanlah -wahai Rasul-,“Ya Allah Pencipta langit dan bumi tanpa contoh sebelumnya, Yang mengetahui apa yang gaib dan apa yang hadir, tidak ada sesuatu pun yang samar bagi-Nya, Engkau menetapkan keputusan di antara hamba-hamba-Mu pada hari Kiamat terkait apa yang mereka perselisihkan di dunia, sehingga jelaslah siapa yang benar dan siapa yang batil, siapa yang berbahagia dan siapa yang sengsara.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Hai Rasulullah, katakanlah: “Ya Allah, Engkau adalah Pencipta tujuh langit dan bumi, Maha Mengetahui apa yang tersembunyi dari para makhluk dan apa yang dapat mereka saksikan. Engkau akan memberi ketetapan tentang perkara agama yang dahulu mereka perselisihkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. أَنتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِى مَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ (Engkaulah Yang memutuskan antara hamba-hamba-Mu tentang apa yang selalu mereka memperselisihkannya) Engkau membalas kebaikan orang yang berbuat baik dan membalas keburukan orang yang berbuat buruk; maka ketika itu akan terlihat siapa orang yang benar dan siapa yang salah sehingga perselisihan diantara mereka akan hilang. Imam Muslim dan Abu Daud meriwayatkan dari Aisyah ia berkata: “Rasulullah jika melakukan shalat malam, beliau membuka shalatnya dengan berdoa: “Ya Allah Tuhan Jibril, Mikail, dan Israfil, Wahai Pencipta langit dan bumi yang mengetahui hal yang ghaib dan yang nampak, Engkaulah yang memutuskan antara hamba-hamba-Mu tentang apa yang mereka perselisihkan, maka berilah aku petunjuk kepada kebenaran dari apa yang diperselisihkan atas izin-Mu, Engkau memberi petunjuk kepada siapa yang Engkau kehendaki ke jalan yang lurus”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Wahai Nabi katakanlah: “Ya Allah, Engkau adalah Pencipta langit dan bumi, Yang Maha Mengetahui segala yang ghoib maupun yang tampak. Engkau Maha Bijaksana dalam menetapkan perselisihan hamba-Mu dalam hal agama. Sehingga kebenaran menjadi tampak. Tunjukanlah jalan yang lurus kepadaku tentang perselisihan mereka Ya Allah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Ya Allah, Pencipta} Pencipta dan pembuat {langit dan bumi, Dzat yang mengetahui segala yang ghaib dan nyata} yang rahasia dan yang dinyatakan {Engkaulah yang memutuskan} yang menentukan dan memutuskan {di antara hamba-hambaMu apa yang selalu mereka perselisihkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. Allah menyebutkan kondisi orang-orang musyrikin dan apa yang ditimbulkan oleh kesyirikan mereka, yaitu bahwa sesungguhnya mereka “apabila nama Allah saja yang disebut” untuk mengesakanNya dan sebagai perintah untuk mengikhlaskan ketaatan hanya kepadaNya serta meninggalkan apa-apa yang disembah selain Dia, mereka merasa kesal, bosan, dan sangat tidak menyukainya. “Dan apabila nama sembahan-sembahan selain Allah yang disebut” seperti berhala dan pujaan-pujaan, da nada penyeru yang menyerukan supaya menyembah dan memujinya, “tiba-tiba mereka bergirang hati” karenanya, karena senang sembahan-sembahan mereka disebut dan karena syirik sejalan dengan hawa nafsu mereka. Kondisi seperti ini adalah kondisi yang paling jahat dan paling keji; namun saat mereka adalah di Hari Pembalasan nanti! Di sanalah hak akan diambil dari mereka dan dilihat, apakah tuhan-tuhan mereka itu berguna bagi mereka yang dahulu mereka sembah dari selain Allah?! Maka dari itu Dia berfirman, “Katakanlah, ‘Ya Allah, Pencipta langit dan bumi’,” Pencipta dan PEngelola keduanya, “Yang mengetahui yang ghaib” yaitu yang lepas dari jangkauan penglihatan dan pengetahuan kita “dan yang nyata,” yang dapat kita saksikan, “Engkau-lah Yang memutuskan antara hamba-hambaMu tentang apa yang selalu mereka perselisihkan.” Sesungguhnya dia antara perselisihan yang sangat besar adalah perselisihan orang-orang yang bertauhid yang tulus ikhlas yang meyakini bahwa apa yang mereka anut itulah yang haq, dan bahwa milik merekalah al-husna (surge) di akhirat, bukan milik orang lain; dengan orang-orang musyrikin yang menjadikan selain Engkau sembahan-sembahan dan berhala, mereka menyamakan denganMu siapa yang sama sekali tidak sama sedikitpun, dan mereka benar-benar melecehkanMu dengan sebenar-benar pelecehan, mereka bersenang hati di kala sembahan-sembahan mereka disebut, dan mereka kesal ketika Engkau disebutkan. Sudah seperti itu keadaannya, mereka beranggapan bahwa mereka berada di atas kebenaran, sedangkan yang lain di atas kebatilan, dan bahwa surge adalah milik mereka. Allah berfirman, “Sesungguhnya orang-orang beriman, orang-orang Yahudi, orang-orang Shaabi-iin, orang-orang Nasrani, orang-orang Majusi dan orang-orang musyrik, Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu.: (Al-Hajj:17). Dan Allah telah menginformasikan kepada kita akan adanya pemberian keputusan di antara mereka sesudahnya, melalui FirmanNya, “Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi, matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata dan sebagian besar daripada manusia? Dan banyak di antara manusia yang telah ditetapkan azab atasnya. Dan barang siapa yang dihinakan Allah maka tidak seorang pun yang memuliakannya. Sesungguhnya Allah berbuat apa yang Dia kehendaki. Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Tuhan mereka. Maka orang kafir akan dibuatkan untuk mereka pakaian-pakaian dari api neraka. Disiramkan air yang sedang mendidih ke atas kepala mereka. Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka). Dan untuk mereka cambuk-cambuk dari besi. Setiap kali mereka hendak keluar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan): \"Rasailah azab yang membakar ini\". Sesungguhnya Allah memasukkan orang-orang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang dibawahnya mengalir sungai-sungai. Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas dan mutiara, dan pakaian mereka adalah sutera.” (Al-Hajj:19-23), dan Allah juga telah berfirman, “Orang-orang yang beriman dan tidak mencampur adukkan iman mereka dengan kelaliman (syirik), mereka itulah orang-orang yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk.” (Al-An’am:82). “Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah, maka pasti Allah mengharamkan kepadanya surga, dan tempatnya ialah neraka, tidaklah ada bagi orang-orang lalim itu seorang penolong pun.” (Al-Maidah:72). Pada ayat ini terkandung penjelasan tentang keumuman (keluasan cakupan) ciptaan Allah, kemutlakan ilmuNya dan keumuman hukumNya yang berlaku di antara hamba-hambaNya. MahaKuasaNya yang dariNya semua makhluk ini terlahir dan ilmuNya yang meliputi segala sesuatu membuktikan adanya keputusanNya di antara hamba-hambaNya, kebangkitan mereka dan ilmu pengetahuan Allah kepada amal-amal perbuatan mereka yang baik dan buruk, dan ukuran-ukuran balasannya. ciptaanNya membuktikan ilmuNya; tidakkah Tuhan yang menciptakan itu mengetahui?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 46: (Katakanlah, \"Wahai Allah) lafal Allaahumma maknanya sama dengan Yaa Allah (Pencipta langit dan bumi) yakni yang mengadakan keduanya (Yang mengetahui barang yang gaib dan yang nyata) yakni apa-apa yang gaib dan apa-apa yang nyata dapat disaksikan (Engkaulah Yang memutuskan antara hamba-hamba-Mu tentang apa yang selalu mereka perselisihkan\") mengenai masalah agama, berilah aku petunjuk kepada yang benar dari apa yang mereka perselisihkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentang perkara agama. Di antara perkara yang paling besar yang diperselisihkan adalah perkara orang-orang yang bertauhid dengan perkara orang-orang musyrik. Orang-orang yang bertauhid mengatakan bahwa mereka yang hak (benar) dan bahwa mereka akan memperoleh surga di akhirat tidak selain mereka, sedangkan orang-orang musyrik yang mengadakan tandingan bagi Allah dan menyamakan makhluk dengan-Nya juga mengatakan bahwa mereka berada di atas yang hak, sedangkan selain mereka berada di atas kebatilan, dan bahwa surga akan mereka peroleh. Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, orang-orang Shaabi-iin, orang-orang Nasrani, orang-orang Majusi dan orang-orang musyrik, Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu.” (Terj. Al Hajj: 17) Keputusan Allah terhadap mereka yang berselisih itu telah diberitahukan pula kepada kita oleh Allah Subhaanahu wa Ta'aala dalam lanjutan ayat di surah Al Hajj: 19-23. Di sana Allah Subhaanahu wa Ta'aala menerangkan bahwa orang-orang yang menyembah selain Allah akan disiksa di neraka dan orang-orang yang menyembah Allah akan dimasukkan ke dalam surga. Dalam ayat di atas terdapat penjelasan meratanya penciptaan Allah, merata pula ilmu-Nya, merata pula hukum-Nya di antara hamba-hamba-Nya. Kekuasaan-Nya yang dari sana terwujud semua makhluk dan ilmu-Nya yang meliputi segala sesuatu menunjukkan bahwa Dia akan memberikan keputusan di antara hamba-hamba-Nya, akan membangkitkan mereka. Pengetahuan-Nya terhadap amal mereka, yang baik maupun yang buruk dan ukuran balasan-Nya serta penciptaan-Nya menunjukkan ilmu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 46",
    "description": "Guna menghadapi sikap buruk mereka itu, Allah memerintahkan nabi Muhammad untuk berdoa. Katakanlah atau berdoalah, 'ya Allah, pencipta langit dan bumi, engkaulah zat yang mengetahui segala yang gaib dan yang nyata, hanya engkaulah, tidak ada yang lain, yang memutuskan di antara hamba-hamba-Mu. Dengan perkenan-Mu ya Allah, jatuhkanlah putusan tentang apa yang selalu mereka perselisihkan. '47. Dan andai kata orang-orang musyrik itu mengetahui dan menyadari putusan apa yang akan dijatuhkan Allah terhadap mereka, maka persoalannya akan menjadi lain. Sebab, sekiranya orang-orang yang zalim, yang menganiaya diri sendiri itu mempunyai segala apa yang ada di bumi berupa kekayaan yang berlimpah, dan ditambah lagi sebanyak itu bersamanya, niscaya mereka pasti akan menebus dirinya dengan itu dari memperoleh azab yang buruk pada hari kiamat. Dan dengan demikian akan lebih jelaslah bagi mereka bahwa azab dari Allah yang dahulu tidak pernah mereka perkirakan betapa buruk dan pedihnya."
  }
]