[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya orang-orang yang menyekutukan sesuatu dengan Allah itu mempunyai segala kekayaan dan perbendaharaan harta benda yang ada di bumi dan ditambah yang semisal dengannya, niscaya di Hari Kiamat nanti mereka akan rela melepasnya untuk menebus diri mereka dari pedihnya azab. Dan sekiranya mereka melepasnya dan hendak menebusnya, niscaya ia tetap tidak diterima, semua itu tidak berguna sedikit pun bagi mereka dari azab Allah, dan di hari itu mereka mengetahui keputusan dan azab Allah yang tidak pernah mereka kira sebelumnya di dunia bahwa ia akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Seandainya orang-orang yang menganiaya diri mereka dengan kesyirikan dan kemaksiatan mempunyai apa yang ada di jagad raya ini berupa harta kekayaan yang berharga, niscaya mereka akan menggunakannya untuk menebus diri mereka dari azab keras yang mereka saksikan sesudah mereka dibangkitkan, namun tidak ada kesempatan bagi mereka untuk itu, seandainya bisa pun, tetap tertolak, dan mereka melihat berbagai macam-macam azab yang tidak pernah mereka bayangkan sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Allah memberi peringatan dari akibat kekafiran yang pasti akan datang: Seandainya mereka memiliki segala harta yang ada di bumi dan ditambah lagi dengan harta yang semisalnya, agar mereka dapat menebus diri mereka dengan harta itu, niscaya itu tidak akan diterima. Dan ketika itu akan tampak bagi mereka segala jenis azab yang belum pernah mereka perkirakan, dan pada hari kiamat akan jelas balasan setiap dosa yang telah mereka lakukan. Mereka akan terkepung oleh azab sebagai balasan atas hinaan yang mereka lakukan terhadap Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا۟ مَا فِى الْأَرْضِ جَمِيعًا (Dan sekiranya orang-orang yang zalim mempunyai apa yang ada di bumi semuanya) Yakni segala harta benda dan simpanan yang ada di dunia. وَمِثْلَهُۥ مَعَهُۥ(dan (ada pula) sebanyak itu besertanya) Yakni yang dikumpulkan dengan harta benda itu. لَافْتَدَوْا۟ بِهِۦ مِن سُوٓءِ الْعَذَابِ يَوْمَ الْقِيٰمَةِ ۚ( niscaya mereka akan menebus dirinya dengan itu dari siksa yang buruk pada hari kiamat) Yakni dari buruknya azab Allah bagi mereka pada hari itu sebagai balasan atas kezaliman mereka. وَبَدَا لَهُم مِّنَ اللهِ مَا لَمْ يَكُونُوا۟ يَحْتَسِبُونَ(Dan jelaslah bagi mereka azab dari Allah yang belum pernah mereka perkirakan) Yakni siksaan, kemurkaan, dan azab Allah menjadi jelas bagi mereka yang sebelumnya tidak mereka sangka. Mujahid berkata: mereka melakukan amalan-amalan yang mereka sangka adalah amal kebaikan, namun ternyata itu adalah amal keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Meskipun orang-orang yang mendholimi diri mereka sendiri dengan kekufuran dan kemaksiatan itu mempunyai segalanya baik harta maupun kenikmatan di dunia, bahkan sekalipun dilipat-lipatkan, pasti mereka akan menebus azab yang mereka terima pada hari kiamat. Mereka akan melihat dan menerima azab yang belum pernah sama sekali mereka bayangkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekiranya orang-orang yang zalim mempunyai semua yang ada di bumi dan ditambah lagi sebanyak itu, niscaya mereka akan menebus dirinya dengan itu dari azab yang buruk pada hari kiamat. Tampak jelas} tampak {bagi mereka (azab) dari Allah yang belum pernah mereka perkirakan} yang mereka sangkakan dan harapkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Setelah Allah menjelaskan bahwasanya Dia-lah Pemberi keputusan di antara hamba-hambaNya, maka disini Allah menjelaskan perkataan kaum musyrikin yang begitu keji, seakan-akan jiwa merasa penasaran kepada apa yang akan dilakukan oleh Allah terhadap mereka pada Hari Kiamat kelak. Maka Allah menginformasikan bahwasanya untuk mereka adalah “siksa” yang terburuk, yakni, yang paling dahsyat lagi paling berat, (setimpal) sebagaimana mereka telah mengatakan kekufuran yang paling berat dan paling keji; dan seandainya saja mereka memiliki semua apa yang ada di bumi berupa emas, perak, mutiara, hewan-hewan, pohon-pohon, tanaman-tanaman, bejana, dan segala perlengkapannya dan yang serupa dengan itu lagi, kemudian mereka menjadikannya sebagai tebusan “pada Hari Kiamat” untuk menebus diri mereka dari azab dan agar mereka selamat darinya, niscaya tidak diterima dan tidak pula bisa menyelamatkan mereka dari azab Allah sedikitpun juga. “Yaitu pada hari yang tidak berguna lagi harta kekayaan maupun anak-anak keturunan, kecuali orang yang datang menghadap Allah dengan hati yang selamat,”. “dan jelaslah bagi mereka azab dari Allah yang belum pernah mereka perkirakan.” Maksudnya, yang tidak pernah mereka duga, seperti kemurkaan yang amat luar biasa dan kemarahan yang amat besar, sedangkan mereka dahulu memutuskan lain dari itu bagi diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 47: (Dan sekiranya orang-orang yang zalim mempunyai apa yang ada di bumi semuanya dan -ada pula- sebanyak itu besertanya, niscaya mereka akan menebus dirinya dengan itu dari siksa yang buruk pada hari kiamat. Dan jelaslah) tampaklah dengan jelas (bagi mereka azab Allah yang belum pernah mereka perkirakan) yang tidak pernah mereka duga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa Dia akan memberikan keputusan di antara hamba-hamba-Nya, Dia juga menyebutkan perkataan orang-orang musyrik yang begitu keji, seakan-akan jiwa rindu untuk mengetahui apa tindakan Allah kepada mereka pada hari KIamat, maka Allah Subhaanahu wa Ta'aala memberitahukan, bahwa bagi mereka azab yang paling buruk dan jelek sebagaimana mereka mengatakan kata-kata yang sangat buruk dan sangat jelek. Dan kalau seandainya mereka memiliki semua yang ada di bumi, baik emas, perak, mutiara, hewan, pohon-pohon dan tanaman serta bangunannya, lalu mereka korbankan semua itu untuk menebus dirinya dari azab, maka tidak akan diterima dari mereka, dan lagi semua itu tidak berguna apa-apa baginya, karena pada hari itu adalah hari yang tidak berguna harta dan anak selain orang yang menghadap Allah membawa hati yang bersih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 47",
    "description": "Dan andai kata orang-orang musyrik itu mengetahui dan menyadari putusan apa yang akan dijatuhkan Allah terhadap mereka, maka persoalannya akan menjadi lain. Sebab, sekiranya orang-orang yang zalim, yang menganiaya diri sendiri itu mempunyai segala apa yang ada di bumi berupa kekayaan yang berlimpah, dan ditambah lagi sebanyak itu bersamanya, niscaya mereka pasti akan menebus dirinya dengan itu dari memperoleh azab yang buruk pada hari kiamat. Dan dengan demikian akan lebih jelaslah bagi mereka bahwa azab dari Allah yang dahulu tidak pernah mereka perkirakan betapa buruk dan pedihnya. 48. Dan demikian pula akan semakin jelaslah bagi mereka akibat buruk dari kejahatan seperti apa yang telah mereka kerjakan, dan mereka akan diliputi oleh azab disebabkan oleh apa yang dahulu mereka selalu memperolok-olokkannya."
  }
]