[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka apabila manusia ditimpa kesulitan dan kemudaratan, dia memohon kepada Tuhannya agar mengangkat darinya, namun bila Kami menghilangkannya darinya apa yang telah menimpanya dan menggantinya dengan kenikmatan dari Kami, maka dia kembali kafir kepada Tuhannya dan mengingkari karuniaNya dan dia berkata, “Sesungguhnya apa yang aku dapatkan ini berdasarkan ilmu Allah bahwa aku memang layak dan berhak mendapatkannya.” Tidak demikian, sebaliknya itu adalah ujian dari Allah kepada hamba-hambaNya agar Dia melihat siapa yang bersyukur dan siapa yang kafir dari mereka, sekalipun kebanyakan dari mereka (karena kebodohan dan prasangka buruk mereka) tidak menyadari bahwa hal itu merupakan istidraj (penguluran waktu) dari Allah bagi mereka dan ujian dariNya atas mereka, apakah mereka akan mensyukuri nikmat-nikmatNya atau tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Bila orang kafir tertimpa sakit, kemiskinan atau sejenisnya, ia berdoa kepada Kami agar Kami menghilangkan apa yang menimpanya itu. Namun ketika Kami memberinya nikmat berupa kesehatan atau harta, maka orang kafir itu berkata, “Allah memberiku ini karena Dia mengetahui bahwa aku memang berhak mendapatkannya.” Padahal sebenarnya itu hanyalah ujian dan istidraj, akan tetapi kebanyakan orang-orang kafir tidak mengetahui hal itu, maka mereka tertipu dengan nikmat yang Allah berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-51. Jika manusia tertimpa kesulitan, dia meminta pertolongan kepada Kami; dan ketika Kami telah menghilangkan kesulitan itu, dia berkata: “Sungguh pertolongan yang aku dapatkan ini karena Allah mengetahui aku layak mendapatkannya.” Namun kenyataannya bukan seperti yang mereka anggap, namun itu merupakan ujian dari Allah, agar Dia melihat siapa yang akan bersyukur dan siapa yang akan ingkar. Akan tetapi mereka tidak mengetahui bahwa pertolongan itu adalah ujian. Yang memiliki anggapan seperti itu adalah umat-umat terdahulu yang mendustakan, sehingga kenikmatan dunia yang fana tidak dapat menyelamatkan merkea saat siksaan mendatangi mereka; dan akhirnya mereka tertimpa akibat dari dosa-dosa yang telah mereka kerjakan. Hai Rasulullah, kaummu yang menzalimi diri mereka sendiri dengan melakukan kekafiran akan tertimpa azab seperti yang telah menimpa umat-umat sebelum mereka, mereka tidak akan dapat melarikan diri dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. فَإِذَا مَسَّ الْإِنسٰنَ ضُرٌّ دَعَانَا (Maka apabila manusia ditimpa bahaya ia menyeru Kami) Yakni tabiat manusia adalah jika dia tertimpa musibah seperti penyakit, kemiskinan, dan lain sebagainya maka dia akan memohon kepada Allah dengan penuh ketundukan agar Dia mengangkat dan mencegah musibah itu. ثُمَّ إِذَا خَوَّلْنٰهُ نِعْمَةً مِّنَّا(kemudian apabila Kami berikan kepadanya nikmat dari Kami) Yakni ketika Kami memberinya kenikmatan dari sisi Kami. قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍۭ ۚ (ia berkata: “Sesungguhnya aku diberi nikmat itu hanyalah karena kepintaranku”) Yakni itu berkat ilmuku dalam mencari penghasilan, atau berkat kebaikanku, atau berkat ilmu dari Allah atas keutamaanku. بَلْ هِىَ فِتْنَةٌ (Sebenarnya itu adalah ujian) Yakni apa yang Kami berikan kepadamu itu bukan karena sebab-sebab yang kau sebutkan, namun itu adalah cobaan bagimu apakah kamu akan bersyukur atau mengingkari kenikmatan itu. وَلٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (tetapi kebanyakan mereka itu tidak mengetahui) Yakni tidak mengerti bahwa itu adalah istidraj dan cobaan bagi mereka apakah mensyukuri atau mengingkarinya, oleh sebab itu mereka tetap tenggelam dalam kenikmatan meskipun mereka berbuat kebatilan tanpa Allah balas mereka segera."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Ketika manusia tertimpa musibah dan kesulitan, seperti sakit atau kemiskinan dan sebagainya, mereka meminta dan momohon kepada Kami agar menghilangkan musibah mereka. Namun setelah Kami mengabulkan permohonan mereka berupa kenikmatan dan menghilangkan kesulitan mereka, mereka berkata: “Sesungguhnya ini semua hanya karena ketangkasan, pengetahuan, dan kecerdasan kami untuk memperolehnya.” Bal berfungsi untuk menekankan kalimat akhir dari pada kalimat awal. Itu semua adalah ujian bagi mereka, apakah mereka bersyukur atau mengingkarinya? Namun kebanyakan manusia tidak mengetahui bahwa nikmat-nikmat yang tetap diberikan namun mereka bermaksiat adalah suatu istidraj dan ujian bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila manusia ditimpa} ditimpa {bencana, maka akan menyeru Kami. Kemudian apabila Kami memberinya} Kami memberi dan menganugerahkan kepadanya {nikmat dari Kami, dia berkata,“Sesungguhnya aku diberikan itu karena pengetahuanku”} Aku diberi hal ini karena pengetahuan dari Allah bahwa sesungguhnya aku atas hal tersebut adalah seorang ahli {Sebenarnya itu adalah ujian} cobaan dan pembiaran {tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Allah mengabarkan tentang kondisi dan tabiat manusia, yaitu apabila ia ditimpa hal yang membahayakan, seperti penyakit, kesempitan atau kemiskinan dan kesusahan “ia menyeru Kami” dengan merengek-rengek (sangat serius) untuk membebaskan diri dari apa yang menimpanya, “kemudian apabila Kami berikan kepadanya nikmat dari Kami,” Kami mengangkat bahaya yang menimpanya dan Kami hilangkan kesulitannya, maka ia kembali kafir kepada Rabbnya dan mengingkari kebaikanNya dan malah “ia berkata, ‘SEsungguhnya aku diberi nikmat itu hanyalah berdasarkan pengetahuan’.” Maksudnya, pengetahuan Allah bahwasanya aku memang ahlinya dan aku berhak mendapatkannya, sebab aku sangat pemurah dengan harta tersebut; atau karena kepintaranku akan cara-cara memperolehhnya. Allah berfirman, “Sebenarnya itu adalah ujian,” yang dengannya Allah menguji hamba-hambaNya agar Dia melihat siapa yang beresyukur kepadaNya dan siapa pula yang mengingkariNya. “Tetapi kebanyakan mereka itu tidak mengetahui,” maka dari itu mereka menganggap ujian itu sebagai pemberian kebaikan yang murni, dan tidak jelas bagi mereka antara yang jelas baik dengan apa-apa yang kadang bisa menjadi sebab kebaikan dan bisa menjadi sebab keburukan.."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 49: (Maka apabila manusia ditimpa) yang dimaksud adalah jenis manusia (bahaya ia menyeru Kami, kemudian apabila Kami berikan kepadanya) Kami anugerahkan kepadanya (nikmat) yakni pemberian nikmat (dari Kami ia berkata, \"Sesungguhnya aku diberi nikmat itu hanyalah atas sepengetahuan) dari Allah bahwasanya aku adalah orang yang pantas untuk mendapatkannya.\" Atau dengan kata lain, karena kepintaranku. (Sebenarnya itu) maksudnya, ucapan itu (adalah ujian) cobaan yang ditimpakan kepada seorang hamba (tetapi kebanyakan mereka itu tidak mengetahui) bahwasanya pemberian nikmat itu merupakan Istidraj dan ujian baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan manusia dan tabiatnya, bahwa ketika ia ditimpa bencana, baik itu penyakit, marabahaya, musibah dan lain sebagainya, dia berdoa kepada Allah sambil mendesak dalam doanya agar dihilangkan bencana itu, namun ketika Allah Subhaanahu wa Ta'aala menghilangkan bencana itu dan memberinya nikmat, ternyata ia kembali kafir kepada Tuhannya dan mengingkari kebaikan-Nya. Bahkan mengatakan, \"Sesungguhnya aku diberi nikmat ini hanyalah karena kepintaranku,” Yakni, “Sesungguhnya aku diberi nikmat ini hanyalah karena aku tahu dari Allah bahwa aku memang berhak, karena aku orang mulia atau karena aku mengetahui cara untuk menghasilkannya.” Yakni cobaan dan ujian, agar Allah menyaksikan siapa yang bersyukur dan siapa yang kufur. Oleh karena itu, mereka menganggap bahwa ujian itu merupakan nikmat dan bagi mereka terasa samar kebaikan yang murni dengan sesuatu yang menjadi sebab kepada kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 49",
    "description": "Setelah pada ayat-ayat yang lalu dilukiskan keadaan orang-orang yang melakukan pelanggaran terhadap ketentuan Allah, maka pada ayat-ayat berikut diungkap penyebab mengapa orang-orang tersebut melakukan pelanggaran itu. Maka apabila manusia ditimpa bahaya atau bencana dia akan menyeru kami meminta pertolongan, kemudian sebaliknya, apabila kami berikan nikmat kami kepadanya, dia akan berkata, 'sesungguhnya aku diberi nikmat ini hanyalah karena ilmu dan kepin-taranku sendiri. ' sebenarnya tidaklah seperti yang dia duga, nikmat itu sendiri adalah ujian dari Allah, tetapi kebanyakan mereka tidak mengetahui dan tidak menyadarinya. 50. Sikap yang tergambar di atas bukan hanya dimiliki oleh orang-orang musyrik mekah, tetapi juga oleh orang-orang yang jauh sebelum mereka. Sungguh, orang-orang yang sebelum mereka, yaitu qarun pada masa nabi musa, pun telah mengatakan hal itu juga (lihat: surah al-qa'a'/28: 78), maka oleh sebab itu, tidak berguna lagi bagi me-reka sedikit pun apa yang dahulu mereka kerjakan di kehidupan dunia."
  }
]