[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan langit dan bumi serta apa yang ada diantara dengan haq, Dia mendatangkan malam dan menyirnakan siang, dan mendatangkan siang, dan menyirnakan malam. Dia juga menundukan matahari dari rembulan dengan tatanan yang teratur untuk kemaslahatan haba-hambaNya, masing-masing darinya beredar pada orbitnya sampai hari kiamat. ketauhilah bahwa sesungguhnya Allah melakukan semua itu dan Dia yang melimpahkan nikmat kepada makhlukNYa, maha pengampun terhadap dosa-dosa hambaNYa yang bertaubat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Allah menciptakan langit dan bumi untuk suatu hikmah yang mendalam, bukan main-main sebagaimana dituduhkan oleh orang-orang zalim. Allah memasukkan malam ke siang dan sebaliknya. Bila salah satunya datang, maka yang lain pergi. Allah menundukkan matahari dan rembulan, keduanya beredar sampai waktu yang ditentukan, yaitu akhir kehidupan dunia ini. Ingatlah bahwa Allah -Subḥānahu- Maha Perkasa yang mengalahkan musuh-musuh-Nya, tidak seorang pun bisa mengalahkan-Nya, Maha Pengampun terhadap dosa-dosa orang yang bertobat dari hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah menciptakan langit dan bumi serta seisinya dengan benar, Dia berbuat segala sesuatu terhadapnya sesuai dengan kehendak-Nya; mendatangkan malam dan menghilangkan siang, mendatangkan siang dan menghilangkan malam; dan menundukkan matahari dan bulan sehingga beredar pada orbitnya masing-masing dengan teratur hingga hari kiamat, sehingga ia dapat mendatangkan manfaat bagi manusia. Allah yang melakukan semua itu dan memberi kenikmatan bagi manusia dengan makhluk-makhluk tersebut, Dia menciptakan dan menundukkannya. Allah Maha Perkasa atas makhluk-Nya dan Maha mengampuni dosa hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ ۖ (Dia menciptakan langit dan bumi dengan (tujuan) yang benar) Yakni Allah tidak menciptakan keduanya dengan sia-sia, dan selama makhluk yang besar Allah ciptakan maka ia tidak layak untuk menjadi sekutu, pasangan, atau anak-Nya. يُكَوِّرُ الَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى الَّيْلِ ۖ (Dia menutupkan malam atas siang dan menutupkan siang atas malam) Pergantian siang menjadi malam adalah dengan menutupi siang itu sehingga cahayanya redup, sedangkan pergantian malam menjadi siang adalah dengan menutupi malam dengan siang sampai hilang kegelapannya. وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ (dan menundukkan matahari dan bulan) Yakni Allah menjadikan keduanya taat kepada perintah-Nya dengan terbit dan terbenam untuk memberi manfaat bagi hamba-hamba-Nya. كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ۗ (masing-masing berjalan menurut waktu yang ditentukan) Yakni beredar pada orbitnya sampai kehancuran dunia, yaitu ketika hari kiamat. أَلَا هُوَ الْعَزِيزُ الْغَفّٰرُ (Ingatlah Dialah Yang Maha Perkasa lagi Maha Pengampun) Yakni Dia menutupi dosa hamba-Nya dengan ampunan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah menciptakan langit dan bumi dengan haq. Yakni dengan tanpapermainan dan bukanlah kebatilan. Dan penciptaan yang demikian ini, mustahil adanya kesyirikan dan anak. Sebagaimana malam yang ditutupi siang sampai hilang cahayanya, sebagaimana juga siang yang tertutupi malam sampai hilang gelapnya. Pembicaraan disini merupakankinayah atas lamanya jarak di dunia dan di akhirat, Allah menjadikan matahari dan bulan tunduk kepada Allah sebagaimana yang Allah perintahkan untuk terbit dan tenggelam sebagaimana yang diperlukan manusia. Masing-masing dari keduanya mengitari tempatnya sampai pada waktu yang ditentukan Allah: yaitu hari kiamat. Bukankah Allah dzat yang Maha Kuat, yang banyak mengampuni hambaNya yang bertaubat dari dosanya, dan ayat tersebut menunjukkan wujud Allah, keEsaanNya dan kekuasaanNya, lafadz (alaa) bermakna tanbih bagi mitra tutur sebagai inayah (pengkhususan) lafadz setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan langit dan bumi dengan benar. Dia menutupkan} memasukkan {malam atas siang, menutupkan siang atas malam, serta menundukkan} menundukkan {matahari dan bulan. Masing-masing beredar sesuai waktu yang ditentukan} waktu yang ditentukan {Ketahuilah bahwa Dialah Dzat Yang Maha perkasa} Dzat Yang menaklukkan segala urusan dan membalas musuh-musuhNya {lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah memberitahu bahwasanya Dia “menciptakan langit dan bumi dengan benar,” maksudnya, untuk suatu hikmah dan maslahat dan untuk memerintah manusia dan melarang mereka, memberi pahala mereka dan menghukum mereka. “Dia menutupkan malam atas siang dan menutupkan siang atas malam,” maksudnya, memasukkan salah satu dari keduanya kepada yang lain dan menduduki posisinya, sehingga malam tidak pernah bersatu dengan siang, melainkan apabila yang satu datang, maka yang lain melepaskan diri dari yang lainnya. “Dan menundukkan matahari dan bulan” dengan penundukan yang teratur dan rotasi yang rapi. “masing-masing” matahari dan bulan “berjalan” karena terpengaruh oleh aturan Allah “menurut waktu yang ditentukan” yaitu berakhirnya dunia ini dan kemusnahannya, di mana Allah akan memusnahkan segala perlengkapannya, matahari dan bulannya, dan menghidupkan kembali manusia dalam penciptaan yang baru; agar mereka menetap di negeri abadi, surge atau neraka. “Ingatlah, Dia-lah Yang Mahaperkasa,” yang tidak bisa dikalahkan, yang mengendalikan segala sesuatu, yang tidak ada sesuatu pun yang sulit bagiNya, yang karena keperkasaanNya Dia menciptakan makhluk-makhluk yang luar biasa ini dan menundukkannya, mereka berjalan berdasarkan perintahNya. “Lagi Maha Pengampun” terhadap dosa-dosa hamba-hambaNya yang bertaubat lagi beriman, sebagaimana difirmankanNya, “Dan sesungguhnya Aku Maha Pengampun bagi orang yang bertobat, beriman, beramal saleh, kemudian tetap di jalan yang benar.” (Thaha:82) Maha pengampun bagi orang-orang yang terlanjur mempersekutukanNya dan setelah melihat ayat-ayat (tanda-tanda kebesaranNya) yang luar biasa, lalu ia bertaubat dan kembali kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 5: (Dia menciptakan langit dan bumi dengan -tujuan- yang benar) lafal Bilhaqqi berta'alluq kepada lafal Khalaqa (Dia menutupkan) yakni memasukkan (malam atas siang) sehingga waktu malam bertambah. (dan menutupkan siang) memasukkannya (atas malam) sehingga waktu siang bertambah (dan Dia menundukkan matahari dan bulan, masing-masing berjalan) pada garis edarnya (hingga waktu yang ditentukan) yakni hari kiamat. (Ingatlah Dialah Yang Maha Perkasa) Yang Maha Menang atas semua perkara-Nya dan Yang Maha Membalas terhadap musuh-musuh-Nya (lagi Maha Pengampun) kepada kekasih-kekasih-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan hikmah dan maslahat, dan agar Dia memerintah dan melarang hamba-hamba-Nya serta memberikan pahala dan siksa. Jika yang satu tiba, maka yang lain pergi. Dengan diedarkan secara teratur. Yakni sampai hancurnya dunia ini, lalu Dia menghancurkan pula perlengkapannya, matahari dan bulan, kemudian menciptakan kembali makhluk yang telah mati untuk diberikan balasan dan untuk menempati tempat yang kekal; surga atau neraka. Yang tidak dapat dikalahkan, bahkan Dia mengalahkan segala sesuatu. Dengan keperkasaan-Nya Dia mengadakan makhluk-makhluk yang besar itu dan menundukkannya. terhadap dosa hamba-hamba-Nya yang bertobat dan beriman. Dia juga mengampuni orang yang berbuat syirk yang sadar setelah melihat ayat-ayat-Nya yang agung lalu ia bertobat dari syirk itu dan kembali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 5",
    "description": "Di antara bukti kuasa Allah menciptakan, mengurus, dan mengatur alam semesta adalah bahwa dia menciptakan langit dan bumi dengan tujuan yang benar. Dia senantiasa memasukkan malam atas siang sehingga gelap berganti terang, dan senantiasa memasukkan siang atas malam sehingga terang berganti gelap, dan menundukkan matahari dan bulan; masing-masing patuh pada hukum Allah, beredar pada porosnya, dan berjalan menurut waktu yang ditentukan. Ingatlah, Allah menyempurnakan dan membaguskan ciptaan-Nya. Dialah yang mahamulia, maha pengampun, lagi maha penyayang. 6. Wahai manusia, dia menciptakan kamu dari diri yang satu, yaitu nabi adam, kemudian darinya dia jadikan hawa sebagai pasangannya sehingga dari keduanya lahirlah beberapa keturunan laki-laki maupun perempuan. (lihat pula: surah an-nis'/4: 1). Dan dia menurunkan pula delapan pasang hewan ternak untukmu, yakni sepasang unta, sapi, domba, dan kambing (lihat pula: surah al-an''m/6: 143'144). Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian secara bertahap dari setetes mani menjadi segumpal darah, segumpal daging, kemudian tumbuh menjadi janin. Janin itu berada dalam tiga kegelapan, yaitu kegelapan dalam perut, kegelapan dalam rahim, dan kegelapan dalam selaput penutup janin dalam rahim. Yang berbuat demikian itu adalah Allah, pencipta manusia dan alam semesta. Dialah tuhan kamu, tuhan yang memiliki kerajaan dan menguasai langit dan bumi. Tidak ada tuhan yang pantas disembah selain dia; maka mengapa kamu dapat dipalingkan oleh setan untuk menyembah selain dia yang telah menciptakanmu'."
  }
]