[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkataan mereka ini telah diucapkan pula oleh orang-orang sebelum mereka dari kalangan umat-umat yang telah berlalu lagi mendustakan, maka harta dan anak-anak yang mereka usahakan (di dunia) tidak sedikit pun bisa membantu mereka saat azab Allah datang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Perkataan yang sama telah diucapkan oleh orang-orang kafir sebelum mereka, maka harta dan kedudukan yang mereka miliki tidak berguna sedikit pun bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قَدْ قَالَهَا الَّذِينَ مِن قَبْلِهِمْ (Sungguh orang-orang yang sebelum mereka (juga) telah mengatakan itu pula) Yakni perkataan mereka “Sesungguhnya aku diberi nikmat itu hanyalah karena kepintaranku” telah dikatakan juga oleh orang-orang sebelum mereka seperti Qarun dan lainnya. فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ(maka tiadalah berguna bagi mereka apa yang dahulu mereka usahakan) Yakni kenikmatan dunia yang mereka dapatkan tidak dapat bermanfaat sedikitpun bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Orang-orang sebelum mereka (sebelum kafir Quraiys) pun telah mengakatakan perkataan tersebut, seperti Qarun dan lainnya. Semua yang telah mereka kerjakan di dunia tidak akan berguna lagi bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh orang-orang yang sebelum mereka pun telah mengatakan hal itu} mengatakan perkataan tersebut {Maka tidak berguna} melindungi {bagi mereka apa yang selalu mereka usahakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah berfirman, “Sungguh orang-orang yang sebelum mereka juga telah mengatakan itu pula,” maksudnya, telah mengatakan seperti perkataan mereka, “Sesungguhnya aku diberi nikmat itu hanyalah berdasarkan pengetahuan,” dan ia menjadi warisan bagi orang-orang yang mendustakan, mereka tidak mengakui nikmat TUhan mereka dan mereka juga tidak meyakini hakNya. Demikianlah kebiasaan dan tabiat mereka yang berlanjut hingga mereka dibinasakan kemudian, dan tidak berguna “bagi mereka apa yang dahulu mereka usahakan” saat siksaan datang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 50: (Sungguh orang-orang yang sebelum mereka juga mengatakan itu pula) yakni umat-umat sebelum mereka, seperti apa yang telah dikatakan oleh Qarun dan kaumnya yang mengatakan hal yang serupa (maka tiadalah berguna bagi mereka apa yang dahulu mereka usahakan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti Qarun dan kaumnya yang ridha dengan sikapnya itu. Sikap dan ucapan itu diwarisi dari orang-orang terdahulu yang kufur nikmat, tidak mengakui nikmat Allah, dan tidak melihat hak-Nya, sehingga mereka dibinasakan Allah, dan ketika azab datang, maka apa yang mereka usahakan tidaklah berguna sedikit pun bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 50",
    "description": "Sikap yang tergambar di atas bukan hanya dimiliki oleh orang-orang musyrik mekah, tetapi juga oleh orang-orang yang jauh sebelum mereka. Sungguh, orang-orang yang sebelum mereka, yaitu qarun pada masa nabi musa, pun telah mengatakan hal itu juga (lihat: surah al-qa'a'/28: 78), maka oleh sebab itu, tidak berguna lagi bagi me-reka sedikit pun apa yang dahulu mereka kerjakan di kehidupan dunia. 51. Lalu karena itu, mereka ditimpa bencana dari akibat buruk dari apa yang mereka perbuat di dunia. Dan demikian pula orang-orang yang zalim di antara mereka juga akan dikenai bencana dari akibat buruk apa yang telah mereka kerjakan dan mereka tidak dapat melepaskan diri dari azab itu."
  }
]