[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka akibat buruk dari perbuatan buruk tersebut menimpa orang-orang yang mengucapkan perkataan tersebut dari kalangan umat-umat terdahulu, dan akibat perbuatan buruk yang mereka lakukan berupa kehinaan hidup di dunia menimpa mereka. Dan orang-orang yang menzhalimi diri mereka dari kaummu (wahai Rasul) mengucapkan perkataan ini, mereka juga akan ditimpa akibat buruk dari buruknya perbuatan mereka, sebagaimana hal itu juga telah menimpa orang-orang sebelum mereka, dan mereka tidak akan bisa menyelamatkan diri atau berlari dari Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Maka mereka menerima balasan keburukan-keburukan yang mereka kerjakan, berupa kesyirikan dan kemaksiatan. Dan orang-orang yang menzalimi diri mereka dengan kesyirikan dan kemaksiatan dari orang-orang yang masih hidup akan menerima balasan dari keburukan-keburukan yang mereka kerjakan seperti orang-orang yang telah berlalu, mereka tidak akan pernah bisa lolos dan luput dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. فَأَصَابَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ ۚ (Maka mereka ditimpa oleh akibat buruk dari apa yang mereka usahakan) Yakni sebagai balasan atas keburukan yang telah mereka perbuat. وَالَّذِينَ ظَلَمُوا۟ مِنْ هٰٓؤُلَآءِ(Dan orang-orang yang zalim di antara mereka) Yakni diantara orang-orang kafir itu. سَيُصِيبُهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟( akan ditimpa akibat buruk dari usahanya) Sebagaimana orang-orang sebelum mereka telah tertimpa akibat buruk itu berupa kekeringan, terbunuh dalam perang dan tertawan, dan mendapat kekalahan. وَمَا هُم بِمُعْجِزِينَ (dan mereka tidak dapat melepaskan diri) Yakni mereka tidak dapat lolos dari Allah, sebab kepada-Nya mereka akan kembali, dan Allah akan menyiksa mereka sesuai dengan kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Lalu mereka akan ditimpa bencana sebabagai balasan amal dan perbuatan mereka. Juga orang-orang zalim di antara kaummu akan ditimpa bencana atas perbuatan mereka, seperti kekeringan, kematian dan sebagainya. Azab yang mereka terima tidak akan berakhir, mereka tidak akan pernah mendapati bahwa Allah lemah akan hal itu. Bahkan tempat mereka kembali mutlak adalah menuju Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka ditimpa keburukan-keburukan atas apa yang mereka perbuat} balasan atas keburukan yang mereka perbuat {Orang-orang yang zalim di antara mereka akan ditimpa keburukan-keburukan atas apa yang mereka perbuat dan tidak dapat melepaskan diri} melepaskan diri dari Allah dan tidak pula mendahuluiNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Maka mereka ditimpa oleh akibat buruk dari apa yang mereka usahakan,” keburukan-keburukan yang dimaksud di sini adalah siksaan-siksaan, sebab keburukan-keburukan tersebut berakibat buruk bagi manusia dan membuatnya sedih. “Dan orang-orang yang zhalim di antara mereka akan ditimpa akibat buruk dari usahanya,” maka mereka tidak lebih baik dari orang-orang sebelumnya itu, dan tidak ditetapkan di dalam catatan tertulis kitab-kitab terdahulu suatu kebebasan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 51: (Maka mereka ditimpa oleh akibat buruk dari apa yang mereka usahakan) yakni menerima pembalasannya. (Dan orangorang yang lalim di antara mereka) yakni orang-orang Quraisy (akan ditimpa akibat buruk dari usahanya dan mereka tidak dapat melepaskan diri) dari azab Kami; maka Kami timpakan kepada mereka paceklik selama tujuh tahun, sesudah itu mereka dimudahkan lagi rezekinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka ditimpa dengan hukuman bagi amal mereka. Karena mereka tidak lebih baik daripada generasi sebelum mereka, dan lagi mereka tidak memiliki jaminan bebas dari azab dalam kitab-kitab terdahulu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 51",
    "description": "Lalu karena itu, mereka ditimpa bencana dari akibat buruk dari apa yang mereka perbuat di dunia. Dan demikian pula orang-orang yang zalim di antara mereka juga akan dikenai bencana dari akibat buruk apa yang telah mereka kerjakan dan mereka tidak dapat melepaskan diri dari azab itu. 52. Dan tidakkah mereka mengetahui dan menyadari bahwa Allah melapangkan rezeki bagi siapa yang dia kehendaki dan juga membatasinya bagi siapa yang dia kehendaki' sesungguhnya pada yang demikian, yakni melapangkan dan menyempitkan rezeki itu, terdapat tanda-tanda kekuasaan Allah bagi kaum yang beriman."
  }
]