[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang itu tidak mengetahui bahwa rizki Allah kepada manusia bukan merupakan bukti kebaikan hidup pemiliknya, karena sesungguhnya Allah, berdasarkan hikmahNya yang mendalam, melapangkan rizkiNya kepada siapa yang Dia kehendaki dari hamba-hambaNya, baik dia shalih ataupun durjana, dan menyempitkannya bagi siapa yang Dia kehendaki dari mereka? Sesungguhnya dilapangkan dan disempitkannya rizki tersebut benar-benar mengandung petunjuk yang jelas bagi kaum yang membenarkan perintah Allah dan melaksanakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Apakah orang-orang musyrikin itu mengucapkan apa yang diucapkan oleh orang-orang kafir sebelum mereka, dan mereka tidak mengetahui bahwa Allah melapangkan rezeki bagi siapa yang Dia kehendaki sebagai ujian dari-Nya, apakah ia bersyukur atau kufur? Dan menyempitkannya bagi siapa yang Dia kehendaki untuk mengujinya apakah ia sabar atau murka terhadap keputusan Allah? Sesungguhnya yang demikian itu, yaitu dilapangkannya rezeki oleh Allah dan disempitkannya, mengandung petunjuk tentang pengaturan Allah bagi kaum yang beriman. Karena mereka adalah orang-orang yang mengambil faedah dari petunjuk. Adapun orang-orang kafir, maka petunjuk tersebut datang kepada mereka sementara mereka berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Tidakkah orang-orang musyrik itu mengetahui bahwa Allah melapangkan rezeki bagi suatu kaum dan menyempitkannya bagi kaum yang lain? Kelapangan rezeki bukanlah tolak ukur kebaikan pemiliknya, namun itu merupakan ujian dan cobaan. Sungguh pada hal yang agung ini terdapat bukti-bukti yang jelas bagi orang-orang yang beriman kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. أَوَلَمْ يَعْلَمُوٓا۟ أَنَّ اللهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ (Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezeki bagi siapa yang dikehendaki-Nya?) Yakni Allah melapangkan rezeki bagi siapa yang Dia kehendaki untuk dilapangkan-Nya. وَيَقْدِرُ ۚ( dan menyempitkannya) Yakni Allah menyempitkan rezeki bagi siapa yang Dia kehendaki untuk disempitkan-Nya. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ(Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah) Yakni tanda-tanda yang besar dan agung. لِّقَوْمٍ يُؤْمِنُونَ(bagi kaum yang beriman)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Apakah orang musyrik itu tidak tahu bahwa Allah itu Maha Luas dalam menganugerahkan rizki bagi siapa pun yang Dia kehendaki. Allah juga Maha Kuasa untuk menyempitkan rizki siapapun yang Allah kehendaki. Sesungguhnya keluasan dan kesempitan rizki itu merupakan bukti bagi orang-orang yang beriman kepada Allah dan rasul-Nya. Juga sebagai bukti bahwa rizki ada pada kekuasaan Allah, tidak ada yang bisa terjadi kecuali atas izin Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak mengetahui bahwa Allah melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dan menyempitkannya} dan menyempitkannya bagi siapa yang Dia kehendaki {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Setelah Allah menjelaskan bahwasanya mereka terpedaya dengan harta benda dan mereka mengklaim berdasarkan kebodohannya bahwasanya (nikmat yang diberikan kepada mereka itu) membuktikan baiknya kondisi pemiliknya, maka Allah mengabarkan kepada mereka bahwa rizkiNya tidak menunjukkan kepada yang demikian, dan sesungguhnya Allah, “melapangkan rizki bagi siapa yang Dia kehendaki” di antara hamba-hambaNya, yang shalih ataupun yang durhaka, “dan menyempitkan” rizki, artinya, menyempitkan rizki bagi siapa saja di antara HambaNya yang shalih ataupun yang durhaka. Jadi rizki Allah itu diberikan sama kepada semua manusia, sedangkan iman dan amal shalih diistimewakan hanya kepada manusia-manusia terbaik. “Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi kaum yang beriman.” Maksudnya, Allah melapangkan rizki dan menahannya; karena mereka mengetahui bahwa semua itu kembali kepada hikmah (kebijaksanaan) dan rahmat (Nya); dan mengetahui bahwa Dia lebih mengetahui tentang kondisi hamba-hambaNya. Kadang-kadang DIa menyempitkan rizkiNya terhadap mereka karena sifat lembutNya kepada mereka, sebab kalau seandainya Dia melapangkannya, niscaya mereka akan berbuat congkak di muka bumi ini. Jika demikian, maka itu berarti Allah dalam memberikan rizki tersebut selalu memperhatikan kebaikan agama mereka yang merupakan materi dasar kebahagiaan dan keberuntungan mereka. Wallahu a’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 52: (Dan tidakkah mereka mengetahui bahwa Allah melapangkan rezeki) meluaskannya (bagi siapa yang dikehendaki-Nya) sebagai ujian baginya (dan menyempitkannya?) membatasinya bagi siapa yang dikehendaki-Nya sebagai cobaan baginya. (Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi kaum yang beriman) kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan bahwa mereka tertipu oleh harta benda dunia, namun karena kebodohan mereka, mereka malah menyangka bahwa hal itu menunjukkan kebaikan pada mereka, maka Allah memberitahukan, bahwa rezeki yang diberikan-Nya tidaklah menunjukkan demikian karena Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkannya, baik orang itu salih atau tidak. Rezeki-Nya diberikan kepada semua makhluk-Nya, namun iman dan amal saleh hanya diberikan kepada makhluk pilihan-Nya. Karena orang-orang yang beriman mengetahui, bahwa pelapangan rezeki dan penyempitannya kembalinya kepada hikmah dan rahmat, dan Dia lebih mengetahui keadaan hamba-Nya. Terkadang Dia menyempitkan rezeki kepada mereka karena kelembutan-Nya kepada mereka, karena jika Dia melapangkannya tentu mereka akan berbuat zalim di bumi, sehingga Allah Subhaanahu wa Ta'aala dalam hal itu memperhatikan baik tidaknya bagi agama mereka, dimana agama merupakan materi kebahagiaan dan keberuntungan mereka, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 52",
    "description": "Dan tidakkah mereka mengetahui dan menyadari bahwa Allah melapangkan rezeki bagi siapa yang dia kehendaki dan juga membatasinya bagi siapa yang dia kehendaki' sesungguhnya pada yang demikian, yakni melapangkan dan menyempitkan rezeki itu, terdapat tanda-tanda kekuasaan Allah bagi kaum yang beriman. 53. Pada ayat yang lalu digambarkan betapa buruknya sanksi yang diperoleh orang-orang yang durhaka. Segala apa yang sudah mere-ka peroleh di dunia tidak memberi manfaat sedikit pun untuk kese-lamatan mereka. Ayat-ayat berikut menggambarkan betapa Allah itu maha pengasih lagi maha pengampun bagi hamba-hamba-Nya. Katakanlah, wahai nabi Muhammad, 'wahai hamba-hamba-ku, yang telah berbuat melampaui batas terhadap diri mereka sendiri karena ba-Nyak melakukan kedurhakaan! janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya selama yang berdosa itu bertobat dan kembali ke jalan yang lurus. Sungguh, dialah zat yang maha pengampun, maha penyayang. \"."
  }
]