[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada hamba-hambaKu yang bergelimang dalam kemaksiatan dan melampaui batas terhadap diri mereka sendiri dengan melakukan dosa-dosa ajakan dari hawa nafsu mereka, “Janganlah kalian berputus asa dari rahmat Allah hanya karena banyaknya dosa kalian, sebab Allah mengampuni semua dosa-dosa bagi siapa yang bertaubat darinya dan meninggalkannya sebanyak apa pun dosa-dosa itu. Sesungguhnya Allah Maha Pengampun bagi dosa para hambaNya yang bertaubat kepadaNya lagi Maha Penyayang kepada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Katakanlah -wahai Rasul- kepada hamba-hamba-Ku yang melampaui batas atas diri mereka dengan kesyirikan kepada Allah dan kemaksiatan, “Jangan berputus asa dari rahmat Allah dan ampunan-Nya terhadap dosa-dosa kalian, karena sesungguhnya Allah mengampuni seluruh dosa bagi siapa yang bertobat kepada-Nya. Sesungguhnya Allah Maha Pengampun bagi dosa-dosa siapa yang bertobat, Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-54. Allah memberi kabar gembira bagi hamba-hamba-Nya yang banyak melakukan dosa dengan luasnya kemurahan dan rahmat-Nya. Hai Rasulullah dan para da’i yang meneruskan dakwahnya, katakanlah kepada hamba-hamba-Ku yang banyak melakukan kemaksiatan: “Janganlah kalian berputus asa dari rahmat Allah yang luas. Allah Maha Mengampuni seluruh dosa, Dia Maha Mengampuni dosa hamba-hamba-Nya yang bertaubat dan Maha Mengasihi mereka. Hai para hamba, datanglah kepada Allah dengan taubat dan ketaatan, dan tunduklah kepada-Nya dengan penuh keikhlasan sebelum azab menimpa kalian, sehingga tidak ada yang dapat menyelamatkan kalian selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. قُلْ يٰعِبَادِىَ الَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ (Katakanlah: “Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri) Yang dimaksud dengan melampaui batas yakni banyak melakukan kemaksiatan. لَا تَقْنَطُوا۟( janganlah kamu berputus asa) Yakni janganlah habis harapan. مِن رَّحْمَةِ اللهِ ۚ( dari rahmat Allah) Yakni dari ampunan-Nya. Ini merupakan ayat al-Qur’an yang paling memberi harapan besar, sebab ayat ini mengandung kabar gembira yang paling agung. Pertama, dalam ayat ini Allah menisbatkan hamba-hamba-Nya kepada diri-Nya untuk memuliakan mereka dan menambah kegembiraan mereka; kemudian Allah menyebut mereka dengan orang-orang yang banyak melakukan kemaksiatan dan dosa-dosa, kemudian Allah melanjutkannya dengan larangan untuk berputus asa dari rahmat-Nya bagi orang-orang yang banyak melakukan dosa tersebut, sehingga larangan berputus asa bagi orang-orang yang tidak banyak melakukan dosa adalah lebih utama dan lebih termaksud dalam ayat ini. Kemudian Allah menutup ayat ini dengan firman-Nya yang tidak menyisakan keraguan sedikitpun: إِنَّ اللهَ يَغْفِرُ الذُّنُوبَ(Sesungguhnya Allah mengampuni dosa-dosa) Yakni Allah mengampuni segala dosa sebesar apapun jika Dia menghendaki, kecuali dosa syirik dari pelakunya yang belum bertaubat, sebab Allah berfirman: إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء “Sesungguhnya Allah tidak akan mengampuni dosa syirik, dan Dia mengampuni segala dosa yang selain dari (syirik) itu, bagi siapa yang dikehendaki-Nya.” (an-Nisa’: 48) Dan Allah menekankan hal ini dengan firman-Nya: جَمِيعًا (semuanya) Sungguh ini merupakan kabar gembira yang menenangkan hati orang-orang beriman yang berbuat baik. إِنَّهُۥ هُوَ الْغَفُورُ الرَّحِيمُ (Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang) Yakni ampunan dan rahmat Allah sangat besar dan luas. Maka barangsiapa yang menyangka bahwa membuat hamba-hamba Allah berputus asa dari rahmat-Nya lebih baik daripada kabar gembira yang diberikan Allah bagi mereka sebagaimana yang banyak dilakukan oleh para penceramah dan pemberi nasehat, maka ia telah melakukan kesalahan yang paling besar dan paling buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Katakanlah wahai Nabi: “Wahai hamba Allah yang telah berbuat di luar batas dan telah banyak melakukan kemaksiatan. Janganlah kalian putus asa untuk mendapatkan ampunan Allah selagi pintu taubat masih terbuka. Sesungguhnya Allah mengampuni semua dosa kecuali dosa syirik yang pelakunya belum bertaubat. Sesungguhnya Allah Dzat Yang Maha Mengampuni dan Maha Luas dalam mencurahkan rahmat. Ibnu Abbas berkata: \"Sesungguhnya orang-orang musynk telah membunuh, kemudian mereka semakin banyak. Mereka juga berbuat zina, kemudian mereka semakin banyak. Lalu mereka datang kepada Nabi Muhammad dan bertanya. Sesungguhnya apa yang kamu katakan dan kamu serukan itu benar-benar suatu yang baik, atau engkau kabarkan kami bahwa kami bisa bertaubat.” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai hamba-hambaKu yang melampaui batas atas dirinya sendiri} melampaui batas dalam menganiaya diri sendiri dengan berbuat kemusyrikan dan melakukan kemaksiatan {janganlah berputus asa} janganlah berputus asa {dari rahmat Allah. Sesungguhnya Allah mengampuni semua dosa. Sesungguhnya Dialah Dzat Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Allah mengabarkan kepada hamba-hambaNya yang melampaui batas akan keluasan kebaikanNya, dan menghimbau mereka untuk berinabah (kembali) kepadaNya sebelum hal itu menjadi tidak mungkin mereka lakukan, seraya berfirman, “katakanlah” wahai Rasul, dan wahai orang-orang yang menggantikan posisi beliau, yaitu para da’i yang menyerukan kepada Agama Allah seraya menyampaikan berita kepada hamba-hambaNya dari Rabb mereka, “Hai hamba-hambaKu yang melampaui batas terhadap diri mereka sendiri,” dengan menuruti apa saja yang diinginkan oleh hawa nafsunya, yaitu dosa-dosa dan perbuatan yang dapat mengundang murka Allah Yang Maha mengetahui segala yang ghaib, “janganlah kamu berputus asa dari rahmat Allah.” Maksudnya, janganlah berputus harap darinya lalu kalian menceburkan diri kalian ke dalam kebinasaan dan kalian mengatakan, “Dosa-dosaku sudah terlanjur sangat banyak dan keburukan-keburukan sudah menggunung, maka sudah tidak ada lagi jalan untuk bisa menghilangkannya dan tidak ada cara untuk menjauhkannya,”; lalu kalian tetap, disebabkan yang demikian itu, terus melakukan kemaksiatan, memperbekali diri dengan apa yang dapat menyebabkan Allah Yang Maha Pengasih murka terhadap kalian! Akan tetapi kenalilah Tuhan kalian melalui nama-namaNya yang menunjukkan pada kemurahan dan kedermawananNya, dan ketahuilah bahwasanya Dia mengampuni semua dosa-dosa, seperti dosa syirik , pembunuhan, zina, riba, kezhaliman dan lain sebagainya dari dosa-dosa besar dan dosa-dosa kecil. “SEsungguhnya Dia-lah Yang Maha Pengampun lagi Maha Penyayang,” yakni, sifatNya yang memberikan ampunan dan rahmat adalah dua sifat yang lazim bagiNYa, yang DzatNya tidak pernah lepas dari keduanya. Dan pengaruh kedua sifat ini terus berlangsung di alam ini bahkan memenuhi jagat raya ini, kedua TanganNya mencurahkan berbagai kebaikan sepanjang malam dan siang, dan Dia melimpahkan berbagai nikmat kepada hamba-hambaNya dan berbagai keutamaan-keutamaan secara sembunyi-sembunyi dan terang-terangan; dan memberi lebih disukaiNya daripada menahan, dan rahmat (kasih saying) Nya mendahului dan mengalahkan sifat murkaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 53: (Katakanlah, \"Hai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri, janganlah kalian berputus asa) dapat dibaca Laa Taqnithuu atau Laa Taqnathuu; sebagian ahli qiraat ada yang membacanya Laa Taqnuthuu; artinya janganlah kalian putus asa (dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya) bagi orang yang bertobat dari kemusyrikan. (Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma bahwa orang-orang yang pernah berbuat syirk juga melakukan pembunuhan, dan banyak melakukan hal itu, demikian pula melakukan perzinaan dan banyak melakukan hal itu, lalu mereka mendatangi Nabi Muhammad shallallahu 'alaihi wa sallam dan berkata, “Sesungguhnya yang engkau sampaikan dan engkau serukan benar-benar bagus. Kalau sekiranya engkau memberitahukan kami kaffarat (penebus) terhadap amal yang kami kerjakan. Maka turunlah ayat, “Dan orang-orang yang tidak menyembah Tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar, dan tidak berzina, …dst.” (Terj. Al Furqaan: 68) demikian pula turun ayat, “Katakanlah, \"Wahai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah…dst.” Hadits ini diriwayatkan pula oleh Muslim, Abu Dawud dan Nasa’i. Hakim meriwayatkan dari Ibnu Umar dari Umar ia berkata, “Kami pernah mengatakan bahwa bagi orang yang melakukan fitnah (menghalangi manusia dari jalan Allah) tidak bisa bertobat dan Allah tidak akan menerima tobatnya meskipun sedikit. Ketika Rasulullah shallallahu 'alaihi wa sallam tiba di Madinah, maka diturunkan ayat kepada mereka, “Katakanlah, \"Wahai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sungguh, Dialah Yang Maha Pengampun lagi Maha Penyayang.” dan (turun pula) beberapa ayat setelahnya. Umar berkata, “Lalu aku tulis ayat itu dengan tanganku dalam sebuah lembaran dan aku kirim kepada Hisyam bin Al ‘Aash, maka Hisyam bin Al ‘Aash berkata, “Ketika surat itu datang kepadaku, maka aku membacanya di Dzi Thuwa, aku naikkan ke atas dan aku tundukkan, namun aku tidak memahaminya sampai aku berkata, “Ya Allah, berilah kepahaman kepadaku.” Maka Allah Ta’ala memahamkan hatiku, bahwa ayat itu turun berkenaan dengan kami dan pada ucapan kami tentang diri kami dan dikatakan berkenaan dengan kami. Maka aku kembali ke untaku dan duduk di atasnya, kemudian aku menemui Rasulullah shallallahu 'alaihi wa sallam, sedangkan Beliau berada di Madinah.” (Hakim berkata, “Hadits ini shahih sesuai syarat Muslim, namun keduanya (Bukhari dan Muslim) tidak menyebutkannya,” dan didiamkan oleh Adz Dzahabi). Hadits ini juga diriwayatkan oleh Ibnu Ishaq sebagaimana dalam Sirah Ibnu Hisyam juz 1 hal. 475. Haitsami dalam Majma’uz Zawaa’id juz 6 hal. 61 berkata, “Diriwayatkan oleh Al Bazzar dan para perawinya adalah tsiqah.” Syaikh Muqbil berkata, “Hadits tersebut dalam Kasyful Astaar juz 1 hal. 302, di dalamnya terdapat Shadaqah bin Saabiq dan ia tersembunyi keadaannya, tidak ada yang mentsiqahkan selain Ibnu Hibban, akan tetapi telah dimuataba’ahkan oleh Abdullah bin Idris sebagaimana dalam riwayat Hakim).” Allah Subhaanahu wa Ta'aala memberitahukan kepada hamba-hamba-Nya yang telah melampaui batas dalam maksiat tentang luasnya kemurahan-Nya, dan Dia mendorong mereka kembali kepada-Nya sebelum waktu untuk itu tidak ada lagi, yaitu setelah mati. Yakni wahai Rasul dan orang-orang yang menjadi penggantinya dari kalangan para da’i. Yaitu dengan mengikuti semua hawa nafsu yang mereka inginkan yang berupa perbuatan-perbuatan dosa dan mengerjakan perbuatan yang dimurkai oleh Allah Yang Maha Mengetahui semua yang gaib. Sehingga kamu jatuhkan dirimu ke jurang kebinasaan dan kamu katakan, “Dosa-dosa kami sudah terlalu banyak dan aib kami sudah menumpuk dan tidak ada jalan untuk menghapuskannya,” sehingga kamu terus menerus berbuat maksiat dan menghiasi dirimu setiap hari dengannya. Kenalilah Tuhanmu dengan nama-nama-Nya yang menunjukkan kemurahan-Nya, dan ketahuilah bahwa Dia menghapuskan dosa-dosa semuanya, baik syirk, membunuh, berzina, berbuat riba, zalim dan lainnya baik dosa besar maupun kecil. Sifat-Nya mengampuni dan merahmati, di mana keduanya adalah sifat yang selalu pada dzat-Nya, pengaruhnya senantiasa mengalir di alam semesta dan memenuhinya. Kedua Tangan-Nya melimpahkan kebaikan di malam dan siang dan nikmat-nikmat-Nya senantiasa diturunkan kepada hamba-hamba-Nya baik di waktu terang-terangan maupun di waktu tersembunyi. Dia lebih suka memberi daripada menghalangi, rahmat-Nya mendahului kemurkaan-Nya, namun untuk ampunan dan rahmat-Nya dan untuk memperolehnya ada sebab yang jika tidak didatangi hamba, maka sama saja ia menutup pintu rahmat dan ampunan bagi dirinya, di mana sebab yang paling besar dan paling agungnya adalah kembali kepada Allah Subhaanahu wa Ta'aala dengan tobat nashuh (yang sesungguhnya), berdoa, bertadharru’ dan beribadah kepada-Nya. Oleh karena itulah di ayat selanjutnya Allah Subhaanahu wa Ta'aala mengajak mereka yang sudah terbenam dalam dosa itu agar kembali dan bersegera menuju kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 53",
    "description": "Pada ayat yang lalu digambarkan betapa buruknya sanksi yang diperoleh orang-orang yang durhaka. Segala apa yang sudah mere-ka peroleh di dunia tidak memberi manfaat sedikit pun untuk kese-lamatan mereka. Ayat-ayat berikut menggambarkan betapa Allah itu maha pengasih lagi maha pengampun bagi hamba-hamba-Nya. Katakanlah, wahai nabi Muhammad, 'wahai hamba-hamba-ku, yang telah berbuat melampaui batas terhadap diri mereka sendiri karena ba-Nyak melakukan kedurhakaan! janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya selama yang berdosa itu bertobat dan kembali ke jalan yang lurus. Sungguh, dialah zat yang maha pengampun, maha penyayang. \"54. Dan ingatkan juga kepada mereka, wahai nabi Muhammad, 'kembalilah kamu kepada tuhanmu yang maha pengasih lagi maha penya-yang, dan berserah dirilah selalu kepada-Nya dengan tulus sepenuh hati, sebelum datang azab kepadamu, yang kemudian membuat kamu tidak dapat ditolong lagi. '."
  }
]