[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kembalilah kalian (wahai manusia) kepada Tuhan kalian dengan ketaatan dan taubat, tunduklah kepadaNya sebelum hukumanNya menimpa kalian, kemudian tidak ada yang menolong kalian selain Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Kembalilah kepada Tuhan kalian dengan bertobat dan amal saleh, tunduklah kepada-Nya sebelum azab pada hari Kiamat datang kepada kalian, kemudian kalian tidak memperoleh pertolongan dari berhala dan keluarga kalian dengan mengentaskan kalian dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَأَنِيبُوٓا۟ إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا۟ لَهُۥ (Dan kembalilah kamu kepada Tuhanmu, dan berserah dirilah kepada-Nya) Setelah Allah memberi mereka kabar gembira bahwa Dia mengampuni segala dosa, kemudian Allah memerintahkan mereka agar kembali kepada-Nya dengan melakukan ketaatan, menjauhi kemaksiatan, menyerahkan segala urusan mereka, dan tunduk kepada aturan-aturan-Nya. مِن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ(sebelum datang azab kepadamu) Yakni azab di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Kembalilah kalian semua kepada Tuhan kalian dengan melakukan ketaatan dan meninggalkan maksiat. Ikhlaslah dalam berbuat hanya kepada Tuhanmu. Sebelum azab menimpa kalian, sehingga kalian tidak akan mendapati satu penolongpun dari azab itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kembalilah kepada Tuhan kalian} kembalilah kepada Allah dengan bertaubat dan berbuat ketaatan {dan berserahdirilah} dan tunduklah {kepadaNya sebelum datang azab kepada kalian, kemudian kalian tidak akan ditolong} tidak bisa dilindungi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Akan tetapi untuk meraih ampunan dan rahmatNya mempunyai sebab-sebab yang jika sang hamba tidak melakukannya, maka berarti sesungguhnya ia telah menutup pintu rahmat dan ampunan terhadap dirinya sendiri. Dan sebab yang paling besar dan paling mulia, bahkan tidak ada yang selain dirinya, adalah inabah (kembali) kepada Allah dengan taubat yang sebenar-benarnya, berdoa dan bersimpuh (merendah diri), menghambakan diri dan beribadah (kepadaNya). Maka marilah melakukan sebab yang termulia dan teragung ini. Maka dari itu Allah memerintahkan inabah kepadaNya dan segera melakukannya seraya berfirman, “Dan kembalilah kamu kepada Rabbmu,” dengan sepenuh hati kalian, ”dan berserah dirilah kepadaNya,” dengan seluruh anggota tubuh kalian. Apabila keduanya digabung seperti pada uraian tadi, maka maknanya adalah apa yang telah disebutkan itu. Dan pada FirmanNya, “Kepada Rabbmu dan berserah dirilah kepadaNya,” terdapat dalil bahwa inabah itu harus dengan ikhlas, dan sesungguhnya tanpa adanya ikhlas, maka amal-amal lahiriyah dan batiniyah tidak berguna sama sekali. “Sebelum datang azab kepadamu,” dengan kedatangan yang tidak bisa ditolak, “Kemudian kamu tidak dapat ditolong.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 54: (Dan kembalilah kalian) bertobatlah kalian (kepada Rabb kalian, dan berserah dirilah) ikhlaskanlah di dalam beramal (kepada-Nya sebelum datang kepada kalian azab kemudian kalian tidak dapat ditolong lagi) yakni azab itu tidak dapat dicegah jika kalian tidak bertobat kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ikhlaskanlah amalmu karena-Nya. Hal itu, kaena tanpa keikhlasan maka amal yang tampak maupun yang tersembunyi tidak ada artinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 54",
    "description": "Dan ingatkan juga kepada mereka, wahai nabi Muhammad, 'kembalilah kamu kepada tuhanmu yang maha pengasih lagi maha penya-yang, dan berserah dirilah selalu kepada-Nya dengan tulus sepenuh hati, sebelum datang azab kepadamu, yang kemudian membuat kamu tidak dapat ditolong lagi. '55. Dan katakanlah kepada mereka, 'ikutilah dengan sebaik-baiknya apa yang telah diturunkan kepadamu, yakni Al-Qur'an, dari tuhanmu sebelum datang azab kepadamu secara mendadak apabila kamu tidak mau mengikuti petunjuk yang terdapat di dalamnya, sedang kamu tidak menyadarinya sehingga kamu tidak bersiap diri menghadapinya. '."
  }
]