[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ikutilah apa yang terbaik yang diturunkan oleh Tuhan kalian kepada kalian, yaitu al-Qur’an yang agung, semuanya adalah baik, lalu laksanakanlah perintah-perintahNya dan jauhilah larangan-laranganNya sebelum kalian ditimpa azab yang datang secara tiba-tiba sedangkan kalian tidak menyadarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Ikutilah Al-Qur`ān yang merupakan hal terbaik yang Rabb kalian turunkan kepada utusan-Nya, amalkanlah perintah-perintah-Nya dan jauhilah larangan-larangan-Nya sebelum azab datang kepada kalian secara tiba-tiba saat kalian lengah, sehingga kalian tidak bisa menghindarinya dengan bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Hai para hamba, ikutilah al-Qur’an yang merupakan kitab yang terbaik yang diturunkan kepada kalian, dan amalkanlah ia; sebelum azab menimpa kalian secara tiba-tiba tanpa kalian sadari; agar sebagian orang yang banyak berbuat dosa berkata: “betapa besar penyesalanku atas segala kemaksiatan yang aku lakukan, sungguh di dunia dahulu aku termasuk orang yang menghina dan melecehkan agama Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَاتَّبِعُوٓا۟ أَحْسَنَ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم (Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu dari Tuhanmu) Yakni ikutilah al-Qur’an, halalkanlah apa yang dihalalkan dalam al-Qur’an dan haramkan apa yang diharamkannya, dan laksanakanlah ketaatannya dan jauhilah kemaksiatannya, sebab segala yang ada dalam al-Qur’an mengandung kebaikan. Pendapat lain mengatakan bahwa yang dimaksud dengan sebaik-baik dari al-Qur’an yakni ayat-ayat muhkamatnya, bukan ayat-ayat mutasyabihat. Pendapat lain mengatakan yang dimaksud dengan itu adalah dengan memaafkan kesalahan orang lain tanpa menuntut balas, sebab menuntut balas dibolehkan dan memaafkan juga dibolehkan, namun ayat ini mendorong untuk memaafkan. Hal ini berlaku juga dalam segala hal yang memiliki dua sisi yang dibolehkan namun salah satunya lebih baik, baik itu dalam hal ibadah maupun lainnya. مِّن قَبْلِ أَن يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُونَ(sebelum datang azab kepadamu dengan tiba-tiba, sedang kamu tidak menyadarinya) Yakni sebelum kalian dikagetkan dengan kedatangan azab, sedangkan kalian dalam keadaan lalai dan tidak menyadarinya. Terdapat pendapat mengatakan bahwa yang dimaksud adalah mereka mati secara tiba-tiba sehingga mereka terjerumus ke dalam azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Laksanakanlah perintah Allah, dan tinggalkan larangan-Nya. Ikutilah Al-quran sebagai sebaik-baik petunjuk yang telah diturunkan kepadamu dari sisi Tuhanmu. Sebelum datang azab kepadamu secara mendadak, dan kamu tidak menyadarinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ikutilah sebaik-baik hal yang diturunkan kepada kalian dari Tuhan kalian} Al-Qur’an yang merupakan sebaik-baik hal yang diturunkan Tuhan kalian kepada rasulNya {sebelum azab datang kepada kalian secara mendadak} tiba-tiba {sedangkan kalian tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Mungkin muncul pertanyaan: apa itu inabah dan Islam, apa partikel-partikel dan amalan-amalannya? Maka Allah menjawab, “Dan ikutilah sebaik-baik apa yang telah diturunkan kepadamu dari Rabbmu” dari apa-apa yang diperintahkan kepada kalian, yaitu amalan-amalan batin, seperti cinta kepada Allah, takut kepadaNya, berharap kepadaNya dan tulus kepada hamba-hambaNya, mencintai kebaikan untuk mereka dan meninggalkan apa-apa yang bertentangan dengannya; dan juga amalan-amalan lahiriyah seperti shalat, zakat, puasa, menunaikan ibadah haji, sedekah dan semua bentuk ihsan (perbuatan baik), serta semua apa yang diperintahkan oleh Allah. Itu semua adalah hal-hal yang terbaik yang diturunkan oleh Allah kepada kita. Maka orang yang mengikuti perintah-perintah Rabbnya dalam perkara-perkara tersebut dan yang serupa dengannya, itulah orang yang munib (kembali) lagi berserah diri. “Sebelum datang azab kepadamu dengan tiba-tiba, sedang kamu tidak menyadarinya.” Semua ini adalah himbauan untuk segera (kembali kepadaNya) dan memanfaatkan kesempatan sebaik-baiknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 55: (Dan ikutilah sebaik-baik apa yang diturunkan kepada kalian dari Rabb kalian) yaitu Alquran (sebelum datang azab kepada kalian dengan tiba-tiba, sedang kalian tidak menyadari) akan kedatangannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seakan-akan ada pertanyaan, “Apa maksud kembali dan berserah diri? Apa bagian-bagian dan amal-amalnya? Maka dijawab dengan ayat di atas. Di antaranya adalah apa yang diperintahkan Allah yang terkait dengan amalan batin (tersembunyi) seperti mencintai Allah, takut kepada-Nya, berharap kepada-Nya, memiliki rasa tulus kepada hamba-hamba Allah, mencintai kebaikan untuk mereka dan sebagainya. Sedangkan apa yang diperintahkan Allah yang terkait dengan amalan zahir (tampak) adalah seperti shalat, zakat, puasa, haji, sedekah, berbagai macam ihsan dsb. Inilah di antara yang terbaik yang diturunkan kepada kita dari Tuhan kita. Orang-orang yang mengikuti perintah-Nya yang disebutkan dalam kitab-Nya atau yang disebutkan oleh Rasul-Nya dalam sunnahnya, maka dialah orang yang kembali dan berserah diri. Kalimat ini merupakan dorongan untuk segera melakukannya dan memanfaatkan kesempatan yang ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 55",
    "description": "Dan katakanlah kepada mereka, 'ikutilah dengan sebaik-baiknya apa yang telah diturunkan kepadamu, yakni Al-Qur'an, dari tuhanmu sebelum datang azab kepadamu secara mendadak apabila kamu tidak mau mengikuti petunjuk yang terdapat di dalamnya, sedang kamu tidak menyadarinya sehingga kamu tidak bersiap diri menghadapinya. '56-58. Setelah pada ayat yang lalu dijelaskan agar jangan berputus asa dari rahmat Allah dan seruan agar nabi Muhammad memberi peringatan agar mengikuti ajaran Al-Qur'an, pada ayat-ayat berikut dijelaskan tujuan peringatan itu disampaikan. Tujuannya adalah agar jangan ada orang yang mengatakan ketika siksaan tersebut datang, 'alangkah besar penyesalanku atas kelalaian dan kelengahan-ku dalam menunaikan kewajiban terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan agama Allah, ' atau agar jangan ada lagi yang akan berkata dengan penuh penyesalan, 'sekiranya Allah memberi aku petunjuk dan kepadaku dibentangkan jalan yang lurus, tentulah aku termasuk ke dalam kelompok orang-orang yang bertakwa, ' atau agar jangan ada lagi orang yang mengalami penyesalan yang sama sehingga dia berkata ketika melihat azab di hari kemudian, 'sekiranya aku dapat kembali ke dunia, tentu aku akan termasuk ke dalam kelompok orang-orang yang berbuat baik. '."
  }
]