[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Taatilah Tuhan kalian dan bertaubatlah kepadaNya sehingga suatu jiwa tidak akan menyesal dengan berkata, “Duhai, betapa ruginya aku karena dulu di dunia aku menyia-nyiakan kesempatan untuk melaksanakan apa yang Allah perintahkan, aku lalai dari menaatiNya dan menunaikan hakNya, dan sesungguhnya dulu di dunia aku termasuk orang-orang yang memperolok-olok perintah Allah, kitabNya, RasulNya dan orang-orang yang beriman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Lakukanlah hal itu agar jangan sampai seseorang berkata karena penyesalan yang mendalam pada hari Kiamat, ‘Aduhai betapa menyesalnya diriku atas kelalaianku dengan terus menerus melakukan kekufuran dan kemaksiatan dan penghinaanku terhadap orang-orang yang beriman dan menaati Rabb mereka’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. أَن تَقُولَ نَفْسٌ يٰحَسْرَتَىٰ عَلَىٰ مَا فَرَّطتُ فِى جَنۢبِ اللهِ (supaya jangan ada orang yang mengatakan: “Amat besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah) Agar tidak ada orang kafir yang mengatakan: “alangkah menyesalnya aku karena kelalaian yang telah aku lakukan dalam ketaatan kepada Allah dan beriman kepada-Nya dan kepada al-Qur’an serta kelalaianku untuk mengamalkannya. Al-Farra’ berkata: yakni kelalaianku di sisi Allah. وَإِن كُنتُ لَمِنَ السّٰخِرِينَ (sedang aku sesungguhnya termasuk orang-orang yang memperolok-olokkan) yakni termasuk orang-orang yang menghina agama Allah ketika di dunia. Mereka tidak hanya melalaikan ketaatan kepada Allah, namun juga mengolok-olok orang yang taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sehingga takutlah kalian agar nanti tidak ada orang yang mengatakan: “Alangkah besar penyesalanku atas kelalaianku dalam menjalankan kewajiban dari Allah untuk menjalankan ketaatan. Sungguh aku telah menjadi golongan yang mengolok-olok Agama Allah ketika di dunia. Huruf ‘ala berfungsi menunjukkan bahwa kalimat sesudahnya merupakan sebab dari kalimat sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Supaya (tidak) ada orang yang berkata} agar tidak ada yang berkata {“Alangkah meruginya aku} betapa menyesalnya aku {atas kelalaianku} kesempitan dan keterbatasanku {dalam menunaikan kewajiban terhadap Allah} taat kepada Allah dan memenuhi hak-hakNya {dan sesungguhnya aku benar-benar termasuk orang-orang yang mengolok-olok} orang-orang yang mengolok-olok agama, kitab, dan utusan Allah serta orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Kemudian Allah mewanti-wanti mereka “supaya” mereka jangan berlanjut dalam kelalaian hingga datang kepada mereka suatu hari di mana mereka menyesal, sedangkan penyesalan sudah tidak berguna lagi, dan “jangan ada orang yang mengatakan, ‘Amat besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah’,” maksudnya, terhadap pihakNya. “Sedang aku sungguh-sungguh” di dunia “termasuk orang-orang yang memperolok-olokkan” adanya pembalasan, hingga saat ini aku melihatnya langsung dengan mata kepala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 56: Maka bersegeralah kalian sebelum tiba waktunya (seseorang mengatakan, \"Alangkah menyesalnya aku) lafal Yaa Hasrataa pada asalnya adalah Yaa Hasratii, artinya amat menyesallah aku (atas kelalaianku terhadap Allah) yaitu karena tidak taat kepada-Nya (dan sesungguhnya) lafal In adalah bentuk Takhfif dari Inna, asalnya Innii yakni sesungguhnya aku (aku adalah termasuk orang-orang yang benar-benar memperolok-olokan\") agama-Nya dan Kitab-Nya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian Allah Subhaanahu wa Ta'aala memberikan peringatan. Ketika tiba hari penyesalan mereka, namun ketika itu penyesalan tidak berguna, yaitu hari Kiamat. Atau maksudnya memperolok-olokkan pembalasan dan sekarang aku melihatnya dengan mata kepala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 56",
    "description": "56-58. Setelah pada ayat yang lalu dijelaskan agar jangan berputus asa dari rahmat Allah dan seruan agar nabi Muhammad memberi peringatan agar mengikuti ajaran Al-Qur'an, pada ayat-ayat berikut dijelaskan tujuan peringatan itu disampaikan. Tujuannya adalah agar jangan ada orang yang mengatakan ketika siksaan tersebut datang, 'alangkah besar penyesalanku atas kelalaian dan kelengahan-ku dalam menunaikan kewajiban terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan agama Allah, ' atau agar jangan ada lagi yang akan berkata dengan penuh penyesalan, 'sekiranya Allah memberi aku petunjuk dan kepadaku dibentangkan jalan yang lurus, tentulah aku termasuk ke dalam kelompok orang-orang yang bertakwa, ' atau agar jangan ada lagi orang yang mengalami penyesalan yang sama sehingga dia berkata ketika melihat azab di hari kemudian, 'sekiranya aku dapat kembali ke dunia, tentu aku akan termasuk ke dalam kelompok orang-orang yang berbuat baik. '56-58"
  }
]