[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau jiwa akan berkata, “Andai saja Allah membimbingku kepada agamaNya, niscaya aku termasuk orang-orang yang menjauhi syirik dan kekafiran.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Atau berdalil kepada takdir dengan berkata, “Seandainya Allah membimbingku, niscaya aku termasuk orang-orang yang bertakwa kepada-Nya, melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-59. Atau orang yang banyak berdosa itu berkata: “Seandainya Allah memberiku petunjuk kepada agama Islam, pasti aku menjadi orang yang bertakwa kepada-Nya dengan mentaati perintah-Nya dan menjauhi larangan-Nya.” Atau berkata ketika dia menyaksikan azab: “Andai saja aku dapat kembali ke dunia, agar aku dapat termasuk orang yang baik dalam perkataan dan perbuatannya.” Sungguh, telah datang kepadamu ayat-ayat-Ku, baik itu ayat qur’aniyah maupun kauniyah; akan tetapi kamu mendustakannya dan enggan mengimaninya. Dahulu kamu termasuk orang-orang yang mendustakan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. أَوْ تَقُولَ لَوْ أَنَّ اللهَ هَدَىٰنِى لَكُنتُ مِنَ الْمُتَّقِينَ (atau supaya jangan ada yang berkata: ‘Kalau sekiranya Allah memberi petunjuk kepadaku tentulah aku termasuk orang-orang yang bertakwa’) Yakni seandainya Allah memberiku petunjuk kepada agama-Nya niscaya aku dahulu adalah orang yang menjauhi kemusyrikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Atau agar jangan sampai ada yang berkata: “Sekiranya Allah menuntun dan menujukkanku kepada agama-Nya, tentu aku termasuk orang yang tidak berbuat kesyirikan dan kemaksiatan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau ada yang berkata,“Seandainya Allah memberi petunjuk kepadaku} membimbingku menuju agamaNya {sungguh aku termasuk orang-orang yang bertakwa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Atau supaya jangan ada yang berkata, ‘Kalau sekiranya Allah memberi petunjuk kepadaku, tentulah aku termasuk orang-orang yang bertakwa’.” Ungkapan “kalau sekiranya” pada ayat ini bermakna “angan-angan.” Maksudnya, kalau seandainya Allah memberiku petunjuk, maka tentu aku menjadi seorang yang bertkawa kepadaNya sehingga aku selamat dari siksa dan berhak mendapat pahala. Jadi, disini bukan kata syarat, sebab kalau sekiranya bermakna syarat tentu mereka akan beralasan (berargumen) dengan Qadha dan Qadar atas kesesatan mereka; dan itu adalah hujjah (argument) yang palsu, dan semua argument palsu pada Hari Kiamat nanti akan lenyap (tidak berguna)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 57: (Atau datang saatnya seseorang berkata, \"Kalau sekiranya Allah memberi petunjuk kepadaku) untuk mengerjakan ketaatan sehingga aku mendapat petunjuk (tentulah aku termasuk orang-orang yang bertakwa\") yakni orang-orang yang takut akan azab-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Lau” (sekiranya) di ayat ini adalah lit tamanniy (untuk angan-angan atau harapan yang tidak mungkin tercapai), sehingga maksudnya, “Seandainya Allah memberiku hidayah, lalu aku bertakwa kepada-Nya, sehingga aku selamat dari siksa dan berhak memperoleh pahala.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 57",
    "description": "56-58. Setelah pada ayat yang lalu dijelaskan agar jangan berputus asa dari rahmat Allah dan seruan agar nabi Muhammad memberi peringatan agar mengikuti ajaran Al-Qur'an, pada ayat-ayat berikut dijelaskan tujuan peringatan itu disampaikan. Tujuannya adalah agar jangan ada orang yang mengatakan ketika siksaan tersebut datang, 'alangkah besar penyesalanku atas kelalaian dan kelengahan-ku dalam menunaikan kewajiban terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan agama Allah, ' atau agar jangan ada lagi yang akan berkata dengan penuh penyesalan, 'sekiranya Allah memberi aku petunjuk dan kepadaku dibentangkan jalan yang lurus, tentulah aku termasuk ke dalam kelompok orang-orang yang bertakwa, ' atau agar jangan ada lagi orang yang mengalami penyesalan yang sama sehingga dia berkata ketika melihat azab di hari kemudian, 'sekiranya aku dapat kembali ke dunia, tentu aku akan termasuk ke dalam kelompok orang-orang yang berbuat baik. '56-58"
  }
]