[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau jiwa yang akan berkata saat melihat azab Allah telah mengepungnya di Hari Pembalasan, “Seandainya aku memiliki kesempatan untuk kembali ke dunia, sehingga di sana aku termasuk di antara orang-orang yang berbuat baik dengan menaati Tuhan mereka dan melaksanakan apa yang diperintahkan oleh para Rasul kepada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Aku berangan-angan saat melihat azab, “Seandainya aku punya kesempatan untuk kembali ke dunia maka aku akan bertobat kepada Allah dan aku akan menjadi orang baik dalam melakukan amalannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِى كَرَّةً (Atau supaya jangan ada yang berkata ketika ia melihat azab ‘Kalau sekiranya aku dapat kembali) Yakni kembali ke dunia. فَأَكُونَ مِنَ الْمُحْسِنِينَ(niscaya aku akan termasuk orang-orang berbuat baik’) Yakni termasuk orang-orang yang beriman kepada Allah dan mengesakan-Nya dan orang-orang yang berbuat baik dalam amalannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Atau jangan juga ketika melihat azab ada yang berkata: “Sekiranya aku bisa kembali ke dunia, tentu aku akan menjadi orang yang baik dalam perkataan maupun perbuatan, juga baik dalam keimanan dan melaksanakan kewajiban.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau ada yang berkata ketika melihat azab,“Seandainya aku dapat kembali} kembali ke dunia {maka aku termasuk orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “Atau supaya jangan ada yang berkata ketika ia melihat azab” dan memastikan kedatangannya, “Kalau sekiranya aku dapat kembali,” maksudnya, kembali ke dunia, niscaya aku “akan termasuk orang-orang yang berbuat baik.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 58: (Atau datang saatnya seseorang berkata ketika ia melihat azab, \"Kalau sekiranya aku dapat kembali) ke dunia (niscaya aku akan termasuk orang-orang yang berbuat baik.\") yakni, orang-orang yang beriman. Maka, dikatakan kepada mereka oleh Allah swt.:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman, “Dan Allah sekali-kali tidak akan menangguhkan (kematian) seseorang apabila telah datang waktu kematiannya. Dan Allah Maha Mengenal apa yang kamu kerjakan.” (Terj. Al Munaafiquun: 11)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 58",
    "description": "56-58. Setelah pada ayat yang lalu dijelaskan agar jangan berputus asa dari rahmat Allah dan seruan agar nabi Muhammad memberi peringatan agar mengikuti ajaran Al-Qur'an, pada ayat-ayat berikut dijelaskan tujuan peringatan itu disampaikan. Tujuannya adalah agar jangan ada orang yang mengatakan ketika siksaan tersebut datang, 'alangkah besar penyesalanku atas kelalaian dan kelengahan-ku dalam menunaikan kewajiban terhadap Allah, dan sesungguhnya aku termasuk orang-orang yang memperolok-olokkan agama Allah, ' atau agar jangan ada lagi yang akan berkata dengan penuh penyesalan, 'sekiranya Allah memberi aku petunjuk dan kepadaku dibentangkan jalan yang lurus, tentulah aku termasuk ke dalam kelompok orang-orang yang bertakwa, ' atau agar jangan ada lagi orang yang mengalami penyesalan yang sama sehingga dia berkata ketika melihat azab di hari kemudian, 'sekiranya aku dapat kembali ke dunia, tentu aku akan termasuk ke dalam kelompok orang-orang yang berbuat baik. '59. Untuk menghindari penyesalan itulah, Allah memberi peringatan kepada manusia. Sungguh, sebenarnya kalau kalian mau mendengarkan keterangan-keterangan-ku yang telah datang kepadamu yang dibawa oleh para nabi dan rasul, kalian tidak akan menyesal di hari kemudian. Akan tetapi, kamu mendustakannya, malah kamu menyombongkan diri dan termasuk orang kafir dan durhaka."
  }
]