[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkaranya tidak sebagaimana yang kamu katakan, sungguh ayat-ayatKu yang jelas yang menunjukkan kepada kebenaran telah datang kepadamu, tetapi kamu mendustakannya, kamu menyombongkan diri sehingga tidak mau menerimanya dan mengikutinya, sebaliknya kamu menolaknya dan kamu termasuk orang-orang yang kafir kepada Allah dan RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Perkaranya bukan sebagaimana yang ia kira berupa angan-angan mendapatkan hidayah, karena ayat-ayat-Ku telah datang kepadamu lalu kamu mendustakan dan menyombongkan diri di depannya, sedangkan kamu termasuk orang-orang kafir kepada Allah, kepada ayat-ayat dan para rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. بَلَىٰ قَدْ جَآءَتْكَ ءَايٰتِى فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنتَ مِنَ الْكٰفِرِينَ ((Bukan demikian) sebenarya telah datang keterangan-keterangan-Ku kepadamu lalu kamu mendustakannya dan kamu menyombongkan diri dan adalah kamu termasuk orang-orang yang kafir”) Yang dimaksud adalah datangnya ayat-ayat al-Qur’an. Padahal kamu dahulu mampu untuk menerima dan mengikutinya, maka kenapa kamu sekarang meminta untuk kembali ke dunia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Sungguh keterangan-keterangan-Ku benar-benar telah sampai kepadamu, namun engkau mengingkarinya bahwa itu dari-Ku. Justru engkau menyombongkan diri untuk tidak mengimaninya. Engkau termasuk orang yang mengingkari Allah dan rasul-Nya. Bala adalah huruf yang menunnjukkan pembantahan atas suatu pernyataan sebelumnya, yaitu klaim bahwa Allah tidak memberi petunjuk dan bimbingan kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak begitu. Sungguh ayat-ayatKu telah datang kepada kalian, lalu kalian mendustakannya, menyombongkan diri, dan termasuk orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Allah berfirman bahwa yang demikian itu sangat tidak mungkin dan tidak berguna, dan bahwa semua itu adalah angan-anagan palsu yang tidak punya hakikat, sebab tidak aka nada perubahan bagi sang hamba kalau dia dikembalikan untuk mendapat penjelasan sesudah sesudah penjelasan yang pertama. “Sebenarnya telah datang ayat-ayatKu kepadamu” yang menunjukkan dengan petunjuk yang tidak bisa diragukan lagi kepada kebenaran, “lalu kamu mendustakannya dan kamu menyombongkan diri” untuk mengikutinya, “dan kamu adalah termasuk orang-orang yang kafir.” Jadi, permintaan dikembalikan ke dunia adalah satu bentuk perbuatan sia-sia, sebab kalaupun mereka dikembalikan, pasti mereka kembali lagi melakukan apa-apa yang dilarang, dan sesungguhnya mereka adalah orang-orang pendusta."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 59: (\"Benar, sesungguhnya telah datang ayat-ayat-Ku kepadamu) yakni, Alquran yang dapat memberikan hidayah kepadamu (lalu kamu mendustakannya dan kamu menyombongkan diri) yaitu tidak mau beriman kepada ayat-ayat-Ku (dan adalah kamu termasuk orang-orang yang kafir.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu dikatakan kepadanya. Yakni Al Qur’an yang merupakan sebab hidayah. Dari beriman kepadanya. Oleh karena itu, permintaan untuk kembali ke dunia adalah bentuk main-main, dan kalau seandainya mereka dikembalikan ke dunia tentu mereka akan mengulangi perbuatan yang dilarang kepada mereka dan mereka benar-benar dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 59",
    "description": "Untuk menghindari penyesalan itulah, Allah memberi peringatan kepada manusia. Sungguh, sebenarnya kalau kalian mau mendengarkan keterangan-keterangan-ku yang telah datang kepadamu yang dibawa oleh para nabi dan rasul, kalian tidak akan menyesal di hari kemudian. Akan tetapi, kamu mendustakannya, malah kamu menyombongkan diri dan termasuk orang kafir dan durhaka. 60. Dan kelak pada hari kiamat, engkau wahai nabi Muhammad atau siapa pun, akan melihat bagaimana nasib orang-orang yang berbuat dusta terhadap Allah, wajahnya akan terlihat menghitam. Bukankah sudah sejak awal diberitahukan bahwa neraka jahanam itu adalah tempat tinggal yang sengaja disediakan bagi orang yang menyombongkan diri'."
  }
]