[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan kalian telah menciptakan kalian (wahai manusia) dari Adam, dan darinya Allah menciptakan istrinya, dan Dia juga menciptakan delapan jenis hewan-hewan ternak, yaitu jantan dan betina dari unta, sapi, kambing, dan domba. Allah menciptakan kalian dalam rahim ibu kalian fase demi fase dalam kegelapan perut, Rahim dan selaput yang menutupi kalian dalam Rahim. Itulah Allah yang menciptakan semua ini, tuhan kalian pemilik tunggal segala kerajaan, yang diesakan dengan ibadah dan yang berhak untuk disembah semata, maka bagaimana kalian berpaling dari penyembahan kepadanya kepada selainNya dari makhlukNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Tuhan kalian -wahai manusia- menciptakan kalian dari satu jiwa, yaitu Adam, kemudian Dia menciptakan dari Adam pasangannya Hawa. Allah menciptakan untuk kalian dari unta, sapi, kambing, domba delapan macam, dari setiap macamnya Allah menciptakan jantan dan betina. Allah -Subḥānahu- menumbuhkan kalian di dalam rahim ibu kalian fase demi fase dalam kegelapan perut, rahim dan selaput ari. Yang menciptakan semua itu adalah Allah Rabb kalian, hanya bagi-Nya semata kerajaan, tidak ada sesembahan yang hak selain Dia. Bagaimana kalian dipalingkan dari ibadah kepada Allah beralih menuju ibadah pada selain Allah yang tidak menciptakan sesuatu pun dan justru mereka yang diciptakan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Manusia, Allah menciptakan kalian dari Adam, dan menciptakan istri Adam darinya. Dan Allah menciptakan bagi kalian delapan hewan ternak yang berpasangan; unta, sapi, domba, dan kambing. Dia juga menciptakan kalian dalam perut ibu kalian melalui beberapa fase dalam tiga kegelapan; gelapnya perut, gelapnya rahim, dan gelapnya plasenta. Demikianlah Allah menciptakan makhluk-makhluk dalam kegelapan-kegelapan itu; Dialah Allah, Tuhan Yang Esa dalam kekuasaan dan ketuhanan, satu-satunya yang berhak disembah. Mengapa kalian berpaling dari peribadatan kepada-Nya dan menjadikan peribadatan itu bagi selain-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. خَلَقَكُم مِّن نَّفْسٍ وٰحِدَةٍ (Dia menciptakan kamu dari seorang diri) Yaitu dari diri Adam. ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا(kemudian Dia jadikan daripadanya isterinya) Allah menciptakan Hawa dari tulang rusuk Adam, dan Allah tidak menciptakan wanita dari tulang rusuk laki-laki selain Hawa. Tafsir ayat ini telah dijelaskan sebelumnya pada bagian akhir surat al-A’raf. وَأَنزَلَ لَكُم مِّنَ الْأَنْعٰمِ ثَمٰنِيَةَ أَزْوٰجٍ ۚ( dan Dia menurunkan untuk kamu delapan ekor yang berpasangan dari binatang ternak) Binatang-binatang ini adalah yang disebutkan dalam firman-Nya: مِّنَ ٱلضَّأْنِ ٱثْنَيْنِ وَمِنَ ٱلْمَعْزِ ٱثْنَيْ sepasang domba, sepasang dari kambing.” (Al-An'am:143) وَمِنَ ٱلْإِبِلِ ٱثْنَيْنِ وَمِنَ ٱلْبَقَرِ ٱثْنَيْ “dan sepasang dari unta dan sepasang dari lembu.” (Al-An'am:144) يَخْلُقُكُمْ فِى بُطُونِ أُمَّهٰتِكُمْ خَلْقًا مِّنۢ بَعْدِ خَلْقٍ(Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian) Yakni dari air mani kemudian segumpal darah, kemudian segumpal daging, kemudian tulang belulang, kemudian daging. فِى ظُلُمٰتٍ ثَلٰثٍ ۚ( dalam tiga kegelapan) Yakni dalam gelapnya perut, gelapnya rahim, dan gelapnya plasenta. Dan tempat yang gelap itu tidak menghalangi Kami untuk mengindahkan ciptaannya. لَهُ الْمُلْكُ ۖ (Tuhan Yang mempunyai kerajaan) Yakni kerajaan sesungguhnya di dunia dan di akhirat, tidak ada sekutu bagi-Nya dalam kerajaan itu. فَأَنَّىٰ تُصْرَفُونَ(maka bagaimana kamu dapat dipalingkan?) Yakni kemana setan akan memalingkan kalian dari beribadah kepada Allah, sehingga kalian menyembah selain-Nya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Allah menciptakan kalian wahai manusia, dari satu penciptaan yaitu Nabi Adam, kemudian Allah ciptakan Hawa, lalu keturunan manusia lahir dari keduanya. Dan Allah menciptakan binatang ternak dari 8 macam yaitu; unta, sapi, domba, kambing, laki-laki dan perempuan, yang diciptakan dari rahim ibu (mereka) dengan penciptaan yang runtut, dari setitik darah sampai segumpal darah. Sampai segumpal daging sampai menjadi tulang yang dibungkus daging. Proses penciptaan yang tiga: alam (gelap) ari-ari/plasenta, alam rahim dan alam perut. Dan menurut ahli medis: janin meliputi tiga kehidupan didalam rahim, maka tiga alam kegelapan itu tidak menghalangi indahnya ciptaan Allah. Dan yang menciptakan yang demikian itu Dialah Allah Tuhan kamu sekalian, bagiNya kerajaan yang mutlak di dunia dan di akhirat, tiada Tuhan yang berhak disembah selain Allah SWT, lalu bagaimana setan bisa menceraiberaikan kamu sekalian dan kalian adil untuk beribadah pada Sang Pencipta untuk menyembah selainNya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan kalian dari jiwa yang satu} Adam AS {kemudian dari jiwa itu, Dia menjadikan} menciptakan {pasangannya dan Dia menurunkan} dan menciptakan {delapan pasang hewan ternak untuk kalian. Dia menciptakan kalian dalam perut ibu kalian kejadian demi kejadian} langkah demi langkah, yaitu air mani, lalu segumpal darah, kemudian segumpal daging {dalam tiga kegelapan} dalam kegelapan perut, rahim, dan ari-ari {Yang (berbuat) demikian itu adalah Allah, Tuhan kalian yang memiliki kerajaan. Tidak ada tuhan selain Dia. Mengapa kalian dipalingkan} maka bagaimana bisa kalian berpaling dari menyembahnya menjadi menyembah selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Dan di antara keperkasaanNya adalah “Dia menciptakan kamu dari seorang diri,” dengan jumlah kalian yang banyak dan tersebar luasnya kalian di berbagai penjuru bumi, “kemudian Dia jadikan darinya istrinya.” Yang demikian itu agar ia merasakan ketentraman pada istrinya, dan istri merasakan ketentraman pada suaminya dan terjadilah kenikmatan dengan cara yang demikian itu. “Dan Dia menurunkan untuk kamu dari binatang ternak,” maksudnya, Dia menciptakannya dengan ketentuan yang datang dariNya sebagai rahmat (kasih sayang) kepada kalian “delapan ekor yang berpasangan.” Ini adalah yang disebutkan di dalam Surat al-An’am: delapan pasangan, dari domba dua, dari kambing dua, dari unta dua, dan dari sapi dua. Hanya ini saja yang disebutkan di sini, padahal banyak binatang-binatang ternak lainnya yang Dia ciptakan untuk kemaslahatan hamba-hambaNya, hal itu karena banyaknya manfaatnya, luasnya kemaslahatannya, karena kemuliaannya dan karena keistimewaan-keistimewaan yang dimilikinya yang tidak ada pada yang lainnya, seperti untuk keperluan kurban, membayar hadyu (tebusan haji), aqiqah, kewajiban zakat padanya dan khusus untuk membayar diyat (tebusan pembunuhan). Setelah Allah menjelaskan penciptaan bapak dan ibu moyang kita yang pertama, maka Dia menjelaskan permulaan proses penciptaan kita, seraya berfirman, “Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian,” yakni, dari satu fase ke fase lainnya, dan kalian dalam kondisi tidak ada tangan makhluk yang menyentuh kalian, tidak ada pula mata yang melihat kalian, dan Dia telah memproses (membesarkan) kalian dalam tempat yang sempit itu, “dalam tiga kegelapan,” kegelapan perut, kegelapan Rahim, dan kegelapan ketuban. “Yang demikian itu” yakni, Yang menciptakan langit dan bumi, yang menundukkan matahari dan bulan, menciptakan kalian dan menciptakan untuk kalian binatang ternak dan segala nikmat, “adalah Allah, Rabb kamu.” Maksudnya, sembahan yang dipuja yang telah menumbuhkah dan mengatur kalian. Maka sebagaimana DIa Esa dalam menciptakan dan mengelola (mengatur)nya, tiada sekutu bagiNya dalam semua itu, maka Dia juga Maha Esa dalam uluhiyahNya, tiada sekutu bagiNYa. Maka dari itu Dia berfirman, “Tidak ada sembahan yang haq melainkan Dia; maka bagaimana kamu dapat dipalingkan,” setelah penjelasan di atas, yaitu penjelasan bahwa Allah lah yang berhak untuk dimurnikan dari penyembahan kepada berhala yang sama sekali tidak mengatur apa pun dan sama sekali tidak memiliki wewenang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 6: (Dia menciptakan langit dan bumi dengan -tujuan- yang benar) lafal Bilhaqqi berta'alluq kepada lafal Khalaqa (Dia menutupkan) yakni memasukkan (malam atas siang) sehingga waktu malam bertambah. (dan menutupkan siang) memasukkannya (atas malam) sehingga waktu siang bertambah (dan Dia menundukkan matahari dan bulan, masing-masing berjalan) pada garis edarnya (hingga waktu yang ditentukan) yakni hari kiamat. (Ingatlah Dialah Yang Maha Perkasa) Yang Maha Menang atas semua perkara-Nya dan Yang Maha Membalas terhadap musuh-musuh-Nya (lagi Maha Pengampun) kepada kekasih-kekasih-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk keperkasaan-Nya pula. Wahai semua manusia. Yaitu Hawa dari tulang rusuk Adam, agar Beliau (Adam) merasa tenteram dan tenang dengannya, dan kenikmatan pun menjadi sempurna dengannya. Yaitu unta, sapi, kambing dan domba, masing-masing ada jantan dan ada betina. Disebutkan hewan ternak secara khusus padahal Dia telah menurunkan berbagai maslahat untuk hamba-hamba-Nya baik berupa hewan maupun lainnya karena banyak manfaat hewan ternak itu, meratanya maslahatnya, dan karena keutamaannya. Di samping itu, hewan ternak itu (unta, sapi dan kambing) dikhususkan dengan hal-hal tertentu, seperti untuk kurban, hadyu, aqiqah, terkena zakat, dan dalam hal diat (denda). Setelah Dia menyebutkan tentang penciptaan nenek moyang kita (Adam dan Hawa), maka Dia menyebutkan awal penciptaan kita. Yaitu dari mani menjadi segumpal darah, lalu menjadi segumpal daging. Ketika itu tidak ada tangan manusia yang menyentuh dan tidak ada mata mereka yang melihat, Dia yang mengurus kamu di tempat yang sempit itu. Tiga kegelapan itu ialah kegelapan dalam perut, kegelapan dalam rahim, dan kegelapan dalam selaput yang menutup anak dalam rahim. Yakni yang telah menciptakan langit dan bumi, dan telah menundukkan matahari dan bulan, demikian pula telah menciptakan kamu dan menciptakan hewan ternak serta berbagai kenikmatan untukmu. Oleh karena tidak ada sekutu dalam rububiyyah-Nya (Dia sendiri yang mengatur alam semesta), maka tidak ada sekutu pula dalam uluhiyyah-Nya (Dia saja yang berhak diibadahi). Dari beribadah hanya kepada-Nya menuju beribadah kepada selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 6",
    "description": "Wahai manusia, dia menciptakan kamu dari diri yang satu, yaitu nabi adam, kemudian darinya dia jadikan hawa sebagai pasangannya sehingga dari keduanya lahirlah beberapa keturunan laki-laki maupun perempuan. (lihat pula: surah an-nis'/4: 1). Dan dia menurunkan pula delapan pasang hewan ternak untukmu, yakni sepasang unta, sapi, domba, dan kambing (lihat pula: surah al-an''m/6: 143'144). Dia menjadikan kamu dalam perut ibumu kejadian demi kejadian secara bertahap dari setetes mani menjadi segumpal darah, segumpal daging, kemudian tumbuh menjadi janin. Janin itu berada dalam tiga kegelapan, yaitu kegelapan dalam perut, kegelapan dalam rahim, dan kegelapan dalam selaput penutup janin dalam rahim. Yang berbuat demikian itu adalah Allah, pencipta manusia dan alam semesta. Dialah tuhan kamu, tuhan yang memiliki kerajaan dan menguasai langit dan bumi. Tidak ada tuhan yang pantas disembah selain dia; maka mengapa kamu dapat dipalingkan oleh setan untuk menyembah selain dia yang telah menciptakanmu'7. Allah mahakuasa; dialah yang menguasai kerajaan langit dan bumi. Jadi, jika kamu tetap kafir maka ketahuilah bahwa sesungguhnya Allah mahakaya dan tidak memerlukanmu sehingga dia tidak akan rugi sedikit pun meski kamu ingkar. Dan dia, karena kasih sayangnya, tidak meridai kekafiran hamba-hamba-Nya karena dia tidak ingin mereka merugikan diri sendiri. Jika kamu bersyukur dengan cara beribadah kepada-Nya dan menaati-Nya, dia meridai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain karena masing-masing bertanggung jawab atas perbuatannya sendiri. Kemudian, kepada tuhanmulah tempat kembalimu di akhirat nanti untuk dihisab, lalu dia beritakan kepadamu balasan yang layak untukmu atas apa yang telah kamu kerjakan di dunia. Sungguh, dia maha mengetahui apa saja yang tersimpan dalam dada dan tebersit dalam hati."
  }
]