[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di Hari Kiamat, kamu akan melihat orang-orang yang mendustakan, yang mengatakan sesuatu tentang Tuhan mereka yang tidak patut dengan keagunganNya dan menisbatkan sekutu dan anak kepadaNya, wajah-wajah mereka menghitam. Bukankah Jahanam adalah tempat kembali dan tempat tinggal bagi siapa yang menyombongkan diri terhadap Allah sehingga dia tidak berkenan untuk mentauhidkan dan menaatiNya? Benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Pada hari Kiamat kamu menyaksikan orang-orang yang berdusta atas nama Allah dengan menisbahkan sekutu dan anak kepada-Nya, wajah mereka menghitam sebagai tanda kesengsaraan mereka. Bukankah Jahanam adalah tempat tinggal bagi orang-orang yang sombong terhadap iman kepada Allah dan para rasul-Nya? Benar, sesungguhnya ia adalah tempat tinggal mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Pada hari kiamat kamu akan menyaksikan orang-orang yang mendustakan Allah dalam hukum-hukum dan keimanan kepada-Nya, wajah mereka akan menjadi hitam. Bukanlah neraka Jahannam merupakan tempat tinggal bagi orang-orang yang mendustakan kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَيَوْمَ الْقِيٰمَةِ تَرَى الَّذِينَ كَذَبُوا۟ عَلَى اللهِ (Dan pada hari kiamat kamu akan melihat orang-orang yang berbuat dusta terhadap Allah) Ketika mereka mengatakan bahwa Allah memiliki sekutu, pasangan, dan anak. وُجُوهُهُم مُّسْوَدَّةٌ ۚ( mukanya menjadi hitam) Ketika mereka dikepung oleh azab dan menyaksikannya, akibat kemurkaan Allah kepada mereka. أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِينَ (Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang menyombongkan diri?) Yakni di neraka Jahannam terdapat tempat tinggal bagi orang-orang yang enggan dan menyombongkan diri terhadap ketaatan kepada Allah. Dan sifat sombong adalah menolak kebenaran serta merendahkan orang lain, sebagaimana disebutkan dalam hadits shahih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Pada hari kiamat engkau akan menyaksikan orang-orang yang telah mendustakan Allah dengan kesyirikan, persekutuan dan menganggap Allah mempunyai putera akan menghitam wajah mereka sebab kemurkaaan Allah. Bukankah neraka Jahannam itu adalah tempat tinggal bagi orang-orang yang menyombongkan diri kepada Allah? Juga tempat bagi mereka yang enggan untuk menjalankan ketaatan dan mengesakan Allah? Kata alaisa menunjukkan bahwa Jahannam memanglah merupakan suatu tempat atau kediaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari kiamat, kamu akan melihat bahwa orang-orang yang berdusta kepada Allah, wajahnya menghitam. Bukankah neraka Jahanam itu tempat tinggal} tempat tinggal dan menetap {bagi orang-orang yang sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Allah mengabarkan tentang kehinaan, “orang-orang yang berbuat dusta” terhadapNya, dan bahwasanya, wajah mereka pada Hari KIamat, “menjadi hitam” seakan-akan malam yang gelap gempita, mereka dikenali oleh semua manusia di padang mahsyar dengan ciri tersebut. Sesungguhnya kebenaran itu terang benderang seperti pagi hari. Dan karena mereka telah menghitamkan wajah kebenaran dengan kedustaan, maka Allah menghitamkan wajah mereka sebagai balasan yang setimpal dengan perbuatan mereka. Mereka memperoleh wajah yang hitam pekat dan juga azab yang dahsyat di dalam Neraka Jahanam. Maka dari itu Allah berfirman, “Bukankah dalam Neraka Jahanam itu ada tempat bagi orang-orang yang menyombongkan diri” terhadap kebenaran dan orang yang berbuat dusta terhadapNya. Jangan sekali-kali demikian, sebab demi Allah, sesungguhnya di dalamnya terdapat siksa,kehinaan, dan kemurkaan yang menimpa orang-orang yang menyombongkan diri dari segala sisinya, dan hak diambil dari mereka dengan kedua siksa itu . Kedustaan terhadap Allah mencakup kedustaan terhadapNya dengan menjadikan sekutu, anak dan istri bagiNYa, menginformasikan tentang Allah dengan informasi-informasi yang sangat tidak layak bagi kebesaranNya, atau mengklaim menjadi nabi, atau mengatakan sesuatu tentang syariatNya yang tidak pernah dikatakanNya dan menginformasikan bahwasanya Allah telah mengatakannya dan mensyariatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 60: (Dan pada hari kiamat kamu akan melihat orang-orang yang berbuat dusta terhadap Allah) yaitu mereka yang menisbatkan sekutu dan anak kepada-Nya (mukanya menjadi hitam. Bukankah dalam neraka Jahanam itu ada tempat) yakni tempat tinggal (bagi orang-orang yang menyombongkan diri?) artinya, tidak mau beriman; memang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kehinaan orang-orang yang berdusta terhadap-Nya, dan bahwa wajah-wajah mereka pada hari Kiamat akan hitam seperti malam yang kelam, di mana orang-orang yang berada di mauqif (padang mahsyar) mengetahui mereka. Kebenaran adalah sesuatu yang terang, tetapi karena mereka menghitamkan wajah kebenaran dengan kedustaan, maka Allah menghitamkan wajah mereka sebagai balasan yang sesuai dengan amal yang mereka kerjakan. Mereka memperoleh wajah yang hitam dan azab yang keras di neraka Jahanam. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Bukankah neraka Jahannam itu tempat bagi orang yang menyombongkan diri?” Di sana terdapat azab, penghinaan dan kemurkaan yang besar untuk orang-orang yang sombong dan akan diambil hak dari mereka yang ketika di dunia mereka tidak penuhi. Seperti menisbatkan sekutu, anak, istri kepada-Nya, memberitahukan tentang Dia dengan sesuatu yang tidak layak bagi-Nya, mengaku menjadi nabi, berkata dalam syariat-Nya sesuatu yang tidak dikatakan-Nya, memberitahukan bahwa Dia berfirman ini dan itu atau menetapkan syariat ini dan itu padahal tidak demikian. Yakni sombong terhadap kebenaran, sombong dari beribadah kepada Tuhannya lagi berdusta terhadap-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 60",
    "description": "Dan kelak pada hari kiamat, engkau wahai nabi Muhammad atau siapa pun, akan melihat bagaimana nasib orang-orang yang berbuat dusta terhadap Allah, wajahnya akan terlihat menghitam. Bukankah sudah sejak awal diberitahukan bahwa neraka jahanam itu adalah tempat tinggal yang sengaja disediakan bagi orang yang menyombongkan diri'61. Dan pada hari itu Allah menyelamatkan orang-orang yang bertakwa karena kemenangan dan keberhasilan mereka. Hal itu mereka peroleh karena telah mengikuti petunjuk Allah. Mereka tidak disentuh sedikit pun oleh azab dan mereka pun tidak pula bersedih hati."
  }
]