[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menyelamatkan dari Jahanam dan siksanya orang-orang yang bertakwa kepada Tuhan mereka dengan menjalankan apa-apa yang Dia wajibkan dan menjauhi apa-apa yang Dia larang. Mereka beruntung karena harapan mereka terwujud, yaitu harapan meraih surga, di sana mereka tidak tersentuh azab Jahanam sedikit pun, mereka juga tidak bersedih atas kenikmatan-kenikmatan dunia yang luput dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan Allah menyelamatkan orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya dari azab dengan memasukkan mereka ke tempat kemenangan, yaitu Surga. Azab tidak menyentuh mereka, dan mereka juga tidak bersedih karena tidak mendapatkan kenikmatan dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Dan Allah menyelamatkan dari neraka Jahannam, orang-orang yang mentaati-Nya dan menjauhi larangan-larangan-Nya, dengan keberuntungan mereka mendapatkan surga. Mereka tidak mendapatkan keburukan tidak pula bersedih akibat kenikmatan dunia yang tidak dapat mereka rasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَيُنَجِّى اللهُ الَّذِينَ اتَّقَوْا۟ (Dan Allah menyelamatkan orang-orang yang bertakwa) Yakni orang-orang yang menjauhi kemusyrikan dan kemaksiatan. بِمَفَازَتِهِمْ (karena kemenangan mereka) Allah menyelamatkan mereka dengan kemenangan mereka, yaitu dengan keselamatan mereka dari neraka dan kemenangan mereka dalam meraih surga. لَا يَمَسُّهُمُ السُّوٓءُ وَلَا هُمْ يَحْزَنُونَ (mereka tiada disentuh oleh azab (neraka dan tidak pula) mereka berduka cita) Yakni Allah menjauhkan mereka dari keburukan dan kesedihan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Allah akan menyelamatkan orang-orang yang senantiasa takut kepada Tuhannya, kemudian menjalankan kewajiban, meninggalkan kesyirikan dan kemaksiatan dari azab Jahannam. Allah akan menjadikan mereka termasuk orang yang beruntung mendapatkan surga. Mereka tidak ditimpa kesulitan, mereka juga tidak bersedih atas dunia mereka yang telah hilang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka} karena kemenangan mereka berupa surga {sehingga mereka tidak disentuh} tidak ditimpa {oleh azab} azab {dan mereka tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Setelah Allah menjelaskan kondisi orang-orang yang menyombongkan diri, Allah kemudian menjelaskan kondisi orang-orang yang bertakwa, seraya berfirman, “Dan Allah menyelamatkan orang-orang yang bertakwa karena kemenangan mereka,” maksudnya, karena keselamatan mereka. Hal itu terjadi karena mereka mempunyai alat (bekal) keselamatan, yaitu takwa kepada Allah, yang merupakan perbekalan dalam setiap kondisi susah dan kesempitan, yaitu “mereka tidak akan disentuh oleh keburukan,” maksudnya, oleh azab yang berakibat buruk bagi mereka, “dan tidak pula mereka berduka cita.” Dengan demikian Allah menafikan sentuhan azab dan rasa takut dari mereka. Ini adalah puncak rasa damai. Mereka memperoleh rasa aman yang sempurna yang selalu menyertai mereka hingga mengantarkan mereka ke Darus Salam (negeri kedamaian), maka pada saat mereka benar-benar aman dari segala keburukan dan segala yang tidak dikehendaki, mereka selalu diliputi oleh berbagai kenikmatan dan mereka mengatakan, \"Segala puji bagi Allah yang telah menghilangkan duka cita dari kami. Sesungguhnya Tuhan kami benar-benar Maha Pengampun lagi Maha Mensyukuri.” (Fathir:34)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 61: (Dan Allah menyelamatkan) dari neraka Jahanam (orang-orang yang bertakwa) orang-orang yang memelihara diri dari kemusyrikan (karena kemenangan mereka) karena mereka memperoleh tempat kemenangan, yaitu surga yang menjadi tempat tinggal mereka (mereka tidak disentuh oleh keburukan dan tidak pula mereka berduka cita.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah memberitahukan keadaan orang-orang yang sombong, Dia menyebutkan keadaan orang-orang yang bertakwa. Mafaaz di ayat ini artinya tempat kemenangan, yaitu surga. Maksudnya Allah akan menyelamatkan orang-orang yang bertakwa dengan menjadikan mereka masuk ke surga. Bisa juga kata mafaaz diartikan dengan najaat (keselamatan), yakni Allah Subhaanahu wa Ta'aala menyelamatkan mereka karena bersama mereka ada alat keselamatan, yaitu bertakwa kepada Allah, di mana takwa merupakan bekal menghadapi berbagai peristiwa menegangkan pada hari Kiamat. Allah Subhaanahu wa Ta'aala menafikan dari mereka terkena azab dan rasa takut, sehingga mereka benar-benar aman. Mereka memperoleh keamanan yang selalu menyertai mereka sampai masuk ke tempat keselamatan (surga)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 61",
    "description": "Dan pada hari itu Allah menyelamatkan orang-orang yang bertakwa karena kemenangan dan keberhasilan mereka. Hal itu mereka peroleh karena telah mengikuti petunjuk Allah. Mereka tidak disentuh sedikit pun oleh azab dan mereka pun tidak pula bersedih hati. 62. Pada ayat-ayat yang lalu digambarkan kemahakuasaan Allah menjatuhkan sanksi bagi orang yang durhaka, dan melimpahkan anugerah bagi orang yang taat. Pada ayat-ayat berikut, Al-Qur'an merinci lebih detail tentang kemahakuasaan Allah itu. Allah yang maha esa adalah pencipta segala sesuatu dan hanya dia sajalah, tidak ada yang lain, maha pemelihara atas segala sesuatu itu."
  }
]