[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah Pencipta segala sesuatu seluruhnya, Dia juga Tuhan, Pemilik dan Pengaturnya, Dia Maha Menjaga segala sesuatu, yang mengatur segala urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Allah adalah Pencipta segala sesuatu, tidak ada Pencipta selain Dia. Allah adalah Penjaga segala sesuatu, mengatur segala urusan-Nya, menatanya sesuai kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-63. Allah adalah Pencipta seluruh makhluk dan yang mengaturnya; Dia Pemilik kunci-kunci perbendaharaan tujuh langit dan bumi. Orang-orang yang mendustakan ayat-ayat Allah yang dapat didengar dan disaksikan adalah orang-orang yang jauh dari rahmat Allah; mereka adalah orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. اللهُ خٰلِقُ كُلِّ شَىْءٍ ۖ (Allah menciptakan segala sesuatu) Yakni segala yang ada di dunia dan akhirat, apapun itu tanpa membeda-bedakan. وَهُوَ عَلَىٰ كُلِّ شَىْءٍ وَكِيلٌ (dan Dia memelihara segala sesuatu) Yakni Allah-lah yang menjaga dan mengaturnya tanpa bantuan sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Allah Maha Esa Yang telah menciptakan segala sesuatu yang ada di dunia dan akhirat. Allah juga Yang Maha Menjaga dan Merawat segala ciptaan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah adalah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Allah mengabarkan tentang keagungan dan kesempurnaanNya yang memastikan kerugian siapa saja yang kafir kepadaNya, seraya berfirman, “Allah menciptakan segala sesuatu.” Ungkapan ini dan yang serupa dengannya yang banyak sekali di dalam al-Quran menunjukkan bahwa segala sesuatu, selain Allah, adalah makhluk (diciptakan). Maka di dalamnya terkandung bantahan terhadap orang yang berpendapat (meyakini) qadim (tidak bermula) nya sebagian makhluk, seperti kaum filosuf yang meyakini qadimnya bumi dan langit; dan seperti orang-orang yang meyakini qadimnya ruh dan keyakinan-keyakinan ahlul batil lainnya yang mengandung makna menanggalkan sang Khaliq dari ciptaanNya. Dan kalamullah (Firman Allah) tidak termasuk sesuatu yang diciptakan, sebab kalamullah adalah sifat yang berfirman, sedangkan Allah dengan nama-nama dan sifat-sifatNya Mahaawal yang tidak ada sesuatu apa pun sebelumNYa. Maka, kaum Mu’tazilah yang berargumen dengan ayat ini dan ayat-ayat lainnya (atas keyakinan mereka) bahwa kalamullah itu makhluk adalah merupakan kebodohan yang paling besar, sebab sesungguhnya Allah tetap dan senantiasa dengan nama-nama dan sifat-sifatNYa, Dia tidak pernah menciptakan satu sifat pun dari sifat-sifatNya dan juga tidak pernah tertanggalkan dariNya sesaat pun. Yang menjadi inti dari ini semua adalah bahwasanya Allah telah memberitahu tentang DiriNYa yang mulia bahwasanya Dia adalah Pencipta seluruh alam dan alam bawah, dan bahwa sesungguhnya Dia “memelihara segala sesuatu.” Penjagaan yang sempurna itu harus ada ilmu dari sang Penjaga terhadap segala apa yang diserahkan kepadaNya dan harus menguasai segala perinciannya, dan juga harus ada kuasa (kemampuan) yang sempurna atas apa yang diserahkan kepadaNya, dan harus ada hikmah dan pengetahuan akan cara-cara mengatur untuk mengatur dan mengurusnya menurut apa yang terlaik. Sebab, penjagaan tidak akan bisa terlaksana kecuali dengan adanya itu semua. Maka adanya kekurangan yang sedikit sekalipun dariNya, merupakan kekurangan (kelemahan) di dalam penjagaan tersebut. Dan sudah merupakan hal yang sudah dimaklumi secara pasti bahwasanya Allah Suci dari segala kekurangan dalam sifat-sifatNya. Maka pemberitahuanNya bahwasanya Dia Memelihara segala sesuatu menunjukkan pada cakupan ilmu pengetahuanNya terhadap segala sesuatu, kesempurnaan KuasaNya dalam mengatur, kesempurnaan pengendalianNya dan kesempurnaan hikmahNya yang dengannya DIa menempatkan segala sesuatu masing-masing pada tempatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 62: (Allah menciptakan segala sesuatu dan Dia memelihara segala sesuatu) Dia mengatur dan menguasainya menurut apa yang dikehendaki-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang keagungan dan kesempurnaan-Nya, dimana hal ini mengharuskan orang-orang yang kafir kepada-Nya layak memperoleh kerugian sebagaimana diterangkan dalam ayat selanjutnya. Kalimat ini dan yang semisalnya termasuk yang sering disebutkan dalam Al Qur’an. Ia menunjukkan bahwa segala sesuatu selain Allah adalah makhluk. Namun firman Allah bukanlah termasuk makhluk, karena firman adalah sifat bagi yang berfirman, dan Allah Ta’ala dengan nama dan sifat-Nya adalah yang pertama, dimana tidak ada sesuatu sebelum-Nya. Oleh karena itu, penggunaan dalil oleh kaum Mu’tazilah dengan ayat ini bahwa Al Qur’an adalah makhluk termasuk kebodohan yang sangat, karena Allah Subhaanahu wa Ta'aala senantiasa dengan nama dan sifat-Nya itu, dan tidak ada sifat yang baru bagi-Nya, demikian pula tidak lepas darinya satu waktu pun. Alasannya adalah bahwa Allah Subhaanahu wa Ta'aala memberitahukan tentang Diri-Nya yang mulia bahwa Dia Pencipta segala esuatu (alam bagian atas maupun alam bagian bawah), dan bahwa Dia Wakil (yang diserahi) terhadap segala sesuatu, sedangkan perwakilan secara sempurna harus ada pengetahuan dari wakil terhadap sesuatu yang diwakili dan mengetahui secara rinci dan ada kemampuan sempurna terhadap yang diwakilkan agar bisa melakukan tindakan terhadapnya, demikian juga kemampuan menjaga sesuatu yang diwakilkan, dan memiliki hikmah dan pengetahuan terhadap berbagai tindakan agar dapat mengaturnya sesuai dengan yang lebih layak, dan perwakilan tidaklah sempurna kecuali dengan semua sifat itu, jika ada kekurangan, maka ia merupakan kekurangan di dalamnya. Termasuk yang sudah maklum lagi sudah tetap adalah bahwa Allah Subhaanahu wa Ta'aala Mahasuci dari segala kekurangan pada salah satu sifat-Nya, sehingga pemberitahuan-Nya bahwa Dia Wakil terhadap segala sesuatu menunjukkan pengetahuan-Nya yang meliputi segala sesuatu, sempurna kekuasaan-Nya dalam mengaturnya, sempurna pula pengaturan-Nya dan sempurna pula kebijaksanaan-Nya, dimana Dia meletakkan segala sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 62",
    "description": "Pada ayat-ayat yang lalu digambarkan kemahakuasaan Allah menjatuhkan sanksi bagi orang yang durhaka, dan melimpahkan anugerah bagi orang yang taat. Pada ayat-ayat berikut, Al-Qur'an merinci lebih detail tentang kemahakuasaan Allah itu. Allah yang maha esa adalah pencipta segala sesuatu dan hanya dia sajalah, tidak ada yang lain, maha pemelihara atas segala sesuatu itu. 63. Dan milik-Nyalah kunci-kunci perbendaharaan langit dan bumi. Dan orang-orang yang kafir yakni ingkar terhadap ayat-ayat Allah dan memperolok-olokkannya, mereka itulah orang yang mengalami kerugian."
  }
]