[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah kunci-kunci perbendaharaan (kekayaan) langit dan bumi, Dia memberikan sebagian darinya kepada siapa yang Dia kehendaki dari makhlukNya. Dan orang-orang yang mengingkari ayat-ayat al-Qur’an dan bukti-buktiNya yang jelas yang terkandung di dalamnya, mereka adalah orang-orang yang benar-benar merugi di dunia dengan dibiarkannya mereka dari iman dan di akhirat dengan kekalnya mereka di dalam neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Hanya milik-Nya semata kunci-kunci perbendaharaan kebaikan di langit dan di bumi. Allah memberikannya kepada siapa yang Dia kehendaki dan menghalanginya dari siapa yang Dia kehendaki. Dan orang-orang yang kafir kepada Allah adalah orang-orang yang merugi, karena mereka gagal meraih iman di kehidupan dunia, dan saat di Akhirat mereka masuk ke dalam Neraka serta kekali di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. لَّهُۥ مَقَالِيدُ السَّمٰوٰتِ وَالْأَرْضِ ۗ (Kepunyaan-Nya-lah kunci-kunci (perbendaharaan) langit dan bumi) Yakni kunci-kunci langit, bumi, rezeki, dan rahmat. Atau yang dimaksud adalah Allah-lah yang mengatur segala yang ada di langit dan di bumi, tidak ada yang terlewat dari-Nya satu makhlukpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Allah Pemilik kunci segala isi dari langit dan bumi seperti hujan tumbuhan dan rizki. Adapun orang-orang yang kafir kepada ayat-ayat Al-quran dan berbagai bukti kekuasaan Allah maka merekalah orang-orang yang sangat rugi terhadap diri mereka sendiri karena mereka akan dilemparkan ke dalam azab neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pemelihara dan pengaturnya {MilikNyalah kunci-kunci langit dan bumi} kunci-kunci perbendaharaan kebaikan langit dan bumi {Orang-orang yang ingkar dengan ayat-ayat Allah, mereka itulah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “KepunyaanNya lah kunci-kunci langit dan bumi,” maksudnya, kunci-kuncinya berupa ilmu dan pengendalian, maka “Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorang pun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorang pun yang sanggup untuk melepaskannya sesudah itu. Dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.” (Fathir: 2). Setelah Allah menjelaskan sebagian dari keagunganNYa yang menuntut keharusan hati untuk penuh dengan rasa mengaungkan dan memuliakanNYa, maka Dia menjelaskan keadaan orang-orang yang kebalikan dari itu, yang tidak mengagungkanNya dengan pengagungan yang sebenar-benarmya, seraya berfirman, “Dan orang-orang yang kafir terhadap ayat-ayat Allah” yang menunjukkan kepada al-haqqul yaqin (kebenaran sejati) dan jalan yang lurus, “mereka itulah orang-orang yang merugi,” mereka mendapatkan kerugian karena tidak meraih apa-apa yang karenanya hati mereka menjadi shalih (Baik), seperti penghambaan dan keikhlasan kepada Allah, dan apa-apa yang dengannya lisan menjadi lurus seperti sibuk mengingat Allah, dan apa-apa yang dengannya seluruh anggota tubuh menjadi baik, seperti taat kepada Allah. Mereka menggantikan semua itu dengan apa-apa yang justru merusak hati dan badan. Mereka rugi karena tidak meraih surge yang penuh kenikmatan dan menggantikannya dengan azab yang sangat pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 63: (Kepunyaan-Nyalah kunci-kunci perbendaharaan langit dan bumi) yakni berupa air hujan tumbuh-tumbuhan dan lain sebagainya (Dan orang-orang yang kafir terhadap ayat-ayat Allah) yaitu Alquran (mereka itulah orang-orang yang merugi) ayat ini berhubungan langsung dengan firman-Nya, \"Dan Allah menyelamatkan orang-orang yang bertakwa...\" (Q.S. Az-Zumar, 61) dan ayat yang ada di antara keduanya merupakan jumlah I'tiradh atau kalimat sisipan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti hujan, tumbuh-tumbuhan, dsb. Oleh karena itu, “Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorang pun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorang pun yang sanggup melepaskannya sesudah itu. Dan Dialah Yang Mahaperkasa lagi Mahabijaksana.” (Terj. Fathir: 2) Setelah Allah Subhaanahu wa Ta'aala menerangkan tentang keagungan-Nya yang menghendaki hati memiliki rasa pengagungan penuh kepada Allah, maka Dia menyebutkan keadaan orang-orang yang berbuat kebalikannya, dimana mereka tidak mengagungkan Allah dengan semestinya. Yang menunjukkan kebenaran yang yakin dan jalan yang lurus. Mereka rugi tidak memperoleh sesuatu yang memperbaiki hati mereka, yaitu beribadah dan ikhlas kepada Allah. Demikian pula tidak memperoleh sesuatu yang memperbaiki lisan mereka, yaitu Dzikrullah, dan tidak memperoleh sesuatu yang memperbaiki anggota badan mereka yaitu ketaatan, dan mereka ganti semua itu dengan yang merusak hati, lisan dan anggota badannya, sehingga mereka rugi tidak memperoleh surga yang penuh kenikmatan yang diperuntukkan untuk orang-orang yang baik hatinya, lisannya dan anggota badannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 63",
    "description": "Dan milik-Nyalah kunci-kunci perbendaharaan langit dan bumi. Dan orang-orang yang kafir yakni ingkar terhadap ayat-ayat Allah dan memperolok-olokkannya, mereka itulah orang yang mengalami kerugian. 64. Katakanlah, wahai nabi Muhammad, 'apakah kamu masih menyu-ruh aku menyembah selain Allah, wahai orang-orang yang bodoh' padahal sudah sangat jelas bukti-bukti keesaan dan kemahakuasaan-Nya dari yang lain. '."
  }
]