[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah (wahai rasul) kepada orang-orang musyrik dari kaummu, “Apakah kalian wahai orang-orang yang tidak mengetahui Allah, memerintahkanku untuk menyembah selain Allah padahal ibadah itu tidak patut untuk sesuatu pun kecuali Dia?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Katakanlah -wahai Rasul- kepada orang-orang musyrikin yang terus menggodamu agar menyembah berhala-berhala mereka, “Apakah kalian -wahai orang-orang bodoh tentang Rabb kalian- memerintahkanku agar menyembah selain Allah? Tidak ada yang berhak diibadahi selain Allah semata, maka aku tidak menyembah selain-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64-66. Hai Rasulullah, katakanlah kepada orang-orang musyrik: “Apakah kalian memerintahkanku untuk menyembah selain Allah Yang Maha Esa Yang Berhak disembah, wahai orang-orang jahil?” Sungguh telah telah diwahyukan kepadamu dan kepada nabi-nabi sebelummu: “Sungguh jika kamu berbuat syirik -wahai manusia- dengan menyembah selain Allah, maka amal kebaikanmu akan terhapus, dan kamu akan termasuk orang-orang yang merugi di dunia dan di akhirat. Maka sembahlah Allah semata, dan jadilah termasuk orang-orang yang bersyukur kepada Allah dengan perkataan dan perbuatan atas segala kenikmatan dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. قُلْ أَفَغَيْرَ اللهِ تَأْمُرُوٓنِّىٓ أَعْبُدُ أَيُّهَا الْجٰهِلُونَ (Katakanlah: “Maka apakah kamu menyuruh aku menyembah selain Allah, hai orang-orang yang tidak berpengetahuan?”) Allah memerintahkan Rasulullah agar mengatakan ucapan ini kepada orang-orang kafir ketika mereka mengajaknya untuk menyembah berhala-berhala dengan menyatakan “ini adalah agama nenek moyangmu.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Wahai Nabi, katakanlah kepada orang-orang musyrik: “Apakah kalian menyuruhku untuk menyembah selain Allah setelah tampak dengan jelas berbagai bukti keesaan Allah. Wahai orang-orang yang bodoh untuk melihat tanda keesaan Allah?” Orang-orang musyrik berkata kepada Nabi SAW “Apakah nenek moyangmu dahulu ada orang-orang yang sesat wahai Muhammad?” Sehingga turunlah ayat ini. Mereka juga meminta Nabi untuk menengok sesembahan mereka, namun mereka kemudian mengikuti ajaran dan beriman kepada Nabi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah kalian menyuruhku menyembah selain Allah, wahai orang-orang yang bodoh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Katakanlah” wahai rasul, kepada orang-orang bodoh itu, yaitu orang-orang yang mengajakmu menyembah selain Allah, “Maka apakah kamu menyuruh aku menyembah selain Allah, hai orang-orang yang jahil (bodoh).” Maksudnya, perintah ini bersumber dari kebodohan kalian. Kalau tidak, ,maka kalau sekiranya kalian mempunyai ilmu pengetahuan bahwasanya Alah Yang Mahasempurna dari segala sisiNya, yang melimpahkan seluruh kenikmatan adalah yang berhak diibadahi, bukan selainNya yang lemah dari segala sisinya, tidak dapat memberikan manfaat ataupun menimpakan mudarat; lalu kenapa kalian menyuruh melakukan hal itu? Padahal sesungguhnya kesyirikan (mempersekutukan Allah) itu dapat menghapus semua amal-amal kebaikan dan merusak semua keadaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 64: (Katakanlah, \"Maka apakah kalian menyuruh aku menyembah selain Allah, hai orang-orang yang tidak berpengetahuan?\") lafal Ghaira dinashabkan oleh lafal A'budu yang juga menjadi Ma'mul dari lafal Ta-muruunnii atau Ta-muruunanii dengan memperkirakan adanya huruf An sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada mereka yang bodoh itu, yang mengajakmu untuk menyembah selain Allah. Mereka dipanggil sebagai orang-orang yang bodoh, karena seruan mereka untuk menyembah selain Allah tidaklah muncul kecuali dari kebodohan mereka. Hal itu, karena kalau saja mereka memiliki ilmu bahwa Allah Subhaanahu wa Ta'aala Yang Mahasempurna dari berbagai sisi, yang menganugerahkan semua nikmat adalah yang berhak diibadahi tidak selain-Nya yang memiliki kekurangan dari berbagai sisi, yang tidak memberi manfaat dan tidak bisa menimpakan madharrat (bahaya), tentu mereka tidak akan memerintahkan demikian. Di samping itu, syirk adalah sesuatu yang menghapuskan amal dan merusak keadaan sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 64",
    "description": "Katakanlah, wahai nabi Muhammad, 'apakah kamu masih menyu-ruh aku menyembah selain Allah, wahai orang-orang yang bodoh' padahal sudah sangat jelas bukti-bukti keesaan dan kemahakuasaan-Nya dari yang lain. '65. Dan ingatlah, sungguh telah diwahyukan kepadamu, wahai nabi Muhammad, dan juga telah diwahyukan kepada nabi-nabi yang sebelummu, 'sungguh aku tegaskan, jika engkau mempersekutukan-ku dengan yang lain, sebagaimana ajakan mereka kepadamu, niscaya akan hapuslah seluruh amalmu dan tentulah engkau akan termasuk ke dalam kelompok orang yang rugi."
  }
]