[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh telah diwahyukan kepadamu (wahai Rasul), dan kepada para rasul sebelummu, “Jika kamu menyekutukan Allah dengan sesuatu, niscaya amalmu akan batal dan kamu benar-benar termasuk orang-orang yang celaka lagi merugi di dunia dan akhiratmu, karena tidak ada amal shalih yang diterima bersama syirik.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Sungguh Allah telah mewahyukan kepadamu -wahai Rasul- dan juga kepada rasul-rasul sebelummu bahwa seandainya kamu menyembah selain Allah bersama Allah niscaya pahala amal salehmu akan batal, dan kamu pasti termasuk orang-orang yang merugi di dunia dengan kerugian dalam agamamu, dan di akhirat karena kamu mendapatkan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَلَقَدْ أُوحِىَ إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ (Dan sesungguhnya telah diwahyukan kepadamu dan kepada (nabi-nabi) yang sebelummu) Yakni diwahyukan pula kepada setiap rasul sebelummu. لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخٰسِرِينَ(Jika kamu mempersekutukan (Tuhan), niscaya akan hapuslah amalmu dan tentulah kamu termasuk orang-orang yang merugi) Jika kemusyrikan dapat menghapus amalan para nabi seandainya mereka melakukannya, maka terlebih lagi dapat menghapus amalan selain para nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Aku benar-benar telah mewahyukan kepadamu serta para rasul sebelum kamu: “Apabila engkau menyekutukan Allah dengan yang lain – dengan jalan fardl, tahyij (agitasi) dan iqnath (putus asa) terhadap orang kafir – maka amal-amalmu yang lalu akan hilang seperti debu yang berterbangan. Kemudian kalian akan menjadi orang-orang yang sangat merugi di akhirat. Adapaun selain nabi lebih utama dalam hal ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar telah diwahyukan kepadamu dan kepada orang-orang sebelummu,“Sungguh, jika kamu menyekutukanNya, niscaya akan gugurlah} akan sia-sia {amalmu dan kamu pasti termasuk orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Maka dari itu Dia berfirman, “Dan sesungguhnya telah diwahyukan kepadamu dan kepada orang-orang sebelummu,” dari seluruh nabi-nabi, “Jika kamu mempersekutukan Allah, niscaya akan terhapus amalmu.” Ini adalah kata mufrad (tunggal) yang diidhafahkan yang berarti mencakup setiap amal perbuatan. Jadi, di dalam kenabian seluruh nabi-nabi (diajarkan bahwa) syirik itu menghapus seluruh amal-amal shalih, sebagaimana dikatakan oleh Allah di dalam Surat al-An’am setelah Dia menyebutkan banyak nabi-nabi dan Rasul-rasulNya, Dia berfirman mengenai mereka, “Itulah petunjuk Allah, yang dengannya Dia memberi petunjuk kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya. Seandainya mereka mempersekutukan Allah, niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan.” (Al-An’Am:88) “Dan tentulah kamu termasuk orang-orang yang merugi” untuk agama dan akhiratmu. Jadi, disebabkan syirik, amal-amal kebajikan dihapuskan dan dipastikan berhak mendapat siksaan dan hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 65: (Dan sesungguhnya telah diwahyukan kepadamu dan kepada nabi-nabi sebelummu) demi Allah (\"Jika kamu mempersekutukan Allah) hai Muhammad, seumpamanya (niscaya akan hapuslah amalmu dan tentulah kamu termasuk orangorang yang merugi.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik agamamu, duniamu maupun akhiratmu. Hal itu, karena syirk menghapuskan semua amal dan mengharuskan pelakunya mendapatkan siksa. Padahal siapakah yang lebih rugi daripada orang yang sudah banyak beramal namun tidak diberi upah, bahkan mendapatkan siksa?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 65",
    "description": "Dan ingatlah, sungguh telah diwahyukan kepadamu, wahai nabi Muhammad, dan juga telah diwahyukan kepada nabi-nabi yang sebelummu, 'sungguh aku tegaskan, jika engkau mempersekutukan-ku dengan yang lain, sebagaimana ajakan mereka kepadamu, niscaya akan hapuslah seluruh amalmu dan tentulah engkau akan termasuk ke dalam kelompok orang yang rugi. 66. Oleh karena itu, janganlah penuhi ajakan mereka, hendaklah Allah yang maha esa saja yang engkau sembah dan hendaklah engkau termasuk orang yang bersyukur. '."
  }
]