[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata, sembahlah Dia (wahai Nabi) dengan mengikhlaskan ibadah hanya kepadaNya semata yang tiada sekutu bagiNya, dan jadilah kamu termasuk orang-orang yang mensyukuri Allah atau nikmat-nikmatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Sembahlah Allah semata, jangan menyekutukan-Nya dengan siapapun, jadilah kamu bagian dari orang-orang yang bersyukur atas nikmat-nikmat yang Dia karuniakan kepadamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. بَلِ اللهَ فَاعْبُدْ (maka hendaklah Allah saja kamu sembah) Yakni sembahlah Allah semata dan jangan sembah juga selain-Nya. وَكُن مِّنَ الشّٰكِرِينَ(dan hendaklah kamu termasuk orang-orang yang bersyukur”) Yakni termasuk orang-orang yang memuji Allah atas segala kenikmatan yang telah Dia berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Karena itu, sembahlah Allah semata. Jangan kalian sekali-kali menyembah selain Allah – ini merupakan penolakan ketika mereka memerintakan Nabi – Jadilah orang yang senantiasa bersyukur atas nikmat Allah. Kata bal berfungsi sebagai penolakan terhadap usaha orang-orang musyrik untuk mengajak Nabi dalam kesyirikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sembahlah Allah} bertauhidlah {dan jadilah salah satu orang-orang yang bersyukur”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Kemudian DIa berfirman, “Karena itu, maka hendaklah Allah saja yang kamu sembah.” Setelah Allah memberitahu bahwa orang-orang yang jahil (bodoh) itu memerintah beliau untuk melakukan syirik dan Allah mengabarkan kekejian syirik, maka DIa memerintahnya untuk ikhlas (bertauhid), seraya berfirman, “Karena itu, maka hendaklah Allah saja yang kamu sembah.” Maksudnya, murnikanlah ibadah hanya kepadaNYa saja, tiada sekutu bagiNya, “dan hendaklah kamu termask orang-orang yang bersyukur” kepada Allah atas taufikNYa. Sebagaimana Allah disyukuri atas segala nikmat duniawi, seperti kesehatan tubuh dan keselamatannya, perolehan rizki dan lain-lainnya, maka demikian pula Dia disyukuri dan dipuji atas nikmat-nikmat AgamaNya. Seperti taufik (bimbingan) kepada keikhlasan dan takwa. Bahkan nikmat agama dalah nikmat yang sesungguhnya dan bila direnungkan, maka ia sesungguhnya berasal dari Allah. Bersyukur kepada Allah atas nikmat-nikmat tersebut merupakan penyelamatan (diri) dari sifat ujub (bangga diri) yang sering menghampiri (hati) orang-orang yang beramal disebabkan kebodohan mereka. Kalau tidak, sekiranya saja sang hamba mengetahui keadaan yang sebenarnya, tentu ia tidak akan berbangga diri oleh nikmat yang sebenarnya harus lebih disyukuri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 66: (Karena itu, maka hendaklah Allah) saja (kamu sembah dan hendaklah kamu termasuk orang-orang yang bersyukur\") atas nikmat-Nya kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memberitahukan bahwa orang-orang yang bodoh memerintahkan Beliau berbuat syirk dan memberitahukan buruknya perkara itu, maka Dia memerintahkan Beliau berbuat ikhlas (memurnikan ibadah hanya kepada Allah Subhaanahu wa Ta'aala). Yaitu kepada Allah atas taufiq dari-Nya. Sebagaimana Allah Subhaanahu wa Ta'aala disyukuri atas nikmat-nikmat-Nya yang terkait dengan dunia seperti sehat jasmani, memperoleh rezeki dan sebagainya, maka Dia juga berhak disyukuri atas nikmat-nikmat-Nya yang terkait dengan agama seperti taufiq untuk berbuat ikhlas dan bertakwa, bahkan nikmat agama adalah nikmat yang sesungguhnya. Dengan memikirkan bahwa nikmat itu berasal dari Allah dan bersyukur atasnya terdapat obat penyakit ujub yang sering menimpa orang-orang yang beramal karena kebodohan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 66",
    "description": "Oleh karena itu, janganlah penuhi ajakan mereka, hendaklah Allah yang maha esa saja yang engkau sembah dan hendaklah engkau termasuk orang yang bersyukur. '67. Dalam ayat-ayat yang lalu, Allah digambarkan sebagai pencipta dan pemilik segala, dan nabi Muhammad diperintah untuk menolak ajakan orang-orang musyrik mekah untuk menyembah selain Allah. Ayat-ayat berikut membawa kecaman terhadap orang-orang musyrik tersebut. Dan ketahuilah bahwa dengan ajakan menyekutukan Allah itu, mereka tidak mengagungkan Allah sebagaimana mestinya, padahal bumi dengan seluruh isi-Nya berada dalam genggaman tangan-Nya pada hari kiamat, dan demikian pula langit dengan seluruh lapisannya digulung oleh Allah dengan tangan kanan-Nya. Mahasuci dia dari segala apa yang tidak wajar bagi-Nya dan mahatinggi dia dari segala apa yang mereka persekutukan dengan-Nya."
  }
]