[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu tidak mengagungkan Allah dengan sebenar-benarnya, saat mereka menyembah selainNya bersamaNya padahal selain Dia tidak memberi manfaat atau mudarat pun. Mereka menyamakan makhluk yang lemah dengan Pencipta Yang Mahaagung, di mana diantara bukti besarnya KuasaNya adalah bahwa seluruh bumi dalam genggamanNya di Hari Kiamat, dan langit-langit tergulung di Tangan kananNya. Mahasuci Allah lagi Mahaagung dari apa yang dipersekutukan oleh orang-orang musyrik itu. Ayat ini mengandung dalil yang menetapkan sifat qabdhah (menggenggam) dan yamin (tangan kanan) serta ath-thayy (melipat) bagi Allah sesuai dengan keagungan dan kebesaranNya tanpa menentukan bentuk dan caranya dan tanpa menyamakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Kaum musyrikin itu tidak mengagungkan Allah dengan pengagungan yang sepatutnya manakala mereka menyekutukan-Nya dengan selain-Nya dari makhluk-makhluk-Nya yang lemah dan tidak berkuasa. Mereka lalai dari kodrat Allah yang sebagian dari buktinya adalah bumi dengan isinya berupa gunung-gunung, sungai-sungai, lautan pada Hari Kiamat semua itu ada dalam genggaman-Nya, dan bahwasanya langit yang tujuh seluruhnya tergulung di tangan kanan-Nya. Mahasuci Allah lagi Mahatinggi dari apa yang dikatakan dan diyakini oleh kaum musyrikin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Allah menegur orang-orang musyrik dari kalangan Yahudi dan lainnya, bahwa mereka tidak mengagungkan Allah dengan sebenar-benarnya pengagungan; sebab mereka telah menyekutukan Allah dengan yang lain dan menyamakan antara Pencipta dengan makhluk. Padahal tujuh bumi berada dalam genggaman-Nya pada hari kiamat, dan tujuh langit terkumpul pada tangan kanan-Nya. Maha Suci Allah dari segala sifat yang disematkan orang-orang musyrik kepada Allah. Abdullah bin Mas’ud berkata: Suatu hari datanglah seorang pendeta Yahudi datang kepada Rasulullah dan berkata: “Wahai Muhammad! Sesungguhnya kami menjumpai dalam kitab suci kami bahwa Allah akan meletakkan langit diatas satu jari, air diatas satu jari, tanah diatas satu jari, dan seluruh makhluk diatas satu jari, maka Allah berfirman: “Akulah Raja.” Tatkala mendengarnya, Rasulullah tertawa sehingga tampak gigi-gigi geraham beliau, karena membenarkan ucapan pendeta Yahudi itu, kemudian beliau membaca firman Allah: وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدْرِهِۦ وَٱلْأَرْضُ جَمِيعًا قَبْضَتُهُۥ يَوْمَ ٱلْقِيَٰمَةِ وَٱلسَّمَٰوَٰتُ مَطْوِيَّٰتٌۢ بِيَمِينِهِۦ ۚ سُبْحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشْرِكُونَ Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya padahal bumi seluruhnya dalam genggaman-Nya pada hari kiamat dan langit digulung dengan tangan kanan-Nya. Maha Suci Tuhan dan Maha Tinggi Dia dari apa yang mereka persekutukan. (az-Zumar: 67) (Hadits Shahih al-Bukhari 8/412 no. 4811, kitab tafsir surat az-Zumar, bab (ayat ini). Dan shahih Muslim 4/2147, kitab gambaran kiamat, surga, neraka, dan lain sebagainya)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَمَا قَدَرُوا۟ اللهَ حَقَّ قَدْرِهِۦ (Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya) Yakni mereka tidak membesarkan Allah dengan sebenar-benarnya. وَالْأَرْضُ جَمِيعًا قَبْضَتُهُۥ يَوْمَ الْقِيٰمَةِ (padahal bumi seluruhnya dalam genggaman-Nya pada hari kiamat) Yakni Allah menggenggamnya dengan tangan-Nya. وَالسَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِينِهِۦ ۚ( dan langit digulung dengan tangan kanan-Nya) Imam Bukhari, Muslim, dan lainnya meriwayatkan hadits dari Abu Hurairah, aku pernah mendengar Rasulullah bersabda: “Allah menggenggam bumi pada hari kiamat, dan menggulung langit dengan tangan kanan-Nya, kemudian Dia berfirman: “Aku-lah sang Raja, dimana raja-raja bumi itu sekarang?”.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 Orang-orang musyrik itu sama sekali tidak mengagungkan Allah sepenuh hati. Itu terbukti bahwa mereka menyekutukan Allah dan memberi sifat kepada Allah dengan berbagai sifat yang tidak sesuai dengan Allah. Bahkan, bumi ini seluruhnya adalah dalam genggaman, kerajaan dan kekuasaan Allah. Langit terkumpul karena kekuasaan-Nya, semua bertasbih atas nama-Nya, dan mengagungkan-Nya dari segala yang menyekutukan-Nya, baik itu berupa anak, sekutu atau teman. Ibnu Mas’ud berkata: Suatu kali ada seorang laki-laki ahli kitab yang mendatangi Nabi SAW , dia berkata: “Wahai ayah Qasim, apakah telah sampai kepadamu bahwa Allah Allah menggenggam semua ciptaan-Nya di jari-Nya? Begitu juga bumi dan pepohonan?” Kemudian rasul tertawa sampai gigi gerahamnya terlihat. Kemudian Allah menurunkan ayat ini. Maknanya adalah bahwa Allah Maha Kuasa untuk menggenggam langit dan bumi sebagaimana kita mampu membawa barang yang dapat kita bawa dengan jari kita."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak mengagungkan} mereka tidak mengagungkan {Allah dengan sebenarnya} dengan keagunganNya {Dan bumi seluruhnya (ada dalam) genggamanNya pada hari kiamat dan langit digulung dengan tangan kananNya. Maha suci Dia} Maha suci Dia {dan Maha tinggi} Maha Agung {Dia dari apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Allah mengatakan, bahwa orang-orang yang musyrik itu tidak menghargai Allah, Rabb mereka, “dengan pengagungan yang semestinya” dan tidak pula mereka mengagungkanNYa dengan sebenar-benar pengagungan, bahkan mereka melakukan apa-apa yang berlawanan dengan itu semua, seperti mempersekutukanNya dengan sesuatu yang sangat rapuh dalam sifat-sifat dan perbuatan-perbuatannya, sifat-sifatnya rapuh dari segala sisinya, bahkan perbuatan-perbuatannya sama sekali tidak mempunyai manfaat dan mudarat dan tidak pula dapat memberi dan menahan, dan tidak memiliki wewenang apa pun. Kemudian mereka menyetarakan makhluk nan lemah ini dengan sang Pencipta, Rabb Yang Mahaagung, yang di antara tanda keagunganNya yang luar biasa dan kuasaNya yang mengalahkan adalah bahwa semua bumi ini di Hari Kiamat kelak ada dalam genggaman Allah yang MaHa Pengasih, dan bahwa langit dengan keluasan dan kebesarannya dilipat dengan Tangan kananNya. Maka orang yang menyamakanNya dengan yang lain itu tidak mengagungkanNya dengan sebenar-benar pengagungan, dan tidak ada orang yang lebih zhalim daripadanya. “Mahasuci dan Mahatinggi Dia dari apa yang mereka persekutukan.” Maksudnya, DIa Mahasuci lagi Mahatinggi dari perbuatan syirik mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 67: (Dan mereka tidak mengagungkan Allah dengan pengagungan yang semestinya) yakni mereka tidak mengenal Allah dengan pengenalan yang sebenarnya; atau, mereka tidak mengagungkan-Nya dengan pengagungan yang sesungguhnya sewaktu mereka menyekutukan-Nya dengan selain-Nya (padahal bumi seluruhnya) lafal ayat ini menjadi Hal dan maksud dari lafal Jamii'an ialah bumi yang berlapis tujuh itu (dalam genggaman kekuasaan-Nya) maksudnya berada di dalam kekuasaan dan tasharuf-Nya (pada hari kiamat dan langit digulung) dilipat menjadi satu (dengan tangan kanan-Nya) yakni dengan kekuasaan-Nya (Maha Suci dan Maha Tinggi Allah dari apa yang mereka persekutukan) bersama-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dengan sanadnya dari Abdullah bin Mas’ud ia berkata: Pernah datang seorang laki-laki dari Ahli Kitab kepada Nabi shallallahu 'alaihi wa sallam dan berkata, “Wahai Abul Qasim, aku sampaikan kepadamu bahwa Allah ‘Azza wa Jalla akan mengangkat semua makhluk di atas satu jari, langit di atas satu jari, semua bumi di atas satu jari, pohon di atas satu jari, dan tanah di atas satu jari, maka Nabi shallallahu 'alaihi wa sallam tersenyum sehingga kelihatan gigi gerahamnya. Lalu Allah ‘Azza wa Jalla menurunkan ayat, “Dan mereka tidak mengagungkan Allah sebagaimana mestinya…dst.” (Syaikh Muqbil berkata, “Hadits ini para perawinya adalah para perawi hadits shahih. Ibnu Khuzaimah juga meriwayatkan dalam kitab Tauhid hal. 76, Ibnu Jarir juz 24 hal. 27, Baihaqi dalam Asmaa’ wash Shifat hal. 333. Imam Ahmad juga meriwayatkan juz 1 hal. 151, Tirmidzi dan ia menshahihkannya juz 4 hal. 177, Ibnu Khuzaimah dalam At Tauhid (hal.)78, Thabari juz 14 hal. 26 dari hadits Ibnu Abbas yang sama seperti itu, namun di dalamnya terdapat ‘Athaa’ bin As Saa’ib, dia mukhtalith (bercampur hapalannya).” Al Haafizh As Suyuthi dalam Al Itqaan juz 1 hal. 34 berkata, “Hadits tersebut dalam kitab shahih dengan lafaz, “Fa Talaa (Maka Rasulullah shallallahu 'alaihi wa sallam membacakan ayat…dst.)” Dan inilah yang benar, karena ayat ini adalah Makkiyyah. Syaikh Muqbil berkata, “Aku katakan, bahwa lafaz, “Talaa” yang disebutkan dalam kitab shahih tidaklah menafikan bahwa ayat itu turun, kemudian Rasulullah shallallahu 'alaihi wa sallam membacakannya. Adapun keadaannya sebagai Makkiyyah, maka jika yang kuat turunnya, yakni ayat ini di Mekah, maka tidak ada penghalang untuk turun dua kali, dan jika tidak berdasarkan sanad yang shahih turunnya di Mekah, maka bisa saja surah ini Makkiyyah selain ayat ini, wallahu a’lam. Allah Subhaanahu wa Ta'aala menerangkan, bahwa mereka (kaum musyrik) tidak mengagungkan Allah dengan pengagungan yang semestinya bahkan mereka melakukan hal yang sebaliknya, yaitu menyekutukan-Nya dengan sesuatu yang memiliki kekurangan baik pada sifat maupun perbuatannya (tidak mampu memberi manfaat, menimpakan bahaya, memberi, menghalangi, dsb.) seperti yang terjadi pada patung dan berhala. Mereka menyamakan makhluk yang memiliki kekurangan itu dengan Khaliq (Pencipta) yang memiliki kesempurnaan dan keagungan, dimana di antara keagungan-Nya adalah bahwa pada hari Kiamat bumi seluruhnya dalam genggaman-Nya dan langit dengan keadaan yang luas dan besar akan digulung dengan Tangan Kanan-Nya. Namun demikian, orang-orang musyrik itu tidak mengagungkan-Nya dan berani menyekutukan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 67",
    "description": "Dalam ayat-ayat yang lalu, Allah digambarkan sebagai pencipta dan pemilik segala, dan nabi Muhammad diperintah untuk menolak ajakan orang-orang musyrik mekah untuk menyembah selain Allah. Ayat-ayat berikut membawa kecaman terhadap orang-orang musyrik tersebut. Dan ketahuilah bahwa dengan ajakan menyekutukan Allah itu, mereka tidak mengagungkan Allah sebagaimana mestinya, padahal bumi dengan seluruh isi-Nya berada dalam genggaman tangan-Nya pada hari kiamat, dan demikian pula langit dengan seluruh lapisannya digulung oleh Allah dengan tangan kanan-Nya. Mahasuci dia dari segala apa yang tidak wajar bagi-Nya dan mahatinggi dia dari segala apa yang mereka persekutukan dengan-Nya. 68. Dan ketahuilah bahwa ketika sangkakala pun ditiup oleh malaikat israfil, maka matilah semua makhluk yang ada di langit dan juga makhluk yang ada di bumi, kecuali mereka yang dikehendaki Allah untuk mati pada saat yang lain sesudah itu. Kemudian sesudah waktu berlalu sekian lama, sangkakala itu ditiup sekali lagi, maka seketika itu dengan serta merta mereka bangun dari kuburnya menunggu keputusan Allah bagi diri masing-masing."
  }
]