[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sangkakala pun ditiup, maka matilah semua yang ada di langit dan di bumi kecuali siapa yang dikehendaki oleh Allah untuk tidak mati, kemudian malaikat meniupnya untuk kedua kalinya sebagai pengumuman hidupnya kembali seluruh mahkluk untuk bangkit menghadapi perhitungan amal di depan Tuhan mereka, dan mereka pun bangkit melihat apa yang hendak dilakukan Tuhan mereka terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Pada hari malaikat yang bertugas meniup sangkakala meniupnya, maka semua makhluk yang ada di langit dan di bumi mati, kemudian malaikat meniup kedua kalinya untuk kebangkitan, maka semua makhluk hidup berdiri menantikan apa yang akan Allah lakukan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Allah menjelaskan hal besar yang terjadi pada seluruh makhluk saat hari kiamat dalam delapan ayat terakhir dari surat ini: Malaikat yang bertugas meniup sangkakala meniupnya untuk pertama kali, maka seluruh makhluk yang ada di tujuh langit dan bumi binasa seluruhnya kecuali yang Allah kehendaki untuk tetap hidup. Kemudian Allah meniup sangkakala untuk kedua kalinya, maka bangkitlah manusia dari kubur mereka dan menunggu perintah yang ditujukan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَنُفِخَ فِى الصُّورِ فَصَعِقَ مَن فِى السَّمٰوٰتِ وَمَن فِى الْأَرْضِ(Dan ditiuplah sangkakala, maka matilah siapa yang di langit dan di bumi) Ini merupakan tiupan yang pertama. Arti dari sangkakala adalah tanduk yang ditiup oleh malaikat Israfil yang mematikan penduduk laingit dan bumi akibat kekagetan dan kerasnya suara yang dikeluarkan. Makna (الصعق) yakni mati pada saat itu juga. إِلَّا مَن شَآءَ اللهُ ۖ( kecuali siapa yang dikehendaki Allah) Yang dikecualikan adalah malaikat Israfil itu sendiri, kemudian dia akan mati setelah itu. ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ( Kemudian ditiup sangkakala itu sekali lagi) Yakni tiupan yang lain. فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ(maka tiba-tiba mereka berdiri menunggu) Yakni seluruh makhluk berdiri diatas kaki mereka seraya menunggu apa yang akan dikatakan kepada mereka. Atau mereka sambil melihat dengan mata mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Sangkakala-pun ditiup (tiupan pertama) sehingga matilah semua makhluk baik yang di langit maupun di bumi, kecuali yang masih diizinkan hidup oleh Allah. Yang masih diizinkan hidup antara lain adalah Jibril, Mikail dan Israfil, mereka akan diwafatkan kemudian, namun yang paling pasti adalah tidak ada dalil yang menyebutkan penjelasan terhadap mereka. Kemudian tiupan kedua untuk membangkitkan semua dari kubur. Apabila semua yang telah mati sudah berdiri di atas kubur mereka, mereka hanya akan menunggu apa yang akan mereka terima"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Sangkakala ditiup} sangkakala {sehingga semua yang di langit dan di bumi mati, kecuali mereka yang dikehendaki oleh Allah. Kemudian Sangkakala ditiup lagi} kedua kalinya untuk pembangkitan {Seketika itu, mereka bangun lagi menunggu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Setelah Allah mempertakuti mereka dengan keagunganNya, maka di sini Dia mempertakuti mereka dengan keadaan Hari Kiamat, Dia memberi mereka semangat dan (sekaligus) memberi mereka ancaman, seraya berfirman, “Dan ditiuplah sangkakala.” Ia adalah (tanduk) terompet raksasa yang tidak bisa diketahui kebesarannya selain oleh sang Pencipta yang telah menciptakannya dan orang yang telah diberi kesempatan oleh Allah untuk mengetahuinya di antara makhlukNya. Maka Israfil, salah seorang malaikat yang memiliki tugas penting dan merupakan salah satu malaikat yang memikul Arasy, meniup sangkakala itu, “maka matilah,” maksudnya, pingsanlah, atau matilah (demikian maknanya menurut dua pendapat yang berbeda) “siapa yang di langit dan di bumi.” Maksudnya, semua mereka ketika mendengar tiupan terompet itu, mereka tersentak karena kedahsyatan dan amat sangat kerasnya, sedangkan mereka tidak mengetahui bahwa itu adalah awal dari kedatangannya Hari KIamat, “kecuali siapa yang dikehendaki Allah,” artinya di antara mereka ada yang diberi keteguhan oleh Allah saat ditiupnya sangkakala itu, mereka tidak pingsan atau mati. (Mereka adalah) seperti para syuhada atau sebagian di antara mereka atau darinya. Ini adalah tiupan yang pertama, yaitu tiupan untuk kematian dan ketakutan, “kemudian ditiup sangkakala itu sekali lagi,” untuk kedua kalinya, yaitu tiupan kebangkitan, “maka tiba-tiba mereka berdiri menunggu,” makasudnya, mereka berdiri dari dalam kubur untuk kebangkitan dan hisab (perhitungan amal), mereka melihat bahwa penciptaan jasad dan ruh mereka kembali telah selesai dan mata mereka memandang dengan tajam, “mereka menunggu” apa yang akan dilakukan Allah terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 68: (Dan ditiuplah sangkakala) pada tiupan yang pertama (maka matilah) artinya mati mendadaklah (siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah) yaitu para bidadari, para pelayan surga dan selain keduanya. (Kemudian ditiup sangkakala itu sekali lagi maka tiba-tiba mereka) yakni semua makhluk yang telah mati itu (berdiri seraya menunggu) apa yang bakal diputuskan terhadap diri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menakut-nakuti mereka dengan keagungan-Nya, maka Dia menakut-nakuti mereka dengan keadaan pada hari Kiamat, mentargib (memberikan dorongan) dan mentarhib mereka (menakut-nakuti). Sangkakala adalah qarn (tanduk) yang besar, tidak ada yang mengetahui besarnya kecuali Penciptanya dan makhluk yang diberitahukan Allah, lalu malaikat Israfil ‘alaihis salam meniupnya. Ia adalah salah satu malaikat yang didekatkan, salah satu malaikat pemikul ‘Arsy. Rasulullah shallallahu 'alaihi wa sallam bersabda: أُذِنَ لِيْ أَنْ أُحَدِّثَ عَنْ مَلَكٍ مِنْ مَلَائِكَةِ اللهِ تَعَالَى مِنْ حَمَلَةِ الْعَرْشِ ، مَا بَيْنَ شَحْمَةِ أُذُنِهِ إِلَى عَاتِقِهِ مَسِيْرَةَ سَبْعِمِائَةِ سَنَةٍ “Telah diizinkan kepadaku untuk memberitahukan tentang salah satu malaikat Allah Ta’ala yang termasuk pemikul ‘Arsy, dimana jarak antara cuping telinganya dengan bahunya sejauh perjalanan 700 tahun.” (HR. Abu Dawud, Thabrani dalam Al Awsath, Nasa’i, Ibnu Syahin dalam Al Fawaa’id, dan Ibnu ‘Asaakir, dishahihkan oleh Syaikh Al Albani dalam Silsilah Ash Shahihah no. 151) Karena begitu keras dan dahsyat suara itu. Yaitu orang-orang yang diteguhkan Allah saat ditiup sangkakala sehingga tidak mati. Yaitu tiupan kebangkitan. Dalam keadaan sudah sempurna fisiknya bersama ruhnya yang sebelumnya sebagai tulang belulang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 68",
    "description": "Dan ketahuilah bahwa ketika sangkakala pun ditiup oleh malaikat israfil, maka matilah semua makhluk yang ada di langit dan juga makhluk yang ada di bumi, kecuali mereka yang dikehendaki Allah untuk mati pada saat yang lain sesudah itu. Kemudian sesudah waktu berlalu sekian lama, sangkakala itu ditiup sekali lagi, maka seketika itu dengan serta merta mereka bangun dari kuburnya menunggu keputusan Allah bagi diri masing-masing. 69. Dan bersamaan dengan itu, bumi, yakni padang mahsyar, tempat semua makhluk berkumpul untuk mempertanggungjawabkan semua perbuatan, menjadi terang benderang dengan cahaya keadilan tuhannya; dan buku-buku rekam jejak perbuatan diberikan dan kemudian dibaca oleh mereka masing-masing satu persatu nabi-nabi menjadi saksi bagi umatnya, dan saksi-saksi atas amal mereka-pun dihadirkan, lalu diberikan keputusan oleh Allah di antara mereka satu persatu secara adil, sedang mereka tidak dirugikan sedikit pun."
  }
]