[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bumi bersinar di Hari Kiamat saat Allah Yang Mahahaq hadir untuk memberikan keputusanNya di antara makhluk, para malaikat menyebarkan buku catatan amal setiap orang, para nabi dan para saksi atas umat-umat didatangkan atas umat-umat, Allah bertanya kepada para nabi tentang tugas dakwah yang mereka pikul dan jawaban kaum mereka terhadap seruan dakwahnya, sebagaimana umat Muhammad hadir untuk menjadi saksi bahwa para rasul terdahulu telah menyampaikan dakwah mereka kepada umat-umat mereka bila umat-umat tersebut mengingkari penyampaian tersebut, sehingga hujjah Allah tegak atas semua umat lalu Tuhan semesta alam memberikan keputusanNya di antara hamba-hambaNya dengan keadilan yang sempurna dan mereka tidak dizhalimi sedikit pun dengan dikurangi pahalanya atau ditambah hukumannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Bumi bersinar manakala Rabbul Izzah menampakkan diri-Nya untuk memberikan keputusan final di antara hamba-hamba-Nya, buku-buku catatan amal manusia disebarkan, para Nabi dihadirkan, para Malaikat hafaẓah yang mencatat amal manusia didatangkan, Allah memberikan keputusan di antara mereka dengan adil, mereka tidak dizalimi pada hari itu, tidak ada yang ditambah satu keburukan pun dan tidak ada yang dikurangi kebaikannya sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69-70. Dan bumi menjadi terang benderang ketika Allah menyingkap diri-Nya untuk menegakkan hisab para makhluk. Didatangkanlah buku-buku catatan amal perbuatan mereka, dihadirkan para nabi dan para saksi setiap umat. Kemudian Allah memberi ketetapan di antara para makhluk dengan adil, mereka sama sekali tidak terzalimi atas amal perbuatan mereka sehingga setiap hamba dapat menerima haknya. Allah Maha Mengetahui kebaikan dan keburukan yang mereka lakukan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا (Dan terang benderanglah bumi (padang mahsyar) dengan cahaya (keadilan) Tuhannya) Yakni Allah adalah cahaya langit dan bumi. Pendapat lain mengatakan maknanya bahwa bumi menjadi terang dan bersinar karena keadilan yang Allah tegakkan diantara hamba-hamba-Nya serta kebenaran yang Allah tetapkan diantara mereka. وَوُضِعَ الْكِتٰبُ(dan diberikanlah buku (perhitungan perbuatan masing-masing)) Yakni kitab yang mencatat amal perbuatan Bani Adam. Sebagian mereka akan menerimanya dengan tangan kirinya dan sebagaian lain menerimanya dengan tangan kanannya, kemudian kitab itu akan diletakkan untuk dihisab. وَجِا۟ىٓءَ بِالنَّبِيِّۦنَ(dan didatangkanlah para nabi) Yakni mereka dibawa ke tempat hisab untuk ditanya tentang jawaban yang diberikan umat mereka kepada para nabi itu ketika di dunia. وَالشُّهَدَآءِ(dan saksi-saksi) Yakni umat nabi Muhammad yang menjadi saksi atas umat-umat yang lain. Atau orang-orang yang mati di jalan Allah, lalu mereka memberikan kesaksian di hari kiamat bahwa mereka telah menyampaikan kebenaran namun didustakan. وَقُضِىَ بَيْنَهُم بِالْحَقِّ(dan diberi keputusan di antara mereka dengan adil) Yakni ditetapkanlah keputusan diantara para hamba dengan adil dan benar. وَهُمْ لَا يُظْلَمُونَ (sedang mereka tidak dirugikan) Mereka tidak dikurangi pahalanya dan tidak dilebihkan siksanya dari yang layak mereka dapatkan. Balasan mereka akan diberikan sesuai dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Bumi padang mahsyar menjadi terang setelah tiupan kedua dengan cahaya Tuhannya. Ketika keagungan Allah untuk menimbang amal para makhluk dan menetapkan ganjaran atas mereka secara adil. Buku catatan amal telah diberikan, para Nabi dan para shahid didatangi oleh berbagai makhluk untuk bersaksi atas pengikutnya, juga orang-orang yang mendustakan kebenara. Adapun syuhada adalah orang-orang yang mati dalam keadaan syahid, mereka dari golongan malaikat, orang mukmin yang senantiasa berpegang teguh di jalan Allah. Mereka termasuk orang mukmin dari umat nabi Muhammad. Allah menghitung amal mereka dengan penuh keadilan dan kebenaran. Mereka tidak terdholimi sedikitpun, pahala mereka tidak dikurangi sedikitpun dan siksa mereka tidak ditambah sedikitpun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bumi menjadi terang} menjadi bersinar {dengan cahaya Tuhannya} dengan cahaya Tuhannya ketika bertajalli kepada para makhlukNya, untuk menentukan keputusan di antara mereka {buku (catatan amal) diberikan} lembaran-lembaran yang berisi amal anak cucu Adam disebarkan {para nabi dan para saksi pun dihadirkan} dan orang-orang yang bersaksi dari umat nabi Muhammad SAW atas umat mereka {lalu diputuskan} diputuskan {di antara mereka secara adil} adil {dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “Dan terang benderanglah bumi dengan cahaya Rabbnya.” Dapat diketahui di sini bahwa cahaya-cahaya yang akan lenyap di Hari Kiamat dan sirna, dan memang demikian, sebab Allah telah menginformasikan bahwa matahari akan digulung dan bulan menjadi gerhana, bintang-bintang berjatuhan dan manusia benar-benar berada dalam kegelapan. Maka pada saat itu bumi menjadi terang benderang karena cahaya Rabbnya ketika Dia menampakkan DiriNya dan turun untuk memberikan keputusan di antara mereka. Pada hari itu Allah memberikan kekuatan kepada manusia, Dia menghidupkan mereka dengan kehidupan di mana mereka menjadi kuat tidak terbakar oleh cahayaNya dan mereka juga mampu melihatNya. Kalau tidak, maka sesungguhnya nur (cahaya) Allah itu sangat luar biasa besarnya, kalau saja Dia menyingkapnya, niscaya pancaran sinar WajahNya akan membakar sejauh pandanganNya dari makhlukNYa, “dan diberikanlah buku,” maksudnya, buku catatan amal-amal perbuatan dan dokumennya, ia diletakkan dan dibagi-bagikan untuk dibaca apa-apa yang ada di dalamnya dari amal-amal kebajikan dan amal-amal buruk, sebagaimana difirmankan oleh Allah, “Dan diletakkanlah kitab, lalu kamu akan melihat orang-orang yang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang jua pun\". (Al-kahfi:49). Dan dikatakan kepada pelaku, sebagai tanda kesempurnaan keadilan, \"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.\" (Al-Isra:14) “Dan didatangkanlah para nabi” untuk ditanya tentang tabligh (penyampaian risalah) dan tentang umat-umatnya supaya mereka memberikan kesaksian terhadap mereka, “dan saksi-saksi” dari golongan malaikat, anggota-anggota tubuh, dan bumi. “Dan diberi keputusan di antara mereka dengan haq (adil),” maksudnya, dengan keadilan yang sempurna, keadilan yang agung, sebab ia adalah hisab (perhitungan amal) yang bersumber dari Tuhan yang tidak melakukan kehaliman seberat biji sawi pun jua dan dari TUhan yang Maha Meliputi segala sesuatu, dan kitabNya, yaitu al-Lauhul Mahfuh mencakup segala sesuatu yang pernah mereka lakukan, dan para malaikat yang mulia yang bertugas mencatat amal perbuatan manusia tidak pernah mendurhakai Rabbnya, mereka telah mencatat apa saja yang telah dilakukan manusia, dan saksi yang paling adil pun telah memberikan kesaksian atas keputusan itu. Maka Tuhan yang mengetahui kadar-kadar amal perbuatan dan kadar-kadar keberkahannya untuk mendapat pahala dan siksa memberikan keputusan berdasarkan itu semua, sehingga terjadilah suatu keputusan yang diakui oleh semua makhluk dan mereka mengakui bahwa segala puji dan keadilan hanya milik Allah, dan mereka mengakuinya dari keagungan, ilmu, hikmah dan rahmatNya yang belum pernah terlintas di dalam hati manusia dan tidak bisa diungkapkan oleh lisan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 69: (Dan ditiuplah sangkakala) pada tiupan yang pertama (maka matilah) artinya mati mendadaklah (siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah) yaitu para bidadari, para pelayan surga dan selain keduanya. (Kemudian ditiup sangkakala itu sekali lagi maka tiba-tiba mereka) yakni semua makhluk yang telah mati itu (berdiri seraya menunggu) apa yang bakal diputuskan terhadap diri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari sini diketahui bahwa cahaya-cahaya yang ada ketika itu hilang, matahari digulung/dilipat dan bulan dihilangkan cahayanya, sehingga ketika itu manusia berada dalam kegelapan, lalu bersinarlah bumi padang mahsyar dengan cahaya Allah, saat Allah datang untuk memberikan keputusan. Hari itu adalah hari ketika Allah memberikan kekuatan kepada makhluk dan menciptakan mereka dalam keadaan kuat sehingga tidak terbakar oleh cahaya-Nya. Hal itu, karena cahaya Allah Subhaanahu wa Ta'aala begitu besar, hijab-Nya cahaya seandainya dibuka tentu cahaya-Nya akan membakar semua makhluk-Nya sebagaimana disebutkan dalam hadits. Agar manusia membaca amal yang dikerjakannnya selama di dunia, yang baik maupun yang buruk sebagaimana firman Allah Ta’ala, “Dan diletakkanlah kitab (catatan amal), lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Aduhai celaka kami, kitab apa ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang pun juga.” (Terj. Al Kahfi: 49) Dan akan dikatakan kepada orang yang telah berbuat selama di dunia, “Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu.” (Terj. Al Israa’: 14) Yakni dihadirkan untuk ditanya tentang tabligh (penyampaian mereka); apakah mereka telah menyampaikan atau belum, dan untuk ditanya pula tentang umat-umat mereka, dan mereka (para rasul) akan memberikan kesaksian terhadap sikap kaumnya, apakah mereka beriman atau malah mendustakan. Lalu para nabi tersebut diminta untuk mendatangkan saksi, maka mereka mengangkat umat Nabi Muhammad shallallahu 'alaihi wa sallam sebagai saksi sebagaimana disebutkan dalam hadits berikut, Rasulullah shallallahu 'alaihi wa sallam bersabda: يَجِيءُ النَّبِيُّ يَوْمَ الْقِيَامَةِ وَمَعَهُ الرَّجُلُ وَالنَّبِيُّ وَمَعَهُ الرَّجُلَانِ وَأَكْثَرُ مِنْ ذَلِكَ فَيُدْعَى قَوْمُهُ فَيُقَالُ لَهُمْ هَلْ بَلَّغَكُمْ هَذَا فَيَقُولُونَ لَا فَيُقَالُ لَهُ هَلْ بَلَّغْتَ قَوْمَكَ فَيَقُولُ نَعَمْ فَيُقَالُ لَهُ مَنْ يَشْهَدُ لَكَ فَيَقُولُ مُحَمَّدٌ وَأُمَّتُهُ فَيُدْعَى مُحَمَّدٌ وَأُمَّتُهُ فَيُقَالُ لَهُمْ هَلْ بَلَّغَ هَذَا قَوْمَهُ فَيَقُولُونَ نَعَمْ فَيُقَالُ وَمَا عِلْمُكُمْ فَيَقُولُونَ جَاءَنَا نَبِيُّنَا فَأَخْبَرَنَا أَنَّ الرُّسُلَ قَدْ بَلَّغُوا فَذَلِكَ قَوْلُهُ{ وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا } قَالَ يَقُولُ عَدْلًا{ لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا “Akan datang seorang nabi pada hari Kiamat dengan pengikutnya seorang, ada pula nabi yang pengikutnya dua orang dan ada yang lebih dari itu, lalu dipanggil kaumnya, “Apakah nabi ini telah menyampaikan (risalahnya) kepada kalian?” Mereka menjawab, “Belum.” Lalu nabi itu ditanya, “Apakah kamu telah menyampaikan (risalahmu) kepada kaummu?” Ia menjawab, “Ya (sudah).” Lalu dikatakan kepadanya, “Siapa saksimu?” Ia menjawab, “Muhammad dan umatnya.” Lalu dipanggillah Muhammad dan umatnya dan mereka ditanya, “Apakah nabi ini telah menyampaikan (risalahnya) kepada kaumnya?” Mereka menjawab, “Ya.” Lalu mereka ditanya, “Dari mana kamu tahu?” Mereka menjawab, “Telah datang Nabi kami kepada kami dan memberitahukan bahwa para rasul semuanya telah menyampaikan.” Itulah maksud (ayat), “Dan demikianlah Kami jadikan kamu umat yang adil dan pilihan.” Yakni yang adil. Agar kamu menjadi saksi atas manusia dan rasul menjadi saksi atasmu.” (HR. Ahmad). Ayat yang disebutkan dalam hadits tersebut adalah ayat 143 surah Al Baqarah. Nabi Muhammad shallallahu 'alaihi wa sallam dan umatnya menjadi saksi bahwa para rasul semuanya telah menyampaikan risalahnya. Karena proses hisab tersebut berasal dari Tuhan yang tidak pernah dan tidak akan berbuat zalim seberat zarrah pun, di mana Dia meliputi segala sesuatu dan kitab-Nya, yakni Lauh Mahfuzh meliputi semua yang mereka kerjakan, para malaikat hafazhah telah mencatat apa yang mereka kerjakan, dan para saksi yang paling adil telah memberikan kesaksian, maka berdasarkan hal itu Tuhan yang mengetahui ukuran amal dan ukuran pahala atau siksa yang sesuai memberikan keputusan dengan keputusan yang membuat sejuk pandangan mata semua makhluk, membuat mereka mengakui bahwa Allah berhak dipuji dan Maha Adil, dan mereka pun mengetahui keagungan, ilmu, kebijaksanaan dan rahmat-Nya yang belum terlintas di hati mereka dan belum diungkapkan oleh lisan mereka. Oleh karena itu dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala berfirman, “Dan kepada setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 69",
    "description": "Dan bersamaan dengan itu, bumi, yakni padang mahsyar, tempat semua makhluk berkumpul untuk mempertanggungjawabkan semua perbuatan, menjadi terang benderang dengan cahaya keadilan tuhannya; dan buku-buku rekam jejak perbuatan diberikan dan kemudian dibaca oleh mereka masing-masing satu persatu nabi-nabi menjadi saksi bagi umatnya, dan saksi-saksi atas amal mereka-pun dihadirkan, lalu diberikan keputusan oleh Allah di antara mereka satu persatu secara adil, sedang mereka tidak dirugikan sedikit pun. 70. Dan sebagai bukti atas keadilan putusan itu, kepada setiap jiwa diberi balasan yang setimpal dengan sempurna sesuai dengan apa yang telah di-kerjakannya, dan dia Allah hakim yang maha adil lebih mengetahui apa yang mereka kerjakan."
  }
]