[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian (wahai manusia) kafir kepada tuhan kalian dan tidak beriman kepadaNya, serta tidak mengikuti utusan-utusanNya, maka sesungguhnya Allah maha kaya dan tidak membutuhkan kalian, Dia tidak memiliki hajat kepada kalian, sebaliknya kalianlah yang membutuhkan Nya, dan Allah tidak meridhai kekafiran bagi hamba-hambaNya dan tidak memerintahkan mereka melakukannya akan tetapi Dia hanya meridhai disyukurinya kenikmatanNya atas mereka. Satu jiwa tidak memikul beban dosa jiwa yang lain. Kemudian tempat kembali kalian adalah kepada tuhan kalian, lalu Dia membalas kalian sesuai dengan amal perbuatan kalian dan memperhitungkan kalian atasnya. Sesungguhnya Dia maha mengetahui segala rahasia jiwa dan apa yang disembunyikan oleh dada manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Jika kalian -wahai manusia- kafir kepada Rabb kalian, maka sesungguhnya Allah tidak memerlukan iman kalian, dan kekufuran kalian tidak merugikan-Nya, sebaliknya dampak negatif dari kekufuran kalian berpulang kepada kalian sendiri, dan Allah tidak meridai hamba-hamba-Nya bila mereka kafir dan tidak memerintahkan mereka agar menjadi kafir, karena Allah tidak memerintahkan perbuatan keji dan mungkar. Jika kalian bersyukur kepada Allah atas nikmat-nikmat-Nya dan beriman kepada-Nya, maka akan meridai syukur kalian dan membalasnya. Jiwa yang berdosa tidak memikul dosa jiwa yang lain, akan tetapi setiap jiwa bertanggung jawab atas apa yang dilakukannya. Kemudian kepada Rabb kalian tempat kembali kalian pada hari Kiamat, lalu Rabb kalian memberitahu kalian tentang apa yang kalian perbuat di dunia dan membalas amal-amal kalian. Sesungguhnya Allah Maha mengetahui apa yang ada di dalam hati hamba-hamba-Nya, tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai manusia, jika kalian ingkar terhadap Tuhan kalian, dengan tidak beriman kepada-Nya, para rasul-Nya, dan kitab-kitab-Nya; maka Dia Maha Kaya, tidak membutuhkan kalian; kalianlah yang membutuhkan-Nya, lemah di hadapan-Nya. Allah tidak meridhai kekafiran bagi hamba-Nya dan tidak memerintahkan untuk melakukannya, namun Allah memperingatkan mereka darinya. Akan tetapi Allah hanya meridhai rasa syukur bagi mereka atas kenikmatan yang telah Dia berikan. Tidak ada orang yang akan menanggung dosa orang lain, namun setiap orang akan menanggung dosanya masing-masing. Hanya kepada Allah kalian akan kembali, kemudian Dia akan menyampaikan amal perbuatan kalian yang harus kalian pertanggungjawabkan. Dia Maha Mengetahui segala rahasia dan apa yang tersembunyi dalam hati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ ۖ (dan Dia tidak meridhai kekafiran bagi hamba-Nya) Yakni Allah tidak menyukainya dan tidak memerintahkan hal itu. Namun Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk siapa yang Dia kehendaki. Dan apa yang kalian kehendaki tidak akan terjadi jika Allah menghendakinya; sehingga kehendak-Nya adalah suatu hal sedangkan apa yang Dia cintai adalah hal lain. وَإِن تَشْكُرُوا۟ يَرْضَهُ لَكُمْ (dan jika kamu bersyukur, niscaya Dia meridhai bagimu kesyukuranmu itu) Allah meridhai rasa syukur mereka karena itu adalah sebab kebahagiaan bagi mereka di dunia dan di akhirat. وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ( dan seorang yang berdosa tidak akan memikul dosa orang lain) Yakni seseorang yang berdosa tidak akan menanggung dosa orang lain. ثُمَّ إِلَىٰ رَبِّكُم مَّرْجِعُكُمْ(Kemudian kepada Tuhanmulah kembalimu) Yakni pada hari kiamat. فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ۚ( lu Dia memberitakan kepadamu apa yang telah kamu kerjakan) Baik itu perbuatan baik atau buruk. إِنَّهُۥ عَلِيمٌۢ بِذَاتِ الصُّدُورِ(Sesungguhnya Dia Maha Mengetahui apa yang tersimpan dalam (dada)mu) Yakni mengetahui apa yang disembunyikan hati. Maka bagaimana dengan yang dinampakkan oleh hati?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Wahai manusia, Jika kalian kufur terhadap Allah, sesungguhnya Allah Maha Kaya dengan tanpa keimanan kalian, dan Allah tidak ridha sebab kekufuran kalian, Allah pun tidak memerintahkan kalian untuk menyembahNya, sedang Allah memberikan Rahmat pada mereka, juga Allah berikan siksa pada mereka, dan bersyukurlah padaKu (Allah) wahai para hambaKu, maka mereka akan beriman sebab syukur menjadikan mereka ridla dan mencintai Allah, lalu keimanan ditetapkan atas mereka, karena yang demikian itu adalah sebab yang tidak bisa ditawar. Kalian tidak dihukum sebab dosa yang dilakukan selain dari kalian, kemudian pada Tuhanmulah kamu sekalian akan kembali pada hari kiamat. Tuhanmulah yang akan memberikan kalian pengajaran mengenai kebaikan dan keburukan. Yaitu Allah SWT yang Maha bijaksana yang menciptakan jiwa-jiwa kalian. Tidak ada yang samar sedikitpun bagi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian ingkar, sesungguhnya Allah tidak memerlukan kalian. Dia tidak meridai kekufuran hamba-hambaNya. Jika kalian bersyukur, maka Dia meridhai rasa syukur kalian. Seorang yang berdosa tidak memikul} seorang pendosa tidak akan memikul {dosa orang lain} dosa orang lain {Kemudian kepada Tuhan kalianlah kembali kalian, lalu Dia memberitahukan kepada kalian apa yang telah kalian kerjakan. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan di dalam dada} rahasia-rahasia hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Jika kamu kafir, maka sesungguhnya Allah tidak memerlukanmu.” Artinya, kekafiran kalian tidak akan berpengaruh apa-apa terhadapNYa dan Dia pun tidak beruntung karena ketaatan kalian. Semua perintah dan laranganNYa kepada kalian adalah murni karunia dan kebaikanNya kepada kalian, “dan Dia tidak meridhai kekafiran bagi hambaNya” karena kesempurnaan karuniaNYa terhadap mereka dan ilmuNya bahwa kekafiran akan menyengsarakan mereka dengan kesengsaraan yang mereka sama sekali tidak akan berbahagia sesudahnya, dan karena Dia menciptakan mereka untuk beribadah kepadaNya. Itulah tujuan yang karenanya Dia menciptakan manusia, maka Dia tidak ridha kalau mereka mengabaikan tujuan mereka diciptakan. “Dan jika kamu bersyukur” kepada Allah dengan cara mengesakanNya dan memurnikan agama (ketaatan) kepadaNya, “niscaya Dia meridhainya bagimu,” karena sifat rahmatNya kepada kalian serta karena kalian mengerjakan tujuan kalian diciptakan. Sebagaimana Allah tidak akan dimudaratkan oleh kesyirikan kalian dan tidak pula beruntung karena amal dan tauhid kalian, maka demikian pula tiap orang dari kalian hanya akan memperoleh (balasan) amalnya sendiri-sendiri, yang baik atau yang buruk, “dan seorang yang berdosa tidak akan memikul dosa orang lain. Kemudian kepada Rabbmu-lah kembalimu” pada Hari KIamat, “lalu Dia memberitakan kepadamu apa yang telah kamu kerjakan.” Ini adalah berita yang telah diliputi oleh ilmu pengetahuanNya, telah dicatat oleh penaNya dan telah dicatat oleh para malaikat yang bertugas menjaga amal perbuatan kalian serta telah disaksikan oleh seluruh anggota badan kalian, lalu dia akan memberikan balasan kepada kalian sesuai dengan haknya masing-maisng. “Sesungguhnya Dia Maha Mengetahui apa yang tersimpan dalam dada.” Maksudnya, mengetahui dada itu sendiri dan isinya, seperti sifat baik ataupun sifat buruk. Yang dimaksud dari semua ini adalah pemberitaan tentang pemberian balasan dengan seadil-adilnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 7: (Jika kalian kafir maka sesungguhnya Allah tidak memerlukan kalian dan Dia tidak meridai kekafiran bagi hamba-hambaNya) sekalipun ada di antara hamba-hamba-Nya yang menghendakinya (dan jika kalian bersyukur) kepada Allah, karenanya lalu kalian beriman (niscaya Dia meridai tasyakur) dapat dibaca Yardhah atau Yardhahu, artinya Dia pasti meridai tasyakur (kalian itu; dan tidaklah akan menanggung dosa) yakni seseorang (yang telah berbuat dosa akan dosa) orang (yang lain) maksudnya, seseorang yang berdosa tidak akan memikul dosa orang lain. (Kemudian kepada Rabb kalianlah kembali kalian lalu Dia memberitakan kepada kalian apa yang telah kalian kerjakan. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan dalam dada) dalam kalbu kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bahwa manusia baik beriman atau tidak maka tidak merugikan Allah sedikit pun sebagaimana taat mereka juga tidak memberikan manfaat untuk-Nya, bahkan manfaatnya kembalinya untuk mereka. Perintah dan larangan-Nya kepada mereka adalah murni karunia-Nya dan ihsan-Nya kepada mereka. Karena sempurnanya ihsan-Nya kepada mereka, dan karena Dia tahu bahwa kekafiran akan membuat mereka celaka dan tidak akan bahagia setelahnya. Di samping itu, karena Dia menciptakan mereka untuk beribadah kepada-Nya. Yaitu dengan mentauhidkan-Nya dan mengikhlaskan ibadah karena-Nya. Karena sayang-Nya kepada kamu, dan karena kecintaan-Nya untuk berbuat ihsan kepada kamu dan karena kamu telah mengerjakan tujuan yang karenanya kamu diciptakan. Oleh karena syirk dan kekafiranmu tidak merugikan-Nya, dan Dia tidak mengambil manfaat dengan amalmu, maka masing-masing kamu untuknya amalnya, baik atau buruk, dan seorang yang berdosa tidak memikul dosa orang lain, bahkan masing-masing memikul dosanya sendiri- sendiri. Pada hari Kiamat. Dia akan memberitakan sesuai ilmu-Nya yang meliputi segala sesuatu, sesuai yang tercatat oleh pena-Nya, sesuai yang tercatat oleh para malaikat hafazhah (para penjaga manusia) yang mulia dan sesuai yang disaksikan oleh anggota badan, kemudian Dia akan memberi balasan masing-masingnya dengan balasan yang sesuai. Baik atau buruk. Maksud ayat ini adalah memberitakan pembalasan-Nya yang sangat adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 7",
    "description": "Allah mahakuasa; dialah yang menguasai kerajaan langit dan bumi. Jadi, jika kamu tetap kafir maka ketahuilah bahwa sesungguhnya Allah mahakaya dan tidak memerlukanmu sehingga dia tidak akan rugi sedikit pun meski kamu ingkar. Dan dia, karena kasih sayangnya, tidak meridai kekafiran hamba-hamba-Nya karena dia tidak ingin mereka merugikan diri sendiri. Jika kamu bersyukur dengan cara beribadah kepada-Nya dan menaati-Nya, dia meridai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain karena masing-masing bertanggung jawab atas perbuatannya sendiri. Kemudian, kepada tuhanmulah tempat kembalimu di akhirat nanti untuk dihisab, lalu dia beritakan kepadamu balasan yang layak untukmu atas apa yang telah kamu kerjakan di dunia. Sungguh, dia maha mengetahui apa saja yang tersimpan dalam dada dan tebersit dalam hati. 8. Ayat ini berbicara tentang tabiat manusia. Dan apabila manusia ditimpa bencana, kesulitan, atau apa saja yang tidak menyenangkan, dia memohon pertolongan kepada tuhannya dengan kembali taat dan mendekatkan diri kepada-Nya. Tetapi apabila dia memberikan nikmat, kekayaan, atau sesuatu yang menyenangkan kepadanya, dia lupa akan bencana yang pernah dia berdoa kepada Allah agar selamat darinya sebelum kenikmatan itu datang, dan diadakannya sekutu-sekutu bagi Allah untuk menyesatkan manusia dari jalan-Nya, yaitu islam. Wahai nabi Muhammad, katakanlah kepada mereka, 'bersenang-senanglah kamu sementara waktu dengan kekafiranmu itu sampai kematian menjemputmu. Sungguh, kamu termasuk penghuni neraka di akhirat kelak. '."
  }
]