[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah memberikan balasan kepada setiap jiwa atas apa yang dilakukannya secara sempurna, berupa kebaikan maupun keburukan. Dan Dia lebih mengetahui tentang apa yang mereka lakukan di dunia, baik berupa ketaatan maupun kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Allah menyempurnakan balasan setiap jiwa, apakah amalnya baik atau buruk. Allah lebih mengetahui apa yang mereka perbuat, tidak ada sedikit pun dari amal-amal mereka yang samar bagi Allah, baik atau buruk. Dan pada hari itu Allah akan membalas mereka atas amal-amal mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ (Dan disempurnakan bagi tiap-tiap jiwa (balasan) apa yang telah dikerjakannya) Baik itu perbuatan baik maupun buruk. وَهُوَ(dan Dia) Yakni Allah. أَعْلَمُ بِمَا يَفْعَلُونَ(lebih mengetahui apa yang mereka kerjakan) Yakni yang mereka kerjakan di dunia. Allah tidak butuh kepada orang yang membantunay menulis, menghitung, atau menyaksikan amal perbuatan mereka. Dan Allah memberikan kitab catatan amal dan mendatangkan para nabi dan saksi hanya untuk menyempurnakan hujjah atas mereka dan menghalangi mereka untuk beralasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Setiap orang akan menerima haknya. Tidak ada sedikitpun amal baik atau buruk, ketaatan atau kemaksiatan yang dilakukan di dunia kecuali Allah mengetahui semuanya. tanpa butuh pencatat, saksi maupun penghitung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia paling tahu tentang apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Maka dari itu Dia berfirman, “Dan dipenuhi bagi tiap-tiap jiwa apa yang telah dikerjakannya dan Dia lebih mengetahui apa yang mereka kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 70: (Dan disempurnakan bagi tiap-tiap jiwa apa yang telah dikerjakannya) yakni balasannya (dan Dia lebih mengetahui) (apa yang mereka kerjakan) maka Dia tidak membutuhkan saksi lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 70",
    "description": "Dan sebagai bukti atas keadilan putusan itu, kepada setiap jiwa diberi balasan yang setimpal dengan sempurna sesuai dengan apa yang telah di-kerjakannya, dan dia Allah hakim yang maha adil lebih mengetahui apa yang mereka kerjakan. 71. Pada ayat yang lalu dinyatakan bahwa di padang mahsyar digelar peradilan yang mengadili setiap perbuatan manusia, dan Allah akan menjatuhkan putusan-Nya dalam peradilan itu dengan seadil-adilnya tanpa ada yang dirugikan. Pada ayat-ayat berikut digambarkan bagai-mana putusan itu dilaksanakan. Pada waktu itu, orang-orang yang kafir digiring ke pintu neraka jahanam secara berombongan. Sehingga apabila mereka telah sampai kepadanya yakni ke neraka, kemudian pintu-pintunya dibukakan, dan penjaga-penjaga neraka itu berkata kepada mereka, 'apakah sebelum ini belum pernah datang kepadamu rasul-rasul yang dipilih dari kalangan masyarakat kamu sendiri, yang membacakan ayat-ayat tuhanmu, dan juga memperingatkan kepadamu akan keniscayaan pertemuan dengan harimu ini'' mereka menjawab, 'benar, para rasul memang ada dan telah memperingatkan kami tentang hari ini, tetapi kami mendustakannya. ' namun demikian, ketetapan azab pasti tetap berlaku terhadap orang-orang kafir."
  }
]