[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang kafir kepada Allah dan rasul-rasulNya digiring ke Neraka Jahanam secara berbondong-bondong. Ketika mereka tiba di depannya, para malaikat penjaga membuka tujuh pintunya lalu menghardik mereka sambil berkata, “Bagaimana kalian mendurhakai Allah dan mengingkari bahwa Dia adalah Tuhan Yang Haq semata? Bukankah Dia telah mengutus para rasul dari kalangan kalian sendiri yang membacakan ayat-ayat Tuhan kalian kepada kalian dan memperingatkan kalian tentang beratnya beban di hari ini?” mereka menjawab dengan penuh pengakuan terhadap dosa-dosa mereka, “Benar, para rasul Tuhan kami telah datang kepada kami dengan membawa kebenaran, dan mereka telah memperingatkan kami akan kebenaran hari ini” Hanya saja kalimat Allah telah ditetapkan bahwa siksaNya akan menimpa orang-orang yang kafir kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Para Malaikat menggiring orang-orang yang kafir kepada Allah ke neraka Jahanam secara berombongan dalam keadaan hina dina. Ketika mereka tiba di sana, para malaikat yang bertugas di sana membuka pintu-pintunya, para malaikat itu menyambut mereka dengan celaan seraya berkata kepada mereka, “Bukankah telah datang kepada kalian para rasul dari kalangan kalian sendiri, yang membacakan kepada kalian ayat-ayat Rabb kalian yang diturunkan kepada mereka, dan memperingatkan kalian dengan perjumpaan hari Kiamat dan juga azab yang keras ketika itu?\" Orang-orang kafir menjawab dengan pengakuan atas diri mereka, “Benar, semua itu benar, akan tetapi kalimat azab telah wajib atas orang-orang kafir dan kami adalah orang-orang kafir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-72. Orang-orang kafir digiring ke neraka secara berkelompok dalam keadaan terhina. Hingga ketika mereka telah sampai di neraka, dibukalah tujuh pintunya. Dan para malaikat penjaga neraka berkata mereka: “Bukanlah para rasul dari golongan kalian telah datang kepada kalian untuk membacakan ayat-ayat Allah dan memperingatkan kalian dari hari yang berat ini?” Mereka menjawab: “benar, akan tetapi telah ditetapkan azab bagi orang-orang kafir akibat dosa-dosa mereka.” Dan dikatakan kepada mereka: “Masukilah pintu-pintu neraka yang telah terbuka, kalian akan tinggal di dalamnya selamanya. Sungguh seburuk-buruk tempat tinggal yang kekal adalah neraka Jahannam bagi orang-orang yang enggan mengikuti kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَسِيقَ الَّذِينَ كَفَرُوٓا۟ إِلَىٰ جَهَنَّمَ زُمَرًا ۖ (Orang-orang kafir dibawa ke neraka Jahannam berombong-rombongan) Yakni orang-orang kafir digiring ke neraka dengan berkelompok-kelompok, setiap kelompok memiliki pemimpin yang merupakan pemimpin mereka dalam kekafiran dan orang yang menyesatkan mereka. حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتْ أَبْوٰبُهَا(Sehingga apabila mereka sampai ke neraka itu dibukakanlah pintu-pintunya) Agar mereka memasukinya. Dan pintu-pintu itu berjumlah tujuh pintu. وَقَالَ لَهُمْ خَزَنَتُهَآ(dan berkatalah kepada mereka penjaga-penjaganya) Yakni para malaikat yang bertugas menjaga neraka. أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ(Apakah belum pernah datang kepadamu rasul-rasul di antaramu) Yakni rasul-rasul yang berasal dari kaum kalian. يَتْلُونَ عَلَيْكُمْ ءَايٰتِ رَبِّكُمْ (yang membacakan kepadamu ayat-ayat Tuhanmu) Yang Dia turunkan kepada mereka. وَيُنذِرُونَكُمْ لِقَآءَ يَوْمِكُمْ هٰذَا ۚ (dan memperingatkan kepadamu akan pertemuan dengan hari ini?”) Yakni menakut-nakuti kalian dari hari pertemuan yang kalian hadapi sekarang ini. قَالُوا۟ بَلَىٰ( Mereka menjawab: “Benar (telah datang)”) Yakni para rasul telah mendatangi kami dengan ayat-ayat Allah, serta telah memperingatkan kami terhadap apa yang akan kami hadapi. وَلٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكٰفِرِين(Tetapi telah pasti berlaku ketetapan azab terhadap orang-orang yang kafir)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Orang-orang kafir digiring dengan celaan dan hinaan menuju neraka secara berbondong-bondong dan berurutan. Mereka diurutkan sesuai urutan dan tingkat kekufuran dan kedurhakaan mereka. Sehingga ketika telah sampai di neraka, kemudian pintu neraka terbuka, yang berjumlah tujuh pintu. Kemudian penjaga neraka yaitu malaikat Zabaniyah berkata mereka dengan pencelaan dan penghinaan: “Apa belum pernah diutus rasul kepada kalian sebelumnya, yang membacakan ayat-ayat Tuhanmu yang diturunkan kepadamu? Mereka para rasul telah menghawatirkan kalian ketika hari yang menakutkan ini datang kepada kalian.” Kemudian mereka menjawab: “Benar, mereka telah datang kepada kami, namun azab wajib bagi orang-orang kafir, kalimat tersebut adalah perkataan Allah dalam surat Assajadah ayat 13."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ingkar digiring ke neraka Jahanam secara berombongan} rombongan-rombongan yang berbeda satu sama lain {sehingga apabila mereka telah sampai di sana, pintu-pintunya dibuka dan para penjaganya berkata kepada mereka} penjaga neraka Jahanam yaitu malaikat Zabaniyah yang merupakan makhluk paling kejam dan sangat kuat {“Apakah belum pernah datang kepada kalian rasul-rasul dari kalangan kalian} dari jenis kalian {yang membacakan untuk kalian ayat-ayat Tuhan kalian dan memperingatkan kalian} memperingatkan kalian {tentang pertemuan dengan hari kalian ini” Mereka menjawab,“Benar” Akan tetapi ketetapan azab} ketentuan Allah tentang azab {pasti berlaku} pasti berlaku Pterhadap orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Setelah Allah menjelaskan keputusanNya di antara hamba-hambaNya yang telah menghimpun mereka dalam ciptaanNYa, rizkiNya dan kendaliNYa, serta perkumpulan mereka di padang Mahsyar di Hari Kiamat, maka Allah memisah-misahkan mereka di saat mereka diberi balasan, sebagaimana mereka telah terpisah-pisah waktu di dunia dengan iman dan kekafiran, takwa dan kedurhakaan, seraya berfirman, “Orang-orang kafir digiring ke Neraka Jahanam,” secara kasar dank eras, mereka dicambuk dengan cambuk yang menyakitkan oleh malaikat Zabaniyah yang sangat kasar lagi ganas, menuju tempat penjara yang terburuk, tempat yang paling keji, yaitu Jahanam yang telah penuh dengan berbagai bentuk siksaan dan dipenuhi oleh setiap kesengsaraan dan tidak ada sama sekali di dalamnya setiap rasa kebahagiaan, sebagaimana difirmankan oleh Allah, “pada hari mereka didorong ke neraka Jahanam dengan sekuat-kuatnya.” (At-Thur:13). Maksudnya, mereka di dorong secara paksa ke dalamnya sekuat-kuatnya, hal itu karena mereka tidak mau masuk kedalamnya, dan mereka digiring kepadanya secara “berombong-rombongan,” yakni, secara berkelompok-kelompok yang berbeda-beda, setiap rombongan bersama rombongan yang sesuai amal perbuatannya dan serupa dengan usahanya, di mana sebagian di antara mereka mengutuk sebagian yang lain dan sebagian ada yang berlepas diri dari sebagian yang lain. “Sehingga apabila mereka telah sampai ke sana,” maksudnya, mereka telah tiba di halamannya, “dibukakan,” untuk mereka , maksudnya, demi mereka, “pintu-pintunya,” karena kedatangan mereka dan sebagai sambutan atas kedatangan mereka. “Dan berkatalah kepada mereka penjaga-penjaganya,” seraya mengucapkan selamat atas kesengsaraan abadi dan azab yang kekal, dan sambil menjelek-jelekkan mereka atas amal perbuatan yang telah mengantar mereka kepada tempat yang sangat keji ini, “Apakah belum pernah datang kepadamurasul-rasul di antaramu,” maksudnya, dari bangsa kalian sendiri, yang kalian mengenal mereka, kalian mengenali kejujuran mereka dan kalian sangat memungkinkan untuk belajar kepada mereka, “yang membacakan kepadamu ayat-ayat Rabbmu,” yang untuk itu mereka diutus oleh Allah, yang membuktikan kebenaran yang meyakinkan dengan argument-argumen yang paling jelas, “dan memperingatkan kepadamu akan pertemuan dengan hari ini?” maksudnya, hal ini memastikan terhadap kalian untuk mengikuti mereka dan waspada terhadap siksaan di Hari Kiamat ini dengan menggunakan takwa kepadaNya. Dan sesungguhnya keadaan kalian berlawanan dengan keadaan ini. “Mereka menjawab” dengan mengakui dosa mereka dan bahwasanya hujjah Allah telah ditegakkan terhadap mereka, “Benar.” Telah datang rasul-rasul Rabb kami kepada kami dengan ayat-ayatNya dan bukti-buktiNYa, dan mereka juga telah memperingatkan kepada kami akan hari pertemuan ini. “Tetapi telah pasti berlaku ketetapan azab terhadap orang-orang yang kafir.” Maksudnya, disebabkan kekafiran mereka, maka ketetapan azab menjadi pasti atas mereka, yang telah ditetapkan bagi setiap orang yang kair kepada ayat-ayat Allah dan mengingkari apa-apa yang dibawa oleh para rasul. Jadi, mereka mengakui dosa mereka dan tegaknya hujjah atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 71: (Dan orang-orang kafir dibawa) dengan secara keras dan paksa (ke neraka Jahanam berombong-rombongan) secara bergelombang lagi terpisah-pisah. (Sehingga apabila mereka sampai ke neraka itu dibukakanlah pintu-pintunya) ayat ini menjadi Jawab dari lafal Idzaa (dan berkatalah kepada mereka penjaga-penjaganya, \"Apakah belum pernah datang kepada kalian rasul-rasul di antara kalian yang membacakan kepada kalian ayat-ayat Rabb kalian) yakni Alquran dan kitab-kitab lainnya (dan memperingatkan kepada kalian akan pertemuan dengan hari ini?\" Mereka menjawab, \"Benar telah datang.\" Tetapi telah pasti berlaku ketetapan azab) yakni sebagaimana yang diungkapkan oleh firman-Nya yang lain, yaitu, \"Sesungguhnya akan Aku penuhi neraka Jahanam...\" (Q.S. As-Sajdah, 13) (terhadap orang-orang yang kafir)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keputusan-Nya yang adil di antara hamba-hamba-Nya, dimana Dia telah mengumpulkan mereka dalam penciptaan, rezeki dan pengaturan-Nya, dan mereka berkumpul di padang mahsyar sebagaimana mereka sebelumnya berkumpul ketika di dunia, maka Dia memisahkan mereka saat hendak diberikan balasan sebagaimana mereka berpisah di dunia karena alasan keimanan dan kekafiran, ketakwaan dan kemaksiatan. Yakni digiring dengan keras dengan cambuk yang menyakitkan oleh malaikat Zabaniyah yang keras dan kasar menuju penjara terburuk yang ada di alam semesta, yaitu neraka Jahanam yang menghimpun semua azab dan yang dimasuki oleh orang-orang yang celaka, dimana setelah memasukinya maka tidak ada lagi kesenangan dan kegembiraan. Mereka digiring dengan keras sebagaimana firman Allah Ta’ala, “Pada hari mereka didorong ke neraka Jahannam dengan sekuat- kuatnya.” (Terj. Ath Thuur: 13) Hal itu karena mereka enggan memasukinya. Yakni mereka masuk ke neraka secara berombongan, masing-masing rombongan bersama rombongan yang sama dan sejenis amalnya, ketika itu satu sama lain saling laknat-melaknat dan saling berlepas diri. Sambil memberikan selamat atas kesengsaraan yang terus menerus untuk mereka dan mencela mereka atas amal yang mereka kerjakan sehingga menyampaikan mereka ke tempat yang buruk itu. Yakni dari jenis kamu yang kamu kenal kejujuran mereka dan kamu dapat menimba ilmu dari mereka. Yang Allah utus para rasul dengan membawanya, dimana ayat-ayat itu menunjukkan kepada kebenaran yang yakin dengan bukti yang paling jelas. Peringatan itu seharusnya membuat kamu mengikuti mereka (para rasul) dan berhati-hati terhadap azab pada hari ini, yaitu dengan bertakwa, tetapi ternyata keadaanmu tidak demikian. Mengakui kesalahan mereka dan bahwa hujjah Allah telah tegak atas mereka. Yakni para rasul telah datang kepada kami dengan membawa ayat-ayat-Nya dan bukti-bukti terhadap kebenarannya, mereka juga telah menerangkan kepada kami dengan sebenar-benarnya dan memperingatkan kami terhadap hari ini. Yaitu ketetapan Allah Subhaanahu wa Ta'aala untuk memenuhi neraka Jahanam dengan kebanyakan jin dan manusia, bagi mereka yang kafir kepada ayat-ayat Allah dan mengingkari apa yang dibawa para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 71",
    "description": "Pada ayat yang lalu dinyatakan bahwa di padang mahsyar digelar peradilan yang mengadili setiap perbuatan manusia, dan Allah akan menjatuhkan putusan-Nya dalam peradilan itu dengan seadil-adilnya tanpa ada yang dirugikan. Pada ayat-ayat berikut digambarkan bagai-mana putusan itu dilaksanakan. Pada waktu itu, orang-orang yang kafir digiring ke pintu neraka jahanam secara berombongan. Sehingga apabila mereka telah sampai kepadanya yakni ke neraka, kemudian pintu-pintunya dibukakan, dan penjaga-penjaga neraka itu berkata kepada mereka, 'apakah sebelum ini belum pernah datang kepadamu rasul-rasul yang dipilih dari kalangan masyarakat kamu sendiri, yang membacakan ayat-ayat tuhanmu, dan juga memperingatkan kepadamu akan keniscayaan pertemuan dengan harimu ini'' mereka menjawab, 'benar, para rasul memang ada dan telah memperingatkan kami tentang hari ini, tetapi kami mendustakannya. ' namun demikian, ketetapan azab pasti tetap berlaku terhadap orang-orang kafir. 72. Setelah mendengar pengakuan itu, seketika dikatakan kepada orang-orang kafir itu, 'masukilah pintu-pintu neraka jahanam itu se-suai dengan tingkat kedurhakaan yang kalian lakukan, dan kamu akan kekal di dalamnya selama-lamanya. ' maka sungguh neraka jahanam itulah seburuk-buruk tempat tinggal bagi orang-orang yang angkuh dan menyombongkan diri."
  }
]