[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepada orang-orang yang mengingkari bahwa Allah adalah Tuhan Yang Haq sebagai sebuah perendahan dan penghinaan bagi mereka, “Masuklah kalian melalui pintu-pintu Jahanam dan kalian akan tinggal di dalamnya untuk selama-lamanya.” Maka sangatlah buruk tempat kembali bagi orang-orang yang menyombongkan diri untuk beriman kepada Allah dan melaksanakan SyariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Kepada mereka dikatakan sebagai bentuk penghinaan, pemutus harapan dari rahmat Allah dan dari peluang keluar dari Neraka, “Masuklah ke pintu-pintu Jahanam untuk tinggal di dalamnya selama-lamanya. Sungguh buruk dan hina tempat tinggal orang-orang yang menyombongkan diri dan tinggi hati melawan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. قِيلَ ادْخُلُوٓا۟ أَبْوٰبَ جَهَنَّمَ (Dikatakan (kepada mereka): “Masukilah pintu-pintu neraka Jahannam itu) Setelah mereka mengatakan pengakuan mereka ini, lalu dikatakan kepada mereka: “masukilah pintu-pintu Jahannam ini yang telah dibukakan untuk kalian” خٰلِدِينَ (sedang kamu kekal di dalamnya”) Allah metetapkan bahwa kalian akan kekal di dalamnya. فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ(Maka neraka Jahannam itulah seburuk-buruk tempat bagi orang-orang yang menyombongkan diri) Yakni seburuk-buruk tempat yang kekal bagi mereka adalah neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Dikatakan kepada mereka: “Masuklah kalian ke pintu-pintu neraka yang telah terbuka untuk kalian. Kalian akan kekal dalam neraka selamanya, Jahannam adalah tempat yang paling buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikatakan,“Masukilah pintu-pintu neraka Jahanam dengan keadaan kekal di dalamnya” Maka itulah seburuk-buruk} seburuk-buruk {tempat tinggal} tempat kembali dan tinggal {bagi orang-orang yang sombong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Maka dikatakan kepada mereka seraya mencela dan menghina “Masukilah pintu-pintu Neraka Jahanam itu.” Setiap golongan masuk lewat pintu yang sesuai dengannya dan sejalan dengan amal perbuatannya “sedang kamu kekal didalamnya” selama-lamanya. Mereka tidak dikeluarkan darinya dan tidak pula azab itu dihentikan sesaat pun, dan tidak pula mereka diberi tangguhan waktu. “Maka Neraka jahanam itulah seburuk-buruk tempat bagi orang-orang yang menyombongkan diri.” Maksudnya, seburuk-buruk tempat adalah neraka, tempat tinggal mereka. Yang demikian itu disebabkan karena mereka telah menyombongkan diri terhadap kebenaran, maka dari itu Allah memberikan pembalasan kepada mereka dari jenis perbuatan mereka sendiri, yaitu dihinakan, dinistakan, dan dicampakkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 72: (Dikatakan kepada mereka, \"Masukilah pintu-pintu Jahanam itu, sedangkan kalian kekal di dalamnya\") yakni kalian telah ditetapkan untuk menjadi penghuni yang abadi. (Maka seburuk-buruk tempat) maksudnya, tempat tinggal (orang-orang yang menyombongkan diri) adalah Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menghinakan dan merendahkan. Masing-masing golongan memasuki pintu yang sesuai dengan amal mereka. Yakni kamu tidak akan pindah darinya dan azab tidak akan diringankan atasmu. Karena mereka menyombongkan diri terhadap kebenaran, maka Allah membalas dengan balasan yang sesuai, yaitu penghinaan dan perendahan untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 72",
    "description": "Setelah mendengar pengakuan itu, seketika dikatakan kepada orang-orang kafir itu, 'masukilah pintu-pintu neraka jahanam itu se-suai dengan tingkat kedurhakaan yang kalian lakukan, dan kamu akan kekal di dalamnya selama-lamanya. ' maka sungguh neraka jahanam itulah seburuk-buruk tempat tinggal bagi orang-orang yang angkuh dan menyombongkan diri. 73. Dan pada waktu yang bersamaan orang-orang yang bertakwa kepada tuhannya dan beramal saleh, diantar ke dalam surga secara berombongan. Sehingga apabila mereka telah sampai kepadanya yakni ke pintu surga dan kemudian pintu-pintunya telah dibukakan, penjaga-penjaganya berkata kepada mereka, 'kesejahteraan senantiasa dilimpahkan atasmu, berbahagialah kamu! maka masuklah dengan suka cita, dan kamu kekal menetap di dalamnya untuk selama-lamanya. '."
  }
]