[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang bertakwa kepada Tuhan mereka dengan mentauhidkanNya dan mengamalkan perintahNya digiring ke surga dengan berkelompok-kelompok, hingga ketika mereka tiba di depannya, Nabi meminta kepada Allah agar pintu-pintu surga dibuka, maka ia pun dibuka, para malaikat penjaga surga menyambutnya, memberikan penghormatan kepada mereka dengan penuh kebahagiaan dan suka cita karena kesucian mereka dari noda-noda kemaksiatan seraya berkata kepada mereka, “Selamat untuk kalian, kalian selamat dari segala cacat, kehidupan kalian adalah baik. Masuklah kalian kedalam surga dan kalian kekal di dalamnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Para malaikat menuntun dengan lemah lembut orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya ke Surga dengan berkelompok-kelompok seraya dihormati, hingga saat mereka datang di depan pintu-pintunya, ia dibuka bagi mereka, dan para malaikat yang menjaganya menyambut mereka dengan mengatakan, “Selamat atas kalian dari segala bencana dan segala perkara yang tidak kalian harapkan, hati dan amal kalian baik, silakan kalian masuk Surga untuk tinggal di dalamnya selama-lamanya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73-74. Sedangkan orang-orang bertakwa dibawa ke surga secara berkelompok dalam keadaan mulia. Hingga saat mereka telah sampai di sana, dibukakan delapan pintu-pintunya dengan sambutan yang baik dari para malaikat penjaga surga: “Semoga keselamatan bagi kalian dari segala keburukan, sungguh baik jiwa dan keadaan kalian. Masuklah ke dalam surga dan tinggallah di dalamnya selama-lamanya.” Kemudian para penghuni surga itu berkata: “Segala puji bagi Allah yang telah memenuhi janji-Nya dengan memberi balasan bagi kami tempat tinggal di surga, kami dapat tinggal di dalamnya sesuka kami. Sungguh sebaik-baik balasan bagi orang-orang yang mengerjakan ketaatan adalah surga.” Diriwayatkan dari ‘Ashim bin Dhamrah, ia berkata; aku pernah mendengar Ali berkata: “Ketika para penghuni surga berjalan menuju surga, mereka melewati sebuah pohon yang mengeluarkan dua mata air dari bawah dua batangnya. Maka mereka menuju pohon tersebut seakan-akan mereka diperintahkan untuk mendatanginya; kemudian mereka membersihkan diri pada mata air itu, maka memancarlah dari mereka wajah yang berseri-seri.” Ia berkata, “maka kulit mereka tidak akan berubah selamanya sejak saat itu tidak pula rambut mereka menjadi kusam selamanya, seperti rambut yang telah olesi minyak.” Ia melanjutkan, “Kemudian mereka menuju mata air yang lain, kemudian mereka minum dari airnya, maka hilanglah segala kotoran dan penyakit yang ada di dalam perut mereka. Lalu para malaikat menjumpai mereka seraya berkata: “Kesejahteraan bagi kalian semua, berbahagialah; dan masuklah ke dalam surga ini dan kalian akan kekal di dalamnya”. Kemudian mereka disambut gembira oleh para pelayan muda mereka, seperti anak-anak muda yang menyambut orang yang mereka cintai yang baru datang dari perjalanan panjang. Para pelayan muda itu berkata: “Bergembiralah, karena Allah telah menyiapkan bagi tuan kemulian seperti ini.” Lalu sebagian pelayan muda itu menuju para bidadari yang menjadi pasangan penghuni surga itu dan berkata: “Ini adalah si fulan -dengan menyebutkan namanya ketika di dunia-, dia telah datang. Maka para bidadari itu bertanya: “Apakah kalian telah melihatnya?” Para pelayan muda itu menjawab: “Iya.” Maka karena saking gembiranya, para bidadari itu segera bangkit berdiri di ambang pintu. Kemudian penghuni surga itu memasuki surga, dan ternyata telah terbentang permadani-permadani yang indah, gelas-gelas yang tersusun rapi, dan bantal-bantal terjejer. Maka dia bersandar pada salah satu dipannya, lalu melihat pondasi istananya, dan ternyata itu dibangun di atas batu mutiara yang berwarna kuning, merah, hijau, dan warna-warna lainnya. (Diriwayatkan oleh Ibnu Abi Syaibah dengan sanad hasan, al-Mushannaf 8/74)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَسِيقَ الَّذِينَ اتَّقَوْا۟ رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا ۖ (Dan orang-orang yang bertakwa kepada Tuhan dibawa ke dalam surga berombong-rombongan) Yakni para malaikat mengarak mereka ke surga dengan penuh pemuliaan dan penghormatan. حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتْ أَبْوٰبُهَا(Sehingga apabila mereka sampai ke surga itu sedang pintu-pintunya telah terbuka) Untuk menyambut mereka. وَقَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَيْكُمْ(dan berkatalah kepada mereka penjaga-penjaganya: “Kesejahteraan (dilimpahkan) atasmu) Yakni keselamatan bagi kalian dari segala keburukan. طِبْتُمْ(Berbahagialah kamu!) Yakni kalian telah berlaku baik di dunia sehingga kalian tidak terkotori oleh kemusyrikan dan kemaksiatan. فَادْخُلُوهَا(maka masukilah surga ini) Yakni masuklah ke dalam surga. خٰلِدِينَ (sedang kamu kekal di dalamnya”) Kalian tidak akan mati dan sirna di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Adapun orang-orang yang bertakwa digiring untuk menerima ganjaran dari Tuhan mereka dengan penuh kelembutan menuju tempat yang mulia dan penuh kegembiraan bagi mereka. Digiring berbondong-bondong sesuai derajat keimanan dan ketaatan mereka. Sehingga ketika mereka telah sampai dan pintu-pintu telah terbuka dengan penuh pemuliaan dan penyambutan kepada mereka. Kemudian penjaganya berkata: “Salam dan keselamatanlah bagi kalian dadri segala marabahaya dan kesulitan. Kalian sungguh dalam keadaan yang baik sebab kalian suci dari dosa dan maksiat. Maka masuklah kalian ke dalam surga, kalian akan kekal di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang bertakwa kepada Tuhan mereka diantar ke dalam surga secara berombongan} kelompok demi kelompok sesuai perbedaan posisi mereka dalam hal keutamaan dan ketinggian derajat {sehingga apabila mereka telah sampai di sana dan pintu-pintunya telah dibuka, para penjaganya} penjaga surga {berkata kepada mereka, semoga keselamatan tercurah kepada kalian, berbahagialah kalian} berbahagialah hati dan amal kalian {Maka masuklah ke dalamnya dengan keadan kekal} menetap di dalamnya selama-lamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Kemudian Allah berfirman tentang para penghuni surge, “Dan orang-orang yang bertakwa kepada Rabbnya dibawa,” karena telah mengesakanNya dan beramal melakukan ketaatan kepadaNya, mereka digiring dengan penuh penghormatan dan pemuliaan, mereka dihimpun sebagai delegasi atas para malaikat yang mulia, “ke surge berombong-rombongan pula,” dengan riang gembira dan senang hati, setiap rombongan beserta rombongan yang sesuai dengan amal perbuatannya. “Sehingga apabila mereka sampai ke sana,” maksudnya, mereka tiba ke tempat yang sangat lapang dan tempat-tempat tinggal yang unik itu, dan aroma wangi dan angin sepoi-sepoinya bertiup menghembusi mereka, dan telah tiba saat kekekalan dan kenikmatannya, “sedang telah dibuka” untuk mereka “pintu-pintunya,” dibuka sebagai penghormatan untuk manusia-manusia yang mulia, agar mereka dimuliakan di dalamnya, “maka berkatalah kepada mereka penjaga-penjaganya” sebagai ucapan selamat dan sambutan hangat untuk mereka, “Kesejahtraan atasmu,” maksudnya, keselamatan dari segala keburukan telah menjadi milik kalian. “Berbahagialah kamu,” maksudnya, berbahagialah hati kalian dengan ma’rifatullah, mencintaiNYadan takut kepadaNya, dan lisan kalian dengan berdzikir mengingatNya, serta anggota-anggota tubuh kalian dengan ketaatan kepadaNya “maka” disebabkan kebahagiaan kalian “masukilah surge ini, sedang kamu kekal didalamnya,” sebab ia adalah negeri yang suci dan tidak pantas menghuninya kecuali orang-orang yang suci pula. Dan tentang neraka, Allah berfirman, sedangkan tentang surge Dia berfirman, dengan menggunakan huruf wau, adalah sebagai isyarat bahwa saat para penghuni neraka tiba di (depan pintunya), pintu-pintu neraka itu pun langsung dibuka tanpa menunggu-nunggu lagi atau menunda-nunda waktu, dan agar saat pembukaannya di hadapan muka mereka dan saat mereka tiba, panasnya terasa lebih hebat dan azabnya lebih dahsyat. Adapun surge adalah negeri yang sangat tinggi lagi mahal yang tidak akan bisa dicapai dan tidak bisa diraih oleh setiap orang kecuali orang-orang yang telah memenuhi berbagai wasa’il (sarana dan persyaratan) yang dapat mengantarkannya kepadanya. Dan di samping itu pula mereka masih memerlukan syafaatnya pemberi syafaat termulia untuk bisa memasukinya. Surge tidak langsung dibukakan untuk mereka saat mereka sampai di hadapannya. Akan tetapi mereka harus meminta syafaat kepada Allah melalui Nabi Muhammad hingga beliau memberikan syafaatnya, lalu Allah memperkenankan syafaat beliau. Pada ayat-ayat di atas terdapat satu dalil yang menunjukkan bahwa neraka dan surge mempunyai pintu-pintu yang dapat dibuka dan ditutup, dan masing-masing dari keduanya memiliki para penjaga atau petugas. Keduanya adalah negeri yang khusus yang tidak akan dimasuki kecuali oleh manusia-manusia yang berhak untuk menempatinya. Keduanya sangat berbeda dengan tempat-tempat tinggal dan negeri-negeri lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 73: (Dan orang-orang yang bertakwa kepada Rabbnya dibawa) dengan lemah lembut (ke dalam surga berombong-rombongan pula, sehingga apabila mereka sampai ke surga itu pintu-pintunya telah dibuka) huruf Wau dalam ayat ini menunjukkan makna Hal dengan diperkirakan adanya lafal Qad sesudahnya (dan berkatalah kepada mereka penjaga-penjaganya, \"Kesejahteraan atas kalian, berbahagialah kalian) lafal Thibtum menjadi Hal (maka masukilah surga ini, sedangkan kalian kekal di dalamnya\") telah ditetapkan untuk menjadi penghuni yang abadi di dalamnya. Jawab lafal Idzaa diperkirakan keberadaannya, yakni lalu mereka memasukinya. Dan dibawanya orang-orang yang bertakwa ke dalam surga serta dibukakannya pintu-pintu surga sebelum mereka datang, hal ini sebagai penghormatan buat mereka. Sedangkan digiringnya orang-orang kafir serta dibukakannya pintu-pintu neraka Jahanam sewaktu mereka datang dimaksud sebagai hinaan buat mereka agar panas neraka Jahanam itu dapat dirasakan oleh mereka sebelum memasukinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian Allah Subhaanahu wa Ta'aala berfirman tentang penghuni surga. Mereka diantar dengan penghormatan dan pemuliaan. Masing-masing rombongan bersama rombongan yang sama amalnya. Penggiringan penghuni surga dan dibukakan pintu-pintunya kepada mereka adalah sebagai penghormatan kepada mereka, sedangkan penggiringan penghuni neraka dengan dibuka pintu-pintunya ketika mereka datang agar mereka merasakan panasnya sebagai penghinaan bagi mereka. Terhadap neraka Allah Subhaanahu wa Ta'aala berfirman, “Futihat abwaabuhaa”(artinya: dibuka pintu-pintunya, tanpa kata “wa” artinya “dan”), sedangkan terhadap surga, Allah Subhaanahu wa Ta'aala berfirman, “Wa futihat abwaabuhaa” (dan dibuka pintu-pintunya, dengan tambahan “wa”), di sana terdapat isyarat bahwa penghuni neraka, saat mereka sampai ke neraka, maka pintu-pintunya langsung dibuka tanpa ditunda dan diberi penangguhan agar mereka merasakan panasnya dan merasakan besarnya azab neraka. Sedangkan surga yang merupakan tempat yang tinggi dan mahal, dimana belum dibukakan ketika mereka tiba di sana. Mereka butuh untuk memasukinya syafaat manusia yang paling mulia, sehingga mereka meminta syafaat kepada Allah Subhaanahu wa Ta'aala agar Beliau membukakan. Di dalam hadits, Rasulullah shallallahu 'alaihi wa sallam bersabda: آتِي بَابَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ فَأَسْتَفْتِحُ فَيَقُولُ الْخَازِنُ مَنْ أَنْتَ قَالَ فَأَقُولُ مُحَمَّدٌ قَالَ يَقُولُ بِكَ أُمِرْتُ أَنْ لَا أَفْتَحَ لِأَحَدٍ قَبْلَكَ “Aku mendatangi pintu surga pada hari Kiamat, lalu aku meminta dibukakan, maka penjaganya berkata, “Siapa engkau?” Aku menjawab, “Muhammad.” Penjaganya berkata, “Karena engkau aku diperintahkan untuk tidak membukakan kepada seorang pun sebelummu.” (HR. Ahmad dan Muslim) Mengucapkan selamat kepada mereka. Yakni selamat dari segala musibah dan keburukan. Kata “Thibtum” artinya bisa juga baiklah keadaan kamu, yakni hatimu menjadi baik dengan mengenal Allah, mencintai-Nya, dan takut kepada-Nya. Demikian pula lisanmu menjadi baik dengan menyebut-Nya, dan anggota badanmu pun menjadi baik dengan ketaatan kepada-Nya. Karena ia adalah tempat yang baik dan tidak cocok kecuali bagi orang-orang yang baik keadaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 73",
    "description": "Dan pada waktu yang bersamaan orang-orang yang bertakwa kepada tuhannya dan beramal saleh, diantar ke dalam surga secara berombongan. Sehingga apabila mereka telah sampai kepadanya yakni ke pintu surga dan kemudian pintu-pintunya telah dibukakan, penjaga-penjaganya berkata kepada mereka, 'kesejahteraan senantiasa dilimpahkan atasmu, berbahagialah kamu! maka masuklah dengan suka cita, dan kamu kekal menetap di dalamnya untuk selama-lamanya. '74. Mereka dipersilakan masuk dengan penuh suka cita, dan mereka pun lalu berkata, 'segala puji bagi Allah yang maha pengasih lagi maha penyayang, yang telah memenuhi janji-Nya melalui para rasul kepada kami, dan telah memberikan tempat, yakni surga, ini kepada kami, sedang kami diperkenankan menempati surga di mana saja yang kami kehendaki. ' maka surga itulah sebaik-baik balasan bagi orang-orang yang beramal kebajikan di dunia."
  }
]