[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Mukmin berkata, “Segala puji bagi Allah yang telah mewujudkan janjiNya kepada kami melalui lisan para rasulNya dan memberikan surgaNya kepada kami di mana kami bisa tinggal di bagian manapun darinya.” Itu adalah sebaik-baik balasan bagi orang-orang yang berbuat baik (ihsan) yang telah bersungguh-sungguh dalam menaati Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Orang-orang Mukmin berkata manakala mereka telah masuk Surga, “Segala puji bagi Allah yang telah mewujudkan janji-Nya kepada kami melalui lisan para Rasul-Nya. Dia menjanjikan kami masuk Surga, Dia memberikan bumi Surga kepada kami. Kami tinggal di bagian mana darinya yang kami kehendaki. Ini adalah sebaik-baik balasan bagi orang-orang beramal, yang melakukan amal saleh dalam rangka mencari Wajah Rabb mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَقَالُوا۟ الْحَمْدُ لِلّٰهِ الَّذِى صَدَقَنَا وَعْدَهُۥ (Dan mereka mengucapkan: “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami) Janji tentang hari kebangkitan dan pahala berupa surga. وَأَوْرَثَنَا الْأَرْضَ(dan telah (memberi) kepada kami tempat ini) Yakni tanah surga. Seakan-akan surga itu sebelumnya milik orang lain kemudian mereka dapat memilikinya dan berbuat apa yang mereka inginkan di sana. Para penghuni surga mewarisi tempat-tempat milik para penghuni neraka yang ada di surga, dan para penghuni neraka mewarisi tempat-tempat milik para penghuni surga yang ada di neraka. نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَآءُ ۖ( sedang kami (diperkenankan) menempati tempat dalam surga di mana saja yang kami kehendaki) Yakni kami dapat menempati tempat yang kami kehendaki dan di manapun yang kami sukai. فَنِعْمَ أَجْرُ الْعٰمِلِينَ(maka surga itulah sebaik-baik balasan bagi orang-orang yang beramal”) Yakni sebaik-baik balasan bagi orang yang beramal adalah surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Orang-orang yang bertakwa berkata: “Ungkapan syukur hanya untuk Allah, segala puji yang indah hanya untuk Allah yang telah memenuhi janji-Nya untuk membangkitkan kami, kemudian memberi pahala dan surga kepada kami. Allah juga telah mewariskan kepada kami tanah surga. Kami dipersilahkan berbuat sesuka hati di dalamnya, dimanapun kami ingin, sebaik-baik balasan bagi orang-orang yang beramal yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Segala puji bagi Allah yang telah memenuhi janjiNya dan mewariskan bumi} bumi surga {ini kepada kami sehingga dapat menempati} kami menempati {surga sesuai dengan kehendak kami” {Itulah sebaik-baik balasan bagi orang-orang yang beramal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Dan mereka mengucapkan” pada saat memasukinya dan saat sudah tinggal di dalamnya, seraya memuji Allah atas apa yang telah Dia karuniakan dan anugerahkan kepada mereka, “SEgala puji bagi Allah yang telah memenihi janjiNya kepada kami.” Maksudnya, Dia telah menjanjikan surge kepada kami melalui lisan para RasulNYa jika kami beriman dan beramal shalih, dan Dia penuhi apa yang telah dijanjikanNya kepada kami tersebut dan Dia telah tunaikan untuk kami apa yang telah dikaruniakan kepada kami. “Dan telah diwariskan kepada kami bumi ini,” maksudnya, bumi surge, ”sedang kami menempati tempat dalam surge dimana saja kami kehendaki.” Maksudnya, kami menempati tempat yang mana saja yang kami suka di dalamnya dan kami menikmati kenikmatan apa saja yang kami mau darinya, tidak ada sesuatu apa pun yang terlarang bagi kami dari yang kami kehendaki, “maka surge itulah sebaik-baik balasan bagi orang-orang yang beramal,” yaitu orang-orang yang bersungguh-sungguh dalam menaati Rabbnya dalam waktu yang singkat lagi terbatas. Maka dengannya mereka memperoleh kebaikan yang sangat besar nan abadi lagi terus tak terputus. Negeri inilah yang sebenarnya berhak dibanggakan, yang di dalamnya Allah memuliakan manusia-manusia pilihanNYa, yang dirididhai oleh Yang Maha Pemurah lagi Mahamulia sebagai tempat tinggal. Dia telah membangun yang tertinggi dan terbaik dan telah menanamnya dengan TanganNYa dan telah Dia penuhi dengan rahmat dan karuniaNya, yaitu hanya dengan sebagiannya saja orang-orang yang bersedih menjadi gembira, semua kekeruhan menjadi sirna, dan kejernihan menjadi sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 74: (Dan mereka mengucapkan) sewaktu mereka memasukinya; lafal ayat ini diathafkan kepada lafal Dukhuuluhaa yang diperkirakan keberadaannya tadi pada ayat sebelumnya, (\"Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami) yakni memasukkan kami ke dalam surga (dan telah memberikan kepada kami tempat ini) surga ini (sedangkan kami diperkenankan menempati) menghuni (tempat dalam surga di mana saja kami kehendaki) karena surga itu semuanya bukanlah tempat yang dipilih antara yang satu dengan yang lainnya, karena semuanya indah (maka sebaik-baik balasan bagi orangorang yang beramal) adalah surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika memasukinya sambil memuji Tuhan mereka atas nikmat yang Dia karuniakan kepada mereka. Yakni Dia menjanjikan surga kepada kami jika kami beriman dan beramal saleh, ternyata benar janji-Nya. Yakni tidak dihalangi dari kami sesuatu yang kami inginkan. Yaitu mereka yang bersungguh-sungguh dalam beramal dalam waktu yang singkat dan sebentar (di dunia) dan mereka memperoleh balasannya berupa kebaikan yang besar, kekal dan langgeng."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 74",
    "description": "Mereka dipersilakan masuk dengan penuh suka cita, dan mereka pun lalu berkata, 'segala puji bagi Allah yang maha pengasih lagi maha penyayang, yang telah memenuhi janji-Nya melalui para rasul kepada kami, dan telah memberikan tempat, yakni surga, ini kepada kami, sedang kami diperkenankan menempati surga di mana saja yang kami kehendaki. ' maka surga itulah sebaik-baik balasan bagi orang-orang yang beramal kebajikan di dunia. 75. Dan engkau, wahai nabi Muhammad, akan melihat malaikat-mala-ikat melingkar di sekeliling 'arsy, bertasbih secara terus-menerus sambil memuji tuhannya; lalu setelah itu diberikan keputusan yang pasti di antara mereka hamba-hamba Allah itu secara adil, dan dikatakan kepada mereka ucapan sanjungan, 'al'amdulill'hi rabbil ''lam'n', segala puji bagi Allah, tuhan seluruh alam. '."
  }
]