[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu melihat (wahai Nabi) para malaikat mengelilingi Arasy Allah Yang maha Pengasih, mereka menyucikan Tuhan mereka dari segala apa yang tidak layak denganNya. Dan Allah menetapkan keputusanNya diantara makhluk-makhlukNya dengan kebenaran dan keadilan, lalu DIa mengizinkan orang-orang yang beriman untuk tinggal di surga dan orang-orang yang kafir di neraka. Dikatakan, “Segala Puji bagi Allah, Tuhan semesta alam atas keputusanNya diantara penghuni surga dan penduduk neraka, pujian karena karunia dan kebaikanNya, pujian karena keadilan dan kebijaksanaanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Para malaikat pada hari yang disaksikan itu mengelilingi Arasy, mereka menyucikan Allah dari apa yang tidak layak bagi-Nya yang diucapkan oleh orang-orang kafir. Allah memutuskan di antara semua makhluk dengan adil. Allah memuliakan siapa yang layak dimuliakan dan menyiksa siapa yang layak disiksa, dan dikatakan, “Segala puji bagi Allah, Rabb seluruh makhluk atas keputusan-Nya yang Dia tetapkan pada hari itu berupa memuliakan hamba-hamba-Nya yang beriman dan menyiksa orang-orang yang kafir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Hai Rasulullah, dan kamu akan melihat para malaikat yang mengelilingi ‘arsy Allah Yang Maha Pengasih dari segala penjuru, mereka melafazhkan tasbih dan tahmid. Dan diputuskanlah perkara di antara hamba dengan penuh keadilan, dan keputusan itu ditutup dengan ucapan: “Segala puji bagi Allah, Tuhan semesta alam, atas keputusan yang adil.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَتَرَى الْمَلٰٓئِكَةَ حَآفِّينَ مِنْ حَوْلِ الْعَرْشِ (Dan kamu (Muhammad) akan melihat malaikat-malaikat berlingkar di sekeliling ‘Arsy) Yakni yang mengelilingi Arsy. يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ( bertasbih sambil memuji Tuhannya) Seraya mereka bertasbih kepada Allah dengan penuh pujian bagi-Nya. وَقُضِىَ بَيْنَهُم بِالْحَقِّ(dan diberi putusan di antara hamba-hamba Allah dengan adil) Yakni dengan memasukkan sebagian mereka ke surga dan sebagian lainnya ke neraka. Pendapat lain mengatakan maknanya adalah Allah memutuskan antara para nabi yang didatangkan bersama para saksi dan antara umat-umat yang lain dengan penuh keadilan. وَقِيلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ(dan diucapkan: “Segala puji bagi Allah, Tuhan semesta alam”) Yang mengatakan ini adalah orang-orang beriman. Mereka memuji Allah yang telah memberi putusan antara mereka dengan para penghuni neraka dengan penuh keadilan. Pendapat lain mengatakan bahwa yang mengatakan ini adalah para malaikat. Mereka memuji Allah atas keadilan-Nya dalam memberi keputusan, dan ketetapan-Nya antara hamba-hamba-Nya dengan benar, serta menyelesaikan urusan itu dengan memasukkan para penghuni surga ke tempat-tempat tinggal mereka, dan memasukkan para penghuni neraka ke tempat-tempat tinggal mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Dan engkau wahai orang yang bertakwa yang sedang bergembira, engkau akan melihat para malaikat mengelilingi Arsy. Mereka memenuhi segala penjuru. Mereka mengagungkan dan mensucikan nama Tuhannya dengan penuh rasa syukur. Mereka berdzikir: Maha Suci Allah dengan segala pujian-Nya, Yang telah menetapkan dan memutuskan urusan hambaNya dengan penuh keadilan. Penghuni surga akan dimasukkan ke surga, dan penghuni neraka masuk ke dalam neraka. Orang-orang mukmin berkata: “Segala puji hanya bagi Allah, Tuhan semesta alam dan seluruh makhluk atas segala keutamaan dan kebaikan-Nya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu akan melihat malaikat melingkar} melingkar {di sekeliling ʻArsy. Mereka bertasbih sambil memuji Tuhan mereka. Telah diputuskan dengan benar (urusan) di antara mereka} telah diputuskan dengan adil di antara para makhluk {dikatakan,“Segala puji bagi Allah, Tuhan semesta alam”}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Dan kamu akan melihat malaikat-malaikat” wahai orang yang melihat pada hari yang agung itu “berlingkar di sekeliling Arsy,” maksudnya, mereka berkhidmah kepada Rabbnya dan berkumpul di sekitar Arasy dengan rasa tunduk karena kebesaranNya sambil mengakui kesempurnaanNYa, tenggelam dalam keindahanNya. Mereka “bertasbih sambil memuji Rabbnya,” maksudnya, mereka menyucikanNya dari segala apa yang tidak pantas dengan kebesaranNya dari hal-hal yang disandarkan oleh kaum musyrikin kepadaNya dan apa-apa yang tidak mereka nisbatkan. “Dan diberi putusan di antara mereka,” maksudnya, di antara segenap umat manusia yang terdahulu dan yang kemudian, “dengan haq (adil),” yang tidak ada kesamaran padanya dan tidak pula ada pengingkaran dari orang-orang yang sudah diputuskan dengan benar itu. “Dan diucapkan, ‘SEgala puji bagi Allah, Rabb semesta alam’.” Di sini tidak disebutkan siapa yang mengucapkan kalimat ini, agar mengisyaratkan kepada kita bahwa seluruh makhluk berbicara dengan pujian Rabbnya dan hikmahNya atas keputusan yang telah Dia putuskan atas para penghuni surge dan para penghuni neraka, sebagai pujian karunia dan ihsan, pujian keadilan dann hikmah (kebijaksanaan)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 75: (Dan kamu akan melihat malaikat-malaikat berlingkar) lafal Haaffiina ini menjadi Hal (di sekeliling 'Arasy) yakni dari segala penjurunya (bertasbih) menjadi Hal dari dhamir Haaffiina (seraya memuji Rabb mereka) yaitu sambil mengucapkan kalimah, Subhaanallaah Wa Bihamdihi, artinya, Maha Suci Allah dan Kami memuji kepada-Nya (dan diberi putusan di antara mereka) di antara semua makhluk (dengan hak) dengan adil, maka orang-orang yang beriman dimasukkan ke dalam surga, dan orangorang kafir dimasukkan ke dalam neraka (dan diucapkan, \"Segala puji bagi Allah, Rabb semesta alam.\") yaitu setelah kedua golongan itu telah selesai pemutusannya, lalu para malaikat mengakhirinya dengan memuji kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka berkhidmat kepada Tuhannya, berkumpul di sekitar ‘Arsyi-Nya, tunduk kepada keagungan-Nya dan mengakui kesempurnaan-Nya. Mereka menyucikan-Nya dari segala yang tidak layak dengan keagungan-Nya. Di mana orang-orang mukmin masuk ke surga dan orang-orang kafir masuk ke neraka. Penempatan calon penghuni surga ke surga dan calon penghuni neraka ke neraka diakhiri dengan ucapan hamdalah (Al Hamdulillahi Rabbil ‘aalamin) dari para malaikat. Menurut Syaikh As Sa’diy, tidak disebutkan siapa yang mengatakan menunjukkan, bahwa semua makhluk mengucapkan pujian bagi Allah dan kebijaksanaan-Nya atas keputusan-Nya terhadap penghuni surga dan penghuni neraka. Mereka memuji karena karunia dan ihsan-Nya dan karena keadilan dan kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 75",
    "description": "Dan engkau, wahai nabi Muhammad, akan melihat malaikat-mala-ikat melingkar di sekeliling 'arsy, bertasbih secara terus-menerus sambil memuji tuhannya; lalu setelah itu diberikan keputusan yang pasti di antara mereka hamba-hamba Allah itu secara adil, dan dikatakan kepada mereka ucapan sanjungan, 'al'amdulill'hi rabbil ''lam'n', segala puji bagi Allah, tuhan seluruh alam. '1. '' m'm, hanya Allah yang mengetahui maksudnya."
  }
]