[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila manusia ditimpa oleh sebuah ujian, kesulitan dan wabah penyakit, maka dia mengingat Robbnya, kemudian dia memohon dan berdo’a kepada-Nya. Kemudian apabila Allah telah mengabulkan permintaanya dan mengangkat kesulitannya serta menggantinya dengan kenikmatan-Nya, maka dia lupa terhadap do’a-do’anya kepada Allah saat dia memerlukan-Nya, dan diapun menyekutukan-Nya dengan sesuatu untuk menyesatkan orang lain sehingga tidak beriman dan tidak taat kepada Allah. Katakanlah kepadanya (wahai rosul) seraya mengancam mereka “silahkan nikmati kekufuran kalian sebentar saja sampai kematian datang kepadamu dan ajalmu habis, sesungguhnya kamu termasuk penduduk neraka yang akan kekal di dalamnya”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Jika orang kafir ditimpa kemalangan berupa penyakit, kehilangan harta atau takut tenggelam, maka dia berdoa kepada Rabbnyaagar Rabbnya -Subḥānahu- untuk mengangkat kemalangan yang menimpanya, dia kembali kepada Rabb semata. Kemudian bila Rabbnya memberinya nikmat dengan mengangkat kemalangan yang menimpanya, dia meninggalkan Allah yang sebelumnya dia berdoa kepada-Nya, dan mengangkat sekutu-sekutu yang dia sembah selain-Nya. Katakanlah -wahai Rasul- kepada orang yang hidupnya seperti itu, “Silakan kamu menikmati kekufuranmu selama sisa umurmu yang tidak lama, sesungguhnya kamu termasuk penghuni api Neraka yang tinggal di dalamnya pada hari Kiamat, kamu terus bersama Neraka seperti seorang teman selalu bersama temannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Jika manusia tertimpa musibah, kesulitan, dan penyakit, maka dia akan mengingat Tuhannya, meminta tertolongan dari-Nya dan berdoa kepada-Nya. Namun jika Allah mengabulkan doanya, menghilangkan kesulitannya, dan memberinya kenikmatan, maka dia akan melupakan doa yang telah dia panjatkan kepada Tuhannya, lalai dari kesulitan yang telah Allah angkat darinya, dan menyekutukan-Nya dengan yang lain; agar dia dapat menyesatkan orang-orang lain dari keimanan kepada-Nya dan menghalangi mereka dari agama-Nya. Hai Muhammad, katakanlah: “Nikmatilah sejenak kekafiranmu itu hingga waktu kedatangan ajalmu, sungguh dengan kekafiran dan kesesatanmu itu kamu termasuk para penghuni neraka yang kekal di dalamnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَإِذَا مَسَّ الْإِنسٰنَ ضُرٌّ (Dan apabila manusia itu ditimpa kemudharatan) Kemudharatan apapun itu, baik itu berupa penyakit, kemiskinan, atau rasa takut. دَعَا رَبَّهُۥ مُنِيبًا إِلَيْهِ(dia memohon (pertolongan) kepada Tuhannya dengan kembali kepada-Nya) Yakni kembali kepada-Nya untuk memohon pertolongan agar musibah yang menimpanya dapat dijauhkan, dan dia berpaling dari apa yang dia sembah sebelumnya baik itu orang mati atau hidup, patung, dan lain sebagainya. ثُمَّ إِذَا خَوَّلَهُۥ نِعْمَةً مِّنْهُ(kemudian apabila Tuhan memberikan nikmat-Nya kepadanya) Yakni ketika Allah menghilangkan kemudharatan yang menimpanya dan memberinya kenikmatan. نَسِىَ مَا كَانَ يَدْعُوٓا۟ إِلَيْهِ مِن قَبْلُ(lupalah dia akan kemudharatan yang pernah dia berdoa (kepada Allah) untuk (menghilangkannya) sebelum itu) Ia kemudian melupakan kemudharatan yang ia mohonkan kepada Allah untuk diangkat darinya. Pendapat lain mengatakan bahwa ia kemudian melupakan Tuhan yang ia mohonkan pertolongan. وَجَعَلَ لِلّٰهِ أَندَادًا(dan dia mengada-adakan sekutu-sekutu bagi Allah) Yakni dia menjadikan sekutu-sekutu sama dengan Allah, baik itu berhala-berhala maupun yang lainnya, dia menganggap hal itu sehingga dia menyembah berhala-berhala tersebut. لِّيُضِلَّ عَن سَبِيلِهِۦ ۚ( untuk (menghilangkannya) sebelum itu) Yakni untuk menyesatkan manusia dari jalan Allah, yaitu Islam dan tauhid. قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ( Katakanlah: “Bersenang-senanglah dengan kekafiranmu itu sementara waktu) Yakni dengan sedikit kesenangan, atau dengan kesenangan yang sebentar, sebab kenikmatan dunia hanya sedikit dan sebentar. إنك من أصحاب النار (sesungguhnya kamu termasuk penghuni neraka) Yakni sebentar lagi tempat kembalimu adalah neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Ketika mereka manusia kafir ditimpakan suatu musibah, seperti sakit parah, faqir atau rasa sakit, hendaklah mereka berdoa kepada Allah dan merendahkan diri di hadapan Allah, meminta pertolongan kepada Allah, untuk menolak bala’ yang menimpanya, kemudian ketika Allah memberikan nikmat padanya, maka tertutuplah bahaya atas dirinya, dia lupa akan bahaya yang Allah turunkan padanya sebab doanya kepada Allah sebelumnya. Allah menjadikan contoh para orang-orang yang syirik seperti menyembah berhala-berhala, dan yang lainnya, untuk menyesatkan manusia dari jalan kebenaran: yaitu Islam dan dan menyembah hanya kepada Allah, maka katakanlah hai Muhammad kepada para kafir ini: tetaplah kalian atas kekufuran kalian dan di sisa umur kalian, sesunggunya kalian di akhirat berada di golongan orang yang masuk di neraka, yang demikian itu adalah ancaman yang sangat, keputusasaan orang kafir akan nikmat akhirat, dan pembenaran atas kekufuran mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila manusia} orang kafir {ditimpa} ditimpa {bencana, maka dia memohon kepada Tuhannya dengan kembali kepadaNya} kembali hanya kepadaNya {Kemudian apabila Dia memberinya} memberi dan menganugerahkan kepadanya {nikmat dariNya, dia melupakan} dia meninggalkan {apa yang pernah dia mohonkan kepadaNya sebelum itu dan dia menjadikan bagi Allah tandingan-tandingan} sekutu-sekutu dalam ibadah {untuk menyesatkan dari jalanNya} untuk menyesatkan manusia dari agama Allah {Katakanlah} katakanlah kepada orang kafir ini {“Bersenang-senanglah dengan kekufuranmu untuk sementara waktu. Sesungguhnya kamu termasuk penghuni neraka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Allah memberitakan tentang kemurahan, kebaikan dan karuniaNya kepada hambaNya, dan betapa minimnya syukur sang hamba kepadaNya, dan bahwa pada saat ditimpa kesempitan, seperti sakit, kefakiran, atau terjebak ke dalam suatu kesulitan di laut atau lainnya, sedangkan dia mengetahui saat itu bahwasanya tidak ada yang bisa menyelamatkannya dalam kondisi seperti itu kecuali Allah, maka mereka pun berdoa kepadaNya dengan merendahkan diri lagi kembali, dia benar-benar meminta pertolongan kepadaNya agar dibebaskan dari apa yang tengah menimpanya dan ia benar-benar memelas berdoa, “Kemudian apabila Dia memberikan,” yakni Allah memberikan “nikmat (Nya) kepadanya” seperti, ia dibebaskan dari marabahaya dan kesempitan “lupalah dia kepada apa yang dia berdoa kepadaNya sebelum itu.” Maksudnya, ia lupa kepada marabahaya tersebut yang karenanya dia telah berdoa kepada Allah, dan ia terus berjalan seolah-olah ia belum pernah ditimpa marabahaya dan ia terus berjalan dalam kesyirikannya, “dan dia mengadakan sekutu-sekutu bagi Allah untuk menyesatkan dari jalanNYa.” Maksudnya, menyesatkan dirinya dan menyesatkan orang lain, karena penyesatan itu merupakan bagian dari kesesatan; yang disebutkan adalah konsekuensi dari yang lazim untuk menunjukkan kepada yang lazim itu sendiri. “Katakanlah” kepada si pembangkang yang mengganti nikmat Allah dengan kekafiran ini, “Bersenang-senanglah dengan kekafiranmu itu sementara waktu; sesungguhnya kamu termasuk penghuni neraka,” maka sama sekali tidak akan berguna bagimu apa yang kamu bersenang-senang dengannya apabila tempat tinggal terakhirnya adalah neraka. “Maka bagaimana pendapatmu jika Kami berikan kepada mereka kenikmatan hidup bertahun-tahun, kemudian datang kepada mereka azab yang telah diancamkan kepada mereka, niscaya tidak berguna bagi mereka apa yang mereka selalu menikmatinya.” (Asy-Syuara:205-207)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 8: (Dan apabila manusia itu ditimpa) yakni orang yang kafir (kemudaratan, dia memohon -pertolongan- kepada Rabbnya) yakni merintih kepada-Nya meminta pertolongan (dengan kembali) maksudnya, bertobat (kepada-Nya; kemudian apabila Rabb memberikan nikmat kepadanya) Dia memberinya nikmat (dari-Nya lupalah dia) artinya, dia meninggalkan (akan apa yang pernah ia serukan) yaitu lupa akan rintihannya (kepada-Nya sebelum itu) lupa kepada Allah. Lafal Maa di sini bermakna Man (dan dia mengada-adakan sekutu-sekutu bagi Allah) tandingan-tandingan bagi-Nya (untuk menyesatkan) manusia; lafal liyudhilla dapat dibaca liyadhilla (dari jalan-Nya) dari agama Islam (Katakanlah, \"Bersenang-senanglah dengan kekafiranmu itu sementara waktu) selama sisa hidupmu (sesungguhnya kamu termasuk penghuni neraka.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kemurahan, ihsan dan kebaikan-Nya kepada hamba-Nya, namun sedikit sekali rasa syukur hamba-Nya, dan bahwa ketika ia (manusia) tertimpa bencana, baik itu sakit, kemiskinan atau bahaya di tengah laut dan lainnya, ia mengetahui bahwa tidak ada yang dapat menyelamatkannya dalam keadaan seperti itu selain Allah ‘Azza wa Jalla, maka dia berdoa sambil merendahkan diri dan kembali kepada Allah serta meminta kepada-Nya agar dihilangkan bencana yang menimpanya, akan tetapi ketika Allah memberikan nikmat kepada-Nya dengan menghilangkan bencana dan deritanya, ia melupakan hal itu dan seakan-akan ia belum pernah tertimpa bencana, dan ia tetap di atas syirknya untuk menyesatkan dirinya dan orang lain dari jalan Allah. Kepada orang yang durhaka dan tidak bersyukur ini, serta mengganti nikmat Allah dengan kekufuran. Yakni tidaklah berguna bagimu sikapmu bersenang-senang dengan kekafiran jika kembalimu akhirnya ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 8",
    "description": "Ayat ini berbicara tentang tabiat manusia. Dan apabila manusia ditimpa bencana, kesulitan, atau apa saja yang tidak menyenangkan, dia memohon pertolongan kepada tuhannya dengan kembali taat dan mendekatkan diri kepada-Nya. Tetapi apabila dia memberikan nikmat, kekayaan, atau sesuatu yang menyenangkan kepadanya, dia lupa akan bencana yang pernah dia berdoa kepada Allah agar selamat darinya sebelum kenikmatan itu datang, dan diadakannya sekutu-sekutu bagi Allah untuk menyesatkan manusia dari jalan-Nya, yaitu islam. Wahai nabi Muhammad, katakanlah kepada mereka, 'bersenang-senanglah kamu sementara waktu dengan kekafiranmu itu sampai kematian menjemputmu. Sungguh, kamu termasuk penghuni neraka di akhirat kelak. '9. Wahai orang kafir, siapakah yang lebih mulia di sisi Allah; kamu yang memohon kepada-Nya hanya saat tertimpa bencana ataukah orang yang beribadah pada waktu malam dengan membaca Al-Qur'an, salat, dan berzikir dalam sujud dan berdiri karena cemas dan takut kepada azab Allah di akhirat dan mengharapkan rahmat tuhannya' wahai nabi Muhammad, katakanlah, 'apakah sama orang-orang yang mengetahui, berilmu, berzikir, dan melaksanakan salat, dengan orang-orang yang tidak mengetahui, tidak berilmu, dan selalu mengikuti nafsunya'' sebenarnya hanya orang yang berakal sehat dan berpikiran jernih yang dapat menerima pelajaran serta mampu membedakan antara kebenaran dan kebatilan."
  }
]