[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang kafir yang menikmati kekufurannya ini lebih baik, ataukah seseorang yang beribadah kepada Rabbnya dan taat kepada-Nya, menghabiskan malamnya dalam shalat dan sujud kepada Allah, takut kepada adzab akhirat dan berharap rahmat Rabb-Nya? Katakanlah (wahai Rasul) Apakah sama orang-orang yang mengetahui Rabb mereka dan agama mereka yang haq dengan orang-orang yang tidak mengetahui apa pun tentang hal itu? Tidak sama. Hanyasanya yang mengingatnya dan mengetahui perbedaannya adalah orang-orang yang berakal lurus"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Apakah orang yang menaati Allah, dia menghabiskan malamnya untuk sujud kepada Rabbnya dan berdiri untuk-Nya, dia takut kepada azab Akhirat, berharap rahmat dari Rabbnya, lebih baik daripada orang kafir yang menyembah Allah dalam kesulitan kemudian kafir kepada-Nya dalam kemudahan dan mengangkat sekutu-sekutu bagi-Nya? Katakanlah -wahai Rasul-“Apakah sama orang-orang yang mengetahui apa yang Allah wajibkan atas mereka karena mereka mengetahui Allah dengan orang-orang yang tidak mengetahui apapun tentang hal itu?” Yang mengetahui perbedaan di antara dua golongan hanyalah orang-orang yang berakal lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Apakah orang kafir yang bersenang-senang dengan kekafirannya ini lebih baik daripada orang yang menyembah Tuhannya, menghabiskan malam-malamnya dalam shalat dan sujud kepada-Nya, takut dari azab akhirat dan mengharap rahmat-Nya? Hai Muhammad, katakanlah: “Apakah sama antara orang-orang yang mengetahui kebenaran dengan orang-orang yang tidak mengetahui apapun?” Jelas tidak sama, sungguh orang yang mengingat nasehat dan mengetahui kebenaran hanyalah orang-orang yang memiliki akal sehat yang terbebas dari hawa nafsu dan syubhat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَمَّنْ هُوَ قٰنِتٌ ءَانَآءَ الَّيْلِ (ataukah orang yang beribadat di waktu-waktu malam) Yakni apakah orang kafir itu lebih baik keadaan dan tempat kembalinya, atau orang yang beriman kepada Allah yang senantiasa menjalankan beribadah kepada Allah di waktu malam dan tidak hanya menyembah Allah pada saat kemudharatan menimpanya, namun ia senantiasa mengingat Allah dan menyembah-Nya pada segala keadaan. سَاجِدًا وَقَآئِمًا(dengan sujud dan berdiri) Dalam shalat malamnya. Yakni dia senantiasa bersujud dan berdiri. يَحْذَرُ الْاٰخِرَةَ وَيَرْجُوا۟ رَحْمَةَ رَبِّهِۦ ۗ( sedang ia takut kepada (azab) akhirat dan mengharapkan rahmat Tuhannya) Dia mengumpulkan sifat antara harapan dan rasa takut. Dan tidaklah dua sifat itu ada dalam hati seseorang melainkan dia akan beruntung. Pendapat lain mengatakan maknanya adalah apakah dia sama dengan orang yang tidak melakukan itu sama sekali? قُلْ هَلْ يَسْتَوِى الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ ۗ( Katakanlah: “Adakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui?”) Yang dimaksud adalah antara para ulama dengan orang-orang jahil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Apakah orang kafir yang demikian itu lebih baik keadaan dan hartanya? Ataukah orang mukmin yang taat dan takut kepada Tuhannya yang lebih baik? Yang sepanjang malam ia berdoa, yang menundukkan kepalanya di tanah dan bermunajah atas kebenaran dalam shalatnya, yang takut akan siksa akhirat, yang tercukupi bahagianya, katakanlah hai Muhammad: apakah orang yang alim (tahu) itu sama dengan orang yang bodoh: keduanya tidak sama, sesungguhnya itu adalah nasihat bagi mereka yang berikir. Kalimah (min) tersusun dari kata (am) dan (min), (am) disini berarti istifham inkari yang berfaidah nafi, dan makna (bal:tetapi), bermakna perpindahan dari satu kalam ke kalam lain, orang yang shalat: orang yang melanggengkan ketaatan. Ibnu Umar berkata: (ayat tersebut) juga dikatakan pada Utsman bin Affan, kata Ibnu Abbas: (ayat tersebut) juga dikatakan pada Ibn Mas’ud, Umar bin Yasir dan Salim, Tuannya Abu Hanifah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah orang yang beribadah} orang yang taat kepada Allah {pada waktu malam dalam} pada waktu malam {dengan keadaan bersujud, berdiri, takut pada akhirat} takut pada azab akhirat {dan mengharapkan rahmat Tuhannya. Katakanlah,“Apakah sama orang-orang yang mengetahui dengan orang-orang yang tidak mengetahui” Sesungguhnya hanya orang-orang yang berakal sehat yang dapat menerima pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Ini adalah kondisi berlawanan antara orang yang taat kepada Allah dengan yang lainnya (yang tidak taat), dan di antara orang yang berilmu dengan orang jahil. Ini sudah merupakan perkara yang sudah pasti perbedaannya yang jauh. Maka tidaklah sama orang berpaling dari ketaatan kepada Rabbnya, yang selalu mengikuti hawa nafsunya dengan orang yang gemar beribadah, yakni, taat kepada Allah dengan melakukan ibadah-ibadah yang paling utama, yaitu seperti shalat; dan pada waktu-waktu yang paling utama, seperti waktu-waktu di malam hari. Allah menyifati orang yang gemar beribadah itu dengan “banyak beramal dan melakukan yang paling utama.” Kemudian Allah menyifatinya dengan “sifat takut dan harap,” dan Allah juga menyebutkan sebab yang menimbulkan rasa takutnya, yaitu takut akan azab di akhirat atas dosa-dosa yang telah lalu yang terlanjur ia lakukan, dan juga sebab yang menimbulkan sifat pengharapan yaitu adanya rahmat Allah. Dengan demikian Allah menyifatinya dengan amal lahiriyah dan amal batiniyah. “Katakanlah, ‘Apakah sama orang-orang yang mengetahui” Rabb mereka dan juga mengetahui AgamaNya yang bersifat balasan di akhirat, dengan segala rahasia dan hikmah di balik itu, “dengan orang-orang yang tidak mengetahui” sesuatu pun dari semua itu? Mereka yang berilmu tidak sama dengan mereka yang bodoh; demikian pula tidak sama antara malam dengan siang, cahaya dan kegelapan, dan air dengan api. “Sesungguhnya orang yang dapat mengambil pelajaran” ketika diberi pelajaran, “hanyalah orang-orang yang mempunyai akal,” yakni, orang-orang yang mempunyai akal bersih lagi cerdas. Merekalah orang-orang yang lebih mengutamakan yang bernilai tinggi daripada yang bernilai rendah; mereka lebih mengutamakan ilmu daripada kebodohan; ketaatan kepada Allah daripada menyalahiNya, sebab mereka mempunyai akal yang membimbing mereka untuk melihat akhir akibat (semua perbuatan). Berbeda dengan orang yang tidak mempunyai akal dan nurani, ia menjadikan hawa nafsunya sebagai sembahannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zumar ayat 9: (Apakah orang) dibaca Amman, dan dapat dibaca Aman (yang beribadah) yang berdiri melakukan amal ketaatan, yakni salat (di waktu-waktu malam) di saat-saat malam hari (dengan sujud dan berdiri) dalam salat (sedangkan ia takut kepada hari akhirat) yakni takut akan azab pada hari itu (dan mengharapkan rahmat) yakni surga (Rabbnya) apakah dia sama dengan orang yang durhaka karena melakukan kekafiran atau perbuatan-perbuatan dosa lainnya. Menurut qiraat yang lain lafal Amman dibaca Am Man secara terpisah, dengan demikian berarti lafal Am bermakna Bal atau Hamzah Istifham (Katakanlah, \"Adakah sama orang-orang yong mengetahui dengan orang-orang yong tidak mengetahui?\") tentu saja tidak, perihalnya sama dengan perbedaan antara orang yang alim dan orang yang jahil. (Sesungguhnya orang yang dapat menerima pelajaran) artinya, man menerima nasihat (hanyalah orang-orang yang berakal) yakni orang-orang yang mempunyai pikiran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini membandingkan antara orang yang menjalankan ketaatan kepada Allah dengan orang yang tidak demikian, dan membandingkan antara orang yang berilmu dengan orang yang tidak berilmu, yaitu bahwa hal ini termasuk perkara yang jelas bagi akal dan diketahui secara yakin perbedaannya. Oleh karena itu, tidaklah sama antara orang yang berpaling dari ketaatan kepada Tuhannya dan mengikuti hawa nafsunya dengan orang yang menjalankan ketaatan, bahkan ketaatan yang dijalankannya adalah ketaatan yang paling utama, yaitu shalat dan di waktu yang utama, yaitu malam. Allah menyifati orang ini dengan banyak beramal dan menyifatinya dengan rasa takut dan harap, rasa takut masuk ke neraka karena dosa-dosa yang lalu yang telah dikerjakannya dan rasa berharap masuk ke surga karena amal yang dikerjakannya. Yakni mengenal Tuhannya, mengenal syariat-Nya dan mengenal pembalasan-Nya serta mengenal rahasia dan hikmah-hikmahnya. Yakni tentu tidak sama sebagaimana tidak sama antara siang dan malam, antara terang dan kegelapan, dan antara air dan api. Mereka memiliki akal yang membimbing mereka untuk melihat akibat dari sesuatu, berbeda dengan orang yang tidak punya akal, maka ia menjadikan hawa nafsunya sebagai tuhannya. Sehingga mereka mengutamakan yang kekal daripada yang sebentar, mengutamakan yang tinggi daripada yang rendah, mengutamakan ilmu daripada kebodohan dan mengutamakan ketaatan daripada kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zumar Ayat 9",
    "description": "Wahai orang kafir, siapakah yang lebih mulia di sisi Allah; kamu yang memohon kepada-Nya hanya saat tertimpa bencana ataukah orang yang beribadah pada waktu malam dengan membaca Al-Qur'an, salat, dan berzikir dalam sujud dan berdiri karena cemas dan takut kepada azab Allah di akhirat dan mengharapkan rahmat tuhannya' wahai nabi Muhammad, katakanlah, 'apakah sama orang-orang yang mengetahui, berilmu, berzikir, dan melaksanakan salat, dengan orang-orang yang tidak mengetahui, tidak berilmu, dan selalu mengikuti nafsunya'' sebenarnya hanya orang yang berakal sehat dan berpikiran jernih yang dapat menerima pelajaran serta mampu membedakan antara kebenaran dan kebatilan. 10. Sangatlah jauh perbedaan antara orang mukmin dengan orang kafir. Wahai nabi Muhammad, katakanlah kepada orang mukmin bahwa Allah berfirman, 'wahai hamba-hamba-ku yang beriman! bertakwalah kepada tuhanmu, taatilah perintah-Nya, dan ikutilah rasul-Nya. ' bagi orang-orang yang berbuat baik dan taat pada perintah Allah, di dunia ini akan memperoleh kebaikan dan kehidupan di suatu tempat yang sejahtera. Dan bila kesejahteraan dan kebebasanmu beribadah terganggu, sungguh bumi Allah itu luas, maka berhijrahlah ke tempat yang lebih baik (lihat pula: surah an-nis'/4: 97). Hanya orang-orang yang bersabarlah yang disempurnakan pahalanya oleh Allah tanpa batas. '."
  }
]