[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sanjungan adalah bagi Allah karena sifat-sifatNya yang seluruhnya adalah sifat-sifat kesempurnaan, dan karena nikmat-nikmatNya yang lahir maupun yang batin, agama dan dunia, Yang memiliki apa yang di langit dan di bumi, dan bagiNya sanjungan sempurna di akhirat. Dia Mahabijaksana dalam perbuatanNya, juga Maha teliti terhadap urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Segala puji bagi Allah Pemilik segala yang ada di langit dan segala yang ada di bumi. Dia lah yang menciptakan, menguasai dan mengaturnya. Bagi-Nya semata sanjungan di Akhirat. Dia Maha Bijaksana dalam penciptaan dan pengaturan-Nya, Maha mengetahui keadaan hamba-hamba-Nya, tidak ada sesuatu pun darinya yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah memuji diri-Nya. Dia telah terpuji sebelum ada yang memuji-Nya, Dia Pemberi karunia bagi hamba-hamba-Nya di dunia dan di akhirat. Milik-Nya kerajaan langit dan bumi, segalanya adalah milik-Nya dan di bawah kekuasaan-Nya. Dan milik-Nya pujian di akhirat atas kesempurnaan keadilan dan rahmat-Nya. Dia memberi keputusan antara hamba-hamba-Nya dengan memberi pahala bagi orang-orang baik dan memberi siksaan bagi orang-orang jahat. Dia membalas dengan adil terhadap orang-orang zalim dan berdosa. Dan Dia Maha Bijaksana dalam kerajaan dan pengaturan-Nya, Maha Mengetahui segala hal yang tersembunyi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الْحَمْدُ لِلّٰهِ (Segala puji bagi Allah) Makna pujian bagi Allah telah dijelaskan pada surat al-Fatihah, yaitu pujian bagi-Nya dengan sifat-sifat dan perbuatan-perbuatan-Nya yang indah. الَّذِى لَهُۥ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ(yang memiliki apa yang di langit dan apa yang di bumi) Yakni segala yang ada pada keduanya adalah kepunyaan-Nya dan dibawah kekuasaan-Nya, Allah memperlakukannya dengan apa yang Dia kehendaki dan menetapkan apa yang Dia inginkan. Dan pujian bagi-Nya atas apa yang ada di langit dan di bumi yakni pujian bagi-Nya atas segala kenikmatan yang telah diberikan kepada makhluk-makhluk-Nya, dan juga pujian bagi-Nya atas sifat-sifat-Nya yang sempurna seperti kuasa, bijaksana, ilmu, dan pengetahuan, yang telah diketahui oleh para hamba-Nya melalui penciptaan Allah pada langit dan bumi. وَلَهُ الْحَمْدُ فِى الْاٰخِرَةِ ۚ( dan bagi-Nya (pula) segala puji di akhirat) Yakni bagi-Nya pujian dari hamba-hamba-Nya yang memuji-Nya di kehidupan akhirat setelah memasuki surga, seperti dalam firman-Nya: وقالوا الحمد لله الذي صدقنا وعده “Dan mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya kepada kami.” (az-Zumar: 74) Dan Dia terpuji di akhirat sebagaiman terpuji di dunia. وَهُوَ الْحَكِيمُ(Dan Dialah Yang Maha Bijaksana) Yang menetapkan urusan kehidupan dunia dan akhirat. الْخَبِيرُ (lagi Maha Mengetahui) Tentang urusan makhluk-Nya di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Pujian sempurna dan ungkapan syukur kepada Allah. Dia-lah Yang memiliki segala yang ada di langit dan di bumi atas semua makhluk. Kepemilikan dan kekuasaan penuh milik Allah, Dia berbuat sesuai apapun Yang Dia kehendaki. Pujian dan syukur atas segala nikmat yang telah Dia anugerahkan untuk makhluk dan hamba-Nya. Juga pujian kepada-Nya di alam akhirat Yang Memasukkan hamba-Nya yang beriman ke dalam surga. Dia-lah Yang memiliki pujian di dunia mauun di akhirat. Dia Pemilik Kebijaksanaan dalam segala apapun yang Dia perbuat untuk makhluk-Nya, dan Maha Mengetahui atas segala apa yang paling bermanfaat untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah Dzat yang memiliki segala yang ada di langit dan di bumi, dan bagiNya segala puji di akhirat. Dialah Yang Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. “Segala puji,” menyanjung dengan sifat-sifat yang terpuji dan perbuatan-perbuatan yang baik. Maka milik Allah-lah segala puji, karena semua sifat-sifatNya terpuji, karena keberadaannya sebagai sifat-sifat kesempurnaan, dan perbuatan-perbuatanNya yang terpuji, karena semuanya berkisar pada karunia yang terpuji dan disyukuri, dan pada keadilan yang terpuji dan diakui kebijaksanaanNya padanya. Di sini, Allah memuji diriNya, karena “milikNYa-lah apa yang di langit dan apa yang di bumi,” baik raja ataupun budak sahaya; DIa berbuat terhadap mereka dengan pujian-pujianNya, “dan bagiNya pula segala puji di akhirat,” karena di akhirat nanti akan tampak pujian dan sanjungan kepadaNya yang tidak tampak di dunia. Apabila Allah telah selesai memberikan keputusan di antara manusia semuanya, dan semua manusia mellihat apa yang diputuskanNya, kesempurnaan keadilanNya dan kebijaksanaanNya di dalamnya, maka mereka semua pun memujiNya atas hal ini, sampai orang-orang yang mendapat siksa, tidaklah mereka masuk neraka melainkan hati mereka penuh dengan pujian kepadaNya, dan (mereka mengakui) bahwa sesungguhnya siksaan ini akibat dari amal perbuatan mereka sendiri, dan bahwa sesungguhnya Allah Mahaadil dalam keputusanNya menyiksa mereka. Adapun tampaknya pujian kepadaNya di dalam negeri yang penuh nikmat dan pahala (surga), maka hal ini sudah sangat banyak diberitakan oleh nash-nash mutawatir dan dibuktikan oleh dalil sam’I (wahyu) dan aqli. Sebab, mereka di surge melihat limpahan nikmat Allah, curahan kebaikanNya, banyaknya berkahNya dan sangat luasnya pemberianNya yang mana tidak ada satu impian pun dan tidak pula suatu keinginan pun yang tersisa melainkan pasti telah diberi melebihi dari apa yang diimpikan dan diinginkannya. Bahkan mereka diberi kebaikan yang belum pernah terbetik dalam angan-angan mereka dan belum pernah terlintas d dalam hati mereka. Lalu bagaimana menurut anda dengan pujian mereka kepada Rabbnya dalam kondisi seperti ini, disamping di dalam surge itu pun, semua penghalang dan rintangan yang bisa menghalangi manusia untuk mengenal Allah, mencintai dan memujiNya menjadi sirna, dan hal ini menjadi yang paling disukai oleh para penghuninya daripada segala kenikmatan, dan terasa lebih lezat bagi mereka daripada segala kelezatan? Maka dari itu, apabila mereka melihat Allah dan mendengar ucapanNya di saat Dia berbicara kepada mereka, maka hal itu membuat mereka lupa terhadap segala kenikmatan, dan dzikir mereka di dalam surge seperti nafas, terus mengalir sepanjang waktu. Apalagin kalau anda diberi tambahan nikmat yaitu Allah menampakkan setiap saat bagian dari keagungan Allah, kebesaran, keindahan dan keluasan kesempurnaanNYa bagi ahli surge di dalam surge, hal yang mewajibkan mereka makin memuji dan menyanjungNya. “Dan Dia-lah Yang Mahabijaksana,” di dalam kekuasaan dan wewenangNya, Mahabijaksana dalam perintah dan laranganNYa, “lagi Maha Mengetahui” rahasia segala perkkkara."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 1: Allah memulai surat ini dengan pengagungan atas diri-Nya, Dia memiliki puji-pujian yang sempurna. Al Hamdu adalah pujian atas sesuatu yang terpuji dengan keindahan seluruh sifat-sifat-Nya dari sisi keagungan; Sifat Allah berkisar antara keutamaan di mana makhluk memuji dan mensyukuri atas hikmah yang diketahui atas diri Allah dan pujian bagi-Nya. Allah memuji diri-Nya di sini dengan maksud bahwa Dia adalah raja bagi seluruh makhluk di langit maupun di bumi, Allah berkuasa bagi keduanya dengan kehendak yang dimaui oleh-Nya. Alif dan Lam pada Al Hamdu adalah Alif Lam Ta’rif yang maksudnya seluruh pujian bagi-Nya, sebagaimana Allah mengkhususkan pujian di dunia (untuk diri-Nya) dan juga pujian di akhirat, Dia adalah Al Hakim atas seluruh urusan makhluk; Di mana Allah urutkan urusan-urusan di dunia yang mengandung hikmah dan kebaikan bagi makhluk, Dia Maha Mengetahui atas segala urusan-urusan makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni segala puji bagi Allah karena sifat-sifat-Nya yang terpuji dan perbuatan-Nya yang baik, karena semua sifat-Nya terpuji, di mana semua sifat-Nya adalah sifat sempurna, dan perbuatan-perbuatan-Nya juga terpuji karena berjalan di antara karunia-Nya yang patut dipuji dan disyukuri serta di antara keadilan yang patut dipuji dan diakui hikmah-Nya. Dalam ayat ini, Allah Subhaanahu wa Ta'aala memuji Diri-Nya karena milik-Nya apa yang ada di langit dan apa yang ada di bumi. Yakni milik-Nya, hamba-Nya dan ciptaan-Nya, Dia bertindak kepada mereka dengan segala pujian untuk-Nya. Karena di akhirat jelas sekali terpujinya Dia melebihi ketika di dunia. Oleh karena itu, ketika Allah Subhaanahu wa Ta'aala memutuskan masalah di antara makhluk, lalu manusia semua melihat keputusan-Nya, sempurnanya keadilan-Nya dan hikmah (kebijaksanaan)-Nya, maka mereka semua memuji-Nya karena hal tersebut, bahkan orang-orang yang berhak mendapatkan siksa, tidaklah mereka memasuki neraka kecuali hati mereka dipenuhi pujian untuk-Nya, dan bahwa hal itu merupakan balasan terhadap amal mereka, dan bahwa Dia Maha Adil dalam ketetapan-Nya memberi mereka hukuman. Adapun tampak jelas pujian untuk-Nya di surga, maka sudah masyhur dan sesuai dalil sam’i (naqli) dan ‘aqli (akal), karena penghuni surga ketika melihat nikmat Allah yang datang bertutur-turut dan melimpahnya kebaikan-Nya, banyak keberkahan-Nya dan luas pemberian-Nya, di mana tidak ada satu pun angan-angan dan harapan penghuni surga kecuali segera diberikan, bahkan diberikan melebihi angan-angan dan harapannya. Mereka diberi kebaikan yang tidak terbatas sesuai dengan yang mereka angan-angankan dan yang belum pernah terlintas di hati mereka. Lalu bagaimana menurutmu tentang pujian mereka kepada Tuhan mereka dalam menikmati kesenangan yang hakiki itu? Dan lagi, di surga telah hilang segala penghalang dan pemisah yang memisahkan penghuninya dari mengenal Allah, mencintai-Nya dan memuji-Nya. Tentu saja, yang demikian lebih dicintai mereka daripada setiap kenikmatan. Oleh karena itulah, ketika mereka melihat Allah Ta’ala, mendengarkan firman-Nya saat Dia berbicara kepada mereka, membuat mereka lupa dari semua kenikmatan. Bahkan dzikrullah di surga seperti bernafas dan berlanjut terus sepanjang waktu, di samping itu ketika di surga jelas sekali keagungan Allah, kemuliaan-Nya, keindahan-Nya dan luasnya kesempurnaan-Nya yang menghendaki sempurnanya pujian dan sanjungan untuk-Nya. Dalam kerajaan dan pengaturan-Nya, serta bijaksana dalam perintah dan larangan-Nya. Yakni yang mengetahui perkara yang rahasia dan tersembunyi. Oleh karena itulah di ayat selanjutnya disebutkan lebih rinci pengetahuan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 1",
    "description": "Pada bagian pungkasan surah al-a'z'b Allah menegaskan pen-tingnya menunaikan amanat. Di sana Allah juga mengancam orang munafik dan kafir dengan azab yang pedih dan mengampuni dosa orang yang bertobat, karena Allah maha pengampun dan maha penyayang. Surah saba' lantas diawali dengan pujian kepada Allah, pemilik apa saja yang ada di langit dan bumi. Segala puji bagi Allah yang memiliki, menguasai, dan mengatur apa yang ada di langit dan apa yang ada di bumi, dan segala puji di akhirat juga bagi Allah karena dialah penguasa dan pengendali kehidupan akhirat. Dan dialah yang mahabijaksana dalam tindakan dan ciptaan-Nya, mahateliti sehingga mengetahui semua urusan secara rinci. 2. Dengan kemahatelitian-Nya, dia mengetahui apa yang masuk ke dalam bumi, seperti binatang-binatang, air, dan lain-lain. Dia juga mengetahui apa yang keluar darinya seperti benih yang tumbuh, air yang memancar, dan lain-lain. Allah pun mengetahui apa yang turun dari langit seperti malaikat, hujan, dan sebagainya, dan apa yang naik kepadanya seperti uap, doa dan lain-lain. Dan dialah yang maha penyayang kepada semua hamba-Nya, maha pengampun kepada siapa pun yang bertobat."
  }
]