[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memberikan kenabian kepada Dawud, juga kitab dan ilmu, dan Kami berfirman kepada gunung-gunung dan burung-burung, “Bertasbihlah bersamanya.” Dan Kami melunakkan besi baginya, sehingga besi itu seperti adonan yang dia bisa buat sebagaimana yang dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sungguh Kami telah memberi kepada Daud -'alaihissalām- kenabian dan kerajaan dari sisi Kami. Kami berfirman kepada gunung-gunung, “Wahai gunung-gunung! Ulangilah bertasbih bersama Daud. Kami juga berfirman demikian kepada burung-burung. Dan Kami menjadikan besi lunak di tangan Daud agar dia membuat perlengkapan yang dibutuhkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dengan kemuliaan dan keagungan Kami, Kami memberikan karunia yang besar bagi Daud. Allah membuat permisalan dengan Nabi Daud yang menunjukkan kesempurnaan dan kekuasaan-Nya, serta luasnya pemberian-Nya bagi hamba-hamba-Nya yang shalih. Allah menunjukkan karunia-Nya bagi Nabi Daud dalam ayat ini, yaitu dengan keselarasan dirinya dengan gunung dan burung-burung yang ada di sekitarnya. Dengan perintah Allah, gunung-gunung ikut bertasbih dengannya dan begitupula dengan burung-burung. Sebagaimana gunung-gunung tunduk kepadanya meskipun mereka sangat keras, dan burung-burung menjadi jinak baginya meskipun mereka makhluk liar, begitu pula Allah menjadikan besi menjadi lentur baginya, agar dia dapat menjadikannya baju-baju perang yang kokoh; besi-besi itu lentur di tangannya tanpa harus membakar dan memukulnya terlebih dahulu. Dia membuat baju-baju besi yang kuat dengan perintah dan petunjuk dari Allah; Allah telah mengajarkannya cara membuatnya dengan kualitas yang tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَلَقَدْ ءَاتَيْنَا دَاوُۥدَ مِنَّا فَضْلًا ۖ (Dan sesungguhnya telah Kami berikan kepada Daud kurnia dari Kami) Yakni Kami beri dia kenabian dan kitab Zabur. Dan pendapat lain mengatakan, yakni diberi kekuatan untuk melelehkan besi. Dan pendapat yang lebih sesuai bahwa dia diberi apa yang Allah sebutkan dalam ayat ini, yaitu: يا جبال أوبي sampai akhir ayat. يٰجِبَالُ أَوِّبِى مَعَهُۥ(Hai gunung-gunung, bertasbihlah berulang-ulang bersama Daud) Yakni Kami berfirman: Hai gunung-gunung, bertasbihlah bersama dengan tasbih Daud. وَالطَّيْرَ ۖ( dan begitu juga kalian hai burung-burung) Yakni dan Kami tundukkan burung-burung agar bertasbih bersamanya. وَأَلَنَّا لَهُ الْحَدِيدَ (dan Kami telah melunakkan besi untuknya) Yakni Kami jadikan besi itu lunak baginya agar dia dapat menjadikannya apa yang dia inginkan. Terdapat pendapat mengatakan bahwa besi itu menjadi lunak seperti lilin tanpa harus dia panaskan dalam api terlebih dahulu. Wallahu a’lam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Kami telah menganugerahkan kepada Dawud risalah kenabian, kerajaan dan kitab yaitu Zabur, juga suara yang merdu. Kami katakan: wahai gunung-gunung kembalilah dan bertasbihlah bersamanya ketika dia bertasbih atau mensucikan asma Allah. Kami juga telah menjadikan burung-burung untuk bertasbih bersamanya. Kami juga menjadikan besi yang ada di tangannya menjadi lembut seperti adonan. Juga Kami ajarkan kepadanya cara melunakkan besi tanpa harus memanaskannya sehingga dia bisa membuatnya sesuai keinginannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menganugerahkan} memberikan {kepada Dawud karunia dari Kami} kenabian dan kerajaan {“Wahai gunung-gunung dan burung-burung, bertasbihlah kepadaKu bersamanya} bertasbihlah kepadaKu bersama Dawud {Kami telah melunakkan besi untuknya} Kami menjadikan besi itu lunak di tangannya layaknya adonan. Dia membuat apa yang dia kehendaki tanpa menggunakan api dan memukulkan palu padanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Kami telah memberikan nikmat kepada hamba dan rasul kami, Dawud, dan Kami memberikan karunia kepadanya berupa ilmu yang bermanfaat, amal shalih, dan berbagai nikmat agama dan dunia. Dan di antara nikmatNya kepadanya adalah, 1. Allah mengistimewakannya dengan memerintah benda-benda mati seperti gunung-gunung dan hewan-hewan dari jenis burung untuk bertasbih berulang-ulang bersamanya memuji Tuhannya sebagai (bentuk) kepatuhan kepadaNya. Ini merupakan nikmat kepada Dawud, karena hal itu menjadi salah satu keistimewaannya yang belum pernah diberikan kepada seorang nabi pun sebelumnya dan sesudahnya; dan hal ini menjadi pembangkit baginya dan bagi yang lain untuk bertasbih kepada Allah apabila mereka melihat benda-benda mati dan berbagai hewan merespons sesuatu dengan bertasbih kepada Rabbnya, mengagungkan, membesarkan dan memujiNYa. Hal ini termasuk hal yang membangkitkan semangat berdzikir kepada Allah. 2. Sesungguhnya hal itu terjadi, (sebagaimana pendapat kebanyakan ulama), adalah karena kemerduan suara Dawud. Sebab Allah telah mengaruniakan kepadanya suara yang sangat indah yang mengungguli manusia lainnya. Dan apabila dia mengulang-ulang tasbih, tahlil dan tamjid dengan suara yang sangat merdu lagi indah itu, maka setiap orang yang mendengarnya, dari bangsa jin dan manusia hingga burung-burung dan gunung-gunung tertarik padanya dan ikut bertasbih memuji Rabbnya. 3. Dan bahwa bisa jadi Nabi Dawud mendapat pahala tasbih mereka, karena dia telah menjadi sebabnya, karena dia telah menjadi sebabnya, mereka beratsbih mengikutinya. Di antara karunia Allah kepadaNYa adalah Allah melunakkan besi untuknya membuat baju besi yang sempurna, dan Allah mengajarkan kepadanya cara membuatnya, yaitu mengukurnya dalam “anyamannya.” Maksudnya, dia mengukurnya seukuran lingkaran dan membuatnya, lalu menganyamkannya. Allah berfirman,\" Dan telah Kami ajarkan kepada Daud membuat baju besi untuk kamu, guna memelihara kamu dalam peperanganmu; Maka hendaklah kamu bersyukur (kepada Allah).\" (Al-Anbiya:80) Ketika Allah menjelaskan apa yang dikaruniakanNya kepadanya dan kepada keluarganya, maka Dia memerintahkannya supaya bersyukur kepadaNya dan beramal shalih serta selalu merasa diawasi oleh Allah di dalamnya di mana Allah telah memperbaiki keadaannya dan menjaganya dari segala hal yang merusak. Sebab, sesungguhnya Allah Maha Melihat semua perbuatan mereka dan mengetahuinya, tidak ada sesuatu apa pun yang tersembunyi dariNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 10: Allah mengabarkan bahwa Dia memberikan karunia kepada semua Nabi dan mukjizat yang pantas (mencocoki) bagi kaumnya, di antara mereka adalah Dawud; Allah mengabarkan bahwa Dawud diberikan kenabian dan kitab yaitu zabur serta kerajaan. Dawud memerintahkan gunung dan burung untuk bertasbih kepada Allah, dan dapat menundukkan besi menjadi lunak dan dijadikan semisal adonan sampai-sampai dibentuk menurut kehendaknya dengan tanpa dimasukkan terlebih dahulu ke dalam api (untuk dibentuk), atau ditempa dengan alat penempa besi panas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami telah memberikan nikmat kepada hamba dan Rasul Kami Dawud ‘alaihis salam dengan kenabian dan kitab. Kami telah memberikan karunia kepadanya ilmu yang bermanfaat dan amal yang saleh, nikmat agama dan dunia. Termasuk nikmat-Nya kepadanya adalah apa yang Allah istimewakan kepada Beliau berupa perintah-Nya kepada benda-benda mati, seperti gunung, dan makhluk hidup seperti burung-burung untuk mengulang-ulang tasbih dan tahmid bersama Beliau. Dalam hal ini terdapat nikmat kepada Beliau, karena termasuk keistimewaannya yang belum pernah diberikan kepada seorang pun sebelum Beliau dan seorang pun setelahnya dan bahwa hal itu dapat mendorongnya dan mendorong yang lain untuk bertasbih ketika melihat benda mati dan benda hidup ini saling bersahut-sahutan untuk bertasbih, bertahmid dan bertakbir, sehingga membantu dzikrullah. Di samping itu, sebagaimana dikatakan banyak ulama, bahwa hal itu karena gembira mendengarkan suara Dawud, di mana Alah telah memberinya suara yang indah yang melebihi orang lain. Oleh karena itu, apabila Beliau mengulang-ulang tasbih, tahlil (ucapan Laailaahaillallah) dan tahmid dengan suara yang merdu itu, maka bergembiralah dengan riang setiap yang mendengarnya, baik manusia, jin, bahkan burung-burung dan gunung-gunung. Mereka bertasbih dengan memuji Tuhannya. Bisa juga agar Beliau memperoleh pahala tasbihnya, karena ia yang menjadi sebab, sehingga yang lain mengikuti tasbihnya. Termasuk keutamaan yang Allah berikan untuk Beliau adalah dilunakkan-Nya besi untuk Beliau untuk membuat baju besi yang besar-besar. Alah juga mengajarkan kepada Beliau bagaimana cara membuatnya dan mengukur anyamannya. Oleh karena itu, menurut sebagian mufassir, besi di tangan Beliau seperti adonan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 10",
    "description": "10-11. Usai menjelaskan tanda-tanda kekuasaan-Nya di alam semesta yang diharapkan dapat meningkatkan keimanan manusia, pada ayat ini Allah menyebutkan anugerah-Nya kepada salah seorang hamba yang taat, nabi daud. Dan sungguh, telah kami berikan kepada daud karunia yang besar dari kami. Kami berfirman, 'wahai gunung-gunung dan burung-burung! bertasbihlah berulang-ulang bersama daud. ' dan selain anugerah itu, kami juga telah melunakkan besi untuknya seperti lilin agar bisa dimanfaatkan sesuai kebutuhan. Lalu kami perintahkan, 'buatlah baju besi yang besar-besar dan ukur-lah anyamannya agar nyaman dipakai dan menjadi perisai bagi pemakainya. ' dan sebagai bentuk syukur atas anugerah itu kami berfirman kepadanya, 'kerjakanlah kebajikan. Sungguh, aku maha melihat apa yang kamu kerjakan. '10-11"
  }
]