[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Yaitu) hendaklah engkau membuat baju-baju besi yang sempurna dan luas, tancapkan paku-paku pada sambungan-sambungannya. Jangan membuat lingkaran-lingkaran kecil karena ia lemah, sehingga baju perang tidak mampu melindungi pemakainya. Jangan menjadikannya besar sehingga ia memberatkan pemakainya. Beramallah wahai Dawud, kamu dan keluargamu, dengan taat kepada Allah. Sesungguhnya Aku Maha Melihat apa yang kalian lakukan, tidak ada sesuatu pun yang tersembunyi dariKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Wahai Daud! Buatlah baju-baju perang yang longgar untuk melindungi pasukanmu dari senjata musuh, buatlah kait-kait yang sesuai untuk lingkaran-lingkarannya, tidak pipih sehingga lingkaran-lingkaran itu ringkih, tidak pula tebal sehingga ia tidak masuk ke dalamnya. Kerjakanlah amal saleh, sesungguhnya Allah Maha melihat apa yang kalian lakukan, tidak ada sedikit pun dari amal-amal kalian yang tersembunyi bagi-Ku, dan Aku akan membalas kalian karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Kami memerintahkan kepadanya untuk menciptakan baju-baju perang yang kuat dengan rantai-rantai yang teratur, agar menjadi baju perang yang kokoh dan tidak dapat tertembus anak panah. Dan Kami memerintahkannya untuk bersungguh-sungguh dalam menjalankan amal shalih yang manfaatnya luas dan dapat dirasakan di masa sekarang dan mendatang. Aku Maha Melihat perbuatan kalian, baik itu yang kecil maupun yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. أَنِ اعْمَلْ سٰبِغٰتٍ (yaitu) buatlah baju besi yang besar-besar) Yakni baju besi yang sempurna dan lebar, yang dapat menutupi seluruh badan. وَقَدِّرْ فِى السَّرْدِ ۖ( dan ukurlah anyamannya) Makna (السرد) adalah anyaman pada baju besi. Yakni janganlah kamu jadikannya terlalu kecil sehingga tidak kuat dalam menahan serangan, dan jangan pula terlalu besar sehingga memberatkan orang yang memakainya. Dan inilah yang dimaksud dengan mengukurnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kami perintahkan kepadanya untuk membuat baju besi dengan anyaman dan ukuran yang sesuai dengan badannya. Dia adalah orang yang pertama kali membuat seperti itu. Dia juga yang pertama mampu untuk merajut sesuatu sesuai kebutuhannya yang disesuaikan dengan kebutuhannya. Kami katakan kepadanya dan keluarganya: “Kerjakanlah amal saleh sebagai rasa syukur kepada Allah, Aku Maha Mengawasi atas segala amal kalian, sehingga akan Aku beri balasan kepada kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Buatlah baju-baju besi besar} baju besi yang besar {dan ukurlah anyamannya} ukurlah paku –paku dalam membuat baju besi itu, dan jangan menjadikan baju besi itu tipis, sehingga (senjata) bosa lolos dan tidak terlalu kasar sehingga menghancurkan orang yang mengenakannya {serta kerjakanlah amal shalih. Sesungguhnya Aku Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-11. Kami telah memberikan nikmat kepada hamba dan rasul kami, Dawud, dan Kami memberikan karunia kepadanya berupa ilmu yang bermanfaat, amal shalih, dan berbagai nikmat agama dan dunia. Dan di antara nikmatNya kepadanya adalah, 1. Allah mengistimewakannya dengan memerintah benda-benda mati seperti gunung-gunung dan hewan-hewan dari jenis burung untuk bertasbih berulang-ulang bersamanya memuji Tuhannya sebagai (bentuk) kepatuhan kepadaNya. Ini merupakan nikmat kepada Dawud, karena hal itu menjadi salah satu keistimewaannya yang belum pernah diberikan kepada seorang nabi pun sebelumnya dan sesudahnya; dan hal ini menjadi pembangkit baginya dan bagi yang lain untuk bertasbih kepada Allah apabila mereka melihat benda-benda mati dan berbagai hewan merespons sesuatu dengan bertasbih kepada Rabbnya, mengagungkan, membesarkan dan memujiNYa. Hal ini termasuk hal yang membangkitkan semangat berdzikir kepada Allah. 2. Sesungguhnya hal itu terjadi, (sebagaimana pendapat kebanyakan ulama), adalah karena kemerduan suara Dawud. Sebab Allah telah mengaruniakan kepadanya suara yang sangat indah yang mengungguli manusia lainnya. Dan apabila dia mengulang-ulang tasbih, tahlil dan tamjid dengan suara yang sangat merdu lagi indah itu, maka setiap orang yang mendengarnya, dari bangsa jin dan manusia hingga burung-burung dan gunung-gunung tertarik padanya dan ikut bertasbih memuji Rabbnya. 3. Dan bahwa bisa jadi Nabi Dawud mendapat pahala tasbih mereka, karena dia telah menjadi sebabnya, karena dia telah menjadi sebabnya, mereka beratsbih mengikutinya. Di antara karunia Allah kepadaNYa adalah Allah melunakkan besi untuknya membuat baju besi yang sempurna, dan Allah mengajarkan kepadanya cara membuatnya, yaitu mengukurnya dalam “anyamannya.” Maksudnya, dia mengukurnya seukuran lingkaran dan membuatnya, lalu menganyamkannya. Allah berfirman,\" Dan telah Kami ajarkan kepada Daud membuat baju besi untuk kamu, guna memelihara kamu dalam peperanganmu; Maka hendaklah kamu bersyukur (kepada Allah).\" (Al-Anbiya:80) Ketika Allah menjelaskan apa yang dikaruniakanNya kepadanya dan kepada keluarganya, maka Dia memerintahkannya supaya bersyukur kepadaNya dan beramal shalih serta selalu merasa diawasi oleh Allah di dalamnya di mana Allah telah memperbaiki keadaannya dan menjaganya dari segala hal yang merusak. Sebab, sesungguhnya Allah Maha Melihat semua perbuatan mereka dan mengetahuinya, tidak ada sesuatu apa pun yang tersembunyi dariNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 11: Allah menjelaskan bahwa Dawud melunakkan besi untuk dirajut dijadikan baju besi yang panjang dan lebar yang melindungi ketika berperang, dan Allah mengabarkan bahwa bagaimana besi bisa dirajut menjadi baju besi dan menjadi rapi satu sama lain (dari besi-besi yang dikaitkan). Kemudian Allah memerintakan keluarga Dawud agar taat kepada Allah, dan menjauhi maksiat, karena sesungguhnya Allah melihat amalan-amalan kalian, tidak tersembunyi bagi-Ku sesuatupun dari amalan-amalan kalian, dan kalian akan dibalas menurut apa yang kalian kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepada Dawud dan keluarganya, Allah memerintahkan mereka untuk bersyukur dan beramal saleh, merasakan pengawasan dari Allah dengan memperbaiki dan menjaga amalnya dari hal yang merusak, karena Dia melihat amal mereka, mengetahuinya dan tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 11",
    "description": "10-11. Usai menjelaskan tanda-tanda kekuasaan-Nya di alam semesta yang diharapkan dapat meningkatkan keimanan manusia, pada ayat ini Allah menyebutkan anugerah-Nya kepada salah seorang hamba yang taat, nabi daud. Dan sungguh, telah kami berikan kepada daud karunia yang besar dari kami. Kami berfirman, 'wahai gunung-gunung dan burung-burung! bertasbihlah berulang-ulang bersama daud. ' dan selain anugerah itu, kami juga telah melunakkan besi untuknya seperti lilin agar bisa dimanfaatkan sesuai kebutuhan. Lalu kami perintahkan, 'buatlah baju besi yang besar-besar dan ukur-lah anyamannya agar nyaman dipakai dan menjadi perisai bagi pemakainya. ' dan sebagai bentuk syukur atas anugerah itu kami berfirman kepadanya, 'kerjakanlah kebajikan. Sungguh, aku maha melihat apa yang kamu kerjakan. '12. Tidak hanya kepada nabi daud, kami juga melimpahkan anugerah kepada putranya, nabi sulaiman. Dan kami tundukkan angin bagi nabi sulaiman, yang kecepatan perjalanannya pada waktu pagi sama dengan kecepatan perjalanan manusia selama sebulan, dan perjalanannya pada waktu sore sama dengan perjalanan manusia selama sebulan pula. Maksudnya, bila nabi sulaiman mengadakan perjalanan dari pagi sampai tengah hari maka jarak yang ditempuhnya sama dengan jarak perjalanan unta yang cepat dalam sebulan. Begitu pula, bila dia mengadakan perjalanan dari tengah sampai sore hari. Dan sebagai anugerah lain bagi nabi sulaiman, kami alirkan cairan tembaga baginya seperti air yang bisa dia kendalikan dan bentuk sesuai keinginan. Dan selain itu, sebagian dari jin ada yang bekerja di hadapannya, yakni tunduk kepada perintah dan kekuasaannya dengan izin tuhannya. Dan siapa yang menyimpang di antara mereka dari perintah nabi sulaiman yang pada hakikatnya adalah perintah kami, kami rasakan kepadanya azab neraka yang apinya menyala-Nyala."
  }
]