[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tundukkan angin untuk Sulaiman, ia berhembus dari pagi sampai tengah hari dengan perjalanan satu bulan dan dari tengah hari sampai malam dengan perjalanan satu bulan, dengan (ukuran) perjalanan biasa. Dan Kami lebur tembaga untuknya sebagaimana air mengalir, yang dia gunakan sesukanya. Dan Kami menundukkan untuknya jin untuk bekerja kepadanyaa dengan izin Tuhannya. Barangsiapa yang menyimpang diantara mereka dari perintah Kami yang telah Kami tetapkan, yaitu mereka harus menaati Sulaiman, Kami akan menimpakan kepadaNya siksa api neraka yang terus menerus menyala."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Kami menundukkan angin untuk Sulaiman bin Daud -'alaihimassalām-, ia bergerak di pagi hari sejauh perjalanan sebulan, ia bergerak di sore hari sejauh perjalanan sebulan, Kami mencairkan tembaga baginya sehingga dia membuat apa yang dia kehendaki dari tembaga, Kami menundukkan jin yang bekerja untuknya dengan perintah Tuhannya. Dan jin mana pun yang menyimpang dari apa yang telah kami perintahkan, maka Kami akan membuatnya merasakan azab api Neraka yang berkobar-kobar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah juga memberi karunia kepada Sulaiman; Allah menundukkan baginya angin yang berhembus sesuai dengan perintahnya, angin itu dapat membawanya dan membawa tentaranya ke tempat yang jauh dalam waktu singkat. Dan Allah mengeluarkan cairan tembaga yang keluar dari tanah baginya, sehingga tembaga itu dapat digunakan sebagai peralatan rumah dan perang. Allah juga menundukkan jin-jin baginya; mereka bekerja di hadapannya, dia mengawasi dan memberi tugas bagi mereka. Jin-jin itu bekerja untuk membangun tempat tinggal, tempat ibadah, wadah-wadah besar dan patung-patung; dan sebagian mereka menyelam untuk mengeluarkan perhiasan dari laut. Dan jika ada dari mereka yang melanggar perintah Kami untuk mentaati Sulaiman, maka Kami akan menyiksa mereka dengan azab neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَلِسلَيْمٰنَ الرِّيحَ (Dan Kami (tundukkan) angin bagi Sulaiman) Yakni dan Kami tundukkan angin bagi Sulaiman. Sudiy berkata: bahwa angin itu mengangkat karpetnya untuk terbang. غُدُوُّهَا شَهْرٌ وَرَوَاحُهَا شَهْرٌ ۖ( yang perjalanannya di waktu pagi sama dengan perjalanan sebulan dan perjalanannya di waktu sore sama dengan perjalanan sebulan) Yakni mampu menempuh jarak perjalanan sebulan pada pagi hari saja, dan begitu pula pada sore hari. وَأَسَلْنَا لَهُۥ عَيْنَ الْقِطْرِ ۖ( dan Kami alirkan cairan tembaga baginya) Yakni Kami lelehkan tembaga baginya sebagaimana Kami lunakkan besi bagi Daud. وَمِنَ الْجِنِّ مَن يَعْمَلُ بَيْنَ يَدَيْهِ بِإِذْنِ رَبِّهِۦ ۖ( Dan sebahagian dari jin ada yang bekerja di hadapannya (di bawah kekuasaannya) dengan izin Tuhannya) Yakni dan Kami tundukkan baginya jin yang bekerja di hadapannya membuat istana dan lainnya sebagaimana yang akan disebutkan. وَمَن يَزِغْ مِنْهُمْ عَنْ أَمْرِنَا(Dan siapa yang menyimpang di antara mereka dari perintah Kami) Yakni dari perintah Kami kepada mereka. Yaitu perintah mentaati Sulaiman. نُذِقْهُ مِنْ عَذَابِ السَّعِيرِ(Kami rasakan kepadanya azab neraka yang apinya menyala-nyala) Dan azab ini diberikan di akhirat. Namun pendapat lain mengatakan, diberikan di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Kami jadikan angin tunduk kepada Nabi Sulaiman, yang berjalan dengan cepat saat perjalanan pada waktu pagi hingga siang setara dengan perjalanan satu bulan. Juga kami jalankan hingga terbenam matahari yang setara dengan perjalanan satu bulan.Kami alirkan cairan tembaga untuknya. Kami tundukkan baginya juga para jin untuk mengerjakan perintahnya atas izin Tuhannya. Barang siapa membangkang kepada perintah Kami untuk taat, maka akan Kami berikan pada mereka azab neraka di akhirat, atau api yang menyala-nyala di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bagi Sulaiman angin yang perjalanannya pada waktu pagi sama dengan sebulan} perjalannya pada waktu pagi itu sama dengan satu bulan {dan perjalanannya pada waktu sore sama sebulan} dan perjalanannya pada waktu petang sama dengan satu bulan {dan Kami mengalirkan} mengalirkan {untuknya cairan tembaga} cairan tembaga {Sebagian dari jin ada yang bekerja di hadapannya dengan izin Tuhannya} dengan perintah Tuhannya {Siapa saja yang menyimpang} menyimpang {di antara mereka} di antara jin {dari perintah Kami, Kami merasakan untuknya azab neraka Sa‘ir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Ketika Allah menjelaskan karuniaNya kepada Dawud maka Dia menyebutkan karuniaNya kepada putranya, Sulaiman, dan bahwasanya Allah telah menundukkan angin kepadanya yang bertiup menurut perintahnya, membawanya dan membawa segala sesuatu yang dibawa Sulaiman, dan ia menempuh jarak yang sangat jauh sekali dalam waktu yang sangat singkat, sehingga dalam satu hari ia dapat menempuh perjalanan dua bulan, “yang perjalanannya di waktu pagi sama dengan perjalanan sebulan.” Maksudnya, dari pagi hingga matahari condong ke barat, “dan perjalanannya di waktu sore sama dengan perjalanan sebulan pula,” maksudnya, dari senja hingga akhir malam, ”dan Kami mengalirkan cairan tembaga baginya,” maksudnya, Kami menundukkan kepadanya cairan tembaga dan memudahkan sarana perbuatan berbagai bejana dan lain-lainnya darinya. Dan demikian pula, Allah menundukkan setan-setan dan jin-jin kepadanya, mereka sama sekali tidak mampu untuk menghindari perintahnya. “Dan siapa yang menyimpang dari kalangan mereka dari perintah Kami, niscaya Kami rasakan kepadanya azab neraka yang apinya menyala-nyala.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 12: Allah mengabarkan bahwasanya sebagaiamana dikaruniakan sebagian mukjizat kepada Dawud; Begitu juga dikaruniakan kepada anaknya yaitu Sulaiman yang memiliki kerajaan dan kenabian. Allah tundukkan bagi Sulaiman angin yang membawa pasukan Sulaiman, yang berjalan sejak awal siang yang perjalanannya sama dengan satu bulan, begitu juga berjalan di sore hari yang perjalanannya sama dengan satu bulan, yang semestinya sampai dalam waktu dua bulan, maka cukup bagi Sulaiman dengan satu hari sampai dan mukjizat yaitu mengeluarkan mata air jernih dan juga melelehkan tembaga sehingga seperti mata air yang mengalir dan juga menundukkan jin dan setan-setan yang diperintah dengan kekuasaannya atas izin Allah. Kemudian Allah mengabarkan, barangsiapa dari para jin berpaling dari perintah Allah untuk mentaati Sulaiman, maka Allah akan timpakan adzab neraka yang menyala-nyala, yang Allah ciptakan bagi siapa saja yang jauh dari perintah Allah yang sampai kepada mereka melalui para Nabi-Nabi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keutamaan Dawud ‘alaihis salam, Dia menyebutkan keutamaan putranya yaitu Nabi Sulaiman ‘alaihis salam, dan bahwa Allah telah menundukkan angin untuknya yang berhembus mengikuti perintahnya dan dapat membawanya serta membawa apa yang bersamanya, bahkan perjalanan yang jauh hanya ditempuh dalam waktu sebentar, sehingga dalam sehari Beliau dapat menempuh jarak perjalanan yang biasa memakan waktu dua bulan. Maksudnya, jika Sulaiman mengadakan perjalanan dari pagi sampai tengah hari maka jarak yang ditempuhnya sama dengan jarak perjalanan unta yang cepat dalam sebulan. Begitu pula jika ia mengadakan perjalanan dari tengah hari sampai sore, maka kecepatannya sama dengan perjalanan sebulan. Yakni kami tundukkan untuknya cairan tembaga dan Kami mudahkan segala sebab untuk menghasilkan barang-barang darinya, seperti bejana dan lain-lain. Allah juga menundukkan setan dan jin kepada Beliau, sehingga mereka tidak sanggup mendurhakai perintahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 12",
    "description": "Tidak hanya kepada nabi daud, kami juga melimpahkan anugerah kepada putranya, nabi sulaiman. Dan kami tundukkan angin bagi nabi sulaiman, yang kecepatan perjalanannya pada waktu pagi sama dengan kecepatan perjalanan manusia selama sebulan, dan perjalanannya pada waktu sore sama dengan perjalanan manusia selama sebulan pula. Maksudnya, bila nabi sulaiman mengadakan perjalanan dari pagi sampai tengah hari maka jarak yang ditempuhnya sama dengan jarak perjalanan unta yang cepat dalam sebulan. Begitu pula, bila dia mengadakan perjalanan dari tengah sampai sore hari. Dan sebagai anugerah lain bagi nabi sulaiman, kami alirkan cairan tembaga baginya seperti air yang bisa dia kendalikan dan bentuk sesuai keinginan. Dan selain itu, sebagian dari jin ada yang bekerja di hadapannya, yakni tunduk kepada perintah dan kekuasaannya dengan izin tuhannya. Dan siapa yang menyimpang di antara mereka dari perintah nabi sulaiman yang pada hakikatnya adalah perintah kami, kami rasakan kepadanya azab neraka yang apinya menyala-Nyala. 13. Mereka, para jin, bekerja untuk sulaiman sesuai dengan apa yang dikehendakinya, di antaranya membangun gedung-gedung yang tinggi, patung-patung sebagai hiasan, piring-piring yang besarnya seperti kolam dan periuk-periuk yang tetap berada di atas tungku. Begitu besar dan berat periuk-periuk itu hingga ia tidak dapat digerakkan. Bekerjalah, wahai keluarga daud untuk menjadi bukti rasa bersyukur kepada Allah. Dan ketahuilah bahwa sedikit sekali dari hamba-hamba-ku yang bersyukur secara sempurna, yakni dengan hati, ucapan, dan perbuatan."
  }
]