[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jin membuat untuk Sulaiman apa yang dikehendakinya berupa tempat-tempat ibadah, gambar-gambar dari kaca dan tembaga, nampan-nampan besar seperti telaga tempat air dan bejana-bejana yang menetap di suatu tempat dan tidak bergerak karena besarnya. Dan Kami berfirman, “Wahai keluarga Dawud, beramalah untuk mensyukuri Allah atas apa-apa yang telah Dia berikan kepada kalian, dan hal itu dengan menaatiNya dan menjalankan perintah-perintahNya.” Hanya sedikit dari hamba-hambaKu yang banyak bersyukur, dan Dawud dengan keluarganya termasuk yang sedikit itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Para jin itu bekerja untuk Sulaiman, mereka membuat apa yang Sulaiman kehendaki berupa tempat-tempat ibadah untuk salat, istana-istana, gambar-gambar, mangkuk-mangkuk yang seperti telaga karena daya tampungnya dan bejana-bejana yang kokoh di tempatnya. Kami berfirman kepada mereka, \"Wahai keluarga Daud! beramallah sebagai bukti syukur kepada Allah atas apa yang Dia nikmatkan kepada kalian, dan hanya sedikit dari hamba-hamba-Ku yang bersyukur kepada-Ku atas nikmat yang Aku berikan kepada mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Jin-jin itu membangun bangunan-bangunan tinggi bagi Sulaiman sebagai tempat ibadah dan tempat tinggal; memahat patung-patung, dan membuat wadah-wadah tempat air, serta alat-alat dapur yang besar. Wahai keluarga Daud, laksanakanlah ketaatan kepada Allah sebagai rasa syukur kepada-Nya atas apa yang telah Dia berikan kepada kalian. Dan sedikit sekali hamba-hamba-Ku yang banyak bersyukur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. يَعْمَلُونَ لَهُۥ مَا يَشَآءُ مِن مَّحٰرِيبَ (Para jin itu membuat untuk Sulaiman apa yang dikehendakinya dari gedung-gedung yang tinggi) Yakni bangunan-bangunan dan istana-istana yang tinggi. Pendapat lain mengatakan yang dimaksud adalah membuat mihrab-mihrab masjid. وَتَمٰثِيلَ(dan patung-patung) Makna (التماثيل) yakni segala patung yang berbentuk binatang yang terbuat dari tembaga, kaca, marmer, dan lain sebagainya. Pendapat lain mengatakan bahwa patung-patung ini dibentuk seperti bentuk para nabi, malaikat, ulama, dan orang-orang shaleh. Terdapat pendapat mengatakan bahwa pembuatan patung pada zaman Nabi Sulaiman dibolehkan, kemudian hukum ini dihapus dalam syariat nabi Muhammad. وَجِفَانٍ كَالْجَوَابِ(dan piring-piring yang (besarnya) seperti kolam) Yakni nampan-nampan yang besar seukuran kolam yang digunakan untuk memberi minum unta-unta. Nampan ini digunakan untuk makan bersama-sama oleh sekelompok orang. وَقُدُورٍ رَّاسِيٰتٍ (dan periuk yang tetap (berada di atas tungku)) Yakni panci-panci yang tidak dapat dipindah atau digerakkan karena sangat besar, yang digunakan untuk memasak makanan bagi para tentaranya. اعْمَلُوٓا۟ ءَالَ دَاوُۥدَ شُكْرًا ۚ( Bekerjalah hai keluarga Daud untuk bersyukur (kepada Allah)) Yakni dan Kami firmankan kepadanya: ‘lakukanlah amal ketaatan wahai keluarga Daud, sebagai bentuk rasa syukur kepada Allah atas apa yang telah Dia berikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Para jin itu melakukan apa yang dikehendaki Sulaiman, mereka membangun bangunan-bangunan yang tinggi dan istana-istana yang tinggi. Makna asli dari mihrab adalah tempat ibadah. Juga patung-patung yang menggambarkan gambaran objek aslinya yang terbuat dari tembaga, ada pula yang dari kaca serta batu pualam. Perlu diketahui bahwa membuat patung itu diperbolehkan dalam syariat Nabi Sulaiman, adapun di dalam Islam diharamkan. Juga piring-piring besar yang besarnya seperti kolam atau tempat air yang sangat besar, yang dapat dipakai makan untuk seribu orang. Juga ada periuk yang tetap di atas tungkunya dan tidak bergerak dari tempatnya karena ukurannya yang sangat besar untuk memasak makanan. Kami berkata kepada mereka: Wahai keluarga Nabi Dawud, lakukanlah ketaatan kepada Allah, sebagai ungkapan syukur atas nikmat yang engkau terima. Mereka yang mau bersyukur sangat sedikit. Asy syakur adalah melaksanakan ketaatan dan mengungkapkan rasa syukur atas nikmat dengan hati, lisan dan anggota badan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bekerja untuknya sesuai dengan kehendaknya. Di antaranya (membuat) gedung-gedung tinggi} masjid-masjid dan kastil-kastil {patung-patung} bentuk ukiran dari kaca, tembaga dan marmer {piring-piring} mangkuk-mangkuk yang sangat besar {seperti kolam} kolam-kolam air yang sangat besar {dan periuk-periuk yang tetap} kokoh yang memiliki tiang-tiang yang tidak bisa digerakkan dari tempatnya, karena sangat besar {Bekerjalah wahai keluarga Dawud untuk bersyukur. Dan sedikit sekali dari hamba-hambaKu yang banyak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Dan pekerjaan mereka adalah melakukan segala sesuatu yang dikehendaki oleh Sulaiman, maka mereka mengerjakannya, “dari bangunan-bangunan yang tinggi” maksudnya, setiap bangunan yang dibangun dengannya gedung-gedung menjadi kokoh. Keterangan ini menginformasikan tentang gedung-gedung raksasa, “dan patung-patung,” maksudnya, gambar-gambar berbagai hewan dan benda-benda mati dari kecanggihan buatan mereka dan kemampuan mereka melakukan hal itu, dan mereka bekerja untuk sulaiman, ”dan piring-piring seperti kolam,” yaitu seperti kolam-kolam besar yang mereka kerjakan untuk Sulaiman sebagai tempat makanan, sebab dia membutuhkan sesuatu yang tidak dibutuhkan oleh orang lainnya, “dan” mereka juga membuatkan untuknya periuk “yang tetap kokoh” tidak bisa dipindah dari tempatnya karena sangat besar. Setelah Allah mengingatkan karuniaNya kepada mereka, maka Dia memerintahkan mereka untuk mensyukurinya, seraya berfirman, “Bekerjalah, hai keluarga Dawud.” Mereka adalah Dawud, anak-anaknya dan keluarganya. Sebab karunia itu diberikan kepada mereka semua; dan kebanyakan maslahatnya kembali kepada mereka semua, “untuk bersyukur”, kepada Allah atas apa yang telah dikaruniakanNya kepada mereka sebagai timbal balik dari apa yang telah dianugerahkanNya. “Dan sedikit sekali dari hamba-hambaKu yang berterima kasih,” jadi kebanyakan mereka tidak bersukur kepada Allah atas karunia yang dianugerahkanNYa kepada mereka, berupa berbagai nikmat dan mencegah berbagai bencana dari mereka. Dan bersukur adalah mengakui dengan hati akan karunia Allah dan menerimanya dengan penuh rasa butuh kepadanya serta menggunakannya dalam rangka ketaatan kepada Allah dan memeliharanya dari penggunaan dalam kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 13: Allah mengabarkan mereka para jin, mereka berkehendak sesuka mereka, yaitu membangun bangunan-bangunan yang menjulang tinggi. Mereka juga membuat patung-patung binatang-binatang dan benda-benda mati seperti tembaga, gelas-gelas kaca, batu marmer dan selainnya, mereka juga membuat bejana-bejana besar seperti telaga-telaga unta (untuk minum); Yang dapat mengumpulkan mereka untuk tempat makan yang besar. Kemudian Allah berkata kepada Dawud : Beramallah wahai keluarga Dawud dengan ketaatan kepada Allah dan rasa syukur atas nikmat yang telah diberikan kepada kalian. Maka sedikit dari hamba Allah yang memperbanyak rasa syukur atas nikmat yang Allah berikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu tidak haram membuat patung. Adapun dalam syariat Nabi Muhammad shallallahu 'alaihi wa sallam hal itu diharamkan dengan tegas karena menjadi sarana kepada kesyirkkan. Mereka membuatnya untuk Sulaiman, yakni untuk makan, karena Beliau membutuhkan yang tidak dibutuhkan selain Beliau. Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepada mereka, Dia memerintahkan mereka mensyukuri-Nya. Mereka adalah Dawud, keluarga dan istrinya, karena nikmat itu mengena kepada semuanya, dan maslahatnya kembali kepada mereka semua. Atas pemberian itu. Yakni kebanyakan mereka tidak bersyukur kepada Allah Ta’ala atas nikmat yang diberikan itu. Syukur adalah mengakui dengan hatinya nikmat Allah, menerima karena butuh kepada-Nya, mengalihkannya untuk ketaatan kepada Allah dan menjaganya dari mengalihkan untuk maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 13",
    "description": "Mereka, para jin, bekerja untuk sulaiman sesuai dengan apa yang dikehendakinya, di antaranya membangun gedung-gedung yang tinggi, patung-patung sebagai hiasan, piring-piring yang besarnya seperti kolam dan periuk-periuk yang tetap berada di atas tungku. Begitu besar dan berat periuk-periuk itu hingga ia tidak dapat digerakkan. Bekerjalah, wahai keluarga daud untuk menjadi bukti rasa bersyukur kepada Allah. Dan ketahuilah bahwa sedikit sekali dari hamba-hamba-ku yang bersyukur secara sempurna, yakni dengan hati, ucapan, dan perbuatan. 14. Betapa pun besarnya kekuasaan nabi sulaiman hingga bisa mem-pekerjakan jin sesuai keinginannya, namun begitu ajalnya tiba maka tidak akan ada yang dapat menundanya. Maka ketika kami telah menetapkan kematian atasnya, nabi sulaiman, tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap yang memakan tongkatnya yang dijadikan sandaran ketika dia wafat. Maka ketika dia, yakni je-nazah nabi sulaiman, telah jatuh tersungkur, tahulah jin itu bahwa dia telah wafat. Inilah bukti bahwa jin tidak mengetahui hal gaib. Sekiranya mereka mengetahui yang gaib, yakni wafat nabi sulaiman, tentu mereka tidak tetap dalam siksa yang menghinakan karena mengerjakan pekerjaan berat untuk nabi sulaiman yang mereka kira masih hidup dan mengawasi mereka."
  }
]