[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala kami menetapkan kematian atas Sulaiman, jin tidak mengetahui kematiannya kecuali oleh petunjuk rayap yang menggerogoti tongkatnya yang biasa digunakan oleh Sulaiman untuk bersandar. Sulaiman lalu jatuh ke tanah, saat itu jin mengetahui seandainya mereka mengetahui yang ghaib, niscaya mereka tidak berada dalam siksaan yang menghinakan dan pekerjaan berat kepada Sulaiman, karena mereka mengira bahwa Sulaiman masih hidup. Ayat ini membantah keyakinan sebagian orang bahwa jin mengetahui perkara ghaib, karena bila jin mengetahui perkara ghaib, niscaya mereka akan mengetahui wafatnya Sulaiman dan mereka tidak akan hidup dalam siksaaan yang menghinakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Ketika Kami mewafatkan Sulaiman, para jin tidak ada yang mengetahui kematiannya kecuali setelah rayap memakan tongkatnya yang dia pakai bersandar. Ketika Sulaiman jatuh, para jin menyadari bahwa mereka tidak mengetahui yang gaib, karena seandainya mereka mengetahuinya, niscaya mereka tidak berdiam di dalam azab yang merendahkan mereka, yaitu melaksanakan pekerjaan-pekerjaan berat yang mereka kerjakan untuk Sulaiman karena mereka menyangkanya masih hidup dan mengawasi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Ketika Kami menetapkan kematian baginya saat dia sedang bertumpu pada tongkatnya dan mengawasi pekerjaan tentaranya. Ketika itu para jin fokus dalam pekerjaan mereka kerena takut dan tunduk kepada Nabi Sulaiman. Hingga rayap memakan tongkatnya, sehingga dia terjatuh, agar semua mengetahui kematiannya dan agar manusia menjadi yakin bahwa jin tidak mengetahui ilmu ghaib, sehingga gugurlah anggapan yang menyatakan jin mengetahui hal ghaib, sebab seandainya para jin mengetahui hal ghaib, niscaya mereka tidak akan meneruskan pekerjaan berat yang ditugaskan Nabi Sulaiman kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَلَمَّا قَضَيْنَا عَلَيْهِ الْمَوْت (Maka tatkala Kami telah menetapkan kematian Sulaiman) Yakni Kami tetapkan dan putuskan baginya kematian. Sulaiman meninggal dalam keadaan berdiri sambil bertumpu pada tongkatnya, dan para jin tidak mengetahui kematiannya sehingga mereka tetap bekerja untuknya kerena takut darinya. مَا دَلَّهُمْ عَلَىٰ مَوْتِهِۦٓ إِلَّا دَآبَّةُ الْأَرْضِ(tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap) Yakni rayap. تَأْكُلُ مِنسَأَتَهُۥ ۖ( yang memakan tongkatnya) Yakni memakan tongkat yang dia gunakan untuk bertumpu. فَلَمَّا خَرَّ(Maka tatkala ia telah tersungkur) Yakni saat dia tersunggur ketika tongkatnya terjatuh. تَبَيَّنَتِ الْجِنُّ(tahulah jin itu) Yakni jelas bagi mereka. أَن لَّوْ كَانُوا۟ يَعْلَمُونَ الْغَيْبَ مَا لَبِثُوا۟( kalau sekiranya mereka mengetahui yang ghaib tentulah mereka tidak akan tetap) Yakni jika apa yang mereka katakan bahwa mereka mengetahui hal ghaib niscaya mereka mengetahui kematiannya dan tidak akan menunggu untuk mengetahui itu sampai waktu yang begitu lama setelah kematiannya. فِى الْعَذَابِ الْمُهِينِ(dalam siksa yang menghinakan) Yakni dalam menjalankan pekerjaan yang dibebankan kepada mereka dan dalam ketaatan kepada Sulaiman, padahal dia ketika itu telah meninggal, sampai rayap memakan tongkatnya. Dan dari sini manusia mengetahui bahwa jin tidak mengetahui hal ghaib."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Maka tatkala kami tetapkan kematian Sulaiman, para Jin masih melakukan pekerjaan berat sebagaimana biasanya karena mereka tidak menduga bahwa Sulaiman telah wafat. Tidak ada yang menyadarinya kecuali rayap. Rayap itu memakan tongkat kayu yang dijadikan topangan oleh Sulaiman. Sehingga baru setelah Sulaiman jatuh ke tanah dengan keadaan sudah wafat, para jin baru menyadari dan tahu bahwa mereka tidak mengetahui perkara ghaib. Mereka tidak menyadari atas kewafatan Sulaiman sehingga mereka tetap bekerja sebagaimana biasanya yaitu tugas yang mereka emban dari Sulaiman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami telah menetapkan} Kami telah menentukan {kematian kepadanya} kematian Sulaiman {tidak ada yang menunjukkan kepada mereka} tidak ada yang menunjukkan kepada jin {atas kematiannya, kecuali rayap} rayap {yang memakan tongkatnya} tongkatnya yang dia gunakan untuk bersandar {Ketika dia telah tersungkur} terjatuh di atas tanah {jin mengetahui} mengetahui {bahwa jika mereka mengetahui yang gaib, pasti mereka tidak berada} tidak berada {dalam azab yang menghinakan} pekerjaan yang menghinakan lagi berat yang dibebankan kepada mereka oleh Sulaiman AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Setan-setan pun terus bekerja untuk Sulaiman (membuat) segala macam bangunan. Dan mereka sebelumnya selalu mengecoh manusia, dan mereka memberitakan kepada manusia bahwa mereka mengtahui hal-hal yang ghaib dan mereka mengetahui rahasia-rahasianya. Lalu Allah berkehendak menampakkan kepada manusia tentang kedustaan setan-setan itu dalam klaim mereka. Mereka pun terus mengerjakan pekerjaan mereka, sementara itu Allah menetapkan kematian atas Sulaiman, yang sedang bersandar pada tongkatnya. Setan-setan itu apabila lewat di hadapannya, sedangkan dia bersandar pada tongkatnya, maka mereka mengiranya masih hidup dan mereka pun swangat segan (takut) kepadanya. Maka mereka terus melakukan pekerjaan mereka seperti itu selama satu tahun lamanya, menurut yang di kisahkan, hingga akhirnya rayap-rayap tanah memakan tongkatnya hingga rapuh dan jatuh, maka Sulaiman pun jatuh dan setan-setan itu pun berpencar-pencar. Semenjak itu manusia tahu bahwa sesungguhnya jin, “kalau sekiranya mereka mengetahui yang ghaib tentulah mereka tetap (senantiasa) dalam siksa yang menghinkan,” maksudnya, dalam pekerjaan yang sangat berat batgi mereka. Kalau sekiranya mereka mengetahui yang ghaib tentu mereka mengetahui kematian Sulaiman yang sangat mereka inginkan untuk bisa terbebas dari beban pekerjaan yang sedang mereka derita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 14: Maka ketika telah menjadi ketetapan atas kematian Sulaiman, Allah mematikan Sulaiman; Matilah Sulaiman ketika berdiri bersandar kepada tongkatnya, maka bergulirlah zaman, dan para jin tidak mengetahui atas kematian Sulaiman kecuali setelah semut putih (rayap) yang berjalan pada tongkatnya dan menggerogoti tongkatnya yang kemudian Sulaiman jatuh tergeletak, maka kemudian para jin mengetahui kematiaan Sulaiman. Maka ketika para jin dalam waktu yang panjang telah taat dalam melayani Sulaiman, mereka merasa bosan karena sebab Sulaiman telah tiada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setan senantiasa bekerja keras untuk Nabi Sulaiman ‘alaihis salam membuat bangunan dan lain-lain. Ketika itu, mereka menipu manusia dengan memberitahukan, bahwa mereka mengetahui yang gaib dan mengetahui hal-hal yang tersembunyi, maka Allah Subhaanahu wa Ta'aala ingin memperlihatkan kepada hamba-hamba-Nya kedustaan dakwaan mereka, karena tidak tahu yang gaib mereka tetap bekerja keras padahal Allah telah menaqdirkan Nabi-Nya Sulaiman ‘alaihis salam wafat ketika shalat di mihrabnya dengan bersandar di atas tongkatnya, sehingga ketika mereka (para jin) melewati Beliau, mereka melihat bahwa Beliau sedang bersandar di atas tongkat, mereka mengira bahwa Beliau masih hidup dan mereka merasa takut kepadanya. Beliau wafat dalam keadaan bersandar dengan tongkatnya selama setahun, sedangkan jin bekerja keras sebagaimana biasanya tanpa menyadari wafatnya Beliau sampai rayap memakan tongkatnya, lalu jatuhlah jasad Beliau. Ketika itu setan berpencar dan manusia pun mengetahui bahwa jin itu tidak mengetahui yang gaib. Karena jika mereka mengetahui yang gaib, tentu mereka tidak tetap di atas siksaan atau kerja keras yang menghinakan itu. Maka tidaklah tersembunyi bagi mereka tentang wafatnya Beliau. Yani pekerjaan yang berat untuk kepentingan Nabi Sulaiman ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 14",
    "description": "Betapa pun besarnya kekuasaan nabi sulaiman hingga bisa mem-pekerjakan jin sesuai keinginannya, namun begitu ajalnya tiba maka tidak akan ada yang dapat menundanya. Maka ketika kami telah menetapkan kematian atasnya, nabi sulaiman, tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap yang memakan tongkatnya yang dijadikan sandaran ketika dia wafat. Maka ketika dia, yakni je-nazah nabi sulaiman, telah jatuh tersungkur, tahulah jin itu bahwa dia telah wafat. Inilah bukti bahwa jin tidak mengetahui hal gaib. Sekiranya mereka mengetahui yang gaib, yakni wafat nabi sulaiman, tentu mereka tidak tetap dalam siksa yang menghinakan karena mengerjakan pekerjaan berat untuk nabi sulaiman yang mereka kira masih hidup dan mengawasi mereka. 15. Allah telah memberikan anugerah yang besar kepada hamba-Nya yang taat dan bersyukur dengan mengerjakan amal saleh, antara lain nabi daud dan sulaiman. Hal ini berbeda dengan yang terjadi kepada kaum saba'. Mereka mengingkari nikmat Allah sehingga Allah menghukum mereka. Sungguh, bagi kaum saba' ada tanda kebesaran Allah di tempat kediaman mereka di yaman selatan, yaitu dua buah kebun di sebelah kanan dan di sebelah kiri negeri mereka. Kepada mereka dikatakan, 'makanlah olehmu dari rezeki anugerah tuhan pemelihara-Mu dan bersyukurlah kepada-Nya. Negerimu adalah negeri yang baik, nyaman, sentosa, dan murah rezeki, sedang tuhanmu adalah tuhan yang maha peng-ampun kepada siapa pun yang mau bertobat. '."
  }
]