[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-17. Namun mereka berpaling dari perintah Allah, tidak bersyukur kepadaNya dan mendustakan utusan-utusan Allah, akibatnya kami mengirimkan banjir bandang yang dahsyat yang menghancurkan bendungan dan menenggelamkan kebun-kebun. Kami mengganti dua kebun mereka yang berbuah lebat itu dengan dua kebun buah-buahan yang buruk dan terasa pahit, yaitu buah yang pahit dan rasanya yang tidak enak, pohon Atsl, yaitu sejenis cemara yang tidak berbuah, dan sedikit pohon bidara yang berduri. Pergantian dari yang baik kepada yang buruk adalah karena kekafiran mereka dan tidak bersyukurnya mereka kepada nikmat-nikmat Allah. dan Kami tidak menimpakan hukuman yang keras ini kecuali kepada orang yang sangat ingkar lagi kafir dengan kekafiran yang mendalam. Dia membalas perbuatannya dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Mereka berpaling dari mensyukuri Allah dan dari beriman kepada para rasul-Nya. Maka Kami menghukum mereka dengan merubah kenikmatan menjadi malapetaka. Kami mengirimkan kepada mereka banjir bandang yang menjebol bendungan mereka dan menenggelamkan kebun-kebun mereka, dan Kami mengganti sepasang kebun mereka dengan dua kebun yang menghasilkan buah-buahan yang pahit dan pohon tamariska yang tidak berbuah dan sedikit dari pohon bidara."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Akan tetapi mereka tidak bersyukur kepada Tuhan mereka; mereka berpaling dan membalas segala kenikmatan dengan keingkaran. Maka Allah menimpakan kepada mereka banjir bandanng yang menghancurkan bendungan mereka, merusak tanaman dan pepohonan mereka, sehingga kebun-kebun mereka berubah menjadi pepohonan yang memiliki buah yang tidak lezat, seperti pohon tamariska dan pohon bidara yang buahnya tidak mengenyangkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَأَعْرَضُوا۟ (Tetapi mereka berpaling) Yakni enggan untuk bersyukur, dan mereka kafir kepada Allah. فَأَرْسَلْنَا عَلَيْهِمْ سَيْلَ الْعَرِم(maka Kami datangkan kepada mereka banjir yang besar) Yakni Allah meretakkan bendungan kota Ma’rib sampai runtuh, sehingga air bendungan masuk kebun mereka dan menenggelamkannya, serta aliran air itu menenggelamkan pemukiman mereka juga. Dan makna (العرم) adalah aliran air yang sangat deras dan kuat yang tidak mungkin terbendung. وَبَدَّلْنٰهُم بِجَنَّتَيْهِمْ جَنَّتَيْنِ(dan Kami ganti kedua kebun mereka dengan dua kebun) Yakni Kami berikan kepada mereka dua kebun yang lain yang tidak ada baiknya, dan tanaman yang tumbuh di sana tidak memiliki manfaat. ذَوَاتَىْ أُكُلٍ خَمْطٍ(yang ditumbuhi (pohon-pohon) yang berbuah pahit) Makna (الخمط) yakni segala pohon berduri dan berbuah pahit. وَأَثْلٍ(pohon Atsl) Makna (الأثل) yakni pohon yang mirip pohon sipres (sejenis cemara), pohon ini tidak memiliki buah. وَشَىْءٍ مِّن سِدْرٍ قَلِيلٍ(dan sedikit dari pohon Sidr) Allah membinasakan pepohonan mereka yang dapat berbuah, dan menggantinya dengan pohon siwak, cemara, dan bidara yang tidak dapat berbuah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Namun mereka ingkar untuk bersyukur atas nikmat itu dan mereka mengingkari Allah. Maka Kami datangkan kepada mereka banjir besar yang seukuran dengan dua gunung yang dapat menampung air hujan tersebut, semisal dam. Air itu menenggelamkan dua kebun dan negeri mereka. Membinasakan segala tanaman dan manusia. Sailul ‘aram adalah banjir yang besarnya tidak dapat didefinisikan karena sangat besar dan deras. Kami ganti dua kebun mereka dengan kebun yang menumbuhkan tanaman atau pohon yang berbuah sangat pahit yaitu pohon tharfa’ yang ukurannya sangat besar. Juga ditumbuhi sedikit pohon Nabq yang buahnya dapat dimakan. Kami gantikan pepohonan yang berbuah dengan pohon arok, tharfa’ dan sidr."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka berpaling sehingga Kami mengirimkan kepada mereka banjir besar} banjir yang menghancurkan bendungan, lalu air itu menenggelamkan kebun-kebun mereka dan meruntuhkan rumah-rumah mereka {dan Kami mengganti kedua kebun mereka dengan dua kebun yang memiliki} memiliki {buah pahit} buah pahit {pohon tamariska} pohon tamariska yang tidak memiliki buah {dan sedikit pohon bidara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-19. Saba’ adalah satu kabilah (suku bangsa) yang sangat populer yang terletak di pesisir negeri Yaman, dan daerah tempat tinggal mereka disebut Ma’rib. Di antara karunia Allah dan kemurahanNya kepada manusia secara umum dan kepada bangsa Arab khususnya adalah bahwasanya Allah menceritakan di dalam al-Quran sejarah-sejarah orang-orang yang dibinasakan dan di azab dari kalangan penduduk yang bertetangga dengan bangsa Arab, dan sisa-sisanya masih bisa disaksikan dan sejarahnya dipindah dari mulut ke mulut agar hal itu lebih mudah untuk membenarkan dan mudah untuk menerima nasihat, seraya berfirman, “Sungguh bagi kaum Saba’, di tempat kediaman mereka” maksudnya, di daerah tempat mereka tinggal “ada tanda.” Tanda di sini adalah nikmat yang berlimpah ruah yang Allah limpahkan kepada mereka, dan dijauhkannya mereka dari berbagai bencana, yang sebenarnya (hal ini) menuntut mereka untuk beribadah kepada Allah dan bersyukur kepadaNya. Kemudian ayat ini dijelaskan dengan FirmanNYa, “Yaitu dua buah kebun di sebelah kanan dan di sebelah kiri.” Mereka memiliki lembah air yang sangat besar yang selalu di aliri air hujan, dan mereka membuat bendungan yang sangat kuat yang menjadi tempat penampungan air. Aliran air hujan selalu mengalir kepadanya hingga terbendunglah di sana air yang sangat besar. Dari bendungan itu mereka mengalirkannya ke kebun-kebun yang berada di sebelah kanan dan kiri bendungan itu; dan kebun-kebun itu mendatangkan buah-buahan yang mencukupi kebutuhan mereka sehingga mereka merasa senang dan bahagia. Kemudian Allah memerintahkan kepada mereka untuk mensyukuri nikmatNya yang telah Dia limpahkan kepada mereka dari berbagai sisi: 1. Kedua kebun itulah yang menjadi pokok mata pencaharian mereka. 2. Allah menjadikan negeri (daerah) mereka sebagai negeri yang baik karena cuacanya yang sangat baik, minimnya area perkebunan yang jelek dan berlimpah ruahnya rizki di dalamnya. 3. Allah menjanjikan kepada mereka jika mereka bersyukur kepadaNya, bahwa Dia akan mengampuni dan merahmati mereka; maka dari itu Allah berfirman, “(Negerimu) adalah negeri yang baik dan (Rabbmu) adalah Rabb Yang Maha Pengampun.” 4. Ketika Allah mengetahui kebutuhan mereka kepada tanah (negeri) yang diberkahi dalam perniagaan dan usaha mereka, (secara zhahir bahwa negeri ini adalah kota di Shan’a, sebagaimana dikatakan oleh banyak kaum salaf. Ada yang berpendapat bahwa negeri tersebut adalah negeri Syam), maka Allah menyediakan untuk mereka segala fasilitas yang dengannya mereka mudah untuk sampai kepadanya dengan sangat mudah, seperti adanya rasa aman, tidak ada rasa takut dan berentetannya perkampungan penghubung antara mereka dengan negeri tersebut sehingga mereka tidak merasakan adanya kesulitan dalam membawa bekal dan barang-barang perniagaan. maka dari itu Allah berfirman, “Dan Kami jadikan antara mereka dan antara negeri-negeri yang Kami limpahkan berkat kepadanya, beberapa negeri yang berdekatan dan Kami tetapkan padanya perjalanan,” maksudnya, perjalanan yang bisa diprediksikan kadarnya, mereka mengenalnya dan menguasainya hingga mereka tidak tersesat darinya, siang dan malam hari. “Dengan aman,” maksudnya dengan tenang dalam perjalanan pada malam dan siang hari tanpa ada rasa takut. Ini merupakan kesempurnaan nikmat Allah terhadap mereka, yaitu Allah memberikan rasa aman dari rasa takut. Namun kemudian mereka berpaling dari Sang Pemberi nikmat dan dari beribadah kepadaNya, mereka mengingkari nikmat dan merasa jemu hingga mereka menuntut dan berangan-angan agar perjalanan –perjalanan jauh (safar) mereka menjadi semakin jauh dari perkampungan yang di sana sebenarnya perjalanan sudah menjadi mudah; “dan mereka menganiaya diri mereka sendiri,” dengan mengingkari Allah dan nikmatNya. Oleh karena itu, mereka disiksa oleh Allah karena nikmat yang telah membuat mereka congkak ini. Maka Allah membinasakan mereka dan menimpakan terhadap mereka “banjir bandang.” Maksudnya, banjir bandang yang sangat kuat yang memporak porandakan bendungan mereka dan merusak kebun-kebun yang penuh dengan tanaman yang sangat menakjubkan dan pohon-pohon yang berbuah, dan sebagai gantinya adalah pohon-pohon yang tidak ada gunanya. Maka dari itu Allah berfirman, “Dan Kami ganti kedua kebun mereka dengan dua kebun yang ditumbuhi tumbuhan yang berbuah,” maksudnya, sesuatu yang sedikit dari makanan yang tidak menggembirakan mereka, yaitu “(tumbuhan yang berbuah) pahit, pohon Atsl (sejenis cemara), dan sedikit pohon Sidr (sejenis bidara).” Ini semua adalah pohon yang sudah dikenal; dan ini berasal dari salah satu jenis perbuatan mereka, sebagaimana mereka menukar kesyukuran yang baik dengan kekufuran yang busuk; maka mereka mengganti kenikmatan tersebut dengan apa yang disebutkan tadi. Maka dari itu Allah berfirman, “Demikianlah Kami memberi balasan kepada mereka karena kekafiran mereka, dan Kami tidak menjatuhkan azab, melainkan hanya kepada orang-orang yang sangat kafir.” Maksudnya, tidaklah Kami membalas dengan balasan siksaan –berdasarkan susunan kalimat- kecuali kepada orang yang kafir kepada Allah dan mengingkari nikmat. Setelah musibah melanda mereka, maka mereka tercerai-berai dan tercabik-cabik setelah dahulu mereka bersatu, dan Allah menjadikan mereka sebagai bahan pembicaraan yang dibicarakan manusia dan menjadi dongeng masyarakat di malam hari, dan mereka dijadikan pribahasa: “bercerai-berailah seperti tangan-tangan kaum Saba’.” Jadi, setiap orang membicarakan apa yang terjadi terhadap mereka, akan tetapi tidaklah mengambil pelajarannya dari mereka “Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi setiap orang yang sabar lagi bersyukur,” sabar dalam menghadapi hal-hal yang dibenci dan berbagai cobaan, ia mengembannnya untuk mendapat ridha Allah, tidak menggerutu karenanya, akan tetapi dia sabar menghadapinya; lagi bersyukur atas nikmat Allah dan mengakuinya, dan memuji Allah yang telah mengaruniakannya, serta menggunakannya dalam ketaatan kepadaNYa. Orang seperti itu, apabila dia mendengar sejarah mereka dan apa yang mereka lakukan dan apa yang menimpa mereka, maka ia tahu bahwa siksaan (hukuman) itu adalah sebagai balasan atas kekafiran mereka terhadap nikmat Allah; dan siapa yang berbuat seperti perbuatan mereka, niscaya akan diperlakukan seperti apa yang diperlakukan terhadap mereka, dan bahwa bersyukur kepada Allah itu memelihara nikmat dan menolak bencana, serta bahwa para utusan Allah itu benar dalam apa yang mereka sampaikan, dan bahwa sesungguhnya balasan itu adalah haq sebagaimana dia telah melihat contohnya di dunia ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 16: Allah menjelaskan bahwa mereka berpaling dari keimanan dan rasa syukur serta kufur dengan nikmat Allah; Maka Allah mengutus kepada mereka banjir yang besar, hancurlah negeri mereka. Air memasuki dua kebun mereka serta menenggelamkan keduanya dan ladangnya, binatang-binatang ternak binasa, dan orang-orang yang tidak mentaati Allah berlarian. Allah berikan bagi mereka pengganti atas kedua kebun mereka dengan buah-buahan yang tidak disukai, dan pada keduanya terdapat pohon ‘asl dan sesuatu yang sedikit dari pohon bidara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari yang memberi nikmat (Allah) dan dari beribadah kepada-Nya, mereka tidak mau bersyukur kepada-Nya dan malah bosan dengannya sampai mereka meminta kebalikan dari itu dan berharap agar jarak perjalanan mereka dijauhkan, padahal sebelumnya mudah. Maksudnya, banjir besar yang disebabkan runtuhnya bendungan Ma'rib, lalu menenggelamkan kebun dan harta mereka. Pohon Atsl ialah sejenis pohon cemara, sedangkan pohon Sidr ialah sejenis pohon bidara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 16",
    "description": "Namun, kenikmatan itu justru membuat kaum saba' lupa diri dan ingkar kepada Allah. Adalah kecenderungan manusia apabila mempunyai kelebihan atas orang lain, baik berupa harta, kepandaian, jabatan, dan sebagainya, mereka akan angkuh dan sombong. Itulah yang terjadi pada kaum saba'. Mereka merasakan agungnya nikmat Allah, tetapi mereka berpaling, tidak mensyukurinya, dan justru mendurhakai-Nya. Maka kami kirim kepada mereka banjir yang besar dan menjebol ben-dungan ma'rib serta memusnahkan perkebunan mereka. Bendungan ma'rib adalah bendungan yang sangat kuat dan terbesar di yaman saat itu. Sekilas bendungan ini tampak terjadi secara alami karena berada di antara dua gunung, lalu di kedua ujungnya dibuat bangunan sehinga mampu menampung air hujan dalam jumlah besar. Air yang tertampung dapat mengairi kawasan di sekitarnya hingga jarak 300 mil. Dan usai banjir itu kami ganti kedua kebun mereka yang semula menghasil-kan buah-buahan yang mencukupi kebutuhan mereka, dengan dua kebun yang ditumbuhi pohon-pohon yang berbuah pahit, yaitu pohon a'l (sejenis cemara, tidak berbuah dan penuh duri), dan sedikit pohon sidr (sejenis pohon bidara). Kedua pohon tersebut sangat sedikit manfaatnya bagi mereka. 17. Demikianlah kami memberi balasan kepada mereka dengan menjatuhkan hukuman tersebut karena kekafiran mereka. Dan kami tidak menjatuhkan azab yang demikian itu melainkan hanya kepada orang yang sa-ngat kafir dan mengingkari nikmat-nikmat-Nya."
  }
]