[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tetapi karena sikap mereka yang berlebih-lebihan, mereka bosan kepada kemudahan, keamanan dan kemakmuran hidup. Mereka berkata, “Wahai Tuhan kami, jadikanlah kota-kota kami berjauhan agar perjalanan kami diantaranya menjadi jauh, sehingga kami tidak menemukan kota yang ramai dalam perjalanan kami.” Mereka menzhalimi diri mereka dengan kekafiran mereka, maka Kami membinasakan mereka dan menjadikan mereka sebagai pelajaran dan cerita bagi orang-orang yang datang sesudah mereka. Kami memecahkan mereka sehingga mereka becerai-berai, dan kota-kota mereka pun hancur. Sesungguhnya apa yang menimpa Saba’ adalah pelajaran bagi orang yang sangat sabar menghadapi hal-hal yang dibenci lagi berat, juga pandai bersyukur atas nikmat-nikmat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Namun mereka malah menyombongkan diri dengan nikmat Allah yang telah mendekatkan jarak perjalanan mereka. Mereka berkata, “Wahai Tuhan kami! Jauhkanlah jarak perjalanan kami dengan menghilangkan negeri-negeri itu agar kami merasakan beban lelah perjalanan dan nampak keistimewaan tunggangan kami. Mereka menzalimi diri mereka dengan menyombongkan diri atas nikmat Allah, berpaling dari kewajiban syukur, dan hasad mereka kepada orang-orang miskin dari mereka. Maka Kami menjadikan mereka bahan cerita di kalangan orang-orang sesudah mereka, Kami mencerai beraikan mereka di beberapa negeri, sehingga sebagian dari mereka tidak bisa berhubungan dengan yang lain. Sesungguhnya dalam cerita yang disebutkan di atas, yaitu nikmat Allah kepada penduduk Saba` dan hukuman terhadap mereka terdapat pelajaran bagi setiap orang yang sangat bersabar di atas ketaatan kepada Allah dan dari kemaksiatan kepada-Nya serta atas ujian-Nya, pandai bersyukur atas nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Namun kaum itu merasa sombong dengan kenikmatan itu, sehingga mereka ingin kenikmatan itu hilang dan berharap perjalanan mereka terasa panjang. Kehidupan mewah mereka membuat mereka mengeluhkan perjalanan akibat keingkaran mereka terhadap nikmat Allah. Dan mereka menzalimi diri mereka sendiri dengan keingkaran, kelalaian, dan kebosanan; sehingga Kami menjadikan mereka sebagai pelajaran yang diperbincangkan orang-orang lainnya, sehingga yang memperbincangkan itu heran terhadap kesengsaraan kaum itu setelah kehidupan yang makmur, perpecahan setelah persatuan, dan kehinaan setelah kemuliaan; sehingga perselisihan mereka menjadi perumpamaan yang masyhur: ‘Lenyap sudah persatuan kaum Saba, dan mereka terpecah belah’ (Majma’ al-Amtsal, al-Maidany 1/275). Sungguh yang demikian itu adalah pelajaran dan ibrah bagi orang yang banyak bersyukur dan senantiasa sabar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَقَالُوا۟ رَبَّنَا بٰعِدْ بَيْنَ أَسْفَارِنَا (Maka mereka berkata: “Ya Tuhan kami jauhkanlah jarak perjalanan kami”) Mereka merasa bosan dari kenikmatan dan tidak bersabar dengan kesehatan mereka, sehingga mereka mengharapkan perjalanan yang panjang dan jauh dari negeri mereka. فَجَعَلْنٰهُمْ أَحَادِيثَ (maka Kami jadikan mereka buah mulut) Yakni orang-orang setelah mereka akan membicarakan cerita-cerita tentang mereka karena merasa heran dari kelakuan mereka dan untuk mengambil pelajaran dari keadaan dan kesudahan urusan mereka. وَمَزَّقْنٰهُمْ كُلَّ مُمَزَّقٍ ۚ( dan Kami hancurkan mereka sehancur-hancurnya) Yakni Kami benar-benar dicerai beraikan ke berbagai negeri, sehingga orang Arab menjadikannya peribahasa “kaum itu tercerai-berai seperti penduduk negeri Saba’”. Akibat perpecahan ini, sehingga kaum Aus dan Khazraj menempati kota Yatrib, kaum Ghassan di negeri Syam, kaum Azad di negeri Oman, dan kaum Khuza’ah di nereri Tihamah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Mereka berkata: Ya Tuhan kami, jauhkanlah jarak perjalanan kami: yaitu daerah yang perjalanannya membutuhkan waktu lama. Dari Yaman menuju Syam. Mereka telah mendhalimi diri mereka dengan kekufuran dan kemaksiatan. Maka telah Kami jadikan mereka sebagai cerita untuk orang sesudah mereka. Para manusia membicarakan berita tentang mereka. Sesungguhnya Allah telah menjawab mereka dengan merusak daerah tengah. Maka tidak ada yang sanggup melakukan perjalanan tersebut kecuali orang kaya yang mempunyai onta yang kuat yang mampu membawa air. Orang-orang miskin tidak akan mampu melakukannya. Maka perdagangan tersebut menjadi khusus untuk orang-orang kaya saja. Kami cerai beraikan mereka dari negeri tempat tinggal mereka. Sehingga sampai diberikan permisalan: Kabilah Saba’ telah bercerai berai. Sesungguhnya pada semua itu terdapat pelajaran dan berbagai bukti yang jelas bagi setiap hamba yang senantiasa bersabar untuk menjauhi maksiat dan melakukan ketaatan, juga yang memperbanyak syukur atas segala nikmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Ya Tuhan kami, jauhkanlah jarak perjalanan kami” dan menzalimi diri sendiri. Kami menjadikan mereka bahan pembicaraan} Kami menjadikan mereka berita yang dibicarakan orang-orang terkait apa yang ditimpakan atas mereka untuk membuat mereka takjub dan mengambil pelajaran {Kami memecah belah mereka menjadi tercerai berai} Kami memisahkan mereka di negeri-negeri itu menjadi beberapa bagian {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda} pelajara dan petunjuk {bagi setiap orang yang sangat sabar lagi sangat bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-19. Saba’ adalah satu kabilah (suku bangsa) yang sangat populer yang terletak di pesisir negeri Yaman, dan daerah tempat tinggal mereka disebut Ma’rib. Di antara karunia Allah dan kemurahanNya kepada manusia secara umum dan kepada bangsa Arab khususnya adalah bahwasanya Allah menceritakan di dalam al-Quran sejarah-sejarah orang-orang yang dibinasakan dan di azab dari kalangan penduduk yang bertetangga dengan bangsa Arab, dan sisa-sisanya masih bisa disaksikan dan sejarahnya dipindah dari mulut ke mulut agar hal itu lebih mudah untuk membenarkan dan mudah untuk menerima nasihat, seraya berfirman, “Sungguh bagi kaum Saba’, di tempat kediaman mereka” maksudnya, di daerah tempat mereka tinggal “ada tanda.” Tanda di sini adalah nikmat yang berlimpah ruah yang Allah limpahkan kepada mereka, dan dijauhkannya mereka dari berbagai bencana, yang sebenarnya (hal ini) menuntut mereka untuk beribadah kepada Allah dan bersyukur kepadaNya. Kemudian ayat ini dijelaskan dengan FirmanNYa, “Yaitu dua buah kebun di sebelah kanan dan di sebelah kiri.” Mereka memiliki lembah air yang sangat besar yang selalu di aliri air hujan, dan mereka membuat bendungan yang sangat kuat yang menjadi tempat penampungan air. Aliran air hujan selalu mengalir kepadanya hingga terbendunglah di sana air yang sangat besar. Dari bendungan itu mereka mengalirkannya ke kebun-kebun yang berada di sebelah kanan dan kiri bendungan itu; dan kebun-kebun itu mendatangkan buah-buahan yang mencukupi kebutuhan mereka sehingga mereka merasa senang dan bahagia. Kemudian Allah memerintahkan kepada mereka untuk mensyukuri nikmatNya yang telah Dia limpahkan kepada mereka dari berbagai sisi: 1. Kedua kebun itulah yang menjadi pokok mata pencaharian mereka. 2. Allah menjadikan negeri (daerah) mereka sebagai negeri yang baik karena cuacanya yang sangat baik, minimnya area perkebunan yang jelek dan berlimpah ruahnya rizki di dalamnya. 3. Allah menjanjikan kepada mereka jika mereka bersyukur kepadaNya, bahwa Dia akan mengampuni dan merahmati mereka; maka dari itu Allah berfirman, “(Negerimu) adalah negeri yang baik dan (Rabbmu) adalah Rabb Yang Maha Pengampun.” 4. Ketika Allah mengetahui kebutuhan mereka kepada tanah (negeri) yang diberkahi dalam perniagaan dan usaha mereka, (secara zhahir bahwa negeri ini adalah kota di Shan’a, sebagaimana dikatakan oleh banyak kaum salaf. Ada yang berpendapat bahwa negeri tersebut adalah negeri Syam), maka Allah menyediakan untuk mereka segala fasilitas yang dengannya mereka mudah untuk sampai kepadanya dengan sangat mudah, seperti adanya rasa aman, tidak ada rasa takut dan berentetannya perkampungan penghubung antara mereka dengan negeri tersebut sehingga mereka tidak merasakan adanya kesulitan dalam membawa bekal dan barang-barang perniagaan. maka dari itu Allah berfirman, “Dan Kami jadikan antara mereka dan antara negeri-negeri yang Kami limpahkan berkat kepadanya, beberapa negeri yang berdekatan dan Kami tetapkan padanya perjalanan,” maksudnya, perjalanan yang bisa diprediksikan kadarnya, mereka mengenalnya dan menguasainya hingga mereka tidak tersesat darinya, siang dan malam hari. “Dengan aman,” maksudnya dengan tenang dalam perjalanan pada malam dan siang hari tanpa ada rasa takut. Ini merupakan kesempurnaan nikmat Allah terhadap mereka, yaitu Allah memberikan rasa aman dari rasa takut. Namun kemudian mereka berpaling dari Sang Pemberi nikmat dan dari beribadah kepadaNya, mereka mengingkari nikmat dan merasa jemu hingga mereka menuntut dan berangan-angan agar perjalanan –perjalanan jauh (safar) mereka menjadi semakin jauh dari perkampungan yang di sana sebenarnya perjalanan sudah menjadi mudah; “dan mereka menganiaya diri mereka sendiri,” dengan mengingkari Allah dan nikmatNya. Oleh karena itu, mereka disiksa oleh Allah karena nikmat yang telah membuat mereka congkak ini. Maka Allah membinasakan mereka dan menimpakan terhadap mereka “banjir bandang.” Maksudnya, banjir bandang yang sangat kuat yang memporak porandakan bendungan mereka dan merusak kebun-kebun yang penuh dengan tanaman yang sangat menakjubkan dan pohon-pohon yang berbuah, dan sebagai gantinya adalah pohon-pohon yang tidak ada gunanya. Maka dari itu Allah berfirman, “Dan Kami ganti kedua kebun mereka dengan dua kebun yang ditumbuhi tumbuhan yang berbuah,” maksudnya, sesuatu yang sedikit dari makanan yang tidak menggembirakan mereka, yaitu “(tumbuhan yang berbuah) pahit, pohon Atsl (sejenis cemara), dan sedikit pohon Sidr (sejenis bidara).” Ini semua adalah pohon yang sudah dikenal; dan ini berasal dari salah satu jenis perbuatan mereka, sebagaimana mereka menukar kesyukuran yang baik dengan kekufuran yang busuk; maka mereka mengganti kenikmatan tersebut dengan apa yang disebutkan tadi. Maka dari itu Allah berfirman, “Demikianlah Kami memberi balasan kepada mereka karena kekafiran mereka, dan Kami tidak menjatuhkan azab, melainkan hanya kepada orang-orang yang sangat kafir.” Maksudnya, tidaklah Kami membalas dengan balasan siksaan –berdasarkan susunan kalimat- kecuali kepada orang yang kafir kepada Allah dan mengingkari nikmat. Setelah musibah melanda mereka, maka mereka tercerai-berai dan tercabik-cabik setelah dahulu mereka bersatu, dan Allah menjadikan mereka sebagai bahan pembicaraan yang dibicarakan manusia dan menjadi dongeng masyarakat di malam hari, dan mereka dijadikan pribahasa: “bercerai-berailah seperti tangan-tangan kaum Saba’.” Jadi, setiap orang membicarakan apa yang terjadi terhadap mereka, akan tetapi tidaklah mengambil pelajarannya dari mereka “Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi setiap orang yang sabar lagi bersyukur,” sabar dalam menghadapi hal-hal yang dibenci dan berbagai cobaan, ia mengembannnya untuk mendapat ridha Allah, tidak menggerutu karenanya, akan tetapi dia sabar menghadapinya; lagi bersyukur atas nikmat Allah dan mengakuinya, dan memuji Allah yang telah mengaruniakannya, serta menggunakannya dalam ketaatan kepadaNYa. Orang seperti itu, apabila dia mendengar sejarah mereka dan apa yang mereka lakukan dan apa yang menimpa mereka, maka ia tahu bahwa siksaan (hukuman) itu adalah sebagai balasan atas kekafiran mereka terhadap nikmat Allah; dan siapa yang berbuat seperti perbuatan mereka, niscaya akan diperlakukan seperti apa yang diperlakukan terhadap mereka, dan bahwa bersyukur kepada Allah itu memelihara nikmat dan menolak bencana, serta bahwa para utusan Allah itu benar dalam apa yang mereka sampaikan, dan bahwa sesungguhnya balasan itu adalah haq sebagaimana dia telah melihat contohnya di dunia ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 19: Akan tetapi mereka juga kufur terhadap nikmat yang Allah telah berikan, mereka berkata : Wahai Rabb kami jadikan antara kami dan tempat yang kami tuju jauh (panjang), sehingga kami merasakan lelah dan bosan. Mereka berpaling dari kenikmatan dan mendatangkan keburukan. Maka Allah turunkan ketetapannya dan Allah ambil nikmat yang telah diberikan-Nya yang mereka telah kufur terhadap nikmat tersebut. Allah menjadikan sikap mereka sebagai ibrah bagi orang-orang yang mengambil pelajaran dengan berlalunya waktu, Allah cerai beraikan negeri mereka. Ketahuilah wahai manusia, bahwa apa yang terjadi pada kaum saba adalah bukti dan tanda dan juga ibrah yang dapat dipetik manfaat bagi mereka yang sabar di atas ketaatan dan dari maksiat, dan juga sabar atas takdir serta agar bersyukur dengan rasa syukur yang mendalam terhadap nikmat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka meminta agar kota-kota yang berdekatan itu dihapuskan dan dijadikan padang sahara yang tandus supaya mereka dapat berbangga diri di hadapan kaum fakir dengan mengendarai unta, serta membawa perbekalan dan air, atau maksudnya agar perjalanan menjadi panjang dan mereka dapat melakukan monopoli dalam perdagangan itu, sehingga keuntungan lebih besar. Dengan kufur kepada Allah dan kepada nikmat-Nya, maka Allah menghukum mereka dan membinasakan mereka dengan mengirimkan banjir besar yang keras yang merobohkan bendungan mereka, membinasakan kebun-kebun mereka, maka bergantilah kebun yang indah itu menjadi kebun yang tidak ada manfaatnya, di mana buah-buahnya terasa pahit, dan tanaman lainnya yang tumbuh adalah pohon Atsl dan pohon Sidr. Yang demikian karena mereka merubah syukur dengan kekufuran, sehingga nikmat yang mereka peroleh dirubah dengan hukuman. Bagi generasi setelah mereka. Mereka kemudian berpencar setelah sebelumnya bersatu, dan Allah jadikan mereka bahan pembicaraan dan sebagai contoh bagi yang lain. Meskipun begitu, tidak ada yang mengambil pelajaran dari peristiwa itu selain orang yang bersabar lagi bersyukur sebagaimana diterangkan dalam ayat di atas. Yakni sabar dalam menerima musibah dan kepedihan, siap memikulnya karena mencari keridhaan Allah, tidak kesal bahkan ridha kepadanya. Terhadap nikmat Allah Subhaanahu wa Ta'aala dengan mengakuinya, memuji yang memberinya nikmat dan mengalihkan nikmat itu untuk ketaatan kepada Allah Subhaanahu wa Ta'aala. Orang yang sabar lagi bersyukur ketika mendengar kisah mereka dan hal yang terjadi pada mereka dapat mengetahui bahwa musibah tersebut sebagai balasan terhadap kufurnya mereka kepada nikmat Allah dan bahwa barang siapa yang berbuat seperti itu akan diberikan balasan yang serupa, ia juga mengetahui, bahwa syukur kepada Allah dapat menjaga nikmat dan menolak hukuman. Demikian pula ia mengetahui, bahwa para rasul adalah benar dalam berita yang mereka sampaikan, dan bahwa pembalasan adalah benar sebagaimana ia melihat contoh-contohnya ketika di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 19",
    "description": "Maka sebagai bukti keingkaran mereka atas nikmat-nimat Allah itu, mereka berkata, 'ya tuhan kami, jauhkanlah jarak perjalanan kami, yakni jarak antarwilayah dan antarnegara, agar perjalanan menjadi panjang sehingga tidak banyak orang yang masuk ke negara kami dan orang-orang miskin tidak mampu menempuh jarak tersebut karena keterbatasan kendaraan mereka. Dengan begitu kami dapat memonopoli hasil negeri kami dan perdagangan, sehingga keuntungan kami lebih besar. \"dan tanpa mereka sadari, permintaan tersebut justru menjadikan mereka menzalimi diri mereka sendiri karena mengakibatkan tertutupnya akses perdagangan antarnegara. Maka akibat kedurhakaan itu kami jadikan mereka bahan pembicaraan bagi generasi sesudah mereka dan kami hancurkan mereka sehancur-hancurnya sehingga mereka bertebaran ke berbagai daerah. Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kekuasaan Allah bagi setiap orang yang sabar dan bersyukur. 20. Kedurhakaan kaum saba' membuktikan betapa iblis mampu me-realisasikan sumpahnya di hadapan Allah ketika dia terkutuk akibat membangkang perintah Allah untuk bersujud kepada nabi adam. 'dan sungguh, iblis telah dapat meyakinkan dengan berbagai tipu daya terhadap mereka, anak-cucu nabi adam, tentang kebenaran sangkaannya bahwa dia mampu menjerumuskan manusia ke jalan kesesatan, lalu mereka mengikutinya, kecuali sebagian dari orang-orang mukmin yang kuat keimanannya (lihat juga: ''d/38: 82'83)."
  }
]