[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengetahui apa yang masuk ke dalam bumi berupa tetesan air hujan, mengetahui apa yang keluar darinya berupa tanaman, barang tambang dan air, apa yang turun dari langit berupa hujan, malaikat dan kitab-kitab, apa yang naik kepadaNya berupa malaikat dan amal perbuatan makhluk. Dia-lah Yang Maha Penyayang kepada hamba-hambaNya sehingga Dia tidak menyegerakan hukuman atas orang-orang yang durhaka diantara mereka, juga Maha Pengampun bagi dosa-dosa para hambaNya yang bertaubat dan bertawakal kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia mengetahui apa yang masuk ke dalam tanah berupa air dan tumbuhan, mengetahui apa yang keluar darinya berupa tumbuh-tumbuhan dan lainnya. Dia Mengetahui apa yang turun dari langit berupa hujan, Malaikat dan rezeki, mengetahui apa yang naik ke langit berupa Malaikat, amalan para hamba-Nya dan arwah mereka. Dia Maha Penyayang kepada hamba-hamba-Nya yang beriman, Maha Pengampun terhadap dosa-dosa hamba yang bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah mengetahui makhluk yang masuk ke dalam tanah dan yang keluar darinya yang berupa barang tambang dan tumbuhan, mengetahui makhluk yang turun dari langit seperti hujan, rezeki, ketetapan nasib, berkah, dan rahmat. Dan tidak ada yang makhluk yang turun atau naik, melainkan Allah telah menghitung jumlah seluruhnya dan mengetahui segalanya tentangnya. Allah Maha Pengasih, menyebarkan rahmat-Nya dan Maha Pengampun yang membuka pintu ampunan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. يَعْلَمُ مَا يَلِجُ فِى الْأَرْضِ (Dia mengetahui apa yang masuk ke dalam bumi) Yang berupa air atau harta yang terkubur. وَمَا يَخْرُجُ مِنْهَا(apa yang ke luar daripadanya) Yang berupa tumbuhan, tanaman, dan binatang. وَمَا يَنزِلُ مِنَ السَّمَآءِ(apa yang turun dari langit) Berupa air hujan, salju, es, petir, dan keberkahan, serta para malaikat dan kitab-kitab-Nya yang diturunkan kepada nabi-nabi-Nya. وَمَا يَعْرُجُ فِيهَا ۚ( dan apa yang naik kepadanya) Berupa para malaikat dan amalan-amalan hamba-Nya. وَهُوَ الرَّحِيمُ(Dan Dialah Yang Maha Penyayang) Kepada para hamba-Nya. الْغَفُورُ(lagi Maha Pengampun) Atas dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah Maha Mengetahui atas segala yang ada di bumi, seperti air, simpanan, dan segala yang telah mati. Juga segala sesuatu yang keluar dari bumi, seperti berbagai tanaman, tumbuhan, macam-macam hewan, bebatuan/material keras, mineral/logam dan air yang bersumber. Allah Maha mengetahui atas segala yang Allah turunkan dari langit, seperti hujan, salju, rizki, malaikat, kitab-kitab dan berbagai takdir. Allah Maha Mengetahui atas segala yang naik ke langit seperti amal para hamba-Nya baik dari malaikat, asap maupun uap. Dia Maha Pengasih kepada para hamba-Nya dan Maha Pengampun atas dosa-dosa yang dimintakan taubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengetahui apa yang masuk} masuk {ke dalam bumi, apa yang keluar darinya, apa yang turun dari langit dan apa yang naik} naik {kepadanya. Dialah Dzat Yang Maha Penyayang lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Maka dari itu Allah memperincikan ilmuNya dengan FirmanNya, “Dia mengetahui apa yang masuk ke dalam bumi,” maksudnya, seperti hujan, benih dan hewan, “dan apa yang keluar darinya,” seperti berbagai macam tumbuh-tumbuhan dan beraneka jenis hewan, “dan apa yang turun dari langit,” seperti kekayaan, rizki dan takdir, “dan apa yang naik kepadanya” seperti malaikat, ruh dan lain-lain. Ketika Allah menjelaskan bermacam-macam makhlukNya dan kebijaksanaanNya di dalamnya dan ilmuNya mengenai keadaannya, seraya berfirman, “Dan Dia-lah Yang Maha Penyayang lagi Maha Pengampun,” maksudnya, yang rahmat (sifat belas kasih) dan mengampuni menjadi sifatNYa. Efek dari dua sifat ini terus mengucur kepada hamba-hambaNya setiap saat sesuai dengan amal yang telah mereka kerjakan dari tuntutan-tuntutannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 2: Allah mengabarkan bahwa Dia mengetahui apa yang masuk dalam perut bumi dari tetesan-tetesan air hujan, hasil bumi, mayit-mayit yang di dalamnya serta makhluk yang melata di atas bumi. Allah juga mengetahui apa yang keluar darinya berupa tumbuhan, hasil bumi, air dan mengetahui apa yang turun dari langit berupa air hujan, malaikat, kitab-kitab, takdir dan rezeki. Allah juga mengetahui apa yang naik ke langit dari para malaikat, perbuatan-perbuatan makhluk dan ruh-ruh makhluk. Bersamaan dengan kemampuan Allah ini dan kebesaran serta kemuliaan; Sungguh Allah sajalah Ar Rahim kepada para hamba-hamba-Nya yang beriman. Di antara kasih saying Allah kepada hamba-hamba-Nya yang beriman adalah, tidak menimpakan kepada mereka karena sebab kemaksiatan yang mereka lakukan dengan adzab, karena sebab Allah Maha Pengampun bagi dosa-dosa hamba-Nya, dan menerima taubat bagi hamba-Nya yang betaubat yang kembali kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti air, biji, hewan yang tinggal di dalam tanah dan lainnya. Seperti tumbuhan, hewan yang keluar dari sarangnya di bawah tanah dan lainnya. Seperti hujan dan lainnya. Seperti malaikat, ruh dan amal saleh. Setelah Allah Subhaanahu wa Ta'aala menyebutkan makhluk-makhluk-Nya dan kebijaksanaan-Nya terhadap mereka serta pengetahuan-Nya terhadap keadaan-keadaan mereka, maka Dia menyebutkan ampunan dan rahmat-Nya untuk makhluk-Nya. Ampunan dan rahmat-Nya adalah sifat-Nya, dan atsar (pengaruhnya) senantiasa turun kepada hamba-hamba-Nya di setiap waktu sesuai yang mereka kerjakan dari penghendaknya (sebabnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 2",
    "description": "Dengan kemahatelitian-Nya, dia mengetahui apa yang masuk ke dalam bumi, seperti binatang-binatang, air, dan lain-lain. Dia juga mengetahui apa yang keluar darinya seperti benih yang tumbuh, air yang memancar, dan lain-lain. Allah pun mengetahui apa yang turun dari langit seperti malaikat, hujan, dan sebagainya, dan apa yang naik kepadanya seperti uap, doa dan lain-lain. Dan dialah yang maha penyayang kepada semua hamba-Nya, maha pengampun kepada siapa pun yang bertobat. -."
  }
]