[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis menyangka dengan sangkaan yang tidak yakin bahwa dia akan menyesatkan anak cucu Adam dan bahwa mereka akan menaatinya dalam bermaksiat kepada Allah, maka Allah membenarkan sangkaannya pada mereka, mereka pun menaatinya dan mendurhakai Tuhan mereka, kecuali sekelompok orang-orang yang beriman kepada Allah, mereka tetap teguh di atas ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Sungguh Iblis telah mewujudkan tujuannya pada mereka bahwa ia mampu menyesatkan mereka dan memalingkan mereka dari kebenaran, maka mereka mengikuti Iblis dalam kekufuran dan kesesatan kecuali sekelompok dari orang-orang beriman, mereka ini menggagalkan tujuan Iblis karena mereka menolak mengikutinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Ketika kaum Saba enggan bersyukur, lupa terhadap Pemberi kenikmatan, hidup dalam kemewahan, dan saling berlomba mengumpulkan dunia; maka mereka terjebak dalam tipu daya setan. Maka setan menjadi yakin akan sangkaannya terhadap mereka, kecuali terhadap sekelompok orang yang Allah selamatkan dengan keimanan dari godaan setan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُۥ (Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka) Yakni Iblis menyangka jika ia menyesatkan mereka maka mereka akan mengikutinya. فَاتَّبَعُوهُ(lalu mereka mengikutinya) Al-Hasan berkata: Iblis tidak memaksa mereka dengan pukulan cambuk atau tongkat, namun ia hanya mengira saja bahwa ia dapat menyesatkan mereka dengan godaannya; dan memang yang terjadi seperti yang ia kira."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Sungguh benar sangkaan iblis tehadap mereka ketika menggoda mereka sehingga mereka mengikutinya kecuali satu kelompok dari orang-orang mukmin yang tidak mengikutinya karena keimanan mereka benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Iblis telah membenarkan mereka} membuat nyata untuk mereka {atas sangkaan mereka. Lalu mereka mengikutinya, kecuali sebagian dari orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Kemudian Allah menjelaskan bahwa kaum Saba’ teremasuk orang-orang yang mana iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka, yang mana ia berkata kepada Allah, \"Iblis menjawab: \"Demi kekuasaan Engkau aku akan menyesatkan mereka semuanya, kecuali hamba-hamba-Mu yang mukhlis di antara mereka.\" (Shad:82-83). Ini adalah prasangka iblis, bukan keyakinannya, sebab dia tidak mengetahui yang ghaib dan dia tidak pernah menerima khabar dari Allah bahwasanya ia akan menyesatkan mereka semuanya, kecuali orang yang dikecualikan. Jadi, mereka dan orang-orang yang semisal mereka adalah termasuk orang yang mana iblis membuktikan sangkaannya terhadapnya,ia mengajak dan menyesatkan mereka, “lalu mereka mengikutinya, kecuali sebagian orang-orang yang beriman,” yang tidak kafir kepada nikmat Allah. Orang seperti ini tidak termasuk dalam sangkaan iblis. Boleh jadi kisah kaum Saba’ sudah habis pada Firman Allah, “Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi setiap orang yang sabar lagi bersyukur.” Kemudian Allah memulai hal baru, seraya berfirman, “Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka” yaitu terhadap jenis manusia. Jika demikian, maka ayat tersebut bermakna umum, meliputi setiap orang yang mengikuti iblis."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 20: Allah mengabarkan bahwa iblis telah menyangka bahwa manusia telah dikuasai; Di mana iblis yakin bahwasanya manusia akan mentaatinya dan mengikutinya dengan apa yang dia telah hiasi mereka dan memerintahkan mereka dengan kesesatan; Di mana ia (iblis) berkata : Sungguh dengan kemuliaan-Mu, aku akan sesatkan mereka semua {Shad : 82}, dan urusannya sebagaimana yang iblis sangka; Ia benar, manusia mengikuti apa yang telah iblis perintahkan kepada mereka dari kesyirikan dan kesesatan; Kecuali bagi mereka yaitu segolongan manusia yang beriman yang tidak mengindahkan perintah iblis dan mengikutinya, mereka adalah hamba-hamba Allah yang bertauhid yang ikhlas yang Allah berkata pada mereka : Sesungguhnya bagi hamba-Ku tiada bagimu kekuasaan kecuali bagi orang-orang yang sesat {Al Hijr : 42}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan, bahwa kaum Saba’ telah membenarkan persangkaan Iblis, di mana dia pernah berkata, \"Ya Tuhanku, oleh sebab Engkau telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi, dan pasti aku akan menyesatkan mereka semuanya,-- Kecuali hamba-hamba Engkau yang mukhlis di antara mereka.” (lihat Al Hijr: 39-40) Ini adalah sangkaan Iblis, tidak secara yakin, karena ia tidak mengetahui yang gaib, dan tidak datang kepadanya berita dari Allah bahwa ia akan menyesatkan manusia semua kecuali orang-orang yang ia kecualikan. Oleh karena itu, mereka yang kufur kepada Allah termasuk orang-orang yang membenarkan sangkaan iblis dan terbawa bujukan dan rayuannya. Maka mereka tidak mengikutinya. Bisa jadi kisah kaum Saba’ sampai pada firman Allah Ta’ala, “Sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kekuasaan Allah bagi setiap orang yang bersabar dan bersyukur.” Sedangkan ayat setelahnya merupakan ayat yang baru, sehingga ayat tersebut umum mengena kepada semua orang yang mengikuti Iblis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 20",
    "description": "Kedurhakaan kaum saba' membuktikan betapa iblis mampu me-realisasikan sumpahnya di hadapan Allah ketika dia terkutuk akibat membangkang perintah Allah untuk bersujud kepada nabi adam. 'dan sungguh, iblis telah dapat meyakinkan dengan berbagai tipu daya terhadap mereka, anak-cucu nabi adam, tentang kebenaran sangkaannya bahwa dia mampu menjerumuskan manusia ke jalan kesesatan, lalu mereka mengikutinya, kecuali sebagian dari orang-orang mukmin yang kuat keimanannya (lihat juga: ''d/38: 82'83). 21. Alasan Allah memberi iblis kesempatan untuk menjerumuskan manusia ke dalam kesesatan adalah untuk menguji keimanan manusia. Dan tidak ada kekuasaan bagi iblis terhadap mereka, yakni anak-cucu nabi adam, melainkan hanya agar kami dapat membedakan siapa yang beriman kepada adanya akhirat dan siapa yang masih ragu-ragu tentang akhirat itu. Dan tuhanmu maha memelihara segala sesuatu di alam semesta."
  }
]