[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis tidak memiliki kekuasaan atas orang-orang kafir sehingga bisa memaksa mereka untuk menjadi kafir, akan tetapi hikmah Allah menuntut untuk memberi kesempatan kepada iblis agar menggoda anak cucu Adam, supaya apa yang Allah ketahui di alam azali terlihat, agar Dia membedakan antara siapa yang membenarkan kebangkitan, pahala dan siksa dengan siapa yang meragukannya. Dan Tuhanmu Maha menjaga segala sesuatu dengan penjagaanNya dan akan memberikan balasan atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Iblis tidak memiliki kekuasaan terhadap manusia yang membuatnya mampu menyesatkan mereka, akan tetapi ia hanya menggoda dan menghiasi. Kami mengizinkan Iblis melakukan hal itu agar Kami mengetahui secara nyata siapa yang beriman dengan Akhirat dan balasan yang disiapkan di sana, dan siapa yang meragukan Akhirat. Tuhanmu -wahai Rasul- menjaga segala sesuatu, menjaga amalan para hamba-Nya dan membalas mereka atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Dan sesungguhnya setan tidak akan mampu menggoda Bani Adam kalaulah bukan karena Allah telah menetapkan akan godaannya menjadi ujian bagi manusia. Iblis tidak memaksa mereka untuk kafir, akan tetapi dia hanya mengajak dan menggoda saja; dan manusia tidak mengikuti mereka melainkan karena menuruti hawa nafsu mereka tanpa memiliki dalil dan alasan yang benar. Hikmah Allah di balik semua itu adalah agar Dia menguji manusia, agar terlihat siapa yang benar-benar beriman. Allah Maha Mengawasi hamba-hamba-Nya, menghitung seluruh amalan mereka, dan akan membalas amalan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَمَا كَانَ لَهُۥ عَلَيْهِم مِّن سُلْطٰنٍ (Dan tidak adalah kekuasaan iblis terhadap mereka) Yakni Iblis tidak memaksa mereka untuk menjadi kafir, namun ia hanya mengajak, menggoda, dan mengiming-imingi mereka. إِلَّا لِنَعْلَمَ مَن يُؤْمِنُ بِالْاٰخِرَةِ مِمَّنْ هُوَ مِنْهَا فِى شَكٍّ ۗ( melainkan hanyalah agar Kami dapat membedakan siapa yang beriman kepada adanya kehidupan akhirat dari siapa yang ragu-ragu tentang itu) Namun Kami uji mereka dengan godaan Iblis, hanya agar Kami mengetahui dalam kenyataan, sebab Allah telah mengetahui segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Dan tidak adalah kekuasaan dan kewenangan bagi Iblis terhadap orang-orang yang menyimpang itu melainkan hanya membujuk dan menggoda. Akan tetapi kami menggoda mereka dengan bujukannua supaya Kami bisa menampakkan orang yang beriman kepada akhirar dan orang yang meragukannya. Dan Tuhanmu itu Maha Mengawasi segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada kekuasaan} kekuasaan {bagi Iblis atas mereka, kecuali agar Kami mengetahui siapa yang beriman pada akhirat dan siapa yang ragu-ragu tentangnya. Dan Tuhanmu Maha Memelihara segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Kemudian Allah berfirman, “Dan tidak ada baginya” maksudnya, bagi iblis “sedikit pun kekuasaan terhadap mereka” maksudnya, pengendalian penguasaan dan pemaksaan terhadap apa yang dikehendakinya dari mereka; namun hikmah (kebijaksanaan) Allah menuntut penguasaan iblis dan bujukannya terhadap manusia, “agar Kami dapat membedakan siapa yang beriman kepada adanya kehidupan akhirat dari siapa yang ragu-ragu tentang itu,” makusdnya, agar terjadi proses pengujian, dan dengannya dapat diketahui orang yang jujur dan yang dusta, serta dapat dibedakan siapa yang imannya benar-benar tetap teguh dalam menghadapi ujian, cobaan dan menghadapi syubhat-syubhat (pemikiran rancu) setan dari orang yang imannya tidak kokoh lagi mudah goncang dengan (ujian) syubhat yang sangatb sepele, dan (imannya) mudah terkikis disebabkan faktor yang sangat sederhana yang mengajaknya kepada lawan iman. Jadi, Allah menjadikan iblis sebagai ujian untuk menguji hamba-hambaNya dan menampakkan mana yang busuk dan mana yang baik, “Dan Rabbmu Maha Memelihara segala sesuatu,” memelihara hamba-hambaNYa dan menjaga amal perbuatan mereka serta memelihara balasannya, dan Dia akan memberikannya kepada mereka secara sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 21: Ketahuilah wahai manusia, tidaklah bagi iblis berkuasa atas manusia dengan seruan iblis kepada manusia; Hanyalah semata-mata dengan was-was (bisikan) dan menghiasi (kesesatan), untuk menguji manusia, dan membedakan mana yang jujur (dalam keimanan) dan yang dusta, yang beriman dengan ada kemunafikan serta yang kufur, dan juga untuk menampakkan siapa yang beriman dengan akhirat dan hari kebangkitan dengan keimanan yang kokoh, dan sebagai penjelas siapa yang ragu atas keimanan tersebut. Ketahuilah wahai Nabi Allah, sungguh Tuhanmu menjaga pada setiap sesuatu, mejaga amalan-amalan manusia, serta menjaga balasam bagi amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Iblis tidak berkuasa memaksa mereka mengikuti keinginannya, ia hanya bisa membujuk dan mengajak manusia. Yakni agar tegak ujian, di mana dengannya dapat diketahui siapa yang benar dan siapa yang berdusta. Demikian pula dapat diketahui orang yang imannya benar yang kokoh ketika mendapatkan ujian dan dapat melawan syubhat-syubhat setan dengan orang yang imannya tidak teguh dan mudah goncang oleh syubhat yang datang meskipun kecil. Oleh karena itu, Allah menjadikan Iblis sebagai ujian, di mana dengannya Dia menguji hamba-hamba-Nya agar tampak siapa yang baik dan siapa yang buruk. Dia menjaga hamba, menjaga amal mereka, menjaga balasannya dan nanti Dia akan memberikan secara sempurna untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 21",
    "description": "Alasan Allah memberi iblis kesempatan untuk menjerumuskan manusia ke dalam kesesatan adalah untuk menguji keimanan manusia. Dan tidak ada kekuasaan bagi iblis terhadap mereka, yakni anak-cucu nabi adam, melainkan hanya agar kami dapat membedakan siapa yang beriman kepada adanya akhirat dan siapa yang masih ragu-ragu tentang akhirat itu. Dan tuhanmu maha memelihara segala sesuatu di alam semesta. 22. Allah maha esa, pemelihara alam semesta, dan hanya dia yang berhak disembah. Orang-orang yang menyembah selain Allah adalah mereka yang tertipu rayuan iblis. Sembahan mereka tidak sedikit pun memberi mereka manfaat. Katakanlah, wahai nabi Muhammad, kepada mereka yang mempersekutukan Allah, \"seru dan minta-lah mereka yang kamu anggap sebagai tuhan selain Allah untuk menolak mudarat atau mendatangkan manfaat!\" mereka, yakni sembahan itu, tidak memiliki kekuasaan seberat zarrah pun. Mereka tidak punya kuasa sekecil apa pun di langit dan di bumi, dan mereka sama sekali tidak mempunyai peran serta dalam penciptaan, pemeliharaan, dan peng-aturan langit dan bumi, dan tidak ada di antara mereka yang menjadi pembantu bagi-Nya dalam urusan apa pun. ' (lihat juga: f''ir/35: 13)."
  }
]