[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang musyrik, “Panggillah apa yang menurut kalian adalah sekutu-sekutu bagi Allah lalu kalian menyembahnya selain Allah berupa berhala-berhala, malaikat-malaikat dan manusia. Mintalah mereka untuk menunaikan hajat kalian, karena mereka tidak akan menjawab kalian, mereka tidak memiliki apa pun walaupun hanya seberat semut kecil sekalipun, baik di langit maupun di bumi, mereka tidak memiliki wewenang sedikit pun di langit dan di bumi.” Allah tidak dibantu oleh seorang pun dari orang-orang musyrik itu untuk menciptakan sesuatu, sebaliknya Allah adalah satu-satunya Dzat yang mengadakan, maka hanya Dia-lah yang patut disembah, tidak seorang pun selainNya yang berhak disembah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Katakanlah -wahai Rasul- kepada orang-orang musyrikin, “Panggillah orang-orang yang kalian anggap sebagai tuhan-tuhan kalian selain Allah agar mereka mendatangkan manfaat bagi kalian atau mengangkat mudarat dari kalian. Mereka tidak memiliki apa pun walau seberat biji sawi di langit dan di bumi, mereka tidak mempunyai sekutu dengan Allah pada keduanya. Allah tidak memiliki penolong yang membantu-Nya, Allah Mahakaya sehingga tidak memerlukan para pembantu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Hai Muhammad, katakanlah kepada orang-orang musyrik sebagai bantahan dan tantangan bagi mereka: “Datangkanlah tuhan-tuhan yang kalian sembah itu, mereka sama sekali tidak mengusai alam semesta ini. Allah sama sekali tidak meminta bantuan dari mereka atau dari yang lain, karena Allah tidak membutuhkan penolong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. قُلِ ادْعُوا۟ الَّذِينَ زَعَمْتُم مِّن دُونِ اللهِ ۖ (Katakanlah: “Serulah mereka yang kamu anggap (sebagai tuhan) selain Allah) Agar mereka dapat menghilangkan mudharat yang menimpa kalian pada tahun-tahun kelaparan itu. لَا يَمْلِكُونَ مِثْقَالَ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الْأَرْضِ(mereka tidak memiliki (kekuasaan) seberat zarrahpun di langit dan di bumi) Yakni mereka tidak memiliki kemampuan untuk mendatangkan kebaikan atau keburukan dalam urusan apapun. وَمَا لَهُمْ فِيهِمَا مِن شِرْكٍ(dan mereka tidak mempunyai suatu sahampun dalam (penciptaan) langit dan bumi) Yakni patung-patung itu tidak berbuat sedikitpun dalam urusan di langit dan bumi, tidak dalam penciptaan, kekuasaan, maupun, pengaturan. وَمَا لَهُۥ مِنْهُم مِّن ظَهِيرٍ(dan sekali-kali tidak ada di antara mereka yang menjadi pembantu bagi-Nya) Yakni pembantu yang membantu-Nya untuk mengurus langit, bumi, dan apa yang ada di dalam keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai rasulallah, katakanlah kepada orang-orang musyrik Mekah dan orang musyrik lainnya: \"Serulah berhala-berhala yang kalian anggap bahwa mereka adalah Tuhan selain Allah untuk menyingkap rahasia kalian atau menyiarkan kebaikan kalian\". Faktanya, mereka itu (berhala) tidak memiliki sezarrah pun kebaikan atau keburukan di langit dan bumi. Mereka juga tidak menyertai (Allah) dalam penciptaan, penguasaan dan pengaturan (segala sesuatu). Dan Allah SWT tidak dibantu oleh mereka dalam mengatur sesuatu berupa urusan makhluk-makhlukNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Serulah mereka yang kamu anggap (sebagai tuhan) selain Allah. Mereka tidak memiliki (kekuasaan) seberat zarrah pun di langit dan di bumi. Mereka juga tidak ikut campur dalam penciptaan keduanya} ikut serta dalam penciptaan {dan tidak ada di antara mereka yang menjadi pembantu bagiNya”} pembantu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. Maksudnya, “Katakanlah” wahai Rasul kepada orang-orang yang mempersekutukan Allah dengan yang lainnya dari kalangan makhluk yang tidak bisa menciptakan manfaat atau pun mudarat, dengan memastikan ketidakberdayaannya kepada mereka dan menjelaskan kepalsuan beribadah kepadanya, “Serulah mkereka yang kamu yakini selain Allah,” maksudnya, tuhan yang kalian yakini bahwa mereka adalah sekutu-sekutu bagi Allah, jika seruan kalian berguna. Sebab, sesungguhnya faktor-faktor ketidakberdayaan dan ketidakmampuan mengabulkan doa sudah terpenuhi dari segala sisi. Karena mereka sama sekali tidak memeliki kemampuan sekecil apa pun. Mereka tidak memiliki seberat bbiji sawi pun di langit dan di bumi ini, baik secara independen ataupun secara bersama. Maka dari itu Allah berfirman,”Mereka tidak memiliki” maksudnya, sesembahan-sesembahan yang kalian yakini itu (sama sekali) tidak memiliki, “di keduanya,” di langit dan di bumi, “suatu saham pun” maksudnya, tidak memiliki saham kecil ataupun saham besar. Jadi mereka sama sekali tidak memiliki kepemilikan ataupun saham. Tinggal dikatakan, “Selain itu, bisa jadi mereka menjadi para pembantu bagi sang pemilik dan menteri-menteriNya, sehingga doa mereka menjadi bermanfaat, karena disebabkan kebutuhan sang Raja kepada mereka, maka mereka bisa menunaikan kebutuhan-kebutuhan siapa saja yang bergantung kepada mereka. Namun Allah menafikan kedudukan ini seraya berfirman, “Dan sekali-kali tidak ada bagiNya,” maksudnya: Bagi Allah yang Maha Esa lagi Mahaperkasa “dari mereka” maksudnya, dari para sesembahan-sesembahan itu, “yang menjadi pembantu,” yakni: Yang menjadi penolong dan menteri yang membantunya dalam kerajaan dan pengaturan. Kemudian, tidak ada yang tersisa selain syafa’at. Namun Allah menafikan syafa’at dengan FirmanNya, “Dan tiadalah berguna syafa’at di sisi Allah melainkan bagi orang yang telah diizinkanNYa.” Inilah beberapa macam bentuk ketergantungan yang mana orang-orang musyrik menjadikannya sebagai sandaran kepada sesembahan-sesembahan dan berhala-berhala mereka dari jenis manusia, pepohonan, bebatuan dan lain sebagainya. Ia diputuskan oleh Allah dan dijelaskan kepalsuannya dengan penjelasan yang mencincang habis materi-materi nsyirik dan memutus dasar-dasarnya, karena sesungguhnya orang yang musyrik itu sebenarnya hanyalah berdoa dan beribadah (menyembah) kepada selain Allah, dengan maksud mengharapkan manfaat darinya. Pengharapan seperti inilah yang menyebabkannya terjerumus ke dalam syirik. Apabila yang diseur dari selain Allah itu tidak memiliki manfaat dan mudarat (tidak dapat memberikan manfaat dan mudarat), dan bukan juga sekutu bagi Sang Maha Pemilik, bukan pembantu dan bukan pula penolong bagiNya, dan ia tidak kuasa memberikan syafa’at tanpa ada izin dari Sang Maha Pemilik, maka doa dan ibadah tersebut merupakan kesesatan menurut akal dan kebatilan menurut syariat, bahkan permintaan dan harapan mereka itu berbalik menimpa kepada pelaku syirik itu. Sebab, dia sebenarnya menginginkan manfaat darinya, lalu Allah menjelaskan kepalsuan dan ketidakbergunaannya, dan Dia menjelaskan di dalam ayat-ayatNya yang lain bahwa bahayanya menimpa para penyembahnya, dan bahwa nanti di Hari KIamat sebagian mereka mengingkari sebagian yang lain dan saling mengutuk, dan tempat mereka semua adalah neraka. \"Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.\" (Al-Ahqaf:6). Yang aneh lagi adalah bahwa orang musyrik itu menyombongkan diri untuk tunduk kepada para rasul dengan alasan bahwa mereka adalah manusia biasa sementara dia sendiri rela menyembah dan berdoa kepada pepohonan dan bebatuan, ia menyombongkan diri untuk tulus kepada Sang Maharaja Yang Maha Pengasih lagi Mahaperkasa, sementara dia rela menyembah sembahan yang bahayanya lebih dekat daripada manfaatnya, karena taat kepada musuh bebuyutannya, yaitu setan. Dan FirmanNya, “Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata, ‘Apakah yang telah difirmankan oleh Rabbmu?’ mereka menjawab, ‘(Perkataan) yang benar,’ dan Dia-lah Yang Mahatinggi lagi Mahabesar.” Kemungkinan pertama kata ganti (dhamir) “hum” dalam ayat ini kembali kepada kaum musyrikin, sebab mereka disebutkan di dalam redaksi ayat tersebut, sedangkan kaidah tentang dhamir (kata ganti) itu adalah kembali kepada kata yang paling dekat (yang disebutkan). Maka makna ayat di atas adalah: Apabila Hari Kiamat terjadi dan rasa ketakutan telah dihilangkan dari hati orang-orang musyrikin. Maksudnya, rasa takut sudah tidak ada dan mereka ditanya, -saat akal mereka sudah dikembalikan-, tentang keadaan mereka dahulu di dunia dan tentang pendustaan mereka terhadap kebenaran yang dibawa oleh para rasul, maka mereka mengakui bahwa apa yang mereka anut, yaitu kekafiran dan kesyirikan itu adalah batil, dan bahwa apa yang dikatakan oleh Allah dan diberitakan oleh para rasul itulah yang haq. Maka terungkaplah apa yang dahulu mereka sembunyikan, mereka tahu bahwa kebenaran adalah milik Alllah dan mereka mengakui dosa-dosa mereka. “Dan Dia-lah Yang Mahatinggi” dengan DzatNYa di atas seluruh makhluk, keperkasaanNya terhadap mereka dan ketinggian martabatNya karena sifat-sifatNYa yang agung lagi suci, “lagi Mahabesar” DzatNya dan Sifat-SifatNya. Dan di antara ketinggianNya adalah bahwa hukum (keputusan) Allah itu tinggi, jiwa tunduk kepadanya, hingga jiwa orang-orang yang menyombongkan diri dan kaum musyirikin sekalipun. Makna ini sudah sangat jelas dan inilah yang ditunjukkan oleh konteks ayat. Kemungkinan kedua, dhamir “hum” kembali kepada para malaikat. Sebab, Allah apabila berbicara melalui wahyu, maka didengar oleh para malaikat dan mereka tersentak ketakutan dan menyungkur sujud kepada Allah. Dan malaikat pertama yang mengangkat kepalanya adalah JIbril, lalu Allah menyampaikan wahyu yang dikehendakiNya kepadanya. Lalu apabila rasa ketakutan sudah hilang dari hati para malaikat, maka sebagian mereka menanyakan kepada sebagian yang lain tentang firman yang menyebabkan mereka tersentak itu, “Apa yang telah dikatakan oleh Rabb?” maka sebagiannya menjawab, “Perkataan yang haq.” Bisa jadi jawaban itu secara global, karena mereka telah mengetahui bahwa Dia tidak mengatakan kecuali yang haq, atau mereka mengatakan, “Dia berfirman begini dan begitu” untuk firman yang telah mereka dengar dariNYa. Dan yang demikian itu termasuk yang haq. Maka makna ayat di atas berdasarkan alternative ini adalah bahwa kaum musyrikin yang menyembah sembahan-sembahan selain Allah, yang telah kami uraikan kepada kalian tentang ketidakberdayaannya, kelemahannya dan ketidakmampuannya memberikan manfaat dari sudut mana pun, bagaimana mungkin mereka bisa berpaling dan menjauh dari ketulusan ibadah kepada Rabb yang Mahaagung, Mahatinggi lagi Mahabesar, yang karena keagungan dan kebesaranNya menciptakan sikap tunduk dan rasa takut para malaikat nan mulia lagi muqarrabin sampai pada kadar seperti itu, dan mereka semua mengakui bahwasanya Allah tidak mengatakan nkecuali yang haq. Lalu bagaimana kaum musyrikin bisa menyombongkan diri untuk beribadah kepada TUhan yang sedemikian keadaanNya dan keagungan kerajaan dan kekuasaanNYa? Maka Mahasuci Allah yang Mahatinggi lagi Mahabesar dari kesyirikan kaum musyrikin, dari kedustaan dan kebohongan mereka!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 22: Allah memerintahkan Nabi-Nya Muhammad ﷺ agar mengatakan kepada mereka orang-orang musyrik : Serulah mereka yang telah kalian anggap sebagai sekutu-sekutu Allah, lihatlah apakah mereka akan menjawab seruan kalian ? Dan apakah mereka dapat memiliki kuasa dengan mendatangkan manfaat dan mudharat walaupun sebesar biji dzarrah ? Dan yang benar : Mereka (tuhan-tuhan) itu hanyalah klaim, tidaklah mereka memiliki di langit maupun di bumi kekuasaan, meskipun hanya secuil kekuasaan. Agar mereka tahu, bahwasanya tidak ada bagi Allah penolong yang menolong kerajaan-Nya dan menolong dalam menjaga makhluk-Nya. Karena Allah lah yang memenuhi kebutuhan makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang menyekutukan Allah dengan sesuatu yang tidak dapat memberi manfaat dan tidak dapat menimpakan bahaya, sambil menerangkan kelemahannya dan menjelaskan batilnya beribadah kepadanya. Untuk memberimu manfaat, karena telah berkumpul pada diri mereka sebab-sebab kelemahan dan mereka tidak sanggup mengabulkan doa dari berbagai sisi. Mereka juga tidak memiliki apa-apa meskipun kecil di langit dan di bumi. Oleh karena itu, mereka tidak memiliki apa pun dan tidak memiliki peran pada penciptaan langit dan bumi. Jika ada perkataan, “Memang mereka tidak memiliki apa-apa dan tidak memiliki peran dalam hal itu, tetapi bisa saja mereka sebagai pembantu bagi Allah, sehingga berdoa kepada sekutu-sektu itu bisa bermanfaat.” Maka dalam ayat ini Allah Subhaanahu wa Ta'aala membantahnya, bahwa Dia tidak memiliki pembantu sama sekali. Tinggallah masalah syafaat, maka Allah Subhaanahu wa Ta'aala nafikan juga dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 22",
    "description": "Allah maha esa, pemelihara alam semesta, dan hanya dia yang berhak disembah. Orang-orang yang menyembah selain Allah adalah mereka yang tertipu rayuan iblis. Sembahan mereka tidak sedikit pun memberi mereka manfaat. Katakanlah, wahai nabi Muhammad, kepada mereka yang mempersekutukan Allah, \"seru dan minta-lah mereka yang kamu anggap sebagai tuhan selain Allah untuk menolak mudarat atau mendatangkan manfaat!\" mereka, yakni sembahan itu, tidak memiliki kekuasaan seberat zarrah pun. Mereka tidak punya kuasa sekecil apa pun di langit dan di bumi, dan mereka sama sekali tidak mempunyai peran serta dalam penciptaan, pemeliharaan, dan peng-aturan langit dan bumi, dan tidak ada di antara mereka yang menjadi pembantu bagi-Nya dalam urusan apa pun. ' (lihat juga: f''ir/35: 13). 23. Dan syafaat, yakni pertolongan, di sisi-Nya hanya berguna bagi orang yang telah diizinkan-Nya untuk memberi dan memperoleh syafaat itu, seperti para malaikat, nabi, dan orang saleh. Sehingga apabila telah dihilangkan ketakutan dari hati mereka, yakni orang-orang yang akan diberi izin untuk memberi syafaat dan orang-orang yang akan mendapat syafaat, mereka yang akan mendapat syafaat berkata, 'apakah yang telah difirmankan dan ditetapkan oleh tuhanmu untuk kami'' mereka menja-wab, 'Allah memberi keputusan yang benar, ' dan dialah yang mahatinggi zat dan kedudukan-Nya, mahabesar keagungan dan kekuasaan-Nya (lihat juga: al-baqarah/2: 255, y'nus/10: 3, dan al-anbiy'/21: 28)."
  }
]