[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Syafa’at pemberi syafa’at di sisi Allah tidak berguna kecuali bagi siapa yang Allah izinkan. Dan karena keagungan dan kemuliaan Allah, bila Dia berfirman dengan wahyu, lalu penduduk langit mendengar FirmanNya, mereka gemetar ketakutan, hingga mereka seperti pingsan, pada saat ketakutan itu lenyap dari hati mereka, sebagian bertanya kepada sebagian yang lain, “Apa yang difirmankan oleh Tuhan kalian?” Malaikat menjawab, “Dia berfirman yang haq,” dan Dia Mahatinggi dengan Dzat, kekuasaan, dan kedudukanNya, juga Mahabesar atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Syafaat di sisi Allah -Subḥānahu- tidak berguna kecuali bagi siapa yang Allah izinkan untuk memberikannya, dan Allah tidak mengizinkan kecuali siapa yang Dia ridai, hal ini karena keagungan-Nya. Dan di antara keagungan Allah adalah bahwa bila Dia berfirman di langit, maka para Malaikat mengepakkan sayap mereka sebagai wujud dari ketakutan dan ketundukan mereka kepada firman-Nya, hingga ketika rasa takut itu hilang, mereka berkata, “Apa yang Tuhan kalian firmankan?” Mereka menjawab, “Kebenaran, dan Dia Mahatinggi dengan Żat dan kekuasaan-Nya, lagi Mahabesar, di mana selain-Nya lebih kecil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Syafaat tidak diterima dan tidak berguna melainkan bagi orang yang telah mendapat izin dari-Nya. adapun orang-orang yang menyekutukan-Nya maka mereka tidak berhak mendapat syafaat. Dan jika manusia diberi izin untuk memberi syafaat maka mereka akan ketakutan akibat keadaan mereka yang bercampur dengan hari kiamat yang mengerikan yang sedang terjadi dan ketakutan terjadinya sesuatu yang tidak mereka inginkan. Dan ketika mereka di angkat ke langit, mereka berkata kepada malaikat yang ada di atas mereka: “Apa diperintahkan Tuhan kalian?” Malaikat itu menjawab: “Perkataan yang benar, yaitu menerima syafaat kalian bagi orang-orang yang berhak mendapatkannya.” Ini menggambarkan kebesaran dan keagungan Allah. Dia memberi ketetapan terhadap hamba-Nya sesuai kehendak-Nya dan berbuat apa yang Dia kehendaki; Dia Maha Tinggi dan Maha Besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَا تَنفَعُ الشَّفٰعَةُ عِندَهُۥٓ إِلَّا لِمَنْ أَذِنَ لَهُۥ ۚ (Dan tiadalah berguna syafa’at di sisi Allah melainkan bagi orang yang telah diizinkan-Nya memperoleh syafa’at itu) Yakni syafaat sama sekali tidak berguna kecuali bagi orang yang telah mendapat izin dari Allah untuk memberi syafaat, baik dari golongan para malaikat, nabi, dan orang beriman, berilmu dan beramal. Dan syafaat mereka tidak diberikan kecuali kepada orang yang berhak, dan bukan bagi orang-orang kafir. حَتَّىٰٓ إِذَا فُزِّعَ عَن قُلُوبِهِمْ (sehingga apabila telah dihilangkan ketakutan dari hati mereka) Ketakutan ini adalah ketakutan para malaikat pada saat diperintah oleh Tuhan mereka. Yakni ketakutan mereka ini berasal dari perintah Allah, dan bagaimana mereka diminta untuk memberi syafaat bagi orang yang tidak diridhai Allah? Imam Bukhari dan Abu Daud mengeluarkan hadits dari Abu Hurairah bahwa Nabi bersabda: “apabila Allah menetapkan suatu perintah di langit, para malaikat mengepakkan sayap-sayap mereka karena ketundukan mereka pada firman-Nya, seakan-akan itu adalah rantai yang dipukulkan batu yang licin yang menembus mereka, dan apabila hati mereka ketakutan mereka saling bertanya: apa yang difirmankan oleh tuhan kalian? Mereka menjawab kepada malaikat yang bertanya: Dia memfirmankan kebenaran, dan Dia Maha Tinggi dan Agung.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Dalam berbagai kondisi, suatu syafaat di sisi Allah tidak berguna melainkan bagi orang yang diizinkan untuk diberi syafaat, seperti para malaikat, nabi dan orang alim yang memang berhak menerima syafaat, bukan orang-orang kafir. Sehingga apabila dihilangkan teror atau ketakutan dari hati orang-orang yang diberi syafaat karena telah mengetahui bahwa mereka adalah orang-orang yang layak, sebagian mereka berkata kepada yang lainnya: \"Apa yang telah difirmankan oleh Tuhanmu sehingga mengizinkan pemberian syafaat?\" Mereka menjawab: \"Perkataan yang benar, yaitu izin pemberian syafaat bagi orang yang diridhai dan mereka adalah orang-orang mukmin. Allah SWT adalah pemilik ketinggian mutlak dengan kuasa dan keaguanganNya. Tidak ada satupun yang dapat menjadi sekutu bagiNya dalam dua hal ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak berguna syafaat di sisiNya kecuali bagi orang yang Dia beri izin sehingga apabila telah dihilangkan ketakutan dari hati mereka} diangkat ketakutan dari hati mereka {mereka berkata,“Apa yang telah difirmankan Tuhan kalian” Mereka menjawab,“Kebenaran” Dialah Dzat Yang Maha tinggi lagi Maha besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. Maksudnya, “Katakanlah” wahai Rasul kepada orang-orang yang mempersekutukan Allah dengan yang lainnya dari kalangan makhluk yang tidak bisa menciptakan manfaat atau pun mudarat, dengan memastikan ketidakberdayaannya kepada mereka dan menjelaskan kepalsuan beribadah kepadanya, “Serulah mkereka yang kamu yakini selain Allah,” maksudnya, tuhan yang kalian yakini bahwa mereka adalah sekutu-sekutu bagi Allah, jika seruan kalian berguna. Sebab, sesungguhnya faktor-faktor ketidakberdayaan dan ketidakmampuan mengabulkan doa sudah terpenuhi dari segala sisi. Karena mereka sama sekali tidak memeliki kemampuan sekecil apa pun. Mereka tidak memiliki seberat bbiji sawi pun di langit dan di bumi ini, baik secara independen ataupun secara bersama. Maka dari itu Allah berfirman,”Mereka tidak memiliki” maksudnya, sesembahan-sesembahan yang kalian yakini itu (sama sekali) tidak memiliki, “di keduanya,” di langit dan di bumi, “suatu saham pun” maksudnya, tidak memiliki saham kecil ataupun saham besar. Jadi mereka sama sekali tidak memiliki kepemilikan ataupun saham. Tinggal dikatakan, “Selain itu, bisa jadi mereka menjadi para pembantu bagi sang pemilik dan menteri-menteriNya, sehingga doa mereka menjadi bermanfaat, karena disebabkan kebutuhan sang Raja kepada mereka, maka mereka bisa menunaikan kebutuhan-kebutuhan siapa saja yang bergantung kepada mereka. Namun Allah menafikan kedudukan ini seraya berfirman, “Dan sekali-kali tidak ada bagiNya,” maksudnya: Bagi Allah yang Maha Esa lagi Mahaperkasa “dari mereka” maksudnya, dari para sesembahan-sesembahan itu, “yang menjadi pembantu,” yakni: Yang menjadi penolong dan menteri yang membantunya dalam kerajaan dan pengaturan. Kemudian, tidak ada yang tersisa selain syafa’at. Namun Allah menafikan syafa’at dengan FirmanNya, “Dan tiadalah berguna syafa’at di sisi Allah melainkan bagi orang yang telah diizinkanNYa.” Inilah beberapa macam bentuk ketergantungan yang mana orang-orang musyrik menjadikannya sebagai sandaran kepada sesembahan-sesembahan dan berhala-berhala mereka dari jenis manusia, pepohonan, bebatuan dan lain sebagainya. Ia diputuskan oleh Allah dan dijelaskan kepalsuannya dengan penjelasan yang mencincang habis materi-materi nsyirik dan memutus dasar-dasarnya, karena sesungguhnya orang yang musyrik itu sebenarnya hanyalah berdoa dan beribadah (menyembah) kepada selain Allah, dengan maksud mengharapkan manfaat darinya. Pengharapan seperti inilah yang menyebabkannya terjerumus ke dalam syirik. Apabila yang diseur dari selain Allah itu tidak memiliki manfaat dan mudarat (tidak dapat memberikan manfaat dan mudarat), dan bukan juga sekutu bagi Sang Maha Pemilik, bukan pembantu dan bukan pula penolong bagiNya, dan ia tidak kuasa memberikan syafa’at tanpa ada izin dari Sang Maha Pemilik, maka doa dan ibadah tersebut merupakan kesesatan menurut akal dan kebatilan menurut syariat, bahkan permintaan dan harapan mereka itu berbalik menimpa kepada pelaku syirik itu. Sebab, dia sebenarnya menginginkan manfaat darinya, lalu Allah menjelaskan kepalsuan dan ketidakbergunaannya, dan Dia menjelaskan di dalam ayat-ayatNya yang lain bahwa bahayanya menimpa para penyembahnya, dan bahwa nanti di Hari KIamat sebagian mereka mengingkari sebagian yang lain dan saling mengutuk, dan tempat mereka semua adalah neraka. \"Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.\" (Al-Ahqaf:6). Yang aneh lagi adalah bahwa orang musyrik itu menyombongkan diri untuk tunduk kepada para rasul dengan alasan bahwa mereka adalah manusia biasa sementara dia sendiri rela menyembah dan berdoa kepada pepohonan dan bebatuan, ia menyombongkan diri untuk tulus kepada Sang Maharaja Yang Maha Pengasih lagi Mahaperkasa, sementara dia rela menyembah sembahan yang bahayanya lebih dekat daripada manfaatnya, karena taat kepada musuh bebuyutannya, yaitu setan. Dan FirmanNya, “Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata, ‘Apakah yang telah difirmankan oleh Rabbmu?’ mereka menjawab, ‘(Perkataan) yang benar,’ dan Dia-lah Yang Mahatinggi lagi Mahabesar.” Kemungkinan pertama kata ganti (dhamir) “hum” dalam ayat ini kembali kepada kaum musyrikin, sebab mereka disebutkan di dalam redaksi ayat tersebut, sedangkan kaidah tentang dhamir (kata ganti) itu adalah kembali kepada kata yang paling dekat (yang disebutkan). Maka makna ayat di atas adalah: Apabila Hari Kiamat terjadi dan rasa ketakutan telah dihilangkan dari hati orang-orang musyrikin. Maksudnya, rasa takut sudah tidak ada dan mereka ditanya, -saat akal mereka sudah dikembalikan-, tentang keadaan mereka dahulu di dunia dan tentang pendustaan mereka terhadap kebenaran yang dibawa oleh para rasul, maka mereka mengakui bahwa apa yang mereka anut, yaitu kekafiran dan kesyirikan itu adalah batil, dan bahwa apa yang dikatakan oleh Allah dan diberitakan oleh para rasul itulah yang haq. Maka terungkaplah apa yang dahulu mereka sembunyikan, mereka tahu bahwa kebenaran adalah milik Alllah dan mereka mengakui dosa-dosa mereka. “Dan Dia-lah Yang Mahatinggi” dengan DzatNYa di atas seluruh makhluk, keperkasaanNya terhadap mereka dan ketinggian martabatNya karena sifat-sifatNYa yang agung lagi suci, “lagi Mahabesar” DzatNya dan Sifat-SifatNya. Dan di antara ketinggianNya adalah bahwa hukum (keputusan) Allah itu tinggi, jiwa tunduk kepadanya, hingga jiwa orang-orang yang menyombongkan diri dan kaum musyirikin sekalipun. Makna ini sudah sangat jelas dan inilah yang ditunjukkan oleh konteks ayat. Kemungkinan kedua, dhamir “hum” kembali kepada para malaikat. Sebab, Allah apabila berbicara melalui wahyu, maka didengar oleh para malaikat dan mereka tersentak ketakutan dan menyungkur sujud kepada Allah. Dan malaikat pertama yang mengangkat kepalanya adalah JIbril, lalu Allah menyampaikan wahyu yang dikehendakiNya kepadanya. Lalu apabila rasa ketakutan sudah hilang dari hati para malaikat, maka sebagian mereka menanyakan kepada sebagian yang lain tentang firman yang menyebabkan mereka tersentak itu, “Apa yang telah dikatakan oleh Rabb?” maka sebagiannya menjawab, “Perkataan yang haq.” Bisa jadi jawaban itu secara global, karena mereka telah mengetahui bahwa Dia tidak mengatakan kecuali yang haq, atau mereka mengatakan, “Dia berfirman begini dan begitu” untuk firman yang telah mereka dengar dariNYa. Dan yang demikian itu termasuk yang haq. Maka makna ayat di atas berdasarkan alternative ini adalah bahwa kaum musyrikin yang menyembah sembahan-sembahan selain Allah, yang telah kami uraikan kepada kalian tentang ketidakberdayaannya, kelemahannya dan ketidakmampuannya memberikan manfaat dari sudut mana pun, bagaimana mungkin mereka bisa berpaling dan menjauh dari ketulusan ibadah kepada Rabb yang Mahaagung, Mahatinggi lagi Mahabesar, yang karena keagungan dan kebesaranNya menciptakan sikap tunduk dan rasa takut para malaikat nan mulia lagi muqarrabin sampai pada kadar seperti itu, dan mereka semua mengakui bahwasanya Allah tidak mengatakan nkecuali yang haq. Lalu bagaimana kaum musyrikin bisa menyombongkan diri untuk beribadah kepada TUhan yang sedemikian keadaanNya dan keagungan kerajaan dan kekuasaanNYa? Maka Mahasuci Allah yang Mahatinggi lagi Mahabesar dari kesyirikan kaum musyrikin, dari kedustaan dan kebohongan mereka!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 23: Allah menjelaskan bahwa syafaat tidaklah bermanfaat di sisi-Nya kecuali bagi siapa yang telah di izinkan oleh Allah untuk memberikan syafaat. Syafaat adalah meminta ampunan atau karunia dari salah seorang yang lain. Dan sebagian dari kebesaran-Nya, jika Allah berbicara berkenaan dengan wahyu, maka para penghuni langit mendengarkan dengan seksama dengan rasa takut sampai-sampai mereka seperti pingsan, maka jika telah usai pembicaraan Allah tentang wahyu, mereka ketakutan dan bertanya satu sama lain : Apa yang dikatakan oleh Tuhan kalian berhubungan dengan syafaat ? Berkata para malaikat : Kebenaran, yaitu Allah mengizinkan syafaat bagi orang-orang yang beriman, adapun orang-orang yang kafir dan musyrik serta munafik, Allah tidak memberikan mereka izin. Ketahuilah bahwasanya Allah Maha Tinggi dzat-Nya dan berkuasa dengan setinggi-tingginya penguasaan dalam dzat dan sifat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan bantahan terhadap sangkaan mereka, bahwa sesembahan-ssembahan mereka dapat memberikan syafaat bagi mereka di sisi Allah Subhaanahu wa Ta'aala. Ayat ini menerangkan bahwa pemberian syafaat hanya dapat berlaku dengan izin Allah. Dengan demikian, semua ketergantungan kaum musyrik kepada tandingan-tandingan itu baik berupa manusia, pohon, patung, batu dan lainnya telah Allah putuskan dan telah Allah terangkan kebatilannya, telah Dia putuskan usulnya (dasar-dasarnya), karena orang musyrik, di mana yang dia seru dan dia sembah adalah selain Allah, tidaklah melakukannya kecuali karena mengharap manfaat darinya. Inilah yang membuat mereka berbuat syirk (yakni untuk memperoleh manfaat). Jika yang disembah selain Allah itu tidak berkuasa memberi manfaat, tidak menjadi pembantu bagi yang berkuasa memberi manfaat serta tidak mampu memberi syafaat tanpa izin-Nya, maka berdoa dan beribadah kepadanya merupakan kesesatan dalam akal dan batil dalam syara’. Bahkan bagi orang musyrik, yang awal harapan dan maksudnya adalah memperoleh manfaat, namun Allah terangkan kebatilannya dan ketidakadaan manfaat, dan Dia menerangkan di ayat lain bahaya yang demikian bagi penyembahnya. Dia juga menerangkan, bahwa pada hari Kiamat, mereka dengan sesembahannya saling mengingkari dan saling laknat melaknat, dan tempat mereka adalah neraka. Allah Subhaanahu wa Ta'aala berfirman, “Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.” (Terj. Al Ahqaaf: 6). Namun anehnya, orang musyrik tetap saja enggan tunduk kepada para rasul karena persangkaannya bahwa para rasul manusia, ia malah ridha tunduk menyembah dan berdoa kepada batu dan pohon, ia sombong dari berbuat ikhlas kepada Allah Yang Maha Pengasih dan malah ridha menyembah sesuatu yang bahayanya lebih dekat daripada manfaatnya serta menaati musuhnya yang sesungguhnya, yaitu setan. Firman Allah Ta’ala, “Sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata, \"Apakah yang telah difirmankan oleh Tuhanmu?\" Mereka menjawab, “(Perkataan) yang benar,” dan Dialah Yang Mahatinggi lagi Mahabesar.” Bisa jadi ayat ini berkenaan dengan kaum musyrik karena merekalah yang disebutkan dalam lafaz itu, sedangkan kaidah dalam hal dhamir (kata ganti nama) adalah kembali kepada yang lebih dekat, sehingga maknanya adalah, bahwa pada hari Kiamat, ketika rasa takut dihilangkan dari kaum musyrik lalu mereka ditanya saat akal mereka kembali sadar tentang keadaan mereka ketika di dunia serta tentang pendustaan mereka kepada kebenaran yang dibawa para rasul, lalu mereka mengakui bahwa yang mereka pegang (berupa kekafiran dan kesyirkkan) adalah batil, dan bahwa apa yang difirmankan Allah dan dikabarkan para rasul-Nya adalah hak. Ketika itu, tampak jelas bagi mereka apa yang mereka sembunyikan sebelumnya, dan mereka pun tahu bahwa yang benar adalah milik Allah dan mereka mengakui dosa-dosa mereka. Bisa juga maksudnya, bahwa ayat ini adalah berkenaan dengan para malaikat, yaitu ketika Allah Subhaanahu wa Ta'aala berfirman, lalu para malaikat mendengarnya, maka mereka langsung pingsan dan bersungkur sujud kepada Allah, kemudian malaikat yang pertama kali mengangkat kepalanya adalah malaikat Jibril, lalu Allah menyampaikan wahyu kepadanya sesuai yang Dia inginkan. Ketika rasa takut telah dihilangkan dari hati para malaikat, maka masing-masing mereka bertanya kepada yang lain tentang firman Allah Ta’ala yang tadi mereka pingsan ketika mendengarnya, mereka berkata, “Apa yang difirmankan Tuhanmu?” Sebagian mereka berkata kepada yang lain, “(Perkataan) yang benar.” Baik secara garis besar karena mereka tahu bahwa Allah tidaklah berkata kecuali yang benar dan bisa jadi sebagian mereka itu mengatakan, “Dia berfirman begini dan begitu.” Dan ini pun termasuk kebenaran. Dengan demikian maknanya adalah bahwa kaum musyrik yang menyembah selain Allah yang telah diterangkan kelemahannya dan kekurangannya, yang tidak bermanfaat dari berbagai sisi, bagaimana mereka sampai berpaling dari mengikhlaskan ibadah hanya kepada Allah Rabbul ‘alamin yang Mahatinggi lagi Mahabesar, di mana di antara keagungan-Nya adalah bahwa para malaikat yang mulia dan makhluk yang didekatkan sangat tunduk bahkan sampai pingsan ketika mendengar firman-Nya, dan mereka semua mengakui bahwa Dia tidaklah mengatakan kecuali yang hak (benar). Lalu mengapa kaum musyrik itu sombong dari beribadah kepada Tuhan yang seperti ini keadaanya, kerajaan dan kekuasaan-Nya begitu agung, maka Mahatinggi Allah dan Mahabesar Dia dari kesyirkkan orang-orang musyrik dan dari kedustaan mereka. Ayat ini menunjukkan bahwa Al Qur’an adalah firman Allah, bukan makhluk. Dengan zat-Nya di atas seluruh makhluk-Nya, Dia berkuasa kepada mereka dan tinggi kedudukan-Nya karena Dia memiliki sifat-sifat yang agung. Baik zat maupun sifat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 23",
    "description": "Dan syafaat, yakni pertolongan, di sisi-Nya hanya berguna bagi orang yang telah diizinkan-Nya untuk memberi dan memperoleh syafaat itu, seperti para malaikat, nabi, dan orang saleh. Sehingga apabila telah dihilangkan ketakutan dari hati mereka, yakni orang-orang yang akan diberi izin untuk memberi syafaat dan orang-orang yang akan mendapat syafaat, mereka yang akan mendapat syafaat berkata, 'apakah yang telah difirmankan dan ditetapkan oleh tuhanmu untuk kami'' mereka menja-wab, 'Allah memberi keputusan yang benar, ' dan dialah yang mahatinggi zat dan kedudukan-Nya, mahabesar keagungan dan kekuasaan-Nya (lihat juga: al-baqarah/2: 255, y'nus/10: 3, dan al-anbiy'/21: 28). 24. Usai menegaskan bahwa sembahan selain Allah tidak mampu mendatangkan manfaat apa pun kepada penyembahnya, lalu Allah berfirman, 'katakanlah, wahai nabi Muhammad kepada orang-orang musyrik, 'siapakah yang memberi rezeki kepadamu yang bersumber dari langit dan dari bumi'' katakanlah, wahai nabi Muhammad, 'Allah yang memberi rezeki. Dan sesungguhnya kami, orang beriman, atau kamu, wahai kaum musyrik, pasti salah satu dari kita berada dalam kebenaran dengan kedudukan yang tinggi atau terjerumus dalam kesesatan yang nyata de-ngan kedudukan yang sangat hina. ''."
  }
]