[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang-orang musyrik, “Siapa yang memberi kalian rizki dari langit dengan hujan dan dari bumi dengan tanaman, barang tambang dan lainnya?” mereka pasti akan mengakui bahwa dia adalah Allah. Namun bila mereka tidak mengakui, maka katakanlah kepada mereka, “Allah-lah yang memberi rizki. Dan sesungguhnya salah satu di antara kedua kubu, kami atau kalian, berada di atas hidayah yang kokoh dariNya atau di atas kesesatan yang nyata lagi terbenam di dalamnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Katakanlah -wahai Rasul- kepada kaum musyrikin, \"Siapa yang memberi kalian rezeki dari langit dengan menurunkan hujan dan dari bumi dengan menumbuhkan tanaman dan pepohonan yang menghasilkan buah-buahan bagi kalian?\" Katakanlah, \"Allah, Dia lah yang memberi kalian rezeki darinya.\" Siapa di antara kita -wahai kaum musyrikin-, kami atau kalian yang berada di atas hidayah atau kesesatan yang nyata dari jalan yang benar, salah seorang dari kita pasti demikian dan bahwa orang-orang yang tersesat adalah orang-orang yang musyrik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Katakanlah kepada orang-orang musyrik: “Siapa yang memberi kalian rezeki dan karunia dari langit dan bumi? Dia adalah Allah semata, adapun berhala-berhala kalian itu tidak memiliki apapun di alam semesta ini. Hanya kami atau kalian yang berada di atas petunjuk, atau dalam kesesatan; sebab petunjuk hanya satu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قُلْ مَن يَرْزُقُكُم مِّنَ السَّمٰوٰتِ وَالْأَرْضِ ۖ (Katakanlah: “Siapakan yang memberi rezeki kepadamu dari langit dan dari bumi?”) Sebab tuhan-tuhan mereka tidak memiliki rezeki walau sebesar biji sawi. Dan rezeki dari langit adalah hujan. Sedangkan rezeki dari bumi adalah tanaman, barang-barang tambang, dan lain sebagainya. قُلِ اللهُ ۖ( Katakanlah: “Allah”) Yakni Allah-lah yang memberi rezeki dari langit dan bumi. وَإِنَّآ أَوْ إِيَّاكُمْ لَعَلَىٰ هُدًى أَوْ فِى ضَلٰلٍ مُّبِينٍ(dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata) Yakni satu golongan berada dalam petunjuk dan golongan lainnya berada dalam kesesatan. Dan sudah menjadi hal yang diketahui bahwa orang yang menyembah Dzat yang menciptakan, memberi rezeki, memberi manfaat dan mudharat adalah orang yang berada dalam petunjuk. Sedangkan orang yang menyembah dzat yang tidak mampu menciptakan, memberi rezeki, memberi manfaat dan mudharat adalah orang yang berada dalam kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Wahai Nabi, katakanlah kepada orang-orang musyrik: \"Siapakah Dzat yang memberi rejeki kalian dari langit dengan (menurunkan) hujan dan di bumi dengan (menyediakan) tanaman, buah, logam dan hal lainnya yang serupa?\" Katakanlah: \"Allah, Dialah Dzat yang Maha Pemberi rejeki. Sesungguhnya Aku dan kalian wahai orang-orang musyrik, yaitu salah satu dari dua golongan yang pasti bisa berada dalam hidayah atau kesesatan yang nyata. \"Aw\" berfungsi sebagai athaf yang masih mengandung kesamaran. Ini adalah percakapan ringan dengan orang-orang kafir, barang kali mereka mau kembali dari sifat keras kepala mereka dan ini terjadi setelah adanya penjelasan tentang orang yang diberi petunjuk dan orang yang tersesat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang menganugerahkan rezeki kepada kalian dari langit dan bumi” Katakanlah,“Allah” Sesungguhnya kami atau kalian benar-benar berada di dalam petunjuk atau dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Allah memerintah nabiNya, Muhammad, untuk mengatakan kepada orang yang mempersekutukan Allah dan menanyakan kepadanya tentang kebenaran syiriknya, “Siapakah yang memberi rizki kepadamu dari langit dan bumi?” sebab mereka terpaksa harus mengakui bahwasanya Dia adalah Allah. Dan jika mereka tidak mau mengakui, maka “Katakanlah, ‘Allah’,” niscaya kamu tidak akan menjumpai orang yang menolak perkataan ini. Kalau sudah terbukti bahwa Allah semata yang memberi kalian rizki dari langit dan bumi, dan yang menurunkan hujan untuk kalian serta menumbuhkan berbagai tanaman, memancarkan sungai untuk kalian dan menimbulkan buah-buahan dari berbagai pohon dan menciptakan berbagai hewan semuanya untuk kalian, untuk kepentingan kalian dan rizki kalian, lalu kenapa kalian menyembah sesuatu yang sama sekali tidak memberikan rizki kepada kalian dan tidak memberikan satu manfaat pun kepada kalian? Dan FirmanNya, “Dan sesungguhnya kami atau kamu (wahai orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata,” yakni salah satu dari dua golongan dari kami dan kalian ada yang berpegang teguh pada petunjuk dalam keadaan mengunggulinya, atau ada di dalam kesesatan yang nyata dalam keadaan tenggelam di dalamnya. Dan perkataan ini diucapkan oleh orang yang kebenaran menjadi jelas baginya dan yang benar menjadi terang, dan ia menegaskan terhadap kebenaran yang dianutnya dan terhadap kepalsuan apa yang dianut oleh musuhnya. Maksudnya, kami telah menjelaskan dalil-dalil yang sangat jelas bagi kami dan kalian, yang dengannya dapat diketahui dengan seyakin-yakinnya, tidak ada keraguan lagi padanya, siapa yang benar dari kita dan siapa pembuat kepalsuan, siapa yang mendapat petunjuk dan siapa yang tersesat, sehingga penentuan sudah tidak berguna lagi sesudahnya. Sebab, jika kamu membandingkan antara orang yang mengajak untuk beribadah kepada Allah, Sang Pencipta semua makhluk, Yang mengaturnya dengan berbagai bentuk otoritasNya, Yang mencurahkan seluruh kenikmatan, Yang memberi rizki dan melimpahkan kepada mereka segala bentuk nikmat dan mencegah dari mereka segala bentuk bencana, Yang kepunyaanNya-lah segala puja dan puji, kerajaan semuanya, dan setiap orang dari malaikat dan selain mereka semuanya tunduk kepada kebesaranNya, menghinakan diri di hdapan keagunganNYa, setiap pemberi syafaat takut kepadaNya, tiada seorang pun dari mereka yang dapat memberi syafaat di sisiNya kecuali dengan izin dariNya, Yang Mahatinggi lagi Mahabesar dalam Dzat, sifat-sifat dan segala perbuatanNYa, yang milikNya-lah segala kesempurnaan, segala kemuliaan, segala keindahan dan segala puji, puja dan sanjungan. Orang itu mengajak kepada Tuhan yang sedemikian rupa keadaanNYa, dan kepada ketulusan beramal kepadaNya, melarang beribadah kepada selainNYa, (bandingkan) dengan orang-orang yang mendekatkan diri kepada berhala, patung dan kuburan yang sama sekali tidak menciptakan, tidak memberi rizki, tidak dapat menyelamatkan dirinya dan diri orang yang menyembahnya dan tidak pula dapat menimpakan bahaya, tidak dapat mematikan, menghidupkan dan membangkitkan, bahkan itu semua adalah benda-benda mati yang tidak berakal, tidak mendengar seruan para penyembahnya, dan kalau seandainya dia mendengar pun, niscaya tidak akan dapat mengabulkannya untuk mereka, sedangkan di Hari Kiamat kelak mereka mengingkari kesyirikan mereka dan berlepas diri dari mereka serta saling mengutuk di antara mereka. Mereka sama sekali tidak mempunyai bagian sedikit pun dari kekuasaan, tidak memiliki persekutuan padanya, tidak pula memiliki bantuan di dalamnya, dan tidak memiliki hak memberikan syafaat secara independen tanpa campur tangan Allah. Lalu ia menyeru (berdoa) kepada orang yang sedemikian ini sifatnya dan mendekatkan diri kepadanya sebisa mungkin dan memusuhi orang yang menuluskan kepatuhan hanya kepada Allah semata serta menyatakan dusta para utusan Allah yang membawa syariat dengan ikhlas semata karena Allah, maka akan menjadi jelas bagimu golongan yang mana yang mendapat petunjuk dan yang tersesat, yang celaka dan yang berbahagia; dan kamu tidak perlu diberi tahu tentang hal itu, karena deskripsi keadaan sudah lebih jelas daripada ungkapan lisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 24: Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Siapa yang menurunkan rezeki kepada kalian dari langit dan mengeluarkan (sesuatu) dari bumi ?! Kemudian mereka menjawab dengan jawaban yang tidak dapat mengingkarinya dalam hati-hati mereka : Sesungguhnya yang memberikan rezeki adalah Allah. Ketahuilah wahai kaum, salah satu dari kami berada dalam petunjuk, dan yang lain berada dalam kubangan kesesatan yang nyata, maka siapakah yang berkuasa memberikan rezeki secara benar ?! Atau adakah yang selain-Nya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan Nabi-Nya Muhammad shallallahu 'alaihi wa sallam berkata kepada orang-orang yang menyekutukan Allah dan bertanya tentang alasan kemusyrikannya. Seperti hujan. Seperti tanaman dan tumbuhan. Mereka tentu akan mengatakan Allah, dan kalau pun mereka tidak mengatakannya tidak ada jawaban selain itu. Jika telah jelas, bahwa Allah saja yang memberikan rezeki kepada kita dari langit dan dari bumi maka mengapa yang disembah malah selain-Nya yang tidak memberikan rezeki dan tidak memberikan manfaat apa-apa. Ini merupakan kelembutan dalam berdakwah. Ucapan ini diucapkan dari orang yang telah jelas kebenaran baginya dan dapat memastikan kebenaran yang dipegang olehnya, sedangkan musuhnya di atas kebatilan. Maksud ayat ini adalah, bahwa kami telah menerangkan dalil-dalil yang ada pada kami dan ada pada kamu di mana dengannya dapat diketahui secara yakin siapakah yang hak dan siapa yang batil, siapa yang mendapatkan petunjuk dan siapa yang tersesat? Sehingga menentukan siapa yang benar sudah tidak ada faedahnya lagi. Hal itu, karena jika anda membandingkan antara orang yang mengajak menyembah Allah yang mencipta semua makhluk, yang mengaruniakan berbagai nikmat dan menghindarkan berbagai bencana yang segala puji bagi-Nya dan kerajaan milik-Nya, yang berkuasa memberikan manfaat dan menghindarkan bahaya, yang mampu menghidupkan dan mematikan dengan orang yang mendekatkan diri kepada patung dan berhala atau kuburan yang tidak menciptakan dan memberikan rezeki, tidak berkuasa memberikan manfaat bagi dirinya apalagi bagi yang menyembahnya, tidak mampu menghidupkan dan mematikan, yang tidak memiliki bagian kekuasaan di alam semesta dan tidak memiliki peran apa-apa, yang tidak dapat dapat menolong dan memberikan syafaat, maka siapakah yang mendapatkan petunjuk dan siapakah yang tersesat, siapakah yang berbahagia dan siapakah yang sengsara? Tidak perlu dijelaskan siapa yang mendapat petunjuk dan bahagia, karena keadaannya lebih jelas daripada sekedar diucapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 24",
    "description": "Usai menegaskan bahwa sembahan selain Allah tidak mampu mendatangkan manfaat apa pun kepada penyembahnya, lalu Allah berfirman, 'katakanlah, wahai nabi Muhammad kepada orang-orang musyrik, 'siapakah yang memberi rezeki kepadamu yang bersumber dari langit dan dari bumi'' katakanlah, wahai nabi Muhammad, 'Allah yang memberi rezeki. Dan sesungguhnya kami, orang beriman, atau kamu, wahai kaum musyrik, pasti salah satu dari kita berada dalam kebenaran dengan kedudukan yang tinggi atau terjerumus dalam kesesatan yang nyata de-ngan kedudukan yang sangat hina. ''25. Katakanlah, wahai nabi Muhammad, 'pada hari kiamat nanti kamu tidak akan dimintai tanggung jawab atas apa yang kami kerjakan jika kamu menganggap kami telah berbuat dosa karena beriman kepada Allah dan rasul-Nya, dan kami juga tidak akan dimintai tanggung jawab atas apa yang kamu kerjakan, yakni dosa kalian akibat durhaka kepada Allah. '(lihat juga: y'nus/10: 41)."
  }
]