[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Kalian tidak bertanggung jawab atas dosa-dosa kami dan kami juga tidak bertanggung jawab atas perbuatan-perbuatan kalian, karena kami berlepasdiri dari kalian dan kekufuran kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Katakanlah kepada mereka -wahai Rasul-, “Kalian tidak ditanya tentang dosa-dosa yang kami lakukan, kami juga tidak ditanya tentang apa yang kalian perbuat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Katakanlah kepada orang-orang musyrik: “Kalian tidak akan ditanya tentang perbuatan dan dosa kami, dan kami juga tidak akan ditanya tentang perbuatan kalian; sebab setiap manusia akan ditanya tentang dirinya sendiri dan amalannya.” Katakanlah kepada mereka: “Tuhan kami akan mengumpulkan kami dengan kalian pada hari kiamat, kemudian Dia akan memberi keputusan yang adil di antara kita. Allah memberi keputusan antara hamba-hamba-Nya dengan benar; Dia Maha Mengetahui siapa yang baik dan yang jahat, tidak ada dari mereka yang tersembunyi dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قُل لَّا تُسْـَٔلُونَ عَمَّآ أَجْرَمْنَا (Katakanlah: “Kamu tidak akan ditanya (bertanggung jawab) tentang dosa yang kami perbuat) Yakni jika ibadah dan ketaatan kami bagi Allah adalah kejahatan maka kalian bukanlah orang yang bertanggung jawab atas kami. وَلَا نُسْـَٔلُ عَمَّا تَعْمَلُونَ(dan kami tidak akan ditanya (pula) tentang apa yang kamu perbuat) Yakni tidak akan menimpa kami mudharat akibat kekafiran dan keengganan kalian untuk menjawab seruanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai nabi, katakanlah kepada mereka: \"Pada hari kiamat, kamu tidak ditanya tentang dosa yang kami perbuat. Kami juga tidak bertanya tentang apa yang kalian perbuat berupa kekufuran dan kemaksiatan. Ini adalah penyampaian prinsip tanggung jwab pribadi dengan melakukan percakapan yang lunak untuk mengurangi sifat keras kepala orang-orang musyrik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Kalian tidak akan dimintai pertanggung jawaban atas dosa yang kami kerjakan} dosa yang kami kerjakan {dan kami tidak akan dimintai pertanggung jawaban atas apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Katakanlah” kepada mereka, “kamu tidak akan ditanya tentang dosa yang kita perbuat dan kami tidak akan ditanya pula tentang apa yang kamu perbuat,” maksudnya, masing-masing kita dan kalian menanggung perbuatannya masing-masing, kalian tidak akan diminta pertanggung jawaban tentang perbuatan kami dan dosa-dosa kami kalau kami melakukannya, dan kami tidak akan diminta pertanggung jawaban tentang perbuatan kalian, maka hendaklah tujuan kami dan kalian adalah mencari yang benar dan menempuh jalan terbuka (adil dan objektif), dan tinggalkanlah apa yang telah (terlanjur) kita lakukan dan jangan menjadi penghalang bagi kalian untuk mengikuti al haq (kebenaran). Sebab, sesungguhnya hukum-hukum yang diberlakukan di dunia ini hanya dalam hal-hal yang Nampak, di situ kebenaran diikuti dan kebatilan dijauhi. Adapun amal-amal perbuatan, maka ia mempunyai negeri yang lain di mana di dalamnya Sang Mahabijaksana memberikan keputusan, Sang Mahaadil menetapkan keputusan di antara orang-orang yang berselisih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 25: Katakan kepada mereka wahai Nabi Allah : Setiap dari kami memiliki amalan yang akan ditanya Allah nanti : Dan kalian tidak akan ditanya tentang amalan-amalan kami dan tidak juga atas dosa-dosa kami serta kejahatan kami (jika memang hal tersebut ada pada kami), kami juga tidak tidak ditanya tentang amalan kalian, tidak juga menghukumi kalian dengannya, karena sesungguhnya setiap manusia dihukumi berdasarkan apa yang telah mereka perbuat dari dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni masng-masing dari kami dan kamu untuknya amalnya, kamu tidak dimintai tanggung jawab atas apa yang kami kerjakan, dan kami tidak dimintai tanggung jawab atas apa yang kamu kerjakan. Oleh karena itu, hendaknya tujuan kami dan kamu adalah mencari kebenaran dan menempuh jalan yang adil, dan jangan sampai menghalangi kamu dari mengikuti yang hak, karena hukum-hukum dunia berjalan sesuai yang tampak, yang diikuti di sana adalah yang hak dan yang dijauhi adalah yang batil. Adapun urusan amal, maka ada tempat lagi yang lain, di mana yang memutuskannya adalah hakim yang sebaik-baiknya dan seadil-adilnya, yaitu Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 25",
    "description": "Katakanlah, wahai nabi Muhammad, 'pada hari kiamat nanti kamu tidak akan dimintai tanggung jawab atas apa yang kami kerjakan jika kamu menganggap kami telah berbuat dosa karena beriman kepada Allah dan rasul-Nya, dan kami juga tidak akan dimintai tanggung jawab atas apa yang kamu kerjakan, yakni dosa kalian akibat durhaka kepada Allah. '(lihat juga: y'nus/10: 41)26. Katakanlah, wahai nabi Muhammad, 'pada hari kiamat, tuhan kita, Allah, akan mengumpulkan kita semua, kemudian dia memberi keputusan antara kita dengan benar dan adil. Dan dia yang maha pemberi keputusan secara adil, maha mengetahui keputusan yang tepat. '."
  }
]