[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah, “Tuhan kita akan mempertemukan antara kami dengan kalian di Hari Kiamat, kemudian menetapkan keputusan diantara kita dengan adil, Dia-lah yang Maha Memberi keputusan yang menetapkan hokum di antara makhlukNya, mengetahui apa yang seharusnya diputuskan dengannya, danmengetahui keadaan makhluk-Nya, tiada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Katakanlah kepada mereka -wahai Rasul-, “Allah akan mengumpulkan antara kami dengan kalian pada hari Kiamat, kemudian Allah memberikan keputusan-Nya di antara kita dengan keadilan. Allah menjelaskan siapa yang benar dan siapa yang salah, Dia lah Hakim yang menetapkan hukum dengan keadilan, maha mengetahui apa yang Dia putuskan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا (Katakanlah: “Tuhan kita akan mengumpulkan kita semua) Pada hari kiamat. ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّ(kemudian Dia memberi keputusan antara kita dengan benar) Yakni memberi keputusan antara kita dengan kebenaran, yaitu dengan memberi pahala orang yang taat dan menyiksa orang yang bermaksiat. وَهُوَ الْفَتَّاحُ(Dan Dialah Maha Pemberi keputusan) Yakni pemberi keputusan dengan benar dan tepat. الْعَلِيمُ (lagi Maha Mengetahui) Yakni mengetahui maslahat dari keputusan dan ketetapan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Katakanlah kepada mereka: \"Tuhan kita akan mengumpulkan kita, kemudian menentukan keputusan antara kita dengan benar dan adil. Allah SWT adalah Dzat yang Maha Bijaksana, Maha Adil dan Maha Mengetahui setiap sesuatu dan kondisi-kondisi hukum dan keputusan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Tuhan kita akan mengumpulkan kita, kemudian memutuskan} memberi keputusan {di antara kita dengan benar} adil {Dialah Dzat Yang Maha Pemberi keputusan} Dzat Yang Maha Pemberi keputusan lagi Maha Adil {lagi Maha Mengetahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Maka dari itu Dia berfirman, “Katakanlah, ‘Rabb kita akan mengumpulkan kita semua’,” maksudnya, Dia akan memberikan keputusan di antara kita, yang dengannya akan dapat dibedakan mana yang benar (jujur) dan mana yang dusta; mana yang berhak mendapat pahala dan mana yang berhak diazab; dan Dia adalah sebaik-baik pemberi keputusan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 26: Katakan kepada mereka wahai Nabi Allah : Sesungguhnya Allah akan mengumpulkan kami semua pada hari kiamat, akan menghakimi kami semua dengan adil, akan nampak mana yang jujur yang berada di atas kebenaran, dan siapa yang dusta dengan kesesatan, Dialah Allah Al Fattah yang menghakimi dan memutuskan dengan kebenaran, yang Maha Mengetahui dengan rinci segala urusan, yang tidak tersembunyi segala sesuatu meskipun sebesar biji dzarrah di langit maupun di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada mereka. Pada hari Kiamat. Yakni Dia akan memberikan keputusan di antara kami dengan putusan yang memperjelas siapa yang benar dan siapa yang dusta, siapa yang berhak mendapat pahala dan siapa yang berhak mendapatkan siksa, dan Dia akan memasukkan yang benar ke dalam surga dan memasukkan yang salah ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 26",
    "description": "Katakanlah, wahai nabi Muhammad, 'pada hari kiamat, tuhan kita, Allah, akan mengumpulkan kita semua, kemudian dia memberi keputusan antara kita dengan benar dan adil. Dan dia yang maha pemberi keputusan secara adil, maha mengetahui keputusan yang tepat. '27. Katakanlah, wahai nabi Muhammad, 'perlihatkanlah kepadaku sembahan-sembahan yang kamu hubungkan dengan dia, yakni kamu anggap sebagai tuhan dan kamu jadikan sebagai sekutu-sekutu-Nya. Apa yang bisa mereka perbuat' tidak ada! tidak mungkin Allah dipersekutukan dengan apa pun! sebenarnya dialah Allah yang mahaperkasa, mahabijaksana. '."
  }
]