[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Tunjukkanlah kepadaku berdasarkan hujjah dan dalil, apa-apa yang kalian samakan dengan Allah lalu kalian menjadikan mereka sekutu-sekutu bagi Allah dalam ibadah, adakah mereka menciptakan sesuatu?” perkaranya tidak sebagaimana yang mereka kira, karna hanya Allah yang berhak disembah dengan haq, tidak ada sekutu bagiNya. Dia Mahaperkasa dalam membalas orang-orang yang menyekutukanNya, juga Mahabijaksana dalam firman-firman, perbuatan-perbuatan dan PengaturanNya terhadap makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Katakanlah kepada mereka -wahai Rasul-, “Tunjukkanlah kepadaku orang-orang yang kalian angkat sebagai sekutu-sekutu bagi Allah yang kalian persekutukan mereka dengan Allah dalam ibadah. Dan demikian, perkaranya tidak sebagaimana yang kalian bayangkan bahwa Allah memiliki sekutu-sekutu, karena Allah adalah Maha Perkasa yang tidak sesuatu pun yang bisa mengalahkan-Nya, Maha Bijaksana dalam penciptaan, takdir dan pengaturan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Katakanlah: “Perlihatkanlah tuhan-tuhan yang kalian anggap sebagai tuhan-tuhan selain Allah; agar aku dapat melihat sifat apa dari mereka yang dapat aku jadikan mereka sebagai sekutu Allah. Allah Maha Kuasa, tidak ada yang dapat menghalangi-Nya, Dia Maha Perkasa dan Maha Bijaksana dalam ketetapan dan hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. قُلْ أَرُونِىَ الَّذِينَ أَلْحَقْتُم بِهِۦ شُرَكَآءَ ۖ (Katakanlah: “Perlihatkanlah kepadaku sembah-sembahan yang kamu hubungkan dengan Dia sebagai sekutu-sekutu-Nya) Yakni tunjukkanlah tuhan-tuhan yang kalian jadikan sekutu-sekutu Allah agar aku dapat melihat mereka dan melihat kemampuan mereka. كَلَّا ۚ بَلْ هُوَ اللهُ الْعَزِيزُ الْحَكِيمُ(sekali-kali tidak mungkin! Sebenarnya Dialah Allah Yang Maha Perkasa lagi Maha Bijaksana) Yakni berhentilah mengatakan bahwa Allah memiliki sekutu, sebab Tuhan yang Maha Esa adalah Allah yang Maha Perkasa dan Maha Bijaksana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Katakanlah kepada mereka: \"Perlihatkan kepadaku sembahan-sembahan yang kalian jadikan sekutu-sekutu Allah. Apakah mereka berkuasa atas sesuatu? Tidak mungkin, hindarilah dan janganlah mengklaim mereka sebagai sekutu. Hanya Allahlah yang menjadi Tuhan yang Maha Kuat, Maha Perkasa, dan Maha Menang, Pemilik kebijaksanaan luar biasa dalam mengatur makhlukNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Perlihatkanlah kepadaku mereka yang kalian sertakan denganNya sebagai sekutu-sekutu} kalian sertakan mereka dengan Allah sebagai sekutu untuk disembah bersamaNya, apakah mereka (bisa) menciptakan dan memberi rezeki {Tidak sama, tetapi Dialah Allah Yang Maha perkasa lagi Maha bijaksana”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Katakanlah” kepada mereka, wahai rasul, dan wahai orang yang mewakilimu, “Perlihatkanlah kepadaku sembahan-sembahan yang kamu hubungkan denganNya sebagai sekutu-sekutu,” maksudnya, di mana mereka? Di mana jalan untuk mengenal mereka? Apakah mereka ada di bumi atau di langit? Karena sesungguhnya Allah Yang Maha Mengetahui hal-hal yang ghaib dan nyata telah menginformasikan kepada kami, bahwa di dalam wujud (alam semesta ini) ia sama sekali tidak mempunyai seorang sekutu pun, \"Dan mereka menyembah selain daripada Allah apa yang tidak dapat mendatangkan kemudaratan kepada mereka dan tidak (pula) kemanfaatan, dan mereka berkata: \"Mereka itu adalah pemberi syafaat kepada kami di sisi Allah\". Katakanlah: \"Apakah kamu mengabarkan kepada Allah apa yang tidak diketahui-Nya baik di langit dan tidak (pula) di bumi?\" Maha Suci Allah dan Maha Tinggi dari apa yang mereka mempersekutukan (itu).\" (Yunus:18) \"Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\" (Yunus:66). Demikian pula orang-orang istimewa dari makhlukNya, yaitu para nabi dan para rasul, mereka tidak mengetahui adanya sekutu bagiNya. Maka, wahai sekalian kaum musyrikin, perlihatkanlah kepadaku sembahan-sembahan yang kalian hubungkan dengan Allah sebagai sekutu-sekutuNYa menurut klaim palsu kalian! Permintaan ini tidak mungkin mereka penuhi, maka dari itu Allah berfirman, “SEkali-kali tidak mungkin.” Maksudnya, Allah sama sekali tidak mempunyai sekutu, tandingan dan lawan. “Sebenarnya Dia-lah Allah” yang tidak ada yang berhak disembah dan diibadahi, kecuali DIa “yang Mahaperkasa” yang mengalahkan segala sesuatu. Maka segala sesuatu, semuanya dikendalikan, dikalahkan dan ditundukkanNYa. “Lagi Mahabijaksana,” yang menciptakan dengan sangat rapid an membuat indah apa yang diciptakanNYa, dan sangat baik apa yang disyariatkanNya. Kalaupun tidak ada dalam hikmah syariatnya kecuali hanya (pertama) perintah mengesakanNya dan mengikhlaskan kepatuhan (agama) hanya kepadaNya dalam keadaan mencintai hal ini dan menjadikannya sebagai jalan keselamatan, dan (kedua) larangan berbuat syirik dan mengambil sembahan-sembahan selain Dia, serta menjadikan hal ini sebagai jalan kesengsaraan dan kebinasaan, maka hal ini sudah sangat cukup untuk menjadi argument (bukti) atas kesempurnaan hikmah (kebijaksanaan) NYa; lalu bagaimana dengan keadaan syariat di mana seluruh yang Dia perintahkan dan apa yang Dia larang mencakup hikmah?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 27: Katakan kepada mereka : Perlihatkan kepadaku yang mereka kalian jadikan sekutu selain Allah, yang kalian memalingkan ibadah dari-Nya, agar aku dapat melihat dengan apa yang pantas mereka untuk di ibadahi ? Tidak mungkin wahai orang-orang musyrik, kalian dapat mendatangkan sesembahan-sesembahan kalian, karena Allah tidak memiliki sekutu (disekutukan), tidak juga di ibadahi dengan benar kecuali hanya Dia saja, Dia lah Allah yang Maha Kuat, Gagah yang kuasa atas segala sesuatu, Dialah Al Hakim dalam memenuhu kebutuhan makhluk-Nya dan urusan-urusan hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni di mana mereka? Apakah mereka di bumi atau di langit, karena Tuhan yang mengetahui yang gaib dan yang tampak telah memberitahukan kepada kita bahwa Dia tidak memiliki sekutu di alam semesta. Allah Subhaanahu wa Ta'aala berfirman, “Dan mereka menyembah selain Allah apa yang tidak dapat mendatangkan kemudharatan kepada mereka dan tidak (pula) kemanfaatan, dan mereka berkata, \"Mereka itu adalah pemberi syafa'at kepada kami di sisi Allah.” Katakanlah, \"Apakah kamu mengabarkan kepada Allah apa yang tidak diketahui-Nya baik di langit dan tidak (pula) dibumi?\" Mahasuci Allah dan Mahatinggi dari apa yang mereka mempersekutukan (itu).” (Terj. Yunus: 18) Bahkan para nabi dan rasul yang merupakan manusia pilihan tidak mengetahui adanya sekutu bagi-Nya. Oleh karena itu, wahai kaum musyrik perlihatkanlah kepadaku sembahan-sembahan yang kamu hubungkan dengan Dia sebagai sekutu-sekutu-Nya dengan sangkaanmu yang batil. Pertanyaan ini tentu tidak bisa mereka jawab. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Tidak mungkin”, yakni tidak mungkin ada sekutu bagi Allah dan tidak ada tandingan bagi-Nya. Bahkan Dialah Allah yang tidak ada yang berhak disembah selain Dia, Dia Mahaperkasa, Dia berkuasa terhadap segala sesuatu, sedangkan selain-Nya dikuasai dan ditundukkan, dan Dia Mahabijaksana, di mana Dia merapikan ciptaan-Nya dan memperbagus syariat-Nya. Kalau pun tidak ada dalam hikmah dan syariat-Nya kecuali Dia memerintahkan tauhid dan mengikhlaskan ibadah kepada-Nya, Dia mencintai hal itu dan menjadikannya sebagai jalan selamat, serta melarang syirk dan melarang mengadakan tandingan bagi-Nya serta menjadikannya sebagai jalan kesengsaraan dan kebinasaan, maka yang demikian sudah cukup sebagai bukti sempurnanya kebijaksanaan, lalu bagaimana dengan semua perintah dan larangan yang mengandung hikmah? Sebagai penolakan terhadap keyakinan mereka bahwa Allah Subhaanahu wa Ta'aala mempunyai sekutu. Yang berkuasa terhadap urusan-Nya. Dalam mengatur makhluk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 27",
    "description": "Katakanlah, wahai nabi Muhammad, 'perlihatkanlah kepadaku sembahan-sembahan yang kamu hubungkan dengan dia, yakni kamu anggap sebagai tuhan dan kamu jadikan sebagai sekutu-sekutu-Nya. Apa yang bisa mereka perbuat' tidak ada! tidak mungkin Allah dipersekutukan dengan apa pun! sebenarnya dialah Allah yang mahaperkasa, mahabijaksana. '28. Allah adalah tuhan yang maha esa. Dia tidak layak dipersekutukan dengan sesuatu pun. Dia mengutus nabi Muhammad sebagai rahmat bagi seluruh alam. 'dan kami tidak mengutus engkau, wahai nabi Muhammad, melainkan kepada semua umat manusia sampai hari kiamat sebagai pembawa berita gembira bahwa orang yang taat akan memperoleh kebahagiaan, dan sebagai pemberi peringatan bagi pendurhaka tentang kesengsaraan jika mereka enggan bertobat, tetapi kebanyakan manusia tidak mengetahui sehingga tetap enggan mengimani risalah nabi Muhammad. (lihat juga: al-a'r'f/7: 158 dan y'suf/12: 103)."
  }
]