[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak mengutusmu (wahai Rasul) kecuali kepada manusia seluruhnya, sebagai pemberi kabar gembira dengan pahala dari Allah dan sebagai penyampai peringatan akan hukumanNya, namun kebanyakan manusia tidak mengetahui kebenaran, sehingga mereka berpaling darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kami tidak mengutusmu -wahai Rasul- kecuali kepada manusia seluruhnya untuk menyampaikan kabar gembira kepada orang-orang yang bertakwa bahwa mereka akan mendapatkan Surga, dan memperingatkan orang-orang kafir serta para pendosa bahwa mereka akan mendapatkan siksa Neraka, akan tetapi kebanyakan manusia tidak mengetahui hal itu, seandainya mereka mengetahui niscaya mereka tidak mendustakanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Kami tidak mengutusmu melainkan kepada seluruh manusia, sebagai pemberi kabar gembira berupa pahala yang besar bagi orang yang taat, dan pemberi peringatan berupa siksaan yang pedih bagi orang yang menentang. Akan tetapi kebanyakan manusia tidak mengerti hakikat risalah dan tugas rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَمَآ أَرْسَلْنٰكَ إِلَّا كَآفَّةً لِّلنَّاسِ (Dan Kami tidak mengutus kamu, melainkan kepada umat manusia seluruhnya) Yakni Kami tidak mengutusmu melainkan kepada seluruh manusia, baik itu orang Arab maupun selainnya. بَشِيرًا وَنَذِيرًا(sebagai pembawa berita gembira dan sebagai pemberi peringatan) Yakni memberi kabar gembira bagi mereka berupa surga dan memberi peringatan mereka dari neraka. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ(tetapi kebanyakan manusia tiada mengetahui) Yakni tidak mengetahui apa yang ada di sisi Allah dan manfaat bagi mereka pada pengutusan rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan Kami tidak mengutusmu wahai nabi melainkan untuk seluruh manusia, banga Arab dan bangsa Asing sebagai pemberi kabar gembira tentang surga kepada orang yang menaatimu dan pemberi peringatan tentang orang neraka kepada orang yang berbuat maksiat kepadamu. Namun kebanyakan manusia tidak mengetahui hal itu. Apa yang di sisi Allah adalah kemanfaatan dan apa yang ada dimiliki para rasul adalah kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutusmu, kecuali kepada seluruh manusia sebagai pembawa kabar gembira dan pemberi peringatan. Akan tetapi kebanyakan manusia tidak mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah memberitakan bahwasanya tidaklah Dia mengutus RasulNya, Muhammad melainkan agar menyampaikan berita gembira kepada seluruh manusia tentang pahala dari Allah dan menyampaikan kepada mereka amal perbuatan yang dapat mengantarkan kepadanya dan memberi peringatan akan azab Allah, lalu mengabarkan tentang amal yang mengantarkan kepadanya. Jadi, kamu sama sekali tidak mempunyai campur tangan dalam urusan tersebut; dan semua yang diusulkan kepadamu oleh kaum yang mendustakan dan keras kepala bukanlah tugasmu. Itu semua ada di Tangan Allah, “tetapi kebanyakan manusia tiada mengetahui,” maksudnya mereka sama sekali tidak mempunyai ilmu yang shahih, malah mereka sebenarnya adalah orang-orang bodoh atau orang-orang yang keras kepala yang tidak mau mengamalkan ilmunya, sehingga seakan-akan mereka tidak mempunyai ilmu. Dan di antara tanda mereka tidak mempunyai ilmu adalah Allah menjadikan mereka tidak memperoleh jawaban dari apa yang mereka minta (berupa usulan) kepada Rasul sebagai sesuatau yang mengharuskan mereka untuk menolak dakwahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 28: Allah mengabarkan bahwa mengutus Muhammad ﷺ bagi seluruh manusia agar mengabarkan akan tauhid dan balasan dari Allah, dan agar memperingatkan mereka dari kesyirikan dan adzab Allah, akan tetapi kebanyakan manusia tidak mengetahui ilmu yang benar bahwasanya Allah mengutus Rasulullah ﷺ bagi jin dan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala tidaklah mengutus Rasul-Nya kecuali tugasnya untuk menyampaikan berita gembira kepada semua manusia dengan pahala Allah dan memberitahukan amal yang yang dapat mendatangkan pahala itu serta memperingatkan mereka dengan azab Allah dan memberitahukan amal yang mendatangkan azab itu, dan Beliau tidak memiliki kekuasaan apa-apa. Oleh karena itu, usulan (didatangkan ayat atau mukijizat) yang diusulkan orang-orang yang mendustakan bukanlah urusan Beliau, bahkan hal itu ada di Tangan Allah. Bagi orang-orang mukmin dengan surga. Bagi orang-orang kafir dengan neraka. Kebanyakan mereka tidak memiliki ilmu yang benar, keadaan mereka bisa sebagai sebagai orang yang jahil (bodoh) atau membangkang. Termasuk yang menunjukkan tidak adanya ilmu pada mereka adalah ketika usulan mereka tidak dipenuhi, akhirnya mereka menolak dakwah Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 28",
    "description": "Allah adalah tuhan yang maha esa. Dia tidak layak dipersekutukan dengan sesuatu pun. Dia mengutus nabi Muhammad sebagai rahmat bagi seluruh alam. 'dan kami tidak mengutus engkau, wahai nabi Muhammad, melainkan kepada semua umat manusia sampai hari kiamat sebagai pembawa berita gembira bahwa orang yang taat akan memperoleh kebahagiaan, dan sebagai pemberi peringatan bagi pendurhaka tentang kesengsaraan jika mereka enggan bertobat, tetapi kebanyakan manusia tidak mengetahui sehingga tetap enggan mengimani risalah nabi Muhammad. (lihat juga: al-a'r'f/7: 158 dan y'suf/12: 103)29. Walau nabi Muhammad terus berusaha meyakinkan tentang risalahnya, kaum kafir tetap mengingkarinya. Mereka juga mengingkari hari kiamat, dan mereka berkata, 'kapankah datangnya janji ini, yakni hari kiamat akan datang, jika kamu orang yang benar''."
  }
]