[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu berkata untuk memperolok-olok, “Kapankah datangnya janji yang kalian ancamkan kepada kami bahwa Allah akan mengumpulkan kami padanya kemudian Dia menetapkan keputusanNya di antara kami, bila kalian adalah orang-orang yang benar dalam apa yang kalian ancamkan kepada kami?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Orang-orang musyrikin berkata, menuntut disegerakannya azab yang diancamkan terhadap mereka, “Kapan janji azab ini akan terwujud jika kalian adalah orang-orang yang benar terkait apa yang kalian nyatakan bahwa itu hak?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah menyampaikan keburukan adab dan kebodohan orang-orang kafir ketika mereka berkata kepada Rasulullah dan orang-orang beriman: “Kapan hari kiamat akan terjadi jika itu memang nyata seperti yang kalian katakan?” Pertanyaan ini merupakan bentuk pengingkaran dan penentangan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَيَقُولُونَ مَتَىٰ هٰذَا الْوَعْدُ إِن كُنتُمْ صٰدِقِينَ (Dan mereka berkata: “Kapankah (datangnya) janji ini, jika kamu adalah orang-orang yang benar?”) Mereka mengatakan ini untuk mengolok-olok kabar tentang hari kebangkitan dan perhitungan yang dikabarkan oleh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang musyrik itu berkata dengan mengejek: \"Kapankah waktu terjadinya janji telah kalian janjikan untuk kami ini wahai orang-orang mukmin, yaitu (janji) terjadinya hari kiamat, jika kalian adalah orang-orang yang benar dalam hal itu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kapankah janji ini, jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Di antara hal yang mereka usulkan adalah mereka minta disegerakannya azab yang diperingatkan oleh Rasul terhadap mereka. Allah berfirman, “Dan mereka berkata, ‘Kapankah janji ini, jika kamu adalah orang-orang yang benar?’” ini adalah kezhaliman mereka. Sebab, kelaziman jenis apa yang membedakan antara kebenarannya dengan informasi tentang waktu terjadinya azab? Tidaklah ini merupakan sikap menolak kebenaran dan kepicikan akal? Bukankah seorang pemberi peringatan dalam salah satu urusan dunia, kalau dia membawa (syariat) kepada sekelompok manusia (suatu kaum) yang mengenal kejujurannya dan ketulusannya, sedangkan mereka memiliki musuh yang sedang menunggu-nunggu kesempatan untuk menyerang dan tengah mengadakan persiapan, lalu pemberi peringatan itu berkata kepada mereka, “Aku telah melihat musuh kalian telah berangkat hendak menyerang dan menumpas kalian.” Lalu salah seorang di antara kaum itu mengatakan, “Jika Anda benar, maka sampaikanlah kepada kami, jam berapa mereka akan sampai kepada kami? Di mana tempat mereka sekarang?” apakah orang seperti ini bisa dianggap seorang yang berakal atau sudah pantas dicap dungu dan gila? Di sisi lain, orang yang menyampaikan berita memang bisa benar dan bisa dusta, sedangkan musuh bisa jadi telah tampak oleh sebagian mereka sementara tekad mereka telah pupus, padahal bisa jadi kaum itu memiliki pertahanan yang dengannya mereka dapat mempertahankan diri. Lalu bagaimana dengan orang yang mendustakan manusia yang paling jujur lagi ma’shum (terpelihara dari kesalahan) dalam informasinya, yang tidak berbicara berdasarkan hawa nafsu tentang azab yang pasti, yang tidak bisa dicegah, tidak ada penolong darinya, tidakkah menolak informasi yang berasal darinya dengan alasan tidak jelas waktu terjadinya adalah merupakan kepicikan yang paling parah?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 29: Allah mengabarkan bawasanya ucapan yang diucapkan mereka orang-orang musyrik yang mendustakan hari kebangkitan dengan berkata mencemooh dan merendahkan : Kapan datang kebenaran yang dijanjikan kepada kami dari Muhammad ﷺ dan para sahabatnya tentang hari kebangkitan dan balasan, jika mereka adalah orang-orang yang benar dalam janji mereka ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara yang mereka usulkan adalah permintaan mereka untuk disegerakan azab yang diperingatkan kepada mereka. Ini termasuk kezaliman mereka. Padahal apa kaitannya antara kejujuran dengan pemberitahuan kapan terjadinya, sehingga ketika belum terjadi, maka berarti tidak benar? Jelas, bahwa maksud mereka dengan kata-kata tersebut adalah menolak yang hak di samping sebagai bentuk kebodohan pada akal. Persamaannya dalam hal ini adalah ketika seseorang datang kepada sebuah kaum yang mereka mengetahui kejujurannya dan sikap tulusnya, di mana kaum tersebut memiliki musuh yang sedang mencari-cari kesempatan untuk menyerang mereka, lalu orang itu berkata, “Aku meninggalkan musuh kalian dalam keadaan sedang berjalan untuk menyerang dan memusnahkan kalian!” Jika salah seorang di antara mereka berkata, “Jika engkau memang benar, kapan datangnya?” Tentu pertanyaan seperti ini tidak pantas diajukan. Dengan demikian, menolak suatu berita dengan alasan tidak jelas kapan terjadinya termasuk kedunguan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 29",
    "description": "Walau nabi Muhammad terus berusaha meyakinkan tentang risalahnya, kaum kafir tetap mengingkarinya. Mereka juga mengingkari hari kiamat, dan mereka berkata, 'kapankah datangnya janji ini, yakni hari kiamat akan datang, jika kamu orang yang benar''30. Katakanlah, wahai nabi Muhammad, 'bagimu ada hari yang telah dijanjikan, yakni hari kiamat. Ketika hari itu tiba, kamu tidak dapat meminta penundaan atau percepatannya walau sesaat pun. '."
  }
]