[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Orang-orang kafir yang mengingkari kebangkitan berkata, “ Kiamat tidak akan datang kepada kami.” Katakanlah kepada mereka (wahai Rasul), “Pasti, demi Allah Tuhanku, ia benar-benar akan datang, hanya saja saat kedatangannya tidak diketahui kecuali oleh Allah semata Yang Maha Mengetahui yang ghaib, dimana tidak samar bagiNya seekor semut sekalipun, baik di langit maupun dibumi, tidak juga yang lebih besar atau lebih kecil dari itu, kecuali ia tertulis dalam kitab yang nyata, yaitu Lauhul Mahfuzh”, agar Allah memberi pahala kepada orang-orang yang membenarkan Allah dan mengikuti Rasulullah serta melakukan amal-amal yang shalih. Mereka mendapatkan ampunan bagi dosa-dosa mereka dan rizki yang mulia, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Orang-orang yang kafir kepada Allah berkata, “Hari Kiamat tidak akan pernah datang.” Katakanlah kepada mereka -wahai Rasul-, Demi Allah tidak demikian, hari Kiamat yang kalian dustakan pasti akan datang kepada kalian, namun tidak ada yang mengetahui waktunya kecuali Allah saja, Dia lah yang mengetahui apa yang gaib, yaitu hari Kiamat dan lainnya, tidak ada yang tersembunyi dari ilmu Allah, sekalipun ia lebih kecil dari seekor semut di langit dan di bumi, tidak ada yang lebih kecil dari itu atau lebih besar yang luput dari ilmu Allah, karena ia telah tertulis di dalam kitab yang nyata, yaitu Lauḥul maḥfūẓ yang mencatat segala sesuatu yang terjadi hingga hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Orang-orang kafir yang mengingkari hari kebangkitan dan lalai dari tanda-tandanya berkata: “Hari kiamat tidak akan terjadi.” Hai Muhammad, bantahlah mereka seraya bersumpah untuk menegaskan itu pasti terjadi: “Bukan demikian! demi Tuhanku yang telah memperlakukanku dengan baik, sungguh hari kiamat akan datang, dan kemudian Allah akan memberi balasan bagi kalian dan memberi keputusan antara diriku dengan kalian. Allah Maha Mengetahui hal ghaib, Dia mengetahui segala yang ghaib dan tersembunyi, tidak ada sesuatupun yang luput dari ilmu-Nya. Tidak ada hal kecil dan besar melainkan telah tercatat dalam lauhul mahfudz yang mencantumkan segala hal yang telah terjadi, yang sedang terjadi, dan yang akan terjadi. Oleh sebab itu, Allah Maha Kuasa untuk membangkitkan dan menghisab kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَقَالَ الَّذِينَ كَفَرُوا۟ لَا تَأْتِينَا السَّاعَةُ ۖ (Dan orang-orang yang kafir berkata: “Hari berbangkit itu tidak akan datang kepada kami”) Yakni hari kiamat dan hari kebangkitan. Mereka mengatakan ini karena mengingkari kedatangannya, dan mendustakan kabar-kabar yang sampai kepada mereka dari Allah lewat lisan para nabi yang tertuang di dalam kitab-kitab-Nya. قُلْ بَلَىٰ وَرَبِّى لَتَأْتِيَنَّكُمْ(Katakanlah: “Pasti datang, demi Tuhanku sesungguhnya kiamat itu pasti akan datang kepadamu) Allah memerintahkan nabi-Nya untuk memberitahu mereka dan bersumpah dengan nama-Nya atas kebenaran kabar untuk menekankan bahwa hari kiamat pasti akan datang. لَا يَعْزُبُ عَنْهُ(Tidak ada tersembunyi daripada-Nya) Yakni tidak ada yang tertutup dan tersembunyi dari-Nya. مِثْقَالُ ذَرَّةٍ فِى السَّمٰوٰتِ وَلَا فِى الْأَرْضِ وَلَآ أَصْغَرُ مِن ذٰلِكَ(sebesar zarrahpun yang ada di langit dan yang ada di bumi dan tidak ada (pula) yang lebih kecil dari itu) Yakni lebih kecil daripada zarrah. وَلَآ أَكْبَرُ(dan yang lebih besar) Yakni lebih besar daripada itu. إِلَّا فِى كِتٰبٍ مُّبِينٍ(melainkan tersebut dalam Kitab yang nyata (Lauh Mahfuzh)”) Yakni itu semua tercantum dalam Lauh Mahfuzh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Orang-orang kafir yang mengingkari hari kebangkitan berkata: “Hari kiamat dan hari kebangkitan tidak akan terjadi pada kami.” Katakanlah kepada mereka wahai nabi, untuk menyanggah perkataan mereka: “Tidak seperti itu, dengan bersumpah demi Tuhanku hari kiamat akan mendatangi kalian dan segala amal perbuatan kalian akan diberi balasan. Tuhanku Maha Tahu atas segala yang ghaib: yaitu segala yang tidak bisa dilihat/tidak bisa dijangkau oleh manusia dengan ilmunya. Tidak ada seculi dzarrah pun yang dapat luput dari pengawasan dan penglihatan Allah baik di bumi dan di langit. Tidak ada yang lebih kecil dari permisalan itu dan tidak ada yang lebih besar dari itu kecuali tidak akan luput dari pengawasan dan catatan Allah dalam tempat yang terjaga yaitu Lauhul Mahfudz."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ingkar berkata,“Hari kiamat itu tidak akan datang kepada kami” Katakanlah,“Tentu saja. Demi Tuhanku yang mengetahui yang gaib, kiamat itu pasti mendatangi kalian. Tidak ada yang tersembunyi} tidak ada yang tersembunyi {dariNya sekalipun seberat zharrah} seukuran semut yang sangat kecil {baik yang di langit maupun yang di bumi, yang lebih kecil daripada itu atau yang lebih besar, kecuali semuanya ada dalam kitab yang jelas} kitab yang jelas yaitu Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Setelah Allah menjelaskan keagunganNya melalui sifat-sifat yang Dia sandangkan pada diriNya; dan hal ini mengharuskan mengagungkan dan menyucikanNya serta beriman kepadaNya, maka Dia menyebutkan bahwa di antara golongan-golongan manusia ada sekelompok manusia yang tidak menghargai Rabbnya dengan sebenar-benarnya, malah mereka kafir kepadaNya dan mengingkari kekuasaanNya untuk menghidupkan kembali orang-orang yang sudah mati dan adanya kiamat, dan dengan itu mereka menentang Rasul-rasulNya, seraya berfirman, “Dan orang-orang kafir berkata,” maksudnya, kafir kepada Allah, rasul-rasulNya dan ajaran yang mereka bawa. Maka disebabkan kekafiran itu, mereka berkata, “Hari berbangkit itu tidak akan datang kepada kami.” Maksudnya, tidaklah kiamat itu melainkan kehidupan dunia ini saja, kami mati dan hidup! Lalu Allah memerintah RasulNya untuk membantah perkatan mereka dan mematahkannya serta bersumpah tentang kebangkitan, bahwa kebangkitan itu pasti akan datang kepada mereka. Dan untuk hal itu Dia berdalil (beragumen) dengan dalil bahwa siapa yang membenarkannya, maka dia harus membenarkan kebangkitan dengan pasti, yaitu ilmu Allah, yang Mahaluas lagi meliputi segala sesuatu, seraya berfirman, “yang mengetahui yang ghaib,” maksudnya, perkara-perkara yang ghaib dari pandangan mata kita dan dari pengetahuan kita, maka bagaimana dengan yang Nampak? (Tentu Dia lebih mengetahuinya) kemudian Dia mengukuhkan ilmuNya seraya berfirman, “Tidak ada yang tersembunyi,” maksudnya, tidak ada yang lepas dari pengetahuan Allah, “seberat biji sawi pun nyang ada di langit dan yang ada di bumi,” maksudnya, segala sesuatu dengan raga dan bagian-bagiannya, hingga bagian yang terkecil dari bagian-bagian tersebut, yaitu serpihan-serpihannya, “dan tidak ada pula yang lebih kecil dari itu dan yang lebih besar, melainkan tersebut dalam Kitab yang nyata.” Maksudnya, semua telah diliputi oleh ilmuNya, telah dicatat oleh penaNya dan telah termuat di dalam kitabNya yang nyata, yaitu Lauh Mahfuzh. Maka, tuhan yang tidak ada yang tersembunyi dari ilmuNya sebesar atom pun lalu yang lebih kecil darinya dalam sepanjang waktu, dan mengetahui yang berkurang dari bumi berupa mayat dan apa-apa yang tersisa dari jasad mereka itu Kuasa menghidupkan kembali mereka adalah tentu lebih pasti, dan kebangkitan mereka tidak lebih aneh daripada ilmu yang meliputi segala sesuatu ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 3: Setelah Allah menjelaskan kemuliaan dan kekuasaan-Nya pada makhluk-Nya, Allah mengabarkan bahwasanya orang-orang yang kafir dan mengingkari hari kebangkitan yang mereka mengingkari banyak ayat-ayat Al Qur’an, mereka berkata : Tidak akan datang kepada kami hari kiamat. Allah memerintahkan kepada Nabi-Nya yang beliau adalah orang yang benar dan dibenarkan yang tidak pernah sedikitpun mencoba berbohong, agar beliau bersumpah atas nama Tuhannya bahwasanya hari kiamat benar-benar akan datang, tidak mungkin tidak datang, akan tetapi tidaklah (makhluk) mengetahui kedatangannya kecuali hanya Allah saja yang tahu , yang mengetahui yang ghaib, dimana sesuatu yang ghaib tidaklah tersembunyi baginya walaupun sebesar dzarrah baik di langit maupun di bumi; Tidaklah tersembunyi bagi-Nya sesuatu yang ghaib apapun itu meskipun lebih kecil dibandingkan dzarrah atau lebih besar darinya. Segala sesuatunya jelas bagi-Nya dan tertulis di Lauhul Mahfudz. Dzarrah adalah biji-bijian atau semut kecil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan keagungan diri-Nya dengan menyebutkan sifat diri-Nya, di mana hal ini mengharuskan Dia untuk dibesarkan, disucikan dan dan diimani, maka Dia menyebutkan, bahwa di antara manusia ada segolongan orang yang tidak mengagungkan Tuhannya dengan pengagungan yang semestinya, bahkan mereka kafir kepada-Nya, mengingkari kekuasaan-Nya untuk mengembalikan orang-orang yang sudah mati, dan mengingkari adanya hari Kiamat. Di samping itu, mereka juga menentang para rasul-Nya. Kepada Allah, Rasul-Nya, dan kepada apa yang mereka bawa dari sisi Allah. Maksud mereka, tidak ada kehidupan selain kehidupan dunia, di mana kita hidup kemudian mati setelah itu selesai. Maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya membantah ucapan mereka dan bersumpah tentang benarnya kebangkitan, dan bahwa Kiamat akan datang kepada mereka. Untuk menguatkannya dipakai dalil di mana orang yang mengakuinya, mesti membenarkan kebangkitan, yaitu ilmu (pengetahuan) Allah Subhaanahu wa Ta'aala yang luas lagi merata, Dia berfirman, “Yang mengetahui yang gaib,” yakni perkara-perkara yang gaib dari penglihatan dan pengetahuan kita. Jika yang gaib saja diketahuinya, lalu bagaimana dengan yang tampak. Selanjutnya diperkuat pengetahuan-Nya, bahwa tidak ada yang tersembunyi bagi-Nya seberat dzarrah pun di langi maupun di bumi, semuanya diketahui-Nya. Yaitu semut terkecil. Ilmu-Nya meliputi segala sesuatu, penanya lebih dulu berjalan, dan tertulis dalam kitab yang jelas, yaitu Lauh Mahfuzh. Oleh karena itu, Tuhan yang mengetahui segala yang tersembunyi meskipun seberat dzarrah pun dan mengetahui orang-orang yang telah mati serta bagian mana saja yang masih tersisa dari jasadnya tentu mampu membangkitkan mereka, dan hal itu tidaklah mengherangkan bagi Tuhan yang ilmu-Nya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 3",
    "description": "-4. Kedatangan hari kiamat itu tiada lain agar dia memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan semasa di dunia. Mereka memperoleh ampunan dan rezeki yang mulia, yakni surga."
  }
]