[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai Rasul), “Kalian memilki waktu yang telah ditetapkan dan ia akan mendatangi kalian, tidak mungkin tidak, yaitu Hari Kiamat, dimana kalian tidak bisa menunda sesaat pun untuk beratubat, kalian juga tidak bisa memajukannya sesaat pun sebelumnya untuk menyegerakan azab. Hati-hatilah kepada hari itu dan persiapkanlah diri kalian untuk menghadapinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Katakanlah -wahai Rasul- kepada orang-orang yang menuntut disegerakannya azab, “Kalian mempunyai batas waktu yang sudah ditetapkan, tidak akan terlambat sesaat pun dan tidak akan maju sesaat pun, hari itu adalah hari Kiamat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Katakanlah: “Hai orang-orang kafir, kalian memiliki batas waktu yang tidak akan berubah yang telah Allah tetapkan. Jika waktu itu telah datang maka kalian tidak akan mampu menghindar dan menundanya, sebagaimana kalian juga tidak akan mampu mempercepat kedatangannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. قُل لَّكُم مِّيعَادُ يَوْمٍ (Katakanlah: “Bagimu ada hari yang telah dijanjikan) Yakni hari kebangkitan. لَّا تَسْتَـْٔخِرُونَ عَنْهُ سَاعَةً وَلَا تَسْتَقْدِمُونَ(yang tiada dapat kamu minta mundur daripadanya barang sesaatpun dan tidak (pula) kamu dapat meminta supaya diajukan”) Yakni janji yang telah ditetapkan bagi kalian ini tidak akan kalian akhirkan atau majukan waktunya, namun pasti akan terjadi pada waktu yang telah ditentukan oleh Allah, sehingga tidak akan terjadi sebelum waktunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai nabi, katakanlah kepada mereka: \"Bagi kalian adalah janji tentang hari yang telah ditentukan, yaitu hari kiamat. Kalian tidak akan menunda dan memajukannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Bagi kalian ada hari yang telah dijanjikan. Kalian tidak dapat meminta penundaan} Kalian tidak bisa menangguhkannya {walaupun hanya sesaat dan tidak pula meminta percepatan”} kalian tidak bisa memajukannya sesaat pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Katakanlah,” kepada mereka dengan memberitakan mengenai waktu terjadinya Hari Kiamat yang sudah tidak ada keraguan lagi padanya, “Bagimu ada hari yang telah dijanjikan yang tiada dapat kamu minta mundur darinya barang sesaat pun, dan tidak pula kamu dapat meminta supaya dimajukan,” maka waspadailah hari itu dan lakukanlah persiapan untuk menghadapinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 30: Allah memerintahkan Nabi-Nya ﷺ agar berkata : Ketahuilah wahai orang-orang musyrik, bahwasanya Allah memperingatkan kalian dari hari yang benar-benar sesuai dengan yang Dia janjikan. Akan kalian dapati dengan segera dan kalian akan melihatnya atas apa yang telah Allah janjikan, hari itu tidak akan tergesa-gesa datang dengan sebab ketergesa-gesaan kalian, maka jika telah datang, kalian akan melihatnya; Kalian akan yakin dengan kejadiannya, sesungguhnya Allah tidak akan mengakhirkan datangnya hari tersebut walaupun sehari saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada mereka memberitahukan waktu terjadinya. Oleh karena itu, berhati-hatilah terhadap hari itu dan bersiap-siaplah untuk menghadapinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 30",
    "description": "Katakanlah, wahai nabi Muhammad, 'bagimu ada hari yang telah dijanjikan, yakni hari kiamat. Ketika hari itu tiba, kamu tidak dapat meminta penundaan atau percepatannya walau sesaat pun. '31. Tidak hanya mengingkari risalah nabi Muhammad dan kebenar-an Al-Qur'an, kaum kafir juga mengingkari kitab-kitab yang Allah turunkan sebelum Al-Qur'an. Dan orang-orang kafir berkata, 'kami tidak akan beriman kepada Al-Qur'an ini dan tidak pula kepada kitab yang sebelumnya, seperti taurat dan injil. ' di dunia mereka bisa berkata dan berbuat apa saja, tetapi kelak mereka harus mempertanggungjawabkannya. Dan alangkah mengerikan kalau kamu melihat ketika orang-orang yang zalim itu, yakni mereka yang mempersekutukan Allah, dihadapkan kepada tuhannya untuk diadili. Sebagian mereka mengembalikan perkataan kepada sebagian yang lain dengan saling berbantah dan melempar tanggung jawab; orang-orang yang dianggap lemah, yakni para pengikut, berkata kepada orang-orang yang menyombongkan diri, yakni para pemimpin yang sesat dan menyesatkan, 'kalau tidaklah karena kamu, tentulah kami menjadi orang-orang mukmin. '."
  }
]