[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir berkata, “Kami tidak akan membenarkan al-Qur’an ini dan tidak pula kitab-kitab yang mendahuluinya seperti Taurat, Injil, dan Zabur.” Sungguh mereka telah mendustakan seluruh kitab-kitab Allah. Seandainya kamu melihat wahai Rasul, saat orang-orang zhalim itu ditahan di depan Tuhan mereka untuk menjalani perhitungan amal, mereka berbisik-bisik diantara mereka, masing-masing menyalahkan yang lain, niscaya kamu melihat sesuatu yang menyeramkan. Orang-orang lemah berkata kepada orang-orang yang sombong (dan mereka adalah para tokoh dan pemimpin yang sesat lagi menyesatkan) “kalau kalian tidak menyesatkan kami dari petunjuk, niscaya kami telah beriman kepada Allah dan RasulNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Orang-orang yang kafir kepada Allah berkata, “Kami tidak akan beriman kepada Al-Qur`ān ini yang menurut Muhammad ia diturunkan kepadanya, kami tidak akan beriman kepada kitab-kitab langit sebelumnya.” Seandainya kamu -wahai Rasul- melihat ketika orang-orang zalim itu tertahan di sisi Tuhan mereka pada hari Kiamat untuk menghadapi hisab, mereka saling bertengkar, sebagian dari mereka melemparkan tanggung jawab dan celaan kepada sebagian lainnya, orang-orang yang mengikuti lagi tertindas berkata kepada para pemimpin yang menindas mereka di dunia, 'seandainya kalian tidak menyesatkan kami, niscaya kami adalah orang-orang yang beriman kepada Allah dan para Rasul-Nya.'”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Orang-orang kafir menyatakan keingkarannya terhadap al-Qur’an dan isi kandungannya, sehingga mereka melakukan pendustaan yang besar sehingga menutupi hati dan akal mereka. Seandainya kamu melihat tempat kesudahan dan perselisihan mereka, niscaya kamu akan melihat hal yang mengerikan; ketika orang-orang zalim itu berdiri di hadapan Tuhan semesta alam, mereka saling menuduh dan menyalahkan. Orang-orang lemah dari mereka ketika di dunia berkata kepada orang-orang yang kuat dan berkuasa: “kalalulah bukan karena kalian pemaksaan dan penyesatan kalian terhadap kami, niscaya kami dahulu akan menjadi orang-orang beriman; namun semua ini akibat kami dahulu menjadi pengikut dan pembantu kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَقَالَ الَّذِينَ كَفَرُوا۟ لَن نُّؤْمِنَ بِهٰذَا الْقُرْءَانِ وَلَا بِالَّذِى بَيْنَ يَدَيْهِ ۗ (Dan orang-orang kafir berkata: “Kami sekali-kali tidak akan beriman kepada Al Quran ini dan tidak (pula) kepada kitab yang sebelumnya”) Yakni tidak pula kepada kitab terdahulu yaitu Taurat dan Injil serta tidak beriman kepada para Rasul sebelumnya. وَلَوْ تَرَىٰٓ إِذِ الظّٰلِمُونَ مَوْقُوفُونَ عِندَ رَبِّهِمْ(Dan (alangkah hebatnya) kalau kamu lihat ketika orang-orang yang zalim itu dihadapkan kepada Tuhannya) Yakni mereka akan tertahan di tempat perhitungan. يَرْجِعُ بَعْضُهُمْ إِلَىٰ بَعْضٍ الْقَوْلَ(sebahagian dari mereka menghadap kan perkataan kepada sebagian yang lain) Yakni mereka saling menyalahkan, padahal ketika di dunia mereka saling bantu membantu dan saling mencintai. يَقُولُ الَّذِينَ اسْتُضْعِفُوا۟( orang-orang yang dianggap lemah berkata) Yakni para pengikut. لِلَّذِينَ اسْتَكْبَرُوا۟( kepada orang-orang yang menyombongkan diri) Yakni para pemimpin yang diikuti. لَوْلَآ أَنتُمْ(“Kalau tidaklah karena kamu) Yakni andai kalian tidak menghalangi kami dari keimanan kepada Allah dan mengikuti Rasulullah. لَكُنَّا مُؤْمِنِينَ(tentulah kami menjadi orang-orang yang beriman”) Yakni beriman kepada Allah dan membenarkan Rasul dan kitab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan orang-orang kafir Mekah berkata: \"Kami tidak akan membenarkan Al-qur'an yang telah kamu bawa ini wahai Muhammad, tidak juga kitab-kitab Tuhan sebelummu seperti Taurat dan Injil\". Dan kalau kamu melihat wahai nabi, ketika orang-orang kafir itu dikurung dan ditahan di tempat hisab, mereka akan saling bercakap-cakap dan menyalahkan satu sama lain. Orang-orang lemah yang menjadi pengikut berkata kepada para pemimpin yang sombong: \"Jika saja kaian tidak menyibukkan kami dari keimanan dan meletakkan kami dalam kekufuran, sungguh kami akan menjadi orang-orang yang beriman, yaitu orang-orang yang beriman kepada Allah dan rasulNya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang kafir berkata,“Kami tidak akan beriman kepada Al-Qur’an ini dan tidak pula kepada yang sebelumnya”} tidak pula kepada kitab-kitab samawi sebelumnya {jika kamu melihat orang-orang zalim ketika mereka dihadapkan} mereka ditahan di tempat hisab {di sisi Tuhannya, sebagian mereka mengembalikan perkataan kepada sebagian lain} mereka saling mengembalikan celaan dan cemoohan di antara mereka {orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri,“Seandainya bukan karena kalian, niscaya kami menjadi orang-orang mukmin”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Ketika Allah menjelaskan bahwa waktu yang dijanjikan kepada orang-orang yang minta disegerakan turunnya azab itu pasti terjadi jika waktunya telah tiba, maka di sini Dia menjelaskan kondisi mereka pada Hari (Kiamat) itu; dan bahwa kalau saja kamu melihat keadaan mereka ketika mereka dihadapkan kepada Rabb mereka dan (di situ) berkumpul para pemimpin dan para pengikutnya dalam kekafiran dan kesesatan, tentu kamu akan melihat perkara yang sangat luar biasa dan keadaan yang sangat menakutkan, dan kamu melihat bagaimana mereka saling menyalahkan dan “sebagian dari mereka menghadapkan perkataan kepada sebagian yang lain,” lalu berkata “orang-orang yang dianggap lemah,” yaitu para pengikut “kepada orang-orang yang menyombongkan diri,” mereka adalah para penguasa dan pemimpin, “Kalau tidaklah karena kamu tentulah kami menjadi orang-orang yang beriman,” akan tetapi kalian telah menghalangi kami untuk beriman, dan kalian memperindah kekafiran bagi kami, sehingga kami mengikuti kalian. Maksud mereka dengan ucapan tersebut adalah agar siksaan hanya ditimpakan kepada para pemimpin saja, tanpa menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 31: Allah mengabarkan keadaannya bagi mereka yang telah kufur dan mendustakan ayat-ayat Allah dan kitab-kitab-Nya; Di mana mereka berkata dengan pengingkaran dan kesombongan : Kami tidak akan beriman dengan Al Qur’an ini dan tidak juga dengan kitab-kitab yang lalu dari taurat dan injil serta zabur; Mereka mengingkari dengan apa yang telah mereka katakan, maka seandainya engkau wahai Nabi Allah mengetahui mereka pada hari kiamat dan sungguh mereka akan menyesal, ketika mereka berdiri di hadapan Allah untuk dibalas dan dihisab; Sungguh engkau akan menyaksikan urusan yang besar, dan sungguh engkau akan melihat mereka saling berpandangan dan mengatakan : Kalian adalah sebab kami tertimpa adzab dan keburukan, maka kiranya kalian dahulu tidak menghalang-halangi kami dan juga tidak menghalangi kami dari iman kepada Allah dan mengikuti Rasulullah ﷺ; Sungguh kami menjadi orang-orang yang beriman, jujur dan selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memberitahukan bahwa hari yang telah ditentukan untuk orang-orang yang mendustakan azab pasti akan datang ketika sudah tiba waktunya, maka di sini Allah Subhaanahu wa Ta'aala menyebutkan keadaan mereka pada hari itu, bahwa jika kita melihat keadaan mereka ketika dihadapkan kepada Tuhan mereka, pengikut dan pemimpin berkumpul bersama, tentu kita akan melihat perkara yang mengerikan, di mana antara mereka saling melempar kesalahan kepada yang lain. Seperti kitab Taurat dan Injil yang menunjukkan kepada kebangkitan karena pengingkaran mereka kepadanya. Yaitu para pengikut. Yaitu para pemimpin. Yakni kalau bukan karena kamu menghalangi kami dari keimanan dan menghiasi kekafiran kepada kami lalu kami ikuti kamu. Maksud kata-kata mereka ini adalah agar azab itu ditimpakan kepada mereka para pemimpin mereka, tidak kepada selain mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 31",
    "description": "Tidak hanya mengingkari risalah nabi Muhammad dan kebenar-an Al-Qur'an, kaum kafir juga mengingkari kitab-kitab yang Allah turunkan sebelum Al-Qur'an. Dan orang-orang kafir berkata, 'kami tidak akan beriman kepada Al-Qur'an ini dan tidak pula kepada kitab yang sebelumnya, seperti taurat dan injil. ' di dunia mereka bisa berkata dan berbuat apa saja, tetapi kelak mereka harus mempertanggungjawabkannya. Dan alangkah mengerikan kalau kamu melihat ketika orang-orang yang zalim itu, yakni mereka yang mempersekutukan Allah, dihadapkan kepada tuhannya untuk diadili. Sebagian mereka mengembalikan perkataan kepada sebagian yang lain dengan saling berbantah dan melempar tanggung jawab; orang-orang yang dianggap lemah, yakni para pengikut, berkata kepada orang-orang yang menyombongkan diri, yakni para pemimpin yang sesat dan menyesatkan, 'kalau tidaklah karena kamu, tentulah kami menjadi orang-orang mukmin. '32. Enggan disalahkan, orang-orang yang menyombongkan diri itu me-ngelak dari tanggung jawab dan berkata kepada orang-orang yang dianggap lemah, yakni para pengikut mereka, 'kamikah yang telah menghalangimu untuk memperoleh petunjuk Allah setelah petunjuk itu datang kepadamu melalui nabi-Nya' tidak! sebenarnya kamu sendirilah orang-orang yang berbuat dosa karena tetap dalam kekafiran. '."
  }
]