[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemimpin berkata kepada para pengikut yang dianggap lemah, “Apakah kami melarang kalian untuk mengikuti hidayah setelah ia datang kepada kalian? Justru kalianlah para pendosa karena masuk ke dalam kekafiran atas dasar keinginan dan pilihan kalian sendirii.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Orang-orang yang diikuti yang menyombongkan diri dari kebenaran berkata kepada orang-orang yang mengikuti yang mereka tindas di dunia, “Apakah kami yang menghalang-halangi kalian dari hidayah yang telah datang kepada kalian melalui Muhammad? Tidak, akan tetapi kalian sendiri adalah orang-orang yang zalim, orang-orang yang rusak dan para pembuat kerusakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Maka orang-orang yang berkuasa di antara mereka mengingkari: “Apakah kami yang menyesatkan kalian dari petunjuk yang datang kepada kalian dengan jelas? Kalianlah yang memilih jalan kesesatan dengan kehendak kalian sendiri demi kemaslahatan kalian, maka janganlah kalian menyalahkan kami, namun salahkanlah diri kalian sendiri. Petunjuk telah datang kepada kalian, maka apa yang dapat menyesatkan kalian wahai orang-orang berdosa? Apakah kami memaksa kalian agar mengikuti kami? Atau karena sifat buruk yang mengalir dalam darah kalian yang membuat kalian mentaati dan mengikuti kami?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالَ الَّذِينَ اسْتَكْبَرُوا۟ لِلَّذِينَ اسْتُضْعِفُوٓا۟ (Orang-orang yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah) Mereka menjawab perkataan para pengikut mereka untuk mengingkari apa yang mereka katakan. أَنَحْنُ صَدَدْنٰكُمْ عَنِ الْهُدَىٰ( “Kamikah yang telah menghalangi kamu dari petunjuk) Yakni apakah kami larang kalian untuk beriman بَعْدَ إِذْ جَآءَكُم ۖ( sesudah petunjuk itu datang kepadamu?) Setelah petunjuk datang kepada kalian بَلْ كُنتُم مُّجْرِمِينَ((Tidak), sebenarnya kamu sendirilah orang-orang yang berdosa”) Yakni kalian orang-orang yang terus melakukan kekafiran dan banyak berbuat dosa serta memiliki dosa-dosa yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Para pemimpin takabur itu berkata kepada orang-orang yang lemah: “Apakah Kami mencegah kalian untuk beriman setelah datangnya petunjuk itu? Tidak, bahkan kalian sendiri memang kaum yang jahat dan bersikeras atas kekufuran”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Oraang-orang yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah,“Apakah kami yang telah menghalangi kalian} Kami menahan kalian {dari petunjuk setelah, petunjuk itu datang kepada kalian. Sebenarnya kalianlah orang-orang yang durhaka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. “Orang-orang yang menyombongkan diri berkata kepada orang-orang yang tertindas,” dengan maksud minta penjelasan kepada mereka dan menginformasikan bahwa semua sama-sama ikut serta dalam kejahatan, “Kamikah yang telah menghalangi kamu dari petunjuk sesudah petunjuk itu datang kepadamu.” Maksudnya, dengan sebab kaekuatan dan pemaksaan kamikah terhadap kalian? “Sebenarnya kamu sendirilah orang-orang yang berdosa,” maksudnya, sebenarnya kalianlah yang memilih untuk melakukan dosa, kalian tidak dipaksa untuk itu. Sekalipun kami telah memperindah kesesatan untuk kalian, namun kami tetap tidak memiliki kekuasaan terhadap kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 32: Maka dijawablah oleh mereka para pembesar yang di ikuti mereka : Apakah kami telah menghalang-halangi kalian dengan kuasa kami dari iman kepada Allah dan mengikuti Rasul ﷺ setelah ia datang kepada kalian ? Kalian sungguh telah kufur karena sebab diri-diri kalian sendiri; Bahkan kami memang lebih buruk dari kalian dan kami tidak menyalahkan kalian, akan tetapi kalian paling kufur dan rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meminta agar mereka mengerti sambil memberitahukan, bahwa semuanya sama-sama salah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 32",
    "description": "Enggan disalahkan, orang-orang yang menyombongkan diri itu me-ngelak dari tanggung jawab dan berkata kepada orang-orang yang dianggap lemah, yakni para pengikut mereka, 'kamikah yang telah menghalangimu untuk memperoleh petunjuk Allah setelah petunjuk itu datang kepadamu melalui nabi-Nya' tidak! sebenarnya kamu sendirilah orang-orang yang berbuat dosa karena tetap dalam kekafiran. '33. Mendengar ucapan para pemimpin mereka, para pengikut kembali membantah. Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri, 'tidak! sebenarnya tipu daya-Mu pada waktu malam dan siang-lah yang menghalangi kami dari petunjuk, ketika kamu terus-menerus menyeru kami agar kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya. ' usai berbantah-bantahan, mereka, yakni kedua para pemimpin dan pengikut, bersama-sama menyatakan penyesalan ketika mereka melihat azab. Penyesalan mereka sama sekali tidak berguna. Dan di neraka kami pasangkan belenggu di leher orang-orang yang kafir sebagai hukuman atas kedurhakaan mereka. Mereka tidak dibalas melainkan sesuai dengan apa yang telah mereka kerjakan di dunia."
  }
]