[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang lemah berkata kepada para pemimpin dalam kesesatan, “Pengaturan kalian yang buruk terhadap kami siang dan malam yang membuat kami terjerumus ke dalam kebinasaan, kalian meminta kami agar kami kafir kepada Allah dan mengangkat sekutu-sekutu bagiNya dalam ibadah.” Masing-masing kubu merintihkan penyesalan saat mereka melihat azab disiapkan untuk mereka. Dan Kami menjadikan belenggu-belenggu di leher orang-orang kafir itu, mereka tidak di hokum dengan hukuman ini kecuali disebabkan oleh kekafiran mereka kepada Allah dan perbuatan buruk mereka di dunia. Dalam ayat ini terkandung peringatan keras dari mengikuti para penyeru kepada kesesatan dan para pemimpin kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Para pengekor yang ditindas oleh para pemimpin mereka berkata kepada orang-orang yang mereka ikuti yang menyombongkan diri dari kebenaran, “Justru tipu muslihat kalian terhadap kami siang dan malam yang menghalang-halangi kami dari petunjuk, manakala kalian memerintahkan kami agar kami kafir kepada Allah dan menyembah makhluk-makhluk selain Allah.” Mereka menyembunyikan penyesalan atas kekufuran yang mereka pegang di dunia manakala mereka menyaksikan azab, mereka yakin bahwa mereka akan diazab. Dan Kami menjadikan belenggu-belenggu di leher orang-orang kafir, dan mereka tidak mendapatkan balasan ini kecuali sesuai dengan apa yang mereka lakukan di dunia berupa penyembahan kepada selain Allah dan kemaksiatan yang mereka praktikkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Maka orang-orang lemah itu menjawab dengan penuh penyesalan dan kegeraman: “Apakah kalian lupa terhadap makar dan tipu daya yang terus menerus kalian lakukan agar kami dapat mengikuti kalian?” Kemudian ketika mereka melihat azab neraka, mereka menyembunyikan penyesalan, dan berharap seandainya dahulu mereka menapaki jalan kebenaran. Lalu Kami belenggu leher orang-orang yang lebih memilih kekafiran sampai kematian mereka, sebagai penghinaan dan balasan yang pantas atas kezaliman mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَقَالَ الَّذِينَ اسْتُضْعِفُوا۟ لِلَّذِينَ اسْتَكْبَرُوا۟ (Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri) Mereka membantah jawaban yang diberikan kepada mereka dan menolak apa yang mereka tuduhkan bahwa merekalah yang menghalangi diri mereka sendiri. بَلْ مَكْرُ الَّيْلِ وَالنَّهَارِ(“(Tidak) sebenarnya tipu daya(mu) di waktu malam dan siang) Makna (المكر) yakni makar dan tipu daya. Yakni akan tetapi tipu daya kalian sepanjang siang dan malam, serta ajakan kalian yang terus menerus kepada kami untuk menuju kekafiran adalah yang menjerumuskan kami kepada hal ini. إِذْ تَأْمُرُونَنَآ أَن نَّكْفُرَ بِاللهِ وَنَجْعَلَ لَهُۥٓ أَندَادًا ۚ( ketika kamu menyeru kami supaya kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya”) Yakni menjadikan sekutu dan tandingan bagi-Nya. وَأَسَرُّوا۟ النَّدَامَةَ لَمَّا رَأَوُا۟ الْعَذَابَ(Kedua belah pihak menyatakan penyesalan tatkala mereka melihat azab) Yakni kedua golongan itu menyesal atas kekafiran yang telah mereka lakukan, namun mereka menyembunyikan penyesalan ini dari orang lain. Atau satu golongan menyembunyikan penyesalan ini dari golongan lain agar tidak menjadi bahan tertawaan mereka. Namun penyesalan itu nampak pada wajah mereka. وَجَعَلْنَا الْأَغْلٰلَ فِىٓ أَعْنَاقِ الَّذِينَ كَفَرُوا۟ ۚ( Dan kami pasang belenggu di leher orang-orang yang kafir) Yakni belenggu besi dikalungkan pada leher mereka di neraka. هَلْ يُجْزَوْنَ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ(Mereka tidak dibalas melainkan dengan apa yang telah mereka kerjakan) Berupa perbuatan syirik kepada Allah dan membuat tipu daya terhadap dakwah kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Orang-orang lemah itu pun menjawabi mereka: “Kejahatan Kami bukanlah pilihan kami, melainkan tipu daya kalian kepada kami pada malam dan siang hari, serta ajakan kalian yang terus menerus menuju kekufuran. Itulah yang kami tanggung. (Al-Makru adalah tipuan dan muslihat) Ketika kalian memerintah kami untuk mengingkari Allah dan membuat sekutu-sekutu yang menyerupainya”. Mereka menutupi penyesalan atas kekufuran yang mereka perbuat saat menyaksikan azab yang disiapkan untuk mereka. Kami membuat belenggu (ikatan atau rantai besi) di leher-leher orang-orang kafir itu di neraka. Mereka tidak dibalas (Istifham di dalamnya mengandung makna nafi) yaitu mereka tidak akan dibalas kecuali dengan sesuatu yang mereka kerjakan di dunia berupa menyekutukan Allah dan berbuat munkar?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri,“Sebenarnya tipu daya pada waktu malam dan siang} tipu daya kalian terhadap kami pada malam dan siang hari {ketika kalian menyuruh kami agar ingkar kepada Allah dan menjadikan bagiNya tandingan-tandingan} sekutu-sekutu untuk disembah {mereka menyembunyikan penyesalan} menyembunyikan penyesalan {ketika melihat azab dan Kami pasangkan belenggu} belenggu {di leher orang-orang yang ingkar {Mereka tidak akan dibalas, melainkan dengan apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Maka berkatalah, “orang-orang yang tertindas kepada orang-orang yang menyombongkan diri, ‘(Tidak) sebenarnya tipu daya di waktu malam dan siang, ketika kamu menyeru kami supaya kami kafir kepada Allah dan menjadikan sekutu-sekutu bagiNYa,” maksudnya sebenarnya yang telah membuat kami terperdaya adalah disebabkan kalian dan kami menjadi sesat seperti ini adalah karena tipu daya yang kalian lakukan terhadap kami, siang dan malam, yaitu ketika kalian memperindah kekafiran bagi kami, dan kalian mengajak kami kepadanya, kalian mengatakan, “Ini yang benar!” Dan kalian menjelek-jelekkan yang haq, mencelanya dan menganggap bahwa yang haq itu adalah kebatilan. Kalian terus melancarkan tipudaya kepada kami hingga akhirnya kalian berhasil menyesatkan dan memfitnah kami. Namun saling menyalahkan itu sama sekali tidak berguna bagi mereka, kecuali saling berlepas diri satu sama lain dan penyesalan besar. Maka dari itu, Allah berfirman “Kedua belah pihak menyatakan penyesalan tatkala mereka melihat azab.” Maksudnya, protes yang dilakukan oleh sebagian mereka terhadap yang lain untuk selamat dari azab itu pun sirna, dan maisng-masing mengetahui bahwa dirinya zhalim, dan pantas mendapat azab. Maka maisng-masing merasa sangat menyesal dan berkhayal kalau saja dahulu dia berpegang teguh pada yang haq dan meninggalkan kebatilan yang telah mengantarkannya kepada azab ini. Hal ini mereka katakan secara tersembunyi di dalam hati mereka karena takut celaan karena telah mengakui (keburukan sendiri)! Kelak di beberapa posisi pada Hari Kiamat dan pada saat mereka masuk neraka, mereka akan menampakkan penyesalannya secara jelas, \"Dan (ingatlah) hari (ketika itu) orang yang lalim menggigit dua tangannya, seraya berkata: \"Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul.\" Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab (ku).\" (Al-Furqon : 27-28) \"Dan mereka berkata: \"Sekiranya kami mendengarkan atau memikirkan (peringatan itu) niscaya tidaklah kami termasuk penghuni-penghuni neraka yang menyala-nyala\". Mereka mengakui dosa mereka. Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala.\" (Al-Mulk:10-11). “Dan Kami pasang belenggu di leher orang-orang yang kafir.” Mereka dibelenggu sebagaimana nara pdana dibelenggu, dan akan diperlakukan dengan hina di dalam penjaranya, sebagaimana Firman Allah, \"ketika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret, ke dalam air yang sangat panas, kemudian mereka dibakar dalam api,\" (Ghafir: 71-72). “Tidaklah mereka dibalas,” di dalam azab, hukuman dan belenggu berat ini “melainkan dengan apa yang telah mereka kerjakan.” Yaitu kekafiran, kafasikan, dan kedurhakaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 33: Maka dibantahlah oleh para pengikutnya dengan berkata : Justru kalian yang menipu kami, dan bermakar terhadap kami siang dan malam, kalian hiasi kekufuran yang kalian tawarkan kepada kami, kalian perintahkan kami berbuat kesyririkan kepada Allah dan mendustakan Rasulullah ﷺ, sehingga kami menjadikan tandingan-tandingan Allah dan berpaling dari ibadah kepada selain Allah; Maka ketika setiap kubu saling menyalahkan, maka tidaklah berpengaruh terhadap adzab bagi mereka; Dalam hati mereka terdapat penyesalan, dan juga kesedihan yang sangat pada diri-diri mereka ketika mereka telah melihat apa yang mereka telah lihat dari adzab dan siksaan. Dan di antara adzab yang mereka terima adalah mereka dibelenggu dengan besi yang melilit leher-leher mereka. Kemudian Allah mengabarkan urusan mereka dengan berkata : Tidaklah mereka orang-orang musyrik dibalas dengan adzab kecuali karena sebab kesyirikan mereka, dan menyimpang dari jalan Allah serta mengikuti dai-dai yang menentang syariat Allah dan para imam yang sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bahkan yang membuat kami seperti ini adalah makar kamu di malam dan siang hari karena kamu menghias kekafiran kepada kami di malam dan siang hari serta mengajak kami kepadanya, dan kamu katakan, bahwa yang demikian adalah benar, kamu cacatkan yang sesungguhnya benar, memperburuknya dan mengatakan bahwa ia adalah batil. Makarmu senantiasa kamu lancarkan kepada kami sehingga kami tersesat dan terfitnah. Pelemparan kesalahan itu pun tidak berfaedah apa-apa selain membuat mereka saling berlepas diri dan menambah penyesalan semata sebagaimana pada lanjutan ayatnya. Perdebatan antara mereka yang dilakukan untuk menyelamatkan diri dari azab pun selesai dan mereka pun tahu bahwa mereka telah berbuat zalim dan pantas mendapat azab, maka masing-masing dari mereka menyesal dan berangan-angan bahwa mereka dahulu di atas kebenaran serta meninggalkan kebatilan yang membuat mereka sampai kepada azab itu. Mereka sembunyikan penyesalan itu dalam hati mereka karena takut terbongkarnya aib jika mengakuinya, demikian pula mereka tetap tidak mengakuinya pada saat berada di sebagian tempat perhentian pada hari Kiamat. Akan tetapi, ketika mereka masuk ke dalam neraka, mereka tampakkan penyesalan itu. Mereka berkata, “Sekiranya Kami mendengarkan atau memikirkan (peringatan itu) niscaya tidaklah kami termasuk penghuni-penghuni neraka yang menyala-nyala. -- Mereka mengakui dosa mereka. Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala.” ( Terj. Al Mulk: 10-11) Mereka dibelenggu sebagaimana orang yang dipenjara dibelenggu, di mana dia akan dihinakan dalam penjara itu. Allah Subhaanahu wa Ta'aala berfirman, “Ketika belenggu dan rantai dipasang di leher mereka, sambil diseret,-- Ke dalam air yang sangat panas, kemudian mereka dibakar dalam api,” (Terj. Al Mu’min: 71-72) Nas’alullahas salaamah wal ‘aafiyah fiddunyaa wal aakhirah. Berupa kekafiran, kefasikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 33",
    "description": "Mendengar ucapan para pemimpin mereka, para pengikut kembali membantah. Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri, 'tidak! sebenarnya tipu daya-Mu pada waktu malam dan siang-lah yang menghalangi kami dari petunjuk, ketika kamu terus-menerus menyeru kami agar kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya. ' usai berbantah-bantahan, mereka, yakni kedua para pemimpin dan pengikut, bersama-sama menyatakan penyesalan ketika mereka melihat azab. Penyesalan mereka sama sekali tidak berguna. Dan di neraka kami pasangkan belenggu di leher orang-orang yang kafir sebagai hukuman atas kedurhakaan mereka. Mereka tidak dibalas melainkan sesuai dengan apa yang telah mereka kerjakan di dunia. 34. Nabi Muhammad sempat khawatir karena dakwahnya ditolak dan dihalang-halangi oleh kaum musyrik mekah. Allah lantas menghibur beliau dengan firman-Nya, 'dan setiap kami mengutus seorang pemberi peringatan kepada penduduk suatu negeri tempat rasul diutus, pasti orang-orang yang hidup mewah di negeri itu berkata, 'kami benar-benar mengingkari, tidak percaya, dan menolak apa yang kamu sampaikan se-bagai utusan/risalah yang kamu bawa. '."
  }
]