[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak mengutus di sebuah negeri seorang rasul yang mengajak kepada mentauhidkan Allah dan mengesakanNya dengan ibadah, kecuali orang-orang dari penduduknya yang tenggelam dalam hawa nafsu dan syahwat berkata, “Sesungguhnya kami mengingkari apa yang kalian bawa (wahai para rasul).”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. \"Tidaklah Kami mengutus ke salah satu negeri seorang Rasul yang memperingatkan mereka dari azab Allah kecuali orang-orang yang hidup bergelimang kenikmatan di sana dari para pemegang kekuasaan, kedudukan dan harta kekayaan berkata, “Sesungguhnya kami kafir (ingkar) kepada apa yang kalian bawa -wahai para Rasul-.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-37. Dan tidaklah Kami mengutus seorang rasul kepada sebuah negeri untuk memberi peringatan kepada penduduknya, melainkan orang-orang yang hidup dalam kemewahan akan segera mendustakannya, dan menyatakan kekafiran dan penentangan terhadapnya; dan mereka merasa tidak akan mendapat azab, sebab di dunia mereka memiliki banyak harta dan keturunan yang mereka kira dapat menjadi sebab keselamatan. Namun itu merupakan pemikiran yang menyimpang. Hai Muhammad, katakanlah kepada mereka: “Keluasan dan kesempitan rezeki merupakan urusan Allah, akan tetapi kebanyakan mereka tidak memahami hal yang sebenarnya. Keluasan dan kesempitan rezeki bukan merupakan bukti dari apa yang mereka katakan; harta dan keturunan bukanlah hal yang dapat mendekatkan seseorang kepada Allah, kecuali bagi orang yang beriman dan beramal shalih, dan menjadikan harta dan keturunannya sebagai jalan untuk mencapai keridhaan Allah; maka mereka itu akan mendapat balasan yang berlipat-ganda berkat keimanan, keshalihan, dan perbuatan mereka dalam memenuhi hak dari harta dan keturunan; mereka akan mendapatkan keridhaan dan berada dalam istana-istana surga yang tinggi, mendapat segala kenikmatan dan selamat dari segala kekurangan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. إِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كٰفِرُونَ (“Sesungguhnya kami mengingkari apa yang kamu diutus untuk menyampaikannya”) Yakni kami tidak percaya terhadap tauhid dan keimanan yang kalian diutus untuknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kami tidak mengutus kepada penduduk suatu negeri seorang rasul yang memberi peringatan mereka tentang hukuman Allah kecuali orang-orang kaya dan pemimpin-pemimpin buruk di dalamnya berkata: “Sesungguhnya kami mendustakan apa yang diutus kepadamu, yaitu ilmu tauhid dan keimanan.” Ayat ini diturunkan untuk seorang laki-laki yang meminta temannya untuk meninggalkan Muhammad, lalu berkata kepadanya: “Sesungguhnya tidak ada suku Quraisy yang mengikutinya kecuali orang-orang buangan dan orang-orang miskin” Melalui hal itu dia mengetahui bahwa dia adalah nabi yang haq lalu mengimaninya. Maka turunlah ayat ini dan Nabi SAW berkata kepadanya: “Sesungguhnya Allah telah menurunkan pembenaran atas ucapanku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus pemberi peringatan ke suatu negeri, kecuali orang-orang yang hidup mewah} orang-orang mendapat nikmat di sana {berkata,“Sesungguhnya kami ingkar pada yang diutus kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Allah memberitakan tentang keadaan umat-umat terdahulu yang mendustakan para Rasul, keadaannya seperti keadaan orang-orang yang mendustakan Rasul mereka saat ini, yaitu Muhammad; dan bahwa Allah, apabila mengutus Rasul di salah satu kota, maka kaum yang hidup mewah di negeri itu mendustakannya, kemewahannya yang mereka miliki membuat mereka congkak dan mereka berbangga-bangga dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 34: Allah menghibur Nabi-Nya ﷺ dengan berkata : Tidaklah diutus pada suatu negeri dari para Rasul kecuali mereka memerintahkan dengan tauhid, dan mengancam, memperingatkan, melarang dari syirik; Kecuali orang-orang yang kaya dan penuh kemewahan yang berkata : Sungguh kami dengan apa yang diutus oleh Allah, kami mendustakan dan menolaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan umat-umat terdahulu yang mendustakan para rasul bahwa keadaannya sama seperti orang-orang yang pada saat itu mendustakan Rasul mereka Muhammad shallallahu 'alaihi wa sallam, di mana Allah Subhaanahu wa Ta'aala ketika mengutus seorang rasul di satu tempat selalu saja diingkari oleh orang-orang yang hidup mewah lagi menyombongkan diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 34",
    "description": "Nabi Muhammad sempat khawatir karena dakwahnya ditolak dan dihalang-halangi oleh kaum musyrik mekah. Allah lantas menghibur beliau dengan firman-Nya, 'dan setiap kami mengutus seorang pemberi peringatan kepada penduduk suatu negeri tempat rasul diutus, pasti orang-orang yang hidup mewah di negeri itu berkata, 'kami benar-benar mengingkari, tidak percaya, dan menolak apa yang kamu sampaikan se-bagai utusan/risalah yang kamu bawa. '35. Penolakan itu dibarengi kesombongan dan keangkuhan akibat kekayaan dan keturunan yang Allah anugerahkan kepada mereka. Dan mereka berkata, 'kami memiliki lebih banyak harta dan anak-anak daripada kamu, dan kami tidak akan diazab sebab Allah mengasihi kami. Dia memberi kami limpahan nikmat yang besar di dunia ini dan membebaskan kami dari azab di akhirat nanti. ' sungguh, hal itu hanyalah dugaan mereka yang tenggelam dalam kenikmatan duniawi."
  }
]