[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata, “Kami lebih banyak harta dan anak daripada kalian, dan Allah tidak memberikan nikmat-nikmat ini kepada kami kecuali karena Dia ridha kepada kami, dan kami tidak akan disiksa di dunia dan di akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Para pemilik kedudukan itu mengajukan alasan dengan penuh kebanggaan dan kesombongan, \"Kami memiliki harta dan anak-anak yang lebih banyak, sedangkan apa yang kalian katakan bahwa kami akan diazab adalah dusta. Kami tidak akan diazab di dunia dan di Akhirat.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَقَالُوا۟ نَحْنُ أَكْثَرُ أَمْوٰلًا وَأَوْلٰدًا وَمَا نَحْنُ بِمُعَذَّبِينَ (Dan mereka berkata: “Kami lebih banyak mempunyai harta dan anak-anak (daripada kamu) dan kami sekali-kali tidak akan diazab) Yakni Allah melebihkan kami dengan harta dan anak keturunan di dunia daripada kalian, dan ini menunjukkan bahwa Allah telah meridhai agama yang kami anut, dan kami tidak akan disiksa di akhirat karena Allah telah berbuat baik kepada kami dan meridhai kami di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Orang-orang yang bermewah-mewahan berkata kepada para rasul: “Kami memiliki lebih banyak harta dan anak daripada para pengikutmu yang berasal dari orang-orang lemah. Kami juga tidak akan diazab di akhirat setelah kebaikanNya yang diberikan kepada kami di dunia” Sesungguhnya mereka membagi urusan akhirat dengan dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} orang-orang yang mendapat kemewahan berkata {“Kami memiliki lebih banyak harta dan anak dan kami tidak akan diazab”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Dan mereka berkata, ‘Kami lebih banyak mempunyai harta dan anak-anak’,” maksudnya, lebih banyak daripada orang-orang yang mengikuti kebenaran, “dan kami sekali-kali tidak akan diazab.” Pertama, kami tidak akan dihidupkan kembali; dan jika kami dihidupkan kembali, maka Tuhan yang telah memberi kami harta kekayaan dan anak-anak di dunia akan memberi kami lebih banyak lagi di akhirat kelak dan Dia tidak akan menyiksa kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 35: Berkata orang-orang kafir dan musyrik Mekkah yang mereka berkehidupan mewah dari kalangan orang-orang yang memiliki tahta dan harta kepada orang-orang faqir dari sebagian orang-orang yang beriman yang lemah, mereka berkata dengan kuasanya : Kami lebih banyak dibandingkan dalam harta dan anak dibandingkan kalian, maka tidak ada yang mengadzab kami di akhirat jika memang di sana ada akhirat. Ini adalah pengingkaran mereka terhadap hari kebangkitan dan pembalasan. Allah telah mengisahkan semisal ucapan mereka dalam surat Al Mukminun 55-56."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, oleh karena orang-orang kafir itu mendapat nikmat yang besar di dunia, maka berarti mereka dikasihi oleh Allah dan tidak akan diazab di akhirat. Maka Allah Subhaanahu wa Ta'aala menjawab pada ayat selanjutnya, bahwa Dia melapangkan rezeki dan membatasinya bukanlah menunjukkan seperti yang mereka sangka, karena rezeki di bawah kehendak Allah, jika Dia menghendaki, maka Dia melapangkannya kepada hamba-Nya dan jika Dia menghendaki, maka Dia membatasinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 35",
    "description": "Penolakan itu dibarengi kesombongan dan keangkuhan akibat kekayaan dan keturunan yang Allah anugerahkan kepada mereka. Dan mereka berkata, 'kami memiliki lebih banyak harta dan anak-anak daripada kamu, dan kami tidak akan diazab sebab Allah mengasihi kami. Dia memberi kami limpahan nikmat yang besar di dunia ini dan membebaskan kami dari azab di akhirat nanti. ' sungguh, hal itu hanyalah dugaan mereka yang tenggelam dalam kenikmatan duniawi. 36. Membantah dugaan tersebut, Allah berfirman, 'katakanlah kepada mereka, wahai nabi Muhammad, 'sungguh, tuhanku melapangkan rezeki bagi siapa yang dia kehendaki dan membatasinya bagi siapa yang dia kehendaki, tidak peduli dia mukmin ataupun kafir. Tetapi, kebanyakan manusia tidak mengetahui hikmah dari ketetapan Allah itu. Ba-Nyak atau sedikitnya rezeki tidak berbanding lurus dengan kecintaan Allah kepada seseorang atau kedudukannya di sisi Allah (lihat juga: al-Mu'min'n/23: 55'56 dan at-tag'bun/64: 15). '."
  }
]