[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah kepada mereka (wahai rasul), “Sesungguhnya tuhanku melapangkan rizki bagi siapa yang Dia kehendaki diantara hamba-hambaNya, bukan karena cinta atau benci, namun Dia melakukan itu sebagai ujian, tetapi kebanyakan manusia tidak menyadari bahwa hal itu adalah ujian bagi hamba-hambaNya, karena mereka tidak memperhatikan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Katakanlah -wahai Rasul- kepada orang-orang yang tertipu oleh kenikmatan yang mereka dapatkan, \"Tuhanku melapangkan rezeki bagi siapa yang Dia kehendaki sebagai ujian baginya, apakah dia bersyukur atau kufur, dan menyempitkan rezeki atas siapa yang Dia kehendaki untuk mengujinya apakah dia sabar atau tidak. Akan tetapi kebanyakan manusia tidak mengetahui bahwa Allah Maha Bijaksana, tidak menakdirkan sesuatu kecuali karena hikmah mendalam yang diketahui oleh siapa yang mengetahuinya dan tersembunyi bagi siapa yang tidak mengetahui.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. قُلْ إِنَّ رَبِّى يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ (Katakanlah: “Sesungguhnya Tuhanku melapangkan rezeki bagi siapa yang dikehendaki-Nya) Yakni bagi siapa yang dikehendaki untuk dilapangkan. وَيَقْدِرُ(dan menyempitkan) Yakni menyempitkan rezeki bagi siapa yang dikehendaki-Nya untuk disempitkan. Dan kelapangan rezeki yang diberikan Allah bukanlah bukti bahwa Dia telah meridhainya dan meridhai amalannya, bukan pula kesempitan rezeki merupakan bukti bahwa Allah tidak meridhainya dan amalannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Wahai nabi, katakanlah kepada mereka: “Sesungguhnya TuhanKu meluaskan rejeki sebagai suatu ujian untuk orang yang dikehendakiNya dan menyembitkannya sebagai cobaan, namun kebanyakan manusia tidak mengetahui hakikatnya sehingga mereka beranggapan bahwa harta dan anak banyak itu suatu kehormatan dan kemuliaan. Padahal itu untuk menggoda.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya Tuhanku melapangkan} melapangkan {rezeki kepada siapa saja yang Dia kehendaki dan menyempitkan} menyempitkan atas siapa saja yang Dia kehendaki {Akan tetapi kebanyakan manusia tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Mereka di jawab oleh Allah, bahwa dilapangkan atau disempitkannya rizki itu bukan bukti atas apa yang kalian klaim, sebab sesungguhnya rizki itu di bawah kendali masyi’ah (kehendak) Allah. Jika Dia berkehendak, maka Dia melapangkannya dan jika Dia berkehendak lain, maka Dia menyempitkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 36: Allah di dalam ayat ini Allah memerintahkan Nabi-Nya ﷺ agar berkata kepada mereka orang-orang yang sombong dan tertipu terhadap dirinya sendiri : Ketahuilah wahai orang-orang yang kafir, bahwa Allah adalah Tuhan atas segala urusan, yang membentangkan rezeki bagi siapa yang dikehendaki dari hamba-hamba-Nya yang beriman dan kafir, dan menyempitkan rezeki bagi siapa yang dikehendaki dari hamba-Nya yang beriman dan kafir; Sebagai ujian bagi mereka dengan sebab rasa syukur mereka ketika Allah memberikan rezeki kepada mereka, juga sebagai cobaan kesabaran bagi orang-orang yang diberikan kesempitan rezeki. Semua itu adalah di bawah kehendak Allah yang dibangun di atas hikmah yang terang, akan tetapi manusia tidak mengetahui siapa yang memberikan harta, kemuliaan dan tahta, yang mungkin saja menjadi istidraj atau sebagai ujian; Karena sebab mereka tidak mengetahui maksud dari keinginan Allah dan rahasia yang tersembunyi di balik ciptaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai ujian. Sebagai cobaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 36",
    "description": "Membantah dugaan tersebut, Allah berfirman, 'katakanlah kepada mereka, wahai nabi Muhammad, 'sungguh, tuhanku melapangkan rezeki bagi siapa yang dia kehendaki dan membatasinya bagi siapa yang dia kehendaki, tidak peduli dia mukmin ataupun kafir. Tetapi, kebanyakan manusia tidak mengetahui hikmah dari ketetapan Allah itu. Ba-Nyak atau sedikitnya rezeki tidak berbanding lurus dengan kecintaan Allah kepada seseorang atau kedudukannya di sisi Allah (lihat juga: al-Mu'min'n/23: 55'56 dan at-tag'bun/64: 15). '37. Allah membantah keyakinan orang kafir tersebu. Kedudukan seseorang di sisi Allah tidak ditentukan oleh harta dan keturunannya, melainkan iman dan takwanya. Harta dan anak akan bermanfaat bila ia membantu seseorang untuk meningkatkan keimanan dan amal salehnya. Dan bukanlah harta atau anak-anakmu yang mendekatkan kamu kepada kami; melainkan keimanan dan ketakwaanmu. Karena itu, orang-orang yang beriman dan mengerjakan kebajikan, mereka itulah yang dekat dengan kami dan memperoleh balasan yang berlipat ganda, sepuluh kali, tujuh ratus kali, bahkan tidak terbatas, atas apa yang telah mereka kerjakan; dan mereka dalam keadaan aman sentosa di tempat-tempat yang tinggi dalam surga."
  }
]