[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukan harta dan anak-anak kalian yang mendekatkan kedudukan kalian di sisi Kami dan meninggikan derajat kalian, akan tetapi siapa yang beriman kepada Allah dan beramal shalih, maka mereka mendapatkan pahala kebaikan yang berlipat ganda, satu kebaikan dibalas dengan sepuluh kebaikan hingga tambahan yang dikehendaki oleh Allah. mereka berada di tempat-tempat yang tinggi di surga, aman dari siksa, kematian dan kesedihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Harta dan anak-anak yang kalian banggakan bukanlah wasilah yang bisa mendekatkan kalian kepada rida Allah, akan tetapi siapa yang beriman kepada Allah dan beramal saleh, dialah yang merengkuh pahala yang berlipat. Harta bisa mendekatkan pemiliknya kepada Allah bila dia menginfakkannya di jalan Allah, sedangkan anak-anak dengan mereka mendoakannya. Mereka orang-orang Mukmin yang beramal saleh mendapatkan pahala berlipat ganda dari kebaikan-kebaikan yang mereka kerjakan, karena kebaikan-kebaikan dilipatgandakan bagi mereka, mereka berada di dalam tempat-tempat yang tinggi di Surga dalam keadaan aman dari segala yang mereka khawatirkan berupa azab, kematian dan terputusnya kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَمَآ أَمْوٰلُكُمْ وَلَآ أَوْلٰدُكُم بِالَّتِى تُقَرِّبُكُمْ عِندَنَا زُلْفَىٰٓ (Dan sekali-kali bukanlah harta dan bukan (pula) anak-anak kamu yang mendekatkan kamu kepada Kami sedikitpun) Yakni bukanlah harta dan keturunan yang banyak adalah hal yang dapat mendekatkan kalian kepada rahmat dan karunai Kami, namun harta dan keturunan kalian adalah ujian dan cobaan agar Kami mengetahui siapa yang menggunakannya untuk ketaatan kepada Allah dan siapa yang menggunakannya untuk bermaksiat kepada Allah. إِلَّا مَنْ ءَامَنَ وَعَمِلَ صٰلِحًا(etapi orang-orang yang beriman dan mengerjakan amal-amal (saleh)) Yakni akan tetapi orang yang beriman dan beramal shalih dan menggunakan harta yang Allah berikan kepadanya untuk berbuat ketaatan adalah hal yang dapat mendekatkannya kepada Kami; demikian pula anak yang ia bimbing di atas ketaatan kepada Allah. فَأُو۟لٰٓئِكَ لَهُمْ جَزَآءُ الضِّعْفِ بِمَا عَمِلُوا۟( mereka itulah yang memperoleh balasan yang berlipat ganda disebabkan apa yang telah mereka kerjakan) Yakni balasan kebaikan yang berlipat ganda. وَهُمْ فِى الْغُرُفٰتِ ءَامِنُونَ(dan mereka aman sentosa di tempat-tempat yang tinggi) Yakni aman dari segala yang mereka tidak inginkan. Dan yang dimaksud adalah dalam tempat-tempat tinggi di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Wahai orang-orang kafir, banyaknya harta dan anak yang menyebabkan kesombongan dan kesewenang-wenangan kalian itu tidaklah sesuatu yang mendekatkan kalian dengan rahmat dan keutamaan Kami, melainkan untuk menguji dan mengetahui tujuan penggunaannya, dalam ketaatan atau kemaksiatan. Akan tetapi, orang yang beriman kepada Allah dan rasulNya serta mengerjakan amal shalih yang Kami perintahkan, maka bagi mereka itu balasan serupa sebanyak 10 kali lipat untuk kebaikan mereka. Dan dalam bilik-bilik surga, mereka merasa aman dari segala sesuatu yang mereka benci berupa kematian dan lainnya. Az-Zulfa adalah kedekatan. Kata yang dihadirkan untuk menegaskan fiil sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Harta atau anak-anak kalian tidaklah sesuatu yang mendekatkan kalian kepada Kami sedekat-dekatnya} sedekat-dekatnya {melainkan orang yang beriman dan beramal shalih. Mereka itulah yang memperoleh balasan yang berlipat ganda}pahala yang berlipat ganda {atas apa yang mereka kerjakan. Mereka di tempat-tempat yang tinggi itu} di tempat-tempat tinggi di surga {merasa aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Bukan harta benda dan anak-anak “yang” mendekatkan kamu kepada Allah “sedekat-dekatnya.” Sesungguhnya yang mendekatkan kepadaNYa adalah kedekatan iman kepada ajaran yang dibawa oleh para Rasul dan amal shalih yang merupakan konsekuensi iman. Maka orang-orang seperti ini mendapatkan balasan di sisi Allah dengan berlipat-lipat ganda, satu kebaikan dibalas dengan sepuluh hingga tujuh ratus kali lipat, dan dilipatgandakan dengan banyak yang jumlahnya hanya Allah semata yang mengetahui, “dan mereka aman sentosa di tempat-tempat yang tinggi,” maksudnya, mereka berada pada kedudukan-kedudukan yang sangat tinggi sekali, mereka tinggal di dalamnya dengan rasa tenang. Mereka aman dari hal-hal yang mencemarkan dan menyengsarakan, karena kelezatan dan berbagai hal yang menyenangkan yang ada di dalamnya, dan aman dari (bahaya) keluar darinya serta dari rasa sedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 37: Ketahuilah wahai manusia bahwa harta-harta kalian dan anak-anak kalian bukanlah sebagai pengangkat derajat kalian yang mendekatkan diri di sisi Allah, akan tetapi yang mendekatkan kepada Allah adalah keimanan kepada Allah dan membenarkan Rasul-Nya ﷺ serta apa yang dikerjakan dalam amalan shalih. Dan mereka yang beriman kepada Allah dan beramal shalih, Allah akan gandakan pahala atas amalan mereka, sebagaimana Allah mengabarkan bahwa kebaikan akan dibalas dengan sepuluh kebaikan semisal dengannya. Mereka adalah orang-orang yang derjatnya paling tinggi di surga dan derajat yang terendah dari surga adalah mereka yang beriman dengan tenang yang dijauhkan dari adzab, semua itu tergantung atas kehidupan mereka di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Harta dan anak tidaklah yang mendekatkan seseorang kepada Allah Subhaanahu wa Ta'aala, bahkan yang mendekatkan seseorang kepada Allah adalah iman dan amal saleh. Mereka itulah yang mendapatkan balasan berlipat ganda di sisi Allah. Satu kebaikan mendapatkan sepuluh kebaikan sampai tujuh ratus, bahkan sampai kelipatan yang banyak yang tidak diketahui kecuali oleh Allah. Baik dari maut, bahaya maupun lainnya. Mereka merasakan keamanan, ketenteraman dan kedamaian, serta memperoleh berbagai kenikmatan dan kesenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 37",
    "description": "Allah membantah keyakinan orang kafir tersebu. Kedudukan seseorang di sisi Allah tidak ditentukan oleh harta dan keturunannya, melainkan iman dan takwanya. Harta dan anak akan bermanfaat bila ia membantu seseorang untuk meningkatkan keimanan dan amal salehnya. Dan bukanlah harta atau anak-anakmu yang mendekatkan kamu kepada kami; melainkan keimanan dan ketakwaanmu. Karena itu, orang-orang yang beriman dan mengerjakan kebajikan, mereka itulah yang dekat dengan kami dan memperoleh balasan yang berlipat ganda, sepuluh kali, tujuh ratus kali, bahkan tidak terbatas, atas apa yang telah mereka kerjakan; dan mereka dalam keadaan aman sentosa di tempat-tempat yang tinggi dalam surga. 38. Dan sebaliknya, orang-orang yang terus berusaha menentang ayat-ayat kami untuk melemahkan, yakni menggagalkan azab kami, mereka itu dimasukkan ke dalam azab yang pedih, yakni neraka. Mereka kekal di dalamnya."
  }
]