[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang berusaha membatalkan hujjah-hujjah Kami dan menghalang-halangi dari jalan Allah, seraya menentang dan melawan, mereka berada dalam azab Jahanam di Hari Kiamat, para malaikat Zabaniyah menyeret mereka ke dalamnya dan mereka tidak akan keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Orang-orang kafir yang mengerahkan segala daya dan upaya mereka demi memalingkan manusia dari ayat-ayat Kami dan berusaha mewujudkan tujuan-tujuannya, mereka itu merugi di dunia dan bakal diazab di akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Adapun orang-orang yang mendustakan ayat-ayat Allah dan menentang orang yang beriman dan menyeru kepada ayat-ayat-Nya, dengan anggapan akan selamat dari balasan Kami; maka mereka itu adalah orang-orang yang jauh dari rahmat Allah dan selalu dalam azab neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَالَّذِينَ يَسْعَوْنَ فِىٓ ءَايٰتِنَا (Dan orang-orang yang berusaha (menentang) ayat-ayat Kami) Yakni senantiasa melawan dan menjelek-jelekkannya. مُعٰجِزِينَ(dengan anggapan untuk dapat melemahkan (menggagalkan azab Kami)) Yakni merasa bahwa mereka dapat lolos dari Kami. أُو۟لٰٓئِكَ فِى الْعَذَابِ مُحْضَرُونَ(mereka itu dimasukkan ke dalam azab) Yakni para penjaga neraka akan memasukkan mereka ke dalam azab, dan mereka tidak akan mendapatkan jalan untuk lari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan orang-orang yang berusaha menentang ayat-ayat Al-Qur’an, menghujatnya dan mendustakannya dengan cara berlomba-lomba melebihi Kami, mereka mengira bisa lari dari Kami. Dalam azab akhirat, mereka itu diseret oleh malaikat Zabaniyah menuju neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berusaha (menentang) ayat-ayat Kami untuk melemahkan} melakukan sesuatu untuk menentang ayat Kami itu beranggapan bahwa mereka bisa melepaskan diri dari Kami {mereka itu dihadirkan di dalam azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. SEdangkan orang-orang yang berusaha untuk melemahkan ayat-ayat Kami dengan maksud mengalahkan Kami dan Rasul Kami serta mendustakan, “mereka itu dimasukkan ke dalam azab.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 38: Adapun bagi mereka yang berbuat dosa yang berusaha menolak ayat-ayat Allah yang ada di dalam Al Qur’an, dan memalingkan manusia dari jalan Allah; Yang mereka menyangka akan dibalas oleh Allah dengan makar mereka dan kejelekkan mereka; Maka perhatikan, bahwa malaikat zabaniyyah akan mendatangi mereka pada hari kiamat dan memasukkan mereka dalam jahannam yang tidak akan mereka keluar darinya selamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 38",
    "description": "Dan sebaliknya, orang-orang yang terus berusaha menentang ayat-ayat kami untuk melemahkan, yakni menggagalkan azab kami, mereka itu dimasukkan ke dalam azab yang pedih, yakni neraka. Mereka kekal di dalamnya. 39. Dalam ayat ini Allah kembali mempertegas bahwa banyak dan sedikitnya rezeki seseorang tidak menentukan kedudukannya di sisi Allah, kecuali bila dibarengi dengan iman dan amal saleh. Katakanlah, wahai nabi Muhammad, 'sungguh, tuhanku melapangkan rezeki dan membatasinya bagi siapa yang dia kehendaki di antara hamba-hamba-Nya. ' dan rezeki apa saja yang kamu infakkan, maka Allah akan menggantinya di dunia dan akhirat dengan penggantian yang lebih baik, dan dialah pemberi rezeki yang terbaik."
  }
]