[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang yang menyombongkan diri dengan harta dan anak-anak mereka, “Sesungguhnya Tuhanku melapangkan rizki kepada siapa yang Dia kehendaki dari hamba-hambaNya dan menyempitkannya bagi siapa yang Dia kehendaki karena sebuah hikmah yang Dia ketahui.” Apa pun yang kalian berikan bila hal itu diperintahkan Allah, Dia akan menggantinya dengan balasan di dunia dan dengan pahala di akhirat. Allah adalah sebaik-baik pemberi rizki, maka mintalah rizki kepadaNya dan berusahalah dengan sebab-sebab yang Dia perintahkan kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Katakanlah -wahai Rasul-, \"Sesungguhnya Tuhanku melapangkan rezeki bagi siapa yang Dia kehendaki dari hamba-hamba-Nya dan menyempitkannya atas siapa yang Dia kehendaki dari mereka. Apa pun yang kalian infakkan di jalan Allah, maka Allah -Subḥānahu wa Ta'ālā- akan menggantinya untuk kalian di dunia dengan memberikan sesuatu yang lebih baik darinya kepada kalian, dan di Akhirat Allah memberi kalian pahala yang besar. Dan Allah -Subḥānahu- adalah sebaik-baik pemberi rezeki. Siapa mencari rezeki maka hendaknya memintanya kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Hai Muhammad, katakanlah kepada mereka: “Tuhanku membuka pintu rezeki bagi hamba-hamba-Nya yang Dia kehendaki, dan menutupnya dari siapa yang Dia kehendaki pula dengan banyak hikmah yang besar di balik semua itu. Dan harta yang kalian infakkan dalam bentuk infak wajib maupun sunnah pada suatu pintu kebaikan, maka Allah akan mengganti harta itu. Dia sebaik-baik yang meluaskan rezeki hamba-hamba-Nya, maka mintalah rezeki dari-Nya, dan tempuhlah usaha-usaha untuk mendapatkannya, serta bersedekahlah niscaya kalian akan mendapat gantinya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَمَآ أَنفَقْتُم مِّن شَىْءٍ (Dan barang apa saja yang kamu nafkahkan) Yakni mereka infakkan untuk berbuat kebaikan yang telah Allah perintahkan dalam kitab-Nya dan yang telah Rasulullah terangkan. فَهُوَ يُخْلِفُهُۥ ۖ( maka Allah akan menggantinya) Yakni Allah akan menggantinya bagi kalian, entah itu di dunia maupun di akhirat. وَهُوَ خَيْرُ الرّٰزِقِينَ(dan Dialah Pemberi rezeki yang sebaik-baiknya) Dan para hamba yang saling memberi rezeki adalah dengan kemudahan dan ketetapan dari Allah, dan mereka sebenarnya bukanlah yang memberi rezeki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Wahai nabi, katakanlah: “Sesungguhnya Tuhanku melapangkan dan menyempitkan rejeki bagi hambaNya yang dikehendaki. Dan sebagian harta yang kalian nafkahkan untuk mencari ridha Allah dan menaatiNya itu akan diganti dengan suatu pengganti di dunia dan pahala yang melimpah di akhirat. Allah adalah sebaik-baik pemberi rejeki. Maknanya Dia adalah Maha Pemberi Rejeki yang sesungguhnya. Hamba-hambanya hanya sebagai perantara”. Perbedaan ayat ini dan ayat sebelumnya (36) yaitu bahwa ayat ini untuk menjelaskan bahwa rejeki itu hanya dari Allah. Sedangkan ayat sebelumnya menanggapi orang yang berasumsi bahwa rejeki adalah tanda dari keridhaan Allah. Sesungguhnya kelapangan dan kesempitan di ayat ini adalah bagi satu orang dalam dua waktu dan kondisi berbeda. Sedangkan di ayat sebelumnya bagi sejumlah orang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya Tuhanku melapangkan rezeki kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya dan menyempitkannya”} dan menyempitkannya atas siapa saja yang Dia kehendaki {Dan apa pun yang kalian infakkan pasti akan Dia ganti} Dia akan memberi penggantinya {Dialah sebaik-baik pemberi rezeki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Kemudian Allah mengulangi bahwa Dia, “melapangkan rizki bagi siapa yang dikehendakiNya dari hamba-hambaNya dan menyempitkannya,” agar mengakibatkan FirmanNYa berikut ini, “Dan barang apa saja yang kamu nafkahkan,” nafkah yang wajib atau yang sunnah kepada kerabat dekat, tetangga, orang miskin, anak yatim atau lain-lainnya, “maka Dia” “akan menggantinya,” maka jangan kalian berpraduga salah bahwa berinfak itu termasuk hal yang dapat mengurangi rizki. Malah Allah (Dzat Yang melapangkan rizki kepada siapa yang dikehendakiNYa dan menyempitkannya) menjanjikan akan memberi ganti untuk orang yang berinfak “dan Dialah Pemberi rizki yang sebaik-baiknya,” maka mintalah rizki kepadaNYa dan berusahalah dengan menggunakan cara-cara yang diperintahkanNya kepada kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 39: Katakanlah wahai Nabi Allah kepada mereka yang tertipu dengan harta-harta dan anak-anak mereka : Sesungguhnya Tuhanku yang meluaskan rezeki dan menyempitkannya bagi siapa yang dikehendaki-Nya; Sebagai ujian dan hikmah. Kemudian Allah menasihati mereka yang sering berinfak untuk keperluan yang baik, Allah juga mengabarkan bahwa akan mengganti orang-orang yang ikhlas di dunia dengan pahala di akhirat, sebagaimana sabda Nabi ﷺ : Tidaklah berkurang sedekah dari harta. Dialah Allah yang maha memberi rezeki dan kebaikan yang diberikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai ujian dan cobaan. Baik wajib atau sunat, kepada kerabat, tetangga, orang miskin, anak yatim atau selainnya. Yakni janganlah kamu mengira bahwa infak mengurangi rezeki, bahkan Tuhan yang melapangkan dan menyempitkan rezeki berjanji akan menggantinya kepada orang yang berinfak. Maka mintalah rezeki dari-Nya dan kerjakanlah segala sebab yang diperintahkan atau yang mubah, tidak yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 39",
    "description": "Dalam ayat ini Allah kembali mempertegas bahwa banyak dan sedikitnya rezeki seseorang tidak menentukan kedudukannya di sisi Allah, kecuali bila dibarengi dengan iman dan amal saleh. Katakanlah, wahai nabi Muhammad, 'sungguh, tuhanku melapangkan rezeki dan membatasinya bagi siapa yang dia kehendaki di antara hamba-hamba-Nya. ' dan rezeki apa saja yang kamu infakkan, maka Allah akan menggantinya di dunia dan akhirat dengan penggantian yang lebih baik, dan dialah pemberi rezeki yang terbaik. 40. Sebagian kaum musyrik menyembah malaikat karena menduga bahwa malaikat adalah sumber rezeki yang mereka peroleh. Kelak di akhirat orang-orang musyrik akan dipertemukan dengan sembahan mereka tersebut. Dan ingatlah pada hari ketika Allah mengumpulkan mereka semuanya untuk dihisab, kemudian dia berfirman kepada para malaikat, 'apakah kepadamu mereka ini dahulu menyembah'' setujukah kamu dengan penyembahan itu atau bahkan memintanya'."
  }
]