[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Orang-orang kafir yang mengingkari kebangkitan berkata, “ Kiamat tidak akan datang kepada kami.” Katakanlah kepada mereka (wahai Rasul), “Pasti, demi Allah Tuhanku, ia benar-benar akan datang, hanya saja saat kedatangannya tidak diketahui kecuali oleh Allah semata Yang Maha Mengetahui yang ghaib, dimana tidak samar bagiNya seekor semut sekalipun, baik di langit maupun dibumi, tidak juga yang lebih besar atau lebih kecil dari itu, kecuali ia tertulis dalam kitab yang nyata, yaitu Lauhul Mahfuzh”, agar Allah memberi pahala kepada orang-orang yang membenarkan Allah dan mengikuti Rasulullah serta melakukan amal-amal yang shalih. Mereka mendapatkan ampunan bagi dosa-dosa mereka dan rizki yang mulia, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Allah menulis apa yang Dia tulis di Lauḥul Maḥfūẓ untuk membalas orang-orang yang beriman dan beramal saleh. Orang-orang yang mempunyai sifat-sifat tersebut adalah orang-orang yang mendapatkan ampunan dari Allah atas dosa-dosa mereka, Allah tidak menyiksa mereka karenanya, bagi mereka rezeki yang baik, yaitu Surga pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Untuk memberi keputusan di antara para hamba; Dia akan membalas orang-orang beriman yang beramal shalih dengan ampunan dan rezeki yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. لِّيَجْزِىَ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ ۚ (supaya Allah memberi balasan kepada orang-orang yang beriman dan mengerjakan amal yang saleh) Yakni kedatangan hari kiamat adalah untuk membalas orang-orang beriman dengan pahala dan membalas orang-orang kafir dengan siksa. أُو۟لٰٓئِكَ لَهُم مَّغْفِرَةٌ(Mereka itu adalah orang-orang yang baginya ampunan) Yakni ampunan atas dosa-dosa mereka; yaitu Allah akan menghapusnya karena keimanan dan amal shalih mereka lebih banyak daripada dosa-dosa mereka. Atau berkat kerunia dan rahmat Allah bagi mereka. وَرِزْقٌ كَرِيمٌ(dan rezeki yang mulia) Yakni makanan lezat yang disiapkan bagi mereka di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sebab kedatangan hari kiamat adalah sebagai tibanya waktu untu memberi balasan atas amal-amal saleh yang dikerjakan oleh orang yang beriman kepada Allah dan rasul-Nya. Merekalah yang akan mendapatkan ampunan dari Tuhan mereka atas dosa-dosa mereka, Tuhan mereka menghapus dosa mereka dan menganugerahkan rizki baik sebagai balasan atas perbuatan mereka di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Supaya Dia memberi balasan kepada orang-orang yang beriman dan beramal shalih. Mereka itulah orang-orang yang memperoleh ampunan dan rezeki yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Kemudian Allah menjelaskan tujuan dari kebangkitan itu, seraya berfirman, “supaya Allah memberi balasan kepada orang-orang yang beriman,” dengan hati mereka, meyakini Allah dan meyakini rasul-rasulNya dengan keyakinan yang teguh, “dan mengerjakan amal yang shalih,” sebagai pembenaran bagi iman mereka. “Mereka itu adalah orang-orang yang mendapatkan ampunan,” terhadap dosa-dosa mereka disebabkan iman dan amal shalih mereka. Semua keburukan dan siksa tertolak karenanya, “dan rizki yang mulia,” karena ihsan yang mereka lakukan, yang dengannya mereka memperoleh segala yang didambakan, diinginkan dan diangan-angankan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 4: Ketahuilah wahai orang-orang yang kafir, bahwasanya hari kiamat pasti datang tidak mungkin tidak; Sebagai balasan Allah bagi orang-orang yang beriman dalam hatinya dan membenarkan Rasulullah ﷺ serta mengikutinya dengan amalan-amalan shalih, mereka adalah orang-orang yang akan diampuni dosa-dosa mereka, dan dihapus keburukan-keburukan mereka dan diberikan rezeki yang dicintai mereka dengan rezeki yang mulia, mereka akan mendapatkan kenikmatan tinggal di dalam surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menjelaskan maksud dari kebangkitan. Dengan hati mereka, mereka membenarkan Allah dan Rasul-Nya dengan pembenaran yang pasti. Sebagai bentuk pembenaran terhadap iman mereka. Terhadap dosa-dosa mereka, disebabkan iman dan amal mereka. Dengan ampunan-Nya semua keburukan dan hukuman terhindar. Karena ihsan mereka. Semua yang diharapkan dan dicita-citakan oleh mereka, mereka memperolehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 4",
    "description": "Kedatangan hari kiamat itu tiada lain agar dia memberi balasan kepada orang-orang yang beriman dan mengerjakan kebajikan semasa di dunia. Mereka memperoleh ampunan dan rezeki yang mulia, yakni surga. 5. Dan orang-orang yang berusaha untuk menentang ayat-ayat kami, baik yang terbentang di alam raya maupun yang termaktub dalam Al-Qur'an, dengan anggapan mereka dapat melemahkan dan menggagalkan azab kami'sungguh anggapan mereka salah'mereka itu pasti akan memperoleh azab sebagai hukuman atas kedurhakaan mereka, yaitu jenis azab yang sangat pedih."
  }
]