[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) hari di mana Allah akan mengumpulkan orang-orang musyrik dan apa-apa yang disembah selain Allah dari kalangan malaikat, kemudian Allah berfirman kepada para malaikat sebagai pengingkaran atas orang-orang yang menyembah mereka, “Apakah kalian itu yang mereka sembah selain Kami?’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Ingatlah -wahai Rasul- pada hari di saat Allah mengumpulkan mereka semuanya kemudian Allah berfirman kepada para Malaikat dalam rangka menetapkan kesalahan kaum musyrikin dan mencela mereka, “Apakah orang-orang itu menyembah kalian selain Allah di dunia?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dan ingatlah ketika Allah mengumpulkan orang-orang musyrik dengan apa yang mereka sembah, kemudian Allah berfirman kepada para malaikat: “Apakah dahulu mereka menyembah kalian?” Pertanyaan ini merupakan olokan dan pengingkaran terhadap orang-orang musyrik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا (Dan (ingatlah) hari (yang di waktu itu) Allah mengumpulkan mereka semuanya) Untuk mengadakan perhitungan. Allah akan mengumpulkan semuanya baik itu sesembahan dan orang yang menyembah, dan para pemimpin dan orang yang mengikuti. ثُمَّ يَقُولُ لِلْمَلٰٓئِكَةِ أَهٰٓؤُلَآءِ إِيَّاكُمْ كَانُوا۟ يَعْبُدُونَ(kemudian Allah berfirman kepada malaikat: “Apakah mereka ini dahulu menyembah kamu?”) kalimat ini sebagai hinaan dan celaan bagi orang yang menyembah selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Dan hari di mana Allah mengumpulkan seluruh orang kafir untuk dihisab yaitu yang menyembah dan yang disembah, yang sombong dan yang lemah lalu Dia berfirman kepada para malaikat dengan mengejek dan mengolok-olok orang-orang musyrik itu: “Bukankah mereka yang menyembah kalian? Apakah kalian memerintahkan mereka untuk menyembah kalian?”. Firman kepada malaikat itu karena mereka adalah sebaik-sebaik sekutu mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika Dia mengumpulkan mereka semua, kemudian berfirman kepada malaikat,“Apakah hanya kepada kalian mereka menyembah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. “Dan (ingatlah) pada hari Allah mengumpulkan mereka semuanya,” yakni, para penyembah kepada selain Allah dan sesembahan-sesembahan selain Allah dari golongan malaikat, “kemudian Dia berfirman” yaitu Allah “kepada malaikat,” dengan nada mencela orang-orang yang menyembahnya, “Apakah mereka ini dahulu menyembah kamu?” maka malaikat pun berlepas diri dari penyembahan mereka, dan “mereka menjawab, ‘Mahasuci Engkau’,” maksudnya, untuk menyucikanMu dan mengquduskanMu dari sekutu ataupun tandingan, “Engkaulah pelindung kami, bukan mereka.” Kami sangat membutuhkan perlindunganMu lagi sangat memerlukannya, lalu bagaimana mungkin kami mengajak makhluk selain kami untuk beribadah (menyembah) kepada kami? Atau bagaimana mungkin kami akan menjadikan diri kami sebagai pelindung dan sekutu dari selain Engkau. Akan tetapi kaum musyrikin itu “telah menyembah jin\" yakni setan telah memerintah mereka untuk menyembah kami atau menyembah selain kami, lalu mereka menaatinya. Ketaatan mereka kepada setan-setan itulah wujud penyembahan mereka, sebab ibadah itu adalah ketaatan, seperti yang difirmankan Allah kepada setiap orang yang menyembah sembahan-sembahan selain Dia, \"Bukankah Aku telah memerintahkan kepadamu hai Bani Adam supaya kamu tidak menyembah setan? Sesungguhnya setan itu adalah musuh yang nyata bagi kamu\",dan hendaklah kamu menyembah-Ku. Inilah jalan yang lurus.\" (Yasin:60-61). “Kebanyakan mereka beriman kepada jin itu.” Maksudnya, mereka membenarkan jin dan tunduk patuh kepada mereka, sebab iman itu adalah pembenaran yang mewajibkan sikap tunduk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 40: Ingatkanlah wahai Nabi Allah kepada mereka orang-orang kafir semuanya tentang hari pengumpulan dan hari di mana dikumpulkan sesembahan-sesembahan selain Allah dari para malaikat. Kemudian Allah berkata kepada para malaikat dengan penghinaan kepada orang-orang musyrik : Apakah mereka yang dahulu oleh kalian, kalian sembah selain-Ku ?!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang musyrik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 40",
    "description": "Sebagian kaum musyrik menyembah malaikat karena menduga bahwa malaikat adalah sumber rezeki yang mereka peroleh. Kelak di akhirat orang-orang musyrik akan dipertemukan dengan sembahan mereka tersebut. Dan ingatlah pada hari ketika Allah mengumpulkan mereka semuanya untuk dihisab, kemudian dia berfirman kepada para malaikat, 'apakah kepadamu mereka ini dahulu menyembah'' setujukah kamu dengan penyembahan itu atau bahkan memintanya'41. Para malaikat itu menjawab, 'mahasuci engkau. Engkaulah pelindung dan sembahan kami, bukan mereka. Kami terbebas dari apa yang mereka kerjakan, bahkan mereka telah menyembah jin yang durhaka, yaitu setan, dan kebanyakan mereka beriman kepada jin itu. ' hal ini terbukti dengan banyaknya orang yang durhaka kepada Allah akibat tergoda rayuan setan."
  }
]