[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malaikat menjawab, “Kami menyucikanMu ya Allah dari menjadi sekutu bagiMu dalam ibadah, Engkau adalah wali kami yang kami taati dan kami sembah semata, akan tetapi mereka menyembah setan-setan, kebanyakan dari mereka membenarkan dan menaati setan-setan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Para Malaikat menjawab, “Mahasuci Engkau dan Mahatinggi. Engkau adalah pelindung kami bukan mereka, tidak ada hubungan apa pun antara kami dengan mereka, sebaliknya orang-orang musyrikin itu menyembah setan-setan. Setan-setan menampakkan diri mereka di depan kaum musyrikin sebagai malaikat, maka mereka menyembah setan-setan tersebut selain Allah, kebanyakan dari manusia beriman kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Maka mereka menjawab dengan penuh pengagungan kepada Allah: “Maha Suci Engkau wahai Tuhan kami, kami berlepas diri dari apa yang dilakukan orang-orang musyrik. Bagaimana mereka menyembah kami, sedangkan Engkau adalah Pemilik dan Pengatur urusan kami; kami sama sekali tidak menyeru mereka agar menyembah kami, namun mereka melakukan itu karena menuruti setan-setan yang menggoda mereka untuk melakukan itu, sehingga kebanyakan mereka menuruti dan mentaati setan-setan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. قَالُوا۟ سُبْحٰنَكَ أَنتَ وَلِيُّنَا مِن دُونِهِم ۖ (Malaikat-malaikat itu menjawab: “Maha Suci Engkau. Engkaulah pelindung kami, bukan mereka) Maha Suci Engkau, hanya Engkau-lah yang kami taati dan kami sembah, kami tidak menjadikan mereka orang-orang yang harus menyembah kami atau menjadikan kami pelindung, sedangkan kami tidak memiliki pelindung selain Engkau. بَلْ كَانُوا۟ يَعْبُدُونَ الْجِنَّ ۖ( bahkan mereka telah menyembah jin) Yakni menyembah setan-setan, yaitu Iblis dan bala tentaranya. Orang-orang musyrik itu mengaku telah melihat mereka (setan-setan) dan menganggap mereka adalah para malaikat yang merupakan anak-anak perempuan Allah. أَكْثَرُهُم بِهِم مُّؤْمِنُونَ (kebanyakan mereka beriman kepada jin itu) Yakni kebanyakan orang-orang musyrik itu beriman kepada jin itu, mereka mempercayai godaan dan kedustaan yang dibisikkan kepada mereka, yang diantaranya adalah bisikan untuk menyembah berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41, Para Malaikat berkata: “Maha suci Engkau dari sekutu, wahai Tuhan. Engkaulah Dzat yang kami tuju, kami sembah dan taati bukan karena mereka. Tidak ada hubungan apapun antara kami dan mereka. Sebenarnya kami juga bukan sesembahan mereka. Kami berlepas diri dari perbuatan mereka. Mereka menyembah setan yang membujuk mereka untuk menyembah kami. Kebanyakan orang-orang musyrik membenarkan dan menaati jin”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Malaikat menjawab,“Mahasuci Engkau} Maha suci dan Maha bersih Engkau {Engkaulah pelindung kami} Engkaulah Dzat yang kami mintai perlindungan, kami taati dan kami sembah {bukan mereka. Sebenarnya mereka selalu menyembah jin} setan {kebanyakan mereka beriman kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. “Dan (ingatlah) pada hari Allah mengumpulkan mereka semuanya,” yakni, para penyembah kepada selain Allah dan sesembahan-sesembahan selain Allah dari golongan malaikat, “kemudian Dia berfirman” yaitu Allah “kepada malaikat,” dengan nada mencela orang-orang yang menyembahnya, “Apakah mereka ini dahulu menyembah kamu?” maka malaikat pun berlepas diri dari penyembahan mereka, dan “mereka menjawab, ‘Mahasuci Engkau’,” maksudnya, untuk menyucikanMu dan mengquduskanMu dari sekutu ataupun tandingan, “Engkaulah pelindung kami, bukan mereka.” Kami sangat membutuhkan perlindunganMu lagi sangat memerlukannya, lalu bagaimana mungkin kami mengajak makhluk selain kami untuk beribadah (menyembah) kepada kami? Atau bagaimana mungkin kami akan menjadikan diri kami sebagai pelindung dan sekutu dari selain Engkau. Akan tetapi kaum musyrikin itu “telah menyembah jin\" yakni setan telah memerintah mereka untuk menyembah kami atau menyembah selain kami, lalu mereka menaatinya. Ketaatan mereka kepada setan-setan itulah wujud penyembahan mereka, sebab ibadah itu adalah ketaatan, seperti yang difirmankan Allah kepada setiap orang yang menyembah sembahan-sembahan selain Dia, \"Bukankah Aku telah memerintahkan kepadamu hai Bani Adam supaya kamu tidak menyembah setan? Sesungguhnya setan itu adalah musuh yang nyata bagi kamu\",dan hendaklah kamu menyembah-Ku. Inilah jalan yang lurus.\" (Yasin:60-61). “Kebanyakan mereka beriman kepada jin itu.” Maksudnya, mereka membenarkan jin dan tunduk patuh kepada mereka, sebab iman itu adalah pembenaran yang mewajibkan sikap tunduk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 41: Para malaikat berlepas diri dari mereka orang-orang musyrik, dan mensucikan Allah dari apa yang mereka lakukan : Maha Suci Engkau wahai Tuhan kami, kami mensucikan-Mu dari kesyirikan dan permisalan (dalam peribadatan), Engkaulah wahai Tuhanku sebagai pelindung kami, kami mengesakan-Mu, beribadah kepada-Mu dan tidak menyekutukan-Mu dengan apapun serta mereka orang-orang musyrik bukanlah kami yang melindungi mereka; Bahkan mereka menyembah para setan, mereka mengambil sekutu-sekutu dan tandingan-tandingan dan kebanyakan dari mereka membenarkan jin bersekutu dengan jin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan berlepas diri dari penyembahan mereka. Dari sekutu dan tandingan. Yakni kami butuh perlindungan-Mu, lalu bagaimana kami mengajak orang lain untuk menyembah kami? Atau pantaskah bagi kami mengambil pelindung selain-Mu? Yang dimaksud jin di sini adalah jin yang durhaka yaitu setan-setan. Mereka memerintahkan manusia menyembah malaikat atau selainnya selain Allah, lalu manusia menaatinya. Ketaatan mereka itulah ibadah mereka, karena ibadah adalah ketaatan sebagaimana firman Allah Ta’ala kepada orang yang mengambil sesembahan selain-Nya, “Bukankah Aku telah memerintahkan kepadamu wahai Bani Adam agar kamu tidak menyembah setan? Sesungguhnya setan itu adalah musuh yang nyata bagi kamu\",--Dan hendaklah kamu menyembah-Ku. Inilah jalan yang lurus.” (Terj. Yasin: 60-61) Yakni membenarkan kata-kata setan dan tunduk kepadanya, karena arti iman adalah pembenaran yang menghendaki ketundukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 41",
    "description": "Para malaikat itu menjawab, 'mahasuci engkau. Engkaulah pelindung dan sembahan kami, bukan mereka. Kami terbebas dari apa yang mereka kerjakan, bahkan mereka telah menyembah jin yang durhaka, yaitu setan, dan kebanyakan mereka beriman kepada jin itu. ' hal ini terbukti dengan banyaknya orang yang durhaka kepada Allah akibat tergoda rayuan setan. 42. Maka pada hari kiamat ini sebagian kamu yang disembah maupun yang menyembah, sama-sama tidak kuasa mendatangkan manfaat bagi yang lain maupun menolak mudarat dari sebagian yang lain. Dan kami katakan kepada orang-orang yang zalim, yakni yang menyembah selain Allah, 'rasakanlah olehmu azab neraka yang dahulu kamu dustakan. '."
  }
]