[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka pada hari kebangkitan, apa-apa yang disembah selain Allah tidak memiliki kuasa apa pun untuk para penyembahnya, tidak manfaat dan tidak pula mudarat, dan Kami berfirman kepada orang-orang yang menzhalimi diri mereka dengan kesyirikan dan kemaksiatan, “Rasakanlah siksa neraka yang dulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Pada hari Kebangkitan dan Hisab, apa-apa yang disembah selain Allah di dunia tidak memiliki manfaat apa pun bagi penyembahnya, mereka juga tidak memiliki mudarat apa pun bagi pemuja mereka. Kami berfirman kepada orang-orang yang menganiaya diri mereka dengan kekufuran dan kemaksiatan, \"Rasakanlah azab api Neraka yang kalian dustakan ketika di dunia.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Ketika tidak ada lagi alasan bagi kalian, maka habislah harapan kalian; sehingga kalian tidak dapat saling memberi manfaat dan mudharat sebagaimana jin dan manusia dahulu saling membantu. Kemudian Kami katakan: “Rasakanlah azab neraka yang dahulu selalu kalian dustakan ketika di dunia!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. فَالْيَوْمَ لَا يَمْلِكُ بَعْضُكُمْ (Maka pada hari ini sebahagian kamu tidak berkuasa) Yakni golongan yang disembah. لِبَعْضٍ(kepada sebahagian yang lain) Yakni golongan orang yang menyembah. نَّفْعًا((untuk memberikan) kemanfaatan) Berupa syafaat dan keselamatan, bukan azab dan kebinasaan. وَنَقُولُ لِلَّذِينَ ظَلَمُوا۟ (Dan Kami katakan kepada orang-orang yang zalim) Yakni yang menzalimi dirinya sendiri dengan menyembah selain Allah. ذُوقُوا۟ عَذَابَ النَّارِ الَّتِى كُنتُم بِهَا تُكَذِّبُونَ(Rasakanlah olehmu azab neraka yang dahulunya kamu dustakan itu) Yakni yang kalian dustakan ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Allah SWT berfirman: “Hari ini adalah hari kiamat. Sebagian kalian yaitu mereka yang disembah tidak memiliki kuasa untuk memberi manfaat berupa syafaat dan pertolongan bagi sebagian lainnya yaitu para penyembah. Tidak pula dapat mencegah azab dan kehancuran karena segala urusan itu milik Allah” Kami juga berkata kepada orang-orang yang menzalimi diri sendiri dan kafir dengan menyembah selain Allah: “Rasakanlah siksa neraka yang kalian dustakan di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ini sebagian kalian tidak mampu (memberi) manfaat dan pula mudarat kepada sebagian yang lain. Kami berkata kepada orang-orang yang zalim,“Rasakanlah azab neraka yang selalu kalian dustakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Setelah para malaikat berlepas diri dari mereka, maka Allah berfirman seraya menyapa mereka, “Maka pada hari ini, sebagian kamu tidak berkuasa memberikan kemanfaatan dan tidak pula kemudaratan kepada sebagian yang lain,” terputuslah segala bentuk hubungan di antara kalian, dan sebagian dari kalian berlepas diri dari sebagian yang lain. “Dan Kami katakan kepada orang-orang yang zhalim,” disebabkan kekafiran dan kemaksiatan, setelah Kami memasukkan mereka ke neraka, “Rasakanlah olehmu azab neraka yang dahulunya kamu dustakan itu.” Hari ini kalian melihatnya dengan mata kepala, dan kalian memasukinya sebagai balasan atas pendustaan kalian dan sebagai hukuman akibat kalian tidak mau lari dari segala sebab-sebab pendustaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 42: Allah mengabarkan, bahwa di hari kiamat, tidak ada yang menolong satu sama lain dengan memberi manfaat dari syafaat serta keselamatan, tidak juga mudharat dari adzab dan kebinasaaan. Kami katakan (kata Allah) kepada orang-orang yang dzhalim dan syirik : Rasakanlah adzab api neraka yang kalian dustakan dan memperolok-olok dengannya di dunia dan segera kalian sungguh akan memasukinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah para malaikat berlepas diri dari mereka. Yakni yang disembah tidak berkuasa memberikan apa-apa terhadap yang menyembah. Setelah mereka masuk ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 42",
    "description": "Maka pada hari kiamat ini sebagian kamu yang disembah maupun yang menyembah, sama-sama tidak kuasa mendatangkan manfaat bagi yang lain maupun menolak mudarat dari sebagian yang lain. Dan kami katakan kepada orang-orang yang zalim, yakni yang menyembah selain Allah, 'rasakanlah olehmu azab neraka yang dahulu kamu dustakan. '43. Bila pada ayat-ayat sebelumnya Allah menjelaskan kedurhakaan kaum musyrik kepada Allah, maka pada ayat ini dia menjelaskan kedurhakaan dan pengingkaran mereka kepada rasulullah dan Al-Qur'an. Dan apabila dibacakan kepada mereka ayat-ayat kami yang terang, yakni jelas, mereka berkata, 'orang ini tidak lain hanya ingin menghalang-halangi kamu dari menyembah apa yang selalu disembah oleh nenek moyangmu, ' dan mereka berkata, 'Al-Qur'an ini tidak lain hanyalah kebohongan luar biasa yang diada-adakan saja oleh Muhammad. ' dan orang-orang kafir berkata terhadap kebenaran ketika kebenaran itu, yakni Al-Qur'an, datang kepada mereka, 'ini tidak lain hanyalah sihir yang nyata. ' (lihat juga: a'-''ff't/37: 14'15 dan al-qamar/54: 2)."
  }
]