[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila ayat-ayat Allah yang jelas dibacakan kepada orang-orang kafir Makkah, mereka berkata, “Muhammad hanyalah seorang laki-laki yang ingin menghalang-halangi kalian untuk menyembah tuhan-tuhan yang yang kalian sembah dan telah disembah sebelumnya oleh nenek moyang kalian.” Mereka juga berkata, “Al-Qur’an yang kamu bacakan kepada kami (wahai Muhammad), hanyalah dusta yang dibuat-buat, kamu membuatnya dari dirimu sendiri, bukan dari sisi Allah.” dan orang-orang kafir berkata tentang al-Qur’an manakala ia datang kepada mereka, “Ini hanyalah sihir yang nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Bila Kami membacakan kepada kaum musyrikin yang mendustakan ayat-ayat Kami yang Kami turunkan kepada utusan Kami, jelas tidak ada kesamaran padanya, mereka berkata, “Laki-laki yang datang membawanya tidak lain kecuali seorang laki-laki yang hendak memalingkan kalian dari ajaran nenek moyang kalian.” Mereka berkata, “Al-Qur`ān ini hanyalah dusta yang dia rekayasa atas nama Allah.” Orang-orang kafir berkata tentang Al-Qur`ān manakala ia datang kepada mereka dari sisi Tuhan mereka, “Ini hanyalah sihir yang nyata karena ia memisahkan suami dari istrinya, anak dari bapaknya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan jika dibacakan ayat-ayat Kami yang jelas yang membuktikan keesaan Kami dan kebenaran risalah nabi Kami, mereka berkata dengan penuh pendustaan dan pengingkaran: “Tidak lain orang ini hanya berusaha untuk mengalihkan kalian dari penyembahan yang dilakukan nenek moyang kalian.” Dan mereka juga berkata: “Tidak lain yang dibacakan ini adalah kebohongan.” Dan orang-orang yang memilih kekafiran dan tetap menjadi kafir berkata: “Tidak lain ini adalah benar-benar sihir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايٰتُنَا (Dan apabila dibacakan kepada mereka ayat-ayat Kami) Yakni ayat-ayat qur’aniyah. بَيِّنٰتٍ(yang terang) Yakni yang sangat jelas petunjuknya dan jelas makna-maknanya. قَالُوا۟ مَا هٰذَآ(mereka berkata: “Orang ini) Yakni orang yang membacanya, yaitu Muhammad. إِلَّا رَجُلٌ يُرِيدُ أَن يَصُدَّكُمْ عَمَّا كَانَ يَعْبُدُ ءَابَآؤُكُمْ(tiada lain hanyalah seorang laki-laki yang ingin menghalangi kamu dari apa yang disembah oleh bapak-bapakmu”) Yakni berhala-berhala yang dijadikan sebagai tuhan-tuhan yang disembah oleh nenek moyang kalian. وَقَالُوا۟( dan mereka berkata) Mereka berkata lagi. مَا هٰذَآ(“(Al Quran) ini) Yakni al-Qur’an ini. إِلَّآ إِفْكٌ مُّفْتَرًى ۚ( hanyalah kebohongan yang diada-adakan saja”) Yakni dusta yang dibuat-buat. وَقَالَ الَّذِينَ كَفَرُوا۟( Dan orang-orang kafir berkata) Mereka berbicara ketiga kalinya. لِلْحَقِّ لَمَّا جَآءَهُمْ(terhadap kebenaran tatkala kebenaran itu datang kepada mereka) Yakni terhadap perkara agama yang didatangkan Rasulullah kepada mereka berupa al-Qur’an dan mukjizat-mukjizat. إِنْ هٰذَآ إِلَّا سِحْرٌ مُّبِينٌ(“Ini tidak lain hanyalah sihir yang nyata”) Yakni ini hanyalah sejenis sihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Saat dibacakan ayat-ayat Al-Qur’an yang jelas dan mengandung petunjuk kepada orang-orang musyrik, mereka akan berkata kepada sebagian mereka: “Muhammad ini tidak lain kecuali lelaki yang ingin melarang kalian menyembah sesembahan leluhur kalian yaitu berhala dan patung” Mereka berkata: “Al-Qur’an ini tidak lain hanya kebohongan yang dibuat-buat dan tidak berdasar apapun” Ketiga kalinya mereka berkata tentang perintah kenabian, agama yang berisi Al-Qur’an dan mukjizat nabi: “Tidak lain ini hanyalah sihir yang nyata”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dibacakan kepada mereka ayat-ayat Kami yang terang} yang jelas {mereka berkata,“Orang ini tidak lain hanya ingin menghalang-halangi kalian} menghalangi kalian {dari apa yang biasa disembah oleh nenek moyang kalian” Mereka berkata,“(Al-Qur’an) ini tidak lain hanyalah kebohongan yang diada-adakan”} kebohongan yang dibuat-buat {Orang-orang yang ingkar berkata tentang kebenaran ketika hal itu datang kepada mereka,“Ini tidak lain hanyalah sihir yang nyata”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah memberitakan tentang kondisi orang-orang musyrik di saat dibacakan kepada mereka ayat-ayat Allah yang sangat jelas, hujjah-hujjahNya yang nyata dan argument-argumenNya yang bersifat pasti yang menunjukkan kepada segala kebaikan, yang mencegah dari segala keburukan, yang sebenarnya ia merupakan nikmat terbesar yang datang kepada mereka dan karunia teragung yang sampai kepada mereka yang seharusnya diterima dengan (sikap) iman, membenarkan, mematuhi dan berserah diri, namun mereka menerimanya dengan berlawanan dari yang sepantasnya, dan mereka mendustakan Rasul yang datang kepada mereka seraya mengatakan, “Orang ini tiada lain hanyalah seorang laki-laki yang ingin menghalangi kamu dari apa yang disembah oleh bapak-bapakmu,” maksudnya, inilah tujuannya saat ia menyuruh kalian ikhlas (bertauhid) kepada Allah agar kalian meninggalkan kebiasaan-biasaan bapak-bapak kalian yang kalian agungkan dan kalian berjalan di belakang (mengikuti) mereka. Lalu mereka menolak kebenaran dengan perkataan orang-orang yang sesat, mereka pun tidak mengemukakan dalil (argument) ataupun syubhat. Lalu syubhat jenis apa apabila para rasul memerintah kepada sebagian orang-orang yang sesat untuk mengikuti kebenaran, lalu mereka mengklaim bahwa saudara-saudara mereka yang sepaham dengan mereka masih berpegang teguh pada paham sesat itu? Kepicikan berpikir dan penolakan terhadap kebenaran dengan (dasar) perkataan-perkataan orang-orang yang sesat ini, apabila Anda mencermatinya dengan sebenar-benarnya, adalah (argumentasi) yang ditolak apabila ini referensi penolakannya, yaitu ditolak hanya dengan berdasarkan perkataan-perkataan orang-orang sesat dari kaum Musyrikin, matrealis, kaum filosof, kaum Shabi’un dan kaum mulhidin (kafir) terhadap Agama Allah, maka merekalah suri teladan bagi setiap orang yang menolak kebenaran hingga Hari Kiamat. Setelah mereka berargumen dengan perbuatan bapak-bapak mereka terdahulu, dan menjadikannya sebagai penolak terhadap ajaran yang dibawa oleh para Rasul, maka mereka setelah itu mulai melecehkan kebenaran, “dan mereka berkata, ‘ (Al-Quran) ini tidak lain hanyalah kebohongan yang diada-adakan saja,” maksudnya, kebohongan yang dibuat-buat oleh si lelaki yang datang membawanya, “Dan orang-orang kafir berkata terhadap kebenaran tatkala kebenaran itu datang kepada mereka, ‘Ini tidak lain hanyalah sihir yang nyata’,” sihir yang jelas lagi nyata bagi setiap orang, (sebagai sikap) pendustaan terhadap kebenaran dan promosi kepada orang-orang yang dungu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 43: Allah mengabarkan bahwa mereka orang-orang kafir jika dibacakan kepada mereka ayat Al Qur’an yang jelas akan kebenarannya, mereka berkata dengan pengingkaran dan olok-olok : Ketahuilah, klaim bahwasanya seruan Rasul, tidaklah ia kecuali laki-laki biasa semisal kalian, dia berusaha menghalangi kalian dari apa yang telah disembah bapak-bapak kalian dan nenek moyang kalian dari berhala-berhala. Kemudian mereka berkata tentang Al Qur’an : Tidaklah Al Qur’an ini yang dibacakan kepada kami kecuali hanyalah kebohongan dan yang dibuat-buat, ia didatangkan dari dirinya sendiri, dan bukan dari sisi Allah. Kemudian berkata orang-orang kafir atas apa yang datang dari Rasulullah : Tidaklah ini, yang datang kepada kami wahai Muhammad kecuali hanyalah sihir yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan kaum musyrik ketika dibacakan kepada mereka ayat-ayat Allah yang jelas, hujjah-hujjah-Nya yang terang dan dalil-dalilnya yang qath’i, yang menunjukkan kepada kebaikan, melarang dari keburukan, di mana ia merupakan nikmat terbesar yang datang kepada mereka yang seharusnya mereka imani, mereka benarkan, tunduk dan menerima, tetapi ternyata mereka menyikapinya dengan mendustakan orang yang membawanya dan mengatakan seperti yang disebutkan dalam ayat di atas. Yakni ayat-ayat Al Qur’an. Yakni itulah maksud dia ketika dia menyuruh kamu mengikhlaskan ibadah kepada Allah agar kamu meninggalkan tradisi nenek moyangmu. Ketika mereka berasalan dengan perbuatan nenek moyang mereka dan menjadikannya sebagai alasan untuk menolak yang dibawa para rasul, kemudian mereka mencela kebenaran dan mengatakan., “(Al Quran) ini tidak lain hanyalah kebohongan yang diada-adakan saja.” Dengan maksud mendustakan kebenaran dan melariskan hal itu di tengah-tengah orang-orang yang bodoh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 43",
    "description": "Bila pada ayat-ayat sebelumnya Allah menjelaskan kedurhakaan kaum musyrik kepada Allah, maka pada ayat ini dia menjelaskan kedurhakaan dan pengingkaran mereka kepada rasulullah dan Al-Qur'an. Dan apabila dibacakan kepada mereka ayat-ayat kami yang terang, yakni jelas, mereka berkata, 'orang ini tidak lain hanya ingin menghalang-halangi kamu dari menyembah apa yang selalu disembah oleh nenek moyangmu, ' dan mereka berkata, 'Al-Qur'an ini tidak lain hanyalah kebohongan luar biasa yang diada-adakan saja oleh Muhammad. ' dan orang-orang kafir berkata terhadap kebenaran ketika kebenaran itu, yakni Al-Qur'an, datang kepada mereka, 'ini tidak lain hanyalah sihir yang nyata. ' (lihat juga: a'-''ff't/37: 14'15 dan al-qamar/54: 2). 44. Kaum musyrik mekah tidak punya dasar apa pun untuk pembenaran agama nenek moyang mereka dengan menolak kerasulan nabi Muhammad dan menuduh Al-Qur'an sebagai sihir, karena kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca, dan kami tidak pernah mengutus seorang rasul sebagai pemberi peringatan kepada mereka sebelum engkau diutus kepada mereka."
  }
]