[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak menurunkan kepada orang-orang kafir itu kitab-kitab yang mereka baca sebelum al-Qur’an lalu kitab-kitab itu menunjukkan kepada apa yang mereka klaim bahwa apa yang dibawa Muhammad adalah sihir. Dan Kami tidak mengutus kepada mereka sebelummu (wahai Rasul) seorang rasul yang memperingatkan mereka terhadap siksa Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Kami tidak memberi mereka kitab-kitab yang mereka baca sehingga kitab-kitab tersebut menunjukkan pada mereka bahwa Al-Qur`ān ini adalah dusta yang dibuat-buat oleh Muhammad. Dan Kami tidak mengutus seorang Rasul pun sebelummu -wahai Rasul- kepada mereka kecuali Rasul tersebut menakut-nakuti mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Kami tidak pernah mendatangkan kitab kepada mereka sebelum kitab ini untuk mereka pelajari, dan Kami tidak pernah mengutus pemberi peringatan kepada mereka sebelummu wahai Muhammad; maka selayaknya mereka menerima dan berpegang teguh kepada kitab ini, dan mentaati pemberi peringatan ini yang datang kepada mereka dengan kebaikan dunia dan akhirat, bukan sebaliknya mereka mendustakannya dan menbuat tuduhan tanpa dasar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَمَآ ءَاتَيْنٰهُم مِّن كُتُبٍ يَدْرُسُونَهَا ۖ (Dan Kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca) Yakni Kami belum pernah menurunkan kepada orang Atab kitab dari langit yang dapat mereka pelajari. وَمَآ أَرْسَلْنَآ إِلَيْهِمْ قَبْلَكَ مِن نَّذِيرٍ (dan sekali-kali tidak pernah (pula) mengutus kepada mereka sebelum kamu seorang pemberi peringatanpun) Yakni orang yang mengajak mereka kepada kebenaran dan memperingati mereka dari azab. Sehingga pendustaan mereka terhadap al-Qur’an dan Rasulullah tidak memiliki dasar atau alasan yang dapat mereka pegang; lalu mengapa mereka mendustakanmu? Padahal mereka tidak pernah didatangkan kitab atau pemberi peringatan dari apa yang mereka lakukan itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Kami tidak menurunkan kepada penduduk Mekah kitab-kitab yang bisa mereka baca dan pahami yang menunjukkan tentang benarnya suatu kesyirikan ({Min Kutubin} huruf min disini menunjukkan keuniversalan sesuatu setelahnya). Wahai Nabi, Kami juga tidak mengutus kepada bangsa Arab seorang nabi sebelummu yang memberi peringatan tentang hukuman Kami. Maknanya adalah: Bagaimana bisa mereka mendustakanmu sedangkan mereka tidak punya dalil berupa kitab dan rasul?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak memberikan kepada mereka} Kami tidak memberi orang-orang musyrik itu {kitab apa pun yang mereka pelajari} yang mereka baca {dan Kami juga tidak mengutus seorang pemberi peringatan kepada mereka sebelum kamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Setelah Allah menjelaskan argumentasi yang mereka jadikan untuk menolak kebenaran, yaitu berupa perkataan-perkataan yang masih di bawah tingkatan syubhat, dan sama sekali bukan hujjah (argument), maka di sini Allah menjelaskan bahwa mereka, sekalipun ada seseorang yang akan membelanya, maka sesungguhnya mereka sama sekali tidak mempunyai sandaran dan tidak mempunyai sesuatu apa pun yang dapat dijadikan sebagai pegangan, seraya berfirman, “Dan Kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca,” sehingga mereka mempunyai sandaran, “dan sekali-kali tidak pernah pula mengutus kepada mereka sebelum kamu seorang pemberi peringatan pun,” sehingga mereka memiliki perkataan-perkataan dan kondisi-kondisi yang dapat mereka jadikan sebagai alat untuk menolak syariat yang engkau bawa. Jadi, mereka tidak mempunyai ilmu ataupun secuil dari ilmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 44: Dan tidaklah Kami turunkan kepada kaummu wahai Muhammad ﷺ satu kitab sebelum Al Qur’an sebagai pegangan bagi kebohongan mereka kepadamu, tidak juga kami utus Rasul kepada mereka sebelummu sebagai pembawa peringatan atau utusan yang mengikuti perkataan-perkataan yang membantahmu, lantas darimana mereka mengetahui bahwa Al Qur’an ini adalah sihir yang nyata ? Tidaklah semua itu kecuali murni sebuah kebodohan, dusta dan pengingkaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan penolakan mereka terhadap kebenaran dan bahwa penolakan itu adalah sekedar ucapan yang tidak sampai ke tingkatan syubhat apalagi hujjah, maka Dia menyebutkan bahwa ketika mereka hendak berhujjah, tidak ada lagi hujjah dan sandaran sama sekali bagi mereka. Sehingga menjadi pegangan mereka. Sehingga ada pada mereka ucapan rasul tersebut atau keadaannya yang dapat digunakan untuk membantah apa yang engkau bawa. Oleh karena itu, mereka tidak memiliki ilmu dan perkara terpuji yang berasal dari ilmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 44",
    "description": "Kaum musyrik mekah tidak punya dasar apa pun untuk pembenaran agama nenek moyang mereka dengan menolak kerasulan nabi Muhammad dan menuduh Al-Qur'an sebagai sihir, karena kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca, dan kami tidak pernah mengutus seorang rasul sebagai pemberi peringatan kepada mereka sebelum engkau diutus kepada mereka. 45. Pada ayat ini Allah menggambarkan lemahnya kekuatan orang-orang kafir mekah dibanding umat-umat terdahulu. Umat masa lalu begitu kuat, namun mereka dihancurkan oleh Allah akibat mendustakan para rasul. Dan orang-orang yang sebelum mereka telah mendustakan para rasul, sedang orang-orang kafir mekah itu belum sampai menerima sepersepuluh dari apa yang telah kami berikan kepada orang-orang terdahulu itu, berupa kepandaian, umur panjang, kekuatan jasmani, keka-yaan, dan sebagainya, namun mereka mendustakan para rasul-ku. Maka, lihatlah bagaimana dahsyatnya akibat kemurkaan-ku. Mereka hancur lebur walaupun kekuatan mereka jauh melebihi kaum musyrik mekah."
  }
]