[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang sebelum mereka telah mendustakan pula rasul-rasul Kami, seperti kaum Ad dan Tsamud, padahal orang-orang Makkah tidak memiliki sepersepuluh dari apa yang telah Kami berikan kepada umat-umat terdahulu berupa kekuatan, kekayaan melimpah dan usia yang panjang serta nikmat-nikmat lainnya, lalu mereka mendustakan utusan-utusanKu dalam apa yang mereka bawa kepada mereka, lalu Kami membinasakan mereka. Maka lihatlah (wahai Rasul), bagaimana pengingkaranKu atas mereka dan hukumanKu terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Umat-umat terdahulu telah mendustakan, seperti kaum 'Ād, Ṡamūd, kaum Lūṭ. Dan orang-orang musyrikin dari kaummu tidak mampu mencapai sepersepuluh apa yang dicapai oleh umat-umat terdahulu dalam hal kekuatan, perlengkapan, harta dan jumlah orang. Tiap-tiap umat dari mereka mendustakan utusannya. Maka kekuatan, harta dan jumlah orang tidak berguna bagi mereka, azab-Ku turun menimpa mereka. Maka perhatikanlah -wahai Rasul- bagaimana pengingkaran-Ku atas mereka, bagaimana azab-Ku atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Dan umat-umat sebelum mereka yang telah binasa juga telah mendustakan. Kekayaan dan kemewahan orang-orang kafir Quraisy itu tidak mencapai sepersepuluh dari kekayaan yang diberikan Allah kepada umat-umat itu, Allah memberi mereka kejayaan yang tidak pernah diberikan kepada selain mereka, akan tetapi itu semua tidak dapat menyelamatkan mereka ketika mereka mendustakan para rasul. Maka lihatlah, bagaimana azab dan perlawanan-Ku terhadap mereka? Dan bagaimana Aku mengganti kenikmatan mereka dengan azab? Maka hendaklah orang-orang kafir Quraisy berhati-hati agar tidak menjadi seperti para pendahulu mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَكَذَّبَ الَّذِينَ مِن قَبْلِهِمْ (Dan orang-orang yang sebelum mereka telah mendustakan) Yakni kaum-kaum terdahulu. وَمَا بَلَغُوا۟ مِعْشَارَ مَآ ءَاتَيْنٰهُمْ(sedang orang-orang kafir Mekah itu belum sampai menerima sepersepuluh dari apa yang telah Kami berikan kepada orang-orang dahulu itu) Yakni orang-orang musyrik Quraisy dan orang-orang Arab lainnya dalam kekuatan dan harta benda yang telah Kami berikan kepada mereka, tidak sampai sepersepuluh dari kekuatan dan harta benda yang telah Kami berikan kepada orang-orang sebelum mereka, namun Allah tetap membinasakan mereka, seperti kaum ‘Aad, Tsamud, dan yang lainnya. Pendapat lain mengatakan bahwa makna (المعشار) adalah satu bagian dari seribu. فَكَيْفَ كَانَ نَكِيرِ (Maka alangkah hebatnya akibat kemurkaan-Ku) Maka bagaimana keingkaran-Ku ketika itu dengan azab dan siksaan terhadap mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Umat-umat terdahulu sebelum mereka juga mendustakan (para rasul) sebagaimana kaummu mendustakanmu. Dan orang-orang musyrik Arab itu tidak mencapai sepersepuluh dari apa yang Kami berikan kepada umat-umat terdahulu berupa kekuatan, umur panjang, harta dan kekayaan layaknya kaum ‘Aad, Tsamud dan lainnya. Mereka mendustakan para rasulKu, lalu Aku membinasakan mereka. Bagaimana bisa Aku mengingkari mereka dengan memberikan mereka azab? Sesungguhnya Dia meletakkannya (azab) pada tempatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang sebelum mereka telah mendustakan (rasul). Mereka itu belum sampai} orang-orang musyrik itu belum sampai {pada sepersepuluh dari apa yang telah Kami anugerahkan kepada orang-orang terdahulu itu} sepersepuluh dari apa yang Kami berikab kepada mereka berupa kekuatan, kenikmatan, dan umur panjang {lalu mereka mendustakan para utusanKu. Maka bagaimana dahsyatnya akibat kemurkaanKu} pengingkaranKu terhadap mereka dengan memberi hukuman dan azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Kemudian Allah menakut-nakuti mereka dengan azab yang telah Dia tampakkan terhadap umat-umat terdahulu sebelum mereka, seraya berfirman, “Dan orang-orang yang sebelum mereka telah mendustakan, sedang orang-orang kafir Makkah itu belum sampai,” maksudnya mereka yang disebutkan belum sampai “menerima sepersepuluh dari apa yang telah Kami berikan kepada mereka, lalu mendustakan,” maksudnya, Kami berikan kepada umat terdahulu sebelum mereka, lalu mereka mendustakan “para rasulKu. Maka (lihatlah) alangkah hebatnya akibat kemurkaanKu,” maksudnya, keingkaranKu dan siksaanKu terhadap mereka. Sesungguhnya Allah telah menginformasikan kepada kita tentang hukuman (azab) yang ditimpakan kepada mereka, dan di antara mereka ada yang Dia tenggelamkan, adapula yang Dia binasakan dengan badai angin topan yang membinasakan, dengan petir, dengan gempa bumi, dengan ditimbun tanah (tanah longsor) dan dengan badai berbatu dari langit. Maka waspadalah wahai orang-orang yang mendustakan, kalau kalian tetap bersikap mendustakan, karena Allah akan merenggut kalian sebagaimana telah merenggut umat-umat sebelum kalian dan menimpakan kepada kalian seperti apa yang telah Dia timpakan kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 45: Ketahuilah wahai Nabi Allah bahwasanya kaum-kaum yang sebelumnya yang mereka telah datang sebelum kaummu juga mendustakan Rasul-Rasul mereka, dan tidak beriman dengan apa yang datang kepada mereka dan belum sampai kepada kafir Mekkah kesulitan dengan kami berikan kepada umat-umat yang tersebut kekuatan, harta dan panjangnya umur; Kemudian mereka mendustakan Rasul-Rasul Kami dan tidak beriman kepada mereka; Kami binasakan mereka, maka tunggulah wahai Nabi Allah bagaimana Allah membinasakan mereka! Bukankah kebinasaan dan kehancuran yang mereka akan dapat ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menakut-nakuti mereka dengan tindakan-Nya yang dilakukan terhadap orang-orang yang mendustakan sebelum mereka. Maksud dari sepersepuluh dari apa yang telah Kami berikan kepada mereka ialah pemberian Allah tentang kepandaian ilmu pengetahuan, umur panjang, kekuatan jasmani, kekayaan harta benda dan sebagainya. Yakni bagaimana pengingkaran-Ku kepada mereka dan hukuman-Ku kepada mereka, Kami telah memberitahukan tindakan Kami kepada mereka dengan pemberian hukuman. Di antara mereka ada yang Allah tenggelamkan, di antara mereka ada yang Allah binasakan dengan angin kencang, dengan suara keras yang mengguntur, dengan gempa yang dahsyat, dengan penenggelaman ke dalam bumi dan dengan hujan batu. Oleh karena itu, berhati-hatilah kamu wahai orang-orang yang mendustakan jika kamu tetap di atas itu, bisa saja kamu ditimpa seperti yang menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 45",
    "description": "Pada ayat ini Allah menggambarkan lemahnya kekuatan orang-orang kafir mekah dibanding umat-umat terdahulu. Umat masa lalu begitu kuat, namun mereka dihancurkan oleh Allah akibat mendustakan para rasul. Dan orang-orang yang sebelum mereka telah mendustakan para rasul, sedang orang-orang kafir mekah itu belum sampai menerima sepersepuluh dari apa yang telah kami berikan kepada orang-orang terdahulu itu, berupa kepandaian, umur panjang, kekuatan jasmani, keka-yaan, dan sebagainya, namun mereka mendustakan para rasul-ku. Maka, lihatlah bagaimana dahsyatnya akibat kemurkaan-ku. Mereka hancur lebur walaupun kekuatan mereka jauh melebihi kaum musyrik mekah. 46. Katakanlah, wahai nabi Muhammad, 'aku hendak memperingatkan kepadamu satu hal saja, yaitu agar kamu menghadap Allah dengan ikhlas guna menemukan kebenaran. Kamu lakukan renungan itu dengan berdua-dua, yakni secara berkelompok, atau sendiri-sendiri, dalam suasana tenang, kemudian agar kamu pikirkan tentang nabi Muhammad yang sudah lama kamu kenal sebagai orang yang dapat dipercaya, lalu kamu mengatakan dia gila, lantaran dia mengajakmu untuk beriman kepada Allah. Ketahuilah, kawanmu itu tidak gila sedikit pun. Dia tidak lain hanyalah seorang pemberi peringatan bagi kamu sebelum menghadapi azab yang keras. '."
  }
]