[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah (wahai Rasul) kepada orang-orang yang mendustakan lagi menentang itu, “sesungguhnya Aku hanya menasihatkan satu perkara kepada kalian, yaitu hendaklah kalian menegakkan ketaatan kepada Allah, berdua atau sendiri-sendiri, kemudian renungkanlah keadaan teman kalian Rasulullah, dan apa yang dituduhkan kepadanya, ternyata dia tidak gila, karena dia hanya pemberi peringatan kepada kalian yang mengingatkan kalian terhadap azab Jahanam sebelum kalian mencicipi panasnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Katakanlah -wahai Rasul- kepada orang-orang musyrikin, \"Aku hanya mengisyaratkan kepada kalian dan menasihati kalian dengan satu perkara, yaitu hendaknya kalian berdiri karena Allah dengan melepaskan diri dari hawa nafsu, bisa dua dua, bisa juga sendiri-sendiri, kemudian renungkanlah perjalanan Nabi kalian, apa yang sudah kalian ketahui tentangnya, akalnya, kejujuran dan amanahnya, agar kalian bisa memastikan bahwa beliau -ṣallallāhu 'alaihi wa sallam- tidak gila, karena beliau hanya memperingatkan kalian dari azab yang berat bila kalian tidak bertobat kepada Allah dari menyekutukan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Hai Muhammad, katakanlah kepada mereka: “Aku sampaikan kepada kalian pelajaran besar, dan aku mengajak kalian menuju pemahaman yang benar; yakni berdirilah kalian menghadap Allah dengan penuh keikhlasan, kemudian setiap kalian bersama dengan kawan yang dia percaya, atau melakukannya sendirian; kemudian hendaklah dia berfikir dan menghayati dengan sungguh-sungguh dengan tujuan mencari kebenaran, karena barangsiapa yang mencari kebenaran dengan sungguh-sungguh maka dia akan mendapatkannya. Kemudian hendaklah kalian saling memikirkan tentang teman kalian -yaitu Nabi Muhammad-, apakah dia benar-benar gila seperti yang kalian tuduhkan? Jika kalian benar-benar jujur terhadap kebenaran, niscaya kalian akan mengetahui bahwa dia tidak seperti yang kalian tuduhkan; dia tidak lain adalah seorang pemberi peringatan bagi kalian dari azab yang pedih yang berhak dirasakan orang-orang yang mendustakannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قُلْ إِنَّمَآ أَعِظُكُم بِوٰحِدَةٍ ۖ (Katakanlah: “Sesungguhnya aku hendak memperingatkan kepadamu suatu hal saja) Yakni aku peringatkan kalian dari buruknya kesudahan apa yang kalian lakukan ini dengan satu perintah. أَن تَقُومُوا۟ لِلّٰهِ مَثْنَىٰ وَفُرٰدَىٰ( yaitu supaya kamu menghadap Allah (dengan ikhlas) berdua-dua atau sendiri-sendiri) Yakni carilah kebenaran dengan penuh kejujuran dengan cara menyendiri dua orang dua orang atau sendiri-sendiri, sebab berkumpul dengan orang banyak akan mengganggu fikiran. ثُمَّ تَتَفَكَّرُوا۟ ۚ( kemudian kamu fikirkan (tentang Muhammad)) Dan hendaklah kalian saling menasehati untuk senantiasa jujur dalam memandang perkara Rasulullah dan kitab yang dia sampaikan. Dengan begitu kalian akan mengatahui bahwa dia bukanlah orang yang gila. مَا بِصَاحِبِكُم مِّن جِنَّةٍ ۚ( tidak ada penyakit gila sedikitpun pada kawanmu itu) Yakni dia tidaklah terkena sihir atau gila, sebab keadaan dan sikapnya tidak menunjukkan hal itu, dan wahyu yang dia sampaikan adalah bukti kebenarannya yang jelas. إِنْ هُوَ إِلَّا نَذِيرٌ لَّكُم بَيْنَ يَدَىْ عَذَابٍ شَدِيدٍ(Dia tidak lain hanyalah pemberi peringatan bagi kamu sebelum (menghadapi) azab yang keras) Yakni sebelum kedatangan hari kiamat. Padahal mereka mengetahui bahwa Rasulullah adalah orang yang paling lurus akalnya, dan mereka tidak pernah menjadi korban kebohongannya selama hidupnya dan hidup mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Wahai Nabi, katakanlah kepada kaummu: “Sesungguhnya aku menasehati kalian secara ramah dengan satu ikat rambut yaitu agar kalian berusaha dengan ikhlas dalam mencari kebenaran. Berdua secara bersama-sama atau satu-satu secara sendiri-sendiri. Hal itu membuatku dipanggil karena memiliki pemikiran yang benar. Lalu pikirkanlah tentang sahabat kalian, Muhammad yang sudah lama kalian kenal sebagai orang yang dapat dipercaya dan berakal. Dia tidak gila saat mengajak kalian untuk mengesakan Allah” Maknanya jika kalian mau berpikir bahwa dia tidak gila maka dia tidak lain hanya memperingatkan kalian tentang akibat kemaksiatan sebelum datangnya azab yang dahsyat di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Aku hendak menasihati kalian} Aku menasehati kalian {dengan satu hal} dengan satu perkara {agar kalian bangkit karena Allah} kalian bersungguh-sungguh dalam segala perkara dengan ikhlas karena Allah bukan karena hawa nafsu {baik berdua-dua} dua-dua {maupun sendiri-sendiri} sendiri-sendiri {kemudian berpikir. Kawan kalian itu tidak gila} gila {Dia tidak lain hanyalah pemberi peringatan bagi kalian bahwa di hadapan kalian ada azab yang keras”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Maksudnya, “katakanlah” wahai rasul, kepada mereka yang mendustakan lagi keras kepala yang bersikap menolak kebenaran dan mendustakannya serta mencela orang yang membawanya, “Sesungguhnya aku hendak memperingatkan kepadamu satu hal saja,” maksudnya satu masalah saja yang akan aku pesankan kepada kalian dan aku nasihatkan agar kalian menjalaninya. Yaitu jalan pertengahan, aku tidak mengajak kalian untuk mengikuti perkataanku dan tidak mengajak untuk meninggalkan perkataan kalian tanpa ada sebab yang jelas. Yaitu “supaya kamu menghadap Allah (dengan ikhlas) berdua-dua atau sendiri-sendiri,” maksudnya supaya kalian bangkit dengan semangat dan giat serta dengan tujuan mengikuti yang benar dan ikhlas kepada Allah, saling mencari dan saling merenung secara bersama-sama dan sendiri-sendiri. Masing-masing berdialog dengan jiwanya dalam hal ini. Apabila kalian telah menghadap kepada Allah berdua-dua atau sendiri-sendiri, maka kalian telah menggunakan akal pikiran kalian sendiri, kalian telah menghargainya dan kalian telah menghayati (merenungkan) keadaan dan kondisi Rasul kalian, apakah dia seorang gila yang memiliki sifat-sifat, perbuatan-perbuatan gila dari perkataannya atau seorang Nabi nan jujur yang memberikan peringatan kepada kalian tentang sesuatu yang membahayakan kalian berupa azab yang sangat dahsyat yang ada di hadapan kalian? Kalau saja mereka menerima dan melaksanakan nasihat ini, tentu mereka akan mengetahui lebih jelas daripada selain mereka bahwa Rasulullah ini bukanlah seorang gila, karena perilakunya tidak seperti orang-orang gila dalam pengamatan, perhatian dan pandangan mereka. Malah perilakunya adalah perilaku yang terbaik, gerak geriknya adalah gerak gerik yang paling mulia, dan dia merupakan manusia yang paling sempurna budi pekerti dan ketenangannya, kerendahan hati dan kewibawaannya, dia tidak lain adalah lelaki yang paling matang akalnya. Kemudian apabila mereka mengamati perkataannya yang sangat fasih dan kata-katanya yang sangat manis dan kalimat-kalimatnya yang memenuhi hati dengan rasa aman dan keimanan, menyucikan jiwa dan membersihkan hati, memotivasi untuk berakhlak mulia, memberikan rangsangan untuk berbudi pekerti nan luhur serta mencegah perilaku buruk (akhlak tidak terpuji) lagi rendahan. Ketika dia berbicara, niscaya perhatian mata terarah kepadanya sebagai bentuk segan dan menghormati serta memuliakan. Lalu apakah orang yang seperti ini sama dengan ketidaksadaran orang-orang gila, keburukan perilaku dan perkataan mereka sama dengan keadaan dan kondisi mereka? Siapa saja yang memperhatikan kondisi dan perihal beliau, sedangkan maksudnya adalah mencari tahu, apakah dia seorang Rasul atau bukan? Apakah dia mengamati sendiri-sendiri atau bersama orang lain, maka pasti dia akan memastikan bahwa dia adalah Rasulullah sejati dan NabiNya yang sesungguhnya; apalagi orang-orang yang dijadikan lawan bicara, yang Muhammad itu sendiri sahabat mereka, adalah orang-orang yang mengetahui keadaan dan perihalnya dari A sampai Z nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 46: Katakanlah wahai Nabi Allah kepada mereka yang mendustakan dan sombong dari kaummu : Sesungguhnya aku hanyalah menasihati kalian dan berwasiat kepada kalian dengan satu kaliamat; Agar kalian menjalankan ibadah dengan mengikhlaskan dengan mengikuti kebenaran menuju Allah, dan saling intropeksi satu sama lain, atau intropeksi setiap dua orang kepada sebgaian yang lain dan atau intropeksi atas dirinya sendiri yang jauh dari keramaia, untuk perenungan atas apa yang kalian diseru dengan pemilik kerisalahan ini yaitu Muhammad ﷺ dan yang dinisbatkan kepadanya; Di mana kalian mengetahui nasabnya, kejujurannya dan amanahnya, yang kalian memberikan nama kepadanya “yang jujur dan dapat dipercaya”; Apakah dia adalah orang yang gila, atau mencoba membohongi kalian atau dukun ? Cepat atau lambat kalian akan mengetahui dengan sendirinya untuk mengetahui hakikatnya bahwasanya dia adalah utusan Allah dan bukan orang yang gila; Bahkan kalian akan tahu bahwa dia adalah orang yang paling jujur dan paling benar akalnya dan paling bersih hatinya. Dia diutus kepada kalian sebagai pemberi peringatan, dan menakut-nakuti kalian dari adzab pada hari kiamat yang keras; Di mana akan ditimpa bagi siapa yang kufur dan mendustakan ayat-ayat Allah serta tidak beriman dengannya. Inilah adzab yang diper ingatkan kepada kalian, yang kalian meragukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada mereka yang mendustakan lagi tetap membangkang, yang membantah kebenaran dan mendustakannya lagi mencela orang yang membawanya. Yakni aku nasihatkan kamu untuk melakukan tindakan ini, tindakan yang jujur dan adil, aku tidak mengajakmu untuk mengikuti kata-kataku dan tidak pula meninggalkan kata-katamu tanpa ada yang mengharuskannya. Untuk mencari kebenaran dan membahasnya baik dengan berkumpul beberapa orang atau sendiri untuk merenungi. Yakni apakah Beliau seperti yang mereka katakan, yakni sebagai orang gila, di mana dalam dirinya terdapat sifat orang-orang gila ataukah Beliau seorang nabi yang benar, pemberi peringatan terhadap hal yang membahayakan kamu, yaitu azab yang ada di depanmu. Seandainya mereka menerima nasihat ini tentu akan jelas bagi mereka bahwa Rasulullah shallallahu 'alaihi wa sallam bukanlah orang gila, dan tidak mungkin Beliau seperti itu, karena keadaannya tidak terlihat sebagai orang gila, bahkan keadaannya adalah keadaan orang yang paling baik, gerakannya adalah gerakan yang paling baik, di mana Beliau adalah manusia yang paling sempurna adabnya, paling tenang, paling tawadhu’ dan paling sopan, di mana hal itu tidaklah ada kecuali pada manusia yang paling kuat akalnya. Selanjutnya jika mereka mau memperhatikan ucapannya yang fasih, lafaznya yang manis, kalimatnya yang menyentuh hati, membersihkan jiwa, menyucikan hati, membangkitkan akhlak yang mulia, mendorong kepada akhlak yang bak dan menjauhkan dari akhlak yang buruk, di mana jika Beliau bicara maka akan ditatap oleh mata dengan rasa ta’zim kepadanya. Apakah orang yang seperti ini mirip dengan orang gila? Orang yang merenungi keadaan Beliau dan tujuannya adalah ingin mengetahui, apakah Beliau utusan Allah atau bukan, baik dengan berpikir sendiri atau bersama yang lain dengan suasana tenang, maka tentu dia akan dapat memastikan bahwa Beliau adalah utusan Allah dan benar-benar nabi-Nya. Mungkin di sana ada penghalang lagi yang menghalang mereka beriman, yaitu apakah Beliau meminta upah dari orang yang mengikuti seruannya atau mengambil upah atas dakwahnya, maka Allah Subhaanahu wa Ta'aala menerangkan kebersihan Rasul-Nya shallallahu 'alaihi wa sallam dari perkara itu sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 46",
    "description": "Katakanlah, wahai nabi Muhammad, 'aku hendak memperingatkan kepadamu satu hal saja, yaitu agar kamu menghadap Allah dengan ikhlas guna menemukan kebenaran. Kamu lakukan renungan itu dengan berdua-dua, yakni secara berkelompok, atau sendiri-sendiri, dalam suasana tenang, kemudian agar kamu pikirkan tentang nabi Muhammad yang sudah lama kamu kenal sebagai orang yang dapat dipercaya, lalu kamu mengatakan dia gila, lantaran dia mengajakmu untuk beriman kepada Allah. Ketahuilah, kawanmu itu tidak gila sedikit pun. Dia tidak lain hanyalah seorang pemberi peringatan bagi kamu sebelum menghadapi azab yang keras. '47. Katakanlah, wahai nabi Muhammad, 'imbalan apa pun yang aku minta kepadamu, maka manfaat imbalan itu untuk kamu. Apabila kamu menerima seruanku agar beriman dan mengesakan Allah maka manfaat iman itu adalah untuk dirimu sendiri, bukan untukku. Imbalanku hanyalah dari Allah, dan dia maha mengetahui segala sesuatu, baik yang tersembunyi maupun yang tampak. '."
  }
]