[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang kafir, “Aku tidak meminta atas kebaikan yang aku bawa kepada kalian sebuah upah, sebaliknya ia untuk kalian saja, upahku yang aku nanti-nantikan telah ditanggung oleh Allah yang Maha Mengetahui amalku dan amal kalian, tiada sesuatu pun yang samar bagiNya, Dia akan membalas semua orang sesuai dengan apa yang menjadi haknya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Katakanlah -wahai Rasul- kepada orang-orang musyrikin yang mendustakan, “Aku tidak meminta upah atau bayaran atas apa yang aku bawa kepada kalian berupa petunjuk dan kebaikan -kalaupun seandainya ia ada- maka ia adalah untuk kalian. Bayaranku sudah dijamin oleh Allah semata. Allah Maha menyaksikan segala sesuatu, Dia bersaksi bahwa aku sudah menyampaikan kepada kalian, menyaksikan amalan kalian lalu Dia membalasnya untuk kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Hai Muhammad, katakanlah kepada mereka: “Aku tidak menginginkan upah dan imbalan atas dakwah yang aku lakukan, dan ambillah imbalan yang aku minta itu, sebab aku tidak berharap kecuali pahala dari Allah dan tidak ada yang aku inginkan kecuali keridhaan-Nya. Dia Maha Mengetahui dan Maha Melihat segala perkara, dan Dia Maha Mengetahui apa yang aku niatkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قُلْ مَا سَأَلْتُكُم مِّنْ أَجْرٍ فَهُوَ لَكُمْ ۖ (Katakanlah: “Upah apapun yang aku minta kepadamu, maka itu untuk kamu) Yakni harta yang aku minta dari kalian sebagai upah atas risalah yang aku sampaikan adalah untuk kalian jika aku memang meminta upah itu. إِنْ أَجْرِىَ إِلَّا عَلَى اللهِ ۖ (Upahku hanyalah dari Allah) Tidak dari selain-Nya. وَهُوَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ (dan Dia Maha Mengetahui segala sesuatu) Yakni tidak ada yang tersembunyi dari-Nya, dan Dia menyaksikanku bahwa aku tidak meminta upah dari kalian atas dakwah kepada Islam yang aku sampaikan kepada kalian, dan upah yang aku minta akan aku kembalikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai Nabi, katakanlah kepada orang-orang musyrik itu: “Aku tidak mencari upah dari kalian melalui ajakanku untuk mengesakan dan menyembah Allah. Jika saja aku mencarinya, maka itu untuk diri kalian sendiri bukan untukku. Upah dan imbalanku tidak lain dari Allah bukan selainNya. Dia itu Maha Mengetahui segala sesuatu sehingga Dia mengetahui kebenaranku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apa yang aku minta kepada kalian berupa imbalan} pahala {hanya untuk kalian. Tidaklah imbalanku} Tidaklah pahalaku {melainkan dari Allah dan Dia Maha Menyaksikan segala sesuatu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Di sana ada penghalang lain bagi jiwa untuk mengikuti orang yang menyeru kepada al-haq (kebenaran), yaitu kalau ia (penyeru) memungut harta orang yang diharapkan menerima seruannya, dan mengambil imbalan atas dakwahnya. Maka Allah berfirman, “Katakanlah, ‘Upah apa pun yang aku minta kepadamu’,” maksudnya, dalam rangka kalian mengikuti kebenaran, “maka itu untuk kamu.” Maka aku persaksikan bahwa upah itu, kalaupun aku minta, maka itu adalah untuk kalian. “Upahku hanyalah dari Allah, dan Dia Maha Mengetahui segala sesuatu.” IlmuNya meliputi apa yang aku serukan. Maka kalau aku berdusta, tentu Dia akan merenggutku dengan siksaanNya. Dan Dia juga menyaksikan perbuatan kalian, Dia akan menyimpannya untuk kalian, lalu Dia akan memberikan balasannya kepada kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 47: Katakanlah wahai Nabi Allah kepada mereka : Sesungguhnya aku tidak meminta kepada kalian, tidak juga meminta harta atas dakwah kerisalahan Tuhanku dan juga untuk mengikuti kebenaran, karena sesungguhnya balasannya adalah pahala yang diberikan karena sebab kalian mengikuti kebenaran; Itulah untuk kalian dan ganjaran bagiku adalah dari Allah. Allah lah yang menjadi saksi yang nampak bagiku dan amalanku, tidaklah tersembunyi baginya segala sesuatu dari hal tersebut. Begitu juga yang nampal pada kalian serta amalan kalian yang akan dibalas dengan apa yang kalian telah amalkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud perkataan ini adalah bahwa Rasulullah shallallahu 'alaihi wa sallam sama sekali tidak meminta upah kepada mereka, tetapi yang diminta Rasulullah shallallahu 'alaihi wa sallam adalah agar mereka beriman kepada Allah Subhaanahu wa Ta'aala, dan iman itu adalah untuk kebaikan mereka sendiri. Ilmu-Nya meliputi segala sesuatu, termasuk terhadap apa yang aku dakwahkan. Jika aku sebagai pendusta, tentu Dia akan menghukumku. Dia juga menyaksikan amalmu, menjaganya dan akan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 47",
    "description": "Katakanlah, wahai nabi Muhammad, 'imbalan apa pun yang aku minta kepadamu, maka manfaat imbalan itu untuk kamu. Apabila kamu menerima seruanku agar beriman dan mengesakan Allah maka manfaat iman itu adalah untuk dirimu sendiri, bukan untukku. Imbalanku hanyalah dari Allah, dan dia maha mengetahui segala sesuatu, baik yang tersembunyi maupun yang tampak. '48. Katakanlah, wahai nabi Muhammad, 'sesungguhnya tuhanku mewahyukan kebenaran untuk menghapuskan kebatilan, sehingga kebatilan pasti akan musnah. Dia maha mengetahui segala yang gaib; tidak ada yang tersembunyi bagi Allah. '."
  }
]