[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada pihak yang mengingkari tauhid dan risalah Islam, “sesungguhnya Tuhanku melempari kebatilan dengan hujjah-hujjah kebenaran, maka hujjah-hujjah itu merobohkan dan menghancurkannya.” Allah Maha Mengetahui perkara ghaib, tidak ada sesuatu pun yang samar bagiNya di bumi dan di langit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Katakanlah -wahai Rasul-, “Sesungguhnya Tuhanku menjadikan kebenaran menguasai kebatilan, maka kebenaran menghancurkan kebatilan. Allah Maha mengetahui perkara gaib, tidak ada sesuatu yang tersembunyi bagi-Nya di langit dan di bumi, tidak ada amalan hamba-Nya yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Katakanlah: “Allah menurunkan kebenaran, kemudian kebenaran itu akan diterima oleh hati yang bersih dan menetap di dalamnya; dan Allah menurunkannya kepada para nabi. Allah akan memberi petunjuk kepada kebenaran bagi setiap orang yang berusaha mendapatkannya. Allah Maha Mengetahui segala hal yang ghaib, tidak ada yang tersembunyi dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. قُلْ إِنَّ رَبِّى يَقْذِفُ بِالْحَقِّ (Katakanlah: “Sesungguhnya Tuhanku mewahyukan kebenaran) Yakni mewahyukan al-Qur’an dan wahyu yang disampaikan kepada para nabi-Nya. Pendapat lain mengatakan maknanya adalah Allah melawan kebatilan dengan kebenaran sehingga kebenaran itu mengalahkannya. عَلّٰمُ الْغُيُوبِ(Dia Maha Mengetahui segala yang ghaib”) Makna ghaib adalah apa yang tidak terlihat oleh pandangan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Wahai Rasulallah, katakanlah kepada mereka: “Sesungguhnya Tuhanku memberikan kebenaran kepada para nabiNya dan menjelaskan dalilNya yang mutlak. Dia mengetahui setiap sesuatu yang tak tampak dari makhluknya di langit dan di bumi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya Tuhanku melempar dengan kebenaran} melempar kebathilan dengan kebenaran, lalu menghancurkannya {Dia Maha Mengetahui segala yang ghaib”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Setelah Allah menjelaskan argument-argumen yang membuktikan kebenaran al-haq dan kepalsuan kebatilan, maka Allah mengabarkan bahwa yang demikian ini adalah sunnahNYa dan kebiasaanNya, yaitu memenangkan yang haq atas yang batil, lalu mengenyahkannya, hingga kebatilan binasa. Sebab Allah menjelaskan yang haq di dalam tema ini agar Dia menggunakannya untuk membantah perkataan-perkataan orang-orang yang mendustakan, hingga bisa dijadikan ibrah (pelajaran) bagi orang-orang yang mengambil pelajaran dan ayat (tanda) bagi orang-orang yang merenungkan. Sesungguhnya Anda bisa melihat bagaimana perkataan-perkataan orang-orang yang mendustakan itu menjadi redup (tumbang, binasa), kedustaan dan sikap keras kepala mereka terungkap, sedangkan yang haq menjadi Nampak dan berkilau, dan kebatilan menjadi batal dan padam. Semua itu disebabkan penjelasan dari “Dzat Yang Maha Mengetahui segala yang ghaib” yang mengetahui segala; dan Mengetahui lawannya dan menolaknya dengan hujjah, lalu Dia mengajarkan kepada hamba-hambaNYa dan menjelaskannya kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 48: Katakanlah kepada mereka wahai Nabi Allah : Sesungguhnya Allah menghapus kebathilan dan kesyirikan dengan kebenaran dan tauhid melalui bukti-bukti yang nyata. Tidak tersembunyi baginya di langit maupun di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan dalil-dalil untuk menerangkan yang hak dan membatalkan yang batil, maka Allah Subhaanahu wa Ta'aala memberitahukan, bahwa yang demikian sudah menjadi sunnah dan kebiasaan-Nya, yaitu mewahyukan kebenaran untuk mengalahkan yang batil, sehingga yang batil itu binasa, karena di sini Dia menerangkan yang hak dan membantah ucapan orang-orang yang mendustakan agar menjadi pelajaran bagi orang yang mengambil pelajaran dan sebagai ayat bagi orang yang memperhatikan. Yang Dia sampaikan kepada para nabi. Bagaimana ucapan orang-orang yang mendustakan kalah, kedustaan dan pembangkangan mereka terbongkar, kebatilan kalah dan kebenaran tampak semakin jelas, yang demikian tidak lain karena Allah Maha Mengetahui yang gaib, Dia mengetahui yang tersembunyi dalam hati berupa was-was dan syubhat, serta mengetahui sesuatu yang dapat menyingkirkannya berupa hujjah, maka Dia memberitahukannya kepada hamba-hamba-Nya dan menerangkannya kepada mereka. Oleh karena itulah, Dia berfirman pada ayat selanjutnya, “Katakanlah, \"Kebenaran telah datang dan yang batil itu tidak akan memulai dan tidak (pula) akan mengulangi.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 48",
    "description": "Katakanlah, wahai nabi Muhammad, 'sesungguhnya tuhanku mewahyukan kebenaran untuk menghapuskan kebatilan, sehingga kebatilan pasti akan musnah. Dia maha mengetahui segala yang gaib; tidak ada yang tersembunyi bagi Allah. '49. Katakanlah, 'kebenaran, yakni islam, telah datang dan yang batil itu, yakni kekufuran yang selama ini kamu pertahankan, pasti akan sirna. Seiring kedatangan islam, kemusyrikan tidak akan memulai, dalam arti tidak akan tampil dalam bentuk yang baru, dan tidak pula akan mengulangi kembali dalam bentuk yang lama. ' kebenaran pasti akan menang dan kebatilan pasti akan musnah."
  }
]