[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul), “Kebenaran dan syariat yang agung telah datang dari Allah, kebatilan telah lenyap dan kekuasaannya telah sirna, sehingga tidak tersisa darinya yang bisa memulainya dan mengembalikannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Katakanlah -wahai Rasul- kepada orang-orang musyrikin yang mendustakan itu, “Kebenaran telah datang, yaitu Islam, dan kebatilan telah sirna tanpa meninggalkan bekas dan kekuatan apa pun, tidak memiliki pengaruh lagi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Katakanlah: “Kebenaran telah datang, tanda-tandanya telah jelas, dan dalil-dalilnya telah ditegakkan. Sedangkan kebatilan telah tercerai-berai dan hancur syubhatnya, sehingga tidak ada lagi kekuatannya; ia telah sirna dan telah tercampakkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قُلْ جَآءَ الْحَقُّ (Katakanlah: “Kebenaran telah datang) Yakni Islam dan tauhid dan al-Qur’an yang mengandung bukti-bukti dan hujjah yang kekuatan dan kekuasaannya pasti akan datang. وَمَا يُبْدِئُ الْبٰطِلُ وَمَا يُعِيدُ(dan yang batil itu tidak akan memulai dan tidak (pula) akan mengulangi”) Yakni kebatilan telah musnah, tidak akan mulai dan datang lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Katakanlah bahwa kebenaran telah datang, yaitu Islam dan ketauhidan, dan jejak kesyirikan tidak akan tersisa lagi di Mekah setelah ini. Yang dimaksud dengan kebathilan yang hilang disini yaitu kekufuran. Al-Ibda’ adalah terjadinya sesuatu yang pertama kali dan Al-I’adah adalah terjadinya sesuatu kedua."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Telah datang} telah tampak {kebenaran dan yang bathil itu tidak akan memulai dan tidak (pula) akan mengulangi (sesuatu)} kebathilan lenyap sehingga tidak menyisakan apapun darinya, dimana bisa memulai ataupun mengulangi apa pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Maka dari itu Dia berfirman, “Katakanlah, ‘Kebenaran telah datang’,” maksudnya, kebenaran telah jelas, Nampak dan menjadi laksana matahari, dan kekuatannya sudah jelas, “dan yang batil itu tidak akan memulai dan tidak pula akan mengulangi,” maksudnya, ia menjadi redup dan keadaannya menjadi sirna serta hilang kekuatannya, maka ia tidak akan memulai dan tidak pula akan mengulangi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 49: Katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Sungguh telah datang islam dan tauhid serta cahaya, dan telah musnah kebathilan, syirik dan kegelapan, dan tidak tertinggal satu kebathilanpun. Tidak di depan maupun di belakang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni telah tampak bersinar dan terang sebagaimana terangnya matahari. Maksudnya ialah apabila kebenaran sudah datang maka kebatilan akan hancur binasa dan tidak dapat berbuat sesuatu untuk melawan dan meruntuhkan kebenaran itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 49",
    "description": "Katakanlah, 'kebenaran, yakni islam, telah datang dan yang batil itu, yakni kekufuran yang selama ini kamu pertahankan, pasti akan sirna. Seiring kedatangan islam, kemusyrikan tidak akan memulai, dalam arti tidak akan tampil dalam bentuk yang baru, dan tidak pula akan mengulangi kembali dalam bentuk yang lama. ' kebenaran pasti akan menang dan kebatilan pasti akan musnah. 50. Katakanlah, 'jika seandainya aku sesat maka sesungguhnya aku sesat untuk diriku sendiri. Kemudaratan akibat kesesatan itu pasti akan menimpaku. Dan jika aku mendapat petunjuk maka itu disebabkan apa yang diwahyukan tuhanku kepadaku. Sungguh, dia maha mendengar setiap perkataan, mahadekat dengan orang yang memanggil-Nya dan berdoa kepada-Nya. '(lihat juga: al-baqarah/2: 186 dan q'f/50: 16)."
  }
]