[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang berusaha menghalang-halangi jalan Allah, mendustakan para utusanNya dan membatalkan ayat-ayatNya, seraya menentang dan melawan perintah Allah, mereka mendapatkan azab terburuk dan terberat kepedihannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan orang-orang yang berusaha keras untuk memadamkan ayat-ayat yang Allah turunkan, mereka berkata tentangnya bahwa ia adalah sihir, mereka berkata tentang Rasul kami bahwa dia adalah kahin (dukun), penyihir, dan penyair. Orang-orang yang demikian akan mendapatkan azab yang paling buruk dan paling keras pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Sedangkan orang-orang yang berusaha menghalangi dan mengolok ayat-ayat Allah, menentang orang yang beriman dan mendakwahkannya, maka orang-orang yang jauh dari rahmat Allah itu akan mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَالَّذِينَ سَعَوْ فِىٓ ءَايٰتِنَا مُعٰجِزِينَ (Dan orang-orang yang berusaha untuk (menentang) ayat-ayat Kami dengan anggapan mereka dapat melemahkan) Yakni berusaha untuk melawan ayat-ayat yang Kami turunkan kepada para Rasul, mereka mengira dapat meloloskan diri dari Kami karena mereka percaya bahwa mereka tidak akan dibangkitkan. أُو۟لٰٓئِكَ(mereka itu) Yakni orang-orang yang berusaha menentang itu. لَهُمْ عَذَابٌ مِّن رِّجْزٍ(memperoleh azab, yaitu (jenis) azab) Makna (الرجز) adalah azab yang paling berat dan paling buruk. أَلِيمٌ(yang pedih) Yakni sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Orang-orang yang menentang ayat-ayat Kami dengan bermaksud untuk mengalahkan Kami, mereka mengira bahwa Kami tidak berkuasa untuk menghitung dan memberi balasan atas perbuatan mereka. Merekalah orang-orang yang akan mendapatkan azab yang sangat pedih dan sangat menyakitkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berusaha untuk (menentang) ayat-ayat Kami dengan anggapan dapat melemahkan (Kami)} mereka berusaha menentang ayat Kami dengan mengira bahwa mereka mampu melemahkan Kami {mereka itulah orang-orang yang memperoleh azab, yaitu siksa yang sangat pedih} azab yang paling buruk dan paling dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “dan orang-orang yang berusaha untuk menentang ayat-ayat Kami dengan anggapan mereka dapat melemahkan,” maksudnya, mereka berupaya menentangnya karena kafir kepadanya dan untuk melemahkan orang yang datang membawanya dan melemahkan Tuhan yang menurunkannya, sebagaimana mereka telah berupaya melemahkanNya dalam penghidupan kembali orang-orang yang telah mati, “mereka itu memperoleh azab, yaitu azab yang pedih,” yakni sangat menyakitkan badan dan hati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 5: Adapun bagi mereka yang sombong yang memadamkan cahaya yang diberikan oleh Allah, dan memalingkan manusia dari jalan Allah, yang mereka menyangkan bahwa mereka akan melemahkan Allah dan kerisalahan Rasul-Nya ﷺ; Mereka akan mendapatkan seburuk-buruk adzab dan keburukan di hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni untuk melemahkan orang yang membawanya dan Tuhan yang menurunkannya, sebagaimana mereka menganggap Dia tidak mampu membangkitkan manusia setelah mati. Baik bagi badan maupun hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 5",
    "description": "Dan orang-orang yang berusaha untuk menentang ayat-ayat kami, baik yang terbentang di alam raya maupun yang termaktub dalam Al-Qur'an, dengan anggapan mereka dapat melemahkan dan menggagalkan azab kami'sungguh anggapan mereka salah'mereka itu pasti akan memperoleh azab sebagai hukuman atas kedurhakaan mereka, yaitu jenis azab yang sangat pedih. 6. Dan berbeda dari sikap orang kafir yang mengingkari ayat-ayat Allah, orang-orang yang diberi ilmu, baik ahlulkitab maupun orang mukmin, mereka berpendapat bahwa Al-Qur'an yang diturunkan kepadamu dari tuhanmu, wahai nabi Muhammad, itulah yang benar dan memberi petunjuk bagi manusia kepada jalan Allah yang mahaperkasa, maha terpuji zat dan perbuatan-Nya."
  }
]