[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah, “Bila aku menyimpang dari kebenaran, maka aku sendiri yang memikul dosa dari kesesatanku, namun bila aku istiqamah di atasnya, maka hal itu dengan wahyu Allah yang Dia wahyukan kepadaku. Sesungguhnya Tuhanku Maha Mendengar apa yang aku katakan kepada kalian, Maha dekat kepada orang yang meminta dan berdoa kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Katakanlah -wahai Rasul- kepada orang-orang musyrikin yang mendustakan , “Bila aku tersesat dari kebenaran dalam apa yang aku sampaikan kepada kalian, maka bencana kesesatanku hanya menimpa diriku, kalian tidak terkena sedikit pun dampaknya, tetapi bila aku di atas petunjuk, maka sebabnya adalah apa yang Rabbku wahyukan kepadaku, sesungguhnya Dia Maha mendengar perkataan hamba-hamba-Nya, Maha dekat sehingga mudah saja bagi-Nya untuk mendengar apa yang aku katakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Hai Muhammad, katakanlah: “Jika aku tersesat, maka dosa kesesatanku akan aku tanggung sendiri, tidak ada orang lain yang dapat memikulnya; dan jika aku mendapat hidayah, maka aku tidak mendapat hidayah melainkan berkat hidayah yang Allah berikan kepadaku melalui wahyu. Allah Maha Mendengar segala suara, Maha Mengabulkan setiap hamba yang berdoa, dan Maha Dekat kepada hamba-hamba-Nya dengan ilmu, kekuasaan, dan pengawasan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قُلْ إِن ضَلَلْتُ (Katakanlah: “Jika aku sesat) Dari jalan kebenaran yang jelas. فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفْسِى ۖ( maka sesungguhnya aku sesat atas kemudharatan diriku sendiri) Yakni dosa kesesatanku akan aku tanggung sendiri. وَإِنِ اهْتَدَيْتُ فَبِمَا يُوحِىٓ إِلَىَّ رَبِّىٓ ۚ( dan jika aku mendapat petunjuk maka itu adalah disebabkan apa yang diwahyukan Tuhanku kepadaku) Berupa hikmah, pelajaran, dan penjelasan dalam al-Qur’an. إِنَّهُۥ سَمِيعٌ قَرِيبٌ(Sesungguhnya Dia Maha Mendengar lagi Maha Dekat) Yakni dekat kepadaku dan kepada kalian, Maha Mengetahui petunjuk dan kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Wahai Nabi, katakanlah kepada orang-orang musyrik: “Jika aku tersesat dari kebenaran dan hidayah karena meninggalkan peribadatan leluhurku maka sesungguhnya dosa kesesatanku itu untuk diriku. Sesungguhnya aku mendapat petunjuk menuju kebenaran dengan Al-Qur’an yang diwahyukan Tuhanku kepadaku. Sesungguhnya Allah SWT Maha Mendengar ucapan hamba-hambaNya dan Maha Dekat yang mengabulkan doanya orang yang mau berdoa”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Jika aku sesat, sesungguhnya aku sesat untuk diri sendiri dan jika aku mendapat petunjuk, maka hal itu disebabkan apa yang diwahyukan Tuhanku kepadaku. Sesungguhnya Dia Maha Mendengar lagi Maha dekat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Setelah kebenaran menjadi jelas melalui seruan yang diserukan oleh Rasul, yang mana sebelumnya orang-orang yang mendustakannya menuduhnya sesat, maka Allah memberitakan kepada mereka tentang yang haq, dan menjelaskannya kepada mereka dan menyingkap ketidakberdayaan mereka untuk menentangnya. Dan Allah memberitakan kepada mereka bahwa tuduhan sesat yang dialamatkan kepadanya sama sekali tidak membahayakan yang haq itu sedikit pun dan tidak pula bisa mencegah apa yang beliau bawa. Dan sesungguhnya, kalau beliau sesat (ini tidak mungkin, ini merupakan sikap merendahkan diri dalam berdebat) , maka sesungguhnya kesesatannya hanya akan menimpa dirinya sendiri. Maksudnya, kesesatannya hanya terbatas menimpa dirinya, tidak berpengaruh kepada orang lain. “Dan jika aku mendapat petunjuk,” maka hal ini bukan dari diriku, bukan karena kemampuan atau kekuatanku. Sesungguhnya petunjukku adalah karena sesuatu “yang diwahyukan Rabbku kepadaku.” Dia-lah sumber hidayahku, sebagaimana Dia pulalah sumber hidayah bagi selainku. Sesungguhnya Rabbku Maha Mendengar semua perkataan dan semua suara. Dia Mahadekat dari orang yang berdoa kepadaNya, memohon dan beribadah kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 50: Katakanlah kepada mereka wahai Nabi Allah : Jika aku memang tersesat dan jauh dari jalan kebenaran; Maka dosanya akan kembali kepadaku (Dan Rasul dijauhkan akan hal ini), dan jika aku mendapatkan petunjuk maka bukanlah dariku dan kemampuanku, akan tetapi dari yang memberikan aku wahyu yang (yaitu datang dari Tuhanku) dari hikmah dan nasihat-nasihat serta penjelasan Al Qur’an. Sungguh Tuhanku maha mendengar seluruh suara, dekat dengan hamba-Nya dan mengabulkan jika ada yang berdoa dan beriman pada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika kebenaran yang didakwahkan Rasulullah shallallahu 'alaihi wa sallam semakin jelas, sedangkan orang-orang yang mendustakan malah menuduh Beliau sesat, maka Allah Subhaanahu wa Ta'aala memberitahukan kebenaran itu dan menerangkannya kepada mereka, serta menerangkan kelemahan mereka untuk mengadakan perlawanan kepada kebenaran serta memberitahukan, bahwa tuduhan sesat kepada Beliau tidaklah berpengaruh apa-apa terhadap kebenaran dan tidak dapat membantahnya, dan kalau pun Beliau memang sesat –dan tidak mungkin bagi Beliau untuk tersesat-, maka akibatnya untuk diri Beliau tidak kepada yang lain, dan jika Beliau mendapatkan petunjuk, maka bukan karena kemampuan Beliau dan kekuatan Beliau, akan tetapi karena wahyu yang Allah berikan kepada Beliau, di mana wahyu tersebut merupakan inti dari hidayah bagi Beliau dan selain Beliau. Berupa Al Qur’an dan hikmah (As Sunnah). Semua perkataan dan semua suara. Dengan orang yang berdoa dan meminta kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 50",
    "description": "Katakanlah, 'jika seandainya aku sesat maka sesungguhnya aku sesat untuk diriku sendiri. Kemudaratan akibat kesesatan itu pasti akan menimpaku. Dan jika aku mendapat petunjuk maka itu disebabkan apa yang diwahyukan tuhanku kepadaku. Sungguh, dia maha mendengar setiap perkataan, mahadekat dengan orang yang memanggil-Nya dan berdoa kepada-Nya. '(lihat juga: al-baqarah/2: 186 dan q'f/50: 16)51. Meski kebenaran ajaran nabi Muhammad sudah terbukti dan alasan penolakan kaum kafir dipatahkan, tetap saja ada sebagian orang yang memilih kekafiran. Ayat berikut menggambarkan siksa yang akan mereka terima di akhirat. Dan alangkah mengerikan sekiranya engkau melihat mereka, orang-orang kafir, ketika terperanjat ketakutan pada hari kiamat ketika dihadapkan kepada tuhan mereka; lalu mereka tidak dapat melepaskan diri dan mereka ditangkap dari tempat yang dekat. Me-reka sudah berada di alam kubur sehingga sangat dekat untuk diseret ke neraka."
  }
]