[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya kamu (wahai Rasul) melihat saat orang-orang kafir itu ketakutan saat melihat azb Allah, niscaya kamu melihat suatu perkara yang dahsyat, tiada tempat berlari dan menyelamatkan diri bagi mereka, mereka digiring ke dalam neraka dari tempat yang dekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Seandainya kamu -wahai Rasul- melihat saat orang-orang yang mendustakan itu ketakutan ketika mereka melihat azab dengan mata kepala mereka di hari Kiamat, tidak ada tempat berlari bagi mereka darinya, tidak ada tempat berlindung bagi mereka darinya, mereka ditangkap dari tempat yang dekat yang mudah menciduk mereka sejak pertama kali, seandainya kamu melihat hal itu niscaya kamu melihat sesuatu yang ajaib."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Andai saja kamu melihat kejadian mengerikan saat mereka terkepung oleh ketakutan, ketika kematian mendatangi mereka, ketika mereka memasuki alam kubur dan ditanya oleh dua malaikat, dan ketika terjadi hari kiamat. Berbagai peristiwa mengerikan telah menunggu mereka, sehingga tidak ada tempat berlindung bagi mereka. Mereka akan diambil secara tiba-tiba dari padang mahsyar menuju neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَوْ تَرَىٰٓ إِذْ فَزِعُوا۟ (Dan (alangkah hebatnya) jikalau kamu melihat ketika mereka (orang-orang kafir) terperanjat ketakutan) Ketika kematian mendatangi mereka. Qatadah berpendapat ketakutan mereka ini adalah saat mereka keluar dari kubur mereka, ketika mereka menyaksikan hal yang mengerikan. فَلَا فَوْتَ(maka mereka tidak dapat melepaskan diri) Yakni mereka tidak akan ada yang lolos dari-Ku, dan tidak akan ada yang selamat. وَأُخِذُوا۟ مِن مَّكَانٍ قَرِيبٍ(dan mereka ditangkap dari tempat yang dekat (untuk dibawa ke neraka)) Yakni dari permukaan bumi, atau dari kubur, atau dari tempat perhitungan, mereka dekat dari-Nya dan tidak dapat menjauh atau melarikan diri dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Wahai Nabi, jika kamu melihat orang-orang kafir saat mereka takut dan resah pada hari kiamat, maka kamu akan terkejut bahwa tidak ada satupun dari mereka yang luput dariku, tidak ada yang selamat serta lari dari siksa. Mereka akan dilempar ke neraka Jahanam dari kuburan mereka atau dari tempat penghisaban dan mereka tidak mungkin bisa lari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya kamu melihat ketika mereka ketakutan} para pendusta itu ketakutan ketika memandang hari kiamat {Maka mereka tidak dapat melepaskan diri} maka tidak ada pertolongan dan tempat untuk lari {dan ditangkap dari tempat yang dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Allah berfirman “Dan jikalau kamu melihat,” wahai Rasul dan orang yang menduduki kedudukanmu, tentang keadaan mereka yang mendustakan “ketika mereka terperanjat ketakutan (pada Hari Kiamat),” di saat mereka melihat azab dan apa-apa yang telah diberitakan oleh para rasul serta apa-apa yang telah mereka dustakan, niscaya kamu melihat suatu perkara yang sangat mengerikan, pemandangan yang sangat menjijikan dan suatu kondisi yang sangat memuakkan serta kesengsaraan yang sangat dahsyat. Dan hal ini akan terjadi pada saat azab sedang menimpa mereka, sedangkan mereka sama sekali tidak mempunyai tempat untuk melarikan atau melepaskan diri darinya. “Dan mereka ditangkap dari tempat yang dekat,” maksudnya tidak jauh dari tempat azab. Malah mereka ditangkap lalu dilemparkan ke dalam api neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 51: Seandainya engkau wahai Nabi Allah melihat ketika mereka orang-orang kafir keluar dari kuburan-kuburan mereka terperanjat ketakutan, kemudian melihat adzab; Maka sungguh engkau akan melihat urusan yang besar, di mana engkau akan melihat mereka ketakutan atas apa yang telah mereka lihat. Tidak ada bagi mereka jalan keluar dan keselamatan dari adzab Allah, mereka telah dikembalikan kepada tempat balasan bagi mereka yaitu neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak jauh dari tempat azab, lalu mereka ditangkap dan dilemparkan ke dalam neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 51",
    "description": "Meski kebenaran ajaran nabi Muhammad sudah terbukti dan alasan penolakan kaum kafir dipatahkan, tetap saja ada sebagian orang yang memilih kekafiran. Ayat berikut menggambarkan siksa yang akan mereka terima di akhirat. Dan alangkah mengerikan sekiranya engkau melihat mereka, orang-orang kafir, ketika terperanjat ketakutan pada hari kiamat ketika dihadapkan kepada tuhan mereka; lalu mereka tidak dapat melepaskan diri dan mereka ditangkap dari tempat yang dekat. Me-reka sudah berada di alam kubur sehingga sangat dekat untuk diseret ke neraka. 52. Dan mereka berkata, 'kami beriman kepada-Nya. ' itulah harapan mereka. Namun bagaimana mereka dapat mencapai keimanan dari tempat yang jauh' hal itu tidak mungkin. Tempat manusia untuk beriman adalah di dunia, sedangkan mereka sudah berada di tempat yang jauh dari dunia, yaitu alam akhirat. Mereka baru menyatakan beriman setelah menyaksikan dahsyatnya azab pada hari kiamat."
  }
]