[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir berkata (ketika mereka melihat azab di akhirat), “Kami beriman kepada Allah, kitab-kitabNya dan utusan-utusanNya.” Bagaimana mungkin mereka menggapai iman di akhirat sementara jarak mereka dengan iman sangat jauh? Sungguh telah dihalangi antara mereka dan iman, karena tempat iman adalah di kehidupan dunia, sementara di sana mereka telah mengingkarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Mereka berkata manakala mereka melihat tempat kembali mereka, “Kami beriman kepada hari Kiamat.” Bagaimana iman mereka diterima sementara mereka beriman di waktu yang jauh dari waktu diterimanya iman dengan keluarnya mereka dari alam kehidupan dunia yang merupakan alam amal bukan alam pembalasan, menuju alam Akhirat yang merupakan alam pembalasan bukan alam amal?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Dan ketika itu mereka berkata: “Kami mempercayai Nabi ini dan hari kebangkitan yang dia janjikan.” Dan bagaimana hal itu diterima dari mereka, sedangkan masa telah berlalu dan mereka telah terlambat, catatan amalan mereka telah ditutup dan dunia telah selesai dan tidak mungkin kembali; maka permohonan mereka tidak akan didengar dan tangisan mereka tidak akan mendatangkan belas kasihan. Bagaimana mereka dapat menjangkau keimanan dari jauh, yaitu dari akhirat; sedangkan mereka telah meninggalkan kehidupan dunia. Dan atas dasar apa mereka dapat kembali ke dunia agar mereka dapat beriman?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَقَالُوٓا۟ ءَامَنَّا بِهِۦ (dan (di waktu itu) mereka berkata: “Kami beriman kepadanya”) Yakni kepada Muhammad. وَأَنَّىٰ لَهُمُ التَّنَاوُشُ(bagaimanakah mereka dapat mencapai (keimanan)) Yakni bagaimana mareka akan meraih keimanan dari kejauhan, yakni dari akhirat, sedangkan mereka telah meninggalkan dunia. مِن مَّكَانٍۭ بَعِيدٍ (dari tempat yang jauh itu) Ini merupakan permisalan dari keadaan mereka yang berharap keselamatan padahal itu telah terlewat dari mereka. Dan itu jauh sekali dari mereka, sebab mereka telah kafir sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Pada saat itu mereka berkata: “Kami beriman kepada Allah, Al-Qur’an dan Muhammad.” Bagaimana bisa mereka menerima keimanan dengan sangat mudah di alam akhirat yang sangat jauh dari tempat keimanan yang seharusnya, yaitu di dunia?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kami beriman kepadanya”} kepada hari kiamat {Namun bagaimana mungkin mereka dapat mencapai (keimanan) dari tempat yang jauh} lalu bagaimana mereka mencapai keimanan sedangkan mereka sungguh jauh dari tempat menerima keimanan itu dan mereka sudah ada di negeri akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Dan mereka berkata,” pada saat seperti itu, “Kami beriman kepada Allah dan kami membenarkan syariat yang telah kami dustakan, “dan” akan tetapi “bagaimanakah mereka dapat mencapai,” maksudnya, mencapai iman “dari tempat yang jauh itu,” karena sudah dihalangi antara mereka dengan iman, dan iman pun sudah menjadi hal yang mustahil pada kondisi ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 52: Maka ketika orang-orang musyrik melihat adzab, mereka berkata dengan penyesalan : Kami beriman kepada Allah dan membenarkan Rasul ﷺ, akan tetapi dapatkah memperoleh keimanan di akhirat ?! Dan tempat bagi keimanan adalah di dunia, tidak ketika ditimpakan adzab; Mereka menyesal ketika tidak berguna lagi penyesalan mereka dan juga taubat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Nabi Muhammad shallallahu 'alaihi wa sallam atau kepada Al Qur’an. Maksudnya setelah mereka melihat bagaimana dasyatnya azab pada hari kiamat itu, mereka pun mau beriman kepada Allah dan Rasul-Nya padahal tempat beriman itu sudah jauh yaitu di dunia. Kalau seandainya mereka beriman di waktu yang memungkinkan (di dunia), tentu iman mereka diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 52",
    "description": "Dan mereka berkata, 'kami beriman kepada-Nya. ' itulah harapan mereka. Namun bagaimana mereka dapat mencapai keimanan dari tempat yang jauh' hal itu tidak mungkin. Tempat manusia untuk beriman adalah di dunia, sedangkan mereka sudah berada di tempat yang jauh dari dunia, yaitu alam akhirat. Mereka baru menyatakan beriman setelah menyaksikan dahsyatnya azab pada hari kiamat. 53. Dan sungguh, mereka telah mengingkari Allah sebelum itu, yakni ketika mereka hidup di dunia; dan mereka mendustakan tentang yang gaib dari tempat yang jauh dengan tanpa dasar yang benar."
  }
]