[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka telah kafir kepada kebenaran di dunia, mendustakan para rasul, menuduh dengan dugaan dari jarak yang jauh dari kebenaran, mereka tidak mempunyai sandaran bagi dugaan batil mereka, maka tidak ada jalan bagi mereka untuk mendapatkan kebenaran, sebagaimana pemanah tidak mungkin mengenai sasarannya dari jarak yang sangat jauh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Bagaimana iman mereka bisa diterima sementara sebelumnya mereka telah kafir semasa hidup di dunia, mereka melemparkan sangkaan dari arah yang jauh dari titik kebenaran, mereka berkata tentang Rasul bahwa dia adalah penyihir, dukun dan penyair."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Dan bagaimana keimanan mereka akan diterima, sedangkan mereka dahulu telah kafir, membuat berbagai syubhat dan kebatilan, dan menyebarkan tuduhan, dan sangkaan dengan penuh kesombongan dan keberanian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَيَقْذِفُونَ بِالْغَيْبِ (dan mereka menduga-duga tentang yang ghaib) Yakni mereka mengira-ngira dengan berkata: tidak ada hari kebangkitan dan pengumpulan, tidak pula surga dan neraka. مِن مَّكَانٍۭ بَعِيدٍ (dari tempat yang jauh) Yakni dari sisi yang jauh, dugaan mereka yang batil tidak berdasar. Ayat ini mengandung perumpamaan keadaan mereka dengan keadaan orang yang ingin melempar sesuatu namun tanpa melihat sasarannya dari jarak yang jauh yang tidak mungkin terkena jika hanya mengira-ngira."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Sebelumnya, sungguh mereka mengingkari Allah dan rasulNya di dunia. Mereka memberikan anggapan-anggapan yang tidak mereka ketahui dengan berkata: “Tidak ada hari kebangkitan” Dari sisi yang jauh mereka tidak memiliki dasar atas anggapan bathil mereka. Maksudnya sesungguhnya orang yang melemparkan tuduhan dari tempat yang jauh itu jarang sekali mengalami sesuatu yang dituduhkan. Bagaimana bisa orang yang tidak melihat apapun melemparkan tuduhan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka telah mengingkarinya sebelum itu, dan melontarkan (keraguan) tentang yang gaib dari tempat yang jauh} dan melemparkan sangkaan tentang kebenaran itu dari tempat yang sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Kalau saja mereka beriman pada waktu mereka masih bisa beriman, tentu iman mereka diterima, akan tetapi “mereka telah mengingkari Allah sebelum itu; dan mereka ada jalan bagi orang yang melemparkan dari tempat yang jauh untuk bisa tepat sasaran. Demkikian pula kebatilan, ia mustahil akan bisa mengalahkan yang haq atau menolaknya. Ia hanya mempunyai kesempatan menikam pada saat yang haq lalai darinya. Lalu apabila yang haq itu muncul dan melawan kebatilan, maka ia dapat memadamkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 53: Mereka orang-orang kafir yang mengikrarkan penyesalan mereka berkata : Sesungguhnya mereka beriman dan membenarkan Rasul ﷺ; Mereka telah dusta dengan keimanan mereka dan mereka mengingkari ayat-ayat Allah dan Rasul-Nya di dunia, maka bagaimana mungkin mereka mendapatkan keimanan mereka pada hari ini ? Di mana mereka di dunia melemparkan keragu-raguan kepada Muhammad ﷺ dengan kedustaan karena sebab kebodohan mereka dan kesombongan mereka dengan menuduh : Rasulullah adalah tukang sihir, penyair, gila dan juga mengingkari dengan tidak adanya hari kebangkitan, surga, neraka. Mereka mengatakan demikian dengan tanpa sandaran dan bukti, maka keimanan mereka pada hari ini tidak ada manfaatnya; Perumpamaan mereka semisal meminta sesuatu yang sangat jauh dan tidak nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dunia. Yakni mereka gunakan kebatilan untuk mengalahkan kebenaran, padahal tidak mungkin kebatilan dapat mengalahkan yang hak. Kebatilan hanyalah punya kemampuan ketika kebenaran sedang lengah, karena jika yang hak (benar) tampil dan mendatangi yang batil, maka kebatilan itu pasti runtuh. Menurut Mujahid, mereka menuduh Nabi Muhammad shallallahu 'alaihi wa sallam dengan sangkaan, bukan dengan keyakinan, yaitu ucapan mereka bahwa Beliau pesihir, penyair dan dukun. Dengan demikian, maksudnya adalah mereka menuduh Beliau dengan sesuatu yang tidak mereka ketahui dan dari tempat yang tidak mereka ketahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 53",
    "description": "Dan sungguh, mereka telah mengingkari Allah sebelum itu, yakni ketika mereka hidup di dunia; dan mereka mendustakan tentang yang gaib dari tempat yang jauh dengan tanpa dasar yang benar. 54. Dan diberi penghalang antara mereka dengan apa yang mereka inginkan, yaitu beriman kepada Allah atau kembali ke dunia untuk bertobat, sebagaimana yang dilakukan terhadap orang-orang yang sepaham dengan mereka yang terdahulu dalam kekufuran. Sesungguhnya mereka dahulu di dunia dalam keraguan yang mendalam akan kepastian datangnya hari kebangkitan dan azab bagi orang-orang yang durhaka. []."
  }
]