[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu dihalangi dari apa yang mereka inginkan, yaitu taubat dan kembali ke dunia agar bisa beriman, sebagaimana Allah melakukan hal yang sama kepada orang-orang kafir seperti mereka dari umat-umat sebelumnya. Sesungguhnya mereka di dunia dalam kebimbangan dalam perkara para rasul, kebangkitan dan hisab, membuat keragu-raguan dan kegoncangan, oleh karena itu mereka tidak beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Orang-orang yang mendustakan itu dihalangi untuk mendapatkan apa yang mereka idam-idamkan berupa kesenangan hidup, mereka dihalangi dari tobat dari kekufuran dan keselamatan dari api Neraka, dihalangi dari kembali ke kehidupan dunia, sebagaimana dilakukan terhadap orang-orang yang seperti mereka dari kalangan umat-umat sebelum mereka yang mendustakan. Sesungguhnya mereka dalam keraguan terhadap apa yang dibawa oleh para tasul, yaitu mengesakan Allah dan iman kepada Kebangkitan, keraguan yang mendorong kepada kekufuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Dan mereka terhalang dari apa yang mereka inginkan, yaitu agar mereka dapat kembali ke dunia dan kemewahannya, sebagaimana mereka terhalang dari kenikmatan surga dan dari keimanan. Dahulu ketika di dunia mereka dalam keraguan dan kebimbangan; oleh sebab itu keimanan mereka tidak dapat diterima saat mereka telah menyaksikan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ (Dan dihalangi antara mereka dengan apa yang mereka ingini) Yakni yang mereka inginkan di dunia seperti harta dan keluarga, atau kembali ke dunia. كَمَا فُعِلَ بِأَشْيَاعِهِم مِّن قَبْلُ ۚ( sebagaimana yang dilakukan terhadap orang-orang yang serupa dengan mereka pada masa dahulu) Yakni orang-orang kafir dari umat-umat terdahulu yang seperti mereka. إِنَّهُمْ كَانُوا۟ فِى شَكٍّ مُّرِيبٍۭ( Sesungguhnya mereka dahulu (di dunia) dalam keraguan yang mendalam) Dalam urusan para rasul, hari kebangkitan, surga, dan neraka. Atau dalam masalah tauhid dan urusan agama yang disampaikan oleh para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Diberi batasan antara mereka dan sesuatu yang mereka inginkan berupa kesediaan untuk beriman atau kembali ke dunia sebagaimana yang dilakukan orang-orang kafir umat terdahulu dan taubat mereka tidak diterima. Sesungguhnya di dunia, mereka berada dalam kebimbangan yaitu antara keraguan dan tuduhan. Itu adalah kebimbangan tentang turunnya siksa kepada mereka, perintah rasul, hari kebangkitan, surga dan neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diberi penghalang} dihalangi dan dicegah {antara mereka dan apa yang mereka inginkan, sebagaimana yang dilakukan terhadap orang-orang yang serupa dengan mereka} dengan orang-orang kafir yang serupa dengan mereka {sebelumnya. Sesungguhnya mereka dahulu dalam keraguan yang mendalam} berada dalam keraguan dan sangkaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Dan dihalangi antara mereka dengan apa yang mereka ingini,” berupa berbagai syahwat, berbagai kelezatan, anak-anak, harta kekayaan, para pembantu dan bala tentara; masing-masing mereka menanggung amal perbuatan mereka sendiri dan datang sendiri-sendiri sebagaimana mereka dahulu diciptakan, dan mereka meninggalkan apa yang pernah mereka miliki di belakang mereka “sebagaimana yang dilakukan terhadap orang-orang yang serupa dengan mereka,” dari umat-umat terdahulu saat kebinasaan menimpa mereka, dihalnagi antara mereka dengan apa yang mereka inginkan. “SEsungguhnya mereka dahulu dalam keraguan yang mendalam,” yang membangkitkan keraguan dan kegoncangan hati. Maka dari itu, mereka tidak beriman, dan mereka tidak mencela pada saat diminta mencela."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 54: Mereka orang-orang kafir yang menginginkan keimanan kepada Allah dan menginginkan untuk membenarkan Rasulullah ﷺ pada hari kiamat; Telah dipisah oleh Allah atas harapan mereka dan tidak menerima taubat mereka. Sebagaimana yang tekah diperbuat oleh umat sebelum mereka yang kafir, karena sebab umat-umat sebelum mereka semisal dengan mereka ketika di dunia dengan keraguan terhadap agama ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mereka inginkan itu ialah beriman kepada Allah atau kembali ke dunia untuk bertobat. Oleh karena itulah mereka tidak mau beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 54",
    "description": "Dan diberi penghalang antara mereka dengan apa yang mereka inginkan, yaitu beriman kepada Allah atau kembali ke dunia untuk bertobat, sebagaimana yang dilakukan terhadap orang-orang yang sepaham dengan mereka yang terdahulu dalam kekufuran. Sesungguhnya mereka dahulu di dunia dalam keraguan yang mendalam akan kepastian datangnya hari kebangkitan dan azab bagi orang-orang yang durhaka. []1. Pada akhir surah saba' Allah menegaskan bahwa orang-orang kafir amat meragukan datangnya hari kiamat sehingga ketika hari itu datang mereka merasa sangat sengsara. Surah f'tir ini lalu dimulai dengan pujian kepada Allah yang mahakuasa atas segala sesuatu. Segala puji bagi Allah pencipta langit dan bumi, yang menjadikan malaikat sebagai utusan-utusan untuk mengurus berbagai hal sesuai kehendak-Nya. Di antara bukti kekuasaan-Nya adalah bahwa dia menciptakan malaikat yang mempunyai sayap, masing-masing ada yang dua, tiga, dan empat, bahkan lebih dari itu, sehingga mereka dengan mudah dan cepat berpindah dari satu tempat ke tempat lain. Hanya Allah yang mengetahui hakikat malaikat dan sayap-sayapnya tersebut. Allah berkuasa menambahkan pada ciptaan-Nya, baik malaikat maupun yang lain, apa yang dia kehendaki. Sungguh, Allah mahakuasa atas segala sesuatu tanpa ada yang mampu menghalangi."
  }
]