[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang diberi ilmu mengetahui bahwa al-Qur’an yang diturunkan kepadamu dari sisi Tuhanmu adalah haq, ia membimbing kejalan Allah yang Mahaperkasa yang tidak terkalahkan dan tidak terhalangi, sebaliknya Dia menundukkan segala sesuatu dan mengalahkannya, Maha Terpuji dalam firman-firman, perbuatan-perbuatan dan SyariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Ulama dari kalangan sahabat dan orang-orang yang beriman dari ulama ahli kitab mengakui bahwa wahyu yang Allah turunkan kepadamu adalah benar, tidak ada keraguan padanya, membimbing ke jalan Allah yang Maha Perkasa yang tidak dikalahkan oleh siapa pun, yang Maha Terpuji di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan orang-orang yang Allah berikan ilmu yang bermanfaat kepada mereka melihat bahwa apa yang Allah turunkan itu adalah kebenaran yang dapat menunjukkan jalan kepada Allah Yang Maha Perkasa Yang senantiasa memuliakan para kekasih-Nya, dan Yang Maha Terpuji. Itulah jalan kemuliaan dan jalan yang terpuji."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَيَرَى الَّذِينَ أُوتُوا۟ الْعِلْمَ الَّذِىٓ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ هُوَ الْحَقَّ (Dan orang-orang yang diberi ilmu (Ahli Kitab) berpendapat bahwa wahyu yang diturunkan kepadamu dari Tuhanmu itulah yang benar) Dan orang yang memiliki ilmu yang berada di atas kebenaran mengetahui bahwa apa yang diturunkan Allah kepadamu adalah kebenaran. Dan mereka adalah para sahabat. Pendapat lain mengatakan bahwa mereka adalah orang-orang beriman dari kalangan Ahli Kitab. وَيَهْدِىٓ إِلَىٰ صِرٰطِ الْعَزِيزِ الْحَمِيدِ(dan menunjuki (manusia) kepada jalan Tuhan Yang Maha Perkasa lagi Maha Terpuji) Dan orang-orang yang memiliki ilmu tentang kitab Allah mengetahui bahwa kitab ini memberi petunjuk kepada agama Allah, agama yang mengajarkan ketauhidan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Orang-orang yang mempunyai ilmu agama, yaitu para ulama ahli kitab, seperti Abdullah bin Salam dan teman-temannya bahwa Alquran yang telah Kami turunkan itu adalah suatu kebenaran yang pasti. Mereka bahwa Alquran adalah petunjuk bagi manusia menuju agama Allah yaitu pengesaan Allah. Juga sebagai jalan untuk memperoleh keridhoan Allah Pemilik kemuliaan dan kekuatan. Yang Maha Terpuji atas segala apapun yang dilakukan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang diberi ilmu berpendapat bahwa yang diturunkan kepadamu dari Tuhanmu itulah kebenaran dan memberi petunjuk ke jalan} jalan {Dzat Yang Maha perkasa lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Setelah Allah menjelaskan tentang keingkaran orang yang mengingkari kebangkitan, dan mereka memandang apa yang diturunkan kepada RasulNya itu tidak benar, maka Allah menjelaskan kondisi orang-orang yang mendapat taufik dari hamba-hambaNya. Mereka adalah para ahli ilmu, dan mereka memandang apa yang telah Allah turunkan kepada RasulNya, berupa al-KItab dan berita-berita yang terkandung di dalamnya “itulah yang benar,” maksudnya, kebenaran hanya terbatas pada apa yang ada di dalamnya, sedangkan apa saja yang menyalahi dan bertentangan dengannya adalah kebatilan. Sebab mereka dalam ilmunya telah mencapai pada tingkatan yakin. Dan mereka juga berpandangan bahwa pada perintah-perintah dan larangan-laranganNya, “menunjukkan kepada jalan Rabb Yang Mahaperlakasa lagi Maha Terpuji.” Hal itu karena sesungguhnya mereka memastikan kebenaran apa yang Allah beritakan dari berbagai sisi. Yaitu dari sisi ilmu pengetahuan mereka tentang kebenaran (kejujuran) orang yang memberitakannya; dan dari sisi sejalannya berita-berita itu dengan perkara-perkara yang terjadi dan dengan kitab-kitab suci terdahulu; dan juga dari sisi apa yang mereka saksikan dari berita-berita yang terjadi secara nyata; dan dari sisi apa-apa yang mereka saksikan, berupa tanda-tanda yang sangat besar yang membuktikan berita-berita tersebut, baik yang ada di jagat raya ataupun yang ada dalam diri mereka sendiri; dan dari sudut kesesuaian berita-berita tersebut dengan kandungan yang dikandung oleh nama-nama dan sifat-sifatNya. Dan mereka melihat perintah-perintah dan larangan-laranganNya memberi petunjuk kepada jalan yang lurus yang meliputi segala permasalahan dengan segala sifat yang dapat membersihkan jiwa dan mengembangkan pahala dan berguna bagi pelaku dan yang lainnya, seperti kejujuran, keikhlasan, berbakti kepada kedua orang tua, silaturahim (menjalin hubungan kerabat), berbuat baik kepada manusia pada umumnya dan lain-lainnya; dan melarang dari segala sifat yang buruk yang dapat menodai jiwa, menghapus pahala amal, dan memastikan dosa, seperti syirik, zina, riba, dan zhalim dalam masalah darah (jiwa), harta, dan kehormatan. Ini adalah kemuliaan bagi para ahlli imu, keutamaan dan taanda bagi mereka. Dan bahwa setiap kali seorang hamba makin agung (banyak) ilmunya dan makin meyakini kabar-kabar yang disampaikan oleh RasulNya, serta lebih mengetahui hikmah perintah-perintah dan larangan-laranganNya, maka dia termasuk ahli ilmu yang Allah jadikan sebagai hujjah (alasan, argument) atas ajaran yang dibawa oleh Rasulullah; dengan mereka Allah berargumen terhadap orang-orang yang mendustkan lagi menentang, sebagaimana dalam ayat ini dan ayat-ayat lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 6: Allah mengabarkan bahwasanya ahli iman yang Allah telah berikan mereka ilmu yang bermanfaat, mereka memandang bahwasanya apa yang diturunkan Allah dari Al Qur’an adalah sebuah kebenaran yang tidak ada keraguan, dan sesungguhnya Al Qur’an itu memberikan petunjuk kepada jalan yang lurus yaitu tauhid dan islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keingkaran orang-orang yang mengingkari kebangkitan, di mana mereka berpendapat, bahwa apa yang diturunkan kepada rasul-Nya tidak benar, maka Allah Subhaanahu wa Ta'aala menyebutkan tentang orang-orang yang diberi taufik oleh Allah di antara hamba-hamba-Nya. Mereka inilah Ahli Ilmu. Mereka berpendapat, bahwa apa yang Allah turunkan kepada Rasul-Nya adalah benar, demikian pula kandungannya, sedangkan yang menyelisihinya dan bertentangan dengannya adalah batil. Pengetahuan mereka telah mencapai derajat yakin. Di samping itu, mereka (Ahli ilmu) juga berpendapat, bahwa perintah dan larangannya menunjukkan kepada jalan Tuhan yang Mahaperkasa lagi Maha Terpuji. Yang demikian adalah karena mereka membenarkannya karena berbagai sisi; sisi pengetahuan mereka tentang benarnya yang memberitakannya, sisi kesesuaiannya dengan kenyataan, sisi kesesuaiannya dengan kitab-kitab terdahulu, sisi berita yang mereka saksikan yang terjadi di hadapan mereka secara langsung, sisi ayat-ayat yang besar yang mereka saksikan yang menunjukkan kebenarannya baik di berbagai ufuk maupun dalam diri mereka sendiri, dan dari sisi kesesuaiannya dengan yang ditunjukkan oleh nama-nama dan sifat-Nya. Menurut sebagian mufassir, yang dimaksud orang-orang yang diberi ilmu di sini adalah orang-orang yang beriman dari kalangan Ahli Kitab, seperti Abdullah bin Salam dan kawan-kawannya. Mereka (Ahli Ilmu) juga berpendapat tentang perintah dan larangan, bahwa perintah dan larangannya menunjukkan ke jalan yang lurus, mengandung perintah kepada setiap sifat yang menyucikan jiwa, menumbuhkan pahala, memberi faedah bagi orang yang mengamalkannya dan selainnya, seperti perintah bersikap jujur, ikhlas, berbakti kepada kedua orang tua, menyambung tali silauturrahim, berbuat ihsan kepada semua makhluk, dsb. Demikian pula melarang setiap sifat tercela yang menodai jiwa, menghapuskan pahala, menghendaki dosa, seperti syirk, zina, riba, berlaku zalim terhadap darah, harta dan kehormatan. Ini adalah keutamaan Ahli ilmu dan kelebihannya serta tandanya, di mana setiap kali ilmu seseorang semakin dalam dan selalu membenarkan berita yang dibawa rasul serta semakin dalam pengetahuannya terhadap perintah dan larangan, maka ia termasuk Ahli Ilmu yang Allah jadikan sebagai hujjah terhadap yang dibawa Rasul, di mana Allah menjadikan mereka sebagai hujjah terhadap orang-orang yang mendustakan lagi membangkang sebagaimana dalam ayat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 6",
    "description": "Dan berbeda dari sikap orang kafir yang mengingkari ayat-ayat Allah, orang-orang yang diberi ilmu, baik ahlulkitab maupun orang mukmin, mereka berpendapat bahwa Al-Qur'an yang diturunkan kepadamu dari tuhanmu, wahai nabi Muhammad, itulah yang benar dan memberi petunjuk bagi manusia kepada jalan Allah yang mahaperkasa, maha terpuji zat dan perbuatan-Nya. 7. Walaupun orang yang diberi ilmu mengakui kebenaran Al-Qur'an, keingkaran orang kafir tidak pernah berubah, bahkan mereka mence-mooh nabi Muhammad. Dan orang-orang kafir berkata kepada teman-temannya, 'maukah kami tunjukkan kepadamu seorang laki-laki yang memberitakan kepadamu bahwa apabila badanmu telah hancur sehancur-hancurnya oleh tanah atau sebab apa pun, lalu kamu pasti akan dibangkitkan kembali dalam ciptaan yang baru' \"seorang laki-laki yang mereka maksud adalah nabi Muhammad. Mereka berkata demikian untuk menghina beliau."
  }
]