[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagian orang-orang kafir itu berkata kepada sebagian yang lain dalam rangka memperolok-olok, “maukah kalian kami tunjukkan seorang laki-laki (maksud mereka adalah Muhammad) yang mengabarkan kepada kalian bahwa bila kalian sudah mati dan jasad kalian telah hancur sehancur-hancurnya, kalian akan dihidupkan dan dibangkitkan kembali dari kubur kalian? Mereka mengatakan hal ini karena pengingkaran mereka yang melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sebagian orang-orang kafir berkata kepada sebagian lainnya dalam konteks menghina dan melecehkan apa yang dibawah oleh Rasulullah -ṣallallāhu 'alaihi wa sallam-, “Apakah kalian mau kami tunjukkan seorang laki-laki yang menyatakan bahwa bila kalian sudah mati dan jasad kalian hancur, kalian tetap akan dibangkitkan sesudahnya dalam keadaan hidup?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Orang-orang kafir mengolok: “Maukah kami tunjukkan kepada kalian seorang lelaki yang menganggap jika tubuh kalian telah hancur dan tulang kalian telah tercerai berai, dan kalian telah menjadi tanah maka kalian akan dibangkitkan kembali?” Ini merupakan bentuk besarnya ketidakpercayaan dan keraguan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَقَالَ الَّذِينَ كَفَرُوا۟ (Dan orang-orang kafir berkata) Yakni sebagian orang kafir berkata kepada sebagian lainnya. هَلْ نَدُلُّكُمْ عَلَىٰ رَجُلٍ(Maukah kamu kami tunjukkan kepadamu seorang laki-laki) Yang dimaksud adalah Muhammad. يُنَبِّئُكُمْ(yang memberitakan kepadamu) Yakni memberitahukan kalian dengan suatu perkara yang mengherankan dan berita yang aneh. إِذَا مُزِّقْتُمْ كُلَّ مُمَزَّقٍ(apabila badanmu telah hancur sehancur-hancurnya) Yakni kalian akan benar-benar dihancur-leburkan, dan kalian setelah kematian akan menjadi tulang belulang dan tanah yang tercerai berai. إِنَّكُمْ لَفِى خَلْقٍ جَدِيدٍ(sesungguhnya kamu benar-benar (akan dibangkitkan kembali) dalam ciptaan yang baru) Yakni kalian kemudian akan diciptakan kembali dan dibangkitkan dari kubur kalian dalam keadaan hidup dengan bentuk kalian yang dahulu? Mereka mengatakan ini untuk mengejek hari kebangkitan yang dijanjikan Allah kepada mereka melalui lisan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Beberapa orang kafir karena takjub dan menganggap itu sebagai sihir mengatakan: “Apakah kami telah menunjukkanmu seorang laki-laki, dia adalah Muhammad SAW.” Mereka berpura-pura tidak faham dan tidak mengetahui, padahal mereka tahu. “Dia mengkhabarkan kepada kalian sesuatu yang menakjubkan, bahwa jika kalian nanti sudah jadi hancur dan lebur bersama tanah, dan menjadi debu maka setelah itu kalian akan dibangkitkan kembali dan menciptakan kalian dengan jasad yang baru lagi kemudian kalian akan dibangkitkan dari kubur kalian dalam keadaan hidup. Amal kalian akan dihitung dan ditimbang kemudian akan diberi balasan, sesudah kalian lebur menjadi debu? Mumazzaq adalah masdar mim dari wazan ismul maf’ul yang bermakna dileburkan dengan selebur leburnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ingkar berkata,“Apakah kalian mau kami tunjukkan} menunjukkan kepada kalian {seorang laki-laki yang memberitakan kepada kalian} memberitahu kalian {bahwa apabila kalian telah dihancurkan sehancur-hancurnya} kalian mati dan terpotong menjadi beberapa bagian {sesungguhnya kalian akan menjadi ciptaan yang baru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Maksudnya, “dan orang-orang kafir berkata,” dengan maksud mendustakan, memperolok-olok dan menganggap tidak mungkin mendustakan, memperolok-olok dan menganggap tidak mungkin, serta menyebutkan sisi ketidak-mungkinannya. Sebagian mereka berkata kepada sebagian yang lain, “Maukah kamu agar kami tunjukkan seorang laki-laki yang memberitakan kepadamu bahwa apabila badanmu telah hancur sehancur-hancurnya, sesungguhnya kamu benar-benar dalam ciptaan yang baru?” yang mereka maksud orang laki-laki itu adalah rasulullah. Beliau dianggap orang laki-laki yang membawa sesuatu yang sangat aneh, hingga (menurut anggapan mereka), beliau menjadi tontonan yang mereka tonton dan keanehan yang mereka perolok-olokkan; daan bahwa bagaimana mungkin dia mengatakan, “sesungguhnya kalian pasti akan dihidupkan kembali setelah kalian hancur lebur dan tulang-belulang kalian telah tercerai-berai dan sudah sirna seluruh anggota badan kalian.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 7: Allah mengulangi pada ayat ini pengingkaran orang-orang kafir akan hari kebangkitan dan kebodohan mereka yang tidk menggunakan akal-akal mereka agar selamat dari adzab-Nya; Allah mengabarkan atas apa yang telah mereka katakana, di mana mereka mengatakan dengan pelecehan dan penghinaan : Apakah kalian akan menunjukkan kami kepada seorang laki-laki (maksud mereka adalah Muhammad ﷺ) yang mengabarkan kepada kalian bahwa ketika kalian mati kemudian bercerai berai jasad-jasad kalian dan menjadi mayit, kemudian kalian kemudian akan dihidupkan dan dibangkitkan dari kubur-kubur kalian pada kali yang lain ? Ini adalah petunjuk atas kerasanya pengingkaran mereka akan hari kebangkitan dan mereka menjauh akan pembenaran hari kebangkitan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan maksud mendustakan, mengolok-olok, menganggap mustahil dan menyebutkan sisi kemustahilannya. Yang dimaksud dengan seorang laki-laki oleh orang-orang kafir itu ialah Nabi Muhammad shallallahu 'alaihi wa sallam. Menurut mereka, Beliau telah datang membawa sesuatu yang aneh bagi mereka sehingga Beliau menjadi bahan olok-olokan mereka, mereka mengatakan, “Mengapa ia mengatakan, “Bahwa kalian akan dibangkitkan setelah mati dan telah terpisah anggota badan kalian.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 7",
    "description": "Walaupun orang yang diberi ilmu mengakui kebenaran Al-Qur'an, keingkaran orang kafir tidak pernah berubah, bahkan mereka mence-mooh nabi Muhammad. Dan orang-orang kafir berkata kepada teman-temannya, 'maukah kami tunjukkan kepadamu seorang laki-laki yang memberitakan kepadamu bahwa apabila badanmu telah hancur sehancur-hancurnya oleh tanah atau sebab apa pun, lalu kamu pasti akan dibangkitkan kembali dalam ciptaan yang baru' \"seorang laki-laki yang mereka maksud adalah nabi Muhammad. Mereka berkata demikian untuk menghina beliau. 8. Lalu teman-teman mereka sesama kafir menimpali dengan balik bertanya guna mempertajam cemoohan mereka, 'apakah dia, yakni nabi Muhammad, mengada-adakan kebohongan terhadap Allah atau sedang sakit gila'' tidak! keduanya itu tidak akan pernah terjadi pada diri rasulullah, karena nabi adalah al-am'n (orang tepercaya) dan beliau pun sama sekali tidak gila, tetapi orang-orang yang tidak beriman kepada akhirat itu kelak di akhirat berada dalam siksaan dan ketika di dunia berada dalam kesesatan yang jauh, sehingga mereka menolak keniscayaan hari kiamat dan mengingkari kebenaran Al-Qur'an."
  }
]