[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah laki-laki itu berdusta atas Nama Allah atau dia gila sehingga dia berbicara sesuatu yang tidak dia sadari?” perkaranya tidak seperti yang dikira oleh orang-orang kafir itu, sebaliknya Muhammad adalah orang yang paling jujur di antara orang-orang yang jujur. Dan orang-orang yang tidak mempercayai kebangkitan dan tidak beramal untuknya mereka dalam azab yang terus-menerus di akhirat dan kesesatan yang jauh dari kebenaran di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan mereka berkata, “Apakah laki-laki ini membuat kebohongan atas nama Allah lalu dia menyatakan bahwa kita akan dibangkitkan sesudah kematian atau orang ini adalah orang gila yang berkata dan meracau dengan kata-kata yang tak bermakna? Perkaranya tidak sebagaimana yang mereka kira, yang terjadi adalah bahwa orang-orang yang tidak mempercayai kehidupan Akhirat adalah orang-orang yang berada di dalam azab yang berat pada hari Kiamat, di dalam kesesatan yang jauh dari kebenaran di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Apakah dia membuat kedustaan terhadap Allah dengan anggapan itu, atau dia memang gila? Namun orang-orang yang mengingkari akhirat itulah yang sangat sesat dengan tidak menghiraukan ayat-ayat Allah dan mengingkari Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَفْتَرَىٰ عَلَى اللهِ كَذِبًا أَم بِهِۦ جِنَّةٌۢ ۗ (Apakah dia mengada-adakan kebohongan terhadap Allah ataukah ada padanya penyakit gila?”) Yakni mereka berkata: “apakah dia berbohong dalam ucapannya, atau dia adalah orang gila yang tidak mengerti apa yang dia katakan? بَلِ الَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ فِى الْعَذَابِ وَالضَّلٰلِ الْبَعِيدِ (tetapi orang-orang yang tidak beriman kepada negeri akhirat berada dalam siksaan dan kesesatan yang jauh) Yakni kenyataannya bukan seperti yang mereka katakan. Namun sebenarnya orang-orang yang tidak memahami kenyataan kemudian mengingkari kehidupan akhirat dan tidak beriman kepada apa yang dibawa oleh Rasul akan menjadikan mereka berada di dalam azab yang kekal di akhirat, dan kini mereka berada dalam kesesatan yang sangat jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Orang-orang musyrik berkata: Apakah dia membuat kebohongan dengan dalih membawa risalah kenabian, ataukah dia memang punya penyakit gila?” Sesungguhnya orang-orang yang mendustakan alam akhirat dan hari kebangkitan itulah yang akan mendapatkan azab neraka, dan akan dijauhkan dari kebenaran hakiki. Maksud dari itu adalah telah ditanamkan kepada mereka dua hal yang sangat buruk yaitu kesesatan dan azab. Bal adalah huruf yang menunjukkan/berfungsi untuk membatalkan kalimat sebelumnya dan menetapkan kalimat sesudahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah dia mengada-adakan} apakah dia membuat-buat {kebohongan besar terhadap Allah atau gila} gila {tetapi orang-orang yang tidak beriman kepada akhirat itu benar-benar dalam siksaan dan kesesatan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Orang laki-laki ini yang datang dengan membawa berita seperti itu, apakah dia mengada-adakan “kebohongan terhadap Allah” sehingga dia lancang kepadaNya, lalu mengatakan apa yang telah ia katakana itu, “ataukah ada padanya penyakit gila?” (Kalau demikian) , maka tidak perlu merasa aneh dengannya, karena kegilaan itu seni! Semua (sikap mereka) ini dengan nada keras kepala dan zhalim. Padahal sebelumnya mereka sudah mengetahui bahwasanya beliau adalah makhluk Allah yang paling jujur dan paling berakal. Di antara (bukti) pengetahuan mereka adalah bahwa mereka menampakkan dan mengulangi permusuhannya, mereka mengorbankan diri dan harta benda mereka untuk menghalang-halangi manusia dari Rasulullah. Maka, kalau sekiranya rasul itu dusta dan gila, tentu sangat tidak pantas bagi kalian, wahai orang-orang yang mempunyai akal tidak sehat, tidak pantas kalau kalian mendengarkan perkataan yang dia katakan atau mengerumuni dakwahnya. Sebab, orang gila itu sangat tidak pantas kalau orang yang berakal memperhatikannya, atau perkataannya sampai (ke telinganya). Kalau saja bukan karena sikap keras kepala dan kezhaliman kalian, tentu kalian segera memenuhi seraunnya dan niscaya kalian menyambut dakwahnya dengan senang. Akan tetapi, ayat-ayat (mukjizat-mukjizat) dan para rasul sama sekali sudah tidak berguna bagi orang-orang yang tidak beriman. Maka dari itu Allah berfirman, “Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat.” Dan di antara mereka adalah orang-orang yang mengatakan perkataan di atas, “berada dalam siksaan dan kesesatan yang jauh.” Maksudnya, di dalam kesengsaraan yang sangat dahsyat dan kesesatan yang sangat jauh, yang sangat tidak dekat kepada yang benar. Kesengsaraan dan kesesatan apa yang lebih dahsyat daripada keingkaran mereka terhadap kekuasaan Allah untuk menghidupkan kembali? Dan kesengsaraan dan kesesatan apa yang lebih dahsyat daripada pendustaan mereka terhadap RasulNya yang datang dengan membawa berita kebangkitan serta ejekan mereka terhadapnya dan keteguhan pendirian mereka bahwa ajaran yang mereka anutlah yang benar? Jadi, mereka melihat yang benar sebagai kebatilan, dan kebatilan sebagai kebenaran dan petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 8: Kemudian mereka orang-orang kafir saling bertanya-tanya untuk mencemooh dan merendahkan dengan berkata : Apakah lelaki ini telah membuat kebohongan (maksudnya adalah Muhammad ﷺ) atas nama Allah dengan mengklaim bahwasanya manusia akan dibangkitkan setelah kematian mereka pada hari kiamat ? atau apakah dia sudah terkena penyakit gila ?. Allah kemudian menjawab perkataan mereka : Urusannya tidaklah sebagaimana yang mereka orang-orang kafir katakan; Bahkan sesungguhnya orang-orang yang mengingkari hari kebangkitan akan mendpatkan penderitaan yang amat dan juga terjatu dalam kesesatan yang besar, serta penyimpangan yang tiada akhir di dunia maupun di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Semua ini sebenarnya karena pembangkangan dan kezaliman mereka. Sesungguhnya mereka mengetahui, bahwa Beliau adalah manusia yang paling benar dan paling berakal. Termasuk hal yang menunjukkan bahwa mereka tahu tentang kebenaran Beliau adalah bahwa mereka menampakkan permusahan dengan Beliau, mereka korbankan diri dan harta untuk menghalangi manusia dari Beliau. Jika seandainya Beliau adalah seorang pendusta atau orang gila tentu mereka tidak patut mendengarnya dan tidak akan mempedulikan dakwahnya, karena orang gila tidak pantas bagi orang yang berakal memperhatikannya. Kalau bukan karena pembangkangan mereka dan kezalimannya tentu mereka akan segera memenuhi panggilannya dan menyambut dakwahnya, akan tetapi ayat-ayat dan peringatan tidaklah berguna bagi orang-orang yang tidak beriman sebagaimana disebutkan pada lanjutan ayatnya. Seperti orang-orang yang mengatakan perkataan itu. Mencakup tidak beriman kepada kebangkitan dan azab pada hari Kiamat. Yakni dalam kesengsaraan yang besar dan kesesatan yang jauh dari kebenaran ketika di dunia. Padahal kesengsaraan dan kesesatan apa yang lebih besar daripada pengingkaran mereka kepada kekuasaan Allah dalam hal membangkitkan, demikian pula sikap mereka mendustakan Rasul-Nya, mengolok-oloknya dan memastikan bahwa yang mereka pegang adalah hak sedangkan yang Rasul-Nya bawa menurut mereka adalah batil, dan menganggap yang batil dan yang sesat sebagai kebenaran dan petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 8",
    "description": "Lalu teman-teman mereka sesama kafir menimpali dengan balik bertanya guna mempertajam cemoohan mereka, 'apakah dia, yakni nabi Muhammad, mengada-adakan kebohongan terhadap Allah atau sedang sakit gila'' tidak! keduanya itu tidak akan pernah terjadi pada diri rasulullah, karena nabi adalah al-am'n (orang tepercaya) dan beliau pun sama sekali tidak gila, tetapi orang-orang yang tidak beriman kepada akhirat itu kelak di akhirat berada dalam siksaan dan ketika di dunia berada dalam kesesatan yang jauh, sehingga mereka menolak keniscayaan hari kiamat dan mengingkari kebenaran Al-Qur'an. 9. Menampik tuduhan keji orang kafir itu Allah berfirman, 'maka apakah mereka tidak memperhatikan langit yang tinggi dan hamparan bumi yang ada di hadapan dan di belakang mereka' semua berada dalam kekuasaan kami. Jika kami menghendaki, niscaya kami benamkan mereka di bumi sebagaimana kami telah membenamkan qarun, atau kami jatuhkan kepada mereka kepingan-kepingan dari langit, yakni pecahan benda-benda angkasa. Sungguh, pada yang demikian itu benar-benar terdapat tanda kekuasaan Allah bagi setiap hamba yang kembali, yakni memohon ampun kepada-Nya. '."
  }
]