[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir yang tidak beriman kepada Hari Akhirat itu tidak melihat besarnya Kuasa Allah yang ada di depan mereka dan di belakang mereka, yaitu langit dan bumi yang mencengangkan akal dan bahwa keduanya telah mengelilingi mereka? Bila kami berkehendak Kami membenamkan mereka ke dalam bumi sebagaimana yang Kami lakukan terhadap Qarun atau menurunkan potongan azab kepada mereka sebagaimana yang Kami lakukan terhadap kaum Syuaib, yang mana langit telah menghujani mereka dengan api yang membakar mereka. Sesungguhnya Kuasa Kami yang Kami sebutkan di atas mengandung petunjuk yang nyata bagi setiap hamba yang kembali kepada Tuhannya dengan bertaubat, mengakui tauhidNya dan mengikhlaskan ibadah untukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Apakah orang-orang yang mendustakan kebangkitan itu tidak melihat bumi yang ada di depan mereka dan langit yang ada di atas mereka? Jika Kami berkehendak, maka Kami akan menenggelamkan mereka ke dalam tanah, dan jika Kami berkehendak untuk menurunkan kepingan langit, niscaya Kami melakukannya. Sesungguhnya di dalam yang demikian itu benar-benar mengandung tanda yang kongkrit atas kekuasaan Allah. Yang kuasa melakukan hal itu pasti kuasa untuk membangkitkan kalian sesudah kematian dan sesudah jasad-jasad kalian hancur lebur."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah membantah mereka: “Tidakkah mereka melihat dengan baik ayat-ayat yang jelas di sekitar mereka dan pelajaran-pelajaran yang telah berlalu. Jika Kami menghendaki, niscaya Kami akan menenggelamkan mereka ke dalam tanah atau menimpa mereka dengan potongan langit agar mereka binasa. Sungguh hal tersebut merupakan tanda kekuasaan Allah bagi hamba yang tunduk kepada Tuhannya dalam segala urusannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَفَلَمْ يَرَوْا۟ (Maka apakah mereka tidak melihat) Allah mengolok mereka dengan menjelaskan bahwa mereka tidak melakukan itu melainkan karena mereka tidak berfikir dan menghayati makhluk-makhluk yang ada di langit dan bumi. إِلَىٰ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُم(apa yang ada di hadapan dan di belakang mereka?) Yakni jika mereka memperhatikan mereka akan melihat langit di depan dan belakang mereka penuh dengan ketakjuban yang menunjukkan kekuasaan Allah dan keesaan-Nya, begitu pula jika mereka memperhatikan apa yang ada di bumi, mereka akan melihat di depan dan belakang mereka bukti-bukti seperti yang ada di langit; dan jika mereka memperhatikan keduanya niscaya mereka akan mengetahui bahwa pencipta langit dan bumi berkuasa untuk menyegerakan azab bagi mereka. إِن نَّشَأْ نَخْسِفْ بِهِمُ الْأَرْضَ (Jika Kami menghendaki, niscaya Kami benamkan mereka di bumi) Sebagaimana Qarun ditenggelamkan ke dalam tanah. أَوْ نُسْقِطْ عَلَيْهِمْ كِسَفًا(atau Kami jatuhkan kepada mereka gumpalan) Yakni kepingan-kepingan langit. مِّنَ السَّمَآءِ ۚ( dari langit) Sebagaimana yang ditimpakan kepada penduduk negeri Aikah. Maka mengapa mereka merasa aman? إِنَّ فِى ذٰلِكَ(Sesungguhnya pada yang demikian itu) Yakni pencitaan langit dan bumi yang telah disebutkan itu. لَاٰيَةً(benar-benar terdapat tanda (kekuasaan Tuhan)) Yakni tanda dan bukti yang jelas. لِّكُلِّ عَبْدٍ مُّنِيبٍ (bagi setiap hamba yang kembali (kepada-Nya)) Yakni yang kembali kepada Tuhannya dengan bertaubat dan penuh keikhlasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Apakah mereka tidak melihat tanda-tanda kebesaran Allah yang ada di sekeliling mereka yaitu langit dan bumi? Apakah mereka tidak menggunakannya untuk bertafakur/mengira-ngira keagungan kekuasaan Kami? Jika Kami mau Kami bisa membenamkan/melenyapkan bumi layaknya Qarun. Atau akan Kami hujani mereka potongan-potongan dari langit sehingga Kami bisa membinasakan mereka. Itu semua adalah sebagai bukti atas kekuasaan Kami bahwa Kami mampu untuk membangkitkan setiap hamba yang kembali kepada Tuhannya dengan bertaubat, sehingga melakukan ketaatan. Maknanya, bahwa semua bukti itu untuk menunjukkan bahwa Allah Kuasa untuk membangkitkan manusia kembali, atau Kuasa untuk lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak memperhatikan langit dan bumi yang ada di hadapan dan belakang mereka. Jika menghendakinya, niscaya Kami membenamkan mereka di bumi atau menjatuhkan kepingan-kepingan} potongan-potongan {dari langit di atas mereka. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda} petunjuk yang nyata atas kekuasaan Allah {bagi setiap hamba yang kembali} kembali kepada Tuhannya dengan bertaubat dan taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Kemudian Allah mengaitkan mereka kepada dalik aqli (rasio) yang membuktikan tidak adanya kemustahilan bagi “kebangkitan” yang mereka anggap mustahil. Dan sesungguhnya kalau saja mereka mau memperhatikan kepada apa yang ada di langit dan bumi, kemudian mereka melihat sebagian dari kekuasaan Allah di dalamnya yang mencengangkan akal, dan sebagian dari keagungan yang membuat para ilmuan terperangah, dan bahwa sesungguhnya penciptaan keduanya dan segala apa yang ada di dalamnya berupa berbagai macam makhluk itu jauh lebih besar daripada sekedar menghidupkan kembali manusia dari dalam kubur sesudah kematian mereka, maka apa gerangan yang mendorong mereka melakukan pendustaan itu, padahal mereka meyakini apa yang lebih agung daripadanya? Ya, memang itu adalah berita ghaib, hingga sekarang mereka belum menyaksikannya, maka dari itu mereka mendustakannya. Allah berfirman, “Jika Kami menghendaki, niscaya Kami benamkan mereka di bumi atau Kami jatuhkan kepada mereka gumpalan dari langit,” maksudnya, sebagai azab. Sebab langit dan bumi berada di bawah kendali Kami. Maka jika Kami memerintah keduanya, niscaya keduanya tidak akan mendurhakai perintah Kami, maka waspadalah atas sikap kalian yang terus melakukan pendustaan, karena kami akan menghukum kalian dengan hukuman (siksaan) yang paling berat. “Sesungguhnya pada yang demikian itu,” maksudnya, pada penciptaan langit dan bumi serta apa-apa yang ada pada keduanya berupa berbagai macam makhluk, “benar-benar terdapat tanda bagi setiap hamba yang kembali.” Semakin besar inabah seorang hamba kepada Allah, maka semakin besar pula pelajaran-pelajaran yang dia dapat dari ayat-ayat itu. Sebab orang yang kembali (berinabah) kepada Allah itu tulus menghadap pada Rabbnya, keinginan dan kemaunnya sudah terfokus kepada Rabbnya, dan dia selalu kembali kepadaNya dalam setiap urusan-urusannya, sehingga dia menjadi dekat kepada Rabbnya, dia sama sekali tidak mempunyai keinginan keculai sibuk mencari keridhaanNya. Maka pengamatannya terhadap semua makhluk (ciptaan) adalah pengamatan yang penuh perenungan dan pelajaran, bukan penglihatan kelalaian yang tidak bermanfaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Saba ayat 9: Allah mencela mereka orang-orang kafir yang tidak beriman dengan akhirat dengan berkata kepada mereka : Apakah mereka tidak menyaksikan kebesaran Allah di depan mata-mata mereka dan juga di belakang mereka dari langit dan bumi yang besar sehingga akal pasti menerima ?, kemudian Allah memperingatkan mereka dengan jelas bahwasanya setiap apa yang ada dalam semesta ini di bawah kekuasaan-Nya; Maka jika Allah berkehendak, Allah akan tenggelamkan (jatuhkan) bumi, atau jika Dia berkehendak Allah akan jatuhkan dari langit bagi mereka api yang jatuh ke bumi kemudian membakar mereka semua. Sebagaimana yang Allah timpakan kepada umat sebelumnya yang pantas untuk menerima adzab. Sungguh kekuasaan Allah ini adalah tanda bagi orang yang mengambil pelajaran dari apa yang telah terjadi sebelumnya dari pendahulu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah mengingatkan mereka terhadap dalil akal yang munjukkan tidak mustahilnya kebangkitan, dan bahwa jika mereka melihat langit dan bumi yang berada di atas dan di bawah mereka, tentu mereka akan mengetahui kekuasaan Allah yang membuat akan mereka tercengang, keagungan-Nya yang membuat lupa segalanya, dan bahwa penciptaan kedua langit dan bumi serta besarnya dan apa yang ada di antara keduanya lebih besar daripada penciptaan manusia setelah mereka matinya. Oleh karena itu, apa yang membuat mereka mendustakan, padahal mereka membenarkan sesuatu yang lebih besar lagi? Yakni di atas dan di bawah mereka. Sebagai azab, karena langit dan bumi berada dalam pengatuan Allah. Jika Allah memerintahkan demikian, niscaya keduanya tidak akan mendurhakai. Oleh karena itu, berhati-hatilah jika tetap terus mendustakan sehingga Dia mengazab kamu dengan azab yang keras. Yakni pada penciptaan langit dan bumi serta makhluk yang berada di antara keduanya. Yang menunjukkan bahwa Dia mampu membangkitkan. Oleh karena itu, setiap kali seorang hamba lebih besar kembalinya kepada Allah, maka lebih bisa mengambil manfaat dari ayat-ayat itu, karena orang yang kembali menghadap Tuhannya, keinginan dan perhatiannya tertuju kepada Tuhannya, dan kembali kepada-Nya dalam setiap masalah, sehingga ia pun dekat dengan Tuhannya dan tidak ada yang dipikirkannya selain mencari keridhaan-Nya. Oleh karena itu, pandangannya terhadap makhluk ciptaan-Nya adalah pandangan dengan penuh pemikiran dan mengambil pelajaran, bukan pandangan yang lalai dan tidak bermanfaat apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Saba Ayat 9",
    "description": "Menampik tuduhan keji orang kafir itu Allah berfirman, 'maka apakah mereka tidak memperhatikan langit yang tinggi dan hamparan bumi yang ada di hadapan dan di belakang mereka' semua berada dalam kekuasaan kami. Jika kami menghendaki, niscaya kami benamkan mereka di bumi sebagaimana kami telah membenamkan qarun, atau kami jatuhkan kepada mereka kepingan-kepingan dari langit, yakni pecahan benda-benda angkasa. Sungguh, pada yang demikian itu benar-benar terdapat tanda kekuasaan Allah bagi setiap hamba yang kembali, yakni memohon ampun kepada-Nya. '10-11. Usai menjelaskan tanda-tanda kekuasaan-Nya di alam semesta yang diharapkan dapat meningkatkan keimanan manusia, pada ayat ini Allah menyebutkan anugerah-Nya kepada salah seorang hamba yang taat, nabi daud. Dan sungguh, telah kami berikan kepada daud karunia yang besar dari kami. Kami berfirman, 'wahai gunung-gunung dan burung-burung! bertasbihlah berulang-ulang bersama daud. ' dan selain anugerah itu, kami juga telah melunakkan besi untuknya seperti lilin agar bisa dimanfaatkan sesuai kebutuhan. Lalu kami perintahkan, 'buatlah baju besi yang besar-besar dan ukur-lah anyamannya agar nyaman dipakai dan menjadi perisai bagi pemakainya. ' dan sebagai bentuk syukur atas anugerah itu kami berfirman kepadanya, 'kerjakanlah kebajikan. Sungguh, aku maha melihat apa yang kamu kerjakan. '."
  }
]