[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Huruf-huruf ini dan huruf-huruf lainnya dari huruf-huruf yang terputus di awal-awal sejumlah surat Alquran, di dalamnya terkandung isyarat atas kemukjizatan Alquran. Maka sungguh telah terjadi tantangan dengannya terhadap orang-orang musyrik dan terbukti mereka tidak mampu untuk membantahnya, padahal huruf-huruf tersebut merupakan komponen tersusunnya bahasa Arab. Karena itu ketidakmampuan bangsa Arab untuk mendatangkan yang semisal dengan Alquran (Padahal mereka adalah manusia yang paling fasih berbahasa Arab) menunjukkan bahwa Alquran adalah wahyu dari Allah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Mīm. Ini merupakan huruf-huruf yang digunakan sebagai pembuka beberapa surah Al-Qur`ān. Ini adalah huruf hijaiah yang tidak mempunyai makna pada dirinya karena dituliskan terpisah seperti: alif, ba, ta dan seterusnya. Dalam huruf-huruf itu terdapat hikmah dan tujuan, karena tidak ada sesuatupun di dalam Al-Qur`ān yang tidak memiliki hikmah. Di antara hikmahnya yang paling menonjol ialah mengisyaratkan tantangan untuk membuat Al-Qur`ān yang terdiri dari huruf-huruf yang membentuk kata-kata yang mereka ketahui dan mereka gunakan untuk berbicara. Oleh karena itu, pada umumnya huruf-huruf hijaiah tersebut diikuti dengan penyebutan tentang Al-Qur`ān Al-Karīm, seperti yang ada di dalam surah ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-5. Huruf-huruf hija'iyah muqottho'ah yang menunjukkan mukjizat bayani ini merupakan bagian dari al-Qur'an yang diturunkan yang merupakan kitab yang tidak mengandung hal yang meragukan di dalamnya. Meski orang-orang yang ingkar dan musyrik berusaha sekuat mungkin namun mereka tidak akan mampu memahami keberkahannya dan tidak akan bisa merasakan keindahannya. Adapun orang-orang yang menjauhi perbuatan jahat dan haram, maka mereka adalah orang-orang yang mengaharap hidayah dari al-Qur'an dengan mengimani, mengagungkan, dan mengamalkannya; merekalah orang-orang yang memiliki sifat yang mulia, mengimani keagungan Sang Pencipta dan hari akhir, menjaga sholat mereka dengan menyempurnakan rukun-rukun dan syarat-syaratnya, menginfakkan harta mereka kepada orang-orang yang berhak dan membutuhkan, membenarkan al-Qur'an yang diturunkan Jibril kepada Nabi Muhammad dan kitab-kitab serta suhuf-suhuf yang diturunkan kepada para nabi dan rasul, serta mengimani hari akhir beserta kejadian-kejadiannya seperti perhitungan dan pembalasan. Mereka adalah orang-orang yang memiliki derajat yang tinggi yang berhak mendapat kenikmatan yang kekal dan pahala yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الم Imam al-Qurthubi berkata dalam tafsirnya: sesungguhnya huruf-huruf yang ada diawal-awal surat adalah rahasia Allah yang ada dalam al-Qur’an. Dan beliau juga berkata: sekelompok ulama berkata: kita menyukai untuk berbicara dalam hal ini, untuk mengeluarkan faidah-faidah yang dikandung dan makna-makna yang ada didalamnya. Dan mereka berbeda pendapat mengenai masalah ini; sebagian berpendapat bahwa huruf-huruf ini adalah isyarat yang merujuk pada huruf-huruf hijaiyyah yang Allah Ta’ala kabarkan kepada orang-orang Arab yang menantang untuk menandingi al-Qur’an yang tersusun dari huruf-huruf yang merupakan dasar dari bahasa mereka. Hal ini ditujukan agar menjadi bukti yang lebih jelas akan kelemahan mereka untuk menandingi al-Qur’an padahal al-Qur’an diturunkan menggunakan bahasa mereka. 2. ذَٰلِكَ الْكِتَابُ yakni al-Qur’an ini yang tinggi derajatnya لَا رَيْبَ ۛ فِيهِ ۛ tidak ada keraguan bahwa ia datang Allah Ta’ala هُدًى لِلْمُتَّقِينَ (sebagai hidayah bagi orang-orang yang bertaqwa). Makna dari (الهدى) adalah dalil yang mengantarkan pada tujuan. Pendapat dari Ibnu Abbas dalam kalimat (هدى للمتقين): yakni orang-orang yang takut pada hukuman dari Allah karena meninggalkan hidayah yang mereka ketahui dan mengharapkan rahmat-Nya dengan meyakini apa yang datang dari-Nya. Dari Abu Hurairah disebutkan bahwa seorang laki-laki bertanya kepadanya: apa itu taqwa? Dia pun menjawab: apakah kamu pernah berjalan di jalan yang berduri? Lelaki itu menjawab: Pernah. Abu Hurairah membalasnya: Lalu apa yang kau lakukan ketika itu?. Dia menjawab: jika aku melihat duri aku berbelok, memanjangkan langkahku agar melewatinya, atau memendekkan langkah agar tidak mengenainya. Abu Hurairah berkata: maka demikianlah takwa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Alif Lam Mim: Susunan huruf ini dan susunan lain yang serupa merupakan susunan huruf yang diletakkan di permulaan surah. (Itu) didatangkan sebagai penjelas tentang kesempurnaan Al-Qur’an dan mengukuhkannya sebagai Kalam Allah, dan untuk menantang bangsa Arab untuk mendatangkan kitab yang serupa atau sesuatu yang serupa dengan surah paling pendek darinya. Dan sebagai penjelasan tentang kelemahan dan ketidakmampuan mereka dan sebagai pemberitahuan bahwa Al-Qur’an tersusun dari huruf-huruf Arab yang selalu mereka ucapkan dan mereka susun perkataan mereka menggunakan (huruf) itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Alif Lām Mīm} huruf-huruf muqhatha’ah ini dan huruf-huruf hija’iyyah di banyak permulaan surah itu merupakan salah satu perkara yang hanya diketahui oleh Allah SWT"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Huruf-huruf yang terpenggal-penggal di setiap awal surat, lebiah baik membiarkannya dan tidak mencoba-coba mencari makna-maknanya tanpa ada sandaran yang syar’I, dan diiringi dengan keyakinan yang kuat bahwasanya Allah ta’ala tidak menurunkannya dengan sia-sia, akan tetapi menyimpan hikmah yang tidak kita ketahui."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Aliif Laam Miim termasuk huruf muqottho’ah yang tertulis الم dan dibaca “Aliif Laam Miim”. Surah yang dimulai dengan huruf muqottho’ah ada 29 surah, yang pertama adalah Al-Baqarah dan yang terakhir adalah Al-Qolam (Nun) di antaranya adalah surah dengan satu huruf semisal Shad, Qof, dan Nun, dan surah dengan dua huruf semisal Thoha, Yasin, Hamim, juga surah dengan tiga huruf, empat huruf, dan lima huruf. Tidak ada yang benar-benar jelas penafsiran yang berasal dari Nabi shallallahu ‘alaihi wasallam, dan termasuk dalam golongan mutasyabbihah yang disembunyikan ilmunya oleh Allah. Inilah penafsiran yang benar. Oleh karena itu dikatakan Aliif Laam Miim, Allah yang Maha Tahu akan maksudnya. Beberapa ulama menyimpulkan ada dua faidah dari huruf-huruf muqottho’ah. Pertama bahwasanya kaum musyrikin saat itu tidak mau mendengarkan al-Qur’an karena takut akan membekas dalam jiwa pendengarnya. Maka pengucapan huruf huruf muqottho’ah seperti Haamiim, Thoosiin, Qoof, Kaafhaya’aiinshood yang asing bagi mereka, dapat menggugah mereka untuk mendengarkan al-Qur’an sehingga mereka mau mendengar, terpengaruh dengan Al-Qur’an dan bersegera menuju keimanan. Cukuplah hal ini sebagai faidah. Kedua, pada saat kaum musyrikin mengingkari bahwa al-Qur’an adalah kalamullah maka Allah menurunkan wahyu kepada rasulNya. Huruf-huruf ini seakan menjadi penantang bagi kaum musyrikin. Seakan huruf itu berkata : “Sesungguhnya Al-Qur’an tersusun dari huruf-huruf seperti ini, maka buatlah yang semisal dengannya. Faidah ini dikuatkan dengan penyebutan kata ganti orang ketiga (ghaib) setelah huruf muqottho’ah seperti : (الٓمٓ ١ ذَٰلِكَ ٱلۡكِتَٰبُ) الر تِلْكَ آيَاتُ الْكِتَابِ)) طس تِلْكَ آيَاتُ الْقُرْآنِ)) Seakan huruf itu mengatakan, dari susunan huruf-huruf inilah al-Qur’an terbentuk, maka buatlah yang serupa dengan al-Qur’an. Kalau kalian tidak mampu maka terimalah bahwa Al-Qur’an adalah kalamullah dan wahyuNya, berimanlah dengannya maka kalian akan beruntung."
  },
  {
    "title": "Al-Mishbahul Munir fi Tahdzib Tafsir Ibnu Katsir / Syaikh Shafiyurrahman al-Mubarakfuri et. al.",
    "description": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ (الم) SEPUTAR HURUF MUQOTH-THO’AH (PENGGALAN HURUF-HURUF DI AWAL SURAT) Penggalan huruf-huruf yang ada di awal beberapa surat adalah huruf-huruf yang hanya Allah saja yang mengetahui maknanya. Pendapat seperti ini diriwayatkan dari Abu Bakar, Umar, Utsman, Ali dan Ibu Mas’ud ra. Ada yang mengatakan bahwa huruf-huruf itu adalah nama-nama surat. Ada yang mengatakan bahwa (huruf-huruf) itu adalah pembuka yang dengannya Allah membuka Al-Quran. Khashif meriwayatkan dari Mujahid ia berkata: “Pembuka surat-surat Al-Quran seluruhnya adalah (ق, ص, حم, طسم, dan الر) dan huruf-huruf hijaiyyah lainnya.” Sebagian ahli bahasa Arab berkata: “Ia adalah huruf-huruf mu’jam (kamus). Allah mencukupkan menyebutkan sebagiannya saja dan tidak menyebutkan selebihnya yang seluruhnya berjumlah 28 huruf, sebagaimana seseorang mengatakan: ‘Anakku dapat menulis huruf أ, ب, ت, ث ...” artinya, anak tersebut bisa menulis 28 huruf-huruf hijaiyyah, hanya saja menyebutkannya sebagian saja.” Demikian yang diceritakan oleh Ibnu Jarir. Saya (Ibnu Katsir) katakan bahwa jumlah keseluruhan huruf-huruf yang disebutkan di awal surat dengan tidak menghitung huruf yang disebutkan lebih dari satu kali adalah 14 huruf, yaitu: ا، ل، م، ص، ر، ك، ه، ي، ع، ط، س، ح ، ق، ن. Semua huruf itu dapat dikumpulkan dalam sebuah kalimat: نَصٌّ حَكِيْمٌ قَاطِعٌ لَهُ سِرٌّ Jumlahnya adalah setengah dari total keseluruhan. Yang disebutkan lebih mulia daripada yang tidak disebutkan. Penjelasan lebih lanjut merupakan spesialisasi ilmu sharaf. Az-Zamakhsyari mengatakan: “Huruf-huruf yang berjumlah 14 ini merangkum semua jenis huruf. Yaitu dari huruf mahmuusah sampai majhuurah, dari rakhwah sampai syadiidah, dari muthabbaqah sampai maftuuhah, dari musta’liyah sampai munkhafidhah, dan huruf qalqalah.” Kemudian ia menyebutkan secara terperinci, lalu ia berkata: “Maha suci Allah yang sangat dalam hikmah-Nya dalam segala hal. Jenis huruf-huruf yang disebutkan ini adalah huruf-huruf yang sangat banyak digunakan. Dan telah engkau ketahui sebelumnya bahwa jumlah mayoritas dapat disamakan kedudukannya dengan jumlah keseluruhannya.” Dari sini, sebagian ulama memeberi penjelasan sebagai berikut: “Tidak ragu lagi, bahwa Allah menurunkan huruf-huruf tersebut tidaklah sia-sia atau percuma begitu saja. Oleh karena itulah sebagian orang jahil berkata: “Sesungguhnya di dalam Al-Quran terdapat kata-kata yang hanya untuk dibaca saja sebagai ibadah, sementara ia tidak memiliki makna sama sekali.” Sungguh anggapan mereka ini sangat keliru. Jelaslah bahwa huruf-huruf ini memiliki makna tersendiri. Kalaulah ada sebuah penjelasan dari Al-Ma’shum saw tentu kita akan menjelaskannya berdasarkan keterangan tersebut. Jika tidak ada maka kita menahan diri darinya. Dan kita katakan: “Kami mengimaninya, seluruhnya berasal dari Allah swt.” Para ulama tidak bersepakat dalam menafsirkan huruf-huruf tersebut. Bahkan mereka berselisih pendapat. Jika nyata baginya bahwa sebagian pendapat memiliki dalil, maka hendaklah ia mengikutinya. Jika tidak, maka hendaklah ia menahan diri, sehingga kebenaran menjadi jelas baginya. Ini dilihat dari satu sisi. PENGGALAN HURUF-HURUF TERSEBUT MENUNJUKKAN MUKJIZAT AL-QURAN Dilihat dari sini lain tentang hikmah disebutkannya huruf-huruf hijaiyyah di awal-awal surat ini, terlepas dari makna yang terkandung di dalamnya, dikatakan bahwa penggalan huruf-huruf yang disebutkan di awal-awal surat dimaksudkan untuk menunjukkan mukjizat AL-Quran dan menjelaskan bahwa makhluk tidak bisa membuat tandingannya. Padahal ia hanyalah rangkaiandari penggalan huruf-huruf yang biasa mereka gunakan dalam percakapan sehari-hari. Madzhab ini telah disampaikan oleh Ar-Razi dalam tafsirnya dari Al-Mubarrid dan sejumlah ahli tahqiq. Al-Qurthubi menghikayatkan dari Al-Farra’ dan Qathrab yang semakna dengan madzhab di atas. Dan pendapat ini didukung oleh Az-Zamakhsyari dalam kitab Al-Kasysyaafnya dan ia mendukung penuh pendapat ini. Dan pendapat inilah yang dipilih oleh Syaikhul Islam Abul Abbas Ibnu Taimiyyah rahimahullah dan guru kami AL-Hafizh AL-Mujtahid Abul Hajjaj Al-Mizzi. Ia menceritakan kepadaku dari Ibnu Taimiyyah. Az-Zamakhsyari mengatakan, “Huruf-huruf tersebut tidak disebutkan keselruruhannya di awal Al-Quran. Namun penyebutannya diulang-ulang untuk menguatkan tantangan dan ketidakmampuan manusia menyainginya. Sebagaimana halnya beberapa kisah yang penyebutannya diulang-ulang. Dan telah diulang-ulang juga tantangan dari Allah secara terang-terangan dalam banyak ayat. Ia melanjutkan: “Ada yang disebutkan satu huruf saja, seperti ص، ن، ق . Ada yang disebutkan dua huruf, seperti حم . Ada yang disebutkan tiga huruf, seperti الم. Ada yang empat huruf, seperti المر dan المص. Ada yang lima huruf, seperti كهيص dan حم عسق. Karena demikianlah uslub (metode) bahasa Arab dalam pembentukan kalimat. Ada yang satu huruf, ada yang dua huruf, ada yang tiga huruf, ada yang empat huruf dan ada yang lima huruf, tidak ada yang lebih dari itu.” (Saya katakan) oleh karena itu setiap surat yang dibuka dengan huruf-huruf ini pasti disebutkan di dalamnya kemenangan Al-Quran dan penjelasan tentang kehebatan dan kebesarannya. Hal itu dapat diketahui melalui penelitian. Itulah yang ditemui dalam 29 surat. Oleh karena itu Allah berfirman: (الم. ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ) “Alif laam miim. Allah (Al-Quran) ini tidak ada keraguan padanya.” (QS. Al-Baqarah:2) الم . اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ . نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ “Alif Laam miim. Allah, tidak ada yang berhak diibadahi dengan benar melainkan Dia. Yang hidup kekal lagi terus-menerus mengurus makhluk-Nya. Dia menurunkan Al-Kitab (Al-Quran) kepadamu dengan sebenarnya serta membenarkan Kitab yang telah diturunkan sebelumnya.” (QS. Ali ‘Imran:1-3) المص. كِتَابٌ أُنْزِلَ إِلَيْكَ فَلَا يَكُنْ فِي صَدْرِكَ حَرَجٌ “Alif laam mim shaad. Ini adalah sebuah kitab yang diturunkan kepadamu, maka janganlah ada kesempitan di dalam dadamu karenanya.” (QS. Al-Araf:1-2) الر ۚ كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ “Alif, laam raa. (Ini adalah) Kitab yang Kami turunkan kepadamu supaya kamu mengeluarkan manusia dari gelap gulita kepada cahaya terang benderang dengan izin Tuhan mereka.” (QS. Ibrahim:1) الم. تَنْزِيلُ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ “Alif Laam Miim. Turunnya Al-Quran yang tidak ada keraguan di dalamnya, (adalah) dari Tuhan semesta alam.” (QS. As-Sajdah:1-2) حم. تَنْزِيلٌ مِنَ الرَّحْمَٰنِ الرَّحِيمِ “Haa Miim. Diturunkan dari Tuhan Yang Maha Pemurah lagi Maha Penyayang.” (QS. Fushshilat:1-2) حم. عسق. كَذَٰلِكَ يُوحِي إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ “Haa Miim. 'Ain Siin Qaaf. Demikianlah Allah Yang Maha Perkasa lagi Maha Bijaksana, mewahyukan kepada kamu dan kepada orang-orang sebelum kamu.” (QS. Asy-Syuraa:1-3) Dan ayat-ayat lain yang menunjukkan kebenaran pendapat para ulama tersebut bagi siapa saja yang mau menelitinya, Wallahua’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 1: Telah disebutkan tentang pendapat-pendapat yang menyebutkan tentang huruf muqtha’ah di awal-awal surat, dan yang paling utama terdapat penyebutan dua pendapat : Pendapat pertama : Bahwasanya Al-Qur’an ini adalah kalamullah (firman Allah), dan kalamullah terdiri dari huruf-huruf arab. Pendapat kedua : Wallahu ‘alam akan maksud dari huruf muqatha’ah tersebut, di mana berkata para ulama : Sesungguhnya pada setiap kitab terdapat rahasia, dan huruf tersebut adalah rahasia dari Al-Qur’an. Ucapan ini telah dinisbatkan kepada Abu Bakr As-Shiddiq dan jumhur ulama yang di antaranya adalah Syaikhul Islam Ibnu Taimiyyah, Ibnu Katsir dan Zamakhsyari memilih pendapat yang pertama karena disebutkannya huruf tersebut karena menunjukkan Al-Qur’an diturunkan dengan bahasa arab yang tersusun dari beberapa huruf ini (ا,ب,ت,ث ...) hingga akhir. Dan maksudnya adalah memberikan kabar dan sebagai tantangan bagi mereka yang menolak Al-Qur’an, atau bagi mereka yang terdapat keraguan bahwasanya Al-Qur’an datang dari sisi Allah yang bawasanya akan dapat mendatangkan yang semisal dengannya. Ini adalah pendapat yang lebih kuat dalam permasalahan ini. Huruf muqatha’ah di awal-awal surat mengandung makna : Firman Allah yang rahasia lagi kokoh yang terpenggal-penggal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ialah huruf-huruf abjad yang terletak pada permulaan sebagian dari surat-surat Al Quran seperti: Alif laam miim, Alif laam raa, Alif laam miim shaad dan sebagainya. Di antara ahli-ahli tafsir ada yang menyerahkan pengertiannya kepada Allah karena dipandang termasuk ayat-ayat mutasyaabihaat, dan ada pula yang menafsirkannya. golongan yang menafsirkannya ada yang memandangnya sebagai nama surat, dan ada pula yang berpendapat bahwa huruf-huruf abjad itu gunanya untuk menarik perhatian para pendengar supaya memperhatikan Al Quran itu, atau untuk mengisyaratkan bahwa Al Quran itu diturunkan dari Allah dalam bahasa Arab yang tersusun dari huruf-huruf abjad. kalau mereka tidak percaya bahwa Al Quran diturunkan dari Allah dan hanya buatan Muhammad shallallahu 'alaihi wa sallam semata-mata, maka cobalah mereka buat semacam Al Quran itu. Syaikh As Sa'diy berpendapat bahwa yang lebih selamat adalah diam tidak mencari-cari maksudnya, yang pasti Allah Ta'ala tidaklah menurunkan begitu saja tanpa ada hikmah di balik itu hanya saja kita tidak mengetahui. Wallahu a'lam. Imam Al Qurthubi berkata, \"Para ahli tafsir berselisih tentang huruf-huruf yang berada di awal-awal surat. Amir Asy Sya'biy, Sufyan Ats Tsauriy dan jama'ah ahli hadits berkata, \"Ia adalah rahasia Allah dalam Al Qur'an, dan Allah memiliki rahasia di setiap kitab-Nya, ia termasuk ayat-ayat mutasyabihat yang hanya Allah saja mengetahuinya, ia tidak mesti dibicarakan, akan tetapi kita mengimaninya dan membacanya sebagaimana telah datang (disebutkan).\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 1",
    "description": "Alif laam miim. Beberapa surah dalam Al-Qur'an dibuka dengan huruf abjad seperti alif laam miim, alif laam raa', dan sebagainya. Makna huruf-huruf itu hanya Allah yang tahu. Ada yang berpendapat bahwa huruf-huruf itu adalah nama surah dan ada pula yang berpendapat bahwa gunanya untuk menarik perhatian, atau untuk menunjukkan mukjizat Al-Qur'an, karena Al-Qur'an disusun dari rangkaian huruf-huruf abjad yang digunakan dalam bahasa bangsa arab sendiri. Meskipun demikian, mereka tidak pernah mampu untuk membuat rangkaian huruf-huruf itu menjadi seperti Al-Qur'an. Inilah kitab yang sempurna dan penuh keagungan, yaitu Al-Qur'an yang kami turunkan kepada nabi Muhammad, tidak ada keraguan padanya tentang kebenaran apa-apa yang terkandung di dalamnya, dan orang-orang yang berakal sehat tidak akan dihinggapi keraguan bahwa Al-Qur'an berasal dari Allah karena sangat jelas kebenarannya. Al-Qur'an juga menjadi petunjuk yang sempurna bagi mereka yang mempersiapkan diri untuk menerima kebenaran dengan bertakwa, yaitu mengikuti segala perintah Allah dan menjauhi segala larangan-Nya agar terhindar dari siksa Allah. Meski petunjuk Al-Qur'an diperuntukkan bagi seluruh umat manusia, hanya orang-orang bertakwa saja yang siap dan mampu mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Para ahli tafsir berbeda pendapat tentang makna dari huruf-huruf yang terdapat pada awal beberapa surat dalam Alquran. Diantara mereka ada yang mengatakan bahwa itu merupakan huruf-huruf yang hanya Allah sendiri yang mengetahui maknanya. Maka mereka mengembalikan ilmu mengenai hal itu kepada Allah dengan tidak menafsirkan-Nya. Pendapat ini dinukil al-Qurtubi dalam tafsirnya dari Abu Bakar, Umar, usman, ‘Ali dan Ibnu Mas’ud rhodiallohu ‘anhum. Begitu juga pendapat ‘Amir As-Sya’bi dan Sufyan As-Sauri dan Robi’ Bin Khutsaim yang dipilih juga oleh Abu Hatim bin Hiban. Diantara ahli tafsir juga ada yang menafsirkannya, dan mereka berbeda pendapat tentang maknanya. Abdurrahman bin Zaid bin Aslam berkata : “sesungguhmya huruf-huruf ini merupakan nama-nama surat dalam Al-Quran”. Abu al-Qosim Mahmud bin Umar Az-Zamakhsyari menyatakan dalam tafsirnya bahwa hal itu menjadi kesepakatan banyak ulama, beliau juga menukil dari Sibawaih menegaskan dan memperkuat hal itu. Berdasarkan hadits dalam kitab shohih al-Bukhori dan Muslim dari Abu hurairoh bahwa Rosululloh sholallohu ‘alaihi wasallam pernah membaca Alif laam mim as-Sajdah (Surat as-Sajdah) dan hal ata ‘alal insan (Surat al-insan) pada sholat subuh pada hari jum’at. Sufyan As-Sauri berkata dari Mujahid bahwasanya dia berkata: \" الم \" \" حم \" \" المص \" \" ص \" merupakan pembuka yang Allah ta’ala buka dengannya Al-Quran. Mujahid juga berkata dari riwayat Abu Huzaifah Musa bin Mas’ud dari Syubl dari Ibnu Abu Najih darinya bahwasanya dia berkata \" الم \" adalah nama dari nama-nama Al-Quran. As-Sya’bi berkata, “pembuka-pembuka surat adalah dari nama-nama Allah ta’ala. Begitu juga perkataan Salim bin Abdillah, Ismail bin Abdurahman Assadi al-Kabir, telah berkata Syu’bah dai As-sadi, telah sampai kepadaku bahwa Ibnu Abbas telah berkata: \" الم \" adalah salah satu nama dari nama-nama Allah yang agung. Begitu juga riwayat Ibnu Abi Hatim dari hadits Syu’bah. Banyak sekali pendapat-pendapat mengenai makna dari huruf huruf ini, dianatara mufasir ada juga memaknai sebagai sumpah yang Allah jadikan dalam Al-Quran. Hal ini seperti pendapat Al-Kalbi. Ada juga sebagian mufasir yang Mengatakan bahwa makna huruf-huruf ini adalah sebagai berikut : “alif bermakna Allah, lam bermakna Jibril dan mim bermakna Muhammad sholallohu ‘alaihi wasallam. Hal ini diriwayatkan dari Ibnu ‘Abbas. Wallohu a’lam bishowab akan makna sebenarnya dari makna ayat ini. Kerena menurut jumhur para mufasir ayat ini merupakan salah satu ayat mutsyabihat yang tidak ada yang tahu makna sebenarnya kecuali Allah ta’ala. Para ulama akhirnya mengambil kesimpula dari makna ayat ini dengan mengatakan bahwa “tidak diragukan lagi bahwa huruf-huruf ini tidak diturunkan Allah ta’ala dengan sia-sia dan tanpa makna. Orang yang tidak tahu mengatakan bahwa “di dalam Al-Quran terdapat suatu hal yang tidak memiliki makna sama sekali”, ini merupakan kesalahan besar. Karena ternyata sesuatu yang dimaksud itu pada hakikatnya memiliki makna, jika kami menerima riwayat yang shohih dari nabi Muhammad sholallohu ‘alaihi wasallam maka kami akan menerimanya, dan jikaa tidak, maka kami akan menyerahkan maknanya kepada Allah ta’ala seraya berucap; آمنا به كل من عند ربنا “Kami beriman kepadanya, semuanya berasal dari sisi Rabb kami” (QS. Ali Imron : 7) Maka Maqom Para ulama ahli tafsir belum mendapati kesepakatan mengenai huruf-huruf tersebut, dan mereka masih berbeda pendapat. Dan jika telah jelas bagi sebagian pendapat dengan dalil yang shohih, maka yang lain harus mengikuti pendapat tersebut. Sabagian ulama yang lain mengatakan bahwa huruf-huruf ini menunjukan keistimewaan gaya Bahasa Alquran dan keagungannya yang tidak ada pada kitab-kitab sebelumnya. Makanya dalam beberapa surat yang diawali dengan huruf-huruf ini selalu menyertainya dengan ayat yang menyebutkan penjelasan tentang Alquran."
  }
]