[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di dalam hati mereka terdapat keraguan dan kerusakan akibatnya mereka diuji Allah dengan berbuat berbagai macam maksiat yang mewajibkan adanya siksaan bagi mereka, sehingga Allah pun menambah keraguan pada hati mereka dan bagi mereka siksaan yang menyedihkan akibat kedustaan dan kemunafikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Penyebabnya ialah karena di dalam hati mereka terdapat keraguan, maka Allah menambah keraguan itu dengan keraguan lainnya, karena setiap perbuatan akan dibalas dengan perbuatan serupa. Kelak mereka akan mendapatkan azab yang sangat pedih di kerak neraka yang paling bawah. Hal itu karena mereka telah berdusta atas nama Allah dan atas nama manusia lainnya. Dan juga karena mereka mendustakan agama yang dibawa oleh Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Kelalaian mereka ini kerena alat yang dapat mereka gunakan untuk memahami dal keadaan sakit, sehingga penyakit mereka menyibukkannya dari memahami apa yang bermanfaat bagi mereka, dan hanya condong kepada apa yang dapat menyakiti mereka. Dalam hati mereka terdapat keraguan, kemunafikan, dan kedengkian; akibatnya mereka diganjar dengan berbagai perbuatan maksiat yang layak mendapat balasan siksa, dan bagi mereka azab yang pedih akibat kedustaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فِيْ قُلُوْبِهِمْ مَّرَضٌۙ yang dimaksud dengan penyakit disini adalah kerusakan akidah mereka baik itu disebabkan oleh keraguan, kemunafikan, atau keingkaran. فَزَادَهُمُ اللّٰهُ مَرَضًا Yakni dengan bertambahnya kenikmatan-kenikmatan yang senantiasa bertambah kepada Rasulullah baik itu kenikmatan duniawiyah maupun diniyyah maka berbambah pula penyakit mereka, mereka pun dihukum dengan bertambahnya keraguan, kekecewaan, dan kenifakan. وَلَهُمْ عَذَابٌ اَلِيْمٌ Yakni azab yang menyakitkan بِمَا كَانُوْا يَكْذِبُوْنَ Yakni sebab pengakuan mereka bahwa mereka beriman padahal mereka tidak beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah firman Allah dalam pensifatan-Nya terhadap orang-orang munafiq : { فِي قُلُوبِهِمْ مَرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا }, orang sakit mendapati rasa suatu makanan berbeda dengan rasa yang sebenarnya, dia akan menemukan yang asam menjadi manis, yang manis menjadi pahit, hal ini serupa dengan keadaan orang-orang munafiq yang melihat kebenaran menjadi kebathilan, dan kebathilan seakan-akan menjadi benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Di dalam hati mereka terdapat kerusakan akidah baik keragu-raguan dan kemunafikan ataupun kekufuran dan kedustaan. Kemudian Allah menambahkan penyakit lain pada (diri) mereka, yaitu dengki dan kebencian terhadap tingginya (derajat) kalam Allah, tetapnya kaidah Islam dan pertolongan (Allah) kepada orang-orang mukmin. Dan bagi mereka azab yang menyakitkan akibat kebohongan dan keangkuhan mereka dengan berpura-pura beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dalam hati mereka ada penyakit} keraguan dan kemunafikan {lalu Allah menambah penyakit mereka} keraguan dan kemunafikannya {dan bagi mereka itu azab yang sangat pedih karena selalu berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. firmanNya, “dalam hati mereka ada penyakit”. Yang dimaksud dengan penyakit disini adalah penyakit keraguan, syubhat, dan kemunafikan. Hal itu dikarenakan hati itu dihadapkan oleh dua penyakit yang menyebabkannya jauh dari kesehatannya dan kenormalannya, yaitu penyakit syubhat yang batil dan penyakit syahwat yang menjerumuskan. Kekufuran, kemunafikan, keragu-raguan, dan semua bid’ah-bid’ah itu adalah penyakit-penyakit syubhat, sedangkan perzinaan, suka akan kekejian dan menyukai kemaksiatan serta melakukannya, adalah di antara penyakit-penyakit syahwat. Sebagaimana firman Allah ta'ala : \" sehingga berkeinginanlah orang yang ada penyakit dalam hatinya\" (QS. Al-Ahzab : 32) Yakni syahwat zina. Dan orang yang selamat adalah orang yang diselamatkan dari kedua penyakit tersebut, hingga terwujudlah baginya keyakinan, keimanan, dan kesabaran dari setiap kemaksiatan lalu dia berjalan dalam pakaian-pakaian keselamatan. Dan firmanNYa tentang kaum munafikin, “dalam hati mereka ada penyakit, maka Allah menambah penyakitnya, ” adalah sebuah penjelasan tentang hikmah Allah ta’ala terhadap penentuan kemaksiatan atas pelaku-pelakunya dan bahwasanya hal itu disebabkan dosa-dosa mereka yang terdahulu. Allah menguji mereka dengan kemaksiatan yang terjadi kemudian yang mengakibatkan hukuman. Sebagaimana firman Allah ta'ala : \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat\" (QS. Al-'An'am : 110) \"Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka\" (QS. As-Shof :5) \"Dan adapun orang-orang yang di dalam hati mereka ada penyakit, maka dengan surat itu bertambah kekafiran mereka, disamping kekafirannya (yang telah ada) dan mereka mati dalam keadaan kafir.\" (QS. At-Taubah : 125) Maka hukuman bagi kemaksiatan adalah kemaksiatan setelahnya, sebagaimana balasan kebaikan adalah kebaikan setelahnya. Allah berfirman : \"Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk\" (QS. Maryam : 76)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فِي قُلُوبِهِم مَّرَضٞ Fii quluubihim marodhun : Yakni di dalam hatinya terdapat keraguan, kemunafikan, rasa sakit karena takut rahasianya akan terbongkar sehingga mendapatkan adzab atas dirinya. فَزَادَهُمُ ٱللَّهُ مَرَضٗاۖ Fazaadahumullahu marodho : Artinya ditambah dengan keraguan, kemunafikan, rasa sakit dan ketakutan karena sudah sunatullah bahwa keburukan akan ditambah dengan keburukan. عَذَابٌ أَلِيمُۢ ‘Adzaabun aliim : Yaitu adzab yang amat pedih menimpa jiwa. Makna ayat : Sebagaimana Allah Ta’ala mengabarkan bahwa dalam hati-hati mereka terdapat penyakit berupa keraguan, kemunafikan, dan ketakutan, maka Allah Subhanahu wa Ta’ala semakin menambah penyakit yang diderita. Sebagai bentuk hukuman untuk mereka di dunia, dan Allah mengancam dengan adzab yang pedih di akhirat karena pendustaan dan kekufuran yang mereka lakukan. Pelajaran dari ayat : Keburukan akan melahirkan keburukan yang semisalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 10: Allah mengabarkan bahwasanya orang-orang munafik terdapat di hatinya keraguan dan kemunafikan ; Bagaimana berkata Ibnu Mas'ud menafsirkan firman Allah : maka Allah menambahkan di dalam hati mereka penyakit , yaitu sebuah keraguan . Allah juga menjelaskan bahwasanya mereka orang-orang yang munafik pada hari kiamat akan mendapatkan azab pedih karena Sebab mereka mendustakan . pada ayat ini orang-orang munafik disifati dengan kebodohan bagi mereka , dan juga mereka menolak untuk mengikuti cahaya yang datang pada utusan-utusan Allah untuk mereka , dengan ini pada sebagian mereka ditimpa dengan di kuncinya hati mereka serta terhalanginya mereka dari petunjuk , maka bagaimana azab yang pantas bagi mereka ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni keyakinan mereka terdahap kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam lemah dan mereka masih ragu-ragu. Kelemahan dan keragu-raguan keyakinan itu menimbulkan kedengkian, iri-hati dan dendam terhadap Nabi shallallahu 'alaihi wa sallam, agama dan orang-orang Islam, lalu tidak diobati sehingga Allah menambah lagi penyakit terebut. Penyakit yang menimpa hati ada dua; penyakit syubhat dan penyakit syahwat. Kekafiran, kemunafikan, keraguan dan bid'ah merupakan penyakit syubhat, sedangkan kecintaan terhadap perbuatan keji dan maksiat merupakan penyakit syahwat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 10",
    "description": "Hal itu karena dalam hati mereka ada penyakit, seperti penyakit iri dan dengki kepada orang-orang yang beriman, keraguan terhadap ajaran islam, keyakinan yang keliru, dan lainnya, lalu Allah menambah parah penyakitnya itu dengan kemenangan yang besar bagi orang-orang yang beriman. Kemenangan itu sangat menyakitkan mereka karena rasa iri, dengki, dan sombong yang ada dalam diri mereka. Keraguan mereka pun semakin menjadi. Dan, sebagai akibatnya, selain menderita di dunia, mereka akan mendapat azab yang pedih, karena mereka berdusta dengan memperlihatkan keimanan padahal hati mereka ingkar. Dan apabila dikatakan dan dinasihatkan kepada mereka, janganlah berbuat kerusakan di bumi, dengan melanggar nilai-nilai yang ditetapkan agama, menghalangi orang dari jalan Allah, menyebar fitnah, dan memicu konflik, mereka justru mengklaim bahwa diri mereka bersih dari perusakan dan tidak bermaksud melakukan kerusakan. Mereka menjawab, sesungguhnya kami justru orang-orang yang melakukan perbaikan. Itu semua akibat rasa bangga diri mereka yang berlebihan. Begitulah perilaku setiap perusak yang tertipu oleh dirinya: selalu merasa kerusakan yang dilakukannya sebagai kebaikan."
  }
]