[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alangkah buruk kondisi Bani Israil dalam pelanggaran-pelanggaran mereka terhadap perjanjian-perjanjian, Maka tiap kali mereka mengadakan perjanjian sebagian golongan dari mereka melemparkannya dan melanggarnya, maka kamu saksikan mereka itu menjalin sesuatu perjanjian hari ini dengan serius dan mereka melanggar esok hari, bahkan kebanyakan dari mereka itu tidak membenarkan Wahyu yang dibawa oleh nabi Allah dan rasulnya Muhammad Shallallahu Alaihi Wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Di antara keburukan orang-orang Yahudi ialah setiap kali mereka berjanji kepada diri mereka sendiri -salah satunya ialah mengimani isi Taurat tentang kenabian Muhammad -ṣallallāhu 'alaihi wa sallam- sebagian dari mereka mengingkari janji tersebut. Bahkan mayoritas orang-orang Yahudi itu tidak beriman kepada Allah dengan sungguh-sungguh, karena iman yang sejati selalu mendorong seseorang untuk menepati janji."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Allah mengolok orang-orang Yahudi yang berkali-kali membuat perjanjian, namun sebagian mereka kemudian melanggar perjanjian itu, sebab mereka tidak mempercayai risalah Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. أَوَكُلَّمَا عَاهَدُوا عَهْدًا نَبَذَهُ فَرِيقٌ مِنْهُمْ (Patutkah (mereka ingkar kepada ayat-ayat Allah), dan setiap kali mereka mengikat janji, segolongan mereka melemparkannya?) Makna (نبذه) melempar dan membuangnya. Dan maksudnya adalah melanggarnya. Dan sifat dari orang mukmin yang benar adalah memegang teguh pada janji dan menunaikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Setiap kali kaum Yahudi berjanji untuk sungguh-sungguh mengamalkan perintah Taurat, selalu ada sekelompok kaum yang mengingkari dan membangkang dengan perintah Taurat maupun janji mereka sendiri. Bahkan, kebanyakan kaum Yahudi tidak beriman kepada Allah dan rasul-Nya. Lantas bagaimana bisa mereka akan menepati janji mereka? Sebab turunnya ayat ini adalah ketika Nabi Muhammad SAW sudah diutus menjadi nabi, Malik bin Shaif berkata: “Demi Allah, Muhammad tidak diutus untuk kami, dan kami tidak mempunyai ikatan janji apapun dengan Muhammad.” Sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa setiap kali mereka mengikat janji sekelompok mereka melanggarnya} mengabaikan dan melanggarnya {Bahkan sebagian besar mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. Ayat ini menunjukkan tentang suatu keheranan karena banyaknya perjanjian mereka dan tidak sabarnya mereka untuk menunaikan janji-janji itu. Kata “setiap kali” mengandung makna pengulangan, maka setiap kali ada janji, setiap kali itu juga ada pengingkaran. Apakah sebab dari semua itu?. Sebabnya adalah bahwa mayoritas mereka tidak beriman, oleh karena ketiadaan iman mereka itulah yang membawa mereka kepada pengingkaran terhadap janji-janji tersebut. Seandainya keimana mereka itu benar maka pasti mereka akan seperti orang yang firmankan : \"Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; maka di antara mereka ada yang gugur. Dan di antara mereka ada (pula) yang menunggu-nunggu dan mereka tidak merubah (janjinya),\" (QS. Al-Ahzab : 23)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَوَ كُلَّمَا عَٰهَدُواْ } Au kullamaa ‘aahaduu : Huruf hamzah digunakan sebagai istifham inkariy (kata tanya untuk pengingkaran), dan huruf wawu sebagai ‘athof (kata sambung) dengan kalimat tersembunyi yang berbunyi “Apakah mereka ingkar kepada Al-Qur’an dan setiap kali mereka berjanji..” { العهد } al-‘Ahdu : Perjanjian yang mengikat { نَّبَذَهُ } Nabadzahu : Melemparnya dan membuangnya begitu saja dan tidak mempedulikannya. Makna ayat : Pada ayat 100 Allah Ta’ala mengingkari kekufuran orang-orang Yahudi dan kesukaan mereka mengingkari perjanjian. Allah Ta’ala mencatat bahwa kebanyakan orang Yahudi tidak beriman dalam firmanNya (بَلۡ أَكۡثَرُهُمۡ لَا يُؤۡمِنُونَ ) “Akan tetapi kebanyakan mereka tidak beriman.” Pelajaran dari ayat : • Orang-orang Yahudi tidak bisa menepati perjanjian, maka sudah seharusnya bagi kita tidak mempercayai perjanjian yang mereka buat selamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 100: Allah mengabarkan bahwasannya mereka yahudi ketika menyetujui persetujuan menyelisihnya, mereka adalah satu kaum yang tidak memiliki perjanjian. Kemudian Allah menjelaskan bahwasannya kebanyakan yahudi tidak beriman dengan Taurat yang diturunkan Allah kepada utusan – utusan mereka, mereka adalah suatu kaum yang tercela yang jahat secara tabiat dan pembohong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat kesan ta'ajjub, yakni aneh sekali dan sangat mengherankan, mereka banyak berjanji namun tidak memenuhinya; hari ini mereka berjanji, besok sudah melanggarnya. Inilah sebab mereka mengingkari janji, yakni karena tidak beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 100",
    "description": "Ayat ini berisi kecaman dengan redaksi pertanyaan yang mengandung bukti-bukti yang dipaparkan oleh Allah. Dan mengapa setiap kali mereka mengikat janji dengan Allah, ter masuk janji untuk percaya jika nabi yang diutus-Nya datang, sekelompok mereka melanggarnya, menyepelekannya, dan mengingkarinya' sedikit sekali dari mereka yang menepati janji, sedang kan sebagian besar mereka tidak beriman. Sikap-sikap buruk sudah berkumpul sedemikian rupa dalam diri sebagian besar bani israil. Mereka adalah pendengki, keras kepala, licik, dan selalu mengingkari janji. Namun demi kian, masih ada sebagian kecil dari mereka yang beriman. Ayat ini menjelaskan sisi lain dari keburukan orang-orang yahudi. Dan setelah datang kepada mereka seorang rasul dari Allah, yakni nabi Muhammad dengan membawa kitab suci yang membenarkan apa yang ada pada mereka, yakni kitab suci, sebagian dari orang-orang yahudi yang diberi kitab taurat melemparkan kitab Allah itu ke belakang punggung, yakni mengabaikan nya sama sekali, seakan-akan mereka tidak tahu yang dilempar nya adalah kitab Allah, padahal mereka sangat mengetahui."
  }
]