[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Muhammad Shallallahu Alaihi Wasallam datang kepada mereka dengan membawa Alquran yang selaras dengan kandungan Taurat yang ada pada mereka, maka segolongan dari mereka melemparkan kitab Allah, dan meletakkannya di belakang punggung mereka, kelakuan mereka itu seperti kelakuan orang-orang jahil yang tidak mengetahui hakikat nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Dan tatkala Muhammad -ṣallallāhu 'alaihi wa sallam- datang kepada mereka sebagai utusan Allah dengan sifat-sifat yang sesuai dengan apa yang tertera di dalam Taurat, sebagian dari mereka berpaling dari apa yang ditunjukkan oleh kitab suci tersebut dan membuangnya ke belakang punggung mereka serta tidak memperdulikannya. Sifat mereka itu mirip dengan sifat orang bodoh yang tidak mau mengambil manfaat dari kebenaran maupun petunjuk yang ada, dan tidak memperdulikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Dan ketika Nabi Muhammad datang kepada orang-orang Yahudi membawa al-Qur’an yang sesuai dengan kabar yang ada dalam Taurat, maka sebagian pendeta mereka kemudian mengingkari dan Taurat, sebab ia menunjukkan tanda kenabian Muhammad, seakan-akan Taurat tidak menyebutkan Muhammad sama sekali dan seakan-akan mereka tidak mengetahui sama sekali tentangnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَلَمَّا جَاءَهُمْ رَسُولٌ (Dan setelah datang kepada mereka seorang Rasul) Yakni datang Nabi Muhammad Shallallahu ‘Alaihi Wasallam . نَبَذَ فَرِيقٌ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ كِتَابَ اللَّهِ (sebahagian dari orang-orang yang diberi kitab (Taurat) melemparkan kitab Allah) Yakni orang-orang Yahudi yang diberikan oleh Allah kitab taurat dan dimuliakan dengannya, akan tetapi kemudian mereka melemparnya. Karena mereka kafir terhadap nabi Muhammad Shallallahu ‘Alaihi Wasallam dan terhadap apa yang diturunkan kepadanya setelah Allah mengambil perjanjian dengan mereka dalam taurat untuk beriman kepada Muhammad Shallallahu ‘Alaihi Wasallam sekaligus membenarkan dan mengikutinya, dan menjelaskan sifat-sifatnya. Sehingga dengan itu mereka dianggap telah melempar taurat dan melanggarnya, serta menolak apa yang ada didalamnya. كَأَنَّهُمْ لَا يَعْلَمُونَ (seolah-olah mereka tidak mengetahui (bahwa itu adalah kitab Allah)) Yakni beramal amalan orang yang tidak mengetahui."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "101-102 1 ). Barangsiapa yang meninggalkan hal yang bermanfaat baginya, padahal ia mampu mengambil darinya manfaat tetapi ia tidak mengambilnya, niscaya ia akan disibukkan dengan perkara yang membahayakan dirinya. 2 ). Jika manusia berpaling dari wahyu yang Allah firmankan kepada Rasul-Nya; maka tanpa ia sadari akan mengikuti wahyu syaithon ; perhatikanlah firman Allah tentang kaum Yahudi tatkala mereka melemparkan kitab Allah kebelakang punggung mereka : { وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ } \"Dan mereka mengikuti apa yang dibaca oleh syaitan-syaitan\" dan peristiwa ini adalah norma yang telah lampau yang kerap terjadi pada kaum-kaum pembangkang yang menolak kebenaran firman Allah : { وَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ } \"Barangsiapa yang berpaling dari pengajaran Tuhan Yang Maha Pemurah (Al Quran), kami adakan baginya syaitan (yang menyesatkan) maka syaitan itulah yang menjadi teman yang selalu menyertainya\". [ az-zukhruf : 36 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ketika Allah mengutus seorang rasul kepada kaum Yahudi dengan seseorang yang bernama Muhammad SAW, mereka bersedia mempercayai sifat-sifat kenabiannya sebagaimana telah dijelaskan dalam Taurat. Namun ada saja sekelompok dari mereka yang menolak dan mengingkari penjelasan pendeta Yahudi tentang Taurat. Mereka tidak mengamalkan perintah Taurat, seakan-akan mereka tidak mengetahui apapun tentang apa yang diperintahkan dalam Taurat. Maka amal mereka menjadi amal orang-orang yang tidak berilmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika datang kepada mereka Rasul} nabi Muhammad SAW {dari sisi Allah yang membenarkan apa yang ada pada mereka, sebagian orang yang diberi Kitab (Taurat) melemparkan Kitab Allah} Taurat {ke belakang} ke belakang {punggung mereka seakan-akan mereka tidak tahu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Maksudnya, ketika Rosul yang mulia ini telah datang kepada mereka dengan membawa kitab yang agung dengan kebenaran yang sesuai dengan apa yang ada pada mereka sedang mereka mengaku bahwa mereka berpegang teguh kepada kitab mereka tersebut, lalu ketika mereka mengingkari Rosul tersebut dan apa yang beliau bawa, maka “orang-orang yang diberi kitab (Taurat) meelemparkan kitab Allah” yang diturunkan kepada mereka, maksudnya mereka melemparkannya karena benci terhadapnya, “ke belakang (punggung) nya.” Ini adalah sikap parah dalam pengingkaran, seolah-olah mereka dengan tindakannya itu, adalah orang-orang yang tidak tahu, padahal mereka mengetahui kebenarannya dan hakikat kitab yang dibawanya. Maka jelaslah dengan hal ini bahwa kelompok ini berasal dari ahli kitab yang mana kitab tersebut tidak akan tetap berada di tangan mereka selama mereka tidak beriman kepada Rosul tersebut, maka kekufuran mereka kepada Nabi adalah sebuah pengingkaran terhadap kitab mereka sendiri, tanpa mereka sadari. Dan ketika hukum takdir dan hikmah tuhan bahwa barangsiapa yang meninggalkan suatu hal yang bermanfaat baginya dan sangat mungkin dia mengambil manfaat darinya, namun tidak dia manfaatkan, niscaya dia akan diuji dengan disibukkan oleh suatu hal yang justru memudaratkannya, maka barangsiapa yang meninggalkan penyembahan kepada Dzat yang Maha Pengasih, niscaya dia diuji dengan menyembah berhala, dan barangsiapa yang meninggalkan cinta kepada Allah, takut dan berharap kepadaNya, niscaya akan diuji dengan cinta kepada selain Allah, takut dan mengharapnya, barangsiapa yang tidak mengeluarkan hartanya dalam ketaatan kepada Allah niscaya dia akan mengeluarkannya dalam ketaatan kepada setan, barangsiapa yang meninggalkan kepasrahann hanya kepada Rabbnya, niscaya ia akan diuji dengan kepasrahan kepada hamba-hambaNya, dan barangsiapa yang meninggalkan kebenaran, niscaya dia akan diuji dengan kebatilan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { رَسُولٞ } Rasul : Bentuk nakirah pada kata rasul untuk mengagungkan, dan yang dimaksud dengan ar-Rasul adalah Muhammad ﷺ, dan sebelumnya adalah Isa ‘alaihissalam. { لِّمَا مَعَهُمۡ } Limaa ma’ahum : Pengetahuan mengenai sifat-sifat Rasulullah ﷺ serta penetapan kenabiannya, serta seluruh pokok agama yang ada dalam kitab Taurat. { كِتَٰبَ ٱللَّهِ } Kitaaballah : Kitab Taurat. Karena kitab ini menunjukkan kenabian Nabi Muhammad serta kebenaran agama Islam. { وَرَآءَ ظُهُورِهِمۡ } waroo’a dzuhuurihim : Mereka berpaling dan tidak menoleh kepada kitab Taurat lagi karena menanggap kitabnya tidak sesuai dengan kekufuran mereka terhadap nabi Muhammad ﷺ. Seakan akan mereka tidak mengetahui isinya, padahal mereka benar-benar mengetahuinya. Makna ayat : Dalam ayat 101 Allah Ta’ala mencela sikap para pemuka agama dari kalangan Yahudi yang telah meninggalkan ajaran kitab Taurat, karena mereka melihat bahwa kitab Taurat menetapkan kenabian Muhammad ﷺ . Allah Ta’ala berfirman (وَلَمَّا جَآءَهُمۡ رَسُولٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ نَبَذَ فَرِيقٞ مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ كِتَٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمۡ كَأَنَّهُمۡ لَا يَعۡلَمُونَ ) “Dan setelah datang kepada mereka seorang rasul dari sisi Allah yang membenarkan apa (kitab) yang ada pada mereka, sebagian dari orang-orang yang diberi kitab (Taurat) melemparkan kitab Allah ke belakang (punggung)nya seolah-olah mereka tidak mengetahui (bahwa itu adalah kitab Allah) Pelajaran dari ayat : • Kitab Taurat merupakan salah satu kitab Allah yang diturunkan kepada hamba dan rasulNya Musa bin Imran ‘alaihissalam • Besarnya kejahatan orang yang mengingkari kebenaran setelah mengetahuinya, sehingga dia menjadi orang yang seolah-olah tidak mengetahuinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 101: Allah mengabarkan bahwasannya yahudi ketika datang Nabi ﷺ kepada mereka yang membenarkan taurat dan kenabian Musa; para ulama mereka mendustakan taurat dan meninggalakan dibelakang mereka karena kesombongan; karena kepada taurat tersebut dikabarkan akan kenabian Muhammad ﷺ . Allah menjelaskan bahwasannya mereka meninggalkan taurat dan menolaknya seolah – olah mereka tidak mengetahui perintah didalamnya berkenaan dengan perintah mengikuti Muhammad ﷺ serta membenarkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Muhammad shallallahu 'alaihi wa sallam datang kepada mereka membawa kitab yang membenarkan apa yang ada pada mereka. Mereka tinggalkan kitab Allah karena sesuai dengan apa yang dibawa oleh Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni mereka seperti orang-orang yang jahil yang tidak mengetahui isi al kitab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 101",
    "description": "Ayat ini menjelaskan sisi lain dari keburukan orang-orang yahudi. Dan setelah datang kepada mereka seorang rasul dari Allah, yakni nabi Muhammad dengan membawa kitab suci yang membenarkan apa yang ada pada mereka, yakni kitab suci, sebagian dari orang-orang yahudi yang diberi kitab taurat melemparkan kitab Allah itu ke belakang punggung, yakni mengabaikan nya sama sekali, seakan-akan mereka tidak tahu yang dilempar nya adalah kitab Allah, padahal mereka sangat mengetahui dan mereka, yakni sebagian pendeta-pendeta yahudi yang meninggalkan taurat, mengikuti apa yang dibaca oleh setan-setan pada masa kerajaan sulaiman. Ketika rasulullah menye butkan sulaiman sebagai seorang nabi, sebagian pendeta yahudi mengatakan, tidakkah kamu heran karena Muhammad mengatakan bahwa sulaiman bin daud adalah nabi, padahal ia adalah seorang tukang sihir' Allah lalu menurunkan ayat yang menyatakan bahwa sulai man itu tidak kafir, tidak pula tukang sihir, tetapi setan-setan itulah yang kafir, mereka mengajarkan sihir kepada manusia dan apa yang diturunkan kepada dua malaikat di negeri babilonia, yaitu harut dan marut. Padahal keduanya tidak mengajarkan sesuatu kepada seseorang sebelum mengatakan. Sesungguhnya kami hanyalah cobaan yang Allah turunkan bagimu, sebab itu janganlah kafir dan jangan pula kamu mengguna kannya untuk mencelakakan orang lain! maka mereka mempelajari dari keduanya, kedua malaikat itu, apa, yakni sihir yang dapat memisahkan antara seorang suami dengan istrinya. Mereka tidak akan dapat mencelakakan seseorang dengan sihirnya kecuali dengan izin Allah. Mereka mempelajari sesuatu yang mencela kakan dan tidak memberi manfaat kepada mereka. Dan sungguh, mereka sudah tahu, barang siapa membeli atau menggunakan sihir itu, niscaya tidak akan mendapat keuntungan di akhirat. Dan sung guh, sangatlah buruk perbuatan mereka yang menjual dirinya dengan sihir, sekiranya mereka tahu."
  }
]