[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang Yahudi mengikuti apa yang dibisikan setan-setan kepada tukang-tukang sihir pada masa kerajaan Sulaiman Bin Dawud Alaihissalam. Dan Sulaiman itu tidak kafir dan tidak pula belajar sihir, akan tetapi setan-setan lah yang kafir kepada Allah ketika mengajarkan sihir kepada manusia, guna merusak agama, dan demikian pula kaum Yahudi mengikuti sihir yang diturunkan pada dua malaikat Harut dan Marut di negeri Babilonia di Irak, sebagai ujian dan cobaan dari Allah bagi para hamba-Nya. Dan tidaklah dua malaikat-malaikat itu mengajarkan kepada seseorang pun sampai mereka menasihatinya dahulu dan memperingatkannya dari bahaya belajar ilmu sihir, dengan berkata, “janganlah kamu kufur dengan belajar sihir dan tunduk kepada setan-setan”. Maka manusia mempelajari dari dua malaikat sesuatu yang menimbulkan kebencian antara pasangan suami istri hingga akhirnya mereka berdua bercerai. Dan para penyihir tidak mampu mencelakai seseorang pun kecuali dengan izin Allah dan ketentuan-Nya. Dan tidaklah para tukang sihir itu mempelajari kecuali sesuatu keburukan yang memadorotkan mereka dan tidak memberi mereka manfaat. Dan setan-setan telah memindahkan sihir kepada kaum Yahudi, sehingga tersebar di tengah mereka sampai mereka lebih mengutamakannya diatas kitab Allah. Dan sesungguhnya kaum Yahudi telah mengetahui bahwa orang yang lebih memilih sihir dan meninggalkan kebenaran, dia tidak akan mendapatkan bagian dari kebaikan di akhirat. Dan itu benar-benar seburuk-buruk imbalan ketika mereka menjual diri mereka dengan sihir dan kekafiran sebagai penukar keimanan dan mengikuti Rasul, sekiranya mereka memiliki pengetahuan yang membuahkan amal dengan nasihat yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Tatkala mereka meninggalkan agama Allah sebagai gantinya mereka mengikuti kebohongan yang dibuat oleh para setan di masa kerajaan Nabiyullah Sulaiman -'alaihissalām-. Para setan mengklaim bahwa Sulaiman memperkuat kerajaannya dengan ilmu sihir. Padahal Sulaiman tidak kufur dengan mempraktikkan ilmu sihir, sebagaimana klaim orang-orang Yahudi, tetapi para setan itulah yang kufur, karena mereka mengajarkan sihir kepada masyarakat. Para setan juga mengajarkan kepada mereka sihir yang diturunkan oleh dua malaikat Harut dan Marut di kota Babil, Irak, sebagai ujian dan cobaan bagi umat manusia. Kedua Malaikat itu tidak mengajarkan sihir kepada seseorangpun sebelum keduanya memperingatkan dan menjelaskan kepadanya dengan mengatakan, “Sesungguhnya kami ini adalah cobaan dan ujian bagi manusia. Jadi, janganlah kamu menjadi kufur dengan mempelajari sihir.” Kemudian orang yang tidak mau menerima nasihat dari keduanya memutuskan untuk mempelajari sihir dari keduanya. Salah satu jenis sihirnya dapat digunakan untuk memisahkan seorang suami dari istrinya dengan cara menanamkan benih-benih kebencian di antara mereka berdua. Para penyihir itu tidak bisa membahayakan seorangpun kecuali dengan izin Allah. Mereka mempelajari sesuatu (sihir) yang mendatangkan mudarat bagi mereka dan tidak memberikan manfaat kepada mereka. Orang-orang Yahudi itu sudah tahu bahwa orang yang menukar Kitab Allah engan ilmu sihir itu tidak akan mendapatkan bagian (kenikmatan) di akhirat. Sungguh buruk sekali tindakan mereka yang menjual diri mereka sendiri, di mana mereka telah menukar wahyu dan syariat Allah dengan ilmu sihir. Sekiranya mereka mengetahui apa yang bermanfaat, niscaya mereka tidak akan melakukan perbuatan yang keji dan kesesatan yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Setelah orang-orang Yahudi melalaikan kebenaran dari Tuhan mereka, mereka kemudian meniti jalan kebatilan dan mengikuti peninggalan para tukang sihir yang pernah dibacakan setan-setan pada masa Nabi Sulaiman, dan setan-setan itu menisbatkan peninggalan itu kepada Nabi Sulaiman. Maka Allah menyatakan bahwa Nabi Sulaiman berlepas diri dari sihir dengan firman-Nya: (وما كفر سليمان) karena Nabi Sulaiman bukanlah tukang sihir dan bukan pula orang yang mengajarkan sihir, namun setan-setanlah yang kafir karena mengajarkan sihir kepada manusia dan mengajarkan mereka cara memisahkan pasangan suami istri yang diturunkan kepada dua malaikat Harut dan Marut di kota Babil yang sampai sekarang kota itu masih berdiri di negeri Iraq. Dua malaikat ini membuka aib para tukang sihir bahwa mereka adalah orang-orang kafir, dan ilmu sihir merupakan kekafiran. Dua malaikat ini tidak mengajarkan seseorang kecuali setelah mereka memperingatkannya dengan mengatakan: “Kami adalah ujian dan cobaan dengan mengajarkan sihir yang merupakan kekafiran, maka janganlah kamu kafir.” Maka barangsiapa yang takut kepada Allah niscaya ia akan selamat. Sedangkan orang-orang yang menginginkan ilmu itu akan belajar dari dua malaikat tersebut. Para tukang sihir tidak dapat memberi kemudharatan dengan sihirnya kecuali dengan kehendak Allah; dan apa yang mereka pelajari sesungguhnya adalah mudharat yang besar bagi diri mereka sendiri, sebab ilmu itu mengandung bahaya dan kesyirikan karena merupakan bentuk meminta tolong kepada selain Allah, sehingga ilmu sihir tidak akan memberikan manfaat bagi mereka sedikitpun. Orang-orang Yahudi sebenarnya telah mengetahui bahwa orang yang memilih ilmu sihir dan meninggalkan kebenaran tidak akan mendapatkan bagian kebaikan di akhirat. Kemudian Allah mengolok mereka atas perbuatan mereka ini, dengan lebih memilih sihir dan kekafiran dan berpaling dari keimanan, sehingga mereka tidak mendapat bagian surga di akhirat kelak. Kalaulah orang-orang Yahudi mengetahui ilmu yang bermanfaat bagi mereka niscaya mereka tidak akan melakukan hal tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ (Dan mereka mengikuti apa yang dibaca oleh syaitan) Yakni berupa sihir dan lainnya. Dan makna (تتلو) apa yang dikatakan atau dibaca oleh setan tersebut. عَلَىٰ مُلْكِ سُلَيْمَانَ ( syaitan pada masa kerajaan Sulaiman) Yakni pada masa Nabi Sulaiman bertahta. Dan mereka mengira sihir ini adalah bagian dari ilmu Nabi Sulaiman, dan mengira dia membolehkannya dan juga membacanya. وَمَا كَفَرَ سُلَيْمَانُ (padahal Sulaiman tidak kafir) Disini Allah membebaskan Nabi Sulaiman dari tuduhan orang-orang Yahudi bahwa dia bersujud kepada Bal’im (berhala-berhala). وَلَٰكِنَّ الشَّيَاطِينَ كَفَرُوا (hanya syaitan-syaitan lah yang kafir) Yakni dengan mengajarkan kepada manusia ilmu sihir. وَمَا أُنْزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ ۚ (apa yang diturunkan kepada dua orang malaikat di negeri Babil yaitu Harut dan Marut) Yakni juga mengajarkan kepada manusia apa yang diturunkan kepada dua malaikat Harut dan Marut yang berada di negeri Babil-Irak. Yang sebenarnya keduanya -menurut riwayat sebagian salaf- adalah malaikat yang meminta untuk turun ke bumi. Keduanya pun diturunkan dan ditanam dalam diri mereka hawa nafsu, kemudian mereka bermaksiat kepada Allah sehingga dikurung didalam sumur yang terletak di Babil sebagai cobaan bagi manusia dengan mengajarkan mereka ilmu sihir. وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَا(sedang keduanya tidak mengajarkan (sesuatu) kepada seorangpun sebelum mengatakan..) Yakni mengajarkan dengan memperingati mereka dari sihir dan bukan mengajarkan dengan mengajak kepada sihir. Keduanya berkata kepada mereka: “janganlah kalian melakukan ini!” إِنَّمَا نَحْنُ فِتْنَةٌ(“Sesungguhnya kami hanya cobaan (bagimu)) Yakni cobaan dan ujian dari Allah untuk hamba-hamba-Nya. فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا (sebab itu janganlah kamu kafir, Maka mereka mempelajari dari kedua malaikat) Yakni mempelajari sihir. Yakni kedua malaikat itu mengajari manusia, sehingga manusiapun belajar dari keduanya. مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ ۚ (mereka dapat menceraikan antara seorang (suami) dengan isterinya) Ada yang berpendapat bahwa sihir mempunyai mempengaruhi hati, berupa rasa cinta, kebencian, pertemuan dan perpisahan, dan mendekatkan dan menjauhkan. Dan ada yang berpendapat sihir tidak mempunyai kekuatan kecuali berupa khayalan, ilusi, dan tipu daya, seperti yang dilakukan oleh para penyihir Fir’aun. وَمَا هُمْ بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلَّا بِإِذْنِ اللَّهِ ۚ (Dan mereka itu (ahli sihir) tidak memberi mudharat dengan sihirnya kepada seorangpun, kecuali dengan izin Allah) Jadi, sihir dapat memberi efek pada diri seseorang, akan tetapi tidak bisa memberi efek buruk kecuali pada orang yang memang memberi izin pada sihir tersebut untuk mempengaruhinya. Dan ulama sepakat bahwa sihir dapat memberi efek pada seseorang dan sihir adalah sesuatu yang nyata; tidak ada yang menyelisihi hal ini kecuali orang-orang mu’tazilah dan Abu Hanifah. وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ ۚ (Dan mereka mempelajari sesuatu yang tidak memberi mudharat kepadanya dan tidak memberi manfaat) Dalam potongan ayat ini terdapat penjelasan yang jelas behwa sihir tidak memberi faidah kepada pemiliknya dan tidak dapat mendatangkan manfaat; akan tetapi murni keburukan dan kerugian. لَمَنِ اشْتَرَاهُ (yang menukarnya) Yakni menukar kitab Allah dengan apa yang dibaca syaitan (sihir) مِنْ خَلَاقٍ ۚ (keuntungan) Yakni bagian/jatah مَا شَرَوْا بِهِ أَنْفُسَهُمْ ۚ (perbuatan mereka menjual dirinya dengan sihir) Yakni menjual diri mereka. لَوْ كَانُوا يَعْلَمُونَ(kalau mereka mengetahui) Karena mereka meninggalkan amal padahal mereka mengetahui."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "101-102 1 ). Barangsiapa yang meninggalkan hal yang bermanfaat baginya, padahal ia mampu mengambil darinya manfaat tetapi ia tidak mengambilnya, niscaya ia akan disibukkan dengan perkara yang membahayakan dirinya. 2 ). Jika manusia berpaling dari wahyu yang Allah firmankan kepada Rasul-Nya; maka tanpa ia sadari akan mengikuti wahyu syaithon ; perhatikanlah firman Allah tentang kaum Yahudi tatkala mereka melemparkan kitab Allah kebelakang punggung mereka : { وَاتَّبَعُوا مَا تَتْلُو الشَّيَاطِينُ } \"Dan mereka mengikuti apa yang dibaca oleh syaitan-syaitan\" dan peristiwa ini adalah norma yang telah lampau yang kerap terjadi pada kaum-kaum pembangkang yang menolak kebenaran firman Allah : { وَمَنْ يَعْشُ عَنْ ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ } \"Barangsiapa yang berpaling dari pengajaran Tuhan Yang Maha Pemurah (Al Quran), kami adakan baginya syaitan (yang menyesatkan) maka syaitan itulah yang menjadi teman yang selalu menyertainya\". [ az-zukhruf : 36 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kaum Yahudi mengikuti perkataan setan dan atau setan (dari golongan manusia: penyihir) pada masa raja Sulaiman. Mereka mengira bahwa Sulaiman tidak akan bisa memanfaatkan jin dan angina kecuali dengan sihir, sehingga mereka meminta ilmu sihir itu. Sulaiman bukan kafir hanya karena bisa melakukan sesuatu yang magis, lalu mereka belajar kepada sulaiman, tapi mereka juga bukan kafir, karena yang kafir itu adalah sihir. Adapun, setan-setan laki-laki-lah yang kafir karena mengajarkan sihir kepada manusia sehingga manusia melakukannya. Para setan melakukan melakukan itu semua dengan maksud agar manusia tergoda dan tersesat. Mereka juga mengajarkan manusia tentang apa yang diturunkan kepada dua malaikat: Harut dan Marut di negeri Babilonia, sebuah negeri di Irak. Dulu, kedua malaikat itu mengajarkan sihir kepada manusia agar mereka menjauhi setan, tapi wujud mereka yang sesungguhnya adalah sebagai malaikat. Dua malaikat itu turun ke dunia dengan permintaan itu. Namun mereka berdua (malaikat) tidak akan mau mengajari mereka sebelum mengatakan kepada mereka: “Jangan lakukan ini itu dan jangan kafir, kami hanya ujian dan fitnah dari Allah untuk para hambanya. Dengan pengajaran sihir itu, diantaranya menyebabkan perceraian dengan suami-istri mereka, karena ditanamkan kebencian dan amarah kepada keduanya. Menurut jumhur di luar Mu’tazilah dan Abu Hanifah bahwa sihir itu mempunyai dampak terhadap hati, namun hanya bisa berdampak ketika memang Allah izinkan. Manusia belajar sihir yang justru dapat membahayakan agama mereka. Sihir tidak dapat memberi kemanfaatan dunia, karena sihir adalah sebuah bahaya yang nyata. Sesungguhnya kaum Yahudi mengetahui, bahwa siapa yang lebih memilih sihir dibandingkan Taurat, maka mereka tidak akan mempunyai kesempatan untuk masuk surga. Sungguh teramat buruk, mereka menjual jiwa dan agama mereka dengan sihir. Mereka juga tidak mengamalkan ilmu mereka, seandainya mereka tahu bahwa azab bagi mereka tidak akan menunggu lama. Sebab turunnya ayat ini: diriwayatkan dari Muhammad Ishaq dan Imam Thabari dan lainnya bahwa beberapa pendeta Yahudi berkata: “Jangan heran kalian dengan Muhammad, yang berkata bahwa Sulaiman adalah seorang nabi? Itu semua bohong, Sulaiman hanyalah seorang penyihir.” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengikuti apa yang dibaca} apa yang dibaca {oleh setan-setan pada Kerajaan} masa kerajaan {Sulaiman. Dan tidaklah kufur Sulaiman, melainkan setan-setan itulah yang kufur. Mereka mengajarkan sihir kepada manusia dan apa yang diturunkan kepada dua malaikat} mereka mengajarkan apa yang diturunkan kepada dua malaikat {di negeri Babilonia} di kota Babilonia di negeri Iraq {yaitu Harut dan Marut. Padahal, keduanya tidak mengajarkan sesuatu kepada seseorang sebelum mengatakan, “Sesungguhnya kami hanyalah fitnah} kami adalah cobaan dan ujian dari sisi Allah {maka janganlah kufur”} maka janganlah kamu belajar sihir sehingga kamu bisa menjadi kufur {Lalu mereka belajar dari keduanya apa yang (dapat) memisahkan antara seseorang dan istrinya. Mereka tidak akan dapat mencelakakan seseorang dengan itu} dengan sihir {kecuali dengan izin Allah. Mereka mempelajari sesuatu yang bisa mencelakakan dan tidak memberi manfaat kepada mereka. Sungguh mereka benar-benar sudah mengetahui} orang-orang Yahudi itu telah mengetahui {bahwa siapa yang membeli itu} menukarkan sihir dengan kitab Allah {niscaya di akhirat tidak akan mendapat keuntungan} keberuntungan {Sungguh buruk sekali perbuatan mereka yang menjual diri mereka dengan sihir} apa yang mereka jual dari bagian diri mereka dengan sihir itu {jika mereka mengetahui."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-103. Seperti itu juga orang-orang Yahudi ketika mereka melemparkan Kitabullah, mereka akhirnya mengikuti apa yang dibaca oleh setan dan diciptakan dari sebuah sihir pada masa kerajaan sulaiman, di mana setan-setan mengeluarkan sihir kepada manusia hingga mereka menyangka bahwasanya Sulaiman memakai sihir dan menggunakannya untuk mendapatkan kerajaan yang besar. Mereka adalah pendusta dalam hal itu karena Sulaiman tidak memakainya, karena Allah telah menyucikannya dalam firmanNya, “Padahal Sulaiman tidaklah kafir, ” yakni dengan mempelajari sihir karena dia tidak mempelajarinya, ” akan tetapi setan-setan itulah yang kafir (mengerjakan sihir) “ dalam hal itu, ” mereka mengajarkan sihir kepada manusia “ karena usaha penyesatan mereka dan semangat untuk menggoda anak Adam, begitupula kaum Yahudi juga mengikuti sihir yang diturunkan oleh dua malaikat yang berbeda di Babil, negeri Irak, dimana sihir diturunkan kepada mereka sebagai ujian dan cobaan dari Allah untuk hamba-hambaNya, lalu mereka berdua mengajarkan sihir kepada orang-orang, ”sedang keduanya tidak mengajarkan kepada siapapun hingga“ mereka berdua menasehatinya, dan “berkata, ’ sesugguhnya kami hanya cobaan bagimu, sebab itu janganlah kamu kafir’.“ maksudnya, janganlah kamu mempelajari sihir, karena sihir itu adalah kekufuran, mereka berdua melarangnya mempelajari sihir seraya mengabarkan tentang tingkatannya. Pengajaran setan akan sihir dalam bentuk pengaburan dan penyesatan lalu menisbatkan dan melariskannya kepada seseorang yang telah disucikan oleh Allah dari sihir, yaitu Nabi Sulaiman. Adapun pengajaran kedua malaikat itu adalah sebagai cobaan dengan adanya nasihat keduanya, agar tidak menjadi hujjah bagi mereka. Orang-orang Yahudi mengikuti sihir yang diajarkan oleh setan dan sihir yang diajarkan oleh kedua malaikat tersebut, kemudian mereka meninggalkan ilmu-ilmu dari para Nabi dan Rosul, dan menerima ilmu-ilmu setan, maka masing-masing orang akan cenderung kepada hal yang sesuai dengannya. Kemudian Allah menyebutkan tentang kemudaratan sihir seraya berfirman, ”maka mereka mempelajari kedua malaikat sihir yang membuat mereka dapat menceraikan antara seorang (suami) dengan istrinya” padahal cinta kasih kedua suami istri tidaklah dapat diukur dengan cinta kasih selain mereka. Karenanya Allah berfirman tentang hak keduanya : \"dan Allah menjadikan diantara kalian rasa cinta dan kasih sayang\" Dalam hal ini menunjukan bahwa sihir itu memiliki hakikat dan bahwa dia dapat memudaratkan atas ijin dari Allah dan atas kehendak Allah. Adapun izin itu ada dua macam : izin yang bersifat takdir (penciptaan) yaitu yang bersangkutan dengan kehendak Allah sebagaimana yang ada dalam ayat ini, dan ijin yang bersifat syariat sebagaimana firman-Nya dalam ayat yang lalu : \"maka sesungguhnya Dia telah menerunkannya kedalam hatimu dengan izin Allah\" Dalam ayat ini dan ayat-ayat yang semisalnya menjelaskan bahwa apapun sebabnya walaupun ia memiliki pengaruh yang sangat besar, ia tetap mengikuti qadha dan takdir dimana sebab-sebab tersebut tidak berdiri sendiri dalam pengaruhnya, dan tidak ada satupun dari kelompok-kelompok umat islam yang menentang dasar kerangka ini selain al-qadariyah dalam pembahasan perbuatan-perbuatan hamba, dimana mereka menyatakan bahwasanya perbuatan-perbuatan hamba itu terpisah dan tidak tunduk kepada kehendak, mereka mengeluarkannya dari takdir Allah dan mereka menyalahi Kitabullah dan Sunnah Rosululloh serta ijma’ para sahabat tabi’in. Kemudian Allah menyebutkan bahwa ilmu sihir itu murni berbahaya, tidak ada manfaatnya sedikitpun, baik secara agama maupun dunia, sebagaimana terdapat beberapa manfaat pada beberapa kemaksiatan seperti dalam firman Allah tentang khamar dan judi : \"katakanlah didalam keduanya terdapat dosa yang besar serta manfaat-manfaat bagi manusia, dan dosa keduanya lebih besar daripada manfaatnya\" Sihir itu murni berbahaya bahkan ia tidak memiliki factor penunjang sama sekali, dan hal-hal yang dilarang itu semuanya murni berbahaya atau mudaratnya lebih besar daripada manfaatnya, sebagaimana perkara-perkara yang diperintahkan itu juga murni bermanfaat atau manfaatnya lebih besar daripada mudaratnya. “Sungguh mereka telah meyakini,” yaitu orang-orang Yahudi, bahwa “barangsiapa yang menukarnya dengan sihir itu,” yaitu menyukai sihir sebagaimana pembeli menyukai suatu barang dagangan, “tiadalah baginya keuntungan di akhirat,” maksudnya tidak mendapat bagian, bahkan hal itu mengakibatkan hukuman, dan tidaklah perbuatan mereka itu atas dasar kebodohan, akan tetapi karena sangat menyukai kehidupan dunia daripada akhirat, maka sangat jeleklah “perbuatan mereka menjual dirinya dengan sihir, kalau mereka mengetahui, ” maksudnya mengetahui akan buah dari perbuatan yang telah mereka lakukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مَا تَتۡلُواْ ٱلشَّيَٰطِينُ } Maa tatlusy syayaathiin : Apa yang diikuti dan dikatakana oleh setan-setan yang berisi kalimat-kalimat sihir. { عَلَىٰ مُلۡكِ سُلَيۡمَٰنَۖ } ‘Ala mulki sulaiman : Pada masa kekuasaan Nabi Sulaiman dan saat beliau masih bertahta. { ٱلشَّيَٰطِينَ } asy-Syayathiin : Bentuk plural dari ‘syaithaan’ yaitu setiap orang yang buruk dan jahat sehingga tidak ada lagi celah untuk menerima kebaikan dalam hatinya. { ٱلسِّحۡرَ } as-Sihr : Sihir adalah sesuatu yang lembut asalnya dan tersembunyi penyebab terjadinya, memiliki pengaruh yang dapat dilihat secara kasat mata pada diri atau badan seseorang. { هَٰرُوتَ وَمَٰرُوتَۚ } Haarut wa Maarut : Dua nama malaikat yang diturunkan untuk menguji manusia. { فَلَا تَكۡفُرۡۖ } Falaa takfur : Janganlah kamu mempelajari sihir dari kami untuk menyakiti orang lain, sehingga kamu menjadi kafir. { بَيۡنَ ٱلۡمَرۡءِ وَزَوۡجِهِۦ } Bainal mar’i wa zaujih : Antara suami dengan istrinya { ٱشۡتَرَىٰهُ } Isytaraahu : Membeli sihir, yaitu dengan mempelajarinya dan mempraktekannya. { الخلاق } al-Khalaaq : Bagian yang didapatkan. { مَا شَرَوۡاْ } Maa syaraau : Apa yang mereka jual dengan dirinya sendiri Makna ayat : Konteks ayat-ayat ini masih menjelaskan mengenai keburukan dan kerusakan yang dilakukan oleh orang-orang Yahudi. Pada ayat 102 Allah Ta’ala mengabarkan bahwa orang-orang Yahudi ketika meninggalkan kitab Taurat karena menjelaskan mengenai kenabian Muhammad ﷺ dan menguatkan kebenaran agamanya, mereka mengikuti kebatilan dan kebohongan yang dikumpulkan oleh setan-setan dari kalangan manusia ataupun jin. Kebatilan itu dikumpulkan dalam bentuk mantra-mantra dan jimat-jimat. Setan-setan itulah yang mengarang berbagai mantra, serta mengaku bahwa berbagai kalimat sihir yang terdapat dalam mantra itu berasal dari masa kerajaan Nabi Sulaiman bin Dawud ‘alahimassalam. Serta dengan berbagai kalimat sihir itulah dahulu Nabi Sulaiman dapat memerintah manusia dan jin. Apabila faktanya demikian, maka Sulaiman bukanlah seorang nabi ataupun rasul, akan tetapi seorang penyihir yang kafir. Oleh karena itu Allah membersihkan tuduhan dan nama baik nabiNya dalam firmanNya (وَمَا كَفَرَ سُلَيۡمَٰنُ ) “Dan Sulaiman, tidaklah kafir..” serta menetapkan kekafiran itu kepada setan-setan dalam firmanNya (وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُواْ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحۡرَ ) “..tetapi, setan-setan itulah yang kafir karena telah mengajarkan sihir kepada manusia..”. Mereka mendapat inspirasi untuk mengajarkan sihir kepada manusia setelah mempelajari dari dua malaikat, yaitu Harut dan Marut di Babilonia, Iraq. Yang mana isinya adalah berbagai ilmu sihir dan cabang-cabangnya. Di sini kemudian Allah Ta’ala memberitahukan bahwa dua malaikat itu diturunkan sebagai fitnah (ujian). Mereka berkata setiap kali ada orang yang datang untuk mempelajari sihir,”Sesungguhnya kami berdua adalah ujian maka janganlah kamu kafir dengan mempelajari sihir.” Dari Ucapan ini dapat dipahami secara jelas bahwa segala bentuk mantra dan praktek sihir yang memiliki pengaruh terhadap orang lain, dapat dikategorikan berupa kekufuran dalam pandangan dan syariat Allah. Kemudian Allah Ta’ala memberitakan pada ayat ini bahwa apa yang manusia pelajari dari dua malaikat itu bertujuan untuk memisahkan antara seorang suami dengan istrinya. Akan tetapi bahaya yang ditimbulkan oleh sihir itu hanya akan terjadi dengan izin Allah Ta’ala sesuai dengan sunatullah mengenai hukum sebab akibat. Jika Allah menghendaki akan membuat penghalang sehingga bahaya sihir tidak berpenaruh, pastilah akan dilakukanNya, karena Dia mampu melakukan segala sesuatu. Dengan ini diketahui bahwa orang-orang yang mempelajari sihir pada hakikatnya hanya mempelajari hal yang berbahaya dan tidak bermanfaat bagi dirinya. Pada akhir ayat Allah Ta’ala menetapkan bahwa orang-orang Yahudi itu mengetahui tentang kekufuran sihir, orang yang mempelajari sihir, dan mempraktekannya. Karena Allah Ta’ala memberitakan bahwa mereka tidak memiliki bagian di akhirat berupa kenikmatan abadi di sana, karena mereka itu benar-benar kafir. Lantas Allah Ta’ala mencela perbuatan orang Yahudi yang menjual dirinya, dan memberikan cap kebodohan dan tidak berpengetahuan dalam firmanNya (وَلَبِئۡسَ مَا شَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡۚ لَوۡ كَانُواْ يَعۡلَمُونَ ) “Amat jahatlah perbuatan mereka menjual dirinya sendiri dengan sihir, kalau mereka mengetahui.” Pelajaran dari ayat : • Berpaling dari al-Qur’an dan sunnah yang telah mengharamkan keburukan, kerusakan serta kezhaliman dapat membuka pintu menuju kebatilan dalam bidang undang-undang hukum, bid’ah keagamaan, dan kesesatan berpikir. Allah Ta’ala berfirman,”Barangsiapa yang berpaling dari pengajaran (Rabb) Yang Maha Pemurah (al-Qur’an), Kami adakan baginya setan (yang menyesatkan) maka setan itulah yang menjadi teman yang selalu menyertainya. Dan sesungguhnya setan-setan itu benar-benar menghalangi mereka dari jalan yang benar dan mereka menyangka bahwa mereka mendapat petunjuk.” (QS az-Zukhruf : 36-37) • Kafirnya penyihir dan keharaman mempelajari sihir serta mempraktekannya. • Allah Ta’ala yang menciptakan kebaikan dan keburukan. Dan tidak ada bahaya ataupun manfaat yang terjadi kecuali dengan izinNya. Maka wajib untuk kembali kepada Allah dalam memperoleh manfaat atau menolak bahaya dengan cara berdoa dan merendah kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 102: Allah mengabarkan bahwasannya yahudi meninggalkan taurat dibelakang mereka dan mengikuti apa yang dikatakan oleh setan – setan dan sihir; dimana mereka meng klaim bahwasannya Sulaiman menguasai sihir di zamannya. Akan tetapi Allah menjelaskan bahwasannya Sulaiman tidaklah kafir karena Sulaiman tidak mempelajari sihir dan tidak menggunakannya, adapun para setan sungguh telah kafir karena mereka mengajarkan kepada manusia sihir untuk menyesatkan mereka dan merusak mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa'diy menerangkan dalam kitab Tafsirnya bahwa sudah menjadi ketentuan dan hikmah ilahiyyah, barang siapa yang meninggalkan sesuatu yang memberinya manfaat dan ia bisa mengambil manfaat itu, tetapi malah meninggalkannya, maka ia diuji dengan kesibukan-kesibukan yang memadharatkannya. Barang siapa yang tidak beribadah kepada Allah, maka ia ditimba musibah dengan beribadah kepada selain-Nya, barang siapa yang meninggalkan cinta kepada Allah, takut dan berharap kepada-Nya, maka ia akan ditimpakkan musibah dengan cinta kepada selain Allah, takut dan berharap kepada selain-Nya, barang siapa yang tidak menafkahkan harta untuk keta'atan kepada Allah, maka ia akan menafkahkan hartanya karena menta'ati setan, barang siapa yang tidak menghinakan dirinya kepada Tuhannya, maka akan ditimpa musibah dengan menghinakan diri kepada sesama hamba, dan barang siapa yang meninggalkan kebenaran, maka ia akan ditimpa musibah dengan sesuatu yang batil. Seperti inilah keadaan orang-orang Yahudi, ketika mereka meninggalkan kitab Allah, mereka mengikuti apa yang dibacakan oleh setan-setan dan apa yang mereka buat berupa perkara sihir di masa kerajaan Sulaiman. Setan-setan mengeluarkan ilmu sihir dan mereka mengatakan bahwa Sulaiman 'alaihis salam juga mempelajari sihir sehingga ia memperoleh kerajaan yang besar. Namun apa yang mereka katakan adalah dusta, Sulaiman tidaklah mempelajari ilmu sihir, Allah menyatakan \"wa maa kafara Sulaimaan\" (Sulaiman tidaklah kafir), yakni tidak mempelajari sihir. Maksudnya, kitab-kitab sihir. Setan-setan itu menyebarkan berita-berita bohong, bahwa Nabi Sulaiman menyimpan lembaran-lembaran sihir. Maksudnya, Sulaiman tidaklah kafir dan tidak mempelajari dan melakukan sihir. Ayat ini menunjukkan bahwa melakukan sihir merupakan perbuatan yang dapat mengkafirkan pelakunya. Karena tujuan yang diinginkan setan adalah agar manusia tersesat dan jauh dari agama, di antara caranya adalah dengan menyodorkan ilmu sihir, akhirnya banyak di kalangan orang-orang Yahudi yang mempelajarinya. Orang-orang Yahudi juga mempelajari sihir dari dua malaikat bernama Harut dan Marut di negeri Babil di Irak, padahal ia merupakan cobaan dari Allah kepada hamba-hamba-Nya. Bahkan kedua malaikat itu tidaklah mengajarkan sihir kepada seorang pun kecuali setelah memberinya nasehat dan mengingatkannya untuk tidak mempelajari sihir serta mengatakan, \"Janganlah kamu kafir\" akibat mempelajri sihir dan menta'ati setan. Namun mereka malah mempelajarinya. Dengan demikian, setan mengajarkan sihir kepada manusia dengan tujuan melakukan tadlis (penyamaran) dan penyesatan, ditambah lagi dengan penisbatannya kepada Nabi Sulaiman 'alaihis salam, padahal Beliau tidak seperti itu. Adapun malaikat, mengajarkan sihir sebagai ujian sambil memberikan nasehat. Hal ini untuk menegakkan hujjah kepada mereka. Namun, orang-orang Yahudi lebih mengutamakan ilmu sihir yang diajarkan oleh setan dan diajarkan oleh dua malaikat sebagai cobaan, mereka tinggalkan ilmu agama yang diwariskan oleh para nabi dan rasul beralih kepada ilmu yang diajarkan oleh setan. Mirip dengan apa yang mereka lakukan adalah orang-orang di zaman sekarang, yang meninggalkan ilmu agama; meninggalkan kitab Allah, meninggalkan sabda Rasulullah shallallahu 'alaihi wa sallam beralih kepada filsafat yang diajarkan oleh orang-orang Yunani, ini pun sama termasuk bisikan setan. Oleh karena itu, Imam Syafi'i rahimahullah berkata: كل العلوم سوى القران مشغلة إلا الحديث والفقه فى الدين العلم ما كان فيه قال حدثنا وماسوى ذلك وسواس الشياطين \"Semua ilmu selain Al Qur'an (seperti ilmu kalam) hanyalah menyibukkan, selain hadits dan mendalami agama. Ilmu adalah yang tercantum di dalamnya kata \"telah menyampaikan sebuah hadits kepada kami\", sedangkan selain itu hanyalah bisikan setan belaka.\" Ada berbacam-macam ilmu sihir yang dikerjakan orang-orang Yahudi, sampai-sampai ada sihir yang digunakan untuk memisahkan pasangan suami-istri. Ayat ini menunjukkan bahwa sihir itu ada hakikatnya, dan bahwa sihir itu dapat mencelakakan dengan izin Allah. Perlu diketahui, bahwa izin terbagi dua: Pertama, Izin Qadariy, yakni yang terkait dengan kehendak Allah sebagaimana pada ayat ini. Kedua, Izin Syar'i, seperti pada ayat 97 sebelumnya. Perbedaan di antara keduanya adalah bahwa Izin Qadari tidak mesti dicintai oleh Allah Subhaanahu wa Ta'aala, sedangkan Izin Syar'i memang dicintai Allah. Ayat ini juga menunjukkan bahwa sebab itu betapa pun besar yang diupayakan, namun hasilnya tetap mengikuti Qadha' dan Qadar. Ayat ini menunjukkan bahwa bahwa ilmu sihir adalah ilmu yang mencelakakan, tidak ada manfa'at di dalamnya baik manfa'at diniyyah (agama) maupun duniawiyah (dunia) tidak seperti maksiat lainnya yang terkadang ada sedikit manfa'at duniawinya seperti khamr dan judi. Namun sihir penuh madharat, tidak ada manfa'atnya sama sekali. Oleh karena itu, segala yang dilarang bisa isinya madhharat (bahaya) saja atau bahayanya lebih besar daripada manfa'atnya, sebagaimana segala yang diperintahkan, bisa isinya hanya maslahat atau kebaikannya lebih besar daripada keburukan. Setan membawakan sihir kepada orang-orang Yahudi, sehingga ilmu sihir menjadi ilmu yang diminati mereka, sampai-sampai kitab Allah ditinggalkan. Padahal mereka mengetahui barang siapa yang yang lebih memilih ilmu sihir dan meninggalkan kebenaran (ilmu agama), niscaya ia tidak akan memperoleh keuntungan di akhirat. Yakni rela menjual imannya untuk memperoleh sihir. Yakni jika mereka memiliki ilmu (pengetahuan) yang membuahkan amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 102",
    "description": "Dan mereka, yakni sebagian pendeta-pendeta yahudi yang meninggalkan taurat, mengikuti apa yang dibaca oleh setan-setan pada masa kerajaan sulaiman. Ketika rasulullah menye butkan sulaiman sebagai seorang nabi, sebagian pendeta yahudi mengatakan, tidakkah kamu heran karena Muhammad mengatakan bahwa sulaiman bin daud adalah nabi, padahal ia adalah seorang tukang sihir' Allah lalu menurunkan ayat yang menyatakan bahwa sulai man itu tidak kafir, tidak pula tukang sihir, tetapi setan-setan itulah yang kafir, mereka mengajarkan sihir kepada manusia dan apa yang diturunkan kepada dua malaikat di negeri babilonia, yaitu harut dan marut. Padahal keduanya tidak mengajarkan sesuatu kepada seseorang sebelum mengatakan. Sesungguhnya kami hanyalah cobaan yang Allah turunkan bagimu, sebab itu janganlah kafir dan jangan pula kamu mengguna kannya untuk mencelakakan orang lain! maka mereka mempelajari dari keduanya, kedua malaikat itu, apa, yakni sihir yang dapat memisahkan antara seorang suami dengan istrinya. Mereka tidak akan dapat mencelakakan seseorang dengan sihirnya kecuali dengan izin Allah. Mereka mempelajari sesuatu yang mencela kakan dan tidak memberi manfaat kepada mereka. Dan sungguh, mereka sudah tahu, barang siapa membeli atau menggunakan sihir itu, niscaya tidak akan mendapat keuntungan di akhirat. Dan sung guh, sangatlah buruk perbuatan mereka yang menjual dirinya dengan sihir, sekiranya mereka tahudan jika mereka beriman dan bertakwa, takut kepada azab Allah, pahala dari Allah pasti lebih baik daripada sihir yang menyibukkan mereka, sekiranya mereka tahu."
  }
]