[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya orang-orang Yahudi beriman dan takut kepada Allah pastilah mereka meyakini bahwa sesungguhnya pahala Allah lebih baik daripada sihir dan keuntungan yang mereka dapatkan dengannya. Seandainya mereka mengetahui apa yang dapat diraih dengan iman dan taqwa berupa pahala dan balasan sdengan pengetahuan yang hakiki, niscaya mereka pasti beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Sekiranya orang-orang Yahudi itu benar-benar beriman dan bertakwa kepada Allah dengan menjalankan ketaatan kepada-Nya dan meninggalkan maksiat terhadap-Nya, niscaya pahala dari Allah akan lebih baik bagi mereka daripada perbuatan yang mereka jalani, jika mereka mengetahui apa yang bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Kalaulah orang-orang Yahudi beriman kepada Allah dan takut kepada-Nya niscaya Allah akan memberi mereka pahala yang lebih baik dari sihir yang mereka sibuk dengannya, andai saja mereka memahami besarnya pahala Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. وَلَوْ أَنَّهُمْ آمَنُوا (Sesungguhnya kalau mereka beriman) Yakni kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallamdan apa yang didatangkannya berupa al-Qur’an. وَاتَّقَوْا(dan bertakwa) Yakni menjauhi apa yang mereka terjerumus didalamnya berupa ilmu sihir dan kekufuran. لَمَثُوبَةٌ (niscaya mereka akan mendapat pahala) Yakni niscaya akan mendapat pahala yang lebih baik dari kenikmatan dunia yang mereka dapatkan dari sihir"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Andaikan orang-orang yang belajar sihir itu beriman kepada Allah dan rasul-Nya, bertaqwa, mengerjakan perintah-Nya, menjauhi larangan-Nya, tidak terjerumus dalam ilmu sihir dan kekufuran, maka sungguh mereka akan medapatkan ganjaran yang lebih baik dari sihir dan magisnya. Sungguh, seandainya mereka tahu, mereka tidak akan dengan mudahnya memilih sihir dan meninggalkan keimanan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya mereka benar-benar beriman dan bertakwa, maka sungguh pahala} maka sungguh pahala {dari sisi Allah itu lebih baik, seandainya mereka mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-103. Seperti itu juga orang-orang Yahudi ketika mereka melemparkan Kitabullah, mereka akhirnya mengikuti apa yang dibaca oleh setan dan diciptakan dari sebuah sihir pada masa kerajaan sulaiman, di mana setan-setan mengeluarkan sihir kepada manusia hingga mereka menyangka bahwasanya Sulaiman memakai sihir dan menggunakannya untuk mendapatkan kerajaan yang besar. Mereka adalah pendusta dalam hal itu karena Sulaiman tidak memakainya, karena Allah telah menyucikannya dalam firmanNya, “Padahal Sulaiman tidaklah kafir, ” yakni dengan mempelajari sihir karena dia tidak mempelajarinya, ” akan tetapi setan-setan itulah yang kafir (mengerjakan sihir) “ dalam hal itu, ” mereka mengajarkan sihir kepada manusia “ karena usaha penyesatan mereka dan semangat untuk menggoda anak Adam, begitupula kaum Yahudi juga mengikuti sihir yang diturunkan oleh dua malaikat yang berbeda di Babil, negeri Irak, dimana sihir diturunkan kepada mereka sebagai ujian dan cobaan dari Allah untuk hamba-hambaNya, lalu mereka berdua mengajarkan sihir kepada orang-orang, ”sedang keduanya tidak mengajarkan kepada siapapun hingga“ mereka berdua menasehatinya, dan “berkata, ’ sesugguhnya kami hanya cobaan bagimu, sebab itu janganlah kamu kafir’.“ maksudnya, janganlah kamu mempelajari sihir, karena sihir itu adalah kekufuran, mereka berdua melarangnya mempelajari sihir seraya mengabarkan tentang tingkatannya. Pengajaran setan akan sihir dalam bentuk pengaburan dan penyesatan lalu menisbatkan dan melariskannya kepada seseorang yang telah disucikan oleh Allah dari sihir, yaitu Nabi Sulaiman. Adapun pengajaran kedua malaikat itu adalah sebagai cobaan dengan adanya nasihat keduanya, agar tidak menjadi hujjah bagi mereka. Orang-orang Yahudi mengikuti sihir yang diajarkan oleh setan dan sihir yang diajarkan oleh kedua malaikat tersebut, kemudian mereka meninggalkan ilmu-ilmu dari para Nabi dan Rosul, dan menerima ilmu-ilmu setan, maka masing-masing orang akan cenderung kepada hal yang sesuai dengannya. Kemudian Allah menyebutkan tentang kemudaratan sihir seraya berfirman, ”maka mereka mempelajari kedua malaikat sihir yang membuat mereka dapat menceraikan antara seorang (suami) dengan istrinya” padahal cinta kasih kedua suami istri tidaklah dapat diukur dengan cinta kasih selain mereka. Karenanya Allah berfirman tentang hak keduanya : \"dan Allah menjadikan diantara kalian rasa cinta dan kasih sayang\" Dalam hal ini menunjukan bahwa sihir itu memiliki hakikat dan bahwa dia dapat memudaratkan atas ijin dari Allah dan atas kehendak Allah. Adapun izin itu ada dua macam : izin yang bersifat takdir (penciptaan) yaitu yang bersangkutan dengan kehendak Allah sebagaimana yang ada dalam ayat ini, dan ijin yang bersifat syariat sebagaimana firman-Nya dalam ayat yang lalu : \"maka sesungguhnya Dia telah menerunkannya kedalam hatimu dengan izin Allah\" Dalam ayat ini dan ayat-ayat yang semisalnya menjelaskan bahwa apapun sebabnya walaupun ia memiliki pengaruh yang sangat besar, ia tetap mengikuti qadha dan takdir dimana sebab-sebab tersebut tidak berdiri sendiri dalam pengaruhnya, dan tidak ada satupun dari kelompok-kelompok umat islam yang menentang dasar kerangka ini selain al-qadariyah dalam pembahasan perbuatan-perbuatan hamba, dimana mereka menyatakan bahwasanya perbuatan-perbuatan hamba itu terpisah dan tidak tunduk kepada kehendak, mereka mengeluarkannya dari takdir Allah dan mereka menyalahi Kitabullah dan Sunnah Rosululloh serta ijma’ para sahabat tabi’in. Kemudian Allah menyebutkan bahwa ilmu sihir itu murni berbahaya, tidak ada manfaatnya sedikitpun, baik secara agama maupun dunia, sebagaimana terdapat beberapa manfaat pada beberapa kemaksiatan seperti dalam firman Allah tentang khamar dan judi : \"katakanlah didalam keduanya terdapat dosa yang besar serta manfaat-manfaat bagi manusia, dan dosa keduanya lebih besar daripada manfaatnya\" Sihir itu murni berbahaya bahkan ia tidak memiliki factor penunjang sama sekali, dan hal-hal yang dilarang itu semuanya murni berbahaya atau mudaratnya lebih besar daripada manfaatnya, sebagaimana perkara-perkara yang diperintahkan itu juga murni bermanfaat atau manfaatnya lebih besar daripada mudaratnya. “Sungguh mereka telah meyakini,” yaitu orang-orang Yahudi, bahwa “barangsiapa yang menukarnya dengan sihir itu,” yaitu menyukai sihir sebagaimana pembeli menyukai suatu barang dagangan, “tiadalah baginya keuntungan di akhirat,” maksudnya tidak mendapat bagian, bahkan hal itu mengakibatkan hukuman, dan tidaklah perbuatan mereka itu atas dasar kebodohan, akan tetapi karena sangat menyukai kehidupan dunia daripada akhirat, maka sangat jeleklah “perbuatan mereka menjual dirinya dengan sihir, kalau mereka mengetahui, ” maksudnya mengetahui akan buah dari perbuatan yang telah mereka lakukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { لَمَثُوبَةٞ } Lamatsuubah : Pahala dan balasan. Makna ayat : Pada ayat 103 Allah Ta’ala membuka pintu taubatnya untuk orang-orang Yahudi, serta menawarkan keimanan dan ketakwaan dalam firmanNya (وَلَوۡ أَنَّهُمۡ ءَامَنُواْ وَٱتَّقَوۡاْ لَمَثُوبَةٞ مِّنۡ عِندِ ٱللَّهِ خَيۡرٞۚ لَّوۡ كَانُواْ يَعۡلَمُونَ ) “Sesungguhnya kalau mereka beriman dan bertakwa, (niscaya mereka akan mendapat pahala), dan sesungguhnya pahala dari sisi Allah adalah lebih baik, kalau mereka mengetahui.” Pelajaran dari ayat : • Ilmu yang belum jelas hanyalah persangkaan yang tidak berdasarkan keyakinan. Ilmu yang seperti ini tidak dapat merubah kejiwaan pemiliknya sehingga tidak dapat membawanya untuk melakukan kebaikan dan tidak bisa mengajaknya untuk meninggalkan keburukan. Berbeda dengan ilmu yang kokoh dalam jiwa, maka pemiliknya akan memiliki motivasi yang besar dan semangat untuk beriman dan bertakwa serta menjauhi kesyirikan dan maksiat. Hal ini terlihat jelas ketika Allah menafikan ilmu yang dimiliki oleh orang-orang Yahudi dalam ayat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 103: Kemudian Allah menjelaskan bahwasannya yahudi sekiranya beriman kepada nabi ﷺ , dan apa yang diturunkan dari Al-Qur’an dan mereka akan menjauhi apa yang padanya terdapat sihir dan kafir maka sungguh mereka akan mendapatkan manfaat – manfaat yang banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Lebih baik daripada sihir dan apa yang mereka cari. Yakni sekiranya mereka mengetahui pahala dan balasan yang diperoleh bagi mereka yang beriman dan bertakwa, tentu mereka tidak akan memilih sihir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 103",
    "description": "Dan jika mereka beriman dan bertakwa, takut kepada azab Allah, pahala dari Allah pasti lebih baik daripada sihir yang menyibukkan mereka, sekiranya mereka tahuwahai orang-orang yang beriman! janganlah kamu katakan, ra''ina', 2 yang berarti, peliharalah dan jagalah kami, kepada rasulullah karena kata itu akan dimanfaatkan oleh orang-orang yahudi untuk berolokolok yang menyerupai kata ra'unah, yang berarti bebal dan sangat bodoh, tetapi katakanlah, undhurna' (perhatikanlah kami), dalam mempelajari agama dan dengarkanlah serta taatilah perintah-perintah Allah kepadamu dan janganlah kamu menyerupai orang-orang yahudi yang berkata, kami mendengar dan kami ingkar. Dan orang-orang kafir dari kaum yahudi itu akan mendapat azab yang pedih akibat olokolok mereka kepada rasulullah."
  }
]