[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hai orang-orang yang beriman janganlah kalian mengatakan kepada Rasul Muhammad Sholallohu ‘alaihi wasallam kalimat \"رَاعِنَا\" yang bermakna \"perhatikanlah kami dengan pendengaranmu, Pahamilah kami dan pahamkanlah kami”, karena orang Yahudi biasa mengatakan itu kepada nabi Sallallahu Alaihi Wasallam dengan meliukkan lidah mereka mengucapkan itu dengan maksud mencaci beliau dan menempatkan beliau pada kata “ru’unah” yang berarti sangat bodoh. Dan katakanlah -wahai orang-orang yang beriman- sebagai penggantinya kalimat \"انْظُرْنَا\" yang bermakna “perhatikanlah kami” maksudnya, perhatikanlah kami dan berjanjilah pada kami. dan ini memenuhi makna yang diinginkan itu sendiri, dan dengarkanlah apa yang dibacakan kepada kalian dari kitab suci Tuhan kalian dan Pahamilah ia. Dan bagi orang-orang yang mengingkari akan mendapatkan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Allah -Ta'ālā- mengajarkan kepada orang-orang mukmin agar memilih kata-kata yang baik dalam berbicara. Allah berfirman, “Wahai orang-orang yang beriman, janganlah kamu mengucapkan kata-kata (Rā'inā) yang berarti “Perhatikanlah keadaan kami”. Karena orang-orang Yahudi mempelesetkan kata-kata itu dan menggunakannya untuk berbicara kepada Nabi -ṣallallāhu 'alaihi wa sallam- tetapi dengan maksud yang buruk, yaitu \"ru'ūnah (bodoh),\" maka Allah melarang penggunaan kata-kata itu demi menutup pintu tersebut. Dan Allah memerintahkan kepada hamba-hamba-Nya agar menggunakan kata-kata lain sebagai gantinya, yaitu kata-kata “Unẓurnā” yang berarti “Tunggulah, agar kami bisa mengerti apa yang engkau ucapkan”. Kata-kata ini memiliki makna yang sama dengan kata-kata sebelumnya tetapi tidak mengandung sesuatu yang terlarang. Dan orang-orang yang ingkar kepada Allah itu akan mendapatkan azab yang sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Allah melarang orang-orang beriman berkata kepada Nabi (راعنا) “perhatikanlah perkataanku”, dan Allah memerintahkan mereka untuk menggantinya dengan kalimat (انظرنا) “perhatikanlah kami”. Hal ini karena orang-orang Yahudi jika mengatakan (راعنا) maka yang mereka maksud adalah hinaan yang menjurus kepada sifat kedunguan. Sungguh bagi orang-orang yang mendustakan Allah dan rasul-Nya azab yang pedih. Al-Qasimy berkata: ayat ini serupa dengan firman Allah pada surat an-Nisa: 46: مِّنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَن مَّوَاضِعِهِ وَيَقُولُونَ سَمِعْنَا وَعَصَيْنَا وَاسْمَعْ غَيْرَ مُسْمَعٍ وَرَاعِنَا لَيًّا بِأَلْسِنَتِهِمْ وَطَعْنًا فِي الدِّينِ ۚ وَلَوْ أَنَّهُمْ قَالُوا سَمِعْنَا وَأَطَعْنَا وَاسْمَعْ وَانظُرْنَا لَكَانَ خَيْرًا لَّهُمْ وَأَقْوَمَ وَلَٰكِن لَّعَنَهُمُ اللَّهُ بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلً Yaitu orang-orang Yahudi, mereka mengubah perkataan dari tempat-tempatnya. Mereka berkata: “Kami mendengar”, tetapi kami tidak mau menurutinya. Dan (mereka mengatakan pula): “Dengarlah” sedang kamu sebenarnya tidak mendengar apa-apa. Dan (mereka mengatakan): “Raa’ina”, dengan memutar-mutar lidahnya dan mencela agama. Sekiranya mereka mengatakan: “Kami mendengar dan menurut, dan dengarlah, dan perhatikanlah kami”, tentulah itu lebih baik bagi mereka dan lebih tepat, akan tetapi Allah mengutuk mereka, karena kekafiran mereka. Mereka tidak beriman kecuali iman yang sangat tipis. (Mahasin al-ta’wil 2/216)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. رَاعِنَا (“Raa’ina” (perhatikan)) Kata ini dalam bahasa orang Yahudi termasuk kata-kata yang digunakan untuk menghina, sehingga ketika orang-orang Yahudi mendengar orang-orang beriman mengatakan kepada Rasulullah (raa’inaa) untuk meminta beliau memperhatikan mereka dan berlemahlembut dalam mendidik mereka, orang-orang Yahudi langsung mengambil kesempatan ini. Mereka mengatakan kata ini kepada nabi dengan menunjukkan bahwa yang mereka maksudkan adalah makna dari bahasa arab, padahal dalam hati mereka bermaksud untuk menghina Nabi dengan menggunakan kata ini dengan makna dari bahasa mereka. Sehingga Allah melarang orang-orang mukmin mengatakan kata ini agar memutus jalan orang-orang Yahudi (untuk menghina Nabi), dan mengganti kata itu dengan kata (undhurnaa) وَقُولُوا انْظُرْنَا (tetapi katakanlah: “Unzhurna) Yakni kemarilah dan lihatlah kesini. وَاسْمَعُوا ( dan “dengarlah”) Yakni taatilah Allah dan dengarlah syari’at-syari’at yang dikatakan Rasulullah pada kalian tanpa memintanya untuk memperhatikan. Kemudian Allah mengancam orang-orang Yahudi dengan kalimat: وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ(Dan bagi orang-orang yang kafir siksaan yang pedih))"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Alternatif syariat : { يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا وَقُولُوا انْظُرْنَا } \"Hai orang-orang yang beriman, janganlah kamu katakan (kepada Muhammad): \"Raa'ina\", tetapi katakanlah: \"Unzhurna\" , sebagaimana yang telah berlaku dalam syari'at bahwasanya Allah -عز وجل- dalam kitab-Nya jika melarang hamba-Nya dari suatu perkara; Dia kemudian menjelaskan perkara lain yang menjadi alternatif perkata tersebut; maka tidaklah semestinya bagi setiap orang ketika ia dalam ranah tarbiyah untuk orang lain dan ia melarang mereka dari suatu perkara, kecuali ia menyampaikan perkara yang lain diperbolehkan dalam syari'at. 2 ). Inilah panggilan pertama dalam Qur'an untuk orang beriman, dan ayat ini mengandung beberapa perkara, yaitu : - Hukum asal dari prilaku keseharian seseorang muslim dalam kehidupannya adalah : mengindar dari penyerupaan kepada orang-orang kafir, khususnya dengan kaum Yahudi. - Qoidah syar'iyah : \"sadd adz-dzari’ah\" : memotong jalan kerusakan (mafsadah) sebagai cara untuk menghindari kerusakan tersebut. - Adab yang mulia : dalam berbicara hendaknya memilih lafazh atau ungkapan yang lebih pantas dan sopan. - Metode pendidikan : Menghadirkan alternatif atau solusi untuk perkara yang dilarang dengan sebaik mungkin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai orang-orang yang beriman, jangan katakana kepada nabi Muhammad SAW “Raa’inaa: sudilah kiranya engkau perlihatkan kepada kami (perhatian), karena kalimat ini di kalangan Yahudi adalah sebuah hinaan, yang berakar dari rau’ah yang berarti sihir. Namun katakanlah undhurnaa : tolong engkau perlihatkanlah kepada kami sehingga kami dapat menerima dan memahami perkataanmu (nabi). Maka kemudian simaklah dengan pendengaran pasrah dan taat atas hokum Allah dan rasulullah SAW. Adapun orang-orang kafir yang menyakiti Nabi SAW maka pada hari kiamat akan ditimpakan kepada mereka adalah azab yang pedih. Sebab turunnya ayat: seagaimana yang disebutkan Ibnu Abbas bahwa kaum Yahudi menggunakan kata raa’inaa memang dimaksudkan kepada Nabi SAW. Namun Sa’ad ibn Mu’adz jeli terhadap itu, Sa’ad tahu kalu itu adalah hinaan bagi Nabi SAW maka tanpa fikir panjang Sa’ad seketika itu langsung membunuh orang yang berbicara kepada rasul itu. Lalu kaum Yahudi berkata: “Bukankah kalian juga mengucapkannya?” Sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kamu katakan, “Rā‘inā.”} jagalah dan awasilah kami. Kata ini adalah kutukan dalam bahasa orang-orang Yahudi {Akan tetapi, katakanlah, “Unẓurnā”} lihatlah dan jagalah kami sehingga kami paham tentangmu {dan dengarkanlah. Bagi orang-orang kafir itu azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Kaum Muslimin berkata di tengah perbincangan mereka bersama Rosul saat mereka belajar perkara-perkara agama mereka, ”Perhatikanlah kami,” maksudnya perhatikan kondisi kami, dan mereka bermaksud baik, sedangkan orang-orang yahudi juga mengatakan seperti itu namun dengan maksud jelek, mereka memanfaatkan kesempatan tersebut dengan mengatakan hal itu kepada Rosululloh dengan maksud yang jelek, maka Allah melarang orang-orang beriman mengucapkan kalimat itu untuk mencegah masalah tersebut. Ayat ini menunjukkan larangan tentang suatu perkara yang (pada dasarnya) boleh tetapi bisa menjadi jalan menuju kepada hal yang haram. Juga menunjukkan akhlak dan pemakaian kalimat yang tidak bermakna kecuali hanya yang baik dan tidak keji serta meninggalkan kalimat-kalimat yang jelek, atau yang mengandung makna mengganggu atau perkara yang tidak patut, maka Allah memerintahkan mereka kepada kalimat-kalimat yang tidak bermaksud kecuali hanya yang baik saja. Allah berfirman, “Namun katakanlah, ’Lihatlah kami’.” Dengan kalimat ini cukup mewakili maksudnya yang dikehendaki tanpa ada sedikitpun masalah, ”dan dengarlah,” Allah tidak menyebutkan hal yang didengar agar menjadi lebih umum kepada sgala perkara yang diperintahkan untuk didengar, maka hal itu mencakup perintah mendengar al-Qur’an dan mendengar sunnah yang merupakan hikmah secara lafazh maupun makna dan sebagai respon. Ayat ini juga menunjukkan adab dan ketaatan, kemudian allah mengancam orang-orang kafir dengan azab yang pedih lagi menyakitkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { رَٰعِنَا } Raa’inaa : Tunggu kami dahulu dan lihat kami sampai kami memahami perkataanmu. { ٱنظُرۡنَا } Unzhurnaa : Tunggu kami dahulu sampai kami memahami dan menghafal perkataanmu. { الكافرين } al-Kaafiriin : Orang-orang yang menentang dan mendustakan Allah dan RasulNya serta mengolok-olok Allah, RasulNya, atau keduanya. { أَلِيمٞ } Aliim : Sangat pedih dan menyakitkan Makna ayat : Pada ayat (104) Allah Ta’ala memerintahkan kepada orang-orang mukmin untuk memperhatikan adab ketika berbicara kepada Nabi Muhammad ﷺ, dengan menghindari kata yang tidak jelas maknanya seperti “Raa’inaa” karena bisa jadi itu berasal dari kata “Ru’uunah” yang artinya bodoh, atau dari kata Raa’i yang artinya perhatikan kami. Dan sighat Mufaa’alah menunjukkan seakan mereka mengatakan “Perhatikan kami, maka kami akan memperhatikanmu.” Hal ini tentu sangat tidak layak untuk diucapkan kepada Rasulullah ﷺ. Lantas Allah Ta’ala mengajarkan kalimat yang baik dan bagus maknanya, mengandung kesopanan kepada nabi yaitu kata “Unzhurnaa”. Allah Ta’ala memerintahkan orang-orang mukmin untuk mendengarkan Nabi ketika sedang berbicara dengan mereka, agar tidak perlu menanyakannya lagi nanti. Disebabkan mengolok-olok Rasul dan mengejeknya, atau berbicara kepadanya dengan nada mengejek dan meremehkan kedudukan dan kehormatannya, termasuk dalam kekufuran yang amat nyata. Pelajaran dari ayat : • Kewajiban menjaga adab dan kesopanan kepada Rasulullah ﷺ ketika berbicara dengan beliau, tanpa menggunakan diksi yang dapat disalah artikan sebagai bentuk merendahkan dan tidak menghormati beliau. • Kewajiban untuk mendengarkan kata-kata Rasulullah ﷺ dengan melaksanakan perintahnya dan menjauhi larangannya. Juga menjaga kesopanan ketika berbicara orang yang Allah beri kehormatan untuk bersahabat dan hidup bersama beliau ﷺ."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 104: Kemudian Allah memerintahkan hambanya yang beriman untuk mengikuti adab dalam memanggil rasul ﷺ dengan menjauhkan kata – kata yang memiliki banyak makna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Raa 'ina berarti: sudikah kiranya kamu memperhatikan kami. di saat Para sahabat mengucapkan kata-kata ini kepada Rasulullah, orang Yahudi pun memakai kata ini dengan digumam seakan-akan menyebut Raa'ina Padahal yang mereka katakan ialah Ru'uunah yang berarti kebodohan yang sangat, sebagai ejekan kepada Rasulullah. Itulah sebabnya Allah menyuruh supaya para sahabat mengganti perkataan Raa'ina dengan Unzhurna yang juga sama artinya dengan Raa'ina. Maksudnya: Dengarkanlah apa yang dibacakan kepadamu dari firman Tuhanmu serta pahamilah. Termasuk juga mendengarkan Al Qur'an, mendengarkan As Sunnah yang di dalamnya berisi hikmah, karena tidak disebutkan secara khusus di sana apa yang mesti didengar. Ada beberapa faedah yang dapat diambil dari ayat ini, di antaranya: - Perkara mubah bisa menjadi terlarang jika menjadi wasilah/sarana kepada yang haram. - Hendaknya seseorang memiliki adab yang baik dan ketika berbicara menggunakan lafaz-lafaz yang tidak mengandung kemungkinan buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 104",
    "description": "Wahai orang-orang yang beriman! janganlah kamu katakan, ra''ina', 2 yang berarti, peliharalah dan jagalah kami, kepada rasulullah karena kata itu akan dimanfaatkan oleh orang-orang yahudi untuk berolokolok yang menyerupai kata ra'unah, yang berarti bebal dan sangat bodoh, tetapi katakanlah, undhurna' (perhatikanlah kami), dalam mempelajari agama dan dengarkanlah serta taatilah perintah-perintah Allah kepadamu dan janganlah kamu menyerupai orang-orang yahudi yang berkata, kami mendengar dan kami ingkar. Dan orang-orang kafir dari kaum yahudi itu akan mendapat azab yang pedih akibat olokolok mereka kepada rasulullah. Orang-orang yang kafir dari ahli kitab, yahudi dan nasrani, dan orang-orang musyrik tidak menginginkan diturunkannya kepadamu suatu kebaikan, salah satunya Al-Qur'an sebagai kebaikan yang paling tinggi dari tuhanmu, karena kedengkian dan rasa iri dalam diri mereka. Tetapi secara khusus Allah memberikan rahmat-Nya, berupa kenabian, wahyu, kenikmatan, dan kebaji kan kepada orang yang dia kehendaki dari hamba-hamba-Nya, misalnya kepada nabi mu hammad. Dan Allah pemilik karunia, nikmat, dan kebajikan yang besar."
  }
]