[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah akan menyukai Orang-orang kafir dari ahli kitab dan kaum musyrikin jika Allah menurunkan kepada kalian sekecil kebaikan pun dari Tuhan kalian dalam bentuk Alquran atau ilmu atau kemenangan atau kabar gembira. Dan Allah menentukan siapa yang dikehendaki-nya dari hamba-hambanya untuk memperoleh Rahmat nya dengan bentuk kenabian dan kerasulan. Dan Allah mempunyai kebaikan dan pemberian yang melimpah lagi luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Orang-orang kafir siapapun mereka, baik ahli kitab maupun orang-orang musyrik, tidak ingin jika Allah memberikan kebaikan dalam bentuk apapun kepadamu, baik sedikit maupun banyak. Sedangkan Allah memberikan rahmat-Nya berupa kenabian, wahyu dan iman kepada orang-orang yang dikehendaki-Nya. Allah adalah Pemilik anugerah yang besar, maka tidak ada satupun kebaikan yang diterima oleh makhluk kecuali berasal dari-Nya. Salah satu anugerah terbesar-Nya ialah mengutus Rasul dan menurunkan kitab suci."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Hai orang-orang beriman, tidaklah suka orang-orang kafir dari kalangan ahli kitab dan orang-orang musyrik jika Allah menurunkan suatu kebaikan kepada kalian. Padahal Allah mengaruniakan kenabian dan hidayah kepada hamba-Nya yang Dia kehendaki, Dialah Yang Maha Pemberi tanpa ada batas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. مَا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ Orang-orang kafir dari Ahli Kitab dan orang-orang musyrik tiada menginginkan) Yakni disebabkan besarnya rasa permusuhan mereka. أَنْ يُنَزَّلَ عَلَيْكُمْ مِنْ خَيْرٍ مِنْ رَبِّكُمْ ۗ (diturunkannya sesuatu kebaikan kepadamu dari Tuhanmu) Yakni kebaikan apapun, baik itu wahyu atau yang lain. وَاللَّهُ يَخْتَصُّ بِرَحْمَتِهِ مَنْ يَشَاءُ ۚ (Dan Allah menentukan siapa yang dikehendaki-Nya (untuk diberi) rahmat-Nya (kenabian)) Ada yang berpendapat, rahmat yakni berupa kenabian. Dan pendapat lain mengatakan: rahmat secara umum. وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (dan Allah mempunyai karunia yang besar) Yakni pemilik karunia yang besar. Namun bagaimana bisa orang-orang Yahudi tidak menginginkan Allah menentukan siapa yang dikehendaki-Nya (untuk diberi) rahmat-Nya?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam ayat tidak dikatakan ( ما يود أهل الكتاب ) \"Para ahli kitab tidak menginginkan\" , karena didalamnya ada peringatan bahwasanya mereka telah berbuat kafir terhadap kitab mereka sendiri, karena jika mereka beriman kepada kitab-kitab mereka maka mereka pasti membenarkan kenabian Muhammad yang diperintah oleh kitab-kitab mereka dan mengikutinya. 2 ). Bahkan kebaikan yang datangnya dari tuhan saja mereka tidak kehendaki, maka bagaimana mungkin mereka menghendaki kebaikan yang didatangkan dari golongan mereka ?! tetapi Allah lebih mengetahui apa yang terbesit dalam hati mereka : { إِنَّهَا لَا تَعْمَى الْأَبْصَارُ وَلَٰكِنْ تَعْمَى الْقُلُوبُ الَّتِي فِي الصُّدُورِ } \"Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada\" [ Al-Hajj : 46 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang kafir dari golongan ahli kitab (Yahudi) tidak menginginkan jika Allah menurunkan kebaikan - berupa wahyu turunnya Alquran – kepada kaum muslim. Sebab mereka sangat membenci kaum muslim. Namun Allah Maha Berkehendak kepada siapapun yang Allah kehendaki untuk dianugerahi gelar kenabian maupun hidayah. Allah-lah pemilik segala keagungan yang tidak terbatas. Sebab turunnya ayat: Ketika kaum muslimin berkata kepada sekutu dari golongan Yahudi bahwa mereka percaya kepada kenabian Muhammad SAW lantas kaum Yahudi menjawab: “Apakah kalian bermaksud mengajak kami mengikuti kenabian Muhammad? Sungguh kalaupun kami mengikutinya kami tidak akan mendapat kebaikan apapun, kecuali jika kami (Yahudi) menyukainya barulah ada kebaikan.” Maka Allah menurunkan dusta kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir dari golongan Ahli kitab dan orang-orang musyrik tidak menginginkan diturunkannya kepadamu suatu kebaikan dari Tuhanmu. Tapi Allah mengkhususkan} mengutamakan {rahmatNya kepada orang yang Dia kehendaki. Allah itu pemilik karunia yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Dan Allah mengabarkan tentang permusuhan orang-orang Yahudi dan orang-orang Musyrik terhadap orang-orang beriman yaitu bahwasanya mereka tidaklah menginginkan, “diturunkannya suatu kebaikan kepadamu” maksudnya tidak menginginkan kamu (kaum Muslimin) mendapat kebaikan, baik sedikit ataupun banyak “dari Tuhanmu, ” karena kedengkian dan kebencian mereka kepada kamu, karena Allah memberikan keistimewaan kepada kalian dari karuniaNya, oleh karena “Allah mempunyai karunia yang besar, ” dan diantara karuniaNya atas kalian adalah menurunkan kitab kepada Rosul kalian untuk menyucikan kalian, mengajarkan kalian kitab dan hikmah tersebut, dan mengajarkan kalian apa yang belum kalian ketahui, maka segala pujian dan pengagungan hanya bagiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مِنۡ أَهۡلِ ٱلۡكِتَٰبِ وَلَا ٱلۡمُشۡرِكِينَ } Min ahlil kitaabi wa laal musyrikiin : Orang-orang Yahudi, Nasrani, atapun para penyembah berhala dari kalangan bangsa Arab dan selainnya. { مِّنۡ خَيۡرٖ مِّن رَّبِّكُمۡۚ } Min khairin min rabbikum : Wahyu dari Allah yang berisikan tasyri’ (syariat dan hukum) yang mencakup setiap jenis hidayah serta jalan menuju kebahagiaan, serta kesempurnaan hidup di dunia dan akhirat. { ٱلۡفَضۡلِ } al-Fadhl : Kebaikan dan kelebihan yang tidak dibutuhkan oleh pemiliknya. Dan Allah Ta’ala Dialah pemilik keutamaan, karena semua hal yang diberikan kepada hamba-hambaNya berupa kebaikan dan kenikmatan tidak dibutuhkan olehNya sama sekali. Makna ayat : Pada ayat (105) Allah Ta’ala mengabarkan kepada hamba-hambaNya yang mukmin bahwa orang-orang kafir dari kalangan ahli kitab maupun penyembah berhala tidak menyukai diturunkannya wahyu dari Allah Ta’ala. Baik itu berupa al-Qur’an yang berisikan ajaran akhlak yang mulia, berbagai syariat yang mengarahkan kepda jalan-jalan kebahagiaan dan kesempurnaan hidup, atau selain al-Qur’an berupa berbagai macam kebaikan. Hal itu dikarenakan hasad mereka kepada kaum mukmin, sebagaimana Allah memberitahukan mereka bahwa Allah mengkhususkan rahmatNya kepada siapa saja hamba-hambaNya yang dikehendaki. Oleh karena itu, dengki dan iri hati dari orang-orang kafir itu tidak menghalangi ntuk mendapatkan keutamaan dan rahmat dari Allah, kapan saja Dia menghendaki. Pelajaran dari ayat : • Peringatan agar waspada terhadap orang-orang kafir dari kalangan Ahli kitab atau orang-orang musyrik, karena mereka adalah musuh yang dengki terhadap orang-orang mukmin. Maka tidak halal bagi seorang muslim untuk merendahkan diri dan merasa tenang dengan ucapan dan perbuatan mereka, sebab mereka tidak pernah berhenti melakukan tipu daya kepada kaum muslimin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 105: Allah mengabarkan bahwasannya orang – orang yahudi dan nasrani serta orang – orang musryik arab tidak menginginkan Allah menurunkan kepada rasul-Nya dan kepada orang – orang yang beriman dekatnya kebenaran dari Al-Qur’an , Ilmu, pertolongan dan berita gembira; karena mereka hasad dan marah kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik wahyu (Al Qur'an), ilmu pengetahuan, pertolongan maupun berita gembira."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 105",
    "description": "Orang-orang yang kafir dari ahli kitab, yahudi dan nasrani, dan orang-orang musyrik tidak menginginkan diturunkannya kepadamu suatu kebaikan, salah satunya Al-Qur'an sebagai kebaikan yang paling tinggi dari tuhanmu, karena kedengkian dan rasa iri dalam diri mereka. Tetapi secara khusus Allah memberikan rahmat-Nya, berupa kenabian, wahyu, kenikmatan, dan kebaji kan kepada orang yang dia kehendaki dari hamba-hamba-Nya, misalnya kepada nabi mu hammad. Dan Allah pemilik karunia, nikmat, dan kebajikan yang besar. Kaum musyrik berkata, tidakkah kalian perhatikan Muhammad' ia menyuruh para sahabatnya melakukan sesuatu, kemudian ia menyuruh mereka melaku kan sebaliknya. Hari ini ia mengatakan satu hal, besok ia mengatakan hal yang berbeda. Al-qur'an itu pastilah karangan Muhammad. Ia mengatakan sesua tu yang bersumber dari dirinya sendiri, yang satu sama lain saling bertentangan. Menjawab celaan mereka ini, Allah mengatakan bahwa ayat yang kami batalkan atau kami hilangkan dari ingatan-Mu, wahai Muhammad dan orang beriman, pasti kami ganti dengan yang lebih baik, lebih bermanfaat bagimu dengan mengangkat kesulitan darimu atau dengan menambahkan pahala bagimu, atau yang sebanding dengannya. Tidakkah kamu tahu, wahai Muhammad, bahwa Allah mahakuasa atas segala sesuatu dengan mendatang kan segala kebaikan dan kebajikan bagi manusia'"
  }
]