[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang kami ganti dari ayat-ayat dan kami hapus dari hati dan pikiran manusia niscaya Kami mendatangkan sesuatu yang lebih bermanfaat dari ini bagi kalian, atau Kami mendatangkan sesuatu yang serupa dengannya dari segi tingkat kesulitan sebagian beban syariat dan pahala, dan masing-masing ada hikmah di dalamnya. Tidakkah kamu -wahai nabi- dan umatmu mengetahui bahwasanya Allah Maha Kuasa tidak ada sesuatupun yang melemahkan Nya?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Allah -Ta'ālā- menjelaskan bahwa ketika mencabut hukum yang tercantum di dalam ayat Al-Qur`ān atau mencabut lafalnya sehingga dilupakan oleh manusia, maka Allah -Subḥānahu- mendatangkan hukum atau ayat yang lebih bermanfaat di dunia dan di akhirat, atau yang setara dengannya. Hal itu dilakukan dengan pengetahuan dan kebijaksanaan Allah. Dan engkau -wahai Nabi -ṣallallāhu 'alaihi wa sallam- mengetahui bahwa Allah Mahakuasa atas segala sesuatu. Maka Dia dapat melakukan apa saja yang Dia kehendaki dan memutuskan apa saja yang Dia inginkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Hai Rasulullah, tidaklah Kami mengganti hukum suatu ayat atau menghapusnya dari hatimu melainkan Kami akan menurunkan kepadamu yang lebih baik atau yang setara dengannya. Tidakkah kamu dan umatmu mengetahui bahwa Allah berkuasa atas segala sesuatu, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. مَا نَنْسَخْ مِنْ آيَةٍ (Ayat mana saja yang Kami nasakhkan) Nasakh berarti membatalkan atau menghilangkan. dan segala yang dihadirkan setelah sesuatu berarti telah sesuatu itu telah dinasakhkan; misal: matahari telah menasakhkan bayangan, dan uban telah menasakh masa muda. Dan dalam ayat ini maksudnya adalah Allah mengubah hukum sesuatu yang hahal memjadi haram, yang haram menjadi halal, yang boleh menjadi terlarang dan yang terlarang menjadi dibolehkan. Dan nasakh tidak ada kecuali pada (ayat yang terdapat hukum) seperti haram atau mubah; adapun pada kabar-kabar (cerita kaum terdahulu) tidak terdapat nasakh dan Mansukh. Dan kata nasakh berasal dari kalimat Naskhil Kitab yakni menyalin kitab ke kitab yang lain. Demikian pula makna nasakh suatu hukum berarti menyalin hukum ke hukum lain, baik itu yang dinasakh adalah hukum pada suatu ayat maupun tulisannya. Ulama telah sepakat baik ulama terdulu atau yang sekarang akan adanya nasakh dalam al-Qur’an, dan tidak ada yang menyelisihi hal ini, kecuali beberapa orang yang pendapatnya tidak diperhitungkan. Dan telah banyak diketahui dari orang-orang Yahudi dalam hal keingkaran mereka terhadap masalah nasakh yang dengan itu mereka bisa mengingkari kenabian Rasulullah. Mereka berkata: “karena Muhammad Shallallahu ‘Alaihi Wasallammenasakh apa yang ada di taurat berarti dia bukanlah nabi”. Dan dalil ini terbantahkan dengan adanya masalah nasakh di taurat bahwa Nabi adam menikahkan anak mereka padahal mereka adalah saudara sedarah kemudian Allah mengharamkannya atas Nabi Musa dan kaumnya. أَوْ نُنْسِهَا(atau Kami jadikan (manusia) lupa kepadanya) Yakni menjadikan kalian merlupakannya agar kalian tidak membacanya atau mengingatnya. نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا (Kami datangkan yang lebih baik daripadanya atau yang sebanding dengannya) Yakni kami datangkan dengan yang lebih bermanfaat bagi manusia baik dalam jangka pendek maupun jangka panjang, atau dengan sesuatu yang sepadan tanpa ada tambahan.namun bisa jadi nasikh (hukum pengganti) lebih ringan sehingga menfaatnya lebih terasa dalam jangka pendek, atau lebih berat agar pahala yang didapatkan lebih besar sehingga lebih bermanfaat dalam jangka panjang. أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ (Tidakkah kamu mengetahui bahwa sesungguhnya Allah Maha Kuasa atas segala sesuatu?) Yakni nasakh adalah bagian dari kekuasaan Allah"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika Allah menghalangi hamba-hamba Nya yang beriman dari sesuatu yang keingininan mereka berkaitan dengan-Nya, Dia akan membukakan bagi mereka pintu lain yang lebih bermanfaat dan lebih mudah dan lebih patut, seperti yang tertulis dalam ayat berikut : { مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا ۗ أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ } \"Ayat mana saja yang Kami nasakhkan, atau Kami jadikan (manusia) lupa kepadanya, Kami datangkan yang lebih baik daripadanya atau yang sebanding dengannya. Tidakkah kamu mengetahui bahwa sesungguhnya Allah Maha Kuasa atas segala sesuatu?\" , dan : { وَإِنْ يَتَفَرَّقَا يُغْنِ اللَّهُ كُلًّا مِنْ سَعَتِهِ ۚ وَكَانَ اللَّهُ وَاسِعًا حَكِيمًا } \"Jika keduanya bercerai, maka Allah akan memberi kecukupan kepada masing-masingnya dari limpahan karunia-Nya. Dan adalah Allah Maha Luas (karunia-Nya) lagi Maha Bijaksana\" [ an-Nisa : 130 ] , dan banyak lagi ayat yang berkaitan dengan penjelasan diatas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ayat yang Kami (Allah) ganti atau Kami rubah, atau juga Kami hapus dari ingatan sehingga lupa dan tak terbaca lagi cepat atau lambat pasti Kami ganti dengan ayat yang lebih baik dan lebih bermanfaat. Jika tidak begitu akan Kami ganti dengan ayat yang sama namun lebih bermanfaat. Ayat yang baru, mungkin bisa lebih ringan atau juga lebih berat namun pasti mempunyai fadhilah/keutamaan yang lebih besar. Wahai nabi, apakah engkau tidak tahu bahwa Allah Maha Kuasa atas segala sesuatu, seperti untuk mengganti/menghapus suatu hukum untuk memberikan manfaat lebih kepada hamba-Nya? Sebab turunnya ayat: Ketika orang-orang musyrik mendengar tentang adanya ayat yang diganti/dihapus mereka berkata: “Alquran hanyalah perkataan Muhammad saja, dia hanya mengatakan menurut dirinya saja, isi Alquran hanyalah saling bertentangan satu sama lain.” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ayat yang Kami nasakh} hukum atau lafadz yang Kami angkat dari suatu ayat {atau Kami jadikan lupa padanya} kami hapus itu dari hatimu {pasti Kami ganti dengan yang lebih baik darinya atau yang sebanding dengannya. Apakah kamu tidak mengetahui bahwa Allah Maha Kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Nasakh bermakna memindahkan, maka hakikat dari nasakh itu adalah memindahkan seorang mukallaf dari suatu hukum syariat kepada hukum syariat yang lain atau bahkan digugurkan. Hukum nasakh ini diingkari oleh orang-orang Yahudi bahkan mereka mengira bahwa hal itu tidak boleh, padahal telah disebutkan dalam kitab mereka Taurat. Oleh karena itu, pengingkaran mereka terhadapnya merupakan kekufuran dan hawa nafsu belaka, dan Allah mengabarkan tentang hikmahNya dalam nasakh tersebut dan bahwasanya tidaklah dinasakh, “ayat mana saja, atau Kami jadikan (manusia) lupa kepadanya,” maksudnya Kami jadikan manusia melupakannya dan Kami menghilangkannya dari hati mereka, “Kami datangkan yang lebih baik darinya” dan lebih berguna bagi kalian, “atau sebanding dengannya.” Maka ayat ini menunjukkan bahwa yang menasakh tidak akan menjadi maslahat yang lebih kecil daripada yang dinasakh, karena karunia Allah itu selalu bertambah, khususnya terhadap umat ini yang telah Dia mudahkan urusan agamanya dengan semudah-mudahnya, dan Dia mengabarkan bahwa siapa yang menghina nasakh, maka sesungguhnya dia telah menghina kerajaan dan kuasaNya. Allah berfirman, “Tidakkah kamu mengetahui bahwa Allah Mahakuasa atas segala sesuatu?”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { نَنسَخۡ } Nansakh : Kami ganti atau kami hilangkan { مِنۡ ءَايَةٍ } Min aayaat : Dari ayat-ayat al-Qur’an, yaitu sejumlah kata yang mengandung makna kebenaran seperti pengharaman atau penghalalan atau pembolehan. { نُنسِهَا } Nunsihaa : Kami hapuskan dari dalam hati Nabi ﷺ Makna ayat : Allah Ta’ala membantah orang-orang yang mencela aturan syariatnya yang bijaksana, yaitu mereka mengatakan bahwa Nabi Muhammad menyuruh para sahabatnya melakukan sesuatu pada hari ini dan besok melarang mereka melakukannya. Sesungguhnya Allah Ta’ala menghapus (nasakh) suatu ayat yang mengandung hukum yang memberatkan kaum Muslimin kepada hukum yang lebih ringan, seperti menghapus ketetapan untuk menghadapi sepuluh orang kafir menjadi ketetapan menghadapi dua orang kafir saja. Juga Allah menhapus hukum yang ringan dan merubahnya kepada hukum yang berat dengan tambahan pahala, seperti menghapus kewjiban puasa Asyura’ menjadi kewajiban puasa Ramadhan selama satu bulan penuh. Begitu juga Allah menghapus hukum yang ringan kepada hukum ringan yang semisalnya seperti menghapus arah kiblat dari Baitul Maqdis menuju Kab’ah. Atau Allah menghapus suatu ketentuan hukum tanpa ada ketentuan hukum lainnya, sebagaimana Allah menghapus ketentuan sedekah bagi orang yang bermunajat (mengajak bicara secara rahasia) dengan Rasulullah. Hukum itu dihapus dan tidak ada ketentuan hukum penggantinya. Bisa juga dengan menghapus ayatnya dari al-Qur’an akan tetapi ketentuan hukumnya masih berlaku, seperti hukum rajam bagi pria dan wanita yang sudah menikah berzina,”Seorang laki-laki tua (pernah beristri) dan seorang wanita tua (pernah bersuami), apabila mereka berdua berzina maka rajamlah keduanya secara tegas, sebagai hukuman dari Allah.” Ayat ini telah dinasakh oleh Allah bacaanya namun hukumnya tetap. Bisa juga dengan menghapus bacaan ayat dan ketentuan hukumnya. Ini makna firman Allah “atau kami jadikan manusia lupa kepadanya” sebagaimana dalam bacaan Imam Nafi’. Ada riwayat yang menyatakan bahwa telah turun suatu ayat dan telah dibaca oleh Rasulullah ﷺ dan beberapa sahabatnya, kemudian Allah menasakh lafadz dan maknanya, maka Allah menghapusnya dari dalam ingatan sehingga tidak ada seorangpun yang mampu mengingatnya. Inilah bentuk kekuasaan Allah Ta’ala yang ditunjukkan dalam firmanNya (أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ) “Tidakkah kamu mengetahui bahwa Allah Ta’ala Maha Kuasa atas segala sesuatu.” Pelajaran dari ayat : • Ketetapan adanya nasakh dalam al-Qur’anul kariim, sebagaimana terdapat dalam sunnah. Yang mana keduanya adalah sumber bagi syariat, dan tidak ada nasakh dalam qiyas maupun ijmak. • Kasih sayang Allah kepada orang-orang mukmin dengan menghapus (nasakh)) hukum dan menggantinya dengan hal yang lebih bermanfaat bagi mereka baik untuk dunia maupun akhiratnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 106: Allah mengabarkan bahwasannya tidaklah digantikan dari ayat – ayat hukum kepada hukum yang lain kecuali akan datang besarnya keutamaan dan manfaatnya darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sebanding dalam hal beban perintah dan pahala. Masing-masing ada hikmahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 106",
    "description": "Kaum musyrik berkata, tidakkah kalian perhatikan Muhammad' ia menyuruh para sahabatnya melakukan sesuatu, kemudian ia menyuruh mereka melaku kan sebaliknya. Hari ini ia mengatakan satu hal, besok ia mengatakan hal yang berbeda. Al-qur'an itu pastilah karangan Muhammad. Ia mengatakan sesua tu yang bersumber dari dirinya sendiri, yang satu sama lain saling bertentangan. Menjawab celaan mereka ini, Allah mengatakan bahwa ayat yang kami batalkan atau kami hilangkan dari ingatan-Mu, wahai Muhammad dan orang beriman, pasti kami ganti dengan yang lebih baik, lebih bermanfaat bagimu dengan mengangkat kesulitan darimu atau dengan menambahkan pahala bagimu, atau yang sebanding dengannya. Tidakkah kamu tahu, wahai Muhammad, bahwa Allah mahakuasa atas segala sesuatu dengan mendatang kan segala kebaikan dan kebajikan bagi manusia' tidakkah kamu tahu, wahai Muhammad, bahwa Allah memiliki kerajaan langit dan bumi yang menguasai dan bertindak untuk makhluknya, memutuskan hukum, dan memerintah sesuai kehendak-Nya' dan tidak ada bagimu, wahai orang-orang kafir, pelindung yang dapat melindungi urusanmu dan penolong yang dapat menolongmu selain Allah. Menurut ibnu abbas, ayat ini turun terkait abdullah bin ubay dan kawan-kawannya yang meminta rasulullah untuk mengubah bukit safa menjadi emas, meluaskan tanah mekah, dan memancarkan air dari tanah. Mereka menyatakan bahwa jika nabi berhasil mengabulkan permintaan-per mintaan itu, maka mereka akan beriman kepada beliau."
  }
]