[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu dan umatku mengetahui -wahai nabi- bahwa sesungguhnya Allah ta'ala Dialah zat yang maha memiliki, maha mengendalikan urusan di langit dan di bumi? Dia berbuat apa saja yang dikehendaki-Nya, menetapkan hukum yang Dia kehendaki dan Dia memerintahkan hamba-hamba Nya dan melarang mereka sebagaimana yang Dia kehendaki. sedang kewajiban mereka adalah taat dan menerima. Dan hendaklah orang yang bermaksiat mengetahui bahwa tidak ada seorangpun pembela yang mengurus mereka selain Allah dan tidak ada seorang penolong yang mencegah mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Engkau wahai Nabi telah mengetahui bahwa Allah adalah Pemilik langit dan bumi. Dia memutuskan apa saja yang Dia inginkan. Maka Dia memerintahkan apa saja dan melarang apa saja kepada hamba-hamba-Nya. Dia juga yang menetapkan dan menghapus apa saja dari syariat agama-Nya. Kalian tidak mempunyai pengurus selain Allah yang dapat mengurus urusan kalian dan tidak mempunyai penolong selain Dia yang dapat melindungi kalian dari marabahaya. Allah lah Yang Maha Mengurus dan Mahakuasa atas semuanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Tidakkah kamu dan umatmu mengetahui bahwa Allahlah yang mengatur segala urusan makhluk-Nya yang ada di langit yang tujuh dan di bumi yang tujuh, dan kalian tidak memiliki pelindung selain Dia yang mengatur urusan kalian, dan tidak ada yang mampu menyelamatkan kalian dari azab Allah selain-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ (kerajaan langit dan bumi adalah kepunyaan Allah) Yakni Allah-lah yang mengatur keduanya dengan penciptaan dan pelaksanaan perintah sehingga Dia lebih mengetahui kemaslahatan bagi hamba-Nya, yang mana kemaslahatan itu kadang berbeda-beda sesuai dengan zamannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Nabi, apakah engkau tidak tahu bahwa Allah adalah penguasa langit dan bumi. Allah-lah penguasa terhadap apapun yang ada di langit dan bumi, Allah berkuasa untuk mengadakan atau tidak mengadakan apapun. Allah juga berkuasa untuk menentukan apa yang terbaik untuk kemaslahatan hamba-Nya. Ketahuilah wahai manusia, bahwa tidak akan ada yang bisa mengurus urusanmu dan menolongmu dari musuh-musuhmu kecuali Allah. Ayat ini turun ketika suku Qurays berkata: “Wahai Muhammad, jadikan bukit Shafa itu gunung emas untuk kami, luaskanlah tanah Makkah ini, dan buatlah sungai-sungai di sini meluap, dengan begitu kamu akan mau mepercayaimu. Sehingga Allah menurunkan ayat ini. Para ahli tafsir berkata: “Sebab utama turunnya ayat ini adalah sebagai jawaban atas orang-orang Yahudi dan orang-orang musyrik yang menuntut permintan tersebut kepada Nabi Muhammad SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak mengetahui bahwa Allah memiliki kerajaan langit dan bumi? (Ketahuilah bahwa) tidak ada bagimu selain Allah seorang pelindung} pengawal yang mengawasi urusan-urusan kalian {dan penolong}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. “Tidakkah kamu mengetahui bahwa kerajaan langit dan bumi adalah kepunyaan Allah?” apabila Dia adalah raja kalian yang memerintah kalian sebagai perintah Raja Yang Pemurah lagi pengasih dalam ketetapan-ketetapanNya, perintah-perintahNya, larangan-laranganNya, sebagaimana tidak ada halangan bagiNya dalam menakdirkan sesuatu yang ditakdirkanNya, maka tidak ada pula yang menghalangiNya dalam segala yang ditetapkanNya tentang hukum-hukum syariat bagi hamba-hambaNya. Maka seorang hamba telah diatur dan disiapkan untuk tunduk dibawah perintah-perintah Tuhannya, baik agama maupun hal-hal yang telah ditentukan, maka kenapa dia menolak? Allah juga pelindung bagi hambaNya dan penolong bagi mereka, Dia menjadi Pelindung mereka dalam memperoleh hal-hal yang berguna bagi mereka, menolong mereka dalam menjauhkan mereka dari hal-hal yang mudarat, maka di antara perlindungan Allah terhadap mereka adalah Dia mensyariatkan bagi mereka hukum –hukum yang didasarkan oleh hikmah dan kasih sayangNya kepada mereka. Barangsiapa yang memperhatikan nasakh yang terjadi dalam al-Qur’an dan as-sunnah, niscaya dia akan mengetahui hikmah-hikmah Allah, kasih sayangNya terhadap hamba-hambaNya, dan membawa mereka kepada kemaslahatan tanpa mereka sadari akan kemurahanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {أَلَمۡ تَعۡلَمۡ } Alam ta’lam : Tidakkah kamu mengetahui. Kalimat tanya ini untuk penetapan. {وَلِيّٖ } Waliyy : Seorang penjaga yang akan menjaga kalian dengan mengurus urusan kalian. { نَصِيرٍ } Nashiir : Seorang penolong yang akan mencegah keburukan menimpamu. Makna ayat : Sebagai bentuk ungkapan kebebasan Allah yang Maha Bijaksana dalam bertindak yang ditunjukkan dalam firmanNya (أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ ) “Tidakkah kamu mengetahui bahwa kerajaan langit dan bumi adalah kepunyaan Allah Ta’ala.” Begitulah Allah Ta’ala bebas untuk menentukan tindakanNya baik menghapus suatu hukum atau menetapkannya, atau mendatangkan yang lebih baik dari yang dinasakh atau setara, sesuai dengan kebutuhan ummat dan tuntutan kehidupan mereka secara spiritual atau materiil. Maha suci Allah, sesembahan yang Maha Kuasa lagi Maha Bijaksana. Dia membuat manusia terhadap ayat yang dikehendakiNya atau dan menghapus (nasakh) ayat yang dikehendakiNya. Pelajaran dari ayat : • Kewajiban untuk tunduk kepada Allah dan ridha terhadap hukum-hukumNya, serta tidak berpaling dari Allah Ta’ala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 107: Allah mengakkan dalil yang jelas atas kuasanya dengan berkata: apakah engkau wahai nabi mengetahui bahwasannya allah yang memiliki apa yang di langit dan di bumi? kemudian Allah menjelaskan bahwasannya tidak ada bagi manusia penolong selain Allah yang menolong urusan – urusan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Dia berbuat apa yang dikehendaki-Nya, menetapkan apa yang diinginkan-Nya, Dia memerintah hamba-hamba-Nya dan melarang bagaimana saja yang dikehendaki-Nya, dan mereka (hamba-hamba-Nya) berkewajiban untuk ta'at dan menerima. Jika mereka bermaksiat, maka tidak ada seorang pun yang bisa melindungi dan menolong dari azab Allah selain Allah Subhaanahu wa Ta'aala saja. Orang-orang Yahudi mengingkari adanya naskh (penghapusan hukum kepada hukum yang lain) atau pengguguran hukum, mereka mengatakan bahwa hal itu tidak boleh terjadi, padahal hal itu disebutkan juga dalam Taurat, maka Allah Subhaanahu wa Ta'aala menerangkan hikmah adanya penasakhan, yakni tidak ada ayat yang dinaskh atau dihilangkan dari ingatan, pasti Allah mendatangkan yang lebih baik atau sebanding dengannya. Allah Subhaanahu wa Ta'aala juga menerangkan pada ayat di atas, bahwa siapa saja yang mengkritik tentang naskh, maka sesungguhnya ia telah mengkritik kerajaan dan kekuasaan-Nya, padahal seorang hamba di bawah kekuasaan-Nya, sehingga tidak patut baginya untuk membantah?! Oleh karena itu, siapa saja yang memperhatikan naskh dalam Al Qur'an dan As Sunnah, tentu dia akan mengetahui hikmah (kebijaksanaan) Allah dan rahmat-Nya kepada hamba-hamba-Nya; Dia menyampaikan mereka kepada hal yang bermaslahat, namun mereka tidak menyadari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 107",
    "description": "Tidakkah kamu tahu, wahai Muhammad, bahwa Allah memiliki kerajaan langit dan bumi yang menguasai dan bertindak untuk makhluknya, memutuskan hukum, dan memerintah sesuai kehendak-Nya' dan tidak ada bagimu, wahai orang-orang kafir, pelindung yang dapat melindungi urusanmu dan penolong yang dapat menolongmu selain Allah. Menurut ibnu abbas, ayat ini turun terkait abdullah bin ubay dan kawan-kawannya yang meminta rasulullah untuk mengubah bukit safa menjadi emas, meluaskan tanah mekah, dan memancarkan air dari tanah. Mereka menyatakan bahwa jika nabi berhasil mengabulkan permintaan-per mintaan itu, maka mereka akan beriman kepada beliauataukah kamu hendak meminta kepada rasulmu, yakni Muhammad, untuk mendatangkan kepa damu ayat-ayat Al-Qur'an lebih daripada apa yang telah dibawakannya kepadamu, seperti halnya musa pernah diminta oleh bani israil dahulu sesuatu yang tidak pantas mereka minta' barang siapa mengganti iman kepada ayat-ayat Al-Qur'an yang diturunkan kepada nabi Muhammad dengan kekafiran, maka sungguh, dia telah tersesat dari jalan yang lurus, dengan memilih kufur daripada iman, kesesatan daripada petunjuk, serta jauh dari kebenaran dan kebajikan."
  }
]