[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah kalian -wahai sekalian manusia- ingin meminta dari rasul kalian Muhammad Shallallahu Alaihi Wasallam banyak hal untuk tujuan pembangkangan dan bentuk kesombongan, sebagaimana hal serupa dimintakan kepada Musa Alaihissalam. Dan ketahuilah bahwa barangsiapa memilih kekafiran dan menolak iman maka sesungguhnya dia telah keluar dari jalan Allah yang lurus menuju kejahilan dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Bukan tabiat kalian -wahai orang-orang mukmin- mengajukan permintaan -yang bernada menentang dan membangkang- kepada Rasul sebagaimana kaum Nabi Musa dahulu mengajukan permintaan semacam itu kepada nabi mereka. Seperti ucapan mereka, “Perlihatkanlah Allah kepada kami secara terbuka.” (An-Nisā`:153). Barangsiapa menukar imannya dengan kufur, ia benar-benar telah tersesat dari jalan moderat, yaitu jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Hai Manusia, Apakah kalian ingin meminta kepada Rasul kalian sesuatu seperti apa yang sebelumnya diminta oleh kaum Musa kepadanya? Barangsiapa yang lebih memilih kekafiran dan berpaling dari keimanan maka ia telah keluar dari agama Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. أَمْ تُرِيدُونَ (Apakah kamu menghendaki) Yakni apakah kalian ingin meminta kepada Muhammad Shallallahu ‘Alaihi Wasallamsebagaimana Musa diminta oleh kaumnya, mereka meminta agar dapat melihat Allah dengan mata telanjang sedangkan kalian meminta Muhammad Shallallahu ‘Alaihi Wasallamagar mendatangkan Allah dan malaikat didepan mereka. فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ (maka sungguh orang itu telah sesat dari jalan yang lurus) Yakni telah berbelok dari jalan yang lurus, jalan ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Apakah lantas kalian akan meminta permintaan yang mustahil seperti permintaan untuk mengahadirkan Allah dan malaikat-Nya kepada rasul kalian Muhammad SAW. Seperti yang dulu pernah diminta oleh umat nabi Musa untuk melihat Allah secara langsung? Kalian sungguh sesat seperti umat nabi Musa. Barang siapa lebih memilih kekufuran dari pada keimanan, mereka telah menyimpang dari jalan yang lurus, atau jalan ketaatan kepada Allah. Diriwayatkan dari At Thabbrani dari seorang ahli ijtihad, beliau berkata bahwa suku Qurays meminta nabi Muhammad SAW untuk menjadikan bukit Shafa menjadi gunungan emas. Maka dijawab: Permintaan kalian itu layaknya permintaan Bani Israil mendatangkan makanan dari langit. Jika kalian ingkar, maka kalian juga seperti mereka yang justru mengingkari dan menghina. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah kalian menghendaki untuk meminta Rasul kalian seperti halnya Musa (pernah) diminta dahulu. Siapa yang mengganti} menukar {keimanan dengan kekufuran, sungguh dia telah tersesat dari jalan yang lurus} dia telah menyimpang dari jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Allah melarang orang-orang yang beriman atau orang-orang Yahudi untuk bertanya kepada Rosul mereka, “sebagaimana Bani Israil bertanya kepada Musa pada zaman dahulu?” maksud dari hal itu adalah pertanyaan-pertanyaan yang menyulitkan dan menantang. Sebagaimana Firman-Nya : \"Ahlu kitab akan meminta kepadamu untuk menurunkan kitab kepada mereka dari langit, maka sungguh mereka telah meminta kepada Musa sesuatu yang lebih besar dari itu, mereka berkata 'tunjukanlah Allah kepada kami secara jelas/nyata\" Allahpun berfirman : \"wahai orang-orang yang beriman janganlah kamu bertanya tentang sesuatu yang jika diperlihatkan kepada kalian hanya akan memperburuk keaadan kalian\" Dan pertanyaan seperti ini dan semilanya adalah perka yang terlarang. Adapun pertanyaan untuk meminta penjelasan atau pelajaran, maka ini merupakan pertanyaan yang terpuji dan Allah memerintah hal itu dalam firman-Nya : \"maka bertanyalah kepada ahlu zikir jika kalian tidak mengetahui\" Dan Allah menyetujui mereka sebagaimana dalam firman-Nya : ''mereka bertanya kepadamu tentang hokum khomr dan maisir\" \"mereka bertanya kepadamu tentang anak yatim\" dan ayat-ayat sejenisnya. Ketika hal-hal yang dilarang darinya itu tercela, yang mungkin saja membawa pelakunya jatuh kepada kekufuran, maka Allah berfirman “Dan barangsiapa yang menukar iman dengan kekafiran, maka sungguh orang itu telah sesat dari jalan yang lurus.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَمۡ تُرِيدُونَ } Am turiiduuna : Bahkan, apakah kalian menghendaki. Kata “Am” ini digunakan untuk idhrab intiqali (mengalihkan perhatian), masih satu arti dengan kata “Bal” dan Hamzah Istifham. Adapun yang diminta oleh Bani Israil kepada Musa adalah adalah ucapan mereka “Tunjukkanlah Allah secara terang-terangan). { سَوَآءَ ٱلسَّبِيلِ } Sawaa’ as sabiil : Jalan pertengahan yang aman sehingga tidak melenceng keluar dari jalan itu. Makna ayat : Adapun firman Allah Ta’ala pada ayat (108) (أَمۡ تُرِيدُونَ أَن تَسۡ‍َٔلُواْ رَسُولَكُمۡ ) “Apakah kamu menghendaki untuk meminta kepada Rasul kamu...” Ini adalah bentuk celaan kepada orang yang menuntut Rasulallah ﷺ terhadap perkara yang di luar kemampuannya, dan pemberitahuan bahwa orang yang bersikap keras dan tidak memiliki adab kepada Rasulullah akan mendapatkan musibah berupa kerasnya hati dan menjadi kufur. Inilah yang ditunjukkan oleh firmanNya (وَمَن يَتَبَدَّلِ ٱلۡكُفۡرَ بِٱلۡإِيمَٰنِ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ ) “Dan barangsiapa yang menukar iman dengan kekafiran, maka sungguh orang itu telah sesat dari jalan yang lurus.” Pelajaran dari ayat : • Celaan terhadap sikap berlebih-lebihan dalam agama, dan menanyakan pertanyaan yang menyulitkan. Juga peringatan agar tidak melakukan hal tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 108: Kemudian Allah mengingkari atas siapa yang banyak bertanya kepada nabi ﷺ ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini, Allah Subhaanahu wa Ta'aala melarang kaum mukmin dan orang-orang Yahudi meminta kepada rasul mereka (Nabi Muhammad shallallahu 'alaihi wa sallam) seperti halnya Nabi Musa 'alaihis salam diminta juga dahulu. Sebagian mufassir mengartikan kata \"am\" (ataukah) dengan \"bal\" yang artinya bahkan, sehingga artinya, \"Bahkan kamu hendak…dst.\" Permintaan di sini adalah permintaan atau pertanyaan yang memberatkan diri dan sikap I'tiraadh (membantah), sebagaimana firman Allah di surat An Nisaa': 153 dan Al Maa'idah: 101. Adapun pertanyaan dalam arti meminta bimbingan dan pengajaran, maka hal ini perbuatan terpuji dan diperintahkan sebagaimana firman Allah Ta'ala \"Fas'aluu ahladz dzkri in kuntum laa ta'lamuun\" (An Nahl: 43 dan Al Anbiyaa': 7)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 108",
    "description": "Ataukah kamu hendak meminta kepada rasulmu, yakni Muhammad, untuk mendatangkan kepa damu ayat-ayat Al-Qur'an lebih daripada apa yang telah dibawakannya kepadamu, seperti halnya musa pernah diminta oleh bani israil dahulu sesuatu yang tidak pantas mereka minta' barang siapa mengganti iman kepada ayat-ayat Al-Qur'an yang diturunkan kepada nabi Muhammad dengan kekafiran, maka sungguh, dia telah tersesat dari jalan yang lurus, dengan memilih kufur daripada iman, kesesatan daripada petunjuk, serta jauh dari kebenaran dan kebajikanbanyak di antara ahli kitab menginginkan sekiranya mereka dapat mengembalikan atau mema lingkan kamu setelah kamu beriman kepada Allah dan nabi Muhammad, menjadi kafir kembali seperti yang kamu lakukan dahulu, karena rasa dengki dalam diri mereka, setelah kebe naran jelas bagi mereka dengan adanya dalil-dalil kuat yang menunjukkan nabi Muhammad benar-benar menyampaikan ayat-ayat Allah seperti yang diberitakan dalam kitab-kitab mereka. Maka maafkanlah kesalahankesalahan mereka, pergaulilah mereka dengan akhlak yang baik, dan berlapangdadalah dengan mengabaikan cacian dan tentangan mereka sampai Allah memberi kan perintah-Nya dengan bantuan dan dukungannya. Sungguh, Allah mahakuasa atas segala sesuatu. Ia akan menguatkan kedudukanmu dan memberimu kekuatan yang lebih besar."
  }
]