[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Telah berangan-angan banyak orang dari ahli kitab untuk mengembalikan kalian setelah keimanan menjadi orang kafir sebagaimana keadaan kalian sebelumnya dimana kalian menyembah berhala-berhala; disebabkan kebencian yang telah memenuhi jiwa mereka setelah jelasnya bagi mereka kebenaran Nabi Allah dan rasul-Nya Muhammad Shallallahu Alaihi Wasallam terkait risalah yang dia bawa. Maafkanlah tindakan yang muncul dari mereka berupa perlakuan buruk dan kekeliruan dan berlapang dada dalam menyikapi kebodohan mereka sampai Allah datangkan dengan ketetapannya bagi mereka untuk memerangi mereka (dan itulah telah datang dan terjadi). dan Allah akan menghukum mereka atas keburukan perbuatan-perbuatan mereka. Sesungguhnya Allah Maha Kuasa atas segala sesuatu tidak ada sesuatupun yang dapat melemahkan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Banyak ahli kitab yang berharap dapat mengembalikan kalian -setelah kalian beriman- menjadi orang-orang kafir seperti sediakala ketika kalian menyembah berhala. Hal itu karena rasa dengki yang ada di dalam diri mereka. Mereka berharap seperti itu setelah yakin bahwa ajaran yang dibawa oleh Nabi adalah kebenaran yang berasal dari Allah. Maka maafkanlah perbuatan mereka dan maklumilah kebodohan dan kebusukan hati mereka sampai datang ketentuan Allah tentang mereka. Dan kini perintah dan ketentuan Allah itu sudah datang. Maka mereka tinggal memilih antara memeluk Islam, membayar jizyah atau perang. Sesungguhnya Allah Mahakuasa atas segala sesuatu. Tidak ada sesuatupun yang dapat menghalangi kehendak Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Banyak dari orang-orang Yahudi dan Nasrani yang berusaha mengembalikan kalian kepada kekafiran setelah kalian beriman, hal ini karena kedengkian yang mereka sembunyikan dalam diri mereka setelah jelas bagi mereka kebenaran Nabi Muhammad dan risalahnya; maka janganlah kalian balas dan hina mereka sampai Allah menurunkan hukum yang lain, seperti hukum tentang izin memerangi mereka. Sungguh Allah Maha kuasa atas seluruh makhluk. Diriwayatkan dari Ibnu Abbas, ia berkata: فَاعْفُوا۟ وَاصْفَحُوا۟ حَتَّىٰ يَأْتِىَ اللهُ بِأَمْرِهِ Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. (al-Baqarah: 109) ayat ini telah dinasakh dengan firman-Nya: فَاقْتُلُوا۟ الْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ maka bunuhlah orang-orang musyrikin itu dimana saja kamu jumpai mereka. (taubah: 5) dan dengan firman-Nya: قٰتِلُوا۟ الَّذِينَ لَا يُؤْمِنُونَ بِاللهِ وَلَا بِالْيَوْمِ الْاٰخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ حَتَّىٰ يُعْطُوا۟ الْجِزْيَةَ عَن يَدٍ وَهُمْ صٰغِرُونَ Perangilah orang-orang yang tidak beriman kepada Allah dan tidak (pula) kepada hari kemudian, dan mereka tidak mengharamkan apa yang diharamkan oleh Allah dan Rasul-Nya dan tidak beragama dengan agama yang benar (agama Allah), (yaitu orang-orang) yang diberikan Al-Kitab kepada mereka, sampai mereka membayar jizyah dengan patuh sedang mereka dalam keadaan tunduk. (at-Taubah: 29) Dan dalam hadits shahih disebutkan bahwa dahulu Rasulullah dan para sahabatnya memaafkan orang-orang musyrik dan ahli kitab sebagaimana yang Allah perintahkan, dan mereka tetap bersabar dari gangguan mereka. Allah berfirman: وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوٓا۟ أَذًى كَثِيرًا ۚ وَإِن تَصْبِرُوا۟ وَتَتَّقُوا۟ فَإِنَّ ذٰلِكَ مِنْ عَزْمِ الْأُمُورِ Dan (juga) kamu sungguh-sungguh akan mendengar dari orang-orang yang diberi kitab sebelum kamu dan dari orang-orang yang mempersekutukan Allah, gangguan yang banyak yang menyakitkan hati. Jika kamu bersabar dan bertakwa, maka sesungguhnya yang demikian itu termasuk urusan yang patut diutamakan. (Ali Imran: 186) dan Allah berfirman: وَدَّ كَثِيرٌ مِّنْ أَهْلِ الْكِتٰبِ لَوْ يَرُدُّونَكُم مِّنۢ بَعْدِ إِيمٰنِكُمْ كُفَّارًا حَسَدًا مِّنْ عِندِ أَنفُسِهِم مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ ۖ فَاعْفُوا۟ وَاصْفَحُوا۟ حَتَّىٰ يَأْتِىَ اللهُ بِأَمْرِهِۦٓ ۗ إِنَّ اللهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran. Maka maafkanlah dan biarkanlah mereka, sampai Allah mendatangkan perintah-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu. (Al- Baqarah: 109) dengan ini Rasulullah selalu berusaha memaafkan sebagaimana yang Allah perintahkan kepadanya, hingga beliau mendapat izin dari Allah untuk memerangi mereka. Dan ketika Rasulullah memulai perang Badar, dan berhasil mengalahkan para pemimpin kafir Quraisy maka Ibnu Ubai bin Salul dan orang-orang musyrik berkata: “urusan ini telah jelas hasilnya, maka baiatlah Rasulullah untuk masuk Islam.” Dan merekapun masuk Islam. (shahih Bukhari, Tafsir Ali Imran, Bab: وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوٓا۟ أَذًى كَثِيرًا)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ ۖ (setelah nyata bagi mereka kebenaran) Yakni mereka telah mengetahui kebenaran bahwa Muhammad Shallallahu ‘Alaihi Wasallamadalah Rasulullah. فَاعْفُوا وَاصْفَحُوا(Maka maafkanlah dan biarkanlah mereka) (العفو) yakni tidak mengambil balasan dari kesalahan mereka, sedangkan (الصفح) yakni menjauhi pelaku dosa atau kesalahan. حَتَّىٰ يَأْتِيَ اللَّهُ بِأَمْرِهِ ۗ( sampai Allah mendatangkan perintah-Nya) Yakni sampai datang keputusan Allah dalam urusan mereka yang berupa hukuman mati, pengusiran, pembayaran jizyah, atau masuk Islam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tadabburilah ayat berikut : { وَدَّ كَثِيرٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُمْ مِنْ بَعْدِ إِيمَانِكُمْ كُفَّارًا حَسَدًا مِنْ عِنْدِ أَنْفُسِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ } , kamu dapati dari ayat ini dalil yang jelas bahwa yang menghalangi mereka dari taufiq adalah yang paling lemah keimanannya, dan sesungguhnya mereka tidaklah dengki kepada orang-orang, kecuali setelah terbukti dihadapan mereka hakikat kebenaran yang membuat mereka dengki dan bagi mereka itu adalah kebathilan, dan mereka sangka yang di tangan mereka itulah yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Sebagian besar kaum Yahudi berharap dan juga lebih senang jika kalian dapat mereka kembalikan kepada kekufuran. Sebab mereka dengki terhadap nikmat petunjuk yang Allah dianugerahkan kepada kalian. Mereka dengki setelah tahu bukti-bukti yang sangat jelas bahwa nabi Muhammad SAW adalah utusan Allah. Maka maafkanlah kesalahan mereka dan bersabarlah atas yang telah mereka perbuat dengan memusuhimu. Al ‘afwu adalah menghindari untuk mengklaim bahwa mereka berdosa. As Shafhu adalah menghapus akibat dari suata dosa. Hal itu dilakukan sampai Allah memberi izin untuk memerangi atau memberi hukuman kepada mereka. Allah sangat berkuasa atas segala sesuatu. Ayat ini diturunkan untuk sekelompok kaum Yahudi yang suatu ketika pernah berkata kepada kaum muslim: “Apakah kalian tidak bercermin atas apa yang telah menimpa kalian, meskipun kalian dalam jalan kebenaran, sedang kalian tidak berdaya. Kembalilah kepada agama kami, itulah yang terbaik untuk kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Banyak di antara Ahlul kitab menginginkan} berharap {agar mereka dapat mengembalikan kalian setelah kalian beriman menjadi kafir kembali karena kedengkian dalam diri mereka} dari diri mereka sendiri {setelah kebenaran jelas bagi mereka. Maka, maafkanlah dan berlapang dadalah} maka abaikanlah {sehingga Allah memberikan perintahNya} dengan hukumNya tentang mereka {Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Kemudian Allah mengabarkan tentang sifat hasad sebagian besar dari orang-orang ahli kitab dan bahwasanya kondisi tersebut memuncak hingga mereka berkeinginan, “agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, ” dan mereka berusaha untuk itu, dan menggunakan segala tipu daya, namun tipu daya mereka itu kembali kepada mereka sendiri sebagaiman firman Allah ta'ala: \"dan berkata sekelompok dari ahli kitab 'berimalah kalian kepada apa yang diturunkan kepada orang-orang yang beriman itu di siang hari dan kufurlah pada akhir nya semoga mereka bias kembali\" Ini adalah kedengkian mereka yang timbul dari diri mereka sendiri, lalu Allah memerintahkan kepada mereka untuk membalas orang-orang yang sangat berlaku buruk terhadap mereka dengan cara memaafkan mereka dan berlapang dada hingga datang ketentuan Allah kepada mereka agar berjihad, maka Allah menenangkan hati orang-orang yang beriman diantara mereka. Mereka memerangi orang-orang yang telah memerangi, mereka menawan orang-orang yang telah menawan mereka dan mereka mengusir orang-orang yang telah mengusir. “Sesungguhnya Allah Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَدَّ } Wadda : Menyukai { أَهۡلِ ٱلۡكِتَٰبِ } Ahlil kitab : Orang-orang Yahudi dan Nasrani { حَسَدٗا } Hasadan : Hasad (dengki) adalah berharap hilangnya nikmat yang dimiliki oleh orang lain { تَبَيَّنَ لَهُمُ ٱلۡحَقُّۖ } Tabayyana lahumul haq : Mereka mengetahui bahwa Muhammad ﷺ adalah Rasulullah, dan agamanya adalah agama yang benar. { فَٱعۡفُواْ وَٱصۡفَحُواْ } Fa’fuu washfahuu : Jangan kalian hukum mereka dan jangan kalian cela mereka. Makna Al-‘Afwu adalah memberi maaf dan tidak menghukum, dan makna ash-Shafhu adalah berpaling dari orang yang berdosa (menganggap tidak bersalah). { حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِ } Hatta ya’tiyallahu bi amrih : Maknanya sampai turun izin untuk memerangi mereka, yang dimaksud ‘mereka’ adalah Yahudi Madinah yang terdiri dari Bani Qainuqa’, Bani Nadhir, dan Bani Quraizhah. Makna ayat : Pada ayat (109) Allah Ta’ala mengabarkan bahwa orang-orang mukmin tentang moralitas kebanyakan Ahli kitab. Yaitu keinginan kuat mereka agar orang-orang muslim meninggalkan agama mereka yang benar sehingga menjadi kafir. Penyebabnya adalah dengki yang tumbuh dari moralitas jelek yang tidak suka melihat kaum muslimin hidup dalam cahaya keimanan, jauh dari gelapnya kekufuran. Sesudah Allah Ta’ala memberitahukan hamba-hambaNya yang mukmin tentang dendam yang disimpan oleh musuh-musuh mereka, Allah memerintahkan untuk memaafkan dan meninggalkan kesalahan mereka. Karena belum tiba saatnya untuk memerangi mereka, namun apabila waktu itu telah tiba maka boleh memerangi mereka dan melampiaskan sakit hati kaum muslimin. Pelajaran dari ayat : • Kaum Yahudi dan Nasrani mengetahui bahwa agama Islam adalah benar dan kaum Muslimin berada di atas kebenaran. Hal itulah yang membuat mereka merasa dengki kemudian memusuhi kaum Muslimin, serta membuat mereka kufur keluar dari agamanya. Inilah moralitas buruk yang senantiasa ada pada karakter ahli kitab kepada kaum muslimin hingga hari ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 109: Kemudian Allah mengabarkan bahwasannya ahli kitab mempersulit kalian orang –orang yang beriman untuk kembali kepada keimanan kalian telah kekufuran yang mana mereka ahli kitab yang memiliki sifat hasad setelah jelek bagi kalian kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena rasa dengki dalam diri mereka, mereka berupaya mencari cara agar dapat mengembalikan umat Islam kepada kekafiran, di antara cara mereka disebutkan di surat Ali Imran: 72-73, maka Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin untuk membalas sikap ini dengan memaafkan dan membiarkan mereka sampai Allah mendatangkan keputusan-Nya. Abusy Syaikh meriwayatkan dalam kitab Al Akhlak dari Usamah bin Zaid, bahwa Rasulullah shallallahu 'alaihi wa sallam berada di atas himar (keledai), lalu Beliau bersabda kepada Sa'ad, \"Tidakkah kamu mendengar Abul Habab –yakni Abdullah bin Ubay-, ia berkata begini dan begitu?\" Sa'ad bin Ubadah berkata, \"Maafkanlah dia dan biarkanlah\", maka Rasulullah shallallahu 'alaihi wa sallam memaafkannya. Rasulullah shallallahu 'alaihi wa sallam dan para sahabat biasa memaafkan Ahli Kitab dan kaum musyrik, hingga Allah Azza wa Jalla menurunkan ayat, \"Fa'fuu wash-fahuu…dst.\"(Hadits ini para perawinya tsiqah. Ibnu Abi 'Ashim adalah seorang hafizh besar, biografinya ada dalam Tadzkiratul Huffaz juz 2 hal. 640, sedangkan selebihnya ada dalam Tahdzibut Tahdzib. Hadits tersebut dalam kitab shahih melalui jalan Syu'aib bin Abi Hamzah dengan sanad ini, akan tetapi tidak ada di sana sebab turunnya. Demikian juga seperti ini dalam Tafsir Ibnu Abi Hatim seperti yang disebutkan dalam Tafsir Ibnu Katsir juz 1 hal. 135) Maksudnya: Izin memerangi dan mengusir orang Yahudi. Dengan demikian, terobatilah rasa sakit di hati yang menimpa kaum mukmin selama ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 109",
    "description": "Banyak di antara ahli kitab menginginkan sekiranya mereka dapat mengembalikan atau mema lingkan kamu setelah kamu beriman kepada Allah dan nabi Muhammad, menjadi kafir kembali seperti yang kamu lakukan dahulu, karena rasa dengki dalam diri mereka, setelah kebe naran jelas bagi mereka dengan adanya dalil-dalil kuat yang menunjukkan nabi Muhammad benar-benar menyampaikan ayat-ayat Allah seperti yang diberitakan dalam kitab-kitab mereka. Maka maafkanlah kesalahankesalahan mereka, pergaulilah mereka dengan akhlak yang baik, dan berlapangdadalah dengan mengabaikan cacian dan tentangan mereka sampai Allah memberi kan perintah-Nya dengan bantuan dan dukungannya. Sungguh, Allah mahakuasa atas segala sesuatu. Ia akan menguatkan kedudukanmu dan memberimu kekuatan yang lebih besar. Dan laksanakanlah salat sebagai ibadah badaniah dengan benar sesuai tuntunan, dan tunai kanlah zakat sebagai ibadah maliah, karena keduanya merupakan fondasi islam. Dan segala kebaikan yang kamu kerjakan untuk dirimu berupa salat, zakat, sedekah, atau amal-amal saleh lainnya, baik yang wajib maupun sunah, kamu akan mendapatkannya berupa pahala di sisi Allah. Sungguh, Allah maha melihat dan memberi balasan pahala di akhirat atas apa yang kamu kerja kan."
  }
]