[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila mereka dinasehati agar berhenti berbuat kerusakan dimuka bumi dengan perbuatan kekufuran dan perbuatan maksiat dan membocorkan rahasia rahasia kaum mukminin, serta loyalitas terhadap orang-orang kafir, mereka berkata dengan pendustaan dan mendebat “sesunguhnya kami adalah orang-orang yang melakukan perbaikan”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Apabila mereka dilarang membuat kerusakan di muka bumi berupa kekafiran, perbuatan dosa dan lain-lain, mereka mengingkarinya. Mereka beranggapan bahwa mereka adalah orang-orang yang baik dan selalu menganjurkan perbaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Setelah Allah mengabarkan apa yang mereka sembunyikan dalam hati mereka, Allah kemudian melanjutkannya dengan menyebutkan tanda yang dapat menunjukkan hakikat mereka. Allah menjelaskan bahwa jika mereka dilarang berbuat kerusakan yang besar, mereka menyangkal dan mengklaim telah melakukan perbaikan yang besar, dengan firman-Nya: (وإذا قيل لهم) Allah menggunakan kalimat dalam bentuk negasi untuk menunjukkan bahwa mereka menyangkal semua orang yang menasehati mereka, siapapun itu. Apabila orang-orang munafik tersebut dilarang melakukan kerusakan di bumi, semisal melakukan berbagai kemaksiatan, maka mereka menyombongkan diri dan enggan meninggalkan kemaksiatannya, kemudian mereka mengklaim bahwa mereka adalah orang-orang yang melakukan perbaikan. Kemudian Allah menjelaskan bahwa mereka adalah orang-orang yang berbuat kerusakan. Allah menyingkap kedustaan mereka dan menjelaskan bahwa mereka tidak merasa berbuat kerusakan akibat kebodohan mereka. Allah menyangkal mereka dengan menggunakan kalimat yang ringkas namun lebih tegas daripada yang mereka katakan, sebab 'tariful musnad' menunjukkan bahwa 'musnad' hanya berlaku pada 'musnad ilaih', dengan firman-Nya (ألا إنهم هم المفسدون) -yakni dalam hal ini hanya merekalah yang berbuat kerusakan. Perbuatan-perbuatan yang mereka bangga-banggakan dan mereka akui merupakan perbuatan yang cerdas dan membangun namun ternyata hanya mengakibatkan kerusakan yang besar, hanya saja mereka tidak menyadarinya karena begitu tersembunyi dan karena penutup yang ada pada hati mereka yang diakibatkan kemunafikan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَاِذَا قِيْلَ لَهُمْ لَا تُفْسِدُوْا فِى الْاَرْضِۙ (Dan apabila dikatakan kepada mereka, “Janganlah berbuat kerusakan di bumi) Yang disebabkan kenifakan dan perbuatan mereka menjadikan orang-orang kafir sebagai pemimpin dan juga perbuatan memecah belah agar manusia menjauhi Nabi Muhammad Shallallahu ‘Alaihi Wasallam dan al-Qur’an. Dan jika melakukan perbuatan-perbuatan ini maka rusaklah apa yang ada dibumi dengan kebinasaan dan kehancuran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "11-12 Tidak semua pengakuan yang dilontar oleh seseorang tentang suatu perkara mesti dibenarkan; karena orang-orang munafiq tatkala mereka berkata : { إِنَّمَا نَحْنُ مُصْلِحُونَ } \"sesungguhnya kami adalah orang-orang yang mengadakan perbaikan\" , Allah kemudian membantah perkataan mereka dengan firman-Nya : { أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ } \"Ketahuilah sesungguhnya mereka itu adalah orang-orang yang mendatangkan kerusakan\" ; dan tidak semua apa yang dihiasi oleh jiwa selalu baik; sebagaimana yang difirmankan oleh Allah : { أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ } \"Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik, (sama dengan orang yang tidak ditipu oleh syaitan)? Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya dan menunjuki siapa yang dikehendaki-Nya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Jika dikatakan kepada mereka: “Janganlah melakukan kerusakan di bumi dengan berbuat munafik, mengikuti kekafiran, dan mencerai-beraikan orang-orang mukmin!”, mereka akan mengaku bahwa mereka adalah orang-orang yang melakukan pembaruan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka, “Janganlah berbuat kerusakan} Janganlah kalian kufur dan berbuat kemaksiatan {di bumi”, mereka menjawab, “Sesungguhnya kami adalah orang-orang yang melakukan perbaikan“"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Maksudnya, apabila mereka (orang-orang munafik) dilarang berbuat kerusakan di atas bumi yaitu melakukan kekufuran dan kemaksiatan, dan di antara perbuatan itu adalah menyebarluaskan rahasia-rahasia kaum Mukminin kepada musuh-musuh mereka dan memberikan loyalitas mereka (orang-orang munafik) itu kepada orang-orang kafir, ”mereka menjawab , ’sesungguhnya kami orang-orang yang mengadakan perbaikan’.” Sehingga mereka mengumpulkan antara merusak di muka bumi dan sikap menampakkan bahwa itu bukanlah suatu tindakan pengrusakan, akan tetapi hal itu adalah perbaikan , sebagai suatu pemutarbalikan fakta dan penyatuan antara perbuatan batil dengan keyakinan bahwa hal itu benar. Mereka itu lebih besar kejahatannya daripada orang yang melakukan kemaksiatan dengan keyakinan akan keharamannya, maka yang terakhir ini lebih dekat kepada keselamatan dan lebih diharapkan untuk bertaubat. Dan ketika perkataan mereka, ”sesungguhnya kami orang-orang yang mengadakan perbaikan “ ini adalah suatu pembatasan terhadap perbaikan hanya dari pihak mereka dan termasuk di dalamnya bahwa kaum Mukminin bukanlah dari orang-orang yang melakukan perbaikan, maka Allah membalikkan anggapan mereka dengan firmanNya,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : لَا تُفۡسِدُواْ فِي ٱلۡأَرۡضِ : Al-Fasaad fil ardhi yaitu dengan berbuat kekufuran dan berlaku maksiat di bumi. إِنَّمَا نَحۡنُ مُصۡلِحُونَ : Al-Islaah fil ardhi maknanya mengadakan perbaikan dengan keimanan yang benar dan amalan shalih, meninggalkan syirik dan dosa-dosa. Makna ayat : Allah subhanahu wa Ta’ala menyebutkan keadaan orang munafik tatkala ada orang mukmin yang berkata kepadanya “Janganlah berbuat kerusakan di muka bumi” dengan kemunafikan serta berloyalitas kepada kaum yahudi dan orang-orang kafir, mereka menjawab \"Sesungguhnya kami orang-orang yang mengadakan perbaikan.\" Menurut persangkaannya. Pelajaran dari ayat : 1. Celaan terhadap penyataan bohong, yang biasanya menjadi karakter orang munafik"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 11: Allah menjelaskan bahwasanya orang-orang munafik dikatakan kepada mereka : janganlah kalian merusak di bumi Dengan menyebarkan kekufuran dan kemaksiatan, maka mereka menjawab : mereka hanyalah menginginkan perbaikan dan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika mereka dinasehati. Kerusakan yang mereka perbuat di muka bumi bukan berarti kerusakan benda, melainkan dengan melakukan kekafiran dan kemaksiatan, yang di antaranya menyebarkan rahasia kaum muslimin kepada musuh mereka, menghasut orang-orang kafir untuk memusuhi dan menentang orang-orang Islam. Secara dusta dan bermaksud membantah. Perbuatan yang mereka lakukan itu dengan anggapan mengadakan perbaikan sesungguhnya adalah kerusakan, akan tetapi karena kebodohan dan penentangan mereka membuat mereka tidak menyadari bahwa yang demikian merupakan kerusakan. Kemaksiatan yang besar adalah kemaksiatan yang dilakukan dengan meyakini benarnya perbuatan itu dan seperti inilah keadaan mereka sehingga sangat sulit untuk rujuk, berbeda dengan kemaksiatan yang dilakukan dengan meyakini salahnya perbuatan itu, orang yang seperti ini lebih mudah untuk rujuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 11",
    "description": "Dan apabila dikatakan dan dinasihatkan kepada mereka, janganlah berbuat kerusakan di bumi, dengan melanggar nilai-nilai yang ditetapkan agama, menghalangi orang dari jalan Allah, menyebar fitnah, dan memicu konflik, mereka justru mengklaim bahwa diri mereka bersih dari perusakan dan tidak bermaksud melakukan kerusakan. Mereka menjawab, sesungguhnya kami justru orang-orang yang melakukan perbaikan. Itu semua akibat rasa bangga diri mereka yang berlebihan. Begitulah perilaku setiap perusak yang tertipu oleh dirinya: selalu merasa kerusakan yang dilakukannya sebagai kebaikan. Karena kelakuan mereka yang selalu menampakkan keimanan dan menyembunyikan kekufuran serta menganggap kerusakan mereka sebagai kebaikan, Allah mengingatkan orang-orang mukmin agar tidak tertipu dengan itu semua. Ingatlah, sesungguhnya merekalah yang berbuat kerusakan. Diri mereka telah rusak karena keyakinan yang batil dan perbuatan yang jahat. Mereka pun telah merusak orang lain dengan menyebar fitnah dan memicu konflik di tengah masyarakat. Tetapi, karena hati yang telah tertutup dan rasa bangga diri yang berlebihan, mereka tidak menyadari kerusakan tersebut dan akibat buruk yang akan menimpa mereka oleh sebab kemunafikan."
  }
]