[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sibukkanlah diri kalian -wahai orang-orang yang beriman- dengan menjalankan sholat dengan cara yang benar, dan membayar zakat yang wajib. Dan ketahuilah bahwa setiap kebaikan apapun yang kalian usahakan bagi diri kalian, niscaya kalian akan menjumpai pahalanya di sisi Allah di akhirat. Sesungguhnya Allah ta'ala Maha Melihat seluruh amal perbuatan kalian, dan akan memberikan balasan kepada kalian atas perbuatan-perbuatan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Dirikanlah salat secara sempurna dengan melengkapi rukun, wajib dan sunnah-sunnahnya. Keluarkanlah zakat harta kalian untuk orang-orang yang berhak menerimanya. Amal saleh apapun yang kalian kerjakan ketika hidup dan kalian melakukannya sebelum kematian sebagai tabungan untuk kalian, niscaya kalian akan mendapatkan ganjarannya di sisi Allah pada hari kiamat. Allah akan memberi kalian balasan yang setimpal dengan amalan itu. Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan, lalu Dia akan membalas setiap orang dengan balasan yang setimpal sesuai amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Allah memerintahkan orang-orang beriman untuk mendirikan shalat pada waktunya dan memenuhi rukun-rukunnya dan membayar zakat kepada orang yang berhak menerimanya. Dan segala kebaikan yang mereka lakukan akan mereka lihat balasannya dari Allah di akhirat. Tidak amalan mereka yang tersembunyi dari Allah, dan dia akan membalas amalan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ (Dan kebaikan apa saja yang kamu usahakan bagi dirimu) Yakni segala jenis kebaikan yang dilakukan di dunia. تَجِدُوهُ عِنْدَ اللَّهِ ۗ (tentu kamu akan mendapat pahala nya pada sisi Allah) Yakni pahala tersebut akan kalian dapatkan di sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Laksanakanlah sholat secara sempurna dengan syarat dan rukunnya dan tunaikanlah kewaiban zakat untuk yang berhak menerimanya. Amal kebaikan dan ketaatan yang kalian kerjakan di dunia, kelak akan kalian peroleh pahala itu di akhirat sebagai balasan dari Allah. Tidak ada sedikitpun atau bahkan sesuatu yang banyak, yang dapat tersembunyi dari pengawasan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dirikanlah shalat dan tunaikanlah zakat. Dan apa yang kamu kerjakan} dan apa yang kalian kerjakan dalam kehidupan kalian {untuk diri kalian berupa kebaikan, maka kalian akan mendapatkannya di sisi Allah. Sesungguhnya Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Kemudian Allah memerintahkan mereka untuk menyibukkan diri mereka pada saat ini dengan menegakkan shalat, menunaikan zakat, dan mengerjakan segala ibadah, dan Allah menjanjikan bagi mereka bbahwasanya bagaimanapun mereka melakukan suatu kebaikan, niscaya tidak akan disia-siakan. Bahkan mereka akan mendapatkan balasan dariNya dengan sempurna dan tidak kurang sedikitpun, karena telah dijaga olehNya. “Sesungguhnya Allah Maha Melihat apa-apa yang kamu kerjakan.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَأَقِيمُواْ ٱلصَّلَوٰةَ } Wa aqiimush shalaat : Mendirikan shalat adalah melaksanakannya pada waktunya dengan melengkapi syarat-syarat, rukun, dan sunnah shalat. { وَءَاتُواْ ٱلزَّكَوٰةَۚ } Wa aatuuz zakaat : Berikanlah zakat harta kalian dan berbuatlah segala perbuatan taat yang dapat menyucikan diri-diri kalian. Makna ayat : Pada ayat (110) Allah Ta’ala memerintahkan orang-orang mukmin untuk mendirikan shalat dan menunaikan zakat, serta melakukan perbuatan-perbuatan baik, untuk mendidik akhlak dan menyucikan diri mereka. Allah menjanjikan orang-orang mukmin akhir kehidupan yang baik di akhirat dalam firmanNya (إِنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ بَصِيرٞ ) “Sesungguhnya Allah Maha Melihat apa yang kalian kerjakan.” Pelajaran dari ayat : • Pada kondisi yang belum memungkinkan bagi kaum muslimin untuk berjihad, hendaknya mempersiapkan diri dengan hal-hal yang bermanfaat ketika berjihad. Yaitu dengan membina akhlak dan sisi ruhiyah serta menyucikan jiwa dengan melaksanakan shalat dan menunaikan zakat, serta melakukan berbagi perbuatan kebaikan. Hal itu akan menjaga sisi ruhiyah dan badaniyah kaum muslimin sampai datang waktu diizinkan untuk berjihad. • Menguatkan perasaan dengan merasa diawasi oleh Allah Ta’ala, agar seorang hamba senantiasa memperbagus niat dan amalannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 110: Kemudian memerintahkan orang – orang yang beriman untuk menjalankan sholat dengan kesempurnaan sebagaimana Allah syariatkan dan mengeluarkan zakat dari harta – harta mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin agar menyibukkan diri dengan shalat, zakat dan amal shalih lainnya serta tidak sibuk memikirkan orang-orang kafir yang berusaha mengembalikan mereka kepada kekafiran, dan bahwa amal shalih yang mereka kerjakan, niscaya akan mereka peroleh pahalanya di sisi Allah Azza wa Jall."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 110",
    "description": "Dan laksanakanlah salat sebagai ibadah badaniah dengan benar sesuai tuntunan, dan tunai kanlah zakat sebagai ibadah maliah, karena keduanya merupakan fondasi islam. Dan segala kebaikan yang kamu kerjakan untuk dirimu berupa salat, zakat, sedekah, atau amal-amal saleh lainnya, baik yang wajib maupun sunah, kamu akan mendapatkannya berupa pahala di sisi Allah. Sungguh, Allah maha melihat dan memberi balasan pahala di akhirat atas apa yang kamu kerja kan. Dan mereka, kaum yahudi dan nasrani, berkata, tidak akan masuk surga kecuali orang yahudi atau nasrani. Itu hanya angan-angan dan mimpi-mimpi mereka. Katakanlah kepada mereka, wahai Muhammad, tunjukkan bukti kebenaranmu dengan alasan-alasan yang meyakinkan, jika kamu orang yang benar dalam anggapanmu itu. Ketahuilah, kamu tidak akan pernah dapat menunjukkan bukti itu!"
  }
]