[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masing-masing dari Kaum Yahudi dan Nasrani mengaku bahwa surga hanya untuk menjadi milik golongan mereka saja tidak ada seseorang selain mereka yang akan memasukinya, itu adalah prasangka-prasangka mereka yang rusak. Katakanlah kepada mereka -wahai Rasul- datangkanlah bukti kalian yang menunjukkan kebenaran kalim-klaim kalian itu, bila kalian orang-orang yang benar dalam klaim tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Golongan Yahudi dan Nasrani masing-masing mengatakan bahwa surga hanya diperuntukkan bagi golongannya saja. Orang-orang Yahudi mengatakan, “Tidak akan masuk surga kecuali orang Yahudi.” Dan orang-orang Nasrani mengatakan, “Tidak akan masuk surga kecuali orang Nasrani.” Itu adalah harapan palsu dan khayalan hampa mereka. Katakanlah -wahai Nabi- untuk menjawab klaim mereka itu, “Berikanlah bukti yang mendukung klaim kalian, jika kalian benar dengan klaim tersebut.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Orang-orang Yahudi mengklaim bahwa surga hanya khusus bagi mereka, begitu pula orang-orang Nasrani mengklaim. Ini adalah angan-angan batil yang mereka harapkan dari Allah tanpa dasar, dan Allah telah memerintahkan Rasulullah untuk membantah mereka dengan meminta mereka mendatangkan bukti dan hujjah atas klaim yang mereka katakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَقَالُوا لَنْ يَدْخُلَ الْجَنَّةَ إِلَّا مَنْ كَانَ هُودًا أَوْ نَصَارَىٰ ۗ (Dan mereka (Yahudi dan Nasrani) berkata: “Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”) Yakni orang Yahudi berkata: tidak akan masuk surga kecuali orang Yahudi, dan orang Nasrani berkata: tidak akan masuk surga kecuali orang Nasrani. Setiap golongan menganggap golongan lain sesat. تِلْكَ أَمَانِيُّهُمْ ۗ( Demikian itu (hanya) angan-angan mereka yang kosong belaka) Yakni klaim mereka bahwa tidak akan masuk surga kecuali mereka adalah sebatas angan kosong yang mereka angan-angankan tanpa ada dalil dari kitab-kitab yang telah diturunkan Allah. قُلْ هَاتُوا بُرْهَانَكُمْ (Katakanlah: “Tunjukkanlah bukti kebenaranmu) Yakni “datangkanlah bukti-buktimu. Dan kata (الربهان) bermakna dalil yang dapat mengantarkan pada keyakinan. إِنْ كُنْتُمْ صَادِقِينَ (jika kamu adalah orang yang benar”) Yakni benar dalam angan-angan dan klaim-klaim sesat itu"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini menjadi dalil bahwa setiap orang yang mengklaim suatu perkara, dia perlu menguatkannya dengan bukti dan dalil, tetapi bukti itu tidak dapat diterima kecuali diambil dari apa yang telah Allah turunkan kepada Nabi-Nya sebagaimana yang telah disebutkan di ayat sebelum ayat ini, ketika suatu kaum mengkalim bahwa mereka tidak akan dimakan api neraka kecuali dalam tempo yang singkat : { وَقَالُوا لَنْ تَمَسَّنَا النَّارُ إِلَّا أَيَّامًا مَعْدُودَةً ۚ قُلْ أَتَّخَذْتُمْ عِنْدَ اللَّهِ عَهْدًا فَلَنْ يُخْلِفَ اللَّهُ عَهْدَهُ ۖ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لَا تَعْلَمُونَ } \"Dan mereka berkata: “Kami sekali-kali tidak akan disentuh oleh api neraka, kecuali selama beberapa hari saja”. Katakanlah: “Sudahkah kamu menerima janji dari Allah sehingga Allah tidak akan memungkiri janji-Nya, ataukah kamu hanya mengatakan terhadap Allah apa yang tidak kamu ketahui?\". 2 ). Syari'at saat ini kita berjalan diatasnya dikuatkan oleh dalil dan burhan, setiap jejak yang terkandung didalamnya selalu diikuti dengan hujjah, dan dalil dari al-Qur'an dan sunnah, maka tidaklah kita mengatakan : \"saya yakin kamu akan buta\" tetapi ia tidak memiliki bukti, maka tatkala orang Yahudi dan Nashrani mengatakan klaim mereka terhadap selainnya : { وَقَالُوا لَنْ يَدْخُلَ الْجَنَّةَ إِلَّا مَنْ كَانَ هُودًا أَوْ نَصَارَىٰ } \"Dan mereka (Yahudi dan Nasrani) berkata: \"Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani\" , Allah kemudian membalas perkataan mereka dengan : { قُلْ هَاتُوا بُرْهَانَكُمْ إِنْ كُنْتُمْ صَادِقِينَ } \"Tunjukkanlah bukti kebenaranmu jika kamu adalah orang yang benar\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kaum Yahudi berkata: “Hanya orang-orang Yahudi-lah yang kelak akan masuk surga.” Kaum Nasrani juga berkata: “Hanya orang-orang Nasrani-lah yang kelak akan masuk surga.” Itu semua semata-mata hanyalah angan-angan dan syahwat yang mereka lakukan tanpa disertai kebenaran. Katakanlah kepada mereka wahai Nabi: “Tunjukkan bukti dan landasan kalian atas apa yang kalian katakan itu! Jika klaim dan pernyataan kalian yang sejatinya keliru itu kalian anggap benar.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Tidak akan masuk surga kecuali orang Yahudi} orang Yahudi {atau Nasrani.”} atau orang Nasrani {Itu (hanya) angan-angan mereka} angan-angan mereka yang busuk {Katakanlah,“Tunjukkan bukti kebenaran kalian} argumen kalian {jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. Maksudnya, orang-orang Yahudi berkata, “Tidaklah akan masuk surge kecuali orang Yahudi, ” dan orang-orang Nasrani berkata, “Tidaklah akan masuk surge kecuali orang Nasrani.” Mereka menentukan bahwa surga itu bagi mereka sendiri, namun hal ini hanya sebatas angan-angan kosong belaka yang tidak dapat diterima kecuali dengan hujjah dan keterangan yang jelas, maka berikanlah hujjah dan keterangan yang jelas jikalau kalian adalah orang-orang yang benar, demikianlah seharusnya bagi orang yang mengaku dengan suatu pengakuan bahwa dia harus memberikan keterangan dan hujjahnya untuk membenarkan pengakuannya tersebut, namun bila dia tidak memberikannya maka pengakuannya itu dikembalikan kepadanya dan jika ada seseorang yang mengaku dengan hal yang bertentangan dengan pengakuan yang tadi juga tanpa ada keterangan dan hujjah, maka tidaklah ada perbedaan antara kedua pengakuan tersebut. Bukti nyata (burhan) adalah hal yang membenarkan pengakuan atau mendustakannya, dan ketika mereka semua tidak memiliki keterangan yang jelas, maka diketahuilah kebohongan mereka dalam pengakuan tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلۡجَنَّةَ } al-Jannah : Surga, dinamakan sebagai negeri yang penuh kenikmatan. Dinamakan juga sebagai daarussalam yaitu negeri keselamatan. Letak surga ada di atas langit ketujuh. { هُودًا } Huudan : Orang-orang Yahudi { نَصَٰرَىٰۗ } Nashaaraa : Kaum salibis dan pengikut Isa al-Masih {أَمَانِيُّهُمۡۗ } Amaaniyyuhum : Amaaniy bentuk jamak dari umniyah, yaitu apa yang dimimpikan oleh seseorang tanpa berusaha untuk merealisasikannya. Hal ini disebut sebagai angan-angan semu. { البرهان } al-Burhan : Argumen yang kuat dan jelas. Makna ayat : Sebab turunnya ayat ini adalah ketika datang utusan kaum Nasrani Najran ke kota Madinah, bertemulah dengan orang Yahudi di majelis Nabi Muhammad ﷺ. Sebelumnya sudah terjadi permusuhan di antara mereka, akhirnya pun kembali berlanjut. Orang Yahudi mengklaim bahwa surga hanya akan dimasuki oleh mereka saja, dan orang Nasrani mengklaim bahwa surga hanya dimasuki oleh mereka saja. Maka Allah Ta’ala membantah mereka serta mematahkan klaim mereka dengan meminta bukti yang kuat atas anggapan mereka itu. Namun, mereka tidak mampu untuk mendatangkannya, lantas Allah menetapkan bahwa yang dapat masuk surga adalah orang yang menyucikan jiwanya dengan keimanan yang benar dan amalan shalih. Pelajaran dari ayat : • Peniadaan pengaruh antara ras keturunan dengan kehidupan yang bahagia atau sengsara. Dan penetapan bahwa kebahagiaan dapat memasuki surga kembalinya kepada penyucian jiwa dengan beriman dan beramal shalih. Adapun kesengsaraan memasuki neraka sebabnya karena kesyirikan, dan melakukan kemaksiatan. Oleh karena itu tidak berpengaruh ketika seseorang menisbatkan diri kepada agama Yahudi, Nasrani, atau selainnya. Karena yang mempengaruhi seseorang masuk surga setelah keutamaan dan rahmat Allah, adalah keimanan dan amalan shalih yang bersih dari noda kesyirikan dan maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 111: Allah mengabarkan bahwasannya yahudi mendakwakan tidak masuk kedalam surga kecuali siapa yang menjadi yahudi, dan nasrani mendakwakan tidak masuk surga kecuali siapa yang menjadi nasrani, kemudian Allah mengabarkan bahwasannya dakwaan ini adalah bathil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang Yahudi mengatakan, mereka saja yang akan masuk surga. Orang Nasrani berkata, mereka saja yang akan masuk surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 111",
    "description": "Dan mereka, kaum yahudi dan nasrani, berkata, tidak akan masuk surga kecuali orang yahudi atau nasrani. Itu hanya angan-angan dan mimpi-mimpi mereka. Katakanlah kepada mereka, wahai Muhammad, tunjukkan bukti kebenaranmu dengan alasan-alasan yang meyakinkan, jika kamu orang yang benar dalam anggapanmu itu. Ketahuilah, kamu tidak akan pernah dapat menunjukkan bukti itu! tidak! mereka berdusta. Yang akan memasuki surga bukan hanya yahudi atau nasrani, melainkan barang siapa yang menyerahkan diri, tunduk, patuh, taat, ikhlas sepe nuhnya kepada Allah, dan dia berbuat baik, beriman, membenarkan, dan mengikuti apa yang dibawa oleh rasulullah, dia mendapat pahala di sisi tuhannya dan tidak ada rasa takut pada mereka di akhirat dan mereka tidak bersedih hati. Mereka kekal dalam kenikmatan."
  }
]