[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kenyataannya tidak seperti apa yang mereka sangkakan bahwa surga hanya khusus untuk satu golongan tanpa menyertakan orang dari golongan lainnya, karena sesungguhnya yang akan masuk surga hanyalah orang-orang yang menyerahkan diri kepada Allah Semata yang tiada sekutu baginya, dan mengikuti Rasulullah Shallallahu Alaihi Wasallam dalam setiap ucapan dan perbuatannya. Barangsiapa mengerjakan hal itu maka baginya pahala amalnya di sisi Tuhannya di akhirat, yaitu masuk surga, dan mereka itu tidak merasa takut terhadap apa yang akan mereka hadapi dari urusan akhirat, dan tidak merasa bersedih atas kesenangan-kesenangan dunia yang luput mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Sesungguhnya surga itu akan dimasuki oleh setiap orang yang tulus dan ikhlas kepada Allah serta melaksanakan ibadah dengan baik, yaitu dengan mengikuti ajaran Rasulullah. Itulah sifat orang yang akan masuk surga dari golongan manapun. Dia akan mendapatkan ganjaran dari Allah. Tidak ada kekhawatiran terhadap mereka dalam menghadapi apa yang akan terjadi di akhirat nanti. Dan mereka juga tidak pernah bersedih hati atas kenikmatan dunia yang dilewatkannya. Sifat-sifat tersebut -setelah kedatangan Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- tidak terpenuhi kecuali pada diri kaum muslimin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Masuk surga bukanlah dengan angan-angan, namun orang yang masuk surga adalah orang yang mengikhlaskan ibadah kepada Allah dan mengikuti jejak Rasulullah; barangsiapa yang melakukan itu maka baginya balasan surga dari Allah, ia tidak akan takut dari azab dan tidak akan bersedih akibat kenikmatan dunia yang tidak ia dapatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. بَلَىٰ (Tidak demikian) Yakni tidak demikian, akan tetapi yang akan masuk surga adalah مَنْ أَسْلَمَ وَجْهَهُ لِلَّهِ( yang menyerahkan diri kepada Allah) Yakni yang menyerahkan dirinya kepada Allah, dan ikhlas dalam beramal dari golongan manusia manapun. وَهُوَ مُحْسِنٌ(sedang ia berbuat kebajikan) Yakni sekaligus melakukan amal kebaikan yang sesuai dengan syaria’at yang dibawa oleh masing-masing rasul mereka.."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Tidak seperti itu! Tidak seperti yang kalian katakan. Orang yang akan masuk surga adalah mereka yang berserah diri kepada Allah dan mereka yang sepenuh hati dan ikhlas dalam beragama dan dalam menghamba kepada Allah. Juga mereka yang berbuat baik, maka pada hari kiamat mereka akan mendapatkan pahala atas iman dan amal yang telah mereka lakukan. Mereka tidak takut atas siksa orang kafir, mereka juga tidak pernah bersedih atas dunia yang hilang dari mereka. Bahkan mereka semua diliputi oleh ketenangan dan kenikmatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak demikian. Orang yang menyerahkan diri sepenuhnya kepada Allah} Sesungguhnya yang masuk surga adalah orang yang ikhlas dalam urusannya kepada Allah {dan berbuat kebaikan} dia mengikuti (ajaran) Rasulullah SAW {maka baginya itu pahala di sisi Tuhannya, tidak ada rasa takut yang menimpa mereka, dan mereka pun tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. Kemudian Allah menyebutkan keterangan yang jelas dan bersifat umum bagi setiap orang seraya berfirman, “(tidak demikian) tentu, ” maksudnya tidak seperti angan-angan dan klaim kalian, akan tetapi “barangsiapa yang menyerahkan diri kepada Allah,” maksudnya mengikhlaskan segala perbuatannya dan dengan menyerahkan hatinya kepadaNya, ”sedang ia” dengan keikhlasannya itu, ”berbuat kebajikan” dalam menyembah Rabbnya dengan menyambahNya sesuai syariatNya, maka mereka itulah penghuni surga dengan segala kenikmatan yang ada padanya, “dan tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati, ” mereka memperoleh apa yang diharapkan dan terhindar dari apa yang dikhawatirkan. Dapat dipahami dari sini bahwa barangsiapa yang berbeda dengan keterangan distas, maka dia adalah penghuni neraka lagi sengsara. Oleh karena itu, tidaklah ada keselamatan kecuali bagi orang-orang yang ikhlas dalam beribadah kepada tuhannya dan mengikuti Sunnah Rosululloh Sholallohu 'alaihi wasallam"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بلى } Balaa : Huruf yang digunakan sebagai jawaban untuk kata tanya yang bersambung dengan penafian, seperti dalam firman Allah Ta’ala ( أليس الله بأحكم الحاكمين ) “Bukankah Allah hakim yang seadil-adilnya” (QS at-Tin : 8) jawabannya adalah Balaa. Yaitu benar Dialah Allah hakim yang seadil-adilnya. Ketika kaum Yahudi dan Nasrani mengklaim bahwa surga hanya dapat dimasuki oleh orang-orang Yahudi dan Nasrani saja, Allah Ta’ala membantahnya : Balaa Tidak benar seperti itu perkaranya seperti yang kalian klaim itu. Orang Yahudi dan Nasrani tidak akan masuk surga, akan tetapi yang akan memasukinya adalah orang-orang yang berserah diri kepada Allah dan berbuat kebaikan, yaitu hamba yang beriman dan membenarkan serta beramal shalih dan memperbagus amalannya. Makna ayat : Allah Ta’ala berfirman (بَلَىٰۚ مَنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ ) “(Tidak demikian) dan bahkan barangsiapa yang menyerahkan diri kepada Allah, sedang ia berbuat kebajikan.” Yaitu orang yang menyucikan hatinya, raganya dan kemudian beriman, bertauhid, beramal shalih dan memperbagus amalannya, maka orang itulah yang akan masuk surga. Pahala yang didapat karena sebab keimanan dan amalan shalihnya, maka dia tidak akan merasa takut maupun bersedih. Pelajaran dari ayat : • Kekafiran Yahudi dan Nasrani dan itulah seburuk-buruk kekafiran karena mereka dahulu telah mengetahui. • Agama Islam yang benar berdiri di atas tiga landasan :Iman, Islam, dan Ihsan. Itulah jalan keselamatan dari neraka dan sukses meraih surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 112: Sesungguhnya Allah mendustakan mereka berdua dengan berkata: tidaklah masuk surga kecuali siapa yang ikhlas perkataan, amalannya untuk Allah saja tanp[a menyekutukannya dan mengikuti petunjuk yang datang para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahkan yang masuk surga adalah orang yang berbuat ikhlas kepada Allah dan mengikuti Rasulullah shallallahu 'alaihi wa sallam dalam ucapan dan tindakannya. Barangsiapa yang melakukan demikian, maka dia akan memperoleh pahala amalnya di sisi Tuhannya di akhirat, yaitu masuk ke surga dengan segala kenikmatan yang ada di dalamnya, sedangkan mereka tidak merasa takut terhadap hal yang akan datang dari perkara akhirat dan tidak merasa sedih karena tidak memperoleh keuntungan-keuntungan dunia. Berdasarkan ayat ini, yang berhak masuk surga adalah orang yang ikhlas dan mengikuti Rasulullah shallallahu 'alaihi wa sallam (orang-orang muslim)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 112",
    "description": "Tidak! mereka berdusta. Yang akan memasuki surga bukan hanya yahudi atau nasrani, melainkan barang siapa yang menyerahkan diri, tunduk, patuh, taat, ikhlas sepe nuhnya kepada Allah, dan dia berbuat baik, beriman, membenarkan, dan mengikuti apa yang dibawa oleh rasulullah, dia mendapat pahala di sisi tuhannya dan tidak ada rasa takut pada mereka di akhirat dan mereka tidak bersedih hati. Mereka kekal dalam kenikmatan. Dan orang yahudi berkata, orang nasrani itu tidak memiliki sesuatu, yakni pegangan berupa agama yang benar, padahal nabi isa telah datang kepada mereka, lalu mereka menging karinya. Dan orangorang nasrani juga berkata, orang-orang yahudi tidak memiliki sesuatu, yakni pegangan beru pa agama yang benar, padahal nabi musa telah datang kepada mereka, lalu mereka mengingkarinya. Padahal, mereka membaca kitab, yakni taurat bagi orang yahudi dan injil bagi orang nasrani. Apa yang disebutkan dalam ayat ini merupakan isi perdebatan antara yahudi dan nasrani di hadapan rasulullah. Rafi bin armalah, seorang yahudi, mengatakan kepada orang nasrani, kalian tidak punya suatu pegangan dan telah kafir terhadap isa dan injil. Seorang nasrani dari najran lalu menanggapinya, kalian juga tidak punya suatu pegangan dan telah kafir terhadap musa dan taurat. Demikian pula orang-orang musyrik arab yang tidak berilmu; mereka berkata seperti ucapan me-reka, ahli kitab, itu. Maka Allah akan mengadili mereka pada hari kiamat, tentang apa yang mereka perselisihkan dalam soal agama."
  }
]