[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang Yahudi berkata, “orang-orang Nasrani itu sedikitpun tidak berada di atas ajaran agama yang benar”. Demikian pula kaum Nasrani mengatakan itu terhadap kaum Yahudi padahal mereka semua membaca Taurat dan Injil yang didalamnya termuat kewajiban beriman kepada seluruh Nabi. Begitu pula orang-orang yang tidak mengetahui dari kalangan kaum musyrikin Arab dan lainnya mengatakan ungkapan serupa dengan mereka, maksudnya mereka berkata kepada setiap penganut agama, “kamu tidak berada di atas asas yang benar sedikitpun”. Maka Allah akan mengadili diantara mereka pada hari kiamat tentang apa apa yang mereka perselisihkan dalam perkara agama, dan masing-masing akan dibalas sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Orang-orang Yahudi berkata, “Orang-orang Nasrani itu tidak menganut agama yang benar.” Dan orang-orang Nasrani berkata, “Orang-orang Yahudi itu tidak menganut agama yang benar.” Padahal mereka semua membaca kitab-kitab suci yang Allah -Ta'ālā- turunkan kepada mereka, dan di dalamnya ada perintah untuk beriman kepada semua Nabi tanpa membeda-bedakan antara yang satu dengan yang lain. Perbuatan mereka itu mirip dengan ucapan orang-orang musyrik yang tidak berilmu ketika mereka mendustakan semua Rasul berikut kitab-kitab suci yang diturunkan kepada mereka. Oleh karena itulah Allah akan memberikan keputusan bagi semua orang yang berselisih paham kelak pada hari kiamat. Allah akan memberi mereka keputusan yang adil, yang telah Dia sampaikan kepada hamba-hamba-Nya, bahwasa tidak ada keberuntungan bagi siapapun kecuali dengan mengimani semua kitab suci yang diturunkan oleh Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Orang-orang Yahudi menuduh orang-orang Nasrani bahwa mereka tidak berada dalam kebenaran sama sekali, begitu pula orang-orang-orang Nasrani menuduh orang-orang Yahudi; padahal keduanya telah membaca Taurat dan injil. Begitu juga orang-orang musyrik Arab menuduh Nabi Muhammad. Allah-lah yang akan memutuskan perkara yang mereka semua perselisihkan dalam urusan agama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَىٰ عَلَىٰ شَيْءٍ وَقَالَتِ النَّصَارَىٰ لَيْسَتِ الْيَهُودُ عَلَىٰ شَيْءٍ (Dan orang-orang Yahudi berkata: “Orang-orang Nasrani itu tidak mempunyai suatu pegangan”, dan orang-orang Nasrani berkata: “Orang-orang Yahudi tidak mempunyai sesuatu pegangan”) Yakni setiap golongan menafikan kebaikan golongan lain dan mengaklaim untuk golongannya sendiri, dan mengingkari kebenaran yang ada pada golongan lain. Hal ini adalah perbuatan orang yang tidak obyektif, karena orang yang obyektif adalah yang mengakui kebenaran yang ada pada lawannya dan menjelekkan keburukan yang ada pada dirinya dan tidak membawa kebencian dalam menyebarkan kebenaran. Diriwayatkan dari Ibnu Abbas, Ia berkata: ketika datang utusan kaum Nasrani dari Najran kepada Rasulullah tiba-tiba datang uskup Yahudi (benama Rafi bin Huraimalah) kemudian terjadi perdebatan dengan Rasulullah. Rafi’ bin Huraimalah berkata: kalian itu tidak mempunyai suatu pegangan, mengingkari kenabian Musa, dan kafir terhadap Taurat. Kemudian Allah pun menurunkan ayat ini. وَهُمْ يَتْلُونَ الْكِتَابَ ۗ(padahal mereka (sama-sama) membaca Al Kitab) Yakni padahal mereka semua membaca dalam kitab mereka kebenaran yang mereka ingkari. كَذَٰلِكَ قَالَ الَّذِينَ لَا يَعْلَمُونَ(Demikian pula orang-orang yang tidak mengetahui) Mereka adalah umat-umat sebelum umat Yahudi dan Nasrani yang tidak mempunyai pengetahuan tentang kitab-kitab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Seluruh kelompok Yahudi dan Nasrani menuduh kelompok selain mereka adalah salah. Padahal, yang benar adalah bahwa setiap keterangan dari kitab yang diturunkan adalah saling membenarkan satu sama lain. Yang lebih buruk dari itu, ada orang-orang musyrik yang bodoh yang berkata, padahal dia tidak mempunyai ilmu dan juga tidak mempunyai kitab. Mereka berkata: “Mereka itu semua (Yahudi dan Nasrani) bukanlah penyeru kepada agama yang benar sama sekali.” Sesungguhnya, kelak pada hari kiamat Allah Maha memberi putusan tentang klaim-klaim sepihak perihal agama yang manusia perselisihkan. Allah akan tunjukkan kepada mereka kebenaran tentang hal yang mereka perdebatkan. Sebab turunnya ayat ini adalah ketika Yahudi Madinah dan Nasrani Najran saling berdebat. Kaum Yahudi berkata: “Kalian (orang Nasrani) tidak punya pegangan atas agama yang benar.” Orang Yahudi mengingkari kenabian Isa dan kitab Injil. Adapun orang Nasrani juga berkata: “Kalian (orang Yahudi) tidak punya pegangan atas agama yang benar.” Orang Nasrani juga tidak percaya terhadap kenabian nabi Musa dan kitab Taurat. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang Yahudi berkata, “Orang Nasrani itu tidak menganut sesuatu apapun”} atas agama yang benar yang dianut {dan orang-orang Nasrani berkata, “Orang-orang Yahudi tidak menganut sesuatu apapun,” padahal mereka membaca Kitab. Demikian pula orang-orang yang tidak mengetahui berkata} orang-orang musyrik dari bangsa Arab dan yang lainnya {seperti ucapan mereka itu. Allah akan menentukan hukum} memberi putusan {di antara mereka pada hari Kiamat tentang apa yang mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. Yang demikian itu disebabkan karena orang-orang ahli kitab menyimpan hawa nafsu dan dengki yang besar hingga sebagian mereka menyesatkan sebagian lain, dan sebagian lagi mengkafirkan sebagian lain sebagaimana yang dilakukan oleh orang-orang yang tidak membaca dan menulis dari kaum Musyrikin Arab dan selainnya, setiap kelompok menyesatkan kelompok lainnya. Dan Allah akan menghakimi di antara kelompok-kelompok yang bertikai itu dengan ketetapnNya yang adil yang telah dikabarkan kepada hamba-hambaNya, maka tidaklah ada keberhasilan dan tidak juga ada keselamatan kecuali bagi orang yang mempercayai seluruh Rosul dan nabi, dan mentaati perintah-perintah Rabbnya, menjauhi larangan-laranganNya; sedangkan orang yang selain mereka, maka dia termasuk yang binasa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { لَيۡسَتِ على شيئ } Laisat ‘ala syaii’ : Tidak berada di atas agama yang benar { يَتۡلُونَ ٱلۡكِتَٰبَۗ } Yatluunal kitaab : Yang dimaksud dengan kitab adalah Taurat dan Injil { الذين من قبلهم } Alladziina min qoblihim : Lafadz ini cocok bila ditujukan kepada orang-orang muysrik Arab, dan selain mereka umat-umat yang sebelumnya. Makna ayat : Pada ayat 113 menerangkan bahwa telah tercatat kekafiran orang-orang Yahudi maupun Nasrani. Dengan bukti persaksian bahwa mereka saling mengkafirkan satu sama lain. Yahudi mengkafirkan Nasrani dengan ucapannya “Mereka tidak berada di atas agama yang benar dan diperhitungkan.” Sedangkan orang Nasrani mengkafirkan Yahudi dengan ucapan,”Yahudi bukan apa-apa (tidak berada di atas agama yang benar) walaupun mereka membaca Taurat dan Injil.” Oleh karena itu saling mengkafirkan di antara mereka adalah realitas yang nyata. Kemudian Allah Ta’ala mengabarkan bahwa kekufuran dan kesesatan yang menimpa ahli kitab yaitu Yahudi dan Nasrani, juga menimpa umat-umat sebelumnya tanpa mereka ketahui, disebabkan oleh kebodohan mereka. Dan Allah Ta’ala memberitahukan bahwa Dia akan menjadi hakim di antara mereka pada hari kiamat dan akan membalas atas kekafiran dan kesesatan yang mereka perbuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 113: Allah mengabarkan bahwasannya seluruh dari yahudi dan nasrani tidak mengetahui tentang akhirat meskipun mereka membaca taurat dan injil, mereka mengetahui apa yang ada didalam keduanya dari kewajiban imam atas seluru rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal dalam Taurat dan Injil terdapat kewajiban beriman kepada semua nabi. Dari kalangan kaum musyrik. Di akhirat, Allah Subhaanahu wa Ta'aala akan memutuskan perkara antara kedua pihak yang berselisih dengan keputusan-Nya yang adil dan bahwa tidak ada yang selamat kecuali mereka yang beriman kepada semua nabi dan rasul, mengikuti perintah Tuhannya dan menjauhi larangannya, selain itu adalah orang-orang yang binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 113",
    "description": "Dan orang yahudi berkata, orang nasrani itu tidak memiliki sesuatu, yakni pegangan berupa agama yang benar, padahal nabi isa telah datang kepada mereka, lalu mereka menging karinya. Dan orangorang nasrani juga berkata, orang-orang yahudi tidak memiliki sesuatu, yakni pegangan beru pa agama yang benar, padahal nabi musa telah datang kepada mereka, lalu mereka mengingkarinya. Padahal, mereka membaca kitab, yakni taurat bagi orang yahudi dan injil bagi orang nasrani. Apa yang disebutkan dalam ayat ini merupakan isi perdebatan antara yahudi dan nasrani di hadapan rasulullah. Rafi bin armalah, seorang yahudi, mengatakan kepada orang nasrani, kalian tidak punya suatu pegangan dan telah kafir terhadap isa dan injil. Seorang nasrani dari najran lalu menanggapinya, kalian juga tidak punya suatu pegangan dan telah kafir terhadap musa dan taurat. Demikian pula orang-orang musyrik arab yang tidak berilmu; mereka berkata seperti ucapan me-reka, ahli kitab, itu. Maka Allah akan mengadili mereka pada hari kiamat, tentang apa yang mereka perselisihkan dalam soal agama. Dan siapakah yang lebih zalim, berdosa, memusuhi Allah, dan menentang perintah-Nya dari pada orang yang melarang di dalam masjidmasjid Allah untuk beribadah dan menyebut nama-Nya, dan berusaha merobohkannya dengan menghentikan syiar-syiar agama di dalamnya, merusak kesucian agama yang menyebabkan mereka melupakan penciptanya, menyebarkan kemungkaran di masyarakat, dan membuat kerusakan di bumi' mereka tidak pantas mema sukinya kecuali dengan rasa takut, tunduk, taat, dan patuh kepada Allah. Mereka mendapat kehinaan di dunia sebagai akibat dari kezaliman mereka, dan di akhirat mendapat azab yang berat dalam neraka jahanam yang merupakan tempat menetap yang paling hina. Ayat ini Allah turunkan sebagai jawaban atas sikap kaum kafir mekah yang mela rang nabi Muhammad salat di masjidilharam."
  }
]