[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada seorangpun yang lebih dzolim dari orang-orang yang mencegah manusia dari dzikir kepada Allah di dalam masjid-masjid dalam bentuk menegakkan shalat, membaca al-quran, dan amal-amal semacamnya, dan mereka bersungguh-sungguh untuk menghancurkan masjid-masjid itu dengan merobohkannya, menutup atau menghalangi kaum Mukminin darinya. Orang-orang zalim itu tidak sepatutnya bagi mereka untuk memasuki masjid-masjid kecuali dengan rasa takut dan cemas terhadap siksaan Allah. Dikarenakan perbuatan mereka itu mereka akan mendapatkan kehinaan dan terbongkarnya aib mereka di dunia, dan mereka akan mendapatkan siksaan yang keras di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Tidak ada yang lebih zalim dari orang yang melarang disebutnya nama Allah di masjid-masjid-Nya; dia melarang salat, zikir dan membaca Al-Qur`ān di masjid. Dan dia berusaha keras untuk mengosongkan dan merusak masjid dengan cara merobohkan bangunannya atau melarang kegiatan ibadah di masjid. Orang-orang yang berusaha merobohkan masjid-masjid Allah itu tidak sepatutnya masuk ke dalam masjid kecuali dalam keadaan ketakutan dan hati yang gemetar, karena mereka menyimpan kekafiran dan menghalangi-halangi umat untuk memakmurkan masjid-masjid Allah. Mereka akan mendapatkan kehinaan dan kenistaan di dunia di tangan orang-orang mukmin. Dan di akhirat mereka akan mendapatkan azab yang berat karena menghalang-halangi manusia dari masjid-masjid Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Allah mengacam dan mengolok orang-orang yang melarang orang lain beribadah kepada-Nya di masjid-masjid dan selalu berusaha menghancurkan masjid-masjid tersebut. Allah menyebut mereka dengan orang-orang yang paling zalim. Mereka tidak layak memasuki masjid melainkan dengan rasa takut dan khawatir dari siksaan Allah. Balasan mereka di dunia adalah kehinaan dan kerendahan, sedangkan di akhirat mereka akan mendapat azab yang berat dan pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. وَمَنْ أَظْلَمُ (Dan siapakah yang lebih aniaya) Yakni tidak ada yang lebih zalim مِمَّنْ مَنَعَ مَسَاجِدَ اللَّهِ أَنْ يُذْكَرَ فِيهَا اسْمُهُ(daripada orang yang menghalang-halangi menyebut nama Allah dalam mesjid-mesjid-Nya) Yakni melarang orang yang datang ke masjid untuk melaksanakan sholat, membaca al-Qur’an, berzikir, atau menajarkan al-Qur’an. وَسَعَىٰ فِي خَرَابِهَا ۚ (dan berusaha untuk merobohkannya?) Yakni merusaha merobohkannya dan menghilangkan bangunannya, atau menghentikan kegiatan-kegiatannya seperti sholat dan ketaatan lainnya seperti belajar dan beriktikaf. مَا كَانَ لَهُمْ أَنْ يَدْخُلُوهَا إِلَّا خَائِفِينَ ۚ (Mereka itu tidak sepatutnya masuk ke dalamnya (mesjid Allah), kecuali dengan rasa takut (kepada Allah)) Yakni seharusnya bereka memasuki masjid-masjid itu dengan penuh rasa takut kepada Allah karena itu adalah tempat ibadah mereka. Pada ayat ini terdapat petunjuk dari Allah untuk hamba-hambaNya agar melarang orang-orang kafir untuk memasuki masjid. Namun dalam ayat ini pula Allah memberi izin kita untuk memasukkan orang kafir ke masjid apabila telah mendapat izin dari kita dan masuk dengan penuh rasa takut. لَهُمْ فِي الدُّنْيَا خِزْيٌ(Mereka di dunia mendapat kehinaan) Yakni mereka yang merobohkan masjid-masjid dan melarang berzikir di dalamnya akan mendapat kehinaan dari Allah lewat tangan-tangan orang yang berjihad di jalan Allah. وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ(dan di akhirat mendapat siksa yang berat) Yakni siksa di nereka Jahannam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Wahai Allah engkau tahu bahwasanya mereka telah melakukan dua kejahatan : mereka melarang orang-orang beriman berdzikir meneyebut nama-Mu di masjid-masjid Mu bahkan mereka merubuhkannya, dan mereka juga membunuh hamba-hamba Mu yang beribadah dan sebagian lagi disiksa oleh mereka, maka percepatlah penghinaan terhadap mereka dan azablah mereka. 2 ). Jarang sekali para pembangkan yang berbuat kerusakan di muka bumi kecuali Allah menghinakan mereka sebelum kematian menjemput, kemudian mereka pun akan dihinakan oleh orang-orang kecil maupun besar, dan kehinaan mereka menjadi bahan pembicaraan di majlis-majlis, Ibnu katsir berkata : \"tatkala mereka menyombongkan diri, Allah menemui mereka dengan kehinaan di dunia sebelum kehinaan yang lebih besar di akhirat\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Tidak ada yang lebih dholim, dari pada mereka yang melarang orang masuk masjid untuk beribadah kepada Allah, lebih-lebih mereka juga berusaha merobohkannya. Merekalah kumpulan pendosa, tidak ada yang lebih patut bagi mereka kecuali mereka masuk masjid dengan penuh ketakutan atas azab Allah. Kesesatan dan kehinaan bagi mereka di dunia, dan azab yang pedih di neraka telah menanti mereka di akhirat. Ibnu Abbas berpendapat, bahwa ayat ini ditujukan untuk orang-orang musyrik Makkah yang melarang kaum Muslim untuk beribadah kepada Allah di Masjidil Haram. Mereka juga melarang Nabi Muhammad SAW sholat di depan Ka’bah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih zalim} tidak ada satupun yang lebih parah kezalimannya {daripada orang yang melarang masjid-masjid Allah digunakan sebagai tempat berzikir di dalamnya dan berusaha merobohkannya} merobohkan atau menjauhkannya dari ketaatan {Mereka itu tidak pantas memasukinya, kecuali dengan rasa takut (kepada Allah). Bagi mereka itu kehinaan di dunia dan azab yang berat di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114. Maksudnya, tidak ada seorang pun yang lebih zhalim dan lebih jahat daripada orang yang menghalang-halangi menyebut nama Allah, mendirikan shalat, dan ibadah ketaatan lainnya dalam masjidNya, “dan berusaha” yaitu bersungguh-sungguh dan mengerahkan segala kemampuannya “untuk merobohkannya, ” baik dengan fisik maupun maknawi. Makna merobohkannya dalam bentuk fisik adalah menghancurkan, membongkar dan mengotorinya, sedangkan merobohkannya dalam bentuk maknawi adalah menghalangi orang-orang dari berdzikir kepada Allah didalamnya. Keterangan ini bersifat umum bagi setiap orang yang berciri dengan sifat-sifat seperti itu. Oleh karena itu, termasuk di dalamnya bala tentara gajah Abrahah dan orang-orang Quraisy yang menghalangi Rosululloh dari Ka’bah dalam peristiwa Hudaibiyah, dan juga Nasrani ketika mereka mengahancurkan Baitul Maqdis dan selain mereka dari orang-orang zhalim yang berusaha menghancurkannya sebagai bentuk permusuhan kepada Allah dan peperangan terhadapNya, lalu Allah membalas mereka dengan melarang mereka memasukinya secara syar’I maupun takdir penciptaan kecuali mereka dalam kondisi terhina dan takut, dan ketika mereka menimbulkan rasa ketakutan bagi hamba-hamba Allah, maka Allah menciptakan ketakutan bagi mereka. Adapun kondisi orang-orang musyrik yang menghalangi Rosululloh, tak lama kemudian Allah mengizinkan beliau untuk menaklukkan mereka pada Fathu Makkah dan kemudian melarang kaum musyrikin untuk mendekati rumahNya. Maka Allah berfirman : \"Hai orang-orang yang beriman, Sesungguhnya orang-orang yang musyrik itu najis, maka janganlah mereka mendekati Masjidilharam sesudah tahun ini. Dan jika kamu khawatir menjadi miskin, maka Allah nanti akan memberimu kekayaan kepadamu dari karunia-Nya, jika Dia menghendaki. Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.\" QS. At-Taubah : 28 Adapun bala tentara gajah, maka Allah telah menyebutkan kisahnya (dalam surat Al-Fil) dan apa yang telah menimpa mereka, dan juga Nasrani, maka Allah menjadikan kaum Muslimin menguasai mereka hingga mampu mengusir mereka dari Baitul Maqdis. Seperti itulah bagi setiap orang yang berciri seperti mereka di mana pasti akan mendapatkan bagiannya. Ini semua adalah di antara ayat-ayat agung yang dikabarkan oleh Allah sebelum terjadi yang pada akhirnya terbukti terjadi sesuai dengan apa yang Dia kabarkan. Dan para ulama mengambil ayat ini sebagai dalil bahwasanya tidak boleh memberi kesempatan bagi kaum kafir untuk memasuki masjid-masjid. “Mereka di dunia mendapat kehinaan, ” yaitu celaan, sebagaimana yang telah dijelaskan, “dan di akhirat mereka mendapat siksa yang berat.” Apabila tidak ada yang lebih zhalim daripada para penghalang yang menghalangi orang-orang yang berdzikir kepadaNya dalam masjidNya, maka tidak ada juga yang lebih beriman daripada orang-orang yang memakmurkan dengan fisik maupun maknawi. Sebagaimana firman-Nya : \"Hanya yang memakmurkan masjid-masjid Allah ialah orang-orang yang beriman kepada Allah dan Hari kemudian, serta tetap mendirikan shalat, menunaikan zakat dan tidak takut (kepada siapapun) selain kepada Allah, maka merekalah orang-orang yang diharapkan termasuk golongan orang-orang yang mendapat petunjuk.\" QS. At-Taubah : 18 Bahakan Allah telah memerintah untuk meninggikan, mangagungkan dan memuliakan rumah-Nya sebagaiaman firman-Nya : \"Bertasbih kepada Allah di masjid-masjid yang telah diperintahkan untuk dimuliakan dan disebut nama-Nya di dalamnya, pada waktu pagi dan waktu petang,\" QS. An-Nur : 36"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَمَنۡ أَظۡلَمُ } Wa man azhlamu : Siapakah yang lebih zhalim? Kata tanya digunakan sebagai pengingkaran dan penafian yaitu, “Tidak ada yang lebih zhalim”. Kezhaliman adalah meletakkan sesuatu apapun itu, tidak pada tempatnya. { َسَعَىٰ فِي خَرَابِهَآۚ } Sa’aa fii kharaabihaa : Melakukan upaya untuk merobohkan dan merusak fisik masjid atau dengan melarang orang untuk shalat di dalamnya, serta memalingkan manusia agar tidak beribadah di sana. Ini termasuk dalam upaya merobohkan masjid juga. { الخِزْيُ } al-Khizyu : Kerendahan dan Kehinaan di hadapan orang lain. Makna ayat : Pada ayat 114 Allah Ta’ala menafikan bahwa di sana ada yang lebih banyak berbuat kezhaliman dibandingkan orang yang menghalangi orang yang beribadah di masjid Allah. Karena ibadah adalah alasan utama adanya kehidupan ini, maka siapa saja yang melarang orang beribadah seperti orang yang merusak tatanan kehidupan. Pada waktu yang sama Allah Ta’ala mengingkari orang-orang yang melakukan kezhaliman ini, walaupun mereka adalah orang-orang Quraisy karena menghalangi Nabi dan para sahabatnya melakukan shalat di Masjidil Haram, atau Paeltheos raja Romawi yang pernah berusaha merobohkan Masjidil Aqsha, atau selain mereka yang melakukan perbuatan ini, atau bagi orang-orang yang akan melakukannya. Oleh karena itu Allah Ta’ala berfirman (أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ ) “Mereka itu tidak sepatutunya masuk ke dalam masjid-masjid itu kecuali dengan rasa takut”. Dalam ayat ini tergambar perintah untuk berjihad melawan orang-orang kafir sampai mereka mau masuk ke dalam Islam atau kekuatan mereka hancur sehingga menjadi terhinakan di hadapan Islam. Pelajaran dari ayat : • Besarnya dosa bagi orang yang berusaha mengoyak kehormatan masjid dan merusak kesuciannya. • Kewajiban untuk menjaga masjid-masjid agar tidak dimasuki oleh orang-orang kafir, kecuali mereka memasukinya dengan izin dari kaum muslimin dan dalam keadaan yang terhinakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 114: Allah menjelaskan tidak ada seorang pun yang lebih dzolim dari siapa yang menghalangi untuk mengingat Allah didalam masjid – masjid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak ada yang lebih zalim daripada orang yang melarang dzikrullah di masjid-masjid Allah, seperti melarang orang yang shalat, orang yang membaca Al Qur'an dan melarang orang lain menjalan ibadah. Terlebih ditambah dengan usaha untuk merobohokannya atau melarang kaum mukmin masuk ke dalamnya. Usaha merobohkannya menurut Syaikh As Sa'diy dalam tafsirnya ada dua; Hissiy (inderawi) dan Maknawi. Yang Hissiy misalnya menghancurkannya, merusaknya dan mengotorinya. Sedangkan yang Maknawi adalah melarang orang-orang yang menyebut nama Allah di masjid-masjid-Nya. Ayat di atas adalah umum mencakup kepada semua yang memiliki sifat tersebut, termasuk ke dalamnya As-habul Fiil (para tentara bergajah di bawah pimpinan Abrahah yang hendak menghancurkan Ka'bah), kaum Quraisy yang menghalangi Rasulullah shallallahu 'alaihi wa sallam pada tahun Hudaibiyah, kaum Nasrani yang menghancurkan Baitul Maqdis dan lain-lain, maka Allah membalas mereka dengan menghalangi mereka masuk ke dalam masjid baik secara syara' maupun taqdir (ketentuan)-Nya kecuali dalam keadaan takut dan hina. Ketika mereka membuat takut hamba-hamba Allah, maka Allah membuat hati mereka takut. Kaum musyrik yang menghalangi Rasulullah shallallahu 'alaihi wa sallam ternyata tidak lama, kemudian Allah Subhaanahu wa Ta'aala mengizinkan Beliau menaklukkan Makkah dan melarang kaum musyrik mendekati rumah-Nya (lihat surat At Taubah: 28). Sebelum mereka adalah As-habul Fiil, Allah Subhaanahu wa Ta'aala telah menimpakan kehinaan kepada mereka di dunia (baca kisahnya di surat Al Fiil), sedangkan orang-orang Nasrani yang merobohkan Baitul Maqdis akhirnya dikalahkan oleh kaum mukmin. Oleh karena itu, siapa saja yang coba-coba mengikuti jejak mereka, pasti akan memperoleh kehinaan. Jika tidak ada orang yang paling zalim daripada orang yang menghalangi orang lain menjalankan ibadah di dalamnya dan berusaha merobohkannya berarti tidak ada orang yang paling besar imannya daripada orang yang berusaha memakmurkan masjid-Nya baik Hissiy (seperti membangunnya dan membersihkannya) maupun maknawi (seperti mengumandangkan azan, mengadakan shalat jama'ah, mengadakan ta'lim, membaca Al Qur'an di sana dan melakukan ibadah-ibadah lainnya di sana)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 114",
    "description": "Dan siapakah yang lebih zalim, berdosa, memusuhi Allah, dan menentang perintah-Nya dari pada orang yang melarang di dalam masjidmasjid Allah untuk beribadah dan menyebut nama-Nya, dan berusaha merobohkannya dengan menghentikan syiar-syiar agama di dalamnya, merusak kesucian agama yang menyebabkan mereka melupakan penciptanya, menyebarkan kemungkaran di masyarakat, dan membuat kerusakan di bumi' mereka tidak pantas mema sukinya kecuali dengan rasa takut, tunduk, taat, dan patuh kepada Allah. Mereka mendapat kehinaan di dunia sebagai akibat dari kezaliman mereka, dan di akhirat mendapat azab yang berat dalam neraka jahanam yang merupakan tempat menetap yang paling hina. Ayat ini Allah turunkan sebagai jawaban atas sikap kaum kafir mekah yang mela rang nabi Muhammad salat di masjidilharamdan milik Allah timur dan barat. Artinya, Allah adalah tuhan bumi seluruhnya. Ke mana pun kamu menghadap ketika menunaikan salat, di sanalah wajah Allah, yaitu kiblat yang diinginkan Allah bagimu. Sungguh, Allah mahaluas, tidak sempit dan tidak terbatas, maha mengetahui siapa yang menghadap kepada-Nya di mana pun ia berada. 116."
  }
]