[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan milik Allah lah arah terbitnya matahari dan tenggelamnya matahari dan apa yang ada diantara keduanya. Maka Dia lah pemilik bumi semuanya. Maka ke arah manapun kalian menghadap di dalam shalat berdasarkan perintah Allah kepada kalian,maka sesungguhnya kalian telah mengharapkan wajah Allah. Kalian tidak keluar dari kerajaan dan ketaatan kepada Nya. Sesungguhnya Allah Maha luas rahmat Nya terhadap hamba-hamba Nya, maha mengetahui perbuatan-perbuatan mereka, tidak ada sesuatu pun yang luput dari Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Kerajaan timur dan barat serta semua yang ada di antara keduanya adalah milik Allah. Dia dapat memerintahkan apa saja kepada hamba-hamba-Nya. Maka ke mana pun kalian menghadap sesungguhnya kalian sedang menghadap kepada Allah. Dia lah yang Maha Meliputi seluruh makhluk-Nya. Maka apabila Dia menyuruh kalian menghadap ke arah Baitul Maqdis atau Ka'bah, atau kalian keliru dalam menghadap kiblat, atau kalian kesulitan untuk menghadap kiblatو sesungguhnya tidak masalah bagi kalian. Karena semua arah mata angin itu adalah milik Allah. Sesungguhnya Allah Mahaluas, Dia mencakup seluruh makhluk-Nya dengan rahmat-Nya dan dengan kemudahan yang diberikan-Nya, dan Dia Maha Mengetahui niat dan perbuatan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115. Allah Penguasa timur dan barat, maka kemanapun kalian menghadap pada shalat kalian maka itulah qiblat Allah, yaitu ka’bah. Maha Luas rahmat Allah bagi hamba-hamba-Nya, dan Dia Maha Mengetahui apa yang mereka katakan dan kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. الْمَشْرِقُ (timur) Yakni tempat terbitnya matahari. وَالْمَغْرِبُ ۚ(dan barat) Yakni tempat ternggelamnya matahari. Yakni timur dan barat dan yang diantara adalah milik Allah. فَأَيْنَمَا تُوَلُّوا(maka kemanapun kamu menghadap) Yakni kemanapun kalian menghadap maka disanalah wajah Allah, dan ini ketika kita tidak mengetahui arah kiblat. Adapun dalam sholat sunnah Rasulullah dulu sholat diatas kendaraannya menghadap arah yang melajunya kendaraan. إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ (Sesungguhnya Allah Maha Luas (rahmat-Nya) lagi Maha Mengetahui) Yakni ilmu-Nya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah-lah penguasa kerajaan timur dan barat, serta penguasa apapun yang ada di antara keduanya. Kemana arah kalian menghadap ketika sholat, di situlah Allah meridhoinya sebagai kiblat bagi kalian. Sesungguhnya Allah Maha Luas dalam mencurahkan rahmat kepada hamba-Nya, dan Allah Maha Mengetahui apa yang terbaik untuk hamba-Nya. Menurut Imam At Thabbrani, ayat ini turun sebelum ada perintah untuk memindahkan kiblat sholat ke arah Ka’bah. Ayat ini di tujukan untuk membantah keyakinan para penyembah berhala pada zaman dulu yang menganggap bahwa ibadah itu tidak sah apabila tidak menghadap kepada suatu kiblat yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya milik Allah itu arah timur dan barat. Ke mana pun} dimana pun {kalian menghadap} menghadapkan wajah kalian {di sanalah wajah Allah} disanalah kiblat kepada Allah {Sesungguhnya Allah Maha luas lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115. Dan kepunyaan Allah-lah timur dan barat” Allah menyebutkan keduanya secara khusus, karena keduanya adalah poros daari ayat-ayat Allah yang agung pada tempat terbitnya cahaya dan terbenamnya, apabila Dia adalah Penguasa bagi kedua arah tersebut, maka pastilah Dia adalah Penguasa seluruh arah, ” maka ke mana pun kamu menghadap, ” yakni (menghadapkan) wajah kalian di antara arah-arah yang ada, apabila penghadapan wajah kalian itu karena perintahNya, baik dengan perintahNya untuk menghadap Ka’bah setelah sebelumnya kalian diperintahkan untuk menghadap Baitul Maqdis atau kalian diperintahkan untuk menegakkan shalat di atas kendaraan dalam perjalanan atau semacamnya, maka kiblat itu adalah ke manapun seorang hamba menghadapkan wajahnya, atau kiblatnya tidak jelas maka dia menetapkan dengan dugaan terkuat dalam menghadap kepadanya, kemudian jelas setelah itu kesalahan dugaanya, atau dia mendapat udzur karena sakit atau lainnya, maka dalam perkara ini seorang hamba boleh jadi diperintahkan atau dimaafkan. Yang jelas, tidaklah mungkin seseorang menghadap ke suatu arah dari arah-arah yang ada yang keluar dari kerajaan Tuhannya, “karena di situlah Wajah Allah. Sesungguhnya Allah Mahaluas (rahmatNya) lagi Maha mengetahui.” Ayat ini merupakan dalil tentang penetapan akan Wajah Allah yang sesuai denganNya. Oleh karena itu Allah memiliki Wajah, yang semua wajah tidak serupa denganNya dan Dia sangat luas karunia dan sifatNya, dan yang terbesar darinya adalah Dia Mahatahu tentang yang kalian sembunyikan dan kalian niatkan, dan di antara karunia dan ilmuNya adalah Dia memudahkan segala perkara bagi kalian dan Dia menerima apa yang diperintahkan kepada kalian, maka segala puji dan syukur hanya bagiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { فَثَمَّ وَجۡهُ ٱللَّهِۚ } Fa tsamma wajhullah : Di sanalah Allah Ta’ala. Karena Allah meliputi seluruh makhlukNya dimanapun mereka menghadapkan wajahnya, baik ke barat atau ke timur, selatan atau utara akan menemukan Allah Ta’ala. Sebab seluruh makhluk berada dalam pengawasanNya. Bagaimana itu tidak terjadi sedangkan Allah telah mengabarkan bahwa tentang diriNya bahwa bumi berada dalam genggamanNya pada hari kiamat nanti, dan tujuh lapis langit dibentangkan dengan tangan kananNya. Maka tidak ada arah yang kosong dari pengetahuan Allah Ta’ala, pengawasanNya, serta kekuasaanNya. Maka Allah menetapkan dalam firmanNya (إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ ) “Sungguh Allah Maha Luas lagi Maha Mengetahui.” Sesungguhnya Dia amat luas DzatNya, ilmuNya, keutamaanNya, kedermawananNya, dan keramahanNya. Dialah Allah yang Maha Mengetahui segala sesuatu karena ilmuNya meliputi segala sesuatu. Makna ayat : Sedangkan pada ayat 115 Allah Ta’ala membantah orang-orang Yahudi yang telah mengkritik mengenai perintah perubahan kiblat dari Baitul Maqdis ke Ka’bah. Dan mengizinkan bagi siapa saja yang tidak mengetahui arah kiblat atau tersamarkan baginya untuk shalat menghadap arah manapun. Allah Ta’ala memberitahukan bahwa milikNya lah arah timur dan barat, Dia yang menciptakan, menguasai, dan mengaturnya. Allah mengarahkan hamba-hambaNya menghadap dalam shalat sekehendaknya, baik ke timur, barat, utara maupun selatan. Maka tidak perlu perdebatan atau pengingkaran, karena Allah Ta’ala yang memiliki seluruh alam, kemana saja seorang hamba menghadap dalam shalatnya sesungguhnya ia sedang menghadap kepada Allah Ta’ala. Kecuali ketika Allah memerintahkan untuk menghadap Ka’bah dalam shalat, maka siapa saja yang mengetahui arahnya tidak boleh untuk menghadap ke arah yang lainnya. Pelajaran dari ayat : • Sahnya shalat sunnah di atas tunggangan ketika bersafar dengan menghadap ke kiblat atau arah lain. • Kewajiban menghadap kiblat kecuali saat tidak mampu, maka gugurlah kewajiban ini. • Pengetahuan tentang Allah Maha meliputi segala sesuatu yang ada di alam semesta. Tidak ada sesuatu pun yang samar bagi Allah dalam urusan alam semesta."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 115: Allah mengabarkan bahwasannya Dia memiliki masyrik dan maghrib serta apa yang terdapat pada keduanya maka dimana pun kalian wahai manusia di bumi Allah yang luas dan jika kalian menginginkan sholat maka menghadaplah kepada arah yang lebih dominan menurut persangkaan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Ibnu Umar, ia berkata, \"Rasulullah shallallahu 'alaihi wa sallam pernah shalat menghadap dari Mekah ke Madinah di atas kendaraannya, ke arah wajahnya menghadap. Tentang hal ini, turun ayat, Fa ainamaa tuwalluu fatsamma wajhullah.\" (Hadits ini diriwayatkan pula oleh Tirmidzi, Nasa'i, Ahmad dan Ibnu Jarir. Tirmidzi berkata, \"Hadits hasan shahih.\") Timur dan barat serta apa yang ada di antara keduanya adalah milik Allah, Dia-lah pemilik bumi ini. Disebutkan timur dan barat, karena di sana terdapat tanda-tanda kekuasaan-Nya yang besar, dari sana terbit dan tenggelam matahari, jika Allah Subhaanahu wa Ta'aala memiliki kedua arah itu, berarti memiliki semua arah. Oleh karena itu, arah mana saja seseorang menghadap dengan perintah Allah (misalnya perintah menghadap ka'bah setelah sebelumnya menghadap ke Baitul Maqdis) atau keringanan dari-Nya (seperti ketika shalat sunat di atas kendaraannya, atau ia tidak mengetahui di mana kiblat, lalu ia shalat setelah mencari-cari arah kiblat, ternyata arah kiblatnya salah atau ia shalat dalam keadaan disalib, diikat, sakit dsb), maka di situlah wajah Allah, yakni ia tidak keluar dari dari kerajaan Allah dan keta'atan kepada-Nya. Sesungguhnya Allah Mahaluas rahmat dan karunia-Nya kepada hamba-hamba-Nya dan mengetahui perbuatan mereka, tidak ada satu pun yang samar bagi-Nya. Ayat ini menetapkan adanya wajah bagi Allah Ta'ala yang layak bagi-Nya, dan bahwa Dia memiliki wajah yang berbeda dengan wajah makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 115",
    "description": "Dan milik Allah timur dan barat. Artinya, Allah adalah tuhan bumi seluruhnya. Ke mana pun kamu menghadap ketika menunaikan salat, di sanalah wajah Allah, yaitu kiblat yang diinginkan Allah bagimu. Sungguh, Allah mahaluas, tidak sempit dan tidak terbatas, maha mengetahui siapa yang menghadap kepada-Nya di mana pun ia berada. 116dan mereka, kaum yahudi dan nasrani, berkata, Allah mempunyai anak. Mahasuci Allah dari perkataan mereka. Ayat ini diturunkan sebagai jawaban atas pernyataan kaum yahudi yang meyakini uzair sebagai putra Allah, kaum nasrani yang meng anggap isa sebagai putra Allah, dan kaum musyrik arab yang menganggap malaikat sebagai putri Allah. Bahkan milik-Nyalah, yakni Allah-lah pencipta dan pe milik apa yang di langit dan di bumi, termasuk di dalamnya uzair, isa, dan para malaikat itu. Semua tunduk, taat, dan patuh kepada-Nya, yakni kepada kebesaran, kekuasaan dan kehendak-Nya."
  }
]