[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Yahudi dan Nasrani serta kaum musyrikin berkata, “Allah mengambil seorang anak bagi diri Nya.” Maha suci Allah dari perkataan batil ini, bahkan segala sesuatu yang ada di langit dan di bumi adalah milik dan hamba-Nya. Dan mereka semua patuh kepada Nya, mereka tunduk di bawah pengaturan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Orang-orang Yahudi, Nasrani dan orang-orang musyrik mengatakan, “Allah mempunyai anak.” Mahasuci Allah dari ucapan mereka. Karena Dia sama sekali tidak membutuhkan makhluk-Nya. Hanya orang yang membutuhkan anak lah yang berusaha mempunyai anak. Allah adalah pemilik apa saja yang ada di langit dan di bumi. Semua makhluk yang ada adalah hamba-hamba-Nya. Mereka semua tunduk kepada-Nya. Dia dapat memperlakukan mereka menurut kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Orang-orang Yahudi, Nasrani, dan musyrik, semuanya melakukan kedustaan terhadap Allah. Mereka mengatakan bahwa ALlah mengangkat seorang anak -Maha Suci ALlah dari segala yang mereka dustakan-, kebenarannya bukan seperti apa yang mereka katakan, namun segala makhluk adalah milik Allah yang harus tunduk dan taat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. وَقَالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ (Mereka (orang-orang kafir) berkata: “Allah mempunyai anak”) Yakni orang-orang Yahudi berkata: Uzair adalah anak Allah, dan orang-orang Nasrani berkata: al-Masih adalah anak Allah, sedangkan orang-orang kafir arab berkat: malaikat adalah anak-anak perempuan Allah. سُبْحَانَهُ ۖ(Maha Suci Allah) Yakni Allah berlepas diri dari apa yang mereka nisbatkan kepada-Nya berupa pengangkatan anak. بَلْ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ( bahkan apa yang ada di langit dan di bumi adalah kepunyaan Allah) Dan termasuk Uzair, Isa, dan para malaikat merupakan milik Allah; mereka semua adalah hamba-hamba-Nya yang taat yang tidak enggan untuk beribadah kepada-Nya. Lalu bagaimana mereka bisa menjadi anak-anak Allah? Dari Ibnu Abbas Rasulullah bersabda: Allah berfirman: anak Adam telah mendustakan-Ku dan menghina-Ku. Adapun kedustaan mereka adalah menganggap Aku tidak mampu untuk mengulangi penciptaan mereka. Sedangkan hinaan mereka adalah mengatakan bahwa Aku memiliki anak, Maha suci Aku dari mengangkat pasangan atau anak. قَانِتُونَ (tunduk) Yakni mereka senantiasa beribadah dan tunduk kepada-Nya. bagaimana mereka bisa menjadi anak-anak-Nya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang kafir berkata bahwa Allah mempunyai anak. Orang Yahudi berkata bahwa Uzair adalah putera Allah. Adapun orang Nasrani berkata bahwa Isa dalah putera Allah. Allah tidak beranak. Bahkan semua makhluk dan semua kerajaan bumi dan langit adalah milik Allah. Semua yang ada, tanpa terkecuali adalah hamba Allah. Kesemuanya tunduk terhadap kerajaan Allah, lalu bagaimana mungkin ada salah satu di antara kalian yang kalian klaim sebagai putera Allah? Ayat ini turun ketika Yahudi berkata bahwa Uzair adalah putera Allah, sedangkan di sisi lain Nasrani Najran berkata bahwa Isa-lah putera Allah. Senada dengan yang di katakan orang musyrik Arab bahwa para malaikat adalah puteri Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Allah mengangkat anak.” Maha suci Allah} Maha Suci Allah dari hal itu {bahkan milikNyalah apa ada yang di langit dan di bumi. Semua tunduk kepadaNya} tunduk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. “Orang-orang kafir berkata, ” maksudnya orang-orang dari kaum Yahudi, Nasrani, orang-orang musyrik dan setiap orang yang berkata tentang itu, “Allah mempunyai anak.” Mereka menisbatkan Allah kepada suatu hal yang tidak layak dengan keagunganNya dan mereka benar-benar berlaku buruk serta mereka menganiaya diri mereka sendiri dengan perkataan tersebut, dan Allah bersabar atas perbuatan mereka, sungguh Dia telah berlaku santun terhadap mereka, memaafkan mereka, dan memberikan rizki atas mereka walaupun mereka telah berlaku tidak baik kepadaNya. “Mahasuci Allah, ” maksudnya suci dan bebas dari segala hal yang dituduhkan oleh orang-orang musyrik dan orang-orang zhalim dari perkara-perkara yang tidak sesuai dengan keagunganNya. Maka Mahasuci Dzat yang memiliki kesempurnaan yang mutlak dalam segala bentuknya yang tidak disisipi oleh kekurangan sedikitpun dalam segala bentuknya. bersamaan dengan bantahan Allah terhadap perkataan mereka. Dia juga menegakkan hujjah dan keterangan yang kuat terhadap kesucianNya dari semua itu seraya berfirman, “Bahkan apa yang ada di langit dan di bumi adalah kepunyaan Allah, ” maksudnya, seluruhnya kepunyaan Allah berikut hamba-hambaNya, Dia mengatur mereka dengan pengaturan seorang tuan terhadap budak-budaknya, mereka tunduk kepadanya dan dibawah pengaturannya. Maka bila mereka semua itu adalah hamba-hambaNya yang membutuhkanNya, sedangkan Dia tidak butuh kepada mereka lalu bagaimanakah ada seseorang di antara mereka menjadi anak bagi Allah? Seorang anak itu pasti berasal dari jenis orang tuanya, karena dia merupakan bagian darinya. padahal Allah ta’ala adalah yang Maha Memiliki lagi Maha perkasa, sedangkan kalian adalah orang-orang yang dikuasai dan diatur, Allah Mahakaya dan kalian sangatlah miskin, lalu dengan semua itu bagaimana mungkin Allah memiliki anak? Ini adalah suatu hal yang paling batil dan yang paling buruk. Ketundukan itu ada dua macam; ketundukan yang bersifat umum, yaitu ketundukan seluruh makhluk di bawah pengaturan sang Pencipta, dan kedua ketundukan yang bersifat khusus, yaitu ketundukan ibadah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { سُبۡحَٰنَهُۥۖ } Subhaanah : Maha suci Allah yang dari seluruh kekurangan. Salah satunya bahwa Allah tidak memiliki anak. { قَٰنِتُونَ } Qaanituun : Mereka tunduk dan patuh. Berjalanlah takdir bagi mereka dan dilaksanakan hukum-hukum Allah atas mereka. Makna ayat : Konteks ayat masih saja berbicara mengenai aneka rupa kebatilan yang dilakukan oleh orang-orang kafir dari kalangan ahli kitab dan orang-orang musyrik. Serta berisikan bantahan terhadap tabir kebohongan dan kepalsuan yang mereka lancarkan. Pada ayat (116) dan (117) Allah Ta’ala menyebutkan ucapan ahli kitab dan orang-orang musyrik bahwa Allah memiliki anak. Yahudi menyebutkan bahwa ‘Uzair adalah anak Allah dan Nasrani mengklaim bahwa al-Masih adalah putra Allah, serta sebagian orang musyrik Arab mengatakan bahwa malaikat adalah anak-anak perempuan Allah. Allah Ta’ala menyebutkan ucapan buruk mereka ini kemudian menyucikan diriNya dari perkataan yang batil dan berisikan kedustaan ini. Pelajaran dari ayat : • Keharaman untuk menyandarkan segala sesuatu kepada Allah Ta’ala tanpa ada dalil berupa wahyu, sebab Allah mengingkari penyandaran anak kepadaNya kepada ahli kitab dan orang-orang musyrik secara bersamaan. • Kemiripan hati para pengusung kebatilan pada setiap waktu dan tempat, sebab mereka menerima panggilan setan serta menaatinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 116: Allah mengabarkan keyakinan yahudi: yang bahwasannya aziz adalah anak laki – laki Allah dan nasrani berkeyakinan: Al – masih adalah anak laki – laki Allah dan bahwasannya orang – orang musyrik berkeyakinan : malaikat adalah anak perempuan Allah. Allah mendustakan mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka ini adalah orang-orang Yahudi, orang-orang Nasrani dan orang-orang musyrik. Meskipun mereka menisbatkan kepada Allah Subhaanahu wa Ta'aala sesuatu yang tidak layak bagi-Nya, namun Allah Subhaanahu wa Ta'aala sangat halim (sabar dan tidak langsung menghukum padahal Dia mampu) dan mereka masih mendapatkan rezeki-Nya. Kata-kata ini \"subhaanah\", merupakan bantahan Allah Subhaanahu wa Ta'aala terhadap pernyataan batil tersebut. Kemudian Allah Subhaanahu wa Ta'aala menegakkan hujjah dengan firman-Nya setelah kata-kata \"subhaanah\". Yakni Mahasuci Allah dari pernyataan yang batil tersebut. Demikian juga Mahasuci Dia dari apa yang disifatkan oleh kaum musyrikin dan orang-orang zalim. Mahasuci Allah yang memiliki kesempurnaan secara mutlak dari segala sisi, Dia tidak terkena aib dan kekurangan dari segala sisi. Maksudnya: semua yang ada di langit dan di bumi adalah milik-Nya dan hamba-Nya, mereka semua tunduk kepada-Nya dan di bawah tadbir (pengaturan)-Nya. Jika mereka semua adalah hamba-Nya dan butuh kepada-Nya sedangkan Dia tidak butuh kepada mereka, bagaimana mungkin salah seorang di antara mereka menjadi anaknya, padahal anak itu biasanya sejenis dengan bapaknya, karena memang ia bagian daripadanya. Perhatikanlah, Allah Subhaanahu wa Ta'aala Maha Memiliki lagi Maha Menundukkan, sedangkan mereka dimiliki dan ditundukkan, Dia Maha Kaya, sedangkan mereka fakir, berbeda bukan!, dan sungguh sangat berbeda. Oleh karena itu, pernyataan ini termasuk kebatilan yang paling batil. Tunduk atau qunut terbagi dua: Ketundukan umum dan ketundukan khusus. Ketundukan umum maksudnya bahwa semua makhluk di bawah tadbir (pengaturan) Allah Subhaanahu wa Ta'aala seperti yang dinyatakan dalam ayat ini. Sedangkan ketundukan khusus adalah ketundukan beribadah sebagaimana firman-Nya \"wa quumuu lillahi qaanitiin\" (dan berdirilah karena Allah dengan tunduk/khusyu') di surat Al Baqarah: 238."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 116",
    "description": "Dan mereka, kaum yahudi dan nasrani, berkata, Allah mempunyai anak. Mahasuci Allah dari perkataan mereka. Ayat ini diturunkan sebagai jawaban atas pernyataan kaum yahudi yang meyakini uzair sebagai putra Allah, kaum nasrani yang meng anggap isa sebagai putra Allah, dan kaum musyrik arab yang menganggap malaikat sebagai putri Allah. Bahkan milik-Nyalah, yakni Allah-lah pencipta dan pe milik apa yang di langit dan di bumi, termasuk di dalamnya uzair, isa, dan para malaikat itu. Semua tunduk, taat, dan patuh kepada-Nya, yakni kepada kebesaran, kekuasaan dan kehendak-Nya. Allah pencipta langit dan bumi. Apabila dia hendak menetapkan, mengadakan, dan mewujud kan sesuatu, tidak ada halangan sedikit pun bagi-Nya, dia hanya berkata kepadanya, jadilah! maka jadi lah sesuatu itu."
  }
]