[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah ta’ala adalah Dzat yang menciptakan langit dan bumi tanpa ada contoh terlebih dahulu. Apabila Dia menetapkan suatu perkara apapun dan Dia hendak untuk mengadakannya, Dia hanya berfirman “kun” (jadilah), maka ia pun jadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Allah adalah pencipta langit dan bumi beserta isinya tanpa ada contoh sebelumnya. Apabila Dia menetapkan dan menghendaki sesuatu, Dia cukup berfirman kepadanya, “Jadilah!” Maka jadilah sesuatu itu sesuai dengan apa yang Allah kehendaki. Tidak ada seorangpun yang dapat menolak perintah dan keputusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Allah-lah Pencipta langit dan bumi tanpa ada misal sebelumnya. Apabila Dia menetapkan suatu urusan, Dia hanya perlu mengatakan “kun” maka jadilah urusan itu. Ibnu Katsir mengatakan tentang ayat ini: “Hal ini menunjukkan kesempurnaan dan keagungan kuasa-Nya. Jika Dia akan menetapkan sesuatu maka Dia berfirman: “Jadilah” maka jadilah urusan itu sebagaimana yang Dia kehendaki. Allah berfirman: إِنَّمَآ أَمْرُهُۥٓ إِذَآ أَرَادَ شَيْـًٔا أَن يَقُولَ لَهُۥ كُن فَيَكُونُ Sesungguhnya perkataan Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya: “kun (jadilah)”, maka jadilah ia. (an-Nahl: 40) dan berfirman: إِنَّمَا قَوْلُنَا لِشَىْءٍ إِذَآ أَرَدْنٰهُ أَن نَّقُولَ لَهُۥ كُن فَيَكُونُ Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya: “Jadilah!” maka terjadilah ia. (Yasin: 82) dan berfirman: وَمَآ أَمْرُنَآ إِلَّا وٰحِدَةٌ كَلَمْحٍۭ بِالْبَصَرِ Dan perintah Kami hanyalah satu perkataan seperti kejapan mata. (al-Qamar: 50)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. بَدِيعُ السَّمَاوَاتِ وَالْأَرْضِ ۖ (Allah Pencipta langit dan bumi) Yakni Dia-lah yang menciptakan keduanya pertama kali tanpa ada yang semisalnya sebelumnya. وَإِذَا قَضَىٰ أَمْرًا(dan bila Dia berkehendak (untuk menciptakan) sesuatu) Yakni berkehendak untuk menciptakan atau mengatur sesuatu. فَإِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُ(maka (cukuplah) Dia hanya mengatakan kepadanya: “Jadilah!” Lalu jadilah ia) Yakni sebagai bukti kesempurnaan kekuasaan-Nya Dia melakukan apa yang Dia kehendaki dengan kata Kun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah-lah sang Pencipta langit dan bumi, artinya Allah yang menciptakan keduanya, tanpa ada contoh yang semisal dengan keduanya. Apabila Allah menghendaki meciptakan sesuatu, baik berupa makhluk, atau perkara, atau suatu perencanaan maka Allah hanya akan berkata kun: Jadilah! Maka seketika itu juga, jadilah apa yang Allah inginkan. Itu semua terjadi sebab sangat kesempurnaan kekuasaan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat yang menciptakan langit dan bumi.} Dzat yang menciptakan langit dan bumi yang tidak pernah ada sebelumnya {Apabila Dia hendak menetapkan} berkehendak dan menentukan {sesuatu, Dia hanya berkata kepadanya, “Jadilah” Maka, jadilah sesuatu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117. “Allah Pencipta langit dan bumi, ” maksudnya yang menciptakan keduanya dalam bentuk yang telah dikokohkan dan diindahkannya tanpa ada contoh sebelumnya. “Dan bila Dia berkehendak (untuk menciptakan) sesuatu, maka (cukuplah) Dia mengatakan kepadanya, ‘Jadilah!’ maka jadilah ia, ” tanpa dibantu dan tanpa terhalang sedikit pun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بَدِيعُ ٱلسَّمَٰوَٰتِ } Badii’us samaawaat : Allah yang menciptakan berlapis-lapis langit tanpa ada contoh sebelumnya. { قَضَىٰٓ أَمۡرٗا } Qadaa amran : Memutuskan untuk membuat sesuatu. Makna ayat : Lantas Allah menyebutkan dalil-dalil serta argumen untuk membantah kalim bohong mereka itu. Pertama : Kepemilikan Allah Ta’ala atas segala sesuatu yang berada di langit dan di bumi, serta mereka semua tunduk kepada hukum, kuasa dan aturan-Nya. Maka secara logika sangat tidak mungkin apabila Allah mengangkat anak dari kalangan mereka. Kedua : Kekuasaan Allah Ta’ala yang nampak ketika Allah menciptakan berlapis lapis langit, bumi, dan makhluk yang lainnya hanya dengan mengucapkan kun fayakun. Maka tidak mungkin Allah membutuhkan seorang anak, karena Dia lah pemilik segala sesuatu dan Tuhan dari segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 117: Allah menjelaskan bahwasannya Dia adalah pencipta langit dan bumi dan yang mengawali atas seluruh permisalan yang lalu, maka jika Allah menginginkan sesuatu Dia berkata : Kun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Badii' artinya Allah Subhaanahu wa Ta'aala Pencipta tanpa didahului contoh sebelumnya. Allah Maha Kuasa mampu menciptakan makhluk begitu indah tanpa didahului contoh sebelumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 117",
    "description": "Allah pencipta langit dan bumi. Apabila dia hendak menetapkan, mengadakan, dan mewujud kan sesuatu, tidak ada halangan sedikit pun bagi-Nya, dia hanya berkata kepadanya, jadilah! maka jadi lah sesuatu itu. Dan orang-orang yang tidak mengetahui, yaitu orang-orang bodoh dari kaum musyrik mekah, berkata, mengapa Allah tidak berbicara dengan kita dan tidak menurunkan wahyu kepada kita yang mengabarkan kerasulan Muhammad, atau datang tanda-tanda kekuasaan, alasan, dan penjelasan-Nya kepada kita tentang kebenaran kerasulan Muhammad' sebelumnya, orang-orang kafir mekah pernah berkata kepada nabi Muhammad, jika engkau betul-betul rasul dari Allah seperti yang engkau katakan, maka katakanlah kepada Allah agar berbicara dengan kami sehingga kami mendengar ucapannya. Mereka berkata demikian sebagai tanda penentangan dan kesombongan mereka. Demikian pula orang-orang yang sebelum mereka telah berkata seperti ucapan mereka itu. Hati mereka serupa dengan hati orang-orang sebelum mereka. Mereka menentang dan mendustakan para nabi dan rasul yang diutus Allah kepada mereka. Pernyataan Allah ini mengandung hiburan bagi rasulullah. Allah menegaskan bahwa sesungguhnya telah kami jelaskan tandatanda kekuasaan kami kepada orang-orang yang yakin."
  }
]