[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang jahil dari kalangan ahli kitab dan selain mereka berkata kepada nabi dan rasul Allah Muhammad Shalallahu alaihi Wassalam dengan menampakan sikap penentangan, “Mengapa Allah itu tidak berbicara kepada kami secara langsung saja untuk memberitahukan kepada kami bahwa kau itu benar-benar utusan Nya, atau engkau datangkan kepada kami mukjizat dari Allah yang menunjukan akan kebenaran perkataanmu”. Ucapan model ini telah dilontarkan umat-umat sebelumnya kepada para Rasul mereka sebagai bentuk penentangan dan kesombongan, dikarenakan keserupaan hati orang-orang terdahulu dan yang datang kemudian dalam kekafiran dan kesesatan. Sungguh kami telah menerangkan ayat-ayat bagi orang-orang yang membenarkannya dengan pembenaran yang pasti, karena mereka adalah orang-orang yang beriman kepada Allah ta'ala dan mengikuti ajaran yang disyariatkan Nya kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Orang-orang ahli kitab dan orang-orang musyrik yang tidak berilmu menolak kebenaran dengan mengatakan, “Mengapa Allah tidak berbicara langsung kepada kami tanpa perantara?” Atau mengatakan, “Mengapa tidak ada mukjizat kasat mata yang datang secara khusus kepada kami?” Ucapan semacam itu sudah pernah dikatakan oleh umat-umat pendusta di masa lalu kepada rasul-rasul mereka kendati waktu dan tempat mereka berbeda-beda. Kami telah menjelaskan ayat-ayat itu kepada orang-orang yang meyakini kebenaran tatkala kebenaran itu telah nyata bagi mereka. Mereka tidak diliputi keraguan dan tidak terhalang oleh penolakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Salah satu bentuk kebebalan orang-orang musyrik Arab, mereka meminta Rasulullah agar Allah berbicara dengan mereka secara langsung, atau mendatangkan kepada mereka mukjizat sebagai bukti kebenaran kenabiannya. Perkataan demikian seperti yang dikatakan pula oleh orang-orang Yahudi dan Nasrani, sebab hati mereka sama-sama keras dan bebal meskipun Kami telah memberikan mukjizat yang jelas kepada orang-orang yang benar-benar beriman kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. وَقَالَ الَّذِينَ لَا يَعْلَمُونَ (Dan orang-orang yang tidak mengetahui berkata) Yakni orang-orang musyrik arab لَوْلَا يُكَلِّمُنَا اللَّهُ (“Mengapa Allah tidak (langsung) berbicara dengan kami) Yakni untuk mengabarkan kepada kami kenabian Muhammad Shallallahu ‘Alaihi Wasallam agar kami tahu kalua dia adalah Nabi. أَوْ تَأْتِينَا آيَةٌ ۗ (atau datang tanda-tanda kekuasaan-Nya kepada kami?”) Yakni sebagai bukti atas kenabian Muhammad Shallallahu ‘Alaihi Wasallam. قَالَ الَّذِينَ مِنْ قَبْلِهِمْ (orang-orang yang sebelum mereka telah mengatakan) Yakni orang-orang Yahudi dan Nasrani. تَشَابَهَتْ قُلُوبُهُمْ ۗ (hati mereka serupa) Yakni sama-sama dalam kekufuran dan meminta susuatu yang tidak pantas dan mengusulkan bukti-bukti kepada Allah. يُوقِنُونَ (kaum yang yakin) Yakni mengakui kebenaran dan mentaati segala perintah Allah, karena mereka adalah orang-orang yang membenarkan-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dapat dipastikan adanya hubungan sebab akibat antara ucapan lisan dan bisikan hati, jika hati-hati manusia telah sepakat dalam suatu perkara maka lisan mereka pun akan sepakat dengan suatu perkara itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang musyrik Arab berkata kepada nabi: “Mengapa Allah tidak berbicara kepada kita sebagaimana kepada malaikat dan rasul-Nya? Justru Allah hanya mengkabarkan bahwa engkalah utusan-Nya. Kemudian hanya menunjukkan mu’jizat atau bukti nyata terhadap apa yang tidak kami percayai pada aya 90 dan 91 pada surat Al Isra’. Ayat tersebut menerangkan tentang kebenaran kenabianmu (Muhammad). Begitu kata orang kafir umat terdahulu. Hati dan perkataan mereka tidak ada bedanya dengan para pendahulu mereka. Mereka sama-sama kufur, membangkang dan mendustakan petunjuk Allah. Allah telah memberi petunjuk yang jelas tentang bukti kenabian Muhammad SAW untuk orang-orang yang mencari kebenaran. Sebab turunnya ayat ini menurut Ibnu Abbas dari Imam Ath Thabari: bahwa Rafi’ bin Khuzaimah berkata kepada Nabi SAW : “Jika memang engkau adalah utusan Allah, maka katakanlah kepada Allah untuk berbicara kepada kami, agar kami bisa mendengarNya. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Orang-orang yang tidak mengetahui berkata, “Mengapa Allah tidak} mengapa tidak {berbicara dengan kita atau datang tanda-tanda (kekuasaanNya) kepada kita” Begitu juga orang-orang yang sebelum mereka telah berkata seperti ucapan mereka itu. Hati mereka serupa. Sungguh telah Kami terangkan} Kami jelaskan {tanda-tanda (kekuasaan Kami) kepada kaum yang yakin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118. Orang-orang bodoh dari ahli kitab dan selain mereka berkata, ”Kenapa Allah tidak berbicara juga kepada kita sebagaimana Dia berbicara kepada para Rosul, “atau datang tanda-tanda kekuasaanNya kepada kami, ” mereka memaksudkan tanda-tanda dari usulan yang mereka usulkan dari akal-akal mereka yang rendah dan pemikiran-pemikiran mereka yang menyimpang yang mengandung makna kelancangan terhadap sang Pencipta dan kesombongan terhadap Rosul-rosulNya, seperti perkataan mereka : “Hai Musa, kami tidak akan beriman kepadamu sebelum kami melihat Allah dengan terang\" (QS. Al-Baqoroh : 55) \"Ahli Kitab meminta kepadamu agar kamu menurunkan kepada mereka sebuah Kitab dari langit. Maka sesungguhnya mereka telah meminta kepada Musa yang lebih besar dari itu. Mereka berkata: “Perlihatkanlah Allah kepada kami dengan nyata”. Maka mereka disambar petir karena kezalimannya, dan mereka menyembah anak sapi, sesudah datang kepada mereka bukti-bukti yang nyata, lalu Kami maafkan (mereka) dari yang demikian. Dan telah Kami berikan kepada Musa keterangan yang nyata.\" (QS. An-Nisa : 153) \"Dan mereka berkata: “Mengapa rasul itu memakan makanan dan berjalan di pasar-pasar? Mengapa tidak diturunkan kepadanya seorang malaikat agar malaikat itu memberikan peringatan bersama-sama dengan dia?, atau (mengapa tidak) diturunkan kepadanya perbendaharaan, atau (mengapa tidak) ada kebun baginya, yang dia dapat makan dari (hasil)nya?” Dan orang-orang yang zalim itu berkata: “Kamu sekalian tidak lain hanyalah mengikuti seorang lelaki yang kena sihir”. (QS. Al-Furqon : 7-8) \"Dan mereka berkata: “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami,\" (QS. Al-Isro : 90) Inilah adat kebiasaan mereka terhadap para Rosul di mana mereka meminta tanda-tanda untuk memojokkan, bukan tanda-tanda untuk mendapatkan petunjuk, dan juga maksud mereka bukanlah untuk menampakkan kebenaran, karena para Rosul telah datang dengan tanda-tanda yang dapat dipercaya oleh orang-orang yang semisal mereka. Oleh karena itu Allah berfirman, ”Sungguh Kami telah menjelaskan tanda-tanda kekuasaan Kami kepada kaum yang yakin.” Setiap orang yang yakin telah mengetahui dengan baik dari ayat-ayat Allah yang jelas dan keterangan-keteranganNya yang kuat yang membuatnya merasa yakin dan menghilangkan segala rasa ragu dan bimbang. Kemudian Allah menyebutkan beberapa ayat yang singkat dan komplit untuk ayat-ayat yang menunjukkan kebenaran Rosulullah dan shahihnya apa yang ia emban."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { تَأۡتِينَآ ءَايَةٞۗ } Ya’tiinaa aayah : Mendatangkan mukjizat seperti mukjizat yang dimiliki Nabi Musa dan Isa berupa tongkat dan dapat menghidupkan orang mati. Makna ayat : Pada ayat (118) Allah Ta’ala membantah ucapan orang-orang musyrik yang bodoh (لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ ) “Mengapa Allah tidak berbicara langsung kepada kami atau datang tanda-tanda kekuasaanNya kepada kami?” mereka menyumbangkan usulan seperti itu agar mereka dapat beriman dan bertauhid. Maka Allah memberitakan bahwa permintaan seperti ini sudah pernah diminta oleh umat-umat sebelumnya, maka sama saja hati mereka berada dalam kegelapan. Sebelumnya orang-orang Yahudi telah berkata kepada Musa, “Tampakkanlah Allah kepada kami secara terang-terangan”. Adapun melihat Allah dan berbicara denganNya secara langsung tidak mungkin dapat dilakukan dalam kehidupan ini, kehidupan yang berisi ujian dan pembebanan dari Allah. Oleh karena itu Allah tidak memenuhi permintaan satupun dari mereka baik umat sebelumnya ataupun setelahnya. Adapun permintaan mereka agar Allah menunjukkan ayat-ayat kekuasaanNya, maka cukup bagi mereka untuk membaca ayat-ayat yang diturunkan dalam kitabNya yang berisikan ayat-ayat tentang keimanan kepada Allah, kewajiban beribadah dan mengesakanNya, tentang kebenaran risalah nabi dan kewajiban untuk beriman serta mengikutinya. Itu semua sudah mencukupi dan lebih baik dibandingkan tanda-tanda yang mereka minta. Akan tetapi kaum Yahudi itu dikarenakan kekufuran dan pembangkangan mereka tidak bisa melihat petunjuk yang terdapat dalam ayat-ayat al-Qur’an. Hal itu disebabkan karena mereka tidak yakin, padahal ayat-ayat itu hanya dapat bermanfaat bagi orang-orang yang meyakininya, bukan orang-orang yang ragu lagi mendustakannya. Pelajaran dari ayat : • Tidak akan bermanfaat ayat dan bukti-bukti kecuali kepada orang-orang yang yakin. Disebabkan sehatnya pikiran mereka dan memiliki hati yang selamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 118: Allah mengabarkan bahwasannya ahli kitab dan orang – orang musyrik berkata kepada rasul ﷺ : kami tidaklah beriman wahai Muhammad sampai kami berbicara kepada Allah secara langsung dan Allah mengabarkan bahwasannya engkau adalah utusan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dari kalangan ahli kitab maupun selain mereka. Tanda-tanda di sini adalah tanda-tanda sesuai yang mereka inginkan berdasarkan akal mereka yang tidak sehat dan pandangan mereka yang dangkal yang membuat mereka berani berbicara seperti itu kepada Allah Al Khaliq dan bersikap sombong kepada rasul-rasul-Nya, seperti permintaan mereka agar dapat melihat Allah (lihat Al Baqarah: 55), permintaan agar Nabi Muhammad shallallahu 'alaihi wa sallam menurunkan kitab langsung dari langit (lihat An Nisaa': 153), dan seperti yang disebutkan dalam surat Al Israa': 90-95. seperti inilah kebiasaan mereka terhadap rasul-rasul, meminta ayat-ayat yang memberatkan diri mereka, bukan ayat-ayat untuk memperoleh bimbingan, karena memang niat mereka bukan mencari yang hak, padahal para rasul telah datang membawakan ayat-ayat yang biasanya dengan ayat tersebut manusia mau beriman. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, \"Sesungguhnya telah Kami jelaskan tanda-tanda (kekuasaan Kami) kepada orang-orang yang yakin.\" Orang-orang yang yakin telah mengetahui dari ayat-ayat Allah dan buktinya yang begitu jelas sesuatu yang membuat mereka yakin dan hilang keraguan dan kebimbangan. Yakni ucapan tersebut tidaklah muncul kecuali karena kesamaan hati dalam kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 118",
    "description": "Dan orang-orang yang tidak mengetahui, yaitu orang-orang bodoh dari kaum musyrik mekah, berkata, mengapa Allah tidak berbicara dengan kita dan tidak menurunkan wahyu kepada kita yang mengabarkan kerasulan Muhammad, atau datang tanda-tanda kekuasaan, alasan, dan penjelasan-Nya kepada kita tentang kebenaran kerasulan Muhammad' sebelumnya, orang-orang kafir mekah pernah berkata kepada nabi Muhammad, jika engkau betul-betul rasul dari Allah seperti yang engkau katakan, maka katakanlah kepada Allah agar berbicara dengan kami sehingga kami mendengar ucapannya. Mereka berkata demikian sebagai tanda penentangan dan kesombongan mereka. Demikian pula orang-orang yang sebelum mereka telah berkata seperti ucapan mereka itu. Hati mereka serupa dengan hati orang-orang sebelum mereka. Mereka menentang dan mendustakan para nabi dan rasul yang diutus Allah kepada mereka. Pernyataan Allah ini mengandung hiburan bagi rasulullah. Allah menegaskan bahwa sesungguhnya telah kami jelaskan tandatanda kekuasaan kami kepada orang-orang yang yakin. Sungguh, kami telah mengutusmu, wahai nabi Muhammad, dengan kebenaran syariat yang terang dan agama yang lurus, sebagai pembawa berita gembira kepada orang-orang beriman tentang surga yang penuh kenikmatan, dan pemberi peringatan kepada orang-orang kafir tentang siksaan api neraka. Dan engkau tidak akan diminta pertanggungjawaban tentang kaum kafir yang menjadi penghuni-penghuni neraka sesudah engkau dengan sungguh-sungguh mengajak mere ka beriman. Dalam pernyataan Allah ini terkandung hiburan bagi rasulullah agar tidak kecewa dan berkecil hati terhadap apa yang telah dilakukannya."
  }
]