[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah mengutusmu –wahai Rosul- dengan membawa ajaran-ajaran agama yang benar yang dikukuhkan dengan hujah-hujah dan mukjizat-mukjizat, maka sampaikanlah ajaran agama itu kepada manusia dengan memberikan kabar gembira bagi kaum Mukminin bahwa mereka akan mendapatkan dua kebaikan yaitu di dunia dan akhirat, dan peringatan untuk orang-orang yang menentangnya dengan siksaan Allah yang akan menunggu mereka. Dan kamu (setelah selesai menyampaikan Risalah) tidaklah bertanggung jawab atas kekafiran orang-orang yang ingkar kepadamu, karena sesungguhnya mereka itu akan masuk neraka pada hari kiamat dan mereka tidak akan keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Sesungguhnya Kami telah mengutusmu -wahai Nabi- dengan membawa agama yang benar, yang tidak ada keraguan sedikitpun terhadapnya, agar engkau memberikan kabar gembira tentang surga bagi orang-orang yang beriman dan memperingatkan adanya neraka bagi orang-orang yang ingkar. Tugasmu hanyalah menyampaikan agama itu secara nyata. Dan Allah tidak akan meminta tanggung jawabmu terkait penghuni neraka Jahim yang tidak mau beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Dengan keagungan dan kekuasaan Kami yang sempurna, Kami mengutusmu hai Muhammad membawa agama yang benar, untuk memberi kabar gembira tentang kenikmatan surga, dan memperingatkan dari azab neraka. Dan kamu bukanlah penanggungjawab atas orang-orang yang mendustakanmu yang berhak mendapatkan azab neraka pada hari kiamat; namun tugasmu hanyalah menyampaikan risalah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. إِنَّا أَرْسَلْنَاكَ بِالْحَقّ (Sesungguhnya Kami telah mengutusmu (Muhammad) dengan kebenaran) Yakni Allah menekankan untuk Rasulullah bahwa dirinya adalah utusan-Nya sebagai bantahan orang-orang kafir yang meminta agar Allah berbicara dengan mereka untuk memberi tahu kenabian Rasulullah. بَشِيرًا وَنَذِيرًا ۖ (sebagai pembawa berita gembira dan pemberi peringatan) Yakni Kami mengutusmu untuk menjadi pemberi kabar gembira dan peringatan. وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ (dan kamu tidak akan diminta (pertanggungan jawab) tentang penghuni-penghuni neraka) Yakni kewajibanmu (Muhammad Shallallahu ‘Alaihi Wasallam Shallallahu ‘Alaihi Wasallam) adalah menyampaikan dan bukan penanggungjawab orang-orang yang tidak beriman yang akan menjadi penghuni nereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah menegaskan bahwa Nabi Muhammad SAW adalah nabi yang Allah untuk menyampaikan agama yang benar. Juga memberi kabar gembira kepada orang-orang yang beriman tentang adanya balasan surga bagi mereka. Kemudian memberi peringatan kepada orang kafir tentang azab neraka. Engkau wahai Muhammad tidak dimintai tanggung jawab tentang siapa yang mati kafir atau siapa yang mati dalam mengimani kerasulanmu. Imam As Suyuti berkata:Yang dimaksud pada ayat ini, ayat-ayat sebelumnya dan sesudahnya, adalah kafir Yahudi dan Nasrani bukan kedua orang tua Nabi SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah mengutusmu dengan benar sebagai pembawa berita gembira dan pemberi peringatan. Kamu tidak akan dimintai pertanggung jawaban tentang penghuni-penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119. “Sesungguhya Kami telah mengutusmu (Muhammad) dengan kebenaran; sebagai pembawa berita gembira dan pemberi peringatan.” Ayat ini meliputi semua ayat yang dia bawa, yang berporos pada tiga perkara, Pertama, berkaitan dengan kerasulannya itu sendiri, dan yang kedua pada kehidupan, petunjuk, dan bimbingannya, dan yang ketiga pada pengetahuan tentang apa yang dibawa olehnya berupa al-Qur’an dan as-Sunnah. Perkara pertama dan kedua masuk dalam firman Allah, “Sesungguhnya kami telah mengutusmu (Muhammad), ” sedang perkara ketiga masuk dalam firmanNya, “dengan kebenaran” Penjelasan tentang perkara pertama, yaitu kerasulannya itu sendiri, bahwasanya telah diketahui tentang kondisi penduduk bumi sebelum diutusnya beliau, yang mana mereka menyembah berhala, api dan salib serta merubah-rubah agama, hingga mereka berada dalam gelapnya kekafiran yang telah menguasai dan merasuki mereka semua, kecuali segelintir dari ahli kitab yang telah punah sesaat sebelum kerasulan tiba. Sungguh telah diketahui bahwasanya Allah tidaklah menciptakan makhluk-makhlukNya dengan sia-sia dan Dia tidak membiarkan mereka berjalan sendiri, karena Allah itu Mahabijaksana lagi Maha Mengetahui, Mahamampu lagi Maha pengasih, maka di antara hikmah dan kasih sayangNya terhadap hamba-hambanya adalah bahwa Dia mengutus kepada mereka Rosul yang mulia tersebut yang mengajak mereka kepada kepada penyembahan hanya semata kepada Dzat yang Mahakasih, yang tidak ada sekutu bagiNya, karena hanya sebatas kerasulannya, seorang yang berakal akan mengetahui kebenarannya, dan itulah tanda yang paling besar yang menunjukkan bahwasanya beliau itu adalah Rosulullah Sholallohu 'alaihi wasallam Penjelasan perkara yang kedua adalah barangsiapa yang mengenal Nabi secara baik dan sempurna, dan dia mengetahui sejarah hidupnya dan kehidupannya sebelum diutus serta perkembangan hidupnya dengan berpedoman kepada sifat-sifat yang mulia, kemudian setelah itu bertambah mulia dan luhur akhlak dan sifat-sifatnya yang agung dan indah bagi orang yang memandangnya, maka barangsiapa yang mengetahuinya dan menapaki kondisi-kondisinya, niscaya dia akan mengetahui bahwasanya semua itu tidaklah mungkin kecuali merupakan akhlak-akhlak para Nabi yang sempurna, karena Allah telah menjadikan sifat-sifat sebagai tanda terbesar untuk mengetahui pemiliknya dari sisi kebenaran ddan kebohongannya. Sedangkan perkara yang ketiga adalah mengetahui apa yang dibawa oleh Rosululloh berupa syari’at yang agung dan al-Quran yang mulia yang mengandung segala kabar yang shahih, perintah-perintah kepada hal yang baik, larangan-larangan dari hal-hal yang buruk, dan mukjizat-mukjizat yang besar, maka seluruh tanda-tanda itu masuk ke dalam ketiga perkara tersebut. FirmanNya, “Sebagai pembawa berita gembira, ” yaitu bagi orang yang menaatimu dengan kebahagiaan dunia maupun akhirat, “dan pemberi peringatan, ” yaitu bagi orang yang bermaksiat kepadamu dengan kesengsaraan dan kehancuran dunia maupun akhirat. “Dan kamu tidak akan diminta (pertanggung jawaban) tentang penghuni-penghuni neraka, ” maksudnya kamu tidaklah bertanggungjawab terhadap mereka, karena kamu hanya menyampaikan dan Kami-lah yang akan membalasnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَلَا تُسۡ‍َٔلُ } Wa laa tus’alu : Ayat ini dibaca dengan huruf ta’ untuk majhul (pasif) tus’alu disertai dengan huruf Laa sebagai huruf nafi (menafikan) dan fi’il dalam keadaan marfu’ (berharakat akhir dhommah). Bisa dibaca juga dengan bentuk ta’ untuk ma’lum (aktif) tas’al dan huruf Laa sebagai nahiyah (melarang) dan fi’il dalam keadaan majzum (berharakat akhir sukun) Wa Laa Tas’al. { ٱلۡجَحِيمِ } al-Jahiim : Salah satu tingkatan di neraka. Dan tingkatan Jahiim merupakan yang paling pedih adzabnya. Makna ayat : Pada ayat (119) Allah Ta’ala memberitahukan bahwa Dia telah memberikan keringanan kepada Nabinya dengan tidak perlu pusing memikirnya permintaan orang-orang musyrik untuk mendatangkan bukti-bukti. Karena Nabi tidak dibebani agar seseorang mendapatkan hidayah atau beriman. Begitu juga pada hari kiamat tidak bertanggung jawab mengenai siapa saja yang akan masuk ke neraka. Karena tugas utama seorang nabi hanyalah untuk memberikan kabar gembira dan memberikan peringatan. Yaitu memberikan kabar gembira bagi orang-orang yang beriman dan beramal shalih akan masuk ke dalam surga dan selamat dari jilatan api neraka, serta memperingatkan orang-orang kafir dan yang berbuat keji akan masuk ke dalam neraka, merasakan adzab pedih yang terus menerus di dalamnya. Pelajaran dari ayat : • Kewajiban seorang mukmin adalah mengajak orang lain kepada Allah Ta’ala, bukan untuk membagi-bagikan hidayah. Karena hidayah hak milik Allah Ta’ala. Adapun mengajak orang lain itu masih dalam batas kemampuan manusia, dan manusia dibebani dengan hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 119: Kemudian Allah mengabarkan bahwasannya Allah mengutus nabi Muhammad ﷺ untuk agama ini dengan bukti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada ayat ini, Allah Subhaanahu wa Ta'aala menyatakan kebenaran kerasulan Beliau dan kebenaran apa yang Beliau bawa berupa Al Qur'an dan As Sunnah. Kebenaran Beliau didukung oleh banyak dalil, baik dalil sam'i (naqli) seperti pada ayat ini, maupun dalil 'aqli (akal). Dalil 'aqlinya adalah sbb: Pertama, keadaan penduduk bumi sebelum Beliau diutus berada dalam kegelapan dan jauh dari akhlak mulia sehingga disebut sebagai zaman jahiliyyah (kebodohan). Manusia tidak berpikir lagi tentang apa yang disembahnya; pantas atau tidak untuk disembah seperti patung, api, salib dsb. Kita pun mengetahui bahwa Allah Subhaanahu wa Ta'aala tidaklah menciptakan makhluk-Nya dengan membiarkan mereka begitu saja, karena Allah Subhaanahu wa Ta'aala Maha Bijaksana, Maha Mengetahui, Maha Kuasa dan Maha Penyayang. Hikmah dan rahmat-Nya menghendaki untuk mengutus kepada mereka yang berada dalam kegelapan ini seorang rasul yang menyuruh mereka menyembah kepada yang pantas disembah, yaitu Pencipta mereka (Allah) dan mengembalikan mereka kepada jati diri mereka yang sesungguhnya (memanusiakan manusia) sebagai hamba Allah bukan hamba makhluk, membebaskan mereka dari peribadatan kepada makhluk menuju peribadatan kepada Allah, mengfungsikan kembali akal mereka yang selama ini tertahan geraknya, menjalin hubungan baik antara sesama mereka yang sebelumnya bermusuh-musuhan dan menyatukan mereka di atas tauhid, di atas beribadah kepada Allah dan di atas kebaikan sehingga hidup mereka diberkahi, makmur dan penuh kedamaian. \"Jika sekiranya penduduk negeri-negeri beriman dan bertakwa, pastilah Kami akan melimpahkan kepada mereka berkah dari langit dan bumi, tetapi mereka mendustakan (ayat-ayat Kami) itu, maka Kami siksa mereka disebabkan perbuatannya. (Terj. Al A'raaf: 96) Kedua, barang siapa yang mengetahui keadaan Nabi Muhammad shallallahu 'alaihi wa sallam sebelum diutus, akhlaknya yang mulia dan pribadinya yang agung, pasti akan mengetahui bahwa akhlak tersebut adalah akhlak para nabi dan rasul. Hal ini pun sama menunjukkan bahwa Muhammad shallallahu 'alaihi wa sallam adalah Nabi dan Rasul. Ketiga, barang siapa yang mengetahui apa yang Beliau bawa, baik Al Qur'an maupun As Sunnah yang isinya mengandung berita yang benar, perintah-perintah yang baik (berbakti kepada orang tua, menyambung tali silaturrahim, berkata jujur, menepati janji dsb), larangan mengerjakan perbuatan buruk (larangan meminum khamr, judi, mengadu domba dsb), belum lagi mukjizat yang diberikan kepada Beliau shallallahu 'alaihi wa sallam, pasti akan membenarkan kenabian dan kerasulan Beliau shallallahu 'alaihi wa sallam kecuali orang yang zhalim dan sombong saja padahal hati mereka mengakui, \"Dan mereka mengingkarinya karena kezaliman dan kesombongan, padahal hati mereka meyakini (kebenaran)nya.\" (Terj. An Naml: 14) Nabi Muhammad shallallahu 'alaihi wa sallam diutus dengan membawa agama yang benar (Islam) yang diperkuat dengan hujjah dan mukjizat. Beliau diperintahkan menyampaikan agama ini dengan memberikan berita gembira kepada kaum mukmin kebaikan yang akan mereka peroleh di dunia dan akhirat, dan menakuti mereka yang menolak padahal sudah jelas kebenarannya dengan azab Allah. Tugas Beliau hanya menyampaikan, adapun hisabnya diserahkan kepada Allah. Beliau tidaklah diminta pertanggungjawaban terhadap kekafiran mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 119",
    "description": "Sungguh, kami telah mengutusmu, wahai nabi Muhammad, dengan kebenaran syariat yang terang dan agama yang lurus, sebagai pembawa berita gembira kepada orang-orang beriman tentang surga yang penuh kenikmatan, dan pemberi peringatan kepada orang-orang kafir tentang siksaan api neraka. Dan engkau tidak akan diminta pertanggungjawaban tentang kaum kafir yang menjadi penghuni-penghuni neraka sesudah engkau dengan sungguh-sungguh mengajak mere ka beriman. Dalam pernyataan Allah ini terkandung hiburan bagi rasulullah agar tidak kecewa dan berkecil hati terhadap apa yang telah dilakukannya. Dan janganlah engkau, wahai nabi Muhammad, bersusah payah mencari kerelaan orang-orang yang ingkar. Hal itu tidak mungkin, sebab orang-orang yahudi dan nasrani tidak akan rela kepadamu, nabi Muhammad, sebelum engkau meninggalkan agamamu dan berpaling mengikuti agama mereka yang mereka anggap paling benar. Karena itu, engkau tidak perlu melakukan apa yang mereka minta demi memperoleh kerelaan mereka, tetapi tetaplah engkau meng hadapkan dirimu untuk mendapatkan kerelaan Allah. Tetaplah mengajak mereka kepada kebenaran dan katakanlah, sesungguhnya petunjuk Allah, yakni agama islam, itulah petunjuk, yakni agama yang sebenarnya. Dan jika engkau mengikuti keinginan mereka setelah ilmu, yakni kebenaran wahyu, sampai kepadamu, tidak akan ada bagimu pelindung dan penolong dari Allah. Meski khitab ayat ini ditujukan kepada nabi Muhammad, pada hakikatnya pesan ini berlaku umum bagi seluruh umat islam."
  }
]