[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya apa yang mereka lakukan dan mereka sangkakan itu adalah kerusakan yang sebenarnya. Akan tetapi karena disebabkan kebodohan dan pembangkangan mereka, mereka tidak menyadarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Padahal sesungguhnya mereka adalah pembuat kerusakan, tetapi mereka tidak menyadarinya. Dan mereka juga tidak merasa bahwa perbuatan mereka adalah kerusakan itu sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. اَلَآ اِنَّهُمْ هُمُ الْمُفْسِدُوْنَ (Ingatlah, sesungguhnya merekalah yang berbuat kerusakan) Ketika Allah melarang mereka berbuat kerusakan mereka malah mengaku merekalah yang melakukan perbaikan, sehingga Allah memabalas klaim mereka dengan balasan yang telak dengan mensifati mereka dengan sifat asli mereka yang suka berbuat kerusakan. وَلٰكِنْ لَّا يَشْعُرُوْنَ(tetapi mereka tidak menyadari) Yakni mereka tidak mengetahui bahwa mereka adalah orang-orang yang suka berbuat kerusakan dikarenakan mereka suka memusuhi kebenaran dan orang-orang yang berada dalam kebenaran dan suka menghalangi orang-orang dari jalan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "11-12 Tidak semua pengakuan yang dilontar oleh seseorang tentang suatu perkara mesti dibenarkan; karena orang-orang munafiq tatkala mereka berkata : { إِنَّمَا نَحْنُ مُصْلِحُونَ } \"sesungguhnya kami adalah orang-orang yang mengadakan perbaikan\" , Allah kemudian membantah perkataan mereka dengan firman-Nya : { أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ } \"Ketahuilah sesungguhnya mereka itu adalah orang-orang yang mendatangkan kerusakan\" ; dan tidak semua apa yang dihiasi oleh jiwa selalu baik; sebagaimana yang difirmankan oleh Allah : { أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا ۖ فَإِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ } \"Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik, (sama dengan orang yang tidak ditipu oleh syaitan)? Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya dan menunjuki siapa yang dikehendaki-Nya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Sesungguhnya mereka adalah orang-orang yang melakukan kerusakan yang sebenarnya karena melanggar perintah-perintah Allah dan melakukan kemaksiatan namun mereka tidak menyadari bahwa mereka adalah orang yang benar-benar melakukan kerusakan. Sungguh kerusakan telah menguasai hati mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah, sesungguhnya merekalah yang berbuat kerusakan, namun mereka tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “ Ingatlah, sesungguhnya mereka itulah orang-orang yang membuat kerusakan, ” karena tidak ada yang lebih besar Allah, menghalangi dari jalan Allah, menipu Allah dan para kekasihNya, dan (justru sebaliknya) mereka mencintai orang-orang yang memerangi Allah dan RosulNya dan dengan itu semua dia mengklaim bahwa hal itu adalah perbaikan, lalu apakah setelah kerusakan ini ada kerusakan yang kebih besar lagi? Akan tetapi mereka tidak mengetahui ilmu yang bermanfaat bagi diri mereka walaupun mereka terkadang telah mengetahui ilmu tersebut, namun hal itu adalah tanda telah ditegakannya hujjah Allah atas mereka. Sesungguhnya perbuatan maksiat mereka di atas muka bumi adalah pengrusakan karena menjadi penyebab dari kerusakan segala hal yang ada di atas muka bumi berupa biji-bijian, buah-buahan, pepohonan, dan tumbuh-tumbuhan, dimana terjadi kerusakan yang disebabkan oleh kemaksiatan, dan juga karena perbaikan di muka bumi adalah dengan memakmurkannya dengan ketaatan kepada Allah dan beriman kepadaNya. Oleh karena itu Allah menciptakan makhluk dan menetapkannya di bumi, menentukan rizki bagi mereka agar mereka memanfaatkannya untuk taat kepada Allah dan beribadah kepadaNya, dan bila dilakukan di atas bumi ini hal yang bertentangan dengan itu, maka hal itu adalah usaha melakukan kerusakan padanya dan penghancuran baginya dari hal yang menjadi tujuan dia diciptakan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : لَّا يَشۡعُرُونَ Laa yasy’uruun : Artinya Tidak mengetahui dan tidak menyadari. Makna ayat : Maka Allah Ta’ala menepis anggapan mereka dan menjelaskan bahwa merekalah sejatinya yang berbuat kerusakan, bukan orang-orang mukmin yang menegur mereka. Akan tetapi orang munafik tidak menyadari disebabkan karena kekufuran sudah menguasai hati mereka. Pelajaran dari ayat : Membuat perbaikan di muka bumi dilakukan dengan cara beramal dalam ketaatan kepda Allah dan rasulNya, sedangkan berbuat kerusakan di muka bumi adalah dengan bermaksiat kepada Allah dan rasulNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 12: Oleh karena itu Allah membongkar kedok mereka, dan Allah mengabarkan bahwa mereka adalah perusak akan tetapi mereka tidak menyadari bahwasannya para perusak itu secara hakiki disebabkan karena kebodohan mereka dan kesombongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena tidak ada kerusakan yang paling besar daripada mengingkari ayat-ayat Allah, menghalangi manusia dari jalan-Nya, hendak menipu Allah dan para wali-Nya dan menolong orang-orang yang memerangi Allah dan rasul-Nya ditambah dengan agggapan bahwa hal itu merupakan perwujudan mengadakan perbaikan. Perbuatan maksiat dikatakan sebagai kerusakan karena rusaknya bumi diakibatkan oleh maksiat, sebaliknya bumi hanya akan menjadi baik dengan iman dan keta'atan kepada Allah Ta'ala. Untuk itulah Allah menciptakan manusia dan melimpahkan rezeki kepada mereka, yakni agar mereka gunakan untuk keta'atan dan ibadah kepada-Nya, jika yang dilakukan malah kebalikannya maka sama saja berusaha merusak bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 12",
    "description": "Karena kelakuan mereka yang selalu menampakkan keimanan dan menyembunyikan kekufuran serta menganggap kerusakan mereka sebagai kebaikan, Allah mengingatkan orang-orang mukmin agar tidak tertipu dengan itu semua. Ingatlah, sesungguhnya merekalah yang berbuat kerusakan. Diri mereka telah rusak karena keyakinan yang batil dan perbuatan yang jahat. Mereka pun telah merusak orang lain dengan menyebar fitnah dan memicu konflik di tengah masyarakat. Tetapi, karena hati yang telah tertutup dan rasa bangga diri yang berlebihan, mereka tidak menyadari kerusakan tersebut dan akibat buruk yang akan menimpa mereka oleh sebab kemunafikan. Dan apabila dikatakan dan dinasihatkan kepada mereka, berimanlah kamu dengan tulus ikhlas sebagaimana orang lain yang menyambut suara dan seruan akal sehat telah beriman, seperti yang dilakukan para sahabat pengikut nabi Muhammad, mereka menjawab dengan penuh kesombongan dan nada menghina, apakah kami akan beriman seperti orang-orang yang kurang akal itu beriman' tidak pantas bagi kami untuk mengikuti orang-orang bodoh itu, sebab dengan begitu berarti kami sama bodohnya dengan mereka. Allah membantah kecongkakan mereka dengan mengingatkan orangorang mukmin, ingatlah, sesungguhnya hanya mereka itulah orang-orang yang kurang akal dan bodoh, tetapi mereka tidak tahu dan tidak sadar bahwa kebodohan dan sifat kurang akal itu ada dalam diri mereka, dan mereka juga tidak menyadari kesesatan mereka itu."
  }
]