[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang Yahudi dan Nasrani tidak akan rido terhadap mu -wahai Rasul- hingga engkau mau meninggalkan agamamu dan mengikuti agama mereka. Katakanlah kepada mereka, “sesungguhnya agama Islam itulah agama yang shahih”. Dan jika engkau mengikuti kemauan hawa nafsu mereka setelah datang wahyu kepadamu, maka di sisi Allah nanti engkau tidak akan punya pelindung yang akan memberikan manfaat bagimu dan penolong yang akan menolongmu. Khitob ayat walaupun kondisinya khusus bagi nabi Muhammad sholallohu ‘alaihi wasallam, akan tetapi hakikatnya umum untuk seluruh umatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Allah memperingatkan kepada Nabi-Nya seraya berfirman, “Orang-orang Yahudi dan Nasrani tidak akan puas sebelum engkau meninggalkan agama Islam dan mengikuti agama mereka. Jika hal itu kamu lakukan atau dilakakukan oleh siapa saja di antara pengikutmu setelah kebenaran nyata datang kepadamu, maka engkau tidak akan mendapatkan pembelaan maupun pertolongan dari Allah. Ini termasuk penjelasan tentang bahaya meninggalkan kebenaran dan berteman dengan para pengusung kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120. Hai Rasulullah, orang-orang Yahudi dan Nasrani tidak akan ridha denganmu dan umatmu selamanya sampai tujuan mereka dapat mereka raih, yaitu sampai kalian mengikuti agama dan hawa nafsu mereka. Dan katakanlah kepada mereka hai Rasulullah: “Agama Islam adalah agama yang benar.” Sungguh jika kamu mengikuti mereka setelah al-Qur’an diturunkan kepadamu, maka sesungguhnya kamu tidak memiliki penolong kecuali Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. وَلَنْ تَرْضَىٰ عَنْكَ الْيَهُودُ (Orang-orang Yahudi dan Nasrani tidak akan senang kepada kamu) Yakni apabila kamu datang dengan apa yang mereka usulkan, mereka juga tetap tidak akan senang kepadamu. Karena sesungguhnya yang mereka inginkan bukanlah bukti-bukti yang mereka usulkan akan tetapi yang mereka inginkan adalah agar kamu meninggalkan agamamu dan masuk ke agama mereka dan mengikuti hawa nafsu mereka. Begitu pula halnya ahli bid’ah dan pengikut hawa nafsu, mereka tidak akan senang terhadap pembawa kebenaran sampai orang-orang itu mengikuti hawa nafsu mereka. إِنَّ هُدَى اللَّهِ هُوَ الْهُدَىٰ ۗ (“Sesungguhnya petunjuk Allah itulah petunjuk (yang benar)”) Yakni petunjuk Allah adalah petunjuk hakiki, bukan apa yang ada pada mereka yang berupa agama yang telah dinasakhkan dan kitab-kitab yang telah dirubah. وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ (Dan sesungguhnya jika kamu mengikuti kemauan mereka) Yakni mengikuti apa yang ada dalam kitab-kitab yang telah dirubah dan apa yang mereka buat dalam agama mereka berupa hukum-hukum dan pendapat-pendapat. Terdapat ancaman keras yang diarahkan kepada Rasulullah apabila dia mengikuti kemauan hawa nafsu mereka dan mencoba mencari keridhaan mereka. hal in juga merupakan peringatan bagi umat Muhammad Shallallahu ‘Alaihi Wasallamagar tidak masuk ke dalam jeratan hawa nafsu agama-agama lain, dan mengharap keridhaan ahli bid’ah; barangsiapa melakukan demikian maka ia akan dihinakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang Yahudi dan Nasrani tidak akan pernah bisa rela, sampai kamu wahai Nabi mau mengikuti keyakinan mereka. Sampai engkau mau meninggalkan agamamu dan pindah ke agama mereka dan mengikuti perilaku mereka. Katakanlah wahai rasul bahwa petunjuk Alquran adalah agama yang benar dan pentunjuk yang hakiki, terkecuali hukum-hukum yang telah diganti/dihapus. Namun, wahai rasul jika engkau mengikuti perilaku Yahudi dan Nasrani juga mengikuti kitab yang telah mereka palsukan, padahal telah diwahyukan Alquran kepadamu, maka tidak akan ada lagi yang mengurusi urusanmu dan juga menjagamu. Begitu juga tidak akan ada yang bisa menyelamatkanmu dan menolongmu dari azab dan murka Allah. Sebab turunnya ayat ini adalah kaum Yahudi meminta peperangan mereka dengan Nabi dan kaum muslim dihentikan. Dengan begitu mereka berjanji akan mengikuti dan menerima dakwah Nabi. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang Yahudi dan Nasrani tidak akan pernah rela kepadamu sehingga kamu mengikuti agama mereka. Katakanlah, “Sesungguhnya petunjuk Allah itulah petunjuk sebenarnya.” Sungguh jika kamu mengikuti hawa nafsu mereka setelah apa yang telah sampai kepadamu berupa ilmu, maka tidak ada bagimu pelindung dan penolong dari (azab) Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. Allah ta’ala mengabarkan kepada RosulNya bahwasanya orang-orang Yahudi dan Nasrani tidak akan rela kepadamu hingga kamu mengikuti agama mereka, karena mereka adalah penyeru-penyeru kepada agama yang mereka anut yang mereka anggap sebagai petunjuk, maka katakanlah kepada mereka “Sesungguhnya petunjuk Allah “ yang kamu (Muhammad) diutus dengannya, “itulah petunjuk (yang benar), ” sedangkan apa yang kalian anut hanyalah hawa nafsu belaka, dengan dalil firman Allah “Dan sungguh jika kamu mengikuti hawa nafsu mereka setelah pengetahuan datang kepadamu, maka allah tidak lagi menjadi pelindung dan penolong bagimu, ” Dalam ayat ini sebuah larangan yang keras untuk mengikuti hawa nafsu orang-orang yahudi dan Nasrani dan larangan menyerupai mereka dalam perkara yang menjadi kekhususan agama mereka. Perkataan ini walaupun ditujukan kepada Rosululloh, namun umat beliau juga termasuk didalamnya, karena yang dijadikan pedoman adalah keumuman lafazh, bukan kekhususan sebabnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مِلَّتَهُمۡۗ } Millatahum : Agama yang mereka anut, baik Yahudi atau Nasrani. { قُلۡ إِنَّ هُدَى ٱللَّهِ } Qul inna hudallahi: al-Huda maknanya ada petunjuk, yang dimaksud di sini adalah agama Islam yang mana Allah turunkan kitabNya dan mengutus rasulNya. Bukan ajaran dan ritual yang dibuat-buat oleh kaum Yahudi dan Nasrani itu. { مِن وَلِيّٖ وَلَا نَصِيرٍ } Min waliyyin walaa nashiir : al-Waliy maknanya adalah orang yang mengurusi urusan anda, sedangkan an-Nashiir adalah orang yang melindungi anda dari gangguan. Makna ayat : Ayat-ayat ini masih membicarakan mengenai ahli kitab dengan menyingkap aib-aib yang mereka miliki, serta mengajak mereka kepada petunjuk, andai saja mereka memang menginginkannya. Pada ayat (120) Allah Ta’ala memberitahukan kepada RasulNya dan umat yang mengikutinya, bahwa orang-orang Yahudi dan Nasrani tidak akan pernah ridha kepada mereka sampai orang-orang muslim mengikuti agama Yahudi atau Nasrani. Pada ayat ini disebutkan larangan agar tidak mengikuti mereka (Yahudi dan Nasrani, pent), kemudian Allah Ta’ala memerintahkan rasulNya agar memberitahukan umatnya bahwa hidayah yang sesungguhnya adalah hidayah milik Allah, yaitu agama Islam dan bukan agama Yahudi atau Nasrani. Karena dua agama sudah penuh dengan ajaran melenceng yang dibuat-buat oleh para rahib dan pendeta yang tamak lagi mengikuti hawa nafsunya. Lantas Allah Ta’ala memperingatkan rasulNya dan umatnya agar tidak mengikuti orang-orang Yahudi dan Nasrani setelah mereka setelah datangnya ilmu dan kenikmatan yang sempurna, yaitu agama Islam. Allah Ta’ala berfirman (وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ ٱلَّذِي جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ ) “Dan sesungguhnya jika kamu mengikuti kemauan mereka setelah pengetahuan datang kepadamu, maka Allah tidak lagi menjadi pelindung dan penolong bagimu.” Pelajaran dari ayat : • Kaum muslimin tidak akan pernah mendapatkan keridhoan dari Yahudi dan Nasrani, kecuali mau kafir terhadap agama Islam dan mengikuti agama mereka yang batil. Hal ini tidak boleh dilakukan oleh seorang muslim, oleh karena itu meminta keridhoan Yahudi dan Nasrani hukumnya haram untuk selamanya. • Tidak ada agama yang benar kecuali agama Islam. Maka tidak selayaknya untuk mencari agama selain Islam walau hanya satu kali pun. • Barangsiapa yang berwala’ (berloyalitas) terhadap Yahudi dan Nasrani dengan mengikuti kebatilan mereka, akan kehilangan loyalitas dari Allah dan tidak akan mendapat pertolongan dariNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 120: Allah mengabarkan bahwasannya yahudi dan nasrani tidak akan ridho kepada Muhammad ﷺ sampai nabi meninggalkan agamanya dan mengikuti agama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Agama Islam itulah agama yang benar dan petunjuk yang sebenarnya, sedangkan yang mereka pegang adalah hawa nafsu belaka. Yakni setelah kebenaran datang. Ayat ini meskipun khithab (arah pembicaraan) ditujukan kepada Nabi Muhammad shallallahu 'alaihi wa sallam, namun ia umum untuk umatnya juga. Di dalam ayat ini terdapat larangan keras mengikuti keinginan orang-orang Yahudi dan Nasrani, bertasyabbuh dengan mereka terutama dalam hal yang menjadi ciri khas agama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 120",
    "description": "Dan janganlah engkau, wahai nabi Muhammad, bersusah payah mencari kerelaan orang-orang yang ingkar. Hal itu tidak mungkin, sebab orang-orang yahudi dan nasrani tidak akan rela kepadamu, nabi Muhammad, sebelum engkau meninggalkan agamamu dan berpaling mengikuti agama mereka yang mereka anggap paling benar. Karena itu, engkau tidak perlu melakukan apa yang mereka minta demi memperoleh kerelaan mereka, tetapi tetaplah engkau meng hadapkan dirimu untuk mendapatkan kerelaan Allah. Tetaplah mengajak mereka kepada kebenaran dan katakanlah, sesungguhnya petunjuk Allah, yakni agama islam, itulah petunjuk, yakni agama yang sebenarnya. Dan jika engkau mengikuti keinginan mereka setelah ilmu, yakni kebenaran wahyu, sampai kepadamu, tidak akan ada bagimu pelindung dan penolong dari Allah. Meski khitab ayat ini ditujukan kepada nabi Muhammad, pada hakikatnya pesan ini berlaku umum bagi seluruh umat islam. Orang-orang yahudi dan nasrani yang telah kami beri kitab suci, yakni taurat dan injil, mere ka membacanya dan mengikuti ajarannya sebagaimana mestinya. Mereka tidak melakukan perubahan apa pun terhadap kitab suci itu. Mereka itulah orang-orang yang beriman kepadanya, yakni kitab suci sebelum mengalami perubahan, dengan iman yang sebenar-benarnya, di antaranya iman kepada para nabi, termasuk nabi terakhir, Muhammad. Adapun mereka yang mengubah kitab suci dan tidak mengimani kerasulan nabi muham mad, mereka itulah orangorang yang ingkar. Dan barang siapa ingkar kepadanya, mereka itulah orang-orang yang rugi dan celaka dalam pandangan Allah."
  }
]