[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang telah kami berikan kepada mereka Al-kitab dari kalangan Yahudi dan Nasrani, mereka membacanya dengan sebaik-baiknya dan mengikuti kandungannya dengan sebenar-benarnya, mengimani semua yang terkandung di dalamnya, dan juga beriman kepada para utusan Allah, termasuk beriman kepada penutup mereka yaitu rasul dan nabi kita Muhammad Shallallahu Alaihi Wasallam, tidak mengganti dan mengubah-ubah apa yang ada di dalamnya. Mereka itulah orang-orang yang beriman kepada Nabi Muhammad Shalallahu Wassalam dan kepada apa yang diturunkan kepadanya. Adapun orang-orang yang merubah-ubah isi Al-kitab dan menyembunyikan sebagian isi yang lain, mereka itu adalah orang-orang yang ingkar kepada Nabi Muhammad sholallohu ‘alaihi wasallam. Dan barangsiapa yang kafir kepadanya maka mereka itulah orang-orang yang paling besar kerugiannya di sisi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Al-Qur`ān Al-Karim berbicara tentang sebagian ahli kitab yang mengetahui isi kandungan kitab-kitab suci yang diturunkan kepada mereka dan diikuti dengan sungguh-sungguh, sesungguhnya mereka itu menemukan tanda-tanda di dalam kitab suci tersebut yang menunjukkan kebenaran Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-. Oleh karena itulah mereka bergegas menyatakan iman kepadanya. Sedangkan sebagian ahli kitab lainnya bersikeras untuk mempertahankan kekafiran sehingga mereka menjadi orang-orang yang merugi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121. Allah mengabarkan kepada orang-orang Yahudi dan Nasrani yang membaca kitab-kitab mereka dengan benar sebelum dirubah dan mengikuti tuntunan kitab-kitab itu dengan sebenar-benarnya, mereka adalah orang-orang yang mendapatkan derajat yang tinggi yang beriman kepada Allah dan Rasul-Nya; begitu pula keadaan orang-orang yang telah diturunkan kepada mereka al-Qur’an. Adapun orang-orang yang merubah dan mengganti kitab-kitab agung mereka, maka mereka adalah orang-orang yang jauh dari kebenaran yang akan kehilangan kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ (Orang-orang yang telah Kami berikan Al Kitab kepadanya) Ada pendapat mengatakan yang dimaksud disini adalah orang-orang muslim; sedang pendapat lain berkata rekeka adalah para ahli kitab yang memeluk islam. يَتْلُونَهُ حَقَّ تِلَاوَتِهِ(mereka membacanya dengan bacaan yang sebenarnya) Yakni dengan mengikuti dan mengamalkannya, mereka menghalalkan yang halal, mengharamkan yang haram, dan membacanya dengan bacaan yang sebenarnya, serta tidak mengubah dan menggantinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Apabila Allah menyebutkan Ahli Kitab dengan sebutan : { الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ } \"orang-orang yang telah Kami berikan Al Kitab kepadanya\", maka Allah tidak menyebut mereka melainkan dalam bentuk pujian. Dan apabila Allah menyebut Ahli Kitab dengan sebutan : {الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ } \"orang-orang yang telah diberi bahagian Al Kitab\", maka Allah tidak menyebut mereka melainkan dalam bentuk celaan. Apabila Allah menyebutkan, \"orang-orang yang telah diberi kitab\", maka maknanya bisa mencakup keduanya (celaan dan pujian). Namun Allah tidak menyebutkan pujian kepada Ahli Kitab saja, pasti ada pihak lain yang dipuji bersamaan dengan ahli kitab. Apabila Allah menyebut mereka dengan \"Ahli Kitab\" maka ini mencakup pujian atau celaan secara umum. ㅤ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang yang telah kami beri Alquran mengikuti perintahnya dengan sungguh-sungguh, juga mengamalkan isinya. Mereka menghalalkan apa yang dihalalkan, dan mengharamkan apa yang diharamkan. Merekalah orang-orang yang mempercayai kebenaran Alquran dengan sepenuh hati. Adapun orang-orang yang mengingkari Alquran merekalah orang yang merugi, karena mereka menukar keimanan dengan kekufuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang telah Kami beri kitab suci, mereka membacanya sebagaimana mestinya} mereka mengikutinya sebagai mana mestinya {mereka itulah orang-orang yang mengimaninya. Dan Siapa yang mengingkarinya, maka mereka itulah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. Allah ta’ala mengabarkan bahwasanya orang yang telah Dia berikan kitab dan dikaruniai dengannya karunia yang mutlak, mereka itu “membacanya dengan bacaan yang sebenarnya,” maksudnya mereka mengikutinya dengan sebenar-benar ketaatan. Kata ‘tilaawatun’ (disini) bemakna mengikuti. Mereka menghalalkan yang halalnya dan mengharamkan yang haramnya, mereka melaksanakan ayat yang jelas (muhkam) dan beriman kepada ayat yang tidak jelas (mutasyabih). Itulah orang-orang yang bahagia di antara ahli kitab yang mengetahui nikmat-nikmat Allah dan mereka mensyukurinya, mereka beriman kepada setiap Rosul dan mereka tidak membeda-bedakan salah seorang pun diantara mereka, maka mereka itulah orang-orang yang beriman secara benar, yang bukan dari orang yang berkata, “Kami beriman kepada Taurat yang diturunkan kepada kami namun kami ingkar terhadap al-Qur’an yang datang setelahnya.” Oleh karena itu, Allah mengancam mereka dalam FirmanNya, “Dan barangsiapa yang ingkar kepadanya, maka mereka itulah orang-orang yang rugi.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { يَتۡلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ } Yatluunahu haqqa tilaawatih : Mereka tidak menyelewengkan satu kata pun dari tempatnya dan tidak menyembunyikan kebenaran yang ada berupa karakteristik Rasul Muhammad ﷺ dan selain itu. { أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ } Ulaaika humul khaasiruun : Mereka yang ditunjuk dalam ayat adalah orang-orang kafir dari kalangan ahli kitab. Kerugian yang dimaksud adalah kerugian di dunia dan akhirat. Makna ayat : Pada ayat (121) Allah Ta’ala memberitakan bahwa orang-orang yang diberikan kitab Taurat dan Injil, kemudian mereka mengkajinya dengan benar, tidak menyelewengkannya atau menyembunyikannya isinya maka mereka beriman kepada al-Kitab dengan sebenar-benar keimanan. Sedangkan orang-orang yang menyelewengkan kalamullah (firman Allah) dan menyembunyikan kebenaran isinya, seperti sifat-sifat Nabi Muhammad ﷺ, mereka itu tidak beriman kepadanya dan termasuk orang-orang yang merugi. Barangsiapa yang beriman dengan kitabnya sendiri dari kalangan ahli kitab, dan benar-benar mengkajinya maka mereka akan beriman kepada Nabi Muhammad yang tidak bisa baca tulis dan masuk ke dalam agama Islam. • Jalan mendapat hidayah dengan cara mengkaji kitabullah, membacanya dengan tajwid dan mentadaburi bacaannya, serta beriman kepada ayat yang muhkam maupun mutasyabih, menghalalkan yang dihalalkannya dan mengharamkan yang diharamkannya, menegakkan batasan-batasannya (hukum-hukumnya, pent) sebagaimana menegakkan (membaca dengan baik dan benar) huruf-hurufnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 121: Allah mengabarkan bahwasannya kepada mereka sebuah kitab untuk yahudi dan nasrani."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara mufassirin ada yang mengartikan \"yat-luunahu haqqa tilaawatih\" dengan \"mengikutinya sebagaimana mestinya\", karena tilawah adalah ittibaa' (mengikuti). Oleh karenanya, maksud ayat ini adalah mereka mengikutinya sebagaimana mestinya, mereka halalkan yang halal, mengharamkan yang haram, mengamalkan muhkamnya (ayat yang jelas) dan mengimani ayat yang mutasyabihatnya, tidak merobah dan mentakwilkan Al kitab sekehendak hatinya, ia mengimani isinya dan mengikutinya, termasuk beriman kepada nabi yang diberitakan di sana, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam, mereka inilah ahlul kitab yang beriman. Mereka mengenal nikmat Allah dan mensyukurinya serta beriman kepada semua rasul tanpa membeda-bedakan (tidak hanya beriman kepada sebagiannya), tetapi beriman kepada semuanya. Maksudnya: ingkar kepada kitab itu; dengan bersikap berbeda dengan yang disebutkan sebelumnya (lihat footnote 288)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 121",
    "description": "Orang-orang yahudi dan nasrani yang telah kami beri kitab suci, yakni taurat dan injil, mere ka membacanya dan mengikuti ajarannya sebagaimana mestinya. Mereka tidak melakukan perubahan apa pun terhadap kitab suci itu. Mereka itulah orang-orang yang beriman kepadanya, yakni kitab suci sebelum mengalami perubahan, dengan iman yang sebenar-benarnya, di antaranya iman kepada para nabi, termasuk nabi terakhir, Muhammad. Adapun mereka yang mengubah kitab suci dan tidak mengimani kerasulan nabi muham mad, mereka itulah orangorang yang ingkar. Dan barang siapa ingkar kepadanya, mereka itulah orang-orang yang rugi dan celaka dalam pandangan Allah. Wahai bani israil! ingatlah nikmat-nikmat-ku yang telah aku berikan kepadamu, yakni nenek moyangmu dahulu, di antaranya nikmat berupa kebebasan dari kejaran firaun, diutusnya banyak rasul, dan diturunkannya kitab-kitab suci; dan di antara nikmat-nikmat itu aku telah melebihkan kamu dari semua umat yang lain di alam ini pada masa itu dengan banyaknya para nabi yang diutus kepada kamu. Ini menunjukkan bahwa Allah benar-benar sangat menyayangi hambanya. Meskipun bani israil telah berkali-kali melakukan pelanggaran, mereka tetap saja diajak dengan harapan mereka dapat percaya kepada nabi Muhammad. Selanjutnya, ayat 123 mengingatkan mereka dan semua orang untuk mempersiapkan diri menghadapi hari kiamat."
  }
]