[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai anak keturunan Ya'kub Ingatlah nikmat Ku yang sangat banyak atas kalian, dan sesungguhnya Aku telah melebihkan kalian di atas orang-orang sezaman kalian dengan banyaknya para nabi kalian, dan apa yang diturunkan kepada mereka berupa kitab-kitab suci ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Wahai Bani Israil! Ingatlah nikmat-Ku -baik yang berkenaan dengan masalah agama maupun duniawi- yang telah Aku berikan kepada kalian. Dan ingatlah bahwa Aku telah memberikan kelebihan kepada kalian atas orang lain yang hidup di zaman kalian dalam bentuk kenabian dan kerajaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122-123. Allah menyeru para keturunan Ya’qub untuk mengakui kenikmatan-kenikmatan yang telah Allah berikan kepada mereka; diantaranya dengan menjadikan mereka manusia yang paling utama di zamannya karena banyaknya nabi yang diutus kepada mereka dan menurunkan kepada mereka kitab-kitab yang agung. Kemudian Allah memperingatkan mereka dari hari perhitungan, hari dimana seseorang tidak berguna bagi orang lain, tidak berlaku harta tebusan untuk menyelamatkan diri dari azab, dan syafaat seseorang tidak berlaku lagi, serta tidak ada yang dapat menjauhkan azab Allah dari orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122-123 Tafsir dua ayat ini telah dijelaskan di ayat 47-48 pada surat ini. Al-Qubba’i berpendapat tujuan pengulangan awal kisah bani Israil ini yang berupa pengingatan nikmat-nikmat dan peringatan dari turunnya musibah-musibah agar diketahui bahwa inilah inti dari kisah tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai kaum Bani Israil, ingat-ingatlah nikmat yang Kami anugerahkan kepada kalian dan para pendahulu kalian dengan bersyukur kepadaku dan taat kepadaku. Kami-pun (pada masa itu) telah memberi kelebihan kepada pendahulu kalian atas hamba yang lain. Mengingat kembali atas berbagai nikmat dan peringatan tentang kedengkian untuk memahami tujuan utama dari kisah tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Bani Israil, ingatlah nikmatKu yang telah Aku anugerahkan kepada kalian dan sesungguhnya Aku telah melebihkan kalian daripada semua umat di alam ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122-123. Tafsir ayat telah dijelaskan di atas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { إِسۡرَٰٓءِيلَ } Israail : Israil adalah julukan bagi Ya’qub bin Ishaq bin Ibrahim ‘alahimus salam { بنو إسرائيل } Banuu Israail : Bani Israil adalah orang-orang Yahudi. { ٱلۡعَٰلَمِينَ } al-‘aalamiin : Seluruh manusia yang hidup pada zaman mereka Makna ayat : Allah Ta’ala yang Maha Pengasih mengingatkan orang-orang Yahudi dengan memanggil mereka dengan julukan yang paling mulia, dan memerintahkan agar mengingat banyaknya nikmat-nikmat dari Allah yang telah mereka dapatkan. Serta memerintahkan mereka agar mengingat bahwa Allah telah melebihkan mereka daripada umat lain yang sezaman dengan mereka. Mengingat nikmat artinya mensyukurinya, karena sesungguhnya Allah memerintahkan mereka untuk mensyukuri nikmatNya dengan beriman kepada Allah dan rasulNya serta massuk ke dalam agama yang benar yaitu Islam. Pelajaran dari ayat : • Kewajiban untuk mengingat nikmat Allah yang diberikan untuk hambaNya agar memperoleh dorongan moral untuk mensyukurinya. Karena tujuan mengingat nikmat adalah bersyukur. • Kewajiban menjaga diri dari adzab pada hari kiamat dengan keimanan dan amalan shalih setelah membersihkan diri dari kesyirikan dan kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 122: Kemudian Allah mengulangi seruan kepada bani israil agar mengingat nikmat Allah kepada mereka yang banyak dan oleh sebab itu mengingat Allah haruslah hati – hati, lisan – lisan serta anggota badan mereka, karena sebab rasa syukur haruslah dihadirkan dengan tiga perkara ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Mereka dilebihkan di atas umat yang lain pada masa itu dengan banyaknya para nabi dari kalangan mereka dan diturunkan kepada mereka kitab-kitab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 122",
    "description": "Wahai bani israil! ingatlah nikmat-nikmat-ku yang telah aku berikan kepadamu, yakni nenek moyangmu dahulu, di antaranya nikmat berupa kebebasan dari kejaran firaun, diutusnya banyak rasul, dan diturunkannya kitab-kitab suci; dan di antara nikmat-nikmat itu aku telah melebihkan kamu dari semua umat yang lain di alam ini pada masa itu dengan banyaknya para nabi yang diutus kepada kamu. Ini menunjukkan bahwa Allah benar-benar sangat menyayangi hambanya. Meskipun bani israil telah berkali-kali melakukan pelanggaran, mereka tetap saja diajak dengan harapan mereka dapat percaya kepada nabi Muhammad. Selanjutnya, ayat 123 mengingatkan mereka dan semua orang untuk mempersiapkan diri menghadapi hari kiamat. Dan takutlah kamu dengan cara menjaga diri agar tidak mendapat siksa pada keadaan yang sangat mengerikan di hari kiamat, yaitu ketika tidak seorang pun dapat menggantikan atau membela orang lain sedikit pun. Pada hari itu, tebusan dalam bentuk apa pun untuk menghin dari siksa tidak akan diterima, dan bantuan maupun perantara tidak berguna baginya, dan mereka tidak akan ditolong. Ini mengisyaratkan bahwa berbagai kenikmatan di dunia yang Allah berikan kepada bani israil dan umat lain tidak menjamin hal serupa akan Allah berikan kepada mereka di akhi rat."
  }
]