[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Takutlah kalian terhadap ketakutan yang sangat mengguncang pada hari perhitungan amal, sebab tidak ada seorang yang sanggup menolong orang lain sedikitpun, dan Allah tidak menerima dari tebusan yang menyelamatkan dari siksaan, dan tidak ada yang mampu memberi manfaat dari perantara, dan tidak ada seorangpun yang akan menolongnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Dan buatlah pelindung di antara kalian dan siksa akhirat dengan cara mengikuti perintah-perintah Allah dan menjauhi larangan-larangan-Nya. Karena -pada hari kiamat- seseorang tidak dapat membantu orang lain sedikitpun, tebusan sebesar apapun tidak akan diterima, syafaat dari siapapun yang memiliki kedudukan setinggi apapun tidak ada gunanya, dan tidak ada yang dapat menolong seseorang selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka takut terhadap azab pada hari ketika orang tidak bisa mendapatkan pertolongan sedikitpun dari siapapun. Hari dimana tidak diterimanya tebusan apapun tidak berlaku, bahkan dari siapapun tebusan itu. Juga tidak akan ada siapapun yang dapat memberi pertolongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Takutlah kalian pada hari dimana tidak seorang pun dapat menggantikan orang lain sedikit pun, tebusannya tidak diterima, syafaat tidak berguna baginya, dan mereka tidak akan ditolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122-123. Tafsir ayat telah dijelaskan di atas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { لَّا تَجۡزِي } Laa tajzii : Tidak memenuhi dan memberi manfaat { العدل } al-‘Adl : Tebusan { شفاعة } Syafaa’at : Perantara sesuatu. Makna ayat : Begitu juga Allah memerintahkan mereka untuk berlindung dari adzab Allah pada hari kiamat, karena pada hari itu seorangpun tidak dapat memberi manfaat kepada orang lain, juga tidak diterima tebusan maupun syafa’at dalam bentuk apapun. Yang dimaksud ialah orang kafir dan musyrik karena mereka tidak akan mendapatkan syafa’at dan penolong yang dapat mencegah jatuhnya adzab kepada mereka. Adapun berlindung dari adzab dapat terlaksana dengan cara beriman kepada Allah dan rasulNya serta beramal shalih. Setelah membersihkan diri dari kekufuran dan maksiat. Pelajaran dari ayat : • Mustahil ada tebusan pada hari kiamat, dan tidak adanya penolong yang dapat menolong orang yang mati di atas kesyirikan untuk keluar dari neraka, dan keringanan adzab untuknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 123: Allah memerintahkan bani israil untuk takut pada hari kiamat yang hari tersebut adalah hari yang tidak bernanfaat seorang pun bagi seorang yang lain. dan Allah tidak menerima pada hari tersebut fidyah, dan tidak bermanfaat syafa’at seorang pun bagi yang kafir kepada Allah dan rasulnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: dosa dan pahala seseorang tidak dapat dipindahkan kepada orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 123",
    "description": "Dan takutlah kamu dengan cara menjaga diri agar tidak mendapat siksa pada keadaan yang sangat mengerikan di hari kiamat, yaitu ketika tidak seorang pun dapat menggantikan atau membela orang lain sedikit pun. Pada hari itu, tebusan dalam bentuk apa pun untuk menghin dari siksa tidak akan diterima, dan bantuan maupun perantara tidak berguna baginya, dan mereka tidak akan ditolong. Ini mengisyaratkan bahwa berbagai kenikmatan di dunia yang Allah berikan kepada bani israil dan umat lain tidak menjamin hal serupa akan Allah berikan kepada mereka di akhi rat. Dan ingatlah juga, wahai nabi Muhammad, kisah ketika nabi ibrahim diuji oleh tuhannya dengan beberapa kalimat, yakni sejumlah tugas dan kewajiban, lalu dia melaksanakannya dengan sangat baik dan sempurna. Dia, Allah, berfirman, sesungguhnya aku menjadikan engkau sebagai pemimpin dan teladan bagi seluruh manusia. Dia, ibrahim, berkata, dan apa kah janji-Mu itu berlaku juga bagi sebagian dari anak cucuku' Allah berfirman, benar, tetapi janji-ku itu tidak berlaku bagi orang-orang zalim."
  }
]