[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah -wahai nabi- ketika Allah menguji Ibrahim dengan apa yang disyariatkan nya kepadanya berupa amalan-amalan taklifiyah, dan dia pun menjalankan dan melaksanakannya dengan sebaik-baiknya. Allah berfirman kepadanya: “Aku jadikan kau sebagai teladan baik bagi umat manusia”. Ibrahim Alaihissalam berkata. “Wahai Tuhanku jadikanlah juga dari keturunanku imam-imam sebagai limpahan karunia dari Mu”. Maka Allah menjawab bahwa sesungguhnya kepemimpinan dalam agama tidak akan dipegang oleh orang-orang yang zalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Ingatlah ketika Allah menguji Ibrahim -'alaihissalām- dengan beberapa perintah dan tugas. Lalu Ibrahim berhasil menunaikannya dengan sebaik-baiknya. Maka Allah berfirman kepada Nabi Ibrahim, “Sesungguhnya Aku menjadikanmu sebagai suri teladan bagi manusia agar tindakan dan perangaimu mereka jadikan contoh.” Ibrahim berkata, “Ya Rabbku, jadikanlah juga dari keturunanku pemimpin-pemimpin yang bisa dijadikan suri teladan oleh manusia.” Allah menjawabnya dengan berfirman, “Janji-Ku kepadamu tidak mencakup orang-orang zalim dari keturunanmu untuk menjadi pemimpin dalam urusan agama.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Allah mengingatkan Rasulullah dengan peristiwa ketika Allah menguji Ibrahim dengan perintah-perintah dan larangan-larangan yang ada dalam syariat. Maka Ibrahim menjalankannya dengan sempurna, sehingga Allah memberinya kabar gembira dengan menjadikannya suri tauladan bagi manusia. Kemudian Ibrahim memohon kepada Allah agar membuat keturunannya menjadi para pemimpin. Lalu Allah mengabulkan permohonannya, namun Allah mengabarkan kepadanya bahwa derajat itu tidak meliputi keturunannya yang zalim karena mereka melanggar hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. وَإِذِ ابْتَلَىٰ إِبْرَاهِيمَ رَبُّهُ (Dan (ingatlah), ketika Ibrahim diuji Tuhannya) (الابتلاء) yakni ujuan dan cobaan. بِكَلِمَاتٍ (dengan beberapa kalimat) Yakni dengan kalimat : ( إني جاعلك للناس إماما) “Aku akan menjadikanmu pemimpin bagi manusia” فَأَتَمَّهُنَّ ۖ (lalu Ibrahim menunaikannya). Yakni Ibrahim meminta tambahan cakupan dari kalimat tersebut dengan (ومن ذريتي ) “dan juga keturunanku” Ada pula yang berpendapat bahwa maknanya adalah Ibrahim menjalankan tugas kepemimpinan itu dengan sempurna. قَالَ لَا يَنَالُ عَهْدِي الظَّالِمِينَ (Allah berfirman: “Janji-Ku (ini) tidak mengenai orang yang zalim”) Yakni ketika Ibrahim meminta agar keturunannya juga dijadikan sebagai pemimpin, Allah mengabarkan bahwa diantara keturunannya adalah pelaku kemaksiatan dan kezaliman sehingga mereka tidak layak untuk menjadi pemimpin dan tidak mempu menjalankannya dengan benar dan tidak mendapatkan janji Allah ini; karena pemimpin harus adil dan menjalankan perintah syari’at sebagaimana mestinya, jika tidak maka dia adalah orang yang zalim. Ini juga sebagai perintah bagi hamba-hambaNya agar tidak mengangkat orang yang zalim dalam urusan syari’at, karena sesungguhnya seseorang diangkat sebagai pemimpin adalah agar menjadi panutan dalam urusan agama dengan perkataan dan tingkah lakunya. Sedangkan orang zalim"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tatkala Allah -عز وجل- berkata kepada Ibrahim : { إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا } \"Sesungguhnya Aku akan menjadikanmu imam bagi seluruh manusia\" , Ibrahim kemudian berkata : { وَمِنْ ذُرِّيَّتِي ۖ قَالَ لَا يَنَالُ عَهْدِي الظَّالِمِينَ } \"(Dan saya mohon juga) dari keturunanku\". Allah berfirman: \"Janji-Ku (ini) tidak mengenai orang yang zalim\" ; Ibrahim menginginkan kebaikan bagi keturunan dengan perkataannya yang lain : { وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ } \"dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala\", karena kebaikan seorang anak adalah kebaikan untuk orangtuanya juga : (( إذا مات ابن آدم انقطع عمله إلا من ثلاث : صدقة جارية ، أو علم ينتفع به ، أو ولد صالح يدعو له )) \"Jika anak adam meninggal, maka amalnya terputus kecuali dari tiga perkara; Shadaqah jariyah, ilmu yang bermanfaat dan anak saleh yang mendoakan.” (HR. Muslim, Abu Daud, Tirmizi, An-Nasai, Bukhari dalam kitab Al-Adabul Mufrad, dari Abu Hurairah)\". 2 ). Tidaklah Ibrahim berkata : { وَمِنْ ذُرِّيَّتِي } dan bukan ( وَ ذُرِّيَّتِي ); melainkan ia mengatahui bahwasanya hikmah Allah belum menentukan agar semua keturunan anak manusia menjadi orang-orang yang seluruhnya baik, Ibrahim tidak meminta sesuatu yang pada umumnya adalah mustahil; karena permintaan seperti itu keluar dari garis adab dalam berdoa. 3 ). Perhatikanlah bagaimana kedudukan orang-orang yang berbuat zholim itu, karena sesungguhnya janji Allah adalah pilihan dari-Nya bagi orang-orang yang berhak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": ". Wahai Muhammad, ingatlah ketika Allah menguji Nabi Ibrahim dengan berbagai perintah, dia melalui/mengerjakannya dengan sepenuh hati dan tanggung jawab. Allah berkata: “Aku benar-benar menjadikanmu pemimpin atau contoh yang baik perihal agama dan amal kebaikan. Nabi Ibrahim berdoa: “Ya Allah, jadikanlah anak keturunanku sebagai pemimpin bagi umat mereka. Maka Allah mengkabarkan kepada nabi Ibrahim bahwa anak-cucunya akan menjadi pemimpin dan bahkan menjadi nabi. Allah juga mengkabarkan bahwa anak-cucu nabi Ibrahim tidak akan ada yang terjerumus dalam kedhaliman dan kemaksiatan. Karena ahli maksiat dan orang dholim tidak pantas menjadi contoh bagi manusia. Pemimpin haruslah orang yang mampu berbuat adil dan menjalankan perintah agama, apabila tidak seperti itu maka mereka termasuk orang yang zalim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Ibrahim diuji} diuji {Tuhannya dengan beberapa kalimat} dengan syariat, perintah, dan larangan {lalu dia menyempurnakannya} lalu dia menunaikan dan melaksanakannya dengan sempurna {Allah berfirman,“Sesungguhnya Aku menjadikanmu sebagai pemimpin bagi manusia.”} teladan yang mereka jadikan contoh dan sumber petunjuk {Ibrahim berkata, “Begitu juga dari sebagian keturunanku.” Allah berfirman, “janjiKu tidak diterima} kenabian dan kepemimpinan tidak akan diterima {orang-orang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. Allah ta’ala mengabarkan tentang seorang hamba dan kekasihNya, Nabi Ibrahim alaihissalam -yang telah disepakati kepemimpinan dan kemuliaannya di mana setiap kelompok dari ahli kitab mengakuinya dan bahkan juga orang-orang musyrik- bahwasanya Allah ta’ala menguji dan mencobanya dengan beberapa kalimat yaitu dengan perintah-perintah dan larangan-larangan sebagaimana telah menjadi kebiasaan Allah dalam menguji hamba-hambaNya, agar pembohong yang tidak tegar dalam ujian dan cobaan jelas berbeda dengan orang yang jujur, yang derajatnya akan meningkat dan martabatnya terangkat, amalnya bertambah dan ikhlas, dan orang yang paling mulia dalam perkara ini adalah al-Khalil Ibrahim, dimana beliau menyempurnakan dan memenuhi pelaksanaan ujian Allah bagi beliau, lalu Allah berterima kasih terhadap beliau karena hal tersebut, dan Allah masih saja terus berterima kasih seraya berfirman, “Sesungguhynya Aku akan menjadikanmu imam bagi seluruh manusia.” Maksudnya , mereka akan mengikutimu dalam pertunjuk, dan mereka berjalan dibelakangmu menuju kepada kebahagiaan mereka yang abadi, hingga kamu memperoleh pujian yang abadi, balasan yang sempurna dan penghormatan dari setiap orang. Hal ini –demi Allah- merupakan derajat paling mulia yang diburu oleh orang-orang yang saling berlomba, dan setinggi-tingginya kedudukan yang mana lengan baju orang yang bekerja keras disingsingkan, sesempurna-sempurnanya keadaan yang diperoleh oleh Ulul ‘Azmi dari para Rosul, dan pengikut-pengikut mereka dari kalangan shiddiq mengikuti mereka yang mengajak kepada Allah dan kepada jalanNya. Dan ketika Ibrahim bergembira dengan kedudukan seperti itu, dan memperolehnya, lalu beliau memohon hal itu juga diberikan kepada keturunannya agar derajatnya dan derajat keturunannya tinggi , hal ini merupakan kepemimpinan beliau dan nasihat beliau kepada hamba-hamba Allah serta kebahagiaannya agar banyak di antara mereka orang-orang yang menjadi penyeru kepada petunjuk, maka hanya bagi Allahlah keagungan cita-cita yang tinggi dan kedudukan-kedudukan yang mulia ini. Kemudian Allah yang Maha penyayang lagi Mahalembut mengabulkannya dan Dia mengabarkan tentang penghalang dari memperoleh kedudukan seperti ini dalam FirmanNya, “JanjiKu ini tidak mengenai orang-orang yang zhalim,” maksudnya tidak akan memperoleh kepemimpinan dalam agama bagi orang yang menzhalimi diri sendiri dan memudaratkannya serta merendahkan kedudukannya , karena tidak ada kezhaliman dalam kedudukan ini. Dan sesungguhnya perangkat untuk menggapai kedudukan seperti ini adalah kesabaran dan keyakinan. Hasilnya adalah agar pelakunya berada dalam kondisi keimanan yang kuat dan amalan shalih, akhlak-akhlak yang luhur, karakter yang lurus, kecintaan yang sempurna, rasa takut (kepada siksa Allah), dan penyerahan diri. Maka sungguh jauh hal ini dengan kezhaliman? Pemahaman terbalik dari ayat ini menunjukkan bahwasanya selain orang yang zhalim akan memperoleh kepemimpinan, akan tetapi dengan berusaha melakukan segala factor-faktor penyebabnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱبۡتَلَىٰٓ } Ibtalaa : Ujian bagi Ibrahim untuk melakukan tugas-tugas yang berat baginya. { بِكَلِمَٰتٖ } Bikalimaatin : Kata-kata yang berisikan perintah dan larangan { أَتَمَّهُنَّۖ } Atammahunna : Melaksanakan tugas-tugas itu secara sempurna { إِمَامٗاۖ } Imaaman : Pemimpin yang dapat menjadi panutan dan teladan yang diikuti dalam kebaikan dan kesempurnaan. { ٱلظَّٰلِمِينَ } azh-Zhalimiin : Orang-orang kafir, musyrik dan fasik yang melanggar hak-hak orang lain. Makna ayat : Setelah perdebatan panjang yang telah terjadi antara Rasulullah shallallahu ‘alaihi wasallam dengan dua kelompok ahli kitab Yahudi dan Nasrani, dan juga orang-orang Musyrik pada ayat-ayat sebelumnya, Allah Ta’ala menyuruh rasulNya untuk mengingat ujian yang diberikan kepada kekasihNya Nabi Ibrahim ‘alaihissalam berupa perintah-perintah dan larangan-larangan. Maka beliau melaksanakan dengan sebaik-baiknya, sehingga Allah memberikan nikmat kepadanya dengan nikmat yang paling besar, yaitu menjadi pemimpin bagi manusia. Di antara beberapa bentuk ujian dan tugas yang dialami oleh Nabi Ibrahim antara lain adalah perjuangan untuk menghadapi para penyembah berhala, dan beliau menghancurkan berhala-berhala mereka. Kemudian ujian berupa hijrah meninggalkan negerinya, juga tugas berupa perintah untuk menyembelih anaknya sendiri Isma’il melalui mimpinya, sebagai bentuk pengorbanan kepada Allah Ta’ala. Membangun Ka’bah, berhaji dan menyeru umat manusia untuk berhaji ke baitullah. Hal itu semua pantas menjadikannya sebagai pemimpin dan teladan bagi seluruh manusia. Semua ini merupakan jawaban atas pengakuan tiga kelompok yaitu : bangsa Arab, orang-orang musyrik, dan ahli kitab Yahudi Nasrani. Karena mereka semua mengaku sebagai pengikut nabi Ibrahim dan hidup di atas agamanya. Tapi itu hanyalah sekedar pengakuan saja. Nabi Ibrahim orang yang bertauhid sedangkan mereka berbuat syirik. Ibrahim seorang yang adil sedangkan mereka orang-orang zhalim. Ibrahim mengikuti wahyu yang Allah turunkan sedangkan mereka mengingkarinya. Mereka mendustakan pembawa wahyu. Pada ayat ini nampak keinginan Ibrahim agar kepemimpinan dipegang oleh anak keturunannya, dan ini merupakan keinginan yang baik. Oleh karena itu Allah mewujudkannya pada anak keturunan Ibrahim ‘alahissalam sebagaimana keinginannya. Kecuali orang-orang yang zhalim maka Allah mengecualikannya karena mereka tidak pantas mendapatkannya. Karena kepemimpinan hanya berhak disandang oleh orang-orang yang baik, adil, penuh kasih sayang. Tidak berhak dipegang oleh penguasa yang angkuh, sombong, dan berbuat sewenang-wenang. Pelajaran dari ayat : • Kepemimpinan hanya dapat diperoleh dengan keyaninan yang benar dan kesabaran untuk menapaki jalan-jalan orang yang mendapatkan petunjuk. • Penentuan kepemimpinan dengan cara warisan kepemimpinan dengan standar keimanan, ilmu, amalan, keadilan, dan kesabaran bukan suatu hal yang terlarang dalam agama. • Melaksanakan aturan-aturan syariat Islam baik ucapan maupun perbuatan menjadikan seseorang untuk menjadi pemimpin yang baik bagi umat manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 124: Allah mengabarkan kepada nabi ﷺ bahwasannya Allah menguji hamba dan kekasih-Nya Ibrahim dengan ujian – ujian yang berat secara syariat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada ayat ini, Allah Subhaanahu wa Ta'aala menyebutkan tentang hamba dan kekasih-Nya, yaitu Ibrahim 'alaihis salam, seorang yang telah diakui kepemimpinan dan kemuliaannya oleh semua golongan ahlul kitab, bahkan oleh kaum musyrik. Ujian terhadap Nabi Ibrahim 'alaihis salam berupa beban perintah dan larangan. Contohnya: membangun Ka'bah, membersihkan ka'bah dari kemusyrikan, mengorbankan anaknya Ismail, menghadapi raja Namrudz dan lain-lain. Hal yang sudah menjadi kebiasaan, Allah Subhaanahu wa Ta'aala menguji hamba-hamba-Nya agar diketahui siapa di antara mereka yang dusta dan siapa di antara mereka yang jujur. Orang yang dusta tidak teguh ketika mendapatkan ujian dan cobaan, sedangkan orang yang jujur tetap teguh pendirian, tidak goyang meskipun banyak rintangan dan hambatan. Dengan ujian tersebut, orang yang jujur semakin tinggi derajatnya, bertambah tinggi kedudukannya, semakin bersih amalnya serta semakin kelihatan keistimewaannya, dan di antara contoh terdepan orang yang jujur imannya adalah Nabi Ibrahim 'alaihis salam. Saat ia mendapatkan ujian, ia mampu memenuhinya, maka Allah Subhaanahu wa Ta'aala bersyukur kepadanya, dan Dia senantiasa Maha mensyukuri, Firman-Nya, \"Sesungguhnya Aku akan menjadikan kamu sebagai imam bagi seluruh manusia\" yakni sebagai teladan dan panutan dalam hal petunjuk bagi manusia, mereka yang mengikutinya akan memperoleh petunjuk dan berbahagia, dan ia (Nabi Ibrahim) akan memperoleh pujian yang kekal, pahala yang besar serta penghormatan dari semua orang. Hal ini merupakan kedudukan yang paling tinggi dan paling utama. Ketika Nabi Ibrahim 'alaihis salam telah menerima kedudukan ini, ia meminta kepada Allah agar kedudukan ini diperoleh pula oleh keturunannya. Permintaan ini menunjukkan keimamannya, dan sikap nasihat (tulus) kepada hamba-hamba Allah, kecintaannya agar di antara mereka banyak yang mendapat petunjuk, maka Allah Subhaanahu wa Ta'aala mengabulkannya dan memberitahukan bahwa janji-Nya, yakni kedudukan itu tidak akan diperoleh oleh orang-orang yang zalim. Dengan demikian imamah fid din (kepemimpinan dalam agama) tidak akan diperoleh oleh mereka yang zalim, karena kedudukan tersebut hanyalah bisa diraih dengan sabar dan yakin (lihat surat As Sajdah: 24), di mana dengannya seseorang dapat memiliki iman yang besar dan dapat beramal shalih yang banyak, berakhlak mulia, berkepribadian lurus, memiliki rasa takut yang tinggi kepada Allah dan inabah (kembali) kepada-Nya. (Lihat tafsir Syaikh as Sa'diy). Allah telah mengabulkan doa Nabi Ibrahim 'alaihis salam, karena banyak di antara rasul-rasul itu adalah keturunan Nabi Ibrahim 'alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 124",
    "description": "Dan ingatlah juga, wahai nabi Muhammad, kisah ketika nabi ibrahim diuji oleh tuhannya dengan beberapa kalimat, yakni sejumlah tugas dan kewajiban, lalu dia melaksanakannya dengan sangat baik dan sempurna. Dia, Allah, berfirman, sesungguhnya aku menjadikan engkau sebagai pemimpin dan teladan bagi seluruh manusia. Dia, ibrahim, berkata, dan apa kah janji-Mu itu berlaku juga bagi sebagian dari anak cucuku' Allah berfirman, benar, tetapi janji-ku itu tidak berlaku bagi orang-orang zalim. Dan ingatlah, wahai nabi Muhammad, ketika kami menjadikan rumah ini, yakni kakbah, sebagai tempat berkumpul yang sering dikunjungi, baik pada hari-hari biasa maupun pada musim umrah dan haji, dan juga tempat yang aman bagi manusia. Dan jadikanlah maqa'm ibrahim itu, yakni pijakan ibrahim ketika membangun kakbah, sebagai tempat salat. Dan telah kami perintahkan kepada ibrahim dan ismail, bersihkanlah rumah-ku dari segala bentuk najis, kemusyrikan, dan hal-hal yang tidak pantas diletakkan dan dilakukan di sana sesuai tuntunan agama untuk orang-orang yang tawaf, orang yang iktikaf, orang yang salat yang selalu melakukan rukuk dan sujud!"
  }
]