[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah -wahai nabi- ketika kami menjadikan Ka'bah sebagai tujuan bagi manusia, yang mereka datangi lalu mereka pulang kembali menuju keluarga mereka, kemudian mereka kembali lagi mengunjunginya dan sebagai tempat berkumpul bagi mereka dalam ibadah haji, umroh, tawaf, dan sholat, serta menjadi lokasi yang aman bagi mereka, di mana musuh tidak akan menyerang mereka didalamnya. Dan Kami berfirman: “jadikanlah sebagian dari maqam Ibrahim sebagai tempat sholat, yaitu batu yang menjadi tempat pijakan Ibrahim saat berdiri ketika membangun Ka'bah, dan telah kami wahyukan kepada Ibrahim dan putranya Ismail, “bersihkanlah rumah Ku dari segala najis dan kotoran ,bagi orang yang beribadah di dalamnya dengan tawaf di sekeliling Ka'bah atau beritikaf di masjid dan shalat di sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Dan ingatlah ketika Allah menjadikan Baitul Haram (Ka'bah) sebagai tempat kembalinya manusia yang membuat hati mereka selalu tertambat kepadanya. Setiap kali mereka pergi meninggalkannya, mereka selalu kembali lagi kepadanya. Dan Kami jadikan Ka'bah itu sebagai tempat yang aman bagi mereka, tidak ada yang boleh dizalimi di sana. Dan Allah berfirman kepada manusia, “Jadikanlah batu (maqam Ibrahim) yang pernah digunakan oleh Ibrahim sebagai pijakan kaki ketika berdiri untuk membangun Ka'bah sebagai tempat untuk menunaikan salat.” Dan Kami berpesan kepada Ibrahim dan putranya, Ismail agar mereka membersihkan Baitul Haram dari berbagai kotoran dan berhala, serta mempersiapkannya untuk siapa saja yang hendak beribadah di sana dengan melaksanakan tawaf, i'tikaf, salat dan lain-lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. Hai Rasulullah, sampaikanlah kepada manusia ketika Kami jadikan Baitullah sebagai tempat kembali bagi orang-orang beriman; mereka mendatanginya kemudian mereka kembali kepada keluarga mereka, lalu mereka kembali mendatanginya lagi. Dan Kami jadikan di sana ketenangan jiwa dari perbuatan zalim. Kemudian Allah memerintahkan manusia untuk menjadikan tempat batu yang Ibrahim pakai untuk berdiri saat membangun Ka’bah sebagai tempat untuk shalat. Dan Ibrahim berwasiat kepada anaknya, Ismail agar menjauhkan Baitullah dari segala kotoran dan najis, demi orang-orang yang beribadah di sana yang berthawaf mengelilingi Ka’bah dan mendirikan shalat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. وَإِذْ جَعَلْنَا الْبَيْتَ (Dan (ingatlah), ketika Kami menjadikan rumah itu (Baitullah)) Yakni Ka’bah مَثَابَةً(tempat berkumpul) Yakni tempat kembalinya para jamaah haji setelah mereka berpisah. وَأَمْنًا (dan tempat yang aman) Yakni tempat aman yang tidak boleh ada orang yang ketakutan didalamnya, dan tidak boleh ada orang yang dihukum had jika ia berlindung ke sana, dan siapa yang memasukinya maka ia akan mendapat keamanan. وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى ۖ (Dan jadikanlah sebahagian maqam Ibrahim tempat shalat) Dari Umar bin Khattab, ia berkata: Rasulullah bersabda: ini adalah maqam (tempat berdiri) Ibrahim. Maka aku bertanya: wahai Rasulullah, tidakkah kita menjadikannya tempat salat?. Kemudian turun ayat ini. Maqam adalah batu yang diketahui oleh orang-orang dan dijadikan sebagai tempat mengerjakan shalat sunnah dua rakaat setelah melakukan tawaf. Dulunya Nabi Ibrahim berdiri diatasnya untuk membangun ka’bah saat temboknya telah tinggi, batu ini didatangkan Ismail agar digunakan Ibrahim untuk berdiri diatasnya. Dahulu batu ini menempel pada dinding ka’bah kemudian dipindah pertama kali oleh Umar bin Khattab. أَنْ طَهِّرَا بَيْتِيَ (“Bersihkanlah rumah-Ku) Yakni bersihkan dari berhala-berhala, orang-orang kafir,barang-barang najis, orang-orang junub yang melakukan tawaf, wanita-wanita haid, dan segala keburukan. لِلطَّائِفِينَ (untuk orang-orang yang thawaf) Yakni orang-orang yang mengelilinginya. وَالْعَاكِفِينَ (yang i’tikaf) Yakni orang yang melazimi masjid untuk beribadah. Dan pendapat lain mengatakan: yakni ahli makkah yang bukan penduduk tetap. وَالرُّكَّعِ السُّجُودِ(yang ruku’ dan yang sujud) Yakni orang-orang yang shalat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam ayat ini disebutkan \"mensucikan\" rumah, tetapi bukan berarti rumah (Ka'bah) itu berisi dengan najis, melainkan mensucikannya dari benda-benda yang berbau syirik bukan membersihaknnya dari najis, sebagaimana ketika orang yang junub diperintah untuk bersuci dan penyebabnya bukanlah sekedar junub itu sendiri. 2 ). Diantara maksud dari penertiban kata dalam qur'an adalah menaikkan tingkat suatu perkara dari perkara yang sifatnya lebih khusus menuju perkara yang bersifat umum : { أَنْ طَهِّرَا بَيْتِيَ لِلطَّائِفِينَ وَالْعَاكِفِينَ وَالرُّكَّعِ السُّجُودِ } dalam ayat ini disebutkan tiga perkara yaitu : thawaf yang tidak mungkin didirikan kecuali di masjidilharam, kemudian i'tiqaf yang hanya bisa dilakukan oleh kaum muslimin di masjid-masjid, kemudian shalat yang merupakan ibadah yang dapat dilakukan diseluruh bagian di muka bumi kecuali tempat-tempat yang dilarang oleh syari'at. 3 ). Kepercayaan yang Allah berikan kepada Ibrahim dan Ismail agar mereka membersihkan rumah-Nya adalah merupakan suri tauladan bagi orang-orang yang berthawaf dan orang-orang yang shalat, dan sebagai penjelas atas beberapa ayat tentang hukum-hukum puasa; sebagai ayat yang mengisyaratkan akan kedudukan i'tikaf dan orang-orang yang melaksanakannya, maka patutlah kita untuk menghidupkan amalan yang agung ini pada sepuluh terakhir bulan ramadhan, dengan penuh harapan menggapai keutamaan malam lailatulqadar yang terdapat didalamnya. 4 ). Lihatlah bagaimana Allah memerintahkan dua orang terbaik pada zaman itu dan keduanya adalah Nabi yang diperintahkan untuk menolong orang-orang dalam menjalankan i'tikaf, maka hendaklah para muhsinin mengambil peran dalam membantu orang yang beri'tikaf, mulai dari bantuan makanan dan kebutuhan-kebutuhan mereka lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah, bahwa Kami telah menjadikan Masjidil Haram (Ka’bah) sebagai kiblat untuk menyembah Allah dan tempat berhaji. Juga sebagai tempat yang aman dari kedhaliman dan ketakutan. Wahai kaum muslim, jadikanlah maqam Ibrahim (bekas berpijak) untuk tempat sholat sebagai penghormatan kepada Ibrahim. Kami telah berpesan dan memerintahkan Ibrahim dan Ismail untuk menjaga kesucian Masjidil Haram dari berhala, orang kafir, najis dan kotoran. Semua itu dimaksudkan agar tidak mengganggu kekhusyukan orang yang melaksanakan thawaf, orang yang sholat/beribadah di dalamnya. Umar ibn Al Khattab meriwayatkan bahwa Nabi SAW bersabda “Ini adalah bekas tempat nabi Ibrahim.”, lalu aku (Umar ibn Al Khattab) bertanya: “Ya rasul, apakah boleh jika aku sholat di bekas tempat nabi Ibrahim ini?” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami menjadikan rumah itu} Ka’bah {tempat berkumpul} tempat kembali {dan tempat yang aman bagi manusia.} tempat yang mereka merasa aman di dalamnya {“Jadikanlah sebagian Maqam Ibrahim} dari batu tempat berdirinya Ibrahim di sisi bangunan Ka’bah {sebagai tempat shalat.”} tempat dimana dia shalat di sisinya {Kami wasiatkan} Kami wahyukan {kepada Ibrahim dan Ismail untuk menyucikan rumahKu untuk orang-orang yang tawaf, iktikaf, dan orang-orang yang rukuk dan sujud”} dan orang-orang yang mendirikan ibadah, rukuk, dan sujud di sana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. Kemudian Allah ta’ala menyebutkan sebuah contoh yang abadi yang menunjukkan akan kepemimpinan Nabi Ibrahim yaitu Baitullah al-Haram yang pergi kepadanya dijadikan Allah sebagai salah satu rukun dari rukun-rukun islam, sebagai pengugur dosa dan kesalahan. Ayat ini juga menunjukkan peninggalan-peninggalan Nabi Ibrahim dan keturunannya yang dengannya diketahui kepemimpinan Ibrahim dan selalu diingat kejadiannya dalam FirmanNya, “Dan (ingatlah), ketika Kami menjadikan rumah itu sebagai tempat berkumpul bagi manusia.” Maksudnya , tempat kembali yang mana mereka berkumpul padanya dengan mendapatkan manfaat-manfaat buat mereka, baik agama maupun dunia, mereka berulang-ulang pergi kepadanya dan mereka tidak pernah habis keinginan untuk pergi ke sana. Dan Allah menjadikannya “tempat yang aman, ” yang setiap orang merasa aman dengannya hingga binatang buas sekalipun dan bahkan benda-benda mati seperti pepohonan. Oleh karena itu, mereka di zaman jahiliyah –sekalipun begitu parah kondisi kesyirikan mereka- mereka menghormatinya dengan penghormatan yang tinggi sampai kalau salah seorang mendapatkan orang yang membunuh ayahnya di al-Haram maka dia tidak akan menghardiknya, pengagungan dan kemuliaannya, serta penghormatan manusdia terhadapnya. “Dan jadikanlah sebagian maqam Ibrahim sebagai tempat Shalat.” Kemungkinan maksud dari maqam itu adalah seperti yang diketahui sekarang yaitu yang telah dijadikan sebagai sesuatu yang berhadapan dengan pintu Ka’bah saat ini, dan shalat yang dimaksud adalah shalat sunnah dua rakaat thawaf yang dianjurkan agar dilakukan di belakang Maqam Ibrahim, dan dengan inilah sebagian besar ahli tafsir menafsirkannya. Kemungkinan kata “Maqam” bersifat umum untuk tempat-tempat yang disinggahi oleh Nabi Ibrahim dalam ibadah haji, yaitu semua masy’ar-masy’ar al-Haram, thawaf, sa’I, wuquf di Arafah dan Muzdalifah, melempar jumrah, menyembelih kurban dan sebagainya dari perbuatan-perbuatan haji, dengan begitu makna Firman Allah, “Tempat shalat,” maksudnya tempat ibadah. Artinya adalah contohlah beliau dalam manasik-manasik haji. Semoga makna yang terakhir ini adalah lebih utama karena makna yang pertama termasuk di dalamnya dan kemungkinan lafazhnya dimaksudkan untuknya. “Dan telah kami perintahkan kepada Ibrahim dan Ismail, ” maksudnya Kami mewahyukan kepada keduanya dan Kami perintahkan keduanya untuk menyucikan rumah Allah dari kesyirikan, kekufuran, dan kemaksiatan, dan juga dari kotoran, najis, dan kejorokan untuk “orang-orang yang thawaf” padanya, ”orang-orang yang I’tikaf, rukuk, dan sujud, ” maksudnya orang-orang yang shalat. Thawaf didahulukan karena kekhususannya berkaitan dengan Masjid al-Haram, kemudian I’tikaf, karena di antara syaratnya adalah sebuah masjid secara mutlak, kemudian shalat padahal amalan ini adalah yang paling utama bagi makna ini. Allah menyandarkan rumah kepadaNya karena beberapa faidah. Di antaranya : Bahwasanya hal itu menunjukkan kepada tingginya perhatian Nabi Ibrahim dan Nabi Ismail untuk membersihkannnya, karena Ia adalah rumah Allah, maka mereka berdua bersungguh-sungguh berusaha melakukannya dan mereka berdua benar-benar memusatkan segala upaya mereka dalam hal itu. Yang lain adalah, bahwasanya penyandaran ini menunjukkan kemuliaan dan penghormatan, dan di antara cakupannya adalah Allah memerintahkan hamba-hambaNya untuk mengagungkan dan memuliakannya. Faidah lainnya adalah, bahwasanya penyandaran ini merupakan sebab yang membuka kecenderungan hati kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلۡبَيۡتَ } al-Bait : Maksudnya adalah Ka’bah yang terletak di dalam Masjidil Haram Mekah al-Mukarramah { مَثَابَةٗ } Matsaabah : Sebagai tempat kembali yang menjadi target tujuan bagi orang yang umrah dan jama’ah haji. { َأَمۡنٗا } Amnan : Tempat yang aman bagi orang yang memasukinya { مَّقَامِ إِبۡرَٰهِ‍ۧمَ } Maqaam Ibraahiim : Batu yang dijadikan pijakan oleh Nabi Ibrahim ketika beliau berdiri ntuk membangun Ka’bah. Itu disebabkan ketika bangunan Ka’bah meninggi maka Ibrahim membutuhkan batu yang tinggi digunakan sebagai pijakan untuk meneruskan pembangunan dindingnya. Disediakanlah batu itu dan beliau berdiri di atasnya, sehingga dinamakan sebagai maqaam Ibrahim (tempat berdiri). { مُصَلّٗىۖ } Mushalla : Tempat yang digunakan untuk shalat di dalamnya, di sekitarnya, atau menuju ke arahnya. { عَهِدۡنَآ } ‘Ahidnaa : Kami wasiatkan dan perintahkan. { تطهير البيت } Tathiirul bait : Membersihkan Ka’bah dari kotoran yang nampak seperti darah, kencing, dan kotoran maknawi seperti kesyirikan, bi’dah, dan maksiat. Makna ayat : Ayat-ayat ini masih dalam konteks pengingat kepada kaum musyrikin dan ahli kitab tentang Ibrahim ‘alaihissalam, bapak para nabi dan pemimpin orang-orang yang bertauhid, tentang sejarah perjalanannya yang baik dan terpuji, serta sikap-sikapnya yang menunjukkan tegarnya keimanan, untuk menunjukkan batilnya pengakuan ahli kitab dan kaum musyrikin bahwa mereka mengikuti agama Ibrahim, hanya sekedar kedustaan belaka. Karena Ibrahim ‘alahissalam seorang yang bertauhid sedangkan mereka menyekutukan Allah. Beliau seorang yang beriman sedangkan mereka kafir. Allah Ta’ala berkata kepada nabiNya,”Jelaskan kepada mereka bagaimana Kami jadikan Ka’bah sebagai tempat berkumpulnya manusia, mereka datang secara berbondong-bondong pada setiap waktu untuk berhaji atau melakukan umrah, dan mereka merasakan aman pada jiwa, harta, dan kehormatannya setiap kali mereka memasukinya.” Kami perintahkan kepada mereka yang datang untuk berhaji atau melakukan ibadah umrah agar melaksanakan shalat pada bekas pijakan kaki nabi Ibrahim (Maqam Ibrahim). Oleh karena itu bagi setiap orang yang melakukan thawaf, disunnahkan untuk melakukan shalat dua raka’at di belakang maqam Ibrahim. Begitu juga kami wasiatkan sebelumnya kepada Ibrahim dan anaknya Isma’il agar membersihkan Ka’bah dari segala jenis kotoran baik yang bersifat maknawi seperti berhala, dan beribadah kepada selain Allah, maupun kotoran yang nampak seperti najis, sampah, air kencing, sehingga orang-orang yang melakukan thawaf, shalat, i’tikaf, dapat melaksanakan ibadah tanpa ada gangguan dan kesulitan apapun. Inilah kandungan ayat (125). Pelajaran dari ayat : • Anugerah dari Allah karena menjadikan Ka’bah sebagai tempat kembali dan memberikan jaminan keamanan bagi manusia, wajib untuk disyukuri oleh orang-orang yang beriman. • Salah satu sunnah bagi orang yang thawaf adalah shalat 2 raka’at di belakang maqam Ibrahim • Kewajiban menjaga Ka’bah dan Masjidil Haram dari bahaya yang bisa menimpa orang yang thawaf, i’tikaf, ruku’ dan sujud di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 125: Allah mengabarkan bahwasannya rumah yaitu ka’bah ini adalah kiblat bagi manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa'diy berkata, \"Kemudian Allah Ta'ala menyebutkan contoh tetap yang menunjukkan keimaman Nabi Ibrahim, yaitu Baitullah Al Haram, di mana pergi berhajji ke tempat itu merupakan salah satu rukun Islam yang dapat menghapuskan dosa-dosa dan kelasahan. Di sana terdapat bekas-bekas peninggalan Al Khalil (Nabi Ibrahim 'alaihis salam) dan anak cucunya yang menunjukkan keimamannya dan dapat dikenang keadaannya.\" Seperti untuk hajji, umrah, shalat dan thawaf. Yakni setiap orang yang berada di sana aman, bahkan tidak hanya manusia, hewan pun aman, termasuk juga pepohonan. Oleh karena itu, orang-orang dahulu di zaman Jahiliyyah sangat memuliakan sekali tempat itu, sampai-sampai ketika seseorang berjumpa dengan pembunuh ayahnya di tanah haram, ia tidak berani bangkit menyerangnya. Ketika Islam datang, maka ditambah lagi kehormatan dan kemuliaannya. Ialah tempat berdiri Nabi Ibrahim alaihis salam di waktu membangun Ka'bah. Menurut Syaikh As Sa'diy, maqam di sini ada dua makna, bisa maksudnya adalah maqam yang menghadap ke pintu Ka'bah, sehingga perintah menjadikannya sebagai tempat shalat adalah anjuran untuk mengerjakan dua rak'at thawaf yang dilakukan di belakang Maqam Ibrahim (inilah pendapat mayoritas para mufassir). Bisa juga maksud maqam adalah semua maqam (tempat berdiri) Nabi Ibrahim dalam ibadah hajji, yaitu semua syia'r hajji, seperti: thawaf, sa'i, wuquf di 'Arafah dan Muzdalifah, melempar jumrah, berkurban dan perbuatan lainnya yang termasuk ibadah hajji. Sehingga perintah menjadikan mushalla maksudnya adalah perintah menjadikan tempat beribadah. Perhatian: Maqam di sini bukanlah berati kuburan, karena kuburan dalam bahasa Arab disebut maqbarah, jamaknya adalah maqaabir. Adapun maqaam, berasal dari kata \"Qaama-yaquumu-qiyaam\" artinya berdiri, maqam adalah ismul makaan, yakni tempat berdiri. Hal ini kami sebutkan karena ada sebagian orang yang menganggap bahwa maqam Ibrahim maksudnya adalah kuburan Ibrahim, dengan anggapan yang salah ini akhirnya ia menyatakan tidak mengapa kuburan berada di dalam masjid atau didekatkan dengan masjid. Bahkan hal itu tidak dibenarkan dalam Islam, di samping hal itu merupakan wasilah (sarana) yang bisa mengarah kepada kemusyrikan. Imam Bukhari meriwayatkan dari Anas, bahwa Umar berkata, \"Aku sesuai dengan keputusan Tuhanku dalam tiga hal. Aku pernah berkata, \"Wahai Rasulullah, apa tidak sebaiknya kita jadikan maqam Ibrahim sebagai tempat shalat,\" maka turunlah ayat \"Wattakhidzuu mim maqaami Ibraahiima mushallaa\". Pada ayat hijab, aku pernah berkata, \"Wahai Rasulullah, tidakkah engkau perintahkan istri-istrimu berhijab? Karena yang berbicara dengan mereka ada orang yang baik dan ada orang yang buruk,\" sehingga turunlah ayat hijab. Demikian juga ketika istri-istri Nabi shallallahu 'alaihi wa sallam berkumpul karena cemburu kepada Beliau, maka aku berkata kepada mereka, \"Jika Beliau menceraikan kamu, boleh jadi Allah akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu,\" sehingga turunlah ayat tersebut (lih. At Tahrim: 4). Imam Bukhari menyebutkan juga hadits ini dalam bagian tafsir juz 9 hal. 235, di sana terdapat mutaba'ah Yahya bin Sa'id terhadap Hasyim, Imam Bukhari menyebutkan dalam dua tempat secara mu'allaq. Di sana disebutkan secara tegas, bahwa Humaid mendengar dari Anas. Al Haafizh dalam Al Fat-h juz 2 hal. 51 berkata, \"Oleh karena itu, menjadi aman dari tadlisnya.\" Imam Muslim meriwayatkan dari Ibnu Umar, bahwa Umar berkata, \"Aku sesuai dengan keputusan Tuhanku dalam tiga hal; dalam hal maqaam Ibrahim, dalam hal hijab dan dalam hal pemberian keputusan kepada para tawanan perang Badar.\" Yakni wahyu dan perintah kepada keduanya untuk membersihkan Baitullah dari kemusyrikan, dari kekafiran dan kemaksiatan. Demikian juga membersihkan dari kotoran dan najis. Diidhafatkan/dihubungkan rumah tersebut kepada Allah menjadi \"Rumah Allah\" karena beberapa fa'idah: 1. Agar mendapat perhatian dari Nabi Ibrahim dan Isma'il, karena rumah itu adalah rumah-Nya, sehingga keduanya semangat dalam melakukannya. 2. Diidhafatkan menghendaki agar dimuliakan dan dihormati. 3. Diidhafatkan dengan Allah adalah memiliki daya tarik yang dalam terhadap hati agar kembali kepada-Nya. (Diringkas dari Tafsir As Sa'diy)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 125",
    "description": "Dan ingatlah, wahai nabi Muhammad, ketika kami menjadikan rumah ini, yakni kakbah, sebagai tempat berkumpul yang sering dikunjungi, baik pada hari-hari biasa maupun pada musim umrah dan haji, dan juga tempat yang aman bagi manusia. Dan jadikanlah maqa'm ibrahim itu, yakni pijakan ibrahim ketika membangun kakbah, sebagai tempat salat. Dan telah kami perintahkan kepada ibrahim dan ismail, bersihkanlah rumah-ku dari segala bentuk najis, kemusyrikan, dan hal-hal yang tidak pantas diletakkan dan dilakukan di sana sesuai tuntunan agama untuk orang-orang yang tawaf, orang yang iktikaf, orang yang salat yang selalu melakukan rukuk dan sujud! dan ingatlah ketika nabi ibrahim berdoa dengan mengatakan, ya tuhanku, jadikanlah negeri mekah ini sebagai negeri yang aman dari rasa takut dan perasaan terancam, dan berilah rezeki berupa buah-buahan kepada penduduknya, yaitu khususnya di antara mereka yang beriman kepada Allah dan hari kemudian. Dia berfirman, dan kepada orang yang kafir akan aku beri kesenangan sementara di dunia ini, kemudian akan aku paksa dia ke dalam azab neraka dan itulah seburuk-buruk tempat kembali."
  }
]