[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah -wahai nabi- ketika Ibrahim berkata sambil berdoa, “Wahai Tuhanku jadikanlah Makkah sebagai negeri yang aman dari ancaman rasa takut, dan berilah penduduknya rizki dari berbagai macam buah-buahan, dan khususkanlah dengan rizki ini bagi orang-orang yang beriman kepada Allah dan hari akhir. Allah berfirman: “barangsiapa yang kafir dari mereka akan aku beri rezeki di dunia dan akan aku beri kesenangan sementara, kemudian Aku akan dorong dengan paksa ke dalam siksa neraka.” Dan seburuk-buruknya tempat kembali dan tempat tinggal adalah tempat tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Dan ingatlah -wahai Nabi- ketika Ibrahim berdoa kepada Rabbnya, “Ya Rabbku, jadikanlah Makkah ini negeri yang aman, tidak ada seorangpun yang diperlakukan buruk di sana. Dan anugerahilah penduduknya aneka macam buah-buahan. Dan jadikanlah itu sebagai rezeki hanya bagi orang-orang yang beriman kepada-Mu dan hari Akhir.” Allah berfirman, “Barangsiapa yang kafir di antara mereka, maka Aku akan memberinya sedikit kenikmatan di dunia, kemudian di akhirat kelak Aku akan memasukkannya ke dalam azab neraka. Dan neraka itu adalah seburuk-buruk tempat kembali di hari kiamat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126. Dan sampaikanlah ketika Ibrahim berdoa kepada Tuhannya: “Jadikanlah Makkah sebagai negeri yang menenangkan jiwa, dan berilah rezeki penduduknya yang beriman dengan berbagai macam buah-buahan.” Maka Allah mengabulkan doanya, dan Dia menyebutkan bahwa penduduknya yang kafir juga akan mendapatkan rezeki sedikit kenikmatan, kemudian Allah akan menyeret mereka ke dalam azab neraka. Dan seburuk-buruk tempat kembali adalah neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. هَٰذَا بَلَدًا آمِنًا (negeri ini, negeri yang aman sentosa) Yakni negeri Makkah وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُمْ بِاللَّهِ (dan berikanlah rezeki dari buah-buahan kepada penduduknya yang beriman diantara mereka kepada Allah) Dan bukan kepada orang yang kafir. Sehingga Allah menjawabnya dengan: (ومن كفر) وَمَنْ كَفَرَ (Dan kepada orang yang kafir) Yakni Aku akan memberi rezeki untuk orang-orang mukmin di negeri itu untuk memenuhi janji-Ku dan Aku juga akan memberi rezeki untuk orang kafir. Karena rezeki bukanlah seperti kepemimpinan, kepemimpinan hanya untuk orang mukmin sedangkan rezeki untuk orang mukmin dan kafir. فَأُمَتِّعُهُ(Aku beri kesenangan) Yakni adapun orang kafir akan Aku beri kesenangan dengan sedikit rezeki di dunia. ثُمَّ أَضْطَرُّهُ إِلَىٰ عَذَابِ النَّارِ ۖ ( kemudian Aku paksa ia menjalani siksa neraka) Yakni di akhirat Aku paksa mereka untuk merasakan siksa neraka sampai mereka merasa terpojok dan tidak mendapat tempat membebaskan diri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam surah al-Baqarah ini Ibrahim as. berdoa : { رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا } (“Ya Rabb-ku, jadikanlah negeri ini, negeri yang aman sentosa.”) artinya jadikanlah tempat ini sebagai negeri yang aman. Doa ini tepat karena doa ini [diucapkan] sebelum pembangunan Ka’bah. Dan dalam surah Ibrahim Allah berfirman: { وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا } “Dan ingatlah ketika Ibrahim berdoa: ‘Ya Rabb-ku, jadikanlah negeri ini, negeri yang aman.” [ Ibrahim : 35]. Hal ini pun sesuai (tepat), karena -wallahu a’lam-, kemungkinan do’a ini dipanjatkan untuk kedua kalinya setelah pembangunan Baitullah (Ka’bah), dan didiami oleh para penghuninya, serta setelah kelahiran Ishak, yang usianya tiga belas tahun lebih mudah daripada Ismail. Oleh karena itu, pada akhir do’anya, Ibrahim as. mengucapkan: { الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ } “Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tuaku Ismail dan Ishak. Sesungguhnya Rabb-ku benar-benar Mahamendengar (memperkenankan) doa. ” [ QS. Ibrahim: 39 ]. 2 ). Allah ta'ala dalam surah al-Baqarah berfirman : { رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا } dan dalam surah Ibrahim : { هَٰذَا الْبَلَدَ آمِنًا } dalam surah al-Baqarah kata \"balad\" datang dengan bentuk (nakiroh), sedangkan dalam surah Ibrahim dengan bentuk (ma'rifah), dan rahasia dibalik keduanya adalah : bahwasanya ayat (al-baqarah) Ibrahim berdoa dengan lafazh tersebut sebelum tempat ka'bah berdiri menjadi sebuah wilayah tersendiri, bahkan dia mengucapkannya ketika diperintahkan kepadanya untuk meninggalkan Hajar dan Isma'il yang ketika itu masih merupakan sebuah lembah yang tandus, maka Ibrahim berdoa agar tempat itu menjadi sebuah kota, adapun ayat dalam surah Ibrahim sebagai isyarat bahwasanya Ibrahim berdoa dengan lafazh tersebut ketia ia kembali kepada istri dan anaknya, setelah wilayah itu menjadi sebuah kota, kemudian Ibrahim berdoa untuk keselamatan tempat itu. 3 ). Perhatikanlah bagaimana keterkaitan yang kuat antara keamanan dan rezeki, dan antara takut dan lapar anda akan menemukannya dalam al-qur'an saling berkaitan satu sama lainnya, hal itu menegaskan akan pentingnya menjaga keamanan; dengan dampak yang berpengaruh pada kehidupan dan peribadatan orang-orang dan stabilitas fisik dan psikologis mereka, dan apa keindahan dari kehidupan dan ibadah seseorang jika rasa takut menghantui ? bahkan akan berdampak buruk dalam menjalani aktifitasnya sehari-hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah, ketika Ibrahim berdoa: “Ya Allah, jadikanlah negeri Makkah ini sebagai negeri yang aman bagi para penduduknya. Anugerahkanlah kepada penduduk yang beriman kepada-Mu dan hari akhir berbagai buah-buahan yang dapat diambil dari setiap tempat. Allah menjawab: “Aku akan memberi rizki juga kepada mereka yang kafir. Agar mereka merasakan kesenangan sementara di dunia dari sedikit rizki itu. Kemudian akan Aku tunaikan kepada mereka azab neraka, tak akan ada yang bisa selamat dari azab-Ku. Sungguh neraka Jahanam adalah tempat paling buruk yang diperuntukkan bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Ibrahim berdoa,“Ya Tuhanku, jadikanlah negeri ini, negeri yang aman dan berilah rezeki berupa buah-buahan kepada penduduknya, yaitu orang yang beriman di antara mereka kepada Allah dan hari akhir.” Dia berfirman,} Allah SWT berfirman {“Siapa yang kufur, maka akan Aku beri kesenangan sementara, kemudian akan Aku paksa dia} memaksanya di akhirat {kepada azab neraka. Itulah seburuk-buruk tempat kembali.”} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. ketika Nabi Ibrahim berdoa bagi Baitullah agar Allah menjadikannya sebagai negeri yang aman dan Allah memberikan rizki berbagai macam buah-buahan kepada penduduknya, kemudian beliau menghususkan doa ini hanya bagi orang-orang yang beriman sebagai tindakan kesopanan kepada Allah, di mana doa beliau yang pertama bersifat umum, dan diberi jawaban yang dibatasi dengan selain yang zhalim. dan ketika beliau berdoa agar mereka mendapatkan rizki dan beliau membatasinya hanya bagi orang-orang Mukmin saja, padahal rizki Allah itu menyeluruh kepada orang Mukmin, orang kafir, pelaku kemaksiatan, dan pelaku ketaatan, maka Allah berfirman, “Dan kepada orang yang kafir pun “ Aku memberi rizki kepada mereka semuanya, bukan Muslim maupun kafir. Adapun yang Muslim, dia akan mempergunakan rizki itu untuk beribadah kepada Allah, kemudian dengannya dia berpindah kepada kenikmatan surga, sedangkan yang kafir, dia akan bersenang-senang padanya sementara, “Kemudian Aku paksa ia, ” maksudnya Aku mendorongnya dan mengeluarkannya dengan paksa untuk ‘menjalani siksa neraka, dan itulah seburuk-buruk tempat kembali.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَضۡطَرُّهُۥ } Adhtharruhu : Saya paksa mereka merasakan adzab di neraka. Makna ayat : Pada ayat (126) mengandung perintah Allah Ta’ala kepada rasulNya untuk mengingatkan kembali doa Nabi Ibrahim kepada Rabbnya agar menjadikan Mekah sebagai negeri yang aman dan damai bagi siapa saja yang memasukinya, aman bagi dirinya, hartanya, dan kehormatannya. Juga agar memberikan rizqi bagi penduduknya yang mukmin dengan buah-buahan. Sesungguhnya Allah telah mengabulkan doa Nabi Ibrahim, namun orang-orang kafir tetap mendapatkan rizqi di dunia, akan tetapi haram bagi mereka masuk ke dalam surga di akhirat nanti. Karena Allah Ta’ala telah memaksa mereka untuk merasakan adzab yang pedih di neraka. Sungguh amat buruk tempat kembali mereka, dan neraka sejelek-jelek tempat kembali. Pelajaran dari ayat : • Keberkahan doa Nabi Ibrahim bagi penduduk Mekah, dengan dikabulkannya doa beliau oleh Allah Ta’ala. • Orang kafir tidak terhalang rizqinya disebabkan kekufurannya, akan tetapi dia memperoleh hak dan kesempatan hidup kecuali termasuk golongan yang memerangi kaum muslimin sehingga harus di bunuh, atau masuk Islam. • Tempat kembali bagi orang kafir yang mati adalah neraka. Tidak bisa ditawar lagi. Bahkan mati di tanah haram tidak bermanfaat sama sekali bagi orang kafir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 126: Allah mengabarkan bahwasannya Ibrahim berdoa kepada Rabbnya agar menjadikan mekkah bagai negeri yang aman dan agar menjadikannya rizki dari setiap buah – buahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Do'a awalnya mutlak untuk semua penduduknya, namun kemudian Nabi Ibrahim 'alaihis salam membatasinya untuk orang-orang mukmin saja sebagai adabnya kepada Allah Subhaanahu wa Ta'aala. Rezeki yang Allah berikan adalah untuk semua makhluk baik yang mukmin maupun yang kafir, yang shalih maupun yang bermaksiat. Orang mukmin menggunakan rezeki itu untuk beribadah kepada Allah dan ia akan masuk ke dalam surga, sedangkan orang kafir menggunakannya untuk bersenang-senang saja, dan ia akan dipaksa masuk neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 126",
    "description": "Dan ingatlah ketika nabi ibrahim berdoa dengan mengatakan, ya tuhanku, jadikanlah negeri mekah ini sebagai negeri yang aman dari rasa takut dan perasaan terancam, dan berilah rezeki berupa buah-buahan kepada penduduknya, yaitu khususnya di antara mereka yang beriman kepada Allah dan hari kemudian. Dia berfirman, dan kepada orang yang kafir akan aku beri kesenangan sementara di dunia ini, kemudian akan aku paksa dia ke dalam azab neraka dan itulah seburuk-buruk tempat kembali. Dan ingatlah ketika ibrahim meninggikan fondasi baitullah, yakni kakbah yang sudah ada sejak zaman nabi adam, bersama putranya, ismail, seraya berdoa, ya tuhan kami, terima lah amal saleh dan permohonan dari kami. Sungguh, engkaulah yang maha mendengar permohonan hamba-hamba-Mu, maha mengetahui keadaan mereka."
  }
]