[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah -wahai nabi- ketika Ibrahim dan Ismail meninggikan pondasi Ka'bah sambil mereka berdua memohon kepada Allah dengan penuh kehusyuan, “wahai Tuhan kami, terimalah dari kami amal shaleh kami dan Do’a kami, Sesungguhnya Engkau Maha Mendengar ucapan-ucapan hamba-hamba Mu, lagi maha mengetahui kondisi-kondisi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Dan ingatlah -wahai Nabi- ketika dulu Ibrahim dan Ismail meninggikan pondasi Ka'bah seraya memanjatkan doa -dengan penuh ketundukan dan kerendahan, “Ya Rabb kami, terimalah amal perbuatan kami (diantaranya ialah membangun Ka'bah ini). Sesungguhnya Engkau Maha Mendengar doa kami lagi Maha Mengetahui niat dan perbuatan kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "127-129. Hai Rasulullah,Dan sampaikanlah pula kepada manusia ketika Ibrahim dan Ismail meninggikan pondasi Ka’bah seraya berdoa: “Ya Tuhan kami, terimalah amal dan doa kami, sungguh Engkau Maha Mendengar perkataan hamba-hamba-Mu dan Maha Mengetahui keadaan mereka. Ya Tuhan kami, jadikanlah kami dan keturunan kami orang-orang yang tunduk kepada-Mu dan taat kepada hukum-Mu, dan ajarkanlah kepada kami syi’ar-syi’ar ibadah kami kepada-Mu dan manasik haji kami, dan ampunilah dosa-dosa kami. Sungguh Engkau Maha Penerima taubat hamba-hamba-Mu yang bertaubat serta Maha Pengasih bagi mereka. Ya Tuhan kami, utuslah dari keturunan kami seorang rasul yang membacakan ayat-ayat-Mu kepada mereka dan mengajarkan kepada mereka al-Qur’an dan as-Sunnah, serta menyucikan mereka dari berbagai kemaksiatan. Sungguh Engkau Maha Perkasa dalam siksaan-Nya dan Maha Bijaksana dalam keputusan-Nya. Allah telah mengabulkan doa agung ini, sebagaimana Rasulullah bersabda: “Aku adalah buah dari doa ayahku, Ibrahim.” (dishahihkan oleh Hakim dan disepakati oleh ad-Dzahabi, al-Mustadrak 2/600. dan dishahihkan oleh Al-Albani dalam as-Silsilah as-Shahihah no. 1545)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ (Dan (ingatlah), ketika Ibrahim meninggikan (membina) dasar-dasar Baitullah bersama Ismail (seraya berdoa)) Yakni keduanya meninggikan bangunannya diatas asas yang kuat رَبَّنَا(“Ya Tuhan kami) Yakni sambil mengatakan “Rabbanaa” تَقَبَّلْ مِنَّا ۖ (terimalah daripada kami (amalan kami)) Yakni amalan yang baik ini. إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ(sesungguhnya Engkaulah Yang Maha Mendengar lagi Maha Mengetahui) Yakni Engkau mendengar doa kami dan mengetahui niat kami."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seringkali Allah menyuruh hamba-Nya untuk berdzikir menyebut nama-Nya setiap selesai melakukan suatu ibadah. Diriwayatkan dari Wahib bin al-wardi bahwasanya suatu ketika ia membaca : { وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا } , ia kemudian menangis, dan berkata : wahai engkau kekasih Allah! kamu telah mendirikan rumah-Nya dan engkau merasa akan tidak diterima darimu kebaikan itu ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah juga wahai Rasul, ketika dulu Ibrahim dan Isma’il meninggikan pondasi atau dinding Baitullah. Keduanya berdoa: “Ya rabb, terimalah amal kami baik kami, sesungguhnya Engkau Maha Mendengar doa kami dan Maha Tahu terhadap niat kami.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Ibrahim meninggikan pondasi} pondasi-pondasi {Baitullah bersama Ismail (seraya berdoa),“Ya Tuhan kami, terimalah amal dari kami. Sesungguhnya Engkaulah Yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127. Maknanya, ingatlah saat Nabi Ibrahim dan Nabi Ismail membangun kembali pondasi-pondasi baitullah dan kesinambungan keduanya terhadap pekerjaan yang agung tersebut, dan bagaimana kondisi mereka berdua dalam rasa kekhawatiran dan pengharapan, hingga mereka berdua berdoa kepada Allah disamping bekerja agar Allah menerima perbuatan mereka berdua dan agar Allah menjadikan padanya manfaat yang luas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَإِذۡ } Wa idz : Kata keterangan yang menunjukkan waktu yang telah berlalu, kata ini berkaitan dengan kata yang dihapus, taqdirnya “ingatlah ketika begini dan begini { ٱلۡقَوَاعِدَ } al-Qowa’id : Kata Qowa’id bentuk jamak dari qaa’idah yang berarti pondasi yang dibangun dinding di atasnya. { ٱلۡبَيۡتِ } al-Bait : Ka’bah yang dijaga oleh Allah dan disucikanNya. { إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ } Innaka antas samii’ul ‘aliim : Kalimat ini merupakan bentuk sarana untuk tawassul oleh Nabi Ibrahim dan anaknya, agar Allah mengabulkan doanya. Makna ayat : Konteks ayat masih menyebutkan tentang perjalanan Nabi Ibrahim ‘alahissalam yang memberitakan mengenai ketinggian derajatnya dalam keimanan dan ketaatan, dan besarnya semangat untuk mengejar kebaikan dan meraih rahmat dari Allah. Tiga ayat ini membicarakan tentang Ibrahim dan Isma’il yang mana mereka berdua membangun Ka’bah, meninggikan pondasinya dan berdoa kepada Allah agar menerima amalan mereka berdua dengan bertawasul melalui nama-nama dan sifat-sifat Allah, seperti lafadz “Engkau Maha Mendengar lagi Maha Mengetahui”. Pelajaran dari ayat : • Keutamaan meyumbangkan saham dalam pembangunan masjid • Seorang mukmin yang memahami agamanya akan merasa takut ketika berbuat kebaikan, bahwa Allah tidak menerima amalannya. Sehingga dia berdoa dan bertawasul dengan namaNya dan sifatNya agar Allah menerima amalannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 127: Kemudian Allah menjelaskan keadaan Ibrahim, dan Ismail ketika mereka berdua membangun ka’bah dan pondasinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari tindakan dan ucapan Nabi Ibrahim dan Isma'il 'alaihimas salam dapat diketahui tingginya rasa khauf (takut) dan rajaa' (harap) serta jauh dari ujub (bangga diri). Amal mereka berdua yang begitu mulia dan agung dianggap kurang oleh mereka berdua, sampai-sampai mereka berdo'a kepada Allah agar amal mereka diterima sehingga bermanfa'at, dan seperti inilah kesempurnaan. Mereka juga berdua berdo'a untuk diri mereka dan anak cucu mereka agar tetap di atas Islam; yang hakikatnya adalah ketundukan hati dan patuh kepada Allah Azza wa jalla yang mencakup ketundukan anggota badan. Maha Mendengar ucapan hamba-hamba-Nya. Maha Mengetahui keadaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 127",
    "description": "Dan ingatlah ketika ibrahim meninggikan fondasi baitullah, yakni kakbah yang sudah ada sejak zaman nabi adam, bersama putranya, ismail, seraya berdoa, ya tuhan kami, terima lah amal saleh dan permohonan dari kami. Sungguh, engkaulah yang maha mendengar permohonan hamba-hamba-Mu, maha mengetahui keadaan mereka. Ibrahim dan ismail melanjutkan doanya, ya tuhan kami, jadikanlah kami berdua orang-orang yang berserah diri dan tunduk kepada-Mu, dan jadikanlah juga anak cucu kami menjadi umat yang berserah diri dengan penuh keimanan kepada-Mu dan tunjukkanlah kepada kami cara-cara, yakni manasik dan tempat-tempat melakukan ibadah haji kami, dan terimalah tobat kami. Sungguh, engkaulah yang maha penerima tobat yang begitu banyak, maha penyayang dengan kasih sayang yang amat luas."
  }
]