[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami, jadikanlah kami berdua orang yang teguh di atas Islam, lagi tunduk patuh terhadap hukum-hukum Mu, dan jadikanlah dari keturunan kami umat yang tunduk kepada Mu dengan keimanan, dan ajarkanlah dengan jelas kepada kami rambu-rambu tata cara ibadah kami kepada Mu, dan hapuskanlah dosa-dosa kami. Sesungguhnya Engkau banyak menerima taubat dari hamba-hamba Mu dan memberi rahmat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Ya Rabb kami, jadikanlah kami orang-orang yang menerima perintah-Mu dan tunduk kepada-Mu, tidak menyekutukan-Mu dengan sesuatu. Jadikanlah keturunan kami sebagai umat yang pasrah kepada-Mu. Tunjukkanlah kepada kami tata cara beribadah kepada-Mu. Ampunilah keburukan dan kecerobohan kami dalam menjalankan ketaatan kepada-Mu. Sesungguhnya Engkau Maha Menerima taubat hamba-hamba-Mu yang bertaubat dan Maha Penyayang terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ (Ya Tuhan kami, jadikanlah kami berdua orang yang tunduk patuh (islam) kepada Engkau) Yakni jadikanlah kami teguh diatas islam. Atau tambahlah keteguhan kami diatasnya. Dan yang dimaksud dengan islam disini adalah keimanan dan amal shaleh. وَمِنْ ذُرِّيَّتِنَا (dan (jadikanlah) diantara anak cucu kami umat yang tunduk patuh kepada Engkau) Yakni jadikanlah pula diantara keturunan kami umat yang tunduk patuh kepada Engkau, dan mereka adalah umat Muhammad Shallallahu ‘Alaihi Wasallam Shallallahu ‘Alaihi Wasallam. Dan pendapat lain mengatakan mereka adalah orang arab karena mereka merupakan keturunan nabi Ibrahim dan Ismail. وَأَرِنَا مَنَاسِكَنَا (dan tunjukkanlah kepada kami cara-cara dan tempat-tempat ibadat haji kami) Yakni tempat manasik haji dan penyembelihan. Diriwayatkan dari Mujahid berkata: Nabi Ibrahim berkata: Ya Rabb tunjukkanlah manasik kita. Kemudian Jibril mendatanginya di Ka’bah dan berkata: tinggikanlah dasar bangunan baitullah. Maka Ibrahim pun meninggikannya dan menyempurnakan pembangunannya. Kemudian Jibril memegang tangan Nabi Ibrahim dan membawanya ke Mina, dan ketika sampai di Jumratul Aqabah tiba-tiba Iblis berdiri diatas pohon. Maka Jibril berkata: bertakbir dan Lemparlah Iblis itu. Maka Ibrahim pun bertakbir dan melemparnya, maka iblis pergi ke Juratul wustha, kemudian Ibrahim mengulangi apa yang ia lakukan pertama, begitu pula yang ia lakukan di Jumratus stalistah. Kemudian Jibril Kemudian Jibril memegang tangan Nabi Ibrahim dan membawanya ke Al-Masy’ar Al-Haram dan berkata: ini adalah Al-Masy’ar Al-Haram. Kemudian membawanya ke Arafah dan berkata: “kamu telah mengetahui apa yang telah ku tunjukkan padamu” sebanyak tiga kali. Ibrahim menjawab: Ya. Lalu Jibril berkata: maka serukanlah untuk berhaji. Ibrahim menjawab: bagaimana aku menyerukannya? Jibril berkata: Katakanlah, wahai Manusia jawablah panggilan tuhanmu, maka para hamba-Nya menjawab: Labbaika Allahumma Labbaik. Maka yang menjawab seruan Nabi Ibrahim ketika itu adalah orang yang berhaji."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kedua nabi Allah yang mulia ini telah menuangkan waktunya untuk mendirikan rumah-Nya di muka bumi dan keduanya memohon kepada tuhannya ampunan! alangkah indahnya adab mereka kepada Allah!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "“Ya Tuhan kami, jadikan kami orang yang berpegang teguh kepada Islam. Jadikan kami hamba yang berserah diri untuk taat kepada-Mu. Juga jadikan anak turun kami kumpulan hamba yang berserah diri untuk taat kepada-Mu. Ajarkanlah kami tata cara berhaji dan berkurban (penyembelihan). Ampunilah dosa-dosa kami, karena ampunan-Mu sangat luas untuk hamba-hamba-Mu. Engkau Maha Pengasih dan Maha Pengampun kepada hamba yang bertaubat kepada-Mu. Mujahid berkata bahwa Ibrahim berkata: “Ya Tuhan kami, ajarkan kepada kami tata cara berhaji.” Kemudian datanglah Jibril, kemudian bersama menuju Baitullah. Jibril berkata: “Tinggikalah pondasi Baitullah.”, kemudian Jibril menunjukkan tempat Jamarat di Mina, misy’aril haram, dan padang Arafah. Jibril memerintahkan untuk melafalkan seruan dalam ibadah haji. Jibril berkata: “Wahai manusia, jawablah seruan Tuhanmu.”, sehingga dijawab: “Kami memenuhi panggilan-Mu ya Allah.” Maka orang yang ketika itu menjawab seruan Ibrahim maka dia berhaji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhan kami, jadikanlah kami berdua orang yang berserah diri kepadaMu} dua orang yang patuh kepada perintahMu dan tunduk kepadaMu {juga dari keturunan kami sebagai umat yang berserah diri} yang patuh dan tunduk {kepadaMu, tunjukkanlah kepada kami cara-cara melakukan manasik} dan ajarilah kami syariat-syariat agama kami {dan terimalah taubat kami. Sesungguhnya Engkaulah Yang Maha Penerima Taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Mereka berdua memohon bagi diri mereka dan keturunan mereka agar berpegang teguh kepada Islam yang pada hakikatnya adalah ketundukan hati dan kepatuhannya kepada Rabbnya yang meliputi ketundukan anggota tubuh. “dan tunjukkanlah kepada kami cara-cara dan tempat-tempat kami, ” maksudnya ajarilah kami hal-hal itu dalam bentuk pertunjukkan dan demonstrasi agar lebih mantap. Kemungkinan juga maksud dari manasik di sini adalah seluruh kegiatan yang dilakukan pada saat ibadah haji sebagaimana yang diisyaratkan oleh konteks ayat. Kemungkinan juga maksudnya adalah suatu hal yang lebih umum dari itu semua, yaitu agama secara keseluruhan dan ibadah secara keseluruhan, sebagaimana yang diisyaratkan oleh keumuman lafazh ayat, karena kata ‘annusuku’ berarti peribadahan. Akan tetapi kata ini lebih cenderung dan lebih sering dipakai pada kegiatan-kegiatan ibadah saat haji. Maka hasil dari doa mereka berdua adalah taufik kepada ilmu dan amal shalih. Karena apapun kondisinya seorang hamba itu mesti terpengaruh sehinggah berbuat sesuatu kekurangan dan perlu untuk bertaubat, maka mereka berdua berkata \"dan terimalah taubat kami, sesungguhnya Engkau penerima taubat dan maha penyayang\"."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مُسۡلِمَيۡنِ } Muslimain : Dua hamba yang tunduk kepadaMu, patuh kepada perintahMu dan laranganMu, dan ridha terhadap aturanMu, serta beribadah hanya untukMu. { وَأَرِنَا مَنَاسِكَنَا } Wa arinaa manaasikana : Ajarilah kami bagaimana berhaji ke rumahMu, sebagai ibadah dan manasik untuk Mu. { وَتُبۡ عَلَيۡنَآۖ } Wa tub ‘alainaa : Berilah kami taufiq untuk bertaubat ketika kami berbuat salah dan terimalah taubat kami. Makna ayat : Mereka meminta kepada Allah agar menjadikan mereka berdua termasuk orang-orang yang tunduk kepadaNya, dan juga menjadikan anak keturunannya sebagai umat yang tunduk dan patuh kepada Allah, beriman kepadaNya, bertauhid, dan taat melakukan perintahNya dan menjauhi laranganNya, mengajarkan mereka manasik haji sehingga mereka dapat menunaikan ibadah haji berdasarkan ilmu yang benar, dan Allah menerima taubatnya. Pelajaran dari ayat : • Anjuran untuk meminta keistiqomahan di atas agama Islam untuk diri sendiri dan anak keturunan sampai maut menjemput. • Kewajiban untuk mempelajari manasik haji dan umrah bagi siapa saja yang ingin melakukan ibadah haji dan umrah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 128: Sesungguhnya Ibrahim dan Ismail berdoa bagi diri mereka berdua serta anak keturunan mereka agar senantiasa tetap diatas islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata \"manasik\" pada ayat tersebut bisa maksudnya semua pekerjaan hajji, dan bisa maksudnya lebih umum lagi yaitu agama yang benar dan tata cara ibadah semuanya karena arti nusuk adalah ibadah, namun biasanya dipakai untuk pelaksanaan ibadah hajji. Singkatnya, mereka berdua berdo'a agar diberi taufiq kepada ilmu yang bermanfa'at serta amal yang shalih. Seorang hamba betapa pun banyak ibadahnya, namun tetap tidak lepas dari kekurangan dan butuhnya ia kepada tobat, dan pada pengakuan ini terdapat obat dari penyakit ujub."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 128",
    "description": "Ibrahim dan ismail melanjutkan doanya, ya tuhan kami, jadikanlah kami berdua orang-orang yang berserah diri dan tunduk kepada-Mu, dan jadikanlah juga anak cucu kami menjadi umat yang berserah diri dengan penuh keimanan kepada-Mu dan tunjukkanlah kepada kami cara-cara, yakni manasik dan tempat-tempat melakukan ibadah haji kami, dan terimalah tobat kami. Sungguh, engkaulah yang maha penerima tobat yang begitu banyak, maha penyayang dengan kasih sayang yang amat luas. Mereka melanjutkan doanya, ya tuhan kami, utuslah di tengah mereka seorang rasul dari kalangan mereka sendiri, baik keturunan kami maupun bukan, yang akan membacakan kepada mereka ayat-ayatmu dan mengajarkan kitab Al-Qur'an dan hikmah, yakni sunah yang berupa perkataan, perbuatan, dan ketetapan nabi, kepada mereka, dan menyucikan jiwa mereka dari syirik dan akhlak yang buruk. Sungguh, engkaulah yang mahaperkasa karena tidak seorang pun dapat membatalkan ketetapan-Mu, mahabijaksana karena engkau selalu menem pat kan sesuatu pada tempatnya."
  }
]