[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya Tuhan kami, utuslah di tengah umat ini seorang Rasul dari keturunan Ismail yang akan membacakan ayat-ayat Mu kepada mereka, dan mengajarkan mereka Alquran dan as-sunnah, serta membersihkan mereka dari Syirik dan akhlak buruk. Sesungguhnya Engkau maha perkasa Dzat yang tidak terkalahkan oleh apapun, lagi maha bijaksana yang meletakkan segala sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Ya Rabb kami, utuslah kepada mereka seorang Rasul yang berasal dari mereka, dari keturunan Ismail untuk membacakan kepada mereka ayat-ayat yang Engkau turunkan, mengajarkan kepada mereka Al-Qur`ān dan Sunnah, dan membersihkan mereka dari kemusyrikan dan segala macam kehinaan. Sesungguhnya Engkaulah Yang Maha Perkasa di dalam Żat-Mu dan Maha Bijaksana di dalam tindakan dan keputusan-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. وَابْعَثْ فِيهِمْ (utuslah untuk mereka) Yakni untuk kaum arab para keturunan Nabi Ibrahim dan Ismail. Dan Allah telah menjawab doa nabi Ibrahim dengan mengutus rasul dari keturunannya. رَسُولًا مِنْهُمْ (sesorang Rasul dari kalangan mereka) Yakni Nabi Muhammad Shallallahu ‘Alaihi Wasallam يَتْلُو عَلَيْهِمْ آيَاتِكَ(yang akan membacakan kepada mereka ayat-ayat Engkau) Yakni Nabi Ibrahim berdoa agar diturunkan kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallamal-Qur’an yang dibaca. وَيُعَلِّمُهُمُ الْكِتَابَ(dan mengajarkan kepada mereka Al Kitab) Yakni Al-Qur’an وَالْحِكْمَةَ(dan Al-Hikmah) Yakni pengetahuan agama dan pemahaman dalam hukum-hukum dan syari’at وَيُزَكِّيهِمْ (serta mensucikan mereka) Yakni mensucikan mereka dari kesyirikan dan seluruh kemaksiatan. الْعَزِيزُ (Maha Perkasa) Yakni Pemenang"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Menghafalkan al-Qur'an dan memahaminya serta mengamalkan apa yang terkandung didalamnya tertera dalam satu ayat : { يَتْلُو عَلَيْهِمْ آيَاتِكَ } lafazhkan dan jagalah serta hafalkan, { وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ } didiklah untuk mengerjakan amal shaleh, dan menjauh dari perbuatan yang keji. 2 ). Nabi Ibrahim telah menuangkan keprihatinannya bagi generasi-generasi yang akan datang, tetapi ia tidak lupa kepada keturunannya sendiri, atau orang-orang yang tinggal dalam rumah tangganya, Ibrahim berdoa memohon kepada Allah : { رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ }. 3 ). Allah berfirman : { رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ }, kemudian Allah berkata di akhir ayat : { إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ } , lalu apa sisi kecocokan dari keduanya ? Syaikh Ibnu 'Utsaimin mengatakan : kecocokan \"al-Izzah\" dan \"al-Hikmah\" dengan diutusnya Rasulullah sangat jelas : karena diitusnya Rasulullah sepenuhnya adalah hikmah, dan ada 'izzah : { وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ }"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "“Ya Tuhan kami, utuslah dari bangsa Arab – anak keturunan Ibrahim dan Ismail – sebagi rasul. Dia adalah adalah Muhammad SAW, yang menyampaikan wahyu-Mu kepada mereka. Yang mengajarkan Alquran, hukum syariat, fiqih agama, rahasia-rahasia di bali setiap perkara, dan yang menghindarkan mereka dari syirik, maksiat dan akhlak yang buruk. Sesengguhnya Engkau adalah Tuhan Yang Maha Perkasa dan Maha Menaklukkan, yang tidak akan membuat sesuatu apapun terkecuali di dalamnya ada hikmah dan kemanfaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhan kami, utuslah di antara mereka seorang rasul dari kalangan mereka, yang membacakan kepada mereka ayat-ayatMu, mengajarkan kitab suci dan hikmah kepada mereka} Al-Qur’an dan sunnah {dan menyucikan mereka} membersihkan mereka dari kemusyrikan dan dosa-dosa {Sesungguhnya Engkaulah Yang Maha perkasa lagi Maha bijaksana.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. “Ya tuhan kami, utuslah kepada mereka, ” maksudnya kepada keturunan kami “seorang Rosul di antara mereka, ” agar lebih tinggi derajatnya, agar ditaati dan agar mereka mengenalnya dengan sebaik-baiknya, “yang akan membacakan kepada mereka ayat-ayatMu” dari sisi lafazhnya, menjaga dan menghafal, “dan mengajarkan kepada mereka al-Kitab (al-Qur’an) dan al-Hikmah (as-sunnah), ” sebagai makna darinya “serta menyucikan mereka, ” dengan mendidik mereka atas amalan-amalan shalih dan menjauhkan dari amalan-amalan buruk yang membuat jiwa tidak suci dengannya. “Sesungguhnya Engkaulah yang Mahaperkasa” maksudnya, yang mampu menundukkan segala sesuatu dan yang tidak dapat dibendung kekuatanNya oleh apa pun, ”lagi Mahabijaksana”, yang meletakkan segala sesuatu pada tempatnya maka dengan kemuliaan dan kebijaksanaanMu, utuslah Rosul tersebut kepada mereka. Maka Allah mengabulkan doa mereka berdua, dan Allah mengutus Rosul yang mulia ini (Muhammad) yang dengan beliau keturunan mereka berdua dirahmati Allah secara khusus dan seluruh makhluk secara umum. Oleh karena itu Nabi Muhammad sholallohu 'alaihi wasallam bersabda \"aku adalah do'a bapakku Ibrahim\" (HR. Ahmad No 1545)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَٱبۡعَثۡ فِيهِمۡ رَسُولٗا } Wab’ats fiihim rasuula : Doa ini dikabulkan oleh Allah, dan Muhammad adalah rasul yang mereka berdua maksudkan. { ٱلۡكِتَٰبَ } al-Kitaab : al-Qur’an { َٱلۡحِكۡمَةَ } al-Hikmah : Sunahnya rasul dan rahasia-rahasia syariat, serta benar dalam setiap perkaranya. { وَيُزَكِّيهِمۡۖ } Wa yuzakkiihim : Menyucikan hati mereka dan menyempurnakan akal, menghiasi akhlak dengan ilmu yang diketahui dari al-Qur’an dan sunnah, dari berbagai jenis ketaatan yang telah dijelaskan kepada mereka. { ٱلۡعَزِيزُ ٱلۡحَكِيمُ } al-‘Azizul Hakiim : al-Aziz maknanya adalah Maha Perkasa yang tidak terkalahkan. Al-Hakiim adalah Maha Bijaksana dalam perbuatannya dengan meletakkan segala sesuatu sesuai dengan tempatnya. Makna ayat : Mereka berdua juga meminta Allah ‘Azza wa Jalla agar mengutus rasul dari keturunan keduanya yang membacakan ayat-ayat Allah serta mengajarkan isi al-Kitab dan sunnah sunnah nabinya, serta menyucikan mereka dengan keimanan dan amalan shalih, dan dengan akhlak dan perangai yang baik. Allah Ta’ala telah mengabulkan doa keduanya, dan mengutus rasul dari anak keturunan Isma’il sebagai pemimpin bagi kaum muslimin dan panglima umat manusia di hari kiamat nanti, yaitu Muhammad ﷺ dan telah ditegaskan sendiri oleh Rasulullah dalam sabdanya,”Aku adalah seorang yang didambakan oleh Ibrahim dan kabar gembira yang diberitakan oleh Isa ‘alaihimussalam.” Pelajaran dari ayat : • Kewajiban untuk menyucikan jiwa dengan keimanan dan amalan shalih, serta menghiasinya dengan akhlak, ilmu, dan hikmah. • Anjuran untuk bertawassul kepada Allah agar dikabulkan doanya. Dengan perantaraan nama-nama dan sifat-sifat Allah Ta’ala. Bukan dengan mengunakan perantara hak seseorang atau kedudukannya sebagaimana keadaan para pelakuk bid’ah dan kesesatan. Pada tiga ayat ini Nabi Ibrahim melakukan tawassul menggunakan kalimat berikut ini : “Sungguh Engkau Maha Mendengar lagi Maha Mengetahui.” “Sungguh Engkau Maha Menerima Taubat lagi Maha Penyayang.” “Sungguh Engkau Maha Perkasa lagi Maha Bijaksana.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 129: Kemudian Ibrahim dan Ismail meminta kepada Allah agar mengutus pada umat ini seorang rasul dari keturunan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengartikan hikmah di ayat tersebut dengan tafsirnya. Diartikan dengan Sunnah juga tepat, karena Sunnah merupakan penjelas Al Qur'an, dan di dalamnya terdapat hikmah. Dari syirk dan akhlak yang buruk. Ayat ini menjadi dalil tasfiyah dan tarbiyah dalam berdakwah, yakni dibersihkan segala yang bukan dari Islam dan dibina kaum muslimin dengan Tarbiyah Islamiyyah yang bersumber dari ajaran Islam yang murni. Tasfiyah dan Tarbiyah harus dilakukan, terlebih di zaman sekarang, zaman di mana umat Islam tidak mampu membedakan mana ajaran Islam dan mana yang bukan ajaran Islam, maka seorang da'i hendaknya dalam dakwahnya membersihkan ajaran Islam yang dicampuri oleh berbagai bid'ah serta menerangkan ajaran Islam yang sesungguhnya. Tidak ada sesuatu pun yang dapat menghalangi Allah. Bijaksana artinya tepat, yakni menempatkan sesuatu tepat sesuai dengan tempatnya. Allah Subhaanahu wa Ta'aala mengabulkan permohonan keduanya dan mengutus setelah mereka seorang nabi yang mulia, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 129",
    "description": "Mereka melanjutkan doanya, ya tuhan kami, utuslah di tengah mereka seorang rasul dari kalangan mereka sendiri, baik keturunan kami maupun bukan, yang akan membacakan kepada mereka ayat-ayatmu dan mengajarkan kitab Al-Qur'an dan hikmah, yakni sunah yang berupa perkataan, perbuatan, dan ketetapan nabi, kepada mereka, dan menyucikan jiwa mereka dari syirik dan akhlak yang buruk. Sungguh, engkaulah yang mahaperkasa karena tidak seorang pun dapat membatalkan ketetapan-Mu, mahabijaksana karena engkau selalu menem pat kan sesuatu pada tempatnya. Ayat-ayat sebelum ini memperlihatkan betapa agung dan mulianya nabi ibrahim. Ia dan ajarannya amat pantas untuk diteladani dan tidak sedikit pun pantas dibenci. Dan, karena itu, orang yang membenci agama nabi ibrahim, hanyalah orang yang memperbodoh dirinya sendiri. Dan sungguh, kami telah memilihnya, ibrahim, di dunia ini sebagai rasul. Dan sesung guhnya di akhirat dia termasuk orang-orang saleh yang memiliki tempat dan derajat yang amat tinggi."
  }
]