[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dikatakan kepada orang-orang munafik “berimanlah kalian sebagaimana para sahabat yang telah beriman yaitu beriman dengan hati, lisan dan anggota tubuh”. mereka mendebat seraya berkata : “Apakah kami beriman seperti beriman nya orang-orang yang lemah akal dan pemikirannya sehingga kami dan mereka nantinya sama dalam kebodohan?” maka Allah menjawab mereka dengan menyatakan bahwa sesungguhnya kebodohan hanya melekat pada mereka sedangkan mereka tidak sadar bahwa apa yang ada pada mereka sendiri adalah kesesatan dan kerugian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Apabila mereka disuruh beriman sebagaimana sahabat-sahabat Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- yang telah menyatakan keimanannya, mereka menjawab secara angkuh dan sinis dengan mengatakan, “Apakah kami harus beriman seperti orang-orang yang akalnya rendah itu?!” Padahal sejatinya merekalah yang bodoh, tetapi mereka tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan apabila orang-orang munafik itu dinasehati agar beriman kepada Allah sebagaimana kaum mukminin beriman kepada Rasulullah, maka mereka akan menolak dan bersikap angkuh. Mereka tetap berlepas diri dari keimanan sekuat tenaga, sehingga Allah mensifati mereka sebagai orang-orang yang tak berilmu. Prasangka mereka bahwa kekafiran mereka adalah keimanan dan keimanan yang dianut kaum muslimin adalah kebodohan merupakan tanda bahwa mereka tidak berilmu. Mereka mengatakan: \"Apakah kami harus beriman seperti orang-orang bodoh itu beriman?\" Maka Allah menyangkal mereka dan menyatakan bahwa merekalah sesungguhnya orang-orang yang bodoh, dan bagian dari kebodohan mereka adalah mereka tidak mengetahui keadaan mereka sendiri dan akhir dari urusan mereka kelak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. اَلَآ اِنَّهُمْ هُمُ السُّفَهَاۤءُ وَلٰكِنْ لَّا يَعْلَمُوْنَ (Ingatlah, sesungguhnya mereka itulah orang-orang yang kurang akal, tetapi mereka tidak tahu) Mereka menisbahkan kurangnya akal kepada orang-orang mukmin sebagai bentuk penghinaan, maka Allah menuliskan bahwa sifat kurang akal itu hanya ada pada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara penampakan kesombongan pikiran adalah : ketidak ridhoan terhadap apa yang diridhoi oleh orang-orang kalangan bawah, amatilah ayat-ayat berikut ini : { قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ } \"Mereka menjawab: \"Akan berimankah kami sebagaimana orang-orang yang bodoh itu telah beriman?\" [ al-Baqarah : 13 ], { قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ } \"Mereka berkata: “Apakah kami akan beriman kepadamu, padahal yang mengikuti kamu ialah orang-orang yang hina?” [ asy-Syu'ara' : 111 ], { فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا نَرَاكَ إِلَّا بَشَرًا مِثْلَنَا وَمَا نَرَاكَ اتَّبَعَكَ إِلَّا الَّذِينَ هُمْ أَرَاذِلُنَا بَادِيَ الرَّأْيِ } \"Maka berkatalah pemimpin-pemimpin yang kafir dari kaumnya: “Kami tidak melihat kamu, melainkan (sebagai) seorang manusia (biasa) seperti kami, dan kami tidak melihat orang-orang yang mengikuti kamu, melainkan orang-orang yang hina dina di antara kami yang lekas percaya saja\" [ Hud : 27 ], dan gambaran yang lebis dahsyat adalah : { وَقَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا لَوْ كَانَ خَيْرًا مَا سَبَقُونَا إِلَيْهِ ۚ وَإِذْ لَمْ يَهْتَدُوا بِهِ فَسَيَقُولُونَ هَٰذَا إِفْكٌ قَدِيمٌ } \"Dan orang-orang kafir berkata kepada orang-orang yang beriman: “Kalau sekiranya di (Al Quran) adalah suatu yang baik, tentulah mereka tiada mendahului kami (beriman) kepadanya. Dan karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata: “Ini adalah dusta yang lama”. [ al-Ahqaf : 11 ] ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ketika dimintai (pertanggung jawaban) keimanan dari mereka, mereka enggan meniru orang-orang mukmin dan menggambarkan mereka sebagai orang bodoh yaitu bahwa orang mukmin itu ceroboh dan berpikiran rendah namun kenyataannya merekalah orang-orang bodoh yang sebenarnya, yaitu orang-orang bodoh yang tidak mengetahui hakikat dari apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka, “Berimanlah sebagaimana orang-orang telah beriman,”. mereka menjawab, “Apakah kami akan beriman sebagaimana orang-orang yang bodoh itu beriman?”} orang-orang yang rendah akalnya dan lemah gagasannya. Mereka menisbatkan orang-orang bodoh itu kepada para sahabat {Ingatlah, sesungguhnya mereka itulah orang-orang yang bodoh, tetapi mereka tidak tahu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Maksudnya, bila dikatakan kepada orang-orang munafik “Berimanlah seperti orang-orang beriman, ” yakni seperti berimannya para sahabat, yaitu keimanan dengan hati dan lisan, maka mereka berkata dengan sangkaan mereka yang batil, “Apakah kami akan beriman seperti berimannya orang-orang yang bodoh itu?” maksud mereka –semoga Allah memburukkan mereka – adalah para sahabat karena dugaan mereka bahwasanya kebodohan mereka yang menyebabkan mereka untuk beriman, meninggalkan negeri, dan memusuhi kaum kafir, sedangkan akal menurut mereka adalah berlawanan dengan hal itu. Mereka menisbatkan para sahabat kepada kebodohan, dan kandungan statemen tersebut adalah bahwa merekalah orang-orang yang pintar (cendikiawan) yang memiliki kecerdasan dan pikiran yang matang. Maka Allah membalas mereka dan mengabarkan kepada mereka bahwasanya merekalah orang-orang bodoh yang sebenarnya, karena hakikat kebodohan itu adalah ketidaktahuan seorang manusia kepada kemaslahatan pribadinya dan perbuatannya yang melakukan apa-apa yang justru memudaratkannya. Hal inilah yang terbukti terjadi pada mereka (dan terjadi benar atas mereka), sebagaimana juga akal dan kecerdasan itu adalah pengetahuan seorang manusia kepada halm yang bermanfaat bagi dirinya dan berbuat apa yang berguna untuknya serta menghindar dari apa yang memudaratkan dirinya, dan inilah yang terbukti terjadi pada para sahabat dan kaum Mukminin. Maka patokannya adalah dengan ciri yang menempel pada diri dan bukti, tidak hanya sekedar sangkaan dan perkataan kosong belaka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱلسُّفَهَآءُ : As-Sufahaa’ merupakan bentuk jamak dari Safiih (bodoh) yang berarti akalnya kurang, tidak bsia berpikir dan berusaha sendiri. Makna ayat : Kemudian Allah Ta’ala memberitahukan tentang orang munafik apabila diperingatkan oleh orang mukmin “Jujurlah dalam keimanan kalian dan berimanlah seperti fulan, atau yang lain seperti Abdullah bin Salam, mereka membantah “Apakah kami harus beriman seperti imannya orang-orang bodoh yang tidak memiliki ilmu itu?!” Allah membantah pernyataan mereka dan menegaskan bahwa kebodohan itu ada pada diri orang munafik, bukan pada orang mukmin yang jujur imannya. Lantas Allah Ta’ala memberikan sifat orang munafik dengan kebodohan tidak memiliki ilmu. Pelajaran dari ayat : Orang-orang yang berbuat kerusakan di muka bumi selalu berasalan bahwa perbuatannya sebagai bentuk perbaikan bukan sebagai kerusakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 13: Begitu juga jika dikatakan kepada mereka orang-orang munafik : berimanlah kalian dimana para sahabat telah beriman kepada nabi mereka dengan keimanan yang Hakiki ; mereka menolak dan berkata : Bagaimana mungkin kami melakukan bagaimana perbuatan mereka orang-orang yang bodoh yang lemah akalnya ? ; maka Allah membantah atas perkataan mereka bahwasanya mereka lah orang-orang yang bodoh dan pandir akan tetapi mereka tidak materi keburukan apa yang telah mereka perbuat dan kekejian atas apa yang telah mereka aku kan dari kesombongan dan kekafiran serta kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sebagaimana para sahabat Nabi radhiyallahu 'ahum beriman, di mana iman mereka tidak sekedar di lisan tetapi masuk ke hati dan diamalkan oleh anggota badan, mereka membantah dengan mengatakan, \"Apakah kami akan beriman sebagaimana orang-orang yang kurang akal beriman?\" maka Allah membantah bahwa merekalah yang kurang akal, karena hakikat kurang akal adalah tidak mengetahui hal yang bermaslahat untuk dirinya dan mengerjakan sesuatu yang merugikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 13",
    "description": "Dan apabila dikatakan dan dinasihatkan kepada mereka, berimanlah kamu dengan tulus ikhlas sebagaimana orang lain yang menyambut suara dan seruan akal sehat telah beriman, seperti yang dilakukan para sahabat pengikut nabi Muhammad, mereka menjawab dengan penuh kesombongan dan nada menghina, apakah kami akan beriman seperti orang-orang yang kurang akal itu beriman' tidak pantas bagi kami untuk mengikuti orang-orang bodoh itu, sebab dengan begitu berarti kami sama bodohnya dengan mereka. Allah membantah kecongkakan mereka dengan mengingatkan orangorang mukmin, ingatlah, sesungguhnya hanya mereka itulah orang-orang yang kurang akal dan bodoh, tetapi mereka tidak tahu dan tidak sadar bahwa kebodohan dan sifat kurang akal itu ada dalam diri mereka, dan mereka juga tidak menyadari kesesatan mereka itu. Dan apabila mereka, orang-orang munafik, berjumpa dengan orang yang beriman, mereka berkata, kami telah beriman seperti yang kalian yakini tentang kebenaran rasul dan dakwahnya. Mereka menyatakan beriman secara lisan untuk melindungi diri dan meraih keuntungan material. Tetapi apabila mereka kembali kepada teman-teman dan para pemimpin mereka yang menyerupai setan-setan dalam perilaku mereka yang selalu berbuat kerusakan dan kejahatan, mereka berkata, sesungguhnya kami tidak berubah dan tetap bersama kamu di satu jalan dan satu perbuatan, kami hanya berolok-olok ketika kami mengatakan beriman di hadapan orang-orang mukmin."
  }
]