[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada seorangpun yang berpaling dari ajaran agama Ibrahim (yaitu Islam) kecuali dia seorang yang dungu lagi bodoh. dan sungguh kami telah memilih Ibrahim di dunia ini sebagai nabi dan rasul, dan sesungguhnya di akhirat kelak dia termasuk orang-orang shaleh yang mereka memiliki kedudukan tertinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Tidak ada yang berpaling dari agama Ibrahim -'alaihissalām- dan memilih agama lain kecuali orang yang menzalimi dirinya dengan kebodohan dan pengaturan yang jelek dengan meninggalkan kebenaran menuju kesesatan, dan merelakan dirinya menerima kehinaan. Sungguh Kami telah memilih Ibrahim sebagai rasul dan khalīl. Dan sesungguhnya di akhirat kelak dia termasuk orang-orang saleh yang menunaikan kewajiban yang Allah berikan kepada mereka, sehingga mereka meraih derajat tertinggi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130. Orang yang meninggalkan agama Islam hanyalah orang yang merendahkan dan menzalimi dirinya sendiri. Sungguh Kami telah memilih Ibrahim di dunia sebagai nabi dan rasul, dan di hari kiamat dia termasuk orang-orang yang didekatkan kepada Allah dan mendapat derajat yang tinggi. Syeikh as-Syinqithi berkata: “Allah tidak menjelaskan dalam ayat ini apa itu millah Ibrahim. Namun Allah menjelaskannya dalam firman-Nya: قُلْ إِنَّنِي هَدَانِي رَبِّي إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ دِينًا قِيَمًا مِّلَّةَ إِبْرَاهِيمَ حَنِيفًا ۚ وَمَا كَانَ مِنَ الْمُشْرِكِينَ Katakanlah: \"Sesungguhnya aku telah ditunjuki oleh Tuhanku kepada jalan yang lurus, (yaitu) agama yang benar, agama Ibrahim yang lurus, dan Ibrahim itu bukanlah termasuk orang-orang musyrik\". (al-An’am:161). Dalam ayat ini Allah menjelaskan bahwa millah Ibrahim adalah agama Islam yang Allah mengutus Nabi Muhammad dengannya. Demikian pula dijelaskan dalam firman-Nya: ثُمَّ أَوْحَيْنَا إِلَيْكَ أَنِ اتَّبِعْ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا ۖ وَمَا كَانَ مِنَ الْمُشْرِكِينَ Kemudian Kami wahyukan kepadamu (Muhammad): \"Ikutilah agama Ibrahim seorang yang hanif\" dan bukanlah dia termasuk orang-orang yang mempersekutukan Tuhan. (an-Nahl: 123)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. إِلَّا مَنْ سَفِهَ نَفْسَهُ ۚ (melainkan orang yang memperbodoh dirinya sendiri) Yakni siapa yang membenci millah Ibrahim berarti itu adalah dari kebodohan hakikat dirinya. Dan tidak pernah memikirkan nasib dirinya sehingga membinasakan diri sendiri. اصْطَفَيْنَاهُ (Kami telah memilihnya) Yakni Kami telah memilihnya ketika Kami memerintahkan dia untuk tunduk dan patuh (ber-Islam)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Adapun orang yang tidak percaya dan membenci agama (akidah tauhid) yang dibawa Ibrahim tidak lain hanyalah orang-orang yang membodohi diri mereka sendiri. Orang seperti itu tidak pernah mau berfikir, meremehkan dan memandang rendah kepada ajaran Ibrahim. Padahal Kami telah memilih Ibrahim sebagai seorang rasul di dunia. Kelak di akhirat, Ibrahim termasuk golang orang yang beruntung karena memperoleh ridha Allah. Ayat ini turun kepada kedua putera dua saudara Abdullah bin Salam, yang diajak untuk beriman kepada Allah dan rasulnya. Maka berimanlah mereka berdua: Salamah dan Abu Muhajir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang membenci} melawan dan meninggalkan {agama Ibrahim selain orang yang memperbodoh dirinya sendiri} menyesatkan diri sendiri dengan kebodohan dan perilakunya yang meninggalkan kebenaran menuju kesesatan {Kami benar-benar telah memilihnya} Kami telah memilihnya {di dunia dan sesungguhnya di akhirat dia termasuk orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130. Tidaklah ada orang yang benci “kepada agama Ibrahim” setelah dia mengetahui keutamaanya, “melainkan orang yang memperbodoh dirinya sendiri, ” maksudnya membodohi dan menghinakannya , ridha dengan kehinaan dan menjualnya dengan transaksi yang merugikan, sebagaimana tidak lebih lurus dan tidak lebih sempurna dari orang yang menyukai agama Ibrahim. Kemudian Allah mengabarkan tentang kondisinya di dunia maupun di akhirat seraya berfirman, “Dan sungguh Kami telah memilihnya di dunia, ” maksudnya Kami mengutamakan dan membimbing nya kepada amalan-amalan yang membuatnya termasuk orang-orang yang terpilih dan istimewa, “dan sesungguhnya di akhirat dia benar-benar termasuk orang-orang yang shalih, ” yakni orang-orang yang memiliki derajat yang tinggi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَمَن يَرۡغَبُ عَن مِّلَّةِ إِبۡرَٰهِ‍ۧمَ } Wa man yarghabu ‘an millati Ibraahiim : Kata raghbah disusul dengan ‘an artinya membenci sesuatu dan tidak menyukainya sampai tidak mau menuntutnya. Millah Ibrahim artinya adalah beribadah kepada Allah saja dengan syariat yang diturunkan kepada hamba-hambaNya. { إِلَّا مَن سَفِهَ نَفۡسَهُۥ } Illa man safiha nafsahu : Tidak ada yang membenci millah Ibrahim yaitu agama Islam, kecuali orang yang tidak mengetahui keadaan dirinya sendiri. Dia merendahkan dan menghinakan dirinya dengan cara meninggalkan jalan kemulian, kesempurnaan dan kebahagiaan dirinya yaitu Islam. { ٱصۡطَفَيۡنَٰهُ } Isthofainaahu : Kami memilihnya untuk menerima risalah kami dengan menjadi rasul dan menyampaikannya. Karena itulah kami angkat derajatnya dan kami tinggikan kedudukannya. Makna ayat : Allah Ta’ala menyebutkan pada ayat-ayat sebelumnya mengenai sikap Nabi Ibrahim yang benar pada akidah, keikhlasan, amal shalih, kejujuran, kesetiaannya maka itu memperjelas bahwa agama yang dibawanya adalah benar. Allah Ta’ala berfirman (وَمَن يَرۡغَبُ عَن مِّلَّةِ إِبۡرَٰهِ‍ۧمَ ) “Siapa yang benci kepada agama Ibrahim” yaitu agama yang lurus, terang, dan mudah. Yang membencinya hanyalah orang yang tidak tau jati dirinya sendiri, tidak mengenal kebersihan dan kesucian, serta kesempurnaan dan kebahagiaan dirinya. Pada ayat iini juga Allah menyebutkan nikmatnya bagi Ibrahim dan keutamaan yang didapatkannya. Yaitu Allah Ta’ala telah memilihnya sebagai Rasul di dunia dan mendapatkan kebahagiaan di akhirat bersama orang-orang yang shalih. Pelajaran dari ayat : • Hanyalah orang bodoh yang tidak tau keadaan dirinya siapa saja yang membenci agama Islam, ingin meninggalkannya atau mencari agama yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 130: Allah menjelaskan bahwasannya barangsiapa yang memilih agama selain agama Ibrahim maka Ia adalah orang yang bodoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan keadaan Nabi Ibrahim 'alaihis salam yang sungguh mulia dan menyebutkan tentang sifat-sifatnya yang sempurna, Allah Subhaanahu wa Ta'aala menerangkan bahwa tidak ada yang membenci ajaran Nabi Ibrahim kecuali orang yang dungu dan jahil (bodoh). Di antaranya menjadi; Imam, nabi dan rasul, banyak keturunannya yang menjadi Nabi, diberi gelar khalilullah (kekasih Allah). Orang-orang yang saleh di akhirat mendapatkan derajat yang tinggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 130",
    "description": "Ayat-ayat sebelum ini memperlihatkan betapa agung dan mulianya nabi ibrahim. Ia dan ajarannya amat pantas untuk diteladani dan tidak sedikit pun pantas dibenci. Dan, karena itu, orang yang membenci agama nabi ibrahim, hanyalah orang yang memperbodoh dirinya sendiri. Dan sungguh, kami telah memilihnya, ibrahim, di dunia ini sebagai rasul. Dan sesung guhnya di akhirat dia termasuk orang-orang saleh yang memiliki tempat dan derajat yang amat tinggi. Kalau pada ayat 130 diuraikan kedudukan nabi ibrahim di dunia maupun di akhirat, maka pada ayat ini diuraikan faktor yang membawa beliau ke kedudukan tersebut. Ingatlah, wahai nabi Muhammad, ketika tuhan pemelihara nabi ibrahim berfirman kepadanya, ibra him, berserahdirilah! dia segera menjawab, aku tunduk, patuh, dan berserah diri kepada tuhan seluruh alam."
  }
]