[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan adapun sebab keterpilihan Ibrahim ini adalah karena sikapnya yang bersegera menyerahkan diri kepada Allah tanpa keraguan, ketika Tuhanmu berfirman kepadanya: “dedikasikanlah dirimu dengan ikhlas bagi Allah sebagai seorang yang tunduk kepada Nya”. Maka Ibrahim menjawab, “aku tunduk kepada Allah Rabb alam semesta dalam keikhlasan bertauhid dan cinta dan taubat kepadanya”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Allah memilihnya menjadi orang yang bergegas menuju kepasrahan kepada Allah ketika Rabbnya berfirman kepadanya, “Murnikanlah ibadahmu hanya kepada-Ku dan tunduklah kepada-Ku dengan melaksanakan ketaatan.” Maka Ibrahim menjawab firman Rabbnya dengan mengatakan, “Aku berserah diri kepada Allah Sang Pencipta manusia, Pemberi rezeki mereka dan Pengatur urusan mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "131-132. Dan ingatlah hai Rasulullah, ketika Allah memerintahkan Ibrahim agar mentaati-Nya; maka ia melaksanakan perintah itu dengan penuh pengagungan kepada Allah Tuhan semesta alam. Dan ketika Ibrahim dan Ya’qub berwasiat kepada keturunan mereka, dengan berseru: “Sesungguhnya Allah telah memilihkan bagi kalian agama Islam, maka berpegang-teguhlah kalian kepada agama itu sampai ajal menjemput kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. أَسْلِمْ ۖ (“Tunduk patuhlah!”) Yakni berpegangteguhlah pada Islam sebagai agamamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai rasul, ingatlah ketika Allah berkata kepada Ibrahim: “Pegang teguhlah Islam ini sebagai agama bagimu.” Ibrahim menjawab: “Aku berserah diri untuk beribadah dalam agama Tuhan seluruh alam.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika Tuhan berfirman kepadanya, “Berserah dirilah”} Pasrahkanlah kepadaKu agamamu {Dia menjawab, “Aku berserah diri kepada Tuhan semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131. “Ketika Tuhannya berfirman kepadanya , ’Tunduk patuhlah!’ (Maka) Ibrahim menjawab,” sebagai ketundukan kepada tuhannya, “Aku tunduk patuh kepada Tuhan semesta alam, ” dengan ikhlas dan bertauhid, mencintai, dan pasrah. Maka bertauhid kepada Allah adalah sifat beliau, lalu beliau mewariskannya kepada keturunannya dan mewasiatkannya kepada mereka, dan beliau jadikan tauhid itu sebagai kalimat yang terus ada pada generasi selanjutnya, dan terus diwarisi di antara mereka hingga sampai kepada Ya’qub, lalu beliau juga mewasiatkan hal itu kepada anak-anaknya, “Kalian wahai anak-anak Ya’qub! Bapak moyang kalian telah mewasiatkan kepada kalian secara khusus, maka wajiblah atas kalian tunduk secara sempurna, dan mengikuti penutup para nabi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَسۡلِمۡۖ } Aslim : Berserah dirilah terhadap perintah dan larangan dari Kami, dan beribadahlah kepada Kami (Allah, pent) saja dan jangan menyembah yang lain. Makna ayat : Pada ayat (131) Allah Ta’ala menyebutkan bahwa pilihan itu terjadi karena telah memenuhi semua perintah Rabbnya dengan memeluk agama Islam tanpa ada keraguan sama sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 131: Allah menjelaskan bahwasannya sebab Allah memilih Ibrahim yaitu bahwasannya Ibrahim tunduk kepada perintah Allah secara lisan dan amalan tanpa penolakan ketika diperintahkan kepadanya dengan islam dan tauhid kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebab Ibrahim dipilih oleh Allah Subhaanahu wa Ta'aala adalah karena sikapnya yang segera tunduk dan patuh tanpa ragu-ragu. Yakni ketundukan dengan sikap ikhlas, mentauhidkan-Nya, mencintai dan kembali kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 131",
    "description": "Kalau pada ayat 130 diuraikan kedudukan nabi ibrahim di dunia maupun di akhirat, maka pada ayat ini diuraikan faktor yang membawa beliau ke kedudukan tersebut. Ingatlah, wahai nabi Muhammad, ketika tuhan pemelihara nabi ibrahim berfirman kepadanya, ibra him, berserahdirilah! dia segera menjawab, aku tunduk, patuh, dan berserah diri kepada tuhan seluruh alam. Salah satu faktor yang membuat kedudukan nabi ibrahim tinggi di dunia dan akhirat adalah islam, yaitu penyerahan diri sepe nuhnya kepada Allah. Dan ibrahim pun mewasiatkan ajaran penyerahan diri itu kepada anak-anaknya, ismail dan ishak. Demikian pula yakub, ia berwasiat kepada anak-anaknya, wahai anak-anakku! sesungguhnya Allah telah memilih agama penyerahan diri ini untukmu, maka janganlah kamu mati kecuali dalam keadaan muslim yang berserah diri."
  }
]