[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah mengajak Ibrahim dan Ya'kub kepada putra-putra mereka berdua supaya teguh di atas Islam dengan berkata, “wahai anak-anak kami, sesungguhnya Allah telah memilih bagi kalian agama ini (yaitu agama Islam) maka janganlah kalian meninggalkannya selama hidup kalian, dan jangan sampai kematian datang kepada kalian kecuali kalian berpegang teguh kepadanya”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "132. Ibrahim berwasiat kepada anak-anaknya dengan kalimat ini, “Aku berserah diri kepada Rabb semesta alam.” Dan kalimat itu juga diwasiatkan oleh Ya'qūb kepada anak-anaknya. Mereka berdua berseru kepada anak-anak mereka, “Sesungguhnya Allah telah memilih agama Islam untuk kalian. Maka peganglah agama Islam itu dengan kuat sampai maut menjemput kalian, sementara kalian berserah diri kepada Allah secara lahir dan batin.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "132. وَوَصَّىٰ بِهَا إِبْرَاهِيمُ بَنِيهِ (Dan Ibrahim telah mewasiatkan ucapan itu kepada anak-anaknya) Yakni berwasiat dengan kalimat : (أسلمت لرب العالمين) “Aku tunduk patuh kepada Tuhan semesta alam”. وَيَعْقُوبُ(demikian pula Ya’qub) Yakni juga berwasiat sebagaimana Ibrahim berwasiat untuk anak-anaknya. Ya’kub berkata: يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَىٰ لَكُمُ الدِّينَ(“Hai anak-anakku! Sesungguhnya Allah telah memilih agama ini bagimu) Yakni Allah memilihkan untuk kalian yaitu agama yang dibawa oleh Muhammad Shallallahu ‘Alaihi Wasallam. فَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ(maka janganlah kamu mati kecuali dalam memeluk agama Islam”) Yakni berpegang teguhlah pada Islam jangan kalian tinggalkan selamanya, sampai jika kematian mendatangi kalian kalian tetap dalam keadaan Islam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالُوا نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ آبَائِكَ } \"Mereka menjawab: \"Kami akan menyembah Tuhanmu dan Tuhan nenek moyangmu\", { وَاتَّبَعْتُ مِلَّةَ آبَائِي } \"Dan aku pengikut agama bapak-bapakku\" [ Yusuf : 38 ], { إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُقْتَدُونَ } \"”sesunggguhnya kami mendapati leluhur kami di atas suatu ajaran dan agama, dan sesungguhnya kami hanya mengikuti dan meneladani manhaj dan jejak mereka\" [ az-Aukhruf : 23 ], konsistensi para ayah dan orang-orang tua atas apa yang menjadi kewajiban mereka sangat berpengaruh terhadap perkembangan diri anak-anak dan keturunan-keturunan mereka, dan merupakan perkara yang sebagian besarnya adalah nyata dan perkara ini tidak mungkin diingkari, maka dapat dipastikan bahwa hidayah itu bisa menjadi warisan yang turun temurun terus berlanjut secara fitrah, adapun kesesatan sebagian besarnya disebabkan oleh fanatisme golongan, oleh karena itu menjadi sebuah kewajiban bagi seorang ayah melindungi keluarganya dari perkara ini, dan jika kamu menghendaki untuk anak-anak dan keturunan-keturunanmu berada dalam kebaikan maka jadilah kamu orang tua yang baik { وَكَانَ أَبُوهُمَا صَالِحًا } \"sedang ayahnya adalah seorang yang saleh\" [al-kahfi 82]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ibrahim berwasiat kepada anak keturunannya untuk senantiasa berpegang teguh kepada agama Allah. Sebagaimana Ya’qub juga berwasiat kepada Bani Israil seperti apa yang dikatakan Ibrahim: “Wahai putera-puteraku, sesungguhnya Allah telah memilihkan bagi kalian semua pegangan. Pegangan yang akan disampaikan oleh Muhammad SAW, ketahuilah bahwa pegangan itu adalah agama yang suci dan murni. Istiqamahlah dalam Islam, jangan sampai kalian mati kecuali dalam keadaan berpegang teguh kepada Islam.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ibrahim mewasiatkan itu kepada anak-anaknya dan demikian pula Ya‘qub, “Wahai anak-anakku, sesungguhnya Allah telah memilih agama ini untuk kalian} Allah telah memilih agama Islam untuk kalian {Jangan sekali-kali kalian mati kecuali dalam keadaan muslim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "132. “Hai anak-anakku! Sesungguhny Allah telah memilih agama ini bagimu.” Maksudnya Allah telah menjadikannya untuk kalian dan memilihnya bagi kalian sebagai kasih sayang dan berlaku baik kepada kalian, maka laksanakanlah, tunaikanlah syariat-syariatnya, hiasilah diri kalian dengan akhlak-akhlaknya hingga kalian senantiasa seperti itu, dan tidaklah kematian itu mendatangi dirimu kecuali kalian masih berpedoman padanya, karena barangsiapa yang hidup dengan suatu ajaran, niscaya dia akan meninggal dengan ajaran tersebut, dan barangsiapa yang meninggal dengan suatu ajaran, niscaya dia akan dibangkitkan dengan ajaran tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱصۡطَفَىٰ لَكُمُ ٱلدِّينَ } Isthofaa lakumud diin : Allah Ta’ala telah memilih untuk kalian agama Islam, dan meridhainya untuk kalian maka jangan kalian meninggal kecuali dalam keadaan Islam. Makna ayat : Pada ayat (132) Allah Ta’ala menegakkan hujjahNya kepada kaum musyrikin dan ahli kitab. Karena agama Islam tegak di atas tauhid dan itulah wasiat Ibrahim kepada anak-anaknya, sebagaimana Ya’qub juga berwasiat kepada anak-anaknya seraya berkata kepada mereka,”Jangan kalian mati kecuali di atas agama tauhid.” Lalu dimanakah para penyembah berhala, agama Yahudi, dan Nasrani dari agama Ibrahim? Hendaknya orang yang berakal merenungi hal ini. Pelajaran dari ayat : • Islam adalah agama manusia seluruhnya, sedangkan agama yang lain adalah bid’ah dan batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 132: Allah mengabarkan bahwasannya Ibrahim dan Yakub menganjurkan anak keturuan mereka berdua untuk tetap diatas islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni agama Islam sebagai rahmat dan ihsan-Nya kepada kita. Dari ayat ini kita mengetahui bahwa agama para nabi semuanya adalah Islam. Hal itu, karena Islam bila dimaknakan secara umum adalah beribadah hanya kepada Allah Ta’ala dan menjauhi sesembahan selain Allah sesuai syari’at rasul yang diutus. Oleh karena itulah, agama para nabi adalah Islam. Orang-orang yang mengikuti rasul di zaman rasul tersebut diutus adalah orang Islam (muslim). Orang-orang Yahudi adalah muslim di zaman Nabi Musa ‘alaihis salaam diutus dan orang-orang Nasrani adalah muslim di zaman Nabi ‘Isa ‘alaihis salaam diutus, adapun setelah diutusnya Nabi Muhammad shallallahu ‘alaihi wa sallam, maka orang muslim adalah orang yang mengikuti (memeluk) agama Beliau shallallahu ‘alaihi wa sallam, sedangkan yang tidak mau memeluk agama Beliau adalah orang-orang kafir. Oleh karena itu, agama Nabi Ibrahim dan agama Nabi Ya'qub adalah Islam, bukan agama Yahudi atau Nasrani. Orang yang hidup di atas sesuatu, biasanya meninggal di atasnya, dan jika meninggal di atasnya, maka ia akan dibangkitkan di atas itu pula. Nabi Ibrahim dan Ya'qub 'alaihimas salam mewasiatkan kepada anak-anaknya agar mereka hidup di atas Islam dan meninggal di atas Islam agar nanti dibangkitkan di atasnya pula."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 132",
    "description": "Salah satu faktor yang membuat kedudukan nabi ibrahim tinggi di dunia dan akhirat adalah islam, yaitu penyerahan diri sepe nuhnya kepada Allah. Dan ibrahim pun mewasiatkan ajaran penyerahan diri itu kepada anak-anaknya, ismail dan ishak. Demikian pula yakub, ia berwasiat kepada anak-anaknya, wahai anak-anakku! sesungguhnya Allah telah memilih agama penyerahan diri ini untukmu, maka janganlah kamu mati kecuali dalam keadaan muslim yang berserah diri. Orang-orang yahudi berkata kepada rasulul lah, tidakkah engkau tahu bahwa yakub'yang juga disebut israil'menjelang kema tiannya berwasiat kepada anak-anaknya untuk memeluk agama yahudi' untuk menjawab hal itu Allah menurunkan ayat ini. Apakah kamu menjadi saksi saat maut akan menjemput yakub, ketika dia berkata kepada anakanaknya, apa yang kamu sembah sepeninggalku' tentu orang-orang yahudi itu tidak menyaksikan nya, sehingga ucapan mereka hanya dusta belaka. Menjawab pertanyaan nabi yakub, mereka, yakni anak-anak nabi yakub, menjawab, kami akan menyembah tuhanmu dan tuhan nenek moyangmu yaitu ibrahim, ismail, dan ishak, yaitu tuhan yang maha esa, dan kami hanya berserah diri kepada-Nya. (lihat: surah a'li imra'n/ 3: 84)."
  }
]