[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian –wahai kaum Yahudi- ada disana ketika tanda-tanda kematian datang pada Ya’kub. saat dia mengumpulkan anak-anaknya dan menanyakan kepada mereka, “siapa yang akan kalian sembah setelah kematianku?”, mereka menjawab, “kami hanya beribadah kepada Tuhanmu, Tuhan kakek moyangmu Ibrahim, Ismail, dan Ishak. yaitu Tuhan Yang Maha Esa, dan kami taat dan tunduk patuh kepada Nya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "133. Apakah kamu hadir ketika Ya'qūb menjelang wafatnya bertanya kepada anak-anaknya, “Apa yang akan kalian sembah setelah kematianku?” Mereka menjawab, “Kami akan menyembah Rabbmu dan Tuhan para leluhurmu, Ibrahim, Ismail dan Ishak. Yaitu Tuhan Yang Maha Esa yang tidak ada sekutu bagi-Nya. Dan hanya kepada-Nya lah kami akan tunduk dan berserah diri.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "133. Allah mengolok orang-orang musyrik Arab dan orang-orang kafir dari kalangan bani Israil: “Apakah kalian hadir ketika kematian mendatangi Ya’qub, saat ia bertanya kepada anak-anaknya: ‘apa yang akan kalian sembah setelah kematianku?’ Maka mereka menjawab: ‘Kami akan menyembah Tuhanmu Yang Maha Esa, dan Dia adalah Tuhan para pendahulumu, Ibrahim, Ismail, dan Ishaq. Kami akan mengesakan-Nya dan benar-benar mentaati-Nya.’”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "133. أَمْ كُنْتُمْ شُهَدَاءَ (Adakah kamu hadir) Kalimat ini ditujukan untuk orang-orang Yahudi dan Nasrani yang menisbahkan kepada Ibrahim dan keturunannya bahwa mereka beragama Yahudi atau Nasrani. Sehingga Allah membantah mereka dengan berfirman: apakah kalian hadir ketika Ya’kub dalam keadaan sekarat, dan tahukah kalian apa yang diwasiatkannya kepada keturunannya, sehingga kalian mengklaim demikian itu dengan ilmu kalian; atau kalian tidak hadir ketika itu kemudian kalian membuat kebohongan? مِنْ بَعْدِي(sepeninggalku) Yakni setelah kematianku آبَائِكَ (bapak-bapakmu) Nabi Ismail adalah paman dari Nabi Ya’kub akan tetapi orang-orang arab menyebut paman dengan panggilan bapak. وَنَحْنُ لَهُ مُسْلِمُونَ (dan kami hanya tunduk patuh kepada-Nya) Yakni Nabi Ya’kub mengambil perjanjian kepada anak-anaknya saat datang sakaratul maut agar mereka menyembah Allah dan tidak mempersekutukannya. Kemudian mereka menyetujui itu dan bersaksi bahwa mereka adalah orang-orang yang tunduk patuh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالُوا نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ آبَائِكَ } \"Mereka menjawab: \"Kami akan menyembah Tuhanmu dan Tuhan nenek moyangmu\", { وَاتَّبَعْتُ مِلَّةَ آبَائِي } \"Dan aku pengikut agama bapak-bapakku\" [ Yusuf : 38 ], { إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِمْ مُقْتَدُونَ } \"”sesunggguhnya kami mendapati leluhur kami di atas suatu ajaran dan agama, dan sesungguhnya kami hanya mengikuti dan meneladani manhaj dan jejak mereka\" [ az-Aukhruf : 23 ], konsistensi para ayah dan orang-orang tua atas apa yang menjadi kewajiban mereka sangat berpengaruh terhadap perkembangan diri anak-anak dan keturunan-keturunan mereka, dan merupakan perkara yang sebagian besarnya adalah nyata dan perkara ini tidak mungkin diingkari, maka dapat dipastikan bahwa hidayah itu bisa menjadi warisan yang turun temurun terus berlanjut secara fitrah, adapun kesesatan sebagian besarnya disebabkan oleh fanatisme golongan, oleh karena itu menjadi sebuah kewajiban bagi seorang ayah melindungi keluarganya dari perkara ini, dan jika kamu menghendaki untuk anak-anak dan keturunan-keturunanmu berada dalam kebaikan maka jadilah kamu orang tua yang baik { وَكَانَ أَبُوهُمَا صَالِحًا } \"sedang ayahnya adalah seorang yang saleh\" [al-kahfi 82]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah menyanggah pernyataan Yahudi dan Nasrani bahwa Ibrahim adalah seorang Yahudi atau Nasrani. Allah berkata: “Apakah Aku belum mempersaksikan dan mengutus Ya’qub kepada kalian? Apakah kalian tidak tahu wasiat Ya’qub kepada putera-puteranya menjelang kewafatannya?”, saat itu Ya’qub berkata: “Apa yang akan kalian sembah sepeninggalku?” Kemudian mereka menjawab: “Kami akan tetap menyembah Tuhan Yang Maha Satu, Tuhan-mu, dan juga Tuhan para pendahulumu Ibrahim, Ishaq dan Isma’il (paman Ya’qub, dalam Arab disebut sebagai ayah.) Kami berserah diri untuk senantiasa beribadah kepada-Nya.” Sehingga mereka berikrar dan bersyahadat atas keislaman mereka. Ayat ini diturunkan untuk kaum Yahudi yang bertanya kepada Nabi SAW: “Apakah engkau tidak tahu wahai Muhammad, ketika menjelang kewafatannya Ya’qub berwasiat kepada para puteranya untuk tetap berpegang teguh kepada agama Yahudi.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian menjadi saksi} hadir {ketika kematian menghampiri Ya‘qub ketika dia berkata kepada anak-anaknya, “Apa yang kalian sembah sepeninggalku?” Mereka menjawab, “Kami akan menyembah Tuhanmu dan Tuhan nenek moyangmu: Ibrahim, Ismail, dan Ishaq, yaitu Tuhan Yang Maha Esa dan kepadaNyalah kami berserah diri.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133. Dan ketika Yahudi mengklaim bahwasanya mereka berpegang pada agama Nabi Ibrahim dan orang yang setelahnya, Nabi Ya’qub maka Allah berfirman sebagai bantahan atas klaim mereka tersebut, “Adakah kamu hadir, ” maksudnya berada di sana, “ketika ya’qub kedatangan tanda-tanda maut,” yaitu pendahuluan dan sebab-sebabnya. Lalu beliau berkata kepada anak-anaknya sebagai sesuatu tes, dan agar hatinya lega dalam kehidupannya dengan ketaatan mereka terhadap apa yang diwasiatkannya, “Apa yang kamu sembah sepeninggalku?” maka mereka menjawabnya dengan hal yang membuat hatinya lega, mereka berkata “Kami akan menyembah Tuhanmu dan Tuhan nenek moyangmu, Ibrahim, Ismail, dan Ishaq, (yaitu) Tuhan yang Maha Esa, ” kami tidak menyekutukanNya dengan sesuatu pun dan kami tidak menyimpang darinya, “dan kami hanya tunduk patuh kepadaNya.” Mereka telah menyatukan antara tauhid dan perbuatan. Dan telah diketahui bahwa mereka (kaum Yahudi) tidak hadir di sisi Nabi Ya’qub, karena mereka belum diciptakan saat itu, lalu ketika mereka (kaum Yahudi) tidak hadir, maka sungguh Allah telah mengabarkan tentang beliau bahwa beliau mewasiatkan anak-anaknya dengan Agama yang hanif (bersih dari syirik dan kebatilan) dan bukan dengan agama Yahudi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { يَعۡقُوبَ } Ya’quub : Ya’qub adalah Israil bin Ishaq bin Ibrahim. Anak-anaknya adalah Yusuf dan saudara-saudaranya. Makna ayat : Pada ayat (133) disebutkan bahwa Allah mencemooh celotehan orang-orang Yahudi yang berdusta kepada Nabi ﷺ : “Bukankah engkau tahu bahwa Ya’qub berwasiat kepada anak keturunannya untuk mengikuti agama Yahudi.” Maka Allah membantah dalam firmanNya ( أَمۡ كُنتُمۡ شُهَدَآءَ ) “Apakah kamu hadir” ketika Ya’qub menghadapi sakaratul maut kemudian beliau bertanya kepada anak-anaknya,”Apakah yang kalian sembah sepeninggalku?” mereka menjawab dengan satu jawaban (نَعۡبُدُ إِلَٰهَكَ وَإِلَٰهَ ءَابَآئِكَ إِبۡرَٰهِ‍ۧمَ وَإِسۡمَٰعِيلَ وَإِسۡحَٰقَ إِلَٰهٗا وَٰحِدٗا وَنَحۡنُ لَهُۥ مُسۡلِمُونَ ) “Kami menyembah tuhanmu, tuhan nenek moyang kami Ibrahim, Ismail, Ishaq, Tuhan yang satu dan kami adalah orang-orang yang muslim.” Apabila mereka berkata “Kami hadir” sungguh telah berdusta dengan kedustaan yang besar, namun jika mereka berkata “Kami tidak hadir” maka telah batal pengakuan yang mereka buat bahwa Ya’qub berwasiat agar anak keturunannya beragama Yahudi. Maka telah tetap bahwa beliau berwasiat agar anak keturunannya komitmen kepada agama Islam, bukan agama Yahudi. Pelajaran dari ayat : • Dianjurkan bagi orang yang sakit untuk membuat wasiat untuk anak keturunannya dan keluarganya agar tetap komitmen di atas agama Islam sampai maut menjemput. • Kebohongan kaum Yahudi, dan benarlah orang yang mengatakan,”Kaum Yahudi adalah pembohong.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 133: Kemudian Allah mengarahkan pembicaraan kepada orang – orang yahudi dan berkata mengingkari: Apakah kalian pada saat itu hadir ketika Yakub meninggal, apa yang kalian ibadahi setelah kematiannya? mereka berkata kami beribadah kepada tuhan mu dan tuhan bapakmu Ibrahim dan Ismail serta Ishak tuhan yang satu tanpa menyekutukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika orang-orang Yahudi menyangka bahwa mereka di atas agama Ibrahim dan agama Nabi Ya'qub 'alaihimas salam, maka Allah Subhaanahu wa Ta'aala mengingkari mereka dengan firman-Nya di atas. Saat telah tiba tanda-tanda akan wafatnya. Dengan maksud menguji mereka dan agar hatinya tenteram. Pada kata-kata mereka ini terdapat penggabungan antara tauhid dan amal. Tauhid diambil dari kata-kata mereka \"Kami akan menyembah Tuhanmu dan Tuhan nenek moyangmu, yaitu Ibrahim, Ismail dan Ishaq, (yaitu) Tuhan yang Mahaesa\", sedangkan amal, diambil dari kata-kata mereka, \"Kami hanya tunduk patuh kepada-Nya\". Inilah arti Islam secara istilah, yakni menyerahkan diri kepada Allah dengan mentauhidkan-Nya, tunduk patuh kepada-Nya dengan ta'at serta berlepas diri dari syirk dan pelakunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 133",
    "description": "Orang-orang yahudi berkata kepada rasulul lah, tidakkah engkau tahu bahwa yakub'yang juga disebut israil'menjelang kema tiannya berwasiat kepada anak-anaknya untuk memeluk agama yahudi' untuk menjawab hal itu Allah menurunkan ayat ini. Apakah kamu menjadi saksi saat maut akan menjemput yakub, ketika dia berkata kepada anakanaknya, apa yang kamu sembah sepeninggalku' tentu orang-orang yahudi itu tidak menyaksikan nya, sehingga ucapan mereka hanya dusta belaka. Menjawab pertanyaan nabi yakub, mereka, yakni anak-anak nabi yakub, menjawab, kami akan menyembah tuhanmu dan tuhan nenek moyangmu yaitu ibrahim, ismail, dan ishak, yaitu tuhan yang maha esa, dan kami hanya berserah diri kepada-Nya. (lihat: surah a'li imra'n/ 3: 84). Mereka itulah umat yang telah lalu, jauh sebelum kamu, yang tidak kamu saksikan. Mereka berpegang teguh pada wasiat itu, sedangkan kamu, wahai kaum yahudi, tidak. Oleh karena itu, baginya, yakni para leluhurmu, apa yang telah mereka usahakan berupa keyakinan yang tulus dan bagimu apa yang telah kamu usahakan dengan mengikuti hawa nafsumu. Mereka tidak ditanya tentang apa yang kamu lakukan, dan kamu pun tidak akan diminta (pertanggungjawaban) tentang apa yang dahulu mereka kerjakan."
  }
]