[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu umat manusia yang mendahului kalian dan telah berlalu, bagi mereka amal perbuatan mereka, dan bagi kalian amal perbuatan kalian. Kalian tidak dimintai pertanggungjawaban atas amal perbuatan mereka, dan mereka pun tidak dimintai pertanggungjawaban tentang amal perbuatan kalian. Semua masing-masing akan diberi balasan sesuai dengan apa yang telah diperbuatnya, tidak disiksa seorangpun gara-gara dosa orang lain, tidak ada yang memberi manfaat bagi seseorang selain keimanan dan ketakwaan nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Itulah satu umat yang telah berlalu di antara umat-umat sebelum kalian dan mereka sudah bertemu dengan amal perbuatan yang mereka lakukan. Mereka akan mendapatkan balasan atas apa yang telah mereka perbuat, baik berupa kebaikan maupun keburukan, dan kalian juga akan mendapatkan balasan atas apa yang telah kalian perbuat. Kalian tidak akan ditanya tentang amal perbuatan mereka, dan merekapun tidak akan ditanya tentang amal perbuatan kalian. Tidak ada seorangpun yang akan dihukum karena dosa orang lain. Setiap orang akan diberi balasan yang setimpal dengan perbuatannya, maka janganlah amal perbuatan orang-orang yang sudah berlalu sebelummu itu menyibukkanmu dari memperhatikan amal perbuatanmu, karena setiap orang tidak akan mendapatkan manfaat apapun -setelah rahmat Allah- selain dari amal salehnya sendiri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "134. Itulah sekelompok manusia yang telah berlalu masanya, bagi mereka balasan apa yang telah mereka kerjakan, dan bagi kalian balasan apa yang kalian kerjakan; kalian tidak akan ditanya di hari kiamat tentang amal perbuatan mereka di dunia, namun setiap orang hanya akan ditanya tentang amal perbuatannya sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "134. تِلْكَ (Itulah) Yakni Ibrahim dan anak keturunannya, dan Ya’kub dan anak keturunannya. قَدْ خَلَتْ ۖ (yang lalu) Yang telah berlalu لَهَا مَا كَسَبَتْ وَلَكُمْ مَا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ(baginya apa yang telah diusahakannya dan bagimu apa yang sudah kamu usahakan, dan kamu tidak akan diminta pertanggungan jawab tentang apa yang telah mereka kerjakan) Ini adalah peringatan untuk orang-orang Yahudi ketika menolak untuk menjadi pengikut Rasulullah karena merasa cukup dengan nasab keturunan terdahulu mereka adalah orang-orang yang shaleh, padahal setiap generasi mempertanggungjawabkan amalan mereka sendiri-sendiri; perbuatan orang tua tidak akan memberi manfaat kepada anak-anak mereka dan tidak akan mendapat bagian sedikitpun. Dalam ayat ini terdapat bantahan terhadap orang yang merasa cukup dengan amalan pendahulu mereka kemudian merasa tenang dengan angan-angan kosong yang bathil. Terdapat hadist yang menjelaskan hal ini (Barangsiapa yang lambat amalannya, tidak akan dipercepat oleh nasabnya). Maksudnya kalian tidak akan mendapat manfaat dari amal kebaikan mereka dan tidak akan dihukum dengan amal keburukan mereka. kalian tidak ditanya tentang amal mereka dan mereka tidak ditanya tentang amal kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibrahim bin Azar berkata : aku mendatangi Ahmad bin hanbal dan ketika itu seseorang bertanya kepadanya tentang pertikaian yang terjadi antara 'Ali dan Mu'awiyah, kemudian Ahmad berpaling darinya, lalu seseorang berkata kepadanya : \"wahai abu Abdillah, dia dari kalangan bani Hasyim\", kemudian Ahmad berkata : \"bacalah ayat ini : { تِلْكَ أُمَّةٌ قَدْ خَلَتْ ۖ لَهَا مَا كَسَبَتْ وَلَكُمْ مَا كَسَبْتُمْ ۖ وَلَا تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ }.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka semua (umat Ibrahim, Ya’qub dan putera mereka) adalah umat terdahulu. Apapun yang telah mereka lakukan adalah tanggungjawab mereka. Adapun engkau (Muhammad) tidak akan dimintai pertanggungjawaban atas itu semua."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah umat yang telah lalu} telah lalu {Baginya apa yang telah mereka usahakan dan bagi kalian apa yang telah kalian usahakan. Kalian tidak akan diminta pertanggung jawaban atas apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "134. “Itu adalah umat yang berlalu, ” yakni telah lewat, “baginya apa yang telah diusahakannya dan bagimu apa yang sudah kamu usahakan.” Maksudnya setiap orang akan mendapatkan (pahala) perbuatannya sendiri, dan setiap orang akan dibalas dengan apa yang telah diperbuatnya, seseorang tidaklah akan disiksa karena dosa orang lain, dan tidaklah akan bermanfaat bagi seseorang, kecuali hanya keimanan dan ketakwaannya. Maka kesibukan kalian terhadap mereka dan anggapan kalian bahwa kalian berada dalam agama mereka dan rela hanya sebatas perkataan semata, adalah perkara kosong belaka yang tidak ada hakikatnya, semestinya kalian memperhatikan kembali kondisi kalian, apakah patut memperoleh keselamatan ataukah tidak?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أُمَّةٞ خَلَتۡۖ } Ummatun Khallat : Kelompok yang tujuannya satu. Khallat : telah berlalu ke negeri akhirat. { لَهَا مَا كَسَبَتۡ } Lahaa maa kasabat : Untuknya pahala kebaikan yang dilakukan. { وَلَكُم مَّا كَسَبۡتُمۡۖ } Lakum maa kasabtum : Bagi kalian kebaikan yang telah kalian lakukan dan hal yang lainnya. Makna ayat : Pada ayat (134) Allah Ta’ala menyudahi omong kosong yang dilontarkan oleh orang Yahudi dengan firmanNya (تِلۡكَ أُمَّةٞ قَدۡ خَلَتۡۖ ) “Mereka adalah umat yang telah berlalu” -Yaitu Ibrahim dan anak keturunannya- mereka telah mendapat hasil dari keimanan dan amalan shalihnya, sedangkan kalian wahai orang-orang Yahudi masih saja berbuat kekufuran dan maksiat, padahal di hari kiamat nanti kalian tidak ditanya amalan orang, dan kalian akan ditanya tentang amalan kalian sendiri yang akan dibalas. Maka tinggalkanlah perdebatan kosong itu dan beralihlah untuk mencari hal yang bermanfaat untuk akhirat kalian, dengan beriman dan beramal shalih. Dan tidak akan pernah kalian dapatkan hal itu kecuali kalian memeluk agama Islam, maka masuklah ke dalam agama Islam. Pelajaran dari ayat : • Seseorang hendaknya tidak merasa tinggi dengan membanggakan kehebatan generasi pendahulunya, serta menerima keadaan dirinya sendiri dengan menyucikan dan membersihkan jiwanya. • Telah menjadi sunnatullah bagi para makhluk bahwa mereka akan dibalas sesuai dengan amalannya, dan tidak akan ditanya mengenai amalan orang lain. • Lafadz Ayah ( أب ) dapat dipakai juga untuk menyebut paman sebagai bentuk penghormatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 134: Allah mengabarkan bahwasannya urusan dari seluruh nabi dan rasul serta pengikutnya yang telah Kami kisahkan kepada kalian telah berlalu dan usai. bagi kalian amalan kalian dan bagi mereka amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Masing-masing orang akan dibalas sesuai amalnya dan seseorang tidaklah dihukum karena dosa orang lain. Iman dan ketakwaan seseorang juga tidak bermanfaat bagi orang lain. Oleh karena itu, sibuknya mereka terhadap umat yang telah lalu, pengakuan mereka bahwa mereka di atas agama umat yang lalu tersebut dan ridha dengan ucapan semata dianggap kosong tidak berarti apa-apa, bahkan yang wajib mereka lakukan adalah memperhatikan diri mereka apakah layak untuk selamat atau tidak?."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 134",
    "description": "Mereka itulah umat yang telah lalu, jauh sebelum kamu, yang tidak kamu saksikan. Mereka berpegang teguh pada wasiat itu, sedangkan kamu, wahai kaum yahudi, tidak. Oleh karena itu, baginya, yakni para leluhurmu, apa yang telah mereka usahakan berupa keyakinan yang tulus dan bagimu apa yang telah kamu usahakan dengan mengikuti hawa nafsumu. Mereka tidak ditanya tentang apa yang kamu lakukan, dan kamu pun tidak akan diminta (pertanggungjawaban) tentang apa yang dahulu mereka kerjakan. Ayat ini erat hubungannya dengan ayat 130 ketika Al-Qur'an mencela mereka yang enggan memeluk islam. Kecaman itu kini dilanjutkan. Dan mereka, orang-orang yahudi dan nasrani, berkata, jadilah kamu penganut yahudi atau penganut nasrani, niscaya kamu mendapat petunjuk. Ini artinya mereka tidak hanya berhenti pada perbuatan sesat mereka, tetapi juga mengajak orang lain untuk sesat bersama mereka. Katakanlah, wahai muham mad, tidak! kami tidak akan mengikutimu! tetapi kami mengikuti agama nabi ibrahim yang lurus dan dia tidak termasuk golongan orang yang mempersekutukan tuhan."
  }
]