[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah -wahai kaum mukminin- kepada golongan Yahudi dan Nasrani, “kami telah beriman kepada Allah yang Maha Esa yang berhak untuk disembah, dan kepada wahyu yang diturunkan kepada kami berupa Alquran yang diwahyukan Allah kepada nabi dan rasul Nya Muhammad sholallohu ‘alaihi wasallam, dan kepada shuhuf yang diturunkan kepada Ibrahim dan putranya Ismail dan Ishak dan kepada Yakub dan Asbath (anak cucunya yaitu para nabi yang berasal dari keturunan Yakub yang berada di tengah suku-suku Bani Israil yang berasal dari dua belas suku), dan kepada apa yang diberikan kepada Musa berupa Taurat, dan kepada Isa yang berbentuk Injil, serta kepada apa yang diturunkan kepada seluruh Nabi yang merupakan Wahyu dari Tuhan mereka. Kami Tidak membeda-bedakan seorangpun dari mereka dalam mengimani mereka. Dan kami tunduk kepada Allah dengan berbuat ketaatan dan ibadah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Katakanlah -wahai orang-orang mukmin- kepada orang-orang Yahudi dan Nasrani yang menyerukan seruan batil itu, “Kami beriman kepada Allah dan kepada Al-Qur`ān yang diturunkan kepada kami. Kami juga beriman kepada apa yang diturunkan kepada Ibrahim dan anak-anaknya; Ismail, Ishak dan Ya'qūb. Kami pun beriman kepada apa yang diturunkan kepada nabi-nabi yang berasal dari keturunan Ya'qūb. Dan kami juga beriman dengan Taurat yang Allah berikan kepada Musa dan Injil yang Allah berikan kepada Isa. Kami beriman dengan kitab suci yang Allah berikan kepada para Nabi. Kami tidak membeda-bedakan yang satu dengan yang lain sehingga kami beriman kepada sebagian dan ingkar kepada sebagian yang lain, tetapi kami beriman kepada mereka semua. Dan hanya kepada Allah lah kami tunduk dan patuh.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Kemudian Allah memerintahkan orang-orang beriman untuk mengabarkan kepada orang-orang Yahudi: “Kami beriman kepada Allah, al-Qur’an, kitab dan suhuf yang diturunkan kepada Ibrahim dan kedua anaknya -Ismail dan Ishaq- dan cucunya -Ya’qub- serta para keturunan Ya’qub. Dan kami beriman kepada Taurat dan Injil serta seluruh wahyu yang diberikan Allah kepada para Nabi, kami tidak membeda-bedakan mereka dan kami tunduk untuk beribadah kepada Allah. Syeikh as-Syinqithi berkata: “Allah tidak menjelaskan pada ayat ini apa yang diwahyukan kepada Musa dan Isa, namun Dia menjelaskannya pada ayat-ayat yang lain. Allah menjelaskan bahwa Dia mewahyukan kepada Musa kitab Taurat yang Allah sebut dengan sebutan suhuf pada firman-Nya: {صحف إبراهيم وموسى} al-A’la: 19, dan firman-Nya: {ثم آتينا موسى الكتاب} al-An’am: 154, dan yang dimaksud dalam ayat ini berdasarkan Ijma’ adalah kitab Taurat. Dan Allah menjelaskan bahwa yang Dia wahyukan kepada Isa adalah Injil sebagaimana yang Allah sebutkan dalam firman-Nya: {وقفينا بعيسى بن مرسم وآتيناه الإنجيل} al-Hadid: 27.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. قُولُوا آمَنَّا بِاللَّهِ (Katakanlah (hai orang-orang mukmin): “Kami beriman kepada Allah) Ini adalah perintah untuk orang-orang islam agar mengatakan kepada mereka kalimat ini. Terdapat hadist yang dikeluarkan Imam Bukhari dari Abu Hurairah bahwa Rasulullah bersabda: (janganlah kalian percaya kepada ahli kitab dan jangan pula kalian dustakan mereka. akan tetapi katakanlah: آمنا بالله......الأية) وَالْأَسْبَاطِ(dan anak cucunya) Mereka adalah anak-anak Nabi Ya’kub yang berjumlah 12 orang, dan setiap orang anak banyak anak. Dan Sibth dalam bani Israil seperti kabilah dalam istilah arab. لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْهُمْ (Kami tidak membeda-bedakan seorangpun diantara mereka dan kami hanya tunduk patuh kepada-Nya) Yakni kami tidak beriman kepada sebagian lalu kafir kepada kebagian lainnya layaknya orang Yahudi dan Nasrani. Akan tetapi orang islam beriman kepada seluruh nabi yang diutus Allah, dan kepada seluruh kitab yang diturunkan-Nya. -Dan orang-orang islam harus mengumumkan hal ini-."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam surah al-Baqarah Allah berfirman : { وَمَا أُوتِيَ النَّبِيُّونَ مِنْ رَبِّهِمْ } \"serta apa yang diberikan kepada nabi-nabi dari Tuhannya\" dan dalam surah ali-'Imran : { النبيون } tanpa disebutkan \"الإيتاء\" (didatangkan/diberikan), dan hikmah dari itu adalah : bahwasanya dalam surah ali-'Imran telah didahulukan sebelumnya : { وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ النَّبِيِّينَ لَمَا آتَيْتُكُمْ مِنْ كِتَابٍ وَحِكْمَةٍ } \"Dan (ingatlah), ketika Allah mengambil perjanjian dari para nabi: “Sungguh, apa saja yang Aku berikan kepadamu berupa kitab dan hikmah\" [ al-'Imran : 81 ], maka Allah mencukupkan penyebutan \"الإيتاء\" untuk kedua kalinya, dan juga dalam surah al-Baqarah belum disebutkan seperti yang terdapat dalam ali'Imran, maka perlu disebutkan \"الإيتاء\" dengan jelas dalam surah ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai kaum Muslim sekalian, katakanlah: “Kami beriman kepada Allah yang tidak mempunyai sekutu, kami beriman kepada Alquran, dan juga beriman kepada apa yang diturunkan kepada Ibrahim, Ismail, Ishaq, Ya’qub beserta Asbath (12 anak Ya’qub). Kami beriman kepada Taurat yang diturunkan kepada Musa, dan juga Injil yang diturunkan kepada Isa. Kami beriman kepada semua kitab yang diturunkan kepada para Nabi-Nya. Kami tidak membeda-bedakan mereka, kami mengimani mereka semua. Hanya kepada Allah-lah kami berserah diri.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Kami beriman kepada Allah, kepada apa yang diturunkan kepada kami, kepada apa yang diturunkan kepada Ibrahim, Ismail, Ishaq, Ya‘qub dan keturunannya} dan para nabi dari keturunan Ya’kub {dan kepada apa yang diberikan kepada Musa dan Isa, serta kepada apa yang diberikan kepada nabi-nabi dari Tuhan mereka. Kami tidak membeda-bedakan seorang pun di antara mereka dan kepadaNyala kami berserah diri.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136. Ayat yang mulia ini meliputi seluruh perkara yang wajib diimani. Ketahuilah bahwasanya iman yang artinya pembenaran hati yang total terhadap dasar-dasar ini, dan pengakuannya yang diikuti dengan perbuatan-perbuatan hati dan tubuh, dan keimanan itu –dengan kategori seperti ini- termasuk didalamnya kata Islam juga seluruh amalan-amalan shalih, maka itu semua adalah sebagian dari iman dan merupakan suatu pengaruh dari pengaruh-pengaruhnya. Maka ketika disebutkan kata iman secara bebas, maka perkara-perkara yang disebutkan akan masuk kedalamnya, demikian pula kata islam, bila disebutkan secara bebas, maka iman masuk ke dalamnya, namun bila disandingkan bersama, maka iman berarti apa yang ada dalam hati berupa keyakinan dan kepercayaan, sedang Islam adalah nama perbutan-perbuatan zahir. Demikian pula apabila dia menggabungkan antara iman dan amal shalih. Dan firman Allah, “Katakanlah,” yakni dengan lisan kalian yang didasari dari hati kalian, dan inilah perkataan yang sempurna yang mendatangkan ganjaran dan balasan, sebagaimana juga perkataan dengan lisan tanpa ada keyakinan dalam hati adalah sebuah kemunafikan dan kekufuran. Perkataan yang lepas dari perbuatan-perbuatan hati –sangat tidak berpengaruh dan tidak berguna, walaupun seorang hamba itu akan diberikan ganjaran apabila baik, dan kebaikan itu didasari oleh keimanan, akan tetapi dibedakan antara perkataan semata dengan perkataan yang dibarengi dengan perbuatan hati. Dalam firmanNya, “katakanlah, ” ada sebuah petunjuk untuk menampakkan aqidah, menyatakan secara terang-terangan dan berdakwah kepadanya, karena akidah adalah dasar agama dan pondasinya. Dan dalam firmanNya, “Kami beriman, ” dan semacamnya yang berbentuk adanya suatu perbuatan yang dinisbatkan kepada seluruh umat, adalah sebuah petunjuk kepada suatu hal, bahwa umat ini wajib berpegang teguh kepada tali agama Allah secara keseluruhan, dan sebuah anjuran untuk bersatu agar pendorong bagi mereka adalah satu dan amalan mereka bersatu, juga termasuk larangan dari perpecahan, dalam kondisi seperti itu kaum Mukminin adalah seperti satu tubuh. Dalam firman Allah ta’ala, “Katakanlah (hai orang-orang Mukmin), ’kami beriman kepada Allah…’hingga akhir, terkandung sebuah dalil akan bolehnya seseorang menisbahkan keimanan kepada dirinya dalam bentuk pembatasan, bahkan ini adalah dalil atas wajibnya penisbatan tersebut, berbeda dengan perkataan “Saya seorang Mukmin, ” atau semacamnya, karena perkataan ini tidaklah diucapkan kecuali dibarengi pengecualian dengan kehendak Allah, karena mengandung penyucian diri dan kesaksian atas diri sendiri dengan keimanan. Maka firmanNya, “kami beriman kepada Allah, ” yakni bahwasanya Dia adalah pasti ada dan Satu lagi Esa, yang bersifat dengan segala sifat-sifat yang sempurna, terlepas dari setiap kekurangan dan aib, berhak untuk diesakan dalam seluruh ibadah dan tidak mempersekutukanNya dengan sesuatu pun dalam segala bentuknya. \"dan apa yang diturunkan kepada kami\" mencakup Al-quran dan sunnah, sebagaimana firman-Nya : \"dan Allah telah menurunkan kepadamu Al-Kitab dan hikmah\". Maka iman masuk di dalamnya sebagaimana yang dikandung Kitabullah dan sunnah Rosululloh dari sifat-sifat nabiNya, Hari Akhir, hal-hal gaib yang telah lampau maupun yang akan datang, keimanan terhadap apa yang juga dikandungnya dari hokum-hukum syariat yang bersifat perintah dan larangan, hokum tentang ganjaran dan lain sebagainya, “dan apa yang diturunkan kepada kepada Ibrahim” hingga akhir ayat, menunjukkan keimanan kepada seluruh kitab-kitab yang diturunkan kepada seluruh Nabi, juga keimanan kepada para Nabi secara umum dan secara khusus kepada nabi-nabi yang jelas disebutkan dalam ayat-ayat, karena kemuliaan mereka dan pelaksanaan mereka terhadap syariat-syariat yang penting. Maka yang wajib dalam beriman kepada para nabi dan kitab-kitab adalah untuk beriman kepada mereka secara umum dan menyeluruh, kemudian apa yang telah diketahui secara terperinci wajib diimani dengan terperinci juga. firmanNya, “Kami tidak membeda-bedakan seorang pun diantara mereka, ” akan tetapi kami beriman kepada mereka semua, hal ini adalah suatu keistimewaan kaum Muslimin yang membedakan mereka dengan orang-orang yang mengaku bahwa dia menganut suatu agama. Kaum yahudi, Nasrani, orang-orang shabi’ah dan selain mereka, walaupun mereka mengaku beriman kepada Nabi-nabi dan kitab-kitab yang mereka yakini, namun mereka mengingkari selainnya, mereka membeda-bedakan antara para Nabi dan kitab-kitab, mereka beriman kepada sebagian dan mengingkari yang lain, oleh karenanya pendustaan mereka itu membatalkan kepercayaan mereka sendiri. Maka Rosul yang mereka klaim bahwa mereka beriman kepadanya saja telah mempercayai seluruh Rosul dan khususnya kepada Rosululloh Sholallohu 'alaihi wasallam, maka bila mereka mendustai Muhammad berarti mereka telah mendustai Rosul mereka tersebut tentang apa yang telah dia kabarkan yang menjadikan mereka mengingkari Rosul mereka sendiri. Dan dalam firman Allah ta’ala “Serta apa yang diberikan kepada Nabi-nabi dari Tuhannya, ” adalah dalil yang menunjukkan bahwa pemberian agama adalah suatu pemberian yang hakiki yang berhubungan dengan kebahagiaan dunia dan akhirat. Allah tidak memerintahkan kepada kita untuk beriman kepada sesuatu yang diberikan kepada para nabi beruipa kerajaan dan harta atau semacamnya, namun Allah memerintahkan kepada kita agar kita beriman kepada sesuatu yang diberikan kepada mereka berupa kitab-kitab dan syariat-syariat. Ayat ini juga menunjukkan bahwasanya para Nabi itu adalah pembawa berita dari Allah dan menjadi perantara antara Allah dengan makhluk-makhlukNya dalam misi penyampaian agamaNya, dan dalam urusan itu mereka tidak punya hak sedikit pun. Dan dalam firmanNya, “Dari tuhannya,” terkandung sebuah penjelasan bahwa di antara kesempurnaan rububiyah Allah terhadap hamba-hambaNya adalah bahwa Dia menurunkan kepada mereka kitab-kitab suci dan mengutus Rosul-rosul buat mereka. RububiyahNya menuntut untuk tidak membiarkan mereka sia-sia dan tidak diperhatikan, dan apabila apa yang diberikan kepada para Nabi itu berasal dari Tuhan mereka maka di sana terkandung sebuah perbedaan antara para Nabi dan orang-orang yang mengaku sebagai nabi, dan bahwasanya sangat jelas perbedaan mereka itu dengan sekedar mengetahui apa yang mereka dakwahkan. Para Rosul hanya menyeru kepada kebaikan dan hanya melarang dari setiap yang buruk, dan setiap orang di antara mereka mempercayai yang lainnya, menyaksikannya atas kebenaran tanpa ada perselisihan dan pertentangan, karena semuanya berasal dari Tuhan mereka yang Satu. \"Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.\" (QS. An-Nisa : 82) Ini berbeda jauh dari orang-orang yang mengaku sebagai nabi, patilah terjadi pertentangan di antara mereka dalam kabar-kabar mereka, perintah, larangan, sebagaimana hal itu telah diketahui oleh orang yang telah mencermati kehidupan mereka dan mengetahui apa-apa yang mereka dakwahkan. Dan ketika Allah ta’ala menjelaskan seluruh hal yang harus diimani secara umum dan khusus, dan perkataan itu tidaklah berguna tanpa amalan, maka Allah berfirman “Dan kepadanya kami tunduk patuh, ” maksudnya pasrah kepada keagunganNya, patuh dalam menyembahNya secara lahir maupun batin, ikhlas dalam menyembahNya. Itu semua didasari oleh dalil didahulukannya kata yang menjadi obyek yaitu, “kepadaNya” daripada kata yang menjadi subyek, “kami tunduk patuh.” Ayat ini mengandung –dengan ringkas dan intisarinya- macam-macam tauhid yang tiga yaitu tauhid rububiyah, tauhid uluhiyah, dan tauhid Asma’ wa Shifat. Ayat ini juga mengandung keimanan kepada seluruh Rosul dan seluruh kitab (yang diturunkan Allah), dan mengandung penghususan yang bermaksud pengutamaan setelah adanya penyebutan secara global, juga pembenaran dengan hati, lisan, dan anggota tubuh, serta keikhlasannya kepada Allah dalam semua itu, juga perbedaan antara para Rosul yang benar dan orang-orang yang mengaku sebagai Nabi lagi pendusta berdasarkan pengajaran Allah kepada hamba-hambaNya bagaimana cara berbicara, berdasarkan kasih sayangNya dan kebaikanNya kepada mereka dengan segala nikmat-nikmaNya yang agamis yang berhubungan dengan kebahagiaan dunia maupun akhirat. Mahasuci Allah Dzat yang telah menjadikan kitabNya sebagai penjelas akan segala sesuatu dan sebagai petunjuk dan rahmat bagi orang-orang yang beriman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَمَآ أُوتِيَ مُوسَىٰ } Wa maa utiya Musa : Kitab Taurat { وَمَآ أُوتِيَ عيسى} Wa maa utiya ‘Isa : Kitab Injil Makna ayat : Pada ayat (136) Allah Ta’ala memerintahkan rasulNya dan orang-orang mukmin untuk mengumumkan secara terang-terangan akidah yang benar, yaitu beriman kepada Allah dan al-Qur’an, juga beriman kepada kitab-kitab yang diturunkan kepada para nabi seluruhnya, dan beriman kepada kitab yang turunkan kepada Musa dan Isa berupa Taurat dan Injil secara khusus, tanpa membeda-bedakan antara satu rasul dengan rasul yang lain, serta menyerahkan diri kepada Allah rabb semesta alam secara lahir dan batin. Pelajaran dari ayat : • Mengingkari satu orang rasul, sama saja dengan mengingkari semua rasul. Kaum Yahudi telah kafir kepada Nabi Isa, sedangkan kaum Nasrani telah kafir kepada Nabi Muhammad ﷺ sehingga mereka adalah orang-orang kafir. Sedangkan kaum muslimin beriman kepada setiap rasul sehingga mereka adalah orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 136: Allah mengarahkan firmannya kepada orang-orang yang beriman memerintahkan kepada mereka agar mengatakan kepada yahudi dan nasrani: Sungguh kami beriman kepada Allah saja tanpa menyekutukannya dan kami beriman dengan apa yang ada dalam Al-Qur’an beserta sunnah nabi Muhammad ﷺ, dan kami beriman dengan lembaran-lembaran yang dituliskan kepada Ibrahim dan anaknya Ismail serta Ishak dan Yakub serta keturunan-keturunannya yaitu para nabi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat yang mulia ini mengandung hal-hal yang wajib kita imani. Iman adalah pembenaran dari hati kepada dasar-dasar ini, iqrar (pengakuan di lisan) dan pengamalan dengan anggota badan. Berdasarkan arti ini, maka kata iman sudah termasuk ke dalamnya Islam, demikian juga termasuk ke dalam iman semua amal shalih. Amal shalih adalah bagian dari iman dan salah satu atsar (pengaruh) di antara atsar-atsarnya. Oleh karena itu, jika disebutkan iman secara mutlak, maka hal-hal tadi termasuk di dalamnya. Demikian juga kata \"Islam\", jika disebutkan secara mutlak, maka masuk juga ke dalamnya iman. Namun apabila disebut Iman dan Islam secara bersamaan, maka iman adalah sesuatu yang menancap di hati berupa pembenaran dan pengakuan, sedangkan Islam sebagai nama untuk amal-amal yang nampak di luar. Sama seperti ini, jika disebut iman dan amal shalih. Iman adalah sesuatu yang menancap di hati, sedangkan amal shalih adalah amalan yang nampak di luar. Maksudnya: perkataan yang dibenarkan oleh hati. Inilah perkataan yang sempurna yang akan diberi pahala. Sebaliknya, jika terbatas di lisan saja tanpa masuk ke dalam hati, maka hal itu merupakan nifak dan kekufuran. Perintah untuk mengatakan hal-hal di atas adalah isyarat untuk mengi'lankan (menampakkan secara terang-terangan) 'Aqidah Islam sekaligus mendakwahkan manusia kepadanya. Pada kata-kata ini \"Kami beriman\" dinisbatkan kepada umat Islam secara menyeluruh yang menunjukkan wajibnya mereka berpegang dengan agama Allah dan bersatu di atasnya serta larangan berpecah-belah. Ayat ini juga menunjukkan bahwa kaum mukmin itu seperti satu jasad. Kata-kata ini menunjukkan bolehnya seseorang menyebut dirinya beriman 'ala wajhit taqyid (secara tafshil, seperti: \"saya beriman kepada Allah\", \"saya beriman kepada kitab-kitab Allah\" dsb.), bahkan hal itu wajib. Berbeda jika mengatakan \"saya seorang mukmin\", maka harus disertakan istitsna' (kata Insya Allah) karena di dalamnya terdapat tazkiyah (anggapan suci terhadap diri) dan persaksian dirinya sebagai mukmin. Beriman kepada Allah mencakup beriman bahwa Allah itu ada, Dia sebagai Rabbul 'alamin (Pencipta, Penguasa dan Pemberi rezeki alam semesta), Mahaesa, memiliki sifat sempurna, bersih dari sifat kekurangan dan cacat, yang satu-satunya berhak diibadahi dan tidak boleh disekutukan. Mencakup beriman kepada Al Qur'an dan As Sunnah, berdasarkan surat An Nisa': 113 yang di sana disebutkan \"wa anzalallahu 'alaikal kitaaba wal hikmah\". Oleh karena itu, dalam beriman kepada apa yang diturunkan Allah kepada kita mencakup beriman kepada isi Al Qur'an dan As Sunnah, seperti tentang sifat-sifat Allah, sifat-sifat rasul-Nya, tentang hari akhir, hal-hal ghaib yang telah lalu dan yang akan datang serta beriman kepada kandungan Al Qur'an dan As Sunnah berupa hukum-hukum syar'i yang berupa perintah dan larangan dan hukum-hukum jaza'i (pembalasan terhadap amal) dsb. Seperti shuhuf (lembaran-lembaran berisi wahyu). Mereka adalah para nabi yang berasal dari keturunan Ya'qub (Bani Israil). Dalam beriman kepada kitab-kitab Allah, kita mengimaninya secara ijmal dan tafshil. Secara ijmal (garis besar) maksudnya kita mengimani bahwa Allah Subhaanahu wa Ta'aala telah menurunkan kitab-kitab atau shuhuf kepada para nabi meskipun tidak diberitahukan kepada kita namanya seperti pada ayat di atas. Sedangkan secara tafshil (rinci) adalah kita mengimani kitab-kitab tersebut secara rinci, yakni yang disebutkan nama kitabnya dan siapa yang menerimanya karena kemuliaan mereka sehingga disebutkan namanya dalam Al Qur'an dan karena mereka datang membawa syari'at-syari'at yang agung. Misalnya: Mengimani Al Qur'an yang diturunkan kepada Nabi Muhammad shallallahu 'alaihi wa sallam, Zabur yang diturunkan kepada Nabi Dawud 'alaihis salam, Taurat yang diturunkan kepada Nabi Musa 'alaihis salam dan Injil yang diturunkan kepada Nabi Isa 'alaihis salam. Dari ayat ini kita juga mengetahui bahwa nikmat agama yang benar merupakan nikmat yang sangat besar karena terkait dengan bahagia atau sengsara seseorang di dunia dan akhirat. Oleh karena itu, Allah Subhaanahu wa Ta'aala tidak menyuruh kita mengimani apa yang diberikan kepada para nabi berupa kerajaan, harta dsb. Akan tetapi, Dia memerintahkan kita beriman kepada apa yang diberikan kepada mereka berupa kitab-kitab dan syari'at mereka.. Disebutkan kata \"Mirr rabbihim\" (dari Tuhan mereka) terdapat isyarat bahwa termasuk kesempurnaan rububiyyah (kepengurusan) Allah kepada hamba-hamba-Nya adalah dengan menurunkan kepada mereka kitab-kitab dan mengutus para rasul, dan Rububiyyah-Nya kepada hamba-hamba-Nya menghendaki untuk tidak membiarkan mereka begitu saja dalam kebingungan. Apabila yang diberikan kepada para nabi itu berasal dari Tuhan mereka, maka di sana terdapat perbedaan antara para nabi dengan orang-orang yang mengaku sebagai nabi, yaitu dengan melihat apa yang mereka dakwahkan. Para rasul tidaklah mendakwahkan selain kepada kebaikan dan tidak melarang kecuali dari perbuatan buruk, masing-masing mereka saling membenarkan tidak bertentangan karena memang sama-sama berasal dari Tuhan mereka, berbeda dengan orang yang mengaku sebagai nabi, pasti terjadi pertentangan antara berita yang mereka sampaikan, demikian juga pada perintah dan larangan sebagaimana hal itu diketahui oleh orang yang biasa mengkaji. Maksudnya: tidak membeda-bedakan dalam beriman, yakni semuanya mereka imani tidak seperti orang-orang Yahudi yang beriman hanya sampai kepada Nabi Musa 'alaihis salam dan tidak seperti orang-orang Nasrani yang beriman hanya sampai kepada Nabi Isa 'alaihis salam. Padahal kafir kepada seorang nabi, sama saja kafir kepada semua nabi. Setelah Allah Subhaanahu wa Ta'aala menyebutkan beberapa hal yang wajib diimani, baik secara umum maupun khusus, sedangkan ucapan tidak berhenti sampai di situ, bahkan membutuhkan kerja nyata atau amal, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk menambahkan \"dan Kami hanya tunduk patuh kepada-Nya\", yakni tunduk kepada keagungan-Nya dan patuh beribadah kepada-Nya baik zhahir maupun batin sambil mengikhlaskan diri hanya kepada-Nya. Ayat di atas meskipun ringkas, namun sebenarnya mencakup beberapa hal, di antaranya: - Tauhid yang tiga; tauhid rububiyyah, tauhid uluhiyyah dan tauhid asma' wash shifat. - Beriman kepada semua Rasul. - Beriman kepada semua kitab. - Disebutkan sebagian para rasul setelah menyebutkan beriman kepada para rasul secara umum menunjukkan keutamaan mereka di atas yang lain. - Menjelaskan tentang hakikat iman yang menghendaki adanya pembenaran di hati, lisan dan anggota badan serta berbuat ikhlas lillah dalam semua itu. - Menjelaskan mana rasul yang sesungguhnya dengan orang yang mengaku sebagai rasul padahal bukan rasul. - Menjelaskan tentang ucapan yang diajarkan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya. - Menunjukkan rahmat (kasih sayang) Allah Subhaanahu wa Ta'aala dan ihsan-Nya kepada hamba-hamba-Nya dengan memberikan nikmat agama yang menjamin kebahagiaan mereka di dunia dan akhirat. Maka Mahasuci Allah Subhaanahu wa Ta'aala yang menjadikan kitab-Nya sebagai penjelas segala sesuatu, sebagai petunjuk dan rahmat bagi kaum yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 136",
    "description": "Bimbingan Allah kepada nabi Muhammad dan pengikutnya yang disebut pada ayat 135 dilanjutkan pula pada ayat ini. Katakanlah, wahai orang-orang yang beriman, kepada orang-orang yahudi dan nasrani itu, kami beriman kepada Allah yang mahasempurna dan kepada apa yang diturunkan kepada kami, baik berupa Al-Qur'an maupun tuntunan lain yang disampaikan oleh nabi Muhammad. Dan demikian pula kami percaya kepada apa, yakni wah yu, yang diturunkan kepada nabi ibrahim, nabi ismail, nabi ishak, nabi yakub, dan anak cucunya. Dan demikian juga kami percaya kepada apa yang diberikan kepada nabi musa dan nabi isa, baik berupa kitab suci maupun ajaran dalam bentuk lain, serta kepada apa yang diberikan kepada nabi-nabi lain yang bersumber dari tuhan mereka. Kami tidak membeda-beda kan seorang pun di antara mereka, sehingga kami percaya kepada semuanya. Dan dalam per soalan ini kami berserah diri kepada-Nya. Maka jika mereka yang mengajakmu mengikuti agama mereka itu telah beriman persis sebagaimana yang kamu imani, sehingga mereka menjadi pengi kutmu, sungguh, mereka telah mendapat petunjuk yang benar. Akan tetapi, jika mereka berpaling, sesungguhnya mereka berada dalam permusuhan denganmu, maka Allah mencukup kan engkau, wahai nabi Muhammad terhadap mereka dengan pertolongan dan janji-Nya yang pasti ditepati. Dan dia maha mendengar perkataan musuh-Musuhmu, maha mengetahui apa saja yang ada dalam hati mereka."
  }
]