[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila orang-orang kafir dari kalangan Yahudi Nasrani dan golongan lainnya mau beriman kepada apa yang kalian Imani, yang dibawa oleh Rasul (Muhammad Shallallahu Alaihi Wasallam), maka sungguh mereka telah mendapatkan hidayah menuju kebenaran. namun jika berpaling darinya maka mereka berada dalam penentangan yang luar biasa. Maka Allah lah yang akan melindungimu - wahai Rasul- dari keburukan mereka dan menolong menghadapi mereka. Dia Maha mendengar semua perkataan kalian dan mengetahui seluruh kondisi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "137. Apabila orang-orang Yahudi, Nasrani dan orang-orang kafir lainnya beriman seperti imanmu niscaya mereka menemukan petunjuk menuju jalan lurus yang diridai oleh Allah. Apabila mereka berpaling dari iman ini dengan mendustakan para Nabi, baik semuanya maupun sebagian saja, sesungguhnya mereka itu sedang berada dalam perselisihan dan permusuhan. Maka janganlah engkau bersedih hati, wahai Nabi, karena Allah akan melindungimu dari gangguan mereka, menghalangimu dari kejahatan mereka dan menolongmu untuk mengalahkan mereka. Karena Dia Maha Mendengar ucapan mereka dan Maha Mengetahui niat dan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "137. Maka jika orang-orang kafir dari kalangan Yahudi dan Nasrani beriman seperti apa yang kalian imani maka mereka telah mendapat kebenaran; namun jika mereka berpaling darinya maka sesungguhnya yang mereka inginkan adalah memusuhi dan menyelisihimu, akan tetapi Allah akan melindungimu dari keburukan mereka dan menolongmu dalam melawan mereka, Allah Maha Mendengar apa yang mereka katakan dan Maha melihat perbuatan mereka. Dan Allah telah memenuhi janji-Nya serta mengalahkan sendiri pasukan yang bersekutu -pada perang Khandaq- dan memenangkan nabi-Nya atas musuh-musuhnya sehingga beliau dapat membunuh dan menawan Bani Quraidzah dan mengusir Bani Nadlir. (Shahih Bukhari, kitab peperangan-pepearangan Rasulullah, bab tempat kembali Nabi dari perang Ahzab dan tempat keluarnya menuju bani Quraidzah serta pengepungan mereka, dan bab hadits bani Nadlir dan keluarnya Nabi menuju mereka)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "137. فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنْتُمْ بِهِ (Maka jika mereka beriman kepada apa yang kamu telah beriman kepadanya) Yakni jika ahli kitab dan yang lainnya beriman kepada apa yang kalian Imani (yakni kepada seluruh kitab Allah dan rasul-Nya, dan tidak membeda-bedakan diantara mereka) maka sungguh mereka telah mendapatkan hidayah. فِي شِقَاقٍ ۖ (berada dalam permusuhan). (الشقاق) yakni permusuhan dan perselisihan. فَسَيَكْفِيكَهُمُ اللَّهُ ۚ(Maka Allah akan memelihara kamu dari mereka) Ini adalah janji Allah untuk nabi-Nya bahwa Dia akan menjaganya dari orang yang memusuhinya dari golongan orang-orang yang menjauh dari kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu 'Utsaimin mengatakan : Perselisihan yang terjadi antara ahli kitab dan muslimin adalah perkara yang telah ditaqdirkan oleh Allah, oleh karena tidak akan bersepakat antara kaum muslimin dan ahli kitab, maka da'wah yang yang dibawakan para Ahli kitab untuk bertauhid kepada banyak agama adalah dakwah yang sesat, berdasarkan firman Allah : { فَإِنْ آمَنُوا بِمِثْلِ مَا آمَنْتُمْ بِهِ فَقَدِ اهْتَدَوْا ۖ وَإِنْ تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ } \"Maka jika mereka beriman kepada apa yang kamu telah beriman kepadanya, sungguh mereka telah mendapat petunjuk; dan jika mereka berpaling, sesungguhnya mereka berada dalam permusuhan (dengan kamu)\" , jika mereka tidak ingin beriman maka mereka dengan kita dalam perselisihan, dan perselisihan itu pasti akan menghantarkan kepada permusuhan dan kemarahan, dan selanjutnya masing-masing saling mempertahankan pendiriannya, dan seperti itulah yang terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Apabila ahli kitab Yahudi dan Nasrani beriman seperti kaum Muslim beriman kepada kitab Allah dan rasul-Nya, juga membenarkan seperti pembenaran kaum Muslim, maka mereka sungguh-sungguh berada dalam kebenaran. Namun apabila mereka menolak untuk beriman berarti mereka sedang menentang dan memusuhi dakwa Islam. Cukuplah Allah sebagai penolongmu dari itu semua wahai Rasul. Allah Maha Mendengar atas sega perkataan mereka, dan Allah Maha Tahu tentang sega yang mereka sembunyikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka telah mengimani apa yang kalian imani, sungguh mereka telah mendapat petunjuk. Dan jika mereka berpaling} berpaling dari keimanan {sesungguhnya mereka berada dalam permusuhan} perselisihan dan pertengkaran {Maka Allah akan mencukupkanmu dari mereka. Dia Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "137. Maknanya, apabila ahli kitab beriman seperti berimannya kalian (kaum Mukminin) kepada seluruh Rosul, (termasuk dari mereka seorang Nabi yang paling utama yaitu Muhammad) dan seluruh kitab (termasuk al-Qur’an), dan mereka berserah diri hanya kepada Allah semata dan mereka tidak membeda-bedakan salah seorang di antara para Rosul itu, “sungguh mereka telah mendapat petunjuk” kepada jalan yang lurus yang menyampaikan kepada surga yang penuh kenikmatan. Artinya, tidak ada jalan menuju kepada hidayah bagi mereka kecuali dengan keimanan tersebut, dan bukan seperti apa yang mereka sangkakan dalam perkataan mereka, “jadilah orang Yahudi atau Nasrani, niscaya kamu mendapat petunjuk, ” mereka mengklaim bahwa petunjuk itu khusus dengan apa yang mereka anut. Hidayah itu adalah mengetahui kebenaran dan mengamalkannya, sedangkan lawannya adalah kesesatan dari ilmu dan kesesatan dari amal perbuatan setelah berilmu, dan itulah penentangan yang pernah terjadi pada mereka ketika mereka berpaling dan mengingkari. Orang yang menentang itu adalah orang yang berada di satu pihak sedang Allah dan RosulNya dipihak yang lain, dan konsekuensi dari penentangan itu adalah permusuhan dan pertempuran yang dahsyat yang mana hal-hal yang harus ada dari hal itu adalah mengerahkan segala apa yang mereka mampu dalam mengganggu Rosul. Oleh karena itu Allah menjanjikan RosulNya untuk melindunginya dari mereka karena Dia adalah “Yang Maha Mendengar” seluruh suara dengan segala macam bahasa dengan berbagai keperluan, “lagi Maha Mengetahui” apa yang ada pada mereka, dan yang dibelakang mereka, yang ghaib maupun yang nyata, yang batin maupun yang lahir. Apabila kondisnya seperti itu, maka Allah akan melindungimu dari kejahatan mereka. Dan sesungguhnya Allah telah menunaikan janjiNya kepada RosulNya, Allah membuat RosulNya menguasai mereka hingga sebagian mereka terbunuh, sebagian lain ditawan, sebagian yang lain diusir dan setiap pendepak mendepak mereka dengan kasar. Ayat ini menunjukkan sebuah mukjizat-mukjizat al-Qur’an yaitu mengabarkan suatu hal sebelum terjadi lalu terbukti terjadi sesuai dengan apa yang dikabarkannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { فِي شِقَاقٖۖ } Fii syiqaaq : Berada dalam perbedaan, perpecahan dan permusuhan dan peperangan pada kalian. Makna ayat : Pada ayat (137) Allah Ta’ala berfirman kepada rasulNya serta orang-orang mukmin apabila orang Yahudi dan Nasrani mau beriman dengan keimanan yang benar seperti iman kaum mukminin, sungguh mereka telah mendapat petunjuk. Namun jika mereka enggan, berpaling, dan membangkang maka mereka tidak akan mampu menentang Allah dan rasulNya. Allah Ta’ala akan mencukupi kalian sesuai dengan kehendakNya dan Dialah yang Maha Mendengar ucapan mereka yang penuh kedustaan dan Maha Mengetahui atas perbuatan-perbuatan mereka yang buruk. Allah Telah melunasi janji kepada rasulNya untuk mengusir orang-orang Yahudi dari kota Madinah, bahkan dari kota Mekah dan Madinah dengan penuh kehinaan. Pelajaran dari ayat : • Kaum Yahudi dan Nasrani akan senantiasa memusuhi Islam dan memerangi pemeluknya. Namun, kaum muslimin akan mendapat penjagaan Allah dari keburukan kaum Yahudi dan Nasrani selama mereka istiqomah di atas agama Islam dengan akidah, amaliyah ibadah, akhlak, adab, dan hukum-hukumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 137: Allah menjelaskan bahwasannya ahli kitab jika mereka beriman kepada Allah maka sungguh mereka akan mendapatkan petunjuk menuju kebenaran, dan jika mereka mengolok dan menjauhi kebenaran maka sungguh mereka akan mendapatkan musibah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ahli kitab. Yakni dengan beriman kepada semua kitab dan semua rasul termasuk beriman kepada Al Qur'an dan kepada Nabi Muhammad shallallahu 'alaihi wa sallam serta tunduk patuh kepada Allah Subhaanahu wa Ta'aala. Orang yang beriman seperti yang diimani kaum mukmin adalah orang-orang yang mendapat petunjuk kepada jalan yang lurus yang mengarah keppada surga. Oleh karena itu, tidak ada jalan untuk memperoleh petunjuk itu kecuali dengan beriman seperti di atas (ayat 136), tidak seperti yang dinyatakan oleh orang-orang Yahudi dan Nasrani bahwa untuk memperoleh petunjuk harus mengikuti agama Yahudi atau Nasrani. Padahal yang disebut dengan \"petunjuk\" adalah mengetahui kebenaran dan mengamalkannya. Kebalikannya adalah tersesat baik dengan tidak mengetahui yang hak maupun dengan tidak mengamalkannya setelah mengetahuinya. Keadaan seperti inilah, yakni berpaling dari petunjuk itu yang mengakibatkan mereka berada dalam syiqaq (permusuhan), dan biasanya jika sudah terjadi permusuhan, maka orang yang bermusuhan itu akan berupaya sekuat tenaga mengerahkan kemampuannya untuk menyakiti musuhnya, dan yang mereka musuhi dalam hal ini adalah Rasulullah shallallahu 'alaihi wa sallam dan para sahabatnya, maka Allah Subhaanahu wa Ta'aala menjanjikan akan menjaga Beliau dari gangguan mereka; karena Dia mendengar semua pembicaraan dan Dia mengetahui apa yang ada di hadapan mereka dan di belakang mereka, Dia mengetahui yang ghaib dan yang nampak, yang zhahir maupun yang tersembunyi. Jika demikian, maka cukuplah Allah sebagai penjaga Rasul-Nya dari gangguan musuhnya. Allah Subhaanahu wa Ta'aala memenuhi janji-Nya, Dia menjaga Rasul-Nya dan rasul-Nya berhasil menyampaikan risalahnya semua tanpa ada yang dikurangi sedikit pun. Di dalam ayat ini pun terdapat mukjizat Al Qur'an, di mana Al Qur'an sudah mengabarkan sebelum terjadinya sesuatu dan kenyataannya sesuai dengan yang dikabarkan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 137",
    "description": "Maka jika mereka yang mengajakmu mengikuti agama mereka itu telah beriman persis sebagaimana yang kamu imani, sehingga mereka menjadi pengi kutmu, sungguh, mereka telah mendapat petunjuk yang benar. Akan tetapi, jika mereka berpaling, sesungguhnya mereka berada dalam permusuhan denganmu, maka Allah mencukup kan engkau, wahai nabi Muhammad terhadap mereka dengan pertolongan dan janji-Nya yang pasti ditepati. Dan dia maha mendengar perkataan musuh-Musuhmu, maha mengetahui apa saja yang ada dalam hati mereka. Keberagamaan dan keimanan seperti yang diajarkan oleh nabi ibrahim itu merupakan shibgah atau celupan Allah. Siapa yang lebih baik shibgah-Nya daripada Allah' tentu tidak ada. Dan kepada-Nya kami menyembah. Kata celupan pada ayat ini mengandung arti keimanan kepada Allah yang tidak disertai kemusyrikan sedikit pun. Makna ini ditegaskan oleh perka taan dan hanya kepada-Nyalah, bukan kepada yang lain, kami menyembah. Ini juga mengindikasikan bahwa keberagamaan kita harus bersifat total sehingga seluruh totalitas kita terwarnai oleh celupan agama Allah itu."
  }
]