[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pegang teguhlah agama Allah yang telah Dia Fitrahkan kalaian berada di atas agama itu, maka tidak ada sesuatupun yang lebih baik dari fitrah ciptaan Allah yang Allah menciptakan manusia di atasnya. maka berpeganglah kepada-nya Dan katakanlah, “kami tunduk kepada-Nya dan patuh kepada Tuhan kami dalam mengikuti ajaran Ibrahim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Peganglah agama Allah yang Dia ciptakan fitrah kalian menurut agama itu, baik lahir maupun batin. Maka tidak ada agama yang lebih baik dari agama Allah. Karena agama Allah itu sesuai dengan fitrah, mengundang maslahat dan menghalangi mafsadat. Dan katakanlah, “Kami hanya menyembah kepada Allah semata. Kami tidak menyekutukan-Nya dengan yang lain.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "138. Hai Rasulullah, katakanlah kepada orang-orang Yahudi dan Nasrani: “Berpeganglah pada agama Islam yang merupakan agama Allah, karena tidak ada agama yang lebih baik dari Islam. Dan kami benar-benar mengesakan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. صِبْغَةَ اللَّهِ ۖ (Shibghah Allah) Yakni celupkanlah (masukkanlah) diri kalian dan keluarga kalian ke dalam Islam karena islam adalah shibghah Allah (celupan-Nya) dan berpegang teguhlah dengannya. Dan celupan akan memasuki setiap bagian barang yang dicelupkan, demikian juga Islam akan mengubah keadaan orang yang berpegang taguh terhadapnya. Awal mula dari hal ini adalah orang-orang Nasrani dahulu mencelupkan anak-anak mereka kedalam air yang mereka sebut dengan al-Ma’mudiyyah. Mereka melakukan itu untuk membersihkan anak-anak itu, dan apabila ritual itu telah selesai mereka mengatakan: sekarang mereka telah menjadi orang Nasrani yang sebenarnya. Maka Allah membantah mereka dengan ayat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sibghah (celupan) dalam ayat ini maksudnya adalah \"agama\" disebut sibghah hanya sebatas majaz dan isti'arah; karena celupan agama Allah itu nampak dalam diri orang-orang yang beragama (beriman), sebagaimana bekas celupan warna yang nampak pada pakaian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai manusia, berpegang teguhlah kalian semua kepada agama Allah sebagai fitrah kalian, yaitu agama Islam. Tidak ada petunjuk sebaik petunjuk Islam, yang membawa kita pada ketaatan kepada Allah. Ibnu Abbas berkata: Orang Nasrani itu apabila ada di antara mereka yang melahirkan anak, maka mereka mendatanginya selama tujuh hari. Mereka mencelupkan bayi mereka menggunakan air khusus (dinamai: al ma’mudi) yang digunakan untuk mensucikan bayi itu. Mereka berkata, “Ini suci, tempat khitan.”, apabila mereka telah melakukannya maka bayi itu akan benar-benar dianngap sudah menjadi Nasrani. Sehingga Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sibgah Allah} berpeganglah pada agama Allah yang memfitrahkan manusia atas agama itu {Siapa yang lebih baik sibgahnya} agamanya {daripada Allah. Hanya kepadaNyalah kami menyembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138. Maksudnya, peganglah shibgah Allah yaitu agamaNya, tegakkanlah dia dengan penegakan sebenar-benarnya dengan segala perbuatan lahir maupun batin, dan juga akidah-akidahnya pada setiap waktu, hingga hal itu menjadi shibgah dan sifat diantara sifat-sifat kalian, lalu apabila dia adalah sifat dari sifat-sifat kalian, maka hal itu mengharuskan kalian untuk tunduk kepada perintah-perintahNya secara pasrah, penuh kesadaran dan kecintaan, hingga agama menjadi tabiat kalian seperti sebuah celupan yang sempurna bagi sebuah pakaian yang jelas menjadi sifat baginya, sehingga tercapailah kebahagiaan dunia maupun akhirat, karena agama menganjurkan kepada akhlak yang mulia, amalan yang luhur, dan perkara yang indah. Oleh karena itu, Allah berfirman sebagai kekaguman yang jelas bagi akal yang sehat, “Dan siapakah yang lebih baik shibghahnya daripada Allah?” maksudnya, tidak ada yang lebih baik shibghahnya dari shibghah Allah. Apabila kamu ingin tahu salah satu contohnya yang menjelaskan kepada kamu tentang perbedaan shibghah Allah dengan shibghah selainNya, maka analogikanlah sesuatu dengan hal yang berkontradiksi dengannya, bagaimanakah kamu melihat seorang hamba yang beriman kepada Tuhannya dengan keimanan yang benar yang mempengaruhi kepasrahan hati dan ketundukan anggota tubuh dengannya, dan dia akan selalu menghiasi dirinya dengan sifat-sifat yang mulia, amalan yang baik, adab yang luhur dan tata krama yang santun, juga menjauhkan dirinya dari sifat-sifat yang jelek, hina dan dina, maka sifatnya adalah kejujuran dalam perkataan dan perbuatan, sabar, ramah tamah, menjaga diri, berani, berbuat baik lewat lisan maupun tindakan, mencintai Allah, takut kepadaNya, khawatir akan pembalasanNya, mengharapNya, hingga dia ikhlas hanya untuk Allah dan berlaku baik kepada hamba-hambaNya, bandingkanlah dengan seorang hamba yang mengingkari Tuhannya, jauh dariNya dan mendekat kepada selainNya dari makhluk-makhlukNya. Dia mempunyai sifat yang buruk seperti kufur, syirik, dusta, khianat, tipu daya, tidak menjaga diri, dan berbuat tidak baik kepada makhluk secara lisan maupun tindakan, maka tidak ada keikhlasan kepada tuhanNya dan tidak juga berbuat baik kepada hamba-hambaNya. Dengan demikian sangatlah jelas perbedaannya bagi Kamu di antara kedua hamba tersebut, dan mengertilah kamu bahwa tidak ada shibghah yang lebih baik daripada shibghah Allah, dan termasuk makna hal ini adalah tidak ada shibghah yang lebih jelek daripada orang y ang tercelup dengan shibghah selain agama Allah. Dalam firmanNya, “Dan hanya kepadaNya-lah kami menyembah, ” terkandung sebuah penjelasan akan shibghah tersebut yaitu menunikan dua dasar; keikhlasan dan mengikuti contoh, karena ibadah itu adalah sebuah kata yang menyeluruh bagi setiap hal yang dicintai oleh Allah dan diridhaiNya, baik perbuatan maupun perkataan lahir maupun batin, dan hal itu tidak bisa terjadi, hingga Allah mensyariatkannya melalui lisan RosulNya dan ikhlas, yaitu adalah seorang hamba menghendaki Wajah Allah semata dalam perbuatan-perbuatan tersebut, dan dengan mendahulukan kata yang menjadi obyek, maka maknanya bermaksud pembatasan. Dan Allah berfirman, “Dan hanya kepadaNya-lah kami menyembah.” Allah menjelaskan mereka dengan memakai kata “isim fa’il” atau kata benda pelaku yang menunjukkan akan kelanggengan dan keberlangsungan agar menunjukkan bahwa mereka bersifat seperti itu, dan hal itu telah menjadi shibghah bagi mereka secara pasti."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { صِبۡغَةَ ٱللَّهِ } Shibghatallah : Agama yang kami sucikan bagi secara lahir maupun batin. Maka nampak jelas hasilnya, sebagaimana nampak bekas warna pada baju yang dicelupkan dalam pewarna. Makna ayat : Pada ayat (138) Allah Ta’ala memberikan perintah kepada rasulNya dan orang-orang mukmin untuk berkata tegas kepada Yahudi dan Nasrani, katakan kepada mereka.”Kami mengikuti sibghah Allah Ta’ala yang telah dibuat untuk kami yaitu agama Islam. Dan kami beribadah hanya kepadaNya. Pelajaran dari ayat : • Wajib bagi orang yang akan masuk ke dalam agama Islam untuk mandi sebagaimana mandi junub. Ini termasuk bagian dari shibghah Allah Ta’ala, bukan dengan cara dibaptis sebagaimana yang dilakukan oleh orang Nasrani kepada bayi yang berumur tujuh hari, dengan cara mencelupkannya ke dalam air baptis. Mereka menganggap bahwa ari tersebut dapat mensucikannya sehingga tidak perlu dikhitan lagi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 138: Kemudian Allah mengajarkan bahwasannya agama Allah ini akan selalu ada sampai hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Shibghah artinya celupan. Shibghah Allah: celupan Allah yang berarti iman kepada Allah yang tidak disertai dengan kemusyrikan, bisa juga diartikan fitrah atau agama Allah, yakni \"Peganglah agama Allah, di mana Dia menciptakan kalian di atasnya.\" Memegang agama Allah ini menghendaki untuk melaksanakan ajaran Islam baik amalan tersebut terkait dengan zhahir maupun batin serta memegang 'aqidah Islam di setiap waktu sehingga hal itu menjadi shibghah dan sifat yang melekat pada diri seseorang. Jika sudah melekat, tentu kita akan senantiasa tunduk kepada perintah-Nya dengan sikap rela, cinta dan sebagai pilihan bukan karena terpaksa. Pengamalan ajaran Islam pun menjadi tabi'at dirinya seperti celupan yang merubah warna pakaian sebelumnya. Dirinya akan memiliki akhlak mulia, amalan yang indah dan mendahulukan perkara utama. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman dengan rasa takjub yang membuat orang-orang yang berakal terpesona, \"siapakah yang lebih baik shibghahnya daripada Allah?\" yakni tidak ada yang dapat merubah orang lain sehingga menjadi indah dipandang selain syari'at Allah Subhaanahu wa Ta'aala. Untuk mengetahui kehebatan shibghah Allah, cobalah bandingkan antara seorang hamba yang beriman kepada Allah dengan iman yang benar, tentu akan membekas dalam dirinya rasa tunduk baik dari hati maupun anggota badannya kepada Allah, ia senantiasa memiliki sifat mulia, seperti jujur lisannya, banyak kebaikannya, sedikit bicara, banyak berbuat, sedikit sekali tergelincir, tidak berlebihan dalam sesuatu selain dalam hal yang memberinya manfa'at seperti ibadah, berbakti kepada orang tua dan menyambung tali silaturrahim, sopan, sabar, memiliki rasa syukur yang tinggi, tidak lekas marah, memenuhi janji, menjaga dirinya dari yang haram, tidak suka melaknat, memaki, tidak mengadu domba serta ghibah (menggunjing orang), tidak tergesa-gesa, tidak dendam, tidak bakhil dan dengki, menampakkan wajah yang senang dan berseri-seri, cinta karena Allah dan benci pun karena-Nya, ridha karena Allah serta marah pun karena-Nya. Kemudian bandingkan dengan seorang yang jauh dari syari'at Allah; akhlaknya buruk seperti suka berdusta, khianat, suka menipu, buruk ucapan dan tindakannya, tidak ikhlas kepada Allah dan tidak suka berbuat ihsan kepada orang lain. Ayat ini menerangkan tentang bagaimana memperoleh shibghah ini, yaitu dengan melaksanakan dua asas; ikhlas dan mutaba'ah (mengikuti Rasulullah shallallahu 'alaihi wa sallam). Mengapa diambil kesimpulan demikian? Hal itu, karena ibadah adalah istilah untuk semua perkara yang dicintai Allah dan diridhai-Nya berupa ucapan dan amalan yang nampak maupun tersembunyi, dan hal itu tidak akan diperoleh kecuali dengan mengikuti contoh Rasulullah shallallahu 'alaihi wa sallam. Sedangkan arti ikhlas adalah tujuan seorang hamba dalam melakukan semua itu untuk mencari keridhaan Allah dan Inilah ibadah. Pada ayat tersebut ada penggunaan isim fa'il (pelaku), yaitu 'aabiduun yang menunjukkan tetapnya mereka di atas ibadah tersebut, di atas sifat itu dan hal itu sudah menjadi shibghah (melekat) pada diri mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 138",
    "description": "Keberagamaan dan keimanan seperti yang diajarkan oleh nabi ibrahim itu merupakan shibgah atau celupan Allah. Siapa yang lebih baik shibgah-Nya daripada Allah' tentu tidak ada. Dan kepada-Nya kami menyembah. Kata celupan pada ayat ini mengandung arti keimanan kepada Allah yang tidak disertai kemusyrikan sedikit pun. Makna ini ditegaskan oleh perka taan dan hanya kepada-Nyalah, bukan kepada yang lain, kami menyembah. Ini juga mengindikasikan bahwa keberagamaan kita harus bersifat total sehingga seluruh totalitas kita terwarnai oleh celupan agama Allah itu. Ayat ini berkaitan dengan ayat 135 yang memerintahkan nabi Muhammad untuk mengatakan kepada mereka bahwa kami hanya mengikuti agama nabi ibrahim. Kini, pada ayat ini, nabi Muhammad diperintahkan untuk mendebat mereka. Katakanlah, apakah kamu hendak berdebat dengan kami tentang ke esaan dan kemahasempurnaan Allah, padahal dia adalah tuhan kami dan tuhan kamu. Kita sama-sama menyembah-Nya dan kita pun tidak bisa menghindar dari ketetapannya. Kalau begitu, bagi kami amalan kami yang akan kami pertanggungja wabkan, dan demikian pula bagi kamu amalan kamu yang akan kamu pertanggungjawab kan. Dan hanya kepada-Nya kami dengan tulus mengabdikan diri tanpa mempersekutukan-Nya, sedangkan kamu mem persekutukan-Nya dengan nabi isa dan para nabi yang lain."
  }
]