[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah -wahai rasul- kepada ahli kitab, “Apakah kalian akan mendebat kami tentang tauhidullah dan kewajiban ikhlas kepada Nya, sedangkan Dia adalah tuhan alam semesta semuanya, tidak hanya menguasai suatu kaum saja tanpa berkuasa atas kaum lainnya, bagi kami amal-amal kami dan bagi kalian amal-amal kalian. Dan hanya kepada Allah kami mengiklaskan ibadah dan ketaatan kami tidak menyekutukan apapun dengan Nya, dan kami tidak menyembah siapapun selainnya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Katakanlah -wahai Nabi-, “Apakah kalian -wahai ahli kitab- mengatakan kepada kami bahwa kalian lebih dekat dengan Allah dan agama-Nya daripada kami karena agama kalian lebih dahulu dan kitab suci kalian lebih awal? Sesungguhnya hal itu tidak ada gunanya bagi kalian. Karena Allah adalah Rabb kita semua, bukan Rabb kalian saja. Bagi kami amal perbuatan kami yang mana kalian tidak akan ditanya tentangnya, dan bagi kalian amal perbuatan kalian yang mana kami tidak akan ditanya tentangnya. Masing-masing akan diberi balasan yang setimpal dengan amal perbuatannya. Kami ikhlas karena Allah dalam beribadah dan menjalankan ketaatan, kami tidak menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139-140. Allah memerintahkan Nabi Muhammad agar mengolok mereka: “Apakah kalian akan mendebat kami dalam hal mengesakan dan mentaati Allah, sedangkan Dia adalah Tuhan kita semua yang mengatur kami dan kalian? Kami berlepas diri dari kalian dan kami akan mendapat balasan atas amalan kami, begitupun kalian berlepas diri dari kami dan kalian akan mendapat balasan atas amalan kalian. Kami memurnikan peribadatan dan ketaatan kami kepada-Nya. Bahkan kalian mengklaim bahwa Ibrahim, Ismail, Ishaq, Ya’qub dan keturunannya berada dalam agama Yahudi dan Nasrani?” Katakanlah kepada mereka hai Rasulullah: “Apakah kalian lebih mengetahui agama mereka daripada Allah? Sedangkan Allah telah bersaksi bahwa agama mereka adalah agama Islam. Tidak ada yang lebih zalim dari kalian ketika kalian menyembunyikan kesaksian yang tercantum dalam kitab kalian yang diturunkan Allah. Dan Allah sekali-kali tidak akan lalai dari segala amalan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ (Katakanlah: “Apakah kamu memperdebatkan dengan kami tentang Allah) Yakni apakah kalian memperdebatkan dengan kami tentang Allah padahal kita sama-sama beranggapan bahwa ketuhanan-Nya adalah untuk kita dan peribadatan kita untuk-Nya. Lalu mengapa kalian mengaku lebih utama dari pada kami dan memperdebatkan hal itu? وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ (bagi kami amalan kami, dan bagi kamu amalan kamu) Yakni kalian tidak lebih utama untuk Allah daripada kami. وَنَحْنُ لَهُ مُخْلِصُونَ(dan hanya kepada-Nya kami mengikhlaskan hati) Yakni kita adalah ahli ikhlas dalam beribadah, sedangkan kalian tidak; dan itu adalah timbangan keutamaan seseorang dan sifat yang menjadikan memiliknya menjadi lebih utama dihadapan Allah daripada yang lain. Lalu mengapa kalian mengaku lebih utama dan lebih berhak dari pada kami, sedangkan diri kalian dipenuhi dengan kesyirikan dan menyandarkan ketuhanan kepada selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Nabi, katakanlah kepada ahli kitab (Yahudi dan Nasrani): “Apakah kalian semua akan mendebat kami tentang hukum Allah, padahal kalian tahu bahwa kami dan kalian sama-sama menyembah Allah. Kalau sudah begitu, kenapa kalian tetap memaksa agar Allah memilih rasul dari golongan kalian? Bukankah kalian juga tahu, bahwa Allah akan membalas segala perbuatan kita semua. Kalian tidak lebih utama di sisi Allah dari pada kami. Kami tetap berserah diri sepenuh hati dalam beribadah kepada Allah, meskipun kalian tetap enggan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah kalian hendak beradu argumen dengan kami} apakah kalian hendak berdebat dengan kami{tentang Allah? Padahal, Dia adalah Tuhan kami dan Tuhan kalian. Bagi kami amalan kami, bagi kalian amalan kalian. Hanya kepadaNyalah kami ikhlas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139. Kata ‘Al-mahajjatu’ bermakna perdebatan antara dua orang atau lebih dalam masalah-masalah khilafiyah hingga setiap pihak dari kedua belah pihak mengusahakan untuk menguatkan argument-argumen lawannya, setiap pihak dari mereka berusahan untuk menegakkan argument dalam hal tersebut. Yang diharapkan dalam perebatan itu adalah seharusnya berjalan dengan cara yang paling baik, dengan jalan yang paling dekat untuk mengembalikkan seseorang yang tersesat pada kebenaran, dan menegakkan hujjah atas orang-orang yang keras kepala, menjelaskan kebenaran dan menerangkan kebatilan. Jika keluar dari prinsip-prinsip di atas, maka perdebatan itu menjadi sebuah perdebatan kusir dan pertengkaran mulut yang tidak ada gunanya, dan dapat menimbulkan keburukan. Para ahli kitab mengaku bahwa mereka adalah yang paling berhak kepada Allah daripada kaum Muslimin. ini hanyalah sebatas pengakuan yang butuh dalil dan keterangan yang kuat. Apabila Tuhan bagi semuanya hanya satu dan bukan Tuhan kalian saja, dan setiap dari kita dan kalian memiliki amal perbuatan hingga kalian dan kami sama sederajat dalam hal itu, dengan demikian hal itu tidaklah mengaharuskan adanya salah satu dari kedua kelompok itu lebih berhak kepada Allah dari lainnya, karena pembedaan dengan adanya keikutsertaan dalam suatu hal tanpa ada perbedaan yang mempengaruhi adalah sebuah pengakuan yang kosong dan batil, dan memisahkan antara kedua hal yang semisal adalah suatu kecongkakan yang jelas sekali. Hanya saja dapat terjadi pengutamaan yang didasarkan dengan keikhlasan dalam amalan-amalan shalih hanya untuk Allah semata. Dan kondisi yang seperti itu hanyalah sifat kaum Mukminin saja, maka pastilah bahwa merekalah yang paling berhak kepada Allah daripada selainnya, karena keikhlasan adalah jalan menuju keselamatan. Inilah perbedaan antara wali-wali ar-Rahman dan wali-wali setan dalam sifat-sifat yang hakiki yang diterima oleh orang-orang yang berakal dan tidak diperdebatkan kecuali oleh orang yang sombong dan bodoh. Ayat ini menunjukkan sebuah bimbingan yang baik dalam perdebatan, dan bahwasanya segala perkara itu harus berdasar atas asas penggabungan antara hal-hal yang semisal dan pemisahan antara hal-hal yang berbeda."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَتُحَآجُّونَنَا } Atuhaajjuunnanaa : Apakah engkau mendebat kami dalam perkara agama, keimanan kepada Allah dan rasulNya? Kata tanya ini digunakan sebagai pengingkaran. (Istifham inkariy) { لَهُۥ مُخۡلِصُونَ } Lahuu mukhlisuun : Mengikhlaskan ibadah kepada Allah Ta’ala, tidak berbuat kesyirikan dengan mempersembahkan ibadah kepada selainNya, sedangkan kalian adalah orang-orang musyrik. Makna ayat : Allah Ta’ala memerintahkan rasulNya untuk mengingkari perdebatan yang dilakukan oleh Ahli kitab mengenai Allah Ta’ala. Karena mereka mengaku bahwa mereka lah yang paling dekat dengan Allah dibandingkan Rasulullah dan orang-orang mukmin. Mereka berkata,”Kami adalah anak-anak Allah dan kesayanganNya.” Maka Allah memberi tahukan rasulNya bagaimana mengingkari pernyataan mereka yang tidak benar itu. Pelajaran dari ayat : • Keutamaan ikhlas yaitu tidak berpaling kepada selain Allah Ta’ala tatkala beribadah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 139: Allah memerintahkan nabinya agar berkata kepada ahli kitab: Apakah kalian mendebat kami dalam urusan agama Allah yang Ia tuhan kami dan tuhan kalian, pencipta kami dan pencipta kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada ahli kitab. Berdebat atau disebut dalam bahasa Arab muhaajjaah artinya berdebat dalam masalah yang diperselisihkan, di mana masing-masing pihak berusaha memenangkan pendapatnya dan membatalkan pendapat lawannya. Dalam hal ini, kita diperintahkan dengan cara yang baik, yakni dengan cara yang bisa menarik orang yang tersesat kepada kebenaran dan menegakkan hujjah kepada orang yang susah diajak, menerangkan yang hak dan menjelaskan yang batil. Jika keluar dari hal tersebut, maka ia bukanlah mujadalah (berdebat) tetapi sebagai miraa' (debat kusir) yang tidak ada kebaikan di dalamnya, dan malah menimbulkan keburukan. Orang-orang ahli kitab menganggap bahwa mereka lebih dekat dengan Allah daripada kaum muslim. Anggapan jelas membutuhkan bukti dan dalil. Padahal Tuhan semua manusia hanya satu yaitu Allah, Dia bukan Tuhan mereka saja, bahkan Tuhan kita juga. Oleh karena itu, kita dan mereka adalah sama, karena membedakan antara hal yang sama tanpa ada sesuatu pembeda adalah batil. Bahkan berbedanya antara yang satu dengan yang lain hanyalah tergantung pengikhlasan amal untuk-Nya semata, dan ternyata keadaan seperti ini hanya ada pada orang-orang mukmin, maka tentu mereka lebih dekat dengan Allah dibanding yang lain. Ikhlas inilah yang membedakan antara wali Allah dengan wali setan. Dalam ayat ini, terdapat petunjuk yang halus cara berdebat dan bahwa masalah itu didasari atas menyamakan hal yang memang sama dan membedakan hal yang memang beda."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 139",
    "description": "Ayat ini berkaitan dengan ayat 135 yang memerintahkan nabi Muhammad untuk mengatakan kepada mereka bahwa kami hanya mengikuti agama nabi ibrahim. Kini, pada ayat ini, nabi Muhammad diperintahkan untuk mendebat mereka. Katakanlah, apakah kamu hendak berdebat dengan kami tentang ke esaan dan kemahasempurnaan Allah, padahal dia adalah tuhan kami dan tuhan kamu. Kita sama-sama menyembah-Nya dan kita pun tidak bisa menghindar dari ketetapannya. Kalau begitu, bagi kami amalan kami yang akan kami pertanggungja wabkan, dan demikian pula bagi kamu amalan kamu yang akan kamu pertanggungjawab kan. Dan hanya kepada-Nya kami dengan tulus mengabdikan diri tanpa mempersekutukan-Nya, sedangkan kamu mem persekutukan-Nya dengan nabi isa dan para nabi yang lain. Kaum yahudi dan nasrani mengaku mengikuti nabi ibrahim yang mengajarkan tauhid, yang dengannya mereka merasa berhak masuk surga, padahal mereka telah me nyimpang. Dugaan mereka itu dibantah dalam ayat ini. Ataukah kamu, orang-orang yahudi dan nasrani, berkata bahwa ibrahim, ismail, ishak, yakub, dan anak cucunya adalah penganut yahudi atau nasrani, agar dakwaan kamu menjadi benar' katakan lah, kamukah yang lebih tahu tentang hal itu atau Allah' orang-orang yahudi dan nasrani sebenarnya tahu bahwa ibrahim tidak mungkin beragama yahudi ataupun nasrani, karena dia hidup jauh sebelum nabi musa dan nabi isa, tetapi mereka menyembunyikan hal itu. Dan siapakah yang lebih zalim daripada orang yang menyembunyikan kesaksian dari Allah yang ada padanya' yakni persaksian Allah dalam taurat dan injil bahwa nabi ibrahim dan anak cucunya bukan penganut yahudi maupun nasrani dan bahwa Allah akan mengutus nabi Muhammad. Allah tidak lengah terhadap apa yang kamu kerjakan."
  }
]