[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik tersebut apabila bertemu dengan kaum Mukminin mereka berkata: “kami membenarkan agama Islam seperti kalian”. akan tetapi jika mereka berpaling dan Pergi mendatangi para pemuka mereka yang kafir lagi membangkang terhadap Allah, mereka menegaskan di hadapan para tokoh itu bahwa mereka Tetaplah di atas kekafiran yang dulu dan tidak meninggalkannya, sesungguhnya mereka sekedar mengolok-olok kaum mukminin dan mengejek mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Apabila mereka berjumpa dengan orang-orang mukmin, mereka berkata, “Kami percaya dengan apa yang kalian imani.” Mereka mengatakan hal itu karena takut kepada orang-orang mukmin. Dan apabila mereka berpisah dengan orang-orang mukmin dan berjumpa dengan para pemimpin mereka secara tertutup, mereka menegaskan akan tetap patuh kepada mereka (para pemimpin kafir). Mereka mengatakan, “Sesungguhnya kami tetap bersama kalian dan sejalan dengan kalian, tetapi kami sengaja menunjukkan sikap setuju dengan orang-orang yang mukmin semata-mata untuk mengejek dan mengolok-olok mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Setelah Allah menjelaskan dalam ayat-ayat ini kemunafikan mereka dan sebabnya, serta keadaan mereka saat diseru kepada kebenaran, kemudian Allah menjelaskan ciri-ciri mereka dari sisi perkataan mereka yang menipu dengan berfirman: وإذا لقوا Yakni orang-orang munafik jika berkumpul dengan orang-orang beriman maka mereka akan menampakkan keimanan; namun jika mereka berkumpul dengan para pemimpin kafir maka mereka menyatakan kekafiran, dan apa yang mereka katakan kepada orang-orang beriman hanyalah olok-olok semata. Adapun perkataan mereka (إنا معكم) dengan kalimat penegasan adalah karena kemahiran mereka dalam berbuat nifak saat bertemu kaum muslimin yang menimbulkan keraguan dan sangkaan para pemimpin orang-orang kafir akan keteguhan kaum munafik itu dalam kekafiran. Oleh sebab itu mereka butuh penegasan bahwa mereka tetap teguh dalam kekafiran. Demikian pula penegasan yang ada dalam kalimat (إنما نحن مستهزؤون)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَاِذَا خَلَوْا اِلٰى شَيٰطِيْنِهِمْ (Tetapi apabila mereka kembali kepada setan-setan (para pemimpin) mereka) Yakni pemimpin-pemimpin mereka dalam kekufuran yang senantiasa merencanakan keburukan. قَالُوْٓا اِنَّا مَعَكُمْ ۙ (mereka berkata, Sesungguhnya kami bersama kamu) Yakni senantiasa dalam kekufuran. اِنَّمَا نَحْنُ مُسْتَهْزِءُوْنَ (kami hanya berolok-olok) Yakni kepada orang-orang mukmin dengan mengaku sehati dengan mereka, padahal hati kami sama sekali tidak condong kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah bagaimana mereka mengatakan : { اِنَّا مَعَكُمْ } \"sesungguhnya kami bersama kalian (wahai orang beriman)\" , padahal kenyataannya adalah menyalahi hal itu, karena orang-orang beriman meragukan keimanan dalam diri para munafiqin, sedangkan kaum mereka tidak meragukan dan tidak mempermasalahkan tetapnya mereka diatas agama; karena tatkala kemunafikan mereka muncul ketika bertemu dengan para mukminin yang akhirnya menjadi sebab keraguan para pembesar-pembesar agama mereka tentang tetapnya para munafik ini diatas kekafiran, mereka butuh kepada sesuatu yang meyakinkan bahwa para munafik itu sebenarnya tetap diatas agama mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ketika mereka bertemu orang-orang mukmin, mereka menampakkan keimanan mereka, dan ketika kembali kepada pemimpin-pemimpin kafir mereka, mereka berkata: kami adalah orang-orang yang tetap ingkar dan memperolok orang-orang muslim dengan berpura-pura sepakat dengan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka berjumpa dengan orang-orang yang beriman, mereka berkata, “Kami telah beriman.” Akan tetapi apabila mereka berlalu} mereka berbalik {kepada setan-setan mereka} para pemimpin mereka {mereka berkata, “Sesungguhnya kami bersama kalian, kami hanyalah orang yang suka mengolok-olok”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Inilah yang biasa keluar dari lisan-lisan mereka yang bukan dari hati mereka, yaitu bahwasanya mereka ini bila berkumpul dengan kaum Mukminin, maka mereka menampakkan bahwa mereka dalam satu manhaj dengan kaum Mukminin dan bahwa mereka sama dengan kaum Mukminin, namun bila mereka kembali kepada setan-setan mereka –yaitu pemimpin-pemimpin dan ketua-ketua kejahatan mereka-, maka mereka berkata, “sesungguhnya pada hakikatnya kami ini bersama kalian, kami hanya mengolok-olok kaum Mukminin dengan menampakkan kepada mereka bahwa kami berada di atas jalan mereka. “Inilah kondisi mereka secara lahir dan batin, dan tidaklah makar yang buruk itu kecuali akan menimpa pelakunya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : لَقُواْ al-Mulaaqaah berarti bertemu secara tatap muka ءَامَنُواْ Aamanuu : Iman secara syar’i adalah meyakini tentang Allah dari semua yang diberitakan oleh Rasulullah g dari Allah. Orang yang meyakininya dinamakan orang mukmin yang sejati. خَلَوۡاْ al-Khuluwwu bisyai’i artinya adalah berpaling darinya شَيَٰطِينِهِمۡ asy-Syaithoon maknanya adalah segala sesuatu yang jauh dari kebaikan, dekat kepada keburukan. Berbuat kerusakan dan tidak melakukan perbaikan, baik itu manusia ataupun. Adapun yang dimaksud di sini adalah para pembesarnya dalam melakukan keburukan dan kerusakan. مُسۡتَهۡزِءُونَ al-istihzaa’u meremehkan dan merendahkan orang lain. Makna ayat : Ayat-ayat di atas masih saja membicarakan tentang kaum munafik dan sifat-sifatnya. Allah mengabarkan pada ayat (14) bahwa mereka disebabkan nifaq dan kebusukan dalam hatinya jika bertemu orang mukmin di suatu tempat, akan memberi tahukan bawha mereka beriman kepada Allah, rasulNya, dan syariatNya. Namun, apabila berkumpul dengan pembesar-pembesar kesesatan mereka mengejek apa yang dikatakan tentang keimanan dan berkata,”Kami bersama kalian di atas agama kalian, dan kami tidak akan beriman selamanya. Adapun kami menampakkan keimanan hanya sebagai ejekan bagi Muhammad dan sahabat-sahabatnya.” Pelajaran dari ayat : Pemberitahuan tentang orang-orang munafik dan peringatan dari kelakuan mereka yang memiliki dua wajah, bertemu dengan orang ini dengan wajah baik, dan bertemu orang lain dengan wajah buruknya. Dalam hadits disebutkan,”Orang yang paling buruk di antara kalian adalah bermuka dua.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 14: Allah mengabarkan bahwasanya orang-orang munafik jika mereka berkata kepada orang-orang yang beriman ketika mereka berbaur dengan orang-orang yang beriman maka mereka akan menampakan keimanan mereka ; maka jika mereka kembali kepada para pembesar pembesar mereka yang kafir mereka berkata : kami bersama kalian secara keyakinan dan agama , karena takut kepada orang-orang yang beriman dan hanya memperolok mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang munafik. Maksudnya, pemimpin-pemimpin mereka yang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 14",
    "description": "Dan apabila mereka, orang-orang munafik, berjumpa dengan orang yang beriman, mereka berkata, kami telah beriman seperti yang kalian yakini tentang kebenaran rasul dan dakwahnya. Mereka menyatakan beriman secara lisan untuk melindungi diri dan meraih keuntungan material. Tetapi apabila mereka kembali kepada teman-teman dan para pemimpin mereka yang menyerupai setan-setan dalam perilaku mereka yang selalu berbuat kerusakan dan kejahatan, mereka berkata, sesungguhnya kami tidak berubah dan tetap bersama kamu di satu jalan dan satu perbuatan, kami hanya berolok-olok ketika kami mengatakan beriman di hadapan orang-orang mukmin. Sebagai balasan atas perbuatan mereka itu, Allah akan memperlakukan mereka seperti orang yang memperolok-olokkan dan merendahkan mereka, dan membiarkan mereka dengan menangguhkan siksa-Nya beberapa saat sehingga mereka semakin jauh terombang-ambing dalam kesesatan dan semakin buta dari kebenaran, sampai akhirnya datang saat yang tepat untuk menyiksa mereka, seperti yang akan dijelaskan pada surah a'li imra'n/3: 87."
  }
]