[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu umat yang mendahului kalian dan telah berlalu, bagi mereka amal perbuatan mereka bagi kalian amal perbuatan kalian, kalian tidak dimintai pertanggungjawaban tentang amal perbuatan mereka dan mereka pun tidak dimintai pertanggungjawaban tentang perbuatan amal kalian. Dan dalam ayat ini terkandung petunjuk untuk memutus ketergantungan kepada manusia lainnya, dan tidak boleh silau dengan garis keturunan yang tersambung dengan mereka, serta ukuran itu ialah iman pada Allah dan ibadah kepada Nya semata, dan mengikuti para rasul, dan bahwasanya orang-orang yang kafir kepada salah seorang Rasul dari rasul-rasul Allah maka sesungguhnya dia telah kafir kepada semua Rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Itulah umat yang telah berlalu sebelum kalian. Mereka telah menemui (balasan) amal perbuatan yang telah mereka lakukan. Mereka akan mendapatkan balasan amal perbuatan mereka lakukan, dan kalian pun akan mendapatkan balasan amal perbuatan kalian. Kalian tidak akan ditanya tentang amalan mereka, dan mereka pun tidak akan ditanya tentang amalan kalian. Maka tidak ada seorangpun yang akan dihukum karena dosa orang lain, dan dia tidak akan mendapat manfaat apapun dari apa yang dilakukan orang lain. Setiap orang akan mendapatkan balasan atas apa yang diperbuatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141. Itulah sekelompok manusia yang telah berlalu masanya, bagi mereka balasan apa yang telah mereka kerjakan, dan bagi kalian balasan apa yang kalian kerjakan; kalian tidak akan ditanya di hari kiamat tentang amal perbuatan mereka di dunia, namun setiap orang hanya akan ditanya tentang amal perbuatannya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka-lah umat-umat yang telah usai. Mereka mendapat balasan atas segala amalnya, begitu juga kalian akan mendapat balasan baik amal kebaikan atau keburukan. Tidak ada gunanya kalian bersekutu dengan mereka kalau kalian tidak beramal kebaikan. Kelak di hari kiamat, kalian akan dimintai pertanggungjawaban atas perbuatan kalian. Bukan pertanggungjawaban atas para pendahulu kalian, atau orang-orang yang hidup setelah kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah umat yang telah lalu. Bagi mereka apa yang telah mereka usahakan dan bagi kalian apa yang telah kalian usahakan. Kalian tidak akan diminta pertanggung jawaban atas apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141. Telah berlalu tafsir ayat tersebut. Dan Allah mengulang ayat ini untuk memupuskan adanya ketergantungan kepada makhluk, dan bahwasanya yang menjadi sifat manusia itu, bukan dari perbuatan para pendahulu dan nenek moyangnya. Maka manfaat yang sebenarnya adalah dengan perbuatan, bukan dengan sebatas penisbatan diri kepada orang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Kemudian, Allah Ta’ala mengulangi kembali apa yang telah ditegaskan pada ayat-ayat sebelumnya, untuk meneruskan pembinaan dan perbaikan jika mereka memang pantas untuk menjadi orang yang baik. Allah Ta’ala mengabarkan bahwa berbangga dengan generasi terdahulu dan keturunan tidak bermanfaat bagi mereka. Oleh karena itu hendaknya mereka menyelamatkan dirinya sendiri dari kebodohan, dengan iman, islam, dan ihsan. Adapun generasi yang terdahulu sudah lewat masanya dan akan mendapat balasan apa yang mereka lakukan. Dan kalian akan mendapatkan balasan atas perbuatan kalian sendiri, dan kalian tidak akan ditanya mengenai amalan orang lain serta tidak mungkin akan diberikan pahala atas amalan yang dilakukan orang lain. Pelajaran dari ayat : • Setiap orang akan dibalas sesuai amalan yang telah dikerjakannya, dan tidak akan ditanya tentang amalan orang lain, kecuali jika menjadi penyebab terjadinya amalan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 141: Kemudian Allah mengulangi ayat-ayat ini dan mengajarkan bahwasannya disana ada jamaah dari golongan para nabi dan rasul berserta para pengikutnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat di atas terdapat pemutusan hubungan ketergantungan kepada makhluk, iman dan amal mereka tidak bisa dilimpahkan kepada yang lain sebagaimana dosa orang lain tidak dilimpahkan kepadanya. Demikian juga agar kita tidak tertipu oleh nasab, bahkan yang dinilai adalah iman dan amal shalih, bukan amal nenek moyang kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 141",
    "description": "Itulah, yakni nabi ibrahim dan anak cucunya, umat yang telah lalu. Seandainya mereka benar menganut agama yahudi atau nasrani seperti yang kamu duga, perbuatan mereka tidak akan berguna bagi kamu karena mereka mengamalkan agamanya dengan benar, se dangkan kamu tidak. Baginya apa yang telah mereka usahakan dan bagimu apa yang telah kamu usahakan. Dan kamu tidak akan diminta pertanggungjawaban ten-tang apa yang dahulu mereka kerjakan setelah pada ayat yang lalu diceritakan perilaku kaum yahudi secara umum, pada ayat ini Allah menjelaskan sikap mereka dan juga orang musyrik terkait persoalan khusus, yaitu pengalihan kiblat salat dari baitulmakdis di palestina ke kakbah di mekah. Pada saat nabi berhijrah ke madinah, beliau dan para sahabatnya selama 16 sampai 17 bulan melaksanakan salat menghadap ke baitulmakdis. Pada rajab tahun ke-2 hijriah, Allah memerintahkan nabi untuk menghadap ke masjidilharam di mekah. Tentang hal ini Allah berfirman sebagai berikut. Orang-orang yang kurang akal di antara manusia, yakni sebagian orang yahudi dan kelompok lain, akan mengolok-olok nabi dan kaum mukmin dengan berkata, apakah yang memalingkan mereka, yakni kaum muslim, dari kiblat yang dahulu mereka berkiblat kepadanya' pemberitahuan awal ini dilakukan agar nabi dan orang-orang islam tidak kaget jika hal itu tejadi. Lalu Allah memerintahkan kepada nabi untuk menjawab mereka. Katakanlah, wahai rasul, milik Allah-lah timur dan barat. Allah berhak untuk menyuruh hamba-Nya menghadap ke arah mana saja, apakah ke arah timur atau barat, karena semua arah adalah milik Allah. Mereka yang beriman dengan benar akan mengikuti seluruh perintah Allah. Mereka itulah yang mendapat petunjuk dari Allah. Dia memberi petunjuk kepada siapa yang dia kehendaki ke jalan yang lurus. Allah yang paling mengetahui siapa yang pantas untuk mendapat petunjuk itu."
  }
]