[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan berkata orang-orang bodoh dan lemah akal dari kaum Yahudi dan orang-orang yang dengan mereka untuk mengolok-olok dan melakukan penentangan, “apakah yang memalingkan mereka dari kiblat mereka yang sebelumnya mereka mengerjakan shalat dengan menghadap ke arahnya pada permulaan Islam?” ( yaitu Baitul Maqdis). Katakanlah- wahai rasul- kepada mereka, “arah timur dan barat dan arah yang ada di antara keduanya adalah milik Allah, tidak ada satu orang pun yang keluar dari kepemilikan Allah, Dia memberi petunjuk kepada orang yang dikehendaki Nya dari para hamba-Nya menuju jalan hidayah yang lurus.” Dan dalam ayat ini terdapat satu pemberitahuan bahwa segala urusan itu tergantung pada Allah dalam menjalankan perintah-perintah Nya, maka ke arah mana pun Dia mengarahkan kita, maka kita akan menghadap ke sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "142. Orang-orang bodoh dan lemah akal dari kalangan Yahudi, orang-orang munafik yang seperti mereka bertanya, “Apa yang membuat orang-orang Islam berpaling dari kiblat Baitul Maqdis yang menjadi kiblat mereka sebelumnya?” Katakanlah -wahai Nabi- untuk menjawab pertanyaan mereka, “Allah lah satu-satunya pemilik kerajaan timur, barat dan arah mata angin lainnya. Dia berhak menghadapkan siapa saja di antara hamba-hamba-Nya ke arah tertentu yang dihendaki-Nya. Dan Dia lah yang menunjukkan hamba-hamba-Nya yang Dia kehendaki ke jalan lurus, yang tidak bengkok dan tidak menyimpang.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "142. Allah mengabarkan kepada Nabi Muhammad tentang sesuatu yang akan terjadi di masa mendatang bahwa orang-orang yang kurang akal dari kalangan Yahudi dan musyrikin akan mengatakan dengan penuh penghinaan: “Apa yang menyebabkan kaum muslimin mengubah kiblat mereka -Baitul Maqdis- yang telah mereka hadap selama mereka shalat?” Kemudian Allah memerintahkan nabi-Nya untuk menjawab mereka bahwa timur dan barat merupakan kepunyaan Allah; Dia memberi petunjuk kepada hamba-hamba-Nya yang Dia kehendaki ke jalan yang lurus, yaitu agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "142. سَيَقُولُ (akan berkata) Ini adalah kabar dari Allah yang diberikan kepada Rasulullah dan kaum muslimin behwa orang-orang yang kurang akal dari golongan Yahudi dan Nasrani akan mengatakan perkataan ini, ketika kiblat dipindahkan dari Baitul Maqdis menuju Ka’bah. السُّفَهَاءُ (Orang-orang yang kurang akal) Mereka adalah yang kurang waras dan mempunyai akal yang lemah. مَا وَلَّاهُمْ (Apakah yang memalingkan mereka (umat Islam)) Yakni Apa yang membuat mereka pindah (dari kiblat mereka) عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ۚ (dari kiblatnya yang dahulu mereka telah berkiblat kepadanya?) Yakni kapada Baitul Maqdis قُلْ لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ (Katakanlah: “Kepunyaan Allah-lah timur dan barat) Yakni maka Allah berhak untuk memerintah hamba-Nya untuk menghadap ke arah manapun. يَهْدِي مَنْ يَشَاءُ (Dia memberi petunjuk kepada siapa yang dikehendaki-Nya) Penyebutan kalimat ini agar manusia merasakan bahwa pemindahan kiblat ke Ka’bah merupakan bagian dari hidayah untuk Rasulullah dan umatnya menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "142. Orang-orang bodoh yang memiliki pemikiran lemah dari golongan orang-orang Yahudi, orang-orang musyrik dan munafik itu berkata: “Apakah sebab berpalingnya mereka dari kiblat Baitul Maqdis yang mana mereka menghadapnya sebagai kiblat dalam shalat mereka” Katakanlah kepada mereka wahai Nabi: “Milik Allah itu seluruh arah baik barat maupun timur. HakNya pula untuk memerintah menghadap ke arah manapun yang Dia kehendaki. Dia menunjukkan jalan yang lurus dalam beribadah bagi hambaNya yang dikehendaki. Jadi berpalingnya kiblat menuju Ka’bah adalah suatu hidayah” Imam Bukhari meriwayatkan dari Al-Bara’ yang berkata: “Ketika tiba di Madinah Rasulullah SAW shalat menghadap ke Baitul Maqdis selama 16 atau 17 bulan. Namun Rasulullah SAW lebih senang menghadap ke arah Ka’bah. Lalu Allah menurunkan ayat {Qad Naraa Taqalluba wajhika} [Surah Al-Baqarah ayat 144] Lalu orang-orang bodoh itu, yaitu orang Yahudi berkata: {Ma Wallaahum ‘an qiblatihimullatii kaanuu ‘alaihaa} Lalu Allah SWT berfirman: {Qul Lillahil masyriqu wal maghribu}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang bodoh} orang-orang yang bodoh dan lemah akalnya {di antara manusia akan berkata,“Apakah yang memalingkan mereka} apa yang memalingkan mereka {dari kiblat mereka} dari kiblat Baitul Maqdis {yang dahulu mereka berkiblat kepadanya?” Katakanlah, “Milik Allah itu arah timur dan barat. Dia memberi petunjuk kepada siapa saja yang Dia kehendaki ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "142. Ayat pertama meliputi mukjizat dan hiburan serta menenangkan hati kaum Mukminin, juga sebuah bantahan beserta jawabannya dari tiga faktor, dan sifat orang-orang yang membantah serta sifat orang-orang yang menerima hukum Allah sebagai agamanya. Allah ta'ala memberikan kabar bahwasanya orang-orang bodoh diantara manusia akan membantah, yaitu mereka yang tidak mengenal kemaslahatan bagi diri mereka sendiri, bahkan mereka menyia-nyiakannya dan menukarnya dengan harga yang paling rendah, mereka itu adalah Yahudi dan Nasrani dan orang-orang yang semisal dengan mereka dari orang-orang yang suka membantah hukum-hukum Allah dan syariat-syariatNya. Yang demikian itu karena kaum Muslimin diperintahkan untuk menghadap ke Baitul Maqdis selama mereka menetap di Makkah, kemudian setelah hijrah ke Madinah kira-kira satu tahun setengah lamanya (karena Allah memiliki hikmah-hikmah dibalik itu semua yang akan disebutkan sebagiannya, dan hikmahNya menuntut adanya perintah kepada mereka untuk menghadap ke Ka’bah. Lalu Allah mengabarkan kepada mereka bahwa orang-orang bodoh diantara manusia itu pasti akan berkata, “Apakah yang memalingkan mereka (umat Islam) dari kiblatnya (Baitul Maqdis) yang dahulu mereka telah berkiblat kepadanya,” yakni, menghadap Baitul Maqdis, maksudnya apa yang menyebabkan mereka berpaling darinya? Hal ini adalah sebuah bantahan terhadap hukum Allah, syariat, karunia, dan kebaikanNya. Maka Allah menghibur mereka dan Dia mengabarkan tentang kejadiannya serta hal seperti itu hanya terjadi dari orang-orang bodoh dan sedikit akal, sedikit keramahan, dan miskin agama. Maka janganlah kalian mempedulikan mereka karena telah diketahui sumber perkataan itu. Orang yang berakal tidaklah akan mempedulikan ocehan orang bodoh dan tidak mengambil pusing tentangnya. Ayat ini menunjukan bahwa tidaklah akan membantah terhadap hukum-hukum Allah kecuali orang bodoh, dungu, dan pembangkang. Sedangkan orang yang berakal, lagi beriman dan pandai, pastilah akan menerima hukum-hukum Allah dengan kepasrahan, ketundukan, serta kepatuhan, sebagai mana firman Allah ta'ala : \" Dan tidaklah patut bagi laki-laki yang mukmin dan tidak (pula) bagi perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada bagi mereka pilihan (yang lain) tentang urusan mereka.\" QS Al-Ahzab: 36, \" Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan, kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya.\" QS. An-Nisa: 65, \"Sesungguhnya jawaban oran-orang mukmin, bila mereka dipanggil kepada Allah dan rasul-Nya agar rasul menghukum (mengadili) di antara mereka ialah ucapan. “Kami mendengar, dan kami patuh”. Dan mereka itulah orang-orang yang beruntung.\" QS. An-Nur: 51. FirmanNya, “Orang-orang bodoh,” sudah cukup untuk menolak perkataan mereka dan tidak perlunya mempedulikan mereka. Akan tetapi Allah ta'ala dengan adanya hal itu tidak akan membiarkan suatu Syubhat hingga Dia menghilangkan dan menyingkap apa yang akan dibeberkan kepada sebagian hati dari bantahan tersebut. Maka Allah berfirman “Katakanlah” kepada mereka sebagai jawaban, “Kepunyaan Allah-lah timur dan barat; Dia memberi petunjuk kepada siapa yang dikehendakiNya ke jalan yang lurus,” maksudnya, apabila arah barat dan timur adalah milik Allah dan tidak ada satu arah pun yang keluar dari kekuasaan Allah, dan dengan ini Dia memberi petunjuk kepada siapa yang dikehendakiNya kepada jalan yang lurus, yang diantaranya adalah petunjukNya kepada kalian untuk menghadap ke kiblat tersebut yang merupakan arah bapak kalian Ibrahim, lalu untuk apa orang yang membantah itu melakukan bantahan tentang perpindahan kiblat kalian kepada arah yang termasuk bagian dari kekuasaan Allah? Dan kalian tidak menghadap sebuah arah yang bukan kekuasaan Allah. Dengan hujjah tersebut saja wajiblah ketundukan kepada perintahNya, lalu bagaimana pula bila hal itu adalah karunia Allah dan petunjukNya, serta kebaikanNya kepada kalian yang memberikan petunjuk kepada kalian menuju hal tersebut? Orang yang membantah kalian berarti dia telah membantah karunia Allah, karena dengki dan zhalim terhadap kalian. Dan ketika Firman Allah, “Dia memberi petunjuk kepada siapa yang dikehendakiNya ke jalan yang lurus” bersifat mutlak, sedangkan sesuatu yang tidak terbatas itu harus dimaknai dengan hal yang telah membatasinya, maka hidayah dan kesesatan itu memiliki sebab-sebab yang telah menjadi suatu keharusan dari hikmah Allah dan keadilanNya, dan sesungguhnya Allah telah mengabarkan dalam ayat lain tentang sebab-sebab hidayah, yang mana apabila seorang hamba melakukan sebab-sebab itu, niscaya dia akan memperoleh hidayah, sebagaimana Allah berfirman : \" Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridhaan-Nya ke jalan keselamatan, dan (dengan kitab itu pula) Allah mengeluarkan orang-orang itu dari gelap gulita kepada cahaya yang terang benderang dengan seizin-Nya, dan menunjuki mereka ke jalan yang lurus.\" QS Al-Maidah: 16. Dalam ayat ini Allah menyebutkan suatu sebab yang mengakibatkan umat ini memperoleh hidayah secara mutlak dengan segala bentuk hidayah, dan Allah menganugerahkannya bagi mereka, Allah berfirman, 143. “Dan demikian pula Kami telah menjadikan kamu (umat islam), umat pertengahan,” yakni tegak dan terpilih, sedangkan yang selain pertengahan adalah ujung dan pinggir yang tergolong dalam mara bahaya; Allah menjadikan umat in sebagai pertengahan dalam segala perkara agama. Pertengahan terhadap para Nabi diantara orang-orang yang melampaui batas terhadap mereka seperti Nasrani dengan orang-orang yang berpaling dari mereka seperti Yahudi, yaitu dengan beriman kepada mereka seluruhnya dengan cara yang benar. Pertengahan dalam syariat, tidak seperti sikap berlebih-lebihannya orang-orang Yahudi dan kesalahan-kesalahan mereka, tidak pula seperti tindakan asal-asalan orang-orang Nasrani. Dalam hal bersuci dan makanan, tidak seperti Yahudi yang (menurut mereka) suatu shalat tidak akan sah kecuali dalam tempat ibadah dan biara-biara mereka, tidak pula air menyucikan mereka dari najis-najis, dan sesungguhnya telah diharamkan atas mereka makanan yang baik sebagai suatu hukuman bagi mereka. Tidak pula seperti Nasrani yang sama sekali tidak menganggap sesuatupun sebagai najis, dan tidak pula mengharamkan sesuatu pun, akan tetapi mereka membolehkan segala yang berjalan maupun yang merangkak, sedang kesucian kaum Muslimin adalah kesucian paling sempurna dan paling lengkap. Allah ta'ala menghalalkan bagi mereka segala yang baik dari berbagai macam makanan, minuman, dan pakaian, serta mengharamkan bagi mereka segala yang buruk dari itu semua. Umat ini memiliki agama paling sempura, akhlak paling mulia, dan amalan-amalan paling utama. Allah ta'ala telah mengaruniakan kepada mereka ilmu, keramahan, keadilan, kebaikan perbuatan yang tidak Allah karuniaka kepada umat-umat sebelumnya selain mereka. Oleh karena itu, mereka adalah “umat yang pertengahan” yang sempurna lagi seimbang, agar mereka menjadi “saksi atas perbuatan manusia” karena keadilan dan keputusam mereka yang adil, dimana mereka menghukumi seluruh manusia dari segala macam pemeluk agama dan tidak ada yang menghukum semua itu selain dari mereka; maka apa pun yang diterima oleh umat ini, niscaya itu di terima, dan apa pun yang ditolak, niscaya tertolak. Bila ditanyakan, “Bagaimana mungkin keputusan mereka atau manusia dapat diterima padahal setiap dari kedua belah pihak yang bersengketa tidak dapat menerima perkataan pihak yang lain? Dijawab: Tidak dapat diterimanya perkataan salah satu pihak dari kedua pihak yang bersengketa adalah karena adanya suatu tuduhan, adapun bila tidak ada tuduhan tertentu dan hanya ada keadilan yang sempurna, sebagaimana yang terdapat pada umat ini, maka yang sebenarnya dimaksudkan adalah berhukum dengan keadilan dan kebenaran, dan syarat semua itu adalah ilmu dan keadilan, sedangkan kedua hal itu terdapat pada umat ini yang pada akhirnya perkataannya dapat diterima. Apabila ada seseorang yang ragu tentang keutamaannya, lalu dia meminta seseorang yang dapat menguatkan keutamaannya, maka dia adalah Nabi mereka, Muhammad Saw sebaik-baik makhlukNya. Oleh karena itu Allah berfirman, “dan agar Rasul menjadi saksi atas perbuatan kamu,” Dan diantara kesaksian umat ini terhadap umat-umat yang lain adalah bahwasanya di Hari Kiamat Allah bertanya kepada para Rasul tentang dakwah mereka dan umat-umat yang mendustai dakwah tersebut, sedangkan mereka mengingkari bahwa para Rasul itu telah menyampaikan dakwah mereka, maka para Rasul itu meminta persaksian kepada umat ini yang akhirnya direkomendasikan oleh Nabi mereka. Dalam ayat ini terdapat dalil bahwa ijma’ umat ini merupakan suatu hujjah yang pasti kuat, dan bahwasanya mereka itu terlepas dari kesalahan dengan adanya kemutlakan Firman Allah “pertengahan.” Sekiranya kesepakatan mereka itu dimungkinkan terjadi kesalahan, niscaya tidak menjadi pertengahan kecuali hanya pada beberapa perkara saja. Dan firman Allah, “Agar kamu menjadi saksi atas perbuatan manusia” berkonsekuensi bahwa mereka bila bersaksi terhadap suatu hukum bahwa Allah telah menghalalkan dan mengharamkan, atau mewajibkan, maka mereka terlepas dari dosa dalam hal tersebut. Ayat ini juga menunjukan bahwa dalam berhukum, bersaksi, dan mengeluarkan fatwa atau semacamnya harus dengan syarat adil."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلسُّفَهَآءُ } as-Sufaha : Sufahaa bentuk jamak dari safiih yaitu orang yang memiliki kelemahan akal karena hanya bisa taqlid dan tidak mau menelitinya. Hal inilah yang menyebabkan kerusakan akhlak dan perilaku. { مَا وَلَّىٰهُمۡ } Maa wallahum : Hal yang merubah kiblat dari Baitul Maqdis ke Ka’bah di kota Mekah. { القبلة } al-Qiblat : Arah yang dituju oleh seseorang dan menjadi patokan seseorang ketika shalat. Makna ayat : Allah Ta’ala mengabarkan tentang suatu perkara yang diketahuiNya sebelum terjadi. Adapun hikmah pemberitahuan itu sebelum terjadinya adalah untuk meringankan pengaruh yang terjadi pada jiwa kaum mukminin, karena kritikan mereka yang pahit itu bila tidak terjadi secara mendadak maka tidak akan menggoyahkan hati kaum mukminin. Allah Ta’ala berfirman (سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ ) “Orang-orang yang kurang akalnya di antara manusia akan berkata,”Apakah yang memalingkan mereka (umat Islam) dari kiblatnya (Baitul Maqdis) yang dahulu mereka telah berkiblat kepadanya?” Hal ini benar-benar terjadi tatkala Allah Ta’ala merubah kiblat rasul dan umat Islam yaitu Baitul Maqdis menuju Ka’bah sebagai bentuk realisasi dari keinginan Rasulullah ﷺ, juga sebagai bentuk ujian yang dikandung oleh ayat setelahnya. Allah Ta’ala memberitahukan bahwa orang-orang yang kurang akalnya dari kalangan Yahudi dan Munafikin serta musyrikin akan memberikan komentar negatif, dan Allah mengajarkan umat Islam bagaimana cara membantah komentar mereka itu. Allah berfirman : “Katakanlah bahwa kepunyaan Allah lah timur dan barat. Dia memberi petunjuk kepada siapa saja yang dikehendakiNya menuju jalan yang lurus.” Tidak ada interupsi padaNya kemana mau menghadapkan hambaNya. Dan Dia menunjuki siapa saja yang dikehendakiNya kepada jalan yang lurus. Pelajaran dari ayat : • Bolehnya terjadi nasakh suatu hukum dalam Islam, dengan mengganti kiblat dari Baitul Maqdis menuju Ka’bah di Mekah al-Mukarramah. • Membuat berita dusta, dan menciptakan berbagai krisis dan teror adalah perbuatan orang Kafir semenjak dulu kepada kaum muslimin. Bagi orang mukmin hendaknya tetap tegar dan tidak terjatuh dalam kebimbangan menghadapinya sampai menjadi jelas antara kebenaran dan kebatilan, dan fitnah bisa berhenti."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 142: Allah mengabarkan bahwasannya orang-orang bodoh dari yahudi dan semisal dengan mereka berkata: kenapa Muhammad ﷺ meninggalkan berserta para sahabat kiblat mereka, yang mereka mengadap kesana yaitu baitul Maqdis yang kemudian mereka menghadap arah Ka’bah? ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Nabi Muhammad shallallahu 'alaihi wa sallam berada di Mekah di tengah-tengah kaum musyirikin, Beliau berkiblat ke Baitul Maqdis, tetapi setelah 16 atau 17 bulan berada di Madinah di tengah-tengah orang Yahudi dan Nasrani beliau disuruh oleh Allah untuk menghadap ke arah ka'bah sebagai kiblat, terutama sekali untuk memberi pengertian bahwa dalam ibadah shalat itu bukanlah arah Baitul Maqdis dan ka'bah itu menjadi tujuan, tetapi tujuannya untuk menghadapkan diri kepada Allah, menjalankankan perintah-Nya dan menjauhi larangan-Nya. Di antara hikmah adanya kiblat adalah untuk persatuan umat Islam. Ibnu Ishak meriwayatkan dari Al Barraa', ia berkata, \"Rasulullah shallallahu 'alaihi wa sallam shalat menghadap Baitulmaqdis dan sering menghadap ke langit menunggu perintah Allah, maka Allah menurunkan ayat, \"Qad naraa taqalluba wajhika fis samaa'…dst. lalu ada beberapa orang kaum muslimin yang berkata, \"Kami senang sekali, jika kami mengetahui keadaan orang-orang yang wafat sebelum kami menghadap ke kiblat, maka Allah menurunkan ayat, \"Wa maa kaanallahu liyudhii'a iimaanakum\". Kemudian orang-orang yang kurang akal di antara manusia berkata, \"Apakah yang memalingkan mereka (umat Islam) dari kiblat (Baitul Maqdis) yang dahulu mereka berkiblat kepadanya? Maka Allah menurunkan ayat, \"Sayaquulus sufahaa' minan naas..dst..\" Ayat di atas mengandung beberapa hal, di antaranya: mukjizat, hiburan bagi Nabi shallallahu 'alaihi wa sallam, penenteraman terhadap hati kaum mukmin, adanya tindakan I'tiradh (protes) serta jawabannya, sifat orang yang memprotes dan sifat orang yang tunduk menerima hukum Allah Ta'ala. Maksudnya: orang-orang yang kurang pikirannya sehingga tidak dapat memahami maksud dan hikmah pemindahan kiblat akan berkata seperti yang disebutkan di atas dengan nada mengolok-olok. Mereka disebut \"sufaha\" (kurang akal) karena tidak mengerti hal-hal yang bermaslahat terutama bagi diri mereka, mereka rela menjual keimanan dengan harga yang murah. Mereka yang akan berkata seperti ini adalah orang-orang Yahudi, Nasrani dan semisalnya, termasuk orang-orang yang suka memprotes hukum Allah dan syari'atnya seperti JIL (Jaringan Islam Liberal). Adapun orang-orang yang berakal dan cerdas -mereka adalah orang-orang mukmin- akan tunduk menerima hukum-hukum Tuhannya sebagaimana disebutkan dalam surat An Nisaa': 51: \"Sesungguhnya jawaban orang-orang mukmin, bila mereka dipanggil kepada Allah dan Rasul-Nya agar Rasul memutuskan perkara di antara mereka ialah ucapan. \"Kami mendengar dan kami ta'at\". Mereka Itulah orang-orang yang beruntung.\" Penyebutan \"sufaha\" untuk mereka sebenarnya terdapat bantahan terhadap perkataan mereka itu dan agar kita tidak menghiraukannya. Namun demikian, Allah Subhaanahu wa Ta'aala tidak membiarkan syubhat ucapan mereka itu, bahkan membantahnya agar tidak lagi terlintas di hati hamba-hamba-Nya yang mukmin sebagaimana disebutkan pada ayat di atas dan ayat setelahnya. Yakni mengapa mereka mengatakan seperti itu padahal milik Allah-lah timur dan barat, tidak ada satu arah yang keluar dari kepemilikan-Nya. Meskipun demikian, Dia tetap membimbing orang yang Dia kehendaki ke jalan yang lurus, di antaranya dengan menghadapkan arah kiblat ke Ka'bah, di mana hal ini termasuk ajaran Nabi Ibrahim 'alaihis salam. Hal ini pun menunjukkan lebih dekatnya Nabi Muhammad shallallahu 'alaihi wa sallam dan kaum mukmin dengan Nabi Ibrahim 'alaihis salam dibanding orang-orang Yahudi dan Nasrani."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 142",
    "description": "Setelah pada ayat yang lalu diceritakan perilaku kaum yahudi secara umum, pada ayat ini Allah menjelaskan sikap mereka dan juga orang musyrik terkait persoalan khusus, yaitu pengalihan kiblat salat dari baitulmakdis di palestina ke kakbah di mekah. Pada saat nabi berhijrah ke madinah, beliau dan para sahabatnya selama 16 sampai 17 bulan melaksanakan salat menghadap ke baitulmakdis. Pada rajab tahun ke-2 hijriah, Allah memerintahkan nabi untuk menghadap ke masjidilharam di mekah. Tentang hal ini Allah berfirman sebagai berikut. Orang-orang yang kurang akal di antara manusia, yakni sebagian orang yahudi dan kelompok lain, akan mengolok-olok nabi dan kaum mukmin dengan berkata, apakah yang memalingkan mereka, yakni kaum muslim, dari kiblat yang dahulu mereka berkiblat kepadanya' pemberitahuan awal ini dilakukan agar nabi dan orang-orang islam tidak kaget jika hal itu tejadi. Lalu Allah memerintahkan kepada nabi untuk menjawab mereka. Katakanlah, wahai rasul, milik Allah-lah timur dan barat. Allah berhak untuk menyuruh hamba-Nya menghadap ke arah mana saja, apakah ke arah timur atau barat, karena semua arah adalah milik Allah. Mereka yang beriman dengan benar akan mengikuti seluruh perintah Allah. Mereka itulah yang mendapat petunjuk dari Allah. Dia memberi petunjuk kepada siapa yang dia kehendaki ke jalan yang lurus. Allah yang paling mengetahui siapa yang pantas untuk mendapat petunjuk itu. Jika Allah menjadikan kakbah sebagai kiblat yang paling utama karena dibangun oleh bapak para nabi, yaitu nabi ibrahim, maka demikian pula kami telah menjadikan kamu, umat islam, umat pertengahan, yaitu umat terbaik yang pernah ada di bumi ini. Umat yang terbaik sangatlah pantas menjadi saksi. Tujuannya adalah agar kamu menjadi saksi atas perbuatan manusia, yaitu ketika nanti pada hari kiamat jika ada dari mereka yang mengingkari bahwa rasul-rasul mereka telah menyampaikan pesan-pesan Allah atau adanya penyimpangan pada ajaran mereka. Di samping itu, juga agar rasul, Muhammad, menjadi saksi atas perbuatan kamu yaitu dengan memberikan petunjuk dan arahan-arahannya ketika masih hidup serta jalan kehidupannya juga petunjuknya ketika sudah meninggal. Allah kemudian menjelaskan tujuan pengalihan kiblat, yaitu menguji keimanan seseorang. Kami tidak menjadikan kiblat yang dahulu kamu berkiblat kepadanya melainkan agar kami mengetahui siapa yang mengikuti rasul dan siapa yang berbalik ke belakang. Bagi mereka yang tetap istikamah dengan keimanannya, mereka akan mengikuti apa pun yang diperintahkan oleh Allah dan rasul-Nya, baik dalam pengalihan kiblat atau lainnya. Sebaliknya, bagi yang lain, mereka akan menolak dan enggan mengikuti perintah Allah dan rasul-Nya. Ihwal pemindahan kiblat memang mengundang persoalan bagi sebagian kelompok. Oleh karena itu, pemindahan kiblat itu sangat berat kecuali bagi orang yang telah diberi petunjuk oleh Allah. Sebagian kelompok menganggap persoalan kiblat adalah termasuk ajaran yang sudah baku, tidak bisa diubah lagi, seperti halnya tauhid. Namun, sebagian lagi, yaitu orang-orang yang istikamah dalam beriman, menganggap bahwa persoalan ini termasuk kebijakan Allah yang bisa saja berubah. Dan Allah tidak akan menyia-nyiakan imanmu. Sungguh, Allah maha pengasih, maha penyayang kepada manusia."
  }
]