[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana kami telah memberi kalian petunjuk - wahai kaum muslimin- menuju jalan yang lurus dalam agama kami, juga telah menjadikan kalian umat pilihan terbaik dan adil. supaya kalian kelak di akhirat memberikan persaksian di hadapan umat-umat lain bahwa para rasul mereka telah menyampaikan risalah Allah kepada mereka, dan begitu juga Rasulullah Shalallahu Wassalam akan menjadi saksi atas kalian di akhirat kelak bahwa dia telah menyampaikan risalah Tuhannya. Dan kami tidaklah menjadikan -wahai Rasul- kiblat Baitul Maqdis yang dahulu engkau menghadapnya, lalu kami memalingkan engkau darinya menuju Ka'bah (di Mekkah), kecuali demi menampakkan apa yang telah kami ketahui sejak permulaan (azali). Pengetahuan yang berhubungan dengan pahala dan siksaan, supaya kami bisa membedakan siapa-siapa saja yang mengikuti dan taat kepadamu serta menghadap ke arah yang sama denganmu ke arah mana pun kamu menghadap, dan siapa saja orang-orang yang lemah imannya sehingga berbalik menjadi murtad meninggalkan agama Islam gara-gara keragu-raguan dan kemunafikannya. Sesungguhnya kejadian ini yang mengalihkan arah dari Baitul Maqdis menuju Ka'bah, betul-betul berat lagi sulit, kecuali bagi orang-orang yang Allah beri hidayah dan Allah anugerahkan iman dan taqwa kepada mereka. Dan Allah benar-benar tidak akan menyia-nyiakan keimanan kalian kepada Nya dan ittiba' kalian kepada rasul Nya, serta tidak membatalkan pahala shalat kalian yang menghadap kiblat sebelumnya. Sesungguhnya Allah ta'ala Maha Pengasih lagi Maha penyayang kepada manusia dengan rahmat yang luas di dunia dan Akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Sebagaimana Kami telah memberi kalian kiblat yang Kami ridai untuk kalian, Kami pun telah menjadikan kalian sebagai umat terbaik, adil dan moderat di antara umat-umat lainnya, baik dalam hal akidah, ibadah maupun muamalah, supaya kalian kelak pada hari kiamat menjadi saksi bagi para utusan Allah bahwa mereka telah menyampaikan apa yang Allah perintahkan kepada mereka untuk disampaikan kepada umat mereka. Dan juga supaya Rasulullah Muhammad -ṣallallāhu 'alaihi wa sallam- menjadi saksi atas kalian bahwa dia telah menyampaikan kepada kalian apa yang harus dia sampaikan. Dan tidaklah Kami menjadikan pengalihan kiblatmu yang pertama (Baitul Maqdis) itu kecuali supaya Kami mengetahui secara nyata balasan apa yang akan diterima oleh orang yang mau menerima ketentuan Allah secara sukarela dan tunduk kepada-Nya, kemudian mengikuti Rasulullah. Dan juga supaya Kami mengetahui siapa yang murtad dari agamanya dan mengikuti hawa nafsunya, sehingga tidak mau tunduk kepada ketentuan Allah. Peristiwa pengalihan dari kiblat yang pertama ini terasa sangat berat kecuali bagi orang-orang yang mendapat bimbingan dari Allah untuk beriman kepada-Nya dan percaya bahwa apapun yang ditetapkan Allah bagi hamba-hamba-Nya pasti didasari oleh hikmah-hikmah tertentu yang sangat bijaksana. Dan Allah tidak akan menyia-nyiakan iman kalian kepada-Nya, termasuk salat yang kalian lakukan sebelum pengalihan kiblat. Sesungguhnya Allah Maha Penyantun lagi Maha Penyayang, Dia tidak akan memberatkan mereka dan tidak akan menyia-nyiakan pahala amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "143. Allah memuji kaum muslimin: “Sebagaimana Kami telah memberi kalian petunjuk kepada agama Islam, Kami juga menjadikan kalian umat pertengahan, agar kalian menjadi saksi atas umat-umat yang lain di akhirat bahwa rasul-rasul mereka telah menyampaikan dakwah kepada mereka; dan Rasulullah Muhammad akan menjadi saksi atas kalian bahwa dia telah menyampaikan kepada kalian risalah yang dibebankan kepadanya. Dan Kami tidak menjadikan perpindahan kiblat ini kecuali sebagai ujian, agar nampak siapa yang mentaati Rasul dan siapa yang ragu dalam beragama serta keluar dari Islam. Dan perkara perpindahan kiblat ini sungguh berat kecuali bagi orang-orang yang mendapat hidayah dari Allah sehingga menjadi mudah bagi mereka.” Dan Allah tidak akan menghilangkan pahala shalat kalian ketika masih menghadap ke Baitul Maqdis, namun Dia akan menerima shalat itu dan membalasnya, sebab Allah Maha Lembut dan Maha Penyayang kepada hamba-hamba-Nya. Dari Abu Sa’id al-Khudri ia berkata, Rasulullah bersabda: “Nabi Nuh akan dipanggil pada hari kiamat, lalu dia menjawab: “Aku menjawab panggilan-Mu Wahai Tuhanku.” Maka Allah bertanya: “Apakah kamu telah menyampaikan risalah?” Nuh Menjawab: “Sudah”. Maka umatnya akan ditanya: “Apakah Nuh telah menyampaikan risalah kepada kalian?” Mereka menjawab: “Tidak ada seorangpun yang datang kepada kami memberi peringatan.” Maka Allah berfirman kepada Nuh: “Siapa yang akan menjadi saksimu?” Nuh menjawab: “Muhammad dan umatnya.” Maka Nabi Muhammad dan umatnya bersaksi bahwa Nabi Nuh telah menyampaikan risalah kepada umatnya. Kemudian Nabi Muhammad akan menjadi saksi atas kalian. Itulah maksud dari firman Allah: وَكَذَٰلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِّتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا (Shahih Bukhari 8/141 no. 4487, Tafsir surat al-Baqarah, Bab (وكذلك جعلناكم أمة وسطا))."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. وَسَطًا (umat pertengahan) Yakni umat pilihan dan pertengahan. لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ (agar kamu menjadi saksi atas (perbuatan) manusia) Yakni di hari kiamat kalian akan menjadi saksi untuk para Nabi atas umat mereka bahwa Nabi-Nabi itu telah menyampaikan apa yang Allah perintahkan untuk disampaikan kepada umat mereka. وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا ۗ (dan agar Rasul (Muhammad) menjadi saksi atas (perbuatan) kamu) Yakni bersaksi atas kalian bahwa Beliau telah menyampaikan kepada mereka. Dalam hadist yang dikeluarkan Imam Bukhari dari Abu Sa’id, dia berkata: Rasulullah bersabda: Nabi Nuh akan dipanggil di hari kiamat, kemudian dikatakan kepadanya: Apakah kamu telah menyampaikan risalah? Dia pun menjawab: Iya. Lalu dipanggil-lah umatnya dan dikatakan kepada mereka: apakah Nuh telah menyampaikan kepada mereka? Mereka pun menjawab: tidak ada peringatan yang datang kepada kami, dan tidak ada satupun yang datang memperingatkan kami. Lalu Nabi Nuh ditanya: siapa yang akan bersaksi untukmu? Dia pun menjawab: Muhammad dan umatnya yang akan bersaksi. وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنْتَ عَلَيْهَا (Dan Kami tidak menetapkan kiblat yang menjadi kiblatmu) Yakni Baitul Maqdis. إِلَّا لِنَعْلَمَ (melainkan agar Kami mengetahui) Yakni Kami tidak menjadikan kiblat itu bagi kalian kecuali untuk menguji kalian agar Kami mengetahui siapa mukmin yang taat dan siapa yang murtad dan kafir. وَإِنْ كَانَتْ لَكَبِيرَةً (Dan sungguh itu terasa amat berat) Yakni masalah pemindahan kiblat ini sangat menyusahkan dan menguji iman; kecuali bagi orang-orang yang diberi petunjuk oleh Allah menuju kebenaran maka dada mereka lapang dalam membenarkanmu (Muhammad) وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ ۚ (dan Allah tidak akan menyia-nyiakan imanmu) Potongan ayat ini diturunkan untuk menjelaskan nasib dari orang yang meninggal ketika dia masih sholat menghadap Baitul Maqdis (sebelum pemindahan kiblat). Pendapat lain mengatakan yang dimaksud adalah Allah tidak akan menyia-nyiakan pahala keteguhan orang-orang mukmin diatas keimanan pada kejadian pemindahan kiblat. لَرَءُوفٌ ((Sesungguhnya Allah) Maha Pengasih) Yakni memiliki banyak sifat kelembutan. Dan ini adalah kasihsayang yang paling tinggi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kemajuan hakikatnya menjadi keistimewaan bagi orang-orang yang berpegang teguh pada ajaran islam, dan keterbelakangan adalah keburukan bagi mereka yang berpaling dari islam, Allah berfirman : { وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنْتَ عَلَيْهَا إِلَّا لِنَعْلَمَ مَنْ يَتَّبِعُ الرَّسُولَ مِمَّنْ يَنْقَلِبُ عَلَىٰ عَقِبَيْهِ } sesungguhnya ini adalah bukti keterbelakangan dari petunjuk, karena barangsiapa yang membelot dari ajaran Rasulullah hakikatnya dia tidak melihat apa yang terjadi dibelakangnya; dan barangsiapa yang mengatakan kepada orang-orang yang berpegang teguh dengan kitab Allah dan Rasul-Nya bahwa mereka adalah orang yang terbelakang, maka kita katakan kepada mereka : kamu lah sesungguhnya orang orang yang terbelakang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143. Sebagaimana menunjukkan kalian kepada Islam dan qiblatnya Ibrahim AS, Kami jadikan kalian umat terpilih, adil dan tengah-tengah supaya kalian bisa bersaksi atas semua manusia pada hari kiamat bahwa nabi-nabi mereka telah menyampaikan risalah Allah kepada mereka. Dan Rasulullah Muhammad SAW akan menjadi saksi atas kalian bahwa beliau telah menyampaikan risalah kepada kalian. Dan tidaklah Kami jadikan kiblat Baitul Maqdis yang kamu gunakan untuk qiblat ketika shalat itu kecuali sebagai ujian supaya Kami mengetahui dengan jelas dan untuk membuktikan mana yang mukmin, murtad, dan munafik. Dan jika perubahan kiblat itu itu sulit dan menyakitkan, maka keyakinan terhadap kiblat itu pun akan sulit kecuali orang-orang yang diberi hidayah oleh Allah kepada kebenaran. Tidaklah Allah itu menghilangkan shalat kalian menghadap Baitul Maqdis, melainkan mengubah arahnya. Sesungguhnya Allah itu Dzat yang sangat banyak ra’fahNya (yaitu kasih sangat paling dahsyat) bagi hamba-hambaNya dan Maha Penyayang kepada mereka. Ayat ini turun untuk orang yang mati, sedangkan dia sedang shalat menghadap Baitul Maqdis. Disebutkan dalam Shahih Bukhari dan Muslim dari Al-Bara’ bahwa Dia mati saat menghadap kiblat sebelum orang-orang berubah kiblatnya, sehingga kami tidak tahu apa yang mereka bicarakan. Lalu turunlah ayat {Wa maa kaanallahu liyudhi’a iimaanakum}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian pula Kami telah menjadikan kalian umat pertengahan} yang adil dan pilihan {agar kalian menjadi saksi atas manusia dan agar Rasul (nabi Muhammad) menjadi saksi atas kalian. Kami tidak menetapkan kiblat yang dahulu kalian berkiblat kepadanya, kecuali agar Kami mengetahui siapa saja yang mengikuti Rasul dan siapa saja yang berbalik ke belakang} menolak agamanya {Sesungguhnya itu} Sesunggugnya perkara mengubah arah kiblat itu {sangat besar} sangat berat dan sulit {kecuali bagi orang-orang yang telah diberi petunjuk oleh Allah. Allah tidak akan menyia-nyiakan iman kalian} membatalkan pahala shalat kalian yang menghadap Baitul Maqdis {Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang kepada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143. Allah taala berfirman, “Dan Kami tidak menetapkan kiblat yang menjadi kiblatmu (dahulu),” yaitu menghadap Baitul Maqdis pertama-tama, “melainkan agar Kami mengetahui” yakni, pengetahuan yang berkaitan dengan ganjaran maupun hukuman, karena sesungguhnya Allah itu Maha Mengetahui segla perkara sebelum terjadinya. Akan tetapi pengetahuan itu tidak Dia kaitkan dengan ganjaran dan tidak pula hukuman karena kesempurnaan keadilanNya dan penegakan hujjah terhadap hamba-hambaNya. Akan tetapi apabila amal-amal meraka telah ada, itulah yang mengakibatkan ganjaran atau hukuman. Artinya, Kami mensyariatkan perpindahan kiblat itu agar Kami mengetahui dan menguji, “siapa yang mengikuti Rasul” beriman kepadanya dengan mengikutinya dalam segala kondisi, karena dia adalah seorang hamba yang diperintah dan dibimbing, dan karena kitab-kitab terdahulu telah mengabarkan bahwa sanya dia menghadap Ka’bah. Maka orang yang memandang secara adil yang hanya mencari kebenaranlah yang akan membuat iman dan ketaatannya kepada Rasul bertambah. Adapun orang yang membelot, berpaling dari kebenaran, dan mengikuti hawa nafsunya, maka hal itu akan menambah kekufuran baginya di atas kekufurannya dan kebingungan diatas kebingungannya, dan dia mengemukakan hujjah batil yang didasari oleh syubhat yang tidak ada hakikatnya sama sekali. “Dan sungguh perpindahan kiblat itu,” yakni pengalihanmu darinya, “terasa amat berat,” maksudnya sangat sulit, “kecuali bagi orang-orang yang telah diberi petunjuk oleh Allah,” sehingga mereka mengetahui nikmat Allah atas mereka dalam hal teersebut lalu mereka bersyukur dan mengakui kebaikanNya dalam memberikan perintah untuk menghadapkan wajah ke Ka’bah, yang telah Dia muliakan atas tempat-tempat di seluruh bumi, dan menuju kepadanya (untuk haji) adalah salah satu di antara rukun-rukun Islam serta sebagai penggugur dosa dan kesalahan. Oleh kaena itulah hal tersebut terasa ringan bagi mereka, dan terasa berat bagi selain mereka. Kemudian Allah berfirman, “Dan Allah tidak akan menyia-nyiakan imanmu,” maksudnya tidaklah patut dan tidaklah pantas bagiNya, bahkan hal itu merupakan perkara yang tidak mungkin dilakukanNya. Allah mengabarkan bahwa hal itu tidak mungkin dilakukanNya dan sangat mustahil Dia menyia-nyiakan keimanan kalian. Dalam hal ini ada sebuah kabar gembira bagi orang yang telah dikaruniakan keimanan dan keislaman oleh Allah, yaitu bahwa Allah akan menjaga keimanan mereka dan tidak menyia-nyiakan. Penjagaan Allah itu ada dua macam. Pertama: Penjagaan dari kesia-siaan dan kehilangan, dengan pelindunganNya dari segala hal yang dapat merusak, menghapus, dan menguranginya, berupa ujian-ujian yang menggoncangkan dan hawa nafsu yang menghalangi. Kedua: Penjagaan dengan menumbuhkannya untuk mereka dan memberikan taufik terhadap mereka kepada perkara yang dapat menambah keimanan dan menguatkan keyakinan mereka, dan sebagaimana Allah memulai dengan memberikan hidayahNya untuk kalian kepada keimanan, maka begitu pula Allah akan menjaga keimanan itu bagi kalian dan akan menyempurnakan nikmatNya dengan menumbuhkannya dan memperbanyak ganjaran dan balasan, serta memeliharanya dari segala hal yang mengotorinya. Bahkan bila ujian-ujian yang dimaksudkan darinya terjadi, hal itu akan menampakkan Mukmin yang hakiki dari Mukmin yang bohongan, dan menyaring kaum Mukminin dan menampakkan kejujuran mereka, seolah-olah merupakan seikap kewaspadaan dari suatu dugaan yang muncul dari firman Allah, “Dan Kami tidak menetapkan kiblat yang menjadi kiblatmu (sekarang) melainkan agar Kami mengetahui (supaya nyata) siapa yang mengikuti Rasul dan siapa yang membelot,” yang terkadang menjadi penyebab bagi sebagian kaum Mukminin untuk meninggalkan keimanan mereka, maka untuk mmbantah dugaan seperti itu, Allah berfirman, “Dan Allah tidak akan menyia-nyiakan imanmu,” dengan pertimbanganNya atas ujian-ujian itu atau yang selainnya. Dan termasuk dalam hal itu juga adalah orang yang meninggal dari kaum Muslimin sebelum peralihan kiblat ke Ka’bah, sesungguhnya Allah tidak akan menyia-nyiakan keimanan mereka, karena mereka adalah orang-orang yang menunaikan perintah-perintah Allah dan menaati Rasulullah pada waktunya, dan taat kepada Allah dengan menunaikan perintahNya pada setiap waktu sesuai dengan hal tersebut. Ayat ini merupakan dalil bagi Ahlus Sunnah wal Jamaah bahwa perbuatan-perbuatan anggota tubuh termasuk ke dalam iman. Firmannya, “Sesungguhnya Allah Maha Pengasih lagi Maha Penyayang kepada manusia,” maksudnya, rahmat yang sangat banyak atas mereka, karena diantara bentuk kasih sayang dan rahmatNya terhadap mereka adalah dengan menyempurnakan nikmatNya yang telah Dia anugerahkan kepada mereka dan Dia bedakan dari mereka orang yang beriman dengan lisannya saja tanpa hatinya, dan Dia menguji mereka dengan ujian yang membuat keimanan mereka bertambah dan derajat mereka meningkat, serta membimbing mereka kepada rumah yang paling mulia dan paling agung."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أُمَّةٗ وَسَطٗا } Ummatan Wasathan : Pertengahan sesuatu adalah hal yang terbaik. Yang dimaksud adalah bahwa umat Nabi Muhammad ﷺ adalah umat yang pertengahan dan paling baik. { يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ } Yanqolibu ‘ala ‘aqibaih : Kembali kepada kekufuran setelah merasakan hidayah iman. { لَكَبِيرَةً } Lakabiirah : Berat bagi jiwa untuk menerimanya, karena membutuhkan usaha yang besar untuk merubah kiblat dari yang sudah terbiasa menuju kiblat yang baru. { إِيمَٰنَكُمۡۚ } Imaanakum : Shalat yang kalian lakukan menghadap Baitul Maqdis sebelum dirubah menghadap Ka’bah. { رَءُوفٞ رَّحِيمٞ } Raufun rahiim : Maha Penyayang dengan mencegah bahaya yang menimpa kalian dan memberikan kebaikan yang melimpah untuk kalian. Makna ayat : Pada ayat (143) Allah Ta’ala mengatakan (وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا ) “Dan begitulah kami menjadikan kalian sebagai umat pertengahan.” Yaitu umat terbaik dan pilihan. Maknanya, sebagaimana kami berikan petunjuk kalian kepada kiblat yang terbaik yaitu Ka’bah sebagai kiblatnya Nabi Ibrahim ‘alahissalam, kami jadikan kalian juga sebagai umat terbaik dan yang paling lurus. Kami persiapkan kalian dengan hal itu untuk menjadi saksi bagi umat yang lain pada hari kiamat nanti, karena umat-umat lain itu mengingkari bahwa rasul-rasulnya telah menyampaikan risalah dari Allah, dan untuk kalian yang akan menjadi saksi adalah rasul kalian sendiri. Ini adalah bentuk penghormatan dan kenikmatan hanya Allah Ta’ala yang mengetahuinya. Kemudian Allah Ta’ala menyebutkan alasan pergantian kiblat dalam firmanNya,”Kami jadikan bagi kalian kiblat yang baru agar diketahui siapa saja yang mengikuti rasul.” Akan menjadi kuat dan tetap keimanan, ketaatan, ketundukan orang tersebut kepada Allah dan rasulNya karena tidak terpengaruh omongan orang-orang yang kurang akalnya. Sedangkan orang yang terpengaruh omongan itu hatinya akan terombang ambing dalam kebimbangan dan binasa karena murtad bersama mereka. Kemudian Allah Ta’ala memberitahukan jikan perubahan kiblat dari Baitul Maqdis ke Ka’bah berat diterima oleh jiwa, kecuali orang-orang yang diberikan petunjuk oleh Allah untuk mengetahui rahasianya, mengetahui hal-hal yang disukai dan dibenci oleh Allah Ta’ala. Oleh karena itu mereka tidak mendapatkan kesulitan sedikitpun untuk berubah dair ketaatan yang satu kepada ketaatan yang lain, dan dari kiblat yang satu menuju kiblat yang lain. Selama Rabbnya mencintai itu dan memerintahkannya. Terakhir, Allah Ta’ala menenangkan jiwa mereka dengan pahala shalat mereka yang telah dilakukan menghadap Baitul Maqdis sekitar 17 bulan lamanya. Allah tidak akan menyia-nyiakan pahala shalat mereka dan akan membalasnya dengan sempurna baik bagi orang yang telah meninggal yang selama hidupnya shalat menghadap Baitul Maqdis, atau bagi oragn yang hidup sampai mendapat shalat menghadap Ka’bah. Inilah bentuk kasih sayang dan rahmat Allah kepada hamba-hambaNya. Pelajaran dari ayat : • Keutamaan umat Islam dibandingkan umat-umat yang lain, karena umat Islam adalah umat pertengahan dan pertengahan adalah syiarnya. • Kebolehan untuk menguji seorang mukmin dan memberikan penilaian baginya. • Sahnya shalat orang yang tidak menghadap kiblat apabila tidak mengetahuinya, dan dia mendapatkan pahala tanpa perlu mengulangi shalatnya. Walaupun telah shalat selama berbulan-bulan menghadap selain kiblat, selama itu merupakan hasil ijtihad untuk mengetahui arah kiblat dan shalat sesuai hasil ijtihadnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 143: Allah mengajarkan bahwasannya Ia meberikan hidayah kepada kalian wahai orang-orang yang beriman kepada agama islam dan kepada kiblat bapak kalian Ibrahim, begitu juga menjadikan kalian adil dalam memilih tidak menyepelekan serta berlebihan; sebagai saksi atas kalian bagi umat-umat dihari kiamat yang bahwasannya para utusan telah menyampaikan kerisalahan Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Umat Islam dijadikan umat pertengahan, yakni umat yang adil dan pilihan, karena mereka akan menjadi saksi atas perbuatan orang yang menyimpang dari kebenaran baik di dunia maupun di akhirat dan akan bersaksi di akhirat bahwa para rasul telah menyampaikan risalah kepada kaumnya, sebagaimana Nabi kita Muhammad shallallahu 'alaihi wa sallam akan menjadi saksi terhadap umatnya, bahwa Beliau telah menyampaikan riasalahnya. Umat Islam adalah umat pertengahan, mereka pertengahan dalam masalah agama antara orang-orang yang ghuluw (berlebihan) dan orang-orang yang meremehkan. Contoh pertengahan umat Islam adalah mereka tidak seperti orang-orang Nasrani yang berlebihan kepada nabi mereka sampai menuhankannya, dan tidak seperti orang-orang Yahudi yang bersikap kasar kepada nabi-nabi mereka. Umat Islam beriman kepada semua nabi dan tidak membeda-bedakannya dalam beriman. Mereka juga diberikan beberapa kelebihan, di antaranya: - Bumi seluruhnya dijadikan masjid selain kuburan dan kamar mandi, sedangkan orang-orang ahli kitab hanya boleh shalat di biara dan gereja mereka saja. - Dihalalkan untuk umat Islam yang baik-baik dan diharamkan yang kotor, sedangkan kepada orang-orang yahudi diharamkan beberapa hal yang baik sebagai hukuman untuk mereka, adapun orang-orang Nasrani tidak menajiskan sesuatu, tidak mengharamkan sesuatu bahkan menghalalkan semua hewan yang merangkak tanpa pengecualian. - Dihalalkan untuk umat Islam ghanimah - Dll. Umat Islam diberikan agama yang paling sempurna, akhlak yang paling mulia dan amal yang paling utama. Allah Subhaanahu wa Ta'aala memberikan kepada mereka ilmu, hilm (santun), adil dan ihsan yang tidak diberikan kepada umat selainnya. Oleh karena itu, mereka adalah umat yang adil dan pilihan agar mereka menjadi saksi bagi manusia karena keadilan, mereka menghukumi manusia tidak dihukumi dan oleh karenanya kesepakatan mereka juga maqbul (diterima). Di antara persaksian umat Nabi Muhammad shallallahu 'alaihi wa sallam terhadap umat yang lain adalah ketika di hari kiamat, saat Allah Subhaanahu wa Ta'aala bertanya kepada para rasul tentang tugas mereka menyampaikan risalah, sedangkan kaum mereka mengaku belum pernah didatangi oleh rasul, maka para nabi mengangkat umat Islam sebagai saksi terhadap mereka bahwa mereka telah menyampaikan risalahnya. Pada ayat ini juga terdapat dalil bahwa ijma' umat ini adalah hujjah dan ma'shum berdasarkan firman-Nya \"wasathaa\" dan berdasarkan firman-Nya juga \"litakuunuu syuhadaa'a 'alan naas\". Mengetahui di sini karena terkait dengan pahala dan siksa, yakni agar jelas asalannya mengapa orang ini berhak diberi pahala dan mengapa orang itu berhak disiksa, meskipun Allah Subhaanahu wa Ta'aala sudah mengetahui segala perkara sebelum terwujudnya. Hal ini menunjukkan keadilan-Nya dan penegakkan hujjah terhadap hamba-hamba-Nya. Allah Subhaanahu wa Ta'aala tidaklah mensyari'atkan menghadap ke Baitul Maqdis melainkan agar diketahui dan diuji-Nya siapa yang mengikuti Rasulullah shallallahu 'alaihi wa sallam, beriman kepadanya dan mengikuti Beliau dalam semua keadaan dengan orang yang malah berbalik. Di samping itu, Beliau adalah seorang hamba yang diperintah Allah dan diatur, dan lagi kitab-kitab terdahulu pun mengabarkan bahwa ia akan menghadap ke Ka'bah. Oleh karena itu orang yang sadar, di mana tujuannya adalah mengejar yang hak akan bertambah iman dan keta'atannya kepada Rasulullah shallallahu 'alaihi wa sallam. Sebaliknya, orang yang malah berbalik, berpaling dari kebenaran dan mengikuti hawa nafsunya, maka ia akan bertambah kufur dan kufur, bingung dan bertambah bingung, termakan oleh hujjah yang batil yang didasari syubhat dan tidak ada hakikatnya. Mereka adalah orang-orang yang mengenal nikmat Allah, bersyukur dan mengakui ihsan-Nya yang menjadikan mereka menghadap ke rumah yang agung itu; rumah yang diutamakan-Nya di atas semua dataran bumi, dijadikan-Nya pergi ke rumah itu sebagai salah satu rukun Islam yang dapat menghapuskan dosa dan kesalahan. Oleh karena itu, bagi mereka hal ini terasa ringan dan mudah. Imam Bukhari meriwayatkan dalam bagian tafsir juz 9 hal. 237 dari Al Barra' radhiyallahu 'anhu, bahwa Nabi shallallahu 'alaihi wa sallam shalat menghadap Baitulmaqdis selama 16 atau 17 bulan. Beliau ingin sekali kiblatnya menghadap ke Baitullah (di Mekah). Pernah suatu ketika, Beliau melakukan shalat atau melakukan shalat Ashar menghadap Baitullah, dan ikut pula bersama Beliau beberapa orang sahabat, lalu seseorang yang ikut shalat bersama Beliau pergi setelah shalat dan melewati orang-orang yang berada di masjid yang ketika itu sedang ruku, maka ia berkata, \"Aku bersaksi dengan nama Allah, sungguh aku telah shalat bersama Nabi shallallahu 'alaihi wa sallam menghadap ke Mekah\", maka mereka pun berputar (menghadap ke Mekah) sebagaimana mereka menghadap ke Baitulmaqdis. Di antara mereka ada beberapa orang yang meninggal terbunuh ketika kiblat belum dirubah, kami tidak mengetahui apa yang harus kami ucapkan terhadap mereka itu, maka Allah menurunkan ayat, \"Wa maa kaanallahu liyudhii'a iimaanakum...dst.\" (Al Haafizh dalam Al Fat-h juz 1 hal. 104 berkata, \"Penyusun (Imam Bukhari) dalam bagian tafsir menyebutkan dari jalan Ats Tsauri dari Abu Ishaq, \"Bahwa aku mendengar Al Barra', sehingga menjadi amanlah dari tadlis yang dilakukan Abu Ishaq). Imam Tirmidzi meriwayatkan dari Simak dari Ikrimah dari Ibnu Abbas ia berkata, \"Ketika Nabi shallallahu 'alaihi wa sallam menghadap ke Ka'bah, para sahabat berkata, \"Wahai Rasulullah! Bagaimana keadaan saudara-saudara kita yang meninggal dalam keadaan masih shalat menghadap Baitulmaqdis?\" Maka Allah menurunkan ayat, \"Wa maa kaanallahu liyudhii'a iimaanakum...dst.\" (Imam Tirmidzi berkata, \"Hadits ini hasan shahih\", dan dalam periwayatan Simak dari Ikrimah terdapat idhthirab (kegoncangan), akan tetapi hadits ini memiliki syahid (penguat), yaitu hadits sebelumnya). Yakni shalatmu yang dahulu menghadap ke Baitul Maqdis. Dalam ayat ini terdapat dalil bagi Ahlussunnah bahwa amal termasuk bagian dari iman, karena shalat disebut dengan iman. Dalam ayat ini terdapat berita gembira kepada orang-orang yang diberi nikmat oleh Allah dengan Islam dan iman, yakni Allah Subhaanahu wa Ta'aala akan menjaga iman mereka dan tidak akan menyia-nyiakannya. Penjagaan-Nya terhadap iman, bisa berupa penjagaan-Nya agar tidak hilang dan batal dengan cara menjaganya dari semua yang bisa merusak, menghilangkan dan mengurangi berupa cobaan-cobaan yang menghanyutkan dan hawa nafsu yang biasa menghalangi. Demikian juga bisa berupa pengembangan-Nya kepada iman itu, memberinya taufiq kepada hal yang dapat menambah iman mereka dan menguatkan keyakinan mereka. Firman-Nya \"dan Allah tidak akan menyia-nyiakan imanmu\" seakan-akan untuk menjaga anggapan-anggapan yang timbul dari firman-Nya \"Kami tidak menjadikan kiblat yang (dahulu) kamu berkiblat kepadanya melainkan agar Kami mengetahui siapa yang mengikuti Rasul dan siapa yang berbalik ke belakang\" bahwa hal itu bisa menjadi sebab sebagian kaum mukmin meninggalkan imannya, maka anggapan ini ditolak dengan firman-Nya \"dan Allah tidak akan menyia-nyiakan imanmu\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 143",
    "description": "Jika Allah menjadikan kakbah sebagai kiblat yang paling utama karena dibangun oleh bapak para nabi, yaitu nabi ibrahim, maka demikian pula kami telah menjadikan kamu, umat islam, umat pertengahan, yaitu umat terbaik yang pernah ada di bumi ini. Umat yang terbaik sangatlah pantas menjadi saksi. Tujuannya adalah agar kamu menjadi saksi atas perbuatan manusia, yaitu ketika nanti pada hari kiamat jika ada dari mereka yang mengingkari bahwa rasul-rasul mereka telah menyampaikan pesan-pesan Allah atau adanya penyimpangan pada ajaran mereka. Di samping itu, juga agar rasul, Muhammad, menjadi saksi atas perbuatan kamu yaitu dengan memberikan petunjuk dan arahan-arahannya ketika masih hidup serta jalan kehidupannya juga petunjuknya ketika sudah meninggal. Allah kemudian menjelaskan tujuan pengalihan kiblat, yaitu menguji keimanan seseorang. Kami tidak menjadikan kiblat yang dahulu kamu berkiblat kepadanya melainkan agar kami mengetahui siapa yang mengikuti rasul dan siapa yang berbalik ke belakang. Bagi mereka yang tetap istikamah dengan keimanannya, mereka akan mengikuti apa pun yang diperintahkan oleh Allah dan rasul-Nya, baik dalam pengalihan kiblat atau lainnya. Sebaliknya, bagi yang lain, mereka akan menolak dan enggan mengikuti perintah Allah dan rasul-Nya. Ihwal pemindahan kiblat memang mengundang persoalan bagi sebagian kelompok. Oleh karena itu, pemindahan kiblat itu sangat berat kecuali bagi orang yang telah diberi petunjuk oleh Allah. Sebagian kelompok menganggap persoalan kiblat adalah termasuk ajaran yang sudah baku, tidak bisa diubah lagi, seperti halnya tauhid. Namun, sebagian lagi, yaitu orang-orang yang istikamah dalam beriman, menganggap bahwa persoalan ini termasuk kebijakan Allah yang bisa saja berubah. Dan Allah tidak akan menyia-nyiakan imanmu. Sungguh, Allah maha pengasih, maha penyayang kepada manusia. Sebelum arah kiblat dipindahkan kembali ke kakbah, nabi sering menengadahkan wajahnya ke arah langit. Nabi sangat berharap agar Allah segera memindahkan kiblat dari baitulmakdis ke kakbah, maka turunlah ayat ini. Kami melihat wajahmu, wahai nabi Muhammad, sering menengadah ke langit. Kami maha mengerti tentang keinginanmu, oleh karena itu akan kami palingkan engkau ke kiblat yang engkau senangi. Maka hadapkanlah wajahmu ke arah masjidilharam. Dan di mana saja engkau berada, wahai pengikut nabi Muhammad, hadapkanlah wajahmu ke arah itu. Dengan pemindahan ini, baitulmakdis sudah tidak lagi menjadi kiblat salat yang sah. Orang yahudi dan nasrani tahu benar akan hal ini. Dan sesungguhnya orang-orang yang diberi kitab taurat dan injil tahu bahwa pemindahan kiblat itu adalah kebenaran dari tuhan mereka. Hal itu mereka ketahui dari kitab-kitab suci mereka. Dan Allah tidak lengah terhadap apa yang mereka kerjakan. Allah pasti akan mencatat semua langkah perbu-atan mereka yang melawan ketentuan-Nya."
  }
]