[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kami telah melihat engkau - wahai Rasul -mengarahkan wajahmu ke arah langit berulang-ulang kali, demi menunggu Wahyu turun kepadamu tentang urusan kiblat, maka kami benar-benar memalingkan engkau dari Baitul Maqdis, ke arah kiblat yang kau sukai dan kau inginkan, yaitu arah Masjidil Haram di Mekah. Maka palingkanlah wajahmu ke arah sana. Dan dimanapun kalian berada -wahai kaum muslimin- dan kalian hendak mengerjakan salat, maka hadapkanlah ke arah Masjidil Haram. Sesungguhnya orang-orang yang telah diberi ilmu dari Alkitab dari bangsa Yahudi dan Nasrani sungguh mereka betul-betul mengetahui bahwa perubahan arah kiblat yang kau alami menuju Ka'bah itu merupakan kebenaran yang tertera dalam kitab-kitab mereka. Dan Allah sekali-kali tidaklah lengah dari apa yang dikerjakan orang-orang yang menentang dan meragukannya, dan Allah akan memberikan balasan kepada mereka atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Sungguh Kami telah melihat gerak-gerik wajah dan pandanganmu -wahai Nabi- ke arah langit untuk menunggu turunnya wahyu tentang pengalihan arah kiblat yang engkau inginkan. Maka Kami benar-benar menghadapkanmu ke arah kiblat yang engkau ridai dan sukai, yaitu Baitullah (Ka'bah), sebagai pengganti Baitul Maqdis yang sekarang. Maka hadapkanlah wajahmu ke arah Baitullah yang ada di Makkah al-Mukarramah. Dan di manapun kalian -wahai orang-orang mukmin- berada, hadapkanlah wajah kalian ke arahnya ketika menunaikan salat. Sesungguhnya orang-orang yang telah diberikan kitab suci, baik Yahudi maupun Nasrani benar-benar mengetahui bahwa pengalihan kiblat ini adalah kebenaran yang turun dari Rabb Yang Menciptakan mereka dan Mengatur urusan mereka, karena kebenaran itu telah tertulis di dalam kitab suci mereka. Dan Allah tidak lalai terhadap perbuatan orang-orang yang berpaling dari kebenaran. Sesungguhnya Allah mengetahuinya dan akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "144. Sungguh ALlah melihatmu hai Muhammad ketika kamu berkali-kali menghadapkan wajah dan pandanganmu ke langit dengan penuh harapan agar turun perintah pemindahan kiblat menuju Ka’bah. Maka sekarang jadikanlah shalatmu menghadap Ka’bah. Dan dimanapun kalian hai kaum muslimin, jika kalian ingin mendirikan shalat maka menghadaplah ke Ka’bah. Dan orang-orang Yahudi dan Nasrani benar-benar percaya bahwa perpindahan kiblatmu menuju Ka’bah merupakan kebenaran yang tercantum dalam kitab mereka. Dan Allah tidaklah lalai terhadap apa yang dilakukan oleh orang-orang yang mendustakan tersebut, dan Dia akan membalas perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "144. قَدْ نَرَىٰ تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ (Sungguh Kami (sering) melihat mukamu menengadah ke langit) Yakni dengan melihat ke langit. فَلَنُوَلِّيَنَّكَ (maka sungguh Kami akan memalingkan kamu) Yakni Kami akan menghadapkanmu ke kiblat yang kau sukai. فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ ۚ (Palingkanlah mukamu ke arah Masjidil Haram) Yakni menghadaplah dalam sholatmu ke arah Ka’bah. وَحَيْثُ مَا كُنْتُمْ (Dan dimana saja kamu berada) Yakni dimanapun kalian berada menghadaplah kalian ke arah Ka’bah. وَإِنَّ الَّذِينَ أُوتُوا الْكِتَابَ لَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ ۗ . (Dan sesungguhnya orang-orang ahli kitab memang mengetahui, bahwa berpaling ke Masjidil Haram itu adalah benar dari Tuhannya) Yakni mereka mengetahui bahwa menghadap ke Ka’bah ini adalah kebenaran atas perintah Allah. Dan pengetahuan ahli kitab dalam hal ini bisa jadi dari penjelasan Nabi-Nabi mereka atau mereka mendapatkannya dalam Kitab-kitab yang diturunkan kepada mereka yang mengatakan bahwa Nabi ini (Muhammad) akan menghadap ke Ka’bah. Dalam hadist shohihain dari al-Barra’: Bahwa Nabi Muhammad pada saat pertama kali datang ke Madinah menghadap dalam sholatnya ke Baitul Maqdis selama sekitar enam atau tujuh bulan, namun dalam hatinya menginginkan agar menghadap Baitullah (Ka’bah). Dan sholat pertamanya yang menghadap ke arah Ka’bah adalah sholat ashar yang ia tunaikan bersama beberapa jamaah. Kemudian salah seorang jamaah yang telah selesai sholat dengan beliau keluar dan melewati jamaah di masjid lain yang sedang dalam keadaan ruku’, dia pun berkata kepada mereka: aku bersaksi dengan nama Allah, sungguh aku selesai sholat dengan Rasulullah menghadap Ka’bah. Mereka pun memutar ke arah Ka’bah. Dan orang-orang Yahudi senang ketika Nabi Muhammad dan Ahli kitab sama-sama menghadap ke Baitul Maqdis saat sholat. Dan ketika dia memalingkan wajahnya menghadap Baitullah Ka’bah mereka kemudian mengingkarinya. Dan sebelumnya telah meninggal beberapa orang sebelum pemindahan kiblat ini, sedangkan kami tidak mengetahui nasib mereka, maka turunlah ayat وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ ۚ (dan Allah tidak akan menyia-nyiakan imanmu)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah -عز وجل- berkata kepada nabi-Nya : { فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا } \"maka sungguh Kami akan memalingkan kamu ke kiblat yang kamu sukai\" , Allah tidak mengatakan \"yang kamu senangi karena nafsu\" hal ini menunjukkan bahwa keinginan Rasullah untuk berpaling dari masjid al-Aqsho menuju ka'bah adalah untuk kebaikan, hal itu karena ka'bah lebih cocok untuk dijadikan qiblat bagi kaum muslimin, ka'bah merupakan masjid pertama yang dibangun untuk umat manusia dengan tauhid, adapun dijadikannya baitul maqdis sebagai qiblat pertama kemudian dipindahkan menuju ka'bah adalah isyarat bahwa agama ini berbeda dengan agama ahli kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144. Wahai Nabi, sungguh Kami telah melihat pandanganmu yang menghadap ke langit seraya berharap akan turunnya perintah menghadapkan kiblat ke arah Ka’bah. Maka sungguh Kami akan memalingkanmu ke arah kiblat yang kamu sukai dan kehendaki. Maka palingkanlah wajahmu kea rah masjidil Haram. Dimanapun kalian berada, palingkanlah wajah kalian kea rah Ka’bah. Sesungguhnya ahli kitab itu tahu bahwa keberpalingan kalian menghadap Ka’bah itu adalah benar dengan adanya perintah dan keajiban dari Allah bagi para hambaNya.Dan sesungguhnya telah tercantum dalam kitab-kitab mereka bahwa Nabi yang dikabarkan itu melakukan shalat menghadap kiblat ayahnya, yaitu Ibrahim. Dan tidaklah Allah itu melupakan amal perbuatan mereka yang memberikan keraguan dan fitnah. Dia akan membalas mereka atas hal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, Kami melihat perubahan arah wajahmu ke langit} perubahan arah wajahmu ke arah langit {Maka sungguh Kami akan memalingkanmu ke kiblat} maka sungguh Kami benar-benar akan mengubahmu ke kiblat {yang kamu sukai} kamu cintai {maka hadapkanlah wajahmu ke arah} arah {Masjidil haram. Di mana pun kalian berada, hadapkanlah wajah kalian ke arah itu. Sesungguhnya orang-orang yang diberi kitab benar-benar mengetahui bahwa itu adalah kebenaran dari Tuhan mereka. Allah tidak lengah terhadap apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "144. Allah ta'ala berfirman kepada NabiNya, “Sungguh Kami (sering) melihat mukamu (Muhammad) menengadah ke langit,” maksudnya, beiau sering kali melakukan hal itu berulang-ulang dengan rasa harap dan menunggu turunnya wahyu tentang menghadap ke Ka’bah. Allah berfirman, “Mukamu” dan bukan dengan matamu adalah untuk menambah perhatiannya, dan karena pembalikan wajah secara pasti diikuti dengan pembalikan mata. “Maka sungguh Kami akan memalingkan kamu,” maksudnya, Kami akan mengarahkan kamu karena kekuasaan Kami terhadapmu, “ke kiblat yang kamu sukai,” maksudnya, yang kamu senangi yaitu Ka’bah. Ini merupakan suatu penjelasan akan keutamaan dan kemuliaan beliau, dimana Allah bersegera dalam memenuhi keinginan beliau, kemudian Allah menegaskan tentang menghadap ke arah Ka’bah. Allah taala berfirman, “Palingkanlah mukamu ke arah masjidil haram.” Muka adalah suatu bagian yang terdepan dari tubuh manusia. “ Dan di mana saja kamu berada,” yaitu di lautan atau daratan, timur atau barat, selatan atau utara, “maka palingkanlah mukamu ke arahnya,” maksudnya, menghadap ke arah Ka’bah. Didalam ayat ini terdapat kandungan disyaratkannya menghadap kiblat dalam menjalankan setiap shalat, baik yang wajib maupun yang sunnah. Apabila memungkinkan menghadap kepada dzat Ka’bah tersebut, (maka wajib menghadap fisik Ka’bah), namun bila tidak memungkinkan, maka kearahnya saja. Dan ini juga menunjukan bahwa berpaling dengan badan itu membatalkan shalat, karena perintah kepada sesuatu itu berarti larangan dari perkara yang berlawanan dengannya. Ketika Allah menyebukan dalam pembahasan tadi orang-orang yang membantah hal tersebut dari ahli Kitab danselain mereka dan Allah juga menyebutkan tentang jawaban atas bantahan mereka itu, lalu Allah dalam ayat ini menyebutkan bahwasanya ahli Kitab dan orang-orang yang berilmu diantara mereka mengetahui dengan benar bahwasanya engkau berada dalam kebenaran yang jelas, karena mereka mendapatkannya ada di dalam kitab mereka, akan tetapi mereka berpaling karena membangkang dan zhalim. Apabila mereka mengetahui akan kesalahan mereka, janganlah kalian mempedulikan hal itu, karena sesungguhnya manusia akan dipusingkan oleh suatu bantahan dari orang yang membantahnya apabila perkaranya tidaklah jelas dan kemungkinan saja yang benar itu apa adanya, namun apabila dia yakin bahwa kebenaran itu ada bersama orang yang dibantah, sedangkan orang yang membantah itu hanyalah seorang yang keras kepala yang mengetahui kesalahan perkataannya, maka sama sekali tidak ada yang harus dipedulikan padanya, akan tetapi tunggu saja siksaan dunia dan akhirat yang akan dirasakan oleh orang-orang yang membantah tersebut. Karena itu Allah berfirman, “Dan Allah sekali-kali tidak lengah dari apa yang mereka kerjakan,” bahkan Allah memelihara perbuatan-perbuatan mereka dan akan memberi balasannya. Didalam ayat ini terdapat ancaman terhadap orang-orang yang membantah dan sekaligus hiburan bagi kaum Mukminin."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ } Taqalluba wajhika fis samaa’ : Menengadahkan muka ke langit berulang ulang menunggu turunnya wahyu. { فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ } Falanuwalliyannaka qiblatan tardhaha : Kami palingkan engkau menghadap kiblat yang engkau sukai yaitu Ka’bah. { فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ } Fawalli wajhaka syathral masjidil haram : Arahkanlah wajahmu ke arah Masjidil Haram di Mekah. { ٱلۡحَرَامِۚ } al-Haraam : Maknanya daerah yang diharamkan tidak boleh menumpahkan darah atau membunuh seseorang di dalamnya. { الشطر } asy-Syathr : Maksudnya di sini adalah arah, dan menghadap kiblat dapat terpenuhi dengan menghadap sebagian Ka’bah di dalam Masjidil Haram. Karena makna syathr secara bahasa adalah separuh atau sebagian saja. { أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ } Annahul haqqu min rabbihim : Perpindahan kiblat telah ada nash nya dalam kitab-kitab suci terdahulu. Makna ayat : Allah Ta’ala memberitahukan rasulNya bahwa Dia melihatnya berulang-ulang menengadahkan wajahnya ke langit menunggu turunnya wahyu yang memerintahkan perubahan arah kiblat, dari Baitul Maqdis ke Ka’bah untuk menyelisihi orang-orang Yahudi karena mencintai kiblat bapaknya yaitu Nabi Ibrahim, yang merupakan kiblat yang pertama dan terbaik. Oleh karena itu Allah Ta’ala berfirman (فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ ) “Hadapkanlah wajahmu ke arah Masjidil Haram” dengan turunnya ayat ini merupakan perintah mengenai perubahan kibat. Diriwayatkan bahwa ketika ayat ini turun, Rasulullah sedang shalat dhuhur di Masjid Bani Salamah yang sekarang dikenal sebagai Masjid Qiblatain. Rasulullah mengimami dan kaum mukminin bermakmum di belakangnya dan sampai raka’at kedua masih menghadap Baitul Maqdis dan dua raka’at setelahnya menghadap Ka’bah. Agar kiblat tidak khusus hanya untuk penduduk Madinah saja maka Allah Ta’ala mengatakan “Dimanapun kamu berada” yaitu di berbagai belahan bumi manapun “palingkanlah wajahmu menghadapnya”, maknanya menghadap bagian Masjidil Haram. Allah Ta’ala memberitahukan pada ayat ini bahwa para ulama dari kalangan Ahli kitab sudah mengetahui bahwa perubahan kiblat ini benar perintah Allah, dan apa yang mereka perbuat berupa menyebarkan keraguan dan gangguan mengenai perubahan kiblat diketahui oleh Allah dan akan dibalas olehNya, sebab Allah tidak perna lalai terhadap apa yang mereka perbuat. Pelajaran dari ayat : • Kewajiban menghadap kiblat ketika shalat, dan dimanapun orang yang shalat berada wajib untuk menghadap arah Mekah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 144: Berkata Allah kepada nabi-Nya ﷺ : Sesungguhnya Kami melihat banyak pandanganmu kearah langit wahai nabi Allah berharap turunnya wahyu dalam urusan kiblat; maka sekarang kami akan mengarahkanmu menunju kiblat yang engkau cintai dan ridhoi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Barraa' bin 'Azib, ia berkata, \"Rasulullah shallallahu 'alaihi wa sallam menghadap ke Baitulmaqdis selama 16 bulan. Rasulullah shallallahu 'alaihi wa sallam ingin sekali menghadap ke Ka'bah, maka Allah Azza wa Jalla menurunkan ayat, \"Qad naraa taqalluba wajhika fis samaa'\", maka Beliau menghadap ke Ka'bah, lalu orang-orang yang kurang akal, yakni orang-orang Yahudi berkata, \"Apa yang memalingkan mereka dari kiblat (Baitul Maqdis) yang dahulu mereka berkiblat kepadanya?\" Kemudian Allah menurunkan ayat, \"Qulliillahil masyriqu wal maghribu, yahdii mayyasyaa'u ilaa shiraathim mustaqiim\", lalu ada seorang yang shalat bersama Nabi shallallahu 'alaihi wa sallam, kemudian setelah shalat pergi dan melewati orang-orang Anshar yang sedang shalat Ashar menghadap ke Baitulmaqdis, lalu bersaksi bahwa dia telah shalat bersama Rasulullah shallallahu 'alaihi wa sallam dan bahwa Beliau menghadap ke Ka'bah, maka orang-orang pun berputar menghadap ke Ka'bah. Maksudnya: Nabi Muhammad shallallahu 'alaihi wa sallam sering melihat ke langit berdoa dan menunggu dengan harap turunnya wahyu yang memerintahkan beliau menghadap ke Baitullah Ka'bah. Kata-kata ini menunjukkan keutamaan Rasulullah shallallahu 'alaihi wa sallam, di mana Allah Subhaanahu wa Ta'aala segera mengabulkan apa yang Beliau inginkan. Yakni badanmu, karena arti wajh adalah bagian depan badan dari atas sampai bawah. Dalam ayat ini terdapat dalil bahwa menghadap kiblat merupakan syarat shalat, dan jika seseorang tidak bisa menghadap langsung ke rumah itu, maka dengan menghadap ke arahnya. Yakni disebutkan dalam kitab-kitab mereka. Dalam firman-Nya ini terdapat ancaman terhadap mereka yang protes dan hiburan bagi kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 144",
    "description": "Sebelum arah kiblat dipindahkan kembali ke kakbah, nabi sering menengadahkan wajahnya ke arah langit. Nabi sangat berharap agar Allah segera memindahkan kiblat dari baitulmakdis ke kakbah, maka turunlah ayat ini. Kami melihat wajahmu, wahai nabi Muhammad, sering menengadah ke langit. Kami maha mengerti tentang keinginanmu, oleh karena itu akan kami palingkan engkau ke kiblat yang engkau senangi. Maka hadapkanlah wajahmu ke arah masjidilharam. Dan di mana saja engkau berada, wahai pengikut nabi Muhammad, hadapkanlah wajahmu ke arah itu. Dengan pemindahan ini, baitulmakdis sudah tidak lagi menjadi kiblat salat yang sah. Orang yahudi dan nasrani tahu benar akan hal ini. Dan sesungguhnya orang-orang yang diberi kitab taurat dan injil tahu bahwa pemindahan kiblat itu adalah kebenaran dari tuhan mereka. Hal itu mereka ketahui dari kitab-kitab suci mereka. Dan Allah tidak lengah terhadap apa yang mereka kerjakan. Allah pasti akan mencatat semua langkah perbu-atan mereka yang melawan ketentuan-Nya. Walaupun orang-orang ahli kitab mengetahui tentang kebenaran pemindahan kiblat, mereka tetap tidak menerima kenyataan tersebut karena kedengkian mereka terhadap nabi Muhammad. Dan walaupun engkau, nabi Muhammad, memberikan semua ayat, yakni keterangan, kepada orang-orang yang diberi kitab itu, mereka tidak akan mengikuti kiblatmu, dan engkau pun tidak akan mengikuti kiblat mereka. Ahli kitab akan terus bertahan pada kiblat masing-masing: orang yahudi bertahan dengan baitulmakdis, dan orang nasrani bertahan ke arah terbitnya matahari. Sebagian mereka tidak akan mengikuti kiblat sebagian yang lain. Allah memperingatkan rasulullah agar tidak mengikuti keinginan mereka. Dan jika engkau mengikuti keinginan mereka setelah sampai ilmu kepadamu, niscaya engkau termasuk orang-orang zalim."
  }
]