[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika engkau -wahai Rasul- datang kepada orang-orang yang telah diberit taurat dan Injil dengan membawa semua hujjah (dalil) yang kuat dan bukti nyata bahwa perpindahan ke arah Ka'bah Dalam Sholat itu adalah benar-benar perintah dari sisi Allah, mereka tetap saja tidak akan mengikuti kiblatmu, karena penentangan dan kesombongan mereka, dan engkau pun tidak akan mengikuti kiblat mereka lagi, dan tidaklah sebagian mereka mengikuti kiblat sebagian yang lain. Dan apabila engkau mengikuti Keinginan mereka terkait urusan menghadap kiblat dan persoalan lainnya setelah datang ilmu kepadamu bahwa engkau itu berada di atas kebenaran sementara mereka berada di atas kebatilan, saat itulah engkau benar-benar termasuk orang-orang yang zalim kepada diri sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Demi Allah, jika engkau -wahai Nabi- datang kepada orang-orang yang telah diberi kitab suci, baik orang-orang Yahudi maupun Nasrani dengan membawa setiap ayat dan bukti yang menunjukkan bahwa pengalihan kiblat itu adalah benar, niscaya mereka tidak akan mau menghadap ke arah kiblatmu, karena mereka memang menolak agama yang engkau bawa dan enggan mengikuti kebenaran. Dan engkau tidak akan menghadap ke arah kiblat mereka setelah Allah memalingkanmu dari kiblat itu. Sebagian dari mereka pun tidak akan menghadap ke arah kiblat sebagian yang lain, karena masing-masing dari mereka mengkafirkan golongan yang lain. Dan jika engkau mengikuti hawa nafsu orang-orang itu -dalam urusan kiblat dan ketentuan-ketentuan hukum lainnya setelah engkau mendapatkan ilmu yang benar dan tidak ada keraguan terhadapnya- sesungguhnya ketika itu engkau benar-benar termasuk orang-orang yang zalim karena telah meninggalkan petunjuk dan mengikuti hawa nafsu. Kata-kata ini ditujukan kepada Nabi -ṣallallāhu 'alaihi wa sallam- untuk menunjukkan betapa buruknya tindakan mengikuti orang-orang tersebut. Jika tidak, maka Allah telah memelihara Nabi-Nya dari tindakan tersebut. Maka ini adalah peringatan bagi umatnya setelah kepergiannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "145. Hai Rasulullah, sungguh jika kamu mendatangkan kepada orang-orang Yahudi dan Nasrani segala mukjizat yang membuktikan kebenaranmu agar mereka mengikuti kiblatmu, niscaya mereka tetap tidak akan mengikuti kiblatmu akibat kekafiran dan kedurhakaan mereka; sebab mengikuti kiblatmu sama dengan mengikutimu, sedangkan kamu tidak mengikuti kiblat mereka, demikian pula orang-orang Nasrani tidak mengikuti kiblat orang-orang Yahudi sebagaimana mereka tidak mengikuti kiblat orang-orang Nasrani. Sungguh jika kamu mengikuti hawa nafsu mereka setelah kamu mendapat wahyu tentang kebenaranmu, niscaya kamu akan termasuk orang-orang yang menzalimi diri mereka sendiri. Ayat ini mengandung peringatan dari mengikuti hawa nafsu para ahli kitab dan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. وَلَئِنْ أَتَيْتَ (Dan sesungguhnya jika kamu mendatangkan) Yakni tidak akan memberi pengaruh kepada mereka ayat apapun, dan mereka tidak akan kembali kepada kebanaran dan kepada kiblat Muhammad meskipun didatangkan segala bukti, karena mereka meninggalkan kebenaran bukanlah karena bukti yang mereka miliki bukan pula syubhat yang menyerang mereka, melainkan karena kebebalan mereka, padahal mereka juga mengetahui bahwa mereka tidak memiliki pegangan apapun; dan orang seperti ini tidak akan bermanfaat untuknya segala bukti. وَمَا أَنْتَ بِتَابِعٍ قِبْلَتَهُمْ ۚ (dan kamupun tidak akan mengikuti kiblat mereka) Yakni agar menghentikan apa yang diinginkan Ahli kitab agar Nabi Muhammad kembali ke kiblatnya yang lama. وَمَا بَعْضُهُمْ بِتَابِعٍ قِبْلَةَ بَعْضٍ ۚ (dan sebahagian merekapun tidak akan mengikuti kiblat sebahagian yang lain) Yakni sebagian mereka tidak akan mengikuti kiblat sebagian yang lain. Karena orang Yahudi menghadap ke Baitul Maqdis dan orang Nasrani menghadap tempat terbitnya matahari. وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ (Dan sesungguhnya jika kamu mengikuti keinginan mereka) Yakni mengikuti kiblat mereka. Karena ketika Nabi Muhammad di perintahkan untuk menghadap Ka’bah sesungguhnya merekapun harus mengikuti perintah tersebut, akan tetapi mereka tidak melaksanakannya, sehingga mereka menghadap Bitul Maqdis karena mengikuti hawa nafsu mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ } \"Dan sesungguhnya jika kamu mengikuti keinginan mereka (Yahudi dan Nasrani))\" dalam ayat lafazh ini { أَهْوَاءَهُمْ } disebutkan dalam bentuk jamak, hal itu sebagai peringatan bahwa setiap dari mereka memiliki keinginan yang berbeda satu sama lainnya, dan keingin saetiap dari mereka tidak saling melarang. 2 ). Tidaklah Allah mengatakan { أَهْوَاءَهُمْ } dan bukan \"دينهم\" melainkan apa yang mereka yakini saat ini hanyalah hawa nafsu, bahkan hati-hati mereka mengetahui bahwa yang mereka yakini bukanlah agama, maka barangsiapa yang meninggalkan agama ini sungguh dia tekah mengikuti hawa nafsunya dan tidak diragukan lagi, Allah berfirman : { أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ } \"Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya\" [ al-Jatsiyah : 23 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145. Wahai Nabi, jika datang kepadamu ahli kitab dengan semua hujjah dan bukti bahwa pengalihan kiblat itu benar dengan perintah Allah, maka mereka tidak akan mengikuti arah kiblatmu dengan penuh keingkaran dan keangkuhan. Jangan sampai dirimu mengikuti kiblat mereka. Masing-masing kelompok itu mengikuti kiblatnya sendiri. Orang-orang Yahudi menghadap Baitul Maqdis dan orang-orang nasrani menghadap arah terbitnya matahari. Dan jika kamu setuju dengan hawa nafsu mereka dengan ikut mengarah kepada kiblat yang mereka serukan kepadamu setelah datangnya ilmu Allah melalui perantara wahyu, maka sungguh kamu termasuk orang-orang yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, jika kamu mendatangkan ayat kepada orang-orang yang diberi kitab itu, mereka tidak akan mengikuti kiblatmu. dan kamu tidak akan mengikuti kiblat mereka. Sebagian mereka tidak akan mengikuti kiblat sebagian yang lain. Sungguh jika kamu mengikuti keinginan mereka setelah sampai ilmu kepadamu, niscaya kamu termasuk orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145. Di antara semangat Nabi Muhammad yang besar dalam menyampaikan hidayah kepada manusia adalah, beliau mengerahkan segala daya dan upaya untuk mereka dari nasihat dan lemah lembut dalam memberi hidayah kepada mereka, beliau sangat sedih bila mereka tidak tunduk kepada perintah Allah. Di antara kaum kafir ada yang membangkang terhadap perintah Allah, berlaku sombong terhadap Easul-rasul Allah dan meninggalkan hidayah dengan sengaja dan melampaui batas; di antara mereka itu ada orang-orang Yahudi dan orang-orang Nasrani, yaitu ahli kitab pertama yang mengingkari Nabi Muhammad dengan keyakinan, bukan dengan kebodohan. Oleh karena itu Allah mengabarkan bahwasanya sekiranya, “kamu mendatangkan kepada orang-orang (Yahudi dan Nasrani) yang diberi al-Kitab (Taurat dan Injil), semua ayat (keterangan),” maksudnya, dengan segala bukti nyata dan dalil yang menjelaskan perkataanmu dan menerangkan apa yang kamu dakwahkan kepadanya, “mereka tidak akan mengikuti kiblatmu,” maksudnya, mereka tidak akan mengikutimu; karena mengikuti dalam hal kiblat menunjukan akan ketundukan kepada beliau, dan karena sebabnya adalah dalam perkara kiblat, dan perkara tersebut bisa seperti itu adalah karena mereka durhaka, dimana mereka telah mengetahui kebenaran namun mereka meninggalkannya, maka ayat-ayat itu hanya akan bermanfaat bagi orang yang mencari kebenaran, namun perkaranya samar menurutnya, maka ayat-ayat yang jelas akan (berfungsi) menerangkan untuknya. Adapun orang yang telah bertekad untuk tidak mengikuti kebenaran, maka tidak ada alasan lagi baginya, dan jugaperpecahan diantara mereka benar-benar terjadi, dimana sebagian merekatidak mengikuti kiblat sebagian yang lain. Oleh karena itu, bukanlah suatu hal yang aneh, apabila mereka tidak mengikuti kiblatmu wahai Muhammad dan mereka itu adalah musuh yang benar-benar dengki. Firmanya, “Dan kamu pun tidak akan mengikuti kiblat mereka,” ini lebih mantap daripada kalimat “janganlah kamu mengikuti,” karena hal itu mengandung suatu dugaan bahwa Muhammad memiliki sifat tampil beda dengan mereka, maka hal itu tidaklah mungkin terjadi dari beliau. Allah juga tidak berfirman “ sekiranya didatangkan kepada mereka setiap ayat” karena mereka tidak memiliki dalil atas apa yang mereka katakan. Demikian juga apabila telah jelas kebenaran itu dengan dalil-dalilnya yang yakin, maka tidaklah harus menjawab hal yang syubhat yang muncul darinya, karena dia tidak memiliki batas dan juga karena dia mengetahui kebatilannya, atas dasar pengetahuan bahwa setiap yang bertentangan dengan kebenaran yang jelas itu adalah suatu kebatilan, maka menjawab hal yang syubhat itu hanyalah sebatas suatu tindakan derma semata (yang tidak harus). “Dan sungguh jika kamu mengikuti keinginan mereka.” Allah berkata, “keinginan mereka” dan tidak berkata “agama mereka”; karena apa yang mereka anut saat itu adalah sebatas hawa nafsu diri mereka, hingga dalam hati mereka pun mengetahui bahwa hal itu bukanlah agama, dan barang siapa yang meninggalkan agama, maka dia hanya mengikuti hawa nafsu, tidak ada lainnya. Allah berfirman : Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya dan Allah membiarkannya berdasarkan ilmu-Nya dan Allah telah mengunci mati pendengaran dan hatinya dan meletakkan tutupan atas penglihatannya? Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat). Maka mengapa kamu tidak mengambil pelajaran?\" QS Al- Jatsiyah: 23 “Setelah datang ilmu kepadamu,” bahwasanya engkau berada di atas kebenaran sedangkan mereka dalam kebatilan, “Sesungguhnya kamu kalau begitu,” maksudnya jika kamu mengikuti mereka, hal ini adalah sebuah tindakan pencegahan agar kalimat ini tidak terputus dengan kalimat yang sebelumnya, walaupun hanya dalam pikiran, “termasuk golongan orang-orang yang zhalim,” yakni, tergolong bersama mereka dan tergabung diantara kelompok mereka. Dan kezhaliman apakah yang paling keji dari kezhaliman orang yang mengetahui kebenaran dan kebatilan lalu dia lebih memilih kebatilan dari pada kebenaran? Hal ini walaupun pembicaraannya kepada Muhammad namun umatnya termasuk di dalamnya. Demikian juga apabila beliau melakukan hal itu dan ini tentu sangatlah mustahil niscaya beliau juga zhalim, meskipun dengan kedudukannya yang tinggi dan kebaikannya yang banyak, maka orang-orang yang selainnya tentunya lebih pantas dan patut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ءَايَةٖ } Aayat : Bukti yang nyata Makna ayat : Pada ayat 145 Allah Ta’ala memberitahukan mengenai hakikat yang pasti, yaitu jika Nabi Muhammad ﷺ mendatangkan sekian banyak bukti kepada Yahudi dan Nasrani, yang menunjukkan kebenaran dan kaum muslimin berhak untuk merubah kiblat ke Ka’bah, mereka tidak akan mengikutinya dan tetap shalat menghadap kiblatnya. Orang Nasrani tidak beribadah menghadap ke Baitul Maqdis kiblatnya orang Yahudi, dan begitu juga orang Yahudi tidak beribadah menghadap tempat terbitnya matahari kiblatnya orang Nasrani. Dan Nabi Muammad beserta kaum Muslimin tidak akan pernah mengikuti Ahli kitab dengan menghadap kiblatnya, setelah Allah memberikan petunjuk kepada kiblat yang paling utama dan dicintai oleh mereka. Kemudian Allah Ta’ala memperingatkan rasulNya agar tidak mengikuti hawa nafsu orang Yahudi sehingga tidak terjadi ke dalam bid’ah dan kesesatan yang mereka perbuat, setelah diberikan ilmu dan hidayah menuju kebenaran. Namun, tidak mungkin Nabi melakukan itu, apabila sampai melakukannya makan akan termasuk dalam golongan orang-orang zhalim. Pelajaran dari ayat : • Banyak kekufuran yang dilakukan oleh Ahli Kitab disebabkan mereka mencampakkan ilmunya dan lebih memilih kehidupan duniawi dibandingkan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 145: Allah mengabarkan urusanNya kepada nabi ﷺ yang bahwasannya jika telah datang mereka yahudi dan nasrani dengan seluruh burham dan dalil agar engkau menghadap kepada kiblat maka ia adalah kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi shallallahu 'alaihi wa sallam karena tingginya harapan Beliau agar orang lain mendapatlkan hidayah telah mencurahkan segala tenaga dan mencari cara agar mereka memperoleh hidayah. Beliau berlemah lembut dalam berdakwah dan bersedih ketika orang yang didakwahinya itu tidak mau mengikuti. Di antara kaum kafir banyak yang tetap keras tidak mau mengikuti bahkan bersikap sombong terhadap Beliau, mereka ini orang-orang Yahudi dan Nasrani, mereka kafir kepada Beliau bukan karena kebodohan tetapi karena yakin terhadap kebenarannya, maka Allah Subhaanahu wa Ta'aala menerangkan bahwa meskipun bukti dan dalil dibawakan Beliau kepada mereka, niscaya mereka tetap tidak mau mengikuti. Mereka tidak mau mengikuti karena keadaan mereka yang mu'anidun, yakni mengetahui yang hak, tetapi malah meninggalkannya, padahal ayat dan dalil hanyalah akan bermanfa'at bagi mereka yang mencari yang hak namun masih samar, kepadanyalah bukti dan dalil diperlukan. Adapun orang yang bersikeras untuk tidak mau mengikuti kebenaran, maka tidak perlu mencari-cari terus jalan keluarnya. Dari sini kita mengetahui, apabila kita telah menerangkan kebenaran dengan dalil-dalilnya yang yakin kepada orang lain, ternyata ia menolak, maka kita tidak mesti membawakan lagi bukti-bukti lagi, karena tidak ada ujung-ujungnya. Yakni: di samping hal tersebut, mereka juga saling berselisih, masing-masing mereka tidak mengikuti kiblat yang lain. Termasuk juga kepada umat Beliau. Ayat ini merupakan ancaman bagi orang-orang yang lebih mengutamakan keridhaan manusia daripada keridhaan Allah. Di ayat ini menggunakan kata \"ahwaa'ahum\" (keinginan mereka) tidak menggunakan kata \"diinahum\" (agama mereka) karena apa yang mereka pegang selama ini hanyalah semata-mata hawa nafsu, bahkan mereka meyakini apa yang mereka pegang selama ini bukanlah agama. Oleh karena itu, orang yang meninggalkan agama yang benar, maka sebenarnya orang itu hanyalah mengikuti hawa nafsu belaka, meskipun mereka menamainya sebagai agama. Maksudnya: setelah Nabi Muhammad shallallahu 'alaihi wa sallam mengetahui bahwa dirinya di atas yang hak, sedangkan mereka di atas yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 145",
    "description": "Walaupun orang-orang ahli kitab mengetahui tentang kebenaran pemindahan kiblat, mereka tetap tidak menerima kenyataan tersebut karena kedengkian mereka terhadap nabi Muhammad. Dan walaupun engkau, nabi Muhammad, memberikan semua ayat, yakni keterangan, kepada orang-orang yang diberi kitab itu, mereka tidak akan mengikuti kiblatmu, dan engkau pun tidak akan mengikuti kiblat mereka. Ahli kitab akan terus bertahan pada kiblat masing-masing: orang yahudi bertahan dengan baitulmakdis, dan orang nasrani bertahan ke arah terbitnya matahari. Sebagian mereka tidak akan mengikuti kiblat sebagian yang lain. Allah memperingatkan rasulullah agar tidak mengikuti keinginan mereka. Dan jika engkau mengikuti keinginan mereka setelah sampai ilmu kepadamu, niscaya engkau termasuk orang-orang zalim. Allah menjelaskan bahwa pengetahuan orang yahudi dan nasrani tentang benarnya kenabian nabi Muhammad terang benderang. Orangorang yang telah kami beri kitab taurat dan injil mengenalnya, yakni nabi Muhammad, seperti mereka mengenal anak-anak mereka sendiri, bahkan lebih dari itu, karena anak mereka bisa jadi berasal dari hubungan dengan orang lain. Kemudian Allah membuka sifat buruk mereka yang suka menyembunyikan kebenaran hanya untuk kepentingan duniawi. Sesungguhnya sebagian mereka pasti menyembunyikan kebenaran, padahal mereka mengetahui-Nya. Inilah yang menjadikan mereka dibenci Allah, yaitu mengetahui kebenaran tetapi mengingkarinya secara sengaja."
  }
]