[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang kami berikan kepada mereka Taurat dan Injil dari kalangan para ulama Yahudi dan para ulama Nasrani mereka mengenal Muhammad Shallallahu Alaihi Wasallam sebagai utusan Allah dengan sifat-sifat yang tertuang dalam kitab-kitab suci mereka layaknya mereka mengenal anak-anak mereka sendiri, dan sesungguhnya sebagian dari mereka benar-benar menyembunyikan kebenaran sedangkan mereka itu tahu kebenarannya dan kepastian sifat-sifatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. Para ulama Yahudi dan Nasrani yang telah Kami beri Kitab (Taurat dan Injil) mengetahui masalah pemindahan arah kiblat yang merupakan salah satu tanda kenabian Muhammad -ṣallallāhu 'alaihi wa sallam- menurut mereka, sebagaimana mereka mengenal anak-anak mereka sendiri, sehingga bisa membedakan mereka dengan anak-anak yang lain. Namun demikian ada sekelompok orang dari mereka menyembunyikan kebenaran yang dibawa Nabi karena rasa iri yang ada di dalam diri mereka. Mereka melakukan hal itu padahal mereka tahu bahwa itu adalah kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "146. Allah mengabarkan bahwa para pendeta Yahudi dan Nasrani mengetahui Baitul Haram merupakan kiblat yang sesungguhnya. Mereka mengetahui hal ini sebagaimana mereka mengenal anak-anak mereka sendiri. Demikian pula dengan pengetahuan mereka mengenai ciri-ciri Nabi Muhammad dan risalahnya, namun sebagian mereka menyembunyikan kebenaran -ciri-ciri Nabi dan urusan kiblat-, sedangkan mereka mengetahuinya dari kitab mereka dengan yakin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. يَعْرِفُونَهُ (mengenal Muhammad) Yakni mengetahui kenabian Nabi Muhammad. كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ ۖ (seperti mereka mengenal anak-anaknya sendiri) Padahal orang yang paling mengetahui keadaan seseorang adalah kedua orang tuanya, karena keduanyalah yang telah menjaganya sejak kecil hingga dewasa. وَإِنَّ فَرِيقًا مِنْهُمْ لَيَكْتُمُونَ الْحَقَّ (Dan sesungguhnya sebahagian diantara mereka menyembunyikan kebenaran) Yang dimaksud dalam ayat ini adalah ulama-ulama Ahli kitab yang mengetahui sifat Rasulullah, dan tidak termasuk dalam ayat ini orang-orang yang masuk islam diantara mereka seperti Abdullah bin Salam dan sahabat-sahabatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya Allah mengatakan : { كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ } \"seperti mereka mengenal anak-anaknya sendiri\" , dan tidak mengatakan ( أنفسهم ) \"diri-diri mereka sendiri\"; karena sesungguhnya manusia tidak mengenal diri mereka kecuali hanya sebatas waktu tertentu, dan mengetahui anaknya sejak dia ada, Kemudian dalam menyebutkan Anak tanpa penyebutan diri; sesungguhnya anak manusia adalah gambaran dari diri-diri mereka pula."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146. Orang-orang yahudi itu mengetahui kenabian nabi Muhammad SAW dengan sifat-sifatnya yang disebutkan dalam taurat, layaknya mereka mengenali anak-anak mereka sendiri. Sesungguhnya ada suatu kelompok di antara mereka yang tidak mau masuk Islam, yaitu ulama’ mereka yang sudah mengetahui sifat-sifat itu, lalu mereka menyembunyikan kebenaran pasti dengan penuh kairian dan keangkuhan yang mana kamu diutus bersama kebenaran itu. Dan mereka tahu bahwa Allah menjelaskan Nabi Muhammad dalam kitab mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang telah Kami anugerahi Kitab, mengenalnya} mengenal nabi Muhammad SAW {sebagaimana mereka mengenal anak-anak mereka sendiri. Sesungguhnya sekelompok dari mereka pasti menyembunyikan kebenaran, sedangkan mereka mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "146. Allah mengabarkan bahwasanya ahli Kitab itu telah jelas bagi mereka dan telah mereka ketahui bahwa Nabi Muhammad itu adalah rasulullah dan bahwa apa yang dibawa oleh beliau itu adalah haq dan benar dan mereka sangat yakin akan hal itu sebagaimana mereka yakin terhadap anak-anak mereka, dimana mereka tidak mungkin saling tertukar dengan anak-anak yang lain. Oleh karena itu pengetahuan mereka tentang Nabi Muhammad telah sampai pada batas tidak ada keraguan dan tidak ada perdebatan padanya. Akan tetapi kelompok mayoritas diantara mereka mengingkari beliau, mereka menyembunyikan kesaksian yang meyakinkan tersebut padahal mereka mengetahuinya. \"Maka siapakah yang lebih zhalim dari orang-orang yang menyembunyikan kesaksian dari sisi Allah?\" Termasuk dalam kandungan ayat ini adalah hiburan bagi Rasulullah dan kaum Mukminin, juga peringatan untuk mereka dari kejahatan orang-orang kafir dan syubhat mereka. Namun ada sekelompok dari mereka yang tidak menyembunyikan kebenaran tersebut dan mereka mengetahui hal itu, dan diantara mereka ada yang beriman dan ada juga yang tetap kafir kepadanya karena kebodohan. Seorang yang berilmu wajib memperlihatkan kebenaran, menjelaskan, dan menghiasinya dengan segala yang mampu dia lakukan dari penjelasan kalimat, pengungkapan keterangan, contoh, dan sebagainya. Dan wajib baginya mengingkari kebatilan, membedakannya dari kebenaran, dan menjadikannya dibenci oleh jiwa dengan segala cara yang menyampaikan kepada hal tersebut. Dan oleh karena orang-orang yang telah menyembunyikan kebenaran tersebut telah berlaku kebalikan dari yang seharusnya, maka kondisi mereka pun terimbas dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { يَعۡرِفُونَهُۥ } Ya’rifuunahu : Dhamir (kata ganti) kembali kepada Rasulullah ﷺ yaitu mereka mengetahui bahwa dia (Muhammad, pent) adalah Nabi dan Rasulullah, sebagaimana telah tertulis dalam kitab-kitab mereka mengenai sifat dan karakternya secara jelas. Makna ayat : Pada ayat (146) Allah Ta’ala mengabarkan bahwa para ulama Ahli kitab mengetahui bahwa kerasulan Muhammad adalah benar, dan risalah yang dibawanya adalah benar. Mereka benar-benar mengetahui seperti pengetahuan mereka tentang anak-anaknya sendiri. Akan tetapi mereka menyembunyikan kebenaran sedangkan mereka mengetahui. Pelajaran dari ayat : • Haramnya kaum Muslimin mengikuti bid’ah yang dilakukan oleh Ahli kitab bagaimanapun bentuknya. • Para Ulama ahli kitab yang hidup semasa dengan Nabi shallallahu ‘alaihiwasallam mengetahui bahwa Muhammad adalah nabi yang dikabarkan dalam kitabnya, dan merupakan penutup para nabi. Namun mereka berpaling dari keimanan kepadanya dan enggan mengikutinya karena lebih mementingkan kehidupan dunia dibandingkan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 146: Allah mengabarkan bahwasannya yahudi dan nasrani akan mengetahui Muhammad ﷺ dan bahwasannya Muhammad adalah utusan Allah ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengabarkan bahwa ahli kitab telah yakin dan mengetahui bahwa Muhammad adalah seorang rasul, dan apa yang Beliau bawa adalah hak (benar). Mereka meyakininya sebagaimana mereka meyakini anak-anak mereka sendiri dan mereka bisa membedakannya dengan yang lain. Oleh karena itu, pengetahuan mereka telah sampai kepada tingkatan yakin yang tidak dimasuki keraguan, akan tetapi kebanyakan mereka kafir kepada Beliau, menyembunyikan persaksian tersebut padahal mereka mengetahuinya. Dalam ayat di atas, terdapat hiburan bagi rasul dan kaum mukmin serta mengingatkan mereka agar berhati-hati terhadap tindakan jahat orang-orang ahli kitab dan syubhat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 146",
    "description": "Allah menjelaskan bahwa pengetahuan orang yahudi dan nasrani tentang benarnya kenabian nabi Muhammad terang benderang. Orangorang yang telah kami beri kitab taurat dan injil mengenalnya, yakni nabi Muhammad, seperti mereka mengenal anak-anak mereka sendiri, bahkan lebih dari itu, karena anak mereka bisa jadi berasal dari hubungan dengan orang lain. Kemudian Allah membuka sifat buruk mereka yang suka menyembunyikan kebenaran hanya untuk kepentingan duniawi. Sesungguhnya sebagian mereka pasti menyembunyikan kebenaran, padahal mereka mengetahui-Nya. Inilah yang menjadikan mereka dibenci Allah, yaitu mengetahui kebenaran tetapi mengingkarinya secara sengaja. Untuk memantapkan hati orang-orang yang baru masuk islam dan umat nabi Muhammad di masa mendatang tentang kebenaran ajarannya, Allah menegaskan bahwa kebenaran itu datang dari tuhanmu, wahai nabi Muhammad, maka janganlah sekali-kali engkau termasuk orangorang yang ragu."
  }
]