[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang diturunkan kepadamu -wahai nabi- itulah kebenaran dari Tuhanmu, maka janganlah kamu termasuk orang-orang yang meragukannya. Hal ini sekalipun merupakan pesan yang dialamatkan kepada Rasulullah Shallallahu Alaihi Wasallam tetapi ia juga dialamatkan kepada umat Islam ini seluruhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "147. Inilah kebenaran yang datang dari Tuhanmu. Maka jangan sekali-kali engkau -wahai Rasul- termasuk orang-orang yang meragukan kebenarannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "147. Hai Rasulullah, ketahuilah bahwa kebenaran adalah yang Tuhanmu kabarkan kepadamu dalam al-Qur’an, maka janganlah kamu termasuk orang-orang yang meragukan perbuatan orang-orang Yahudi dan Nasrani dalam menyembunyikan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "147. الْحَقُّ مِنْ رَبِّكَ ۖ (Kebenaran itu adalah dari Tuhanmu) Yakni kebenaran adalah yang datang dari Tuhanmu, dan bukan yang dikabarkan oleh Ahli kitab. فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ (sebab itu jangan sekali-kali kamu termasuk orang-orang yang ragu) Yakni Allah melarang Rasulullah dari keraguan terhadap apa yang datang dari-Nya seperti pada masalah kiblat dan yang lainnya. Dan selain Rasulullah lebih harus berhati-hati dari keraguan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "147. Kebenaran yang abadi (mutlak) adalah sesuatu yang diberitahukan Tuhan kepadamu, bukan sesuatu yang diberitahukan ahli kitab, Jadi janganlah kalian menjadi orang-orang yang meragukanNya, wahai para pendengar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kebenaran itu dari Tuhanmu. Maka jangan sekali-kali kamu termasuk orang-orang yang ragu} orang-orang yang ragu dengan kebenarannya sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147. “Kebenaran itu adalah dari Tuhanmu” maksudnya, kebenaran ini adalah hal yang paling benar untuk dinamakan sebagai kebenaran dari segala sesuatu, karena apa yang ia kandung dari cita-cita yang tinggi, perintah-perintah yang baik, penyucian jiwa, mengajaknya kepada hal-hal yang mendatangkan manfaat dan menolak mudharat adalah bersumber dari Tuhanmu, dan yang termasuk dalam bimbinganNya bagimu adalah bahwa Dia menurunkan kepadamu Alquran yang berisi pendidikan bagi akal, jiwa dan segala kemaslahatan. “Sebab itu janganlah sekali-kali kamu termasuk orang-orang yang ragu,” yakni, jangan sampai ada sedikit keraguan dan kebimbangan darimu, akan tetapi renungkan dan pikirkanlah hal itu hingga kamu sampai kepada keyakinan, karena berpikir tentangnya sudah pasti akan menghilangkan keraguan dan akan menyampaikan kepada keyakinan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مِنَ ٱلۡمُمۡتَرِينَ } Minal mumtarin : Orang-orang yang ragu. Dan al-Imtiraa’ maknanya adalah keraguan dan tidak percaya. Makna ayat : Pada ayat (147) Allah Ta’ala menjelaskan bahwa agama yang dibawa olehnya adalah benar. Itu adalah kebenaran yang datang kepadanya dari Allah Ta’ala, maka tidak sepantasnya untuk merasa ragu sedikitpun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 147: Ketahuilah wahai nabi Allah bahwasannya yang diturunkan kepadamu adalah Al-Qur’an Al Karim yang merupaka kebenaran dari tuhanmu; maka jangankah engkau menjadi orang-orang yang rajin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan sampai masih menancap di hati keraguan meskipun sedikit. Agar seseorang lebih yakin lagi hendaknya memikirkan isinya, karena dengan memikirkan isinya dapat menghilangkan keraguan dan memperoleh keyakinan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 147",
    "description": "Untuk memantapkan hati orang-orang yang baru masuk islam dan umat nabi Muhammad di masa mendatang tentang kebenaran ajarannya, Allah menegaskan bahwa kebenaran itu datang dari tuhanmu, wahai nabi Muhammad, maka janganlah sekali-kali engkau termasuk orangorang yang ragu. Dan setiap umat mempunyai kiblat yang dia menghadap kepadanya. Tidak ada kelebihan satu kiblat atas lainnya, karena yang terpenting dalam beragama adalah kepatuhan kepada Allah dan berbuat kebaikan terhadap orang lain. Maka berlomba-lombalah kamu dalam kebaikan. Terhadap semua itu Allah akan memberikan perhitungan. Di mana saja kamu berada, pasti Allah akan mengumpulkan kamu semuanya. Sungguh, Allah mahakuasa atas segala sesuatu."
  }
]