[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi tiap-tiap umat ada kiblat yang masing-masing darinya menghadap kepadanya dalam ibadah shalatnya, maka bersegeralah –wahai orang-orang yang beriman- untuk berlomba dalam mengerjakan amal amal sholeh yang disyariatkan Allah untuk kalian dalam Islam. Dan Allah akan menghimpun Kalian semua pada hari kiamat dari daerah manapun kalian berada. Sesungguhnya Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Setiap umat mempunyai arah tertentu yang mereka jadikan sebagai kiblat, baik sifatnya kongkrit maupun abstrak. Salah satunya ialah perselisihan mereka tentang arah kiblat dan apa yang Allah syariatkan untuk mereka. Jadi, tidak ada masalah bila arah kiblat mereka bermacam-macam, jika hal itu berdasarkan perintah dan ketentuan Allah. Maka berlomba-lombalah kamu -wahai orang-orang beriman- untuk melakukan kebajikan yang diperintahkan kepadamu. Dan kelak pada hari kiamat Allah akan mengumpulkan kalian dari manapun kalian berasal untuk memberimu balasan yang setimpal dengan amal perbuatanmu. Sesungguhnya Allah Mahakuasa atas segala sesuatu. Maka tidak ada sesuatupun yang dapat menghalangi-Nya untuk mengumpulkanmu dan memberikan balasan kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Dan setiap umat memiliki kiblat tersendiri untuk menghadap dalam sholatnya, maka bergegaslah hai orang-orang yang beriman untuk mengerjakan kebaikan dan amal shalih. Dan Allah akan membangkitkan kalian semua pada hari kiamat; Dia Maha Kuasa atas segala sesuatu, tak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. وَلِكُلٍّ وِجْهَةٌ (Dan bagi tiap-tiap umat ada kiblatnya (sendiri)) Yakni setiap umat beragama memiliki arah (kiblat), baik itu kiblat yang benar maupun kiblat yang sesat. Atau yang dimaksud dengan ayat ini adalah setiap umat Muhammad memiliki kiblat untuk sholat, baik itu di mengarah kea rah timur, barat, selatan, atau utara. هُوَ مُوَلِّيهَا ۖ (yang ia menghadap kepadanya) Yakni yang ia mernghadap ke arahnya. فَاسْتَبِقُوا الْخَيْرَاتِ ۚ (Maka berlomba-lombalah (dalam membuat) kebaikan) Yakni bersegeralah untuk menjalankan perintah-Nya seperti menghadap ke Baitul Haram dan menjalankan segala kebaikan, dan menjalankan sholat di awal waktunya. أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ (Di mana saja kamu berada pasti Allah akan mengumpulkan kamu) Yakni mengumpulkan kalian di hari kiamat untuk membalas perbuatan yang kalian lakukan. جَمِيعًا ۚ(seluruhnya) Yakni sholat kalian dari arah yang berbeda-beda akan tetapi seperti ke satu arah saja."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ } Sebagai isyarat keberagaman manusia dalam beramal dan beribadah, antara shalat dan belajar dan dakwah serta memberi makan dan minum, semuanya telah dimudahkan terhadap apa yang diciptakan untuknya, akan tetapi yang terpenting adalah setiap orang senantiasa terdepan disetiap kebaikan yang ia lakukan dan senantiasa mengukur diri, dan disini al-Qur'an membimbing kita agar menjadi insan yang terdepan. 2 ). { فَاسْتَبِقُوا الْخَيْرَاتِ } Perintah untuk berlomba-lomba dalam kebaikan adalah tambahan dari perintah berbuat kebaikan itu sendiri; adapun maksud dari berlomba-lomba dalam kebaikan termasuk didalamnya penyempurnaan amalan, dan pengaplikasiaannya sesempurna mungkin, dan senantiasa bergegas meraih kebaikan itu, dan barangsiapa yang berlomba-lomba di dunia dalam melakukan kebajikan, niscaya dia akan menjadi terdepan di akhirat menuju surga. 3 ). Merupakan bisnis yang menguntungkan, dan persaingan menuju surga dibuka pintu-pintunya pada malam lailatul qadr, dan panggilan al-Qur'an sungguh meninggi : { فَاسْتَبِقُوا الْخَيْرَاتِ }, dan diantara kerugian yang besar adalah dijadikannya kesempatan berbisnis dengan Allah, dan musim-musim kebaikan yang mengantarkan pelakunya kepada kemenangan di akhirat sama seperti waktu-waktu lainnya bagi sebagian besar umat manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148. Masing-masing kelompok dari berbagai pengikut agama itu memiliki kiblat yaitu arah yang mereka hadap ketika shalat, lalu mereka saling berlomba berbuat ketaatan, amal baik dan menghadap kiblat. Dimanapun tempat kalian di bumi, Allah akan tetap mengumpulkan kalian pada hari kiamat untuk dibalas. Sesungguhnya Allah itu Maha Kuasa untuk membangkitkan dan mengumpulkan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi setiap umat ada kiblat yang dia menghadap ke arahnya} masing-masing pemeluk agama memiliki kiblat yang mereka menghadap kepadanya {Maka berlomba-lombalah kalian dalam berbagai kebajikan. Di mana pun kalian berada, pasti Allah akan mengumpulkan kalian semua. Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "148. Maksudnya, setiap pemeluk suatu agama atau ajaran pasti memiliki arah yang menjadi tujuan ketika beribadah, dan masalahnya bukan menghadap kiblat, karena sesungguhnya dia adalah sebuah syariat di mana waktu dan kondisi kita berubah, dan terkena hukum nasakh dan peralihan dari suatu arah ke arah yang lain, akan tetapi masalahnya adalah dalam menunaikan ketaatan kepada Allah, mendekatkan diri kepada-Nya, dan memohon derajat darinya. Inilah tanda-tanda kebahagiaan dan kecintaan, yaitu sesuatu hal yang bila Jiwa tidak bersifat dengannya, niscaya akan mengakibatkan kerugian dunia dan akhirat, sebagaimana juga bila dia bersifat dengannya, maka itulah keuntungan yang sesungguhnya. Ini adalah suatu perkara yang telah disepakati dalam seluruh syariat, karena Allah menciptakan makhluk untuk hal itu dan Dia perintahkan kepadanya. Perintah untuk berlomba kepada kebaikan merupakan suatu yang lebih dari sekadar perintah untuk berbuat baik, karena berlomba berbuat kebaikan meliputi beberapa hal, yaitu dengan melakukannya, menyempurnakannya, dan menempatkannya dalam bentuk yang paling sempurna, serta bersegera kepadanya. Barangsiapa yang berlomba kepada kebaikan di dunia, maka dia akan menjadi pemenang di akhirat dengan surga, dan orang-orang yang terdepan dalam perlombaan adalah makhluk yang paling tinggi derajatnya. Kebaikan itu meliputi segala hal yang diwajibkan dan disunahkan, seperti shalat, puasa, zakat, haji, umroh, dan Jihad serta Memberikan manfaat secara luas maupun sempit Ketika suatu hal yang paling mendorong jiwa untuk berlomba-lomba kepada kebaikan dan menggiatkan nya adalah apa yang dijanjikan oleh Allah terhadapnya dari pahala, maka Allah berfirman, “Di mana saja kamu berada pasti Allah akan mengumpulkan kamu sekalian pada hari kiamat Sesungguhnya Allah Maha penguasa atas segala sesuatu,” Allah akan mengumpulkan kalian pada hari kiamat dengan kuasaNya, kemudian Allah akan membalas segala perbuatan setiap orang sesuai dengan perbuatannya, \"Dia memberi balasan kepada orang-orang yang berbuat jahat terhadap apa yang telah mereka kerjakan dan memberi balasan kepada orang-orang yang berbuat baik dengan pahala yang lebih baik (surga).\" QS an-najm ayat 31. Ayat yang mulia ini dapat dijadikan dalil untuk mengadakan setiap hal yang mulia yang berkaitan dengan suatu perbuatan, seperti shalat pada awal waktu, bersegera dalam menunaikan kewajiban, seperti puasa, haji, umroh, mengeluarkan zakat, mengerjakan sunah-sunah Ibadah dan adab-adabnya. Sungguh hanya milik Allah sajalah ayat yang sangat lengkap dan paling bermanfaat ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ } Wa likullin wijhatun huwa muwallihaa : Pada harakat tanwin dalam kata (kullin) menunjukkan ada kata yang dihapus. Yaitu likulli ahli millatin setiap pemeluk agama seperti Islam, Yahudi, dan Nasrani memiliki kiblat yang dijadikan tempat menghadap tatkala melaksanakan shalat. { ٱلۡخَيۡرَٰتِۚ } al-Khairaat : Kebaikan dan ketaatan kepada Allah dan rasulNya Makna ayat : Setelah penetapan hakikat yang terkandung dalam ayat (وَلَئِنۡ أَتَيۡتَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ ) “Dan sesungguhnya jika kamu mendatangkan kepada orang-orang (Yahudi dan Nasrani) yang diberi al-Kitab (Taurat dan Injil)”. Maksudnya apabila Nabi Muhammad ﷺ mendatangi Ahli kitab dengan membawa segudang bukti yang menunjukkan kebenaran dalam perintah perubahan kiblat, mereka tetap tidak akan mengikuti kiblatnya kaum Muslimin, sebagaimana Nabi juga tidak akan mengikuti kiblat mereka, dan sebagian di antara mereka tidak akan mengikuti kiblat yang lain. Seperti halnya orang Yahudi menghadap tempat terbitnya matahari sebagai kiblat, dan orang Nasrani menghadap Baitul Maqdis sebagai kiblatnya. Kemudian Allah Ta’ala mengabarkan bahwa setiap umat memiliki kiblatnya masing-masing dalam shalat. Maka tinggalkanlah agama-agama yang sesat itu wahai kaum Muslimin, dan berlomba-lombalah berbuat kebaikan, berpaculah dalam amalan shalih sebagai bentuk kesyukuran kepada Rabb kalian karena telah memberikan arah kiblat yang merupakan kiblat bapak kalian Nabi Ibrahim. Sesungguhnya Dialah Allah yang akan mengumpulkan kalian pada hari kiamat, menanyai apa yang kalian lakukan, dan akan membalas amalan-amalan kalian. Dia Maha Mampu atas segala sesuatu. Pelajaran dari ayat : • Berpaling dari perdebatan dengan orang-orang yang membangkang, dan memilih untuk mengerjakan amalan ketaatan, berlomba-lomba mengerjakanya itu lebih bermanfaat dibandingkan larut dalam perdebatan dengan orang yang tidak bisa diharapkan untuk kembali kepada kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 148: Allah mengabarkan setiap pengikut agama memiliki syariat dan kiblat yang beribadah mengarah padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Masing-masing umat memiliki kiblat sendiri dalam ibadahnya. Menghadap kiblat tertentu termasuk syari'at yang bisa berubah tergantung situasi dan kondisi serta zamannya, ia bisa dimasuki oleh naskh dan mengalami perubahan dari arah tertentu kepada arah yang lain. Hal ini menunjukkan bahwa yang menjadi tujuan utama adalah menta'ati perintah Allah Subhaanahu wa Ta'aala dan menjauhi larangan-Nya serta mendekatkan diri kepada-Nya, inilah tanda kebahagiaan. Perintah berlomba-lomba dalam kebaikan lebih dalam daripada sebatas perintah mengerjakan kebaikan. Dalam perintah ini mengandung perintah mengerjakannya, menyempurnakannya, melakukannya sebaik mungkin dan bersegera kepadanya. Barangsiapa yang bersegera kepada kebaikan ketika di dunia, maka dia adalah orang yang lebih dulu ke surganya. Oleh karena itu, mereka yang berlomba-lomba dalam kebaikan adalah orang yang paling tinggi derajatnya. Dan kata \"kebaikan\" di sini mencakup semua amalan fardhu maupun sunat, baik berupa shalat, puasa, zakat, hajji, Umrah, jihad, manfa'at bagi orang lain maupun sebatas untuk diri sendiri. Karena pendorong yang paling kuat agar seseorang dapat bersegera kepada kebaikan dan bersemangat kepadanya adalah pahala yang dijanjikan Allah Subhaanahu wa Ta'aala, maka Dia berfirman seperti yang disebutkan di atas; yakni Allah Subhaanahu wa Ta'aala akan mengumpulkan kita semuanya di mana saja kita berada dengan kekuasaan-Nya, dan Dia akan memberikan balasan kepada setiap orang yang beramal, jika amalnya buruk, maka Dia akan membalas sesuai amal yang dikerjakannya dan jika baik, maka Dia akan membalas dengan berlipat ganda dan memberikan balasan yang terbaik (surga). Ayat yang mulia ini juga mengandung perintah untuk segera melaksanakan kewajiban seperti shalat di awal waktu, segera membayar hutang puasa dan segera berhajji serta anjuran untuk melaksanakan amalan-amalan sunat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 148",
    "description": "Dan setiap umat mempunyai kiblat yang dia menghadap kepadanya. Tidak ada kelebihan satu kiblat atas lainnya, karena yang terpenting dalam beragama adalah kepatuhan kepada Allah dan berbuat kebaikan terhadap orang lain. Maka berlomba-lombalah kamu dalam kebaikan. Terhadap semua itu Allah akan memberikan perhitungan. Di mana saja kamu berada, pasti Allah akan mengumpulkan kamu semuanya. Sungguh, Allah mahakuasa atas segala sesuatu. Allah mengulangi lagi perintah untuk menghadap masjidilharam. Dan dari mana pun engkau keluar, wahai nabi Muhammad, hadapkanlah wajahmu ke arah masjidilharam, sesungguhnya itu benar-benar ketentuan dari tuhanmu. Allah tidak lengah terhadap apa yang kamu kerjakan. Pengulangan ini penting karena peralihan kiblat merupkan peristiwa nasakh (penghapusan hukum) yang pertama kali terjadi dalam islam. Dengan diulang maka hal ini akan tertanam dalam hati kaum mukmin sehingga mereka tidak terpengaruh oleh hasutan orang yahudi yang tidak rela kiblat mereka ditinggal."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini membahas tentang masalah kiblat yang dijadikan sebagai pusat arah ibadah setiap pemeluk agama. Nabi lbrahim saat masa dakwah, arah kiblatnya mengarah ke Masjidil Haram. Adapun ummat Yahudi memiliki arah kiblat ke Baitul Maqdis, sedangkan ummat Kristen (Nasrani) arah kiblat mereka ke arah timur. Nabi-nabi yang lain semua memiliki arah kiblat mereka menurut syari'at dan waktu masing-masing, sebagaimana umat Nabi Muhammad (kita) pun mempunyai kiblat. Tetapi kiblat bukanlah hakikat dari ibadah itu sendiri, kiblat bukanlah tujuan dari ibadah sebagaimana Allah terangkan dalam ayat di atas, sebab bagi Allah timur dan barat sama saja, karenanya arah kiblat berubah-ubah bersama perubahan Nabi. Yang menjadi tujuan utama ibadah adalah ialah menghadapkan hati menuju Allah, Tuhan yang menciptakan seluruh alam raya, itulah wijhah (tujuan) dari ibadah. Al-aufi meriwayatkan dari Ibnu Abbas, yang dimaksud dengan pengertian “tiap-tiap umat mempunyai kiblatnya yang ia menghadap kepada nya” adalah semua pemilik agama memiliki arah kiblatnya masing-masing. Dengan kata lain setiap kabilah dan setiap pemeluk agama memiliki kiblat yang ia sukai untuk menghadap kepadanya. Sedangkan kiblat yang diridoi Allah hanyalah kiblat orang-orang mukmin yang mereka menghadap kepadanya. Abul Aliyah mengatakan makna dari ayat ini adalah bahwa orang Yahudi mempunyai kiblatnya yang mereka menghapad kepadanya disetiap peribadahan yang mereka kerjakan, begitu juga orang-orang Nasroni . merekapun mempunyai kiblat tersendiri yang mereka jadikan pusat arah peribadahan yang mereka kerjakan. Akan tetapi Allah memeberi petunjuk kepada kalian wahai umat nabi Muhammad sholallohu ‘alaihi wasallam untuk menghadap kiblat yang sesungguhnya. Demikian pula telah diriwayatkan makna yang serupa dengan makna yang disebutkan Abul “Aliyah dari Imam Mujahid, Imam Atho’, imam Adhohak, Imam Robi’ bin Anas dan Imam Assadi. Imam mujahid mengatakan dalam riwayat yang lain, bahwa Allah Subhanahu wa Ta'ala memerintahkan kepada seluruh kaum dan pemeluk agama agar menghadap ke ka’bah dan menjadikannya sebagai kiblat mereka dalam sholat. Ayat ini serupa dengan ayat yang lain yaitu yang terdapat dalam surat Al-Maidah ayat 48 Allah berfirman : لكل جعلنا منكم شرعة ومنهاجا ولو شاء الله لجعلكم أمة واحدة ولكن ليبلوكم في ما آتاكم فاستبقوا الخيرات إلى الله مرجعكم جميعا Untuk tiap-tiap umat diantara kamu, Kami berikan aturan dan jalan yang terang. Sekiranya Allah menghendaki, niscaya kamu dijadikan-Nya satu umat (saja), tetapi Allah hendak menguji kamu terhadap pemberian-Nya kepadamu, maka berlomba-lombalah berbuat kebajikan. Hanya kepada Allah-lah kembali kamu semuanya [Al-Maidah : 48] Ketika sudah jelas bahwa setiap ummat memiliki arah kiblatnya masing-masing, dan setiap dari mereka merasa bahwa arah kiblat mereka yang benar sehingga menimbulkan pertengkaran dan perselisihan, maka Allah Subhanahu wa Ta'ala memberikan petunjuk kepada ummat Nabi Muhammad agar tidak berlarut dalam perselisihan arah kiblat tersebut, tetapi hendaklah memaksimalkan amal kebaikan. Sebagaimana firman-NYA : فاستبقوا الخيرات \"Maka berlomba-lombalah berbuat kebajikan.\" Perintah untuk berlomba-lomba dalam kebiakan itu lebih dari sekedar perintah melaksanakan kebaikan. Ketika orang Yahudi, Nasrani dan pemeluk agama lain mempunyai acuan dan standar kebaikan menurut ajaran mereka masing-masing, maka umat islam pun harus bersegera dan berlomba dalam mengerjakan kebaikan sebagaimana diajarkan dalam syariat islam yang meliputi hal-hal yang wajib maupun yang sunnat seperti sholat, zakat, shaum, haji, umroh, jihad dan syariat lainnya. أَيْنَمَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ Allah Subhanahu wa Ta'ala akan memberikan balasan pahala sesuai dengan ukuran amal kebaikan yang dikerjakan. Dan pada ahirnya Allah dengan kekuasaan-NYA akan mengumpulkan seluruh manusia dari berbagai tempat dan ajaran mereka dan membalasnya sesuai dengan amalan mereka. Maka ayat ini dijadikan dalil untuk melaksanakn segala jenis kebaikan dengan penuh kesempurnaan untuk mendapatkan fadilah yang terbaik seperti sholat di awal waktunya, bersegera melaksanakan shaum, membayar zakat dan menunaikan ibadah haji. Dan Allah lah yang akan membalas segala amalan hamba-NYA Sebagaimana firman-NYA : لِيَجْزِيَ الَّذِينَ أَسَاءُوا بِمَا عَمِلُوا وَيَجْزِيَ الَّذِينَ أَحْسَنُوا بِالْحُسْنَى “Supaya Dia memberi balasan kepada orang-orang yang berbuat jahat terhadap apa yang telah mereka kerjakan dan memberi balasan kepada orang-orang yang berbuat baik dengan pahala yang lebih baik (surga)” [An-Najm :31]"
  }
]