[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dari tempat manapun kamu keluar -wahai nabi- dalam keadaan musafir, dan kamu hendak mengerjakan shalat, maka hadapkanlah wajahmu ke arah Masjidil Haram. Dan sesungguhnya posisimu menghadap kepadanya benar-benar merupakan kebenaran yang sudah tetap dari Tuhanmu. Dan Allah tidak lengah terhadap apa yang kalian perbuat dan Dia akan memberikan balasan kepada kalian atas semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Dari manapun dan di manapun engkau -wahai Nabi - dan para pengikutmu, jika engkau hendak menunaikan salat maka menghadaplah ke arah Masjidil Haram, karena itu adalah kebenaran yang diwahyukan kepadamu dari Rabbmu. Allah tidak lalai terhadap apa yang kamu perbuat. Dia senantiasa melihat perbuatanmu dan akan memberimu balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149-150. Allah memerintahkan Rasulullah dan umatnya untuk memperhatikan arah kiblat mereka agar menghadap Ka’bah: “Dari manapun kamu bepergian maka tetaplah menghadap Ka’bah dalam shalatmu. Ini merupakan perintah yang ditetapkan Allah, dan Dia tidak lalai terhadap apa yang kalian kerjakan, kemudian Dia akan membalas kalian atas amalan itu. Dan dimanapun kamu berada maka menghadaplah ke arah Ka’bah dalam shalatmu. Dan di negeri manapun kalian hai kaum muslimin maka menghadaplah ke arah Ka’bah, agar orang-orang yang menyelisihi kalian tidak mendebat kalian dalam urusan kiblat. Namun orang-orang yang menyukai permusuhan akan tetap mendebatmu, maka janganlah kalian takut terhadap mereka, namun takutlah kepada-Ku agar Aku sempurnakan karunia-Ku kepada kalian dan agar kalian mendapat petunjuk untuk senantiasa mengikuti kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149. Wahai orang muslim, dimanapun kalian berada baik di darat ataupun laut, dan dimanapun arah kalian baik timur ataupun barat, tetap arahkanlah pandangan kalian ketika shalat kea rah Masjidil Haram. Arah ini adalah kebenaran pasti dari Allah yang tidak bisa diragukan dan Dia akan memberi penghargaan jika mengikutinya. Dan Allah itu tidak akan melupakan amal yang telah kalian perbuat, sehingga tidak ada satupun yang tersisa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari mana pun kamu keluar} dari tempat manapun kamu keluar {hadapkanlah wajahmu ke arah Masjidil haram. Sesungguhnya itu pasti kebenaran dari Tuhanmu. Allah tidak lengah terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149. Maksudnya “Dan dari mana saja kamu keluar” dalam perjalananmu atau selainnya; dan ini bersifat umum, “maka palingkanlah wajahmu ke arah Masjidil Haram,” maksudnya, menghadaplah kepadanya kemudian Allah mengarahkan firman-nya kepada seluruh umat secara umum,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Lantas Allah Ta’ala memerintahkan rasulNya agar memalingkan wajahnya menghadap Masjidil Haram dimanapun berada baik ketika muqim (menetap) atau sedang bepergian, dan Allah memberitahukan bahwa perubahan kiblat itu adalah benar berasal dari Rabbnya maka jangan sampai merasa bimbang dan ragu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 149: Allah mengarahkan firman-Nya kepada nabi-Nya agar menyampaikan kepada umatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni keluar bersafar atau keperluan lainnya, kemudian hendak mendirikan shalat. Pada ayat di atas menggunakan dua penguat, huruf \"inna\" dan \"lam\" (sesungguhnya dan benar-benar) agar tidak perlu lagi ragu dan agar tidak timbul perkiraan bahwa perintah menghadap ke Ka'bah itu hanyalah karena lebih enak, bahkan ia merupakan perintah yang sesungguhnya. Yakni bagaimana pun keadaan kita, Dia senantiasa memperhatikan dan melihatnya. Hal ini menghendaki agar kita tetap menjaga perintahnya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 149",
    "description": "Allah mengulangi lagi perintah untuk menghadap masjidilharam. Dan dari mana pun engkau keluar, wahai nabi Muhammad, hadapkanlah wajahmu ke arah masjidilharam, sesungguhnya itu benar-benar ketentuan dari tuhanmu. Allah tidak lengah terhadap apa yang kamu kerjakan. Pengulangan ini penting karena peralihan kiblat merupkan peristiwa nasakh (penghapusan hukum) yang pertama kali terjadi dalam islam. Dengan diulang maka hal ini akan tertanam dalam hati kaum mukmin sehingga mereka tidak terpengaruh oleh hasutan orang yahudi yang tidak rela kiblat mereka ditinggaldan dari mana pun engkau keluar, wahai nabi Muhammad, maka hadapkanlah wajahmu ke arah masjidilharam. Dan di mana saja kamu berada, wahai umat islam, maka hadapkanlah wajahmu ke arah itu. Demikianlah, Allah mengalihkan kiblat agar tidak ada alasan bagi manusia untuk menentangmu; agar orang yahudi tidak bisa lagi berkata, mengapa Muhammad menghadap baitulmakdis, padahal disebutkan dalam kitab-kitab kami bahwa dia menghadap kakbah' dan agar orang musyrik tidak bisa lagi berkata, mengapa Muhammad menghadap ke baitulmakdis dan meninggalkan kakbah yang dibangun oleh kakeknya sendiri' dengan pengalihan ini maka ucapan-ucapan itu terjawab, kecuali orang-orang yang zalim di antara mereka. Mereka akan terus mendebat nabi dan berkata, Muhammad menghadap kakbah karena mencintai agama kaumnya dan tanah airnya. Terkait sikap orang-orang tersebut, Allah berkata kepada nabi dan para sahabatnya, janganlah kamu takut kepada mereka, tetapi takutlah kepada-ku, agar aku sempurnakan nikmat-ku kepadamu, dan agar kamu mendapat petunjuk. Pengalihan kiblat ke kakbah adalah kenikmatan yang besar karena umat islam mempunyai kiblat sendiri sampai akhir zaman, dan dengan demikian mereka mendapatkan hidayah dari Allah dalam melaksanakan perintah-perintah Allah."
  }
]