[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah akan membalas ejekan mereka dan menunda menyiksa mereka supaya mereka kian bertambah besar dalam kesesatan dan kebimbangan dan semakin ragu-ragu, dan Allah akan membalas mereka atas olok-olok mereka terhadap kaum Mukmin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Allah mengolok-olok mereka untuk membalas tindakan mereka yang telah mengolok-olok orang-orang mukmin, sebagai balasan yang setimpal dengan perbuatan mereka. Oleh karena itu, di dunia Allah memberlakukan kepada mereka ketentuan hukum yang sama dengan kaum muslimin. Adapun di akhirat, Allah akan memberikan balasan yang setimpal dengan kekafiran dan kemunafikan mereka. Dan Allah menangguhkan siksa mereka agar mereka terus bergelimang dalam kesesatan dan kejahatan mereka, sehingga mereka senantiasa diliputi kebingungan dan kebimbangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. Allah menyebutkan balasan atas olok-olok mereka, yaitu dengan mengolok-olok mereka pula dan menangguhkan siksaan bagi mereka agar mereka terus menerus berbuat dosa dan kufur dan dalam keadaan kebingungan. Mereka jauh dari kebenaran dan lebih memilih kesesatan daripada petunjuk, mereka seperti pembeli yang begitu ingin membeli barang yang merugikan sehingga mereka tidak mendapat keuntungan sama sekali. Mereka mengharamkan diri mereka dari petunjuk dan tenggelam dalam kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. اللَّهُ يَسْتَهْزِئُ بِهِمْ (Allah akan (membalas) olok-olokan mereka) yakni Allah Ta’ala kemudian menurunkan kepada mereka kehinaan, membalas perbuatan mereka, dan merendahkan mereka sebagai pembelaan kepada orang-orang mukmin. وَيَمُدُّهُمْ (dan membiarkan mereka) Yakni tidak menghiraukan mereka فِي طُغْيَانِهِمْ يَعْمَهُونَ (terombang-ambing dalam kesesatan mereka) Yakni yang berada dalam kekufuran yang berlarut-larut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah membalas olok-olok mereka, meremehkan mereka, mendikte mereka dan menjerumuskan mereka dalam kesesatan. Dan mereka ragu dan bingung (memilih) antara kekafiran dan keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah akan mengolok-olok mereka} Allah akan mengolok-olok dan membalas ejekan mereka {dan membiarkan mereka} mengabaikan mereka dan memberi mereka tenggang waktu {dalam kesesatan mereka} dalam kekufuran dan kesesatan mereka {terombang-ambing} mereka kebingungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Allah ta’ala berfirman, “Allah akan membalas olok-olok mereka dan membiarkan mereka terombang-ambing dalam kesesatan mereka.” Ini merupakan balasan bagi mereka atas tindakan mereka mengolok-olok hamba-hambaNya, dan di antara olok-olokan Allah kepada mereka adalah bahwa Dia menghiasi kondisi mereka dalam kesengsaraan dan keadaan yang buruk hingga mereka mengira bahwasanya mereka bersama kaum Mukminin ketika Allah tidak memerintahkan kaum Mukminin menghancurkan mereka, dan juga di antara olok-olokan Allah kepada mereka pada Hari Kiamat kelak adalah bahwasanya Dia akan memberikan mereka (ketika ) bersama kaum Mukminin cahaya yang jelas, maka apabila kaum Mukminin berjalan dengan cahaya mereka, padamlah cahaya kaum munafik dan mereka tetap berada dalam kegelapan setelah terang benderang dalam kondisi kebingungan, dan betapa besar penyesalan itu setelah ketamakan. \"Orang-orang munafik itu memanggil mereka (orang-orang mukmin) seraya berkata: “Bukankah kami dahulu bersama-sama dengan kamu?” Mereka menjawab: “Benar, tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu-ragu serta ditipu oleh angan-angan kosong sehingga datanglah ketetapan Allah; dan kamu telah ditipu terhadap Allah oleh (syaitan) yang amat penipu.\" (QS. Al-Hadid : 14) FirmanNya, ”Dan membiarkan mereka, ” maksudnya menambahkan (waktu) buat mereka, ”dalam kesesatan mereka, ” maksudnya dalam kejahatan dan kekufuran mereka, (dan mereka) “terombang-ambing” maksudnya dalam kebingungan dan kebimbangan; dan inilah cara Allah ta’ala mengolok-olok mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : طُغۡيَٰنِهِمۡ Ath-Thughyaan artinya melewati batas dalam suatu perkara dan berlebih-lebihan di dalamnya. Al-‘Amah yaitu julukan bagi orang yang buta hatinya, sebagaimana al-Ama berarti buta pada penglihatannya. Tidak bisa melihat akibat dari kebingunan dan kesesatannya. Makna ayat : Pada ayat berikutnya (15) Allah mengabarkan bahwa Dia mengolok-olok mereka sebagai balasan setimpal atas perbuatan mereka serta menambah melampaui batasannya, kebimbangan hatinya dan kegoncangan jiwanya serta kesesatan pikirnya, sesuai sunnatullah bahwa keburukan akan melahirkan keburukan. Pelajaran dari ayat : Ada sebagian manusia yang menjadi setan dengan mengajak kepada kekufuran dan kemaksiatan, menyuruh perbuatan munkar dan melarang perbuatan baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 15: Allah menjelaskan bahwasanya balasan bagi mereka atas olok-olok mereka dan ejekan mereka kepada hamba Allah yang beriman adalah olok-olok pula terhadap mereka ; maka mereka akan dibiarkan agar supaya bertambah kesesatan mereka , sehingga mereka tidak menyadari atas apa yang telah mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sifat tersebut \"mengolok-olok\" menjadi sifat sempurna dalam keadaan \"jika menghadapi orang-orang yang melakukan perbuatan seperti itu,” karena yang demikian menunjukkan bahwa yang memilikinya juga memiliki kemampuan untuk membalas musuhnya dengan melakukan tindakan yang sama atau lebih, dan sifat tersebut tentu akan menjadi sifat kekurangan dalam keadaan selain ini. Oleh karena itu, ia sebagai sifat bagi Allah Ta'ala namun tidak secara mutlak dan tidak menjadi nama-Nya. Allah Ta'ala membiarkan mereka agar bertambah sesat, bingung dan bimbang serta memberikan balasan olok-olokkan yang mereka lakukan kepada kaum mukmin. Di antara olok-olokkan-Nya kepada mereka (kaum munafik) adalah dengan dihiasnya perbuatan yang menyebabkan mereka sengsara dan dihiasnya keadaan yang buruk, termasuk olok-olokkan-Nya kepada mereka pada hari kiamat adalah dengan diberikan-Nya kepada mereka dan kepada kaum mukmin cahaya yang nampak, ketika kaum mukmin berjalan dengan cahayanya, tiba-tiba cahaya mereka (kaum munafik) padam sehingga mereka dalam kegelapan lagi bingung. Alangkah besarnya putus asa jika awalnya didahului oleh harapan yang berada di depan mata. Memang, orang-orang munafik memperoleh manfa'at dari kekafiran yang mereka sembunyikan; darah dan harta mereka selamat, demikian juga memperoleh keamanan, namun bisa saja maut datang menjemput sehingga yang mereka peroleh hanyalah kegelapan kubur, kegelapan kufur, kegelapan nifak (kemunafikan) dan kegelapan maksiat sesuai jenisnya, setelah itu adalah neraka dan neraka itulah tempat kembali yang paling buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 15",
    "description": "Sebagai balasan atas perbuatan mereka itu, Allah akan memperlakukan mereka seperti orang yang memperolok-olokkan dan merendahkan mereka, dan membiarkan mereka dengan menangguhkan siksa-Nya beberapa saat sehingga mereka semakin jauh terombang-ambing dalam kesesatan dan semakin buta dari kebenaran, sampai akhirnya datang saat yang tepat untuk menyiksa mereka, seperti yang akan dijelaskan pada surah a'li imra'n/3: 87. Mereka itulah orang-orang yang jauh dari kebenaran yang membeli kesesatan dengan petunjuk. Sikap mereka yang memilih kesesatan dan mengabaikan kebenaran diumpamakan seperti pedagang yang memilih barang-barang rusak untuk dijual dalam perdagangannya. Maka perdagangan mereka itu tidak beruntung. Jangankan untung yang didapat, modal pun hilang. Dan mereka tidak mendapat petunjuk yang dapat mengantarkan kepada kebenaran, sebab yang ada pada mereka hanyalah kesesatan."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini merupakan jawaban atas tindakan orang-orang munafik ketika mereka mengolok-olok agama Allah. Maka ayat ini turun sebagai bantahan atas tindakan mereka, hakikatnya merekalah yang justru diolok-olok oleh Allah Subhanahu wa Ta'ala dengan membiarkan mereka terombang-ambing dalam kesesatan. Ibnu Jarir mengatakan, Allah Subhanahu wa Ta'ala memberitahukan bahwa Dialah yang akan melakukan pembalasan terhadap orang-orang munafik itu kelak di akhirat, seperti yang dinyatakan dalam firman-NYA : يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انْظُرُونَا نَقْتَبِسْ مِنْ نُورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُمْ بِسُورٍ لَهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِنْ قِبَلِهِ الْعَذَابُ Pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman: \"Tunggulah kami supaya kami dapat mengambil sebahagian dari cahayamu\". Dikatakan (kepada mereka): \"Kembalilah kamu ke belakang dan carilah sendiri cahaya (untukmu)\". Lalu diadakan di antara mereka dinding yang mempunyai pintu. Di sebelah dalamnya ada rahmat dan di sebelah luarnya dari situ ada siksa. (QS. Al-Hadid :13) Dalam ayat lain Allah berfirman : وَلَا يَحْسَبَنَّ الَّذِينَ كَفَرُوا أَنَّمَا نُمْلِي لَهُمْ خَيْرٌ لِأَنْفُسِهِمْ إِنَّمَا نُمْلِي لَهُمْ لِيَزْدَادُوا إِثْمًا وَلَهُمْ عَذَابٌ مُهِينٌ Dan janganlah sekali-kali orang-orang kafir menyangka, bahwa pemberian tangguh Kami kepada mereka adalah lebih baik bagi mereka. Sesungguhnya Kami memberi tangguh kepada mereka hanyalah supaya bertambah-tambah dosa mereka; dan bagi mereka azab yang menghinakan. (QS. Ali Imron :178) Ibnu Jarir mengatakan bahwa hal ini dan yang serupa dengannya merupakan ejekan, penghinaan, makar, dan tipu muslihat Allah Subhanahu wa Ta'ala terhadap orang-orang munafik dan orang-orang musyrik. Ketika mereka merasa telah melakukan ejekan, tipuan terhadapa Allah Subhanahu wa Ta'ala, justru sebenarnya merekalah yang ditipu oleh Allah Subhanahu wa Ta'ala. Hal ini senada dengan firman-NYA : وَمَكَرُوا وَمَكَرَ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ Orang-orang kafir itu membuat tipu daya, dan Allah membalas tipu daya mereka itu. Dan Allah sebaik-baik pembalas tipu daya. (QS. Ali Imron :54) Dan firman-Nya dalam ayat yang lain : إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ Sesungguhnya orang-orang munafik itu menipu Allah, dan Allah akan membalas tipuan mereka. (QS. An-Nisa :142) Dalam ayat lain : فَيَسْخَرُونَ مِنْهُمْ سَخِرَ اللَّهُ مِنْهُمْ maka orang-orang munafik itu menghina mereka. Allah akan membalas penghinaan mereka itu (QS. At-Taubah :79) demikian juga dengan ayat-ayat lain yang serupa merupakan berita dari Allah Subhanahu wa Ta'ala bahwa Dia pasti akan membalas terhadap mereka dengan balasan memperolok-olokan dan menyiksa mereka dengan tipuan, sebagaimana tipuan yang telah mereka lakukan. Kemudian berita mengenai balasan Allah dan siksaan-Nya kepada mereka diungkapkan dengan gaya bahasa yang sama dengan perbuatan mereka yang menyebabkan mereka berhak mendapat siksaan-Nya, akan tetapi memiliki makna yang berbeda. Ibnu jarir kembali mengatakan bahwa makna yang dimaksud dalam ayat ini adalah; Allah memberitahukan perihal orang-orang munafik yang apabila mereka berkumpul dengan pemimpin-pemimpin mereka, mereka mengatakan, “sesungguhnya kami sependirian dengan kalian dalam mendustakan Muhammad dan apa yang didatangkannya. Sesungguhnya kata-kata yang kami ucapkan dan sikap yang kami perlihatkan kepada mereka hanyalah mengolok-olok mereka.” Maka Allah Subhanahu wa Ta'ala memberitahukan bahwa Dia membalas mengolok-olok mereka. Untuk itu Allah tampakan kepada mereka sebagian dari hukuman-hukuman di dunia, yaitu dengan terpeliharanya darah mereka begitu pula dengan harta mereka di dunia, padahal hal itu justru kebalikan apa yang akan mereka terima nanti di akhirat, yaitu berupa siksaan-siksaan bagi mereka. Selain itu, Allah juga akan membiarkan mereka dalam kesesatan yang mereka lakukan, dan dihiasa dalam hati mereka segala bentuk kesesatan dan keburukan seolah tampak seperti kebaikan yang menyebabkan mereka semakin jauh tenggelam dalam kesesatan tersebut dan susah untuk bisa menerima kebaikan dan hidayah. Bahkan setiap kali mereka melakukan perbuatan dosa, maka Allah tambah nikmat baru kepada mereka yang hakikatnya merupaka azab bagi mereka sehingga membuat mereka terombang-ambing dalam dosa dan kesesatan. Hal ini sebagaimana firman-Nya : فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّى إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ-فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa. - Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya. Segala puji bagi Allah, Tuhan semesta alam. (QS. Al-An’am :44-45) Kemudian Allah akan menarik mereka semua kedalam kebinasaan sebagaimana firman-Nya : وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ Dan orang-orang yang mendustakan ayat-ayat Kami, nanti Kami akan menarik mereka dengan berangaur-angsur (ke arah kebinasaan), dengan cara yang tidak mereka ketahui. (QS. Al-A’rof : 182)"
  }
]