[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dari tempat mana saja kamu keluar -wahai nabi- maka menghadaplah kamu ke Masjidil Haram, dan dimanapun kalian berada -wahai kaum muslimin- di negeri mana pun dari seluruh penjuru bumi, maka arahkan wajah-wajah kalian ke arah Masjidil Haram, agar tidak ada alasan bagi orang-orang yang menentang kalian untuk mengajak adu argumentasi perselisihan dan perdebatan setelah kalian menghadapnya, kecuali orang-orang yang zalim dan suka menentang dari mereka. Maka mereka akan terus menerus melancarkan perdebatan mereka, maka janganlah kalian takut kepada mereka, dan takutlah kepada Ku dengan menjalankan perintah Ku dan meninggalkan larangan Ku, supaya aku sempurnakan nikmat Ku atas kalian dengan memilih ajaran syariat yang paling sempurna bagi kalian, dan supaya kalian mendapat petunjuk menuju Al Haq dan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Dari manapun engkau -wahai Nabi- jika engkau hendak menunaikan salat maka menghadaplah ke arah Masjidil Haram. Dan di manapun kalian -wahai orang-orang mukmin- hadapkanlah wajah kalian ke arah Masjidil Haram jika hendak menunaikan salat, agar manusia tidak mempunyai alasan untuk membantah kalian, kecuali orang-orang yang zalim, karena mereka akan tetap menolak ajakan kalian dengan dalil-dalil yang sangat lemah. Maka janganlah kalian takut kepada mereka, tetapi takutlah kepada Rabbmu saja, yaitu dengan cara melaksanakan perintah-Nya dan menjauhi larangan-Nya. Karena Allah telah menetapkan keharusan menghadap Ka'bah (ketika salat) untuk menyempurnakan nikmat-Nya kepada kalian dengan membuat kalian berbeda dari umat-umat lainnya. Dan juga untuk menunjukkan kalian kepada kiblat yang paling mulia bagi manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. وَمِنْ حَيْثُ خَرَجْتَ (Dan dari mana saja kamu (keluar)) yakni ketika dalam safar, maka menghadaplah kea rah kiblat dimanapun kalian berada baik di darat maupun di laut. وحيثما كنتم (Dan dimana saja kamu (sekalian) berada) Yakni wahai orang-orang yang beriman dimanapun kalian berada, baik itu di masjid-masjid di Madinah ataupun lainnya. فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ (dan dimana saja kamu (sekalian) berada, maka palingkanlah wajahmu ke arahnya, agar tidak ada hujjah bagi manusia atas kamu) Yakni agar orang-orang Yahudi tidak memiliki hujjah (dalil) atas kalian, karena mereka berkata: Muhammad menyetujui pada kiblat kami maka sebentar lagi akan menyetujui dalam agama kami. Arti dari (الحجة) adalah (المحاججة) yang bermakna permusuhan atau perdebatan. Dan Allah menyebut hal ini sebagai hujjah dan telah menghukumi hujjah ini dengan hujjah yang bathil karena datang dari orang yang zalim. إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ (kecuali orang-orang yang zalim diantara mereka) Yakni orang-orang Yahudi dan kaum musyrikin Arab yang akan berdalil: Muhammad bingung dalam agamanya, dan dia tidak menghadap ke kiblat kita karena kita lebih mendapat petunjuk darinya. Mereka juga berkata: Muhammad akan masuk ke dalam agama kita sebagaimana ia kembali menghadap ke kiblat kita. Qatadah berkata: ketika Allah mengalihkan kiblat Rasul-Nya ke arah Ka’bah Ahli kitab berkata: orang ini sedang rindu pada rumah ayahnya dan agama kaumnya. Dan banyak lagi omongan semacam ini yang tidak akan keluar kecuali dari mulut penyembah berhala, orang Yahudi, atau orang munafik. فَلَا تَخْشَوْهُمْ (Maka janganlah kamu takut kepada mereka) Yakni jangan takut pada tuduhan-tuduhan mereka karena itu hanya tuduhan bathil yang tidak akan membahayakan kalian. وَلِأُتِمَّ نِعْمَتِي عَلَيْكُمْ (Dan agar Ku-sempurnakan nikmat-Ku atasmu) yakni agar Aku menyempurnakan nikmat-Ku kepada kalian maka Aku tunjukkan kepada kalian kiblat-Ku. Dan penyempurnaan nikmat disini berupa petunjuk kepada kiblat agar kalian memiliki syari’at yang berdiri sendiri lagi sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150. Dimanapun kalian tinggal, maka menghadaplah ke arah Ka’bah. Wahai orang-orang muslim, dimanapun tempat kalian di alam ini, menghadaplah ke arah Ka’bah yang mulia. Pengulangan perintah sebanyak 3 kali merupakan sebuah penegasan tentang perubahan kiblat, supaya tidak ada satupun manusia yang memiliki peluang untuk berdebat dan berselisih tentang keberpalingan ke arah selain kiblat. Dan sia-sialah hujjah orang-orang Yahudi yang berkata: “Muhammad meninggalkan agama kami, namun mengikuti kiblat kami” dan hujjahnya orang-orang musyrik yang berkata: “Sesungguhnya Muhammad menganggap bahwa dirinya mengikuti Ibrahim, namun dia meninggalkan kiblatnya (Ka’bah)” Dan arah kiblat kalian ke Masjidil haram menghalangi perkataan-perkataan ini. Adapun orang-orang yang menzalimi diri sendiri di antara mereka dengan bertingkah keras kepala dan sombong, yaitu orang-orang musyrik Allah, maka janganlah kalian takut terhadap fitnah dan bantahan mereka yang dilakukan dengan bathil. Takutlah terhadap hukumanKu, jika menentang perintahKu, dan supaya Aku bisa menyempurnakan nikmatKu setelah Aku tunjukkan kepada kalian kiblatKu. Dan kalian akan menaklukkan Mekah. Kalian akan memasuki Baitul Haram dengan aman dan tenang, serta supaya kalian mendapat petunjuk menuju kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari mana pun kamu keluar, maka hadapkanlah wajahmu ke arah Masjidil haram. Di mana pun kamu berada, maka hadapkanlah wajahmu ke arahnya agar tidak ada alasan bagi manusia mendebatmu, kecuali orang-orang yang zalim di antara mereka. Maka janganlah kamu takut kepada mereka, takutlah kepadaKu agar Aku sempurnakan nikmatKu kepadamu dan agar kamu mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150. “Dan di mana saja kamu (sekalian) berada, maka palingkanlah wajahmu ke arahnya,” lalu Dia berfirman, “Sesungguhnya ketentuan itu benar-benar sesuatu yang hak dari rabbmu,” Allah menegaskan dengan huruf Inna dan lam, agar tidak terjadi syubhat yang terkecil sekalipun pada seseorang, dan agar dia tidak mengira bahwa itu hanyalah kesenangan belaka dan bukannya melaksanakan perintah. “Dan Allah sekali-kali tidak lengah dari apa apa yang kamu kerjakan,” akan tetapi Dia mengawasi kalian di segala kondisi kalian, maka berbuat baiklah kepadaNya dan cermatilah pengawasanNya dengan selalu melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya, karena sesungguhnya perbuatan-perbuatan kalian itu tidak dilalaikan, akan tetapi akan mendapat balasannya dengan balasan yang paling sempurna; bila baik, maka baiklah balasannya, dan bila buruk, maka buruklah balasannya. Allah kemudian berfirman “Agar tidak ada hujjah (alasan) bagi manusia atas kamu,” maksudnya, Kami mensyariatkan bagi kalian untuk menghadap Ka’bah yang mulia, agar tidak ada bantahan dari ahli kitab dan kaum musyrikin kepada kalian, karena seandainya kalian masih tetap menghadap ke Baitul Maqdis, niscaya hujjah itu akan terus ada, karena sesungguhnya ahli kitab mendapatkan dalam kitab mereka bahwa kiblat mereka yang tetap adalah Ka’bah Baitul haram, sedang kaum musyrikin memandang bahwa di antara kehormatan milik mereka adalah Al Baitul haram tersebut, dan bahwa dia adalah ajaran Nabi Ibrahim, dan bila Nabi Muhammad tidak berkiblat ke arahnya, niscaya bantahan-bantahan mereka akan tertuju kepada beliau dengan berkata, bagaimana dia mengaku menganut ajaran Nabi Ibrahim sedangkan dia termasuk keturunannya, namun dia meninggalkan terhadap kiblatnya? oleh karena itu, dengan menghadap ke arah kiblat, maka tegaklah hujjah atas ahli kitab dan kaum musyrikin sekaligus serta lenyaplah bantahan mereka atas beliau kecuali orang-orang yang zhalim di antara mereka. Artinya orang yang berhujah diantara mereka dengan hujjah yang dia berlaku dholim dengannya yang tidak memiliki sandaran sama sekali kecuali hanya hawa nafsu dan kezhaliman, maka orang seperti ini tidak ada jalan untuk memuaskannya dan berhujah atasnya, demikian pula tidak ada artinya menjadi syubhat yang mereka utarakan dengan maksud membantah itu sebagai suatu masalah yang tidak perlu diperhatikan dan tidak perlu dipedulikan. Oleh karena itu Allah berfirman, “Maka janganlah kamu takut kepada mereka,” karena hujjah mereka adalah batil, sedangkan batil itu adalah seperti namanya sendiri yaitu sesuatu yang ditinggalkan, dan ahli kebatilan ditinggalkan. Hal ini sangat berbeda jauh dengan ahli kebenaran, karena kebenaran itu memiliki kekuatan dan kemuliaan yang menimbulkan rasa takut mereka yang berada dalam kebenaran, Allah memerintahkan untuk takut kepadaNya dimana Hal itu merupakan puncak dari segala kebaikan. Maka barangsiapa yang tidak takut kepada Allah, niscaya dia tidak akan menahan diri dari kemaksiatan kepada-Nya, dan tidak menunaikan perintahNya. Perpindahan kiblat kaum muslimin ke arah Ka’bah mengakibatkan fitnah yang besar yang dimunculkan oleh ahli kitab, kaum munafik dan kaum musyrikin. Mereka memperbesar fitnah itu dengan memperbanyak pembicaraan dan syubhat-syubhat tentangnya. Oleh karena itu alah membeberkan hal tersebut dan menjelaskannya dengan sejelas-jelasnya serta menegaskannya dalam segala bentuk sarana-sarana penegasan yang dikandung dalam ayat ini: Pertama: adanya perintah untuk memalingkan wajah ke arah Ka’bah sebanyak 3 kali, padahal dengan sekali saja sudah cukup. Kedua: kesepakatan bahwa perintah itu ditujukan kepada rasul yang tentunya umatnya termasuk di dalamnya sebagai suatu konsekuensi, atau ditujukan langsung kepada umat yang bersifat umum, dan dalam ayat ini perintah kepada rasul secara khusus, “palingkanlah wajahmu” dan kepada umat secara umum dalam firman Allah, “Maka palingkanlah wajah kalian kearahnya” Ketiga: Bahwasanya Allah menolak segala bantahan batil yang dimunculkan oleh orang-orang durhaka, dan Allah menggugurkan semua syubhat satu demi satu sebagaimana yang telah dijelaskan. Keempat: Bahwasanya Allah memupus keinginan yang besar (ahli kitab) agar Rasul ikut terhadap kiblat ahli kitab (Baitul Maqdis). Kelima: firmanNya, “Sesungguhnya ketentuan itu benar-benar suatu yang hak dari rabbmu.” Sudah cukup dan lengkap hanya dengan sebatas kabar dari Dzat yang benar dan agung, akan tetapi dengan hal itu juga Allah berfirman, “Sesungguhnya ketentuan itu adalah benar-benar sesuatu yang hak dari robbmu.” Keenam: Allah mengabarkan (dan Dia adalah Dzat yang maha tahu segala yang tersembunyi) bahwasanya tentang kebenaran hal itu telah diakui oleh ahli kitab, akan tetapi mereka menyembunyikan kesaksian itu padahal mereka mengetahui. Dan karena perintahNya tentang peralihan dalam menghadap kiblat bagi kita adalah sebuah nikmat yang besar, kasih sayang dan rahmatNya terhadap umat ini senantiasa bertambah, dan setiap kali Dia mensyariatkan kepada mereka suatu syariat agama itu merupakan suatu kenikmatan yang besar, maka Dia berfirman, “Dan agar kusempurnakan nikmatku atas kamu.” Maka dasar kenikmatan itu adalah Hidayah kepada agamaNya dengan mengutus rasulNya dan penurunan kitabNya, kemudian setelah itu ada kenikmatan-kenikmatan pelengkap bagi nikmat dasar ini yang tidak dapat dihitung banyaknya dan tidak dapat dibatasi sejak Allah mengutus rasulnya hingga mendekati kepergian beliau dari dunia. Allah telah memberikan kepadanya segala nikmat, serta memberikan kepada umatnya apa yang menyempurnakan nikmatnya itu Kepada beliau dan kepada mereka lalu Allah menurunkan wahyu kepadanya, \"Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu.\" QS Al Maidah ayat 3 Segala puji hanya milik Allah atas segala karuniaNya yang tidak mampu kita hitung, apalagi untuk mensyukurinya. “Dan supaya kamu mendapat petunjuk,” maksudnya, kalian mengetahui kebenaran lalu mengamalkannya. Maka Allah tabaroka wata'ala, termasuk rahmat-Nya terhadap hamba-hambaNya, yaitu Dia memudahkan bagi mereka sebab-sebab hidayah dengan sangat mudah sekali, dan Dia mengingatkan mereka untuk menempuh jalannya, lalu Allah menjelaskan kepada mereka dengan keterangan yang paling sempurna. Dan diantara hal itu adalah Dia menakdirkan bagi kebenaran itu adanya para pembangkang terhadapnya, lalu mereka berdebat tentangnya, hingga jelaskan kebenaran dan nampaklah ayat-ayat dan tanda-tandaNya, serta teranglah batilnya kebatilan itu dan bahwa kebatilan itu tidak ada hakekatnya sama sekali. Sekiranya bukan karena adanya perlawanan kebatilan terhadap kebenaran, mungkin saja keadaannya tidak akan jelas bagi sebagian besar makhluk, karena dengan hal yang kontradiksi, jelaslah segala sesuatu. Sekiranya bukan karena adanya malam hari, tidaklah diketahui keutamaannya siang hari, sekiranya bukan karena kejelekan, tidaklah diketahui keutamaan keindahan, sekiranya bukan karena kegelapan, tidak diketahui manfaatnya cahaya, dan sekiranya bukan karena kebatilan, maka kebenaran tidak akan benar-benar jelas. Akhirnya segala puji hanya bagi Allah atas semua itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { حُجَّةٌ } Hujjah : Bukti kuat yang digunakan oleh pemiliknya untuk mengalahkan lawan bicaranya { نِعۡمَتِي } Ni’matiy : Nikmat-nikmat Allah yang amat banyak jumlahnya, dan nikmat yang paling besar adalah Islam, dan bentuk penyempurnaan nikmat aalah dengan melanjutkan syariat dan mengamalkannya sampai sempurna. Penyempurnaan nikmat itu terjadi pada Haji Wada’ di Arafah ketika turun ayat “Pada hari ini telah Kusempurnakan untukmu agamamu dan telah Kucukupkan kepadamu nikmatKu, dan telah Ku ridhai Islam menjadi agamamu.” (QS al-Maidah : 3) Makna ayat : Adapun ayat 150 Allah Ta’ala menyuruh rasulNya beserta kaum Muslimin untuk menghadapkan wajahnya ke arah Masjidil Haram dimanapun mereka berada, dan dalam keadaan apapun sehingga menjadi pedoman, dan musuh-musuh mereka dari kalangan Yahudi dan Nasrani tidak mempunyai celah untuk mengingkari. Seperti ucapan Yahudi : Kaum Muslimin mengingkari agama kami, akan tetpai tetap menghadap kiblat kami.” Begitu juga kaum musyrikin akan berkata,”Kaum muslimin mengaku berada di atas agamanya Ibrahim ‘alaihissalam akan tetapi mereka menyelisihi kiblatnya.” Pernyataan ini datang dari orang-orang pertengahan di kalangan mereka, adapun orang-orang yang zhalim lagi sombong sudah tidak dapat diberi penjelasan lagi, mereka akan mengatakan,”Tidaklah kiblat berubah ke arah Ka’bah kecuali karena Muhammad condong mengikuti agama bapaknya yaitu Ibrahim ‘alaihissalam dan tidak lama dia akan mengikuti agama yang lama.” Untuk orang-orang semodel ini maka tidak perlu digubris dan diperhatikan agi sebagaimana firman Allah Ta’ala (إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي ) “Kecuali orang-orang yang zhalim di antara mereka. Maka janganlah kamu takut kepada mereka dan takutlah kepadaKu.” Pelajaran dari ayat : • Kewajiban menghadap kiblat ketika shalat, baik saat bepergian maupun sedang dalam keadaan muqim (menetap). Bagi orang yang bersafar boleh shalat sunnah kemanapun arah hewan tunggangan, pesawat, atau kendaraannya menghadap. • Haramnya takut kepada manusia dan kewajiban takut hanya kepada Allah. • Kewajiban mensyukuri nikmat-nikmat Allah yang nampak maupun tidak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 150: Allah mengulangi perintah kepada nabi ﷺ untuk mengarahkan kiblat ke masjidil Haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Perintah menghadap ke kiblat adalah agar ahli kitab dan kaum musyrikin tidak memiliki alasan lagi untuk menentang Rasulullah shallallahu 'alaihi wa sallam. Hal itu, karena jika tetap menghadap ke Baitul Maqdis tentu orang-orang ahli kitab akan menegakkan hujjah kepada Rasulullah shallallahu 'alaihi wa sallam, karena yang disebutkan dalam kitab-kitab mereka adalah bahwa kiblat yang tetap bagi Beliau adalah Ka'bah Baitullah al haram. Sedangkan hujjah bagi orang-orang musyrikin ketika Beliau tetap menghadap ke Baitul Maqdis adalah perkataan yang akan timbul dari mereka, \"Bagaimana Beliau berada di atas agama Nabi Ibrahim 'alaihis salam dan termasuk keturunannya, padahal Beliau tidak menghadap ke kiblatnya?!\". Dengan demikian, setelah diadakan pemindahan kiblat, maka orang-orang ahli kitab dan kaum musyrikin sudah tidak memiliki hujjah lagi untuk menentang Beliau. Yakni hanya orang-orang yang zalim saja yang coba-coba berhujjah, namun hujjah mereka tidak bersandar selain kepada hawa nafsu sehingga tidak perlu diladeni, karena tidak ada manfa'atnya berbantah dengan mereka. Kita tidak perlu takut kepada mereka karena hujjah mereka batil, dan kita diperintahkan untuk takut kepada Allah Subhaanahu wa Ta'aala saja, karena takut kepada-Nya merupakan asas semua kebaikan. Oleh karena itu, orang yang tidak takut kepada Allah Azza wa Jalla, ia tidak akan berhenti bermaksiat dan tetap tidak mau mengikuti perintah-Nya. Perlu diketahui, bahwa pemindahan arah kiblat merupakan fitnah yang besar. Fitnah itu diangkat-angkat oleh ahli kitab, kaum munafik dan kaum musyrikin, mereka banyak membicarakan masalah itu dan menyampaikan berbagai syubhat. Oleh karena itu, pada beberapa ayat di atas, Allah Subhaanahu wa Ta'aala menerangkannya secara gamblang dan meyakinkan rasul-Nya serta memperkuat kebenaran itu dengan berbagai penguat sebagaimana yang disebutkan di beberapa ayat atas, misalnya: - Diulangi-Nya perintah menghadap kiblat berkali-kali - Perintah itu tidak hanya ditujukan kepada Rasul saja, meskipun biasanya perintah kepada rasul sebagai perintah kepada umatnya, tetapi diperkuat lagi dengan perintah kepada umatnya sebagaimana firman-Nya \"fa walluu wujuuhakum syathrah\". - Pada ayat di atas, Allah Subhaanahu wa Ta'aala membantah semua alasan batil yang dilemparkan oleh mereka yang zalim. - Menghilangkan harapan bagi Rasulullah shallallahu 'alaihi wa sallam untuk mengikuti kiblat ahli kitab. - Penguatan dengan berita yang disampaikan-Nya bahwa sesungguhnya hal itu benar-benar hak dari sisi Allah. - Pemindahan kiblat tersebut disebutkan dalam kitab-kitab mereka (ahli kitab), namun mereka menyembunyikannya. Yakni dengan tetap menjalankan perintah-Nya dan menjauhi larangan-Nya. Berupa penyempurnaan syari'at. Dengan demikian, setiap syari'at yang ditetapkan merupakan nikmat yang besar. Dasar nikmat adalah memperoleh hidayah untuk mengikuti agama-Nya, setelah itu nikmat-nikmat yang lain yang melengkapi dasar tersebut, dimulai dari sejak diutusnya Beliau sampai wafat hingga syari'at pun sempurna. Maksudnya: agar kita mengetahui yang hak dan dapat mengamalkannya. Allah Subhaanahu wa Ta'aala karena rahmat-Nya telah memudahkan kepada hamba-hamba-Nya sebab-sebab untuk memperoleh hidayah dan mengingatkan mereka untuk menempuhnya. Allah Subhaanahu wa Ta'aala juga menjelaskan hidayah itu sejelas-jelasnya, sampai-sampai ditetapkan untuk yang hak itu ada para penentangnya agar yang hak itu semakin jelas dan nampak serta yang batil semakin jelas kebatilannya. Hal itu, karena jika tidak ada kebatilan sebagai lawan yang hak tentu kebenaran itu akan samar bagi kebanyakan orang. Dengan ada lawannya maka segala sesuatu itu semakin jelas. Jika tidak ada malam tentu tidak akan diketahui kelebihan siang, jika tidak ada keburukan tentu tidak akan diketahui kelebihan yang baik, jika tidak ada kegelapan tentu tidak akan diketahui manfa'at cahaya, dan jika tidak ada kebatilan tentu kebenaran tidak akan jelas dan nampak, maka sehgala puji bagi Allah terhadap semua itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 150",
    "description": "Dan dari mana pun engkau keluar, wahai nabi Muhammad, maka hadapkanlah wajahmu ke arah masjidilharam. Dan di mana saja kamu berada, wahai umat islam, maka hadapkanlah wajahmu ke arah itu. Demikianlah, Allah mengalihkan kiblat agar tidak ada alasan bagi manusia untuk menentangmu; agar orang yahudi tidak bisa lagi berkata, mengapa Muhammad menghadap baitulmakdis, padahal disebutkan dalam kitab-kitab kami bahwa dia menghadap kakbah' dan agar orang musyrik tidak bisa lagi berkata, mengapa Muhammad menghadap ke baitulmakdis dan meninggalkan kakbah yang dibangun oleh kakeknya sendiri' dengan pengalihan ini maka ucapan-ucapan itu terjawab, kecuali orang-orang yang zalim di antara mereka. Mereka akan terus mendebat nabi dan berkata, Muhammad menghadap kakbah karena mencintai agama kaumnya dan tanah airnya. Terkait sikap orang-orang tersebut, Allah berkata kepada nabi dan para sahabatnya, janganlah kamu takut kepada mereka, tetapi takutlah kepada-ku, agar aku sempurnakan nikmat-ku kepadamu, dan agar kamu mendapat petunjuk. Pengalihan kiblat ke kakbah adalah kenikmatan yang besar karena umat islam mempunyai kiblat sendiri sampai akhir zaman, dan dengan demikian mereka mendapatkan hidayah dari Allah dalam melaksanakan perintah-perintah Allahsebagaimana pengalihan kiblat, pengutusan seorang nabi dari bangsa arab juga merupakan suatu kenikmatan yang besar. Kenikmatan yang besar itu adalah sebagaimana kami telah mengutus kepadamu seorang rasul, yakni nabi Muhammad, dari kalangan kamu. Di antara tugasnya adalah membacakan ayat-ayat kami, yaitu Al-Qur'an yang menjelaskan perkara yang hak dan yang batil, atau tanda-tanda kebesaran Allah, kenabian nabi Muhammad, dan adanya hari kebangkitan. Rasul itu juga kami tugasi untuk menyucikan kamu dari kemusyrikan, kemaksiatan, dan akhlak yang tercela. Dia juga mengajarkan kepadamu kitab Al-Qur'an dan hikmah, yakni sunah, serta mengajarkan apa yang belum kamu ketahui, yaitu segala pengetahuan yang terkait dengan kebaikan di dunia dan akhirat. Al-qur'an juga menuturkan kisah para nabi terdahulu. Hal ini tidak mungkin didapat kecuali melalui wahyu."
  }
]