[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana Kami telah melimpahkan nikmat kepada kalian dengan perintah menghadap Ka'bah, Kami juga telah mengutus di tengah kalian seorang Rasul dari kaum kalian sendiri yang membacakan ayat-ayat yang menjelaskan kebenaran dari kebatilan, membersihkan kalian dari noda syirik dan keburukan akhlak, dan mengajarkan kepada kalian Alquran dan as-sunnah serta hukum-hukum syariat, serta mengajarkan kepada kalian berita-berita tentang para nabi dan kisah-kisah umat-umat terdahulu yang kalian tidak ketahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Kami juga memberikan nikmat yang lain kepada kalian. Kami mengirimkan kepada kalian seorang Rasul dari bangsa kalian sendiri yang bertugas membacakan ayat-ayat Kami dan menyucikan kalian melalui keutamaan-keutamaan dan kebajikan yang dia perintahkan dan memperingatkan kehinaan-kehinaan dan kemungkaran yang dia larang untuk kalian. Dia juga mengajarkan Al-Qur`ān dan Sunnah kepada kalian, dan mengajarkan apa yang belum kalian ketahui terkait urusan-urusan agama dan dunia kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "151. Selain Aku telah menyempurnakan bagi kalian kenikmatan dari-Ku, Aku juga mengutus kepada kalian seorang rasul dari golongan kalian, dia membacakan kepadamu ayat-ayat al-Qur’an yang menjelaskan urusan-urusan agama, membersihkan diri kalian dari kemaksiatan, mengajarkan kalian al-Qur’an dan as-Sunnah, dan mengajarkan urusan-urusan dunia dan akhirat yang sebelumnya tidak kalian ketahui. Ibnu Asyur berkata: “Permisalan ini karena dua sebab, pertama firman Allah (ولأتم) ‘agar Aku menyempurnakan’ dan firman-Nya: (ولعلكم تهتدون) ‘agar kalian mendapat petunjuk’; yakni hal itu merupakan kenikmatan yang Aku berikan kepada kalian semisal kenikmatan diutusnya Muhammad kepada kalian. Allah menjadikan pengutusan Muhammad sebagai permisalan karena pengutusan Muhammad ada terlebih dahulu dan menjadi sebab terwujudnya hal yang dimisalkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. كَمَآ أَرْسَلْنَا (Sebagaimana Kami telah mengutus kepadamu) Ini merupakan isyarat yang menunjukkan bahwa nikmat yang ada dalam perubahan kiblat seperti nikmat yang ada pada pengutusan Rasulullah sebagai Rasul. Pendapat lain mengatakan: makna dari kalimat ini dipengaruhi pengakhiran dan pengawalan kata, sehingga maknanya adalah ingatlah Aku sebagaimana Aku telah mengutus kepada kalian seorang rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151. Penyempurnaan nikmat itu seperti penyempurnaan risalah yang dilakukan dengan mengutus Nabi Muhammad SAW untuk membacakan ayat-ayat Al-Qur’an, menyucikan diri kalian dari kesyirikan, kecenderungan menyembah berhala, dan akhlak buruk, dan mengajarkan kepada kalian Al-Qur’an, menulis, dan menghilangkan fenomena buta huruf, pemahaman tentang hukum-hukum syariat, dan pengetahuan tentang rahasia-rahasianya, serta mengajarkan kepada kalian tentang urusan dunia dan akhirat, serta sesuatu yang belum kalian ketahui sebelumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebagaimana Kami telah mengutus kepada kalian seorang Rasul dari kalangan kalian yang membacakan kalian ayat-ayat Kami, menyucikan kalian, dan mengajarkan kalian Kitab dan hikmah} Al-Qur’an dan sunnah {serta mengajarkan apa yang belum kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151. Allah menyatakan, “Sesungguhnya pemberian nikmat kami atas kalian dengan menghadap ke Ka’bah dan penyempurnaannya dengan dasar-dasar syariat serta nikmat-nikmat penyempurna, bukanlah sesuatu yang aneh dalam kebaikan Kami dan bukan pula yang pertama bahkan kami telah memberikan nikmat atas kalian dengan nikmat-nikmat dasar dan penyempurna nya, dan yang paling besar adalah Kami mengutus kepada kalian seorang Rasul yang mulia dari kalangan kalian, di mana kalian mengetahui garis keturunannya, kejujuran, amanah, kesempurnaan, dan ketulusannya. “yang membacakan ayat-ayat kami kepadamu.” Ini mencakup segala ayat-ayatNya baik ayat Alquran maupun ayat-ayat lainnya, beliau membacakan kepada kalian ayat-ayat yang menjelaskan kebenaran dari kebatilan dan hidayah dari kesesatan, yang menunjukkan kepada kalian, pertama, tentang keesaan Allah dan kesempurnaanNya, kedua, tentang kebenaran rasulNya dan wajibnya beriman kepadanya, kemudian kepada segala hal yang dikabarkan olehnya berupa Hari pembalasan maupun hal-hal yang ghaib, hingga kalian memperoleh Hidayah yang sempurna dan ilmu yang meyakinkan. “Dan menyucikan kamu,” maksudnya, menyucikan akhlak dan jiwa kalian dengan mendidiknya. Dengan akhlak yang mulia, dan membersihkannya dari akhlak yang tercela, dan demikian itu seperti menyucikan mereka dari kesyirikan kepada ketauhidan, dan riya kepada keikhlasan, dari kebohongan kepada kejujuran, dari penghianatan kepada amanah, dan dari kesombongan kepada kerendahan hati, dari akhlak yang buruk kepada akhlak yang luhur, dan dari saling benci, saling bermusuhan. serta saling memutuskan hubungan kepada saling mencintai, saling bersilaturahmi, dan saling kasih mengasihi, dan lain sebagainya dari bentuk-bentuk penyucian. “Dan mengajarkan kepadamu Alkitab,” yaitu, al-qur’an baik lafadznya maupun maknanya, “Dan al-hikmah.” Suatu pendapat berkata, al-hikmah dan as-sunnah. Yang lain berpendapat Al Hikmah adalah mengetahui rahasia-rahasia Syariah dan fiqih serta menempatkan segala sesuatu pada tempatnya. Maka dalam hal ini pengajaran as-sunnah termasuk ke dalam pengajaran Alkitab, karena as-sunnah itu menjelaskan Alquran, menafsirkannya, dan mengutarakan maksudnya, “Dan mengajarkan kepada kamu apa yang belum kamu ketahui,” karena mereka itu benar-benar ada dalam kesesatan yang nyata sebelum diutusnya beliau, yang tidak berilmu dan tidak pula beramal. Setiap ilmu maupun amal yang diperoleh umat ini adalah dari Rasulullah dan karena sebab beliaulah semua itu ada. Maka nikmat-nikmat tersebut adalah nikmat-nikmat dasar secara mutlak, dan dia adalah nikmat terbesar yang Allah berikan kepada hamba-hambaNya. Oleh karena itu, tugas mereka selanjutnya adalah bersyukur kepada Allah atas nikmat-nikmat tersebut dan menegakkannya. Karena itu Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { رَسُولٗا } Rasulan : Yaitu Muhammad ﷺ dan bentuk kata umum (nakirah) sebagai penghormatan { وَيُزَكِّيكُمۡ } Yuzakkihim : Menyucikan kalian dari dosa dan akhlak yang buruk serta perangai yang jelek. { وَٱلۡحِكۡمَةَ } al-Hikmah : Maksudnya adalah sunnah, yaitu setiap ucapan baik yang tidak akan pernah habis manfaatnya dengan berlalunya waktu. Makna ayat : .” Maka tetaplah kalian di atas kiblat yang benar (Ka’bah, ed) sehingga Aku dapat menyempurnakan nikmatKu kepada kalian dengan menunjukkan syarat yang terbaik paling lurus, dan Aku persiapkan untuk kalian setiap kebaikan dan kesempurnaan, seperti nikmat yang Aku berikan dengan mengutus rasulKu, menyucikan kalian dan mengajari Kitab dan sunnah, serta mengajari kalian ilmu tentang perkara agama dan dunia yang belum pernah kalian ketahui. Pelajaran dari ayat : • Kewajiban mempelajari ilmu yang wajib dipelajari, agar seorang hamba dapat menjalankan ibadah yang bisa menyucikan dirinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 151: Allah menjelaskan bahwasannya sebagaimana nikmat yang telah diberikan kepada kalian wahai manusia yaitu dengan menghadap ke Ka’bah yang nikmat tersebut rupa dengan diutusnya rasul kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nikmat Allah untuk menghadap ke kiblat dan penyempurnaan syari'at bukanlah hal yang baru dan bukan pertama kali, bahkan Dia juga telah memberikan ushulun ni'am (asas nikmat) dan penyempurnanya, yaitu dengan mengutus seorang rasul yang sudah dikenal nasabnya, kejujurannya, amanahnya, kesempurnaan dan sikap nush-h(tulus)nya. Ayat-ayat tersebut menerangkan mana yang hak dan mana yang batil, mana petunjuk dan mana kesesatan, menerangkan tentang tauhid, tentang kebenaran Rasul-Nya serta kewajiban beriman kepadanya, menerangkan tentang hari kiamat dan hal-hal ghaib serta menerangkan syari'at untuk maslahat mereka di diunia sehingga mereka memperoleh hidayah yang sempurna dan ilmu yang yakin. Maksudnya: menyucikan akhlak dan jiwa mereka dengan mendidiknya di atas akhlak yang mulia dan membersihkannya dari akhlak yang tercela yang mengotori jiwa. Misalnya dengan membersihkan mereka dari syirk kepada tauhid, dari riya' kepada ikhlas, dari dusta kepada kejujuran, dari khianat kepada amanah, dari sombong kepada tawadhu' dan dari semua akhlak buruk kepada akhlak yang mulia serta perbaikan-perbaikan lainnya. As Sunnah dan hukum-hukum syari'at (fiqh). Seperti kisah para nabi dan kisah umat-umat terdahulu dan pengetahuan lainnya, di mana mereka sebelum diutusnya Beliau dalam kesesatan yang nyata, tidak ada ilmu apalagi amal. Oleh karena itu, ilmu maupun amal yang diketahui oleh umat ini adalah melalui tangan dan sebab Beliau shallallahu 'alaihi wa sallam. Nikmat-nikmat ini merupakan ushulun ni'am (asas nikmat), bahkan ia merupakan nikmat terbesar yang menghendaki untuk disyukuri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 151",
    "description": "Sebagaimana pengalihan kiblat, pengutusan seorang nabi dari bangsa arab juga merupakan suatu kenikmatan yang besar. Kenikmatan yang besar itu adalah sebagaimana kami telah mengutus kepadamu seorang rasul, yakni nabi Muhammad, dari kalangan kamu. Di antara tugasnya adalah membacakan ayat-ayat kami, yaitu Al-Qur'an yang menjelaskan perkara yang hak dan yang batil, atau tanda-tanda kebesaran Allah, kenabian nabi Muhammad, dan adanya hari kebangkitan. Rasul itu juga kami tugasi untuk menyucikan kamu dari kemusyrikan, kemaksiatan, dan akhlak yang tercela. Dia juga mengajarkan kepadamu kitab Al-Qur'an dan hikmah, yakni sunah, serta mengajarkan apa yang belum kamu ketahui, yaitu segala pengetahuan yang terkait dengan kebaikan di dunia dan akhirat. Al-qur'an juga menuturkan kisah para nabi terdahulu. Hal ini tidak mungkin didapat kecuali melalui wahyu. Atas semua kenikmatan itu, Allah menyuruh kaum muslim untuk selalu mengingat-Nya. Maka ingatlah kepada-ku, baik melalui lisan dengan melafalkan pujian, melalui hati dengan mengingat kekuasaan dan kebijaksanaan Allah, maupun melalui fisik dengan menaati Allah. Jika kamu mengingatku, aku pun pasti akan ingat kepadamu dengan melimpahkan pahala, pertolongan, dan kebahagiaan di dunia dan akhirat. Bersyukurlah pula kepada-ku atas nikmat-ku dengan menggunakannya di jalan-ku, dan janganlah kamu ingkar kepada-ku, kepada nikmatnikmatku, dan mempergunakannya untuk berbuat maksiat."
  }
]