[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah Subhanahu Wa Ta'ala memerintahkan kaum Mukmin untuk berdzikir (mengingat dan menyebutnya), dan menjanjikan kepadanya balasan yang paling utama berupa pujian di hadapan para malaikat yang paling tinggi kedudukannya bagi orang yang berdzikir (mengingat dan menyebut Nya), dan khususkanlah –wahai orang-orang yang beriman- rasa syukur kepada Ku secara lisan dan amalan, dan janganlah kalian mengingkari nikmat-nikmat Ku atas kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "152. Ingatlah Aku dengan hati dan anggota badan kalian, maka Aku akan mengingat kalian dengan memuji dan menjaga kalian. Karena setiap perbuatan akan berbalas perbuatan serupa. Syukurilah nikmat-nikmat yang telah Aku berikan kepada kalian. Jangan kufur kepada-Ku dengan mengingkari nikmat-nikmat-Ku dan menggunakannya untuk hal-hal yang diharamkan bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "152. Ingatlah Aku dengan beribadah, maka Aku akan mengingat kalian dengan ampunan dan pahala. Dan bersyukurlah kepada-Ku atas kenikmatan yang telah Aku berikan, dan janganlah kalian mengingkarinya. Dari Abu Hurairah, dari Rasulullah ia bersabda: “Allah berfirman: 'Aku tergantung persangkaan hamba kepadaKu. Aku bersamanya kalau dia mengingat-Ku. Kalau dia mengingatku pada dirinya, maka Aku mengingatnya pada diriKu. Kalau dia mengingatKu di keramaian, maka Aku akan mengingatnya di keramaian yang lebih baik dari mereka. Kalau dia mendekat sejengkal, maka Aku akan mendekat kepadanya sehasta. Kalau dia mendekat kepada diri-Ku sehasta, maka Aku akan mendekatinya sedepa. Kalau dia mendatangi-Ku dengan berjalan, maka Aku akan mendatanginya dengan berlari.\" (Shahih Bukhari, Bab tauhid, firman Allah {ويحذركم الله نفسه} no. 7405. Dan Shahih Muslim 4/2061, Zikir, Bab anjuran berzikir kepada Allah, no. 2675)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "152. فَاذْكُرُونِىٓ أَذْكُرْكُمْ (Karena itu, ingatlah kamu kepada-Ku niscaya Aku ingat (pula) kepadamu) Yakni ingatlah Aku dengan cara mentaati-Ku maka Aku akan mengingatmu dengan cara memberimu pahala dan ampunan. Sebagian salaf mengetakan: makna kalimat ini adalah Barangsiapa mengingatku sedang dia taat maka Aku akan mengingatnya dengan ampunan-Ku. وَاشْكُرُوا۟ لِى (dan bersyukurlah kepada-Ku) Syukur adalah mengakui kenikmatan dan membicarakannya. وَلَا تَكْفُرُونِ (dan janganlah kamu mengingkari (nikmat)-Ku) Yakni janganlah kalian mengingkari nikmat-Ku"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Barangsiapa yang menjaga sikapnya dari kecurangan dalam jual beli dan membatalkan janji; maka dia telah diridhoi pada perkara yang agung, dan hal yang paling baik dijadikan penolong bagi siapa yang memiliki kepedulian terhadap agamanya adalah : sifat qona'ah, dan berbaik sangka kepada Allah, dan percaya kepada siapa yang menganugerahkan kepadanya rezeki, dan tekut akan hari perhitungan amalan, dan pengawasan sang Khaliq, karena sesungguhnya Dia berfirman dan firman-Nya adalah haq : { فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ } \"Karena itu, ingatlah kamu kepada-Ku niscaya Aku ingat (pula) kepadamu, dan bersyukurlah kepada-Ku, dan janganlah kamu mengingkari (nikmat)-Ku\" [ al-Baqarah : 152 ]. 2 ). { فَاذْكُرُونِي أَذْكُرْكُمْ } Khalid al-ruba'ay berkata : berhentilah sejenak pada ayat ini dan janganlah kamu bergegas meninggalkannya, jika keyakinanmu akan maksud ayat ini sangat kuat dalam hati, sungguh kedua bibirmu tidak akan mengering. 3 ). { فَاذْكُرُونِي أَذْكُرْكُمْ } Tsabit al-bannani berkata : (( sesungguhnya aku mengetahui kapan tuhanku mengingatku\", maka orang-orang yang mendengarkannya terkejut! dan mereka pun berkata : bagaimana kamu mengetahui hal itu ? beliau kemudian menjawab \"jika aku mengingat menyebut nama-Nya Niscaya Dia akan mengingatku )) 4 ). { وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ } Merupakan sebuah keangkuhan orang yang mengetahui bahwa semua kenikmatan yang ia miliki datangnya dari Allah, kemudian dia tidak malu menggunakan kenikmatan itu untuk berbuat hal yang dilarang oleh Allah! 5 ). { وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ } Sejumlah ulama salaf berkata : Diantara tanda seseorang mensyukuri nikmat adalah dengan meninggalkan kemaksiatan. kemudian sebagian mereka kembali ditanya : apa itu syukur ? kemudian dijawab : tidaklah seseorang menjadikan kenikmatan itu sebagian perantara baginya dalam bermaksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "152. Wahai manusia ingatlah aku dengan penuh ketaatan, maka aku akan mengingat kalian dengan memberi pahala dan ampunan. Dan bersyukurlah kepadaKu atas-nikmat-nikmatKu atas kalian. Asy-Syukru adalah mengetahui suatu kebaikan dan membicarakan kebaikan itu. Dan janganlah kalian mengingkari nikmatKu atas kalian sehingga kalian menutup-nutupinya. Yang dimaksud dengan Al-Kufru di sini adalah menutupi nikmat, maka Aku akan merenggutnya dari kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ingatlah Aku, maka Aku pun akan mengingat kalian. Bersyukurlah kepadaKu dan janganlah kalian mengingkariKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "152. “Karena itu Ingatlah kamu kepadaku niscaya aku ingat (pula) kepadamu” Allah memerintahkan hamba-hambaNya untuk mengingatNya dan menjanjikan baginya sebaik-baik balasan, yaitu bahwa Allah akan mengingatnya pula, yaitu bagi orang yang ingat kepadaNya, sebagaimana yang disabdakan dari lisan rasulNya: “Barang siapa yang menyebut mengingatku pada dirinya niscaya aku akan mengingatnya pada diriku dan barangsiapa yang menyebut mengingatku pada halayak ramai niscaya aku akan mengingatnya nya pula pada halayak ramai yang lebih ramai dari mereka” HR Bukhori no. 7405, Muslim no. 2675 Dzikir kepada Allah yang paling istimewa adalah zikir yang dilakukan dengan hati dan lisan, yaitu dzikir yang menumbuhkan ma’rifat kepada Allah, kecintaan kepadaNya, dan menghasilkan ganjaran yang banyak dariNya. Dzikir adalah puncak rasa syukur. Oleh karena itu, Allah memerintahkan hal itu secara khusus kemudian memerintahkan untuk bersyukur secara umum seraya berfirman, “Dan bersyukurlah kepadaku,” maksudnya, terhadap apa yang telah Aku nikmatkan kepada kalian dengan nikmat-nikmat tersebut, dan Aku jauhkan dari kalian berbagai macam kesulitan. Syukur itu dilakukan dengan hati berupa pengakuan atas kenikmatan yang didapatkan, dengan lisan berupa zikir dan pujian dan dengan anggota tubuh berupa ketaatan kepada Allah serta kepatuhan terhadap perintahNya dan menjauhi laranganNya. Syukur itu menyebabkan kelanggengan nikmat yang telah didapatkan dan menambah nikmat yang belum didapatkan, Allah berfirman \" Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; “Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih”.\" QS Ibrahim ayat 7 Dengan adanya perintah untuk bersyukur setelah kenikmatan agama, seperti ilmu dan penyucian akhlak, serta taufik kepada pengamalan, merupakan penjelasan bahwa hal itu adalah sebesar-besar kenikmatan, bahkan dia adalah kenikmatan yang sebenarnya yang akan selalu eksis bila yang lainnya lenyap. Dan seyogyanya bagi orang yang diberikan taufik kepada ilmu dan amal, agar bersyukur kepada Allah atas semua itu, agar Allah menambahkan nikmatNya dan menghindarkan dirinya dari rasa bangga diri, hingga akhirnya dia sibuk dengan bersyukur. Dan ketika kebalikan dari rasa syukur adalah pengingkaran, maka Allah melarang pengingkaran tersebut seraya berfirman, “Dan janganlah kamu mengingkari nikmat Ku,” maksud dari pengingkaran disini adalah suatu hal yang bertolak belakang dengan bersyukur yaitu ingkar terhadap kenikmatan yang diberikan dan menampiknya serta tidak bersyukur kepadanya. Kemudian juga maknanya adalah bersifat umum, maka pengingkaran itu ada bermacam-macam, dan yang paling besar adalah pengingkaran terhadap Allah, kemudian macam-macam kemaksiatan dengan segala bentuk dan jenisnya dari kesyirikan dan selainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الشكر } asy-Syukr : Menampakkan kenikmatan yang digunakan pada jalan-jalan yang diridhai Allah, sesuai dengan maksud diturunkannya kepada hamba. { الكفر } al-Kufr : Mengingkari nikmat dan menyembunyikannya, serta menggunakannya untuk hal yang tidak dicintai oleh Allah Ta’ala. Makna ayat : Pada ayat 152 Allah Ta’ala memerintahkan kaum Muslimin agar mengingatNya dan bersyukur kepadaNya, serta melarang agar tidak kufur dan melupakanNya. Allah Ta’ala berfirman (فَٱذۡكُرُونِيٓ أَذۡكُرۡكُمۡ وَٱشۡكُرُواْ لِي وَلَا تَكۡفُرُونِ ) “Karena itu ingatlah kamu kepada-Ku niscaya Aku ingat (pula) kepadamu, dan bersyukurlah kepada-Ku dan janganlah kamu mengingkari (nikmat)-Ku.” Karena mengingat Allah dengan nama-nama dan sifat-sifatNya, serta mengingat janji dan acamanNya termasuk hal-hal yang dapat mengantarkan untuk mendapat kecintaan dan keridhaan Allah. Begitu juga dalam mensyukuri nikmatnya dengan mendirikan shalat dan menjalankan seluruh ibadah dapat mendatangkan rahmat dan keutamaan dariNya. Adapun melupakan dan kufur kepada Allah hanya akan mendatangkan kemurkaan, kebencian, hukuman, dan adzab yang pedih. Pelajaran dari ayat : • Kewajiban mengingat Allah (dzikir) dengan membaca tahlil, takbir, tasbih, dan kewajiban bersyukur dengan cara menaatiNya. • Haramnya melupakan dzikir kepada Allah, dan termasuk dalam kekufuran orang yang tidak bersyukur atas nikmatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 152: Kemudian Allah memerintahkan hambanya untuk banyak berdzikir, barangsiapa yang banyak berdzikir akan mendapatkan balasan dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dzikrullah yang paling utama adalah jika diucapkan oleh lisan dan meresap di hati, inilah dzikr yang membuahkan ma'rifatullah (mengenal Allah), kecintaan-Nya dan pahala yang besar. Allah Subhaanahu wa Ta'aala di ayat ini memerintahkan kita untuk mengingat-Nya dan Dia menjanjikan balasan yang besar bagi mereka yang mengingat-Nya sebagaimana firman-Nya dalam hadits Qudsi: \"Jika ia mengingat-Ku di dalam dirinya, maka Aku akan mengingatnya di dalam diri-Ku. Jika ia mengingat-Ku di keramaian, maka Aku akan mengingatnya di keramaian yang lebih baik daripadanya.\" (Lihat Shahihul Jami' no. 8137) Dzikr adalah pusat syukur, oleh karena itu di ayat ini diperintahkan secara khusus untuk berdzikr, kemudian setelahnya diperintahkan secara umum untuk bersyukur. Yakni atas nikmat-nikmat Allah yang diberikan dan dihindarkan-Nya dari berbagai musibah. Syukur itu bisa dengan hati, yakni dengan mengakuinya, bisa dengan lisan yaitu dengan memujinya dan dengan anggota badan yaitu dengan menjalankan perintah Allah dan menjauhi larangan-Nya. Disebutkan perintah bersyukur setelah nikmat-nikmat agama berupa ilmu, penyucian jiwa dan taufiq untuk beramal untuk menerangkan bahwa nikmat-nikmat agama merupakan nikmat yang paling besar, bahkan ia merupakan nikmat yang hakiki yang akan kekal ketika semuanya sirna, dan sepatutnya bagi mereka yang diberi taufiq mencari ilmu dan mengamalkannya bersyukur kepada Allah terhadap nikmat tersebut agar Allah menambahkan karunia-Nya dan agar mereka dijauhkan dari sifat ujub. Ingkar atau kufur yang dimaksud di sini adalah ingkar kepada nikmat dan tidak mensyukurinya. Bisa juga makna kufur di sini adalah umum, yang paling parahnya adalah kufur kepada Allah kemudian maksiat yang berada di bawah syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 152",
    "description": "Atas semua kenikmatan itu, Allah menyuruh kaum muslim untuk selalu mengingat-Nya. Maka ingatlah kepada-ku, baik melalui lisan dengan melafalkan pujian, melalui hati dengan mengingat kekuasaan dan kebijaksanaan Allah, maupun melalui fisik dengan menaati Allah. Jika kamu mengingatku, aku pun pasti akan ingat kepadamu dengan melimpahkan pahala, pertolongan, dan kebahagiaan di dunia dan akhirat. Bersyukurlah pula kepada-ku atas nikmat-ku dengan menggunakannya di jalan-ku, dan janganlah kamu ingkar kepada-ku, kepada nikmatnikmatku, dan mempergunakannya untuk berbuat maksiat. Tidak saja melimpahkan nikmat-Nya, Allah juga menimpakan berbagai cobaan kepada orang yang beriman. Karena itu, Allah meminta mereka bersabar dan terus melaksanakan salat. Wahai orang-orang yang beriman! mohonlah pertolongan kepada Allah, baik dalam rangka melaksanakan kewajiban, menjauhi larangan, maupun menghadapi cobaan, yaitu dengan sabar dan salat yang disertai rasa khusyuk, sungguh, Allah beserta orang-orang yang sabar dengan memberikan pertolongan dan keteguhan hati dalam menghadapi segala cobaan."
  }
]