[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian orang-orang yang beriman, Mintalah bantuan dari Allah dalam seluruh urusan kalian dengan bersabar dalam menghadapi berbagai bala dan musibah, dan bersabar dalam meninggalkan maksiat-maksiat dan dosa-dosa ,serta bersabar dalam menjalankan ketaatan dan ibadah-ibadah serta amalan yang mendekatkan kepada Allah, dan dengan shalat yang menyebabkan jiwa-jiwa menjadi tentram, serta dapat menahan diri dari perbuatan keji dan munkar. Sesungguhnya Allah bersama orang-orang yang bersabar dengan pertolongan Nya, Taufik dan tuntunan Nya kepada jalan yang lurus. Dalam ayat ini terdapat dalil penetapan “Ma’iyyah” (kebersamaan) Allah yang khusus bagi kaum Mukminin, yang mendatangkan apa yang telah disebutkan. Adapun “ma’iyyah” (kebersamaan) yang bersifat umum yang bermakna mengetahui dan meliputi, maka itu berlaku umum pada semua makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Wahai orang-orang yang beriman, mintalah pertolongan dengan kesabaran dan salat untuk melakukan ketaatan kepada-Ku dan tunduk pada perintah-Ku. Sesungguhnya Allah bersama orang-orang yang sabar. Dia senantiasa membimbing dan menolong mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153. Hai orang-orang yang beriman kepada Allah dan Rasul-Nya, mohonlah pertolongan dari Allah dengan kesabaran dalam menghadapi musibah, ketaatan, menjauhi maksiat, dan dengan shalat yang dapat menguatkan hubungan dengan Allah. Sungguh Allah menolong dan memberi taufik kepada orang-orang yang sabar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. اسْتَعِينُوا۟ بِالصَّبْرِ وَالصَّلَوٰةِ ۚ (jadikanlah sabar dan shalat sebagai penolongmu) Yakni dalam menjalankan perintah-Nya dan cobaan yang Dia berikan kepada kalian. إِنَّ اللَّـهَ مَعَ الصّٰبِرِينَ (sesungguhnya Allah beserta orang-orang yang sabar) Yakni dengan memberikan apa yang mereka inginkan"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Selepas menyampaikan perintah-Nya untuk bersyukur, Allah kemudian menyampaikan perintah-Nya kepada ham-hamba Nya untuk bersabar, dan perintah agar mereka senantiasa meminta pertolongan dengan sabar dan shalat; karena sesungguhnya seorang hamba ketika ia dihadapkan dengan kenikamatan maka ia bersyukur, dan ketika suatu bencana mengadapinya maka ia sabar atasnya. 2 ). { اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ } Arahan robbani yang dirasakan berkahnya oleh salah seorang wanita muslimah ketika terkejut dengan hilanganya sejumlah anggota keluarganya dalam suatu peristiwa, tatkala musibah yang ia hadapi semakin memburuk seketika ia mengingat ayat ini dan bersegera mendirikan shalat, yakin dengan firman tuhannya, ia kemudian bersumpah bahwa masuk kedalam hatinya ketenangan yang besar dan musibah yang menghampiri terasa ringan. Itulah salah satu gambaran bukti pengaruh tadabbur ayat dan mengamalkan apa yang terkandung didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153. Wahai orang-orang mukmin, saling tolong menolonglah dengan penuh kesabaran dalam menanggung beban yang disyariatkan seperti shalat, puasa dan jihad, serta dengan melakukan shalat yang bisa mempererat hubungan dengan Allah, menghilangkan kesedihan, dan kebingungan. Sesungguhnya Allah menemani dan menyelamatkan orang-orang yang bersabar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, mohonlah pertolongan dengan sabar dan shalat. Sesungguhnya Allah beserta orang-orang yang sabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153. Allah memerintahkan kaum mukminin untuk meminta pertolongan dalam segala urusan mereka, baik dunia maupun akhirat “dengan sabar dan shalat.” Kesabaran adalah pengendalian dan penjagaan diri terhadap hal yang dibenci. Dan kesabaran ada 3 macam, yaitu sabar dalam ketaatan kepada Allah hingga mampu menunaikannya, sabar dalam kemaksiatan kepada Allah hingga menjauhinya, dan sabar atas takdir takdir Allah yang memilukan agar tidak memakinya. Kesabaran adalah pertolongan yang besar terhadap segala sesuatu, karena sama sekali tidak ada jalan bagi orang yang tidak bersabar untuk mendapatkan apa yang diinginkannya, khususnya dalam hal ketaatan yang sangat sulit dan berkesinambungan. Di mana hal itu sangatlah membutuhkan kesabaran dan keberanian untuk merasakan kepahitan yang menyakitkan. Namun jika pelakunya itu konsekuen dengan kesabarannya niscaya dia akan memperoleh kemenangan, namun bila dia dijauhkan oleh hal yang tidak disukai dan hal yang sulit dari kesabaran dan konsekuen terhadapnya niscaya dia tidak akan mendapatkan apa-apa kecuali kehampaan. Demikian pula dalam hal kemaksiatan yang mana dorongan nafsu dan godaannya yang begitu kuat untuk melakukannya, dan dia sendiri mampu melakukannya, dan ini tidaklah mungkin ditinggalkan kecuali dengan kesabaran yang besar serta menahan dorongan dan godaan nafsunya karena Allah, lalu dia meminta pertolongan kepadaNya untuk memeliharanya dari perbuatan tersebut, karena hal itu adalah termasuk fitnah-fitnah yang besar. Demikian juga, ujian yang paling berat khususnya bila berlanjut. Dan ini akan lemah dengan adanya kekuatan rohani dan jasmani, namun ujian tersebut akan menimbulkan kecaman bila dia tidak melawannya dengan kesabaran karena Allah, dan bertawakal kepadaNya dengan bersandar kepadaNya serta melakukannya secara terus menerus. Akhirnya anda ketahui bahwa kesabaran itu sangatlah dibutuhkan oleh seorang hamba, bahkan menjadi suatu yang darurat dalam setiap kondisi. Oleh karena itu Allah memerintahkan kepadanya dan mengabarkan bahwasanya dia “beserta orang-orang yang sabar,” maksudnya, beserta orang yang menjadikan kesabaran sebagai akhlak, sifat, dan karakternya dengan adanya pertolongan bimbingan dan arahanNya, hingga kesulitan dan kemalangan itu terasa sepele, segala hal yang besar terasa mudah dan segala kesusahan yang dirasakan akan lenyap. Ini adalah kebersamaan khusus yang akan menyebabkan kecintaan, pertolongan, pembelaan, dan kedekatanNya, dan Ini semua adalah keutamaan yang besar bagi orang-orang yang bersabar. Sekiranya orang-orang yang bersabar itu tidak memiliki keutamaan, kecuali mereka memperoleh kebersamaan dari Allah itu niscaya cukuplah bagi mereka hal itu sebagai keutamaan dan kemuliaan, adapun kebersamaan yang umum yaitu kebersamaan ilmu dan kekuasaan, sebagaimana dalam firman Allah ta'ala : \" Dan Dia bersama kamu di mana saja kamu berada\" QS Al Hadid ayat 4, maka ini bersifat umum untuk seluruh makhluk. Dan Allah memerintahkan untuk meminta pertolongan dengan shalat, karena salat adalah tiang agama dan cahaya kaum Mukminin, dan ia adalah penghubung antara seorang hamba dengan rabbnya. Apabila salat seorang hamba itu sempurna, ditambah dengan apa yang diwajibkan dan yang disunnahkan padanya. Shalat yang terisi oleh kehadiran hati yang merupakan intinya, hingga seorang hamba bila mulai melaksanakan shalat dia merasa masuk menemui Tuhannya dan berdiri berhadapan denganNya, sebagaimana berdirinya seorang pembantu yang bersopan santun dan penuh perhatian dengan apa yang dia bicarakan dan apa yang ia lakukan, serta terbuai dengan bermunajat kepada rabb-nya dan berdoa kepadaNya; maka tidak salah lagi bahwa shalat itu adalah sebesar-besar penolong dari segala perkara, karena salat itu mencegah dari perbuatan keji dan munkar dan karena kehadiran hati di dalam shalat itu mengharuskan adanya sebuah karakter dalam hati seorang hamba yang mengajaknya kepada pelaksanaan perintah rabbnya dan menjauhi larangan-laranganNya. Inilah shalat yang diperintahkan oleh Allah untuk dijadikan penolong dalam segala perkara."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الاستعانة } al-Isti’anah : Memohon pertolongan dalam perkataan dan perbuatan. { الصبر } ash-Shabr : Menahan diri untuk menghindari hal yang dibenci serta tegar menghadapi hal-hal yang tidak disukai. Makna ayat : Allah Ta’ala memanggil hamba-hambaNya yaitu orang Islam untuk menunjukkan kepada mereka, hal yang membantu tegar di atas kiblat pilihan Allah untuk mereka. Dan untuk tetap mengingat Rabbnya, bersyukur, tidak melupakanNya, dan tidak kufur kepadaNya. Allah berfirman “Hai orang-orang yang beriman mohonlah pertolongan..” yaitu atas tuntutan kepada kalian untuk tetap teguh, bersyukur, tidak melupakanNya, dan tidak kufur kepadaNya dengan kesabaran yang mana hal itu adalah dengan menahan diri serta melaksanakan perintah Allah Ta’ala dan dengan mendirikan shalat. Kemudian Allah memberitahukan bahwa Dia bersama dengan orang-orang yang sabar, memberikan pertolongan dan kekuatan. Apabila mereka mau bersabar, maka akan mendapatkan pertolongan dan kekuatan dari Allah. Inilah kandungan ayat 153. Pelajaran dari ayat : • Keutamaan dan perintah untuk bersabar, serta meminta pertolongan kepada Allah dengan bersabar dan melakukan shalat atas segala musibah dan beban yang menimpa. Dalam hadits disebutkan “bahwa Nabi ﷺ ketika menghadapi masalah beliau segera melakukan shalat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 153: Allah memerintahkan hamba-Nya yang beriman untuk senantiasa meminta kepada Allah dalam segala urusan mereka baik agama maupun dunia dengan sabar dan sholat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang mengartikan: mintalah pertolongan kepada Allah dengan sabar dan shalat. Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin untuk menghadapi urusan mereka baik terkait dengan agama maupun dunia dengan sabar dan shalat. Sabar artinya menahan diri terhadap hal-hal yang tidak disukai. Ia terbagi menjadi tiga bagian: Pertama, sabar dalam menjalankan perintah Allah. Kedua, sabar dalam menjauhi larangan Allah, dan ketiga, sabar dalam menghadapi musibah yang menimpa dengan tidak keluh kesah. Sabar berdasarkan ayat ini merupakan pertolongan yang paling besar dalam menghadap segala perkara. Sedangkan shalat diperintahkan juga agar dijadikan sebagai penolong karena shalat adalah tiang agama dan cahaya kaum mukmin, ia merupakan sarana penghubung antara seorang hamba dengan Tuhannya. Jika shalat sesorang hamba sempurna, menggabungkan yang wajib dengan yang sunat, ia pun melaksanakannya dengan khusyu' dan merasakan sedang berdiri di hadapan Tuhannya sebagaimana berdirinya seorang hamba yang menjadi pelayan dengan memperhatikan adab yang baik, memperhatikan apa yang dia baca dan dia lakukan, maka sudah pasti shalat tersebut menjadi penolong terbesar dalam semua masalah. Shalat tersebut akan mencegahnya dari perbuatan keji dan munkar, dan shalat seperti inilah yang dapat membantu mengatasi berbagai masalah. Allah Subhaanahu wa Ta'aala bersama mereka yang memiliki akhlak dan sifat sabar dengan memberikan pertolongan dan taufiq-Nya, sehingga masalah-masalah sukar dan berat menjadi ringan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 153",
    "description": "Tidak saja melimpahkan nikmat-Nya, Allah juga menimpakan berbagai cobaan kepada orang yang beriman. Karena itu, Allah meminta mereka bersabar dan terus melaksanakan salat. Wahai orang-orang yang beriman! mohonlah pertolongan kepada Allah, baik dalam rangka melaksanakan kewajiban, menjauhi larangan, maupun menghadapi cobaan, yaitu dengan sabar dan salat yang disertai rasa khusyuk, sungguh, Allah beserta orang-orang yang sabar dengan memberikan pertolongan dan keteguhan hati dalam menghadapi segala cobaandi antara cobaan yang dihadapi orang mukmin dalam mempertahankan keimanan mereka adalah berperang melawan kaum kafir. Dan jangan-lah kamu mengatakan bahwa orang-orang yang terbunuh di jalan Allah, mereka telah mati. Sebenarnya mereka hidup, tetapi kamu tidak menyadari-Nya. Mereka hidup di alam yang lain. Mereka mendapat kenikmatan yang demikian besar dari Allah."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Setelah Allah ta’ala selesai menyampaikan pembahasan mengenai perintah bersyukur pada ayat-ayat sebelumnya, maka pada ayat ini Allah ta’ala menjelaskan makna sabar dan bimbingan untuk memohon pertolongan melalui kesabaran dan sholat. Karena sorang hamba itu adakalanya ia mendapatkan nikmat kemudian mensyukurinya, atau ditimpa bencana kemudian bersabar atasnya. Sebagaiman yang dijelaskan dalamsebuah hadits dalam kitab Musnad Ahmad, Rosululloh sholallohu ‘alaihi wasalam bersabda : عجبا للمؤمن ، لا يقضي الله له قضاء إلا كان خيرا له : إن أصابته سراء ، فشكر ، كان خيرا له ; وإن أصابته ضراء فصبر كان خيرا له “sungguh menakjubkan perihal orang mukmin itu, Allah tidak menentukan suatu hal kecuali kebaikan baginya. Jika mendapatkan kebahagiaan,ia lalu bersyukur, maka yang demikian itu adalah baik baginya. Dan jika mendapatkan kesusahan,lalu ia bersabar, maka yang demikian itu adalah baik baginya”. (HR. Ahmad) Allah ta’ala juga menjelaskan bahwa sebaik-baik saran yang dapat membantu dalam menjalani berbagai musibah adalah kesabaran dan shalat. Sebagaimana firman-Nya dalam ayat lain : وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ “Jadikanlah sabar dan shalat sebagai penolongmu. Dan sesungguhnya yang demikian itu sungguh berat, kecuali bagi orang-orang yang khusyu',” (QS. Al-Baqoroh : 45) Dalam hadits juga disebutkan: “bahwa Rosululloh Shallallahu ‘alaihi wasallam jika menghadapi suatu masalah, maka beliau mengerjakan sholat” (HR. Ahmad dan Nasai) Kesabaran itu ada tiga macam : Pertama, sabar dalam meninggalkan berbagai hal yang diharamkan dan perbuatan dosa. Kedua, sabar dalam berbuat ketaatan dan mendekatkan diri kepada Allah ta’ala. Jenis sabar yang kedua ini lebih besar pahalanya,karena inilah yang dimaksud oleh ayat ini. Abdurahman bin Zaid bin Aslam; “sabar itu pada dua pintu, yaitu sabar dalam menjalankan sesuatu yang disukai Allah walaupun berat atas jiwa dan raga, dan sabar meninggalkan sesuatu yang dibenci Allah walaupun terasa enteng dan diinginkan oleh syahwat. Ali bin Husain Zainul Abidin berkata :”apa bila Allah telah mengumpulkan manusia dari yang pertama sampai yang terahir, maka diserula oleh Sang Penyeru, “dimana orang-orang yang sabar? Suruh mereka masuk kedalam surge sebelum dihisab” dia berkata, maka berdirila beberpa orang dari manusi dan bertemu dengan para Malaikat, lalu malaikat itu bertanya kepada mereka “mau kemana kalian wahai anak adam?”, maka mereka menjawab, “kami mau ke surge”. Kemudia Malaikat bertanya lagi, “sebelum kalian dihisab?”. Mereke menjawab, “Ya”. Lalu Malaikat bertanya lagi, “siapa gerangan kalian ini”. Mereka menjawab, “kami adalah orang-orang yang sabar”. Malaikat bertanya lagi, “apa yang kalian sabar atasnya?”. Mereka menjawab, “kami sabar dalam ketaatan kepada Allah dan sabar dalam meninggalkan kemaksiatan Kepada-Nya sampai kami meninggal.” Maka Malaikat berkata kepada mereka, “kalian seperti apa yang kalian ucapkan, maka masuklah kalian ke dalam surge, itulah sebaik-baik pahala dari amalan kalian”. Berkenaan dengan Hal di atas, Ibnu katsir mempertegas dengan firman Allah Ta’ala : إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ “Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas” (QS. Az-Zumar : 10) Ketiga, sabar dalam menghadapi berbagai cobaan dan ujian serta musibah. Sabar dalam menghadapi ujian dan musibah dari Allah adalah suatu kewajiban bagi seorang mukmin, nengingat bahwa ujian dalam kehidupan adalah sebuah kepastian baginya, sebagaimana firman-Nya : وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ * الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ * أُولَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ “Dan sungguh akan Kami berikan cobaan kepadamu, dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa dan buah-buahan. Dan berikanlah berita gembira kepada orang-orang yang sabar. (yaitu) orang-orang yang apabila ditimpa musibah, mereka mengucapkan: \"Inna lillaahi wa innaa ilaihi raaji'uun\".Mereka itulah yang mendapat keberkatan yang sempurna dan rahmat dari Tuhan mereka dan mereka itulah orang-orang yang mendapat petunjuk.” (QS. Al-Baqoroh :155-157)"
  }
]