[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian -wahai kaum mukminin- mengatakan tentang orang-orang yang terbunuh dalam berjihad dijalan Allah itu mati, Bahkan mereka itu hidup dalam kehidupan yang khusus berlaku pada mereka di kubur-kubur mereka, yang tidak ada yang mengetahui bentuknya kecuali Allah, akan tetapi kalian tidak dapat merasakannya. Dalam ayat ini terkandung dalil tentang adanya nikmat kubur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "154. Janganlah kamu -wahai orang-orang mukmin- mengatakan bahwa orang-orang yang gugur di medan jihad fi sabilillah itu mati seperti yang lain. Mereka itu hidup di sisi Rabb mereka, tetapi kamu tidak mengetahui kehidupan mereka, karena kehidupan mereka itu adalah kehidupan istimewa yang tidak ada cara lain untuk mengetahuinya kecuali melalui wahyu dari Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "154. Dan janganlah kalian menyebut orang-orang yang syahid dalam berjihad di jalan Allah sebagai orang-orang yang mati; sebab mereka tetap hidup dalam kubur mereka, namun kalian tidak mengetahuinya, karena tidak ada yang memahami hakikatnya kecuali Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "154. وَلَا تَقُولُوا۟ لِمَن يُقْتَلُ فِى سَبِيلِ اللَّـهِ أَمْوٰتٌۢ ۚ (Dan janganlah kamu mengatakan terhadap orang-orang yang gugur di jalan Allah, (bahwa mereka itu) mati) Yakni bahwa mereka telah mati. بَلْ أَحْيَآءٌ وَلٰكِن لَّا تَشْعُرُونَ (bahkan (sebenarnya) mereka itu hidup, tetapi kamu tidak menyadarinya) Akan tetapi mereka hidup namun kalian tidak merasakan kehidupan mereka saat ruh-ruh mereka dicabut dari tubuh mereka; sehingga kalian menganggapnya secara kasat mata telah mati padahal kenyataannya bukan seperti itu, akan tetapi mereka hidup di alam barzakh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "154. Janganlah kalian menganggap bahwa para syuhada’ yang terbunuh di jalan Allah itu mati, namun kenyataannya mereka itu hidup di alam barzakh, dan kalian tidak bisa merasakan kehidupan ini ketika menyaksikan jasad-jasad mereka dan dicabutnya ruh mereka. Ayat ini turun untuk para korban perang Badar. Mereka itu sekitar puluhan orang, yaitu 8 orang dari kaum Anshar dan 6 orang dari kaum Muhajirin. Orang-orang berkata tentang orang yang terbunuh di jalan Allah: “Fulan telah mati, kenikmatan dan kelezatan dunia telah lenyap darinya” Lalu Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian berkata bahwa orang-orang yang terbunuh di jalan Allah itu telah mati. Mereka hidup, tetapi kamu tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "154. Ketika Allah menyebutkan perintah untuk menjadikan kesabaran sebagai penolong dalam segala hal, lalu dia menyebutkan sebuah contoh dalam menjadikan kesabaran sebagai penolong, yaitu berjihad di jalanNya, dan dimana jihad itu merupakan ketaatan paling utama yang bersifat jasmani dan suatu hal yang paling berat bagi jiwa karena kesulitan yang ada dalam dirinya berkaitan dengan nyawa, dan karena hal itu bisa mengakibatkan kematian serta kehilangan nyawa yang hanya disukai oleh orang-orang yang cinta kepada dunia agar mendapatkan kehidupan dan sumber-sumbernya, dan semua yang mereka lakukan adalah sebuah usaha untuk mendapatkan kehidupan dan menolak hal yang bertentangan dengannya. Dan telah diketahui bahwa sesuatu yang dicintai tidak akan ditinggalkan oleh seorang yang berakal, kecuali kepada suatu hal yang dicintai yang lebih tinggi dan lebih agung. Maka Allah mengabarkan bahwa barangsiapa yang terbunuh di jalanNya yaitu berperang dijalan Allah dengan maksud untuk meninggikan kalimat Allah dan agamanya yang jelas dan bukan karena tujuan lainnya, niscaya dia tidak akan kehilangan kehidupan yang dia cintai, bahkan dia akan memperoleh kehidupan yang lebih utama dan lebih sempurna daripada apa yang kalian perkirakan dan pikirkan. Maka orang-orang yang mati syahid itu adalah : \"bahkan mereka itu hidup disisi Tuhannya dengan mendapat rezeki. Mereka dalam keadaan gembira disebabkan karunia Allah yang diberikan-Nya kepada mereka, dan mereka bergirang hati terhadap orang-orang yang masih tinggal di belakang yang belum menyusul mereka, bahwa tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati. Mereka bergirang hati dengan nikmat dan karunia yang yang besar dari Allah, dan bahwa Allah tidak menyia-nyiakan pahala orang-orang yang beriman.\" QS. Ali Imron ayat 169 171 Adakah yang lebih agung dari kehidupan tersebut yang mengandung kedekatan dengan Allah dan menikmati rizkiNya yang bersifat jasmani seperti makanan dan minuman yang lezat serta rizki yang bersifat rohani, seperti kesenangan, hilangnya segala kekhawatiran, dan kesedihan? Inilah kehidupan alam barzah yang lebih sempurna dari kehidupan dunia bahkan nabi telah mengabarkan bahwa ruh para syuhada ada dalam perut (tembolok) burung hijau yang minum dari sungai-sungai surga, makan buah-buahan surga, dan berlindung dalam sangkar sangkar yang digantung di bawah Arasy. (HR. Muslim No.. 1887) Ayat ini mengandung anjuran paling besar untuk berjihad di jalan Allah dan konsisten di atas kesabaran padanya, jikalau hamba merasakan apa yang didapatkan oleh orang-orang yang terbunuh di jalan Allah berupa pahala, niscaya tidak akan ada seorang pun yang mau terlambat melakukannya. Namun karena tidak adanya pengetahuan pasti yang sempurna itulah yang membuat hilangnya tekad, bertambah lelaplah orang yang tidur serta terlewatkan lah ganjaran yang agung dan ghanimah, kenapa tidak begitu, padahal Allah telah berfirman : \"Sesungguhnya Allah telah membeli dari orang-orang mukmin diri dan harta mereka dengan memberikan surga untuk mereka. Mereka berperang pada jalan Allah; lalu mereka membunuh atau terbunuh. (Itu telah menjadi) janji yang benar dari Allah di dalam Taurat, Injil dan Al Quran. Dan siapakah yang lebih menepati janjinya (selain) daripada Allah? Maka bergembiralah dengan jual beli yang telah kamu lakukan itu, dan itulah kemenangan yang besar.\" QS. at-taubah ayat 111 Demi Allah sekiranya manusia memiliki 1000 jiwa yang kemudian jiwa tersebut akan pergi satu persatu di jalan Allah, tidaklah menjadi suatu yang agung dibanding dengan pahala yang besar tersebut. Oleh karena itu, tidaklah para syuhada berangan-angan setelah mereka pasti mendapatkan ganjaran dan pahala yang baik dari Allah, kecuali mereka ingin dikembalikan ke dunia hingga mereka dapat terbunuh lagi di jalanNya sekali lagi dan sekali lagi. Ayat ini adalah dalil yang menunjukkan adanya kenikmatan alam barzah dan siksanya sebagaimana banyak sekali ayat yang menunjukkan hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الشعور } asy-Syu’ur : Perasaan yang menghantarkan kepada pengetahuan. Makna ayat : Pada ayat 154 mengandung larangan untuk meyakini bahwa orang yang terburuh di jalan Allah itu sudah mati, akan tetapi mereka hidup di alam barzakh, belum mati, akan tetapi mereka hidup di dalam surga mendapatkan rezeki dari Allah. Sebagaimana sabda Rasulullah ﷺ : أرواح الشهداء في حواصل طيور خضر تسرح في الجنة حيث شاءت ثم تأوي إلى قناديل معلقة تحت العرش “Arwah para syuhada’ dibawa oleh burung-burung hijau yang berkeliaran di surga sekehendak hatinya, kemudian mereka tinggal di dalam lampu-lampu gantung di bawah ‘arsyi.” (HR Muslim). oleh karena itu orang yang mati terbunuh di jalan Allah tidak dikatakan sudah mati, akan tetapi mereka telah menjadi syahid dan hidup di sisi Rabbnya. Kehidupan yang belum pernah kita rasakan karena belum meninggalkan kehidupan di dunia ini. Pelajaran dari ayat : • Keutamaan orang yang mati syahid dibandingkan yang lainnya, mereka hidup di sisi Rabbnya dengan kehidupan yang sempurna dibandingkan kehidupan lainnya di dalam surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 154: Allah meminta orang-orang yang beriman tidak berkata bagi siapa yang terbunuh dijalan Allah dengan mayitm bahkan mereka hidup dan diberi rezeki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan kita agar menjadikan sabar dan shalat sebagai penolong untuk menghadapi semua masalah, Dia menyebutkan contoh permasalahan yang patut dihadapi dengan sabar, yaitu jihad fii sabilillah. Jihad merupakan keta'atan badan yang paling utama dan paling berat bagi jiwa karena membawa kepada kematian, padahal orang-orang mencintai dunia karena ingin hidup di sana, bahkan tindakan sehari-hari yang mereka lakukan juga bertujuan agar dapat hidup di sana. Sudah menjadi maklum, bahwa hal yang dicintai tidaklah ditinggalkan oleh orang-orang yang berakal selain untuk memperoleh hal yang lebih dicintai lagi, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa orang yang berperang di jalan Allah agar kalimat Allah menjadi tinggi dan agar agama-Nya menjadi tegak, pada hakikatnya ia tidak kehilangan kehidupan yang dicintainya itu, bahkan ia memperoleh kehidupan yang lebih besar dan lebih sempurna dari apa yang kita perkirakan. Para syuhada sebagaimana disebutkan dalam surat Ali Imran: 169-171, adalah orang-orang yang hidup di sisi Allah, memperoleh rezki serta bergembira karena karunia yang diberikan-Nya dan tidak lagi khawatir dan bersedih. Kehidupan apa yang lebih baik daripada kehidupan seperti ini; dekat dengan sisi Allah, memperoleh rezki bagi badan berupa makanan dan minuman yang enak, memperoleh rezki bagi ruh berupa kegembiraan, hilangnya rasa takut dan kesedihan. Mereka hidup di alam Barzakh. Nabi shallallahu 'alaihi wa sallam memberitahukan dalam haditsnya bahwa ruh para syuhada berada di perut-perut burung hijau, di mana burung-burung itu mendatangi sungai-sungai surga dan memakan buah-buahannya, kemudian pulang ke lampu-lampu yang menempel di 'Arsy. Dalam ayat ini terdapat anjuran untuk berjihad fii sabilillah dan bersabar di atasnya. Jika sekiranya orang-orang mengetahui balasan yang diperoleh para syuhada, tentu tidak akan ada seorang pun yang meninggalkannya. Akan tetapi, karena tidak adanya ilmu yang yakin akhirnya ia tidak mau berjihad. Bahkan jika sekiranya manusia memiliki seribu nyawa, lalu masing-masing nyawa itu melayang satu-persatu tentu tidak akan dapat mengalahkan pahala yang besar ini. Oleh karena itu, tidak ada yang diinginkan para syuhada' setelah mereka melihat langsung pahala Allah dan balasannya selain ingin kembali ke dunia agar mereka terbunuh lagi beberapa kali. Hidup di alam barzakh memperoleh kenikmatan yang luar biasa. Ayat ini menunjukkan adanya nikmat kubur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 154",
    "description": "Di antara cobaan yang dihadapi orang mukmin dalam mempertahankan keimanan mereka adalah berperang melawan kaum kafir. Dan jangan-lah kamu mengatakan bahwa orang-orang yang terbunuh di jalan Allah, mereka telah mati. Sebenarnya mereka hidup, tetapi kamu tidak menyadari-Nya. Mereka hidup di alam yang lain. Mereka mendapat kenikmatan yang demikian besar dari Allah. Kehidupan manusia memang penuh cobaan. Dan kami pasti akan menguji kamu untuk mengetahui kualitas keimanan seseorang dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa, dan buahbuahan. Bersabarlah dalam menghadapi semua itu. Dan sampaikanlah kabar gembira, wahai nabi Muhammad, kepada orang-orang yang sabar dan tangguh dalam menghadapi cobaan hidup, yakni orang-orang yang apabila ditimpa musibah, apa pun bentuknya, besar maupun kecil, mereka berkata, inna' lilla'hi wa inna' ilaihi ra'ji'un (sesungguhnya kami milik Allah dan kepada-Nyalah kami kembali). Mereka berkata demikian untuk menunjukkan kepasrahan total kepada Allah, bahwa apa saja yang ada di dunia ini adalah milik Allah; pun menunjukkan keimanan mereka akan adanya hari akhir. Mereka itulah yang memperoleh ampunan dan rahmat dari tuhannya, dan mereka itulah orang-orang yang mendapat petunjuk sehingga mengetahui kebenaran."
  }
]