[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara karakter sifat orang-orang yang sabar itu bahwa mereka sesungguhnya ketika ditimpa sesuatu yang tidak mereka sukai, mereka mengatakan “Sesungguhnya kami adalah hamba sahaya milik Allah, di bawah pengaturan perintah dan kendali Nya, Dia melakukan apa saja yang dikehendaki-Nya kepada kami dan Sesungguhnya kami akan kembali kepada Nya melalui kematian,kemudian kebangkitan untuk menghadapi perhitungan amal dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "156. Yaitu orang-orang yang apabila ditimpa salah satu musibah dari musibah-musibah tersebut mereka berkata dengan nada rida dan pasrah, “Sesungguhnya kami adalah milik Allah yang dapat memperlakukan kami menurut kehendak-Nya. Dan sesungguhnya kami akan kembali kepadanya kelak pada hari kiamat. Dia lah yang telah menciptakan kami dan menganugerahkan beragam nikmat kepada kami. Dia lah tempat kami kembali dan ujung dari urusan kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Allah menjelaskan bahwasannya mereka tertimpa musibah bersabar dan berusaha serta mengatakan : segala milik Allah dan segala akan kembali padaNya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "156. مُّصِيبَةٌ (musibah) Yakni segala musibah yang menyebabkan kesedihan pada hati seseorang meskipun kecil. إِنَّا لِلَّـهِ وَإِنَّآ إِلَيْهِ رٰجِعُونَ (kami adalah milik Allah dan kepada-Nya kami kembali) Kalimat ini sebagai tempat pertolongan bagi orang-orang yang terkena musibah dan perlindungan bagi orang-orang yang mendapat cobaan karena didalamnya terkumpul makna pengakuan penghambaan kepada Allah dan pengakuan kepada hari kebangkitan dan dunia bukanlah akhir dari segalanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "155-156 1 ). Ridho atas takdir-taqdir yang tidak disenangi adalah hal yang sangat dianjurkan, dan sabar atasnya adalah kewajiban, Hasan al-Bashri mengatakan : \"keridhoan itu mulia, tetapi kesabaran adalah sandaran yang lebih utama bagi seorang mukmin\". 2 ). Tatkala kamu menjadikan al-Qur'an sebagai tafsir segala kejadian yang menghadapimu dalam kehidupan ini; akan nampak dihadapanmu bahwasanya musibah-musibah itu berganti sejak kejadiannya menjadi kebaikan yang senantiasa menjadi penuntunmu dalam kebaikan dan sabar yang indah. Tadabburilah ayat ini dan ayat setelahnya, agar kamu mengetahui manhaj yang tiada tandingnya yang Allah anugerahkan secara khusus kepada orang-orang beriman : { الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ } \"(yaitu) orang-orang yang apabila ditimpa musibah, mereka mengucapkan: “Inna lillaahi wa innaa ilaihi raaji’uun\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "156. Orang-orang yang bersabar adalah orang-orang ketika dihadapkan kepada musibah bisa membuat menderita, mereka akan berkata: “Sesungguhnya Kami milik Allah, dan hanya kepadaNyalah Kami akan kembali, atau Sesungguhnya Kami adalah hamba-hamba Allah dan akan kembali kepadaNya setelah mati”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) orang-orang yang apabila ditimpa musibah, mereka mengucapkan “Sesungguhnya kami adalah milik Allah} sesungguhnya kami adalah hamba dan milik Allah. Dia melakukan segala sesuatu kepada kami sesuai kehendakNya {dan sesungguhnya hanya kepadaNyalah kami kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "156. “Yaitu orang-orang yang apabila ditimpa musibah,” yaitu segala hal yang menyakitkan hati atau tubuh atau keduanya dari segala hal yang telah disebutkan sebelumnya “mereka mengucapkan innalillah,” maksudnya, kami adalah milik Allah yang diatur di bawah perintah dan kekuasaannya. Kami tak punya hak sedikitpun terhadap harta maupun diri kami sendiri, bila Dia menguji kami dengan mengambil atau memusnahkan sesuatu darinya, maka pada hakikatnya Dia yang maha pengasih telah melakukan tindakan terhadap hamba-hamba miliknya dan harta-harta mereka. Oleh karena itu tidak perlu ada gugatan sama sekali terhadap semua itu bahkan termasuk kesempurnaan penghambaan seorang hamba adalah pengetahuannya bahwa terjadi suatu cobaan itu adalah dari yang memiliki lagi maha bijaksana, yang mana dia adalah dzat yang paling pengasih terhadap hamba-Nya daripada diri hamba itu sendiri. Dengan demikian, hamba itu haruslah Ridho terhadap Allah dan bersyukur kepadaNya atas pengaturannya kepada sesuatu yang lebih baik bagi hamba-Nya walaupun hamba itu sendiri tidak sadar akan hal tersebut. Dan keadaan bahwa kami ini milik Allah, bersama itu kami juga akan kembali kepadaNya pada hari kebangkitan nanti. Lalu Dia akan membalas setiap perbuatan dari pelakunya, bila kami bersabar dan hanya mengharap pahala di sisi-Nya kami akan memperoleh ganjaran secara sempurna disisi-Nya, namun bila kami tidak bersabar dan mencaci-maki niscaya kami tidak memiliki apa-apa kecuali hanya murka dan lenyapnya pahala. Keberadaan seorang hamba bahwa dia milik Allah dan akan kembali kepadaNya adalah faktor terbesar yang menyebabkan tumbuhnya kesabaran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { المصيبة } al-Mushiibah : Bahaya yang menimpa hamba baik menimpa dirinya, keluarganya, atau hartanya. Makna ayat : Ayat 156 menjelaskan keadaan orang-orang yang bersabar yaitu ketika mereka tertimpa musibah mereka mengatakan “Sesungguhnya kami milik Allah”, maka dengan kehendakNya Dia menimpakan ujian karena kami adalah hamba dan milikNya. “Dan hanya kepadaNya lah kami kembali” dengan kematian, maka tidak ada rasa gundah gulana, yang ada hanya menerima hukumNya dan ridha dengan takdirNya. Pelajaran dari ayat : • Keutamaan mengucap kalimat istirja’ “Innaa lillahi wa innaa ilaihi raji’uun”. Dalam hadits shahih disebutkan bahwa Rasulullah ﷺ bersabda : “Ketika seorang hamba tertimpa musibah, kemudian dia mengucapkan “Innaa lillahi wa innaa ilaihi raji’uun, Allahumma’ jurniiy fii mushiibatiy wakhlif liy khairan minhaa” kecuali Allah akan memberikan pahala atas musibahnya dan mengganti untuknya yang lebih baik.” (HR Muslim)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 156: Musibah adalah semua yang membuat hati, badan atau kedua-duanya terasa sakit atau pedih. Maksudnya: kita milik Allah, di bawah pengaturan dan tindakan-Nya, Dia berbuat kepada milik-Nya apa yang Dia kehendaki, kita tidak memiliki apa-apa terhadap jiwa dan harta sedikit pun. Oleh karena itu, jika Dia menimpakan ujian kepada kita, maka sesungguhnya itu merupakan tindakan dari Yang Maha Penyayang kepada milik-Nya, maka tidak boleh diprotes. Bahkan termasuk sempurnanya pengabdian seorang hamba adalah dia merasakan bahwa musibah yang menimpanya berasal dari Pemilik dirinya, Tuhan yang Maha Bijaksana yang lebih sayang kepada dirinya daripada sayangnya seorang hamba kepada dirinya sendiri. Oleh karena itu, sikap yang harus dilakukan adalah ridha, bersyukur karena diatur oleh-Nya kepada hal yang lebih baik bagi dirinya meskipun ia tidak menyadari. Di samping kita sebagai milik-Nya, kita juga akan kembali kepada-Nya pada hari kiamat, lalu masing-masing akan diberi balasan sesuai amalnya. Jika kita bersabar dan mengharap pahala dari Allah Subhaanahu wa Ta'aala, maka kita akan mendapatkan pahala secara penuh di sisi-Nya, sedangkan jika kita berkeluh kesah, maka tidak ada yang kita peroleh selain keluh kesah, musibah dan hilangnya pahala. Memahaminya seorang hamba bahwa dirinya adalah milik Allah dan akan kembali kepada-Nya merupakan sebab terkuat untuk memperoleh kesabaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 156",
    "description": "Kehidupan manusia memang penuh cobaan. Dan kami pasti akan menguji kamu untuk mengetahui kualitas keimanan seseorang dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa, dan buahbuahan. Bersabarlah dalam menghadapi semua itu. Dan sampaikanlah kabar gembira, wahai nabi Muhammad, kepada orang-orang yang sabar dan tangguh dalam menghadapi cobaan hidup, yakni orang-orang yang apabila ditimpa musibah, apa pun bentuknya, besar maupun kecil, mereka berkata, inna' lilla'hi wa inna' ilaihi ra'ji'un (sesungguhnya kami milik Allah dan kepada-Nyalah kami kembali). Mereka berkata demikian untuk menunjukkan kepasrahan total kepada Allah, bahwa apa saja yang ada di dunia ini adalah milik Allah; pun menunjukkan keimanan mereka akan adanya hari akhir. Mereka itulah yang memperoleh ampunan dan rahmat dari tuhannya, dan mereka itulah orang-orang yang mendapat petunjuk sehingga mengetahui kebenaran"
  }
]