[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka Orang-orang yang bersabar itu mereka mendapat sanjungan dari Tuhan mereka dan rahmat Agung dari Nya, dan mereka adalah orang-orang yang mendapatkan petunjuk menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Orang-orang yang memiliki sifat semacam itu akan disanjung oleh Allah di hadapan sekumpulan Malaikat yang paling tinggi dan mendapatkan rahmat dari-Nya. Mereka itulah orang-orang yang mendapat petunjuk ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "157. Orang-orang yang sabar itu mendapatkan derajat yang tinggi di sisi Allah, mereka berhak mendapat pujian dan rahmat dari Allah, dan Allah bersaksi bahwa mereka adalah orang-orang yang mendapat petunjuk menuju Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. صَلَوٰتٌ (keberkatan) Yakni ampunan dan pujian yang baik. ورحمة (dan rahmat) Yakni bagi mereka kasih sayang dan rahmat yang tiada henti."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ صَلَوَاتٌ } Lafazh ini datang dengan bentuk jamak; mengabarkan bahwa keberkataan dari-Nya sangatlah banyak, dan bahwasanya keberkatan itu sebagai motifasi untuk melakukan segala kebaikan didunia, dan di akhirat sebagai balasan bagi pelakunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157. Dan bagi orang-orang sabar itu ampunan dan pujian yang baik dari Allah, serta rahmat dan kebaikan. Mereka itu adalah orang-orang yang mendapatkan petunjuk menuju kebenaran dan keridhaan Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah yang memperoleh keberkahan} penghormatan yang baik {dan rahmat dari Tuhan mereka. mereka itulah orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157. “Mereka itulah,” yakni orang yang berlaku sabar yang disebutkan tadi “yang mendapatkan keberkahan yang sempurna dari rabb mereka,” yaitu pujian dan perubahan kondisi mereka “dan rahmat,” yang agung dan diantara rahmatnya kepada mereka adalah bahwa Allah memberi Taufik kepada mereka dengan kesabaran, yang membuat mereka mendapat pahala yang sempurna “dan mereka itulah orang-orang yang mendapat petunjuk,” yaitu orang-orang yang mengetahui kebenaran yaitu pengetahuan mereka bahwa mereka itu adalah milik Allah dan mereka itu akan kembali kepadaNya serta berbuat karenaNya. Dalam hal ini kesabaran mereka karena Allah. Ayat ini menunjukkan bahwa orang yang tidak bersabar akan mendapatkan kebalikannya yaitu celaan dari Allah, hukuman, kesesatan, dan kerugian. Maka alangkah besarnya perbedaan antara kedua golongan itu, alangkah sedikitnya kelelahan orang-orang yang bersabar dan alangkah besarnya kesulitan orang-orang yang berkeluh kesah. Kedua ayat ini mengandung penguatan jiwa terhadap musibah musibah sebelum terjadi, agar menjadi ringan dan mudah dihadapi bila terjadi, juga penjelasan tentang apa yang harus digunakan untuk menghadapinya pada saat terjadi musibah yaitu kesabaran, penjelasan tentang hal yang membantu dalam bersabar, serta pahala yang diperoleh oleh orang-orang yang bersabar. Ayat ini juga memberitahukan kondisi orang yang tidak bersabar dengan kebalikan dari kondisi orang-orang yang bersabar tadi dan bahwasanya ujian dan cobaan itu adalah sunnatullah yang telah berlaku atas orang-orang terdahulu, dan kamu sekali-kali tidak akan mendapati perubahan pada sunnatullah, serta penjelasan bermacam-macam musibah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الصلوات } ash-Shalawat : Kata Shalawat bentuk jamak dari shalat, arti shalawat dari Allah di sini adalah ampunan, karena digandengkan dengan kata rahmat. { وَرَحۡمَةٞۖ } Rahmat : Rahmat merupakan pemberian nikmat, yaitu dengan mendatangkan sesuatu yang menyenangkan dan mencegah sesuatu yang membahayakan. Rahmat yang paling besar adalah masuk ke dalam surga dan selamat dari api neraka. { ٱلۡمُهۡتَدُونَ } al-Muhtaduun : Orang yang mendapatkan petunjuk menuju kebahagiaan dan kesempurnaan hidup dikarenakan keimanan dan lulus dari ujian Allah, serta bersabar di atas hal itu semua. Makna ayat : Pada ayat 157 Allah Ta’ala memberikan kabar gembira kepada mereka orang-orang yang bersabar, dengan ampunan terhadap dosa-dosa mereka dan mendapatkan rahmat dari Rabbnya. Dan merekalah orang-orang yang mendapatkan petunjuk untuk memperoleh kebahagiaan dan kesempurnaan hidup. Allah Ta’ala berfirman “Merekalah yang mendapatkan keberkahan yang sempurna dan rahmat dari Rabbnya, dan mereka itulah orang-orang yang mendapat petunjuk.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 157: Allah mengabarkan bahwasannya mereka yang bersabar akan mendapatkan ujian dan kasih sayang dari tuhan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengartikan \"pujian\". Di antara rahmat-Nya kepada mereka adalah dengan memberikan taufiq untuk bersabar, di mana dengannya mereka memperoleh pahala yang sempurna. Yakni orang-orang yang mengetahui yang hak, dan dalam hal ini adalah pengetahuan mereka bahwa mereka milik Allah dan akan kembali kepada-Nya dan mereka mengamalkannya, yaitu dengan bersabar karena Allah. Allah Subhaanahu wa Ta'aala juga akan memberi petunjuk kepada hatinya untuk bersabar sebagaimana dalam firman-Nya \"wa may yu'min billah yahdi qalbah\" (lihat surat At Taghaabun: 11). Beberapa ayat di atas (dari ayat 155-157) menunjukkan bahwa barangsiapa yang tidak bersabar, maka ia akan memperoleh kebalikannya. Ia akan memperoleh celaan dari Allah, hukuman, kesesatan dan kerugian. Sungguh sangat berbeda dua golongan tersebut, sungguh ringan beban orang yang bersabar dan sungguh berat beban orang yang berkeluh kesah. Ayat di atas juga mempersiapkan jiwa seseorang agar siap menghadapi musibah dengan bersabar meskipun belum terjadi, menerangkan beberapa sebab yang membantu kesabaran, pahala yang diperoleh bagi mereka yang bersabar, menerangkan keadaan orang yang bersabar, menerangkan beberapa macam musibah dan bahwa ujian dan cobaan merupakan sunnatullah pada hamba-hamba-Nya, di mana kita tidak akan mendapati adanya perubahan dalam sunnatullah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 157",
    "description": "Kehidupan manusia memang penuh cobaan. Dan kami pasti akan menguji kamu untuk mengetahui kualitas keimanan seseorang dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa, dan buahbuahan. Bersabarlah dalam menghadapi semua itu. Dan sampaikanlah kabar gembira, wahai nabi Muhammad, kepada orang-orang yang sabar dan tangguh dalam menghadapi cobaan hidup, yakni orang-orang yang apabila ditimpa musibah, apa pun bentuknya, besar maupun kecil, mereka berkata, inna' lilla'hi wa inna' ilaihi ra'ji'un (sesungguhnya kami milik Allah dan kepada-Nyalah kami kembali). Mereka berkata demikian untuk menunjukkan kepasrahan total kepada Allah, bahwa apa saja yang ada di dunia ini adalah milik Allah; pun menunjukkan keimanan mereka akan adanya hari akhir. Mereka itulah yang memperoleh ampunan dan rahmat dari tuhannya, dan mereka itulah orang-orang yang mendapat petunjuk sehingga mengetahui kebenaran. Usai menjelaskan perihal kiblat, Allah lalu beralih menguraikan apa yang terkait dengan masjidilharam, yaitu bukit safa dan marwah. Sesungguhnya safa dan marwah, dua bukit di dekat kakbah (sekarang dalam lingkup masjidilharam) merupakan sebagian syi'ar agama Allah, karena orang yang haji dan umrah melakukan ritual ubudiyah dengan berlari kecil di antara keduanya. Maka barang siapa beribadah haji ke baitullah atau berumrah, tidak ada dosa baginya mengerjakan sai antara keduanya. Lakukanlah sai sesuai tuntunan Allah dan janganlah kamu merasa berdosa oleh istiadat kaum jahiliah yang mengusap patung di pucuk kedua bukit itu. Dan barang siapa dengan kerelaan hati mengerjakan kebajikan, maka Allah maha mensyukuri dengan memberikan pahala yang agung atas kebajikannya itu, dan dia pun maha mengetahui."
  }
]