[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Shafa dan Marwah (yaitu dua bukit kecil dekat Kabah dari arah Timur) termasuk simbol-simbol agama Allah yang Nampak yang Allah memerintahkan hamba-hambanya untuk beribadah dengan melakukan sa’i antara keduanya. Barang siapa berniat menuju Ka'bah untuk Haji atau umroh, maka tidak ada dosa atas dirinya dan tidak ada kesalahan baginya untuk melakukan Sa’i antara keduanya, Bahkan dia wajib melakukannya. Dan barangsiapa melaksanakan amal ketaatan dengan hati yang tulus dari dirinya, ikhlas menjalankannya karena Allah Ta'ala, maka sesungguhnya Allah Maha mensyukuri, Dia akan memberikan balasan atas amalan yang sedikit dengan pahala yang banyak. dan Dia maha mengetahui amal-amal perbuatan hamba-hambanya maka Dia tidak akan menyia-nyiakannya, dan tidak mengurangi amal seseorang sedikitpun walaupun sebesar biji sawi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Sesungguhnya dua bukit yang dikenal dengan nama Safa dan Marwah di dekat Ka'bah itu termasuk tanda-tanda syariat Islam yang nyata. Maka barangsiapa yang pergi ke Baitullah untuk menunaikan ibadah haji atau umrah tidak ada dosa baginya untuk melaksanakan sai di antara kedua bukit tersebut. Pernyataan “tidak ada dosa” di sini dimaksudkan untuk menenteramkan hati sebagian orang Islam yang segan melaksanakan sai di sana karena menganggap itu adalah bagian dari ritual jahiliah. Allah menjelaskan bahwa sai di antara Safa dan Marwah adalah bagian dari manasik haji. Barangsiapa melaksanakan ibadah-ibadah sunah secara sukarela dan ikhlas karena Allah, maka Allah akan berterima kasih kepadanya. Dia akan menerima ibadahnya dan akan memberinya balasan yang setimpal. Dan Dia Maha Mengetahui siapa yang berbuat baik dan berhak mendapatkan pahala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "158. Bukit Shafa dan Marwah merupakan bagian dari syi’ar ibadah untuk sa’i pada ibadah umrah dan haji. Maka barangsiapa yang menuju Baitul Haram untuk menunaikan haji atau umrah maka tidak mengapa bahkan wajib baginya untuk melakukan sa’i antara bukit Shafa dan Marwah, meski orang-orang musyrik juga sedang sa’i dan mendekatkan diri kepada berhala-berhala mereka di sana. Dan barangsiapa yang hendak melaksanakan haji atau umrah setelah hajinya selesai atau melaksanakan suatu kebaikan, maka Allah akan mensyukurinya dengan memberinya pahala, dan Dia Maha Mengetahui segala amal perbuatan hamba-Nya. Dikeluarkan oleh Imam Muslim dari hadits panjang yang diriwayatkan oleh Jabir, disebutkan bahwa Rasulullah setelah melaksanakan thawaf di Baitul Haram, ia menghadap ke sisi hajar aswad lalu ia memberi isyarat. Kemudian ia keluar menuju bukit Shafa, saat ia telah mendekati Shafa, ia membaca firman Allah: “{إن الصفا والمروة من شعائر الله} aku akan memulai dengan bukit yang disebutkan pertama oleh Allah.” Maka ia memulai sa’i dari bukit Shafa. (Shahih Muslim, kitab haji, bab haji Rasulullah, no. 1218). lihat: surat al-Baqarah: 233 pada firman-Nya: {فلا جناح عليهما}."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. إِنَّ الصَّفَا وَالْمَرْوَةَ (Sesungguhnya Shafaa dan Marwa) Keduanya adalah dua bukit yang ada di Makkah. مِن شَعَآئِرِ اللَّـهِ (adalah sebahagian dari syi’ar Allah) Yakni tanda dan ciri-ciri manasik haji. Dan maksudnya adalah tempat-tempat ibadah yang dijadikan Allah sebagai tanda bagi manusia, dan diantaranya adalah tempat berkumpul (Mauqif), tempat sa’i, dan tempat menyembelih. فَمَنْ حَجَّ الْبَيْتَ (Maka barangsiapa yang beribadah haji ke Baitullah) Yakni barangsiapa yang hendak melakukan ibadah haji ini. أَوِ اعْتَمَر (atau ber’umrah) Yakni umrah. Secara bahasa umrah berarti mengunjungi; dan secara istilah syar’i berarti menjalankan manasik-manasik yang telah kita ketahui bersama. أَن يَطَّوَّفَ (maka tidak ada dosa baginya mengerjakan sa’i) Kata (يطوف) asalnya (يتطوف). Dan makna thawaf antara shafa dan marwah yakni berlari-lari kecil diantara keduanya yang dilakukan ketika haji atau umrah. Sa’i hukumnya wajib dan bagian dari manasik. Dalam shalihain disebutkan dari Aisyah: bahwa Urwah berkata kepadanya: saya berpendapat makna dari ayat ini adalah seseorang tidak mengapa untuk tidak mengerjakan sa’i antara shafa dan marwah. Maka Aisyah menjawab: betapa buruknya apa yang kamu katakan wahai keponakanku, seandainya maknanya adalah seperti apa yang kamu katakan maka seharusnya ayatnya berbunyi (فلا جناح عليه أن لا يطوف بهما) “tidak mengapa untuk tidak mengerjakan thawaf diantara keduanya”; akan tetapi ayat ini turun karena kaum Anshar sebelum memeluk Islam mereka menyembelih kurban di Shofa dan Marwah untuk “manat” yang mereka sembah. Kemudian setelah mereka masuk Islam, orang-orang yang dulu menyembelih sesembahan itu merasa segan untuk melakukan thawaf di antara Shafa dan Marwah; kemudian Allah pun menurunkan ayat ini. Aisyah melanjutkan: Nabi juga telah menjelaskan hukum Thawaf diantara keduanya, maka tidak ada yang boleh meninggalkannya. Aku bersumpah Allah tidak akan menyempurnakan haji seseorang apabila belum melakukan sa’i antara Shafa dan marwah, dan begitu pula yang menjalankan umrah, karena Allah telah berfirman: ( إِنَّ الصَّفَا وَالْمَرْوَةَ من شعائر الله). Dan Rasulullah ketika ditanya dalam hal ini menjawab: “Sesungguhnya Allah mewajibkan atas kalian sa’i maka lakukanlah”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ } Pada lafazh : { خَيْرًا } mengabarkan keutamaan nafkah atau infaq yang dikeluarkan ketika berhaji atau umroh dengan hewan qurban atau selainnya yang bermanfaat bagi kaum faqir, dan penggunaan lafazh { خَيْرًا } adalah uslub yang penggunaan untuk rezki dan harta sudah menjadi 'urf, sebagaimana yang tertulis dalam firman Allah : { وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158. Sesungguhnya Shafa dan Marwah yang komposisinya dari batu yang menjulang yang digunakan sebagai permulaan dan akhiran orang yang sa’i itu termasuk tanda-tanda syiar haji atau tempat-tempat ibadah yang dikhususkan oleh Allah untuk memberi tanda bagi manusia bahwa itu adalah tempat untuk sa’i dan berkurban. Dan barangsiapa menuju Baitul Haram untuk berhaji karena suatu kewajiban atau untuk berumrah mengunjungi Baitul Haram, maka tiada dosa baginya dengan mengelilingi keduanya dengan melakukan sa’j antara keduanya dalam ibadah haji dan umrah. Hal tersebut merupakan kewajiban dan ibadah. Meskipun keduanya pada masa jahiliyah terdapat dua berhala, yaitu Isaf di atas Shafa dan Na’ilah di atas Marwah. Dan barang siapa memperbanyak ketaatannya dengan melakukan umrah, maka Allah berterima kasih atas ketaatannya itu. Imam Bukhari meriwayatkan dari Anas RA bahwa beliau ditanya tentang Shafa dan Marwa lalu menjawab: “Kita tahu bahwa keduanya itu merupakan perkara yang dilakukan pada masa Jahiliyyah, namun ketika Islam datang, kita menjaganya.” Lalu Allah menurunkan ayat {Innasshafa}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Safa dan Marwah merupakan sebagian tanda keagungan Allah.} dari tanda-tanda keagungan agama Allah {Maka siapa saja yang beribadah haji ke Baitullah atau berumrah, tidak ada dosa baginya} maka tidak ada dosa baginya {mengerjakan sa'i antara keduanya} melakukan sa’i di antara keduanya {Siapa saja yang dengan kerelaan hati mengerjakan kebajikan} dan siapa saja yang bertambah ketaatannya setelah melakukan kewajiban itu {maka sesungguhnya Allah Maha Mensyukuri lagi Maha Mengetahui."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "158. Allah mengabarkan “Sesungguhnya Shafa dan Marwa,” keduanya adalah tempat yang telah diketahui, “adalah sebagian dari syiar Allah,” yakni tanda-tanda agamaNya yang jelas yang dipakai oleh hamba-hambaNya untuk beribadah kepada Allah dengannya, dan apabila kedua tempat itu adalah di antara syiar-syiar Allah, maka Allah telah memerintahkan untuk mengagungkan syiar syiarNya seraya berfirman : \"Dan barangsiapa mengagungkan syi’ar-syi’ar Allah, maka sesungguhnya itu timbul dari ketakwaan hati.\" QS al-hajj ayat 32 Kedua nash di atas menunjukkan bahwa kedua tempat tersebut adalah diantara syiar-syiar Allah, dan mengagungkan syiar syiar Allah itu timbul dari ketakwaan hati, sedangkan ketaqwaan itu wajib atas orang-orang yang telah terbebani kewajiban (mukallaf). Dengan demikian, hal itu menunjukkan bahwa mmelakukan sai di antara dua tempat itu adalah sebuah kewajiban yang pasti dalam ibadah haji dan umroh, sebagaimana yang disepakati oleh mayoritas ulama, yang ditunjukkan oleh hadits-hadits dan perbuatan Nabi. Beliau bersabda “Ambilah contoh dari ku dalam manasik haji dan umrah kalian,” “Maka barangsiapa yang beribadah haji ke Baitullah atau berumroh maka tidak ada dosa baginya mengerjakan sai antara keduanya,” ayat ini adalah jawaban bagi orang yang ragu dan merasa bersalah di antara kaum muslimin yang melakukan sai antara keduanya, karena pada masa jahiliyah dulu, kedua tempat tersebut menjadi tempat disembahnya patung-patung, lalu Allah meniadakan dosa untuk menolak keraguan tersebut, bukan karena ia merupakan suatu yang tidak wajib. Pembatasan peniadaan dosa bagi orang yang sai di antara dua tempat itu saat ibadah haji dan umroh menunjukkan bahwa tidaklah seseorang melakukan sai secara tersendiri kecuali disertai dengan haji dan umroh, berbeda dengan tawaf di Baitullah, karena ia disyariatkan bersama umroh dan haji karena Ia merupakan ibadah yang tersendiri. Adapun sai, wukuf di Arafah dan Muzdalifah, serta melempar jumroh adalah bagian kegiatan yang mengikuti nusuk (tata cara haji), sekiranya anda melakukannya tanpa mengikuti nusuk, maka perbuatan itu adalah sebuah bid’ah, karena bid’ah itu ada dua macam: Pertama yang dilakukan untuk beribadah kepada Allah yang tidak disyariatkan sama sekali, dan kedua yang dilakukan untuk beribadah kepada Allah yang disyariatkan olehNya dalam bentuk tertentu tapi dikerjakan dengan bentuk yang lain; dan perbuatan ini termasuk dalam kategori kedua. FirmanNya, “Dan barangsiapa dengan kerelaan hati,” maksudnya, melakukan suatu ketaatan dengan ikhlas karena Allah Semata, “yang baik” seperti haji, umroh, tawaf, shalat, puasa, dan sebagainya, maka hal itu adalah baik baginya. Hal ini menunjukkan bahwa setiap kali ketaatan seorang hamba bertambah kepada Allah, maka bertambah pula kebaikannya, kesempurnaannya, dan derajatnya disisi Allah, karena bertambahnya keimanan dalam dirinya dan juga menunjukkan atas batas kerelaan hatinya dengan baik, dan bahwasanya barangsiapa yang melakukan suatu bid’ah dengan kerelaan hati, yang tidak disyariatkan oleh Allah dan tidak pula oleh rasulNya, niscaya dia tidak akan memperoleh apa-apa kecuali lelah semata, dan bukan suatu yang baik untuknya, bahkan kemungkinan bisa menjadi suatu yang buruk baginya jikalau dia melakukannya secara sengaja dan mengetahui tentang tidak disyariatkan nya amalan tersebut. “Maka sesungguhnya Allah Maha mensyukuri lagi Maha Mengetahui,” asy syakir dan asy syakur (Yang Maha mensyukuri) adalah diantara nama-nama Allah yang baik, di mana Dia menerima perbuatan yang sedikit sekalipun dari hambaNya, lalu Dia membalasnya dengan pahala yang besar, yakni bila seorang hamba menunaikan perintah perintahNya dan menunaikan ketaatan kepadaNya, niscaya Dia akan menolongnya, memujinya, dan membalasnya dengan memberikan cahaya (Hidayah), keimanan, dan kelapangan dalam hatinya, kekuatan dan semangat dalam dirinya, tambahan keberkahan dan peningkatan dalam segala kondisinya, bertambah Taufik dalam perbuatannya, kemudian setelah itu Dia mendahulukan balasan yang ditangguhkan di sisi rabbnya secara sempurna dan lengkap, dan tidak dikurangi oleh perkara-perkara tersebut. Dan diantara syukur Allah kepada hambaNya adalah bahwa barangsiapa yang meninggalkan sesuatu karena Allah, niscaya Allah akan menggantinya dengan sesuatu yang lebih baik darinya, barangsiapa yang mendekatkan diri kepadaNya sejengkal, Dia akan mendekat kepadanya satu hasta, barangsiapa yang mendekatkan diri kepada-Nya satu hasta, Dia akan mendekat kepadanya satu depa, barangsiapa yang menuju kepadaNya dengan berjalan, Dia akan menuju kepadanya dengan berlari kecil, dan barangsiapa yang bermuamalah denganNya, niscaya dia akan beruntung berlipat-lipat ganda. Dan disamping bahwa Allah adalah Maha bersyukur, Dia pun Maha Mengetahui siapa yang berhak memperoleh balasan sempurna sesuai dengan niat, keimanan, dan ketakwaannya dari orang yang tidak seperti itu, Maha mengetahui perbuatan hamba-hambaNya, tidak menyia-nyiakannya bahkan mereka akan mendapat balasan paling sempurna sesuai niat mereka yang diketahui oleh Allah yang Maha Mengetahui lagi Maha bijaksana."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلصَّفَا وَٱلۡمَرۡوَةَ } ash-Shafa wal Marwah : Shafa adalah bukit yang menghadap Ka’bah pada arah tenggara. Sedangkan Marwah adalah bukit yang menghadap Ka’bah dari arah utara. Jarak antara keduanya sekitar 760 hasta. { شَعَآئِرِ ٱللَّهِۖ } sya’aairillah : Tanda-tanda agamaNya. Merupakan bentuk jamak dari sya’iirah شعيرة yang berarti tanda untuk beribadah kepada Allah Ta’ala. Maka Sa’i di antara bukit Shafa dan Marwa merupakan suatu syiar (tanda) karena menunjukkan bentuk ketaatan kepada Allah. { الحَجُّ } al-Hajj : Mengunjungi (ziarah) Baitullah dengan maksud untuk melaksanakan ibadah tertentu yang disebut dengan manasik. { العُمْرَةُ } al-‘Umrah : adalah Mengunjungi Baitullah untuk melaksanakan thawaf mengelilingi Ka’bah dan melakukan Sa’i antara bukit Shafa dan Marwa, serta bertahallul dengan menggunduli rambut kepala atau memendekannya. { الجُنَاحُ } al-Junaah : Dosa yang diakibatkan oleh penyelisihan terhadap syariat, dengan meninggalkan amalan wajib atau melakukan sesuatu yang dilarang agama. { يَطَّوَّفَ } Yathhowwafa : Berjalan bolak-balik antara bukit Shafa dan Marwa { خَيۡرٗا } Khairan : al-Khair adalah nama bagi setiap hal yang mendatangkan kebahagiaan dan menjauhkan bahaya. Yang dimaksud di sini adalah amalan shalih. Makna ayat : Allah Ta’ala mengabarkan dalam ayat ini mengenai kewajiban untuk melakukan Sa’i antara Shafa dan Marwa, dan menyanggah anggapan sebagian kaum mukminin yang beranggapan bahwa melakukan Sa’i di antara keduanya berdosa. Karena pada masa jahiliyah dulu di atas Shafa terdapat berhala yang dinamakan Isaf, begitu juga di atas Marwa terdapat berhala yang dinamakan Na’ilah. Dua berhala ini sering diusap-usap oleh orang-orang yang melakukan Sa’i di antara dua bukit itu. Maka Allah Ta’ala berfirman (إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ ) “Sesungguhnya Shafa dan Marwah” yaitu melakukan Sa’i di antara keduanya “Adalah sebagian dari Syi’ar Allah” yaitu merupakan suatu bentuk ibadah di antara berbagai ibadah yang ada. Dahulu Ibrahim ‘alaihissalam dan anaknya yaitu Ismail serta anak keturunan mereka dari kalangan muslimin beribadah dengan sara melakukan Sa’i. Maka siapa saja yang mengunjungi Baitullah untuk melaksanakan ibadah haji atau umrah, hendaknya mereka melakukan Sa’i sebagai salah satu rukun haji dan umrah. Tidak ada dosa bagi mereka untuk melakukannya walaupun dulu kaum musyrikin juga melakukan Sa’i karena adanya dua berhala di bukit Shafa dan Marwah, yaitu patung Isaaf dan Na’ilah. Lantas Allah Ta’ala menjanjikan kepada hamba-hambaNya yang mukmin, bahwa siapa saja yang melakukan amalan kebaikan akan mendapatkan pahala. Karena Allah Ta’ala berterima kasih kepadda hamba-hambaNya yang mau melakukan amalan shalih dan membalasnya berdasarkan ilmu dan niat masing-masing orang. Inilah makna firman Allah Ta’ala “Dan barangsiapa mengerjakan suatu kebajikan dengan kerelaan hati, maka sesungguhnya Allah Ta’ala mensyukuri kebaikan lagi Maha mengetahui.” Pelajaran dari ayat : • Kewajiban untuk melakukan Sa’i di antara bukit Shafa dan Marwa bagi siapa saja yang berthawaf di Ka’bah baik untuk melaksanakan haji atau umrah. Rasulullah ﷺ bersabda : “Bersa’ilah karena Allah Ta’ala mewajibkan kalian melakukannya.” (HR Daruquthni). Nabi ﷺ telah melakukan sa’i dalam seluruh umrahnya dan ibadah hajinya. • Tidak mengapa untuk shalat di masjid yang dulunya adalah gereja, atau di tempat yang dulunya merupakan tempat peribadahan orang kafir. • Anjuran untuk melakukan amalan kebaikan selain yang wajib, yaitu amalan sunnah seperti thawaf, shalat, puasa, sedekah, berjaga-jaga di perbatasan, dan jihad."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 158: Allah mengabarkan bahwasannya shofa dan marwah adalah tanda-tanda keagamaan yang nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Urwah, bahwa ia berkata: Aku pernah bertanya kepada Aisyah radhiyallahu 'anha, \"Beritahukanlah kepadaku firman Allah Ta'ala, \"Innash shafa wal marwata…dst. sampai ay yaththawwafa bihimaa.\" Demi Allah, (yang demikian menunjukkan) tidak ada dosa bagi seseorang untuk tidak bersa'i antara Shafa dan Marwah.\" Aisyah menjawab, \"Buruk sekali apa yang kamu katakan, wahai putera saudariku! Sesungguhnya ayat ini jika seperti apa yang kamu tafsirkan, maka berarti tidak ada dosa bagi seseorang untuk tidak bersa'i antara Shafa dan Marwah. Akan tetapi, ayat ini turun berkenaan dengan orang-orang Anshar, di mana mereka sebelum masuk Islam berihlal (bertalbiyah) untuk berhala Manat yang mereka sembah di Musyallal. Di antara orang yang berihlal itu merasa berdosa bersa'i antara Shafa dan Marwah. Ketika mereka telah masuk Islam, mereka bertanya kepada Rasulullah shallallahu 'alaihi wa sallam tentang hal itu. Mereka bertanya, \"Wahai Rasulullah, sesungguhnya kami merasa berdosa bersa'i antara Shafa dan Marwah,\" maka Allah menurunkan ayat, \"Innash shafaa wal marwata min sya'aairillah..dst.\" Aisyah berkata, \"Rasulullah shallallahu 'alaihi wa sallam telah menetapkan bersa'i antara Shafa dan Marwah, oleh karena itu tidak boleh bagi seorang pun meninggalkan bersa'i antara Shafa dan Marwah.\" Kemudian Aisyah memberitahukan kepada Abu Bakar bin Abdurrahman, lalu Abu Bakar berkata, \"Sesungguhnya ilmu ini belum pernah aku dengar. Bahkan aku mendengar beberapa orang ahli ilmu menyebutkan, bahwa orang-orang –selain yang disebutkan Aisyah yang berihlal dengan Manat- mereka bersa'i di Shafa dan Marwah. Karena Allah Ta'ala hanya menyebutkan thawaf di Baitullah, dan tidak menyebutkan bersa'i antara Shafa dan Marwah dalam Al Qur'an, mereka berkata, \"Wahai Rasulullah, kami bersa'i antara Shafa dan Marwah, padahal yang Allah turunkan (dalam kitab-Nya) adalah berthawaf di Baitullah dan tidak menyebutkan Shafa dan Marwah. Oleh karena itu, apakah kami berdosa jika kami bersa'i di Shafa dan Marwah?\" Maka Allah menurunkan ayat, \"Innash shafaa wal marwata min sya'aairillah..dst.\" Abu Bakar berkata, \"Dengarkanlah ayat ini, ia turun berkenaan kedua pihak itu; tentang orang-orang yang merasa berdosa bersa'i antara Shafa dan Marwah di zaman Jahiliyyah dan orang-orang yang berthawaf (di Baitullah) kemudian mereka merasa berdosa bersa'i antara Shafa dan Marwah karena Allah Ta'ala hanya memerintahkan thawaf di Baitullah dan tidak menyebutkan bersa'i di Shafa sehingga bersa'i disebutkan setelah diterangkan thawaf di Baitullah.\" Imam Bukhari dan Muslim meriwayatkan dari Anas, bahwa ia pernah ditanya tentang (bersa'i) antara Shafa dan Marwah, lalu ia menjawab, \"Kami memandang, bahwa (bersa'i) antara Shafa dan Marwah termasuk perkara Jahiliyyah. Ketika Islam datang, kami pun menahan diri (tidak melakukannya), maka Allah menurunkan ayat, \"Innash shafaa wal marwata min sya'aairillah..dst.\" Namun demikian, tidak ada yang bahwa ayat tersebut turun berkenaan kedua pihak itu. Syi'ar Allah adalah tanda-tanda agama yang nampak atau tempat beribadah kepada Allah. Karena sebagai syi'ar-Nya, maka kita diperintahkan untuk memuliakannya, wa may yu'azzhim sya'aairallah fa innahaa min taqwal quluub (dan barangsiapa yang memuliakan syi'ar-syi'ar Allah, maka hal itu timbul dari ketakwaan yang ada di dalam hati). Allah mengungkapkan dengan perkataan \"tidak ada dosa\" (padahal hukumnya wajib) sebab sebagian sahabat Rasulullah shallallahu 'alaihi wa sallam merasa keberatan mengerjakannya sa'i di situ, karena tempat itu bekas tempat berhala. dan di masa jahiliyah pun tempat itu digunakan sebagai tempat sa'i. Untuk menghilangkan rasa keberatan itu, Allah menurunkan ayat ini. Yakni yang disyari'atkan Allah, seperti shalat, puasa, hajji, umrah, thawaf dsb. Hal ini menunjukkan bahwa barangsiapa yang mengerjakan perkara yang tidak disyari'atkan (bid'ah), maka tidak ada yang diperoleh selain kelelahan, bukan kebaikan, bahkan bisa menjadi keburukan jika ia melakukannya dengan sengaja dan mengetahui bahwa hal itu tidak disyari'atkan. Yakni ikhlas karena Allah. Ada pula yang mengartikan \"mengerjakan amalan yang tidak wajib baginya\". Allah mensyukuri hamba-Nya: memberi pahala terhadap amal-amal hamba-Nya, jika sedikit dibalas-Nya dengan balasan yang banyak, Dia tidak menyia-nyiakan amalan hamba-hamba-Nya, dan tidak mengurangi meskipun seberat dzarrat (debu). Jika seorang hamba mengerjakan perintah-Nya Dia akan membantu, memujinya dan akan memberikan balasan berupa cahaya, iman dan kelapangan di hatinya, pada badannya akan diberikan kekuatan dan semangat dan pada semua keadaannya akan diberikan keberkahan dan tambahan, sedangkan pada amalnya akan ditambah lagi dengan taufiq-Nya. Pada hari kiamat, pahala yang diperoleh seorang hamba tersebut akan dipenuhkan dan tidak akan dikurangi. Di antara syukur-Nya kepada hamba-Nya adalah bahwa barangsiapa yang meninggalkan sesuatu karena Allah, maka Allah akan menggantinya dengan yang lebih baik. Barangsiapa yang mendekat kepada-Nya sejengkal, maka Allah akan mendekat kepadanya sehasta, barangsiapa yang mendekat kepada-Nya sehasta, maka Dia akan mendekat kepada orang itu sedepa dan barangsiapa yang mendekat kepada-Nya sambil berjalan, maka Dia akan mendekat kepadanya sambil berlari. Allah Subhaanahu wa Ta'aala juga mengetahui siapa yang berhak memperoleh pahala yang sempurna sesuai niat, iman dan ketakwaannya, Dia mengetahui amalan-amalan yang dikerjakan hamba-hamba-Nya, oleh karenanya Dia tidak akan menyia-nyiakannya, bahkan hamba-hamba-Nya akan memperoleh balasan yang lebih banyak dari apa yang merekjakerjakan sesuai niat mereka yang diketahui oleh Yang Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 158",
    "description": "Usai menjelaskan perihal kiblat, Allah lalu beralih menguraikan apa yang terkait dengan masjidilharam, yaitu bukit safa dan marwah. Sesungguhnya safa dan marwah, dua bukit di dekat kakbah (sekarang dalam lingkup masjidilharam) merupakan sebagian syi'ar agama Allah, karena orang yang haji dan umrah melakukan ritual ubudiyah dengan berlari kecil di antara keduanya. Maka barang siapa beribadah haji ke baitullah atau berumrah, tidak ada dosa baginya mengerjakan sai antara keduanya. Lakukanlah sai sesuai tuntunan Allah dan janganlah kamu merasa berdosa oleh istiadat kaum jahiliah yang mengusap patung di pucuk kedua bukit itu. Dan barang siapa dengan kerelaan hati mengerjakan kebajikan, maka Allah maha mensyukuri dengan memberikan pahala yang agung atas kebajikannya itu, dan dia pun maha mengetahui. Allah mengimbau umat islam untuk menyampaikan kebenaran. Sungguh, orang-orang yang menyembunyikan apa yang telah kami turunkan, yakni kitab-kitab samawi sebelum Al-Qur'an, dengan tidak memaparkannya kepada masyarakat atau menggantinya dengan yang lain, berupa keterangan-keterangan tentang satu kebenaran dan petunjuk, seperti sifat-sifat nabi Muhammad atau hukum syariat tertentu setelah kami jelaskan kepada manusia dalam kitab Al-Qur'an, mereka itulah orang yang dilaknat Allah, dijauhkan dari rahmat-Nya, dan dilaknat pula oleh mereka yang melaknat: para malaikat dan kaum mukmin. Ayat ini berlaku bagi setiap orang yang sengaja menyembunyikan kebenaran dari Allah. Laknat itu akan selalu meliputi mereka, kecuali mereka yang telah bertobat dan menyesali dosa mereka, dan mengadakan perbaikan dengan berbuat saleh, dan menjelaskan-Nya; mereka itulah yang aku terima tobatnya, dan akulah yang maha penerima tobat, maha penyayang."
  }
]