[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik tersebut telah menjual diri mereka dengan sebuah transaksi yang akan merugikan. Dimana mereka lebih memilih kekafiran dan meninggalkan keimanan, maka mereka tidak mendapatkan sesuatu apapun justru mereka rugi karena kehilangan Hidayah. Dan inilah kerugian nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Mereka itu orang yang benar-benar bodoh, karena mereka mengganti keimanan dengan kekufuran. Perniagaan mereka tidak menguntungkan, karena kehilangan keimanan kepada Allah, dan mereka tidak menemukan jalan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. اُولٰۤىِٕكَ الَّذِيْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰىۖ (Mereka adalah orang-orang yang membeli kesesatan dengan petunjuk) Yakni mengganti hidayah dengan kekufuran. Dan secara bahasa kata (الضلالة) berarti kebingungan, berbelok dari tujuan, dan hilangnya petunjuk. فَمَا رَبِحَتْ تِّجَارَتُهُمْ (Maka perdagangan mereka itu tidak beruntung) Yakni mereka tidak beruntung dalam perdagangan mereka yang mengganti keimanan dengan kekufuran. وَمَا كَانُوْا مُهْتَدِيْنَ (dan mereka tidak mendapat petunjuk) Yakni dikarenakan mereka membeli kekufuran dengan keimanan mereka dan keluar dari hidayah menuju kesesatan, dari jama’ah menuju perpecahan, dari keamanan menuju ketakutan, dan dari sunnah menuju bid’ah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka adalah orang-orang yang menukar petunjuk dengan kesesatan. Mereka memilih kekafiran dan meninggalkan petunjuk. Maka mereka tidak beruntung dalam berdagang dengan mengikuti kekafiran sebagai ganti keimanan. Dan mereka tidak ditunjukkan kepada kebenaran pada saat menjual kekafiran dengan (cara) keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang yang membeli} mereka mengganti {kesesatan dengan petunjuk. Maka, tidaklah beruntung perniagaan mereka. dan mereka itu bukanlah orang-orang yang mendapatkan petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Mereka itulah, ” maksudnya orang-orang munafik yang bersifat dengan sifat-sifat tersebut, “orang yang membeli kesesatan dengan petunjuk, ” maksudnya mereka suka terhadap kesesatan sebagaimana seorang pembeli suka terhadap suatu barang dagangan, yang –di antara kesukaannya terhadap kesesatan itu- membuat ia mengeluarkan harta yang berharga untuk mendapatkannya, dan ini adalah suatu perumpamaan yang paling bagus, karena Allah menjadikan kesesatan yang merupakan puncak dari segala kejahatan Seperti barang dagangan dan Dia menjadikan petunjuk yang merupakan puncak dari segala Kebaikan bagaikan harga barang, lalu mereka (orang-orang munafik) itu menyerahkan petunjuk karena tidak suka terhadapnya untuk mendapatkan kesesatan karena suka terhadapnya. Inilah perdagangan mereka, dan sungguh amat buruk perdagangan mereka itu, serta inilah transaksi mereka, dan sungguh buruk transaksi mereka itu. Apabila seseorang mengeluarkan uang dinarnya untuk mendapatkan uang dirham maka ia pasti rugi, lalu bagaimanakah orang yang mengeluarkan permata untuk mendapatkan uang dirham? Dan bagaimanakah orang yang mengeluarkan petunjuk untuk mendapatkan kesesatan? Ia lebih memilih kesengsaraan daripada kebahagiaan, serta lebih suka terhadap perkra-perkara yang tidak berarti dengan meninggalkan perkara-perkara yang berguna. Akhirnya tidak beruntunglah perdagangannya tersebut, bahkan ia merugi dalam hal itu dengan kerugian yang paling besar, mereka itulah orang-orang yang rugi diri mereka dan keluarga mereka pada Hari Kiamat, camkanlah, bahwa itulah kerugian yang nyata. Dan firmanNya, ”Dan tidaklah mereka mendapat petunjuk, ” ini adalah sebagai penegasan akan kesesatan mereka, dan bahwasanya mereka tidak mendapatkan sedikitpun petunjuk. Inilah sifat-sifat mereka yang jelek itu, kemudian Allah menyebutkan perumpaan mereka –yang menyingkap hal itu dengan sejelas-jelasnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : تِّجَٰرَتُهُمۡ At-Tijaroh adalah membayarkan modal untuk membeli sesuatu yang menghasilkan laba ketika dijual. Orang munafik menjual modal mereka yaitu keimanan untuk membeli kekufuran dengan harapan mendapatkan kemuliaan dan kekayaan di dunia. Akan tetapi mereka merugi dan tidak menghasilkan laba apapun, hanya mendapat kehinaan, adzab, dan kemiskinan karena kekufuran yang dilakukannya. Al-Muhtadiy adalah orang yang menempuh jalan lurus yang menghantarkan untuk mencapai apa yang diinginkannya dalam waktu yang singkat tanpa terjatuh dalam kesesatan, sedangkan kebalikannya adlah orang yang menempuh jalan yang bengkok tidak menghantarkan kepada yang diinginkan sampai mereka hancur sebelum mencapai tujuan. Makna ayat : Kemudian ayat selanjutnya (16) Allah memberitahukan bahwa mereka orang-orang yang dijauhkan dari kebaikan sudah menukar keimanan dengan kekufuran, dan sudah merasa ikhlas dengan kemunafikan. Oleh karena itu perdagangan mereka tidak menghasilkan untung dan tidak bisa menunjukki kepada jalan yang penuh keuntungan atau keselamatan. Pelajaran dari ayat : Penjelasan mengenai pembalasan Allah terhadap musuh-musuhNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 16: Kemudian Allah menjelaskan sebab dari kerugian mereka orang-orang munafik dan orang-orang yang bodoh dari mereka , Allah mengabarkan bahwasanya mereka setelah mengganti petunjuk dengan kesesatan serta keimanan dengan kekufuran ; maka tiada untung bagi mereka dalam perdagangan mereka, dan mereka tidak akan pernah menjadi orang-orang yang diberi petunjuk , dan ini adalah termasuk kerugian yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka membeli kekafiran dengan iman; membeli kesesatan dengan petunjuk, sehingga mereka tidak memperoleh apa-apa, bahkan hanya memperoleh kerugian karena tidak mendapat petunjuk dan akan membawanya kepada neraka, yang demikian itulah kerugian yang sesungguhnya. Jika seorang membeli uang satu dirham dengan harga satu dinar atau mengeluarkan modal untuk usaha sejumlah sepuluh juta sisanya tinggal satu juta tanpa keuntungan sudah dianggap rugi, lalu bagaimana dengan orang yang membeli kesesatan dengan petunjuk, membeli kekafiran dengan keimanan dan membeli kesengsaraan dengan kebahagiaan, alangkah ruginya perdagangan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 16",
    "description": "Mereka itulah orang-orang yang jauh dari kebenaran yang membeli kesesatan dengan petunjuk. Sikap mereka yang memilih kesesatan dan mengabaikan kebenaran diumpamakan seperti pedagang yang memilih barang-barang rusak untuk dijual dalam perdagangannya. Maka perdagangan mereka itu tidak beruntung. Jangankan untung yang didapat, modal pun hilang. Dan mereka tidak mendapat petunjuk yang dapat mengantarkan kepada kebenaran, sebab yang ada pada mereka hanyalah kesesatan. Perumpamaan keadaan mereka orang-orang munafik yang sungguh mengherankan itu seperti keadaan yang aneh dari orang-orang yang menyalakan api. Setelah api itu menerangi apa-apa yang ada di sekelilingnya dan memberikan kehangatan, rasa nyaman, dan manfaat lainnya bagi mereka, tiba-tiba Allah melenyapkan cahaya yang menyinari mereka dan membiarkan mereka dalam kegelapan yang kelam, tidak dapat melihat suatu apa pun. Allah telah memberikan kepada mereka petunjuk kebenaran, tetapi mereka tidak berpegang teguh pada petunjuk tersebut, sehingga mata mereka menjadi tertutup, dan mereka pantas berada dalam kebimbangan dan kesesatan."
  }
]