[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari keimanan dan menyembunyikan kebenaran dan mereka terus-menerus diatas sikap itu hingga mati, maka mereka itu akan ditimpakan kepada mereka laknat Allah dengan mengusirnya dari rahmat Nya dan juga ditimpakan atas mereka laknat para malaikat dan seluruh manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Sesungguhnya orang-orang kafir dan mati dalam kekafiran sebelum bertaubat, mereka itu akan dilaknat oleh Allah dengan mengusir mereka dari rahmat-Nya. Dan mereka juga akan didoakan oleh para Malaikat dan seluruh umat manusia agar diusir dan dijauhkan dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "161-162. Orang-orang yang mendustakan Allah dan rasul-Nya, dan terus menerus melakukan itu sampai mereka mati, maka balasan bagi mereka adalah dijauhkan dari rahmat Allah dan mendapat laknat dari para malaikat dan manusia seluruhnya. Mereka akan tetap dalam laknat dan kekal di neraka, azab tidak akan dihentikan bagi mereka dan mereka tidak akan dibebaskan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "161. إِنَّ الَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ (Sesungguhnya orang-orang kafir dan mereka mati dalam keadaan kafir) Ayat ini menjadi dalil dilarangnya seseorang untuk melaknat orang kafir tertentu karena keadaan ia ketika meninggal nanti tidak kita ketahui. Adapun laknat bagi orang tertentu yang melakukan maksiat dilarang tanpa ada perselisihan dalam hukumnya, dengan dalil yang ada di shahihain: didatangkan kepada Rasulullah berkali-kali seorang peminum khamr. Kemudian orang-orang yang hadir berujar: semoga Allah melaknatnya, berapa seringnya dia meminum khamr. Kemudian Rasulullah menimpali mereka: Janganlah kalian menjadi pembantu syaitan atas saudara kalian. Adapun hukum melaknat orang kafir secara umum dibolehkan. Laknat Allah kepada orang-orang kafir sebagai balasan, kemarahan, dan penjelekkan kepada mereka. Bukan merupakan adab keislaman menghadapi seseorang dengan laknat dihadapannya karena itu merupakan hal yang keji. وَالنَّاسِ أَجْمَعِينَ (Sesungguhnya orang-orang kafir dan mereka mati dalam keadaan kafir) Yakni hal ini terjadi di hari kiamat. Adapun di dunia maka laknat mereka ini tidak mendatangi mereka. Wallahu A’lam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dan diantara hikmah pencantuman laknat malaikat dan manusia (padahal laknat Allah telah cukup) menjelaskan bahwa siapapun yang mengetahui keberadaan orang-orang kafir dan keadaan mereka yang buruk itu melihat bahwa orang-orang kafir berhak atas laknat dan kebencian dari siapapun, maka tidak siapapun yang akan menjadi syafaat bagi mereka dan tidak pula akan menyayanginya, mereka berhak atas penghinaan dan laknant dari siapapun yang mengetahui, maka barangsiapa yang berhak baginya peringatan dan siksaat dari tuhan yang maha lembut dan penyayang; lalu apa lagi yang ia harapkan dari selain-Nya dari hamba-hamba-Nya ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161. Sesungguhnya orang-orang yang mati dalam kekufuran. Maka bagi mereka itu laknat Allah (ditolak dari rahmatNya) malaikat dan seluruh manusia pada hari kiamat. Sedangkan di dunia, orang yang kafir dan bermaksiat itu tidak dilaknat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang kafir dan mati dalam keadaan kafir, mereka itu mendapat laknat Allah, para malaikat, dan seluruh manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "161. Adapun orang yang kafir dan senantiasa dalam kekufuran nya Hingga ia mati tidak akan kembali kepada rabbnya, tidak menyerahkan diri kepadaNya, serta tidak bertaubat dengan segera, maka “mereka itu mendapat laknat Allah para malaikat dan manusia seluruhnya,” karena ketika kekufuran mereka telah menjadi karakter yang menetap pada diri mereka, maka laknat pun menjadi karakter untuk mereka yang tetap dan tidak akan hilang, karena suatu hukum itu tergantung pada alasannya dari segi ada atau tidak adanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Ayat 162 dan 163 menjelaskan bahwa kalangan ahli kitab dan selain mereka yang kafir terhadap nabinya dan agamanya serta tidak mau bertaubat, mereka akan mati di atas kekafirannya. Dan bagi mereka laknat Allah dan malaikat serta seluruh manusia. Mereka itulah orang-orang yang terusir dan dijauhkan dari rahmat ilahi yaitu surga, dimana mereka kekal di neraka Jahannam dan tidak ada keringanan adzab untuknya, serta tidak ada penangguhan sehingga bisa menyiapkan berbagai alasan. Pelajaran dari ayat: • Barangsiapa yang kafir dan mati di atas kekafirannya siapapun orangnya, akan dilemparkan ke neraka Jahannam setelah kematiannya, dan dia kekal di sana. Kekal merasakan adzab tanpa ada keringanan dan tidak ada kesempatan menyampaikan alasan, tidak ada juga adzab itu berhenti sebentar sehingga dia bisa beristirahat. • Bolehnya melaknat orang yang berbuat maksiat secara terang-terangan seperti minum khamer, orang yang makan riba, dan laki-laki yang berdandan dan bergaya layaknya perempuan dan sebaliknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 161: Allah mengabarkan mereka yang menolak keimanan serta mati diatas hal tersebut mereka adalah kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di samping kafir, mereka juga menyembunyikan kebenaran. \"Manusia\" di sini ada yang berpendapat umum, yakni semua manusia dan ada yang berpendapat bahwa yang melaknat adalah kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 161",
    "description": "Sungguh, orang-orang yang kafir dan mati dalam keadaan kafir akan mendapat empat macam pembalasan. Pertama, mereka itu mendapat laknat Allah, para malaikat dan manusia seluruhnya; kedua, mereka kekal di dalamnya, di dalam laknat itu, dan karenanya mereka akan masuk neraka untuk selamanya; ketiga, mereka tidak akan diringankan azabnya; dan keempat, mereka tidak diberi penangguhan sebagaimana pada saat mereka di dunia"
  }
]