[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka selamanya ada di dalam laknat dan neraka dan tidak diringankan siksaan dari mereka, dan mereka pun tidak mendapatkan penundaan untuk mengemukakan alasan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "162. Kutukan itu akan terus melekat pada diri mereka. Siksa mereka tidak akan diringankan walaupun satu hari saja. Dan mereka tidak akan diberi tenggang waktu di hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "162. خٰلِدِينَ فِيهَا ۖ (Mereka kekal di dalam laknat itu) Yakni didalam neraka. Pendapat lain mengatakan: yakni kekal dalam laknat tersebut. وَلَا هُمْ يُنظَرُونَ (tidak (pula) mereka diberi tangguh) Yakni tidak ditangguhkan dan diakhirkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "162. Mereka itu abadi (tinggal selama-lamanya) di neraka atau dalam laknat, dan tidak diperhatikan. Tiada harapan (bagi mereka) untuk diringankan azabnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kekal di dalam laknat itu. Tidak akan diringankan azab dari mereka, dan mereka tidak diberi penangguhan} diberi masa penangguhan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162. “Mereka kekal di dalamnya,” yakni dalam melaksanakan atau dalam siksaan itu, dan kedua hal itu saling berkaitan erat, “tidak akan diringankan siksa dari mereka,” bahkan siksa mereka akan selalu ada dan pedih, serta berkesinambungan, “dan tidak pula mereka ditangguhkan,” maksudnya, tidak akan penuh ditunda, karena waktu penundaan yaitu dunia telah berlalu, dan tidak akan ada lagi yang tersisa bagi mereka suatu alasan pun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَلَا هُمۡ يُنظَرُونَ } Wa laa hum yundzaarun : Mereka tidak diberi kesempatan untuk menyampaikan ‘udzurnya (alasan). Sebagaimana firman Allah Ta’ala : “Dan tidak diizinkan kepada mereka minta uzur sehingga mereka dapat minta uzur.” (QS al-Mursalat) Makna ayat: Mereka itulah orang-orang yang terusir dan dijauhkan dari rahmat ilahi yaitu surga, dimana mereka kekal di neraka Jahannam dan tidak ada keringanan adzab untuknya, serta tidak ada penangguhan sehingga bisa menyiapkan berbagai alasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 162: Allah menjelaskan bahwasannya kekal di neraka jahanam yang tidak di ringankan azabnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni di dalam laknat dan azab. Meskipun hanya sebentar atau hanya sekejap mata. Karena waktu penangguhan yaitu di dunia sudah mereka lewati tanpa bertobat, dan apabila sudah tiba ajal seseorang, maka Allah Subhaanahu wa Ta'aala tidak akan memberi tangguh lagi (lihat surat Al Munafiqun: 11)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 162",
    "description": "Sungguh, orang-orang yang kafir dan mati dalam keadaan kafir akan mendapat empat macam pembalasan. Pertama, mereka itu mendapat laknat Allah, para malaikat dan manusia seluruhnya; kedua, mereka kekal di dalamnya, di dalam laknat itu, dan karenanya mereka akan masuk neraka untuk selamanya; ketiga, mereka tidak akan diringankan azabnya; dan keempat, mereka tidak diberi penangguhan sebagaimana pada saat mereka di dunia. Dan tuhan kamu adalah tuhan yang maha esa, tidak berbilang; tidak ada tuhan yang disembah dengan hak selain dia, yang maha pengasih, maha penyayang."
  }
]