[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Tuhan sesembahan kalian itu -wahai sekalian manusia- adalah Tuhan sesembahan yang satu (esa) dalam dzat Nya, nama-nama Nya, dan sifat-sifat Nya,dan perbuatan-perbuatan Nya dan penghambaan makhluk kepada Nya, tidak ada sesembahan yang berhak diibadahi kecuali Dia, yang maha pengasih yang bersifat rahmat dalam dzat Nya, dan perbuatan-perbuatan Nya kepada seluruh makhluk, juga Maha Penyayang kepada kaum Mukminin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "163. Rabb yang berhak kamu sembah -wahai manusia- ialah Rabb Yang Maha Esa, yang Esa dalam Żat dan sifat-sifat-Nya. Tidak ada Rabb lain yang berhak disembah selain Dia. Dia adalah Tuhan Yang Maha Pengasih dengan seluas-luasnya dan Maha Penyayang kepada hamba-hamba-Nya. Karena Dia telah memberikan nikmat tak terhingga kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "163. Hai Manusia, Tuhanmu adalah Allah, Dia satu-satunya yang berhak disembah, tidak ada sekutu bagi-Nya; Esa dalam Dzat, nama-nama, dan sifat-sifat-Nya; peribadatan makhluk-Nya hanya bagi-Nya. Dia Maha Luas rahmat-Nya bagi hamba-hamba-Nya di dunia, dan bagi orang-orang beriman di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "163. وَإِلٰهُكُمْ إِلٰهٌ وٰحِدٌ ۖ (Dan Tuhanmu adalah Tuhan Yang Maha Esa) Dalam ayat ini terdapat isyarat bahwa hal pertama yang wajib dijelaskan dan haram untuk menymbunyikannya adalah urusan tauhid"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "163. Tuhan yang haq disembah adalah Tuhan yang tiada memiliki sekutu, dan yang menyerupaiNya dalam dzat, sifat, dan tindakanNya. Dialah sumber rahmat yang abadi dan Maha Pengasih bagi hamba-hambaNya dengan memberi nikmat yang terus-menerus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhan kalian adalah Tuhan Yang Maha Esa. Tidak ada tuhan selain Dia, Dzat Yang Maha Pengasih lagi Maha Penyayang."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "163. Allah mengabarkan dan Dia adalah Yang Maha benar perkataanNya bahwa Dia “sesembahan yang Maha Esa,” maksudnya, hanya satu dan sendiri pada dzatNya, nama-namaNya, sifat-sifatNya, dan perbuatan-perbuatanNya, tidak ada sekutu bagiNya pada dzatNya, tidak ada yang menyamaiNya, tidak ada bandinganNya, dan yang serupa denganNya, tidak ada yang sesuai denganNya, tidak ada pencipta, tidak ada pengatur selain diriNya. Oleh karena itu, apabila kondisinya demikian, maka Dialah yang berhak dituhankan dan disembah dengan segala bentuk peribadahan, dan tidak satu makhluk pun yang dapat disekutukan denganNya, karena sesungguhnya Dia, “Maha Pengasih lagi Maha Penyayang” bersifat Rahmat yang agung yang tidak bisa disamakan dengan rahmat seorangpun, yang meliputi segala sesuatu dan menyebar kepada setiap yang hidup. Karena rahmatNyalah sehingga para makhluk tercipta, dengan rahmatNyalah mereka memperoleh berbagai bentuk pelengkap, dengan rahmatNyalah tercabut dari nya segala kesulitan, dengan rahmatNyalah Dia memperkenalkan diri kepada hambaNya dengan sifat-sifat dan karunia-karuniaNya, Dia menjelaskan kepada mereka segala yang mereka butuhkan dari kemaslahatan agama dan dunia mereka dengan mengutus para Rasul dan menurunkan kitab-kitab. Apabila diketahui bahwa nikmat yang diperoleh seorang hamba hanyalah dari Allah dan bahwa seseorang dari makhluk tidaklah mampu memberikan manfaat kepada orang lain, maka dari situ diketahui bahwa hanya Allah yang berhak atas segala bentuk ibadah, dan hanya Dialah yang berhak mendapatkan kecintaan, rasa takut, harap, pengagungan dan tawakal, serta lain-lainnya dari berbagai bentuk ketaatan. Kezhaliman yang paling zhalim dan keburukan yang paling buruk adalah dimana beribadah kepadaNya diubah menjadi beribadah kepada hamba, dan dengan para makhluk yang berasal dari tanah disekutukan dengan Tuhannya segala Tuhan, atau seorang hamba menyembah makhluk yang diatur lagi lemah dari segala sisi dengan Sang Pencipta lagi maha mengatur dan mampu lagi kuat, yang menguasai segala sesuatu, dan segala sesuatu tunduk kepadaNya. Ayat ini menunjukkan penetapan akan keesaan dan ketuhanan sang pencipta, dan penegasannya dengan cara meniadakan hal itu dari selain diriNya dari para makhluk, serta penjelasan tentang dasar dalil terhadap hal itu, yaitu penetapan tentang rahmatNya yang salah satu pengaruhnya adalah adanya ke segala kenikmatan dan penolakan segala kesulitan. Ini adalah dalil global tentang keesaan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { الإله } Al-Ilah: Dzat yang disembah, baik secara benar (haq) maupun secara bathil. Allah ﷻ adalah Sesembahan (ilah) yang berhak diibadahi dengan benar. { وَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖ } Wa ilahukum ilahun wahid: Esa dalam Dzat dan sifat Nya, Esa dalam rububiyahNya sehingga tidak ada Dzat yang menciptakan, memberikan rizki, mengatur alam semesta dan kehidupan kecuali Dia. Allah Esa dalam uluhiyah Nya yaitu dalam peribadahan, tidak ada yang berhak diibadahi kecuali Dia. Makna ayat: Ketika Allah Ta’ala memberikan kewajiban kepada para ulama untuk menyampaikan ilmu dan petunjuk dan melarang mereka untuk menyembunyikannya, Allah mengabarkan bahwa Dia lah satu-satunya sesembahan (ilah) yang Maha Pengasih lagi Maha Penyayang. Inilah kewajiban yang harus dijelaskan oleh para ulama pertama kali kepada manusia. Yaitu agar mereka mentauhidkan Nya dalam hal rububiyah Nya dan peribadahan kepada Nya, serta dalam nama-nama dan sifat-sifat Nya. Pelajaran dari ayat: • Tidak ada sesembahan yang berhak disembah kecuali Allah, maka tidak sah ibadah yang ditujukan kepada selain Allah, karena Dia lah ilah yang benar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 163: Ketahuilah wahai manusia bahwasannya tuhan kalian adalah satu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengatakan bahwa ayat ini turun ketika kaum kafir mengatakan, \"Beritahukanlah kepada kami sifat Tuhanmu!\", maka turunlah ayat di atas. Setelah turun ayat di atas, mereka meminta lagi bukti, maka turunlah ayat setelahnya (yaitu ayat 164). Wallahu a'lam. Yakni Dia Mahaesa baik pada zat-Nya, nama-Nya, sifat-Nya dan perbuatan-Nya. Tidak ada yang sebanding atau sama dengan-Nya dan tidak ada pencipta dan pengatur selain-Nya. Oleh karena itu, Dialah yang berhak diibadahi dan ditujukan berbagai bentuk ibadah serta tidak boleh disekutukan dengan sesuatu apa pun. Yang memiliki sifat rahmah (kasih-sayang) yang besar, mengena kepada segala sesuatu. Denagn rahmat-Nya, makhluk-makhluk terwujud, dengan rahmat-Nya tercapai berbagai kesempurnaan, dengan rahmat-Nya terhindar bencana, dengan rahmat-Nya Dia memperkenalkan Diri-Nya kepada hamba-hamba-Nya baik dengan sifat maupun nikmat-Nya dan dengan rahmat-Nya Dia menerangkan kepada makhluk segala yang mereka butuhkan yang memberi maslahat bagi agama dan dunia mereka, yaitu dengan mengutus para rasul dan menurunkan kitab-kitab. Demikian juga Dia rahiim (sayang) kepada kaum mukmin. Apabila seorang hamba mengetahui bahwa nikmat yang ia peroleh berasal dari Allah, dan bahwa seorang makhluk pada hakikatnya tidak memberikan manfaat kepada yang lain, tentu dia akan mengetahui bahwa hanya Allah-lah yang berhak disembah serta ditujukan berbagai bentuk ibadah dan merupakan kezaliman yang paling besar adalah jika sampai beribadah kepada makhluk. Di dalam ayat ini terdapat penetapan keesaan Allah Subhaanahu wa Ta'aala dan keberhakan-Nya untuk diibadahi, juga menerangkan bukti utamanya yaitu sifat rahmat-Nya, di mana atsar/pengaruh dari sifat itu terwujud berbagai jenis kenikmatan dan terhindar berbagai malapetaka. Sifat rahmat-Nya merupakan dalil secara ijmal (garis besar) yang menunjukkan keesaan-Nya. Kemudian di ayat selanjutnya disebutkan dalil tentang keesaan-Nya secara rinci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 163",
    "description": "Dan tuhan kamu adalah tuhan yang maha esa, tidak berbilang; tidak ada tuhan yang disembah dengan hak selain dia, yang maha pengasih, maha penyayang ketahuilah, sesungguhnya pada penciptaan langit dengan ketinggian dan keluasannya serta benda-benda angkasa di lingkupnya; dan bumi yang terhampar luas; pergantian malam dan siang dengan perubahan panjang-pendeknya dan kemanfaatan masing-masing; kapal dan perahu yang berlayar di laut dengan membawa muatan berupa manusia dan aneka ragam barang yang bermanfaat bagi manusia; apa yang diturunkan Allah dari langit berupa air, lalu dengan air itu dihidupkan-Nya bumi dengan berbagai macam tumbuhan setelah tanaman tersebut mati atau kering; apa yang dia tebarkan di dalam dan di permukaan-Nya berupa bermacam-macam binatang; dan perkisaran angin, baik yang semilir maupun yang kencang; dan awan yang menggumpal dan dikendalikan untuk bergelantungan antara langit dan bumi; semua itu sungguh merupakan tanda-tanda kebesaran Allah bagi orang-orang yang mengerti, menggunakan akalnya untuk mengambil pelajaran."
  }
]