[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya dalam penciptaan langit dengan ketinggian dan luasnya ini dan bumi dengan gunung-gunung, dataran dan laut-lautnya, dan di dalam pergantian malam dan siang dari lebih lama menjadi lebih pendek, dan antara gelap dan cahaya dan pergantian keduanya secara beriringan, dan Jalan kapal-kapal yang berlayar di laut-laut yang memuat segala yang bermanfaat bagi manusia, dan air hujan yang diturunkan Allah dari langit, Lalu Dia menghidupkan tanah dengan air itu, maka tumbuhlah pohon-pohon hijau setelah sebelumnya kering tidak ada tanaman. dan apa-apa yang telah Allahu sebar di dalamnya berupa setiap jenis binatang yang berjalan dimuka bumi, dan apa yang Allah limpahkan berupa perputaran angin dan penentuan arahnya, dan awan yang dibergerak antara langit dan bumi. Sesungguhnya pada semua bukti-bukti petunjuk tersebut benar-benar terdapat tanda-tanda atas ketauhidan Allah dan besarnya nikmat Nya bagi kaum yang mau memahami sumber-sumber hujjah, dan memahami dalil-dalil dari Allah ta'ala yang menunjukkan sifat keesaan Nya dan keberhakkan Nya untuk diibadahi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "164. Sesungguhnya pada penciptaan langit dan bumi beserta makhluk-makhluk yang menakjubkan di dalamnya, pada pergantian malam dan siang, pada bahtera yang berlayar di laut sambil membawa barang-barang yang berguna bagi manusia, seperti makanan, pakaian, dagangan dan kebutuhan-kebutuhan lainnya, pada air hujan yang Allah turunkan dari langit kemudian Dia gunakan untuk menghidupkan bumi dengan cara menumbuhkan tanaman dan rumput di atasnya, pada makhluk-makhluk hidup yang Allah tebarkan di muka bumi, pada pengalihan angin dari satu arah ke arah yang lain, dan pada awan yang digantung di antara langit dan bumi, sesungguhnya pada semua fenomena itu terdapat tanda-tanda yang jelas menunjukkan keesaan Allah -Subḥānahu- bagi orang-orang yang bisa memikirkan bukti-bukti dan memahami dalil-dalil dan tanda-tanda."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "164. Penciptaan tujuh langit yang luas; tujuh bumi beserta lautan, daratan, dan lapisan-lapisannya; perbedaan siang dnan malam beserta pergantian keduanya; kapal-kapal yang berlayar di lautan untuk digunakan manusia bepergian dan berdagang; hujan yang Allah turunkan untuk menghidupkan bumi sehingga menjadi hijau setelah kekeringan; kemudian Allah menyebarkan berbagai jenis hewan, menghembuskan angin yang menjalankan awan yang ada di antara langit dan bumi; sungguh pada yang demikian itu merupakan bukti-bukti yang jelas atas kebesaran dan keesaan Sang Pencipta bagi orang-orang yang berfikir dan memahami bukti dan hak Allah untuk diesakan dalam peribadatan. Ibnu 'Asyur berpendapat: kata 'daabbah' bermakna: segala yang berjalan di atas bumi, sebab lafadz 'kull' menunjukkan bahwa yang dimaksudkan adalah segala jenis makhluk yang berjalan di atas bumi, bukan khusus hewan-hewan berkaki empat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "164. وَاخْتِلٰفِ الَّيْلِ وَالنَّهَارِ (silih bergantinya malam dan siang) Yakni pergantian siang dan malam dan perbedaan keduanya dalam hal cahaya, kegelapan, panas, dan dingin; adapun sebab dan efek dari hal-hal ini merupakan hikmah-hikmah yang dalam dan terdapat maslahat bagi makhluk-Nya. وَتَصْرِيفِ الرِّيٰحِ (dan pengisaran angin) Yakni mengirim angin yang membantu penyerbukan dan yang tidak, yang sebagai penolong dan yang sebagai pembinasa, yang panas dan yang dingin, yang lembut dan yang kencang. Pendapat lain mengatakan: yakni mengirimnya ke timur dan selatan, dan dua angin yang bertemu. وَالسَّحَابِ الْمُسَخَّرِ (angin dan awan yang dikendalikan) Yakni yang ditundukkan. Pendapat lain mengatakan: penundukannya adalah tetapnya ia diantara langit dan bumi tanpa tiang dan tanpa digantung. لَايٰتٍ لِّقَوْمٍ يَعْقِلُونَ (sungguh (terdapat) tanda-tanda (keesaan dan kebesaran Allah) bagi kaum yang memikirkan) Yakni semua orang yang berakal mengetahui bahwa segala yang ada ini tidak mungkin dilakukan sepenuhnya atau sebagiannya oleh sembahan-sembahan orang-orang kafir yang meliputi penciptaan langit dan bumi, pergantian siang dan malam, pergerakan kapal di lautan, hujan yang turun dari langit, bumi yang kembali hidup dengan hujan, persebaran hewan-hewan, dan pergerakan angin, maka barang siapa yang melihat hal ini dengan cermat dan menjalankan pikirannya niscaya akan mendapat kepastian bahwa yang melakukan itu adalah Allah Ta’ala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "164. Sesungguhnya dalam penciptaan langit, bumi dan sesuatu di antara keduanya berupa makhluk-makhluk yang menakjubkan, perbedaan siang dan malam dengan adanya penerangan dan kegelapan, panas dan dingin, panjang dan pendek, pergantian antara keduanya, perahu yang berlayar di bumi agar bisa dimanfaatkan manusia untuk dinaiki, membawa barang, dan lain-lain, hujan dan hawa dingin yang diturunkan oleh Allah melalui awan yang kemudian Dia menghidupkan bumi dengan tanam-tanaman setelah mengalami kegersangan, berbagai jenis hewan yang tersebar di penjuru bumi, pergerakan angin ke seluruh penjuru arah, dan awan yang tunduk kepada perinta Allah. Sesungguhnya dalam semua itu terdapat dalil-dalil atas keberadaan dan keesaan Allah SWT bagi kaum yang mau berpikir. ‘Atha’ berkata: “Telah turun kepada Nabi SAW di Madinah ayat {Ilaahukum Ilaahun waahid ..} lalu orang-orang kafir Quraisy di Mekah berkata: “Bagaimana Tuhan yang Esa itu meliputi seluruh manusia?” Lalu Allah menurunkan ayat {Inna fii khalqissamawati wal ardhi}”,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya dalam penciptaan langit dan bumi, pergantian} perputaran {malam dan siang, bahtera} bahtera {yang berlayar di laut dengan muatan yang bermanfaat bagi manusia, apa yang Allah turunkan dari langit berupa air, lalu dengannya Dia menghidupkan bumi setelah mati, dan Dia menebarkan} menyebarkan {di dalamnya setiap jenis hewan, dan perubahan} perubahan {angin dan awan yang dikendalikan} dikendalikan {antara langit dan bumi itu sungguh merupakan tanda-tanda (kebesaran Allah) bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164. Allah mengabarkan bahwa pada makhluk-makhluk yang besar tersebut ada tanda-tanda, yaitu dalil-dalil bagi keesaan Allah, sang pencipta, ketuhananNya, keagungan kekuasaanNya, kasih sayangNya, dan seluruh sifat-sifatNya, akan tetapi hal itu “bagi kaum yang mengerti,” maksudnya, bagi mereka yang memiliki akal sehat yang mereka pakai sesuai dengan fungsinya. Oleh karena itu sebesar Apakah dari yang dikaruniakan oleh Allah terhadap hambaNya dari akal tersebut, sebesar itu pula dia mengambil manfaat dari ayat-ayat itu dengan akal, pemikiran, dan perenungannya, maka dalam “penciptaan langit,” bagaimana ia ditinggikan, diluaskan, dikokohkan, dan dimantapkan serta apa yang diciptakan oleh Allah padanya seperti matahari, bulan, dan bintang-bintang, serta pengaturannya demi kemaslahatan hamba-hambaNya. Dan dalam penciptaan “bumi,” sebagai tempat istirahat bagi makhluk, yang bisa ditempati sebagai tempat tinggal mereka, dan mengambil manfaat dari segala yang ada padanya, serta menjadi pelajaran, yang semua itu menunjukkan pada keesaan Allah dalam penciptaan dan pengaturan, juga penjelasan akan keagungan kekuasaan Allah yang dengannya Dia menciptakan bumi tersebut, juga hikmahNya yang dengannya Dia mengokohkan, memperindah dan merapikannya, ilmu dan rahmatNya yang dengannya Dia menyimpan berbagai macam manfaat bagi makhluk, kemaslahatan, keperluan, dan kebutuhan kebutuhan mereka. Dan dalam hal tersebut maka ayat itu adalah ayat yang paling kuat dalam menunjukkan kesempurnaan Allah dan hakNya untuk diesakan dalam hal ibadah, karena keesaan-Nya dalam mencipta, mengatur, dan mengurus hamba-hambaNya Dan dalam “silih bergantinya malam dan siang,” maksudnya, saling susul-menyusul secara kontinu, apabila salah satunya berlalu, maka yang lain akan menggantikannya, dan pada keadaan silih berganti diantara keduanya dalam hal panas, dingin, dan normal, panjang, pendek, dan pertengahan, serta apapun yang diakibatkan oleh nya seperti musim-musim yang menjadi bagian dalam keteraturan kemaslahatan anak cucu Adam, hewan-hewan dan seluruh yang berada di atas muka bumi ini dari pepohonan dan tumbuh-tumbuhan, semua itu dengan teratur, tersusun, dan terlaksana dengan rapi yang dikagumi oleh akal manusia, yang tidak mampu dijangkau oleh orang-orang yang perkasa; semua itu menunjukkan kuasa pengaturnya, ilmuNya, hikmahNya, rahmatNya yang luas, kelembutanNya yang sempurna, pengaturan dan penertibanNya yang dilakukanNya sendiri, keagunganNya dan keagungan kerajaanNya serta kekuasaanNya itu semua mengharuskan agar Dia diesakan, disembah, dicintai, diagungkan, di takuti, diharap, serta segala usaha dikerahkan untuk mendapatkan kecintaan dan keridhaanNya. Dan dalam “bahtera yang berlayar di laut,” maksudnya perahu dan kapal atau semacamnya dari benda-benda yang diberikan petunjuk oleh Allah kepada manusia dalam menciptakannya, Dia menciptakan buat mereka sarana-sarana bagian dalam maupun bagian luar yang mampu mereka lakukan, kemudian Dia menyiapkan untuk mereka lautan yang luas, angin yang membawa kapal mereka dan segala yang ada di dalamnya seperti para penumpang, harta benda, dan barang-barang yang merupakan manfaat bagi manusia, dan dengan suatu hal yang tegak di atasnya kemaslahatan mereka dan teraturnya kehidupan mereka. Maka siapakah yang mengilhami mereka untuk membuat kapal, dan membuat mereka mampu menciptakan nya? Siapa yang menciptakan untuk mereka alat-alat tersebut yang merupakan sarana mereka dalam membuat kapal? atau siapakah yang menunjukkan lautan itu hingga kapal mereka berlayar di atasnya dengan izinNya dan penyiapan laut serta angin? atau Siapakah yang menciptakan bagi kendaraan laut maupun darat bahan bakar dan pertambangan yang diperuntukkan membawanya dan membawa segala isi dari harta benda? apakah perkara-perkara itu semua terjadi dengan suatu kesepakatan? ataukah dikerjakan sendiri oleh makhluk yang lemah lagi tak berdaya ini, yang keluar dari perut ibunya dengan tidak berilmu dan tidak pula kuasa atas apapun, kemudian robbnya menciptakan untuknya kekuatan dan ilmu sesuai dengan kehendakNya? ataukah yang melakukan itu adalah Tuhan yang satu, yang maha bijaksana lagi maha mengetahui, yang tidak lemah atas segala sesuatu dan tidak terhalang bagiNya sesuatu pun, akan tetapi segala sesuatu itu tunduk di bawah kerububiyahan diriNya, pasrah dalam keagunganNya, dan patuh terhadap kekuasaanNya? Peran paling tinggi seorang hamba yang lemah adalah bahwa Allah menjadikan dirinya sebagai suatu bagian dari bagian-bagian penyebab yang dengannya terwujudlah perkara-perkara yang besar tersebut. Ini semua menunjukkan rahmat Allah dan perhatianNya kepada makhlukNya. Yang demikian itu mengharuskan agar kecintaan, takut, harap, segala macam ketaatan, ketundukan, dan pengagungan hanya Allah untukNya semata. “Dan apa yang diturunkan oleh Allah dari langit berupa air,” yaitu hujan yang turun dari awan, “lalu dengan air itu Dia hidupkan bumi sesudah mati (kering)nya,” lalu terlihatlah berbagai macam makanan pokok, berbagai bentuk tumbuh-tumbuhan yang menjadi kebutuhan dasar makhluk, dimana mereka tidak akan dapat hidup tanpanya. Bukankah hal itu adalah dalil atas kuasa dzat yang menurunkannya, yang mengeluarkan dengannya segala yang tumbuh dan dalil atas rahmatNya, kelembutanNya terhadap hamba-hambaNya, perhatianNya terhadap kemaslahatan mereka, serta besarnya kebutuhan dan keperluan mereka kepadaNya dari segala aspek? Bukankah konsekuensi dari itu semua adalah wajibnya Dia menjadi dzat yang mereka sembah dan menjadi robb mereka? Tidakkah itu adalah sebuah dalil tentang (kekuasaan Allah dalam) menghidupkan yang sudah meninggal dan membalas semua amal-amal mereka? “Dan dia sebarkan bumi itu,” maksudnya, di muka bumi “segala jenis hewan,” maksudnya, Dia sebarkan pada segala penjuru bumi, bermacam-macam hewan yang menjadi dalil atas kekuatan besar, keagungan, keesaan, dan kekuasaanNya yang agung, dan Dia menundukkannya untuk manusia agar mereka manfaatkan dalam segala bentuk pemanfaatan. Dan diantaranya adalah apa yang mereka makan dagingnya, mereka minum air susunya, memakai sebagai kendaraan, menjadikannya sebagai penolong dalam kemaslahatan dan penjagaan mereka, atau sebagai pelajaran. Dan Allah menyebarkan padanya hewan-hewan dan bertanggung jawab atas rizki mereka dan menjamin makanan mereka, karena tidak ada suatu binatang melata pun di bumi melainkan allah-lah yang memberi rezekinya, dan Dia mengetahui tempat berdiam binatang itu dan tempat ditambatkannya. Dan dalam “pengisaran angin,” baik yang dingin, panas, selatan, utara, timur, barat dan diantara itu semua, terkadang mengiring awan, dan terkadang pula mengumpulkannya, terkadang Membawa penyemai tanaman dan terkadang mencurahkannya, terkadang memisahkannya, menghilangkan bahayanya, terkadang menjadi rahmat dan terkadang pula menjadi azab. Maka siapakah yang mengatur semua kejadian-kejadian seperti itu dan yang menyimpan padanya manfaat bagi hamba yang sangat mereka butuhkan? Dia kemudian menundukkan nya agar seluruh makhluk dapat hidup di dalamnya, maka berkembanglah manusia, hewan, pepohonan, biji-bijian, dan tumbuh-tumbuhan, tidak ada yang melakukan semua itu melainkan Allah, Dzat yang maha perkasa, Maha bijaksana lagi maha penyayang dan lemah lembut terhadap hamba-hambaNya, yang berhak dihadapkan kepadaNya segala ketundukan, ketaatan, kecintaan, kepasrahan, dan ibadah. Dan dalam menundukkan awan antara langit dan bumi dengan segala kelembutan dan keringanannya tetapi mampu membawa air banyak yang digiring oleh Allah ke tempat yang dikehendakiNya, hingga hiduplah dengannya suatu negeri dan manusia, menyirami pegunungan dan dataran dataran rendah, menurunkan bagi manusia pada saat mereka membutuhkannya, lalu apabila dengan banyaknya yang turun akan membahayakan mereka, pastilah akan Dia tahan untuk mereka, kemudian menurunkannya sebagai rahmat dan kasih sayang, Dia mengaturnya sebagai perlindungan dan penjagaan, juga menunjukkan betapa Agung kekuasaan Allah itu, betapa melimpah kebaikanNya, dan begitu lembutnya karuniaNya. Bukankah sesuatu yang tercela bila hamba menikmati rezekiNya, hidup dengan kebaikanNya, sedang mereka menggunakan semua itu dalam rangka bermaksiat kepada-Nya dan dalam kemurkaanNya? Bukankah itu adalah dalil atas kemurahan, kesabaran, maaf, pengampunan, dan keagungan kasih sayangNya? segala puji hanya milik Nya, yang pertama dan yang terakhir, lahir mau pun batin. Kesimpulannya, bahwa setiap kali seseorang yang berakal merenungkan makhluk-makhluk itu, pikirannya berkonsentrasi pada indahnya penciptaan, lalu semakin jauh ia merenungkan hasil hasil ciptaan itu dan segala yang dikandungnya dari kebaikan dan hikmah yang dalam, niscaya ia akan mengetahui bahwa mereka itu diciptakan untuk sesuatu yang benar, dan bahwasanya semua itu adalah lembaran-lembaran ayat, kitab-kitab, dan dalil-dalil atas apa yang dikabarkan oleh Allah tentang diriNya dan keesaanNya, dan apa yang dikabarkan oleh para rasul tentang hari kiamat, dan bahwasanya semua itu adalah hal-hal yang ditundukkan, yang tidak sulit bagi dzat yang mengatur dan mengelolanya. Maka dapat engkau ketahui bahwa alam atas maupun alam bawah, semuanya membutuhkanNya dan bergantung kepadaNya, dan bahwa Dia adalah Dzat Yang Maha kaya secara pribadi dari seluruh makhluk. Tiada Tuhan yang berhak disembah kecuali Allah, dan tiada rabb selainNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ } Ikhtilafillaili wan nahâr: Dengan perputaran antara keduanya, timbul dan tenggelam untuk kemanfaatan bagi hamba-hamba sehingga siang tidak selalu ada begitu juga malam tidak selalu ada. { وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖ } Wa batssa fîhâ min kulli dâbbatin: Dia bedakan dan sebarkan berbagai jenis hewan di muka bumi. { وَتَصۡرِيفِ ٱلرِّيَٰحِ } Tashrifirriyâh: Dengan perbedaan arah bertiupnya, terkadang ke arah depan atau belakang, terkadang ke selatan, barat, atau membantu pernyerbukan tanaman dan terkadang tidak. Makna ayat: Ketika sebagian kaum musyrikin mendengar penetapan hakikat ini “Dan Ilah kamu adalah Ilah ynag Maha Esa” mereka mengatakan,”Apakah ada dalil yang menunjukkan bahwa Tidak ada ilah yang disembah selain Allah” maka Allah menurunkan ayat,”Sesungguhnya dalam penciptaan langit dan bumi, silih bergantinya malam dan siang” sampai firman Nya,”bagi kaum yang memikirkan.” Mengandung penyebutan 6 ayat kauniyah setiap ayat merupakan bukti yang menunjukkan keberadaan Allah dan kekuasaan Nya serta ilmu, hikmah dan rahmat Nya. Itu semua menjadikan manusia harus beribadah kepada Nya saja tanpa selain Nya. Pertama: Penciptaan langit dan bumi merupakan penciptaan yang agung, hanya bisa dilakukan oleh Dzat yang Maha Mampu melakukan segala sesuatu. Kedua: Pergantian siang dan malam serta waktunya, yang ini panjang dan yang itu lebih pendek. Ketiga: Melajunya kapal-kapal di lautan dengan bentuk yang begitu besar, membawa beratus-ratus ton barang dan hal yang bermanfaat bagi manusia dalam kehidupannya. Keempat: Turunnya hujan dari langit yang bermanfaat bagi kehidupan bumi dengan tumbuh-tumbuhan dan tanaman-tanamannya setelah sebelumnya mati. Kelima: Berhembusnya angin baik berupa angin panas atau dingin, membantu pernyerbukan tanaman dan terkadang tidak, bertiup ke timur dan barat, ke selatan dan utara sesuai dengan kebutuhan manusia dan yang diminta dalam hidupnya. Keenam: Awan yang berada di antara langit dan bumi, keberadaannya dan wujudnya di suatu daerah ke daerah lain, agar dapat menurunkan hujan di sini dan tidak turun hujan di daerah lain sesuai kehendak Allah yang Maha Perkasa lagi Maha Bijaksana. Pada ayat-ayat ini terdapat enam petunjuk yang besar dan dalil yang kuat terhadap wujud Allah Ta’ala, ilmu dan kekuasaan Nya serta hikmah dan rahmat Nya. Allah Rabb semesta alam, ilah bagi orang-orang yang pertama dan datang kemudian tidak ada Rabb dan Ilah selain Nya. Akan tetapi yang dapat melihat dalil-dalil tersebut dan condong kepada ayat-ayat Allah adalah orang-orang yang berakal, sedangkan orang yang tidak berakal karena tidak menggunakan akalnya sebagaimana mestinya, sehingga tidak memnggunakannya untuk berpikir, memahami dan mengerti namun malah mengedepankan hawa nafsunya maka ialah orang yang buta tidak melihat sesuatu dan tuli tidak bisa mendengar sesuatu, serta pandir yang tidak berakal, hanya kepada Allah kita memohon perlindungan. Pelajaran dari ayat: • Ayat-ayat kauniyah di langit dan bumi menetapkan tentang wujud Allah TA’ala sebagai Rabb dan Ilah yang memiliki sifat sempurna dan suci dari kekurangan. • Ayat-ayat tanzilah qur’aniyah (ayat al-Qur’an) menetapkan tentang wujud Allah Ta’ala sebagai Rabb dan Ilah serta menetapkan kenabian Muhammad ﷺ dan kerasulannya. • Hanya orang-orang yang menggunakan akalnya yang dapat menangkap pesan dari ayat-ayat Al-Qur’an maupun ayat-ayat kauniyah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 164: Allah mengabarkan bahwasannya didalam penciptaan langit dengan meninggikannya dan meluaskannya, didalam penciptaan bumi dan apa yang didalamnya dari gunung dan lautan sebagai bukti agungnya kuasa Allah dan keesaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti tinggi dan luasnya langit serta nampak hal-hal yang menakjubkan di sana, ada matahari, bulan, bintang dan diaturnya sedemikian rupa untuk maslahat manusia. Seperti pada gunung-gunungnya, dataran, lautan dan lain-lain. Di sana terdapat dalil tentang keesaan Allah Subhaanahu wa Ta'aala dalam mencipta dan mengatur, demikian juga menunjukkan kemahakuasaan Allah, hikmah (kebijaksanaan)-Nya, di mana dengan hikmah tersebut semuanya tersusun rapi dan indah. Menunjukkan pula pengetahuan dan rahmat-Nya yang luas di mana Dia telah menyiapkan di bumi itu segala yang dibutuhkan makhluk yang tinggal di sana. Hal ini menunjukkan juga kesempurnaan Allah Azza wa Jalla dan keberhakan-Nya untuk diibadahi. Termasuk adanya panas, dingin dan keadaan sedang antara panas dan dingin, adanya cahaya dan adanya kegelapan, dan lain-lain, di mana dengan adanya pergantian itu ada maslahat yang banyak bagi manusia, hewan dan makhluk yang tinggal di bumi lainnya, termasuk pepohonan. Semua itu berjalan dengan teratur, rapi dan mengagumkan. Di sana terdapat dalil kemahakuasaan Allah, ilmu-Nya yang meliputi, hikmah-Nya yang dalam, rahmat yang luas, menunjukkan kebesaran-Nya dan kebesaran kerajaan dan kekuasaan-Nya. Ini semua menghendaki agar kita hanya beribadah kepada-Nya saja, mencintai-Nya dan mengagungkan-Nya serta mengarahkan rasa takut dan harap kepada-Nya juga berusaha menggapai kecintaan dan keridhaan-Nya. Allah Subhaanahu wa Ta'aala juga menundukkan laut dan angin untuk kapal tersebut, bahkan Dia pula yang memberi ilham kepada manusia cara membuat kapal sehingga dengan kapal itu manusia dapat dengan mudah memindahkan barang ke tempat yang jauh. Tanpa pertolongan Allah, tentu manusia tidak akan mampu, bagaimana mungkin akan mampu, padahal dia lahir dari perut ibunya dengan tidak mengenal apa-apa, lalu Allah memberikan kemampuan kepadanya dan mengajarkan apa yang dikehendaki-Nya. Hal ini merupakan bukti kasih sayang Allah dan perhatian-Nya kepada makhluk, di mana semua itu menghendaki agar kita mencintai-Nya, mengarahkan rasa takut dan harap kepada-Nya, mengarahkan kepada-Nya semua keta'atan, sikap tunduk dan pengagungan. Dari hujan yang diturunkan-Nya tumbuh berbagai jenis tumbuh-tumbuhan yang dibutuhkan manusia. Hal ini pun sama, menunjukkan kekuasaan Allah, rahmat dan kelembutan-Nya kepada hamba-hamba-Nya, Dia mengurus semua kebutuhan makhluk-Nya dan menunjukkan butuhnya makhluk kepada-Nya dari berbagai sisi. Bukankah semua itu menunjukkan agar Dia saja yang disembah oleh mereka, dan bukankah hal itu menunjukkan pula bahwa Dia mampu menghidupkan orang-orang yang telah mati dan memberikan balasan terhadap amal mereka?! Allah Subhaanahu wa Ta'aala menyebarkan di bumi berbagai jenis binatang. Hal ini juga menunjukkan kekuasaan-Nya, kebesaran-Nya, keesaan-Nya dan kerajaan-Nya yang besar. Dia menundukkan hewan-hewan itu untuk mannusia sehingga mereka bisa memanfa'atkannya. Ada di antara hewan itu yang mereka makan, mereka minum susunya, ada yang mereka tunggangi dan membantu maslahat mereka. Selain disebarkan-Nya berbagai jenis binatang untuk maslahat manusia, Dia pula yang menanggung rezekinya. Tidak ada satu hewan pun kecuali atas tanggungan Allah-lah rezeki-Nya. Yakni pengarahan angin ke beberapa arah seperti ke utara dan selatan. Ada angin yang panas dan ada angin yang dingin, ada yang menggiring awan ke tempat tertentu yang nantinya akan turun hujan, dan ada yang menerbangkan benih tumbuhan sehingga tumbuh lagi pohon yang baru. Siapakah yang mengarahkan angin tersebut dan menyimpankan di dalamnya berbagai manfaat bagi manusia kalau bukan Allah Subhaanahu wa Ta'aala yang Maha Bijaksana lagi Maha Penyayang dan Maha Lembut kepada hamba-hamba-Nya?! Bukankah termasuk hal yang sangat tidak pantas dan tidak masuk akal jika manusia bersenang-senang dengan rezki yang diberikan-Nya dan hidup dengan keihsanan-Nya, namun mereka malah menggunakan semua itu untuk mengerjakan maksiat dan hal-hal hal yang dimurkai-Nya? Dan bukankah hal ini menunjukkan hilm(santun), sabar, pemaaf dan lembut sekali Tuhannya?! Oleh karena itu, segala puji bagi Allah awal dan akhir, zhahir maupun batin. Al Hasil, apabila orang yang berakal memikirkan lebih lanjut makhluk ciptaan-Nya, tentu Dia akan mengetahui bahwa makhluk itu diciptakan untuk yang hak dan dengan hak sekaligus sebagai bukti dan saksi nyata terhadap kebenaran apa yang Allah sampaikan tentang keesaan-Nya dan apa yang Rasulullah shallallahu 'alaihi wa sallam sampaikan tentang hari akhir, dan bahwa semua makhluk tersebut ditundukkan oleh-Nya. Dari sini kita juga mengetahui bahwa alam langit maupun alam bumi semuanya butuh dan bergantung kepada-Nya, sedangkan Dia Maha Kaya tidak memerlukan apa-apa terhadap alam semesta, tidak ada Tuhan yang berhak disembah selain Dia. Yakni dengan akal, mereka bisa mengerti bahwa pada semua itu terdapat tanda-tanda keesaan Allah, keberhakan-Nya untuk diibadahi, besarnya kekuasaan Allah, tanda-tanda rahmat(kasih sayang)-Nya dan semua sifat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 164",
    "description": "Ketahuilah, sesungguhnya pada penciptaan langit dengan ketinggian dan keluasannya serta benda-benda angkasa di lingkupnya; dan bumi yang terhampar luas; pergantian malam dan siang dengan perubahan panjang-pendeknya dan kemanfaatan masing-masing; kapal dan perahu yang berlayar di laut dengan membawa muatan berupa manusia dan aneka ragam barang yang bermanfaat bagi manusia; apa yang diturunkan Allah dari langit berupa air, lalu dengan air itu dihidupkan-Nya bumi dengan berbagai macam tumbuhan setelah tanaman tersebut mati atau kering; apa yang dia tebarkan di dalam dan di permukaan-Nya berupa bermacam-macam binatang; dan perkisaran angin, baik yang semilir maupun yang kencang; dan awan yang menggumpal dan dikendalikan untuk bergelantungan antara langit dan bumi; semua itu sungguh merupakan tanda-tanda kebesaran Allah bagi orang-orang yang mengerti, menggunakan akalnya untuk mengambil pelajaran. Dan di antara manusia, meski telah menyaksikan tanda kebesaran dan kekuasaan Allah yang demikian banyak dan jelas, masih ada saja orang yang menyembah tuhan selain Allah. Mereka menjadikannya sebagai tandingan Allah, yang mereka cintai seperti mereka mencintai Allah. Mahasuci Allah dari segala tandingan dan sekutu. Adapun orang-orang yang beriman sangat besar cintanya kepada Allah melebihi cinta orang musyrik kepada sesembahan dan berhala mereka. Mereka tidak mempersekutukan Allah dengan apa pun. Sekiranya orang-orang yang berbuat zalim itu melihat dan mengetahui, ketika mereka melihat, menerima, dan merasakan azab pada hari kiamat, sedang mereka dan sesembahan mereka tidak mampu berbuat apa-apa, maka mereka baru menyadari bahwa kekuatan itu semuanya milik Allah dan bahwa Allah sangat berat azab-Nya. Ketika itulah mereka baru menyesali kezaliman yang telah mereka lakukan, penyesalan yang tidak berguna sedikit pun."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Dalam ayat ini Allah Subhanahu wa Ta'ala menyebutkan mengenai tanda-tanda kebesaran-NYA dalam penciptaan seluruh makhluk-NYA dan tidak ada yang mampu mengambil pelajaran dari segala kebesaran penciptaan-NYA kecuali orang-orang yang berakal dan memakai akalnya untuk mentafakurinya. Diantara tanda-tanda kebesaran Allah yang disebutkan dalam ayat ini adalah sebagai berikut: Pertama, Allah menciptakan langit yang kita lihat sekarang dengan ketinggiannya, keluasannya, keindahannya, bintang-bintangnya yang bertebaran, matahari yang menjadi pusat tatasurya, bulan yang peredarannya menajadi patokan penanggalan manusia, dan sega benda langit laiinya yang Allah ciptakan demi kemaslahat manusia. Kemudia Allah ciptakan bumi sebagai hamparan dengan tingkap kepadatannya, lembah-lembahnya, gunung-gunungnya, lautannya, padang saharanya, hutan-hutannya yang lebat, keramaiannya serta segala sesuatu yang ada padanya yang bermanfaat untuk manusia. Dan proses penciptaan langit dan bumi ini Allah ciptakan hanya dalam qurun waktu enam hari sebagaiman firman-NYA : وَلَقَدْ خَلَقْنَا السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ وَمَا مَسَّنَا مِنْ لُغُوبٍ “Dan sesungguhnya telah Kami ciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, dan Kami sedikitpun tidak ditimpa keletihan”. (QS : Qaff 38) Ibnu katsir menjelaskan makna hari dalam ayat ini terdapat dua pendapat menurut para ulama : hari seperti yang dipahami manusia, yaitu dari terbitnya matahari sampai terbenamnya kembali. Pendapat ini adalah pendapat jumhur para ulama. hari yang dimaksud adalah hari ahirat yang digambarkan bahwa satu hari ahirat sama dengan 1000 tahun perhitungan manusia di dunia. Pendapat ini adalah pendapat Ibnu ‘Abbas, Addohak dan ahli tafsir lainnya. Kedua, yaitu pergantian siang dan malam yang dengan teraturnya silih berganti tidak terkambat sedikitpun. Tidak ada malam yang mendahuli siang dan begitupula sebaliknya. Allah berfirman : لَا الشَّمْسُ يَنْبَغِي لَهَا أَنْ تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ “Tidaklah mungkin bagi matahari mendapatkan bulan dan malampun tidak dapat mendahului siang. Dan masing-masing beredar pada garis edarnya”. (QS : Yasin :40) Adakalanya disebagian tempat lamanya siang lebih panjang dari malam, dan adakalanya juga lamanya malam lebih panjang dari siang. Dan hal itu silih berganti dengan teraturnya. Tidak ada yang mampu mengatur ritme peredaran matahari dan bulan ini kecuali Allah Subhanahu wa Ta'ala. Ketiga, menundukan laut untuk bisa dilalui perahu berlayar diatasnya, firman-NYA: وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنْفَعُ النَّاسَ “Dan bahtera yang berlayar di laut membawa apa yang berguna bagi manusia” Yakni Allah tundukan laut agar dapat membawa berlayar perahu-perahu diatasnya, tidak membuat perahu tersebut tenggelam walaupun membawa beban yang berat. Perahu-perahu tersebut berlayar dari satu pantai ke pantai yang lain membawa barang-barang yang bermanfat bagi manusia. Menjadikan laut sebagai salah satu jalur transportasi manusia guna membawa barang-barang kebutuhan mereka dari satu pulau ke pulau yang lain. Ayat ini juga dijadikan dalil oleh Imam Alqurtubi akan bolehnya menggunakan pereahu sebagai sarana transportasi dan berdagang untuk kepentingan kehidupan manusia. Keempat, Allah turunkan hujan untuk menghidupkan bumi, firman-NYA : وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ مَاءٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا “Dan apa yang Allah turunkan dari langit berupa air, lalu dengan air itu Dia hidupkan bumi sesudah mati (kering)-nya” Ayat ini semakna dengan ayat lain, yaitu firman-NYA : وَآيَةٌ لَهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ *وَجَعَلْنَا فِيهَا جَنَّاتٍ مِنْ نَخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ *لِيَأْكُلُوا مِنْ ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ أَفَلَا يَشْكُرُونَ * سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنْبِتُ الْأَرْضُ وَمِنْ أَنْفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ* “Dan suatu tanda (kekuasaan Allah yang besar) bagi mereka adalah bumi yang mati. Kami hidupkan bumi itu dan Kami keluarkan dari padanya biji-bijian, maka daripadanya mereka makan.* Dan Kami jadikan padanya kebun-kebun kurma dan anggur dan Kami pancarkan padanya beberapa mata air,*supaya mereka dapat makan dari buahnya, dan dari apa yang diusahakan oleh tangan mereka. Maka mengapakah mereka tidak bersyukur?* Maha Suci Tuhan yang telah menciptakan pasangan-pasangan semuanya, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka maupun dari apa yang tidak mereka ketahui”. (QS. Yasin :33-36) Kelima, Allah ciptakan hewan-hewan di bumi. Firman-NYA : وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ “Dan Dia sebarkan di bumi itu segala jenis hewan” Allah Subhanahu wa Ta'ala ciptakan di bumi ini berbagai jenis hewan dengan berbagai jenis bentuk,warna dan manfaat. ada yang kecil ada yang besar, ada hewan yang bisa dijadikan makanan untuk manusia ada juga yang bisa diminum susunya dan ada juga yang bisa dijadikan tunggangan untuk berkendara bepergian ke beragai tempat. Semua itu semata-mata sebgai rezeki bagi manusia di dunia. وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِي كِتَابٍ مُبِينٍ “Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya, dan Dia mengetahui tempat berdiam binatang itu dan tempat penyimpanannya. Semuanya tertulis dalam Kitab yang nyata (Lauh mahfuzh)” (QS. Huud:6) Keenam, kisaran angin dan awan antara langit dan bumi, sebagaimna firman-NYA : وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاءِ وَالْأَرْضِ “Dan pengisaran angin dan awan yang dikendalikan antara langit dan bumi” yakni adakalanya angin datang mebawa rahmat dan adakalanya datang membawa azab. Adakalanya angina datang membwa tanda-tanda yang akan menggembirakan seperti awan yang datang sebelum turunnya hujan, dan adakalanya kadetangannya sebagai tanda yang menakutkan yang dapat menghancurkan apapun yang disapunya. Adakalanya angin datang dari arah timur ke barat adakalanya juga sebaliknya. Hal ini merupakan tanda-tanda kebesaran Allah Subhanahu wa Ta'ala yang meniupkan angin tersebut dari berbagai arah yang Allah kehendaki. Ibnu Katsir menyebutkan sebab turunnya ayat ini adalah jawaban untuk orang quraisy atas tantangan mereka kepada rasulullah sebagaimana hadits yang diriwayatkan oleh Ibnu Abbas أتت قريش محمدا صلى الله عليه وسلم فقالوا : يا محمد إنما نريد أن تدعو ربك أن يجعل لنا الصفا ذهبا ، فنشتري به الخيل والسلاح ، فنؤمن بك ونقاتل معك . قال : \" أوثقوا لي لئن دعوت ربي فجعل لكم الصفا ذهبا لتؤمنن بي \" فأوثقوا له ، فدعا ربه ، فأتاه جبريل فقال : إن ربك قد أعطاهم الصفا ذهبا على أنهم إن لم يؤمنوا بك عذبهم عذابا لم يعذبه أحدا من العالمين . قال محمد صلى الله عليه وسلم : \" رب لا ، بل دعني وقومي فلأدعهم يوما بيوم \" . فأنزل الله هذه الآية : ( إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس ) الآية Orang-orang Quraisy datang kepada Nabi Muhammad Shallallahu 'alaihi wa Sallam lalu mereka berkata “hai Muhammad, sesungguhnya kami ingin agar kamu berdo’a kepada tuhanmu agar menjadikan bagi kami bukit Shofa ini menjadi emas. Lalu akan membeli dengan emas tersebut kuda-kuda dan senjata. Jika kamu mampu, maka kami akan beriman kepadamu dan berperang bersamamu”. Kemudian nabi Muhammad menjawab: “berjanjilah kalian kepadaku, sekiranya aku berdo’a kepada tuhanku lalu Dia menjadikan bukit Shofa ini menjadi emas maka kalian akan beriman kepadaku”. Maka mereka mengadakan perjanjian tersebut dengan Nabi Muhammad Shallallahu 'alaihi wa Sallam. Maka berdo’alah Nabi kepada Tuhannya. Lalu kemudian datanglah malaikat Jibril 'alaihissalaam dan berkata : “Sesungguhnya Tuhanmu mampu menjadikan bukit shofa menjadi emas bagi mereka dengan syarat jika mereka tidak beriman kepadmu Dia akan mengazab mereka dengan azab yang belum pernah diberikan kepada siapapun dari umat-NYA”. Maka berkatalah nabi Muhammad Shallallahu 'alaihi wa Sallam: “Wahai Tuhanku, tidak. Lebih baik tinggalkanlah aku bersama kaumku maka aku akan mendakwahi mereka hari demi hari”. Maka Allah menurunkan ayat ini : “Sesungguhnya dalam penciptaan langit dan bumi, silih bergantinya malam dan siang, bahtera yang berlayar di laut membawa apa yang berguna bagi manusia, dan apa yang Allah turunkan dari langit berupa air, lalu dengan air itu Dia hidupkan bumi sesudah mati (kering)-nya dan Dia sebarkan di bumi itu segala jenis hewan, dan pengisaran angin dan awan yang dikendalikan antara langit dan bumi; sungguh (terdapat) tanda-tanda (keesaan dan kebesaran Allah) bagi kaum yang memikirkan.” (QS. Al-Baqoroh :164)"
  }
]