[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sudah banyak bukti-bukti yang pasti ini, sebagian dari manusia masih mengambil selain Allah sebagai berhala-berhala dan patung-patung serta penolong-penolong yang mereka jadikan sebagai tandingan-tandingan bagi Allah, mereka memberikan kepada tandingan-tandingan itu rasa cinta, pengagungan dan ketaatan Yang Tidak sepantasnya diberikan kecuali bagi Allah Semata. Sedangkan mukminin lebih besar cintanya kepada Allah daripada rasa cinta orang-orang kafir kepada Allah dan kepada Tuhan-Tuhan sesembahan mereka. Hal itu Karena orang-orang Mukmin memurnikan kecintaan secara penuh kepada Allah, sedangkan orang-orang kafir berbuat Syirik dalam kecintaan tersebut. Sekiranya orang-orang yang berbuat dzolim berupa kesyirikan dalah kehidupan dunia itu mengetahui, ketika mereka menyaksikan siksa akhirat, bahwa sesungguhnya Allah adalah Dzat yang maha esa dengan kekuatan mutlak, dan bahwasanya Allah sangat keras siksaannya, pastilah mereka tidak akan mengambil tuhan-tuhan selain Allah yang mereka sembah di samping menyembah Allah, dan mendekatkan diri melalui mereka kepada Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Meskipun ada tanda-tanda yang sangat jelas itu ternyata masih ada sebagian orang yang mencari tuhan-tuhan selain Allah untuk dijadikan sebagai tandingan Allah. Mereka mencintai tuhan-tuhan itu sebagaimana mereka mencintai Allah. Tetapi cinta orang-orang mukmin kepada Allah lebih besar daripada cinta orang-orang tersebut kepada tuhan-tuhan sesembahan mereka. Karena orang-orang mukmin itu tidak menyekutukan Allah dengan siapapun, dan mereka mencintai Allah di kala senang maupun susah. Sedangkan orang-orang (musyrik) itu hanya mencintai tuhan-tuhan mereka di kala senang saja. Namun di kala susah mereka hanya memohon kepada Allah. Sekiranya orang-orang yang berbuat zalim dengan cara menyekutukan Allah dan melakukan keburukan itu melihat kondisi mereka di akhirat, yaitu ketika mereka menyaksikan azab, niscaya mereka akan tahu bahwa satu-satunya pemilik semua kekuatan adalah Allah, dan Dia Mahakeras azab-Nya bagi orang-orang yang durhaka kepada-Nya. Sekiranya mereka melihat hal itu, niscaya mereka tidak akan menyekutukan Allah dengan siapapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165. Dan sebagian manusia menyembah selain Allah, yaitu berhala-berhala yang mereka jadikan sebagai sekutu Allah, mereka mencintai berhala-berhala itu sebagaimana kecintaan mereka kepada Allah. Adapun orang-orang yang beriman kepada Allah dan Rasul-Nya, kecintaan mereka kepada Allah lebih besar dibandingkan kecintaan orang-orang musyrik. Andai orang-orang musyrik mengetahui ketika mereka menyaksikan azab neraka bahwa Allah Maha Kuat dan Kuasa dan Dia mengazab dengan azab yang berat niscaya mereka tidak akan menyekutukan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللَّـهِ أَندَادًا (Dan diantara manusia ada orang-orang yang menyembah tandingan-tandingan selain Allah) Yakni dengan adanya bukti yang jelas yang menunjukkan kebesaran kekuasaan Allah masih ada manusia yang menyekutukan-Nya dalam peribadatan dengan patung-patung. يُحِبُّونَهُمْ كَحُبِّ اللَّـهِ ۖ (mereka mencintainya sebagaimana mereka mencintai Allah) Yakni sebagaimana kecintaan orang-orang mukmin kepada Allah, atau sebagaimana orang-orang musyrik mencintai Allah begitu pula mereka mencintai sekutu-sekutu yang mereka sembah selain-Nya. وَالَّذِينَ ءَامَنُوٓا۟ أَشَدُّ حُبًّا لِّلَّهِ ۗ (Adapun orang-orang yang beriman amat sangat cintanya kepada Allah) Yakni kecintaan mereka lebih besar dibandingkan kecintaan orang-orang musyrik kepada sekutu-sekutu mereka. وَلَوْ يَرَى الَّذِينَ ظَلَمُوٓا۟ (Dan jika seandainya orang-orang yang berbuat zalim itu mengetahui ketika mereka melihat (siksa) ) Yakni seandainya orang-orang zalim yang mencintai sekutu mereka seperti kecintaan mereka kepada Allah melihat keadaan mereka saat melihat azab di hari kiamat, melihat kekuatan Allah dan kelemahan sekutu-sekutu mereka dalam membela mereka menghadapi azab Allah niscaya mereka tidak akan mencintai sekutu-sekutu itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dikatakan kepada sufyan bin 'uyainah : Sesungguhnya para pecinta syahwat sangat menyukai apa yang diciptakan oleh hawa nafsu mereka ! kemudian beliau berkata : apakah kamu lupa dengan firman Allah : { وَمِنَ النَّاسِ مَنْ يَتَّخِذُ مِنْ دُونِ اللَّهِ أَنْدَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ } \"Dan diantara manusia ada orang-orang yang menyembah tandingan-tandingan selain Allah; mereka mencintainya sebagaimana mereka mencintai Allah\", dan firman Allah : { وَأُشْرِبُوا فِي قُلُوبِهِمُ الْعِجْلَ بِكُفْرِهِمْ } \"Dan telah diresapkan ke dalam hati mereka itu (kecintaan menyembah) anak sapi karena kekafirannya\" [ al-Baqarah : 93 ]. 2 ). Barangsiapa yang menjadikan sesuatu yang Allah tidak perintahkan untuk dicintai dengan tujuan cinta kepada Allah, maka sungguh dia telah membuat hal baru dalam agama ini tanpa Allah meridhoinya, karena hal itu merupakan pintu masuk kepada kesyirikan, sebagaimana yang Allah katakan : { وَمِنَ النَّاسِ مَنْ يَتَّخِذُ مِنْ دُونِ اللَّهِ أَنْدَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ ۖ وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ } 3 ). Pernahkah orang-orang yang menari di balik gemerlap hari valentine salah satu dari mereka mencoba untuk mengisi hatinya dengan cinta Alla ? Bagaimana jika dia mencoba untuk memanggil-Nya dengan nama-nama Nya yang baik sebagaimana yang dilakukan ketika seseorang mendekat kepada orang yang ia cintai dengan panggilan yang paling ia sukai ? Dan apa yang akan terjadi dengan cintanya kepada Allah jika mencoba untuk merenungi makna dari nama-nama Allah yang baik dan agung itu seperti yang dilakukan sesorang terhadap orang dicintainya ? Sungguh ia akan terbawa oleh fikirannya kepada sang pencipta, dan ia pun akan dipenuhi dengan kebahagiaan yang tidak dapat digambarkan melainkan kebahagiaan itu akan bertambah dengan upaya menggapai keridhoan tuhannya : { وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ }. 4 ). Perhatikanlah pemandangan mewah yang ditampilkan oleh orang-orang yang merayakan hari valentine, kamu akan menemukan bahwa kecintaan mereka kepada orang yang dicintai melebihi cinta mereka kepada Allah, { وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ } tetapi orang-orang yang beriman hanya mengagungkan cinta mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165. Adapun keadaan orang-orang yang tidak mau memikirkan dalil-dalil ini, yaitu orang-orang musyrik yang mengambil tuhan selain Allah untuk disembah berupa berhala-berhala mati dan manusia itu mencintai berhala-berhala mereka layaknya kecintaan orang mukmin kepada Allah. Dan orang-orang mukmin itu lebih dahsyat cintanya terhadap Allah daripada kecintaan orang-orang musyrik terhadap berhala dan tuhan tandingan mereka. Dan jika orang-orang yang menzalimi diri sendiri dengan berbuat kufur dan mencintai tandaingan-tandingan Allah itu melihat keadaan mereka ketika diperlihatkan azab pada hari kiamat karena kecintaan mereka terhadap tandingan Allah itu, niscaya mereka akan berikrar bahwa kekuatan yang sempurna itu hanya milik Allah. Tiada yang memiliki kekuatan selain Dia dan sesungguhnya Allah itu memiliki azab yang sangat dahsyat bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara manusia ada yang menjadikan sesuatu selain Allah sebagai tandingan-tandingan} sekutu-sekutu dalam hal peribatadan {yang mereka cintai seperti mencintai Allah. Adapun orang-orang yang beriman itu lebih kuat cintanya kepada Allah. Sekiranya orang-orang yang berbuat zalim itu melihat azab, bahwa kekuatan itu semuanya milik Allah dan bahwa Allah itu sangat keras azabNya"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "165-167. Alangkah tepatnya keterkaitan ayat-ayat ini dengan ayat sebelumnya, di mana setelah Allah menjelaskan keesaan-Nya dan dalil-dalil yang pasti di atas hal itu serta keterangan-keterangan tajam yang menyampaikan kepada keyakinan hati yang menghilangkan setiap keraguan, Allah menyebutkan dalam ayat ini bahwa “di antara manusia,” dengan adanya semua penjelasan yang sempurna itu, “ada orang-orang yang menyembah” sebagian dari makhluk-makhluk “sebagian tandingan-tandingan” bagi Allah, yakni para sekutu yang mereka samakan dengan Allah dalam ibadah, kecintaan, pengagungan, dan ketaatan. Dan orang yang dalam kondisi seperti ini setelah penegakan hujjah dan penjelasan tauhid dapat dipastikan bahwa ia adalah seseorang yang durhaka terhadap Allah, menentangNya, berpaling dari merenungi ayat-ayatNya, dan memikirkan makhluk-makhlukNya, maka ia tidak punya alasan sama sekali dalam hal itu, bahkan pantas ia mendapatkan siksaan. Orang-orang yang membuat tandingan-tandingan bagi Allah tersebut, tidaklah menyejajarkan mereka dengan Allah dalam hal mencipta, mengatur (alam), dan memberi rezeki, akan tetapi mereka menyamakannya dengan Allah dalam ibadah, hingga mereka menyembah tandingan-tandingan tersebut agar dapat mendekatkan mereka kepada Allah. Pada FirmanNya, “menjadikan” merupakan sebuah dalil bahwa Allah tidak memiliki tandingan, akan tetapi kaum musyrikin hanya menjadikan bagi Allah tandingan-tandingan dari beberapa makhluk hanya sebatas penamaan saja dan kata-kata yang tak berarti, sebagaimana Allah berfirman : \"Mereka menjadikan beberapa sekutu bagi Allah. Katakanlah: “Sebutkanlah sifat-sifat mereka itu”. Atau apakah kamu hendak memberitakan kepada Allah apa yang tidak diketahui-Nya di bumi, atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja.\" QS ar-ra’d ayat 33 \"Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keteranganpun untuk (menyembah)nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan,\" QS an-najm ayat 23 Oleh karena itu, makhluk bukanlah tandingan bagi Allah, karena Allah adalah pencipta dan selainNya adalah makhluk, Rabb yang memberikan rezeki, adapun selainNya adalah yang diberi Rizki, Allah adalah Maha kaya sedangkan kalian adalah fakir, Dia Maha Sempurna dari segala aspeknya, sedang hamba serba kekurangan dalam segala aspeknya Allahlah yang memberikan manfaat dan madhorot, sedang makhluk tidak memiliki apa-apa dari manfaat, madhorot maupun urusan seperti itu. Maka sangatlah diketahui dengan yakin akan kebatilan perkataan orang-orang yang menjadikan dari selain Allah sebagai Tuhan Tuhan dan tandingan-tandingan, baik dari para malaikat, para nabi, orang-orang Shalih, patung ataupun yang lainnya, dan bahwasanya Allah lah yang berhak untuk dicintai secara penuh dan ditaati secara total. Oleh karena itu Allah memuji kaum mukminin dengan FirmanNya, “adapun orang-orang yang beriman sangat cinta kepada Allah,” maksudnya, daripada orang-orang yang membuat tandingan bagi Allah itu kepada tandingan-tandingan tersebut, karena mereka, kaum mukminin tulus dalam mencintai Allah, sedang mereka menyekutukan Allah dengan tandingan-tandingan tersebut, dan karena mereka (orang-orang beriman) mencintai dzat yang berhak untuk dicintai secara hakiki yang mana mencintaiNya adalah inti dari segala kebaikan seorang hamba, kebahagiaannya dan keselamatannya, sedang kaum musyrikin mencintai sesuatu yang sama sekali tidak pantas untuk diberikan cinta dan mencintainya adalah inti dari kesengsaraan seorang hamba, kerusakannya, dan kekacauan urusan dirinya. Oleh karena itu, Allah mengancam mereka dengan FirmanNya, “dan jika seandainya orang-orang yang berbuat zalim itu mengetahui” (akibat buruk) dari menjadikan tandingan tandingan bagi Allah dan tunduk kepada selain Robb seluruh makhluk, dan mereka berlaku zhalim terhadap hamba-hambaNya dari jalan Allah serta usaha mereka dalam memadhorotkan hamba-hambaNya dengan menghalangi mereka, “ketika mereka melihat siksa” yaitu pada hari kiamat secara jelas dengan mata mereka sendiri, “bahwa kekuatan itu kepunyaan Allah semua dan bahwa Allah amat berat siksaannya (niscaya mereka menyesal).” Maksudnya, mereka akan mengetahui secara benar dan yakin bahwa kekuatan dan kekuasaan hanya milik Allah semuanya dan bahwasanya tandingan-tandingan mereka itu tidak memiliki kekuatan sedikitpun, maka jelaslah bagi mereka pada saat itu kelemahan dan ketidakmampuannya, tidak seperti apa yang mereka duga saat di dunia, bahkan mereka berpikir bahwa tandingan-tandingan itu memiliki peran dalam hal itu, dan bahwa itu semua akan mendekatkan mereka kepada Allah, serta menyampaikan mereka kepadaNya. Maka sia-sialah dugaan mereka tersebut, hilanglah usaha mereka, dan patutlah mereka mendapat azab yang pedih, sedang tandingan-tandingan yang mereka buat itu tidak dapat menolong mereka, dan tidak dapat memberikan manfaat sedikitpun, bahkan mereka akan mendapatkan bahaya dari arah yang mulanya mereka sangka ada manfaatnya. Orang-orang yang diikuti itu berlepas diri dari mereka yang mengikutinya dan terputuslah hubungan yang terjalin diantara mereka saat mereka masih di dunia dahulu, sebab hubungan itu terjalin karena selain Allah, dan atas perintah selain Allah, serta berkaitan dengan perkara kebatilan yang tidak ada hakikatnya, yang akhirnya pupuslah amalan mereka, hancurlah kondisi mereka, dan jelaslah bahwa mereka itu adalah orang-orang yang dusta dan bahwasanya perbuatan-perbuatan mereka yang mereka harapkan manfaatnya dan hasilnya namun terbalik menjadi penyesalan dan kerugian, dan bahwa mereka kekal dalam neraka, tidak akan keluar darinya selamanya, maka Adakah kerugian kerugian seperti ini? Yang demikian itu karena mereka mengikuti kebatilan lalu mereka beramal dengan perbuatan yang batil pula. Mereka mengharapkan perkara yang tidak bisa diharapkan dan bergantung kepada sesuatu yang tidak ada gunanya bergantung padanya. Akhirnya batillah perbuatan-perbuatan mereka karena batilnya tempat mereka bergantung. Dan ketika perbuatan-perbuatan mereka batil, terjadilah kerugian dengan menyerapnya harapan dan malah membahayakan mereka dengan bahaya yang besar. Hal ini sangatlah berbeda jauh dengan orang yang bergantung hanya kepada Allah yang Maha memiliki kebenaran yang nyata, mengikhlaskan perbuatan hanya karenaNya dan mengharap manfaatnya. Orang yang seperti inilah yang telah meletakkan kebenaran pada tempatnya, dimana perbuatan-perbuatannya adalah benar karena bergantung kepada yang benar, hingga dia berhasil mendapatkan buah dari perbuatannya dan merasakan balasannya pada sisi robbnya tanpa terputus, sebagaimana Allah berfirman : \"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka. Dan orang-orang mukmin dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka. Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.\" QS Muhammad ayat 1-3 Di saat itu orang-orang yang mengikuti, akan berangan-angan agar dikembalikan lagi ke dunia hingga mereka bisa berlepas diri dari makhluk-makhluk yang mereka ikuti tersebut yaitu dengan meninggalkan kesirikan terhadap Allah dan kembali beramal dengan ikhlas hanya karena Allah semata. Namun itu sangatlah mustahil dan telah pupuslah harapan, karena saat itu bukanlah lagi masa penangguhan dan penundaan. Walaupun demikian juga mereka itu adalah orang-orang yang dusta, karena bila pun mereka dikembalikan ke dunia, pastilah mereka akan kembali kepada hal yang telah dilarang bagi mereka, dan apa yang mereka katakan itu hanyalah sebatas angan-angan belaka yang mereka angan-angan kan dengan rasa jengkel dan marah terhadap orang-orang yang mereka ikuti tersebut ketika berlepas diri dari mereka dan dosa yang telah nyata itu adalah dosa mereka sendiri. Dan pemimpin dari tandingan-tandingan yang diikuti dalam kejahatan itu adalah iblis. Walaupun demikian ia berkata kepada para pengikutnya : \"tatkala perkara (hisab) telah diselesaikan: “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri.\" QS Ibrahim ayat 22"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 165: Allah berkata : dengan bukti yang jelas dan pasti ini adalah keagungan kerajaanNya dan kuasaNya serta hikmahNya terdapat bagian manusia karena sebab kebodohan dan kesombongan mereka mengambil kesembahan selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dengan ayat sebelumnya terkait, ayat sebelumnya menerangkan tentang bukti-bukti keesaan Allah Subhaanahu wa Ta'aala di alam semesta, di mana bukti tersebut membuahkan ilmu yang yakin akan kebenaran keesaan Allah. Namaun anehnya, masih saja ada di antara manusia yang menjadikan makhluk sebagai tandingan bagi Allah Subhaanahu wa Ta'aala, padahal jelas sekali bukti keesaan-Nya. Tandingan dalam mengarahkan ibadah, bukan tandingan dalam menciptakan, memberi rezeki dan mengatur karena mereka (tandingan-tandingan) itu tidak bisa apa-apa, ia sendiri dicipta dan lemah. Makhluk tidaklah sebanding dengan Pencipta, Allah yang memberikan rezeki, sedangkan selain-Nya diberi rezeki, Allah Yang Maha Kaya, sedangkan selain-Nya butuh kepada-Nya, Dia Maha Sempurna dari berbagai sisi, sedangkan selain-Nya memiliki kekurangan dari berbagai sisi. Allah yang memberikan manfa'at dan madharat, ssedangkan selain-Nya tidak berkuasa apa-apa. Dengan demikian, batil sekali orang yang mengadakan tandingan bagi Allah, baik tandingan itu berupa malaikat, nabi, orang shalih, berhala dsb. Allah-lah yang berhak dicintai secara sempurna dan disikapi dengan tunduk menghinakan diri secara sempurna. Mereka menyembah dan mengagungkan tandingan tersebut serta mencintainya seperti halnya menyembah Allah, mengagungkan-Nya dan mencintai-Nya. Jika seperti ini keadaannya, yakni hujjah tentang keesaan Allah dan bukti telah tegak maka orang tersebut adalah penentang Allah, berpaling dari memikirkan ayat-ayat-Nya baik pada dalil yang disampaikan maupun pada alam semesta. Ia tidak lagi memiliki udzur sehingga pantas untuk mendapat siksa. Melebihi cinta orang-orang musyrik kepada sesembahan mereka selain Allah. Hal itu, karena orang-orang mukmin mengikhlaskan cinta kepada-Nya, sedangkan orang-orang musyrik menyekutukan-Nya. Mereka (orang-orang mukmin) mencintai Zat yang berhak dicintai, di mana mencintai-Nya adalah sumber kebaikan dan kebahagiaan seorang hamba. Sebaliknya, orang-orang mursyrik mencintai sesuatu yang tidak berhak dicintai, jelas sekali mencintainya merupakan sumber celaka seorang hamba dan penyebab rusak kehidupannya. Orang yang zalim di sini ialah orang-orang yang menyembah selain Allah. Maksudnya, ketika orang yang zalim tersebut melihat sesembahan mereka tidak memberikan manfaat sama sekali pada hari Kiamat, mereka pasti akan mengetahui secara jelas kelemahan berhala dan apa yang mereka sembah selain Allah dan meyakini bahwa seluruh kekuatan hanya milik Allah. Tidak seperti ketika di dunia, mereka (orang-orang musyrik) menyangka bahwea sesembahan mereka memiliki kekuatan dan kemampuan, padahal sesembahan itu tidak bisa berbuat apa-apa, apalagi sampai menyelamatkan mereka dari siksa Allah pada hari kiamat. Dan tentu mereka tidak akan mengadakan tandingan bagi Allah Subhaanahu wa Ta'aala ketika di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 165",
    "description": "Dan di antara manusia, meski telah menyaksikan tanda kebesaran dan kekuasaan Allah yang demikian banyak dan jelas, masih ada saja orang yang menyembah tuhan selain Allah. Mereka menjadikannya sebagai tandingan Allah, yang mereka cintai seperti mereka mencintai Allah. Mahasuci Allah dari segala tandingan dan sekutu. Adapun orang-orang yang beriman sangat besar cintanya kepada Allah melebihi cinta orang musyrik kepada sesembahan dan berhala mereka. Mereka tidak mempersekutukan Allah dengan apa pun. Sekiranya orang-orang yang berbuat zalim itu melihat dan mengetahui, ketika mereka melihat, menerima, dan merasakan azab pada hari kiamat, sedang mereka dan sesembahan mereka tidak mampu berbuat apa-apa, maka mereka baru menyadari bahwa kekuatan itu semuanya milik Allah dan bahwa Allah sangat berat azab-Nya. Ketika itulah mereka baru menyesali kezaliman yang telah mereka lakukan, penyesalan yang tidak berguna sedikit pun. Itulah hari kiamat, hari ketika orang-orang yang diikuti, yakni para pemimpin, berlepas tangan dari orang-orang yang mengikuti atau orang yang mereka pimpin; dan mereka melihat azab pedih yang tidak bisa mereka hindari, dan pada hari itu segala hubungan antara mereka terputus, baik hubungan nasab, persahabatan, percintaan, maupun pekerjaan. Pada hari itu setiap manusia akan mempertanggungjawabkan perbuatan masing-masing (lihat: surah abasa/80: 34-37)."
  }
]