[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika mereka menyaksikan dengan langsung siksaan akhirat, maka berlepas dirilah para pimpinan yang mereka ikuti dari orang-orang yang mengikuti mereka dalam kesyirikan, dan putuslah sudah hubungan yang menjadi jalinan di antara mereka di dunia, baik hubungan kekerabatan, hubungan pengikut, hubungan agama dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "166. Hal itu terjadi ketika para pemimpin yang menjadi panutan berlepas tangan dari orang-orang lemah yang menjadi pengikut mereka, karena para pemimpin itu menyaksikan betapa dahsyatnya peristiwa-peristiwa yang terjadi di hari kiamat, dan mereka merasa tidak berdaya untuk menyelamatkan diri mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "166-167. Ketika mereka menyaksikan azab ini, para pemimpin mereka akan saling berselisih dengan para pengikut mereka, hubungan dan kasih sayang mereka akan sirna. Para pengikut akan berkata: \"Andai saja kami dapat kembali ke dunia.\" Hal ini agar mereka dapat berlepas diri dari para pemimpin mereka, sebagaimana para pemimpin berlepas diri dari mereka. Allah memperlihatkan kepada mereka amalan-amalan buruk mereka sebagaimana Dia memperlihatkan azab kepada mereka agar mereka merasakan penyesalan. Dan mereka tidak akan dapat keluar dari neraka. Syeikh as-Syinqithi berkata, firman Allah dalam surat al-Baqarah ayat 166 menunjukkan perselisihan para penghuni neraka, dan Allah menjelaskan situasi tersebut dalam ayat-ayat lain, seperti dalam surat Saba ayat 31-33: وَقَالَ الَّذِيْنَ كَفَرُوْا لَنْ نُّؤْمِنَ بِهٰذَا الْقُرْاٰنِ وَلَا بِالَّذِيْ بَيْنَ يَدَيْهِۗ وَلَوْ تَرٰىٓ اِذِ الظّٰلِمُوْنَ مَوْقُوْفُوْنَ عِنْدَ رَبِّهِمْۖ يَرْجِعُ بَعْضُهُمْ اِلٰى بَعْضِ ِۨالْقَوْلَۚ يَقُوْلُ الَّذِيْنَ اسْتُضْعِفُوْا لِلَّذِيْنَ اسْتَكْبَرُوْا لَوْلَآ اَنْتُمْ لَكُنَّا مُؤْمِنِيْنَ. Dan orang-orang kafir berkata: \"Kami sekali-kali tidak akan beriman kepada al-Quran dan tidak (pula) kepada kitab yang sebelumnya.\" Dan (alangkah hebatnya) kalau kamu lihat ketika orang-orang yang zalim itu dihadapkan kepada Rabb-Nya, sebahagian dari mereka menghadapkan perkataan kepada sebahagian yang lain; orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri: \"Kalau tidaklah karena kamu tentulah kami menjadi orang-orang yang beriman\". قَالَ الَّذِيْنَ اسْتَكْبَرُوْا لِلَّذِيْنَ اسْتُضْعِفُوْٓا اَنَحْنُ صَدَدْنٰكُمْ عَنِ الْهُدٰى بَعْدَ اِذْ جَاۤءَكُمْ بَلْ كُنْتُمْ مُّجْرِمِيْنَ Orang-orang yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah: \"Kamikah yang telah menghalangi kamu dari petunjuk sesudah petunjuk itu datang kepadamu? (Tidak), sebenarnya kamu sendirilah orang-orang yang berdosa.\" وَقَالَ الَّذِيْنَ اسْتُضْعِفُوْا لِلَّذِيْنَ اسْتَكْبَرُوْا بَلْ مَكْرُ الَّيْلِ وَالنَّهَارِ اِذْ تَأْمُرُوْنَنَآ اَنْ نَّكْفُرَ بِاللّٰهِ وَنَجْعَلَ لَهٗٓ اَنْدَادًا ۗوَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَۗ وَجَعَلْنَا الْاَغْلٰلَ فِيْٓ اَعْنَاقِ الَّذِيْنَ كَفَرُوْاۗ هَلْ يُجْزَوْنَ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri: \"(Tidak), sebenarnya tipu daya (mu) di waktu malam dan siang (yang menghalangi kami), ketika kamu menyeru kami supaya kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya.\" Kedua belah pihak menyatakan penyesalan tatkala mereka melihat azab. Dan kami pasang belenggu di leher orang-orang yang kafir. Mereka tidak di balas melainkan dengan apa yang telah mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "166. إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُوا۟ ( (Yaitu) ketika orang-orang yang diikuti itu berlepas diri dari orang-orang yang mengikutinya) Yakni pemimpin-pemimpin mereka dalam kekafiran yang berlepas diri di hari kiamat terhadap pengikut-pengikut mereka. وَرَأَوُا۟ الْعَذَابَ (dan mereka melihat siksa) Yakni para pemimpin kekafiran dan pengikut-pengikut mereka melihat hal tersebut. Pendapat lain mengatakan: ketika melihat azab di dunia. Dan yang lain mengatakan: ketika ditunjukkan catatan amal mereka dan ditanya di akhirat atas perbuatan mereka. وَتَقَطَّعَتْ بِهِمُ الْأَسْبَابُ (dan (ketika) segala hubungan antara mereka terputus) Yakni terputus segala hubungan dan relasi yang dulu ada di dunia baik itu berupa persaudaraan atau yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "166. Dan ingatlah ketika para pemimpin kafir berlepas diri dari para pengikutnya pada hari kiamat. Dua kelompok ini, yaitu para pengikut fanatik dan orang-orang yang diikuti ini melihat azab yang meliputi mereka ketika dimintai pertanggung jawaban di akhirat, maka ikatan yang ada di antara mereka di dunia berupa kasih sayang dan lain-lain akan lenyap"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika orang-orang yang diikuti berlepas tangan dari orang-orang yang mengikuti saat mereka melihat azab, dan (ketika) segala hubungan antara mereka terputus} dan terpecah belah hubungan kekerabatan dan pertemanan yang ada di antara mereka di dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165-167. Alangkah tepatnya keterkaitan ayat-ayat ini dengan ayat sebelumnya, di mana setelah Allah menjelaskan keesaan-Nya dan dalil-dalil yang pasti di atas hal itu serta keterangan-keterangan tajam yang menyampaikan kepada keyakinan hati yang menghilangkan setiap keraguan, Allah menyebutkan dalam ayat ini bahwa “di antara manusia,” dengan adanya semua penjelasan yang sempurna itu, “ada orang-orang yang menyembah” sebagian dari makhluk-makhluk “sebagian tandingan-tandingan” bagi Allah, yakni para sekutu yang mereka samakan dengan Allah dalam ibadah, kecintaan, pengagungan, dan ketaatan. Dan orang yang dalam kondisi seperti ini setelah penegakan hujjah dan penjelasan tauhid dapat dipastikan bahwa ia adalah seseorang yang durhaka terhadap Allah, menentangNya, berpaling dari merenungi ayat-ayatNya, dan memikirkan makhluk-makhlukNya, maka ia tidak punya alasan sama sekali dalam hal itu, bahkan pantas ia mendapatkan siksaan. Orang-orang yang membuat tandingan-tandingan bagi Allah tersebut, tidaklah menyejajarkan mereka dengan Allah dalam hal mencipta, mengatur (alam), dan memberi rezeki, akan tetapi mereka menyamakannya dengan Allah dalam ibadah, hingga mereka menyembah tandingan-tandingan tersebut agar dapat mendekatkan mereka kepada Allah. Pada FirmanNya, “menjadikan” merupakan sebuah dalil bahwa Allah tidak memiliki tandingan, akan tetapi kaum musyrikin hanya menjadikan bagi Allah tandingan-tandingan dari beberapa makhluk hanya sebatas penamaan saja dan kata-kata yang tak berarti, sebagaimana Allah berfirman : \"Mereka menjadikan beberapa sekutu bagi Allah. Katakanlah: “Sebutkanlah sifat-sifat mereka itu”. Atau apakah kamu hendak memberitakan kepada Allah apa yang tidak diketahui-Nya di bumi, atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja.\" QS ar-ra’d ayat 33 \"Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keteranganpun untuk (menyembah)nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan,\" QS an-najm ayat 23 Oleh karena itu, makhluk bukanlah tandingan bagi Allah, karena Allah adalah pencipta dan selainNya adalah makhluk, Rabb yang memberikan rezeki, adapun selainNya adalah yang diberi Rizki, Allah adalah Maha kaya sedangkan kalian adalah fakir, Dia Maha Sempurna dari segala aspeknya, sedang hamba serba kekurangan dalam segala aspeknya Allahlah yang memberikan manfaat dan madhorot, sedang makhluk tidak memiliki apa-apa dari manfaat, madhorot maupun urusan seperti itu. Maka sangatlah diketahui dengan yakin akan kebatilan perkataan orang-orang yang menjadikan dari selain Allah sebagai Tuhan Tuhan dan tandingan-tandingan, baik dari para malaikat, para nabi, orang-orang Shalih, patung ataupun yang lainnya, dan bahwasanya Allah lah yang berhak untuk dicintai secara penuh dan ditaati secara total. Oleh karena itu Allah memuji kaum mukminin dengan FirmanNya, “adapun orang-orang yang beriman sangat cinta kepada Allah,” maksudnya, daripada orang-orang yang membuat tandingan bagi Allah itu kepada tandingan-tandingan tersebut, karena mereka, kaum mukminin tulus dalam mencintai Allah, sedang mereka menyekutukan Allah dengan tandingan-tandingan tersebut, dan karena mereka (orang-orang beriman) mencintai dzat yang berhak untuk dicintai secara hakiki yang mana mencintaiNya adalah inti dari segala kebaikan seorang hamba, kebahagiaannya dan keselamatannya, sedang kaum musyrikin mencintai sesuatu yang sama sekali tidak pantas untuk diberikan cinta dan mencintainya adalah inti dari kesengsaraan seorang hamba, kerusakannya, dan kekacauan urusan dirinya. Oleh karena itu, Allah mengancam mereka dengan FirmanNya, “dan jika seandainya orang-orang yang berbuat zalim itu mengetahui” (akibat buruk) dari menjadikan tandingan tandingan bagi Allah dan tunduk kepada selain Robb seluruh makhluk, dan mereka berlaku zhalim terhadap hamba-hambaNya dari jalan Allah serta usaha mereka dalam memadhorotkan hamba-hambaNya dengan menghalangi mereka, “ketika mereka melihat siksa” yaitu pada hari kiamat secara jelas dengan mata mereka sendiri, “bahwa kekuatan itu kepunyaan Allah semua dan bahwa Allah amat berat siksaannya (niscaya mereka menyesal).” Maksudnya, mereka akan mengetahui secara benar dan yakin bahwa kekuatan dan kekuasaan hanya milik Allah semuanya dan bahwasanya tandingan-tandingan mereka itu tidak memiliki kekuatan sedikitpun, maka jelaslah bagi mereka pada saat itu kelemahan dan ketidakmampuannya, tidak seperti apa yang mereka duga saat di dunia, bahkan mereka berpikir bahwa tandingan-tandingan itu memiliki peran dalam hal itu, dan bahwa itu semua akan mendekatkan mereka kepada Allah, serta menyampaikan mereka kepadaNya. Maka sia-sialah dugaan mereka tersebut, hilanglah usaha mereka, dan patutlah mereka mendapat azab yang pedih, sedang tandingan-tandingan yang mereka buat itu tidak dapat menolong mereka, dan tidak dapat memberikan manfaat sedikitpun, bahkan mereka akan mendapatkan bahaya dari arah yang mulanya mereka sangka ada manfaatnya. Orang-orang yang diikuti itu berlepas diri dari mereka yang mengikutinya dan terputuslah hubungan yang terjalin diantara mereka saat mereka masih di dunia dahulu, sebab hubungan itu terjalin karena selain Allah, dan atas perintah selain Allah, serta berkaitan dengan perkara kebatilan yang tidak ada hakikatnya, yang akhirnya pupuslah amalan mereka, hancurlah kondisi mereka, dan jelaslah bahwa mereka itu adalah orang-orang yang dusta dan bahwasanya perbuatan-perbuatan mereka yang mereka harapkan manfaatnya dan hasilnya namun terbalik menjadi penyesalan dan kerugian, dan bahwa mereka kekal dalam neraka, tidak akan keluar darinya selamanya, maka Adakah kerugian kerugian seperti ini? Yang demikian itu karena mereka mengikuti kebatilan lalu mereka beramal dengan perbuatan yang batil pula. Mereka mengharapkan perkara yang tidak bisa diharapkan dan bergantung kepada sesuatu yang tidak ada gunanya bergantung padanya. Akhirnya batillah perbuatan-perbuatan mereka karena batilnya tempat mereka bergantung. Dan ketika perbuatan-perbuatan mereka batil, terjadilah kerugian dengan menyerapnya harapan dan malah membahayakan mereka dengan bahaya yang besar. Hal ini sangatlah berbeda jauh dengan orang yang bergantung hanya kepada Allah yang Maha memiliki kebenaran yang nyata, mengikhlaskan perbuatan hanya karenaNya dan mengharap manfaatnya. Orang yang seperti inilah yang telah meletakkan kebenaran pada tempatnya, dimana perbuatan-perbuatannya adalah benar karena bergantung kepada yang benar, hingga dia berhasil mendapatkan buah dari perbuatannya dan merasakan balasannya pada sisi robbnya tanpa terputus, sebagaimana Allah berfirman : \"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka. Dan orang-orang mukmin dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka. Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.\" QS Muhammad ayat 1-3 Di saat itu orang-orang yang mengikuti, akan berangan-angan agar dikembalikan lagi ke dunia hingga mereka bisa berlepas diri dari makhluk-makhluk yang mereka ikuti tersebut yaitu dengan meninggalkan kesirikan terhadap Allah dan kembali beramal dengan ikhlas hanya karena Allah semata. Namun itu sangatlah mustahil dan telah pupuslah harapan, karena saat itu bukanlah lagi masa penangguhan dan penundaan. Walaupun demikian juga mereka itu adalah orang-orang yang dusta, karena bila pun mereka dikembalikan ke dunia, pastilah mereka akan kembali kepada hal yang telah dilarang bagi mereka, dan apa yang mereka katakan itu hanyalah sebatas angan-angan belaka yang mereka angan-angan kan dengan rasa jengkel dan marah terhadap orang-orang yang mereka ikuti tersebut ketika berlepas diri dari mereka dan dosa yang telah nyata itu adalah dosa mereka sendiri. Dan pemimpin dari tandingan-tandingan yang diikuti dalam kejahatan itu adalah iblis. Walaupun demikian ia berkata kepada para pengikutnya : \"tatkala perkara (hisab) telah diselesaikan: “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri.\" QS Ibrahim ayat 22"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { التبرؤ } at-Tabarru’ : Menjauhinya karena tidak menyukainya. { ٱلَّذِينَ ٱتُّبِعُواْ } alladziinat tubi’u : Sesembahan dan pemuka yang menyesatkan. { ٱلَّذِينَ ٱتَّبَعُواْ } alladziinat taba’u : Orang-orang musyrik dan orang yang mengikuti para pemuka yang menyesatkan. { ٱلۡأَسۡبَابُ } al-Asbaab : Bentuk jamak dari kata sabab, secara bahasa artinya adalah tali. Kemudian digunakan sebagai istilah untuk sesuatu yang mengikat dua hal yang mengantarkan pada tujuan khusus. Makna ayat: Pada saat orang-orang yang diikuti yaitu para pemimpin zhalim dan penyeru kesyirikan serta kesesatan berlepas diri dari pengikutnya yang bodoh dan seperti kerbau yang tercocok hidungnya. Saat adzab ditampakkan di hadapan mereka, maka terputuslah ikatan yang mengikat antara pemimpin dan pengikutnya. Pelajaran dari ayat: • Pada hari kiamat akan terlepas seluruh ikatan pertemanan, persaudaraan, dan hanya akan tersisa ikatan keimanan dan ukhuwah dalam iman. • Para pemimpin yang mengajak berbuat kesyirikan dan kesesatan serta penyeru yang mengajak kepada keburukan dan kerusakan, akan berlepas diri dari para pengikutnya atas kezhaliman, keburukan, dan kerusakan yang mereka perbuat. Para pemimpin itu tidak bisa memberikan manfaat sedikitpun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 166: Allah mengajarkan bahwasannya para imam kekafiran dan kesesatan mereka berlepas diri dari hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini terjadi pada hari kiamat ketika Allah mengumpulkan antara para pemimpin dan para pengikut, lalu mereka saling berlepas tangan. Para pemimpin tidak mau bertanggung jawab terhadap tindakan mereka mengajak kepada kesesatan sehingga para pengikut marah dan kesal serta mengungkapkan kata-kata sebagaimana yang disebutkan pada ayat selanjutnya. Yakni hubungan yang terjalin selama di dunia mereka terputus, bahkan teman akrab menjadi musuh. Hal ini, karena hubungan mereka di dunia tidak dibangun karena Allah, tetapi karena sesuatu yang batil yang tidak ada hakikatnya dan ketika itu nampak bahwa orang-orang yang mereka ikuti dalam keadaan dusta, perbuatan yang sebelumnya mereka kira dapat diharapkan manfa'at ternyata hasilnya sia-sia, berubah menjadi penyesalan, mereka akan masuk ke dalam neraka lagi kekal di dalamnya dan tidak akan keluar. Sebagian mufassir ada yang mengartikan \"asbaab\" di ayat tersebut dengan sebab untuk meloloskan diri, yakni segala sebab dan upaya untuk meloloskan diri terputus. Hal ini disebabkan karena yang mereka ikuti adalah hal yang batil, mereka mengerjakan amalan yang batil, berharap kepada sesuatu yang tidak bisa diharap serta bergantung kepada tempat yang tidak bisa dipakai bergantung (seperti berhala dan sesembahan lainnya selain Allah), sehingga amal mereka sia-sia dan terjadilah penyesalan karena apa yang diharapkan ternyata tidak bisa diharap. Berbeda dengan orang yang bergantung kepada Allah, mengikhlaskan amalan karena-Nya dan mengharap manfa'atnya, maka sesungguhnya orang tersebut telah meletakkan sesuatu pada tempatnya, sehingga amalnya adalah hak karena bergantung kepada yang hak, ia akan memperoleh hasil dari amalnya dan mendapatkan balasan di sisi Tuhannya (lihat surat Muhammad: 1-2)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 166",
    "description": "Itulah hari kiamat, hari ketika orang-orang yang diikuti, yakni para pemimpin, berlepas tangan dari orang-orang yang mengikuti atau orang yang mereka pimpin; dan mereka melihat azab pedih yang tidak bisa mereka hindari, dan pada hari itu segala hubungan antara mereka terputus, baik hubungan nasab, persahabatan, percintaan, maupun pekerjaan. Pada hari itu setiap manusia akan mempertanggungjawabkan perbuatan masing-masing (lihat: surah abasa/80: 34-37). Dan karena dahsyatnya siksa Allah yang mereka saksikan, orangorang yang mengikuti berkhayal dan berkata, sekiranya kami mendapat kesempatan kembali ke dunia, tentu kami akan berlepas tangan dari mereka; kami tidak akan mengikuti mereka sebagaimana pada hari ini mereka berlepas tangan dari kami dan tidak bertanggung jawab atas ajakan dan tipu daya mereka kepada kami. Demikianlah Allah memperlihatkan kepada mereka seluruh amal perbuatan mereka, membiarkan mereka larut di dalamnya. Perbuatan itulah yang menjadi sebab penyesalan mereka di akhirat, penyesalan yang sama sekali tidak berguna. Dan mereka tidak akan keluar dari api neraka; mereka kekal dan abadi di dalamnya."
  }
]