[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berkatalah para pengikut, “aduhai kiranya ada kesempatan kembali bagi kami kepada kehidupan dunia, lalu kami mengumumkan sikap berlepas diri kami dari para pemimpin itu, sebagaimana mereka telah mengumumkan sikap berlepas diri mereka dari kami, dan sebagaimana Allah telah memperlihatkan kepada mereka dahsyatnya siksaan Nya pada hari kiamat, dia juga memperlihatkan kepada mereka perbuatan-perbuatan mereka yang batil sebagai sumber sumber penyesalan bagi mereka, dan mereka itu tidak akan keluar dari neraka selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167. Orang-orang lemah dan para pengikut itupun berkata, “Seandainya kami bisa kembali lagi ke dunia, lalu kami berlepas tangan dari para pemimpin kami, sebagaimana mereka berlepas tangan dari kami. Sebagaimana Allah memperlihatkan kepada mereka azab yang berat di akhirat, Allah juga akan memperlihatkan akibat dari tindakan mereka mengikuti para pemimpin dalam kebatilan. Mereka akan merasakan penyesalan dan kesedihan yang mendalam. Dan mereka tidak akan keluar dari neraka untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Allah mengabarkan bahwasannya orang-orang kafir akan tetap terhalangi dari amal meskipun mereka dikembalikan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "167. كَرَّةً (kembali (ke dunia) ) Yakni para pengikut itu berkata: duh celaka, andai saja kita dikembalikan ke dunia untuk beramal sholeh. حَسَرٰتٍ (sesalan) Yakni amalan-amalan buruk yang mereka lakukan Allah tunjukkan kepada mereka menjadi penyesalan-penyesalan. Sebagaimana amalan-amalan baik yang tidak mereka kerjakan yang Allah tunjukkan kepada mereka juga menjadi penyesalan-penyesalan. وَمَا هُم بِخٰرِجِينَ مِنَ النَّارِ (dan sekali-kali mereka tidak akan keluar dari api neraka) Dalam ayat ini terdapat dalil tentang kekekalan orang-orang kafir di dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "167. Para pengikut akan berkata: “Jika saja Kami bisa kembali ke dunia, jadi kami akan beramal shalih dan berlepas diri dari para pemimpin kafir yang memperdaya kami di sana, sebagaimana mereka berlepas diri dari kami di sini” Seperti itulah keadaan mereka ketika melihat azab. Allah memperlihatkan amal perbuatan mereka yang rusak yang telah diperbuat di dunia, sehingga mereka menyesal, dan tidak akan bisa keluar dari neraka karena mereka abadi di dalamnya akibat kesyirikan dan kecintaan mereka terhadap tandingan-tandingan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang mengikuti berkata, “Andaikan saja kami mendapat kesempatan kembali} kembali ke dunia {tentu kami akan berlepas tangan dari mereka sebagaimana mereka berlepas tangan dari kami.” Demikianlah Allah memperlihatkan kepada mereka amal perbuatan mereka sebagai penyesalan} penyesalan {bagi mereka. Mereka sungguh tidak akan keluar dari neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165-167. Alangkah tepatnya keterkaitan ayat-ayat ini dengan ayat sebelumnya, di mana setelah Allah menjelaskan keesaan-Nya dan dalil-dalil yang pasti di atas hal itu serta keterangan-keterangan tajam yang menyampaikan kepada keyakinan hati yang menghilangkan setiap keraguan, Allah menyebutkan dalam ayat ini bahwa “di antara manusia,” dengan adanya semua penjelasan yang sempurna itu, “ada orang-orang yang menyembah” sebagian dari makhluk-makhluk “sebagian tandingan-tandingan” bagi Allah, yakni para sekutu yang mereka samakan dengan Allah dalam ibadah, kecintaan, pengagungan, dan ketaatan. Dan orang yang dalam kondisi seperti ini setelah penegakan hujjah dan penjelasan tauhid dapat dipastikan bahwa ia adalah seseorang yang durhaka terhadap Allah, menentangNya, berpaling dari merenungi ayat-ayatNya, dan memikirkan makhluk-makhlukNya, maka ia tidak punya alasan sama sekali dalam hal itu, bahkan pantas ia mendapatkan siksaan. Orang-orang yang membuat tandingan-tandingan bagi Allah tersebut, tidaklah menyejajarkan mereka dengan Allah dalam hal mencipta, mengatur (alam), dan memberi rezeki, akan tetapi mereka menyamakannya dengan Allah dalam ibadah, hingga mereka menyembah tandingan-tandingan tersebut agar dapat mendekatkan mereka kepada Allah. Pada FirmanNya, “menjadikan” merupakan sebuah dalil bahwa Allah tidak memiliki tandingan, akan tetapi kaum musyrikin hanya menjadikan bagi Allah tandingan-tandingan dari beberapa makhluk hanya sebatas penamaan saja dan kata-kata yang tak berarti, sebagaimana Allah berfirman : \"Mereka menjadikan beberapa sekutu bagi Allah. Katakanlah: “Sebutkanlah sifat-sifat mereka itu”. Atau apakah kamu hendak memberitakan kepada Allah apa yang tidak diketahui-Nya di bumi, atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja.\" QS ar-ra’d ayat 33 \"Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya; Allah tidak menurunkan suatu keteranganpun untuk (menyembah)nya. Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan,\" QS an-najm ayat 23 Oleh karena itu, makhluk bukanlah tandingan bagi Allah, karena Allah adalah pencipta dan selainNya adalah makhluk, Rabb yang memberikan rezeki, adapun selainNya adalah yang diberi Rizki, Allah adalah Maha kaya sedangkan kalian adalah fakir, Dia Maha Sempurna dari segala aspeknya, sedang hamba serba kekurangan dalam segala aspeknya Allahlah yang memberikan manfaat dan madhorot, sedang makhluk tidak memiliki apa-apa dari manfaat, madhorot maupun urusan seperti itu. Maka sangatlah diketahui dengan yakin akan kebatilan perkataan orang-orang yang menjadikan dari selain Allah sebagai Tuhan Tuhan dan tandingan-tandingan, baik dari para malaikat, para nabi, orang-orang Shalih, patung ataupun yang lainnya, dan bahwasanya Allah lah yang berhak untuk dicintai secara penuh dan ditaati secara total. Oleh karena itu Allah memuji kaum mukminin dengan FirmanNya, “adapun orang-orang yang beriman sangat cinta kepada Allah,” maksudnya, daripada orang-orang yang membuat tandingan bagi Allah itu kepada tandingan-tandingan tersebut, karena mereka, kaum mukminin tulus dalam mencintai Allah, sedang mereka menyekutukan Allah dengan tandingan-tandingan tersebut, dan karena mereka (orang-orang beriman) mencintai dzat yang berhak untuk dicintai secara hakiki yang mana mencintaiNya adalah inti dari segala kebaikan seorang hamba, kebahagiaannya dan keselamatannya, sedang kaum musyrikin mencintai sesuatu yang sama sekali tidak pantas untuk diberikan cinta dan mencintainya adalah inti dari kesengsaraan seorang hamba, kerusakannya, dan kekacauan urusan dirinya. Oleh karena itu, Allah mengancam mereka dengan FirmanNya, “dan jika seandainya orang-orang yang berbuat zalim itu mengetahui” (akibat buruk) dari menjadikan tandingan tandingan bagi Allah dan tunduk kepada selain Robb seluruh makhluk, dan mereka berlaku zhalim terhadap hamba-hambaNya dari jalan Allah serta usaha mereka dalam memadhorotkan hamba-hambaNya dengan menghalangi mereka, “ketika mereka melihat siksa” yaitu pada hari kiamat secara jelas dengan mata mereka sendiri, “bahwa kekuatan itu kepunyaan Allah semua dan bahwa Allah amat berat siksaannya (niscaya mereka menyesal).” Maksudnya, mereka akan mengetahui secara benar dan yakin bahwa kekuatan dan kekuasaan hanya milik Allah semuanya dan bahwasanya tandingan-tandingan mereka itu tidak memiliki kekuatan sedikitpun, maka jelaslah bagi mereka pada saat itu kelemahan dan ketidakmampuannya, tidak seperti apa yang mereka duga saat di dunia, bahkan mereka berpikir bahwa tandingan-tandingan itu memiliki peran dalam hal itu, dan bahwa itu semua akan mendekatkan mereka kepada Allah, serta menyampaikan mereka kepadaNya. Maka sia-sialah dugaan mereka tersebut, hilanglah usaha mereka, dan patutlah mereka mendapat azab yang pedih, sedang tandingan-tandingan yang mereka buat itu tidak dapat menolong mereka, dan tidak dapat memberikan manfaat sedikitpun, bahkan mereka akan mendapatkan bahaya dari arah yang mulanya mereka sangka ada manfaatnya. Orang-orang yang diikuti itu berlepas diri dari mereka yang mengikutinya dan terputuslah hubungan yang terjalin diantara mereka saat mereka masih di dunia dahulu, sebab hubungan itu terjalin karena selain Allah, dan atas perintah selain Allah, serta berkaitan dengan perkara kebatilan yang tidak ada hakikatnya, yang akhirnya pupuslah amalan mereka, hancurlah kondisi mereka, dan jelaslah bahwa mereka itu adalah orang-orang yang dusta dan bahwasanya perbuatan-perbuatan mereka yang mereka harapkan manfaatnya dan hasilnya namun terbalik menjadi penyesalan dan kerugian, dan bahwa mereka kekal dalam neraka, tidak akan keluar darinya selamanya, maka Adakah kerugian kerugian seperti ini? Yang demikian itu karena mereka mengikuti kebatilan lalu mereka beramal dengan perbuatan yang batil pula. Mereka mengharapkan perkara yang tidak bisa diharapkan dan bergantung kepada sesuatu yang tidak ada gunanya bergantung padanya. Akhirnya batillah perbuatan-perbuatan mereka karena batilnya tempat mereka bergantung. Dan ketika perbuatan-perbuatan mereka batil, terjadilah kerugian dengan menyerapnya harapan dan malah membahayakan mereka dengan bahaya yang besar. Hal ini sangatlah berbeda jauh dengan orang yang bergantung hanya kepada Allah yang Maha memiliki kebenaran yang nyata, mengikhlaskan perbuatan hanya karenaNya dan mengharap manfaatnya. Orang yang seperti inilah yang telah meletakkan kebenaran pada tempatnya, dimana perbuatan-perbuatannya adalah benar karena bergantung kepada yang benar, hingga dia berhasil mendapatkan buah dari perbuatannya dan merasakan balasannya pada sisi robbnya tanpa terputus, sebagaimana Allah berfirman : \"Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka. Dan orang-orang mukmin dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka. Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.\" QS Muhammad ayat 1-3 Di saat itu orang-orang yang mengikuti, akan berangan-angan agar dikembalikan lagi ke dunia hingga mereka bisa berlepas diri dari makhluk-makhluk yang mereka ikuti tersebut yaitu dengan meninggalkan kesirikan terhadap Allah dan kembali beramal dengan ikhlas hanya karena Allah semata. Namun itu sangatlah mustahil dan telah pupuslah harapan, karena saat itu bukanlah lagi masa penangguhan dan penundaan. Walaupun demikian juga mereka itu adalah orang-orang yang dusta, karena bila pun mereka dikembalikan ke dunia, pastilah mereka akan kembali kepada hal yang telah dilarang bagi mereka, dan apa yang mereka katakan itu hanyalah sebatas angan-angan belaka yang mereka angan-angan kan dengan rasa jengkel dan marah terhadap orang-orang yang mereka ikuti tersebut ketika berlepas diri dari mereka dan dosa yang telah nyata itu adalah dosa mereka sendiri. Dan pemimpin dari tandingan-tandingan yang diikuti dalam kejahatan itu adalah iblis. Walaupun demikian ia berkata kepada para pengikutnya : \"tatkala perkara (hisab) telah diselesaikan: “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri.\" QS Ibrahim ayat 22"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { كَرَّةٗ } Karroh : Kembali ke dalam kehidupan dunia. { الحَسَرَٰتٍ } al-Hasaraat : Bentuk jamak dari hasrah, yang artinya adalah penyesalan yang mendalam sehingga tidak bisa berbuat apa-apa. Makna ayat: Kemudian para pengikut itu berandai-andai agar bisa kembali ke dalam kehidupan dunia, untuk membalas para pemimpin sesat itu dengan berlepas diri dari mereka di dunia, sebagaimana para pemimpin sesat berlepas diri dari mereka di akhirat. Sebagaimana Allah menampakkan adzab yang pedih di hadapan mereka, juga memperlihatkan amalan mereka yang buruk berupa kesyirikan dan dosa maksiat, sehingga bertambah dalamlah penyesalan dan kepedihan yang mereka rasakan sampai mereka masuk ke dalam neraka, dan mereka tidak akan keluar dari neraka selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 167: Baik berlepas diri dari diri mereka (para pemimpin) maupun sesembahan yang mereka sembah selain Allah, dan mereka akan beribadah kepada Allah saja. ketika itu, orang-orang yang mengikuti berangan-angan agar kembali ke dunia, lalu mereka berlepas tangan dengan orang yang mereka ikuti, seperti tidak mau mengikuti syirk yang dilakukan mereka, mengikhlaskan amalan karena Allah, namun hal itu mustahil, saat itu bukanlah waktu pemberian tangguh, di samping itu mereka juga berdusta dalam pernyataan ini. Kalau pun mereka dikembalikan ke dunia, mereka akan mengulangi perbuatan yang dahulu mereka dilarang melakukannya. Permintaan mereka hanyalah ucapan dan angan-angan semata karena marah dan kesal kepada orang-orang yang mereka ikuti. Tokoh utama yang mereka ikuti dalam keburukan adalah Iblis, namun Iblis tidak mau bertanggung jawab, bahkan menurutnya bahwa dirinya tidak berkuasa apa-apa selain hanya bisa mengajak sehingga menurutnya ia tidak bisa disalahkan (lihat surat Ibrahim: 22). Kemudian tokoh-tokoh yang mereka ikuti dalam keburukan lainnya yang juga sama tidak mau bertanggung jawab, ketika itu terjadi laknat melaknat, masing-masing mendo'akan keburukan kepada yang lain dan menampakkan kekecewaan (lihat surat Al A'raaf: 38-39)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 167",
    "description": "Dan karena dahsyatnya siksa Allah yang mereka saksikan, orangorang yang mengikuti berkhayal dan berkata, sekiranya kami mendapat kesempatan kembali ke dunia, tentu kami akan berlepas tangan dari mereka; kami tidak akan mengikuti mereka sebagaimana pada hari ini mereka berlepas tangan dari kami dan tidak bertanggung jawab atas ajakan dan tipu daya mereka kepada kami. Demikianlah Allah memperlihatkan kepada mereka seluruh amal perbuatan mereka, membiarkan mereka larut di dalamnya. Perbuatan itulah yang menjadi sebab penyesalan mereka di akhirat, penyesalan yang sama sekali tidak berguna. Dan mereka tidak akan keluar dari api neraka; mereka kekal dan abadi di dalamnya. Wahai manusia! makanlah dari makanan yang halal, yaitu yang tidak haram, baik zatnya maupun cara memperolehnya. Dan selain halal, makanan juga harus yang baik, yaitu yang sehat, aman, dan tidak berlebihan. Makanan dimaksud adalah yang terdapat di bumi yang diciptakan Allah untuk seluruh umat manusia, dan janganlah kamu mengikuti langkah-langkah setan yang selalu merayu manusia agar memenuhi kebutuhan jasmaninya walaupun dengan cara yang tidak sesuai dengan ketentuan Allah. Waspadailah usaha setan yang selalu berusaha menjerumuskan manusia dengan segala tipu dayanya. Allah mengingatkan bahwa sungguh setan itu musuh yang nyata bagimu, wahai manusia."
  }
]