[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia Makanlah dari rizki Allah yang Dia halalkan bagi kalian yang terdapat di bumi, dalam keadaan bersih dan bukan najis, yang bermanfaat dan tidak memadorotkan, dan janganlah kalian mengikuti jalan-jalan setan dalam penetapan halal dan haram, bid’ah serta maksiat-maksiat. Sesungguhnya ia adalah musuh kalian yang amat nyata permusuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "168. Wahai manusia, makanlah dari apa yang ada di bumi, baik dari hewan, tumbuh-tumbuhan maupun pohon-pohonan yang diperoleh dengan cara yang halal dan memiliki kandungan yang baik, tidak jorok. Dan janganlah kalian mengikuti jalan setan yang menggoda kalian secara bertahap. Sesungguhnya setan itu adalah musuh yang nyata bagi kalian. Dan orang yang berakal sehat tidak boleh mengikuti musuhnya yang selalu berusaha keras untuk mencelakakan dan menyesatkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "168-169. Allah berfirman kepada seluruh manusia: \"Makanlah dari rezeki Allah yang halal, lezat, dan bersih; dan janganlah kalian mengikuti jalan-jalan setan, karena ia adalah musuh kalian yang nyata. Bukti dari permusuhannya terhadap kalian adalah ia memerintahkan kalian untuk melakukan kemaksiatan dan dosa-dosa besar dan membuat kedustaan terhadap Allah dengan mengharamkan yang Dia halalkan dan menghalalkan yang Dia haramkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "168. كُلُوا۟ مِمَّا فِى الْأَرْض (makanlah dari apa yang terdapat di bumi) Ayat ini diturunkan untuk Bani Tsaqif, Khuza’ah, dan Mudlij yang mengharamkan atas diri mereka hewan-hewan ternak. حَلٰلًا طيباً (yang halal lagi baik) Yakni selain yang diharamkan oleh Allah atas kalian, adapun kata Thayyib berarti yang dinikmati. وَلَا تَتَّبِعُوا۟ خُطُوٰتِ الشَّيْطٰنِ ۚ (dan janganlah kamu mengikuti langkah-langkah syaitan) Yakni janganlah kalian berdiri dibelakang syaitan dan perbuatannya berupa mengharamkan sesuatu yang belum dijelaskan keharamannya oleh syari’at dan melakukan perbuatan maksiat. عَدُوٌّ مُّبِينٌ (musuh yang nyata bagimu) Yakni dengan permusuhan yang jelas."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Pada firman Allah : { يَا أَيُّهَا النَّاسُ كُلُوا مِمَّا فِي الْأَرْضِ حَلَالًا طَيِّبًا وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ } adalah isyarat adanya peran syaithon dalam memelingkan manusia dari makanan halal dan baik, dan isyarat bahwa makanan yang halal dan baik adalah syarat diterimanya doa, maka berapa banyak kejahatan syaithon terhadap manusia untuk mengantarkan mereka untuk memakan makanan yang haram ? 2 ). Langkah pertama ! { وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ } permulaan semua perbuatan adalah ide dan fikiran; karena sesungguhnya itulah yang akan menghantarkan manusia kepada bayangan-bayangan perbuatan, dan bayangan-bayangan itu akan membawa kepada keinginan, dan keinginan itu selalu menjadi penyebab terjadinya perbuatan, dan ketika hal ini terus berulang maka ia akan menjadi kebiasaan, oleh karena itu baiknya setiap langkah-langkah ini ditentukan oleh baiknya langkah pertama yaitu ide dan fikiran, dan rusaknya langkah-langkah ini ditentun oleh rusaknya langkah pertama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "168. Wahai manusia, makanlah sesuatu yang diciptakan oleh Allah untuk kalian di bumi yang diperbolehkan dan bisa kalian nikmati, dan janganlah mengikuti jalannya setan yang mengajak menuju kemaksiataan, menghalalkan yang haram dan mengharamkan yang halal. Sesungguhnya setan itu adalah musuh yang nyata bagi kalian. Al-Kalbiy berkata: “Ayat ini turun untuk Tsaqif, Khuza’ah dan Amir bin Sha’sha’ah yang mengharamkan atas diri mereka sendiri beberapa hal, yaitu hasil panen dan hewan ternak. Mereka juga mengharamkan unta Bahirah, Shaibah, Washilah, dan Ham”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, makanlah sebagian (makanan) di bumi yang halal lagi baik dan janganlah mengikuti langkah-langkah} jalan {setan. Sesungguhnya dia bagi kalian merupakan musuh yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168. Ayat ini dialamatkan kepada seluruh manusia, baik yang Mukmin maupun yang kafir. Allah telah memberikan karunia kepada mereka dengan memerintahkan kepada mereka untuk makan dari seluruh yang ada di bumi seperti biji-bijian, hasil tanaman, buah-buahan, dan hewan dalam keadaan “yang halal,” yaitu yang telah dihalalkan buat kalian untuk dikonsumsi, yang bukan dari rampasan maupun curian, bukan pula diperoleh dari hasil transaksi bisnis yang diharamkan, atau dalam bentuk yang diharamkan, atau dalam hal yang membawa kepada yang diharamkan, “lagi baik,” maksudnya, bukan yang kotor seperti bangkai, darah, daging babi, dan seluruh hal-hal yang kotor dan jorok. Di dalam Ayat ini terdapat Dalil yang menunjukkan bahwa asalnya seluruh benda yang ada itu adalah boleh, hukumnya baik untuk dimakan maupun dimanfaatkan, dan bahwa hal-hal yang diharamkan darinya itu ada dua macam; pertama, yang diharamkan karena dzatnya yaitu yang kotor yang merupakan lawan dari yang baik (Thayyib), kedua, diharamkan karena dikaitkan dengan sesuatu, yaitu yang diharamkan karena bersangkutan dengan hak-hak Allah atau hak-hak manusia, yaitu yang merupakan lawan dari yang halal. Ayat ini juga sebagai dalil bahwa makanan dengan kadar untuk memenuhi Fitrah adalah wajib, dan akan berdosa orang yang meninggalkannya dengan dasar makna perintah yang jelas dari ayat tersebut. Lalu ketika Dia memerintahkan untuk mengikuti apa yang telah diperintahkan kepada-nya yang merupakan inti dari kemaslahatan mereka, maka Dia melarang mereka untuk mengikuti, “langkah-langkah setan,” Maksudnya jalan-jalan yang ia perintahkan, yaitu seluruh kemaksiatan, baik kekufuran, kefasikan, dan kezhaliman, dan termasuk dalam hal itu juga adalah pengharaman unta yang diharamkan oleh kaum jahiliyah untuk mereka, demikian juga sebaliknya menikmati makanan makanan yang diharamkan. “Sesungguhnya setan itu adalah musuh yang nyata bagimu.” Maksud dari permusuhan itu adalah tidaklah ia memerintah kalian kecuali untuk mencurangi kalian dan Agar kalian menjadi penghuni penghuni neraka. Rabb kita tidak hanya cukup dengan melarang mengikuti langkah-langkah setan, hingga Dia mengabarkan, dan Dia adalah yang paling benar perkataanNya tentang permusuhannya yang harus diwaspadai, kemudian Allah juga tidak cukup sampai disitu saja, Dia mengabarkan tentang perincian perkara yang menjadi target setan dalam godaannya, dan bahwasanya hal itu adalah perkara yang paling buruk dan paling besar kerusakannya, Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الحلال } al-Halal : Segala sesuatu yang tidak membahayakan, dan itu adalah segala sesuatu yang Allah izinkan untuk dimanfaatkan. { الطيب } ath-Thayyib : Sesuatu yang suci, tidak najis, dan tidak menjijikkan yang tidak disukai oleh jiwa. { خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ } Khutuwatish syaithan : al-Khutuwat merupakan bentuk jamak dari khutwah yang berarti jarak antara dua kaki ketika berjalan. Namun yang dimaksud adalah langkah-langkah dan jalan setan yang mengantarkan seorang hamba mengharamkan apa yang Allah halalkan, dan menghalalkan apa yang Allah haramkan. { عَدُوّٞ مُّبِينٌ } ‘Aduwwun mubin : Permusuhan setan sangat jelas. Bagaimana tidak, dialah yang mengeluarkan nenek moyang manusia, Adam dan Hawa dari surga. Dan kebanyakan keburukan dan kerusakan di dunia disebabkan oleh was-was dan gangguan setan. Makna ayat : Setelah pemaparan mengenai keadaan orang-orang yang berbuat kesyirikan, maksiat, dan akhir yang mereka dapatkan berupa kekal dalam adzab neraka, Allah Ta’ala yang memiliki kasih sayang meliputi seluruh manusia berfirman (يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ مِمَّا فِي ٱلۡأَرۡضِ ) “Wahai sekalian manusia makanlah yang halal lagi baik dari apa yang terdapat di bumi.” Yaitu pemberian dari Allah yang halal, baik, dan diizinkan oleh-Nya. Adapun yang tidak diizinkan oleh Allah maka tidak ada kebaikan ketika dimakan, bahkan akan merusak jasmani dan rohaninya. Kemudian Allah melarang manusia agar tidak mengikuti langkah musuhNya dan musuh manusia, yaitu setan. Karena jika mereka mengikuti langkah setan akan mengantarkan menuju kesengsaraan dan kebinasaan. Pelajaran dari ayat : • Kewajiban untuk mencari yang halal dan mencukupkan diri dengan hidup dari yang halal walaupun hanya sedikit. • Halal adalah apa yang Allah halalkan, dan haram adalah apa yang Allah haramkan. Sementara akal tidak dapat menentukan halal dan haram sendiri. • Keharaman mengikuti langkah-langkah setan, yaitu setiap ideologi, perkatan, dan perbuatan yang dilarang oleh Allah. • Kewajiban untuk menjauhi setiap keburukan dan hal yang keji, karena keduanya merupakan perintah setan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 168: Allah berfirman kepada seluruh manusia baik yang mukmin maupun yang kafir untuk memerintah mereka agar memakan makanan yang dibolehkan di bumi dan meperingatkan mereka menempuh jalan syetan dalam halal dan haram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Halal di sini mencakup halal memperolehnya, seperti tidak dengan cara merampas dan mencuri, demikian juga tidak dengan mu'amalah yang haram atau cara yang haram dan tidak membantu perkara yang haram. Yaitu yang suci tidak bernajis, bermanfa'at dan tidak membahayakan. Ada yang mengartikan thayyib di ayat ini dengan \"tidak kotor\" seperti halnya bangkai, darah, daging babi dan segala yang kotor lainnya. Dari ayat tersebut dapat kita ketahui bahwa yang haram itu ada dua: yang haram zatnya dan yang haram karena ada sebab luar, seperti karena terkait dengan hak Allah atau hak hamba-Nya. Demikian juga bahwa hukum makan agar dapat melangsungkan kehidupan adalah wajib. Seperti menghalalkan dan mengharamkan dari diri sendiri, segala nadzar maksiat, melakukan bid'ah dan kemaksiatan. Termasuk juga mengkonsumsi barang-barang haram. Qatadah dan As Suddiy berpendapat bahwa semua kemaksiatan kepada Allah termasuk mengikuti langkah-langkah setan. Maksudnya: setan adalah musuh yang jelas bagi kita. Oleh karenanya, tidak ada yang diinginkannya selain menipu kita dan mencelakakan kita. Di ayat ini, Allah Subhaanahu wa Ta'aala tidak cukup menyebutkan \"jangan mengikuti langkah-langkah setan\" tetapi menerangkan bahwa dia adalah musuh yang nyata bagi kita, dan tidak sampai di situ, Dia menerangkan lebih rinci apa yang diserukan setan, yaitu menyuruh berbuat jahat dan keji seperti yang disebutkan pada ayat ssetelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 168",
    "description": "Wahai manusia! makanlah dari makanan yang halal, yaitu yang tidak haram, baik zatnya maupun cara memperolehnya. Dan selain halal, makanan juga harus yang baik, yaitu yang sehat, aman, dan tidak berlebihan. Makanan dimaksud adalah yang terdapat di bumi yang diciptakan Allah untuk seluruh umat manusia, dan janganlah kamu mengikuti langkah-langkah setan yang selalu merayu manusia agar memenuhi kebutuhan jasmaninya walaupun dengan cara yang tidak sesuai dengan ketentuan Allah. Waspadailah usaha setan yang selalu berusaha menjerumuskan manusia dengan segala tipu dayanya. Allah mengingatkan bahwa sungguh setan itu musuh yang nyata bagimu, wahai manusia. Sebagai musuh manusia, sesungguhnya setan itu hanya menyuruh kamu agar berbuat jahat, yaitu perbuatan yang mengotori jiwa dan berakibat buruk terhadap kehidupan meskipun tanpa sanksi hukum duniawi, seperti menyakiti sesama, menebar permusuhan, merusak persatuan dengan cara mengadu domba dan menyebar kebohongan, berhati dengki, angkuh dan sombong, dan setan juga menyuruh manusia berbuat keji, yaitu perbuatan yang tidak sejalan dengan tuntunan agama dan akal sehat, khususnya yang telah ditetapkan sanksi duniawinya, seperti zina dan pembunuhan, dan setan juga membisikkan agar kamu mengatakan apa yang tidak kamu ketahui tentang Allah dengan mengatakan bahwa Allah punya istri dan punya anak, padahal Allah mahasuci dari hal tersebut."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Dalam ayat sebelumnya Allah ta’ala telah menjelaskan bahwasanya tiada sembahan yang hak kecuali Dia dan bahwasanya Dia sendiri yang menciptakan seluruh makhluk dan memberi mereka rezeki. Dalam hal pemberian nikmat, Dia menyebutkan bahwa Dia telah membolehkan manusia untuk memakan segala yang ada di muka bumi, yaitu makan yang halal, baik, dan bermanfaat bagi dirinya serta tidak membahayakan bagi tubuh dan akal pikiran. Dan Dia juga melarang mereka mengikuti langkah-langkah syetan, dalam tindakan-tindakannya yang menyesatkan para pengikutnya, seperti mengharamkan bahirah, saibah, washilah, dan lain-lainnya yang ditanamkan syaitan kepada mereka pada masa jahiliyah. Sebagaimana yang dijelaskan dalam sebuah hadits yang terdapat dalam kitab Shohih Muslim yang diriwayatkan dari Iyadh bin Hamad, dari Rosululloh sholallohu ‘alaihi wasallam : يقول الله تعالى : إن كل ما أمنحه عبادي فهو لهم حلال \" وفيه :\" وإني خلقت عبادي حنفاء فجاءتهم الشياطين فاجتالتهم عن دينهم ، وحرمت عليهم ما أحللت لهم “Allah ta’ala berfirman, “sesungguhnya setiap harta yang Aku anugrahkan kepada hamba-hamba-Ku adalah halal bagi mereka” selanjutnya disebutkan “Dan Aku pun menjadikan hamba-hamaba-Ku di jalan yang lurus, lalu datang syaitan kepada mereka dan menyesatkan mereka dari agama mereka serta mengharamkan atas mereka yang telah Aku halalkan bagi mereka” (HR. MUSLIM) Al-hafidz Abu Bakar bun Mardawaih telah berkata dari Ibnu Abbas beliau berkata : ليت هذه الآية عند النبي صلى الله عليه وسلم : ( ياأيها الناس كلوا مما في الأرض حلالا طيبا ) فقام سعد بن أبي وقاص ، فقال : يا رسول الله ، ادع الله أن يجعلني مستجاب الدعوة ، فقال . \" يا سعد ، أطب مطعمك تكن مستجاب الدعوة ، والذي نفس محمد بيده ، إن الرجل ليقذف اللقمة الحرام في جوفه ما يتقبل منه أربعين يوما ، وأيما عبد نبت لحمه من السحت والربا فالنار أولى به Aku membacakan ayat ini di sisi nabi sholallohu ‘alaihi wasallam, “wahai orang-orang yang beriman makanlah oleh kalian apa yang ada dari bumi ini yang halal lagi baik”. Maka berdirilah Sa’ad bin Abi Waqosh lalu dia berkata, “wahai Rosululloh, berdo’alah kepada Allah agar menjadikanku seorang yang diijabah do’anya”. Maka Belia menjawab, “wahai sa’ad, perbaguslah makananmu maka akan diijabah do’amu. Demi Dzat yang jiwa Muhammad ada di tangan-Nya, sesungguhnya seseorang yang memasukan satu suapan yang haram kedalam perutnya, kecuali tidak akan diterima darinya empat puluh hari. Dan siapapun hamba yang dagingnya tumbuh dari harta yang kotor dan riba, maka neraka lebih utama untuknya”. Firman-Nya : وَلَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ “dan janganlah kamu mengikuti langkah-langkah syaitan” Qotadah dan as-Suddi mengatakan, “setiap perbuatan maksiat kepada Allah adalah termasuk langkah syaitan” Ikrimah mengemukakan, “yaitu bisikan-bisikan syaitan” Abu Majlaz berkata “yaitu setiap Nazar dalam kemaksiatan”. As-Sya’bi menuturkan, “ada seseorang yang bernazar akan berkorban dengan menyembelih anaknya, lalu Masruq memberinya fatwa agar menyembelih kambing, dan ia berpendapat bahwa yang demikian itu termasuk salah satu langkah syaitan.” Dan masih banyak riwayat yang menjelaskan mengenai rincian macam-macam langkah syaitan. Sebagaimana firman-Nya : إِنَّمَا يَأْمُرُكُمْ بِالسُّوءِ وَالْفَحْشَاءِ وَأَنْ تَقُولُوا عَلَى اللَّهِ مَا لَا تَعْلَمُونَ “Sesungguhnya syaitan itu hanya menyuruh kamu berbuat jahat dan keji, dan mengatakan terhadap Allah apa yang tidak kamu ketahui.” (QS. Al-Baqoroh : 169) Selanjutnya Allah menegaskan bahwa syaitan itu musuh yang nyata bagi manusia, firman-Nya : إِنَّ الشَّيْطَانَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا إِنَّمَا يَدْعُو حِزْبَهُ لِيَكُونُوا مِنْ أَصْحَابِ السَّعِيرِ “Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu), karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala” (QS. Faathir: 6) Dan firman-Nya : أَفَتَتَّخِذُونَهُ وَذُرِّيَّتَهُ أَوْلِيَاءَ مِنْ دُونِي وَهُمْ لَكُمْ عَدُوٌّ بِئْسَ لِلظَّالِمِينَ بَدَلًا “Patutkah kamu mengambil dia dan turanan-turunannya sebagai pemimpin selain daripada-Ku, sedang mereka adalah musuhmu? Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim.” (QS. Al-Kahfi : 50) Maka orang yang berakal wajiblah baginya untuk menjadikan syaiatan sebagai musuhnya, dengan tidak mengikuti apa yang disarankannya. Karena tidak mungkin ada seorang musuh yang menunjukan kepada jalan keselamatan. Sejatinya seorang musuh pasti berniat dan menginginkan kehancuran kepada musuhnya. Terlebih lagi syaitan yang sudah jelas menyatakan permusuhan kepada anak cucu adam, dan mereka berjanji akan menyesatkannya dari jalan Allah ta’ala."
  }
]