[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya setan hanyalah memerintahkan kalian untuk melakukan seluruh jenis dosa yang jelek yang akan berakibat buruk bagi kalian, dan berbuat maksiat yang mengandung keburukan yang paling parah, dan memerintahkan kalian untuk mengada-ngada kebohongan terhadap Allah berupa tindakan mengharamkan perkara halal dan lainnya tanpa ada pengetahuan yang benar"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "169. Karena sesungguhnya setan itu senantiasa menyuruh kalian melakukan perbuatan buruk, dosa besar dan mendorong kalian untuk berbicara tentang masalah akidah dan syariah tanpa ilmu yang bersumber dari Allah atau dari para Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. إِنَّمَا يَأْمُرُكُم بِالسُّوٓءِ وَالْفَحْشَآءِ (Sesungguhnya syaitan itu hanya menyuruh kamu berbuat jahat dan keji) (السوء) yakni kejelekan dan (الفحشاء) yakni kejelekan yang melampaui batas, dan pendapat lain mengatakan: yakni zina. وَأَن تَقُولُوا۟ عَلَى اللَّـهِ مَا لَا تَعْلَمُونَ (dan mengatakan terhadap Allah apa yang tidak kamu ketahui) Yakni yang mereka haramkan seperti ‘bahirah’, ‘saibah’, dan lain sebagainya yang mereka jadikan sebagai syari’at. Padahal segala yang ada di bumi ini yang tidak ada dalil yang mengharamkannya maka hukum asalnya adalah halal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169. Sesungguhnya setan itu memerintahkan kalian untuk berbuat buruk, melakukan setiap kemasiatan yang bisa semakin memperburuk konsekuensi dari tindakan itu. memerintahkan perbuatn keji, yaitu seburuk-buruk kemaksiatan, seperti zina, membunuh dan perbuatan lain yang termasuk dalam dosa-dosa besar, serta membuat kalian menghalalkan yang haram dan mengharamkan yang halal, yaitu unta bahirah, shaibah dan hewan lainnya yang telah kami buatkan aturannya untuk kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya setan hanya menyuruh kalian untuk berbuat jahat} dosa yang memperburuk pelakunya {dan keji} dosa-dosa yang buruk {serta mengatakan apa yang tidak kalian ketahui tentang Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "169. “Sesungguhnya setan itu hanya menyuruh kamu berbuat jahat”, yaitu keburukan yang merusak pelakunya. Dengan demikian, termasuk dalam hal itu adalah seluruh kemaksiatan, sehingga firmanNya, “dan keji,” dalam bentuk menyambung yang khusus kepada yang umum, karena perbuatan yang keji itu termasuk kemaksiatan yang sangat besar keburukannya seperti perzinaan, peminum khamar, pembunuhan, menuduh orang orang baik-baik berbuat zina, kebakhilan, dan lain sebagainya dari hal-hal yang dianggap suci oleh orang yang berakal. “Dan mengatakan terhadap Allah apa yang tidak kamu ketahui.” Termasuk dalam hal ini adalah mengatakan sesuatu terhadap Allah dengan tanpa dasar ilmu dalam syariat dan ketentuanNya. Maka, barangsiapa menyifati Allah dengan selain dari sifat-sifat yang Dia tetapkan untuk diriNya, atau ditetapkan oleh Rasul untuk diriNya, atau menafikan sifat-sifat yang telah Dia sifatkan untuk diriNya, atau menetapkan sifat-sifat yang telah Dia nafikan dari dirinNya, maka sesungguhnya ia telah mengatakan terhadap Allah dengan tanpa dasar ilmu. Barang siapa yang menyangka bahwa Allah memiliki tandingan-tandingan dan patung-patung yang akan mendekatkan orang-orang yang menyembah hanya kepada Allah, Sesungguhnya ia telah mengatakan terhadap Allah dengan tanpa dasar ilmu. Barangsiapa yang berkata; Sesungguhnya Allah telah menghalalkan ini, atau mengharamkan yang itu, atau memerintahkan kepada ini, atau melarang dari yang itu tanpa ilmu (padahal tidak demikian), maka sesungguhnya ia telah mengatakan terhadap Allah dengan tanpa dasar ilmu, dan barangsiapa yang berkata, bahwa sesungguhnya Allah telah menciptakan kelompok tersebut dari makhluk karena maksud kepentingan si Fulan tanpa keterangan yang jelas tentang hal itu, sesungguhnya ia juga telah mengatakan terhadap Allah dengan tanpa dasar ilmu. Dan diantara hal yang paling besar dalam mengatakan terhadap Allah tanpa dasar ilmu adalah, seorang mentakwilkan firman Allah atau sabda Rasulullah terhadap beberapa arti yang dijadikan sebagai makna istilah bagi sekelompok orang dari kelompok-kelompok yang sesaat kemudian ia berkata bahwa Allah menghendaki makna tersebut. Oleh karena itu, mengatakan terhadap Allah dengan tanpa dasar ilmu adalah termasuk dosa yang paling besar dan paling menyeluruh keharamannya, dan jalan setan yang paling jitu yang diserukan kepadanya. Inilah jalan-jalan setan dan bala tentaranya yang menjadi sasaran seruannya. Mereka berusaha mengarahkan segala makar dan tipu daya mereka dalam memperdayai makhluk terhadap apa yang telah ditetapkan atasnya. Adapun Allah, sesungguhnya Dia memerintahkan kepada keadilan, kebajikan, memberi nafkah sanak famili, dan melarang dari kekejian, kemungkaran, dan kesewenang-wenangan. Oleh karena itu, seorang hamba perlu memperhatikan, seruan dan kelompok mana yang ia pilih? Apakah engkau akan mengikuti seruaan Allah yang hanya menghendaki kebaikan dan kebahagiaan dunia dan akhirat bagimu, dimana segala keberhasilan adalah dengan menaatinya, seluruh kemenangan adalah dalam melayaniNya, dan semua keuntungan adalah dalam bermuamalah terhadap dzat yang memberi rizki dengan rezeki rezeki yang lahir maupun yang batin, dzat yang tidak memerintahkan kecuali kepada kebaikan tidak melarang kecuali kepada dari kejahatan? ataukah engkau mengikuti seruan setan yang merupakan musuh dari manusia yang hanya menghendaki keburukan bagimu, yang berusaha dengan segala upaya dalam menghancurkan dirimu di dunia maupun di akhirat, dimana segala keburukan adalah dalam menaatinya, dan segala kerugian adalah dalam sikap loyal terhadap nya, yang tidak memerintah kecuali pada keburukan yang tidak melarang kecuali pada kebaikan? Kemudian Allah mengabarkan tentang kondisi orang-orang musyrik apabila mereka diperintahkan untuk mengikuti apa yang telah diturunkan oleh Allah terhadap Rasul Nya dari penjelasan yang telah berlalu, niscaya mereka akan membenci hal itu dan mereka akan berkata,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { السُّوٓءِ } as-Suu’ : Segala sesuatu yang buruk bagi jiwa dan menyebabkan rasa sedih dan gundah, termasuk di dalamnya seluruh dosa. { ٱلۡفَحۡشَآءِ } al-Fahsyaa’ : Setiap perbuatan buruk seperti zina, liwath (homo sexual), kikir, dan segala macam maksiat yang merupakan keburukan yang berat. Makna ayat: Allah memberitahukan bahwa setan hanya akan memerintahkan kepada hal yang membahayakan bagi jasmani dan rohani mereka. As-Suu’ adalah setiap yang buruk bagi jiwa, dan al-Fahsyaa’ adalah perbuatan keji dan akhlak yang buruk, dan yang paling parah dari itu semua adalah setan memerintahkan mereka untuk berdusta atas nama Allah, dengan mengatakan atas nama Allah apa yang tidak mereka ketahui, sehingga mengharamkan dan menghalalkan serta mensyariatkan sesuatu dengan berlindung di balik nama Allah. Sedangkan Allah Ta’ala berlepas diri dari itu semua, dan ini merupakan bencana besar wal’iyadzubillah. Sampai mereka berpaling dari bimbingan Allah dan mengikuti langkah-langkah setan yang merupakan musuh mereka, dan melakukan perbuatan buruk dan keji serta menghalalkan, mengharamkan, dan mensyariatkan sesuatu yang tidak diizinkan oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 169: Allah menjelaskan bahwasannya syetan memerintahkan manusia untuk melakukan setiap dosa dan maksiat. Dan berbohong atas nama Allah dalam halal dan haram tanpa ilmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mencakup semua maksiat. Yaitu maksiat yang dianggap jelek sekali oleh syara', uruf (kebiasaan yang berlaku) maupun akal baik berupa perkataan maupun perbuatan. Contoh: zina, meminum khamr, membunuh, menuduh zina, dsb. Ada juga yang berpendapat bahwa \"as suuu'\" (jahat) adalah kemaksiatan yang tidak ada hadnya, sedangkan \"al fahsyaa'\" (keji) adalah kemaksiatan yang ada hadnya. Termasuk mengatakan tentang Allah tanpa ilmu adalah: - Berkata tentang syari'at Allah tanpa ilmu (dasar dalil). - Berkata tentang taqdir Allah tanpa ilmu, padahal taqdir-Nya masih tersembunyi. - Menyifati Allah tanpa dalil. - Mengatakan bahwa Allah punya tandingan. - Mengatakan bahwa Allah menghalalkan barang ini, mengharamkan barang itu atau memerintahkan hal ini dan melarang hal itu, ia menyatakan semua itu tanpa dalil. - Menafsirkan firman Allah dengan tafsir batil atau sesuai hawa nafsunya, lalu ia mengatakan \"inilah maksud firman Allah ini\". - Dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 169",
    "description": "Sebagai musuh manusia, sesungguhnya setan itu hanya menyuruh kamu agar berbuat jahat, yaitu perbuatan yang mengotori jiwa dan berakibat buruk terhadap kehidupan meskipun tanpa sanksi hukum duniawi, seperti menyakiti sesama, menebar permusuhan, merusak persatuan dengan cara mengadu domba dan menyebar kebohongan, berhati dengki, angkuh dan sombong, dan setan juga menyuruh manusia berbuat keji, yaitu perbuatan yang tidak sejalan dengan tuntunan agama dan akal sehat, khususnya yang telah ditetapkan sanksi duniawinya, seperti zina dan pembunuhan, dan setan juga membisikkan agar kamu mengatakan apa yang tidak kamu ketahui tentang Allah dengan mengatakan bahwa Allah punya istri dan punya anak, padahal Allah mahasuci dari hal tersebut dan apabila dikatakan kepada mereka, yaitu orang-orang musyrik, ikutilah apa yang telah diturunkan Allah kepada para nabi yaitu tuntunan mengenai kebenaran, mereka menolak nasihat tersebut dan mereka menjawab, tidak! kami tidak mau mengikuti nasihat itu, karena cukup bagi kami mengikuti apa yang kami dapati pada nenek moyang kami. Mereka mengatakan hal ini karena ingin melestarikan tradisi yang dilakukan nenek moyang mereka, antara lain menyembah berhala, meminum minuman keras, dan perilaku tidak terpuji lainnya. Padahal, nenek moyang mereka itu tidak mengetahui apa pun tentang tradisi yang dijalankan selain juga mengikuti nenek moyang sebelumnya, dan mereka tidak mendapat petunjuk dasar-dasar kebenaran tradisi tersebut."
  }
]