[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kondisi orang-orang munafik yang beriman secara lahiriyah saja dan tidak secara batiniah terhadap Risalah Nabi Muhammad Shallallahu Alaihi Wasallam, kemudian mereka kafir, maka hal itu menyebabkan mereka berjalan tanpa arah dalam gelapnya kesesatan mereka sedang mereka tidak menyadarinya, dan tidak ada harapan bagi mereka untuk keluar dari kondisi tersebut, menyerupai kondisi sekelompok orang disaat malam gelap gulita. Kemudian salah seorang dari mereka menyalakan api yang besar untuk penghangat badan dan penerangan, ketika api itu telah memancarkan cahaya dengan terang dan menerangi tempat sekitarnya tiba-tiba Api itu padam dan keadaan menjadi gelap gulita, maka orang-orang itu berada dalam kegelapan tanpa bisa melihat apapun dan tidak memperoleh petunjuk menuju suatu arah maupun jalan keluar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Allah membuat dua perumpamaan untuk orang-orang munafik itu, yaitu perumpamaan api dan perumpamaan air. Perumpamaan api maksudnya ialah mereka itu seperti orang yang menyalakan api untuk menerangi sekelilingnya. Setelah api menyala dan ia mengira akan mendapatkan manfaat dari sinarnya, tiba-tiba api itu padam, cahayanya pun lenyap, dan yang tersisa hanyalah bekas pembakarannya. Sehingga orang-orang yang ada di sekitarnya berada di dalam kegelapan, tidak bisa melihat apa-apa dan tidak mengetahui jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Keadaan orang-orang munafik saat mengaku sebagai orang Islam seperti keadaan orang yang sebelumnya berada dalam malam yang gelap gulita kemudian berusaha mencari cahaya, setelah ia mendapatkannya ia menyinari sekitar dan mendapat manfaat dari cahaya itu sebentar saja karena cahaya itu kemudian redup, sehingga ia kembali ke dalam kegelapan; selain itu ia juga tuli, bisu, dan buta, sehingga ia tidak dapat kembali kepada keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. مَثَلُهُمْ كَمَثَلِ الَّذِى اسْتَوْقَدَ نَارًا (Perumpamaan mereka seperti orang-orang yang menyalakan api) Diriwayatkan dari Ibnu abbas dan beberapa sahabat yang lain tentang ayat ini, mereka berkata: “ketika Rasulullah datang berhijrah ke Madinah, sekelompok orang masuk islam akan tetapi kemudian timbul dihati mereka kenifakan. Perumpamaan mereka adalah seperti orang yang berada di kegelapan kemudian menyalakan api yang lalu menyinari mereka dari hal-hal yang mungkin bisa menyakiti, merekapun dapat melihat dengan jelas sehingga dapat berhati-hati. Namun ketika dalam keadaan itu tiba-tiba api mereka padam sehingga tidak dapat mengetahui bahaya yang harus mereka hindari. Demikian pulalah keadaan pada munafik yang dulunya berada dalam gelapnya kesesatan lalu mereka memeluk islam, merekapun dapat membedakan halal dan haram, yang baik dan buruk. Namun ketika mereka dalam keadaan itu tiba-tiba mereka keluar islam sehingga tidak mengetahui yang halal dan yang haram, yang baik dan yang buruk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Amtsal atau Perumpamaan-perumpamaan yang tertera dalam al-Qur'an dapat dibagi menjadi dua bagian : bagian amtsal Musarahah, ialah yang didalamnya dijelaskan dengan lafaz matsal atau sesuatu yang menunjukkan tasybih. Amtsal seperti ini banyak ditemukan dalam al-Quran, diantaranya firman Allah mengenai orang munafik : { مَثَلُهُمْ كَمَثَلِ الَّذِى اسْتَوْقَدَ نَارًا } , dan amtsal yang didalamnya tidak disebutkan dengan jelas lafaz tamsil (pemisalan) seperti : { كَدَأْبِ آلِ فِرْعَوْنَ } \"(Keadaan mereka) serupa dengan keadaan pengikut Fir‘aun\", dan ayat ini terdapat di tiga tempat dalam al-Qur'an, dan perkataan Yusuf : { أَأَرْبَابٌ مُتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الْوَاحِدُ الْقَهَّارُ } \"manakah yang baik, tuhan-tuhan yang bermacam-macam itu ataukah Allah Yang Maha Esa lagi Maha Perkasa?\" [ Yusuf : 39 ]. 2 ). Perhatikanlah firman Allah ini tentang orang-orang munafiq : { ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ } bagaimana Allah mengatakan { بِنُورِهِمْ } dengan bentuk kata tunggal, kemudian tatkala Ia menyebut { ظُلُمَاتٍ } berubah menjadi bentuk kata jamak; karena sesungguhnya kebenaran itu hanya satu yaitu ( Shirot al-Mustaqim ) berbeda dengan jalan-jalan kebathilan, sesungguhnya ia sangatlah banyak dan bercabang-cabang, oleh karena itu Allah menggunakan bentuk tunggal untuk suatu kebenaran dan bentuk jamak pada sesuatu yang bathil sebagaimana yang juga dikatakan dalam firman-Nya : { اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Perumpamaan orang-orang munafik tersebut ketika mengumumkan bahwa mereka adalah orang Islam yaitu seperti orang yang menyalakan api yang dia manfaatkan dengan teman-temannya untuk penerangan. Ketika api itu telah menerangi mereka, api itu padam dan menjadikan sekitar mereka gelap. Allah menghilangkan cahaya mereka dan meninggalkan mereka dalam keadaan saling bertenngkar dalam gelapnya keraguan dan kemunafikan. Mereka tidak (mampu) melihat jalan kebenaran dan tidak (bisa) mengetahui kebaikan daripada keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan mereka itu} perumpamaan orang-orang munafik itu {seperti orang yang menyalakan} menyalakan {api. Setelah api itu menerangi sekelilingnya, Allah melenyapkan cahaya (yang menyinari) mereka dan membiarkan mereka dalam kegelapan sehingga mereka tidak dapat melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17.Maksudnya, perumpamaan mereka yang sesuai dengan kondisi mereka adalah seperti orang yang menyalakan api, yakni seperti seorang yang berada dalam kegelapan yang pekat, dan sangat membutuhkan api, lalu api dinyalakan dari orang lain, dan ia sendiri tidak memiliki persiapan, akan tetapi di luar kesiapannya, dan ketika api itu telah menerangi sekitarnya, dan ia mampu melihat tempat dimana ia berada dan segala yang ia rasakan berupa kekhawatiran, ia menenangkan diri dan memanfaatkan api tersebut, lalu tenanglah pandangannya, dan ia mengira bahwa ia menguasai kondisi itu, lalu ketika ia berada dalam kondisi seperti itu, Allah memadamkan cahayanya hingga hilanglah cahaya dari api itu dan lenyaplah kebahagiaannya, lalu ia berada kembali dalam kegelapan yang pekat sedangkan api masih menyala-nyala namun telah hilang cahaya darinya dan tinggallah padanya api yang menyala-nyala, dan ia berada dalam kegelapan yang bermacam-macam; kegelapan malam, kegelapan awan, kegelapan hujan, dan kegelapan yang terjadi setelah adanya cahaya, maka bagaimanakah kondisi orang yang seperti ini? Demikianlah juga orang-orang munafik yang menyalakan api keimanan dari kaum Mukminin namun tidak menjadi ciri bagi mereka, mereka menjadikannya penerangan untuk sementara waktu dan memanfaatkannya, hingga terjagalah darah mereka dan selamatlah harta mereka, serta mereka mendapatkan suatu keamanan di muka bumi ini, lalu ketika mereka dalam kondisi seperti ini, tiba-tiba kematian menyergap mereka, dan menghentikan pemanfaatan mereka terhadap cahaya tersebut, hingga terjadilah kegundahan, kebimbangan, dan siksaan, dan mereka mendapatkan kegelapan kubur, kegelapan kekufuran, kegelapan kemunafikan, dan kegelapan kemaksiatan dengan segala perbedaan coraknya, lalu kemudian setelah itu kegelapan api neraka; dan itulah seburuk-buruk tempat tinggal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : مَثَلُهُمۡ matsaluhum artinya keadaan mereka ٱسۡتَوۡقَدَ نَارٗا maknanya menyalakan api. Makna ayat : Permisalan orang-orang munafik yang menampakkan keimanan dan menyembunyikan kekufuran dalam hatinya, seperti orang yang menyalakan api untuk menerangi sekelilingnya dan mendapat sedikit manfaat dari penerangan tersebut Allah menghilangkan cahaya dan meninggalkan mereka dalam gelap gulita tidak bisa melihat. Karena keimanan mereka secara dhohir hanya bisa menjaga darah, harta, serta anak istri agar tidak menjadi tawanan atau dibunuh, sedangkan dengan ada kekufuran yang mereka sembunyikan ketika mati akan masuk ke dalam neraka sehingga mereka rugi sampai dirinya sendiri. Inilah perumpamaan yang dikandung oleh ayat 17. Pelajaran dari ayat : Merupakan hal yang bagus untuk menjelaskan sesuatu dengan memberikan permisalan (analogi) untuk memudahkan pemahaman ke dalam pikiran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 17: Allah menyerupakan suatu kaum dari golongan orang-orang yang munafik dengan keadaan yang sangat gelap. Kemudian orang munafik tersebut meminta untuk diterangi dengan cahaya sebagai petunjuk baginya ; maka ketika diterangi apa yang ada di sekitarnya dan diberikan ketenangan serta kebahagiaan , Allah padamkan api tersebut ; maka yang tersisa adalah kegelapan yang ia tidak melihat sesuatu apapun, tidak juga terdapat petunjuk menuju jalan serta tempat keluar ; begitu juga mereka orang-orang yang munafik yang mereka beriman secara dzahir dan kemudian menyembunyikan keimanannya untuk menjaga harta-harta mereka , mereka kufur secara batin sehingga mereka menjadi orang-orang yang berada di dalam kegelapan karena sebab kekufuran , kesesatan , kemunafikan serta kemaksiatan ; maka ketika datang kepada mereka kematian, datang pula kegelapan dalam kubur mereka, dan setelahnya mereka berada di dalam kegelapan neraka ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang munafik itu tidak dapat mengambil manfaat dari petunjuk-petunjuk yang datang dari Allah, karena sifat-sifat kemunafikkan yang bersemi dalam dada mereka. Keadaan mereka digambarkan Allah seperti dalam ayat tersebut di atas. Mereka terombang-ambing dalam gelapnya kesesatan namun mereka tidak sadar dan tidak ada harapan lagi untuk keluar daripadanya tidak ubahnya seperti sebuah rombongan yang berada di malam yang gelap, di mana salah seorang di antara mereka menyalakan api yang besar untuk penerangan dan menghangatkan badan. Ketika api telah membesar dan menerangi sekelilingnya, saat itu juga api pun padam sehingga mereka kebingungan tidak dapat melihat apa-apa dan tidak mengetahui jalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 17",
    "description": "Perumpamaan keadaan mereka orang-orang munafik yang sungguh mengherankan itu seperti keadaan yang aneh dari orang-orang yang menyalakan api. Setelah api itu menerangi apa-apa yang ada di sekelilingnya dan memberikan kehangatan, rasa nyaman, dan manfaat lainnya bagi mereka, tiba-tiba Allah melenyapkan cahaya yang menyinari mereka dan membiarkan mereka dalam kegelapan yang kelam, tidak dapat melihat suatu apa pun. Allah telah memberikan kepada mereka petunjuk kebenaran, tetapi mereka tidak berpegang teguh pada petunjuk tersebut, sehingga mata mereka menjadi tertutup, dan mereka pantas berada dalam kebimbangan dan kesesatan. Mereka seperti orang tuli, sebab mereka telah kehilangan fungsi pendengaran dengan tidak mengikuti kebenaran yang didengar. Mereka juga seperti orang bisu karena tidak mengucapkan kebenaran oleh sebab hati mereka tertutup, sehingga tidak tergerak melakukan itu. Dan mereka juga seperti orang buta, karena kehilangan fungsi penglihatan, baik melalui mata kepala (bashar) ataupun mata hati (bashirah), dengan tidak mengambil pelajaran dari hal-hal yang mereka lihat, sehingga pada akhirnya mereka tidak dapat kembali dari kesesatan itu kepada kebenaran yang telah mereka jual dan tinggalkan."
  }
]