[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kaum mukminin berkata menasehati orang-orang yang sesat, “Ikutilah oleh kalian apa yang diturunkan oleh Allah berupa Alquran dan hidayah”. Mereka justru terus-menerus mengikuti para pendahulu mereka yang menyekutukan Allah Seraya berkata, \"Kami tidak ingin mengikuti ajaran agama kalian, sebaliknya kami hanya mau mengikuti apa saja yang kami dapati Bapak Bapak kami melakukannya”. Apakah mereka akan mengikuti bapak-bapak mereka Meskipun mereka itu tidak memahami sedikitpun dari Wahyu Allah dan tidak memperoleh petunjuk yang lurus?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "170. Apabila dikatakan kepada orang-orang kafir itu, “Ikutilah petunjuk dan cahaya yang Allah turunkan,” mereka menjawab dengan disertai penentangan, “Kami akan mengikuti keyakinan dan tradisi yang dianut oleh leluhur kami.” Apakah mereka akan tetap mengikuti leluhur mereka sekalipun para leluhur mereka itu tidak mengerti sedikitpun tentang petunjuk dan cahaya dari Allah, dan tidak mengikuti jalan kebenaran yang direstui oleh Allah?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "170. Dan jika orang-orang kafir dinasehati agar mengikuti jalan yang ditunjukkan al-Qur'an, mereka menolak seraya berkata: \"Kami tidak akan mengikuti agama kalian, namun kami hanya mengikuti apa yang kami dapati dari nenk moyang kami.\" Maka Allah mengolok mereka: \"Apakah mereka akan mengikuti nenek moyang mereka meski mereka itu kurang akal, tidak memiliki akal yang sehat yang dapat menghentikan mereka dari keburukan, dan tidak pula dapat menunjukkan mereka kepada kebaikan?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. وَإِذَا قِيلَ لَهُمُ (Dan apabila dikatakan kepada mereka) Yakni kepada orang-orang kafir. أَلْفَيْنَا (telah kami dapati) Yakni kami mendapati (nenek moyang kami). أَوَلَوْ كَانَ ءَابَآؤُهُم (Apakah mereka akan mengikuti juga) nenek moyang mereka) Yakni apakah kalian mengikuti nenek moyang kalian padahal mereka dalam kesesatan yang jelas dan apa yang mereka kerjakan tidak berdasarkan akal sehat dan petunjuk dari langit, seperti mengharamkan yang tidak Allah haramkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170. Dan ketika dikatakan kepada orang-orang kafir: “Ikutilah apa yang diturunkan oleh Allah atas rasulNya berupa Al-Qur’an, hikmah, dan keimanan kepada Allah, dan rasulullah,” maka mereka akan berkata: “Kami tidak akan mengikuti agama kalian. Kami mengikuti ibadah bapak-bapak kami” Lalu Allah membalas mereka: “Apakah tetap begitu meskipun bapak-bapak yang mereka tiru itu tidak mengetahui apapun tentang hakikat dan rahasia agama, dan tidak mendapatkan petunjuk menuju sesuatu yang mengandung kebenaran, hidayah, kebaikan, dan kebahagiaan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepada mereka, “Ikutilah apa yang telah diturunkan Allah,” mereka menjawab,“Tidak. Kami tetap mengikuti kebiasaan yang kami dapati} apa yang telah kami dapati {pada nenek moyang kami.” Apakah (tetap diikuti) walaupun nenek moyang mereka tidak mengerti apa pun dan tidak mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "170. “(Tidak), tetapi kami hanya mengikuti apa yang telah kami dapati dari (perbuatan) nenek moyang kami.” Mereka merasa cukup hanya mengikuti nenek moyang mereka, dan mereka tidak membutuhkan untuk beriman kepada para nabi, padahal nenek moyang mereka itu adalah orang-orang yang paling bodoh dan paling sesat. Syubhat ini sangatlah lemah untuk menolak kebenaran. Ini semua adalah tanda tentang berpalingnya mereka dari kebenaran dan kebencian mereka terhadapnya, serta tidak adanya sikap adil pada mereka, sekiranya mereka diberikan hidayah dan kehendak yang tulus, pasti kebenaran itulah yang menjadi target, karena barangsiapa yang menjadikan kebenaran itu sebagai targetnya lalu menimbang-nimbang kebenaran itu dengan yang lainnya, maka jelaslah baginya kebenaran itu secara pasti, lalu ia akan mengikutinya bila ia bersikap adil."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَلۡفَيۡنَا } Alfaina : Kami dapatkan. Makna ayat: Tatkala Rasulullah berkata kepada mereka,”Ikutilah apa yang Allah turunkan” mereka mengatakan,”Tidak, kami akan mengikuti apa yang kami dapati dari nenek moyang kami.” Maha suci Allah mereka memilih untuk mengikuti apa yang didapati dari nenek moyang mereka walaupun itu hal yang bathil dan menyesatkan. Apakah mereka akan tetap mengikuti nenek moyang walaupun nenek moyang itu tidak mengerti sama sekali urusan syariat dan agama? Dan tidak mendapatkan petunjuk untuk mengikuti jalan kebaikan dan kebahagiaan? Pelajaran dari ayat: • Keharaman taqlid buta kepada orang yang tidak memiliki ilmu pengetahuan dan pemahaman agama. • Kebolehan mengikuti orang yang memiliki ilmu dan mengamalkan pendapatnya yang terambil dari wahyu ilahi yaitu al-Qur’an dan sunnah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 170: Allah mengajarkan keadaan orang-orang kafir jika diperintahkan untuk mengikuti apa yang diturunkan kepada rasulullah ﷺ mereka mengingkari dan berkata: bahkan kami adalah orang yang mengikuti bapak-bapak kami, Allah berkata : Apakah kalian mengikuti bapak-bapak kalian meskipun mereka bodoh?."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir atau orang-orang yang sesat. Seperti mentauhidkan Allah Subhaanahu wa Ta'aala, menghalalkan yang baik-baik dan meninggalkan tradisi yang menyalahi ajaran agama. Ayat ini menunjukkan tercelanya sikap taqlid (ikut-ikutan) dan bahwa taqlid merupakan kebiasaan orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 170",
    "description": "Dan apabila dikatakan kepada mereka, yaitu orang-orang musyrik, ikutilah apa yang telah diturunkan Allah kepada para nabi yaitu tuntunan mengenai kebenaran, mereka menolak nasihat tersebut dan mereka menjawab, tidak! kami tidak mau mengikuti nasihat itu, karena cukup bagi kami mengikuti apa yang kami dapati pada nenek moyang kami. Mereka mengatakan hal ini karena ingin melestarikan tradisi yang dilakukan nenek moyang mereka, antara lain menyembah berhala, meminum minuman keras, dan perilaku tidak terpuji lainnya. Padahal, nenek moyang mereka itu tidak mengetahui apa pun tentang tradisi yang dijalankan selain juga mengikuti nenek moyang sebelumnya, dan mereka tidak mendapat petunjuk dasar-dasar kebenaran tradisi tersebutdan perumpamaan bagi penyeru yang mengajak orang yang kafir agar mereka mengikuti kebenaran, yaitu beriman kepada Allah dan hari akhir, adalah seperti penggembala yang meneriaki binatang gembalaannya yang tidak mendengar selain panggilan dan teriakan. Mereka mendengar panggilan dan ajakan, tetapi mereka tidak memahami maksud dan manfaatnya, sehingga mereka memilih mempertahankan tradisi nenek moyang mereka. Hal itu karena telinga mereka tuli tidak berfungsi untuk mendengarkan nasihat dan bimbingan, mulut mereka bisu tidak bisa difungsikan untuk bertanya dan berbicara kebenaran, dan mata mereka buta tidak dapat melihat tanda-tanda keesaan dan kekuasaan Allah yang tersebar di alam nyata, maka mereka tidak mengerti dan tidak menyadari kalau sudah melakukan kesalahan yang besar, yaitu mengikuti tradisi nenek moyang yang keliru padahal telah datang ajaran kebenaran yang dibawa oleh para rasul Allah."
  }
]