[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Sifat orang-orang kafir dan penyeru mereka menuju Hidayah dan keimanan seperti sifat seorang penggembala yang berteriak memanggil ternak gembalaannya dan menghalaunya, sedangkan ternak-ternak itu tidak paham makna perkataan sang penggembala. Bahkan mereka hanya mendengar panggilan dan gaung suaranya saja. Orang-orang kafir itu Tuli, mereka telah menutup pendengaran mereka dari kebenaran, mereka juga bisu, mereka membisukan lisan mereka untuk menyuarakan kebenaran, dan mereka juga buta, pandangan mereka tidak dapat melihat bukti-bukti kebenaran yang membelalakan mata. mereka itu tidak mempergunakan akal mereka untuk perkara yang bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "171. Perumpamaan orang-orang kafir yang mengikuti leluhur mereka itu adalah seperti penggembala yang berteriak kepada binatang gembalaannya, maka binatang itu mendengar suaranya tetapi tidak memahami ucapannya. Jadi, telinga mereka tidak bisa mendengar suara kebenaran dan tidak mendapatkan manfaat apapun darinya. Mulut mereka pun bisu, tidak dapat mengucapkan ucapan yang benar. Dan mata mereka buta, tidak dapat melihat kebenaran. Oleh karena itulah mereka tidak bisa memahami petunjuk yang engkau serukan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "171. Allah memperumpamakan orang-orang yang mendustakan-Nya dengan orang-orang yang menyeru mereka kepada keimanan seperti penggembala yang berteriak kepada hewan-hewan ternaknya yang tidak dapat memahami dan hanya mendengar suara saja. Begitulah orang-orang yang mendustakan Allah, mereka tuli dari mendengar kebenaran, bisu dari mengatakan kebaikan, dan buta dari petunjuk; mereka tidak dapat memahami apa yang bermanfaat bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "171. وَمَثَلُ الَّذِينَ كَفَرُوا۟ كَمَثَلِ الَّذِى يَنْعِقُ (Dan perumpamaan (orang-orang yang menyeru) orang-orang kafir adalah seperti penggembala yang memanggil binatang) Dalam ayat ini terdapat permisalan antara Nabi muhammad sang dai dan pemberi nasehat bagi orang-orang kafir dengan seorang penggembala yang berteriak pada kambing-kambing atau unta-unta yang tidak mendengar kecuali suara dari teriakan tersebut tanpa memahami apa yang dikatakan. Dari Ibnu Abbas, ia berkata: layaknya sapi, keledai, atau kambing yang apabila kamu berbicara kepadanya ia tidak faham apa yang kamu katakan, akan tetapi ia mendengar suaramu saja; begitulah keadaan orang kafir jika kamu perintahkan untuk berbuat kebaikan, atau kamu larang berbuat keburukan, atau kamu nasehati dia, tidak akan memahami yang kamu katakan akan tetapi dapat mendengar suaramu. صُمٌّۢ بُكْمٌ عُمْىٌ فَهُمْ لَا يَعْقِلُونَ (Mereka tuli, bisu dan buta, maka (oleh sebab itu) mereka tidak mengerti) Yakni mereka tidak mampu mendengar kebenaran, tidak mampu melihatnya, tidak pula mengatakannya; lalu bagaimana bisa mereka mampu memahami apa yang dikatakan kepada mereka dan bagaimana mereka dapat menemukan jalan yang benar?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "171. Dan gambaran orang yang menasehati orang-orang kafir yang meniru bapak-bapak mereka itu dan menyeru mereka menuju keimanan, yaitu Nabi SAW itu seperti penggembala yang meneriaki unta dan kambing, namun mereka tidak dapat mendengarkan kecuali dia menyeru dari dekat supaya mereka datang, berjalan, atau supaya terkendali. Dan seruan dari jauh itu hanya menyia-nyiakan suara saja. Apa yang dia ucapkan tidak mereka pahami. Mereka tuli tidak bisa mendengar kebenaran, bisu tidak bisa mengucapkan kebaikan, dan buta penglihatan sehingga tidak bisa membedakan sesuatu dengan jelas. Bahkan mereka memandu orang lain sebagaimana memandu hewan, jadi bagaimana bisa mereka berpikir tentang sesuatu yang diucapkan kepada mereka, atau memahami panggilan kebenaran dan keimanan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan orang-orang yang kafir itu seperti orang yang meneriaki hewan yang tidak bisa mendengar selain panggilan dan teriakan} dia meneriaki hewan gembala yang tidak bisa mendengar perkataan penggembalanya tanpa tahu makna perkataan itu {(Mereka) tuli, bisu, dan buta sehingga mereka tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171. Ketika Allah menjelaskan tentang ketidaktaatan mereka terhadap apa yang dibawa oleh para rasul dan bantahan mereka terhadap mereka atas hal itu dengan menyatakan bahwa itu adalah taqlid, maka diketahui dari hal itu semua bahwa mereka tidak menerima kebenaran dan tidak meresponnya, bahkan telah diketahui oleh setiap orang bahwa mereka akan selalu berada pada kedurhakaan mereka. Kemudian Allah mengabarkan bahwa perumpamaan mereka ketika ada orang yang mendakwahi mereka kepada keimanan adalah seperti binatang ternak yang dipanggil oleh pengembalanya dan ia tidak mengetahui apa yang dikatakan oleh penyeru dan pemanggilnya itu, mereka itu hanya mendengar suara saja yang hujjah itu akan tegak dengannya, akan tetapi mereka tidak memahaminya dengan pemahaman yang bermanfaat bagi mereka. Oleh karena itu, mereka adalah tuli dan tidak mendengar kebenaran dengan pendengaran kepahaman dan penerimaan, mereka itu buta, yang tidak melihat dalam rangka mengambil pelajaran, mereka itu bisu, yang tidak dapat berbicara dengan hal yang baik bagi mereka. Dan penyebab dari semua itu adalah karena mereka tidak memiliki akal yang sehat, akan tetapi mereka adalah sebuah bodohnya manusia dan se dungu dungu nya orang. Apakah seseorang yang berakal akan ragu bahwa orang yang diserahkan kepada petunjuk dan menjauh dari kerusakan, dilarang terjun ke dalam siksaan, ia diperintahkan kepada kebaikan, keberhasilan, kemenangan dan kenikmatan untuknya, lalu ia bermaksiat kepada orang yang menasehatinya, berpalinglah dari perintah Rabbnya, menerobos ke dalam api neraka meski ia tahu dan mengikuti kebatilan serta membuang kebenaran, bahwa yang seperti inilah yang tidak memiliki pegangan akal? dan bahwasanya bila disertai dengan sifat makar, tipu daya, dan penipuan, maka sesungguhnya ia adalah manusia yang paling dungu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مَثَلُ } Matsal : Sifat dan keadaan { يَنۡعِقُ } Yan’iqu : Berteriak dengan keras, pelakunya disebut Na’iq yaitu orang yang berteriak dan bersuara keras. { الدُعَآء } ad-Du’aa : Memanggil Dzat yang dekat (berdoa) , seperti doa seorang mukmin tatkala kepada Rabb-Nya dengan mengatakan “Ya Rabb..Ya Rabb”. { النداء } an-Nidaa’ : Memanggil sesuatu yang jauh seperti halnya adzan sebagai panggilan untuk shalat. { الصُّمُّ } ash-Shumm : Kata ‘Shumm’ bentuk jamaknya adalah Ashomm, yaitu orang yang tidak dapat mendengar (tuli). { البُكْمُ } al-Bukmu : Kata ‘Bukmun’ bentuk jamaknya adalah ‘Abkam’, yaitu orang yang tidak bisa berbicara (bisu). { لَا يَعۡقِلُونَ } Laa ya’qiluun : Tidak dapat memahami makna perkataan dan tidak bisa membedakan antara beberapa hal, karena tidak berfungsinya indera untuk memahami dan mengetahui yang ada pada mereka, yaitu akal pikiran. Makna ayat : Ayat ini masih berkaitan dengan ayat sebelumnya (170) yang mana menjelaskan mengenai taqlid dan orang-orang yang bertaqlid, dimana mereka kehilangan akal dan perasaannya. Mereka mau melakukan apa yang diucapkan oleh para pemimpinnya dan menjalankan apa yang mereka perintahkan, tunduk dan patuh tanpa mempertanyakan mengapa mereka melakukan sesuatu atau mengapa meninggalkan sesuatu. Maka ayat ini turun dengan gambaran yang begitu menakjuban dan permisalan yang aneh, mengenai orang-orang yang menanggalkan akal pikirannya dan lebih memilih untuk menjadi pembebek dalam segala hal. Sampai-sampai diumpamakan mereka seperti kambing yang terkekang, dikendalikan kemana saja oleh penggembalanya dengan bebasnya. Apabila penggembala memanggilnya, ia akan selalu datang, walaupun penggembala itu memanggilnya untuk disembelih. Apabila penggembala memanggilnya dari tempat yang jauh maka ia akan memenuhi panggilannya, sedangkan ia tidak tahu untuk apa dipanggil, karena ia tidak mendengar dan memahami kecuali hanya sekadar suara yang ia tiru (taklid) dan ia ikuti tanpa adanya dalil. Allah Ta’ala berfirman (وَمَثَلُ ٱلَّذِينَ كَفَرُواْ ) “Dan perumpamaan (orang yang menyeru) orang-orang kafir....” dalam hal kejumudan dan taqlid mereka kepada bapak-bapaknya dalam kesyirikan dan kesesatan, seperti kambing yang dipanggil oleh penggembala yang menjaganya. Jika penggembala memanggilnya baik dari jarak dekat ataupun jarak jauh, selagi dapat mendengarnya akan mendatanginya, walaupun tidak tahu untuk apa dipanggil karena telah kehilangan akal pikirannya. Perumpamaan ini cocok untuk orang yang mencoba mengajak orang-orang kafir dan orang-orang sesat untuk beriman dan kembali ke jalan hidayah. Maka orang itu bersama dengan orang-orang yang diajaknya dari kalangan orang kafir, orang bertaqlid, dan orang yang sesat serta jumud, seperti halnya gembala yang memanggil hewan ternaknya yang tidak mendengar selain panggilan saja. Mereka tuli, bisu, dan buta, maka dari itu mereka tidak mengerti. Pelajaran dari ayat : • Hiburan bagi orang yang berdakwah di jalan Allah ketika menghadapi orang-orang yang hanya bisa taqlid dari kalangan pelaku kesyirikan dan kesesatan. • Keharaman untuk bertaqlid kepada ahli bid’ah dan pemuja hawa nafsunya. • Kewajban untuk mencari ilmu dan pengetahuan agar seorang mukmin ketika melakukan atau meninggalkan sesuatu, berasal dari ilmu tentang apa yang dilakukan atau ditinggalkan. • Tidak boleh untuk diikuti kecuali kepada ahli ilmu dan pengetahuan dalam agama, karena mengikuti (ittiba’) orang-orang bodoh termasuk taqlid."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 171: Kemudian Allah mengabarkan bahwasannya mereka orang-orang kafir ketika didakwahkan petunjuk serta kebenaran mereka semisal pengembala kambing yang mendengar suara kambingnya akan tetapi tidak memahami maksud ucapan kambingnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Penyeru orang-orang kafir adalah orang-orang yang berdakwah kepada mereka, mengajak mereka beriman dan mengikuti petunjuk. Dalam ayat ini, penyeru tersebut diumpamakan seperti penggembala, sedangkan orang-orang kafir diumpamakan sebagai binatang ternak yang tidak memahami kata-kata si penggembala selain mendengar suara sebagai penegak hujjah, namun mereka tidak memahaminya. Mereka tidak mendengarkan yang hak dengan pendengaran yang membuahkan pemahaman dan sikap menerima. Bisu dari mengatakan yang hak (benar). Penglihatan mereka tidak mampu melihat bukti-bukti yang jelas. Mereka tidak mengerti nasehat yang disampaikan. Inilah sebab mereka bersikap seperti itu, yakni mereka tidak memiliki akal yang sehat, dan tidak mengerti hal-hal yang bermaslahat bagi mereka padahal penyeru itu mengajak kepada keselamatan dan agar jauh dari kesengsaraan, mengajak masuk ke dalam surga dan jauh dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 171",
    "description": "Dan perumpamaan bagi penyeru yang mengajak orang yang kafir agar mereka mengikuti kebenaran, yaitu beriman kepada Allah dan hari akhir, adalah seperti penggembala yang meneriaki binatang gembalaannya yang tidak mendengar selain panggilan dan teriakan. Mereka mendengar panggilan dan ajakan, tetapi mereka tidak memahami maksud dan manfaatnya, sehingga mereka memilih mempertahankan tradisi nenek moyang mereka. Hal itu karena telinga mereka tuli tidak berfungsi untuk mendengarkan nasihat dan bimbingan, mulut mereka bisu tidak bisa difungsikan untuk bertanya dan berbicara kebenaran, dan mata mereka buta tidak dapat melihat tanda-tanda keesaan dan kekuasaan Allah yang tersebar di alam nyata, maka mereka tidak mengerti dan tidak menyadari kalau sudah melakukan kesalahan yang besar, yaitu mengikuti tradisi nenek moyang yang keliru padahal telah datang ajaran kebenaran yang dibawa oleh para rasul Allah wahai orang-orang yang beriman! makanlah dari rezeki yang baik yang sehat, aman dan tidak berlebihan, dari yang kami berikan kepada kamu melalui usaha yang kamu lakukan dengan cara yang halal. Dan bersyukurlah kepada Allah dengan mengakui bahwa semua rezeki berasal dari Allah dan kamu harus memanfaatkannya sesuai ketentuan Allah jika kamu hanya menyembah kepada-Nya."
  }
]