[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman Makanlah dari makanan-makanan yang lezat lagi halal yang telah kami rizkikan kepada kalian, dan janganlah kalian berbuat seperti orang-orang kafir yang mengharamkan makanan yang baik-baik dan menghalalkan makanan makanan yang menjijikan. Dan bersyukurlah kepada Allah atas nikmat-nikmatnya yang agung yang diberikan kepada kalian dengan hati, lisan dan anggota tubuh kalian, jika kalian memang orang-orang yang betul-betul tunduk kepada perintah Nya, mendengar lagi taat kepada Nya, beribadah kepada Nya saja tanpa menyekutukan sesuatu apapun dengan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "172. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, makanlah dari rezeki yang Allah berikan kepada kalian dan Dia perbolehkan untuk kalian. Dan bersyukurlah kepada Allah secara lahir dan batin atas semua karunia yang Dia berikan kepada kalian. Salah satu bentuk syukur kepada-Nya ialah melakukan ketaatan kepada-Nya dan menjauhi maksiat terhadap-Nya. Ini jika kalian benar-benar mengabdi kepada-Nya semata dan tidak menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "172. Hai orang-orang yang beriman kepada Allah dan rasul-Nya, Kami telah membolehkan bagi kalian makanan lezat yang halal dari rezeki Kami, maka bersyukurlah kepada Allah atas nikmat-nikmat-Nya dengan perkataan dan perbuatan jika kalian benar-benar mentaati-Nya dan menyembah-Nya semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "172. كُلُوا۟ مِن طَيِّبٰتِ مَا رَزَقْنٰكُمْ(makanlah di antara rezeki yang baik-baik yang Kami berikan kepadamu) Thoyyib yakni makanan yang halal dan nikmat, maka makanlah itu dan jangan kalian haramkan sesuatu yang tidak diharamkan Allah, dan jangan pula melarang untuk memakan makanan yang oleh ahli jahiliyyah dan yang lainnya mereka haramkan atas kehendak mereka sendiri. إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ (jika benar-benar kepada-Nya kamu menyembah) Yakni jika kalian mengkhususkan ibadah hanya untuknya maka makanlah dari hal-hal yang baik, dan jangan kalian hiraukan apa yang diharamkan oleh selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "172. Wahai orang-orang yang beriman, makanlah dari sesuatu yang halal dan kebaikan yang melimpah. Dan janganlah kalian mengharamkan sedikitpun sesuatu yang tidak diharamkan oleh Allah, dan bersyukurlah kepada Allah atas nikmat dan kebaikan yang dilimpahkan olehNya atas kalian, jika kalian benar-benar menyembah hanya kepadaNya, dan beribadah khusus kepadaNya. Maka makanlah sesuatu yang baik, dan janganlah mengharamkan sesuatu yang tidak haram."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, makanlah apa-apa yang baik yang Kami anugerahkan kepada kalian dan bersyukurlah kepada Allah jika kalian benar-benar hanya menyembah kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172. Ayat ini adalah perintah kepada kaum muslimin secara khusus setelah perintah kepada manusia umumnya. Yang demikian itu karena pada dasarnya mereka lah yang mengambil manfaat dari perintah-perintah dan larangan-larangan, disebabkan keimanan mereka, perintah Allah untuk makan hal-hal yang baik dari rizki dan bersyukur kepada Allah atas segala nikmat nikmatNya dengan menggunakannya dalam ketaatan kepada Allah dan taqwa dengan nikmat nikmat tersebut yang dapat menyampaikan kepada hakikat syukur. Maka Allah memerintahkan kepada mereka apa yang diperintahkan kepada para Nabi dalam FirmanNya : \"Hai rasul-rasul, makanlah dari makanan yang baik-baik, dan kerjakanlah amal yang saleh. Sesungguhnya Aku Maha Mengetahui apa yang kamu kerjakan.\" QS. al-mu’minun ayat 51 Bersyukur dalam ayat ini adalah amal yang Shalih. Di sini Allah tidak berkata yang halal, karena seorang mukmin itu Allah bolehkan baginya hal-hal yang baik dari rizki yang terlepas dari akibat buruk, dan juga karena keimanan seorang mukmin itu menghalangi dirinya dari menikmati apa yang bukan miliknya. Dan FirmanNya “Jika benar-benar kepadaNya kamu menyembah,” Maknanya, maka bersyukurlah kepadaNya. Hal ini menunjukkan bahwa barangsiapa yang tidak bersyukur kepada Allah, berarti ia tidak menyembah semata-mata hanya kepadaNya, sebagaimana orang yang bersyukur kepadaNya, berarti ia telah beribadah kepadaNya dan menunaikan apa yang telah diperintahkan. Ayat ini juga menunjukkan bahwa memakan hal-hal yang baik adalah penyebab amal sholeh dan diterimanya amal tersebut. Allah memerintahkan untuk bersyukur setelah mendapatkan kenikmatan, karena dengan bersyukur akan memelihara kenikmatan yang ada tersebut, dan akan memunculkan kenikmatan-kenikmatan yang sebelumnya tidak ada, sebagaimana sikap kufur nikmat akan menjauhkan kenikmatan yang tidak ada dan menghilangkan kenikmatan yang telah ada."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الطيبات } ath-Thayyibaat : Bentuk jamak dari kata ‘Thayyib’ yang artinya halal { وَٱشۡكُرُواْ لِلَّهِ } Wasykuru lillah : Akuilah nikmat-nikmat Allah atas kalian dan sanjunglah Dia atas nikmat-nikmat Nya, dan gunakanlah nikmat tersebut dalam hal yang diridhai Nya. { إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ } In kuntum iyyaahu ta’buduun : Jika kalian benar-benar taat kepada Allah. Tunduk dan patuh terhadap perintah dan larangan Nya. Makna ayat : Pada ayat sebelumnya telah dijelaskan keadaan orang-orang kafir yang taqlid terhadap nenek moyangnya dalam hal kesyirikan dan pengharaman terhadap hewan-hewan yang dihalalkan oleh Allah, yaitu dengan menetapkan adanya hewan saaibah, haam, dan bahiirah untuk sesembahan mereka. Allah Ta’ala menyeru hamba-hamba Nya yang mukmin,”Wahai orang-orang yang beriman kepada Allah sebagai Tuhan dan sesembahannya, mengakui Islam sebagai agamanya, dan mengakui Muhammad adalah nabinya, makanlah makanan yang baik dari rizki yang Aku anugerahkan kepada kalian. Dan bersyukurlah kepada Allah tuhan kalian yang telah memberikan nikmat berupa daging-daging yang halal. Janganlah kalian mengharamkannya sebagaimana yang dilakukan oleh orang-orang musyrik. Pelajaran dari ayat : • Dianjurkan untuk makan makanan yang baik dan halal, yang berasal dari rizki Allah tanpa berlebih-lebihan. • Kewajiban bersyukur kepada Allah Ta’ala dengan mengakui datangnya nikmat dari Nya dan memuji Nya serta tidak menggunakan nikmat itu dalam kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 172: Allah memerintahkan hambaNya yang beriman untuk memakan setiap yang lezat dari makanan-makanan yang dirizkikan Allah kepada mereka serta halal untuk dimakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini perintah kepada kaum mukmin secara khusus setelah memerintahkan secara umum kepada manusia. Hal itu, karena hanya merekalah yang dapat mengerti nasehat yang disampaikan. Di ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan mereka memakan yang baik-baik dan bersyukur kepada Allah baik dengan hati, lisan maupun anggota badan, seperti menggunakan nikmat tersebut untuk keta'atan kepada-Nya atau dengan mengerjakan amal shalih. Perintah ini sama seperti perintah Allah kepada rasul-Nya, yaitu memakan makanan yang baik-baik dan beramal shalih (lihat surat Al Mukminun: 51). Perintah memakan yang baik-baik berarti larangan memakan yang kotor seperti halnya orang-orang kafir yang memakan sesuatu yang kotor dan mengharamkan makanan yang baik-baik. Ayat ini menunjukkan bahwa orang yang bersyukur kepada Allah berarti telah beribadah kepada-Nya, demikian juga menunjukkan bahwa memakan makanan yang baik merupakan sebab untuk beramal shalih dan sebab diterimanya amal shalih tersebut. Di dalam ayat ini juga terdapat perintah bersyukur setelah memperoleh nikmat, karena syukur dapat menjaga nikmat yang ada dan menarik kembali nikmat yang hilang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 172",
    "description": "Wahai orang-orang yang beriman! makanlah dari rezeki yang baik yang sehat, aman dan tidak berlebihan, dari yang kami berikan kepada kamu melalui usaha yang kamu lakukan dengan cara yang halal. Dan bersyukurlah kepada Allah dengan mengakui bahwa semua rezeki berasal dari Allah dan kamu harus memanfaatkannya sesuai ketentuan Allah jika kamu hanya menyembah kepada-Nya. Sesungguhnya dia hanya mengharamkan atasmu beberapa hal. Pertama, bangkai, yaitu binatang yang mati tidak dengan disembelih secara sah menurut ketentuan agama; kedua, darah yang aslinya mengalir, bukan limpa dan hati yang aslinya memang beku; ketiga, daging babi dan bagian tubuh babi lainnya seperti tulang, lemak, dan lainnya serta produk turunannya; dan, keempat, daging hewan yang disembelih dengan menyebut nama selain Allah, yaitu hewan persembahan untuk patung dan roh halus yang dianggap oleh orang musyrik dapat memberikan perlindungan dan keselamatan. Tetapi barang siapa terpaksa memakannya karena kalau tidak memakannya diduga menyebabkan kematian akibat kelaparan, bukan karena menginginkannya tetapi memang tidak ada makanan lain, dan tidak pula melampaui batas karena yang dimakan hanya sekadar untuk bertahan hidup, maka tidak ada dosa baginya memakan makanan yang diharamkan itu. Sungguh, Allah maha pengampun terhadap dosa yang dilakukan oleh hamba-Nya, apalagi dosa yang tidak disengaja. Allah maha penyayang kepada seluruh hamba-Nya, sehingga dalam keadaan darurat dia membolehkan memakan makanan yang diharamkan agar hamba-Nya tidak mati kelaparan."
  }
]