[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah hanyalah mengharamkan atas kalian hal-hal yang membahayakan kalian seperti bangkai binatang yang tidak disembelih dengan cara syar'I, darah yang mengalir, daging babi dan hewan-hewan sembelihan untuk selain Allah. Dan diantara karunia dan kemudahan Allah bagi kalian adalah bahwa Dia menghalalkan semua makanan makanan yang diharamkan tersebut dalam kondisi darurat. Maka siapa saja yang terjepit oleh kondisi darurat untuk memakan sesuatu darinya, tanpa ingin berbuat zalim dalam mengonsumsi melebihi kebutuhan, dan tidak melampaui batasan-batasan Allah dalam apa yang telah dihalalkan baginya, maka tidak ada dosa atas dirinya dalam tindakan tersebut. Sesungguhnya Allah maha pengampun terhadap hamba-hambanya, lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "173. Sesungguhnya makanan yang Allah haramkan bagi kalian hanyalah binatang yang mati tanpa disembelih sesuai syarak, darah yang mengucur dan mengalir, daging babi dan binatang yang disembelih dengan menyebut selain nama Allah. Apabila seseorang terpaksa harus memakan sesuatu (dari yang diharamkan itu) tanpa kezaliman (seperti memakannya tanpa ada kebutuhan untuk memakannya), dan tidak melampaui batasan darurat, maka tidak ada dosa dan hukuman baginya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang kepada hamba-hamba-Nya yang mau bertaubat. Salah satu wujud kasih sayang-Nya ialah Dia memperbolehkan mereka memakan makanan yang diharamkan tersebut ketika dalam keadaan darurat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "173. Setelah Allah menyebutkan pembolehan makanan yang baik-baik, maka Dia kemudian menyebutkan pengharaman makanan yang buruk seperti bangkai yang tidak disembelih dengan cara yang sesuai syariah kecuali bangkai ikan dan belalang, darah yang mengucur selain hati dan limpa, daging babi, dan hewan yang disembelih dengan menyebut nama selain Allah. Dan barangsiapa yang berada dalam keadaan sangat kelaparan dan tidak mendapat makanan halal kemudian memakan makanan-makanan haram tersebut tanpa berniat berbuat kerusakan dan berlebihan, maka tidak ada dosa baginya memakan itu. Allah Maha Mengampuni dosa hamba-hamba-Nya dan Maha Mengasihi mereka. Ibnu Katsir mengatakan: \"Jumhur ulama mengecualikan bangkai heean laut sebagaimana firman Allah: 'Bagi kalian binatang buruan laut' dan hadits al-Anbar dalam kitab shahih.\" Dan dalam kitab al-musnad, al-muwattho', dan as-sunan disebutkan Rasulullah bersabda tentang laut: \"Airnya suci dan menyucikan, dan bangkainya halal.\" Dishahihkan Tirmidzi (as-sunan, bab thaharah 1/100,101), Bukhari ('ilal Tirmidzi 1/152), Hakim dan disepakati Dzahabi (mustadrak 1/140), Baihaqi (al-ma'rifah 1/126), dan Baghawi berkata: hadits shahih yang keshahihannya telah disepakati (syarh as-sunnah 2/55), dan dishahihkan Ibnu Mulaqqin Ibnu Katsir berkata: isnadnya bagus (tafsir 2/126), dan al-albani (shahis sunan Ibnu Majah 1/67)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "173. إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ (Sesungguhnya Allah hanya mengharamkan bagimu bangkai) Ayat ini mengkhususkan pengharaman hanya pada hal-hal yang disebutkan di dalamnya. Makna (الميتة) bangkai: hewan yang telah keluar ruhnya tanpa penyembelihan syar’i. dan yang dimaksud disini adalah hewan-hewan darat, adapun hewan-hewan laut maka seluruhnya boleh dimakan baik yang masih hidup maupun yang telah mati. وَالدَّمَ(darah) Darah yang diharamkan merupakan darah yang mengalir (ketika penyembelihan). Diriwayatkan oleh Aisyah bahwa pernah ia memasak daging lalu terdapat warna kuning yang timbul keatas kuali disebabkan darah. Namun Rasulullah memakannya dan tidak mempermasalahkan itu. وَلَحْمَ الْخِنزِيرِ (daging babi) Yakni segala jenis babi diharamkan. وَمَآ أُهِلَّ بِهِۦ لِغَيْرِ اللَّـهِ ۖ (dan binatang yang (ketika disembelih) disebut (nama) selain Allah) Yakni yang disembelih dengan disebutkan nama selain nama Allah, seperti Laata dan Uzza. فَمَنِ اضْطُرَّ. (Tetapi barangsiapa dalam keadaan terpaksa (memakannya) ) Yakni yang dalam keadaan yang mengharuskannya untuk memakan makanan-makanan haram ini disebabkan kelaparan atau tidak mempunyai sesuatu untuk mereka makan atau karena dipaksa dan takut mendapatkan bahaya dari paksaan itu. غَيْرَ بَاغٍ (sedang dia tidak menginginkannya) Maksud dari (الباغي) adalah yang makan diatas kebutuhannya. وَلَا عَادٍ (dan tidak (pula) melampaui batas) (العادي) adalah yang memakan hal-hal yang diharamkan ini dan dia tidak meresa terpaksa karena tidak memiliki pilihan lain. فَلَآ إِثْمَ عَلَيْهِ ۚ (maka tidak ada dosa baginya) Yakni tidak berdosa apabila ia memakannya, karena Allah memberi rukhshoh untuk orang yang dalam situasi darurat dan Allah tidak akan menghukumnya. إِنَّ اللَّـهَ غَفُورٌ (Sesungguhnya Allah Maha Pengampun) Yakni mengampuni atas dosa memakan makanan haram karena terpaksa. رَّحِيمٌ (lagi Maha Penyayang) Yakni menyayangi orang tersebut dengan menghalalkan baginya makanan haram."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diriwayatkan bahwa sebab penempatan { غَفُورٌ } sebelum { رَحِيمٌ } adalah bahwasanya maghfirah sebagai keselamatan, dan rahmah sebagai keuntungan atau harta, sedangkan keselamatan itu lebih dibutuhkan sebelum keuntungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "173. Sesungguhnya makanan yang diharamkan oleh Allah itu hanya bangkai yang mati tanpa sempat disembelih secara syar’i, yaitu bangkai hewan darat, bukan bangkai hewan laut seperti ikan dan belalang, darah yang mengalir, namun darah yang diam itu halal yaitu bagian hati dan limpa, seluruh bagian babi, dan hewan yang disembelih dengan menyebut nama selain Allah seperti Latta dan Uzza. Barangsiapa terpaksa memakan barang-barang haram ini karena lapar yang sangat dahsyat dan tidak mendapati seuatu yang halal sedikitpun, sehingga dia memakan barang haram itu di luar keinginannya dan tidak melampaui batas sesuai takaran syariat, maka tiada dosa baginya atas makanan tersebut. Sesungguhnya Allah Maha Pengampun bagi orang yang memakan barang haram dalam keadaan terpaksa, dan Maha Penyayang terhadap hamba-hambaNya dengan menghalalkan barang yang haram karena keadaan darurat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Dia hanya mengharamkan atas kalian bangkai} sesuatu yang mati tanpa ketentuan syariat {darah, daging babi, dan hewan yang disembelih dengan (menyebut nama) selain Allah} dan apa yang disebut ketika menyembelihnya adalah nama selain Allah{dan siapa yang terpaksa, bukan karena menginginkannya} bukan karena mencari sesuatu yang diharamkan {dan tidak melampaui batas} tidak melewati batas keadaan darurat {maka tidak ada dosa baginya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "173. Dan ketika Allah menyebutkan bolehnya hal-hal yang baik, Dia sebutkan juga haramnya hal-hal yang kotor, melalui FirmanNya, “Sesungguhnya Allah hanya mengharamkan bagimu bangkai,” yaitu binatang yang mati tanpa disembelih secara syar’i, karena bangkai itu kotor lagi berbahaya, karena kejelekan dzatnya, dan karena mayoritas bangkai itu adalah dari penyakit, sehingga menambah penyakitnya. Namun pembuat syariat mengecualikan dari keumuman tersebut, bangkai belalang dan ikan, karena kedua bangkai itu halal lagi baik. Juga “darah” yaitu darah yang mengalir (mengucur) sebagaimana yang telah dibatasi oleh ayat yang lain, “Dan binatang yang ketika disembelih disebutkan nama selain Allah,” yakni, disembelih untuk selain Allah seperti hewan yang disembelih untuk patung, berhala dari batu, kuburan, dan sebagainya. Hal-hal yang telah disebutkan di atas tidaklah membatasi bagi hal-hal yang diharamkan. Hal-hal tersebut disebutkan dalam ayat ini hanya untuk menjelaskan jenis dari hal-hal yang kotor tersebut yang dimaksudkan dari pemahaman terbalik dalam FirmanNya, “hal-hal yang baik.” Keumuman apa-apa yang diharamkan dapat dipahami dari ayat terdahulu dari FirmanNya, “halal lagi baik” sebagaimana yang telah berlalu. Sesungguhnya hal yang kotor itu atau yang semacamnya diharamkan untuk kita, sebagai bentuk kasih sayangNya kepada kita dan pemeliharaan diri dari hal-hal yang berbahaya. Walaupun demikian, “barangsiapa dalam keadaan terpaksa memakannya,” maksudnya, terpaksa beralih kepada yang haram karena lapar dan tidak punya apa-apa, atau dipaksa, “sedang dia tidak menginginkannya,” yakni, tidak mencari yang haram padahal dia mampu mendapatkan yang halal atau karena tidak adanya rasa lapar, “dan tidak pula melampaui batas,” yakni kelewat batas dalam menikmati apa yang telah diharamkan tersebut karena keterpaksaan tadi, maka barangsiapa yang terpaksa dan ia tidak mampu mendapatkan yang halal dan ia makan menurut batas kebutuhan mendasar saja dan tidak lebih dari itu, “maka tidak ada dosa,” yakni kesalahan, “baginya” dan apabila dosa yang telah dihilangkan, maka perkara itu kembali kepada asal-muasalnya. Dan manusia dalam kondisi seperti ini diperintahkan untuk makan, bahkan ia dilarang untuk mencelakakan dirinya atau membunuh dirinya, maka wajiblah atasnya untuk makan, bahkan ia berdosa jika tidak makan hingga ia meninggal, yang akhirnya dia telah membunuh dirinya sendiri. Pembolehan dan keringanan ini adalah rahmat dari Allah terhadap hamba-hambaNya. Oleh karena itu Allah menutup ayat ini dengan 2 nama yang paling mulia lagi sangat sesuai tersebut, seraya berfirman, “Sesungguhnya Allah maha pengampun lagi maha penyayang.” Ketika kehalalan itu disyaratkan dengan 2 hal tersebut dan kondisi dalam manusia seperti ini kemungkinan tidak mengerahkan segala upayanya dalam merealisasikannya, maka Allah mengabarkan bahwasanya Dia adalah maha pengampun, Dia akan mengampuninya dari kesalahan yang terjadi dalam kondisi seperti ini khususnya, yang sesungguhnya keterpaksaan itu telah mendesaknya dan kesulitan itu telah menghilangkan segala perasaannya. Ayat ini adalah dalil untuk sebuah kaidah yang terkenal yaitu, “Kedaruratan membolehkan hal-hal yang diharamkan,” Setiap hal yang telah diharamkan sedang manusia sangat membutuhkannya (karena darurat), maka hal itu telah diperbolehkan oleh dzat yang maha memiliki lagi maha penyayang, karena itu segala pujian hanya bagiNya dan juga rasa syukur yang pertama dan yang terakhir, yang lahir maupun yang batin."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { حَرَّمَ } Harrama : Mencegah serta melarang. { ٱلۡمَيۡتَةَ } al-Maitah : Hewan yang mati tanpa disembelih (seperti dipotong bagian hidungnya sehingga mati). { وَٱلدَّمَ } Waddam : Darah yang memancar dan mengalir keluar, bukan darah yang melekat pada daging. { ٱلۡخِنزِيرِ } al-Khinzir : Babi, hewan yang sudah terkenal keburukannya. Suka makan kotoran dan tidak memiliki cemburu terhadap betinanya. { وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ } Wamaa uhilla bihi lighairillah : al-Ihlal maknanya adalah mengangkat suara dengan menyebut nama tuhan yang dijadikan persembahan dari hewan sembelihan itu. { ٱضۡطُرَّ } Idhthurra : Keadaan terdesak dan terpaksa, karena bahaya yang menimpa seperti saat kelaparan atau berkecamuk perang. { غَيۡرَ بَاغٖ وَلَا عَادٖ } Ghaira baaghin walaa ‘aadin : al-Baaghiy adalah orang yang zhalim, menyengaja mencari yang tidak halal baginya. Al-‘Aadiy adalah orang yang melanggar batas yang sudah seharusnya. { الإثم } al-Itsm : Dampak maksiat kepada diri dengan disertai kegelapan dan kesesatan. Makna ayat: Sesungguhnya Allah Ta’ala hanya mengharamkan bagi kalian makan bangkai, darah yang mengalir, daging babi, dan sembelihan yang dipersembahkan untuk selain Allah. Namun demikian, siapa saja yang mendapati kondisi darurat di tengah perjalanan dan takut bahwa dirinya akan mati, maka dia boleh makan yang haram dan tidak ada dosa untuknya. Dengan syarat bahwa kepergiaannya bukan dalam rangka bermaksiat dan mengganggu kaum muslimin. Karena Allah Ta’ala mengampuni para wali Nya yang mau bertaubat, Dialah yang maha Penyayang terhadap hamba-hamba Nya. Allah tidak akan meninggalkannya dalam keadaan sempit dan sulit. Pelajaran dari ayat: • Keharaman memakan bangkai, darah yang mengalir, daging babi, dan sembelihan yang dipersembahkan untuk selain Allah Ta’ala. • Kebolehan memakan makanan yang diharamkan (sebagaimana disebutkan) ketika keadaan darurat, seperti takut akan mati. Dengan memperhatikan syarat yang disebutkan, tidak menginginkannya dan tidak berlebih-lebihan. • Nabi shallallahu ‘’alaihi wasallam mengizinkan untuk memakan ikan dan belalang walaupun sudah menjadi bangkai. Serta mengharamkan makan hewan yang bertaring (buas) maupun bercakar (burung)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 173: Ketahuilah wahai orang-orang yang beriman sesungguhnya apa yang Allah haramkan atas kalian berbahaya bagi kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan halalnya makanan yang baik-baik selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan haramnya memakan makanan yang kotor dan membahayakan, di antaranya yang disebutkan pada ayat di atas. Yakni binatang yang mati tanpa disembelih secara syar'i. termasuk ke dalam bangkai adalah anggota badan yang dipotong dari binatang hidup ssebagaimana dalam As Sunnah, namun dikecualikan daripadanya bangkai ikan dan belalang. Yaitu darah yang mengalir sebagaimana dijelaskan di ayat yang lain. Disebutkan \"daging\" karena biasanya daging itulah yang dicari, meskipun bagian yang lain dari anggota badannya juga haram. Di samping haram memakan hewan yang disembelih dengan nama selain Allah, demikian pula diharamkan hewan yang disembeli dengan menyebut nama Allah dan menyebut pula nama selain-Nya. Termasuk diharamkan juga hewan yang disembelih untuk selain Allah, seperti untuk berhala, patung, dewa, kubur dsb. Faedah: Apa yang disebutkan di atas bukan berarti bahwa makanan yang diharamkan hanya sebatas empat makanan ini. Penyebutan empat makanan ini hanyalah untuk menerangkan beberapa contoh jenis makanan yang kotor atau khabaa'its, hal ini berdasarkan mafhum ayat sebelumnya, yaitu dari kata \"thayyibaat\"yang menunjukkan bahwa yang halal bagi kita hanyalah yang baik-baik saja. Adapun yang kotor dan membahayakan seperti bangkai, darah, daging babi dan hewan yang disembelih dengan nama selain Allah adalah haram, demikian juga makanan kotor dan membahayakan lainnya. Seperti karena lapar dan tidak ada makanan yang lainnya atau seseorang dipaksa. Dalam keadaan seperti ini, seseorang diperintahkan untuk makan, bahkan dilarang membiarkan dirinya binasa. Yakni tidak mencari yang haram padahal masih mampu mengambil yang halal atau ia tidak lapar. Yakni memakannya tidak melebihi kebutuhan menutup rasa lapar atau seukuran darurat saja tidak lebih. Makanan yang haram tadi halal ketika darurat dengan dua syarat ini \"ghaira baagiw walaa 'aad\", namun terkadang seseorang tidak dapat secara tepat melaksanakan \"ghaira baagiw walaa 'aad\", maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia Maha Pengampun, Dia mengampuni kekeliruan yang terjadi dalam kondisi ini, khususnya ketika terdesak oleh kondisi darurat dan kesadarannya tidak terkendali, wallahu a'lam. Di antara mufassirin ada yang mengartikan \"ghaira baaghiw walaa 'aad\": \"Bukan orang yang keluar dari barisan kaum muslimin mengadakan pemberontakan dan bukan orang yang melampaui batas seperti melakukan pembajakan\", sehingga mereka menafsirkan bahwa ketika darurat makanan yang haram tersebut tidak mengapa kecuali dua golongan tersebut (pemberontak dan pembajak), termasuk pula setiap orang yang bersafar karena maksiat seperti budak yang lari dari tuannya, maka tidak halal bagi mereka memakan makanan tadi ketika darurat. Inilah yang dipegang oleh Imam Syafi'i. Pembolehan memakan makanan yang haram ketika kondisi darurat merupakan rahmat Allah kepada hamba-hamba-Nya dan kelapangan dari-Nya. Oleh karena itu, ayat ini diakhiri dengan dua nama-Nya Yang Mulia yang sangat sesuai sekali, yaitu bahwa Allah Subhaanahu wa Ta'aala Maha Pengampun lagi Maha Penyayang kepada hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 173",
    "description": "Sesungguhnya dia hanya mengharamkan atasmu beberapa hal. Pertama, bangkai, yaitu binatang yang mati tidak dengan disembelih secara sah menurut ketentuan agama; kedua, darah yang aslinya mengalir, bukan limpa dan hati yang aslinya memang beku; ketiga, daging babi dan bagian tubuh babi lainnya seperti tulang, lemak, dan lainnya serta produk turunannya; dan, keempat, daging hewan yang disembelih dengan menyebut nama selain Allah, yaitu hewan persembahan untuk patung dan roh halus yang dianggap oleh orang musyrik dapat memberikan perlindungan dan keselamatan. Tetapi barang siapa terpaksa memakannya karena kalau tidak memakannya diduga menyebabkan kematian akibat kelaparan, bukan karena menginginkannya tetapi memang tidak ada makanan lain, dan tidak pula melampaui batas karena yang dimakan hanya sekadar untuk bertahan hidup, maka tidak ada dosa baginya memakan makanan yang diharamkan itu. Sungguh, Allah maha pengampun terhadap dosa yang dilakukan oleh hamba-Nya, apalagi dosa yang tidak disengaja. Allah maha penyayang kepada seluruh hamba-Nya, sehingga dalam keadaan darurat dia membolehkan memakan makanan yang diharamkan agar hamba-Nya tidak mati kelaparan. Sungguh, orang-orang yang menyembunyikan apa yang telah diturunkan Allah, yaitu kitab petunjuk yang diturunkan kepada rasul-Nya, dan menjualnya dengan harga murah, yaitu menukarnya dengan kepentingan duniawi, harta, dan kedudukan yang sifatnya sementara, maka atas perbuatan tersebut mereka hanya menelan api neraka ke dalam perutnya. Menukar kitab suci dan petunjuk yang ada di dalamnya dengan kepentingan duniawi sama halnya dengan merelakan diri untuk masuk ke neraka, dan Allah tidak akan menyapa mereka pada hari kiamat karena kemurkaan Allah atas perbuatan mereka sekaligus sebagai penghinaan untuk mereka, dan Allah tidak akan menyucikan mereka dari kotoran dosa akibat perbuatan mereka. Mereka akan mendapat azab yang sangat pedih di dalam neraka."
  }
]