[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menyembunyikan apa yang telah Allah turunkan di dalam kitab-kitab sucinya berupa keterangan tentang sifat Muhammad Shalallahu Wassalam dan tentang kebenaran lainnya, dan mereka tamak untuk mengambil imbalan yang sedikit dari kenikmatan dunia sebagai bayaran menyembunyikannya itu. maka mereka itu sebenarnya tidaklah memakan imbalan dari menyembunyikan kebenaran itu kecuali api neraka yang akan membara dalam perut mereka, dan Allah tidak akan berbicara kepada mereka pada hari kiamat karena kemarahan dan kemurkaannya kepada mereka, dan tidak menyucikan mereka dari noda dosa-dosa dan kekafiran mereka, dan bagi mereka siksaan yang menyedihkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "174. Sesungguhnya orang-orang yang menyembunyikan kitab-kitab suci yang Allah turunkan berikut isinya yang menunjukkan kebenaran dan kenabian Muhammad -ṣallallāhu 'alaihi wa sallam-, seperti yang dilakukan oleh orang-orang Yahudi dan Nasrani, demi mendapatkan sedikit imbalan, seperti jabatan, kehormatan atau kekayaan, mereka itu sejatinya tidak memakan sesuatu ke dalam perut mereka kecuali yang menyebabkan mereka terkena azab di neraka. Dan Allah tidak akan berbicara kepada mereka tentang sesuatu yang menyenangkan mereka, tetapi tentang sesuatu yang buruk bagi mereka. Allah tidak akan mensucikan dan menyanjung mereka. Dan mereka akan mendapatkan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "174. Sungguh para pendeta Yahudi dan Nasrani yang menyembunyikan kebenaran dan petunjuk serta ciri-ciri nabi Muhammad yang Allah turunkan dalam Taurat demi mendapat sedikit kenikmatan dunia, mereka tidaklah memakan harta itu melainkan harta haram yang menjerumuskan mereka ke neraka Jahannam, Allah tidak berbicara kepada mereka dengan keridhaan pada hari kiamat dan tidak membersihkan mereka dari dosa-dosa, dan bagi mereka azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "174. إِنَّ الَّذِينَ يَكْتُمُونَ (Sesungguhnya orang-orang yang menyembunyikan) Ayat ini meliputi ulama-ulama yahudi karena mereka menyembunyikan apa yang diturunkan Allah dalam Taurat berupa sifat Muhammad, dan meliputi pula semua orang yang memyembunyikan apa yang disyari’atkan Allah dan semua yang rela dengan pengubahan agama Allah dan penyembunyian kebanaran demi manfaat sesaat dan maslahat yang akan hilang. وَيَشْتَرُونَ بِهِۦ ثَمَنًا قَلِيلًا ۙ (dan menjualnya dengan harga yang sedikit (murah) ) Dan setiap orang yang melakukan ini demi kenikmatan dunia yang hakikatnya sedikit meski ia menganggapnya banyak. مَا يَأْكُلُونَ فِى بُطُونِهِمْ إِلَّا النَّارَ (mereka itu sebenarnya tidak memakan (tidak menelan) ke dalam perutnya melainkan api) Yakni wajib bagi mereka azab neraka. وَلَا يُكَلِّمُهُمُ اللَّـهُ (dan Allah tidak akan berbicara kepada mereka) Yakni disebabkan kemarahan Allah yang turun dan ketidakridhaan-Nya atas mereka. Imam Thabari berkata: yang dimaksud adalah Allah tidak berbicara dengan mereka apa yang mereka sukai, dan berbicara dengan mereka apa yang mereka benci. وَلَا يُزَكِّيهِمْ (dan tidak mensucikan mereka) Yakni tidak memperbaiki amalan buruk mereka agar menjadi bersih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174. Sesungguhnya ulama’ Yahudi yang menyembunyikan sesuatu yang diturunkan Allah dalam Taurat berupa sifat nabi Muhammad SAW dan kebenaran risalahnya. Dan setiap syariat Allah yang disembunyikan, mengambil uang suap, dan meminta ganti dari barang yang disembunyikan itu dengan kenikmatan dunia yang sedikit itu yaitu sesuatu yang mereka ambil dari para pengikut mereka. Hal itu sedikit (meskipun sebenarnya banyak) di hadapan azab akhirat. Mereka itu tidak makan kecuali sesuatu yang memasukkan mereka ke dalam neraka dan mengharuskan mereka untuk di azab. Dan Allah tidak akan berbicara dengan mereka dengan kalam yang penuh cinta keridhaan dan penuh harapan, serta tidak akan menyucikan mereka dari kotoran dari dosa-dosa atau amal yang buruk. Dan bagi mereka itu azab yang amat pedih ketika mati dan tetap atas kekufuran mereka. Ath-Thabari meriwayatkan dari Ibnu Abbas yang berkata: “Ayat ini dan ayat ke 77 dari surah Ali Imran itu diturunkan untuk orang Yahudi.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang menyembunyikan apa yang telah diturunkan Allah, yaitu kitab (Taurat), dan menjualnya dengan harga murah} dengan sesuatu yang enteng {mereka itu hanya menelan api neraka ke dalam perutnya. Allah tidak akan menyapa mereka pada hari Kiamat dan tidak akan menyucikan mereka} menyisihkan mereka {dan bagi mereka itu azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "174-175. Ini merupakan ancaman keras terhadap orang yang menyembunyikan apa yang telah diturunkan oleh Allah kepada rasul rasulNya dari ilmu yang telah diambil ikatan janji oleh Allah atas para ulama agar menjelaskan ilmu itu kepada manusia dan tidak menyembunyikannya. Maka barangsiapa yang menggantikannya dengan tujuan-tujuan duniawi lalu mencampakan perintah Allah, maka orang-orang itu “sebenarnya tidak memakan (tidak menelan) ke dalam perutnya melainkan api,” karena harga yang mereka dapatkan itu mereka peroleh dengan jalan pencaharian yang paling jelek dan paling diharamkan, maka balasan mereka adalah sejenis dengan perbuatan mereka, “dan Allah tidak akan berbicara kepada mereka pada hari kiamat,” bahkan Allah murka kepada mereka dan berpaling dari mereka dan ini lebih besar bagi mereka daripada siksa neraka, “dan tidak menyucikan mereka,” maksudnya, tidak menyucikan mereka dari akhlak akhlak yang hina, mereka tidak memiliki perbuatan-perbuatan yang pantas untuk dipuji, diridhai dan diberi pahala, mereka tidak disucikan karena mereka melakukan perbuatan yang menjadi sebab tidak adanya penyucian, yang mana penyebab-penyebabnya paling besarnya adalah mengamalkan kitabullah, mengambil petunjuk darinya dan berdakwah kepadanya, namun mereka malah mencampakan kitabullah, berpaling darinya, dan mereka lebih memilih kesesatan daripada petunjuk dan lebih memilih adab daripada ampunan. Maka tidaklah patut bagi mereka kecuali neraka, lalu bagaimana mereka dapat bersabar padanya? dan bagaimana ketegaran mereka didalamnya?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يَكۡتُمُونَ } Yaktumuna : Menolak dan menyembunyikan { مَآ أَنزَلَ ٱللَّهُ مِنَ ٱلۡكِتَٰبِ } Maa anzalallahu minal kitab : Kitab Taurat yang berisikan sifat dan karakter nabi Muhammad ﷺ serta perintah untuk beriman kepadanya. { وَلَا يُكَلِّمُهُمُ ٱللَّهُ } Walaa yukallimuhumullah : Allah tidak akan mengajaknya berbicara karena kemurkaan dan laknatNya kepada mereka. { وَلَا يُزَكِّيهِمۡ } Walaa yuzakkihim : Tidak menyucikannya dari dosa-dosa disebabkan Allah tidak ridha terhadap mereka. Makna ayat : Tiga ayat berikut ini (ayat 174, 175, 176) turun kepada para rahib dari kalangan ahli kitab. Mengecam perbuatan mereka dan memperlihatkan bagaimana balasan yang akan mereka dapatkan karena menyembunyikan kebenaran, serta apa yang mereka lakukan dengan menjual ilmu yang mereka terima, dimana seharusnya mereka sampaikan dengan harta dunia yang hina dina. Mereka mengingkari perkara tentang Nabi Muhammad ﷺ dan agama yang dibawanya, untuk mengais keridhaan masyarakat awam. Agar tidak terputus bantuan harta dan hadiah yang mereka dapatkan, dan tetap melanggengkan kekuasaan rohani yang mereka miliki. Inilah makna dari firman Allah Ta’ala,”Sesungguhnya orang-orang yang menyembunyikan apa yang Allah turunkan berupa kitab dan menjualnya dengan harga yang sedikit (murah)”. Kemudian Allah Ta’ala mengabarkan bahwa harta sogokan yang mereka makan dalam perut sejatinya itu adalah api neraka yang menyulut kemarahan Allah al-Jabbar. Maka Allah tidak mengajak berbicara mereka dan tidak menyucikannya, dan mereka akan mendapat adzab yang pedih. Pelajaran dari ayat : • Keharaman menyembunyikan kebenaran, walaupun untuk mendapatkan manfaat duniawi seperti harta atau kepemimpinan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 174: Allah mengabarkan bahwasannya mereka yang takut dengan apa yang Allah turunkan dari kebenaran mereka mengambil keuntungan yang sedikit; Allah jadikan dalam perut mereka api karena sebab apa yang mereka telah makan dari harta haram dan Allah tidak berbicara kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan ancaman keras bagi mereka yang menyembunyikan apa yang diturunkan Allah kepada rasul-rasul-Nya berupa ilmu. Padahal Allah Subhaanahu wa Ta'aala telah mengambil perjanjian dari mereka agar menerangkan kepada manusia dan tidak menyembunyikannya. Barangsiapa yang menukar semua itu dengan mengambil ganti dari perhiasan dunia yang rendah ini, maka sebenarnya yang mereka ambil dan mereka makan adalah api neraka. Seperti yang dilakukan orang-orang yahudi, mereka enyembunyikan sifat Nabi Muhammad shallallahu 'alaihi wa sallam dalam al kitab serta menyembunyikan kebenaran-kebenaran lainnya. Yakni untuk memperoleh harta dunia yang rendah ini, mereka rela menyembunyikan kebenaran. Yakni karena murka kepada mereka dan berpaling dari mereka. Hal ini akan terasa lebih berat bagi mereka dari azab neraka yang mereka terima. Maksudnya: tidak menyucikan mereka dari dosa-dosa dan dari akhlak yang buruk. Allah Subhaanahu wa Ta'aala tidak menyucikan mereka, karena mereka tidak mengerjakan perbuatan yang menjadi sebab dibersihkannya diri mereka, seperti mengamalkan kitab Allah, menjadikannya sebagai petunjuk dan mendakwahkannya. Mereka membuang kitab Allah dan berpaling daripadanya serta memilih kesesatan daripada petunjuk dan azab daripada ampunan, maka tidak ada yang pantas untuk mereka selain neraka, dan mengapa mereka siap bersabar menghadapi neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 174",
    "description": "Sungguh, orang-orang yang menyembunyikan apa yang telah diturunkan Allah, yaitu kitab petunjuk yang diturunkan kepada rasul-Nya, dan menjualnya dengan harga murah, yaitu menukarnya dengan kepentingan duniawi, harta, dan kedudukan yang sifatnya sementara, maka atas perbuatan tersebut mereka hanya menelan api neraka ke dalam perutnya. Menukar kitab suci dan petunjuk yang ada di dalamnya dengan kepentingan duniawi sama halnya dengan merelakan diri untuk masuk ke neraka, dan Allah tidak akan menyapa mereka pada hari kiamat karena kemurkaan Allah atas perbuatan mereka sekaligus sebagai penghinaan untuk mereka, dan Allah tidak akan menyucikan mereka dari kotoran dosa akibat perbuatan mereka. Mereka akan mendapat azab yang sangat pedih di dalam neraka. Mereka yang menyembunyikan isi kitab suci itulah yang membeli kesesatan dengan petunjuk, yaitu menukar petunjuk yang berasal dari Allah melalui rasul-Nya dengan kepentingan duniawi karena mengikuti hawa nafsu, dan menukar azab dengan ampunan, yakni lebih memilih azab neraka daripada ampunan Allah. Maka alangkah beraninya mereka menentang api neraka, padahal mereka tidak akan sanggup menahan siksa neraka yang sangat pedih dan menyakitkan!"
  }
]