[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berkarakter dengan sifat-sifat ini mereka telah menukarkan hidayah dengan kesesatan dan ampunan Allah dengan siksaan Nya. Maka alangkah beraninya mereka menentang api neraka dengan tindakan melakukan perbuatan-perbuatan para penghuni neraka!! Allah heran dengan keberanian mereka melakukan perbuatan itu, maka heranlah kalian –wahai manusia- dari keberanian mereka ini, dan “kesabaran” mereka atas siksaan api neraka dan tempat tinggal mereka di sana. Ini merupakan bentuk penghinaan kepada mereka dan menganggap remeh dengan urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Orang-orang yang menyembunyikan ilmu yang dibutuhkan manusia itu adalah orang-orang yang menukar petunjuk dengan kesesatan tatkala mereka menyembunyikan ilmu yang benar. Mereka juga menukar ampunan dengan siksa Allah. Alangkah sabarnya mereka melakukan sesuatu yang akan menyebabkan mereka masuk ke dalam neraka, seolah-olah mereka tidak peduli dengan siksaan yang ada di dalamnya akibat kesabaran mereka yang luar biasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "175. اشْتَرَوُا۟ الضَّلٰلَةَ بِالْهُدَىٰ (orang-orang yang membeli kesesatan dengan petunjuk) Telah dijelaskan makna potongan ayat ini pada surat Al-Baqarah:16 فما أصبرهم على النار (Maka alangkah beraninya mereka menentang api neraka! ) Ini adalah kalimat takjub dari para makhluk atas keadaan orang-orang yang melakukan perbuatan yang menjadi sebab-sebab mereka masuk neraka; seakan-akan dengan sebab-sebab itu mereka adalah orang-orang yang sabar atas siksaan di naraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "175. Sesungguhnya orang-orang yang menyembunyikan ayat-ayat yang diturunkan oleh Allah itu adalah orang-orang yang membeli kesesatan dengan hidayah di dunia, dan ampunan dengan siksa di akhirat. Alangkah beraninya mereka menantang azab neraka dengan menyembunyikan kebenaran dan mengingkari risalah nabi Muhammad SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah yang membeli kesesatan dengan petunjuk dan azab dengan ampunan. Maka alangkah beraninya mereka menentang api neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "174-175. Ini merupakan ancaman keras terhadap orang yang menyembunyikan apa yang telah diturunkan oleh Allah kepada rasul rasulNya dari ilmu yang telah diambil ikatan janji oleh Allah atas para ulama agar menjelaskan ilmu itu kepada manusia dan tidak menyembunyikannya. Maka barangsiapa yang menggantikannya dengan tujuan-tujuan duniawi lalu mencampakan perintah Allah, maka orang-orang itu “sebenarnya tidak memakan (tidak menelan) ke dalam perutnya melainkan api,” karena harga yang mereka dapatkan itu mereka peroleh dengan jalan pencaharian yang paling jelek dan paling diharamkan, maka balasan mereka adalah sejenis dengan perbuatan mereka, “dan Allah tidak akan berbicara kepada mereka pada hari kiamat,” bahkan Allah murka kepada mereka dan berpaling dari mereka dan ini lebih besar bagi mereka daripada siksa neraka, “dan tidak menyucikan mereka,” maksudnya, tidak menyucikan mereka dari akhlak akhlak yang hina, mereka tidak memiliki perbuatan-perbuatan yang pantas untuk dipuji, diridhai dan diberi pahala, mereka tidak disucikan karena mereka melakukan perbuatan yang menjadi sebab tidak adanya penyucian, yang mana penyebab-penyebabnya paling besarnya adalah mengamalkan kitabullah, mengambil petunjuk darinya dan berdakwah kepadanya, namun mereka malah mencampakan kitabullah, berpaling darinya, dan mereka lebih memilih kesesatan daripada petunjuk dan lebih memilih adab daripada ampunan. Maka tidaklah patut bagi mereka kecuali neraka, lalu bagaimana mereka dapat bersabar padanya? dan bagaimana ketegaran mereka didalamnya?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلضَّلَٰلَةَ } Adh-Dholalah : Kebutaan yang menghalangi datangnya hidayah menuju kebenaran. Makna ayat: Pada ayat 175 Allah Ta’ala mengabarkan bahwa mereka itulah orang-orang yang melenceng jauh, karena telah menjual hidayah dan membeli kesesatan, yaitu membeli kekafiran dengan imannya, dan membeli azab Allah dengan ampunan dariNya. Begitu beraninya mereka bermaksiat kepada Allah Ta’ala, yang akhirnya mereka termasuk penghuni neraka. Oleh karena itu Allah Ta’ala berfirman,”Betapa beraninya mereka menentang api neraka.” Dengan semua ini sempurnalah ancaman yang Allah berikan kepada mereka orang kafir, karena Allah Ta’ala menurunkan Al-Kitab yang berisi kebenaran, menjelaskan jalan petunjuk yang mengantarkan kepda kenikmatan abadi (surga), dan menerangkan jalan kesesatan yang mengantarkan kepada kemurkaan Allah dan adzabNya yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 175: Allah mengabarkan bahwasannya mereka orang-orang yang kafir yang menyembunyikan ayat-ayat Allah telah memilih kesesatan diatas petunjuk dan memilih azab di neraka diatas ampunan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 175",
    "description": "Mereka yang menyembunyikan isi kitab suci itulah yang membeli kesesatan dengan petunjuk, yaitu menukar petunjuk yang berasal dari Allah melalui rasul-Nya dengan kepentingan duniawi karena mengikuti hawa nafsu, dan menukar azab dengan ampunan, yakni lebih memilih azab neraka daripada ampunan Allah. Maka alangkah beraninya mereka menentang api neraka, padahal mereka tidak akan sanggup menahan siksa neraka yang sangat pedih dan menyakitkan! yang demikian itu karena Allah telah menurunkan kitab Al-Qur'an dengan membawa kebenaran, tetapi mereka berselisih paham tentang kebenaran informasi kitab Al-Qur'an, sehingga ada yang menolak isinya secara keseluruhan dan ada yang menolak sebagian isinya dan menerima sebagian yang lain. Dan sesungguhnya orang-orang yang berselisih paham tentang kebenaran informasi kitab itu, sesungguhnya mereka dalam perpecahan dan penyimpangan yang jauh dari kebenaran."
  }
]