[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siksaan yang mereka dapatkan itu lantaran Allah ta'ala telah menurunkan kitab kitab sucinya kepada rasul-rasul Nya yang meliputi kebenaran yang nyata, lalu mereka malah kafir kepadanya. Dan sesungguhnya orang-orang yang berselisih tentang kebenaran Alkitab (Alquran) dengan mengimani sebagian isinya dan kafir kepada sebagian yang lainnya, mereka benar-benar dalam pembangkangan dan sikap pemisahan diri yang jauh dari jalan lurus dan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "176. Itulah balasan atas tindakan menyembunyikan ilmu dan petunjuk, karena Allah menurunkan kitab-kitab suci itu dengan kebenaran. Dan ini seharusnya diterangkan, dan bukan disembunyikan. Sesungguhnya orang-orang yang berselisih tentang kitab-kitab suci itu dengan mempercayai sebagian isinya dan menyembunyikan sebagian lainnya, mereka itu benar-benar berada dalam pertengkaran dan pertikaian yang jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "176. Azab tersebut karena Allah menurunkan kitab-kitab-Nya yang mengandung kebenaran kepada para rasul namun mereka mengubah kitab-kitab itu. Dan orang-orang Yahudi dan Nasrani saling berselisih, mereka beriman kepada sebagian kitab dan ingkar terhadap sebagian lainnya. Mereka berada dalam perselisihan yang jauh dari kebenaran dan dalam permusuhan yang jelas terhadap orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "176. ذٰلِكَ بِأَنَّ اللَّـهَ نَزَّلَ الْكِتٰبَ بِالْحَقِّ ۗ (Yang demikian itu adalah karena Allah telah menurunkan Al Kitab dengan membawa kebenaran) Maka para ulama harus menjelaskan kitab ini dan tidak menyembunyikannya ketika mereka ditanya atau ketika terjadi suatu hal yang melazimkannya untuk menjelaskan. وَإِنَّ الَّذِينَ اخْتَلَفُوا۟ فِى الْكِتٰبِ (dan sesungguhnya orang-orang yang berselisih tentang (kebenaran) Al Kitab itu) Yakni sebagian mereka mengatakan bahwa kitab ini adalah sihir dan sebagian lain mengatakan ini adalah dongeng-dongeng orang terdahulu. لَفِى شِقَاق (benar-benar dalam penyimpangan) Yakni dalam perselisihan dan permusuhan dengan Allah. بَعِيدٍ (yang jauh) Yakni jauh dari kebenaran,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "176. Azab itu diakibatkan karena Allah sudah menurunkan Taurat dengan kebenaran yang pasti dan hujjah yang mutlak, lalu mereka menyembunyikan dan menyimpang darinya. Sesungguhnya orang-orang yang berselisih tentang kitab Allah, yaitu beriman kepada sebagian isinya dan mengingkari sebagian lainnya, atau menggambarkannya sebagai sihir atau cerita legenda. Sungguh mereka itu menyimpang jauh dari kebenaran dan hidayah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena sesungguhnya Allah telah menurunkan kitab suci dengan hak. Sesungguhnya orang-orang yang berselisih paham tentang kitab suci itu benar-benar dalam perpecahan yang jauh} perselisihan yang jauh dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "176. “Yang demikian itu,” yakni telah disebutkan, yaitu pembalasannya dengan adil dan pencegahan Allah dari sebab-sebab hidayah bagi orang yang enggan memilih nya dan lebih memilih selain darinya, “adalah karena Allah telah menurunkan Alkitab dengan membawa kebenaran,” dan termasuk kebenaran adalah membalas orang yang berbuat baik dengan kebaikan dan membalas orang yang berbuat buruk dengan keburukan. Demikian juga dalam FirmanNya, “Allah telah menurunkan Alkitab dengan membawa kebenaran” terdapat dalil yang menunjukkan bahwa Allah menurunkan untuk memberikan Hidayah kepada makhlukNya dan menerangkan kebenaran dari kebatilan dan petunjuk dari kesesatan, dan barangsiapa yang menyimpangkan dari maksud awalnya, maka pantaslah atasnya hukuman yang paling keras. “Dan sesungguhnya orang-orang yang berselisih tentang kebenaran Alkitab itu benar-benar dalam penyimpangan yang jauh,” Maksudnya, bahwa orang-orang yang berselisih tentang Alkitab, beriman dengan sebagiannya, dan ingkar kepada sebagiannya dan orang-orang yang merubahnya serta menyelewengkannya menurut hawa nafsu dan tujuan mereka, “benar-benar dalam penyimpangan,” yakni penyelewengan “yang jauh” dari kebenaran, karena mereka telah menyelisihi Alkitab yang datang dengan kebenaran dan pasti serasi dan tidak bertolak belakang, lalu kacaulah kondisi mereka dan banyaklah perselisihan mereka, yang akhirnya mengakibatkan perpecahan. Berbeda dengan ahli kitab yang beriman kepadanya dan menjadikannya sebagai Hakim dalam segala urusan, mereka saling sepakat dan mereka memiliki kebersamaan dengan cinta, saling berkumpul di atasnya. Ayat ini mengandung Ancaman bagi orang-orang yang menyembunyikan apa yang telah diturunkan oleh Allah dan orang-orang yang mendahulukan tujuan-tujuan duniawi dengan siksaan dan kemurkaan, dan bahwasanya Allah tidak menyucikan mereka dengan taufikNya dan tidak pula dengan ampunanNya. Ayat ini juga menyebutkan sebab kenapa mereka mendahulukan kesesatan daripada petunjuk, yang mengakibatkan mereka memilih siksaan daripada ampunan, kemudian ungkapan iba untuk mereka dengan keberanian mereka yang besar terhadap api neraka karena pengetahuan mereka tentang penyebab yang mereka lakukan yang menjerumuskan mereka ke dalam neraka tersebut, dan bahwa kita meliputi kebenaran yang mengharuskan untuk disepakati dan tidak diperselisihkan, dan bahwa setiap orang yang menyelisihinya, maka ia berada jauh sekali dari kebenaran, pertentangan, dan perseteruan. wallahualam"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { شِقَاقِۢ } Asy-Syiqaaq : Permusuhan dan perselisihan sampai menjadikan pelakunya di antara dua sisi yang berbeda. { بَعِيدٖ } Ba’iid : Sulit untuk berhenti dan berdamai sesudah itu. Makna ayat: Pada ayat 176 Allah Ta’ala memberitakan bahwa orang-orang yang berselisih mengenai al-Kitab yaitu Taurat dan Injil, yaitu mereka orang-orang Yahudi dan Nasrani akan berada dalam permusuhan dan perselisihan di antara mereka, tanpa bisa berhenti dan berdamai setelahnya. Maha benar Allah dalam firmanNya. Hingga hari ini Yahudi dan Nasrani masih saja berselisih dan bermusuhan, sebagai akibat dari penyelisihan mereka terhadap kebenaran yang diturunkan Allah serta perintah untuk mereka agar mengambilnya sebagai pedoman hidup. Kemudian mereka meninggalkannya dan memilih kebathilan, sehingga membuahkan perselisihan yang amat jauh. Pelajaran dari ayat: • Peringatan untuk ulama Islam agar tidak mengikuti jejak para ulama ahli kitab yang menyembunyikan kebenaran, serta memberikan fatwa bathil kepada manusia untuk memperoleh manfaat duniawi tertentu. • Peringatan agar tidak berselisih terhadap al-Qur’anul Karim yang menyebabkan permusuhan dan perselisihan yang jauh di antara kaum muslimin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 176: Allah menjelaskan bahwasannya azab ini karena sebab kekafiran mereka dengan apa yang Allah turunkan kepada para utusanNya dari kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Azab yang demikian itu disebabkan karena Allah Subhaanahu wa Ta'aala telah menurunkan kitab kepada rasul-rasul-Nya yang berisikan kebenaran, namun mereka mengingkarinya. Dalam ayat ini dijelaskan bahwa Allah Subhaanahu wa Ta'aala menurunkan kitab sebagai hidayah (petunjuk) bagi manusia dan untuk menerangkan mana yang hak dan mana yang batil serta menerangkan mana petunjuk dan mana kesesatan. Oleh karena itu, barangsiapa yang mengalihkannya dari tujuan tersebut, maka ia berhak mendapatkan azab yang besar. Sebagian kitab itu mereka imani dan sebagian lagi mereka ingkari. Mereka yang melakukan hal ini adalah orang-orang yahudi. Ada pula yang berpendapat bahwa yang melakukan hal tersebut adalah orang-orang musyrik, di mana mereka berselisih tentang Al Qur'an; di antara mereka ada yang menyebutnya sebagai sya'ir, ada yang menyebutnya sebagai sihir dan ada yang menyebutnya sebagai perdukunan. Hal itu dikarenakan mereka menyelisihi kitab yang Allah turunkan. Kitab itu datang membawa kebenaran dan mempersatukan mereka. Jika mereka menyelisihinya, maka sesungguhnya mereka benar-benar dalam perpecahan dan perselisihan yang jauh dari kebenaran. Dari beberapa ayat di atas (ayat 174-176) dapat ditarik kesimpulan: - Ancaman bagi mereka yang menyembunyikan apa yang diturunkan Allah Subhaanahu wa Ta'aala karena memilih perhiasan dunia berupa azab, kemurkaan dari-Nya, tidak akan disucikan oleh Allah Azza wa Jalla, oleh karenanya mereka tidak memperoleh taufiq dan ampunan karena telah menjual petunjuk dengan kesesatan. - Kitab yang Allah turunkan berisikan kebenaran yang dapat menyatukan manusia di atasnya dan menjadikan mereka tidak berpecah belah. - Setiap orang yang menyelisihi kitab tersebut, maka ia berada jauh dari kebenaran serta berada dalam perselisihan dan pertengkaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 176",
    "description": "Yang demikian itu karena Allah telah menurunkan kitab Al-Qur'an dengan membawa kebenaran, tetapi mereka berselisih paham tentang kebenaran informasi kitab Al-Qur'an, sehingga ada yang menolak isinya secara keseluruhan dan ada yang menolak sebagian isinya dan menerima sebagian yang lain. Dan sesungguhnya orang-orang yang berselisih paham tentang kebenaran informasi kitab itu, sesungguhnya mereka dalam perpecahan dan penyimpangan yang jauh dari kebenaranayat ini menjelaskan bahwa kebajikan itu bukanlah menghadapkan wajahmu ke arah timur dan ke barat, yaitu salat tanpa dibarengi kekhusyukan dan keikhlasan, karena menghadapkan hal itu bukanlah pekerjaan yang susah. Tetapi kebajikan yang sesungguhnya itu ialah pada hal-hal sebagai berikut. Kebajikan orang yang beriman kepada a) Allah dan tidak menyekutukan-Nya dengan apa pun; b) hari akhir yaitu hari pembalasan segala amal perbuatan selama di dunia, sehingga mendorong manusia untuk selalu berbuat baik; c) malaikat-malaikat yang taat menjalankan perintah Allah dan tidak pernah berbuat maksiat sehingga mendorong manusia untuk meneladani ketaatannya; d) kitab-kitab yang diturunkan kepada para rasul; e) dan nabi-nabi yang selalu menyampaikan kebenaran meskipun banyak yang memusuhinya. Kebajikan orang yang memberikan harta yang dicintainya kepada kerabat yang kurang mampu, anak yatim, karena mereka sudah kehilangan orang tua, sehingga setiap orang beriman patut memberikan kebaikan kepada mereka, orang-orang miskin yang hidupnya serba kekuarangan dalam memenuhi kebutuhan sehari-hari, orang-orang yang dalam perjalanan atau musafir yang kehabisan bekal perjalanan, peminta-minta untuk meringankan penderitaan dan kekurangannya, dan untuk memerdekakan hamba sahaya yang timbul akibat praktik perbudakan. Kebajikan orang yang melaksanakan salat dengan khusyuk dan memenuhi syarat dan rukunnya, menunaikan zakat sesuai ketentuan dan tidak menunda-nunda pelaksanaannya, orang-orang yang menepati janji apabila berjanji dan tidak pernah mengingkarinya, orang yang sabar dalam kemelaratan, penderitaan, dan pada masa peperangan dengan segala kesengsaraan, kepedihan dan berbagai macam kekurangan. Orang yang mempunyai sifat-sifat ini, mereka itulah orang-orang yang benar keimanannya, dan mereka itulah orang-orang yang bertakwa kepada Allah."
  }
]