[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah kebajikan di sisi Allah ta'ala itu dengan menghadap ke arah timur dan barat di dalam sholat, bila tidak berdasarkan perintah Allah dan syariat Nya. akan tetapi kebajikan yang sepenuhnya adalah perbuatan orang yang beriman kepada Allah dan mengimani Nya sebagai Tuhan yang berhak disembah tanpa menyekutukan sesuatu dengan Nya, dan beriman kepada hari kebangkitan dan pembalasan, dan kepada seluruh malaikat, dan kepada semua kitab-kitab yang diturunkan, dan beriman kepada seluruh Nabi tanpa membeda-bedakan, dan memberikan hartanya secara sukarela (meskipun sangat besar kecintaannya pada harta tersebut) kepada kaum kerabat, anak-anak yatim yang membutuhkan bantuan yang telah ditinggal mati oleh ayah-ayah mereka ketika mereka belum mencapai usia baligh, dan kepada orang-orang miskin yang tidak memiliki sesuatu yang mencukupi dan menutupi kebutuhan mereka,dan kepada orang-orang musafir yang terlilit kebutuhan yang jauh dari keluarga dan hartanya, dan kepada mereka para peminta-minta yang terpaksa meminta-minta karena keterdesakan kebutuhan mereka, dan mengeluarkan hartanya dalam membebaskan budak dan tawanan, mendirikan shalat, dan membayar zakat yang wajib, dan orang-orang yang menepati janji janji, dan orang-orang yang bersabar dalam kondisi kemiskinan dan sakit mereka,dan dalam peperangan yang berkecamuk keras. Maka orang-orang yang berkarakter demikian itulah orang-orang yang benar dalam keimanan mereka, dan mereka itulah orang-orang yang takut terhadap siksaan Allah sehingga mereka menjauhi perbuatan maksiat-maksiat kepada Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "177. Kebaikan yang diridai Allah bukanlah sekedar menghadap ke arah timur atau barat dan bersengketa tentang hal itu. Tetapi kebaikan yang sesungguhnya ialah mempercayai Allah sebagai Tuhan Yang Maha Esa, mempercayai adanya hari kiamat, mempercayai seluruh Malaikat, mempercayai semua kitab suci yang diturunkan oleh Allah, mempercayai semua Nabi tanpa membeda-bedakan antara mereka, memberikan harta -meskipun harta itu sangat disukai dan disayangi- kepada karib kerabat, anak-anak yatim, orang-orang miskin, orang asing yang kehabisan bekal di perjalanan yang jauh dari keluarga dan kampung halamannya, dan kepada orang yang sangat membutuhkan harta sehingga terpaksa harus meminta-minta kepada sesama manusia, menggunakan harta untuk memerdekakan budak atau membebaskan tawanan perang, mendirikan salat secara sempurna sesuai dengan apa yang diperintahkan oleh Allah , menunaikan zakat yang wajib, dan orang-orang yang menepati janjinya ketika berjanji, dan orang-orang yang sabar dalam menghadapi kemiskinan, kesulitan hidup, menderita penyakit, dan menghadapi musuh di medan perang sehingga tidak melarikan diri, mereka yang memiliki ciri-ciri tersebut adalah orang-orang yang sungguh-sungguh di dalam keimanan dan amal perbuatan mereka. Mereka itulah orang-orang bertakwa yang melaksanakan perintah-perintah Allah dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "177. Amalan baik tidaklah terbatas pada shalat menghadap ke timur atau barat saja, namun amalan kebaikan adalah beriman kepada Allah, hari kiamat, para malaikat, kitab-kitab Allah, dan semua rasul tanpa membeda-bedakan; memberikan harta yang dicintai kepada para kerabat, anak-anak yatim, orang-orang miskin, musafir yang kehabisan bekal, orang yang meminta pertolongan, dan budak yang ingin menebus dirinya dari perbudakan; mendirikan shalat pada waktunya; membayar zakat kepada yang berhak menerimanya; menepati janji; serta bersabar dalam menghadapi kemiskinan, penyakit, dan kecamuk peperangan. Orang-orang yang memiliki ciri-ciri tersebut akan mendapat derajat yang tinggi, mereka adalah orang-orang yang membuktikan keimanannya dengan perkataan dan perbuatan yang takut terhadap siksaan Allah. Syeikh as-Syinqithi berkata: \"Dalam ayat ini Allah tidak menjelaskan makna {البأس} namun Allah menyebutkan dalam ayat lain bahwa yang dimaksud adalah peperangan sebagaimana tersirat dari redaksi ayat, Allah berfirman: قَدْ يَعْلَمُ اللّٰهُ الْمُعَوِّقِيْنَ مِنْكُمْ وَالْقَاۤىِٕلِيْنَ لِاِخْوَانِهِمْ هَلُمَّ اِلَيْنَا ۚوَلَا يَأْتُوْنَ الْبَأْسَ اِلَّا قَلِيْلًاۙ Sungguh, Allah mengetahui orang-orang yang menghalang-halangi di antara kamu dan orang yang berkata kepada saudara-saudaranya, “Marilah bersama kami.” Tetapi mereka datang berperang hanya sebentar. (al-Ahzab: 18)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "177. لَّيْسَ الْبِرَّ (Bukanlah suatu kebajikan) Ayat ini turun sebagai bantahan terhadap orang-orang Yahudi dan Nasrani ketika mereka berlarut-larut dalam percakapan masalah pemindahan kiblat Rasulullah menuju Ka’bah. قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ (menghadapkan wajahmu ke arah timur dan barat) Yakni arah yang berlainan. وَلٰكِنَّ الْبِرَّ مَنْ ءَامَنَ (akan tetapi sesungguhnya kebajikan itu ialah beriman kepada Allah) Yakni akan tetapi kebajikan adalah kebajikan yang dilakukan oleh orang yang beriman. Dan (البر) merupakan kata yang mencakup segala bentuk kebajikan, dan aku menafsirkan ayat ini dengan enam asas-asas iman dan asas-asas amal kebaikan. وَالْكِتٰبِ (dan kitab-kitab) Yang dimaksud dengan kitab disini adalah semua jenis kitab Allah. عَلَىٰ حُبِّهِۦ (yang dicintainya) Yakni padahal ia cinta terhadap harta tersebut, jadi dia menginfakkan hartanya meski dia mencintainya dan merasa ingin bakhil atasnya. ذَوِى الْقُرْبَىٰ (kepada kerabatnya) Yakni para kerabat, karena infak kepada mereka bernilai pahala sedekah dan silaturrahim jika mereka termasuk fakir. وَالْيَتٰمَىٰ (anak-anak yatim) Dan anak yatim yang fakir lebih berhak mendapat sedekah dari pada anak yatim yang tidak fakir karena mereka tidak mampu untuk mencari penghasilan. وَالْمَسٰكِينَ (orang-orang miskin) Orang miskin adalah orang yang bergantung pada apa yang ada dalam genggaman orang lain, karena ia tidak memiliki apapun. وَابْنَ السَّبِيلِ (musafir) Yakni musafir yang kehabisan bekal di daerah orang lain. وَالسَّآئِلِينَ (orang-orang yang meminta-minta) Yakni orang yang meminta-minta karena keadaan yang memaksa mereka. وَفِى الرِّقَابِ (hamba sahaya) Yang dimaksud adalah dengan membeli budak sahaya untuk dimerdekakan. Dan pendapat lain mengatakan: yakni membebaskan tawanan. وَءَاتَى الزَّكَوٰةَ (dan menunaikan zakat) Dalam ayat ini terdapat isyarat bahwa yang duluan kita keluarkan adalah sedekah dan bukan zakat. وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عٰهَدُوا۟ ۖ (dan orang-orang yang menepati janjinya apabila ia berjanji) Yakni perjanjian dengan Allah ataupun dengan manusia. الْبَأْسَآءِ (dalam kesempitan) Yakni kesulitan hidup dan kemiskinan. وَالضَّرَّآءِ (penderitaan) Yakni penyakit dan penuaan. وَحِينَ الْبَأْسِ ۗ (dan dalam peperangan) Yakni saat peperangan berkecamuk. صَدَقُوا۟ ۖ (orang-orang yang benar (imannya) ) Yakni mereka adalah orang-orang yang benar-benar dan sungguh-sungguh dalam pengakuan mereka sebagai orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Qurthubi mengatakan : \"Ulama-ulama kita berkata : inilah ayat yang agung yang mencakup banyak hukum-hukum syari'at; didalamnya terkandung enam belas qo'idah : Iman kepada Allah dan nama-nama dan sifat-Nya, hari kebangkitan, hari berkumpul, hari perhitungan, shirot, haudh, syafa'ah, surga, neraka, dan juga mengandung tentang Malaikat, kitab-kitab yang diturunkan, infaq, menyambung kekerabatan, berbuat baik kepada anak yatim dan orang miskin, dan berbuat baik kepada orang yang sedang dalam perjalanan, kewajiban mendirikan shalat dan membayar zakat, kewajiban menepati janji, dan sabar atas segala cobaan. Dan setiap qo'odah-qo'idah ini membutuhkan penjelasan yang lebih rinci dalam buku khusus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "177. Tidaklah kebaikan yang banyak itu ketika menghadap ke arah timur dan barat saja, melainkan mengimani 6 rukun iman dan mengerjakan pokok-pokok amal shalih. Yang dimaksud dengan kitab di sini adalah berbagai jenis kitab, yaitu kitab-kitab Allah, memberikan harta yang disenanginya kepada kerabatnya. Sesungguhnya memberi harta kepada mereka ketika fakir itu merupakan sedekah dan penyambung hubungan, memberikan harta kepada anak-anak yatim yang fakir (yang kehilangan bapak mereka di masa kecil), orang-orang miskin yang tidak memiliki harta yang cukup untuk memenuhi kebutuhan mereka, musafir yang berhenti di tengah perjalanan dari negeri mereka, orang-orang yang meminta-minta: yaitu orang-orang yang meminta uang karena kebutuhan dan keterdesakan mereka, untuk membeli budak dan melepaskan tawanan, mendirikan shalat dengan rukun dan syaratnya, menunaikan zakat wajib untuk orang-orang yang berhak menerimanya disertai dengan sedekah sukarela, menepati janji-janji Allah dan manusia, memberikan penghormatan kepada orang-orang yang sabar atas penderitaan, kefakiran, sakit, dan kesulitan dengan kehilangan keluarga, harta dan anak. Mereka itu adalah orang-orang yang benar keimanannya dan bertakwa kepada Tuhan dengan mengerjakan perintah-perintahNya dan menjauhi larangan-laranganNya, serta menjauhi neraka. Abdur Razaq meriwayatkan dari Qatadah yang berkata: “Orang-orang Yahudi shalat menghadap ke arah barat dan orang Nasrani shalat menghadap ke arah timur. Lalu turunlah ayat {Laisal birru}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kebajikan itu bukanlah} kebaikan yang diridhai Allah itu {menghadapkan wajah kalian ke arah timur dan barat, melainkan kebajikan itu ialah orang yang beriman kepada Allah, hari akhir, para malaikat, kitab suci, dan para nabi; memberikan harta yang dicintainya kepada kerabat, anak yatim, orang miskin, musafir} musafir yang terpisah dari keluarganya {peminta-minta, dan hamba sahaya} dan membebaskan hamba sahaya dari perbudakan dan tawanan {mendirikan salat; menunaikan zakat; menepati janji apabila berjanji; sabar dalam kemelaratan} kesulitan dan kefakiran {penderitaan} penyakit {dan pada masa peperangan} beratnya peperangan {Mereka itulah orang-orang yang benar dan mereka itulah orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "177. Allah berfirman, “Bukankah menghadapkan wajahmu ke arah timur dan barat itu suatu kebajikan,” maksudnya, hal itu bukanlah suatu kebajikan yang dimaksudkan dari hamba, sehingga banyaknya pembahasan dan perdebatan tentangnya adalah merupakan usaha yang melelahkan yang tidak menghasilkan kecuali perpecahan dan perselisihan. Ini sejalan dengan Rasulullah : “Bukanlah orang yang perkasa itu adalah dengan perkelahian akan tetapi orang yang perkasa itu adalah orang yang mampu menahan dirinya disaat marah,” (HR. Bukhori 6114, Muslim 2609) dan dalam hadits-hadits yang semacamnya. “akan tetapi sesungguhnya kebajikan itu ialah beriman kepada Allah,” maksudnya, bahwa Dia adalah Tuhan Yang Maha Esa yang memiliki sifat dengan segala sifat kesempurnaan dan terlepas dari segala kekurangan. “dan hari akhir,” yaitu segala hal yang dikabarkan oleh Allah tentangnya dalam kitabNya, atau apa yang telah dikabarkan oleh rasulNya dari hal-hal yang terjadi setelah kematian. “dan para malaikat,” yang dijelaskan sifat mereka oleh Allah kepada kita dalam kitabNya dan dijelaskan juga oleh rasulNya. “dan Alkitab,” yaitu jenis kitab-kitab yang telah diturunkan oleh Allah kepada rasul rasulNya, dan yang paling Agung adalah Alquran. Maka ia beriman kepada hal-hal yang dikandung olehnya dari kabar maupun hukum. “Dan para nabi,” secara umum, dan khususnya penutup mereka dan paling mulia dari mereka, yaitu Muhammad Shallallahu Alaihi Wasallam, “dan memberi harta,” yaitu seluruh harta yang dikumpulkan oleh manusia sedikit maupun banyak, maksudnya ia memberikan harta “yang dicintainya,” yaitu cinta harta. Allah menjelaskan dengan hal ini bahwa harta itu sangat dicintai oleh jiwa dan sebenarnya seorang hamba tidak mau mengeluarkannya, barangsiapa yang mengeluarkannya padahal ia sangat mencintainya dengan maksud mendekatkan diri kepada Allah, maka hal ini adalah sebagai tanda bagi keimanannya, dan diantara memberikan harta yang dicintai nya adalah bersedekah serta dia dalam kondisi sehat lagi kikir yang mana ia sangat mengharapkan kekayaan dan takut dari kemiskinan. Demikian juga bila sedekah dikeluarkan ketika dalam kondisi kekurangan, niscaya itu lebih utama, karena dalam kondisi seperti ini, ia lebih suka menyimpannya, ketika ia mencemaskan akan terjadi kelahiran dan kepapaan. Demikian pula mengeluarkan barang yang paling berharga dari hartanya dan apa yang ia cintai dari hartanya tersebut sebagaimana Allah berfirman : \"Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sehahagian harta yang kamu cintai. Dan apa saja yang kamu nafkahkan maka sesungguhnya Allah mengetahuinya.\" QS al-imran ayat 92 Setiap mereka itu adalah diantara orang-orang yang memberikan harta yang ia cintai. Kemudian Allah menjelaskan tentang orang-orang yang berhak menerima infaq, yaitu orang-orang yang paling utama untuk diberikan kebajikan dan bakti dari kerabat, yang menyentuh hatimu karena musibah mereka dan membahagiakanmu dengan kebahagiaan mereka, yaitu yang saling menolong dan saling bersekutu. Maka diantara kebajikan yang paling baik dan paling tepat adalah mengadakan kebajikan terhadap karib kerabat, baik dengan harta maupun perkataan menurut kedekatan dan kebutuhan mereka. Dan di antara mereka adalah “anak-anak yatim” yang tidak memiliki orang yang mencarikan harta untuk mereka dan tidak memiliki kemampuan yang dapat dijadikan sandaran. Ini adalah diantara rahmat Allah Ta’ala terhadap hamba-hambaNya yang menunjukkan bahwasanya Allah sangat sayang kepada mereka daripada sayangnya seorang ayah kepada anaknya. Allah telah mewasiatkan kepada hamba-hambaNya, lalu mewajibkan mereka untuk berbuat kebajikan dengan hartanya kepada orang-orang yang kehilangan ayah mereka, agar anak-anak itu seperti anak-anak yang tidak kehilangan kedua orangtuanya, dan karena balasan itu sesuai dengan jenis perbuatannya, yakni barangsiapa yang menyayangi seorang anak yatim orang lain, niscaya anak yatimnya akan disayangi oleh orang lain. “Dan orang-orang miskin,” yaitu mereka yang dililit kebutuhan dan dihinakan oleh kemiskinan, maka mereka memiliki hak atas orang-orang kaya dalam mencukupi kebutuhan mereka atau meringankannya, sesuai dengan kemampuan dan kelapangan mereka. “Dan musafir (yang memerlukan pertolongan),” yaitu orang asing yang kehabisan bekal di luar negerinya sendiri. Allah menganjurkan hamba hambaNya untuk memberikan kepadanya beberapa harta yang dapat membantunya dalam perjalanannya, karena perjalanan itu merupakan kondisi yang membutuhkan bantuan dan banyak pengeluaran. Oleh karena itu, wajib atau seorang yang telah diberikan nikmat oleh Allah pada negerinya dengan segala kemakmuran dan Allah karuniakan nikmatNya kepadanya agar dia juga bersikap Rahmat kepada saudaranya yang asing tersebut menurut kadar kemampuannya, walau hanya membekali sedikit atau memberikan sebuah alat perjalanan atau sebuah alat yang dapat menghindari dirinya dari kesewenang-wenangan, dan lain sebagainya. “Dan orang-orang yang meminta-minta,” yakni orang-orang yang meminta-minta karena suatu kebutuhan mendesak yang menyebabkan mereka melakukannya, seperti seorang yang diuji dengan denda suatu kejahatan atau beban pajak dari pemerintah, atau dia meminta-minta kepada manusia untuk memajukan kemaslahatan umum seperti masjid, sekolah, jembatan, dan semacamnya. Maka yang seperti ini memiliki hak walaupun ia adalah orang kaya. “Dan (memerdekakan) hamba sahaya,” termasuk di dalamnya adalah pembebasan budak dan membantunya serta mengusahakan harta untuk seorang budak yang membayar kebebasannya agar ia mampu menunaikan bayaran kepada tuannya, atau menebus tawanan muslimin dari kaum kafir atau kaum zalim. “Dan mendirikan salat dan menunaikan zakat,” telah sering diterangkan bahwa Allah Subhanahu Wa Ta’ala menyatukan antara shalat dan zakat, karena kedua hal itu adalah sebaik-baik ibadah dan pendekatan diri kepada Allah yang paling sempurna karena memuat ibadah hati, tubuh, dan harta. Dan dengan keduanya iman seseorang ditakar dan keyakinan yang ada pada pelakunya dapat diukur. “Dan orang-orang yang menepati janjinya bila berjanji.” Janji adalah komitmen terhadap apa yang telah diwajibkan oleh Allah atau diwajibkan oleh hamba itu sendiri, maka termasuk dalam hal itu adalah seluruh hak-hak Allah, karena Allah telah mewajibkan semuanya atas hamba-hambaNya dan mereka berkomitmen terhadapnya, dimana mereka masuk dalam janji tersebut dan wajib atas mereka untuk menunaikannya, dan juga hak-hak hamba yang telah diwajibkan oleh Allah atas mereka dan hak-hak yang telah diwajibkan oleh seorang hamba sendiri, seperti sumpah dan nadzar atau semacamnya. “Dan orang-orang yang sabar dalam kesempitan,” yakni, kemiskinan, karena orang yang miskin membutuhkan kesabaran dalam banyak aspek, dari apa yang didapatkannya berupa kepedihan hati dan tubuh, yang berkesinambungan yang tidak dirasakan oleh selainnya; apabila seorang kaya menikmati apa yang tidak mampu dinikmatinya, ia akan bersedih, dan apabila ia lapar atau keluarganya lapar, ia pun bersedia, apabila ia makan suatu makanan yang tidak sesuai dengan seleranya, ia bersedia, apabila ia tanpa busana atau hampir tanpa busana, ia bersedih, apabila ia melihat apa yang ada pada dirinya dan apa yang ia prediksikan pada masa mendatang yang harus dipersiapkan olehnya, ia akan bersedih, apabila ia merasa dingin yang tidak mampu kendalikan, ia bersedih. Seluruhnya hal tersebut dan yang semacamnya adalah musibah-musibah yang diperintahkan untuk bersabar atasnya, berangan akhirat, mengharap pahala dari Allah terhadapnya, “dan penderitaan,” yaitu suatu penyakit dalam berbagai macam seperti demam, luka, masuk angin, atau sakit pada suatu anggota tubuh hingga gigi, jari jemari, dan yang semacamnya, di mana dibutuhkan untuk bersabar atas semua itu, karena jiwa itu lemah dan tubuh merasakan sakit, dan hal itu adalah suatu yang paling sulit bagi jiwa. Terlebih ketika hal itu terjadi lebih lama, maka diperintahkan untuk bersabar atasnya dengan mengharap pahala dari Allah. “Dan dalam peperangan,” yakni saat berperang menghadapi musuh-musuh yang diperintahkan untuk diperangi, karena ketegaran itu sangatlah sulit sekali bagi jiwa, dan manusia akan mengalami kegoncangan dari pembunuhan, luka, atau tertawan, maka dibutuhkan kesabaran atas semua itu dengan maksud mengharapkan pahala dari Allah yang dariNyalah pertolongan dan bantuan yang telah dijanjikan didapatkan bagi orang-orang yang bersabar. “Mereka itulah,” yaitu orang-orang yang memiliki sifat sebagaimana yang telah disebutkan dari keyakinan-keyakinan yang baik, perbuatan yang merupakan pengaruh dari keimanan, bukti nyata dan cahayanya, dan akhlak yang merupakan keindahan dan hakikat kemanusiaan; mereka itulah “orang-orang yang benar” dalam keimanan mereka, karena perbuatan-perbuatan mereka membenarkan keimanan mereka, “dan mereka itulah orang-orang yang bertakwa,” karena mereka meninggalkan hal-hal yang dilarang dan mengerjakan yang diperintahkan, karena perkara-perkara itu meliputi segala unsur kebaikan, baik secara prediksi maupun yang pasti. Menunaikan janji termasuk menunaikan seluruh ajaran agama, dan karena ibadah-ibadah yang telah ditetapkan oleh Nash Nash dalam ayat ini merupakan ibadah yang paling besar, dan barangsiapa yang menunaikannya, niscaya ia akan lebih mampu menunaikan ibadah ibadah mereka, mereka itulah orang-orang yang baik, benar, dan bertaqwa. Sesungguhnya telah diketahui bahwa apa yang diberikan oleh Allah atas ketiga perkara tersebut dari paham duniawi maupun ukhrawi tidak mungkin dapat dirinci dalam pembahasan ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡبِرَّ } Al-Birr : Seluruh jenis kebaikan dan ketaatan kepada Allah dan rasul Nya Muhammad ﷺ { وَلَٰكِنَّ ٱلۡبِرَّ مَنۡ ءَامَنَ بِٱللَّهِ } Walakinnal birra man aamana billah : Kebaikan berupa kebenaran haqiqi yang dilakukan oleh orang yang beriman kepada Allah dan hari akhir serta sifat-sifat yang disebutkan lainnya. { وَءَاتَى ٱلۡمَالَ عَلَىٰ حُبِّهِۦ } Wa aatal maala ‘ala hubbihi : Memberikan harta dengan jumlah tertentu karena kecintaan yang sangat kepadanya, sehingga ia lebih mengutamakan apa yang dicintai oleh Allah dibandingkan apa yang ia cintai. {ذَوِي ٱلۡقُرۡبَىٰ } Dzawil qurba : Keluarga dekat, dari yang paling dekat diutamakan terlebih dahulu. {وَٱلۡيَتَٰمَىٰ } Al-Yataama : Bentuk jamak dari kata yatim, yaitu anak yang ditinggal mati bapaknya sedangkan ia belum mencapai usia aqil baligh. { وَٱلۡمَسَٰكِينَ } Al-Masaakiin : Bentuk jamak dari miskin, orang fakir yang tidak memiliki apa-apa untuk mencukupi kebutuhannya sehingga tidak kuasa untuk berbuat. {وَٱبۡنَ ٱلسَّبِيلِ } Ibni sabil : Musafir yang jauh dari tempat tinggalnya, terputus dari keluarga dan kehabisan harta. { وَٱلسَّآئِلِينَ } As-Saa’iliin : Bentuk jamak dari sa’il, yaitu fakir miskin yang membutuhkan, sehingga diizinkan untuk meminta-minta untuk sekedar memenuhi kebutuhan dirinya. { وَفِي ٱلرِّقَابِ } Fiir riqaab : Riqaab merupakan bentuk jamak dari Raqabah (budak), berinfak kepadanya berarti membebaskannya. { ٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ } Al-Ba’saa wadh Dharraa : al-Ba’saa maknanya adalah kesempitan hidup karena kemiskinan. Adh-Dharraa : Penderitaan yang amat sangat karena bahaya ataupun sakit. { وَحِينَ ٱلۡبَأۡسِۗ } Wa hiinal ba’s : Ketika peperangan di jalan Allah sedang berkecamuk. { أُوْلَٰٓئِكَ ٱلَّذِينَ صَدَقُواْۖ } Ulaaikalladziina shadaqu : Merekalah orang-orang yang jujur dalam keimanan, kebaikan, dan kebajikan. Makna ayat : Pada tiga ayat sebelumnya dan ayat ini, Allah Ta’ala mengecam para Rahib dari kalangan ahli kitab dan menyebutkan ancaman kepada mereka berupa kemurkaan Nya dan pedihnya adzab Nya pada hari kiamat nanti. Begitu juga terdapat peringatan kepada ulama umat Islam agar tidak menyembunyikan ilmu kepada manusia karena mengharapkan bagian remeh dari dunia. Pada ayat ini Allah Ta’ala membantah kesombongan ahli kitab dengan arah kiblat mereka, dan pengakuan akan keimanan dan kesempurnaannya hanya karena mereka beribadah menghadap kiblatnya yaitu Baitul Maqdis yang terdapat di barat, atau tempat terbitnya matahari di timur. Yang pertama adalah kiblat orang Yahudi sedangkan yang kedua adalah kiblat orang Nasrani. Allah Ta’ala berfirman,”Kebajikan itu bukanlah menghadapkan wajahmu ke arah timur dan ke barat,” pada ayat ini terdapat peringatan yang agung bagi seorang muslim yang menganggap Islam itu hanya ibadah shalat saja, sedangkan terhadap perkara agama yang lain tidak peduli, sehingga sering meninggalkan kewajiban dan melakukan apa yang dilarang. Kemudian Allah Ta’ala menjelaskan tentang orang yang berbuat kebenaran dan kebajikan dalam keimanan, keislaman, dan ihsan dengan firmanNya,”Akan tetapi kebajikan itu” yaitu orang yang berbuat kebajikan itu adalah,”Orang yang beriman kepada Allah” kemudian disebutkan rukun iman kecuali yang keenam yaitu iman kepada qodho dan qodar. (وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ ) “dan mendirikan shalat dan menunaikan zakat” dua amalan ini adalah rukun islam yang paling mulia, dan menginfakkan harta di jalan Allah karena kecintaan kepadaNya untuk kerabat dekat, anak-anak yatim, orang miskin, musafir yang kehabisan bekal, peminta-minta yang membutuhkan, untuk membebaskan budak, melepaskan tawanan, dan mendirikan shalat, senantiasa menunaikannya dalam keadaan yang sempurna, dan menyerahkan zakat kepada orang yang berhak. Mendirikan shalat dan membayar zakat termasuk dalam pondasi keislaman yang terbesar. Kemudian Allah Ta’ala menyebutkan di antara sifatnya adalah memenuhi perjanjian dan bersabar dalam keadaan yang paling sulit sekalipun. Allah Ta’ala berfirman : “Orang-orang yang menepati janji apabila berjanji, dan orang yang sabar dalam kemelaratan, penderitaan, dan pada masa peperangan” Ini adalah langkah pertama dari amalan ihsan, yaitu merasa diawasi oleh Allah dan melihat kepadaNya sedangkan Dia senantiasa memperhatikan hamba-hambaNya. Dari sinilah Allah Ta’ala menetapkan bahwa mereka itulah orang-orang yang jujur dalam pengakuan keimanan, keislaman, dan mereka orang-orang yang terjaga dari murka Allah dan azab yang pedih. Semoga Allah menjadikan kita bagian dari mereka. Kemudian Allah Ta’ala menunjuk mereka dengan “lam lil bu’di” karena jauhnya tempat mereka dan tingginya derajat mereka.”Merek itulah orang-orang yang benar, dan mereka itulah orang-orang yang bertakwa.” Pelajaran dari ayat : • Mencukupkan diri dengan beberapa perkara agama tanpa mengerjakan perkara yang lain tidak disebut sebagai mukmin atau orang yang selamat. • Rukun iman disebutkan dalam ayat ini, dan yang dimaksud dengan kitab adalah kitab-kitab. • Penjelasan mengenai infaq yang pahalanya diharapkan pada hari kiamat, yaitu infaq kepada kerabat dekat dst. • Penjelasan mengenai mulianya ibadah shalat dan zakat. • Kewajiban untuk memenuhi perjanjian. • Kewajiban bersabar, terutama saat peperangan berkecamuk. • Ketakwaan itu adalah inti dari semua perkara, dan tujuan akhir dari orang-orang yang beramal shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 177: Ketahuilah wahai manusia bahwasannya kebaikan tidaklah dibatasi pada manusia yang sholat menghadap masyriq dan maghrib saja,akan tetapi disana banyak macam-macam kebaikan yang wajib dijaga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menunjukkan bahwa ajaran Islam terdiri dari 'Aqidah dan syari'at. 'Aqidah menerangkan tentang keimanan seperti yang disebutkan pada ayat tersebut, dan syari'at menerangkan tentang amalan-amalan yang diperintahkan dalam Islam, di mana pada amalan tersebut terdapat akhlak kepada Allah dan akhlak kepada manusia. Maksudnya: Kebaikan menurut Allah, bukanlah terletak dalam hal menghadap timur dan barat dalam ibadahnya, sebagai bantahan terhadap sangkaan orang yahudi dan Nasrani ketika mereka menyangka bahwa kebaikan itu terletak ketika seseorang menghadap dalam shalatnya ke arah ini atau ke arah itu. Ayat ini secara umum menyatakan bahwa kebajikan terletak pada keta'atan kepada Allah dan mengikuti perintah-Nya seperti dengan melaksanakan apa yang disebutkan dalam ayat di atas. Seperti mengimani bahwa Allah Mahaesa, yang satu-satunya berhak disembah tidak selain-Nya, memiliki sifat sempurna dan bersih dari segala kekurangan. Dengan beriman kepada semuanya. Harta adalah sesuatu yang dicintai oleh jiwa manusia, karenanya sangat berat untuk dikeluarkan. Oleh karena itu, barangsiapa yang mampu mengeluarkannya padahal ia mencintainya, maka hal itu merupakan burhan (bukti) terhadap keimanannya. Termasuk dalam hal ini adalah bersedekah ketika ia dalam kondisi sehat, bakhil dan berharap ingin kaya serta takut miskin, bersedekah ketika harta hanya ada sedikit, bersedekah dengan harta yang berharga atau harta yang sangat dicintainya. Ini semua merupakan contoh mengeluarkan harta yang dicintainya. Anak yatim adalah anak yang ditinggal wafat bapaknya ketika ia belum baligh. Hal ini termasuk dalil bahwa Allah Subhaanahu wa Ta'aala lebih sayang kepada hamba-hamba-Nya daripada sayangnya orang tua kepada anaknya. Allah Subhaanahu wa Ta'aala mewasiatkan hamba-hamba-Nya dan mewajibkan mereka untuk berbuat ihsan kepada orang yang kehilangan pengurusnya, padahal ia membutuhkan pengurus. Yakni mereka tertimpa kebutuhan yang menghendaki untuk meminta-minta. Misalnya mereka yang menanggung diat karena jinayat, terkena tanggungan berat dari pemerintah, atau seperti yang disebutkan dalam hadits berikut, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: إِنَّ اَلْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ: رَجُلٌ تَحَمَّلَ حَمَالَةً, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَهَا, ثُمَّ يُمْسِكَ، وَرَجُلٌ أَصَابَتْهُ جَائِحَةٌ, اِجْتَاحَتْ مَالَهُ, فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, وَرَجُلٌ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُومَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَومِهِ: لَقَدْ أَصَابَتْ فُلَانًا فَاقَةٌ; فَحَلَّتْ لَهُ اَلْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ, فَمَا سِوَاهُنَّ مِنَ اَلْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتٌ يَأْكُلُهَا صَاحِبُهَا سُحْتًا “Sesungguhnya meminta-minta tidaklah halal kecuali bagi salah seorang di antara tiga golongan ini: (1) Seorang yang menanggung hutang orang lain, ia boleh meminta-minta sampai ia bisa melunasinya, kemudian ia berhenti. (2) Orang yang tertimpa musibah yang menghabiskan hartanya, ia boleh meminta-minta sampai ia mendapatkan penopang hidupnya, dan (3) Orang yang tertimpa kemiskinan sehingga tiga orang yang berakal dari kaumnya menyatakan “Si fulan telah tertimpa kemiskinan” maka ia boleh meminta-minta sampai mendapatkan penopang hidupnya. Meminta-minta selain dari tiga hal itu, wahai Qabiishah, adalah haram dan orang yang memakannya adalah memakan yang haram.” (HR. Muslim, Abu Dawud, Ibnu Huzaimah dan Ibnu Hibban) Demikian juga orang-orang yang meminta-minta untuk keperluan maslahat banyak orang seperti untuk pembangunan masjid, pesantren, jembatan dan lain-lain, mereka ini perlu dibantu meskipun masih sanggup. Termasuk ke dalam memerdekakan budak adalah memerdekakannya, membantunya agar dapat merdeka, membantu melunasi hutang kebudakannya seperti mukatab, menebus para tawanan yang tertawan di tengah-tengah orang kafir atau ditawan oleh orang-orang yang zhalim. Sudah dijelaskan sebelumnya mengapa shalat dan zakat sering digandengkan secara bersamaan, karena keduanya merupakan ibadah dan cara mendekatkan diri kepada Allah yang paling utama. Di dalamnya terdapat ibadah hati, badan dan harta, dan dengan keduanya iman dapat ditimbang serta dapat diketahui keyakinan yang ada pada pemiliknya. Baik berjanji kepada Allah maupun kepada manusia. Seperti kemiskinan. Dalam menghadapi musibah kemiskinan butuh kesabaran, karena dalam kemiskinan seseorang merasakan kepedihan hati dan badan yang tidak dirasakan pada musibah lainnya. Ketika orang kaya dapat menikmati kesenangan, sedangkan dirinya tidak, hatinya terasa pedih. Ketika dirinya lapar atau orang yang ditanggungnya lapar, ia terasa pedih. Ketika ia memakan makanan yang tidak sesuai dengan seleranya, ia terasa pedih. Saat melihat apa yang ada di hadapannya serta persiapan untuk masa mendatang, ia terasa pedih, dan ketika ia kedinginan karena temmpat tinggalnya ttidak melindunginya dari cuaca dingin, ia pun terasa pedih. Musibah seperti ini patut dihadapi dengan sabar sambil mengharapkan pahala dari Allah Azza wa Jalla. Seperti ketika sakit dengan berbagai macam bentuknya. Sakit pada badan membuat lemah badan dan membuat dirinya merasakan sakit dan kepayahan, terlebih ketika sakit itu lama sembuhnya. Ketika ini, kita pun diperintahkan untuk bersabar dan mengharap pahala dari Allah. Yakni mereka yang memiliki sifat-sifat tersebut atau memiliki 'aqidah yang shahih dan amalan yang shalih serta akhlak yang mulia. Yakni benar imannya atau pengakuannya sebagai orang yang melakukan kebajikan. Hal ini, karena amalan merupakan bukti keimanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 177",
    "description": "Ayat ini menjelaskan bahwa kebajikan itu bukanlah menghadapkan wajahmu ke arah timur dan ke barat, yaitu salat tanpa dibarengi kekhusyukan dan keikhlasan, karena menghadapkan hal itu bukanlah pekerjaan yang susah. Tetapi kebajikan yang sesungguhnya itu ialah pada hal-hal sebagai berikut. Kebajikan orang yang beriman kepada a) Allah dan tidak menyekutukan-Nya dengan apa pun; b) hari akhir yaitu hari pembalasan segala amal perbuatan selama di dunia, sehingga mendorong manusia untuk selalu berbuat baik; c) malaikat-malaikat yang taat menjalankan perintah Allah dan tidak pernah berbuat maksiat sehingga mendorong manusia untuk meneladani ketaatannya; d) kitab-kitab yang diturunkan kepada para rasul; e) dan nabi-nabi yang selalu menyampaikan kebenaran meskipun banyak yang memusuhinya. Kebajikan orang yang memberikan harta yang dicintainya kepada kerabat yang kurang mampu, anak yatim, karena mereka sudah kehilangan orang tua, sehingga setiap orang beriman patut memberikan kebaikan kepada mereka, orang-orang miskin yang hidupnya serba kekuarangan dalam memenuhi kebutuhan sehari-hari, orang-orang yang dalam perjalanan atau musafir yang kehabisan bekal perjalanan, peminta-minta untuk meringankan penderitaan dan kekurangannya, dan untuk memerdekakan hamba sahaya yang timbul akibat praktik perbudakan. Kebajikan orang yang melaksanakan salat dengan khusyuk dan memenuhi syarat dan rukunnya, menunaikan zakat sesuai ketentuan dan tidak menunda-nunda pelaksanaannya, orang-orang yang menepati janji apabila berjanji dan tidak pernah mengingkarinya, orang yang sabar dalam kemelaratan, penderitaan, dan pada masa peperangan dengan segala kesengsaraan, kepedihan dan berbagai macam kekurangan. Orang yang mempunyai sifat-sifat ini, mereka itulah orang-orang yang benar keimanannya, dan mereka itulah orang-orang yang bertakwa kepada Allah. Wahai orang-orang yang beriman! diwajibkan atas kamu melaksanakan kisas, hukuman yang semisal dengan kejahatan yang dilakukan atas diri manusia berkenaan dengan orang yang dibunuh apabila keluarga korban tidak memaafkan pembunuh. Ketentuannya adalah orang merdeka dengan orang merdeka, hamba sahaya dengan hamba sahaya, perempuan dengan perempuan. Tetapi barang siapa memperoleh maaf dari saudaranya, yakni keluarga korban, hendaklah dia mengikutinya dengan baik, yaitu meminta ganti dengan diat (tebusan) secara baik tanpa niat memberatkan, dan pembunuh hendaknya membayar diat kepadanya dengan baik pula dan segera, tidak menunda-nunda dan tidak mengurangi dari jumlah yang sudah disepakati, kecuali jika keluarga pihak terbunuh memaafkan pembunuh dan juga tidak menuntut diat. Ketentuan hukum yang demikian itu, yaitu kebolehan memaafkan pembunuh dan diganti dengan diat atau tebusan, adalah keringanan dan rahmat dari tuhanmu supaya tidak ada pembunuhan yang beruntun dan permusuhan dapat dihentikan dengan adanya pemaafan. Barangsiapa melampaui batas setelah itu dengan berpura-pura memaafkan pembunuh dan menuntut diat, tetapi setelah diat dipenuhi masih tetap melakukan pembunuhan terhadap pembunuh, maka ia telah berbuat zalim dan akan mendapat azab yang sangat pedih kelak di akhirat. Ayat ini mengisyaratkan bahwa pemaafan itu tidak boleh dipaksakan, sekalipun memaafkan lebih bagus daripada menghukum balik dengan hukuman yang setimpal. '"
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat yang mulia ini mengandung kalimat-kalimat yang agung, kaidah-kaidah yang luas dan akidah yang lurus. Seperti disebutkan oleh Ibnu Abi Hatim, telah menceritakan kepada kami ayahku, telah menceritakan kepada kami Ubaid Ibnu Hisyam Al-Halbi, telah menceritakan kepada kami Ubaidillah Ibnu Amr, dari Amir Ibnu Syafi', dari Abdul Karim, dari Mujahid, dari Abu Dzar r.a, telah menceritakan kepada bahwa ia pernah bertanya kepada Rosululloh Shallallahu 'alaihi wa Sallam. Tentang iman, “apakah yang dinamakan iman itu?” Maka Rosululloh Shallallahu 'alaihi wa Sallam Membacakan kepadanya firman Allah Subhanahu wa Ta'ala: لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ “Bukanlah menghadapkan wajahmu ke arah timur dan barat itu suatu kebajikan” sampai akhir ayatnya.. Mujahid melanjutkan kisahnya, bahwa setelah itu Abu Zar kembali bertanya tengtang iman tadi, maka Rosululloh Shallallahu 'alaihi wa Sallam membacakan lagi ayat ini kepadanya. Kemudian Abu Zar bertanya lagi, maka Rosululloh Shallallahu 'alaihi wa Sallam menjawab : إذا عملت حسنة أحبها قلبك ، وإذا عملت سيئة أبغضها قلبك “Apabila kamu hendak mengerjakan suatu kebaikan, maka buatlah hatimu cinta kepadanya; dan apabila kamu hendak mengerjakan suatu keburukan, maka buatlah hatimu benci kepadanya” Akan tetapi hadits ini munqati’ (terputus mata rantai sanadnya), karena Mujahid sebenarnya belum pernah bertemu dengan sahabat Abu Zar, karena Abu Zar telah wafat sebelumnya. Pembahasan mengenai tafsir ayat ini adalah “sesungguhnya Allah Subhanahu wa Ta'ala setelah memerintahkan kepada orang-orang mukmin untuk mengahadap kearah Baitul Maqdis pada awal mula kewajiban sholat, lalu kemudian memalingkan kiblatnya kea rah Ka’bah, maka hal tersebut terasa berat oleh sogolongan orang-orang ahli kitab dan sebagian dari kaum muslimin. Maka Allah menjelaskan hikma yeng terkandung dalam hal tersebut. Yang intinya berisikan bahwa tujuan utama dari hal tersebut tiada lain adalah taat kepada Allah dan mengerjakan perintah-perintah-NYA dengan patuh, serta menghadap kea rah mana saja yang Allah kehendaki dan mengikuti apa yang telah disyariatkan-NYA. Demikianlah makna “albirr” (kebajikan) ,taqwa dan iman yang sempurna. Kebajikan serta ketaatan itu tidak ada kaitannya sama sekali dengan keharusan menghadap timur ataupun barat jika hal itu tidak ada perintah dan syariatnya. Karena itulah Allah Subhanahu wa Ta'ala berfirman : لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ “Bukanlah menghadapkan wajahmu ke arah timur dan barat itu suatu kebajikan, tetapi sesungguhnya kebajikan itu ialah kebajikan orang yang beriman kepada Allah, hari akhir” sampai akhir ayat. Al-aufi meriwayatkan dari Ibnu Abbas sehubungan dengan makna ayat ini, bahwa kabjikan itu bukanlah melakukan sholat tapi tidak beramal. Hal ini diturunkan ketika Nabi Muhammad Shallallahu 'alaihi wa Sallam. Hijrah dari Mekah ke Madinah, dan diturunkan hukum-hukum fardu dan hukum-hukum had, maka Allah memerintahkan mereka untuk mengerjakan fardu-fardu dan mengamalkannya. Hal yang semisal diriwayatkan pula oleh Ad-Dahhak serta Muqatil. Al-hasan dan Ar-Rabi’ bin Anas mengatakan bahwa hal yang dibahas oleh ayat ini adalah iman dan hakikatnya, yaitu pengamalannya. Begitujuga riwayat Mujahid mengatakan bahwa kebajikan yang sesungguhnya adalah ketaatan kepada Allah Subhanahu wa Ta'ala yang telah meresap ke dalam hati. Ayat ini pula menjelaskan tentang macam-macam kebajikan yang sesungguhnya, begitu lengkap penjelasannya. Barang siapa yang sudah melaksanakan kebajikan-kebajikan yang disebutkan dalam ayat ini secara keseluruhan, maka dia adalah orang yang bertaqwa sesungguhnya. Pertama, iman terhadap semua rukun iman. Kedua, memberikan harta yang paling dicintainya sedangkan dia begitu berhasrat terhadap harta tersebut. Hal ini bukanlah perkara yang enteng, karena memberikan sesuatu yang kita cintai kepada orang lain terlebih disaat kita ingin menjadi kaya raya tentunya membutuhkan usaha yang keras dalam hati. Sehingga hal ini digolongkan menjadi shodaqoh yang paling utama, sebagaimana hadits Abu Hurairah radhiyAllahu 'anhu: أفضل الصدقة أن تصدق وأنت صحيح شحيح ، تأمل الغنى ، وتخشى الفقر “Sedekah yang paling utama adalah bila kamu mengeluarkannya, sedangkan kamu dalam keadaan sehat lagi pelit bercita-cita kaya dan takut miskin” (HR Bukhari-Muslim) Memberikan harta yang dicintai ini tidak kesembarangan orang, tetapi alangkah lebih utama memberikannya kepada golongan yang disebutkan dalam ayat ini, yaitu : Dzawil Qurba yaitu kaum kerabat laki-laki yang bersangkutan alyatama yaitu anak-anak yang tidak berpenghasilan sedangkan ayah mereka sudah meninggal, mereka dalam keadaan lemah, masih kecil dan berusia dibawah usia balig serta belum mampu mencari mata penceharian. Almasaakiin , mereka adalah orang-orang yang tidak dapat menemukan apa yang mencukupi kebutuhan pokok mereka yang terdiri dari sandang,pangan,dan papan. Ibnu Sabil yaitu orang musafir jauh yang kehabisan bekalnya, untuk itu dia harus diberi bekalyang dapat memulangkannya ke tempat tinggalnya. Demikian juga orang yang akan mengadakan perjalan untuk ketaatan seperti tolabul ilmi, ia boleh diberi bekal yang mencukupi untuk pulang pergi. Wassaailiin , mereka adalah orang-orang yang merelakan dirinya meminta-minta kepada orang lain untuk memenuhi kebutuhan hidupnya. Ar-Riqob, mereka adalah budak-budak mukatab yang tidak menemukan apa yang mereka jadikan untuk melunasi transaksi kitabahnya. Ketiga, mendirikan sholat. Artinya melaksanakan semua pekerjaan sholat pada waktunya masing-masing, yakni menyempurnakan rukun-rukunnya dan syarat-syaratnya serta tumakninah da khusyuk sesuai perintah syariat yang diridoi. Keempat. Menunaikan kewajiban zakat hartanya. Kelima, menepati janji. Sebagaimana firman-NYA: الذين يوفون بعهد الله ولا ينقضون الميثاق “yaitu orang-orang yang memenuhi janji Allah dan tidak merusak perjanjian” (QS. Ar-Ra’d : 20) Keenam, sabar dalam kesempitan, penderitaan, dan dalam peperangan. Yang dimaksud dengan kesempitan adalah keadaan miskin dan fakir, sedangkan penderitaan adalah disaat kondisi sakit dan kepayahan. Demikian menurut Ibnu Abbas dan Ibnu Mas’ud. Mereka yang memiliki enam sifat diatas ini adalah orang-orang yang benar imannya, karena mereka merealisasikan iman hati dengan ucapan dan amal perbuatan; maka mereka itulah orang-orang yang benar. Mereka itulah orang-orang yang bertaqwa, karena mereka memelihara dirinya dari hal-hal yang diharamkan dan mengerjakan semua amal ketaatan."
  }
]