[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasul Nya, serta mengerjakan amal sesuai dengan syariat Nya, Allah telah mewajibkan atas kalian untuk memberlakukan hukum qisas terhadap pembunuhan dengan sengaja membunuh, dengan syarat adanya kesetaraan dan persamaan status; yaitu orang merdeka dibunuh dengan orang merdeka, hamba sahaya dibunuh dengan hamba sahaya, dan wanita dibunuh dengan wanita. Maka barangsiapa mendapatkan toleransi dari wali yang terbunuh dengan pemberian pengampunan dari hukum qisas, dan mau menerima dengan cukup mengambil diyatnya (nominal uang tertentu yang dibayarkan oleh pelaku pembunuhan sebagai pengganti atas pengampunan bagi dirinya) maka hendaknya kedua belah pihak tetap berkomitmen untuk berlaku baik, maka wali korban meminta diyat tanpa kekerasan, dan sang pembunuh membayarkan diatnya kepada wali korban dengan baik,tanpa penundaan dan pengurangan. Pemberian maaf beserta pengambilan diyat itu merupakan bentuk keringanan dari Tuhan kalian dan rahmat terhadap kalian, dimana didalamnya ada unsur kemudahan dan kemanfaatan yang dicapai. Maka barangsiapa yang membunuh si pelaku pembunuhan setelah dimaafkan dan mengambil diyatnya, maka baginya siksaan yang pedih dengan dibunuh sebagian hukum qishash di dunia atau dengan api neraka di akhirat kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "178. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, diwajibkan kepada kalian menghukum orang yang membunuh orang lain secara sengaja dan karena permusuhan dengan hukuman yang sama dengan kejahatan yang dilakukannya. Maka orang yang merdeka harus dijatuhi hukuman mati karena membunuh orang yang merdeka. Seorang budak harus dijatuhi hukuman mati karena membunuh seorang budak. Seorang wanita harus dijatuhi hukuman mati karena membunuh seorang wanita. Apabila si korban -sebelum menghembuskan nafas terakhirnya- atau keluarganya memaafkan si pelaku dengan imbalan diat (sejumlah harta yang dibayarkan oleh pembunuh sebagai kompensasi bagi pengampunan atas kejahatannya), maka pihak yang memaafkan harus memperlakukan si pembunuh dalam menuntut pembayaran diat itu secara wajar, bukan dengan menyebut-nyebut kebaikannya sendiri dan meyakiti hati si pelaku. Dan pihak pelaku pun harus membayar diat tersebut dengan cara yang baik, tanpa menunda-nunda. Pemberian maaf dan pembayaran diat itu adalah keringanan yang Allah berikan kepada kalian, dan merupakan rahmat yang Dia berikan kepada umat ini. Maka barangsiapa menyerang si pembunuh setelah ada pemberian maaf dan pembayaran diat itu, niscaya baginya azab yang menyakitkan dari Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "178. Hai orang-orang yang beriman, diwajibkan atas kalian mengqishash orang yang membunuh dengan sengaja. Qishash ini dilaksanakan oleh wali pihak terbunuh atau orang yang mewakilinya. Qishash dilakukan dengan dasar kesetaraan; pembunuh yang merdeka (bukan budak) diqishash jika si terbunuh juga orang yang merdeka, budak diqishash jika membunuh budak, wanita diqishash jika membunuh wanita; namun pria tidak diqishash jika membunuh pria, orang Islam tidak diqishash jika membunuh orang kafir sebagaimana disabdakan Rasulullah, begitu pula orang merdeka tidak diqishash jika membunuh budak, hal ini disebabkan tidak adanya kesetaraan. Adapun jika semua atau sebagian wali terbunuh memberi maaf kepada pembunuh maka hukum qishash tidak boleh dilakukan, namun pembunuh wajib membayar diyat -yakni sejumlah harta yang dibayarkan kepada para wali terbunuh sebagai ganti dari pemberian maaf-, dan masing-masing pihak harus berkomitmen untuk memenuhi hak-hak pihak lain. Pihak yang memberi maaf harus menagih diyat dengan baik dan tanpa kekerasan, dan memberi tangguh pembayaran jika belum mampu; sedangkan pembunuh diyat harus benar-benar membayarkan diyat dan tidak mengulur-ulur pembayaran. Hukum pemberian maaf ini merupakan kemudahan dari Tuhan kalian dan bentuk kasih sayang-Nya bagi kalian. Ibnu Abbas berkata: Dahulu pada zaman Bani Israil hanya ada hukum qishash, tidak ada hukum membayar diyat. Kemudian Allah berfirman kepada umat Nabi Muhammad: كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِى الْقَتْلٰىۗ اَلْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالْاُنْثٰى بِالْاُنْثٰىۗ فَمَنْ عُفِيَ لَهٗ مِنْ اَخِيْهِ شَيْء Yakni, memaafkan dengan menerima bayaran diyat pada kasus pembunuhan yang disengaja. فَاتِّبَاعٌ ۢبِالْمَعْرُوْفِ وَاَدَاۤءٌ اِلَيْهِ بِاِحْسَانٍ Yakni, dengan memaafkan dengan cara yang baik dan membayar diyat dengan baik pula. ذٰلِكَ تَخْفِيْفٌ مِّنْ رَّبِّكُمْ وَرَحْمَةٌ Yakni, keringanan daripada yang ditetapkan bagi orang-orang sebelum kalian. ۗفَمَنِ اعْتَدٰى بَعْدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيْمٌ Yakni, barangsiapa yang membunuh si pembunuh padahal telah menerima diyat darinya. (Shahih Bukhari, ilmu, bab 39, no. 111. Shahih Muslim, haji, bab keutamaan kota Madinah, no. 1370) Dan dalam hadits marfu' dari Ali bin Abi Thalib: \"orang Islam tidak dihukum qishash jika membunuh orang kafir.\" Imam Ismail al-Qadhi al-Jahdhami menulis dalam kitabnya \"Ahkamul Qur'an\" tentang pemaduan antara ayat ini dengan ayat 45 dalam surat al-Maidah: وَكَتَبْنَا عَلَيْهِمْ فِيْهَآ اَنَّ النَّفْسَ بِالنَّفْسِ Ia mengatakan memadukan antara dua ayat ini lebih utama, sehingga yang dimaksud dalam ayat di surat al-Maidah ini adalah jiwa yang setara tingkatannya. (al-Fath 12/198)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "178. كُتِبَ عَلَيْكُمُ الْقِصَاصُ (diwajibkan atas kamu qishaash) Yakni barang siapa yang membunuh seorang muslim dengan sengaja dan karena permusuhan maka dia wajib dibunuh sebagai hak dari pihak keluarga terbunuh sebagai balasan atas perbuatannya. الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ (orang merdeka dengan orang merdeka) Dipahami dari potongan ayat ini bahwa orang merdeka harus dibunuh jika membunuh orang merdeka dan hamba sahaya harus dibunuh jika membunuh hamba sahaya. Namun apabila orang merdeka membunuh hamba sahaya maka dia tidak dijatuhi hukuman mati. Jumhur ulama berpendapat apabila orang muslim membunuh orang kafir maka dia tidak dijatuhi hukuman mati, mereka berdalil dengan hadist Nabi: (لا يقتل مسلم بكافر) “tidak dibunuh orang muslim sebab membunuh orang kafir”. وَالْأُنثَىٰ بِالْأُنثَىٰ ۚ (dan wanita dengan wanita) Yakni perempuan ini harus dibunuh karena membunuh perempuan lain, terlebih lagi apabila membunuh laki-laki. Begitupun laki-laki harus dibunuh karena membunuh perempuan, dengan dalil dari sabda Nabi: (وإن الرجل يقتل بالمرأة) “dan sesungguhnya laki-laki harus dibunuh karena membunuh perempuan”. فَمَنْ عُفِىَ لَهُۥ مِنْ أَخِيهِ شَىْءٌ (Maka barangsiapa yang mendapat suatu pemaafan dari saudaranya) Yakni apabila pembunuh atau pelaku kejahatan dimaafkan oleh korban, wali korban, atau orang yang berhak membalasnya maka mereka berhak mendapatkan diyah (tebusan) ataupun ganti rugi. فَاتِّبَاعٌ (hendaklah (yang memaafkan) mengikuti dengan cara yang baik) Yakni hendaklah yang memiliki hak menuntut haknya dengan cara yang baik, seperti memberi tenggang waktu kepada yang mempunyai kesulitan untuk membayar. وَأَدَآءٌ إِلَيْهِ بِإِحْسٰنٍ ۗ (dan hendaklah (yang diberi maaf) membayar (diat) kepada yang memberi maaf dengan cara yang baik (pula) ) Yakni dengan tidak menunda-nunda, mengingkari, atau membalas dengan perkataan yang buruk. ذٰلِكَ تَخْفِيفٌ (Yang demikian itu adalah suatu keringanan) Yakni berupa pemberian maaf namun mendapatkan ganti berupa diyah. Allah mensyari’atkan untuk umat ini qishash dan pemberian maaf tanpa diyah atau dengan diyah; hal ini agar tidak memberatkan umat ini. Tidak sebagaimana telah memberatkan orang-orang Yahudi yang mewajibkan qishash atau pemberian maaf tanpa diyah. Tidak pula sebagaimana telah memberatkan orang-orang Nasrani yang mewajibkan pemberian maaf tanpa diyah. فَمَنِ اعْتَدَىٰ بَعْدَ ذٰلِك (Barangsiapa yang melampaui batas sesudah itu) Yakni setelah pemberian maaf, semisal setelah mengambil diyah kemudian tetap membunuh si pembunuh atau telah memaafkan namun kemudian mengqishash."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hikmah dari sapaan { يَا أَيُّهَا الَّذِينَ آمَنُوا } adalah penguatan bagi para da'i untuk menyampaikan dan menerapkan hukum qishas, maka seakan-akan ayat ini mengatakan : sesungguhnya bersama kamu ada keimanan yang menguatkan hatimu dari kelemahan untuk menegakkan kewajiban ini, dan sesungguhnya seorang mukmin yang baik adalah yang senantiasa berusaha menutup pintu-pintu yang menjadi penyebab terjadinya kemaksiatan dikalangan masyarakat khususnya perzinahan, dan ia harus mampu menghadapinya dengan persiapan yang baik dalam situasi apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "178. Wahai orang-orang mukmin, telah diwajibkan atas kalian hukum qishash atas pembunuhan yang dilakukan sengaja, bukan pembunuhan yang lainnya, yang mana qishash itu dilakukan oleh wali perkara tersebut berdasarkan kaidah persamaan, yang mana orang yang merdeka dibunuh karena membunuh orang merdeka, dan hamba dibunuh karena membunuh hamba. Jadi tidak boleh orang yang merdeka dibunuh karena membunuh hamba. Jumhur ulama’ selain mazhab hanafi tidak memperbolehkan membunuh orang muslim karena membunuh orang kafir berdasarkan sunnah yang telah ditetapkan. Dan wanita itu dibunuh wanita karena membunuh wanita begitu juga laki-laki. Dan laki-laki itu dibunuh karena membunuh wanita sebagai penerapan hadits “Wa innarrajula yuqtalu bil mar’ah” Maka ketika pembunuh itu diampuni oleh walinya agar tidak diqishash secara cuma-cuma atau dengan diyat, maka tuntutan terhadap pembunuh harus dilakukan dengan baik. Dan tidak diwajibkan bagi pembunuh untuk membayar diyat sekaligus jika dalam keadaan sulit. Dan wajib baginya untuk membayar diyat kepada wali orang yang terbunuh dengan baik tanpa menunda-nunda, mengingkarinya atau menyakitinya dalam bentuk ucapan. Hukum terkait pemberian maaf atau diyat itu adalah salah satu syariat untuk meringankan kalian wahai orang-orang mukmin. Dan pemaafan itu adalah sebagai gantinya baik secara cuma-cuma atau dengan tebusan (diyat). Ketika hal ini dihubungkan dengan hukum taurat yang terbatas hukumannya pada qishash saja, maka hal ini adalah rahmat bagi kalian. Maka barangsiapa melanggarnya setelah adanya pemaafan atau pembayaran diyat dengan membalas dendam kepada pembunuh maka baginya itu azab yang pedih di akhirat. Dan qishash itu dilakukan di dunia. Ayat ini turun (sebagaimana yang disebutkan oleh Qatadah, Asy-Sya’biy dan lainnya) untuk menghindari tindakan melampaui batas dan kesewenang-wenangan orang-orang Jahiliyyah yang memperbolehkan orang yang merdeka membunuh hamba, laki-laki membunuh perempuan, serta membunuh orang lain selain pembunuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, diwajibkan atas kalian} diwajibkan atas kalian {qisas} kesetaraan dan keserupaan {berkenaan dengan orang-orang yang dibunuh. Orang merdeka dengan orang merdeka, hamba sahaya dengan hamba sahaya, dan perempuan dengan perempuan. Siapa yang memperoleh maaf dari saudaranya} maka barang siapa yang memperoleh maaf atas kejahatannya dari saudaranya yang memiliki hubungan darah {hendaklah mengikutinya dengan cara yang bijaksana} maka sebaiknya orang yang memaafkan mengikuti terdakwa dengan meminta tebusan yang patut {dan hendaklah menunaikan kepadanya dengan cara yang baik.} dan sebaiknya terdakwa menunaikan dengan baik apa yang diharuskan baginya berupa uang tebusan tanpa adanya penundaan dan tidak terlalu murah {Yang demikian itu adalah keringanan dan rahmat dari Tuhan kalian. Siapa yang melampaui batas setelah itu} maka siapa saja yang membunuh terdakwa setelah pemberian maaf dan penerimaan tebusan itu {maka ia akan mendapat azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "178. Allah memberikan karunia kepada hamba-hambaNya yang beriman dengan mewajibkan atas mereka menegakkan “qishash berkenaan dengan orang-orang yang terbunuh,” yakni memberikan hukuman yang sama, dimana pelaku pembunuhan dibunuh dengan model pembunuhan yang ia lakukan terhadap orang yang dibunuhnya, sebagai penegakan keadilan dan kesetaraan antara manusia. Diarahkan nya kalimat ini kepada kaum muslimin secara umum adalah dalil yang menunjukkan bahwa hal itu wajib atas mereka semua hingga keluarga pelaku pembunuhan atau bahkan hingga pelaku pembunuhan itu sendiri sebagai bentuk pertolongan bagi keluarga orang yang terbunuh apabila mereka memilih qishash dan memungkinkannya menuntut hal tersebut dari pihak pelaku tersebut, dan tidak dibolehkan bagi mereka untuk merubah hukum tersebut dan menghalangi keluarganya dalam memilih hukum qishash sebagaimana kebiasaan orang-orang jahiliyah atau orang-orang yang semisalnya dari orang-orang yang melindungi pelaku kedholiman. Kemudian Allah menjelaskan rincian hal tersebut seraya berfirman, “Orang merdeka dengan orang yang merdeka.” Menurut makna lafadznya, termasuk di dalamnya adalah laki-laki dengan laki-laki, perempuan dengan perempuan, perempuan dengan laki-laki, dan laki-laki dengan perempuan. Maka makna tersurat dari lafadz itu itu lebih didahulukan daripada makna yang terpahami dari firmanNya, “dan perempuan dengan perempuan,” disertai dengan adanya dalil dari as-sunnah, yaitu bahwa laki-laki juga dibunuh dengan perempuan. Namun kedua orang tua dan seterusnya keatas tidak termasuk dalam makna yang umum ini, artinya bahwa mereka tidak dibunuh karena membunuh anak, disebabkan adanya as-sunnah yang menjelaskan akan hal tersebut. Padahal dalam firmanNya, “hukum qishash,” terkandung apa yang menunjukkan bahwa bukanlah suatu keadilan jika seorang ayah dibunuh karena membunuh anaknya, dan karena dalam hati seorang ayah ada rasa kasih sayang dan rahmat (yang begitu kuat) yang akan menghalanginya dari tindakan membunuh anaknya sendiri kecuali dengan sebab adanya gangguan pada akalnya atau kedurhakaan yang besar dari anaknya terhadap dirinya. Dan termasuk yang tidak terkait dalam keumuman tersebut adalah seorang kafir, berdasarkan dalil as-sunnah, padahal ayat ini diarahkan khusus untuk kaum mukminin. Dan juga bukanlah suatu keadilan bila seorang wali Allah dibunuh karena membunuh seorang musuh Allah. “Dan hamba dengan hamba,” perempuan ataupun laki-laki, yang sama maupun berbeda kadar harganya. Ayat ini menurut pemahaman terbaliknya menunjukkan bahwa seorang yang merdeka tidak dibunuh karena membunuh hamba, karena tidak sama derajatnya. “Dan wanita dengan wanita.” Sebagian ulama mengambil dari pemahaman terbaliknya adalah bahwa laki-laki tidak dibunuh karena membunuh perempuan, dan hal ini telah dibahas sebelumnya. Ayat ini menunjukkan bahwa pada dasarnya hukum qishash adalah wajib dalam masalah pembunuhan, dan bahwa membayar diyat itu adalah sebagai penggantinya. Oleh karena itu Allah berfirman, “Maka barangsiapa yang mendapat suatu pemaafan dari saudaranya,” maksudnya, keluarga orang yang terbunuh memaafkan pembunuhnya untuk diganti dengan membayar diyat saja atau sebagian keluarga terbunuh memaafkan, maka gugurlah hukum qishash dan wajiblah hukum membayar diyat atas si pembunuh. Penentuan pilihan pada tuntutan qishash dan pilihan membayar diyat, kembali kepada Wali yang terbunuh. Apabila dia memaafkan pembunuhnya, maka wajiblah atas Wali itu hukum tersebut, yakni si Wali si terbunuh, untuk mengikuti (kesanggupan) si pembunuh “dengan cara yang baik,” tanpa memberatkannya dan membebaninya dengan sesuatu yang tidak mampu dipikulnya akan tetapi hendaknya ia menuntut dan meminta dengan baik serta tidak menyusahkannya. Dan hendaklah si pembunuh juga “membayar diyat kepada yang memaafkan dengan cara yang baik pula,” dengan tidak menunda-nunda, tidak kurang dan tidak berbuat kejelekan, baik perkataan maupun perbuatan. Dan tidak ada balasan kebaikan dengan pemaafan itu, kecuali kebaikan (pula) dengan menunaikannya dengan baik. Ini sangat diperintahkan dalam segala hal yang bersangkutan dengan hak-hak manusia, yaitu seorang yang memiliki hak diperintahkan untuk menuntut dengan cara yang baik, dan orang yang diwajibkan untuk menunaikan hak orang lain, juga harus menunaikannya dengan cara yang baik pula. Dan dalam FirmanNya, “Maka barangsiapa yang mendapat suatu pemaafan dari saudaranya,” terkandung sikap kelembutan hati dan anjuran kepada tindakan memaafkan dengan berpindah kepada mengambil bayaran diyat, dan tentunya yang lebih baik dari itu adalah tindakan memaafkan tanpa bayaran. Dalam firmanNya, “Saudaranya,” terkandung salil yang menunjukkan bahwa pelaku pembunuhan itu bukanlah kafir, karena yang dimaksud dalam persaudaraan di sini adalah persaudaraan dengan ikatan keimanan, dan dia tidak akan dikatakan terlepas dari ikatan itu dengan pembunuhan tersebut, maka lebih patut lagi hal seperti itu berlaku pada masalah kemaksiatan yang tidak menyebabkan kekufuran, pelakunya tidaklah dikafirkan karena melakukan kemaksiatan tersebut, hanya saja keimanannya berkurang. Apabila keluarga orang yang terbunuh atau sebagian dari mereka memaafkan, maka darah pembunuhnya haram ditumpahkan oleh mereka maupun oleh selain mereka. Oleh karena itu Allah berfirman, “barangsiapa yang melampaui batas setelah itu,” yakni, setelah adanya pemaafan, “maka baginya siksa yang pedih,” maksudnya, diakhirat. Adapun membunuhnya ataupun tidak membunuhnya, maka diambil dari yang sebelumnya karena ia telah membunuh yang sederajat dengannya, maka ia pun harus dibunuh karenanya. Adapun orang yang menafsirkan siksa yang pedih itu dengan membunuh dan bahwa ayat ini menunjukkan wajibnya membunuh si pembunuh serta tidak bolehnya dimaafkan, maka pendapat seperti ini telah dikatakan oleh sebagian ulama, tetapi yang lebih benar adalah yang pertama, karena pelanggarannya tidak lebih dari pelanggaran yang lainnya. Kemudian Allah menjelaskan hikmah yang agung dari syariat hukum qishash seraya berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { كُتِبَ عَلَيۡكُمُ ٱلۡقِصَاصُ } Kutiba ‘alaikumul qishaas : Kutiba maknanya diwajibkan. Al-Qishas : Dilakukan apabila wali dari orang yang terbunuh tidak mau menerima diyat dan tidak mau memaafkan pembunuh. { فِي ٱلۡقَتۡلَىۖ } Fil qatla : Huruf fa’ bermakna sebab (sababiyah), yaitu dengan sebab terjadinya pembunuhan. Al-Qatla merupakan bentuk jamak dari qatiil yaitu orang yang nyawanya melayang dan kemudian meninggal dengan berbagai macam alat membunuh. { ٱلۡحُرُّ } Al-Hurr : Al-Hurr (merdeka) merupakan kebalikan dari ‘Abd (budak/hamba sahaya). { فَمَنۡ عُفِيَ لَهُۥ مِنۡ أَخِيهِ شَيۡءٞ } Faman ‘ufiya lahu min akhiihi syaiun : Wali orang yang dibunuh mau menarik hukuman qishas dengan memaafkan atau mau menerima diyat. { فَٱتِّبَاعُۢ بِٱلۡمَعۡرُوفِ } Fattibaa’um bil ma’ruf : Seharusnya ketika mengajukan diyat (meminta agar mau menerima tebusan atau maaf) dengan cara yang baik dan lembut. { وَأَدَآءٌ إِلَيۡهِ بِإِحۡسَٰنٖۗ } Wa adaaun ilaihi biihsaan : Tata cara pembayaran diyat hendaknya dengan cara yang ihsan, tidak menunda-nunda atau mengurangi. { ذَٰلِكَ تَخۡفِيفٞ مِّن رَّبِّكُمۡ } Dzalika takhfiifun mirrobbikum : Yaitu hukum yang memperbolehkan untuk menerima diyat sebagai ganti dari qishas adalah hukum yang adil dan penuh kasih sayang. Hal itu merupakan kemurahan dari Allah Ta’ala kepada kalian. Karena pada syariat sebelumnya hanya berlaku qishas saja atau diyat saja. Sedangkan kalian diberi pilihan antara memaafkan, membayar diyat, dan qishas. { فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ } Famani’tada ba’da dzalika : Yaitu mengambil harta diyat kemudian membunuh maka orang tersebut harus dibunuh juga. Makna ayat : Ayat ini diturunkan mengenai 2 buah perkampungan di Arab, masing-masing mengakui bahwa daerahnya lah yang lebih mulia dibanding yang lain. Sehingga orang yang merdeka dibunuh (karena telah membunuh) budak, dan laki-laki dibunuh (karena telah membunuh) perempuan secara angkuh dan congkak. Kemudian terjadilah pembunuhan di antara penduduk dua perkampungan itu, sedangkan mereka sudah memeluk agama Islam. Maka mereka mengadukan hal itu kepada Rasulullah ﷺ, maka turunlah ayat yang menganulir tradisi jahiliyah mereka dan menetapkan pondasi keadilan dan persamaan dama Islam. Allah ta’ala berfirman (يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلۡقِصَاصُ فِي ٱلۡقَتۡلَىۖ ) “Hai orang-orang yang beriman, diwajibkan atas kalian Qishash berkenaan dengan orang-orang yang dibunuh; orang merdeka dengan orang merdeka, hamba dengan hamba dan wanita dengan wanita.” Maka berdasarkan ayat ini, tidak boleh dua orang dibunuh karena telah membunuh satu orang, tidak juga seorang lelaki atau dua orang wanita dibunuh karena telah membunuh seorang wanita, dan tidak dibunuh seorang yang merdeka atau dua orang hamba karena telah membunuh seorang hamba sahaya. Barangsiapa yang telah membunuh, dan tidak dituntut untuk diberi hukuman qishash oleh wali orang yang dibunuh itu, dan berpindah kepada pilihan untuk meminta pembayaran diyat atau dimaafkan oleh walinya (ahli waris), maka hendaknya si pembunuh mengikuti hal itu, tidak mengatakan bahwa dirinya tidak akan mau menerima kecuali qishash saja. Sepantasnya bagi si pembunuh untuk menerima maaf yang diberikan saudaranya itu baik berupa qishash, pembayaran diyat, atau pemaafan. Kemudian bagi wali (ahli waris) hendaknya meminta pembayaran diyat dengan penuh kelembutan dan adab, begitu juga bagi si pembunuh untuk membayarkan diyatnya dengan cara ihsan, tidak menunda-nunda dan tidak mengurangi jumlahnya sedikitpun. Kemudian Allah Ta’ala menyebutkan nikmat Nya kepada kaum muslimin dengan memberikan keleluasaan bagi wali orang yang dibunuh (ahli waris) untuk memilih di antara tiga perkara yaitu pemaafan, pembayaran diyat, ataupun qishash, dibandingkan orang Yahudi bahwa mereka hanya diwajibkan qishash saja, sedangkan Nasrani diwajibkan pembayaran diyat saja. Lantas Allah Ta’ala menyebutkan hukum terakhir dari permasalahan ini bahwa wali yang telah memilih untuk mengambil pembayaran diyat atau memaafkan, kemudian setelah itu berubah fikiran dan meminta untuk dilaksanakan qishash dalam firman Nya : “Barangsiapa yang melampaui batas sesudah itu maka baginya siksa yang sangat pedih.” Para ulama berbeda pendapat mengenai azab yang pedih ini, apakah itu azab di dunia dengan cara dibunuh (qishash) ataukah azab di akhirat. Imam Malik dan Syafi’i berpandangan bahwa hukum wali yang melampaui batas itu sama dengan hukum orang yang membunuh pertama kali, apabila dimaafkan maka harus diterima, jika diminta untuk qishash atau membayar diyat maka harus diberikan. Namun, para ulama yang lain berpandangan bahwa dikembalikan diyat itu darinya, dan urusannya diserahkan kepada Allah. Umar bin Abdul Aziz berpendapat bahwa perkaranya dikembalikan kepada pemerintah kaum muslimin, merekalah yang menghukumi nantinya sesuai dengan maslahat umum. Pelajaran dari ayat : • Hukum qishash dalam Islam yang bermakna persamaan dan kesesuaian, dimana seorang laki-laki dibunuh karena telah membunuh laki-laki dan perempuan dibunuh karena telah membunuh perempuan, seorang perempuan dibunuh karena membunuh laki-laki dan seorang laki-laki dibunuh karena membunuh perempuan. Seorang pembunuh dibunuh (qishash) dengan alat yang dipakai untuk membunuh, sebagaimana disebutkan dalam hadits,”Seseorang dibunuh (qishash) dengan perbuatannya membunuh.” Tatkala seorang hamba sahaya (budak) dinilai dengan harta, maka seorang yang merdeka tidak dibunuh, akan tetapi membayarkan sejumlah uang kepada tuan dari hamba sahaya itu. Inilah hukum yang dipilih oleh para sahabat Nabi dan Tabi’in serta para imam seperti Imam Malik, Imam Syafi’i, dan Imam Ahmad. Namun Imam Abu Hanifah menyelisihi mereka dan berpandangan bahwa orang merdeka harus dibunuh (qishash) apabila membunuh budak, berdasarkan zhahir dari ayat ini. • Keindahan syariat Islam dimana terdapat kemudahan dan kasih sayang karena telah memperbolehkan pemaafan dan diyat sebagai ganti dari qishash."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 178: Ini adalah seruan Allah bagi hambanya yang beriman. Allah mengabarkan bahwasannya api dibalas dengan api, hamba dibalas dengan hamba, perempuan dibalas dengan perempuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Khithab ayat ini ditujukan kepada semua kaum mukminin, yang menunjukkan bahwa mereka harus ikut serta membantu pelaksanaan qishas jika diminta oleh wali si terbunuh, baik para wali si terbunuh lainnya maupun pembunuhnya, dan bahwa mereka tidak diperbolehkan menghalangi had ini dan menghalangi wali dari melakukan qishas sebagaimana yang dibiasa dilakukan di zaman jahiliyyah, yaitu melindungi para pelaku kriminal. Yakni dibunuh secara sengaja dengan membalasnya secara serupa baik sifat maupun caranya sebagai bentuk keadilan. Termasuk pula laki-laki dengan laki-laki. Demikian juga harus sama dalam hal agamanya. Oleh karena itu, orang muslim tidak boleh dibunuh meskipun ia seorang budak, karena membunuh orang kafir, meskipun orang kafir tersebut orang merdeka. Demikian juga wanita dibunuh karrena membunuh laki-laki, dan laki-laki dibunuh karena membunuh wanita, namun tidak termasuk keumuman ayat ini orang tua dst. ke atas. Oleh karena itu, orang tua tidak dibunuh karena membunuh anak sebagaimana diterangkan dalam As Sunnah. Hal ini, karena tidak termasuk adil jika orang tua dibunuh karena membunuh anaknya, padahal orang tua memiliki rasa sayang yang dalam kepada anaknya, di mana tidak ada yang membuatnya melakukan pembunuhan selain karena ada kerusakan pada akalnya atau karena disakiti dengan kejam oleh anaknya. Yakni maaf dari wali si terbunuh atau sebagian wali dengan beralih kepada diat, maka qishas menjadi gugur dan wajib gantinya, yaitu diat. Dan maaf yang terbaik adalah dengan memaafkannya secara cuma-cuma. Disebutkan kata \"saudaranya\" untuk mengajak memberikan maaf dan untuk memberitahukan bahwa pembunuhan tidak sampai memutuskan persaudaraan iman. Misalnya dalam menuntut diat tidak dengan kasar. Qishaash ialah mengambil pembalasan yang sama. Qishaash itu tidak dilakukan, bila yang membunuh mendapat maaf dari ahli waris yang terbunuh, yaitu dengan membayar diat (ganti rugi). Pembayaran diat diminta dengan baik, misalnya dengan tidak mendesak yang membunuh, dan yang membunuh hendaklah membayarnya dengan baik, misalnya tidak menangguhkannya dan tidak mengurangi jumlah diat, karena balasan terhadap perbuatan baik adalah dengan berbuat baik pula. Bila ahli waris korban membunuh yang bukan si pembunuh, atau membunuh si pembunuh setelah menerima diat padahal Allah telah menjelaskan hukum-hukum ini, maka terhadapnya di dunia diambil qishaash dan di akhirat dia mendapat siksa yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 178",
    "description": "Wahai orang-orang yang beriman! diwajibkan atas kamu melaksanakan kisas, hukuman yang semisal dengan kejahatan yang dilakukan atas diri manusia berkenaan dengan orang yang dibunuh apabila keluarga korban tidak memaafkan pembunuh. Ketentuannya adalah orang merdeka dengan orang merdeka, hamba sahaya dengan hamba sahaya, perempuan dengan perempuan. Tetapi barang siapa memperoleh maaf dari saudaranya, yakni keluarga korban, hendaklah dia mengikutinya dengan baik, yaitu meminta ganti dengan diat (tebusan) secara baik tanpa niat memberatkan, dan pembunuh hendaknya membayar diat kepadanya dengan baik pula dan segera, tidak menunda-nunda dan tidak mengurangi dari jumlah yang sudah disepakati, kecuali jika keluarga pihak terbunuh memaafkan pembunuh dan juga tidak menuntut diat. Ketentuan hukum yang demikian itu, yaitu kebolehan memaafkan pembunuh dan diganti dengan diat atau tebusan, adalah keringanan dan rahmat dari tuhanmu supaya tidak ada pembunuhan yang beruntun dan permusuhan dapat dihentikan dengan adanya pemaafan. Barangsiapa melampaui batas setelah itu dengan berpura-pura memaafkan pembunuh dan menuntut diat, tetapi setelah diat dipenuhi masih tetap melakukan pembunuhan terhadap pembunuh, maka ia telah berbuat zalim dan akan mendapat azab yang sangat pedih kelak di akhirat. Ayat ini mengisyaratkan bahwa pemaafan itu tidak boleh dipaksakan, sekalipun memaafkan lebih bagus daripada menghukum balik dengan hukuman yang setimpal. ' dan Allah menegaskan pada ayat ini bahwa di dalam kisas itu ada jaminan keberlangsungan kehidupan bagimu, wahai manusia. Sebab, jika seseorang menyadari kalau dia akan dibunuh apabila melakukan pembunuhan, maka dia akan memperhitungkan dengan sangat saksama ketika mau melakukan pembunuhan. Isyarat ayat ini ditujukan kepadamu, wahai orang-orang yang berakal yang mampu memahami hikmah adanya hukuman kisas dan memiliki pikiran yang bersih, agar kamu bertakwa, takut kepada Allah apabila melanggar ke-tentuan hukum yang sudah ditetapkan oleh Allah."
  }
]