[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi kalian dalam penerapan syariat qishas ini dan pemberlakuannya secara nyata akan ada kehidupan yang aman dan tentram (bagi orang-orang yang berakal sehat), semoga kalian bertakwa kepada Allah dan takut kepada Nya dengan menaati Nya secara terus menerus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "179. Di dalam syariat Allah tentang kisas itu terdapat kehidupan bagi kalian, karena dapat mencegah pertumpahan darah dan menghindarkan tindak kekerasan di antara kalian. Hikmah itu dapat ditangkap oleh orang-orang berakal sehat yang bertakwa kepada Allah dengan cara tunduk kepada hukum Allah dan menjalankan perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "179. Hai manusia, dalam hukum qishash ini terdapat kehidupan yang aman dalam masyarakat bagi kalian hai orang-orang yang memiliki akal sehat. Hal ini agar kalian takut terhadap siksa Allah di dunia dan di akhirat. Yang dimaksud dengan orang-orang yang berakal sehat adalah orang-orang yang taat kepada Allah dan rasul-Nya, sebagaimana firman Allah: الَّذِيْنَ يَسْتَمِعُوْنَ الْقَوْلَ فَيَتَّبِعُوْنَ اَحْسَنَهٗ ۗ اُولٰۤىِٕكَ الَّذِيْنَ هَدٰىهُمُ اللّٰهُ وَاُولٰۤىِٕكَ هُمْ اُولُوا الْاَلْبَابِ (yaitu) mereka yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah orang-orang yang mempunyai akal sehat. (az-Zumar: 18)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "179. وَلَكُمْ فِى الْقِصَاصِ حَيَوٰةٌ (Dan dalam qishaash itu ada (jaminan kelangsungan) hidup bagimu) Yakni bila dilihat dari sisi efek qishash ini berupa keengganan manusia untuk saling membunuh. لَعَلَّكُمْ تَتَّقُونَ (supaya kamu bertakwa) Yakni agar berhati-hati dalam urusan nyawa supaya tidak mendapat qishash."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ } Mengandung makna yang banyak, walaupun lafazhnya sedikit, diantaranya : bahwa manusia ketika ia mengetahui akibat dari pembunuhan adalah qishas ia sadar untuk tidak membawa dirinya kepada jalan yang mengakibatkannya diri menrengguh nyawa orang lain, maka dengan kesadaran ini segala upaya pembunuhan diantara manusia akan terangkat, dan dengan kesadaran itu pula kehidupan akan terus berlanjut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "179. Dan dalam hukuman qishash atas dasar kesepadanan bagi pelaku kriminal yang melakukan pembunuhan atau sesuatu yang menyakitkan itu ada kehidupan yang aman bagi kalian, wahai orang yang memiliki akal sehat, sebagai ganti kebiasaan balas dendam, karena pembunuh itu akan menghindar jika tahu bahwa dia akan dibunuh, serta supaya kalian takut melakukan pembunuhan melalui teror qishash dan azab akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi kalian dalam qisas itu ada kehidupan, wahai orang-orang yang berakal agar kalian bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "179. “Dan dalam qishash itu ada kelangsungan hidup bagimu,” maksudnya, dengan hukum itu terjagalah darah dan terkendali lah orang-orang yang jahat, karena barang siapa yang mengetahui bahwasanya dia akan dibunuh apabila dia membunuh, niscaya tidak akan terbersit darinya tindakan pembunuhan, dan apabila seorang pembunuh disaksikan dibunuh, niscaya orang lain akan merasa takut dan tercegah dengan hal itu. Seandainya saja hukuman bagi seorang pembunuh bukan hukuman mati, pastilah kejahatan itu tidak akan mampu dicegah sebagaimana dengan pencegahan yang mampu dilakukan oleh hukuman mati. Dan seperti itulah seluruh hukum-hukum had syariat yang mengandung pemaksaan dan pencegahan sebagai hal yang menunjukkan hikmah dari Dzat Yang Maha bijaksana lagi maha pengampun. Kata “kelangsungan hidup” dinyatakan dalam bentuk kata benda tidak tertentu (nakirah), maksudnya adalah untuk pengagungan dan mencakup secara luas. Dan ketika hukum ini tidak diketahui hakikatnya nya kecuali oleh para cendekiawan dan ulama, maka Allah menghadapkan perkataanNya secara khusus kepada mereka. Ini menunjukkan bahwa Allah sangat suka apabila hamba-hambaNya mau memakai akalnya dan pemikirannya untuk merenungi hikmah hikmah dibalik hukum-hukumNya dan kemaslahatan kemaslahatan yang menunjukkan kesempurnaan, hikmah, pujian, keadilan, dan rahmatNya yang luas. Dan barangsiapa yang berkedudukan seperti itu, sesungguhnya dia telah berhak mendapatkan pujian bahwasanya dia termasuk dari orang-orang berakal yang perkataan itu dihadapkan kepada mereka dan disuruh oleh Tuhan dari segala yang dituhankan. Dan cukuplah dengan itu sebagai kemuliaan dan kehormatan bagi orang-orang yang berfikir. Dan firmanNya, “Agar kamu bertakwa,” hal itu karena barangsiapa yang mengenal robbnya dan mengetahui apa yang tersimpan di balik agama dan syariatNya dari rahasia-rahasia yang agung, hikmah-hikmah yang indah dan ayat-ayat yang luhur, maka pastilah dengan hal itu dia tunduk kepada perintah Allah, dia menganggap besar kemaksiatan kepadaNya hingga dia meninggalkannya, dan akhirnya dia berhak menjadi salah seorang diantara orang-orang yang bertakwa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡقِصَاصِ } al-Qishas : Persamaan dalam hal bunuh membunuh, luka dan melukai, serta persamaan dalam alat yang digunakan untuk membunuh atau melukai. { حَيَوٰةٞ } Hayaat : Menyelamatkan kehidupan secara menyeluruh dan mencakup setiap orang. Karena orang yang memiliki keinginan untuk menumpahkan darah orang lain akan teringat bahwasanya ia akan dibunuh, sehingga ia akan meninggalkannya dan orang yang akan dibunuh tetap hidup, begitu juga orang yang berniat untuk membunuh itu, dan orang banyak akan tetap hidup dengan hidupnya mereka berdua. { أُوْلِي ٱلۡأَلۡبَٰبِ } Ulil albab : Orang yang memiliki akal pikiran. Bentuk tunggalnya adalah lubb, yaitu kecerdasan yang ada pada orang yang berakal. { لَعَلَّكُمۡ تَتَّقُونَ } La’alakum tattaqun : Menjanjikan kepada kalian dengan syariat yang penuh kasih sayang ini untuk menjaga hal yang membahayakan dan tidak menyenangkan di dunia dan akhirat. Pelajaran dari ayat: Kemudian Allah Ta’ala mengabarkan bahwa dalam hukum qishash yang disyariatkan dan diwajibkan kepada kita dengan keringanan, terdapat kehidupan yang amat besar. Karena dapat mencegah hilangnya nyawa dan tertumpahnya darah. Allah Ta’ala berfirman :”Dan dalam qishash itu ada jaminan kelangsungan hidup bagimu, waha orang-orang yang berakal, supaya kamu bertakwa.” Pelajaran dari ayat: • Keindahan gramatikal Al-Qur’an, dimana para penyair Arab pada masa jahiliyah dahulu mengatakan,”Pembunuhan itu akan menghilangkan pembunuhan yang lain.” Namun dalam al-Qur’an disebutkan,”Dan bagi kamu sekalian dalam (hukum) qishash terdapat kehidupan.” Tidak sekalipun menyebutkan kata al-qatl (pembunuhan). Ini berarti membuktikan bahwa al-Qur’an menafikan terjadinya pembunuhan baik secara lafazh maupun realita yang terjadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 179: Ketahuilah wahai pemilik akal yang sehat bahwasannya Allah mensyariatkan qishas kepada kalian agar terjaga darah dan terciptanya kehidupan yang aman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni adanya syari'at qishas terdapat jaminan kehidupan yang aman bagi kita selanjutnya. Hal itu, karena orang yang hendak membunuh, jika mengetahui bahwa dia akan dibunuh juga, maka ia akan berhenti melakukan tindakan pembunuhan, sehingga ia sama saja menghidupkan yang lainnya. Demikian pula had-had dalam Islam lainnya, tujuannya untuk menjaga jiwa, harta, akal, kehormatan, agama dan membuat jera pelakunya. Ayat ini menunjukkan bahwa Allah Subhaanahu wa Ta'aala menyukai hamba-hamba-Nya yang mau menggunakan akal dan pikirannya untuk memikirkan hikmah di balik ketetapan-Nya yang bijak dan maslahat yang ada di dalam ketetapan itu, di mana itu semua menunjukkan kesempurnaannya, kesempurnaan hikmah-Nya, adil-Nya dan rahmat-Nya yang luas. Demikian juga menunjukkan bahwa orang-orang yang seperti ini berhak mendapatkan pujian termasuk orang-orang yang berakal, kepada mereka ditujukan panggilan ini, dan cukuplah yang demikian sebagai keutamaan bagi orang-orang yang mengerti. Hal ini, karena orang yang mengenal Tuhannya, mengenal isi agama dan syari'at-Nya yang mengandung rahasia yang dalam serta hikmah yang indah membuatnya tunduk kepada perintah-perintah Allah, merasakan hal yang sangat fatal jika sampai bermaksiat kepada-Nya, dengan begitu ia menjadi orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 179",
    "description": "Dan Allah menegaskan pada ayat ini bahwa di dalam kisas itu ada jaminan keberlangsungan kehidupan bagimu, wahai manusia. Sebab, jika seseorang menyadari kalau dia akan dibunuh apabila melakukan pembunuhan, maka dia akan memperhitungkan dengan sangat saksama ketika mau melakukan pembunuhan. Isyarat ayat ini ditujukan kepadamu, wahai orang-orang yang berakal yang mampu memahami hikmah adanya hukuman kisas dan memiliki pikiran yang bersih, agar kamu bertakwa, takut kepada Allah apabila melanggar ke-tentuan hukum yang sudah ditetapkan oleh Allah. Diwajibkan atas kamu, wahai orang-orang yang beriman, apabila tanda-tanda maut atau kematian hendak menjemput seseorang di antara kamu seperti usia tua, rambut memutih, gigi rontok, kulit mengendur, jika dia meninggalkan harta yang banyak, maka hendaknya berwasiat dan memberi pesan yang disampaikan kepada orang lain untuk dilaksanakan setelah kamu meninggal dunia. Wasiat tersebut adalah untuk kedua orang tua yang terhalang menerima waris, karena beda agama atau hamba sahaya/tawanan perang dan untuk karib kerabat yang tidak berhak mendapatkan harta warisan, dengan ketentuan wasiat tersebut dilaksanakan dengan cara yang baik dan tidak merugikan ahli waris. Supaya tidak merugikan ahli waris, maka wasiat tidak boleh lebih dari sepertiga harta yang ditinggalkan oleh pemberi wasiat. Ketentuan hukum wasiat ini sebagai kewajiban bagi orang-orang yang bertakwa yang menaati perintah Allah."
  }
]