[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah mewajibkan atas kalian jika salah seorang dari kalian kedatangan tanda-tanda kematian dengan gejala-gejala awalnya (jika dia meninggalkan harta) untuk membuat wasiat dengan sebagian hartanya tadi kepada kedua orang tuanya dan kaum kerabat dengan mempertimbangkan aspek keadilan, maka janganlah membiarkan orang yang miskin dan malah berwasiat bagi orang yang kaya, dan tidak melebihi sepertiga dari harta, itu adalah satu kepastian yang harus dilaksanakan oleh orang-orang yang bertakwa yang takut kepada Allah. Dan hukum ini berlaku sebelum turunnya ayat-ayat tentang warisan yang Allah telah menentukan didalamnya bagian tiap ahli waris."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "180. Apabila tanda-tanda dan sebab-sebab kematian datang kepada salah seorang di antara kalian, manakala ia mempunyai banyak harta, ia harus membuat wasiat untuk kedua orang tuanya dan karib kerabatnya menurut batasan yang telah ditetapkan oleh Allah, yaitu tidak lebih dari sepertiga harta. Hal itu merupakan kewajiban yang ditekankan bagi orang-orang yang bertakwa kepada Allah. Hukum ini berlaku sebelum ayat-ayat tentang pembagian harta warisan diturunkan. Setelah ayat-ayat tentang pembagian harta warisan turun, ada penjelasan lengkap tentang siapa yang berhak mendapatkan hak waris dari si mayit dan berapa kadarnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "180. Hai orang-orang yang beriman, apabila salah seorang dari kalian didatangi ajal, sedangkan ia memiliki sejumlah harta, maka wajib baginya mewasiatkan sebagian hartanya bagi kedua orangtua dan kerabatnya secara adil dan baik. Yang demikian ini wajib atas orang-orang bertakwa yang takut kepada Allah. Namun kemudian hukum wasiat bagi ahli waris ini dinasakh (dihapus), sehingga wasiat hanya diperbolehkan bagi selain ahli waris."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "180. كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ (Diwajibkan atas kamu, apabila seorang di antara kamu kedatangan maut) Datangnya kematian yakni dengan datangnya sebab-sebabnya dan alamat-alamatnya, ketika itulah diwajibkan berwasiat karena sudah tidak ada kesempatan lain. إِن تَرَكَ خَيْرًا (jika ia meninggalkan harta) Yakni apabila meninggalkan harta yang banyak maka wajib baginya mewasiatkan sebagiannya untuk orang tua dan kerabatnya dan sisanya untuk anak-anaknya. Namun ini adalah hukum pada masa awal Islam, kemudian ayat ini dinasakh dengan ayat-ayat tentang warisan. بِالْمَعْرُوفِ ۖ (secara ma’ruf (baik) ) Yakni secara adil tanpa pengurangan atau penambahan. Dan Allah mengizinkan untuk berwasiat dengan sepertiga harta dan tidak boleh dari itu. حَقًّا (kewajiban) Yakni hukumnya wajib."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "180. Diwajibkan atas kalian jika menghadapi tanda-tanda kematian untuk memberi wasiat kepada kedua orang tua, dan kerabat selain ahli waris dengan adil sehingga tidak ada yang melampaui batas takaran sepertiga dari harta warisan. Itu adalah kewajiban bagi orang-orang yang bertakwa. Dan pembahasan terkait ayat harta warisan telah dinasakh di surah An-Nisa’ (ayat 11) dan hukum wasiat itu menjadi sunnah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diwajibkan atas kalian} diwajibkan atas kalian {apabila datang kepada seseorang di antara kalian sedang dia meninggalkan kebaikan} dia meninggalkan harta yang banyak {suatu wasiat kepada kedua orang tua dan karib kerabat dengan cara yang patut} dengan adil, dengan tidak menambah (bagian) melebihi sepertiga {sebagai kewajiban bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "180. Maksudnya, Allah telah mewajibkan kepada kalian Wahai orang-orang yang beriman, “apabila seorang diantara kamu kedatangan (tanda-tanda) maut,” yaitu sebab-sebabnya, seperti sakit yang membawa kepada kematian, adanya sebab sebab kematian, di mana orang bersangkutan “meninggalkan harta,” yakni harta yang banyak menurut adat, maka wajiblah atasnya berwasiat untuk kedua orang tuanya dan orang yang paling dekat kepadanya dengan baik sesuai dengan kondisinya, tanpa melampaui batas dan tidak pula hanya memberikan yang terjauh dari keluarga tanpa yang dekat, namun ia harus mengatur sesuai dengan kedekatan dan kebutuhan. Oleh karena itu, ayat ini hadir dengan kata comparative (perbandingan yang mana lebih utama). Dan FirmanNya, “kewajiban atas orang-orang yang bertaqwa,” ini menunjukkan bahwa berwasiat itu wajib hukumnya, karena haq itu artinya adalah yang tetap (tsabit), dan Allah telah menjadikannya sebagai konsekuensi dari ketakwaan. Ketahuilah, bahwasanya mayoritas ulama tafsir berpendapat bahwa ayat ini telah dinasakh oleh ayat-ayat tentang warisan, dan sebagian lagi berpendapat bahwa ayat ini tentang kedua orang tua dan kerabat yang bukan ahli waris, padahal tidak ada dalil sama sekali yang mengkhususkan seperti itu. Yang paling terbaik dalam hal ini, dikatakan bahwa wasiat untuk kedua orang tua dan kerabat secara umum, Allah kembalikan kepada kebiasaan yang berlaku, lalu Allah menentukan bagi kedua orang tua yang ikut mewarisi dan selain keduanya dari para kerabat yang mewarisi, dari kebaikan (harta tersebut) dalam ayat-ayat warisan yang sebelumnya masih umum. Kemudian masih tersisa ketetapan bagi orang-orang yang tidak mewarisi dari kedua orang tua yang terhalang (mahjub) mendapatkan warisan dan selain mereka berdua diantara orang-orang yang terhalangi oleh seseorang atau sesuatu hal, maka disini seseorang diperintahkan untuk berwasiat untuk mereka dan mereka adalah orang yang paling berhak untuk diperlakukan dengan baik. Pernyataan ini telah disepakati oleh seluruh umat, dan inilah yang menyatukan antara kedua pendapat terdahulu, karena setiap dari kedua kelompok itu memandang suatu sisi tertentu dan dengan sumber yang berbeda, maka dengan penyatuan ini terwujudlah kesepakatan dan penyatuan antara beberapa ayat, Karena bagaimanapun penyatuan itu mampu dilakukan, maka hal itu lebih baik daripada hanya menduga adanya nasakh namun tidak ada dalil Shahih yang mendasarinya. Dan ketika ada kemungkinan seseorang tidak mau berwasiat karena ada dugaan, bahwa setelah kematiannya wasiatnya itu akan dirubah, maka Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { كُتِبَ } Kutiba : Diwajibkan dan ditetapkan { خَيۡرًا } Khairan : Harta yang tunai, atau materi, atau harta yang tidak bergerak. { ٱلۡوَصِيَّةُ } al-Washiyah : Wasiat berupa harta atau yang lainnya. { ٱلۡمَعۡرُوفِۖ } al-Ma’ruf : halyang dikenal oleh manusia yang berhubungan dengan jumlah, banyak ataupun sedikit, yang penting tidak melebihi sepertiganya. Makna ayat : Bersesuaian dengan penyebutan ayat mengenai qishash dimana disebutkan bahwa orang yang membunuh akan dihukum dengan dibunuh juga, seharusnya bagi orang yang membunuh itu untuk meninggalkan wasiat tentang hartanya sebelum dimulainya hukuman qishash. Allah Ta’ala menyebutkan ayat tentang wassiat di sini dengan firman Nya : “Diwajibkan bagi kalian” wahai kaum muslimin “Jika telah datang tanda-tanda kematian, jika ia meninggalkan harta agar berwasiat.” Maksudnya dengan memberikan wasiat untuk kedua orangtuanya, para kerabatnya dengan baik, sebagai suatu kewajiban bagi orang-orang yang bertakwa. Kemudian Allah menganulir (nasakh) hukum dalam ayat ini dengan ayat tentang warisan. Rasulullah ﷺ bersabda,”Tidak ada wasiat bagi ahli waris.” Hukum mengenai kewajiban untuk membuat wasiat ini dihapus, sehingga hukumnya turun menjadi sunnah akan tetapi untuk selain orangtua dan kerabat dekat yang merupakan ahli waris, kecuali jika para ahli waris menyetujui, dan wasiat itu tidak melebihi sepertiga harta atau kurang. Apabila melebihi itu dan para ahli waris menyetujui maka diperbolehkan, berdasarkan hadits dari Ibnu Abbas yang diriwayatkan oleh Daruquthni,”Tidak diperbolehkan wasiat untuk ahli waris kecuali disetujui oleh para ahli waris yang ada.” Kemudian dalil mengenai kesunnahan untuk membuat wasiat adalah hadits Sa’ad dalam kitab Shahih, dimana Rasulullah ﷺ mengizinkannya untuk membuat wasiat lebih dari sepertiga harta. Terkadang wasiat wajib bagi seorang muslim, tatkala ia meninggalkan hutang dan hak-hak yang wajib dibayarkan dan ditunaikan sebagai tanggungannya. Dalam kondisi seperti itu, ia wajib berwasiat untuk membayarkan hutang dan menunaikan hak-hak setelah ia meninggal berdasarkan hadits Ibnu Umar dalam kitab shahih: ما حق امرئ مسلم له شيء يوصي فيه يبيت ليلتين إلا ووصيته مكتوبة عنده “Tidak dibenarkan bagi seorang muslim yang memiliki sesuatu yang bisa diwasiatkan, dia bermalam selama dua malam kecuali wasiatnya harus tertulis di sisinya.” Inilah kandungan ayat 180. Pelajaran dari ayat : • Dihapusnya hukum wasiat bagi ahli waris secara mutlak kecuali mendapat persetujuan dari para ahli waris. • Anjuran untuk membuat wasiat atas hartanya bagi orang yang meninggalkan harta berlimpah, berwasiat agar digunakan untuk berbagai amalan kebaikan. • Sangat dianjurkan untuk berwasiat tatkala tanda-tanda kematian sudah datang atau bagi yang belum datang tanda-tandanya bagi orang yang memiliki hak pada orang lain atau memiliki tanggungan kepada orang lain, dikhawatirkan akan meninggal sehingga dia akan menanggung dosa apabila hak dan kewajibannya tidak ditunaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 180: Allah mengabarkan bahwasannya wajib atas setiap mukmin yang diberikan harta untuk membayar hutang dan menulis wasiat bagi kedua orang tua , kerabatnya dengan adil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya sakit yang membawa kepada kematian. Ma'ruf ialah adil dan baik, yaitu dengan tidak melebihi sepertiga dari seluruh harta peninggalan atau berlebihan dan tidak mengutamakan yang kaya atau keluarga yang jauh sedangkan yang dekat tidak diperhatikan. Ayat ini tidak berlaku untuk ahli waris karena sudah dinasakh dengan ayat tentang warisan (yaitu An Nisaa': 11) dan hadits \"laa washiyyata liwaarits\" (tidak ada wasiat bagi ahli waris) diriwayatkan oleh Tirmidzi. Namun sebagian ulama menggabung antara ayat ini dengan ayat 11 surah An Nisaa’, yaitu dibawa ayat di atas kepada wajibnya berwasiat kepada kedua orang tua dan kerabat yang tidak mendapatkan warisan karena ada penghalang, seperti beda agama, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 180",
    "description": "Diwajibkan atas kamu, wahai orang-orang yang beriman, apabila tanda-tanda maut atau kematian hendak menjemput seseorang di antara kamu seperti usia tua, rambut memutih, gigi rontok, kulit mengendur, jika dia meninggalkan harta yang banyak, maka hendaknya berwasiat dan memberi pesan yang disampaikan kepada orang lain untuk dilaksanakan setelah kamu meninggal dunia. Wasiat tersebut adalah untuk kedua orang tua yang terhalang menerima waris, karena beda agama atau hamba sahaya/tawanan perang dan untuk karib kerabat yang tidak berhak mendapatkan harta warisan, dengan ketentuan wasiat tersebut dilaksanakan dengan cara yang baik dan tidak merugikan ahli waris. Supaya tidak merugikan ahli waris, maka wasiat tidak boleh lebih dari sepertiga harta yang ditinggalkan oleh pemberi wasiat. Ketentuan hukum wasiat ini sebagai kewajiban bagi orang-orang yang bertakwa yang menaati perintah Allah barang siapa mengubahnya, yaitu mengubah isinya saat menyampaikannya dengan menambah atau mengurangi wasiat itu, atau menyembunyikan dan tidak menyampaikannya setelah penerima wasiat mendengarnya, boleh jadi karena dia sebagai penerima wasiat, sebagai pencatat, atau sebagai saksi, maka sesungguhnya dosanya hanya bagi orang yang mengubahnya dan tidak menyampaikannya kepada yang berhak. Ia sudah mengkhianati amanat yang diterimanya, dan itu sama hukumnya dengan mengkhianati Allah dan rasul-Nya. Sungguh, Allah maha mendengar seluruh pembicaraan yang disampaikan oleh pemberi wasiat dan juga bisikan hati orang yang mengubah atau menyembunyikan wasiat. Allah maha mengetahui isi wasiat yang dalam bentuk tulisan dan segala perbuatan yang dilakukan oleh pihak yang terlibat."
  }
]