[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barangsiapa mengubah-ubah isi wasiat orang yang meninggal setelah mendengar isi wasiat darinya sebelum kematiannya, maka dosa itu menjadi tanggungan orang yang mengubah dan menggantinya, Sesungguhnya Allah maha mendengar wasiat kalian dan perkataan kalian, Maha mengetahui yang dirahasiakan hati kalian baik kecenderungan kepada kebenaran dan keadilam atau kecenderungan kepada kekurangan dan kesewenang-wenangan dan Allah akan memberikan balasan kepada kalian atas tindakan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "181. Barangsiapa yang merubah wasiat dengan cara menambah, mengurangi atau menghalangi seseorang dari haknya setelah ia mengetahui isi wasiat tersebut, sesungguhnya dosa perubahan itu menjadi tanggung jawab orang yang merubahnya, bukan tanggung jawab orang yang membuat wasiat. Sesungguhnya Allah Maha Mendengar ucapan hamba-hamba-Nya lagi Maha Mengetahui perbuatan mereka. Tidak ada sesuatupun hal-ihwal mereka yang luput dari pengetahuan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "181. Dan barangsiapa yang mengubah wasiat setelah ia mendengarnya dari orang yang memberi wasiat, maka dosanya hanya bagi orang yang mengubah. Sungguh Allah Maha Mendengar perkataan kalian dan Maha Mengetahui niat kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "181. فَمَنۢ بَدَّلَهُۥ (Maka barangsiapa yang mengubah wasiat itu) Yakni mengubah wasiat. ( بَعْدَمَا سَمِعَهُۥ فَإِنَّمَآ إِثْمُهُۥ عَلَى الَّذِينَ يُبَدِّلُونَهُۥٓ ۚ setelah ia mendengarnya, maka sesungguhnya dosanya adalah bagi orang-orang yang mengubahnya) Adapun orang yang berwasiat sudah tidak ada sangkut pautnya lagi karena ia telah menyelesaikan kewajibannya dengan berwasiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "181. Barangsiapa mengubah wasiat setelah mendengarnya dari pemberi wasiat, dan dia menjadi saksi atau pengemban wasiat, maka dosa perubahan wasiat itu bagi orang yang mengubahnya, bukan kepada pemberi wasiat yang sudah mati. Sesungguhnya Allah itu Maha Mendengar ucapan-ucapan pemberi wasiat dan orang yang mengubahnya dan maha Mengetahui niat dan maksud mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang mengubahnya} mengubah isi wasiat itu {setelah mendengarnya} setelah mendengar ucapan pemberi wasiat {sesungguhnya dosanya} dosa mengubah (isi wasiat) {hanya bagi orang-orang yang mengubahnya. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "181-182. “Maka Barang siapa yang merubah wasiat itu,” yakni wasiat bagi orang-orang yang disebutkan atau selain mereka, “setelah ia mendengarnya,” maksud nya setelah dia memahaminya, mengetahui jalannya, dan pelaksanaannya, “maka dosanya adalah bagi orang-orang yang mengubahnya.” Kalau tidak demikian, maka sesungguhnya orang yang berwasiat itu telah tetap pahalanya di sisi Allah, sedangkan dosanya adalah atas orang yang merubah wasiat tersebut. “sesungguhnya Allah maha mendengar.” Dia mendengar seluruh suara dan diantaranya adalah bahwa Dia mendengar tentang isi wasiat dari seorang yang berwasiat, maka sepatutnya ia menyadari bahwa dzat yang maha mendengar lagi maha melihat selalu mengawasinya, dan ia tidak boleh berlaku zalim dalam wasiat itu, “lagi maha mengetahui” tentang niatnya dan mengetahui tentang perbuatan orang yang diberikan wasiat tersebut. Apabila seorang yang berwasiat telah berusaha dan Allah mengetahui niatnya, maka Allah akan membalasnya (dengan pahala) walaupun ia salah. Dalam ayat ini terkandung peringatan bagi orang yang diberikan (dititipkan) wasiat untuk tidak merubahnya, karena Allah maha mengetahui hal itu dan mengawasi segala apa yang ia kerjakan, maka waspadalah dari pengawasan Allah. Ini adalah hukum wasiat yang adil. Sedangkan wasiat yang mengandung kesewenang-wenangan, ketidakadilan, dan dosa, maka seyogyanya orang yang menyaksikan orang yang berwasiat saat melakukan wasiat untuk memberikan nasihat kepadanya dengan apa yang terbaik dan paling adil, dan agar ia mencegahnya dari kezhaliman dan ketidakadilan tersebut yaitu condong karena suatu kesalahan yang tidak disengaja. Sedangkan dosa itu adalah bila disengaja dalam melakukannya. Namun bila orang yang menyaksikan itu tidak melakukan hal di atas, maka sebaiknya ia mendamaikan antara orang-orang yang diwasiatkan kepada mereka dan berusaha menciptakan keadilan diantara mereka dalam bentuk kesepakatan bersama dan perdamaian, dan menasihati mereka agar menunaikan segala kewajiban-kewajiban yang ditanggung orang yang meninggal dari mereka tersebut, maka orang ini telah melakukan kebaikan yang agung dan tidak ada dosa baginya sebagaimana yang harus ditanggung oleh orang yang merubah wasiat yang dholim tersebut, Oleh karena itu, Allah berfirman “Sesungguhnya Allah maha pengampun,” maksudnya, Dia mengampuni seluruh ketergelinciran, memaafkan kesalahan bagi orang yang bertaubat kepadaNya, dan diantaranya adalah ampunanNya terhadap orang yang menahan nafsunya selalu menggugurkan sebagian hak-haknya demi saudaranya, karena barangsiapa yang memaafkan niscaya Allah akan memaafkannya. Dan Allah akan mengampuni dosa mayat yang berbuat dholim pada wasiatnya tersebut jika keluarga mayit mau saling memaafkan, demi menggugurkan kewajiban si mayit, “lagi maha penyayang” kepada hamba-hambaNya yaitu dengan mensyariatkan kepada mereka segala perkara yang dengannya mereka saling berkasih sayang dan berkasih mesra. Ayat ayat ini menunjukkan tentang anjuran untuk berwasiat, dan menjelaskan untuk siapa wasiat itu diperuntukkan, dan juga tentang ancaman terhadap orang yang merubah wasiat yang adil, serta anjuran untuk mendamaikan pada wasiat yang dholim,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { التبديل } at-Tabdil : Mengganti dengan sesuatu yang lain. Makna ayat: Adapun ayat 181 Allah Ta’ala berfirman kepada hamba-hamba Nya yang mukmin, bahwa barangsiapa yang mengganti wasiat seorang mukmin, dengan menambah, mengurangi, atau merubahnya, tau menggantinya dengan jenis yang lain, maka orang yang berwasiat tidaklah berdosa, namun dosanya akan ditanggung oleh orang yang merubahnya. Kemudian Allah menutup hukum ini dengan firman Nya bahwa Allah Maha mendengar, Maha melihat, sebagai bentuk ancaman bagi orang yang berani mengubah isi wasiat untuk tujuan yang buruk dan nafsu yang jahat. Pelajaran dari ayat: • Keharaman mengubah isi wasiat dan menggantinya kepada sesuatu yang tidak layak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 181: Allah mengabarkannya barang siapa yang merubah wasiat ini atau menyembunyikannya; maka sungguh baginya dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Biasanya pemberi wasiat keberatan memberikan wasiat karena khawatir dirubah setelahnya, maka Allah Subhaanahu wa Ta'aala menghibur agar tidak khawatir. Baik dilakukan oleh saksi maupun orang yang menerima wasiat setelah ia mengetahuinya atau mengerti. Adapun pemberi wasiat tetap mendapatkan pahalanya di sisi Allah. Allah Maha Mendengar semua suara termasuk wasiat yang disampaikan pemberi wasiat serta Mengetahui tindakan penyelewengan dan apa yang disembunyikan dalam hati manusia berupa kecenderungan kepada keadilan atau kezaliman dan Dia akan memberikan balasan terhadapnya. Ayat ini berkenaan wasiat yang adil, adapun wasiat yang tidak adil atau ada kezaliman di sana, maka bagi yang hadir ketika wasiat disampaikan hendaknya menasehatinya agar wasiatnya mengarah kepada yang lebih baik dan lebih adil serta melarangnya bersikap zalim baik sengaja atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 181",
    "description": "Barang siapa mengubahnya, yaitu mengubah isinya saat menyampaikannya dengan menambah atau mengurangi wasiat itu, atau menyembunyikan dan tidak menyampaikannya setelah penerima wasiat mendengarnya, boleh jadi karena dia sebagai penerima wasiat, sebagai pencatat, atau sebagai saksi, maka sesungguhnya dosanya hanya bagi orang yang mengubahnya dan tidak menyampaikannya kepada yang berhak. Ia sudah mengkhianati amanat yang diterimanya, dan itu sama hukumnya dengan mengkhianati Allah dan rasul-Nya. Sungguh, Allah maha mendengar seluruh pembicaraan yang disampaikan oleh pemberi wasiat dan juga bisikan hati orang yang mengubah atau menyembunyikan wasiat. Allah maha mengetahui isi wasiat yang dalam bentuk tulisan dan segala perbuatan yang dilakukan oleh pihak yang terlibattetapi barang siapa khawatir karena mengetahui atau melihat tanda-tanda bahwa pemberi wasiat berlaku berat sebelah atau berbuat salah, baik disengaja maupun tidak, sehingga menyimpang dari ketentuan Allah, lalu dia mendamaikan antara mereka dengan meminta orang yang berwasiat berlaku adil dalam wasiatnya sesuai dengan ketentuan syariat islam, maka dia, yakni orang yang mendamaikan itu, tidak berdosa. Sungguh, Allah maha pengampun, maha penyayang kepada hambahamba-Nya yang bertobat."
  }
]