[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka siapa pun yang mengetahui terjadi pelencengan dari kebenaran dari seorang yang berwasiat dalam wasiatnya lantaran salah ucap atau sengaja, lalu dia menasihati si pemberi wasiat saat memberikan wasiatnya dengan sesuatu yang lebih adil, maka jika hal itu tidak berhasil, lalu dia meluruskan antara dua belah pihak dengan mengubah Isi wasiat supaya sejalan dengan perintah Syariah, maka tidak ada dosa yang menjadi tanggungannya dalam perkara ini. Sesungguhnya Allah maha pengampun bagi hamba-hamba Nya lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "182. Siapa melihat adanya penyimpangan dari kebenaran dan ketidak adilan dalam membuat wasiat oleh si pembuat wasiat, lalu dia memperbaiki kesalahan yang dilakukan oleh si pembuat wasiat melalui nasihatnya, dan mendamaikan orang-orang yang bersengketa atas wasiat tersebut, maka tidak ada dosa baginya, bahkan dia mendapatkan pahala atas usahanya tersebut. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertaubat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "182. Barangsiapa yang mengetahui kesalahan pemberi wasiat dalam berwasiat baik itu disengaja maupun tidak, dan ia hendak menyelesaikan perselisihan antara ahli waris dengan orang yang mendapat wasiat akibat wasiat yang mengandung kesalahan, maka tidak mengapa ia memperbaiki wasiat itu dengan merubahnya. Sungguh Allah Maha Besar ampunan-Nya bagi hamba-hamba-Nya, dan Maha Luas rahmat-Nya bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "182. جَنَفًا أَوْ إِثْمًا (berlaku berat sebelah atau berbuat dosa) (الجنف) yakni kesalahan (dalam berwasiat). (الإثم) yakni sengaja pilih kasih (pada salah satu yang diberi wasiat). فَأَصْلَحَ بَيْنَهُمْ (lalu ia mendamaikan antara mereka) Yakni memperbaiki apa yang terjadi diantara pada ahli waris berupa perselisihan dan kegoncangan akibat wasiat dengan cara membatalkan wasiat yang mengandung keburukan atau pelanggaran terhadap apa yang disyari’atkan Allah, dan dengan menetapkan wasiat yang sesuai dengan kebenaran dan keadilan, seperti wasiat untuk kerabat yang bukan ahli waris."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "182. Namun barangsiapa mengetahui bahwa pemberi wasiat itu berpaling dari kebenaran karena keliru atau karena sengaja, lalu dia (saksi) mendamaikan antara penerima wasiat dan pemberi wasiat ketika terjadi perselisihan dan pertentangan karena wasiat itu dengan meniadakan sesuatu yang membahayakan dan menyalahi syariat serta menetapkan kebenaran, maka tiada dosa baginya atas perbuatan adil ini. Sesungguhnya Allah itu Maha Pengampun lagi maha Penyayang bagi orang-orang yang mendamaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan siapa yang khawatir} mengetahui {bahwa pemberi wasiat tidak adil} menyimpang dari kebenaran {atau berbuat dosa} tidak adil dalam memberi wasiat {lalu dia membenarkan mereka, maka dia tidak berdosa. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "181-182. “Maka Barang siapa yang merubah wasiat itu,” yakni wasiat bagi orang-orang yang disebutkan atau selain mereka, “setelah ia mendengarnya,” maksud nya setelah dia memahaminya, mengetahui jalannya, dan pelaksanaannya, “maka dosanya adalah bagi orang-orang yang mengubahnya.” Kalau tidak demikian, maka sesungguhnya orang yang berwasiat itu telah tetap pahalanya di sisi Allah, sedangkan dosanya adalah atas orang yang merubah wasiat tersebut. “sesungguhnya Allah maha mendengar.” Dia mendengar seluruh suara dan diantaranya adalah bahwa Dia mendengar tentang isi wasiat dari seorang yang berwasiat, maka sepatutnya ia menyadari bahwa dzat yang maha mendengar lagi maha melihat selalu mengawasinya, dan ia tidak boleh berlaku zalim dalam wasiat itu, “lagi maha mengetahui” tentang niatnya dan mengetahui tentang perbuatan orang yang diberikan wasiat tersebut. Apabila seorang yang berwasiat telah berusaha dan Allah mengetahui niatnya, maka Allah akan membalasnya (dengan pahala) walaupun ia salah. Dalam ayat ini terkandung peringatan bagi orang yang diberikan (dititipkan) wasiat untuk tidak merubahnya, karena Allah maha mengetahui hal itu dan mengawasi segala apa yang ia kerjakan, maka waspadalah dari pengawasan Allah. Ini adalah hukum wasiat yang adil. Sedangkan wasiat yang mengandung kesewenang-wenangan, ketidakadilan, dan dosa, maka seyogyanya orang yang menyaksikan orang yang berwasiat saat melakukan wasiat untuk memberikan nasihat kepadanya dengan apa yang terbaik dan paling adil, dan agar ia mencegahnya dari kezhaliman dan ketidakadilan tersebut yaitu condong karena suatu kesalahan yang tidak disengaja. Sedangkan dosa itu adalah bila disengaja dalam melakukannya. Namun bila orang yang menyaksikan itu tidak melakukan hal di atas, maka sebaiknya ia mendamaikan antara orang-orang yang diwasiatkan kepada mereka dan berusaha menciptakan keadilan diantara mereka dalam bentuk kesepakatan bersama dan perdamaian, dan menasihati mereka agar menunaikan segala kewajiban-kewajiban yang ditanggung orang yang meninggal dari mereka tersebut, maka orang ini telah melakukan kebaikan yang agung dan tidak ada dosa baginya sebagaimana yang harus ditanggung oleh orang yang merubah wasiat yang dholim tersebut, Oleh karena itu, Allah berfirman “Sesungguhnya Allah maha pengampun,” maksudnya, Dia mengampuni seluruh ketergelinciran, memaafkan kesalahan bagi orang yang bertaubat kepadaNya, dan diantaranya adalah ampunanNya terhadap orang yang menahan nafsunya selalu menggugurkan sebagian hak-haknya demi saudaranya, karena barangsiapa yang memaafkan niscaya Allah akan memaafkannya. Dan Allah akan mengampuni dosa mayat yang berbuat dholim pada wasiatnya tersebut jika keluarga mayit mau saling memaafkan, demi menggugurkan kewajiban si mayit, “lagi maha penyayang” kepada hamba-hambaNya yaitu dengan mensyariatkan kepada mereka segala perkara yang dengannya mereka saling berkasih sayang dan berkasih mesra. Ayat ayat ini menunjukkan tentang anjuran untuk berwasiat, dan menjelaskan untuk siapa wasiat itu diperuntukkan, dan juga tentang ancaman terhadap orang yang merubah wasiat yang adil, serta anjuran untuk mendamaikan pada wasiat yang dholim,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { جَنَفًا أَوۡ إِثۡمٗا } Janafan au itsman : al-Janaf maksudnya adalah berbuat kesalahan sehingga melenceng dari kebenaran. Al-Itsm adalah menyengaja untuk keluar dari kebenaran dan keadilan. Makna ayat: Pada ayat 182 Allah Ta’ala mengabarkan bahwa barangsiapa yang takut bahwa orang yang membuat wasiat ini berlaku tidak adil sehingga melenceng dari kebenaran dan keadilan, lalu ia berlaku zhalim tanpa kesengajaan akan tetapi karena kesalahan atau takut berbuat dosa terhadap orang menerima wasiat, denga berlaku zhalim atau melampaui batas atas wasiat yang diketahui, lalu ia melakuukan perbaikan di antara mereka, yaitu antara orang yang menulis wasiat dan penerima wasiat maka tidak ada dosa baginya dengan perbuatannya memperbaiki kesalahan, dan membenarkan yang salah. Lantas Allah Ta’ala menutup ayat ini dengan firman Nya,”Sesungguhnya Allah Maha Pengampun lagi Maha penyayang.” Janji ampunan dan kasih sayang bagi orang yang berbuat salah tanpa kesengajaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 182: Allah mengabarkan bahwasannya siapa yang takut berbuat salah kepada ahli waris maka tidak diperbolehkan baginya melaksanakan wasiat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak sengaja maupun sengaja, seperti menambah wasiat melebihi sepertiga atau mengkhususkan kepada yang kaya. Yakni menyuruh orang yang berwasiat berlaku adil dalam mewasiatkan sesuai dengan batas-batas yang ditentukan syara'. Jika tidak berhasil, maka dia mengadakan shulh (damai) antara beberapa pihak (antara pemberi wasiat dan penerima wasiat) dengan mengadakan perubahan wasiat, maka tidak ada dosa baginya dalam masalah shulh ini. Dia mengampuni semua ketergelinciran, termasuk ke dalamnya ampunan-Nya bagi mereka yang merelakan sebagian haknya untuk saudaranya. Beberapa ayat di atas mendorong untuk mengadakan wasiat, menerangkan kepada siapa diberikan, menerangkan ancaman bagi yang mengubah wasiat yang adil dan dorongan untuk mengadakan islah dalam wasiat yang tidak adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 182",
    "description": "Tetapi barang siapa khawatir karena mengetahui atau melihat tanda-tanda bahwa pemberi wasiat berlaku berat sebelah atau berbuat salah, baik disengaja maupun tidak, sehingga menyimpang dari ketentuan Allah, lalu dia mendamaikan antara mereka dengan meminta orang yang berwasiat berlaku adil dalam wasiatnya sesuai dengan ketentuan syariat islam, maka dia, yakni orang yang mendamaikan itu, tidak berdosa. Sungguh, Allah maha pengampun, maha penyayang kepada hambahamba-Nya yang bertobatwahai orang-orang yang beriman! diwajibkan atas kamu berpuasa guna mendidik jiwa, mengendalikan syahwat, dan menyadarkan bahwa manusia memiliki kelebihan dibandingkan hewan, sebagaimana diwajibkan atas orang-orang sebelum kamu dari umat para nabi terdahulu agar kamu bertakwa dengan melaksanakan perintah dan menjauhi larangan Allah."
  }
]