[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasul Nya dan mengerjakan amal sholeh sesuai dengan ajaran syariat Nya, Allah telah mewajibkan berpuasa atas kalian sebagaimana telah mewajibkan atas umat sebelum kalian supaya kalian bertakwa kepada Tuhan kalian, maka kalian menjadikan antara diri kalian dengan perbuatan-perbuatan maksiat dinding pelindung dengan taat kepada Nya dan beribadah kepada Nya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "183. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, diwajibkan kepada kalian berpuasa sebagaimana diwajibkan kepada umat-umat sebelum kalian, agar kalian bertakwa kepada Allah, yaitu dengan cara membuat tabir penghalang antara diri kalian dan azab Allah melalui amal saleh. Salah satu amal saleh yang paling utama ialah puasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "183. Hai orang-orang yang beriman, diharuskan bagi kalian untuk berpuasa sebagaimana Allah telah mengharuskannya bagi umat-umat sebelumnya agar kalian menjadi orang-orang yang bertakwa kepada Allah dan menjauhi larangan-larangan-Nya. Ibnu Asyur menyebutkan tiga tujuan dari penyebutan bahwa puasa juga diwajibkan bagi umat-umat terdahulu: Agar umat Islam memperhatikan ibadah ini, sebab ibadah ini telah disyariatkan Allah sebelum umat Islam, kemudian Allah mensyariatkannya pula bagi umat Islam, hal ini menunjukkan kebaikan yang dikandungnya dan besar pahalanya. Agar umat Islam tidak merasa berat dalam menjalankannya, sebab mereka telah mendapat teladan dari umat terdahulu. Agar menguatkan tekat dalam menjalankan kewajiban ini dan tidak lalai. Adapun firman Allah {لعلكم تتقون} untuk menjelaskan hikmah dari ibadah puasa dan tujuan disyariatkannya. (at-Tahrir wa at-Tanwir 2/154-156)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "183. كُتِبَ عَلَيْكُمُ الصِّيَامُ (diwajibkan atas kamu berpuasa) Yakni Allah mewajibkan atas kalian untuk berpuasa; yaitu menahan segala yang membatalkan puasa disertai dengan niat untuk menjalankannya, dimulai dari terbitnya fajar sampai terbenamnya matahari. كَمَا كُتِبَ (sebagaimana diwajibkan) Yakni sebagaimana Allah mewajibkannya. عَلَى الَّذِينَ مِن قَبْلِكُمْ (atas orang-orang sebelum kamu) Yakni mereka adalah umat Nabi Musa dan Isa. لَعَلَّكُمْ تَتَّقُونَ (kamu agar kamu bertakwa) Yakni dengan menjaga puasa tersebut; karena puasa melemahkan keinginan hawa nafsu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara kebaikan Allah kepada hamba-hamba Nya bahwasanya Dia tidak menghadapkan mereka dengan penderitaan yang sangat besar, dan dari makna ini sebagian ulama mengatakan : sesungguhnya Allah mengatakan pada perkara-perkara yang dibenci : { كُتِبَ عَلَيْكُمُ الصِّيَامُ } , walaupun telah diketahui bahwa Dialah yang mewajibkan syari'at itu, tetapi ketika Dia datang kepada perkara yang menghantarkan kepada ketenagan Ia berkata : { كَتَبَ عَلَىٰ نَفْسِهِ الرَّحْمَةَ } \"Dia telah menetapkan atas Diri-Nya kasih sayang\" [ al-An'am : 12 ]. 2 ). Jika anda memperhatikan firman Allah : { كُتِبَ عَلَيْكُمُ الصِّيَامُ } dan bagaiman sikap kaum muslimin menerima kewajiban syari'at ini dengan segala keridhoan yang mereka miliki, lalu anda membandingkan dengan sikap bani Isra'il yang tidak tanggap dengan perintah menyembelih seekor sapi saja! anda akan mengetahui betapa mulianya ummat ini dantara seluruh ummat. 3 ). - Bahwasanya puasa Ahli kitab pada awalnya ditetapkan dengan landasan ru'yah dan bukan dengan hisab, sebagaimana yang difahami dengan lafazh : { كَمَا } akan tetapi mereka kemudian merubah dan mengganti setelah ditetapkannya syari'at itu. - Kecintaan Allah terhadap syari'at ini, oleh karena itu Dia mensyari'atkan kepada seluruh ummat. 4 ). Sesungguhnya puasa itu menjaga stamina tubuh dan kesehatan hati, dan mengembalikan kepadamya apa yang telah dirampas oleh tangan-tangan syahwat, dan puasa merupakan sebaik-baik penolong menuju kepada ketaqwaan. 5 ). { لَعَلَّكُمْ } Lafazh لعل dalam ayat ini adalah untuk menjelaskan sebab, yakni puasa menjadi sebab kalian bertaqwa, dan dari sini qo'idah mufidah : bahwa lafazh ( لعل ) ketika datang setelah perintah maka dia menjelaskan sebab, sebagaimana firman Allah setelah ayat ini : { وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ } \"Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka (jawablah), bahwasanya Aku adalah dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia memohon kepada-Ku, maka hendaklah mereka itu memenuhi (segala perintah-Ku) dan hendaklah mereka beriman kepada-Ku, agar mereka selalu berada dalam kebenaran\" . 6 ). Romadhon merupakan madrasah taqwa, perhatikanlah bagaimana kata taqwa disebutkan diawal ayat dan di akhir ayat diantara ayat-ayat puasa; hal itu karena puasa menjadi salah satu hal yang paling agung untuk mewujudkan ketaqwaan dalam diri seorang hamba, maka hendaklah kita melihat bagaimana pengaruh puasa terhadap ketaqwaan kita kepada Allah baik dalam hal pendengaran dan penglihatan maupun ucapan; agar kita bisa mencapai sebuah tujuan yang mulia : { لَعَلَّكُمْ تَتَّقُونَ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "183. Wahai orang-orang yang beriman, Allah telah mewajibkan bagi kalian untuk berpuasa dengan menahan syahwat perut dan farji dari terbit fajar sampai terbenamnya matahari dengan ikhlas, sebagaimana Dia mewajibkannya atas umat-umat terdahulu, supaya kalian terhindar dari neraka dan mendapatkan ridha Tuhan, serta bisa menyucikan diri dari akhlak yang buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, diwajibkan atas kalian berpuasa sebagaimana diwajibkan atas orang-orang sebelum kalian agar kalian bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "183. Allah mengabarkan tentang segala yang Dia karuniakan kepada hamba-hambaNya dengan cara wajibkan atas mereka berpuasa sebagaimana Allah telah mewajibkan puasa itu atas umat-umat terdahulu, karena puasa itu termasuk di antara syariat dan perintah yang mengandung kemaslahatan bagi makhluk di setiap zaman. Puasa juga menambah semangat bagi umat ini yaitu dengan melompat lomba dengan umat lain dalam menyempurnakan amal perbuatan dan bersegera menuju kepada kebiasaan-kebiasaan yang baik, dan puasa itu juga bukanlah suatu perkara sulit yang khusus bagi kalian. Kemudian Allah menyebutkan hikmah disyariatkannya puasa seraya berfirman, “Agar kamu bertakwa,” karena sesungguhnya puasa itu merupakan salah satu faktor penyebab ketakwaan, karena berpuasa dalam merealisasikan perintah Allah dan menjauhi laranganNya. Dan diantara bentuk yang meliputi ketaqwaan dalam puasa itu adalah bahwa orang yang berpuasa akan meninggalkan apa yang diharamkan oleh Allah seperti makan, minum, melakukan Jima, dan semacamnya yang sangat diinginkan oleh nafsunya dengan maksud mendekatkan diri kepada Allah seraya mengharapkan pahala dalam meninggalkan hal tersebut. Ini merupakan bagian ketakwaan. Dan diantaranya juga adalah bahwasanya orang yang berpuasa itu melatih dirinya untuk selalu merasa diawasi oleh Allah, maka dia meninggalkan apa yang diinginkan oleh nafsunya padahal dia mampu melakukannya karena dia tahu bahwa Allah melihatnya. Yang lain bahwasanya puasa itu mempersempit jalan masuk setan, karena setan itu berjalan dalam tubuh manusia seperti jalannya darah, maka puasa akan melemahkan pengaruhnya dan meminimumkan kemaksiatan. Diantaranya juga bahwa seorang yang berpuasa biasanya akan bertambah ketaatannya, dan ketaatan itu adalah gambaran dari ketakwaan. Yang lainnya lagi adalah bahwa orang yang kaya bila merasakan susahnya kelaparan, pasti ia menghibur kaum miskin, dan ini pun termasuk gambaran ketakwaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { كُتِبَ } Kutiba : Diwajibkan dan ditetapkan { ٱلصِّيَامُ } Ash-Shiyam : Puasa secara bahasa diartikan menahan, sedangkan yang dimaksud di sini adalah menahan diri dari makanan, minuman, dan menggauli istri sejak terbit matahari sampai tenggelam. Makna ayat : Ketika Rasulullah ﷺ berhijrah ke Madinah dan menjadi negeri Islam, maka syariat mulai turun dan berkelanjutan. Pada ayat-ayat sebelumnya telah disebutkan hukum mengenai qishash, wasiat, dan muraqabatullah dalam melaksanakan hukum-hukum tersebut. Lantas di antara hal yang dapat mewujudkan ketakwaan seorang muslim adalah dengan berpuasa. Maka Allah Ta’ala menurunkan kewajiban puasa pada tahun kedua hijriah, seraya menyeru umat muslim dengan label keimanan, “Wahai orang-orang yang beriman” dan memberitahukan mereka bahwa Dia mewajibkan puasa kepada mereka, sebagaimana telah diwajibkan kepada umat-umat sebelumnya (كُتِبَ عَلَيۡكُمُ ٱلصِّيَامُ كَمَا كُتِبَ عَلَى ٱلَّذِينَ مِن قَبۡلِكُمۡ ) “diwajibkan atas kalian berpuasa sebagaimana diwajibkan kepada umat-umat sebelum kalian”. Lantas Allah Ta’ala menyebutkan alasan turunnya kewajiban itu dengan firman Nya “Agar kalian bertakwa” yaitu menyiapkan kalian agar bertakwa dengan melaksanakan perintah-perintah Nya dan menjauhi segala larangan Nya, karena dalam ibadah puasa terdapat pengawasan dari Allah Ta’ala. Pelajaran dari ayat : • Kewajiban untuk berpuasa di bulan Ramadhan • Puasa mendidik mukmin untuk semakin bertakwa • Puasa dapat menghapuskan dosa berdasarkan hadits,”Barangsiapa yang berpuasa Ramadhan didasari keimanan dan mengharap pahala dari Allah, akan diampuni dosa-dosanya yang telah lalu.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 183: Ini adalah seruan dari Allah kepada hambanya yang beriman yang bahwasannya puasa ramadhan adalah wajib dengan melihat hilal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terkandung beberapa hal: - Puasa termasuk syari'at yang tidak dimansukh karena maslahatnya yang begitu besar bagi manusia. - Mendorong umat ini agar semangat melakukannya, yakni hendaknya mereka berlomba-lomba dengan generasi sebelum mereka dalam menyempurnakan amalan dan bersegera kepada hal yang baik. - Puasa bukanlah hal yang berat yang hanya dibebankan kepada kita. Ayat di atas menerangkan bahwa puasa merupakan sebab terbesar untuk memperoleh ketakwaan. Puasa merupakan tameng bagi seseorang dari perbuatan maksiat, karena ia dapat melemahkan syahwat yang menjadi sumber maksiat. Di dalam puasa terkandung nilai-nilai ketakwaan, di antaranya: - Di dalam puasa seseorang meninggalkan hal-hal yang disukainya seperti makan, minum dan berjima'. Jika seseorang mampu meninggalkan hal-hal yang disukainya, nantinya ketika dihadapkan perbuatan maksiat yang disukai hawa nafsunya, maka ia mampu menahan dirinya sebagaimana ia mampu menahan dirinya dari makan, minum dan berjima'. Dengan begitu ia dapat bertakwa kepada Allah Subhaanahu wa Ta'aala dengan menjalankan perintah-Nya dan menjauhi larangan-Nya. - Orang yang berpuasa melatih dirinya agar merasa diawasi Allah Subhaanahu wa Ta'aala. Ketika puasa, ia meninggalkan apa yang diinginkan oleh hawa nafsunya padahal ia mampu karena mengetahui bahwa dirinya diawasi Allah Subhaanahu wa Ta'aala. - Puasa mempersempit ruang gerak setan, di mana ia berjalan melewati tempat peredaran darah. - Orang yang berpuasa biasanya banyak menjalankan keta'atan dan maksiatnya berkurang. Hal ini termasuk nilai-nilai ketakwaan. - Orang yang kaya ketika merasakan pedihnya rasa lapar, membuat dirinya merasakan derita orang-orang fakir dan miskin. Hal ini akan membuatnya ingin bersedekah karena telah merasakan derita orang-orang fakir dan miskin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 183",
    "description": "Wahai orang-orang yang beriman! diwajibkan atas kamu berpuasa guna mendidik jiwa, mengendalikan syahwat, dan menyadarkan bahwa manusia memiliki kelebihan dibandingkan hewan, sebagaimana diwajibkan atas orang-orang sebelum kamu dari umat para nabi terdahulu agar kamu bertakwa dengan melaksanakan perintah dan menjauhi larangan Allah. Kewajiban berpuasa itu beberapa hari tertentu pada bulan ramadan. Maka barang siapa di antara kamu sakit sehingga tidak sanggup berpuasa, atau dalam perjalanan lalu tidak berpuasa, maka ia wajib mengganti puasa sebanyak hari yang ia tidak berpuasa itu pada hari-hari yang lain. Dan bagi orang yang berat menjalankannya karena sakit berat yang tidak ada harapan sembuh atau karena sangat tua, wajib membayar fidyah atau pengganti yaitu memberi makan kepada seorang miskin untuk satu hari yang tidak berpuasa itu. Tetapi barang siapa dengan kerelaan hati mengerjakan kebajikan lalu memberi makan kepada lebih dari seorang miskin untuk satu hari tidak berpuasa, maka itu lebih baik baginya. Dan kamu sekalian tetap berpuasa, maka pilihan untuk tetap berpuasa itu lebih baik bagi kamu dibandingkan dengan memberikan fidyah, jika kamu mengetahui keutamaan berpuasa menurut Allah."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Melalui ayat ini Allah Subhanahu wa Ta'ala menyeru orang-orang yang beriman dari kalangan umat ini dan memerintahkan kepada mereka melaksanakan ibadah puasa, yaitu menahan diri dari makan minum serta berhubungan intim dengan niat yang ikhlas karena Allah Subhanahu wa Ta'ala. Karena di dalam ibadah puasa terkandung hikmah-hikmah yang besar terhadap pribadi seorang hamba, diantaranya puasa dapat membersihkan Jiwa dan menyucikannya dari segala kotoran hati dan membebaskannya dari akhlak yang tercela. Seruan Allah Subhanahu wa Ta'ala untuk melaksanakan ibada puasa hanya diperuntukan bagi orang-orang yang beriman, itu karena hanya orang-orang yang mempuanyai keimana saja yang akan mampu melaksanakannya. Ibadah puasa yang tidak didasari keimanan tentu tidak akan bernilai apapun, sebab iman lah yang menjadi pokok utama dalam setiap pelaksanaan ibadah kepada Allah. Melalui ayat ini juga Allah memberi tahukan kepada umat ini bahwa kewajiban melaksanakan ibadah puasa juga telah diwajibkan kepada umat sebelumnya. Hal ini bertujuan untuk memberi rasa ringan kepada ummat ini dalam melaksankan kewajiban puasa tersebut, karena ummat sebelum ummat ini pun mereka mampu melaksanakan kewajiban puasa ini. Mereka menjadi uswah dalam pelaksanaan ibadah puasa ini. Hal ini juga memberi semangat kepada umat ini agar mereka dalam melaksanakan kewajiban puasa ini memaksimalkan diri dalam melaksanakan kewajiban ini sebagaimana umat sebelumnya. Kewajiban ibada puasa yang diberikan kepada umat sebelum islam adalah sama dilaksanakan pada bulan romadlon, hal ini sebagaimana perkataan Imam Mujahid yang mengatakan bahwa Allah Subhanahu wa Ta'ala telah mewajibkan puasa romadan kepada suluruh ummat. Begitu jugadalam hadits yang diriwayatkan dari Abdulloh bin Umar telah berkata, telah bersabda Rosululloh Shallallahu 'alaihi wa Sallam: \" صيام رمضان كتبه الله على الأمم قبلكم . .” “Puasa romadon telah Allah wajibkan kepada umat-umat sebelum kalian” Begitu juga imam Al-Qurtubi dalam tafsirnya al Jaami’ li ahkamil Quran: فإن الله تعالى كتب على قوم موسى وعيسى صوم رمضان فغيروا ، وزاد أحبارهم عليهم عشرة أيام ثم مرض بعض أحبارهم فنذر إن شفاه الله أن يزيد في صومهم عشرة أيام ففعل ، فصار صوم النصارى خمسين يوما ، فصعب عليهم في الحر فنقلوه إلى الربيع Allah Subhanahu wa Ta'ala telah mewajibkan kepad umat Nabi Musa AS dan umat Nabi Isa AS untuk berpuasa pada bulan romadan, lalu kemudian mereka merubahnya. Pendeta mereka menambah sepuluh hari puasanya sehingga sebagian dari mereka ada yang sakit, maka kemudian dia bernazar seandainya Allah menyembuhkan penyakitnya, maka mereka akan menambah puasa mereka sepuluh hari lagi, maka mereka mengerjakannya. Sehingga orang-orang nasroni melaksanakan puasanya selama lima puluh hari, maka mereka merasakan kesulitan melaksanakannya terlebih disaat musim panas, maka kemudian memindahkan puasanya ke musim dingin. Dan pendapat inilah yang dipilih juga oleh ulama ahli tafsir yang lain seperti Imam an-nuhas, dia berkata “pendapat inilah yang paling mirip dengan firman Allah Subhanahu wa Ta'ala: كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ “sebagaimana telah diwajibkan kepada orang-orang sebelum kalian” Dalam riwayat lain yang dinukil dari Muadz, Ibnu Abbas, Atho, Adh Dhohak, dan Qotadah mengatakan bahwa dahulu diawal islam puasa yang biasa dilaksanakan adalah tiga hari disetiap bulannya sebagaimana dilaksanakan oleh umat sebelum islam. Puasa ini sudah berlangsung sejak zaman nabi Nuh AS sampai ahirnya Allah menasakh kewajiban tersebut dengan puasa romadon. Hikmah dari disyariatkannya ibadah puasa adalah sebagaimana firman Allah Subhanahu wa Ta'ala: لَعَلَّكُمْ تَتَّقُونَ “Agar kalian bertakwa” Hal ini dijelaskan oleh Imam Assa’di dalam tafsirnya bahwa ibadah puasa adalah sebab terbesar munculnya ketaqwaan dalam diri seorang hamba karena didalamnya ada pelaksanakaan perintah Allah Subhanahu wa Ta'ala dan menjauhi larangan-Nya. Diantara hal-hal yang mengandung makna ketaqwaan adalah : bahwasanya orang yang berpuasa tentunya dia akan meninggalkan sesuatu yang diharamkan baginya dari makan, minum dan berhubungan intim yang semua hal tersebut tentunya sangat sesuai denga keinginan nafsu tetapi dia tinggalkan semata-mata untuk beribadah kepada Allah dan dia meyakini bahwa hal tersebut dapat membatalkan puasanya. orang yang berpuasa juga akan melatih dirinya dalam masalah muroqobah (merasa diri diawasi oleh Allah) sehingga dia meninggalkan segala hal yang diinginkan nafsunya padahal dia mampu untuk melakukannya karena dia tahu bahwa Allah selalu mengawasinya. ibadah puasa juga menyempitkan keleluasaan pergerakan setan didalam tubuh, sebagaimana kita ketahui dari hadits shohih bahwa sedar bergerak dalam tubuh mansia pada peredaran darah. Maka dengan melaksanakan ibadah puasa peredaran darah menjadi sedikit lemah sehingga melemahkan pergerakan setan yang dengannya dapat meminimalisir perbutan maksiat. orang yang berpuasa pada umumnya akan memperbanyak berbuat ketaatan, dan ketaatan adalah sifat orang yang bertaqwa. orang kaya jika melaksanakan ibadah puasa maka dia akan merasakan perihnya lapar. Dengan demikian dia akan semakin peduli kepada orang faqir yang terbiasa merasakan perihnya lapar. Dan ini juga termasuk karakter orang yang bertaqwa. Ibadah puasa juga bisa menjadi tameng bagi seseorang dari perbuatan keji dan munkar, hal ini sebagaimana disebutkan oleh rosululloh Shallallahu 'alaihi wa Sallam dalam hadits qudsi : اﻟﺼﻴﺎﻡ ﺟﻨﺔ، ﻳﺘﺮﻙ ﺃﻱ ﺃﺣﺪﻛﻢ ﻃﻌﺎﻣﻪ ﻭﺷﺮﺍﺑﻪ ﻭﺷﻬﻮﺍﺗﻪ ﻣﻦ ﺃﺟﻠﻲ. رواه البخاري “Puasa adalah tameng, kalian meninggalkan makan dan minum serta syahwatnya karena-Ku” (HR Bukhari) Dalam hadits lain juga disebutkan : ” ﻣﻦ ﺍﺳﺘﻄﺎﻉ ﺍﻟﺒﺎﺀﺓ ﻓﻠﻴﺘﺰﻭﺝ، ﻭﻣﻦ ﻟﻢ ﻳﺴﺘﻄﻊ ﻓﻌﻠﻴﻪ ﺑﺎﻟﺼﻮﻡ ﻓﺈﻧﻪ ﻟﻪ ﻭﺟﺎﺀ “. رواه البخاري “Barang siapa yang mempunyai kemampuan (biaya) maka menikahlah, maka barang siapa yang tidak mampu hendaklah dia berpuasa karena puasa itu adalah tameng yang bisa mencegah diri dari hawa nafsu” (HR Bukhari). Ketika diketahui bahwa tujuan dari kewajiban ibadah puasa itu adalah agar menjadi pribadi yang bertaqwa, maka hendaklah seorang muslim dalam melaksanakan ibadah puasanya menjaga diri dari perbuatan-perbuatan yang bisa mengurangi bahakn menghilangkan nilai-nilai ketaqwan dari dirinya karena selain akan menjauhkan dirinya dari tujuna ibadah puasanya, perbuatan tersebutpun akan membuat ibadah puasanya sia-sia dan tidak mendapat pahala. Hal ini sebagaiman hadits Nabi Muhammad Shallallahu 'alaihi wa Sallam: ﻣﻦ ﻟﻢ ﻳﺪﻉ ﻗﻮﻝ ﺍﻟﺰﻭﺭ ﻭﺍﻟﻌﻤﻞ ﺑﻪ ﻓﻠﻴﺲ ﻟﻠﻪ ﺣﺎﺟﺔ ﻓﻲ ﺃﻥ ﻳﺪﻉ ﻃﻌﺎﻣﻪ ﻭﺷﺮﺍﺑﻪ”. رواه البخاري “Barangsiapa yang tidak bisa meninggalkan perkataan dan perbuatan buruk (saat berpuasa), maka tiada gunanya di hadapan Allah ketiaka dia meninggalkan makanan dan minumannya.” (HR Bukhori)"
  }
]