[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mewajibkan kepada kalian berpuasa pada hari-hari yang ditentukan bilangannya yaitu hari-hari di bulan Rhamadhan. Maka barangsiapa siantara kalian ada yang sakit dan berpuasa terasa berat baginya, atau sedang bepergian jauh maka dia boleh tidak berpuasa, dan dia harus mengganti berpuasa pada hari-hari yang lain sebanyak hari yang dia tidak berpuasa padanya, dan bagi orang yang mengalami kesulitan untuk berpuasa dan puasa memberatkan mereka dengan beban yang tak dapat dijalankan seperti yang dialami oleh orang yang lanjut usia, orang sakit yang sulit diharapkan kesembuhannya, maka mereka membayar fidyah setiap hari ia berbuka, yaitu memberikan makanan bagi orang-orang yang membutuhkan yang tidak memiliki sesuatu yang bisa mencukupi dan menutup kebutuhannya. Barangsiapa yang melebihkan jumlahnya dengan sukarela maka itu lebih baik bagi dirinya, dan puasa kalian (walaupun dengan penuh kesulitan) maka itu lebih baik bagi kalian daripada memberikan fidyah, jika kalian mengetahui keutamaan besar untuk puasa di sisi Allah Subhanahu Wa Ta'ala."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "184. Puasa yang diwajibkan kepada kalian itu ialah berpuasa pada beberapa hari saja dalam setahun. Siapa di antara kalian menderita sakit yang berat untuk berpuasa, atau sedang bepergian jauh, maka dia boleh berbuka. Kemudian dia harus mengganti sebanyak hari-hari yang dia berbuka. Bagi orang-orang yang mampu berpuasa tetapi memilih berbuka, mereka harus membayar fidyah, yaitu memberi makan satu orang miskin untuk setiap hari dia berbuka. Akan tetapi berpuasa lebih baik bagimu daripada berbuka dan membayar fidyah, jika kalian mengetahui keutamaan yang terkandung di dalam puasa. Ketentuan hukum ini berlaku pada awal penetapan syariat puasa. Maka siapa yang ingin berpuasa boleh berpuasa, dan siapa yang ingin berbuka boleh berbuka dan membayar fidyah. Setelah itu Allah mewajibkan puasa kepada semua orang (Islam) yang sudah balig dan mampu berpuasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "184. Allah mewajibkan kepada kalian berpuasa dalam bilangan hari tertentu sesuai hari-hari yang ada dalam bulan Ramadhan. Dan jika seorang mukallaf yang sedang sakit atau bepergian minimal sejauh 89 KM sehingga berat baginya untuk berpuasa, maka boleh baginya tidak berpuasa; namun wajib baginya mengganti puasa itu di hari yang lain. Dan bagi orang yang mampu untuk berpuasa, dia boleh memilih antara berpuasa atau memberi makan orang miskin sebanyak satu Sha’ gandum atau kurma sebagai ganti setiap satu hari puasa yang dia tinggalkan, dan jika dia ingin memberi makan lebih dari satu orang atau memberi makan dengan kadar yang lebih banyak, maka hal itu lebih utama dan lebih berpahala. Namun berpuasa lebih baik baginya daripada tidak berpuasa dengan membayar fidyah jika kalian mengetahui keutamaan berpuasa. Akan tetapi hukum ini -memilih berpuasa atau membayar fidyah- telah dihapus dengan ayat selanjutnya, dan keringanan untuk tidak berpuasa hanya berlaku bagi orang yang sakit atau bepergian jauh. Salamah bin al-Akwa’ berkata: “ketika turun firman Allah {وعلى الذين يطيقونه فدية طعام مسكين} orang-orang jika ingin berpuasa atau membayar fidyah maka mereka bebas memilihnya, hingga turun ayat setelahnya untuk menghapus hukum ini.” (Shahih Bukhari, Tafsir, Bab 26, No. 4507)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "184. أَيَّامًا (dalam beberapa hari) Yakni diwajibkan atas kalian untuk berpuasa dalam hitungan beberapa hari. مَّعْدُودٰتٍ ۚ (yang tertentu) Yakni dengan jumlah hari tertentu yang telah diketahui. Dan ayat ini memberi isyarat bahwa jumlah hari tersebut sedikit, yakni di bulan Ramadhan. فَمَن كَانَ مِنكُم مَّرِيضًا (Maka barangsiapa diantara kamu ada yang sakit) Yakni apabila tidak mampu berpuasa maka diharuskan ia berbuka; dan apabila ia mampu berpuasa namun bisa jadi akan mendapat kesulitan atau bahaya dengan puasanya tersebut maka dia diperbolehkan untuk berbuka sebagai rukhshoh (keringanan) baginya. عَلَىٰ سَفَرٍ (atau dalam perjalanan) Yakni safar dengan jarak yang diperbolehkan seseorang untuk mengqasar shalat atau lebih. فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ (maka sebanyak hari yang ditinggalkan itu pada hari-hari yang lain) Yakni maka wajib baginya untuk berpuasa di hari yang lain sesuai dengan jumlah hari yang ia tinggalkan. وَعَلَى الَّذِينَ يُطِيقُونَهُۥ (Dan wajib bagi orang-orang yang berat menjalankannya) Yakni bagi yang mampu berpuasa namun dengan penuh kesusahan karena melampaui kesanggupannya seperti orang yang lanjut usia atau yang mengidap penyakit yang menahun. فِدْيَةٌ طَعَامُ مِسْكِينٍ ۖ (membayar fidyah, (yaitu): memberi makan seorang miskin) Yakni (wajib membayar fidyah) dengan takaran setengah Sho’ gandum, kurma, atau yang lainnya sebagai ganti setiap hari yang ditinggalkan, atau juga dengan makanan siap saji yang cukup untuk makanan sehari bagi orang miskin. فَمَن تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَّهُۥ (Barangsiapa yang dengan kerelaan hati mengerjakan kebajikan, maka itulah yang lebih baik baginya) Yakni yang melebihkan makanan dari takaran yang diwajibkan. Pendapat lain disebutkan: yakni memberi makan orang miskin ditambah dengan orang miskin lain. وَأَن تَصُومُوا۟ خَيْرٌ لَّكُمْ ۖ (Dan berpuasa lebih baik bagimu) Yakni berpuasa lebih baik bagi kalian daripada berbuka dengan membayar fidyah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { أَيَّامًا مَعْدُودَاتٍ } Diantara pelajaran yang dapat diambil dari penetapan romadhon dengan sifatnya أيام (yang merupakan jamak qillah ) dan معدودات (yang juga merupakan jamak qillah) adalah untuk mejelaskan keringanan perintah Allah atas hamba-hamab Nya. 2 ). Allah menyebut romadhan dengan firman-Nya : { أَيَّامًا مَعْدُودَاتٍ }, sebagai kinayah akan waktunya yang sebentar, maka sebuah kesalahan yang besar bagi siapa yang berkesempatan bertemu dengan romadhan tetapi ia menyia-nyiakannya tanpa memanfaatkannya untuk mengapai kebaikan sebanyak mungkin, dan dia akan merasakan kebodohannya ketika ia berkata : { يَا حَسْرَتَا عَلَىٰ مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ } \"Amat besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah\" [ az-Zumar : 56 ], dan { ذَٰلِكَ يَوْمُ التَّغَابُنِ } \"itulah hari dinampakkan kesalahan-kesalahan\" [ at-Taghabun : 9 ]. 3 ). Perhatikanlah berapa banyak tertulis dalam ayat puasa kata-kata yang menjadikan seorang muslim taat akan kewajiban ini, diawali dengan panggilan kesayangan { يَا أَيُّهَا الَّذِينَ آمَنُوا } kemudian dijelaskan bahwasanya dia adalah kewajiban tiada keleluasaan untuk meninggalkannya { كُتِبَ عَلَيْكُمُ الصِّيَامُ }, dan bahwasanya puasa bukanlah syari'at yang dikhusukan bagi ummat muhammad tetapi juga bagi ummat-ummat seluruhnya { كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ }, kemudian Allah menyebutkan buah hasil dari puasa { لَعَلَّكُمْ تَتَّقُونَ }, dan juga Allah membilangkan waktunya yang singkat dengan { أَيَّامًا مَعْدُودَاتٍ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "184. Diwajibkan atas kalian untuk berpuasa pada hari-hari tertentu dengan jumlah yang sudah ditentukan, yaitu pada bulan ramadhan. Maka barangsiapa orang-orang yang menerima kewajiban itu sakit, sehingga tidak bisa berpuasa atau akan mengalami kesulitan dan penderitaan, atau dalam keadaan berpergian dengan jarak minimal 89 km atau lebih, maka dia diperbolehkan untuk berbuka (membatalkan puasanya), namun dia harus mengganti puasa pada hari-hari yang seharusnya dia tidak puasa setelah sehat atau berpergian. Dan wajib bagi orang-orang yang keberatan untuk berpuasa sehingga mereka tidak bisa berpuasa seperti orang yang sudah sangat tua, ibu hamil dan menyusui itu membayar fidiyah. Dan jumlahnya adalah memberi makan satu orang miskin untuk satu hari. Takaran pemberian makanannya adalah setengah sha’ gandum, satu sha’ kurma atau bahan lainnya. Dan barangsiapa memberi makan lebih dari satu orang miskin, atau melebihi takaran fidiyah, maka pahalanya lebih utama dan lebih banyak. Puasa itu lebih baik bagi mereka daripada tidak puasa dengan memberi fidiyah, jika kalian mengetahui takaran pahala puasa di sisi Allah SWT. Ibnu Sa’d dalam beberapa catatannya meriwayatkan dari Mujahid yang berkata: “Ayat ini diturunkan tentang majikan Qays bin As-Saib {Wa ‘alalladzin Yuthiquunahu} lalu dia membatalkan puasa dan memberi makan satu orang miskin setiap harinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Beberapa hari yang telah ditentukan} beberapa hari saja, yaitu bulan Ramadhan {Maka siapa saja di antara kalian sakit atau dalam perjalanan (lalu tidak berpuasa), maka (wajib mengganti) sebanyak hari (yang ditinggalkannya) pada hari-hari yang lain} maka dia wajib berpuasa sejumlah hari dia tidak berpuasa di hari-hari lain selain hari ketika dia sakit dan dalam perjalanan{Bagi orang yang berat menjalankannya} terbebani oleh puasa dan membuatnya celaka {maka wajib membayar fidyah, (yaitu) memberi makan seorang miskin. Siapa dengan kerelaan hati mengerjakan kebajikan} menambah jumlah fidyahnya karena ingin memberi sumbangan {itu lebih baik baginya dan berpuasa itu lebih baik bagi kalian jika kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "184. Ketika Allah menyebutkan kewajiban puasa bagi mereka, Dia mengabarkan bahwa puasa itu hanya pada hari-hari yang tertentu atau sedikit sekali dan sangat mudah, kemudian Allah memudahkan puasa itu dengan kemudahan lainnya. Dia berfirman, “Maka barangsiapa diantara kamu ada yang sakit atau dalam perjalanan (lalu ia berbuka), maka (wajiblah baginya berpuasa) sebanyak hari yang ditinggalkan itu pada hari-hari yang lain.” Pada umumnya hal itu karena adanya kesulitan, sehingga Allah memberikan kemudahan bagi keduanya untuk berbuka, dan ketika menjadi suatu keharusan untuk mewujudkan kemaslahatan puasa bagi setiap orang yang beriman, maka Allah memerintahkan kepada mereka berdua agar mengganti puasanya itu pada hari-hari yang lain apabila penyakitnya telah sembuh dan berakhirnya perjalanan dan adanya istirahat. Dalam firmanNya, “Maka (wajiblah baginya berpuasa) sebanyak hari yang ditinggalkan itu pada hari-hari yang lain,” terkandung dalil yang menunjukkan bahwa ia harus mengganti sejumlah hari bulan Ramadan secara sempurna ataupun tidak, dan bahwa ia juga boleh mengganti hari-hari yang panjang lagi panas dengan beberapa hari yang pendek lagi sejuk seperti kebalikannya. Dan FirmanNya “Dan wajib bagi orang-orang yang berat menjalankannya (jika mereka tidak berpuasa),” maksudnya, mereka tidak mampu berpuasa, “membayar Fidyah” dari setiap hari yang mereka batalkan, “memberi makan seorang miskin.” Hal ini pada awal-awal kewajiban berpuasa ketika mereka belum terbiasa berpuasa dan saat itu kewajiban tersebut adalah suatu yang harus dilakukan oleh mereka yang akhirnya sangat berat bagi mereka untuk melakukannya. Lalu Allah Rabb Yang Maha bijaksana memberikan jalan yang paling mudah bagi mereka, Dia memberikan pilihan bagi orang yang tidak mampu berpuasa antara melakukan puasa atau itulah yang paling baik dan utama atau memberi makan. Oleh karena itu Allah berfirman, “Dan berpuasa lebih baik bagimu,” kemudian setelah itu Allah menjadikan puasa itu harus dilakukan oleh orang yang mampu sedangkan orang yang tidak mampu, boleh berbuka lalu menggantinya pada hari yang lain. Ada juga yang berpendapat bahwa orang-orang yang tidak mampu yaitu terbebani dan merasa sangat berat sekali untuk melaksanakannya seperti orang tua yang renta dalam membayar Fidyah untuk tiap hari kepada seseorang miskin, dan inilah yang benar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَيَّامٗا مَّعۡدُودَٰتٖۚ } Ayyaamamma’duudaat : Dua puluh sembilan atau tiga puluh hari sesuai hitungan bulan Ramadhan. { فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۚ } Fa’iddatun min ayyaamin ukhor : Bagi siapa yang tidak berpuasa karena udzur seperti sakit atau safar, maka baginya untuk mengganti puasa di hari lain sebanyak hari yang tidak berpuasa. { يُطِيقُونَهُۥ } Yuthiquunahu : Yaitu memaksakan diri untuk berpuasa dengan susah payah karena usia yang sudah menua atau karena sakit yang tidak bisa diharapkan kesembuhannya. { فِدۡيَةٞ طَعَامُ مِسۡكِينٖۖ } Fidyatun Tho’amu miskiin : Diwajibkan bagi orang yang tidak berpuasa karena udzur untuk memberi makan setiap hari yang ditinggalkan satu orang miskin, dan tidak ada keharusan mengganti puasa. { فَمَن تَطَوَّعَ خَيۡرٗا } Faman tathawwa’a khairan : Maknanya yaitu siapa yang melebihkan pemberian fidyah dengan dua mud, atau memberi makan lebih dari satu orang miskin dalam sehari, maka itu lebih baik baginya. Makna ayat: Firman Nya (أَيَّامٗا مَّعۡدُودَٰتٖۚ ) “yaitu dalam beberapa hari yang tertentu” disebutkan untuk meringankan kesulitan yang akan dialami oleh orang yang berpuasa, dimana Allah tidak menjadikan pausa itu selama berbulan-bulan atau bertahun-tahun. Kemudian Allah menyebutkan keringanan lagi dengan memberikan udzur bagi orang yang sakit dan bepergian (safar) untuk tidak berpuasa, dan menggantinya ketika sehat atau kembali dari perjalanannya. Allah ta’ala berfirman kepada mereka “Maka jika di antara kamu ada yang sakit atau dalam perjalanan (lalu ia berbuka), maka (wajiblah baginya berpuasa) sebanyak hari yang ditinggalkan itu pada hari-hari yang lain.” Bagi orang yang tidak sedang sakit atau tidak bepergian apabila mereka berpuasa dengan beban yang berat dan kesulitan, maka boleh baginya untuk tidak berpuasa dan memberi makan satu orang miskin setiap harinya, dan Allah memberi tahu bahwa tetap berpuasa merupakan suatu kebaikan. Makna ayat: Kemudian hukum yang terakhir ini dinasakh (dianulir) dengan firman Allah pada ayat berikutnya,”Karena itu, barangsiapa di antara kamu hadir (di negeri tempat tinggalnya) di bulan itu, maka hendaklah ia berpuasa pada bulan itu.” (ayat 185) dan firman Nya,”jika kamu mengetahui” maksudnya, jika kamu mengetahui faidah ibadah puasa secara duniawi ataupun ukhrawi yang banyak sekali, paling utama adalah diampuninya dosa-dosa dan hilangnya penyakit. Pelajaran dari ayat: • Keringanan untuk tidak berpuasa bagi orang yang sakit dan bepergian (musafir). • Bagi wanita yang hamil dan menyusui maka firman Allah “Dan bagi orang-orang yang berat untuk menjalankannya (jika mereka tidak berpuasa)” (ayat 184) diperbolehkan untuk berbuka dan menggantinya di hari lain. Begitu juga orang yang sudah tua dan orang sakit yang sudah tidak bisa diharapkan untuk sembuh, boleh untuk berbuka dan tidak wajib untuk mengganti di hari lain, akan tetapi harus memberi makan setiap hari yang ditinggalkan satu orang miskin sebanyak dua telapak tangan penuh. Wanita hamil dan menyusui apabila mereka takut terhadap kesehatan janin dan anaknya atau terhadap dirinya, maka wajib baginya selain mengganti puasanya untuk memberi makan satu orang miskin. • Dalam puasa terdapat beberapa manfaat secara spiritual dan sosial yang agung, ditunjukkan dengan firman Allah,”Jika kalian mengetahui.” Beberapa manfaat berpuasa : 1. Menumbuhkan rasa takut kepada Allah dalam diri orang yang berpuasa, baik saat sendiri maupun di keramaian. 2. Mengurangi gejolak nafsu syahwat sehingga bagi orang yang belum menikah dianjurkan untuk berpuasa. 3. Mendidik jiwa untuk bersikap lembut dan memiliki rasa kasih sayang. 4. Terdapat persamaan dalam ibadah puasa antara orang kaya dengan orang miskin, bangsawan dengan orang biasa. 5. Membiasakan umat Islam untuk disiplin, bersatu, dan berkasih sayang antar sesama. 6. Menghilangkan zat-zat yang mengendap dalam tubuh sehingga membaiklah kesehatan orang yang berpuasa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 184: Allah mengabarkan wajib bagi kalian untuk berpuasa dihari-hari yang telah ditentukan, maka barangsiapa yang takut atau safar maka Allah memberikan keringanan untuk berbuka dan baginya qadha dihari yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu orang yang sakit berat, orang yang sangat tua, orang yang hamil atau menyusui yang mengkhawatirkan anaknya. Faedah: Ada yang berpendapat bahwa pada permulaan diwajibkan puasa, sedangkan sebelumnya para sahabat belum terbiasa melakukan puasa sehingga terasa berat oleh mereka, Allah Subhaanahu wa Ta'aala memerintahkan secara bertahap. Dia memberikan pilihan kepada mereka yang mampu berpuasa untuk melakukan salah satu dari kedua perkara ini; berpuasa atau membayar fidyah. Namun berpuasa tetap lebih utama. Setelah itu, Allah Subhaanahu wa Ta'aala menjadikan puasa mesti dilakukan bagi mereka yang mampu (yakni mampu, sehat dan hadir pada bulan itu di negeri tempat tinggalnya) dengan firman-Nya \"Faman syahida minkumusy syahra fal yashum-h\", Ibnu Abbas berkata, \"Kecuali wanita yang hamil dan menyusui, jika keduanya mengkhawatirkan keadaan anaknya, maka ayat ini tetap berlaku tidak dihapus hukumnya bagi mereka berdua.\" Seukuran satu mud (satu kaupan tangan orang dewasa) dari makanan pokok daerah setempat. Maksudnya memberi makan lebih dari seorang miskin untuk satu hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 184",
    "description": "Kewajiban berpuasa itu beberapa hari tertentu pada bulan ramadan. Maka barang siapa di antara kamu sakit sehingga tidak sanggup berpuasa, atau dalam perjalanan lalu tidak berpuasa, maka ia wajib mengganti puasa sebanyak hari yang ia tidak berpuasa itu pada hari-hari yang lain. Dan bagi orang yang berat menjalankannya karena sakit berat yang tidak ada harapan sembuh atau karena sangat tua, wajib membayar fidyah atau pengganti yaitu memberi makan kepada seorang miskin untuk satu hari yang tidak berpuasa itu. Tetapi barang siapa dengan kerelaan hati mengerjakan kebajikan lalu memberi makan kepada lebih dari seorang miskin untuk satu hari tidak berpuasa, maka itu lebih baik baginya. Dan kamu sekalian tetap berpuasa, maka pilihan untuk tetap berpuasa itu lebih baik bagi kamu dibandingkan dengan memberikan fidyah, jika kamu mengetahui keutamaan berpuasa menurut Allah. Bulan ramadan adalah bulan yang di dalamnya untuk pertama kali diturunkan Al-Qur'an pada lailatul qadar, yaitu malam kemuliaan, sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda antara yang benar dan yang salah. Karena itu, barangsiapa di antara kamu ada, yakni hidup, di bulan itu dalam keadaan sudah akil balig, maka berpuasalah. Dan barang siapa yang sakit di antara kamu atau dalam perjalanan lalu memilih untuk tidak berpuasa, maka ia wajib menggantinya sebanyak hari yang ditinggalkannya itu pada hari-hari yang lain. Allah menghendaki kemudahan bagimu dengan membolehkan berbuka, dan tidak menghendaki kesukaran bagimu dengan tetap mewajibkan puasa dalam keadaan sakit atau dalam perjalanan. Hendaklah kamu mencukupkan bilangannya dengan berpuasa satu bulan penuh dan mengakhiri puasa dengan bertakbir mengagungkan Allah atas petunjuknya yang diberikan kepadamu, agar kamu bersyukur atasnya."
  }
]