[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bulan Ramadan adalah bulan dimana Allah mulai menurunkan al-quran pada malam kemuliaan (Lailatul Qadar), sebagai sumber hidayah bagi seluruh manusia menuju kepada kebenaran. Di dalamnya terdapat bukti petunjuk yang paling jelas yang mengantarkan kepada hidayah Allah dan pembeda antara kebenaran dengan kebatilan. Maka barangsiapa diantara kalian menyaksikan kehadiran bulan ini dalam keadaan sehat dan mukim hendaklah berpuasa pada siang harinya. dan diberikan kemudahan bagi orang sakit dan musafir untuk tidak berpuasa kemudian mereka berdua mengqadha yang sesuai dengan jumlah hari itu. Allah Subhanahu Wa Ta'ala menghendaki keringanan dan kemudahan bagi kalian dalam ajaran ajaran syariat Nya, dan tidak menghendaki kesulitan keberatan dari kalian. Agar kalian menyempurnakan hitungan puasa selama sebulan penuh, dan agar kalian menutup ibadah puasa dengan bertakbir mengagungkan Allah pada hari raya Idul Fitri, serta supaya kalian mengagungkan Nya atas hidayah Nya kepada kalian, dan Agar kalian mensyukuri atas kenikmatan Nya yang tercurah pada kalian berupa hidayah taufik dan kemudahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "185. Bulan Ramadan adalah bulan dimulai proses turunnya Al-Qur`ān kepada Nabi -ṣallallāhu 'alaihi wa sallam- pada malam Qadar. Allah menurunkan Al-Qur`ān sebagai petunjuk bagi manusia. Al-Qur`ān itu berisi pentuk yang jelasa dan pemisah yang membedakan antara perkara yang hak dan yang batil. Siapa saja yang menemui bulan Ramadan dalam keadaan mukim dan sehat, hendaklah dia menjalankan puasa secara wajib. Siapa yang sakit sehingga tidak mampu berpuasa atau bepergian jauh, dia boleh berbuka. Dan jika dia berbuka, dia wajib mengganti puasa sebanyak hari-hari dia berbuka. Dengan syariat yang ditetapkan itu, Allah menghendaki kemudahan bagi kalian dan tidak menghendaki kesulitan. Juga supaya kalian menyempurnakan bilangan puasa selama sebulan penuh. Dan supaya kalian mengagungkan nama Allah di penutup bulan Ramadan dan hari raya (Idul Fitri) karena Dia telah membimbing kalian untuk menjalankan ibadah puasa dan membantu kalian menyempurnakannya hingga sebulan penuh. Serta supaya kalian bersyukur kepada Allah atas petunjuk-Nya untuk memeluk agama yang Dia ridai untuk kalian ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "185. Allah menyebutkan keutamaan bulan puasa, yaitu bulan diturunkannya al-Qur’an sebagai petunjuk bagi manusia menuju kebenaran, di dalamnya terdapat bukti-bukti yang sangat jelas tentang petunjuk Allah dan penjelasan tentang perbedaan kebatilan dan kebenaran. Maka barangsiapa yang berada dalam bulan tersebut ketika ia tidak sakit atau bepergian jauh maka wajib baginya untuk berpuasa di siang harinya. Namun bagi orang yang sakit atau bepergian jauh sehingga berat baginya berpuasa, maka boleh baginya tidak berpuasa, kemudian mengganti puasa itu di hari yang lain sesuai dengan jumlah hari yang ia tidak berpuasa. Dengan keringanan ini Allah menghendaki kemudahan bagi kalian dan tidak menghendaki kesusahan. Maka hendaklah kalian menyempurnakan puasa sebulan penuh, dan mengakhiri bulan puasa dengan zikir dan takbir pada hari raya idul fitri sebagaimana Allah ajarkan kepada kalian, sehingga kalian bersyukur kepada Allah atas karunia-Nya dengan perkataan dan perbuatan. Ibnu Umar berkata, ketika Rasulullah menyebutkan Ramadhan beliau bersabda: “Janganlah kalian berpuasa sampai kalian melihat hilal, dan janganlah kalian berhari raya sampai melihat hilal pula. Dan jika pandangan kalian terhalang awan maka perhatikanlah perhitungan bulan.” (Shahih Bukhari, Shaum, Bab 11, No. 1906. Shahih Muslim, Puasa, No. 760)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "185. شَهْرُ رَمَضَانَ الَّذِىٓ أُنزِلَ فِيهِ الْقُرْءَانُ (bulan Ramadhan, bulan yang di dalamnya diturunkan Al Quran) Yakni diturunkan seluruhnya dari Lauh mahfudh ke langit dunia. Pendapat lain mengatakan : ayat pertama dari al-Qur’an diturunkan pada bulan Ramadhan di malam lailatul qadr. هُدًى لِّلنَّاسِ (sebagai petunjuk bagi manusia) Yakni sebagai hidayah bagi mereka. وَبَيِّنٰتٍ مِّنَ الْهُدَىٰ (dan penjelasan-penjelasan mengenai petunjuk) Kata (البينات) khusus ayat-ayat al-Muhkam dari al-Qur’an. وَالْفُرْقَانِ ۚ (dan pembeda) Yakni yang membedakan antara kebenaran dan kebathilan (yang memisahkan). فَمَن شَهِدَ مِنكُمُ الشَّهْرَ (Karena itu, barangsiapa di antara kamu hadir di bulan itu) Yakni dalam keadaan mukim, bukan sedang safar; dan apabila sedang safar diperbolehkan untuk berbuka. Dan apabila disebagian bulan dia bermukim dan sebagian lainnya dia melakukan safar maka tidak wajib baginya kecuali berpuasa disaat dia bermukim saja. يُرِيدُ اللَّـهُ بِكُمُ الْيُسْرَ (Allah menghendaki kemudahan bagimu) Yakni sehingga Allah memberi keringanan bagi orang sakit dan musafir untuk berbuka. Makna (اليسر) yakni kemudahan dan tanpa adanya kesusahan pada maqasid Allah dalam segala urusan agama. Dan Rasulullah senantiasa mengarahkan untuk memberi kemudahan dan melarang memberi kesulitan, sebagaimana sabda beliau: (يسروا ولا تعسروا وبشروا ولا تنفروا) Permudahlah dan jangan mempersulit, gembirakanlah dan jangan membuat orang lari وَلِتُكْمِلُوا۟ الْعِدَّةَ (Dan hendaklah kamu mencukupkan bilangannya) Yakni disyari’atkan melakukan qadha’ bagi orang yang tidak berpuasa disebabkan sakit atau safar agar dapat melengkapikan jumlah harinya, dan menyempurnakan pahalanya. وَلِتُكَبِّرُوا۟ اللَّـهَ (dan hendaklah kamu mengagungkan Allah) Yakni mengagungkannya dengan ibadah puasa dan zikir. Diriwayatkan bahwa sebagian salaf dahulu melantunkan takbir di malam Idul fitri, ketika melihat hilal Syawwal mereka bertakbir hingga keluarnya Imam untuk shalat ‘Id."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Puasa adalah sebab diangkatnya hubungan hati manusia dan bergantung kepada hati sang pencipta langit dan bumi yang dari-Nya al-Qur’an ini diturunkan. 2 ). { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ } Turunya al-Qur’an pada bulan ini lebih awal sebelum diwajibkannya berpuasa pada bulan yang sama, yaitu bulan qur’an sebelum menjadi bulan puasa, maka berkumpullah dua keistimewaan didalamnya, dan para salaf telah faham akan hal ini, mereka berpuasa dibulan ini, dan mereka menghidupkan malamnya dengan shalat dan siangnya dengan tilawah al-Qur’an dan mentadabburinya, demi mewujudkan keagungan nama bulan ini. 3 ). { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ } Puasa memiliki kaitan dengan al-Qur’an yang begitu kuat, dari segi bahwasanya ia adalah sebab diangkatnya ketergantungan hati manusia kepada sang pencipta, sebagaimana ia juga merupakan sebab kejernihan fikiran seorang hamba dan kelembutan hatinya, yang dengannya ia mengambil manfaat dari al-Qur’an. 4 ). Allah menyebut bulan Ramadhan sebagai : { الَّذِي أُنْزِلَ فِيهِ الْقُرْآ } bulan yang diturunkan di dalamnya al-Qur’an, agar ketergantungan setiap muslim dengannya lebih tinggi, agar mereka lebih menyibukkan diri dengan al-Qur’an : membacanya dengan sendiri atau Bersama keluarga, mengisi setiap Lorong waktu dengannya, memanfaatkan fasilitas-fasilitas modern untuk menyebarkan al-Qur’an, agar bulan Ramadhan benar-benar menjadi bulan al-Qur’an. 5 ). Al-Qur’an diturunkan sebagai petunjuk; oleh karena itu al-qur’an menyebutkan kata “al-Hidayah” di awal surah al-Fatihah dan awal surah al-baqarah { هُدًى لِلْمُتَّقِينَ }, dan tilawah al-Qur’an ketika maksud dengannya seseorang menggapai hidayah ditiadakan maka keagungan terbesar al-Qur’an telah hilang, oleh karena itu setiap orang yang membaca al-Qur’an agar menghadirkan dalam hatinya maksud menggapai hidayah dengan al-Qur’an dan menggapai cahayanya, dan memohon kesembuhan dengan kalam tuhannya, dan tidak hanya sekedar membaca huruf-huruf. 6 ). Diantara keutamaan bulan puasa romadhon bahwasanya Allah memujinya diantara bulan-bulan selainnya, Allah juga memilihnya untuk diturunkan didalamnya al-Qur’an, kemudian Allah memuji al-Qur’an yang Dia turunkan ini dengan : {هُدًى } petunjuk bagi siapa yang beriman kepadanya, dan bahwasanya al-Qur’an ini { بينات } sebagai penjelas bagi siapa yang mentadabburinya, al-Qur’an sebagai pembeda antara yang haq dan yang bathil dan antara yang haram dan yang halal. 7 ). Ummat ini tengah menghadapi satu masa yang paling sulit dalam sejarah, hal itu ditandai dengan berbagai fitnah yang sedang terjadi, banyaknya kesesatan yang setiap hari semakin bertambah, serta kebenaran yang telah bercampur dengan kebathilan, maka barangsiapa yang di mudahkan baginya jalan petunjuk niscaya ia akan menang, dan jalan untuk mencapai hal itu adalah dengan al-Qur’an tanpa berpaling kepada selainnya; amatilah ayat ini : { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَىٰ وَالْفُرْقَانِ }. 8 ). Tatkala Allah mensyari’atkan puasa tanpa menggantinya dengan syari’at lain (padahal rintangan yang ada didalmnya begitu besar) Allah kemudian mengatakan setelahnya : { يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ } , maka dapat difahami abhwasanya kemudahan yang hakiki adalah yang datang dari Allah ta’ala, bukan kemudahan yang merubah syari’at-syari’at islam. 9 ). Ibnu ‘Abbas berkata : Hendaknya bagi setiap muslim ketika melihat masuknya waktu bulan syawal agar mereka bertakbir mengagungkan nama Allah sampai berakhirnya waktu ‘ied, hal ini berdasarkan firman Allah : { وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ } . 10 ). { وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ } Hidayah Allah mencakup banyak makna, diantaranya : hidayah ilmu, hidayah amal, maka barangsiapa yang berpuasa romadhon dan menyempurnakannya sampai akhir, niscaya Allah akan menganugerahkanya dengan dua hidayah itu, dan tanda syukur kepada Allah dengan empat perkara : Allah menghendaki bagi hambanya kemudahan, dan Dia tidak menghendaki bagi mereka kesukaran, menyempurnakan jumlah, dan bertakbir atas apa yang telah Ia berikan kepada kita, semua ini adalah nikmat Allah yang harus disyukuri dengan menjalankan perintah-Nya, dan menjauhi segala larangan-Nya. 11 ). { وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ } Pada lafazh : { عَلَىٰ مَا هَدَاكُمْ } membuat kejutan bagi siapa yang memahaminya, karena tidaklah bagi kalian wahai orang yang berpuasa dan senantiasa berinfaq melainkan syari’at ini adalah petunjuk bagi kamu, oleh karena itu Allah menyebutkan dalam ayat ini : { وَلَعَلَّكُمْ تَشْكُرُونَ }. 12 ). { وَلَعَلَّكُمْ تَشْكُرُونَ } Seseorang berkata : ketika berpuasa kita menemukan banyak penderitaan dan kelelahan, lalu kenapa kita diperintahkan untuk bersyukur ? maka dikatakan kepadanya : barangsiapa yang mampu melihat buah hasil dibalik kewajiban ini, Seperti manisya munajat kepada Allah, indahnya tilawah al-Qur’an, berbagai kebaikan-kebaikan yang dilimpahkan kepada orang yang berpuasa, dan kasih sayang Allah kepada mereka, dan perlindungan dari api neraka, maka dia akan tahu bahwasanya Allah berhak atas hamba-Nya kesyukuran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "185. Bulan puasa diistimewakan dengan turunnya Al-Qur’an di dalamnya pada malam lailatul qadar, atau dengan turunnya Al-Qur’an dalam satu jumlah dari lauhil mahfudz ke langit dunia sebagai petunjuk bagi manusia dari kesesatan dan ayat-ayat muhkamat yang memberi penjelasan berupa hidayah Tuhan yang kuat, jelas dan terang bagi akal sehat, yaitu pemisah antara yang haq dan bathil. Maka barangsiapa hadir dalam bulan itu dalam keadaan bermukim bukan sedang berpergian lalu melihat hilal, maka wajib baginya untuk berpuasa. Dan barangsiapa sakit sehingga keberatan untuk berpuasa atau dalam keadaan berpergian di sebagian bulan atau sepenuhnya maka dia diperbolehkan untuk tidak puasa. Lalu menggantinya dengan hari-hari biasa yang mana dia tidak puasa di bulan selain ramadhan. Allah ingin memudahkan kalian dengan memberi kemurahan bagi orang yang berpergian, dan orang yang sakit untuk berbuka, bukan menginginkan kesulitan. Dan tindakan mengqadha’ puasa bagi orang yang tidak berpuasa karena uzur itu guna menyempurnakan hari dimana dia tidak berpuasa dan untuk menyempurnakan pahalanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bulan Ramadan adalah (bulan) yang di dalamnya diturunkan Al-Qur’an sebagai petunjuk bagi manusia dan keterangan-keterangan} petunjuk-petunjuk yang jelas {mengenai petunjuk dan pembeda} pemisah antara kebaikan dan kebathilan {maka siapa saja di antara kalian hadir} hadir di tempat bermukim yang benar {pada bulan itu, maka berpuasalah. Siapa saja yang sakit atau dalam perjalanan (lalu tidak berpuasa), maka (wajib mengganti) sebanyak hari (yang ditinggalkannya) pada hari-hari yang lain. Allah menghendaki kemudahan bagi kalian dan tidak menghendaki kesukaran. Hendaklah kalian menyempurnakan bilangannya} jumlah hari-harinya dalam satu bulan {dan mengagungkan Allah} dan hendaknya kalian mengagungkan Allah dengan bertakbir kepadaNya pada hari raya Idul Fitri {atas apa yang Dia tunjukkan kepada kalian agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "185. “(Beberapa hari yang ditentukan itu ialah) bulan Ramadhan bulan yang di dalamnya diturunkan (permulaan) Alquran,” yaitu puasa yang diwajibkan atas kalian adalah bulan Ramadan yaitu bulan yang agung, bulan yang di mana kalian memperoleh didalamnya kemuliaan yang besar dari Allah, yaitu Alquran al-karim yang mengandung petunjuk bagi kemaslahatan kalian, baik untuk agama maupun dunia kalian, dan sebagai penjelas kebenaran dengan sejelas-jelasnya, sebagai pembeda antara yang benar dan yang batil, petunjuk dan kesesatan, orang-orang yang bahagia dan orang-orang yang sengsara, maka patutlah keutamaan ini bagi bulan tersebut, dan hal ini merupakan kebajikan Allah terhadap kalian, dengan menjadikan bulan ini sebagai suatu musim bagi hamba yang diwajibkan berpuasa padanya. Lalu ketika Allah menetapkan hal itu, menjelaskan keutamaannya dan hikmah Allah dalam pngkhususannya itu, Dia berfirman, “Karena itu, barangsiapa diantara kamu hadir (di negeri tempat tinggalnya) di bulan itu, maka hendaklah ia berpuasa pada bulan itu.” Ini merupakan keharusan berpuasa atas orang yang mampu, sehat lagi hadir, dan ketika nasakh itu memberikan pilihan antara berpuasa dan membayar Fidyah saja, ia mengulangi kembali keringanan bagi orang yang sakit dan musafir agar tidak diduga bahwa keringanan tersebut juga dinasakh, Allah berfirman, “Allah menghendaki kemudahan bagimu dan tidak menghendaki kesukaran bagimu.” Maksudnya, Allah menghendaki hal yang memudahkan bagi kalian jalan yang menyampaikan kalian kepada RidhoNya dengan kemudahan yang paling mudah dan meringankan nya dengan keringanan yang paling ringan. Oleh karena itu, segala perkara yang diperintahkan oleh Allah atas hamba-hambaNya pada dasarnya adalah sangat mudah sekali, namun bila terjadi suatu rintangan yang menimbulkan kesulitan, maka Allah akan memudahkannya dengan kemudahan lain, yaitu dengan menggugurkannya atau menguranginya dengan segala bentuk pengurangan, dalam hal ini adalah suatu hal yang tidak mungkin dibahas perinciannya, karena perinciannya merupakan keseluruhan syariat dan termasuk di dalamnya segala macam keringanan keringanan dan pengurangan pengurangan. “Dan hendaknya kamu mencukupkan bilangannya.” Ayat ini wallahualam, agar orang tidak berpikir bahwa puasa itu dapat dilakukan hanya dengan separuh bulan saja. Allah menolak pemikiran seperti itu dengan memerintahkan untuk menyempurnakan bilangannya, kemudian Bersyukur kepada allah saat telah sempurna segala bimbingan, kemudahan, dan penjelasanNya kepada hamba-hambaNya, dan dengan bertakbir ketika berlalu perkara tersebut, dan termasuk di dalam hal ini adalah bertakbir ketika melihat Hilal di bulan Syawal hingga selesai khutbah Id."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { شَهۡرُ رَمَضَانَ } Syahru Ramadhan : Bulan kesembilan dari urutan tahun Qomariyah, kata syahr (bulan) diambil dari kata syuhrah (terkenal), dan kata Ramadhan diambil dari kata ramadha ash-shaim apabila orang yang berpuasa merasakan panas dalam tenggorokannya karena haus. { ٱلَّذِيٓ أُنزِلَ فِيهِ ٱلۡقُرۡءَانُ } Aladziy unzila fiihil qur’aan : Ini menunjukkan keutamaan bulan Ramadhan dibandingkan bulan-bulan yang lain, karena Allah menurunkan Al-Qur’an pada bulan Ramadhan, pada malam lailatul qadar berdasarkan ayat,”Sesungguhnya kami menurunkan Al-Qur’an pada malam yang berkah” (QS Adh-Dhukan : 3). Diturunkan sekaligus dari Lauhul mahfudz ke Baitul ‘Izzah di langit dunia. Kemudian setelah itu diturunkan secara berangsur-angsur. Dimulai turunnya Al-Qur’an kepada Rasulullah ﷺ di bulan Ramadhan juga. { هُدٗى لِّلنَّاسِ } Hudan linnaas : Petunjuk bagi manusia untuk mencapai kesempurnaan dan kebahagiaan di dunia dan akhirat. { وَبَيِّنَٰتٖ مِّنَ ٱلۡهُدَىٰ وَٱلۡفُرۡقَانِۚ } Wa bayyinaatin minal huda wal furqan : Al-Bayyinaat merupakan bentuk jamak dari bayyinah, dan al-Huda artinya adalah petunjuk. Maksudnya bahwa Al-Qur’an turun sebagai petunjuk bagi manusia, menjelaskan jalan petunjuk bagi mereka, dan menerangkan jalan keberhasilan dan kesuksesan, serta menjadi pembeda antara kebenaran dan kebathilan dalam setiap sisi kehidupan. { شَهِدَ ٱلشَّهۡرَ } Syahida asy-Syahra : Hadir dan tidak bepergian ketika pengumuman hilal di bulan Ramadhan. { فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۗ } Fa’iddatun min ayyaamin ukhar : Wajib baginya untuk mengganti (qadha’) sejumlah hari yang tidak berpuasa karena sakit atau bepergian. { وَلِتُكۡمِلُواْ ٱلۡعِدَّةَ } Walitukmilul ‘iddah : Wajib melakukan qadha’ untuk menyempurnakan bilangan bulan Ramadhan menjadi 30 atau 29 hari. { وَلِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡ } Walitukabbiruullahh ‘ala maa hadaakum : Hal itu ketika menyempurnakan puasa Ramadhan sejak melihat hilal Syawal sampai kembali dari shalat ‘Ied. Bertakbir pada saat itu disyariatkan dan pahalanya besar. Redaksi takbirnya sebagai berikut : Allau akbar, Allahu akbar, Laa ilaha illallahu, Allahu akbar, Allahu akbar walillahil hamd. { وَلَعَلَّكُمۡ تَشۡكُرُونَ } Wa la’allakum tasykurun : Diwajibkan untuk berpuasa dan disunnahkan untuk bertakbir agar menjadi orang-orang yang bersyukur kepada Allah Ta’ala atas segala kenikmatan, karena syukur merupakan bentuk ketaatan. Makna ayat : Ketika Allah menyebutkan kewajiban untuk berpuasa bagi umat Islam di bulan Ramadhan pada ayat sebelumnya, dengan bilangan hari tertentu, lantas Allah menjelaskan dalam ayat ini bahwa yang dimaksud dengan bilangan hari tertentu itu adalah hari-hari pada bulan Ramadhan yang diberkahi. Dimana pada bulan itu Allah Ta’ala menurunkan Al-Qur’an sebagai petunjuk dan penjelas jalan hidayah, serta pembeda antara kebenaran dan kebathilan. Allah ta’ala berfirman,”Beberapa hari yang ditentukan itu ialah bulan Ramadhan, bulan yang di dalamnya diturunkan permulaan Al-Qur’an sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda (antara yang hak dan yang bathil). Karena itu, barangsiapa di antara kamu hadir (di negeri tempat tinggalnya) di bulan itu.” Yang dimaksud adalah bulan Ramadhan, dan makna Syahida adalah sedang mukim tidak bepergian ketika ada pengumuman mengenai rukyah hilal Ramadhan. “Maka berpuasalah” menunjukkan kewajiban jika orang tersebut mukallaf. Kemudian Allah Ta’ala menyebutkan udzur untuk tidak berpuasa karena sakit dan bepergian (safar), bagi orang yang tidak berpuasa karena sebab itu wajib untuk mengganti di hari lain sesuai jumlah hari yang ditinggalkan. Lantas Allah mengabarkan bahwa rukhsah yang diberikan untuk berbuka bagi orang yang sakit dan musafir merupakan bentuk kemudahan bagi umat, dan tidak menginginkan kesusahan baginya. Maka bagi Allah segala pujian. Firman Allah “Dan barangsiapa sakit atau dalam perjalanan (lalu ia berbuka), maka (wajiblah baginya berpuasa), sebanyak hari yang ditinggalkannya itu, pada hari-hari yang lain. Allah menghendaki kemudahan bagimu, dan tidak menghendaki kesukaran bagimu.” Selanjutnya Allah menyebutkan alasan untuk mengganti di hari lain dalam firman Nya (وَلِتُكۡمِلُواْ ٱلۡعِدَّةَ ) “Untuk menyempurnakan bilangan hari” maknanya : Pertama adalah untuk menyempurnakan hari-hari Ramadhan. Kedua agar mereka mengagungkan Allah atas petunjuk Nya yang diberikan kepadamu.” Ketika kalian menyempurnakan puasa dengan melihat hilal bulan Syawal. Terakhir, menyiapkan diri kalian dengan berpuasa dan berdzikir agar bersyukur kepada Allah sesuai firman Nya”Agar kamu bersyukur.” Pelajaran dari ayat : • Keutamaan bulan Ramadhan dan keutamaan Al-Qur’an. • Kewajiban berpuasa Ramadhan bagi mukallaf. Makna mukallaf yaitu orang Islam yang berakal, baligh, dan bagi perempuan sedang tidak haidh atau nifas. • Keringanan yang diberikan bagi orang sakit, ketika takut kesembuhannya akan terlambat atau bertambah parah sakitnya. Sedangkan untuk musafir, bagi yang menempuh jarak diperbolehkannya mengqashar shalat. • Kewajiban untuk mengganti puasa bagi yang tidak berpuasa karena udzur. • Kemudahan syariat Islam, jauh dari kesulitan dan kesusahan. • Disyariatkan untuk bertakbir pada malam ‘Ied dan pada saat hari raya ‘Ied. Takbir ini merupakan bagian dari bersyukur kepada Allah karena nikmat hidayah Islam. • Ketaatan merupakan bentuk kesyukuran. Barangsiapa tidak taat kepada Allah dan rasul Nya maka tidak disebut sebagai orang yang bersyukur, dan bukan golongan orang-orang yang bersyukur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 185: Allah mengabarkan bahwasannya bulan ramadhan adalah bulan yang diturunkan padanya Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dari Al Lauhul Mahfuzh ke langit dunia di malam Lailatul Qadr. Yakni dalam keadaan sehat dan tidak safar. Ayat ini menunjukkan bahwa semua perintah Allah kepada hamba-hamba-Nya pada asalnya adalah mudah. Oleh karena itu, ketika ada beberapa hal yang menjadikannya berat, maka Allah Subhaanahu wa Ta'aala mengadakan bentuk kemudahan lainnya, bisa berupa pengguguran kewajiban (misalnya gugurnya kewajiban hajji bagi yang tidak mampu) atau meringankan dengan berbagai bentuk peringanan (misalnya ketika shalat, jika tidak sanggup sambil berdiri, bisa dilakukan sambil duduk dsb). Dengan bertakbir pada hari Idul Fithri. Sebagain ulama ada yang berdalil dengan ayat ini, bahwa takbir 'Ied dimulai dari sejak melihat hilal Syawwal sampai selesai khutbah 'Ied. Yakni terhadap nikmat hidayah, taufiq dan kemudahan-Nya yang diberikan kepada kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 185",
    "description": "Bulan ramadan adalah bulan yang di dalamnya untuk pertama kali diturunkan Al-Qur'an pada lailatul qadar, yaitu malam kemuliaan, sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda antara yang benar dan yang salah. Karena itu, barangsiapa di antara kamu ada, yakni hidup, di bulan itu dalam keadaan sudah akil balig, maka berpuasalah. Dan barang siapa yang sakit di antara kamu atau dalam perjalanan lalu memilih untuk tidak berpuasa, maka ia wajib menggantinya sebanyak hari yang ditinggalkannya itu pada hari-hari yang lain. Allah menghendaki kemudahan bagimu dengan membolehkan berbuka, dan tidak menghendaki kesukaran bagimu dengan tetap mewajibkan puasa dalam keadaan sakit atau dalam perjalanan. Hendaklah kamu mencukupkan bilangannya dengan berpuasa satu bulan penuh dan mengakhiri puasa dengan bertakbir mengagungkan Allah atas petunjuknya yang diberikan kepadamu, agar kamu bersyukur atasnya. Dan apabila hamba-hamba-ku bertanya kepadamu, nabi Muhammad, tentang aku karena rasa ingin tahu tentang segala sesuatu di sekitar kehidupannya, termasuk rasa ingin tahu tentang tuhan, maka jawablah bahwa sesungguhnya aku sangat dekat dengan manusia. Aku kabulkan permohonan orang yang berdoa dengan ikhlas apabila dia berdoa kepadaku dengan tidak menyekutukan-ku. Hendaklah mereka itu memenuhi perintah-ku yang ditetapkan di dalam Al-Qur'an dan diperinci oleh rasulullah, dan beriman kepada-ku dengan kukuh agar mereka memperoleh kebenaran atau bimbingan dari Allah."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Allah ta’ala memberi keutamaan untuk bulan Romadhon diatas bulan-bulan yang lain dengan memilihnya sebagai bulan diturunkaannya Al-quran. Dia memberikan keistimawaan ini pada bulan Ramadhan sebagaiman telah dinyatak dalam hadits yang menerangkan bahwa bulan Romadhon adalah bulan diturunkannya kitab-kitab ilahiyah kepada para Nabi. Imam Ahmad bin Hanbal meriwayatkan dari Wassilah bin Al-Asqa’,bahwa Rosululloh sholullohu ‘alaihi wasallam bersabda : أنزلت صحف إبراهيم في أول ليلة من رمضان . وأنزلت التوراة لست مضين من رمضان ، والإنجيل لثلاث عشرة خلت من رمضان ، وأنزل الله القرآن لأربع وعشرين خلت من رمضان “shuhuf (lembaran-lembaran) Ibrahim diturunkan pada malampertama bulan Ramadhan, taurot diturunkan pada tanggal 6 Ramadhan, Injil diturunkan pada tanggal 13 ramadhan, dan Alquran diturunkan pada tanggal 24 Ramadhan”. (HR. Ahmad) Shuhuf Ibrahim, kitab Taurot, Zabur, Injil diturunkan kepada nabi penerimanya dalam satu kitab sekaligus. Sedangkan Alquran diturunkan secara sekaligus dari lauhil mahfudz ke Baitul ‘Izzah di langit dunia , dan hal itu terjadi pada bulan Ramadhan pada malam lailatul Qodar. Sebagaiman firman-Nya : إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ “sesungguhnya Kami telah menurunkannya pada malam kemulian” (QS. Al-Qodar :1) Setelah itu, Alquran diturunkan secara bertahap kepada Rosululloh sholallohu ‘alaihi wasallam, ayat demi ayat sesuai dengan peristiwa yang terjadi kepadanya dan sebagai jawaban atas tantangan orang kafir. Demikian riwayat Ibnu Abbas yang senada denga firman-Nya : وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآَنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا Berkatalah orang-orang yang kafir: \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar). Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya. (QS. Al-Furqon : 32 – 33) Kemudian Allah Ta’ala memuji kembali Al-Quran berdasarkan fungsinya, yaitu sebagai petunjuk bagi manusia, sebagaimana firman-Nya : هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ “Sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda (antara yang hak dan yang bathil)” Maksudnya, Alquran berfungsi sebagai petunjuk bagi hamba-Nya yang beriman dan mentaati-Nya, dan juga sebagai dalil dan hujjah yang nyata dan jelas bagi orang-orang yang memahaminya dan memperhatikannya. Hal ini menunjukan kebenaran ajaran yang dibawanya,berupa petunjuk yang menentang kesesatan dan bimbingan yang melawan penyimpangan,serta pembeda antara yang hak dan yang batil,yang halal dan yang haram. Dan firman-Nya : فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ “Barangsiapa di antaramu hadir (di negeri tempat tinggalnya) pada bulan itu, maka hendaklah ia berpuasa” Ini merupakan kewajiban yang bersifat pasti bagi orang yang menyaksikan permulaan bulan Romadhon, artinya bermukim ditempat tinggalnya dan tidak sedang melakukan perjalan jauh ketika masuk bulan Ramadhan, sedang ia benar-benar dalam kondisi sehat fisik, maka ia harus melakasanakan ibadah puasa. Ayat ini menasakh dibolehkannya orang yang sehat yang berada ditempat tinggalnya untuk tidak harus berpuasa tetapi boleh menggantinya dengan membayar fidyah berupa pemberian makanan kepada orang miskin untuk setiap hari yang ia tidak berpuasa. Kemudian Allah kembali memberikan rukhsoh bagi orang yang sakit hingga merasa berat dan terganggu jika berpuasa dan orang yang berada di perjalanan untuk tidak berpuasa dengan syarat mengqodonya. Sebagaimana firman-Nya : وَمَنْ كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ “Dan barangsiapa yang sakit atau dalam perjalanan (lalu ia berbuka), maka (wajiblah baginya berpuasa) sebanyak hari yang ditinggalkannya itu, pada hari-hari yang lain” Halini tiada lain adalah kasih saying Allah bagi hamba-Nya, Dia tidak menghendaki kesulitan baginya melainkan kemudahan-kemudahan sebagaimana firman-Nya : يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلَا يُرِيدُ بِكُمُ الْعُسْرَ “Allah menghendaki kemudahan bagimu dan tidak menghendaki kesulitan bagimu”. Dalam Masalah hukum berpuasa bagi orang yang sedang dalam perjalanan, terdapat perbedaan pendapat dikalangan para ulama : Pertama; Sebagian ulama salaf berpendapat bahwa barangsiapa yang keadaannya muqim di awal bulan, lalu kemudian dia safar ditengah bulan, maka tidak ada ‘udzur baginya untuk iftor karena dafar itu. Berdasarkan firman-Nya : فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ “Barangsiapa diantaramu hadir (di negeri tempat tinggalnya) pada bulan itu, maka hendaklah ia berpuasa” Karena sesungguhnya kebolehan iftor hanya bagi musafir yang telah melkukan perjalanan dari awalbulan. Ini merupakan pendapat yang asing yang dinuqil oleh Abu Muhammad Bin Hazm dalamkitabnya Al-Muhalla. Padahal telah ditegaskan dalam sunnah yang menijelaskan bahwa Rosululloh sholallohu ‘alaihi wasallam pernah keluar pada bulan Romadhan untuk berperang pembebasan kota Mekah. Beliau berjalan hingga sampai al-Kadid, lalu beliau berbuka dan menyurh orang-orang untuk berbuka. Hadits ini diriwayatkan Bukhori dan Muslim dalam kitabnya. Kedua; Sebagia para sahabat dan tabi’in berpendapat wajibnya iftor bagi orang yang sedang safar,berdasarkan firman-Nya : “maka gantilah di hari-hari yang lain”. Dan yang shohih adalah pendapatnya Jumhur para ulama yang mengatakan bahwa berpuasa dan berbuka pada saat safara dalah sebuah pilihan dan bukan keharusan. Hal ini berdasarkan apa yang terjadi pada Rosululloh sholallohu ‘alaihi wasallam dan paras ahabatnya pada suatu perjalanan dan diatara mereka ada yang berpuasa dan ada juga yang berbuka. Sebagaimana hadits yang diriwayatkan Bukhori dan Muslim dari Abu Darda berikut ini : خرجنا مع رسول الله صلى الله عليه وسلم في شهر رمضان في حر شديد ، حتى إن كان أحدنا ليضع يده على رأسه من شدة الحر وما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة “Kami pernah bepergian bersama Rosululloh sholallohu ‘alaihi wasallam pada bulan Ramadhan ketika musim panas sekali,sampai salah seorang diantara kami meletakan tangannya di atas kepalanya karena panas yang sangat menyengat. Tidak ada yang berpuasa diantara kami kecuali Rosululloh sholallohu ‘alaihi wasallam dan Abdulloh bin Abi Rawahah”. Ketiga: Segolongan ulama syafi’I berpendapat bahwa puasa ketika dalam perjalanan adalah lebih utama daripada berbuka. Hal ini berdasarkan pada apa yang pernah dikerjakan oleh rosululloh sholallohu ‘alaihi wasallam sebagaimana disebutkan hadits di atas. Sedangkan sekelompok yang lain berpendapat bahwa berbuka lebih utama daripada berpuasa, sebagai bentuk realisasi dari rukhsoh yang Allah berikan. Berdasarkan hadits Nabi : عليكم برخصة الله التي رخص لكم “Hendaklah kalian mengambil keringan Allah yang Allah berikan untuk kalian” sekelompok ulama berpendapat bahwa antara saum dan berbuka sama saja. Berdasarkan sabda Nabi : إن شئت فصم ، وإن شئت فأفطر “Jika kamu mau berpuasa, maka berpuasalah. Dan jika kamu mau berbuka, maka berbukalah” Sekelompok ulama yang lain berpendapat bahwa jika sedang safar dan berpuasa membuat dirinya berat, maka dia harus berbuka. Berdasarkan sabda Nabi : ليس من البر الصيام في السفر “Bukanlah suatu kebaikan seseorang yang berpuasa disaat sedang safar (jika memberatkan)” Keempat : masalah Qodo, apakah harus berturut-turut dalam mengqodo saumnya atau boleh tidak berturut-turut?. Pendapat JUmhur para ulama dalam mengqodo puasa boleh dilakukan secara berturut-turut dan juga boleh tidak. Selanjutnya firman-Nya : وَلِتُكْمِلُوا الْعِدَّةَ وَلِتُكَبِّرُوا اللَّهَ عَلَى مَا هَدَاكُمْ “Dan hendaklah kamu mencukupkan bilangannya dan hendaklah kamu mengagungkan Allah atas petunjuk-Nya yang diberikan kepadamu” Maksudnya, perintah mengqodo puasa adalah bertujuan supaya menyempurnakan jumlah hari berpuasa menjadi satu bulan. Lalu kemudia diperintah untuk bertakbir setelah mengerjakan satu ibadah, termasuk setelah ibadah puasa. Oleh karenanya sebagian ulama menjadikan potongan ayat ini sebagai dalil disyariatkannya bertakbir pada hari raya ‘idul fitri. Kemudian Allah menutup ayat ini dengan firman-Nya : وَلَعَلَّكُمْ تَشْكُرُونَ “Supaya kamu bersyukur” Artinya, jika kalian mengerjakan apa yang diperintahkan Allah ta’ala, berupa ketaatan kepada-Nya,dengan menjalankan semua kewajiban dan meninggalkan semua larangan-Nya serta memperhatikan ketentua-Nya, maka mudah-mudahan kalian termasuk orang-orang yang bersyukur atas hal itu."
  }
]