[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kamu -wahai Nabi- ditanya oleh hamba-hamba Ku tentang Aku, katakanlah kepada mereka bahwa sesungguhnya Aku ini dekat dari mereka, Aku dapat mengabulkan permintaan orang-orang yang berdoa bila dia berdoa kepada Ku, maka hendaknya mereka taat kepada Ku dalam perkara yang Aku perintahkan kepada mereka dan apa yang Aku larang mereka melakukannya, dan agar mereka beriman kepada Ku. Semoga mereka mendapatkan petunjuk menuju kemaslahatan-kemaslahatan dari agama di dunia mereka. Dalam ayat ini terdapat pemberitahuan dari Allah subhanahu wata’ala tentang kedekatan Allah dengan hamba-hamba Nya, kedekatan yang sesuai dengan keagungan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "186. Apabila engkau -wahai Nabi- ditanya oleh hamba-hamba-Ku tentang kedekatan-Ku dan kesediaan-Ku mengabulkan doa mereka, maka sesungguhnya Aku ini dekat dengan mereka, mengetahui keadaan mereka, dan mendengar doa mereka. Jadi, mereka tidak membutuhkan perantara dan tidak perlu bersuara keras. Aku mengabulkan doa orang yang berdoa apabila dia berdoa kepada-Ku dengan tulus ikhlas di dalam doanya. Maka hendaklah mereka tunduk dan patuh kepada perintah-perintah-Ku serta mempertahankan iman mereka. Karena hal itu merupakan sarana yang paling ampuh bagi terkabulnya doa mereka. Mudah-mudahan dengan begitu mereka mau mengikuti jalan yang benar dalam semua urusan mereka, baik urusan agama maupun dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "186. Hai Rasulullah, jika hamba-hamba-Ku bertanya kepadamu tentang-Ku, maka jawablah ‘Sesungguhnya Aku dekat, Aku mendengar apa yang mereka minta dan mengabulkan permohonan; maka hendaklah mereka mentaati-Ku dan beriman kepada-Ku, agar mereka mendapat kebahagiaan dunia dan akhirat.’"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "186. وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ (Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka (jawablah), bahwasanya Aku adalah dekat) Datang seorang lelaki kepada Rasulullah dan berkata: Wahai Rasulullah apakah Rabb kita dekat sehingga kita berbisik kepada-Nya atau Dia jauh sehingga kita menyeru-Nya. Nabi pun diam dan tak menjawab. Maka turunlah ayat (أجيب دعوة الداع). Dan dalam hadist shahih Rasulullah bersabda: tidak ada seorang muslim pun berdo’a dengan do’a yang tidak terkandung didalamnya dosa atau pemutusan silaturrahim kecuali Allah akan mengabulkannya dengan satu diantara tiga pilihan; memberikan apa yang ia pinta, menyimpan do’a itu untuk di akhirat, atau menolak kejelekan yang setara dengan nilai do’anya. فَلْيَسْتَجِيبُوا۟ لِى (maka hendaklah mereka itu memenuhi (segala perintah-Ku) ) Yakni dengan senantiasa berdo’a kepada-Nya. وَلْيُؤْمِنُوا۟ بِى (dan hendaklah mereka beriman kepada-Ku) Yakni dengan beriman dan meyakini bahwa apabila mereka berdo’a maka akan dikabulkan. لَعَلَّهُمْ يَرْشُدُونَ (agar mereka selalu berada dalam kebenaran) Yakni agar mendapat petunjuk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Hasan al-Bashry berkaya : “Kunci kekayaan laut adalah kapal, dan kunci kekayaan bumi adalah jalan, sedangkan kunci kekayaan langit adalah doa”. 2 ). Kedekatan Allah yang disebutkan dalam al-QUr’an dan sunnah adalah kedekatan khusus kepada orang-orang yang beribadah kepada-Nya, dan kepada orang yang memohon dan berdoa kepada-Nya, dan itu merupakan buah ibadah dengan nama-Nya yang agung : { وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ }. 3 ). Perhatikanlah ayat ini : { وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ } hikmah dan makna yang indah yang tidak mungkin dihilangkan : - Ayat ini terletak di pertengahan ayat-ayat puasa, ayat ini mengajarkan akan pentingnya doa dan pengaruh yang ada padanya. - Amatilah kemuliaan ini yang Allah pakaikan kepadamu, yaitu ketika Dia menisbatkan hamba-Nya kepada diri-Nya yang Maha suci : { عِبَادِي } maka kebaikan apakah yang akan diraih oleh seorang hamba dari tuannya ? - Di dalam ayat ini terdapat beberapa kalimat yang mengandung makna yang agung, dan yang paling baik adalah kedekatan Allah kepadamu, maka apakah sesuatu yang paling agung yang kamu sangkakan selain dari kedekatan yang agung itu ? maka hendaklah kamu menyelam lebih dalam, niscaya kamu akan menemukan mutiara yang lebih banyak. 4 ). { وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ } , { فَاسْتَغْفِرُوهُ ثُمَّ تُوبُوا إِلَيْهِ ۚ إِنَّ رَبِّي قَرِيبٌ مُجِيبٌ } \"karena itu mohonlah ampunan-Nya, kemudian bertobatlah kepada-Nya, Sesungguhnya Tuhanku amat dekat (rahmat-Nya) lagi memperkenankan (doa hamba-Nya)\" [ Hud : 61 ], alangkah dekatnya Allah ! tidak satupun perantara yang membatasi antara kita dengan-Nya, tiada batas waktu yang akan menghalang, dan tidak pula antrian yang menunggu, serta lorong yang memotong. 5 ). Khalid bin al-rob'i pernah berkata : aku takjub dengan ummat ini ! Allah memerintahkan mereka untuk berdoa dan Dia pula yang menjanjikan ijabah, dan tiada diantara keduanya syarat. Kemudian beliau ditanya tentang hal ini? beliau berkata, ada perkara yang mengahruskan syarat, seperti firman Allah : { وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ } \"Dan sampaikanlah berita gembira kepada mereka yang beriman dan berbuat baik\" [al-Baqarah : 25] maka dalam hal ini ada syarat, yakni : kabar gembira itu bersyarat keimanan dan amalan shalih, kemudian firman Allah : { فَادْعُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ } \"Maka sembahlah Allah dengan memurnikan ibadat kepada-Nya, meskipun orang-orang kafir tidak menyukai(nya)\" [Gafir : 14] di ayat ini ada syarat, sedangkang firman Allah : { ادْعُونِي أَسْتَجِبْ لَكُمْ } \"Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagimu\" tidak ada syarat. 6 ). Sebagian salaf mengatakan : Kapan Allah membawa lisanmu untuk berdoa kepada-Nya, ketahuilah bahwasanya Dia berkehendak untuk mengabulkan permintaanmu; hal itu dikarenakan kebenaran janjinya dengan mengabulkan permintaan siapa yang berdoa kepada-Nya, bukankah Allah telah berfirman : { فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "186. Wahai rasul, jika hamba-hambaKu bertanya tentangKu kepadamu, maka katakanlah kepada mereka: “Sesungguhnya Allah itu sangat dekat dengan kalian, sehingga tidak ada penghalang antara Dia dengan kelian. Dia mengabulkan doanya orang-orang yang berdoa, maka selayaknya mereka menunaikan permintaanNya dengan ikhlas, mengerjakan perintahNya berupa keimanan dan amal shalih, dan mempercayai tentang kedekatan Allah dengan mereka, dan pengabulanNya atas doa-doa mereka, supaya mereka mendapat petunjuk kepada kebaikan dunia dan akhirat” Dan sebab turunnya ayat ini sebagaimana yang disebutkan oleh Ath-Thabari dari Muawiyah bin Haidah yang berkata: “Telah datang kepada Nabi SAW seorang Baduwi dan bertanya: “Apakah Tuhan kami itu dekat sehingga kami bisa berbisik kepadaNya ataukah jauh sehingga kami akan menyeruNya?” Nabi terdiam, kemudian turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila hamba-hambaKu bertanya kepadamu tentang Aku, sesungguhnya Aku dekat. Aku mengabulkan permohonan orang yang berdoa apabila dia berdoa kepadaKu. Maka hendaklah mereka memenuhi (perintah)Ku} hendaknya mereka tunduk kepadaKu dan mematuhiKu {dan beriman kepadaKu agar mereka selalu mendapat bimbingan} mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "186. Ayat ini adalah jawaban dari suatu pertanyaan. Beberapa sahabat nabi bertanya kepada beliau seraya berkata, “Wahai Rasulullah apakah rabb kami itu dekat hingga kami membersihkannya atau Dia jauh hingga kami menyeruNya?” kemudian turunlah ayat, “Dan apabila hamba-hambaKu bertanya kepadamu tentang Aku, maka jawablah bahwasanya Aku adalah dekat,” Karena sesungguhnya Allah Maha mengawasi, maha melihat dan mengetahui apa yang tersembunyi dan dirahasiakan, Dia mengetahui pandangan mata yang khianat dan apa yang disembunyikan oleh hati dan Dia sangat dekat dari orang yang berdoa kepadaNya dengan mengabulkannya. Oleh karena itu Dia berfirman, “Aku mengabulkan permohonan orang yang berdoa apabila dia memohon kepadaKu.” Berdoa itu ada dua macam, doa ibadah dan doa permohonan. Kedekatan dari Allah juga dua macam; kedekatan dengan ilmuNya dari setiap makhlukNya, dan kedekatan dari orang-orang yang beribadah kepadaNya dan orang yang berdoa kepadanya dengan mengabulkan doa, menolong, dan memberi Taufik. Barang siapa yang berdoa kepada rabbnya dengan hati yang hadir dan doa yang disyariatkan, lalu tidak ada suatu hal yang menghalanginya dari terkabulnya doa, seperti makanan haram dan sebagainya, maka sesungguhnya Allah telah menjadikan baginya doa yang terkabul, khususnya bila dia mengerjakan sebab sebab terkabulnya doa, yaitu kepasrahan kepada Allah dengan ketaatan kepada perintah perintahNya dan menjauhi larangan-laranganNya, baik dalam perkataan maupun perbuatan, beriman kepadaNya yang mengharuskan timbulnya penerimaan tersebut, oleh karena itu Allah berfirman, “Maka hendaklah mereka itu memenuhi (segala perintahKu) dan hendaklah mereka beriman kepadaKu, agar mereka selalu berada dalam kebenaran,” maksudnya, mereka akan mendapatkan jalan yang lurus yaitu Hidayah kepada keimanan dan amal shalih, hilang darinya kedholiman yang menghilangkan keimanan dan amal shalih, dan juga karena beriman kepada Allah dan memenuhi perintahNya merupakan sebab mendapatkan ilmu, sebagaimana Allah berfirman : \"Hai orang-orang beriman, jika kamu bertakwa kepada Allah, Kami akan memberikan kepadamu Furqaan. Dan kami akan jauhkan dirimu dari kesalahan-kesalahanmu, dan mengampuni (dosa-dosa)mu. Dan Allah mempunyai karunia yang besar\" QS al-anfal ayat 29"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلدَّاعِ } Ad-Da’iy : Orang yang meminta kebutuhan kepada Rabb Nya. { فَلۡيَسۡتَجِيبُواْ لِي } Falyastajiibu li : Yaitu menjawab seruan Allah tatkala Allah menyeru mereka untuk menaatiNya dan rasul Nya, dengan melakukan perintah dan meninggalkan larangan Nya, serta bertaqarrub kepada Allah dengan perbuatan baik dan meninggalkan hal yang membuat Nya murka. { يَرۡشُدُونَ } Yarsyudun : Mendapat petunjuk dengan kesempurnaan dua kekuatan, ilmu dan amalan. Makna rusyd adalah ilmu untuk mengetahui hal-hal yang dicintai oleh Allah dan hal-hal yang mendatangkan murka Nya. Serta melakukan apa yang dicintai oleh Allah dan meninggalkan apa yang dimurkai Nya. Barangsiapa yang tidak memiliki ilmu dan tidak beramal maka hakikatnya ia adalah orang yang bodoh, sesat, dan celaka. Makna ayat : Dikisahkan bahwa sekelompok sahabat nabi bertanya kepada nabi,”Apakah Rabb kami itu dekat sehingga kami bermunajat (berbisik-bisik) dalam meminta, ataukah jauh sehingga kami harus menyeruNya? Maka Allah ta’ala menurunkan ayat : “Apabila hamba-hambaKu bertanya kepadamu tentang Aku, maka jawablah bahwasanya Aku adalah dekat. Aku mengabulkan permohonan orang yang berdoa.” Makna munajat adalah berkomunikasi dengan suara yang lirih, sedangkan menyeru adalah berkomunikasi dengan suara keras. Dan jawaban Allah dan ajakan kepada hamba Nya adalah mengabulkan permintaannya dan memberikan apa yang diminta. Oleh karena itu, tidak lain yang harus dilakukan oleh hamba adalah menerima panggilan rabbnya dengan keimanan kepada Nya dan menaati Nya dalam melakukan perintah atau meninggalkan larangan. Dengan itu kebenaran mereka menjadi sempurna dan menjadi siap untuk mencapai kesempurnaan serta kebahagiaan di dunia maupun akhirat nanti. Pelajaran dari ayat : • Dekatnya Allah dengan hamba-hamba Nya, karena seluruh alam semesta berada dalam genggaman Nya dan di bawah kekuasaan Nya. Tidak ada hamba yang jauh dari Allah. Tidak ada satupun makhluk kecuali Allah melihatnya, mendengarnya dan berkuasa atasnya. Inilah hakikat kedekatan Allah. • Larangan untuk mengangkat suara ketika beribadah, kecuali dalam talbiyah, adzan, dan iqomah. • Kewajiban menjawab panggilan Allah ta’ala dengan keimanan dan amalan shaleh. • Kebenaran yang sesungguhnya ada dalam ketaatan kepada Allah, dan kesesatan serta kebodohan ada dalam kemaksiatan kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 186: Allah merintahkan nabiNya ﷺ jika ditanya oleh manusia apakah Allah dekat atau jauh? agar menjawab mereka bahwasannya Allah dekat dari hambanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalaalain disebutkan, bahwa sebagian manusia datang kepada Nabi shallallahu 'alaihi wa sallam bertanya, \"Apakah Tuhan kita dekat sehingga cukup berbisik-bisik dalam meminta ataukah jauh sehingga kita perlu memanggil-Nya?\", maka turunlah ayat ini. Ayat ini juga menerangkan adab dalam berdo'a, yakni agar tidak keras-keras, karena Dia Maha Mendengar lagi Maha Dekat. Ilmu-Nya meliputi mereka, Dia mendengar dan Mengetahui mereka dengan ketinggian Dzat-Nya di atas 'Arsyi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 186",
    "description": "Dan apabila hamba-hamba-ku bertanya kepadamu, nabi Muhammad, tentang aku karena rasa ingin tahu tentang segala sesuatu di sekitar kehidupannya, termasuk rasa ingin tahu tentang tuhan, maka jawablah bahwa sesungguhnya aku sangat dekat dengan manusia. Aku kabulkan permohonan orang yang berdoa dengan ikhlas apabila dia berdoa kepadaku dengan tidak menyekutukan-ku. Hendaklah mereka itu memenuhi perintah-ku yang ditetapkan di dalam Al-Qur'an dan diperinci oleh rasulullah, dan beriman kepada-ku dengan kukuh agar mereka memperoleh kebenaran atau bimbingan dari Allah. Dihalalkan bagimu pada malam hari bulan puasa untuk bercampur dengan istrimu. Semula hanya dihalalkan makan, minum, dan mencampuri istri hingga salat isya atau tidur. Setelah bangun tidur semuanya diharamkan. Umar bin khattab pernah mencampuri istrinya sesudah salat isya. Beliau sangat menyesal dan menyampaikannya kepada rasulullah, maka turunlah ayat ini yang memberikan keringanan. Mereka adalah pakaian bagimu yang melindungi kamu dari zina, dan kamu adalah pakaian bagi mereka yang melindungi mereka dari berbagai masalah sosial. Allah mengetahui bahwa kamu tidak dapat menahan dirimu sendiri untuk tidak berhubungan dengan istri pada malam bulan ramadan, tetapi dia menerima tobatmu dan memaafkan kamu karena kamu menyesal dan bertobat kepada-Nya. Maka sekarang campurilah mereka dan carilah apa yang telah ditetapkan Allah bagimu dengan mengharapkan keturunan yang baik. Makan dan minumlah dengan tidak berlebihan hingga jelas bagimu perbedaan antara benang putih dan benang hitam, yaitu fajar, untuk memulai puasa. Kemudian sempurnakanlah puasa sampai datang malam yang ditandai dengan terbenamnya matahari. Tetapi jangan kamu campuri mereka ketika kamu beriktikaf dalam masjid pada malam hari ramadan. Itulah ketentuan Allah, maka janganlah kamu mendekatinya, yakni istri ketika beriktikaf, apalagi berhubungan intim. Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, agar mereka bertakwa, menjaga dan mengendalikan diri dengan penuh kesadaran."
  }
]