[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memperbolehkan bagi kalian malam-malam bulan Ramadhan untuk menggauli istri-istri kalian. Mereka adalah penutup dan penjaga bagi kalian, dan kalian adalah penutup dan penjaga bagi mereka. Allah mengetahui bahwa kalian mengkhianati diri kalian sendiri dengan melanggar apa yang dilarang Allah atas kalian dengan menggauli istri-istri setelah waktu Isya pada malam-malam puasa (yang ditetapkan pada periode awal perkembangan Islam). Maka Allah menerima taubat kalian dan melonggarkan perkara tersebut bagi kalian. Sekarang, gaulilah istri-istri kalian dan carilah apa yang Allah takdirkan bagi kalian berupa anak-anak. Dan makan dan minumlah sampai tampak jelas bagi kalian cahaya pagi dari kegelapan malam dengan terbitnya Fajar shadiq. Kemudian sempurnakanlah puasa kalian dengan menahan diri dari segala pembatal puasa sampai masuknya malam hari dengan tanda terbenamnya matahari. Dan janganlah kalian mencampuri istri-istri kalian atau melakukan apa-apa yang dapat mengantarkan kepada perbuatan mencampuri mereka ketika Kalian sedang beri'tikaf di masjid-masjid, sebab itu akan merusak ibadah i'tikaf ( yaitu berdiam di dalam masjid selama waktu tertentu dengan niat mendekatkan diri kepada Allah ta’ala). Hukum-hukum yang Allah syariatkan bagi kalian itu merupakan batasan-batasannya yang menegaskan antara perkara halal dan haram, maka janganlah kalian mendekati nya Agar kalian tidak terjerumus ke dalam perkara haram. Dengan penjelasan yang terang seperti ini, Allah menjelaskan ayat-ayat Nya dan hukum-hukum Nya kepada manusia agar mereka bertakwa dan takut kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "187. Pada awalnya, orang yang tidur pada malam puasa (Ramadan) kemudian bangun sebelum fajar, dia dilarang makan atau mendekati istrinya. Kemudian larangan ini dihapus, dan Allah memperbolehkan bagi kalian -wahai orang-orang mukmin- menggauli istri-istri kalian pada malam-malam hari puasa (Ramadan). Istri-istri kalian adalah tabir dan penjaga kehormatan kalian, dan kalian adalah tabir dan penjaga kehormatan istri-istri kalian. Kalian saling membutuhkan. Allah mengetahui bahwa tadinya kalian sempat mengkhianati diri kalian sendiri dengan melakukan sesuatu yang dilarang, maka Allah menunjukkan belas-kasih-Nya kepada kalian, menerima taubat kalian dan meringankan beban kalian. Sekarang ini, gaulilah mereka dan mintalah keturunan yang telah Allah tetapkan bagi kalian, serta makan dan minumlah di sepanjang malam itu sampai kalian melihat terbitnya fajar sadik, yaitu dengan adanya warna putih fajar yang terpisah dari kegelapan malam. Kemudian sempurnakanlah puasa kalian dengan menahan diri dari hal-hal yang membatalkan puasa, mulai dari terbit fajar sampai terbenam matahari. Dan janganlah kalian menggauli istri-istri kalian ketika kalian sedang iktikaf di dalam masjid, karena itu akan membatalkan iktikaf kalian. Ketentuan-ketentuan hukum tersebut adalah batas-batas yang telah ditetapkan oleh Allah antara yang halal dan yang haram, maka jangan sekali-kali kalian mendekatinya, karena orang yang mendekati batas-batas yang telah ditetapkan oleh Allah sangat rentan jatuh ke dalam area yang haram. Dengan penjelasan yang jelas dan nyata seperti inilah Allah menerangkan ayat-ayat-Nya kepada manusia, agar mereka bertakwa kepada-Nya dengan cara menjalankan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "187. Hai orang-orang yang beriman, dihalalkan bagi kalian berjima’ dengan istri-istri kalian pada malam bulan Ramadhan. Mereka adalah ketenangan bagi kalian dan kalian adalah ketengangan bagi mereka. Allah mengetahui bahwa kalian mengingkari diri kalian dalam perihal keinginan berjima’ dengan mereka, ketika puasa dimulai saat bangun dari tidur setelah berbuka -yang kemudian hukum ini dihapus-, maka Allah mengampuni dan menerima taubat kalian dengan memberi keluasan bagi kalian. Setelah hukum ini dihapus, boleh bagi kalian berjima’ dengan mereka sampai batas terbitnya fajar. Mintalah keturunan yang Allah tekdirkan untuk kalian dengan berjima’ dengan istri-istri kalian. Dan dibolehkan pula bagi kalian makan dan minum sampai terbitnya fajar, yaitu ketika mulai tampak cahaya di ufuk dan mulai jelas perbedaannya dengan gelapnya malam; ketika itu mulailah berpuasa dan meninggalkan makan, minum, dan berjima’ sampai terbenamnya matahari. Dan diharamkan bagi kalian berjima’ jika kalian berada di dalam masjid-masjid untuk beri’tikaf. Demikianlah hukum-hukum Allah yang Dia tetapkan bagi kalian, maka janganlah kalian melanggarnya. Dengan penjelasan seperti inilah Allah menjelaskan hukum-hukum dalam agama-Nya kepada manusia agar mereka taat kepada-Nya dan tidak melanggar hukum-hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "187. أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَآئِكُمْ ۚ (Dihalalkan bagi kamu pada malam hari bulan puasa bercampur dengan isteri-isteri kamu) Yakni meliputi segala apa yang diinginkan seorang suami dari istrinya, baik itu jima’ maupun yang lainnya. هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ ۗ (mereka adalah pakaian bagimu, dan kamupun adalah pakaian bagi mereka) Karena menyatunya antara suami dan istri seperti menyatunya antara pakaian dan orang yang memakainya. Maka dari itulah Allah memberi rukhshoh dan keringanan kepada kalian. تَخْتَانُونَ أَنفُسَكُمْ (kalian khianati diri kalian) Yakni kalian khianati diri kalian yang ingin berjima’ dengan istri di malam-malam Ramadhan. Dan makna asli dari khianat adalah bahwa seseorang yang diberi amanah atas sesuatu namun ia tidak menjalankan amanah tersebut. Adapun penyebutan kata khianat pada ayat ini karena kemadharatan menahan hawa nafsu ini kembali kepada diri mereka. فَتَابَ عَلَيْكُمْ (karena itu Allah mengampuni kamu) Yakni menerima taubat kalian atas pengkhianatan terhadap diri kalian. وَعَفَا عَنكُمْ ۖ (dan memaklumimu) Yakni berupa kelonggaran dan kemudahan. وَابْتَغُوا۟ مَا كَتَبَ اللَّـهُ لَكُمْ ۚ (dan ikutilah apa yang telah ditetapkan Allah untukmu) Ada pendapat mengatakan yang dimaksud adalah anak. Dan pendapat lain mengatakan yang dimaksud adalah carilah malam lailatul qadr akan tetapi jangan tersibukkan dari istrimu yang telah Allah halalkan. الْخَيْطُ الْأَبْيَضُ (benang putih) Yakni cahaya fajar yang membentang di ufuk, dan bukan yang menyerupai ekor srigala yang merupakan fajar kadzib yang tidak menghalalkan apapun dan tidak mengharamkan apapun. مِنَ الْخَيْطِ الْأَسْوَدِ (dari benang hitam) Yakni kegelapan malam. Adapun makna (التبين) adalah terjadinya perbedaan antara (الْخَيْطُ الْأَبْيَضُ) dengan (الْخَيْطِ الْأَسْوَدِ) dan hal ini tidak terjadi kecuali saat telah masuknya waktu fajar. ثُمَّ أَتِمُّوا۟ الصِّيَامَ إِلَى الَّيْلِ ۚ (Kemudian sempurnakanlah puasa itu sampai (datang) malam) Yang diawali dengan terbenamnya matahari dengan sempurna. وَلَا تُبٰشِرُوهُنَّ وَأَنتُمْ عٰكِفُونَ فِى الْمَسٰجِدِ ۗ (janganlah kamu campuri mereka itu, sedang kamu beri’tikaf dalam mesjid) (المباشرة) yakni berjima’ dan masuk didalamnya ciuman dan rabaan apabila disertai dengan syahwat. Adapun orang yang beri’tikaf adalah orang yang melazimi masjid dan menahan hawa nafsunya dengan tujuan untuk beribadah. Dan hukum-hukum yang berkaitan dengan I’tikaf dijelaskan secara rinci dalam kitab-kitab fikih."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikan firman Allah : { هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُ } \"mereka adalah pakaian bagimu, dan kamupun adalah pakaian bagi mereka\", ayat ini mengajarkan adab dalam berucap, dua psang suami istri diibaratkan pakaian yang menggambarkan : sebagai penutup, perlindungan bagi tubuh, sebagai hiasan yang membuat penampilan menjadi indah, juga sebagai kedekatan. Dan gambaran itulah yang terdapat dalam dua pasang suami-istri, walaupun pengaruh yang digambarkan oleh ayat akan lebih kepada seorang istri, hali itu disiyaratkan oleh permulaan kalimat dengan kata ganti { هُنَّ } untuk perempun. 2 ). { هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُ } \"mereka adalah pakaian bagimu, dan kamupun adalah pakaian bagi mereka\" , { وَجَعَلْنَا اللَّيْلَ لِبَاسًا } \"dan Kami jadikan malam sebagai pakaian\" [an-Naba' ] , { قَدْ أَنْزَلْنَا عَلَيْكُمْ لِبَاسًا يُوَارِي سَوْآتِكُمْ وَرِيشًا } \"sesungguhnya Kami telah menurunkan kepadamu pakaian untuk menutup auratmu dan pakaian indah untuk perhiasan\" [al-A'raf : 26 ], perhatikanlah ayat-ayat ini, kamu akan mendapati keterkaitan makna satu sama lainnya diantaranya ( الستر ) yaitu pakaian sebagai penutup, dan tidaklah dua pasang suami-istri ketika salah seorang dari keduanya membicarakan 'aib lainnya dan tersingkaplah rahasia salah satu dari keduanya, melainkan dia akan berubah layaknya pakaian yang dibakar yang tidak layak untuk dipandang. 3 ). { هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُ } Adakah diantara manusia yang tidak butuh dengan pakaian ? dan bagaimana mungkin seseorang tidak berkehendak untuk menikah atau menangguhkannya dengan sebab yang tidak jelas ? Pakaian adalah penutup bagi tubuh, lalu kenapa sebagian orang menyingkirkan pasangan hidupnya yang telah diciptakan untuknya sebagai pelindung baginya ? Pakaian adalah lencana yang menjadikan diri seseorang berwibawa, akan tetapi kenapa kehidupan berkeluarga sesorang terkadang penuh dengan kekecawaan dan akhirnya menjadi sirna. Pakaian diantara perhiasan yang paling indah bagi seseorang, lalu kapan dua pasang suami-istri menjadi perhiasan salah satu dari keduanya untuk pasangannya ? pakaian adalah pelindung dan pemberi kehangatan bagi tubuh, maka apakah setiap dari kita sudah menjadi pelindung dan telah memberikan kehatan bagi pasangannya ? 4 ). { فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ } \"Maka sekarang campurilah mereka dan ikutilah apa yang telah ditetapkan Allah untukmu\" , yakni campurilah istri-istri kalian dengan maksud mendekatkan diri kepada Allah melalui amalan ini, dan raihlah keutamaan malam lailatulqadar, tetapi jaganlah kalian lebih menyibukkan diri dengan kenikmatan ini sehingga kalian melalaikan amalan yang lebih besar di malam lailatulqadr (dan itu merupakan ketetapan Allah untuk ummat ini), pada malam itu berbagai kebaikan yang ganjarannya sangat besar, maka merugilah orang-orang yang lalai darinya, kenikmatan yang menjadi hak pasangan suami-istri dapat ditunaikan di lain waktu, sedangkan malam lailatulqadr jika dilewatkan tidak akan diraih di lain waktu, dan tidak akan terganti oleh apapun dari amalan-amalan. 5 ). { فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ ۚ وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ } Pembolehan melakukan hubungan intim bagi suami-istri sampai masuk waktu subuh, adalah dalil dibolehkannya mengakhirkan mandi junub, dan puasa orang yang junub adalah sah. 6 ). { وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ } Pada ayat ini Allah membolehkan bagi hamba-Nya yang berpuasa untuk makan sampai masuk waktu fajar, adalah dalil bahwa sahur dianjurkan; bahkan beberapa hadits Nabi menerangkan dan menganjurkan untuk mengerjakannya. 7 ). { وَلَا تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ } Bukan maksud ayat melarangan untuk melakukan hubungan intim di masjid-masjid; bahkan diluar i'tikaf pun hal itu tidak diperbolehkan dilakukan di dalam masjid, melainkan ayat ini turun kepada kaum yang mereka keluar masjid padahal sedang i'tikaf menuju rumah-rumah mereka dengan hajat yang berbeda, dan tidak dapat dipungkiri bahwa salah seorang diantara mereka melakukan hubungan, oleh karena itu mereka dilarang melalui ayat ini; dan perhatikanlah bagaimana ayat ini memberikan faidah tentang dua hukum syari'at dengan kalimat yang singkat : menjadi syarat melaksanakan i'tikaf dimasjid, larangan melakukan hubungan intim ketika sedang beri'tikaf. 8 ). Bagi yang sedang i'tikaf diperbolehkan berpindah tempat sepanjang sisi masjid; berdasarkan makna umum dari ayat ini : { وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ }, adapun perkara keluar masjid hal ini oleh ulama dibahas dalam beberapa bagian : 1- Untuk urusan yang kontradiksi dengan pelaksanaan dan kesempurnaan i'tikaf seperti jimak dan jual beli, maka perkara ini membatalkan pelaksaan i'tikaf. 2- Untuk urusan pribadi yang biasa terjadi seperti buang air, mengambil makanan yang tidak didatangkan oleh siapapun, mandi, maka perkara yang seperti ini diperbolehkan. 3- Untuk keperluan yang yang hakikatnya tidak bertentangan dengan pelaksaan i'tikaf, tetapi tidak lazim untuk ditunaikan seperti menggiring jenazah, dan mengunjungi kerabat, maka perkara ini sebaiknya tidak dilakukan, tetapi sebagian ulama membolehkan dengan syarat-syarat yang mereka tentukan. 9 ). { تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا } \"Itulah larangan Allah, maka janganlah kamu mendekatinya\", Kemudian Allah mengatakan setelahnya (pada ayat 229) : { تِلْكَ حُدُودُ اللَّهِ فَلَا تَعْتَدُوهَا } \"Itulah hukum-hukum Allah, maka janganlah kamu melanggarnya\", hikmah daripada perbedaan dua ayat ini adalah : bahwasanya ayat pertama yang dikatakan didalamnya : { فَلَا تَقْرَبُوهَا } \"maka janganlah kamu mendekatinya\" ; adalah karena lafazh ini didahului oleh beberapa larangan, maka sesuai dengan konteksnya untuk tidak didekati, sedangkan ayat yang kedua telah datang sebelumnya beberapa perintah; maka konteks yang sesuai adalah larangan untuk melanggarnya dan melampauinya, yaitu dengan menjalankannya. 10 ). Hakikat iman adalah : { تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا }, sufyan bin 'uyainah mengatakan : \"tidaklah seorang hamba mendapati hakikat keimanan sampai ia menjadikan antara yang haram dan halal pembatas, dan sampai ia meninggalkan segala perbuatan dosa dan apa yang serupa dengannya\". 11 ). Tatkala Allah menyebutkan larangan-larangan pada ayat puasa dan i'tikaf, Allah kemudian menyebutkan setelahnya : { تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا }, dan lafazh { فَلَا تَقْرَبُوهَا } memiliki makna yang lebih dalam dibanding ( فلا تفعلوها ) \"maka janganlah kamu melakukannya\", karena sesungguhnya pendekatan diri mencakup didalamnya larangan melakukan suatu perkara yang diharamkan, dan larangan mengadakan wasilah untuk terwujudnya perkara itu. 12 ). { كَذَٰلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ } \"Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, supaya mereka bertakwa\" Sesungguhnya ilmu yang benar merupakan bagian daripada sebab ketaqwaan seorang hamba; karena jika jelas pada mereka suatu kebenaran maka semestinya kebenaran itu diikuti, dan jika kebathilan nampak dihadapan mereka maka hal itu ditinggalkan, dan barangsiapa yang mengetahui suatu kebenaran lantas ia meninggalkannya, lalu kebathilan yang ia ikuti, sesungguhnya itulah kejahatan dan dosa yang paling besar yang telah ia lakukan. 13 0. Ibadah-ibadah yang pernah dilakukan oleh Rasulullah semasa hidupnya pada bulan suci romadhan telah dicantumkan pada ayat-ayat dibawah ini : [al-baqarah : 183-187] : Sedekah { فِدْيَةٌ طَعَامُ مِسْكِينٍ }, tilawah qur'an { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ }, doa { فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ }, i'tikaf { وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ }, takbir pada hari raya 'ied{ وَلِتُكَبِّرُوا اللَّهَ عَلَىٰ مَا هَدَاكُمْ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "187. Telah diperbolehkan bagi kalian untuk menggauli istri-istri kalian dengan berjimak atau hal lainnya di malam puasa, bukan di siang harinya. Masing-masing suami istri adalah penutup satu sama lain dari keharaman karena keduanya bercampur satu sama lain seperti bercampurnya pakaian dengan orang yang mengenakannya. Oleh karena itu pemberian kemurahan dan kemudahan itu telah sempurna. Allah mengetahui bahwa kalian tidak bisa menahan diri untuk bergaul di malam puasa, manakala puasa itu diawali dengan tidurnya orang yang berpuasa setelah berbuka, Dia menerima taubat sebelum kalian melakukan taubat karena tidak mampu menahan hal tersebut dan memberi ampunan kepada kalian. Sekarang setelah adanya nasakh tentang hukum pengharaman berbuka setelah tidur, kalian diperbolehkan untuk menggauli istri kalian. Maka carilah sesuatu yang diperbolehkan oleh Allah berupa kenikmatan untuk menghasilkan keturunan atau anak. Kalian juga diperbolehkan untuk makan dan minum selama malam hari sampai terbitnya fajar shadiq dengan diawali oleh kemunculan cahaya siang dan hilangnya kegelapan malam. Dan itulah yang dimaksud dengan benang putih, yaitu cahaya fajar yang muncul di cakrawala yang tampak layaknya benang yang memanjang yang berdampingan dengan kegelapan malam. Fajar dan malam itu diserupakan dengan dua benang putih dan hitam karena panjangnya. Lalu sempurnakanlah puasa kalian sampai terbenamnya matahari. Dan menggauli istri kalian ketika menunaikan ibadah di masjid (yaitu I’tikaf) itu tidak diperbolehkan. Hukum-hukum tentang puasa dan I’tikaf yang disebutkan itu merupakan batasan yang ditentukan Allah, yaitu sesuatu yang dilarang, jadi janganlah kalian mendekatinya. Dengan penjelasan ini, Allah menerangkan hukum-hukum agamaNya kepada manusia, supaya mereka bertakwa kepada Tuhan dan menjauhi hal-hal yang haram. Imam Ahmad dan lainnya meriwayatkan dari Muadz bin Jabal yang berkata: “Para sahabat makan, minum, dan menggauli istri sebelum mereka tidur, dan jika mereka tidur, maka itu dilarang. Lalu Qais bin Sharmah dan Umar melanggar hal tersebut, lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dihalalkan bagi kalian pada malam puasa} diperbolehkan bagi kalian pada malam puasa {bercampur dengan istri-istri kalian} berjima’ dengan istri-istri kalian {Mereka adalah pakaian} tabir dari sesuatu yang haram {bagi kalian dan kalian adalah pakaian bagi mereka. Allah mengetahui bahwa kalian tidak dapat menahan diri kalian} kalian mengkhianati dan menzalimi diri kalian dengan berjima’ setelah waktu isya’. Sungguh (sebelumnya) telah diharamkan atas seseorang untuk makan, minum dan berjima’ ketika kewajiban berpuasa masih dilaksanakan malam hari sehingga dia tidur ketika berpuasa, kemudian hal tersebut dibatalkan {dan Dia menerima taubat kalian dan memaafkan kalian. Maka sekarang campurilah mereka} kumpulilah mereka {dan carilah apa yang telah ditetapkan Allah bagi kalian} dan carilah apa yang ditakdirkan oleh Allah kepada kalian berupa anak {Makan dan minumlah sampai jelas bagi kalian benang putih} putihnya siang {dan benang hitam} gelapnya malam {yaitu fajar. Kemudian sempurnakanlah puasa sampai malam. dan jangan campuri mereka ketika beriktikaf di masjid} berdiam diri di masjid dengan niat untuk mendekatkan diri kepada Allah {Itulah batas-batas (ketentuan) Allah. Maka janganlah kamu mendekatinya. Demikianlah Allah menerangkan ayat-ayatNya kepada manusia agar mereka bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "187. Pada awal-awal diwajibkannya puasa, kaum muslimin diharamkan makan, minum, dan jimak (menggauli istri) pada malam hari setelah tidur, lalu sebagian mereka merasa kesulitan dengan hal tersebut, maka Allah meringankan hal tersebut dengan membolehkan mereka pada malam hari Ramadhan semua perkara itu, dari makan, minum maupun berjimak, baik setelah tidur maupun sebelumnya, karena mereka tidak dapat menahan nafsu mereka dengan cara meninggalkan beberapa hal yang mereka diperintahkan kepadanya. “maka (Dia) mengampuni,” yakni Allah “kamu” Yakni dengan melapangkan perkara itu bagi kalian dan sekiranya bukan karena kelapangan itu, pastilah akan menimbulkan dosa, “dan memberikan maaf kepadamu,” terhadap apa yang telah berlalu dari perkara tidak mampu menahan nafsu tersebut. “Maka sekarang” setelah adanya keringanan dan kelapangan dari Allah ini, “campurilah mereka,” baik berjima, mencium, menyentuh, dan sebagainya, “dan carilah apa yang telah ditetapkan Allah untukmu,” maksudnya, berniatlah untuk mendekatkan diri kepada Allah ketika mencampuri istri istri kalian, dan maksud yang paling besar dari adanya jima tersebut adalah mendapatkan keturunan, menjaga kemaluannya dan kemaluan istrinya, dan juga memperoleh tujuan-tujuan nikah. Dan diantara apa yang telah ditentukan oleh Allah atas kalian adalah lailatul qadar yang bertepatan dengan malam malam bulan puasa Ramadhan, maka seharusnya kalian tidak disibukkan oleh kenikmatan tersebut dari malam yang mulia itu dan tidak menyia-nyiakan malam tersebut, karena kenikmatan itu masih dapat diperoleh (dengan tertunda) sedangkan lailatul qadar tidak diperoleh setiap waktu. “Dan makan dan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu Fajar.” Ini adalah batasan waktu bagi makan, minum, dan berjima. Ayat ini juga mengandung dalil bahwa apabila seseorang makan atau minum dengan perasaan ragu tentang terbitnya Fajar, maka tidak apa-apa baginya. Ayat ini juga merupakan dalil dianjurkannya sahur dengan adanya perintah dan dianjurkannya untuk diakhirkan dengan dasar yang diambil dari arti keringanan dari Allah dan kemudahan yang diberikan olehNya untuk hamba-hambaNya. Ayat ini juga sebagai dalil bolehnya meneruskan puasa ketika fajar telah datang sedang ia masih junub dari berbuat jima sedangkan ia belum mandi dan puasanya tetap sah, karena konsekuensinya bolehnya hingga terbitnya Fajar, maka ia akan mendapati Fajar dalam keadaan masih junub, dan konsekuensi kebenaran adalah benar. “Kemudian” apabila fajar telah terbit, maka “sempurnakanlah puasa itu,” yakni menahan diri dari hal-hal yang membatalkan, “hingga malam,” yakni terbenamnya matahari. Dan ketika bolehnya berjima pada malam-malam puasa bukanlah secara umum bagi setiap orang, di mana seorang yang beri’tikaf tidaklah halal baginya melakukan hal itu, dan telah dikecualikan dalam FirmanNya, “janganlah kamu campur yg mereka itu, sedang kamu beritikaf dalam masjid,” maksudnya, kalian sedang melakukan itikaf tersebut. Ayat ini menunjukkan bahwa itikaf itu disyariatkan, dan itikaf itu adalah berdiam di masjid dalam rangka ketaatan kepada Allah dan memusatkan perhatian hanya kepadaNya, dan bahwasanya itikaf itu tidak sah kecuali dalam masjid. Dapat dipahami dari arti masih disini adalah masjid yang dipahami oleh mereka, yaitu yang didirikan di dalamnya shalat lima waktu. Dan juga menunjukkan bahwa itu adalah diantara pembatal ibadah itikaf. Hal-hal yang telah disebutkan di atas seperti haramnya makan, minum, berjima, dan macamnya dari pembatal pembatal puasa, dan haramnya berbuka karena suatu perkara yang bukan alasan syar’i, haramnya berjima bagi orang yang melakukan itikaf dan semacamnya diantara hal-hal yang diharamkan, “itulah larangan Allah” yang telah Allah tetapkan bagi hamba-hambaNya dan Dia larang darinya. Kemudian Dia berfirman, “maka janganlah kamu mendekatinya.” Ungkapan ini lebih kuat daripada perkataan “maka janganlah kamu melakukannya”, karena kata mendekati itu meliputi larangan dari mengerjakan hal yang diharamkan itu sendiri dan larangan dari sarana-sarana yang menyampaikan kepada perbuatan tersebut. Seorang hamba diperintahkan untuk meninggalkan hal-hal yang diharamkan dan menjauh darinya sejauh mungkin yang ia mampu, dan juga meninggalkan segala sebab yang mengajak kepadanya. Adapun tentang perintah perintah, Allah berfirman kepadanya, “Itulah ketentuan-ketentuan Allah maka janganlah kamu melampaui batasnya,” Allah melarang atasnya dari bertindak melampaui batas padanya. “Demikianlah,” maksudnya, Allah menjelaskan kepada hamba-hambaNya berkenaan dengan hukum-hukum yang telah berlalu itu dengan pembalasan yang paling sempurna dan menerangkannya dengan keterangan yang paling jelas, “Allah menerangkan ayat-ayat-nya kepada manusia supaya mereka bertakwa.” Apabila kebenaran telah jelas bagi mereka, niscaya mereka akan mengikutinya, dan apabila kebatilan jelas bagi mereka, niscaya mereka akan menjauhinya. Manusia terkadang melakukan hal yang diharamkan karena ketidaktahuannya bahwa hal tersebut adalah haram, namun bila ia mengetahui keharamannya pasti tidak akan dilakukan. Apabila Allah telah menjelaskan ayat-ayatNya kepada manusia, maka tidak ada lagi alasan dan hujjah bagi mereka, dan hal itu agar menjadi faktor penyebab ketaqwaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { لَيۡلَةَ ٱلصِّيَامِ } Lailatash shiyaam : Malam hari dimana pada keesokan paginya seorang hamba berpuasa { ٱلرَّفَثُ } Ar-Rafats : Berhubungan badan { لِبَاسٞ لَّكُمۡ } Libasullakum : Ungkapan yang digunakan untuk menggambarkan percampuran antara satu dengan yang lain, seperti bercampurnya pakaian dengan badan. { تَخۡتَانُونَ أَنفُسَكُمۡ } Takhtaanuuna anfusakum : Dengan menghadapkan kalian kepada azab Allah, dan berkurangnya kesempatan memperoleh pahala karena digunakan untuk bersetubuh pada malam hari Ramadhan, sebelum Allah menjadikannya halal untuk kalian. { بَٰشِرُوهُنَّ } Tubasyiruhunna : Berhubungan badanlah dengan istri-istri kalian, karena Allah telah membolehkannya pada malam hari Ramadhan. { وَٱبۡتَغُواْ مَا كَتَبَ ٱللَّهُ لَكُمۡۚ } Wabtaghu maa kataballahu lakum : Carilah oleh kalian dalam hubungan itu untuk memperoleh keturunan, jika memang Allah telah menakdirkan untuk mendapatkan keturunan. Karena berhubungan badan tidak hanya untuk pelampiasan syahwat saja. { ٱلۡخَيۡطُ ٱلۡأَبۡيَضُ } Al-Khoithul Abyadh : Fajar kadzib (bohong), yaitu warna putih yang menjulang ke atas di ufuk bagaikan ekor serigala. { ٱلۡخَيۡطِ ٱلۡأَسۡوَدِ } Al-Khoithul aswad : Warna gelap yang datang setelah warna putih yang pertama sehingga menghapusnya secara sempurna. { ٱلۡفَجۡرِۖ } Al-Fajr : Tersebarnya cahaya secara horizontal yang menghapus kegelapan dan cahayanya memenuhi penjuru ufuk. { عَٰكِفُونَ فِي ٱلۡمَسَٰجِدِۗ } ‘Aakifuna fil masajid : Melepaskan semua ikatan duniawi untuk fokus beribadah di masjid, mendekatkan diri kepada Allah Ta’ala. { حُدُودُ ٱللَّهِ } Hududullah : Hudud merupakan bentuk jamak dari hadd yang berarti apa yang disyariatkan oleh allah ta’ala berupa ketaatan untuk melaksanakan perintah atau meninggalkan larangan. { كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ ءَايَٰتِهِۦ } Kadzalika yubayyinullahu ayaatihi : Begitulah sebagaimana mana Allah menjelaskan hukum-hukum berkaitan dengan puasa, Allah juga menjelaskan segala ibadah yang berupa perintah atau larangan, untuk menyiapkan hambaNya agar bertakwa. Yang mana takwa merupakan sebab yang mengantarkan masuk ke dalam surga. Makna ayat : Pada awal mula kewajiban berpuasa dimulai dari malam hari ketika seseorang tidur pada malam hari, ia tidak makan, tidak minum, dan tidak menggauli istrinya sampai malam hari berikutnya. Puasa dimulai dari malam hari ketika seseorang tidur, bukan ketika terbit fajar. Kemudian ada beberapa orang yang menggauli istri-istrinya pada malam hari. Lantas mereka mengabarkannya kepada Rasulullah ﷺ , maka Allah menurunkan ayat mulia ini, yang memperbolehkan bagi mereka untuk makan, minum, dan berhubungan badan sepanjang malam sampai terbitnya fajar. Allah Ta’ala berfirman,”Dihalalkan bagi kamu pada malam hari bulan puasa bercampur dengan istri-istri kamu.” Maknanya berhubungan dengan istri-istrinya, karena seorang suami membutuhkan istrinya, begitu juga istri membutuhkan suaminya. Firman Allah,”Mereka itu adalah pakaian bagimu, dan kamu pun adalah pakaian bagi mereka.” Seorang suami menutupi istrinya begitupun istri menutupi suaminya, layaknya pakaian yang menutupi tubuh. Kemudian Allah mengabarkan bahwa Dia mengetahui bahwa sebagian mereka menggauli istrinya setelah tidur, sebelum turunnya hukum Allah yang membolehkan atau melarang. Maka itu sebetulnya terhitung perbuatan khianat terhadap diri sendiri, maka Allah berfirman,”Allah mengetahui bahwasanya kamu tidak dapat menahan nafsumu, karena itu Allah mengampuni kamu dan memberi maaf kepadamu.” Kemudian Allah Ta’ala mengabarkan tentang bolehnya menggauli istri di malam hari pada firman Nya,”Maka sekarang, campurilah mereka dan carilah apa yang telah ditetapkan Allah untukmu.” Maksudnya adalah mencari keturunan, karena berhubungan badan bukan semata untuk memenuhi kebutuhan syahwat, akan tetapi agar istri hamil dan memiliki keturunan. Selanjutnya Allah memberikan batasan waktu untuk mereka berpuasa, yaitu pada siang hari dimulai dari terbitnya fajar sampai tenggelamnya matahari. Allah ta’ala berfirman,”Makan dan minumlah hingga terang bagimu benang putih dari benang hitam yaitu fajar. Kemudian sempurnakanlah puasa itu sampai (datang) malam.” Allah Ta’ala mengharamkan bagi orang yang beri’tikaf di masjid untuk menggauli istrinya. Tidak halal bagi seorang lelaki yang sedang i’tikaf untuk keluar dari masjid dan mendatangi istrinya untuk berhubungan badan. Apabila dilakukan maka ia berdosa dan batal i’tikafnya, wajib baginya untuk menqadha’nya. Firman Allah,”(tetapi) janganlah kamu campuri mereka iut, sedang kamu beri’tikaf dalam masjid.” Lantas Allah ta’ala mengumumkan bahwa apa yang Dia jelaskan berupa kewajiban-kewajiban dan larangan-larangan, merupakan batas-batas hukum Allah ta’ala. Maka tidak boleh mendekatinya atau melanggar melampaui batas-batas itu. Firman Allah,”Itulah larangan Allah, maka janganlah kamu mendekatinya.” Kemudian Allah Ta’ala berfirman,”Demikianlah Allah menerangkan ayat-ayat Nya kepada manusia, supaya mereka bertakwa.” Allah menganugerahkan kepada kaum muslimin nikmat berupa penjelasan syariat, hukum, serta batas-batas yang diwahyukan kepada Rasul Nya berupa Al-Qur’an dan sunnah, agar seorang mukmin menjadi bertakwa. Karena tidak mungkin seorang akan bertakwa apabila syariat tidak diikuti dan batasan-batasan dilanggar. Dan Allah Ta’ala telah melakukan itu, maka untuk Nya pujian dan keutamaan. Pelajaran dari ayat : • Bolehnya makan, minum, dan berhubungan badan pada malam hari bulan puasa, dari tenggelamnya matahari sampai terbitnya fajar. • Penjelasan mengenai batasan waktu berpuasa, yaitu sejak terbitnya fajar shadiq sampai tenggelamnya matahari. • Penjelasan mengenai larangan yang tidak boleh dilakukan oleh orang yang berpuasa, yaitu makan, minum, dan berhubungan badan. • Anjuran untuk beri’tikaf terutama di bulan Ramadhan, dan bagi orang yang i’tikaf tidak diperkenankan untuk menggauli istrinya sedangkan ia sedang beri’tikaf, sampai waktu selesai yang ia niatkan untuk i’tikafnya. • Penggunaan kiasan sebagai ganti ungkapan terus terang pada kata yang malu untuk disebutkan. Dimana Allah menggunakan kata mubasyarah (menggauli) untuk mengganti al-Wath’u (menyetubuhi). • Haramnya melanggar batasan-batasan syariat dan melampaui batas terhadap ketentuan syariat. • Penjelasan mengenai tujuan diturunkannya syariat serta diletakkannya larangan, agar menjadi orang yang bertakwa kepada Allah Ta’ala. • Telah ditetapkan dalam sunnah Rasulullah : Sunahnya makan sahur dan mengakhirkannya selama tidak khawatir masuknya waktu subuh, serta kesunahan untuk menyegerakan berbuka tatkala masuk waktunya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 187: Allah mengabarkan bahwasannya manusia diperbolehkan berjima’ dengan istrinya dimalam hari dibulan ramadhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Al Barra', ia berkata, \"Para sahabat Nabi Muhammad shallallahu 'alaihi wa sallam, ketika berpuasa, kemudian tiba waktu berbuka, lalu seseorang tidur sebelum berbuka, maka ia tidak makan di malam harinya dan di siang harinya sampai sore hari. Pernah suatu ketika Qais bin Sharmah Al Anshariy berpuasa, saat tiba waktu berbuka, ia mendatangi istrinya dan berkata kepadanya, \"Apakah kamu memiliki makanan?\" Istrinya menjawab, \"Tidak. Akan tetapi, saya akan pergi mencarikan untukmu.\" Di siang harinya, Qais bekerja sehingga membuatnya cepat mengantuk di malam hari, lalu istrinya berkata, \"Rugi sekali kamu!\". Ketika di siang hari, Qais pun pingsan, lalu diberitahukan masalah tersebut kepada Nabi shallallahu 'alaihi wa sallam, maka turunlah ayat ini, \"Uhilla lakum lailatash shiyaamur rafatsu ilaa nisaa'ikum\", maka para sahabat bergembira sekali. Demikian pula ayat, \"Wa kuluu wasy rabuu hattaa yatabayyana lakumul khaithul abyadhu minal khaithil aswad\"…dst. Imam Bukhari menyebukan kembali dalam Kitabut tafsir dengan adanya perubahan pada sebagian sanad, dan di sana disebutkan secara tegas bahwa Abu Ishaq mendengar secara langsung, lafaznya adalah: Ketika diwajibkan puasa Ramadhan, para sahabat tidak mendekati istri selama bulan Ramadhan penuh, namun ada beberapa orang yang mengkhianati dirinya, maka Allah menurunkan ayat, \"Alimallahu annakum kuntum takhtaanuuna anfusakum fataaba 'alaikum.\" Zhahir kedua hadits di atas nampak berbeda, akan tetapi tidak ada salahnya jika ayat tersebut turun berkenaan orang ini dan itu. Ayat ini turun untuk menaskh (menghapus) larangan berjima', makan dan minum setelah 'Isya atau setelah tidur di awal-awal Islam. Kata-kata ini merupakan kinayah yang menerangkan bahwa masing-masing saling membutuhkan. Yakni niatkanlah dalam berjima' itu untuk bertaqarrub kepada Allah Subhaanahu wa Ta'aala serta memperoleh tujuan dari jima', yaitu memperoleh keturunan, menjaga farjinya, menjaga farji istri dan memperoleh maksud daripada nikah. Termasuk \"mencari apa yang ditetapkan Allah untuk kita\" adalah mencari Lailatul qadr yang bertepatan dengan malam hari bulan Ramadhan. Oleh karena itu, tidak sepatutnya kita tetap bersenang-senang dengan istri dan membiarkan Lailatul qadr lewat begitu saja. Bersenang-senang masih bisa dikejar, adapun Lailatul qadr jika sudah lewat, tidak bisa dikejar. Imam Bukhari meriwayatkan dari Sahl bin Sa'ad ia berkata, \"Telah turun ayat, \"Wa kuluu wasy rabuu hattaa yatabayyana lakumul khaithul abyadhu minal khaithil aswad\" (artinya: Makan dan minumlah hingga jelas bagimu benang putih dari benang hitam), namun belum turun kata-kata, \"Minal fajr\" (yaitu fajar). Oleh karena itu, ada beberapa orang sahabat, ketika ingin berpuasa, salah seorang di antara mereka mengikat benang putih dan benang hitam di kakinya. Ia senantiasa makan sampai ia jelas melihat kedua benang itu, maka Allah menurunkan ayat, \"Minal fajr\", maka mereka pun mengetahui bahwa maksudnya adalah malam dan siang. Ayat ini menerangkan waktu makan, minum dan berjima', yaitu sampai terbit fajar shadiq. Ayat ini juga menunjukkan bahwa apabila seseorang makan atau minum dalam keadaan ragu-ragu apakah sudah terbit fajar atau belum, maka tidak mengapa. Demikian juga menerangkan beberapa hal berikut: - Anjuran makan sahur dan anjuran menta'khirkannya; diambil dari rukhshah dan kemudahan yang diberikan Allah Subhaanahu wa Ta'aala. - Bolehnya seseorang mendapatkan waktu fajar dalam keadaan junub dari jima' yang dilakukan sedangkan ia belum mandi, dan puasanya sah. Hal ini, karena sesuatu yang lazim dari bolehnya jima' sampai terbit fajar adalah mendapatkan waktu fajar dalam keadaan baru selesai jima' (masih junub), dan lazim dari yang hak (benar) adalah hak (benar) pula. Dimulai dari tenggelamnya matahari. I'tikaf ialah berada dalam mesjid dengan niat mendekatkan diri kepada Allah. Ayat ini menerangkan larangan bagi orang yang beri'tikaf ketika keluar karena suatu keperluan, lalu ia menggauli istrinya, dan menunjukkan bahwa I'tikaf menjadi batal karena jima'. Ayat ini menunjukkan disyari'atkannya I'tikaf, dan bahwa I'tikaf hanya sah di masjid, yakni masjid yang mereka kenal, yaitu masjid yang dipakai shalat lima waktu. Kata-kata \"jangan mendekati\" lebih dalam daripada sekedar \"jangan melakukan\". Karena jangan mendekati mencakup larangan mengerjakan perbuatan yang dilarang tersebut, demikian juga segala wasilah (sarana) yang mengarah kepadanya. Karena biasanya orang-orang melakukan perbuatan maksiat, karena tidak mengetahui bahwa hal itu merupakan maksiat, maka Allah Subhaanahu wa Ta'aala di ayat tersebut menerangkan hukum-hukum-Nya agar mereka dapat menjauhinya. Dengan demikian, tidak ada lagi 'udzur dan alasan untuk mengerjakan larangan tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 187",
    "description": "Dihalalkan bagimu pada malam hari bulan puasa untuk bercampur dengan istrimu. Semula hanya dihalalkan makan, minum, dan mencampuri istri hingga salat isya atau tidur. Setelah bangun tidur semuanya diharamkan. Umar bin khattab pernah mencampuri istrinya sesudah salat isya. Beliau sangat menyesal dan menyampaikannya kepada rasulullah, maka turunlah ayat ini yang memberikan keringanan. Mereka adalah pakaian bagimu yang melindungi kamu dari zina, dan kamu adalah pakaian bagi mereka yang melindungi mereka dari berbagai masalah sosial. Allah mengetahui bahwa kamu tidak dapat menahan dirimu sendiri untuk tidak berhubungan dengan istri pada malam bulan ramadan, tetapi dia menerima tobatmu dan memaafkan kamu karena kamu menyesal dan bertobat kepada-Nya. Maka sekarang campurilah mereka dan carilah apa yang telah ditetapkan Allah bagimu dengan mengharapkan keturunan yang baik. Makan dan minumlah dengan tidak berlebihan hingga jelas bagimu perbedaan antara benang putih dan benang hitam, yaitu fajar, untuk memulai puasa. Kemudian sempurnakanlah puasa sampai datang malam yang ditandai dengan terbenamnya matahari. Tetapi jangan kamu campuri mereka ketika kamu beriktikaf dalam masjid pada malam hari ramadan. Itulah ketentuan Allah, maka janganlah kamu mendekatinya, yakni istri ketika beriktikaf, apalagi berhubungan intim. Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, agar mereka bertakwa, menjaga dan mengendalikan diri dengan penuh kesadaran. Dan janganlah kamu makan harta di antara kamu dengan jalan yang batil seperti dengan cara korupsi, menipu, ataupun merampok, dan jangan pula kamu menyuap dengan harta itu kepada para hakim untuk bisa melegalkan perbuatan jahat kamu dengan maksud agar kamu dapat memakan, menggunakan, memiliki, dan menguasai sebagian harta orang lain itu dengan jalan dosa karena melanggar ketentuan Allah, padahal kamu mengetahui bahwa perbuatan itu diharamkan Allah."
  }
]