[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai nabi, sahabat-sahabatmu bertanya kepadamu tentang Hilal dan perubahan bentuknya. katakanlah kepada mereka,\" Allah menjadikan hilal sebagai tanda-tanda bagi manusia untuk mengetahui waktu-waktu ibadah mereka yang telah ditentukan, waktu puasa dan haji serta batas tempo transaksi-transaksi mereka. Bukan termasuk kebajikan, kebiasaan yang kalian lakukan di masa jahiliyah dan permulaan Islam dengan masuk rumah-rumah melalui bagian belakangnya jika kalian memulai ihram untuk Haji atau umrah, lantaran mengira bahwa perbuatan itu adalah bentuk pendekatan diri kepada Allah. Akan tetapi, kebajikan yang sebenarnya adalah perbuatan orang yang bertakwa kepada Allah dan menjauhi maksiat maksiat. dan masukilah rumah-rumah melalui pintu-pintunya ketika kalian berihram untuk Haji atau umrah, dan takutlah kepada Allah dalam seluruh urusan kalian, supaya kalian beruntung menggapai semua yang kalian sukai dari kebaikan di dunia dan akhirat.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "189. Mereka bertanya kepadamu -wahai Rasul- tentang penciptaan bulan sabit dan perubahan keadaannya. Katakanlah untuk menjawab pertanyaan mereka tentang hikmah di balik penciptaan dan perubahan keadaan hilal, “Sesungguhnya hilal itu adalah penunjuk waktu bagi manusia untuk mengetahui waktu-waktu ibadah mereka, seperti bulan-bulan haji, bulan puasa dan sempurnanya masa setahun dalam masalah zakat. Mereka juga bisa mengetahui waktu-waktu kegiatan muamalat, seperti penetapan waktu jatuh tempo pembayaran diat dan utang. Kebajikan dan kebaikan itu bukanlah dengan mendatangi rumah dari belakang ketika kalian sedang berihram haji atau umrah, seperti yang kalian yakini di masa jahiliyah, akan tetapi kebajikan yang sejati ialah kebajikan yang dilakukan oleh orang yang bertakwa kepada Allah secara lahir dan batin. Memasuki rumah melalui pintu-pintunya lebih mudah bagi kalian dan lebih jauh dari kesulitan. Sebab, Allah tidak pernah membebani kalian dengan sesuatu yang sulit dan berat. Dan buatlah tabir penghalang antara diri kalian dan neraka dengan cara melakukan amal saleh, agar kalian berhasil mendapatkan apa yang kalian inginkan dan selamat dari apa yang kalian takutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "189. Allah menjelaskan dalam ayat ini faidah dan hikmah dari perbedaan bentuk hilal setiap bulannya. Disebutkan bahwa para sahabat bertanya kepada Rasulullah tentang hal itu, Maka Allah menjawab bahwa itu adalah tanda-tanda yang dapat digunakan manusia untuk mengetahui waktu-waktu ibadah mereka yang dikerjakan sesuai waktu tertentu seperti puasa, haji, zakat, dan banyak kegunaan lainnya. Dan perbuatan baik bukanlah dengan meniru adat jahiliyah, seperti masuk rumah dari atapnya ketika kalian melaksanakan ihram haji dan umrah; namun perbuatan baik adalah dengan bertakwa kepada Allah, dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Masuklah ke dalam rumah-rumah kalian dari pintunya, dan takutlah kepada Allah dengan menjalankan hukum-hukum-Nya agar kalian meraih kebahagiaan dunia dan akhirat. Syeikh as-Syinqithi berkata: “dalam firman Allah {ولكن البر من اتقى} belum dijelaskan maksud dari kalimat {من اتقى} namun Allah menjelaskannya dalam firman-Nya: لَّيْسَ الْبِرَّ أَن تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَٰكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَالْمَلَائِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَىٰ حُبِّهِ ذَوِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُوا ۖ وَالصَّابِرِينَ فِي الْبَأْسَاءِ وَالضَّرَّاءِ وَحِينَ الْبَأْسِ ۗ أُولَٰئِكَ الَّذِينَ صَدَقُوا ۖ وَأُولَٰئِكَ هُمُ الْمُتَّقُونَ Bukanlah menghadapkan wajahmu ke arah timur dan barat itu suatu kebajikan, akan tetapi sesungguhnya kebajikan itu ialah beriman kepada Allah, hari kemudian, malaikat-malaikat, kitab-kitab, nabi-nabi dan memberikan harta yang dicintainya kepada kerabatnya, anak-anak yatim, orang-orang miskin, musafir (yang memerlukan pertolongan) dan orang-orang yang meminta-minta; dan (memerdekakan) hamba sahaya, mendirikan shalat, dan menunaikan zakat; dan orang-orang yang menepati janjinya apabila ia berjanji, dan orang-orang yang sabar dalam kesempitan, penderitaan dan dalam peperangan. Mereka itulah orang-orang yang benar (imannya); dan mereka itulah orang-orang yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "189. يَسْـَٔلُونَكَ عَنِ الْأَهِلَّةِ ۖ (Mereka bertanya kepadamu tentang bulan sabit) Ayat ini diturunkanuntuk Mu’adz bin Jabal dan Tsa’labah bin ‘Utsmah, keduanya berasal dari kaum Anshar. Mereka bertanya kepada Rasulullah: Kenapa bulan sabit muncul dan terlihat tipis seperti benang kemudian bertambah dan membesar sampai menjadi sempurna, lalu kembali mengecil dan mengecil sampai kembali seperti semula; mengapa ia tidak dalam satu bentuk? Maka turunlah ayat: قُلْ هِىَ مَوٰقِيتُ لِلنَّاسِ Bulan sabit itu adalah tanda-tanda waktu bagi manusia Yakni untuk menentukan waktu hutang-hutang mereka jatuh tempo, puasa dan berbuka mereka, masa ‘iddah bagi istri-istri mereka, untuk menyempurnakan syarat-syarat yang membutuhkan batas waktu, dan untuk menentukan waktu manasik haji mereka. وَلَيْسَ الْبِرُّ بِأَن تَأْتُوا۟ الْبُيُوتَ مِن ظُهُورِهَا (Dan bukanlah kebajikan memasuki rumah-rumah dari belakangnya) Diriwayatkan bahwa dahulu orang-orang Anshar apabila selesai melaksanakan haji tidak memasuki rumah mereka lewat pintu. Dan apabila mereka pulang ke rumah mereka setalah berihram namun belum menyelesaikan haji, mereka menaiki atap rumah-rumah mereka karena berkeyakinan bahwa orang yang berihram tidak boleh memberi pembatas antara mereka dan langit. وَلٰكِنَّ الْبِرَّ مَنِ اتَّقَىٰ ۗ (akan tetapi kebajikan itu ialah bagi orang yang bertakwa) Yakni akan tetapi kebajikan merupakan kebajikan yang dilakukan oleh orang yang bertakwa. Kaum Quraisy disebut juga dengan ‘al-Hums’. Dahulu mereka memasuki rumah lewat pintu ketika dalam keadaan ihram, adapun kaum Anshar dan kaum Arab lainnya tidak memasuki lewat pintu. Suatu hari Rasulullah berada dalam sebuah kebun kemudian keluar melewati pintu, dan ternyata keluar barsamanya seorang lelaki yang lalu berkata: aku melihatmu melakukan itu maka aku pun mengikutimu. Maka Rasulullah menjawab: sesungguhnya aku adalah lelaki ‘Ahmasy’ (dari kaum al-Hums). Lelaki itu berkata: kalau begitu agamaku adalah agamamu. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Qotadah berkata : sekumpulan kaum bertanya kepada Rasulullah : untuk apa diciptakan bulan sabit ? Maka turunlah ayat ini menjelaskan bahwa bulan sabit ini diciptakan untuk memudahkan bagi orang yang berpuasa, dan orang-orang yang melakukan manasik haji, serta kebutuhan agama ini dalam berbagai hal. Dan Allah lebih mengatahui apa yang terbaik bagi hamba-hamba Nya. 2 ). Pada lafazh : { لِلنَّاسِ } isyarat bahwa ru'yah merupakan waktu penentu bagi seluruh ummat manusia, karena ru'yah yang berlaku pada zaman Nabi maka itu juga berlaku untuk zaman setelahnya. 3 ). Apakah orang-orang yang berusaha mengikat kaumnya dengan selain bulan-bulan dan tanggal hijriyah mereka menyadari bahwasanya mereka melanggar ketetapan tuhan yang abadi, dan mereka juga melanggar perkara-perkara yang diharamkan oleh Allah dengan mengihlangkan bulan-bulan haram, atau dengan menutupi waktu-waktunya karena keunggulan tanggal masehi, sehingga mereka melakukan hal-hal yang diharamkan oleh Allah ? perhatikan ayat ini : { سْأَلُونَكَ عَنِ الْأَهِلَّةِ ۖ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ } \"Mereka bertanya kepadamu tentang bulan sabit. Katakanlah: \"Bulan sabit itu adalah tanda-tanda waktu bagi manusia dan (bagi ibadat) haji\" , { إِنَّ عِدَّةَ الشُّهُورِ عِنْدَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ } \"Sesungguhnya bilangan bulan pada sisi Allah adalah dua belas bulan, dalam ketetapan Allah di waktu Dia menciptakan langit dan bumi, di antaranya empat bulan haram\" [ at-Taubah : 36 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "189. Wahai nabi, mereka bertanya kepadamu tentang hilal di setiap bulannya yang bertambah dan berkurang. Maka katakanlah kepada mereka: “Itulah batas akhir bagi manusia terkait amalan agama dan dunia. Dengan hilal itu, mereka membatasi waktu panen dan pekerjaan mereka, juga urusan agama mereka terkait waktu puasa, waktu membatalkan puasa, masa iddah wanita, dan ibadah haji. Dan bukanlah sesuatu yang baik jika mendatangi rumah-rumahnya lewat belakang dimana bangsa Arab di masa Jahiliyyah ketika usai berziarah, tidak masuk melalui pintu-pintu rumahnya, melainkan lewat belakang. Dan kebaikan itu adalah bertakwa kepada Allah dengan menunaikan perintah-perintahNya dan menjauhi hal-hal yang diharamkan olehNya. Dan diperbolehkan bagi kalian untuk memasuki rumah melalui pintu-pintunya dimanapun letaknya, dan beribadahlah kepada Allah dengan sebenar-benar ibadah, supaya kalian mendapatkan ridhaNya”. Ayat {Yas’alunaka} turun untuk Muadz bin Jabal dan Tsal’abah bin Ghanam yang merupakan kaum Anshar yang bertanya tentang perubahan hilal yang terkadang kecil dan besar. Dan ayat {laisal birru} untuk laki-laki yang melanggar sesuatu yang dilakukan kaum Anshar pada zaman Jahiliyyah setelah berpergian yang memasuki rumah lewat belakang, lalu seakan dia dihina karena hal tersebut, lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang bulan sabit. tentang struktur bulan sabit dan pergantian bentuknya {Katakanlah,“Itu adalah (penunjuk) waktu} penanda waktu-waktu beribadah dan bermuamalah {bagi manusia dan ibadah haji.” Bukanlah suatu kebajikan memasuki rumah dari belakangnya, tetapi kebajikan itu adalah (kebajikan) orang yang bertakwa. Masukilah rumah-rumah dari pintu-pintunya, dan bertakwalah kepada Allah agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "189. Firman Allah, “Mereka bertanya kepadamu tentang bulan sabit.” Kata Al-ahillah adalah bentuk jamak dari kata Hilaalun. Maksudnya, mereka bertanya tentang aqidah dan hikmah atau dzat bulan sabit tersebut. “Katakanlah bulan sabit itu adalah tanda-tanda waktu bagi manusia,” maksudnya, Allah dengan kelembutan dan rahmatNya menjadikannya dengan pengaturan ini, sabit itu terlihat kecil pada awal bulan, lalu bertambah besar menjadi sempurna di pertengahannya, kemudian mulai berkurang dari kesempurnaannya, dan seperti itulah hingga manusia mengetahui tanda-tanda waktu ibadah-ibadah mereka, seperti puasa, waktu zakat, denda (kafarat) dan masa-masa haji. Dan ketika haji itu jatuh pada bulan-bulan yang telah ditentukan, serta menghabiskan waktu yang sangat banyak, Allah berfirman, “Dan bagi ibadah haji.” Demikian pula, dengan hal tersebut diketahui lah tempo-tempo dari hutang-hutang yang ditangguhkan, masa penyewaan, masa bilangan, dan masa kehamilan, dan lain sebagainya dari hal-hal yang merupakan kebutuhan makhluk, lalu Allah menjadikannya sebagai hitungan yang diketahui oleh setiap orang, baik anak kecil maupun orang dewasa, orang pintar maupun orang bodoh. Seandainya saja perhitungan itu dengan tahun matahari, maka hanya sedikit manusia yang mengetahuinya. “Dan Bukankah kebajikan itu memasuki rumah rumah dari belakangnya.” Ini sebagaimana kebiasaan kaum Anshar dan selain mereka dari orang-orang Arab apabila berihram, mereka tidak memasuki rumah dari pintu pintunya sebagai suatu tindakan ibadah dan sebagai dugaan bahwa hal itu adalah suatu kebajikan, lalu Allah mengabarkan bahwasanya hal itu bukanlah suatu kebajikan, karena Allah tidak mensyariatkannya, dan setiap orang yang beribadah dengan suatu ibadah yang tidak disyariatkan oleh Allah dan tidak pula oleh rasulNya, maka dia telah melakukan ibadah dengan sesuatu bid’ah, dan Allah memerintahkan mereka untuk memasuki rumah dari pintunya karena mengandung suatu kemudahan atas mereka, yang merupakan kaidah dasar dari kaidah-kaidah syariat. Dari isyarat ayat ini dapat diambil Faidah bahwa dalam setiap perkara, seyogyanya seorang manusia itu melakukannya dari jalan yang mudah dan dekat, yang cepat menyampaikannya kepada tujuan. Maka tujuan yang menyeru kepada kebaikan dan melarang dari yang munkar sepatunya memandang kondisi orang-orang yang diserunya (atau dilarangnya), dan memakai cara kelembutan dan taktik yang dengannya dapat menyampaikannya kepada yang dimaksudkan atau kepada sebagainya saja. Seorang pelajar dan pengajar seyogyanya menempuh cara yang paling dekat dan mudah untuk memperoleh apa yang dimaksudkanya, demikianlah setiap orang yang berusaha mendapatkan sesuatu, dia akan memperoleh apa yang dimaksud dengan bantuan Dzat Yang Maha memiliki lagi yang disembah. “Dan bertakwalah kepada Allah.” Inilah kebajikan yang diperintahkan oleh Allah, yaitu konsisten dalam bertaqwa kepadaNya secara terus-menerus dengan merealisasikan perintah-perintahNya dan menjauhi larangan-laranganNya, karena sesungguhnya hal itu adalah sebab keberhasilan dan kemenangan dengan mendapatkan apa yang diinginkan serta keselamatan dari apa yang ditakuti. Maka barangsiapa yang tidak bertakwa kepada Allah, niscaya Dia tidak memiliki jalan menuju keberhasilan, dan barangsiapa yang bertaqwa kepadaNya, niscaya dia akan bahagia dengan kemenangan dan keberhasilan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلۡأَهِلَّةِۖ } Al-Ahillah : Bentuk jamak dari kata Hilal yaitu bulan baru pada tiga hari pertama, karena manusia ketika melihatnya mengatakan, “al-hilal, al-hilal” { المَوَٰقِيتُ } Al-Mawaqit : Bentuk jamak dari kata Miqat, waktu yang ditentukan dan diketahui oleh orang. { إتيان ٱلۡبُيُوتَ مِن ظُهُورِهَا } Ityanul buyut min dhuhurihaa : Mendatangi rumah dengan memanjat melalui tembok dan masuk ke dalam secara sembunyi-sembunyi, tidak dari pintu depan. { وَلَٰكِنَّ ٱلۡبِرَّ مَنِ ٱتَّقَىٰۗ } Walakinnal birra manittaqa : Kebaikan yang akan mengantarkan kepada keridhaan Allah Ta’ala adalah kebaikan hamba dengan bertakwa kepada Allah. Melakukan perintah-perintah Nya dan menjauhi larangan-larangan Nya. Bukanlah kebaikan itu memasuki rumah dari belakang. { الفلاح } Al-Falah : Kemenangan yaitu keselamatan dari api neraka dan masuk ke dalam surga. Makna ayat : Diriwayatkan bahwa para sahabat bertanya kepada Rasulullah ﷺ ,”Mengapa bulan baru muncul dengan keadaan kecil saja, kemudian bertambah besar sampai menjadi purnama, setelah itu kembali mengecil dan mengecil, lalu muncul kembali sebagaimana pertama kali muncul? Maka Allah Ta’ala menurukan ayat ini.”Mereka bertanya kepadamu mengenai bulan sabit.” Dan memerintahkan kepada Rasulullah agar berkata kepada mereka,”Hilal itu merupakan tanda-tanda waktu bagi manusia, dimulai dari kecil kemudian menjadi semakin sempurna besarnya dan kemudian kembali menjadi kecil, agar manusia mengetahui tanda-tanda waktu mereka untuk melakukan pekerjaan. Maka keberadaan bulan dengan keadaan seperti itu, dapat diketahui wakut iddah perempuan, diketahui juga berbagai bulan yang ada, sampai kita bisa mengetahui bulan Ramadhan, dan kita mengetahui bulan haji dan waktunya. Kita juga bisa mengetahui waktu untuk transaksi jual beli atau sewa menyewa, juga mengetahui kapan jatuh tempo hutang. Dahulu orang Anshar jahiliyah ketika sudah memulai ihram untuk haji ataupun umrah, kemudian mereka perlu untuk kembali ke rumahnya untuk suatu keperluan, mereka tidak memasuki rumah melalui pintu. Agar tidak dinaungi oleh tingginya pintu. Akan tetapi mereka memanjat dinding dan memasuki rumah dari bagian belakang, bukan dari pintu. Mereka berpendapat bahwa hal itu merupakan suatu ketaatan dan kebaikan. Lantas Allah menghapus hukum jahiliyah ini dengan firman Nya,”Dan bukanlah kebajikan memasuki rumah-rumah dari belakangnya, akan tetapi kebajikan itu...” kebajikan orang yang bertakwa dan berbuat baik. Allah Ta’ala memerintahkan mereka agar memasuki rumah-rumah nya dari pintu. Firman Allah,”Dan masuklah ke rumah rumah itu dari pintu-pintunya.” Serta memerintahkan mereka agar bertakwa kepada Nya agar mereka beruntung di dunia dan di akhirat. Allah Ta’ala berfirman,”Dan bertakwalah kepada Allah agar kamu beruntung.” Pelajaran dari ayat : • Hendaknya seseorang bertanya mengenai perkara yang bermanfaat untuknya, serta meninggalkan pertanyaan mengenai perkara yang tidak bermanfaat untuk dirinya. • Manfaat bulan qamariyah amat besar, yaitu untuk mengetahui berbagai waktu ibadah. • Keharaman membuat perkara baru dalam agama (bid’ah), walaupun dengan niat untuk melakukan ketaatan kepada Allah ta’ala dan mendapat pahala. • Perintah untuk bertakwa berimplikasi pada kebahagiaan dan keselamatan hamba di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 189: Allah menjelasakan bahwasannya para sahabat meminta kepada nabi tentang hikmah ahillah, Allah memerintahkan untuk berkata kepada mereka : sungguh Allah menjadikan ahillah sebagai tanda bagi manusia untuk mengetahui waktu-waktu ibadah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apa faedah dan hikmah dari adanya bulan sabit. Misalnya waktu untuk berpuasa dan berbuka (berhari raya), waktu kehamilan wanita dan waktu bagi wanita menjalani masa 'iddah. Demikian juga waktu yang dipakai dalam bermu'amalah misalnya kapan dibayar hutangnya, kapan lama bekerjanya dan kebutuhan lainnya. Allah Subhaanahu wa Ta'aala menjadikan bulan sebagai hisab (perhitungan tanggal) bagi manusia yang dapat diketahui dengan mudah oleh manusia, khususnya oleh orang-orang awam. Jika seandainya menggunakan matahari, tentu tidak ada yang mengetahuinya selain segelintir orang. Pada masa jahiliyah, orang-orang yang berihram di waktu haji biasa memasuki rumah dari belakang bukan dari depan dan mereka mengira bahwa hal itu merupakan kebajikan (kebaikan). Maka Allah Subhaanahu wa Ta'aala menerangkan bahwa yang demikian bukanlah kebaikan, karena Allah tidak mensyari'atkannya kepada mereka, demikian pula Rasul-Nya. Oleh karena itu, setiap orang yang beribadah, namun tidak disyari'atkan Allah dan Rasul-Nya, maka cara ibadahnya mardud (tertolak). Imam Bukhari meriwayatkan dari Abu Ishaq, bahwa ia mendengar Al Barra' berkata, \"Ayat ini turun berkenaan dengan kami, di mana orang-orang Anshar apabila telah berhaji, mereka datang tanpa masuk melewati pintu rumah mereka, tetapi dari belakangnya, lalu ada seorang Anshar yang masuk melalui pintu rumahnya, dan nampaknya ia dicela oleh yang lain, maka turunlah ayat, \"Dan bukanlah suatu kebajikan memasuki rumah-rumah dari belakangnya akan tetapi kebajikan adalah kebajikan orang yang bertakwa. Masukilah rumah-rumah dari pintu-pintunya.\" Memasuki rumah-rumah dari pintu-pintunya lebih memudahkan mereka, dan inilah yang wajar. Dari ayat di atas, kita dapat menarik kesimpulan, yaitu hendaknya seseorang -dalam semua urusan- menggunakan jalan yang mudah dan lebih dekat serta lebih sampai kepada maksud dan tujuan. Dalam beramr ma'ruf dan bernahi munkar, hendaknya ia melihat keadaan orang yang hendak diperintahnya, dengan begitu ia dapat bertindak dengan lembut serta menggunakan siasat agar tercapai maksud atau sebagiannya. Demikian juga bagi pelajar atau pengajar, hendaknya ia menggunakan cara yang mudah dan ringan, di mana dengan cara itu tercapai maksudnya. Perlu diingat, bahwa jika seseorang hendak mengerjakan suatu perkara, ia pun telah mendatangi melalui pintu-pintunya, kemudian maksud dan tujuannya tercapai, maka itu semua tidak lepas dari pertolongan Allah Subhaanahu wa Ta'aala. Memperoleh apa yang dicita-citakan dan terhindar dari apa yang dikhawatirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 189",
    "description": "Setelah pada ayat-ayat sebelumnya menerangkan masalah-masalah tentang puasa dalam bulan ramadan dan hukum-hukum yang bertalian dengan puasa, maka ayat ini menerangkan waktu yang diperlukan oleh umat manusia dalam melaksanakan ibadahnya. Jika mereka yakni para sahabatmu bertanya kepadamu wahai Muhammad tentang bulan sabit. Katakanlah kepada mereka, fenomena perubahan bulan itu adalah sebagai penunjuk waktu bagi manusia untuk mengetahui waktu-waktu yang telah ditentukan Allah seperti waktu salat, puasa dan untuk melakukan ibadah haji. Dan bukanlah suatu kebajikan ketika berihram baik dalam haji maupun umrah memasuki rumah dari atasnya sebagaimana yang sering dilakukan pada masa jahiliyah, tetapi kebajikan adalah melakukan kebajikan sebagaimana orang yang bertakwa, menunaikan perintah Allah dan menjauhi larangannya. Karenanya, ketika berihram, masukilah rumah-rumah dari pintu-pintunya, dan bertakwalah kepada Allah agar kamu beruntung sehingga memperoleh kebahagian dunia dan akhirat. Dan perangilah di jalan Allah, untuk membela diri dan kehormatan agamamu, orang-orang yang memerangi kamu, tetapi jangan melampaui batas dengan tidak membunuh wanita, anak-anak, orang lanjut usia, tuna netra, lumpuh, dan orang-orang yang tidak ada hubungannya dengan perang. Sungguh, Allah tidak menyukai orang-orang yang melampaui batas dengan melanggar etika perang tersebut."
  }
]