[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau seperti kondisi sekelompok orang-orang munafik lainnya yang suatu ketika telah tampak jelas bagi mereka kebenaran dan pada saat yang lain Mereka meragukannya. Menyerupai sekelompok manusia yang tengah berjalan di tanah tandus lalu hujan deras turun menyirami mereka yang diiringi dengan kegelapan yang bertumpuk-tumpuk diatas mereka serta sambaran guruh dan kilatan cahaya terang dari petir dan suara suara guntur yang menggelegar yang menyebabkan mereka meletakkan jari-jari mereka ke lubang telinga mereka akibat saking mencekamnya suasana karena mereka takut mati. Dan Allah ta'ala meliputi orang-orang kafir dan mereka tidak akan lolos dari nya dan tidak bisa melakukan sesuatu pun yang menghindari siksaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Adapun maksud perumpamaan dengan air ialah mereka seperti air hujan lebat dari awan yang gelap berlapis-lapis, guruh dan kilat. Hujan lebat itu turun kepada suatu kaum lalu mereka mengalami ketakutan yang luar biasa. Lalu mereka menutupi telinga dengan ujung-ujung jari karena kerasnya suara petir yang menyambar dan takut mati. Dan Allah Maha Mengetahui dan Menguasai orang-orang kafir. Mereka tidak mungkin dapat menghindar dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Allah juga membuat perumpamaan lain bagi mereka untuk menekankan makna dan menyingkap faktor-faktor lain. Orang-orang munafik yang berada dalam dua keadaan; keadaan ketika jiwa mereka terpanggil oleh kebaikan saat mendengar petunjuk dari al-Qur'an, dan keadaan ketika jiw Mereka terapanggil oleh keburukan dengan mengolok-olok kaum muslimin. Allah memperumpamakan mereka seperti hujan yang didalamnya tercampur antara butiran air, cahaya, dan campuran yang membuat air menjadi keruh. Perumpamaan ini sesuai dengan perumpamaan-perumpamaan yang sering dibuat oleh orang-orang Arab yang ahli dalam balaghah. (lihat: at-tahrir dan at-tanwir 1/310). Makna dari perumpamaan ini yaitu sifat mereka seperti suatu kaum yang berjalan pada malam hari yang gelap gulita diiringi hujan lebat dari awan yang gelap gulita pula dan disertai kilat dan petir, maka mereka menutup telinga mereka dengan jari jemari mereka karena ketakutan. Setiap kali kilat menyambar, mereka dapat melihat jalan sehingga mereka dapat berjalan; namun jika kilat telah hilang, maka mereka kembali kebingungan. Demikian pula keadaan orang-orang munafik, jika mereka mengucapkan kalimat tauhid maka mereka mendapat cahaya sehingga mereka dapat berjalan; namun ketika mereka ragu maka mereka kembali kebingungan dalam kegelapan. Mereka takut terhadap orang-orang beriman jika urusan mereka tersingkap, namun Allah mengetahui segalanya tentang mereka, dan Dia akan membalas apa yang telah mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. اَوْ كَصَيِّبٍ مِّنَ السَّمَاۤءِ (Atau seperti (orang-orang yang ditimpa) hujan lebat dari langit) Makna (الصيب) adalah hujan, Allah menjadikannya sebagai perumpamaan dalam al-Qur’an bahwa ia bagi orang yang beriman akan menjadi kesegaran dari dahaga dan kesuburan tanah mereka, sedangkan bagi orang munafik ia akan menjadi ketakutan. فِيْهِ ظُلُمٰتٌ وَّرَعْدٌ وَّبَرْقٌۚ (disertai gelap gulita, guruh dan kilat) Yakni peringatan-peringatan yang ada dalam al-Qur’an يَجْعَلُوْنَ اَصَابِعَهُمْ فِيْٓ اٰذَانِهِمْ مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِۗ (mereka menyumbat telinganya dengan anak jarinya, karena (mendengar suara) petir, sebab takut akan mati). Yakni agar bisa terhindar dari bahaya padahal hal itu (menyumbat telinga) tidak dapat menjauhkan mereka dari bahaya. Begitu juga keadaan orang-orang munafik, tidak ada yang dapat mereka lakukan kecuali menyumbat telinga mereka agar tidak dapat mendengar ayat-ayat al-Qur’an. وَاللّٰهُ مُحِيْطٌۢ بِالْكٰفِرِيْنَ (Dan Allah meliputi orang-orang yang kafir). Makna dari (الإحاطة) adalah mengepung dari semua sisi agar orang yang dikepung tidak mampu keluar dari arah manapun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam firman Allah ta'ala : { ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ } kata ( ظُلُمَاتٌ ) dalam bentuk jamak, sedangkan ( وَرَعْدٌ وَبَرْقٌ ) bentuk tunggal ! hal ini dikarenakan keduanya bisa muncul dari satu sumber yaitu : ( السحاب ) awan, sedangkan kegelapan bisa terjadi dalam beberapa keadaan yaitu : malam dan awan yang tebal dan hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan perumpamaan orang-orang munafik itu ketika meniru orang lain adalah seperti orang yang berada di tengah hujan lebat yang diselingi petir yang sangat keras dan kilat yang (menyala) sangat cepat. Mereka takut dengan petir-petir itu, yang memiliki suara sangat keras dan merusak yang di dalamnya terdapat api yang membara dan mereka takut mati karena tidak dapat berlindung darinya. Dan Allah mengunci orang-orang kafir dalam gengamanNya sehingga mereka tidak mampu menghindar dari takdir dan siksaNya. Asbabun Nuzul ayat-ayat ini sebagaimana yang dikatakan Ath-Thabari dari Ibnu Mas’ud, Ibnu Abbas dan sahabat lainnya bahwa banyak orang masuk Islam setelah peristiwa hijrah, kemudian mereka melakukan kemunafikan. Perumpamaan mereka adalah seperti orang yang berada dalam kegelapan dan menyalakan api, kemudian api itu padam; dan seperti orang yang menerjang hujan lebat yang diiringi petir dan kilat, lalu dia berusaha menghindarinya karena takut, kemudian meninggalkannya dan kembali kepada kekafirannya, sehingga dia menjadi orang yang tidak mengetahui halal-haram dan baik-buruk. Itulah perumpamaan orang munafik. Dia berada dalam gelapnya kemusyrikan, kemudian dia masuk Islam lalu kembali tersesat lagi. Perumpamaan pertama untuk menunjukkan begitu cepatnya kepura-puraan mereka terbongkar dan perumpamaan kedua untuk menunjukkan kebingungan dan kegelisahan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau seperti orang yang ditimpa hujan lebat} seperti hujan yang lebat {dari langit yang disertai dengan berbagai kegelapan, petir, dan kilat. Mereka menyumbat telinga dengan jari-jari mereka (untuk menghindari) suara petir itu karena takut mati. Allah meliputi orang-orang yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Kemudian Allah ta’ala berfirman, “Atau seperti orang-orang yang ditimpa hujan lebat dari langit, ” yakni yang disiram hujan, yaitu hujan yang mengalir yang turun dengan derasnya, ”disertai gelap gulita, ” yakni kegelapan malam, kegelapan awan, dan kegelapan hujan yang ada padanya, “dan guruh, ” yaitu suara yang terdengar dari awan dan juga ada padanya “kilat, ” yaitu cahaya yang menyala dan terlihat dari awan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 19: Allah kemudian menyerupakan keadaan dari kaum yang lain yang termasuk orang-orang munafik dengan keadaan segerombolan orang yang jalan di padang pasir ; kemudian ditimpakan kepada mereka hujan yang deras dengan gelapnya malam , gelap pula awan , gelap pula hujan dengan petir yang menakutkan dan kilat yang menyilaukan pandangan , serta petir-petir yang menghanguskan sehingga karena sebab ketakutan, mereka meletakkan jari-jari tangannya dalam telinga telinga mereka karena sebab takut binasa. Inilah permisalan orang-orang yang munafik karena sesungguhnya dalam hati mereka terdapat kegelapan , kegelapan akan kekufuran , kegelapan akan keraguan , kegelapan akan kemunafikan ; maka ketika mereka mendengar Al-quran mereka lari dari ajarannya , mereka menutup telinga-telinga mereka dari mendengar Al-Quran karena sebab kekafiran dan pengingkaran, mereka lupa bahwasanya Allah Yang Maha meliputi mereka dan maha kuasa atas mereka dan sesungguhnya tiada jalan bagi mereka ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kegelapan malam dan kegelapan awan. Keadaan orang-orang munafik itu, ketika mendengar ayat-ayat yang mengandung peringatan adalah seperti orang yang ditimpa hujan lebat dan petir. Mereka menyumbat telinganya karena tidak sanggup mendengar peringatan-peringatan Al Qur’an itu. Maksudnya pengetahuan dan kekuasaan Allah meliputi orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 19",
    "description": "Atau keadaan mereka yang penuh kebimbangan, kesulitan, dan ketidaktahuan akan manfaat dan bahaya seperti keadaan orang yang ditimpa hujan lebat dari langit, yang disertai kegelapan karena tebal dan pekatnya awan, petir yang menggelegar dan kilat yang menyambar cepat. Mereka menyumbat telinga dengan ujung jari-jarinya, untuk menghindari suara petir itu karena takut mati. Mereka mengira dengan berbuat demikian akan terhindar dari kematian. Mereka itu bila diturunkan Al-Qur'an yang berisi penjelasan tentang kegelapan akibat kekufuran dan siksa yang akan diterima, penjelasan tentang keimanan dan cahayanya yang kemilau, dan penjelasan tentang macam-macam siksaan yang menakutkan, mereka berpaling dan berusaha menghindar darinya dengan harapan terbebas dari siksa. Allah meliputi dan mengetahui orang-orang yang kafir dengan ilmu dan kekuasaan-Nya. Karena amat cepat dan terangnya, hampir saja kilat itu menyambar penglihatan mereka. Setiap kali kilat itu menyinari, mereka berjalan beberapa langkah di bawah sinar itu, dan apabila kilat itu menghilang dan gelap kembali menerpa mereka, mereka berhenti di tempat dengan penuh kebimbangan. Orang-orang munafik itu ketika melihat bukti-bukti dan tanda-tanda kekuasaan Allah terkagum-kagum dengan itu semua sehingga mereka berkeinginan mengikuti kebenaran tersebut. Akan tetapi, tidak beberapa lama kemudian mereka kembali kepada kekufuran dan kemunafikan. Sekiranya Allah menghendaki, niscaya dia hilangkan pendengaran mereka dengan suara halilintar yang memekakkan telinga, dan dia hilangkan penglihatan mereka dengan sambaran kilat yang sangat cepat dan terang, tetapi Allah menangguhkan itu semua sampai tiba saatnya nanti. Sungguh, Allah yang memiliki sifat-sifat kesempurnaan mahakuasa atas segala sesuatu, dengan atau tanpa sebab apa pun."
  }
]