[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan perangilah oleh kalian -wahai kaum mukminin-, untuk membela agama Allah, orang-orang yang memerangi kalian, dan janganlah kalian melanggar apa-apa yang dilarang, seperti memutilasi jasad ( yang telah mati ) , mengambil harta rampasan secara khianat ( sebelum dibagi ) , membunuh orang-orang yang tidak halal dibunuh, seperti anak-anak, kaum perempuan, dan orang tua, serta orang-orang yang disamakan hukumnya dengan mereka. Sesungguhnya Allah tidak menyukai orang-orang yang melanggar rambu-rambu batasannya, sehingga menghalalkan apa yang diharamkan Allah dan rasul Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "190. Berperanglah kalian untuk meninggikan kalimat Allah melawan orang-orang kafir yang hendak memalingkan kalian dari agama Allah. Dan janganlah kalian melampaui batas-batas yang telah ditetapkan oleh Allah dengan membunuh anak-anak, kaum wanita dan orang-orang lanjut usia, atau memutilasi tubuh korban dan sebagainya. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas-batas yang ditetapkan-Nya melalui syariat dan hukum-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "190. Dalam ayat ini Allah mengajarkan orang-orang beriman asas-asas jihad di jalan Allah untuk berinteraksi dengan orang-orang yang memerangi Islam dan kaum muslimin, Allah berfirman kepada mereka: “Perangilah orang-orang kafir yang memerangi kalian demi menolong agama Allah, namun janganlah kalian menzalimi orang-orang yang memerangi itu dengan memutilasi jasad mereka, jangan pula menzalimi orang-orang yang tidak memerangi kalian seperti para wanita, anak-anak, dan orang-orang yang sudah renta.” Kemudian Allah menekankan larangan berbuat zalim ini dengan menyatakan bahwa Dia tidak mencintai orang-orang yang zalim, dan Dia akan menghukum orang-orang yang zalim tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "190. وَلَا تَعْتَدُوٓا۟ ۚ (janganlah kamu melampaui batas) Ketika ayat ini turun Rasulullah sedang memerangi orang yang memeranginya dan menahan diri dari orang menahan diri darinya, sampai turunlah firman Allah: فإذا انسلخ الأشهر الحرم فاقتلوا المشركين حيث وجدتموهم.... التوبة:5 Dan pendapat lain mengatakan, sampai turun ayat: وَلَا تَعْتَدُوٓا۟ ۚ (janganlah kamu melampaui batas) Yakni dengan membunuh wanita dan anak-anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "190. Wahai orang-orang yang beriman perangilah orang-orang yang memerangi kalian, yaitu orang-orang kafir untuk meninggikan kalimat Allah, dan janganlah menyakiti orang yang tidak berperang. Sesungguhnya Allah akan menghukum orang yang melanggar. Ayat ini turun sebagai izin untuk memerangi kafir Quraisy setelah perjanjian Hudaibiyah, ketika mereka melarang kaum muslimin menuju Masjidil haram dan memerangi mereka pada bulan yang haram untuk berperang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perangilah di jalan Allah} untuk meninggikan kalimat Allah dan mengagungkan agamaNya {orang-orang yang memerangi kamu dan jangan melampaui batas} dan janganlah melakukan hal-hal yang dilarang menyiksa dan membunuh orang yang tidak boleh dibunuh {Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "190. Ayat-ayat Ini mengandung perintah untuk berperang di jalan Allah. Ini terjadi setelah hijrah ke Madinah, ketika kaum muslimin telah kuat untuk berperang, Allah memerintahkan mereka untuk berperang, di mana sebelumnya mereka diperintahkan untuk menahan diri. Dan dikhususkan nya perang “dijalan Allah” adalah anjuran untuk ikhlas dan larangan dari saling berperang dalam fitnah di antara kaum muslimin. “orang-orang yang memerangi kamu,” yakni orang-orang yang bersiap untuk memerangi kalian, dan mereka itu adalah orang-orang yang telah balik dari kaum laki-laki yang bukan orang tua yang tidak memiliki pendapat (usulan) untuk memerangi kalian dan tidak juga ikut berperang. Dalam larangan dari tindakan melampaui batas ini meliputi segala macam bentuknya secara keseluruhan dari membunuh orang yang tidak ikut berperang, seperti para wanita, orang-orang gila, anak-anak, para pendeta, dan sebagainya, juga memotong-motong mayat, membunuh hewan-hewan, memotong pepohonan dan sebagainya, yang bukan karena kemaslahatan yang kembali kepada kaum muslimin, dan yang termasuk melampaui batas adalah memerangi orang-orang yang membayar jizyah apabila mereka telah membayarnya, karena sesungguhnya hal itu tidaklah boleh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { سَبِيلِ ٱللَّهِ } Sabilillah : Jalan yang mengantarkan kepada keridhaan Allah, yaitu agama Islam. Maksudnya di sini adalah meninggikan kalimat Allah. { ٱلَّذِينَ يُقَٰتِلُونَكُمۡ } Aladziina yuqaatilunakum : Kaum musyrikin yang memulai peperangan kepada kalian. { وَلَا تَعۡتَدُوٓاْۚ } Walaa ta’taduu : Jangan kalian melampaui batas sehingga membunuh perempuan dan anak-anak dan orang yang tidak ikut serta berperang. Makna ayat : Tiga ayat ini yang dimulai dengan firman Allah,”Dan perangilah di jalan Allah” termasuk dalam golongan pertama, ayat yang turun dengan perintah untuk memerangi kaum Musyrikin. Berisikan izin kepada Rasulullah ﷺ dan kaum mukminin untuk memerangi siapa saja yang memerangi mereka, dan menahan diri dari pihak yang tidak memerangi mereka. Allah Ta’ala berfirman,”Dan berperanglah di jalan Allah” maksudnya dalam jalan untuk meninggikan kalimat Allah agar beribadah kepada Nya saja. “Orang-orang yang memerangi kalian” dan bunuhlah mereka selagi kalian dapat melakukannya, dan keluarkanlah mereka dari rumah-rumah mereka sebagaimana mereka dahulu mengeluarkan kalian dari rumah-rumah kalian wahai kaum Muhajirin. Janganlah merasa enggan untuk membunuhnya, karena fitnah mereka kepada kaum mukminin membawa mereka dalam kekufuran dengan pemaksaan dan penyiksaan, lebih parah dibandingkan pembunuhan yang dilakukan. Pelajaran dari ayat : • Kewajiban untuk memerangi pihak yang memerangi kaum Muslimin, serta menahan diri dari pihak yang tidak memerangi. Ini berlaku sebelum ayat ini dianulir (dinasakh). • Keharaman melampaui batas dalam peperangan dengan membunuh anak-anak, orang tua, dan perempuan kecuali para perempuan itu ikut memerangi kaum Muslimin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 190: Allah memerintahkan orang-orang yang beriman untuk berjihad dijalan Allah menolong agama Allah ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Nabi shallallahu 'alaihi wa sallam dihalangi oleh orang-orang kafir mendatangi Baitullah pada tahun Hudaibiyah, lalu Beliau mengadakan perjanjian dengan orang-orang kafir agar Beliau bersama para sahabatnya dapat berumrah di tahun yang akan datang, kemudian mereka mengizinkan untuk Beliau tinggal di Makkah selama tiga hari. Maka Beliau bersiap-siap untuk melakukan 'umrah qadha', dan karena khawatir kaum kafir Quraisy tidak menepati janji dengan memerangi Beliau dan para sahabatnya, ssedangkan para sahabat tidak mau memerangi mereka di tanah haram, ketika ihram dan di bulan haram, maka turunlah ayat di atas. Untuk meninggikan agama-Nya. Perintah berperang di jalan Allah dimulai setelah Rasulullah shallallahu 'alaihi wa sallam hijrah ke Madinah, ketika kaum muslimin memiliki kekuatan. Allah memerintahkan demikian setelah sebelumnya mereka diperintahkan menahan diri. Disebutkan \"di jalan Allah\" adalah untuk mendorong mereka berbuat ikhlas dan larangan ikut berperang ketika terjadi fitnah antara kaum muslimin, karena hal itu bukan \"fii sabilillah\". Yakni dengan mengerjakan larangan. Misalnya mencincang, ghulul (khianat dalam ghanimah), membunuh orang yang tidak halal dibunuh seperti wanita, anak-anak, orang gila, rahib, orang yang sudah tua renta dan yang sama dengan mereka (seperti golongan lemah yang tidak ikut berperang), demikian juga membunuh hewan dan memotong pepohonan yang tidak ada maslahatnya bagi kaum muslimin. Termasuk melampaui batas juga adalah memulai peperangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 190",
    "description": "Dan perangilah di jalan Allah, untuk membela diri dan kehormatan agamamu, orang-orang yang memerangi kamu, tetapi jangan melampaui batas dengan tidak membunuh wanita, anak-anak, orang lanjut usia, tuna netra, lumpuh, dan orang-orang yang tidak ada hubungannya dengan perang. Sungguh, Allah tidak menyukai orang-orang yang melampaui batas dengan melanggar etika perang tersebut. Dan bunuhlah mereka di mana kamu temui mereka dalam keadaan perang. Kaum muslim tidak boleh lengah terhadap musuh, sebab mereka, dalam perang, akan membinasakan kamu. Dan usirlah mereka dari mana mereka telah mengusir kamu. Sebanding dengan kejahatan mereka mengusir kamu dari kota mekah, mereka pun harus diusir dari kota yang sama. Dan fitnah, yakni tindakan mereka menghalangi orang yang akan masuk islam, mempertahankan kemusyrikan, mengisolasi sesama warga kota hanya karena meyakini tidak ada tuhan selain Allah, dan mengintimidasi orang yang berbeda keyakinan, itu lebih kejam daripada pembunuhan. Dan janganlah kamu perangi mereka di masjidilharam demi menghormati tempat suci, kecuali jika mereka memerangi kamu di tempat itu. Sebab, dalam islam, menghormati tempat suci tidak boleh mengalahkan keselamatan jiwa yang terancam dan membiarkan agama Allah diinjak-injak oleh orang yang tidak mencintai perdamaian. Jika mereka memerangi kamu terlebih dahulu di tempat suci seperti masjidilharam, maka perangilah mereka di tempat tersebut untuk membela diri dan kehormatan agama. Demikianlah balasan bagi orang kafir yang telah bertindak zalim."
  }
]