[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bunuhlah orang-orang yang memerangi kalian dari kalangan kaum musyrikin dimanapun kalian jumpai mereka, dan usirlah mereka keluar dari tempat mereka telah mengusir kalian darinya ( Makkah ). Dan perbuatan fitnah (yaitu kekafiran, syirik, dan menghalang-halangi orang dari Islam), adalah lebih buruk daripada kalian membunuh mereka. Dan janganlah kalian memulai menyerang mereka di sekitar Masjidil Haram sebagai bentuk pengagungan terhadap kesuciannya, sampai mereka yang memulai menyerang kalian disana. Apabila mereka menyerang kalian di dalam Masjidil Haram, maka bunuhlah mereka didalamnya. Dengan balasan yang tegas seperti itulah, bentuk balasan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "191. Dan bunuhlah mereka di mana pun kalian menemukan mereka, dan usirlah mereka dari tempat di mana mereka mengusir kalian, yaitu kota Makkah. Bencana (fitnah) yang timbul akibat melarang orang mukmin melaksanakan agamanya dan kembali kepada kekufuran itu lebih besar daripada pembunuhan. Janganlah kalian memulai perang dengan mereka di Masjidil Haram untuk menghormati tempat suci itu, sampai mereka sendiri yang memulai perang di tempat itu. Jika mereka memulai perang di Masjidil Haram, maka bunuhlah mereka. Balasan seperti ini -yaitu membunuh orang yang melakukan penyerangan di Masjidil Haram- akan menjadi balasan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "191. Dan perangilah orang-orang musyrik yang terlebih dahulu memerangi kalian dimanapun kalian temui mereka, kecuali yang kalian temui di Masjidil Haram. Usirlah mereka dari tempat tinggal mereka sebagaimana mereka telah mengusir kalian dari Makkah. Perintah ini sangatlah penting, sebab kesyirikan dan perbuatan mereka memaksa kaum beriman untuk keluar dari agama lebih besar kejahatannya daripada ‘kejahatan’ membunuh mereka. Dan janganlah kalian mengawali perang dengan mereka dalam Masjidil Haram, hingga mereka yang mengawali perang dengan kalian. Jika mereka memerangi kalian di dalam Masjidil Haram maka perangilah mereka di dalamnya pula. Demikianlah balasan bagi orang-orang yang mendustakan Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "191. حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم (mereka di mana saja kamu jumpai mereka, dan usirlah mereka) Yakni dimana kalian mendapati mereka dan memungkinkan untuk membunuh mereka. مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ (dari tempat mereka telah mengusir kamu) Yakni dari kota Makkah. وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْلِ (dan fitnah itu lebih besar bahayanya dari pembunuhan) Yakni fitnah (cobaan) yang ingin mereka timpakan kepada kalian; berupa kembali kepada kekufuran itu lebih kejam daripada pembunuhan andai mereka membunuh kalian. Dan pendapat lain mengatakan, yang dimaksudkan adalah kesyirikan yang ada pada mereka lebih buruk daripada pembunuhan yang kalian besar-besarkan. وَلَا تُقٰتِلُوهُمْ عِندَ الْمَسْجِدِ الْحَرَامِ (dan janganlah kamu memerangi mereka di Masjidil Haram) Yakni di Makkah dan sekitarnya sampai pada Arafah, Tan’im, dan yang lainnya. فَإِن قٰتَلُوكُمْ فَاقْتُلُوهُمْ ۗ (Jika mereka memerangi kamu (di tempat itu), maka bunuhlah mereka) Yakni apabila mereka yang memulai peperangan di tanah haram Makkah maka perangi mereka juga dan lanjutkan peperangan sampai kalian berhasil membunuh mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "191. Bunuhlah orang-orang musyrik yang menyerang kalian bagaimanapun kalian mendapati mereka. Usirlah mereka dari rumah-rumahnya sebagaimana mereka mengusir kalian dari Mekah. Memfitnah orang mukmin dari agama mereka dengan menyiksa dan berusaha mengembalikan mereka kepada kekufuran itu lebih buruk daripada pembunuhan. Janganlah kalian memulai peperangan terhadap orang-orang musyrik di tanah haram, Mekah dan daerah sekitarnya sampai mereka memerangi kalian dahulu. Jika mereka memulai peperangan di tanah haram, maka perangilah mereka di sana karena sunnatullah itu bahwa orang-orang kafir itu akan dibalas dengan balasan seperti ini karena mereka memulai penyerangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bunuhlah mereka (yang memerangi kalian) di mana pun kalian menjumpai mereka} mendapati mereka {dan usirlah mereka dari tempat mereka mengusir kalian. Padahal, fitnah itu lebih kejam daripada pembunuhan} kesengsaraan yang mereka gunakan untuk mengembalikan kalian kepada kekufuran itu lebih besar daripada pembunuhan {Lalu janganlah kalian memerangi mereka} janganlah kalian memulai peperangan dengan mereka {di Masjidil haram, kecuali jika mereka memerangi kalian di tempat itu. Jika mereka memerangi kalian, maka perangilah mereka. Demikianlah balasan bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "191-192. “Dan bunuhlah mereka di mana saja kamu jumpai mereka.” Ini merupakan perintah untuk memerangi mereka dimanapun mereka didapatkan, di setiap waktu dan massa, baik peperangan dalam bentuk pembelaan diri maupun peperangan dalam bentuk penyerangan, kemudian Allah mengecualikan dari keumuman ini dari memerangi mereka “di Masjidil Haram” bahwasanya hal itu tidaklah boleh kecuali bila mereka yang memulai memerangi kalian, maka mereka itu diperangi sebagai ganjaran atas tindakan kesewenang-wenangan mereka. Ini berlanjut terus dalam setiap waktu hingga mereka berhenti dari kekufuran mereka dan masuk Islam, karena Allah akan menerima Taubat mereka walaupun apa yang telah terjadi dari mereka sebelumnya dari pengingkaran kepada Allah dan kesyirikan di dalam masjidil haram serta menghalanginya Rasulullah dan kaum muslimin dari memasukinya. Hal ini merupakan rahmat Allah dan karuniaNya atas hamba-hambaNya. Dan ketika peperangan di Masjidil Haram dianggap sebagai tindakan perusakan di negeri haram ini, Allah mengabarkan bahwasanya kerusakan dengan fitnah didalamnya dengan kesyirikan dan menghalangi agamaNya adalah lebih besar daripada kerusakan peperangan, maka sama sekali tidak ada kesalahan bagi kalian wahai kaum muslimin dalam memerangi mereka. Ayat ini dijadikan dalil atau sebuah kaidah yang terkenal yaitu, “mengerjakan kerusakan yang lebih kecil dari 2 kerusakan demi menghindari kerusakan yang lebih besar.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ثَقِفۡتُمُوهُمۡ } Tsaqiftumuuhum : Kalian dapat memerangi mereka. { وَٱلۡفِتۡنَةُ } Al-Fitnah : Kesyirikan { ٱلۡمَسۡجِدِ ٱلۡحَرَامِ } Al-Masjidil Haram : Maksudnya di sini adalah Kota Mekah dan tanah haram yang ada di sekitarnya. Makna ayat: “Dan janganlah kamu memerangi mereka di Masjidil Haram, kecuali jika mereka memerangi kamu di tempat itu.” Maknanya janganlah kalian memulai peperangan terlebih dahulu, apabila mereka memerangi kalian maka bunuhlah mereka. Demikianlah pembunuhan dan pengusiran yang sebenarnya kalian lakukan kepada mereka, menjadi balasan bagi setiap orang kafir yang melampaui batas lagi zhalim. Pelajaran dari ayat: • Keharaman melakukan peperangan di Masjidil Haram, yaitu di mekah dan tanah haram. Kecuali jika pihak musuh yang memulai peperangan terlebih dahulu, maka mereka diperangi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 191: Allah memerintahkan orang-orang muslim untuk membunuh orang-orang kafir yang mengawali membunuh mereka dan Allah perintahkan untuk mengeluarkan dari negeri mekkah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dalam jihad difa' (membela diri) maupun jihad fath (penaklukkan negeri di bawah pimpinan imam kaum muslimin). Fitnah di ayat ini adalah kekafiran, kemusyrikan dan menghalangi manusia dari jalan Allah. Termasuk juga mengusir kaum muslim dari kampung halamannya, merampas harta mereka dan menyakiti atau mengganggu kebebasan mereka beragama. Fitnah tersebut lebih kejam daripada peperangan yang terjadi di tanah haram. Maksud lebih kejam di sini adalah lebih dahsyat mafsadat atau bahayanya. Dari ayat di atas keluar ka'idah fiqh, \"Yurtakabu akhafful mafsadatain lidaf'i a'laahaa\" (dilakukan mafsadat yang ringan untuk menolak mafsadat lebih besar). Sebagai penghormatan kepada Masjidilharam. Yaitu pembunuhan dan pengusiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 191",
    "description": "Dan bunuhlah mereka di mana kamu temui mereka dalam keadaan perang. Kaum muslim tidak boleh lengah terhadap musuh, sebab mereka, dalam perang, akan membinasakan kamu. Dan usirlah mereka dari mana mereka telah mengusir kamu. Sebanding dengan kejahatan mereka mengusir kamu dari kota mekah, mereka pun harus diusir dari kota yang sama. Dan fitnah, yakni tindakan mereka menghalangi orang yang akan masuk islam, mempertahankan kemusyrikan, mengisolasi sesama warga kota hanya karena meyakini tidak ada tuhan selain Allah, dan mengintimidasi orang yang berbeda keyakinan, itu lebih kejam daripada pembunuhan. Dan janganlah kamu perangi mereka di masjidilharam demi menghormati tempat suci, kecuali jika mereka memerangi kamu di tempat itu. Sebab, dalam islam, menghormati tempat suci tidak boleh mengalahkan keselamatan jiwa yang terancam dan membiarkan agama Allah diinjak-injak oleh orang yang tidak mencintai perdamaian. Jika mereka memerangi kamu terlebih dahulu di tempat suci seperti masjidilharam, maka perangilah mereka di tempat tersebut untuk membela diri dan kehormatan agama. Demikianlah balasan bagi orang kafir yang telah bertindak zalim. Tetapi jika mereka berhenti melakukan tindakan agresif, menyerang umat islam di tempat suci, kemudian mengajak berdamai, dan mempertimbangkan untuk menerima ajaran Allah; maka sikap mereka itu harus dihargai, bahkan jika mereka mengubah pola pikir dan benarbenar masuk islam, kekejaman mereka diampuni Allah, maka sungguh, Allah maha pengampun, maha penyayang."
  }
]