[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika mereka meninggalkan keadaan mereka sebelumnya, yaitu kekafiran, memerangi kalian di sisi Masjidil Haram, lalu mereka masuk ke dalam keimanan, maka sesungguhnya Allah maha pengampun bagi hamba-hamba Nya, maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "192. Apabila mereka berhenti memerangi kalian dan berhenti dari kekafiran, maka berhentilah memusuhi mereka. Sesungguhnya Allah Maha Pengampun bagi orang yang bertaubat. Maka Allah tidak akan menghukum mereka karena dosa-dosa yang sudah berlalu. Dan Allah juga Maha Penyayang kepada mereka. Maka Allah tidak terburu-buru menghukum mereka (di dunia)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "192. Jika mereka berhenti dari kekafiran dan peperangan, maka berhentilah pula dari memerangi mereka. Sungguh Allah Maha Mengampuni hamba-hamba-Nya dan Maha Mengasihi mereka, dan dengan masuk Islam akan menghapus dosa mereka yang mereka kerjakan sebelum masuk Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "192. فَإِنِ انتَهَوْا۟ (Kemudian jika mereka berhenti) Yakni berhenti dari memerangi kalian dan memeluk Islam. فَإِنَّ اللَّـهَ غَفُورٌ رَّحِيمٌ (maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang) Yakni maka ketika itu maafkanlah mereka karena Islam menghapus dosa-dosa yang telah lalu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "192. Dan jika mereka berhenti memerangi kalian dan masuk Islam, maka sesungguhnya Allah itu Maha Pemaaf atas hal yang telah terjadi dan Maha Penyayang dengan menerima taubat mereka. Sesungguhnya Islam itu akan menghapus dosa-dosa sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Namun, jika mereka berhenti sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "191-192. “Dan bunuhlah mereka di mana saja kamu jumpai mereka.” Ini merupakan perintah untuk memerangi mereka dimanapun mereka didapatkan, di setiap waktu dan massa, baik peperangan dalam bentuk pembelaan diri maupun peperangan dalam bentuk penyerangan, kemudian Allah mengecualikan dari keumuman ini dari memerangi mereka “di Masjidil Haram” bahwasanya hal itu tidaklah boleh kecuali bila mereka yang memulai memerangi kalian, maka mereka itu diperangi sebagai ganjaran atas tindakan kesewenang-wenangan mereka. Ini berlanjut terus dalam setiap waktu hingga mereka berhenti dari kekufuran mereka dan masuk Islam, karena Allah akan menerima Taubat mereka walaupun apa yang telah terjadi dari mereka sebelumnya dari pengingkaran kepada Allah dan kesyirikan di dalam masjidil haram serta menghalanginya Rasulullah dan kaum muslimin dari memasukinya. Hal ini merupakan rahmat Allah dan karuniaNya atas hamba-hambaNya. Dan ketika peperangan di Masjidil Haram dianggap sebagai tindakan perusakan di negeri haram ini, Allah mengabarkan bahwasanya kerusakan dengan fitnah didalamnya dengan kesyirikan dan menghalangi agamaNya adalah lebih besar daripada kerusakan peperangan, maka sama sekali tidak ada kesalahan bagi kalian wahai kaum muslimin dalam memerangi mereka. Ayat ini dijadikan dalil atau sebuah kaidah yang terkenal yaitu, “mengerjakan kerusakan yang lebih kecil dari 2 kerusakan demi menghindari kerusakan yang lebih besar.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Namun apabila mereka berhenti dari kesyirikan dan kekufuran, kemudian masuk agama Islam, maka Allah mengampuni dosa-dosa mereka dan merahmati mereka. Karena Allah Ta’ala Maha pengampun lagi Maha Penyayang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 192: Allah memerintahkan kaum muslimin untuk berhenti dari membunuh orang-orang kafir jika mereka berhenti memerangi kalian dan mengikuti serta masuk agama Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari kekafiran serta dari sikap memusuhi dan memerangi kamu. Allah Subhaanahu wa Ta'aala akan mengampuni mereka yang berhenti dari kekafiran dan masuk Islam, meskipun mereka telah mengerjakan dosa yang sangat besar, yaitu kekafiran dan kemusyrikan di Masdjidil haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 192",
    "description": "Tetapi jika mereka berhenti melakukan tindakan agresif, menyerang umat islam di tempat suci, kemudian mengajak berdamai, dan mempertimbangkan untuk menerima ajaran Allah; maka sikap mereka itu harus dihargai, bahkan jika mereka mengubah pola pikir dan benarbenar masuk islam, kekejaman mereka diampuni Allah, maka sungguh, Allah maha pengampun, maha penyayang. Dan perangilah mereka itu sampai tidak ada lagi fitnah, yakni hingga keadaan kondusif untuk menciptakan perdamaian dengan berakhirnya teror, rintangan dan gangguan keamanan dan ketertiban, dan agama hanya bagi Allah semata sehingga setiap orang bisa menjalankan agama dengan tenang. Jika mereka berhenti dari berbuat teror, gangguan keamanan dan ketertiban, maka tidak ada lagi alasan bagi umat islam untuk menampakkan permusuhan di antara umat manusia kecuali terhadap orang-orang zalim, yakni orang-orang yang tidak memiliki tekad untuk berdamai dengan kaum muslim."
  }
]