[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan teruslah kalian -wahai kaum Mukminin- untuk memerangi kaum musyrikin yang berbuat melampaui batas, sehingga tidak tersisa lagi fitnah bagi kaum muslimin, terhadap agama mereka dan tidak ada perbuatan Syirik lagi kepada Allah, dan yang bertahan adalah ketundukan secara murni hanya kepada Allah semata, tidak disembah sesembahan lain selain Allah. Apabila mereka menahan diri dari kekafiran dan peperangan, maka tahanlah diri kalian dari mereka. Hukuman ini tidaklah diberlakukan, kecuali pada orang-orang yang terus melangsungkan perbuatan kafir dan permusuhan mereka saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "193. Dan perangilah orang-orang kafir itu sampai mereka tidak melakukan kemusyrikan, tidak menghalang-halangi manusia dari jalan Allah, tidak ada lagi kekafiran, dan agama yang menang adalah agama Allah . Apabila mereka berhenti dari kekafiran dan dari sikap menghalang-halangi manusia dari jalan Allah, maka berhentilah memerangi mereka, karena sesungguhnya tidak ada permusuhan kecuali terhadap orang-orang yang zalim, baik dengan menunjukkan kekafiran maupun menghalang-halangi manusia dari jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "193. وَقٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ (Dan perangilah mereka itu, sehingga tidak ada fitnah lagi) Yakni sampai keadaan dimana orang-orang kafir tidak mempunyai kekuatan untuk menghalang-halangi di jalan Allah, dan seluruh umat Islam merasa aman dalam menjalankan agama mereka dan agama hanya bagi Allah semata. Dan barang siapa masuk islam dan berlepas dari kesyirikan maka diharamkan untuk memerangainya. فَلَا عُدْوٰنَ إِلَّا عَلَى الظّٰلِمِينَ (maka tidak ada permusuhan (lagi), kecuali terhadap orang-orang yang zalim) Yakni apabila mereka bertaubat maka jangan kalian perangi kecuali yang memerangi kalian. Dari Ikrimah, Ia berkata: yang dimaksud dengan orang-orang yang zalim disini adalah yang enggan mengatakan Laa Ilaaha Illa Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "193. Dan perangilah orang-orang musyrik sampai mereka berhenti menyiksa dan memfitnah agama orang mukmin. Dan ketaatan menjadi murni kepada Allah saja. Jika mereka berhenti memerangimu, maka tidak ada permusuhan kecuali terhadap orang-orang yang menzalimi diri sendiri dengan berpegang teguh pada kesyirikan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perangilah mereka sampai tidak ada lagi fitnah} kemusyrikan dan usaha menghalangi orang-orang muslim terhadap agamanya {dan agama hanya bagi Allah semata.} dan agama yang nyata dan mulia itu adalah agama Allah {Jika mereka berhenti, maka tidak ada (lagi) permusuhan, kecuali terhadap orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "193. Kemudian Allah menyebutkan maksud dari berperang dijalanNya, bahwa tujuannya bukanlah menumpahkan darah kaum kafir dan mengambil harta mereka, akan tetapi maksud dari peperangan dijalan Allah adalah agar “agama hanya bagi Allah,” sehingga agama Allah tinggi dari seluruh agama-agama selainnya, dan juga menolak segala perkara yang bertentangan dengannya dari kesyirikan dan yang lainnya, dan itulah yang dimaksudkan dengan fitnah dalam ayat tersebut. Apabila maksud ini telah terpenuhi, maka tidak ada lagi pembunuhan dan tidak pula peperangan. “Dan jika mereka berhenti dari memusuhi kamu,” maksudnya, dari memerangi kalian di Masjidil Haram, “maka tidak ada lagi permusuhan kecuali bagi orang-orang yang zhalim.” Maksudnya, tidak ada permusuhan bagi kalian atas mereka kecuali orang yang zhalim diantara mereka, karena ia berhak diberikan hukuman sesuai dengan kadar kedholimannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَيَكُونَ ٱلدِّينُ لِلَّهِۖ } Wa yakunaddinu lillah : Dengan kondisi tidak ada yang beribadah kepada selain Allah. { فَلَا عُدۡوَٰنَ } Falaa ‘udwana : Tidak ada permusuhan dengan pembunuhan dan peperangan kecuali kepada orang-orang yang zhalim. Sedangkan bagi orang yang memeluk Islam, tidak akan diperangi. Makna ayat: Adapun ayat yang keempat (193) yaitu firman Allah Ta’ala,”Dan perangilah mereka itu sehingga tidak ada fitnah lagi.” Ayat ini menegaskan mengenai hukum yang telah disebutkan sebelumnya, yang berisi perintah untuk memerangi kaum musyrikin yang memerangi kaum muslimin terus menerus sehingga tidak tersisa di Mekah, orang-orang yang menganiaya dan menyebarkan fitnah (kesyirikan) di sana, sehingga agama Islam seluruhnya hanya untuk Allah dan tidak menyembah selain Nya. Firman Allah,”Apabila mereka berhenti dari kesyirikan dengan menyerakan diri (masuk Islam) dan mengesakan Allah Ta’ala maka tahanlah sikap kalian, janganlah kalian memerangi mereka karena tidak ada permusuhan.” Kecuali kepada orang-orang zhalim, yang mana setelah masuk Islam mereka bukan lagi termasuk orang-orang zhalim. Pelajaran dari ayat: • Agama Islam menghapus dosa-dosa yang dilakukan sebelum masuk Islam. Berdasarkan firman Allah Ta’ala; “Maka jika mereka menghentikan permusuhan, maka sesungguhnya Allah Maha pengampun dan Maha Penyayang.” (QS Al-Baqarah : 192) • Kewajiban berjihad yang mana termasuk fadhu kifayah saat terdapat mukmin yang tertindas keislamannya atau mandapatkan fitnah dalam agamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 193: Allah memerintahkan orang-orang beriman agar memerangi orang – orang kafir sampai habis kuasa mereka dan tidak membuat fitnah pada orang-orang muslim akan agamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sampai tidak ada lagi penindasan kepada kaum muslim dan tidak ada lagi kemusyrikan. Hanya Allah Subhaanahu wa Ta'aala saja yang disembah. Inilah tujuan dari peperangan, yakni bukan untuk menumpahkan darah dan mengambil harta mereka, tetapi agar agama Allah-lah yang nampak dan tidak ada lagi yang menghalanginya seperti syirk dan lainnya. Oleh karena itu, jika mereka berhenti dari kekafiran dan masuk Islam, maka tidak boleh diperangi atau dibunuh. Yakni orang-orang yang tetap kafir lagi memusuhi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 193",
    "description": "Dan perangilah mereka itu sampai tidak ada lagi fitnah, yakni hingga keadaan kondusif untuk menciptakan perdamaian dengan berakhirnya teror, rintangan dan gangguan keamanan dan ketertiban, dan agama hanya bagi Allah semata sehingga setiap orang bisa menjalankan agama dengan tenang. Jika mereka berhenti dari berbuat teror, gangguan keamanan dan ketertiban, maka tidak ada lagi alasan bagi umat islam untuk menampakkan permusuhan di antara umat manusia kecuali terhadap orang-orang zalim, yakni orang-orang yang tidak memiliki tekad untuk berdamai dengan kaum muslim. Bulan haram dengan bulan haram. Jika umat islam diserang oleh orang-orang kafir pada bulan-bulan haram, yaitu zulkaidah, zulhijah, muharam, dan rajab, yang sebenarnya pada bulan-bulan itu tidak boleh berperang, maka diperbolehkan membalas serangan itu pada bulan yang sama. Dan terhadap sesuatu yang dihormati berlaku hukum kisas. Kaum muslim menjaga kehormatan tanah, tempat, dan keadaan yang dimuliakan Allah seperti bulan haram, tanah haram, yakni mekah, dan keadaan berihram untuk umrah dan haji dengan melaksanakan hukum kisas serta memberlakukan dam (denda) bagi yang melanggar larangan pada waktu berihram, baik untuk umrah maupun haji. Oleh sebab itu barang siapa menyerang kamu, maka seranglah dia setimpal dengan serangannya terhadap kamu. Jadi, tindakan kaum muslim memerangi orang-orang musyrik pada bulan yang diharamkan Allah itu merupakan balasan setimpal atas sikap mereka yang memulai menyerang kaum muslim pada bulan yang diharamkan untuk berperang. Kaum muslim berada pada posisi membela diri dan membela kehormatan agama. Bertakwalah kepada Allah dengan melaksanakan apa yang diwajibkan dan menjauhi apa yang diharamkan, dan ketahuilah bahwa keridaan dan kasih sayang Allah beserta orang-orang yang bertakwa setiap waktu."
  }
]