[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Peperangan yang kalian lancarkan -wahai kaum Mukminin-, untuk memerangi kaum musyrikin pada bulan yang diharamkan Allah untuk berperang, itu sekedar merupakan pembalasan peperangan yang mereka lancarkan kepada kalian pada bulan suci. Dan orang yang berbuat melampaui batas yang diharamkan Allah yang terkait tempat dan waktu, maka dia dihukum dengan tindakan yang serupa dengan perbuatannya. Maka barang siapa berbuat aniaya terhadap kalian dengan memerangi atau tindakan lainnya, maka timpahkanlah padanya hukuman yang serupa dengan tindakan kejahatannya itu. dan tidak ada dosa atas kalian dalam hal itu, karena merekalah yang memulai melakukan permusuhan. Dan takutlah kalian kepada Allah, dan janganlah kalian melampaui batas kesamaan dalam hukum (mereka). Dan ketahuilah bahwa sesungguhnya Allah bersama dengan orang-orang yang bertakwa yang taat kepadanya dengan menjalankan perkara-perkara yang diwajibkan Nya dan menjauhi larangan-larangan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "194. Bulan haram di saat Allah memberi kalian kesempatan untuk masuk ke tanah suci (Makkah) dan menunaikan ibadah umrah pada tahun ke-7 (Hijriyah) adalah pengganti dari bulan haram ketika orang-orang musyrik menghalang-halangi kalian dari tanah suci pada tahun ke-6 (Hijriyah). Hal-hal yang dihormati, seperti kehormatan tanah suci, bulan suci, dan ihram di dalamnya, berlaku hukum kisas terhadap orang-orang yang melakukan penyerangan di dalamnya. Siapa melakukan penyerangan pada waktu itu, maka balaslah ia dengan balasan yang setara dengan perbuatannya, tetapi jangan melampaui batas kesetaraan. Karena sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas-batas-Nya. Takutlah kalian kepada Allah dalam melampaui batas yang diizinkan-Nya. Dan ketahuilah bahwa Allah senantiasa memberikan bimbingan dan dukungan kepada orang-orang yang takut kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "194. Dan jika ada yang memerangi kalian pada bulan-bulan haram -Dzul Qa’dah, Dzul Hijjah, Muharram, dan Rajab- maka perangilah mereka dalam bulan-bulan itu. Demikianlah aturan pada setiap hal-hal yang disucikan dalam agama baik itu dari sisi tempat, waktu, atau lainnya; sebab balasan sesuatu sesuai dengan perbuatannya, barangsiapa yang membunuh orang yang tidak bersalah maka hukuman baginya adalah dibunuh, dan orang yang dizalimi diberikan hak untuk membalas sesuai kezaliman yang dia terima. Maka takutlah kalian dari melanggar hukum-hukum Allah, dan ketahuilah bahwa Allah bersama orang-orang yang bertakwa dengan bantuan dan pertolongan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "194. الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ (Bulan haram dengan bulan haram) Yakni apabila mereka memerangi kalian di bulan-bulan haram dan menghinakan kemuliaan bulan-bulan tersebut maka perangilah mereka juga di bulan-bulan haram sebagai balasan bagi mereka dan imbalan bagi perbuatan mereka. وَالْحُرُمٰتُ قِصَاصٌ (dan pada sesuatu yang patut dihormati, berlaku hukum qishaash) (الحرمة) adalah hal yang dilarang oleh syari’at untuk dilanggar; dan apabila ada yang dizalimi harta atau badannya maka balaslah dengan balasan yang setara tanpa melebihi yang menimpa dia dan tanpa melakukan hal yang diharamkan, dan ini adalah pendapat Imam Syafi’I dan lainnya. Namun sebagian lain berpendapat bahwa masalah qishash hanya dilaksanakan oleh hakim, begitu juga dengan masalah yang berhubungan dengan harta. Akan tetapi pendapat pertama lebih kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "194. Melanggar penghormatan terhadap bulan haram itu diberi balasan yang serupa, jadi barangsiapa memerangi kalian di dalam bulan itu, maka perangilah pula dengan balasan yang serupa. Dan bulan-bulan haram itu ada 4, yaitu Dzaulqa’dah, Dzulhijjah, Muharram, dan Rajab. Dan Al-hurumat (setiap sesuatu yang harus dihormati, dijaga dan tidak diboleh dilanggar) itu balasannya serupa dengan pelanggarannya. Dan balasannya itu berupa tindakan. Dan barangsiapa memperbolehkan peperangan di dalamnya, maka diperbolehkan untuk membunuh dan mengambil hartanya. Dan bagi orang yang melakukan penyerangan itu balasan serangan yang serupa yang terjadi pada harta dan tubuhnya tanpa adanya kezaliman dan larangan dalam balasan itu. Dan ketahuilah sesungguhnya Allah itu bersama orang-orang yang bertakwa dengan memberi bantuan dan pertolongan bagi mereka Qatadah menyebutkan hal yang disebutkan oleh Ath-Thabari bahwa ayat ini diturunkan untuk membalas orang-orang musyrik terkait perjanjian Hudaibiyah ketika mereka melarang nabi SAW dan para sahabatnya untuk memasuki Mekah pada bulan Dzulqa’dah. Lalu Allah memindahkan kegiatan tersebut pada tahun selanjutnya dan menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bulan haram dengan bulan haram} Bulan haram yang mana ketika kalian memasuki Mekkah pada tahun ke tujuh (Hijriyyah) itu sama dengan bulan haram yang mana ketika kalian dilarang untuk memasuki Baitullah pada tahun ke enam (Hijriyyah) {dan sesuatu yang dihormati itu berlaku qisas.} setiap sesuatu yang dihormati itu berlaku keserupaan ketika hal tersebut dilanggar {Maka siapa saja yang menyerang kalian, seranglah dia seperti serangannya terhadap kalian. Bertakwalah kepada Allah dan ketahuilah bahwa Allah bersama orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "194. Allah berfirman, “Bulan haram dengan bulan haram,” kemungkinan maksudnya adalah apa yang terjadi dari tindakan kaum musyrikin dalam menghalangi nabi dan para sahabat beliau pada tahun terjadinya perjanjian hudaibiyah dari memasuki Mekah dan mereka memberikan ketetapan untuk nabi beserta para sahabatnya untuk dapat memasukinya pada tahun selanjutnya. Kejadian penghalangan dan ketetapan itu terjadi pada bulan haram yaitu bulan dzulqo’dah, maka hal ini dibalas dengan hal itu. Dengan demikian, hal ini menjadi sebuah hiburan bagi hati para sahabat dengan sempurna dan lengkapnya ibadah-ibadah mereka. Kemungkinan lain maknanya adalah, bahwasanya kalian bila memerangi mereka pada bulan haram, sesungguhnya mereka telah memerangi kalian pada bulan haram sedangkan mereka orang-orang yang melampaui batas, maka tidak ada dosa bagi kalian dalam hal itu. Atas dasar makna ini, maka firman Allah, “dan pada apa-apa yang dihormati berlaku hukum qisash” adalah dalam bentuk menyambungkan yang umum dengan yang khusus. Artinya, segala hal yang dihormati seperti bulan haram atau negeri Haram atau kegiatan ihram atau hal yang lebih umum dari itu yaitu segala apa yang diperintahkan oleh syariat untuk dihormati, barangsiapa yang lancang terhadapnya, maka sesungguhnya ia harus di qisas dengannya. Barangsiapa yang membunuh pada bulan haram, maka ia harus dibunuh, barangsiapa yang menjatuhkan kehormatan Negeri haram, dia harus dikenai hukum had hingga ia tidak memiliki lagi kehormatan, barangsiapa yang membunuh orang yang memberi kebaikan untuknya, maka ia dihukum bunuh karenanya, barangsiapa yang menyukainya atau memotong salah satu anggota tubuhnya, maka ia harus di qishash, barangsiapa yang mengambil harta orang lain yang dihormati, maka akan diambil dari hartanya sebagai gantinya. Akan tetapi, apakah orang yang memiliki hak tersebut boleh mengambil harta pelaku tersebut sesuai dengan haknya atau tidak? terjadi perbedaan pendapat diantara para ulama, dan yang paling kuat dari perbedaan itu adalah bahwa bila sebab dari hak tersebut sangat jelas seperti seorang tamu apabila orang lain tidak menjamunya, atau seorang istri dan keluarga apabila seseorang yang wajib memberikan nafkah tidak menunaikan nafkah kepada mereka maka boleh mengambil hartanya. Namun apabila penyebabnya tidak jelas seperti orang yang mengingkari hutang orang lain atau dikhianati dalam sebuah titipan atau hartanya dicuri dan semacamnya, maka ia tidak boleh mengambil hartanya sebagai timbal-balik untuknya. Ini adalah demi mempertemukan antara dalil-dalil tersebut. Oleh karena itu Allah berfirman untuk menegaskan dan menguatkan apa yang telah berlalu, “Oleh sebab itu barangsiapa yang menyerang mu maka seranglah ia seimbang dengan serangannya terhadapmu.” ini merupakan sebuah tafsiran tentang cara melakukan qishash, bahwasanya caranya harus rupa dalam menghadapi orang yang melampaui batas. Ketika jiwa pada umumnya tidak akan pernah berhenti pada batasannya apabila diberikan keringanan dalam hukuman karena tuntunannya untuk menuntut balas, maka Allah memerintahkan untuk konsisten terhadap ketakwaan kepadaNya, yaitu dengan berhenti pada batasan-batasanNya dan tidak melampauinya, dan Allah mengabarkan bahwasanya Dia “bersama orang-orang yang bertakwa,” Yakni dengan penolong, kemenangan, dukungan, dan taufikNya. Barangsiapa yang Allah bersama dengannya, pastilah ia memperoleh kebahagiaan yang abadi, dan barangsiapa yang tidak konsisten terhadap ketakwaan, pastilah akan berpaling darinya dan menghinakannya lalu melemparkan kehinaan itu pada dirinya, hingga kehancuran lebih dekat kepadanya daripada urat lehernya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلشَّهۡرُ ٱلۡحَرَامُ } Asy-Syahrul Haram : Bulan yang diharamkan untuk berperang di dalamnya. Bulan-bulan haram ada empat, tiga di antaranya berurutan dan satunya sendiri. Tiga bulan yang berurutan adalah Dzulqa’dah, Dzulhijjah, dan Muharram. Keempatnyanya adalah bulan Rajab. { وَٱلۡحُرُمَٰتُ } Al-Hurumaat : Bentuk jamak dari hurmah (yang dimuliakan), seperti bulan haram, tanah haram, dan ihram. { أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِينَ } Annallaha ma’al muttaqin : Orang-orang yang bertakwah mereka adalah orang-orang beriman yang menjauhi segala bentuk kemaksiatan kepada Allah Ta’ala dan penyelisihan terhadap sunnah Nya dalam kehidupan. Makna Allah bersama mereka adalah Allah menunjuki jalannya, menolongnya, dan membantunya. Makna ayat : Pada ayat 194 masih dalam konteks ayat sebelumnya, yaitu memberi semangat kepada orang-orang beriman yang dimusuhi dan diperangi untuk memerangi musuh-musuh mereka, dan mengajarkan kepada mereka bahwa orang yang memerangi mereka di bulan haram, maka hendaknya mereka membalas memeranginya di bulan haram itu juga. Siapa saja yang memerangi mereka di tanah haram, maka balaslah perangi mereka di tanah haram, dan siapa saja memerangi mereka dalam keadaan ihram, maka balaslah perangi mereka disaat berihram. Beginilah seharusnya bahwa di dalam sesuatu yang dihormati itu, terdapat qishash dan kesetaraan di antara mereka. Apabila ada yang melampaui batas maka balaslah semisal dengan perbuatan mereka itu. Lantas Allah Ta’ala memerintahkan mereka untuk bertaqwa kepada Nya dan memberitahukan bahwa Dia bersama mereka selama mau bertaqwa dengan memberikan bimbingan, bantuan, dan pertolongan. Pelajaran dari ayat : • Anjuran untuk memuliakan bulan-bulan haram dan seluruh hal yang patut untuk dihormati. • Diperbolehkan adanya pembalasan dan pemberian hukuman kepada orang yang melampaui batas, dengan balasan yang seimbang sebagaimana perbuatannya. • Membalas permusuhan dan perlakukan dari orang yang zhalim lagi melampaui batas dengan perbuatan zhalim dan melampaui batas yang semisal. • Ma’iyyatullah (kebersamaan Allah) bagi orang-orang yang beriman, bertaqwa, dan berbuat ihsan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 194: Allah menjelaskan bahwasannya berperangnya kalian oleh orang-orang musryik dibulan haram maka perangilah mereka dibulan tersebut, diperbolehkan bagi mereka karena mereka adalah musuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalau umat Islam diserang di bulan haram, yang sebenarnya di bulan itu tidak boleh berperang, maka diperbolehkan membalas serangan itu di bulan itu juga. Hal itu, karena merekalah yang memulai lebih dulu. Maksudnya adalah: bulan Haram (bulan Zulkaidah, Zulhijjah, Muharram dan Rajab), tanah Haram (Mekah) dan ihram, atau lebih umum lagi, yaitu mencakup semua perkara yang diperintahkan syara' untuk dihormati. Oleh karena itu, barangsiapa yang berani lancang teradapnya, maka diqishas. Siapa saja yang menyerang di bulan haram, maka diperangi lagi, siapa saja yang menodai tanah haram, maka ditegakkan had terhadapnya, siapa saja yang membunuh orang yang sekufu' atau setaraf ddengannya maka dibunuh lagi, siapa saja yang melukai orang yang dihormati jiwanya atau memotong anggota tubuhnya, maka diadakan qishas, dan siapa saja yang mengambil harta orang lain yang dihormati hartanya, maka diambil pula hartanya sebagai gantinya. Namun apakah pemilik hak berhak mengambil hartanya seukuran haknya atau tidak? Dalam hal ini ada khilaf di antara ulama, yang rajih adalah jika sebabnya zhahir (nampak) misalnya tamu, ketika orang lain tidak menjamunya atau istri ketika ia tidak diberi nafkah, maka ia boleh mengambil harta itu. Ssebaliknya, jika sebabnya tersembunyi, misalnya orang yang menyangkal hutang orang lain atau mengkhianati barang titipan atau melakukan pencurian, maka dalam hal ini tidak boleh baginya mengambil hartanya sebagai ganti berdasarkan hasil jama' (kompromi) dari dalil-dalil. Oleh karena itu, jangan membalas lebih. Dengan memberikan pertolongan dan kemenangan-Nya. Sebaliknya, orang-orang yang tidak bertakwa, maka Allah akan membiarkannya, menyerahkan masalahnya kepada dirinya sendiri, sehingga dirinya mudah binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 194",
    "description": "Bulan haram dengan bulan haram. Jika umat islam diserang oleh orang-orang kafir pada bulan-bulan haram, yaitu zulkaidah, zulhijah, muharam, dan rajab, yang sebenarnya pada bulan-bulan itu tidak boleh berperang, maka diperbolehkan membalas serangan itu pada bulan yang sama. Dan terhadap sesuatu yang dihormati berlaku hukum kisas. Kaum muslim menjaga kehormatan tanah, tempat, dan keadaan yang dimuliakan Allah seperti bulan haram, tanah haram, yakni mekah, dan keadaan berihram untuk umrah dan haji dengan melaksanakan hukum kisas serta memberlakukan dam (denda) bagi yang melanggar larangan pada waktu berihram, baik untuk umrah maupun haji. Oleh sebab itu barang siapa menyerang kamu, maka seranglah dia setimpal dengan serangannya terhadap kamu. Jadi, tindakan kaum muslim memerangi orang-orang musyrik pada bulan yang diharamkan Allah itu merupakan balasan setimpal atas sikap mereka yang memulai menyerang kaum muslim pada bulan yang diharamkan untuk berperang. Kaum muslim berada pada posisi membela diri dan membela kehormatan agama. Bertakwalah kepada Allah dengan melaksanakan apa yang diwajibkan dan menjauhi apa yang diharamkan, dan ketahuilah bahwa keridaan dan kasih sayang Allah beserta orang-orang yang bertakwa setiap waktudan infakkanlah hartamu di jalan Allah dengan menyalurkannya untuk menyantuni fakir miskin dan anak yatim, memberi beasiswa, membangun fasilitas umum yang diperlukan umat islam seperti rumah sakit, masjid, jalan raya, perpustakaan, panti jompo, rumah singgah, dan balai latihan kerja. Dan janganlah kamu jatuhkan diri sendiri ke dalam kebinasaan dengan tangan sendiri dengan melakukan tindakan bunuh diri dan menyalurkan harta untuk berbuat maksiat. Tentu lebih tepat jika harta itu disalurkan untuk ber-buat baik bagi kepentingan orang banyak, dan berbuat baiklah. Sungguh, Allah menyukai orang-orang yang berbuat baik dengan ikhlas."
  }
]