[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan teruslah kalian -wahai orang-orang Mukmin-, menginfakkan harta demi membela agama Allah dan jihad di jalan Nya. Dan janganlah kalian menjerumuskan diri-diri kalian ke dalam tempat-tempat kebinasaan dengan tidak berjihad dijalan Allah dan meninggalkan infak padanya. Dan berbuat baiklah kalian dalam berinfak dan taat kepada Allah, dan jadikanlah amal shalih kalian seluruhnya murni karena mengharap wajah Allah. Sesungguhnya Allah menyukai orang-orang yang ikhlas dan berbuat baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "195. Belanjakanlah harta kalian dalam ketaatan kepada Allah, seperti jihad dan lain-lain. Dan janganlah kalian menjerumuskan diri kalian sendiri ke dalam kebinasaan karena meninggalkan jihad dan enggan mengeluarkan dana untuk kepentingan jihad; atau dengan cara menjerumuskan diri sendiri ke dalam tindakan yang dapat mencelakakan kalian. Berbuat baiklah kalian dalam masalah ibadah, muamalah dan akhlak. Sesungguhnya Allah mencintai orang-orang yang berbuat baik dalam semua urusannya. Maka Allah memberikan pahala yang besar kepada mereka dan membimbing mereka ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "195. Karena berperang di jalan Allah membutuhkan harta dan biaya, maka Allah memerintahkan untuk berinfak demi menolong agama Allah dan membantu perjuangan jihad di jalan-Nya. Dan Allah juga melarang dari membahayakan diri yang dapat menjerumuskan dalam kematian akibat kebakhilan dan keengganan berinfak sehingga melemahkan perjuangan jihad di jalan Allah. Maka berinfaklah dengan baik dan ikhlaslah dalam beramal, sungguh Allah Mencintai orang-orang yang berbuat baik kepada diri sendiri dan umatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "195. وَأَنفِقُوا۟ فِى سَبِيلِ اللَّـهِ (Dan belanjakanlah (harta bendamu) di jalan Allah) Yakni dalam jihad fii sabilillah. وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ ۛ (dan janganlah kamu menjatuhkan dirimu sendiri ke dalam kebinasaan) Yakni jangan kalian menyerahkan diri kepada hal-hal yang menyebabkan kebinasaan, akan tetapi rencanakanlah untuk kalian sebab-sebab keselamatan. Dan termasuk dari kebinasaan adalah berdiam diri menjaga harta benda untuk memperbaikinya dan meninggalkan jihad fii sabilillah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kebaikan senantiasa membahagian hati, dan melapangkan dada, dan mendatangkan kenikmatan, dan menolak musibah, adapun meninggalkannya adalah kesalahan dan menimbulkan kesusahan, dan menghalangi datangnya rezeki, maka orang pengecut adalah yang meninggalkan kebaikan dengan anggota badannya, sedangkan orang kikir adalah yang meninggalkan kebaikan dengan hartanya, padahal Allah telah berfirman : { وَأَحْسِنُوا ۛ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ }. 2 ). Jika orang-orang beriman mengeluarkan harta mereka dan tidak ragu dan takut sedikitpun, kemudian mereka mengahadapi suatu masalah setelah itu maka Allah menjadi penolong mereka dan menjadi pendukung atas apa yang tidak mampu mereka raih, dan Allah telah menolong kaum muslimin ketika perang badr berkecamuk dan mereka ketika itu dalam keadaan lemah, tetapi pada hari itu mereka sedikitpun tidak mengurangi kebaikan mereka, adapun orang-orang yang mengabisi harta kaum muslimin atas dasar nafsu mereka, dan menolak untuk menegluarkan harta ketika situasi sedang tenang, kemudian mereka memohon kepada Allah pertolongan tatkala musibah menyerang, sesungguhnya mereka adalah orang-orang yang sombong; maka Allah pun menjadikan musuh-musuh menguasai mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "195. Berinfaklah di jalan Allah yaitu dengan berjihad, dan janganlah kalian suguhkan diri kalian kepada kehancuran karena bakhil dalam menginfakkan harta, berjihad dan tidak mau memperbaiki harta. Salurkanlah infak kalian untuk ketaatan kepada Allah. Sesungguhnya Allah akan memberi pahala orang-orang baik yang mengorbankan hartanya untuk taat kepada Allah. Asy-Sya’biy berkata: “Ayat ini turun untuk kaum Anshar. Mereka menahan diri untuk berinfak di jalan Allah Swt. Lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berinfaklah di jalan Allah} infakkanlah harta kalian dalam ketaatan kepada Allah berupa jihad dan hal lainnya {janganlah jerumuskan diri kalian} janganlah kalian menghempaskan diri kalian {ke dalam kebinasaan} ke dalam kehancuran dengan meninggalkan jihad dan infak untuk jihad {dan berbuat baiklah. Sesungguhnya Allah menyukai orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "195. Allah memerintahkan hamba-hambaNya untuk berinfak dijalanNya, yakni mengeluarkan harta pada jalan-jalan yang menyampaikannya kepada Allah, yaitu segala Jalan kebaikan seperti sedekah kepada orang miskin atau kerabat dan berinfak kepada orang yang wajib diberikan nafkah. Dan yang paling besar dari hal itu dan paling pertama termasuk di dalamnya adalah berinfak dalam jihad dijalan Allah, karena sesungguhnya berinfak dalam jihad adalah sebuah jihad dengan harta, dan hal itu adalah sebuah kewajiban seperti jihad dengan badan. Dengan berinfak, banyak sekali kemaslahatan besar yang didapat, yaitu membantu dalam menguatkan kaum muslimin dan menghinakan kesyirikan serta para pengikutnya, dan dalam menegakkan agama Allah serta meninggikannya. Jihad dijalan allah tidaklah akan berjalan kecuali dengan penopang biaya, dan biaya itu bagaikan ruh baginya, yang mana jihad tidak akan ada tanpa nya, dan meninggalkan berinfak dijalan Allah adalah tindakan menghilangkan jihad, penguasa musuh-musuh serta gencarnya ketamakan mereka, Maka Firman Allah, “Dan janganlah Kamu menjatuhkan dirimu sendiri kedalam kebinasaan,” adalah penjelasan illat sebab bagi hal tersebut. Tindakan menjatuhkan diri sendiri dalam kebinasaan itu terpulang pada dua perkara; meninggalkan perkara yang diperintahkan kepada hamba apabila tindakan meninggalkannya itu mengharuskan atau mendekatkan kepada rusaknya tubuh atau jiwa, dan melakukan perbuatan yang menyebabkan hilangnya jiwa atau ruh. Maka perkara ini meliputi banyak sekali hal-hal lainnya. Diantaranya adalah meninggalkan jihad dijalan Allah, atau tidak berinfak padanya, yang menyebabkan penguasaan musuh. Termasuk juga seorang yang menjatuhkan dirinya dalam peperangan atau perjalanan yang menakutkan, atau di tempat binatang buas atau ular, atau memanjat pohon atau bangunan yang berbahaya, atau memasuki sesuatu yang mengandung bahaya dan semacamnya; hal seperti ini dan yang semacamnya adalah diantara yang menjatuhkan diri kepada kehancuran. Dan diantara hal itu juga adalah hidup dengan kemaksiatan terhadap Allah dan berputus asa dari bertaubat kepada Allah. Juga Meninggalkan apa yang diperintahkan oleh Allah dari kewajiban-kewajiban, dimana tindakan meninggalkannya itu akan menyebabkan kehancuran bagi jiwa maupun agama. Dan karena berinfak dijalan Allah adalah sebuah bentuk diantara bentuk-bentuk kebajikan, maka Allah memerintahkan untuk berbuat kebajikan secara umum seraya berfirman, “dan berbuat baiklah karena sesungguhnya Allah menyukai orang-orang yang berbuat baik.” Ayat ini mencakup seluruh bentuk kebajikan yang tidak dibatasi oleh sesuatupun, maka termasuk di dalamnya adalah kebajikan dengan harta sebagaimana yang telah berlalu. Termasuk juga didalamnya kebajikan dengan jabatan yaitu dengan memberikan syafaat (menjadi fasilitator untuk menyelesaikan hajat masyarakat bawah ke atasan) atau semacamnya, termasuk juga kebajikan dengan cara menyuruh kepada kebaikan dan melarang dari yang munkar, serta mengajarkan ilmu yang bermanfaat. Termasuk juga memenuhi kebutuhan kebutuhan manusia seperti bantuan atas kesulitan-kesulitan mereka, menghilangkan kesusahan kesusahan mereka, menjenguk yang sakit, menghadiri jenazah mereka, menunjuki orang yang sesat diantara mereka, membantu pekerjaan orang yang bekerja, mengerjakan pekerjaan orang yang tidak ahli dalam pekerjaannya, dan semacamnya yang termasuk kebajikan yang diperintahkan oleh Allah, dan termasuk dari kebajikan juga adalah berbuat baik dalam beribadah kepada Allah, yaitu seperti yang disebutkan oleh Nabi. “Yaitu kamu menyembah Allah seolah-olah kamu melihatnya namun bila kamu tidak dapat melihatnya maka sesungguhnya dia melihatmu.” Barangsiapa yang memiliki sifat seperti itu, niscaya ia termasuk orang-orang yang dikatakan oleh Allah tentang mereka : \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.\" Quran surat Yunus ayat 26 Allah akan bersamanya; dengan membimbingnya, menunjukinya, dan menolongnya dalam segala perkara."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلتَّهۡلُكَةِ } At-Tahlukah : Al-Halakah dan Halak maknanya sama, yaitu kebinasaan. { الإحسان } Al-Ihsan : Konsisten dalam ketakwaan dan menyucikannya dari kotoran kesyirikan, serta berbuat amalan kebajikan. Makna ayat: Pada ayat 195 Allah Ta’ala memerintahkan kepada mereka menginfaqkan hartanya untuk jihad fi sabilillah, mempersiapkan dan memberikan fasilitas kepada rombongan pasukan dan prajurit, dan Allah melarang mereka untuk pelit, tidak mau berinfaq di jalan Allah yang mana itu merupakan jihad. Kapan saja mereka meninggalkan infaq di jalan Allah dan meninggalkan jihad, mereka seperti orang yang melemparkan dirinya ke dalam kebinasaan. Karena musuh senantiasa menunggu dan melihat kelengahan, ketika mereka hanya duduk dan meninggalkan jihad, maka musuh akan menyerang dan memerangi sehingga kaum muslimin kalah dan hancur. Kemudian Allah Ta’ala memerintahkan untuk berbuat ihsan dalam semua perbuatan. Berbuat ihsan artinya berbuat secara profesional dan bagus, serta menjauhkan dari bentuk kecacatan dan kerusakan. Lantas Allah Ta’ala menjanjikan apabila mereka berbuat ihsan dalam pekerjaannya akan dibimbing dan ditolong oleh Nya. Allah berfirman,”Dan berbuat baiklah sesungguhnya Allah mencintai orang-orang yang berbuat baik.” Siapa yang dicintai oleh Allah maka Allah akan memuliakan, menolong, dan tidak menghinakan serta meremehkannya. Pelajaran dari ayat: • Keutamaan ihsan karena kecintaan Allah kepada orang-orang yang berbuat kebaikan (ihsan)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 195: Allah memerintahkan berinfaq dengan harta dijalan Allah menolong agama Allah dan meninggikan kalimatullah maka barangsiapa yang meninggalkan jihad maka sungguh kebinasaan menghampiri dirinya maka perbaguslah amalan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Hudzaifah tentang ayat, \"Wa anfiquu fii sabiilillah walaa tulquuu bi-aydiikum ilat tahlukah\" ia berkata, \"Ayat tersebut turun tentang nafkah.\" Imam Tirmidzi meriwayatkan dari Aslam Abu Imran At Tujaibiy ia berkata, \"Kami ketika berada di kota Romawi, penduduk Roma mengerahkan pasukan besar untuk melawan kami, lalu kaum muslimin yang jumlahnya sama besar dengan mereka atau lebih keluar untuk menghadapi mereka. Pasukan Mesir diketuai oleh Ukbah bin 'Amir, sedangkan pasukan yang lain diketuai Fudhalah bin 'Abiid, kemudian ada seorang dari kaum muslimin yang masuk ke barisan musuh, lalu ada yang berteriak dan berkata, \"Subhaanallah! Ia menjatuhkan dirinya ke dalam kebinasaan.\" Maka Abu Ayyub berkata, \"Wahai manusia! Sesungguhnya kamu mena'wil ayat ini dengan ta'wil tersebut, padahal ayat tersebut turun mengenai kami kaum Anshar ketika Allah telah memenangkan Islam dan memperbanyak pembelanya, lalu sebagian kami berkata kepada yang lain secara bisik-bisik tanpa memperhatikan Rasulullah shallallahu 'alaihi wa sallam, \"Sesungguhnya harta kita telah habis, dan Allah telah menguatkan Islam serta memperbanyak pembelanya, apa tidak sebaiknya kita mengurus harta kita dan memperbaiki yang habis daripadanya.\" Maka Allah Tabaaraka wa Ta'aala menurunkan kepada Nabi-Nya shallallahu 'alaihi wa sallam untuk menolak perkataan kami, \"Wa anfiquu fii sabiilillah walaa tulquuu bi-aydiikum ilat tahlukah\". Oleh karena itu, kebinasaan tersebut adalah ketika sibuk mengurus harta dan meninggalkan perang, maka Abu Ayyub senantiasa tampil di jalan Allah sehingga Beliau wafat di Romawi.\" (Hadits ini hasan gharib shahih). Thabrani meriwayatkan dalam Al Kabir dan Al Awsath dari Nu'man bin Basyir tentang ayat, \"Walaa tulquuu bi-aydiikum ilat tahlukah\", ia berkata, \"Terkadang ada seorang yang berdosa berkata, \"Mungkin Allah tidak mengampuniku,\" maka Allah menurunkan ayat \"Walaa tulquuu bi-aydiikum ilat tahlukah…dst.\" (Hadits ini para perawinya adalah para perawi kitab shahih). Di antara kedua hadits tersebut, yang lebih jelas adalah hadits pertama, karena bagian pertama ayat tersebut diawali dengan perintah berinfak, namun demikian kedua-duanya bisa dipakai. Oleh karena itu, ayat tersebut bisa mengena kepada orang-orang yang meninggalkan jihad dan bersikap bakhil, demikian juga mengena kepada orang yang berbuat dosa dan mengira bahwa Allah tidak mengampuni dosanya. Untuk membela agama Allah dan berjihad di jalan-Nya, karena jihad fii sabilillah tidak bisa tegak tanpa adanya infak. Infak merupakan ruhnya, dan ketidakadaannya dapat menghilangkan jihad dan menjadikan musuh lebih kuat. Termasuk \"jalan Allah\" lainnya adalah jalan-jalan kebaikan lainnya seperti bersedekah kepada orang miskin, kerabat dan kepada orang yang ditanggungnya. Menjatuhkan diri dalam kebinasaan itu terbagi dua: - Meninggalkan perintah Allah, jika dalam perintah itu dapat mengakibatkan atau bisa mengarah kepada binasanya badan atau ruh, dan dengan mengerjakan sebab yang dapat membawa kepada binasanya badan atau ruh. Termasuk ke dalam hal ini, meninggalkan jihad fii sabilillah, tidak menginfakkan harta untuk itu dan membawa dirinya ke tempat-tempat berbahaya (misalnya mendatangi tempat di mana di sana banyak binatang buas dan ular, menaiki bangunan dan pepohonan yang tinggi dan berbahaya) dsb. - Mengerjakan maksiat, berputus asa dari tobat dan meninggalkan kewajiban, di mana semua itu dapat membinasakan ruh dan agamanya. Maksudnya: \"Berbuat ihsanlah dalam berinfak dan dalam semua ketaatan serta jadikanlah semua amalmu ikhlas karena Allah Azza wa Jalla.\" Termasuk ihsan pula adalah membantu orang lain dengan jah/kedudukan yang dimilikinya (biasa disebut \"syafa'at\"), beramr ma'ruf dan bernahi munkar, mengajarkan ilmu yang bermanfa'at, memenuhi kebutuhan manusia, menghilangkan derita yang menimpa mereka, menjenguk orang yang sakit, mengiringi jenazah, membimbing orang yang tersesat, membantu orang yang mengerjakan sesuatu, mengajarkan keterampilan, dan berbuat ihsan dalam beribadah seperti yang disebutkan Nabbi shallallahu 'alaihi wa sallam dalam sabdanya, \"Ihsan adalah kamu beribadah kepada Allah seakan-akan kamu melihat-Nya, jika kamu tidak merasa begitu maka ketahuilah bahwa Dia melihatmu.\" (HR. Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 195",
    "description": "Dan infakkanlah hartamu di jalan Allah dengan menyalurkannya untuk menyantuni fakir miskin dan anak yatim, memberi beasiswa, membangun fasilitas umum yang diperlukan umat islam seperti rumah sakit, masjid, jalan raya, perpustakaan, panti jompo, rumah singgah, dan balai latihan kerja. Dan janganlah kamu jatuhkan diri sendiri ke dalam kebinasaan dengan tangan sendiri dengan melakukan tindakan bunuh diri dan menyalurkan harta untuk berbuat maksiat. Tentu lebih tepat jika harta itu disalurkan untuk ber-buat baik bagi kepentingan orang banyak, dan berbuat baiklah. Sungguh, Allah menyukai orang-orang yang berbuat baik dengan ikhlas. Dan sempurnakanlah ibadah haji dan umrah karena Allah dengan memenuhi syarat, wajib, rukun, maupun sunah-sunahnya dengan niat yang ikhlas semata-mata mengharapkan rida Allah, dalam keadaan aman dan damai, baik di perjalanan maupun di tempat-tempat pelaksanaan manasik haji. Tetapi jika kamu terkepung oleh musuh, dalam keadaan perang atau situasi genting sehingga tidak dapat melaksanakan manasik haji pada tempat dan waktu yang tepat, maka ada ketentuan rukhshah (dispensasi) dengan diberlakukannya dam (pengganti) sebagai berikut. Pertama, sembelihlah hadyu, yaitu hewan yang disembelih sebagai pengganti pekerjaan wajib haji yang ditinggalkan atau sebagai denda karena melanggar hal-hal yang terlarang mengerjakannya di dalam ibadah haji, yang mudah didapat, dan jangan kamu mencukur kepalamu sebagai tanda selesainya salah satu rangkaian ibadah haji sebelum hadyu sampai di tempat penyembelihannya dengan tepat. Kedua, jika ada di antara kamu yang sakit atau ada gangguan di kepalanya lalu dia bercukur sebelum selesai melaksanakan salah satu dari rangkaian manasik haji, maka dia wajib membayar fidyah atau tebusan yaitu dengan memilih salah satu dari berpuasa, bersedekah atau berkurban supaya kamu bisa memilih fidyah yang sesuai dengan kemampuan kamu. Ketiga, apabila kamu dalam keadaan aman, tidak terkurung musuh, dan tidak terkena luka, tetapi kamu memilih tamattu, yakni mendahulukan umrah daripada haji pada musim haji yang sama, maka ketentuannya adalah bahwa barang siapa mengerjakan umrah sebelum haji, dia wajib menyembelih hadyu yang mudah didapat di sekitar masjidilharam. Tetapi jika dia tidak mendapatkannya yakni tidak mampu dan tidak memiliki harta senilai binatang ternak yang harus disembelih, maka dia wajib berpuasa tiga hari dalam musim haji dan tujuh hari setelah kamu kembali ke tanah air. Itu seluruhnya sepuluh hari secara keseluruhan. Demikian itu, bagi orang yang keluarganya tidak ada, yakni tinggal atau menetap, di sekitar masjidilharam melainkan berdomisili jauh di luar mekah seperti kaum muslim indonesia. Bertakwalah kepada Allah dan ketahuilah bahwa Allah sangat keras hukuman-Nya bagi orang-orang yang tidak menaati perintah dan aturan-Nya."
  }
]