[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan laksanakanlah ibadah haji dan umrah dengan sempurna, murni karena mengharap wajah Allah. Apabila ada sesuatu penghambat yang menghalangi kalian untuk menyempurnakannya, setelah masuk keadaan ihram dengan keduanya, seperti adanya musuh dan menjadi sakit, maka kewajiban kalian adalah menyembelih sembelihan yang mudah kalian dapatkan seperti unta, sapi, atau kambing, guna mendekatkan diri kepada Allah. Supaya kalian dapat keluar dari kondisi ihram kalian dengan menggunduli rambut kepala atau memendekannya saja. Dan janganlah kalian menggunduli rambut kepala kalian ketika kalian mengalami hambatan ( untuk meneruskan manasik nya ) hingga orang-orang yang mengalami hambatan itu menyembelih hewan hadyu nya di tempat dia terhalang halangi oleh faktor itu. Kemudian dian menjadi dalam keadaan halal kembali dari ihromnya, sebagaimana nabi menyembelih unta nya di hudaybiyah, dengan menggundul rambut kepalanya. sedang orang yang tidak mengalami hambatan di jalan, dia tidak menyembelih hewan hadyunya, kecuali di wilayah tanah haram( kota suci) yang menjadi tempat halalnya pada hari raya, tanggal 10 dan hari-hari tasyrik setelahnya. Maka barangsiapa dari kalian mengalami sakit atau pada dirinya terdapat gangguan pada kepalanya yang membuatnya perlu menggunduli kepalanya, sedang dia dalam keadaan ihram, maka Ia boleh menggundulnya, dan wajib bayar fidyah, dengan cara berpuasa 3 hari, atau bersedekah kepada 6 orang miskin, untuk masing-masing orang miskin setengah sha dari makanan, atau menyembelih satu kambing untuk dibagikan kepada kaum fakir miskin di tanah haram. Dan apabila kalian berada dalam kondisi sehat wal afiat dan aman tentram, maka barangsiapa hendak mengerjakan nusuk tamattu dengan umroh dahulu sebelum ibadah haji ( pada bulan-bulan haji ) , yaitu dengan diperbolehkannya perkara-perkara yang terlarang bagi dirinya karena memasuki kondisi ihrom pasca umrohnya selesai, maka menjadi kewajibannya untuk menyembelih hewan hadyu. barang siapa tidak mendapatkan hewan hadyu yang disembelihnya, maka dia wajib berpuasa 3 hari di bulan bulan haji dan 7 hari ketika kalian selesai dari sebuah manasik haji dan kalian telah kembali kepada keluarga kalian. Itu adalah 10 hari yang sempurna yang harus dilalui dengan berpuasa. ewan hadyu dan yang menjadi konsekuensi dari tidak didapatkannya hewan hadyu berupa puasa adalah berlaku bagi orang-orang yang keluarganya tidak termasuk penduduk yang tinggal di daerah Masjidil Haram, dan takutlah kepada Allah perhatikanlah selalu menjaga pelaksanaan perintah perintah Nya dan menjauhi larangan-larangan Nya, dan ketahuilah bahwa sesungguhnya Allah itu Maha pedih siksaan Nya bagi orang yang melanggar perintah Nya dan melakukan perkara yang dilarang Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "196. Laksanakanlah haji dan umrah secara sempurna seraya memohon wajah Allah. Apabila kalian tidak kuasa menyempurnakannya karena sakit atau dicegah musuh, maka kalian harus menyembelih binatang hadyu yang bisa kalian dapatkan, baik berupa unta, sapi maupun kambing, agar kalian bisa bertahallul (melepaskan diri) dari ihram. Dan janganlah kalian mencukur atau memendekkan rambut sebelum binatang hadyu itu sampai ke tempat yang dihalalkan untuk menyembelihnya. Apabila seseorang dicegah masuk ke tanah haram, maka dia dapat menyembelihnya di tempat dia dicegah. Dan apabila dia dapat masuk ke tanah haram, dia harus menyembelihnya di tanah haram pada hari nahr (Idul Adha) dan hari-hari tasyrik. Siapa di antara kalian sakit atau terdapat gangguan di rambut kepalanya, seperti kutu rambut dan sejenisnya, lalu dia terpaksa mencukur rambutnya, maka tidak ada dosa baginya, tetapi dia wajib membayar fidyah karena tindakan itu, yaitu berupa puasa tiga hari, atau memberi makan enam orang miskin di tanah haram, atau menyembelih seekor kambing dan dibagikan kepada orang-orang miskin yang ada di tanah haram. Apabila kalian tidak dalam kondisi takut, maka siapa yang mengerjakan haji tamatuk, yaitu melaksanakan ibadah umrah di bulan-bulan haji dan menikmati hal-hal yang sebelumnya diharamkan waktu berihram sampai dia memakai ihram kembali untuk melaksanakan ibadah haji pada tahun itu juga, maka hendaklah dia menyembelih binatang hadyu yang bisa dia dapatkan, baik berupa seekor kambing, sepertujuh ekor unta atau sapi. Jika tidak mampu menyembelih binatang hadyu, maka sebagai gantinya dia harus berpuasa selama tiga hari di hari-hari haji, dan tujuh hari setelah pulang ke rumahnya, sehingga jumlahnya genap sepuluh hari. Melaksanakan haji tamatuk dengan kewajiban menyembelih hadyu atau puasa bagi yang tidak mampu hanya berlaku bagi selain penduduk tanah haram dan orang-orang yang tinggal di dekat tanah haram; karena mereka tidak memerlukan tamattuk. Keberadaan mereka di tanah haram membuat mereka cukup melaksanakan tawaf saja sebagai ganti melaksanakan tamatuk. Takutlah kamu kepada Allah dengan cara mengikuti ketentuan syariat-Nya dan menghormati batas-batasnya. Dan ketahuilah bahwa Allah itu Mahakeras hukumannya bagi orang yang melanggar perintah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "196. Dan laksanakanlah manasik haji dan umrah dengan menyempurnakan rukun-rukun dan syarat-syaratnya, dengan mengharap keridhaan Allah. Namun jika ada sesuatu yang menghalangi kalian untuk menyempurnakannya seperti musuh, penyakit, dan musibah, sedangkan kalian masih berihram; maka wajib bagi kalian menyembelih unta, sapi, atau kambing sesuai kemampuan kalian agar kalian dapat keluar dari keadaan berihram (tahallul). Dan janganlah kalian mencukur rambut kalian untuk keluar dari keadaan ihram sampai hewan sembelihan itu selesai di sembelih di tanah haram atau di tempat kalian terhalangi. Jika telah selesai, maka kalian boleh bertahallul. Dan barangsiapa yang sakit atau di kepalanya terdapat sesuatu yang memaksanya memotong rambut, maka boleh baginya memotong rambut, namun dia harus membayar fidyah -memilih antara puasa tiga hari, memberi makan enam orang miskin, atau menghadiahkan kambing kepada orang-orang fakir yang tinggal di tanah haram-. Jika kalian dalam keadaan sehat dan aman, kemudian menjalankan haji tamattu’ -bertahallul setelah umrah sehingga dibolehkan untuk menikmati apa yang boleh dinikmati orang yang tidak berihram seperti memakai parfum, bersetubuh dengan istri, dan lain sebagainya- atau menjalankan haji qiran, maka wajib baginya menyembelih hewan unta, sapi, atau kambing sesuai kemampuannya. Dan barangsiapa yang tidak memiliki harta untuk memberi hewan sembelihan maka wajib baginya berpuasa sepuluh hari -3 hari dilaksanakan pada bulan haji dan 7 hari dilaksanakan setelah selesai haji dan telah kembali ke tempat tinggalnya-, itulah puasa sepuluh hari sempurna yang wajib dilakukan. Hukum bertamattu’ dan menyembelih sembelihan ini diperuntukkan bagi orang yang bukan penduduk Makkah. Bertakwalah kepada Allah dalam menjalankan hukum-hukum-Nya, dan ketahuilah Allah Maha keras siksa-Nya bagi orang yang menyelisihi perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "196. وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ ۚ (Dan sempurnakanlah ibadah haji dan ‘umrah karena Allah) Yakni barang siapa yang memulai salah satu ibadah ini maka wajib baginya untuk menyelesaikan dan menyempurnakannya. Dan pendapat lain mengatakan, penyempurnaan haji dan umrah adalah dengan menjalankannya satu persatu dan tidak melakukannya dengan cara haji tamattu’ dan qiran. فَإِنْ أُحْصِرْتُمْ (Jika kamu terkepung) Yakni yang menjadi terhalang untuk menyempurnakan ibadah haji atau umrahnya akibat penyakit, musuh, atau lainnya. فَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ ۖ (maka (sembelihlah) korban yang mudah didapat) Yakni maka sembelihlah yang kalian mampu dari hewan ternak kemudian kembali menjadi halal (bukan berihram). Dan makna (الهدي) adalah apa yang dihadiahkan kepada Baitullah berupa unta, sapi, atau kambing yang disembelih di Makkah sebagai bentuk mendekatkan diri kepada Allah. Hasan al-Bashri berkata: al-Had’yu yang paling utama adalah dengan unta, dan yang pertengahan dengan sapi dan yang paling rendah adalah dengan kambing. وَلَا تَحْلِقُوا۟ رُءُوسَكُمْ حَتَّىٰ يَبْلُغَ الْهَدْىُ مَحِلَّهُۥ (dan jangan kamu mencukur kepalamu, sebelum korban sampai di tempat penyembelihannya) Ayat ini dimaksudkan bagi orang yang berihram tidak dibolehkan mencukur rambutnya sampai menyembelih al-Hadyu kalau dia memilikinya. فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ بِهِۦٓ أَذًى مِّن رَّأْسِهِۦ (Jika ada di antaramu yang sakit atau ada gangguan di kepalanya) Yakni berupa kutu rambut atau penyakit, apabila ia mau makai a boleh mencukur rambutnya akan tetapi harus membayar fidyah berupa memberi makan enam orang miskin atau menyembelih hadyu atau berpuasa tiga hari. فَإِذَآ أَمِنتُمْ (Apabila kamu telah (merasa) aman) Yakni apabila kalian berapa dalam keadaan aman dan tidak ada yang menghalangi untuk menyempurnakan haji atau umrahnya. فَمَن تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ (maka bagi siapa yang ingin mengerjakan ‘umrah sebelum haji) Yang dimaksud dengan Tamattu’ adalah dengan berihram umrah pada bulan-bulan haji kemudian bermukim di Makkah dalam keadaan halal (tidak berihram) sampai kemudian nanti kembali berihram dengan ihram haji dan dengan ini bagi mereka dibolehkan apa yang dilarang bagi orang yang berihram. فَمَا اسْتَيْسَرَ مِنَ الْهَدْىِ ۚ (maka wajiblah atasnya berfid-yah) Yakni harus menyembelih hadyu yang ia mampu sebagai penyempurna kekurangan karena Tamattu’. فَمَن لَّمْ يَجِدْ (Tetapi jika ia tidak menemukan) Yakni yang tidak mendapatkan hadyu karena tidak mempunyai harta atau karena tidak ada hewan yang disembelih makai a harus berpuasa tiga hari dalam hajinya yang dimulai saat ia berihram sampai hari an-Nahr (penyembelihan), dan boleh pula berpuasa pada hari-hari tasyriq. وَسَبْعَةٍ إِذَا رَجَعْتُمْ ۗ (dan tujuh hari (lagi) apabila kamu telah pulang kembali) Yakni apabila kalian keluar dari Makkah dan kembali menuju negeri-negeri kalian. تِلْكَ عَشَرَةٌ (Itulah sepuluh (hari) ) Kalimat ini digunakan agar tidak ada yang beranggapan bahwa puasa ini merupakan pilihan antara tiga hari ketika berhaji atau tujuh hari ketika telah kembali ke negerinya. كَامِلَةٌ ۗ (yang sempurna) Yakni tidak kurang dari jumlah yang ditentukan. ذٰلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُۥ حَاضِرِى الْمَسْجِدِ الْحَرَامِ ۚ (Demikian itu (kewajiban membayar fidyah) bagi orang-orang yang keluarganya tidak berada (di sekitar) Masjidil Haram) Yakni merupakan penduduk Makkah dan penjurunya (penduduk tanah haram)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ } Maksud menyempurnakan haji dan umroh dalam ayat ini adalah melaksanakannya dengan sebaik mungkin, secara zhahir : menunaikan manasik dengan semua ketebtuannya, secara bathin : melaksanakannya hanya untuk mengharap ridho Allah semata. 2 ). { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ } Pada lafazh : { لِلَّـهِ } menjelaskan pentingnya ikhlas dalam melaksanakan dua ibadah ini. 3 ). { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ } Ayat ini memulai peringatan kepada tauhid dan ikhlas setelah menjelaskan hukum-hukum ibadah, maka tidaklah seorang hamba melakukan suatu ibadah sedang dalam dirinya ada maksud riya' dan pujian. 4 ). { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ } Janganlah kalian berfikir untuk mengerjakan suatu ibadah dengan singkat. 5 ). Allah berfirman : { وَلَا تَحْلِقُوا۟ رُءُوسَكُمْ } dan Dia tidak mengatakan : jangalah kalian memendekkan, ayat ini menjelaskan bahwasanya mencukur rambut dengan sempurna lebih baik dan ini sesuai dengan doa Rasulullah sebanyak dua untuk orang-orang yang mencukur rambutnya dengan sempurna, dan satu kali untuk yang memendekkan rambutnya. 6 ). Beberapa lafazh dalam al-Qur'an datang menjelaskan keringanan-keringanan dalam ibadah dan memulai dari hal yang paling mudah : { فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ }, maka tatkala Rasulullah memerintahkan kepada Ka'b bin 'ujrah perkara ini beliau menganjurkannya untuk mengambil dari yang paling baik, beliau bersabda : (( انسك شاة، أو أطعم مساكين، أو صم ثلاثة أيام )) \"sembelihlah seekor domba, atau berilah maka untuk orang miskin, atau berpuasalah tiga hari\", dan setiap dari perintah ini ada kebaikan tersendiri. 7 ). { فَفِدْيَةٌ مِنْ صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ } \"maka wajiblah atasnya berfid-yah, yaitu: berpuasa atau bersedekah atau berkorban\", { وَأَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّ } \"dan memberi makan darinya orang fakir yang tidak meminta-minta untuk menjaga kehormatan dan orang miskin yang meminta-minta karena didesak kebutuhannya\" [al-Hajj : 37 ], { وَأَطْعِمُوا الْبَائِسَ الْفَقِيرَ } dari ayat ini kita melihat bagaimana syari'at memberikan perhatian tinggi kepada orang-orang miskin khususnya dalam perkara makanan, maka bahagialah orang yang dimudahkan oleh Allah untuk mengeluarkan dari hartanya untuk memberi makan kepada orang-orang miskin, 8 ). Diantara retorika bahasa al-Qur'an yang tinggi dapat dilihat pada ayat ini : { فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْ } \"Tetapi jika ia tidak menemukan (binatang korban atau tidak mampu), maka wajib berpuasa tiga hari dalam masa haji dan tujuh hari (lagi) apabila kamu telah pulang kembal\" al-Qur'an belum menentukan apa saja yang dimaksud yang belum ditemukan, maka makna yang mencakup di dialamnya banyak, diantaranya : siapa yang belum menemukan hewan qurban, atau siapa yang belum menemukan biaya untuk qurban, dari sini kita mengetahui beberapa faidah dan tambahan makna, dengan lafazhnya yang tidak panjang. 9 ). Setelah menyebutkan beberapa hukum tentang haji kemudian Allah berkata: { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ ۚ } Dia memerintahkan hamba-hamba Nya untuk beribadah dengan ikhlas, Allah kemudian mengakhiri ayat ini dengan firman-Nya : { وَاتَّقُوا اللَّهَ } \"dan bertaqwalah kalian kepada Allah\", makna yang agung tetapi tidak sedikit diantara kaum muslimin yang menunaikan haji lalai dari perintah ini, karena maksud utama disyari'atkannya haji adalah taqwa kepada Allah; oleh karena itu ayat ini dikuarkan dengan ayat setelahnya : { وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ ۚ وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ } \"Berbekallah, dan sesungguhnya sebaik-baik bekal adalah takwa dan bertakwalah kepada-Ku hai orang-orang yang berakal\". 10 ). Ayat al-Baqarah ini : : { وَأَتِمُّوا۟ الْحَجَّ وَالْعُمْرَةَ لِلَّـهِ ۚ } adalah ayat terpanjang yang membahas tentang haji dan di dalamnya Allah menjelaskan kemudahan yang ia berikan kepada hamba-Nya, Dia menutupnya dengan firman-Nya : { وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ } ; yang menjelaskan bahwasanya taysir (memudahkan) dalam suatu hukum adalah bagian dari syari'at sebagaimana perintah dan larangan, yang tidak boleh tempuh kecuali dengan dalil yang benar, karena hukum mengerjakan sama dengan meninggalkannya, oleh karena itu Allah menggabungkan dalam ayat ini antara perintah yang muthlaq dan keringanan, maka barangsiapa yang melampaui batas-batas yang Allah telah tetapkan, maka sesungguhnya ia telah mempersembahkan dirinya untuk merasakan kerasnya hukuman Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "196. Tunaikanlah haji dan umrah, dan sempurnakanlah rukun-rukunnya. Jika kalian tidak bisa memasuki Mekah karena sakit, ada musuh atau hal lainnya, maka berkurbanlah dengan yang mudah, berupa hadyun untuk ihram, yaitu kurban yang bisa membimbing menuju Baitul haram berupa unta, sapi, dan kambing yang sebaiknya disembelih di Mekah untuk mendekatkan diri kepada Allah. Dan janganlah kalian cukur rambut kalian untuk bertahalul sampai hadyun tersebut disembelih di tempat yang disyariatkan, supaya hadyun itu sampai di tempat pengorbanannya dengan niat untuk ihram. Barangsiapa sakit atau ada gangguan di kepalanya yang membuatnya bercukur, maka dia harus membayar fidyah, dia diberi pilihan untuk memberi makan 6 orang miskin, menyumbang domba betina, atau puasa selama 6 hari. Dan jika kalian sudah tidak mengalami kekhawatiran atau sudah sembuh. Maka wajib bagi orang yang mendahulukan umrah (yaitu bahwa dia tidak bisa berumrah di bulan haji, lalu berihlal di Mekah karena tidak diperbolehkan untuk berhaji) dan menunggu dari miqat haji karena baru saja tidak bisa berhaji itu hadyun yang disembelih sebagai suatu kewajiban karena mengurangi kesempurnaan haji dan mengambil manfaat dari sesuatu yang diperbolehkan pada keadaan di luar ihram. Dan barangsiapa keberatan untuk menyembelih hadyun karena tidak memiliki apapun dan tidak mampu untuk membelinya (tidak punya harta atau hewan) maka dia harus berpuasa selama 3 hari sebelum wukuf di Arafah pada bulan haji sebagai permulaan ihram sampai waktunya berkurban, dan berpuasa selama 7 hari ketika kembali ke negaranya, sehingga jumlahnya menjadi 10 hari. Ketentuan itu berupa pemberian hadyun atau puasa bagi orang yang melakukan haji tamattu’ itu diperuntukkan untuk orang selain penduduk tanah haram yang tinggal di Mekah, karena jaraknya jauh. Dan ketahuilah bahwa Allah menghukum setiap orang yang tidak mau menghormatiNya. Sebagaimana yang diriwayatkan oleh Ibnu Hatim bahwa ayat ini turun untuk orang yang merusak ibadah umrahnya dengan memakai parfum dan pakaian. Lalu nabi berkata kepadanya: “ Lepaskanlah pakaianmu, lalu mandi dan bersihkan hidungmu semampumu. Apa yang mampu kamu kerjakan dalam ibadah hajimu, maka tunaikanlah juga untuk umrahmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sempurnakanlah ibadah haji dan umrah karena Allah.} Laksanakanlah ibadah haji dan umrah dengan sempurna hanya karena Allah {Dan jika kalian terkepung} Jika kalian terhalang untuk menyempurnakan keduanya karena sakit atau karena adanya musuh {maka (harus menyembelih) hadyu} hewan ternak yang dibawa ke Baitullah {yang mudah (didapat)} yang mudah {dan jangan mencukur (rambut) kepala kalian} dan janganlah kalian membatalkan ihram kalian dengan mencukur rambut kepala {sebelum hadyu itu sampai di tempatnya.} tempat dimana hadyu tersebut boleh disembelih {Jika ada di antara kalian yang sakit atau ada gangguan di kepala, maka berfidyah} ketika mencukur rambut maka dia diwajibkan berfidyah {yaitu berpuasa, bersedekah, atau berkurban.} menyembelih domba untuk orang-orang faqir di Baitul haram {Apabila kalian dalam keadaan aman} kalian dalam keadaan aman dan leluasa {maka siapa saja yang mengerjakan umrah kemudian baru berhaji} maka siapa saja yang setelah tahalul dari ibadah umrahnya merasa senang dengan pembolehan terhadap hal-hal yang dilarang ketika ihram sampai dia melakukan ihram lagi untuk ibadah haji {dia (wajib menyembelih) hadyu yang mudah didapat. Jika tidak mendapatkannya, maka dia berpuasa tiga hari dalam masa haji dan tujuh hari setelah kalian kembali. Itulah sepuluh hari yang sempurna. Ketentuan itu berlaku bagi orang yang keluarganya tidak hadir} menetap {di sekitar Masjidil haram. Bertakwalah kepada Allah dan ketahuilah bahwa Allah Maha keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "196. Firman Allah, “dan sempurnakanlah ibadah haji dan umrah” dapat menjadi dalil atas beberapa perkara: Pertama: wajibnya haji dan umroh, Kedua: kewajiban menyempurnakan keduanya dengan menunaikan rukun dan kewajiban keduanya yang telah dicontohkan oleh Nabi Shallallahu Alaihi Wa Sallam, dan sabda beliau, “Ambillah tata cara manasik haji kalian dariku.” Ketiga: ini adalah dalil bagi orang yang berpendapat bahwa umrah itu adalah wajib hukumnya. Keempat: bahwasanya haji dan umroh itu wajib disempurnakan ketika seseorang memulai keduanya walaupun hanya Sunnah. Kelima: perintah untuk mengukuhkan dan membaguskan keduanya, dan hal ini hanyalah tambahan semata atas perkara yang wajib dilakukan pada keduanya. Keenam: merupakan perintah untuk mengikhlaskan keduanya hanya “kepada Allah”. Ketujuh: bahwasanya orang yang telah berihram untuk melakukan keduanya, ia tidak boleh keluar dari keduanya dengan melakukan hal lain hingga ia menyempurnakan keduanya terlebih dahulu, kecuali apa yang telah dikecualikan oleh Allah yaitu terhalang, oleh karena itu Allah berfirman, “Jika kamu terkepung,” maksudnya, kalian dihalangi untuk sampai kepada Baitullah untuk menyempurnakan keduanya oleh penyakit atau tersesat atau musuh dan yang semacamnya dari hal-hal yang dapat menghalanginya. “maka sembelihlah kurban yang mudah didapat,” Maksudnya, sembelihlah apa yang mudah kalian dapat dari kurban, yaitu 7 orang dengan 1 ekor unta atau 1 ekor sapi atau kambing yang disembelih oleh orang yang terhalang tersebut, lalu ia bercukur kemudian bertahallul dari ihramnya karena adanya penghalang tersebut, sebagaimana yang dilakukan oleh Nabi dan para sahabat beliau ketika orang-orang musyrik menghalangi mereka pada tahun hudaibiyah. Apabila ia tidak mendapatkan hewan kurban, maka ia harus berpuasa sebagai gantinya 10 hari lamanya sebagaimana yang dilakukan oleh yang mengambil Haji tamattu, kemudian ia bertahallul. Kemudian Allah berfirman, “Dan janganlah kamu mencukur kepalamu, sebelum kurban sampai di tempat penyembelihan nya.” Ini adalah di antara perkara yang dilarang dalam berihram, yaitu menghilangkan rambut dengan mencukur maupun lainnya, karena maknanya adalah salah satu dari kepala atau dari badan, karena maksud dari hal itu adalah terjadinya kekusutan dan larangan dari bersenang-senang dengan menghilangkannya, padahal ia ada pada bagian lain dari rambut. Kebanyakan para ulama mengkiaskan tindakan menghilangkan rambut ini dengan memotong kuku dengan kesamaan adanya urusan bersenang-senang. Larangan dari hal tersebut akan terus berlanjut hingga hewan kurbannya sampai ke tempat penyembelihannya yaitu pada hari penyembelihan, dan yang paling utama adalah bercukur setelah penyembelihan, sebagaimana yang dijelaskan oleh ayat tersebut. Ayat ini dapat menjadi dalil bahwa seseorang yang melakukan haji tamattu apabila menggiring hewan kurban, ia tidak bertahallul dari umrahnya sebelum hari penyembelihan. Maka apabila ia telah tawaf dan sai untuk umroh, maka ia berihram dengan Haji, dan ia tidak dikatakan bertahallul dengan disebabkan menggiring hewan kurban. Allah melarang hal tersebut hanyalah untuk menunjukkan kehinaan dan ketundukan kepada Allah, pasrah terhadapNya dan tawadhu, yang merupakan inti dari kemaslahatan seorang hamba, dan sama sekali tidak ada kemadharatan baginya dalam hal itu, lalu apabila terjadi bahaya dengan adanya gangguan seperti sakit yang dapat dihilangkan dengan mencukur rambut kepalanya, atau ada luka, atau kutu dan semacamnya, maka dalam hal itu boleh baginya mencukur rambut, akan tetapi ia wajib membayar Fidyah dengan berpuasa 3 hari atau memberi makan 6 pakir miskin, atau menyembelih binatang yang sepadan dengan binatang kurban. Maka dalam hal itu ia bebas memilih, namun berkurban adalah lebih utama, lalu bersedekah, kemudian puasa, karena melakukan yang seperti in. Dan segala sesuatu yang semakna dengan hal tersebut seperti memotong kuku atau menutupi kepala atau memakai pakaian berjahit atau memakai parfum, maka semua itu boleh dilakukan ketika terjadi kondisi darurat, namun orang bersangkutan hal itu harus membayar fidyah sebagaimana yang telah disebutkan, karena maksud dari semua itu adalah menghilangkan segala hal yang ditujukan untuk bersenang-senang. Kemudian Allah berfirman, “apabila kamu telah (merasa) aman,” maksudnya, kalian mampu sampai ke Baitullah tanpa ada hambatan dari musuh atau semacamnya, “maka bagi siapa yang ingin mengerjakan umrah sebelum haji (di dalam bulan haji)” dengan menyambungkan umrah kepada Haji, dan ia menikmati tamattu nya setelah selesai dari umrohnya. “maka wajiblah ia menyembelih kurban yang mudah didapat.” Maksudnya, wajib atasnya apa yang mudah dari hewan kurban, dengan sesuatu yang mampu memenuhi kewajiban dengan hewan kurban itu. Ini adalah dam nusuk (denda) sebagai ganjaran imbalan memperoleh dua nusuk dalam satu perjalanan, dan adanya kenikmatan dari Allah atasnya di mana ia mampu mendapatkan manfaat dengan istirahat setelah selesai dari umrah sebelum memulai haji, dan begitu juga Haji qiran (wajib menyembelih kurban), karena memperoleh dua nusuk. Pemahaman ayat ini menunjukkan bahwa orang yang hajinya ifrad tidak wajib menyembelih qurban. Dan ayat ini juga menunjukkan bolehnya bahkan keutamaan tamattu (bersenang-senang) dan bolehnya melakukan hal itu pada bulan-bulan Haji. “Tetapi jika dia tidak menemukan (binatang kurban atau tidak mampu),” maksudnya, hewan kurban atau harganya, “maka wajib berpuasa 3 hari dalam masa Haji,” awal masa bolehnya adalah saat berihram untuk umrah, dan akhirnya adalah 3 hari setelah hari penyembelihan, yaitu hari hari melempar jumroh dan bermalam di mina. Akan tetapi yang paling utama adalah ia berpuasa pada hari ketujuh, kedelapan, dan kesembilan, “dan 7 hari lagi apabila kamu telah pulang kembali,” maksudnya, kalian telah selesai dari amalan-amalan Haji, boleh menjalankan di Mekah, di jalan, atau setelah sampai di keluarganya kembali. Hal yang disebutkan dari wajibnya berkurban atas orang yang berhaji tamattu, “bagi orang-orang yang keluarganya tidak berada (di sekitar) Masjidil Haram (orang-orang yang bukan penduduk kota Mekah),” dimana jarak dari nya sejauh jarak bolehnya salat qashar atau lebih jauh darinya menurut kebiasaan yang berlaku. Orang yang seperti inilah yang wajib berkurban karena memperoleh dua nusuk dalam satu perjalanan, adapun bagi orang yang memiliki keluarga di area Masjidil Haram, maka mereka tidak diwajibkan berkurban karena tidak adanya perkara yang mengharuskan hal tersebut. “Dan bertakwalah kepada Allah,” dalam segala urusan kalian dengan menunaikan segala perintah perintahNya dan menjauhi larangan-laranganNya, dan termasuk diantaranya adalah pelaksanaan perintah-perintah dalam urusan Haji dan menjauhi larangan-larangan Haji yaitu yang disebutkan dalam ayat ini. “Dan ketahuilah bahwa Allah sangat keras siksaan-nya,” yakni bagi orang yang bermaksiat kepadaNya, dan inilah yang mengharuskan ketakwaan, karena barangsiapa yang takut akan siksaan Allah, pastilah ia akan menghindari hal-hal yang mendatangkan siksaan tersebut, sebagaimana orang yang mengharapkan pahala dari Allah, pastilah ia akan mengamalkan perkara yang menyampaikannya kepada pahala tersebut. Adapun orang yang tidak takut akan siksaan dan tidak mengharapkan pahala, pastilah ia akan menceburkan diri dalam hal-hal yang diharamkan, dan berani meninggalkan yang wajib."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَأَتِمُّواْ ٱلۡحَجَّ وَٱلۡعُمۡرَةَ لِلَّهِۚ } Wa atimmul hajja wal ‘umrota lillah : Menyempurnakan haji dan umrah dengan cara berihram untuk keduanya (berniat haji dan umrah) dari miqat dengan mengerjakan rukun-rukun serta kewajiban-kewajibannya sebagaimana diajarkan dalam syariat, dan berniat ikhlas untuk Allah Ta’ala dalam haji dan umrah. { فَإِنۡ أُحۡصِرۡتُمۡ } Fain uhsirtum : Al-Hashr maknanya terkepung Al-Ihshar artinya terhalang, yaitu ketika orang yang berhaji atau umrah tidak dapat menyempurnakan haji atau umrahnya karena dihalangi musuh untuk masuk ke Mekah, atau karena sakit yang membuatnya tidak bisa melanjutkan perjalanan ke Mekah. { فَمَا ٱسۡتَيۡسَرَ مِنَ ٱلۡهَدۡيِۖ } Famastaisara minal hadyi : Kewajiban bagi orang yang terhalang dan tidak bisa menyempurnakan ibadahnya untuk menyembelih hadyu (kurban) yang mudah dia berikan, baik berupa kambing, sapi, ataupun unta. { وَلَا تَحۡلِقُواْ رُءُوسَكُمۡ حَتَّىٰ يَبۡلُغَ ٱلۡهَدۡيُ مَحِلَّهُۥۚ } Walaa tahliqu ru’usakum hatta yablughal hadyu mahillah : Tidak boleh bagi orang yang terkepung tidak bisa menyempurnakan ibadah haji dan umrah untuk bertahallul sampai ia menyembelih hadyu (kurban), apabila sudah selesai menyembelih baru diperbolehkan untuk tahallul dengan mencukur rambutnya. { فَفِدۡيَةٞ } Fidyah : Kewajibannya adalah membayar fidyah berupa puasa, sedekah, atau ibadah. { فَمَن تَمَتَّعَ بِٱلۡعُمۡرَةِ إِلَى ٱلۡحَجِّ } Faman tamatta’a bil ‘umrati ilal hajj : Siapa yang melakukan ihram dengan niat untuk umrah di bulan-bulan haji lantas bertahallul, dan ia menunggu di Mekah sampai datang waktu haji, kemudian ia benar-benar berhaji, yang wajib baginya adalah menyembelih hadyu (kurban). { فَمَن لَّمۡ يَجِدۡ فَصِيَامُ ثَلَٰثَةِ أَيَّامٖ } Faman lam yajid fashiyamu tsalaatsati ayyaam : Siapa yang melakukan haji tamattu’ dengan melakukan umrah terlebih dahulu, namun tidak memiliki kurban karena tidak bisa mendapatkannya, maka yang wajib baginya adalah berpuasa sepuluh hari dengan rincian tiga hari di Mekah dan tujuh hari di negerinya. { ذَٰلِكَ لِمَن لَّمۡ يَكُنۡ أَهۡلُهُۥ حَاضِرِي ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ } Dzalika liman lam yakun ahlulu hadhiril masjidil haram : Kewajiban untuk menyembelih hadyu atau berpuasa ketika tidak memiliki hadyu (kurban) hanya berlaku untuk penduduk di luar tanah haram. Adapun penduduk Mekah dan tanah haram tidak ada kewajiban apapun bagi mereka jika melaksanakan haji tamattu’. Makna ayat : Allah Ta’ala memerintahkan hamba-hamba Nya yang beriman untuk menyempurnakan haji dan umrah untuk Nya Subhanahu wa Ta’ala. Yaitu dengan mengerjakannya sesuai dengan ajaran syariat dan hanya berharapkan wajah Allah Ta’ala. Kemudian Allah memberitahukan bahwa apabila mereka dihalangi sehingga tidak mungkin untuk menyempurnakannya, maka yang wajib bagi mereka adalah menyembelih hadyu (kurban) yang mudah didapatkan. Apabila telah selesai menyembelih maka setelah itu boleh bertahallul dari keadaan ihramnya. Hal itu dilakukan dengan mencukur rambut kepala atau memendekkannya. Begitu juga bagi orang yang sakit atau memiliki luka di kepalanya sehingga terpaksa untuk mencukur rambutnya, atau memakai pakaian, atau menutup kepalanya, maka yang wajib baginya setelah melakukan itu adalah membayar fidyah. Dengan memilih di antara tiga pilihan : a) berpuasa tiga hari, b) memberi makan 6 orang miskin, setiap orang berupa dua genggam makanan, c) atau menyembelih kambing. Allah Ta’ala memberitahukan bahwa siapa saja yang mengerjakan haji tamattu’ dengan mengerjakan umrah kemudian haji, dan bukan termasuk penduduk Mekah. Maka wajib baginya untuk menyembelih hadyu (kurban) berupa kambing, atau sapi, atau unta. Apabila tidak mendapatkannya maka berpuasa tiga hari di bulan haji dari awal bulan dzulhijjah sampai hari kesembilan, dan tujuh hari ketika kembali ke negerinya. Lantas Allah Ta’ala memerintahkan mereka untuk bertakwa dengan mengerjakan apa yang diperintahkan dan mengambil syariat Nya, serta memperingatkan mereka agar tidak mengabaikan perintah perintah Nya dan meremehkan syariat Nya. Allah Ta’ala berfirman,”Bertakwalah kepada Allah dan ketahuliah bahwa sesungguhnya Allah sangat pedih siksa Nya.” Pelajaran dari ayat : • Kewajiban untuk menyempurnakan haji dan umrah bagi siapa saja yang mulai melakukan ihram dari miqat, walaupun hajinya itu tatawwu’ ((sunnah) dan umrahnya tidak wajib. • Penjelasan mengenai hukum bagi orang yang terhalang melanjutkan haji dan umrah, agar mereka menyembelih seekor kambing pada tempat terhalangnya, kemudian bertahallul dengan mencukur atau memendekkan rambut. Kemudian mengulangnya lagi pada waktu mendatang apabila memungkinkan hal itu. Karena Rasulullah ﷺ dan para sahabatnya mengulang umrah ketika mereka terhalang tidak bisa masuk ke Masjidil Haram pada tahun Hudaibiyah. • Penjelasan mengenai fidyah adza, yaitu orang yang melanggar larangan ihram dengan mencukur rambutnya, atau memakai pakaian berjahit, atau menutup kepalanya karena udzur, wajib baginya untuk membayar fidyah berupa puasa, atau memberi makan orang miskin, atau menyembelih seekor kambing. • Penjelasan mengenai hukum haji tamattu’ secara rinci. Yaitu bagi orang yang bukan termasuk penduduk Mekah dan tanah haram sekitarnya, apabila memulai ihram untuk umrah pada bulan-bulan haji kemudian bertahallul darinya, dan masih tinggal di Mekah dan melaksanakan haji pada tahun itu, maka wajib untuknya menyembelih seekor kambing. Apabila tidak mampu maka berpuasa tiga hari di Mekah dan tujuh hari di negerinya. • Perintah untuk bertakwa yaitu taat kepada Allah Ta’ala dengan melakukan perintah Nya dan menjauhi larangan Nya. Serta peringatan bagi orang yang melanggarnya karena akan mendapatkan siksa yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 196: Allah memerintahkan mereka yang diharamkan haji dan umroh untuk menyempurnakan apa yang haram bagi mereka sebagaimana yang disyariatkan walaupun dengan amalan nafilah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat di atas menunjukkan beberapa hal: - Wajibnya hajji dan umrah, bagi mereka yang berpendapat bahwa umrah hukumnya wajib. - Wajibnya menyempurnakan keduanya, dengan memenuhi rukun dan kewajibannya. - Hajji dan Umrah wajib disempurnakan –jangan diputuskan- meskipun ketika hukumnya sunat. - Perintah agar menjalankannya sebaik mungkin. - Perintah agar mekakukan hajji dan Umrah ikhlas karena Allah. - Hendaknya seseorang tidak keluar dari hajji dan umrah ketika telah menjalankannya kecuali jika terjadi hashr (terhalang karena musuh, sakit atau tersesat di jalan). Yang dimaksud dengan hadyu di sini ialah menyembelih binatang korban sebagai pengganti pekerjaan wajib haji yang ditinggalkan; atau sebagai denda karena melanggar hal-hal yang terlarang mengerjakannya di dalam ibadah haji. Jika tidak memperoleh hadyu, maka melakukan gantinya yaitu berpuasa selama sepuluh hari sebagaimana orang yang berhajji tamattu'. Mencukur kepala adalah salah satu pekerjaan wajib dalam haji, sebagai tanda selesai ihram. Yakni di tempat dirinya terhalang lalu dibagikan kepada kaum fakir di sekitar tempat itu. Adapun mereka yang tidak terhalang tidak menyembelih hadyu kecuali di tanah haram yang dilakukan pada tanggal 10 Dzulhijjah atau hari-hari setelahnya (hari tasyriq). Misalnya ada kutu atau pusing yang berat. Termasuk yang wajib berfidyah adalah orang yang mencukur kepalanya bukan karena udzur, memakai wewangian, memakai pakaian berjahit dan meminyaki rambut. Imam Bukhari meriwayatkan dari Ka'ab bin Ujrah, ia berkata, \"Aku pernah berdiri di hadapan Rasulullah shallallahu 'alaihi wa sallam di Hudaibiyah, sedangkan kepalaku ketika itu dipenuhi kutu, lalu Beliau bersabda, \"Apakah binatang ini mengganggumu?\" Aku menjawab, \"Ya.\" Beliau bersabda, \"Kalau begitu, cukurlah rambutmu atau (berkata) cukurlah!\" Ka'ab bin Ujrah berkata, \"Kepadakulah turun ayat, \"Faman kaana minkum mariidhan aw bihii adzam mir ra'sih…dst.\" Maka Nabi shallallahu 'alaihi wa sallam bersabda, \"Berpuasalah tiga hari atau bersedekahlah sefarq untuk diberikan kepada enam orang (miskin) atau sembelihlah kurban yang mudah bagimu.\" (Hadits ini diriwayatkan pula oleh Muslim, Tirmidzi, Abu Dawud, Ibnu Majah, Ahmad, Thayalisi, Daruquthni, dan Ibnu Jarir dari beberapa jalan dari Ka'ab bin Ujrah) Sefarq adalah 3 sha', sehingga seorang miskin mendapat ½ sha’ (2 mud). Dengan demikian jika berpuasa, maka selama tiga hari. Jika bersedekah, maka dengan memberi makan enam orang miskin (masing-masingnya memperoleh setengah sha' (dua mud) dari makanan pokok setempat), dan jika berkorban, maka dengan menyembelih seekor kambing yang akan dibagikan dagingnya kepada kaum fakir di tanah haram. Di antara ketiga macam ini, yang lebih utama adalah berkorban, kemudian bersedekah, lalu puasa. Yakni mengorbankan binatang yang bisa disembelih dalam udh-hiyyah (qurban). Ayat ini menunjukkan bahwa orang yang berhajji ifrad tidak terkena kewajiban menyembelih hadyu dan menunjukkan keutamaan orang yang berhajji tamattu. Puasa ini awalnya ketika sedang ihram umrah dan akhirnya adalah tiga hari setelah berkurban, yakni pada hari tasyriq karena ada pengecualian dari hadits. Akan tetapi, yang lebih utama adalah berpuasa pada tanggal tujuh, delapan dan sembilan. Yakni setelah selesai menunaikan ibadah hajji, baik ketika masih di Makkah, di jalan dan ketika sampai ke kampung halaman. Jauh seukuran jarak safar atau lebih atau jauh secara uruf. Bagi orang-orang yang menyalahi perintah-Nya dan mengerjakan larangan-Nya. Mengetahui bahwa Allah amat keras siksa-Nya dapat membuahkan ketakwaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 196",
    "description": "Dan sempurnakanlah ibadah haji dan umrah karena Allah dengan memenuhi syarat, wajib, rukun, maupun sunah-sunahnya dengan niat yang ikhlas semata-mata mengharapkan rida Allah, dalam keadaan aman dan damai, baik di perjalanan maupun di tempat-tempat pelaksanaan manasik haji. Tetapi jika kamu terkepung oleh musuh, dalam keadaan perang atau situasi genting sehingga tidak dapat melaksanakan manasik haji pada tempat dan waktu yang tepat, maka ada ketentuan rukhshah (dispensasi) dengan diberlakukannya dam (pengganti) sebagai berikut. Pertama, sembelihlah hadyu, yaitu hewan yang disembelih sebagai pengganti pekerjaan wajib haji yang ditinggalkan atau sebagai denda karena melanggar hal-hal yang terlarang mengerjakannya di dalam ibadah haji, yang mudah didapat, dan jangan kamu mencukur kepalamu sebagai tanda selesainya salah satu rangkaian ibadah haji sebelum hadyu sampai di tempat penyembelihannya dengan tepat. Kedua, jika ada di antara kamu yang sakit atau ada gangguan di kepalanya lalu dia bercukur sebelum selesai melaksanakan salah satu dari rangkaian manasik haji, maka dia wajib membayar fidyah atau tebusan yaitu dengan memilih salah satu dari berpuasa, bersedekah atau berkurban supaya kamu bisa memilih fidyah yang sesuai dengan kemampuan kamu. Ketiga, apabila kamu dalam keadaan aman, tidak terkurung musuh, dan tidak terkena luka, tetapi kamu memilih tamattu, yakni mendahulukan umrah daripada haji pada musim haji yang sama, maka ketentuannya adalah bahwa barang siapa mengerjakan umrah sebelum haji, dia wajib menyembelih hadyu yang mudah didapat di sekitar masjidilharam. Tetapi jika dia tidak mendapatkannya yakni tidak mampu dan tidak memiliki harta senilai binatang ternak yang harus disembelih, maka dia wajib berpuasa tiga hari dalam musim haji dan tujuh hari setelah kamu kembali ke tanah air. Itu seluruhnya sepuluh hari secara keseluruhan. Demikian itu, bagi orang yang keluarganya tidak ada, yakni tinggal atau menetap, di sekitar masjidilharam melainkan berdomisili jauh di luar mekah seperti kaum muslim indonesia. Bertakwalah kepada Allah dan ketahuilah bahwa Allah sangat keras hukuman-Nya bagi orang-orang yang tidak menaati perintah dan aturan-Nya. Musim haji itu pada bulan-bulan yang telah dimaklumi, yakni syawal, zulkaidah, dan zulhijjah. Barang siapa mengerjakan ibadah haji dalam bulan-bulan itu, maka janganlah dia berkata jorok (rafaÅ¡), yaitu perkataan yang menimbulkan birahi, perbuatan yang tidak senonoh, atau hubungan seksual; jangan pula berbuat maksiat dan bertengkar dalam melakukan ibadah haji meskipun bukan pertengkaran dahsyat. Segala yang baik yang kamu kerjakan, Allah mengetahuinya, karena Allah mengetahui yang tersembunyi. Allah tidak mengantuk dan tidak pula tidur, semua yang terjadi di langit dan di bumi berada dalam pantauan-Nya. Bawalah bekal untuk memenuhi kebutuhan fisik, yakni kebutuhan konsumsi, akomodasi, dan transportasi selama di tanah suci; termasuk juga bekal iman dan takwa untuk kebutuhan ruhani, karena sesungguhnya sebaik-baik bekal adalah takwa, yakni mengerjakan yang diperintahkan dan meninggalkan yang dilarang oleh Allah. Dan bertakwalah kepada-ku, wahai orang-orang yang mempunyai akal sehat, supaya kamu menjadi manusia utuh lahir batin."
  }
]