[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Waktu pelaksanaan haji itu adalah pada bulan-bulan yang telah dimaklumi, yaitu bulan Syawal, dzulqo'dah, dan 10 hari dari bulan Dzulhijjah. maka barangsiapa telah memantapkan niat Haji atas dirinya pada bulan-bulan tersebut dengan memasuki keadaan ihram, maka diharamkan atas dirinya untuk berjimak dan aktivitas-aktivitas pengantarannya, baik berbentuk perkataan maupun perbuatan. Dan haram atas dirinya keluar dari ketaatan kepada Allah dengan berbuat maksiat-maksiat, dan perdebatan dalam berhaji yang dapat menyeret padat tersulut nya kemarahan dan kebencian. dan apapun kebaikan yang kalian perbuat niscaya Allah mengetahuinya, lalu membalasi tiap-tiap orang yang sesuai dengan amal perbuatannya. Dan bawalah bagi kalian perbekalan dari jenis makanan dan minuman bagi perjalanan ibadah haji, dan perbekalan dari jenis amal Shalih untuk Kampung akhirat. Karena sesungguhnya sebaik-baik perbekalan adalah ketaqwaan kepada Allah. dan takutlah kepadaku Wahai orang-orang yang berakal sehat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "197. Waktu pelaksanaan ibadah haji ialah bulan-bulan yang dimaklumi, mulai dengan bulan Syawal dan berakhir pada sepuluh hari (pertama) di bulan Zulhijah. Siapa yang mewajibkan dirinya melaksanakan ibadah haji pada bulan-bulan tersebut dan melaksanakan ihram haji, maka ia dilarang bersetubuh dan melakukan hal-hal yang merupakan pengantar bersetubuh. Dia juga dilarang keras keluar dari ketaatan kepada Allah dengan melakukan perbuatan maksiat, demi menghormati keagungan waktu dan tempat tersebut. Dan ia juga dilarang melakukan perdebatan yang menjurus kepada kemarahan dan perseteruan. Perbuatan baik apapun yang kalian lakukan pasti diketahui oleh Allah untuk dibalasnya. Laksanakanlah ibadah haji seraya melengkapi diri dengan bekal makanan dan minuman yang kalian butuhkan. Dan ketahuilah bahwa sebaik-baik bekal dan dapat memperlancar semua urusanmu ialah ketakwaan kepada Allah. Maka takutlah kalian kepada-Ku dengan cara menjalankan perintah-perintah-Ku dan menjauhi larangan-larangan-Ku, wahai orang-orang yang berakal sehat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "197. Waktu pelaksanaan haji meliputi beberapa bulan yang telah diketahui, yaitu Syawwal, Dzulqa’dah, dan sepuluh hari pertama Dzulhijjah. Barangsiapa yang menjalankan haji dan mulai berihram, maka haram baginya berjima’ dan melakukan hal-hal yang dapat menjerumuskannya kepada jima’, diharamkan pula perbuatan maksiat dan perdebatan yang menjerumuskan pada perselisihan. Dan perbuatan baik yang kalian kerjakan saat ibadah haji diketahui oleh Allah dan Dia akan membalasnya. Berbekallah untuk menjalankan haji dengan makanan dan kebutuhan lainnya, dan berbekallah untuk kehidupan akhirat dengan amal shalih, dan sebaik-baik bekal yang kalian bawa adalah ketakwaan. Dan takutlah kalian dari azab-Ku hai orang-orang yang memiliki akal yang sehat. Ibnu Abbas berkata: “…..Bulan-bulan untuk pelaksanaan haji yang Allah sebutkan yakni bulan Syawwal, Dzulqa’dah, dan Dzulhijjah. Maka barangsiapa yang menjalankan haji tamattu’ maka wajib baginya membayar dam -menyembelih hewan sembelihan- atau berpuasa.” (Shahih Bukhari, Haji, Bab 37, no. 1572)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "197. الْحَجُّ أَشْهُرٌ مَّعْلُومٰتٌ (haji adalah beberapa bulan yang dimaklumi) Yakni waktu menunaikan ibadah haji adalah bulan-bulan yang telah diketahui, yaitu Syawwal, Dzul Qa’dah, dan semua hari dalam bulan Dzul Hijjah. Pendapat lain mengatakan, Syawwal, Dzul Qa’dah, dan sepuluh hari pertama bulan Dzul Hijjah. Dan ayat ini merupakan dalil tidak dibolehkannya berihram haji sebelum bulan-bulan ini, dan barangsiapa yang berihram sebelum ini maka hendaklah ia memulainya dengan umrah. فَمَن فَرَضَ فِيهِنَّ الْحَجَّ (barangsiapa yang menetapkan niatnya dalam bulan itu akan mengerjakan haji) Yakni berihram dalam bulan-bulan ini maka ia diharuskan untuk menyelesaikan hajinya. فَلَا رَفَثَ (maka tidak boleh rafats) Yakni berjima’ dan berkata kata rayuan kepada perempuan. وَلَا فُسُوقَ (berbuat fasik) Yakni keluar dari Batasan-batasan syari’at, baik itu dengan melakukan hal yang haram saat berihram seperti mencukur rambut atau saat diluar ihram seperti berzina dan melakukan kezaliman. Dan pendapat lain mengatakan, yang dimaksud adalah caci maki. وَلَا جِدَالَ (dan berbantah-bantahan) Yakni berdebat dan berselisih. وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍ يَعْلَمْهُ اللَّـهُ ۗ (Dan apa yang kamu kerjakan berupa kebaikan, niscaya Allah mengetahuinya) Allah menganjurkan apa-apa yang baik Setelah menyebutkan apa-apa saja yang butuk, dan menganjutkan ketaatan setelah menyebutkan bentuk-bentuk kemaksiatan. وَتَزَوَّدُوا۟ (Berbekallah) Orang-orang Arab dahulu berkata: bagaimana Tuhan kami tidak memberi makan kami sedangkan kita melaksanakan ibadah haji, maka mereka pun pergi berhaji tanpa membawa bekal. Mereka juga berkata: kami adalah orang-orang yang bertawakkal kepada Allah. Maka Allah melarang perbuatan tersebut; karena memang sesungguhnya kemanapun mereka pergi tidak akan makan kecuali dari rezeki yang Allah berikan. فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ ۚ (dan sesungguhnya sebaik-baik bekal adalah takwa) Yakni sebaik-baik bekal ke kampung akhirat adalah ketakwaan, dan sebaik-baik bekal untuk di dunia adalah apa saja yang dapat membantu untuk menjalankan ketakwaan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seorang mutadabbir berkata : sejenak aku mengamati firman Allah : { الْحَجُّ أَشْهُرٌ مَّعْلُومٰتٌ } aku kemudian bertanya-tanya dalam diri : kenapa ibadah haji berbeda pada lafazh { أَشْهُرٌ } tanpa rukun-rukun lainnya ? maka seakan-akan kewajiban menunaikannya tidak lain kecuali satu kali dalam seumur, dan jauhnya jarak yang ditempuh sebagian besar orang yang bermaksud menunaikannya, ataukah masanya yang panjang yang harus dijalani oleh seorang muslim agar tertunaikan hajatnya beribadah dimasjid al-haram ? dan bersiap-siap sebelum masa manasik dan setelahnya, atau ketika ia hendak mendatanginya dengan segera dan meninggalkannya pada waktu yang akhir, keleluasan dan rahmat yang Allah berikan, dan anjuran untuk bergegas dalam meraih segala kebaikan dari ibadah; karena darinya berbagai kebaikan yang dapat diperoleh. 2 ). { فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ } \"maka tidak boleh rafats, berbuat fasik dan berbantah-bantahan di dalam masa mengerjakan haji\", hendaklah seorang muslim yang sedang melaksanakan ibadah haji menjaga anggota badannya, dan apa yang ia gunakan untuk menunaikan ibadh itu, hendaklah ia merasa bahwasanya dia adalah seorang tamu di rumah Allah, dan seorang tamu mesti menjaga kehormatan tuan rumah, dan senantiasa bertaqwa kepada Allah, dan salah satu tanda ketaqwaannya kepada Allah : dengan menjaga anggota badannya, maka tidaklah ia mengalihkan pandangannya kepada sesuatu yang diharamkan untuk dilihat seperti aurat muslimin dan wanita-wanita muslimat. 3 ). Hendaklah bagi siapa yang sedang melakukan ihram menjauhi segala hal yang mengacaukan pikiran, dan hal-hal yang menyibukkan diri selain ibadah, Allah berfirman : { وَلَا جِدَالَ فِي الْحَجِّ }; dan dari sana akan jelas kesalahan orang-orang yang berlomba-lomba mendekati hajar aswad ketika thawaf, karena diantara mereka banyak menimpulkan kekacauan dan kesibukan yang tidak lebih penting daripada thawaf. 4 ). Tatkala Allah melarang hamba-Nya membawa hal-hal yang buruk dalam perkataan dan perbuatan melalui firman-Nya : { فلا رفث ولا فسوق ولا جدال في الحج } Dia kemudian menganjurkan mereka untuk berbuat kebaikan, dan mengabarkan kepada mereka bahwa Allah maha mengetahui apa yang mereka perbuat, dan Dia akan membalas perbuatan tersebut dengan sebaik-baiknya balasan pada hari kiamat : { وما تفعلوا من خير يعلمه الله } 5 ). Seorang pembantu ketika ia tahu bahwa tuannya mengalihkan perhatian kepadanya; ia akan lebih tekun dengan pekerjanannya dan lebih berhati-hati menjauhi segala larangannya; seperti gambaran peristiwa diatas Allah mengitutkan perintah haji dan larangan rofats dan fusuq serta jidal dengan firman-Nya : { وما تفعلوا من خير يعلمه الله}. 6 ). Secara keseluruhan ibadah-ibadah yang diwajibkan dan dianjurkan dalam haji mulai dari thawaf, sa’I, dan melempar jamrah adalah ibadah zohiroh, tetapi ada banyak ibadah-ibadah rahasia yang mungkin dilakukan oleh seorang hamba dengan tuhannya : mulai dari ibadah-ibadaha nawafil, dzikir dan tilawah, mengajarkan kebaikan kepada orang jahil, memberikan keamanan bagi orang yang sedang dalam kekhawatiran, mambantu orang yang membutuhkan, semua kebaikan-kebaikan ini masuk dalam cakupan ayat ini : { وما تفعلوا من خير يعلمه الله} unkapan yang membarikan manfaat yang tidak dapat dibatasi, ayat yang senantiasa memberi semangat untuk meningkatkan kebaikan dan ketaatan kepada Allah. 7 ). { وتزودوا فإن خير الزاد التقوى} Allah memerintahkan kepada hamba-hama Nya yang akan melakukan perjalanan haji untuk berbekal yang cukup tanpa memberatkan bagi mereka yang tidak mampu melakukan perjalanan itu, kemudian Dia جل جلا له - - mengingatkan mereka akan bekal perjalanan akhirat yaitu dengan taqwa, sebagaimana seseorang tidak akan sampai kepada tujuannya tanpa bekal, maka seseorang tidak akan sampai kepada tujuan perjalanan akhiratnya kecuali dengan bekal taqwa. 8 ). { وتزودوا فإن خير الزاد التقوى } Kalimat yang agung ini mengandung dua maksud dan tujuan yang besar : - Pertama : Perintah untuk berbekal sebelum melakukan perjalanan haji; sebagai bantahan atas mereka yang dulunya meninggalkan bekal untuk perjalanan haji, dan sebab turunnya ayat ini adalah dari perkataan Ibnu 'Abbas : \"Dahulu ahlu Yaman berhaji tanpa membawa bekal, dan mereka mengatakan : kami bertawakkal kepada Allah, tatkala mereka sampai di Makkah mereka justru meminta-minta kepada segenap manusia, maka Allah kemudian menurunkan ayat ini : { وتزودوا فإن خير الزاد التقوى } . - Kedua : Himbauan untuk berbekal ketaatan untuk meraih kebahagiaan di akhirat, yaitu dengan memanfaatkan musim haji dengan ketaatan dan segala kebaikan. 9 ). { فإن خير الزاد التقوى } Seorang laki-laki berkata kepada Yunus bin 'Ubaid : berilah aku wasiat ! kemudian Yunus berkata : bertaqwalah kepada Allah; karena barangsiapa yang bertaqwa kepada-Nya tidak akan ada kekhawatiran dalam dirinya. 10 ). Pada konteks ayat haji : { وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ } \"Dan apa yang kamu kerjakan berupa kebaikan, niscaya Allah mengetahuinya\", pada ayat ini ada kemungkinan dikatakan : ( وما ففعلوا من شيء ) \"Dan apa yang kamu kerjakan dari sesuatu\"; agar dapat difahami bahwa yang dikerjakan adalah berupa kebaikan atau keburukan, akan tetapi Allah mengkhususkan dalam konteks ayat ini perbuatan yang baik dikarenakan manfaat yang timbul darinya yang Dia ketahui, diantaranya : Jika aku mengetahui dari kebaikan kamu akan senantiasa mengingatnya dan menyiarkannya, dan jika aku mengetahui darimu keburukan kamu akan menutupinya dan menyembunyikannya; ketahuilah sesungguhnya jika rahmatku di dunia saja seperti itu, maka bagaimana dengan di akhirat ?. 11 ). Perhatikanlah ayat yang menakjubkan ini : { وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ } \"Dan apa yang kamu kerjakan berupa kebaikan, niscaya Allah mengetahuinya\" padahal Allah mengetahui segala sesuatu; ayat ini mengajarkan setiap muslim untuk senantiasa menjaga amalan-amalan hati tatkala mereka sedang manasik, karena terkadang seseorang yang sedang berhaji lalai dari amalan tersebut, sebagian besar dari mereka lebih mementingkan kesempurnaan amalan-amalan yang zhahir, tetapi jika ia merasa bahwa Allah senantiasa mengawasi perbuatannya ia akan lebih teliti dalam beramal dan lebih meningkatkan ketaqwaannya; oleh karena itu ayat ini ditutup dengan : { فَإِنَّ خَيْرَ الزَّادِ التَّقْوَىٰ ۚ وَاتَّقُونِ يَا أُولِي الْأَلْبَابِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "197. Waktu haji itu bulan-bulannya telah ditentukan, yaitu Syawal, Dzulqa’dah dan Dzulhijjah (10 hari pertama dari bulan tersebut). Barangsiapa berihram sebelum bulan-bulan itu maka dia memulai umrah. Barangsiapa mewajibkan dirinya untuk berhaji di bulan-bulan ini lalu berihram, maka dia tidak boleh melakukan rafats (berjima’ atau mengucapkan perkataan kotor) fusuq (melakukan kemaksiatan atau melewati batas-batas syariat), dan jidal (perdebatan yang mengakibatkan perselisihan dan perkelahian). Dan kebaikan yang kalian lakukan dalam haji seperti memberi makan dan sedekah itu diketahui oleh Allah lalu akan membalasnya. Dan berbekallah makanan dan nafkah untuk berhaji sampai kalian tidak membutuhkan bantuan orang lain, dan berbekallah untuk akhirat dengan amal shalih. Karena sebaik-baik bekal yang bermanfaat yaitu takwa kepada Allah. Dan takutlah kepada Allah, wahai orang-orang yang berakal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Haji itu (berlangsung pada) bulan-bulan yang telah diketahui.} waktu haji itu pada bulan-bulan yang sudah diketahui, yaitu Syawal, Dzulqa’dah dan 10 hari dari bulan Dzulhijjah {Siapa saja yang mewajibkan (dirinya) untuk berhaji dalam bulan-bulan itu,} mewajibkan dirinya untuk berhaji dengan berihram dalambulan-bulan ini {maka janganlah berbuat rafaṡ} janganlah memancing wanita untuk berjima’ {berbuat maksiat} tidak melanggar ketaatan kepada Allah {dan bertengkar} berselisih {dalam melakukan ibadah haji. Kebaikan yang kalian kerjakan diketahui oleh Allah. Berbekallah karena sesungguhnya sebaik-baik bekal adalah takwa. Bertakwalah kepadaKu wahai orang-orang yang mempunyai akal sehat} wahai orang-orang yang memiliki akal sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "197. Allah mengabarkan bahwasanya, “Haji” terjadi pada “beberapa bulan yang dimaklumi,” yakni bagi orang-orang yang menjadi alamat pesan ayat ini, bulan-bulan tersebut telah sangat dikenal, di mana tidak perlu lagi ada pengkhususan, sebagaimana ibadah puasa membutuhkan penentuan bulannya, dan sebagaimana pula Allah menerangkan tentang waktu-waktu salat fardhu yang lima. Haji sesungguhnya merupakan ibadah yang telah disyariatkan sejak zaman ajaran Ibrahim Alaihissalam yang masih senantiasa berlaku dan diketahui oleh keturunannya. Dan yang dimaksud dengan bulan-bulan yang dimaklumi menurut jumhur ulama adalah bulan Syawal, Dzulqa’dah, dan 10 hari pertama bulan Dzulhijjah, yaitu yang menjadi waktu untuk berihram untuk Haji pada umumnya. “Maka Barang siapa yang menetapkan niatnya dalam bulan itu akan mengerjakan haji,” yakni melakukan ihram haji, karena sejak mulai melakukannya secara otomatis menjadi sesuatu yang wajib, walaupun hukum awalnya adalah sunnah. Imam Syafi’i beserta ulama ulama yang sependapat dengan beliau menjadikan ayat ini sebagai dalil tidak bolehnya ihram dengan Haji sebelum tiba bulan bulannya. Saya berkata, sekiranya dikatakan, bahwa ayat ini mengandung dalil bolehnya berihram dengan Haji sebelum bulan mulanya sebagaimana pendapat jumhur ulama, pastilah hal itu lebih dapat diterima, karena firman Allah, “barangsiapa yang menetapkan niatnya dalam bulan itu akan mengerjakan haji” merupakan dalil bahwa kewajiban itu bisa terjadi pada bulan-bulan yang disebutkan dan bisa pula tidak terjadi pada bulan-bulan tersebut, kalau tidak seperti itu, Allah tidak akan membatasi nya. Dan FirmanNya, “maka tidak boleh rafats, berbuat fasik, dan berbantah-bantahan di dalam masa mengerjakan haji”, maksudnya, wajib atas kalian mengagungkan ihram dengan Haji tersebut, khususnya yang terjadi pada bulan bulannya dan kalian memeliharanya dari hal-hal yang merusaknya atau mengurangi pahala dari rafats, yaitu berjima, dan segala tindakan yang menuju ke sana, baik perbuatan maupun perkataan, khususnya setelah wanita berada di hadapan mereka. Dan perbuatan fasik maksudnya seluruh kemaksiatan yang diantaranya adalah larangan-larangan dalam berihram, dan dari berbantah-bantahan, maksudnya debat kusir, berselisih, dan bermusuhan; Karena semua itu akan menimbulkan keburukan dan permusuhan. Maksud dari berhaji adalah menunjukkan sikap kerendahan diri, ketundukan hanya kepada Allah, mendekatkan diri kepadaNya dengan segala kemampuan dari berbagai macam ketaatan, dan membersihkan diri dari mendekati kejelekan-kejelekan, karena dengan semua itu hanya akan menjadi haji yang mabrur, dan haji yang mabrur itu tidak ada balasan yang patut baginya kecuali surga. Hal-hal diatas walaupun telah terlarang pada setiap waktu dan tempat, namun larangan dari semua itu akan lebih berat lagi saat ibadah haji. Ketahuilah, bahwasanya pendekatan diri kepada allah tidaklah sempurna hanya dengan meninggalkan kemaksiatan saja hingga dia menunaikan juga kewajiban yang diperintahkan, oleh karena itu Allah berfirman, “Dan apa yang kamu kerjakan dari kebaikan, niscaya Allah mengetahuinya.” Dalam ayat ini disebutkan dengan kata dari untuk menegaskan keumuman ayat itu, hingga segala kebaikan, ketaatan, dan ibadah termasuk kedalamnya. Artinya sesungguhnya Allah maha mengetahui hal itu. Ayat ini mengandung anjuran yang sangat untuk berbuat kebajikan, khususnya di tempat-tempat yang mulia dan tanah-tanah haram yang memiliki kedudukan tinggi tersebut, maka sepatutnya menambah apa yang mungkin dapat ditambah dalam ibadah tersebut seperti shalat, puasa, sedekah, tawaf, berbuat baik berupa perkataan maupun perbuatan. Kemudian Allah memerintahkan untuk menyiapkan bekal untuk perjalanan yang berkah ini, karena menyiapkan bekal untuk itu merupakan tindakan menghindar dari membutuhkan bantuan orang lain, menjauh dari harta harta mereka dengan bentuk permintaan maupun (menerima) pemberian, dan dalam memperbanyak bekal itu terdapat manfaat yang banyak dan dapat menolong seorang musafir serta sebagai nilai tambah dalam mendekatkan diri kepada Rabb sekalian alam. Bekal yang dimaksud itu adalah melaksanakan perjalanan dengan apa yang memenuhi hajat dan perbekalan. Adapun perbekalan hakiki yang senantiasa langgeng manfaatnya bagi pemiliknya di dunia maupun di akhirat nya adalah bekal ketaqwaan yang merupakan pemekaran menuju negeri tempat menetap, dan ia adalah hal yang menyampaikan kepada kelezatan paling sempurna serta sebaik-baik kenikmatan yang akan selalu dan terus menerus. Dan barangsiapa yang meninggalkan perbekalan ini, maka ia akan terhalang dengannya, yang mana dia adalah pembawa kepada segala keburukan, dan ia terhalang untuk sampai ke negeri orang-orang yang bertakwa. Oleh karena itu, hal ini adalah sebuah pujian bagi ketakwaan. Kemudian Allah memerintahkan hal tersebut kepada orang-orang yang berakal seraya berfirman, “bertakwalah kepada-Ku hai orang-orang yang berakal,” maksudnya, wahai orang-orang yang memiliki akal yang matang, bertakwalah kepada robb kalian, dimana bertakwa kepadaNya adalah hal yang paling agung yang diperintahkan oleh akal kepadanya, dan meninggalkan hal tersebut adalah sebuah tanda kebodohan dan kerusakan pikiran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَشۡهُرٞ مَّعۡلُومَٰتٞۚ } Asyhurum Ma’lumat : Yaitu bulan Syawal, Dzulqa’dah, dan sepuluh hari awal bulan Dzulhijjah. Inilah bulan bulan yang dihormati karena terdapat ibadah haji. { فَرَضَ } Faradha Berniat untuk berhaji atau memulai ihram dengan haji. { فَلَا رَفَثَ } Fala rafatsa : Ar-rafats maknanya berhubungan badan atau cumbu rayu. { وَلَا فُسُوقَ } Walaa fusuqa : Al-Fisq dan Al-Fusuq artinya keluar dari ketaatan kepada Allah, dengan meninggalkan kewajiban atau melakukan keharaman. { جِدَالَ } Al-Jidal : Permusuhan dan perseteruan. Makna ayat : Konteks ayat ayat ini masih menjelaskan tentang hukum-hukum seputar haji dan umrah. Allah Ta’ala menegaskan bahwa ibadah haji dilaksanakan pada bulan-bulan tertentu, yaitu Syawal, Dzulqa’dah, dan sepuluh hari awal bulan Dzulhijjah, maka seorang tidak bisa memulai ihram untuk berhaji kecuali pada waktu tersebut. Bagi orang yang mulai berihram untuk haji, wajib baginya untuk meninggalkan perbuatan keji (berhubungan badan dan bercumu rayu), perbuatan buruk, dan bermusuhan agar pahala hajinya tidak rusak atau berkurang. Disunnahkan bagi orang yang berhaji untuk melakukan perbuatan baik seperti bersedekah dan yang lainnya, firman Allah Ta’ala,”Tidak ada sesuatu pun yang kalian perbuat dari sesuatu yang baik, kecuali Allah mengetahuinya.” Dan sudah tentu bahwa Allah akan mengganjar dan membalas dengan pahala. Kemudian Allah Ta’ala memerintahkan jama’ah haji untuk menyiapkan bekal perjalanannya berupa makanan, minuman, yang mencukupi kebutuhannya sehingga tidak meminta-minta kepada manusia di perjalanan. Allah berfirman,”Dan berbekallah”. Allah menerangkan bahwa sebaik-baik bekal adalah ketakwaan, termasuk di antara ketakwaan adalah tidak mengemis harta kepada manusia. Kemudian Allah memerintahkan mereka agar bertakwa kepada Nya, yaitu takut kepada Allah, tidak bermaksiat kepada Nya dalam perintah maupun larangan Nya, dalam firman Nya,”Dan bertakwalah kepada Ku wahai orang yang berakal.” Allah lebih berhak untuk ditakuti karena Dia lah Maha Esa lagi Maha Perkasa. Pelajaran dari ayat : • Keharaman melakukan perbuatan keji (rafats), kefasiqan, dan permusuhan tatkala sedang ihram. • Disunnahkan bagi jama’ah haji untuk memperbanyak amalan kebaikan selama ibadah hajinya agar pahalanya bertambah dan mabrur hajinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": "Memuji-memuji, menyanjung-menyanjung, menyebutkan, berbicara tentang, mengacu pada, menetapkan"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 197: Allah mengabarkan bahwasannya waktu berhaji telah diketahui yaitu pada bulan syawal dan dzulqodah serta 10 dzulhijjah ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ialah bulan Syawal, Zulkaidah dan Zulhijjah. Berdasarkan ayat ini, Imam Syafi'i berpendapat bahwa ihram untuk menunaikan ibadah hajji tidak boleh dilakukan sebelum tiba bulan-bulan hajji. Namun menurut Syaikh As Sa'diy bahwa berihram untuk hajji dianggap sah meskipun belum tiba bulan-bulan hajji, berdasarkan lanjutan ayatnya, yaitu \"faman faradha fiihinnal hajja\" di mana meniatkan hajji itu terkadang di bulan hajji dan terkadang di luar bulan hajji, inilah yang dipegang oleh jumhur ulama. Rafats artinya jima' dan pendorongnya yang berupa perkataan atau perbuatan yang menimbulkan berahi. Termasuk pula larangan-larangan ihram. Bertengkar, meskipun dilarang di setiap waktu dan tempat, namun lebih dilarang lagi ketika ibadah hajji. Dalam ayat ini terdapat dorongan melakukan kebaikan, khususnya di tempat utama dan dihormati tersebut, yakni sepatutnya seseorang melakukan segala kebaiikan yang bisa dilakukan, baik bentuknya shalat, puasa, sedekah, thawaf maupun berbuat ihsan yang berupa perkataan atau perbuatan. Baik bekal safar untuk naik hajji maupun bekal menuju kampung akhirat. Ada yang berpendapat bahwa ayat ini turun berkenaan penduduk Yaman yang berangkat hajji tanpa bekal sehingga membebani manusia, maka di ayat tersebut, Allah Subhaanahu wa Ta'aala memerintahkan mereka berbekal ketika mengadakan perjalanan untuk ibadah hajji, di mana sebaik-baik bekal adalah taqwa, yakni yang dapat menjaga dirinya dari meminta-minta kepada manusia. Maksud bekal takwa di sini ialah bekal yang cukup agar dapat memelihara diri dari meminta-minta selama perjalanan haji atau bekal hakiki yang memberi manfa'at kepada pelakunya di dunia dan akhirat, yaitu takwa dalam arti menjalankan perintah Allah dan menjauhi larangan-Nya. Imam Bukhari meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma ia berkata, \"Orang-orang Yaman ketika berhaji tidak membawa bekal dan mereka berkata, \"Kami orang-orang yang bertawakkal\", ketika mereka tiba di Madinah, mereka akhirnya meminta-minta kepada manusia, maka Allah menurunkan ayat, \"Wa tazawwaduu fa inna khairaz zaadit taqwa.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 197",
    "description": "Musim haji itu pada bulan-bulan yang telah dimaklumi, yakni syawal, zulkaidah, dan zulhijjah. Barang siapa mengerjakan ibadah haji dalam bulan-bulan itu, maka janganlah dia berkata jorok (rafaÅ¡), yaitu perkataan yang menimbulkan birahi, perbuatan yang tidak senonoh, atau hubungan seksual; jangan pula berbuat maksiat dan bertengkar dalam melakukan ibadah haji meskipun bukan pertengkaran dahsyat. Segala yang baik yang kamu kerjakan, Allah mengetahuinya, karena Allah mengetahui yang tersembunyi. Allah tidak mengantuk dan tidak pula tidur, semua yang terjadi di langit dan di bumi berada dalam pantauan-Nya. Bawalah bekal untuk memenuhi kebutuhan fisik, yakni kebutuhan konsumsi, akomodasi, dan transportasi selama di tanah suci; termasuk juga bekal iman dan takwa untuk kebutuhan ruhani, karena sesungguhnya sebaik-baik bekal adalah takwa, yakni mengerjakan yang diperintahkan dan meninggalkan yang dilarang oleh Allah. Dan bertakwalah kepada-ku, wahai orang-orang yang mempunyai akal sehat, supaya kamu menjadi manusia utuh lahir batin. Bukanlah suatu dosa bagimu mencari karunia dari tuhanmu beru-pa rezeki yang halal melalui berdagang, menawarkan jasa, dan menyewakan barang. Di antara kaum muslim ada yang merasa berdosa untuk berdagang dan mencari rezeki yang halal pada musim haji, padahal Allah membolehkannya dengan cara-cara yang diatur dalam Al-Qur'an. Maka apabila kamu bertolak dari arafah setelah wukuf, sejak matahari terbenam pada tanggal 9 zulhijah dan sudah sampai di muzdalifah, maka berzikirlah kepada Allah di masy'arilharam, yakni di muzdalifah, dengan tahlil, talbiah, takbir, dan tahmid. Dan berzikirlah kepada-Nya sebagaimana dia telah memberi petunjuk kepadamu mengikuti agama yang benar, keyakinan yang kukuh, ibadah yang istikamah, dan akhlak yang mulia, sekalipun sebelumnya kamu benar-benar termasuk orang yang tidak tahu. Zikir itu merupakan rasa syukur atas nikmat Allah yang telah membimbing para jamaah haji menjadi orang-orang beriman."
  }
]