[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada dosa atas diri kalian untuk mencari rezeki dari Tuhan kalian dengan mengambil keuntungan dari perniagaan pada hari-hari haji. apabila kalian telah bertolak setelah terbenamnya matahari meninggalkan Arafah, yaitu tempat yang menjadi tempat Wukuf bagi jemaah haji pada tanggal sembilan Dzulhijjah, maka ingatlah Allah dengan Bertasbih, talbiah, dan berdoa di sisi masy'aril haram (di Muzdalifah). dan sebutlah Allah dengan cara benar yang dituntunkan Allah bagi kalian kepadanya. dan sesungguhnya dia dahulu sebelum berada di dalam kesesatan, sehingga tidak mengenal kebenaran"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "198. Tidak ada dosa bagi kalian untuk mencari rezeki yang halal melalui perdagangan dan lain-lain selama melaksanakan ibadah haji. Apabila kalian bertolak dari Arafah setelah melaksanakan wukuf di sana pada tanggal 9 (Zulhijah) menuju Muzdalifah pada malam tanggal 10 Zulhijah, maka berzikirlah kepada Allah dengan cara membaca tasbih, tahlil dan doa di Masy'aril Haram di Muzdalifah. Dan berzikirlah kepada Allah karena Dia telah menunjukkan kamu kepada syi'ar-syi'ar agama-Nya dan tata cara menunaikan ibadah haji di Baitullah, karena sebelum itu kalian termasuk orang-orang yang tidak mengetahui syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "198. Tidak mengapa bagi kalian untuk mencari rezeki dari keuntungan berdagang pada hari-hari pelaksanaan haji. Dan barangsiapa yang beranjak dari Arafah menuju Muzdalifah, maka berzikirlah kepada Allah sesuai tuntunan Rasulullah. Dan kalian sebelum mendapatkan petunjuk adalah orang-orang yang jahil dan jauh dari kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "198. لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُوا۟ فَضْلًا مِّن رَّبِّكُمْ ۚ (Tidak ada dosa bagimu untuk mencari karunia (rezeki hasil perniagaan) dari Tuhanmu) Yakni dengan berdagang dan mencari rezeki sambil melaksanakan ibadah haji. فَإِذَآ أَفَضْتُم (Maka apabila kamu telah bertolak ) Yakni pergi. مِّنْ عَرَفٰتٍ (dari ‘Arafat) Untuk menuju ke Muzdalifah. فَاذْكُرُوا۟ اللَّـهَ عِندَ الْمَشْعَرِ الْحَرَامِ ۖ (berdzikirlah kepada Allah di Masy’arilharam) Masy’arilharam adalah bukit yang dipakai oleh Imam untuk berdiri di tanah Muzdalifah. Pendapat lain mengatakan, ia adalah tempat diantara dua bukti Muzdalifah dimulai dari dua Lorong Arafah sampai ke lembah Muhassir. Dan dzikir kepada Allah disana meliputi talbiyah, sholat maghrib, Isya, dan Subuh, dan berdo’a setelah sholat subuh. وَاذْكُرُوهُ كَمَا هَدَىٰكُمْ (Dan berdzikirlah (dengan menyebut) Allah sebagaimana yang ditunjukkan-Nya kepadamu) Yakni berdzikirlah dengan dzikir yang baik sebagaimana Dia telah memberi kalian petunjuk dengan petunjuk yang baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Perhatikanlah bagaimana Allah menghubungkan orang yang berhaji dengan perintah dzikir kepada-Nya setelah menyelesaikan seluruh rukun-rukun haji : { فَإِذَا أَفَضْتُمْ مِنْ عَرَفَاتٍ فَاذْكُرُوا اللَّهَ } \"Maka apabila kamu telah bertolak dari 'Arafat, berdzikirlah kepada Allah\", { ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ وَاسْتَغْفِرُوا اللَّهَ } \"Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak (‘Arafah) dan mohonlah ampun kepada Allah\" [al-Baqarah : 199], { فَإِذَا قَضَيْتُمْ مَنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ } \"Apabila kamu telah menyelesaikan ibadah hajimu, maka berdzikirlah dengan menyebut Allah\" [al-Baqarah : 200], kemudian Allah berfirman : { وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ } \"Dan berdzikirlah (dengan menyebut) Allah dalam beberapa hari yang berbilang\" [al-Baqarah : 203], setelah mengamati ayat-ayat di atas perhatikanlah bagaimana keadaan kita sekarang ini, berapa banyak kita telah lalai dari berdzikir kepada Allah selama menjalankan ibadah haji ?! 2 ). { وَاذْكُرُوهُ كَمَا هَدَاكُمْ } \"Dan berdzikirlah (dengan menyebut) Allah sebagaimana yang ditunjukkan-Nya kepadamu\" yakni : kerjakanlah apa yang telah kami perintahkan kepadamu berupa dzikir, sebagaimana Allah telah memberikanmu petunjuk dalam agama islam ini, dan seakan-akan Allah mengatakan : tidaklah kami menturuhmu berdzikir melainkan agar kamu menjadi orang-orang yang bersyukur atas nikmat itu. 3 ). Seseorang yang mengamati dan memperhatikan syi'ar-syi'ar haji akan memahami sebuah tarbiyah yang menakjubkan dari banyaknya perintah berdzikir, kita dapati di beberapa tempat al-Qur'an mengabadikan perintah itu yang masih berkaitan dengan syi'ar-syi'ar haji : perintah berdzikir pada pada Masy'arilharam, perintah berdzikir pada hari-hari tasyriq, perintah berdzikir selepas menunaikan manasik, perintah berdzikir tatkala menyembelih qurban, dan perintah berdzikir atas nikmat tauhid secara umum; maka hendaklah kita menemukan dimana pengaruh ibadah ini pada manasik yang kita lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "198. Tiada dosa bagi kalian ketika berniaga dan mencari rejeki ketika berhaji, maka ketika kalian bertolak dri Arafah menuju Muzdalifah setelah melakukan wukuf, berdzikir dan berdoalah kepada Allah serta shalatlah di Masy’arilharam di Muzdalifah, yaitu bukit Quzah yang digunakan sebagai tempat berhentinya seorang imam di Muzdalifah. Berdzikirlah kpadaNya dengan mengucap talbiyah, tahlil, doa, tahmid dan puji-pujian lain. Sesungguhnya sebelum adanya petunjuk ini, kalian termasuk orang-orang yang tidak tahu apapun dan jauh dari kebenaran tentang akidah dan ibadah.Imam Bukhari meriwayatkan dari Ibnu Abbas yang berkata: “Sesungguhnya Ukaz, Majinnah, dan Dzul majas adalah pasar-pasar di jaman Jahiliyyah, lalu orang-orang melakukan perdagangan di beberapa musim dan menanyakan hal itu kepada rasulullah SAW. Lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bukanlah suatu dosa bagi kalian} kesalahan {mencari karunia} mencari rejeki yang halal {dari Tuhan kalian (pada musim haji). Apabila kalian bertolak dari Arafah} kalian bertolak kembali dari Arafah setelah terbenamnya matahari {berzikirlah kepada Allah di Masyaril haram} yaitu Muzdalifah {Berzikirlah kepadaNya karena Dia telah memberi petunjuk kepada kalian meskipun sebelumnya kalian benar-benar termasuk orang-orang yang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "198. Ketika Allah memerintahkan untuk bertaqwa, Allah mengabarkan bahwasanya mencari karunia Allah dengan mencari penghidupan pada saat musim haji dan selainnya tidaklah berdosa apabila tidak mengganggu hal yang wajib atasnya, bila maksud kedatangannya adalah berhaji, dan pencahariannya itu adalah halal yang disandarkan kepada karunia Allah, tidak bersandar kepada keahlian seseorang dan melakukan sebab-sebab namun merupakan dzat yang membuat sebab-sebab tersebut, karena yang seperti ini adalah inti dari dosa itu sendiri. Dan dalam FirmanNya, “Maka apabila kamu telah bertolak dari Arafah, berdzikirlah kepada Allah di masy’aril haram “, terkandung dalil yang menunjukkan kepada beberapa hal; Pertama: wukuf di Arafah, hal ini adalah sesuatu yang telah diketahui dan merupakan rukun dari rukun-rukun Haji, maka bertolak dari Arafah tidaklah dilakukan kecuali setelah wukuf di sana. Kedua: perintah untuk berdzikir kepada Allah di masy’aril haram yaitu Muzdalifah, hal ini pun telah diketahui, yang dilakukan pada malam hari penyembelihan seraya bermalam disana, dan setelah salat subuh wukuf di Muzdalifah seraya berdoa hingga pagi sangat terang, termasuk dalam berdzikir kepada Allah adalah menunaikan kewajiban-kewajiban dan sunah-sunah padanya. Ketiga: bahwasanya wukuf di Muzdalifah dilakukan setelah wukuf di Arafah sebagaimana yang ditunjukkan oleh huruf fa dan pengurutan. Keempat dan kelima: bahwasanya Arafah dan Muzdalifah adalah tempat syiar-syiar haji yang memang dimaksudkan untuk dikerjakan dan ditampakkan. Keenam: bahwasanya Muzdalifah itu termasuk daerah haram sebagaimana Ia dibatasi dengan kata Harom. Ketujuh: bahwasanya Arafah termasuk daerah hal sebagaimana yang terpahami dari pembatasan yang ada pada kata Muzdalifah. “Dan berdzikirlah (dengan menyebut) Allah sebagaimana yang ditunjukkanNya kepadamu; dan Sesungguhnya kamu sebelum itu benar-benar termasuk orang-orang yang sesat.” Maksudnya, berdzikirlah kalian kepada Allah sebagaimana Dia telah karuniakan kepada kalian hidayahNya setelah kesesatan, sebagaimana juga Dia telah mengajarkan kepada kalian apa-apa yang tidak kalian ketahui sebelumnya. Hal ini adalah sebesar-besarnya kenikmatan yang harus disyukuri dan dibalas dengan bersyukur kepada Allah yang telah memberikannya dengan hati maupun lisan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { جُنَاحٌ } Al-Junah : Dosa { تَبۡتَغُواْ فَضۡلٗا } Tabtaghuna Fadhlan : Mencari keuntungan pada jual beli di muslim haji. { أَفَضۡتُم مِّنۡ عَرَفَٰتٖ } Afadhtum min ‘arafaat : Bertolak dari Arafah setelah Wukuf di Arafah pada waktu haji. Yaitu setelah terbenamnya matahari pada hari kesembilan dari bulan Dzulhijjah. { ٱلۡمَشۡعَرِ ٱلۡحَرَامِۖ } Al-Masy’aril Haram : Muzdalifah dan dzikir kepada Allah, di sana melaksanakan shalat Maghrib dan Isya’ dengan jamak dan shalat Subuh. Makna ayat: Dan Allah memperbolehkan mereka untuk berdagang di tengah-tengah keberadaannya di Mekah dan Mina dalam firman Nya,”Tidak ada dosaa bagimu mencari karunia (rezeki hasil perniagaan) dari Rabbmu.” Yaitu menginginkan rizki yang halal dengan jalan berjual beli yang diperbolehkan. Allah Ta’ala lantas memerintahkan mereka untuk mengingat Allah Ta’ala (dzikrullah) di Muzdalifah, dengan melaksanakan shalat Maghrib, Isya, dan Subuh di sana. Hal itu setelah mereka selesai dari Arafah, yaitu sejak matahari terbenam. Allah Ta’ala berfirman,”Maka apabila kamu telah bertolak dari ‘Arafah, berdzikirlah kepada Allah di Masy’aril Haram.” Kemudian Allah Ta’ala menyebutkan nikmat hidayah yang mereka dapatkan setelah dahulu mereka berada dalam kesesatan, dan Allah memotivasi mereka untuk bersyukur kepada Nya dengan memperbanyak dzikir. Firman Allah Ta’a,”Dan berdzikirlah (dengan menyebut) Allah sebagaimana yang ditunjukkan Nya kepadamu; dan sesungguhnya kamu sebelum itu benar-benar termasuk orang yang sesat.” Selanjutnya Allah Ta’ala memerintahkan jama’ah haji untuk bersama-sama baik ketika wuquf di ‘Arafah maupun ketika bertolak meninggalkannya. Hendaknya mereka wuquf bersama-sama di ‘Arafah dan bertolak bersama-sama. Pelajaran dari ayat: • Diperbolehkan untuk berdagang dan bekerja bagi jama’ah haji untuk mencari rezeki, namun tidak menjadikan itu tujuan utamanya dalam berhaji. • Kewajiban untuk bermalam (mabit) di Muzdalifah untuk mengingat Allah (dzikrullah). • Kewajiban untuk bersyukur kepada Allah dengan mengingat Nya dan menaati Nya atas petunjuk dan nikmat-nikmat yang berasal dari Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 198: Allah mengabarkan bagi orang yang berhaji tidak ada pantangan untuk berjual beli dimusim haji"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berdagang di saat menunaikan ibadah hajji selama tidak melalaikan dari kewajiban dan maksud utamanya adalah hajji serta usahanya halal. Disebutkan \"karunia Allah\" untuk mengingatkan bahwa rezeki yang didapat adalah karunia Allah, agar seseorang tidak hanya melihat sebab dan melupakan yang mengadakan sebab, yaitu Allah, di mana hal itu merupakan dosa yang sesungguhnya. Imam Bukhari meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma ia berkata, \"Dahulu 'Ukaz, Majnah, dan Dzulmajaz adalah pasar-pasar di zaman jahiliyyah. Ketika Islam datang, kaum muslimin merasa berdosa berdagang, maka Allah Ta'ala menurunkan ayat, \"Laisa 'alaikum junaahun fii mawaasimil hajj\" menurut qira'at Ibnu Abbas. Abu Dawud meriwayatkan dari Abu Umamah At Taimiy, ia berkata, \"Saya adalah seorang yang suka melakukan sewa-menyewa dalam hal ini (ketika haji), sedangkan orang-orang, banyak yang berkata (kepada saya), \"Sesungguhnya kamu tidak memperoleh (pahala) haji,\" maka saya menjumpai Ibnu Umar dan berkata, \"Wahai Abu Abdurrahman! Sesungguhnya saya adalah seorang yang suka melakukan sewa-menyewa dalam hal ini (ketiika haji), sedangkan orang-orang, banyak yang berkata (kepada saya), \"Sesungguhnya kamu tidak memperoleh (pahala) haji,\" Maka Ibnu Umar berkata, \"Bukankah kamu berihram, bertalbiyah, berthawaf di Baitullah, dan bertolak dari 'Arafah serta melempar jamrah?\" Ia menjawab, \"Ya.\" Ibnu Umar berkata, \"Kamu memperoleh (pahala) haji. Karena pernah ada seorang yang datang kepada Nabi shallallahu 'alaihi wa sallam lalu bertanya seperti yang kamu tanyakan, maka Rasulullah shallallahu 'alaihi wa sallam diam terhadapnya dan tidak menjawab apa-apa, sehingga turun kepada Beliau ayat ini, \"Laisa 'alaikum junaahun an tabtaghuu fadhlam mir rabbikum\", maka Rasulullah shallallahu 'alaihi wa sallam mengirim seseorang kepadanya dan membacakan ayat tersebut serta menyampaikan bahwa, \"Kamu memperoleh (pahala) haji.\" (Hadits shahih) Setelah matahari tenggelam sehabis wuquf. Ialah bukit Quzah di Muzdalifah. Di dalam hadits disebutkan, bahwa Nabi shallallahu 'alaihi wa sallam wuquf di sana berdzikr dan berdo'a sampai pagi hari menjadi terang (sebagaimana dalam riwayat Muslim). Dari ayat \"Fa idzaa afadhtum….sampai 'indal masy'aril haram\" Syaikh As Sa'diy menyimpulkan beberapa kesimpulan –yang singkatnya sbb-: - Wuquf di 'Arafah dan bahwa wuquf adalah salah satu rukun hajji. Hal itu, karena bertolak dari Arafah tidak dilakukan kecuali setelah wuquf. - Perintah berdzikr ketika di Masy'aril haram, yaitu Muzdalifah, di mana pada malam harinya seseorang mabit di sana dan setelah shalat Subuh ia wuquf di Muzdalifah sambil berdo'a hingga pagi hari menjadi terang. Termasuk berdzikr adalah mengerjakan yang wajib dan yang sunat. - Wuquf di Muzdalifah dilakukan setelah wuquf di 'Arafah. - 'Arafah dan Muzdalifah termasuk syi'ar-syi'ar hajji yang diminta untuk dikerjakan dan ditampakkan. - Muzdalifah termasuk tanah haram, diambil dari kata masy'aril haram. - 'Arafah berada di luar tanah haram, karena telah disebutkan Muzdalifah. Yakni telah memberitahukan mana syi'ar-syi'ar agama-Nya, mengajarkan manasik hajji, memberikan petunjuk padahal sebelumnya mereka tersesat dan mengajarkan beberapa ilmu yang sebelumnya tidak mereka ketahui. Hal ini termasuk nikmat yang paling besar yang wajib disyukuri dan dibalas dengan mengingat pemberinya baik di hati maupun di lisan, oleh karena itu kita diperintahkan berdzikir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 198",
    "description": "Bukanlah suatu dosa bagimu mencari karunia dari tuhanmu beru-pa rezeki yang halal melalui berdagang, menawarkan jasa, dan menyewakan barang. Di antara kaum muslim ada yang merasa berdosa untuk berdagang dan mencari rezeki yang halal pada musim haji, padahal Allah membolehkannya dengan cara-cara yang diatur dalam Al-Qur'an. Maka apabila kamu bertolak dari arafah setelah wukuf, sejak matahari terbenam pada tanggal 9 zulhijah dan sudah sampai di muzdalifah, maka berzikirlah kepada Allah di masy'arilharam, yakni di muzdalifah, dengan tahlil, talbiah, takbir, dan tahmid. Dan berzikirlah kepada-Nya sebagaimana dia telah memberi petunjuk kepadamu mengikuti agama yang benar, keyakinan yang kukuh, ibadah yang istikamah, dan akhlak yang mulia, sekalipun sebelumnya kamu benar-benar termasuk orang yang tidak tahu. Zikir itu merupakan rasa syukur atas nikmat Allah yang telah membimbing para jamaah haji menjadi orang-orang berimankemudian bertolaklah kamu dari tempat orang banyak bertolak, yakni dari arafah setelah wukuf menuju masyarilharam, muzdalifah, mina, dan mekah, dan mohonlah ampunan kepada Allah di tempat-tempat tersebut dari semua dosa yang pernah dilakukan. Sungguh, Allah maha pengampun, maha penyayang kepada orang yang tobat dan memohon ampun. Orang arab jahiliah ketika menunaikan ibadah haji merasa tidak perlu mengikuti cara-cara orang banyak berwukuf di arafah, bermalam di muzdalifah, dan melempar jamrah, padahal semuanya berasal dari manasik haji yang dicontohkan oleh nabi ibrahim. Mereka meyakini bahwa tidak keluar dari mekah merupakan penghormatan terhadap kakbah dan tanah haram. Al-qur'an meluruskan hal ini, menegaskan bahwa tidak ada perbedaan dalam tata cara ibadah antara satu golongan dengan golongan yang lain. Prinsip ibadah adalah menaati perintah Allah dan mengikuti aturan-Nya dengan ikhlas."
  }
]