[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hendaklah cara kalian bertolak dari Arofah yang merupakan tempat Nabi Ibrahim bertolak itu berbeda dengan orang-orang di masa jahiliyah yang tidak Wukuf padanya. dan Mintalah kepada Allah agar mengampuni dosa-dosa kalian. Sesungguhnya Allah maha pengampun bagi hamba-hamba Nya yang memohon ampunan lagi bertaubat, maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "199. Kemudian bertolaklah kalian dari Arafah seperti yang dilakukan oleh Ibrahim -'alaihissalām-, bukan seperti yang dilakukan oleh orang-orang Jahiliah yang tidak mau wukuf di Arafah. Dan mintalah ampunan dari Allah atas kecerobohan kalian dalam menunaikan syariat-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertaubat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "199. Kemudian pergilah dari Muzdalifah pagi hari pada hari raya untuk menjalankan lempar jumrah dan penyembelihan hadyu serta amalan-amalan haji lainnya. Ini mencakup pula perintah untuk pergi dari Arafah sebagaimana Ibrahim pergi dari sana, hal ini tidak seperti orang-orang Jahiliyah yang tidak berwukuf di padang Arafah. Kemudian mintalah ampun kepada Allah, sungguh Dia Maha Pengampun bagi hamba-hamba-Nya yang memohon ampun dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "199. ثُمَّ أَفِيضُوا۟ مِنْ حَيْثُ أَفَاضَ النَّاسُ (Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak) Yakni dari Muzdalifah pada pagi hari di hari raya Ied Adha. وَاسْتَغْفِرُوا۟ اللَّـهَ ۚ (dan mohonlah ampun kepada Allah) Mereka diperintahkan untuk beristighfar karena berada di waktu turunnya rahmat, tempat diterimanya amalan, dan dikabulkannya do’a."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Membedakan diri dari kumpulan manusia secara khusus saat menunaikan ibadah haji dan sombong adalah perkara yang kerap dipelihara oleh orang-orang jahiliyah, Allah berfirman : { ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ } \"Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak ('Arafah)\" sebagaimana yang pernah dilakukan oleh Humsa dari golongan quraisy. 2 ). { وَاسْتَغْفِرُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } Istigfar merupakan penutup bagi setiap amalan shalih, istigfar dibaca untuk mengakhiri shalat, haji, qiyam lail, dan penutup pada majlis-majlis, Jika istighfar berfungsi sebagai dzikir, maka jadi penambah pahala. Sedangkan jika ada sesuatu yang sia-sia dalam ibadah, maka fungsi istighfar sebagai kafaroh (penambal). 3 ). Perhatikanlah firman Allah setelah menyebutkan hal-hal penting dalam ibadah haji : { وَاسْتَغْفِرُوا اللَّهَ ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ } salah satu hikmah dari perintah isitigfar pada ayat ini adalah, bahwasanya seseorang yang telah menunaikan ibadah haji sering ditutupi oleh rasa bahagia dan senang dalam dirinya, dan terkadang perasaan itu disertai dengan rasa takjub yang berlebihan atas amalan yang telah ia lakukan itu, mungkin dikarena ia telah melakukan amalan itu pada waktu yang singkat, dan disertai dengan rintangan yang cukup jelas, maka datanglah perintah untuk beristigfar; agar ia menutupi kekurangan yang mugkin tidak dapat dipungkiri oleh amalan haji, sehingga lenyaplah rasa takjub dan sombong yang muncul dalam diri seseorang, tetapi rasa bahagia dan senang atas keberhasilan menunaikan ibadah itu tidak dapat disalahkan : { قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا } \"Katakanlah: “Dengan kurnia Allah dan rahmat-Nya, hendaklah dengan itu mereka bergembira\" [ Yunus : 58 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "199. Kemudian bertolaklah dari Muzdalifah di waktu pagi saat hari raya, wahai orang-orang yang berhaji, yaitu tempat dimana orang bertolak dari Arafah, dan carilah ampunan di tempat-tempat dimana doa diijabah dan diterima. Sesungguhnya Allah itu Maha Pengampun dan Maha Pengasih bagi orang-orang yang bertaubat. Athabari meriwayatkan dari Ibnu Abbas yang berkata: “Kaum Baduwi berdiam di Arafah, dan kaum Quraisy berdiam di tempat selain Arafah yaitu Muzdalifah. Lalu Allah menurunkan ayat {Tsumma Afiidhuu…}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, bertolaklah kalian dari tempat orang-orang bertolak} bertolaklah dari Arafah {dan mohonlah ampunan kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "199. “Kemudian bertolaklah kamu dari tempat tertolaknya orang-orang banyak.” Maksudnya, kemudian bertolaklah kalian dari Muzdalifah dari tempat bertolak nya orang-orang dari sejak Nabi Ibrahim hingga sekarang. Dan yang dimaksud dengan bertolak tersebut telah diketahui oleh mereka, yaitu untuk melempar jumroh, menyembelih hewan kurban, thowaf, sa'i, bermalam di mina pada malam-malam Tasyrik, dan menyempurnakan sisa kegiatan manasik haji lainnya. Dan ketika bertolak, maksudnya adalah apa yang telah disebutkan dan hal-hal yang disebutkan pada akhir manasik, ketika telah selesai darinya, Allah memerintahkan untuk beristighfar dan banyak berdzikir kepadaNya. Istighfar tersebut untuk menutupi kekurangan yang terjadi pada seorang hamba dalam melaksanakan ibadahnya dan kelalaiannya padanya, sedangkan dzikir kepada Allah adalah wujud syukuran atas segala nikmat yang telah diberikan dengan taufikNya dalam melaksanakan ibadah yang agung dan karunia yang tak terkira tersebut. Demikianlah seharusnya yang dilakukan seorang hamba setiap kali ia selesai dari suatu ibadah, sepatutnya ia beristighfar kepada Allah dari kelalaiannya dan bersyukur atas TaufikNya, bukan seperti orang yang memandang bahwa ia telah menyempurnakan ibadah, dan telah berbuat baik kepada Allah dan ibadah itu menjadikannya menempati posisi yang tinggi, sesungguhnya orang seperti ini berhak atas kemurkaan dan amalnya ditolak, sebagaimana yang pertama berhak untuk dikabulkan dan diberi Taufik kepada amalan-amalan yang lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Allah berfirman,”Kemudian bertolaklah dari tempat bertolaknya orang-orang.” Hal itu karena istilah Al-Hams, yaitu mereka dahulu bertolak meninggalkan ‘Arafah dari tempat yang paling dekat, sehingga dapat terhindar dari kemacetan dan selamat dari reruntuhan. Terakhir, Allah Ta’ala memerintahkan mereka untuk beristighfar kepada Nya, yaitu memohon ampunan dari Nya dan Allah menjanjikan ampunan untuk mereka dalam firman Nya,”Dan memohon ampunlah kalian kepada Allah, sesungguhnya Allah Maha Pengampun lagi Maha Pengasih.” Pelajaran dari ayat: • Wajib untuk persamaan dalam melaksanakan manasik haji, tidak ada mendahului satu sama lain antar jama’ah haji dalam pelaksanaan ibadah dalam ibadah-ibadah yang terdapat dalam manasik haji. • Anjuran untuk bersemangat dalam istighfar dan memperbanyak istighfar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 199: Allah memerintahkan bagi jamaah haji untuk berkumpul di mudzalifah diwaktu pagi untuk bersiap untuk menuju mina dan dianjurkan untuk banyak istighfar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalalain diterangkan bahwa ayat ini turun berkenaan dengan orang-orang Quraisy yang berwuquf di Muzdalifah karena tidak mau wuquf di 'Arafah bersama yang lain. Imam Bukhari meriwayatkan dari Hisyam bin Urwah, bahwa Urwah berkata, \"Dahulu di zaman jahiliyyah manusia berthawaf dalam keadaan telanjang selain orang-orang Hums, -yaitu orang-orang Quraisy dan keturunannya-. Ketika itu orang-orang hums mencari keridhaan Allah Ta'ala dengan memberikan pakaian kepada manusia agar ia berthawaf dengannya, demikian juga kepada wanita. Bagi orang yang tidak diberi pakaian oleh orang-orang Hums, maka ia akan berthawaf dengan telanjang. Ketika itu, orang-orang banyak yang bertolak dari 'Arafah, sedangkan orang-orang Hums bertolak dari Jam' (Muzdfalifah). Hisyam berkata, \"Bapakku (Urwah) memberitahukan aku dari Aisyah radhiyallahu 'anha, bahwa ayat ini, \"Tsumma afiidhuu min haitsu afaadhan naas,\" turun berkenaan dengan orang-orang hums yang bertolak dari Jam' (Muzdalifah), hingga kemudian mereka bertolak dari 'Arafah.\" Imam Bukhari juga meriwayatkan dari Aisyah radhiyallahu 'anha, bahwa orang-orang Quraisy dan yang mengikuti agama mereka berwuquf di Muzdalifah, mereka disebut hums (orang-orang yang semangat), sedangkan orang-orang Arab yang lain berwuquf di 'Arafah. Ketika Islam datang, Allah memerintahkan Nabi-Nya shallallahu 'alaihi wa sallam untuk mendatangi 'Arafah, lalu berwuquf di sana kemudian bertolak daripadanya. Itulah maksud firman Allah Ta'ala, \"Tsumma afiidhuu min haitsu afaadhan naas.\" Menurut Syaikh As Sa'diy, bertolak di ayat ini adalah bertolak dari Muzdalifah dari tempat orang-orang bertolak, sejak zaman Nabi Ibrahim 'alaihis salam sampai sekarang. Yang dimaksud \"berttolak\" di sini menurut beliau adalah melempar jumrah, menyembelih hadyu, berthawaf, sa'i, mabit di Mina pada malam-malam hari tasyriq dan menyempurnakan manasik sisanya. Setelah selesai menjalankan manasik hajji, Allah Subhaanahu wa Ta'aala memerintahkan untuk beristighfar dan banyak berdzikr. Istighfar tersebut dilakukan karena adanya kekurangan pada seorang hamba ketika mengerjakan ibadahnya. Demikianlah yang patut dilakukan oleh seorang hamba seusai melaksanakan ibadah, ia meminta ampunan kepada Allah atas kelalaiannya dan bersyukur atas taufiq-Nya, tidak seperti orang yang menyangka bahwa dirinya telah sempurna dalam menjalankan ibadah dan telah memberi nikmat kepada Tuhannya, hal ini akan mendatangkan murka dan ditolaknya amal, sedangkan yang pertama tadi layak untuk diterima amalnya dan diberi taufiq untuk menjalankan amal selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 199",
    "description": "Kemudian bertolaklah kamu dari tempat orang banyak bertolak, yakni dari arafah setelah wukuf menuju masyarilharam, muzdalifah, mina, dan mekah, dan mohonlah ampunan kepada Allah di tempat-tempat tersebut dari semua dosa yang pernah dilakukan. Sungguh, Allah maha pengampun, maha penyayang kepada orang yang tobat dan memohon ampun. Orang arab jahiliah ketika menunaikan ibadah haji merasa tidak perlu mengikuti cara-cara orang banyak berwukuf di arafah, bermalam di muzdalifah, dan melempar jamrah, padahal semuanya berasal dari manasik haji yang dicontohkan oleh nabi ibrahim. Mereka meyakini bahwa tidak keluar dari mekah merupakan penghormatan terhadap kakbah dan tanah haram. Al-qur'an meluruskan hal ini, menegaskan bahwa tidak ada perbedaan dalam tata cara ibadah antara satu golongan dengan golongan yang lain. Prinsip ibadah adalah menaati perintah Allah dan mengikuti aturan-Nya dengan ikhlas. Apabila kamu telah menyelesaikan ibadah haji seperti tawaf, sai, wukuf di arafah, bermalam di muzdalifah, melempar jamrah, tahalul, dan tawaf wada', maka berzikirlah kepada Allah, sebagaimana kamu menyebut-nyebut nenek moyang kamu dalam tradisi jahiliah dengan khidmat, khusyuk, dan takzim; bahkan berzikirlah kepada Allah dengan lebih takzim dari itu. Maka di antara manusia ada yang berdoa, ya tuhan kami! berilah kami kebaikan di dunia, seperti hidup yang sehat, harta yang banyak, dan keturunan yang cerdas sehingga terhormat dan bermartabat, tetapi di akhirat dia tidak memperoleh bagian apa pun karena tidak beriman dan beramal saleh."
  }
]