[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alquran itu adalah kitab yang agung yang tidak ada keraguan bahwasanya ia datang dari sisi Allah, maka tidak benar bila ada seseorang yang ragu-ragu terhadap nya karena begitu jelasnya alquran itu. Dimana orang-orang yang bertaqwa dapat mengambil manfaat dengannya berupa ilmu yang bermanfaat dan amal sholeh dan mereka itu adalah orang-orang yang takut kepada Allah dan mengikuti hukum-hukum-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Al-Qur`ān yang agung itu tidak ada keraguan di dalamnya, baik dari segi proses turunya maupun lafal dan maknanya. Al-Qur`ān adalah firman Allah yang membimbing orang-orang bertakwa ke jalan yang menghantarkan mereka kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. ذَٰلِكَ الْكِتَابُ yakni al-Qur’an ini yang tinggi derajatnya لَا رَيْبَ ۛ فِيهِ ۛ tidak ada keraguan bahwa ia datang Allah Ta’ala هُدًى لِلْمُتَّقِينَ (sebagai hidayah bagi orang-orang yang bertaqwa). Makna dari (الهدى) adalah dalil yang mengantarkan pada tujuan. Pendapat dari Ibnu Abbas dalam kalimat (هدى للمتقين): yakni orang-orang yang takut pada hukuman dari Allah karena meninggalkan hidayah yang mereka ketahui dan mengharapkan rahmat-Nya dengan meyakini apa yang datang dari-Nya. Dari Abu Hurairah disebutkan bahwa seorang laki-laki bertanya kepadanya: apa itu taqwa? Dia pun menjawab: apakah kamu pernah berjalan di jalan yang berduri? Lelaki itu menjawab: Pernah. Abu Hurairah membalasnya: Lalu apa yang kau lakukan ketika itu?. Dia menjawab: jika aku melihat duri aku berbelok, memanjangkan langkahku agar melewatinya, atau memendekkan langkah agar tidak mengenainya. Abu Hurairah berkata: maka demikianlah takwa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tatkala seorang hamba berucap dengan taufiq Tuhannya : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ }, dikatakan kepadanya : { ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ } itulah permintaanmu, yang dialamnya segala keperluan dan kebutuhanmu tertulis, itulah jalan yang lurus bagimu : { هُدًى لِلْمُتَّقِينَ } petunjuk bagi orang-orang bertaqwa yang berkata : { اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ } , dan mereka takut dari keadaan orang-orang yang dimurkai dan tersesat. 2 ). Sesungguhnya hanya orang yang mau menerima hidayah lah yang akan mendapatkan hidayah itu, dan mereka adalah orang yang bertaqwa tidak bagi semua orang. 3 ). Sebagaimana halnya al-Qur'an adalah sebaik-baiknya ucapan baik derajat ataupun makna, maka tempat yang tepat untuknya adalah tempat yang suci dan terang ( dan dalam hal ini adalah hati orang-orang yang bertaqwa ), oleh karena itu Allah berfirman : { هُدًى لِلْمُتَّقِينَ } kemudian disebutkan dalil kepastiannya, yaitu bahwasanya para muttaqien { بِالْغَيْبِ وَيُقِيمُونَ } ; maka sesungguhnya perkara ini adalah hasil dari sikap optimis hati terhadap petunjuk al-Qur'an dan ketaqwaan manusia. 4 ). Jika hati senantiasa dihidupkan dengan taqwa seorang hamba akan mengambil lebih banyak dari al-Qur'an, seperti halnya dengan hujan yang turun dari langit, jika mendapatkan tanah yang baik, akan datang musim semi yang menakjubkan semua mata, tidakkah kamu membaca hakikat kebenaran ini pada ayat yang ada di awal al-Qur'an ? perhatikanlah : { هُدًى لِلْمُتَّقِينَ }; dengan ini akan terungkan sebab banyaknya manusia yang tidak mengambil manfaat dari al-Qur'an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Inilah Al-Qur’an yang agung, yang tidak diragukan lagi bahwa itu (diturunkan) dari sisi Allah SWT. Sesungguhnya Al-Qur’an adalah petunjuk dan pembimbing menuju kebaikan. Al-Qur’an membimbing orang-orang yang bertakwa kepada Tuhan mereka dengan menaati printah-perintahNya, menjauhi larangan-laranganNya dan meninggalkan kemaksiatan, kemudian mereka mengambil manfaat darinya. Itu adalah tiga gambaran tentang Al-Qur’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kitab (Al-Qur’an) itu} Al-qur’an {tidak ada keraguan di dalamnya} tidak ada keraguaan di dalamnya; {(merupakan) petunjuk bagi orang-orang yang bertakwa} bagi orang-orang yang menjaga diri mereka dari adzab Allah dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. FirmanNya , “kitab itu” , yakni kitab suci yang agung ini dalam arti hakiki, yang mengandung hal-hal yang tidak dikandung oleh kitab-kitab terdahulu maupun sekarang berupa ilmu yang agung dan kebenaran yang nyata, ”tidak ada keraguan padanya”, dan juga tidak ada kebimbangan padanya dalam bentuk apapun. Meniadakan keraguan dari kitab ini mengharuskan apa yang bertentangan dengannya, di mana hal yang bertentangan dengan hal itu adalah keyakinan, maka kitab ini mengandung ilmu keyakinan yang menghapus segala bentuk keraguan dan kebimbangan. Ini merupakan suatu kaidah yang menunjukkan bahwa peniadaan disini maksudnya adalah pujian yang harus melingkupi hal yang bertentangan dengannya yaitu kesempurnaan, karena peniadaan adalah suatu yang tidak ada, sedangkan hal yang tiada secara murrni itu tidak ada pujian padanya. Dan karena kitab suci ini mengandung keyakinan sedangkan hidayah itu tidaklah akan dapat diperoleh kecuali dengan keyakinan, maka Allah berfirman, ”petunjuk (hidayah) bagi mereka yang bertakwa.” Hidayah itu adalah suatu yang memberikan hidayah dari kesesatan dan kesamaran, dan (sebaliknya) membimbing untuk menempuh jalan yang berguna. Allah berfirman di sini, ”petunjuk’’ dan tidak merinci bentuk petunjuknya, Dia tidak berfirman “petunjuk untuk kemaslahatan ini atau untuk kepentingan begini, ” karena yang dimaksud adalahn keumuman (mencakup semua maslahat dan kebaikan), dan bahwasanya ia adalah petunjuk untuk seluruh kemaslahatan kedua negeri, ia adalah pembimbing bagi hamba dalam masalah-masalah ushul (pokok) dan masalah-masalah furu’ (cabang), pemberi penjelasan untuk kebenaran dari kebatilan, dan yang shahih dari yang lemah, dan pemberi penjelasan bagi mereka tata cara menempuh jalan yang berguna bagi mereka di dunia dan akhirat mereka. Allah berfirman pada tempat yang lain, ”petunjuk bagi manusia.” (Al-Baqarah: 185). Ini juga umum mencakup semua (untuk seluruh manusia), sedangkan pada pembahasan ini dan yang selainnya adalah ”petunjuk bagi mereka yang bertakwa, ” karena sesungguhnya dalam hal itu sendiri telah bermakna petunjuk bagi seluruh manusia, sedangkan orang-orang yang celaka tidak memperhatikan hal itu dan mereka tidak menerima petunjuk Allah, maka dengan petunjuk ini, hujjah telah ditegakkan atas mereka, dan nereka tidak mengambil manfaat dengannya, dikarenakan mereka adalah orang-orang celaka. Orang-orang yang bertakwa ialah orang-orang yang melakukan sebab yang terbesar demi memperoleh petunjuk yaitu ketakwaan, yang mana hakikatnya adalah menjalankan perkara yang dapat melindungi dari kemurkaan Allah dan azabNya dengan cara mengerjakan perintah-perintahNya dan menjauhi larangan-laranganNya, lalu mereka mengambil petunjuk dengan itu dan mengambil manfaat darinya dengan sebenar-benarnya. Maka orang-orang yang bertakwa adalah mereka yang mengambil manfaat dengan ayat-ayat al-Qur’an dan ayat-ayat kauniyah, juga karena hidayah itu ada dua macam;hidayah penjelasan dan hidayah taufik. Maka orang-orang yang bertakwa mendapatkan kedua hidayah tersebut sedangkan selain dari mereka tidak mendapatkan hidayah taufik, karena hidayah penjelasan tanpa mendapat hidayah taufik untuk mengamalkannya bukan merupakan hidayah secara hakiki dan sempurna. Kemudian Allah menggambarkan ciri orang-orang yang bertakwa tersebut, yaitu memiliki keyakinan-keyakinan dan amalan-amalan batin serta amalan-amalan lahir, karena ketakwaan memang mencakup semua itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Dzaalika arti sebenarnya adalah itulah, akan tetapi di sini diartikan dengan “inilah”. Pergeseran arti dari “itulah” ke “inilah” karena huruf Lam menunjukkan isyarat kepada sesuatu yang jauh, dan itu memberikan kesan tingginya kedudukan dan derajat al-Qur’an. Al-Kitaab yaitu Al-Qur’anul Kariim yang dibaca oleh Rasulullah g kepada seluruh manusia. Laa Raiba artinya tidak ada keraguan sedikitpun bahwa Al-Qur’an adalah wahyu dari Allah dan kalamNya yang diwahyukan kepada rasulNya. Fiihi Hudan yakni di dalamnya ada petunjuk untuk meniti jalan yang menghantarkan kepada kebahagiaan dan kesempurnaan di dunia dan akhirat. Lil muttaqiin adalah orang-orang yang menjaga dirinya dari adzab Allah dengan melakukan ketaatan, yaitu dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya. Makna ayat : Allah Ta’ala memberitahukan bahwa Al-Qur’an yang diturunkan kepada rasulNya merupakan kitab yang agung, tidak ada keraguan sedikitpun, dan tidak ada kemungkinan bahwa al-Qur’an itu bukanlah wahyu Allah, sebagai bentuk mukjizat. Kemudian kandungan Al-Qur’an yang berupa petunjuk dan cahaya bagi orang beriman dan bertakwa, dapat menerangi mereka untuk meniti jalan keselamatan, kebahagiaan dan kesempurnaan. Pelajaran dari ayat : 1. Penguatan keimanan kepada Allah Ta’ala, kitabNya, dan rasulNya. Serta motivasi untuk senantiasa meminta petunjuk dari al-Qur’an. 2. Penjelasan mengenai keutamaan takwa dan orang-orang yang bertakwa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 2: Allah mengabarkan bahwa Al-Qur’an ini tiada keraguan dan kebimbangan padanya, Allah telah menurunkan hidayah bagi mereka yang bertaqwa yang mereka bersegera mengerjakan perintah-perintah Allah dan menjauhi larangan-larangan-Nya. Dan firman-Nya dzalika adalah isyarat akan keagungan dan ketinggian kedudukannya serta mulia urusannya. Dan telah diketahui bahwa setiap kitab yang ditulis akan didapati penulisnya memiliki kekurangan padanya, dan mereka (para penulis) akan senantiasa meminta maaf dan udzur kepada pembacanya atas kekeliruan dan kekurangan. Adapun Al-Qur’an maka tidak ada keraguan, kebimbangan, kekosongan dan juga perselisihan di dalamnya. Ini merupakan mukjizat dari Allah dan sebagai tantangan bagi yang menolak dari orang-orang kafir dan mereka yang tersesat dari quraisy, di mana mereka menyombongkan diri dan menolak akan penyampaian Al-Qur’an, dan mereka menolak menerima Al-Qur’an di mana tidak seorangpun dapat memaksa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Ta'ala menamakan Al Qur'an dengan Al kitab berarti \"yang ditulis\", sebagai isyarat bahwa Al Quran diperintahkan untuk ditulis. Yakni tidak ada keraguan bahwa ia berasal dari Allah Ta'ala, sehingga tidak benar masih meragukannya karena jelas sekali buktinya. Orang-orang yang bertakwa mengambil manfaat darinya, menjadikannya sebagai petunjuk dan ilmu yang bermanfaat serta membuat mereka dapat beramal shalih. Mereka memperoleh dua hidayah; hidayah irsyad (ilmu/petunjuk) dan hidayah taufiq (bisa beramal). Al Qur’an meskipun sesungguhnya petunjuk bagi semua manusia, namun hanya orang-orang yang bertakwa yang mau mengambilnya sebagai petunjuk dan melaksanakan isinya. Takwa yaitu memelihara diri dari siksaan Allah dengan mengikuti segala perintah-Nya; dan menjauhi segala larangan-Nya; tidak cukup diartikan dengan takut saja. Orang-orang yang bertakwa mengambil manfaat darinya, menjadikannya sebagai petunjuk dan ilmu yang bermanfaat serta membuat mereka dapat beramal shalih. Mereka memperoleh dua hidayah; hidayah irsyad (ilmu/petunjuk) dan hidayah taufiq (bisa beramal). Al Qur’an meskipun sesungguhnya petunjuk bagi semua manusia, namun hanya orang-orang yang bertakwa yang mau mengambilnya sebagai petunjuk dan melaksanakan isinya. Takwa yaitu memelihara diri dari siksaan Allah dengan mengikuti segala perintah-Nya; dan menjauhi segala larangan-Nya; tidak cukup diartikan dengan takut saja. Kata huda (petunjuk) pada ayat di atas adalah umum, yakni bahwa Al Qur'an merupakan petunjuk terhadap semua maslahat di dunia dan akhirat, ia merupakan pembimbing manusia dalam masalah ushul (pokok seperti keyakinan) maupun furu' (cabang), menerangkan yang hak dan menerangkan kepada mereka jalan yang dapat memberikan manfaat di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 2",
    "description": "Inilah kitab yang sempurna dan penuh keagungan, yaitu Al-Qur'an yang kami turunkan kepada nabi Muhammad, tidak ada keraguan padanya tentang kebenaran apa-apa yang terkandung di dalamnya, dan orang-orang yang berakal sehat tidak akan dihinggapi keraguan bahwa Al-Qur'an berasal dari Allah karena sangat jelas kebenarannya. Al-Qur'an juga menjadi petunjuk yang sempurna bagi mereka yang mempersiapkan diri untuk menerima kebenaran dengan bertakwa, yaitu mengikuti segala perintah Allah dan menjauhi segala larangan-Nya agar terhindar dari siksa Allah. Meski petunjuk Al-Qur'an diperuntukkan bagi seluruh umat manusia, hanya orang-orang bertakwa saja yang siap dan mampu mengambil manfaat darinya. Orang-orang yang bertakwa itu adalah mereka yang beriman kepada hal-hal yang gaib, yang tidak tampak dan tidak dapat dijangkau oleh akal dan indra mereka, seperti Allah, malaikat, surga, neraka, dan lainnya yang diberitakan oleh Allah dan rasul-Nya. Pada saat yang sama, sebagai bukti keimanan itu, mereka beribadah kepada Allah dengan melaksanakan salat, secara sempurna berdasarkan tuntunan Allah dan rasul-Nya, khusyuk serta memperhatikan waktu-waktunya, dan mereka juga menginfakkan di jalan kebaikan sebagian rezeki berupa harta, ilmu, kesehatan, kekuasaan, dan hal-hal lainnya yang bermanfaat yang kami berikan kepada mereka, semata-mata sebagai bentuk ketaatan kepada Allah dan mencari keridaan-Nya."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Isyarat yang Allah gunakan dalam ayat ini bermakna “kitab yang agung ini (alquran) yang merupakan kitab yang haqiqy yang isi kandungannya mencakup segala hal bahkan yang belum pernah ada dalam kandungan kitab-kitab sebelumnya seperti taurot, injil dan zabur. Tidak ada keraguan sedikitpun dalam kebenaran isi kandungannya yang berfungsi sebgai petunjuk bagi orang-orang yang bertaqwa dari kesesatan kepada kebenaran”. Ibnu katsir meriwayatkan bahwa makna “alkitab” dalam ayat ini adalah Alquran. Begitupula imam Al-Qurtubi dalam tafsirnya meriwayatkan makna “alkitab” dalam ayat ini adalah Alquran yang telah dijanjikan kepada Rosululloh Shallallahu 'alaihi wa Sallam yang akan diturunkan kepadanya. Hal ini membantah pendapat beberapa ahli tafsir seperti Imam Ibnu Jarir At-tobari yang berpendapat bahawa makna “alkitab” ditunjukan kepada kitab-kita sebelum alquran seperti kitab Taurot, zabur dan injil. Tidak ada sedikitpun keraguan yang terkandung dalam kitab ini, semuanya bersifat yakin dan pasti. Kandungan Al-Quran yang meliputi segala hukum dalam syariat islam tentunya datang dengan penuh kepastian dari Allah Subhanahu wa Ta'ala. Karena hanya dengan sesuatu yang pastilah akan munculnya petunjuk. Dan tidak mungkin seseorang menjadikan sesuatu yang ada keraguan di dalamnya sebagai petunjuk hidupnya untuk meraih surganya Allah Subhanahu wa Ta'ala. Kepastian dan keyakinan isi kandungan alquran juga disebutkan dalam ayat lain, yaitu firman-NYA: تَنْزِيلُ الْكِتَابِ لَا رَيْبَ فِيهِ مِنْ رَبِّ الْعَالَمِينَ “Turunnya Al-Quran yang tidak ada keraguan di dalamnya, (adalah) dari Tuhan semesta alam”. (QS. As-Sajdah :2) Sebagian ulama mengatakan, kalimat “tidak ada keraguan di dalamnya” yang digunakan dalam ayat ini bersifat khobar atau berita akan tetapi maknanya adalah nahyi atau larangan, yakni “janganlah kalian meragukannya”. Ulama ahli qiroah menganjurkan dalam pembacaan ayat ini hendaklah berwaqof (berhenti) pada kalimat “laa roiba fiih”. Hal ini dikeranakan makna yang terkandung dalam ayat ini seperti dijelaskan diatas. Lalu melanjutkan kalimat “hudan lilmuttaqiin” yang menjadi sifat dari alquran. Sifat alquran dalam ayat ini yang juga merupakan fungsinya adalah sebagai “hudan” (petunjuk) bagi orang-orang yang bertaqwa. Alhuda adalah satu kata yang bermakna petunjuk yang pasti yang menenangkan hati yang Allah berikan dalam bentuk keimanan kepada hati seseorang. Tidak ada yang bisa memberikannya kecuali Allah semata. Bahkan serorang nabi pun tidak mampu melakukannya tanpa izin dari Allah Subhanahu wa Ta'ala. Sebagaiman firman-NYA : إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ “Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk”. (QS. Al-Qhoshos :56) Mendapatkan petunjuk merupakan sesuatu angurah yang sangat besar dari Allah. Karenanya Hanya orang-orang yang bertaqwa saja yang akan mendapatkan petunjuk dari Allah Subhanahu wa Ta'ala. Orang bertaqwa juga dimaknai sebagai orang yang beriman, Artinya hanya orang-orang beriman saja yang akan mendapatkan petunjuk dari alquran ini, sebagaimana disebutkan dalam firman Allah yang lain : قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ Katakanlah: \"Al Quran itu adalah petunjuk dan penawar bagi orang-orang mukmin. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, sedang Al Quran itu suatu kegelapan bagi mereka. Mereka itu adalah (seperti) yang dipanggil dari tempat yang jauh\". (QS. Fushilat :44) Dan firman-NYA : وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ وَلَا يَزِيدُ الظَّالِمِينَ إِلَّا خَسَارًا “Dan Kami turunkan dari Al Quran suatu yang menjadi penawar dan rahmat bagi orang-orang yang beriman dan Al Quran itu tidaklah menambah kepada orang-orang yang zalim selain kerugian”. (QS. Al-Isro :82) Yang dimaksud dengan kalimat “muttaqiin” dalam ayat ini adalah mereka yang melaksanakan perintah Allah dan menjauhi hal-hal yang Allah haramkan. Ibnu Abi hatim mengatakan, telah menceritakan kepada kami Abdulloh bin Imron, dari Ishaq Ibnu Sulaiman – yakni Ar-Rozi- dari Almugiroh Ibnu Muslim, dari maimun Abu hamzah telah berkata : “ketika dia sedang duduk di dekat Abu Wail, masuk-lah seorang laki-laki yang dikenal dengan sebutan Abu Afif, salah seorang muridnya Muadz. Syafiq Ibnu Salamah berkata kepadanya “Hai Abu Afif, tidakkah engkau ceritakan kepada kami apa yang telah dikatakan Muadz ibnu Jabal kepadmu?” Abu Afif menjawab “tentu saja, aku pernah mendenga Muadz Bin Jabal berkata bahwa kelak di hari kiamat umat manusia ditahan di suatu tempat, kemudian ada suara yang menyerukan “dimanakah orang-orang yang bertaqwa?”. Lalu mereka (orang-orang yang bertaqwa) bangkit dibawah naungan Tuhan mereka yang Maha Pemurah, Allah menampakan diri-NYA kepada mereka tanpa ada hijab yang menutupi diri-NYA” aku bertanya kepada Muadz “siapakah orang-orang yang bertaqwa itu?”. Muadz menjawab “mereka adalah orang-orang yang menghindarkan dirinya dari perbuatan syirik dan penyembahan berhala, mereka mengikhlaskan ibadah hanya kepada Allah semata, lalu mereka masuk ke dalam surga”."
  }
]