[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Begitu dekatnya dari dahsyatnya cahaya kilat menyambar pandangan mereka, walaupun demikian setiap kali cahaya menerangi mereka, maka mereka berjalan pada cahaya itu, dan jika cahayanya menghilang maka jalan pun menjadi gelap bagi mereka sehingga mereka menghentikan langkah di tempat mereka . dan seandainya bukan karena Allah menunda siksa bagi mereka pastilah Allah akan mencabut pendengaran dan penglihatan mereka. Dan Allah Maha Kuasa atas hal tersebut di setiap waktu dan Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kilat itu nyaris membutakan mata mereka karena kuatnya kilauan dan cahayanya. Setiap kali kilat itu muncul dan bersinar mereka bergerak maju. Jika kilat itu tidak menunjukkan sinarnya mereka bertahan di tengah kegelapan dan tidak bisa bergerak. Sekiranya Allah menghendaki, niscaya Dia akan melenyapkan pendengaran dan penglihatan mereka dengan kekuasaan-Nya yang mencakup segala sesuatu, sehingga mereka tidak bisa lagi mendengar dan melihat, karena mereka telah berpaling dari kebenaran. Hujan itu adalah perumpamaan bagi Al-Qur`ān, suara petir itu adalah perumpamaan bagi larangan-larangan yang ada di dalamnya, dan sinar kilat itu adalah perumpamaan bagi kebenaran yang kadang-kadang muncul untuk mereka, sedangkan menutup telinga karena kerasnya suara petir adalah perumpamaan bagi sikap mereka yang berpaling dari kebenaran dan keengganan mereka menerimanya. Titik kesamaan antara orang-orang munafik dan orang-orang yang ada di dalam dua perumpamaan tersebut ialah tidak bisa mengambil manfaat yang ada. Dalam perumpamaan dengan api, orang yang menyalakan api itu tidak mendapatkan manfaat apapun selain kegelapan dan sisa-sisa pembakaran. Sedangkan dalam perumpamaan air, orang-orang yang ditimpa air hujan itu tidak mendapatkan manfaat apa-apa selain petir dan kilat yang membuat mereka ketakutan. Begitu juga dengan orang-orang munafik, mereka tidak melihat apapun di dalam Islam selain kekerasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Kilat itu hampir-hampir menghilangkan penglihatan mereka karena kilauan cahayanya yang sangat kuat, sehingga merekapun dalam keadaan bahaya meski saat mendapat cahaya, walaupun cahaya itu sedikit membantu mereka untuk berjalan; namun jika cahaya itu telah hilang maka mereka kembali berhenti dan kebingungan. Kalaulah Allah berkehendak niscaya Dia akan mengambil pendengaran mereka dengan suara petir yang menggelegar dan mengambil penglihatan mereka dengan cahaya kilat yang menyilaukan. Kemudian Allah menyebutkan alasan hal itu dengan firman-Nya: (إن الله على كل شيء قدير) Yakni, Dzat yang memiliki segala sifat kesempurnaan yang mampu melakukan itu dan melakukan segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. يَكَادُ الْبَرْقُ يَخْطَفُ اَبْصَارَهُمْ ۗ (Hampir-hampir kilat itu menyambar penglihatan mereka) Yakni hampir-hampir ayat-ayat al-Qur’an yang jelas itu membuka aib-aib para orang munafik كُلَّمَآ اَضَاۤءَ لَهُمْ مَّشَوْا فِيْهِ (Setiap kali kilat itu menyinari mereka, mereka berjalan di bawah sinar itu) Yakni apabila harta dan anak-anak mereka banyak dan mendapatkan harta rampasan perang dan menakhlukkan maka mereka berjalan sambal berkata: sesungguhnya agama Muhammad Shallallahu ‘Alaihi Wasallam adalah agama yang benar. Dan merekapun mencoba untuk istiqamah diatas agama islam. وَاِذَآ اَظْلَمَ عَلَيْهِمْ قَامُوْا (dan bila gelap menimpa mereka, mereka berhenti) Yakni apabila harta mereka musnah dan musibah menimpa mereka, mereka berkata: ini disebabkan oleh agama Muhammad Shallallahu ‘Alaihi Wasallam Shallallahu ‘Alaihi Wasallam. Dan merekapun murtad dari agama Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang munafik itu seperti orang yang menerjang petir, mereka berjalan dalam cahaya namun berhenti dalam kegelapan. Ketika kondisi materi keduniaan mereka membaik, mereka mengambil keuntungan dari kenikmatan-kenikmatan itu. Mereka mengumumkan keimanan mereka dan menegakkan Islam. Akan tetapi ketika mereka mendapatkan cobaan, mereka berhenti berjalan, marah, memakai pakaian kafir mereka dan menunjukkan kemunafikan mereka. Dan Allah berkuasa untuk tidak membuat mereka cacat sedikitpun. Apabila berkehendak, niscaya Dia akan melenyapkan pendengaran dan penglihatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hampir saja} hampir {kilat itu menyambar} mengambil dengan sangat cepat {penglihatan mereka. Setiap kali kilat itu menyinari mereka, mereka berjalan di bawah sinar itu. Apabila gelap menyelimuti mereka, mereka berdiri} mereka diam di tempat {Sekiranya Allah berkehendak, niscaya Dia menghilangkan pendengaran dan penglihatan mereka. Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. ”Setiap kali kilat itu menyinari mereka, ” yakni kilat dalam kegelapan-kegelapan tersebut, ”mereka berjalan dibawah sinar itu, dan bila gelap menimpa mereka, mereka berhenti, ” yakni mereka diam. Seperti itulah kondisi orang-orang munafik ketika mereka mendengarkan al-Qur’an, perintah-perintahnya, larangan-larangannya, janji dan ancamannya. Mereka meletakkan jari jemari mereka pada telinga-telinga mereka dan mereka berpaling dari perintahnya, larangannya, janjinya dan ancamannya, lalu ancamannya mengusik mereka, janji-janjinya mengganggu mereka, dan mereka berpaling darinya dengan sekuat tenaga, hingga membuat mereka lebih kokoh, mereka membencinya seperti seorang yang terkena hujan dan ia mendengar guruh lalu meletakkan jari jemarinya pada kedua telinganya karena takut dari kematian. Orang seperti ini masih mempunyai kemungkinan memperoleh keselamatan, adapun orang-orang munafik, dari manakah mereka memperoleh keselamatan, padahal Allah ta’ala mengawasi mereka, baik dengan Kuasa maupun ilmuNya, dan mereka tidak akan lepas dariNya dan tidak mampu melemahkan-Nya, bahkan Dia akan mencatat perbuatan-perbuatan mereka lalu kelak akan memberikan balasan atasnya dengan balasan yang setimpal. Dan ketika mereka diuji dengan ketulian, kebutaan, dan kebisuan maknawi serta tertutupnya pintu-pintu keimanan bagi mereka, Allah berfirman, “jikalau Allah menghendaki, niscaya Dia melenyapkan pendengaran dan penglihatan mereka” yaitu yang bersifat nyata. Ini merupakan sebuah tindakan agar mereka takut, dan peringatan dari hukuman dunia, agar mereka berhati-hati lalu mengambil pelajaran dari sebagian kejahatan dan kemunafikan mereka. “Sesungguhnya Allah berkuasa atas segala sesuatu.” Dia tidaklah lemah terhadap apa pun, dan di antara KuasaNya adalah bahwa apabila Dia menghendaki sesuatu, niscaya Dia lakukan, tanpa ada yang bisa menghalangi dan tanpa ada yang bisa merintangi. Dalam ayat ini ada ayat-ayat yang semisalnya ada sebuah jawaban terhadap golongan al-Qadariyah yang berpendapat bahwasanya perbuatan-perbuatan mereka tidaklah termasuk dalam Kuasa Allah ta’ala, karena perbuatan-perbuatan mereka termasuk bagian dari hal-hal yang masuk dalam firmanNya, “Sesungguhnya Allah berkuasa atas segala sesuatu”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 20: Kemudian Allah menjelaskan bahwasanya kilat ini hampir-hampir karena sebab dahsyatnya, mengambil pandangan mereka ; maka ketika cahayanya menerangi jalan mereka, mereka mengikuti cahayanya , dan jika cahaya tersebut pergi dan gelap bagi mereka , mereka berhenti di tempat-tempat mereka , sekiranya Allah berkehendak maka sungguh kilatan tersebut akan mengambil pendengaran mereka , mengambil pandangan mereka ; karena sesungguhnya tidak ada yang mengalahkan Allah sesuatu apapun di bumi dan juga di langit. inilah keadaan orang-orang munafik yang mengambil kesempatan dengan nama Islam secara dzahir dalam kehidupan dunia dan mereka akan mendapatkan azab yang pedih di neraka jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini, Allah menakut-nakuti orang-orang munafik dengan azab di dunia agar mereka takut sehingga berhenti dari melakukan keburukan dan berbuat nifak. Sekiranya Allah tidak memberikan tangguh kepada mereka, tentu Allah akan menghilangkan pendengaran dan penglihatan mereka, dan Dia Mahakuasa terhadapnya kapan saja waktunya, tidak ada sesuatu pun yang menghalangi-Nya. Di ayat ini juga terdapat bantahan kepada kaum Qadariyyah (yang mengingkari taqdir) yang mengatakan bahwa perbuatan mereka tidak di bawah kekuasaan Allah Ta'ala, padahal perbuatan mereka termasuk yang berada di bawah kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 20",
    "description": "Karena amat cepat dan terangnya, hampir saja kilat itu menyambar penglihatan mereka. Setiap kali kilat itu menyinari, mereka berjalan beberapa langkah di bawah sinar itu, dan apabila kilat itu menghilang dan gelap kembali menerpa mereka, mereka berhenti di tempat dengan penuh kebimbangan. Orang-orang munafik itu ketika melihat bukti-bukti dan tanda-tanda kekuasaan Allah terkagum-kagum dengan itu semua sehingga mereka berkeinginan mengikuti kebenaran tersebut. Akan tetapi, tidak beberapa lama kemudian mereka kembali kepada kekufuran dan kemunafikan. Sekiranya Allah menghendaki, niscaya dia hilangkan pendengaran mereka dengan suara halilintar yang memekakkan telinga, dan dia hilangkan penglihatan mereka dengan sambaran kilat yang sangat cepat dan terang, tetapi Allah menangguhkan itu semua sampai tiba saatnya nanti. Sungguh, Allah yang memiliki sifat-sifat kesempurnaan mahakuasa atas segala sesuatu, dengan atau tanpa sebab apa punsetelah menjelaskan tiga golongan manusia dalam menyikapi kebenaran Al-Qur'an, yaitu orang-orang bertakwa, kafir, dan munafik, selanjutnya Allah menyeru kepada manusia secara umum agar beragama secara benar melalui tiga hal: hanya beribadah kepada Allah (ayat 21-22), percaya kepada risalah yang dibawa oleh nabi Muhammad, yakni Al-Qur'an, (ayat 23-24), dan beriman kepada hari kebangkitan (ayat 25). Wahai manusia! sembahlah dan beribadahlah secara tulus kepada tuhanmu sebab dia yang telah menciptakan dan memelihara kamu dan orang-orang yang sebelum kamu dari yang sebelumnya tiada. Dia adalah satu-satunya pencipta segala sesuatu. Perintah beribadah itu ditujukan agar kamu bertakwa dan dapat memelihara diri serta terhindar dari murka dan siksa Allah. Dengan beribadah, berarti kita telah mempersiapkan diri untuk mengagungkan Allah, sehingga jiwa menjadi suci dan tunduk kepada kebenaran."
  }
]