[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka apabila kalian telah menyempurnakan ibadah kalian dan kalian telah menyelesaikan seluruh manasik haji kalian, maka perbanyaklah mengingat Allah dan memujinya, sebagaimana kalian menyebut-nyebut kebanggaan bapak-bapak kalian dahulu, bahkan dengan cara yang lebih agung daripadanya. Maka diantara manusia ada golongan yang menyekutukan Allah' menjadikan tujuan utamanya adalah dunia saja. maka dia berdoa sembari berkata,\" wahai tuhan kami, berikanlah kepada kami di dunia ini kesehatan, harta, dan anak-anak keturunan.\" Dan mereka tidak ada bagian dan nasib baik bagi mereka di akhirat kelak, lantaran antusiasme mereka pada dunia saja dan fokus hasrat mereka yang terbatas pada dunia semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "200. Apabila kalian telah menyelesaikan rangkaian kegiatan ibadah haji, maka berzikirlah kepada Allah dan perbanyaklah mengucapkan pujian kepada-Nya, sebagaimana kalian membanggakan dan memuji leluhur kalian, atau lebih dari itu. Karena setiap nikmat yang kalian rasakan itu sejatinya berasal dari Allah. Tetapi manusia berbeda-beda; ada orang yang kafir dan musyrik yang hanya percaya terhadap kehidupan dunia saja, sehingga dia tidak meminta dari tuhannya selain kenikmatan dan perhiasan dunia saja, seperti kesehatan, kekayaan dan keturunan. Dan orang semacam itu tidak akan mendapatkan kenikmatan yang Allah janjikan kepada hamba-hamba-Nya yang mukmin di akhirat kelak, karena orang kafir dan musyrik itu hanya menginginkan (kebahagiaan hidup di) dunia dan tidak menginginkan (kebahagiaan hidup di) akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "200. Apabila kalian telah selesai dari amalan-amalan haji maka perbanyaklah berzikir kepada Allah dengan bertahlil, bertakbir, dan dengan pujian-pujian kepada-Nya sebagaimana kalian menyebut dan membangga-banggakan para pendahulu kalian, atau lebih baik dari itu. Sebagian manusia hanya memohon urusan dunia, mereka tidak akan mendapat bagian dari kenikmatan akhirat, sebab yang mereka pentingkan hanyalah dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "200. فَإِذَا قَضَيْتُم مَّنٰسِكَكُم (Apabila kamu telah menyelesaikan ibadah hajimu) Yakni apabila telah menyelesaikan amalan-amalan ibadah haji pada hari penyembelihan berupa lempar jumrah, menyembelih kurban, mencukur rambut, dan thawaf ifadhah. فَاذْكُرُوا۟ اللَّـهَ كَذِكْرِكُمْ ءَابَآءَكُمْ (maka berdzikirlah dengan menyebut Allah, sebagaimana kamu menyebut-nyebut (membangga-banggakan) nenek moyangmu) Dahulu orang-orang Arab apabila telah selesai melaksanakan haji, mereka berdiri di tempat melempar jumrah kemudian menyebut-nyebut kehebatan nenek moyang mereka, dan sejarah pendahulu mereka. Maka Allah memerintahkan untuk berdzikir kepada-Nya sebagai ganti perbuatan tersebut. أَوْ أَشَدَّ ذِكْرًا ۗ (atau (bahkan) berdzikirlah lebih banyak dari itu) Yakni dengan dzikir yang lebih banyak dan baik مِنْ خَلٰقٍ (bahagian (yang menyenangkan) ) Yakni orang yang berdo’a ini tidak memiliki sesuatu yang ia pinta untuk kehidupan akhiratnya karena keinginannya hanya sebatas untuk kehidupan dunia bukan yang lain. Dan dalam ayat ini terdapat larangan untuk sebatas meminta hal keduniaan, dan terdapat cacian terhadap orang yang menjadikan dunia keinginan tertingginya dan tujuan terbesarnya pada do’a yang ia panjatkan di kondisi yang begitu agung (setelah melaksanakan haji)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَمِنَ النَّاسِ مَنْ يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا } Dari ayat ini kita dapat memahami bahwasanya manusia tidaklah dalam ketaatan yang sama, dan bahwasanya orang yang menginginkan dunia tidak membedakan antara hawanafsu yang akan membinasakannya, dan kebaikan yang menjadikannya kekal di akhirat!. 2 ). Pada ayat-ayat haji al-Qur'an memiliki cara tersendiri dalam memperbaiki kebiasaan buruk orang-orang jahiliah dan menggambarkan bagaimana cara untuk memurnikan keadaan kaum muslimin dari kebiasaan jahiliah tersebut dengan cara yang menghasilkan kebaikan yang berlipat, dan diantara kebiasaan buruk itu adalah : menyombongkan diri dan membedakan diri diantara manusia yang lainnya, mereka juga berbangga diri dengan ayah-ayah mereka dan mengangkat sikap fanatisme golongan dikalangan manusia, tadabburilah ayat ini : { ثُمَّ أَفِيضُوا مِنْ حَيْثُ أَفَاضَ النَّاسُ }\"Kemudian bertolaklah kamu dari tempat bertolaknya orang-orang banyak\" [al-Baqarah : 199], dan { فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا } \"maka berdzikirlah dengan menyebut Allah, sebagaimana kamu menyebut-nyebut (membangga-banggakan) nenek moyangmu, atau (bahkan) berdzikirlah lebih banyak dari itu\", maka sungguh para da'i dan ummat ini sangat membutuhkan metode seperti ini, dan untuk meraih kemurnian itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "200. Jika kalian sudah menyelesaikan ibadah haji pada hari kurban, yaitu lempar jumrah, berkurban, tahalul, dan thawaf ifadah, maka berdzikirlah kepada Allah dengan bertahmid, tahlil, dan takbir sebagai kebanggaan atas amal kalian yang telah lalu, bahkan berdzikir dan memohon lebih banyak. Di antara manusia ada yang meminta rejeki, kedudukan dan pertolongan di dunia, sehingga tidak ada bagian yang tersisa baginya di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kamu telah menyelesaikan rangkaian ibadah haji kalian} kalian luang setelah melakukan rangkaian amalan haji {berzikirlah kepada Allah sebagaimana kalian menyebut nyebut nenek moyang kalian} seperti kalian menggakan nenek moyang kalian {bahkan berzikirlah lebih dari itu. Di antara manusia ada yang berdoa, “Ya Tuhan kami, berilah kami (kebaikan) di dunia,” sedangkan di akhirat dia tidak memperoleh bagian apa pun} bagian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200-202. Kemudian Allah mengabarkan tentang keadaan para makhluk, bahwasanya mereka memohon kebutuhan-kebutuhan mereka kepada Allah, berlindung kepadaNya dari segala yang membahayakan mereka, akan tetapi niat dan maksud mereka berbeda-beda, diantara mereka “ada orang yang berdoa, ‘Ya Tuhan kami, berilah kami (kebaikan) di dunia’.” Maksudnya, ia memohon kepadaNya kenikmatan kenikmatan dunia yang merupakan keinginan dirinya, namun ia tidak mendapatkan bagian di akhirat, karena ia membencinya dan mencukupkan cita-citanya hanya sebatas dunia. Di antara mereka ada yang berdoa kepada Allah demi kemaslahatan dunia dan akhirat, dan ia butuh kepadanya dalam kepentingan kepentingan agama dan dunianya. Maka setiap dari kelompok pertama dan kelompok kedua memiliki hasil dari apa yang telah mereka kerjakan dan usahakan, dan Allah akan memberikan balasannya sesuai dengan perbuatan, cita-cita, dan niat mereka dengan balasan yang berdasarkan kepada keadilan dan kemuliaan, di mana Dia dipuji dengan pujian yang paling sempurna dan paling lengkap karenanya. Ayat ini merupakan dalil bahwa Allah mengabulkan doa setiap orang, baik muslim maupun kafir atau fasik. Akan tetapi pengabulan doa orang itu bukanlah sebuah tanda bagi kecintaanNya terhadap orang tersebut dan kedekatanNya padanya, kecuali dalam permohonan yang berhubungan dengan akhirat dan kepentingan kepentingan agama. Dan kebaikan yang diharapkan di dunia, termasuk dalam hal itu adalah segala yang sangat baik kejadiannya bagi seorang hamba, seperti rizki yang lancar, luas, dan halal, istri yang sholihah, anak yang merupakan penyejuk mata, ketenangan, ilmu yang berguna, amalan yang shalih, dan semacamnya dari segala macam permohonan yang dicintai dan dibolehkan. Adapun kebaikan di akhirat adalah selamat dari siksaan kubur, padang mahsyar, dan api neraka, memperoleh keridhoan Allah, mendapatkan kenikmatan yang abadi, dekat dengan Robb yang maha penyayang hingga doa ini menjadi doa yang paling lengkap, paling sempurna dan paling utama untuk didahulukan. Oleh karena itulah nabi memperbanyak doa dengannya dan senantiasa menganjurkan umatnya untuk berdoa dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { قَضَيۡتُم } Qadhaitum : Kalian telah melaksanakan dan selesai darinya. { المناسك } Al-Manasik : Bentuk jamak dari mansak yang berarti ritual-ritual dalam ibadah haji yang beraneka ragam. { الخَلاق } Al-Khalaq : Bagian Makna ayat : Pada empat ayat berikut, berakhirlah penjelasan mengenai hukum-hukum yang berkaitan dengan ibadah haji. Pada ayat 200 Allah Ta’ala menjelaskan kepada kaum mukminin, apabila mereka telah selesai dari manasiknya, agar melempar jumrah ‘Aqabah, menyembelih, dan melakukan thawaf Ifadhah, dan menetap di Mina untuk istirahat dan melepaskan kelelahan, agar memperbanyak berdzikir ketika melemparkan semua jumroh. Dan ketika mereka selesai melaksanakan shalat, hendaknya memperbanyak lagi dzikirnya sebagaimana yang dilakukan oleh mereka dahulu di masa Jahiliyah, dengan menyebut bapak kebesaran serta kemuliaan bapak-bapak dan nenek moyangnya. Kemudian Allah Ta’ala menjelaskan keadaan mereka, bahwa ada di antara mereka yang tujuannya semata-mata hanya duniawi, dimana mereka tidak meminta kepada Allah Ta’ala kecuali apa yang berhubungan dengan tujuannya tersebut. Inilah yang banyak terjadi pada jama’ah haji di zaman Jahiliyah. Pelajaran dari ayat : • Kewajiban untuk berdzikir di Mina dan ketika melempar semua jumrah, dengan cara bertakbir setiap melempar satu kerikil dengan mengucap Allahu Akbar. • Keutamaan dzikir dan motivasi untuk mengucapkannya. Karena dzikir merupakan kecintaan Allah Ta’ala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 200: Bagi jamaah haji jika ingin menyempurnakan manasik haji maka bagi mereka agar senantiasa berdzikir kepada Allah dengan dzikir yang banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan melempar jamrah 'Aqabah, thawaf dan telah menetap di Mina. Seperti dengan bertakbir dan memuji Allah. Kebiasaan orang-orang Arab Jahiliyah setelah menunaikan ibadah haji mengagungkan kebesaran nenek moyangnya. Setelah ayat ini diturunkan, kebiasaan tersebut diganti dengan dzikir kepada Allah. Di ayat ini Allah Subhaanahu wa Ta'aala memberitahukan keadaan manusia dan bahwa semuuanya meminta kebutuhan kepada-Nya, akan tetapi apa yang mereka minta berbeda-beda. Di antara mereka ada yang harapannya hanya tertuju kepada dunia sehingga yang diminta hanya terbatas kesenangan dunia, seperti yang disebutkan pada ayat di atas, dan ada pula yang berdo'a kepada Allah meminta maslahat di dunia dan akhirat seperti yang disebutkan pada ayat selanjutnya. Masing-masing mereka akan memperoleh balasan sesuai amalan, harapan dan niat mereka, di mana balasan Allah kepada mereka berjalan di antara keadilan dan fadhl (karunia-Nya). Dalam ayat ini terdapat dalil bahwa Allah Subhaanahu wa Ta'aala mengabulkan do'a setiap orang yang berdo'a, baik orang muslim, orang kafir maupun orang fasik. Akan tetapi, pengabulan-Nya terhadap do'a yang dipanjatkan mereka tidaklah menunjukkan bahwa Allah mencintainya dan dekatnya orang tersebut dengan Allah, kecuali jika do'a tersebut bersisikan kebaikan pada agamanya dan kebaikan di akhiratnya. Seperti sehat wal afiyat, harta yang banyak, anak-anak dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 200",
    "description": "Apabila kamu telah menyelesaikan ibadah haji seperti tawaf, sai, wukuf di arafah, bermalam di muzdalifah, melempar jamrah, tahalul, dan tawaf wada', maka berzikirlah kepada Allah, sebagaimana kamu menyebut-nyebut nenek moyang kamu dalam tradisi jahiliah dengan khidmat, khusyuk, dan takzim; bahkan berzikirlah kepada Allah dengan lebih takzim dari itu. Maka di antara manusia ada yang berdoa, ya tuhan kami! berilah kami kebaikan di dunia, seperti hidup yang sehat, harta yang banyak, dan keturunan yang cerdas sehingga terhormat dan bermartabat, tetapi di akhirat dia tidak memperoleh bagian apa pun karena tidak beriman dan beramal saleh"
  }
]