[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara manusia ada kelompok orang mukmin yang mengucapkan dalam doanya,\" wahai tuhan kami, berikanlah kepada kami di dunia ini keselamatan, rizki, ilmu yang bermanfaat, amal Shalih dan lainnya dari perkara-perkara agama dan dunia, dan di akhirat berikanlah kami surga, dan jauhkanlah dari kami siksaan neraka.\" Dan do’a ini termasuk do’a yang paling lengkap isinya oleh karena itu, nabi dahulu sering membacanya sebagaimana yang diriwayatkan dalam kitab shahihain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "201. Dan ada golongan manusia yang beriman kepada Allah dan hari Akhir. Maka dia meminta kepada Rabbnya agar diberikan kenikmatan hidup dan beramal saleh selama di dunia. Dia juga meminta kepada-Nya agar diberikan kesempatan untuk meraih surga dan selamat dari azab neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "201. Dan di antara manusia terdapat sekelompok orang beriman yang memohon kepada Allah kenikmatan dunia serta memohon agar mendapat surga di akhirat dan agar dijauhkan dari azab neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "201. حَسَنَةً kebaikan) Kebaikan di dunia adalah apa yang diminta oleh orang-orang sholeh di dunia seperti, istri yang sholehah lagi cantik, anak-anak yang sholeh, dan rezeki yang baik. Dan kebaikan di akhirat adalah keridhaan Allah, dan bidadari-bidadari, dan segala kebaikan yang dipersiapkan Allah untuk orang-orang yang bertakwa dan berbuat baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tsabit berkata kepada Anas - رضي الله عنه - : sesungguhnya saudara-saudaramu menyukai jika kamu berdoa untuk mereka, kemudian ia berkata : \"Ya Tuhan kami, berilah kami kebaikan di dunia dan \\ kebaikan di akhirat dan peliharalah kami dari siksa neraka\", kemudian ia mengulanginya dan berkata : mau aku tunjukkan kepadamu sesuatu yang dengannya perkara-perkara akan terselesaikan ?! sesungguhnya jika Allah"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "201. Di antara mereka ada yang meminta keluasan rejeki, kesehatan, keamanan, istri dan anak yang shalih di dunia, serta meminta surga keridhaan dan dijauhkan dari neraka di akhirat. Ibnu Abbas berkata: “Ada suatu kaum Baduwi yang datang ke suatu tempat dan berdoa: “Ya Allah, berikanlah tahun yang penuh dengan hujan, kesuburan, keberuntungan dan kebaikan” sedangkan mereka tidak menyebutkan sedikitpun tentang perkara akhirat. Lalu turunlah ayat ke 200. Lalu datang kelompok lain dari golongan orang mukmin dan berdoa: {Rabbanaa aatinaa fid dunyaa hasanah …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara mereka ada juga yang berdoa, “Ya Tuhan kami, berilah kami kebaikan di dunia} rejeki, kesehatan, dan amal shalih {dan kebaikan di akhirat} surga {serta lindungilah kami dari azab neraka.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200-202. Kemudian Allah mengabarkan tentang keadaan para makhluk, bahwasanya mereka memohon kebutuhan-kebutuhan mereka kepada Allah, berlindung kepadaNya dari segala yang membahayakan mereka, akan tetapi niat dan maksud mereka berbeda-beda, diantara mereka “ada orang yang berdoa, ‘Ya Tuhan kami, berilah kami (kebaikan) di dunia’.” Maksudnya, ia memohon kepadaNya kenikmatan kenikmatan dunia yang merupakan keinginan dirinya, namun ia tidak mendapatkan bagian di akhirat, karena ia membencinya dan mencukupkan cita-citanya hanya sebatas dunia. Di antara mereka ada yang berdoa kepada Allah demi kemaslahatan dunia dan akhirat, dan ia butuh kepadanya dalam kepentingan kepentingan agama dan dunianya. Maka setiap dari kelompok pertama dan kelompok kedua memiliki hasil dari apa yang telah mereka kerjakan dan usahakan, dan Allah akan memberikan balasannya sesuai dengan perbuatan, cita-cita, dan niat mereka dengan balasan yang berdasarkan kepada keadilan dan kemuliaan, di mana Dia dipuji dengan pujian yang paling sempurna dan paling lengkap karenanya. Ayat ini merupakan dalil bahwa Allah mengabulkan doa setiap orang, baik muslim maupun kafir atau fasik. Akan tetapi pengabulan doa orang itu bukanlah sebuah tanda bagi kecintaanNya terhadap orang tersebut dan kedekatanNya padanya, kecuali dalam permohonan yang berhubungan dengan akhirat dan kepentingan kepentingan agama. Dan kebaikan yang diharapkan di dunia, termasuk dalam hal itu adalah segala yang sangat baik kejadiannya bagi seorang hamba, seperti rizki yang lancar, luas, dan halal, istri yang sholihah, anak yang merupakan penyejuk mata, ketenangan, ilmu yang berguna, amalan yang shalih, dan semacamnya dari segala macam permohonan yang dicintai dan dibolehkan. Adapun kebaikan di akhirat adalah selamat dari siksaan kubur, padang mahsyar, dan api neraka, memperoleh keridhoan Allah, mendapatkan kenikmatan yang abadi, dekat dengan Robb yang maha penyayang hingga doa ini menjadi doa yang paling lengkap, paling sempurna dan paling utama untuk didahulukan. Oleh karena itulah nabi memperbanyak doa dengannya dan senantiasa menganjurkan umatnya untuk berdoa dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { حَسَنَةٗ } Hasanah : Kebaikan di dunia yaitu hal yang menyenangkan, tidak menyusahkan seperti istri shalihah, anak yang shalih, dan rezeki yang halal. Kebaikan di akhirat yaitu selamat dari api neraka dan masuk ke dalam surga. { قِنَا } Qinaa : Jagalah kami dan selamatkan kami dari azab neraka. Makna ayat: Namun di antara mereka (jamaah haji) ada yang meminta kebaikan di dunia dan akhirat, mereka itulah orang-orang mukmin dan bertauhid yang mengatakan,”Wahai Rabb kami, berilah kami kebaikan di dunia dan kebaikan di akhirat dan peliharalah kami dari siksa neraka.” Ayat ini mencakup pengajaran kepada kaum mukmin serta bimbingan agar mereka mengamalkan doa yang lengkap ini dan tujuan yang shalih lagi bermanfaat. Maka bagi Allah sajalah pujian dan keutamaan. Pelajaran dari ayat: • Keutamaan meminta kepada Allah tentang kebaikan di dunia dan di akhirat, serta tidak mencukupkan dengan salah satunya saja. Pilihan yang paling buruk adalah meminta kebaikan di dunia dan isinya saja. • Keutamaan doa : “Rabbanaa Aatinaa fid dunya hasanah, wa fil akhirati hasanah, waqina ‘adzabannaar.” Doa tersebut lengkap mencakup kebaikan di dunia dan akhirat bersamaan. Dahulu Nabi Muhammad ﷺ apabila sedang berthawaf di sekitar Ka’bah menyelesaikan satu putarannya dengan membaca doa tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 201: Ketahuilah bahwasannya diantara kalian ada yang berdoa dengan kebaikan dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebaikan di dunia misalnya sehat wal 'afiyat, rezeki yang halal, istri dan anak yang shalih, ilmu yang bermanfa'at, amal shalih dan kenikmatan lainnya. Sedangkan kebaikan di akhirat adalah selamat dari siksa kubur, selamat ketika di mahsyar, selamat dari neraka, memperoleh keridhaan Allah, masuk ke dalam surga dan dekat dengan Allah Subhaanahu wa Ta'aala. Do'a ini adalah do'a yang paling luas cakupannya. Oleh karena itu, Nabi shallallahu 'alaihi wa sallam sering berdo'a dengan do'a ini, dan do'a inilah yang patut dipanjatkan oleh seorang muslim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 201",
    "description": "Apabila kamu telah menyelesaikan ibadah haji seperti tawaf, sai, wukuf di arafah, bermalam di muzdalifah, melempar jamrah, tahalul, dan tawaf wada', maka berzikirlah kepada Allah, sebagaimana kamu menyebut-nyebut nenek moyang kamu dalam tradisi jahiliah dengan khidmat, khusyuk, dan takzim; bahkan berzikirlah kepada Allah dengan lebih takzim dari itu. Maka di antara manusia ada yang berdoa, ya tuhan kami! berilah kami kebaikan di dunia, seperti hidup yang sehat, harta yang banyak, dan keturunan yang cerdas sehingga terhormat dan bermartabat, tetapi di akhirat dia tidak memperoleh bagian apa pun karena tidak beriman dan beramal saleh. Mereka itulah yang memperoleh bagian dari apa yang telah mereka kerjakan dengan memperoleh kebaikan di dunia dan keselamatan di akhirat, dan Allah maha cepat perhitungan-Nya atas semua amal perbuatan manusia."
  }
]