[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berdoa dengan doa ini,maka bagi mereka pahala yang besar dikarenakan amal-amal baik yang telah mereka usahakan. dan Allah sangat cepat perhitungannya. Menghitung amalan hamba dan membalasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "202. Orang-orang yang meminta kebahagiaan hidup di dunia dan di akhirat itu akan mendapatkan ganjaran yang besar sesuai dengan amal saleh yang telah mereka perbuat di dunia. Dan Allah Mahacepat dalam menghitung amal perbuatan manusia. Maka Dia berikan ganjaran bagi orang-orang yang berbuat baik, dan Dia berikan hukuman bagi orang-orang yang berbuat buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "202. Mereka adalah orang-orang yang mendapat derajat yang tinggi dan kebahagiaan di dunia dan di akhirat serta pahala yang besar berkat amal kebaikan yang telah mereka kerjakan. Sungguh Allah Maha Cepat perhitungan-Nya terhadap seluruh makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "202. أُو۟لٰٓئِكَ (Mereka itulah orang-orang) Kata ini diisyaratkan kepada kelompok kedua. لَهُمْ نَصِيبٌ (yang mendapat bahagian) Yakni bagian yang sesuai (dengan yang mereka lakukan) مِّمَّا كَسَبُوا۟ ۚ (daripada yang mereka usahakan) Yakni berupa doa yang telah dipanjatkan. وَاللَّـهُ سَرِيعُ الْحِسَابِ (dan Allah sangat cepat perhitungan-Nya) Allah mensifati diri-Nya dengan cepat perhitungan-Nya atas hamba-hamba-Nya meski jumlah mereka begitu banyak, dan urusan-Nya tidak menyibukkan-Nya dari urusan yang lain, sehingga Allah menghisab mereka dalam satu waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "202. Mereka itu mencari kebaikan dunia dan akhirat. Dan bagi mereka itu bagian yang melimpah dari pahala dan pengampunan dosa, karena amal ibadah mereka. Dan Allah itu Maha cepat hisabNya. Dia menghisab seluruh makhluknya hanya setengah hari dan tidak ada satupun perkara yang bisa menyulitkanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah yang memperoleh bagian dari apa yang telah mereka usahakan. Allah Maha cepat perhitunganNya."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "200-202. Kemudian Allah mengabarkan tentang keadaan para makhluk, bahwasanya mereka memohon kebutuhan-kebutuhan mereka kepada Allah, berlindung kepadaNya dari segala yang membahayakan mereka, akan tetapi niat dan maksud mereka berbeda-beda, diantara mereka “ada orang yang berdoa, ‘Ya Tuhan kami, berilah kami (kebaikan) di dunia’.” Maksudnya, ia memohon kepadaNya kenikmatan kenikmatan dunia yang merupakan keinginan dirinya, namun ia tidak mendapatkan bagian di akhirat, karena ia membencinya dan mencukupkan cita-citanya hanya sebatas dunia. Di antara mereka ada yang berdoa kepada Allah demi kemaslahatan dunia dan akhirat, dan ia butuh kepadanya dalam kepentingan kepentingan agama dan dunianya. Maka setiap dari kelompok pertama dan kelompok kedua memiliki hasil dari apa yang telah mereka kerjakan dan usahakan, dan Allah akan memberikan balasannya sesuai dengan perbuatan, cita-cita, dan niat mereka dengan balasan yang berdasarkan kepada keadilan dan kemuliaan, di mana Dia dipuji dengan pujian yang paling sempurna dan paling lengkap karenanya. Ayat ini merupakan dalil bahwa Allah mengabulkan doa setiap orang, baik muslim maupun kafir atau fasik. Akan tetapi pengabulan doa orang itu bukanlah sebuah tanda bagi kecintaanNya terhadap orang tersebut dan kedekatanNya padanya, kecuali dalam permohonan yang berhubungan dengan akhirat dan kepentingan kepentingan agama. Dan kebaikan yang diharapkan di dunia, termasuk dalam hal itu adalah segala yang sangat baik kejadiannya bagi seorang hamba, seperti rizki yang lancar, luas, dan halal, istri yang sholihah, anak yang merupakan penyejuk mata, ketenangan, ilmu yang berguna, amalan yang shalih, dan semacamnya dari segala macam permohonan yang dicintai dan dibolehkan. Adapun kebaikan di akhirat adalah selamat dari siksaan kubur, padang mahsyar, dan api neraka, memperoleh keridhoan Allah, mendapatkan kenikmatan yang abadi, dekat dengan Robb yang maha penyayang hingga doa ini menjadi doa yang paling lengkap, paling sempurna dan paling utama untuk didahulukan. Oleh karena itulah nabi memperbanyak doa dengannya dan senantiasa menganjurkan umatnya untuk berdoa dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { نَصِيبٞ } Nashiib : Bagian yang diperoleh dari amalan shalih dan doa mereka yang shalih. Makna ayat: Pada ayat 202 Allah Ta’ala memberitahukan bahwa orang-orang yang memanjatkan doa yang shalih itu adalah mereka orang-orang yang mukmin dan bertauhid. Mereka mendapatkan bagian pahala dari amalan yang mereka kerjakan selama di dunia. Allah Ta’ala sangat cepat memberi balasan. Allah Ta’ala menjadikan mereka mendapatkan balasan pendahuluan sebelum balasan di akhirat yaitu surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 202: Ketahuilah wahai manusia bahwasannya mereka yang meminta kebaikan dunia dan akhirat mereka layak diberikan balasan yang besar karena sebab amalan mereka yang sholeh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pahala yang besar. Dia akan menjumlahkan semua amal hamba-hamba-Nya dan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 202",
    "description": "Mereka itulah yang memperoleh bagian dari apa yang telah mereka kerjakan dengan memperoleh kebaikan di dunia dan keselamatan di akhirat, dan Allah maha cepat perhitungan-Nya atas semua amal perbuatan manusia. Dan berzikirlah kepada Allah dengan membaca takbir sesudah salat lima waktu dan ketika melontar pada hari yang telah ditentukan jumlahnya, yaitu hari tasyriq, tanggal 11, 12, dan 13 zulhijah. Barang siapa mempercepat meninggalkan mina setelah dua hari, tanggal 11 dan 12 zulhijah, maka tidak ada dosa baginya. Dan barang siapa mengakhirkannya hingga tanggal 13 zulhijah, tidak ada dosa pula baginya, yakni bagi orang yang bertakwa, yaitu orang-orang menjalankan perintah Allah dan meninggalkan larangan-Nya di dalam berhaji. Dan bertakwalah kepada Allah, dan ketahuilah bahwa kamu akan dikumpulkan-Nya, yakni kamu semua akan dikumpulkan kepada-Nya kelak pada hari kiamat. Demikianlah, Allah menjelaskan tata cara yang benar dalam melaksanakan ibadah haji yang disyariatkan bagi orang-orang yang beriman."
  }
]