[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berdzikirlah keapada Allah dengan bertasbih dan bertakbir pada beberapa hari yang tidak lama, yaitu hari-hari Tasyrik: 11, 12, dan 13 Dzulhijjah. Maka barangsiapa ingin bersegera berangkat dan keluar dari Mina sebelum matahari terbenam pada tanggal 12 Dzulhijjah sesudah melontar jumroh, maka tidak ada dosa atas dirinya. dan barangsiapa hendak mengakhirkannya dengan bermalam lagi di mina sampai melempar jumroh pada tanggal 13 Dzulhijjah, maka tidak ada dosa atas dirinya, bagi orang-orang yang bertakwa dalam ibadah hajinya. dan menangguhkan keberangkatan itu adalah lebih utama, karena merupakan bentuk penambahan bekal dalam ibadah dan mengikuti perbuatan Nabi. Dan takutlah kepada Allah -wahai orang-orang Islam-, rasakanlah pengawasannya dalam seluruh perbuatan kalian, dan ketahuilah bahwa sesungguhnya kalian kepada Nya saja akan dikumpulkan setelah kematian kalian untuk menghadapi perhitungan amal dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "203. Dan berzikirlah kepada Allah pada hari-hari yang ditentukan, yaitu pada tanggal 11, 12 dan 13 Zulhijah. Siapa yang terburu-buru dan keluar dari Mina setelah melontar jumrah pada tanggal 12, dia boleh melakukannya dan tidak berdosa, karena Allah telah memberikan keringanan baginya. Dan barangsiapa menunda sampai tanggal 13 agar bisa melontar jumrah pada hari itu, dia pun boleh melakukannya dan tidak berdosa. Dan dia telah melakukan yang paling sempurna dan mengikuti amalan Nabi -ṣallallāhu 'alaihi wa sallam-. Semua itu bagi orang yang bertakwa kepada Allah di dalam hajinya, sehingga dia melaksanakannya sesuai dengan perintah Allah. Dan bertakwalah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan yakinlah bahwa hanya kepada-Nya lah kalian akan kembali. Lalu Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "203. Dan berzikirlah kepada Allah untuk mengagungkan dan membesarkannya pada hari-hari tasyriq (tanggal 11, 12, dan 13 Dzulhijjah). Barangsiapa yang ingin segera meninggalkan Mina sebelum terbenamnya matahari di hari ke-12 Dzulhijjah maka tidak mengapa baginya, sebab dia telah menyelesaikan ibadah hajinya jika dia bertakwa kepada Allah ketika dia melaksanakannya dengan tidak berucap buruk dan berbuat fasik. Dan barangsiapa yang berada di Mina sampai hari ke-13 Dzulhijjah maka tidak mengapa pula baginya jika dia bertakwa dalam hajinya. Dan takutlah kepada Allah dalam segala urusan kalian, dan ketahuilah bahwa kalian akan dikumpulkan di hadapan Allah di akhirat kelak untuk memperoleh balasan. Imam at-Thabari dan Ibnu Abi Hatim meriwayatkan dengan sanad hasan dari Ali bin Abi Thalib dari Abu Thalhah dari Ibnu Abbas, ia berkata: “{فمن تعجل في يومين} yakni setelah hari Nahr -10 Dzulhijjah-. {فلا إثم عليه} yakni barangsiapa yang pergi dari Mina dua hari setelah hari Nahr maka tidak mengapa baginya. {ومن تأخر فلا إثم عليه} yakni tidak ada dosa baginya dalam pengakhirannya itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "203. فِىٓ أَيَّامٍ مَّعْدُودٰتٍ ۚ (dalam beberapa hari yang berbilang) Yakni hari-hari ketika di Mina yang merupakan hari untuk melempar jumrah. Hari ini adalah hari yang bertepatan dengan hari tasyriq tanpa ada perbedaan pendapat. Adapun dzikir yang diperintahkan berupa melempar jumrah dan bertakbir di Mina bagi para jamaah haji, dan berupa takbir yang dilantunkan oleh seluruh umat islam di setiap penjuru negeri setelah sholat dan waktu lainnya pada hari-hari tersebut, dimulai dari pagi hari ketika para jamaah haji di Arafah sampai sholat Ashar dihari terakhir penyembelihan. فَمَن تَعَجَّلَ (Barangsiapa yang ingin cepat berangkat) Yakni yang melempar jumrah di hari kedua dari hari-hari yang berbilang tersebut kemudian meninggalkan Mina maka tidak berdosa baginya. Begitu pula siapa yang terlambat sampai hari ketiga, maka tidak berdosa. لِمَنِ اتَّقَىٰ ۗ (bagi orang yang bertakwa) Yakni penghapusan dosa atas mereka adalah bagi yang bertakwa kepada Allah. Dan pendapat lain mengatakan, yakni bagi yang bertakwa setelah menyelesaikan ibadah haji dengan tidak melakukan kemaksiatan apapun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Inti daripada haji adalah dzikir kepada Allah, maka barangsiapa yang dimudahkan untuk menunaikannya niscaya dia akan dimudahkan untuk memperbanyak dzikir kepada Allah, amatilah firman Allah yang agung ini : { فَإِذَا قَضَيْتُمْ مَنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا } \"Apabila kamu telah menyelesaikan ibadah hajimu, maka berdzikirlah dengan menyebut Allah, sebagaimana kamu menyebut-nyebut (membangga-banggakan) nenek moyangmu, atau (bahkan) berdzikirlah lebih banyak dari itu\" [al-Baqarah : 200], { وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ } \"Dan berdzikirlah (dengan menyebut) Allah dalam beberapa hari yang berbilang\" , { لِيَشْهَدُوا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ } \"supaya mereka menyaksikan berbagai manfaat bagi mereka dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan\" [al-Haj : 28], dan dalam sebuah hadits dikatakan : (( سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْحَجِّ أَفْضَلُ قَالَ الْعَجُّ وَالثَّجُّ الْعَجُّ يَعْنِي التَّلْبِيَةَ وَالثَّجُّ يَعْنِي إِهْرَاقَةَ الدَّمِ )) \"Rasulullah shallallahu 'alaihi wasallam ditanya; \"Haji apakah yang paling utama?\" Beliau bersabda: \"Al 'ajju, dan ats Tsajju. Al 'Ajju yaitu mengucapkan talbiyah, sedangkan ats tsajju yaitu mengalirkan darah (hewan kurban\". 2 ). { وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ } Diantara hikmah Allah menentukan waktu-waktu masya'ir pada bulan-bulan hijriyah adalah, sebagaimana yang disebutkan oleh Imam Syafi'i : ( terkadang waktu terlambat datangnya dan terkadang pula lebih cepat, tetapi bulan tidak akan terlambat lebih dari satu hari ). 3 ). { وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ } Pada hari-hari tasyriq ada banyak kebaikan dan kenikmatan yang berkumpul untuk orang-orang beriman, dari kenikmatan badan : berupa makan dan minum, sedangkan kenikmatan hati : berupa dzikir dan syukur kepada Allah, dan dengannya kenikmatan semakin sempurna, dan setiap kali mereka membicarakan kenikmatan itu dengan maksud bersyukur, maka syukur mereka untuk nikmat yang lain butuh dengan bukti syukur yang lain, karena kewajiban bersyukur tidak akan habis selamanya. 4 ). Hadirnya akhirat dalam hati orang yang berhaji.. amatilah firman Allah ini : { فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ } \"Barangsiapa yang ingin cepat berangkat (dari Mina) sesudah dua hari, maka tiada dosa baginya. Dan barangsiapa yang ingin menangguhkan (keberangkatannya dari dua hari itu), maka tidak ada dosa pula baginya\" : bahwasanya ketika Allah menyebutkan golongan pertama dan kedua, yaitu berpencarnya manusia dari musim haji ke penjuru dunia, setelah mereka berkumpul di satu tempat yang sama dalam rangka melakukan masya'ir haji, Allah kemudian mengingatkan : { وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ } yakni : niscaya kalian akan dikumpulkan selurunya pada hari kiamat. 5 ). { فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ۚ لِمَنِ اتَّقَىٰ } Bukanlah waktu yang panjang untuk berdiam diri di mina yang dijalankan oleh orang yang berhaji inti daripada perintah haji, melainkan hadirnya niat untuk beribadah dan mengesakan Allah adalah tujuan dari perintah haji ini; oleh karena itu di akhir ayat Allah berfirman : { لِمَنِ اتَّقَىٰ }, maka jauhilah oleh kalian membandingkan suatu amalan dengan zaman yang di tempuh untuk menyelsaikannya, karena sesungguhnya diterimanya amalan tersebut hanya dilihat dari keikhlasan hati, dan tingkatan ketaqwaan seorang hamba. 6 ). Amalan-amalan yang dibebaskan kepada seorang hamba untuk memilih tidak dibebankan kepadanya dosa; jika hamba mengerjakannya dengan tujuan taqwa kepada Allah; tanpa ia bermaksud memandang remeh perintah-perintah Allah, sebagaimana firman-Nya : { لِمَنِ اتَّقَىٰ } maka barangsiapa yang mengerjakan suatu amalan atau kewajiban yang dibebaskan untuknya memilih dengan tujuan taqwa kepada Allah, dan dengan maksud mengambil kemudahan yang Allah berikan kepada-Nya, maka tiada dosa baginya, dan barangsiapa yang mengerjakannya dengan maksud memandang remeh kewajiban itu dan bersikap acuh tak acuh, maka baginya dosa dengan meninggalkan ketaqwaan, dan meremehkan perintah Allah. 7 ). { فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ۚ لِمَنِ اتَّقَىٰ }, Dalam ayat ini maksud \"mempercepat dan mengakhirkan\" ibadah ini masuk dalam hukum keutamaan bukan pada hukum kewajiban ibadah itu, tetapi perkara ini dibahas dengan diturunkannya ayat yang agung; untuk menjelaskan bahwasanya hukum-hukum yang berkaitan dengan penghambaan kepada Allah mesti didasari oleh syari'at yang dalilnya jelas, sebagaimana syari'at itu datangnya dari Allah semata tanpa ada sekutu baginya, walapun syari'at itu dalam rangka menjelaskan keutamaan diantara amalan-amalan yang ada, lalu apakah yang dikatakan oleh mereka yang membuat syari'at baru selain Allah tentang darah, harta, dan hak-hak manusia ? maka kita memberi peringatan kepada mereka dengan akhir ayat ini : { وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ }. 8 ). Setelah Allah membolehkan mempercepat keberangkatan bagi jamaah haji (yang bertaqwa kepada-Nya) Allah kemudian berkata : { وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ }, pengetahuan seseorang tentang hari kiamat adalah salah satu diantara sebab yang besar bagi ketaqwaan seseorang. 9 ). Ayat-ayat haji dalm surah al-baqarah ini ditutup dengan firman Allah : { وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ } perhatikanlah kata { تُحْشَرُونَ } \"kamu akan dikumpulkan\" , dan kesesuaiannya dengan keadaan jamaah haji pada musimnya, maka siapa yang mengumpulkanmu pada musim haji itu dengan pilihanmu, Dia juga mampu untuk mengumpulkanmu pada hari kiamat tanpa ada pilihan darimu. 10 ). Meskipun berbeda konteks yang ada pada surah al-baqarah dan surah al-haj, tetapi ada dua perkara besar yang selamanya tidak akan berbeda diantara keduanya, dan merupakan dua perkara yang paling utama dari perintah manasik haji : - Mewujudkan ketaqwaan kepada Allah. - Memperbanyak dzikir kepada Allah. Maka sepatutnya bagi setiap hamba yang menunaikan ibadah haji menjadikan dua perkara ini tujuan utama dalam ibadah hajinya. 11 ). Ayat-ayat haji di dalam surah (al-baqarah) menfokuskan penjelasannya untuk menampakkan kesempurnaan syari'at islam; disisi lain ayat-ayat ini mengandung beberapa penjelasan keringanan syari'at dan pembatalan perkara-perkara yang dibuat-buat oleh orang-orang musyrikin dikala mereka berhaji yang diantaranya adalah perubahan syari'at dan kitab setelah berlalunya masa agama yang dibawa oleh Ibrahim, sedangkan surah (al-haj) berfokus pada tujuan-tujuan kubro dalam haji; yang semua berkaitan dengan tauhid, dan penekanan terhadap pentingnya ikhlas, serta pengagungan syi'ar-syi'ar ibadah haji. 12 ). Ayat-ayat haji dalam surah al-baqarah diakhiri dengan menyebutkan hari kiamat, dan surah al-haj diawali dengan disebutkan kehancuran hari kiamat! hal ini menandakan bahwasanya apa yang berlangsung semasa ibadah haji mengingatkan kita kepada peristiwa hari berbangkit dan hari perhitungan : berawal dari pakaian ihroh yang digunakan mengingatkan kepada kain kafan yang dipakaikan kepada orang mati, dan maut adalah langkah pertama dari peristiwa hari kiamat terjadi, dan seterusnya selama ibadah haji itu berlangsung, maka apakah ada yang mengambil pelajaran darinya ? 13 ). Ketika suasana haji diibaratkan hari berkumpulnya manusia didunia, dan perginya mereka dari tempat itu diibaratkan seperti perginya seluruh ummat manusia dari temapt berkumpul mereka di padang mahsyar, satu kelompok akan masuk ke dalam surga dan satu lagi akan masuk ke neraka; Allah mengingatkan mereka melalui firman-Nya : { وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "203. Wahai orang-orang muslim yang berhaji maupun yang tidak, berdzikirlah kepada Allah pada hari-hari ketika di Mina dan hari ketika melempar jumrah. Yaitu 3 hari tasyrik setelah hari raya dengan bertakbir setelah melakukan shalat. Dan waktu melakukan hal tersebut bagi orang yang tidak berhaji adalah dari pagi hari Arafah sampai waktu ashar di akhir hari untuk berkurban, Barangsiapa tergesa-gesa untuk tidak di Mina pada hari kedua setelah melempar Jumrah, maka dia tidak dosa, dan barangsiapa mengakhirkan ampai hari ketiga, maka tiada dosa pula baginya.Pembolehan hal tersebut bagi orang yang bertakwa kepada Allah dalam ibadah hajinya. Perhatikanlah seluruh urusan kalian, dan ketahuilah bahwa kalian akan dikumpulkan kepada Allah pada hari kiamat, lalu Dia akan membalas kalian atas amal perbuatan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berzikirlah kepada Allah pada hari yang telah ditentukan jumlahnya.} tiga hari tasyrik {Siapa yang mempercepat setelah dua hari} cepat-cepat keluar dari mina pada hari kedua hari tasyrik setelah melempar jumrahnya {maka tidak ada dosa baginya. Siapa yang mengakhirkannya} untuk meninggalkan Mina sehingga melempar jumrahnya pada hari ketiga setelah hari itu berakhir {tidak ada dosa (pula) baginya, bagi orang yang bertakwa. Bertakwalah kepada Allah dan ketahuilah bahwa hanya kepadaNya kalian akan dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "203. Allah memerintahkan untuk berdzikir kepadaNya pada hari-hari yang terbilang (ditentukan), yaitu 3 hari tasyrik setelah Idul Adha, karena keistimewaan dan kemuliaan nya, dan sisa-sisa manasik haji dilakukan pada waktu itu, dan saat itu manusia adalah tamu Allah. Karena itu Allah haramkan berpuasa pada hari itu, maka dzikir pada hari itu memiliki keistimewaan tersendiri yang tidak ada pada selainnya. Karena itulah nabi bersabda, “Hari-hari tasyrik adalah hari-hari makan dan minum serta dzikir kepada Allah.” HR MUSLIM No. 1141 Dan termasuk dalam dzikir kepadaNya pada saat itu adalah berdzikir kepadaNya saat melempar jumroh, serta menyembelih, dan dzikir dzikir tentunya setelah salat fardhu, bahkan Sebagian ulama berkata bahwasanya pada saat itu dianjurkan takbir muthlaq seperti pada tanggal 10 dzulhijah, dan pendapat ini tidaklah jauh (dari kebenaran). “Maka barangsiapa yang ingin cepat berangkat (dari Mina) sesudah 2 hari,” maksudnya, pergi dari Mina dan bertolak dari nya sebelum terbenamnya matahari pada hari kedua, “maka tiada dosa baginya. Dan barangsiapa yang ingin menangguhkan (keberangkatannya dari 2 hari itu)” dengan bermalam pada malam ketiganya lalu melempar jumrah pada keesokan harinya, “maka tidak ada dosa pula baginya.” Ini adalah keringanan dari Allah atas hamba-hambaNya dalam membolehkan kedua hal tersebut. Akan tetapi telah dipahami bahwasanya bila kedua hal tersebut dibolehkan, maka penangguhan itu adalah yang lebih utama, karena berarti lebih banyak ibadah yang bisa dilakukan. Dan ketika peniadaan dosa terkadang dipahami peniadaan dosa dari hal tersebut dan dari hal yang lainnya, kemudian terpahami bahwa dosa itu ditiadakan dari yang segera dan yang menangguhkannya saja, maka Allah membatasinya dengan FirmanNya, “bagi orang yang bertaqwa,” yaitu, bertakwalah kepada Allah dalam segala urusan dan kondisinya dalam menunaikan Haji. Barangsiapa yang bertaqwa kepada Allah dalam segala hal, niscaya ia akan memperoleh peniadaan dosa dalam segala hal pula, dan barangsiapa yang bertaqwa kepadaNya pada sesuatu tanpa sesuatu yang lain, maka balasan itu sesuai dengan jenis amalannya. “Dan bertakwalah kepada Allah” dengan menunaikan perintah perintahNya dan menjauhi kemaksiatan kepada-Nya, “dan ketahuilah, bahwa kamu akan dikumpulkan kepadaNya,” lalu memberikan ganjaran atas segala amalan perbuatan kalian. Barangsiapa yang bertakwa kepadaNya, niscaya ia akan mendapatkan balasan ketakwaan disisiNya, dan barangsiapa yang tidak bertaqwa kepadaNya, niscaya Dia akan menyiksanya dengan siksaan yang keras, maka mengetahui tentang pembalasan itu adalah sebesar besar pendorong kepada taqwa kepada Allah, oleh karena itu, Allah menganjurkan untuk mengetahui hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَيَّامٖ مَّعۡدُودَٰتٖۚ } Ayyaamil ma’dudat : Hari-hari tertentu yaitu tiga hari tasyriq setelah hari ‘ied. { تَعَجَّلَ فِي يَوۡمَيۡنِ } Ta’ajjala fi yaumaini : Melempar pada hari pertama dan kedua, setelah itu bersafar. { وَمَن تَأَخَّرَ } Waman ta’akharra : Melempar pada tiga hari seluruhnya. { فَلَآ إِثۡمَ عَلَيۡهِۖ } Falaa itsma : tidak ada dosa baik bagi yang mendahulukan atau mengakhirkan untuk melempar. { لِمَنِ ٱتَّقَىٰۗ } Limanittaqa : Bagi orang yang bertakwa kepada Rabbnya dengan tidak meninggalkan kewajiban yang diwajibkan untuk nya atau melakukan hal yang diharamkan untuknya. { تُحۡشَرُونَ } Tuhsyarun : Dikumpulkan untuk hisab dan pembalasan pada hari kiamat. Makna ayat: Pada ayat 203 Allah Ta’ala memerintahkan para jama’ah haji dari kalangan kaum mukminin agar mengingat Allah Ta’ala (dzikrullah) pada hari-hari tasyriq, ketika melempar jumrah dan setelah selesai melaksanakan shalat lima waktu, seraya mengucapkan; الله أكبر الله أكبر لا إله إلا الله، الله أكبر الله أكبر ولله الحمد 3x “Allahu Akbar, Allahu Akbar, Laa Ilaha Illallah, Allahu Akbar, Allahu Akbar, Walillahil hamd.” 3x Lafadz ini diucapkan sampai Ashar hari ketiga pada hari Tasyriq. Kemudian Allah Ta’ala mengabarkan kepada mereka bahwa tidak mengapa apabila mereka mendahulukan keluar dari Mina untuk kembali ke negerinya setelah melempar jumrah ketika hari kedua. Sebagaimana juga tidak mengapa bagi orang yang mengakhirkan untuk melempar jumrah pada hari ketiga. Allah Ta’ala berfirman,” “Barangsiapa yang ingin cepat berangkat dari Mina sesudah dua hari, maka tiada dosa baginya. Dan barangsiapa yang ingin menangguhkan (keberangkatannya dari dua hari itu), maka tidak ada dosa padanya.” Jadi, diberikan pilihan dalam ayat itu, dan kebolehan untuk memilih dengan tidak ada dosa dikaitkan dengan ketakwaan kepada Allah ‘Azza wa Jalla. Barangsiapa yang meninggalkan kewajiban dan melakukan keharaman, maka baginya dosa melakukan maksiat dan tidak bisa disucikan kecuali dengan taubat. Jadi pernyataan tidak ada dosa, berkaitan dengan mendahulukan atau mengakhirkan saja. Maka firman Allah Ta’ala (لمن اتقى) “Bagi siapa yang bertakwa” merupakan keterkaitan yang indah. Oleh karena itu Allah Ta’ala memerintahkan mereka untuk bertakwa kepada Nya, dan memperingatkan tentang tujuan mereka yang sudah pasti, yaitu berdiri di hadapan Allah Ta’ala (mempertanggungjawabkan amalan,pent). Maka bersiap-siaplah dengan banyak berdzikir mengingat Nya, bersyukur kepada Nya dan bersemangat melakukan amalan ketaatan. Pelajaran dari ayat: • Keringanan untuk mendahulukan melempar jumrah pada hari kedua. • Perintah untuk bertakwa kepada Allah Ta’ala serta penyebutan hari pengumpulan manusia, serta adanya hisab dan balasan. Penyebutan ini sangat membantu meningkatkan ketakwaan kepada Allah Ta’ala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 203: Allah memerintahkan bagi jamaah haji untuk memperbanyak dzikir dihari-hari haji karena hari-hari yang pendek, dan Ia hari Idul Adha dan hari setelahnya disebut hari tasyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa'diy berkata: \"Allah Subhaanahu wa Ta'aala memerintahkan untuk berdzikr kepada-Nya pada beberapa hari yang ditentukan, yaitu hari-hari tasyriq yang tiga (11, 12 dan 13 Dzulhijjah) setelah hari 'Ied karena keistimewaan hari-hari tersebut dan kemuliaannya, di samping itu sisa-sisa pekerjaan manasik haji dilakukan pada hari-hari itu, dan karena ketika itu manusia menjadi tamu-tamu Allah. Oleh karena itu, Dia mengharamkan mereka berpuasa pada hari-hari tersebut. Berdzikr pada hari-hari tersebut memiliki keistimewaan yang tidak sama dengan hari-hari lainnya. Oleh karena itu Nabi shallallahu 'alaihi wa sallam bersabda: \"Hari-hari tasyriq adalah hari-hari makan, minum dan dzikrullah.\" Maksud dzikir di sini ialah membaca takbir, tasbih, tahmid, talbiah dan sebagainya. Contohnya takbiran, bertakbir saat melempar jamrah, bertakbir saat menyembelih, dan bertalbiyah (Labbaikallahumma labbaik..dst). Sebagian ulama berpendapat bahwa pada hari-hari tasyriq dianjurkan bertakbir mutlak sebagaimana sepuluh hari sebelumnya. Sebaiknya orang yang haji meninggalkan Mina pada sore hari terakhir (sebelum matahari tenggelam) dari hari tasyriq setelah melempar jamrah, namun mereka boleh juga meninggalkan Mina pada sore hari kedua setelah melempar jamrah. Menangguhkan keberangkatan lebih utama karena memperbanyak ibadah dan mengikuti perbuatan Nabi shallallahu 'alaihi wa sallam. Orang yang bertakwa diberikan dua pilihan tersebut dan tidak ada dosa pada salah satunya, sesungguhnya ia dianggap telah menunaikan ibadah haji. Yakni bagi mereka yang bertakwa kepada Allah akan memperoleh nafyul harj (peniadaan dosa) juga. Untuk dihisab dan diberikan pembalasan. Mengetahui bahwa kita akan dikumpulkan termasuk faktor yang mendorong seseorang bertakwa kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 203",
    "description": "Dan berzikirlah kepada Allah dengan membaca takbir sesudah salat lima waktu dan ketika melontar pada hari yang telah ditentukan jumlahnya, yaitu hari tasyriq, tanggal 11, 12, dan 13 zulhijah. Barang siapa mempercepat meninggalkan mina setelah dua hari, tanggal 11 dan 12 zulhijah, maka tidak ada dosa baginya. Dan barang siapa mengakhirkannya hingga tanggal 13 zulhijah, tidak ada dosa pula baginya, yakni bagi orang yang bertakwa, yaitu orang-orang menjalankan perintah Allah dan meninggalkan larangan-Nya di dalam berhaji. Dan bertakwalah kepada Allah, dan ketahuilah bahwa kamu akan dikumpulkan-Nya, yakni kamu semua akan dikumpulkan kepada-Nya kelak pada hari kiamat. Demikianlah, Allah menjelaskan tata cara yang benar dalam melaksanakan ibadah haji yang disyariatkan bagi orang-orang yang beriman. Allah menjelaskan perihal dua golongan manusia, yaitu orang munafik dan orang mukmin yang beramal mengorbankan harta dan jiwanya untuk mencari rida-Nya. Ayat 204-206 diturunkan berkenaan dengan seorang munafik bernama al-akhnas bin syuraiq aÅ¡-Å aqafi, yang setiap bertemu nabi Muhammad ia memuji nabi dan mengucapkan kata-kata yang mengagumkan nabi. Dan di antara manusia ada yang pembicaraannya tentang kehidupan dunia, atau pembicaraannya di dalam kehidupan dunia, tidak di akhirat nanti mengagumkan engkau, wahai nabi Muhammad, sebab ia mengatakan perkataan yang manis di hadapanmu, dan dia bersaksi kepada Allah mengenai isi hatinya, yakni ia bersumpah dengan nama Allah bahwa ia beriman kepada engkau, padahal dia adalah penentang yang paling keras. Di akhirat akan terungkap bahwa isi hatinya tidak sesuai dengan ucapannya."
  }
]