[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagian orang dari orang-orang munafik, membuatmu –wahai rosul- kagum dengan kata-katanya yang bergaya bahasa indah, kata-kata yang fasih yang diharapkan untuk mencari kesenangan duniawi, bukan bagian di akhirat. Kemudian mereka bersumpah dengan nama Allah demi mempersaksikan kecintaannya pada Islam dalam hatinya. Dalam ulah mereka ini terdapat puncak sikap lancang mereka terhadap Allah, Padahal dia adalah orang yang amat besar permusuhan dan perlawanannya terhadap Islam dan kaum muslimin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "204. Di antara manusia ada orang munafik yang ucapannya di dunia ini memikat hatimu -wahai Nabi-. Engkau melihat tutur katanya sangat bagus sehingga engkau menyangka bahwa ucapannya itu jujur dan tulus. Padahal sesungguhnya tujuan utamanya ialah menyelamatkan diri dan hartanya. Ia mempersaksikan kepada Allah keimanan dan kebaikan yang ada di dalam hatinya, padahal sejatinya ia berdusta. Dan ia sangat keras perseteruan dan permusuhannya kepada umat Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "204-205. Allah memperingatkan Nabi Muhammad dan kaum muslimin dari orang-orang munafik: Sebagian orang munafik membuatmu takjub dengan perkataan mereka yang sangat fasih dan bermanis kata kepada orang-orang beriman, dan mereka bersumpah atas kesungguhan hati mereka dalam mencintai Rasulullah dan Islam; padahal mereka adalah orang yang paling besar kebencian dan permusuhannya terhadap orang-orang beriman, dan jika mereka pergi dari sisimu mereka akan sekuat tenaga melakukan kerusakan di muka bumi, menghancurkan bangunan, tanaman, dan keturunan. Sungguh Allah tidak menyukai dan tidak meridhai perbuatan merusak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "204. وَمِنَ النَّاسِ (Dan di antara manusia) Mereka adalah segolongan orang-orang munafik yang menunjukkan keimanan mereka dan menyembunyikan kekufuran. Ayat ini diturunkan untuk seorang munafik yang keluar dari pertemuan dengan Nabi Muhammad kemudian melewati kebun dan sekumpulan unta milik kaum muslimin, lalu dia membakar kebun dan menyembelih unta-unta tersebut. وَيُشْهِدُ اللَّـهَ عَلَىٰ مَا فِى قَلْبِهِۦ (dan dipersaksikannya kepada Allah (atas kebenaran) isi hatinya) Yakni bersumpah atas hal itu dengan berkata: Sungguh Allah bersaksi apa yang ada di hatiku adalah kecintaan kepada Allah dan kepada Islam. ألد (penantang yang paling keras) Yakni yang suka berselisih dengan keras"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "204. Beberapa manusia, yaitu orang-orang munafik itu ada yang ucapannya tentang dunia mengejutkanmu wahai Nabi, yaitu bahwa dia beriman kepada Allah dan rasulNya, serta bersumpah tentang kebenaran isi hatinya yang berupa kecintaan kepada rasul atau islam sedangkan dia itu penantang paling dahsyat di antara manusia. Ath-Thabary meriwayatkan dari As-Suddy bahwa ayat 204 sampai 206 diturunkan untuk Ahnas bin Syuraiq yang mendatangi rasulullah SAW dan menunjukkan keislamannya kemudian dia pergi dan bertemu dengan tanaman dan keledai milik orang-orang mukmin, lalu dia membakar tanaman dan membantai keledai itu. Kemudian Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara manusia ada yang pembicaraannya tentang kehidupan dunia membuatmu kagum dan dia menjadikan Allah sebagai saksi atas isi hatinya. Padahal dia adalah penentang yang paling keras} orang yang sangat memusuhi dan menentang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "204. Setelah Allah memerintahkan untuk memperbanyak dzikir kepadaNya, khususnya pada waktu-waktu utama yang merupakan kebaikan, kemaslahatan, dan kebajikan lalu Allah mengabarkan kondisi orang yang berbicara dengan lisannya, namun perbuatannya bertentangan dengan perkataannya tersebut. Perkataan itu bisa saja mengangkat seseorang dan bisa juga menjatuhkannya, maka Allah berfirman, “Dan diantara manusia ada orang yang ucapannya tentang kehidupan dunia menarik hatimu.” Maksudnya, apabila ia berkata, bicaranya indah sekali bagi pendengar, dan apabila ia berucap, anda akan mengira ia berbicara dengan perkataan yang berguna, lalu ia menegaskan bahwa apa yang ia bicarakan itu “dipersaksikannya kepada Allah (atas kebenaran) isi hatinya,” dengan memberi tahu bahwasanya Allah mengetahui apa yang ada dalam hatinya sesuai dengan apa yang ia bicarakan tersebut, padahal ia berdusta dalam hal itu, karena perkataannya bertentangan dengan perbuatannya, sekiranya dia benar, pastilah perkataan dan perbuatannya akan sesuai dengan kondisi seorang mukmin yang bukan munafik. Oleh karena itu Allah berfirman, “Padahal dia adalah penantang yang paling keras,” maksudnya, apabila engkau berbantahan dengannya, engkau akan mendapatkan permusuhan sengit, keras, fanatik, dan segala macam hal yang disebabkan oleh hal itu yang merupakan akhlak akhlak yang buruk yang bukan seperti akhlak kaum mukminin, yaitu orang-orang yang menjadikan kemudahan adalah kendaraan mereka, ketundukan kepada kebenaran adalah tugas mereka, dan toleransi adalah karakter mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يُعۡجِبُكَ } Yu’jibuka : Membuatmu terpukau dan engkau menganggapnya bagus. { في الدنيا } Fiddunya : Jika berbicara mengenai masalah duniawi. { أَلَدُّ ٱلۡخِصَامِ } Aladdul khishaam : Sangat pandai bersilat lidah karena kefasihan bicaranya. Makna ayat: Allah Ta’ala mengabarkan kepada Rasul Nya dan kaum mukminin mengenai keadaan orang-orang munafik, dan orang-orang mukmin yang jujur dalam firman Nya kepada rasul Nya ﷺ,”Di antara manusia ada orang munafik yang pandai berbicara, sampai membuatmu terpukau akan keindahan ucapannya. Hal itu apabila ia membicarakan masalah-masalah duniawi. Berbeda tatkala ia membicarakan masalah akhirat, sebenarnya ia bodoh tentang itu dan tidak memiliki keinginan membicarakannya, karena sejatinya ia kafir. Ketika ia berbicara akan membawa nama Allah bahwa dirinya meyakini apa yang dikatakannya itu, kemudian ia berkata kepada Rasulullah ﷺ : “Allah mengetahui bahwasanya aku seorang mukmin, Allah tahu bahwa aku mencintai engkau..” dan banyak ucapan lain dengan membawa nama Allah. Pelajaran dari ayat: • Peringatan agar tidak tertipu dengan kefasihan dan ucapan yang memukau dari seseorang, apabila bukan termasuk orang yang beriman dan ikhlas. • Ucapan seseorang,”Allah mengetahui...Allah mempersaksikan..” terhitung sebagai sumpah. Hendaknya seorang mukmin berhati-hati mengucapkannya jika ia mengetahui bahwa yang ia ucapkan merupakan kedustaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 204: Allah mengabarkan bahwasannya sebagian orang-orang munafik jika berbicara akan membuat takjub pendengar dengan ucapannya karena sebab kefasihan dan keindahan bahasa akan tetapi Allah mengabarkan dihati mereka terdapat kebohongan baik antara lisan dan kenyakinan; bahkan orang-orang munafik adalah musuh Allah dan rasul-Nya serta orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia adalah salah seorang munafik, bernama Al Akhnas bin Syuraiq. Ucapannya sangat manis di hadapan Nabi shallallahu 'alaihi wa sallam, bahkan dia bersumpah bahwa dirinya seorang mukmin dan mencintai Beliau, sehingga Beliau mendekatkan orang tersebut dengan majlis Beliau, maka Allah Subhaanahu wa Ta'aala mendustakannya. Orang tersebut –seperti yang dijelaskan pada ayat selanjutnya- pernah melewati tanaman dan beberapa ekor keledai milik sebagian kaum muslimin, lalu tanaman itu dibakarnya dan keledai-leledai itu disembelihnya pada malam hari (dari tafsir Al Jalaalain). Ucapannya seakan-akan benar dan memberikan manfaat. Padahal jika ucapannya benar, tentu antara ucapan dengan perbuatan tidak berbeda, namun pada kenyataannya ia menentang Islam dengan keras. Yakni terhadap Islam dan kaum muslimin. Sikapnya akan nampak ketika dia bertengkar, dia akan menampakkan sifat-sifat buruk dan menampakkan akhlak yang bukan akhlak seorang mukmin. Berbeda dengan seorang mukmin, di mana bahtera yang ditumpanginya adalah mudah memaafkan, tugasnya tunduk kepada kebenaran dan tabi'atnya lapang dada. Dalam ayat ini terdapat dalil bahwa ucapan yang keluar dari mulut seseorang bukanlah dalil yang menunjukkan benar atau dusta serta baik atau buruknya seseorang sampai ada amal yang membenarkan atau mentazkiyahnya, dan bahwa sepatutnya kita mengetest keadaan para saksi serta tidak tertipu dengan tazkiyah (rekomendasi) dari diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 204",
    "description": "Allah menjelaskan perihal dua golongan manusia, yaitu orang munafik dan orang mukmin yang beramal mengorbankan harta dan jiwanya untuk mencari rida-Nya. Ayat 204-206 diturunkan berkenaan dengan seorang munafik bernama al-akhnas bin syuraiq aÅ¡-Å aqafi, yang setiap bertemu nabi Muhammad ia memuji nabi dan mengucapkan kata-kata yang mengagumkan nabi. Dan di antara manusia ada yang pembicaraannya tentang kehidupan dunia, atau pembicaraannya di dalam kehidupan dunia, tidak di akhirat nanti mengagumkan engkau, wahai nabi Muhammad, sebab ia mengatakan perkataan yang manis di hadapanmu, dan dia bersaksi kepada Allah mengenai isi hatinya, yakni ia bersumpah dengan nama Allah bahwa ia beriman kepada engkau, padahal dia adalah penentang yang paling keras. Di akhirat akan terungkap bahwa isi hatinya tidak sesuai dengan ucapannya. Dan di antara perbuatannya ialah apabila dia berpaling dari engkau, tidak lagi bersama engkau, dia berusaha untuk berbuat kerusakan di bumi, melakukan berbagai kejahatan seperti merusak tanam-tanaman, dan membunuh binatang ternak, kepunyaan orang-orang yang beriman, sedang Allah tidak menyukai hamba-Nya berbuat kerusakan di muka bumi."
  }
]