[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila dia pergi dari sisimu -wahai Rasul- , dia bersungguh-sungguh dan penuh semangat di muka bumi untuk melakukan kerusakan padanya, menghancurkan tanaman-tanaman milik orang-orang, membunuh hewan ternak mereka. dan Allah tidak menyukai perbuatan merusak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "205. Apabila ia (orang munafik) berpaling darimu dan berpisah denganmu, ia berusaha keras untuk membuat kerusakan di muka bumi dengan cara berbuat maksiat, merusak tanam-tanaman dan membunuh binatang ternak. Sedangkan Allah tidak menyukai kerusakan di muka bumi dan tidak mencintai orang-orang yang suka membuat kerusakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "205. وَإِذَا تَوَلَّىٰ (Dan apabila ia berpaling (dari kamu) ) Yakni apabila berpaling dan pergi darimu wahai Muhammad سَعَىٰ فِى الْأَرْضِ (ia berjalan di bumi) Yakni dengan mengerahkan segala upayanya لِيُفْسِدَ فِيهَا (untuk mengadakan kerusakan padanya) Dengan melakukan penghancuran seperti, merencanakan apa yang berbahaya bagi kaum muslimin dan membuat jebakan-jebakan untuk mereka. وَيُهْلِكَ الْحَرْثَ (dan merusak tanam-tanaman) Yakni perkebunan وَالنَّسْلَ ۗ (dan binatang ternak) Dan pendapat lain mengatakan: anak keturunan. وَاللَّـهُ لَا يُحِبُّ الْفَسَادَ (dan Allah tidak menyukai kerusakan) Yakni meliputi segala jenis perbuatan merusak tanpa membedakan kerusakan atas agama maupun atas urusan dunia. Pendapat lain mengatakan makna dari ayat ini adalah orang zalim yang memimpin kekusaan kemudian membuat kerusakan di muka bumi, lalu Allah menahan turunnya hujan sehingga menyebabkan kebinaasan pada tanaman dan binatang ternak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kerusakan itu memiliki penampakan yang berbeda-beda, awalnya adalah : keluar dari sunnah-sunnah kauniyah Allah dan ijtima'iyah, mengatasi perkara umum dan khusus dengan kelalaian, dan hal itu diawali dengan perkara-perkara yang sederhana, seperti meninggalkan saluran air terbuka tanpa sebab, atau membiarkannya rusak tanpa ada usaha untuk memperbaikinya, atau meninggalkan suatu kerusakan yang parah; sehingga menjadikannya cacat berkepanjangan!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "205. Dan ketika dia pergi dan berpaling darimu, dia berupaya melakukan kerusakan, penipuan, pembunuhan, dan kezaliman di bumi, Dia merusak tanam-tanaman, dan hewan beserta keturunannya. Allah secara mutlak tidak menyukai kerusakan dalam agama dan dunia, bahkan dia akan menghukum orang yang melakukannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila berpaling} berpaling dan berpisah {dia berusaha untuk berbuat kerusakan di bumi serta merusak tanam-tanaman} merusak tanaman {dan ternak} membunuh ternaak {Allah tidak menyukai kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "205. “Dan apabila dia berpaling (darimu)”, yakni orang yang perkataannya mengesankan hatimu setelah sebelumnya berada di sisimu, “ia berjalan di bumi untuk mengadakan kerusakan padanya.” Maksudnya, dia berusaha mengamalkan kemaksiatan berupa perbuatan merusak bumi hingga dia binasa karenanya, “tanaman-tanaman dan binatang binatang ternak,” pepohonan, buah-buahan, dan hewan hewan ternak musnah, berkurang, dan keberkahannya menjadi sedikit yang disebabkan oleh perbuatan maksiat, “dan Allah tidak menyukai kerusakan.” Apabila Allah tidak menyukai kerusakan, maka Allah sangat murka terhadap hamba yang merusak dimuka bumi, walaupun orang itu berbicara dengan perkataan yang baik dengan lisannya. Ayat ini adalah dalil bahwa perkataan yang diungkapkan oleh seseorang bukanlah tanda dari kebenaran dan kebohongan, bukan pula kebaikan dan kejahatan, hingga terwujud perbuatan yang membuktikan benarnya perkataan tersebut, dan sebaiknya menguji dahulu kondisi para saksi, yang berkata benar atau yang berkata batil dengan adanya perbuatan-perbuatan mereka yang baik, dan menyingkap kondisi-kondisi kehidupan mereka, dan agar tidak ter terpedaya oleh pencemaran dan penyucian mereka atas diri mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { تَوَلَّىٰ } Tawalla : Kembali dan berpaling, atau dia memiliki kekuasaan. { ٱلۡحَرۡثَ وَٱلنَّسۡلَۚ } Al-Hartsa wan nasl : Al-Harts maknanya tanam-tanaman, dan an-Nasl artinya hewan-hewan. Makna ayat: Apabila ia bangkit dari majelismu dan berpaling darimu, () ia berjalan di muka bumi dengan membawa kerusakan, yaitu menghancurkan tanam-tanaman dan hewan-hewan dengan melakukan dosa besar sehingga hujan tidak turun dan hasil tanaman pun mengering, bumi mengering, dan hewan-hewan pun mati serta terputusnya regenerasi. Perbuatan itu dibenci oleh Allah Ta’ala. Allah tidak menyukai perbuatan tersebut dan tidak menyukai pelakunya. Pelajaran dari ayat: • Seburuk-buruk manusia adalah orang yang berbuat kerusakan di bumi dengan memikul dosa-dosa besar yang menyebabkan kerusakan dan kehancuran bagi manusia maupun hewan-hewan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 205: Allah menjelaskan bahwasannya ketakjuban kalian wahai manusia jika mereka keluar bersama kalian untuk mencari rezeki maka akan banyak ujian karena sebab kemaksiatan dan fitnah diantara manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan melakukan perbuatan maksiat. Ada yang berpendapat bahwa ayat di atas merupakan perumpamaan orang-orang yang berusaha menggoncangkan iman orang-orang mukmin dan selalu mengadakan kekacauan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 205",
    "description": "Dan di antara perbuatannya ialah apabila dia berpaling dari engkau, tidak lagi bersama engkau, dia berusaha untuk berbuat kerusakan di bumi, melakukan berbagai kejahatan seperti merusak tanam-tanaman, dan membunuh binatang ternak, kepunyaan orang-orang yang beriman, sedang Allah tidak menyukai hamba-Nya berbuat kerusakan di muka bumi. Dan apabila dikatakan kepadanya, bertakwalah kepada Allah, yakni jangan melakukan perbuatan atau mengucapkan perkataan yang menyebabkan turunnya azab Allah, maka bangkitlah kesombongannya untuk berbuat dosa, ia mengabaikan seruan itu dan dengan sombong ia berbuat dosa, tidak takut kepada ancaman Allah. Maka pantaslah baginya neraka jahanam, dan sungguh jahanam itu tempat tinggal yang terburuk."
  }
]