[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila orang munafik perusak itu dinasihati, dan dikatakan kepadanya “bertakwalah kepada Allah, takutlah akan siksaan Nya, tahanlah dirimu dari berbuat kerusakan di muka bumi”. Dia tidak menerima bahkan mereka membawa kesombongan dan sikaf kejahiliyahan untuk menambah dosa-dosa. Maka cukuplah neraka jahanam ( balasan baginya ) dan cukup sebagai siksaan baginya. dan seburuk buruk tempat tinggal adalah neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "206. Apabila orang yang suka membuat kerusakan itu dinasihati, “Takutlah kamu kepada Allah dengan cara menghormati batas-batas yang telah ditetapkan-Nya dan menjauhi larangan-larangan-Nya,” maka keangkuhan dan kesombongannya mencegahnya kembali ke jalan yang benar dan memaksanya mempertahankan dosanya. Maka balasan yang cukup baginya ialah masuk ke dalam neraka Jahanam. Dan sesungguhnya neraka Jahanam itu adalah seburuk-buruk tempat tinggal bagi para penghuninya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "206. Dan jika orang munafik itu diingatkan dan dinasehati agar takut terhadap Allah, mereka menolak nasehat itu. Kesombongan dan keangkuhan mereka membawa mereka untuk terus berbuat kerusakan, dosa, dan kezaliman. Bagi mereka neraka Jahannam yang merupakan seburuk-buruk tempat yang ditinggali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "206. أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ ۚ (bangkitlah kesombongannya yang menyebabkannya berbuat dosa) Yakni timbulnya kesombongan yang menjadikannya menolak nasehat disebabkan dosa yang ada dalam hatinya berupa kenifakan. Pendapat lain mengatakan yakni kecongkakan dan kekerasan jiwa membawanya kepada perbuatan dosa. Dan yang lain mengatakan yakni berbuat kekufuran karena kesombongan dan merasa memiliki kemuliaan. فَحَسْبُهُۥ جَهَنَّمُ ۚ (Maka cukuplah neraka Jahannam) Yakni cukup sebagai hukuman dan balasan الْمِهَادُ (tempat tinggal) Secara bahasa berarti tempat yang dipersiapkan untuk tidur. Sehingga bagi mereka ini adalah sesuatu yang lebih hina karena menjadi tempat tinggal mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berbangga diri dan sombong bagaikan gunung yang membatasi antara manusia dan kebenaran : { وَإِذَا قِيلَ لَهُ اتَّقِ اللَّهَ أَخَذَتْهُ الْعِزَّةُ بِالْإِثْمِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "206. Dan ketika dia diminta untuk bertakwa kepada Allah dalam tindakannya dan meninggalkan kerusakan, dia marah dan enggan menerima nasihat, karena dosa dan kesesatannya, maka cukuplah baginya itu azab neraka Jahanam sebagai siksa. Alangkah buruknya tempat yang mereka tinggali itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dikatakan kepadanya, “Bertakwalah kepada Allah,” kesombongan membawanya kepada perberbuatan dosa} kesombongan dan gairah bodohnya membawanya pada perbuatan dosa yang dilarang {Maka cukuplah baginya} maka cukuplah baginya balasan {neraka Jahanam. Sungguh itu seburuk-buruk tempat tinggal} seburuk-buruk tempat peristirahatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "206. Kemudian Allah menyebutkan bahwasanya orang yang merusak dimuka bumi ini dengan berbuat kemaksiatan kepada Allah apabila diperintahkan untuk bertakwa kepada Allah, dia akan menyumbangkan diri dan congkak. “Bangkitlah kesombongannya yang menyebabkannya berbuat dosa.” Dia menyatukan antara berbuat maksiat dan perilaku sombong terhadap pemberian nasihat. “Maka cukuplah (balasan) baginya Neraka Jahanam” yang merupakan tempat orang-orang yang bermaksiat dan berlaku sombong, “dan sungguh neraka jahannam itu adalah tempat tinggal yang seburuk-buruknya,” yaitu tempat menetap dan tempat tinggal, siksa yang abadi, kecemasan yang tidak putus, keputusasaan yang berkesinambungan, siksaan bagi mereka tidak diringankan dan tidak pula mereka mengharapkan pahala, sebagai balasan atas kejahatan mereka dan imbalan bagi perbuatan mereka. Kita berlindung kepada Allah dari kondisi kondisi mereka itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَخَذَتۡهُ ٱلۡعِزَّةُ بِٱلۡإِثۡمِۚ } Akhadzathul ‘Izzatu bil itsmi : Muncullah fanatisme dan kesombongan dengan dosa-dosanya, maka dia tidak bertakwa kepada Allah. Makna ayat: Kemudian Allah Ta’ala mengabarkan bahwa orang munafik ini apabila diperintah untuk berbuat yang baik dan dilarang dari pebuatan mungkar dengan ucapan “bertakwalah kepada Allah, jangan lakukan ini atau tinggalkanlah hal itu, maka ia muncullah fanatisme serta kesombongannya yang disebabkan oleh dosa-dosa yang dipikulnya itu. Maka ia tidak bertakwa kepada Allah dan tidak bertaubat kepada Nya, maka cukuplah balassan atas kemunafikan, keburukan, dan kerusakan yang ditimbulkannya dengan neraka Jahannam sebagai tempat tidurnya, ia kekal di dalamnya untuk selama-lamanya. Sungguh neraka Jahannam adalah seburuk-buruk tempat kembali. Pelajaran dari ayat: • Apabila dikatakan kepada seorang mukmin,”Bertakwalah kepada Allah,” wajib baginya untuk tidak marah atau membencinya dengan perintah untuk bertakwa itu. Bahkan hendaknya ia mengakui dosa-dosanya dan memohon ampun kepada Allah, serta bersegera meninggalkan maksiatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 206: Allah mengabarkan bahwasannya orang-orang munafik jika dinasehati dan diperintah bertaqwa mereka sombong dantetap dengan dosa, dan balasan bagi mereka adalah neraka jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang tersebut menggabung antara dua sifat buruk: suka bermaksiat dan sombong ketika dinasehati. Balasan yang pantas terhadap orang tersebut adalah neraka jahannam, dan neraka jahannam adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 206",
    "description": "Dan apabila dikatakan kepadanya, bertakwalah kepada Allah, yakni jangan melakukan perbuatan atau mengucapkan perkataan yang menyebabkan turunnya azab Allah, maka bangkitlah kesombongannya untuk berbuat dosa, ia mengabaikan seruan itu dan dengan sombong ia berbuat dosa, tidak takut kepada ancaman Allah. Maka pantaslah baginya neraka jahanam, dan sungguh jahanam itu tempat tinggal yang terburuk. Ayat berikut diturunkan berkenaan dengan suwaihib bin sina'n arraimi yang akan mengikuti nabi Muhammad hijrah ke madinah, akan tetapi orang-orang kafir mekah melarang ia membawa kekayaannya. Shuwahaib dengan ikhlas menyerahkan semua kekayaannya asal ia diperbolehkan hijrah ke madinah, lalu turunlah ayat ini. Dan di antara manusia ada orang yang mengorbankan dirinya, yakni mengorbankan kekayaannya, untuk mencari keridaan Allah. Nabi Muhammad bersabda, sungguh beruntung perdagangan shuwahaib. Dan Allah maha penyantun kepada hamba-hamba-Nya yang beriman dan mengerjakan amal saleh untuk memperoleh rida-Nya. Mayoritas ulama mengatakan bahwa ayat ini berlaku bagi siapa pun yang berjuang di jalan Allah."
  }
]