[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagian manusia ada orang yang rela menjual dirinya guna menggapai ridho Allah terhadap dirinya, dengan berjihad di jalannya dan komitmen dengan ketaatan kepada Nya. Dan Allah itu maha penyayang terhadap hamba-hamba Nya, dan meliputi hamba-hamba Nya yang beriman dengan rahmat yang amat luas di dunia dan akhirat mereka, lalu dia memberi balasan bagi mereka, dengan balasan terbaik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "207. Di antara manusia ada orang mukmin yang menjual dirinya dan mengorbankannya untuk menjalankan ketaatan kepada Rabbnya, berjuang di jalan-Nya dan mencari rida-Nya. Dan Allah itu Mahaluas kasih sayang-Nya kepada hamba-hamba-Nya dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "207. Dan sebagian orang beriman ‘menjual’ diri mereka demi mendapat keridhaan-Nya dengan berjihad di jalan Allah dan menjalankan perintah-Nya sampai ajal menjemputnya. Sungguh Allah Maha Lembut terhadap hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "207. يَشْرِى (orang yang menukar) Yakni orang yang menjual dirinya dalam amalan yang mengundang keridhaan Allah seperti, berjihad, memerintahkan orang lain untuk berbuat baik, dan melarang mereka berbuat kemungkaran. Dari Shuhaib dia berkata: ketika aku akan berhijrah dari Makkah menuju Rasulullah orang-orang Quraisy berkata kepadaku: Wahai Shuhaib, kamu datang ke kota kami tanpa harta apapun, kemudian akan meninggalkan kota ini dengan harta? Demi Allah itu tidak akan terjadi !. maka aku berkata kepada mereka: bagaimana pendapat kalian jika aku menyerahkan hartaku apakah kalian akan membiarkanku pergi? Mereka menjawab: Iya. (Shuhaib berkata) maka aku menyerahkan hartaku kepada mereka, mereka pun membiarkanku pergi, aku pun keluar dari Makkah hingga akhirnya aku sampai ke Madinah. Lalu cerita ini sampai kepada Rasulullah kemudian berkata: “telah untung perniagaan Shuhaib ! telah untung perniagaan Shuhaib !”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "207. Dan sebagian manusia menjual jiwanya untuk mendapatkan ridha Allah, seperti berjihad. Dan Allah itu Dzat yang memiliki rahmat yang sangat luas bagi hamba-hambaNya. Ayat ini turun karena Shuhaib bin Sinan Ar-Rumi yang meninggalkan hartanya di Mekah supaya dia bisa hijrah menuju Madinah, lalu hal itu sampai di telinga nabi SAW dan bersabda: “Abu Yahya Suhaib telah beruntung, Suhaib telah beruntung.” Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara manusia ada orang yang menjual} menjual {dirinya untuk mencari ridha Allah. Allah Maha Penyantun kepada para hamba"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "207. Mereka ini adalah orang-orang yang diberi Taufik (oleh Allah) yang telah menukar diri mereka dan menjualnya serta mempersembahkannya demi mendapatkan keridhaan Allah dan mengharapkan pahalaNya. Mereka mengerahkan segala yang berharga demi Yang Maha memiliki lagi maha menepati janji, yang maha penyantun kepada hamba-hambaNya, di mana diantara kelembutan dan kasih sayangNya adalah Dia membimbing mereka kepada hal tersebut, dan Dia berjanji untuk menepati hal tersebut Seraya berfirman : \"Sesungguhnya Allah telah membeli dari orang-orang mukmin diri dan harta mereka dengan memberikan surga untuk mereka\" QS at-taubah ayat 111 Dalam ayat ini Allah memberitahu bahwa mereka telah menjual diri mereka dan mempersembahkannya, dan Allah juga memberitahu tentang kasih sayangNya yang pasti akan membuat mereka memperoleh apa yang mereka inginkan dan apa yang mereka sukai, maka janganlah di tanyakan lagi tentang apapun yang mereka peroleh dari kemuliaan dan apa yang mereka dapatkan dari kemenangan dan kehormatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يَشۡرِي نَفۡسَهُ } Yasyri nafsahu : Menjual dirinya kepada Allah Ta’ala dengan amalan jihad fisabilillah berkorban jiwa dan hartanya. Makna ayat: Selanjutnya Allah Ta’ala mengabarkan bahwa orang mukmin yang jujur dengan keimanannya dengan firman Nya,”Di antara manusia ada seorang mukmin yang jujur imannya, ia menjual diri dan hartanya kepada Allah Ta’ala, mencari keridhaan Nya dan kehidupan di sisi Nya di surga negeri keselamatan. Allah Ta’ala berfirman,”Dan di antara manusia ada orang yang mengorbankan dirinya karena mencari keridhaan Allah; dan Allah Maha Penyantun kepada hamba-hamba Nya.” Diceritakan bahwa orang munafik yang dimaksud dalam pembicaraan ayat tiga ayat di atas adalah Al-Akhnas bin Syuraiq, dan orang mukmin yang dibicarakan dalam ayat adalah Shuhaib bin Sinan Ar-Rumiy Abu Yahya. Ceritanya ketika orang-orang musyrik mengetahui bahwa Shuhaib akan berhijrah ke Madinah untuk menyusul Rasulullah ﷺ dan para sahabatnya, mereka mengatakan,”Jangan kamu pergi dengan membawa diri serta hartamu kepada Muhammad, kami tidak akan mengizinkan kamu berhijrah kecuali kamu memberikan kami seluruh hartamu.” Maka Shuhaib memberikan seluruh hartanya dan berhijrah. Tatkala ia sampai di Madinah dan Rasulullah ﷺ melihatnya beliau berkata,”Keuntungan yang besar dari perniagaanmu wahai Abu Yahya, keuntungan yang besar.” Ayat ini walaupun turun mengenai Al-Akhnas dan Shuhaib, namun hikmahnya bisa diambil dari keumuman lafadznya, bukan karena sebab turunnya. Al-Akhnas menjadi contoh buruk bagi siapa saja yang memiliki sifat sama seperti dirinya, dan Shuhaib menjadi contoh baik dan sempurna bagi siapa saja yang memiliki sifat seperti dirinya. Pelajaran dari ayat: • Anjuran untuk berjihad dengan jiwa dan harta, serta bolehnya seorang muslim memberikan seluruh hartanya di jalan Allah. Hal itu tidak terhitung sebagai berlebih-lebihan atau tabdzir. Karena yang dimaksud berlebih-lebihan apabila dihabiskan untuk perubatan dosa dan maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 207: Allah menjelaskan bahwasannya disana ada satu golongan dari manusia yang menjual diri – diri mereka untuk mencari ridho Allah dengan jihad dijalan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hakim meriwayatkan dari Ikrimah, ia berkata: Ketika Shuhaib keluar berhijrah, maka penduduk Mekah mengejarnya, ia pun mengeluarkan wadah panahnya dan mengambil empat puluh anak panahnya sambil berkata, \"Kamu tidak dapat sampai kepadaku sebelum saya timpakan anak panah kepada masing-masing kamu, setelah itu saya akan menggunakan pedang sehingga kamu pun tahu bahwa saya adalah seorang laki-laki, dan sesungguhnya saya telah meninggalkan di Mekah dua orang budak wanita, dan keduanya boleh kamu ambil.\" Hakim juga meriwayatkan dari Anas yang sama seperti itu, ketika itu turun ayat kepada Nabi shallallahu 'alaihi wa sallam, \"Wa minan naasi may yasyriy nafsahub tighaa'a mardhaatillah…dst.\" ketika Nabi shallallahu 'alaihi wa sallam melihat Shuhaib, Beliau bersabda, \"Wahai Abu Yahya! Beruntunglah jual beli(mu).\" Beliau pun membacakan ayat tersebut. (Hadits ini shahih sesuai syarat Muslim, namun ia tidak mengeluarkan dalam shahihnya). Dengan berjihad di jalan Allah dan ta'at kepada-Nya. Ada yang berpendapat bahwa ayat ini turun berkenaaan dengan Shuhaib yang disakiti oleh kaum musyrikin, kemudian dia berhijrah ke Madinah dan meninggalkan hartanya untuk mereka di Makkah. Oleh karena itu, Allah Subhaanahu wa Ta'aala tidak akan menyia-nyiakannya, bahkan akan memberikan balasan yang paling baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 207",
    "description": "Ayat berikut diturunkan berkenaan dengan suwaihib bin sina'n arraimi yang akan mengikuti nabi Muhammad hijrah ke madinah, akan tetapi orang-orang kafir mekah melarang ia membawa kekayaannya. Shuwahaib dengan ikhlas menyerahkan semua kekayaannya asal ia diperbolehkan hijrah ke madinah, lalu turunlah ayat ini. Dan di antara manusia ada orang yang mengorbankan dirinya, yakni mengorbankan kekayaannya, untuk mencari keridaan Allah. Nabi Muhammad bersabda, sungguh beruntung perdagangan shuwahaib. Dan Allah maha penyantun kepada hamba-hamba-Nya yang beriman dan mengerjakan amal saleh untuk memperoleh rida-Nya. Mayoritas ulama mengatakan bahwa ayat ini berlaku bagi siapa pun yang berjuang di jalan Allah. Wahai orang-orang yang beriman! masuklah ke dalam islam secara keseluruhan. Kata as-silm atau as-salm di sini berarti islam. Laksanakanlah islam secara total, tidak setengah-setengah, dan janganlah kamu ikuti langkah-langkah setan yang menyesatkan dan memecah belah kamu. Sungguh, ia musuh yang nyata bagimu. Ayat ini diturunkan berkaitan dengan seorang yahudi bernama abdulla'h bin sala'm. Ia memeluk islam tetapi masih mengerjakan sejumlah ajaran yahudi, seperti mengagungkan hari sabat dan enggan mengonsumsi daging dan susu unta."
  }
]