[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah sebagai Tuhan dan kepada Muhammad sebagai nabi dan rasul, serta kepada Islam sebagai agama, Masuklah ke Seluruh ajaran syariat Islam dengan mengamalkan seluruh hukumnya, dan jangan kalian tinggalkan barang sedikitpun darinya, dan jangan kalian mengikuti jalan-jalan setan, berupa maksiat maksiat yang iya mengajak kalian kepadanya. sungguh nya setan itu musuh yang nyata permusuhan nya kepada kalian, maka berhati-hatilah terhadap nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "208. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, masuklah kalian ke dalam Islam seutuhnya. Jangan ada sesuatupun dari agama yang kalian tinggalkan, seperti yang dilakukan orang-orang ahli kitab yang mempercayai sebagian isi kitab suci mereka dan mengingkari sebagian isinya yang lain. Dan janganlah kalian mengikuti jalan yang ditempuh oleh setan, karena dia adalah musuh yang nyata bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "208. Allah menujukan firman-Nya kepada seluruh orang yang beriman: “Masuklah ke dalam Islam sepenuhnya dengan mengamalkan segala hukumnya. Dan janganlah kalian mengikuti jejak dan perbuatan setan, sebab ia adalah musuh yang jelas permusuhannya terhadap kalian, salah satu tandanya adalah ia selalu menyulut permusuhan diantara kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "208. ادْخُلُوا۟ فِى السِّلْمِ كَآفَّةً (masuklah kamu ke dalam Islam keseluruhan) Ketika Allah menebutkan bahwa manusia terbagi menjadi tiga kelompok, mukmin, kafir, dan munafik, maka Allah memerintahkan mereka setelah itu untuk memeluk Islam dengan seluruh lisan dan hati mereka, dan masuk ke seluruh rukun islam. وَلَا تَتَّبِعُوا۟ خُطُوٰتِ الشَّيْطٰنِ (dan janganlah kamu turut langkah-langkah syaitan) Yakni jangan berdiri dibelakangnya dan mentaati apa yang dia perintahkan berupa melakukan perbuatan syubhat dan maksiat untuk menyesatkan dan menghinakan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "208. Wahai orang-orang yang beriman, masukalah Islam dengan sepenuhnya bukan setengah-setengah, atau masuklah Islam, kerjakanlah seluruh hukum-hukumnya, janganlah berbuat munafik, waspadailah bisikan setan, dan jangan taati apa yang dia perintahkan kepada kalian, karena sesungguhnya dia itu musuh yang nyata bagi kalian. Ath-Thabari meriwayatkan bahwa ayat ini turun untuk Abdullah bin Salam dan para sahabat Yahudinya, ketika mereka tetap mengagungkan hari sabtu dan membenci unta setelah menerima Islam, Lalu orang-orang muslim mencegah mereka melakukan hal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, masuklah ke dalam Islam secara menyeluruh} Islam secara keseluruhan {dan janganlah mengiikuti langkah-langkah setan. Sesungguhnya dia musuh yang nyata bagi kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "208. Ini merupakan perintah Allah kepada orang-orang yang beriman untuk masuk “ke dalam Islam keseluruhan.” Maksudnya, dalam seluruh syariat syariat agama, mereka tidak meninggalkan sesuatu pun darinya, dan agar mereka tidak seperti orang yang menjadikan hawa nafsunya sebagai Tuhannya. Apabila hawa nafsunya itu sejalan dengan perkara yang disyariatkan, maka dia kerjakan, namun bila bertentangan dengannya, maka dia tinggalkan. Yang wajib adalah menundukkan hawa nafsunya kepada agama, dan ia melakukan segala perbuatan baik dengan segala kemampuannya, dan apa yang tidak mampu dia lakukan, maka dia berusaha dan berniat melakukannya dan menjangkaunya dengan niatnya tersebut. Ketika masuk kedalam Islam dengan keseluruhan, maka tidak mungkin dan tidak dapat dibayangkan terjadi, kecuali bertentangan dengan jalan-jalan setan, Allah berfirman, “Dan janganlah kamu menuruti langkah-langkah setan,” maksudnya, dalam perbuatan dengan melakukan kemaksiatan kepada Allah. “Sesungguhnya setan itu musuh yang nyata bagimu.” musuh yang nyata tidaklah akan mengajak kecuali kepada kejahatan dan kekejian serta segala yang mengandung madharat bagi kalian. Dan ketika sudah menjadi kepastian bahwa manusia akan melakukan kesalahan dan ketergelinciran, maka Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلسِّلۡمِ } As-Silmi : Agama Islam { كَآفَّةٗ } Kaffah : keseluruhan, tidak ada seorangpun yang tertinggal untuk masuk ke dalam Islam, atau tidak meninggalkan hukum-hukumnya serta syariatnya sedikitpun. { خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ } Khutuwatisy Syaithan : Metode-metode yang ditempuh untuk mengajak kepada kebathilan serta memperindah keburukan dan kejelekan. Makna ayat: Allah Tabaraka wa Ta’ala yang Maha Benar memanggil hamba-hamba Nya yang beriman untuk memerintahkan mereka masuk ke dalam agama Islam secara totalitas. Dengan tidak memilih di antara syariat-syariat dan hukum-hukumNya hal yang menguntungkan dirinya saja, sesuai dengan hawa nafsunya, itu yang diterima dan diamalkan. Namun jika tidak sesuai dengan hawa nafsunya, akan ditolaknya, atau ditinggalkan, atau tidak dilaksanakan. Hendaknya kaum mukminin menerima seluruh syariat Islam dan seluruh hukum-hukum yang berlaku di dalamnya. Dan Allah melarang kaum mukminin untuk mengikuti langkah-langkah setan dengan memperbagus yang buruk dan menghiasi kemungkaran. Karena setanlah yang membuat sebagian ahli kitab mengagungkan hari Sabtu da menghalalkan daging unta dengan argumen bahwa inilah agama Allah yang dianut oleh orang-orang shalih dari kalangan Bani Israil. Maka turunlah ayat ini kepada mereka, memerintahkan mereka dan seluruh kaum mukminin untuk menerima seluruh syairat Islam dan hukum-hukumnya, memeperingatkan mereka akibat mengikuti langkah-langkah setan, yaitu kebinasaan total. Dan itulah yang diinginkan oleh setan sebagai bentuk permusuhannya kepda manusia. Inilah kandungan ayat (208). Pelajaran dari ayat: • Kewajiban menerima seluruh syariat Islam secara totalitas, serta keharaman untuk pilih-pilih dalam syariat. • Orang yang menghalalkan yang haram, dan meninggalkan kewajiban, sejatinya dia adalah pengikut setan dalam hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 208: Allah memerintahkan seorang hamba yang beriman untuk menerima seluruh syariat islam dan hukum-hukumnya dan meninggalkan satupun darinya serta tidak mencari jalan-jalan setan yang kotor."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara ahli tafsir ada yang mengatakan bahwa ayat ini turun berkenaan Abdullah bin Salam dan kawan-kawannya yang masih memuliakan hari Sabtu dan enggan makan unta, padahal mereka sudah masuk Islam. Yakni terapkanlah ajaran Islam semuanya, jangan ditinggalkan salah satu apalagi sebagiannya dan jangan menjadikan hawa nafsu sebagai tuhannya, di mana orang yang seperti itu tolok ukur utamanya adalah hawa nafsu, jika syari'at Islam sejalan dengan selera hawa nafsunya, maka dikerjakan, tetapi jika tidak sejalan dengan selera hawa nafsunya, maka ditinggalkan. Bahkan seharusnya hawa nafsu mengikuti syari'at, dan hendaknya ia mengerjakan perbuatan baik yang bisa dilakukan, sedangkan yang belum bisa dilakukan, maka dengan diniatkan dalam hatinya agar dapat mengejarnya. Berupa kemaksiatan yang diserukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 208",
    "description": "Wahai orang-orang yang beriman! masuklah ke dalam islam secara keseluruhan. Kata as-silm atau as-salm di sini berarti islam. Laksanakanlah islam secara total, tidak setengah-setengah, dan janganlah kamu ikuti langkah-langkah setan yang menyesatkan dan memecah belah kamu. Sungguh, ia musuh yang nyata bagimu. Ayat ini diturunkan berkaitan dengan seorang yahudi bernama abdulla'h bin sala'm. Ia memeluk islam tetapi masih mengerjakan sejumlah ajaran yahudi, seperti mengagungkan hari sabat dan enggan mengonsumsi daging dan susu untatetapi jika kamu tergelincir akibat berbuat maksiat dan tidak melaksanakan islam secara keseluruhan, ka'ffah, setelah bukti-bukti yang nyata, yakni dalil tentang kebenaran islam, sampai kepadamu melalui wahyu yang dibawa oleh para nabi, ketahuilah bahwa Allah mahaperkasa. Tidak ada yang dapat menghalangi siksaan-Nya. Allah juga mahabijaksana dalam segala perbuatan-Nya."
  }
]