[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika kalian melenceng dari jalan kebenaran setelah datangnya kepada kalian hujjah hujjah nyata dari Alquran dan as-sunnah, maka ketahuilah sesungguhnya Allah itu maha perkasa dalam kerajaan Nya, tidak ada sesuatu pun yang luput dari Nya, juga Maha bijaksana dalam perintah dan larangan Nya, dimana Dia meletakkan segala sesuatu pada tempatnya yang tepat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "209. Jika kalian melakukan kesalahan dan penyimpangan setelah datang kepada kalian dalil-dalil yang sangat jelas dan tidak ada kemuskilan sama sekali, maka ketahuilah bahwa Allah Maha Perkasa di dalam kekuasaan dan kerajaan-Nya, lagi Maha Bijaksana di dalam pengaturan dan penetapan syariat agama-Nya. Maka takutlah kamu kepada-Nya dan taatilah Dia!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "209. Dan jika kalian mengikuti jejak setan dan menjauh dari jalan yang benar setelah dating hujjah kepada kalian, maka sungguh Allah sangat berat pembalasan-Nya dan bijaksana dalam hukum-hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "209. فَإِن زَلَلْتُم (Tetapi jika kamu menyimpang) Yakni jika kalian tersesat dan berbelok dari kebenaran. مِّنۢ بَعْدِ مَا جَآءَتْكُمُ الْبَيِّنٰتُ (sesudah datang kepadamu bukti-bukti kebenaran) Yakni ayat-ayat Allah yang menunjukkan bahwa masuk ke dalam agama Islam adalah kebenaran. عَزِيزٌ (Maha Perkasa) Yakni perkasa, tidak berpengaruh pembalasan kalian terhadap-Nya. حَكِيمٌ (Maha Bijaksana) Yakni tidak membalas kecuali dengan kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diceritakan bahwa seorang a'roby mendengar seseorang membaca : ( فَإِنْ زَلَلْتُمْ مِنْ بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فاعلموا أن الله غفور رحيم ), sedangkan lelaki yang membaca itu bukan dari kalangan qurro', kemudian ia mengatakan : seandainya ini perkataan sang khaliq, niscaya ia tidak mengatakan seperti ini, kemudian lewat dihadapan keduanya seorang laki-laki lain, kemudian a'roby itu berkata : bagaimana engkau membaca ayat ini, kemudia laki-laki itu membaca : { فَإِنْ زَلَلْتُمْ مِنْ بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فَاعْلَمُوا أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ }, kemudian ia berkata : inilah yang pantas, dzat yang Maha bijaksana tidak menyebutkan gufron (ampunan) ketika seseorang menyimpang, karena sesungguhnya hal itu merupakan hasutan baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "209. Jika kalian berpaling dari jalan kebenaran setelah datangnya ayat yang jelas yang menunjukkan bahwa masuk Islam itu adalah suatu kebenaran, maka ketahuilah bahwa Allah itu maha Menaklukkan yang tidak mungkin bisa dikalahkan, Maha Kuasa untuk membalas, dan Maha Bijaksana tentang sesuatu yang akan diperbuat atas kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menyimpang} kalian menyimpang dari kebenaran {setelah bukti-bukti kebenaran yang nyata sampai kepadamu} petunjuk-petunjuk yang jelas {ketahuilah bahwa Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "209. “Tetapi jika kamu menyimpang (dari jalan Allah) sesudah datang kepadamu bukti-bukti kebenaran” atas dasar ilmu dan keyakinan, “maka ketahuilah, Bahwasanya Allah Maha perkasa lagi Maha bijaksana.” Ayat ini menunjukkan ancaman keras dan kengerian yang membawa kepada sikap meninggalkan kesalahan tersebut, karena sesungguhnya yang maha perkasa kedudukanNya lagi maha bijaksana apabila seorang pelaku kemaksiatan berbuat maksiat kepadaNya, pastilah Dia akan memaksanya dengan kekuatanNya dan menyiksanya sesuai dengan konsekuensi kebijaksanaanNya, dan termasuk dari kebijaksanaanNya adalah menyiksa orang-orang yang dan orang-orang yang berbuat jahat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فَإِن زَلَلۡتُم } Fain zalaltum : Terperosok dalam kessesatan, yaitu kefasikan dan maksiat-maksiat. { ٱلۡبَيِّنَٰتُ } Al-Bayyinaat : Hujjah dan bukti yang kuat. Makna ayat: Pada ayat (209) mengandung ancaman yang besar dan keras bagi siapa saja yang digelincirkan oleh setan, sehingga hanya mau menerima sebagian syariat Islam, dan tidak menerima sebagian yang lain, sedangkan ia mengetahui bahwa agama Islam adalah benar, dan syariatnya lebih berhak untuk diterima. Allah Ta’ala berfirman; “Tetapi jika kamu menyimpang (dari jalan Allah) sesudah datang kepada kamu bukti-bukti kebenaran...” Yaitu bukti-bukti yang ada dalam kitabullah Al-Qur’an dan dijelaskan oleh Rasulullah Muhammad ﷺ maka Allah akan membalas kalian. Karena Allah Ta’ala Maha kuasa atas segala urusan Nya dan bijaksanan dalam pengaturan Nya, dan Allah akan melaksanakan janji dan ancaman Nya. Pelajaran dari ayat: • Kewajiban memperkirakan jatuhnya hukuman ketika tersebarnya berbagai macam maksiat, agar tidak merasa aman dari makar Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 209: Allah memperingatan manusia jika mereka tersesat dari jalan kebenaran setelah nampak petunjuk; maka wajib mereka mengetahui bahwasannya Allah Maha Kuat yang akan membalas siapa yang berbuat maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dalam ayat ini terdapat ancaman keras terhadap sikap menyimpang dari jalan Allah, seperti dengan mengerjakan maksiat. Hal itu, karrena Allah yang Maha Perkasa mampu menyiksa orang yang bermaksiat dengan kekuatan-Nya dan berdasarkan hikmah (kebijaksanaan)-Nya, karena termasuk hikmah-Nya adalah menyiksa pelaku maksiat dan pelaku kejahatan. Oleh karena itu, tidak ada yang luput dari-Nya dan tidak ada yang dapat melemahkan-Nya Dia menetapkan segala sesuatu tepat pada tempatnya atau tindakan-Nya tepat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 209",
    "description": "Tetapi jika kamu tergelincir akibat berbuat maksiat dan tidak melaksanakan islam secara keseluruhan, ka'ffah, setelah bukti-bukti yang nyata, yakni dalil tentang kebenaran islam, sampai kepadamu melalui wahyu yang dibawa oleh para nabi, ketahuilah bahwa Allah mahaperkasa. Tidak ada yang dapat menghalangi siksaan-Nya. Allah juga mahabijaksana dalam segala perbuatan-Nya. Tidak ada yang mereka, yakni para pemaksiat dan orang yang tidak melaksanakan islam secara utuh, tunggu-tunggu kecuali datangnya azab Allah bersama malaikat dalam naungan awan kepada mereka, sedangkan perkara mereka, yakni ditimpakannya siksa atas mereka di hari kiamat, telah diputuskan. Dan kepada Allah-lah segala perkara dikembalikan."
  }
]