[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah panggilan dari Allah bagi manusia secara keseluruhan: “beribadahlah kepada Allah yang telah mengurusi kalian dengan nikmat-nikmat Nya dan takutlah kepadanya serta Jangan melanggar aturan agama Nya. Sungguh Dia telah mengadakan kalian dari ketiadaan dan juga mengadakan orang-orang sebelum kalian dengan harapan kalian menjadi manusia yang bertakwa yang diridhoi Allah dan kalian pun Ridho kepada Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Wahai manusia! Sembahlah Rabb kalian semata, tanpa menyembah yang lain, karena Dia lah yang telah menciptakan kalian dan umat-umat terdahulu. Semoga penyembahan itu bisa menjadi penghalang antara kalian dan azab-Nya, dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Setelah Allah menjelaskan tiga golongan manusia, Dia kemudian menyeru mereka untuk mengikrarkan peribadatan kepada-Nya; sebab Dialah yang menciptakan mereka dan seluruh manusia sebelum mereka sejak masa nabi Adam. Penegasan hal yang agung imi agar mereka dapat meraih derajat orang-orang bertakwa yang takut kepada Allah, supaya mendapat pahala yang besar dan keselamatan dari azab yang pedih. Penciptaan Nabi Adam dan keturunannya ini setelah Allah menciptakan langit dan bumi; Allah menjadikan bumi layak untuk dihuni dengan menciptakan di dalamnya rezeki dan berbagai kenikmatan, dan menjadikan langit sebagai atap yang terjaga dan rezeki yang baik berupa air hujan yang dapat menumbuhkan buah-buahan di bumi yang juga menjadi rezeki bagi binatang-binatang yang ada di atasnya. Dengan air tersebut tumbuhlah berbagai tanaman yang berpasang-pasangan, dan menjadi tempat merumput berbagai jenis binatang. Jika Allah merupakan Dzat yang memberi rezeki kepada manusia maka wajib bagi mereka untuk mengesakan-Nya dalam rasa syukur dan peribadatan. Oleh sebab itu Allah melarang hamba-hamba-Nya dari kesyirikan dengan membuat sesembahan selain-Nya, seperti menyembah para nabi atau orang-orang sholih, menyembah kuburan atau patung, atau menyembah hewan, semua perbuatan ini merupakan dosa yang paling besar yaitu kesyirikan. Padahal manusia memiliki ilmu sebagaimana yang mereka akui, maka selayaknya mereka mengetahui bahwa Allah Sang Pencipta dan Pemberi nikmat berhak untuk diesakan dalam peribadatan. Dalam hadits shahih dari Ibnu Mas'ud bahwa ia bertanya kepada Nabi: \"Dosa apa yang paling besar?\" Nabi menjawab: \"Engkau membuat sekutu bagi Allah, padahal Dia telah menciptakanmu.\" (shahih Bukhari: tafsir surat al-Baqarah, no. 4477. Dan shahih Muslim: kitab iman, bab syirik adalah dosa yang paling buruk, 1/90 no. 86)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. يٰٓاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِيْ خَلَقَكُمْ (Hai manusia, sembahlah Tuhanmu yang telah menciptakanmu) Dalam ayat ini Allah mengkhususkan penyebutan nikmat penciptaan yang telah Dia berikan kepada manusia, karena segala kenikmatan yang lain berasal dari kenikmatan ini. Dan juga karena orang-orang kafir mengakui bahwa Allah-lah yang menciptakan mereka. Sebagaimana disebutkan dalam firman-Nya: وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ Dan sungguh jika kamu bertanya kepada mereka: “Siapakah yang menciptakan mereka, niscaya mereka menjawab: “Allah” Oleh sebab itu Allah menyebutkan kenikmatan yang mereka akui dan tidak mereka ingkari kemudian Allah memerintah mereka untuk beribadah kepada-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara keindahan yang terkandung dalam kata ( رب ) adalah : bahwasanya perintah yang pertama dalam al-Qur'an ditafsirkan oleh : { يٰٓاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ } maka difahami bahwa sebab utama dari perintah beribadah adalah tuhanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai manusia! Beribadahlah hanya kepada Allah yaitu Dzat yang telah menciptakanmu dan orang-orang sebelum kamu yaitu umat-umat terdahulu agar kamu mewaspadai siksaNya dan mendapatkan ridhaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, sembahlah Tuhan kalian yang telah menciptakan kalian dan orang-orang sebelum kalian agar kalian bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Ini adalah perintah yang bersifat umum bagi seluruh manusia dengan sebuah perintah yang umum, yaitu ibadah yang mencakup menaati perintah-perintah Allah, menjauhi larangan-laranganNya, dan mempercayai kabar-kabarNya. Allah ta’ala memerintahkan mereka kepada tujuan diciptakannya mereka. \"Dan aku tidak menciptakan jin dan manusia melainkan supaya mereka mengabdi kepada-Ku.\" (QS. Ad-Dzariyat : 56) Kemudian Allah mengemukakan dalil yang menunjukkan kewajiban beribadah kepadaNya semata, yaitu karena Dia-lah Rabb kalian yang telah menganugrahkan kepada kalian berbagai macam nikmat, lalu Dia menciptakan kamu setelah (sebelumnya) kamu tidak ada dan Dia juga menciptakan orang-orang sebelum kamu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱلنَّاسُ An-Nas adalah Manusia, lafadz yang menunjukkan bentuk jamak dimana tidak memiliki bentuk tunggal yang selafadz. Untuk menunjukkan satu orang digunakan kata Insan. ٱعۡبُدُواْ U’buduu : Taatilah dengan keimanan dan mengharapkan pahala dalam melakukan perintah dan menjauhi larangan, disertai dengan kecintaan dan pengagungan yang penuh kepada Allah. رَبَّكُمُ Rabbakum : Sang Pencipta kalian dan Penguasa kalian, serta Sesembahan kalian yang benar. خَلَقَكُمۡ Kholaqokum : Mengadakan kalian dari ketiadaan dengan takdir yang besar. تَتَّقُونَ Tattaquun : Agar kalian bertakwa dengan membuat penjagaan yang melindungi dari adzab Allah. Hal tersebut dapat dicapai dengan keimanan dan amalan sholeh setelah meninggalkan syirik dan kemaksiatan. Makna ayat : Bentuk korelasi dengan ayat yang sebelumnya bahwa Allah Ta’ala menyebutkan keadaan orang mukmin yang beruntung, juga keadaan orang kafir yang merugi, lantas menyebutkan keadaan orang munafik yang mana mereka berada di antara golongan orang mukmin lagi jujur dan golongan orang kafir lagi merugi. Kemudian Allah memanggil seluruh golongan itu dengan panggilan umum yaitu “wahai sekalian manusia” agar merata kepada seluruh makhluk di setiap tempat dan waktu. Setelah itu Allah Ta’ala memerintahkan mereka untuk beribadah kepadaNya untuk menjaga diri dari kerugian. Memberitahukan kepada manusia tentang diriNya agar mereka mengetahui keagungan dan kesempurnaanNya, supaya lebih mudah untuk menyambut seruanNya lantas beribadah kepadaNya sehingga bisa selamat dari adzabNya serta meraih keridhoan dan surgaNya. Pelajaran dari ayat : 1. Kewajiban beribadah kepada Allah Ta’ala, yang mana itulah alasan kehidupan bagi seluruh makhluk. 2. Kewajiban mengenal Allah dengan nama-nama dan sifat-sifatNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 21: Ini adalah awal pertama kali seruan Allah kepada makhluk seluruhnya ; dimana Allah memerintahkan mereka agar beribadah kepada-Nya saja tanpa menyekutukannya. Dialah Allah yang berhak diibadahi , dan ibadah ini adalah maksud yang agung dari maksud diciptakannya manusia , Allah memerintahkan mereka untuk ibadah karena sebab Allah adalah Rabb mereka, di mana Allah menjadikan mereka ada yang sebelumnya mereka tiada . Allah juga memerintahkan kepada mereka untuk ibadah agar mereka menjadi orang-orang yang bertakwa, di mana tujuan mereka bertaqwa adalah untuk menjauhi azab Allah dengan mengerjakan perintah-perintah Allah dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan seruan Allah kepada semua manusia agar beribadah kepada Allah yang mengurus mereka dengan nikmat-nikmat-Nya dan agar mereka takut kepada-Nya serta tidak menyelisihi agama-Nya. Dialah yang mengadakan mereka yang sebelumnya tidak ada, Dia pula yang mengadakan orang-orang sebelum mereka. Ayat \"agar kamu bertakwa\" bisa maksudnya bahwa jika kita beribadah kepada Allah saja, berarti kita telah menjaga diri dari kemurkaan dan siksa-Nya, bisa juga maksudnya bahwa jika kita beribadah kepada Allah, kita dapat menjadi orang-orang yang bertakwa. Kedua maksud tersebut adalah benar, oleh karena itu barangsiapa yang beribadah kepada Allah Ta'ala secara sempurna maka ia tergolong sebagai orang-orang yang bertakwa, dan jika tergolong orang-orang yang bertakwa, maka ia akan memperoleh keselamatan dari azab Allah dan kemurkaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 21",
    "description": "Setelah menjelaskan tiga golongan manusia dalam menyikapi kebenaran Al-Qur'an, yaitu orang-orang bertakwa, kafir, dan munafik, selanjutnya Allah menyeru kepada manusia secara umum agar beragama secara benar melalui tiga hal: hanya beribadah kepada Allah (ayat 21-22), percaya kepada risalah yang dibawa oleh nabi Muhammad, yakni Al-Qur'an, (ayat 23-24), dan beriman kepada hari kebangkitan (ayat 25). Wahai manusia! sembahlah dan beribadahlah secara tulus kepada tuhanmu sebab dia yang telah menciptakan dan memelihara kamu dan orang-orang yang sebelum kamu dari yang sebelumnya tiada. Dia adalah satu-satunya pencipta segala sesuatu. Perintah beribadah itu ditujukan agar kamu bertakwa dan dapat memelihara diri serta terhindar dari murka dan siksa Allah. Dengan beribadah, berarti kita telah mempersiapkan diri untuk mengagungkan Allah, sehingga jiwa menjadi suci dan tunduk kepada kebenaran. Sesungguhnya dialah yang dengan kekuasaan-Nya menjadikan bumi sebagai hamparan bagimu sehingga layak dan nyaman untuk dihuni, dan menjadikan di atas kamu langit dan benda-benda yang ada padanya sebagai atap, atau sebagai bangunan yang cermat, indah, dan kukuh. Dan dialah yang menurunkan sebagian dari air, yaitu air hujan, dari langit yang menjadi sumber kehidupan. Lalu dia hasilkan dengan air itu sebagian dari buah-buahan sebagai rezeki untukmu. Karena itu janganlah kamu mengadakan tandingan-tandingan bagi Allah yang telah menciptakan sedemikian rupa dan telah memberimu rezeki, padahal kamu dengan fitrah kesucian yang ada dalam diri mengetahui bahwa Allah tidak ada yang menyerupai-Nya, tidak ada sekutu bagi-Nya, dan tidak ada yang memberi rezeki selain-Nya, maka janganlah kamu menyimpang dari fitrah itu."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Alqomah dan mujahid berkata “setiap ayat yang awalnya “يا أيها الناس” maka ayat tersebut diturunkan di Mekah, dan setiap ayat yang diawali dengan kalimat “يا أيها الذين آمنوا” maka ayat tersebut diturunkan di Madinah. Alqurtubi membantah pendapat ini dengan mengatakan bahwa dalam surat Al-Baqoroh dan surat An-Nisa ada ayat yang diawali dengan kalimat “يا أيها الناس” padahal dua surat ini merupakan surat yang diturunkan di Madinah. Adapun pendapat mereka tentang يا أيها الذين آمنوا maka hal itu shohih. ‘Urwah bi az-Zubair berkata, tidak ada satu aturan atau kewajiban pun yang ada dalam alquran kecuali diturunkan di Madinah, dan adapun surat-surat yang menyebutkan tentang kisah-kisah umat terdahulu dan tentang azab nya kecuali diturunkan di Mekah” Dalam ayat ini menyeru dengan kalimat “يا أيها الناس” “wahai manusia”. Para ulama berbeda pendepat mengenai makna kalimat ini menjadi dua pendapat. Pertama, yang Allah seru dalam ayat ini adalah orang-orang kafir yang tidak menyembah-Nya. Hal ini ditunjukan oleh ayat-ayat berikutnya yaitu : وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَى عَبْدِنَا فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ وَادْعُوا شُهَدَاءَكُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ Dan jika kamu (tetap) dalam keraguan tentang Al Quran yang Kami wahyukan kepada hamba Kami (Muhammad), buatlah satu surat (saja) yang semisal Al Quran itu dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang benar (QS. Al-Baqoroh : 23) berdasarkan ayatt di atas Jelaslah bahwa yang dimaksud oleh Allah dalam seruan-Nya adalah orang-orang kafir. Kedua, yang dimaksud dalam seruan Allah pada ayat ini adalah umum untuk seluruh manusia, maka jadilah makna seruannya sebagai perintah mendawamkan ibadah bagi orang-orang mukmin dan perintah untuk memulai ibadah untuk orang-orang kafir. Dan pendapat ini sangat bagus. Allah meyuruh manusia untuk beribadah kepadanya, dan yang dimaksud dengan ibadah dalam ayat ini adalah Tauhid dan berpegang teguh pada syariat agama Allah. Pokok dari ibadah adalah ketundukan dan kepatuhan kepada yang diibadahi. Ibnu tayimiyah mengatakan bahwa ibadah adalah satu nama yang mencakup segala sesuatu yang dicintai Allah dan diridoi-Nya baik ucapan, perbuatan. Baik yang dzohir ataupun yang tersembunyi. Dalam ayat ini juga Allah menegaskan ke-uluhiyahan-Nya sehingga hanya Dia-lah satu-satu yang berhak mendapat penyembahan seluruh makhluk. Selain itu juga Allah mempertegas ke-rububiyahan-Nya, yaitu bahwa Dia-lah yang telah menciptakan seluruh makhluk, tidak ada yang mampu menciptakan sesuatu dari ketidak adaan menjadi ada kecuali Allah ‘azza wa jalla. Dengan demikian jelaslah salah satu alasan kuat kenapa Allah memerintahkan seluruh manusia untuk beribadah kepada-Nya, yaitu karena Dia-lah yang menciptakan mereka dan orang-orang sebelum mereka. Dan tujuan dari penciptaan ini tiada lain adalah penyembahan total dari yang dicipta kepada Sang Pencipta, sebagaimana firman-Nya : وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ Dan aku tidak menciptakan jin dan manusia melainkan supaya mereka mengabdi kepada-Ku. (QS. Adz-Dzariyat : 56) Adapun tujuan pelaksanaan ibadah untuk manusia adalah supaya mereka menjadi orang-orang yang bertaqwa. Maksudnya, dengan melaksanakan ketauhidan dan segala konsekwensinya serta berpegang teguh terhadap syariat-syariat agama, maka akan membuat diri menjadi takut kepada Allah ta’la dan membuat adanya penghalang yang menjaga anatara dirinya dengan neraka Allah. Ketaqwaan adalah sesuatu yang dijadikan sebagai alat ukur kemuliaan manusia di hadapan Allah, semakin kuat manusia melaksanakan perintah Allah dan menjauhi larangan-Nya, maka semakin besar ketakwaannya dan semakin mulia kedudukannya dihadapan Allah ta’ala."
  }
]