[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah menunggu para penentang yang mendustakan lagi kafir itu setelah tegaknya dalil-dalil yang nyata, kecuali Allah datang kepada mereka dengan kedatangan yang sesuai dengan keagungan Nya dalam naungan awan pada hari kiamat, untuk memutus ketetapan antara mereka dengan keputusan yang adil, dan juga datangnya para malaikat. saat itulah Allah memutuskan putusan terhadap perkara di antara mereka. dan kepada Nya lah semua urusan makhluk kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "210. Orang-orang yang mengikuti jejak setan yang menyimpang dari jalan kebenaran itu tidak menunggu apapun kecuali kedatangan Allah kepada mereka kelak pada hari kiamat dengan cara yang sesuai dengan keagungan-Nya, di bawah naungan awan, untuk memberikan keputusan hukum kepada mereka. Sementara para Malaikat datang dan mengelilingi mereka dari segala penjuru. Ketika itulah perintah Allah kepada mereka diputuskan dan diselesaikan. Dan hanya kepada Allah -Subḥānahu- lah seluruh urusan makhluk ini dikembalikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "210. Allah mengancam orang-orang kafir: tidaklah orang-orang kafir itu menunggu setelah datang kepada mereka hujjah yang jelas melainkan menunggu datangnya Allah kepada mereka dalam kehendak-Nya dalam naungan awan, dan datangnya para malaikat yang diperintahkan untuk melaksanakan perintah Allah terhadap mereka. Dan kepada Allah kembali segala urusan hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "210. هَلْ يَنظُرُونَ (Tiada yang mereka nanti-nantikan) Yakni tidaklah orang-orang yang tidak masuk Islam itu menunggu kecuali menunggu Allah datang kepada mereka dengan hisab dan azab. فِى ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلٰٓئِكَةُ (dan malaikat (pada hari kiamat) dalam naungan awan) Yakni malaikat akan datang untuk menunaikan perintah Allah kepada mereka. Makna (الغمام) yakni awan putih yang tipis. وَقُضِىَ الْأَمْرُ ۚ (dan diputuskanlah perkaranya) Yakni itu akan terjadi dan telah diputuskan bahwa mereka akan dibinasakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "210. Tidak ada yang ditunggu orang-orang yang tidak mau masuk Islam itu kecuali Allah mendatangkan mereka untuk dihisab dan diazab, dan kedatangan para malaikat untuk menunaikan perintah Allah dalam naungan awan putih yang tipis dan digunakan untuk membinasakan mereka. Dan hanya kepada Allahlah tempat kembalinya seluruh perkara di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada yang mereka} tidak ada yang ditunggu orang-orang yang tidak mau masuk Islam {kecuali kedatangan Allah dalam naungan dari awan} awan {bersama malaikat dan telah diputuskan} telah selesai {perkara (mereka). Kepada Allahlah segala perkara dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "210. Dalam ayat ini terdapat ancaman yang keras dan peringatan yang membuat hati gentar. Allah berfirman, tiada yang dinanti-nantikan oleh orang-orang yang berbuat kerusakan di muka bumi, dan orang-orang yang mengikuti langkah-langkah setan kecuali orang-orang yang mencampakkan perintah-perintah Allah, kecuali Hari pembalasan segala perbuatan, dimana pada hari itu disisipkan segala hal yang menakutkan, menegangkan, mengerikan,, dan mengguncangkan hati orang-orang zalim, balasan kejelekan atas orang-orang yang merusak. Hal itu karena akan melipat langit dan bumi, bintang-bintang jatuh berserakan, matahari dan bulan tergulung. Para malaikat yang melihat turun dan melingkupi seluruh makhluk, dan pencipta yang mulia lagi Maha Tinggi turun “dalam naungan awan” untuk melerai di antara hamba-hambaNya dengan keputusan yang adil. Lalu diletakkanlah timbangan, di bukalah buku buku catatan, lalu memutih wajah-wajah penghuni surga, dan menghitam wajah-wajah penghuni neraka, dan terjadilah perbedaan yang sangat jelas antara orang-orang yang baik dari orang-orang yang jelek. Setiap orang akan dibalas sesuai dengan perbuatannya, orang dholim akan menggigit jarinya apabila ia mengetahui kondisinya saat itu. Ayat ini dan ayat-ayat yang semisalnya adalah dalil bagaimana ahlussunnah Waljamaah yang menetapkan adanya sifat-sifat ikhtiyariyah (yang tergantung kepada kehendak Allah) seperti Al istiwa (bersemayam), an nuzul (turun), al-maji’ (datang) dan yang semacamnya dari sifat-sifat yang telah Allah kabarkan tentang diriNya atau telah dikabarkan oleh rasulNya tentangNya. Mereka menetapkan semua itu sesuai dengan yang patut bagi keagungan Allah dan kebesaranNya tanpa ada penyerupaan dan tidak pula penyimpangan, berbeda dengan kelompok Mu’aththilah dengan berbagai macam cabangnya seperti jahmiyah, Al mu’tazilah, Al asy’ariyah, dan semisalnya mereka dari kalangan orang-orang yang diadakan sifat-sifat tersebut, dan mentakwilkan ayat-ayat tersebut demi tujuan peniadaan dengan takwil takwil yang tidak ada keterangannya dari Allah, bahkan hakikat takwil itu hanyalah demi mencela penjelasan Allah dan penjelasan rasulNya, dan menganggap bahwa perkataan mereka itu membawa kepada Hidayah dalam masalah ini, akan tetapi mereka itu tidaklah memiliki dalil naqli sedikitpun bahkan tidak pula dalil aqli. Mengenai dalil naqli, mereka telah mengakui bahwa nash-nash yang ada dalam Alquran dan as-sunnah, baik konteks lahirnya atau bahkan kandungan tegasnya, menunjukkan kebenaran apa yang diyakini oleh mazhab ahlussunnah Waljamaah, dan bahwasanya nash-nash itu demi mewujudkan pada mazhab mereka yang batil yang harus dipalingkan dari makna lahirnya, baik ditambah padanya atau dikurangi, hal ini sebagaimana yang anda lihat, tidaklah diridhoi oleh seseorang yang masih memiliki Iman seberat biji sawi sekalipun. Dan mengenai dalil akal, maka tidak ada sesuatupun dalam logika yang menunjukkan peniadaan sifat-sifat tersebut, bahkan akan menunjukkan bahwa pelaku perbuatan adalah lebih sempurna daripada yang tidak mampu melakukan, dan bahwa perbuatan Allah yang berkaitan dengan diriNya dan yang berkaitan dengan penciptaanNya adalah sebuah kesempurnaan, maka apabila mereka mengira bahwa menetapkan sifat-sifat itu akan menjurus kepada penyerupaan kepada makhluk makhlukNya, maka harus dikatakan kepada mereka bahwa perkataan tentang sifat mengikuti perkataan tentang dzat, sebagaimana Allah memiliki dzat yang tidak serupa dengan segala macam dzat-dzat yang lain, maka Allah juga memiliki sifat yang tidak serupa dengan sifat-sifat yang lain. Oleh karena itu sifatNya mengikuti dzatNya dan sifat-sifat makhluk Nya mengikuti dzat-dzat mereka, sehingga tidaklah ada dalam penetapan sifat-sifat itu suatu tindakan penyerupaan denganNya. Hal ini juga dikatakan kepada mereka yang menetapkan hanya sebagian sifat saja dan meniadakan sebagian lainnya, atau mereka yang menetapkan nama-namaNya tanpa sifat-sifatNya; karena pilihannya adalah antara menetapkan semua yang telah Allah tetapkan untuk diriNya, dan ditetapkan oleh rasulNya, atau meniadakan keseluruhannya yang merupakan pengingkaran terhadap robb alam semesta. Adapun penetapan mu terhadap sebagiannya dan penilaianmu terhadap sebagian lain adalah tindakan yang saling bertolak belakang. Coba bedakan antara apa yang kau tetapkan dan apa yang kau tiadakan, niscaya engkau tidak akan mendapatkan perbedaan dalam hal itu, lalu apabila engkau berkata, “apa yang telah saya tetapkan itu tidaklah menyebabkan penyerupaan,” ahlussunnah berkata kepadamu bahwa penetapan terhadap apa yang engkau tiada kan itu tidak menyebabkan penyerupaan, dan bila engkau berkata, “Saya tidak paham dari orang yang saya tiadakan itu kecuali hanyalah penyerupaan,” orang-orang yang meniadakan berkata kepadamu, “dan kami pun tidak paham dari apa yang kau tetapkan itu kecuali hanyalah penyerupaan,” maka apa yang kau jawab untuk orang-orang tersebut adalah apa yang menjadikan jawaban ahlussunnah untuk terhadap apa yang kau tiadakan. Kesimpulannya, bahwa barangsiapa yang meniadakan sesuatu dan menetapkan sesuatu dari apa yang telah ditunjukkan oleh Alquran dan as-sunnah atas penetapannya, maka tindakan itu saling bertolak belakang, yang tidak ada dalil syar’i dan tidak pula akal yang menetapkannya, bahkan menyimpang dari hal yang masuk logika maupun hal yang diriwayatkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { هَلۡ يَنظُرُونَ } Hal yandzuruna : Mereka tidak melihat, kata tanya di sini untuk menafikan. { ظُلَلٖ } Dzulal : Bentuk jamak dari zhullah, yaitu sesuatu yang menaungi seperti awan, atau pepohonan dan yang lain sebagainya. { ٱلۡغَمَامِ } Al-Ghamam : Awan tipis yang berwarna putih. Makna ayat: Adapun ayat (210) mengandung motivasi bagi orang-orang yang lambat untuk masuk ke dalam agama Islam, sebab mereka tidak memiliki udzur bukti dan petunjuk telah ada di hadapan mereka. Firman Allah,”Tiada yang mereka nanti-nantikan melainkan datangnya Allah dan malaikat (pada hari kiamat) dalam naungan awan...” pada saat itulah mereka baru beriman. Akan tetapi keimanan pada saat tersebut sudah tidak bermanfaat, karena mereka harus menerima adzab, karena qodho Allah yang Maha adil. Allah berfirman,”Telah diputuskan perkaranya.” Yaitu apabila Allah Ta’ala telah memutuskan dan semua urusan kembali kepada Nya, maka Dia akan memutuskannya dan selesailah segala sesuatu. Orang-orang yang lambat dan ragu-ragu untuk masuk ke dalam agama Islam yang penuh dengan kedamaian, karena masuk ke dalam Islam merupakan kedamaian yang sejati, sedangkan keluar dari agama Islam atau enggan untuk masuk berarti menyatakan perang. Hendaknya mereka masuk agama Islam. Ingat, masuklah ke dalam Islam wahai hamba-hamba Allah ! karena kedamaian itu lebih baik dibandingkan peperangan. Pelajaran dari ayat: • Penetapan mengenai sifat “datang” bagi Allah, untuk memutuskan perkara pada hari kiamat. • Keharaman menunda-nunda (taswif) serta mengulur-ulur taubat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 210: Kemudian Allah memperingatan mereka yang menolak masuk kedalam agama Allah setelah ditegakkan bagi mereka hujjah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang ditunggu-tunggu oleh para pembuat kerusakan di muka bumi yang mengikuti langkah-langkah setan selain hari pembalasan terhadap amal, di mana hari itu penuh dengan kedahsyatan dan hal-hal yang menegangkan. Ketika itu, Allah Subhaanahu wa Ta'aala melipat langit-langit dan bumi, bintang-bintang jatuh berserakan, matahari dan bulan digulung, para malaikat yang mulia turun lalu mengepung semua makhluk, kemudian Allah Subhaanahu wa Ta'aala turun dalam naungan awan untuk memutuskan perkara hamba-hamba-Nya dengan keputusan yang adil. Lalu disiapkan timbangan, dibuka catatan amal, diputihkan muka orang-orang yang berbahagia dan dihitamkan muka orang-orang yang celaka serta dibedakan antara orang-orang yang baik dengan orang-orang yang buruk. Semuanya dibalas sesuai amal yang dikerjakan, saat itulah orang yang zhalim menggigit jari-jemarinya setelah mengetahui keadaan yang sebenarnya. Ayat di atas dan semisalnya adalah dalil bagi Ahlussunnah wal Jama'ah yang menetapkan sifat ikhtiyariyyah (pilihan) bagi Allah Subhaanahu wa Ta'aala, seperti istiwa' (bersemayam), turun, datang dan sifat-sifat lainnya yang diberitakan oleh Allah Ta'ala atau diberitakan oleh Rasul-Nya shallallahu 'alaihi wa sallam. Ahlussunnah menetapkan semua itu sesuai dengan kebesaran Allah dan keagungan-Nya tanpa menyerupakan sifat itu dengan sifat makhluk atau pun menta'wilnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 210",
    "description": "Tidak ada yang mereka, yakni para pemaksiat dan orang yang tidak melaksanakan islam secara utuh, tunggu-tunggu kecuali datangnya azab Allah bersama malaikat dalam naungan awan kepada mereka, sedangkan perkara mereka, yakni ditimpakannya siksa atas mereka di hari kiamat, telah diputuskan. Dan kepada Allah-lah segala perkara dikembalikan. Tanyakanlah kepada bani israil, yakni yahudi madinah, berapa banyak bukti nyata yang telah kami berikan kepada mereka. Banyak sekali nikmat yang Allah berikan kepada nenek moyang mereka, seperti terbelahnya lautan, terangkatnya bukit tur di atas kepala mereka, dan diturunkannya manna dan salwa'. Barang siapa menukar nikmat Allah, yakni meng-ingkari nikmat atau petunjuk Allah dan menukarnya dengan kekufuran, setelah nikmat itu datang kepadanya, maka sungguh, Allah sangat keras hukuman-Nya."
  }
]