[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tanyakanlahlah (wahai Rasul) kepada Bani Israil yang menantang mu, “Berapa banyak sudah Kami berikan kepada mereka bukti-bukti nyata di dalam kitab-kitab Suci mereka yang menuntun mereka kepada kebenaran, tapi mereka mengingkari semuanya, dan berpaling darinya, serta mengubah-ubahnya dari tempat-tempatnya yang semestinya. dan barangsiapa mengubah-ubah nikmat Allah (yaitu agama Nya) dan mengingkarinya setelah mengetahuinya dan tegaknya hujjah di hadapannya dengan itu, maka sesungguhnya Allah amat pedih siksaan Nya kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "211. Bertanyalah -wahai Nabi- kepada Bani Israil dengan pertanyaan sebagai teguran kepada mereka, “Berapa banyak Allah telah menjelaskan kepada kalian melalui ayat yang jelas-jelas menunjukkan kebenaran para Rasul, kemudian kalian mendustakannya dan berpaling darinya?!” Siapa menukar nikmat Allah dengan kekafiran dan pendustaan setelah nikmat itu diketahuinya dengan jelas, maka sesungguhnya Allah itu Mahaberat hukumannya bagi orang-orang yang kafir lagi mendustakan ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "211. Allah mengolok-olok Bani Israil yang hidup di zaman Nabi Muhammad. Allah memerintahkan Nabi untuk bertanya kepada para keturunan Nabi Ya’qub itu: Berapa banyak Kami kirimkan kepada mereka mukjizat yang jelas yang dapat menunjukkan kepada mereka kebenaran. Namun mereka mengingkari dan mengubah mukjizat itu. Padahal barangsiapa yang mengingkari kebenaran dan mengubahnya setelah ia mengetahui, sungguh Allah akan menyiksanya dengan siksaan yang berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "211. سَلْ بَنِىٓ إِسْرٰٓءِيل (Tanyakanlah kepada Bani Israil) Yakni tanyakanlah Hai Muhammad, dan tanyakanlah Wahai orang-orang beriman kepada Bani Israil tentang ayat-ayat yang telah Kami datangkan kepada mereka; dan bagaimana mereka disiksa dengan siksaan yang pedih ketika mereka membalas kenikmatan Allah dengan kekafiran. Maka demikianlah yang akan terjadi pada orang yang telah diseur untuk memeluk Islam secara total, namun mereka enggan dan ingkar terhadap ayat-ayat Allah. مِّنْ ءَايَةٍۭ بَيِّنَةٍ (tanda-tanda (kebenaran) yang nyata) Yakni bukti-bukti yang didatangkan oleh para nabi mereka. نِعْمَةَ اللَّـه (nikmat Allah) Yakni petunjuk dan agama-Nya. فَإِنَّ اللَّـهَ شَدِيدُ الْعِقَابِ (maka sesungguhnya Allah sangat keras siksa-Nya) Yakni yang didalamnya terdapat ketakutan yang tak terukur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "211. Wahai Muhammad, tanyakanlah kepada Bani Israil banyak hal tentang bukti-bukti nabi mereka yang menunjukkan tentang kebenaran mereka dan dirimu. Mereka telah mengganti bukti-bukti itu. Barangsiapa mengganti hidayah dan agama Allah dengan kekufuran dan penyimpangan, maka sesungguhnya Allah itu Maha dahsyat hukumanNya bagi orang yang menentang perintahNya, dan menyalahi syariat dan para nabiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tanyakanlah kepada Bani Israil,“Berapa banyak bukti nyata} jelas {yang telah Kami anugerahkan kepada mereka” Siapa saja yang menukar} mengganti {nikmat Allah setelah apa yang datang kepadanya, sesungguhnya Allah Maha keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "211. Allah berfirman, “tanyakanlah kepada Bani Israil, ‘berapa banyaknya tanda-tanda (kebenaran) yang nyata, yang telah Kami berikan kepada mereka’,” yang menunjukkan kepada Al Haq dan kebenaran para rasul, kemudian mereka meyakini dan mengetahuinya. Namun mereka tidak mensyukuri nikmat tersebut yang seharusnya patut untuk disyukuri, Bahkan mereka mengingkarinya dan mengganti nikmat Allah dengan kekufuran. Oleh karena itu mereka berhak untuk mendapatkan hukuman dari Allah dan mengharamkan mereka dari pahalaNya. Dan Allah menyebut ingkar terhadap nikmatNya adalah sebagai bentuk penggantian nikmat Allah dengan kekufuran, karena barangsiapa yang telah Allah berikan kenikmatan agama atau dunia kepadaNya, lalu dia tidak mensyukurinya dan tidak menunaikan kewajibannya, maka akan hilanglah darinya, dan berganti kekufuran dan kemaksiatan, akhirnya kekufuran itu menjadi pengganti nikmat. Adapun orang yang bersyukur kepada Allah dan menunaikan kewajiban kewajibannya, maka nikmat itu akan senantiasa tetap dan berkesinambungan, bahkan Allah akan menambahkan kenikmatan itu baginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { سَلۡ } Sal : Berasal dari kata Is’al (إسأل) Tanyakanlah, dihilangkan dua hamzah untuk meringankan pengucapan. { بَنِيٓ إِسۡرَٰٓءِيلَ } Bani Israil : Anak keturunan Ya’qub bin Ishaq bin Ibrohim. Isra’il merupakan julukan bagi Ya’qub. { ءَايَةِۢ } Aayah : Hal yang luar biasa diluar batas kewajaran, seperti tongkat Nabi Musa menunjukkan bahwa orang yang diberikan karunia berupa ayat-ayat (tanda-tanda) merupakan utusan Allah yang sebenarnya. Tanda-tanda yang dianugerahkan oleh Allah kepada bani Israil di antaranya terbelahnya lautan untuk mereka, dan diturunkannya Manna dan Salwa ketika mereka tersesat di Tiih. { نِعۡمَةَ ٱللَّهِ } Ni’matallahi : Pemberian Allah Ta’ala kepada hamba Nya berupa kebaikan yang membuat mereka senang dan bahagia, dan menghilangkan madharat. Nikmat Allah amatlah banyak. Makna ayat: Allah Ta’ala memerintahkan rasul Nya untuk bertanya kepada bani Israil mengenai ayat-ayat (tanda-tanda) yang banyak diberikan oleh Allah, dan bagaimana bisa mereka menjadi kafir dan semua nikmat itu tidak bermanfaat kepada mereka sedikitpun. Maksudnya adalah untuk menghibur Rasulullah ﷺ dari rasa kecewa disebabkan kebanyakan ahli kitab dan kaum musyrikin tidak mau beriman terhadap pentunjuk yang dibawanya. Ayat ini juga mengandung teguran dan celaan terhadap orang-orang Yahudi karena kekufuran mereka terhadap ayat-ayat Allah, dan terus menerus mereka di atas kekufuran dan tidak mau masuk ke dalam agama Islam. Kemudian Allah Ta’ala mengabarkan bahwa siapa yang mengganti kenikmatan Allah yaitu agama Islam dengan mengingkarinya dan mengingkari nabi Muhammad ﷺ maka Allah Ta’ala akan menurunkan hukuman Nya kepada mereka tanpa bisa dihalangi baik di dunia maupun di akhirat. Karena Allah amat keras siksaan Nya. Pelajaran dari ayat: • Peringatan agar tidak terjatuh dalam kufur nikmat, karena mengakibatkan siksa yang pedih. Di antara nikmat yang paling mulia adalah nikmat Islam. Barangsiapa kafir terhadap agama Islam dan berpaling darinya akan menghadapi azab yang paling keras dan siksa yang paling dahsyat. Berbagai macam kehinaan dan kenistaan yang menimpa Bani Israil dalam waktu yang cukup lama, merupakan bukti kuat akan hal itu. Begitu juga menjadi bukti yang nyata apa yang terjadi kepada kaum muslimin tatkala mereka menyimpang dari agama Islam dan menggantinya dengan khurafat dan hukum-hukum buatan manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 211: Allah memerintahkan nabiNya ﷺ agar bertanya kepada bani israil: berapa banyak Allah memberikan petunjuk dan bukti yang nyata? yang kemudian mereka mendustakan dan menolak serta mengganti dan tidak bersyukur dengan nikmat Allah atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ayat-ayat yang jelas di kitab-kitab mereka yang menunjukkan mereka kepada kebenaran. Namun ayat-ayat itu mereka ingkari, bahkan mereka sempat merubahnya. Demikian juga ayat-ayat yang berupa mukjizat sekaligus sebagai nikmat, seperti terbelahnya lautan sehingga mereka berhasil lolos dari kejaran bala tentara Fir'aun, diturunkannya Al Mann dan As Salwa dsb. lalu mereka merubah nikmat itu dengan bersikap kufur. Yang dimaksud dengan nikmat Allah di sini ialah perintah-perintah dan ajaran-ajaran Allah atau petunjuk-Nya. Orang yang mendapatkan nikmat, baik berupa nikmat agama maupun dunia, namun tidak mensyukurinya, maka Allah Subhaanahu wa Ta'aala bisa segera menyiksanya, baik dengan mencabut nikmat itu atau memberikan siksaan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 211",
    "description": "Tanyakanlah kepada bani israil, yakni yahudi madinah, berapa banyak bukti nyata yang telah kami berikan kepada mereka. Banyak sekali nikmat yang Allah berikan kepada nenek moyang mereka, seperti terbelahnya lautan, terangkatnya bukit tur di atas kepala mereka, dan diturunkannya manna dan salwa'. Barang siapa menukar nikmat Allah, yakni meng-ingkari nikmat atau petunjuk Allah dan menukarnya dengan kekufuran, setelah nikmat itu datang kepadanya, maka sungguh, Allah sangat keras hukuman-Nya kehidupan dunia dijadikan oleh Allah terasa indah dalam pandangan orang-orang yang kafir mekah. Mereka sangat mencintai dunia dan berlomba-lomba mencari kesenangan dunia sehingga lupa kepada akhirat, dan mereka terus-menerus menghina orang-orang yang beriman, seperti bila'l, suwahaib, dan lainnya karena kefakiran mereka. Mereka terus saja berbuat demikian padahal orang-orang yang bertakwa itu berada di atas mereka pada hari kiamat. Mereka berada di surga sedangkan orang kafir itu berada di neraka. Dan Allah memberi rezeki baik di dunia maupun akhirat kepada orang yang dia kehendaki tanpa perhitungan."
  }
]