[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dijadikan indah dalam pandangan orang-orang yang mengingkari keesaan Allah akan kehidupan dunia dan semua jenis kesenangan dan kenikmatannya, dan mereka itu mengolok-olok kaum Mukminin. Dan adapun mereka yang takut kepada Tuhan mereka akan berada di tempat yang lebih tinggi di atas semua orang kafir pada hari kiamat. dimana Allah memasukkan mereka ke tingkatan surga paling tinggi, dan menempatkan orang-orang kafir di neraka paling bawah. dan Allah memberikan rezeki kepada siapa saja diantara makhluk Nya yang Dia kehendaki tanpa batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "212. Kehidupan dunia, kesenangan semu serta kenikmatan sementara yang ada di dalamnya, semuanya dijadikan bagus dalam pandangan orang-orang yang ingkar kepada Allah. Dan mereka mengejek orang-orang yang beriman kepada Allah dan hari Akhir. Padahal orang-orang yang bertakwa kepada Allah dengan cara menjalankan perintah-perintah-Nya dan meninggalkan larangan-larangan-Nya kelak berada di atas orang-orang kafir itu di akhirat. karena Allah akan menempatkan orang-orang yang bertakwa itu di dalam surga Aden. Dan Allah memberi kepada siapa saja yang Dia kehendaki di antara makhluk-Nya dengan pemberian yang tidak terhitung dan tidak terhingga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "212. Dijadikan syahwat dunia sebagai penyejuk mata bagi orang-orang yang mendustakan Allah dan rasul-Nya. Mereka selalu mengolok-olok orang-orang beriman. Adapun orang-orang yang takut kepada Allah akan berada di atas orang-orang yang kafir pada hari kiamat kelak, sebab mereka berada pada derajat yang tinggi di surga. Mereka akan menertawakan orang-orang kafir yang akan tinggal di kerak neraka selamanya. Allah memberi rezeki yang luas bagi hamba-Nya yang Dia kehendaki dengan rezeki tanpa batas. Ibnu ‘Asyur berkata: “Dalam ayat ini tidak disebutkan hal yang menyebabkan syahwat dunia menjadi indah bagi orang-orang kafir karena banyak sekali penyebabnya; diantaranya terdapat hal-hal yang diciptakan dengan bentuk yang indah, dan hati mereka dibuat condong untuk menyukainya padahal sebenarnya itu bukanlah hal yang baik, seperti perbuatan membunuh orang, dsb.” “Sedangkan firman Allah {فهدى الله الذين ءامنوا} berhubungan dengan ayat {زين للذين كفروا الحياة الدنيا...} keadaan mereka ini lebih parah dari sebelumnya karena masuk dalam keangkuhan dan kesombongan, sebab mereka tidak hanya tertipu dengan keindahan dunia yang menjadikan mereka mengolok orang-orang beriman yang tidak menapaki jalan hidup mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "212. زُيِّنَ لِلَّذِينَ كَفَرُوا۟ الْحَيَوٰةُ الدُّنْيَا Kehidupan dunia dijadikan indah dalam pandangan orang-orang kafir) Yakni orang kafir terfitnah dengan keindahan ini dan berpaling dari akhirat. Adapun orang muslim tidak terfitnah dengan hal ini bahkan menyambut akhirat. وَيَسْخَرُونَ مِنَ الَّذِينَ ءَامَنُوا۟ (dan mereka memandang hina orang-orang yang beriman) Yakni karena mereka adalah orang-orang yang miskin, dan harta mereka tidak sebanyak harta para pemimpin kekufuran dan para pembesar kesesatan yang menganggap orang yang bahagia dan beruntung adalah orang yang memiliki gemerlapnya dunia, dan orang yang menderita dan merugi adalah yang tidak memilikinya. Dan sebagian besar orang-orang mukmin pada waktu itu adalah orang-orang miskin. وَالَّذِينَ اتَّقَوْا۟ فَوْقَهُمْ يَوْمَ الْقِيٰمَةِ ۗ (Padahal orang-orang yang bertakwa itu lebih mulia daripada mereka di hari kiamat) Karena mereka berada dalam surga sedangkan orang-orang kafir berada di dalam neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang 'alim berkata : sesungguhnya apa yang ada pada diri orang-orang kafir dan munafiq dari sifat-sifat buruk tidak kecuali disebabkan oleh kekalahan mereka atas gemerlap dunia, dan keberpalingan mereka dari kebenaran islam, karena dunia telah menghiasi kehidupan diri mereka, amatilah firman Allah : { زُيِّنَ لِلَّذِينَ كَفَرُوا الْحَيَاةُ الدُّنْيَا وَيَسْخَرُونَ مِنَ الَّذِينَ آمَنُوا ۘ وَالَّذِينَ اتَّقَوْا فَوْقَهُمْ يَوْمَ الْقِيَامَةِ ۗ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "212. Dunia dipercantik untuk orang-orang kafir dan orang-orang musyrik sehingga mereka tergoda dengan hiasan ini lalu berpaling dari akhirat, berbanding terbalik dengan orang muslim. Mereka (Orang kafir dan musyrik) mengejek orang-orang mukmin karena kefakiran mereka dan perhatian mereka terhadap akhirat. Orang-orang mukmin yang bertakwa kepada Tuhannya, diantaranya yaitu yang fakir memiliki derajat dan maqam lebih tinggi di sisi Tuhannya pada hari kiamat, karena mereka itu di surga, dan orang-orang kafir di neraka. Allah melimpahkan rejeki yang luas kepada orang-orang yang berhak tanpa hisab, yaitu tanpa ada takaran atau batasannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dihiasi} diperindah {Kehidupan dunia ini bagi orang-orang kafir dan mereka menghina orang-orang yang beriman. Padahal orang-orang yang bertakwa itu berada di atas mereka pada hari Kiamat. Allah memberi rezeki kepada orang yang Dia kehendaki tanpa perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "212. Allah mengabarkan bahwa orang-orang yang kafir kepada Allah, ayat-ayatNya dan rasul-rasulNya, dan mereka tidak tunduk kepada syariatNya, mereka telah dihiasi dengan dunia, hingga nampak indah pada mata dan hati mereka dan mereka rela terhadapnya dan tenang di sisinya, sehingga seluruh keinginan, kehendak, dan perbuatan mereka adalah untuk mendapatkannya, mereka mencarinya, dan berjuang dalam merengkuhnya. Mereka mengagungkannya dan mengagungkan orang yang bersekutu dengan mereka dalam perbuatan-perbuatan mereka, dan mereka menghina kaum mukminin dan mengejek mereka seraya berkata, “Apakah mereka itu yang Allah berikan karunia atas mereka diantara kami?” Hal ini disebabkan lemahnya akal dan pemikiran mereka yang kerdil, karena sesungguhnya dunia itu adalah negeri ujian dan cobaan, di mana orang-orang yang beriman dan orang-orang yang kafir akan memperoleh kesengsaraan, akan tetapi orang mukmin di dunia itu apabila tertimpa musibah, niscaya dia akan bersabar dan mengharap pahala, hingga Allah meringankan hal itu baginya karena keimanan dan kesabarannya yang tidak terdapat pada selainnya. Namun kondisi yang sebenar-benarnya dan pengutamaan yang hakiki adalah pada negeri yang kekal. Oleh karena itu Allah berfirman, “padahal orang-orang yang bertakwa itu lebih mulia daripada mereka di hari kiamat,” orang yang bertakwa berada pada derajat yang tertinggi seraya menikmati berbagai macam kenikmatan, kebahagiaan, kesenangan, kegirangan, dan kegembiraan; sedangkan kaum kafir berada di bawah mereka pada serendah-rendahnya tingkatan, seraya mendapatkan siksaan dengan segala macam siksaan, penghinaan, kesengsaraan yang abadi yang tidak ada ujungnya. Ayat ini adalah hiburan bagi kaum mukminin dan kemalangan bagi kaum kafir. Ketika rizki di dunia dan akhirat tidaklah diperoleh kecuali dengan ketentuan Allah dan tidak akan pernah didapatkan kecuali dengan kehendak Allah, maka Allah berfirman, “Dan Allah memberi rezeki kepada orang-orang yang dikehendaki-nya tanpa batas.” Rizki duniawi diperoleh oleh orang mukmin maupun orang kafir, adapun rizki hati seperti ilmu, Iman, kecintaan kepada Allah, takut kepadaNya, mengharapkanNya, dan semacamnya, maka tidaklah diberikan kecuali kepada orang-orang yang cinta Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَيَسۡخَرُونَ } Yaskharun : Merendahkan dan mengolok-olok. Makna ayat: Pada ayat (212) Allah Ta’ala mengabarkan bahwa setan berusaha untuk menghiasi kehidupan dunia bagi orang-orang yang kafir kepada Allah, rasul Nya, dan syariat Nya. Sehingga mereka berssemangat untuk mencarinya dan bekerja hanya demi dunia, pada akhirnya mereka tidak bisaa melihat hal yang lain. Oleh karena itu mereka mencemooh kaum mukminin dan orang-orang yang zuhud terhadap dunia karena mengetahui dunia akan hilang dan sedikit manfaatnya. Sehingga mereka tidak mengerahkan seluruh upayanya untuk mengumpulkan dan menumpuk harta duniawi. Akan tetapi mereka lebih memilih untuk taat kepada Rabbnya dan menginfakkan harta yang dimilikinya di jalan Allah untuk mencari keridhaan Nya. Lantas Allah Ta’ala mengabarkan bahwa kaum mukminin yang bertakwa akan dibalas pada hari kiamat nanti dengan kebaikan yang banyak dan akan dicukupi, serta diberikan tempat tinggal di surga negeri kedamaian di ‘Illiyin. Allah juga akan membalas musuh-musuh Nya yang mengolok-olok serta merendahkan kaum mukminin, menempatkan mereka di tempat terbawah yaitu neraka. Dialah Allah Ta’ala yang memiliki keutamaan dan kebaikan. Apabila memberikan rezeki maka tidak terhitung jumlahnya karena Dia maha luas keutamaan Nya dan Maha Agung kekuasaan Nya. Pelajaran dari ayat: • Peringatan agar menghindari perhiasan dunia dan tamak untuk mencarinya, serta berlomba-lomba mengumpulkannya, serta melupakan negeri akhirat dan meninggalkan beramal. Karena anak-anak dunia pada hari ini berbangga di hadapan anak-anak akhirat. Namun, anak-anak akhhirat merekalah orang-orang yang beriman dan bertakwa, sehingga pada hari kiamat nanti derajatnya lebih tinggi dan berada di surga yang tertinggi, berbeda dengan musuh-musuhnya yang berada di neraka paling bawah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 212: Allah mengabarkan bahwasannya mereka yang menolak agama Allah dihiasi oleh kehidupan dunia maka ia mencintainya dan mengutamakan atas akhirat ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dijadikan nampak indah kehidupan dunia bagi orang-orang yang kafir baik di mata mereka maupun di hati, sehingga mereka merasa tenteram dan puas dengan kehidupan yang sebentar ini. Oleh karena itu, niat, harapan dan hawa nafsu mereka tertuju kepada dunia. Hal ini merupakan bukti lemahnya akal mereka dan terbatasnya pandangan mereka, padahal dunia adalah tempat ujian dan cobaan, tempat yang penuh penderitaan, kerja keras dan terkadang kekecewaan. Adapun seorang mukmin, meskipun ia tertimpa musibah, ia bisa bersabar dan mengharap pahala dari Allah sehingga dengan iman dan kesabarannya, Allah Subhaanahu wa Ta'aala meringankan bebannya. Bahkan sebenarnya keunggulan hakiki adalah di akhirat. Allah Subhaanahu wa Ta'aala akan memasukkan orang-orang yang beriman ke dalam surga yang berada tinggi di atas orang-orang kafir. Sedangkan orang-orang kafir akan Allah tempatkan di neraka yang letaknya jauh ke bawah. Dalam ayat ini terdapat hiburan bagi kaum mukmin dan musibah bagi kaum kafir. Rezeki duniawi diberikan baik kepada orang mukmin maupun orang kafir, adapun rezeki bagi hati yang berupa ilmu dan iman, rasa cinta kepada Allah, takut dan berharap kepada-Nya dsb. Maka tidaklah diberikan kecuali kepada orang yang dicintai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 212",
    "description": "Kehidupan dunia dijadikan oleh Allah terasa indah dalam pandangan orang-orang yang kafir mekah. Mereka sangat mencintai dunia dan berlomba-lomba mencari kesenangan dunia sehingga lupa kepada akhirat, dan mereka terus-menerus menghina orang-orang yang beriman, seperti bila'l, suwahaib, dan lainnya karena kefakiran mereka. Mereka terus saja berbuat demikian padahal orang-orang yang bertakwa itu berada di atas mereka pada hari kiamat. Mereka berada di surga sedangkan orang kafir itu berada di neraka. Dan Allah memberi rezeki baik di dunia maupun akhirat kepada orang yang dia kehendaki tanpa perhitungan manusia itu dahulunya satu umat; semuanya beriman kepada Allah, kemudian mereka berselisih, ada yang beriman dan ada yang kafir kepada Allah. Bisa juga dipahami bahwa manusia itu satu umat dalam arti kehidupan manusia diikat oleh kesatuan sosial yang satu dengan lainnya saling membutuhkan. Lalu Allah mengutus para nabi untuk menyampaikan kabar gembira kepada orang yang beriman bahwa mereka akan masuk surga dan peringatan kepada orang kafir bahwa mereka akan masuk neraka. Dan diturunkan-Nya bersama mereka kitab yang mengandung kebenaran di dalam hukum-hukumnya untuk memberi keputusan yang benar dan adil di antara manusia tentang perkara yang mereka perselisihkan, yaitu perkara-perkara agama pada umumnya. Dan mereka yang berselisih tentang perkara-perkara itu tidak lain hanyalah orang-orang yang telah diberi kitab. Mereka berselisih setelah bukti-bukti yang nyata berupa penjelasan-penjelasan sampai kepada mereka, karena kedengkian di antara mereka sendiri, yakni kedengkian orang-orang kafir kepada orang-orang beriman. Maka dengan kehendak-Nya, Allah memberi petunjuk kepada mereka yang beriman tentang kebenaran perkara-perkara yang mereka perselisihkan. Allah memberi petunjuk kepada siapa yang dia kehendaki ke jalan yang lurus."
  }
]