[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada mulanya manusia itu merupakan umat yang satu, sepakat ( bersatu ) di atas keimanan kepada Allah, kemudian mereka berselisih tentang agama mereka. Mengapa Allah mengutus nabi nabi sebagai penyeru penyeru kepada agama Allah, memberikan kabar gembira kepada orang yang menaati Allah dengan surga, dan memperingatkan manusia yang kafir kepada Nya dan bermaksiat kepada Nya dengan neraka, dan menurunkan bersama mereka kitab-kitab dari langit yang membawa kebenaran yang dikandung oleh kitab-kitab itu, agar mereka memutuskan perkara berdasarkan kandungan-kandungannya diantara manusia dalam hal-hal yang mereka perselisihkan. Dan tidak ada yang memperdebatkan tentang ( kebenaran kerasulan ) Muhammad dan kitab yang dibawanya secara zalim dan dorongan kedengkian, kecuali orang-orang yang telah Allah berikan Kitab Taurat, dan mereka mengetahui kandungan hujjah hujjah dan hukum-hukumnya. maka, dengan kemurahannya, Allah memberikan Taufik kepada kaum mukminin untuk dapat membedakan antara kebenaran dan kebatilan, dan mengetahui kebenaran dalam perkara yang mereka perselisihkan. Allah memberikan Taufik kepada hamba-hamba Nya yang Dia kehendaki menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "213. Dahulu kala manusia adalah satu umat yang bersepakat di atas jalan yang benar, yaitu agama bapak moyang mereka, Adam, sampai mereka disesatkan oleh setan. Maka mereka pun berbeda-beda; ada yang mukmin dan ada yang kafir. Oleh sebab itulah Allah mengutus para Rasul untuk menyampaikan kabar gembira kepada orang-orang yang beriman dan taat dengan adanya kasih sayang yang Allah janjikan untuk mereka, dan menyampaikan peringatan kepada orang-orang kafir dengan ancaman berupa siksaan yang pedih untuk mereka. Dan bersama para Rasul itu Allah menurunkan kitab-kitab suci yang berisi kebenaran yang tidak diragukan keotentikannya, supaya para Rasul itu memberikan keputusan hukum pada manusia terkait masalah yang mereka perselisihkan. Dan tidak ada yang berselisih paham tentang Taurat itu kecuali orang-orang Yahudi yang diberi pengetahuan tentang isinya setelah datang kepada mereka hujjah-hujjah dari Allah bahwa kitab itu benar dari Allah yang tidak mungkin mereka perselisihkan, (namun mereka tetap berselisih) akibat kezaliman dari mereka. Maka Allah membimbing orang-orang mukmin untuk membedakan kebenaran dan kesesatan dengan izin dan kehendak-Nya. Dan Allah menunjukkan siapa saja yang Dia kehendaki ke jalan lurus yang tidak ada kebengkokan sedikitpun, yaitu jalan iman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "213. Dahulu manusia dari zaman nabi Adam sampai zaman nabi Nuh beriman kepada Allah, kemudian sebagian mereka mulai berselisih. Maka Allah mengutus para nabi untuk memberi petunjuk bagi manusia, memberi kabar gembira bagi orang-orang beriman dan memperingatkan orang-orang kafir dari neraka. Allah juga menurunkan kitab-kitab samawi kepada para nabi tersebut yang berisi kebenaran sesungguhnya, agar mereka dapat memberi keputusan kepada apa yang diperselisihkan manusia. Dan tidaklah berselisih perihal kitab-kitab samawi kecuali orang-orang Yahudi dan Nasrani yang diberikan kepada mereka kitab Taurat dan Injil yang terdapat di dalamnya bukti-bukti jelas tentang kebenaran kenabian Muhammad. Dan perselisihan ini hanya karena sifat zalim dan kedengkian mereka. Sedangkan orang-orang beriman diberi taufik oleh Allah dengan keutamaan-Nya untuk dapat membedakan antara kebenaran dan kebatilan. Allah memberi taufik kepada hamba-Nya yang Dia kehendaki menuju jalan yang lurus. Imam at-Thabari dan al-Hakim mengeluarkan hadits dengan sanad yang shahih dari Ibnu Abbas: “Antara zaman Nuh dengan Adam adalah sepuluh abad. Semua manusia pada zaman ini hidup sesuai syariat Allah, kemudian mereka berselisih, maka Allah mengutus para nabi sebagai pemberi kabar gembira dan peringatan.” Dia juga berkata: “Demikian pula dalam qiraat Abdullah: {كان الناس أمة واحدة فاختلفوا} ‘Dahulu manusia dalam satu kalimat, kemudian mereka berselisih’.” (dishahihkan al-Hakim dan disepakati adz-Dzahabi – Mustadrak 2/546, dan Ibnu Katsir menshahihkan sanad hadist ini dalam tafsirnya 1/250) Ibnu ‘Asyur berkata: “penyebutan Ahli kitab -yang merupakan umat yang mendapat syariat yang paling masyhur pada waktu itu- dalam ayat ini kerena mereka selalu berselisih terhadap apa yang ada dalam kitab mereka. Ini merupakan kehebatan al-Qur’an dalam menggunakan digresi dalam mengolok-olok para Ahli kitab. Dan penggunaan ‘isim mausul’ dalam penyebutan mereka (الذين أوتوه) tersembunyi makna yang dalam; yaitu orang-orang yang berselisih tentang kitab-kitab samawi adalah orang-orang yang kepada mereka sendiri kitab-kitab itu diturunkan, padahal kitab-kitab itu diturunkan untuk menghilangkan perselisihan; maka sebenarnya merekalah yang merupakan sebab perselisihan. (at-Tahrir wa at-Tanwir: 2/292)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "213. كَانَ النَّاسُ أُمَّةً وٰحِدَةً (Manusia itu adalah umat yang satu) Yakni mereka pada awalnya dalam satu agama yaitu Islam ketika zaman antara Nabi Adam dan Nabi Nuh. Pendapat lain mengatakan yang dimaksud adalah Nuh dan orang-orang yang bersamanya diatas kapal. Pada awalnya mereka berada diatas ketauhidan, dan setelah berlalu beberapa masa menyebarlah peribadatan kepada berhala-berhala sehingga manusia terbagi menjadi dua, mukmin dan kafir. فَبَعَثَ اللَّـهُ النَّبِيِّۦنَ (maka Allah mengutus para nabi) Yakni untuk memberi petunjuk kepada manusia. مُبَشِّرِينَ وَمُنذِرِينَ (sebagai pemberi kabar gembira dan peringatan) Yakni kabar gembira bagi ahli iman dan pelaku kebaikan, dan peringatan bagi ahli kufur dan kerusakan. وَأَنزَلَ مَعَهُمُ الْكِتٰبَ (dan Allah menurunkan bersama mereka Kitab) Yakni meliputi seluruh kitab yang diturunkan Allah. لِيَحْكُمَ (untuk memberi keputusan) Yakni agar kitab tersebut menjadi pemberi keputusan. بَيْنَ النَّاسِ فِيمَا اخْتَلَفُوا۟ فِيهِ ۚ (di antara manusia tentang perkara yang mereka perselisihkan) Yakni dalam kitab-kitab samawiyah terdahulu. Dan mereka yang berselisih adalah bani Israil dan para pengikut Nabi Isa. إِلَّا الَّذِينَ أُوتُوهُ (melainkan orang yang telah didatangkan kepada mereka Kitab) Yakni para ahli kitab. بَغْيًۢا بَيْنَهُمْ ۖ (karena dengki antara mereka sendiri) Yakni mereka tidak berselisih melainkan karena kedengkian dan keserakahan mereka terhadap dunia. Padahal seharusnya dengan kitab tersebut menjadi bersatu dan menapaki jalan hidayah. فَهَدَى اللَّـهُ الَّذِينَ ءَامَنُوا۟ لِمَا اخْتَلَفُوا۟ فِيهِ مِنَ الْحَقِّ (Maka Allah memberi petunjuk orang-orang yang beriman kepada kebenaran tentang hal yang mereka perselisihkan) Yakni kemudian Allah memberi petunjuk kepada umat Muhammad menuju kebenaran dengan apa yang dijelaskan kepada mereka di dalam Al-Qur’an dalam hal perselisihan kaum-kaum sebelum mereka. بِإِذْنِهِۦ ۗ (dengan kehendak-Nya) Yakni dengan perintah-Nya. Dari Abu Hurairah dia berkata: Rasulullah bersabda: kita adalah yang terakhir dan yang pertama di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "213. Manusia yang hidup antara Adam dan Nuh itu berada dalam satu agama, lalu mereka saling berselisih. Kemudian Allah mengutus para nabi untuk umat manusia sebagai pemberi kabar gembira tentang surga bagi orang yang taat, dan pemberi peringatan tentang surga bagi orang yang bermaksiat. Allah menurunkan bersama para rasul itu kitab-kitab samawi dengan kandungan kebenaran yang pasti untuk menjelaskan syariat Allah, supaya kitab samawi tersebut menjadi hukum di antara manusia dalam menyelesaikan sesuatu yang mereka perselisihkan terkait perkara agama. Dan tidak ada yang berselisih tentang kitab-kitab samawi itu kecuali orang-orang Yahudi dan Nasrani yang diberi kitab setelah datangnya dalil-dalil yang menunjukkan kebenaran Al-Qur’an dan nabi yang diserahi Al-Qur’an karena dengki dan sangat rakus terhadap dunia atau karena zalim. Allah menunjukkan orang-orang mukmin, yaitu umat Nabi SAW kepada kebenaran tentang sesuatu yang diperdebatkan oleh orang sebelum mereka dengan kehendak, keinginan dan perintahNya. Allah membimbing hamba-hambanya yang dikehendaki menuju jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Manusia itu adalah umat yang satu} manusia itu sebelumnya adalah perkumpulan yang satu yang sepakat dengan agama Islam kemudian mereka berselisih {lalu Allah mengutus para nabi untuk menyampaikan kabar gembira dan peringatan. Allah menurunkan bersama mereka, kitab yang mengandung kebenaran untuk memberi keputusan di antara manusia tentang perkara yang mereka perselisihkan. Tidak ada yang berselisih tentangnya, kecuali orang-orang yang telah diberi kitab} telah diberi kitab {setelah bukti-bukti yang nyata sampai kepada mereka, karena kedengkian di antara mereka sendiri} kezaliman dan kedengkian di antara diri mereka {Maka Allah memberi petunjuk} memberi bimbingan {kepada orang-orang yang beriman tentang kebenaran yang mereka perselisihkan dengan seizinNya. Allah memberi petunjuk kepada siapa yang Dia kehendaki ke jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "213. Maksudnya, mereka bersatu di atas petunjuk, kondisi itu selama 10 abad setelah Nabi Nuh, dan ketika mereka berselisih dalam perkara agama, lalu sekelompok dari mereka kafir, sedangkan sisanya masih tetap di atas petunjuk dan terjadi perselisihan, maka Allah mengutus kembali rasul-rasulNya untuk melalui antara manusia dan menegakkan hujjah atas mereka. Pendapat lain mengatakan, bahwa justru (sebaliknya) dahulu manusia bersatu di atas kekufuran, kesesatan, dan kesengsaraan, mereka tidak memiliki cahaya dan tidak pula keimanan, hingga Allah merahmati mereka dengan mengutus para rasul kepada mereka, “sebagai pemberi kabar gembira” bagi orang-orang yang taat kepada Allah dengan hasil ketaatan mereka seperti Rizki, kekuatan tubuh, kekuatan hati, serta kehidupan yang baik, dan yang paling tinggi dari itu semua adalah kemenangan dengan keridhaan Allah dan surga. “Juga pemberi peringatan” bagi orang yang bermaksiat kepada Allah dengan akibat buruk kemaksiatan mereka seperti menahan rezeki untuk mereka, kelemahan, kehinaan, serta kehidupan yang sempit, dan yang paling besar dari semua itu adalah kemurkaan Allah dan neraka. Allah menurunkan kitab-kitab suci kepada mereka yang membawa kebenaran, yang isinya adalah berita-berita benar dan perintah-perintah yang adil. Segala hal yang dikandung dalam kitab-kitab suci itu adalah suatu kebenaran yang membedakan antara orang-orang yang berselisih dalam pokok-pokok maupun cabang-cabang. Inilah yang wajib dilakukan ketika terjadi perselisihan dan perdebatan yaitu mengembalikan perselisihan itu kepada Allah dan rasulNya. Sekiranya tidak ada di dalam kitabullah dan sunnah rasulNya suatu hal yang mampu melalui perselisihan, niscaya tidak akan diperintahkan untuk kembali kepada keduanya. Dan ketika Allah menyebut nikmatNya yang besar dengan menurunkan kitab kepada ahli kitab, dimana hal ini mengharuskan kesepakatan mereka dengannya dan persatuan mereka, lalu Allah mengabarkan bahwa sebagian mereka telah berlaku zhalim terhadap sebagian yang lain, hingga terjadi pertentangan, perselisihan dan banyak perseteruan, mereka berselisih terhadap kitab itu yang sepatutnya mereka adalah orang yang paling pertama bersatu padanya. Hal itu setelah mereka mengetahui dan meyakini dengan adanya tanda-tanda yang jelas dan dalil-dalil yang kuat, lalu mereka tersesat karenanya dengan kesesatan yang jauh, dan Allah memberikan hidayahNya kepada “orang-orang yang beriman” dari umat ini, “kepada kebenaran tentang hal yang mereka perselisihkan itu.” Setiap perkara yang diperselisihkan oleh ahli kitab dan mereka menyalahi yang hak dan yang benar padanya, Allah memberikan hidayah untuk umat ini kepada yang benar dari padanya “dengan kehendak-Nya,” dan memudahkannya serta merahmati mereka. “Dan Allah selalu memberi petunjuk orang yang dikehendaki-Nya kepada jalan yang lurus.” Seruan kepada jalan yang lurus itu mencakup seluruh manusia sebagai keadilan dariNya dan penegakan hujjah atas manusia agar mereka tidak berkata bahwa tidak ada pemberi kabar gembira dan pemberi peringatan yang diutus kepada kami, dan Allah memberikan hidayahNya dengan anugerah, rahmat, bantuan, dan kasih sayangNya kepada orang-orang yang dikehendakiNya dari hamba-hambaNya. Inilah anugerah dan kebaikanNya, sedangkan yang lainnya adalah keadilan dan kebijaksanaan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { كَانَ ٱلنَّاسُ أُمَّةٗ وَٰحِدَةٗ } Kaanannaasu ummatan wahidatan : Dahulu sebelum terjadinya kesyirikan, mereka adalah umat yang satu di atas keadaan Islam dan Tauhid, yaitu sebelum kaum Nabi Nuh ‘alaihissalam. { ٱلنَّبِيِّ‍ۧنَ } An-Nabbiyyin : Bentuk jamak dari nabi, yang dimaksud adalah para rasul karena setiap nabi adalah rasul, dengan dalil kerasulan mereka tegak di atas pemberian kabar gembira dan peringatan, bersumber dari kitab-kitab Allah yang diturunkan kepada mereka. { ٱلۡكِتَٰبَ } Al-Kitab : kata benda untuk bentuk gender (jenis). Nama untuk seluruh kitab yang berasal dari Allah. { أُوتُوهُ } Uutuhu : Diberikan kepada mereka { ٱلۡبَيِّنَٰتُ } Al-Bayyinaat : Berbagai hujjah dan bukti yang dibawa oleh para rasul kepada manusia, dan mewariskan kepada mereka syariat-syariat, hukum-hukum, dan hidayah secara umum. { بَغۡيَۢا } Baghyan : Al-Baghyu berarti kezhaliman dan hasad. { صِرَٰطٖ مُّسۡتَقِيمٍ } Shiraathin mustaqim : Agama Islam yang mengantarkan pemeluknya untuk mencapai kebahagiaan dan kesempurnaan di dunia dan akhirat. Makna ayat: Allah Ta’ala mengumumkan kepada manusia bahwa dahulu mereka, masa antara Nabi Adam dengan Nabi Nuh, adalah umat yang satu di atas agama Islam, mereka hanya menyembah Allah saja. Sampai ketika setan meniupkan was-was kepada sebagian mereka sehingga mereka menyembah selain Allah Ta’ala. Mereka melakukan kesyirikan dan kesesatan. Maka Allah Ta’ala mengutus Nuh untuk menyampaikan pentunjuk Nya. Mereka berselisih dan terpecah menjadi dua golongan, mukmin dan kafir, muwahhid dan musyrik. Setelah itu terjadilah pergantian kepemimpinan di antara para rasul yang membawa kitab-kitab Allah Ta’ala yang mengandung hukumNya, sebagai pemutus antara perselisihan yang terjadi di antara mereka. Kemudian Allah Ta’ala memberitahukan tentang sunnah Nya yang terjadi di atara manusia. Yaitu mereka akan berselisih mengenai Al-Kitab, maksudnya berselisih mengenai hukum yang dikandungnya berupa syariat-syarait dan hukum-hukum adalah mereka yang pernah diberi Kitab dan telah datang kepada mereka penjelasan-penjelasan. Akan tetapi mereka menyimpan hasad dan cinta kedudukan, serta sudah terlalu nyaman dengan kenikmatan yang didapat sehingga tidak mau menerima penjelasan yang datang dari kitab. Orang-orang Yahudi yang menjadi contoh nyata pada sunnatullah ini. Mereka mendapatkan kitab Taurat yang berisikan hukum Allah Ta’ala, dan telah datang berbagai macam penjelasan dari tangan para nabi dan rasul yang diutus kepada mereka. Kemudian mereka berselisih pada banyak perkara syariat dan hukum, yang disebabkan oleh kezhaliman dan hasad. Hanya Allah Tempat meminta perlindungan. Allah Ta’ala menurunkan hidayah Nya kepada umat Nabi Muhammad ﷺ ketika ahli kitab (Yahudi dan Nasrani) saling berselisih di antara mereka dalam firman Nya : “Maka Allah memberi hidayah kepada orang-orang yang beriman...” yaitu ketika mereka berselisih dan menjauh dari kebenaran maka Allah memberikan petunjuk kepada mereka dengan izinNya, kelembutan, dan taufikNya. Maka bagi Allah segala pujian dan keutamaan. Di antara bentuk kebenaran yang diperselisihkan oleh ahlul kitab sebelum umat Muhammad dan kita mendapat petunjuk kepadanya adalah : 1. Beriman kepada Isa ‘alaihissalam, hamba Allah dan rasul Nya dimana orang-orang Yahudi kafir kepadanya dan mendustakannya, serta menuduhnya bermain sihir dan berusaha untuk membunuhnya. Sedangkan orang-orang Nasrani menyembahnya, menjadikannya Tuhan selain Allah, dan mereka mengatakan bahwa Isa adlaah anak Allah. Maha Tinggi Allah dari memiliki istri dan anak. 2. Hari Jum’at merupakan hari yang paling baik dalam sepekan. Namun umat Yahudi menjadikan hari Sabtu dan umat Nasrani menjadikan hari Ahad. Allah memberikan petunjuk kepada umat Islam untuk menjadikan hari Jum’at sebagai hari raya. 3. Kiblat adalah kiblat bapaknya para nabi yaitu Nabi Ibrahim ‘alaihissalam. Umat Yahudi menghadap ke Baitul Maqdis sedangkan umat Nasrani menghadap ke tempat terbitnya matahari. Maka Allah memberikan petunjuk kepada umat Islam untuk menghadap Baitul ‘atiq (Ka’bah) kiblatnya Nabi Ibrahim. Allah memberikan petunjuk kepada siapa saja yang dikehendaki ke jalan yang lurus. Pelajaran dari ayat: • Pada asalnya orang-orang bertauhid, sedangkan kesyirikan adalah sesuatu yang datang belakangan kepada manusia. • Tugas utama para Rasul adalah memberikan kabar gembira kepada siapa saja yang beriman dan bertakwa, dan peringatan kepada orang-orang yang ingkar dan berbuat maksiat. Terkadang disyariatkan kepada mereka untuk memerangi orang yang memerangi mereka, sebagaimana disyariatkan hal tersebut kepada Rasulullah ﷺ. • Termasuk tanda kerusakan umat dan kehancurannya adalah apabila mereka berselisih dalam kitabnya dan agamanya, sehingga mereka merubah isi kalamullah dan mengotak atik isi syariat Nya karena menginginkan kekuasaan dan mengikuti hawa nafsu serta sikap fanatisme kelompok. Inilah yang dialami oleh umat Islam pada masa sekarang ini dan sebelumnya. Dan ini juga yang menyebabkan hancurnya Bani Israil. • Umat Islam yang hidup berlandaskan Al-Kitab dan sunnah dalam hal aqidah, ibadah, dan hukum adalah umat yang ditegaskan oleh Allah dalam firman Nya: “Maka Allah memberi petunjuk orang-orang yang beriman kepada kebenaran tentang hal yang mereka perselisihkan itu dengan kehendak Nya.” • Hidayah berada di tangan Allah Ta’ala, maka seorang hamba hendaknya selalu meminta hidayah dari Allah. Memintanya terus menerus agar diberikan petunjuk kepada kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 213: Allah mengajarkan bahwasannya manusia bersepakat atas keimanan; dan mereka menjadi satu kelompok dari Adam sampai Nuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalam keadaan sama-sama beriman kepada Allah Subhaanahu wa Ta'aala dan mentauhidkannya, lalu mereka berselisih, sebagian ada yang tetap beriman dan sebagian lagi ada yang berubah menjadi kafir. Terjadi penyimpangan dari tauhid sepuluh kurun setelah Zaman Nabi Adam 'alaihis salam ketika sebagian masyarakat membuat patung orang-orang shalih, sebelumnya tidak disembah, namun setelah generasi tersebut meninggal dan digantikan oleh generasi selanjutnya, maka patung-patung itu disembah. Dalam shahih Bukhari ada satu riwayat dari Ibnu Abbas radhiyallahu 'anhuma yang menjelaskan tentang firman Allah Ta'ala, \"“Dan mereka (kaum Nabi Nuh) berkata : janganlah sekali kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu, dan janganlah sekali-kali kamu meninggalkan (penyembahan) Wadd, Suwa’, Yaghuts, Ya’uq maupun Nasr”( QS. Nuh, 23 ) Ibnu Abbas berkata, “Ini adalah nama orang-orang shalih dari kaum Nabi Nuh, ketika mereka meniggal dunia, setan membisikan kepada kaum mereka agar membuat patung-patung mereka yang telah meninggal di tempat-tempat di mana di situ diadakan pertemuan pertemuan mereka, dan mereka disuruh memberikan nama nama patung tersebut dengan nama-nama mereka (orang-orang shalih), kemudian orang orang tersebut menerima bisikan setan, dan saat itu patung-patung yang mereka buat belum dijadikan sesembahan, baru setelah para pembuat patung itu meninggal, dan ilmu agama dilupakan, mulai saat itulah patung-patung tersebuti disembah”. Ketika keadaan seperti ini, maka Allah Subhaanahu wa Ta'aala mengutus para rasul. Nabi shallallahu 'alaihi wa sallam menyampaikan kabar gembira berupa kehidupan yang baik, rezki yang lapang dan surga kepada orang-orang yang taat kepada Allah dan memberi peringatan dengan kehidupan yang sempit, terhalangnya rezki, kelemahan, kehinaan dan neraka kepada orang-orang yang kafir atau bermaksiat kepada-Nya. Berita yang ada di dalamnya benar dan perintah-perintahnya adalah adil, bahkan semua isinya adalah benar sebagai penyelesai antara orang-orang yang berselisih, baik dalam masalah ushul maupun furu' (cabang). Inilah yang wajib dilakukan ketika terjadi perselisihan, yakni mengembalikan masalah tersebut kepada Allah dan Rasul-Nya, kepada Al Qur'an dan As Sunnah dan tentu kita akan menemukan fashlun nizaa' (keputusannya). Yakni tentang kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam dan kitab yang dibawanya. Syaikh As Sa'diy berkata: \"Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya yang besar dengan diturunkan-Nya kitab kepada ahlul kitab, di mana hal tersebut mengharuskan agar mereka bersatu serta berkumpul di atasnya, Allah Subhaanahu wa Ta'aala memberitahukan bahwa sebagian mereka dengki kepada sebagian yang lain, maka timbullah pertengkaran, permusuhan dan banyaknya perselisihan. Mereka berselisih terhadap kitab yang seharusnya mereka lebih dulu untuk bersatu di atasnya setelah mereka mengetahuinya dan meyakininya berdasarkan ayat-ayat yang jelas dan bukti-buktinya yang pasti, oleh karena itu, akhirnya mereka tersesat dengan kesesatan yang sangat jauh.\" Semua masalah yang diperselisihkan ahlul kitab, Allah memberikan petunjuk yang benarnya kepada umat ini. Allah Subhaanahu wa Ta'aala telah menerangkan yang hak kepada makhluk-Nya sebagai keadilan dan penegakkan hujjah kepada manusia agar tidak ada yang berkata, \"Belum datang kepada kami seorang pemberi kabar gembira dan pemberi peringatan\". Dia juga menunjukkan orang yang dikehendaki-Nya - dengan karunia, rahmat, pertolongan dan kelembutan-Nya – ke jalan yang lurus. Dengan demikian, menerangkan yang hak kepada kelompok manusia yang kafir adalah sebagai keadilan dan hikmah-Nya, sedangkan kepada kelompok manusia yang beriman adalah sebagai bentuk ihsan dan karunia-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 213",
    "description": "Manusia itu dahulunya satu umat; semuanya beriman kepada Allah, kemudian mereka berselisih, ada yang beriman dan ada yang kafir kepada Allah. Bisa juga dipahami bahwa manusia itu satu umat dalam arti kehidupan manusia diikat oleh kesatuan sosial yang satu dengan lainnya saling membutuhkan. Lalu Allah mengutus para nabi untuk menyampaikan kabar gembira kepada orang yang beriman bahwa mereka akan masuk surga dan peringatan kepada orang kafir bahwa mereka akan masuk neraka. Dan diturunkan-Nya bersama mereka kitab yang mengandung kebenaran di dalam hukum-hukumnya untuk memberi keputusan yang benar dan adil di antara manusia tentang perkara yang mereka perselisihkan, yaitu perkara-perkara agama pada umumnya. Dan mereka yang berselisih tentang perkara-perkara itu tidak lain hanyalah orang-orang yang telah diberi kitab. Mereka berselisih setelah bukti-bukti yang nyata berupa penjelasan-penjelasan sampai kepada mereka, karena kedengkian di antara mereka sendiri, yakni kedengkian orang-orang kafir kepada orang-orang beriman. Maka dengan kehendak-Nya, Allah memberi petunjuk kepada mereka yang beriman tentang kebenaran perkara-perkara yang mereka perselisihkan. Allah memberi petunjuk kepada siapa yang dia kehendaki ke jalan yang lurus. Ketika orang-orang mukmin di madinah menderita kemiskinan karena meninggalkan harta benda mereka di mekah dan juga akibat peperangan yang terjadi, Allah bertanya untuk menguji mereka. Apakah kamu mengira bahwa kamu akan masuk surga, padahal belum datang kepadamu cobaan seperti yang dialami orang-orang terdahulu sebelum kamu. Mereka ditimpa kemelaratan dan penderitaan, dan diguncang dengan berbagai cobaan, sehingga rasul dan orang-orang yang beriman bersamanya berkata, kapankah datang pertolongan Allah' ingatlah, sesungguhnya pertolongan Allah itu dekat. Ayat ini memotivasi orang-orang beriman yang sedang menghadapi bermacam kesulitan dan menumbuhkan keyakinan bahwa tidak lama lagi akan datang pertolongan Allah yang membawa mereka menuju kemenangan."
  }
]