[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sahabat-sahabatmu bertanya kepadamu (wahai nabi), tentang apa yang dapat mereka infakkan dari jenis-jenis harta mereka untuk mendekatkan diri kepada Allah, dan kepada siapa mereka menginfakkannya. katakanlah kepada mereka,\" infakkanlah harta apa saja yang tersedia pada diri kalian dari berbagai macam harta yang halal lagi baik. dan jadikanlah infaq kalian teruntuk kedua orang tua, dan orang-orang dekat dari keluarga kalian, kaum kerabat kalian, anak-anak yatim yang meinggal bapaknya sebelum mereka mencapai usia balig, orang orang fakir yang tidak mendapatkan sesuatu untuk mencukupi dan menutupi kebuthan mereka, musafir yang terlilit kebutuhan yang jauh dari keluarga dan hartanya.\" Dan kebaikan apapun yang kalian perbuat, Sesungguhnya Allah Maha Mengetahui nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "215. Sahabat-sahabatmu bertanya kepadamu -wahai Nabi- tentang harta apa yang harus mereka infakkan, dan di mana mereka harus menaruhnya? Katakanlah untuk menjawab pertanyaan mereka, “Harta -yang halal lagi baik- yang kalian infakkan hendaknya diberikan kepada kedua orang tua, karib kerabat terdekat kepada kalian sesuai kebutuhan, anak-anak yatim yang membutuhkan santunan, orang-orang miskin yang tidak punya harta, dan musafir yang jauh dari keluarga dan kampung halamannya.” Kebajikan yang kamu lakukan -wahai orang-orang mukmin- baik sedikit maupun banyak, sesungguhnya Allah Maha Mengetahuinya. Tidak ada sesuatupun yang luput dari pengetahuan-Nya. Dan Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "215. Hai Nabi, para sahabatmu bertanya kepadamu: “Apa yang sebaiknya kami infakkan? Dan kepada siapa kami berinfak?” Maka jawablah mereka: “Infakkanlah harta halal yang dapat kamu infakkan, berikanlah kepada kedua orangtua, kerabat, anak-anak yatim, orang fakir, dan musafir yang kehabisan bekal. Dan Allah Maha Mengetahui kebaikan yang kalian perbuat dan Dia akan membalasnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "215. يَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ ۖ (Mereka bertanya tentang apa yang mereka nafkahkan) Mereka menanyakan apakah yang harus mereka nafkahkan. Maka mereka dijawab dengan penjelasan dan menyebutkan kemana saja mereka seharusnya menafkahkan hartanya, karena nafkah kepada mereka lebih utama untuk ditujukan. وَالْأَقْرَبِينَ وَالْيَتٰمَىٰ وَالْمَسٰكِينِ وَابْنِ السَّبِيلِ ۗ (kaum kerabat, anak-anak yatim, orang-orang miskin dan orang-orang yang sedang dalam perjalanan) Penjelasan potongan ayat ini telah disebutkan pada ayat 177."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "215. Wahai nabi, mereka bertanya kepadamu tentang apa yang seharusnya mereka infakkan? Maka jawablah tentang pemberian yang utama, hal itu untuk menjelaskan orang yang memberi infak, “Maka harta yang hendak kalian infakkan itu, berikanlah kepada kedua orang tua, kerabat, anak yatim, fakir miskin, dan musafir yang berhenti di tengah perjalanannya, Dan kebaikan yang kalian berikan kepada mereka atau orang lain itu, Allah Maha mengetahuinya dan akan membalasnya. Ath-Thabari meriwayatkan dari Ibnu Juraij yang berkata: “Orang-orang mukmin bertanya kepada rasulullah SAW tentang sebaiknya mereka menginfakkan harta mereka dimana, lalu turunlah ayat {Yas’aluunaka maa dzaa yunfiquun…}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang apa yang harus mereka infakkan. Katakanlah, “Apa saja yang kalian infakkan hendaknya dari sesuatu yang baik dan diperuntukkan bagi kedua orang tua, kerabat, anak-anak yatim, orang-orang miskin, dan orang yang dalam perjalanan” Kebaikan yang kalian kerjakan itu sesungguhnya Allah Maha Mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "215. Maksudnya, mereka bertanya kepadamu tentang nafkah, dan ini mencakup pertanyaan tentang apa yang diinfakkan dan siapa yang akan diberikan infaq. Allah menjawab mereka tentang hal itu, maka FirmanNya, “apa saja harta yang kamu nafkahkan,” artinya, harta yang sedikit atau banyak, maka orang yang paling utama menerima harta itu dan yang paling berhak untuk didahulukan serta paling besar hak mereka atas semua doa kedua orang tua yang diwajibkan atasmu berbakti kepadanya dan haram bagimu durhaka kepadanya. Di antara cara berbakti paling agung kepada mereka adalah memberi nafkah kepada keduanya, dan diantara keduanya akan yang paling besar adalah tidak memberi nafkah bagi keduanya. Karena itu, memberi nafkah kepada keduanya adalah wajib atas seorang anak yang berada dalam kondisi lapang. Setelah kedua orang tua adalah sanak saudara menurut tingkatannya, yang terdekat lalu yang lebih dekat menurut kedekatannya dan kebutuhannya; karena memberi nafkah kepada mereka adalah sebuah sedekah dan silaturahim. “Dan anak-anak yatim.” Mereka adalah anak-anak kecil yang tidak memiliki orang yang menafkahi mereka, sehingga mereka adalah orang-orang yang biasanya sangat membutuhkan, mereka tidak mampu mengurusi kemaslahatan diri mereka sendiri dan tidak ada orang yang mencari nafkah untuk mereka. Allah mewasiatkan mereka kepada hamba-hambaNya sebagai kasih sayang dariNya kepada mereka dan kemurahanNya. “Dan orang-orang miskin.” Mereka ini adalah orang-orang yang membutuhkan dan terdesak, serta dililit kekurangan, maka mereka itu diberi nafkah demi menutupi kebutuhan mereka dan mencukupkan mereka. “Dan orang yang berada dalam perjalanan,” yaitu orang asing yang kehabisan bekal di negeri asing, dia diberi pertolongan untuk melanjutkan perjalanannya dengan memberi nafkah agar sampai kepada tujuannya. Setelah Allah menghususkan mereka yang telah disebutkan dalam ayat itu karena kebutuhan mereka yang sangat mendesak, maka Allah menyebutkan secara umum seraya berfirman, “Dan kebaikan apa saja yang kamu buat,” seperti bersedekah terhadap mereka atau selain mereka, bahkan sebagai bentuk ketaatan dan pendekatan diri, karena itu termasuk dalam kategori kebaikan, “maka sesungguhnya Allah Maha Mengetahui nya.” Allah akan membalasnya buat kalian dan menjaganya untuk kalian, sesuai dengan niat dan keikhlasannya, banyak dan sedikitnya nafkah yang diberikan, kebutuhan yang mendesak terhadapnya dan besarnya manfaat dan gunanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مِّنۡ خَيۡرٖ } Min khoirin : Maksudnya adalah harta. Karena harta juga dinamakan dengan al-Khoir { وَٱلۡأَقۡرَبِينَ } Al-Aqrobin : Seperti saudara laki-laki dan saudara perempuan serta anak-anak mereka, begitu juga paman serta bibi dari pihak ayah maupun ibu dan anak-anak mereka. { وَمَا تَفۡعَلُواْ مِنۡ خَيۡرٖ } Wamaa taf’alu min khoirin : Huruf Maa merupakan bentuk syarat (syarthiyyah) dan min sebagai penjelasan. Kebaikan di sini maksudnya adalah seluruh jenis kebaikan. { فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ } Fainnallaha bihi ‘aliim : Kalimat ini merupakan jawaban dari syarat yang dibuang, kalau dinyatakan berbunyi (يثبكم عليه) “Dia memberikan pahalan kepada kalian.” Makna ayat: ‘Amr bin Al-Jamuh dan ia adalah orang yang kaya, bertanya kepada Rasulullah ﷺ Apa yang harus ia infakkan dan kepada siapa ia harus menginfaqkan. Maka turunlah ayat ini sebagai jawaban pertanyaannya, menerangkan bahwa yang harus ia infaqkan adalah harta dan seluruh bentuk kebaikan, dan orang yang paling berhak menerima infaqnya adalah kedua orang tuanya serta kerabat-kerabat dekatnya, begitu juga anak-anak yatim dan orang-orang miskin, serta orang yang kekurangan bekal perjalanan. Allah Ta’ala memberitahukan kepadanya segala jenis kebaikan yang dilakukan seorang hamba diketahui oleh Nya, dan Allah Ta’ala memberikan balasan pahala dan mendorong mereka untuk berbuat kebaikan secara mutlak. Pelajaran dari ayat: • Pertanyaan dari orang yang tidak tahu sehingga menjadi tahu, ini adalah jalan untuk memperoleh ilmu. Oleh karena itu ada yang mengatakan,”Bertanya merupakan separuh ilmu” • Keutamaan berinfaq kepada orang-orang yang disebutkan dalam ayat, apabila orang yang berinfaq itu kaya dan mereka dalam keadaan miskin membutuhkan bantuan. • Dorongan untuk melakukan amalan kebaikan dan janji dari Allah dengan balasan yang cukup untuk mereka yang beramal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 215: Allah mengabarkan bahwasannya para sahabat nabi ﷺ bertanya kepada nabi mereka: dengan apa mereka sodaqoh? dan siapa yang diberikan sodaqohh? maka Allah memerintahkan nabi untuk berkata pada mereka: benarkanlah oleh kalian atas apa yang mudah dari kebaikan, harta yang halal dan jadikan shodaqoh kalian bagi orang tua yang pertama kali, mereka adala manusia yang paling utama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Al Jalaalain dijelaskan bahwa yang bertanya adalah 'Amr bin Jamuh, ia adalah orang yang sudah tua dan memiliki harta yang banyak, ia bertanya kepada Rasulullah shallallahu 'alaihi wa sallam tentang harta apa yang perlu diinfakkan dan ke mana harta diinfakkan. Yakni baik banyak maupun sedikit. Kata-kata ini lebih umum lagi setelah menyebutkan secara khusus harta yang diinfakkan dan ke arah mana diberikan. Kata-kata ini menerangkan bahwa kebaikan apa saja yang dilakukan baik sedekah maupun ketaatan lainnya, baik kepada beberapa golongan di atas maupun lainnya, maka Allah Subhaanahu wa Ta'aala mengetahuinya, yakni akan membalasnya sesuai niat dan keikhlasannya, banyak atau sedikit infak yang dikeluarkan, kebutuhan orang lain terhadapnya dan sesuai besar kecilnya manfaat. Sehingga Dia (Allah) akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 215",
    "description": "Diriwayatkan bahwa seorang pria lanjut usia dan kaya raya bernama amr bin al-jamuh al-anshari bertanya kepada rasulullah, harta apa yang sebaiknya aku nafkahkan dan kepada siapa aku berikan' Allah lalu menurunkan ayat ini untuk menjawab pertanyaan tersebut. Mereka bertanya kepadamu, wahai nabi Muhammad, tentang apa yang harus mereka infakkan. Katakanlah, harta apa saja yang kamu infakkan, hendaknya diperuntukkan bagi kedua orang tua, kerabat, seperti saudara kandung, paman, bibi, dan anak-anak mereka, anak yatim, orang miskin, dan orang yang dalam perjalanan. Mereka hendaknya diprioritaskan untuk menerima infak sebelum orang lain. Infak pada ayat ini adalah sedekah yang bersifat anjuran, bukan zakat yang diwajibkan dalam agama dan telah ditentukan siapa yang berhak menerimanya seperti dibahas pada surah at-taubah/9: 60. Dan kebaikan apa saja yang kamu kerjakan, maka sesungguhnya Allah maha mengetahui. Dalam ayat ini kata al-khair disebut dua kali; yang pertama berarti harta (al-ma'l) dan yang kedua berarti kebajikan dalam arti umum. Selain diuji dengan kemiskinan dan kemelaratan, orang-orang beriman juga akan diuji dengan diminta mengorbankan jiwa mereka melalui kewajiban perang. Diwajibkan atas kamu berperang melawan orang-orang kafir yang memerangi kamu, padahal berperang itu tidak menyenangkan bagimu, sebab ia mengor-bankan harta benda dan jiwa. Tetapi boleh jadi kamu tidak menyenangi sesuatu, yakni boleh jadi kamu tidak menyukai peperangan, padahal itu baik bagimu karena kamu mendapat kemenangan atas orang-orang kafir atau masuk surga jika terbunuh atau kalah dalam peperangan, dan boleh jadi kamu menyukai sesuatu, padahal itu tidak baik bagimu. Allah mengetahui apa yang baik bagimu, sedang kamu tidak mengetahui. Karena itu, tunaikanlah perintah Allah yang pasti akan membawa kebaikan bagimu."
  }
]