[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah mewajibkan kalian (wahai kaum Mukminin), untuk memerangi orang-orang kafir, sedang perang itu perkara yang tidak kalian sukai secara naluri, lantaran berat dan banyaknya ancaman bahaya padanya. Namun, terkadang kalian membenci suatu perkara, padahal hakikatnya nya merupakan suatu yang lebih baik bagi kalian. dan terkadang kalian menyukai sesuatu karena ada kesempatan bersantai atau kesenangan sementara, padahal perkara itu buruk bagi kalian. Allah mengetahui apa yang terbaik bagi kalian, sedang kalian tidak mengetahuinya. Maka bersegeralah untuk berjihad di jalan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "216. Diwajibkan kepada kalian -wahai orang-orang mukmin- berperang di jalan Allah. Dan secara naluriyah kewajiban ini tidak menyenangkan bagi jiwa manusia, karena kewajiban ini menuntut pengorbanan harta dan jiwa. Boleh jadi kalian tidak menyukai sesuatu, padahal sejatinya itu baik dan bermanfaat bagi kalian, seperti berperang di jalan Allah. Di samping berpahala besar, berperang juga mendatangkan kemenangan atas musuh dan bisa meninggikan kalimat Allah. Dan boleh jadi kamu menyukai sesuatu, padahal sejatinya itu buruk dan merugikan bagi kalian, seperti tidak berangkat ke medan jihad. Tindakan ini dapat mendatangkan kehinaan dan penjajahan oleh musuh. Dan Allah benar-benar mengetahui secara pasti mana perkara yang baik dan mana perkara yang buruk, sedangkan kalian tidak mengetahuinya. Maka sambutlah perintah-Nya, karena perintah-Nya itulah yang berisi kebaikan bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "216. Hai orang-orang beriman, diwajibkan kepada kalian untuk berperang melawan orang-orang kafir demi menjaga agama dan pemeluknya. Peperangan itu sungguh berat dilakukan karena membutuhkan pengorbanan, namun sesuatu yang kalian benci bisa jadi membawa kebaikan bagi kalian. Dan bisa jadi kalian menyukai ketenangan dan enggan berperang namun itu buruk bagi kalian. Kewajiban ini merupakan fardhu kifayah, apabila sebagian orang melaksanakannya maka kewajiban itu gugur atas sebagian lainnya. Dan terkadang kewajiban ini menjadi fardhu ‘ain -wajib bagi seluruh kaum muslimin, yaitu jika musuh menyerang negeri Islam. Allah Maha Mengetahui apa yang baik bagi kalian, sedangkan kalian tidak mengetahuinya, maka penuhilah seruan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "216. كُتِبَ (Diwajibkan) Dan kewajiban berperang atas mereka merupakan salah satu yang dijadikan cobaan atas mereka. الْقِتَالُ (berperang) Yakni berperang melawan orang-orang kafir. كُرْهٌ (benci) Makna (الكره) adalah kesulitan yang dibenci oleh jiwa, dan jihad adalah termasuk hal yang dibenci karena terdapat didalamnya mengeluarkan harta benda, meninggalkan keluarga dan negeri, dan kemungkinan kehilangan nyawa. وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًٔا (Boleh jadi kamu membenci sesuatu) Yakni dalam jihad, karena didalamnya terdapat kesulitan. وَهُوَ خَيْرٌ لَّكُمْ ۖ (padahal ia amat baik bagimu) Karena bisa jadi kalian akan meraih kemenangan, keberuntungan, harta rampasan, dan mendapat pahala. Adapun yang meninggal maka dia meninggal dalam keadaan syahid. وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًٔا (dan boleh jadi (pula) kamu menyukai sesuatu) Yakni dengan meninggalkan dan tidak mengikuti peperangan. وَهُوَ شَرٌّ لَّكُمْ ۗ (padahal ia amat buruk bagimu) Karena bisa jadi musuh akan menjadi lebih kuat kemudian mengalahkan kalian, atau menyerbu negeri-negeri kalian, sehingga terjadi sesuatu yang lebih kalian takuti dari pada berjihad yang kalian benci. Begitu juga terlewatnya bagi kalian kebaikan-kebaikan masa sekarang atau yang akan datang. وَاللَّـهُ يَعْلَمُ (Allah mengetahui) Yakni apa yang baik bagi kalian dan kemenangan kalian. وَأَنتُمْ لَا تَعْلَمُونَ (sedang kamu tidak mengetahui) Dari Ibnu Syihab berkata tentang ayat ini: pergi berjihad adalah kewajiban bagi setiap orang baik itu yang ikut berperang maupun yang tidak. Adapun bagi yang tidak berperang apabila dimintai bantuan mereka harus membantu, apabila dimintai pertolongan mereka harus menolong, dan apabila diminta untuk pergi ke medan jihad mereka harus pergi, namun apabila tidak dibutuhkan mereka boleh tetap diam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sesuatu yang menimpa seorang hamba jika itu kebaikan baginya, maka itu merupakan nikmat yang nyata, dan jika itu keburukan baginya, maka itu juga nikmat dari sisi yang menghapus dosa-dosanya, dan dia akan mendapat balasan dari kesabaran atas musibah itu, dan dari sisi lain ada hikmah dan rahmat yang ia tidak mengetahuinya { وَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ }. 2 ). { وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ } Di dalam ayat ini terkandung beberapa hikmah dan maslahat; seorang hamba ketika ia tahu bahwa sesuatu yang ia dibenci terkadang mendatang kebaikan yang ia sukai, dan kebaikan yang ia sukai terkadang mendatangkan keburukan yang ia benci, sesungguhnya ia belum menjamin sesuatu yang buruk mendatanginya dari arah yang baik, dan ia tidak pula ia mengetahui sesuatu yang baik akan datang dari arah yang ia benci; hal itu dikarenakan ketidaktahuannya akan kejadian yang akan datang dan sesungguhnya Allah Maha mengetahui dari perkara itu apa yang tidak pernah diketahui oelh hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "216. Wahai orang-orang mukmin, telah diwajibkan atas kalian itu berperang, yaitu penderitaan yang dibenci banyak orang, dimana di dalamnya itu ada peristiwa mengeluarkan harta benda, berpisah dengan keluarga dan tanah air, dan menyongsong kematian, Boleh jadi jihad yang kalian benci itu lebih baik bagi kalian, dimana di dalamnya itu ada peristiwa memenangkan dan menjunjung agama serta terdapat pahala yang melimpah. Boleh jadi meninggalkan peperangan yang kalian senangi itu buruk bagi kalian karena membiarkan musuh mengambil alih negeri kalian. Dan Allah itu mengetahui sesuatu yang mengandung kebaikan bagi kalian sedangkan kalian tidak mengetahuinya, maka kerjakanlah sesuatu yang telah diperintahkan untuk kalian. Ibnu Abbas berkata: “Ketika Allah mewajibkan jihad untuk orang-orang muslim, mereka tidak suka, lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diwajibkan atas kalian untuk berperang, padahal itu dibenci} dibenci {oleh kalian. Boleh jadi kalian membenci sesuatu, padahal itu baik bagi kalian dan boleh jadi kalian menyukai sesuatu, padahal itu buruk bagi kalian. Allah mengetahui, sedangkan kalian tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "216. Ayat ini mengandung hukum wajibnya berjihad dijalan Allah setelah sebelumnya kaum muslimin diperintahkan untuk meninggalkannya, karena mereka masih lemah dan tidak mampu. Ketika Nabi berhijrah ke Madinah dan jumlah kaum muslimin bertambah banyak dan kuat, Allah memerintahkan mereka untuk berperang, dan Allah mengabarkan bahwasanya peperangan itu sangatlah dibenci oleh jiwa karena mengandung keletihan, kesusahan, menghadapi hal-hal yang menakutkan dan membawa kepada kematian. Tapi sekalipun demikian, berjihad itu merupakan kebaikan yang murni, karena memiliki ganjaran yang besar dan menghindarkan dari siksaan yang pedih, pertolongan atas musuh, dan kemenangan dengan ghanimah dan sebagainya, yang merupakan akibat baik dari apa yang tidak disukai tersebut. “Dan boleh jadi (pula) kamu menyukai sesuatu, padahal ia amat buruk bagimu.” Hal itu seperti tidak ikut pergi berjihad demi menikmati istirahat, itu adalah suatu keburukan, karena akan mengakibatkan kehinaan, penguasaan musuh terhadap Islam dan pengikutnya, terjadinya kerendahan dan hina-dina, hilangnya kesempatan mendapatkan pahala yang besar dan akan memperoleh hukuman. Ayat ini adalah umum lagi luas, bahwa perbuatan perbuatan baik yang dibenci oleh jiwa manusia karena ada kesulitan padanya itu adalah sesuatu yang baik tanpa ada keraguan, dan bahwa perbuatan-perbuatan buruk yang disenangi oleh jiwa manusia karena apa yang diperkirakan olehnya bahwa padanya ada keenakan dan kenikmatan ternyata juga buruk tanpa ada keraguan. Perkara dunia tidaklah bersifat umum, akan tetapi kebanyakan orang apabila ia senang terhadap suatu perkara, lalu Allah memberikan baginya sebab-sebab yang membuatnya berpaling darinya, maka hal itu adalah suatu yang baik baginya. Maka yang paling tepat baginya dalam hal itu adalah ia bersyukur kepada Allah, dan meyakini kebaikan itu ada pada apa yang terjadi, karena ia mengetahui bahwa Allah lebih sayang kepada hambaNya daripada dirinya sendiri, lebih kuasa memberikan kemaslahatan bagi hambaNya daripada dirinya sendiri, dan lebih mengetahui kemaslahatan daripada dirinya sendiri, sebagaimana Allah berfirman, “Allah mengetahui sedangkan kamu tidak mengetahui.” Maka yang pantas bagi kalian adalah kalian sejalan dengan segala takdir takdirNya, baik yang menyenangkan ataupun yang menyusahkan kalian. Dan tatkala perintah berperang (pada ayat diatas) tidak dibatasi, pastilah akan mencakup bulan-bulan haram dan selainnya, maka Allah mengecualikan peperangan pada bulan-bulan haram dengan berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { كُتِبَ } Kutiba : Diwajibkan dan ditegaskan sehingga seolah-olah hal itu tertulis dengan tulisan. { ٱلۡقِتَالُ } Al-Qital : Memerangi orang-orang kafir dengan berjihad melawan mereka sampai mereka masuk agama Islam atau mau membayar jizyah. { كُرۡهٞ } Kurhun : Dibenci oleh jiwa secara naluriah. { وَعَسَىٰٓ } ‘Asa : Kata kerja ini (fi’il) memiliki arti mengharapkan (tarajji) dan memperkirakan akan terjadi (tawaqqu’). Yaitu apa yang masuk ke dalamnya, diharapkan sekali dapat tercapai dan terjadi, tapi tidak dengan pasti. Kecuali apabila berasal dari Allah Ta’ala maka menunjukkan kepada kepastian. Makna ayat : Allah Ta’ala memberitahukan rasul Nya dan hamba-hamba Nya yang mukmin bahwa Dia mewajibkan kepada mereka untuk memerangi orang-orang musyrik dan kafir. Allah mengetahui bahwa perintah untuk berperang itu tidak disukai oleh hamba-hamba Nya secara naluriah. Karena peperangan akan menimbulkan rasa sakit, kelelahan, pengorbanan harta dan nyawa. Namun Allah mengabarkan bahwa apa yang mereka tidak sukai itu bisa jadi mengandung kebaikan yang banyak, dan apa yang mereka sukai mengandung keburukan. Di antaranya adalah jihad. Hal ini tidak disukai kebanyakan orang akan tetapi terdapat kebaikan untuk mereka karena terdapat kemuliaan, kemenangan, dan kejayaan bagi agama, serta pahala yang besar dan melimpah di akhirat nanti. Sebagaimana meninggalkan jihad disukai oleh kebanyakan orang, akan tetapi itu buruk bagi mereka karena hal itu akan memotivasi musuh-musuh untuk memerangi mereka dan menghalalkan kehormatan mereka, serta menodai agama dan mendapatkan balasan yang buruk di akhirat nanti. Inilah yang dikabarkan oleh Allah Ta’ala kepada manusia karena kecintaan mereka terhadap sesuatu, padahal mengandung keburukan untuk diri mereka sendiri. Dan kebencian mereka untuk melakukan sesuatu padahal terdapat kebaikan untuk mereka, karena pengetahuan Allah sebelum penciptaan. Allah Maha Mengetahui sedangkan mereka tidak mengetahui. Maka wajib untuk tunduk menyerahkan diri kepada Allah Ta’ala dalam perintahNya dan syariatNya, serta mencintai apa yang Dia perintahkan dan apa yang disyariatkan, serta meyakini bahwa itu semua mengandung kebaikan, tidak ada keburukan padanya. Pelajaran dari ayat : • Kewajiban berjihad bagi umat Islam selama masih terjadi fitnah dan kesyirikan di muka bumi. • Kebodohan manusia terhadap hasil dari suatu usaha, membuat mereka menyukai hal yang dibenci dan membenci hal yang disukai. • Perintah-perintah Allah kesemuanya adalah baik, dan hal yang dilarang olehNya semuanya mengandung keburukan. Oleh karena itu wajib untuk melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 216: Allah mengabarkan kepada rasul-Nya dan hamba yang beriman bahwasannya diwajibkan bagi mereka memerangi orang-orang kafir dan musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan kewajiban berperang setelah sebelumnya kaum mukmin diperintahkan untuk menahan diri karena lemahnya mereka dan tidak sanggupnya mereka menerima beban itu. Ketika Nabi shallallahu 'alaihi wa sallam berhijrah ke Madinah, kaum muslimin bertambah banyak dan kuat, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk berperang dan memberitahukan bahwa yang demikian memang dibenci oleh jiwa karena berat, terlebih harus mengorbankan jiwa dan raga serta penuh bahaya. Meskipun begitu, di dalamnya terdapat kebaikan, seseorang bisa memperoleh kemenangan dan ghanimah atau memperoleh syahid dan pahala yang besar. Ketika mereka meninggalkan berperang, akibatnya musuh semakin berkuasa sehingga mereka akan memperoleh kehinaan, kemiskinan, terhalangnya pahala dan mendapatkan siksa. Oleh karena itu, laksanakanlah segera perintah itu. Ayat ini adalah umum, berlaku untuk semua perbuatan baik meskipun dibenci oleh jiwa karena terasa berat bahwa di dalamnya terdapat kebaikan bagi kita dan bahwa perbuatan buruk meskipun dicintai oleh jiwa karena nampaknya ada santai dan kenikmatan, maka hal itu adalah buruk bagi kita. Adapun dalam masalah dunia, maka tidak selalu demikian, akan tetapi biasanya seorang hamba yang mukmin ketika mencintai suatu perkara, lalu Allah Subhaanahu wa Ta'aala mengadakan sebab-sebab yang memalingkan dia daripadanya, maka hal itu lebih baik baginya. Oleh karena itu, sikap yang tepat adalah bersyukur kepada Allah Subhaanahu wa Ta'aala dan menganggap bahwa kebaikan ada pada sesuatu yang terjadi, karena sudah maklum bahwa Allah Subhaanahu wa Ta'aala lebih sayang kepada seorang hamba daripada sayangnya seorang hamba kepada dirinya, Dia lebih mampu memberikan maslahat kepada hamba-Nya dan lebih mengetahui maslahat yang terbaik untuknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 216",
    "description": "Selain diuji dengan kemiskinan dan kemelaratan, orang-orang beriman juga akan diuji dengan diminta mengorbankan jiwa mereka melalui kewajiban perang. Diwajibkan atas kamu berperang melawan orang-orang kafir yang memerangi kamu, padahal berperang itu tidak menyenangkan bagimu, sebab ia mengor-bankan harta benda dan jiwa. Tetapi boleh jadi kamu tidak menyenangi sesuatu, yakni boleh jadi kamu tidak menyukai peperangan, padahal itu baik bagimu karena kamu mendapat kemenangan atas orang-orang kafir atau masuk surga jika terbunuh atau kalah dalam peperangan, dan boleh jadi kamu menyukai sesuatu, padahal itu tidak baik bagimu. Allah mengetahui apa yang baik bagimu, sedang kamu tidak mengetahui. Karena itu, tunaikanlah perintah Allah yang pasti akan membawa kebaikan bagimu. Ayat ini turun ketika tentara islam yang dipimpin oleh abdulla'h bin jahsy berperang melawan orang-orang kafir di permulaan bulan rajab, satu dari empat bulan haram. Mereka lalu bertanya kepadamu, wahai nabi Muhammad, tentang boleh-tidaknya berperang pada bulan haram. Katakanlah, berperang dalam bulan itu adalah dosa besar. Tetapi, ada yang lebih besar lagi dosanya, yaitu menghalangi orang beriman dari jalan Allah, yakni melaksanakan perintah-Nya, ingkar kepadanya, menghalangi orang masuk masjidilharam, dan mengusir penduduk dari sekitarnya. Itu semua lebih besar dosanya dalam pandangan Allah. Dan fitnah, yaitu kemusyrikan dan menindas orang mukmin, itu lebih kejam daripada pembunuhan dalam peperangan. Mereka tidak akan berhenti memerangi kamu sampai kamu murtad keluar dari agamamu, jika mereka sanggup mengeluarkanmu dari agamamu. Janganlah sekali-kali kamu murtad dari agamamu walaupun mereka tidak akan berhenti memerangimu, sebab barang siapa murtad di antara kamu dari agamanya, yakni keluar dari islam, lalu dia mati dalam kekafiran, maka mereka itu sia-sia amalnya di dunia dan di akhirat. Tidak ada pahala bagi amalnya, dan mereka itulah penghuni neraka; mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini merupakan penetapan kewajiban jihad dari Allah Subhanahu wa Ta'ala bagi kaum muslimin setelah sebelumnya saat kaum muslimin masih berada di Mekah mereka diperintahkan untuk meninggalkannya karena lemahnya kekuatan kaum muslimin dan tidak mampu melaksanakannya. Maka setelah Nabi Muhammad Shallallahu 'alaihi wa Sallam hijrah ke Madinah dan jumlah kaum muslimin semakin bertambah banyak, maka Allah perintahkan mereka untuk berperang di jalan Allah dengan tujuan supaya menghentikan kejahatan musuh di wilayah islam. Az-Zuhri mengatakan “jihad itu wajib bagi setiap individu, baik yang berada dalam peperangan maupun yang sedang duduk (tidak ikut perang). Orang yang sedang duduk, apabila dimintai bantuan, maka ia harus memberikan bantuan, jika diminta berperang, maka ia harus maju berjuang, dan jika tidak dibutuhkan, maka hendaklah ia tetap di tempat (tidak ikut). Ibnu katsir mengatakan sebuah hadits yang berhubungan dengan ayat ini, yaitu sabda nabi: من مات ولم يغز ، ولم يحدث نفسه بغزو مات ميتة جاهلية “Barangsiapa yang meninggal dunia sedangkan dia tidak pernah ikut berperang dan dia juga tidak pernah berniat untk berperang, maka dia meninggal dunia dalam keadaan jahiliyah” (HR. Bukhori dan Muslim) Rosululloh Shallallahu 'alaihi wa Sallam juga bersabda pada waktu fathu Makkah (pembebasan kota Mekah) لا هجرة ، ولكن جهاد ونية ، إذا استنفرتم فانفروا “Tidak ada hijrah setelah fathu Makkah (pembebasan kota mekah), akan tetapi yang ada adalah jihad dan niat baik. Bila kalian diminta untuk berperang, maka berperanglah” (HR. Bukhori dan Muslim) Firman-Nya : وَهُوَ كُرْهٌ لَّكُمْ “Padahal berperang itu adalah sesuatu yang kamu benci” Maksudnya, berperang itu adalah sesuatu yang sangat berat dan menyulitkan bagi kalian, karena berperang akan mengakibatkan kamatian atau luka-luka, disamping kesulitan dalam perjalanan serta keberanian menghadapi musuh. Selanjutnya Allah Subhanahu wa Ta'ala berfirman : وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ “Boleh jadi kamu membenci sesuatu padahal ia sangat baik bagi kamu” Artinya, karena peprangan itu membawa kemenangan dan keberuntungan atas musuh, penguasaan atas negri, harta benda, wanita dan anak-anak mereka. وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ “Dan boleh jadi kamu menyukai sesuatu padahal ia sangat buruk bagi kamu” Pengertian ayat ini bersifat umum dalam segala hal. Bias saja seseorang menyukai sesuatu, padahal sesuatu tersebut tidak mendatangkan kebaikan dan kemaslahatan baginya. Diantaranya adalah penolakan ikut berperang yang akan berakibat jatuhnya negri dan pemerintahan ke tangan musuh. Kemudian Allah berfirman : وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ “Dan Allah mengetahui, sedang kamu tidak mengetahui” Artinya, Allah Subhanahu wa Ta'ala lebih mengetahi akibat segala sesuatu dan Dia memberitahukan bahwa dalam peperangan itu terdapat kebaikan bagi kalian di dunia maupun di akhirat. Karena itu, sambut dan bersegeralah memenuhi perintah-Nya supaya kalian mendapat petunjuk."
  }
]