[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik bertanya kepadamu (wahai Rasul), tentang bulan-bulan haram: “Apakah boleh berperang padanya?” katakanlah kepada mereka,\" peperangan pada bulan-bulan haram adalah suatu perkara yang besar ( dosanya ) di sisi Allah untuk menghalalkannya dan menumpahkan darah padanya, sikap kalian menghalangi manusia untuk masuk Islam dengan penyiksaan dan intimidasi, pengingkaran kalian kepada Allah, rasul Nya dan agama Nya, dan menghalangi kaum muslimin untuk memasuki Masjidil Haram, dan pengusiran nabi dan kaum Muhajirin darinya, Padahal mereka adalah para penduduk aslinya, dan wali-wali Allah ( yang mereka usir) , adalah lebih besar dosanya dan lebih parah kejahatannya di sisi Allah dibandingkan peperangan di bulan bulan suci. Dan kesyirikan yang ada pada kalian itu lebih dahsyat ( keburukannya ) daripada membunuh pada bulan bulan suci.\" Dan orang-orang kafir itu tidak merasa ngeri untuk menghentikan ulah-ulah kejahatannya, bahkan mereka justru terus melakukannya. Mereka tidak berhenti untuk memerangi kalian sampai dapat mengembalikan kalian dari Islam menuju kekafiran bila mereka sanggup untuk merealisasikannya. Dan barangsiapa diantara kalian yang mengikuti mereka (wahai kaum muslimin), dan murtad meninggalkan agamanya, lalu dia mati dalam kekafiran, Sesungguhnya amal perbuatannya telah sirna di dunia dan akhirat, dan dia menjadi bagian orang-orang yang menetap di dalam neraka jahanam, tidak akan keluar darinya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "217. Manusia bertanya kepadamu -wahai Nabi- tentang hukum berperang di bulan-bulan haram, yaitu Zulkaidah, Zulhijah, Muharram dan Rajab. Katakanlah untuk menjawab pertanyaan mereka itu, “Berperang di bulan-bulan haram adalah dosa besar dan kemungkaran di sisi Allah. Sebagaimana tindakan orang-orang musyrik yang menghalang-halangi manusia dari jalan Allah adalah perbuatan buruk juga. Tetapi melarang orang-orang mukmin memasuki Masjidil Haram dan mengusir para penghuni Masjidil Haram dari dalam masjid itu lebih besar dosanya di sisi Allah daripada berperang di bulan haram. Dan kemusyrikan yang mereka jalani itu lebih besar dosanya daripada pembunuhan.” Dan orang-orang musyrik senantiasa berada dalam kezaliman mereka, mereka tidak henti-hentinya memerangi kamu -wahai orang-orang mukmin- sampai mereka berhasil mengeluarkan kalian dari agama yang benar menuju agama mereka yang batil, sekiranya mereka bisa melakukannya. Barangsiapa di antara kalian yang meninggalkan agamanya (murtad) dan mati dalam kekafiran kepada Allah, maka amal salehnya menjadi sia-sia, dan kelak di akhirat mereka akan masuk ke dalam neraka dan menetap di sana untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "217. Hai Nabi, sebagian orang bertanya kepadamu tentang hukum berperang pada bulan haram, yaitu bulan Rajab. Ketika salah seorang dari kaum musyrikin dibunuh oleh salah seorang kaum muslimin. Maka datanglah jawaban atas pertanyaan ini: Jawablah hai Muhammad, peperangan di bulan haram merupakan dosa besar, namun perbuatan kalian di bulan haram dengan melarang orang-orang untuk masuk Islam dan masuk Masjidil Haram serta pengusiran kalian terhadap Rasulullah dan kaum muslimin dari kota Makkah merupakan dosa yang lebih besar di sisi Allah daripada peperangan di bulan haram; dan kesyirikan yang kalian lakukan serta penyiksaan kalian terhadap orang-orang beriman agar keluar dari agama mereka merupakan dosa yang lebih besar daripada pembunuhan. Hai orang-orang beriman, orang-orang kafir akan terus memerangi kalian sampai kalian keluar dari agama kalian menuju kekafiran jika mereka mampu. Dan barangsiapa yang menuruti kemauan mereka dan keluar dari agamanya, kemudian dia mati dalam keadaan kafir, maka dia sungguh telah jauh dari kebenaran, pahala amal kebaikan mereka akan terhapus di dunia dan di akhirat, mereka jauh dari rahmat Allah dan akan menjadi penghuni neraka yang kekal di dalamnya. Syeikh as-Syinqithi berkata, dalam firman Allah: {ولا يزالون يقاتلونكم حتى يردوكم عن دينكم إن استطاعوا} tidak dijelaskan apakah mereka akan mampu melakukannya atau tidak. Namun Allah menjelaskannya pada ayat lain bahwa mereka tidak akan mampu dan mereka akan putus asa dalam mengeluarkan orang-orang beriman dari agama mereka, hal ini dijelaskan dalam firman-Nya: الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِن دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka, tetapi takutlah kepada-Ku. Pada hari ini telah Aku sempurnakan agamamu untukmu, dan telah Aku cukupkan nikmat-Ku bagimu, dan telah Aku ridai Islam sebagai agamamu. Tetapi barangsiapa terpaksa karena lapar, bukan karena ingin berbuat dosa, maka sungguh, Allah Maha Pengampun, Maha Penyayang. (al-Maidah: 3) Dan Allah juga menjelaskan dalam ayat-ayat lain bahwa Dia akan memenangkan agama Islam atas agama yang lain, sebagaimana Dia jelaskan dalam surat at-Taubah, ash-Shaf, dan al-Fath, هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang hak agar dimenangkan-Nya terhadap semua agama. (al-Fath: 28)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "217. يَسْـَٔلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ ۖ (Mereka bertanya kepadamu tentang berperang pada bulan Haram) Rasulullah mengutus pasukan yang kemudian bertemu dengan ‘Amr bin Hadhramy yang sedang menuju Thaif pada malam pertama di bulan Rajab (salah satu bulan yang diharamkan berperang) namun mereka tidak tahu (telah masuk bulan Rajab). Kemudian salah satu pasukan membunuh ‘Amr bin Hadhramy dan merampas harta yang bersamanya. Maka kaum Musyrikin dikirim untuk menjelek-jelekkan hal itu. Sehingga turunlah ayat ini. Adapun makna ayat ini adalah: mereka menanyakan padamu tentang perang di bulan-bulan haram. Bulan-bulan haram ini adalah Dzul Qa’dah, Dzul Hijjah, Muharram, dan Rajab; tiga diantaranya berturut-turut dan yang satu tersendiri. قُلْ قِتَالٌ فِيهِ كَبِيرٌ ۖ (Katakanlah: “Berperang dalam bulan itu adalah dosa besar) Yakni peperangan didalamnya merupakan dosa besar yang diingkari. وَصَدٌّ عَن سَبِيلِ اللَّـهِ وَكُفْرٌۢ بِهِۦ وَالْمَسْجِدِ الْحَرَامِ وَإِخْرَاجُ أَهْلِهِۦ مِنْهُ أَكْبَرُ عِندَ اللَّـهِ ۚ (tetapi menghalangi (manusia) dari jalan Allah, kafir kepada Allah, (menghalangi masuk) Masjidilharam dan mengusir penduduknya dari sekitarnya, lebih besar (dosanya) di sisi Allah) Dan dahulu orang-orang kafir Makkah melakukan ini semuanya. وَالْفِتْنَةُ (Dan berbuat fitnah) Maksud dari fitnah disini adalah cobaan yang ditimpakan atas orang-orang mukmin yang lemah dengan siksaan sebab mereka memeluk Islam. Dan hal ini lebih besar dosanya daripada pembunuhan seandainya mereka membunuh orang-orang ini. وَلَا يَزَالُونَ (Mereka tidak henti-hentinya) Yakni tidak berhenti untuk memerangi dan memusuhi kalian. حَتَّىٰ يَرُدُّوكُمْ عَن دِينِكُمْ (sampai mereka (dapat) mengembalikan kamu dari agamamu) Yakni dari agama Islam menuju kekufuran. إِنِ اسْتَطٰعُوا۟ ۚ (seandainya mereka sanggup) Yakni andai mereka sanggup melakukan itu dan memiliki kesempatan itu. فَأُو۟لٰٓئِكَ حَبِطَتْ أَعْمٰلُهُمْ (maka mereka itulah yang sia-sia amalannya) Yakni amalan mereka menjadi batal dan rusak. فِى الدُّنْيَا وَالْءَاخِرَةِ ۖ (di dunia dan di akhirat) Yakni orang-orang yang murtad di dunia tidak diperlakukan seperti perlakuan terhadap orang Islam, sedangkan di akhirat tidak mendapatkan pahala akhirat karena salah satu syaratnya adalah masuk islam. Begitu pula keluarganya tidak berhak atas hartanya apabila dia mati dalam keadaan kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "217. Wahai nabi, orang-orang bertanya kepadamu tentang berperang di bulan-bulan haram, yaitu bulan Rajab, katakanlah: “Berperang di bulan itu merupakan dosa besar, namun mencegah kalian masuk Islam dan masjidil haram, dan mengusir penduduk asli dari negerinya, yaitu nabi dan orang-orang mukmin itu dosanya lebih besar di sisi Allah daripada berperang pada bulan haram. Dan menghalang-halangi orang muslim yang lemah dari agama mereka dengan memberi siksaan dan mengusirnya itu dosanya lebih besar daripada pembunuhan. Dan orang-orang kafir itu masih memerangi kalian wahai orang-orang mukmin sampai mereka bisa mengembalikan kalian dari agama kalian menuju kekufuran. Jika kalian menuruti hal itu, dan barangsiapa keluar dari Islam lalu mati dalam keadaan kafir, maka amal shalih mereka di dunia menjadi sia-sia dan tidak mengerjakan amal orang-orang muslim. Dan di akhirat pahala mereka itu lenyap dan menjadi penduduk neraka. Mereka tinggal disana selama-lamanya. Ini adalah balasan bagi orang yang murtad” Ath-Thabari dan lainnya meriwayatkan bahwa Rasulullah SAW suatu kelompok pasukan lalu mereka bertemu dengan Amr bin Hadramiy yang bertolak dari Thaif di malam pertama bulan Rajab yang diharamkan untuk perang, Lalu salah serang lelaki dari pasukan itu membunuhnya dan mereka mengambil barang yang dia bawa. Mereka tidak menyadari bahwa itu sudah masuk bulan Rajab Lalu mereka dicaci oleh orang-orang musyrik. Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang berperang pada bulan haram. Katakanlah, “Berperang dalam bulan itu adalah (dosa) besar} sangat besar (dosanya) dan terkutuk {Namun menghalangi (orang lain) dari jalan Allah} menghalangi (orang) dari agama Allah {ingkar kepadaNya, dan (menghalangi masuk) Masjidil haram} menghalangi menuju Masjidil haram {serta mengusir penduduk dari kampungnya itu lebih besar dosanya di sisi Allah. Dan fitnah} kemusyrikan {itu lebih besar (dosanya) daripada pembunuhan.” Mereka tidak akan berhenti memerangi kalian sampai kalian murtad dari agama kalian jika mereka sanggup. Siapa saja di antara kalian yang murtad dari agamanya lalu dia mati dalam kekafiran, maka sia-sialah} maka batallah {amal mereka di dunia dan akhirat. Mereka itulah penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "217. Sebagian besar ulama berpendapat bahwa haramnya peperangan pada bulan-bulan haram itu telah dimansukh oleh perintah memerangi kaum musyrikin dimanapun mereka ditemukan. Sedangkan sebagian ahli tafsir berkata bahwa hukum tersebut tidaklah dimansukh, karena nash (teks) yang mutlaq (umum) harus dipahami dengan teks yang muqayyad (diberi batasan), sedangkan ayat ini adalah teks yang memberi batasan keumuman ayat-ayat tentang perintah berperang secara umum, dan juga karena diantara keistimewaan bulan-bulan haram itu, bahkan keistimewaannya yang paling besar adalah haramnya peperangan padanya. Ini adalah dalam konteks memulai perang (ofensif), adapun bila di dalam konteks membela diri (defensif), maka boleh dilakukan pada bulan-bulan tersebut, sebagaimana juga dibolehkan di dalam tanah haram. Dan tatkala ayat ini turun disebabkan apa yang terjadi pada pasukan kecil Abdullah Bin jahsy dan pembunuhan mereka terhadap Amr Bin Al hadrami serta pengembalian harta mereka dimana kejadian tersebut menurut suatu pendapat adalah pada bulan Rajab kaum musyrikin mencela kaum muslimin karena melakukan peperangan dalam bulan-bulan haram, dan kaum musyrikin tersebutlah berlaku zalim dalam mencela kaum muslimin, karena mereka sendiri memiliki perbuatan-perbuatan yang jelek yang sebagiannya lebih kecil daripada yang telah mereka tuduhkan terhadap kaum muslimin. Allah berfirman tentang penjelasan yang ada pada mereka, “menghalangi (manusia) dijalan Allah,” artinya, kaum musyrikin menghalangi orang yang hendak masuk Islam dan beriman kepada Allah dan rasulNya, menyiksa orang yang telah beriman kepadaNya dan usaha mereka dalam mengembalikan orang-orang tersebut dari agama mereka, dan kekufuran mereka yang terjadi pada bulan-bulan haram dan pada tanah haram, yang dengan itu saja sudah cukup menjadi suatu keburukan, maka bagaimana jika itu terjadi pada bulan haram dan di negeri haram? “Dan mengusir penduduknya,” maksudnya, penduduk Masjidil Haram, yaitu Nabi dan para sahabat beliau, karena mereka lebih berhak terhadap Masjidil Haram daripada kaum musyrikin, dan mereka itulah yang sebenarnya memakmurkannya. Tetapi mereka mengusir kaum muslimin “dari sekitarnya”; dan mereka tidak memberi kesempatan agar nabi dan para sahabat beliau sampai kepadanya, padahal tanah haram itu sama saja bagi orang yang menetap maupun yang tidak. Semua perkara-perkara tadi, masing-masing saja darinya, “lebih besar (dosanya) daripada membunuh” pada bulan haram, bagaimana tidak, pada hal-hal tersebut telah terkumpul pada mereka. Sehingga diketahui bahwasanya mereka itu adalah orang-orang yang fasik lagi zhalim dalam celaan mereka terhadap kaum muslimin. Kemudian Allah mengabarkan bahwasanya mereka akan terus memerangi kaum muslimin. Tujuan mereka bukanlah harta dan membunuh mereka, akan tetapi mengembalikan kaum muslimin dari agama mereka sebagai orang-orang kafir setelah keimanan mereka, hingga mereka menjadi penghuni penghuni neraka Sair. Mereka mengerahkan segala kemampuan mereka dalam hal tersebut dan berusaha dengan segala kemungkinan yang bisa mereka lakukan, \"namun Allah tidak mau kecuali hanya menyempurnakan cahayaNya walau kaum kafir membencinya.\" QS At-Taubah : 32 Sifat ini adalah umum bagi semua orang. Mereka akan terus memerangi selain mereka (dari kaum mukminin) hingga mengembalikan mereka dari agama mereka, khususnya ahli kitab dari kaum Yahudi dan Nasrani yang mengarahkan yayasan-yayasan, menyebarkan misionaris, mengirim dokter-dokter, mendirikan sekolah-sekolah untuk menarik seluruh umat kepada agama mereka, memasukkan segala macam syubhat ke dalam agama mereka, demi mengaburkan nya bagi pemeluk-pemeluknya, agar mereka ragu terhadap agamanya. Akan tetapi Apa yang diharapkan adalah dari Allah yang telah mengaruniakan kepada kaum mukminin dengan Islam, yang telah memilihkan bagi mereka agama yang lurus, yang telah menyempurnakan bagi mereka agamaNya dan menyempurnakan kenikmatanNya atas mereka dengan menegakkan agama sebaik-baiknya, yang menghina orang yang hendak memadamkan cahayaNya, yang telah menjadi tipu daya mereka kembali kepada diri mereka sendiri, yang telah membela agamaNya, meninggikan kalimatNya. Dan agar ayat ini benar-benar terbukti terhadap orang-orang yang ada dari kaum kafir sebagaimana telah terbukti terhadap orang-orang sebelum mereka firman Allah : \"Sesungguhnya orang-orang yang kafir menafkahkan harta mereka untuk menghalangi (orang) dari jalan Allah. Mereka akan menafkahkan harta itu, kemudian menjadi sesalan bagi mereka, dan mereka akan dikalahkan. Dan ke dalam Jahannamlah orang-orang yang kafir itu dikumpulkan,\" QS. Al-anfal ayat 36 Kemudian Allah mengabarkan bahwa barang siapa yang keluar dari Islam yaitu dengan memilih kekufuran dan ia terus dalam kekafiran hingga ia meninggal sebagai orang kafir, “maka mereka itulah yang sia-sia amalannya di dunia dan di akhirat,” karena tidak ada syaratnya, yaitu Islam, “dan mereka itulah penghuni neraka mereka kekal di dalamnya.” Ayat ini menunjukkan (menurut pemahamannya secara terbalik) bahwa orang yang keluar dari Islam kemudian kembali masuk Islam, maka amalan-amalannya akan kembali lagi (yaitu yang sebelumnya murtad). Demikian pula bagi orang yang bertaubat dari kemaksiatan, maka akan kembali kepadanya segala pahala perbuatan-perbuatannya yang terdahulu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡحَرَامِ قِتَالٖ فِيهِۖ } Al-harami qitaalin fiih : Yaitu pada bulan yang diharamkan berperang (Al-Muharram). Kata qital (peperangan) merupakan badal isytimal dari kata haram, dimana pertanyaan mengenai peperangan di bulan haram (Rajab). { كَبِيرٞۚ } Kabiir : Dosa besar { وَصَدٌّ عَن سَبِيلِ ٱللَّهِ } Shaddun ‘an sabilillah : memalingkan dari agama Allah. { وَكُفۡرُۢ بِهِۦ } Wa kufrun bihi : Kekufuran kepada Allah Ta’ala { وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ } Al-Masjidil Haram : Kota Mekah dan Masjidil haram yang ada di dalamnya. { أَهۡلِهِۦ } Ahlihi : Nabi Muhammad ﷺ dan para sahabatnya. { أَكۡبَرُ } Akbar : Dosanya lebih besar. { وَٱلۡفِتۡنَةُ } Al-Fitnah : Kesyirikan dan pemaksaan kepada orang-orang yang beriman untuk kufur. { حَبِطَتۡ أَعۡمَٰلُهُمۡ } Habithat a’maaluhum : Hilanglah pahala amalannya, tidak diberikan pahala karena keluar dari agama Islam. Makna ayat: Tatkala Allah Ta’ala mewajibkan kepada kaum mukminin untuk berangkat perang, Nabi Muhammad ﷺ mengutus rombongan pasukan di bawah pimpinan Abdullah bin Jahsy menuju lembah Nakhlah untuk menyelidiki situasi dan keadaan orang-orang kafir. Allah Ta’ala berkehendak mempertemukan pasukan Abdullah bin jahsy dengan pasukan orang-orang Quraisy, akhirnya terjadilah peperangan dan terbunuhlah salah satu dari pasukan Quraisy yang bernama ‘Amr Al-Hadhromiy serta menawan dua orang, kemudian mereka kembali. Peristiwa itu terjadi pada hari terakhir bulan Jumadal Tsaniyah atau malam pertama pada bulan Rajab. Maka tersiarlah berita bahwa Muhammad menghalalkan bulan haram untuk berperang, dan hal itu juga disebarluaskan serta diulang-ulang oleh orang-orang Yahudi dan munafik di Madinah. Sampai Rasulullah membiarkan saja pasukan dan tawanan itu, tidak memutuskan apapun mengenai mereka. Abdullah bin Jahsy dan pasukannya menuai banyak kritikan serta celaan dari banyak orang. Perkaranya terus seperti itu sampai Allah Ta’ala menurunkan dua ayat ini : “Mereka bertanya kepadamu tentang berperang pada bulan Haram.” Maknanya bertanya tentang berperang di bulan haram, maka jawablah wahai rasul dan katakan kepada mereka bahwa berperang di bulan tersebut merupakan dosa besar. Akan tetapi, menghalangi orang dari agama Allah, kufur kepada Allah dan menghalangi orang untuk menuju Masjidil Haram, serta mengusir Rasul dan orang-orang yang beriman dari kota Mekah padahal mereka adalah penduduk asli yang berhak, lebih besar dosanya dalam hukum Allah. Sebagaimana kesyirikan orang musyrik di tanah haram, serta fitnah kepada kaum muslimin agar mereka murtad dan kembali ke dalam agamanya yang lama dengan berbagai bentuk intimidasi dan siksaan, lebih parah dibandingkan membunuh di bulan haram. Selain itu, mereka juga bertekad untuk memerangi orang-orang mukmin dan mengembalikan mereka kepada agama yang lama apabila mereka mampu. Kemudian Allah Ta’ala mengabarkan kepada orang-orang mukmin dan memeperingatkannya agar tidak murtad dari agama, sebesar apapun ujian yang didapatkan dalam agamanya, apabila tidak bertaubat akan mati dalam keadaan kafir dan amalan sholehnya tidak berguna sama sekali, sehingga akan termasuk dalam golongan penghuni neraka yang kekal di dalamnya selamanya. Inilah kandungan pada ayat 217. Pelajaran dari ayat: • Keharaman bulan haram dan tanah haram • Dinasakhnya peperangan di bulan haram berdasarkan dali bahwa Rasulullah ﷺ memerangi Hawaazim dan Tsaqif pada bulan syawal dan awal Dzulqo’dah yaitu pada bulan-bulan haram. • Menelanjangi mentalitas orang kafir, yaitu kemauan mereka untuk terus memerangi kaum muslimin sampai mereka keluar dari agama Islam dan kembali ke agama nenek moyang. • Keluar dari agama (murtad) akan menghapuskan amalan, apabila seorang yang murtad bertaubat maka amalannya dihitung dari yang baru, akan tetapi apabila mati sebelum bertaubat maka ia termasuk golongan ahli neraka yang kekal di sana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 217: Allah mengabarkan bahwasannya orang-orang musyrik bertanya kepada nabi ﷺ tentang bulan haram, apakah diperbolehkan berperang padanya? pada saat itu mereka bertanya tentang 4 bulan yang tidak boleh atau diharamkan padanya berperang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rasulullah shallallahu 'alaihi wa sallam pada awal pengiriman sariyyah (pasukan kecil) pernah mengutus sariyyah yang dipimpin oleh Abdullah bin Jahsy, lalu sariyyah itu memerangi kaum musyrik dan membunuh Amr bin Al Hadhramiy pada hari terakhir bulan Jumadil Akhir, sedangkan awal bulan Rajab masih samar bagi mereka, lalu kaum kafir mencelanya karena telah menghalalkan kehormatan bulan haram, maka turunlah ayat di atas menerangkan bahwa menghalangi manusia dari jalan Allah, yakni menghalangi mereka untuk beriman kepada Allah dan rasul-Nya atau menyiksa orang yang beriman serta usaha mereka untuk memurtadkan kaum muslimin dari agamanya, mengusir kaum muslimin dari kampung halamannya dan kekafiran yang mereka lakukan baik di bulan haram maupun di tanah haram itu lebih besar dosanya di sisi Allah daripada pembunuhan yang terjadi di bulan haram. Jumhur ulama berpendapat bahwa haramnya mengadakan peperangan di bulan-bulan haram sudah mansukh (dihapus) hukumnya karena ada perintah memerangi kaum musyrikin di mana saja kita dapatkan. Namun sebagian mufassirin berpendapat tidak dihapus, karena yang mutlak harus dibawa kepada yang muqayyad. Ayat ini adalah muqayyad; yang membatasi keumuman perintah berperang secara mutlak, di samping itu di antara keistimewaan yang paling besar bulan haram adalah haramnya berperang pada bulan itu, yakni memulai berperang. Adapun perang sebagai pembelaan, maka dibolehkan baik di bulan haram maupun di tanah haram. Seperti mengancam dan menindas orang yang masuk Islam. Jika kita mengikuti pendapat Ar Razy, maka terjemah ayat di atas sebagai berikut: Katakanlah: \"Berperang dalam bulan itu adalah dosa besar, dan (berarti) menghalangi (manusia) dari jalan Allah, kufur kepada Allah serta (menghalangi manusia dari) Masjidilharam. Tetapi mengusir penduduknya dari Masjidilharam (Mekah) lebih besar lagi (dosanya) di sisi Allah.\" Pendapat Ar Razy ini mungkin berdasarkan pertimbangan, bahwa mengusir Nabi dan sahabat-sahabatnya dari Masjidilharam sama dengan menumpas agama Islam. Fitnah di sini berarti penganiayaan dan segala perbuatan yang dimaksudkan untuk menindas Islam dan muslimin. Ada juga yang mengartikan fitnah di sini dengan syirk. Niat memurtadkan umat Islam ada pada diri orang-orang kafir, khususnya ahlul kitab dari kalangan Yahudi dan Nasrani, di mana meereka mengadakan pertemuan, menyebarkan missionaries, mengirimkan dokter, membangun sekolah dan memberikan sembako serta mengadakan kegiatan lainnya agar dapat memurtadkan umat Islam dari agamanya, akan tetapi Allah Subhaanahu wa Ta'aala tidak menghendaki selain menyempurnakan cahaya-Nya meskipun orang-orang kafir benci. Amalnya sudah tidak dianggap lagi dan tidak memperoleh pahala. Dibatasi dengan kata-kata \" lalu dia mati dalam kekafiran \" menunjukkan bahwa jika sebelum matinya ia kembali lagi ke Islam, maka amalnya tidak batal dan akan diberi pahala serta tidak wajib mengulangi kewajiban seperti haji. Inilah pendapat yang dipegang oleh Imam Syafi'i."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 217",
    "description": "Ayat ini turun ketika tentara islam yang dipimpin oleh abdulla'h bin jahsy berperang melawan orang-orang kafir di permulaan bulan rajab, satu dari empat bulan haram. Mereka lalu bertanya kepadamu, wahai nabi Muhammad, tentang boleh-tidaknya berperang pada bulan haram. Katakanlah, berperang dalam bulan itu adalah dosa besar. Tetapi, ada yang lebih besar lagi dosanya, yaitu menghalangi orang beriman dari jalan Allah, yakni melaksanakan perintah-Nya, ingkar kepadanya, menghalangi orang masuk masjidilharam, dan mengusir penduduk dari sekitarnya. Itu semua lebih besar dosanya dalam pandangan Allah. Dan fitnah, yaitu kemusyrikan dan menindas orang mukmin, itu lebih kejam daripada pembunuhan dalam peperangan. Mereka tidak akan berhenti memerangi kamu sampai kamu murtad keluar dari agamamu, jika mereka sanggup mengeluarkanmu dari agamamu. Janganlah sekali-kali kamu murtad dari agamamu walaupun mereka tidak akan berhenti memerangimu, sebab barang siapa murtad di antara kamu dari agamanya, yakni keluar dari islam, lalu dia mati dalam kekafiran, maka mereka itu sia-sia amalnya di dunia dan di akhirat. Tidak ada pahala bagi amalnya, dan mereka itulah penghuni neraka; mereka kekal di dalamnya. Sesungguhnya orang-orang yang beriman kepada Allah dan rasulnya, dan orang-orang yang berhijrah meninggalkan negeri dan keluarganya untuk menegakkan agama Allah dan berjihad di jalan Allah dengan memerangi orang-orang musyrik, mereka itulah orang-orang yang mengharapkan rahmat dan ganjaran Allah. Allah maha pengampun kepada orang-orang yang beriman, lagi maha penyayang."
  }
]