[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan Rasulnya dan melaksanakan syariatnya, dan mereka meninggalkan kampung halaman mereka dan mereka berjihad di jalan Allah, mereka itu adalah orang-orang yang berharap besar memperoleh karunia Allah dan pahala Nya. Dan Allah maha pengampun terhadap dosa-dosa hamba-hamba Nya yang Mukmin, maha penyayang terhadap mereka dengan rahmat yang luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "218. Sesungguhnya orang-orang yang beriman kepada Allah dan Rasul-Nya, orang-orang yang meninggalkan kampung halaman mereka untuk berhijrah kepada Allah dan Rasul-Nya, dan orang-orang yang berperang untuk meninggikan kalimat Allah setinggi-tingginya, mereka itu sangat mengharapkan rahmat dan ampunan dari Allah. Dan Allah Maha Pengampun atas dosa hamba-hamba-Nya dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "218. Orang-orang beriman yang beramal shalih, meninggalkan keluarga dan tempat tinggalnya, dan berperang melawan musuh demi meninggikan kalimat Allah, mereka adalah orang-orang yang mendapat derajat yang tinggi yang mengharap pahala dan keutamaan dari Allah. Dan Allah Maha Mengampuni dosa hamba-hamba-Nya, dan Maha Menyayangi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "218. هَاجَرُوا۟ (orang-orang yang berhijrah) Yakni dari negeri kafir menuju negeri Islam. أُو۟لٰٓئِكَ يَرْجُونَ رَحْمَتَ اللَّـهِ ۚ (mereka itu mengharapkan rahmat Allah) Ayat ini diturunkan untuk pasukan Abdullah bin Jahsy, yang mana mereka berkata kepada Rasulullah: apakah kami boleh mengharapkan diberi pahala para mujahidin dalam peperangan ini? Maka Allah memberi tahu mereka bahwa mereka mengharapkan pahala itu karena keimanan, hijrah, dan jihad mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seseorang yang mengharapkan sesuatu maka harapannya itu membutuhnya tiga perkara penting : cinta akan harapannya, dan takun akan terlewatkan dari harapannya, dan usahanya untuk meraih harapan itu sebisa mungkin, sedangkan harapan yang sama sekali tidak disandingkan satupun dari perkara tersebut maka sesungguhnya harapan itu sebatas mimpi, dan siapapun yang mengarapkan sesuatu ada perasaan takut dan khawatir dalam dirinya, sama halnya dengan orang yang berjalan diatas jalan ketika ia merasa takut akan mempercepat jalannya takut akan sesuatu yang ia harapkan terlewatkan. 2 ). Perhatikanlah bagaimana mereka menjadikan harapan mereka sebab datangnya ketaatan-ketaatan! karena harapan dan berbaik sangka akan terwujud dengan sebab-sebab yang disepakati oleh syari'at, maka seorang hamba hendaknya melaksanakan semua sebab-sebab itu baru kemudian berbaik sangka kepada tuhannya, dan mengharap agar tuhannya menjadikan sebab-sebab itu sebagai sarana datangnya manfaat bagi dirinya serta mengindarkan segala hal yang bertentangan dengan sebab-sebab itu. 3 ). Setelah Allah mensifati hamba-hamba Nya dengan sifat-sifat yang istimewa itu Dia berkata : { أُو۟لٰٓئِكَ يَرْجُونَ } \"mereka itu mengharapkan\" mereka itu hanyalah orang-orang yang berharap, karena sesungguhnya mereka tidak mengetahui nasib mereka apakah akan ke surga sekalipun mereka telah melakukan segala upaya untuk mencapainya. 4 ). Ibnu 'Utsaimin berkata : Jika ada yang mengatakan pada ayat yang agung ini : aku mengharap rahmat dari Allah dan aku takut akan azabnya, maka perlu dilihat : apakah dia termasuk orang-orang yang memiliki sifat-sifat ini ? jika begitu maka dia benar, tetapi jika sebaliknya maka dia termasuk orang yang berangan-angan di hadapan Allah; karena sesungguhnya orang yang mengharap rahmat dari Allah hakikatnya dia harus berusaha dengan segala upaya untuk mencapainya seperti yang dijelaskan oleh ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "218. Sesungguhnya orang-orang yang beriman kepaa Allah dan rasulullah, dan berhijrah dari kekufuran menuju Islam, serta berjihad untuk meninggikan kalimat Allah maka bagi mereka itu rahmat Allah yang diberikan sebagai suatu kemuliaan dan keutamaan. Dan Allah itu Maha Pengampun, dan Maha Pengasih kepada hamba-hambaNya. Ayat ini turun untuk pasukan Abdullah bin Jahsh yang membunuh Al-Hadramiy di bulan Rajab sebelum perang badar. Mereka berkata: “Wahai Rasulullah, Apakah kami bisa mendambakan pahala orang-orang yang berjihad melalui peperangan ini?” Lalu Allah SWT memberitahu mereka bahwa mereka itu sangat mendambakan pahala itu karena keimanan, hijrah dan jihad mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman serta orang-orang yang berhijrah dan berjihad di jalan Allah, mereka itu mengharapkan rahmat Allah. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "218. Amalan-amalan yang 3 tersebut merupakan tanda-tanda kebahagiaan dan poros utama penghambaan. Dengan semua itu dapat diketahui keuntungan dan kerugian yang diderita seorang manusia. Adapun tentang keimanan, maka tidaklah perlu Anda bertanya lagi tentang keutamaannya, dan bagaimana menanyakan suatu hal yang merupakan pembeda antara orang-orang yang bahagia dari orang-orang yang sengsara? demikian juga pembeda antara penghuni surga dan penghuni neraka. Dan iman itulah yang apabila ada pada seorang hamba, niscaya amalan kebaikannya diterima, dan bila tidak ada, niscaya tidak akan diterima dari tindakan, keadilan, kewajiban, dan Sunnah. Hijrah adalah meninggalkan orang-orang yang dicintai dan disayangi hanya untuk mencari ridho Allah. Maka seorang yang berhijrah meninggalkan negeri, harta, keluarga, dan teman sejawatnya sebagai suatu pendekatan diri kepada Allah dan pembelaan terhadap agamaNya. Jihad adalah mengerahkan upaya dalam memerangi musuh, dan usaha yang maksimal dalam membela agama Allah dan memberantas ajaran setan. Jihad itu adalah puncak dari segala amal sholeh dan balasannya adalah balasan yang paling utama, dan sebab paling dominan untuk memperluas negeri Islam, menghinakan hamba-hamba berhala, menciptakan keamanan bagi kaum muslimin pada diri, harta, dan anak-anak mereka. Barangsiapa yang menegakkan 3 perbuatan tersebut dengan menghadapi segala kesulitan dan rintangannya, maka perbuatan-perbuatan selainnya akan lebih ditegakkan dan disempurnakan. Karena itu pantaslah bagi mereka untuk menjadi orang-orang yang mengharap rahmat Allah, karena mereka telah melakukan sebab yang mengharuskan adanya rahmat bagi mereka. Disini terdapat dalil bahwasanya harapan itu tidaklah dilakukan kecuali setelah melakukan sebab-sebab kebahagiaan. Sedangkan harapan yang diiringi dengan sifat malas dan tidak melakukan sebab-sebabnya adalah merupakan kelemahan, angan-angan kosong dan bualan, dan itu menunjukkan lemahnya cita-cita pelakunya, kurangnya akal, sama seperti orang yang menghendaki seorang anak tanpa menikah, dan mengharapkan hasil panen tanpa menanam biji dan tidak menyiramnya, dan semacamnya. Dalam firman Allah, “mereka itu mengharapkan rahmat Allah,” terkandung sebuah isyarat bahwa seorang hamba itu walaupun telah banyak melakukan amal, tidaklah baik baginya hanya bersandar pada amal-amal tersebut dan hanya berpatokan padanya, namun seharusnya ia juga mengharap rahmat Allah, diterimanya amal amal tersebut, ampunan bagi dosa-dosanya, dan ditutupi aib dan kekurangannya. Karena Allah itu berfirman, “Dan Allah maha pengampun,” artinya, bagi yang bertaubat secara benar benar, “lagi maha penyayang.” RahmatNya luas melingkupi segala sesuatu, kedermawanan dan kebajikanNya menyeluruh kepada setiap makhluk hidup. Disini terdapat dalil bahwa orang yang mengerjakan amalan amalan tersebut akan memperoleh ampunan Allah. Karena kebaikan itu akan menghapus dosa-dosa dan ia mendapatkan rahmat dari Allah. Apabila ia telah mendapat ampunan, niscaya ia akan terhindar dari hukuman dunia dan akhirat yang merupakan manifestasi dari dosa-dosa yang telah diampuni, dan bekas-bekasnya tidak lenyap. Apabila ia memperoleh rahmat, maka ia telah memperoleh segala kebaikan di dunia maupun di akhirat, Bahkan amalan-amalan mereka tersebut juga merupakan rahmat Allah terhadap mereka. Karena kalau bukan karena Taufik Allah bagi malaikat dalam hal itu, niscaya mereka tidak akan menginginkannya, dan sekiranya bukan karena kemampuan dan diberikan Allah untuk mereka dalam melakukannya, niscaya mereka tidak akan mampu melakukannya, dan kalau bukan karena kebajikanNya, niscaya Dia tidak menyempurnakannya dan tidak menerimanya dari mereka. Karena itu, bagiNya segala keutamaan yang pertama dan yang terakhir, dan Dialah yang mengaruniakan sebab dan akibat Allah kemudian berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { هَاجَرُواْ } Haajaru : Meninggalkan tempat tinggal karena takut tertimpa fitnah dan pemaksaan dalam agama Allah. Makna ayat: Adapun ayat 218 “Sesungguhnya orang-orang yang beriman dan berhijrah”, maka ayat ini turun mengenai Abdullah bin Jahsy dan rekan-rekannya. Allah Ta’ala menenangkan mereka dengan kabar bahwa mereka tidang menanggung dosa karena berperang di bulan haram, seperti anggapan buruk orang-orang kepada mereka. Mereka sejatinya mengharapkan rahmat Allah yaitu surga, dan Allah Ta’ala mengampuni dosa-dosanya dan berkasih sayang kepada mereka. Hal itu berasal dari keimanan dan hijrahnya mereka serta jihadnya di jalan Allah. Allah Ta’ala berfirman : “Sesungguhnya orang-orang yang beriman, orang-orang yang berhijrah, dan berjihad di jalan Allah, mereka itu mengharapkan rahmat Allah, dan Allah maha pengampun lagi maha penyayang.” Pelajaran dari ayat: • Penjelasan mengenai keutamaan beriman, berhijrah, dan berjihad di jalan Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": "/"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 218: Allah mengabarkan bahwasannya mereka yang beriman kepada Allah dan rasul-Nya dan yang meninggalkan negeri mereka serta berhijrah dan berjihad dijalan Allah mereka adalah orang-orang yang berharap rohmat Allah yaitu dengan dimasukkan kedalam surga, dan Allah Maha besar ampunannya dan luar rohmatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika sariyyah mengira bahwa jika mereka dihapuskan dari dosa, namun mereka tidak memperoleh pahala, maka turunlah ayat ini sebagai kabar gembira bagi mereka.. Iman, hijrah dan jihad merupakan tanda kebahagiaan, awalnya iman, dilanjutkan dengan hijrah kemudian jihad. Hal ini menunjukkan peningkatan yang besar pada diri seseorang. Ketiganya merupakan amal shalih yang sangat utama, oleh karena itu keburukan yang terjadi pada diri orangnya masih bisa dikalahkan oleh ketiga amalan ini. Adapun iman, maka kita tidak perlu menanyakan lagi tentang keutamaannya, bukankah ia merupakan pemisah antara orang-orang yang bahagia dengan orang-orang yang celaka. Dengan iman, amal baik seorang hamba akan diterima. Adapun hijrah, seseorang rela meninggalkan apa saja yang dicintainya karena mengharap ridha Allah, ia rela meninggalkan tanah air, harta, keluarga dan kawan-kawannya karena hendak mendekatkan diri kepada Allah dan membela agama-Nya. Sedangkan jihad, seseorang mengerahkan segala kemampuannya untuk memerangi musuh, berusaha sekuat tenaga untuk menegakkan agama Allah dan menghancurkan agama setan. Jihad merupakan puncak amalan, balasan untuknya adalah balasan yang paling baik. Ia merupakan sebab utama memperluas wilayah Islam, merendahkan para penyembah patung dan dapat mengamankan kaum muslimin baik diri, harta maupun keluarga mereka dan tanah airnya. Yakni karunia Allah dan pahala-Nya. Dalam ayat ini terdapat dalil bahwa sikap raja' (berharap) tidaklah dilakukan kecuali setelah mengerjakan sebab-sebab memperoleh keberuntungan. Adapun rajaa' yang diiringi sikap malas dan tidak mengerjakan sebab, maka hal ini merupakan kelemahan dan ghurur (tipuan). Hal itu menunjukkan lemahnya semangat yang ada pada diri sesesorang dan lemah akalnya. Tidak bedanya dengan orang orang yang ingin punya anak, tetapi tidak menikah atau menginginkan hasil dari tanahnya, namun tanahnya tidak ditaburi benih dan tidak disirami. Pada kata-kata \" mereka itulah yang mengharapkan rahmat Allah\" terdapat isyarat bahwa jika seorang hamba mengerjakan amalan apa pun bentuknya, jangan sampai bersandar dan bergantung kepada amalan itu, bahkan hendaknya ia mengharapkan rahmat Tuhannya, ia mengharap agar amalnya diterima, diampuni dosa-dosanya dan aib-aibnya ditutupi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 218",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan rasulnya, dan orang-orang yang berhijrah meninggalkan negeri dan keluarganya untuk menegakkan agama Allah dan berjihad di jalan Allah dengan memerangi orang-orang musyrik, mereka itulah orang-orang yang mengharapkan rahmat dan ganjaran Allah. Allah maha pengampun kepada orang-orang yang beriman, lagi maha penyayang. Mereka menanyakan kepadamu, wahai nabi, tentang khamar, yaitu semua minuman yang memabukkan, dan berjudi. Pertanyaan itu muncul antara lain karena di antara rampasan perang yang diperoleh pasukan pimpinan abdulla'h bin jahsy seperti disinggung pada ayat 217 terdapat minuman keras. Katakanlah, pada keduanya terdapat dosa, yakni mudarat yang besar. Keduanya menimbulkan permusuhan dan menyebabkan kaum muslim melupakan Allah dan enggan menunaikan salat. Dan keduanya juga mengandung beberapa manfaat bagi manusia, seperti keuntungan dari perdagangan khamar, kehangatan badan bagi peminumnya, memperoleh harta tanpa susah payah bagi pemenang dalam perjudian, dan beberapa manfaat yang diperoleh fakir miskin dari perjudian pada zaman jahiliah. Tetapi dosanya, yakni mudarat yang ditimbulkan oleh khamar dan judi, lebih besar daripada manfaatnya. Khamar diharamkan dalam islam secara berangsur. Ayat ini menyatakan bahwa minum khamar dan berjudi adalah dosa dengan penjelasan bahwa pada keduanya terdapat manfaat, tetapi mudaratnya lebih besar daripada manfaat itu. Surah an-nisa''/4: 43 dengan tegas melarang minum khamar, tetapi terbatas pada waktu menjelang salat. Surah al-ma''idah/5: 90 dengan tegas mengharamkan khamar, berjudi, berkorban untuk berhala dan mengundi nasib dan menyatakan bahwa semuanya adalah perbuatan keji dan termasuk perbuatan setan yang harus dijauhi selamanya oleh orang-orang beriman. Bagian akhir ayat ini menjelaskan ketentuan menafkahkan harta di jalan Allah. Dan mereka menanyakan kepadamu tentang apa yang harus mereka infakkan di jalan Allah. Katakanlah, kelebihan dari apa yang diperlukan untuk memenuhi kebutuhan diri dan kebutuhan keluarga. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu memikirkan."
  }
]