[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum muslimin bertanya kepadamu (wahai nabi), hukum memanfaatkan khamr ( minuman keras) untuk dikonsumsi dan diperjualbelikan. Dan khamr adalah semua apa saja yang memabukkan lagi menghilangkan dan menutup akal, baik berupa minuman ataupun makanan, dan mereka bertanya kepadamu tentang hukum berjudi,(yaitu mengambil harta atau menyerahkannya dengan dasar perjudian, dan ini satu jenis permainan adu kemenangan yang di dalamnya terdapat bentuk taruhan dari kedua belah pihak). katakanlah kepada mereka,\"pada keduanya terdapat banyak kerusakan yang ditimbulkannya terhadap agama, dunia, akal, dan harta, dan pada keduanya terdapat beberapa manfaat bagi manusia dari sisi perolehan harta dan lainnya, namun dosa akibat keduanya lebih besar daripada aspek pemanfaatannya.karena bisa menghalangi dari dzikir kepada Allah dan dari mengerjakan sholat, dan bisa menyebabkan terjadinay permusuhan dan kebencian diantara manusia, dan bisa menghabiskan harta\". Dan ayat ini adalah merupakan pendahuluan untuk mengharamkan keduanya. Dan Mereka bertanya kepadamu tentang ukuran dari harta mereka yang mereka infakkan sebagai sumbangan dan sedekah. katakanlah kepada mereka,\" infakkanlah sebesar ukuran yang telah berlebih dari kebutuhan kalian.\" Dengan penjelasan yang gamblang seperti inilah Allah menerangkan kepada kalian ayat-ayat dan hukum-hukum syariat Nya Agar kalian berpikir tentang apa yang akan bermanfaat bagi kalian di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "219. Sahabat-sahabatmu -wahai Nabi- bertanya kepadamu tentang khamar (yaitu segala sesuatu yang bisa menutupi dan menghilangkan akal sehat). Mereka bertanya kepadamu tentang hukum meminum, menjual dan membelinya. Mereka juga bertanya kepadamu tentang hukum berjudi (yaitu harta yang didapatkan melalui persaingan di mana kedua pihak yang bersaing sama-sama mengeluarkan dana). Katakanlah untuk menjawab pertanyaan mereka, “Keduanya (khamar dan judi) mengandung banyak sekali mudarat dan mafsadahnya, baik dalam lingkup agama maupun dunia, seperti hilangnya akal (kesadaran) dan harta benda, terjerumus ke dalam permusuhan dan kebencian. Namun keduanya juga memiliki sedikit manfaat, seperti keuntungan materi. Akan tetapi dampak buruk dan dosa yang ditimbulkan keduanya lebih besar dari manfaatnya. Dan sesuatu yang bahayanya lebih besar daripada manfaatnya akan dijauhi oleh orang yang berakal sehat.” Penjelasan dari Allah ini merupakan persiapan bagi pengharaman khamar. Dan sahabat-sahabatmu juga bertanya kepadamu -wahai Nabi- tentang jumlah harta yang mereka infakkan secara sukarela (tidak wajib)? Katakanlah untuk menjawab pertanyaan mereka, “Infakkanlah harta yang lebih dari kebutuhanmu.” Pada mulanya ketentuan inilah yang berlaku. Setelah itu Allah mensyariatkan zakat yang wajib dalam jenis-jenis harta tertentu dan dalam nisab tertentu. Dengan penjelasan yang sangat jelas seperti inilah Allah menjelaskan hukum-hukum syariat agar kalian berfikir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "219-220. Hai Rasulullah, kaum muslimin bertanya kepadamu hukum meminum khamr, yaitu segala sesuatu yang dapat menutupi akal; mereka juga bertanya tentang hukum qimar, yaitu bermain judi. Katakanlah kepada mereka: bahwa perbuatan itu mengandung dosa yang besar dan mudharat yang banyak, meskipun sedikit membawa keuntungan harta bagi kalian, namun itu adalah harta yang buruk. Kemudharatannya jauh lebih besar daripada manfaatnya, karena dapat menghalangi seseorang dari berzikir kepada Allah dan shalat, dan menimbulkan permusuhan. Ayat ini merupakan tahapan dari pengharaman khamr dan qimar. Mereka juga bertanya tentang takaran harta yang harus diinfakkan di jalan Allah. Maka katakanlah: “infakkanlah harta sisa dari kebutuhan dan nafkah keluarga. Demikianlah Allah menjelaskan ayat-ayat dan hukum-hukum kepada kalian, agar kalian mencermati kebahagiaan di kehidupan dunia dan akhirat. Syeikh as-Syinqithi berkata: dalam firman Allah {قل فيهما إثم كبير}, Dia tidak menjelaskan apa yang dimaksud dengan dosa besar. Namun Dia menjelaskannya dalam ayat lain, yaitu penjerumusan dalam permusuhan dan perselisihan, dan penghalang dari berzikir dan shalat; hal ini Allah jelaskan pada surat al-Maidah ayat 91: إِنَّمَا يُرِيدُ الشَّيْطَانُ أَنْ يُوقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللَّهِ وَعَنِ الصَّلَاةِ ۖ فَهَلْ أَنْتُمْ مُنْتَهُونَ Sesungguhnya syaitan itu bermaksud hendak menimbulkan permusuhan dan kebencian di antara kamu lantaran (meminum) khamar dan berjudi itu, dan menghalangi kamu dari mengingat Allah dan sembahyang; maka berhentilah kamu (dari mengerjakan pekerjaan itu). Kaum muslimin juga bertanya tentang interaksi dan pengurusan anak-anak yatim dan harta mereka. Maka jawablah: berinteraksi dengan mereka untuk mendidik mereka dan menjaga harta mereka lebih baik daripada menyia-nyiakan mereka. Dan tidak mengapa jika kalian mencampur harta mereka dengan harta mereka, sebab mereka adalah saudara kalian seagama, dan seorang saudara wajib menjaga kemaslahatan bagi saudaranya. Dan Allah Maha Mengetahui siapa yang hendak melenyapkan harta mereka dengan memakannya atau menghabiskannya, dan Maha Mengetahui siapa yang hendak mengembangkan dan menjaganya. Dan ini merupakan janji dan ancaman dari Allah. Andai saja Allah menghendaki niscaya Dia akan membuat kalian lebih susah dengan mengharamkan kalian mencampur harta kalian dengan harta anak-anak yatim, namun Allah memudahkan urusan kalian. Sungguh Allah Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam pengaturan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "219-220. يَسْـَٔلُونَكَ عَنِ الْخَمْرِ (Mereka bertanya kepadamu tentang khamar) (الخمر) adalah air anggur yang dibiarkan sampai mendidih dengan sendirinya tanpa dipanaskan dengan api. Dan segala yang dapat menghilangkan akal termasuk dalam hukum khamr. وَالْمَيْسِرِ (dan judi) Undian orang-orang arab menggunakan anak panah, dan mereka dahulu mengundinya atas daging unta, dan siapa yang memenangkannya, membaginya untuk orang-orang fakir di pemukiman. Dan anak panah tersebut terbuat dari potongan kayu. Adapun pengundiannya dilakukan dengan cara tertentu (lihat: Lisanul Arab-يسر). Sekelompok salaf mengatakan: segala sesuatu yang terdapat unsur undian (mengambil hadiah lewat permainan, yang menang akan mengambil dari yang kalah) berupa permainan dadu, catur, atau lainnya merupakan perjudian, sampai pada permainan anak-anak menggunakan kacang pohon dan telur. قُلْ فِيهِمَآ إِثْمٌ كَبِيرٌ (Katakanlah: “Pada keduanya terdapat dosa yang besar) Yakni dalam khamr dan perjudian. Adapun dosa meminum khamr karena berasal dari kerusakan akal yang mengakibatkan pertikaian, caci maki, perkataan kotor, bohong, dan meninggalkan shalat dan segala kewajiban. Sedangkan dosa perjudian: kemiskinan, hilangnya harta, permusuhan, dan ketakutan hati. Adapun manfaat khamr adalah keuntungan dalam jual belinya, kenikmatan yang didapatkan saat mengkonsumsinya, kekuatan jantung, dan perbaikan lambung. Sedangkan manfaat perjudian: manfaat yang didapat oleh-orang miskin. وَإِثْمُهُمَآ أَكْبَرُ مِن نَّفْعِهِمَا ۗ (tetapi dosa keduanya lebih besar dari manfaatnya) Karena tidak ada kebaikan jika dibandingkan dengan kerusakan akal akibat meminum khamr. Dan tidak ada kebaikan dari perjudian jika dibandingkan dengan resiko kehilangan harta benda, kemungkinan menjadi miskin, mengundang permusuhan antar orang muslim, mengakibatkan pertumpahan darah, dan pelanggaran terhadap kehormatan. وَيَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ قُلِ الْعَفْوَ ۗ (Dan mereka bertanya kepadamu apa yang mereka nafkahkan) Yakni dari sisa nafkah yang diberikan kepada keluarga. لَعَلَّكُمْ تَتَفَكَّرُونَ فِى الدُّنْيَا (supaya kamu berfikir tentang dunia) Yakni sehingga kalian menahan harta kalian untuk maslahat kehidupan dunia kalian, dan menginfakkan sisanya untuk kehidupan akhirat. وَالْءَاخِرَةِ ۗ (dan akhirat) Sehingga kalian lebih menginginkan akhirat dari pada dunia. إِصْلَاحٌ لَّهُمْ خَيْرٌ (Mengurus urusan mereka secara patut adalah baik) Yakni lebih baik dari pada meninggalkan itu. وَإِن تُخَالِطُوهُمْ (dan jika kamu bergaul dengan mereka) Yakni apabila salah seorang anak yatim memiliki harta, dan penanggung anak yatim ini merasa kesusahan dalam memisahkan makanannya dari yang lain, sehingga dia pun mengambil harta anak itu yang dirasa itu cukup dengan penuh kehati-hatian dan mencampurnya dengan nafkah keluarganya. Dan hal ini tentu saja bisa jadi terdapat kekurangan atau kelebihan dalam mengambil harta anak yatim tersebut, namun ayat ini menunjukkan rukhshoh terhadap masalah ini. فَإِخْوٰنُكُمْ ۚ (maka mereka adalah saudaramu) Yakni maka yang demikian itu tidak mengapa karena mereka merupakan saudara-saudara kalian seagama. وَاللَّـهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ ۚ (dan Allah mengetahui siapa yang membuat kerusakan dari yang mengadakan perbaikan) Ini adalah peringatan terhadap para wali anak yatim, yakni Allah mengetahui siapa yang sengaja memakan harta anak yatim, dan siapa yang takut melakukan itu dan tidak lengah dalam memperbaiki harta anak yatim. ولو شاء لأعنتكم (Dan jikalau Allah menghendaki, niscaya Dia dapat mendatangkan kesulitan kepadamu) Yakni akan tetapi Allah mempermudah dan memperluas atas kalian dengan memperbolehkan kalian mencampur harta kalian dan harta anak-anak yatim maka hati-hatilah merusak harta mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "219. Mereka bertanya kepadamu tentang hukum khamr (yaitu air anggur yang difermentasi) dan judi (Qamar adalah jenis judi bangsa Arab dengan menggunakan Azlam, yaitu potongan kayu yang mereka gunakan untuk berjudi dengan cara tertentu di atas daging unta). Maka katakanlah kepada mereka Wahai Nabi: “Mempraktekkan kedua hal itu adalah suatu dosa besar dan merupakan suatu kerusakan yang agung karena bisa menghilangkan akal sehat dan harta. Dalam keduanya itu ada manfaat ekonomi yang sangat kecil. Manfaat khamr yaitu keuntungan dalam menjualnya dan manfaat perjudian itu bagi orang fakir. Dan dosa keduanya itu lebih besar daripada manfaatnya, karena tidak ada kebaikan yang bisa sepadan dengan kerusakan akal karena khamr, kerusakan perjudian yang bisa membahayakan harta, memberi permusuhan, dan mendekatkan diri kepada kefakiran” Mereka juga bertanya kepadamu tentang harta yang mereka infakkan di jalan Allah. Katakanlah kepada mereka: “berinfaklah secara afwa, yaitu infak yang lebih dari kebutuhan orang yang diberi” dan berinfak untuk keluarga. Dan melalui perumpamaan itu Allah menjelaskan ayat-ayatNya sipaya kalian bisa merenungi sesuatu yang yang baik bagi dunia dan akhirat kalian. Ayat pertanyaan tentang khamr dan judi turun untuk Umar, Muadz dan beberapa orang Anshar. Mereka mendatangi rasulullah SAW dan berkata: “Kami telah terjerumus dalam kerusakan khamr dan judi. Sesungguhnya keduanya itu menghilangkan akal dan merenggut harta benda” lalu turunlah ayat ini. Dan ayat pertanyaan tentang infak itu untuk sekelompok kaum mukmin Anshar ketika mereka diperintahkan untuk berinfak di jalan Allah, lalu mereka bertanya tentang harta yang mereka infakkan. Lalu turunlah ayat ini. Menurut pendapat jumhur ulamah infak tersebut adalah infak sukarela"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang khamar dan judi} perjudian {Katakanlah, “Dalam keduanya terdapat dosa besar dan beberapa manfaat bagi manusia. dosa keduanya lebih besar daripada manfaatnya.” Mereka bertanya kepadamu apa yang mereka infakkan. Katakanlah, “Kelebihannya”} katakanlah,“infakkanlah rejeki yang lebih dari yang dibutuhkan {Demikianlah Allah menerangkan ayat-ayatNya kepada kalian agar kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "219. Maksudnya, kaum mukminin bertanya kepadamu wahai rasul tentang hukum hukum khamar dan judi, di mana pada zaman Jahiliyah kedua hal tersebut sering dilakukan dan juga pada awal-awal Islam. Seolah-olah terjadi kesulitan memahami kedua perkara tersebut. Karena itu, mereka bertanya kepadamu tentang hukum-hukumnya, maka Allah memerintahkan kepada nabiNya untuk menjelaskan manfaat manfaat dan kemadharatannya kepada mereka, agar hal tersebut menjadi pendahuluan untuk pengharamannya dan wajib meninggalkan kedua perbuatan tersebut secara total. Allah mengabarkan bahwa dosa dan madharat keduanya serta apa yang diakibatkan oleh keduanya, seperti hilangnya ingatan, harta, dan menghalangi dari berdzikir kepada Allah, dari shalat, (menimbulkan) permusuhan dan saling benci, yang semua ini adalah lebih besar dari apa yang mereka sangka sebagai manfaatnya, berupa mendapatkan harta dengan berjual beli khamar atau memperolehnya dengan cara judi atau linglung nya hati saat melakukannya. Dan penjelasan ini merupakan pencegahan dari kedua perbuatan tersebut, karena seorang yang berakal akan lebih memilih sesuatu yang lebih besar, dan ia akan menjauhi sesuatu yang madharatnya lebih besar. Akan tetapi, ketika mereka sudah begitu terbiasa dengan kedua perkara tersebut dan sulit untuk meninggalkannya secara total pada awal-awalnya, maka Allah memulai hal tersebut dengan ayat ini sebagai pendahuluan menuju kepada pengharaman secara mutlak yang disebutkan dalam FirmanNya : \"Hai orang-orang yang beriman, sesungguhnya (meminum) khamar, berjudi, (berkorban untuk) berhala, mengundi nasib dengan panah, adalah termasuk perbuatan syaitan. Maka jauhilah perbuatan-perbuatan itu agar kamu mendapat keberuntungan. Sesungguhnya syaitan itu bermaksud hendak menimbulkan permusuhan dan kebencian di antara kamu lantaran (meminum) khamar dan berjudi itu, dan menghalangi kamu dari mengingat Allah dan sembahyang; maka berhentilah kamu (dari mengerjakan pekerjaan itu).\" QS al-maidah : 90-91 Ini adalah kasih sayang, rahmat, dan kebijaksanaan Allah. Oleh karena itu, ketika ayat ini turun, Umar berkata, “Kami berhenti, kami berhenti.” Khomer artinya adalah semua yang memabukkan lagi menghilangkan akal pikiran dan menutupinya, dari apapun macamnya. Sedangkan judi adalah segala macam usaha saling menyalahkan yang didalamnya terdapat taruhan dari kedua belah pihak, seperti dadu atau catur dan segala macam usaha saling mengalahkan, baik perkataan maupun perbuatan dengan taruhan, tentunya selain dari perlombaan berkuda, unta, dan memanah, karena hal itu adalah boleh, karena hal-hal tersebut sangat membantu dalam jihad, dan karena itulah Allah memberikan rukhsah padanya. Firman-Nya \"Dan mereka bertanya kepadamu apa yang mereka nafkahkan. Katakanlah: \"Yang lebih dari keperluan\". Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu supaya kamu berfikir, di dunia dan di akhirat\" Ini adalah pertanyaan tentang kadar dari harta yang harus mereka nafkahkan. Maka Allah memudahkan mereka dan memerintahkan mereka untuk menafkahkan harta yang lebih dari keperluan, yaitu yang mampu mereka nafkahkan dari harta mereka yang tidak mengganggu kebutuhan pokok mereka. Ini dikembalikan kepada setiap orang sesuai dengan kesanggupannya, baik orang kaya maupun orang miskin atau kelas ekonomi menengah. Setiap mereka memiliki kemampuan tersendiri dalam menafkahkan apa yang lebih dari kebutuhan pokoknya, walaupun hanya sepotong kurma. Karena itulah Allah memerintahkan kepada rasulNya untuk memungut harta-harta yang lebih dari kebutuhan pokok mereka dan dari sedekah sedekah mereka, dan agar beliau tidak memberatkan mereka dari apa yang tidak mampu mereka nafkahkan. Itu karena allah tidaklah memerintahkan kita dengan apa yang diperintahkanNya itu karena keperluan dariNya bagi kita atau sebagai tanggungjawab bagi kita dengan perkara yang berat, akan tetapi Allah memerintahkan kita dengan apa yang membuat kita bahagia dan yang mudah bagi kita, serta yang memiliki manfaat untuk kita dan untuk saudara-saudara kita. Karena itu Allah berhak atas segala pujian yang paling sempurna. Dan ketika Allah menjelaskan penjelasan yang lengkap ini dan menampakan kepada hamba-hambanya rahasia-rahasia di balik syariatNya, Dia berfirman, “demikianlah Allah menerangkan ayat-ayatNya kepadamu,” yakni, yang menunjukkan kepada kebenaran yang menghasilkan ilmu yang bermanfaat dan menjadi pembeda (antara yang hak dengan yang batil), “supaya kamu berpikir, tentang dunia dan akhirat.” Maksudnya, agar kalian menggunakan pikiran kalian terhadap rahasia-rahasia Syariat Allah, dan agar kalian mengetahui bahwa perintah perintahNya mengandung kemaslahatan dunia dan akhirat, juga agar kalian berpikir tentang dunia dan kemusnahan nya yang cepat, hingga kalian menolaknya, dan tentang akhirat dan keabadiannya dan bahwasanya akhirat itu adalah tempat pembalasan, hingga kalian mempersiapkannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلۡخَمۡرِ } Al-Khomr : Setiap dzat yang membuat akal menjadi tertutup dan mengakibatkan orang yang meminumnya tidak bisa berpikir dan membedakan sesuatu. Kata khamr digunakan pada perasan anggur, kurma, gandum, dan selainnya. { وَٱلۡمَيۡسِرِۖ } Al-Maisir : Perjudian, dan dinamakan sebagai maisir karena pelakunya mendapatkan uang dengan gampang dan mudah. { الإثم } Al-Itsm : Setiap hal yang membahayakan dan merusak diri, akal pikiran, badan, harta, ataupun kehormatan. { المنافع } Al-Manafi’ : Bentuk jamak dari manfa’ah, yaitu setiap hal yang mudah dan tidak membahayakan baik dalam bentuk perkataan, perbuatan, ataupun material. { العفو } Al-‘Afwu : Maksud dari al-‘Afwu di sini adalah kelebihan dan pertambahan harta manusia. { تتفكرون } Tataffakarun : Maka engkau mengetahui apa yang bermanfaat di antara keduanya dan engkau menggunakannya untuk kepentingan duniawi kalian, dan engkau menggunakannya untuk kepentingan akhirat dan hal yang membahagiakan di sana, serta menyelamatkan kalian dari azab neraka. Makna ayat : Dahulu orang-orang Arab jahiliyah senang meminum khomer dan berjudi, maka datanglah agama Islam dengan memulai dakwahnya menyeru mereka kepada tauhid dan keimanan kepada hari kebangkitan (kiamat) karena keduanya merupakan faktor yang paling kuat untuk mendorong manusia agar istiqomah di dalam hidupnya. Ketika Rasulullah ﷺ dan para sahabatnya berhijrah ke Madinah, maka dimulailah kehidupan masyarakat yang Islami dan turunlah hukum-hukum syariat secara berangsur-angsur. Pada suatu hari ada salah seorang sahabat yang mengimami shalat berjama’ah, namanya adalah Tsamlan, dan terjadilah kekacauan karena ia salah membaca ayat, maka turunlah ayat dalam surat An-Nisa: Artinya: “Wahai orang-orang yang beriman, janganlah kamu shalat, sedang kamu dalam keadaan mabuk.” (QS An-Nisa: 43) akhirnya mereka tidak meminum khomer kecuali pada waktu-waktu tertentu saja. Muncullah banyak pertanyaan seputar meminum khomer, maka turunlah ayat : “Mereka bertanya kepadamu tentang khomer dan perjudian.” Allah Ta’ala menjawab pertanyaan mereka dengan firman Nya: “Katakanlah, pada keduanya itu terdapat dosa besar dan beberapa manfaat bagi manusia, tetapi dosa keduanya lebih besar dari manfaatnya.” Setelah itu banyak yang meninggalkan minum khomer dan berjudi karena ayat ini. Dan tinggallah beberapa gelintir orang saja yang melakukannya. Ketika itu Umar melihat perlunya ada larangan yang jelas dan tegas, sampai-sampai ia mengatakan, “Ya Allah, terangkanlah kepada kami mengenai khomer dengan penjelasan yang jelas.” Allah mengabulkan doa Umar dan turunlah ayat dalam surat Al-Maidah : “Wahai orang-orang yang beriman, sesungguhnya (meminum) khomer dan judi...” (90) sampai firman Nya, “maka berhentilah kamu (dari) mengerjakan pekerjaan itu.” (91) maka Umar mengatakan, “Kami berhenti ya Allah” dengan ayat itu diharamkanlah khomer dan perjudian dengan pengharaman yang tetap dan sempurna, dan Rasulullah menetapkan hukuman berupa cambuk bagi orang yang meminum khomer dan berjudi, serta memperingatkan peminumnya dengan menamakannya sebagai induk keburukan (ummul khobâits) dan beliau bersabda, ”Pecandu khomer tidak diajak bicara oleh Allah pada hari kiamat dan tidak pula menjamin (keselamatan) tiga golongan, yaitu orang yang durhaka kepada kedua orangtuanya, orang yang memakai kain sarungnya melebihi matakaki (isbal) sehingga menyeretnya di tanah, dan pecandu minuman khomer.” Firman Nya, “Di dalam keduanya ada dosa yang besar dan ada manfaat bagi manusia.” Hal ini sejalan dengan firman Allah Ta’ala dalam surat Al-Maidah mengenai sumber dosa, yaitu keduanya menyebabkan permusuhan dan perselisihan di antara kaum muslimin, dan menghalangi orang untuk mengingat Allah (berdzikir) dan shalat. Manakah dosa yang lebih besar dibandingkan dosa yang menumbuhkan permusuhan dan perselisihan di antara kaum muslimin, serta memalingkan dari mengingat Allah dan melalaikan shalat? Sungguh pada keduanya terdapat dosa yang besar. Adapun manfaat yang ada dibandingkan dosa yang ditimbulkan amat kecil sekali seperti keuntungan dari produksi dan penjualan khomer, atau dampak yang timbul seperti ketenangan, kegembiraan, kedermawanan, dan keberanian. Sedangkan perjudian, manfaat yang ada yaitu mendapatkan harta tanpa perlu susah payah, atau manfaat yang didapat oleh orang miskin jika mereka berjudi dengan taruhan unta, kemudian disembelih dan diberikan kepada fakir miskin. Firman Allah Ta’ala, “Mereka bertanya kepadamu apa yang mereka infakkan.” Hal itu merupakan pertanyaan yang timbul dari jawaban mereka terhadap firman Allah Ta’ala, “Dan berinfaklah kalian di jalan Allah.” Mereka ingin mengetahui bagian manakah yang harus merekan infakkan dari harta mereka di jalan Allah. Maka Allah Ta’ala menjawabnya dengan firman Nya, “Katakanlah, yang lebih dari keperluan.” Yaitu apa yang lebih dari kebutuhan kalian dan kelebihan nafkah terhadap diri kalian. Dari sinilah Rasulullah ﷺ bersabda, “Sebaik-baik sedekah adalah ketika dalam keadaan kaya.” (HR Bukhari. Firman Nya, “Demikianlah Allah menjelaskan kepada kalian....” maksudnya adalah semisal penjelasan ini, Allah Ta’ala menjelaskan syariat dan hukum-hukum Nya, serta halal dan haram kepada kalian, agar kalian mau berfikir cerdas dan sadar mengenai persoalan dunia dan akhirat, sehingga kalian beramal bagi dunia sebatas yang dibutuhkan kalian, dan beramal untuk akhirat yang mana itu adalah tempat kembali yang kekal bagi kalian sesuai dengan kadar hidup di sana. Pelajaran dari ayat: • Keharaman khomer dan perjudian dimana ayat ini terhapus (nasakh) dengan ayat di surat Al-Maidah yaitu dengan firman Nya, “Maka jauhilah” dan firman Nya, “maka berhentilah kamu (dari) mengerjakan pekerjaan itu.” • Penjelasan mengenai sedekah yang terbaik, yaitu yang berasal dari kelebihan harta yang diistilahkan dengan al-‘Afwu pada ayat ini. • Dianjurkan untuk memikirkan perkara dunia dan akhirat yang sesuai dengan kadarnya. Beramal untuk yang pertama berdasarkan kefanaannya dan beramal untuk akhirat berdasarkan kekekalannya di sana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 219: Allah mengabarkan bahwasannya mereka bertanya tentang hukum meminum khamr kepada nabi ﷺ , hukum meminum dan menjualnya. Allah memerintahkan untuk berkata kepada mereka bahwasannya khamr dan judi membahaya dan merusak harta dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dari Amr bin Syurahbil Abu Maisarah dari Umar bin Khaththab radhiyallahu 'anhu ia berkata: Ketika turun ayat tentang pengharaman khamr, Umar berkata, \"Ya Allah, jelaskanlah kepada kami tentang khamar dengan penjelasan yang memuaskan,\" maka turunlah ayat yang berada di surat Al Baqarah ini, \"Yas-aluunaka 'anil khamri wal maisiri, qul fiihimaa itsmun kabiir\", maka Umar pun dipanggil dan dibacakan keadanya ayat ini. Umar berkata lagi, \"Ya Allah, jelaskanlah kepada kami tentang khamar dengan penjelasan yang memuaskan,\" maka turunlah ayat yang disebutkan dalam surat An Nisaa', \"Yaa ayyuhalladziina aamanuu laa taqrabush shalaata wa antum sukaaraa.\" Ketika itu, muazin Rasulullah shallallahu 'alaihi wa sallam apabila shalat hendak dilaksanakan, ia menyerukan, \"Orang yang mabuk janganlah mendekati shalat.\" Maka Umar dipanggil dan dibacakan kepadanya ayat tersebut. Umar berkata lagi, \"Ya Allah, jelaskanlah kepada kami tentang khamar dengan penjelasan yang memuaskan,\" maka turunlah ayat yang disebutkan dalam surat Al Maa'idah, lalu Umar dipanggil dan dibacakan kepadanya ayat tersebut. Ketika telah sampai pada ayat, \"Fa hal antum muntahuun\", maka Umar berkata, \"Kami berhenti, kami berhenti.\" Abu Zur'ah berkata, \"Amr bin Syurahbil tidak mendengar hadits dari Umar…dst.\" Namun Bukhari mengatakan, bahwa 'Amr bin Syurahbil Abu Maisarah Al Kufiy mendengar hadits dari Umar dan Ibnu Mas'ud. Pengarang Al Jarh wa Ta'dil (6/237) juga berpendapat bahwa 'Amr bin Syurahbil mendengar hadits Umar dan Ibnu Mas'ud, oleh karenanya yang menetapkan bahwa 'Amr bin Syurahbil mendengar hadits dari Umar dan Ibnu Mas'ud lebih didahulukan. Yakni mengkonsumsi khamr (segala makanan dan minuman yang memabukkan atau menghilangkan akal), menjual dan membelinya. Pekerjaan haram untuk menghasilkan uang dengan cara taruhan; tanpa bekerja. Dalam khamr seseorang merasakan kenikmatan dan kesenangan, sedangkan dalam judi seseorang memperoleh harta tanpa bekerja keras. Allah Subhaanahu wa Ta'aala memerintahkan nabinya untuk menerangkan manfaat dan madharat khamr danjudi sebagai pengantar terhadap larangan yang akan datang dan agar mereka siap meninggalkannya. Yakni mafsadat atau bahaya yang ditimbulkan dari keduanya lebih besar daripada manfaatnya. Karena khmar dan judi menghilangkan akal dan menghilangkan harta, menghalangi manusia dari dzikrullah, menghalangi dari shalat, menimbulkan permusuhan dan kebencian. Ayat ini merupakan tahapan pertama pelarangan khamr. Larangan khamr di ayat ini masih belum tegas, sehingga ketika itu masih ada yang meminumnya, sedangkan sebagian lagi tidak, sampai turun ayat di surat Al Maa'idah yang dengan tegas melarangnya. Seperti inilah tasyri' (penetapan hukum) dalam Islam, yakni adanya tadarruj (tahapan) agar masyarakat siap. Yakni berapa ukuran seseorang perlu bersedekah dan bertabarrtu' (memberikan santunan sunat). Oleh karena itu, kita jangan mengeluarkan harta ketika diri kita butuh terhadapnya, misalnya ketika kita bersedekah, maka kita akan kelaparan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 219",
    "description": "Mereka menanyakan kepadamu, wahai nabi, tentang khamar, yaitu semua minuman yang memabukkan, dan berjudi. Pertanyaan itu muncul antara lain karena di antara rampasan perang yang diperoleh pasukan pimpinan abdulla'h bin jahsy seperti disinggung pada ayat 217 terdapat minuman keras. Katakanlah, pada keduanya terdapat dosa, yakni mudarat yang besar. Keduanya menimbulkan permusuhan dan menyebabkan kaum muslim melupakan Allah dan enggan menunaikan salat. Dan keduanya juga mengandung beberapa manfaat bagi manusia, seperti keuntungan dari perdagangan khamar, kehangatan badan bagi peminumnya, memperoleh harta tanpa susah payah bagi pemenang dalam perjudian, dan beberapa manfaat yang diperoleh fakir miskin dari perjudian pada zaman jahiliah. Tetapi dosanya, yakni mudarat yang ditimbulkan oleh khamar dan judi, lebih besar daripada manfaatnya. Khamar diharamkan dalam islam secara berangsur. Ayat ini menyatakan bahwa minum khamar dan berjudi adalah dosa dengan penjelasan bahwa pada keduanya terdapat manfaat, tetapi mudaratnya lebih besar daripada manfaat itu. Surah an-nisa''/4: 43 dengan tegas melarang minum khamar, tetapi terbatas pada waktu menjelang salat. Surah al-ma''idah/5: 90 dengan tegas mengharamkan khamar, berjudi, berkorban untuk berhala dan mengundi nasib dan menyatakan bahwa semuanya adalah perbuatan keji dan termasuk perbuatan setan yang harus dijauhi selamanya oleh orang-orang beriman. Bagian akhir ayat ini menjelaskan ketentuan menafkahkan harta di jalan Allah. Dan mereka menanyakan kepadamu tentang apa yang harus mereka infakkan di jalan Allah. Katakanlah, kelebihan dari apa yang diperlukan untuk memenuhi kebutuhan diri dan kebutuhan keluarga. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu memikirkan. Yakni memikirkan tentang dunia dan akhirat. Dunia adalah tempat beramal dan akhirat adalah tempat memanen hasil dari amalan itu. Dunia adalah negeri yang fana dan akhirat kekal abadi. Karena itu, berbuatlah kebajikan selagi kamu di dunia agar di akhirat kamu mendapat kebahagiaan selama-lamanya. Demikianlah Allah memberi petunjuk dengan ayat-ayatnya untuk kebahagiaan manusia, tidak saja kebahagiaan di dunia tetapi juga di akhirat. Selanjutnya Allah memberi tuntunan dalam memelihara anak yatim. Mereka menanyakan kepadamu, wahai nabi Muhammad, tentang anak-anak yatim. Katakanlah, memperbaiki keadaan mereka, yakni mengurus anak yatim untuk memperbaiki keadaan mereka, adalah baik! dan jika kamu mempergauli dan menyatukan mereka dengan keluargamu dalam urusan makanan, tempat tinggal, dan keperluan lainnya, maka yang demikian itu baik sebab mereka adalah saudara-saudaramu. Karena itu, sepantasnya eng yakni memikirkan tentang dunia dan akhirat. Dunia adalah tempat beramal dan akhirat adalah tempat memanen hasil dari amalan itu. Dunia adalah negeri yang fana dan akhirat kekal abadi. Karena itu, berbuatlah kebajikan selagi kamu di dunia agar di akhirat kamu mendapat kebahagiaan selama-lamanya. Demikianlah Allah memberi petunjuk dengan ayat-ayatnya untuk kebahagiaan manusia, tidak saja kebahagiaan di dunia tetapi juga di akhirat. Selanjutnya Allah memberi tuntunan dalam memelihara anak yatim. Mereka menanyakan kepadamu, wahai nabi Muhammad, tentang anak-anak yatim. Katakanlah, memperbaiki keadaan mereka, yakni mengurus anak yatim untuk memperbaiki keadaan mereka, adalah baik! dan jika kamu mempergauli dan menyatukan mereka dengan keluargamu dalam urusan makanan, tempat tinggal, dan keperluan lainnya, maka yang demikian itu baik sebab mereka adalah saudara-saudaramu. Karena itu, sepantasnya eng."
  }
]