[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Robb kalian itulah yang telah menjadikan bumi sebagai hamparan bagi kalian Supaya kehidupan kalian berjalan dengan mudah di atas permukaan nya, dan langit sebagai atap yang kuat dan menurunkan hujan dari awan yang dengan itu dia mengeluarkan untuk kalian beragam buah dan berbagai macam tumbuhan sebagai Rizki bagi kalian. Maka janganlah kalian mengadakan tandingan-tandingan bagi Allah dalam beribadah sedangkan kalian mengetahui keesaannya dalam menciptakan dan memberi rezeki serta hak tunggalnya untuk diibadahi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dia lah yang telah menjadikan bumi terhampar sebagai tempat berpijak bagimu dan menciptakan langit di atasnya dengan yang kokoh. Dan Dia lah yang memberi kenikmatan dengan menurunkan air hujan, sehingga bisa menumbuhkan beragam buah-buahan di muka bumi sebagai rezeki bagi kalian. Maka janganlah kalian menyekutukan dan menyamakan Allah dengan apapun, sedangkan kalian tahu bahwasanya tidak ada sang pencipta selain Allah -'Azza wa Jalla-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فِرَاشًا (hamparan) yakni sebagai pijakan agar kalian dapat menetap diatasnya وَّالسَّمَاۤءَ بِنَاۤءً ۖ (dan langit sebagai atap) Yakni seperti kubah atau atap rumah yang kalian huni. فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ ۚ (lalu Dia menghasilkan dengan hujan itu segala buah-buahan sebagai rezeki untukmu) Yakni dengan hujan itu Dia mengeluarkan berbagai jenis buah-buahan dan tanaman agar dapat kalian nikmati sampai batas waktu tertentu. فَلَا تَجْعَلُوْا لِلّٰهِ اَنْدَادًا( karena itu janganlah kamu mengadakan sekutu-sekutu bagi Allah) Yakni jangan kalian menjadikan sekutu-sekutu yang kalian sembah sebagaimana kalian beribadah kepada-Ku. وَّاَنْتُمْ تَعْلَمُوْنَ(padahal kamu mengetahui) yakni mengetahui bahwa sekutu-sekutu itu tidak menciptakan kalian, tidak menjadikan bumi itu hamparan, tidak menjadikan langit sebagai atap, tidak menumbuhkan tanaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah adalah Dzat yang menciptakan bagimu bumi yang membentang agar kamu dapat tetap berdiri di atasnya dan hidup di dalamnya; dan menciptakan langit sebagai bangunan dan tatanan yang sempurna layaknya kubah dan atap, sehingga tidak jatuh (menimpa) bumi, melainkan menurunkan air dari awan yang dapat menumbuhkan buah-buahan dan berbagai jenis tumbuhan agar kamu dapat menikmati dan memakannya. Maka janganlah kalian menyekutukan Allah dengan menyembah selainNya layaknya menyembahNya, sedangkan kalian mengetahui bahwa sekutu itu tidak bisa menciptakan kalian dan tidak memberi kalian rejeki. Sesungguhnya Allah adalah Dzat yang Maha Pencipta dan Maha Pemberi Rejeki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Dialah) Dzat yang menjadikan bagi kalian bumi sebagai hamparan} sebagai permadani yang dibentangkan {dan langit sebagai atap} sebagai atap yang diangkat di atas bumi {dan menurunkan air dari langit} hujan {lalu Dia menumbuhkan dengan air itu buah-buahan sebagai rezeki bagi kalian. Maka janganlah kalian mengadakan tandingan-tandingan bagi Allah} sekutu-sekutu dalam peribadatan {padahal kalian mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Dan Dia memberikan nikmat kepada kamu dengan nikmat-nikmat lahiriyah mapun batiniyah, Dia menjadikan untukmu dunia ini sebagai hamparan yang menjadi tempat kamu menetap, dan kamu mengambil manfaatnya dengan membangun rumah, pertanian, pembajakan, dan berkelana dari suatu tempat menuju tempat lain, dan lain sebagainya dari bentuk-bentuk pemanfaatannya, lalu Dia menjadikan langit sebagai atap bagi rumah sebagai tempat tinggal kalian dan menyediakan manfaat-manfaat yang merupakan kebutuhan pokok hidup kalian dan kebutuhan dasar, seperti matahari, bulan dan bintang, \"dan Dia menurunkan air hujan dari langit.” Langit adalah segala yang ada di atas kalian, oleh karena itu para ahli tafsir berkata, ”Maksud dari langit disini adalah awan di mana Allah ta’ala menurunkan air hujan darinya, “lalu Dia menghasilkan dengan hujan itu segala buah-buahan, ” seperti biji-bijian dan hasil-hasil dari pohon kurma, buah-buahan, tanaman dan lain sebagainya, ”sebagai rizki untukmu” yang dengannya kamu mendapatkan rizki, kamu makan, kamu hidup, kamu bahagia. “Karena itu janganlah kau mengadakan sekutu-sekutu bagi Allah, ” yakni yang diserupakan dan disepadankan dari makhluk-makhlukNya, lalu kamu menyembahnya sebagaiman kamu menyembah Allah, kamu mencintainya sebagaimana kamu mencintai Allah padahal mereka itu sama saja seperti kalian, mereka adalah makhluk yang diciptakan, diberi rizki, dan diatur, dimana mereka tidak memiliki seberat biji atom pun di bumi dan tidak pula di langit, serta mereka tidak dapat memberikan manfaat kepadamu dan tidak juga menimpakan mudarat. “padahal kamu mengetahui, ” bahwasanya Allah tidak memiliki sekutu, tidak pula kesamaan, tidak pada mencipta, memberi rizki, dan mengatur semesta, tidak pula pada peribadahan dan kesempurnaan, lalu bagaimanakah kamu menyembah tuhan-tuhan lain bersamaNya padahal kalian mengetahuinya? Hal ini merupakan perkara yang paling mngherankan dan yang paling bodoh. Ayat ini menyatukan antara perintah untuk beribadah hanya kepada Allah semata dan larangan dari beribadah kepada selain Allah, dan penjelasan akan dalil yang sangat jelas atas kewajiban beribadah kepadaNya dan batilnya beribadah kepada selainNya, yaitu penyebutan tauhid rububiyah yang mengandung keesaanNya, dalam mencipta, memberi rizki, dan mengatur semesta. Lalu apabila setiap orang menetapkan bahwasanya tidak ada sekutu bagi Allah dalam hal itu, maka itulah yang seharusnya, maka haruslah seperti itu juga penetapannya bahwasanya Allah itu tidak ada sekutu bagiNya dalam beribadah kepadaNya. Ini adalah dalil logika yang paling terang atas keesaan Sang Pencipta, Allah ta’ala dan batilnya kesyirikan. Dan firmanNya, ”Agar kamu bertakwa, ” kemungkinan maknanya adalah, bahwasanya karena kamu sekalian beribadah hanya kepada Allah semata, maka dengan hal itu kalian telah menjaga diri kalian sendiri dari murka dan AzabNya, karena kalian telah melakukan sebab yang mendorong hal tersebut. Kemungkinan lain maknanya adalah, bahwasanya jika kamu menyembah Allah semata, niscaya kamu menjadi golongan orang-orang bertakwa yang memiliki sifat ketakwaan. Kedua arti ini adalah benar, dan keduanya saling berkaitan, karena barangsiapa yang melakukan ibadah secara sempurna, niscaya ia menjadi golongan orang-orang bertakwa, dan barangsiapa yang tergolong dalam orang-orang bertakwa, pastilah ia akan memperoleh keselamatan dari azab dan murka Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فِرَٰشٗا Firaasyan : Yang dapat diduduki atau ditiduri di atasnya. بِنَآءٗ Binaa’an : dibangun laksana kubah di atas kalian ٱلثَّمَرَٰتِ Ats-Tsamaraat : Bentuk jamak dari Tsamroh, yaitu yang ditumbuhkan oleh tanah seperti biji ataupun sayur mayur, termasuk buah-buahan yang tumbuh dari pohon. رِزۡقٗا لَّكُمۡۖ Rizqan lakum : Makanan pokok bagi kalian yang dapat kalian makan sehingga bisa bertahan hidup sampai datangnya ajal. أَندَادٗا Andaadan : Bentuk jamak dari niddun yaitu Yang menyerupai atau semisalnya yang kalian ibadahi selain Allah atau bersamaan dengan ibadah kepada Allah dan kalian tandingkan dengan Allah Rabb yang Maha tinggi lagi Maha suci. Makna ayat : Allah menutup seruanNya dengan memperingatkan manusia agar tidak menyekutukanNya dalam beribadah dengan sesuatu apapun, disertai pengetahuan bahwa sekutu selain Allah tidak berhak diibadahi karena lemah, tidak bisa memberi manfaat atau menolak marabahaya. Pelajaran dari ayat : Keharaman syirik baik yang besar ataupun kecil, yang nampak maupun yang tersembunyi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 22: Begitu juga Allah memerintahkan manusia untuk ibadah karena sebab Ia lah yang menghamparkan bumi untuk mereka tinggal di dalamnya , dan Allah jadikan atas mereka langit sebagai atap , dan Allah turunkan hujan dari awan kemudian Allah keluarkan dari hujan tersebut warna-warni dari buah-buahan dan macam-macam tumbuhan sebagai rezeki bagi mereka , oleh karena itu wajib bagi mereka untuk tidak menyekutukan Allah dengan selain-Nya , dan mereka mengetahui bahwasanya Allah tidaklah memiliki sekutu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar manusia dapat hidup dengan mudah di atasnya. Langit atau dalam bahasa Arabnya disebut samaa' artinya semua yang ada di atas kita. Oleh karena itu, ahli tafsir menafsirkan samaa' atau langit di sini dengan awan. Ialah segala sesuatu yang disembah selain Allah seperti berhala-berhala, dewa-dewa, dan sebagainya. Yakni mengetahui bahwa Dialah satu-satunya yang menciptakan dan memberikan rezeki. karena itu hanya Dia sajalah yang berhak disembah, tidak selain-Nya. Ayat ini memerintahkan kita untuk beribadah kepada Allah Ta'ala saja dan meniadakan sesembahan selain Allah apa pun bentuknya sebagai cerminan dari kalimat Laailaahaillallah. Dalam ayat ini terdapat tauhid Rububiyyah (pernyataan bahwa hanya Allah saja yang menciptakan, mengatur, menguasai dan memberikan rezeki kepada alam semesta) dan uluhiyyah (keberhakan-Nya diibadahi). Jika kita mengetahui bahwa hanya Dia yang menciptakan dan mengatur alam semesta, maka hanya Dia pula yang berhak diibadahi; tidak selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 22",
    "description": "Sesungguhnya dialah yang dengan kekuasaan-Nya menjadikan bumi sebagai hamparan bagimu sehingga layak dan nyaman untuk dihuni, dan menjadikan di atas kamu langit dan benda-benda yang ada padanya sebagai atap, atau sebagai bangunan yang cermat, indah, dan kukuh. Dan dialah yang menurunkan sebagian dari air, yaitu air hujan, dari langit yang menjadi sumber kehidupan. Lalu dia hasilkan dengan air itu sebagian dari buah-buahan sebagai rezeki untukmu. Karena itu janganlah kamu mengadakan tandingan-tandingan bagi Allah yang telah menciptakan sedemikian rupa dan telah memberimu rezeki, padahal kamu dengan fitrah kesucian yang ada dalam diri mengetahui bahwa Allah tidak ada yang menyerupai-Nya, tidak ada sekutu bagi-Nya, dan tidak ada yang memberi rezeki selain-Nya, maka janganlah kamu menyimpang dari fitrah itu. Dan jika kamu tetap meragukan kebenaran Al-Qur'an yang telah kami nyatakan tidak ada keraguan di dalamnya, yang kami turunkan secara berangsur-angsur kepada hamba kami nabi Muhammad, maka sebenarnya ada bukti nyata di antara kamu yang dapat menjelaskan kebenarannya, yaitu: buatlah satu surah yang semisal dengannya, baik dari segi sastra, kandungan hukum, nilai-nilai moral, maupun petunjuk lainnya yang ada dalam Al-Qur'an; dan ajaklah penolong-penolongmu selain Allah untuk membantumu dalam menyusun yang serupa, kamu tidak akan mampu melakukan itu. Ini semua hendak-Nya kamu lakukan jika kamu menganggap dirimu sebagai orang-orang yang benar pernyataannya bahwa Al-Qur'an hanyalah karya buatan nabi Muhammad."
  }
]