[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka akan bertanya kepadamu (wahai nabi) tentang anak-anak yatim yang meninggal bapak-bapak mereka sebelum mereka mencapai usia baligh, Bagaimana bermuamalah bersama mereka dalam penghidupan dan harta mereka?. Katakanlah kepada mereka, “pengurusan kebaikan kalian terhadap mereka itu merupakan perbuatan baik. maka lakukanlah selalu cara yang paling bermanfaat bagi mereka, dan apabila kalian bercampur dengan mereka dalam seluruh urusan hidup mereka sehari-harinya, maka mereka adalah saudara-saudara kalian seagama, dan seorang saudara harus memperhatikan kemaslahatan saudaranya”. Dan Allah mengetahui siapa yang menyia-nyiakan harta anak yatim dan siapa yang menaruh perhatian besar untuk mengembangkannya. Seandainya Allah menghendaki, niscaya dia akan benar-benar mempersulit dan menyusahkan kalian dengan mengharamkan hidup berbaur dengan anak-anak yatim. Sesungguhnya Allah maha perkasa dalam kerajaannya, Maha bijaksana dalam penciptaan, pengaturan dan penetapan hukum syariat Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "220. Allah mensyariatkan hal itu agar kamu berfikir tentang apa yang bermanfaat bagimu di dunia dan di akhirat. Dan sahabat-sahabatmu bertanya kepadamu -wahai Nabi- tentang tugas mereka sebagai pengasuh anak yatim, bagaimana cara mereka berinteraksi dengan anak-anak yatim? Apakah mereka boleh mancampur harta anak-anak yatim itu dengan harta mereka untuk kepentingan nafkah, makanan dan tempat tinggal? Katakanlah untuk menjawab pertanyaan mereka, “Kerelaan kalian untuk mengurus harta mereka tanpa imbalan atau mencampur harta kalian dengan harta mereka akan lebih baik bagi kalian di sisi Allah dan lebih besar pahalanya. Dan hal itu akan lebih baik bagi mereka terkait harta mereka, karena pilihan itu akan membuat harta mereka tetap tersimpan untuk mereka. Dan jika kalian mengikutsertakan mereka dengan cara menggabungkan harta mereka dengan harta kalian dalam membiayai kebutuhan hidup, tempat tinggal dan sebagainya, itu tidak ada salahnya bagi kalian, karena mereka adalah saudara-saudara kalian seagama. Dan sebagai saudara satu sama lain harus saling membantu dan saling mengurus urusan saudaranya. Dan Allah mengetahui siapa wali (pengasuh anak yatim) yang ingin berbuat jahat dengan mencampur harta anak-anak yatim dan siapa wali yang ingin berbuat baik. Sekiranya Allah berkehendak menyulitkan kalian dalam urusan anak-anak yatim, niscaya Dia telah menyulitkan kalian. Akan tetapi Dia mempermudah urusan kalian dalam berhubungan dengan anak-anak yatim, karena syariat-Nya dibangun di atas asas kemudahan. Sesungguhnya Allah Maha Perkasa, tidak ada sesuatupun yang dapat mengalahkan-Nya. Dan Dia Maha Bijaksana di dalam menciptakan, mengatur, dan di dalam menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "220. Apapun yang kalian pikirkan tentang urusan dunia dan akhirat, lalu kalian belanjakan sebagian harta kalian untuk kehidupan dunia dan sisanya untuk rumah akhirat. Wahai Nabi, mereka bertanya kepadamu tentang berbaur dengan anak yatim dan mengatur urusan mereka, maka katakanlah kepada mereka: “Mengurus mereka dengan patut itu lebih baik daripada mengabaikannya. Dan mengembangkan harta itu lebih baik daripada menelantarkannya. Jika kalian mencampur harta kalian dengan harta mereka, makanan kalian dan makanan mereka sehngga menganggap mereka sebagai saudara seagama kalian, maka hal itu diperbolehkan. Allah itu mengetahui orang yang merusak harta anak yatim dengan memakannya dari orang mengadakan perbaikan dalam harta tersebut dengan mengembangkan dan mengaturnya. Maka jika berkehendak sungguh Allah akan menempatkan kalian dalam kesempitan dan kesusahan, namun Dia memberi kemuahan bagi kalian, dan memperbolehkan kalian untuk mencampur harta kalian dengan harta mereka. Sesungguhnya Allah itu Maha Kuat dan tidak bisa ditaklukkan, dimana Dia meletakkan segala sesuatu pada tempatnya sesuai hikmahNya sehinga tidak memberi beban di luar kemampuan” Adh-Dhahak dan As-Sadi berkata: “Asbabun nuzul ayat ini yaitu bahwa mereka pada zaman Jahiliyyah malu berbaur dalam makan, minum dan hal lainnya dengan anak yatim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tentang dunia dan akhirat. Mereka bertanya kepadamu tentang anak-anak yatim. Katakanlah,“Memperbaiki keadaan mereka} katakanlah ikut campur dalam memperbaiki harta mereka tanpa imbalan {adalah baik.” Jika kamu mempergauli mereka} jika kalian ikut serta dalam urusan harta mereka, dan mencampurnya dengan harta kalian untuk membiayai hidup dan tempat tinggal kalian, lalu kalian mendapatkan imbalan dari harta mereka {maka mereka adalah saudara-saudara kalian} saudara kalian dalam agama {Allah mengetahui orang yang berbuat kerusakan dan yang berbuat kebaikan. Seandainya Allah menghendaki, niscaya Dia mendatangkan kesulitan kepada kalian} Sungguh mempersulit kalian {Sesungguhnya Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "220. Ketika turun firman Allah : \"Sesungguhnya orang-orang yang memakan harta anak yatim secara zalim, sebenarnya mereka itu menelan api sepenuh perutnya dan mereka akan masuk ke dalam api yang menyala-nyala (neraka).\" QS An-nisa ayat 10 Kaum muslimin merasa berat akan hal itu lalu mereka menjauhi makanan mereka dari makanan anak-anak yatim, mereka khawatir akan memakannya, walaupun dalam hal seperti ini biasanya tercampur, hingga mereka bertanya kepada nabi tentang hal tersebut, lalu Allah mengabarkan kepada mereka bahwa maksud ayat itu adalah memperbaiki harta anak-anak yatim, yaitu dengan cara menjaga, memelihara, dan menginvestasikannya, dan bahwasanya mencampurkannya dengan makanan atau selainnya adalah boleh dalam konteks tidak memadharatkan anak yatim tersebut. Karena mereka adalah saudara kalian juga dan sudah menjadi hal yang dimaklumi bahwa saudara itu bergaul dengan saudara yang lain. Yang menjadi patokan dalam hal itu adalah niat dan perbuatannya. Maka barangsiapa yang diketahui oleh Allah tentang niatnya bahwa ia adalah seorang yang hendak memperbaiki keadaan anak yatim, tidak memiliki ketamakan kepada harta anak yatim tersebut, dan sekiranya ada sedikit darinya tercampur kepadanya tanpa disengaja sebelumnya, maka hal itu tidaklah mengapa. Dan barangsiapa yang diketahui niatnya oleh Allah, bahwa ia bertujuan untuk memakannya atau memanfaatkannya untuk pribadi, maka yang demikian itulah yang tidak boleh dan berdosa. \"Sarana memiliki hukum niat dan tujuannya.\" Dalam ayat ini terdapat dalil atas bolehnya berbagai macam penyatuan makanan, minuman, perjanjian-perjanjian, dan lain sebagainya. Keringanan ini merupakan kasih sayang Allah dan kebaikanNya, serta kelapangan bagi kaum mukminin, dan bila tidak demikian, maka seandainya “Allah menghendaki niscaya Dia dapat mendatangkan kesulitan kepadamu,” artinya akan berat bagimu dengan tidak adanya rukhsah (keringanan) hingga kalian berat, sulit, dan akhirnya berdosalah kalian. “Sesungguhnya Allah Mahaperkasa,” maksudnya, Dia memiliki kekuatan yang sempurna dan pemaksaan terhadap segala sesuatu, akan tetapi walaupun demikian, Dia juga “Maha bijaksana” yang tidak berbuat kecuali merupakan realisasi dari kebijaksanaanNya yang sempurna dan perlindunganNya yang menyeluruh. KeperkasaanNya tidaklah menafikan kebijaksanaanNya, karena itu tidaklah dikatakan bahwasanya apa yang dikehendakiNya akan dilakukanNya, baik sesuai dengan hikmahNya maupun tidak. Namun seharusnya dikatakan bahwa sesungguhnya perbuatan-perbuatanNya, demikian juga hukum-hukumNya adalah bagian dari hikmahNya. Allah tidak menciptakan sesuatu suatu makhluk pun dengan sia-sia akan tetapi pasti memiliki hikmah, baik kita ketahui ataupun tidak. Allah juga tidak mencari akan atas hamba-hambaNya sesuatu yang terlepas dari hikmah. Maka tidaklah Allah memerintahkan sesuatu kecuali yang memiliki kemaslahatan yang total atau yang lebih besar, dan tidak pula Dia melarang kecuali apa yang memiliki kemadharatan yang total atau yang lebih besar, karena kesempurnaan hikmah dan rahmatNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { تُخَالِطُوهُمۡ } Tukhoolithuhum : Engkau mencampurkan harta mereka dengan hartamu agar menjadi sama. { لَأَعۡنَتَكُمۡۚ } La a’natakum : Al-‘anat artinya adalah kesulitan yang amat besar. Dikatakan engkau memberikan ‘anat kepadanya apabila engkau membebaninya dengan sesuatu yang memberatkan. Makna ayat: Firman Allah Ta’ala ayat (220), “Mereka bertanya kepadamu tentang anak yatim.” Berkaitan dengan ayat pada surat An-Nisa’ yang berbunyi, “Sesungguhnya orang-orang yang memakan harta anak yatim secara zhalim, sebenarnya mereka itu menelan api sepenuh perutnya dan mereka akan masuk ke dalam api yang menyala-nyala (neraka).” (QS An-Nisa’ : 10) Kaum mukminin sangat takut sekali setelah turunnya ayat ini, sehingga mereka yang mengasuh anak yatim dalam rumahnya mulai memisahkan makannya dari makanan mereka, memisahkan minumannya dari minuman mereka (agar tidak memakan harta anak yatim, pent) sehingga menimbulkan kesulitan dan kerepotan. Lantas mereka menanyakan solusi dari permasalahan ini, maka turunlah ayat ini dan menjelaskan kepada mereka bahwa maksudnya adalah mengurus harta anak yatim sebaik-baiknya, bukan memisahkan atau mencampruadukannya. Allah Ta’ala berfirman, “Katakanlah berbuat baiklah kepada mereka.” Maka mengurus dan memperhatikan mereka itu lebih baik dibandingkan tidak mengurus atau memperhatikannya, serta untuk mencegah agar tidak terjadi ketidakberesan tatkala mengurus mereka Allah berfirman, “Jika kamu menggauli mereka, maka mereka adalah saudaramu.” Maka seorang saudara bekerjasama dengan saudaranya dalam urusan harta, dan Allah memberitahukan mereka bahwa Dia mengetahui siapakah yang berbuat kerusakan terhadap harta anak yatim dan siapa yang berbuat kebaikan. Agar mereka selalu mengingatnya. Semua ini sebagai bentuk penjagaan terhadap harta anak yatim yang telah kehilangan ayahnya. Kemudian Allah Ta’ala menambahkan nikmat Nya kepada mereka dengan menghilangkan kesulitan dalam mengurus anak yatim dengan firman Nya, “Dan jikalau Allah menghendaki, niscaya Dia dapat mengdatangkan kesulitan kepadamu.” Yaitu membiarkan kalian berada dalam kesulitan yang ditimbulkan dari memisahkan harta kalian dengan harta anak-anak yatim yang kalian urus. Firman Nya, “Sesungguhnya Allah Maha perkasa” yaitu Perkasa untuk melaksanakan apa yang dikehendaki serta Maha Bijaksana dalam perbuatan dan keputusan Nya. Pelajaran dari ayat: • Diperbolehkan untuk mencampurkan harta anak yatim dengan harta orang yang mengasuhnya, karena itu lebih membawa maslahat untuknya. Dan inilah makna ishlah yang dimaksud dalam ayat ini. • Keharaman harta anak yatim, dan ancaman bagi orang yang menyentuh dan mencampur adukkannya sehingga menyebabkan harta itu habis berkurang atau merugikan harta anak yatim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 220: Mereka bertanya kepada nabi ﷺ tentang anak yatim yang tinggal mati bapak mereka sebelum mereka usia baligh, maka Allah memerintahkan untuk mengabarkan kepada mereka agar memperbaiki harta mereka dan menjaganya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan begitu, kita memiliki kecakapan dalam menjalani hidup di dunia dan mengetahui hakikat hidup hidup di dunia, dan kita pun mengenal tentang kehidupan akhirat, di mana ia merupakan kehidupan yang kekal dan tempat pembalasan sehingga kita lebih mengutamakannya. Yakni bagaimana seharusnya sikap kamu terhadap mereka dan harta mereka. Ketika turun ayat ancaman memakan harta anak yatim secara zalim, yaitu pada surat An Nisaa': 10, maka kaum muslimin memisahkan makanan mereka dengan makanan anak yatim karena khawatir memakan harta anak yatim, sampai dalam hal seperti ini, yakni dalam hal yang biasanya harta anak yatim bercampur dengan harta mereka, mereka pun bertanya kepada Nabi shallallahu 'alaihi wa sallam tentang masalah tersebut, maka turunlah ayat di atas menerangkan bahwa tujuan utamanya adalah memperbaiki harta anak yatim, memelihara dan mengembangkannya dan bahwa mencampurkan harta mereka dengan harta anak yatim adalah boleh selama tidak memadharatkan anak yatim, karena mereka adalah saudara kita, di mana saudara biasanya mencampurkan harta dengan saudaranya. Oleh karena itu, yang perlu dijaga adalah niat dan amal, barang siapa berniat baik dan bermaksud memperbaiki harta anak yatim serta tidak berharap apa-apa terhadap hartanya, maka jika terjadi sedikit percampuran tanpa disengaja, ia tidaklah berdosa. Sebaliknya, barang siapa yang berniat buruk, missalnya percampuran yang dilakukannya agar dapat memakan harta anak yatim, maka seperti itulah yang berdosa, sebagaimana ka'idah \"Al Wasaa'il lahaa ahkaamul maqaashid\" (wasilah tergantung tujuan). Dalam ayat ini terdapat dalil bolehnya mencampurkan harta kita dengan anak yatim ketika makan, minum, mengadakan 'akad dsb. Hal ini merupakan rukhshah (keringanan) dari Allah Subhaanahu wa Ta'aala. Dalam mengurus anak yatim prinsip kita berdasarkan ayat ini adalah \"melakukan yang terbaik atau yang lebih bermaslahat bagi mereka\" Ada yang mengartikan \"jika kamu mencampurkan nafkah belanja kamu dengan nafkah belanja mereka\", maka mereka (anak yatim) tersebut adalah saudara kita, yakni tidak mengapa karena mereka adalah saudara kita, di mana saudara itu biasanya mencampurkan harta dengan saudaranya. Orang yang mengadakan kerusakan adalah orang yang menyia-nyiakan harta anak yatim ketika dirinya diserahi untuk mengurus harta mereka, sedangkan orang yang mengadakan kebaikan adalah orang yang mengurus harta mereka dengan kepengurusan yang bermaslahat bagi mereka. Allah memiliki kekuatan yang sempurna dan kekuasaan terhadap segala sesuatu, namun Dia Maha Bijaksana, yakni tidak bertindak kecuali sesuai hikmah-Nya yang sempurna. Oleh karena itu, Dia tidaklah menciptakan sesuatu main-main, dan tidaklah menetapkan syari'at yang kosong dari hikmah. Dia tidaklah memerintah kecuali jika di sana terdapat maslahat yang murni atau lebih besar maslahatnya, dan tidaklah melarang kecuali karena di dalamnya terdapat mafsadat murni atau lebih besar mafsadatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 220",
    "description": "Yakni memikirkan tentang dunia dan akhirat. Dunia adalah tempat beramal dan akhirat adalah tempat memanen hasil dari amalan itu. Dunia adalah negeri yang fana dan akhirat kekal abadi. Karena itu, berbuatlah kebajikan selagi kamu di dunia agar di akhirat kamu mendapat kebahagiaan selama-lamanya. Demikianlah Allah memberi petunjuk dengan ayat-ayatnya untuk kebahagiaan manusia, tidak saja kebahagiaan di dunia tetapi juga di akhirat. Selanjutnya Allah memberi tuntunan dalam memelihara anak yatim. Mereka menanyakan kepadamu, wahai nabi Muhammad, tentang anak-anak yatim. Katakanlah, memperbaiki keadaan mereka, yakni mengurus anak yatim untuk memperbaiki keadaan mereka, adalah baik! dan jika kamu mempergauli dan menyatukan mereka dengan keluargamu dalam urusan makanan, tempat tinggal, dan keperluan lainnya, maka yang demikian itu baik sebab mereka adalah saudara-saudaramu. Karena itu, sepantasnya eng yakni memikirkan tentang dunia dan akhirat. Dunia adalah tempat beramal dan akhirat adalah tempat memanen hasil dari amalan itu. Dunia adalah negeri yang fana dan akhirat kekal abadi. Karena itu, berbuatlah kebajikan selagi kamu di dunia agar di akhirat kamu mendapat kebahagiaan selama-lamanya. Demikianlah Allah memberi petunjuk dengan ayat-ayatnya untuk kebahagiaan manusia, tidak saja kebahagiaan di dunia tetapi juga di akhirat. Selanjutnya Allah memberi tuntunan dalam memelihara anak yatim. Mereka menanyakan kepadamu, wahai nabi Muhammad, tentang anak-anak yatim. Katakanlah, memperbaiki keadaan mereka, yakni mengurus anak yatim untuk memperbaiki keadaan mereka, adalah baik! dan jika kamu mempergauli dan menyatukan mereka dengan keluargamu dalam urusan makanan, tempat tinggal, dan keperluan lainnya, maka yang demikian itu baik sebab mereka adalah saudara-saudaramu. Karena itu, sepantasnya eng. Pada ayat ini Allah memberi tuntunan dalam memilih pasangan. Dan janganlah kamu, wahai pria-pria muslim, menikahi atau menjalin ikatan perkawinan dengan perempuan musyrik penyembah berhala sebelum mereka benar-benar beriman kepada Allah dan nabi Muhammad. Sungguh, hamba sahaya perempuan yang beriman yang berstatus sosial rendah menurut pandangan masyarakat lebih baik daripada perempuan musyrik meskipun dia menarik hatimu karena kecantikan, nasab, kekayaannya, atau semisalnya. Dan janganlah kamu, wahai para wali, nikahkan orang laki-laki musyrik penyembah berhala dengan perempuan yang beriman kepada Allah dan rasulullah sebelum mereka beriman dengan sebenar-benarnya. Sungguh, hamba sahaya laki-laki yang beriman lebih baik daripada laki-laki musyrik meskipun dia menarik hatimu, karena kegagahan, kedudukan, atau kekayaannya. Ketahuilah, mereka akan selalu berusaha mengajak ke dalam kemusyrikan yang menjerumuskanmu ke neraka, sedangkan Allah mengajak dengan memberikan bimbingan dan tuntunan menuju jalan ke surga dan ampunan dengan rida dan izin-Nya. Allah menerangkan ayat-ayat-Nya, yakni tanda-tanda kekuasaan-Nya berupa aturan-aturan kepada manusia agar mereka mengambil pelajaran sehingga mampu membedakan mana yang baik dan membawa kemaslahatan, dan mana yang buruk dan menimbulkan kemudaratan. Pernikahan yang dilandasi keimanan, ketakwaan, dan kasih sayang akan mewujudkan kebahagiaan, ketenteraman, dan keharmonisan"
  }
]