[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian (wahai kaum muslimin), menikahi wanita-wanita musyrik, wanita-wanita para penyembah berhala, sampai mereka mau masuk ke dalam Islam. Dan ketahuilah bahwa sesungguhnya wanita budak sahaya, yang tidak memiliki harta dan kedudukan tinggi, yang beriman kepada Allah, lebih baik daripada wanita musyrik, walaupun (pesona) wanita musyrik yang merdeka itu mengundang decak kagum kalian. Dan janganlah kalian menikahkan wanita-wanita muslimah (baik merdeka ataupun hamba sahaya) dengan lelaki-lelaki musyrikin, sehingga mereka mau beriman kepada Allah dan rasul Nya. Dan ketahuilah bahwa sesungguhnya seorang budak lelaki beriman, meskipun dia miskin dia tetap lebih baik daripada lelaki musyrik, meskipun lelaki musyrik itu membuat kalian terkagum-kagum kepadanya. Orang-orang yang memiliki keyakinan syirik, lelaki maupun perempuan, menyeru orang yang mempergauli mereka kepada sesuatu yang menyeret kepada neraka, Sedangkan Allah subhanahu wata’ala menyeru hamba-hamba Nya kepada agama Nya yang Haq yang mendorong mereka masuk surga dan ampunan bagi dosa-dosa mereka, dan Dia menerangkan ayat-ayat dan hukum-hukum pada sekalian manusia, agar mereka mengingat dan dapat mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "221. Janganlah kalian -wahai orang-orang mukmin- menikah dengan wanita-wanita musyrik sebelum mereka beriman kepada Allah semata dan memeluk agama Islam. Sungguh, wanita budak belian yang beriman kepada Allah dan Rasul-Nya lebih baik (untuk dinikahi) daripada wanita merdeka yang menyembah berhala, walaupun kecantikan dan kekayaannya memikat hati kalian. Dan janganlah kalian menikahkan wanita-wanita muslimah dengan laki-laki musyrik. Sungguh, laki-laki budak belian yang beriman kepada Allah dan Rasul-Nya lebih baik (untuk dinikahkan) daripada laki-laki musyrik, walaupun dirinya memikat hati kalian. Orang-orang musyrik itu -baik laki-laki maupun wanita- akan mengajak kepada sesuatu yang menyebabkan masuk neraka dengan ucapan dan perbuatan mereka. Sedangkan Allah mengajak kepada amal-amal saleh yang menyebabkan masuk surga dan mendapatkan ampunan atas dosa-dosa dengan izin dan kemurahan-Nya. Dan Allah menjelaskan ayat-ayat-Nya kepada manusia agar mereka mengambil pelajaran melalui petunjuk-petunjuk-Nya kemudian mengamalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "221. Allah melarang orang-orang beriman dari pernikahan dengan orang-orang musyrik: Janganlah kalian menikahi wanita-wanita musyrik yang menyembah berhala, kecuali mereka masuk Islam. Dan ketahuilah pernikahan dengan budak wanita yang muslim lebih baik daripada menikahi wanita musyrik, meski kecantikan dan harta wanita musyrik itu membuat kalian takjub. Dan janganlah kalian menikahkan orang-orang musyrik dengan wanita-wanita Muslimah. Dan pernikahan dengan budak muslim lebih baik daripada pernikahan dengan lelaki musyrik, meskipun orang musyrik ini membuat kalian takjub. Hal ini karena orang-orang musyrik jauh dari rahmat Allah, mereka mengajak orang-orang yang berinteraksi dengan mereka untuk melakukan keburukan yang dapat menjerumuskan ke neraka. Sedangkan Allah mengajak kalian kepada agama Islam yang dapat membawa kalian kepada surga dan ampunan dari dosa. Allah menjelaskan ayat dan hukum-Nya kepada manusia agar mereka mengambil pelajaran. Syeikh as-Syinqithi berkata: secara zahir, ayat ini menjelaskan bahwa wanita-wanita ahli kitab juga termasuk dalam larangan ini, namun dalam ayat lain dijelaskan bahwa wanita-wanita ahli kitab tidak termasuk dalam larangan. Hal ini Allah jelaskan dalam firman-Nya: وَالْمُحْصَنَاتُ مِنَ الْمُؤْمِنَاتِ وَالْمُحْصَنَاتُ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ (Dan dihalalkan mangawini) wanita yang menjaga kehormatan diantara wanita-wanita yang beriman dan wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al Kitab. (al-Maidah: 5) Namun jika dikatakan bahwa wanita-wanita ahli kitab tidak termasuk wanita-wanita yang musyrik, dengan dalil: لمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنْفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ Orang-orang kafir yakni ahli Kitab dan orang-orang musyrik (mengatakan bahwa mereka) tidak akan meninggalkan (agamanya) sebelum datang kepada mereka bukti yang nyata. (al-Bayyinah: 1) Dan firman Allah: مَا يَوَدُّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَلَا الْمُشْرِكِينَ أَنْ يُنَزَّلَ عَلَيْكُمْ مِنْ خَيْرٍ مِنْ رَبِّكُمْ Orang-orang kafir dari Ahli Kitab dan orang-orang musyrik tiada menginginkan diturunkannya sesuatu kebaikan kepadamu dari Tuhanmu. (al-Baqarah: 105). Penyebutan ahli kitab dan orang-orang musyrik dalam dua dalil ini menunjukkan bahwa dua kelompok ini merupakan kelompok yang berbeda. Namun hal ini terbantahkan dengan ayat yang menunjukkan bahwa ahli kitab termasuk dalam golongan orang-orang yang musyrik, Allah berfirman: وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتِ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ۖ ذَٰلِكَ قَوْلُهُمْ بِأَفْوَاهِهِمْ ۖ يُضَاهِئُونَ قَوْلَ الَّذِينَ كَفَرُوا مِنْ قَبْلُ ۚ قَاتَلَهُمُ اللَّهُ ۚ أَنَّىٰ يُؤْفَكُونَ. اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِنْ دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَٰهًا وَاحِدًا ۖ لَا إِلَٰهَ إِلَّا هُوَ ۚ سُبْحَانَهُ عَمَّا يُشْرِكُونَ Orang-orang Yahudi berkata: \"Uzair itu putera Allah\" dan orang-orang Nasrani berkata: \"Al Masih itu putera Allah\". Demikianlah itu ucapan mereka dengan mulut mereka, mereka meniru perkataan orang-orang kafir yang terdahulu. Dilaknati Allah mereka, bagaimana mereka sampai berpaling? Mereka menjadikan orang-orang alimnya dan rahib-rahib mereka sebagai tuhan selain Allah dan (juga mereka mempertuhankan) Al Masih putera Maryam, padahal mereka hanya disuruh menyembah Tuhan yang Esa, tidak ada Tuhan (yang berhak disembah) selain Dia. Maha suci Allah dari apa yang mereka persekutukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "221. وَلَا تَنكِحُوا۟ الْمُشْرِكٰتِ (Dan janganlah kamu menikahi wanita-wanita musyrik) Yakni para wanita penyembah berhala dan semisalnya seperti wanita-wanita kafir, kecuali para wanita Yahudi dan Nasrani yang boleh dinikahi oleh orang-orang muslim, sebagaimana dijelaskan pada surat al-Maidah ayat 5. وَلَأَمَةٌ مُّؤْمِنَةٌ (Sesungguhnya wanita budak yang mukmin lebih baik) Yakni seandainya kalian menikahi budak wanita itu lebih baik daripada menikahi wanita merdeka namun kafir. وَلَوْ أَعْجَبَتْكُمْ ۗ , (walaupun dia menarik hatimu) Yakni wanita-wanita musyrik tersebut menarik hatimu karena mereka memiliki kecantikan, harta, dan kedudukan. وَلَا تُنكِحُوا۟ الْمُشْرِكِينَ (Dan janganlah kamu menikahkan orang-orang musyrik) Yakni jangan kalian menikahkan mereka dengan wanita-wanita mukmin sampai mereka memeluk Islam. Dan umat ini telah sepakat atas dilarangnya seorang musyrik menjima’ wanita mukmin dengan cara apapun, baik itu dengan menikahinya atau lewat kepemilikan budak, karena dalam hal itu terdapat pelecehan terhadap Islam. أُو۟لٰٓئكَ Mereka) Isyarat kepada laki-laki dan perempuan musyrik. يَدْعُونَ إِلَى النَّارِ ۖ (mengajak ke neraka) Dengan pergaulan, perkataan, dan perbuatan mereka yang menjerumuskan ke neraka. Sehingga perbesanan, pergaulan, dan persahabatan dengan mereka terdapat bahaya yang besar bagi yang menikahi mereka atau yang menikahkan dengan anak mereka, yang tidak dibolehkan bagi seorang muslim untuk berpaparan atau masuk ke dalam bahaya tersebut. وَاللَّـهُ يَدْعُوٓا۟ إِلَى الْجَنَّةِ (sedang Allah mengajak ke surga) Karena menikahkan mukmin shaleh dengan mukminah shalihah mengantarkan ke surga dengan pergaulan, perkataan, dan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "221. Dan janganlah kalian menikahi wanita-wanita musyrik penyembah berhala dan wanita-wanita kafir selain ahli kitab sampai mereka beriman kepada Allah dan rasulullah. Dan menikah dengan budak muslim itu lebih baik daripada wanita merdeka yang kafir, meskipun wanita kafir itu membuat kalian terkagum-kagum dengan kecantikan, harta, atau kehormatannya. Dan jangan sampai orang-orang musyrik laki-laki itu menikahi wanita-wanita mukmin sampai mereka mau beriman kepada Allah dan rasulullah. Menikahi hamba laki-laki mukmin itu lebih baik dari pada laki-laki merdeka musyrik meskipun dia membuat kalian terkagum dengan ketampanan, harta dan keturunannya. Orang-orang musyrik laki-laki dan perempuan itu mengajak kalian melakukan perbuatan yang mengharuskan mereka masuk neraka. Menemani mereka itu memberikan bahaya terhadap agama. Dan Allah itu mengajak kalian untuk melakukan amal yang bisa memasukkan ke dalam surga, dan mendapatkan ampunan Tuhan dengan kehendak dan anugerahNya. Pernikahan antata orang mukmin laki-laki dan perempuan itu bisa mewujudkan hal itu. Allah menjelaskan perintah dan laranganNya kepada manusia supaya mereka mau mengambil pelajaran dan ibarah. Maqatil berkata: “Ayat ini turun untuk Ibnu Abi Martsad yang meminta ijin kepada Nabi SAW untuk menikahi seorang wanita sedangkan dia itu musyrik dan memiliki kecantikan. Lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian menikahi} wahai orang-orang muslim janganlah kalian menikahi {perempuan-perempuan musyrik hingga mereka beriman. Sungguh, hamba sahaya perempuan yang beriman itu lebih baik daripada perempuan musyrik, meskipun dia menarik hati kalian. Jangan pula kalian menikahi} jangan menikahi {laki-laki musyrik hingga mereka beriman. Sungguh, hamba sahaya laki-laki yang beriman lebih baik daripada laki-laki musyrik meskipun dia menarik hati kalian. Mereka itu mengajak ke neraka} Mereka yang dijelaskan dengan kemusyrikan baik laki-laki maupun perempuan itu mengajak orang yang berhubungan dengan mereka menuju perbuatan yang mengakibatkan masuk neraka {sedangkan Allah mengajak ke surga dan ampunan dengan izinNya. Allah menerangkan ayat-ayatNya kepada manusia agar mereka mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "221. Maksudnya, “Dan janganlah kamu menikahi” wanita wanita “musyrik” selama mereka masih dalam kesyirikan mereka “hingga mereka beriman”; karena seorang wanita Mukmin walaupun sangat jelek parasnya adalah lebih baik daripada seorang wanita musyrik walau sangat cantik parasnya. Ini umum pada seluruh wanita musyrik, lalu dikhususkan oleh ayat dalam Quran surat al-maidah tentang bolehnya menikahi wanita ahli kitab, sebagaimana Allah berfirman : \"(Dan dihalalkan mangawini) wanita yang menjaga kehormatan diantara wanita-wanita yang beriman dan wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al Kitab sebelum kamu, bila kamu telah membayar mas kawin mereka dengan maksud menikahinya, tidak dengan maksud berzina dan tidak (pula) menjadikannya gundik-gundik.\" QS Al-maidah ayat 5 “Dan janganlah kamu menikah kan orang-orang musyrik (dengan wanita-wanita Mukmin) sebelum mereka beriman.”Ini bersifat umum yang tidak ada pengecualian di dalamnya. Kemudian Allah menyebutkan hikmah dalam hukum haramnya seorang mukmin atau wanita Mukmin menikah dengan selain agama mereka dalam FirmanNya, “mereka mengajak ke neraka,” yakni, dalam perkataan-perkataan, perbuatan-perbuatan, dan kondisi-kondisi mereka. Maka bergaul dengan mereka adalah merupakan suatu yang bahaya, dan bahayanya bukanlah bahaya duniawi, akan tetapi bahaya kesengsaraan yang abadi. Dapat diambil kesimpulan dari alasan ayat melarang bergaul dengan setiap musyrik dan pelaku bid’ah; karena jika menikah saja tidak boleh padahal memiliki kemaslahatan yang begitu besar, maka hanya sebatas bergaul saja pun harus lebih tidak boleh lagi, khususnya pergaulan yang membawa kepada tingginya martabat orang musyrik tersebut atau semacamnya di atas seorang muslim seperti pelayanan atau semacamnya. Dalam FirmanNya, “dan janganlah kamu menikahkan orang-orang musyrik dengan (wanita-wanita Mukmin)” terdapat dalil tentang harus adanya Wali dalam nikah. “Sedang Allah mengajak ke surga dan ampunan,” maksudnya, menyeru hamba-hambaNya untuk memperoleh surga dan ampunan yang di antara akibatnya adalah menjauhkan diri dari segala siksaan. Hal itu dengan cara mengajaknya untuk melakukan sebab-sebabnya berupa amal Shalih, bertaubat yang sungguh-sungguh, berilmu yang bermanfaat dan mengamalkannya. “Dan Allah menerangkan ayat ayatNya (perintah-perintahNya),” maksudnya, hukum hukum, dan hikmah hikmahNya “kepada manusia supaya mereka mengambil pelajaran.” Hal tersebut mewajibkan mereka untuk mengingat apa yang telah mereka lupakan dan mengetahui apa yang tidak mereka ketahui, serta mengerjakan apa yang telah mereka lalaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَلَا تَنكِحُواْ } Wa laa tankihuu : Janganlah kamu nikahi. { الأمة } Al-amah : Lawan kata dari orang yang merdeka (budak, pent) { وَلَوۡ أَعۡجَبَتۡكُمۡۗ } Walau a’jabatkum : Walaupun kebaikan dan kecantikannya membuatmu tertarik. { يَدۡعُونَ إِلَى ٱلنَّارِۖ } Yad’uuna ilannâr : Mereka mengajak ke neraka. Dengan keadaan, perkataan, dan perbuatan mereka. { ءَايَٰتِهِۦ } Ayaatihi : Hukum-hukum agama Nya dan permasalahan-permasalahan dalam syariat Nya. Makna ayat: Allah Ta’ala melarang kaum mukminin agar tidak menikahi wanita-wanita musyrik kecuali mereka telah beriman kepada Allah dan rasul Nya. Apabila mereka beriman makan boleh untuk menikahinya. Kemudian Allah Ta’ala memberitahukan mereka agar tidak menikahi wanita musyrik dan memotivasi agar menikahi wanita-wanita mukminah. Seorang budak perempuan mukmin lebih baik dibandingkan wanita musyrik yang terbaik. Walaupun wanita musyrik tersebut lebih membuatmu tertarik karena kebaikan dan kecantikannya. Lantas Allah Ta’ala melarang dan mengharamkan kepada mereka agar tidak menikahkan wanita-wanita mukmin dengan laki-laki yang musyrik, sampai mereka mau beriman. Apabila mereka telah beriman maka boleh bagi para wali untuk menikahkan putri-putrinya atau perempuan dalam perwaliannya. Firman Allah Ta’ala, “Dan janganlah kalian menikahkan orang-orang musyrik dengan wanita-wanita beriman.” Allah ta’ala menjelaskan bahwa hamba sahaya yang beriman lebih baik dibandingkan laki-laki yang musyrik, walaupan orang musyrik itu membuat tertarik karena kemuliaan, harta, ataupun kekuasaannya. Selanjutnya Allah menyebutkan alasan pengharaman itu dengan firman Nya, “Mereka” yaitu wanita-wanita dan lelaki musyrik itu mengajak ke neraka, maka bergaul dekat dengan mereka dapat membahayakan apalagi menikahi salah satu dari mereka. Allah ‘Azza wa Jalla mengajak hamba Nya ke surga dengan beriman dan beramal shalih, dan mengajak untuk memperoleh ampunan dengan bertaubat yang jujur, dan meminta dikabulkan oleh Nya dan menaati Nya dalam perintah dan larangan Nya. Begitu juga Allah Ta’ala menjelaskan ayat ini kepada manusia agar mereka mau mengingat dan mengambil pelajaran. Sehingga mereka mau taat kepadanya yang dapat mengantarkan kepada keridhoan dan surga Nya, dan menjauhkan mereka dari kemaksiatan yang dapat menyebabkan kemurkaan Allah dan masuk ke neraka. Pelajaran dari ayat: • Haramnya menikahi wanita-wanita musyrik. Adapun wanita-wanita ahli kitab diperbolehkan oleh Allah untuk menikahinya, dengan dasar sebuah ayat pada surat Al-Maidah dimana Allah Ta’ala berfirman, “Dan dihalalkan mengawini wanita-wanita yang menjaga kehormatan di antara orang-orang yang diberi Al-Kitab.” (QS Al-Maidah: 5) • Haramnya seorang wanita mukmin menikahi laki-laki kafir secara mutlak, baik itu laki-laki musyrik atau ahli kitab. • Syarat perwalian dalam pernikahan pihak wanita berdasarkan firman Allah Ta’ala, “Dan janganlah kalian menikahi laki-laki musyrik.” Di sini Allah Ta’ala mengajak bicara para wali wanita mukmin. Oleh karena itu tidak sah nikah tanpa ada wali. • Menghindari bergaul dengan orang-orang musyrik dan anjuran untuk menjauhi mereka, karena mereka mengajak kepada kekufuran dengan keadaan, ucapan, dan amalan mereka. Dengan itulah mereka mengajak ke neraka. • Kewajiban untuk memberikan loyalitas kepada orang-orang yang beriman, serta memusuhi orang-orang kufur dan sesat. Karena mereka mengajak ke neraka sedangkan orang beriman mengajak ke surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 221: Kemudian Allah melarang orang-orang yang beriman untuk menikahi wanita-wanita musyrik sampai wanita-wanita tersebut masuk Islam; dan Allah menjelaskan bahwasannya menikahi muslimah lebih baik daripada musyrikah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sampai mereka masuk Islam, ayat ini ditakhshis dengan ayat yang membolehkan menikahi wanita ahlul kitab. Ayat ini adalah umum tidak ada pentakhshisnya. Yakni orang-orang musyrik mengajak ke neraka. Inilah hikmah haramnya seorang muslim atau muslimah menikahi orang-orang musyrik. Allah Subhaanahu wa Ta'aala menerangkan hukum-hukum-Nya kepada manusia agar mereka dapat mengingat apa yang sebelumnya mereka lupakan, mengetahui apa yang ssebelumnya mereka tidak ketahui dan agar mengerjakan apa yang sebelumnya mereka sia-siakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 221",
    "description": "Pada ayat ini Allah memberi tuntunan dalam memilih pasangan. Dan janganlah kamu, wahai pria-pria muslim, menikahi atau menjalin ikatan perkawinan dengan perempuan musyrik penyembah berhala sebelum mereka benar-benar beriman kepada Allah dan nabi Muhammad. Sungguh, hamba sahaya perempuan yang beriman yang berstatus sosial rendah menurut pandangan masyarakat lebih baik daripada perempuan musyrik meskipun dia menarik hatimu karena kecantikan, nasab, kekayaannya, atau semisalnya. Dan janganlah kamu, wahai para wali, nikahkan orang laki-laki musyrik penyembah berhala dengan perempuan yang beriman kepada Allah dan rasulullah sebelum mereka beriman dengan sebenar-benarnya. Sungguh, hamba sahaya laki-laki yang beriman lebih baik daripada laki-laki musyrik meskipun dia menarik hatimu, karena kegagahan, kedudukan, atau kekayaannya. Ketahuilah, mereka akan selalu berusaha mengajak ke dalam kemusyrikan yang menjerumuskanmu ke neraka, sedangkan Allah mengajak dengan memberikan bimbingan dan tuntunan menuju jalan ke surga dan ampunan dengan rida dan izin-Nya. Allah menerangkan ayat-ayat-Nya, yakni tanda-tanda kekuasaan-Nya berupa aturan-aturan kepada manusia agar mereka mengambil pelajaran sehingga mampu membedakan mana yang baik dan membawa kemaslahatan, dan mana yang buruk dan menimbulkan kemudaratan. Pernikahan yang dilandasi keimanan, ketakwaan, dan kasih sayang akan mewujudkan kebahagiaan, ketenteraman, dan keharmonisan. Pada ayat ini Allah memberi tuntunan perihal aturan-aturan dalam menjalin hubungan suami-istri. Dan mereka, para sahabat, menanyakan kepadamu, wahai nabi Muhammad, tentang haid. Pertanyaan ini diajukan para sahabat ketika melihat pria-pria yahudi menghindari istri mereka dan tidak mau makan bersama mereka ketika sedang haid, bahkan mereka pun menempatkan para istri di rumah yang berbeda. Ayat ini kemudian turun untuk menginformasikan apa yang harus dilakukan oleh suami ketika istrinya sedang haid. Katakanlah, wahai rasulullah, bahwa haid itu adalah sesuatu, yakni darah yang keluar dari rahim wanita, yang kotor karena aromanya tidak sedap, tidak menyenangkan untuk dilihat, dan menimbulkan rasa sakit pada diri wanita. Karena itu jauhilah dan jangan bercampur dengan istri pada waktu haid. Dan jangan kamu dekati mereka untuk bercampur bersamanya sebelum mereka suci dari darah haidnya, kecuali bersenang-senang selain di tempat keluarnya darah. Apabila mereka telah suci dari haid dan mandi maka campurilah mereka sesuai dengan ketentuan yang diperintahkan Allah kepadamu jika kamu ingin bercampur dengan mereka. Sungguh, Allah menyukai orang yang tobat dari segala kesalahan yang diperbuatnya dan menyukai orang yang menyucikan diri dari kotoran lahiriah dengan mandi atau wudu."
  }
]