[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka bertanya kepadamu tentang darah haid, (yaitu darah yang mengalir dari kaum wanita secara alami pada waktu waktu tertentu). Katakanlah kepada mereka wahai nabi,\"itu adalah kotoran yang menjijikan, yang memudharatkan bagi orang yang mencampurinya, maka jauhilah untuk mencampuri istri-istri selama masa haid sampai darah itu berhenti, maka apabila darah tersebut telah berhenti, dan istri-istri telah mandi janabat, maka campurilah mereka pada tempat yang Allah halalkan bagi kalian, yaitu melalui kemaluan, buka lewat dubur. Sesungguhnya Allah menyukai hamba-hambanya yang banyak beristigfar dan bertaubat dan menyukai hamba-hamba yang menyucikan diri dengan menjauhi perbuatan perbuatan keji dan kotor."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "222. Dan sahabat-sahabatmu bertanya kepadamu -wahai Nabi- tentang haid (yaitu darah normal yang keluar dari rahim wanita pada waktu-waktu tertentu)? Katakanlah untuk menjawab pertanyaan mereka, “Darah haid itu adalah kotoran bagi laki-laki dan wanita. Maka hindarilah berhubungan badan dengan istri-istri kalian di masa haid. Jangan mendekati istri-istri kalian (yakni, menggauli dengan mereka) sampai darah haid mereka berhenti dan mereka bersuci darinya dengan cara mandi. Apabila darah haid itu sudah berhenti dan mereka sudah bersuci maka gaulilah bersama mereka dengan cara yang diperbolehkan oleh Allah, ketika mereka dalam keadaan suci (dari haid) dan di kubul (vagina) mereka. Sesungguhnya Allah mencintai orang-orang yang gemar bertaubat dari maksiat dan bersungguh-sungguh dalam bersuci dari segala macam kotoran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "222. Hai Rasulullah, orang-orang beriman bertanya kepadamu tentang berjima dengan istri ketika sedang haid. Jawablah mereka: berjima dengan istri pada waktu haid adalah sesuatu yang menjijikkan, membahayakan di dunia dan akhirat. Perbuatan ini tidak boleh dilakukan, maka jauhilah berjima dengan istri pada waktu haid sampai haid mereka selesai. Jika telah selesai dan mereka telah mandi, maka boleh bagi kalian berjima dengan mereka pada tempat yang dihalalkan Allah bagi kalian. Sungguh Allah Maha Mencintai orang-orang yang banyak beristighfar dan menjauhi perbuatan keji dan kotor."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "222. وَيَسْـَٔلُونَكَ عَنِ الْمَحِيضِ ۖ (Mereka bertanya kepadamu tentang mahidh) Yakni haidh. قُلْ هُوَ أَذًى (Katakanlah: “Haidh itu adalah suatu kotoran” ) Sebagai sindiran untuk sesuatu yang kotor dan bahaya. فَاعْتَزِلُوا۟ النِّسَآءَ فِى الْمَحِيضِ ۖ (Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh) Yakni jauhilah mereka pada saat berhaidh. Dan yang dimaksud dengan menjauhi disini adalah dengan meninggalkan jima’, bukan dengan meninggalkan duduk atau belaian untuk mereka, karena hal ini dibolehkan sebagaimana dibolehkan bersenang-senang dengan mereka asalkan tidak dengan kemaluan mereka, atau dengan apa yang berada diatas kain sarung. وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ (dan janganlah kamu mendekati mereka, sebelum mereka suci) Yakni sampai selesai haidh mereka. فَإِذَا تَطَهَّرْنَ (Apabila mereka telah suci) Yakni telah mandi dengan air. Sehinnga tidak dihalalkan mendatangi wanita haidh hingga haidh mereka telah berhenti dan selesai mandi dengan air, dan apabila tidak ada air maka dengan bertayammum فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّـهُ ۚ (maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu) Yakni dengan menjima’ mereka di tempat yang diperbolehkan oleh Allah yaitu qubul. Adapun mendapat lainnya mengatakan, yakni dengan cara yang halal, bukan dengan berzina dan hal yang haram lainnya. إِنَّ اللَّـهَ يُحِبُّ التَّوّٰبِينَ (Sesungguhnya Allah menyukai orang-orang yang bertaubat) Yakni bertaubat dari dosa-dosa. وَيُحِبُّ الْمُتَطَهِّرِينَ (dan menyukai orang-orang yang mensucikan diri) Yakni mensucikan diri dari junub dan hadast, serta menjauhkan diri dari najis-najis."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ } Jika Allah saja mencintai orang-orang yang berusaha mensucikan dirinya dari kotoran dan najis, lalu begaimana dengan orang-orang yang berusaha mensucikan dirinya dari dosa dan kesalahan! 2 ). { إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ } Tidak satupun aturan dimuka bumi yang peduli terhadap keindahan tubuh manusia seperti kepedulian al-qur'an! dan sesungguhnya kesucian dan kebersihan setiap muslim merupakan simbol yang membedakan mereka dengan bangsa-bangsa lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "222. Dan mereka bertanya kepadamu tentang berjima’ dengan istri pada waktu haid. Katakanlah kepada mereka: “Berjima’ di waktu haid itu bisa mendatangkan penyakit, yaitu sesuatu yang kotor dan berbahaya. Jauhilah mereka di waktu haid, maksudnya adalah meninggalkan jima’, bukan meninggalkan duduk bersama, ata menikmati hal lain selain farji atau sesuatu yang ditutup. Dan janganlah kalian mendekati mereka untuk berjima’ sampai mereka suci dari haidnya. Maka ketika mereka telah mandi dengan air, maka datangilah mereka dari tempat yang diperbolehkan oleh Allah, yaitu melalui qubul yang merupakan tempatnya melahirkan. Sesungguhnya Allah meridhai orang-orang yang bertaubat dari dosa-dosanya dan orang-orang yang bersuci dari jinabat, hadas, dan hal-hal yang kotor. Anas bin Malik berkata: “Orang Yahudi itu ketika wanita-wanita mereka haid, mereka tidak makan dan tidak berjima’ mereka di rumah, lalu para sahabat bertanya tentang hal itu kepada Nabi, lalu turunlah ayat ini dan bersabda: “Lakukanlah setiap sesuatu kecuali nikah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka bertanya kepadamu tentang haid} tentang haid {Katakanlah,“Itu adalah suatu kotoran,”} sesuatu yang kotor dan membuat kotor orang yang mendekatinya {Maka jauhilah para istri} Maka jauhilah jima’ dengan istri {pada waktu haid} pada waktu haid {dan jangan kalian dekati mereka} maka janganlah kalian berjima’ dengan mereka {hingga mereka suci} sampai berhenti darah haid mereka {Apabila mereka benar-benar suci} mereka mandi suci {campurilah mereka} kumpulilah mereka {sesuai dengan yang diperintahkan Allah kepada kalian} di tempat yang diperbolehkan oleh Allah, yaitu qubul {Sesungguhnya Allah menyukai orang-orang yang bertaubat dan menyukai orang-orang yang menyucikan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "222. Allah mengabarkan tentang pertanyaan mereka mengenai haid, apakah wanita setelah haid kondisinya sama seperti sebelum ia haid? ataukah harus dijauhi secara mutlak sebagaimana yang dilakukan oleh kaum Yahudi? Maka Allah mengabarkan bahwa itu adalah kotoran, maka apabila itu adalah kotoran, pastilah merupakan suatu hikmah bahwa Allah melarang dari kotoran itu sendiri. Karena itu Allah berfirman, “hendaklah kamu menjauhkan diri dari wanita di waktu haid,” artinya, tempat keluarnya haid. Maksudnya, berjima di kemaluan khususnya, karena hal itu haram hukumnya menurut ijma’. Pembatasan dengan kata menjauh dari tempat haid menunjukkan bahwa bercumbu dengan istri yang haid, menyentuh tanpa berjima pada kemaluannya adalah boleh. Akan tetapi firmanNya, “dan janganlah kamu mendekati mereka sebelum mereka suci,” menunjukkan harusnya meninggalkan mencumbu bagian yang dekat dengan kemaluan, yaitu bagian di antara pusar dan lutut, sebagaimana nabi melakukannya, bila beliau akan mencium istrinya pada saat istrinya itu sedang haid, beliau memerintahkan kepadanya untuk memakai kain lalu beliau mencumbunya. Batasan waktu menjauhi dan tidak mendekati istri yang haid adalah, “sampai mereka suci,” yaitu, dari mereka telah berhenti, maka apabila dalam mereka telah berhenti, hilanglah penghalang yang laku saat darah masih mengalir.Syarat kehalalannya ada dua, terputusnya darah, dan mandi suci darinya. Ketika darahnya berhenti, lenyaplah syarat pertama hingga tersisa saraf kedua. Maka oleh karena itu Allah berfirman, “Apabila mereka telah Suci,” maksudnya mereka telah mandi, “maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu,” yaitu pada kemaluan depan dan bukan lubang bagian belakang, karena itulah tempatnya bersenggama. Ayat ini merupakan dalil atas wajibnya mandi bagi seorang wanita haid, dan bahwasanya terputusnya darah adalah syarat sahnya mandi. Dan tatkala larangan tersebut merupakan kasih sayang dari Allah kepada hamba-hambaNya dan pemeliharaan dari kotoran, maka Allah berfirman, “Sesungguhnya Allah menyukai orang-orang yang bertaubat”, yaitu dari dosa-dosa mereka secara terus-menerus, “dan menyukai orang-orang yang menyucikan diri,” yaitu, yang bersuci dari dosa-dosa, dan ini mencakup segala macam bersuci dari yang bersifat material seperti dari najis maupun hadats. Ayat ini juga menunjukkan disyariatkannya bersuci secara mutlak, karena Allah menyukai orang-orang yang bersifat dengannya (yakni yang suka bersuci). Itulah sebabnya, bersuci secara mutlak adalah syarat sahnya shalat, tawaf, dan bolehnya menyentuh mushaf. Juga bersuci secara maknawi seperti (menyucikan diri) dari akhlak akhlak yang hina, sifat-sifat yang rendah, dan perbuatan-perbuatan yang kotor."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡمَحِيضِۖ } Al-Mahidh : Haidh dan waktunya. Haidh adalah darah yang keluar dari rahim wanita apabila kosong dari janin. { أَذٗى } Adzan : hal yang berbahaya bagi yang menyetubuhinya pada hari-hari ketika haidh. { فَٱعۡتَزِلُواْ ٱلنِّسَآءَ فِي ٱلۡمَحِيضِ } Fa’tazilunnisaa’a fil mahiidh : Maka jangan kalian gauli istri-istri kalian pada hari-hari mereka haidh. { وَلَا تَقۡرَبُوهُنَّ حَتَّىٰ يَطۡهُرۡنَۖ } Walaa Taqrobuhunna hatta yathurna : Jangan kalian menggauli mereka sampai berhenti darah haidhnya. { فَإِذَا تَطَهَّرۡنَ } Fa idza tathaharna : Yaitu apabila darah haidhnya sudah berhenti dan sudah mandi. { فَأۡتُوهُنَّ مِنۡ حَيۡثُ أَمَرَكُمُ ٱللَّهُۚ } Fa’tuhunna min haitsu amarakumullah : Maknanya gaulilah mereka pada tempatnya (kemaluan, pent), dan mereka sudah suci dan bersuci. Makna ayat: Allah Ta’ala mengabarkan kepada rasul Nya bahwa sebagian kaum mukminin bertanya tentang perempuan yang haidh, apakah mereka tinggal bersamanya, makan, minum, atau dijauh secara keseluruhan sampai ia suci, yang mana ini adalah adat jahiliyah. Allah memerintahkan rasul Nya agar mengatakan kepada mereka haidh merupakan penyakit yang membahayakan bagi suami yang menggauli istrinya pada saat haidh. Bagi suami wajib menjauhi istrinya pada persetubuhan saja, bukan dalam pergaulan sehari-hari, makan dan minum. Yaitu pada perkara persetubuhan saja tatkala darah haidh masih mengalir, dan tidak mengapa untuk menggauli istri yang sedang haidh selain batas antara pusar dan lutut, berdasarkan hadits shahih dalam masalah ini. Kemudian Allah Ta’ala menekankan larangan ini dengan firman Nya “Jangan kalian dekati mereka” yaitu jangan kalian setubuhi mereka (para istri, pent) sampai mereka suci dan berhenti darahnya, dan kemudian bersuci (mandi) setelahnya. “Apabila mereka telah bersuci” yaitu mandi “Datangilah mereka sesuai apa yang Allah perintahkan” yaitu menyetubuhi istri pada qubul (kemaluan) bukan pada duburnya, karena hal itu haram. Kemudian Allah memberitahukan Nabi Nya bahwa Dia mencintai orang-orang yang bertaubat dari dosa-dosa, menyucikan dirinya dari najis dan kotoran. Oleh karena itu bertaubatlah dan sucikanlah diri kalian agar dapat meraih kecintaan Allah Ta’ala. Inilah makna ayat 222. Pelajaran dari ayat: • Keharaman menyetubuhi istri tatkala sedang haidh dan nifas karena terdapat bahaya, berdasarkan firman Allah, “Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh dan janganlah kamu mendekati mereka, sebelum mereka suci. • Keharaman menyetubuhi istri tatkala sudah berhenti darah haidh atau nifasnya namun belum bersuci (mandi), berdasarkan firman Allah Ta’ala, “apabila mereka telah suci, maka campurilah mereka itu.” • Keharaman menyetubuhi wanita pada duburnya berdasarkan firman Allah Ta’ala,”Maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu.” • Kewajiban untuk menyucikan diri dari dosa-dosa dengan cara bertaubat, dan menyucikan dari kotoran dan najis dengan memakai air."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 222: Bertanya sahabat nabi ﷺ tentang haid, nabi berkata kepada mereka: ketahuilah wahai manusia bahwasannya haid adalah kotoran dan ia membahayakan; maka wajib bagi kalian meninggalkan wanita dan dari menijma’ nyasampai selesai masa haid dan tidak boleh bagi kalian menijma’nya sampai selesai darah haid kemudian cuci."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Anas, bahwa orang-orang Yahudi apabila istri mereka haidh, mereka tidak makan bersama istrinya dan tidak bergaul dengannya. Para sahabat bertanya kepada Nabi shallallahu 'alaihi wa sallam tentang hal itu, maka Allah menurunkan ayat, \"Wayas-aluunaka 'anil mahiidh, qul huwa adzan fa'tazilun nisaa' fil mahiidh\", lalu Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Berbuatlah apa saja selain jima'.\" Kemudian berita itu sampai kepada orang-orang Yahudi, lalu mereka berkata, \"Apa yang diinginkan orang ini (yakni Nabi Muhammad shallallahu 'alaihi wa sallam) ketika meninggalkan salah satu kebiasaan kita, lantas kemudian menyelisihi.\" Maka Usaid bin Hudhair dan 'Abbad bin Bisyr datang (kepada Rasulullah) dan berkata, \"Wahai Rasulullah, sesungguhnya orang-orang Yahudi berkata begini dan begitu. Oleh karena itu, kami tidak bergaul dengan mereka (para istri).\" Maka wajah Rasulullah shallallahu 'alaihi wa sallam berubah (marah) sehingga kami mengira bahwa Beliau akan marah kepada keduanya, maka keduanya keluar, lalu ketika keluar tiba-tiba ada hadiah susu yang diberikan kepada Nabi shallallahu 'alaihi wa sallam. Nabi shallallahu 'alaihi wa sallam kemudian mengirimkan seseorang untuk mencari mereka berdua (untuk memberikan minuman), maka mereka pun mengetahui bahwa Nabi shallallahu 'alaihi wa sallam tidak marah kepada mereka berdua. Maksudnya jangan bercampur dengan wanita di waktu haidh, adapun selain jima', maka bersenang-senang dengan istri di waktu haidh diperbolehkan. Maksudnya sesudah mandi. Ada pula yang menafsirkan sesudah darah berhenti keluar. Yaitu di qubul, bukan di dubur. Baik dari hadats matupun dari najis. Dalam ayat ini terdapat dalil disyari'atkan bersuci secara mutlak, karena Allah menyukai orang yang suci. Oleh karena itu, suci merupakan syarat sahnya shalat dan thawaf . Termasuk suci pula adalah suci maknawi, dalam arti suci dari akhlak yang buruk, sifat yang jelek dan perbuatan yang hina."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 222",
    "description": "Pada ayat ini Allah memberi tuntunan perihal aturan-aturan dalam menjalin hubungan suami-istri. Dan mereka, para sahabat, menanyakan kepadamu, wahai nabi Muhammad, tentang haid. Pertanyaan ini diajukan para sahabat ketika melihat pria-pria yahudi menghindari istri mereka dan tidak mau makan bersama mereka ketika sedang haid, bahkan mereka pun menempatkan para istri di rumah yang berbeda. Ayat ini kemudian turun untuk menginformasikan apa yang harus dilakukan oleh suami ketika istrinya sedang haid. Katakanlah, wahai rasulullah, bahwa haid itu adalah sesuatu, yakni darah yang keluar dari rahim wanita, yang kotor karena aromanya tidak sedap, tidak menyenangkan untuk dilihat, dan menimbulkan rasa sakit pada diri wanita. Karena itu jauhilah dan jangan bercampur dengan istri pada waktu haid. Dan jangan kamu dekati mereka untuk bercampur bersamanya sebelum mereka suci dari darah haidnya, kecuali bersenang-senang selain di tempat keluarnya darah. Apabila mereka telah suci dari haid dan mandi maka campurilah mereka sesuai dengan ketentuan yang diperintahkan Allah kepadamu jika kamu ingin bercampur dengan mereka. Sungguh, Allah menyukai orang yang tobat dari segala kesalahan yang diperbuatnya dan menyukai orang yang menyucikan diri dari kotoran lahiriah dengan mandi atau wudu. Istri-istrimu adalah ibarat ladang bagimu tempat kamu menanam benih. Karena itu, maka datangilah ladangmu itu untuk menyemai benih kapan saja kamu suka kecuali bila istrimu sedang haid, dan dengan cara yang kamu sukai, asalkan arah yang dituju adalah satu, yaitu farji. Dan utamakanlah hubungan suami istri itu untuk tujuan yang baik untuk dirimu demi kemaslahatan dunia dan akhirat, bukan sekadar melampiaskan nafsu. Bertakwalah kepada Allah dalam menjalin hubungan suami-istri, dan ketahuilah bahwa kamu kelak akan menemui-Nya untuk menerima imbalan atas amal perbuatanmu selama di dunia. Dan sampaikanlah kabar gembira kepada orang yang beriman yang imannya dapat mengantar mereka mematuhi tuntunan-tuntunan ilahi."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Imam Ahmad meriwayatkan dari anas, bahwasanya jika wanita orang-orang Yahudi sedang haid, maka mereka tidak mau memberinya makan dan tidak mau menidurinya. Maka kemudian sahabat Nabi sholallohu ‘alaihi wasallam menanyakan masalah ini kepada Nabi sholallohu ‘alaihi wasallam, maka Allah menurunkan ayat : وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ وَلَا تَقْرَبُوهُنَّ حَتَّى يَطْهُرْنَ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ Mereka bertanya kepadamu tentang haidh. Katakanlah: \"Haidh itu adalah suatu kotoran\". Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh; dan janganlah kamu mendekati mereka, sebelum mereka suci. Apabila mereka telah suci, maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu. Sesungguhnya Allah menyukai orang-orang yang bertaubat dan menyukai orang-orang yang mensucikan diri\". Kemudian Nabi sholallohu ‘alaihi wasallam bersabda : “Lakukakanlah apa saja selain berhubungan badan”. Maka berita ini sampai kepada orang-orang Yahudi, lalu mereka pun berkata : “orang ini (Muhammad) tidak meninggalkan satu perkara pun dari urusan kita kecuali menyelisihinya”. Kemudian datanglah Usaid bun hudhair dan Ubad bin Basyar, keduanya berkata : “Ya Rosululloh, sesungguhnya orang-orang Yahudi telah mengatakan begini dan begitu, apakah tidak kita campuri saja wanita yang haid itu?”. Maka berubahlah raut muka Rosululloh sholallohu ‘alahi wasallam sehingga kami kira beliau sedang marah kepada keduanya. Selanjutnya kedua orang itu pergi, lalu datanglah hadiah berupa susu untuk beliau. Kemudian beliau mengutus utusannya kepada keduanya dan memanggil untuk diberikan kepada keduanya. Akhirnya keduanya mengetahui bahwa beliau tidak marah kepada mereka. (HR. MUSLIM) Berkenaan masalah hukum wanita yang haid dalam Islam, ayat ini begitu jelas memberikan batasan syariat dalam berinteraksi dengannya. Tidak seperti kebiasaan orang-orang Yahudi yang tidak memperlakukan wanita haid layaknya manusia. Islam membolehkan interaksi apapun dengan wanita haid selain satu hal saja, yaitu berhubungan badan di area farji (kemaluan). Adapun selain area kemaluan maka boleh untuk dinikmati oleh suami, hal ini berdasarkkan hadits yang diriwayatkan Abu Daud dari Ikrimah dari sebagian istri-istri nabi Sholallohu ‘alaihi wasallam bahwasanya Nabi sholallohu ‘alaihi wasallam jika ingin bercumbu dengan istrinya yang haid, maka beliau menyimpan kain yang menutupi farji isrinya. Abu Daud juga meriwayatkan hadits dari Imaroh bin Gharab, bahwa bibinya pernah memberitahukan kepadanya bahwa ia pernah bertanya kepada Aisyah rhodiyallohu ‘anha, “salah seorang dari kami sedang haid, sementara ia dan suaminya tidak mempunyai tempat tidur kecuali satu saja”. Maka Aisyah pun berkata; “Akan aku beritahukan kepadamu tentang apa yang pernah dilakukan Rosululloh sholallohu ‘alaihi wasallam, suatu hari beliau pernah mamasuki rumah dan langsung menuju ke mesidnya”. (Abu Daud mengatakan bahwa yang dimaksud masjid disini adalah tempat shalat di rumahnya). Dan ketika beliau kembali aku telah terlelap tidur. Saat itu beliau tengah diserang kedinginan, maka beliau berkata kepadaku; “mendekaplah kepadaku”. Lalu aku katakan kepada beliau; “aku sedang haid”. Dan beliau pun berkata : “singkapkanlah kedua pahamu”. Maka aku pun membuka pahaku, dan kemudian beliau meletakan pipi dan dadanya diatas pahaku. Dan aku pun mendengkapkan tubuh beliau sehingga terasa hangat, hingga beliau tertidur”. Banyak riwayat yang menjelaskan mengenai aktivitas Rosululloh sholallohu ‘alaihi wasallam bersama istri-istrinya di saat mereka sedang haid. Dan semuanya menjelaskan bahwa nabi melakukan aktivitas normal dengan mereka seperti keseharian sucinya mereka kecuali jima’ yang beliau tinggalkan. Seperti dalam riwayat Aisyah rhidiyallohu ‘anha berikut ini : كنت أتعرق العرق وأنا حائض ، فأعطيه النبي صلى الله عليه وسلم ، فيضع فمه في الموضع الذي وضعت فمي فيه ، وأشرب الشراب فأناوله ، فيضع فمه في الموضع الذي كنت أشرب . “Aku pernah menggigit daging sedangkan aku sedang Haid. Kemudian aku berikan daging itu kepada Nabi sholalohu ‘alaihi wasallam, maka beliau menggigit pada bagian yang telah aku gigit. Aku juga minum, lalu aku berikan minuman itu kepada beliau, maka beliaupun meletakkan bibirnya pada bagian yang aku minum”. Dalam riwayat Abu Daud yang lain dari Mu’adz bin Jabal berkata : سألت رسول الله صلى الله عليه وسلم عما يحل لي من امرأتي وهي حائض . قال : \" ما فوق الإزار ، والتعفف عن ذلك أفضل \" “Aku pernah bertanya kepada Rosululloh sholallohu ‘alaihi wasallam tentang apa yang dihalalkan untuk ku dari istriku disaat dia haid. Maka Beliau menjawab; “engkau boleh berbuat apa saja terhadapnya pada bagian di atas kain, dan menghindari hal itu adalah tindakan yang lebih baik” (HR. ABU DAUD) Berdasarkan urauian hadits-hadits di atas, maka para ulama menyimpulkan haramnya berjima’ dengan wanita yang sedang haid sehingga perbuatan tersebut menjadi dosa. Namun mereka berbeda pendapat tentang kewajiban apa bagi orang yang melakukan hal itu selai taubat kepada Allah ta’ala. Imam Ahmad dalam riwayatnya mengatakan wajibnya membayar kifarat bagi orang yang berjma’ dengan wanita yang haid. Berdasarkan riwayat Ibnu Abbas rhodiyallohu ‘anhu dari Nabi sholallohu ‘alaihi wasallam tentang orang yang menjima’ istrinya saat haid : يتصدق بدينار ، أو نصف دينار “Hendaklah bersedekah dengan satu dinar atau setengah dinar”. Sedangkan Madzhab Syafii dan Jumhur ulama berpendapat cukup beristigfar dan bertobat saja kepada Allah ta’ala, dan tidak ada kewajiban untuk membayar kifarat apapun. Para Ulama sepakat bahwa seorang suami dilarang untuk menjima’ istrinya setelah selesai haidnya kecuali mereka telah bersuci dengan mandi atau tayamum jika tidak ada air atau ada alasan yang membolehkan tayamum. Berbeda dengan pendapat Abu Hanifah yang mengatakan bolehnya lengsung menjima’ wanita haid setelah selesai haidnya walaupun belum bersuci. Bolehnya menjima wanita yang sudah selesai haidnya dengan cara apapun hanya di kemaluannya, akan tetapi diharamkan menjima’nya pada duburnya. “Sesungguhnya Allah menyukai orang-orang yang bertaubat dan menyukai orang-orang yang mensucikan diri”"
  }
]