[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Istri-istri kalian adalah tempat menyemai benih dari kalian. Kalian menaruh sperma dalam rahim-rahim mereka, lalu lahirlah darinya anak-anak dengan kehendak Allah. Maka campurilah mereka pada tempat persenggamaan saja, yaitu kemaluan dengan cara apapun yang kalian inginkan. Lakukanlah amal-amal shalih bagi diri kalian dengan memperhatikan perintah-perintah Allah, dan takutlah kepada Allah, serta ketahuilah bahwa sesungguhnya kalian akan berjumpa dengan Nya untuk perhitungan amal perbuatan pada hari kiamat. Dan berilah kabar gembira kepada kaum Mukminin (wahai nabi), dengan hal-hal yang menyenangkan dan membahagiakan mereka berupa balasan yang baik di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "223. Istri-istri kalian adalah tempat kalian bercocok tanam. Merekalah yang melahirkan anak-anak kalian. Seperti tanah yang menghasilkan buah-buahan. Maka datangilah ladangmu -yakni kubul istri kalian- dari arah manapun dan dengan cara bagaimanapun yang kalian kehendaki jika melalui kubul. Dan beramallah untuk diri kalian dengan melakukan kebajikan-kebajikan, di antara dengan cara seorang suami menggauli istrinya dengan niat beribadah kepada Allah dan berharap mendapatkan keturunan yang saleh. Dan bertakwalah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Salah satunya ialah dalam urusan wanita. Ketahuilah bahwa kalian akan berjumpa dengan-Nya kelak di hari kiamat. Kalian akan berdiri di hadapan-Nya dan Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian. Dan berikanlah kabar gembira -wahai Nabi- kepada orang-orang mukmin tentang sesuatu yang menyenangkan hati mereka ketika berjumpa dengan Rabb mereka, yaitu kenikmatan abadi dan memandang wajah Rabb Yang Mulia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "223. Istri-istri kalian adalah tempat kalian untuk memperoleh keturunan, maka campurilah mereka pada vagina dengan posisi yang kalian kehendaki. Dan berbuat baiklah kalian kepada diri kalian sendiri dengan melaksanakan amal-amal shalih, dan takutlah kalian kepada Allah dan yakinlah bahwa kalian akan bertemu dengan-Nya pada hari kiamat untuk dihisab. Dan berilah kabar gembira bagi orang-orang beriman berupa surga dan seisinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "223. نِسَآؤُكُمْ حَرْثٌ لَّكُمْ (Isteri-isterimu adalah (seperti) tanah tempat kamu bercocok tanam) Yakni mereka adalah tempat untuk menanam keturunan sebagaimana kebun tempat untuk menaman tumbuhan. أَنَّىٰ شِئْتُمْ ۖ (maka datangilah bagaimana saja kamu kehendaki) Yakni dari arah yang kalian inginkan, dari belakang, depan, duduk, terlentang, atau tengkurap asalkan ditempat yang bercocok tanam yang dibolehkan. وَقَدِّمُوا۟ لِأَنفُسِكُمْ ۚ (Dan kerjakanlah (amal yang baik) untuk dirimu) Yakni kerjakanlah amal kebaikan niscaya kalian akan mendapati pahalanya disisi Allah. وَاتَّقُوا۟ اللَّـهَ (dan bertakwalah kepada Allah) Yakni bertakwalah kepada Allah agar tidak terjerumus kedalam sesuatu yang diharamkan. وَاعْلَمُوٓا۟ أَنَّكُم مُّلٰقُوهُ (dan ketahuilah bahwa kamu kelak akan menemui-Nya) Ini adalah sebagai ungkapan peringatan keras."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini salah satu diantara kinayah yang indah dan ta'ridh yang baik, ayat ini dan semacamnya adalah pelajaran yang mengajarkan adab yang baik, bagi setiap muslim hendaknya mengetahui dan mengambilnya sebagai pedoman dalam beradab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "223. Istri-istri kalian adalah tempat melahirkan dan ladang sperma, maka datangilah mereka dengan cara apapun yang kalian kehendaki baik berdiri maupun duduk, duduk maupun tidur, baik tengkurap atau terlentang, ketika hal itu di tempat melahirkan keturunan. Dan kerjakanlah amal baik yang kalian dapati di sisi Allah dan takutlah kepadaNya agar tidak terjerumus dalam keharaman. Dan ketahuilah bahwa kalian akan bertemu Allah pada hari kiamat, lalu Dia akan membalas kalian sesuai amal kalian. Dan berilah kabar gembira tentang surga kepada orang-orang mukmin. Jabir berkata: “Waita Yahudi berkata bahwa ketika dia dijima’ pada bagian qubul lewat belakang maka anaknya akan juling, lalu turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Istri kalian adalah ladang bagi kalian} tempat menanam benih mani kalian {Maka datangilah ladang kalian itu bagaimanapun yang kalian sukai} dari segala arah yang kalian kehendaki dengan syarat menempatkannya di tempat berladang {Utamakanlah untuk diri kalian. Bertakwalah kepada Allah dan ketahuilah bahwa kalian akan menghadap kepadaNya. Sampaikanlah kabar gembira kepada orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "223. “Istri-istrimu adalah (seperti) tanah tempat bercocok tanam bagimu, maka datangilah tanah tempat bercocok tanam itu bagaimana saja kamu kehendaki” dari depan atau dari belakang, yang jelas tidak boleh dilakukan kecuali pada kemaluan (qubul), karena itu tempatnya bercocok tanam, dan bagian itulah tempat keluarnya anak. Ayat ini juga merupakan dalil atau sarangnya berjima pada lubang belakang (dubur), karena Allah tidak membolehkan mencampuri wanita kecuali dari bagian yang menjadi tempat bersanggama, dan tempat banyak hadits-hadits yang diriwayatkan dari nabi tentang haramnya hal tersebut dan beliau melaknat pelakunya. “Dan kerjakanlah (amal yang baik) untuk dirimu,” maksudnya, mendekatkan diri kepada Allah dengan mengerjakan kebajikan kebajikan, dan diantaranya adalah seorang suami menggauli istrinya dan berjumlah bersamanya dengan maksud ketaatan dan mengharap pahala serta mengharapkan keturunan dari nya yang diberi manfaat oleh Allah dengan keberadaan mereka. “Dan bertakwalah kepada Allah,” yakni, dalam berbagai kondisi kalian. Tetaplah kalian berada di atas ketakwaan kepada Allah dengan menjadikan ilmu kalian sebagai pendorong untuk bertakwa, “bahwa kamu kelak akan menemuiNya,” dan memberi balasan buat kalian atas amalan-amalan kalian yang sholeh dan selainnya (yang tidak baik). Kemudian Allah berfirman, “Dan berilah kabar gembira bagi orang-orang yang beriman.” Allah tidak menyebutkan hal-hal yang menjadi kabar gembira buat mereka demi menunjukkan kepada hal yang bersifat umum dan bahwasanya bagi mereka kabar gembira pada kehidupan dunia dan akhirat. Setiap kebaikan dan terhindarnya setiap madharat yang diakibatkan dari keimanan, maka ia termasuk dalam kabar gembira tersebut. Ayat ini menunjukkan kecintaan Allah kepada kaum mukminin, dan kecintaan terhadap apa yang membuat mereka merasa bahagia, serta membangkitkan semangat dan kerinduan mereka kepada apa yang dijanjikan oleh Allah dari pahala duniawi maupun ukhrawi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { نِسَآؤُكُمۡ حَرۡثٞ لَّكُمۡ } Nisaa’ukum hartsun lakum : yaitu tempat untuk melahirkan anak-annak, wanita disamakan dengan ladang, karena tanah apabila ditanami akan menumbuhkan tanaman, dan wanita ketika disetubuhi suaminya akan melahirkan anak ddengan izin Allah Ta’ala. { فَأۡتُواْ حَرۡثَكُمۡ أَنَّىٰ شِئۡتُمۡۖ } Fa’tuu hatsakum annaa syi’tum : yaitu dengan menggauli mereka dari depan maupun belakang asalkan tetap pada kemaluannya, tempat tumbuhnya benih. Dan ia dalam keadaan suci dari haidh dan nifas. { وَقَدِّمُواْ لِأَنفُسِكُمۡۚ } Wa qoddimu li anfusikum : Maksudnya adalah berbagai macam amalan shaleh, di antaranya keinginan untuk melindungi diri dan istrinya dengan bersetubuh dan keinginan untuk melahirkan anak-anak yang shalih, yang bertauhid kepada Allah dan mendoakan kedua orangtuanya sepanjang hidup. Makna ayat: Adapun ayat 223 yaitu firman Nya (Istri-istri kalian adalah ladang bagi kalian) mengandung jawaban atas pertanyaan apakah boleh untuk menyetubuhi istri dari arah belakangnya, dimana terdapat pertanyaan seperti ini dari sebagian mereka. Maka Allah Ta’ala mengabarkan bahwa tidak ada larangan untuk melakukan itu asalkan tetap dalam kemaluannya, dan istri dalam keadaan suci dari haidh dan nifas. Dinamakan wanita sebagai ladang karena rahimnya adalah tempat untuk tumbuhnya anak sebagaimana tanaman dapat tumbuh di atas tanah yang baik. Selama perkaranya seperti itu, maka boleh bagi suami untuk menggauli istrinya dari arah depan ataupun belakang sesuai keinginannya, karena tuuannya untuk menjaga dari perbuatan keji dan mengharapkan anak keturunan. Firman Nya “bagaimana saja kamu kehendaki“ maksudnya pada keadaan mendatanginya dari depan maupun belakang, terserah kalian dengan syarat tetap pada kemaluan, bukan pada duburnya. Kemudian Allah Ta’ala menasehati hamba-hamba Nya dengan firman Nya “Dan kerjakanlah (amal yang baik) untuk dirimu“ berupa kebaikan yang bermanfaat bagi kalian untuk akhirat dan ketahuilah bahwa kalian akan bertemua dengan Allah maka janganlah kalian lalai dari mengingat Nya dan taat kepada Nya. Karena inilah bekal yang bermanfaat bagi kalian pada hari kalian berdiri di hadapan Nya. Terkahir, Allah memerintahkan rasul Nya untuk memberikan kabar gembira kepada orang-orang mukmin dengan kebaikan di dunia dan akhirat, serta kebahagiaan pada keduanya bagi siapa saja yang imannya benar dan menumbuhkan ketakwaan serta amal shaleh. Pelajaran dari ayat: • Kewajiban menyegerakan beramal shaleh agar dapat menjadi bekal bagi seroang muslim menuju negeri akhirat, berdasarkan firman Allah,...” • Kewajiban bertakwa kepada Allah Ta’ala dengan melakukan apa yang diperintahkan dan meninggalkan apa yang dilarang dan diperingatkan oleh Nya. • Kabar gembira dari Alalh melalui lisan rasul Nya ﷺ bagi setiap mukmin dan mukminah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 223: Allah mengabarkan bahwasannya istri-istri kalian adalah sumber anak-anak kalian maka ijma’ lah mereka menurut apa yang engkau sukai naik didepan maupun dibelakang dengan syarat di kemaluan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Jabir bin Abdullah ia berkata, \"Orang-orang Yahudi mengatakan, bahwa jika seseorang menjima'i istrinya dari belakang, maka anaknya akan lahir dalam keadaan matanya juling, maka turunlah ayat, \"Nisaa'ukum hartsul lakum fa'tuu hartsakum annaa syi'tum.\" Yakni tempat kamu menaruh benih agar dapat membuahkan anak dengan kehendak Allah. Dengan tetap di qubul bagaimana pun caranya. Dalam ayat ini terdapat dalil haramnya menjima'i istri di dubur, karena Allah Subhaanahu wa Ta'aala tidak membolehkan mendatangi wanita kecuali di tempat yang bisa membuahkan anak. Yakni siapkanlah untuk dirimu amal shalih, termasuk di dalamnya adalah menjima'i istri dengan niat ibadah dan memperoleh pahala dan dengan berharap memperoleh keturunan yang bermanfaat. Tidak disebutkan apa kabar gembiranya untuk menunjukkan keumuman, yakni kaum mukmin berhak mendapatkan kabar gembira di dunia dan di akhirat. Dalam ayat ini terdapat anjuran untuk memberikan kabar gembira kepada kaum mukmin, dan bahwa Allah mencintai orang-orang yang mukmin dan mencintai hal yang menggembirakan mereka. Di ayat ini terdapat anjuran memberikan semangat kepada kaum mukmin dengan balasan yang akan diberikan Allah kepada mereka baik di dunia maupun akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 223",
    "description": "Istri-istrimu adalah ibarat ladang bagimu tempat kamu menanam benih. Karena itu, maka datangilah ladangmu itu untuk menyemai benih kapan saja kamu suka kecuali bila istrimu sedang haid, dan dengan cara yang kamu sukai, asalkan arah yang dituju adalah satu, yaitu farji. Dan utamakanlah hubungan suami istri itu untuk tujuan yang baik untuk dirimu demi kemaslahatan dunia dan akhirat, bukan sekadar melampiaskan nafsu. Bertakwalah kepada Allah dalam menjalin hubungan suami-istri, dan ketahuilah bahwa kamu kelak akan menemui-Nya untuk menerima imbalan atas amal perbuatanmu selama di dunia. Dan sampaikanlah kabar gembira kepada orang yang beriman yang imannya dapat mengantar mereka mematuhi tuntunan-tuntunan ilahi. Usai menjelaskan hubungan harmonis suami-istri dalam rumah tangga, Allah menjelaskan adanya hubungan kurang harmonis antara keduanya yang sengaja ditutup-tutupi melalui sumpah. Dan janganlah kamu jadikan nama Allah selalu disebut-sebut dalam sumpahmu lantaran sumpah itu kamu jadikan sebagai penghalang untuk berbuat kebajikan, bertakwa dan menciptakan kedamaian di antara manusia. Mengucapkan sumpah atas nama Allah untuk tidak mengerjakan perbuatan baik, seperti demi Allah, aku tidak akan membantu anak yatim, dilarang oleh agama. Jika telanjur diucapkan maka sumpah itu harus dibatalkan dengan membayar kafarat atau denda berupa salah satu dari tiga pilihan, yakni memberi makan sepuluh orang miskin sekali makan, memberi pakaian kepada mereka, memerdekakan budak, atau puasa tiga hari, seperti dijelaskan dalam surah al-ma''idah/5: 89. Allah maha mendengar apa yang kamu ucapkan, maha mengetahui apa yang kamu kerjakan."
  }
]