[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian (wahai kaum muslimin), menjadikan sumpah kalian dengan nama Allah sebagai penghalang bagi kalian untuk berbuat kebaikan, dan menyambung silaturahim, bertakwa dan memperbaiki hubungan antara manusia, dengan meninggalkan perbuatan tersebut dan kalian beralasan bahwa kalian telah bersumpah untuk tidak melakukan hal-hal itu. Justru, menjadi kewajiban orang bersumpah untuk mengesampingkan sumpah nya dan melakukan amal-amal kebaikan lalu membayar kafarat atas sumpahnya dan tidak membiasakannya. Dan Allah maha mendengar ucapan ucapan kalian lagi Maha Mengetahui semua keadaan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "224. Janganlah kalian menjadikan nama Allah sebagai alasan -karena kalian menyebut nama-Nya dalam sumpah kalian- yang menghalangi kalian dari kebajikan, ketakwaan dan mendamaikan manusia. Apabila kalian bersumpah untuk tidak melakukan kebajikan, maka lakukanlah kebajikan dan bayarlah kafarat atas sumpah kalian itu. Allah Maha Mendengar ucapan kalian lagi Maha Mengetahui perbuatan kalian, dan akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "224. Allah melarang orang-orang beriman untuk membuat sumpah mereka dengan nama Allah menjadi penghalang mereka untk berbuat baik, ketakwaan, dan perbaikan hubungan di antara manusia. Hal ini dapat terjadi ketika dia diajak untuk berbuat baik, namun dia menolak dengan alasan telah bersumpah untuk tidak melakukannya. Jika ini terjadi maka selayaknya dia melakukan kebaikan itu kemudian membayar kafarat atas sumpahnya yang dia langar. Sungguh Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala keadaan dan perbuatan. Diriwayatkan oleh Abdurrahman bin Samrah dengan sanad marfu’: “Jika kalian bersumpah kemudian merasa bahwa perbuatan yang menyelisihi sumpah itu lebih baik daripada menjalankan sumpah, maka batalkanlah sumpahmu dan bayar kafarat, lalu lakukanlah perbuatan yang lebih baik tersebut.” (Shahih Bukhari, sumpah dan nazar, bab 1, no. 1622)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "224. وَلَا تَجْعَلُوا۟ اللَّـهَ عُرْضَةً لِّأَيْمٰنِكُمْ (Jangahlah kamu jadikan (nama) Allah dalam sumpahmu sebagai penghalang) Yakni apabila kalian bersumpah untuk memutus silaturrahim, untuk tidak bersedekah, atau untuk tidak memperbaiki hubungan antara dua pihak yang berselisih, maka janganlah kalian jadikan sumpah dengan nama Allah itu sebagai penghalang untuk melakukan kebaikan, untuk itu bayarlah kafarat atas sumpah tersebut, lalu lakukanlah kebaikan itu. أَن تَبَرُّوا۟ (untuk berbuat kebajikan) Disebutkan dalam shohih Bukhari dan Muslim bahwa Rasulullah bersabda: barangsiapa yang bersumpah dengan nama Allah kemudian merasa bahwa selain yang disumpahkan adalah lebih baik maka hendaklah dia melakukan yang lebih baik itu kemudian membayar kafarat sumpahnya. Disebutkan juga dalam shohih bukhari dan Muslim Rasulullah bersabda: sesungguhnya aku demi Allah, InsyaAllah tidaklah aku bersumpah kemudian aku melihat sesuatu yang lebih baik kecuali aku melakukan kebaikan itu lalu aku membayar kafarat untuk menghalalkan sumpahku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "224. Jangan kalian jadikan sumpah dengan menyebut nama Allah untuk memutus tali silaturahmi, meninggalkan sedekah yang menjadi penghalang bagi kalian untuk mengerjakan kebaikan. Namun ingkarilah sumpah kalian, kerjakanlah kebaikan, berbuat baiklah terhadap orang yang membutuhkan, jauhilah keharaman, dan berbuat baiklah di antara orang-orang. Dan Allah itu Maha Mendengar perkataan kalian dan Maha Mengetahui niat kalian. Ibnu Juraij berkata: “Ayat ini turun untuk Abu Bakar As-Siddiq ketika bersumpah tidak akan memberi nafkah Masthah ketika dia masuk dalam golongan orang munafik dengan membicarakan kebohongan dan berkata tentang Aisyah RA. Lalu turunlah ayat 22 surah An-Nur untuk dia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian menjadikan nama Allah dalam sumpah kalian sebagai penghalang} janganlah kalian menjadikan sumpah dengan menyebut nama Allah itu sebagai penghalang bagi kalian {untuk berbuat baik, bertakwa, dan menciptakan kedamaian di antara manusia. Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "224. Maksud dari sumpah dan janji adalah mengagungkan dzat yang digunakan dalam bersumpah dan menegaskan tentang isi dari sumpah tersebut. Allah telah memerintahkan untuk menjaga sumpah dan konsekuensi dari perintah itu dalam segala hal. Akan tetapi Allah membuat pengecualian apabila pembuktian (mempertahankan) sumpah itu mengharuskan untuk meninggalkan sesuatu yang lebih baik darinya, maka Allah melarang hamba-hambaNya menjadikan sumpah-sumpah mereka sebagai penghalang atau pembatas dari berbuat kebajikan, menghindari kejahatan, dan mendamaikan antara manusia. Barangsiapa yang bersumpah untuk meninggalkan suatu kewajiban, maka wajib atasnya membatalkan sumpahnya tersebut dan haram baginya mempertahankannya. Dan barangsiapa yang bersumpah untuk meninggalkan sesuatu yang dianjurkan, maka boleh baginya membatalkannya. Barangsiapa yang bersumpah untuk melakukan sesuatu yang diharamkan, maka wajib atasnya membatalkannya, dan jika untuk melakukan sesuatu yang dimakruhkan, maka disunahkan untuk membatalkannya. Sedangkan hal-hal yang mubah, maka seyogyanya menjaga sumpah tersebut dan tidak melanggarnya. Ayat ini dapat dijadikan dalil atas kaidah yang terkenal yaitu, apabila ada kemaslahatan yang banyak, maka harus didahulukan yang paling terpenting dari nya. Tetapi mempertahankan sumpah di sini adalah maslahat, melaksanakan perintah-perintah Allah dalam perkara ini adalah lebih besar maslahatnya dari hal itu, oleh karena itu harus didahulukan dari sumpah. Kemudian Allah menutup ayat ini dengan 2 nama yang melihat seraya berfirman, “Dan Allah maha mendengar,” yakni, segala suara, “lagi maha mengetahui” akan segala maksud dan niat; yang diantaranya adalah Dia mendengar perkataan orang-orang yang bersumpah dan mengetahui maksud sumpah mereka, apakah baik atau buruk. Dan termasuk dalam cakupannya adalah peringatan dari pembalasannya, dan bahwa ilmu tentang perbuatan perbuatan dan niat-niat mereka adalah telah tetap di sisi Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { العرضة} Al-‘Urdhah : Sesuatu yang dipakai untuk menghalangi sesuatu, dan sumpah adalah sesuatu yang diucapkan seorang mukmin untuk tidak berbuat kebaikan. { الأيمان } Al-Aiman : Bentuk jamak dari yamin (sumpah) seperti, “Wallahi (Demi Allah) aku tidak akan melakukan hal ini”, atau “Wallahi aku akan melakukan hal ini.” { البرور } Al-Burur : Ketaatan dan berbuat kebaikan Makna ayat: Allah Ta’ala melarang hamba-hamba Nya yang mukmin untuk menjadikan sumpah sebagai penghalang melakukan kebaikan, hal itu seperti halnya seseorang bersumpah untuk tidak bersedekah kepada fulan, atau tidak mau berbicara dengan fulan, atau tidak mau mendamaikan antara orang-orang yang berselisih. Allah berfirman,” Janganlah kamu jadikan (nama) Allah” dengan bersumpah dengan Nya “sebagai penghalang” yang menghalangimu untuk berbuat kebaikan atau meninggalkan dosa, atau menjadi juru damai bagi orang-orang yang berselisih. Allah Ta’ala memberitahukan kepada mereka bahwa Dia Maha Mendengar ucapan-ucapan mereka Maha Mengetahui dengan niat-niat dan perbuatan-perbuatan mereka, maka bertakwalah kepada Nya. Pelajaran dari ayat: • Dibencinya perbuatan meninggalkan kebaikan disebabkan karena bersumpah atasnya. Barangsiapa bersumpah untuk tidak melakukan kebaikan hendaklah mencabut sumpahnya dan membayar kafarat, serta melakukan kebaikan berdasarkan hadits yang shahih,”Barangsiapa bersumpah dan ia melihat sesuatu yang lebih baik dari apa yang disumpahkan hendaklah ia membayar kafarat dan melakuan hal yang lebih baik tersebut.” • Sumpah yang tidak disengaja dimaafkan dan memiliki dua gambaran: o Salah dalam pengucapan sumpah bukan seperti yang diinginkan, seperti seorang berucap,”Tidak, demi Allah,” padahal yang dimaksudkan adalah “Ya, demi Allah.” o Seorang bersumpah atas sesuatu yang disangka seperti ini, padahal realitanya berbanding terbalik, seperti seorang yang bersumpah,”Demi Allah tidak ada uang di sakuku.” Diucapkan karena perkiraan saja atau yakin. Akan tetapi kemudian tak sengaja ditemukan uang di dalam sakunya. Inilah bentuk sumpah yang tidak disengaja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 224: Kemudian memperingatkan orang-orang muslim agar menjadi golongan kanan Allah yang mereka berbuat kebaikan dan amalan sholeh serta bertaqwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: melarang bersumpah dengan mempergunakan nama Allah untuk tidak mengerjakan yang baik, seperti: \"demi Allah, saya tidak akan membantu anak yatim\", tetapi apabila sumpah itu telah diucapkan, maka harus dilanggar dengan membayar kafarat. Dari ayat ini, keluar ka'idah fiqh yang masyhur, yaitu \"Idzaa tazaahamatil mashaalih quddima ahammuhaa\" (apabila dua maslahat berbenturan, maka didahulukan yang terpenting)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 224",
    "description": "Usai menjelaskan hubungan harmonis suami-istri dalam rumah tangga, Allah menjelaskan adanya hubungan kurang harmonis antara keduanya yang sengaja ditutup-tutupi melalui sumpah. Dan janganlah kamu jadikan nama Allah selalu disebut-sebut dalam sumpahmu lantaran sumpah itu kamu jadikan sebagai penghalang untuk berbuat kebajikan, bertakwa dan menciptakan kedamaian di antara manusia. Mengucapkan sumpah atas nama Allah untuk tidak mengerjakan perbuatan baik, seperti demi Allah, aku tidak akan membantu anak yatim, dilarang oleh agama. Jika telanjur diucapkan maka sumpah itu harus dibatalkan dengan membayar kafarat atau denda berupa salah satu dari tiga pilihan, yakni memberi makan sepuluh orang miskin sekali makan, memberi pakaian kepada mereka, memerdekakan budak, atau puasa tiga hari, seperti dijelaskan dalam surah al-ma''idah/5: 89. Allah maha mendengar apa yang kamu ucapkan, maha mengetahui apa yang kamu kerjakan. Setelah menjelaskan larangan bersumpah untuk tidak berbuat baik, Allah pada ayat ini menjelaskan jenis sumpah lain. Allah tidak menghukum dengan memberi sanksi berupa kafarat terhadap kamu karena sumpahmu yang diucapkan dengan tidak kamu sengaja, yakni ucapan sumpah namun tidak ada maksud bersumpah, tetapi dia menghukum kamu dengan memberi sanksi atau mengazab di akhirat karena niat yang terkandung dalam hatimu, yakni bila kamu bersumpah untuk meyakinkan orang lain. Allah maha pengampun atas sumpah yang telah kamu ucapkan, maha penyantun dengan tidak segera mengazab orang yang berbuat dosa agar mereka sadar dan bertobat"
  }
]