[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak menghukum kalian dikarenakan sumpah-sumpah yang kalian ucapkan tanpa kesengajaan. Akan tetapi, dia menghukum kalian atas segala (sumpah) yang disengaja oleh hati-hati kalian. Dan Allah maha pengampun bagi orang yang bertaubat kepadanya, Maha penyantun kepada orang yang berbuat maksiat kepadanya, lantaran tidak menyegerakan siksaan pada dirinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "225. Allah tidak akan menuntut kalian terkait sumpah yang terucap oleh lisan kalian tanpa sengaja. Seperti ucapan kalian, “Tidak, demi Allah.” Atau “Ya, demi Allah.” Maka tidak ada kewajiban membayar kafarat dan tidak ada hukuman bagi kalian dalam hal itu. Namun Allah akan menuntut kalian terkait sumpah yang kalian lakukan secara sengaja. Dan Allah Maha Pengampun bagi dosa hamba-hamba-Nya lagi Maha Penyantun, tidak lekas menjatuhkan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "225. Allah akan mengampuni kalian jika mengucapkan sumpah tanpa ada maksud untuk bersumpah, maka tidak ada dosa atau kafarat bagi kalian jika melakukan itu. Namun Allah hanya akan menghukum kalian jika bersumpah dengan penuh niat, lalu kalian melanggarnya. Sungguh Allah Maha Pengampun bagi orang yang bertaubat dan Maha Lembut kepada orang yang bermaksiat dengan tidak segera memberi hukuman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "225. لَّا يُؤَاخِذُكُمُ اللَّـهُ بِاللَّغْوِ في أيمانكم (Allah tidak menghukum kamu disebabkan sumpahmu yang tidak dimaksud (untuk bersumpah) ) Yakni seperti perkataan seseorang ‘tidak demi Allah’, ‘bukan demikian demi Allah’ dalam percakapannya yang tanpa disertai maksud untuk bersumpah, demikian pula perkataan ini pada saat bercanda gurau, maka ini tidak berdosa dan tidak diwajibkan untuk membayar kafarat karena bukan merupakan sumpah yang sesungguhnya. وَلٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ ۗ (tetapi Allah menghukum kamu disebabkan (sumpahmu) yang disengaja (untuk bersumpah) oleh hatimu) Yakni kalian akan ditanya atas sumpah yang kalian ucapkan yang memang dimaksudkan sebagai sumpah, dan dalam sumpah yang demikian terdapat kafarat apabila kalian melanggarnya. وَاللَّـهُ غَفُورٌ (Dan Allah Maha Pengampun) Yakni karena tidak menghukum kalian sebab ucapan yang keluar dari lidah kalian tanpa sengaja dan tanpa maksud; dan juga menjadikan kalian kafarah untuk menebus dosa apabila kalian melanggar sumpah. حَلِيمٌ (Maha Penyantun) Yakni tidak bergegas dalam menyiksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "225. Tidak ada dosa dalam mematahkan sumpah yang tidak sengaja, yaitu sumpah yang hanya melalui lisan tanpa ada maksud untuk bersumpah, namun dosa itu atas sumpah yang terikat, yaitu janji yang memang kalian maksudkan. Dan Allah itu Maha Pengampun, dimana Dia tidak menyalahkan sumpah yang tidak disengaja dan Maha Penyayang dengan tidak mendahulukan hukuman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak menghukum kalian karena sumpah kalian} Allah tidak menghukum kalian karena sumpah yang keluar dari lidah kalian secara tidak sengaja {tetapi Dia menghukum kalian karena sumpah yang diniatkan oleh hati kalian} hati kalian memang berniat untuk bersumpah {Allah Maha Pengampun lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "225. Maksudnya, Allah tidak akan menghukum apa yang terlontar dari lisan lisan kalian dari sumpah sumpah yang tidak bermakna yang sering diucapkan oleh seorang hamba, tanpa ada maksud bersumpah, dan tidak pula disengaja di hati, tetapi hanya perkataan yang biasa terucap dari lisan, seperti perkataan seseorang di sela-sela pembicaraannya, “tidak, demi Allah,” \"benar demikian, demi Allah\". atau seperti sumpahnya atas sebuah perkara yang telah berlalu yang dia kira bahwa dirinya benar. Sumpah yang dianggap dosa adalah sumpah yang disengaja (dikukuhkan) oleh hati. Disini terkandung dalil atas kedudukan niat dalam perkataan sebagaimana kedudukan dalam perbuatan. “Dan Allah Maha Pengampuan” bagi orang yang bertaubat kepadaNya, “lagi maha penyantun” terhadap orang yang bermaksiat kepadaNya, dimana Allah tidak menyegerakan hukuman atasnya, akan tetapi Allah bersikap santun terhadapnya, dan Dia tutupi dosanya dan Dia maafkan, padahal Dia mampu menghukumnya langsung di tempatnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { اللغو } Al-Laghwu : Sesuatu yang batil, tidak ada kebaikan padanya. Laghwul yamin (sumpah yang tidak disengaja) adalah sumpah yang diucapkan sesorang atas sesuatu yang disangka begini, ternyata realitanya adalah sebaliknya. Atau yang sudah terbiasa terucapkan di lisan tanpa bermaksud untuk bersumpah. { كَسَبَتۡ قُلُوبُكُمۡۗ } Kasabat qulubukum : Apa yang menjadi niat untuk dilakukan oleh hati, dan untuk tujuan itu sumpah dilakukan baik untuk melakukan sesuatu yang diwajibkan oleh dirinya, atau tidak mau melakukan sesuatu. Makna ayat: Kemudian Allah Ta’ala mengabarkan kepada mereka, bahwa Allah tidak menimpakan hukuman karena sumpah yang tidak disengaja, seperti ketika seorang bersumpah atas sesuatu yang disangka begini, ternyata realitanya berbalik dari apa yang dipersangkakan, atau berbeda antara ucapan dengan maksud di dalam hatinya seperti ucapan,”Tidak, demi Allah,” padahal maksudnya “Ya, demi Allah.” Hal ini termasuk yang dimaafkan oleh Allah bagi hamba-hamba Nya, tidak ada dosa baginya serta ada kaffarah yang wajib untuk ditunaikan. Akan tetapi Allah akan menghukum mereka dengan sumpah yang sengaja dimaksudkan oleh hatinya berupa dosa, seperti seorang bersumpah palsu demi mendapatkan bagian hak yang seharusnya diterima oleh saudaranya muslim, dengan sumpah palsunya itu. Ini merupakan sumpah palsu yang membenamkan pelakunya dalam dosa dan api neraka. Maka dalam hal ini kaffarah tidak bermanfaat untuk dilakukan bagi orang yang bersumpah untuk melakukan sesuatu atau tidak melakukan sesuatu kemudian ia melanggar sumpahnya. Bagi orang yang melakukan sumpah palsu hendaknya bertaubat dari kebohongan dirinya dan mengakui dosa-dosanya, serta mengembalikan hak orang lain yang diambil dengan sumpahnya yang busuk itu kepada pemiliknya, dengan itu semoga Allah Ta’ala mengampuninya dan mengasihinya. Dan Allah Maha Pengampun lagi Maha Penyayang. Pelajaran dari ayat: • Sumpah yang memiliki hukuman adalah sumpah palsu yang sengaja dilakukan oleh seseorang dengan maksud untuk mendapatkan manfaat duniawi. Inilah yang dimaksud dalam firman Allah Ta’ala,” tetapi Allah menghukum kamu disebabkan (sumpahmu) yang disengaja (untuk bersumpah) oleh hatimu.” Sumpah ini dinamakan dengan sumpah ghumus atau sumpah palsu. • Sumpah yang harus dibayarkan kafaratnya apabila seorang bersumpah untuk melakukan sesuatu namun kemudian ia tidak dapat melakukannya atau bersumpah untuk tidak melakukan sesuatu, namun ia malah melakukannya, dan tidak mengucapkan insya Allah dalam sumpahnya. Kafarat sumpah dijelaskan di dalam surat Al-Maidah yaitu dengan memberi makan sepuluh orang miskin, atau memberi pakaian kepada mereka, serta membebaskan budak, atau kalau tidak mampu ketiganya maka ia berpuasa selama tiga hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 225: Allah mengabarkan bahwasannya Allah tidak meng azab kalian yang berbicara tanpa tujuan, akan tetapi Allah akan mengazab kalian yang kalian niatkan untuk kedustaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Aisyah radhiyallahu 'anha ia berkata, \"(Ayat ini ) turun berkenaan dengan kata-kata, \"Tidak. Demi Allah!\", \"Ya. Demi Allah.\" Seperti ucapan yang biasa keluar dari lisan tanpa disengaja dan tanpa diusahakan oleh hati, \"Ya, demi Allah\", \"Tidak, demi Allah\" dsb. atau pada sumpah terhadap masalah yang lalu karena dikiranya benar. Sumpah seperti ini tidaklah berdosa dan tidak perlu membayar kaffarat. Yakni disengaja. Dalam ayat ini terdapat dalil perlu adanya qasd (niat) di hati dalam mengucapkan, sebagaimana niat juga harus ada dalam perbuatan. Halim berarti penyantun, tidak segera menyiksa orang yang berbuat dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 225",
    "description": "Setelah menjelaskan larangan bersumpah untuk tidak berbuat baik, Allah pada ayat ini menjelaskan jenis sumpah lain. Allah tidak menghukum dengan memberi sanksi berupa kafarat terhadap kamu karena sumpahmu yang diucapkan dengan tidak kamu sengaja, yakni ucapan sumpah namun tidak ada maksud bersumpah, tetapi dia menghukum kamu dengan memberi sanksi atau mengazab di akhirat karena niat yang terkandung dalam hatimu, yakni bila kamu bersumpah untuk meyakinkan orang lain. Allah maha pengampun atas sumpah yang telah kamu ucapkan, maha penyantun dengan tidak segera mengazab orang yang berbuat dosa agar mereka sadar dan bertobat bagi orang laki-laki yang meng-ila istrinya, yaitu bersumpah tidak akan mencampuri istri, dan lantaran sumpah tersebut seorang istri menderita karena tidak dicampuri dan tidak pula diceraikan; dalam kondisi ini maka istri harus menunggu empat bulan sebagai batas atau tenggang waktu bagi istri untuk menerima keputusan suami, apakah rujuk dengan membayar kafarat sumpah atau cerai. Kemudian jika dalam masa empat bulan itu mereka kembali kepada istrinya dan hidup bersama sebagai suami-istri dan saling memaafkan, maka sungguh, Allah maha pengampun atas kesalahan yang telah mereka perbuat, maha penyayang kepada hamba-hamba yang menyadari kesalahan mereka."
  }
]