[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi orang-orang yang telah bersumpah dengan nama Allah untuk tidak mencampuri istri-istri mereka, ada waktu menunggu selama 4 bulan. maka jika mereka rujuk sebelum selesainya tempo waktu 4 bulan itu, maka sesungguhnya Allah maha pengampun terhadap apa yang telah terjadi pada mereka berupa sumpah disebabkan rujuk mereka, lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "226. Orang-orang yang bersumpah untuk tidak menggauli istrinya memiliki tenggat waktu tidak lebih dari 4 bulan, dimulai sejak mereka mengucapkan sumpah. Inilah yang disebut dengan “Ilā`”. Jika mereka kembali menggauli istri-istri mereka dalam kurun waktu 4 bulan atau kurang dari itu, maka sesungguhnya Allah Maha Pengampun yang akan mengampuni apa yang telah mereka lakukan, dan Maha Penyayang kepada mereka karena telah mensyariatkan kafarat sebagai jalan keluar dari sumpah ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "226-227. Diberikan batas waktu empat bulan bagi orang yang bersumpah dengan nama Allah untuk tidak berjima dengan istri-istrinya agar dapat memberi mudharat kepada mereka, jika dia membatalkan sumpahnya maka Allah akan mengampuni sumpahnya itu, dan jika dia bermaksud mentalak istrinya dengan tetap berpegang pada sumpahnya untuk tidak menjima istrinya maka sungguh Allah Maha mendengar perkataannya dan Maha Mengetahui maksud mereka. Ibnu ‘Asyur berkata, firman Allah {فإن الله غفور رحيم} merupakan kalimat jawab, yakni pembatalan sumpah mereka untuk tidak menjima istri mereka mendapat ampunan dari Allah. Hal ini juga menunjukkan bahwa sumpah untuk tidak menjima istri merupakan perbuatan haram. Dan firman Allah {فإن الله سميع عليم} merupakan kalimat jawab pula, yakni sumpah mereka telah mengikat dan talak benar-benar jatuh. Allah telah memberi batas waktu bagi para suami dalam bersumpah untuk tidak menjima istrinya dengan batas tertentu, sehingga pilihan mereka adalah kembali berjima dengan istri mereka atau mentalak. (at-Tahrir dan at-Tanwir: 2/366-367)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "226. لِّلَّذِينَ يُؤْلُونَ مِن نِّسَآئِهِمْ (Kepada orang-orang yang meng-ilaa’ isterinya) Ilaa’ adalah sumpah seorang suami untuk tidak menggauli istrinya selama lebih dari empat bulan, baik itu secara mutlak ataupun mengikatnya dengan syarat-syarat tertentu. Apabila kurang dari empat bulan maka tidak ada hukuman apapun bagi suami, namun bila lebih dari empat bulan maka apabila istrinya menggugatnya maka sang suami harus menghadap hakim agar menyuruh suami ini untuk merujuk atau mentalak istrinya, dan apabila dia menolak melakukan keduanya maka hakim memutuskan talak sesuai dengan permintaan istri. فَإِن فَآءُو (Kemudian jika mereka kembali (kepada isterinya) ) Yakni apabila suami kembali (mundur) dari sumpahnya tersebut dan memilih untuk melanjutkan pernikahannya maka akan Allah mengampuni suami ini, namun diwajibkan atasnya untuk membayar kafarah, sesuai dengan ayat sebelumnya. Adapun makna (الفيء) adalah jima’ bagi yang tidak memiliki halangan untuk itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "226. Bagi orang-orang yang bersumpah untuk tidak mencampuri istrinya itu menunggu empat bulan. Dan jika mereka kembali dari sumpah ila’ yang disebutkan itu. Al Fii’u adalah jima’ bagi orang yang tidak sedang ada uzur, maka sesungguhnya Allah itu Maha Pengampun bagi suami atas sumpah yang dimaksudkan untuk memberikan kesulitan, dan maha Penyayang bagi orang-orang yang bertaubat. Imam Muslim meriwayatkan bahwa Nabi SAW pernah mengiila’ dan menalak, dan penyebab ila’ tersebut adalah pertanyaan istrinya terkait nafkah yang bukan milik Nabi. Sedangkan Ibnu Abbas berkata bahwa Ila’nya orang yang memiliki kehormatan itu satu atau dua tahun bahkan lebih dari itu, lalu Allah menetapkan hal itu selama 4 bulan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi orang-orang yang meng-ila’ istri mereka} mereka bersumpah untuk tidak mencampuri istri mereka {tenggang waktu} masa tunggu {empat bulan. Jika mereka kembali} kembali dari sumpah ini di pertengahan waktu itu {Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "226. Ini termasuk sumpah khusus berkaitan dengan istri tentang suatu perkara yang khusus yaitu sumpah seorang suami untuk meninggalkan 5 dengan istrinya secara mutlak maupun terbatas dengan massa kurang dari 4 bulan atau lebih. Barangsiapa yang meng’ila’ istrinya khususnya di bawah 4 bulan, maka hal ini adalah seperti sumpah-sumpah lainnya, apabila dia melanggar, maka dia wajib membayar kafarat, dan bila ia mempertahankan sumpahnya, maka tidak ada apa-apa, istrinya tidaklah berhak apa-apa atasnya, karena ia menjadikan hal itu sebagai haknya selama 4 bulan. Apabila untuk selamanya atau suatu masa yang melebihi 4 bulan, maka harus dijadikan 4 bulan lamanya dari sejak sumpahnya, apabila istrinya meminta hal itu, karena itu merupakan hak istrinya. Apabila telah genap masa sumpahnya, maka diperintahkan kepada siswa untuk kembali yaitu berjimak, dan bila ia berjimak dengan istrinya, maka tidak ada hukuman atas nya kecuali membayar kafarat sumpah nya, dan bila ia tidak mau berjima, ia harus dipaksa untuk mentalak istrinya. Bila ia tidak mau juga mentalak, maka Hakim terpaksa menjatuhkan talak untuknya. Akan tetapi kembali dan ruju’ kepada istrinya lagi adalah lebih disukai oleh Allah. Karena itu Allah berfirman, “kemudian jika mereka kembali (kepada istrinya),” Artinya, mereka kembali dari apa yang mereka sumpah kan untuk meninggalkan yaitu berjima, “maka sesungguhnya Allah maha pengampun” mengampuni mereka dari apa yang terjadi di antara mereka karena sumpah itu, sumpah yang disebabkan oleh kembalinya mereka, “lagi maha penyayang,” di mana Allah menjadikan (untuk menggugurkan) sumpah sumpah kalian kafarat (pelebur dosa) dan dendanya dan Dia tidak menjadikannya sebagai yang harus dilakukan oleh mereka yang tidak dapat dirubah rubah. Dan Dia Maha Penyayang terhadap mereka yang kembali kepada istri-istri mereka, mengasihi, dan menyayangi istri-istri mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يُؤۡلُونَ } Yu’luna : Al-‘Ila adalah bersumpah untuk tidak menggauli istrinya. { تَرَبُّصُ } Tarabbush : Masa menunggu dan menanti { فَآءُو } Faa’u : Kembali menggauli istri-istri mereka setelah sebelumnya tidak mau karena sumpahnya. Makna ayat: Masih berkaitan dengan penyebutan sumpah, Allah Ta’ala menyebutkan hukum bagi suami yang melakukan ‘ila kepada istrinya, yaitu dengan bersumpah untuk tidak menggauli istrinya. Maka Allah mengabarkan bahwa orang yang melakukan ‘ila tidak boleh melebihi empat bulan, apabila suami kemudian mencabut sumpahnya dan kembali menggauli istrinya, maka itu yang diharapkan dan suami harus membayar kaffarah. Namun apabila suami tidak mau mencabut dan terus di atas sumpahnya, wajib bagi hakim untuk mencabut sumpahnya, akan tetapi jika ia menolak maka hakim menceraikan kedua suami istri tersebut. Allah Ta’ala berfirman, “Kepada orang-orang yang meng-ilaa' isterinya diberi tangguh empat bulan (lamanya). Kemudian jika mereka kembali (kepada istrinya), maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Mengampuni mereka atas dosa yang dilakukannya terhadap hak istri-istrinyanya serta mengasihi mereka karena taubat yang dilakukannya. Pelajaran dari ayat: • Penjelasan mengenai hukum ‘ila yaitu dimana seroang suami bersumpah untuk tidak menggauli istrinya. Apabila dalam jangka waktu kurang dari empat bulan, ia tidak boleh mencabut sumpahnya dan terus untuk tidak menggauli istrinya sampai habis masa sumpahnya itu. Namun yang paling utama adalah ia menggauli istrinya dan melanggar sumpahnya dengan membayar kafarat. Apabila lebih dari empat bulan maka ia harus kembali kepada istrinya, menggaulinya lagi, atau hakim akan menceraikannya apabila ia tetap dalam kemarahannya dan tidak ridha."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 226: Kemudian Allah menjelaskan bahwasannya mereka yang telah berjanji untuk tidak menijma’ istri-istri mereka selamanya, agar mereka memberikan waktu 4 bulan maka jika mereka tidak ijma’ selama 4 bulan maka jatuh talak padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meng-ilaa' istri maksudnya: bersumpah tidak akan mencampuri istri baik mutlak (selamanya) maupun muqayyad (sampai kurang dari empat bulan atau lebih). Jika lamanya iilaa' kurang dari empat bulan, maka jika dilanggar, ia wajib membayar kaffarat, namun jika tidak dilanggar, maka ia tidak wajib melakukan apa-apa. Namun jika lamanya sumpah adalah selama-lamanya atau lebih dari empat bulan, maka ditetapkan masa empat bulan baginya apabila istrinya menuntut, karena hal itu adalah haknya. Dengan sumpah ini seorang wanita menderita, karena tidak disetubuhi dan tidak pula diceraikan. Dengan turunnya ayat ini, maka suami setelah 4 bulan harus memilih antara kembali menjima'i istrinya lagi dengan membayar kafarat sumpah atau menceraikan. Jika tidak mau menceraikan, maka dipaksa bercerai., jika tetap tidak mau, maka hakim turun tangan dengan menceraikannya. Akan tetapi kembali kepada istrinya lebih dicintai Allah daripada mentalak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 226",
    "description": "Bagi orang laki-laki yang meng-ila istrinya, yaitu bersumpah tidak akan mencampuri istri, dan lantaran sumpah tersebut seorang istri menderita karena tidak dicampuri dan tidak pula diceraikan; dalam kondisi ini maka istri harus menunggu empat bulan sebagai batas atau tenggang waktu bagi istri untuk menerima keputusan suami, apakah rujuk dengan membayar kafarat sumpah atau cerai. Kemudian jika dalam masa empat bulan itu mereka kembali kepada istrinya dan hidup bersama sebagai suami-istri dan saling memaafkan, maka sungguh, Allah maha pengampun atas kesalahan yang telah mereka perbuat, maha penyayang kepada hamba-hamba yang menyadari kesalahan mereka. Dan jika mereka berketetapan hati tanpa keraguan hendak menceraikan istrinya maka mereka wajib mengambil keputusan yang pasti, yaitu cerai, maka sungguh, Allah maha mendengar apa yang mereka ucapkan dan maha mengetahui apa yang ada dalam hati mereka. Penyebutan dua sifat Allah sekaligus mengisyaratkan bahwa talak atau perceraian dianggap sah apabila diucapkan atau diikrarkan dengan jelas dan bukan karena paksaan."
  }
]