[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka berniat dengan ketetapan hati untuk menalak (menceraikan), dengan meneruskan kandungan sumpah mereka dan meninggalkan untuk mencampuri(istri-istri), maka sesungguhnya Allah maha mendengar ucapan-ucapan mereka, lagi Maha Mengetahui niat-niat mereka dan akan memberikan balasan kepada mereka sesuai dengan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "227. Apabila mereka menghendaki perceraian dengan tidak menggauli istri-istri mereka dan tidak mau kembali menggauli mereka, maka sesungguhnya Allah Maha Mendengar ucapan mereka, termasuk ucapan perceraian, lagi Maha Mengetahui keadaan dan niat mereka, dan akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "227. وَإِنْ عَزَمُوا۟ الطَّلٰقَ فَإِنَّ اللَّـهَ سَمِيعٌ عَلِيمٌ (Dan jika mereka berazam (bertetap hati untuk) talak, maka sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui) Yakni apabila sang suami menolak untuk talak maka hakim yang menjatuhkan talak, agar menghindarkan kerugian yang ditanggung oleh sang istri. Dan sang suami tidak diwajibkan untuk membayar kafarah karena dia tidak melanggar sumpahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "227. Dan jika mereka bermaksud dan memutuskan untuk menalak, maka Allah itu Maha Mendengar ucapan mereka dan Maha Mengetahui maksud mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka tetap teguh} mereka sangat menginginkan {untuk bercerai, sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "227. “Dan jika mereka berazam (bertetap hati untuk) talak,” Artinya, mereka tidak mau kembali (dan melakukan Jima) yang merupakan tanda kebencian mereka terhadap istri-istri mereka dan ketidaksukaan terhadap mereka. Ini tidaklah terjadi kecuali karena ketetapan hati yang kuat untuk talak. Apabila ini terjadi, maka ini adalah hak yang wajib dilaksanakan secara langsung, dan bila tidak, maka Hakim yang memaksanya untuk melakukan talak dan melakukannya untuknya. “Maka sesungguhnya Allah maha mendengar lagi maha mengetahui.” ayat ini merupakan ancaman dan peringatan bagi orang yang bersumpah dengan sumpah seperti ini dan ia bermaksud menyusahkan dan memberatkan (istrinya) dengan sumpahnya. Ayat ini dapat dijadikan dalil bahwa ila’ itu khusus terhadap istri karena Allah hanya menyebutkan, “istrinya,” dan juga bahwa beriman itu wajib pada setiap 4 bulan sekali, karena setelah 4 bulan itu ia harus dipaksa, baik untuk berjima atau melakukan talak, dan hal ini tidaklah seperti itu kecuali karena ia meninggalkan suatu yang wajib."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلطَّلَٰقَ } Ath-Thalaq : Memutuskan ikatan pernikahan dan terlepas dengan perkataan, “Dia (istri) adalah orang yang diceraikan,” atau “Aku menceraikan kamu.” Makna ayat: Apabila suami menginginkan perceraian dengan cara tidak mau untuk mencabut sumpahnya maka mereka telah terhitung melakukan talak. Dan Allah Maha Mendengar ucapan-ucapan mereka dan Maha Mengetahui apa yang ada di dalam hati-hati mereka, maka berhati-hatilah dengan tidak melakukan apa yang dibenciNya dan meinggalkan apa yang dicintaiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 227: Allah mengajarkan jika suami meminta dengan tegas untuk bersumpah dan menghajar istrinya, serta menolak untuk berijma’ maka pada kondisi ini mungkin ditalak atau hakim mentalaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berniat keras untuk talak, maka segeralah menjatuhkan talak. Hal ini menunjukkan bahwa suami sudah tidak suka kepada istrinya dan sudah tidak berkeinginan lagi kepada mereka. Dalam kata-kata \"maka sesungguhnya Allah Maha mendengar lagi Maha mengetahui\" terdapat ancaman bagi orang yang bersumpah dengan maksud memadharatkan istri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 227",
    "description": "Dan jika mereka berketetapan hati tanpa keraguan hendak menceraikan istrinya maka mereka wajib mengambil keputusan yang pasti, yaitu cerai, maka sungguh, Allah maha mendengar apa yang mereka ucapkan dan maha mengetahui apa yang ada dalam hati mereka. Penyebutan dua sifat Allah sekaligus mengisyaratkan bahwa talak atau perceraian dianggap sah apabila diucapkan atau diikrarkan dengan jelas dan bukan karena paksaan. Setelah menjelaskan masalah perempuan yang ditalak suaminya, berikut ini Allah menjelaskan idah mereka. Dan para istri yang diceraikan bila sudah pernah dicampuri, belum menopause, dan tidak sedang hamil, wajib menahan diri mereka menunggu selama tiga kali quru, yaitu tiga kali suci atau tiga kali haid. Tenggang waktu ini bertujuan selain untuk membuktikan kosong-tidaknya rahim dari janin, juga untuk memberi kesempatan kepada suami menimbang kembali keputusannya. Tidak boleh bagi mereka menyembunyikan apa yang diciptakan Allah dalam rahim mereka, baik berupa janin, haid, maupun suci yang dialaminya selama masa idah. Ketentuan di atas akan mereka laksanakan dengan baik jika mereka beriman kepada Allah dan hari akhir. Dan para suami mereka berhak menjatuhkan pilihannya untuk kembali kepada istri mereka dalam masa idah itu, jika mereka menghendaki perbaikan hubungan suami-istri yang sedang mengalami keretakan tersebut. Dan mereka, para perempuan, mempunyai hak seimbang yang mereka peroleh dari suaminya dengan kewajibannya yang harus mereka tunaikan menurut cara yang patut sesuai tugas dan tanggung jawab masing-masing. Tetapi para suami mempunyai kelebihan di atas mereka. 3 yaitu derajat kepemimpinan karena tanggung jawab terhadap keluarganya. Allah mahaperkasa atas orang-orang yang mendurhakai aturan-aturan yang telah ditetapkan, mahabijaksana dalam menetapkan aturan dan syariat-Nya."
  }
]