[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan wanita-wanita merdeka yang telah diceraikan yang masih dalam masa subur, maka mereka wajib menunggu sebelum menikah pasca perceraian selama 3 kali suci atau 3 kali haid untuk memenuhi masa iddah. tujuannya, agar mereka dapat memastikan kosongnya rahim mereka dari mengandung janin. Dan tidak boleh bagi mereka untuk menikahi lelaki lain dalam masa iddah ini, sampai selesai masanya. dan tidak boleh bagi mereka untuk menyembunyikan apa yang Allah ciptakan di dalam rahim rahim mereka, berupa adanya kandungan janin atau terjadinya haid, apabila wanita-wanita yang diceraikan itu wanita-wanita yang beriman kepada Allah dan hari akhir dengan sebenarnya. Dan suami-suami wanita-wanita yang diceraikan itu lebih berhak merujuk mereka dalam masa iddah. dan sepatutnya rujuk itu diniatkan untuk memperbaiki keadaan dan menggapai kebaikan, bukan diniatkan untuk mencelakai(waniata) demi menyiksanya dengan bertambahnya masa iddah. Dan bagi istri-istri ada hak-hak yang menjadi kewajiban suami suami untuk memenuhinya, seperti yang menjadi kewajiban istri istri dengan cara-cara yang ma'ruf. Dan bagi suami suami ada kedudukan yang lebih tinggi dihadapan istri-istri, berupa mendampingi dengan baik, mempergauli dengan ma'ruf, dan memimpin urusan rumah tangga, dan memilki hak talaq. Dan Allah maha perkasa, Ia memiliki sifat keperkasaan yang mengalahkan semua, Maha bijaksana, meletakkan segala sesuatu pada tempatnya yang tepat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "228. Wanita-wanita yang diceraikan suaminya harus menahan diri mereka selama tiga kali haid. Mereka tidak boleh menikah (dengan laki-laki lain) selama jangka waktu itu. Mereka juga tidak boleh menyembunyikan kehamilan yang Allah ciptakan di dalam rahim mereka, jika mereka sungguh-sungguh dalam beriman kepada Allah dan hari akhir. Dan (mantan) suami yang menceraikan mereka lebih berhak untuk merujuk mereka dalam masa idah, jika rujuk tersebut dimaksudkan untuk membangun kerukunan dan menghilangkan masalah yang terjadi akibat perceraian. Para istri memiliki hak dan kewajiban seperti halnya para suami memiliki hak atas istri-istrinya menurut kebiasaan yang berlaku di masyarakat. Namun para suami memiliki derajat yang lebih tinggi dari pada istri, seperti kepemimpinan dalam rumah tangga dan urusan perceraian. Dan Allah Maha Perkasa, tidak ada sesuatupun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "228. Masa Iddah -masa menunggu tanpa boleh menikah dengan lelaki lain- bagi wanita yang telah dicerai istrinya adalah tiga kali masa haid atau tiga kali masa suci sesuai dengan maslahat yang ingin dicapai oleh kedua belah pihak, dengan mengambil waktu yang lebih pendek atau Panjang. Allah mengharamkan wanita-wanita yang dicerai untuk menyembunyikan apa yang Allah ciptakan dalam rahim mereka berupa kehamilan atau keadaan haid, maka hendaklah mereka mentaati Allah jika mereka beriman kepada Allah dan hari akhir. Syeikh as-Syinqithi berkata, secara zahir firman Allah {والمطلقات يتربصن بأنفسهن ثلاثة قروء} menunjukkan hukum dalam ayat ini meliputi semua wanita yang dicerai, namun Allah menjelaskan dalam ayat lain bahwa sebagian wanita yang dicerai tidak termasuk di dalamnya, seperti wanita yang hamil yang disebutkan bahwa iddahnya adalah sampai dia melahirkan, Allah berfirman: “Dan perempuan-perempuan yang hamil, waktu iddah mereka itu ialah sampai mereka melahirkan kandungannya.” (at-talaq:4). Begitu pula dengan wanita yang dicerai sebelum digauli, dia tidak memiliki masa iddah. Allah berfirman: “Hai orang-orang yang beriman, apabila kamu menikahi perempuan-perempuan yang beriman, kemudian kamu ceraikan mereka sebelum kamu mencampurinya maka sekali-sekali tidak wajib atas mereka 'iddah bagimu yang kamu minta menyempurnakannya. Maka berilah mereka mut'ah dan lepaskanlah mereka itu dengan cara yang sebaik-baiknya.” (al-ahzab: 49). Dan suami lebih berhak untuk rujuk dengan istrinya dalam masa iddah jika dia menginginkan perdamaian dan kebaikan. Dan para istri memiliki hak yang sama untuk mendapat perlakuan yang baik dari suaminya, sebagaimana suami memiliki hak tersebut atas istri, dan suami memiliki kedudukan yang lebih tinggi daripada istri, yaitu sebagai kepala rumah tangga, karena dia telah memberi nafkah dan berkewajiban untuk pergi berjihad. Sungguh Allah Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam pengaturan-Nya. Dalam ayat ini Allah tidak menjelaskan maksud dari kedudukan yang lebih tinggi bagi suami, namun Dia menjelaskannya dalam ayat lain, yaitu firman-Nya: “Kaum laki-laki itu adalah pemimpin bagi kaum wanita, oleh karena Allah telah melebihkan sebahagian mereka (laki-laki) atas sebahagian yang lain (wanita), dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka.” (an-nisa: 34). Dan Allah menjelaskan kekurangan wanita dan kelemahan tabiatnya dalam firman-Nya: “Dan apakah patut (menjadi anak Allah) orang yang dibesarkan dalam keadaan berperhiasan sedang dia tidak dapat memberi alasan yang terang dalam pertengkaran.” (az-zukhruf: 18). Dan firman Allah: “dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka.” (an-nisa: 34) menunjukkan bahwa kesempurnaan dalam sifat, kekuatan, dan perawakan layak untuk menjadi pemimpin atas orang yang lebih lemah dan kurang dalam perawakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "228. وَالْمُطَلَّقٰتُ يَتَرَبَّصْنَ (Wanita-wanita yang ditalak handaklah menahan diri) Yakni menunggu. ثَلٰثَةَ قُرُوٓءٍ (tiga kali quru’) Dan ini adalah yang disebut dengan masa iddah talak, yakni masa setara dengan tiga kali haidh. وَلَا يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ اللَّـهُ فِىٓ أَرْحَامِهِنَّ (Tidak boleh mereka menyembunyikan apa yang diciptakan Allah dalam rahimnya) Yakni berupa haidh atau kehamilan. إِن كُنَّ يُؤْمِنَّ بِاللَّـهِ وَالْيَوْمِ الْءَاخِرِ ۚ (jika mereka beriman kepada Allah dan hari akhirat) Terdapat ancaman keras bagi wanita yang menyembunyikan apa yang ada dalam rahimnya sehingga siapa yang menyembunyikan di antara mereka maka ia tidak berhak untuk mendapatkan julukan sebagai orang yang beriman. وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ (Dan suami-suaminya berhak merujukinya) Yakni suami-suami mereka lebih berhak untuk rujuk kembali kepada istri-istri mereka. فِى ذٰلِكَ (dalam masa menanti itu) Yakni masa iddah, namun apabila masa iddah telah selesai sedang suami-suami mereka tidak merujuk mereka maka istri-istri tersebut lebih berhak atas diri mereka. إِنْ أَرَادُوٓا۟ إِصْلٰحًا (jika mereka (para suami) menghendaki ishlah) Yakni dengan melakukan rujuk, namun apabila itu dimaksudkan untuk memberi kerugian terhadap sang istri maka perbuatan itu diharamkan. وَلَهُنَّ مِثْلُ الَّذِى عَلَيْهِنَّ بِالْمَعْرُوفِ ۚ (Dan para wanita mempunyai hak yang seimbang dengan kewajibannya menurut cara yang ma’ruf) Yakni sang suami menggauli istri dengan pergaulan yang baik, dan begitu pula dengan sang istri. وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ ۗ . (Akan tetapi para suami, mempunyai satu tingkatan kelebihan daripada isterinya) Yakni derajat yang tidak dimiliki sang istri, berupa pemberian nafkah, dan termasuk sebagai ahli jihad, pengaturan, dan kekuatan. Sehingga wajib bagi sang istri untuk mentaati perintah dan memenuhi permintaan sang suami dalam urusan-urusan rumah tangga, kekeluargaan dan dirinya yang tidak mengandung kemaksiatan kepada Allah. Dan dalam ayat ini terdapat dalil bahwa seorang wanita itu dipercaya apabila mengabarkan bahwa masa iddahnya telah selesai apabila waktu yang telah berlalu memungkinkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "228. Dan masa iddah wanita-wanita yang ditalak yaitu menunggu untuk menikah dengan orang lain itu selama 3 kali haid, atau 3 kali bersuci. Dan diharamkan bagi mereka untuk menyembunyikan kehamilan atau haid dalam rahim mereka karena ingin cepat-cepat mengakhiri masa iddah mereka, dan mencegah suaminya untuk rujuk, jika mereka benar-benar beriman kepada Allah dan hari akhir. Dalam hal itu terdapat ancaman yang amat dahsyat bagi orang-orang yang menyembunyikan kehamilan dan haidnya. Dan suami-suami mereka itu lebih berhak untuk kembali menikah dengannya dalam masa iddah itu, jika mereka ingin memperbaiki hubungan dengan rujuk. dan bagi istri-istri itu mempunyai hak yang sama dengan kewajiban mereka atas suami mereka. (Rujuk) secara baik sesuai syariat, berupa pergaulan yang baik dan menghindari tindakan yang menyakiti dari dua belah pihak. Dan laki-laki itu memiliki derajat lebih atas wanita, yaitu maqam yang lebih, yaitu derajat tanggung jawab yang mana dia bertanggung jawab untuk menafkahi mereka, dan laki-laki itu lebih kuat dan cerdas, maka laki-laki memiliki tanggung jawab untuk menghidupi. Dan Allah itu Naha Kuat dalam kerahaanNya sehingga tidak ada yang bisa menaklukkan dan melawannya serta Maha Bijaksana dalam mengatur ciptaanNya. Asma’ binti Yazid berkata: “Pada masa Rasulullah SAW aku ditalak dan belum ada masa iddah bagi wanita yang ditalak, lalu Allah menentukan masa iddah untuk perkara talah yaitu ayat wal muthallaqaatu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para istri yang diceraikan itu menahan} menunggu {diri mereka tiga kali qurū’} tiga kali haid {Tidak boleh bagi mereka menyembunyikan apa yang diciptakan Allah dalam rahim mereka, jika mereka beriman kepada Allah dan hari akhir. Suami-suami mereka} suami-suami mereka {lebih berhak untuk kembali kepada mereka} lebih berhak untuk kembali kepada mereka {dalam (masa) itu} dalam masa penantian itu {jika mereka menghendaki perbaikan. Dan bagi para istri itu juga hak yang serupa} dan bagi para istri itu juga hak serupa yang dimiliki suami atas mereka {dengan cara yang patut. Akan tetapi, para suami mempunyai derajat lebih atas mereka. Allah itu Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "228. Maksudnya, wanita-wanita yang ditalak oleh suami-suami mereka, “hendaklah menahan diri (menunggu),” artinya hendaklah mereka menunggu dan menjalani iddah selama “tiga kali quru’,” yaitu haid atau suci menurut perbedaan pendapat para ulama tentang maksud dari quru’ tersebut, dan yang benar bahwa quru’ itu adalah haid. Iddah ini memiliki beberapa hikmah, diantaranya adalah mengetahui kosongnya rahim, yaitu apabila telah berulang-ulang 3 kali haid padanya, maka tidak diketahui bahwa dalam lahirnya tidak terjadi kehamilan hingga tidak akan membawa kepada tercampurnya nasab. Karena itu Allah mewajibkan atas mereka untuk memberitahu tentang “apa yang diciptakan Allah dalam rahimnya,” dan Allah mengharamkan bagi mereka menyembunyikan hal itu, baik kehamilan maupun haid, karena menyembunyikan hal itu akan menyebabkan kemaharatan yang sangat banyak. Menyembunyikan kehamilan berkonsekuensi diNasabkannya janin kepada orang yang bukan haknya, yang boleh jadi tidak menginginkannya, atau demi mempercepat habisnya masa iddah. Apabila diikutkan (dinasabkan) kepada selain bapaknya, niscaya tali rahimnya terputus dari keluarga, juga warisan, dan mahram mahram dan karib kerabatnya terhalang darinya, dan bisa saja suatu saat dia menikah salah seorang dari mahromnya dan dinasabkan kepada selain ayahnya dan tetapnya hal-hal yang mengikutinya seperti warisan darinya atau untuknya. Dan orang yang menjadikan seorang yang dinisbatkan kepadanya itu sebagai karib kerabatnya, dimana dalam hal itu terjadi keburukan dan kerusakan yang tidak diketahui kecuali oleh rabb manusia. Semua madharat itu akan terjadi kalau ia tinggal bersama laki-laki yang menikahinya secara batil, dimana dalam hal itu juga ada perbuatan dosa besar secara terus-menerus yaitu zina, maka itu saja cukup sebagai suatu keburukan. Adapun menyembunyikan haid, apabila yang mempercepat (waktu sucinya) lalu ia mengabarkannya, padahal ia dusta, maka itu tindakan menghilangkan hak suami darinya dan halalnya dirinya untuk selain suaminya dan segala hal yang disebabkan olehnya dari keburukan sebagaimana yang telah kami sebutkan. Dan jika ia berdusta dan mengabarkan bahwa ia tidak haid untuk menambah panjang masa iddahnya untuk dapat mengambil nafkah dari suami nya yang tidak wajib atasnya, akan tetapi dia hanya ingin terus mendapatkannya, maka nafkah itu haram dari dua sisi; bahwa nafkah yang diambilnya itu bukan haknya, dan menisbatkan hal itu menjadi bagian hukum syariat padahal ia berdusta, dan kemungkinan saja suaminya rujuk kembali setelah habis masa iddahnya hingga hal itu menjadi sebuah tindakan perzinaan, karena kondisinya telah menjadi wanita asing (ajnabiyah) baginya. Karena itu Allah berfirman, “tidak boleh mereka menyembunyikan apa yang diciptakan Allah dalam rahimnya, jika mereka beriman kepada Allah dan hari akhir.” Terjadinya tindakan menyembunyikan (haid dan kehamilan) dari mereka adalah sebuah dalil atas tidak adanya iman mereka kepada Allah dan hari akhir, dan bila tidak atau sekiranya mereka beriman kepada Allah dan hari akhir dan mereka mengetahui bahwa mereka pasti diberikan balasan dari amalan-amalan mereka, niscaya tidak akan terjadi pada mereka sesuatupun dari hal itu. Ayat ini juga dalil atas diterimanya informasi dari seorang wanita tentang kabar yang mereka informasikan tentang diri mereka dari perkara yang tidak diketahui oleh selain mereka seperti kehamilan, haid, dan lain sebagainya. Kemudian Allah berfirman, “Dan Suami suaminya lebih berhak menunjukinya dalam masa menanti itu,” artinya, untuk suami-suami mereka selama mereka masih menunggu masa iddah agar suami mereka mengembalikan mereka kepada pernikahan (awal), “jika mereka (para suami) menghendaki ishlah,” yaitu keinginan, kelembutan, dan cinta kasih. Makna ayat ini adalah bahwasanya bila mereka tidak menginginkan perbaikan, maka mereka tidaklah berhak kembali kepada pernikahan dengan istri mereka, sehingga tidaklah halal bagi mereka kembali kepada istri-istri mereka dengan maksud menimbulkan mudarat bagi mereka dan memperpanjang lagi masa iddahnya. Apakah suami memiliki hak dengan maksud yang seperti itu? Dalam masalah ini ada dua pendapat: Kebanyakan para ulama berpendapat bahwa ia memiliki hak tetapi hukumnya haram. Yang shahih adalah apabila ia tidak menghendaki perbaikan, maka ia tidak memiliki hak sebagaimana zahir redaksi ayat tersebut. Ini adalah hikmah lain dari masa menunggu tersebut, yaitu bahwa mungkin saja suami menyesal berpisah dengan hingga masa “iddah” ini dijadikan waktu untuk berpikir matang dan memutuskan ketetapannya. Ini menunjukkan kepada kecintaan Allah kepada adanya kasih sayang diantara kedua suami istri dan kebencianNya terhadap perpisahan sebagaimana nabi bersabda, “Perbuatan halal yang paling dibenci oleh Allah adalah talak.” Ini adalah khusus pada talak 1 dan 2 (talak Raj’i), adapun talak ketiga, maka seorang suami tidak berhak untuk kembali kepada istrinya yang telah ditalak, namun bila mereka berdua sepakat untuk kembali bersama, maka harus melakukan akad yang baru yang terpenuhi syarat-syaratnya. Kemudian Allah berfirman, “Dan para wanita mempunyai hak yang seimbang dengan kewajibannya menurut cara yang Ma’ruf .” Maksudnya, para wanita memiliki hak yang wajib atas suami-suami mereka sebagaimana para suami memiliki hak yang wajib maupun yang sunnah atas mereka, dan patokan bagi hak-hak di antara suami-istri adalah pada yang Ma’ruf yaitu menurut adat yang berlaku pada negeri tersebut dan pada masa itu dari wanita yang setara untuk laki-laki yang setara, dan hal itu berbeda sesuai dengan perbedaan waktu, tempat, kondisi, orang dan kebiasaan. Disini terdapat dalil bahwa nafkah, pakaian, pergaulan, dan tempat tinggal, demikian juga berjima, semua itu kembali kepada yang Ma’ruf, dan ini juga merupakan konsekuensi dari akad yang mutlak, adapun bila dengan syarat, maka menurut syarat tersebut kecuali syarat yang menghalalkan yang haram atau mengharamkan yang halal. “Akan tetapi para suami, mempunyai satu tingkatan lebih daripada istrinya,” artinya, ketinggian, kepemimpinan, dan hak yang lebih atas dirinya, sebagaimana Allah berfirman: \"Kaum laki-laki itu adalah pemimpin bagi kaum wanita, oleh karena Allah telah melebihkan sebahagian mereka (laki-laki) atas sebahagian yang lain (wanita), dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka.\"QS an-nisa ayat 34 Kedudukan kenabian, kehakiman, imam masjid (shalat), maupun kekhalifahan, serta segala kekuasaan adalah khusus bagi laki-laki, dan juga mempunyai hak dua kali lipat dari hak kaum wanita dalam banyak perkara seperti warisan dan semacamnya. “Dan Allah maha perkasa lagi maha bijaksana.” Maksudnya, Allah memiliki kekuasaan yang kuat dan kekuasaan yang agung, di mana segala sesuatu tunduk kepadaNya. Akan tetapi bersama keperkasaanNya Allah juga bijaksana dalam segala tindakanNya. Dan tidak termasuk dalam keumuman ayat ini adalah wanita wanita hamil, karena iddah mereka adalah melahirkan bayinya, dan wanita-wanita yang belum dicampuri suaminya, mereka tidak memiliki iddah, juga hamba sahaya, karena iddah mereka adalah 2 haid sebagaimana perkataan sahabat, sedangkan konteks ayat menunjukkan bahwa yang dimaksud disana adalah wanita yang merdeka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡمُطَلَّقَٰتُ } Al-Muthallaqât: Bentuk jamak dari muthallaqah yaitu wanita yang diperlakukan dengan buruk oleh suaminya kemudian diceraikan oleh suaminya atau oleh hakim. { يَتَرَبَّصۡنَ } Yatarabbashna: Menunggu { قُرُوٓءٖۚ } Quruu’ : Al-Qar’u memiliki dua pengertian, yaitu waktu suci atau waktu haidh. { مَا خَلَقَ ٱللَّهُ فِيٓ أَرۡحَامِهِنَّ } Mâ khalaqallahu fî Arhamihinna: Apa yang Allah ciptakan berupa janin, maka tidak halal bagi wanita yang diceraikan untuk menyembunyikannya. { وَبُعُولَتُهُنَّ } Wa bu’ulatuhunna: Suami-suami mereka. Bu’ulah memiliki bentuk tunggal ba’lun seperti kata fahlun atau nakhlun. { بِرَدِّهِنَّ فِي ذَٰلِكَ } Biroddihinna fi dzalika: Yaitu berhak untuk kembali kepada istri pada waktu menunggu (iddah). { وَلَهُنَّ مِثۡلُ ٱلَّذِي عَلَيۡهِنَّ } Walahunna mitsluladziy ‘alaihinna: Istri memiliki kewajiban yang harus ditunaikan kepada suaminya, begitu juga wanita memiliki hak yang harus ditunaikan oleh suaminya. { وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٞۗ } Walirrijaali ‘alaihinna darajat: Yaitu derajat kepemimipinan bahwa secara syariat lelaki menjadi pemimpin bagi wanita. Makna ayat: Bersamaan dengan penyebutan thalaq bagi suami yang melakukan Ila’ dan tetap tidak mau untuk membatalkan sumpahnya, maka Allah Ta’ala menyebutkan pada ayat ini tentang wanita-wanita yang diceraikan sampai akhir ayat. Bagi wanita yang diceraikan oleh suaminya dan sedang haidh, tidak boleh menerima pinangan dari lelaki lain selama tiga kali masa quru’. Apabila masa tunggunya telah selesai dan suaminya tidak rujuk kepadanya, maka boleh baginya untuk menikah dengan lelaki lain. Masa tunggu ini dinamakan dengan ‘iddah yang mana hukumnya wajib bagi perempuan sebagai hak suaminya. Karena suami memiliki hak untuk rujuk kepadanya dalam masa ‘iddah tersebut, sesuai dengan makna firman Allah Ta’ala; وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ إِنۡ أَرَادُوٓاْ إِصۡلَٰحٗاۚ “Dan suami-suaminya berhak merujuk kepadanya dalam masa menanti itu, jika mereka (para suami) itu menghendaki perbaikan (ishlah).” Bagi wanita tidak boleh menyembunyikan haidhnya dengan mengatakan,”aku baru satu kali haidh atau dua kali haidh” padahal kenyataanya sudah tiga kali haidh agar ia bisa kembai rujuk dengan suaminya. Tidak boleh juga mengatakan,”aku sudah tiga kali haidh” dengan tujuan agar suami tidak bisa merujuknya lagi, dan tidak boleh baginya untuk menyembunyikan kehamilan sehingga ketika ia menikah dengan lelaki lain maka anak itu dinisbahkan kepada suami yang baru, padahal itu bukan anak suaminya yang baru. Ini merupakan dosa besar. Oleh karena itu Allah Ta’ala mengatakan bagi mereka tidak boleh menyembunyikan apa yang diciptakan oleh Allah dalam rahimnya. Maksudnya menyembunyikan haidh dan kehamilan jika mereka benar-benar beriman kepada Allah dan hari akhir. Firman Allah Ta’ala (وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ ) “Dan suami-suaminya berhak merujuk kepadanya dalam masa menanti itu”. Maknanya adalah suami lebih berhak (untuk rujuk, pent) dibandingkan istrinya yang diceraikan selama dalam masa ‘iddahnya dan dengan syarat bahwa keinginan rujuk tersebut tidak memberikan mudharat untuk istrinya, bahkan seharusnya tujuan rujuk itu adalah untuk melakukan perbaikan dan bergaul dengan baik antara keduanya, inilah lahiriah firman Allah Ta’ala “jika mereka (para suami) itu menghendaki perbaikan (ishlah).” Bagi istri yang diceraikan agar meniatkan dengan rujuknya kepada suaminya untuk mengadakan perbaikan juga. Kemudian Allah Ta’ala mengabarkan bahwa bagi istri ada hak-hak yang harus dipenuhi oleh suaminya, seperti itu juga bagi suami ada hak yang harus ditunaikan oleh istrinya. Allah Ta’ala berfirman,”Para wanita mempunyai hak yang seimbang dengan kewajibannya menurut cara yang ma’ruf”. Kemudian Allah mengabarkan bahwa lelaki memiliki derajat ketinggian di atas wanita, dimana erajat ini tidak diperoleh dan tidak dimiliki oleh perepuan, yaitu kepemimpinan yang dipahami dari firman Allah Ta’ala dalam surat An-Nisa’,”Kaum laki-laki itu adalah pemimpin bagi kaum wanita, oleh karena Allah telah melebihkan sebagian mereka (laki-laki) atas sebagian yang lain (wanita), dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka.” (QS An-Nisa: 34) Dan ayat ini diakhiri dengan kalimat Dan Allah Maha Perkasa lagi Maha Bijaksana, yang menunjukkan kewajiban melaksanakan ajaran-ajaran ini demi kemuliaan dan kebijaksanaan Allah Ta’ala. Karena yang menang itu wajib untuk ditaatik dan yang Maha Bijaksana wajib untuk tunduk kepada Nya dalam syariat Nya, karena syariat tersebut yang terbaik dan bermanfaat serta tidak memberikan mudharat. Pelajaran dari ayat: • Penjelasan tentang masa ‘iddah bagi wanita yang diceraikan suaminya apabila memiliki waktu haidh maka sejumlah tiga kali masa haidh atau suci. • Haramnya menyembunyikan masa haidh atau kehamilan bagi wanita yang diceraikan atas apa yang Allah ciptakan dalam rahimnya, untuk tujuan apapun. • Lebihnya hak seorang lelaki untuk merujuk istrinya yang telah diceraikannya apabila belum selesai masa ‘iddahnya. Bahkan dikatakan wanita yang dicerai masih dalam masa ‘iddah itu tetap dikatakan sebagai istri dengan dalil bahwa jika meninggal maka suami masih mendapatkan waris darinya, dan apabila suami yang meninggal maka wanita tersebut menerima waris dari suaminya. Oleh karena itu tidak diperbolehkan baginya untuk menerima pinangan dan menikah dengan lelaki lain selama masih dalam masa ‘iddahnya. • Penetapan hak-hak dua pihak yaitu suami dan istri dari yang lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 228: Allah memerintahkan cara mutlak bahwasannya lihatlah olehmu tiga masa haid setelah mentalaknya jika tidak haid maka tunggu sanoai 3 bulan dan ini adalah masa iddah wanita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang masih mengalami haidh dan sudah dicampuri (karena wanita yang belum sempat dicampuri tidak menjalani masa 'iddah). Adapun wanita yang sudah monopause (berhenti haidh) dan wanita kecil yang belum mengalami haidh, maka 'iddahnya adalah tiga bulan. Sedangkan wanita yang hamil, 'iddahnya sampai melahhirkan sebagaimana diterangkan dalam surat Ath Thalaq. Adapun budak wanita, maka 'iddahnya adalah dua kali quru' sebagaimana dikatakan para sahabat. Dengan tidak menikah. Quru' dapat diartikan suci atau haidh, namun yang rajih menurut sebagian ulama, bahwa maksud quru' di sini adalah haidh. Tujuan menunggu tiga kali quru' adalah agar rahim dapat dipastikan benar-benar kosong, dengan begitu tidak terjadi percampuran nasab. Oleh karena itu, Allah Subhaanahu wa Ta'aala mewajibkan wanita untuk memberitahukan keadaan rahimnya, apakah hamil ataukah haidh. Di antara hikmah lainnya menunggu (biasa disebut 'iddah) adalah untuk memberikan kesempatan kepada suami yang mungkin menyesali perbuatannya mentalak istrinya. Adanya syari'at iddah menunjukkan kecintaan Allah terhadap kerukunan antara suami-istri dan dibenci-Nya talak meeskipun halal. Berupa kehamilan atau haidh. Menyembunyikan kehamilan dalam rahimnya dapat menimbulkan banyak mafsadat (kerusakan), di antaranya: bisa mengakibatkan penisbatan anak kepada yang bukan bapaknya sehingga silaturrahim terputus, kekacauan dalam hal warisan, mahram dan kerabatnya menjadi berhijab terhadap anak tersebut, bahkan bisa sampai menikahi mahramnya dan mafsadat lainnya yang begitu banyak yang tidak diketahui selain oleh Allah Subhaanahu wa Ta'aala. Kalau pun mafsadatnya hanya dianggap batal menikah dengan anak yang lahir itu, di mana dalam perbuatan tersebut terdapat dosa besar, yaitu zina, itu pun sudah cukup. Adapun menyembunyikan haidh atau memberitakan secara dusta, di dalamnya juga terdapat banyak mafsadat, di antaranya menghilangkan hak suami untuk merujuknya dan membolehkan kepada laki-laki lain menikahinya. Jika si wanita memberitakan belum nampak haidh mengakibatkan 'iddahnya lama padahal seharusnya sudah selesai, oleh karena itu nafkah yang didapat dari suaminya adalah suht (harta haram) karena sudah selesai haidhnya, dan jika si wanita dirujuk oleh suaminya padahal sudah selesai masa 'iddahnya -hanya karena si wanita berdusta-, maka menjadi zina. Oleh karena itu, Allah Subhaanahu wa Ta'aala melarang dengan tegas wanita menyembunyikan keadaan rahimnya jika mereka memang betul-betul beriman kepada Allah dan hari akhir. Dalam ayat ini terdapat dalil diterimanya berita wanita tentang keadaan dirinya, yakni dalam masalah yang tidak diketahui oleh orang lain selain dirinya, seperti haidh, hamil dsb. Yakni hendaknya rujuk itu niatnya islah atau menginginkan kebaikan, dan tidak bermaksud memadharatkan. Lalu bagaimana jika suami merujuk istrinya dengan maksud memadharatkan? Dalam hal ini ada dua pendapat. Jumhur ulama berpendapat bahwa suami tetap memiliki hak rujuk, namun menurut Syaikh As Sa'diy bahwa suami tidak memilikinya jika berniat memadharatkan sebagaimana ditunjukkan oleh zhahir ayat. Wanita memiliki hak yang seimbang dengan kewajibannya. Hak-hak antara suami dan istri kembali kepada uruf atau adat yang berlaku pada daerah setempat, dan hal ini berbeda-beda tergantung waktu, tempat, keadaan, orang dan adat kebiasaan. Misalnya wajibnya taat bagi istri kepada suami. Hal ini disebabkan karena suami bertanggung jawab terhadap keselamatan dan kesejahteraan rumah tangga sekaligus yang menafkahinya (Lihat surat An Nisaa' ayat 34). Ayat ini menunjukkan bahwa laki-laki berada di atas wanita dan haknya berada di atas hak wanita. Oleh karena itu, kenabian, jabatan hakim, kepemimpinan baik dalam lingkup kecil maupun besar hanya dipegang laki-laki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 228",
    "description": "Setelah menjelaskan masalah perempuan yang ditalak suaminya, berikut ini Allah menjelaskan idah mereka. Dan para istri yang diceraikan bila sudah pernah dicampuri, belum menopause, dan tidak sedang hamil, wajib menahan diri mereka menunggu selama tiga kali quru, yaitu tiga kali suci atau tiga kali haid. Tenggang waktu ini bertujuan selain untuk membuktikan kosong-tidaknya rahim dari janin, juga untuk memberi kesempatan kepada suami menimbang kembali keputusannya. Tidak boleh bagi mereka menyembunyikan apa yang diciptakan Allah dalam rahim mereka, baik berupa janin, haid, maupun suci yang dialaminya selama masa idah. Ketentuan di atas akan mereka laksanakan dengan baik jika mereka beriman kepada Allah dan hari akhir. Dan para suami mereka berhak menjatuhkan pilihannya untuk kembali kepada istri mereka dalam masa idah itu, jika mereka menghendaki perbaikan hubungan suami-istri yang sedang mengalami keretakan tersebut. Dan mereka, para perempuan, mempunyai hak seimbang yang mereka peroleh dari suaminya dengan kewajibannya yang harus mereka tunaikan menurut cara yang patut sesuai tugas dan tanggung jawab masing-masing. Tetapi para suami mempunyai kelebihan di atas mereka. 3 yaitu derajat kepemimpinan karena tanggung jawab terhadap keluarganya. Allah mahaperkasa atas orang-orang yang mendurhakai aturan-aturan yang telah ditetapkan, mahabijaksana dalam menetapkan aturan dan syariat-Nyatalak yang memungkinkan suami untuk merujuk istrinya itu dua kali. Setelah talak itu jatuh, suami dapat menahan untuk merujuk istrinya dengan baik atau melepaskan dengan menjatuhkan talak yang ketiga kalinya dengan baik tanpa boleh kembali lagi sesudahnya. Tidak halal bagi kamu mengambil kembali sesuatu yang telah kamu berikan kepada mereka seperti maskawin, hadiah, atau pemberian lainnya, kecuali keduanya khawatir tidak mampu menjalankan hukum-hukum Allah karena tidak ada kecocokan. Jika kamu, para wali, khawatir bahwa keduanya tidak mampu menjalankan hukum-hukum Allah dalam berumah tangga, maka keduanya tidak berdosa atas bayaran yang harus diberikan oleh istri berupa maskawin yang pernah ia terima dari suaminya sebagai pengganti untuk menebus dirinya. 4 itulah hukum-hukum Allah, maka janganlah kamu melanggar ketetapan Allah berupa perintah dan larangannya. Barang siapa melanggar hukum-hukum Allah yang telah ditetapkan maka mereka itulah orang-orang zalim yang menganiaya diri sendiri. Talak yang masih memungkinkan suami untuk merujuk istrinya hanya dua kali, dan disebut talak raj'i. Suami tidak boleh meminta kembali pemberian yang sudah diberikan kepada istrinya bila telah bercerai. Suami bahkan dianjurkan menambah lagi pemberiannya sebagai mutah untuk menjamin hidup istrinya itu di masa depan. 3"
  }
]