[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Talak yang masih terjadi padanya kesempatan merujuk hanya ada dua kali, yang pertama dan sesudahnya. Dan ketetapan dari Allah setelah jatuhnya tiap talak adalah menahan istri dengan cara-cara yang baik dan mempergauli nya dengan baik setelah merujuknya, atau melepasnya dengan perlakuan yang baik pula dengan cara memenuhi hak-haknya, dan suami yang menceraikannya tidak menyebut-nyebut keburukan wanita itu. Dan tidak halal bagi kalian (wahai para suami), untuk mengambil sedikitpun dari mahar dan pemberian lain yang telah kalian serahkan kepada mereka, kecuali kedua belah pihak takut tidak dapat menjalankan hak suami istri. maka saat itu, mereka berdua menyandarkan perkara mereka kepada para wali. Lalu apabila para wali mengkhawatirkan suami-istri tidak dapat menjalankan rambu-rambu aturan Allah, maka tidak ada kesalahan atas mereka berdua tentang sesuatu yang diserahkan kepada suami sebagai pengganti untuk rela menceraikannya. Hukum-hukum itu adalah rambu-rambu batasan dari Allah yang membedakan antara perkara halal dan perkara haram, maka janganlah kalian melanggarnya. Barangsiapa melampaui batas-batas Allah, maka mereka itu adalah orang-orang yang telah berbuat kezaliman terhadap diri mereka sendiri lantaran menjerumuskannya kepada siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "229. Talak (perceraian) yang suami mempunyai hak untuk rujuk adalah sebanyak dua kali. Yakni ia mentalak istrinya kemudian merujuknya, kemudian mentalaknya (lagi) kemudian merujuknya. Kemudian setelah talak kedua tersebut si suami hanya mempunyai dua pilihan, mempertahankan rumah tangganya bersama sang istri dengan perlakuan yang baik, atau mentalaknya untuk ketiga kalinya dengan perlakuan yang baik kepadanya dan memberikan hak-haknya. Dan tidak halal bagi kalian -wahai para suami- mengambil kembali mahar yang telah kalian berikan kepada istri-istri kalian, kecuali apabila ada seorang istri yang membenci suaminya, baik karena kondisi fisik maupun perangainya, dan keduanya merasa bahwa kebencian itu membuat keduanya tidak dapat melaksanakan kewajibannya masing-masing. Hendaklah mereka berdua menyampaikan permasalahan mereka kepada orang dekat mereka atau orang lainnya. Apabila wali mereka merasa bahwa keduanya tidak bisa menjalankan tugas sebagai suami-istri, maka tidak ada masalah jika si istri melakukan khulu' (melepaskan diri dari ikatan pernikahan dengan suaminya) dengan memberikan sejumlah harta kepada suaminya sebagai imbalan atas perceraiannya. Hukum-hukum syariat itu adalah garis pemisah antara halal dan haram. Jadi, jangan pernah melampaui garis tersebut. Barangsiapa melampaui batas-batas yang Allah tetapkan antara halal dan haram, mereka itulah orang-orang yang menganiaya diri mereka dengan menjerumuskannya ke dalam kebinasaan dan membuatnya rentan terkena hukuman dan murka Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "229. Talak yang sesuai syariat yang dibolehkan untuk rujuk kembali adalah dua kali talak, talak satu kemudian talak dua. Setiap hendak rujuk harus berusaha untuk menjaga hubungannya kembali atau memilih benar-benar berpisah dengan baik dan dengan perkataan yang baik serta memberi hadiah atau harta. Hai para suami, diharamkan bagi kalian untuk mengambil kembali apa yang telah kalian berikan kepada para istri, baik itu mahar maupun lainnya; kecuali jika kedua pasangan khawatir terjadi perselisihan, maka dalam hal ini keduanya hendaklah mengembalikan perkara mereka berdua kepada para wali atau hakim. Jika terbukti bahwa keduanya tidak menjalankan kewajiban masing-masing sebagai pasangan suami istri maka tidak mengapa jika istri menggugat cerai dengan siap mengembalikan mahar yang telah dia terima. Demikianlah hukum-hukum yang tinggi derajatnya, maka janganlah kalian melanggar hukum-hukum tersebut. Barangsiapa yang melanggarnya maka sungguh ia jauh dari kebenaran, dan zalim terhadap diri sendiri dan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "229. الطَّلٰقُ مَرَّتَانِ ۖ (Talak (yang dapat dirujuki) dua kali) Yakni talak yang diperbolehkan untuk rujuk kembali adalah sebanyak dua kali; yang pertama dan yang kedua, adapun untuk yang ketiga tidak dapat rujuk. Dan pada setiap kali talak pertama dan kedua ada dua pilihan, baik itu rujuk (بِمَعْرُوفٍ) dengan cara yang ma’ruf berupa pergaulan yang baik dan pemenuhan hak-hak atau (تَسْرِيحٌۢ بِإِحْسٰنٍ) menceraikan dengan cara yang baik, yakni dengan tidak merujuknya sampai selesai masa iddahnya, melepasnya ke rumah keluarganya dengan perkataan yang baik, dan memberinya mut’ah (hadiah atau harta) -Lihat ayat 236-. شَيْـًٔا (sesuatu) Yakni tidak dihalalkan bagi para suami untuk mengambil apa yang telah diberikan kepada sang istri seperti mahar dan yang sesuatu lainnya sebagai bentuk usaha untuk memberi kerugian terhadap sang istri. إِلَّآ أَن يَخَافَآ أَلَّا يُقِيمَا حُدُودَ اللَّـهِ ۖ (kecuali kalau keduanya khawatir tidak akan dapat menjalankan hukum-hukum Allah) Yakni kecuali memang sang istri benci terhadap suaminya dan sudah tidak betah hidup dengannya meski tanpa ada keburukan yang dilakukan suami terhadapnya. فَإِنْ خِفْتُمْ (Jika kamu khawatir) Kalimat ini ditujukan bagi para pemimpin, hakim, atau orang yang menjadi penengah antara suami istri untuk memperbaiki hubungan keduanya. أَلَّا يُقِيمَا حُدُودَ اللَّـهِ (bahwa keduanya (suami isteri) tidak dapat menjalankan hukum-hukum Allah) Yakni yang berupa pergaulan yang baik dan ketaatan. فَلَا جُنَاحَ عَلَيْهِمَا فِيمَا افْتَدَتْ بِهِۦ ۗ (maka tidak ada dosa atas keduanya tentang bayaran yang diberikan oleh isteri untuk menebus dirinya) Yakni apabila keduanya takut tidak dapat menjalankan hukum-hukum Allah tersebut maka dibolehkan bagi isteri untuk menebus dirinya dengan cara memberikan sebagian harta yang bisa diterima oleh suami agar bisa mentalaknya. Dan ini dinamakan dengan Khul’u. maka boleh bagi suami untuk mengambil harta tersebut untuk kemudian mentalaknya apabila sang suami memang tidak memaksa sang istri atau memberi kamadharatan kepadanya. تِلْكَ حُدُودُ اللَّـهِ (Itulah hukum-hukum Allah) Yakni hukum-hukum dalam pernikahan dan perceraian, dan ini adalah hukum-hukum Allah yang diperintahkan kepada kalian untuk menjalankannya. فَلَا تَعْتَدُوهَا ۚ (maka janganlah kamu melanggarnya) Yakni melanggar hukum-hukum tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ الطَّلَاقُ مَرَّتَانِ } Allah menggunakan kata { مَرَّتَانِ } yakni dua kali, dan tidak mengatakan ( طلقتان ) \"dua talaq\" , hal ini mengisyaratkan bahwa jatuhnya talaq yang diperbolehkan rujuk kembali mesti dengan cara talaq dua kali talaq, bukan dengan cara melafalkannya sebanyak dua kali dalam satu kesempatan, dan pendapat ini dikatakan oleh sebagian besar dari ahli tafsir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "229. Talak yang memperbolehkan rujuk setelahnya itu sebanyak dua kali, yaitu talak pertama dan kedua, dan tidak ada rujuk pada talak ketiga, Dan hal itu dilakukan berkali-kali bukan sekali. Dan setiap kali hitungan talak itu boleh rujuk dengan melakukan pergaulan yang baik dan menunaikan hak-haknya atau cerai dengan baik dengan tidak rujuk dengan istri sampai berakhirnya masa iddah, dan mengembalikannya ke rumah keluarganya dengan perkataan yang baik, serta meberikan mut’ah yaitu hadiah atau harta. Wahi para hakim atau penengah antara suami-istri, jika kalian takut tidak bisa melakukan aturan Allah dengan membuat keduanya tetap menjadi suami istri dengan pergaulan yang baik dan penuh ketaatan, maka tidak ada dosa bagi kedua belah pihak jika pihak wanita diberi harta sebagai ganti perceraiannya, dan inilah yang disebut khulu’. Seperti itulah hukum-hukum Allah tentang pernikahan dan perceraian yang mana kalian diperintahkan untuk mengerjakannya. Maka jangan sampai kalian melampaui batasan hukum itu dengan menentangnya, maka barangsiapa menentangnya maka mereka itu adalah orang-orang yang menzalimi diri sendiri. Aisyah berkata: “Ayat ini turun ketika ada seorang lelaki yang berkata kepada istrinya “Demi Allah aku menalakmu, maka pergilah dariku, dan aku tidak akan tinggal bersamamu selamanya” Lau istrinya berkata: “Bagaimana itu?” Lalu laki-laki itu berkata: “Aku menalakmu, dan setiap kali masa iddahmu selesai, aku akan rujuk denganmu” Lalu turunlah ayat Al-Qur’an {Ath-Thalaaqu marratan}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Talak itu dua kali} Talak raj’i itu dua kali {lalu menahan (rujuk) dengan cara yang patut} dengan hubungan yang baik dan lembut {atau melepaskan} melepaskan jalannya {dengan baik. Tidak halal bagi kalian mengambil kembali sesuatu yang telah kalian berikan kepada mereka, kecuali keduanya (suami dan istri) khawatir tidak mampu menjalankan batas-batas ketentuan Allah} kecuali suami dan istri mengira bahwa keduanya tidak bisa menjaga hak-hak pernikahan {Jika kalian khawatir bahwa keduanya tidak mampu menjalankan batas-batas (ketentuan) Allah, maka keduanya tidak berdosa atas sesuatu yang ditebus oleh istri} maka tidak ada kesalahan bagi keduanya terkait istri yang membebaskan dirinya dengan memberikan harta yang dikehendaki oleh suami {Itulah batas-batas (ketentuan) Allah, janganlah kalian melanggarnya} maka janganlah kalian melewatinya {Siapa saja yang melanggar} melewati {batas-batas (ketentuan) Allah, mereka itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "229. Talak pada masa jahiliyah dan terus berlanjut pada masa awal Islam, yaitu seorang suami menceraikan istrinya tanpa batas, dimana apabila ia menghendaki memadharatkan istrinya, maka dia ceraikan dulu dan apabila hampir selesai masa iddahnya, ia rujuk kembali, kemudian ia ceraikan kembali dan begitulah seterusnya, hingga membuat kemadharatan bagi wanita yang hanya Allah saja yang mengetahuinya. Maka Allah memberitahukan bahwa “talak” yang boleh dilakukan rujuk padanya adalah “2 kali,” agar suami dimungkinkan (apabila ia tidak bermaksud memadharatkan), untuk kembali kepada istrinya dan ia berpikir kembali pada masa tersebut, namun jika lebih dari masa itu, maka tidaklah haram baginya, karena barangsiapa yang mentalak lebih dari dua kali, maka dia itu kalau bukan karena lancang terhadap yang haram atau ia tidak mempunyai keinginan untuk merujuk, maka maksudnya adalah memadharatkan. Karena itu Allah memerintahkan kepada suami tersebut untuk merujuk istrinya “dengan cara yang Ma'ruf,” yaitu, pergaulan yang baik yang berlaku di antara mereka seperti apa yang berlaku pada pasangan yang semisal mereka, dan inilah yang lebih kuat, bila tidak, maka hendaklah menceraikan dan meninggalkannya “dengan cara yang baik.” Di antara cara yang baik itu adalah tidak mengambil sesuatu pun dari harta istrinya karena perceraian tersebut, karena tindakan itu adalah kezaliman dan mengambil harta tanpa ada timbal baliknya sedikitpun. Oleh karena itu Allah berfirman, “tidak halal bagi kamu mengambil kembali sesuatu yang telah kamu berikan kepada mereka, kecuali kalau keduanya khawatir tidak ada yang dapat menjalankan hukum-hukum Allah,” yakni, melakukan khulu’ dengan cara yang Ma’ruf, dimana sang istri membenci suaminya akibat kejelekan akhlak, paras atau kurangnya agamanya, dan ia khawatir tidak dapat mentaati Allah padanya. “Jika kamu khawatir bahwa keduanya (suami istri) tidak dapat menjalankan hukum-hukum Allah, maka tidak ada dosa atas keduanya tentang bayaran yang diberikan oleh istri untuk menebus dirinya,” karena hal itu adalah pengganti untuk mendapatkan maksud yang dikehendakinya yaitu perpisahan. Ayat ini merupakan dalil disyariatkannya khulu’ apabila hikmah tersebut ditemukan. “Itulah,” yakni, apa yang telah disebutkan dari hukum-hukum syariat, “hukum-hukum Allah” yaitu ketetapan-ketetapan Allah yang disyariatkan olehNya bagi kalian dan Dia perintahkan untuk menjalankannya. “Barangsiapa yang melanggar hukum-hukum Allah, mereka itulah orang-orang yang zhalim.” Dan kezaliman apalagi yang lebih besar daripada menerobos yang halal dan melampaui batas nya sampai menjadi haram, di mana yang telah dihalalkan allah tidaklah memuaskan ? Kezhaliman itu ada 3 macam: Pertama, kezhaliman hamba antara dirinya dengan Allah, kedua, kezhaliman hamba yang paling besar yaitu syirik, dan ketiga, kezhaliman hamba antara dirinya dengan orang lain. Syirik itu tidak akan diampuni oleh Allah kecuali dengan bertaubat, dan hak hak hamba tidak sedikitpun dikesampingkan oleh Allah, sedangkan kedholiman yang terjadi antara seorang hamba dengan rabbnya dalam perkara selain syirik adalah di bawah kehendak dan hikmah Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلطَّلَٰقُ } Ath-Thalaq: Sebutan dari kata kerja Thallaqa yaitu ucapan suami kepada istrinya kamu saya thalaq.” { مَرَّتَانِۖ } Marrataan: Suami menthalaq istrinya lalu merujuknya, kemudian menthalaq lagi lantas merujuknya. Yaitu suami memiliki kesempatan untuk rujuk dalam dua kali thalaq. Adapun thalaq yang ketiga maka tidak ada kesempatan untuk rujuk sampai istri menikah dengan lelaki lain. { فَإِنۡ خِفۡتُمۡ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ } Fain khiftum allâ yuqîmâ hudûdallâh: Yaitu perlakuan yang baik antar suami istri, jika istri merasa takut atau suami merasa takut tidak dapat menunaikan hak-hak perkawinan, boleh bagi istri untuk meminta pisah dengan membayarkan sejumlah harta kepada suami, agar istri dapat berpisah dengan suaminya dan ini dinamakan dengan khulu’. { حُدُودَ ٱللَّهِ } Hudûdallâh: Hal yang tidak boleh dilanggar oleh seorang hamba karena ketaatan kepada Allah Ta’âlâ. { الظالم } Adz-Dzholim: Orang yang melampaui batas yang telah digariskan oleh Allâh Ta’âlâ. Zhalim bermakna meletakkan sesuatu bukan pada tempatnya. Makna ayat: Konteks ayat ini masih membicarakan mengenai hukum seputar thalaq. Allah Ta’ala menetapkan dalam ayat ini bahwa thalaq yang diucapkan oleh suami dan berkonsekuensi masih bisa rujuk adalah thalaq yang pertama dan kedua. Sampai di sini siapa saja yang menthalaq istrinya untuk kedua kalinya, maka ia memiliki pilihan untuk rujuk dan tetap bersama istrinya, atau menceraikannya dengan baik. Apabila suami rujuk dan menthalaq ketiga kalinya maka tidak bisa mereka rujuk sampai istri menikah dengan lelaki yang lain, inilah makna firman Allah (ٱلطَّلَٰقُ مَرَّتَانِۖ فَإِمۡسَاكُۢ بِمَعۡرُوفٍ) “Thalaq (yang dapat dirujuki) dua kali. Setelah itu boleh rujuk lagi dengan cara yang ma’ruf atau menceraikan dengan cara yang baik.” Dengan cara ma’ruf yaitu dengan perlakuan yang baik dengan menunaikan hak-hak suami dengan baik, atau berpisah dengan cara yang baik, dimana suami memberikan maharnya yang tersisa apabila masih, dan memberikan bagian hartanya serta tidak menyebutkan keburukan istrinya. Firman Allah Ta’âlâ (وَلَا يَحِلُّ لَكُمۡ أَن تَأۡخُذُواْ مِمَّآ ءَاتَيۡتُمُوهُنَّ شَيئ‍ًٔا ) “Tidak halal bagi kamu mengambil kembali dari sesuatu yang telah kamu berikan kepada mereka.” Allah Ta’ala mengharamkan bagi suami untuk mengambil bagian mahar milik istrinya tanpa keridhoan darinya, kecuali dalam satu keadaan boleh bagi istri untuk memberikan harta kepada suami agar ia menceraikan dirinya, hal ini dinamakan sebagai khulu’. Harta tersebut halal bagi suami tanpa ia berbuatu zhalim. Inilah makna firman Allah,”Jika kamu khawatir bahwa keduanya (suami istri) tidak dapat menjalankan hukum-hukum Allah” yaitu pergaulana yang baik antar suami istri maka tidak mengapat alias tidak berdosa apabila istri menebus dirinya dengan memberikan harta kepada suaminya dan suami boleh mengambilnya karena meninggalkannya dan melepaskan ikatan pernikahan di antara keduanya. Firman Allah,”Inilah batasan-batasan Allah.” Maksudnya adalah hukum-hukum syariat Nya, maka tidak boleh melanggar kehalalan menuju keharaman dan tidak boleh melampaui batas dalam kebaikan ssehingga menjurus kepada keburukan, begitu juga melanggar hal yang ma’ruf dan menjurus kepada kemungkaran. Barangsiapa yang menentang hukum-hukum Allah sungguh telah menzhalimi dirinya sendiri dan bersiap untuk menerima azab, dan itulah yang pantas untuknya. Pelajaran dari ayat: • Haram bagi suami untuk langsung menthalaq tiga istrinya dengan satu lafadz, karena Allah Ta’ala berfirman bahwa talak istri dua kali. • Perempuan yang telah dithalaq tiga tidak halal untuk rujuk kepada suaminya sampai ia menikah lagi dengan lelaki lain dan suami yang baru ini menthalaqnya atau meninggal. • Disyariatkannya khulu’ bagi wanita yang tidak suka untuk meneruskan kehidupan rumah tangga dengan suaminya, sehingga ia membebaskan dirinya dengan memberikan sejumlah harta kepada suaminya sebagai ganti nafkah yang diberikan selema menjalani kehidupan rumah tangga bersama. • Kewajiban untuk mematuhi batasan-batasan Allah dan tidak melanggarnya. • Haram melakukan kezhaliman yang berupa tiga bentuk : Kezhaliman syirik yang mana seorang hamba tidak akan diampuni apabila melakukannya kecuali dengan taubat darinya. Kezhaliman kepada orang lain dan ini harus disertai meminta kehalalan darinya, dan kezhaliman hamba kepada dirinya sendiri dengan melanggar batasan-batasan Allah, perkara ini dikembalikan kepada Allah. Apabila Dia berkehendak akan mengampuni apabila tidak akan memberinya hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 229: Ketahuilah bahwasannya talak yang benar adalah dua talak saja; meungkin ditalak kemudian rujuk kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Talak di zaman jahiliyyah dan berlanjut sampai pada masa awal-awal Islam tidak ada batasannya. Oleh karena itu, ketika seorang suami hendak memadharatkan istri, ia mentalaknya, sehingga ketika masa 'iddah hampir habis, ia merujuknya, lalu mentalak lagi. Dengan begitu, istri menjadi menderita, maka Allah Subhaanahu wa Ta'aala menerangkan bahwa talak yang masih bisa dirujuk hanya dua kali. Tidak memadharatkan istri dan bergaul dengan istri secara baik. Termasuk dengan cara yang baik adalah tidak mengambil harta yang telah diberikan kepada wanita yang dicerai dan tidak menyebutkan keburukannya. Seperti mahar dan semisalnya. Yakni memenuhi hak-hak suami dan istri. Ayat inilah yang menjadi dasar hukum khulu' dan penerimaan 'iwadh. Khulu' yaitu permintaan cerai kepada suami karena fisik suami, akhlak atau kurang agamanya, sedangkan si wanita khawatir tidak dapat mentaati perintah Allah dengan pembayaran yang disebut 'iwadh. Suami boleh mengambil 'iwadh terebut. Karena menyerahkan dirinya kepada azab Allah. Perlu diketahui, bahwa kezaliman terbagi tiga: 1. Kezaliman yang terjadi antara seorang hamba dengan Allah, yang terbesarnya adalah perbuatan syirk. Perbuatan syirk tidak diampuni Allah kecuali jika seorang bertobat sebelum meninggalnya. Adapun jika di bawah syirk, maka dosa tersebut terserah kehendak Allah, jika Dia menghendaki, Dia memaafkannya dan jika Dia menghendaki, Dia akan menyiksanya. 2. Kezaliman yang terjadi antara seorang hamba dengan sesamanya. Dalam hal ini, hak hamba yang dirampas harus dikembalikan. 3. Kezaliman yang terjadi antara seorang hamba dengan dirinya sendiri, yaitu dengan mengerjakan perbuatan maksiat dan dosa. Pada hakikatnya, kezaliman yang dilakukan seseorang meskipun ditujukan kepada yang lain, namun kembalinya kepada diri sendiri, karena sama saja menyerahkan dirinya kepada azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 229",
    "description": "Talak yang memungkinkan suami untuk merujuk istrinya itu dua kali. Setelah talak itu jatuh, suami dapat menahan untuk merujuk istrinya dengan baik atau melepaskan dengan menjatuhkan talak yang ketiga kalinya dengan baik tanpa boleh kembali lagi sesudahnya. Tidak halal bagi kamu mengambil kembali sesuatu yang telah kamu berikan kepada mereka seperti maskawin, hadiah, atau pemberian lainnya, kecuali keduanya khawatir tidak mampu menjalankan hukum-hukum Allah karena tidak ada kecocokan. Jika kamu, para wali, khawatir bahwa keduanya tidak mampu menjalankan hukum-hukum Allah dalam berumah tangga, maka keduanya tidak berdosa atas bayaran yang harus diberikan oleh istri berupa maskawin yang pernah ia terima dari suaminya sebagai pengganti untuk menebus dirinya. 4 itulah hukum-hukum Allah, maka janganlah kamu melanggar ketetapan Allah berupa perintah dan larangannya. Barang siapa melanggar hukum-hukum Allah yang telah ditetapkan maka mereka itulah orang-orang zalim yang menganiaya diri sendiri. Talak yang masih memungkinkan suami untuk merujuk istrinya hanya dua kali, dan disebut talak raj'i. Suami tidak boleh meminta kembali pemberian yang sudah diberikan kepada istrinya bila telah bercerai. Suami bahkan dianjurkan menambah lagi pemberiannya sebagai mutah untuk menjamin hidup istrinya itu di masa depan. 3 kemudian jika dia memilih untuk menceraikan istri-Nya setelah talak yang kedua, yakni pada talak ketiga yang tidak lagi memberinya kesempatan untuk rujuk, maka perempuan itu tidak halal lagi baginya sebelum dia menikah dan melakukan hubungan suami-istri dengan suami yang lain. Kemudian jika suami yang lain itu menceraikannya, maka tidak ada dosa dan halangan bagi keduanya, yakni suami pertama dan mantan istrinya, untuk menikah kembali dengan akad yang baru, setelah ia selesai menjalani masa idahnya dari suami kedua. Hal ini dapat ditempuh jika keduanya berpen-dapat akan dapat menjalankan hukum-hukum Allah dengan menjalani hidup baru yang lebih baik sesuai dengan aturan yang ditetapkan Allah. Apabila keduanya ragu untuk kembali dengan baikbaik maka niat untuk kembali hidup bersama hendaknya dibatalkan. Itulah ketentuan-ketentuan Allah tentang hukum talak, rujuk, dan khulu' yang dite-rangkan-Nya kepada orang-orang yang berpengetahuan agar mereka memahami dan memperhatikan hukum-hukum Allah."
  }
]