[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kalian -wahai orang-orang kafir yang membangkang- masih dalam keraguan terhadap Alquran yang telah kami turunkan kepada hamba kami Muhammad Shallallahu Alaihi Wasallam dan kalian beranggapan ia bukan dari sisi Allah, maka datangkanlah satu surat yang menyerupai satu surat al-quran dan Mintalah bantuan kepada siapa saja yang dapat kalian jumpai dari para penolong kalian, jika kalian benar dalam klaim kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan jika kalian –wahai manusia- meragukan kebenaran Al-Qur`ān yang diturunkan kepada hamba Kami, Muhammad -ṣallallāhu 'alaihi wa sallam-, maka Kami menantang kalian untuk menandinginya dengan cara membuat satu surah saja yang mirip dengannya, meskipun hanya menandingi surah yang terpendek dari Al-Qur`ān. Silakan kalian panggil bala bantuan yang bisa menolong (dalam membuat surah itu) jika tuduhan kalian itu benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Kemudian Allah menekankan masalah pengesaan-Nya dalam peribadatan dengan menujukan firman-Nya bagi orang-orang musyrik Makkah yang mendustakan Rasulullah, Allah menantang mereka yang diantara mereka adalah orang-orang yang fasih dan ahli dalam bahasa arab karena mereka meragukan kebenaran Rasulullah dalam hal al-Qur'an yang diturunkan kepadanya. Hendaklah mereka buat semisal al-Qur'an meski hanya satu surat, dan hendaklah mereka meminta tolong tuhan-tuhan selain Allah yang mereka klaim untuk melakukan itu jika mereka benar-benar dalam kebenaran. Dan itu mustahil mereka lakukan karena Allah mengetahui hasilnya bahwa mereka tidak akan berhasil melakukannya meskipun telah mengerahkan segala usaha dan kemampuan mereka. Kemudian Allah memperingatkan mereka dari balasab atas kejahatan besar mereka berupa neraka yang terbentuk dari batu dan potongan daging dan lemak orang-orang kafir yang mengalirkan minyak, apinya akan dinyalakan dan mengeluarkan asap yang mengepul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا (dalam keraguan tentang Al Quran yang Kami wahyukan kepada hamba Kami (Muhammad) Yakni keraguan tentang Al Quran yang Kami wahyukan kepada Muhammad secara berangsur-angsur. فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ (buatlah satu surat (saja) yang semisal Al Quran itu) Yakni Allah menantang mereka agar mendatangkan semisal sebuah surat yang ada pada al-qur’an meski hanya surat yang pendek. وَادْعُوا شُهَدَاءَكُمْ مِنْ دُونِ اللَّهِ (dan ajaklah penolong-penolongmu selain Allah) Yakni manusia yang akan menjadi saksi bahwa yang kalian datangkan itu layaknya al-Qur’an."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah ta'ala menyebut Rasul-Nya dengan sifat \"Ubudiyah\" yakni sebagai seorang hamba dengan kedudukannya yang paling mulia, Allah berfirman sebagai tantangan terhadap orang-orang kafir : { وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ } \"Dan jika kamu (tetap) dalam keraguan tentang Al Quran yang Kami wahyukan kepada hamba Kami (Muhammad), buatlah satu surat (saja)\" , dan dalam peristiwa Isra' Allah berfirman : { سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ } \"Maha Suci Allah, yang telah memperjalankan hamba-Nya\" , dan dalam konteks doa : { وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ } \"Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembah-Nya (mengerjakan ibadat)\" , maka difahami bahwasanya sifat yang paling mulia bagi seorang hamba adalah sifat 'Ubudiyah, dan sebaik-baik nama seorang hamba disisi Allah adalah dengan menyebutnya sebagai hamba."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Apabila kalian meragukan turunnya Al-Qur’an kepada Muhammad SAW, maka datangkanlah sesuatu yang serupa dengan surah manapun dari Al-Qur’an, sekalipun itu pendek. Dan serulah manusia agar bersaksi bahwa kalian berada di jalan kebenaran. Jika kalian adalah orang-orang yang membenarkan keangkuhan kalian, maka itu adalah tantangan yang nyata kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian (tetap) dalam keraguan} keraguan {tentang apa yang Kami turunkan kepada hamba Kami, maka buatlah satu surah yang semisal dengannya} satu surah yang serupa dengan (surah) Al-Qur’an {dan ajaklah penolong-penolong kalian} para penyelamat dan penolong kalian {selain Allah, jika kalian adalah orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Ini merupakan dalil logika atas kebenaran Rosululloh SHOLALLOHU 'ALAIHI WASALLAM dan keshahihan apa yang dibawa beliau dimana Allah berfirman, ”Dan jika kamu tetap –wahai sekalian orang-orang yang menentang Rosululloh SHOLALLOHU 'ALAIHI WASALLAM dan menolak dakwah beliau serta yang menuduhnya berdusta- dalam keraguan, dan kebimbangan terhadap wahyu yang kami turunkan atas hamba kami, apakah itu benar atau bohong belaka? Maka disinilah suatu perkara yang adil sebagai pemutus perkara antara kalian dengannya, yaitu bahwasanya ia adalah seorang manusia juga seperti kalian dan bukan dari jenis makhluk yang lain, dan kalian mengenalnya sejak lahirnya di tengah kehidupan kalian, ia tidak menulis dan tidak pula membaca, lalu ia datang kepada kalian dengan membawa sebuah kitab suci yang ia katakan berasal dari sisi Allah, dan kalian berkata bahwasanya ia membuat-buatnya dan melakukan kedustaan, maka jika itu sebagaimana yang kalian sebutkan, maka hadirkanlah sebuah surat saja yang semisal dengannya, mintalah bantuan kepada orang-orang yang kalian anggap mampu membuatnya dari sahabat dan sejawat-sejawat kalian, karena hal itu adalah suatu perkara yang mudah saja bagi kalian, apalagi kalian adalah pakar-pakar bidang bahasa, pakar orator, dan permusuhan terhadap rosul SHOLALLOHU 'ALAIHI WASALLAM. Apabila kalian mampu menghadirkan satu surat yang semisalnya, maka perkaranya adalah seperti yang kalian sebutkan, namun bila kalian tidak mampu menghadirkan satu suratpun yang semisal dan kalian tidak mampu lagi berusaha (dan kalian tidak akan pernah mampu menghadirkan satu suratpun yang semisalnya, akan tetapi tantangan ini adalah tantangan yang obyektif dan mencoba memahami keberatan kalian), maka ayat ini merupakan ayat yang agung dan dalil yang jelas lagi terang akan kebenarannya dan kebenaran wahyu yang dibawanya, maka wajiblah atas kalian untuk mengikutinya, dan sebagai tindakan penjagaan diri dari api neraka yang panasnya sangat tinggi dan membara, dimana bahan bakarnya adalah manusia dan bebatuan, yang bukan seperti api dunia yang hanya dibakar dengan kayu saja, api ini seperti yang telah dijelaskan , telah disiapkan dan dipersembahkan bagi orang-orang kafir kepada Allah dan RosulNya, maka janganlah kalian kafir terhadap RosulNya setelah jelas bagi kalian bahwasanya ia adalah Rosululloh SHOLALLOHU 'ALAIHI WASALLAM"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : رَيۡبٖ Ar-Raib maknanya adalah keraguan disertai dengan goncangnya jiwa عَبۡدِنَا ‘Abdinaa yaitu Nabi Muhammad shallallahu ‘alaihi wasallam مِّن مِّثۡلِهِۦ Min mitslihi artinya yang serupa dengan Al-Qur’an dan serupa dengan Muhammad dalam dal buta aksaranya. شُهَدَآءَكُم Syuhadaa’akum : Para penolong kalian dan sesembahan kalian yang kalian seru bahwasanya mereka bersaksi untuk kalian di sisi Allah dan memberikan syafa’at. Makna ayat : Setelah Allah Ta’ala menetapkan pokok agama pada ayat sebelumnya, yaitu tauhid yang berarti hanya beribadah kepada Allah saja tanpa selainNya. Allah Ta’ala pada ayat ini menetapkan pokok agama yang kedua yaitu kenabian dan kerasulan Muhammad shallallahu ‘alaihi wasallam dengan jalan penjelasan yaitu jika kalian ragu terhadap Al-Qur’an yang kami turunkan kapada hamba kami, rasul kami Muhammad buatkan satu surat saja yang serupa atau lelaki yang buta huruf serupa dengan hamba kami yang buta huruf. Pelajaran dari ayat : 1. Penetapan kenabian Rasulullah shallallahu ‘alaihi wasallam dengan menetapkan turunnya Al-Qur’an kepadanya. 2. Kepastian lemahnya manusia untuk membuat satu surat yang serupa dengan surat dalam Al-Qur’an walaupun sudah berlalu 1406 tahun hijriah dan tantangan itu masih terus saja berlanjut dan tidak ada yang mampu karena firman Allah (Mereka tidak akan mampu)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 23: Kemudian Allah mengarahkan firman-nya kepada mereka orang-orang yang kafir yang sombong di mana mereka menyekutukan Allah bersama dengan sekutu-sekutu mereka . Allah berkata kepada mereka : maka jika kalian terdapat keraguan akan Al-quran yang telah Kami turunkan kepada Muhammad , maka datangkan satu surat saja yang semisal dengan surat Al-quran dalam Bayan dan Balaghah dan mintalah kalian pertolongan kepada mereka yang sanggup dari para ahli bahasa yang fasih di antara kalian jika kalian memang benar-benar orang yang jujur dan sesungguhnya kalian tidak akan dapat membuatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang masih meragukan jika sebelumnya tidak mengenal yang hak, lalu diterangkan yang hak itu, maka diharapkan mau mengikuti jika memang dalam hatinya ada niat mencari yang hak. Adapun orang yang tetap menentang, yakni sudah mengetahui yang hak, namun malah ditinggalkannya, maka tidak mungkin rujuk, demikian juga orang yang meragukannya dan niat untuk mencari yang hak tidak benar, pada umumnya ia juga tidak mau mengikuti. Jika kalian wahai orang-orang kafir tetap meragukan Al Qur'an yang diturunkan kepada Muhammad shallallahu 'alaihi wa sallam yang tidak mengenal tulis-baca dan kalian mengira bahwa ia bukan dati sisi Allah. Disebut \"hamba Kami\" oleh Allah Ta'ala dalam ayat tersebut merupakan kedudukan besar bagi Beliau. Ayat ini merupakan tantangan bagi mereka yang meragukan tentang kebenaran Al Quran. Al Qur'an itu tidak dapat ditiru walaupun hanya satu surat meskipun mengerahkan semua ahli sastera dan bahasa karena ia merupakan mukjizat Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 23",
    "description": "Dan jika kamu tetap meragukan kebenaran Al-Qur'an yang telah kami nyatakan tidak ada keraguan di dalamnya, yang kami turunkan secara berangsur-angsur kepada hamba kami nabi Muhammad, maka sebenarnya ada bukti nyata di antara kamu yang dapat menjelaskan kebenarannya, yaitu: buatlah satu surah yang semisal dengannya, baik dari segi sastra, kandungan hukum, nilai-nilai moral, maupun petunjuk lainnya yang ada dalam Al-Qur'an; dan ajaklah penolong-penolongmu selain Allah untuk membantumu dalam menyusun yang serupa, kamu tidak akan mampu melakukan itu. Ini semua hendak-Nya kamu lakukan jika kamu menganggap dirimu sebagai orang-orang yang benar pernyataannya bahwa Al-Qur'an hanyalah karya buatan nabi Muhammadjika kamu tidak mampu membuat surah yang serupa dengan-Nya, dan kamu pasti tidak akan mampu melakukannya, sebab hal itu berada di luar kemampuanmu sebagai manusia, maka takutlah kamu akan api neraka dengan memelihara diri dari hal-hal yang dapat menjerumuskan kamu ke dalamnya yang bahan bakarnya manusia yang ingkar/kufur dan batu yang berasal dari patung-patung sembahan dan lainnya, yang disediakan bagi orang-orang kafir dan setiap orang yang bersikap seperti mereka, yaitu menutupi kebenaran tanda kekuasaan Allah."
  }
]