[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian apabila suami telah mentalaq istrinya untuk ketiga kalinya, maka wanita itu tidak lagi halal baginya sampai wanita itu menikahi lelaki lain selain dirinya dengan pernikahan yang sah, dan suaminya (yang kedua) mencampurinya dalam pernikahan itu, serta pernikahan itu diadakan dengan dorongan suka sama suka, bukan dimaksudkan untuk menghalalkan si wanita itu bagi suami pertamanya. apabila suami kedua telah menceraikannya, atau ditinggal mati olehnya, dan masa iddahnya telah selesai, maka tidak ada dosa atas wanita itu dan suami pertamanya untuk melangsungkan pernikahan lagi dengan akad yang baru, dan mahar baru, selama mereka yakin akan menegakkan hukum-hukum Allah yang telah di syariatkan Nya bagi pasangan suami istri. Itu adalah hukum-hukum Allah yang telah ditentukan, Ia menjelaskannya bagi orang-orang yang mengetahui hukum-hukum dan batas batasannya, karena mereka adalah orang-orang yang dapat mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "230. Apabila suaminya menceraikannya untuk ketiga kalinya, maka ia tidak boleh menikahinya kembali sebelum wanita itu menikah dengan laki-laki lain dengan pernikahan yang sah, atas dasar suka sama suka, bukan dengan tujuan menghalalkan pernikahannya kembali dengan mantan suaminya. Kemudian apabila suami yang kedua ini menceraikannya atau meninggal dunia, maka wanita itu boleh menikah kembali dengan mantan suaminya yang pertama dengan akad nikah yang baru dan mahar yang baru pula, jika memang keduanya merasa bahwa mereka akan menjalankan kewajiban sesuai dengan ketentuan hukum-hukum syariat. Itulah hukum-hukum syariat yang Allah jelaskan kepada orang-orang yang mau mengetahui hukum-hukum-Nya dan batas-batas-Nya, karena merekalah yang bisa mengambil manfaatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "230. Jika suami mentalak istrinya untuk yang ketiga kali maka diharamkan baginya untuk rujuk kembali hingga mantan istrinya itu menikah dengan lelaki lain dan menggaulinya dengan kerelaan. Jika suami kedua ini mencerainya atau meninggal dunia dan telah berakhir masa iddah wanita ini, maka boleh bagi suami pertama untuk menikahinya dengan akad yang baru jika keduanya dirasa akan menegakkan hukum-hukum Allah dengan sungguh-sungguh. Demikianlah Allah menjelaskan hukum-hukum-Nya bagi orang-orang yang mengetahui hukum-hukum-Nya dengan benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "230. فَإِن طَلَّقَهَا (Kemudian jika si suami mentalaknya) Setelah disebutkan dua talak pada kesempatan yang lalu, disini disebutkan talak yang lain yaitu talak yang ketiga. فلا تحل له مِنۢ بَعْدُ حَتَّىٰ تَنكِحَ زَوْجًا غَيْرَهُۥ ۗ (hingga dia kawin dengan suami yang lain) Yakni sampai menikah dengan lelaki lain dan menjima’nya. Namun apabila sang suami menikahi perempuan ini dengan maksud agar istrinya menjadi halal untuk dinikahi suaminya yang sebelumnya maka hal itu diharamkan, sebagaimana dalil-dalil yang ada tentang hinaan perbuatan ini dan hinaan pelakunya dengan istilah domba pinjaman yang Rasulullah melaknatnya dan melaknat orang yang menjadikannya melakukan perbuatan tersebut. Dan perbuatan itu juga tidak menghalalkan perempuan tersebut bagi suami sebelumnya. فَإِن طَلَّقَهَا (Kemudian jika suami yang lain itu menceraikannya) Yakni apabila suami kedua tersebut mentalaknya atau berpisah dengannya karena meninggal dunia atau pembatalan akad. فَلَا جُنَاحَ عَلَيْهِمَآ (maka tidak ada dosa bagi keduanya) Yakni bagi pasangan suami istri yang pertama. أَن يَتَرَاجَعَآ (untuk kawin kembali) Yakni untuk rujuk kembali kepada pasangannya yang dulu dengan akad nikah yang baru, meski dulunya telah terjadi talak tiga. إِن ظَنَّآ أَن يُقِيمَا حُدُودَ اللَّـهِ ۗ (jika keduanya berpendapat akan dapat menjalankan hukum-hukum Allah) Yakni berupa kewajiban-kewajiban rumah tangga atas keduanya. وَتِلْكَ حُدُودُ اللَّـهِ (Itulah hukum-hukum Allah) Yakni hukum-hukum yang telah disebutkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَإِنْ طَلَّقَهَا فَلَا تَحِلُّ لَهُ مِنْ بَعْدُ حَتَّىٰ تَنْكِحَ زَوْجًا غَيْرَهُ ۗ فَإِنْ طَلَّقَهَا فَلَا جُنَاحَ عَلَيْهِمَا أَنْ يَتَرَاجَعَا إِنْ ظَنَّا أَنْ يُقِيمَا حُدُودَ اللَّهِ ۗ وَتِلْكَ حُدُودُ اللَّهِ } Ayat ini merupakan dalil atas seseorang bila akan mengerjakan suatu perkara, khususnya masalah-masalah perwalian yang besar maupun yang kecil, maka hendaklah ia memperhatikan dirinya dahulu, apabila ia memandang dirinya memiliki kemampuan untuk mengendalikan hal itu dan ia yakin akan hal itu, maka ia boleh melakukannya, namun bila tidak, maka lebih baik ia menahan diri. 2 ). Allah hanya mengatakan : { لِقَوْمٍ يَعْلَمُونَ } \"kepada kaum yang (mau) mengetahui\" , dan Allah tidak mengatakan kepada kaum yang jahil, karena jika perintah dan larangan banyak ditujukan kepada orang-orang jahil sesungguhnya mereka tidak akan menjaganya dan tidak akan mengambil sumpah atasnya, sedangkan orang yang berilmu dan faham niscaya akan menjaga perintah dan larangan itu; oleh karena itu Allah hanya berbicara kepada orang-orang yang berilmu dan tidak kepada orang jahil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "230. Dan jika suami telah menalak istrinya talak tiga, maka dia tidak boleh rujuk dengannya sampai dia menikah dengan suami lainnya yang pernikahannya tidak terbatas waktu dan mereka telah berjima’. Dan jika suami pertama ingin menghalalkan wanita itu maka hal tersebut haram, Dan jika suami kedua menalaknya, maka tidak ada dosa bagi suami pertama untuk menikahinya dengan akad yang baru setelah usai masa iddahnya, jika keduanya tahu bahwa keduanya itu menunaikan hak-hak pernikahan yang harus dilakukan oleh kedua belah pihak. Itulah hukum-hukum Allah yang diterangkan kepada kaum yang mau merenung. Ayat ini turun untuk Aisyah binti Abdurrahman bin ‘Atik yang menikah setelah ditalak bain kubra oleh suaminya, lalu dia ditalak lagi sebelum disentuh oleh suami keduanya dan dia ingin rujuk dengan suami pertamanya. Lalu rasulullah SAW bersabda : “Tidak boleh, sampai suami kedua menyentuhnya” dalau turunlah hukum ini untuk dia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika dia menceraikannya kembali, maka perempuan itu tidak halal lagi baginya hingga dia menikah dengan laki-laki yang lain. Jika (suami yang lain itu) sudah menceraikannya, maka tidak ada dosa bagi keduanya (suami pertama dan mantan istri) untuk ruju’ jika keduanya mengira akan dapat menjalankan hukum-hukum Allah. Itulah ketentuan-ketentuan Allah yang diterangkan kepada orang-orang yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "230. Allah berfirman, “kemudian Jika suami mentalak nya (sesudah talak yang kedua),” yakni, talak yang ketiga, “maka perempuan itu tidak lagi halal baginya hingga dia kawin dengan suami yang lain,” yakni, nikah yang sah dan menggaulinya (Jima) dengannya, karena nikah syar’i pasti merupakan nikah yang sah yang meliputi akad dan berjima, dan ini telah disepakati, dan berjima dan menjadi suatu yang wajib bahwa nikah kedua itu adalah nikah atas dasar suka. Namun apabila ia hanya bermaksud dengan nikah itu untuk membuat suami pertama halal kembali, maka tidaklah dinamakan nikah dan tidak bisa menjadi penghalal (bagi suami pertama) dan tidak pula jimaknya seorang tuan (pemilik sahaya), karena itu bukan seorang suami. Apabila suami kedua menikahinya atas dasar suka lalu dia berjimak dengannya kemudian dia cerai darinya dan telah habis iddahnya, “maka tidak ada dosa bagi keduanya,” yaitu suami pertama dan si istri, “untuk kawin kembali.” Artinya, mereka berdua membuat akad baru antara mereka berdua karena (ayat ini) menyadarkan rujuk kembali kepada keduanya. Maka hal itu menunjukkan akan di syaratkan nya saling ridha. Akan tetapi dalam hal bersatu kembali itu disyaratkan keduanya memiliki perkiraan “akan dapat menjalankan hukum-hukum Allah,” yakni bahwa masing-masing dari mereka berdua harus menunaikan hak pasangannya. Yang demikian itu apabila mereka berdua menyesal dengan hubungan terdahulu mereka yang menyebabkan perpisahan dan mereka bertekad kuat untuk merubahnya dengan hubungan yang lebih baik, maka dengan demikian, tidak ada dosa bagi keduanya untuk bersatu kembali. Pemahaman terbalik ayat ini menunjukkan bahwa jika mereka berdua berpendapat tidak dapat menjalankan hukum-hukum Allah, yakni atas dasar sangkaan yang kuat bahwasanya kondisi mereka yang dahulu tetap akan terjadi dan hubungan yang buruk antara mereka berdua tidak akan lenyap sehingga mereka berdua mendapatkan dosa, karena segala perkara apabila tidak dijalankan padanya perintah Allah dan ditempuh padanya ketaatan kepadaNya, maka tidaklah halal mengerjakannya, dan ayat ini merupakan dalil atas seseorang bila akan mengerjakan suatu perkara, khususnya masalah masalah perwalian yang besar maupun yang kecil, maka hendaklah ia memperhatikan dirinya dahulu, apabila ia memandang dirinya memiliki kemampuan untuk mengendalikan hal itu dan ia yakin akan hal itu, maka ia boleh melakukannya, namun bila tidak, maka lebih baik ia menahan diri. Ketika Allah menjelaskan tentang hukum-hukum yang agung tersebut, Dia berfirman, “itulah hukum-hukum Allah,” maksudnya, syariat-syariatNya yang telah ditetapkan, dijelaskan, dan “diterangkanNya kepada kaum yang (mau) mengetahui.” Karena merekalah orang-orang yang mengambil manfaat dengannya dan mereka bermanfaat bagi orang lain. Ini menunjukkan keutamaan orang yang berilmu dan itu jelas, karena Allah menjadikan penjelasan tentang hukum-hukumNya khusus buat mereka dan bahwa merekalah yang dimaksudkan dengan hal tersebut. Ayat ini juga menunjukkan bahwa Allah mencintai ilmu hamba-hambaNya tentang hukum-hukum yang diturunkan kepada rasulNya dan mendalaminya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فَإِن طَلَّقَهَا فَلَا تَحِلُّ لَهُۥ } Fain thallaqahâ falâ tahillu lahû: Thalaq yang ketiga tidak halal bagi laki-laki untuk rujuk dengan istrinya, kecuali setelah ia menikah dengan laki-laki lain. { فَلَا جُنَاحَ عَلَيۡهِمَآ } Falâ junâha ‘alaihimâ: Yaitu tidak berdosa dan tidak mengapa bagi keduanya (suami istri, pent) untuk menikah kembali. { أَن يَتَرَاجَعَآ } An Yatarâja’â: Keduanya kembali lagi kepada pasangannya dengan akad yang baru, dengan syarat keduanya memiliki keyakinan untuk menegakkan batasan-batasan Allah, apabila tidak maka akad nikah itu tidak diperbolehkan. Makna ayat: Allah Ta’ala berfirman menjelaskan hukum bagi suami yang menthalaq istrinya dengan thalaq tiga, yaitu apabila suami menthalaqnya maka tidak halal wanita itu rujuk dengannya sampai menikah dengan laki-laki lain. Pernikahan itu benar dan wanita membangun kehidupan baru dengan suami keduanya berdasarkan hadits,”Sampai kamu (wanita) menikmati madunya, dan suami menikmati madumu.” Apabila setelah itu suami kedua menceraikannya, setelah hidup bersama dan menggaulinya, atau suami itu meninggal maka boleh bagi wanita untuk kembali kepada suaminya yang pertama apabila ia menginginkannya. Perlu diketahui bahwa keduanya haruslah memiliki keyakinan untuk menegakkan hukum-hukum Allah pada rumah tangganya. Dengan cara masing-masing memberikan hak pasangannya dan pergaulan yang baik, jika tidak maka rujuk tersebut tidak halal untuk keduanya. Oleh karena itu Allah Ta’ala berfirman,”Jika mereka yakin bahwa mereka dapat menegakkan batas-batas Allah.” Kemudian Allah Ta’’ala menyebutkan masalah batas-batas itu dengan firman Nya,”Itulah batas-batas Allah.” Yaitu syariat-syariatNya. Allah Ta’ala menjelaskannya kepada kaum yang mengetahui, karena orang-orang yang mengerti tentang syarat-syariatNya merekalah yang berhenti dalam batas-batas Allah dan tidak melanggarnya, sehingga mereka selamat dari buruknya kezhaliman dan hukuman yang akan diterima oleh orang-orang zhalim. Pelajaran dari ayat: • Wanita yang diceraikan dengan thalaq tiga tidak dapat rujuk kembali kepada suaminya kecuali dengan dua syarat. Syarat pertama wanita itu menikahi laki-laki lain dengan pernikahan yang benar, membangun hubungan rumah tangga, dan sudah digauli oleh suami yang kedua. Syarat kedua masing-masing pasangan memiliki keinginan kuat untuk saling berlaku baik kepada pasangannya ssehingga tidak terulang lagi pertikaian yang berujung pada tiga kali thalaq. • Kematian suami yang kedua seperti perceraian untuk wanita, sehingga ia bisa kembali rujuk dengan suaminya yang pertama dengan syarat yang telah disebutkan. • Apabila wanita yang dithalaq tiga menikah lagi dengan niat untuk berontak kepada suaminya, sehingga ia diceraikan dan kembali kepada suaminya yang pertama maka pernikahan ini tidak diperbolehkan karena sebagai penghalalan saja. Karena Rasulullah ﷺ menganggapnya tidak sah dan bersabda,”Semoga Allah melaknat orang yang meminta dihalalkan dan yang menghalalkan.” Dan dinamakan sebagai pejantan pinjaman. Yaitu orang yang menikahi wanita yang diceraikan dengan thalaq tiga untuk bisa kembali kepada suaminya yang pertama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 230: Ketahuilah wahai suami bahwasannya jika engkau mentalak istrimu dengan talak tiga maka tidak halal bagimu sampai seorang laki-laki menikahi istrimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan nikah yang sesungguhnya, bukan bermaksud menghalalkan kepada suami pertama, dan telah dijima'inya. Atau ditinggal wafat olehnya. Dengan akad dan mahar yang baru setelah habis masa 'iddah dari suami kedua. Dari ayat ini kita dapat mengambil kesimpulan, bahwa hendaknya seseorang ketika akan menyelami suatu urusan, melihat dirinya (berkaca kepada diri). Jika dia melihat dirinya sanggup memikul amanah tersebut dan merasa yakin, ia bisa maju dan jika tidak, ia menahan diri. Karena merekalah yang dapat mengambil manfaat daripadanya dan memberi manfaat kepada yang lain. Dalam ayat ini terdapat dalil keutamaan ahli ilmu, karena Allah Ta'ala menerangkan hukum-hukum-Nya kepada mereka, dan menunjukkan bahwa Allah Subhaanahu wa Ta'aala menyukai orang yang mengetahui hukum-hukum-Nya dan mendalaminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 230",
    "description": "Kemudian jika dia memilih untuk menceraikan istri-Nya setelah talak yang kedua, yakni pada talak ketiga yang tidak lagi memberinya kesempatan untuk rujuk, maka perempuan itu tidak halal lagi baginya sebelum dia menikah dan melakukan hubungan suami-istri dengan suami yang lain. Kemudian jika suami yang lain itu menceraikannya, maka tidak ada dosa dan halangan bagi keduanya, yakni suami pertama dan mantan istrinya, untuk menikah kembali dengan akad yang baru, setelah ia selesai menjalani masa idahnya dari suami kedua. Hal ini dapat ditempuh jika keduanya berpen-dapat akan dapat menjalankan hukum-hukum Allah dengan menjalani hidup baru yang lebih baik sesuai dengan aturan yang ditetapkan Allah. Apabila keduanya ragu untuk kembali dengan baikbaik maka niat untuk kembali hidup bersama hendaknya dibatalkan. Itulah ketentuan-ketentuan Allah tentang hukum talak, rujuk, dan khulu' yang dite-rangkan-Nya kepada orang-orang yang berpengetahuan agar mereka memahami dan memperhatikan hukum-hukum Allah. Pada ayat sebelumnya Allah menjelaskan perintah memilih untuk rujuk atau menceraikan istri, berikutnya Allah menjelaskan batas akhir pilihan itu. Dan apabila kamu menceraikan istri-istri kamu dengan talak yang memungkinkan rujuk, setelah talak pertama atau kedua, lalu sampai akhir idahnya5 mendekati habis, maka tahanlah mereka dengan merujuk jika kamu yakin mampu memperbaiki hubungan itu kembali dengan cara yang baik sesuai tuntunan agama dan adat, atau ceraikanlah mereka apabila hubungan itu tidak dapat dilanjutkan dengan cara yang baik pula. Dan janganlah kamu tahan untuk merujuk mereka dengan maksud ingin berbuat jahat atau untuk menzalimi mereka selama hidup bersama. Barang siapa melakukan demikian, yaitu tindakan jahat dan zalim, maka pada hakikatnya dia telah menzalimi dirinya sendiri sehingga ia berhak mendapat murka Allah, kebencian keluarga dan orang sekelilingnya, dan semuanya itu berimbas pada dirinya. Dan janganlah kamu jadikan ayat-ayat Allah tentang petunjuk hukum talak sebagai bahan ejekan yang dapat dipermainkan. Ingatlah nikmat Allah yang telah dia karuniakan kepada kamu, dan apa yang telah diturunkan Allah kepada kamu yaitu petunjuk tentang hukum keluarga yang terdapat dalam kitab Al-Qur'an dan hikmah atau sunah. Ketentuan-ketentuan tersebut adalah untuk memberi pengajaran kepadamu. Dan bertakwalah kepada Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan ketahuilah bahwa Allah maha mengetahui segala sesuatu."
  }
]