[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian menceraikan istri-istri kalian lalu mereka telah mendekati akhir masa iddah, maka rujuklah dengan mereka, dengan niat untuk memenuhi hak-hak mereka itu dengan cara yang baik-baik menurut perspektif syariah dan kebiasaan setempat, atau lepaskan mereka sampai selesai masa iddah mereka. Dan hindarilah sikap menjadikan rujuknya kalian dengan niat menyakiti mereka atau guna merampas hak-hak mereka. Dan barangsiapa telah melakukannya, sesungguhnya dia telah mendzolimi diri sendiri lantaran dia berhak menerima hukumannya. Dan janganlah kalian menjadikan ayat-ayat Allah dan hukum-hukum Nya sebagai bahan mainan dan senda gurau, dan ingatlah nikmat Allah yang tercurah kepada kalian dengan masuk islam dan perincian hukum-hukum. Dan ingatlah apa-apa yang Allah turunkan kepada kalian yaitu al-qur'an dan as-sunnah. Dan bersyukurlah kepada Allah ta'ala atas nikmat-nikmat yang agung ini. Allah mengingatkan kalian dengan ini, dan membuat kalian takut dari tindakan pelanggaran. Maka takutlah kepada Allah tanamkanlah perasaan selalu dilihat oleh Allah. Dan ketahuilah bahwa sesungguhnya Allah Maha Mengetahui segala sesuatu, tidak ada sesuatupun yang tersembunyi dari Nya, dan Dia akan memberikan balasan dari masing-masing pihak sesuai dengan apa yang berhak dia dapatkan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "231. Apabila kalian menceraikan istri-istri kalian, kemudian masa idah mereka mendekati habis, maka kalian boleh merujuk mereka atau meninggalkan mereka secara baik-baik tanpa rujuk sampai masa idah mereka berakhir. Janganlah kalian merujuk mereka semata-mata untuk menyengsarakan dan merugikan mereka seperti yang terjadi pada masa Jahiliah. Barangsiapa melakukan hal itu dengan tujuan menyengsarakan pihak wanita, maka ia telah menganiaya dirinya sendiri dengan cara menjerumuskan dirinya ke dalam dosa dan hukuman. Dan janganlah kalian menjadikan ayat-ayat Allah sebagai objek olok-olok dengan mempermainkan dan memperlakukannya secara tidak pantas. Ingatlah nikmat-nikmat Allah yang kalian dapatkan. Salah satunya ialah turunnya Al-Qur`ān dan Sunnah kepadamu. Allah mengingatkan kalian akan hal ini untuk memotivasi kalian (melakukan kebaikan) sekaligus menakut-nakuti agar tidak berbuat buruk. Takutlah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan ketahuilah bahwa Allah Maha Mengetahui segala sesuatu, sehingga tidak ada sesuatupun yang luput dari pengetahuan-Nya, dan Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "231. Allah memberi pilihan bagi para suami dua pilihan: jika kalian mentalak istri kalian dengan talak satu atau dua sampai hamper habis masa iddahnya, maka rujuklah dia sebelum masa iddah itu habis dengan benar-benar berniat memperbaiki hubungan pernikahan; atau biarkanlah istri mereka sampai habis masa iddahnya dengan baik tanpa maksud memperpanjang masa iddahnya. Dan janganlah kalian rujuk dengan maksud memberi mudharat kepada istri, seperti untuk memaksa mereka melakukan khulu’ -gugat cerai dengan kesiapan mengembalikan mahar- atau lainnya. Dan barangsiapa yang rujuk dengan maksud memberi mudharat maka dia telah menjerumuskan dirinya kepada siksa Allah. Dan janganlah kalian merendahkan hukum-hukum Allah, serta ingatlah keutamaan yang telah Allah berikan kepada kalian dan al-qur’an dan hadits yang telah diturunkan kepada kalian, dan syukurilah hal tersebut. Allah sedang mengingatkan dan memberi kalian petunjuk, maka takutlah kepada-Nya. Dan ketahuilah ilmu-Nya meliputi segala sesuatu. Ibnu ‘Asyur berkata, firman Allah: {فقد ظلم نفسه} menjelaskan bahwa kezaliman mereka terhadap istri merupakan kezaliman terhadap diri mereka sendiri, sebab kezaliman ini menyebabkan keretakan hubungan dan kerusakan urusan rumah tangga serta kehilangan berbagai maslahat akibat fikiran yang sibuk memikirkan perselisihan, dan juga karena dapat menjerumuskannya kepada siksaan Allah di akhirat. (at-Tahrir wa at-Tanwir: 2/403)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "231. وَإِذَا طَلَّقْتُمُ النِّسَآءَ فَبَلَغْنَ أَجَلَهُنَّ (Apabila kamu mentalak isteri-isterimu, lalu mereka mendekati akhir iddahnya) Yakni apabila kalian mentalak isteri-isteri kalian, kemudian mereka telah menjalani masa iddah sampai mendekati akhir. فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ (maka rujukilah mereka dengan cara yang ma’ruf) Yakni tanpa berniat untuk memberinya madharat. أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ ۚ (atau ceraikanlah mereka dengan cara yang ma’ruf) Yakni membiarkannya menyelesaikan masa iddah tanpa meminta rujuk. وَلَا تُمْسِكُوهُنَّ ضِرَارًا (Janganlah kamu rujuki mereka untuk memberi kemudharatan) Yakni tidak untuk kebutuhan juga bukan demi rasa cinta, akan tetapi untuk memperpanjang masa iddahnya, dan memperlama waktu menunggu sebagai dengan maksud memberi madharat dan menyakiti sang istri. وَمَن يَفْعَلْ ذٰلِكَ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ (Barangsiapa berbuat demikian, maka sungguh ia telah berbuat zalim terhadap dirinya sendiri) Yakni menjadikan dirinya terkena azab. وَلَا تَتَّخِذُوٓا۟ ءَايٰتِ اللَّـهِ هُزُوًا ۚ (Janganlah kamu jadikan hukum-hukum Allah permainan) Karena semuanya adalah kesungguhan, maka barangsiapa yang bermain-main dengan ayat-ayat tersebut maka berarti ia memang telah mempermainkannya. Dalam ayat ini Allah melarang mereka untuk tidak melakukan yang mereka lakukan dimasa jahiliyyah, dahulu mereka mentalak, memerdekakan, atau menikahkan kemudian berkata: aku tadi hanya main-main. Maka barangsiapa yang mentalak dengan main-main maka talak itu jatuh sebagai talak yang sebenarnya. وَاذْكُرُوا۟ نِعْمَتَ اللَّـهِ عَلَيْكُمْ (dan ingatlah nikmat Allah padamu) Yakni berupa agama Islam dan syari’at-syari’atnya setelah kalian dulu berada dalam kejahiliyahan dan kegelapan diatas kegelapan. الْكِتٰبِ (Al Kitab) Yakni al-Qur’an. وَالْحِكْمَةِ (Al Hikmah) Yakni as-Sunnah. يَعِظُكُم بِهِۦ ۚ (Allah memberi pengajaran kepadamu dengan apa yang diturunkan-Nya itu) Yakni mengajari dan menjadikan kalian takut dengan apa yang diturunkan kepada kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَا تُمْسِكُوهُنَّ ضِرَارًا لِتَعْتَدُوا ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ فَقَدْ ظَلَمَ نَفْسَهُ } Ayat ini sebagai tarbiyah yang menekankan bahwa sikap agresi terhadap orang lain adalah kezholiman yang akan kembali kepada pelakunya sendiri; karena sesungguhnya perbuatan itu mengundang murka dan marah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "231. Dan jika kalian menalak raj’iy istri kalian sebanyak sekali atau dua kali, lalu masa iddah mereka akan habis, rujuklah dengan mereka sebelum masa iddahnya selesai tanpa bermaksud memberikan mudharat dan lakukanlah interaksi dengan baik, atau tinggalkanlah mereka sampai selesai masa iddah mereka tanpa melakukan rujuk yang bisa memnimbulkan mudharat. Dan janganlah kalian merujuk mereka karena ingin memberi mudharat dan penderitaan dengan memperpanjang masa iddah mereka, supaya kalian bisa mengambil tebusan harta (khulu’) dengan memberi perlindungan mereka. Maka barangsiapa melakukan hal itu, maka sungguh dia telah menyuguhkan dirinya kepada azab di akhirat. Dan janganlah kalian mempermainkan dan bersenda gurau tentang hukum talak, rujuk dan hal semacamnya dengan menentang hukum tersebut. Maka barangsiapa melakukan talak candaan maka maka dia sudah melakukan talak dan telah bermain-main dengan azab Allah. Ingatlah tentang nikmat Islam dan syariatnya setelah kalian melewati masa jahiliyyah. Ingatlah juga Al-Qur’an sunnah, atau rahasia-rahasia syariat yang diturunkan oleh Allah, maka Dia akan mengingatkan dan mengajarkan kalian sesuatu yang Dia turunkan supaya kalian bisa mempelajarinya. Dan takutlah kepada Allah dalam segala urusan kalian. Ketahuilah bahwa Allah maha Mengetahui segala amal kalian dan akan membalas kalian atas amal tersebut. Ibnu Abbas berkata, “Ada seorang laki-laki yang menalak istrinya lalu rujuk lagi sebelu berakhirnya masa iddah istrinya lalu menalaknya lagi. Dia melakukan hal tersebut untuk menyakiti dan membingungkan istrinya, lalu Allah menurunkan ayat ini”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kalian menceraikan istri, hingga berakhir masa idahnya,} sampai hampir usai masa iddahnya {tahanlah mereka} rujuklah dengan mereka {dengan cara yang patut atau ceraikanlah mereka} tinggalkanlah mereka sampai selesai masa idahnya {dengan cara yang patut. Janganlah kalian menahan mereka untuk memberi kemudaratan} dan janganlah kalian rujuk dengan mereka hanya karena ingin memberi kemudharatan bagi mereka {sehingga kalian melampaui batas} sehingga kalian menzalimi mereka dengan meminta bayaran harta sebagai pengganti khulu’ {Siapa yang melakukan demikian, dia sungguh telah menzalimi dirinya sendiri. Janganlah kalian menjadikan ayat-ayat Allah sebagai bahan ejekan} janganlah kalian menjadikan ayat-ayat Allah sebagai bahan ejekan {Ingatlah nikmat Allah kepada kalian dan apa yang telah diturunkan Allah kepada kalian, yaitu Kitab dan Hikmah} Al-Qur’an dan sunnah {untuk memberi pengajaran kepada kalian. Bertakwalah kepada Allah dan ketahuilah bahwa sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "231. Kemudian Allah berfirman, “apabila kamu mentalak istri istrimu,” yakni, talak Raj’i, yang pertama atau yang kedua, “lalu mereka mendekati akhir iddahnya,” artinya sudah hampir selesai masa iddahnya, “maka rujukilah mereka dengan cara yang Ma’ruf, atau ceraikanlah mereka dengan cara yang Ma'ruf (pula).” Maksudnya, kalian kembali rujuk kepada mereka dengan niat untuk menunaikan hak-hak mereka atau kalian membiarkan mereka tanpa rujuk dan tidak pula memudharatkan mereka. Oleh karena itu, Allah berfirman, “janganlah kamu rujuknya mereka untuk memberi kemudharatan,” artinya, yang dapat menimbulkan mudharat bagi mereka, “Karena dengan demikian kamu menganiaya mereka” dalam perbuatan kalian yang halal itu menuju dengan keharaman. Yang halal adalah kalian kembali kepada mereka dengan cara yang baik sedangkan yang haram adalah kalian (rujuk untuk) memudharatkan mereka.“Barang siapa berbuat demikian maka sungguh ia telah berbuat zalim terhadap dirinya sendiri.” Seandainya kebenaran itu kembali kepada makhluk, maka mudharat itu juga kembali kepada orang yang menghendaki kemudharatan itu. “Janganlah kamu jadikan hukum-hukum Allah permainan.” Setelah Allah menjelaskan hukum-hukumNya dengan sejelas-jelasnya dimana maksud dari itu semua adalah mengetahuinya,, mengamalkannya, memperjuangkannya, serta tidak melampaui batasannya, karena Allah tidak menetapkannya dengan sia-sia, akan tetapi Allah menurunkannya dengan benar, jujur dan sungguh-sungguh, Allah melarang menjadikannya sebagai permainan. Artinya, hanya sebagai main-main yaitu dengan bersikap lancang terhadapnya dan tidak menunaikan kewajiban-kewajibannya seperti menyengaja kemudharatan dalam rujuk, atau dalam perceraian, atau banyak bercerai, atau menyatukan tiga talak sekaligus, padahal di antara rahmat Allah adalah Dia jadikan talak itu satu demi satu sebagai suatu kasih sayang untuknya dan usaha menuju kemaslahatannya. “Dan ingatlah nikmat Allah padamu” secara umum yaitu pujian dan sanjungan dengan lisan, pengakuan, dan penetapan dengan hati dan menggunakannya dengan anggota tubuh untuk ketaatan kepada Allah. “Dan apa yang telah diturunkan Allah kepadamu yaitu Alkitab (Alquran) dan Al Hikmah,” yakni as-sunnah, yang keduanya menjelaskan bagi kalian jalan-jalan kebaikan, memberi semangat buat kalian untuk melakukannya, dan juga tentang jalan-jalan kejahatan lalu mengingatkan kalian darinya, memberitahu kalian tentang diriNya dan tindakanNya terhadap wali waliNya dan musuh-musuhNya, dan mengajari kalian apa yang tidak kalian ketahui. Pendapat lain mengatakan bahwa hikmah di sini adalah rahasia-rahasia syariat. Dalam Alquran terkandung hikmah-hikmah, dan hikmah itu merupakan penjelasan hikmah Allah pada perintah-perintahNya dan larangan-laranganNya. Kedua makna tersebut adalah benar adanya. Karena Allah berfirman, “Allah memberi pengajaran kepadamu dengan apa yang diturunkanNya itu,” maksudnya, dengan apa yang Dia turunkan kepada kalian. Ini menguatkan bahwa maksud dari hikmah dalam ayat diatas adalah rahasia-rahasia syariat; karena nasihat itu adalah dengan menjelaskan hukum, hikmah, memberi dorongan dan ancaman. Berhukum dengannya akan menghilangkan kejahilan, dan hikmah disertai dengan pemberian kabar gembira dan menimbulkan keinginan, sedang hikmah disertai dengan ancaman menimbulkan kekhawatiran. “Dan bertakwalah kepada Allah” dalam segala urusan urusan kalian, “serta ketahuilah bahwasanya Allah Maha Mengetahui segala sesuatu.” Karena itulah Allah menjelaskan bagi kalian hukum-hukum tersebut dengan begitu bagus dan mantap yang sejalan dengan kemaslahatan pada setiap masa dan tempat. Maka pujian dan sanjungan hanya bagi Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَجَلَهُنَّ } Ajalahunna: Waktu bagi wanita yang diceraikan mendekati masa berhentinya ‘iddah. { أَوۡ سَرِّحُوهُنَّ } Au sarrihuhunna: Yang dimaksud dengan tasrihul muthallaqah adalah meninggalkannya tanpa rujuk dengannya sampai habis masa ‘iddahnya dan berpisah dari suaminya. { ضِرَارٗا } Dhirâran: Berbahaya untuknya dan membahayakannya { لِّتَعۡتَدُواْۚ } Lita’tadû: Agar kalian melanggar batasan kebaikan dan mengerjakan keburukan { هُزُوٗاۚ } Huzuwan: bermain dengannya tanpa niat untuk menetapi pelaksanaan hukum-hukumnya. { نِعۡمَتَ ٱللَّهِ } Ni’matullâh: Yaitu agama Islam { ٱلۡحِكۡمَةِ } Al-Hikmah: Sunnah Nabi ﷺ { يَعِظُكُم بِهِۦۚ} Ya’idzukum bihi: dengan apa yang diturunkan kepada kalian berupa hukum halal dan haram, agar kalian mensyukuri Allah Ta’âlâ dengan berbuat ketaatan kepadanya. Makna ayat: Konteks ayat ini masih menjelaskan tentang hukum-hukum yang berkaitan dengan thalaq, khulu dan rujuk. Pada ayat ini Allah Ta’ala memerintahkan hamba-hamba Nya yang beriman apabila salah seorang dari mereka menceraikan istrinya dan hampir selesai masa ‘iddahnya agar rujuk kepadanya dan mempertahankan kehidupan rumah tangganya dengan cara yang baik (ma’ruf), yaitu dengan pergaulan yang baik kepadanya. Atau bagi suami membiarkannya menyelesaikan ‘iddahnya dan melepaskannya dengan cara yang baik dan memberikan hak-haknya secara penuh serta hanya menyebutkan yang baik-baik saja tentang dirinya dan membiarkannya pergi kemana ia kehendaki. Haram bagi suami untuk rujuk kepada istrinya dengan niat untuk menimpakan mudharat kepadanya, ia tidak berbuat baik kepada istrinya dan tidak juga menceraikannya agar istri bisa lepas darinya. Allah Ta’ala berfirman,”Janganlah kamu rujuki mereka untuk memberi kemudharatan.” Yaitu tidak memberi kemudharatan kepada para istri sehingga mereka terzhalimi dan meminta khulu’ dengan menebus dirinya dari suaminya dengan memberikan harta. Allah Ta’ala mengabarkan bahwa siapa saja melakukan perbuatan itu, sama saja telah menyiapkan dirinya untuk menerima azab di akhirat. Begitu juga Allah Ta’ala melarang orang-orang mukmin bermain-main dengan hukum-hukum syariat, yaitu dengan tidak menyia-nyiakan dan tidak melaksanakannya. Allah Ta’ala berfirman:”Jangan kalian jadikan ayat-ayat Allah sebagai permainan.” Kemudian Allah Ta’ala memerintahkan mereka agar mengingat nikmat-nikmat Allah atas mereka, dimana Allah telah memberikan nikmat Islam sebagai agama yang adil dan kasih sayang, mensyukurinya dengan cara melaksanakan perintah-perintah Nya dan menjauhi larangan-larangan Nya. Wajib bagi mereka juga untuk mengingat-ingat nikmat Allah berupa tambahan atas agama Islam, yaitu nikmat turunnya al-Qur’an dan sunnah sanbi agar mereka mengambil pelajaran dari keduanya, dan Allah memerintahkan mereka untuk melakukan hal yang dapat membahagiakan dan menyempurnakannya, serta melarang mereka dari hal-hal yang menyengsarakan dan merugikan. Kemudian Allah Ta’ala memerintahkan mereka untuk bertakwa kepada Nya,”Dan bertakwalah kepada Allah.” Setelah itu Allah memberitahukan baha Dia lah yang paling berhak untuk ditakuti karena Dia lah yang Maha Mengetahui segala sesuatu, tidak ada yang tersembunyi bagi Nya sedikitpun. Hendaklah mereka berhati-hati ketika Allah melihat mereka bermaksiat serta meninggalkan ketaatan kepada Nya. Pelajaran dari ayat: • Tidak halal bagi suami yang menthalaq istrinya untuk rujuk kembali dengan tujuan untuk membahayakan dan mezhaliminya sampai wanita tersebut meminta untuk khulu’ dengan harta. • Keharaman bermain-main dengan hukum-hukum syariat tanpa memperhatikan dan melaksanakannya. • Kewajiban hamba untuk mengingat-ingat nikmat Allah, yaitu dengan lisan dan mengakuinya di dalam hati. • Kewajiban untuk bertakwa kepada Allah Ta’ala baik dalam keadaan ramai atau sepi. • Merasa diawasi oleh Allah dalam segala urusan kehidupannya, karena Allah Maha Mengetahui segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 231: Allah memerintahkan jika salah satu dari kalian mentalak istrinya dengan talak pertama dan kedua berkumpul kembali maka selesai masa iddahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni talak raj'i (masih bisa rujuk), baik sekali atau dua kali. Yakni dengan niat siap memenuhi hak istri sesuai cara yang dianggap baik oleh syara' maupun 'uruf (kebiasaan yang berlaku). Dengan membiarkan sampai habis masa 'iddahnya. Umpamanya: memaksa mereka minta cerai dengan cara khulu' atau membiarkan mereka hidup terkatung-katung. Allah Subhaanahu wa Ta'aala telah menerangkan aturan-aturan-Nya dengan jelas, di mana maksud daripadanya adalah agar diketahui dan diamalkan, agar berjalan di atas aturan itu dan tidak melanggarnya, karena Allah Subhaanahu wa Ta'aala tidaklah menurunkan main-main, bahkan menurunkannya dengan hak, benar dan serius. Allah Subhaanahu wa Ta'aala melarang menjadikan ayat-ayat-Nya ssebagai permainan, sehingga berani melanggarnya, tidak mau mengikuti kewajibannya. Termasuk dalam hal ini adalah merujuk atau mencerai tidak dengan cara yang ma'ruf (seperti dengan maksud menimpakan madharat), banyak melakukan talak, atau menggabungkan tiga talak sekaligus, padahal Allah Subhaanahu wa Ta'aala memisahkannya satu persatu karena sayang-Nya dan keinginan-Nya untuk memberikan maslahat atau yang terbaik bagi suami dan istri. Baik dengan lisan (seperti memuji dan menyanjung-Nya), dengan hati (mengakuinya) maupun dengan anggota badan (yakni dengan mengarahkan anggota badannya untuk menjalankan perintah Allah). Berupa agama Islam dan penjelasan secara rinci hukum-hukum-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 231",
    "description": "Pada ayat sebelumnya Allah menjelaskan perintah memilih untuk rujuk atau menceraikan istri, berikutnya Allah menjelaskan batas akhir pilihan itu. Dan apabila kamu menceraikan istri-istri kamu dengan talak yang memungkinkan rujuk, setelah talak pertama atau kedua, lalu sampai akhir idahnya5 mendekati habis, maka tahanlah mereka dengan merujuk jika kamu yakin mampu memperbaiki hubungan itu kembali dengan cara yang baik sesuai tuntunan agama dan adat, atau ceraikanlah mereka apabila hubungan itu tidak dapat dilanjutkan dengan cara yang baik pula. Dan janganlah kamu tahan untuk merujuk mereka dengan maksud ingin berbuat jahat atau untuk menzalimi mereka selama hidup bersama. Barang siapa melakukan demikian, yaitu tindakan jahat dan zalim, maka pada hakikatnya dia telah menzalimi dirinya sendiri sehingga ia berhak mendapat murka Allah, kebencian keluarga dan orang sekelilingnya, dan semuanya itu berimbas pada dirinya. Dan janganlah kamu jadikan ayat-ayat Allah tentang petunjuk hukum talak sebagai bahan ejekan yang dapat dipermainkan. Ingatlah nikmat Allah yang telah dia karuniakan kepada kamu, dan apa yang telah diturunkan Allah kepada kamu yaitu petunjuk tentang hukum keluarga yang terdapat dalam kitab Al-Qur'an dan hikmah atau sunah. Ketentuan-ketentuan tersebut adalah untuk memberi pengajaran kepadamu. Dan bertakwalah kepada Allah dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya, dan ketahuilah bahwa Allah maha mengetahui segala sesuatu. Setelah pada ayat sebelumnya Allah menjelaskan perihal wanitawanita yang dicerai sebelum idahnya habis, maka pada ayat ini Allah menjelaskan status mereka setelah habis masa idahnya. Dan apabila kamu, para suami, menceraikan istri-istri kamu lalu sampai idahnya habis, maka jangan kamu, mantan suami dan para wali atau siapa pun, halangi atau paksa mereka yang ditalak suaminya untuk kembali rujuk. Biarkanlah ia menetapkan sendiri masa depannya untuk menikah lagi dengan calon suaminya, 6 baik suami yang telah menceraikannya atau pria lain yang menjadi pilihannya, apabila telah terjalin kecocokan di antara mereka dengan cara yang baik. Wanita yang dicerai suaminya dan telah habis masa idahnya mempunyai hak penuh atas dirinya sendiri, seperti dijelaskan dalam sabda rasulullah, janda lebih berhak atas dirinya daripada orang lain atau walinya. Itulah yang dinasihatkan kepada orangorang di antara kamu yang beriman kepada Allah dan hari akhir. Apabila mengikuti petunjuk-petunjuk dan nasihat tentang pemenuhan hak wanita yang diceraikan untuk kembali kepada suaminya atau memilih pasangan baru, itu lebih suci bagimu dan lebih bersih terhadap jiwamu. Dan Allah mengetahui sesuatu yang dapat membawa kemaslahatan bagi hamba-Nya, sedangkan kamu tidak mengetahui di balik ketentuan hukum yang ditetapkan Allah. Wali atau mantan suami tidak boleh memaksa perempuan itu baik untuk rujuk dengan mantan suaminya dengan ketentuan harus memperbarui nikahnya, maupun menikah dengan laki-laki lain."
  }
]