[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian telah menceraikan istri istri kalian dengan talak kurang dari tiga kali dan masa iddah mereka selesai tanpa ada sikap rujuk suami kepada mereka, maka janganlah kalian (wahai para wali) mempersulit wanita-wanita yang telah ditalak itu dengan menghalang-halangi mereka untuk menikah lagi dengan akad baru dengan suami-suami mereka bila mereka memang menghendakinya, dan terjadi saling ridho antara dua belah pihak secara syariat dan kebiasaan yang berlaku. Hal itu adalah satu nasihat yang diarahkan kepada orang dari kalian yang memiliki keimanan yang benar kepada Allah dan hari akhir. Sesungguhnya sikap menghindari menghalang-halangi pernikahan dan memberikan kesempatan kepada suami-suami untuk menikahi istri mereka itu akan lebih mendatangkan keberkahan yang luas dan kesucian kehormatan-kehormatan mereka dan akan lebih besar manfaat dan pahala bagi kalian. Dan Allah mengetahui segala hal yang membawa kemaslahatan sedang kalian tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "232. Apabila kalian menceraikan istri-istri kalian kurang dari tiga kali dan masa idah mereka sudah berakhir, maka janganlah kalian -wahai para wali- melarang mereka untuk kembali kepada (mantan) suami mereka dengan akad nikah yang baru, jika mereka menginginkan hal itu dan ada persetujuan dengan (mantan) suami mereka. Ketentuan hukum yang berisi larangan melarang mereka (menikah) adalah peringatan bagi orang yang beriman kepada Allah dan hari Akhir. Hal itu lebih memungkinkan bagi berkembangnya kebaikan di dalam diri kalian dan lebih suci bagi harga diri dan perbuatan kalian dari segala macam kotoran. Allah Maha Mengetahui hakikat dan akibat dari segala sesuatu, sedangkan kalian tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "232. Jika kalian mentalak istri kalian dengan talak satu atau dua dan telah habis masa iddahnya, maka janganlah seorang wali menghalangi istri-istri itu untuk kembali kepada suaminya jika keduanya ridha dengan hubungan yang baik. Larangan ini ditaati oleh orang yang beriman kepada Allah dan hari akhir. Larangan yang agung ini sungguh lebih bersih dan lebih bermanfaat bagi kalian. Allah Maha Mengetahui segala sesuatu yang mengandung kebaikan, sedangkan kalian tidak mengetahuinya. Syeikh as-Syinqithi berkata: firman Allah {فبلغن أجلهن} secara zahir menerangkan bahwa iddah istri benar-benar telah habis. Namun Allah menjelaskan dalam ayat lain bahwa rujuk hanya dibolehkan selama masih dalam masa iddah, hal ini Allah jelaskan dalam firman-Nya {وبعولتهن أحق بردهن في ذلك} dan isim isyarat {ذلك} tertuju pada waktu yang ada dalam masa iddah, yaitu selama tiga kali haid atau tiga kali suci yang Allah sebutkan dalam ayat: وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ ثَلَاثَةَ قُرُوءٍ ۚ وَلَا يَحِلُّ لَهُنَّ أَنْ يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ إِنْ كُنَّ يُؤْمِنَّ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ إِنْ أَرَادُوا إِصْلَاحًا ۚ وَلَهُنَّ مِثْلُ الَّذِي عَلَيْهِنَّ بِالْمَعْرُوفِ ۚ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ Wanita-wanita yang ditalak handaklah menahan diri (menunggu) tiga kali quru'. Tidak boleh mereka menyembunyikan apa yang diciptakan Allah dalam rahimnya, jika mereka beriman kepada Allah dan hari akhirat. Dan suami-suaminya berhak merujukinya dalam masa menanti itu, jika mereka (para suami) menghendaki ishlah. Dan para wanita mempunyai hak yang seimbang dengan kewajibannya menurut cara yang ma'ruf. Akan tetapi para suami, mempunyai satu tingkatan kelebihan daripada isterinya. Dan Allah Maha Perkasa lagi Maha Bijaksana. (al-Baqarah: 228) Dengan demikian, jelaslah bahwa yang dimaksud dengan {فبلغن أجلهن} yaitu: jika istri yang ditalak telah mendekati habis masa iddahnya. Imam Bukhari mengeluarkan hadits dari Hasan bahwa saudara perempuan Ma’qil bin Yasar ditalak oleh suaminya, lalu suaminya tetap tidak merujuknya sampai habis masa iddah. Kemudian suaminya ingin kembali menjadikannya istri dengan melamarnya, namun Ma’qil tidak merelakan hal itu. Maka turunlah ayat: فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ maka janganlah kamu (para wali) menghalangi mereka kawin lagi dengan bakal suaminya. (al-Baqarah: 232)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "232. فَلَا تَعْضُلُوهُنَّ (maka janganlah kamu menghalangi mereka kawin lagi) Larangan ini untuk para suami, dan yang dimaksud dengan ‘adhal adalah menghalangi istri-istri untuk menikah lagi dengan siapa yang mereka sukai setelah selesai masa iddahnya sebagai bentuk kecemburuan jahiliyyah, seperti yang dilakukan olelh para khalifah dan sultan sebagai bentuk kecemburuan kepada orang yang dulunya berada dibawah tangannya kemudian menjadi dibawah orang lain. Dan pendapat lain mengatakan larangan ini ditujukan untuk para wali yang dilarang untuk tidak menghalangi anak perempuan atau saudari mereka yang telah ditalak untuk rujuk kembali kepada suaminya pada masa iddah, atau menghalanginya untuk menikah dengan yang lain setelah selesai masa iddahnya sesuai syarat-syarat yang telah disebutkan. ذٰلِكُمْ أَزْكَىٰ لَكُمْ (Itu lebih baik bagimu ) Yakni lebih bertambah baik dan bermanfaat. وَأَطْهَرُ ۗ (dan lebih suci) Yakni dari keburukan-keburukan akhlak. ( وَاللَّـهُ يَعْلَمُ Allah mengetahui) Yakni mengetahui yang lebih baik bagi kalian. وَأَنتُمْ لَا تَعْلَمُونَ (sedang kamu tidak mengetahui) Yakni hal tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "232. Dan ketika kalian menalak raj’iy istri kalian dan masa iddahnya telah usai, maka janganlah kalian mencegah mereka untuk menikahi suami-suami yang telah menalak mereka atau orang lain setelah usai masa iddah mereka, wahai para wali, jika kedua pihak saling ridha, dimana hal tersebut baik secara syariat. Larangan untuk melakukan pencegahan itu diambil pelajarannya oleh orang yang beriman kepada Allah dan akhirat, karena dia menerima hukum Allah dan meninggalkan hawa nafsu. Hukum yang ditentukan terkait rujuk dengan akad yang baru itu lebih berkah, dan bermanfaat bagi kalian serta lebih suci dari kotoran dan dosa. Dan Allah itu Mengetahui sesuatu yang baik, yang tidak kalian ketahui. Ayat ini turun untuk Ma’qil bin Yasar ketika suami saudara perempuannya ingin rujuk setelah usai masa iddah mantan istrinya, Lalu Ma’qil mencegah saudara perempuannya. Dan Allah mengetahui kebutuhan kedua belah pihak dan menurunkan ayat {Wa idza thallaqtum}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kalian menceraikan istri lalu telah sampai masa idahnya} telah selesai masa idahnya {janganlah kamu menghalangi mereka} janganlah kalian melarang mereka {untuk menikah dengan (calon) suaminya apabila telah terdapat kerelaan di antara mereka dengan cara yang patut. Itulah yang dinasihatkan} disebutkan {kepada orang-orang di antara kalian yang beriman kepada Allah dan hari akhir. Hal itu lebih bersih bagi kalian} lebih banyak peningkatan dan manfaatnya {dan lebih suci} lebih suci dari noda dosa {Allah mengetahui, sedangkan kamu tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "232. Ini ditunjukkan kepada para wali wanita yang diceraikan dengan perceraian yang bukan talak 3. Apabila telah berlalu masa iddahnya dan suami menghendaki untuk kembali menikahinya dan ia pun rela dengannya, maka walinya, seperti ayahnya atau selainnya, tidak boleh menghalanginya atau melarangnya untuk menikah kembali dengan suaminya itu sebagai suatu tindakan kebencian kepada suaminya, kemarahan terhadapnya, dan kemuakan atas akan perlakuannya mentalak istrinya dengan talak yang pertama (sebelumnya). Dan Allah menyebutkan bahwa barangsiapa yang beriman kepada Allah dan hari akhir, maka keimanannya itu akan mencegahnya dari tindakan merintangi pernikahan itu, yang demikian itu “lebih baik bagimu dan lebih suci”, dan lebih bagus dari apa yang diperkirakan oleh sang wali yaitu bahwa sebaiknya tidak menikahkan lagi, karena itulah pendapat yang paling sesuai dan bahwa hal itu sederajat dengan perlakuannya mentalak istrinya sebagaimana kebiasaan orang-orang yang sombong lagi membanggakan diri mereka. Apabila ia mengira bahwa dengan tidak menikahkan lagi adalah kemaslahatan, maka “Allah mengetahui sedang kamu tidak mengetahui.” Karena itu, kerjakanlah perintah Dzat yang maha mengetahui kemaslahatan kalian, yang menghendaki hal itu untuk kalian dan Yang Mahakuasa atas hal itu, yang mempermudahnya dari bentuk yang kalian ketahui ataupun selainnya. Ayat ini adalah dalil bahwa wali harus ada dalam suatu pernikahan, karena Allah melarang para wali dari merintangi pernikahan dan tidak melarang mereka kecuali perkara yang berada di bawah kendali mereka dan mereka memiliki hak padanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فَبَلَغۡنَ أَجَلَهُنَّ } Balaghna ajalahunna: Telah selesai dari masa ‘iddahnya. { فَلَا تَعۡضُلُوهُنَّ } Falâ ta’dhuluhunna: Jangan kamu larang istri-istri untuk menikah lagi, dengan kembali kepada suami yang telah menceraikannya dan tidak rujuk kepadanya sampai selesai masa ‘iddah. { إِذَا تَرَٰضَوۡاْ بَيۡنَهُم بِٱلۡمَعۡرُوفِۗ } Idzâ taradhau bainahum bilma’rûf: Apabila suami yang menthalaq itu ridho untuk kembali kepada istri yang diceraikannya dan begitu juga istri ridha untuk kembali kepadanya. { ذَٰلِكَ يُوعَظُ بِهِۦ } Larangan untuk melakukan ‘adhal (menghalangi pernikahan) ditujukan kepada orang-orang yang memiliki iman, karena merekalah yang mampu untuk menaatinya. { ذَٰلِكُمۡ أَزۡكَىٰ لَكُمۡ } Dzâlikum azka lakum: Meninggalkan ‘adhal (menghalangi pernikahan) leibh baik baik kalian (wali nikah, pent) dibandingkan menghalangi pernikahan dan lebih suci bagi hati kalian. Karena ‘adhal dapat menjadi penyebab terjadinya perbuatan keji (zina). Makna ayat: Allah Ta’ala melarang para wali perempuan (wali nikah, pent) untuk melarang wanita yang telah diceraikan dengan thalaq satu atau dua, untuk kembali kepada suaminya yang telah menthalaqnya dan tidak merujuknya sampai masa ‘iddah selesai, apabila wanita itu ridha untuk menikah kembali dengan suaminya yang dulu, dan begitu juga pihak suami ridha dan berniat untuk memperbaiki rumah tangganya dan bermuamalah dengan baik. Ayat ini turun berkaitan dengan kasus saudari Ma’qil bin Yassar radiyallahu ‘anhu ketika ia berniat untk kembali kepada suaminya yang telah menceraikannya dan habis masa ‘iddahnya, maka Ma’qil melarangnya untuk kembali. Firman Allah Ta’ala,”Itulah yang dinasehatkan”; maksudnya adalah larangan untuk berbuat ‘adhol (menghalangi pernikahan) ditujukan kepada orang-orang yang beriman kepada Allah dan hari akhir, karena merekalah yang hidup dan mampu menuruti seruan Allah dan rasulNya apabila mereka diperintah atau dilarang. Terakhir, Allah Ta’ala mengabarkan mereka bahwa apabila mereka tidak menghalangi wanita yang diceraikan untuk kembali pada suaminya, itu lebih baik baginya saat ini dan nanti, serta lebih suci bagi hati mereka dan masyarakat. Lantas Allah Taala mengabarkan bahwa Dia mengetahui hasil dari perkara emreka yang tidak diketahui oleh mereka. Maka wajib bagi mereka untuk menerima syariatNya dan patuh terhadap perintah dan larangan Nya. Allah Ta’ala berfirman,”Allah mengetahui, sedangkan kamu tidak mengetahui.” Pelajaran dari ayat: • Keharaman ‘adhol yaitu menghalangi wanita yang diceraikan untuk kembali rujuk dengan suaminya. • Kewajiban adanya wali terhadap wanita, karena ayat tersebut tertuju kepada para wali; “Dan janganlah kamu menghalangi mereka.” • Nasehat bermanfaat bagi orang-orang beriman karena hati mereka hidup. • Terdapat kebaikan dalam melaksanakan perintah Allah dan menjauhi larangan Nya serta terdapat kesucian seluruhnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 232: Allah memerintahkan para wali agar tidak melarang istri kembali kepada suaminya yang mentalak istrinya dengan talak satu dan dua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari dari Al Hasan, bahwa saudari Ma'qil bin Yasar pernah ditalak oleh suaminya, lalu saudarinya ditinggalkan begitu saja sampai habis 'iddahnya. Setelah itu, suaminya datang lagi hendak melamar, maka Ma'qil menolaknya. Ketika itu turunlah ayat, \"Wa laa ta'dhuluuhunna ay yankihna azwaajahunna.\" Belum sampai tiga kali talak. Tanpa dirujuk. Menikah lagi dengan bekas suami dengan akad yang baru atau dengan laki-laki yang lain. Sikap tidak menghalangi dan memberikan kesempatan kepada mereka untuk menikah lagi. Tidak seperti yang dikira oleh wali bahwa menghalanginya dari menikah adalah pendapat yang tepat, bahkan yang tepat adalah tidak menghalangi. Jika wali mengira bahwa tidak menikahkannya adalah hal yang lebih bermaslahat, maka dijawab \"Sesungguhnya Allah lebih mengetahui, sedangkan anda tidak mengetahui\". Hal yang terbaik bagimu. Oleh karena itu, ikutilah perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 232",
    "description": "Setelah pada ayat sebelumnya Allah menjelaskan perihal wanitawanita yang dicerai sebelum idahnya habis, maka pada ayat ini Allah menjelaskan status mereka setelah habis masa idahnya. Dan apabila kamu, para suami, menceraikan istri-istri kamu lalu sampai idahnya habis, maka jangan kamu, mantan suami dan para wali atau siapa pun, halangi atau paksa mereka yang ditalak suaminya untuk kembali rujuk. Biarkanlah ia menetapkan sendiri masa depannya untuk menikah lagi dengan calon suaminya, 6 baik suami yang telah menceraikannya atau pria lain yang menjadi pilihannya, apabila telah terjalin kecocokan di antara mereka dengan cara yang baik. Wanita yang dicerai suaminya dan telah habis masa idahnya mempunyai hak penuh atas dirinya sendiri, seperti dijelaskan dalam sabda rasulullah, janda lebih berhak atas dirinya daripada orang lain atau walinya. Itulah yang dinasihatkan kepada orangorang di antara kamu yang beriman kepada Allah dan hari akhir. Apabila mengikuti petunjuk-petunjuk dan nasihat tentang pemenuhan hak wanita yang diceraikan untuk kembali kepada suaminya atau memilih pasangan baru, itu lebih suci bagimu dan lebih bersih terhadap jiwamu. Dan Allah mengetahui sesuatu yang dapat membawa kemaslahatan bagi hamba-Nya, sedangkan kamu tidak mengetahui di balik ketentuan hukum yang ditetapkan Allah. Wali atau mantan suami tidak boleh memaksa perempuan itu baik untuk rujuk dengan mantan suaminya dengan ketentuan harus memperbarui nikahnya, maupun menikah dengan laki-laki lain usai menjelaskan masalah keluarga, berikutnya Allah membicarakan masalah anak yang lahir dari hubungan suami istri. Di sisi lain, dibicarakan pula ihwal wanita yang dicerai dalam kondisi menyusui anaknya. Dan ibu-ibu yang melahirkan anak, baik yang dicerai suaminya maupun tidak, hendaklah menyusui anak-anaknya selama dua tahun penuh sebagai wujud kasih sayang dan tanggung jawab ibu kepada anaknya. Air susu ibu (asi) adalah makanan utama dan terbaik bagi bayi yang tidak bisa digantikan oleh makanan lain. Hal itu dilakukan bagi yang ingin menyusui secara sempurna yaitu dua tahun, seperti dijelaskan dalam surah luqma'n/31: 41. Apabila kurang dari dua tahun, dianjurkan setidaknya jumlah masa menyusui jika digabung dengan masa kehamilan tidak kurang dari tiga puluh bulan sebagaimana ditegaskan dalam surah al-ahqa'f/43:15. Bila masa kehamilan mencapai sembilan bulan maka masa menyusui adalah dua puluh satu bulan. Apabila masa menyusui dua tahun, berarti masa kehamilan paling pendek adalah enam bulan. Dan kewajiban ayah dari bayi yang dilahirkan adalah menanggung nafkah dan pakaian mereka berdua, yaitu anak dan ibu walaupun sang ibu telah dicerai, dengan cara yang patut sesuai kebutuhan ibu dan anak dan mempertimbangkan kemampuan ayah. Seseorang tidak dibebani lebih dari kesanggupannya. Demikianlah prinsip ajaran islam. Karena itu, janganlah seorang ayah mengurangi hak anak dan ibu menyusui dalam pemberian nafkah dan pakaian, dan jangan pula seorang ayah menderita karena ibu menuntut sesuatu melebihi kemampuan sang ayah dengan dalih kebutuhan anaknya yang sedang disusui. Jaminan tersebut harus tetap diperolehnya walaupun ayahnya telah meninggal dunia. Apabila ayah telah meninggal dunia maka ahli waris pun berkewajiban seperti itu pula, yaitu memenuhi kebutuhan ibu dan anak. Apabila keduanya, yaitu ibu dan ayah, ingin menyapih anaknya sebelum usia dua tahun dengan persetujuan bersama, bukan akibat paksaan dari siapa pun, dan melalui permusyawaratan antara keduanya dalam mengambil keputusan yang terbaik, maka tidak ada dosa atas keduanya untuk mengurangi masa penyusuan dua tahun itu. Dan jika kamu ingin menyusukan anakmu kepada orang lain karena ibu tidak bersedia atau berhalangan menyusui, maka tidak ada dosa bagimu memberikan pembayaran kepada wanita lain berupa upah atau hadiah dengan cara yang patut. Bertakwalah kepada Allah dalam segala urusan dan taatilah ketentuan-ketentuan hukum Allah dan ketahuilah bahwa Allah maha melihat apa yang kamu kerjakan dan membalas setiap amal baik maupun buruk yang kamu kerjakan. Perceraian antara suami dan istri hendaknya tidak berdampak pada anak yang masih bayi. Ibu tetap dianjurkan merawatnya dan memberinya asi. Demikian pula ayah wajib memberi nafkah kepada anak dan ibu selama menyusui. Agama sangat memperhatikan kelangsungan hidup anak agar tumbuh menjadi anak yang sehat dan cerdas."
  }
]