[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan menjadi kewajiban pada ibu untuk menyusui anak-anak mereka selama dua tahun penuh bagi ibu yang berniat menyempurnakan proses penyusuan, dan menjadi kewajiban para ayah untuk menjamin kebutuhan pangan dan sandang wanita-wanita menyusui yang telah dicerai dengan cara-cara yang patut sesuai syariat dan kebiasaan setempat. Sesungguhnya Allah tidak membebani seseorang kecuali sesuai dengan kemampuannya. Dan kedua orang tua tidak boleh menjadikan anak yang terlahir sebagai jalan untuk saling menyakiti antara mereka berdua, dan menjadi kewajiban ahli waris setelah kematian ayah seperti apa yang menjadi kewajiban sang ayah sebelum kematiannya dalam hal pemenuhan kebutuhan nafkah dan sandang. Maka apabila kedua orang tua berkeinginan menyapih bayi sebelum dua tahun maka tidak ada dosa atas mereka berdua bila mereka telah saling menerima dan bermusyawarah dalam urusan tersebut, agar mereka berdua dapat mencapai hal-hal yang menjadi kemaslahatan si bayi. Dan apabila kedua orang tua sepakat untuk menyusukan bayi yang terlahir kepada wanita lain yang menyusui selain ibunya, maka tidak ada dosa atas keduanya, apabila ayah telah menyerahkan untuk Ibu apa yang berhak dia dapatkan dan memberikan upah bagi perempuan yang menyusui dengan kadar yang sesuai dengan kebiasaan yang berlaku dikalangan orang-orang. Dan takutlah kepada Allah dalam seluruh keadaan kalian dan ketahuilah bahwa sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan dan akan memberikan balasan kepada kalian atas perbuatan tersebut"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "233. Para ibu menyusui anak-anak mereka selama dua tahun penuh. Pembatasan dua tahun itu ditujukan bagi orang yang ingin menyempurnakan masa menyusui anaknya. Dan seorang suami (ayah si anak yang disusui) berkewajiban memberikan nafkah dan pakaian kepada para ibu menyusui yang diceraikannya menurut kebiasaan yang berlaku di tengah masyarakat, sepanjang tidak bertentangan dengan syariat (agama). Allah tidak akan membebani seseorang melebihi kekayaan dan kemampuannya. Salah satu dari kedua orang tuanya tidak boleh menjadikan anak tersebut sebagai alat untuk merugikan kepentingan yang lain. Dan ahli waris anak tersebut -apabila ayahnya sudah meninggal dunia dan tidak meninggalkan warisan- juga memiliki kewajiban yang sama dengan ayahnya. Jika kedua orang tuanya menghendaki anak itu disapih sebelum genap dua tahun, maka mereka tidak berdosa apabila didahului dengan musyawarah dan kesepahaman di antara mereka demi kemaslahatan si anak. Apabila kalian ingin mencari orang lain selain ibunya untuk menyusuinya, maka kalian tidak berdosa sepanjang kalian memberikan nafkahnya bersama orang yang menyusuinya dan upahnya secara baik, tanpa dikurangi dan tidak ditunda-tunda. Dan bertakwalah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan ketahuilah bahwa Allah Maha Melihat apa yang kamu perbuat, sehingga tidak ada sesuatupun yang luput dari pengawasan-Nya, dan Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan yang telah kalian lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "233. Diharuskan bagi para ibu untuk menyusui anaknya selama dua tahun untuk yang hendak menyempurnakan masa menyusui, dan dibolehkan menyusui kurang dari masa itu apabila kedua orangtua menyetujui. Dan diwajibkan bagi para ayah untuk memberi nafkah para ibu anaknya yang telah dicerainya dengan nafkah berupa makanan dan pakaian tanpa berlebihan atau kekurangan, sebab Allah tidak menghendaki untuk menyusahkan manusia dan membebani kewajiban di luar kemampuannya. Dan ayah tidak boleh memberi mudharat kepada ibu akibat mengurus anak. Dan wajib bagi orang yang diamanahkan seorang ayah untuk mengurus anaknya untuk memberi nafkah dan pakaian bagi ibu si anak sebagaimana hal ini wajib bagi si ayah. Dan jika kedua orangtua hendak menyapih anaknya sebelum genap dua tahun setelah bermusyawarah, maka tidak mengapa bagi mereka. Dan jika kedua orangtua sepakat untuk menyusukan anaknya kepada wanita lain selain ibunya, maka tidak mengapa pula bagi mereka jika si ayah memberikan hak yang seharusnya dia berikan tanpa ada kelalaian. Dan takutlah kalian kepada Allah serta ketahuilah bahwa Allah Maha Mengetahui perbuatan dan perkataan kalian. Ibnu ‘Asyur berkata, yang dimaksud dengan firman Allah: {إِنْ أَرَدْتُمْ أَنْ تَسْتَرْضِعُوا أَوْلَادَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ } adalah perubahan penyusuan anak kepada selain ibunya apabila si ibu terhalang untuk menyusui karena sakit, menikah dengan suami lain, atau enggan menyusui dengan alasan yang dibenarkan. Jadi maksud ayat adalah jika kalian hendak meminta orang lain untuk menyusui anak kalian maka tidak mengapa. (at-Tahrir wa at-Tanwir: 2/418)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "233. وَالْوٰلِدٰتُ يُرْضِعْنَ أَوْلٰدَهُنَّ (Para ibu hendaklah menyusukan anak-anaknya) Setelah Allah menyebutkan masalah pernikahan dan perceraian kemudian disini menyebutkan masalah persusuan karena sepasang suami istri ketika berpisah bisa jadi keduanya memiliki anak. Pada kata (يرضعن) mempunyai makna perintah. حَوْلَيْنِ كَامِلَيْنِ ۖ (selama dua tahun penuh) Yakni dua tahun penuh secara pasti dan bukan kira-kira, dan tidak ada persusuan setelah dua tahun. لِمَنْ أَرَادَ أَن يُتِمَّ الرَّضَاعَةَ ۚ (yaitu bagi yang ingin menyempurnakan penyusuan) Yakni menyusui selama dua tahun bukanlah keharusan melainkan itu adalah batas sempurna. Dan dibolehkan kurang dari itu apabila kedua orang tua meridhai. وَعَلَى الْمَوْلُودِ لَهُۥ رِزْقُهُنَّ وَكِسْوَتُهُنَّ (Dan kewajiban ayah memberi makan dan pakaian kepada para ibu) Yakni atas ayah yang telah diberi anak kewajiban untuk memberi makan dan pakaian bagi ibu anaknya yang telah menyusui. Oleh sebab itulah seorang anak dinisbahkan kepada ayaknya dan bukan kepada ibunya, seakan-akan para ibu hanya melahirkan anak para ayah. Dan hukum memberi makan dan pakaian ini jika sang ibu telah dicerai, dan jika bukan ibu yang dicerai maka memberi nafkah dan pakaian ini merupakan kewajiban atas ayah meski sang ibu tidak menyusui anaknya. لَا تُكَلَّفُ نَفْسٌ إِلَّا وُسْعَهَا ۚ (Seseorang tidak dibebani melainkan menurut kadar kesanggupannya) Yakni seorang wanita tidak dibebani untuk bersabar atas nafkah yang sedikit, dan tidak pula seorang ayah dibebani nafkah yang besar yang tidak ia sanggupi, akan tetapi harus memperhatikan keadilan atas keduanya. لَا تُضَآرَّ (Janganlah seorang ibu menderita kesengsaraan) Yakni seorang ibu tidak boleh menyengsaran ayah disebabkan anak dengan meminta kepadanya nafkah makan dan pakaian yang tidak ia sanggupi, dan tidak boleh pula ayah menyengsarakan seorang ibu dengan melalaikan kewajibannya atau mengambil anaknya dari ibu tanpa alasan. وَعَلَى الْوَارِثِ مِثْلُ ذٰلِكَ ۗ (dan warispun berkewajiban demikian) Yakni apabila ayah tadi meninggal maka ahli waris atas anak ini berkewajiban untuk memberi upah menyusui kepada sang ibu, sebagaimana yang dilakukan sang ayah sebelum meninggal. Dan pendapat lain mengatakan yang dimaksud dengan ahli waris disini adalah ahli waris ayah, yang berkewajiban untuk memberi nafkah dan pakaian bagi yang menyusui dengan cara yang baik. Dan diharamkan bagi yang memberi nafkah ini untuk memberi kemadharatan kepada sang ibu sebagaimana dulu diharamkan atas sang ayah. فِصَالًا (menyapih) Yakni menghentikan penyusuan. عَن تَرَاضٍ مِّنْهُمَا (dengan kerelaan keduanya) Yakni atas dasar kerelaan dari kedua orangtua. Maka apabila salah seorang dari keduanya ingin menyapih anaknya maka ia harus meminta kerelaan orang satunya dan bermusyawarah dengannya sampai keduanya bersepakat demi kebaikan anak. وَإِنْ أَرَدتُّمْ أَن تَسْتَرْضِعُوٓا۟ أَوْلٰدَكُمْ (Dan jika kamu ingin anakmu disusukan oleh orang lain) Yakni meminta agar yang menyusui anak adalah wanita lain selain ibu si anak. فَلَا جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُم مَّآ ءَاتَيْتُم (maka tidak ada dosa bagimu apabila kamu memberikan pembayaran) Yakni hal itu tidak mengapa jika meminta agar yang menyusui anak adalah wanita lain selain ibu si anak asalkan kalian memberi upah kepada ibu si anak sesuai dengan lamanya waktu menyusui, atau memberi upah kepada yang kamu mintai agar menyusui anakmu. بالمعروف (dengan cara yang ma’ruf) Yakni tanpa menunda-nunda atau mengurangi upah tersebut, karena tidak memberi upah secara baik kepada mereka menunjukkan bahwa sang ayah meremehkan dan lalai dalam urusan si anak. Dan dibolehkannya meminta agar si anak disusui oleh orang lain jika tidak memberikan madharat kepada sang ibu sebagaimana dijelaskan diawal ayat ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah manhaj robbani ini : { فَإِنْ أَرَادَا فِصَالًا عَنْ تَرَاضٍ مِنْهُمَا } \"Apabila keduanya ingin menyapih (sebelum dua tahun) dengan kerelaan keduanya dan permusyawaratan, maka tidak ada dosa atas keduanya\" jika dalam hal ini saja diwajibkan bermusyawarah dan bersepakat, maka bagaimana dengan orang yang hanya mengutamakan akalnya sendiri dalam perkara rumah tangga yang sempurna, tanpa memperhatikan keadaan yang terjadi dengan keluarga lainnya ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "233. Sebagiknya para ibu yang ditalak atau yang tidak ditalak itu menyusui anak mereka selama 2 tahun penuh bagi orang yang ingin menyusui dalam masa ini. Dan boleh di luar masa itu sesuai keridhaan kedua orang tua. Dan wajib bagi ayah untuk memberi nafkah bagi wanita yang ditalak berupa makanan dan pakaian sesuai kemampuannya, dan wajib pula bagi istri yang tidak ditalak untuk memberi nafkah tersebut meskipun tidak menyusui anak. Seseorang tidak dituntut untuk memberi nafkah perempuan yang menyusui kecuali sesuai kemampuannya atau semampunya. Dan tidak diperbolehkan menyakiti ibu karena adanya anak seperti mengurangi nafkah, atau mengambil alih anak darinya ketika dia mau untuk menyusui anak tersebut atau karena dia tidak mau rujuk. Dan ahli waris ayah yang diberi wasiat itu memiliki kewajiban yang sama atas ayahnya berupa memberi nafkah dan makan perempuan yang menyusui. Dan ketika kedua orang tua menghendaki untuk menyapih anaknya dari persusuan sebelum 2 tahun, dengan kesepakatan dan musyawarah tentang kebaikan anak, maka tidak ada dosa atas keduanya dalam kesepakatan ini. Wahai para orang tua, jika kalian ingin mencari perempuan yang menyusui selain istri kalian, maka tidak ada dosa atas kalian jika kalian telah menunaikan hak-haknya ibu (istri) atau wanita perempuan yang menyusui berupa upah tanpa ditunda-tunda atau dikurangi dan sesuai jumlah yang diiterapkan banyak orang, karena mengurangi upah itu bisa menyulitkan urusan anak dan dengan syarat agar ibu (istri) tidak dirugikan karena anaknya disusui orang lain. Takutlah kepada Allah dan ketahuilah bahwa Allah Maha Memberi Kabar lagi Maha Melihat amal kalian serta akan membalas kalian atas amal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ibu-ibu hendaklah menyusui anak-anaknya selama dua tahun penuh} dua tahun penuh {bagi yang ingin menyempurnakan penyusuan. Kewajiban ayah} kewajiban seorang ayah {menanggung rejeki} menafkahi ibu menyusui yang diceraikan {dan pakaian mereka} pakaian mereka {dengan cara yang patut. Seseorang tidak dibebani, kecuali sesuai dengan kemampuannya} sesuai kemampuannya {Janganlah seorang ibu dibuat menderita karena anaknya} janganlah seorang ibu enggan menyusui anaknya karena dirugikan oleh ayahnya atau memintanimbalan yang lebih banyak darisemestinya {dan jangan pula ayahnya dibuat menderita karena anaknya} dan tidak diperbolehkan juga bagi ayah untuk melarang ibu dari hal tersebut karena dia senang menyusui anaknya {Ahli waris juga seperti itu}. Ahli waris anak itu ketika ayahnya tidak ada memiliki kewajiban sebagaimana ayah anak itu dalam hal memberi nafkah dan pakaian {Apabila keduanya ingin menyapih} menyapih dari susuan sebelum sempurna dua tahun {berdasarkan persetujuan} kesepakatan {dan musyawarah antara keduanya, maka tidak ada dosa} kesalahan {atas keduanya. Apabila kalian ingin menyusukan anak kalian} kalian ingin menyusukan anak kalian kepada orang lain yang menyusui {maka tidak ada dosa bagi kalian, jika kalian memberikan pembayaran dengan cara yang patut} kalian memberi upah orang yang menyusui {Bertakwalah kepada Allah dan ketahuilah bahwa sesungguhnya Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "233. Ini adalah kabar tapi maknanya adalah perintah sebagai suatu penempatan baginya pada suatu kedudukan yang telah diakui dan tetap, yang tidak butuh kepada perintah, yaitu hendaklah (ibu-ibu) “menyusukan anak-anaknya selama 2 tahun.” Dan ketika tahun itu diartikan sebagai setahun yang sempurna atau setahun kurang sedikit, Allah berfirman, “dua tahun penuh yaitu bagi yang ingin menyempurnakan penyusuan.” Apabila seorang bayi telah sempurna 2 tahun menyusu, maka telah selesailah masa penyusunnya dan air susu yang ada setelah itu berfungsi sama dengan segala macam makanan. Karena itu penyusunan yang terjadi setelah 2 tahun itu tidaklah dianggap dan tidak mengharamkan (tidak menjadikan teman sesusuan mahram baginya). Dan dari ayat ini dan firman Allah yang lain dalam Quran Surat Al Ahqaf ayat 15 dapat diambil kesimpulan bahwa masa kehamilan yang paling sedikit adalah 6 bulan dan bahwa mungkin saja dalam tempo secepat itu terlahir seorang bayi. “Dan diwajibkan atas orang yang dilahirkan untuk nya,” yaitu Ayah, “memberi makan dan pakaian kepada para ibu dengan cara Ma'ruf.” Ini mencakup (semua), baik yang masih dalam ikatan pernikahan dengan suaminya maupun yang telah diceraikan; maka seorang ayah wajib memberi makan, yakni memberi nafkah dan pakaian sebagai upah bagi pekerjaan menyusui yang dilakukannya. Ini juga menunjukkan bahwa apabila masih dalam ikatan pernikahan, suami wajib memberi nafkah dan pakaian, sesuai kondisinya. Karena itu Allah berfirman, “seseorang tidak dibebani melainkan menurut kadar kesanggupannya.” Tidaklah seorang yang fakir dibebani untuk memberikan nafkah seperti nafkahnya orang yang kaya, dan tidak pula seorang yang tidak punya apa-apa hingga ia mendapatkannya. “Janganlah seorang ibu menderita kesengsaraan karena anaknya dan seorang ayah karena anaknya.” Maksudnya, tidak halal bagi seorang ibu menderita kesengsaraan karena anaknya, baik dengan melarangnya untuk menyusui anaknya atau tidak diberi hak yang wajib untuknya dari nafkah dan pakaian, atau upah, “dan seorang ayah karena anaknya,” yakni dengan cara ibunya itu tidak mau menyusui anaknya yang dapat menyengsarakan dirinya, atau ibunya meminta bayaran yang lebih besar dari yang seharusnya dan semacamnya. Dan firman Allah, “yang dilahirkan untuk nya (ayah),” menunjukkan bahwa anak itu adalah milik Ayahnya, karena dialah yang diberikan untuknya dan karena anak itu adalah hasil jerih payahnya, oleh karena itu, boleh baginya mengambil harta anaknya itu, baik ridha maupun tidak, berbeda dengan ibu. Dan FirmanNya, “dari waris pun berkewajiban demikian,” maksudnya, orang yang mewarisi anak tersebut apabila tidak ada ayahnya dan anaknya tersebut tidak memiliki harta, maka ia wajib sebagaimana kewajiban Ayah memberi nafkah dan pakaian terhadap wanita yang menyusui. Ini menunjukkan wajibnya memberi nafkah terhadap karib kerabat yang kesusahan oleh karib kerabat pewaris yang berada dalam kelapangan. “Apabila keduanya ingin,” yaitu, kedua orang tua, “menyapih,” maksudnya, berhenti menyusui bayi tersebut sebelum 2 tahun “dengan kerelaan keduanya,” dimana keduanya ridha, “dan permusyawaratan” antara mereka berdua apakah hal itu merupakan kemaslahatan bayi ataukah tidak? Apabila ada maslahat (untuk si bayi) dan mereka berdua rela, “maka tidak ada dosa atas keduanya” untuk penyapihannya yang kurang dari 2 tahun tersebut. Ayat ini menunjukkan bahwa apabila salah seorang dari keduanya rela dan yang lainnya tidak rela atau bukan untuk kemaslahatan bayi itu, maka tidak boleh disapih. Dan FirmanNya, “dan jika kamu ingin anakmu disusukan oleh orang lain,” artinya, kalian mencari wanita yang menyusui selain dari ibunya atas dasar tidak memudaratkan, “maka tidak ada dosa bagimu apabila kamu memberikan pembayaran menurut yang patut,” yaitu, bagi wanita wanita yang menyusui tersebut. Dan ketahuilah “bahwa Allah maha melihat Apa yang kamu kerjakan,” maka Dia akan memberikan balasannya bagi kalian atau semua itu dengan kebaikan dan keburukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { حَوۡلَيۡنِ } Haulain: Dua tahun { وَعَلَى ٱلۡمَوۡلُودِ لَهُۥ } Wa ‘alal mauludi lahu: Bagi seorang bapak (suami, pent). { بِٱلۡمَعۡرُوفِۚ } Bil ma’ruf: Sesuai dengan keadaannya saat sedang lapang atau sempit. { وُسۡعَهَاۚ } Wus’ahâ: Kemampuan dan kesanggupan dirinya. { لَا تُضَآرَّ وَٰلِدَةُۢ بِوَلَدِهَا } Lâ tudhârra wâlidatun biwaladihâ: Janganlah seorang ibu mendapatkan kesengsaraan dengan dilarang untuk menyusui anaknya, atau tidak diberikan upah menyusui apabila ia telah diceraikan, atau ditinggal wafat suaminya. { وَلَا مَوۡلُودٞ لَّهُۥ } Walâ mauludun lahu: Begitu juga seorang bapak tidak boleh disengsarakan dengan cara dipaksa untuk menyusukan anaknya kepada istri yang telah diceraikannya atau dimintai upah yang tidak mampu dibayarnya. { وَعَلَى ٱلۡوَارِثِ } Wa ‘alal wâritsi : Yang mewarisi adalah bayi yang disusui itu sendiri, jika bapaknya memiliki harta dan apabila tidak, maka kewwajiban ahli warisnya untuk menanggung kebutuhannya. { فِصَالًا } Fishâlan: Penyapihan anak sebelum sampai masa dua tahun. Makna ayat: Berkaitan dengan penyebutan hukum-hukum seputar thalaq Allah Ta’ala menyebutkan hukum seputar persusuan, karena terkadang ada perempuan yang diceraikan suaminya dalam keadaan hamil. Allah berfirman,”Para ibu hendaklah menyusukan anak-anaknya selama dua tahun penuh, yaitu bagi yang ingin menyempurnakan penyusuan.” Maknanya bagi istri yang diceraikan tetap menyusui anaknya selama dua tahun sempurna apabila ia dan mantan suaminya sepakat untuk menyempurnakan penyusuannya. Bagi bapak dari bayi tersebut apabila masih ada wajib memberikan nafkah berupa makanan, minuman dan pakaian dengan ma’ruf, sesuai dengan keadaan perekonomian dirinya. Karena Allah tidak membebani seseorang kecuali sesuai dengan kemampuan yang dimilikinya. Kemudian Allah Ta’ala memperingatkan bahwa tidak boleh seorang ibu disengsarakan dengan anaknya karena dilarang untuk menyusui anaknya atau dibuat tidak suka untuk menyusui anaknya sendiri, atau tidak diberikan nafkah untuk menyusui atau dipersulit dalam urusannya. Begitu juga tidak diperkenankan untuk membuat sengsara suami dengan cara memaksanya untuk menyusukan anaknya kepada istri yang telah diceraikannya, dan tidak boleh untuk meminta upah menyusui yang terlalu besar di atas kemampuannya. Bagi ahli waris yaitu anak itu sendiri apabila memiliki harta, jika tidak memiliki harta maka upah penyusuan menjadi tanggung jawab ashobah yaitu keluarga dari pihak lelaki yang paling dekat kemudian terdekat. Apabila bayi tidak memiliki ashobah maka kewajiban bagi ibu untuk menyusuinya secara gratis karena ibu merupakan orang yang paling dekat dengan bayi tersebut. Kemudian Allah Ta’ala menyebutkan dua keringanan dalam masalah penyusuan: 1) Apabila bapak dan ibu menginginkan untuk menyapih anaknya sebelum sempurna dua tahun maka boleh dilakukan setelah musyawarah yang dilakukan, dengan memperkirakan maslahat bagi anak yang disapih itu. Allah Ta’ala berfirman,”Apabila keduanya ingin menyapih (sebelum dua tahun) dengan kerelaan keduanya dan permusyawaratan, maka tidak ada dosa atas keduanya.” 2) Apabila bapak menginginkan agar anaknya disusui oleh perempuan selain ibunya maka diperbolehkan apabila sang ibu merelakannya. Allah Ta’ala berfirman,”Dan jika kamu ingin anakmu disusukan oleh orang lain, maka tidak ada dosa bagimu.” Dengan syarat bahwa ia memberikan upahnya yang telah disepakati dengan ma’ruf tanpa menzhalimi atau menunda-nunda. Terakhir, Allah Ta’ala memberikan nasehat kepada ibu yang menyusui dan bapak untuk bertakwa kepada Allah dalam permasalahan yang telah ditetapkan untuk keduanya, dan memberitahukan bahwa Allah Maha Melihat apa yang mereka perbuat maka hendaklah berhati-hati agar tidak menyelisihi perintah Nya dan melanggar larangan Nya. Maha Suci Allah Tuhan yang Maha Mulia dan Penyayang. Pelajaran dari ayat: • Kewajiban bagi seorang ibu untuk menyusui anaknya pada penyusuan yang pertama “al-Lubbâ” jika ia diceraikan, jika tidak maka kewajiban menyusui seluruh penyusuan. • Penjelasan mengenai batasan yang paling lama untuk menyusui yaitu dua tahun. Oleh karena itu melebihi dua tahun tidak dianggap secara syariat. • Bolehnya mengambil upah untuk menyusui. • Kewajiban nafkah dari saudara untuk saudaranya yang lain dalam kondisi fakir. • Bolehnya seorang bapak menyusukan anaknya kepada wanita selain ibunya sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 233: Allah mengabarkan bahwasannya wajib atas orang tua yang menyusui secara mutlak agar menyusui anaknya secara sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni upah menyusui. Yakni dengan cara yang dianggap baik oleh syara' maupun 'uruf. Ada pula yang mengartikan \"sesuai kesanggupannya\". Misalnya ibu dipaksa menyusukan anaknya tanpa diberi nafkah dan pakaian atau upah. Misalnya dibebani melebihi kesanggupannya. Jika bapak meninggal, maka ahli waris berkewajiban seperti bapak sebelum wafatnya, yaitu memberi makan dan pakaian. Yakni apakah menyapih terdapat maslahat bagi anak atau tidak. Yakni jika bapak mencari wanita lain yang akan menyusukan anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 233",
    "description": "Usai menjelaskan masalah keluarga, berikutnya Allah membicarakan masalah anak yang lahir dari hubungan suami istri. Di sisi lain, dibicarakan pula ihwal wanita yang dicerai dalam kondisi menyusui anaknya. Dan ibu-ibu yang melahirkan anak, baik yang dicerai suaminya maupun tidak, hendaklah menyusui anak-anaknya selama dua tahun penuh sebagai wujud kasih sayang dan tanggung jawab ibu kepada anaknya. Air susu ibu (asi) adalah makanan utama dan terbaik bagi bayi yang tidak bisa digantikan oleh makanan lain. Hal itu dilakukan bagi yang ingin menyusui secara sempurna yaitu dua tahun, seperti dijelaskan dalam surah luqma'n/31: 41. Apabila kurang dari dua tahun, dianjurkan setidaknya jumlah masa menyusui jika digabung dengan masa kehamilan tidak kurang dari tiga puluh bulan sebagaimana ditegaskan dalam surah al-ahqa'f/43:15. Bila masa kehamilan mencapai sembilan bulan maka masa menyusui adalah dua puluh satu bulan. Apabila masa menyusui dua tahun, berarti masa kehamilan paling pendek adalah enam bulan. Dan kewajiban ayah dari bayi yang dilahirkan adalah menanggung nafkah dan pakaian mereka berdua, yaitu anak dan ibu walaupun sang ibu telah dicerai, dengan cara yang patut sesuai kebutuhan ibu dan anak dan mempertimbangkan kemampuan ayah. Seseorang tidak dibebani lebih dari kesanggupannya. Demikianlah prinsip ajaran islam. Karena itu, janganlah seorang ayah mengurangi hak anak dan ibu menyusui dalam pemberian nafkah dan pakaian, dan jangan pula seorang ayah menderita karena ibu menuntut sesuatu melebihi kemampuan sang ayah dengan dalih kebutuhan anaknya yang sedang disusui. Jaminan tersebut harus tetap diperolehnya walaupun ayahnya telah meninggal dunia. Apabila ayah telah meninggal dunia maka ahli waris pun berkewajiban seperti itu pula, yaitu memenuhi kebutuhan ibu dan anak. Apabila keduanya, yaitu ibu dan ayah, ingin menyapih anaknya sebelum usia dua tahun dengan persetujuan bersama, bukan akibat paksaan dari siapa pun, dan melalui permusyawaratan antara keduanya dalam mengambil keputusan yang terbaik, maka tidak ada dosa atas keduanya untuk mengurangi masa penyusuan dua tahun itu. Dan jika kamu ingin menyusukan anakmu kepada orang lain karena ibu tidak bersedia atau berhalangan menyusui, maka tidak ada dosa bagimu memberikan pembayaran kepada wanita lain berupa upah atau hadiah dengan cara yang patut. Bertakwalah kepada Allah dalam segala urusan dan taatilah ketentuan-ketentuan hukum Allah dan ketahuilah bahwa Allah maha melihat apa yang kamu kerjakan dan membalas setiap amal baik maupun buruk yang kamu kerjakan. Perceraian antara suami dan istri hendaknya tidak berdampak pada anak yang masih bayi. Ibu tetap dianjurkan merawatnya dan memberinya asi. Demikian pula ayah wajib memberi nafkah kepada anak dan ibu selama menyusui. Agama sangat memperhatikan kelangsungan hidup anak agar tumbuh menjadi anak yang sehat dan cerdas. Ayat ini menjelaskan idah cerai mati agar tidak ada dugaan bahwa idah cerai mati sama dengan cerai hidup. Dan orang-orang yang mati di antara kamu, yakni para suami, serta meninggalkan istri-istri yang tidak sedang hamil, hendaklah mereka, para istri, menunggu atau beridah selama empat bulan sepuluh hari termasuk malamnya, sebagai ketentuan syarak yang bersifat qadar (pasti). Kemudian apabila telah sampai akhir atau selesai masa idah mereka, yakni para istri yang ditinggal mati suaminya, maka tidak ada dosa bagimu, wahai para wali dan saudara-saudara mereka, yakni tidak menghalangi dan melarang mereka mengenai apa yang mereka lakukan terhadap diri mereka sendiri yang sebelumnya dilarang ketika masih dalam masa idah, menurut cara yang patut dan sesuai dengan agama dan kewajaran, seperti berhias, menerima pinangan, menikah, dan aktivitas lainnya. Dan Allah maha mengetahui apa yang kamu kerjakan, baik yang kamu sembunyikan maupun yang kamu tampakkan."
  }
]