[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang meninggal diantara kalian, sedangkan mereka meninggalkan istri-istri sepeninggal mereka, maka menjadi kewajiban istri-istri tersebut untuk menunggu dengan diri mereka melewati masa indah selama empat bulan sepuluh hari, mereka tidak boleh keluar dari rumah suami, tidak berdandan, dan tidak menikah. Maka apabila masa iddah itu telah berakhir, maka tidak ada dosa atas kalian wahai para wali wanita-wanita itu terkait apa yang mereka perbuat sendiri dari keluar rumah, berdandan, serta menikah dengan cara yang telah ditetapkan dalam syariat Islam. Dan Allah ta'ala Maha Mengetahui perbuatan-perbuatan kalian yang lahir maupun batin, dan akan memberikan balasan kepada kalian sesuai dengan perbuatan-perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "234. Dan orang-orang mati yang meninggalkan istri-istri yang tidak sedang hamil, maka para istri itu wajib menunggu (masa idah) selama 4 bulan 10 hari. Dalam kurun waktu itu ia tidak boleh keluar dari rumah suami, berhias maupun menikah. Apabila masa idah itu sudah habis, maka tidak ada dosa bagimu -wahai para wali- bila para istri itu melakukan apa yang semula dilarang bagi mereka selama masa idah, sepanjang dilakukan secara baik menurut ketentuan syariat dan kebiasaan yang berlaku di masyarakat. Allah Maha mengetahui apa yang kamu perbuat, tidak ada sesuatupun yang luput dari pengetahuan-Nya, baik sisi lahir maupun batin kalian, dan Dia akan memberi balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "234. Dan suami yang wafat meninggalkan istri, maka istri itu wajib menyelesaikan masa iddah hidad selama empat bulan sepuluh hari. Selama masa ini ia tidak boleh menikah, berhias, dan keluar dari rumah suaminya kecuali ada kebutuhan mendesak. Apabila telah habis masa ini maka tidak mengapa baginya untuk kembali beraktifitas sebagaimana biasa sesuai syariat. Dan Allah Maha Mengetahui segala yang kalian perbuat. Syeikh as-Syinqithi berkata: secara zahir ayat ini menjelaskan bahwa semua istri yang ditinggal mati suaminya harus melewati masa iddah selama empat bulan sepuluh hari, namun Allah menjelaskan dalam ayat lain bahwa hal ini berlaku jika istri tidak dalam keadaan hamil, sebab jika ia hamil maka masa iddahnya adalah sampai ia melahirkan, hal ini disebutkan dalam surat at-Talaq: 4, dan ditambah pula dengan penjelasan dari hadits Bukhari dan Muslim, bahwa Nabi mengizinkan Subai’ah al-Aslamiyah untuk menikah setelah melahirkan padahal suaminya baru saja meninggal beberapa hari sebelumnya. Dan pendapat yang benar dalam masalah iddah bagi wanita hamil yang ditinggal mati suaminya adalah sampai ia melahirkan sebagaimana yang disebutkan dalam hadits, bukan seperti pendapat yang mengatakan bahwa masa iddahnya adalah waktu yang paling lama dari dua masa iddah -melahirkan atau empat bulan sepuluh hari-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "234. وَيَذَرُونَ أَزْوٰجًا (meninggalkan isteri-isteri) Yakni mereka mempunyai istri-istri. يَتَرَبَّصْنَ بِأَنفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا ۖ (menangguhkan dirinya (ber’iddah) empat bulan sepuluh hari) Yakni menunggu empat bulan sepuluh hari. Dan hikmah dijadikannya waktu iddah bagi yang wafat suaminya dengan ukuran waktu ini adalah karena janin secara umum bergerak selama empat bulan, dan Allah menambahnya dengan sepuluh hari karena kemungkinan gerakan janin melemah. (dan hikmah lainnya) adalah untuk menghormati pernikahan yang pertama. Adapun penangguhan nikah bagi yang ditinggal wafat suaminya adalah bagi seluruh istri baik itu masih muda atau sudah tua, baik itu yang masih mengalami haidh maupun yang sudah menaopuse, dan waktunya adalah empat bulan sepuluh hari; kecuali yang hamil, maka iddahnya adalah sampai ia melahirkan bayinya. فَإِذَا بَلَغْنَ أَجَلَهُنَّ (Kemudian apabila telah habis ‘iddahnya) Yakni dengan habisnya masa iddah. فَلَا جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِىٓ أَنفُسِهِنَّ (maka tiada dosa bagimu (para wali) membiarkan mereka berbuat terhadap diri mereka) Yakni dengan berhias, menerima pelamar, dan menikah jika ia meinginkan hal itu. بِالْمَعْرُوفِ ۗ (menurut cara yang patut) Yakni yang tidak melanggar syari’at dan adat istiadat yang baik. Dan ayat ini digunakan sebagai dalil atas kewajiban Ihdad bagi wanita yang menjalani iddah wafat. Adapun makna ihdad adalah meninggalkan berhias berupa memakai parfum, memakai pakaian yang indah, dan memakai perhiasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "234. Dan suami-suami yang mati dan meninggalkan istri-istrinya, maka mereka harus menunggu masa iddah selama 4 bulan 10 hari 10 malam. Mereka tidak boleh menikah, berdandan dan tunangan dengan siapapun selama masa ini, karena janin biasanya bergerak sampai akhir bulan keempat, dan ditambah 10 hari untuk mencegah pergerakan janin yang lemah. Dan ketika masa iddah mereka selesai, maka tidak ada dosa bagi kalian untuk berhias, tunangan, dan menikah jika mereka menghendakinya sesuai syariat dan kebiasaan baik menurut orang-orang yang memiliki keluhuran hati.Dan Allah itu mengawasi urusan kalian, tidak ada satupun yang luput dariNya. Ini adalah masa iddah kematian setelah penjelasan masa iddah talak. Pemberian batasan itu adalah kewajiban yang harus dilalui wanita yang ditinggal mati suaminya. Al-Ihdad adalah meninggalkan perhiasan yang bagus, pakaian yang disulam, dan perhiasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mati} orang-orang yang wafat {di antara kalian dan meninggalkan} dan meninggalkan {istri-istri hendaklah mereka (istri-istri) menahan} menunggu {dirinya sampai empat bulan sepuluh hari. Kemudian, apabila telah sampai idah mereka} selesai masa idah mereka {maka tidak ada dosa bagi kalian} maka tidak ada kesalahan bagi kalian wahai para wali {mengenai apa yang mereka lakukan terhadap diri mereka} mengenai apa yang mereka lakukan terkait berhias, menerima pinangan dan hal-hal yang dilarang bagi wanita di masa idah {menurut cara yang patut.} dengan cara yang tidak dilarang syariat {Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "234. Maksudnya, apabila suami meninggal, istrinya harus tetap tinggal dan wajib menunggu selama 4 bulan 10 hari. Hikmahnya adalah untuk membuktikan adanya kehamilan pada masa 4 bulan dan awal-awal bergeraknya (janin) pada bulan yang ke-5. Ayat yang umum ini dikhususkan dengan wanita-wanita yang hamil, karena iddah mereka adalah melahirkan bayinya, demikian juga hamba sahaya wanita, karena iddahnya adalah setengah dari iddah wanita merdeka yaitu 2 bulan 5 hari. FirmanNya, “kemudian apabila telah habis iddahnya,” artinya telah selesai masa iddahnya, “maka tidak dosa bagimu, (para wali) membiarkan mereka berbuat terhadap diri mereka,” artinya, untuk berhias dan memakai wangi-wangian, “menurut yang patut.” Maksudnya, dalam bentuk yang tidak diharamkan dan tidak pula dimakruhkan. Ayat ini menunjukkan kewajiban ihdad (tidak bersolek) dalam masa iddah atas wanita yang ditinggal mati suaminya namun tidak bagi selainnya dari wanita-wanita yang diceraikan dan ditinggalkan (suaminya), dan ini merupakan kesepakatan para ulama. “Allah mengetahui apa yang kamu perbuat,” maksudnya, mengetahui perbuatan-perbuatan kalian secara lahiriyah maupun batiniyahnya, yang tampak maupun yang tersembunyi, maka pasti Allah akan membalasnya. Dan tentang mengarahkan firmanNya kepada para wali dengan FirmanNya, “maka tidak ada dosa bagimu (para wali) membiarkan mereka berbuat terhadap diri mereka,” merupakan dalil bahwa wali itu harus memperhatikan wanita tersebut dan melarangnya dari hal-hal yang tidak boleh dilakukan, dan memaksanya untuk melakukan yang wajib dan bahwasanya ayat ini dihadapkan untuk wali dan menjaditanggung jawabnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يُتَوَفَّوۡنَ } Yutawaffauna: Diwafatkan oleh Allah Ta’ala sesuai dengan umur yang telah ditetapkan. { وَيَذَرُونَ أَزۡوَٰجٗا } Wayadzarûna azwâjan: Meninggalkan istri-istri mereka { يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ } Yatarabbashna bi anfusihinna: Para istri menunggu sampai habis masa ‘iddahnya yaitu selama empat bulan dan sepuluh hari. { فَإِذَا بَلَغۡنَ أَجَلَهُنَّ } Faidzâ balaghna ajalahunna: Sampai pada penghabisan masa ‘iddahnya { فَلَا جُنَاحَ عَلَيۡكُمۡ } Lâ junâha ‘alaikum: Tidak berdosa kalian wahai para wali, atas apa yang mereka lakukan seperti memakai wewangian, berdandan dan mempersiapkan diri untuk menerima pinangan. Makna ayat: Konteks pada dua ayat ini masih membicarakan tentang penjelasan seputar hukum perceraian, iddah dan nafkah. Pada ayat ini (234) menjelaskan bahwa wanita yang ditinggal mati oleh suaminya, haruslah menunggu selama empat bulan sepuluh hari jika dia wanita merdeka, atau setengahnya apabila dia adalah budak. Wanita tersebut tidak diperbolehkan untuk berhias, memakai wewangian dan juga menerima pinangan pada saat itu sampai habis masa ‘iddahnya yang telah tertera dalam ayat di atas. Kecuali apabila dia hamil, maka masa ‘iddahnya sampai melahirkan kandungannya berdasarkan firman Allah dalam surat Ath-Thalaq: “Dan bagi perempuan yang mengandung maka masa ‘iddahnya sampai ia melahirkan kandungannya.” (QS Ath-Thalaq: 4) Apabila telah selesai ‘iddahnya maka tidak berdosa bagi keluarga suaminya atau keluarga istrinya untuk membiarkan apa yang dilakukannya berupa meninggalkan ihdad (berkabung) dan mempersiapkan diri untuk menerima pinangan laki-laki lain, inilah makna firman Allah Ta’ala,”Orang-orang yang meninggal dunia di antaramu dengan meninggalkan istri-istri (hendaklah para istri itu) menangguhkan dirinya (ber’iddah) empat bulan sepuluh hari. Kemudian apabila telah habis masa ‘iddahnya, maka tiada dosa bagimu (para wali) membiarkan mereka berbuat terhadap diri mereka menurut yang patut.” Yaitu menurut apa yang diperbolehkan bagi mereka. Pada akhir ayat, Allah Ta’ala menasehati mereka dengan firmanNya,”Allah mengetahui apa yang kalian perbuat.” Maka berhati-hatilah terhadap perbuatan kalian dengan hanya mengerjakan apa yang diizinkan oleh Allah. Pelajaran dari ayat: • Penjelasan tentang masa ‘iddah bagi wanita yang ditinggal wafat suaminya yaitu selama empat bulan sepuluh hari, dan hadits menunjukkan bahwa masa ‘iddah budak wanita adalah separuhnya. • Kewajiban melakukan ihdad (berkabung) bagi wanita yang ditinggal wafat suaminya, yaitu tidak berdandan dan memakai wewangian serta tidak menerima pinangan dari lelaki lain. Ia menetap di dalam rumah tempat wafat suaminya dan tidak keluar kecuali karena kebutuhan yang mendesak sekali (darurat)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 234: Allah mengabarkan bahwasannya seorang laki-laki jika meninggal dan memiliki istri maka wajib bagi istri-istrinya masa iddah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan tidak keluar dari rumah suaminya, tidak berhias dan tidak menikah. Dalam ayat ini terdapat dalil wajibnya si istri berihdad (berkabung) selama masa 'iddah karena ditinggal wafat suaminya, tidak karena perceraian dan perpisahan lainnya. Keumuman ini ditakhshis dengan hamil, yakni wanita yang ditinggal wafat suaminya, jika ia hamil, maka 'iddahnya sampai melahirkan. Menjalani masa 'iddah selama empat bulan sepuluh hari adalah bagi wanita merdeka, adapun bagi wanita budak, maka 'iddahnya separuhnya, yaitu dua bulan lima hari. Ayat ini menunjukkan bahwa hendaknya wali memperhatikan urusan si wanita, melarangnya dari mengerjakan perbuatan yang dilarang dan menekannya untuk menjalankan perbuatan yang wajib dilakukan serta membiarkan perkara yang dibolehkan oleh syari'at. Berhias, bepergian atau menerima pinangan. Sesuai syari'at; atau tidak haram dan tidak makruh. Dia mengetahui amalan yang kamu kerjakan baik nampak maupun tersembunyi, jelas maupun samar dan Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 234",
    "description": "Ayat ini menjelaskan idah cerai mati agar tidak ada dugaan bahwa idah cerai mati sama dengan cerai hidup. Dan orang-orang yang mati di antara kamu, yakni para suami, serta meninggalkan istri-istri yang tidak sedang hamil, hendaklah mereka, para istri, menunggu atau beridah selama empat bulan sepuluh hari termasuk malamnya, sebagai ketentuan syarak yang bersifat qadar (pasti). Kemudian apabila telah sampai akhir atau selesai masa idah mereka, yakni para istri yang ditinggal mati suaminya, maka tidak ada dosa bagimu, wahai para wali dan saudara-saudara mereka, yakni tidak menghalangi dan melarang mereka mengenai apa yang mereka lakukan terhadap diri mereka sendiri yang sebelumnya dilarang ketika masih dalam masa idah, menurut cara yang patut dan sesuai dengan agama dan kewajaran, seperti berhias, menerima pinangan, menikah, dan aktivitas lainnya. Dan Allah maha mengetahui apa yang kamu kerjakan, baik yang kamu sembunyikan maupun yang kamu tampakkan. Ayat ini menjelaskan apa saja yang boleh dan tidak boleh dilakukan oleh laki-laki terhadap perempuan yang masih dalam masa idah. Dan tidak ada dosa bagimu, wahai kaum laki-laki, meminang perempuanperempuan itu yang masih dalam masa idah, baik idah cerai mati maupun karena ditalak tiga, selain yang ditalak raj'i (satu atau dua), dengan sindiran, seperti ucapan, aku suka dengan perempuan yang lembut dan memiliki sifat keibuan, atau kamu sembunyikan keinginanmu dalam hati untuk melamar dan menikahinya jika sudah habis masa idahnya. Demikian ini karena Allah mengetahui bahwa kamu tidak sabar sebagai lelaki akan menyebut-nyebut keinginanmu untuk melamar dan menikahinya kepada mereka, yakni perempuan-perempuan tersebut setelah habis idahnya. Tetapi janganlah kamu, wahai laki-laki, membuat perjanjian, baik secara langsung maupun tidak langsung namun terkesan memberi harapan untuk menikah dengan mereka, yakni perempuanperempuan yang masih dalam masa idah, secara rahasia, yakni hanya diketahui berdua, kecuali sekadar mengucapkan kata-kata sindiran yang baik. Dan janganlah kamu, wahai para lelaki, menetapkan akad nikah kepada perempuan yang ditinggal mati suaminya atau ditalak tiga sebelum habis masa idahnya, sebab akad nikahmu akan dianggap batal. Ketahuilah bahwa Allah mengetahui apa yang ada dalam hatimu, yakni ketertarikanmu kepada perempuan itu untuk segera menikahinya, maka takutlah kepada-Nya, dari melanggar hukum-hukum-Nya. Dan ketahuilah bahwa Allah maha pengampun atas kesalahan akibat kelemahan dirimu, maha penyantun dengan memberimu kesempatan bertobat."
  }
]