[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada dosa atas diri kalian (wahai kaum laki-laki) terkait apa yang kalian ucapkan berupa isyarat dan mengharapkan perkawinan dengan wanita-wanita yang ditinggal mati oleh suaminya atau wanita-wanita yang ditalak dengan talak bain di tengah masa iddahnya. Dan tidak ada dosa atas kalian jika terkait apa yang kalian sembunyikan dalam hati kalian berupa niat untuk menikahi mereka setelah selesainya masa iddah mereka. Allah mengetahui bahwa sesungguhnya kalian itu akan menyebut-nyebut wanita-wanita yang masih dalam masa iddah mereka dan kalian tidak sanggup bersabar untuk menjaga mulut tentang mereka karena kelemahan jiwa kalian. Oleh karena itu Allah memperbolehkan dari kalian untuk menyebutnya dalam bentuk isyarat kata atau pendaman niat didalam hati. Dan jauhilah tindakan mengeluarkan janji kepada mereka untuk menikahi mereka secara rahasia melalui perzinaan atau kesepakatan menikah ditengah masa iddah, kecuali kalian sekedar mengucapkan perkataan yang terpahami bahwa wanita seperti dia itu diinginkan oleh kaum laki-laki untuk dinikahi, dan janganlah kalian berketetapan hati untuk melangsungkan akad nikah pada masa iddah masih berlangsung hingga massanya itu selesai dengan tuntas. Dan ketahuilah bahwa sesungguhnya Allah mengetahui apa yang ada di hati kalian, maka takutlah kepada Nya dan ketahuilah bahwa sesungguhnya Dia Maha Penyayang terhadap siapa saja yang bertaubat kepada Nya dari dosa-dosanya, juga Maha penyantun kepada hamba-hamba Nya tidak menyegerakan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "235. Dan kalian tidak berdosa menyatakan keinginan kalian dengan kata-kata sindiran untuk meminang wanita yang sedang menjalani masa idah karena kematian suaminya atau ditalak bain (talak tiga). Tetapi kalian tidak boleh menyatakan keinginan kalian itu secara eksplisit (terus terang). Misalnya dengan mengatakan, “Jika masa idahmu habis beritahu aku.” Dan kalian tidak berdosa bila menyembunyikan keinginan kalian untuk menikahi wanita yang menjalani masa idah setelah masa idahnya berakhir. Allah mengetahui bahwa kalian akan menyebut nama wanita-wanita itu karena kuatnya keinginan kalian untuk menikahi mereka. Maka Allah mengizinkan kalian menyatakan keinginan kalian melalui sindiran bukan secara eksplisit. Jangan sekali-kali kalian secara diam-diam berjanji akan menikah sementara wanita tersebut sedang menjalani masa idah, kecuali dengan ucapan yang baik, yaitu melalui sindiran. Dan janganlah kalian memutuskan untuk melaksanakan akad nikah pada masa idah! Dan ketahuilah bahwa Allah mengetahui apa yang kalian sembunyikan di dalam hati, baik yang dihalalkan maupun yang diharamkan bagi kalian. Maka berhati-hatilah, dan jangan melanggar perintah-Nya. Dan ketahuilah bahwa Allah Maha Pengampun bagi hamba-hamba-Nya yang bertaubat, lagi Maha Penyantun, tidak lekas menjatuhkan hukuman kepada orang-orang yang berdosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "235. Hai para lelaki, tidak berdosa bagi kalian jika kalian mengisyaratkan lamaran kepada wanita yang sedang menjalani masa iddah setelah ditinggal mati suaminya atau ditalak tiga oleh suaminya. Dan tidak berdosa bagi kalian jika kalian menyembunyikan keinginan menikah dengan wanita itu jika ia telah selesai melewati masa iddahnya. Allah mengetahui kalian akan menyebut wanita itu dalam diri kalian, namun janganlah kalian janjikan wanita itu secara sembunyi-sembunyi ketika ia menjalani masa iddah, kecuali hanya mengatakan kalimat yang baik saja seperti, “kamu sungguh cantik”, atau “kamu sungguh shalihah”. Dan janganlah kalian membuat akad nikah sebelum masa iddahnya selesai. Ketahuilah bahwa Allah Maha Mengetahui apa yang ada dalam diri kalian, maka takutlah kalian kepada-Nya. Dan ketahuilah Allah Maha Pengampun bagi hamba-hamba-Nya, dan Maha Lembut kepada mereka sehingga tidak segera menyiksa mereka yang bermaksiat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "235. وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِۦ مِنْ خِطْبَةِ النِّسَآءِ (Dan tidak ada dosa bagi kamu meminang wanita-wanita itu dengan sindiran) Yakni wanita yang menjalani iddah wafat atau talak tiga. Dan sindiran adalah kebalikan dari terus terang, yakni dengan cara menyebutkan sesuatu yang mengarah kepada suatu hal tanpa menyebutkan hal itu, misalkan dengan mengucapkan: aku mendatangimu untuk memberi salam untukmu, dan melihat wajahmu. Adapun makna khithbah adalah apa yang dilakukan oleh orang yang meminta pada suatu permintaan, dan memperlemah-lembutkan perkataan dan perbuatan. أَوْ أَكْنَنتُمْ (atau kamu menyembunyikan dalam hatimu) Yakni kalian sembunyikan keinginan untuk menikah setelah selesainya masa iddah. عَلِمَ اللَّـهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ (Allah mengetahui bahwa kamu akan menyebut-nyebut mereka) Yakni Allah mengetahui bahwa kalian tidak dapat bersabar untuk segera mengatakan kepada mereka keinginan kalian untuk menikahi mereka; maka Allah memberi kalian keringanan dengan mengizinkan untuk mengatakan dengan cara sindiran bukan secara terang-terangan kepada mereka yang sedang menjalani masa iddah wafat dan talak tiga. وَلٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا (itu janganlah kamu mengadakan janji kawin dengan mereka secara rahasia) Yakni seorang laki-laki tidak boleh mengatakan kepada yang menjalani iddah ini dengan kalimat ‘menikahlah denganku’, namun harus dengan kalimat sindiran. إِلَّآ أَن تَقُولُوا۟ قَوْلًا مَّعْرُوفًا ۚ (kecuali sekedar mengucapkan (kepada mereka) perkataan yang ma’ruf) Yakni berupa sindiran yang diperbolehkan seperti, kamu sangatlah cantik dan aku sebenarnya ingin menikah. وَلَا تَعْزِمُوا۟ عُقْدَةَ النِّكَاحِ (Dan janganlah kamu berazam (bertetap hati) untuk beraqad nikah) Yakni janganlah kalian melakukan akad nikah حَتَّىٰ يَبْلُغَ الْكِتٰبُ أَجَلَهُۥ ۚ (sebelum habis ‘iddahnya) Ajalnya adalah akhir dari iddahnya. Dan diharamkannya akad nikah saat masa iddah adalah masalah yang telah disepakati, dan wanita tersebut tetap tidak halal bagi yang menikahinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "235. Tidak ada dosa atas kalian dalam menyindir dan mengumumkan untuk meminang wanita-wanita yang ditinggal mati suaminya atau wanita yang ditalak bain. Seperti mengatakan “Sesungguhnya kamu adalah wanita shalih” atau memuji diri sendiri, dan memberi isyarat yang lembut melalui ucapan ataupun perbuatan. Namun hal itu tidak diperbolehkan untuk wanita yang ditalak raj’iy. Tidak dosa pula atas kalian jika menyembunyikan keinginan kalian untuk menikahi mereka. Allah mengetahui bahwa kalian akan mengutarakan maksud untuk meminang mereka pada masa iddah dan tidak bersabar untuk menikahi mereka. Kalian diperbolehkan untuk menyampaikan sindiran bukan pengumuman yang terang-terangan. Dan janganlah kalian memberikan janji untuk menikahi secara rahasia pada masa iddah, seperti berkata “Maukah kamu menikah denganku?” kecuali kalian mengucapkan ucapan yang baik sesuai syariat, yaitu dengan sindiran. Seperti “Sesungguhnya kamu itu cantik” atau “sesungguhnya aku butuh wanita yang shalihah” atau menunjukkan perhatian terhadap kebaikan dan urusannya. Dan janganlah kalian melakukan akad nikah sampai berakhir masa iddahnya. Dan pengharaman akad nikah pada masa iddah itu disepakati sehingga wanita tidak boleh melakukannya. Dan ketahuilah bahwa Allah mengetahui sesuatu dalam diri kalian berupa keinginan, keputusan dan hal lainnya. Maka waspadalah terhadap akibatnya jika kalian memutuskan untuk menikah sebelum berakhirnya masa iddah. Ketahuilah bahwa Allah itu Maha Pengampun terhadap sesuatu yang bergejolak dalam jiwa, Maha Pengasih sehingga tidak mempercepat hukuman, dan Maha Pemaaf atas segala kesalahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa bagi kalian atas kata sindiran} isyarat kalian {untuk meminang perempuan-perempuan} perempuan-perempuan yang sudah selesai masa iddahnya karena ditinggal mati atau ditalak ba’in {atau kalian sembunyikan} kalian rahasiakan {dalam hati. Allah mengetahui bahwa kalian akan menyebut-nyebut mereka. Akan tetapi, janganlah kalian berjanji secara diam-diam untuk mereka} menjumpai mereka secara diam-diam {kecuali sekadar mengucapkan kata-kata yang patut} perkataan yang dipahami sebagai isyarat untuk meminang {Janganlah kalian menetapkan} janganlah menetapkan {akad nikah} akad nikah {sampai masa idah berakhir} sampai masa idah selesai {Ketahuilah bahwa Allah mengetahui apa yang ada dalam hati kalian. Maka takutlah kepadaNya. Ketahuilah bahwa sesunggunya Allah Maha Pengampun lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "235. Ini merupakan hukum bagi wanita-wanita yang sedang dalam masa iddah, baik karena kematian suami atau perceraian talak ke-3 dalam talak hidup, yaitu diharamkan bagi selain suami yang telah mentalak 3, untuk menyatakan secara jelas keinginannya untuk meminangnya, itulah yang dimaksudkan dalam ayat, “Dalam pada itu janganlah kamu mengadakan janji kawin dengan mereka secara rahasia.” Adapun dengan sindiran, Allah telah meniadakan dosa padanya. Perbedaan antara kedua hal itu adalah bahwa pernyataan yang jelas tidaklah mengandung makna kecuali pernikahan, oleh karena itu diharamkan, karena dikhawatirkan wanita itu menjadi ingin cepat dan membuat kebohongan tentang selesainya masa iddahnya karena dorongan ingin menikah. Disini terdapat indikasi tentang dilarangnya sarana-sarana (yang mengantarkan) kepada hal yang diharamkan, dan menunaikan hak untuk suami pertama dengan tidak mengadakan perjanjian dengan selain dirinya selama masa iddahnya. Adapun sindiran memiliki kemungkinan bermakna pernikahan dan selainnya, maka ini boleh dilakukan terhadap wanita yang ditalak 3 tersebut, seperti dia berkata kepada wanita itu, “sesungguhnya saya ini berkeinginan menikah dan saya sangat senang sekali kalau kamu memberi pendapatmu untukku ketika iddah mu telah selesai”, atau semacamnya. Hal ini boleh, karena tidak seperti pernyataan secara tegas yang di dalam dirinya ada dorongan yang kuat dalam hal tersebut. Demikian juga, seseorang boleh menyembunyikan dalam dirinya keinginan menikah dengan seorang wanita yang masih dalam masa iddahnya apabila telah selesai iddahnya. Karena itu Allah berfirman, “atau kamu menyembunyikan (keinginan mengawini mereka) dalam hatimu. Allah mengetahui bahwa kamu akan menyebut-nyebut mereka.” Perincian ini semuanya adalah mengenai hukum-hukum sebelum akad nikah, sedangkan akad nikah, maka tidak boleh dilakukan “sampai habis (masa) iddahnya,” artinya, sempurna masa iddahnya. “Dan ketahuilah Bahwasanya Allah mengetahui apa yang ada dalam hatimu,” maksudnya, dan berniatlah kalian dengan yang baik dan janganlah kalian berniat dengan yang buruk karena takut akan hukumanNya dan mengharap pahalaNya, “dan ketahuilah bahwa Allah maha pengampun” bagi orang-orang yang melakukan dosa-dosa lalu dia bertaubat darinya dan kembali kepada rabb-nya, “lagi maha penyantun,” di mana Allah tidak mempercepat hukuman atas kemaksiatan orang-orang yang bermaksiat, padahal allah mampu melakukannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { وَلَا جُنَاحَ عَلَيۡكُمۡ } Lâ junâha ‘alaikum: Tidak ada dosa bagi kalian wahai lelaki untuk menyampaikan pinangan dengan kiasan, atau secara terang-terangan menyampaikan keinginan dalam diri kalian. { حَتَّىٰ يَبۡلُغَ ٱلۡكِتَٰبُ أَجَلَهُۥ } Hattâ yablughal kitabu ajalahu: Sampai selesai ‘iddahnya. Makna ayat: Ayat yang kedua (235) mengandung pengharaman tentang meminang wanita yang masih dalam masa ‘iddahnya dikarenakan perceraian ataupun meninggal, maka tidak boleh untuk meminangnya, karena terdapat mudharat. Karena pinangan bisa berasal dari laki-laki yang memiliki harta, atau agama yang baik, atau nasab yang bagus sehingga bisa membuat wanita memalsukan masa ‘iddahnya, mengaku sudah selesai padahal belum selesai, atau bisa juga suami kehilangan kesempatan untuk rujuk kepadanya, sehingga itu semua merupakan mudharat yang diharamkan. Awal ayat ini juga mengandung kebolehan untuk menyatakan keinginan untuk meminang dengan cara kiasan, menghindari lafadz terang-terangan yang diharamkan. Allah berfirman,”Tidak ada dosa bagimu” wahai sekalian muslim untuk menggunakan kiasan dalam menyampaikan maksud pinangan kepada wanita yang sedang dalam masa iddah, seperti dengan ucapan: “Sesungguhnya aku berkeinginan untuk menikah”, “Jika telah selesai masa ‘iddahmu maka kabarkanlah kepadaku, jika kamu ingin menikah.” Begitu juga ayat ini menyingkap tabiat dasar lelaki dalam firman Nya,”Allah mengetahui bahwa kalian akan menyebut-nyebut mereka.” Menampakkan keinginan untuk menikahi mereka. Oleh karena itu Allah memberikan keringanan untuk menyampaikan secara kiasan tanpa terang-terangan. Firman Allah,”Akan tetapi janganlah kalian membuat janji untuk mengawininya secara rahasia” ayat ini menunjukkan keharaman untuk meminang wanita yang masih dalam masa ‘iddah, baik karena ditinggal wafat suaminya atau karena thalaq bain (thalaq tiga yang sudah tidak bisa kembali ke suaminya lagi kecuali setelah menikah dengan lelaki lain,pent). Sedangkan dalam thalaq raj’i (thalaq satu dan dua) haram untuk meminang wanita dalam masa ‘iddahnya baik secara kiasan ataupun terang-terangan, karena wanita tersebut masih dalam hak suaminya. Firman Allah,”Kecuali sekedar mengucapkan (kepada mereka) perkataan yang ma’ruf,” merupakan izin bolehnya mengungkapan pinangan dengan kiasan. Ayat ini mengandung pengharaman melaksanakan akad nikah dengan wanita yang masih dalam masa ‘iddahnya sampai ia selesai, karena Allah Ta’ala berfirman,”Dan janganlah kamu berazam (menetapkan hati) untuk beraqad nikah, sebelum habis ‘iddahnya.” Yang dimaksud dengan kitab adalah jangka waktu yang ditetapkan oleh Allah bagi wanita untuk menyelesaikan masa ‘iddahnya. Kemudian ayat ini ditutup dengan nasehat Allah Ta’ala terhadap orang-orang mukmin dengan memerintahkan mereka untuk mengetahui bahwa Allah Maha mengetahui apa yang ada dalam diri mereka, dan tidak ada satupun amalan maupun perbuatan yang tersembunyi dariNya. Maka berhati-hatilah dengan tidak menyelisihi perintahNya dan melanggar larangan Nya. Lantas Allah Ta’ala memberitahukan kepada mereka bahwa Dia Maha Pengampun bagi orang-orang yang mau bertaubat setelah berdosa, Allah Maha belas kasih kepada mereka, tidak segera menurunkan hukumanNya agar hamba-hambaNya dapat bertaubat. Pelajaran dari ayat: • Keharaman meminang wanita yang masih dalam masa ‘iddah, dan kebolehan untuk menyampaikannya secara kiasan tanpa menggunakan lafadz terang-terangan. • Keharaman melakukan akad nikah dengan wanita yang masih dalam masa ‘iddahnya sampai ia menyelesaikannya, ini lebih utama tentunya karena untuk meminangnya saja diharamkan. Apabila ada yang menikahi wanita yang masih dalam iddah maka dipisahkan keduanya, dan tidak halal wanita itu untuk dinikahi setelah diberi putusan untuk berpisah. • Kewajiban untuk merasa diawasi oleh Allah Ta’ala dalam keadaan ramai ataupun sunyi dan menjauhi sebab-sebab yang dapat menjerumuskan terhadap perbuatan yang diharamkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 235: Allah mengabarkan bahwasannya tidak ada dosa bagi kalian menampakkan lamaran kepada perempuan dengan jalan isyarat tanpa ketegasan sebelum berakhir masa iddah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang suaminya telah meninggal dan masih dalam 'iddah. Wanita yang boleh dipinang secara sindiran ialah wanita yang dalam 'iddah karena meninggal suaminya, atau karena talak bain. Sedangkan wanita yang dalam masa 'iddah talak raj'i tidak boleh dipinang walaupun dengan sindiran. Contoh sindiran adalah mengatakan kepada wanita tersebut, \"Kamu sungguh cantik\", \"Banyak orang yang berminat denganmu\", dsb. Perbedaan secara tegas dengan sindiran adalah bahwa secara tegas (tashrih) tidak ada kemungkinan yang lain isinya selain menikah, sedangkan sindiran mengandung banyak kemungkinan. Yakni tidak sabar untuk diam tidak menyebut-nyebut mereka. Oleh karena itu, Dia membolehkan kamu menyebut mereka secara sindiran atau menyembunyikan di hati keinginan menikahi mereka. Di masa 'iddah. Perkataan sindiran yang baik, yang daripadanya dapat dipahami keinginan untuk menikah. Oleh karena itu, niatkanlah yang baik dan jangan meniatkan hal yang buruk seperti berazam untuk mengadakan akad nikah di masa 'iddah dan lainnya. Bagi orang yang terjatuh ke dalam dosa lalu bertobat dan kembali kepada Allah.. Yakni tidak segera memberikan hukuman, padahal Dia mampu memberikan hukuman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 235",
    "description": "Ayat ini menjelaskan apa saja yang boleh dan tidak boleh dilakukan oleh laki-laki terhadap perempuan yang masih dalam masa idah. Dan tidak ada dosa bagimu, wahai kaum laki-laki, meminang perempuanperempuan itu yang masih dalam masa idah, baik idah cerai mati maupun karena ditalak tiga, selain yang ditalak raj'i (satu atau dua), dengan sindiran, seperti ucapan, aku suka dengan perempuan yang lembut dan memiliki sifat keibuan, atau kamu sembunyikan keinginanmu dalam hati untuk melamar dan menikahinya jika sudah habis masa idahnya. Demikian ini karena Allah mengetahui bahwa kamu tidak sabar sebagai lelaki akan menyebut-nyebut keinginanmu untuk melamar dan menikahinya kepada mereka, yakni perempuan-perempuan tersebut setelah habis idahnya. Tetapi janganlah kamu, wahai laki-laki, membuat perjanjian, baik secara langsung maupun tidak langsung namun terkesan memberi harapan untuk menikah dengan mereka, yakni perempuanperempuan yang masih dalam masa idah, secara rahasia, yakni hanya diketahui berdua, kecuali sekadar mengucapkan kata-kata sindiran yang baik. Dan janganlah kamu, wahai para lelaki, menetapkan akad nikah kepada perempuan yang ditinggal mati suaminya atau ditalak tiga sebelum habis masa idahnya, sebab akad nikahmu akan dianggap batal. Ketahuilah bahwa Allah mengetahui apa yang ada dalam hatimu, yakni ketertarikanmu kepada perempuan itu untuk segera menikahinya, maka takutlah kepada-Nya, dari melanggar hukum-hukum-Nya. Dan ketahuilah bahwa Allah maha pengampun atas kesalahan akibat kelemahan dirimu, maha penyantun dengan memberimu kesempatan bertobatpada ayat berikut Allah menjelaskan hukum terkait perceraian antara suami dan istri yang belum dicampuri dan belum ditetapkan maskawinnya. Tidak ada dosa atau tidak apa-apa bagimu, wahai para suami, jika kamu menceraikan istri-istri kamu yang belum kamu sentuh, yakni belum kamu campuri, atau belum kamu tentukan maharnya, untuk tidak memberikan maharnya. Dan hendaklah kamu beri mereka mut'ah, yaitu sesuatu yang diberikan sebagai penghibur kepada istri yang diceraikan, selain nafkah. Bagi yang mampu dianjurkan memberi mut'ah menurut kemampuannya dan bagi yang tidak mampu tetap dituntut untuk memberi mut'ah menurut kesanggupannya, yaitu pemberian dengan cara yang patut dan tidak menyakiti hatinya atau menyinggung perasaannya. Yang demikian itu merupakan kewajiban bagi orang-orang yang senantiasa berbuat kebaikan yang dibuktikan dengan selalu siap berkorban."
  }
]