[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada dosa atas kalian wahai (para suami) jika kalian menceraikan istri-istri kalian setelah akad nikah dan sebelum mencampuri mereka, atau kalian telah menentukan mahar bagi mereka. dan senangkanlah perasaan mereka dengan suatu pemberian yang dapat memberi mereka manfaat sebagai penenang bagi perasaan mereka, dan penenang kegalauan akibat perceraian, dan penghilang dendam dan kedengkian. Pemberian itu wajib diserahkan sesuai dengan keadaan kemampuan finansial lelaki yang menceraikan. Orang yang kaya menyerahkan sesuai dengan ukuran kelebihan rizkinya, dan lelaki yang kurang mampu sesuai dengan apa yang dimilikinya. yaitu suatu pemberian yang sepatutnya menurut syariat. dan itu adalah hak yang sudah tetap yang menjadi kewajiban orang-orang yang berbuat kebajikan kepada istri istri yang diceraikan dan kepada diri mereka sendiri atas dasar ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "236. Kalian tidak berdosa jika menceraikan istri-istri yang sudah dinikahi sebelum kalian menggauli mereka dan sebelum kalian menetapkan mahar tertentu bagi mereka. Apabila kalian menceraikan mereka dalam keadaan seperti ini, maka kalian tidak wajib membayar mahar kepada mereka. Tetapi kalian harus memberi sesuatu untuk menyenangkan hati mereka dan mengobati kekecewaan mereka, menurut kadar kemampuan kalian, baik kaya maupun miskin. Dan pemberian ini adalah kewajiban yang harus ditunaikan oleh orang-orang yang berbudi baik dalam tindakan dan muamalahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "236. tidak ada dosa bagi kalian jika kalian mencerai istri-istri kalian sebelum berjima’ dengannya, dan sebelum kalian menetapkan nilai mahar bagi mereka. -jika kalian melakukan ini- maka berilah mereka hadiah atau harta sesuai dengan kemampuan kalian sebagai bentuk kebaikan kalian kepada mereka secara syar’i. dan ini merupakan kewajiban yang ditetapkan bagi orang yang hendak memperlakukan dengan baik istri yang dicerainya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "236. لَّا جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ النِّسَآءَ (Tidak ada kewajiban membayar (mahar) atas kamu, jika kamu menceraikan isteri-isteri kamu) Yakni tidak menjadi tanggungjawabmu berupa dosa, mahar, atau yang lainnya jika kalian mentalak istri-istri kalian pada keadaan ini. مَا لَمْ تَمَسُّوهُنَّ (sebelum kamu bercampur dengan mereka) Yaitu ketika kalian mentalak istri-istri kalian yang belum kalian campuri dengan berjima’ أَوْ تَفْرِضُوا۟ (dan sebelum kamu menentukan maharnya) Atau yang belum kalian sebutkan maharnya. Dan bila telah kalian campuri maka wajib atas kalian membayar mahar yang telah disebutkan (jika telah disebutkan), atau mahar yang sesuai mahar kerabat istri (jika belum ditentukan maharnya. وَمَتِّعُوهُنَّ (Dan hendaklah kamu berikan suatu mut’ah (pemberian) kepada mereka) Yakni berilah mereka sesuatu sebagai hadiah bagi mereka berupa pakaian, emas, atau lainnya agar menjadi ganti bagi mereka karena tidak mendapatkan mahar. عَلَى الْمُوسِعِ قَدَرُهُۥ وَعَلَى الْمُقْتِرِ قَدَرُهُۥ (Orang yang mampu menurut kemampuannya dan orang yang miskin menurut kemampuannya (pula) ) Dan hal ini diukur dengan kemampuan suami, sehingga mut’ah (hadiah) orang kaya berbeda dengan mut’ah orang miskin. بِالْمَعْرُوفِ ۖ (dengan cara yang baik) Yakni sesuatu yang diketahui itu baik, baik itu secara syari’at atau adat yang sesuai dengan syari’at. حَقًّا عَلَى الْمُحْسِنِينَ. (Yang demikian itu merupakan ketentuan bagi orang-orang yang berbuat kebajikan) Yakni kewajiban atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "236. Tiada dosa dan kewajiban untuk membayar mahal mitsli jika kalian menalak wanita sebelum menggauli mereka dan sebelum memberi mahar musamma. Namun pelunasan mahar musamma atau mahar mitsli itu harus dilunasi jika sudah berjima’. Dan kewajiban yang harus dilakukan jika belum memberi mahar musamma dan berjima’ adalah memberi mut’ah bagi wanita yang ditalak, yaitu hadiah, pakaian atau harta benda sebagai ganti mahar. Dan takaran mut’ah itu sesuai keadaan suami baik dalam keadaan mudah ataupun susah. Maka wajib bagi orang kaya yang sejahtera itu memberi sesuai kemampuannya. Dan bagi yang fakir itu sesuai keadaannya, yaitu hadiah yang ma’ruf, yaitu sesuatu yang sesuai syariat, adat, dan kesepakatan. Hadiah itu wajib bagi orang-orang yang memperbaiki hubungan dengan wanita-wanita yang ditalak, takut kepada Allah, dan khawatir melakukan kezaliman.Ayat ini turun untuk seorang laki-laki dari kaum Anshar yang menikah dengan seorang wanita, dan belum melunasi maharnya, lalu menalaknya sebelum menyentuhnya. Lalu Rasulullah SAW bersabda kepadanya: “Berilah dia hadiah meskipun dengan kopyahmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada dosa bagi kalian jika kalian menceraikan istri-istri kalian yang belum kalian sentuh} campuri {atau belum kamu tentukan} tentukan {maharnya} mahar {Berilah mereka mut‘ah,} berilah mereka sesuatu yang membuat mereka nyaman dari harta kalian {bagi yang kaya} kaya {sesuai dengan kemampuannya} sesuai kedudukan dan kemampuannya {dan bagi yang miskin} fakir {sesuai dengan kemampuannya pula, sebagai pemberian dengan cara yang patut dan ketentuan bagi orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "236. Maksudnya, tidak ada bagi kalian wahai para suami dosa dan kesalahan dengan menceraikan istri istri kalian sebelum bercampur dengan mereka dan sebelum menentukan mahar, walaupun hal itu merupakan kesedihan baginya, namun dirinya akan terhibur dengan adanya pemberian (mut’ah), maka kalian wajib memberikan mut’ah kepada mereka, yaitu dengan memberikan kepada mereka sesuatu dari harta untuk menguatkan perasaan perasaan mereka. “Orang yang mampu menurut kemampuannya dan orang yang miskin,” yaitu, orang yang sedang susah, “menurut kemampuannya (pula).” Ini dikembalikan kepada adat istiadat dan berbeda sesuai menurut perbedaan waktu dan kondisinya. Karena itu Allah berfirman, “yaitu pemberian menurut yang patut.” Maka ini adalah hak yang wajib “bagi orang-orang yang berbuat kebajikan.” Mereka tidak boleh berlaku pelit terhadap mereka, maka sebagaimana mereka telah mengakibatkan kerinduan dan keinginan wanita-wanita tersebut dan keterikatan hati mereka, kemudian mereka tidak memberikan kepada mereka apa yang mereka inginkan, maka wajiblah atas mereka yang mentalak untuk memberikan sesuatu sebagai imbalan atas hal tersebut. Demi Allah, alangkah indahnya ketetapan Ilahi ini dan yang paling tepat menunjukkan akan hikmah pembuatannya dan rahmatNya, dan siapakah yang paling baik ketetapannya daripada Allah bagi orang-orang yang yakin? Ini adalah hukum bagi wanita wanita yang ditalak sebelum digauli dan sebelum menentukan mahar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { جُنَاحَ } Junâh : Dosa yang diakibatkan oleh perbuatan maksiat { مَا لَمۡ تَمَسُّوهُنَّ } Mâ lam tamassuhunna: Sebelum kalian menggauli (jimak) mereka { أَوۡ تَفۡرِضُواْ } Au Ta’ridhu: Kalian menetapkan mahar untuk mereka { ٱلۡمُوسِعِ قَدَرُهُۥ } Almusi’i qadaruhu: Orang yang memiliki keluasan dalam harta. Arti Qadaruhu: Apa yang dia bisa dan mampu { ٱلۡمُقۡتِرِ } Almuqtir: Orang yang susah kehidupannya (miskin) Makna ayat: Masih melanjutkan pembahasan mengenai hukum seputar thalaq dan yang berkaitan dengannya. Pada ayat ini (236) Allah Ta’ala mengabarkan hamba-hambaNya yang mukmin bahwasanya tidak ada dosa bagi mereka apabila mereka menceraikan istri-istri mereka sebelum menggaulinya, dan sebelum menyebutkan jumlah mahar untuk mereka. Dalam dua keadaan ini wajib bagi laki-laki untuk memberikan mut’ah kepada istri yang diceraikan sebelum digauli dan kepada istri yang belum diberikan mahar atau belum disebutkan maharnya. Dalam kondisi ini dapat diketahui jumlah maharnya dan terkadang jarang terjadi. Wajib bagi suami yang menceraikan untuk mengobati luka hati wanita yang diceraikan dengan memberikan kepadanya harta sesuai dengan kemampuannya (kaya dan miskinnya) agar wanita bisa memanfaatkan harta tersebut sebagai ganti hari-hari pernikahan yang terlewat. Allah Ta’ala berfirman: “Tidak ada kewajiban membayar (mahar) atas kamu, jika kamu menceraikan istri-istrimu sebelum kamu bercampur dengan mereka dan sebelum kamu menentukan maharnya. Dan hendaklah kamu berikan suatu mut’ah (pemberian) kepada mereka. Oarna yang mampu menurut kemampuannya dan orang yang miskin menurut kemampuannya (pula), yaitu pemberian menurut yang patut. Yang demikian itu merupakan ketentuan bagi orang-orang yang berbuat kebajikan.” Pelajaran dari ayat: • Penjelasan mengenai hukum wanita yang diceraikan sebelum digauli dan sebelum penetapan mahar. Maka bagi wanita untuk mendapatkan mut’ah saja sesuai dengan keadaan suami yang menceraikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 236: Ketahuilah wahai laki-laki tidak ada dosa atas kalian mentalak istri-istri kalian setelah akad nikah dengan mereka dan sebelum bercampur dengan mereka serta tiada batasan mahar yang akan diterima mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berjima'. Untuk menghibur istri yang dicerai tersebut dan menghilangkan rasa benci. Subhaanallah, alangkah tepat hukum-Nya, dan siapakah yang lebih baik hukumnya daripada Allah bagi orang yang yakin. Baik berbuat kepada wanita yang dicerai maupun kepada diri mereka sendiri dengan mentaati Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 236",
    "description": "Pada ayat berikut Allah menjelaskan hukum terkait perceraian antara suami dan istri yang belum dicampuri dan belum ditetapkan maskawinnya. Tidak ada dosa atau tidak apa-apa bagimu, wahai para suami, jika kamu menceraikan istri-istri kamu yang belum kamu sentuh, yakni belum kamu campuri, atau belum kamu tentukan maharnya, untuk tidak memberikan maharnya. Dan hendaklah kamu beri mereka mut'ah, yaitu sesuatu yang diberikan sebagai penghibur kepada istri yang diceraikan, selain nafkah. Bagi yang mampu dianjurkan memberi mut'ah menurut kemampuannya dan bagi yang tidak mampu tetap dituntut untuk memberi mut'ah menurut kesanggupannya, yaitu pemberian dengan cara yang patut dan tidak menyakiti hatinya atau menyinggung perasaannya. Yang demikian itu merupakan kewajiban bagi orang-orang yang senantiasa berbuat kebaikan yang dibuktikan dengan selalu siap berkorban. Pada ayat berikut Allah menjelaskan hukum terkait perceraian antara suami dan istri yang belum dicampuri namun sudah ditetapkan maskawinnya. Dan jika kamu, wahai para suami, menceraikan mereka, yakni para istri, sebelum kamu sentuh atau campuri, padahal kamu sudah menentukan maharnya, maka bayarlah seperdua dari mahar yang telah kamu tentukan, kecuali jika mereka, yaitu para suami, membebaskan dirinya sendiri dengan membayar penuh mahar tersebut atau suami tersebut dibebaskan oleh orang yang akad nikah ada di tangannya yakni wali istri, dengan cara membebaskan suami tersebut dari kewajiban membayar setengah dari mahar yang telah ditentukan. Jika demikian maka pembebasan itu, baik dari pihak suami maupun dari pihak wali, adalah lebih dekat kepada takwa. Artinya, hal itu lebih layak dilakukan oleh mereka yang termasuk golongan orang bertakwa. Dan janganlah kamu, wahai para suami dan wali, lupa atau melupakan kebaikan di antara kamu, yakni dengan membebaskan kewajiban orang lain atas dirinya atau memberikan haknya untuk orang lain. Sungguh, Allah maha melihat apa yang kamu kerjakan, yakni memberi sesuatu de-ngan yang lebih baik kepada orang lain. Inilah sikap ihsa'n yang dicintai Allah. Ihsa'n inilah sikap tertinggi dari keberagamaan seseorang, yakni memberikan lebih dari yang seharusnya dan mengambil haknya lebih sedikit dari yang semestinya."
  }
]