[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian menceraikan wanita-wanita setelah melangsungkan akad dengan mereka, dan kalian belum mencampuri mereka, akan tetapi kalian telah menetapkan diri kalian untuk memberikan mahar tertentu bagi mereka, maka menjadi kewajiban kalian untuk menyerahkan separuh dari mahar yang telah disepakati, kecuali wanita itu merelakannya lalu tidak mengambil separuh bagian yang menjadi hak mereka. Atau pihak suami berlapang dada membiarkan mahar seutuhnya bagi istri yang ditalaknya itu. Dan kerelaan kalian itulah wahai para lelaki dan wanita, lebih dekat kepada rasa takut kepada Allah dan ketaatan kepada Nya. dan janganlah kalian (wahai sekalian manusia) melupakan keutamaan dan kebajikan antara kalian, dan hal itu adalah pemberian sesuatu yang tidak wajib atas diri kalian, dan bertoleransi dalam hak-hak. Sesungguhnya Allah mengetahui apa yang kalian perbuat, Dia mendorong kalian berbuat kebajikan dan menyuruh kalian untuk berbuat hal-hal yang utama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "237. Apabila kalian menceraikan para istri kalian setelah melaksanakan akad nikah sebelum menggauli mereka sedangkan kalian telah menetapkan mahar tertentu untuk mereka, maka kalian wajib membayar setengah dari mahar yang telah ditentukan tersebut kepada mereka. Kecuali apabila mereka merelakannya untuk kalian (jika mereka sudah dewasa), atau apabila para suami itu sendiri membayar penuh mahar tersebut kepada mereka. Tindakan saling merelakan hak-hak yang ada di antara kalian itu lebih dekat kepada ketakwaan dan ketaatan pada Allah. Dan janganlah kalian -wahai manusia- meninggalkan kebiasaan saling memberi di antara kalian dan saling merelakan hak-hak yang ada. Karena sesungguhnya Allah mengetahui apa yang kalian perbuat. Maka bersungguh-sungguhlah dalam berbagi kebaikan agar kalian mendapatkan ganjaran dari Allah atas hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "237. Dan jika kalian mencerai istri-istri kalian ketika kalian belum berjima dengan mereka, sedangkan kalian telah menetapkan nilai mahar bagi mereka, maka wajib bagi kalian untuk membayarkan setengah dari nilai mahar yang kalian tetapkan; kecuali jika istri yang kalian cerai merelakan seluruh atau setengah dari mahar yang kalian tetapkan, atau suami yang merelakan bagi istri yang dicerainya itu untuk mengambil seluruh nilai mahar yang dia tetapkan, atau wali dari wanita ini merelakan untuk tidak mengambil mahar itu. Dan hendaklah kalian saling merelakan -baik itu suami atau istri-, sebab itu lebih dekat kepada ketakwaan; dan janganlah kalian melupakan kebaikan diantara kalian, sungguh Allah Maha Mengetahui segala yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "237. وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ (Jika kamu menceraikan isteri-isterimu sebelum kamu bercampur dengan mereka) Yakni sebelum berjima’ dengan mereka. فَنِصْفُ مَا فَرَضْتُمْ (maka bayarlah seperdua dari mahar yang telah kamu tentukan itu) Yakni yang wajib atas kalian adalah setengah dari mahar yang kalian tertukan. إِلَّآ أَن يَعْفُونَ (kecuali jika isteri-isterimu itu memaafkan) Yakni istri-istri yang telah kalian ceraikan. Yakni apabila mereka merelakan setengah mahar yang diwajibkan Allah atas kalian maka tidak mengapa kalian tidak memberi mereka. أَوْ يَعْفُوَا۟ الَّذِى بِيَدِهِۦ عُقْدَةُ النِّكَاحِ ۚ (atau dimaafkan oleh orang yang memegang ikatan nikah) Yakni atau suami merelakan untuk memberi mereka mahar penuh, atau tidak meminta kembali mahar yang telah diserahkan. وَأَن تَعْفُوٓا۟ أَقْرَبُ لِلتَّقْوَىٰ ۚ (dan pemaafan kamu itu lebih dekat kepada takwa) Dan kalimat ini ditujukan bagi suami dan istri, sebagai anjuran kepada keduanya agar merelakan untuk pasangannya; oleh sebab itu berangsiapa yang merelakan setengah mahar maka ia lebih dekat kepada ketakwaan. وَلَا تَنسَوُا۟ الْفَضْلَ بَيْنَكُمْ (Dan janganlah kamu melupakan keutamaan di antara kamu) Yakni agar keduanya tidak lupa terhadap keutamaan yang telah diberikan masing-masing supaya hal itu menjadi penyambung atas apa yang terjadi pada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "237. Dan jika kalian menalak wanita sebelum menggauli mereka, sedangkan kalian telah menentukan takaran mahar bagi mereka, maka wajib bagi kalian untuk membayar setengah mahar musamma, kecuali wanita yang ditalak itu memberi maaf dan menyerahkan seluruh atau separuh maharnya, atau suaminya memaafkan dan memberinya seluruh maharnya, atau mendapatkan sesuatu setelah talak. Dan pemberian maaf dari laki-laki atau wanita itu lebih disukai Allah SWT. Dan janganlah lupa untuk saling berbuat baik satu sama lain dengan memaklumi sebagian hak-haknya bagi pihak lainnya. Sesungguhnya Allah itu mengawasi perbuatan kalian dan akan membalas kalian atas amal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menceraikan mereka sebelum kalian menyentuhnya, sedangkan kalian sudah menentukan} menentukan {maharnya} mahar {maka (bayarlah) separuh dari apa yang telah kalian tentukan, kecuali jika mereka memaafkan} mereka membiarkan separuh mahar yang menjadi hak mereka dari ssuami{atau pihak yang memiliki kewenangan nikah.} suami membiarkan separuh maharnya yang seharusnya dia berikan secara penuh {Pembebasan untuk kalian itu lebih dekat pada ketakwaan. Janganlah melupakan kebaikan} janganlah kalian mengabaikan kebaikan {di antara kalian. Sesungguhnya Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "237. Maksudnya, apabila kalian mentalak istri sekalian sebelum bercampur dan setelah menentukan maharnya, maka wanita wanita yang diceraikan itu memiliki hak dari mahar yang telah ditentukan tersebut setengahnya dan bagi kalian setengahnya lagi. Inilah yang wajib selama tidak ada kata maaf maupun kelapangan dada, di mana wanita itu memaafkan (haknya yang) setengah tersebut untuk diberikan kembali kepada suaminya tersebut apabila maafya itu sah adanya, “atau dimaafkan oleh orang yang memegang ikatan nikah,” yaitu suami menurut pendapat yang paling benar, karena di tangannyalah tergantung keputusan melepas ikatan nikah itu, dan juga karena wali tidak sah memaafkan apa yang wajib untuk wanita, karena posisinya bukan orang yang berhak untuk itu dan tidak pula wakil dalam hal itu. Pendapat lain berkata bahwa yang memegang ikatan nikah itu adalah ayah, dan itulah yang ditunjukkan oleh lafadz ayat yang mulia ini. Kemudian Allah menganjurkan untuk memaafkan dan bahwasanya tindakan memaafkan itu lebih dekat kepada ketakwaan kepadaNya, karena hal itu adalah kebajikan yang mengakibatkan kelapangan dada. Dan juga karena manusia itu tidaklah sepatutnya melalaikan dirinya untuk berbuat kebaikan dan hal yang layak, lalu merupakan keutamaan yang merupakan setinggi-tingginya derajat pergaulan. Karena bergaul dengan manusia itu ada dua tingkatan; pertama, keadilan dan kejujuran yang wajib, yaitu mengambil yang wajib dan memberikan yang wajib, dan kedua, keutamaan dan kebajikan, yaitu memberikan sesuatu yang lebih dari yang wajib dan toleransi dalam meminta hak, serta mengendalikan apa yang ada dalam nafsu pribadi. Maka seyogyanya manusia tidak merupakan tingkatan yang satu ini walaupun hanya pada beberapa kesempatan saja, khususnya bagi orang yang di antara anda dan dirinya ada sebuah pergaulan atau hubungan. Karena Allah akan memberikan ganjaran terhadap orang-orang yang berbuat baik dengan keutamaan dan kemuliaan. Allah berfirman, “Sesungguhnya Allah maha melihat segala apa yang kamu kerjakan.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلَّذِي بِيَدِهِۦ عُقۡدَةُ ٱلنِّكَاحِۚ } Aladzî biyadihî ‘uqdatunnikâh: Yaitu suami { وَلَا تَنسَوُاْ ٱلۡفَضۡلَ بَيۡنَكُمۡۚ } Walâ tansawul fadhla bainakum: Rasa cinta dan perbuatan baik Makna ayat: Pada ayat kedua (237) Allah Ta’ala mengabarkan bahwa seseorang yang menceraikan istrinya sebelum menggaulinya dan telah menentukan mahar untuknya, baik sedikit maupun banyak maka baginya untuk memberikan setengah mahar kepada istrinya tersebut, kecuali apabila wanita memaafkan dan tidak mengambil bagiannya sebagai bentuk penghormatan, atau laki-laki memaafkan sebagai penghormatan kepada wanita dengan menyerahkan seluruh maharnya kepadanya. Allah ‘Azza wa Jalla berfirman: “Jika kamu menceraikan istri-istrimu sebelum kamu bercampur dengan mereka padahal sesungguhnya kamu sudah menentukan maharnya, maka bayarlah separuh dari mahar yang telah kamu tentukan itu.” Yang wajib adalah memberikan setengah dari mahar yang telah ditentukan kecuali jika istri memaafkan atau pihak yang memiliki akad yaitu suami juga memaafkan. Kemudian setelah penetapan hukum yang adil dan penuh kasih sayang ini, Allah Ta’ala menyeru kedua belah pihak untuk memaafkan, dan barangsiapa yang memaafkan di antara keduanya maka lebih dekat kepada ketakwaan, Allah berfirman:”Dan pemaafan kamu itu lebih dekat kepada takwa.” Dan Allah melarang mereka untuk tidak melupakan rasa cinta dan kebaikan antara keduanya dalam firman Nya:”Dan janganlah kalian melupakan keutamaan di antara kamu. Sesungguhnya Allah Maha melihat segala apa yang kamu kerjakan.” Pelajaran dari ayat: • Penjelasan hukum wanita yang diceraikan sebelum digauli oleh suaminya namun telah ditetapkan maharnya, maka bagi wanita berhak mendapatkan setengah wajib, kecuali jika ia urung dengan kerelaannya, maka dia erhak melakukan hal itu, bugitu juga bagi suami yang menceraikan urung memberikan setengah dan memberinya seluruh mas kawin yang telah disebutkan jumlahnya, dan ia berhak melakukan itu. • Ajakan untuk melanggengkan rasa cinta, keutamaan dan kebaikan antara dua keluarga yaitu keluarga pihak perempuan dan keluarga pihak laki-laki. Agar jangan sampai perceraian menjadi sebab dalam permusuhan dan perpecahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 237: Ketahuilah bahwasannya kalian jika mentalak istri-istri kalian sebelum menijma’ nya maka wajib bagi kalian memberi mahar yang ditentukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya istri yang ditalak membebaskan, yaitu dengan membebaskan suami membayar separuh mahar yang sebelumnya berhak dimiliki mereka. Ialah suami atau wali. Jika wali membebaskan, maka suami dibebaskan dari membayar mahar yang seperdua, sedangkan jika suami yang membebaskan, maka dia membayar seluruh mahar. Namun menurut pendapat yang shahih, maksud \"orang yang memegang ikatan nikah\" adalah suami, karena dialah yang memiliki hak melepaskan ikatan (talak), di samping itu karena wali tidak sah membebaskan sesuatu yang wajib dimiliki wanita, karena dia bukan pemilik dan bukan pula wakil (lih. Tafsir As Sa'diy). Maksudnya: Jangan melupakan sikap memberikan kelebihan dan ihsan kepada orang lain, seperti memberikan pemberian yang tidak wajib dan membebaskan hak. Sikap ihsan (memberi lebih) merupakan cara mu'amalah (berhubungan dengan orang lain) yang paling baik, karena mu'amalah dengan orang lain ada dua tingkatan: Pertama, adil (disebut juga inshaf), yaitu menerima hak dan memenuhi kewajiban. Kedua, memberi lebih (disebut ihsan), yaitu memberikan sesuatu yang tidak wajib, membebaskan hak dan tidak mengutamakan diri sendiri. Seorang mukmin hendaknya tidak melupakan sikap ihsan ini meskipun hanya dalam waktu-waktu tertentu, karena Allah mencintai orang-orang yang berbuat ihsan. Dia mendorong kamu untuk mengerjakan yang ma'ruf dan perbuatan utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 237",
    "description": "Pada ayat berikut Allah menjelaskan hukum terkait perceraian antara suami dan istri yang belum dicampuri namun sudah ditetapkan maskawinnya. Dan jika kamu, wahai para suami, menceraikan mereka, yakni para istri, sebelum kamu sentuh atau campuri, padahal kamu sudah menentukan maharnya, maka bayarlah seperdua dari mahar yang telah kamu tentukan, kecuali jika mereka, yaitu para suami, membebaskan dirinya sendiri dengan membayar penuh mahar tersebut atau suami tersebut dibebaskan oleh orang yang akad nikah ada di tangannya yakni wali istri, dengan cara membebaskan suami tersebut dari kewajiban membayar setengah dari mahar yang telah ditentukan. Jika demikian maka pembebasan itu, baik dari pihak suami maupun dari pihak wali, adalah lebih dekat kepada takwa. Artinya, hal itu lebih layak dilakukan oleh mereka yang termasuk golongan orang bertakwa. Dan janganlah kamu, wahai para suami dan wali, lupa atau melupakan kebaikan di antara kamu, yakni dengan membebaskan kewajiban orang lain atas dirinya atau memberikan haknya untuk orang lain. Sungguh, Allah maha melihat apa yang kamu kerjakan, yakni memberi sesuatu de-ngan yang lebih baik kepada orang lain. Inilah sikap ihsa'n yang dicintai Allah. Ihsa'n inilah sikap tertinggi dari keberagamaan seseorang, yakni memberikan lebih dari yang seharusnya dan mengambil haknya lebih sedikit dari yang semestinya. Usai menjelaskan hukum keluarga dalam beberapa ayat sebelumnya, pada ayat ini Allah menjelaskan hukum asasi antara manusia dengan Allah, yakni salat. Hal ini seakan mengingatkan agar persoalan keluarga tidak membuat manusia lupa akan kewajiban asasinya, yaitu salat. Karena itu, ayat ini dimulai dengan kata perintah. Peliharalah secara sungguh-sungguh, baik secara pribadi maupun saling mengingatkan antara satu dengan lainnya tentang semua salat, dan peliharalah secara khusus salat wusa'a', yakni salat asar dan subuh, karena keutamaannya. Dan laksanakanlah salat karena Allah pemilik kemuliaan dan keagungan dengan khusyuk, yakni dengan penuh ketaatan dan keikhlasan."
  }
]