[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jagalah oleh kalian (wahai kaum muslimin) shalat lima waktu yang diwajibkan dengan cara rutin dalam menjalankannya pada waktu-waktunya dengan memenuhi syarat-syarat, rukun-rukun dan kewajiban-kewajibannya. Dan jagalah shalat yang berada di tengah-tengah antara sholat-sholat itu itu yaitu sholat ashar. Dan dirikanlah shalat kalian dengan menaati Allah, khusyuk lagi tunduk menghinakan diri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "238. Jagalah salat-salat itu dengan cara menunaikannya secara sempurna sebagaimana perintah Allah. Dan jagalah salat yang berada di tengah-tengah salat-salat lainnya, yaitu salat Asar. Dan berdirilah untuk Allah di dalam salatmu dengan tunduk dan khusyuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "238. Hai orang-orang yang beriman, jagalah shalat lima waktu dengan mendirikannya pada waktu yang telah ditentukan, dan dengan menyempurnakan syarat-syarat dan rukun-rukunnya, dan jagalah shalat ashar. Dan tetaplah beribadah dan shalat kepada Allah dengan penuh kekhusyu’an dan ketundukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "238. حٰفِظُوا۟ عَلَى الصَّلَوٰتِ (Peliharalah semua shalat(mu) ) Makna (المحافظة) yakni konsistensi dan penjagaan. وَالصَّلَوٰةِ الْوُسْطَىٰ (dan (peliharalah) shalat wusthaa) Yakni sholat Ashar, karena sebelum shalat ini ada dua shalat dan setelahnya ada dua shalat sehingga ia berada di tengah (wushtha). Dan Allah mengkhususkan penyebutan ayat ini sebagai pemuliaan baginya. وَقُومُوا۟ لِلَّـهِ (Berdirilah untuk Allah ) Yakni dalam shalat kalian. Allah memerintahakan mereka berdiri diatas kaki mereka dalam shalat dengan penuh ketenangan, dan ini pada shalat fardhu; adapun untuk shalat sunnah maka diperbolehkan dengan duduk dan apabila dalam keadaan safar maka boleh dilakukan diatas kendaraan dan semacamnya. قٰنِتِينَ (dengan khusyu’) Yakni dengan ketaatan dan kekhusyu’an. Dan pendapat lain mengatakan: yakni dengan diam dan tidak berbicara dengan orang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kedatangan ayat ini diantara ayat-ayat thalaq bertujuan menggambarkan kepada kita perkara yang wajib dilakukan oleh setiap muslim ketika ia mendengar panggilan Allah, sedang dia berada dalam kesibukan peperangan dunia. 2 ). Generasi-generasi terdahulu sebelum ummat ini pernah mendirikan shalat, dalam suatu perjalanan syaithon menyesatkan mereka dan membuat mereka tertidur ketika petir bebunyi diwatu asar; sehingga kelompok mereka tersesat dalam perjalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "238. Tetaplah mendirikan shalat, dan juga shalat Ashar, yaitu shalat wustha karena berada di bagian tengah shalat 5 waktu. Dan dirikanlah shalat dalam keadaan khusyu’. Mujahid berkata (Dalam hadits yang diriwayatkan Ath-Thabari): “Dahulu orang-orang berbicara dalam shalat, bahkan ada seorang lelaki yang menyuruh saudaranya untuk melakukan suatu keperluan. Lalu Allah menurunkan ayat {Wa quumuu lillahi qaanitiin}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Peliharalah} rajin dan giatlah {semua shalat (fardu) dan shalat Wusṭā.} shalat ashar yang merupakan pertengahan semua shalat {Berdirilah karena Allah dengan khusyu’"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "238. Allah memerintahkan untuk memelihara “shalat-shalat” secara umum dan “shalat wustho” yaitu shalat ashar pada khususnya. Memelihara shalat adalah menunaikannya pada waktunya, dengan syarat-syaratnya, rukun-rukunnya, khusyu padanya, dan seluruh hal yang wajib maupun yang sunnah. Dengan memelihara shalat, kita akan mampu memelihara seluruh ibadah dan juga berguna untuk melarang dari hal yang keji dan munkar, khususnya jika disempurnakan pemeliharaannya sebagaimana yang diperintahkan oleh Allah dalam FirmanNya, “berdirilah untuk Allah (dalam salatmu) dengan khusyu’.” Yakni, dengan rasa rendah yang tulus ikhlas dan khusyu, karena patuh itu adalah ketaatan Yang Langgeng yang dibarengi dengan kekhusyu’an."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { حَٰفِظُواْ عَلَى ٱلصَّلَوَٰتِ } Hâfizhû ‘alash shalawât: Melaksanakannya pada waktunya dengan berjamaah dan menyempurnakan syarat, rukun dan sunnah-sunnah shalat. { وَٱلصَّلَوٰةِ ٱلۡوُسۡطَىٰ } Wash shalâtil wusthâ: Shalat ashar, atau shalat subuh. Wajib untuk menjaga setiap waktu shalat dan terkhusus shalat ashar dan subuh berdasarkan sabda Rasulullah ﷺ :”Barangsiapa yang shalat dalam dua waktu yang dingin, yaitu ashar dan subuh akan masuk surga.” { قَٰنِتِينَ } Qânitîna: Khusyuk dan tenang. Makna ayat: Pada ayat ketiga (238) Allah Ta’ala membimbing hamba-hambaNya yang mukmin kepada hal yang dapat membantu mereka istiqomah menjalankan kewajiban-kewajiban syariat dan adab Islam yang mulia dengan menjaga shalat lima waktu secara umum dan shalat wustha secara khusus. Firman Allah :”Peliharalah segala shalat(mu), dan (peliharalah) shalat wusthâ.” Sebelumnya mereka berbicara ketika shalat maka Allah melarangnya dengan firman Nya :”Dan berdirilah untuk Allah (dalam shalatmu) dengan khusyu’.” Yaitu dengan tenang dan khusyuk. Apabila terjadi ketakutan dan tidak memungkinkan untuk melaksanakan shalat sesuai dengan keadaan ketenangan dan keshusyukan sempurna, maka kerjakanlah dengagn cara berjalan atau menunggangi hewan-hewannya, hingga apabila telah hilang ketakutan dan tersebar keamaan, maka shalatlah sebagaimana sediakala ketika dalam kondisi tenang dan khusyuk. Pelajaran dari ayat: • Kewajiban untuk memelihara shalat lima waktu lebih khusus lagi shalat ashar dan shalat subuh (shalat wustha). • Larangan untuk berbicara saat shalat tanpa ada keperluan yang darurat. • Kewajiban khusyuk di dalam shalat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 238: Allah memerintahkan orang-orang muslim untuk menjaga sholat sesuai waktu yang ditentukan jamaah, khusus sholat ashar. Menjaga sholat tersebut yaitu dengan menegakkan sesuai waktunya dan mendatangkan syarat-syaratnya serta rukun-rukun dan wajib-wajib dan sunnah-sunnahnya. Kemudian mengakkan dengan khusyuk dan tunduk secara berjamaah jika tidak ada penghalang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dari Zaid bin Tsabit ia berkata: Rasulullah shallallahu 'alaihi wa sallam shalat Zhuhur di siang hari yang panas, dan Beliau tidaklah melakukan shalat yang paling berat bagi para sahabat Nabi shallallahu 'alaihi wa sallam daripadanya, maka turunlah ayat, \"Haafizhuu 'alash shalawaati wash shalaatil wusthaa\" Beliau bersabda, \"Sesungguhnya sebelumnya (yakni sebelum shalat wustha) ada dua shalat dan setelahnya ada dua shalat.\" (Hadits ini para perawinya adalah para perawi kitab shahih selain 'Amr bin Abi Hakim dan Az Zabarqaan, namun keduanya tsiqah. Terkadang Az Zabarqaan meriwayatkan dari Urwah dari Zaid bin Tsabit dan terkadang ia meriwayatkan dari Zahrah dari Zaid bin Tsabit dan terkadang meriwayatkan dari Zaid bin Tsabit dan Usamah. Thabrani juga meriwayatkan dalam Al Kabir juz 5 hal. 131 dari jalan Utsman bin 'Affan Al Ghathfaaniy) yang dipegang tentang tafsir shalat wustha adalah shalat 'Ashar sebagaimana dalam shahihain. Memelihara di ayat ini adalah mengerjakannya pada waktunya, terpenuhi syarat, rukun, khusyu', hal yang wajib maupun sunahnya. Menjaga shalat dapat membantu menjaga ibadah yang lain serta dapat mencegah diri dari perbuatan keji dan munkar, terlebih apabila seseorang mengerjakannya dengan sempurna. Shalat wusthaa ialah shalat yang di tengah-tengah dan yang paling utama. Ada yang berpendapat, bahwa yang dimaksud dengan shalat wusthaa ialah shalat Ashar. Ayat ini menekankan agar semua shalat itu dikerjakan dengan sebaik-baiknya. Ada yang mengartikan \"qaanitin\" di ayat tersebut dengan \"diam; tidak berbicara\" berdasarkan hadits Zaid bin Arqam ia berkata, \"Kami terkadang berbicara ketika shalat, sampai turun ayat yang memerintahkan kami untuk diam dan melarang kami berbicara.\" (HR. Bukhari dan Muslim) Pembicaraan mereka ketika shalat misalnya menjawab salam, menjawab orang yang bertanya dsb. Thabrani meriwayatkan dalam Al Kabir dari Simak dari dari Ikrimah dari Ibnu Abbas tentang firman Allah Ta'ala, \"Wa Quumuu lillahi qaanitiin\" ia berkata: \"Dahulu para sahabat berbicara ketika shalat, ada pembantu seseorang yang datang ketika ia sedang shalat lalu membicarakan keperluannya, kemudian mereka pun dilarang berbicara.\" (Abu 'Abdirrahman berkata, \"Hadits tersebut dari jalan Simak dari Ikrimah. Riwayat Simak dari Ikrimah terdapat kemudhthariban.\" Akan tetapi hadits tersebut hanya sebagai syahid saja)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 238",
    "description": "Usai menjelaskan hukum keluarga dalam beberapa ayat sebelumnya, pada ayat ini Allah menjelaskan hukum asasi antara manusia dengan Allah, yakni salat. Hal ini seakan mengingatkan agar persoalan keluarga tidak membuat manusia lupa akan kewajiban asasinya, yaitu salat. Karena itu, ayat ini dimulai dengan kata perintah. Peliharalah secara sungguh-sungguh, baik secara pribadi maupun saling mengingatkan antara satu dengan lainnya tentang semua salat, dan peliharalah secara khusus salat wusa'a', yakni salat asar dan subuh, karena keutamaannya. Dan laksanakanlah salat karena Allah pemilik kemuliaan dan keagungan dengan khusyuk, yakni dengan penuh ketaatan dan keikhlasan namun, jika kamu takut ada bahaya, baik karena musuh, binatang buas, atau lainnya, maka salatlah sambil berjalan kaki karena darurat atau ketika berada di kendaraan, baik menghadap kiblat maupun tidak kemudian apabila situasinya telah kembali aman, maka ingatlah Allah, yakni salatlah, sebagaimana dia telah mengajarkan kepadamu apa yang tidak kamu ketahui, seperti cara melaksanakan salat dalam kondisi tidak aman. Ini menunjukkan pentingnya salat. Ia harus ditegakkan dimana saja dan kapan saja, serta dalam situasi apa pun."
  }
]