[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu apabila kalian khawatir terhadap musuh kalian, maka kerjakanlah shalat khauf dengan berjalan, atau berkendaraan atau dengan cara bagaimanapun yang kalian sanggupi walaupun dengan sekedar berisyarat dan walaupun menghadap ke arah selain kiblat. Kemudian apabila rasa takut kalian telah sirna, maka laksanakanlah shalat sebagaimana kalian mengerjakannya dalam aman. Dan ingatlah Allah di dalamnya. Dan janganlah kalian menguranginya dari tata cara yang baku. Dan bersyukurlah kepada Allah atas hal-hal yang Allah ajarkan kepada kalian berupa ilmu tentang perkara-perkara ibadah dan hukum-hukum yang kalian tidak punya pengetahuan tentang itu sebelumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "239. Apabila kalian takut kepada musuh dan sebagainya, lalu kalian tidak dapat menunaikan salat secara sempurna, maka salatlah sambil berjalan kaki atau menunggang unta, kuda dan sebagainya, atau dengan cara apapun yang bisa kalian lakukan. Apabila ketakutan itu sudah hilang, maka berzikirlah kepada Allah sebagaimana Dia mengajarkannya kepada kalian. Salah satunya ialah berzikir kepada Allah di dalam salat secara lengkap dan sempurna. Dan ingatlah juga bagaimana Allah mengajarkan kepada kalian tentang cahaya dan petunjuk yang belum kalian ketahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "239. Jika kalian takut dari musuh, maka shalatlah shalat khauf, yaitu dengan berjalan kaki atau berkendara dengan menghadap kiblat atau tidak. Dan apabila ketakutan kalian telah pergi maka shalatlah sebagaimana biasa. Dan berzikirlah kepada Allah dalam shalat sebagaimana Allah telah mengajarkan kepada kalian syariat-syariat yang sebelumnya tidak kalian ketahui. Abdullah bin Umar jika ditanya tentang tata cara shalat khauf ia menjawab: “Imam harus maju dengan beberapa orang untuk shalat satu rakaat, dan antara orang-orang yang shalat ini ada sekelompok pasukan yang belum shalat yang menjaga mereka dari musuh. Apabila kelompok pertama telah menyelesaikan satu rakaat, maka mereka mengambil posisi pasukan yang belum shalat tanpa mengakhiri shalat mereka. Sedangkan pasukan yang belum shalat mengambil posisi pasukan yang telah shalat satu rakaat. Kemudian imam menyelesaikan shalatnya -imam telah shalat dua rakaat, satu rakaat dengan pasukan pertama dan satu rakaat dengan pasukan kedua-. Kemudian semua pasukan berdiri melanjutkan shalat mereka sendiri-sendiri satu rakaat setelah imam selesai shalat. Dengan begitu semua pasukan telah melaksanakan dua rakaat. Dan jika peperangan lebih genting, maka dibolehkan untuk shalat dalam keadaan berjalan, berdiri, atau berkendara, baik itu dengan menghadap kiblat maupun tidak. Nafi’ berkata: “Menurutku Abdullah bin Umat tidak menyebutkan tata cara ini melainkan karena ia mendengarnya dari Rasulullah”. (Shahih Bukhari 8/199, no. 4553, kitab tafsir, bab surat al-baqarah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "239. فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا ۖ (Jika kamu dalam keadaan takut (bahaya), maka shalatlah sambil berjalan atau berkendaraan) Yakni dalam keadaan takut yang sangat maka boleh bagi kalian untuk mengerjakan shalat diatas kendaraan kalian atau dengan berjalan sambil menghadap ke kiblat atau tidak menghadapnya, dengan gerakan, perpindahan, pukulan, maupun lari maju mundur. فَإِذَآ أَمِنتُمْ (Kemudian apabila kamu telah aman) Yakni apabila ketakutan kalian telah hilang maka kembalilah kepada apa yang diperintahkan kepada kalian berupa menyempurnakan shalat dengan segala syarat dan rukunnya. فَاذْكُرُوا۟ اللَّـهَ كَمَا عَلَّمَكُم (maka sebutlah Allah (shalatlah), sebagaimana Allah telah mengajarkan kepada kamu) Yakni mengajarkan syari’at-syariatnya yang belum kalian ketahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "239. Ini adalah shalat dalam keadaan takut. Dan jika kalian takut dengan musuh atau hewan buas misalnya, maka shalatlah dalam keadaan berjalan atau dengan berkendara, baik menghadap kiblat atau tidak menghadap kiblat, dengan bergerak ataupun tidak. Dan ketika ketakutan itu telah lenyap, maka shalatlah sesuai shalatnya orang dalam keadaan aman. Dengan menghadap kiblat dan berdiri. Dan shalat itu dengan mengucapkan dzikir, yaitu tahmid, tasbih, tasyahud dan membaca bacaan Al-Qur’an karena semua itu adalah rukun shalat. Dan ingatlah Allah sebagaimana Dia telah mengajarkan tata cara, rukun, dan syarat ibadah yang disyariatkan yang belum kalian ketahui sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan taat dan khusyu’ {Jika kalian berada dalam keadaan takut, maka dengan berjalan kaki} maka shalatlah dalam keadaan berjalan kaki {atau berkendaraan} atau berkendara di atas punggung hewan kalian {Lalu apabila kalian telah aman} telah hilang ketakutan kalian {ingatlah Allah sebagaimana Dia telah mengajarkan kepada kalian apa yang tidak kalian ketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "239. Dan FirmanNya, “Jika kamu dalam keadaan takut (bahaya).” Yang ditakuti tidak disebutkan agar ketakutan tersebut adalah rasa takut dari perkara yang tidak umum seperti dari musuh, binatang buas, dan kehilangan sesuatu hal yang dikhawatirkan oleh manusia. Maka shalatlah kalian “sambil berjalan,” berjalan diatas kaki kalian, “atau berkendaraan” di atas kuda, atau unta atau segala macam kendaraan. Dan dalam kondisi seperti ini tidaklah harus menghadap kiblat. Inilah sifat salat orang-orang yang berhalangan karena ketakutan, lalu apabila telah berada pada kondisi yang aman, maka ia harus shalat dengan sempurna, dan termasuk dalam FirmanNya, “kemudian apabila kamu telah aman maka sebutlah Allah (sholatlah)” dengan menyempurnakan shalat, dan termasuk didalamnya juga dalam memperbanyak dzikir kepada Allah sebagai rasa syukur kepadaNya atas nikmat keamanan dan nikmat pendidikan yang merupakan kebahagiaan seorang hamba. Ayat ini juga menunjukkan keutamaan ilmu dan bahwa orang yang diberikan ilmu oleh Allah tentang perkara yang sebelumnya dia tidak diketahui, maka wajib atasnya memperbanyak dzikir kepadaNya. Dan ayat ini juga merupakan tanda bahwa memperbanyak dzikir kepadaNya menjadi faktor penyebab diberikannya ilmu-ilmu yang lain, karena kesyukuran itu selalu diiringi dengan penambahan nikmat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فَرِجَالًا } Farijâlan: Berjalan kaki atau mengendarai hewan tunggangan atau hal lain yang dapat dikendarai. Makna ayat: Allah Ta’ala berfirman :”Apabila kamu dalam keadaan takut (bahaya), maka shalatlah sambil berjalan atau berkendaraan. Kemudian apabila kamu telah aman, maka sebutlah Allah Ta’ala (shalatlah), sebagaimana Allah Ta’ala telah mengajarkan kepada kmu apa yang belum kamu ketahui.” Allah Ta’ala menginginkan dengan kata dzikir (menyebut dan mengingat) di sini adalah: pertama, mendirikan shalat kemudian dzikir secara umum, dengan mengingatkan mereka akan kenikmatan ilmu dan mensyukurinya dengan melaksanakan shalat secara sempurna, karena hal itu akan membantu segala bentuk ketaatan dan bisa mencegah dariperbuatan keji dan mungkar. Inilah kandungan ayat yang keempat (239). Pelajaran dari ayat: • Penjelasan mengenai bagi orang yang takut musuh dan selainnya, maka boleh baginya untuk shalat dalam keadaan jalan atau mengendarai kendaraan. • Kewajiban untuk mengingat Allah, dan bersyukur atas nikmatnya leibh khusus lagi nikmat ilmu tetang Islam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 239: Allah menjelaskan bahwasannya jika merasa takut dari musuh dan selainnya dan tidak tenang dalam melaksanakan sholat, maka sholatlah sesuai dengan keadaan yang kalian kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya ada musuh, ada banjir besar atau ada binatang buas. Yakni semampunya; bagaimana pun bentuknya, meskipun dengan isyarat atau sampai tidak menghadap kiblat. Dalam ayat ini, terdapat dalil perintah untuk melaksanakan shalat pada waktunya meskipun sebagian syarat dan rukun shalat hilang dan tidak boleh menundanya sampai lewat dari waktunya. Dengan cara asalnya. Seperti ibadah dan hukum-hukum yang sebelumnya tidak kita ketahui. Hal ini merupakan nikmat besar yang sepantasnya disikapi dengan dzikrullah dan bersyukur agar nikmat itu tetap ada dan bertambah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 239",
    "description": "Namun, jika kamu takut ada bahaya, baik karena musuh, binatang buas, atau lainnya, maka salatlah sambil berjalan kaki karena darurat atau ketika berada di kendaraan, baik menghadap kiblat maupun tidak kemudian apabila situasinya telah kembali aman, maka ingatlah Allah, yakni salatlah, sebagaimana dia telah mengajarkan kepadamu apa yang tidak kamu ketahui, seperti cara melaksanakan salat dalam kondisi tidak aman. Ini menunjukkan pentingnya salat. Ia harus ditegakkan dimana saja dan kapan saja, serta dalam situasi apa pun. Usai sejenak mengingatkan manusia agar tidak melalaikan salat karena persoalan keluarga, pada ayat ini Allah kembali menjelaskan hukum keluarga. Dan orang-orang yang akan mati, baik karena sudah renta maupun sakit menahun, di antara kamu, wahai para suami, dan kamu meninggalkan istri-istri, hendaklah ia sebelum meninggal dunia membuat wasiat untuk istri-istrinya untuk tetap tinggal di rumah, juga berpesan kepada anak-anak dan saudara-saudaranya agar memberi mereka nafkah berupa sandang dan pangan, paling tidak sampai setahun sejak suami wafat tanpa seorang pun boleh mengeluarkannya atau mengusirnya dari rumah itu. Tetapi jika mereka, yakni istri yang ditinggal mati suaminya, sebelum setahun keluar sendiri dari rumah tersebut untuk pindah ke tempat lain, maka tidak ada dosa bagimu, wahai para wali atau siapa saja, mengenai apa yang mereka lakukan terhadap diri mereka sendiri dalam hal-hal yang baik yang tidak melanggar syariat. Allah mahaperkasa sehingga harus ditaati, mahabijaksana dalam menetapkan hukum demi kemaslahatan hamba-Nya."
  }
]