[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika sekarang ini kalian tidak sanggup -dan akan tetap tidak akan sanggup juga nantinya dan itu pasti adanya- maka takutlah kalian terhadap neraka dengan cara beriman kepada nabi Muhammad Shallallahu alaihi salam dan taat kepada Allah Subhanahu Wa Ta'ala. inilah neraka yang bahan bakarnya adalah manusia dan bebatuan yang telah disediakan bagi orang-orang yang kafir kepada Allah dan para rasul-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Jika kalian tidak bisa melakukannya dan memang tidak akan sanggup melakukannya sampai kapanpun juga, maka takutlah kalian terhadap siksa neraka yang dinyalakan dengan bahan bakar dari manusia yang layak disiksa, ditambah dengan batu yang dahulu mereka sembah selain Allah dan bahan bakar lainnya. neraka ini telah disiapkan dan disediakan oleh Allah bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Itu merupakan ancaman bagi orang-orang yang mendustakan dan mengingkari Allah dan hari akhir. Adapun orang-orang yang beriman dan membenarkan Allah dan Rasul-Nya, bagi mereka berita gembira. Setelah Allah menyebutkan penyampai berita gembira, kemudian Dia menyebutkan berita gembira tersebut dengan firman-Nya: (أن لهم الجنات) yakni surga yang banyak. Oleh sebab itu Allah memerintahkan Rasulullah untuk mengabarkan kepada mereka kebun-kebun yang diliputi pepohonan dan dibawahnya terdapat sungai-sungai yang mengalir, pepohonan tersebut memiliki buah-buahan yang mirip dengan buah-buahan dunia dari sisi warna dan bentuknya, namun berbeda dari sisi rasa dan ukurannya. Selain kenikmatan yang kekal ini, bagi mereka juga istri-istri yang selalu suci dari haid dan kotoran. Dan Rasulullah telah menjalankan perintah ini dengan menyampaikan kabar gembira kepada manusia berupa surga dan kebahagiaan di dunia dan di akhirat. Terdapat berbagai kitab yang telah ditulis mengenai kabar-kabar gembira yang disampaikan Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَاِنْ لَّمْ تَفْعَلُوْا (Maka jika kamu tidak dapat membuat(nya)) yakni jika kalian tidak mampu melakukan itu, dan telah jelas ketidakmampuan kalian untuk mendatangkan semisal salah satu surat dari al-Qur’an. فَاتَّقُوا النَّارَ (maka peliharalah dirimu dari neraka) Yakni maka jauhkanlah diri kalian dari neraka dengan beriman kepada Allah, kitab-kitabNya, Rasul-rasulNya dan menjalankan segala perintah-Nya dan menjauhi larangan-Nya. Dan tantangan terhadap orang-orang kafir ini merupakan termasuk hal ghaib yang dikabarkan oleh al-Qur’an sebelum waktu kejadiannya; karena belum pernah ada satupun dari orang-orang kafir yang menyambut tantangan ini, baik itu di zama Rasulullah maupun zaman setelahnya sampai saat ini. Dan tidak ada yang mencoba untuk mendatangkan surat seperti yang ada dalam al-Qur’an kecuali datang dengan sesuatu yang hanya menjadi bahan tertawaan bagi orang yang berakal, sebagaimana yang dilakukan oleh Musailamah dan lainnya. الَّتِيْ وَقُوْدُهَا (yang bahan bakarnya (manusia dan batu)) yakni neraka ini menyala dengan bahan bakar manusia dan batu. Allah menjadikan bahan bakarnya adalah sesuatu yang ingin dibakar-Nya. Diriwayatkan dari hadist yang diriwayatkan oleh Imam Bukhari dan Muslim dari Abu Hurairah, ia berkata: Rasulullah bersabda: tidak ada satupun dari para nabi kecuali diberi oleh Allah ayat-ayat (mukjizat) yang menjadikan manusia beriman kepada mereka. Dan yang diberikan kepadaku adalah wahyu yang diilhamkan oleh Allah kepadaku, maka aku berharap umatku adalah umat yang paling banyak di hari kiamat nanti."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara macam-macam hukuman yang paling sadis adalah ketika diri dan jasad manusia menjadi sumber hukumannya, dan inilah yang dijanjikan Allah untuk para penghuni neraka; agar bertambah kepedihan yang mereka rasakan : { وَقُودُهَا النَّاسُ وَالْحِجَارَةُ } \"bahan bakarnya manusia dan batu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan apabila kalian tidak bisa dan tidak kuasa mendatangkan surah yang serupa, maka takutlah terhadap neraka jahanam dengan beriman dan melaksanakan kewajiban-kewajiban dan menjauhi larangan-larangan. Neraka yang bahan bakarnya orang-orang kafir dan bebatuan berhala yang disembah itu disiapkan untuk orang-orang yang ingkar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak melakukannya dan pasti kalian tidak akan (mampu) melakukannya, maka takutlah} maka waspadalah {terhadap api neraka yang bahan bakarnya adalah manusia dan bebatuan yang disediakan} dipersiapkan {bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Ayat ini dan ayat-ayat yang semisalnya dinamakan dengan ayat tantangan. Maksudnya adalah membuktikan kelemahan makhluk dalam hal menghadirkan sesuatu yang semisal dengan al-Qur’an, atau karena mengkritiknya dari suatiu sisi. Allah berfirman : \"Katakanlah: “Sesungguhnya jika manusia dan jin berkumpul untuk membuat yang serupa Al Quran ini, niscaya mereka tidak akan dapat membuat yang serupa dengan dia, sekalipun sebagian mereka menjadi pembantu bagi sebagian yang lain”. (QS. Al-Isro : 88) Bagaimana mungkin makhluk yang berasal dari tanah mampu agar perkataanya sama seperti perkataan Rabb segala makhluk, atau bagaimana mungkin seorang yang miskin lagi papa dalam segala bentuknya dapat menghadirkan sebuah perkataan yang sama dengan perkataan Dzat yang sempurna, yang memiliki kesempurnaan mutlak, Dzat yang mahakaya lagi luas dalam segala bentuknya? Hal ini tidaklah mungkin dan diluar kemampuan manusia, dan setiap orang yang memiliki sekecil-kecilnya rasa dan pengetahuan terhadap corak dan bentuk perkataan. Apabila seseorang membanding-bandingkan al-Qur’an yang agung ini dengan selainnya dari perkataan-perkataan para ahli sastra, niscaya nampaklah baginya suatu perbedaan yang luarbiasa besarnya. Dan dalam firmanNya, “dan jika kamu (tetap) dalam keraguan tentang al-Qur’an yang kami wahyukan kepada hamba kami (Muhammad), maka buatlah satu surat (saja) yang semisal al-Qur’an itu dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang memang benar, ” terkandung sebuah dalil yang menunjukkan bahwasanya orang yang diharapkan hidayah baginya dari kesesatan adalah seorang yang ragu dan bingung, yang belum mengetahui kebenaran dari kesesatan, maka orang seperti ini bila dijelaskan kebenaran baginya, niscaya ia segera mengikutinya jika ia memang benar-benar mencari kebenaran. Adapun orang yang keras kepala yang mengetahui kebenaran namun ia meninggalkannya, maka yang seperti ini tidaklah mungkin kembali, karena ia telah meninggalkan kebenaran setelah jelas baginya kebenaran itu, di mana ia tidak meninggalkannya karena sebuah kebodohan, maka tidak ada alasan lain untuknya. Demikian juga orang yang ragu dan tidak benar-benar mencari kebenaran, bahkan ia berleha-leha dan tidak bersungguh-sungguh dalam mencarinya, maka yang seperti ini secara garis besar tidaklah di bimbing kesana. Dalam penjelasan tentang Rosululloh SHOLALLOHU 'ALAIHI WASALLAM sebagai hamba Allah dalam konteks yang agung ini adalah sebuah dalil bahwasanya sifat beliau yang paling besar adalah realisasi beliau dalam penghambvaan yang tidak dapat disaingi oleh siapapun dari orang-orang terdahulu maupun yang akan datang. Sebagaimana beliau disifati sebagai hamaba di saat peristiwa isro, firman Allah : \" Maha Suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam\" (QS. Al_isro : 1) Dan pada saat turunnya Al-quran sebagaimana firman-Nya : Maha suci Allah yang telah menurunkan Al Furqaan (Al Quran) kepada hamba-Nya, agar dia menjadi pemberi peringatan kepada seluruh alam,\" (QS. Al-Furqon : 1) Dan dalam firman Allah, “yang disediakan bagi orang-orang kafir” dan ayat-ayat yang semacamnya adalah sebuah dalil bagi Ahlus Sunnah wal Jama’ah bahwasanya surga dan neraka itu telah diciptakan berbeda dengan al-Mu’tazilah. Ayat ini juga mengandung isyarat bahwasanya orang-orang yang bertauhid walaupun mereka terkadang melakukan beberapa dosa besar, namun tidak akan kekal dalam neraka, karena Allah berfirman, ” yang di sediakan bagi orang-orang kafir, ” sekiranya orang-orang yang melakukan maksiat dari ahli tauhid itu kekal dalam neraka, maka neraka tidaklah di siapkan hanya untuk orang-orang kafir semata. Ini berbeda dengan faham al-Khawarij dan al-Mu’tazilah . demikian juga isyarat lain tentang suatu dalil bahwa siksaan itu di peroleh dengan adanya sebab-sebabnya yaitu kekufuran dan segala corak kemaksiatan yang berbeda-beda."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : وَقُودُهَا Waquuduhaa : Sesuatu yang digunakan sebagai bahan bakar untuk menyalakan api yaitu orang-orang kafir, berhala-berhala yang disembah bersama dengan Allah ‘Azza wa Jalla. أُعِدَّتۡ U’idat : Dipersiapkan dan dihadirkan Al-Kaafiriin adalah orang-orang yang enggan untuk beribadah kepada Allah Ta’ala saja dan mereka mendustakan RasulNya serta syariatNya. Makna ayat : Jika kalian tidak mampu mendatangkan maka jagalah diri kalian dari api neraka dengan beriman kepada wahyu Allah dan beribadah kepadaNya sesuai syariatNya. Pelajaran dari ayat : 3. Neraka dapat dihindari dengan keimanan dan amalan sholeh. Disebutkan dalam hadits sahih,”Jagalah dirimu dari api neraka walau dengan bersedekah sebutir kurma.” (HR Bukhari)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 24: Kemudian Allah berkata kepada mereka : maka jika kalian merasa lemah Wahai orang-orang yang kafir akan hal ini , takutlah kalian kepada neraka Allah yang bahan bakarnya manusia dan bebatuan ; Oleh karena itu beriman kepada Allah dan nabi-Nya , ketahuilah neraka ini adalah sebagai balasan kepada orang-orang yang kafir terhadap Allah dan Rasul-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini merupakan bukti kebenaran Rasulullah shallallahu 'alaihi wa sallam dan apa yang dibawanya. bagaimana mungkin makhluk yang diciptakan dari tanah (manusia) sanggup mengatakan perkataan yang sama dengan perkataan Rabbul 'aalamin, apakah makhluk yang memiliki kekurangan dan fakir ini mampu menandingi perkataan Zat yang memiliki kesempurnaan secara mutlak. Setiap orang yang memiliki rasa bahasa dan pengetahuan tentang berbagai macam perkataan pasti akan mengetahui perbedaan yang nampak ketika Al Qur'an ini dibandingkan dengan perkataan para ahli sastera. Yaitu dengan beriman kepada Nabi shallallahu 'alaihi wa sallam dan ta'at kepada Allah Ta'ala. Api neraka yang sudah disiapkan Allah Ta'ala untuk orang-orang yang kafir kepada Allah dan Rasul-Nya bahan bakarnya manusia dan batu, maka janganlah kamu kafir setelah jelas bagimu kebenarannya. Setelah itu, pada ayat selanjutnya Allah Ta'ala menyebutkan balasan jika mereka mau beriman sebagaimana pada ayat selanjutnya. Seperti inilah cara yang digunakan Al Qur'an, menggabung antara targhib (memberikan dorongan) dan tarhib (menakut-nakuti) agar seorang hamba ketika berharap sambil bersikap cemas, dan ketika takut sambil tetap berharap dan tidak berputus asa. Ayat ini menunjukkan bahwa orang-orang kafirlah yang kekal di neraka. Adapun orang yang beriman (muslim) meskipun melakukan dosa besar, maka ia tidak kekal di neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 24",
    "description": "Jika kamu tidak mampu membuat surah yang serupa dengan-Nya, dan kamu pasti tidak akan mampu melakukannya, sebab hal itu berada di luar kemampuanmu sebagai manusia, maka takutlah kamu akan api neraka dengan memelihara diri dari hal-hal yang dapat menjerumuskan kamu ke dalamnya yang bahan bakarnya manusia yang ingkar/kufur dan batu yang berasal dari patung-patung sembahan dan lainnya, yang disediakan bagi orang-orang kafir dan setiap orang yang bersikap seperti mereka, yaitu menutupi kebenaran tanda kekuasaan Allah. Dan jika demikian balasan yang akan diterima oleh orang-orang kafir, maka tidak demikian halnya dengan orang-orang yang beriman. Surga yang nyaman dan indah adalah tempat bagi mereka. Sampaikanlah kabar gembira yang menenteramkan jiwa kepada orang-orang yang beriman kepada Allah, rasul, dan kitab-Nya tanpa keraguan sedikit pun, dan berbuat amal-amal kebajikan, bahwa untuk mereka Allah menyediakan di sisi-Nya surga-surga dengan kebun-kebun yang rindang dan berbuah, serta istana-istana yang menjulang tinggi, yang mengalir di bawahnya sungai-sungai. Setiap kali mereka diberi rezeki oleh Allah berupa buah-buahan dari surga, mereka berkata, inilah rezeki yang serupa dengan yang pernah diberikan kepada kami dahulu. Mereka telah diberi buah-buahan yang serupa dari segi nama, bentuk, dan jenisnya, meski rasa dan kelezatannya jauh berbeda. Dan di sana mereka juga memperoleh pasangan-pasangan yang suci, tanpa cacat dan kekurangan sedikit pun. Mereka kekal hidup di dalamnya untuk selama-lamanya, tidak akan pernah mati, dan tidak akan pernah keluar darinya."
  }
]