[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan para suami yang meninggal dunia dan meninggalkan istri-istri sepeninggal mereka, maka wajiib bagi mereka untuk berwasiat bagi istri-istri itu untuk diberi nafkah selama satu tahun penuh sejak hari kematiannya denga tinggal di rumah suaminya tanpa ada ahli waris yang menyuruh mereka pergi selama setahun tersebut, supaya menjadi penambal perasaan karena ditinggal suami, dan bersikap baik terhadap orang yang meninggal. Maka apabila istri-istri keluar dari rumah dengan kemauan mereka sendiri sebelum masa satu tahun berakhir, maka tidak ada dosa atas kalian (wahai para ahli waris) terkait hal tersebut dan tidak ada masalah istri-istri itu dalam hal yang mereka perbuat sendiri berupa perkara yang mubah. Dan Allah maha perkasa dalam kerajaan Nya Maha bijaksana dalam perintah dan larangan Nya. Dan ayat ini telah dinasakh dengan firman Allah ta'ala pada ayat lain: وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنْفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا “Orang-orang yang meninggal dunia di antaramu dengan meninggalkan isteri-isteri (hendaklah para isteri itu) menangguhkan dirinya (ber'iddah) empat bulan sepuluh hari.” (QS. Al-Baqarah ayat 234)"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "240. Siapa saja di antara kalian meninggal dunia dan meninggalkan istri-istri, hendaknya ia membuat wasiat untuk mereka dengan mengizinkannya tinggal di rumah suaminya dan mendapatkan nafkah dari harta suaminya selama setahun penuh. Ahli waris kalian tidak boleh yang mengusirnya dari rumah tersebut. Hal itu untuk menghibur hatinya atas musibah yang menimpa mereka dan menunjukkan kesetiaan mereka kepada suami yang meninggal dunia. Namun apabila mereka keluar dari rumah itu dengan kemauan mereka sendiri sebelum genap satu tahun, maka tidak ada dosa bagi kalian. Dan juga tidak ada dosa bagi mereka untuk berhias dan memakai minyak wangi. Allah Maha Perkasa, tidak ada yang bisa mengalahkan-Nya, lagi Maha Bijaksana dalam mengatur makhluk-Nya, menetapkan syariat-Nya dan menentukan takdir-Nya. Mayoritas ahli tafsir menyatakan bahwa hukum yang terkandung di dalam ayat ini telah diganti (mansukh) dengan firman Allah -Ta'ālā-, \"Orang-orang yang meninggal dunia di antara kalian dengan meninggalkan istri-istri (hendaklah para istri itu) menahan dirinya (beridah) selama empat bulan sepuluh hari.” (Al-Baqarah: 234)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "240. Para suami yang akan meninggal hendaklah ia meninggalkan wasiat kepada istri-istri mereka agar setelah kematiannya mereka mendapat nafkah dan tempat tinggal selama setahun penuh, dan istri-istri tersebut tidak boleh keluar dari rumah suami mereka, namun jika mereka keluar dengan kemauan sendiri maka tidak ada dosa bagi suami sebab istri meninggalkan hidad, tempat tinggal, berhias, dan sebagainya setelah masa iddah selesai. Allah Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam hukum-hukum-Nya. Hukum ini telah dinasakh (hapus) dengan ayat-ayat yang menjelaskan tentang harta warisan dan kewajiban menjalani masa iddah selama empat bulan sepuluh hari. Imam Abu Daud mengeluarkan hadits dari Ibnu ‘Abbas, firman Allah: وَالَّذِينَ يُتَوَفَّوْنَ مِنْكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِأَزْوَاجِهِمْ مَتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ Dan orang-orang yang akan meninggal dunia di antara kamu dan meninggalkan isteri, hendaklah berwasiat untuk isteri-isterinya, (yaitu) diberi nafkah hingga setahun lamanya dan tidak disuruh pindah (dari rumahnya). Ayat ini dinasakh dengan ayat tentang warisan, bahwa istri mendapat seperempat atau seperdelapan dari harta peninggalan suami. Dan masa setahun dinasakh menjadi empat bulan sepuluh hari. (hadits ini dihasankan oleh al-albani dalam shahih sunan Abu Daud, Talak, bab nasakh mut’ah istri yang meninggal suaminya, no. 2012)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "240. مَّتٰعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ ۚ ( (yaitu) diberi nafkah hingga setahun lamanya dan tidak disuruh pindah (dari rumahnya) ) Yakni wajib bagi orang yang akan meninggal berwasiat untuk istri-istri mereka sebelum datangnya maut berupa nafkah setahun penuh setelah kematian mereka dan tidak diperintahkan untuk keluar dari rumah-rumah mereka. فَإِنْ خَرَجْنَ (Akan tetapi jika mereka pindah (sendiri) ) Yakni atas pilihan mereka sendiri sebelum setahun. فَلَا جُنَاحَ عَلَيْكُمْ (maka tidak ada dosa bagimu) Yakni tidak mengapa bagi wali, hakim, atau yang lainnya. فِىمَا فَعَلْنَ فِىٓ أَنفُسِهِنَّ (membiarkan mereka berbuat terhadap diri mereka) Yang berupa menerima para pelamar atau berdandan untuk mereka. مِن مَّعْرُوفٍ ۗ (sesuatu yang ma’ruf) Yakni dengan sesuatu yang baik dalam syariat dan bukan sesuatu yang munkar. Dalam ayat ini terdapat dalil bahwa wanita-wanita tersebut dapat memilih dalam hal bertempat tinggal selama setahun, dan hal ini bukan wajib bagi mereka. Dan pendapat lain mengatakan bahwa bertempat tinggal selama setahun ini adalah sunnah yang telah dinasakh (dihapus) dengan ayat-ayat waris. Adapun keluar rumah tidak diperbolehkan kecuali setelah selesainya masa iddah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "240. Dan orang-orang yang mati dan meninggalkan istri, maka sebaiknya mereka memberi wasiat agar istrinya diberi nafkah dan tempat tinggal selama satu tahun penuh tanpa tanpa keluar dari rumah mereka (rumah suami mereka). Dan jika mereka memilih keluar sebelum berakhir satu tahun, maka tidak ada dosa bagi wali dan orang lain yang berhubungan dengan perkara itu atas tindakan mereka untuk keluar dan melewati batasan yang dibuat suami mereka, dan melakukan sesuatu yang sesuai syariat. Ini di antara dalil yang menunjukkan pilihan wanita untuk tinggal selama satu tahun. Dan Allah itu Maha Kuat lagi Maha Menaklukkan dalak kerajaanNya, serta Maha Bijaksana dalam tindakan dan aturanNya yang maslahat bagi ciptaanNya. Hukum ini dinasakh dengan ayat-ayat tentang warisan dan untuk merespon ayat tentang masa iddah karena ditinggal mati selama 4 bulan 10 hari.Ayat ini untuk laki-laki Thaif yang tiba di Madinah, lalu dia mati di sana, Lalu Nabi SAW menyampaikan warisannya kepada kedua orang tuanya dan walinya dengan baik dan memerintahkan mereka untuk memberi nafkah istri yang ditinggal mati sampai satu tahun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang akan mati di antara kalian dan meninggalkan} meninggalkan {istri-istri} istri-istri {hendaklah membuat wasiat untuk istri-istrinya} hendaklah membuat wasiat untuk istri-istrinya {(yaitu) nafkah} nafkah dan pakaian yang bisa mereka gunakan {sampai setahun} sampai setahun penuh {tanpa mengeluarkannya} ahli waris tidak mengusir mereka dari rumah suaminya {Akan tetapi, jika mereka keluar} dengan pilihan mereka sendiri sebelum satu tahun {maka tidak ada dosa} tidak ada kesalahan {bagi kalian mengenai hal-hal yang patut yang mereka lakukan terhadap diri mereka sendiri. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "240. Telah terkenal dikalangan para ahli tafsir bahwa ayat yang mulia ini telah dinasakh oleh ayat yang sebelumnya, yaitu firman Allah : \"Orang-orang yang meninggal dunia di antaramu dengan meninggalkan isteri-isteri (hendaklah para isteri itu) menangguhkan dirinya (ber’iddah) empat bulan sepuluh hari\". QS. Al Baqarah ayat 234 Dan bahwasanya perintah itu adalah untuk para istri agar menunggu selama satu tahun penuh tetapi kemudian diganti (dinasakh) dengan 4 bulan 10 hari. Mereka menjawab tentang kenapa ayat yang menasakh ini lebih dahulu; bahwa itu hanya dalam penempatan saja dan bukan lebih dulu diturunkan, karena syarat dari ayat yang menghapus adalah harus turun lebih akhir dari ayat yang dihapus. Pendapat ini tidak ada dalilnya, karena barangsiapa yang mencermati kedua ayat itu, maka akan jelas baginya bahwa pendapat selain itu tentang ayat ini justru yang lebih benar dan bahwa ayat pertama itu adalah wajibnya menunggu selama 4 bulan 10 hari dalam bentuk pengharusan atas wanita. Adapun dalam ayat ini adalah sebuah wasiat kepada keluarga mayit agar membiarkan istri si mayit itu tinggal bersama mereka selama satu tahun penuh dengan paksaan demi kepentingannya dan sebagai sikap baik kepada orang yang telah meninggal di antara mereka. Oleh karena itu Allah berfirman, “hendaklah berwasiat untuk istri-istrinya,” artinya, (dengan) wasiat (pesan) dari Allah kepada keluarga mayit agar berlaku baik kepada istri si mayit dan agar mereka memberikan kebahagiaan kepadanya dan tidak mengeluarkannya. Apabila ia ingin, istri boleh menetap sesuai wasiat itu dan apabila ia menghendaki pergi, maka tidak ada dosa atasnya. Karena itulah Allah berfirman, “Akan tetapi jika mereka pindah (sendiri), maka tidak ada dosa bagimu (wali atau waris dari yang meninggal) membiarkan mereka berbuat yang Ma'ruf terhadap diri mereka,” yaitu berhias diri dan berpakaian bagus, akan tetapi syaratnya adalah harus dengan yang patut yang tidak mengeluarkannya dari hukum-hukum agama dan pertimbangan pantas. Allah menutup ayat ini dengan dua namaNya yang agung tersebut yang menunjukkan akan kesempurnaan keperkasaan dan kebijaksanaanNya, karena hukum-hukum tersebut dikeluarkan dari keperkasaanNya, dan hukum-hukum itu menunjukkan akan kesempurnaan hikmahNya, dimana Allah meletakkannya pada tempatnya yang sesuai dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡحَوۡلِ } Al-Haul: Tahun { فَإِنۡ خَرَجۡنَ } Fa in kharajna: Apabila mereka keluar dari rumah suaminya yang meninggal sebelum genap satu tahun. Makna ayat: Konteks ayat-ayat ini masih menjelaskan tentang hak-hak wanita yang diceraikan dan ditinggal wafat oleh suamiya. Pada ayat ini (240) Allah Ta’ala mengabarkan bahwa orang-orang mukmin yang wafat dan meninggalkan istri-istrinya, maka ahli waris suami mendapatkan wasiat dari Allah untuk dilaksanakan, yaitu agar mengizinkan istri yang ditinggal wafat untuk tinggal bersama keluarga suami, makan dan minum di sana sampai genap satu tahun termasuk di dalamnya masa ‘iddah selama empat bulan sepuluh hari. Kecuali setelah masa ‘iddah selesai dan wanita menginginkan untuk keluar dari rumah tersebut maka tidak mengapa. I Pelajaran dari ayat: • Tinggalnya wanita yang sedang dalam masa ‘iddah di rumah suaminya selama satu tahun, apabila ia berkehendak setelah selesai masa ‘iddahnya selama empat bulan sepuluh hari dengan tambahan tujuh bulan dan dua puluh hari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 240: Allah mengabarkan bahwasannya wajib atas suami berwasiat sebelum wafatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berwasiat kepada istri dimansukh dengan ayat warisan. Dari hari meninggalnya. Menunggu selama setahun, dimansukh dengan ayat 234 sebelumnya yang memerintahkan agar wanita yang ditinggal wafat suami menunggu selama empat bulan sepuluh hari. Adapun nafkah yang berupa tempat tinggal, maka menurut Imam Syafi'i rahimahullah tidak dimansukh. Catatan: Menurut sebagian ulama, ayat di atas tidak dimansukh oleh ayat 234. Bahkan ayat 234 menunjukkan wajibnya wanita yang ditinggal wafat suami menjalani massa 'iddah empat bulan sepuluh hari, selebihnya sampai setahun adalah sunat yang dianjurkan dilakukan untuk menyempurnakan hak suami. Alasan lebih dari empat bulan sepuluh hari adalah sunat adalah karena peniadaan dosa bagi wali jika si wanita pindah sebelum sempurna setahun. Jika tetap di rumah suami sampai setahun adalah wajib, tentu tidak akan ditiadakan dosa. Oleh para ahli waris. Seperti berhias dan tidak berkabung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 240",
    "description": "Usai sejenak mengingatkan manusia agar tidak melalaikan salat karena persoalan keluarga, pada ayat ini Allah kembali menjelaskan hukum keluarga. Dan orang-orang yang akan mati, baik karena sudah renta maupun sakit menahun, di antara kamu, wahai para suami, dan kamu meninggalkan istri-istri, hendaklah ia sebelum meninggal dunia membuat wasiat untuk istri-istrinya untuk tetap tinggal di rumah, juga berpesan kepada anak-anak dan saudara-saudaranya agar memberi mereka nafkah berupa sandang dan pangan, paling tidak sampai setahun sejak suami wafat tanpa seorang pun boleh mengeluarkannya atau mengusirnya dari rumah itu. Tetapi jika mereka, yakni istri yang ditinggal mati suaminya, sebelum setahun keluar sendiri dari rumah tersebut untuk pindah ke tempat lain, maka tidak ada dosa bagimu, wahai para wali atau siapa saja, mengenai apa yang mereka lakukan terhadap diri mereka sendiri dalam hal-hal yang baik yang tidak melanggar syariat. Allah mahaperkasa sehingga harus ditaati, mahabijaksana dalam menetapkan hukum demi kemaslahatan hamba-Nya. Ayat ini menjelaskan hukum pemberian mut'ah bagi perempuan yang dicerai. Dan bagi perempuan-perempuan yang diceraikan, baik talak tiga (bain) maupun talak satu dan dua tetapi tidak dirujuk, sementara ia sudah dicampuri, maka hendaklah diberi mut'ah yakni pemberian suami di luar nafkah kepada istri yang ditalak tersebut menurut cara yang patut, yakni besar dan kecilnya pemberian itu disesuaikan dengan kemampuan suami, sebagai suatu kewajiban bagi orang yang bertakwa, yakni mereka yang melaksanakan segala perintah-Nya dan menjauhi segala larangan-Nya."
  }
]