[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi wanita-wanita yang diceraikan berhak akan mut'ah (pemberian) berupa sandang dan pangan yang diberikan dengan cara yang ma’ruf lagi baik menurut syariah, itu merupakan kewajiban atas orang-orang yang takut kepada Allah dan bertakwa kepada Nya dalam menjalankan perintah dan menjauhi larangan Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "241. Wanita-wanita yang ditalak berhak mendapatkan pemberian berupa pakaian, harta (uang) dan lain-lain secara wajar sesuai kondisi suami, baik sedikit ataupun banyak untuk mengobati perasaannya yang hancur karena perceraian. Ketentuan hukum ini merupakan keharusan bagi orang yang bertakwa kepada Allah -Ta'ālā- dengan cara menjalankan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "241. Dan istri yang ditalak -secara umum baik itu yang ditalak setelah berjima’ dengan suaminya maupun yang belum- berhak mendapat mut’ah berupa pakaian dan nafkah yang baik sesuai dengan kemampuan suami. Mut’ah ini wajib atas setiap orang bertakwa yang takut kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "241. وَلِلْمُطَلَّقٰتِ مَتٰعٌۢ (Kepada wanita-wanita yang diceraikan (hendaklah diberikan oleh suaminya) mut’ah) Terdapat pendapat mengatakan mut’ah (pemberian/hadiah) hukumnya wajib untuk setiap yang ditalak. Dan pendapat lain mengatakan ayat ini mencakup mut’ah yang wajib yaitu untuk wanita yang ditalak sebelum dipergauli oleh suaminya dan sebelum ditentukan maharnya, adapun mut’ah yang tidak wajib yaitu untuk wanita yang ditalak yang selain sebelumnya maka hukumnya sunnah. Ibnu Umar berkata: mut’ah itu diperuntukkan bagi setiap wanita yang dicerai kecuali yang diceraikan sebelum dipergauli maka cukup baginya separuh mahar sebagai mut’ahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "241. Umumnya bagi wanita-wanita yang ditalak baik yang sudah digauli atau yang belum digauli itu mut’ah wajib atau mut’ah yang disenangi. Dikatakan bahwa maksudnya adalah nafkah pada masa iddah, sesuai kemampuan suami sebagai hak yang ditetapkan atas orang-orang yang bertakwa.Ibnu Zaid berkata: “Ketika ayat {Wamatti’uuhunna ..} turun seorang laki-laki berkata “Jika aku berbaik hati, maka aku akan melakukannya, dan jika aku tidak menghendaki itu, maka aku tidak akan melakukannya” lalu Allah menurunkan ayat {Wa lil muthallaqaati mataa’ ..}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi istri-istri yang diceraikan itu terdapat hak mut‘ah dengan cara yang patut. Itu adalah ketentuan bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "241-242. Setelah Allah menjelaskan pada ayat sebelumnya tentang pemberian yang harus diberikan kepada seorang wanita yang ditinggal mati suaminya, Allah menyebutkan dalam ayat ini bahwa setiap wanita yang diceraikan oleh suaminya harus diberikan pemberian tersebut yang disesuaikan dengan kondisi suaminya dan kondisi wanita tersebut, dan bahwa hal itu adalah hak yang hanya ditunaikan oleh orang-orang yang bertakwa. Itu adalah diantara sifat dan karakter taqwa yang wajib atau yang sunnah. Apabila seorang wanita belum ditetapkan maharnya dan belum digauli lalu diceraikan oleh suaminya, maka telah lewat hukumnya, yaitu wajib atau suaminya pemberian itu sesuai dengan kelapangan maupun kesulitannya, dan apabila telah ditetapkan maharnya, maka pemberian untuknya adalah setengah dari mahar tersebut. Dan apabila telah dicampuri, maka pemberian itu menurut kebanyakan para ulama adalah sunnah saja, namun ada beberapa ulama yang mewajibkannya dengan dasar FirmanNya, “sebagai suatu kewajiban bagi orang-orang yang bertakwa.” Dan pada dasarnya hak itu adalah wajib, terlebih bila disandarkan kepada orang-orang yang bertakwa dan pada dasarnya ketakwaan itu adalah wajib. Ketika Allah menjelaskan hukum-hukum yang mulia ini di antara suami istri, Allah memuji hukum-hukumNya tersebut, penjelasanNya tentang hukum-hukum tersebut dan peneranganNya terhadapnya, kesesuaiannya dengan akal yang sehat dan bahwasanya maksud dari penjelasan tentang hal itu bagi hamba-hambaNya adalah agar mereka memahami apa yang dijelaskan olehNya sehingga mereka mengerti tentangnya dengan hafalan, pemahaman, dan pengamalannya, karena itu adalah diantara kesempurnaan pemahaman terhadapnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مَتَٰعُۢ بِٱلۡمَعۡرُوفِۖ } Matâ’an bil ma’ruf: Yaitu memberikan sesuatu (mut’ah) secara tidak berlebihan atau mengurangi. { حَقًّا } Haqqan: Wajib bagi suami yang bertakwa apabila menceraikan istrinya. Makna ayat: nilah makna firman Allah pada ayat 240. Apabila wanita yang menjalani masa ‘iddah itu telah selesai dari ‘iddahnya, maka ia boleh berdandan dan bersiap untuk menerima pinangan untuk menikah lagi. Kemudian Allah Ta’ala yang Maha Perkasa lagi Maha Bijaksana menutup ayat ini dengan petunjuk bahwa wasiat ini merupakan hal yang wajib untuk dilaksanakan. Pada ayat kedua (241) “Kepada wanita-wanita yang diceraikan (hendaklah diberikan oleh suaminya) mut’ah menurut yang ma’ruf, sebagai suatu kewajiban bagi orang yang takwa.” Berisi penjelasan tentang hukum yang lain yaitu bahwa wanita yang diceraikan dan telah digauli oleh suaminya berhak mendapatkan harta yang diberikan oleh suami yang menceraikannya, baik berupa pakaian, kendaraan atau pembantu. Sedangkan untuk wanita yang diceraikan sebelum digauli dan sebelum ditetapkan maharnya maka baginya harta mut’ah yang wajib diterimanya karena itu yang ia miliki, adapun wanita yang diceraikan sebelum digauli dan tetah ditetapkan maharnya maka ia mendapatkan setengah mahar, tidak ada yang lain. Bagi wanita yang diceraikan setelah digauli dan inilah yang dimaksud dalam ayat ini, baginya mendapatkan harta mut’ah dengan cara ma’ruf, baik menurut pendapat yang mewajibkannya atau menganggapnya sunnah karena ia telah mendapatkan maharnya secara sempurna. Pelajaran dari ayat: • Hak bagi wanita yang diceraikan dan sudah digauli adalah mendapatkan mut’ah (harta) dengan cara yang ma’ruf. • Anugerah dari Allah terhadap umat ini dengan menjelaskan hukum-hukumNya agar mereka mendapatkan kebahagiaan di dunia dan akhirat, maka bagi Nya pujian dan syukur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 241: Ketahuilah bahwasannya hak mutlak atas suami adalah bersenang-senang dengan harta atau pakaian dan semisalnya sesuai kadar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mut'ah (pemberian) ialah sesuatu yang diberikan oleh suami kepada istri yang diceraikannya sebagai penghibur, selain nafkah sesuai dengan kemampuannya. Mut'ah ini wajib diberikan kepada wanita yang ditalak sebelum dicampuri. Ada pula yang berpendapat bahwa mut'ah wajib diberikan kepada semua wanita yang ditalak berdasarkan keumuman ayat ini. Namun karena ada ka'idah \"Hamlul mutlak 'alal muqayyad\" (membawa yang mutlak kepada yang muqayyad), di mana pada ayat sebelumnya sudah diterangkan lebih rinci bahwa Allah Subhaanahu wa Ta'aala mewajibkan mut'ah kepada wanita yang ditalak sebelum ditentukan mahar dan sebelum dicampuri saja, maka inilah yang dipakai. Sesuai kemampuan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 241",
    "description": "Ayat ini menjelaskan hukum pemberian mut'ah bagi perempuan yang dicerai. Dan bagi perempuan-perempuan yang diceraikan, baik talak tiga (bain) maupun talak satu dan dua tetapi tidak dirujuk, sementara ia sudah dicampuri, maka hendaklah diberi mut'ah yakni pemberian suami di luar nafkah kepada istri yang ditalak tersebut menurut cara yang patut, yakni besar dan kecilnya pemberian itu disesuaikan dengan kemampuan suami, sebagai suatu kewajiban bagi orang yang bertakwa, yakni mereka yang melaksanakan segala perintah-Nya dan menjauhi segala larangan-Nya demikianlah Allah menerangkan kepadamu ayat-ayat-Nya agar kamu mengerti. Penutup ayat ini seakan memberi jawaban atas pertanyaan apakah ada ketentuan agama menyangkut pemberian, selain harta waris' jawabannya, ada, yaitu memberikan sesuatu sebagai penghibur bagi perempuan yang dicerai karena istri yang dicerai hidup keadaannya seperti ditinggal mati."
  }
]