[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dengan keterangan jelas seperti ini dalam hukum-hukum terkait anak-anak dan istri, Allah menjelaskan kepada kalian ayat-ayat dan hukum-hukum Nya dalam seluruh hal yang kalian perlukan dalam kehidupan kalian di dunia, dan tempat kembali kalian di akhirat. Agar kalian dapat memahami dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "242. Seperti penjelasan tersebut di atas, Allah menjelaskan kepadamu -wahai orang-orang mukmin- ayat-ayat-Nya yang berisi batas-batas dan hukum-hukum-Nya, agar kalian memahami dan mengamalkannya, sehingga kalian akan mendapatkan kebahagiaan hidup di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "242. sebagaimana penjelasan yang jelas tersebut, demikianlah Allah menjelaskan bagi kalian hukum-hukum syariat, agar kalian dapat memahami dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "242. Seperti penjelasan itulah Allah menerangkan kepada kalian ketentuan-ketentuan syariatNya dalam beribadah dan bermuamalah supaya kalian menyadari hikmah dari aturan yang ditetapkan dan mengerjakan sesuatu yang diperintahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Allah menerangkan kepada kalian ayat-ayatNya agar kalian berpikir."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "241-242. Setelah Allah menjelaskan pada ayat sebelumnya tentang pemberian yang harus diberikan kepada seorang wanita yang ditinggal mati suaminya, Allah menyebutkan dalam ayat ini bahwa setiap wanita yang diceraikan oleh suaminya harus diberikan pemberian tersebut yang disesuaikan dengan kondisi suaminya dan kondisi wanita tersebut, dan bahwa hal itu adalah hak yang hanya ditunaikan oleh orang-orang yang bertakwa. Itu adalah diantara sifat dan karakter taqwa yang wajib atau yang sunnah. Apabila seorang wanita belum ditetapkan maharnya dan belum digauli lalu diceraikan oleh suaminya, maka telah lewat hukumnya, yaitu wajib atau suaminya pemberian itu sesuai dengan kelapangan maupun kesulitannya, dan apabila telah ditetapkan maharnya, maka pemberian untuknya adalah setengah dari mahar tersebut. Dan apabila telah dicampuri, maka pemberian itu menurut kebanyakan para ulama adalah sunnah saja, namun ada beberapa ulama yang mewajibkannya dengan dasar FirmanNya, “sebagai suatu kewajiban bagi orang-orang yang bertakwa.” Dan pada dasarnya hak itu adalah wajib, terlebih bila disandarkan kepada orang-orang yang bertakwa dan pada dasarnya ketakwaan itu adalah wajib. Ketika Allah menjelaskan hukum-hukum yang mulia ini di antara suami istri, Allah memuji hukum-hukumNya tersebut, penjelasanNya tentang hukum-hukum tersebut dan peneranganNya terhadapnya, kesesuaiannya dengan akal yang sehat dan bahwasanya maksud dari penjelasan tentang hal itu bagi hamba-hambaNya adalah agar mereka memahami apa yang dijelaskan olehNya sehingga mereka mengerti tentangnya dengan hafalan, pemahaman, dan pengamalannya, karena itu adalah diantara kesempurnaan pemahaman terhadapnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman Allah Ta’ala pada ayat ketiga (242) “Demikianlah Allah menerangkan kepadamu ayat-ayatNya (hukum-hukumNya) supaya kamu memahaminya.” Maknanya seperti inilah penjelasan mengenai hukum-hukum thalaq, khulu’, radha’ (persusuan) dan masa ‘iddah serta mut’ah (pemberian). Allah Ta’ala menjelaskan kepada kita ayat-ayat Nya yang mengandung hukum syariat agar dapat kita pahami dan kita amalkan sehingga dapat menyempurnakan kita dan memberikan kebahagiaan dalam kehidupan dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 242: Kemudian ketahuilah bahwasannya setiap hukum – hukum yang dijelaskan kepada kalian agar supaya kalian mengetahuinya serta berfikir dan beramal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga dapat diamalkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 242",
    "description": "Demikianlah Allah menerangkan kepadamu ayat-ayat-Nya agar kamu mengerti. Penutup ayat ini seakan memberi jawaban atas pertanyaan apakah ada ketentuan agama menyangkut pemberian, selain harta waris' jawabannya, ada, yaitu memberikan sesuatu sebagai penghibur bagi perempuan yang dicerai karena istri yang dicerai hidup keadaannya seperti ditinggal mati. Pada ayat ini Allah menegaskan bahwa tidak ada seorang pun bisa lari dari takdir Allah. Tidakkah kamu memperhatikan, yakni mendengar kisah orang-orang yang keluar dari kampung halamannya, sedang jumlahnya ribuan karena takut mati' padahal rasulullah melarang seseorang untuk keluar dari daerahnya yang terjangkit wabah penyakit. 7 lalu apabila Allah berfirman kepada mereka, matilah kalian! pasti kalian akan mati tanpa bisa menghindar, karena hidup dan mati ada di tangan-Nya, dan kematian pasti datang meski tanpa sebab. Kemudian Allah menghidupkan mereka, artinya mereka terselamatkan dari musuh karena sebagian mereka ada yang ingin maju berjihad. Inilah karunia Allah. Sesungguhnya Allah memberikan karunia, yakni pemberian lebih, kepada manusia, tetapi kebanyakan manusia tidak bersyukur, karena ketidakmampuan manusia memahami jenis-jenis nikmat yang dianugerahkan Allah."
  }
]