[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak tahu (wahai Rasul) kisah orang-orang yang lari meninggalkan tanah kelahiran dan tempat tinggal mereka, sedang jumlah mereka itu beribu-ribu orang banyaknya, lantaran takut kematian akibat wabah tha’un atau peperangan. Maka Allah berfirman kepada mereka: “Matilah kalian”. Maka mereka mati semua sekaligus dalam sekejap saja sebagai hukuman atas lari mereka dari takdir Allah. Tak lama kemudian Allah ta'ala menghidupkan mereka, supaya mereka menyempurnakan ajal mereka yang telah ditentukan sebelumnya, agar mereka mengambil pelajaran dan mau bertobat?. Sesungguhnya Allah mempunyai karunia agung bagi sekalian manusia dan curahan nikmat-nikmat Nya yang melimpah, akan tetapi kebanyakan manusia tidak mensyukuri karunia Allah kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "243. Apakah engkau belum tahu -wahai Nabi- kabar tentang orang-orang yang keluar dari rumah mereka, dan jumlah mereka sangat banyak, karena takut mati akibat wabah penyakit atau lainnya, yaitu satu kelompok orang dari Bani Israil? Lalu Allah berfirman kepada mereka, “Matilah kalian!” Maka mereka semua mati. Kemudian Allah menghidupkan mereka kembali untuk menjelaskan kepada mereka bahwa segala sesuatu itu berada di tangan Allah -Subḥānahu-, dan mereka tidak mampu mendatangkan manfaat bagi diri mereka sendiri dan tidak kuasa menolak mudarat. Sesungguhnya Allah benar-benar Pemurah dan Pemberi karunia kepada manusia, tetapi kebanyakan manusia tidak bersyukur kepada Allah atas nikmat-nikmat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "243. Hai Rasulullah, tidakkah kamu telah mendengar berita tentang ribuan orang yang lari dari negeri mereka karena takut dari hal yang dapat menyebabkan kematian, namun mereka tidak pula dapat selamat darinya. Allah mematikan mereka semua, kemudian dengan karunia-Nya Dia menghidupkan mereka kembali. Sungguh Allah Maha Memiliki karunia dan keutamaan, dan bagian dari karunia-Nya adalah menghidupkan mereka kembali setelah kematian dan menjadikan mereka pelajaran bagi orang lain, namun sebagian besar manusia tidak bersyukur kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "243. أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا۟ مِن دِيٰرِهِمْ (Apakah kamu tidak memperhatikan orang-orang yang ke luar dari kampung halaman mereka) Dari Ibnu Abbas ia berkata: mereka jumlahnya 14.000 orang yang keluar dari kampung mereka karena lari dari penyakit tha’un. Mereka berkata: kita akan menuju tempat yang tidak terdapat kematian didalamnya hingga mereka sampai di tempat ini dan ini maka Allah berkata kepada mereka: “Matilah kalian!” dan merekapun mati semuanya. Kemudian salah seorang Nabi melewati mereka dan berdoa kepada Rabbnya agar menghidupkan mereka agar mereka menyembah-Nya; maka Allah menghidupkan mereka. وَهُمْ أُلُوفٌ (sedang mereka beribu-ribu (jumlahnya) ) Yakni sangat banyak. حَذَرَ الْمَوْتِ (karena takut mati) Yakni takut pada Tha’un. فَقَالَ لَهُمُ اللَّـهُ مُوتُوا۟ (maka Allah berfirman kepada mereka: “Matilah kamu” ) Ini merupakan perintah kauniy. Maka mereka pun mati. ثُمَّ أَحْيٰهُمْ ۚ إِنَّ اللَّـهَ لَذُو فَضْلٍ عَلَى النَّاسِ (kemudian Allah menghidupkan mereka. Sesungguhnya Allah mempunyai karunia terhadap manusia) Yakni menghidupkan mereka semua. Adapun mereka yang keluar dari kampung mereka adalah agar mereka mengambil pelajaran karena Allah telah menghidupkan mereka. Adapun orang yang diajak bicara oleh ayat ini Allah telah memberi petunjuk kepada mereka agar mengambil ibrah dari kisah ini, agar mengetahui bahwa Allah berkuasa atas segala sesuatu. Da Dan tujuan diceritakannya kisah ini adalah sebagai penyemangat kaum muslimin untuk berjihad; karena takut dari kematian dan meninggalkan jihad karena hal tersebut tidak akan menyelamatkan mereka dari kematian apabila Allah sudah berkehendak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "243. Apakah kabar tentang kaum itu belum sampai kepadamu, wahai Nabi. Mereka adalah ribuan pengecut. Mereka lari dari musuh meskipun jumlah mereka banyak, karena takut mati, Lalu Allah mematikan mereka, kemudian menghidupkan mereka. Sesungguhnya Allah itu pemilik keutamaan agung atas seluruh manusia dengan membimbing mereka menuju jalan kemuliaan dan penuh pertolongan, namun kebanyakan manusia, yaitu orang-orang kafir itu tidak mau bersyukur kepada Allah atas nikmatNya. Al-Hadfu adalah pemberian motivasi terhadap orang-orang muslim untuk berjihad. Ibnu Abbas berkata: “Mereka itu berjumlah 4000, mereka melarikan diri dari wabah penyakit, dan berkata: “Kami akan menghampiri tanah yang tidak ada kematian di dalamnya” sampai ketika mereka tiba di suatu tempat Allah berfirman kepada mereka: “Matilah kalian semua” lalu mereka mati. Lalu seorang nabi melewati mereka dan berdoa kepada Tuhan untuk menghidupkan mereka sehingga mereka bisa menyembahNya, lalu Allah menghidupkan mereka”. Sebagian orang modern meriwayatkan bahwa ketika gunung itu mematikan para pengecut itu, tampaklah seorang kekasih Allah di antara mereka, lalu gunung itu meletus dan menghancurkan musuhnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan} tidakkah kamu tahu {orang-orang yang keluar dari kampung halamannya dalam jumlah ribuan karena takut mati} takut mati, melarikan diri dari wabah {Lalu Allah berfirman kepada mereka,“Matilah kalian!” Kemudian, Allah menghidupkan mereka. Sesungguhnya Allah Pemberi karunia kepada manusia, tetapi kebanyakan manusia tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "243. Maksudnya, tidakkah anda mendengar tentang kisah yang mengherankan ini, yang terjadi pada orang-orang sebelum kalian dari Bani Israil? di mana telah berjangkit wabah penyakit di negeri mereka hingga mereka melarikan diri darinya dalam jumlah yang besar seperti itu demi menghindar dari kematian. Akan tetapi pelarian itu tidaklah menyelamatkan mereka dari kematian dan tidaklah berguna bagi mereka tindakan menghindari apa yang mereka takutkan. Allah justru menimpakan pada mereka hal yang bertentangan dengan maksud mereka, yaitu Allah mematikan mereka hingga orang yang terakhir dari mereka, kemudian dengan kemuliaanNya terhadap mereka Allah menghidupkan mereka kembali. Hal itu karena doa dari seorang nabi seperti yang disebutkan oleh sebagian besar ahli tafsir atau selainnya. Yang jelas itu tetap merupakan kebajikan dan kemuliaan Allah, Dia akan selalu memberi karuniaNya kepada manusia. Dan itu mengharuskan adanya sikap syukur mereka terhadap nikmat nikmat Allah dengan pengakuan akan nikmat tersebut dan pemanfaatannya pada apa-apa yang diridhai Allah. Walaupun demikian banyak sekali manusia yang telah lalai dari kewajiban bersyukur ini. Dalam ayat ini ada pelajaran yang penting yaitu bahwa Allah maha kuasa atas adanya segala sesuatu, dan hal itu adalah suatu tanda yang konkrit atas adanya kebangkitan kembali kelak, karena kisah ini sangat terkenal dan diriwayatkan dengan riwayat yang Mutawatir di kalangan Bani Israil dan orang yang berhubungan dengan mereka. Oleh karena itu Allah menyebutkannya dengan kalimat bentuk perintah yang telah terbiasa diantara orang-orang yang menjadi alamat perkataan itu. Kemungkinan lain bahwa mereka yang melarikan diri dari negerinya itu karena takut dari musuh dan pengecut untuk menghadapinya. Ini dikuatkan dengan kenyataan bahwa Allah menyebutkan setelah itu perintah untuk berperang dan mengabarkan tentang Bani Israil bahwa mereka diusir dari negeri mereka dan anak-anak mereka. Terlepas dari kedua kemungkinan itu, makna melarikan diri adalah sebuah anjuran untuk berjihad dan ancaman agar tidak meninggalkannya dan bahwa lari darinya tidaklah berguna sama sekali untuk menghindari kematian. Firman Allah : \"Katakanlah: “Sekiranya kamu berada di rumahmu, niscaya orang-orang yang telah ditakdirkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh\" QS Ali Imron ayat 154"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَلَمۡ تَرَ } Alam tara: Sudah sampaikah ilmu kepadamu, sudahkah kamu melihatnya. Penglihatan yang dimaksud adalah penglihatan batin, dan kalimat tanya digunakan untuk menimbulkan ketakjuban. { أُلُوفٌ } Ulûf: Bentuk jamak dari alfun, digunakan untuk menunjukkan banyak. Jadi jumlahnya puluhan ribu. Makna ayat: Pada ayat ini Allah Ta’ala mengajak bicara rasulNya dengan pertanyaan Sudahkah sampai ilmu kepadamu tentang kisahnya orang-orang yang keluar dari rumah-rumah mereka untuk lari dari kematian, dan mereka jumlahnya puluhan ribu. Mereka adalah penduduk dari salah satu kota dari kota-kota yang ditinggali bani Israil. Allah Ta’ala menimpakan penyakit Tha’un dan mereka lari dari kematian. Maka Allah mematikan mereka dan kemudian menghidupkan mereka kembali dengan doa Nabi Hizqil ‘alaihissalam. Apakah pelarian mereka itu dapat menyelamatkannya dari kematian, maka begitu juga orang-orang yang lari dari peperangan apakah pelariannya dapat menyelamatkannya dari kematian? Jawabannya adalah tidak. Oleh karena itu, untuk apa berlari dari jihad yang telah ditentukan? Dalam perkara mematikan mereka dan menghidupkannya terdapat keutamaan yang besar dari Allah, akan tetapi kebanyakan manusia tidak bersyukur. Pelajaran dari ayat: • Apabila turun suatu wabah di suatu tempat, tidak boleh untuk keluar dari tempat tersebut. Inilah ketentuan dari sunnah nabi. • Kewajiban untuk mengingat nikmat Allah dan mensyukurinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 243: Allah berfirman kepada nabiNya: bukankah engkau mengetahui wahai nabi Allah mereka yang lari dari negeri mereka serta rumah-rumah mereka karena sebab mereka takut binasa dari wajah penyakit thoun yang muncul ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan kisah ini adalah untuk menyemangatkan kaum muslimin dalam berperang. Oleh karena itu, setelah ayat ini disebutkan perintah berperang di jalan Allah. Karena penyakit tha'un atau karena perang. Dalam tafsir Al Jalalain disebutkan bahwa mereka adalah salah satu kaum Bani Israil, di mana negeri mereka terserang penyakit tha'un, lalu mereka melarikan diri karena takut mati, maka Allah mematikan mereka sebagai hukuman bagi mereka karena melarikan diri dari qadar Allah. Kemudian setelah delapan hari atau lebih, mereka dihidupkan kembali oleh Allah dengan do'a nabi mereka Hizqail, wallahu a'lam. Hal tersebut merupakan rahmat, kelembutan dan santunnya Allah Subhaanahu wa Ta'aala kepada manusia, sekaligus bukti bahwa Allah mampu menghidupkan yang telah mati. Untuk disempurnakan ajalnya dan agar mereka mengambil pelajaran serta bertobat. Di antaranya adalah dihidupkan-Nya mereka setelah matinya dan diarahkan-Nya mereka kepada yang terbaik. Nikmat yang diberikan bukan menambah mereka bersyukur, bahkan nikmat-nikmat tersebut seringnya mereka gunakan untuk maksiat kepada Allah. Sedikit sekali di antara mereka yang bersyukur; mengenal nikmat tersebut dan menggunakannya untuk ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 243",
    "description": "Pada ayat ini Allah menegaskan bahwa tidak ada seorang pun bisa lari dari takdir Allah. Tidakkah kamu memperhatikan, yakni mendengar kisah orang-orang yang keluar dari kampung halamannya, sedang jumlahnya ribuan karena takut mati' padahal rasulullah melarang seseorang untuk keluar dari daerahnya yang terjangkit wabah penyakit. 7 lalu apabila Allah berfirman kepada mereka, matilah kalian! pasti kalian akan mati tanpa bisa menghindar, karena hidup dan mati ada di tangan-Nya, dan kematian pasti datang meski tanpa sebab. Kemudian Allah menghidupkan mereka, artinya mereka terselamatkan dari musuh karena sebagian mereka ada yang ingin maju berjihad. Inilah karunia Allah. Sesungguhnya Allah memberikan karunia, yakni pemberian lebih, kepada manusia, tetapi kebanyakan manusia tidak bersyukur, karena ketidakmampuan manusia memahami jenis-jenis nikmat yang dianugerahkan Allah. Usai menjelaskan bahwa kematian pasti akan tiba, pada ayat ini Allah mengikutinya dengan penjelasan tentang salah satu sebab kematian, yakni terbunuh dalam peperangan. Dan berperanglah kamu di jalan Allah ketika situasi menuntut demikian, dan ketahuilah bahwa Allah maha mendengar apa yang kamu katakan, maha mengetahui apa yang kamu sembunyikan dalam hati, seperti keinginan untuk tidak turut berperang."
  }
]