[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan perangilah (wahai orang-orang muslim) orang-orang kafir itu demi menolong agama Allah. Dan ketahuilah bahwa sesungguhnya Allah maha mendengar ucapan-ucapan kalian, lagi maha mengetahui niat-niat dan perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "244. Dan perangilah -wahai orang-orang mukmin- musuh-musuh Allah untuk membela agama-Nya dan menjunjung tinggi kalimat-Nya. Dan ketahuilah bahwa Allah Maha Mendengar ucapan kalian lagi Maha Mengetahui niat dan perbuatan kalian, dan akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "244. Setelah pelajaran yang Allah berikan ini, Dia memerintahkan orang-orang beriman untuk berperang demi membela agama-Nya. Dan berjihad di jalan Allah tidak dapat mendekatkan atau menjauhkan ajal. Kemudian Allah menekankan hukum ini dengan menyatakan bahwa Dia Maha Mendengar perkataan mereka dan Maha Mengetahui perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "244. Wahai orang-orang muslim, berperanglah untuk meninggikan kalimat Allah. Dan ketahuilah bahwa Allah itu Maha Mendengar doa kalian dan Maha Mengetahui urusan dan keadaan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berperanglah di jalan Allah dan ketahuilah bahwa Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "244-245. Allah menggabungkan antara perintah berperang dijalanNya dengan harta dan anggota badan (jiwa), karena jihad itu tidaklah akan tegak kecuali dengan kedua perkara tersebut. Lalu Allah menganjurkan untuk ikhlas dalam melakukannya yaitu seorang hamba berperang hanya untuk meninggikan kalimat Allah, karena sesungguhnya Allah “maha mendengar” segala perkataan walaupun tersembunyi, “lagi maha mengetahui” segala hal yang diliputi hati berupa niat yang baik ataupun lawannya. Dan juga bila seorang Mujahid di jalan Allah mengetahui bahwasanya Allah itu maha mendengar lagi Maha Mengetahui, pastilah perkara jihad itu akan ringan dalam pandangannya dan ia mengetahui bahwa dengan dirinya sendiri orang-orang yang tegar sekalipun sekalipun tidak dapat bersabar untuk jihad dan bahwa pastilah mereka harus dibantu dengan pertolonganNya dan kelembutanNya. Perhatikanlah anjuran yang lembut ini untuk memberi nafkah, dan bahwasanya orang yang menafkahkan hartanya sesungguhnya Dia memberi pinjaman kepada Allah yang Maha kaya lagi maha mulia, dan Allah menjadikan baginya balasan berlipat ganda yang melimpah sebagaimana Allah berfirman: \"Perumpamaan (nafkah yang dikeluarkan oleh) orang-orang yang menafkahkan hartanya di jalan Allah adalah serupa dengan sebutir benih yang menumbuhkan tujuh bulir, pada tiap-tiap bulir seratus biji. Allah melipat gandakan (ganjaran) bagi siapa yang Dia kehendaki. Dan Allah Maha Luas (karunia-Nya) lagi Maha Mengetahui.\" QS al-baqarah ayat 261 Ketika penghalang terbesar untuk berinfak adalah takut kemiskinan, Allah mengabarkan bahwa kekayaan dan kemiskinan itu berada di tangan Allah, dan bahwa Dia menahan rezeki dari siapa yang dikehendakiNya dan memberikannya kepada siapa yang dikehendakiNya. Maka janganlah menunda-nunda wahai orang yang hendak berinfak karena takut akan kemiskinan, dan janganlah ia berpikir bahwa hartanya itu hilang begitu saja, namun tempat kembali seluruh hamba adalah kepada Allah, lalu orang-orang yang berinfak dan beramal akan mendapatkan pahala mereka tersimpan di sisiNya untuk suatu kebutuhan yang paling mereka butuhkan dan memiliki kepentingan begitu besar yang tidak mungkin dapat diungkapkan oleh kata-kata. Maksud dari pinjaman yang baik adalah perkara yang menyatukan dengan sifat dan ciri kebajikan dari niat yang shalih, kelapangan dada dalam berinfak, dan tepat sasarannya, dan orang yang berinfak itu tidak mengiringinya dengan mengungkit-ungkit nya dan tidak pula perkataan yang menyakitkan, tidak membatalkannya dan tidak pula menguranginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فِي سَبِيلِ ٱللَّهِ } Fî sabîlillâh: Jalan yang mengantarkan kepada keridhaanNya, yaitu ketaatan kepadaNya dengan melaksanakan perintah Nya dan menjauhi laranganNya, di antaranya adalah berjihad melawan orang kafir dan zhalim sampai tidak timbul fitnah. Makna ayat: Maka berperanglah wahai orang-orang muslim di jalan Allah dan jangan sampai tertinggal kapan saja kalian dipanggil untuk berangkat jihad baik dengan jiwa ataupun harta. Ketahuilah bahwa Allah Ta’ala Maha mendengar ucapan kalian dan Maha mengetahui niat-niat kalian maka waspadalah. Pelajaran dari ayat: • Kewajiban untuk berperang di jalan Allah apabila telah diwajibkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 244: Allah menasehati hamba-hamba yang beriman untuk berjihad dijalan Allah mengakkan kalimatullah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk membela dan meninggikan agama Allah. Oleh karena itu, perbaikilah niat, carilah keridhaan Allah dan ketahuilah bahwa berdiam diri tidak berperang bukanlah cara untuk menjaga kehidupan dan menyelamatkan diri sebagaimana dalam kisah orang-orang yang yang pergi melarikan diri karena takut mati, ternyata mereka ditimpa kematian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 244",
    "description": "Usai menjelaskan bahwa kematian pasti akan tiba, pada ayat ini Allah mengikutinya dengan penjelasan tentang salah satu sebab kematian, yakni terbunuh dalam peperangan. Dan berperanglah kamu di jalan Allah ketika situasi menuntut demikian, dan ketahuilah bahwa Allah maha mendengar apa yang kamu katakan, maha mengetahui apa yang kamu sembunyikan dalam hati, seperti keinginan untuk tidak turut berperang. Barang siapa mau meminjami atau menginfakkan hartanya di jalan Allah dengan pinjaman yang baik berupa harta yang halal disertai niat yang ikhlas, maka Allah akan melipatgandakan ganti atau balasan kepadanya dengan balasan yang banyak dan berlipat sehingga kamu akan senantiasa terpacu untuk berinfak. Allah dengan segala kebijaksanaannya akan menahan atau menyempitkan dan melapangkan rezeki kepada siapa saja yang dikehendaki-Nya, dan kepada-Nyalah kamu dikembalikan pada hari kebangkitan untuk mendapatkan balasan yang setimpal dan sesuai dengan apa yang diniatkan."
  }
]