[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Siapa gerangan yang mau membelanjakan infak yang baik di jalan Allah dan mengharapkan pahala, maka Dia melipatgandakan nya dengan penggandaan yang banyak yang tidak terhitung yang berupa pahala dan balasan yang baik? Dan Allah menyempitkan dan meluaskan rezeki, maka keluarkanlah infaq dan jangan tanggung-tanggung, karena sesungguhnya Dia Maha Pemberi Rizki, Dia menyempitkan bagi hamba-hamba Nya yang dikehendaki Nya dalam hal rezeki dan melapangkan bagi orang lain. Bagi Nya hikmah yang tinggi dalam hal itu, dan kepada Nya saja kalian akan dikembalikan setelah kematian, lalu Dia memberikan balasan kepada kalian atas amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "245. Siapakah yang mau berbuat seperti orang yang meminjamkan hartanya, lalu dia infakkan hartanya di jalan Allah dengan niat yang baik dan hati yang tulus, supaya harta itu kembali kepadanya dengan berlipat ganda. Sedangkan Allah dapat menyempitkan rezeki, kesehatan dan lain-lain dan dapat melapangkan itu semua dengan kebijaksaan dan keadilan-Nya. Dan hanya kepada Allah lah kamu akan dikembalikan di akhirat, kemudian Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "245. Karena jihad di jalan Allah membutuhkan bekal, maka Allah membuat dorongan untuk berinfak di jalan-Nya, dan menyiapkan balasannya dengan pahala yang besar. Allah Maha Pemberi Rezeki, menyempitkan dan meluaskan rezeki siapa yang Dia kehendaki. Dan kepada-Nya kalian akan dikembalikan pada hari kiamat untuk mendapat balasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "245. مَّن ذَا الَّذِى يُقْرِضُ اللَّـهَ (Siapakah yang mau memberi pinjaman kepada Allah) Ketika Allah memerintahkan untuk berperang dan berjihad Allah juga memerintahkan untuk berinfak dijalannya. Istilah memberi pinjaman kepada Allah adalah sebagai perumpamaan, yang mana pelakunya telah mendahulukan amal shaleh yang menjadikannya berhak mendapatkan pahala. حَسَنًا (yang baik) Yakni dengan jiwa yang bersih tanpa mengungkit-ungkit pemberian dan tanpa menyakiti perasaan si penerima. فَيُضٰعِفَهُۥ لَهُۥٓ (maka Allah akan meperlipat gandakan pembayaran kepadanya) Yakni menjadikan banyak dan menumbuhkannya sampai menjadi seperti yang asli. أَضْعَافًا كَثِيرَةً ۚ وَاللَّـهُ يَقْبِضُ وَيَبْصُۜطُ (dengan lipat ganda yang banyak) (القبض) yakni mengurangi rezeki, sedangkan (البسط) yakni meluaskan. Dalam hal ini terdapat ancaman bahwa yang berbuat bakhil untuk meluaskan hartanya maka ia bisa jadi diganti Allah dengan pengurangan. وَإِلَيْهِ تُرْجَعُونَ (dan kepada-Nya-lah kamu dikembalikan) Sehingga Allah dapat membalas apa yang telah kalian perbuat, dan apabila kalian bakhil maka Allah akan menyiksa kalian. Dari Ibnu Zaid ia berkata: kamu memperluas rezekimu akan tetapi kamu berat untuk keluar pergi berjihad yang tidak kau inginkan. Sedangkan Dia menyempitkan rezeki si fulan akan tetapi ia dengan senang hati pergi berjihad dan merasa ringan melakukan itu. Maka bantulah dia agar menjadi kuat dengan apa yang ada dalam genggamanmu (hartamu) agar kamu mendapat bagian (diakhirat)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا } Ayat ini memberi isyarat bahwasanya sedekah akan mengembalikan kepada pemiliknya kebaikan yang lebih besar, yaitu berupa pahala; karena Allah menyebutnya dengan { قَرْضًا } \"pinjam\" dan pinjaman haknya adalah ditutupi, dan yang diberi pinjaman adalah Allah, maka siapakah yang lebih menepati janjinya selain Allah ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "245. Jihad itu harus mengeluarkan infak, maka orang yang memberikan infak yang baik dari harta yang halal, maka Allah akan mengembangkan hartanya di dunia, dan akan memberinya pahala yang sangat banyak di akhirat. Dan Allah itu mempersempit dan meluaskan rejeki orang yang dikehendakiNya. Dan hanya kepadaNyalah kalian akan di kembalikan pada hari kiamat, dan akan membalas kalian atas amal perbuatan yang telah kalian lakukan. Ibnu Umar berkata; “Ketika ayat {Matsalulladziina yunfiquuna } turun, Rasulullah SAW berdoa: “Wahai tuhan tambahkanlah sesuatu untuk umatku” Lalu turunlah ayat {Man Dzalladzi Yuqridhu …}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang mau memberi pinjaman kepada Allah} berinfak dalam hal ketaatan kepada Allah {berupa pinjaman yang baik} infak baik yang datang dari diri sendiri {Maka Allah akan melipat gandakan baginya berkali-kali lipat. Allah menyempitkan} menyempitkan rejeki, kesehatan dan hal lainnya {dan melapangkan} dan melapangkan hal itu {hanya KepadaNyalah kalian dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "244-245. Allah menggabungkan antara perintah berperang dijalanNya dengan harta dan anggota badan (jiwa), karena jihad itu tidaklah akan tegak kecuali dengan kedua perkara tersebut. Lalu Allah menganjurkan untuk ikhlas dalam melakukannya yaitu seorang hamba berperang hanya untuk meninggikan kalimat Allah, karena sesungguhnya Allah “maha mendengar” segala perkataan walaupun tersembunyi, “lagi maha mengetahui” segala hal yang diliputi hati berupa niat yang baik ataupun lawannya. Dan juga bila seorang Mujahid di jalan Allah mengetahui bahwasanya Allah itu maha mendengar lagi Maha Mengetahui, pastilah perkara jihad itu akan ringan dalam pandangannya dan ia mengetahui bahwa dengan dirinya sendiri orang-orang yang tegar sekalipun sekalipun tidak dapat bersabar untuk jihad dan bahwa pastilah mereka harus dibantu dengan pertolonganNya dan kelembutanNya. Perhatikanlah anjuran yang lembut ini untuk memberi nafkah, dan bahwasanya orang yang menafkahkan hartanya sesungguhnya Dia memberi pinjaman kepada Allah yang Maha kaya lagi maha mulia, dan Allah menjadikan baginya balasan berlipat ganda yang melimpah sebagaimana Allah berfirman: \"Perumpamaan (nafkah yang dikeluarkan oleh) orang-orang yang menafkahkan hartanya di jalan Allah adalah serupa dengan sebutir benih yang menumbuhkan tujuh bulir, pada tiap-tiap bulir seratus biji. Allah melipat gandakan (ganjaran) bagi siapa yang Dia kehendaki. Dan Allah Maha Luas (karunia-Nya) lagi Maha Mengetahui.\" QS al-baqarah ayat 261 Ketika penghalang terbesar untuk berinfak adalah takut kemiskinan, Allah mengabarkan bahwa kekayaan dan kemiskinan itu berada di tangan Allah, dan bahwa Dia menahan rezeki dari siapa yang dikehendakiNya dan memberikannya kepada siapa yang dikehendakiNya. Maka janganlah menunda-nunda wahai orang yang hendak berinfak karena takut akan kemiskinan, dan janganlah ia berpikir bahwa hartanya itu hilang begitu saja, namun tempat kembali seluruh hamba adalah kepada Allah, lalu orang-orang yang berinfak dan beramal akan mendapatkan pahala mereka tersimpan di sisiNya untuk suatu kebutuhan yang paling mereka butuhkan dan memiliki kepentingan begitu besar yang tidak mungkin dapat diungkapkan oleh kata-kata. Maksud dari pinjaman yang baik adalah perkara yang menyatukan dengan sifat dan ciri kebajikan dari niat yang shalih, kelapangan dada dalam berinfak, dan tepat sasarannya, dan orang yang berinfak itu tidak mengiringinya dengan mengungkit-ungkit nya dan tidak pula perkataan yang menyakitkan, tidak membatalkannya dan tidak pula menguranginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يُقۡرِضُ ٱللَّهَ } Yuqridhullâh: Mengeluarkan sebagian dari hartanya dan menginfakannya untuk jihad membeli persenjataan dan memudahkan para mujahid. { يَقۡبِضُ وَيَبۡصُۜطُ } Yaqbidhu wa yabshutu: Menyempitkan dan melapangkan, maksud dari yaqbidhu adalah cobaan, dan yabsuthu adalah ujian. Makna ayat: Kemudian Allah Ta’ala membuka pintu kewajiban jihad dengan harta dengan firmanNya,”Siapakah yang mau memberi pinjaman kepada Allah, pinjaman yang baik (menafkahkan hartanya di jalan Allah).” Harta yang dikeluarkan untuk jihad tersebut tidak boleh harta yang bercampur dengan yang tidak halal dan harus dengan keridhaan pemiliknya, maka Allah akan melipatgandakannya dengan kelipatan yang banyak, satu dirham dibalas tujuh ratus kali lipatnya. Maka berinfaklah wahai orang-orang mukmin di jalan Allah, untuk meninggikan kalimat Nya, dan jangan takut kepada kefakiran karena Rabb kalian yang menyempitkan dan melapangkan rezeki; Menyempitkan rezeki hamba sebagai cobaan dan melapangkan rezekinya sebagai ujian. Apabila kalian tidak mau berinfak, maka itu tidak merubah ketentuan Allah sedikitpun. Pelajaran dari ayat: • Keutamaan berinfak di jalan Allah. • Penjelasan mengenai hikmah mengapa Allah menyempitkan dan melapangkan rezeki hamba. Yaitu sebagai cobaan untuk menguji kesabaran dan ujian untuk mau bersyukur. Sungguh merugilah orang yang tidak bersabar ketika turun cobaan berupa sempitnya rezeki dan tidak bersyukur tatkala lapang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 245: Kemudian Allah menganjurkan hambanya untuk berinfaq dijalan Allah untuk memperoleh ridho tuhannya dan menolong agamanya demi mendapatkan pahala akan hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menafkahkan hartanya di jalan Allah Dengan hati yang ikhlas dan rela. Dia melipatgandakan sepuluh kali lipat sampai tujuh ratus kali lipat, bahkan lebih tergantung keadaan orang yang berinfak, niat, manfaat dan kebutuhan terhadapnya. Oleh karena itu, berinfaklah dan jangan khawatir, karena Allah adalah Ar Razzaq (Maha Pemberi rezeki), Dia juga yang menyempitkan rezeki dan melapangkannya. Menahan diri dengan tidak berinfak bukanlah cara untuk memperbanyak harta, dan berinfak tidaklah menyempitkan harta. Bahkan infak yang dikeluarkan seseorang tidaklah sia-sia, Allah akan menggantinya dan melipatgandakannya berkali-kali lipat. Dalam ayat di atas terdapat dalil bahwa sebab tidaklah bermanfaat terhadap qadha' dan qadar, khususnya sebab-sebab yang di sana perintah-perintah Allah ditinggalkan dan di sana pun terdapat bukti bahwa Allah mampu menghidupkan yang mati. Sebagai cobaan dan ujian. Dengan dibangkitkannya mereka setelah mati menghadap Allah Rabbul 'alamin, lalu Dia memberikan balasan terhadap amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 245",
    "description": "Barang siapa mau meminjami atau menginfakkan hartanya di jalan Allah dengan pinjaman yang baik berupa harta yang halal disertai niat yang ikhlas, maka Allah akan melipatgandakan ganti atau balasan kepadanya dengan balasan yang banyak dan berlipat sehingga kamu akan senantiasa terpacu untuk berinfak. Allah dengan segala kebijaksanaannya akan menahan atau menyempitkan dan melapangkan rezeki kepada siapa saja yang dikehendaki-Nya, dan kepada-Nyalah kamu dikembalikan pada hari kebangkitan untuk mendapatkan balasan yang setimpal dan sesuai dengan apa yang diniatkan. Ketika para sahabat nabi begitu antusias melaksanakan perintah berjihad, ayat ini memperlihatkan kebalikan dari sikap tersebut yang ditunjukkan oleh bani israil. Tidakkah kamu, wahai nabi Muhammad, perhatikan, yakni mendengar kisah, para pemuka bani israil setelah musa wafat, ketika mereka berkata kepada seorang nabi mereka, setelah mereka berselisih paham siapa yang berhak menjadi pemimpin, dengan mengatakan, angkatlah seorang raja, yakni pemimpin perang untuk kami, niscaya kami berperang di jalan Allah besertanya. Nabi mereka menjawab, jangan-jangan jika diwajibkan atasmu berperang, kamu tidak akan menaatinya untuk berperang juga karena takut mati dan kecintaanmu terhadap dunia' mereka menjawab, mengapa atau bagaimana mungkin kami tidak akan berperang di jalan Allah, sedangkan kami telah diusir dari kampung halaman kami dan dipisahkan dari anak-anak kami, karena mereka ditahan' tetapi ketika perang itu benar-benar diwajibkan atas mereka karena permintaan mereka sendiri, justru mereka berpaling dengan segera karena merasa ngeri dan takut, kecuali sebagian kecil dari mereka yang masih konsisten. Dan Allah maha mengetahui bahwa mereka adalah orang-orang yang zalim dengan meminta suatu kewajiban yang kemudian mereka sendiri melanggarnya."
  }
]