[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu tahu (wahai Rasul) kisah tentang para bangsawan tokoh dari Bani Israil setelah masa Musa? ketika mereka meminta kepada nabi mereka agar mengangkat seorang raja yang memimpin mereka, mereka bersatu di bawah komandonya, dan mereka memerangi musuh musuh mereka bersamanya di jalan Allah. Nabi mereka berkata kepada mereka “apakah perkara ini hanya seperti dugaan kuatku yaitu apabila kalian telah diwajibkan untuk berperang dijalan Allah kalian tidak akan lagi berperang? Sesungguhnya aku menduga dengan kuat adanya sifat pengecut pada diri kalian dan kaburnya kalian dari peperangan.” Mereka itu menjawab dengan nada pengingkaran terhadap dugaan kuat nabi mereka itu, “apa gerangan penghalang yang menghambat kami untuk berperang dijalan Allah padahal kami sungguh-sungguh telah diusir oleh musuh-musuh kami dari rumah-rumah kami, dan kami dijauhkan dari anak-anak kami dengan telah dibunuh dan ditawan.” Lalu tatkala Allah mewajibkan mereka untuk berperang bersama raja yang telah dipilih Nya bagi mereka, mereka ternyata menjadi orang-orang pengecut dan lari dari peperangan kecuali sebagian kecil dari mereka yang tetap bertahan dengan karunia dari Allah. Dan Allah Maha Mengetahui orang-orang yang berbuat kezaliman lagi melanggar janji-janji mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "246. Tidakkah engkau mengetahui -wahai Nabi- perihal para pembesar Bani Israil setelah zaman Musa -'alaihissalām- tatkala mereka berkata kepada Nabi mereka, “Berilah kami seorang raja agar kami dapat berperang bersamanya di jalan Allah.” Lalu Nabi mereka berkata, “Jangan-jangan jika Allah mewajibkan kalian berperang, maka kalian tidak mau berperang di jalan Allah.” Mereka membantah anggapan Nabi mereka itu dengan mengatakan, “Apa alasan kami untuk tidak berperang di jalan Allah sedangkan kami punya alasan kuat untuk berperang. Musuh telah mengusir kami dari tanah air kami dan menawan anak-anak kami. Jadi, kami akan berperang untuk mengambil kembali tanah air kami dan membebaskan anak-anak kami yang mereka tawan.” Kemudian tatkala Allah mewajibkan mereka berperang, mereka justru berpaling kecuali sebagian kecil dari mereka. Dan Allah Maha Mengetahui orang-orang yang zalim dan berpaling dari perintah-Nya, dan melanggar janji-Nya, dan akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "246. Kemudian Allah menceritakan beberapa kisah tentang jihad: Hai Rasulullah, tidakkah kamu mengetahui kisah para pembesar Bani Israil setelah kematian Nabi Musa? Ketika mereka meminta kepada nabi mereka untuk memilih seseorang menjadi panglima perang, untuk memerangi musuh mereka di jalan Allah. Maka Nabi tersebut menjawab mereka: “Aku khawatir jika diwajibkan kepada kalian perang, kalian enggan untuk pergi berperang dan takut dari musuh. Mereka membantah: “Apa yang membuat kami enggan berperang, sedangkan musuh telah mengusir kami dari negeri kami dan menawan anak-anak kami? Namun ketika Allah mewajibkan perang kepada mereka, sebagian besar mereka enggan pergi berperang, hanya sebagian kecil saja yang tetap teguh pada janji mereka. Dan Allah Maha Mengetahui orang-orang zalim yang menyelisihi janji mereka dengan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "246. أَلَمْ تَرَ إِلَى الْمَلَإِ مِنۢ بَنِىٓ إِسْرٰٓءِيلَ (Apakah kamu tidak memperhatikan pemuka-pemuka Bani Israil) ( الملأ) yakni pembesar-pembesar kaum. Allah menyebutkan kisah mereka sebagai penyemangat untuk berperang setelah kisah sebelumnya. Dahulu orang-orang yang kejam mengusai bani Israil dan keadaan Bani Israil pada waktu itu sangat jauh dari kerajaan dan kekuasaan, dan umat-umat lain berkuasa atas negeri mereka. مِنۢ بَعْدِ مُوسَىٰٓ (sesudah Nabi Musa) Yakni setelah masa Nabi Musa. لِنَبِىٍّ لَّهُمُ (kepada seorang Nabi mereka) Ada pendapat mengatakan bahwa dia adalah Nabi Samuel. ابْعَثْ لَنَا مَلِكًا ( “Angkatlah untuk kami seorang raja) Agar kami bisa menyerahkan urusan kami padanya dan berbuat sesuai dengan pendapatnya. نُّقٰتِلْ (supaya kami berperang) Yakni berperang bersamanya. فَلَمَّا كُتِبَ (Maka tatkala perang itu diwajibkan) Yakni wajib atas mereka. تَوَلَّوْا۟ (merekapun berpaling) Disebabkan goyahnya niat mereka dan lemahnya kemauan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "246. Apakah belum sampai kepadamu kisah para bangsawan dari Bani Israil yang hidup setelah wafatnya Musa, ketika mereka berkata kepada nabi mereka yaitu Shamuel: “Tentukan atau pilihkanlah raja atau pimpinan yang bisa memimpin kami untuk berperang bersamanya mengalahkan orang zalim di jalan Allah” Nabi mereka pada zaman itu berkata: “Barangkali sifat pengecut dan lemah akan menguasai kalian jika peperangan itu diwajibkan atas kalian” Mereka berkata: “Apa yang membuat kami tidak berperang, dan bagaimana bisa kami tidak berani untuk berperang di jalan Allah, padahal kami sudah diusir dari rumah kami dan dilarang bertemu anak-anak kami karena mereka diambil untuk dijadikan tawanan atau bahkan dibunuh?” Lalu ketika diwajibkan atas mereka perintah perang, mereka berpaling dari jihad kecuali hanya sedikit orang yang tetap menepati janji. Dan Allah itu Maha mengetahui orang yang mengingkari janji dan menzalimi diri sendiri lalu mengingkari janji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kalian perhatikan para pemuka} para pemimpin {Bani Israil setelah Musa} setelah wafatnya Musa {ketika mereka berkata kepada seorang nabi mereka, “Utuslah} angkatlah {seorang raja untuk kami, maka kami berperang di jalan Allah.” Dia menjawab, “barangkali} bisa jadi {jika diwajibkan} diwajibkan {atas kalian berperang, kalian tidak akan berperang juga.” Mereka menjawab, “Mengapa kami tidak akan berperang di jalan Allah, sedangkan sungguh kami telah diusir dari kampung halaman kami dan anak-anak kami” Ketika perang diwajibkan atas mereka, mereka berpaling} mereka berpaling dari jihad {kecuali sebagian kecil dari mereka. Allah Maha Mengetahui orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "246-247. Allah menceritakan kisah ini kepada umat ini agar mereka mengambil pelajaran darinya dan agar mereka suka berjihad serta tidak takut darinya, karena orang-orang yang sabar akan mendapat hasil yang baik dan terpuji di dunia dan di akhirat, sedangkan orang-orang yang lari darinya akan merugi di dunia dan akhirat. Allah mengabarkan bahwasanya para cendekiawan dari Bani Israil dan tokoh-tokoh mereka menghendaki berjihad, lalu mereka sepakat untuk meminta kepada nabi mereka seorang raja yang menolong mereka agar perselisihan terhenti dengan pemilihnya dan terwujud, ketaatan yang total, hingga tidak ada lagi perdebatan dari orang-orang, namun nabi mereka khawatir permintaan mereka itu hanyalah sebatas perkataan saja yang tidak ada pelaksanaannya, namun mereka menyikapi dugaan nabi mereka itu dengan memperlihatkan tekad yang kuat dan mereka akan konsisten akan hal itu dengan sebenar-benarnya, dan bahwasanya peperangan itu sudah menjadi suatu kepastian untuk mereka karena menjadi sebuah jalan pengembalikan Negeri mereka serta kembalinya mereka kepada tempat dan kediaman mereka. Nabi mereka telah menetapkan thalut sebagai raja yang memimpin mereka dalam suatu perkara yang memang harus memiliki pemimpin yang ahli dalam kepemimpinan. Namun mereka mempermasalahkan ketetapan nabi mereka untuk memilih thalut sebagai raja mereka, padahal ada orang yang lebih baik rumahnya dan lebih banyak harta darinya. Nabi mereka menjawab bahwa sesungguhnya Allah telah memilihnya untuk kalian, karena Dia telah mengaruniakan kepadanya kekuatan ilmu tentang siasat (perang) dan kekuatan tubuh, yang mana kedua hal itu merupakan sarana keberanian, kemenangan, dan keahlian dalam mengatur peperangan, dan bahwasanya Raja itu tidaklah dengan banyaknya harta, dan tidak juga orang yang menjadi raja itu harus merupakan raja dan pemimpin pula dalam daerah-daerah mereka, karena Allah memberi kerajaanNya kepada siapa yang dikehendakiNya. Kemudian nabi malaikat tidaklah cukup sampai disitu menenangkan mereka dengan apa yang telah Dia sebutkan dari kemampuan tholut dan adanya sifat-sifat yang dibutuhkan dalam masalah itu, hingga Dia berkata kembali kepada mereka,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡمَلَإِ } Al-Mala’: Para pembesar kaum yang menjadi pengambil keputusan. Jika seseorang memandang kepada mereka, akan terkesima dan menghormatinya. { عَسَيۡ } ‘Asâ: Kata yang berisikan pengharapan akan terjadinya sesuatu. { كُتِبَ } Kutiba: Diwajibkan atau diharuskan Makna ayat: Allah Ta’ala telah mewajibkan kepada orang-orang beriman untuk berperang, dan dimulailah peperangan yang diawali oleh perang Badr yang membutuhkan harta, pasukan, pemberani dan pahlawan. Jadilah situasi ini sebagai bentuk ujian terhadap semangat yang menggelora dan menguras emosi untuk mempersatukan jamaah kaum muslimin di Madinah, demi menghadapi peperangan dengan orang Arab dan Non arab (‘ajam) bersamaan. Dari sinilah nampak bahwa pengecut dan bakil (pelit) itu merupakan sifat yang buruk bagi lelaki. Allah Ta’ala mengisahkan kisah orang-orang yang lari dari kematian, meninggalkan rumah-rumah mereka untuk hal lain, bagaimana Allah Ta’ala mematikan mereka dan tidak bermanfaat pelariannya, kemudian Allah menghidupkan mereka agar menjadi pelajaran untuk mereka dan yang lainnya, bahwa lari dari kematian tidak menghasilkan apapun. Namun hanya kesabaran dan keteguhan menunggu datangnya pertolongan lah yang bermanfaat bagi mereka. Kemudian Allah Ta’ala memerintahkan orang-orang mukmin setelah melihat gambaran dan mengambil pelajaran dari kejadian tersebut dengan firman Nya,”Dan berperanglah kalian di jalan Allah.” Ketika pengorbanan harta (infak, pent) didahulukan dalam persiapan peperangan, maka Allah Ta’ala mengganti harta itu dengan melipatgandakan keuntungan dari pinjaman dengan syarat dikeluarkan dengan ikhlas dan penuh kerelaan. Kemudian Allah Ta’ala memperlihatkan kepada mereka kejadian lain yang juga penuh pelajaran untuk orang-orang muslim yang selalu diserang oleh bangsa-bangsa lain baik berkulit putih atau merah sepanjang masa, Allah Ta’ala berfirman kepada mereka dengan menyebutkan kepribadian nabinya,”Apakah kamu tidak memperhatikan pemuka-pemuka Bani Israil sesudah Nabi Musa ketika mereka berkata kepada seorang Nabi mereka,”Angkatlah untuk kami seorang raja supaya kami berperang (di bawah pimpinannya) di jalan Allah.” Maksudnya, belum sampaikah informasi kepadamu mengenai perkataan para pemuka Bani Israil setelah wafatnya Nabi Musa kepada nabi mereka,”Utuslah kepada kami seorang raja sehingga kami dapat berperang di jalan Allah dan mengusir musuh-musuh kami dari negeri kami dan mengembalikan kekuasaan kami, sehingga kami dapat menerapkan syariat rabb kami.” Melihat kepada kelemahan mereka secara rohani dan jasmani serta materi, Nabi ini merasa takut jika permintaan mereka hanya sekedar omongan belaka, maka ia berkata,”Mungkin sekali jika kamu nanti diwajibkan berperang.” Yaitu setelah diangkatnya raja sekaligus pemimpin mereka tidak mau berperang?! Maka fanatisme mereka bangkit dan mengatakan,”Mengapa kami tidak mau berperang sedangkan kami telah terusir dari negeri kami dan terpisah dari anak-anak kami.” Saat itu musuh mereka adalah orang-orang Babilonia, mereka menyerang Palestina tatkala Bani Israil melenceng dari syariat agamanya, para wanita mempertontonkan auratnya, merebaknya zina dan riba, dan meninggalkan kitabnya dan berpaling dari petunjuk nabinya, maka Allah menimpakan hukuman dengan cara mereka dikalahkan oleh musuhnya dan terusir menjadi pengungsi di negeri orang. Maka Nabi Syamuel mengutus seorang lelaki dari golongan mereka yang sudah hidup segan mati pun tak mau itu yaitu Thalut sebagai pemimpin mereka. Ketika semakin dekat dengan tempat peperangan mereka takut dan mundur sebagian besarnya, kalah sebelum bertanding. Sungguh benar apa yang dikatakan oleh nabi mereka berdasarkan firasat yang didapatkannya tatkala mengatakan,”Mungkin sekali jika kamu nanti diajibkan berperang, kamu tidak akan berperang.” Inilah kandungan ayat yang pertama (246) dalam kisah ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 246: Allah menceritakan kepada nabi ﷺ kisah mulia dari bani israil yang datang setelah zaman Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan \"para pemuka\" karena mereka adalah wakil dari kaum mereka. Merekalah yang biasa membahas tentang hal-hal yang bermaslahat bagi kaum mereka, sedangkan kaum mereka hanya mengikuti. Ada yang berpendapat bahwa nabi mereka ketika itu adalah Samuel. Yakni agar perkumpulan mereka yang terpecah dapat bersatu dan dapat berperang melawan musuh. Menurut Syaikh As Sa'diy, bahwa mungkin pada waktu itu mereka tidak memiliki ketua yang menyatukan mereka sebagaimana kebiasaan kabilah-kabilah yang memiliki rumah, di mana masing-masingnya tidak ridha jika ada yang memimpin selainnya. Oleh karena itu, mereka meminta kepada nabi mereka agar menentukan raja untuk mereka yang diridhai oleh semua pihak. Saat itu, yang biasa memimpin Bani Israil adalah para nabi, setiap nabi yang satu meninggal digantikan oleh nabi yang lain. Maksudnya: mereka diusir dan anak-anak mereka ditawan oleh tentara Jalut. Mereka malah takut mereka dan mereka melarikan diri dari peperangan. Yakni yang mengingkari janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 246",
    "description": "Ketika para sahabat nabi begitu antusias melaksanakan perintah berjihad, ayat ini memperlihatkan kebalikan dari sikap tersebut yang ditunjukkan oleh bani israil. Tidakkah kamu, wahai nabi Muhammad, perhatikan, yakni mendengar kisah, para pemuka bani israil setelah musa wafat, ketika mereka berkata kepada seorang nabi mereka, setelah mereka berselisih paham siapa yang berhak menjadi pemimpin, dengan mengatakan, angkatlah seorang raja, yakni pemimpin perang untuk kami, niscaya kami berperang di jalan Allah besertanya. Nabi mereka menjawab, jangan-jangan jika diwajibkan atasmu berperang, kamu tidak akan menaatinya untuk berperang juga karena takut mati dan kecintaanmu terhadap dunia' mereka menjawab, mengapa atau bagaimana mungkin kami tidak akan berperang di jalan Allah, sedangkan kami telah diusir dari kampung halaman kami dan dipisahkan dari anak-anak kami, karena mereka ditahan' tetapi ketika perang itu benar-benar diwajibkan atas mereka karena permintaan mereka sendiri, justru mereka berpaling dengan segera karena merasa ngeri dan takut, kecuali sebagian kecil dari mereka yang masih konsisten. Dan Allah maha mengetahui bahwa mereka adalah orang-orang yang zalim dengan meminta suatu kewajiban yang kemudian mereka sendiri melanggarnya. Nabi atau ulama mereka akhirnya mengabulkan permintaan tersebut. Dan nabi mereka berkata kepada mereka sebagai bentuk pengabulan permintaan mereka, sesungguhnya Allah telah mengangkat talut menjadi raja atau komandanmu. Mereka, khususnya para pembesar, menjawab dengan nada sinis, bagaimana mungkin talut memperoleh kerajaan atau kekuasaan atas kami dan memimpin kami dalam pertempuran, sedangkan kami dengan segala kebesaran yang kami miliki seharusnya lebih berhak atas kerajaan atau jabatan itu daripadanya, dan dia juga tidak diberi kekayaan yang banyak' nabi mereka menjawab, Allah telah memilihnya sebagai raja kamu dan memberikan kepadanya sesuatu yang menjadikannya layak menerima tugas itu, yaitu kelebihan ilmu untuk memahami strategi perang dan fisik yang kuat agar mampu menjalankan tugas berat tersebut. Ketahuilah, sesungguhnya Allah memberikan kerajaan-Nya kepada siapa yang dia kehendaki, dan Allah mahaluas anugerah-Nya yang tidak dipengaruhi oleh kekayaan hamba-Nya, lagi maha mengetahui apa yang layak dan tidak layak bagi hamba-Nya."
  }
]