[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan nabi mereka berkata kepada mereka, “Sesungguhnya Allah mengutus kepada kalian Thalut menjadi raja kalian sebagai bentuk pengabulan permintaan kalian, yang akan memimpin kalian untuk memerangi musuh-musuh kalian sebagaimana permintaan kalian.” Namun pembesar Bani Israil berkata, “Bagaimana bisa Thalut menjadi raja kami, dia tidak berhak atas itu, sebab dia bukan dari keturunan raja-raja, dan bukan dari keluarga Nabi. Dia tidak memiliki banyak harta yang dapat dipergunakan mengatur kerajaannya, maka kami lah yang lebih berhak menjadi raja daripada dia, karena kami sesungguhnya keturunan raja-raja dan berasal dari keluarga nabi. Nabi mereka berkata kepada mereka, “Sesungguhnya Allah telah memilihnya daripada kalian sedang Dia lebih mengetahui urusan-urusan hamba-hamba Nya, dan telah memberinya tambahan keluasan dalam ilmu dan kekuatan dalam fisiknya untuk memerangi musuh. Dan Allah pemilik seluruh kerajaan memberikan kekuasaan bagi hamba-hamba Nya yang dikehendaki, dan Allah Maha luas karunia dan Anugerah, juga Maha Mengetahui hakikat-hakikat perkara-perkara dengan sebenarnya, tidak ada sesuatupun yang samar bagi Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "247. Nabi mereka berkata kepada mereka, “Sesungguhnya Allah telah mengangkat Ṭālut sebagai raja agar kalian pergi berperang di bawah komandonya.” Lalu para pembesar mereka menolak dan menentang pengangkatan raja tersebut dengan mengatakan, “Bagaimana mungkin dia menjadi raja kami, sedangkan kami lebih berhak menjadi raja daripada dia, karena dia bukan keturunan raja dan tidak dikaruniai kekayaan yang berlimpah untuk menopang kerajaannya?” Nabi mereka menjawab, “Sesungguhnya Allah telah memilihnya untuk menjadi raja kalian. Allah memberinya kelebihan atas kalian berupa ilmu pengetahuan yang luas dan tubuh yang kuat. Dan Allah memberikan kerajaan-Nya kepada siapa saja yang Dia kehendaki berdasarkan kebijaksanaan dan kasih sayang-Nya. Allah Mahaluas anugerah-Nya, Dia memberi siapa saja yang dikehendaki-Nya, dan Dia Maha Mengetahui siapa saja di antara makhluk-Nya yang berhak menerima anugerah-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "247. Nabi mereka berkata: “Allah telah mengutus Thalut kepada kalian sebagai panglima perang.” Tapi mereka mengelak: “Bagaimana bisa Thalut menjadi panglima kami, sedangkan dia hanya seorang yang miskin. Sungguh kami lebih layak untuk mendapat kedudukan sebagai panglima.” Nabi mereka menjawab: “Allah telah memilih Thalut bagi kalian, Allah memberinya keluasan ilmu dan badan yang kuat. Allah memberi kekuasaan kepada hamba-Nya yang Dia kehendaki, Dia Maha Luas karunia-Nya dan Maha Mengetahui segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "247. وَقَالَ لَهُمْ نَبِيُّهُمْ (Nabi mereka mengatakan kepada mereka) Yakni Nabi Shamuel إِنَّ اللَّـهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا ۚ ( “Sesungguhnya Allah telah mengangkat Thalut menjadi rajamu” ) Yakni Allah memudahkannya untuk kalian dan memerintahkan kalian untuk mentaatinya dan berperang bersamanya. Terdapat pendapat mengatakan sesungguhnya Thalut bukanlah dari keturunan para nabi yakni Bani Lawi, bukan pula keturunan para raja yakni Bani Yahudza. قَالُوٓا۟ أَنَّىٰ يَكُونُ لَهُ الْمُلْكُ عَلَيْنَا (Mereka menjawab: “Bagaimana Thalut memerintah kami) Yakni bagaimana demikian padahal dia bukan dari kerajaan, bukan pula yang diberikan keluasan harta sehingga kita bisa mengikuti dia karena kemuliaannya atau kerena hartanya? اصْطَفَىٰهُ عَلَيْكُمْ (telah memilih rajamu) Yakni Allah telah memilihnya. Dan pilihan Allah hujjah yang tak dapat dibantahkan. وَزَادَهُۥ بَسْطَةً فِى الْعِلْمِ (dan menganugerahinya ilmu yang luas) Yang mana ilmu merupakan unsur terpenting dari manusia, keutamaan tertinggi, dan sisi terbesar untuk dijadikan sebagai pilihan. وَالْجِسْمِ ۖ (dan tubuh yang perkasa) Yang efeknya akan kelihatan ketika berada dalam peperangan dan lainnya, dia memiliki kekuatan dalam agama dan badannya, dan kelihaiannya dalam strategi perang. Dan inilah hal yang harus diperhitungkan, bukan malah nasab keturunan yang bagus karena keutamaan jiwa lebih diunggulkan atas hal itu. وَاللَّـهُ يُؤْتِى مُلْكَهُۥ مَن يَشَآءُ ۚ (Allah memberikan pemerintahan kepada siapa yang dikehendaki-Nya) Karena kekuasaan adalah kekuasaan-Nya, dan hamba adalah hamba-Nya. Oleh karena itu mengapa kalian menolak sesuatu yang bukan merupakan milik kalian bukan pula urusan kalian. وٰسِعٌ (Maha Luas) Yakni luas keutamaannya. عَلِيمٌ (Maha Mengetahui) Yakni mengetahui siapa yang berhak mendapatkan kekuasaan dan siapa yang cocok untuk itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tidaklah suatu kaum menyerahkan kepemimpinan mereka kecuali kepada orang yang memiliki kekuatan yang disepakati oleh mereka, pemimpin yang siap bekerja untuk menjawab persoalan kaumnya, perhatikanlah ayat ini : { أَنَّىٰ يَكُونُ لَهُ الْمُلْكُ عَلَيْنَا وَنَحْنُ أَحَقُّ بِالْمُلْكِ مِنْهُ وَلَمْ يُؤْتَ سَعَةً مِنَ الْمَالِ ۚ قَالَ إِنَّ اللَّهَ اصْطَفَاهُ عَلَيْكُمْ وَزَادَهُ بَسْطَةً فِي الْعِلْمِ وَالْجِسْمِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "247. Nabi mereka Shamuel berkata: “Sesungguhnya Allah mengutus Thalut sebagai raja bagi kalian, jadi kalian harus menaatinya dan berperang bersamanya.” Lalu mereka berpaling sembari berkata: “Bagaimana bisa Thalut menjadi raja kami sedangkan dia fakir dan bukan dari keluarga kerajaan, sedangkan kami orang-orang yang memiliki kekuasaan, kepemimpinan lebih berhak menjadi raja daripada dia. Dia itu fakir, tidak memiliki rejeki melimpah dan harta yang banyak yang bisa digunakan untuk mendirikan kerajaan?” Lalu Nabi mereka berkata : “Sesungguhnya Allah telah memilihkan untuk kalian seorang raja, dan telah membekalinya dengan pengetahuan dan kekuatan fisik. Dia itu orang yang kuat agama dan strategi untuk melawan musuh dalam perang. Dan Allah itu Maha luas keutamaanNya dan Maha Mengetahui orang yang berhak dan lebi baik atas suatu kekuasaan dan Allah itu memberikan kekuasan bagi orang yang Dia pilih”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nabi mereka berkata kepada mereka,“Sesungguhnya Allah telah mengutus} mengangkat {Talut menjadi raja kalian” Mereka menjawab,“Bagaimana mungkin} bagaimana bisa {dia memperoleh kekuasaan atas kami, sedangkan kami lebih berhak} lebih pantas {atas kerajaan itu daripada dia, sedangkan dia tidak diberi kekayaan yang banyak” Nabi mereka menjawab,“Sesungguhnya Allah telah memilihnya} memilihnya {atas kalian dan memberinya kelebihan ilmu dan fisik”} kelebihan dalam hal keilmuan dan kekuatan tubuh {Allah menganugerahkan kerajaanNya kepada siapa yang Dia kehendaki. Allah Maha luas lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "246-247. Allah menceritakan kisah ini kepada umat ini agar mereka mengambil pelajaran darinya dan agar mereka suka berjihad serta tidak takut darinya, karena orang-orang yang sabar akan mendapat hasil yang baik dan terpuji di dunia dan di akhirat, sedangkan orang-orang yang lari darinya akan merugi di dunia dan akhirat. Allah mengabarkan bahwasanya para cendekiawan dari Bani Israil dan tokoh-tokoh mereka menghendaki berjihad, lalu mereka sepakat untuk meminta kepada nabi mereka seorang raja yang menolong mereka agar perselisihan terhenti dengan pemilihnya dan terwujud, ketaatan yang total, hingga tidak ada lagi perdebatan dari orang-orang, namun nabi mereka khawatir permintaan mereka itu hanyalah sebatas perkataan saja yang tidak ada pelaksanaannya, namun mereka menyikapi dugaan nabi mereka itu dengan memperlihatkan tekad yang kuat dan mereka akan konsisten akan hal itu dengan sebenar-benarnya, dan bahwasanya peperangan itu sudah menjadi suatu kepastian untuk mereka karena menjadi sebuah jalan pengembalikan Negeri mereka serta kembalinya mereka kepada tempat dan kediaman mereka. Nabi mereka telah menetapkan thalut sebagai raja yang memimpin mereka dalam suatu perkara yang memang harus memiliki pemimpin yang ahli dalam kepemimpinan. Namun mereka mempermasalahkan ketetapan nabi mereka untuk memilih thalut sebagai raja mereka, padahal ada orang yang lebih baik rumahnya dan lebih banyak harta darinya. Nabi mereka menjawab bahwa sesungguhnya Allah telah memilihnya untuk kalian, karena Dia telah mengaruniakan kepadanya kekuatan ilmu tentang siasat (perang) dan kekuatan tubuh, yang mana kedua hal itu merupakan sarana keberanian, kemenangan, dan keahlian dalam mengatur peperangan, dan bahwasanya Raja itu tidaklah dengan banyaknya harta, dan tidak juga orang yang menjadi raja itu harus merupakan raja dan pemimpin pula dalam daerah-daerah mereka, karena Allah memberi kerajaanNya kepada siapa yang dikehendakiNya. Kemudian nabi malaikat tidaklah cukup sampai disitu menenangkan mereka dengan apa yang telah Dia sebutkan dari kemampuan tholut dan adanya sifat-sifat yang dibutuhkan dalam masalah itu, hingga Dia berkata kembali kepada mereka,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مَلِكٗاۚ } Malikan: Pemimpin yang memimpin baik dalam keadaan aman maupun berkecamuk perang. { أَنَّىٰ يَكُونُ } Annâ yakûnu: Pertanyaan untuk pengingkaran yang bermakna,”Bagaimana mungkin ia bisa menjadi raja?” { ٱصۡطَفَىٰهُ } Ishthofâhu: Mengutamakannya atas kalian dan memilihnya untuk kalian { بَسۡطَةٗ فِي ٱلۡجِسۡمِۖ } Basthotan fil jism: tubuh yang tinggi dan menang dari yang lain. Makna ayat: Adapun ayat yang kedua (247) mengandung penolakan para pemuka Bani Israil atas terpilihnya Thalut sebagai pemimpin mereka hanya karena ia seorang miskin dari keluarga yang tidak terpandang. Bahwa para pemuka itu lebih berhak untuk menyandang kedudukan itu dibandingkan Thalut. Maka nabi mereka menolak alasan itu sebagaimana disebutkan dalam firman Nya; ”Sesungguhnya Allah telah memilihnya menjadi rajamu dan menganugerahinya imu yang luas dan tubuh yang perkasa. Allah memberikan pemerintahan kepada siapa yang dikehendaki Nya. Dan Allah Maha Luas pemberian Nya lagi Maha mengetahui.” Dan inilah perkataan para pembesar yang dijawab oleh Nabi Syamuel; “Bagaimana Thalut memerintah kami, padahal kami lebih berhak mengendalikan pemerintahan daripadanya, sedang diapun tidak diberi kekayaan yang cukup banyak.” Seolah-olah mereka menolak bahwa Allah Ta’ala telah memilih Thalut, memberikan keutamaan padanya dibandingkan mereka dan memberikannya kekuasaan serta memberikan tambahan ilmu dan fisik yang kuat. Kepemimpinan dalam perang bertumpu pada luasnya ilmu dan kekuatan fisik, serta kesempurnaan indera dan keberaniaan akal dan hati. Mereka meminta seperti kebiasaannya Bani Israil yang suka mencari-cari kesahan. Mereka meminta bukti yang menunjukkan bahwa Allah benar-benar telah memilihnya untuk memimpin mereka, maka nabi mereka mengatakan sebagaimana disebutkan dalam ayat berikutnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 247: Berkata mereka kepada nabi mereka : Sesungguhnya Allah telah memilih kalian memiliki raja tholut. Ketahuilah bahwasannya Allah memberi kerajaan bagi siapaun dari hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena Allah yang mengangkat seharusnya mereka menerimanya dan tunduk, tidak protes. Yakni karena Thalut bukan keturunan raja dan nabi, bahkan dia hanya seorang penyamak kulit atau pengembala. Yang dapat digunakan untuk menegakkan kerajaan. Hal ini didasari atas anggapan yang rusak, yaitu anggapan bahwa raja itu harus bernasab mulia dan banyak harta. Mereka tidak mengetahui sifat yang sesungguhnya harus didahulukan. Thalut adalah orang alim (berilmu) Bani Israil dan orang yang paling sempurna fisiknya. Ada yang mengartikan \"kelebihan ilmu\" di sini dengan kuatnya ra'yu (gagasannya kuat dan tepat), sedangkan \"fisik\" maksudnya mampu mewujudkannya. Dengan kedua inilah akan sempurna mengurus kerajaan. Jika salah satunya tidak ada, maka akan gagal mengurus kerajaan. Misalnya badannya kuat, namun gagasannya lemah, maka akan terjadi kekacauan dan kekuasaan tanpa kebijaksanaan. Demikian juga jika gagasannya kuat, namun tidak mampu mewujudkannya, maka gagasan tersebut tidak berfaedah apa-apa. Pemberian-Nya tidak bisa ditentang. Allah Mahaluas pemberian-Nya, rahmat-Nya luas tidak khusus kepada orang tertentu, dan tidak hanya kepada golongan terhormat saja, bahkan golongan rakyat jelata pun kena. Dia mengetahui siapa yang berhak memegang pemerintahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 247",
    "description": "Nabi atau ulama mereka akhirnya mengabulkan permintaan tersebut. Dan nabi mereka berkata kepada mereka sebagai bentuk pengabulan permintaan mereka, sesungguhnya Allah telah mengangkat talut menjadi raja atau komandanmu. Mereka, khususnya para pembesar, menjawab dengan nada sinis, bagaimana mungkin talut memperoleh kerajaan atau kekuasaan atas kami dan memimpin kami dalam pertempuran, sedangkan kami dengan segala kebesaran yang kami miliki seharusnya lebih berhak atas kerajaan atau jabatan itu daripadanya, dan dia juga tidak diberi kekayaan yang banyak' nabi mereka menjawab, Allah telah memilihnya sebagai raja kamu dan memberikan kepadanya sesuatu yang menjadikannya layak menerima tugas itu, yaitu kelebihan ilmu untuk memahami strategi perang dan fisik yang kuat agar mampu menjalankan tugas berat tersebut. Ketahuilah, sesungguhnya Allah memberikan kerajaan-Nya kepada siapa yang dia kehendaki, dan Allah mahaluas anugerah-Nya yang tidak dipengaruhi oleh kekayaan hamba-Nya, lagi maha mengetahui apa yang layak dan tidak layak bagi hamba-Nya. Dan nabi mereka berkata kepada mereka, sesungguhnya tanda atau bukti kerajaannya, yakni kelayakannya untuk mengemban tugas tersebut, ialah datangnya tabut, yaitu tempat untuk menyimpan taurat, kepadamu, yang sebelumnya berada di palestina, yang di dalamnya terdapat sesuatu yang bisa memberi kamu ketenangan dari tuhanmu dan sisa peninggalan keluarga musa dan keluarga harun, yang dibawa oleh malaikat yang hakikatnya hanya diketahui oleh Allah. Sungguh, pada yang demikian itu, yakni peristiwa besar tersebut, terdapat tanda kebesaran Allah bagimu yang bisa membawamu kepada ketaatan dan kerelaan, jika kamu benar-benar orang beriman. Seorang pemimpin harus memenuhi beberapa kriteria, di antaranya cerdas atau menguasai masalah dan mampu melaksanakan tugas. Untuk membuktikan kelayakannya maka harus dilakukan uji kelayakan."
  }
]