[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan nabi mereka berkata kepada mereka, “sesungguhnya tanda kerajaannya adalah akan datang kepada kalian sebuah peti tempat Taurat diletakkan (sebelumnya musuh-musuh mereka berhasil merampasnya dari mereka), didalamnya terdapat ketentraman dari Tuhan kalian dan peneguhan hati orang-orang yang ikhlas. dan didalamnya terdapat sisa-sisa peninggalan keluarga Musa dan keluarga Harun, seperti tongkat dan serpihan-serpihan lempengan-lempengan tanah yang berisi ayat-ayat Alquran yang dibawa oleh para malaikat. Sesungguhnya pada hal tersebut benar-benar ada kandung bukti besar bagi kalian atas terpilihnya Thalut sebagai raja yang memerintah kalian dengan perintah Allah, apabila kalian beriman kepada Allah dan rasul-rasul Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "248. Nabi mereka berkata kepada mereka, “Sesungguhnya tanda benarnya ketetapan Allah dalam memilih Ṭālut sebagai raja kalian ialah Allah akan mengembalikan Tabut kepada kalian. Tabut itu adalah sebuah peti yang sangat dihormati oleh orang-orang Bani Israil, kemudian hilang diambil orang. Peti itu selalu diiringi dengan ketenteraman. Di dalamnya terdapat sisa-sisa peninggalan keluarga Musa dan keluarga Harun, seperti tongkat dan lembaran-lembaran (Taurat). Sesungguhnya di situ benar-benar terkandung tanda-tanda yang nyata bagi kalian, jika kalian benar-benar beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "248. Nabi mereka berkata untuk membuktikan kebenaran pemilihan Thalut: “Tanda kekuasaan Thalut adalah datangnya peti yang berisi Taurat yang mengandung ketenangan dan rahmat dari Tuhan kalian. Dan dalam peti itu juga terdapat benda-benda peninggalan keluarga Musa dan Harun. Peti itu akan dibawa oleh para malaikat untuk diletakkan di rumah Thalut. Sungguh ini merupakan bukti yang paling kuat bagi kalian tentang kebenaran pemilihan Thalut jika kalian benar-benar beriman kepada Allah dan hari akhir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "248. التَّابُوتُ (peti) Dari Ibnu Abbas ia berkata: dahulu kaum Amaliq (kaum yang dulu tinggal di Palestina) besar merampas peti dari Bani Israil. Kemudian para malaikat datang dengan membawa peti diantara langit dan bumi dan mereka melihat hal itu, hingga para malaikat meletakkan peti itu pada Thalut lalu mereka menyalami dia dan menjadikannya pemilik peti itu. Dan dahulu para nabi jika mendatangi peperangan mereka mendatangkan peti didepan mereka. سَكِينَةٌ (ketenangan) Makna (السكينة) yakni ketenangan dan kedamaian. Yakni dalam peti tersebut terdapat sebab ketenangan hati kalian dari apa yang kalian perselisihkan dalam urusan Thalut dan sebab keteguhan jiwa saat bertemu dengan para musuh. وَبَقِيَّةٌ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هٰرُونَ (dan sisa dari peninggalan keluarga Musa dan keluarga Harun) Ada pendapat mengatakan ia adalah tongkat Musa dan sisa dari Alwah yang tertulis didalamnya kitab Taurat pertama kali. Ada pula pendapat yang mengatakan selain itu. Dan pendapat lain mengatakan bahwa yang dimaksud dengan keluarga Musa dan Harun adalah personal Musa dan Harun itu sendiri. Sehingga maknanya apa yang ditinggalkan oleh Musa dan Harun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "248. Nabi mereka Shamuel berkata: “Sesungguhnya tanda-tanda Thalut menjadi raja, yaitu dia akan membawakan kalian Tabut, yaitu kotak penyimpanan Taurat yang dicuri dari kalian dan diambil oleh musuh kalian yaitu orang-orang Palestina (zaman dahulu) yang di dalamnya terdapat ketenangan, yaitu martabat, ketenangan dan ketetapan jiwa, yaitu sesuatu yang menjadi sebab tenangnya hati kalian yang gelisah terkait perkara Thalut. Dan di dalamnya terdapat sisa Taurat, yaitu beberapa lembar Taurat dan sisa-sisa keluarga Musa dan Harun, seperti tongkat Musa, yang dibawa para malaikat menuju rumah Thalut. Sesungguhnya dalam hal itu ada tanda-tanda bahwa Thalut akan menjadi raja, jika kalian benar-benar beriman kepada Allah. Jadi dengarkan dan taatilah Thalut” Ibnu Abbas berkata: “Raksasa telah membawa Tabut dari Bani Israil, lalu para malaikat membawa Tabut itu di antara langit dan bumi. Dan mereka melihat hal itu sampai para malaikat meletakkan Tabut di sisi Thalut. Ketika mereka melihat hal itu, mereka berkata: “Benar sekali” Lalu mereka menerimanya dan menjadikannya raja. Para Nabi ketika akan menghadiri suatu peperangan, mereka membawa Tabut”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nabi mereka berkata kepada mereka,“Sesungguhnya tanda} tanda {kerajaannya ialah datangnya Tabut kepadamu} peti yang di dalamnya ada Taurat {Di dalamnya terdapat ketenangan} ketenangan {dari Tuhan kalian dan sisa dari apa yang ditinggalkan oleh keluarga Musa dan keluarga Harun} di dalamnya tersisa sesuatu yang ditinggalkan oleh keluarga Musa dan keluarga Harun {yang dibawa oleh para malaikat. Sesungguhnya pada yang demikian itu benar-benar merupakan tanda} benar-benar tanda nyata {bagi kalian jika kalian adalah orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "248. “Sesungguhnya tanda dia akan menjadi raja ialah kembalinya tabut kepadamu didalamnya terdapat keterangan dari robbmu dan sisa dari peninggalan keluarga Musa dan keluarga Harun.” Ketika itu tabut tersebut telah dikuasai oleh musuh. Mereka tidaklah cukup dengan sifat-sifat moralitas pada diri tholut, dan tidak pula dengan penentuan Allah baginya lewat lisan nabi mereka, hingga ditopang dengan mukjizat tersebut. Oleh karena itu Allah berfirman, “sesungguhnya pada yang demikian itu terdapat tanda bagimu Jika kamu orang yang beriman,” maka di saat itulah mereka tunduk dan patuh. Ketika thalut telah memimpin, melatih, mengatur, dan memilah-milah mereka untuk memerangi musuh mereka, ia melihat kelemahan tekad dan semangat pada mereka hingga membutuhkan pemisah antara yang sabar dan yang takut, maka dia berkata sebagaimana yang diabadikan dalam firman Allah,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { نَبِيُّهُمۡ } Nabiyyuhum: Nabi Syamuel { ءَايَةَ مُلۡكِهِۦ } Aâyata mulkihî: Tanda bahwa Allah Ta’ala memberikan kekuasaan kepada kalian { ٱلتَّابُوتُ } At-Tabût: Kotak dari kayu yang berisikan peninggalan Nabi Musa dan Harun { سَكِينَةٞ } Sakînah: Ketenangan hati dan jiwa { وَبَقِيَّةٞ } Baqiyyah: Sisa dari sesuatu setelah hilang kebanyakan bagiannya, dan yang dimaksud di sini adalah puing barang ddari paapn Taurat yang telah pecah, tongkat nabi Musa ‘alaihissalam dan peninggalan dari para nabi. { تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ } Tahmiluhul malâikah: Dibawa malaikat dari daerah ‘Amaliqah dan diletakkan di area pemukiman Bani Israil. { إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ } Inna fî dzâlika la âyatan lakum: Dalam kemunculan Tabut yang pernah diambil dengan paksa oleh musuh dari kalian, terdapat tanda yang kuat bahwa Allah Ta’ala memilih Thalut sebagai pemimpin atas kalian. Makna ayat: Sesungguhnya makna ayat sudah jelas dari penjelasan makna kata di atas, dan kesimpulannya bahwa Nabi Syamuel memberitahukan Bani Israil bahwa bukti pemberian kekuasaan dari Allah kepada Thalut adalah datangnya Tabut yang sempat hilang dari mereka, dan itu merupakan simbol berkumpul dan bersatunya mereka. Dan sumber kekuatan mereka tatkala Thalut mengumpulkan kembali sisa-sisa peninggalan Nabi Musa dan harus seperti potongan papan Taruat, tongkat Nabi Musa, sandal, imamahnya Harun dan beberapa nikmat yang turun kepada Mereka tatkala tersesat dahulu. Maka Tabut ini menjadi simbol bendera yang mereka bawa berperang di bawah panjinya, apabila mereka keluar untuk berperang mereka membawanya bersama, senantiasa Tabut itu bersama mereka dalam peperangan dan mereka mendapatkan kemenangan dari musuh-musuhnya. Dari sini mereka bersemangat untuk berperang. Allah menjadikan kemunculan Tabut sebagai tanda pemberian kekuasaan kepada Thalut atas mereka, dan pada waktu yang sama mereka membawanya dalam peperangan sehingga hati dan jiwa mereka menjadi tenang, mereka mendapatkan kemenangan atas izin Allah Ta’ala. Adapun tatacara malaikat membawa Tabut itu maka banyak riwayat menyebutkan bahwa kaum ‘Amaliqah merasa sial dengan keberadaannya, karena mereka diuji dengan penyakit bawasir, paceklik, dan lain sebagainya. Kemudian mereka berfikir untuk mengembalikan saja kepada Bani Israil dan terjadilah apa yang ditakdirkan. Mereka meletakkannya di sebuah gerobak dan ditarik oleh dua ekor sapi betina atau dua ekor kuda dan diarahkan menuju perkampungan Bani Israil. Berjalanlah gerobak itu dan malaikat menggiringnya sampai tiba di perkampungan Bani israil. Tanda ini menjadi bukti terbesar sehingga Bani Israil mau menerima kepemimpinan Thalut, dan dengan nama Allah ia memimpin mereka. Pada ayat selanjutnya dijelaskan bagaimana mereka berjalan menuju peperangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 248: Ketahuilah bahwasannya hal tersebut bagi kalian adalah bukti atas terpilihnya tholut sebagai raja dengan perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika kaumnya meminta bukti terhadap kerajaannya. Tabut ialah peti tempat menyimpan Taurat. Sebelumnya peti ini direbut oleh musuh. Ada yang mengatakan bahwa peninggalan tersebut misalnya kedua sandal Nabi Musa dan tongkatnya, sorban Nabi Harun, alat takar untuk makanan manna yang pernah diturunkan serta pecahan lauh (papan bertuliskan isi Taurat). Mereka melihatnya dengan mata kepala. Mereka pun akhirnya mengakui kepemimpinan Thalut dan siap berjihad bersamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 248",
    "description": "Dan nabi mereka berkata kepada mereka, sesungguhnya tanda atau bukti kerajaannya, yakni kelayakannya untuk mengemban tugas tersebut, ialah datangnya tabut, yaitu tempat untuk menyimpan taurat, kepadamu, yang sebelumnya berada di palestina, yang di dalamnya terdapat sesuatu yang bisa memberi kamu ketenangan dari tuhanmu dan sisa peninggalan keluarga musa dan keluarga harun, yang dibawa oleh malaikat yang hakikatnya hanya diketahui oleh Allah. Sungguh, pada yang demikian itu, yakni peristiwa besar tersebut, terdapat tanda kebesaran Allah bagimu yang bisa membawamu kepada ketaatan dan kerelaan, jika kamu benar-benar orang beriman. Seorang pemimpin harus memenuhi beberapa kriteria, di antaranya cerdas atau menguasai masalah dan mampu melaksanakan tugas. Untuk membuktikan kelayakannya maka harus dilakukan uji kelayakan setelah membuktikan sendiri kelayakan talut sebagai pemimpin melalui keberadaan tabut, akhirnya mereka mau mengikuti perintahnya. Maka ketika talut membawa bala tentaranya untuk berangkat perang, sebelumnya dia memberi pengarahan seraya berkata, Allah akan menguji kamu dengan sebuah sungai yang kamu seberangi. Maka barang siapa meminum airnya, dia bukanlah pengikutku; dan barang siapa tidak meminumnya maka dia adalah pengikutku, kecuali menciduk seciduk dengan tangan, sekadar untuk menghilangkan dahaga. Tetapi kebanyakan mereka ternyata meminumnya dengan penuh keserakahan karena tidak mampu menahan nafsu minum, kecuali sebagian kecil di antara mereka yang kuat sehingga hanya meminumnya sedikit. Maka, ketika dia, talut, dan orang-orang yang beriman bersamanya menyeberangi sungai itu, mereka yang banyak minum dari sungai itu berkata, kami tidak kuat lagi pada hari ini melawan jalut dan bala tentaranya. Sementara itu, mereka yang minum air sungai sekadarnya dan meyakini bahwa mereka akan menemui Allah berkata, betapa banyak kelompok kecil yang didukung oleh kekuatan fisik dan memiliki keimanan yang kuat mampu mengalahkan kelompok besar lagi kuat dengan izin Allah. Dan Allah beserta orang-orang yang sabar dengan memberi mereka pertolongan. Ini menunjukkan bahwa tenggelam dalam hal-hal duniawi dan menuruti hawa nafsu hanya akan melemahkan mental seseorang. Akibatnya, ia tidak mampu bersikap disiplin dalam menaati aturan, menegakkan kebenaran, dan melawan kebatilan"
  }
]