[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Thalut telah keluar bersama tentara-tentara nya untuk memerangi bangsa amalaqoh dia berkata kepada mereka, “Sesungguhnya Allah akan menguji kalian untuk bersabar dengan sungai yang ada di depan kalian yang akan kalian sebrangi, supaya dapat dibedakan mana orang mukmin dari orang munafik, maka barangsiapa dari kalian meminum air sungai itu dia bukanlah termasuk golonganku, dan tidak pantas ikut berjihad bersamaku, dan barangsiapa tidak meminum airnya maka dia termasuk golonganku, karena sesungguhnya dia telah taat kepada perintah ku dan pantas untuk berjihad, kecuali orang-orang yang mau mengambil keringanan dan menciduk dengan tangannya sekali saja maka tidak ada celaan padanya. Sesampainya di sungai mereka langsung terjun ke dalam air, dan meminum airnya dengan berlebih-lebihan, kecuali sejumlah kecil dari mereka yang dapat bersabar menahan kehausannya dan cuaca panas, dan mereka merasa cukup dengan satu cidukan tangan saja. Maka saat itulah orang-orang yang melanggar tertinggal. Dan ketika Thalut menyeberangi sungai bersama kelompok kecil yang beriman (yang jumlahnya sekitar 300 dan belasan orang laki-laki) untuk menghadapi musuh, dan mereka menyaksikan jumlah besar musuh dan alat-alat perang mereka, maka bala tentara Thalut berkata, “hari ini tidak ada kesanggupan dari kami untuk menghadapi Jalut dan bala tentaranya yang tangguh-tangguh”. Maka orang-orang yang mengimani pertemuan dengan Allah, mengingatkan teman-teman mereka tentang Allah dan kekuasaannya sembari berkata, “Berapa banyak golongan beriman dan sabar yang berjumlah sedikit sanggup mengalahkan golongan kafir lagi melampui batas yang berjumlah lebih banyak dengan izin Allah dan ketetapan Nya”. Dan Allah bersama orang-orang yang bersabar dengan taufik dan pertolongan Nya serta pahala baik Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "249. Maka tatkala Ṭālut dan bala tentaranya keluar dari negeri mereka, dia berkata kepada mereka, “Sesungguhnya Allah menguji kalian dengan sebuah sungai. Siapa yang minum air sungai itu maka ia tidak berada di jalanku dan tidak boleh bergabung denganku di dalam perang. Dan siapa yang tidak minumnya maka ia berada di jalanku dan boleh bergabung denganku di dalam perang, kecuali orang yang terpaksa meminum airnya sebanyak satu ciduk dengan telapak tangannya, maka tidak apa-apa.” Kemudian bala tentaranya minum air sungai tersebut, kecuali sebagian kecil dari mereka yang mampu menahan diri untuk tidak minum, kendati mereka merasakan dahaga yang luar biasa. Kemudian tatkala Ṭālut dan orang-orang mukmin yang menyertainya melewati sungai tersebut, maka sebagian dari bala tentaranya berkata, “Sekarang ini kami tidak punya kekuatan untuk berperang melawan Jalut dan bala tentaranya.” Ketika itulah orang-orang yang meyakini bahwa mereka akan berjumpa dengan Allah kelak pada hari kiamat berkata, “Berapa banyak golongan orang-orang mukmin yang jumlahnya sedikit berhasil mengalahkan golongan orang-orang kafir yang jumlahnya banyak dengan izin dan pertolongan Allah.” Jadi faktor utama tercapainya kemenangan adalah iman bukan jumlah yang banyak. Dan Allah senantiasa mendukung dan menolong hamba-hamba-Nya yang sabar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "249. Ketika Thalut keluar dengan pasukannya dari Baitul Maqdis untuk berperang melawan musuh, ia berkata: “Allah akan menguji kesabaran dan ketaatan kalian dengan sebuah sungai yang akan kalian seberangi. Barangsiapa yang meminum air sungai itu maka dia bukan termasuk dari pengikutku, dan barangsiapa yang tidak meminumnya maka dia adalah pengikutku; adapun orang yang hanya meminumnya secakupan tangan, maka tidak mengapa baginya.” Namun mereka meminum air sungai itu kecuali sebagian kecil dari mereka saja yang berjumlah 300 sekian orang, sesuai dengan jumlah pasukan pada perang Badar. Setelah Thalut menyeberangi sungai itu dan orang yang tersisa bersamanya hanya sedikit sedangkan musuh mereka berjumlah besar, sebagian mereka berkata: “Kita tidak akan mampu mengalahkan Jalut yang kejam yang memiliki pasukan besar.” Maka orang-orang yang beriman kepada pertemuan dengan Allah menjawab kekhawatiran mereka: “Betapa banyak pasukan kecil yang sabar dapat mengalahkan pasukan besar dengan izin Allah. Allah Bersama orang-orang yang sabar dengan pertolongan dan taufik-Nya. Al-Barra’ berkata: “Para sahabat Nabi yang mengikuti perang Badar berkata kepadaku, bahwa jumlah mereka sesuai dengan jumlah pasukan Thalut yang dapat menyeberangi sungai, yaitu 300 sekian orang.” Al-Barra’ melanjutkan: “Demi Allah, tidaklah pasukan yang dapat menyeberangi sungai dengan Thalut kecuali orang-orang yang mukmin.” (Shahih Bukhari, kitab al-Maghazi, bab jumlah pasukan perang Badar, 7/290 no. 3957)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "249. فَصَلَ (keluar) Yakni Thalut keluar dengan mereka dari negerinya. بِنَهَرٍ (dengan suatu sungai) Pendapat mengatakan sungai itu ada diantara Urdun dan Palestina. Dan maksud dari cobaan ini adalah cobaan untuk menguji ketaatan mereka. Barangsiapa yang taat untuk menahan diri dari meminum air setelah merasa kehausan maka niscaya dia akan taat pada cobaan yang lainnya. Dan barangsiapa yang melanggar dan dikalahkan oleh hawa nafsunya maka dia akan lebih menyelisihi perintah saat cobaan yang keras lain menimpa. Dan Allah memberi keringanan bagi orang yang meminum sedikit air dengan menciduk memakai tangannya untuk menghilangkan sedikit rasa haus dan untuk mematahkan gejolak jiwa saat itu. فَلَيْسَ مِنِّى (bukanlah ia pengikutku) Yakni bukan termasuk sahabatku. وَمَن لَّمْ يَطْعَمْهُ (Dan barangsiapa tiada meminumnya) Yakni barangsiapa yang tidak mencicipinya. فَإِنَّهُۥ مِنِّىٓ إِلَّا مَنِ اغْتَرَفَ غُرْفَةًۢ بِيَدِهِۦ ۚ (kecuali menceduk seceduk tangan, maka dia adalah pengikutku) Makna (الاغتراف) adalah mengambil air dengan tangan atau alat lain. Dan makna (الغرفة) menurut salah satu pendapat adalah mengambil air dengan satu telapak tangan. Dan pendapat lain mengatakan yakni dengan menggunakan kedua telapak tangan. فَشَرِبُوا۟ مِنْهُ (Kemudian mereka meminumnya) Yakni mereka menyelisihi perintah raja mereka sehingga mereka dilarang untuk melanjutkan perjalanan dengannya untuk bertemu para musuh. إِلَّا قَلِيلًا (kecuali beberapa orang di antara mereka) Dan mereka seperti jumlah orang yang mengikuti perang Badar, tiga ratus dan beberapa belas orang. Sebagaimana yang disebutkan di shahih Bukhari dan lainnya. Ibnu Jarir meriwayatkan dari al-Barra’ bin Azib ia berkata: dahulu kami bercakap-cakap bahwa para sahabat Nabi Muhammad yang mengikuti perang badar berjumlah tiga ratus dan beberapa belas orang sesuai dengan jumlah para sahabat Thalut yang melewati sungai bersamanya, dan tidaklah melewatinya kecuali orang mukmin. Dan as-Suddiy berkata: mereka adalah pasukan berjumlah 80.000 orang, kemudian yang meminum air sungai berjumlah 76.000 orang dan tesisa bersamanya 4.000 orang. Terdapat pendapat yang mengatakan meski telah diuji kesabaran dan ketaatan mereka dengan ujuan ini namun orang yang berhasil melewati sungai tetap tidak mampu sepenuhnya teguh saat bertemu dengan musuh. فَلَمَّا جَاوَزَهُۥ (Maka tatkala Thalut telah menyeberangi sungai itu) Yakni ketika Thalut telah menyeberangi sungai وَالَّذِينَ ءَامَنُوا۟ مَعَهُۥ (dan orang-orang yang beriman bersama dia) Dan jumlah mereka yang taat kepadanya sedikit, namun mereka juga berbeda-beda dalam kuatnya keyakinan mereka. Sehingga sebagian mereka berkata (لَا طَاقَةَ لَنَا) Tak ada kesanggupan bagi kami, adapun orang-orang yang meyakini bahwa mereka akan menemui Allah berkata bahwa mereka akan berjumpa dengan Allah, dan berkata: ( كَم مِّن فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةًۢ) Berapa banyak terjadi golongan yang sedikit dapat mengalahkan golongan yang banyak. وَاللَّـهُ مَعَ الصّٰبِرِينَ (Dan Allah beserta orang-orang yang sabar) Yakni kemenangan itu bersama kesabaran dan bukan dengan banyaknya jumlah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنَّ اللَّهَ مُبْتَلِيكُمْ بِنَهَرٍ فَمَنْ شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَمَنْ لَمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي إِلَّا مَنِ اغْتَرَفَ غُرْفَةً بِيَدِهِ } Perhatikanlah bagaimana ayat ini menjadikan ketidak mampuan seseorang menahan dirinya dari sesuatu yang ia sukai dari hal yang terbilang kecil, sebagai bukti bahwa mereka juga tidak akan mampu bertahan pada perkara yang lebih besar. 2 ). Kapankah akan berhenti isitilah : { لَا طَاقَةَ لَنَا الْيَوْمَ بِجَالُوتَ وَجُنُودِهِ } ? akan berhenti ketika kita mengangkat syi'ar : { كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ }. 3 ). Terperangkap di dalam sisi negatif dari suatu peristiwa, mengakibatkan jauhnya kesempatan menuju jalan penyelesaian, bahkan mengakibatkan kerugian. Adapun jika kita membawa pikiran keluar dari jalur peristiwa itu memungkinkan terbukanya pintu-pintu keluar dari kesempitan, berhentilah sejenak mengamati beberapa peristiwa dari kisah Thalut dan para tentaranya : { قَالُوا لَا طَاقَةَ لَنَا الْيَوْمَ بِجَالُوتَ وَجُنُودِهِ } tatkala sebagian dari tentara Thalut terperangkap dalam fikiran mereka akan jumlah tentara Jalut yang begitu banyaknya seketika mereka merasa lemah dan melarikan diri dari peperangan itu, adapun orang-orang yang dalam dirinya keyakinan akan kuasa Allah, seketika tekad dan keberanian mereka semakin tinggi dan akhirnya mereka tetap berada diatas kemenangan : { قَالَ الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو اللَّهِ كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ }. 4 ). Yakin akan pertemuan hamba dengan Allah dan keikut sertaan diri dalam perintah-Nya adalah dua bekal yang mesti ada dalam jiwa setiap hamba, tatkala nampak dihadapan kita warna kemenangan oleh musuh; agar tidak terjadi ketercerai-beraian, yang mengakibatkan munculnya rasa pesimis dan kegagalan { قَالَ الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو اللَّهِ كَمْ مِنْ فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصَّابِرِينَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "249. Ketika Thalut keluar bersama pasukannya dari negerinya Baitul Maqdisuntuk memerangi raksasa dia berkata: “Sesungguhnya Allah menguji kalian dengan sungai, yaitu sungai Jordania, jadi barangsiapa meminum airnya, maka dia bukan dari pasukanku, atau sahabatku yang taat, dan barangsiapa tidak merasakan atau tidak meminumnya, maka dia itu termasuk pengikut dan pasukanku kecuali orang yang mengambil air sebanyak satu cakupan telapak tangan”. Lalu mereka meminum air sungai itu dan mengingkari perintah rajanya kecuali sejumlah kecil dari pasukan mereka yang hampir sama dengan jumlah pasukan perang Badar, yaitu 300 dan beberapa puluh orang. Sebagaimana yang disebutkan dalam Shahih Bukhari ketika Thalut menyeberangi sungai, yaitu dirinya dan kelompok pasukannya yang beriman dan taat. Orang-orang yang lemah imannya berkata: “Kami tidak mampu memerangi Jalut yaitu orang yang sangat sewenang-wenang dan penyembah berhala, Dia dan pengikutnya telah menduduki Palestina. Tidak ada kesempatan untuk memerangi pasukannya karena mereka sangat banyak dan jumlah kita sedikit.” Lalu orang-orang yang yakin bahwa mereka akan bertemu dengan Tuhannya di akhirat berkata: “Sungguh kelompok pasukan yang kecil akan mengalahkan pasukan yang banyak dengan kehendak, pertolongan dan dukungan Allah, sesungguhnya Dia itu bersama orang-orang yang sabar. Dan sesungguhnya pertolongan Allah itu diberikan bersamaan dengan kesabaran, bukan bersamaan dengan jumlah yang banyak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Talut keluar} keluar {dengan membawa bala tentara, dia berkata, “Sesungguhnya Allah akan menguji kalian} menguji kalian {dengan sebuah sungai. Maka siapa yang meminum airnya, maka dia tidak termasuk golonganku} maka bukan termasuk bala tentaraku dalam perang ini {Siapa yang tidak mencicipinya} merasakannya {sesungguhnya dia termasuk golonganku kecuali menciduk seciduk dengan tangan” Lalu mereka meminumnya kecuali sebagian kecil di antara mereka. {Ketika Talut dan orang-orang yang beriman bersamanya menyeberangi sungai itu, mereka berkata, “Tidak ada kekuatan} tidak ada lagi kekuatan {bagi kami pada hari ini melawan Jalut dan bala tentaranya.” Orang yang meyakini} meyakini {bahwa mereka akan menemui Allah berkata, “Banyak kelompok} kelompok {kecil yang mengalahkan kelompok besar dengan izin Allah.” Allah bersama orang-orang yang sabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "249-250. “Sesungguhnya Allah akan menguji kamu dengan suatu Sungai,” kalian akan melewatinya saat kalian sangat membutuhkan air, “maka siapa di antara kamu meminum airnya dia bukanlah pengikutku,” maksudnya ia tidak taat kepadaku, karena hal itu adalah bukti yang jelas tentang ketidaksabarannya dan memuncaknya ketakutannya, “dan barangsiapa tiada meminumnya maka dia adalah pengikutku,” karena kejujuran dan kesabarannya, “kecuali menceduk seceduk tangan,” maka hal itu dapat ditoleransi. Ketika mereka sampai di sungai tersebut dan saat itu mereka sangat membutuhkan air, maka seluruhnya minum dari sungai itu, “kecuali beberapa orang di antara mereka,” karena mereka bersabar dan tidak minum. “Maka tatkala thalut dan orang-orang yang beriman bersama dia telah menyeberangi Sungai itu orang-orang yang telah minum berkata,” yaitu orang-orang yang penakut (pengecut) atau (menurut pendapat lain), orang-orang yang menyeberangi sungai “tak ada kesanggupan kami pada hari ini untuk melawan Jalut dan tentaranya.” Apabila yang berkata itu adalah orang-orang yang penakut tersebut, maka perkataan ini adalah merupakan sebuah pembenaran akan ketakutan mereka, namun apabila orang-orang yang berkata itu adalah mereka yang menyeberang bersama tholut, maka sesungguhnya telah timbul sebagai bentuk kelemahan dalam jiwa-jiwa mereka. Akan tetapi orang-orang yang keimanan yang sempurna mendorong semangat dan menguatkan mereka untuk terus maju berperang, di mana mereka berkata, “Berapa banyak terjadi golongan yang sedikit dapat mengalahkan golongan yang banyak dengan izin Allah dan Allah beserta orang-orang yang sabar,” dengan pertolongan, dukungan, dan bantuanNya hingga mereka tegar dan bersabar dalam memerangi musuh mereka, Jalut beserta bala tentaranya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { فَصَلَ طَالُوتُ } Fashala Thalut: Keluar dari pemukiman dan berjalan menuju musuh { بِٱلۡجُنُودِ } Bil junûd: Pasukan tentara, disebutkan jumlahnya tujuh puluh ribu pasukan. { مُبۡتَلِيكُم بِنَهَرٖ } Mubtalîkum binahar: Menguji kalian dengan sungai yang mengalir, mungkin yang dimaksud adalah sungai Yordan sekarang. { وَمَن لَّمۡ يَطۡعَمۡهُ } Waman lam yath’amhu: Tidak minum dari sungai itu. { غُرۡفَةَۢ } Ghurfah: Al-Gharfah dengan tanda fathah berarti sekali cidukan, sedangkan Al-Ghurfah dengan tanda dhommah berarti menciduk. { وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ } Walladzîna âmanu ma’ahu: Mereka adalah orang-orang yang tidak ikut meminum air sungai itu, sedangkan pasukan yang minum telah menjadi kufur atau musyrik. { أَنَّهُم مُّلَٰقُواْ ٱللَّهِ } Annahum mulâqûllahi: Pada hari kiamat mereka akan menemui Allah, mereka beriman dengan hari akhir. { كَم مِّن فِئَةٖ } Kam min fiah: Kam berfungsi untuk menunjukkan banyaknya jumlah, dan fiah berarti golongan yang saling mendukung satu sama lain. { وَٱللَّهُ مَعَ ٱلصَّٰبِرِينَ } Wallahu ma’ash shabirîn: Allah menunjuki jalan yang lurus dan menolong mereka. Makna ayat: Yaitu pada saat Thalut keluar bersama dengan pasukannya, Allah Ta’ala mengabarkan bahwa Dia akan menguji mereka dalam perjalanannya untuk memerangi musuhnya dengan sebuah sungai. Pada saat itu cuaca amat terik dan mereka kehausan sekali, dan tidak diizinkan bagi mereka untuk minum dari sungai tersebut kecuali hanya satu cidukan saja. Barangsiapa yang menaati dan tidak minum kecuali satu cidukan maka ia termasuk orang mukmin, dan siapa saja yang meminumnya melebihi batas yang diizinkan berarti telah kufur. Pada saat sampai di sungai tersebut mereka minum airnya seperti hewan dengan meletakkan lututnya dan menghirup airnya, kecuali hanya beberapa orang saja dari mereka yagn tidak melakukannya. Sampailah Thalut melewati sungai itu dengan beberapa pasukannya, tatkala sudah dekat dengan musuh dan melihat jumlah pasukan musuh yang sekitar seratus ribu pasukan, orang-orang kafir dan munafik mengatakan,”Tidak ada kekuatan bagi kita hari ini untuk menghadapi Jalut dan pasukannya.” Mereka menyatakan kekalahannya sebelum berperang, dan berbalik lari dari medan perang. Maka orang-orang mukmin yang jujur keimanannya berkata sebagaimana disebutkan dalam firman Nya,”Orang-orang yang meyakini bahwa mereka akan menemui Allah berkata,”Betapa banyak terjadi golongan yang sedikit dapat mengalahkan golongan yang banyak dengan izin Allah. Dan Allah bersama orang-orang yang sabar.” Ayat ini menjelaskan perjalanan Thalut menuju musuhnya, dan pada dua ayat selanjutnya menjelaskan tentang peperangan sampai akhir yang terjadi yaitu orang-orang yang mukmin tersebut memperoleh kemenangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 249: Allah mengabarkan bahwasannya tholut ketika berpisah dengan pasukannya untuk berperang dengan suatu kaum; tholut berkata: Sesungguhnya Allah sedang menguji kalian dengan sungai yang akan kalian temui, maka barangsiapa yang meminum dari sungai maka bukan termasuk dari pasukanku, barangsiapa yang tidak meminumnya maka ia adalah pasukanku; kecuali siapa yang menciduk air dengan tangannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni keluar dari Baitul Maqdis dengan jumlah pasukan yang sangat besar, dan ketika itu cuaca sangat panas, mereka memerlukan air. Agar nampak jelas siapa yang taat dan siapa yang tidak taat. Sungai tersebut berada antara Yordania dan Palestina. Karena dia telah melanggar dan menunjukkan lemahnya kesabaran, keteguhan dan mudah melanggar. Sekitar tiga ratus orang lebih. Oleh karena itu, orang yang mulia adalah orang yang dimuliakan Allah dan orang yang hina adalah orang yang dihinakan Allah. Banyaknya pasukan tidaklah berguna apa-apa jika tidak mendapat pertolongan Allah, dan pasukan kecil meskipun sedikit dapat menang jika mendapat pertolongan-Nya. Dengan memberikan taufiq, pertolongan dan memberikan balasan terbaik. Berdasarkan ayat ini, cara mendatangkan pertolongan Allah adalah dengan kesabaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 249",
    "description": "Setelah membuktikan sendiri kelayakan talut sebagai pemimpin melalui keberadaan tabut, akhirnya mereka mau mengikuti perintahnya. Maka ketika talut membawa bala tentaranya untuk berangkat perang, sebelumnya dia memberi pengarahan seraya berkata, Allah akan menguji kamu dengan sebuah sungai yang kamu seberangi. Maka barang siapa meminum airnya, dia bukanlah pengikutku; dan barang siapa tidak meminumnya maka dia adalah pengikutku, kecuali menciduk seciduk dengan tangan, sekadar untuk menghilangkan dahaga. Tetapi kebanyakan mereka ternyata meminumnya dengan penuh keserakahan karena tidak mampu menahan nafsu minum, kecuali sebagian kecil di antara mereka yang kuat sehingga hanya meminumnya sedikit. Maka, ketika dia, talut, dan orang-orang yang beriman bersamanya menyeberangi sungai itu, mereka yang banyak minum dari sungai itu berkata, kami tidak kuat lagi pada hari ini melawan jalut dan bala tentaranya. Sementara itu, mereka yang minum air sungai sekadarnya dan meyakini bahwa mereka akan menemui Allah berkata, betapa banyak kelompok kecil yang didukung oleh kekuatan fisik dan memiliki keimanan yang kuat mampu mengalahkan kelompok besar lagi kuat dengan izin Allah. Dan Allah beserta orang-orang yang sabar dengan memberi mereka pertolongan. Ini menunjukkan bahwa tenggelam dalam hal-hal duniawi dan menuruti hawa nafsu hanya akan melemahkan mental seseorang. Akibatnya, ia tidak mampu bersikap disiplin dalam menaati aturan, menegakkan kebenaran, dan melawan kebatilan dan ketika saat yang mencekam semakin dekat, mereka, yakni kelompok kecil namun didukung keimanan yang kuat, terus maju untuk melawan jalut dan tentaranya, meski mereka tahu benar kekuatan mereka tidak sebanding dengan kekuatan tentara jalut. Untuk menguatkan mental, mereka berdoa, ya tuhan kami, limpahkanlah kesabaran kepada kami untuk menghadapi situasi yang berat ini; kukuhkanlah langkah kami di medan perang ini; dan tolonglah kami untuk menghadapi dan mengalahkan orang-orang kafir. Cerita ini memberi kita beberapa pelajaran dalam menghadapi situasi yang berat dan sulit. Pertama, berani menghadapi dengan penuh kesabaran. Kedua, mempersiapkan apa saja yang memungkinkan untuk memantapkan langkah. Ketiga, berdoa untuk menguatkan mental."
  }
]