[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kabarkanlah -wahai Rosul- kepada orang-orang yang beriman dan beramal sholeh, dengan satu berita yang akan memenuhi hati mereka dengan suka cita, bahwasanya di akhirat kelak mereka akan memperoleh kebun-kebun yang mengagumkan, sungai-sungai akan mengalir di bawah istana-istananya yang menjulang tinggi dan pepohonannya yang rindang. setiap kali Allah memberi rizki kepada mereka berupa sejenis buah yang lezat, mereka berkata “Sungguh Allah telah memberi rizki kepada kami sejenis ini sebelumnya (di dunia).” Ketika memulai menikmatinya, mereka mendapatkan hal yang baru dari rasa dan kelezatannya, walaupun serupa dengan jenis sebelumnya (di dunia) dari segi warna, bentuk dan nama. Di dalam surga mereka juga akan mendapatkan istri-istri yang disucikan dari segala jenis kotoran fisik seperti air kencing, dan haid, serta kotoran maknawi seperti dosa dan kepribadian buruk. Di dalam surga dan kenikmatannya, mereka akan abadi, tidak akan meninggal dan tidak akan keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Jika ancaman tersebut di atas diperuntukkan bagi orang-orang kafir, maka berikanlah kabar gembira, wahai Nabi, kepada orang-orang yang beriman kepada Allah dan beramal saleh bahwa mereka akan mendapatkan balasan yang menyenangkan, yaitu surga yang sungai-sungainya mengalir dari bawah istana-istana dan pohon-pohonnya. Setiap kali mereka disuguhi makanan berupa buah-buahan yang bagus, mereka berkata, “Ini sama seperti buah-buahan yang pernah kita nikmati sebelumnya,” karena buah-buahan itu mirip sekali dengan buah-buahan yang ada di dunia. Mereka diberi hidangan buah-buahan yang bentuk dan namanya mirip dengan buah-buahan yang ada di dunia agar mereka tertarik kepadanya karena merasa sudah mengenalnya. Namun cita rasa dan kelezatannya benar-benar berbeda. Di dalam surga itu mereka mempunyai istri-istri yang bersih dari segala hal menjijikkan yang terbayang di benak penduduk dunia. Mereka hidup dalam kenikmatan abadi yang tidak akan berbatas, berbeda dengan kenikmatan dunia yang serba terbatas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَبَشِّرِ الَّذِيْنَ اٰمَنُوْا (Dan sampaikanlah berita gembira kepada mereka yang beriman) Makna dari (التبشير) adalah memberi kabar gembira yang menjadikan wajah orang yang diberi kabar terlihat berseri-seri. الصّٰلِحٰتِ (amalan-amalan kebaikan) Yakni amal-amal yang diwajibkan dan disunnahkan kepada mereka yang dikerjakan secara istiqamah. Dan surga dapat diraih dengan keimanan dan amal shaleh. جَنّٰتٍ (surga-surga) Yakni taman-taman. Dan (الجنة) merupakan nama dari tempat pembalasan (orang-orang mukmin) yang terdiri atas taman-taman yang banyak. تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ (yang mengalir sungai-sungai di dalamnya) Yakni mengalir dibawah pohon-pohon surga dan istana-istana. كُلَّمَا رُزِقُوْا مِنْهَا مِنْ ثَمَرَةٍ (Setiap mereka diberi rezeki buah-buahan) Yakni salah satu jenis buah dari berbagai jenisnya. قَالُوْا هٰذَا الَّذِيْ رُزِقْنَا مِنْ قَبْلُ (mereka mengatakan: “Inilah yang pernah diberikan kepada kami dahulu”) Yakni buah ini mirip dengan buah yang sebelumnya mereka makan, dengan warna yang sama namun ukuran, rasa, dan aromanya berbeda. Sehingga ketika mereka memakannya mereka mendapati rasa buah ini berbeda dari buah sebelumnya. مُتَشَابِهًا (yang serupa) Yakni serupa dari sisi kualitas yang tidak ada kekurangannya. وَلَهُمْ فِيْهَآ اَزْوَاجٌ مُّطَهَّرَةٌ (dan untuk mereka di dalamnya ada isteri-isteri yang suci) Maksud dari istri-istri yang suci adalah mereka tidak mengalami yang biasa dialami para wanita seperti haid, nifas, dan kotoran yang lain. Sedangkan maksud dari kekal adalah kekekalan abadi yang terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Muhammad! Kabarkanlah berita gembira kepada orang-orang mukmin yang melakukan amal shalih yang diwajibkan dan hal-hal yang diperintahkan atas mereka dengan kebun-kebun hijau yang di bawah pohon-pohon dan rumah-rumahnya mengalir sungai-sungai. Setiap kali, mereka diberi rejeki buah-buahan yang masak mereka berkata: “Ini serupa dengan rejeki (kami) di dunia dalam kualitas dan kebaikannya. Bagi mereka, rejeki tersebut telah mereka terima sebelumnya dan saling menyerupai satu sama lain dalam warna, ukuran, bentuk, rasa dan baunya. Akan tetapi ketika memakannya, mereka menyadari bahwa rasa buah itu berbeda dengan buah sebelumnya. Dan bagi mereka di dalam surga ada istri-istri yang disucikan dari semua kotoran hati dan moral seperti sesuatu yang keji. Dan mereka bermukim dalam kenikmatan abadi yang tidak ada batasnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sampaikanlah kabar gembira kepada orang-orang yang beriman dan beramal shalih. Sesungguhnya bagi mereka itu surga-surga yang di bawahnya mengalir sungai-sungai. Setiap kali mereka diberi rezeki} mereka diberi makan {darinya berupa buah-buahan sebagai bentuk rejeki} sebagai makanan {mereka berkata, “Inilah rezeki yang diberikan kepada kami sebelumnya.” Mereka telah diberi rejeki itu} mereka diberi rejeki {yang serupa} sebagian dari rejeki itu menyerupai sebagian lainnya dari bentuk fisiknya, namun berbeda dalam hal rasa {dan bagi mereka di surga itu pasangan-pasangan yang disucikan} disucikan dari noda fisik maupun maknawi {Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Setelah Allah menyebutkan tentang balasan orang-orang kafir, Dia menyebutkan juga balasan orang-orang beriman yang selalu mengerjakan amal-amal shalih. Sebagaimana ini adalah suatu metode Allah dalam kitabNya, yaitu Dia menyatukan antara harapan dan ancaman, agar seorang hamba optimis, mengharap, khawatir dan takut, lalu Allah berfirman, ”Dan sampaikanlah berita gembira, ” yakni, wahai Rosul dan siapapun yang berada dalam posisimu (sebagai penyeru), “kepada mereka yang beriman,” dengan hati mereka, ”dan berbuat baik” dengan anggota tubuh mereka, maka mereka membenarkan keimanan mereka dengan tindakan nyata dari perbuatan-perbuatan baik mereka. Perbuatan-perbuatan baik disifati dengan kata shalih karena dengan perbuatan-perbuatan itu akan memperbaiki keadaan seorang hamba, memperbaiki perkara agama dan dunianya, dan penghidupan dunia maupun akhiratnya, serta menghilangkan kerusakan dirinya, yang pada akhirnya ia menjadi golongan orang-orang yang shalih yang berbuat baik karena berdekatan dengan ar-Rahman dalam surgaNya. Maka berikanlah mereka kabar gembira, “ bahwa bagi mereka disediakan surga-surga, ” yakni kebun-kebun yang meliputi pohon-pohon yang indah, buah-buahan yang menggiurkan, naungan yang sejuk, dahan-dahan dan ranting pohon yang rimbun. Dengan itu semua, jadilah ia sebagai taman-taman yang di nikmati oleh orang yang masuk ke dalamnya dan dirasakan oleh orang-orang yang tinggal di dalamnya, “yang mengalir sungai-sungai di bawahnya, ” yakni sungai-sungai air, susu, madu dan khamar, di mana mereka mengalirkannya bagaimanapun cara yang mereka kehendaki dan mengalirkannya kemana pun mereka inginkan, dan darinya pohon-pohon itu di siram, hingga tumbuhlah buah-buahan yang bermacam-macam. “setiap mereka di beri rizki buah-buahan dalam surga-surga itu, mereka mengatakan, ’inilah yang pernah di berikan kepada kami dahulu’.“ maksudnya buah-buahan ini sama dari sisi jenis dan sifatnya, semuanya sama rata dalam kelezatan dan keunggulannya, tidak ada buah-buahan yang busuk, dan mereka tidak memiliki waktu yang kosong dari kenikmatan, mereka selalu berada dalam kenikmatan dengan memakan buah-buahannya. Dan firmanNya, “mereka diberi buah-buahan yang serupa, ” menurut suatu pendapat, serupa dalam namanya namun berbeda dalam rasanya. Ada juga yang berpendapat, serupa dalam warnanya namun berbeda dalam namanya. Ada juga yang berpendapat, sebagian serupa dengan sebagiannya lagi dalam keunggulan, kelezatan, dan kenikmatannya, dan yang terakhir ini mungkin pendapat yang terbaik. Kemudian, setelah Allah menyebutkan tentang kediaman mereka, makan mereka dari makanan dan minuman, dan buah-buahan mereka, Allah menyebutkan pula istri-istri mereka, lalu Dia menjelaskan tentang sifat mereka dengan sifat yang paling sempurna, Dia meringkasnya dan membahasnya seraya berfirman, “ Dan untuk mereka di dalamnya ada istri-istri yang suci, ” dan Allah tidak mengatakan suci dari satu aib saja, demi mencakup segala macam kesucian, mereka itu suci akhlaknya, suci tubuhnya, suci lisannya, suci penglihatannya, akhlak-akhlak mereka penuh cinta yang disukai oleh suami-suami mereka dengan akhlak yang baik, berhias diri yang paling indah dan bertata karma, baik ucapan maupun perbuatan, juga suci tubuh mereka dari haid, nifas, mani, air seni, kotoran, lendir hidung, air ludah dan bau yang tidak sedap, dan juga penampilan mereka dengan kesempurnaan kecantikan dimana tidak ada aib sama sekali pada diri mereka, tidak pula buruk rupa, akan tetapi mereka itu baik-baik lagi cantik-cantik, suci lisan dan pandangan mereka, yang sopan lagi menundukkan pandangan mereka terhadap suami-suami mereka, sopan lisan mereka dalam bertutur kata yang jauh dari perkataan yang buruk. Dalam ayat ini disebutkan yang menyampaikan kabar gembira, yang diberikan kabar gembira, dan apa-apa yang menjadi kabar gembira, serta sebab-sebab yang menyampaikan kepadanya. Yang menyampaikan kabar gembira itu adalah Rosululloh SHOLALLOHU 'ALAIHI WASALLAM atau umat nya yang berada dalam posisinya, dan penerima kabar gembira adalah orang-orang yang beriman yang beramal shalih, sedangkan hal yang menjadi kabar gembira itu adalah surga-surga yang telah di sebutkan sifat-sifatnya, dan sebab-sebab yang menyampaikan kepadanya adalah keimanan dan amal shalih, karena tidak ada jalan lain yang menyampaikan kepada berita gembira itu kecuali dengan kedua sebab tersebut. Ini merupakan kabar gembira terbesar yang di ucapkan oleh semulia-mulia makhluk dengan sebaik-baik factor penyebabnya. Ayat ini juga menunjukkan sunnahnya memberikan kabar gembira bagi kaum Mukminin dan membangkitkan semangat mereka untuk beramal lebih giat yaitu dengan menyebutkan balasan perbuatan mereka dan hasilnya, karena dengan hal tersebut perbuatan akan lebih mudah dan ringan. Dan sebesar-besar berita gembira bagi seorang manusia adalah taufik-Nya kepada keimanan dan amal shalih, dan hal tersebut merupakan awal dan asal dari berita gembira, dan yang setelahnya adalah berita gembira ketika mati, dan yang setelahnya adalah sampai kepada kenikmatan tersebut yang abadi. Kita memohon kepada Allah dari karuniaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : بَشِّرِ At-Tabsyir : Berita gembira dengan sesuatu yang disukai oleh jiwa تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ Tajrii min tahtihal anhaar : sungai-sungai mengalir di antara pepohonan dan istana-istana surga. Sungai-sungai itu berisi air, susu, khomr, dan madu. وَأُتُواْ بِهِۦ مُتَشَٰبِهٗاۖ : Mereka diberikan buah-buahan yang menyerupai satu sama lain warnanya, akan tetapi rasanya berbeda-beda. مُّطَهَّرَةٞۖ : Suci dari darah haidh dan nifas, serta seluruh aib dan cacat. خَٰلِدُونَ : Kekal di dalamnya dan tidak akan pernah keluar dari surga selama-lamanya. Makna ayat : Ketika Allah Ta’ala selesai menyebutkan tentang neraka dan penghuninya maka untuk keserasian disebutkan juga tentang surga dan penduduknya agar sempurna metode tarhib dan targhib (memberi ancaman dan motivasi) yang mana keduanya adalah metode dalam memberikan hidayah dan perbaikan. Dalam ayat yang mulia ini, Allah Ta’ala memerintahkan rasulNya agar memberikan kabar gembira kepada orang-orang mukmin yang istiqomah dalam agamanya bahwa mereka akan mendapatkan surga yang mengalir di bawahnya sungai-sungai, di sana mereka mendapatkan istri-istri yang suci lagi bersih dari aib dan cacat. Mereka kekal di dalamnya. Allah Ta’ala memberitakan keadaan penduduk surga ketika disuguhkan buah-buahan yang beragam mereka berkata,”Ini sama seperti yang diberikan kepada kami di dunia.” Allah menceritakan bahwa mereka diberikan sesuatu yang mirip warnanya, namun rasanya berbeda bahkan lebih bagus, sempurna, dan kelezatan dalam menikmatinya. Pelajaran dari ayat : 1. Keutamaan beriman dan beramal sholeh yang mana kenikmatan yang disebutkan dalam ayat diperuntukkan bagi orang-orang yang memiliki keduanya. 2. Motivasi kepada kaum mukminin kepada negeri kedamaian (Surga) serta apa yang ada di dalamnya berupa kenikmatan abadi, agar mereka bertambah keinginannya terhadap surga serta beramal untuk mendapatkannya dengan melakukan perbuatan baik dan meninggalkan berbagai kemungkaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 25: Allah memerintahkan Muhammad Shallallahu Alaihi Wasallam untuk mengabarkan kepada ahli iman beli amal soleh bahwasanya Allah mempersiapkan bagi mereka surga yang padanya terdapat kebun kebun dan taman-taman yang memiliki pohon-pohon dan buah-buahan ; yang mengalir sungai-sungai di bawah pepohonan dan tempat tinggal mereka di dalam surga , maka ketika Allah memberi rezeki berupa macam-macam buah-buahan ahli iman menyangka bahwa sanya beraneka macam kenikmatan ini adalah sama dengan yang ada di dunia ; sebab dalam bentuk itu buah-buahan yang menyerupai dalam warna yang beraneka ragam. Kemudian Allah mengabarkan bahwasanya disiapkan pula bagi ahli iman istri-istri yang cantik yang suci dari seluruh kotoran dan aib yang dapat di indra."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berikanlah kabar gembira wahai Rasul dan orang yang menjadi pewarisnya (para ulama) kepada orang-orang yang beriman dengan hatinya dan beramal shalih dengan anggota badannya, di mana mereka membuktikan iman mereka dengan amal shalih, bahwa mereka akan memperoleh taman-taman yang indah, dan di bawah istana yang tinggi serta pohon yang lebat ada sungai-sungai yang mengalir; ada sungai yang berair tawar, sungai susu, sungai madu dan sungai khamr (arak) sebagaimana dalam surat Muhammad ayat 15; mereka bisa memancarkan dan mengarahkannya ke arah yang mereka kehendaki. Amal yang baik disebut amal yang shalih, karena dengan amal shalih akan menjadi baik keadaan seorang hamba, urusan agama dan dunianya, hidupnya di dunia dan akhiratnya dan hilang daripadanya keadaan yang buruk sehingga ia termasuk ke dalam golongan orang-orang yang shalih, dan cocok untuk tinggal di sisi Ar Rahman di surga-Nya. Setiap kali Allah memberikan rezeki berupa satu jenis buah-buahan yang nikmat, mereka berkata, \"Dahulu, Allah juga melimpahkan rezeki jenis ini.\" Ketika mereka memakannya, mereka merasakan sesuatu yang baru dalam hal rasa dan lezatnya, meskipun buah-buahan itu mirip dengan sebelumnya di dunia baik warna, nama dan nampak dari luarnya. Suci dari semua kotoran hissiy (yang dapat dirasakan) seperti buang air kecil, buang air besar, ingus, riak, haidh, dsb. demikian juga suci dari kotoran maknawi seperti dusta dan akhlak yang buruk. Kenikmatan di surga itu adalah kenikmatan yang serba lengkap, baik jasmani maupun rohani, penghuninya senantiasa memperoleh kenikmatan, mereka tidak mati di dalamnya dan tidak akan dikeluarkan. Dalam ayat ini terdapat anjuran memberikan kabar gembira kepada kaum mukmin untuk mendorong mereka beramal dengan menyebutkan balasan yang akan diperoleh, dengan begitu membuat mereka ringan dalam beramal shalih. Kabar gembira yang paling besar bagi seseorang adalah diberi-Nya taufiq untuk beriman dan beramal shalih, ia merupakan awal kabar gembira dan asalnya, setelahnya kabar gembira ketika meninggal dan setelahnya lagi adalah masuk ke tempat yang penuh kenikmatan. Kita meminta kepada Allah agar kita semua dimasukkan ke dalamnya, Allahumma aamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 25",
    "description": "Dan jika demikian balasan yang akan diterima oleh orang-orang kafir, maka tidak demikian halnya dengan orang-orang yang beriman. Surga yang nyaman dan indah adalah tempat bagi mereka. Sampaikanlah kabar gembira yang menenteramkan jiwa kepada orang-orang yang beriman kepada Allah, rasul, dan kitab-Nya tanpa keraguan sedikit pun, dan berbuat amal-amal kebajikan, bahwa untuk mereka Allah menyediakan di sisi-Nya surga-surga dengan kebun-kebun yang rindang dan berbuah, serta istana-istana yang menjulang tinggi, yang mengalir di bawahnya sungai-sungai. Setiap kali mereka diberi rezeki oleh Allah berupa buah-buahan dari surga, mereka berkata, inilah rezeki yang serupa dengan yang pernah diberikan kepada kami dahulu. Mereka telah diberi buah-buahan yang serupa dari segi nama, bentuk, dan jenisnya, meski rasa dan kelezatannya jauh berbeda. Dan di sana mereka juga memperoleh pasangan-pasangan yang suci, tanpa cacat dan kekurangan sedikit pun. Mereka kekal hidup di dalamnya untuk selama-lamanya, tidak akan pernah mati, dan tidak akan pernah keluar darinya. Allah sering membuat perumpamaan untuk menjelaskan kebe-naran dan hakikat yang luhur, dengan bermacam makhluk hidup, baik kecil maupun besar. Orang-orang kafir mencibir ketika Allah mengambil perumpamaan berupa makhluk kecil yang dipandang remeh seperti lalat dan laba-laba. Di sini dijelaskan sesungguhnya Allah tidak merasa segan atau malu untuk membuat perumpamaan bagi sebu-ah kebenaran dengan seekor nyamuk atau kutu yang sangat kecil atau yang lebih kecil dari itu. Kendati kecil, belalainya dapat menembus kulit gajah, kerbau, dan unta, dan menggigitnya, serta menyebabkan kematian. Adapun orang-orang yang beriman, ketika mendengar perumpamaan itu mereka tahu maksud perumpamaan itu dan tahu bahwa perumpamaan itu adalah kebenaran dari tuhan yang tidak diragukan lagi. Tetapi sebaliknya, mereka yang kafir menyikapi itu dengan sikap ingkar dan berkata, apa maksud Allah dengan perumpamaan yang remeh ini' Allah menjawab bahwa perumpamaan itu dibuat untuk menguji siapa di antara mereka yang mukmin dan yang kafir. Oleh karenanya, dengan perumpamaan itu banyak orang yang dibiarkan-Nya sesat, karena mereka tidak mencari dan menginginkan kebenaran, dan dengan perumpamaan itu banyak pula orang yang diberi-Nya petunjuk karena mereka memang mencari dan menginginkannya. Tetapi Allah tidak akan menzalimi hamba-Nya, sehingga tidak ada yang dia sesatkan dengan perumpamaan itu selain orang-orang fasik, yang melanggar ketentuan-ketentuan agama, baik berupa ucapan maupun perbuatan."
  }
]