[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan setelah nampak Jalut dan tentara-tentaranya, mereka dapat memandang dan melihat marabahaya dengan mata kepala mereka. Mereka pun bersimpuh memohon pertolongan kepada Allah dengan berdoa dan penuh ketundukan Seraya mengucapkan “wahai tuhan kami turunkanlah kepada hati kami kesabaran yang besar, teguhkanlah kaki-kaki kami, dan jadikanlah kuat dalam memerangi musuh, agar kami tidak lari akibat beratnya peperangan, dan menangkanlah kami dengan bantuan dan pertolongan Mu melawan orang-orang kafir itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "250. Tatkala mereka berhadapan langsung dengan Jalut dan bala tentaranya, mereka berdoa kepada Allah seraya berkata, “Ya Rabb kami! Tuangkanlah kesabaran ke dalam hati kami sebanyak-banyaknya. Dan teguhkanlah kaki-kaki kami agar kami tidak melarikan diri maupun takluk di hadapan musuh-musuh kami. Dan tolonglah kami dengan kekuatan dan dukungan-Mu untuk mengalahkan orang-orang yang kafir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "250. Setelah pasukan Thalut yang mukmin terlihat oleh pasukan Jalut di medan perang, mereka berdoa: “Ya Tuhan kami, turunkanlah ke dalam hati kami kesabaran yang besar, teguhkanlah kami di medan peperangan, dan berilah pertolongan kepada kami dalam menghadapi orang-orang kafir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "250. وَلَمَّا بَرَزُوا۟ (Tatkala mereka telah nampak ) Yakni mereka telah sampai ditanah yang luas. لِجَالُوتَ (oleh jalut) Dia adalah pemimpin suku Amaliqah. قَالُوا۟ رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا (merekapun berdoa: “Ya Tuhan kami, tuangkanlah kesabaran atas diri kami) Yakni perbanyaklah untuk kami kesabaran. وَثَبِّتْ أَقْدَامَنَا (dan kokohkanlah pendirian kami) Sebagai ungkapan tentang kekuatan dan tidak mendapat kegagalan dan tidak condong untuk lari dari peperangan. وَانصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِينَ (dan tolonglah kami terhadap orang-orang kafir) Yakni dari Jalut dan bala tentaranya. Takni tolonglah kami agar kami dapat mengalahkan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kesabaran adalah merupakan bagian dari unsur-unsur kedewasaan yang matang dan keberanian yang tinggi, karena sesungguhnya beban-beban kehidupan tidak akan dipikul diatas guncangan { رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "250. Dan ketika mereka telah melihat Jalut (pemimpin raksasa) dan tentaranya, mereka berkata: “Wahai Tuhan kami, sudah sangat sabar, Kami telah memperteguh dan menguatkan diri untuk berjihad dan tidak melarikan diri, maka tolonglah kami atas musuh-musuh kami yang kafir, yaitu Jalut dan para pasukannya. Berilah kami pertolongan sehingga kami bisa menang atas mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka menampakkan diri} menunjukkan diri {kepada Jalut dan bala tentaranya, mereka berdoa, “Ya Tuhan kami, limpahkanlah} curahkanlah {kesabaran kepada kami, kokohkanlah langkah kami, dan menangkanlah kami atas kaum yang kafir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "249-250. “Sesungguhnya Allah akan menguji kamu dengan suatu Sungai,” kalian akan melewatinya saat kalian sangat membutuhkan air, “maka siapa di antara kamu meminum airnya dia bukanlah pengikutku,” maksudnya ia tidak taat kepadaku, karena hal itu adalah bukti yang jelas tentang ketidaksabarannya dan memuncaknya ketakutannya, “dan barangsiapa tiada meminumnya maka dia adalah pengikutku,” karena kejujuran dan kesabarannya, “kecuali menceduk seceduk tangan,” maka hal itu dapat ditoleransi. Ketika mereka sampai di sungai tersebut dan saat itu mereka sangat membutuhkan air, maka seluruhnya minum dari sungai itu, “kecuali beberapa orang di antara mereka,” karena mereka bersabar dan tidak minum. “Maka tatkala thalut dan orang-orang yang beriman bersama dia telah menyeberangi Sungai itu orang-orang yang telah minum berkata,” yaitu orang-orang yang penakut (pengecut) atau (menurut pendapat lain), orang-orang yang menyeberangi sungai “tak ada kesanggupan kami pada hari ini untuk melawan Jalut dan tentaranya.” Apabila yang berkata itu adalah orang-orang yang penakut tersebut, maka perkataan ini adalah merupakan sebuah pembenaran akan ketakutan mereka, namun apabila orang-orang yang berkata itu adalah mereka yang menyeberang bersama tholut, maka sesungguhnya telah timbul sebagai bentuk kelemahan dalam jiwa-jiwa mereka. Akan tetapi orang-orang yang keimanan yang sempurna mendorong semangat dan menguatkan mereka untuk terus maju berperang, di mana mereka berkata, “Berapa banyak terjadi golongan yang sedikit dapat mengalahkan golongan yang banyak dengan izin Allah dan Allah beserta orang-orang yang sabar,” dengan pertolongan, dukungan, dan bantuanNya hingga mereka tegar dan bersabar dalam memerangi musuh mereka, Jalut beserta bala tentaranya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { بَرَزُواْ لِجَالُوتَ } Barazû lijalut: Mereka menampakan diri di medan peperangan dan Jalut adalah panglima perang yang kuat dari kaum ‘Amaliqah. { أَفۡرِغۡ عَلَيۡنَا صَبۡرٗا } Afrigh ‘alainâ shabran: Curahkanlah kesabaran ke dalam hati-hati kami agar kesabaran itu memenuhi hati kami sehingga tidak tersisa ketakutan dan kecemasan dalam hati. { وَثَبِّتۡ أَقۡدَامَنَا } Watsabbit aqdâmanâ: Kokohkanlah diri kami di medan perang sehingga kami tidak kalah, dan hal itu dengan menguatkan hati kami dan menenenguhkan tekad kami. Makna ayat: Ketika dua pasukan bertemu yaitu pasukan orang beriman dan pasukan orang-orang kafir, Jalut meminta untuk diadakan adu ketangkasan. Maka majulah Dawud sebagai perwakilan dari pasukan Thalut dan berhasil membunuhnya. Kemudian Allah Ta’ala memberikan kemenangan kepada pasukan Thalut yang jumlahnya hanya 314 pasukan, seperti yang disebutkan oleh Rasulullah ﷺ kepada pasukan perang Badar,”Jumlah kalian sama seperti jumlah pasukan Thalut.” Walaupun jumlahnya hanya 314 pasukan namun Allah memberikan kemenangan kepada pasukan yang sedikit itu dan menimpakan kekalahan kepada pasukan yang banyak (pasukan Jalut, pent). Pelajaran dari ayat: • Pelaksanaan Jihad yang syar’i harus dipimpin oleh Imam yang dibai’at dengan bai’at yang syar’i. • Untuk memegang tampuk kekuasaan dipersyaratkan memiliki kompetensi dan yang paling penting adalah ilmu, cerdas dan sehat jasmaninya. • Bolehnya mengambil berkah dengan peninggalan para nabi seperti sorban Nabi atau pakaiannya atau sandal dan yang semisalnya. • Bolehnya menguji pasukan untuk mengetahui seberapa jauh persiapan dan kesabarannya untuk berperang. • Keutamaan beriman dengan pertemuan dengan Allah, dan keutamaan sabar di atas ketaatan kepada Allah, lebih khusus lagi saat berkecamuk peperangan dan jihad di jalan Allah. • Penjelasan mengenai hikmah disyariatkannya jihad, yaitu untuk melawan orang kafir dan zhalim oleh orang-orang yang beriman agar kehidupan menjadi teratur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 250: Maka ketika bertemu dua pasukan, pasukan tholut dan jalut berkata pasukan tholut: wahai tuhanku lapangkan kesabaran kepada kami, dan kokohkan kaki kami diadapan musuh kami, tolonglah kami dari orang-orang kafir yang berjihad karena keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saat melihat jumlah yang besar dan melihat bahaya. Yakni agar kami tidak lari karena kedahsyatan perang. Hal ini menunjukkan bahwa mereka tidak bersandar kepada diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 250",
    "description": "Dan ketika saat yang mencekam semakin dekat, mereka, yakni kelompok kecil namun didukung keimanan yang kuat, terus maju untuk melawan jalut dan tentaranya, meski mereka tahu benar kekuatan mereka tidak sebanding dengan kekuatan tentara jalut. Untuk menguatkan mental, mereka berdoa, ya tuhan kami, limpahkanlah kesabaran kepada kami untuk menghadapi situasi yang berat ini; kukuhkanlah langkah kami di medan perang ini; dan tolonglah kami untuk menghadapi dan mengalahkan orang-orang kafir. Cerita ini memberi kita beberapa pelajaran dalam menghadapi situasi yang berat dan sulit. Pertama, berani menghadapi dengan penuh kesabaran. Kedua, mempersiapkan apa saja yang memungkinkan untuk memantapkan langkah. Ketiga, berdoa untuk menguatkan mental. Maka mereka mampu mengalahkannya, yakni jalut dan tentaranya, dengan izin Allah, dan bahkan seorang pemuda bernama dawud yang bergabung dengan tentara talut berhasil membunuh jalut. Kemudian Allah memberinya, dawud, dua anugerah yang belum pernah diberikan kepada rasul-rasul sebelumnya, yaitu kerajaan dan hikmah agar bisa membawa maslahat, dan mengajarinya apa yang dia kehendaki, seperti membuat baju besi dan memahami bahasa burung. Dan kalau Allah tidak melindungi melalui kekuasaan dan kehendak-Nya kepada sebagian manusia dengan memunculkan kekuatan penyeimbang bagi sebagian yang lain, niscaya rusaklah bumi ini, karena mereka akan bertindak semenamena dan menindas yang lemah. Tetapi Allah mempu-Nyai karunia yang dilimpahkan-Nya atas seluruh alam, yakni apabila kezaliman merajalela, Allah akan memunculkan kekuatan yang mengimbanginya."
  }
]