[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian mereka berhasil mengalahkan tentara tentara musuh dengan izin Allah, dan Daud Alaihissalam berhasil membunuh Jalut komandan pasukan yang kuat lagi bengis itu, dan Allah memberikan kepada Daud Alaihissalam kerajaan dan kenabian setelah itu di tengah Bani Israil, dan mengajarkan kepadanya segala ilmu yang dikehendaki Nya. Dan seandainya Allah tidak menahan melalui sebagian manusia (orang-orang yang taat dan beriman kepada Nya) dengan sebagian yang lain, yaitu orang-orang ahli maksiat dan syirik kepada Nya, pastilah bumi akan rusak lantaran dominannya kekafiran diatasnya, dan merajalela kezaliman, dan orang-orang yang bermaksiat. Akan tetapi Allah memiliki karunia yang tercurah pada makhluk-makhluk semuanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "251. Kemudian Ṭālut dan bala tentaranya berhasil mengalahkan pasukan Jalut dengan izin Allah. Dan Daud berhasil membunuh panglima perang mereka, Jalut. Allah memberikan kerajaan dan kenabian kepada Daud, dan mengajarkan kepadanya ilmu-ilmu yang dikehendaki-Nya. Jadi, Allah memberinya apa yang dibutuhkannya untuk memperbaiki urusan dunia dan akhirat. Kalaulah bukan karena sunnatullah yang membalas tindakan perusakan yang dilakukan oleh sebagian orang dengan sebagian orang lainnya, niscaya bumi ini telah rusak akibat kesewenang-wenangan orang-orang yang suka membuat kerusakan di muka bumi. Akan tetapi Allah Maha Pemurah bagi seluruh makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "251. Maka Allah mengabulkan doa mereka dan menolong mereka, sehingga mereka dapat mengalahkan pasukan Jalut dengan izin-Nya. Daud dapat membunuh Jalut yang merupakan panglima pasukan orang-orang kafir, sedangkan Daud adalah salah satu pasukan Thalut yang merupakan ayah dari Nabi Sulaiman. Kemudian Allah memberi Daud kekuasaan dan kenabian di kalangan Bani Israil, dan mengajarkan ilmu-ilmu yang Allah kehendaki. Kalaulah bukan karena Allah menghentikan keburukan orang-orang jahat dengan jihad orang-orang beriman, niscaya kehidupan telah rusak; namun Allah Maha Pemberi karunia bagi seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "251. فَهَزَمُوهُم بِإِذْنِ اللَّـهِ (Mereka (tentara Thalut) mengalahkan tentara Jalut dengan izin Allah) Yakni dengan perintah dan kehendak-Nya. وَقَتَلَ دَاوُۥدُ جَالُوتَ (dan Daud membunuh Jalut) Yakni Daud bin Isya; Allah mengumpulkan baginya kenabian dan kekuasaan setelah dulunya merupakan penggembala kambing, ia dipilih oleh Thalut untuk membunuh Jalut, dan ia berhasil membunuhnya. وَءَاتَىٰهُ اللَّـهُ الْمُلْكَ (kemudian Allah memberikan kepadanya (Daud) pemerintahan) Yakni Allah memilihnya sebagai raja, dan ini terjadi pada masa Thalut masih hidup. وَالْحِكْمَةَ (dan hikmah) Yakni berupa kenabian. وَعَلَّمَهُۥ مِمَّا يَشَآءُ ۗ (dan mengajarkan kepadanya apa yang dikehendaki-Nya) Yakni apa yang sudah menjadi kehendak-Nya. Ada pendapat mengatakan: dan salah satu dari itu adalah Allah mengajarinya pembuatan pakaian besi untuk berperang. وَلَوْلَا دَفْعُ اللَّـهِ النَّاسَ بَعْضَهُم (Seandainya Allah tidak menolak (keganasan) sebahagian umat manusia) Yakni mereka yang secara langsung menjadi penyebab keburukan, kerusakan, dan kedzaliman. بِبَعْضٍ (dengan sebagian yang lain) Yakni selain golongan pertama, dan mereka adalah yang menghalangi dan menolak golongan pertama untuk berbuat keburukan dan lainnya dengan berjihad dan menyuruh kepada kebaikan dan melarang kemungkaran. لَّفَسَدَتِ الْأَرْضُ (pasti rusaklah bumi ini) Yakni dikarenakan kemenangan para pembuat kerusakan atas mereka dengan melakukan keburukan-keburukan yang membinasakan tanaman dan hewan ternak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "251. Lalu Allah mengabulkan doa mereka, dan menghancurkan para raksasa dengan perintah dan kehendak Allah. Dawud bin Isya, salah satu pasukan Thalut membunuh Jalut yang besar dan kafir. Allah memberi Dawud Nubuwwah (hikmah) dan menjadikannya raja Bani Israil selama hidupnya Thalut setelah dia menjadi pengawal. Dan dia diajari Tuhan ilmu-ilmuNya, seperti membuat baju perang, memahami bahasa burung. Kalau tidak ada perlindungan Allah atas sebagian manusia dari manusia lainnya, dan penaklukkanNya atas kejahatan, niscaya orang-orang yang berbuat kerusakan itu akan menguasai bumi, membunuh orang-orang mukmin, menghancurkan tanaman, para keturunan suatu negeri dan penduduknya. Namun Allah itu pemilik keutamaan atas seluruh alam. Dia memberi penjagaan dan pemeliharaan atas mereka, dan mencegah sebagian mereka atas sebagian lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka mengalahkan tentara Jalut dengan izin Allah dan Daud membunuh Jalut. Kemudian Allah menganugerahinya kerajaan dan hikmah} kenabian {Allah mengajarinya apa yang Dia kehendaki. Seandainya Allah tidak menolak sebagian manusia dengan sebagian yang lain} jika Allah tidak menghentikan kerusakan manusia terhadap sebagian lainnya {niscaya rusaklah bumi ini. Akan tetapi Allah mempunyai karunia atas seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "251. “Dan Daud membunuh”, shalawat dan salam atasnya, “Jalut.” Dengan demikian mereka memperoleh kemenangan dan pembelaan atas musuh-musuh mereka, “kemudian Allah memberikan kepadanya”, yakni kepada Daud, “pemerintahan dan hikmah” kenabian dan pengetahuan yang berguna dan Allah memberikan kepadanya hikmah dan kebijaksanaan dalam menyelesaikan perselisihan. Kemudian Allah menjelaskan tentang manfaat berjihad seraya berfirman, “seandainya Allah tidak menolak keganasan sebagian umat manusia dengan sebagian yang lain pasti rusaklah bumi ini,” dengan dikuasai oleh orang-orang kafir lagi jahat serta pelaku keburukan dan kerusakan, “tetapi Allah mempunyai karunia yang dicurahkan atas semesta alam,” dimana Allah bersikap lemah lembut terhadap kaum mukminin, membela mereka dan agama mereka dengan apa yang disyariatkanNya dan ditakdirkanNya, dan ketika Allah menerangkan dengan kisah ini, maka Allah berfirman kepada rasulNya"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { دَاوُۥدُ } Dawud: Yaitu seorang Nabi dan Rasul Allah, nabi Dawud yang waktu itu bukanlah seorang nabi dan rasul akan tetapi merupakan salah satu pasukan Thalut. { وَءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ } Wa atainâhullahul mulka: Hal itu terjadi setelah kematian Nabi Syamuel dan kematian Raja Thalut. { وَعَلَّمَهُۥ مِمَّا يَشَآءُۗ } Wa ‘allamahu mimmâ yasyâ’: Allah mengajarkannya cara membuat baju besi dan bisa mengetahui bahasa burung, dia dan anaknya yaitu Sulaiman ‘alahimassalam. { لَّفَسَدَتِ ٱلۡأَرۡضُ } Lafasadatil ardhu: Bumi menjadi rusak disebabkan oleh banyaknya orang yang berbuat kesyirikan dibanding orang yang bertauhid, begitu juga karena banyaknya orang yang kufur dibandingkan orang beriman. Makna ayat: Dari sinilah mulai bersinar terang nama Dawud karena berhasil membunuh pemimpin keburukan yaitu Jalut, maka Allah mengaruniakan kenabian kepadanya dan kepemimpinan setelah wafatnya Nabi Syamuel dan Raja Thalut. Allah berfirman,”Dawud membunuh Jalut, kemudian Allah memberikan kepadanya (Dawud) pemerintahan dan hikmah (sesudah meninggalnya Thalut) dan mengajarkan kepadanya apa yang dikehendakiNya.” Allah Ta’ala menutup kisah yang sarat akan hikmah dan pelajaran ini dengan firman Nya,”Seandainya Allah tidak menolak (keganasan) sebahagian manusia dengan sebahagian yang lain...” yaitu dengan syariat jihad dan peperangan, pastilah orang-orang kafir akan berbuat kerusakan di muka bumi dengan kezhaliman, kesyirikan dan maksiat. Akan tetapi Allah Ta’ala dengan kebijaksanaan dan pengaturan Nya membuat sebagian mereka menguasai sebagian yang lain, dan menjadikan sebagian mencegah perbuatan sebagian yang lain sebagai karunia dan anugerah dari Allah. Sebagaimana firman Allah Ta’ala,”Tetapi Allah mempunyai karunia (yang dicurahkan) atas semesta alam.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 251: Kemudian Allah menjelaskan bahwasannya pasukan tholut menggempur pasuka jalut dengan izin Allah dan karunia-Nya, dan bahwasannya jalut membunuh jalut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dawud termasuk tentara Thalut. Yang dimaksud di sini ialah kenabian dan kitab Zabur. Dawud menjadi raja Bani Israil setelah wafat Samuel dan Thalut. Seperti membuat baju besi dan bahasa burung. Dengan orang-orang yang taat dan beriman. Karena dominannya kekafiran, sikap sewenang-wenang dan banyaknya pelaku maksiat. Inilah di antara pengaruh jihad, manusia memperoleh ketenteraman dan dapat beribadah kepada Allah dengan tenang. Dari kisah Thalut dengan Jalut di atas kita dapat menarik kesimpulan, di antaranya: - Berkumpulnya para tokoh masyarakat pemilik ide dan gagasan (ahlul halli wal 'aqdi) dengan para ulama membahas tentang cara memperbaiki masalah yang menimpa Negara kemudian mengamalkan hasil musyawarah tersebut merupakan sebab maju dan bangkitnya negara tersebut. Sebagaimana para pemuka Bani Israil bermusyawarah dengan nabi mereka, lalu nabi mereka memberikan solusi. - Kebenaran, setiap kali dilawan dan ditentang dengan syubhat akan semakin bertambah jelas kebenarannya, sebagaimana pertentangan mereka ketika Thalut diangkat menjadi raja. - Ilmu dan ra'yu (pandangan) yang tajam bersama kekuatan dapat mewujudkan kekuasaan yang bijaksana. - Bersandar kepada diri merupakan sebab kelemahan dan kekalahan. - Meminta pertolongan kepada Allah, bersabar dan menghadapkan diri kepada-Nya dengan berendah diri merupakan sebab kemenangan. - Allah Subhaanahu wa Ta'aala tidak akan membiarkan begitu saja yang baik bercampur dengan yang buruk, yang benar imannya dengan yang dusta. - Termasuk rahmat dan Sunnatullah, Allah menghalangi bahaya orang-orang kafir dan munafikin dengan adanya kaum mukmin yang berjihad melawan mereka. Karena jika tidak demikian, tentu bumi akan rusak, kekafiran dan syi'ar-syi'arnya dominan serta kemaksiatan akan meraja lela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 251",
    "description": "Maka mereka mampu mengalahkannya, yakni jalut dan tentaranya, dengan izin Allah, dan bahkan seorang pemuda bernama dawud yang bergabung dengan tentara talut berhasil membunuh jalut. Kemudian Allah memberinya, dawud, dua anugerah yang belum pernah diberikan kepada rasul-rasul sebelumnya, yaitu kerajaan dan hikmah agar bisa membawa maslahat, dan mengajarinya apa yang dia kehendaki, seperti membuat baju besi dan memahami bahasa burung. Dan kalau Allah tidak melindungi melalui kekuasaan dan kehendak-Nya kepada sebagian manusia dengan memunculkan kekuatan penyeimbang bagi sebagian yang lain, niscaya rusaklah bumi ini, karena mereka akan bertindak semenamena dan menindas yang lemah. Tetapi Allah mempu-Nyai karunia yang dilimpahkan-Nya atas seluruh alam, yakni apabila kezaliman merajalela, Allah akan memunculkan kekuatan yang mengimbanginya. Itulah sebagian ayat-ayat Allah, khususnya mukjizat-Mukjizat yang tertera di dalam surah ini, seperti kisah bani israil tersebut. Kami bacakan dan turunkan ayat-ayat itu kepadamu dengan benar demi menguatkan Al-Qur'an sebagai kitab hidayah. Dan engkau, nabi Muhammad, adalah benar-benar seorang rasul, sebab tidak ada yang mampu menyebutkan kisah-kisah itu selain orang yang mendapat pengajaran dari Allah."
  }
]