[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itulah hujjah Allah dan bukti-bukti petunjuk dari Nya, Kami menggambarkannya kepadamu (wahai nabi) dengan sebenarnya. Dan sesungguhnya kamu termasuk Rasul yang benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "252. Itulah ayat-ayat Allah yang jelas dan terang. Kami bacakan ayat-ayat itu kepadamu, wahai Nabi, yang berisi kebenaran di dalam informasi-informasinya dan keadilan di dalam ketentuan hukum-hukumnya. Dan sesungguhnya engkau adalah salah satu utusan yang diutus oleh Tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "252. Inilah ayat-ayat Allah yang agung yang Kami kisahkan kepadamu dengan benar dengan perantara Jibril. Sungguh kamu benar-benar seorang Rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "252. تِلْكَ ءَايٰتُ اللَّـهِ (Itu adalah ayat-ayat dari Allah) Yakni yang menyebutkan kisah ini. نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۚ (Kami bacakan kepadamu dengan hak (benar) ) Yakni dengan kabar yang benar yang tidak ada keraguan di dalamnya. وَإِنَّكَ (dan sesungguhnya kamu) Wahai Muhammad. لَمِنَ الْمُرْسَلِينَ (benar-benar salah seorang di antara nabi-nabi yang diutus) Pemberitahuan dari Allah bahwa ia termasuk Rasul-Rasul Allah, sebagai penguat hatinya, pengokoh jiwa dan urusannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "252. Inilah ayat-ayat Allah dalam kisah ini. Kami membacakannya untukmu dengan benar wahai Nabi, yaitu kabar yang benar, tanpa ditambahi, dikurangi, dan tidak melenceng. Sesungguhnya kamu itu termasuk rasul Allah yang menerima wahyu Allah SWT dan akan mengabarkannya kepada manusia. Dalam hal itu ada suatu penguatan terhadap hati nabi dan meneguhkan urusannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat Allah. Kami membacakannya kepadamu dengan benar. Sesungguhnya kamu benar-benar termasuk di antara para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "252. “Itu adalah ayat-ayat dari Allah kami bacakan kepadamu dengan hak benar dan Sesungguhnya kamu benar-benar salah seorang diantara nabi nabi yang diutus.” Dan diantara sederet tanda-tanda kerasulan beliau adalah adanya kisah ini, dimana Allah mengabarkan kepada beliau tentang kisah ini sebagai wahyu untuk beliau dari Allah yang persis sesuai dengan kenyataan. Dalam cerita ini banyak sekali pelajaran yang dapat diambil oleh umat ini. Diantaranya: 1. Keutamaan berjihad dijalan Allah, manfaat manfaatnya dan akibat-akibatnya yang indah, dan bahwa jihad itu adalah satu-satunya sebab (yang paling efektif) dalam memelihara agama menjaga Negeri, tubuh dan harta, dan bahwasanya para Mujahidin walaupun urusan itu sangat berat buat mereka akan tetapi hasil yang mereka akan dapatkan adalah terpuji, sebagaimana juga bagi orang-orang yang meninggalkan jihad walaupun mereka dapat beristirahat sekejap, namun mereka akan lelah dalam masa yang panjang. 2. Memberikan kekuasaan kepada orang yang kapabel dan mampu, dan bahwasanya kemampuan itu kembali kepada dua perkara: pertama, pengetahuan, artinya memahami siasat dan mengorganisir, dan kedua, kekuatan, artinya dengannya kebenaran ditegakkan dan bahwa seorang yang terkumpul pada dirinya kedua perkara itu, maka dialah yang lebih berhak untuk memimpin daripada selainnya. 3. Menjadikan cerita ini sebagai dalil atas apa yang dikatakan oleh para ulama bahwa seyogyanya seorang pemimpin pasukan mengadakan peninjauan ketika menetapkannya, yaitu dia melarang orang yang tidak pantas untuk berperang dari personil tentaranya, kudanya, penunggang penunggang nya karena kelemahannya, kesabarannya yang sedikit, peremehannya, takut akan memudaratkan kesehatannya, karena bagian yang ini adalah bahaya yang jelas bagi manusia. 4. Bahwasanya ketika terjadi suatu peperangan, seyogyanya ada pengobaran semangat kaum muslimin, penguatan jiwa mereka dan anjuran kepada mereka untuk menguatkan keimanan, bertawakal penuh dan bersandar hanya kepadaNya, serta memohon kepadaNya ketetapan hati, bimbingan kepada kesabaran, dan pembelaan atas musuh. 5. Bahwasanya tekad untuk berperang dan berjihad bukanlah merupakan hakikatnya, karena Terkadang seseorang itu bertekad untuk berjihad akan tetapi ketika telah tiba masanya, tekadnya melemah. Oleh karena itu diantara doa Nabi “Aku memohon kepadaMu ya Allah ketetapan keteguhan dalam agama dan kebudayaan tekad dalam petunjuk.” Mereka itulah yang bertekad untuk berjihad dan mereka berkata dengan perkataan yang menunjukkan atas sebuah tekad yang kuat, dan ketika hadir masanya, sebagian besar dari mereka akhirnya lemah kembali. Ini serupa dengan sabda Nabi “Dan aku memohon kepadaMu ya Allah keridhoan setelah terjadinya Qada ketetapan.” Karena keridhaan setelah terjadinya suatu ketetapan Allah yang dibenci oleh jiwa merupakan keridhoan yang hakiki."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kemudian konteks ayat berpindah kepada Rasulullah Muhammad ﷺ dan berfirman kepadanya sebagai penetapan atas kenabian dan tingginya kedudukan beliau,”Itulah ayat-ayat Allah Ta’ala” yang telah berlalu penyebutannya,”Kami bacakan kepadamu dengan kebenaran, dan sesungguhnya engkau termasuk di antara rasul yang diutus.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 252: Ketahuilah wahai nabi Allah bahwasannya ini adalah kadar dan sebagai hujjah kisah kebenaran wahyu yang diceritakan kepadamu; dan sesungguhnya engkau adalah rasul ﷺ yang benar dan terpecaya dari sisi Rabbul Alamin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diperkuat kata-kata di atas dengan kata \"sesungguhnya\" dan \"benar-benar\" untuk membantah orang-orang kafir yang mengatakan bahwa Muhammad shallallahu 'alaihi wa sallam bukanlah rasul. Hal ini pun sekaligus persaksian Allah terhadap kerasulan Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 252",
    "description": "Itulah sebagian ayat-ayat Allah, khususnya mukjizat-Mukjizat yang tertera di dalam surah ini, seperti kisah bani israil tersebut. Kami bacakan dan turunkan ayat-ayat itu kepadamu dengan benar demi menguatkan Al-Qur'an sebagai kitab hidayah. Dan engkau, nabi Muhammad, adalah benar-benar seorang rasul, sebab tidak ada yang mampu menyebutkan kisah-kisah itu selain orang yang mendapat pengajaran dari Allahsetelah pada ayat yang lalu dijelaskan bahwa nabi Muhammad adalah salah seorang rasul yang diutus Allah, di sini dijelaskan kedudukan para rasul di sisi-Nya dan keadaan umat mereka setelah kepergian para rasul itu. Rasul-rasul yang mulia dan tinggi derajatnya yang telah kami sebutkan itu kami lebihkan sebagian mereka dari sebagian yang lain dengan keutamaan yang diberikan kepada mereka. Di antara mereka ada yang Allah berfirman dengannya secara langsung dan mengajaknya berbicara sesuai keagungan-Nya, seperti nabi musa saat berada di tur sina dan nabi Muhammad saat mikraj di sidratulmuntaha, dan sebagian lagi ada yang ditinggikan-Nya beberapa derajat seperti nabi Muhammad yang dibekali dengan ajaran yang bersifat universal. Dan kami beri isa putra maryam beberapa mukjizat yang menjadi bukti kebenaran risalah yang ia bawa, seperti menyembuhkan anak yang terlahir buta, orang yang menderita penyakit belang; menghidupkan orang yang sudah mati, dan sebagainya; semua atas izin Allah. Dan kami perkuat dia dengan rohulkudus, yaitu jibril yang selalu berada mendampingi dan memberinya dukungan hingga ia diangkat oleh Allah ke langit. Para rasul itu datang dengan membawa petunjuk, agama kebenaran, dan beberapa penjelasan. Maka, sudah semestinya semua manusia beriman, tidak berselisih dan saling memerangi. Tetapi kalau Allah menghendaki, niscaya orang-orang yang datang setelah mereka tidak akan berbunuh-bunuhan, bertengkar, mengutuk dan berkelahi sebagai puncak perselisihan mereka. Yang lebih buruk lagi, perselisihan mereka justru terjadi setelah bukti-bukti nyata sampai kepada mereka. Bukti-bukti itu mereka putar-balikkan dan disalahpahami, tetapi Allah tidak menghendaki sehingga mereka berselisih dan perselisihan itu mengantar mereka ke dalam pertengkaran, saling mengutuk, berkelahi dan/atau saling membunuh. Maka, dari perselisihan itu juga mengakibatkan ada di antara mereka yang beriman dan ada pula yang kafir. Kalau Allah menghendaki, tidaklah mereka umat para rasul itu berbunuh-bunuhan setelah terjadi perselisihan sesama mereka. Demikianlah, kalau menghendaki, tidak terjadi perselisihan itu, tetapi Allah berbuat menurut kehendak-Nya sesuai hikmah dan kebijaksanaan-Nya."
  }
]