[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para rasul yang mulia itu, Allah telah melebihkan sebagian dari mereka di atas sebagian yang lain, sesuai dengan anugrah yang Allah limpahkan pada mereka. Maka di antara mereka, ada orang yang Allah berbicara dengan mereka secara langsung seperti Musa dan Muhammad. Dalam ayat ini terkandung penetapan sifat kalam bagi Allah sesuai dengan keagunganNya. Dan di antara mereka ada yang Allah angkat munuju derajat-derajat yang tinggi seperti Muhammad sholallohu alaihi wasallam dengan universalitas risalah nya, ditutupnya kenabian dengannya, diungggulkannya umatnya di atas seluruh umat, dan keistimewaan-keistimewaan lainnya. Dan Allah telah memberikan kepada Isa putra Maryam bukti-bukti mukjizat yang mencengangkan, seperti menyembuhkan orang yang terlahir dalam keadaan buta dengan izin Allah dan orang yang mengidap penyakit lepra dengan izin Allah, dan seperti menghidupkan orang-orang yang telah mati dengan izin Allah, dan Allah memperkuatnya dengan malaikat Jibril. Dan sekiranya Allah menghendaki orang-orang yang datang setelah para rasul itu tidak saling membunuh setelah datangnya bukti-bukti nyata kepada mereka, maka mereka tidak akan saling membunuh. Akan tetapi, perpecahan telah terjadi di antara mereka. Maka, sebagian dari mereka ada yang tetap teguh di atas keimanannya dan sebagian bersikeras dengan kekufurannya. Dan seandainya Allah berkehendak pasca timbulnya perselisihan diantara mereka yang menyebabkan terjadinya saling bunuh, mereka tidak akan saling bunuh, akan tetapi Allah memberikan taufik kepada orang yang dikehendakiNya untuk taaat kepadaNya dan beriman kepadaNya dan mengabaikan orang yang dikehendakiNya, sehingga dia berbuat maksiat dan kafir kepadaNya. Dan Dialah Allah berbuatan apapun yang Dia kehendaki dan Dia pilih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "253. Para Rasul yang telah Kami ceritakan kepadamu itu Kami berikan sebagian mereka kelebihan dibandingkan sebagian yang lain dalam hal wahyu, pengikut dan derajatnya. Di antara mereka ada yang Allah ajak berbicara langsung kepadanya, seperti Musa -'alaihissalām-. Ada yang Allah angkat derajatnya ke tingkat yang tinggi, seperti Muhammad -ṣallallāhu 'alaihi wa sallam-, karena dia diutus untuk seluruh umat manusia dan menjadi penutup para Nabi. Sedangkan umatnya diberikan kelebihan atas umat-umat lainnya. Dan Kami berikan mukjizat-mukjizat yang nyata kepada Isa putra Maryam sebagai bukti kenabiannya, seperti menghidupkan orang mati dan menyembuhkan orang yang buta dan orang yang sakit lepra. Dan Kami dukung dia dengan Jibril -'alaihissalām- untuk menjalankan perintah Allah -Ta'ālā-. Sekiranya Allah menghendaki niscaya orang-orang yang datang sesudah para Rasul itu tidak akan saling berperang setelah datang kepada mereka bukti-bukti yang nyata, akan tetapi mereka berselisih paham kemudian terpecah belah. Maka ada yang beriman kepada Allah dan ada yang ingkar kepada-Nya. Sekiranya Allah menghendaki mereka tidak saling bunuh, niscaya mereka tidak saling berperang, tetapi Allah melakukan apa yang dikehendaki-Nya. Maka Allah menunjukkan orang yang Dia kehendaki kepada iman dengan kasih sayang dan kemurahan-Nya, dan Dia menyesatkan orang yang Dia kehendaki dengan keadilan dan kebijaksaan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "253. Para Rasul yang memiliki derajat yang tinggi itu telah Allah beri karunia sebagian mereka melebihi sebagaian yang lain. Sebagian mereka berbicara dengan Allah secara langsung, seperti Musa dan Muhammad, dan meninggikan sebagian lainnya melebihi yang lain, seperti Nabi Ibrahim, Idris, dan Muhammad; dan Allah memberi kepada Isa berbagai mukjizat besar dan menguatkannya dengan malaikat Jibril. Seandainya Allah menghendaki, orang-orang yang ada setelah kepergian para rasul tidak akan saling berperang setelah dalil-dalil dan mukjizat dating kepada mereka. Namun umat-umat para nabi saling berselisih sampai saling berperang; sebagian mereka beriman kepada Allah dan sebagian yang lain mengingkari. Andai Allah tidak menghendaki niscaya hal itu tidak akan terjadi, namun Allah melakukan segala sesuatu apa yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "253. تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ (Rasul-rasul itu Kami lebihkan sebagian (dari) mereka atas sebagian yang lain ) Yakni Allah memberikan sebagian mereka sifat kesempurnaan diatas yang diberikan kepada yang lain. Qatadah berkata: (diantaranya) Allah telah menjadikan Nabi Ibrahim Khalil (kekasih terdekat-Nya, berbincang langsung dengan Nabi Musa, menciptakan Nabi Isa tanpa seorang ayah, memberi Nabi Isa Kitab Zabur, memberi Nabi Sulaiman kerajaan yang tidak akan ditandingi siapapun setelahnya, dan mengutus Nabi Muhammad kepada seluruh manusia. Dan diriwayatkan Abu Hurairah hadist marfu’ yang berbunyi: (jangan kalian utamakan aku dari Nabi-Nabi yang lain) Rasulullah mengatakan itu sebagai bentuk kerendahan hati, padahal beliau mengetahui bahwa dirinya adalah Nabi yang paling utama, sebagaimana sabda beliau: (aku adalah pemimpin anak Adam). Namun walaupun begitu kita tidak patut untuk mengatakan Nabi Muhammad lebih mulia dari Nabi Musa atau Isa dengan menyebutkan nama, sebagaimana hadist yang telah disebutkan. مِّنْهُم مَّن كَلَّمَ اللهُ ۖ ( Di antara mereka ada yang Allah berkata-kata (langsung dengan dia)) Yakni Nabi Musa dan Nabi Muhammad, dan ini adalah bentuk pengutamaan Allah kepada keduanya. وَرَفَعَ بَعْضَهُمْ دَرَجٰتٍ ۚ ( dan sebagiannya Allah meninggikannya beberapa derajat) Yakni para Nabi yang memiliki derajat yang tinggi di sisi Allah. Dan terdapat kemungkinan bahwa yang dimaksud adalah Nabi kita Muhammad karena kelebihan-kelebihannya yang begitu banyak; dan kemungkinan juga Nabi Idris yang telah diangkat ke derajat yang tinggi. Pendapat lain mengatakan mereka adalah para Ulul Azmi, Nabi Nuh, Ibrahim, Musa, Isa, dan Muhammad. وَءَاتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنٰتِ (Dan Kami berikan kepada Isa putera Maryam beberapa mukjizat ) Dan ini adalah bentuk dari pengutamman Allah kepadanya yang diberi kemampuan untuk menghidupkan orang mati dan menyembuhkan orang sakit dengan izin-Nya, serta kemampuan lainnya. وَأَيَّدْنٰهُ بِرُوحِ الْقُدُسِ ۗ ( serta Kami perkuat dia dengan Ruhul Qudus) Potongan ayat ini telah dijelaskan pada ayat 87. وَلَوْ شَآءَ اللهُ مَا اقْتَتَلَ الَّذِينَ مِنۢ بَعْدِهِم ( Dan kalau Allah menghendaki, niscaya tidaklah berbunuh-bunuhan orang-orang (yang datang) sesudah mereka) Yakni sesudah rasul-rasul. Pendapat lain mengatakan sesudah Nabi Musa, Isa, dan Muhammad. وَلٰكِنِ اخْتَلَفُوا۟ (akan tetapi mereka berselisih ) Yakni umat-umat para nabi saling berselisih setelah masa nabi-nabi tersebut bahkan mereka saling bunuh membunuh sehingga menjadi agama-agama yang berbeda-beda. وَلَوْ شَآءَ اللهُ (Seandainya Allah menghendaki ) Yakni menghendaki agar mereka tidak saling bunuh membunuh setelah tejadinya perselisihan ini. مَا اقْتَتَلُوا۟ وَلٰكِنَّ اللهَ يَفْعَلُ مَا يُرِيدُ(tidaklah mereka berbunuh-bunuhan. Akan tetapi Allah berbuat apa yang dikehendaki-Nya ) Tidak ada yang bisa menolak keputusan-Nya atau mengubah qadha’-Nya; akan tetapi Dia berbuat apa yang dikehendaki-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ } Sesungguhnya ayat ini mengatakan : { تِلْكَ } dan tidak menyebut ( أولئك الرسل ), tidak lain karena ayat ini bermaksud kepada jamaah, maka seakan-akan ayat ini mengatakan : sesungguhnya jmaah itu adalah para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "253. Wahai Rasulullah, para rasul yang kabar-kabarnya diceritakan kepadamu dalam Al-Qur’an itu diutamakan dengan karakteristik dan keahliannya masing-masing, serta dibedakan satu sama lain dengan beberapa keahliannya masing-masing. Di antaranya ada yang bisa berbicara dengan Allah secara langsung, yaitu Musa AS dan nabi Muhammad SAW, ada yang derajatnya di angkat seperti Idris AS, Ibrahim AS, dan nabi Muhammad SAW. Dan Allah memberi Isa mukjizat yang menunjukkan pada kenabiannya, yaitu yang disebutkan dalam ayat ke 49 surah Ali Imran, seperti menghidupkan orang mati, menyembuhkan penyakit, dengan seizin Allah, Allah menguatkannya dengan Ruhul Qudus, yaitu Jibril AS. Jika Allah berkehendak, niscaya orang-orang yang datang setelah para rasul dan datangnya dalil nyata atas kebenaran rasul mereka itu tidak akan saling membunuh. Namun setelah adanya hujjah tersebut atas mereka, para umat nabi-nabi saling berselisih, sehingga mereka saling membunuh. Di antara mereka ada yang beriman kepada Allah dan rasulNya, ada pula yang ingkar kepada Allah dan rasulNya. Jika Allah berkehendak untuk meniadakan tindakan saling bunuh setelah adanya perselisihan ini, niscaya mereka tidak akan saling bunuh, namun Allah melakukan apa yang Dia kehendaki untuk menunjukkan hikmah yang Dia tentukan. Tidak ada yang bisa menolak hukumNya. Dia mengerjakan sesuatu yang Dia kehendaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para rasul itu Kami lebihkan sebagian mereka atas sebagian lainnya. Di antara mereka ada yang Allah berbicara langsung dengannya. Sebagian lagi Dia tinggikan beberapa derajat. Kami telah menganugerahkan kepada Isa putra Maryam bukti-bukti yang sangat jelas} mukjizat yang jelas seperti menyembuhkan orang yang terlahir buta dan orang yang berpenyakit lepra, menghidupkan orang mati dan memberitahun tentang sesuatu yang mereka makan dan mereka simpan {dan Kami memperkuat dia} Kami memperkuat dia {dengan Ruhul kudus} Malaikat Jibril AS {Seandainya Allah menghendaki, niscaya orang-orang setelah mereka tidak akan saling membunuh} setelah para rasul itu {setelah bukti-bukti nyata itu sampai kepada mereka. Akan tetapi mereka berselisih, di antara mereka ada yang beriman dan ada yang kufur. Jika Allah menghendaki, mereka tidak akan saling membunuh. Tetapi Allah melakukan apa yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "253. Allah sang Pencipta mengabarkan bahwa Dia membeda-bedakan tingkat (derajat) antara para rasul dalam keutamaan-keutamaan yang mulia dan keistimewaan-keistimewaan yang indah, sesuai dengan keutamaan yang dikaruniakan olehNya atas mereka dan penegakan yang mereka lakukan dari keimanan yang sempurna, keyakinan yang kuat, akhlak yang luhur, tingkah laku yang terpuji, dakwah, pengajaran, dan kegunaan yang menyeluruh. Maka di antara mereka ada yang Allah jadikan sebagai kekasihNya, di antara mereka ada juga yang diajak bicara langsung olehNya, di antara mereka ada yang di angkat olehNya di atas para makhluk beberapa derajat, dan untuk keseluruhan para nabi, tidak ada seorang pun manusia yang mampu mencapai keutamaan mereka yang tinggi. Allah mengistimewakan Isa bin Maryam bahwa dia diberikan keterangan-keterangan yang jelas yang menunjukkan akan kerasulannya dengan yakin dan kehambaannya dengan benar dan bahwa risalah yang dibawanya dari Allah semuanya adalah benar, lalu Allah menjadikannya mampu menyembuhkan orang yang buta, penyakit usta, dan mampu menghidupkan orang mati dengan izin Allah, Nabi Isa berbicara dengan manusia saat masih dalam buaian, diperkuat dengan Ruhul Qudus yaitu ruh keimanan yang menjadikan ruhani beliau unggul di atas selainnya. Dengan itu semua dia mendapatkan kekuatan dan pertolongan, walaupun dasar dari pertolongan dengan ruh tersebut bersifat umum bagi setiap Mukmin sesuai dengan keimanannya, sebagaimana Allah berfirman, \"menguatkan mereka dengan pertolongan yang datang daripada-Nya.\" -Al-Mujadilah:22- Akan tetapi apa yang didapatkan oleh Nabi Isa adalah lebih besar daripada yang didapatkan selainnya. Karena itulah Allah mengkhususkannya dengan menyebutnya. Pendapat lain mengatakan bahwa Ruh Qudus di sini adalah Jibril, yakni Allah menguatkan Nabi Isa dengan pertolongan Jibril dan bantuannya. Akan tetapi maknanya yang benar adalah yang pertama. Dan ketika Allah mengabarkan tentang kesempurnaan para Rasul dana pa yang Allah berikan kepada mereka dari keutamaan dan keistimewaan dan bahwa agama mereka adalah satu, dakwah mereka kepada kebaikan adalah satu, di mana seharusnya dan konsekuensi dari itu adalah bersatunya seluruh umat untuk membenarkannya dan patuh kepada mereka, karena apa yang mereka dapatkan dari keterangan-keterangan yang jelas yang dengan hal seperti itu manusia pasti beriman, akan tetapi sebagian besar dari mereka berpaling dari jalan yang lurus, dan terjadilah perselisihan antara seluruh umat, di antara mereka ada yang beriman dan di antara mereka ada yang kafir, maka akibat dari itu semua adalah terjadinya saling membunuh yang merupakan akibat dari perpecahan dan perselisihan serta permusuhan, seandainya Allah menghendaki, pastilah Allah akan menyatukan mereka di atas petunjuk hingga mereka tidak berselisih, dan sekiranya Allah juga menghendaki setelah terjadinya perselisihan itu yang mengakibatkan saling membunuh, pastilah mereka tidak saling membunuh, akan tetapi hikmah Allah telah tetap berjalan dengan segala perkara di atas pengaturan itu sesuai dengan sebab-sebabnya. Ayat ini merupakan tanda yang paling besar atas adanya andil tindakan dari Allah pada seluruh sebab-sebab yang mengakibatkan segala macam hasilnya, dan bahwasanya bila Dia menghendaki, Dia akan melarangnya. Semua itu tunduk pada hikmahNya semata, karena Allah Maha Melakukan apa yang dikehendakiNya, tidak ada penghalang, tidak pula penentang, dan tidak pula penolong di hadapan keinginan dan kehendakNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { تِلۡكَ ٱلرُّسُلُ } Tilkarrusulu: Mereka para rasul yang sebagiannya diceritakan oleh Allah ta’ala kepada rasulNya (Muhammad ﷺ) kemudian Allah mengabarkan bahwa Muhammad merupakan bagian dari mereka dalam ayat,”Sesungguhnya kamu adalah sebagian dari para rasul itu.” Pada ayat sebelumnya. { مَّن كَلَّمَ ٱللَّهُۖ } Man kallamallâh: Hamba yang diajak bicara oleh Nya seperti Nabi Musa ‘alaihissalam. { وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ } Wa rafa’a ba’dhahum darajât: Yaitu Nabi Muhammad ﷺ yang Allah tinggikan derajatnya dibandingkan seluruh rasul yang ada. { ٱلۡبَيِّنَٰتِ } Al-Bayyinât: Berbagai mukjizat yang menunjukkan kebenaran kenabian dan kerasulan Isa ‘alaihissalam. { رُوحِ ٱلۡقُدُسِۗ } Rûhul qudus: Malaikat Jibril ‘alaihissalam yang senantiasa berada di sisi Nabi Isa untuk membantunya dan menguatkannya sampai beliau diangkat ke hadirat Allah ta’ala. { ٱقۡتَتَلُواْ } Iqtatalû: Saling membunuh satu sama lain. Makna ayat: Pada ayat sebelumnya Allah Ta’ala menceritakan kisah kaum Bani Israil kepada Nabi Muhammad, mengenai permintaan mereka kepada Nabi Syamuel untuk menentukan seseorang menjadi pemimpin untuk mereka dalam jihad. Dalam kisah ini terdapat peristiwa-peristiwa yang tidak mungkin diketahui oleh seorang yang tidak bisa baca tulis (ummiy) seperti Nabi Muhammad ﷺ, tanpa melalui wahyu yang Allah wahyukan kepadanya. Kemudian Allah Ta’ala menutup kisah tersebut dengan menetapkan kenabian dan kerasulan Muhammad ﷺ dengan firman Nya,”Sesungguhnya engkau adalah benar-benar sebagian dari rasul itu.” Allah Ta’ala mengabarkan bahwa di antara para rasul itu adalah yang diunggulkan dibanding lainnya, ada yang mendapat keutamaan diajak berbicara langsung oleh Allah seperti Nabi Musa ‘alaihissalam, ada juga yang mendapatkan kedudukan sebagai kekasihNya (khalilullah) seperti Nabi Ibrahim ‘alaihissalam, ada yang di angkat ke atas langit kehadiratNya dan dibisikiNya yaitu Muhammad ﷺ, ada yang diberikan kerajaan dan hikmah dan diajari cara membuat baju besi seperti Nabi Dawud ‘alaihissalam, di antara mereka juga ada yang diberikan kerajaan dan hikmah, jin tunduk kepadanya dan mengerti perkataan burung seperti Nabi Sulaiman ‘alaihissalam, dan ada juga yang diberikan bukti-bukti yang nyata (bayyinât) dan diperkuat dengan Malaikat Jibril (rûhul qudus) yaitu Nabi Isa ‘alaihissalam. Allah Ta’ala berfirman; تِلۡكَ ٱلرُّسُلُ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضٖۘ مِّنۡهُم مَّن كَلَّمَ ٱللَّهُۖ وَرَفَعَ بَعۡضَهُمۡ دَرَجَٰتٖۚ “Rasul-rasul itu Kami lebihkan sebagian (dari) mereka atas sebagian yang lain, di antara mereka ada yang Allah berbicara (langsung dengan dia), dan sebagiannya Allah meninggikaknnya beberapa derajat.” Sebagaimana Nabi kita Muhammad ﷺ mendapat keutamaan berupa risalah dan kenabian yang bersifat umum untuk seluruh manusia, dan menjadi menjadi penutup para nabi, begitu juga umatnya mendapatkan keutamaan dibanding umat lain, ada yang namanya tertera masuk surga selagi beliau masih hidup dan belum meninggal, beliau mendapat keistimewaan diajak bicara langsung oleh Allah dan dibisiki, dan beliau bisa memberikan syafa’at pada hari kiamat. Kemudian Allah mengabarkan apabila Dia berkehendak untuk memberikan hidayah kepada manusia tentu Dia akan memberikannya, sehingga mereka tidak akan berselisih setelah kepergian rasul dan mereka tidak saling membunuh satu sama lain setelah datangnya bukti-bukti yang nyata karena besarnya kekuasaan Allah Ta’ala. Dengan kehendakNya, Allah melakukan apa saja dan menentukan apa yang Dia inginkan. Ini beberapa faidah yang tertera ada ayat (253). Pelajaran dari ayat: • Para rasul itu di antara mereka mendapat keutamaan dibanding yang lainnya sesuai dengan kadar perjuangan (jihad), kesabaran dan kesempurnaan yang diberikan oleh Allah kepada mereka. • Sifat berbicara (kalam, pent) bagi Allah Ta’ala, dimana Allah mengajak berbicara nabi Musa di bukit Thur. Mengajak bicara nabi Muhammad ﷺ di alam tertinggi . • Kekafiran, keimanan, petunjuk dan kesesatan, peperangan dan kedamaian. Itu semua mengikuti kehendak Allah dan kebijaksanaanNya. • Celaan terhadap perselisihan dalam agama, dan hal itu merupakan sumber kerugian dan bencana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 253: Allah mengabarkan bahwasannya Dia mengunggulkan rasul atas sebagaimna lain dan diantar para rasul terdapat utusan yang dapat berbicara dengan Allah misal Adam, Musa, dan Muhammad ﷺ ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seorang hamba di samping wajib mengenal Allah, hendaknya mengenal para rasul-Nya sifat wajib, mustahil dan yang ja'iz (boleh terjadi) pada diri mereka. Untuk mengetahuinya dapat kita peroleh dari dari penjelasan Allah Subhaanahu wa Ta'aala di beberapa ayat tentang sifat mereka. Di antaranya adalah bahwa mereka laki-laki bukan wanita, berasal dari penduduk tersebut, bukan dari pelosok (badui), mereka adalah orang-orang terpilih, Allah menghimpun pada dirinya semua sifat terpuji dan bahwa mereka selamat dari semua yang menodai risalah mereka, seperti dusta, khianat, sifat menyembunyikan dan sifat tercela lainnya. Mereka juga tidak keliru dalam hal risalah dan taklif (pembebanan syari'at), Allah Subhaanahu wa Ta'aala juga mengkhususkan mereka dengan wahyu-Nya. Oleh karena itu, kita wajib beriman dan mentaati mereka. Barang siapa yang tidak beriman kepada mereka, maka dia adalah kafir, mencacati mereka atau memaki meereka pun kafir. Dalil-dalil apa yang disebutkan di sini banyak sekali, dan barang siapa yang mentadabburi Al Qur'an, maka akan semakin jelas lagi. Seperti Nabi Musa 'alaihis salam. Yakni Nabi Muhammad shallallahu 'alaihi wa sallam dengan umumnya risalah Beliau, ditutupnya kenabian dengan Beliau, dilebihkan umatnya di atas umat-umat yang lain dll. Bahkan pada diri Beliau berkumpul keistimewaan yang terpisah-pisah pada diri yang lain. Seperti dapat menyembuhkan seorang yang buta sejak lahir, orang yang terkena penyakit sopak dan menghidupkan orang yang sudah mati. Semua itu dengan izin Allah. Hal tersebut untuk membuktikan kenabiannya, bahwa dia adalah hamba Allah dan rasul-Nya, kalimat-Nya yang disampaikan kepada Maryam dan dengan tiupan ruh dari-Nya. Menurut jumhur musafirin, bahwa Ruhul Qudus itu ialah Malaikat Jibril. Malaikat Jibril berjalan bersama Nabi Isa di mana saja ia berjalan. Ada pula yang mengartikan Ruhul Qudus dengan \"iman, keyakinan dan diberi kekuatan untuk menjalankan perintah yang dibebankan kepadanya\". Di antara mereka ada yang beriman dan ada yang tetap kafir. Akibatnya, terjadilah perpecahan, permusuhan dan peperangan. Meskipun begitu, jika Allah menghendaki tentu tidak akan terjadi saling membunuh. Dalam ayat di atas terdapat dalil bahwa Allah Subhaanahu wa Ta'aala senantiasa berbuat sesuai yang dikehendaki-Nya dan sesuai hikmah-Nya. Di antara perbuatan-Nya adalah sebagaimana yang diberitakan Allah dan rasul-Nya, seperti: istiwa' (bersemayam), turun ke langit dunia di sepertiga malam terakhir, berkata dan berbuat. Perbuatan tersebut disebut af'aal ikhtiyariyyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 253",
    "description": "Setelah pada ayat yang lalu dijelaskan bahwa nabi Muhammad adalah salah seorang rasul yang diutus Allah, di sini dijelaskan kedudukan para rasul di sisi-Nya dan keadaan umat mereka setelah kepergian para rasul itu. Rasul-rasul yang mulia dan tinggi derajatnya yang telah kami sebutkan itu kami lebihkan sebagian mereka dari sebagian yang lain dengan keutamaan yang diberikan kepada mereka. Di antara mereka ada yang Allah berfirman dengannya secara langsung dan mengajaknya berbicara sesuai keagungan-Nya, seperti nabi musa saat berada di tur sina dan nabi Muhammad saat mikraj di sidratulmuntaha, dan sebagian lagi ada yang ditinggikan-Nya beberapa derajat seperti nabi Muhammad yang dibekali dengan ajaran yang bersifat universal. Dan kami beri isa putra maryam beberapa mukjizat yang menjadi bukti kebenaran risalah yang ia bawa, seperti menyembuhkan anak yang terlahir buta, orang yang menderita penyakit belang; menghidupkan orang yang sudah mati, dan sebagainya; semua atas izin Allah. Dan kami perkuat dia dengan rohulkudus, yaitu jibril yang selalu berada mendampingi dan memberinya dukungan hingga ia diangkat oleh Allah ke langit. Para rasul itu datang dengan membawa petunjuk, agama kebenaran, dan beberapa penjelasan. Maka, sudah semestinya semua manusia beriman, tidak berselisih dan saling memerangi. Tetapi kalau Allah menghendaki, niscaya orang-orang yang datang setelah mereka tidak akan berbunuh-bunuhan, bertengkar, mengutuk dan berkelahi sebagai puncak perselisihan mereka. Yang lebih buruk lagi, perselisihan mereka justru terjadi setelah bukti-bukti nyata sampai kepada mereka. Bukti-bukti itu mereka putar-balikkan dan disalahpahami, tetapi Allah tidak menghendaki sehingga mereka berselisih dan perselisihan itu mengantar mereka ke dalam pertengkaran, saling mengutuk, berkelahi dan/atau saling membunuh. Maka, dari perselisihan itu juga mengakibatkan ada di antara mereka yang beriman dan ada pula yang kafir. Kalau Allah menghendaki, tidaklah mereka umat para rasul itu berbunuh-bunuhan setelah terjadi perselisihan sesama mereka. Demikianlah, kalau menghendaki, tidak terjadi perselisihan itu, tetapi Allah berbuat menurut kehendak-Nya sesuai hikmah dan kebijaksanaan-Nyawahai orang-orang yang beriman kepada Allah dan membenarkan rasul-Nya serta mengikuti petunjuknya! infakkanlah dengan mengeluarkan sebagian dari rezeki yang telah kami berikan kepadamu, baik dalam bentuk yang wajib seperti zakat maupun infak yang bersifat sunah. Bersegeralah sebelum datang hari ketika tidak ada lagi jual beli yang mendatangkan keuntungan, atau seseorang dapat membeli dirinya dengan sejumlah harta yang ia bayarkan sebagai tebusan agar dirinya tidak mendapat siksa tuhan pada hari kiamat, ketika tidak ada lagi persahabatan yang memungkinkan seseorang membantu walau persahabatan itu sangat dekat yang dapat menyelamatkan dari azab Allah. Kalau sahabat yang sangat akrab saja tidak bisa, apalagi sahabat biasa. Dan pada hari itu tidak ada lagi syafaat pertolongan dari seseorang yang dapat meringankan azab kecuali dari orang-orang yang mendapat izin dan rida dari Allah. Orang-orang kafir itulah orang yang zalim dengan melampaui batas-batas yang telah ditetapkan oleh Allah, sebab mereka tidak menyambut baik seruan kebenaran."
  }
]