[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan membenarakan rasulNya, serta mengamalkan petunjuk ajaranNya, keluarkanlah zakat yang wajib dan bersedekahlah kalian dengan apa yang Allah berikan kepada kalian sebelum datangnya Hari Kiamat, yaitu ketika tidak ada lagi jual beli yang mendatangkan keuntungan, dan tidak ada harta yang dapat kalian gunakan untuk menebus diri kalian dari siksaan Allah dan tidak ada hubungan persahabatan dengan kawan karib yang akan menolong kalian, dan tidak ada pemberi syafaat yang memberi hak untuk meringankan siksaan dari kalian. Dan orang-orang kafir itu adalah orang-orang yang berbuat kedzhaliman lagi melampaui batas-batas Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "254. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya! Infakkanlah sebagian dari rezeki yang Kami berikan kepada kalian, yang berasal dari berbagai harta yang halal sebelum hari kiamat tiba. Karena pada hari itu tidak ada lagi jual-beli yang bermanfaat bagi manusia; juga tidak ada persahabatan yang berguna baginya di waktu susah; dan tidak pula ada perantara yang dapat menolak mudarat atau mendatangkan manfaat kecuali setelah mendapatkan izin dari Allah bagi orang yang Dia kehendaki dan Dia restui. Dan orang-orang kafir itu adalah orang-orang zalim yang sebenarnya karena keingkaran mereka kepada Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "254. Allah memerintahkan orang-orang beriman untuk berinfak pada segala jenis jalan kebaikan dengan harta yang Allah berikan kepada mereka. Allah memerintahkan untuk membayar zakat dan bersedekah sebelum datang hari kiamat, hari dimana seseorang tidak dapat menebus dirinya dengan harta dan tidak akan mendapatkan penolong yang dapat menolongnya dari azab. Dan orang-orang yang mendustakan Allah adalah orang-orang yang menzalimi diri sendiri dan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "254. أَنفِقُوا۟(belanjakanlah) Yakni berinfaklah dijalan Allah selagi kalian mempu sebagai tabungan apa yang bermanfaat bagi kalian di hari kiamat. مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا بَيْعٌ فِيهِ (sebelum datang hari yang pada hari itu tidak ada lagi jual beli) Maka belilah apa yang menjadi keselamatan bagi kalian. وَلَا خُلَّةٌ (tidak ada hubungan persahabatan) Yakni hubungan persahabatan dan kasih sayang. وَلَا شَفٰعَةٌ ۗ (dan tidak ada lagi syafa’at ) Yakni (tidak ada lagi syafaat) yang berlaku kecuali untuk orang yang diizinkan Allah. وَالْكٰفِرُونَ هُمُ الظّٰلِمُونَ (Dan orang-orang kafir itulah orang-orang yang zalim) Yakni sebab mereka telah mendustakan para Rasul dan melanggar sumpah-sumpah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dan sesungguhnya banyaknya disebutkan dalam al-qur'an tentang ancaman bagi orang-orang zholim, tidak lain adalah orang-orang musyrikun dan kaum kafir sebagaimana firman Allah : { وَالْكَافِرُونَ هُمُ الظَّالِمُونَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "254. Wahai orang-orang yang beriman berinfaklah di jalan Allah dari rejeki yang diberikan Allah kepada kalian sesuai kemampuan, supaya kalian menerima pahala di akhirat sebelum datangnya hari kiamat yang mana tidak ada jual-beli di dalamnya sehingga kalian bisa menebus diri kalian dari azab, dan hari dimana di dalamnya tidak ada pertolongan dan belas kasihan. Orang-orang kafir itu adalah orang-orang yang menzalimi diri sendiri dengan mendustakan para rasul dan mengingkari perintah Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, infakkanlah sebagian dari rezeki yang telah Kami anugerahkan kepada kalian sebelum datang hari dimana tidak ada jual beli di dalamnya} manusia tidak melakukan jual beli saat itu {tidak ada persahabatan} tidak ada juga pertemanan {dan tidak ada pula syafaat. Orang-orang kafir itulah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "254. Allah menganjurkan kepada kaum Mukminin untuk berinfak pada segala macam bentuk kebaikan, karena tidak disebutkannya obyek dalam kalimat menunjukkan pada keumuman. Dan Allah juga mengingatkan tentang nikmatNya atas mereka, bahwa Allah-lah yang telah memberi rizki kepada mereka dan memberikan berbagai macam nikmat atas mereka, dan Allah tidak memerintahkan kepada mereka untuk mengeluarkan seluruh harta yang ada pada mereka, akan tetapi ayat ini hadir dengan kata ‘min’ (dari) yang menunjukkan arti sebagian, maka hal ini di antara perkara yang mengajak mereka untuk berinfak, dan juga di antara hal yang mengajak mereka untuk berinfak adalah kabar Allah kepada mereka bahwa infak-infak tersebut akan tersimpan rapi di sisi Allah pada suatu hari yang tidak ada gunanya lagi saling tawar menawar untuk berjual beli dan semacamnya, tidak pula bantuan-bantuan sosial maupun syafa’at. Setiap orang akan berkata apa yang telah saya persembahkan untuk kehidupan saya, maka seluruh sebab-sebab akan lenyap, kecuali sebab-sebab yang berkaitan dengan ketaatan kepada Allah dan keimanan kepadaNya, \"(yaitu) di hari harta dan anak-anak laki-laki tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih\" -Asy-Syu’ara:88-89- \"Dan sekali-kali bukanlah harta dan bukan (pula) anak-anak kamu yang mendekatkan kamu kepada Kami sedikitpun; tetapi orang-orang yang beriman dan mengerjakan amal-amal (saleh, mereka itulah yang memperoleh balasan yang berlipat ganda disebabkan apa yang telah mereka kerjakan; dan mereka aman sentosa di tempat-tempat yang tinggi (dalam surga).\" Saba:37 \"Dan kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh (balasan)nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya.\" Al-Muzzammil:20- Kemudian Allah berfirman, “Dan orang-orang kafir itulah orang-orang yang zhalim.” Hal itu karena Allah menciptakan mereka hanya untuk beribadah kepadaNya, Dia memberi rizki dan menyehatkan mereka agar mereka mampu mengerjakan ketaatan dengannya, namun mereka berpaling dari tujuan Allah menciptakan mereka, mereka menyekutukan Allah dengan apa yang tidak Allah turunkan keterangan tentangnya. Mereka melakukan kekufuran, kefasikan, dan kemaksiatan dengan kenikmatan itu, mereka tidak meletakkan keadilan pada tempatnya, oleh karena itulah kezhaliman yang mutlak meliputi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم } Anfiqû mimmâ razaqnâkum: Infaqkanlah dari sebagian rezeki untuk infaq yang wajib seperti zakat, atau infaq yang disunnahkan. { لَّا بَيۡعٞ فِيهِ } Lâ bai’un fîhi: Tidak bisa seorang pun yang bisa menebus dirinya dengan harta agar terbebas dari siksaan. { وَلَا خُلَّةٞ } Wa Lâ khullah: Tidak ada juga pertemanan atau relasi yang bisa membantunya. { وَلَا شَفَٰعَةٞۗ } Wa Lâ syafâ’ah: Tidak diterima syafa’at kecuali dengan izin Allah bagi siapa saja yang dikehendakiNya dan diridhaiNya. { وَٱلۡكَٰفِرُونَ } Wal kâfirûna: Orang-orang kafir yang enggan membayar zakat dan hak-hak yang wajib yang disyariatkan Allah dan untuk hamba-hambaNya adalah orang-orang zhalim. Makna ayat: Pada ayat (254) Allah Ta’ala memanggil hamba-hambaNya yang beriman dan memerintahkan mereka untuk mengeluarkan sebagian harta (infaq) di jalan Allah. Sebagai bentuk mendekatkan diri kepada Nya dan mengumpulkan bekal sebelum hari kiamat, untuk menghadapi perjumpaan dengan Nya dimana tidak ada lagi tebusan maupun jual beli. Tidak ada sedekah yang bermanfaat dan syafa’at yang berlaku. Orang-orang yang ingkar (kafir) terhadap kenikmatan Allah dan syariat-syariatNya merekalah orang-orang zhalim yang pantas mendapatkan azab, keharaman dan kerugian. Pelajaran dari ayat: • Kewajiban untuk berinfaq di jalan Allah dari hasil yang Allah rizkikan kepada hambaNya. • Peringatan agar tidak lalai melakukan sebab keberhasilan pada hari kiamat, pada saat tidak ada tebusan ataupun teman dekat yang berguna, tidak ada juga syafa’at. Di antara sebab terbesar adalah beriman dan beramal shalih, serta mengeluarkan harta untuk sedekah dalam rangka mendekatkan diri kepada Allah Ta’ala dalam jihad dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 254: Mencakup sedekah wajib (seperti zakat) maupun sedekah sunat agar mereka memiliki simpanan dan pahala yang besar di hari akhirat, hari di mana orang-orang sangat membutuhkan amal shalih meskipun seberat dzarrah (debu). Di akhirat tidak ada lagi jual beli untuk memperoleh laba atau keuntungan. Seseorang pun tidak dapat menebus dirinya dari azab Allah meskipun dengan mengeluarkan emas sepenuh bumi. Kawan pun tidak dapat memberikan manfaat baik dengan kedudukannya maupun dengan syafa'at (memberikan pertolongan). Syafa'at adalah usaha perantaraan dalam memberikan suatu manfaat bagi orang lain atau menghindarkan suatu madharat bagi orang lain. Syafa'at yang tidak diterima di sisi Allah adalah syafa'at bagi orang-orang kafir. Pada hari itu kehinaan betul-betul menimpa orang-orang yang zalim, yaitu orang-orang yang tidak menempatkan sesuatu pada tempatnya atau tidak memberikan hak kepada yang memilikinya. Mereka tidak memenuhi hak Allah (untuk diibadati) dan hak hamba-hamba-Nya, berpaling dari yang halal kepada yang haram, dan kezaliman yang paling besar adalah kekafiran kepada Allah, yaitu dengan mengarahkan ibadah kepada selain-Nya, padahal selain Allah tidak memiliki hak diibadati. Oleh karena itulah, orang-orang kafir disebut orang-orang yang zhalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 254",
    "description": "Wahai orang-orang yang beriman kepada Allah dan membenarkan rasul-Nya serta mengikuti petunjuknya! infakkanlah dengan mengeluarkan sebagian dari rezeki yang telah kami berikan kepadamu, baik dalam bentuk yang wajib seperti zakat maupun infak yang bersifat sunah. Bersegeralah sebelum datang hari ketika tidak ada lagi jual beli yang mendatangkan keuntungan, atau seseorang dapat membeli dirinya dengan sejumlah harta yang ia bayarkan sebagai tebusan agar dirinya tidak mendapat siksa tuhan pada hari kiamat, ketika tidak ada lagi persahabatan yang memungkinkan seseorang membantu walau persahabatan itu sangat dekat yang dapat menyelamatkan dari azab Allah. Kalau sahabat yang sangat akrab saja tidak bisa, apalagi sahabat biasa. Dan pada hari itu tidak ada lagi syafaat pertolongan dari seseorang yang dapat meringankan azab kecuali dari orang-orang yang mendapat izin dan rida dari Allah. Orang-orang kafir itulah orang yang zalim dengan melampaui batas-batas yang telah ditetapkan oleh Allah, sebab mereka tidak menyambut baik seruan kebenaran. Allah; tidak ada tuhan yang pantas disembah dan dipertuhan selain dia. Yang mahahidup, kekal, dan memiliki semua makna kehidupan yang sempurna, yang terus menerus mengurus makhluk-Nya. Tidak seperti manusia, dia tidak mengantuk dan tidak pula tidur, sebab keduanya adalah sifat kekurangan yang membuat-Nya tidak mampu mengurus makhluk-Nya. Milik-Nya apa yang ada di langit dan apa yang ada di bumi. Dia yang menciptakan, memelihara, memiliki, dan bertindak terhadap semua itu. Tidak ada yang dapat memberi syafaat pertolongan di sisi-Nya tanpa izin-Nya. Dia demikian perkasa dan kuasa sehingga berbicara di hadapan-Nya pun harus setelah memperolah restu-Nya, bahkan apa yang disampaikan itu harus sesuatu yang benar. Dia mengetahui apa yang di hadapan mereka, yakni apa saja yang sedang dan akan terjadi, dan apa yang di belakang mereka, yakni sesuatu yang telah berlalu. Allah mengetahui apa yang mereka lakukan dan rencanakan, baik yang berkaitan dengan masa kini, masa lampau, atau masa depan. Dan mereka tidak mengetahui sesuatu apa pun tentang ilmu-Nya melainkan apa yang dia kehendaki untuk mereka ketahui dengan memperlihatkan dan memberitahukannya. Kursi-Nya, yaitu kekuasaan, ilmu, atau kursi tempat kedua kaki tuhan (yang tidak diketahui hakikatnya kecuali oleh Allah) berpijak, sangat luas, meliputi langit dan bumi. Dan jangan menduga karena kursi-Nya terlalu luas, dia letih mengurus itu semua. Tidak! dia tidak merasa berat maupun kesulitan memelihara keduanya, dan dia mahatinggi zat dan sifat-sifat-Nya jika dibanding makhluk-makhluknya, mahabesar dengan segala keagungan dan kekuasaan-Nya. Inilah ayat kursi, ayat teragung dalam Al-Qur'an karena mencakup namanama dan sifat-sifat Allah yang menunjukkan kesempurnaan zat, ilmu, kekuasaan, dan keagungan-Nya. Ayat ini dinamakan ayat kursi. Siapa yang membacanya akan memperoleh perlindungan Allah dan tidak akan diganggu setan."
  }
]