[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah adalah Dzat yang tidak ada yang berhak dihadapkan padanya uluhiyah dan ubudiyah kecuali Dia, Yang Maha hidup yang mempunyai seluruh hakikat kehidupan yang sempurna, sesuai dengan keagunganNya, lagi Maha mengatur segala sesuatu, tidak mengantuk dan tidak tidur. Semua yang ada di langit dan seluruh yang ada di bumi adalah milikNya. Tidak ada seorangpun yang berani maju memberikan syafaat di sisiNya kecuali dengan izinNya. pengetahuanNya meliputi segala makhluk-makhluk yang ada, yang ada di masa lalu, sekarang dan di masa yang akan datang. Dia mengetahui perkara-perkara yang akan terjadi di hadapan makhluk-makhluk berupa hal-hal yang terjadi di masa yang akan datang, dan apa yang telah terjadi di belakang mereka berupa perkara-perkara masa lalu. Dan tidak seorang pun dari makhluk yang mengetahui sedikit saja dari ilmuNya selain apa yang Allah ajarkan dan tampakkan kepadanya. Dan kursi Allah meliputi langit dan bumi. Dan kursi ini adalah tempat dua kaki Allah jalla jalaluh. Dan tidak ada yang mengetahui bentuknya selain Allah. Memelihara keduanya tidaklah memberatkan Allah. Dan Dia Maha tinggi dengan Dzat dan sifat-sifatNya di atas semua makhlukNYa, yang menghimpun seluruh sifat keagungan dan kebesaranNya. Ayat ini merupakan ayat paling agung di dalam Al-Quran dan dinamakan dengan sebutan Ayat Kursi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "255. Allah lah Żat yang tiada tuhan yang berhak disembah selain Dia semata dan tidak ada duanya. Yang Mahahidup dengan kehidupan yang sempurna, tidak ada kematian dan tidak ada kekurangan. Yang Maha Mengurus, Yang Mengurus segala sesuatu sendirian, tidak membutuhkan bantuan dari satupun makhluk-Nya. Karena Dia lah semua makhluk ini bisa berdiri, sehingga mereka semua senantiasa membutuhkan-Nya dalam kondisi apapun juga. Dia tidak pernah dilanda rasa kantuk dan tidak pernah tidur, karena kesempurnaan sifat kehidupan dan kepengurusan-Nya. Dia lah satu-satunya pemilik apa yang ada di langit dan di bumi. Tidak ada seorangpun yang dapat memberikan syafaat kepada orang lain di sisi-Nya kecuali setelah mendapatkan izin dan restu-Nya. Dia mengetahui semua urusan makhluk-Nya yang telah terjadi di masa lalu dan yang belum terjadi di masa depan. Mereka tidak mengetahui apa yang diketahui oleh Allah kecuali sebagian kecil yang Dia kehendaki untuk Dia tunjukkan kepada mereka. Kursi-Nya -yaitu tempat kedua kaki Rabb- meliputi seluruh langit dan bumi yang luas dan besar ini. Dia tidak pernah merasa keberatan atau kesulitan untuk menjaga keduanya. Dan Dia Mahatinggi di dalam Żat dan sifat-sifat-Nya, lagi Mahaagung di dalam kerajaan dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "255. Hanya Allah yang memiliki segala sifat ketuhanan, tidak ada yang berhak disembah melainkan Dia. Maha Hidup yang memiliki makna kehidupan yang sempurna sesuai dengan keagungan-Nya. Maha Menjaga segala sesuatu, tidak dihinggapi rasa kantuk dan tidak tidur. Maha Memiliki segala yang ada di langit yang tujuh dan bumi yang tujuh. Tidak ada yang dapat memberi syafaat melainkan dengan izin-Nya. Ilmu-Nya meliputi segala masa depan yang akan dilalui oleh para makhluk dan masa lalu yang telah mereka lalui. Tidak ada yang dapat menyingkap ilmu-Nya melainkan yang Allah ajarkan. Kursi-Nya yang agung -yang merupakan tempat dua kaki- seluas langit yang tujuh dan bumi yang tujuh. Penjagaan langit dan bumi tidak memberatkan-Nya. Dia Maha Tinggi pada Dzat dan Sifat-Nya. Maha Agung yang terkumpul pada-Nya segala sifat keagungan. Ibnu Abbas berkata: “Yang dimaksud dengan kursi adalah tempat dua kaki.” (hadits dikeluarkan oleh Waki’ dalam tafsirnya, sebagaimana dijelaskan oleh Ibnu katsir dalam tafsir; dan dikeluarkan oleh al-Hakim, dishahihkan dan disepakati oleh ad-Dzahabi (al-Mustadrak 2/282); disebutkan oleh al-Haitsami dan dinisbatkan kepada at-Thabrani seraya berkata para rawinya merupakan para perawi hadits shahih (majma’ al-zawaid 6/326)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "255. اللهُ لَآ إِلٰهَ إِلَّا هُوَ (Allah, tidak ada Tuhan melainkan Dia) Yakni tidak ada yang berhak disembah kecuali Dia. الْحَىُّ (Yang Hidup kekal ) Yakni lawan kata dari kematian. Dan Allah memiliki kehidupan yang sempurna tidak sirna atau berubah. Dan kehidupan-Nya tidak terdapat kekurangan. الْقَيُّومُ ۚ ( lagi terus menerus mengurus (makhluk-Nya)) Yakni yang senantiasa mengurus dan menjaga makhluk-Nya. سِنَةٌ ( tidak mengantuk) Yakni apa yang terjadi sebelum tidur seperti Lelah dan menutupnya kedua mata. مَن ذَا الَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ (Tiada yang dapat memberi syafa’at di sisi Allah tanpa izin-Nya ) Yakni tidak ada dari makhluk-Nya yang mampu memberi manfaat untuk makhluk lainnya dengan syafaat maupun yang lainnya selama Allah belum mengizinkan pemberi syafaat. يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ (Allah mengetahui apa-apa yang di hadapan mereka ) Yakni yang dihadapan mereka berupa kehidupan akhirat. وَمَا خَلْفَهُمْ ۖ (dan di belakang mereka ) Yakni kehidupan di dunia. وَسِعَ كُرْسِيُّهُ (Kursi Allah meliputi (langit dan bumi)) Diriwayatkan dari Ibnu Abbas: al-Kursi adalah tempat kedua kaki. Dan diriwayatkan dari Imam Bukhari dari Said bin Jubair, al-Kursi adalah ilmu-Nya; pendapat ini dikuatkan oleh Imam at-Thabari. Dan pendapat lain mengatakan, al-Kursi adalah ‘Arsy itu sendiri. وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ (Dan Allah tidak merasa berat memelihara keduanya ) Yakni penjagaan langit dan bumi tidak memberatkan Allah Ta’ala, dan tidak mendapatkan sedikitpun kesusahan dari hal itu. الْعَلِىُّ ( dan Allah Maha Tinggi) Yakni Maha Tinggi dari makhluk-makhluk-Nya dengan ketinggian-Nya dan kekuasaan-Nya atas mereka. Ayat ini disebut juga dengan ayat kursi, dan diriwayatkan hadist-hadist yang shahih bahwa ayat ini adalah ayat yang paling utama dalam al-Qur’an. Dari Ubay bin Ka’ab bahwa Rasulullah bertanya kepadanya: menurutmu ayat mana di kitab Allah merupakan ayat yang paling utama? Lalu ia menjawab: ayat kursi. Rasulullah bersabda: “Semoga dipermudahkan ilmu bagimu, Abu Munzir”. Dan dari Asma’ binti Yazid bin as-Sakan ia berkata: aku mendengar Rasulullah bersabda dalam dua ayat ini (الله لا إله إلا هو الحي القيوم) dan (آلم الله لا إله إلا هو الحي القيوم) bahwa didalamnya terdapat nama Allah yang paling agung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat kursi adalah ayat yang paling agung dalam al-qur'an, dan mentadabburinya lebih utama, dan ada banyak dalil yang menjelaskan bahwa disyari'atkannya bagi kaum muslimin untuk membaca ayat ini dalam beberapa hal, dan ada hak bagi yang membacanya dengan penuh tadabbur dan memahaminya, akan terisi dalam hatinya keyakinan, pengetahuan, dan keimanan, dan dengannya pula ia akan terjaga dari keburukan syaithon. 2 ). Tatkala Allah mengatakan : { اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ } Allah kemudian menyebutkan setelahnya : الْحَيُّ الْقَيُّومُ , yakni setelah Dia menyebutkan hak-Nya atas segala peribadatan dan sesembahan Allah langsung menyebutkan setelahnya sebabnya, yang merupakan kesempurnaan yang ada pada diri-Nya, maka tidak akan sah segala bentuk ibadah kecuali kepada dzat yang mempunyai sifat ini : { وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ } \"Dan bertawakkallah kepada Allah yang hidup (kekal) Yang tidak mati\" [al-Furqon : 58], dalam hadits dikatakan : (( وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لاَ يَمُوتُ )) \"dan barangsiapa menyembah Allah maka Allah adalah Dzat Yang Mahahidup tidak akan mati\". 3 ). { اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ } Pada ayat ini ada penafian dan penetapan; yaitu menafikan segala bentuk pengakuan akan ketuhanan dan kesesaan selain Allah dan menetapkannya hanya kepada Allah semata, kemudian pembahasan ini kembali dijelaskan secara terperinci pada ayat selanjutnya : { فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ لَا انْفِصَامَ لَهَا } \"Karena itu barangsiapa yang ingkar kepada Thaghut dan beriman kepada Allah, maka sesungguhnya ia telah berpegang kepada buhul tali yang amat kuat yang tidak akan putus\" [ al-Baqarah : 256 ]. 4 ). { اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ } Penafian sifat ngantuk dan tidur dari Allah sebagai penetapan bagi-Nya kesempurnaan hidup dan kelangsungan pengaturan-Nya yang tidak permah terhenti, dan penetapan kesemprnaan ilmu bagi Allah karena sesungguhnya sifat ngantuk dan tidur menyerupai kematian, maka kehidupan orang yang tidur hakikatnya adalah kehidupan yang lemah. 5 ). Diantara kesesuaian firman Allah : { لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } setelah lafadzh tauhid { لَا إِلَٰهَ إِلَّا هُوَ } adalah bahwasanya kata { مَا } dalam ayat ini menunjukkan keumuman, yakni semua yang ada di langit dan di bumi adalah miliki Allah semata, semuanya adalah diantara hamba-hamba lainnya, maka bagaimana mungkin seorang hamba menyembah sesuatu yang hakikatnya juga sebagai hamba dan tidak menyembah pemilik dan penciptanya ? 6 ). Tatkala Allah berfirman : { اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ } Dia جل جلا له kemudian berfirman setelahnya : { لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } dan diantara kesesuain dari dua kalimat ini adalah : bahwasanya hati-hati makhluk senantiasa bergantung kepada siapa yang memberinya rezki sebagaimana firman Allah dalam kisah Ibrahim : { إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ } “Sesungguhnya yang kamu sembah selain Allah itu tidak mampu memberikan rezeki kepadamu; maka mintalah rezeki itu di sisi Allah” [al-Ankabut : 17] maka Allah menujukkan kepada mereka pintu rizki melalui penghambaan kepada-Nya dari pintu yang mereka sukai dengan hawa nafsu. 7 ). { لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ } Perhatikan seberapa besar kekayaan yang dimiliki oleh seorang tajir atau penguasa; sesungguhnya semua itu hanyalah sebesar dzarroh diantara luasnya alam ini, Ayat ini juga menyisyaratkan bahwa segala sesuatu yang miliki oleh tangan-tangan makhluq tempat kembalinya adalah kepada sang pencipta جل جلا له , Maha suci dzt yang kekayaan dan kekuasaan-Nya seluas langit dan bumi serta dunia dan akhirat. 8 ). { وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ } Dan (kursi) bukanlah makhluq Allah yang paling besar, melainkan ada makhluq yang jauh lebih agung darinya yaitu ‘Arsy, dan apa yang tidak diketahui kecuali Allah yang tau tentangnya, dan pada keagungan makhluq-makhluq ini membingungkan fikiran dan melemahkan pandangan, dan menjadikan gunung-gunung bergetar, maka bagaimana dengan keagungan penciptanya dan penguasanya, dan dzat yang menahan langit dan bumi supaya tidak lenyap tanpa merasa Lelah dan penat; maka dari itu Allah berfirman : { وَلَا يَئُودُهُ حِفْظُهُمَا } “Dan Allah tidak merasa berat memelihara keduanya”. 9 ). { وَهُوَ الْعَلِيُّ الْعَظِيمُ } : الْعَلِيُّ Dialah Allah satu-satunya dzat yang Maha tinggi, tinggi diatas segala sesuatu, dan { الْعَظِيمُ } Dialah satu-satunya dzat yang memiliki keagungan dalam diri-Nya, dalam kekuasaan dan ekrajaan-Nya, dan dalam sifat-sifatNya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "255. Allah satu-satunya Dzat berhak disembah, yang berhak menjadi Tuhan, Dzat yang Maha Hidup kekal selama-lamanya, Dzat yang berkuasa mengatur, menjaga dan memelihara makhlukNya. Dia tidak ditimpa dan dikuasai rasa kantuk dan tidur. Miliknya itu seluruh langit dan bumi sebagai kerajaan, ciptaan dan hamba. Tidak ada yang bisa memberikan syafaat kecuali dengan saizinNya. IlmuNya meliputi segala sesuatu di dunia dan akhirat. ilmuNya atau kuasaNya mencakup segala sesuatu. Tindakan menjaga langit dan bumi itu tidak memberatkan dan menggangguNya. Dialah Dzat yang Maha Tinggi maqamnya, yang Maha Kuasa lagi Maha Menaklukkan. Dialah Dzat yang memiliki keluhuran, kebesaran, dan keagungan yang tiada tandingannya. Imam Muslim meriwayatkan dalam shahihnya dari Ubay bin Ka’b bahwa Nabi SAW bersabda tentang ayat kursi terkait maknanya: “Sesungguhnya ayat kursi itu seagung-agung ayat dari kitab Allah SWT”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah, tidak ada tuhan selain Dia, Yang Maha hidup lagi terus-menerus mengurus (makhlukNya)} Dzat yang mengurus segala sesuatu {Dia tidak dilanda oleh kantuk} kantuk {tidak pula tidur. MilikNyalah apa yang ada di langit dan apa yang ada di bumi. Tidak ada yang dapat memberi syafaat di sisiNya tanpa seizinNya. Dia mengetahui apa yang ada di hadapan mereka dan apa yang ada di belakang mereka} apa yang ada sebelum mereka dan apa yang ada sesudah mereka {Mereka tidak mengetahui sesuatu apa pun dari ilmuNya, kecuali apa yang Dia kehendaki. KursiNya} tempat kekuasaan Allah SWT {meliputi} meliputi {langit dan bumi. Dia tidak merasa berat} Dia tidak merasa berat {memelihara keduanya} memelihara langit dan bumi {Dialah yang Maha tinggi lagi Maha agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "255. Nabi mengabarkan, “Bahwa ayat ini ayat paling agung dalam al-Qur’an” karena ayat ini meliputi makna tauhid, kebesaran, dan luasnya sifat Allah, dan Allah mengabarkan bahwasanya Dia adalah, “Allah” yang memiliki segala makna-makna ketuhanan, dan bahwasanya tidak ada yang berhak bercitra ketuhanan dan peribadahan kecuali hanya Dia. Dipertuhankannya selainNya dan peribadahan kepada selainNya adalah batil, dan bahwasanya Dia “Hidup kekal,” yang memiliki seluruh maknan-makna kehidupan yang sempurna berupa pendengaran, penglihatan, kemampuan, kehendak, dan sebagainya dari sifat-sifat fisik, sebagaimana juga Dia “terus menerus mengurus (makhlukNya),” termasuk di dalamnya segala macam bentuk sifat-sifat perbuatan, karena Dia terus menerus mengurus (makhlukNya), yang sendiri saja mengurusnya, dan tidak butuh kepada bantuan seluruh makhluk-makhlukNya. Allah mengurus segala makhluk, di mana Dia menciptakan mereka dalam mempertahankan keberadaan dan kelanggengan mereka. Dan di antara kesempurnaan hidup dan kepengurusanNya bahwa Dia “tidak mengantuk,” maksudnya, tidak ingin tidur, “dan tidak tidur” karena ngantuk. Tidur hanya muncul pada para makhluk yang diselubungi oleh kellemahan, ketidakmampuan, serta kekurangan, dan tidak muncul pada Dzat yang memiliki keagungan, kesombongan, dan kemuliaan, dan Allah juga mengabarkan bahwasanya Dia Pemilik apa yang ada di langit dan di bumi, semuanya adalah hamba-hamba Allah sebagai budak-budakNya yang tidak ada seorang pun yang keluar dari koridor tersebut, \"Tidak ada seorangpun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah selaku seorang hamba.\" -Maryam:93- Maka Dia-lah Raja segala raja dan Dia-lah yang memiliki segala sifat raja, pengaturan, kekuasaan, dan kesombongan, dan dari kesempurnaan kerajaanNya bahwasanya tidak ada yang dapat, “memberi syafa’at di sisi Allah,” yakni tak seorang pun, “kecuali dengan izinNya.” Setiap pemuka kaum dan para pemegang syafa’at adalah hamba-hamba bagiNya dan budak-budakNya, di mana mereka tidak melakukan syafa’at hingga mereka diizinkan untuk itu, (Allah berfirman) \"Katakanlah: “Hanya kepunyaan Allah syafa’at itu semuanya. Kepunyaan-Nya kerajaan langit dan bumi. Kemudian kepada-Nya-lah kamu dikembalikan\" –Az-Zumar:44- Dan Allah tidak memberikan izin kepada seorang pununtuk memberikan syafa’at kecuali bagi mereka yang Dia ridhai, dan Dia tidak meridhai kecuali mereka yang mentauhidkanya dan mengikuti RasulNya. Barang siapa yang tidak bersipat seperti ini, maka dia tidak mendapatkan bagian dari syafa’at. Kemudian Allah mengabarkan tentang ilmunya yang luas lagi melingkupi lagi Dia mengetahui apa yang ada pada seluruh makhluk berupa perkara-perkara yang akan datang yang tidak ada akhirnya,”dan di belakang mereka,” dari perkara-perkara yang telah berlalu yang tidak ada batasnya, dan bahwasanya tidak ada yang tersembunyi dariNya \"Dia mengetahui (pandangan) mata yang khianat dan apa yang disembunyikan oleh hati.\",-Al-mu’min:19- Dan bahwasanya di antara mahkluk itu tidak seorang pun yang meliputi ilmu Allah dan pengetahuanya,”melainkan apa yang di kehendakiNya,” Di antaranya adalah sesuatu yang di perlihatkan olehNya kepada kalian dari perkara-perkara syar’idan perkara takdir, dan itu hanya bagian yang sangat sedikit sekali yang akan hilang(bila di bandingkan) ilmuAllah dengan pengetahuanya sebagaimana yang di katakana oleh mahkluk yang paling mengetahui tentangNya yaitu Para Rosul dan Malikat, \"Mereka menjawab: “Maha Suci Engkau, tidak ada yang kami ketahui selain dari apa yang telah Engkau ajarkan kepada kami; sesungguhnya Engkaulah Yang Maha Mengetahui lagi Maha Bijaksana”. Al- baqarah:32. Kemudian Allah mengabarkan tentang keagungan dan kemuliaanNya dan bahwasanya kursiNya seluas langit dan bumi, dan bahwa Dia menjaga keduanya dan seluruh mahkluk yang berada di dalamnya dengan sebab-sebab dan aturan-aturan yang di jadikan oleh Allah pada para mahkluk, walaupun demikian tidaklah ada sesuatupun yang memberatkaNya untuk menjaga keduaNya kerena kesempurnaan kebesaraNya dan kekuasaNya, serta luas hikmahNya dalam segala hukum-hukumNya. “Dan Allah Maha tinggi” denganDzatNya atas semua mahkluk-mahklukNya, dan Dia Tinggi dengan keagungan sipat-sipatnya, dan Dialah yang maha tinggi yang meguasai makhluk-makhluk, segala yang ada patuh padaNya, segala perkara tunduk padaNya, dan segala hamba merendahkan diri kepadanya, “Lagi Maha Agung” yang menyatukan segala sipat keagungan, kesombongan,kebesaran,dan kemegahan,Dzat yang di cintai oleh hati, diagungkan oleh ruh,orang-orang yang mengetahui itu paham bahwa keagungan setiap hal walupun sangat jelas akan sangat kecil bila disandingkan dengan keagungan dzat yang mahatinggi lagi mahabesar. Ayat ini meliputi semua makna yang merupakan makna yang paling milua yang menyebabkan berhak menjadi ayat yang paling agung di dalam Al-Qur’an, dan orang-orang yang membacanya dengan melakukan perenungandan pemahaman, maka dia berhak akan hatinya di penuhi dengan keyakinan, pengetahuan,dan kaimanan dan Dia akan terjagadengan hal itu dari kejahatan setan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱللَّهُ } Allâh: Nama Dzat Tuhan Tabâraka wa Ta’âla { لَآ إِلَٰهَ إِلَّا هُوَ } Laa ilaha illa huwa: Ilah adalah sesembahan dan tidak ada sesembahan yang haq melainkan Allah. Karena Allah yang Maha Menciptakan, Maha Memberi Rizki dan Maha Mengatur segala sesuatu. Hanya kepadaNya lah segala sesuatu dikembalikan. Maka segala sesuatu yang disembah selain Allah tidak boleh diibadahi dan bathil. { ٱلۡحَيُّ } Al-Hayyu: Dzat yang memiliki kehidupan yang mulia dan tidak dimiliki oleh selain Allah Ta’ala. Hal ini yang membuat Allah berkuasa, berkehendak, berilmu, mendengar, melihat dan berbicara. { ٱلۡقَيُّومُۚ } Al-Qayyum: Dzat yang mengatur segala sesuatu yang ada di kerajaanNya baik yang di atas maupun yang di bawah bumi. Dzat yang mengatur setiap jiwa apa yang mereka perbuat. { سِنَةٞ } Sinnah: Rasa kantuk yang ada sebelum tidur. { كُرۡسِيُّهُ } Kursiyyuhu: Al-Kursiy maknanya adalah tempat meletakkan kedua kaki. Tidak ada yang mengetahui hakikatnya kecuali Allah. { يَ‍ُٔودُهُۥ } Ya’uduhû: memberatkan dan menyulitkanNya. Makna ayat: Ketika Allah Ta’ala mengabarkan mengenai keadaan hari kiamat, yaitu hari dimana tidak ada jual beli maupun syafa’at, dan orang-orang kafir termasuk orang-orang zhalim, Allah mengabarkan tentang kemuliaan, kesempurnaan dan besarnya kekuasaanNya. Dia lah Allah yang pantas disembah dengan benar dan peribadahan kepadaNya lah yang menyelamatkan hamba dari kengerian hari kiamat. Allah Ta’ala berfirman,”Allah Dzat yang tidak ada sesembahan selain Nya.” Yaitu Allah satu-satunya Dzat yang pantas disembah dengan benar dan tidak ada sesembahan yang pantas disembah selain Nya. Firman Allah { ٱلۡحَيُّ ٱلۡقَيُّومُۚ } Dzat yang Maha Hidup tidak didahului oleh kematian dan juga tidak akan didatangi kematian. Al-Qayyum artinya Maha Mulia yang mengurusi segala urusan makhluk, jikalau bukan karena kekuasaanNya pastilah tidak akan tegak urusan alam semesta ini. Firman Allah { لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ },”Tidak mengantuk dan tidak tidur.” Karena mengantuk dan tidur merupakan sifat cacat (kurang) padahal Allah Ta’ala dzat yang memiliki kesempurnaan secara mutlak. Potongan ayat ini sebagai penjelasan dalam potongan ayat sebelumnya, dimana makhluk yang mengantuk dan tidur tidak memiliki kekuasaan terhadap seluruh makhluk, tidak bisa memberikan penjagaan, rizki dan pengaturan. Firman Allah { لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ },”KepunyaanNya apa yang di langit dan di bumi.” Berupa penciptaan makhluk, kepemilikan dan pengaturannya. Firman Nya { مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦ },”Siapakah yang memberi syafa’at di sisi Allah tanpa izin Nya.” Allah Ta’ala yang memiliki segala sesuatu yang ada di langit maupun di bumi, menafikan siapapun di dunia maupun di akhirat untuk memberikan syafa’at tanpa seizin dari Nya. Firman Allah { يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُمۡۖ } disebabkan oleh kelemahan total mereka. { وَسِعَ كُرۡسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَۖ } “Kursi Allah meliputi langit dan bumi.” Karena kesempurnaan Dzat Nya. Firman Nya { وَلَا يَ‍ُٔودُهُۥ حِفۡظُهُمَاۚ } Tidak memberatkan atau menyulitkan Nya penjagaan terhadap langit dan bumi dan apa yang ada di antara keduanya dan di dalamnya.” Firman Nya { وَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُ } Al-‘Aliy yaitu Maha Tinggi yang tidak ada sesuatupun di atas Nya dan Maha Perkasa yang tidak terkalahkan oleh yang lain Nya, dan Maha Besar dimana hal yang lain kecil di hadapan Nya. Pelajaran dari ayat: • Ini merupakan ayat yang paling mulia di dalam kitabullah. Mengandung delapan belas nama Allah baik yang jelas maupun tersirat. Jumlah kata dalam ayat ini ada lima puluh dan jumlah kalimatnya ada sepuluh, seluruhnya berbicara tentang rububiyah Allah Ta’ala, uluhiyyahNya, nama-nama dan sifat-sifat Nya yang menunjukkan tentang kemuliaan Dzat Nya, ilmu Nya dan kekuasaan Nya serta besarnya kekuasaan Allah. • Dianjurkan (sunnah) untuk membacanya setelah selesai shalat wajib, ketika akan tidur, dan di dalam rumah untuk mengusir setan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 255: Ayat ini merupakan ayat yang paling agung, paling utama dan paling mulia karena mengandung perkara-perkara besar dan sifat-sifat Allah yang mulia. Oleh karena itulah, banyak hadits-hadits yang menganjurkan kita untuk membacanya dan menjadikannya wirid harian yang dibaca di pagi dan sore hari, sebelum tidur dan sehabis shalat lima waktu. Allah Subhaanahu wa Ta'aala menyebutkan pada ayat tersebut tentang Diri-nya, bahwa tidak ada yang berhak disembah selain Dia, karena kesempurnaan-Nya dan kesempurnaan sifat-sifat-Nya serta banyaknya nikmat yang dikaruniakan-Nya. Di samping itu, karena keadaan seorang hamba yang memang berhak menjadi hamba Allah Tuhannya dengan mengikuti perintah-Nya dan menjauhi larangan-Nya. Semua sesembahan yang disembah selain Allah adalah batil, hal itu karena selain Allah adalah makhluk, memiliki kekurangan, diatur dan bergantung dengan sesuatu sehingga tidak pantas disembah. Al Hayyu dan Al Qayyum adalah dua nama yang mulia, yang menunjukkan kepada semua Asma'ul Husna baik menunjukkan secara muthabaqah (bersamaan), tadhammun (terkandung di dalamnya) maupun iltizam (menghendaki adanya). Al Hayyu (Maha Hidup) adalah Yang memiliki hidup secara sempurna; menghendaki semua sifat pada zat-Nya seperti sifat mendengar, melihat, mengetahui, berkuasa, dsb. Sedangkan Al Qayyum adalah yang terus menerus mengurus makhluk-Nya. Nama-Nya Al Qayyum menghendaki adanya perbuatan pada Allah Subhaanahu wa Ta'aala sesuai kehendak-Nya, seperti istiwa' (bersemayam), turun ke langit dunia, berbicara, mencipta, memberi rezeki, mematikan dan menghidupkan serta semua bentuk tadbir (mengurus) lainnya; semua itu termasuk ke dalam sifat qayyumiyyah Allah. Oleh karrena itu, para pentahqiq mengatakan bahwa keduanya adalah Al Ismul A'zham (nama teragung), di mana apabila seseorang berdo'a dengan nama itu akan dikabulkan Allah dan apabila diminta dengan nama itu akan diberikan. Di antara sempurnanya hidup dan qayyumiyyyah (kepengurusan) Allah adalah bahwa Dia tidak mengantuk dan tidak tidur. Allah-lah pemilik apa saja yang ada di langit dan di bumi, sedangkan selain-Nya milik-Nya. Allah-lah Pencipta, Pemberi rezeki dan Pengatur, sedangkan selain-Nya dicipta, diberi rezeki dan diatur. Tidak ada seorang yang dapat memberi syafa'at di sisi-Nya tanpa izin-Nya. Syafa'at itu semuanya milik Allah. Akan tetapi, Allah subhaanahu wa Ta'ala apabila hendak merahmati hamba-hamba-Nya yang dikehendaki-Nya, Dia mengizinkan kepada orang yang hendak dimuliakan-Nya untuk memberi syafa'at, dan yang akan memberi syafa'at tidak memulai memberi syafa'at sebelum mendapat izin-Nya. Allah Subhaanahu wa Ta'aala mengetahui segala yang terjadi baik di masa lalu, sekarang dan yang akan datang. Ilmu-Nya meliputi segala sesuatu, baik yang besar maupun yang kecil, secara garis besar maupun secara tafshil (rinci), zhahir maupun batin, yang ghaib maupun yang nampak. Misalnya melalui berita-berita yang disampaikan oleh para rasul. Ibnu Abbas mengartikan kursi dengan, \"Tempat Allah meletakkan kedua kaki-Nya- dan tidak ada yang mengetahui kaifiyat(bagaimana)nya selain Dia. Hal ini menunjukkan sempurnanya keagungan Allah dan luasnya kekuasaan-Nya; kursi-Nya saja meliputi langit dan bumi. Kursi bukanlah makhluk Allah yang terbesar, bahkan di sana masih ada lagi yang lebih besar, yaitu 'Arsy, di mana tidak ada yang mengetahui besarnya selain Dia. Jika makhluk-Nya sudah sedemikian besarnya, lalu bagaimana dengan Penciptanya, yaitu Allah, yang menahan langit dan bumi agar tidak lenyap tanpa lelah, Allahu akbar. Allah Maha Tinggi zat-Nya di atas 'arsyi-Nya, Maha Tinggi dengan kekuasaan-Nya di atas semua makhluk dan Maha Tinggi kedudukan-Nya karena sempurna sifat-Nya. Dia Maha Besar, di mana semua pembesar dan raja kecil di hadapan-Nya. Maha Suci Allah yang memiliki keagungan yang besar, keperkasaan dan mampu mengalahkan segala sesuatu. Ayat kursi ini mengandung beberapa hal, di antaranya: - Tauhid uluhiyyah (keberhakan Allah untuk diibadati), tauhid rububiyyah (Allah Pengurus alam semesta), dan mengandung tauhid asma' wa shifat (nama-nama Allah dan sifat-Nya). - Kerajaan Allah, ilmu-Nya dan kekuasaan-Nya meliputi segala sesuatu. - Kebesaran, keagungan dan ketinggian-Nya di atas semua makhluk-Nya. - Mengandung 'aqidah tentang asma wa shifat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 255",
    "description": "Allah; tidak ada tuhan yang pantas disembah dan dipertuhan selain dia. Yang mahahidup, kekal, dan memiliki semua makna kehidupan yang sempurna, yang terus menerus mengurus makhluk-Nya. Tidak seperti manusia, dia tidak mengantuk dan tidak pula tidur, sebab keduanya adalah sifat kekurangan yang membuat-Nya tidak mampu mengurus makhluk-Nya. Milik-Nya apa yang ada di langit dan apa yang ada di bumi. Dia yang menciptakan, memelihara, memiliki, dan bertindak terhadap semua itu. Tidak ada yang dapat memberi syafaat pertolongan di sisi-Nya tanpa izin-Nya. Dia demikian perkasa dan kuasa sehingga berbicara di hadapan-Nya pun harus setelah memperolah restu-Nya, bahkan apa yang disampaikan itu harus sesuatu yang benar. Dia mengetahui apa yang di hadapan mereka, yakni apa saja yang sedang dan akan terjadi, dan apa yang di belakang mereka, yakni sesuatu yang telah berlalu. Allah mengetahui apa yang mereka lakukan dan rencanakan, baik yang berkaitan dengan masa kini, masa lampau, atau masa depan. Dan mereka tidak mengetahui sesuatu apa pun tentang ilmu-Nya melainkan apa yang dia kehendaki untuk mereka ketahui dengan memperlihatkan dan memberitahukannya. Kursi-Nya, yaitu kekuasaan, ilmu, atau kursi tempat kedua kaki tuhan (yang tidak diketahui hakikatnya kecuali oleh Allah) berpijak, sangat luas, meliputi langit dan bumi. Dan jangan menduga karena kursi-Nya terlalu luas, dia letih mengurus itu semua. Tidak! dia tidak merasa berat maupun kesulitan memelihara keduanya, dan dia mahatinggi zat dan sifat-sifat-Nya jika dibanding makhluk-makhluknya, mahabesar dengan segala keagungan dan kekuasaan-Nya. Inilah ayat kursi, ayat teragung dalam Al-Qur'an karena mencakup namanama dan sifat-sifat Allah yang menunjukkan kesempurnaan zat, ilmu, kekuasaan, dan keagungan-Nya. Ayat ini dinamakan ayat kursi. Siapa yang membacanya akan memperoleh perlindungan Allah dan tidak akan diganggu setan. Meski memiliki kekuasaan yang sangat luas, Allah tidak memaksa seseorang untuk mengikuti ajaran-Nya. Tidak ada paksaan terhadap seseorang dalam menganut agama islam. Mengapa harus ada paksaan, padahal sesungguhnya telah jelas perbedaan antara jalan yang benar dengan jalan yang sesat. Oleh karena itu, janganlah kamu menggunakan paksaan apalagi kekerasan dalam berdakwah. Ajaklah manusia ke jalan Allah dengan cara yang terbaik. Barang siapa ingkar kepada tagut, yaitu setan dan apa saja yang dipertuhankan selain Allah, dan beriman kepada Allah, maka sungguh, dia telah berpegang teguh pada ajaran agama yang benar sehingga tidak akan terjerumus dalam kesesatan, sama halnya dengan orang yang berpegang teguh pada tali yang sangat kuat yang tidak akan putus sehingga dia tidak akan terjatuh. Agama yang benar ibarat tali yang kuat dan terjulur menuju Allah, dan di situ terdapat sebab-sebab yang menyelamatkan manusia dari murka-Nya. Allah maha mendengar segala yang diucapkan oleh hamba-Nya, maha mengetahui segala niat dan perbuatan mereka, sehingga semua itu akan mendapat balasannya di hari kiamat."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini adalah ayat Kursi. Ayat yang mengandung sesuatu yang sangat agung. Terdapat sebuah hadits yang shohih dari Rosululloh Sholallohu ‘alaihi wasalam yang menyebutkan bahwa ayat ini merupakan ayat yang paling utama dalam kitab Allah (Alquran). Firman-Nya : اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ “Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia Yang Hidup kekal lagi terus menerus mengurus (makhluk-Nya)” Maksudnya, Allah memberitahukan bahwasanya Dia lah satu-satunya ilah yang tunggal yang wajib untuk disembah oleh seluruh alam, tunggal dalam uluhiyah-Nya. Dia lah Allah yang hidupnya kekal dan tidak pernah mati selamanya, yang mengendalikan segala yang ada. Dengan demikian semua yang ada di dunia ini sangat membutuhkan-Nya, sedangkan Dia sama sekali tidak membutuhkan mereka, tidak akan tegak semua itu tanpa perintah-Nya. Seluruh makhluk ini adalah ciptaan-Nya, dan Dia lah yang mengatur seluruhnya. Sebagaiman firman-Nya: ومن آياته أن تقوم السماء والأرض بأمره “Dan diantara tanda-tanda kekuasaan-Nya adalah berdirinya langit dan bumi dengan iradah-Nya” (QS. Ar-Rum : 25) Dan firman-Nya : لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ “Tidak mengantuk dan tidak tidur” Artinya, Dia selamat dari cacat (kekurangan),kelengahan dan kelalaian dalam mengurusi makhluk-Nya. Bahkan sebaliknya,Dia senantiasa mengurus dan memperhatikan apa yang dikerjakan setiap individu. Dan Dia senantiasa menyaksikan segala sesuatu,tidak ada sesuatu pun yang tersembunyi dari-Nya. Dan diantara kesempurnaan sifat-Nya adalah Dia tidak pernah dikalahkan (dikuasai) oleh kantuk. Oleh karena itu Dia juga berfirman “Dan tidak juga tidur”. Karena tidur itu lebih kuat dari ngantuk. Dalam hadits yang shohih yang diriwayatkan oleh Abu Musa, telah berkata: قام فينا رسول الله صلى الله عليه وسلم بأربع كلمات فقال : \" إن الله لا ينام ولا ينبغي له أن ينام ، يخفض القسط ويرفعه ، يرفع إليه عمل النهار قبل عمل الليل ، وعمل الليل قبل عمل النهار ، حجابه النور أو النار لو كشفه لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه Rosululloh Sholallohu ‘alaihi wasalam telah mengajarkan empat kalimat kepada kami, beliau bersabda: “sesungguhnya Allah tidak pernah tidur dan tidak pantas untuk-Nya tidur, Dia menurunkan dan menaikan timbangan. Diangkat kepadanya amalan siang sebelum amalan malam. Dan amalan malam sebelum amalan siang. Hijab-Nya terbuat dari cahaya atau api, kalaulah Dia perlihatkan wajahnya pasti akan terbakarlah sebala yang dilihatnya diantara makhluk-Nya” Dan firman-Nya : لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ “Kepunyaan-Nya apa yang di langit dan di bumi” Hal itu merupakan pemberitahukan bahwa semua makhluk dan hamba-Nya, dan berada di dalam kerajaan-Nya, pemaksaan-Nya, dan juga kekuasaan-Nya. Sebagaimana firman-Nya: إِنْ كُلُّ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آَتِي الرَّحْمَنِ عَبْدًا * لَقَدْ أَحْصَاهُمْ وَعَدَّهُمْ عَدًّا * وَكُلُّهُمْ آَتِيهِ يَوْمَ الْقِيَامَةِ فَرْدًا “Tidak ada seorangpun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah selaku seorang hamba. Sesungguhnya Allah telah menentukan jumlah mereka dan menghitung mereka dengan hitungan yang teliti. Dan tiap-tiap mereka akan datang kepada Allah pada hari kiamat dengan sendiri-sendiri”. (QS. Maryam : 93-95) Dan firman-Nya : مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ “Tiada yang dapat memberi syafa'at di sisi Allah tanpa izin-Nya?” Ini merupakan bagian dari keagungan, keperkasaan,dan kebesaran Allah swt yang mana tidak seorang pun dapat memberikan syafa’at kepada orang lain, kecuali dengan seizin-Nya. Ayat lain yang senada denga ayat ini adalah firman-Nya : وَكَمْ مِنْ مَلَكٍ فِي السَّمَاوَاتِ لَا تُغْنِي شَفَاعَتُهُمْ شَيْئًا إِلَّا مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَى “Dan berapa banyaknya malaikat di langit, syafa'at mereka sedikitpun tidak berguna, kecuali sesudah Allah mengijinkan bagi orang yang dikehendaki dan diridhai (Nya)” Hal ini juga sebagaimana yang ditegaskan dalam sebuah hadits tentang syafaat : آتي تحت العرش فأخر ساجدا فيدعني ما شاء الله أن يدعني ثم يقال : ارفع رأسك ، وقل تسمع ، واشفع تشفع \" قال : \" فيحد لي حدا فأدخلهم الجنة “aku datang ke bawah Arsy, lalu aku tunduk bersujud. Maka Dia membiarkanku selama waktu yang Dia kehendaki. Kemudian dikatakan “Angkatlah kepalamu, katakanlah perkataanmu maka akan didengar,dan berilah syafaat,dan engkau akan mendapatkan syafaat”. Nabi bersabda :”kemudian Allah memberikan suatu balasan kepadaku,lalu aku memasukan mereka ke dalam surga” (HR. Bukhori dan yang lainnya) Dan firman-Nya : يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ “Allah mengetahui apa-apa yang di hadapan mereka dan di belakang mereka” Yang demikian itu sebagai bukti yang menunjukan ilmu-Nya meliputi segala yang ada baik yang lalu maupun yang kini dan yang akan datang. Sebagaiman firman-Nya yang lain saat memberitahu kepada para Malaikat : وَمَا نَتَنَزَّلُ إِلَّا بِأَمْرِ رَبِّكَ لَهُ مَا بَيْنَ أَيْدِينَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذَلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا “Dan tidaklah kami (Jibril) turun, kecuali dengan perintah Tuhanmu. Kepunyaan-Nya-lah apa-apa yang ada di hadapan kita, apa-apa yang ada di belakang kita dan apa-apa yang ada di antara keduanya, dan tidaklah Tuhanmu lupa”. (QS. Maryam : 64) Firman-Nya : وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ “Dan mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya” Artinya, tidak ada seorangpun yang dapat mengetahui sesuatu pun dari ilmu Allah kecuali yang telah diajarkan dan diberitahukan oleh Allah ta’ala kepadanya. Mungkin juga makna penggalan ayat tersebut adalah, manusia tidak dapat mengetahui ilmu Allah sedikitpun, dzat dan sifat-Nya melainkan apa yang telah diperlihatkan Allah kepadanya. Hal itu senada denga firman-Nya pada ayat yang lain : وَلَا يُحِيطُونَ بِهِ عِلْماَ “Sedangkan ilmu mereka tidak dapat meliputi-Nya” (QS. Thaahaa : 110) Selanjutnya firman-Nya : وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ “Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Allah Maha Tinggi lagi Maha Besar” Ibnu Abi Hatim menceritakan riwayat dari Ibnu Abbas bahwa yang dimaksud oleh ayat ini adalah “ilmunya Allah meliputi langit dan bumi”. Tafsir yang sama juga diriwayatkan oleh Ibnu Jarir. Ibnu Abbas mengatakan: “kursi adalah tempat pijakan dua kaki (Allah) dan arsy tidak ada seorang pun yang mampu memperkirakannya”. Hal ini juga diriwayatkan al-hakim dalam kitabnya Almustadrok. Abu Bakar bin mardawih meriwayatkan hadits dari Abu Dzar Al-Gifari, bahwasanya dia bertanya kepada Rosululloh Sholallohu ‘alaihi wasalam tentang kursi, maka Nabi Muhammad Sholallohu ‘alaihi wasalam bersabda : والذي نفسي بيده ما السماوات السبع والأرضون السبع عند الكرسي إلا كحلقة ملقاة بأرض فلاة ، وإن فضل العرش على الكرسي كفضل الفلاة على تلك الحلقة “Demi Dzat yang jiwaku ada di tangan-Nya,tidaklah langit yang tujuh ini dan bumi yang tujuh ini jika dibandingan dengan kursi,kecuali hanya seperti cincin yang dilempar diatas padang pasir yang luaas, dan perbandingan antara kursi dengan arsy adalah seperti perbandingan cincin itu dengan luasnya padang pasir” Allah ta’ala tidak sama sekali merasa berat dan kewalahan dalam memelihara langit dan bumi dan semua yang ada diantara keduanya. Bahkan bagi Allah semua itu merupakan suatu halyang sangat mudah dan ringan. Dia mengawasi setiap individu atas apa yang ia kerjakan, yang senantiasa memantau segala sesuatu, sehingga tidak ada sesuatu pun yang luput dan tersembunyi dari-Nya. Dialah Allah yang Maha Tinggi lagi Maha Agung."
  }
]