[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Disebabkan kesempurnaan agama ini dan jelasnya ayat-ayatnya,maka tidak diperlukan tindakan pemaksaan untuk memeluknya, bagi orang-orang yang diambil jizyah darinya. Bukti-bukti petunjuk itu amat nyata, yang dapat menampakkan mana yang haq dan mana yang batil, petunjuk dan kesesatan. Maka barang siapa yang kafir pada semua sesembahan selain Allah dan beriman kepada Allah, sesungguhnya dia telah teguh dan istiqamah di atas jalan terbaik dan teguh dalam beragama dengan memegangi pegangan yang paling kuat yang tidak akan pernah putus. Dan Allah Maha Mendengar ucapan-ucapan hamba-hambaNya, lagi Maha Menegetahui perbuatan-perbuatan mereka dan niat-niat mereka dan akan memberikan balasan kepada mereka sesuai amal perbuatan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "256. Tidak ada seorangpun yang berhak memaksa orang lain untuk memeluk agama Islam, karena Islam adalah agama yang benar dan terang, sehingga tidak perlu ada paksaan kepada siapapun untuk memeluknya. Sudah terlihat jelas kebenaran dan kesesatan. Siapa yang ingkar kepada segala sesuatu yang disembah selain Allah dan berlepas diri darinya, kemudian beriman kepada Allah semata, maka dia benar-benar telah berpegang kepada agama dengan sekuat-kuatnya untuk menggapai keselamatan di hari kiamat. Dan Allah Maha mendengar ucapan hamba-hamba-Nya, lagi Maha Mengetahui perbuatan mereka, dan akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "256. Janganlah kalian memaksa seseorang untuk masuk Islam, sebab Islam telah memiliki dalil-dalil yang dapat membedakan kebenaran dari kebatilan. Dan barangsiapa yang mengingkari segala yang disembah selain Allah dan beriman kepada Allah, maka dia telah berada di atas agama Islam dan beristiqamah di dalamnya. Sungguh Allah Maha Mendengar perkataan kalian, dan Maha Mengetahui perbuatan kalian. Ibnu Asyur berkata: “setelah penyebutan ayat kursi disebutkan ayat ini karena kesesuaian keduanya. Ayat kursi mengandung dalil-dalil ketuhanan dan keagungan Sang Pencipta serta penyucian-Nya dari segala kesyirikan yang dilakukan berbagai umat, sehingga selayaknya ayat ini menuntun orang-orang yang memiliki akal yang sehat menuju penerimaan agama ini yang jelas aqidahnya dan lurus syariatnya, tanpa ada pemaksaan. (at-Tahrir dan at-Tanwir 2/499)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "256. لَآ إِكْرَاهَ فِى الدِّينِ ۖ (Tidak ada paksaan untuk (memasuki) agama (Islam)) Yakni janganlah kalian memaksa seorang pun untuk memeluk Islam apabila ia membayar Jizyah. Dan disebutkan bahwa kaum Anshar barkata: sebenarnya kami jadikan anak-anak kami memeluk agama Yahudi karena kami melihat agama mereka lebih baik daripada agama kami, lalu Allah mendatangkan kepada kami agama Islam, maka sungguh kami akan memaksa mereka untuk memeluk Islam. Dan ketika turun ayat ini, Rasulullah memberikan pilihan untuk anak-anak mereka dan tidak memaksa mereka untuk memeluk Islam. قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَىِّ ۚ ( sesungguhnya telah jelas jalan yang benar daripada jalan yang sesat) (الرشد) yakni keimanan, sedangkan (الغي) yakni kekufuran. Dan maksud ayat ini adalah salahsatu dari kedua hal ini telah dibedakan dengan jelas. بِالطّٰغُوتِ (kepada Thaghut) Dan thagut yakni dukun, syaitan, berhala, dan seluruh pemimpin kesesatan. وَيُؤْمِنۢ بِاللهِ( dan beriman kepada Allah) Yakni setelah jelas baginya jalan keimanan dan jalan kekufuran. فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ ( maka sesungguhnya ia telah berpegang kepada buhul tali yang amat kuat) Arti kata (العروة) adalah ujung tali apabila diikat dalam bentuk lingkaran, yang dipakai sebagai pegangan bagi orang yang turun ke sumur atau naik darinya. Adapun yang dimaksud disini adalah wasilah menuju keselamatan. Dan arti dari (الوثقى) adalah ikatan yang kuat yang tak ada yang lebih kuat darinya. لَا انفِصَامَ لَهَا ۗ(yang tidak akan putus) Yakni yang tidak terlepas ikatannya, sehingga tidak binasa orang yang berpegang dengannya, namun orang yang berpegang itu akan sampai ke surga. Dan tidak ada yang tak sampai menuju surga kecuali yang tidak berpegang padanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "256. Tidak ada paksaan untuk masuk Islam. Sungguh telah jelas jalan petunjuk (yaitu jalan keimanan dan hidayah), jalan kesesatan dan kebodohan yang muncul dari keyakinan yang rusak. Maka barangsiapa mengimani keberadaan dan keesaan Allah serta risalah nabi Muhammad SAW, maka sungguh dia telah berpegang teguh pada jalan keselamatan yang penuh hikmah yaitu Islam, yang mana di dalamnya tidak ada kehancuran, melainkan mengandung keselamatan. Dan agama itu menyerupai ikatan kuat yang tidak akan putus. Dan Allah itu Maha Mendengar orang yang beriman dan yakin, lagi Maha Mengetahui kebenaran dan keikhlasannya. Ibnu Abbas berkata: “Ayat ini turun untuk seorang dari kaum Anshar yang memaksa kedua anaknya yang Nasrani untuk masuk Islam, lalu keduanya menolak dan ingin tetap beragama Nasrani. Kemudian turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada paksaan dalam beragama} Sesorang tidak dipaksa untuk masuk agama Islam {Sungguh, telah jelas} sangat berbeda {jalan yang benar} petunjuk {daripada jalan yang sesat} kesesatan {Maka siapa saja yang ingkar kepada thagut} setiap sesembahan selain Allah {dan beriman kepada Allah sungguh telah berpegang teguh pada tali yang sangat kuat} jalan yang sempurna {yang tidak akan putus} tidak akan putus. Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "256. Ayat ini menerangkan tentang kesempurnaan ajaran Islam, dan bahwasanya karena kebesaran bukti-buktiNya, kejelasan ayat-ayat dan ia merupakan ajaran agama akal sehat dan ilmu, agama fitrah dan hikmah, agama kebaikan dan perbaikan, agama kebenaran dan ajaran yang lurus, karena kesempurnaanya dan penerima fitrah terhadapnya, maka islam tidak memerlukan pemaksaan kerena pemaksaan itu terjadi karena suatu perkara yang dijauhi oleh hati, tidak memilki hakikat dan kebenaran, atau ketika telah mengetahui ajaran ini dan dia menolaknya, maka hal itu di dasari kerena kedurhakaan, karena ”sungguh telah jelas jalan yang jelas dari jalan yang sesat,” hingga tidak ada suatu alasan pun bagi seseorang dan tidak ada hujjah apabila dia menolak dan tidak menerimanya. Tiadak ada perselisihan antara ayat ini dengan ayat-ayat lainya yang mengharuskan berjihad, karena Allah telah memerintahkan untuk beperang agar agama Allah semuanya milik Allah, dan demi memberantas kesewenang-wenangan, orang-orang yang melampui batas dari agama. Kaum Muslimin telah berrijma’ bahwa jihad itu masih berlaku bersama pemimpin yang baik maupun yang pendosa, dan bahwasanya jihad itu di antara kewajiban-kewajiban yang berkesinambungan, baik jihad perkataan maupun jihad perbuatan. Dan siapa saja di antara ahli tafsir yang berpendapat bahwa ayat ini maniadakan ayat-ayat jihad hingga mereka menyatakan dengan tegas bahwa ayat-ayat jihad itu telah di hapus, maka pendapat mereka itu lemah secara lafadz maupun makna, sebagaimana hal itu jelas sekali bagi orang yang merenungkan ayat yang mulia ini, sebagaiman juga telah kami jelaskan sebelumnya. Kemudian Allah menjelaskan pembagian manusia kepada dua bagian: pertama, manusia yang beriman kepada Allah semata yang tidak ada sekutu baginya dan kafir kepada taghut yaitu segala hal yang meniadakan keimanan kepada Allah dari kesyirikan dan lainya maka orang ini, ”telah berpegang kepada tali buhul yang amat kuat yang tida akan putus” yakni yang tidak ada putusnya, bahkan dia tegak di atas ajaran yang benar hingga sampai kepada Allah dan negeri kemuliaanNya. Dan yang kedua dapat di ambil dari pemahaman terbalik ayat ini yaitu barang siapa yang tidak beriman kepada Allah bahkan dia kafir kepadanya dan beriman kepada taghut, maka dia akan binasa dengan kebinasaan yang abadi dan di siksa dengan siksaan yang selamanya. Dan firmanNya,”Dan Allah Maha Mendengar,” yakni kepada segala suara dengan segala macam perbedaan bahasanya menurut segala bentuk kebutuhanya, dan juga maha mendengar akan doa-doa orang-orang yang bermunajat dan ketundukan orang-orang yang merendahkan diri kepadanya, “Lagi Maha Mengetahui,” segala yang di sembunyikan dalam hati, dan segala perkara yang tersembunyi dan tidak tampak, hingga Dia membalas setiap orang sesuai dengan apa yang diperbuatnya dari niat maupun amalnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ } Lâ ikrâha fiddîn: Tidak ada pemaksaan bagi seseorang untuk masuk ke dalam agama Islam, akan tetapi seseorang dapat memeluknya atas pilihan dan keinginannya sendiri. { ٱلرُّشۡدُ } Ar-Rusyd: Petunjuk yang mengantarkan keapda kebahagiaan dan kesempurnaan hidup. { ٱلۡغَيِّۚ } Al-Ghayy: Kesesatan yang menyebabkan kecelakaan dan kerugian bagi hamba. { ٱلطَّٰغُوتِ } Ath-Thaghût: Segala sesuatu yang memalingkan seorang hamba untuk beribadah kepada Allah, seperti manusia, setan dan yang lain sebagainya. {ٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ } Al-‘Urwatul Wutsqa: Tali yang kuat yaitu kalimat syahadat “Lâ ilaha illallâh” Tidak ada sesembahan yang berhak disembah kecuali Allah dan “Muhammadan rasulullah” Muhammad adalah utusan Allah. { لَا ٱنفِصَامَ لَهَاۗ } Lânfishâma lahâ: Tidak terputus dan tidak terlepas bagaimanapun keadaannya. Makna ayat: Allah Ta’ala mengabarkan setelah menyebutkan sifat-sifat kemuliaan dan kesempurnaanNya pada ayat kursi, bahwasanya tidak ada paksaan untuk masuk dalam agama Islam. Hal itu terjadi saat beberapa orang Anshar memaksa anak-anak mereka yang beragama Yahudi dan Nasrani untuk masuk Islam. Oleh karena itu dua pemeluk agama itu dan yang semisal dengan mereka harus membayar jizyah dan mereka tetap di atas agamanya, tidak keluar dari agama itu kecuali atas pilihan dan keinginannya sendiri. Sedangkan para penyembah berhala dan orang-orang yang tidak memiliki agama selain kesyirikan dan kekufuran, mereka diperangi sampai mau masuk ke dalam Islam, untuk menyelamatkan mereka dari kebodohan dan kekufuran serta kesesatan dan kerugian yang mereka sandang. Kemudian Allah Ta’ala mengabarkan bahwa Dia menurunkan Al-Qur’an, mengutus rasul-Nya, dan menolong wali-wali Nya akan tersingkaplah petunjuk atas kesesatan dan kebenaran atas kebathilan. Bagi orang yang mengingkari thaghut, yaitu setan yang senantiasa menghiasi peribadaan kepada berhala, dan ia beriman kepada Allah serta mengucapkan dua kalimat syahadat, maka sungguh ia telah berpegang teguh dengan agama dan tali yang sangat kuat. Namun bagi siapa yang terus di atas kekufuran kepada Allah dan beriman kepada thaghut sama saja ia telah berpegang teguh dengan tali yang lebih rapuh dari sarang laba-laba. Allah Maha Mendengar perkataan hamba-hamba Nya dan Maha Mengetahui niat-niat mereka serta amalan-amalan yang tersebunyi, dan Allah akan membalas setiap orang sesuai dengan perbuatannya. Pelajaran dari ayat: • Orang-orang ahli kitab dan yang dihukumi semisal mereka tidak seperti Majusi dan Shabi’ah, tidak dipaksa untuk masuk Islam kecuali atas dasar pilihan mereka sendiri, dan mereka harus membayar jizyah (upeti) sehingga mereka tetap dalam agamanya. • Agama Islam seluruhnya adalah petunjuk, sedangkan selainnya adalah kesesatan dan kebathilan. • Meninggalkan keburukan didahulukan dibandingkan berhias dengan hal yang utama. • Makna Lâ ilâh illallâh adalah beriman kepada Allah dan mengingkari thaghut (sesembahan selain Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 256: Ibnu Jarir meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma ia berkata, \"Ada seorang wanita yang miqlaat (yakni wanita yang nampak tidak mungkin bisa hidup lagi seorang anak), ia pun bernadzar jika masih bisa hidup seorang anak di sisinya, maka ia akan menjadikannya Yahudi. Ketika Bani Nadhir diusir, dan di sana terdapat anak-anak orang Anshar. Mereka berkata, \"Kami tidak akan membiarkan anak-anak kami\", maka Allah menurunkan ayat, \"Laa ikraaha fid diin, qat tabayyanar rusydu minal ghayy.\" (Hadits ini diriwayatkan oleh para perawi kitab shahih, diriwayatkan pula oleh Abu Dawud, dan As Suyuthi dalam Lubaabunnuqul menyandarkan kepada Nasa'i. Ibnu Hibban juga meriwayatkannya dalam Mawaariduz Zham'aan hal. 427) Syaikh As Sa'diy berkata: \"Allah Subhaanahu wa Ta'aala memberitahukan bahwa tidak ada paksaan dalam menganut agama karena memang tidak butuh adanya pemaksaan. Hal itu, karena memaksa tidaklah dilakukan kecuali dalam hal yang masih samar tandanya, masih tersembunyi hasilnya atau dalam hal yang memang dibenci oleh jiwa. Adapun agama dan jalan yang lurus ini, maka telah jelas tanda-tanda (kebenarannya) oleh akal, telah jelas jalannya dan telah nampak perkaranya, telah diketahui petunjuknya dan bukan kesesatan. Oleh karena itu, orang yang memperoleh taufiq apabila memperhatikan agama ini meskipun sebentar, niscaya dia akan mendahulukan dan memilihnya. Sedangkan orang yang buruk niatnya, rusak pilihannya dan buruk jiwanya, maka ketika melihat yang hak, dia lebih memilih yang batil, saat ia melihat yang bagus, maka ia lebih memilih yang jelek. Orang seperti ini, Allah tidak butuh memaksanya menganut agama ini karena tidak ada nilai dan faedahnya. Di samping itu, orang yang dipaksa imannya tidaklah sah. Namun demikian, ayat ini tidaklah menunjukkan agar kita tidak memerangi orang-orang kafir harbiy (yang memerangi Islam). Tetapi maksudnya, bahwa hakikat agama ini sesungguhnya menghendaki untuk diterima oleh setiap orang yang adil, yang tujuannya mencari yang hak. Adapun masalah memerangi atau tidaknya, tidaklah ditunjukkan olehnya. Bahkan, kewajiban berperang diambil dari nash-nash yang lain. Akan tetapi dari ayat yang mulia ini, dapat dipakai dalil diterimanya jizyah (pajak) dari selain ahlul kitab sebagaimana hal itu merupakan pendapat kebanyakan ulama.\" Yakni telah jelas berdasarkan ayat-ayat yang begitu jelas bahwa iman adalah petunjuk dan kekafiran adalah kesesatan. Ayat ini turun berkenaan tentang sebagian orang Anshar yang memiliki anak, di mana dia hendak memaksa mereka masuk Islam. Thaghut ialah setan dan apa saja yang disembah selain Allah Subhaanahu wa Ta'aala. Di mana tali yang dipegangnya dapat menyelamatkan dan menjaganya dari terjatuh ke dalam neraka. Allah Maha Mengetahui apa yang dilakukan mereka serta mengetahui niatnya, dan Dia akan memberikan balasan terhadap semua itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 256",
    "description": "Meski memiliki kekuasaan yang sangat luas, Allah tidak memaksa seseorang untuk mengikuti ajaran-Nya. Tidak ada paksaan terhadap seseorang dalam menganut agama islam. Mengapa harus ada paksaan, padahal sesungguhnya telah jelas perbedaan antara jalan yang benar dengan jalan yang sesat. Oleh karena itu, janganlah kamu menggunakan paksaan apalagi kekerasan dalam berdakwah. Ajaklah manusia ke jalan Allah dengan cara yang terbaik. Barang siapa ingkar kepada tagut, yaitu setan dan apa saja yang dipertuhankan selain Allah, dan beriman kepada Allah, maka sungguh, dia telah berpegang teguh pada ajaran agama yang benar sehingga tidak akan terjerumus dalam kesesatan, sama halnya dengan orang yang berpegang teguh pada tali yang sangat kuat yang tidak akan putus sehingga dia tidak akan terjatuh. Agama yang benar ibarat tali yang kuat dan terjulur menuju Allah, dan di situ terdapat sebab-sebab yang menyelamatkan manusia dari murka-Nya. Allah maha mendengar segala yang diucapkan oleh hamba-Nya, maha mengetahui segala niat dan perbuatan mereka, sehingga semua itu akan mendapat balasannya di hari kiamat. Mereka yang berpegang teguh pada tali yang kukuh tidak akan sendiri karena Allah selalu menemani dan melindungi-Nya. Allah adalah pelindung orang yang beriman. Dia memelihara, mengangkat derajat, dan menolong mereka. Salah satu bentuk pertolongan-Nya adalah dia selalu terus menerus mengeluarkan dan menyelamatkan mereka dari kegelapan kekufuran, kemunafikan, keraguan, dorongan mengikuti setan, dan hawa nafsu, kepada cahaya keimanan dan kebenaran. Cahaya iman apabila telah meresap ke dalam kalbu seseorang akan menerangi jalannya, dan dengannya ia akan mampu menangkal kegelapan dan menjangkau sekian banyak hakikat dalam kehidupan. Dan sebaliknya, orang-orang yang kafir, pelindung-pelindungnya adalah setan, baik dari kalangan jin maupun manusia, yang mengeluarkan mereka dari cahaya hidayah kepada kegelapan kesesatan. Mereka adalah penghuni neraka. Mereka kekal di dalamnya, dan itu adalah tempat yang palik buruk."
  }
]