[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah senantiasa melindungi orang-orang mukmin dengan pertolongan, taufik dan penjagaanNya, Dia mengeluarkan mereka dari kegelapan-kegelapan kekafiran menuju cahaya keimanan. Sedang orang-orang yang kafir, para penolong dan para pelindung mereka adalah tandingan-tandingan Allah dan berhala-berhala yang mereka sembah selain Allah, yang mengeluarkan mereka dari cahaya keimanan menuju kegelapan kegelapan kekafiran. Mereka itu adalah para penghuni neraka yang akan terus berada di sana. Di dalamnya, mereka akan tinggal secara abadi, tidak akan pernah keluar darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "257. Allah melindungi orang-orang yang beriman kepada-Nya. Dia membimbing, menolong dan mengeluarkan mereka dari gelapnya kekafiran dan kebodohan menuju terangnya iman dan ilmu. Sedangkan orang-orang kafir, pelindung mereka ialah setan dan kawan-kawan yang menyulap kekafiran agar tampak indah di mata mereka. Kemudian mereka mengeluarkan orang-orang kafir itu dari terangnya iman dan ilmu menuju gelapnya kekafiran dan kebodohan. Mereka itulah penghuni neraka yang akan tinggal di dalamnya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "257. Allah adalah penolong orang-orang yang beriman kepada-Nya dan rasul-Nya, mengeluarkan mereka dari kesesatan menuju petunjuk. Sedangkan orang-orang yang mendustakan Allah dan rasul-Nya akan dikuasai oleh setan, sehingga dapat mengeluarkan mereka dari cahaya iman menuju kegelapan kekafiran; mereka adalah orang-orang yang jauh dari rahmat Allah dan akan menjadi penghuni neraka selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "257. اللهُ وَلِىُّ الَّذِينَ ءَامَنُوا۟ ( Allah Pelindung orang-orang yang beriman) Yakni penolong mereka. يُخْرِجُهُم مِّنَ الظُّلُمٰتِ إِلَى النُّورِ ۖ (Dia mengeluarkan mereka dari kegelapan (kekafiran) kepada cahaya (iman)) Yakni dari syubhat-syubhat menyesatkan, kejahilan, dan penyembahan thaghut kepada ilmu, petunjuk, dan keimanan. وَالَّذِينَ كَفَرُوٓا۟ أَوْلِيَآؤُهُمُ الطّٰغُوتُ(Dan orang-orang yang kafir, pelindung-pelindungnya ialah thaghut) Dan makna dari (أولياء) adalah para pemimpin kekufuran dan filsafat-filsafatnya yang memerintahkan dan menghiasi untuk mereka kekufuran dan keingkaran kepada tuhan, sehingga mengeluarkan mereka dari cahaya -yang berupa fitrah yang atas itu Allah ciptakan manusia, dan cahaya yang berupa seruan kepada tauhid yang benar yang didatangkan oleh para Nabi mereka, juga cahaya syariat-syariat yang baik- menuju kepada gelapnya kekufuran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang mutadabbit berkata : Suatu ketika aku menghadiri satu majlis bersama seorang ikhwah asal inggris bernama : Khalil, dalam majlis itu ia bercerita bagaimana ia masuk ke dalam islam, kemudian salah seorang dari hadirin bertanya : bagaimana pengaruh islam terhadap kehidupannya ? maka dia pun menjawab : aku pernah hidup dalam kegelapan sebagaimana yang Allah ketakan dalam firman-Nya : { يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ }, kemudian ia memberi isyarat dengan tangannya yang menutup kedua matanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "257. Allah adalah penolong dan penyelamat orang-orang mukmin. Dia memelihara, memberi taufik dan memenuhi kebutuhan mereka dengan karuniaNya. Dia mengeluarkan mereka dari gelapnya kekufuran, kebingungan dan kebodohan menuju cahaya hidayah, keimanan dan ilmu pengetahuan. Orang-orang kafir itu penolongnya adalah para pemimpin yang sesat, penyembah selain Allah dan para setan yang mengeluarkan mereka dari cahaya keimanan yang merupakan fitrah dari Allah menuju gelapnya kekufuran, kemaksiatan dan kebodohan. Orang-orang kafir itu adalah penduduk neraka yang tinggal abadi di sana selama-lamanya. Ath-Thabary meriwayatkan dari Abdah bin Ubay Lubabah tentang firmanNya {Allahu Waliyyu …} berkata: “Mereka itu adalah orang-orang yang beriman kepada Isa, lalu ketika nabi Muhammad SAW datang, mereka beriman kepadanya. Lalu ayat ini turun untuk mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah adalah pelindung orang-orang yang beriman} Dzat yang memelihara urusan-urusan orang yang beriman {Dia mengeluarkan mereka dari kegelapan} gelapnya kekufuran dan kebodohan {menuju cahaya} cahaya keimanan dan keilmuan {Sedangkan orang-orang yang kafir, pelindung-pelindung mereka adalah tagut. Tagut-tagut itu mengeluarkan mereka dari cahaya menuju kegelapan. Mereka itulah para penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "257. Ayat ini merupakan rangkaian dari ayat sebelumnya. Ayat yang sebelumnya merupakan dasar sedangkan ayat ini adalah manifestasinya. Allah mengabarkan bahwasanya orang-orang yang beriman kepadaNya mereka membenarkan kaimanan mereka dengan menunaikan kewajiban-kewajiban keimanan dan meninggalkan segala perkara yang maniadakanya, Allah adalah wali mereka dan menjadikan mereka sebagai orang-orang yang di cintai dengan kecintaaNya yang istimewa, dan Dia menangani pendidikan mereka. Maka Allah mengeluarkan mereka dari kegelapan kejahilan, kekufuran, kemaksiatan, kelalaian, dan ketaatan, dan penerimaan yang total terhadap RabbNya, dan Allah menerangi hati mereka dengan apa yang dipancarkaNya ke dalamnya dari cahaya wahyu dan keimanan, memudahkan mereka kepada kemudahan, dan menjauhkan mereka dari perkara yang sulit. Adapun orang-orang yang kafir, tatkala mereka loyal kepada selain wali mereka yang haq, maka Allah menyerahkan urusan mereka kepada apa yang telah mereka sendiri jadikan wali untuk mereka, menghinakan mereka, mewakilkan pemeliharaan mereka kepada wali yang mereka pilih, yang sama sekali tidak memiliki manfaat dan mudharat. Maka wali-wali mereka menyesatkan dan menyengsarakan mereka serta menghalangi mereka dari petunjuk ilmu yang bermanfaat dan amal shalih dan juga menghalangi mereka mendapatkan kebahagiaan hingga nerekalah yang menjadi tempat kembali mereka, mereka kekal di dalam selamanya. Ya Allah, jadikanlah kami termasuk di antara orang-orang yang mana Engkau menjadi wali mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱللَّهُ وَلِيُّ ٱلَّذِينَ ءَامَنُواْ } Allâhu waliyyuladzîna âmanû: Allah Ta’ala yang menjadi pelindung bagi orang-orang yang beriman, yang menjaga, menolong dan memberikan taufiq kepada mereka. { ٱلظُّلُمَٰتِ } Azh-Zhulumât: Gelapnya kebodohan dan kekufuran. { ٱلنُّورِۖ } An-Nur: Cahaya keimanan dan ilmu. { أَوۡلِيَآؤُهُمُ ٱلطَّٰغُوتُ } Auliyâ’uhumuthâghût: Pelindung mereka adalah setan yang menghiasi peribadahan kepada berhala, sehingga mengeluarkan mereka dari batasan keimanan menuju kekufuran, dan menjauhkan mereka dari ilmu menuju kebodohan. Makna ayat: Lantas Allah Ta’ala mengabarkan bahwa Dia menjadi pelindung bagi hamba-hambaNya yang mukmin, yaitu dengan mengeluarkan mereka dari kekufuran dan kebodohan menuju ilmu dan keimanan sehingga kehidupan hamba menjadi sempurna dan bahagia. Adapun orang-orang kafir maka pelindung mereka adalah thaghut dari bangsa setan yaitu jin dan manusia, dimana mereka menghiasi sesuatu yang batil dan buruk sehingga nampak indah, dan menghiasi kekufuran, kefasikan dan kemaksiatan. Sehingga para thaghut itu mengeluarkan mereka dari cahaya menuju kegelapan dan mempersiapkan mereka untuk masuk neraka selama-lamanya. Pelajaran dari ayat: • Kedekatan dengan Allah dapat diperoleh dengan keimanan dan ketakwaan. • Pertolongan Allah ta’ala dan pehatianNya diberikan kepada wali-wali Nya, bukan kepada musuh-musuhNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 257: Dengan memberikan pertolongan, taufiq dan penjagaan. Demikian pula Allah akan mengeluarkan mereka dari kegelapan kubur, kegelapan sewaktu hasyr (pengumpulan manusia), kegelapan pada hari kiamat kepada nikmat yang kekal, tempat peristirahatan yang sesungguhnya, keleluasaan dan kebahagiaan. Disebutkan bahwa orang-orang kafir wali mereka adalah setan, di mana setan itu mengeluarkan mereka dari cahaya kepada kegelapan adalah sebagai kebalikan orang-orang yang beriman, di mana wali mereka adalah Allah, dan Allah mengeluarkan mereka dari kegelapan kepada cahaya. Ayat ini bisa juga ditujukan kepada orang-orang Yahudi yang sebelumnya beriman kepada nabi sebelum diutusnya, namun setelah diutus, mereka kafir sehingga dikatakan \"mengeluarkan mereka dari cahaya (keimanan) kepada kegelapan (kekafiran)\", wallahu a'lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 257",
    "description": "Mereka yang berpegang teguh pada tali yang kukuh tidak akan sendiri karena Allah selalu menemani dan melindungi-Nya. Allah adalah pelindung orang yang beriman. Dia memelihara, mengangkat derajat, dan menolong mereka. Salah satu bentuk pertolongan-Nya adalah dia selalu terus menerus mengeluarkan dan menyelamatkan mereka dari kegelapan kekufuran, kemunafikan, keraguan, dorongan mengikuti setan, dan hawa nafsu, kepada cahaya keimanan dan kebenaran. Cahaya iman apabila telah meresap ke dalam kalbu seseorang akan menerangi jalannya, dan dengannya ia akan mampu menangkal kegelapan dan menjangkau sekian banyak hakikat dalam kehidupan. Dan sebaliknya, orang-orang yang kafir, pelindung-pelindungnya adalah setan, baik dari kalangan jin maupun manusia, yang mengeluarkan mereka dari cahaya hidayah kepada kegelapan kesesatan. Mereka adalah penghuni neraka. Mereka kekal di dalamnya, dan itu adalah tempat yang palik buruk. Tidakkah kamu memperhatikan keadaan yang sangat menakjubkan dari peristiwa orang yang mendebat ibrahim mengenai keesaan dan kekuasaan tuhannya dalam memelihara makhluk-Nya, karena Allah telah memberinya kerajaan atau kekuasaan, dan ia sombong dengannya. Kekuasaan itu membuatnya merasa wajar menjadi tuhan menyaingi Allah. Kekuasaan memang seringkali menjadikan orang lupa diri dan tuhannya. Kekuasaan itu seharusnya disyukuri, tetapi dengan angkuh ia malah bertanya kepada ibrahim, siapa tuhanmu' ketika ibrahim berkata, tuhanku ialah yang menghidupkan dengan meniupkan roh ke dalam tubuh dan mematikan dengan cara mencabutnya. Dia berkata dengan nada mengejek, aku pun dapat menghidupkan dan mematikan, yakni membiarkan hidup atau membunuh seseorang. Untuk menyudahi perdebatan, ibrahim menunjukkan bukti kekuasaan Allah dengan berkata, Allah menerbitkan matahari dari timur, maka terbitkanlah ia dari barat. Maka bingunglah orang yang kafir itu dan tidak mampu menjawab tantangan itu. Allah tidak memberi petunjuk kepada orang-orang zalim dan menolak mengikuti kebenaran."
  }
]