[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai Rasul), pernah melihat sesuatu yang lebih aneh dari keadaan seorang lelaki yang mendebat Ibrahim alaihi salam tentang keesaan Allah dan RububiyahNya, lantaran Allah memberikan orang itu kerajaan, lalu dia pun bersikap pongah dan bertanya kepada Ibrahim, “siapakah tuhanmu?” maka Ibrahim menjawab, “tuhanku adalah Dzat yang menghidupkan seluruh makhluk sehingga semuanya menjadi hidup dan mengambil kehidupan dari mereka sehingga mereka mati. Dia- lah satu-satunya dzat Yang berkuasa menghidupkan dan mematikan.” Lelaki itu berkata, “Aku (juga) berkuasa menghidupkan dan mematikan”. Maksudnya, aku bisa membunuh siapa saja yang aku kehendaki kematiannya, dan aku mempertahankan hidup seseorang yang aku kehendaki dia terus hidup. Maka Ibrahim berkata kepadanya, “sesungguhnya Allah Yang aku sembah menerbitkan matahari dari arah timur, apakah kamu sanggup mengubah ketetapan ilahi ini dan menjadikannya terbit dari arah barat?” Maka bingunglah lelaki kafir ini dan habislah argumentasinya. Sifatnya layaknya sifat orang-orang yang dzhalim, Allah tidak memberikan petunjuk kepada mereka menuju yang haq dan yang benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "258. Apakah engkau tahu -wahai Nabi- perilaku yang lebih aneh daripada kelancangan si durjana yang berdebat dengan Ibrahim -'alaihissalām- tentang ketuhanan dan keesaan Allah? Si durjana melakukan itu karena Allah telah memberikan kerajaan kepadanya. Lalu Ibrahim -'alaihissalām- menjelaskan kepadanya tentang sifat-sifat Rabbnya dengan mengatakan, “Rabbku dapat menciptakan dan menghidupkan makhluk.” Si durjana menjawab dengan angkuhnya, “Aku juga bisa menghidupkan dan mematikan dengan cara membunuh siapa saja yang aku inginkan dan memaafkan siapa saja yang aku inginkan.” Kemudian Ibrahim mengemukakan argumen lain yang lebih kuat, “Sesungguhnya Rabb yang aku sembah itu mendatangkan matahari dari arah timur. Coba engkau datangkan matahari dari arah barat!” Si durjana itu langsung kebingungan dan bungkam. Dia kalah oleh kuatnya argumen yang dikemukakan oleh Ibrahim. Allah tidak berkenan membimbing orang-orang yang zalim ke jalan-Nya, karena kezaliman dan kejahatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "258. Allah mengisahkan kepada Nabi Muhammad kisah yang terjadi antara Nabi Ibrahim dengan Namrud bin Kan’an. Tidakkah kamu mengetahui orang yang mendebat Ibrahim tentang keesaan dan ketuhanan Allah, sebab Allah telah memberinya kekuasaan sehingga menjadi angkuh. Ia bertanya kepada Ibrahim: “siapa Tuhanmu?” Ibrahim menjawab: “Dia adalah yang menghidupkan dan mematikan makhluk.” Ia membalas: “aku juga dapat mematikan dan menghidupkan.” Yakni aku dapat membunuh siapa yang hendak aku bunuh, dan membiarkan hidup siapa yang aku kehendaki untuk tetap hidup. Maka Ibrahim menjawab: “Allah menerbitkan matahari dari arah timur, maka terbitkanlah dari arah barat.” Maka Namrud yang kafir ini kebingungan untuk menjawabnya. Sungguh Allah tidak akan memberi petunjuk bagi orang-orang zalim ke jalan yang lurus. Adam mengeluarkan hadits shahih dari Mujahid, ia berkata: أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ Apakah kamu tidak memperhatikan orang yang mendebat Ibrahim tentang Tuhannya (Allah) karena Allah telah memberikan kepada orang itu pemerintahan (kekuasaan). Yang dimaksud adalah Namrud bin Kan’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "258. الَّذِى حَآجَّ إِبْرٰهِيْمَ فِى رَبِّهِۦٓ (yang mendebat Ibrahim tentang Tuhannya ) Pendapat merngatakan ia adalah Namrud yang ketika itu adalah raja Irak. أَنْ ءَاتَىٰهُ اللهُ الْمُلْكَ (karena Allah telah memberikan kepada orang itu pemerintahan (kekuasaan)) Yakni sehingga hal itu membuatnya angkuh dan sombong, maka dia pun mendebat Nabi Ibrahim karena itu. قَالَ أَنَا۠ أُحْىِۦ وَأُمِيتُ ۖ (orang itu berkata: “Saya dapat menghidupkan dan mematikan”) Dari Ibnu Abbas: didatangkan (kepada Namrud) dua orang, satu diantaranya dia bunuh dan satu lainnya dibiarkan hidup, lalu mengaku dia telah menghidupkan dan mematikan. Padahal itu adalah suatu yang keliru, karena yang dimaksud Nabi Ibrahim adalah Allah yang menciptakan kehidupan dan kematian pada jasad seseorang, sedangkan yang dimaksud si kafir Namrud adalah dia berkuasa untuk mengampuni agar tidak membunuh dan itu menurutnya adalah penciptaan penghidupan, dan dia berkuasa untuk membunuh dan itu menurutnya adalah penciptaan kematian; sehingga itu menjadi jawaban bodoh yang tidak layak untuk melawan dalil Nabi Ibrahim. قَالَ إِبْرٰهِيْمُ فَإِنَّ اللهَ يَأْتِى بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِهَا مِنَ الْمَغْرِبِ (Ibrahim berkata: “Sesungguhnya Allah menerbitkan matahari dari timur, maka terbitkanlah dia dari barat”) Nabi Ibrahim mendatangkan dalil ini yang tidak mungkin orang keliru dalam memahaminya, dan tidak bisa untuk keluar darinya dengan jalan keluar yang angkuh dan aneh. فَبُهِتَ (lalu terdiamlah orang kafir itu ) Yakni terpatahkan hujjahnya dan terdiam kebingungan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kenikmatan bisa jadi sebab terjerumusnya seseorang ke dalam kedurhakaan kepada Allah, karena jika seseorang terus hidup dalam kenikmatan, dan dalam kemewahan yang melimpah ruah, dalam kehidupan yang penuh dengan ketenangan, maka sesungguhnya ia mungkin saja durhaka, dan lupa kepada Allah, Allah berfirman : { أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ } \"Apakah kamu tidak memperhatikan orang yang mendebat Ibrahim tentang Tuhannya (Allah) karena Allah telah memberikan kepada orang itu pemerintahan (kekuasaan)\", dalam ayat ini menjelaskan bahwa orang ini tidaklah durhakan dan ingkar kepada sang pencipta melainkan Allah telah mendatangkan kepadanya kekuaasaan dan kekayaan; dan oleh karena itu penyakit terkadang menjadi nikmat dari Allah kepada hamba-Nya, begitu juga dengan kemiskinan dan musibah bisa menjadi nikmat bagi hamba!. 2 ) Barangsiapa yang berbuat adil dalam kehidupannya maka pantas baginya menerima hidayah dari Allah; sebagaiama yang disampaikan dalam mafhum mukholafah firman Allah : { وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ } \"dan Allah tidak memberi petunjuk kepada orang-orang yang zalim\" jika orang yang berbuat zhalim tidak akan mendapat hidayah dari Allah, maka orang yang manjauh dari kezhaliman itu dan berbuat adil layak mendapat hidayah dari Allah; maka seseorang yang, menghendaki kebenaran dan mengikuti kebenaran sedangkan kebenaran adala sebuah keadilan, niscaya oeluang besar baginya akan mendapat hidayah dari Allah, dan kan dipermudah baginya jalan untuk meraihnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "258. Apakah kamu tidak mengetahui orang yang membantah Ibrahim tentang keberadaan Tuhan, yaitu Namrudz bin Kan’an yang merupakan salah satu pembesar orang kafir Babilonia di Iraq. karena pemberian Allah kepadanya berupa kekuasaan yang tumbuhlah kesombongan dan keangkuhannya, lalu dia mengingkari nikmat-nikmat Allah, ketika berkata: “Siapakah Tuhanmu wahai Ibrahim?” Lalu Ibrahim menjawab: “Tuhanku adalah Dzat yang menghidupkan dan mematikan manusia” Lalu Namrudz berkata: “Aku juga bisa menghidupkan dan mematikan” Ibnu Abbas berkata: “Namrudz mendatangkan dua orang laki-laki, lalu dia membunuh salah satunya dan mengampuni sisanya dan dia menganggap bahwa dia telah menghidupkan dan mematikan. Hal itu salah karena yang dimaksud Ibrahim adalah bahwa Allah adalah Dzat yang menciptakan kehidupan dan kematian sesuatu” Lalu Ibrahim berkata kepada Namrudz: “Sesungguhnya Allah menerbitkan matahari dari arah timur dan membenamkannya di arah barat” Itu adalah hujjah yang tidak salah, lalu orang kafir itu heran dan terkejut. Dan Allah tidak menolong orang-orang kafir menuju jalan hidayah karena mereka sendiri menjauh dari jalan tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan orang yang mendebat} orang yang menentang dan mendebat {Ibrahim mengenai Tuhannya karena Allah telah menganugerahkan kepadanya (orang itu) kerajaan, ketika Ibrahim berkata,“Tuhankulah yang menghidupkan dan mematikan” Orang itu berkata,“Aku dapat menghidupkan dan mematikan.”} Aku mengampuni seseorang dari hukuman mati, dan aku menghukum mati juga {Ibrahim berkata, “Sesungguhnya Allah menerbitkan matahari dari timur. Jadi terbitkanlah matahari dari barat!” Lalu orang kafir itu pucat} lalu dia terdiam dan kebingungan {Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "258. Allah mengisahkan kepada kita tentang Para Rasul Yang terdahulu, di mana dengan berita tersebut, maka jelaslah segala hakikat, bukti-bukti yang nyata beraneka ragam akan tegak membela tauhid. Alah mengabarkan tentang kekasihnya Ibrahim di mana ia mendebat raja yang zhalim, yaitu Nambruz penguasa Babilonia yang meniadakan dan mendustakan Rabb semesta Alam, dan dia menantang untuk menyerang Ibrahim al- khilal dan mendebatnya tentang perkara tersebutyang sama sekali tidsak ada keraguan, masalah dan kebimbangan padanya, yaitu tauhidulah dan rububiyahNya yang merupakan perkara yang paling jelas dan paling terang. Akan tetapi orang sombong ini telah terpedaya oleh kekuasaanya dan telah tersesat karenanya hingga akhirnya dia meniadakan Allah. Lalu ia mendebat Ibrahim, Rasul yang mulia yang telah di berikan kepadanya ilmu dan keyakinan yang tidak di berikan kepada seorangpun selainya dari para Rasul selain Muhammad maka Ibrahim memberikan pandangan kepadanya, “ Tuhanku ialah yang menghidupkan dan yang mematikan.” Artinya Dzat yang Maha Esa dalam menciptakan ,mengatur,menhidupkan, dan yang mematikan. Ibrahim menyebutkan dalam perktaanya itu hal yang paling jelas dalm masalah ini yaitu menghidupkan dam mematikan. Raja sombong itu menjawab dengan menantang, “Saya dapat menghidupkan dan mematikan.” Yang dia maksudkan dengan itu adalah saya membunuh orang yang saya kehendaki dan saya biarkan hidup kepada orang yang saya kehendaki. Telah dipahami bahwa hal iniadalah pembelokan dan pemalsuan dari hal yang di maksudkan. Padahal yang di maksudkan adalah bahwa Allah sendiri yang menciptakan dari hal-hal yang tidak ada dan kemudian mengembalikannya kepada kematian, dan bahwa dialah yang mematikan hamba-hambaNya, hewan-hewan melalui ajal-ajal mereka melalui sebab-sebab yang dikaitkan padanya maupun dengan tidak ada sebab. Dan ketika Al- Khalil melihatnya menyimpang dengan penyimpangan yang kemungkinan saja dapat meluas di antara rakyat jelata, Ibrahim akhirnya berkata dengan memaksanya untuk mempercayai perkataanya apa bila seperti yang dia sangkakan ”Allah menerbitkan matahari dari timur, maka terbitlah ia dari barat, lalu heran terdiam orang kafir itu,” yakni terhenti dan terputus hujjah-hujjahnya, serta lenyaplah syubhatnya. Sanggahan Nabi Ibrahim ini bukanlah merupakan perpindahan dari sebuah dalil kepada yang lainya, akan tetapi sebagai hujjah kepada Nambruz dengan mementahkan pendapatnya kalau ia benar. dan beliau mengemukakan hujjah tersebut yang tidak dapat dicampuradukan, diputarbalikan dan dipalsukan. Seluruh dalil pendengaran, logika, dan fitrah telah tegak sebagai saksi uluhiyah Allah dan mengakui keesaaNya dalam penciptaan dan pengaturan, dan bahwa yang seperti ini kondisinya, maka tidak berhak di sembah kecuali Allah saja. Seluruh Rasul sepakat atas asas yang agung ini, dan tidak ada yang mengingkari hal yang agung ini kecuali seorang yang durhaka,ngotot,dan mencontoh raja yang zhalim ini. Ini semua adalah dalil-dalil tauhid. Kemudian Allah menyebutkan dalil-dalil kesempurnaan tentang akan datangnyapenbangkitan dan pembalasan amal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أَلَمۡ تَرَ } Alam tara: Apakah belum sampai pengetahuan kepadamu wahai rasul kami. Kata tanya tersebut mengandung makna takjub dengan thaghut yang mengajak debat nabi Ibrahim. { حَآجَّ } Hâjja: Mengajak untuk berdebat. { فِي رَبِّهِۦ } Fî rabbihi: Mengenai rabbnya yaitu tentang wujud Allah, rububiyahNya dan uluhiyahNya bagi seluruh makhluk. { أَنۡ ءَاتَىٰهُ ٱللَّهُ ٱلۡمُلۡكَ } An âtâhullâhul mulka: Allah memberikan hukum dan kepemimpinan atas penduduk negerinya dan rumah-rumah kaumnya. { إِبۡرَٰهِ‍ۧمُ } Ibrâhim: Beliau adalah bapak para nabi, Ibrahim sang kekasih Allah (khalilullah) ‘alaihissalam. Perdebatan ini terjadi sebelum beliau hijrah ke negeri Syam. { فَبُهِتَ ٱلَّذِي كَفَرَۗ } Fabuhitalladziy kafara: Terdiam tidak bisa mengeluarkan bantahan, bingung dan terpojok orang kafir itu. Maksudnya adalah Namrud Al-Babiliy Makna ayat: Tatkala Allah Ta’ala menyebutkan perlindunganNya terhadap wali-waliNya, Allah menguatkan mereka dan menolong mereka serta mengeluarkan mereka dari kegelapan menuju cahaya. Allah menyebutkan contoh untuk hal itu, yaitu perdebatan Namrud Al-Babiliy dengan Ibrahim ‘alaihissalam. Allah Ta’ala berfirman kepada rasulNya Muhammad ﷺ,”Tidakkah engkau memperhatikan kepada orang yang mendebat Ibrahim mengenai Tuhannya” yaitu belum sampaikah kepadamu perdebatan orang yang melampaui batas (thaghut) yang tertipu dengan nikmat kekuasaan yang Kami berikan kepadanya sebagai ujian baginya, akan tetapi dia kufur dan mengaku sebagai Tuhan dan mendebat kekasih Kami (Ibrahim, pent). Maka kami jelaskan bahwasanya hal itu sungguh menakjubkan. Ketika Ibrahim ‘alaihissalam mengatakan kepadanya,”Tuhanku yang menghidupkan dan mematikan, sedangkan engkau tidak mampu menghidupkan dan mematikan” maka ia mengatakan,”Aku bisa menghidupkan dan mematikan.” Lantas Ibrahim menjawab argumennya itu,”Tuhanku dapat menerbitkan matahari dari timur, maka cobalah engkau terbitkan dari arah barat.” Maka ia terdiam kebigungan dan selesailah perdebatan. Allah Ta’ala menguatkan waliNya dan menolongnya. Ini merupakan contoh bagaimana Allah Ta’ala mengeluarkan waliNya dari gelapnya kebodohan menuju cahaya ilmu. Pelajaran dari ayat: • Nikmat terkadang membuat pemiliknya menjadi angkuh sehingga terhalang dari pertolongan Allah. • Menunjukkan pertolongan Allah bagi wali-wali Nya dan pemberian ilham untuk mengalahkan lawan debatnya. • Apabila seorang hamba senantiasa berbuat zhalim dan terus menerus melakukannya sampai terkenal dengan sifat tersebut, akan membuat dirinya terhalang dari hidayah Allah selamanya. • Bolehnya melakukan diskusi dan debat dalam rangka menetapkan akidah yang benar dan selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 258: Yaitu Namrudz dari Babilonia. Yakni berani sekali ia mendebat sesuatu yang sudah yakin dan tidak ada keraguan lagi. Tentang keesaan Allah dan tentang rububiyyah-Nya (kepengurusan-Nya) terhadap alam semesta. Sehingga dirinya bersikap sombong, sampai-sampai ia menyangka dapat berbuat seperti yang diperbuat Allah. Sebagai jawaban terhadap pertanyaan yang diajukan kepada Ibrahim, \"Siapakah Tuhan yang kamu mengajak kami menyembahnya?\" Maksud kata-kata raja Namrudz \"menghidupkan\" ialah membiarkan hidup, dan yang dimaksud dengan mematikan ialah membunuh. Perkataan itu untuk mengejek Nabi Ibrahim 'alaihis salam. Yakni Allah membiarkan mereka di atas kekafiran dan kesesatan, Karen merekalah yang memilih hal tersebut untuk diri mereka. Kalau seandainya, niat mereka mencari yang hak dan mencari hidayah, tentu Allah akan memberi mereka petunjuk dan memudahkan kepada mereka sebab-sebab untuk memperolehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 258",
    "description": "Tidakkah kamu memperhatikan keadaan yang sangat menakjubkan dari peristiwa orang yang mendebat ibrahim mengenai keesaan dan kekuasaan tuhannya dalam memelihara makhluk-Nya, karena Allah telah memberinya kerajaan atau kekuasaan, dan ia sombong dengannya. Kekuasaan itu membuatnya merasa wajar menjadi tuhan menyaingi Allah. Kekuasaan memang seringkali menjadikan orang lupa diri dan tuhannya. Kekuasaan itu seharusnya disyukuri, tetapi dengan angkuh ia malah bertanya kepada ibrahim, siapa tuhanmu' ketika ibrahim berkata, tuhanku ialah yang menghidupkan dengan meniupkan roh ke dalam tubuh dan mematikan dengan cara mencabutnya. Dia berkata dengan nada mengejek, aku pun dapat menghidupkan dan mematikan, yakni membiarkan hidup atau membunuh seseorang. Untuk menyudahi perdebatan, ibrahim menunjukkan bukti kekuasaan Allah dengan berkata, Allah menerbitkan matahari dari timur, maka terbitkanlah ia dari barat. Maka bingunglah orang yang kafir itu dan tidak mampu menjawab tantangan itu. Allah tidak memberi petunjuk kepada orang-orang zalim dan menolak mengikuti kebenaran. Atau tidakkah kamu perhatikan kisah seperti cerita orang yang melewati suatu negeri yang bangunan-bangunannya telah roboh hingga menutupi reruntuhan atap-atapnya, sehingga negeri itu tidak lagi berpenduduk. Melihat keadaan demikian, dia berkata dalam hati, bagaimana Allah menghidupkan kembali negeri ini setelah hancur' dia berkata demikian bukan karena tidak percaya kemampuan Allah menghidupkan yang telah mati; dia hanya mempertanyakan cara Allah menghidupkannya. Untuk membuktikan kekuasaan-Nya, lalu Allah mematikannya selama seratus tahun, kemudian menghidupkan dan membangkitkannya kembali. Setelah mengalami kematian dan dibangkitkan kembali, dia (Allah) bertanya, berapa lama engkau tinggal di sini' dia, pria itu, menjawab, aku tinggal di sini sehari atau setengah hari. Ia tidak tahu persis berapa lama ia di sana sebab tidak ada perubahan berarti yang ia rasakan atau lihat pa-da dirinya. Allah berfirman, tidak! engkau telah tinggal seratus tahun. Lihatlah makanan dan minumanmu yang belum berubah, tidak basi, tidak juga berkurang dari sebelumnya, tetapi lihatlah keledaimu yang telah mati seratus tahun yang lalu, menyisakan tulang belulang. Dan kami lakukan ini semua agar kami jadikan engkau tanda kekuasaan kami bagi manusia yang hidup setelah negeri itu mereka bangun kembali. Untuk mengetahui bagaimana cara Allah menghidupkan kembali yang telah mati, lihatlah tulang belulang keledai itu, bagaimana kami menyusunnya kembali, kemudian kami membalutnya dengan daging, maka hidup dan bangkitlah keledai itu seperti sedia kala. Maka ketika telah nyata baginya bukti kekuasaan Allah dalam menghidupkan kembali objek yang telah mati, dia pun berkata, saya mengetahui berdasar pandangan mata dan pengalaman setelah sebelumnya saya tahu berdasar argumen logika, bahwa Allah mahakuasa atas segala sesuatu."
  }
]