[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ataukah kamu pernah melihat (wahai Rasul), kejadian yang serupa dengan orang yang melewati satu perkampungan yang rumah-rumah huniannya telah hancur berantakan, dan menutup atap-atap nya. Maka orang itu berkata, “Bagaimana Allah akan menghidupkan negri ini setelah kehancurannya?” Lalu Allah mematikannya selama seratus tahun, kemudian mengembalikan ruh kepadanya dan bertanya kepadanya, “ Berapa lama kamu tinggal di tempat ini selama mati?” Dia menjawab, “ Aku berada di sini selama sehari atau setengah hari saja.” Lalu Allah mengabarkan kepadanya bahwa dia telah berada di situ selama seratus tahun, dan memerintahkannya untuk melihat makanan dan minumannya dan bagaimana Allah menjaga keduanya dari mengalami perubahan selama masa yang panjang ini. Dan memerintahkannya untuk melihat keledainnya, bagaimana Allah menghidupkannya kembali setelah menjadi tulang belulang yang bercerai berai? Dan Allah berfirman kepadanya, “Dan agar Kami menjadikan kamu sebagai bukti petunjuk untuk sekalian manusia.” Maksudnya, petunjuk nyata tentang kekuasaan Allah untuk membangkitkan makhluk setelah kematian. Dan Allah memerintahkannya untuk melihat tulang belulang, bagaimana Allah menyusun sebagian di atas sebagian lainnya dan menghubungkan sebagiannya dengan sebagian yang lain, dan tersusun rapi, kemudian membungkusnya dengan daging, lalu mengembalikan kehidupan padanya. Tatkala kejadian itu jelas tampak baginya secara kasat mata, dia pun mengakui Keagungan Allah dan sesungguhnya dia Maha Kuasa atas segala sesuatu, dan itu menjadi (Bukti Kuasa Allah) bagi sekalian manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "259. Atau tahukah engkau perihal perumpamaan orang yang melewati suatu desa yang atap rumah-rumahnya berjatuhan, dinding-dindingnya hancur berantakan dan penduduknya binasa, sehingga desa itu menjadi desa mati dan gersang. Orang tersebut heran melihat desa itu dan berkata, “Bagaimana Allah akan menghidupkan penduduk desa ini setelah kematiannya?!” Lalu Allah mematikan orang tersebut selama seratus tahun kemudian menghidupkannya kembali. Lalu Allah bertanya kepadanya, “Berapa lama engkau tinggal di sini?” Ia menjawab, “Aku tinggal di sini selama satu hari atau kurang dari satu hari.” Maka Allah berfirman, “Engkau tinggal di sini selama seratus tahun. Maka lihatlah makanan dan minuman yang engkau bawa. Makanan itu tetap seperti sediakala, tidak berubah sedikitpun. Padahal makanan dan minuman itu biasanya cepat sekali berubah (busuk). Lihatlah keledaimu yang mati. Sungguh Kami hendak menjadikanmu sebagai pertanda bagi manusia yang menunjukkan kekuasaan Allah untuk membangkitkan mereka (dari kematian). Lalu lihatlah tulang-belulang keledaimu yang berserakan dan berjauhan, bagaimana cara Kami mengangkatnya dan menggabungkannya satu sama lain, kemudian Kami balut tulang-belulang itu dengan daging dan Kami hidupkan kembali.” Maka tatkala orang itu melihat kejadian tersebut, dia mendapatkan gambaran yang jelas tentang hakikat masalah itu. Dan dia juga mengetahui kekuasaan Allah. Maka dia pun mengakui hal itu dengan mengatakan, “Aku mengetahui bahwa Allah Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "259. Hai Rasulullah, apakah kamu mengetahui kisah orang yang melewati suatu negeri yang kosong dari penduduknya dan telah runtuh. Kemudian ia berkata: “Bagaimana Allah akan menghidupkan negeri ini kembali setelah mati?” maka Allah mematikannya selama seratus tahun lalu menghidupkannya kembali. Kemudian Allah mengirim orang yang mengetahui keadaannya untuk bertanya: “Berapa lama kamu tinggal di tempat ini?” Ia menjawab: “mungkin sehari atau setengah hari.” Maka ia memberitahukan kenyataan sesungguhnya bahwa ia telah mati selama seratus tahun, kemudian memintanya untuk melihat makanan dan minumannya yang ternyata sama sekali tidak berubah, dan untuk melihat keledainya bagaimana Allah menghidupkannya kembali padahal sebelumnya hanya tulang belulang yang berserakan. Semua ini agar menjadi bukti kebenaran hari kebangkitan setelah kematian. Lihatlah kepada tulang belulang, bagaimana Kami mengangkat dan menyatukan bagian-bagiannya, kemudian Kami menyusunnya dengan daging, dan menjadikannya kembali hidup. Setelah ia melihat semua ini di depan mata, ia yakin bahwa Allah Maha Berkuasa melakukan segalanya, termasuk membangkitkan yang telah mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "259. أَوْ كَالَّذِى مَرَّ عَلَىٰ قَرْيَةٍ ( Atau apakah (kamu tidak memperhatikan) orang yang melalui suatu negeri) Yakni Uzair, seorang dari keturunan Bani Israil yang melewati negeri di tanah Baitul Maqdis setelah dihancurkan oleh Bukhtunasshor. خَاوِيَةٌ عَلَىٰ عُرُوشِهَا ( yang (temboknya) telah roboh menutupi atapnya) Yakni jatuh atapnya kemudian temboknya roboh menimpa atap tersebut. Dan pendapat lain mengatakan maknanya adalah sunyi dari manusia meski rumah-rumah masih berdiri. أَنَّىٰ يُحْىِۦ هٰذِهِ اللهُ (Bagaimana Allah menghidupkan kembali negeri ini setelah hancur? ) Merasa tidak mungkin negeri itu akan dihidupkan kembali karena keadaannya yang sedemikian rupa, yang mirip keadaan orang mati. Merasa tidak mungkin negeri itu akan dihidupkan lagi dengan dibangun lagi dan ditinggali. Dan pendapat lain mengatakan yang dimaksud adalah dia merasa tidak mungkin akan dihidupkan lagi penghuni negeri tersebut. فَأَمَاتَهُ اللهُ مِا۟ئَةَ عَامٍ ثُمَّ بَعَثَهُۥ ۖ (Maka Allah mematikan orang itu seratus tahun, kemudian menghidupkannya kembali ) Yakni Allah membuat perumpamaan untuknya dengan menggunakan dirinya. قَالَ كَمْ لَبِثْتَ ۖ (Allah bertanya: “Berapakah lamanya kamu tinggal di sini?” ) Yakni Allah bertanya kepadanya setelah dia dihidupkan kembali: Berapa lama kamu menjadi mayit? قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ ۖ (Ia menjawab: “Saya tinggal di sini sehari atau setengah hari” ) Orang itu menjawab dengan hal ini sesuai dengan apa yang dia rasakan dan dia kira. Dia mengira bahwa dia tidur sejenak kemudian terbangun. قَالَ بَل لَّبِثْتَ مِا۟ئَةَ عَامٍ (Allah berfirman: “Sebenarnya kamu telah tinggal di sini seratus tahun lamanya) Yakni dalam keadaan mati. فَانظُرْ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۖ(lihatlah kepada makanan dan minumanmu yang belum lagi berubah ) Yakni makanan dan minuman tidak berubah meski telah berlalu waktu yang begitu panjang dengan kekuasaan Allah dalam membuat sesuatu yang lain dari hal yang umum terjadi dan kekuasaan-Nya menyelisihi sunnah kauniyah pada makhluk-Nya. وَانظُرْ إِلَىٰ حِمَارِكَ(dan lihatlah kepada keledai kamu ) Yakni bagaimana tercerai-berai setiap bagiannya dan menjadi using tulang belulangnya; maka lihatlah bagaimana Kami menghidupkannya untukmu dan kamu melihatnya sendiri. وَلِنَجْعَلَكَ ءَايَةً لِّلنَّاسِ ۖ(Kami akan menjadikan kamu tanda kekuasaan Kami bagi manusia ) Yakni sebagai bukti atas kebangkitan setelah kematian. Dan pendapat lain mengatakan: dapat disebut sebagai bukti adalah karena dia dibangkitkan dalam keadaan muda seperti saat dia dimatikan dulu, kemudian dia mendapati anak cucunya telah menjadi tua. وَانظُرْ إِلَى الْعِظَامِ كَيْفَ نُنشِزُهَا( dan lihatlah kepada tulang belulang keledai itu, kemudian Kami menyusunnya kembali) Yakni Kami mengangkat sebagian tulang itu diatas sebagian lainnya sampai tersusun setiap tulang pada tempatnya. ثُمَّ نَكْسُوهَا لَحْمًا ۚ (kemudian Kami membalutnya dengan daging ) Yakni menutupinya dengan daging. Pertama yang diciptakan Allah adalah kedua matanya, sehingga ia melihat tulang belulangnya saling tersusun; kemudian ditutup dengan daging dan pada akhirnya ditiupkan padanya nyawa. فَلَمَّا تَبَيَّنَ لَهُۥ (Maka tatkala telah nyata kepadanya ) Yakni setelah jelas baginya didepan mata apa yang dulu baginya tidak mungkin dalam kekuasaan Allah. قَالَ أَعْلَمُ (diapun berkata: “Saya yakin ) Yakni saya yakin bahwa perumpamaan ini adalah bagian dari keyakinan yang dulu belum aku yakini yaitu berupa kemantapan hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "259. Ataukah kamu telah melihat Uzair dari Bani Israil wahai Nabi, ketika dia melewati suatu negeri di daerah Baitul Maqdis setelah kehancuran Nebukadnezar, yaitu negeri tak berpenduduk dan rumah-rumahnya masih berdiri, atau atap-atap dan tembok-temboknya roboh. Lalu dia berkata: “Bagaimana Allah menghidupkan penduduk negeri ini atau bagaimana Dia mengembalikan kehidupan di dalamnya dengan mengembalikan bangunan dan penduduknya?” Lalu Allah mematikan dia selama 100 tahun dan menghidupkannya lagi dan bertanya kepadanya: “Berapa lama kamu menjadi mayat di sini?” Lalu dia berkata sesuai dugaannya: “Aku tinggal di sini hanya sehari atau beberapa hari saja” yang mana dia berkeyakinan bahwa dirinya hanya tidur lalu bangun. Kemudian Tuhannya berfirman kepadanya: “Sebenarnya kamu menjadi mayat di sini selama 100 tahun. Maka lihatlah makanan dan minuman yang kamu bawa yang mana dengan kuasa Allah, tidak ikut berubah bersama dengan berlalunya waktu. Lalu lihatlah juga bagaimana Kami menghidupkan keledaimu yang sudah mati dan bagian-bagian tubuhnya terpisah, supaya Kami bisa memberikan contoh kebangkitan setelah kematian dan memberi petunjuk atas kuasa Kami. Lihatlah tulang-tulang itu, bagaimana Kami mengangkatnya dari bumi dan Kami gabungkan bagian-bagiannya, lalu Kami kembalikan ke tempatnya dan Kami beri daging.” Tatkala hal itu terlihat jelas di matanya, setelah terkejut terhadap kuasa Allah, dia berkata: “Sekarang aku tahu, yaitu hatiku menjadi tenang karena yakin bahwa Allah itu maha Kuasa atas segala sesuatu. Tidak ada sesuatu pun di bumi dan langit yang bisa menaklukkannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau seperti orang} ataukah kamu pernah perumpamaan orang {yang melewati suatu negeri yang telah roboh} runtuh {menutupi atap-atapnya} atap-atapnya {Dia berkata, “Bagaimana} bagaimana {Allah menghidupkan kembali negeri ini setelah kehancurannya?” Lalu, Allah mematikannya selama seratus tahun, kemudian membangkitkannya} menghidupkannya. {Allah bertanya, “Berapa lama kamu tinggal”} berapa lama kamu tinggal {Dia menjawab, “Aku tinggal sehari atau setengah hari.” Allah berfirman, “Sebenarnya kamu telah tinggal selama seratus tahun. Lihatlah makanan dan minumanmu yang belum berubah} berubah {dan lihatlah keledaimu dan Kami akan menjadikanmu sebagai tanda (kekuasaan Kami) bagi manusia. Lihatlah tulang-belulang itu, bagaimana Kami menyusunnya kembali} Kami mengangkatnya lalu menyusunnya satu sama lain {kemudian Kami membalutnya dengan daging.” Ketika telah nyata baginya, dia pun berkata, “Aku mengetahui bahwa Allah Maha kuasa atas segala sesuatu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "259. Kedua ayat ini adalah dalil yang agung yang nyata di dunia sebelum di akhirat tentang akan datang nya kebangkitan kembali dan pembalasan amal. Salah satunya adalah Allah perlihatkan kepada seseorang yang ragu akan kebangkitan menurut pendapat yang benar sebagaimana yang di tunjukan ayat yang mulia ini. Sedangkan lainya, Allah perlihatkan kepada kekasihNya Ibrahim sebagaiman Allah perlihatkan dalil tauhid sebelumnya juga pada diri beliau. Orang tersebut melewati sebuah desa yang telah luluh lantah dan temboknya telah runtuh menutupi atapnya, pendududknya telah meniggal dan bangunan-bangunannya telah hancur berantakan, lalu dia berkata dengan rasa ragu dan suatu yang tidak mungkin,”Bagaimana Allah menghidupkan kembali negeri ini setelah hancur?” Artinya, hal tersebut sangatlah mustahil dengan kondisi desa yang seperti itu. Maksudnya, selain desa itupun seperti itu, seperti apa yang terbesit di dalam hatinya pada waktu itu. Maka Allah menghendaki rahmat kepada orang tersebut dan bagi seluruh manusia dimana Allah mematikanya selama seratus tahun. Ketika itu dia bersama seekor keladai, lalu Allah juga mematikanya bersama orang itu, demikian juga makanan dan minuman, lalu Allah mengawetkan makanan dan minumanya itu seperti keadaannya semula, dalam waktu yang panjang tersebut. Setelah tahun demi tahun berlalu hingga seratus tahun, maka Allah membangkitkanya seraya berfirman, ”Berapakah lamanya kamu tinggal di sini?” dia menjawab ”Saya tinggal di sini sekitar sehari atau setengah hari.” Hal itu menurut sangkaan dirinya, maka Allah berfirman, ”Sebenarnya kamu telah tinggal di sini seratus tahun lamanya.” Tampaknya tanya jawab itu melalui perantaraan seorang Nabi dari Nabi-Nabi Allah yang mulia. Dan di antara kesempurnaan rahmat Allah kepadanya dan kepada seluruh manusia, adalah bahwa Allah memperlihatkan tanda-tanda secara nyata, agar ia puas dengan hal tersebut. Dan setelah ia mengetahui bahwa ia adalah mayit yang telah dihidupkan kembali oleh Allah, dikatakan kepadanya, “Lihatlah kepada makanan dan minumanmu yang belum lagi berubah.”Artinya, tidak berubah dalam masa yang panjang ini makanan dan minuman tersebut khususnya yang di sebutkan oleh ahli-ahli tafsir bahwa hal itu adalah merupakan buah-buahan dan minum-minuman perasaan buah tidak lama berubah. Lalu dikatakan kepadanya, “Dan lihatlah kepada keledaimu,” yang ternyata telah terpisah-pisah dan terpecah-pecah dan telah menjadi tulang belulang yang telah rapuh. “Dan lihatlah kepada tulang belulang keledai itu, Kemudian Kami Menyusunnya kembali, maksudnya kami mengangkat sebagiannya kepada bagian yang lain, kemudian Kami menyambung sebagian kepada sebagian yang lain, setelah terpecah-pecah dan terbelah-belah, “kemudian kami membalutnya,” setelah menyatu kembali, ”dengan daging,” kemudian Kami mengembalikan kehidupan padanya. “Maka tatkala telah nyata kepadanya (bagaimana Allah menghidupkan orang yang telah mati),” dengan penglihatan mata yang tidak mungkin ada keraguan, ”diapun berkata, ’Saya yakin bahwa Allah Maha kuasa atas segala sesuatu’.” Maka ia pun mengakui atas Kuasa Allah atas segala sesuatu, kemudian dia menjadi bukti atas manusia, karena mereka telah mengetahui kematianya, kematian keledainya, dan mereka mengetahui permasalahanya, kamudian mereka menyaksikan bukti yang agung ini. Dan inilah yang benar pada orang tersebut. Adapun sebagian pendapat besar ahli tafsir, bahwasanya orang tersebut adalah seorang Mukmin, atau seorang Nabi dari Nabi-Nabi Allah, baik uzair atau selainya, dan bahwasanya firmannya,”Bagaimana Allah menghidupkan kembali negeri ini setelah hancur?” maksudnya, bagaimana desa ini bisa ramai setelah hancur lebur seperti itu, dan bahwasanya Allah mematikanya agar memperlihatkan kepadanya bagaiman Allah mengembalikan desa itu menjadi ramai dengan menciptakanya kembali, dan bahwa desa itu telah di ramaikan kembali pada masa panjang itu dan manusia kembali membangunnya dan akhirnya kembali ramai padahal sebelumnya hancur berantakan, ini semua tidaklah di tunjukan oleh lafadz (yang ada dalam rangkaian kisah ini) namun malah meniadakanya, dan tidak juga di tunjukan oleh maknanya. Tanda dan bukti mana yang menunjukan tentang desa yang kembali setelah hancur lembur itu menjadi desa yang ramai lagi? Dan ini masih dapat terus di saksikan, di mana suatu desa hidup dan ramai semaentara desa-desa lain hancur. Adapun ayat yang agung ini adalah tentang hidupnya kembali orang itu setelah kematianya dan di hidupkanya kembali keledainya serta di biarkannya makanan dan minumannya yang tidak membusuk dan tidak berubah. Kemudian firmanya, ”Maka tatkala telah nyata kepadanya (bagaimana Allah menghidupkan kembali yang telah mati).” Semua itu adalah sangat jelas tentang ketidaktahuannya, kecuali setelah dia menyaksikan sendiri kondisi itu secara nyata yang menunjukan kesempurnaan kuasaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { قَرۡيَةٖ } Qaryah: Sebuah kota yang tidak diberitahukan namanya oleh Allah, maka tidak perlu mencarinya karena tidak terlalu penting mengetahuinya. { خَاوِيَةٌ } Khawiyah: Kosong dari penduduknya dan atapnya berjatuhan ke dalam bangunan dan dinding-dindingnya. { أَنَّىٰ يُحۡيِۦ } Anna yuhyi: Bagaimana Allah menghidupkannya { بَعۡدَ مَوۡتِهَاۖ } Ba’da mautihâ: Setelah kosong dan roboh atap-atapnya { لَبِثۡتَۖ } Labitstu: Saya telah tinggal. { لَمۡ يَتَسَنَّهۡۖ } Lam yatasannah: Tidak berubah dengan berlalunya waktu. { ءَايَةٗ } âyat: Tanda akan kekuasaan Allah dengan membangkitkan manusia dalam keadaan hidup pada hari kiamat. { نُنشِزُهَا } Nunsyizuhâ: Dalam qiraah Warsy lafadznya “Nansyuruhâ” yang bermakna Kami hidupkan setelah kematiannya. Sedangkan makna “Nunsyizuhâ” adalah kami angkat dan kami kumpulkan kembali sehingga menjadi keledai seperti sebelumnya. Makna ayat: Ayat ini mengandung contoh yang lain masih berhubungan dengan contoh sebelumnya. Menunjukkan hakikat perlindungan Allah kepada Ibrahim, dimana Allah menguatkannya dengan hujjah yang tegas dan pertolonganNya terhadap musuhnya yaitu Namrud. Allah Ta’ala berfirman; “Atau apakah (kamu tidak memperhatikan) orang-orang yang melalui suatu negeri yang (temboknya) telah roboh menutupi atapnya.” Atau seperti orang yang melewati negeri yang kosong ditinggalkan penduduknya, atap-atap bangunannya telah berjatuhan menimpa tembok-temboknya, maka orang yang lewat itu berkata dengan penuh keheranan,”Bagaimana Allah menghidupkan negeri ini setelah hancur seperti ini?” maka Allah mematikannya selama seratus tahun kemudian menghidupkannya, dan bertanya kepadanya,”Berapa lama kamu tinggal (tidur)?” ia menjawab,”Sebagaimana biasa orang tertidur di suatu hari dan bangun pada hari itu juga.” Ia menyangka dirinya tertidur sehari atau setengah hari. Maka Allah meluruskannya,”Bahkan kamu tidur sudah seratus tahun.” Agar ia percaya dengan berita yang diberikan maka Allah menyuruhnya untuk melihat makanannya sekeranjang buah tin, dan minumanmu berupa jus buah anggur, keduanya tidak berubah rasanya, warnanya padahal telah berlalu satu abad. Maka lihatlah keledaimu sudah hancur dengan berlalunya waktu dan tidak tersisa kecuali tulangnya yang putih. Ini adalah dalil yang tegas akan kematian keledainya setelah lewat waktu seratus tahun. Kemudian lihatlah sekali lagi kepada tulang belulang itu, bagaimana Kami mengumpulkannya dan membungkusnya lagi dengan daging, maka itulah keledaimu yang engkau tunggangi seratus tahun yang lalu dan engkau tinggalkan tertidur sedangkan hewan itu berada di sampingmu makan rumput. Maka nampaklah kekuasaan Allah untuk tidak mengubah makanan dan minuman itu yang biasanya sehari saja sudah menjadi basi, dan terbukti juga pada keledai yang biasanya akan berubah setelah puluhan tahun. Kemudian kekuasaan Allah juga nampak pada pemilik makanan dan keledai itu dengan kematiannya lantas hidup kembali dan tidak ada yang mengetahuinya pada waktu seratus tahun. Allah Ta’ala berfirman kepadanya setelah menunjukkan berbagai macam kekuasaanNya,”Kami melakukan ini kepadamu untuk memperlihatkan kepadamu kekuasaan Kami dengan menghidupkan kembali suatu negeri, dan Kami ingin menghidupkanmu kembali agar kisahmu ini menjadi bukti bagi manusia, membimbing mereka agar beriman kepada Kami dan bertauhid dalam beribadah kepada Kami, dan juga menunjukkan kekuasaan Kami untuk membangkitkan kembali yang tidak diragukan lagi padanya, agar setiap jiwa mempertanggungjawabkan apa yang telah diperbuat. Setelah cahaya Allah menyinari hati hamba yang mukmin ini, yang semula heran dengan kehancuran negeri dan tidak mungkin menurut persangkaannya untuk dibangun kembali, akhirnya mengatakan,”Sekarang aku mengetahui bahwa Allah Maha Mampu melakukan segala sesuatu.” Ini sesuai dengan firman Allah Ta’ala; “Allah adalah penolong orang-orang yang beriman yang akan mengeluarkan mereka dari berbagai macam kegelapan menuju kepada cahaya.” Pelajaran dari ayat: • Diperbolehkan bagi seorang hamba memiliki keyakinan bahwa sesuatu yang benar dan ada itu sulit terjadi, seperti yang terjadi pada hamba mukmin yang lewat negeri itu berkeyakinan bahwa negeri yang sudah kosong dan hancur itu tidak dapat dihidupkan kembali. • Besarnya kekuasaan Allah dimana tidak ada sesuatu apapun yang dapat menandingiNya, Dia Maha Mampu atas segala sesuatu. • Ketetapan mengenai kebangkitan manusia dan itu pasti terjadi. • Pertolongan Allah kepada hambaNya yang mukmin yang bertakwa terlihat ketika Allah menghilangkan kegelapan yang ada pada hati seorang mukmin yang merasa bahwa sulit bagi Allah untuk menghidupkan kembali negeri yang mati. Maka Allah memperlihatkan kekuasaanNya kepada hamba itu sehingga ia mengatakan,”Aku mengetahui bahwa Allah itu kuasa atas segala sesuatu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 259: Ada yang mengatakan bahwa negeri itu adalah Baitul Maqdis dahulu, orang yang melewatinya dengan berkendaraan keledai adalah Uzair. Ia pun berkata dengan nada ta'ajjub (bingung) \"Bagaimana caranya Allah menghidupkan negeri yang telah hancur ini?\" Namun Syaikh As Sa'diy dalam tafsirnya berpendapat bahwa orang tersebut sebelumnya adalah orang yang mengingkari adanya kebangkitan, lalu Allah menghendaki ia memperoleh kebaikan dan ingin menjadikannya sebagai bukti bagi manusia. Ia beralasan dengan tiga alasan berikut: Pertama, perkataannya \"Bagaimana Allah menghidupkan kembali negeri ini setelah hancur?\" jika memang ia seorang nabi atau hamba yang shalih, tentu tidak akan mengatakan kata-kata seperti itu. Kedua, Allah Subhaanahu wa Ta'aala memperlihatkan ayat-Nya pada makanan, minuman, keledainya dan pada dirinya agar ia dapat melihat secara langsung sehingga dapat mengakui hal yang sebelumnya diingkari. Ketiga, firman Allah \" Maka ketika telah nyata kepadanya \" yakni telah nyata sesuatu yang sebelumnya tidak diketahuinya atau samar baginya. Wallahu a'lam. Dalam kisah di atas terdapat bukti bahwa Allah mampu menghidupkan yang mati, sebagaimana Allah menghidupkan orang tersebut, menghidupkan keledainya serta menjaga makanan dan minumannya sehingga tidak berubah. Karena dirobohkan oleh raja Bukhtanasshar. Kata-kata ini diucapkan karena ia tidur di pagi hari lalu dicabut nyawanya, kemudian dihidupkan kembali menjelang matahari tenggelam, walahu a'lam. Meskipun sudah bertahun-tahun. Pada yang demikian itu terdapat dalil yang jelas kemahakuasaan Allah, yang mampu menjaga makanan itu sehingga tidak berubah meskipun telah berlalu masa yang lama, padahal makanan merupakan sesuatu yang paling cepat berubah menjadi basi dan tidak bisa dimakan lagi. Yakni bukti atas kemahakuasaan Allah untuk membangkitkan manusia yang telah mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 259",
    "description": "Atau tidakkah kamu perhatikan kisah seperti cerita orang yang melewati suatu negeri yang bangunan-bangunannya telah roboh hingga menutupi reruntuhan atap-atapnya, sehingga negeri itu tidak lagi berpenduduk. Melihat keadaan demikian, dia berkata dalam hati, bagaimana Allah menghidupkan kembali negeri ini setelah hancur' dia berkata demikian bukan karena tidak percaya kemampuan Allah menghidupkan yang telah mati; dia hanya mempertanyakan cara Allah menghidupkannya. Untuk membuktikan kekuasaan-Nya, lalu Allah mematikannya selama seratus tahun, kemudian menghidupkan dan membangkitkannya kembali. Setelah mengalami kematian dan dibangkitkan kembali, dia (Allah) bertanya, berapa lama engkau tinggal di sini' dia, pria itu, menjawab, aku tinggal di sini sehari atau setengah hari. Ia tidak tahu persis berapa lama ia di sana sebab tidak ada perubahan berarti yang ia rasakan atau lihat pa-da dirinya. Allah berfirman, tidak! engkau telah tinggal seratus tahun. Lihatlah makanan dan minumanmu yang belum berubah, tidak basi, tidak juga berkurang dari sebelumnya, tetapi lihatlah keledaimu yang telah mati seratus tahun yang lalu, menyisakan tulang belulang. Dan kami lakukan ini semua agar kami jadikan engkau tanda kekuasaan kami bagi manusia yang hidup setelah negeri itu mereka bangun kembali. Untuk mengetahui bagaimana cara Allah menghidupkan kembali yang telah mati, lihatlah tulang belulang keledai itu, bagaimana kami menyusunnya kembali, kemudian kami membalutnya dengan daging, maka hidup dan bangkitlah keledai itu seperti sedia kala. Maka ketika telah nyata baginya bukti kekuasaan Allah dalam menghidupkan kembali objek yang telah mati, dia pun berkata, saya mengetahui berdasar pandangan mata dan pengalaman setelah sebelumnya saya tahu berdasar argumen logika, bahwa Allah mahakuasa atas segala sesuatu. Dan bukti lain dari kekuasaan Allah menghidupkan dan mematikan adalah ketika ibrahim berkata, ya tuhanku, perlihatkanlah kepadaku bagaimana engkau menghidupkan orang mati. Allah berfirman dengan balik bertanya, belum percayakah engkau' dia, nabi ibrahim, menjawab, tidak! aku percaya, tetapi aku minta diperlihatkan agar dengan hal itu keyakinanku bertambah sehingga hatiku semakin tenang dan mantap. Nabi ibrahim bukannya meragukan kekuasaan Allah menghidupkan dan mematikan; dia hanya ingin tahu prosesnya. Allah mengabulkan permintaan ibrahim. Dia berfirman, kalau begitu, ambillah empat ekor burung yang berbeda jenisnya; sembelihlah, lalu cincanglah olehmu, kemudian campurlah cincangannya dan letakkan di atas masingmasing bukit satu bagian, kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera. Cincangan-cincangan burung kembali menyatu, hidup seperti sediakala, dan terbang dengan cepat ke arah nabi ibrahim. Ketahuilah, Allah mahaperkasa, tidak ada yang dapat mengalahkan-Nya, mahabijaksana dalam segala ucapan, perbuatan, ajaran dan ketetapan-Nya."
  }
]