[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah Ta'ala tidak malu dari kebenaran dengan menyebutkan sesuatu baik sedikit maupun banyak, meskipun hanya menyebutkan perumpamaan dengan sesuatu yang sangat kecil, seperti seekor nyamuk atau lalat dan binatang serupa lainnya. Yang Allah jadikan perumpamaan akan lemahnya semua yang disembah selain Allah. Adapun orang-orang Mukmin mereka mengetahui hikmah Allah dalam membuat perumpamaan dengan sesuatu yang kecil maupun besar dari makhluk-Nya, sedangkan orang-orang kafir mereka mencemooh sembari berkata: “apa maksud Allah membuat perumpamaan dengan serangga-serangga yang hina ini?”. Maka Allah menjawab pengingkaran mereka, bahwa tujuannya adalah untuk menguji dan membedakan mana orang mukmin dan mana orang kafir, karena itu Allah memalingkan dengan perumpamaan tersebut banyak manusia dari kebenaran lantaran penghinaan mereka terhadap bentuk perumpamaan itu dan sebaliknya Allah memberikan Taufik bagi orang selain mereka untuk mendapatkan tambahan keimanan dan hidayah. Dan Allah tidak menzalimi siapapun, karena Dia tidaklah memalingkan dari kebenaran kecuali orang-orang yang sudah keluar dari ketaatan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sesungguhnya Allah -Subḥānahu wa Ta'ālā- tidak malu untuk membuat perumpamaan-perumpamaan yang dikehendaki-Nya. Maka Allah membuat perumpamaan berupa nyamuk, atau sesuatu yang lebih besar atau yang lebih kecil dari itu. Sedangkan manusia terbelah menjadi dua golongan dalam menyikapinya, yaitu golongan mukmin dan golongan kafir. Orang-orang mukmin percaya dan yakin bahwa di balik perumpamaan itu pasti ada hikmah tertentu. Sedangkan orang-orang kafir justru bertanya-tanya dengan nada sinis tentang alasan Allah membuat perumpamaan berupa makhluk-makhluk yang remeh-temeh, seperti nyamuk, lalat, laba-laba dan lain-lain. Kemudian jawaban datang dari Allah, \"Sesungguhnya dalam perumpamaan-perumpamaan itu terdapat petunjuk, bimbingan dan ujian bagi manusia. Maka ada orang-orang yang disesatkan Allah melalui perumpamaan-perumpamaan itu, karena mereka enggan merenungkannya. Dan golongan ini sangat banyak. Namun ada orang-orang yang Allah berikan petunjuk ke jalan yang benar, karena mereka mau mengambil pelajaran dari perumpamaan-perumpamaan tersebut. Dan jumlah mereka juga sangat banyak. Allah hanya menyesatkan orang-orang yang memang layak untuk tersesat, yaitu orang-orang yang keluar dari ketaatan kepada Allah, seperti orang-orang munafik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Allah tidak takut memperumpamakan sesuatu dengan sesuatu yang lain, meskipun itu adalah perumpamaan menggunakan suatu hal yang kecil seperti nyamuk dan yang lebih kecil dari itu. Dan segala perumpamaan yang dibuat Allah tidak akan mampu dibuat oleh segala yang disembah selain Allah. Orang-orang beriman akan membenarkan dan mengetahui hikmah Allah dari perumpamaan yang menggunakan sesuatu yang kecil atau hal lain dari makhluk-Nya. Namun orang-orang kafir akan mengingkari maksud Allah dari perumpamaan yang dibuat-Nya menggunakan makhluk-makhluk yang kecil tersebut. Maka Allah membantah mereka dan menyatakan bahwa yang Dia maksud adalah sebagai ujian, oleh sebab itu Allah menyesatkan banyak manusia dengan perumpamaan tersebut, dan memberi taufik sebagian manusia lainnya sehingga menambah keimanan dan hidayah mereka, dan Allah tidak akan menyesatkan manusia dari kesesatan kecuali orang-orang yang keluar dari ketaatan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. اِنَّ اللّٰهَ لَا يَسْتَحْيٖٓ اَنْ يَّضْرِبَ مَثَلًا مَّا (Sesungguhnya Allah tiada segan membuat perumpamaan) Allah Ta’ala menurunkan ayat ini sebagai jawaban bagi orang-orang kafir yang berkata: Allah Maha Tinggi dan Maha Agung untuk hanya membuat suatu perumpamaan. Dan juga berkata: disebutkan dalam al-Qur’an lebah, laba-laba, dan semut; dan ini tidak layak dalam perkataan orang-orang fasih. بَعُوْضَةً فَمَا فَوْقَهَا (berupa nyamuk atau yang lebih rendah dari itu) Yakni yang lebih kecil dari itu semisal sayap nyamuk. Dan sungguh berapa banyak makhluk hidup yang tak terlihat oleh mata telanjang dan hanya terlihat dengan alat pembesar; Maha suci Allah lagi Maha pencipta dan mengetahui. يُضِلُّ بِهٖ كَثِيْرًا وَّيَهْدِيْ بِهٖ كَثِيْرًا (Dengan perumpamaan itu banyak orang yang disesatkan Allah, dan dengan perumpamaan itu (pula) banyak orang yang diberi-Nya petunjuk) Dengan perumpamaan ini Allah menginginkan agar sebagian kaum tersesat dan sebagian yang lain mendapat hidayah. وَمَا يُضِلُّ بِهٖٓ اِلَّا الْفٰسِقِيْنَۙ (Dan tidak ada yang disesatkan Allah kecuali orang-orang yang fasik) Ini adalah bagian dari perkataan Allah Ta’ala. Dan makna dari kalimat ini adalah mereka berbuat kefasikan dengan merendahkan kalamullah maka Allah menyesatkan mereka akibat kefasikan yang mereka perbuat. Adapun makna fasik secara istilah syar’i adalah keluar dari ketaatan Allah Ta’ala; dan orang yang keluar dari ketaatan bisa jadi menjadi kafir atau menjadi ahli maksiat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Di dalam al-Qur'an terdapat sekitar 40 ungkapan amtsal (perumpamaan), dan Allah ta'ala dengan hikmah-Nya menjadikan perumpamaan-perumpamaan itu sebagai jalan hidayah beberapa kaum yang memahaminya, dan sebab atas kesesatan bagi kaum lainnya yang tidak memahami hikmah darinya, sebagaimana firman Allah mengatakan : { فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ ۖ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا ۘ يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا ۚ وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ } \"Adapun orang-orang yang beriman, maka mereka yakin bahwa perumpamaan itu benar dari Tuhan mereka, tetapi mereka yang kafir mengatakan: “Apakah maksud Allah menjadikan ini untuk perumpamaan?”. Dengan perumpamaan itu banyak orang yang disesatkan Allah, dan dengan perumpamaan itu (pula) banyak orang yang diberi-Nya petunjuk. Dan tidak ada yang disesatkan Allah kecuali orang-orang yang fasik\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Sesungguhnya Allah tidak malu membuat perumpamaan dengan nyamuk atau semacamnya baik kecil maupun besar sebagai nasihat dan pelajaran. Orang-orang mukmin mengetahui bahwa perumpamaan itu benar, tidak berubah, tidak batil dan datang dari Allah. Sedangkan orang-orang kafir, mereka mengolok-olok perumpamaan itu dan meremehkan faidahnya. Allah menghendaki perumpamaan itu untuk menyesatkan suatu kaum dan memberi hidayah bagi kaum lainnya. Akan tetapi kesesatan itu untuk orang-orang fasik, yaitu orang-orang tidak taat kepada Allah. Sesungguhnya mereka berbuat fasik, kemudian Allah menyesatkan mereka dengan kefasikan mereka sendiri. Ayat ini diturunkan sebagaimana disebutkan Ath-Thabari ketika orang-orang kafir menghujat tentang keberadaan Al-Qur’an sebagai kalam Allah dengan berkata: “Sesungguhnya Allah malu membuat perumpamaan dengan sesuatu yang hina seperti lalat, semut, lebah dan laba-laba dan hal itu tidak sesuai dengan ucapan orang-orang yang fasih”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah tidak segan membuat perumpamaan seekor nyamuk atau yang lebih kecil daripada itu. Adapun orang-orang yang beriman mengetahui bahwa itu merupakan kebenaran dari Tuhan mereka. Akan tetapi, orang-orang yang kafir akan berkata, “Apa yang dimaksud Allah dengan perumpamaan ini?” Dengan perumpamaan itu banyak yang disesatkanNya, dan dengan perumpamaan itu pula banyak yang diberi petunjuk olehNya. Namun, tidak ada yang Dia sesatkan dengan perumpamaan itu, selain orang-orang fasik} orang-orang yang menyimpang dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah ta’ala berfirman, “sesungguhnya Allah tiada segan membuat perumpamaan,” maksudnya perumpamaan apa pun itu, ”berupa nyamuk atau yang lebih rendah dari itu, ” karena perumpamaan meliputi kebijaksanaan dan penjelasan akan kebenaran, sedang Allah tidaklah segan mengungkapkan kebenaran. Dalam hal ini seakan-akan ada sebuah jawaban bagi orang yang mengingkari pemakaian perumpaan dalam hal-hal yang remeh dan memprotes Allah dalam hal tersebut, padahal dalam hal itu tidak ada yang patut diprotes, bahkan hal itu adalah suatu pengajaran Allah ta’ala kepada hamba-hambaNya serta kasih sayangNya kepada mereka, maka wajiblah diterima dengan terbuka dan penuh kesyukuran. Oleh karena itu Allah berfirman, “Adapun orang-orang yang beriman, maka mereka mengetahui (yakin) bahwa perumpamaan itu benar dari Tuhan mereka, ”mereka memahami dan memikirkannya, lalu apabila mereka mengetahui apa yang meliputi hal tersebut dalam perinciannya, niscaya bertambahlah ilmu dan keimanan mereka dengan hal itu, namun bila tidak, niscaya mereka mengetahui bahwasanya hal itu adalah suatu kebenaran dan apa pun yang dikandungnya adalah kebenaran, walaupun kandungan kebenarannya itu tidak dapat mereka mengerti, karena pengetahuan mereka bahwasanya Allah tidaklah membuat perumpamaan itu dengan sia-sia, akan tetapi sebuah hikmah yang tinggi dan nikmat yang dalam. “tetapi mereka yang kafir mengatakan, ’apa maksud Allah menjadikan ini untuk perumpamaan?’” yakni, mereka menyanggah dan bingung sehingga bertambahlah kekufuran kepada kekufuran yang telah ada pada mereka, sebagaimana bertambahnya keimanan bagi kaum Mukminin kepada keimana mereka. Oleh karena itulah Allah berfirman, “dengan perumpamaan itu banyak orang yang disesatkan Allah, dan dengan perumpamaan itu (pula) banyak orang yang diberiNya petunjuk.” Demikianlah kondisi kaum Mukminin dan kaum kafir ketika turunnya ayat-ayat al-Qur’an, Allah berfirman : \" Dan apabila diturunkan suatu surat, maka di antara mereka (orang-orang munafik) ada yang berkata: “Siapakah di antara kamu yang bertambah imannya dengan (turannya) surat ini?” Adapun orang-orang yang beriman, maka surat ini menambah imannya, dan mereka merasa gembira. Dan adapun orang-orang yang di dalam hati mereka ada penyakit, maka dengan surat itu bertambah kekafiran mereka, disamping kekafirannya (yang telah ada) dan mereka mati dalam keadaan kafir.\" (QS. At-Taubah : 124-125) Maka tidak ada kenikmatan yang lebih besar bagi hamba dari turunnya ayat-ayat al-Qur’an. Walaupun demikian, hal ini bagi suatu kaum menjadi ujian, kebingungan, kesesatan, dan bertambahnya keburukan kepada keburukan yang telah ada pada mereka, sedang bagi kaum yang lain menjadi ujian, rahmat, dan bertambahnya kebaikan yang telah ada pada mereka. Maka Mahasuci Dzat yang telah membeda-bedakan antara hamba-hambaNya dalam memberikan petunjuk dan kesesatan. Kemudian Allah menyebutkan hikmah dibalik penyesatan yang dilakukan olehNya kepada seseorang yang tersesat, seraya berfirman, “ dan tidak ada yang disesatkan Allah kecuali orang-orang yang fasik, ” yaitu orang-orang yang berpaling dari ketatan kepada Allah dan yang menentang Rosul-rosul Allah yang akhirnya kefasikan itu menjadi sifat paten mereka, dan mereka sendiri tidak ingin merubahnya, maka berjalanlah hikmah Allah bagi mereka dalam menyesatkan mereka, karena mereka tidaklah pantas mendapat petunjuk, sebagaimana berjalannya hikmah dan keutamaaNya dalam memberikan petunjuk kepada orang yang memiliki sifat keimanan dan menghiasi diri mereka dengan amalan-amalan shalih. Kefasikan itu ada dua macam: yang pertama adalah kefasikan yang mengeluarkan seseorang dari Islam yaitu kefasikan yang mengakibatkan keluar dari keimanan seperti yang disebutkan dalam ayat ini dan yang semacamnya, sedangkan yang kedua adalah kefasikan yang tidak mengeluarkan dari keimanan. Sebagaimana dalam Firman-Nya : \" Hai orang-orang yang beriman, jika datang kepadamu orang fasik membawa suatu berita, maka periksalah dengan teliti agar kamu tidak menimpakan suatu musibah kepada suatu kaum tanpa mengetahui keadaannya yang menyebabkan kamu menyesal atas perbuatanmu itu.\" (QS. Al-Hujurot :6)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : لَا يَسۡتَحۡيِ : Rasa malu tidak menghalangiNya untuk membuat permisalan walaupun dengan hal yang kecil seperti nyamuk, atau lebih kecil lagi dengan sayapnya. أَن يَضۡرِبَ مَثَلٗا : Untuk membuat sesuatu sebagai analogi bagi yang lain dalam menyingkap sifat dan keadaannya dalam keburukan ataupun kebaikan. مَّا بَعُوضَةٗ : Kata tanya Maa berbentuk nakiroh yang artinya sesuatu yang dijadikan contoh, atau hanya tambahan. Ba’uudhoh berposisi sebagai obyek kedua. Dan Al-Ba’uudhoh adalah bentuk plural dari Al-Ba’uudh yang berarti nyamuk kecil. ٱلۡحَقُّ : Yang pasti dan tetap dimana akal tidak akan mengingkari keberadaannya. ٱلۡفَٰسِقِينَ : Al-Fisqu artinya adalah keluar dari ketaatan, dan Al-Faasiquun : adalah orang-orang yang meninggalkan perintah Allah Ta’ala untuk beriman dan beramal sholeh serta menginggalkan kesyirikan dan maksiat. Makna ayat : Saat Allah Ta’ala memberikan dua analogi dengan api dan air maka orang-orang munafik berkata,”Allah lebih Tinggi dan lebih Mulia untuk memberikan analogi seperti ini.” Maka Allah menurunkan bantahanNya dalam firmanNya (إِنَّ ٱللَّهَ لَا يَسۡتَحۡيِۦٓ). Allah Ta’ala memberitakan bahwa rasa malu tidak menghalangiNya untk membuat permisalan walaupun hanya dengan seekor nyamuk atau yang lebih kecil lagi dibanding dengan sesuatu yang besar. Maka manusia terbagi menjadi dua golongan dengan analogi yang Allah berikan. Orang-orang mukmin mengetahui bahwa itu kebenaran dari Rabbnya. Sedangkan orang-orang kafir akan menolak dan berkata,”Apa yang diinginkan oleh Allah dengan permisalan ini? Allah ta’ala memberitahukan bahwa Dia membuat permisalan untuk memberi petunjuk bagi orang banyak dan menyesatkan banyak orang dengan permisalan itu. Pelajaran dari ayat : 1. Rasa malu tidak sepantasnya menjadi penghalang untuk berbuat kebaikan, mengatakan kebaikan, dan memerintahkan kepada kebaikan. 2. Merupakan metode yang baik jika menggunakan analogi (permisalan) untuk menjelaskan makna sesuatu untuk memudahkan pemahaman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 26: Allah mengabarkan bahwasanya kebenaran tidak akan pernah padam ; Allah memisalkan dengan sesuatu dari ciptaannya yang kecil maupun yang besar Seperti nyamuk, lalat, semut, dan selainnya . maka orang-orang yang beriman mengetahui hikmah Allah dalam permisalan ini , mereka membenarkan tanpa keraguan padanya ; sehingga bertambah keimanannya. Adapun orang-orang kafir menyombongkan diri dan menolak serta bimbang sembari berkata : apa yang Allah inginkan atas permisalan ini ? sehingga bertambah lah kekufuran mereka . Oleh sebab itu Allah menyesatkan mereka dengan ayat ayat yang ditegakkan pada mereka kemudian mereka mengingkari dan mencemoohnya sehingga Allah kunci hati-hati mereka , dan memberikan petunjuk kepada yang lain sehingga beriman dan beramal dengan apa yang terkandung di dalam ayat-ayat tersebut ; kemudian Allah menjelaskan bahwasanya tidaklah tersesat dengan ayat ini kecuali orang-orang yang fasik orang yang keluar dari ketaatan kepada Allah , dan mereka orang-orang yang menyombongkan diri kepada Allah dan dengan apa yang datang kepada utusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai perumpamaan terhadap lemahnya berhala-berhala yang mereka sembah selain Allah. Hal ini seperti yang disebutkan dalam surat Al Hajj ayat 73; di dalamnya Allah menerangkan bahwa berhala-berhala yang mereka sembah itu tidak dapat membuat lalat, Sekalipun mereka kerjakan bersama-sama, dan di surat Al Ankabuut ayat 41 yang di dalamnya Allah menggambarkan kelemahan berhala-berhala yang dijadikan oleh orang-orang musyrik itu sebagai pelindung seperti lemahnya sarang laba-laba. Nampaknya ayat di atas sebagai jawaban terhadap orang yang mengingkari perumpamaan yang dibuat Allah Ta'ala menggunakan makhluk-makhluk yang kecil seperti nyamuk, padahal bukan pada tempatnya membantah hal tersebut, ia merupakan pengajaran Allah kepada hamba-hamba-Nya sekaligus sebagai rahmat-Nya yang seharusnya diterima dan disyukuri. Bagi orang-orang yang beriman, ketika mereka mengetahui hikmahnya bertambahlah ilmu dan iman mereka, kalau pun samar hikmahnya bagi mereka, mereka mengetahui bahwa perumpamaan itu adalah hak (benar), isinya hak meskipun secara rincinya mereka tidak mengetahui, karena mereka yakin bahwa Allah tidaklah membuat perumpamaan main-main, bahkan karena ada hikmah yang dalam di balik itu. Mereka mengetahui hikmah Allah Ta'ala membuat perumpamaan dengan makhluk-Nya yang kecil maupun yang besar. Sambil membantah dan mengolok-olok. Mereka tidak bisa memahami perumpamaan itu. Perumpamaan yang dibuatkan oleh Allah Ta'ala itu merupakakan ujian untuk membedakan siapa yang mukmin dan siapa yang kafir. Oleh karena itu, dengan perumpamaan itu ada yang disesatkan Allah karena olok-olokkan yang mereka lakukan dan ada juga yang ditambahkan oleh-Nya iman dan hidayah dari-Nya. Disesatkan Allah berarti bahwa orang itu sesat karena keingkarannya dan tidak mau memahami petunjuk-petunjuk Allah. Allah tidaklah menzhalimi seorang pun, karena tidak ada yang dijauhkan dari yang hak kecuali karena perbuatannya yang keluar dari keta'atan kepada-Nya dan karena mereka tidak cocok memperoleh hidayah-Nya sesuai kebijaksanaan-Nya"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 26",
    "description": "Allah sering membuat perumpamaan untuk menjelaskan kebe-naran dan hakikat yang luhur, dengan bermacam makhluk hidup, baik kecil maupun besar. Orang-orang kafir mencibir ketika Allah mengambil perumpamaan berupa makhluk kecil yang dipandang remeh seperti lalat dan laba-laba. Di sini dijelaskan sesungguhnya Allah tidak merasa segan atau malu untuk membuat perumpamaan bagi sebu-ah kebenaran dengan seekor nyamuk atau kutu yang sangat kecil atau yang lebih kecil dari itu. Kendati kecil, belalainya dapat menembus kulit gajah, kerbau, dan unta, dan menggigitnya, serta menyebabkan kematian. Adapun orang-orang yang beriman, ketika mendengar perumpamaan itu mereka tahu maksud perumpamaan itu dan tahu bahwa perumpamaan itu adalah kebenaran dari tuhan yang tidak diragukan lagi. Tetapi sebaliknya, mereka yang kafir menyikapi itu dengan sikap ingkar dan berkata, apa maksud Allah dengan perumpamaan yang remeh ini' Allah menjawab bahwa perumpamaan itu dibuat untuk menguji siapa di antara mereka yang mukmin dan yang kafir. Oleh karenanya, dengan perumpamaan itu banyak orang yang dibiarkan-Nya sesat, karena mereka tidak mencari dan menginginkan kebenaran, dan dengan perumpamaan itu banyak pula orang yang diberi-Nya petunjuk karena mereka memang mencari dan menginginkannya. Tetapi Allah tidak akan menzalimi hamba-Nya, sehingga tidak ada yang dia sesatkan dengan perumpamaan itu selain orang-orang fasik, yang melanggar ketentuan-ketentuan agama, baik berupa ucapan maupun perbuatan. Orang-orang fasik itu adalah orang-orang yang melanggar perjanjian Allah setelah perjanjian itu diteguhkan, yaitu perjanjian dalam diri setiap manusia yang muncul secara fitrah dan didukung dengan akal dan petunjuk agama sebagaimana dijelaskan pada surah al-a 'ra'f/7: 172, dan memutuskan apa yang diperintahkan Allah untuk disambungkan, seperti menyambung persaudaran dan hubungan kekerabatan, berkasih sayang, dan saling mengenal sesama manusia, dan berbuat kerusakan di bumi dengan perilaku tidak terpuji, menyulut konflik, mengobarkan api peperangan, merusak lingkungan, dan lainnya. Mereka itulah orangorang yang rugi karena telah menodai kesucian fitrah dan memutus hubungan dengan orang lain. Dengan demikian, mereka akan mendapatkan kehinaan di dunia dan siksaan di akhirat."
  }
]