[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah olehmu (wahai Rasul), tentang permohonan Ibrahim kepada Tuhannya untuk memperlihatkan kepadanya bagaimana proses kebangkitan (makhluk setelah kematian). Maka Allah berfirman kepadanya, “Apakah kamu tidak mengimaninya?” Ibrahim menjawab, ”Aku mengimani, akan tetapi aku meminta hal tersebut supaya aku bertambah yakin atas keyakinan yang sudah ada padaku.“ Maka Dia berfirman, “ Ambillah empat ekor burung dan gabungkanlah jadi satu lalu sembelihlah burung-burung itu dan potong-potonglah. Kemudian taruhlah di atas tiap-tiap gunung satu bagian dari burung-burung itu, lalu panggillah mereka, niscaya mereka akan datang kepadamu dengan segera.” Lalu Ibrahim berteriak memanggil mereka. Tiba-tiba tiap-tiap bagian tubuh itu kembali ke posisinya dan burung-burung itu datang dengan segera. Dan ketahuilah bahwa sesungguhnya Allah Maha Perkasa, tidak ada suatu perkara pun yang melemahkanNya, lagi Maha Bijaksana dalam firman-firman, perbuatan-perbuatan, ajaran syariat, dan ketetapan takdirNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "260. Dan ingatlah -wahai Nabi- tatkala Ibrahim -'alaihissalām- berkata, “Ya Rabbku! Perlihatkanlah dengan mata kepalaku bagaimana menghidupkan yang mati?” Allah berfirman kepadanya, “Apakah engkau tidak percaya?” Ibrahim menjawab, “Tentu saja aku percaya, tetapi untuk menambah ketenteraman hatiku.” Kemudian Allah memerintahkan kepadanya dan berfirman, “Ambillah empat ekor burung. Campurlah burung-burung itu dan potong-potonglah tubuhnya. Kemudian letakkan satu bagian dari potongan-potongan itu di masing-masing gunung yang ada di sekitarmu. Lalu panggillah burung-burung itu, niscaya burung-burung itu akan datang kepadamu dengan cepat dan mereka telah dihidupkan kembali. Dan ketahuilah, wahai Ibrahim, bahwasanya Allah Maha Perkasa di dalam kerajaan-Nya, lagi Maha Bijaksana di dalam menetapkan perintah dan syariat-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "260. Hai Rasulullah, Ingatlah ketika Ibrahim meminta kepada Tuhannya untuk dapat melihat bagaimana proses kebangkitan setelah mati. Maka Allah menjawabnya: “Tidakkah kamu telah mengimaninya?” Ibrahim menjawab: “Tentu, namun aku meminta hal ini agar keyakinanku bertambah dengan keimanan yang dibarengi dengan kesaksian. Allah berfirman: “Kalau begitu ambillah empat ekor burung kemudian sembelih dan potong-potonglah setiap bagian tubuhnya. Setelah itu letakkan setiap bagian tubuhnya di bukit-bukit. Lalu panggillah burung-burung itu, niscaya akan mendatangimu dengan segera dalam keadaan hidup.” Maka Ibrahim memanggil burung-burung itu, ternyata setiap bagian tubuh kembali bersatu ke tempatnya masing-masing, kemudian mendatangi Ibrahim dengan segera. Ketahuilah Allah Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam pengaturan-Nya. Abu Hurairah berkata, Rasulullah bersabda: “Kita lebih layak untuk ragu daripada Ibrahim ketika ia berkata: “\"Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang-orang mati\". Allah berfirman: \"Belum yakinkah kamu?\" Ibrahim menjawab: \"Aku telah meyakinkannya, akan tetapi agar hatiku tetap mantap (dengan imanku)…(al-Baqarah: 260). Hadits ini menunjukkan bahwa Ibrahim meminta itu bukan karena ia ragu, namun ia hendak memantapkan dan menenangkan hatinya. (shahih Bukhari, kitab tafsir, surat al-Baqarah, bab {وإذ قال إبراهيم} 8/49 no. 3537)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "260. أَرِنِى (perlihatkanlah kepadaku) Yang dia inginkan bukan penglihatan hati namun penglihatan kasat mata agar dia mendapatkan kemantapan hati. أَوَلَمْ تُؤْمِن ۖ (“Belum yakinkah kamu?” ) Yakni bahwa Aku berkuasa untuk menghidupkan sehingga kamu meminta-Ku agar kamu bisa melihatnya. قَالَ بَلَىٰ (Ibrahim menjawab: “Aku telah meyakinkannya ) Yakni aku telah yakin dan beriman bahwa Engkau berkuasa atas itu. وَلٰكِن (akan tetapi ) Yakni akan tetapi aku meminta-Mu. لِّيَطْمَئِنَّ قَلْبِى ۖ (agar hatiku tetap mantap (dengan imanku)) Yakni dengan berkumpulnya bukti secara kasat mata dengan bukti-bukti secara iman. Dan bukan merupakan keraguan sama sekali akan pembangkitan orang yang telah mati, akan tetapi ini merupakan permintaan atas panggilan jiwa yang bersumber dari keinginan untuk mendapatkan kemantapan hati dengan melihat langsung apa yang dikabarkan kepada jiwa ini. Maka dari itu Rasulullah bersabda: (ليس الخبر كالمعاينة) “tidaklah mendengar kabar itu layaknya melihat langsung”. فَخُذْ أَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ (“(Kalau demikian) ambillah empat ekor burung, lalu cincanglah semuanya olehmu ) Yakni kumpulkanlah burung-burung itu kemudian cincanglah semuanya. ثُمَّ اجْعَلْ عَلَىٰ كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا (Lalu letakkan diatas tiap-tiap satu bukit satu bagian dari bagian-bagian itu ) Yakni kemudian taruhlah pada setiap bukit satu bagian dari setiap bagian burung-burung tersebut. ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا ۚ (kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera ) Yakni terbang dengan bergegas. Dari Ibnu Abbas ia berkata: Ibrahim meletakkannya di atas tujuh bukit dan memegang kepala burung-burung tersebut ditangannya sambil melihat setiap tetes darah berkumpul dengan tetes lainnya, dan bulu berkumpul dengan bulu lainnya hingga akhirnya menjadi hidup kembali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman tentang kisah burung-burung bersama Nabi Ibrahim : { ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا } \"kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera\" hikmah dari penjelasan ayat ini bahwasanya burung itu datang dengan segera tanpa mengatakan dengan terbang, yaitu agar konteksnya jauh dari penyerupaan; karena jika burung-burung itu datang dengan terbang maka orang-orang akan membayangkan bahwa burung yang terbang itu bukanlah burung yang dipotong itu dan kaki-kaki nya tidak sampai dengan selamat. wallahu a'lam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "260. Ingatlah wahai nabi, ketika Ibrahim Khalilullah berkata: “Wahai Tuhanku perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang mati dengan penglihatan mata, bukan penglihatan hati, supaya hatiku menjadi tenang” Allah SWT berfirman kepadanya: “Apakah kamu tidak mempercayai kuasaKu untuk menghidupkan (orang mati) sampai kamu bisa melihatnya?” Ibrahim berkata: “Tentu saja aku mengetahui dan mempercayai kuasaMu wahai Tuhan, namun aku meminta hal itu supaya keyakinanku bertambah dengan menghimpun pengamatan-pengamatan terkait dalil tersebut agar lebih beriman lagi” Lalu Allah berfirman: “Maka ambillah burung, lalu kumpulkan dan potong-potonglah. Kemudian letakkanlah masing-masing bagian potongan itu di setiap gunung (yang berbeda), lalu panggillah mereka, niscaya burung-burung itu akan datang menghampirimu dalam wujud burung yang utuh. Ketahuilah Ibrahim sesungguhnya Allah itu Maha Kuat lagi maha Menaklukkan yang mana tidak ada apapun yang bisa menaklukkanNya, dan maha Bijaksana dalam tindakan dan aturanNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Ibrahim berkata,“Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang-orang mati.” Allah berfirman, “Apakah kamu masih belum percaya” Ibrahim menjawab, “Tentu saja aku percaya, tetapi agar hatiku tenang”} Tentu saja aku sudah percaya tetapi aku memohon kepadaMu agar hatiku tenang {Allah berfirman, “Maka ambillah empat ekor burung, lalu dekatkanlah kepadamu} dekatkanlah burung-burung itu kepadamu dan potong-potonglah. {Kemudian, letakkanlah di atas setiap bukit satu bagian dari tiap-tiap burung. Lalu panggillah mereka, niscaya mereka datang kepadamu dengan segera.” Ketahuilah bahwa Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "260. Sedangkan bukti nyata yang lain, adalah bahwa Nabi Ibrahim berkata seraya memohon kepada Allah agar memperlihatkan untuknya bagaimana Allah menghidupkan yang sudah mati. Maka Allah berfirman kepadanya, “Belum yakinkah kamu?” untuk menghilangkan syubhat dari kekasihnya Nabi Ibrahim. Dia berkata, yakni Ibrahim “Tentu aku telah meyakininya,” wahai Rabb, sungguh saya telah beriman bahwa engkau kuasa atas segala sesuatu, dan engkau menghidupkan yang telah mati dan engkau membalas semua amal hamba-hamba. Akan tetapi saya ingin agar hatiku tenang dan agar saya sampai kepada derajat keyakinan yang sebenar-benarnya. Maka Allah menjawab permintaanya sebagai pemuliaan baginya dan rahmat bagi hamba-hambaNya, ”(kalau demikian) ambilah empat ekor burung,”dan tidak di jelaskan burung apakah itu. Ayat ini bisa terjadi dengan jenis burung apa pun dan itulah yang di kehendaki, \"lalu cincanglah semuanya olehmu” artinya, kumpulkanlah dan sembelih mereka dan cingcanglah mereka. ”lalu letakan di setiap satu bukit satu bagian dari bagian-bagian itu, kemudian panggilah mereka, niscaya mereka datang kepadamu dengan segera.” Dan ketahuilah bahwa AllahMaha Perkasa lagi Maha Bijaksana.” Maka nabi Ibrahim melakukan itu, dan beliau memisah-misahkan bagian-bagiannya itu pada beberapa gunung yang ada di sekitarnya lalu beliau memanggil mereka dengan nama-nama mereka dan akhirnya mereka kembali kepadanya dengan sangat cepat. Karena kata syab’an berarti cepat, dan bukanlah yang di maksudkan burung-burng itu datang dengan berjalan dengan kaki mereka, akan tetapi mereka datang dengan terbang dalam kondisi hidup yang paling sempurna. Allah menghkususkan burung dalam hal itu karena menghidupkan mereka lebih mantap dan lebih jelas dari selain mereka. Demikian juga dalam hal ini Allah menghilangkan semua dugaan yang bathil yang terbesit dalam hati orang yang membantah. Maka menjadikan mereka empat ekor, mencingcang mereka, dan meletakan sebagian bagian itu di atas gunung-gunung, agar hal itu tampak nyata dan lebih jelas dan dapat di saksikan dari dekat maupun jauh, dan menjauhkan potongan-potongan dengan jarak yang banyak agar tidak di kira hal itu adalah sebuah tindakan tipu daya, Dan Allah memerintahkanya agar dia memanggil mereka hingga mereka datang dengan segera. Maka ayat ini menjadi bukti-bukti yang paling besar terhadap kesempurnaan Allah dan hikmahNya. Dalam ayat ini terdapat peringatan bahwa hal itu ,menujukan keperkasaan Allah, hikmahNya, keagunganNya, luasnya kekuasaaNya, kesempurnaan keadilan dan karuniaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { إِبۡرَٰهِ‍ۧمُ } Ibrâhîm: Dia adalah kekasih Allah (khalîlurrahmân) dan bapak para nabi ‘alaihissalam. { لِّيَطۡمَئِنَّ قَلۡبِي } Yathmainna qalbiy: Membuat hatiku tenang karena keingintahuan tentang bagaimana caranya. { فَصُرۡهُنَّ إِلَيۡكَ } Fashurhunna ilaika: Dekatkanlah burung itu padamu dan potong-potonglah menjadi beberapa bagian. { سَعۡيٗاۚ } Sa’ya: Berjalan dengan cepat dan terbang { عَزِيزٌ } ‘âzîz: Maha perkasa, tidak ada yang mampu menghalangi dan mencegah apa yang dikehendakiNya. { حَكِيمٞ } ẖakîm: Tidak menciptakan sesuatu yang tidak bermanfaat dan tidaklah mengadakan sesuati kecuali memiliki hikmah, serta menempatkan sesuatu sesuai dengan tempatnya yang pantas. Makna ayat: Ini merupakan contoh ketiga yang ditunjukkan kepada rasul dan orang-orang mukmin sehingga menjadi jelas bagi mereka perlindungan Allah bagi hamba-hambaNya yang mukmin, dengan mengeluarkan mereka dari kegelapan menuju cahaya yang terang benderang. Sampai-sampai hilanglah setitik kegelapan yang mengesankan hal itu di luar kekuasaan Allah Ta’ala, atau keingintahuan tentang bagaimana cara Allah menciptakan sesuatu dan gambarannya. Allah Ta’ala berfirman: “Dan ingatlah ketika Ibrahim berkata, “Ya Tuhanku, perlihatkanlah padaku bagaimana Engkau menghidupkan kembali orang mati.” Ibrahim memohon kepada Allah untuk memperlihatkan kepadanya cara menghidupkan orang mati, apakah melalui hukum-hukum tertentu atau dengan kekuasaan saja dengan sekadar mengatakan “jadilah” maka terjadilah. Maka Allah Ta’ala bertanya kepadanya sedang Dia mengetahuinya, “Bagaimana kamu berkata seperti itu, apakah kamu tidak percaya?” Ibrahim menjawab,”Tentu saja aku beriman bahwa Engkau maha mampu atas segala sesuatu, akan tetapi aku ingin melihat secara langsung sehingga hatiku menjadi tenang dan tidak penasaran untuk mengetahui sesuatu yang tidak diketahui. Sebagai bentuk jawaban kepadanya karena Dialah penolongnya dan tidak akan membiarkan Ibrahim dalam keingintahuannya tentang bagaimana Allah Ta’a’la menghidupkan orang mati, maka Allah Ta’ala memerintahkannya untuk mencari empat ekor burung dan menyembelihnya. Kemudian burung-burung itu dipotong menjadi beberapa bagian dan dicampurlah antara potongan burung yang satu dengan yang lainnya. Lantas potongan-potongan yang sudah bercampur itu dibagi menjadi empat dan diletakkan pada setiap gunung satu bagian, dan Ibrahim melakukannya. Kemudian ia mengambil kepala burung masing-masing dan mulai memanggilnya. Maka bagian-bagian yang sudah bercampur itu datang dan menyatu sesuai dengan kepalanya masing-masing, kemudian burung-burung itu terbang di angkasa. Ibrahim ‘alaihissalam melihat bagaimana kekuasaan Tuhannya yang Maha Perkasa lagi Maha Bijaksana. Maha suci Allah yang tidak ada sesembahan selainNya. Pelajaran dari ayat: • Naluri manusia adalah senang untuk mencari tahu apa yang belum diketahuinya. • Pertolongan Allah Ta’ala kepada Ibrahim dengan memperlihatkan kepadanya tanda-tanda kekuasaanNya sehingga hatinya menjadi tenang dan jiwanya menjadi yakin. • Tetapnya akidah tentang kehidupan kedua dimana Allah akan menghidupkan seluruh makhluk untuk menjalani perhitungan (hisab) dan pembalasan. • Pertambahan iman dan keyakinan apabila seorang hamba melihat kepada tanda-tanda kekuasaan Allah di alam semesta, atau membaca dan mentadabburi ayat-ayat Allah dalam Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 260: Dalam ayat ini tedapat dalil hissiy (inderawi) yang menunjukkan Allah mampu menghidupkan orang yang telah mati dan memberikan balasan. Di ayat ini, Allah Subhaanahu wa Ta'aala menceritakan tentang kekasih-Nya, yaitu Nabi Ibrahim 'alaihis salam bahwa dia pernah meminta kepada Allah agar diperlihatkan secara langsung bagaimana Allah menghidupkan orang-orang yang telah mati. Hal itu, karena dia sudah yakin dengan apa yang diberitakan Allah Subhaanahu wa Ta'aala, akan tetapi ia ingin menyaksikan langsung dengan mata kepala agar memperoleh tingkatan 'ainul yakin (melihat langsung yang tidak mungkin lagi dihinggapi keraguan). Yakni \"Apakah kamu belum percaya bahwa Aku dapat menghidupkan yang mati\". Meskipun Allah Subhaanahu wa Ta'aala mengetahui keimanan yang dalam yang ada pada diri Nabi Ibrahim 'alaihis salam. Yakni agar bertambah keyakinannya. Disebutkan bahwa Nabi Ibrahim 'alaihis salam hanya memegang potongan kepalanya, lalu Ibrahim memanggil burung-burung yang telah terpotong-potong itu, sehingga bagian-bagian itu berterbangan menyatu dengan bagiannya yang lain sehingga sempurna, kemudian terbang menuju kepalanya yang ada di sisi Nabi Ibrahim 'alaihis salam. Yakni bukit yang dekat dengan Nabi Ibrahim 'alaihis salam. Dia memiliki kekuatan yang besar untuk menundukkan semua makhluk, dan tidak ada satu pun yang dapat mengalahkan-Nya. Namun demikian, tindakan-Nya di atas kebijaksanaan. Baik dalam perkataan-Nya, perbuatan-Nya, syari'at yang dibuat-Nya maupun taqdir-Nya. Oleh karena itu, Dia tidaklah bertindak main-main atau kosong dari hikmah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 260",
    "description": "Dan bukti lain dari kekuasaan Allah menghidupkan dan mematikan adalah ketika ibrahim berkata, ya tuhanku, perlihatkanlah kepadaku bagaimana engkau menghidupkan orang mati. Allah berfirman dengan balik bertanya, belum percayakah engkau' dia, nabi ibrahim, menjawab, tidak! aku percaya, tetapi aku minta diperlihatkan agar dengan hal itu keyakinanku bertambah sehingga hatiku semakin tenang dan mantap. Nabi ibrahim bukannya meragukan kekuasaan Allah menghidupkan dan mematikan; dia hanya ingin tahu prosesnya. Allah mengabulkan permintaan ibrahim. Dia berfirman, kalau begitu, ambillah empat ekor burung yang berbeda jenisnya; sembelihlah, lalu cincanglah olehmu, kemudian campurlah cincangannya dan letakkan di atas masingmasing bukit satu bagian, kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera. Cincangan-cincangan burung kembali menyatu, hidup seperti sediakala, dan terbang dengan cepat ke arah nabi ibrahim. Ketahuilah, Allah mahaperkasa, tidak ada yang dapat mengalahkan-Nya, mahabijaksana dalam segala ucapan, perbuatan, ajaran dan ketetapan-Nya. Setelah menjelaskan kekuasaan-Nya menghidupkan makhluk yang telah mati, Allah beralih menjelaskan permisalan terkait balasan yang berlipat ganda bagi orang yang berinfak di jalan Allah. Perumpamaan keadaan yang sangat mengagumkan dari orang yang menginfakkan hartanya di jalan Allah dengan tulus untuk ketaatan dan kebaikan, seperti keadaan seorang petani yang menabur benih. Sebutir biji yang ditanam di tanah yang subur menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji sehingga jumlah keseluruhannya menjadi tujuh ratus. Bahkan Allah terus melipatgandakan pahala kebaikan sampai tujuh ratus kali lipat atau lebih bagi siapa yang dia kehendaki sesuai tingkat keimanan dan keikhlasan hati yang berinfak. Dan jangan menduga Allah tidak mampu memberi sebanyak mungkin, sebab Allah mahaluas karunia-Nya. Dan jangan menduga dia tidak tahu siapa yang berinfak di jalan-Nya dengan tulus, sebab dia maha mengetahui siapa yang berhak menerima karunia tersebut, dan maha mengetahui atas segala niat hamba-Nya."
  }
]