[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara hal yang paling bermanfaat bagi kaum mukminin adalah infak di jalan Allah. Dan perumpamaan kaum mukminin yang menginfakkan harta mereka di jalan Allah, adalah seperti satu benih yang ditanam di tanah yang subur. Maka tak berapa lama, benih itu telah menumbuhkan batang yang bercabang tujuh. Dan pada tiap cabang terdapat satu tangkai. Dan pada tiap tangkai terdapat seratus biji. Allah menggandakan pahala bagi siapa saja yang dikehendakiNya, sesuai dengan keadaan hati orang yang berinfak berupa keimanan dan keikhlasan yang sempurna. Dan karunia Allah itu luas. Dan Dia Maha Mengetahui siapa-siapa yang berhak memperolehnya, juga Maha Mengetahui niat-niat hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "261. Perumpamaan pahala orang-orang mukmin yang menginfakkan harta mereka di jalan Allah ialah seperti sebuah biji yang ditanam oleh seorang petani di tanah yang subur kemudian tumbuh menjadi tujuh bulir. Dalam tiap-tiap bulirnya terdapat seratus biji. Dan Allah melipatgandakan pahala tersebut bagi para hamba yang kehendaki-Nya, sehingga Allah memberi mereka pahala yang tak terhingga. Dan Allah Mahaluas kemurahan dan pemberian-Nya, lagi Maha Mengetahui siapa yang berhak dilipatgandakan pahalanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "261. Allah memberi dorongan untuk berinfak di jalan Allah, dengan mengumpamakan orang-orang yang menginfakkan hartanya di jalan Allah seperti petani yang menanam biji, biji ini menumbuhkan tujuh tangkai, setiap tangkai mengeluarkan seratus biji. Allah melipatgandakan pemberian seseorang yang Dia kehendaki. Dia Maha Luas karunia-Nya, Maha Mengetahui perkataan dan perbuatan hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "261. فِى سَبِيلِ اللهِ (di jalan Allah ) Yakni dalam jihad untuk meninggikan kalimat Allah. كَمَثَلِ حَبَّةٍ( serupa dengan sebutir benih) Yakni seumpama seorang petani biji-bijian. Dan yang dimaksud dengan tujuh tangkai adalah tangkai yang keluar dari satu batang lalu bercabang menjadi tujuh cabang dan disetiap cabang terdapat tujuh tangkai. وَاللهُ يُضٰعِفُ لِمَن يَشَآءُ ۗ (Allah melipat gandakan (ganjaran) bagi siapa yang Dia kehendaki ) Yakni melipat gandakan yang tujuh ratus itu dengan kelipatan yang banyak bagi yang menjaga adab-adab dari apa yang diisyaratkan oleh ayat-ayat setelah ini dan yang menginfakkan harta untuk meninggikan kalimat Allah. Dan al-Qur’an telah menyebutkan bahwa kebaikan dilipat gandakan dengan sepuluh kali lipatnya. Dan ayat ini menunjukkan bahwa berinfak untuk kepentingan berjihad kebaikannya adalah tujuh ratus kali, sehingga menjadi sepuluh kali lipat dari yang lainnya. Imam Ahmad meriwayatkan dari Iyadh bin Ghatif ia berkata: kami masuk kepada Abu Ubaidah untuk menjenguknya yang mengeluh sakit pinggang yang menyerangnya, sedang istrinya berada di sisi kepalanya. Kami bertanya: bagaimana Abu Ubaidah melewati malam. Istrinya menjawab: demi Allah dia telah melewati malam dengan mendapat pahala. Lalu Abu Ubaidah menjawab: aku tidak melewati malam dengan mendapat pahala, dan dia waktu itu menghadap ke tembok kemudian dia pun menghadap ke orang-orang sambil berkata: tidakkah kalian bertanya apa yang aku katakan tadi? Aku telah mendengar Rasulullah bersabda: “barang siapa yang berinfak di jalan Allah maka akan digandakan menjadi tujuh ratus kali, dan barangsiapa yang berinfak untuk dirinya, atau menjenguk orang sakit, atau menjauhkan sesuatu yang menghalangi jalan maka kebaikannya digandakan sepuluh kali; dan puasa adalah perisai selama dia tidak melubanginya, dan barangsiapa yang diuji Allah dengan ujian pada badannya maka baginya ampunan dari dosa”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikanlah perumpamaan ini; bumi jika kamu memberikan kepada sebutir biji, niscaya ia akan memberimu tujuh ratus biji lebih banyak, ini pemberian makhluq, maka bagiamana dengan pemberian sang pencipta ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "261. Gambaran orang-orang yang menafkahkan hartanya di jalan Allah untuk berjihad dan hal lainnya dengan maksud untuk mencari ridhaNya itu seperti orang yang menanam satu biji yang menumbuhkan 7 tangkai yang berasal dari satu batang tumbuhan, lalu masing-masing tangkai itu memiliki 100 biji lainnya. Allah melipatgandakan pemberianNya terhadap hamba-hambaNya yang dikehendaki. Dan Allah itu sangat banyak karunia dan pemberianNya, lagi Maha Mengetahui keadaan orang-orang yang berinfak, yaitu niat dan takaran infaknya. Ayat ini turun untuk Utsman bin Affan dan Abdurrahman bin Auf yang mana orang pertama (Utsman) memberi perbekalan terhadap prajurit perang Tabuk. Dan orang kedua (Abdurrahman) menyedekahkan 4000 dirham dan menyisakan 4000 dirham untuk keluarganya. Lalu nabi berdoa: “Wahai Tuhanku, Sesungguhnya Utsman bin Affan itu aku ridhai, maka ridhailah dia” Lalu beliau berkata kepada Abdurrahman: “Semoga Allah memberkahi harta yang kamu pegang dan yang kamu berikan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan orang-orang yang menginfakkan hartanya di jalan Allah itu seperti sebutir biji} perumpamaan infak mereka dari segala bentuk infak yang diperintahkan oleh Allah itu seperti menabur biji {yang menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji. Allah melipatgandakan (pahala) bagi siapa saja yang Dia kehendaki. Allah Maha luas lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "261.Ini merupakan anjuran yang agung dari Allah terhadap hamba-hambaNya untuk menafkahkan harta mereka di jalanya; yaitu jalan yang menyampaikan kepadaNya. Termasuk dalam hal ini adalah menafkahkan hartanya dalam meningkatkan ilmu yang bermanfaat, dalam mempersiapkan jihad di jalaNya, dalam mempersiapkan para tentara maupun membekali mereka, dan dalam segala macam kegiatan-kegiatan social yang berguna bagi kaum Muslimin. Kemudian di susul berinfak kepada orang-orang yang membutuhkan, fakir miskin, dan kemungkinan saja dua cara itu dapat di satukan hingga menjadi nafkah untuk menolong orang-orang membutuhkan dan sekaligus bakti social dan ketaatan. Nafkah-nafkah seperti ini akan di lipatgandakan dengan lipatan tujuh ratus kali lipat hingga berlipat ganda banyaknya lagi dari itu. Karena itu Allah berfirman,”Allah melipat gandakan (ganjaran) bagi siapa yang dia Kehendaki,” itu tentunya sesuai apa yang ada dalam hati orang berinfak tersebut dari keimanan dan keikhlasan yang tulus, dan juga sesuai dengan kebaikan dan manfaat yang di hasilkan dari infaknya tersebut, karena beberapa jalan kebajikan dengan berinfak padanya akan mengakibatkan mafaat-manfaat yang terus mrnerus dan kemaslahatan yang macam-macam, maka balasan itu sesuai dengan perbuatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مَّثَلُ ٱلَّذِينَ يُنفِقُونَ } Matsalulladzîna yunfiqûna: Perumpamaan orang yang menginfaqkan, sifat baik yang menakjubkan. { سَبِيلِ ٱللَّهِ } Sabîlillâh: Setiap hal yang mengantarkan kepada keridhoan Allah Ta’ala berupa keimanan dan amal shaleh. { يُضَٰعِفُ } Yudhâ’afu: Bertambah banyak sampai berkali-kali lipat. Makna ayat: Makna ayat: Allah Ta’ala memberitahukan dan memotivasi untuk berjihad dengan harta benda sebelum berjihad dengan jiwa, karena mempersiapkan peralatan dibutuhkan pertama kali, kemudian baru kebutuhan orang yang kedua. Sesungguhnya permisalan harta yang disedekahkan oleh seorang mukmin di jalan Allah di sini maksudnya adalah jihad bagaikan biji yang tumbuh, bertambah banyak dan berlipat ganda. Biji gandum atau padi yang ditanam di tanah yang subur akan menumbuhkan tujuh bulir, dan setiap bulirnya terdapat seratus biji, sehingga dari tujuh bulir itu terdapat tujuh ratus biji yang berasal dari satu buah biji. Begitu juga satu dirham yang disedekahkan seorang mukmin di jalan Allah akan dilipatkgandakan menjadi tujuh ratus kali lipat, dan bisa dilipatgandakan menjadi lebih banyak lagi, sebagaimana firman Allah Ta’ala: “Dan Allah melipatgandakan bagi siapa yang Dia kehendaki dan Allah Maha luas karuniaNya lagi Maha mengetahui.”Inilah kandungan ayat (261) Pelajaran dari ayat: • Keutamaan berinfak untuk jihad dan hal itu merupakan sebaik-baik infak. • Keutamaan bersedekah dan kesudahannya yang indah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 261: Berinfak di jalan Allah meliputi infak untuk kepentingan jihad, pembangunan masjid, sekolah, rumah sakit dan lain-lain. Yang ditanam di tanah yang subur. Tergantung niat yang ada dalam hati orang yang berinfak. Demikian juga tegantung keadaan harta yang diinfakkan tersebut, kehalalannya, manfaatnya dan di mana diletakkan harta itu. Bahkan Allah bisa melipatgandakan lebih dari yang disebutkan, sehingga Dia akan memberikan pahala tanpa tanggung-tanggung. Apa yang ada di sisi-Nya tidaklah berkurang karena banyak diminta. Oleh karena itu, orang yang berinfak janganlah mengira bahwa pelipatgandaan tesebut merupakan bentuk berlebih-lebihan, karena tidak ada satu pun yang berat bagi Allah Subhaanahu wa Ta'aala dan apa yang ada di sisi-Nya tidaklah berkurang karena sering memberi. Dia mengetahui siapa yang berhak mendapatkan balasan berlipatganda tersebut dan mengetahui niat hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 261",
    "description": "Setelah menjelaskan kekuasaan-Nya menghidupkan makhluk yang telah mati, Allah beralih menjelaskan permisalan terkait balasan yang berlipat ganda bagi orang yang berinfak di jalan Allah. Perumpamaan keadaan yang sangat mengagumkan dari orang yang menginfakkan hartanya di jalan Allah dengan tulus untuk ketaatan dan kebaikan, seperti keadaan seorang petani yang menabur benih. Sebutir biji yang ditanam di tanah yang subur menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji sehingga jumlah keseluruhannya menjadi tujuh ratus. Bahkan Allah terus melipatgandakan pahala kebaikan sampai tujuh ratus kali lipat atau lebih bagi siapa yang dia kehendaki sesuai tingkat keimanan dan keikhlasan hati yang berinfak. Dan jangan menduga Allah tidak mampu memberi sebanyak mungkin, sebab Allah mahaluas karunia-Nya. Dan jangan menduga dia tidak tahu siapa yang berinfak di jalan-Nya dengan tulus, sebab dia maha mengetahui siapa yang berhak menerima karunia tersebut, dan maha mengetahui atas segala niat hamba-Nya. Pada ayat berikut Allah menerangkan cara berinfak yang direstui Allah dan berhak mendapat pahala yang berlipat ganda. Orang yang menginfakkan hartanya di jalan Allah dalam bentuk aneka kebaikan, kemudian tidak mengiringi apa yang dia infakkan itu dengan menyebut-nyebutnya di hadapan orang yang diberi, tidak pula membanggakannya, dan tidak menyakiti perasaan penerima dengan menyebut-nyebutnya di hadapan orang lain, mereka memperoleh pahala berlipat di sisi tuhan mereka, seperti dijelaskan pada ayat terdahulu. Selain menerima ganjaran, tidak ada pula rasa takut pada diri mereka. Mereka tidak merisaukan apa yang akan terjadi di masa depan, seperti hilang dan berkurangnya harta di dunia, dan pahala serta siksa di akhirat, dan mereka tidak pula bersedih hati, yaitu keresahan akibat apa yang terjadi dan luput di masa lalu. Tidak jarang seseorang yang bersedekah atau akan bersedekah mendapat bisikan dari dalam diri atau dari orang lain agar tidak bersedekah atau tidak terlalu banyak demi mengamankan harta yang akan menjadi jaminan bagi diri dan keluarganya di masa depan. Buanglah jauh-jauh pikiran dan perasaan semacam itu."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ini merupakan perumpaan yang diberikan Allah ta’ala mengenai pelipatgandaan pahala bagi orang-orang yang menafkahkan harta kekayaan mereka di jalan Allah ta’ala dengan tujuan mencari keridoan-Nya. Dan bahwasanya kebaikan itu dilipatgandakan mulai dari sepuluh sampai tujuh ratus kali lipat. Allah berfirman : مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ “Perumpamaan (nafkah yang dikeluarkan oleh) orang-orang yang menafkahkan hartanya di jalan Allah” yaitu dalam rangka menaati Allah ta’ala. Sedangkan Makhuk mengatakan “yang dimaksud adalah menginfakkan harta untuk jihad, berupa tali kuda, persiapan persenjataan, dan yang lainnya”. Syabib bin Basyir meriwayatkan dari ikrimah, dari Ibnu abbas; “dirham yang dipergunakan untuk jihad dan ibadah haji akan dilipatgandakan sampai 700 kali lipat”. Oleh karena itu Allah berfirman : كمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِئَةُ حَبَّةٍ \"Serupa dengan sebutir benih yang menumbuhkan tujuh bulir, pada tiap-tiap bulir seratus biji\" Perumpaan ini lebih menyentuh jiwa daripada menyebut bilangan langsung 700 kali lipat, karena perumpamaan tersebut mengandung isyarat bahwa pahala amal sholih itu dikembangkan oleh Allah ta’ala bagi para pelakunya, sebagaimana tumbuhan-tumbuhan, tumbuh subur bagi orang yang enanamnya di tanah yang subur. Dan dalam hadits juga telah disebutkan pelipatgandaan kebaikan sampai 700 kali lipat. Imam Ahmad meriwayatkan sebuah hadits dari Ibnu Mas’ud, bahwasanya ada seorang laki-laki yang menginfakkan seekor untuk yang hidungnya telah diberi tali di jalan Allah. Lalu Rosululloh sholallohu ‘alaihi wasallam : لتأتين يوم القيامة بسبعمائة ناقة مخطومة “Engkau pasti akan datang pada hari kiamat kelak, dengan tujuh ratus unta yang telah diberikan tali hidungnya”. Dalam riwayat Muslim dari A’masy berkata : “telah datang seorang laki-laki membawa unta yang telah diberikan tali, maka dia berkata “wahai Rosululloh ini infaq di jalan Allah ta’ala”. Maka Rosululloh sholallohu ‘alaihi wasallam bersabda : لك بها يوم القيامة سبعمائة ناقة “Bagimu dengan infaq unta ini sebanyak 700 unta pada hari kiamat” Imam Ahmad meriwayatkan dalam hadits lain dari Abdulloh Bin Mas’ud, beliau berkata, telah bersabda Rosululloh sholallohu ‘alaihi wasallam : إن الله عز وجل ، جعل حسنة ابن آدم بعشر أمثالها ، إلى سبعمائة ضعف ، إلا الصوم ، والصوم لي وأنا أجزي به ، وللصائم فرحتان : فرحة عند إفطاره وفرحة يوم القيامة ، ولخلوف فم الصائم أطيب عند الله من ريح المسك “sesungguhnya Allah ‘Azza wa Jalla telah menjadikan pahala kebaikan anak adam menjadi 10 kali lipat sampai 700 kali lipat, kecuali shaum. Dan shaum itu untuk Ku dan Aku yang akan membalasnya, dan bagi orang yang saum akan mendapatkan dua kebahagiaan, yaitu kebahagiaan saat dia iftornya (idul fitri) dan satu kebahagiaan pada hari kiamat, dan sesungguhnya bau mulutnya orang yang saum lebih wangi di hadapan Allah daripada minyak kesturi” (HR. Ahmad) Hadits yang semakna juga diriwayatkan oleh Imam Ahmad dari sahabat Abu Hurairoh. Imam Ahmad telah meriwayatkan hadits yang lain dari khorim bin Fatik, telah berkata. Telah bersabda Rosululloh sholallohu ‘alaihi wasallam : من أنفق نفقة في سبيل الله تضاعف بسبعمائة ضعف “Barangsiapa yang berinfak dengan satu nafakah di jalan Allah, maka akan dilipatgandakan sampai 700 kali lipat” Balasan pahala kebaikan bisa jadi lebih dari 700 kali lipat bahkan bisa sampai ribuan lipat hingga tak terbatas, sebagaimana disebutkan dalam hadits Nabi yang diriwayatkan oleh Abu Hurairoh tentang lipatan balasan kebaikan hingga ribuan kali lipat dalam tafsir firman Allah ta’ala: مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ أَضْعَافًا كَثِيرَةً “Siapakah yang mau memberi pinjaman kepada Allah, pinjaman yang baik (menafkahkan hartanya di jalan Allah), maka Allah akan meperlipat gandakan pembayaran kepadanya dengan lipat ganda yang banyak” (QS. Al-Baqoroh : 245) Ibnu Mardawih meriwayatkan hadits dari Ibnu Umar, beliau berkata, “ketika turun ayat : مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ Maka Nabi sholallohu ‘alaihi wasallam bersabda “Wahai Tuhanku, tambahkanlah untuk umatku”. Maka Allah ta’ala menurunkan ayat : مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ أَضْعَافًا كَثِيرَةً “Siapakah yang mau memberi pinjaman kepada Allah, pinjaman yang baik (menafkahkan hartanya di jalan Allah), maka Allah akan meperlipat gandakan pembayaran kepadanya dengan lipat ganda yang banyak” (QS. Al-Baqoroh : 245) Beliau bersabda lagi “Wahai Tuhanku tambahkan lagi untuk umatku” maka Allah menurunkan ayat : إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ “Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas.” (QS. Az-Zumar :10) Dan Allah akan melipatgandakan pahala kebaikan seseorang yang Dia kehendaki sesuai dengan kadar keikhlasan orang itu beramal, sesungguhnya Allah karunia-Nya Maha luas dan sangat banyak bahkan lebih banyak dari makhluk-Nya, dan Dia Maha Mengetahui siapa-siapa yang berhak dan siapa-siapa yang tidak berhak mendapatkannya."
  }
]