[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengeluarkan harta kekayaan mereka dalam jihad dan macam-macam kebajikan lainnya, kemudian mereka mereka tidak iringi apa yang mereka infakkan berupa harta benda itu dengan mengungkit-ungkit hal itu kepada orang yang telah mereka beri atau dengan menyakiti, baik ucapan atau pun perbuatan (terhadap si penerima) yang mengindikasikan dirinya lebih utama darinya, bagi mereka pahala mereka yang besar di sisi Tuhan mereka, tidak ada rasa khawatir pada mereka tentang apa yang akan mereka temui dari perkara akhirat dan merekapun tidak bersedih hati atas sesuatu yang terlewatkan dari mereka di dunia ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "262. Orang-orang yang menggunakan hartanya dalam ketaatan kepada Allah dan mengharapkan rida-Nya, kemudian tidak mengikutinya dengan sesuatu yang bisa membatalkan pahalanya, seperti menyebut-nyebut kebaikannya di depan umum, baik dengan kata-kata maupun tindakan yang menyakiti perasaan si penerima, mereka itu akan mendapatkan pahala di sisi Rabb mereka, tidak ada ketakutan bagi mereka tentang apa yang akan mereka hadapi di masa depan, dan mereka tidak bersedih atas apa yang sudah berlalu, karena besarnya nikmat yang mereka terima."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "262. Allah memuji orang-orang yang menginfakkan hartanya untuk kebaikan, kemudian tidak menyebut-nyebut pemberian dan tidak menyakiti perasaan penerima setelah itu, seperti menyebut-nyebut jumlah yang diberikan atau berlaku buruk dengan perkataan dan perbuatannya. Orang-orang yang memiliki sifat seperti ini akan mendapatkan pahala di sisi Tuhan mereka. Tidak ada ketakutan bagi mereka pada saat hari perhitungan, tidak pula mereka sedih dengan kemilau dunia yang terlewat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "262. ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّا وَلَآ أَذًى ۙ (kemudian mereka tidak mengiringi apa yang dinafkahkannya itu dengan menyebut-nyebut pemberiannya dan dengan tidak menyakiti (perasaan si penerima)) Makna (المنّ) adalah menyebut-nyebut pemberian hingga perkataannya itu sampai kepada si penerima sehingga menyakiti hatinya. Dan perbuatan ini termasuk dosa besar. Makna (الأذى) adalah cacian dan makian. عِندَ رَبِّهِمْ ( di sisi Tuhan mereka.) Sebagai bentuk penekanan dan pemuliaan. وَلَا خَوْفٌ عَلَيْهِمْ (Tidak ada kekhawatiran terhadap mereka ) Yakni di dunia dan di akhirat. وَلَا هُمْ يَحْزَنُونَ(dan tidak (pula) mereka bersedih hati ) Ha ini menunjukkan bahwa kesedihan dihilangkan dari hati mereka secara terus-menerus. Imam Muslim meriwayatkan dari Abu Dzar bahwa Rasulullah bersabda: tiga golongan yang tidak diajak bicara oleh Allah di hari kiamat, tidak dilihat-Nya, dan tidak pula disucikan, sedang mereka mendapat adzab yang pedih: orang yang menyebut-nyebut pemberian, orang yang menjulurkan sarungnya sampai dibawah mata kaki, dan orang yang menjual dagangannya dengan sumpah palsu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "262. Orang-orang yang menafkahkan harta-hartanya untuk sesuatu yang diridhai Allah, kemudian tidak menyertai sedekahnya dengan manna yaitu membicarakan pemberiannya atau menghitung kebaikan yang dia berikan, dan tidak pula memberikan rasa sakit yaitu dengan menghina, menyakiti, dan mengungkit-ungkit, maka bagi mereka itu pahala di sisi Tuhan atas infak mereka. Tidak ada kekhawatiran bagi mereka di dunia dan akhirat, Tidak pula mereka bersedih atas segala sesuatu di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menginfakkan harta mereka di jalan Allah, kemudian tidak mengiringi apa yang mereka infakkan itu dengan menyebut-nyebutnya} Tidak mengiringi infak mereka dengan mengulang-ulang penyebutan pemberian itu terhadap orang yang diberi {dan tidak pula menyakiti} menyombongkan diri dengan pemberian itu {bagi mereka pahala di sisi Tuhan mereka. Tidak ada rasa takut pada mereka dan mereka tidak bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "262. Kemudian Allah juga menyebutkan ada pahala lain bagi orang orang yang menafkahkan harta mereka di jalanya dengan infak yang di keluarkan dengan syarat-syarat yang cukup dan terbebas dari segala penghalang-penghalangnya. Maka orang yang berinfak itu tidak boleh mengiringi infaknya itu dengan menyebut-nyebutnya dan menghitung-hitung kebaikannya, serta tidak menyakiti persaan sipenerima dengan perkataan maupun perbuatan. Maka mereka itu ”memperoleh pahala di sis Rabb mereka ,”sesuai dengan apa yang dia ketahui dari mereka dan sesuai dengan kadar infak-infak mereka dan mafaatnya dan tentu saja karuniaNya yang tidak akan di peroleh dan tidak akan di gapai oleh nafkah-nafkah mereka. ”tidak ada kekhawatiran terhadap mereka dan tidak(pula) mereka bersedih hati”. Allah menjauhkan diri mereka dari perkara yang dibenci yang telah berlalu dengan menghilangkan dari mereka kesedihan, dan yang akan datang menghilangkan kekhawatiran dari mereka, hingga mereka memperoleh apa yang dicintainya dan di jauhkan dari perkara yang di benci."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: { مَنّٗا وَلَآ أَذٗى } Mannan wa lâ adzan: Al-Manna artinya adalah menyebut-nyebut sedekah kepada orang yang menerima sedekah untuk menunjukkan kebaikannya padanya. Al-Adza adalah berbuat tidak baik kepada penerima sedekah dengan menyakiti dan menghina dengan kata-kata yang tidak pantas sehingga menyinggung harga diri penerima sedekah itu dan menjatuhkan martabatnya. Makna ayat: Sedangkan ayat (262) mengandung kabar gembira dari Allah Ta’ala kepada orang-orang yang gemar mengeluarkan infak di jalanNya, yaitu mereka orang-orang yang tidak menyertai infak yang dikeluarkan dengan tidak mengungkit-ungkit dan menghitung-hitungnya serta dengan kata-kata yang menyakiti hati orang yang menerimanya, maka mereka tidak perlu takut terhadap masa depan kehidupannya dan tidak perlu bersedih terhadap anak keturunan yang mereka tinggalkan di belakangnya. Inilah kebahagiaan hidup dimana seroang tidak merasakan takut dan sedih, namun merasakan aman dan kesenangan. Pelajaran dari ayat: • Keharaman mengungkit-ungkit pemberian sebagaimana disebutkan dalam hadits,”Tiga orang yang tidak akan masuk surga....” di antaranya adalah Al-Mannan (orang yang mengungkit-ungkit sedekah)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 262: Misalnya untuk jihad dan protek-proyek kebaikan lainnya. Yakni menyebut-nyebut pemberiannya seperti mengatakan \"Saya telah berbuat baik kepadamu dan telah menutupi kekuranganmu\" atau menghitung-hitung pemberiannya, atau meminta orang yang diberi sedekah untuk menyebutkan pemberiannya atau bersikap sombong terhadap penerima karena pemberiannya. Yakni terkesan bahwa orang yang diberi itu telah berhutang budi kepadanya. Menyebut-nyebut dilarang bahkan merusak sedekah adalah karena sesungguhnya nikmat yang ada adalah pemberian Allah Ta'ala, demikian juga ihsannya. Terhadap hal yang akan datang di akhirat nanti. Terhadap sesuatu yang telah luput di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 262",
    "description": "Pada ayat berikut Allah menerangkan cara berinfak yang direstui Allah dan berhak mendapat pahala yang berlipat ganda. Orang yang menginfakkan hartanya di jalan Allah dalam bentuk aneka kebaikan, kemudian tidak mengiringi apa yang dia infakkan itu dengan menyebut-nyebutnya di hadapan orang yang diberi, tidak pula membanggakannya, dan tidak menyakiti perasaan penerima dengan menyebut-nyebutnya di hadapan orang lain, mereka memperoleh pahala berlipat di sisi tuhan mereka, seperti dijelaskan pada ayat terdahulu. Selain menerima ganjaran, tidak ada pula rasa takut pada diri mereka. Mereka tidak merisaukan apa yang akan terjadi di masa depan, seperti hilang dan berkurangnya harta di dunia, dan pahala serta siksa di akhirat, dan mereka tidak pula bersedih hati, yaitu keresahan akibat apa yang terjadi dan luput di masa lalu. Tidak jarang seseorang yang bersedekah atau akan bersedekah mendapat bisikan dari dalam diri atau dari orang lain agar tidak bersedekah atau tidak terlalu banyak demi mengamankan harta yang akan menjadi jaminan bagi diri dan keluarganya di masa depan. Buanglah jauh-jauh pikiran dan perasaan semacam itu. Setelah menjelaskan pemberian berupa nafkah dan larangan menyebut-nyebutnya serta menyakiti hati yang diberi, ayat ini menekankan pentingnya ucapan yang menyenangkan dan pemberian maaf. Perkataan yang baik yang sesuai dengan budaya terpuji dalam suatu masyarakat, yaitu menolak dengan cara yang baik, tidak dengan cara menyakiti; dan pemberian maaf, yaitu memaafkan tingkah laku yang kurang sopan dari peminta, lebih baik daripada sedekah yang diiringi tindakan yang menyakiti dari pemberi. Allah mahakaya, tidak memerlukan sedekah dari hamba-Nya yang disertai sikap menyakiti, bahkan tidak butuh kepada pemberian siapa pun, dan maha penyantun, sehingga tidak segera menjatuhkan sanksi dan murka kepada siapa yang durhaka kepada-Nya dengan harapan orang itu akan berubah sikapnya kemudian."
  }
]