[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perkataan baik yang dipakai menjawab orang yang meminta dan pemberian maaf terhadap sikap yang tampak dari peminta-minta berupa desakan dalam meminta itu lebih baik dari pada sedekah yang diiringi dengan menyakiti hati dan perlakuan buruk dari pemberi sedekah. Allah Mahakaya, tidak membutuhkan sedekah-sedekah hamba-hambaNya, lagi Maha penyantun, tidak menyegerakan siksaan pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "263. Kata-kata mulia yang menyenangkan hati orang mukmin dan kata maaf yang engkau berikan kepada orang yang berbuat buruk kepadamu lebih baik daripada sedekah yang diikuti dengan sesuatu yang menyakitkan hati, seperti menyebut-nyebut kebaikannya di hadapan orang yang menerima sedekahnya. Dan Allah Mahakaya (tidak butuh) terhadap hamba-hamba-Nya, lagi Maha Penyantun, tidak lekas menjatuhkan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "263. Perkataan yang baik, doa baik bagi saudara seiman, dan menutupi kekurangannya yang ia ketahui merupakan hal yang lebih baik daripada sedekah yang dibarengi dengan ucapan yang buruk dan perbuatan yang jelek. Allah Maha Kaya dari apa yang mereka sedekahkan, Maha Lembut sehingga tidak segera menimpakan hukuman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "263. قَوْلٌ مَّعْرُوفٌ ومَغفرةٌ (Perkataan yang baik dan pemberian maaf) Yakni perkataan dari yang dimintai kepada yang meminta, yang berupa harapan mendapat pahala di sisi Allah dan penolakan secara baik-baik; hal ini lebih baik dari pada pemberian sedekah yang disertai dengan caci maki. Makna (المغفرة) adalah menutupi kejelekan orang yang membutuhkan dan memaafkan si peminta apabila keluar darinya sedikit pemaksaan yang menyempitkan dada si pemberi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pengingkaran yang disertai adab lebih baik daripada pemberian disertai dengan celaan dan hinaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "263. Perkataan dan tanggapan yang baik terhadap orang yang meminta maaf, serta penutupan, pengabaian dan pemaafan kesalahan bagi orang yang mendesak untuk meminta maaf itu lebih baik daripada sedekah yang diberikan kepadanya namun disertai dengan manna (membicarakan pemberian) dan sesuatu yang menyakitinya melalui ucapan ataupun tindakan. Allah tidak butuh sedekah semacam ini dan Allah itu Maha Pengasih kepada hamba-hambaNya, sehingga tidak mendahulukan hukumannya, melainkan menundanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perkataan yang baik} perkataan yang baik dan menolak orang yang meminta dengan indah {dan pemberian maaf} pemberian maaf dari orang yang meminta ketika pemberinya kasar {itu lebih baik daripada sedekah yang diiringi tindakan yang menyakiti. Allah Maha kaya lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "263. Allah menyebutkan empat tingkatan dalam kebajikan: Tingkatan pertama: Nafkah yang terlahir dari niat yang shalih dan pemberi nafkah tidak mengiringinya dengan menyebut-nyebutnya dan menyinggung perasaan si penerima. Tingkatan kedua: Berkata yang baik, yaitu kebajikan berupa perkataan dengan segala bentuknya yang mengandung kebahagiaan bagi seorang Muslim, meminta maaf dari orang yang meminta apabila dia tidak memiliki apa yang diminta, dan sebagiannya dari perkataan yang baik. Tingkatan ketiga: Kebajikan dengan memberi maaf dan ampunan kepada orang yang telah berlaku buruk kepada anda, baik dengan perkataan maupun dengan perbuatan. Dua yang terakhir ini lebih utama dan lebih baik dari tingkatan berikut. Tingkatan keempat: Pemberi infak itu mengiringi infaknya dengan perlakuan menyakitkan kepada penerimanya karena dia telah mengotori kebaikannya tersebut dan dia telah berbuat baik dan jahat (sekaligus). Kebajikan yang murni walaupun sangat sedikit adalah lebih baik daripada kebajikan yang dicampuri oleh keburukan walaupun kebajikan itu banyak. Ini merupakan ancaman yang keras terhadap orang yang berinfak yang menyakiti orang yang diberikan nafkahnya tersebut, sebagaimana yang dilakukan oleh orang-orang yang suka mencela dan bodoh. “Dan Allah” yang Mahatinggi adalah juga “Maha Kaya” dari sedekah-sedekah mereka dan dari seluruh hamba-hambaNya, “lagi Maha Penyantun”; di samping kesempurnaan kekayaanNya dan luasnya pemberian dariNya, Dia Penyantun terhadap pelaku-pelaku maksiat. Dia tidak menyegerakan hukuman bagi mereka, akan tetapi Dia memberikan keselamatan kepada mereka, memberi mereka rizki, meluaskan bagi mereka kebaikanNYa; namun mereka menentang Allah dengan bermaksiat kepadaNya. Kemudian Allah melarang dengan sangat keras dari mengungkit-ungkit pemberian dan menyakiti orang yang diberi. Allah membuat perumpamaan tentang itu dengan FirmanNya,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { قَوۡلٞ مَّعۡرُوفٞ } Qaulun ma’rûf: Perkataan yang baik yang dikatakan kepada orang yang membutuhkan. Contoh,”Semoga Allah memberikan rizki kepada kami dan kepada kalian, Allah Maha Dermawan” atau,“Semoga Allah membuka pintu rizki kepada kami dan kepadamu.” { وَمَغۡفِرَةٌ } wa maghfirah: Menutupi orang faqir sehingga tidak terlalu nampak kemiskinannya dan memaafkan sikapnya apabila demikian. {غَنِيٌّ } Ghanniyun: Maha kaya sehingga tidak membutuhkan apapun selamanya. {حَلِيمٞ } ẖalîm: Tidak tergesa-gesa menimpakan hukuman akan tetapi mengampuni dan memaafkan. Makna ayat: Ayat selanjutnya (263) yaitu firman Allah,”Perkataan yang baik...” Allah Ta’ala mengabarkan bahwa kata-kata baik yang diucapkan kepada orang fakir akan membuat hatinya menjadi lapang dan dirinya menjadi tenang lebih baik dibandingkan harta yang diberikan sebagai sedekah namun disertai dengan perendahan, pelecehan, maka itu hanya akan membuat dirinya merasa bahwa hidupnya semakin pahit dan menyakitkan hatinya. Kata maaf serta menutupi keadaannya serta tidak merendahkan keadaannya, dan memaafkan perlakuannya yang buruk seperti terus memelas dalam meminta, lebih baik dibandingkan sedekah yang diikuti dengan mengungkit-ungkit dan menyakiti penerimanya. Firman Allah di akhir ayat,”Dan Allah Maha kaya lagi Maha Bijaksana” maknanya Allah tidak membutuhkan sama sekali kepada makhlukNya dan tidak menyegerakan hukuman kepada siapa saja yang menyelisihi perintahNya. Pelajaran dari ayat: • Jawaban yang baik kepada orang fakir tatkalah tida memiliki sesuatu untuk diberikan kepadanya, begitu juga memaafkan terhadap buruknya ucapan darinya dan selainnya lebih baik dibandingkan sedekah yang diikuti dengan ganggungan, dalam hadits disebutkan,”Perkataan yang baik merupakan sedekah.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 263: Perkataan yang baik maksudnya menolak dengan cara yang baik, termasuk pula perkataan baik lainnya seperti menggembirakan hati seorang muslim ataupun mendo'akannya. Sedangkan maksud \"pemberian maaf\" ialah memaafkan tingkah laku yang kurang sopan dari si penerima seperti mendesak dalam meminta. Dia tidak membutuhkan sedekah hamba-hamba-Nya. Allah Subhaanahu wa Ta'aala tidak membutuhkan sama sekali makhluk-Nya, bahkan semua makhluk membutuhkan-Nya di setiap waktu dan keadaan. Oleh karena itu, sedekah, infak dan ketaatan yang dilakukan seorang hamba maslahat dan manfaatnya kembalinya kepada hamba itu sendiri, karena Allah Subhaanahu wa Ta'aala Maha Kaya. Yakni tidak segera memberikan hukuman kepada orang yang bermaksiat kepada-Nya meskipun Dia mampu. Rahmat, ihsan dan sifat santun-Nya menjadikan-Nya tidak segera memberikan hukuman kepada pelaku maksiat, bahkan Dia memberi tangguh mereka dan mengulang-ulang ayat-ayat-Nya agar hamba-hamba-Nya mau kembali kepada-Nya. Jika telah jelas bahwa mereka tidak bisa diharap lagi, ayat-ayat yang datang tidak berguna lagi dan perumpamaan-perumpamaan sudah tidak dihiraukan lagi, maka ketika itulah Allah menurunkan siksa-Nya dan menghalangi mereka mendapatkan ganjaran-Nya besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 263",
    "description": "Setelah menjelaskan pemberian berupa nafkah dan larangan menyebut-nyebutnya serta menyakiti hati yang diberi, ayat ini menekankan pentingnya ucapan yang menyenangkan dan pemberian maaf. Perkataan yang baik yang sesuai dengan budaya terpuji dalam suatu masyarakat, yaitu menolak dengan cara yang baik, tidak dengan cara menyakiti; dan pemberian maaf, yaitu memaafkan tingkah laku yang kurang sopan dari peminta, lebih baik daripada sedekah yang diiringi tindakan yang menyakiti dari pemberi. Allah mahakaya, tidak memerlukan sedekah dari hamba-Nya yang disertai sikap menyakiti, bahkan tidak butuh kepada pemberian siapa pun, dan maha penyantun, sehingga tidak segera menjatuhkan sanksi dan murka kepada siapa yang durhaka kepada-Nya dengan harapan orang itu akan berubah sikapnya kemudian. Wahai orang-orang yang beriman kepada Allah dan hari akhir! janganlah kamu merusak yaitu menghilangkan pahala sedekahmu de-ngan menyebut-nyebutnya di hadapan yang diberi dan menyakiti perasaan penerima, baik dengan ucapan maupun perbuatan. Jangan keberatan atau protes hilangnya pahala sedekahmu itu, sebab yang kamu lakukan dan menyebabkan pahala hilang itu keadaannya sama seperti orang yang menginfakkan hartanya karena ria, pamer, kepada manusia untuk mendapat pujian, nama baik atau kepentingan sesaat lainnya, dan dia tidak beriman kepada Allah dan hari akhir seperti yang dilakukan orang munafik. Perumpamaannya, yakni orang yang pamrih itu, sungguh mencengangkan, seperti batu yang licin, sangat bersih, tidak dinodai apa pun dan tidak sedikit pun retak, yang di atasnya ada debu, kemudian batu itu ditimpa hujan lebat, maka tinggAllah batu itu licin lagi, tidak meninggalkan sedikit pun tanah atau debu. Seperti halnya tanah yang subur dan produktif itu hilang dari batu yang licin karena diterpa hujan deras, begitu pula pahala sedekah akan hilang karena perbuatan ria dan menyakiti. Mereka tidak memperoleh sesuatu apa pun dari apa yang mereka kerjakan. Tidak ada sedikit pun yang dapat diambil manfaatnya. Dan itulah sifat-sifat kaum kafir, maka hindarilah, sebab Allah tidak memberi petunjuk kebaikan kepada orang-orang kafir, antara lain mereka yang mengkufuri nikmat-Nya dan tidak mensyukuri-Nya."
  }
]