[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan perumpamaan orang-orang yang menginfakan hartanya demi mencari keridhaan Allah dan atas dorongan keyakinan kuat terhadap kebenaran janjiNya, adalah seperti kebun luas yang berada di dataran tinggi lagi subur. Hujan yang deras turun mengenainya, sehingga hasil buah-buahannya berliapat ganda. Apabila hujan lebat tidak turun padanya, maka gerimis hujan pun sudah cukup baginya untuk menghasilkan buah yang berlipat ganda. Begitu pula infak-infak yang dikeluarkan orang-orang yang ikhlas akan diterima di sisi Allah dan dilipat gandakan, baik infak yang berjumlah banyak atau sedikit. Allah Yang Maha Mengetahui segala rahasia-rahasia, lagi Maha Melihat seluruh perkara lahiar dan batin, akan memberikan balasan kepada mereka masing-masing sesuai dengan keikhlasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "265. Dan perumpamaan orang-orang mukmin yang membelanjakan hartanya untuk mencari rida Allah disertai keyakinan yang kuat akan kebenaran janji Allah dan tidak terpaksa adalah seperti kebun yang berada di dataran tinggi yang subur. Kebun itu disiram air hujan yang lebat kemudian menghasilkan buah yang berlipat ganda. Jika tidak disiram air hujan yang lebat, kebun itu disiram hujan gerimis dan itupun sudah mencukupi, karena kesuburan tanahnya yang luar biasa. Begitu juga infak yang dikeluarkan oleh orang-orang yang ikhlas akan diterima oleh Allah dan dilipat-gandakan pahalanya, meskipun infaknya sedikit. Dan Allah Maha Mengetahui apa yang kalian perbuat. Maka tidak ada yang luput dari pengetahuan-Nya perihal keadaan orang-orang yang ikhlas dan orang-orang yang ria (pamer). Dan Allah akan memberikan balasan kepada setiap orang sesuai dengan apa yang berhak diterimanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "265. Dan perumpamaan orang-orang yang menginfakkan harta mereka demi mendapat keridhaan Allah dan kerena keyakinan mereka terhadap janji yang Allah berikan adalah seperti kebun yang ada di dataran tinggi yang mendapat hujan lebat sehingga menghasilkan buah-buahan yang berlipat, dan jika tidak ada hujan yang lebat maka hujan yang ringanpun mencukupinya. Dan Allah Maha Melihat segala yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "265. وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ (dan untuk keteguhan jiwa mereka ) Yakni meneguhkan jiwa mereka diatas keimanan dan ibadah lainnya dengan mensedekahkan harta mereka sebagai bentuk latihan dan pembiasaan jiwa. Hasan al-Bashri berkata: makna dari potongan ayat ini adalah seseorang jika ingin bersedekah makai a harus menimbang-nimbang, apabila sedekah itu untuk Allah maka ia melaksanakannya dan apabila untuk selain-Nya maka ia membatalkan sedekahnya. Dan pendapat lain mengatakan maknanya adalah bahwa jiwa mereka memiliki bashirah yang meneguhkan mereka untuk bersedekah di jalan ketaatan kepada Allah, karena mereka pada saat akan bersedekah mereka menimbang perbuatannya; apabila untuk Allah makai a bersedekah dan apabila tidak maka ia mengurungkannya. كَمَثَلِ جَنَّةٍۭ (, seperti sebuah kebun ) Yakni kebun yang tumbuh didalamnya pohon-pohon hingga menutupinya. بِرَبْوَةٍ (yang terletak di dataran tinggi ) Yakni tempat di dataran tinggi namun tingginya tidak seberapa; yang mana tanaman akan tumbuh lebih baik dari pada di tempat lain karena hawa dingin tidak mematikan tanaman dan angin yang berhembus lembut. Makna (الوابل) adalah hujan deras, sebagimana telah dijelaskan. فَـَٔاتَتْ أُكُلَهَا ضِعْفَيْنِ (maka kebun itu menghasilkan buahnya dua kali lipat ) Yakni dua kali lebih banyak daripada biasanya disebabkan hujan lebat yang menyiraminya. Dan begitulah seorang mukmin apabila mendapat banyak rezeki dari Allah maka ia akan banyak pula bersedekah untuk mengharap ridha Allah, dan apabila rezekinya sedikit maka ia tetap bersedekah semampunya karena manfaat yang ia dapatkan di sisi Allah akan banyak apabila ia melakukannya karena mengharap keridhaan-Nya meskipun yang ia sedekahkan sedikit. فَطَلٌّ ۗ (maka hujan gerimis) Yakni hujan gerimis pun mencukupi kebun tersebut. Dan makna (الطل) adalah hujan gerimis yang tetesannya lembut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "265. Dan perumpamaan atau gambaran orang-orang yang menafkahkan harta mereka karena mencari ridha Allah, meyakini pahalaNya, dan agar bisa terus taat dan beriman itu seperti taman di dataran tinggi (perbukitan) karena kualitas tanamannya yang baik, lalu diguyur air hujan yang deras, dan tanamannya menghasilkan buah dua kali lipat daripada biasanya karena hujan lebat tersebut. Kalaupun tidak diguyur hujan lebat, maka guyuran gerimis pun sudah cukup karena tanamannya yang bagus. Maknanya adalah tanahnya sangat baik, maka hujan gerimis sudah cukup baginya. Dan Allah itu mengamati amal perbuatan kalian sehingga tidak ada satupun yang luput dariNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan orang-orang yang menginfakkan harta mereka untuk mencari ridha Allah} mencari ridha Allah SWT {dan memperteguh jiwa mereka} memperkuat jiwa mereka dengan pahala {adalah seperti sebuah kebun} kebun {di dataran tinggi} di tempat yang tinggi {yang disiram oleh hujan lebat, lalu kebun itu menghasilkan buah-buahan} buah-buahan {dua kali lipat. Jika hujan lebat tidak menyiraminya, maka hujan gerimis (sudah cukup)} hujan gerimis {Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "264-266. Allah membuat tiga perumpamaan dalam ayat-ayat ini, yaitu: pertama, untuk orang yang berinfak karena semata mengharap keridhaan Allah dan tidak mengiringi nafkahnya itu dengan mengungkit-ungkit dan menyakiti orang yang menerima. Kedua, untuk orang yang mengiringi infaknya dengan mengungkit-ungkit dan menyakiti (si penerima) dan ketiga, untuk orang yang riya. Perumpamaan pertama, adalah tatkala infaknya diterima dan dilipat gandakan pahalanya karena terlahir dari keimanan dan keikhlasan yang total, “karena mencari keridhaan Allah dan untuk keteguhan jiwa mereka,” artinya, mereka menafkahkan harta di mana mereka teguh hati (dalam memberi nafkah) dan lapang dada serta penuh kejujuran. Maka perumpamaan perbuatan ini, adalah “seperti sebuah kebun yang terletak di dataran tinggi,” yaitu, tempat yang tinggi yang sangat baik diterpa angina dan matahari, dan air akan sangat cukup padanya. Karena apabila hujan yang deras tidak menimpanya, paling tidak ia akan disirami hujan rintik yang mencukupinya karena areanya yang baik dan tanahnya yang gembur, serta adanya sebab-sebab yang memenuhi perkembangan, keturunan, dan pembuahannya. Karena itu, “maka kebun itu menghasilkan buahnya dua kali lipat,” artinya, berlipat ganda. Taman (kebun) yang seperti itu adalah yang paling diinginkan oleh manusia, dan perbuatan yang mulia inipun merupakan tingkatan yang paling tinggi. Perumpamaan kedua, yaitu orang yang menafkahkan hartanya karena Allah kemudian ia mengiringi nafkahnya itu dengan mengungkit-ungkitnya dan menyakiti penerimanya, atau ia melakukan suatu perbuatan yang dapat membatalkannya, maka yang seperti ini adalah sama dengan pemilik taman tadi, akan tetapi ia ditimpa oleh “angina keras,” yaitu angina yang sangat kencang, “yang mengandung api, lalu terbakarlah.” Padahal ia memiliki anak keturunan yang masih kecil-kecil lagi lemah, dan dia sendiri lemah yang telah tua renta. Kondisi serti ini adalah kondisi yang paling sulit, karena itu Allah membuat perumpamaan ini dengan firmanNya,”Apakah ada di antara salah seorang dari kamu yang ingin…” hingga akhir ayat, dengan menggunakan rangkaian kalimat pertanyaan yang kengeriannya dapat di pahami oleh orang-orang yang menjadi sasaran pesan (ayat ini). Karena musnahnya dalam sekali waktu sekaligus setelah keindahan pepohonannya dan ranumnya buah-buahnya, maka itu menjadi musibah yang sangat besar. Kemudian terjadinya musibah yang tiba-tiba ini, dan dia memiliki ketirunan yang masih kecil-kecil yang tidak mampu membantunya dan meringankan bebanya adalah masalah lain. Maka subyek dari perumpamaan ini yang telah beramal karena Allah kemudian dia membatalkan amalnya itu dengan sikap yang menafikanya, menyerupai kondisi pemilik taman tadiyang telah terjadi padanya yang telah terjadi ketika keburuhanya sangan mendesak kepadanya. Perumpamaan ketiga, adalah orang yang ingin di lihat oleh orang lain, tidak disirami iman kepada Allah dan kerena tidak mengarap pahala di sisisNya, dimana Allah mengumpamakan hatinya seperti batu licin yang di atasnya ada tanah. Orang yang riya itu mengira bahwa akan tumbuh tanaman darinya bila di timpa hujan sebagaimana tanaman yang tumbuh di tanah yang subur. Akan tetapi itu adalah batu yang bila di timpa hujan deras, maka lenyaplah yang ada di batu tersebut. Hal ini adalah perumpamaan yang pas bagi orang yang riya yang tidak ada keimanan padanya, bahkan hati yang kerasyang tidak akan lembut dan tidak khusyu,Inilah amal perbuatanya infak-infaknya, tidaklah ada asasnya sama sekali yang mendasarinya dan juga tujuan yang di gapai, bahkan apa yang di lakukannya adalah bathil kerena tidak ada syaratnya. Yang sebelumnya batal setelah ada syarat,namun juga ada penghalangnya, sedang yang pertama di terima dan dilipat gandakan karena terpenuhi syarat-syaratnya, yaitu keimanan dan keihklasan niat, keteguhan (hati) yang terbebasnya dari penghalang-penghalan yang merusaknya. Tiga perumpamaan ini sesuai bagi orang-orang yang beramal. Maka seorang hamba hendaklah menimbang dirinya atau selainya dengan timbangan-timbangan yang adil dan perumpamaan-perumpamaan yang sesuai tersebut. \"Dan perumpamaan-perumpamaan ini Kami buat untuk manusia; dan tiada yang memahaminya kecuali orang-orang yang berilmu.\" (QS. Al-Ankabut:43)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مَثَلُ } Al-Matsal: Matsal adalah perumpamaan, yaitu sifat yang indah lagi asing. { ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ } Ibtighâ’a mardhâtillâh: Meminta keridhaan Allah. { وَتَثۡبِيتٗا } Tatsbîtan: Meyakini pahala yang Allah berikan untuk infak yang dikeluarkan di jalanNya. { جَنَّةِۢ بِرَبۡوَةٍ } Jannatin birabwatin: Kebun yang banyak pepohonan di dataran yang tinggi. { ضِعۡفَيۡنِ } Dhi’fain: Dilipatgandakan dua kali, atau dilipatgandakan dari hasil yang lainnya. { وَابِلٞ } Wâbil: Hujan yang sangat lebat { فَطَلّٞۗ } Fathol: Hujan rintik-rintik Makna ayat: Ketika Allah Ta’ala menyebutkan tentang kerugian orang yang riya’ (pamer) dalam sedekahnya, dan memperingatkan orang-orang mukmin agar tidak melakukan seperti itu, Allah menganjurkan dan mendorong untuk menginfakkan harta dimana seorang hamba menginginkan keridhaan Allah dan pahala akhirat yang ada di sisiNya dengan melakukan hal itu dengan menyebutkan perumpamaan dalam firmanNya; “Perumpamaan orang-orang yang membelanjakan hartanya hanya mencari keridhaan Allah dan keteguhan jiwa mereka.” Yaitu untuk meyakinkan diri mereka bahwa Allah benar-benar akan mengganjar pahala atas infak yang dikeluarkan, perumpamaan apa yang mereka dapatkan berupa keridhaan Allah dan pahala yang besar seperti kebun yang terletak di dataran tinggi. Kebun itu mendapatkan curahan air hujan yang deras, maka buah yang dihasilkannya dua kali lipat dibandingkan kebun-kebun yang lain. Karena kebun itu terletak di dataran tinggi, jika tidak mendapat curah hujan yang tinggi, maka cukup dengan tetesan embun atau hujan rintik-rintik untuk menyiraminya, hingga akhirnya tetap menghasilkan buah yang berlipat ganda. Kemudian Allah Ta’ala menutup firmanNya; “dan Allah Maha melihat apa yang kamu lakukan.” Allah menjanjikan bagi orang-orang yang berinfak dengan niat mencari keridhaan Allah dan menambah keyakinan dirinya, akan mendapatkan pahala yang besar dan balasan yang baik. Begitu juga Allah mengancam orang-orang yang berinfak dan setelahnya mengungkit-ungkit serta menyakiti hati penerimanya serta orang-orang yang riya’ dengan infaknya dengan kesengsaraan dan kerugian. Inilah makna ayat (265). Pelajaran dari ayat: • Bagusnya metode memberikan perumpamaan untuk memahamkan makna kepada orang lain agar mendapatkan faidah. • Akan dilipatgandakan pahala sedekah yang tidak diikuti dengan mengungkit-ungkit dan menyakiti hati penerimanya serta tidak berbuat riya’. • Sedekah yang dikeluarkan oleh tiga orang, yaitu suka mengungkit-ungkit pemberian, menyakiti hati penerima dan orang yang riya’ maka tidak berguna sama sekali amalannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 265: Seperti inilah infak yang dikeluarkan oleh orang-orang yang ikhlas, Allah menerimanya dan melipatgandakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 265",
    "description": "Dan perumpamaan orang yang menginfakkan hartanya untuk mencari rida dan pahala dari Allah dan untuk memperteguh jiwa mereka dalam rangka melaksanakan kewajiban-kewajiban agama, seperti pemilik sebuah kebun yang subur, hijau dengan pepohonan dan menghasilkan buah-buahan yang baik yang terletak di dataran tinggi sehingga mendapat sinar matahari dan udara yang cukup. Selain itu, semakin tinggi sebuah dataran, akan semakin jauh dari sumber air yang mengakibatkan akar tumbuh-tumbuhan menjadi semakin memanjang. Serabut yang berfungsi menyerap makanan pun menjadi banyak, sehingga makanan yang membentuk zat hijau daun (klorofil) menjadi banyak pula. Dengan demikian, pohon itu menjadi produktif menghasilkan buah. Tempat kebun itu berada di dataran tinggi yang disiram oleh hujan lebat yang tercurah langsung dari langit; sebagiannya diserap oleh tanah tempat akar-akar tumbuhan menghunjam, sebagian lainnya yang tidak dibutuhkan mengalir ke bawah dan ditampung oleh yang membutuhkannya. Selain sebagai sumber makanan, hujan yang deras itu juga berfungsi melunakkan zat-zat yang diperlukan tumbuhan, membersihkannya dari zat-zat yang menghambat pertumbuhan dan menjaga hama. Maka tidak heran jika kemudian kebun itu menghasilkan buahbuahan dua kali lipat. Jika hujan lebat tidak menyiraminya, maka embun atau hujan gerimis dengan sedikit angin yang lembut pun memadai, sebab tanahnya subur dan berada di ketinggian yang memungkinkan untuk menghasilkan buah dengan baik. Begitulah, infak yang dikeluarkan dengan hati yang ikhlas, sedikit atau banyak, akan diterima dan dilipatgandakan pahalanya oleh Allah. Yang dapat mengenali niat dan yang disembunyikan seseorang hanya Allah, sebab Allah maha melihat apa yang kamu kerjakan, dan mengetahui antara yang ikhlas dalam beramal dengan niat ria. Sekali lagi Allah memberikan perumpamaan tentang orang yang tidak ikhlas dalam berderma. Ayat ini dimulai dengan sebuah pertanyaan yang ditujukan kepada siapa pun, adakah salah seorang di antara kamu yang ingin memiliki kebun yang terdapat di dalamnya pohon kurma dan pohon anggur yang mengalir di bawah pohon-pohon-Nya sungaisungai yakni memiliki sumber air yang cukup. Bahkan di sana dia memiliki segala macam buah-buahan. Kemudian datanglah masa tuanya sehingga dia tidak bisa lagi bekerja di kebun tersebut dan hanya bisa mengandalkan hasil kebun sedang dia memiliki keturunan yang masih kecil-kecil yang belum bisa bekerja dan masih membutuhkan hasil dari kebun tersebut. Lalu dalam keadaan seperti itu, tiba-tiba kebun itu ditiup angin keras yang me-ngandung api, sehingga terbakar-lah kebun tersebut dan mengha-nguskan semua pohon yang ada. Begitulah perumpamaan orang yang menginfakkan hartanya karena ria, membangga-banggakan pemberiannya kepada orang lain dan menyakiti hati orang yang diberi. Nanti di akhirat saat dia sangat membutuhkan ganjaran amal tersebut, dia tidak menjumpainya. Amal perbuatannya hangus dan punah karena niat yang tidak ikhlas dan sikap yang menyakiti orang lain. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu memikirkannya sehingga kamu berupaya untuk ikhlas dalam berinfak. Sifat ria merusak pahala amal seseorang seperti halnya kebakaran menghanguskan kebun."
  }
]