[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah ada seseorang dari kalian yang berhasrat memiliki kebun yang di dalamnya terdapat pohon kurma dan anggur, di mana air-air tawar dari sungai mengalir di bawah pepohonannya, dan di dalamnya dia memiliki berbagai jenis buah-buahan, lalu dia pun mencapai usia senja, dan tidak mampu menanam kembali seperti itu, sedangkan dia memiliki anak-anak yang masih lecil yang membutuhkan kebun tersebut; dalam kondisi demikian, angin kencang bertiup menerjang kebun itu dan di dalam angin itu ada api menyala-nyala lalu membakarnya habis? Demikianlah keadaan orang-orang yang tidak ikhlas dalam infak-infak yang mereka keluarkan. Mereka datang pada hari kiamat tanpa memiliki kebajikan barang satu pun. Dan dengan penjelasan demikian ini, Allah menerangkan kepada kalian apa saja yang bermanfaat bagi kalian agar kalian mau merenung dan ikhlas dalam infak-infak kalian karena Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "266. Apakah salah seorang di antara kamu ingin memiliki sebuah kebun yang di dalamnya terdapat pohon kurma dan anggur, di sela-selanya terdapat air tawar yang mengalir, di dalamnya terdapat segala macam buah-buahan yang lezat, dan pemiliknya memasuki usia senja dan menjadi tua renta, tidak bisa bekerja maupun berusaha, sedangkan ia memiliki anak-anak yang masih kecil dan lemah, tidak dapat bekerja, kemudian kebun itu diterpa angin kencang yang berisi api yang sangat panas, lalu kebun itu terbakar habis, sedangkan pemiliknya dalam kondisi yang sangat membutuhkannya, mengingat usianya yang sudah senja dan anak-anaknya yang masih lemah?! Jadi kondisi orang yang menginfakkan hartanya karena ria (pamer) kepada manusia itu sama seperti pemilik kebun tersebut. Dia akan datang kepada Allah pada hari kiamat tanpa membawa kebajikan di saat ia sangat membutuhkannya. Dengan penjelasan seperti inilah Allah menjelaskan kepada kalian tentang apa yang bermanfaat bagi kalian di dunia dan di akhirat, agar kalian memikirkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "266. Apakah kalian suka jika seseorang di antara kalian memiliki kebun yang rimbun oleh pohon-pohon kurma dan anggur, di bawahnya mengalir sungai air tawar, serta tumbuh berbagai macam buah-buahan lainnya. Dan ketika ia tua sedangkan anak-anaknya masih kecil yang butuh terhadap kebun itu untuk masa depan mereka, ternyata kebun itu diterjang oleh angin kencang yang mengandung api sehingga kebun itu terbakar? Demikianlah perumpamaan sedekah yang dilakukan oleh orang yang riya’, pahalanya lenyap pada hari kiamat. Demikianlah Allah menjelaskan kepada kalian ayat-ayat-Nya agar kalian dapat memperhatikannya sehingga kalian dapat berinfak dengan ikhlas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "266. تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ (mengalir di bawahnya sungai-sungai ) Yakni di bawah pohon-pohonnya. Adapun pengkhususan dalam penyebutan pohon kurma dan anggur padahal keduanya masuk dalam firman-Nya: لَهُۥ فِيهَا مِن كُلِّ الثَّمَرٰتِ(dia mempunyai dalam kebun itu segala macam buah-buahan ), adalah karena keduanya adalah pohon yang paling mulia. وَأَصَابَهُ الْكِبَرُ(kemudian datanglah masa tua pada orang itu) Yakni karena masa tua adalah tanda kebutuhan seseorang yang besar karena mereka mengalami penurunan kemampuan untuk bekerja. وَلَهُۥ ذُرِّيَّةٌ ضُعَفَآءُ (sedang dia mempunyai keturunan yang masih kecil-kecil ) Karena barangsiapa yang terkumpul dalam diri seseorang umur yang tua dan keturunan yang masih kecil akan merasakaan kerugian yang sangat atas kebun yang rusak, sebab dirinya sudah tidak mampu lagi untuk menanam ulang kebunnya seperti semula dan anak keturunannya pun masih belum mempunyai kemampuan untuk itu. فَأَصَابَهَآ إِعْصَارٌ فِيهِ نَارٌ فَاحْتَرَقَتْ ۗ (Maka kebun itu ditiup angin keras yang mengandung api, lalu terbakarlah ) Arti dari (الإعصار) adalah angin kencang yang bertiup dari bumi mengarah ke langit bagaikan tiang, dan angina ini disebut dengan Zauba’ah (angin tornado). Dan apabila terdapat api dalam angin tersebut maka ia akan membakar pepohonan. Ayat ini sebagai perumpamaan bagi orang yang melakukan kebaikan namun disertai sesuatu yang dapat menghapus pahalanya, sehingga pada hari kiamat disaat ia begitu membutuhkan pahala amal tersebut ternyata amal ini bagai makanan yang tidak menggemukkan dan tidak pula mengenyangkan. Sebagaimana keadaan orang yang memiliki kebun tersebut begitu pula lah sifat orang tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "266. Apakah salah satu dari kalian senang jika memiliki taman yang berisi pepohonan kurma dan anggur yang dibawah pepohonan tersebut mengalir sungai-sungai, memiliki berbagai macam buah-buahan, kemudian dia mencapai masa tua yang mana sangat membutuhkan hal tersebut karena tidak mampu bekerja dan memiliki keturunan yang masih kacil yang belum mampu bekerja, penghimpunan masa tua dan kelemahan keturunan itu untuk menjelaskan kebutuhan yang sangat mendesak. Lalu kebunnya diterpa angin kencang yang sangat panas dan meninggi sembari membawa debu-debu sehingga berbentuk seoerti pilar, yaitu angin topan, lalu kebun itu terbakar. Ini adalah perumpamaan infak orang-orang munafik yang akan lenyap pada hari kiamat, ketika sangat membutuhkan (pahala) infak tersebut. Seperti itulah Allah menjelaskan ayat-ayatNya melalui pemberian perumpamaan dan ibarah, supaya kalian berpikir tentang kefanaan dunia dan kekekalan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah salah seorang di antara kalian ingin} senang {memiliki kebun kurma dan anggur yang mengalir di bawahnya sungai-sungai, di sana dia memiliki segala macam buah-buahan. Kemudian, datanglah masa tua} masa tua {sedangkan dia memiliki keturunan yang masih kecil-kecil} anak-anak yang masih kecil dan lemah {Lalu, kebun itu ditiup angin kencang} angin kencang {yang di dalamnya terdapat api sehingga kebun itu terbakar. Demikianlah Allah menerangkan ayat-ayatNya kepada kalian agar kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "264-266. Allah membuat tiga perumpamaan dalam ayat-ayat ini, yaitu: pertama, untuk orang yang berinfak karena semata mengharap keridhaan Allah dan tidak mengiringi nafkahnya itu dengan mengungkit-ungkit dan menyakiti orang yang menerima. Kedua, untuk orang yang mengiringi infaknya dengan mengungkit-ungkit dan menyakiti (si penerima) dan ketiga, untuk orang yang riya. Perumpamaan pertama, adalah tatkala infaknya diterima dan dilipat gandakan pahalanya karena terlahir dari keimanan dan keikhlasan yang total, “karena mencari keridhaan Allah dan untuk keteguhan jiwa mereka,” artinya, mereka menafkahkan harta di mana mereka teguh hati (dalam memberi nafkah) dan lapang dada serta penuh kejujuran. Maka perumpamaan perbuatan ini, adalah “seperti sebuah kebun yang terletak di dataran tinggi,” yaitu, tempat yang tinggi yang sangat baik diterpa angina dan matahari, dan air akan sangat cukup padanya. Karena apabila hujan yang deras tidak menimpanya, paling tidak ia akan disirami hujan rintik yang mencukupinya karena areanya yang baik dan tanahnya yang gembur, serta adanya sebab-sebab yang memenuhi perkembangan, keturunan, dan pembuahannya. Karena itu, “maka kebun itu menghasilkan buahnya dua kali lipat,” artinya, berlipat ganda. Taman (kebun) yang seperti itu adalah yang paling diinginkan oleh manusia, dan perbuatan yang mulia inipun merupakan tingkatan yang paling tinggi. Perumpamaan kedua, yaitu orang yang menafkahkan hartanya karena Allah kemudian ia mengiringi nafkahnya itu dengan mengungkit-ungkitnya dan menyakiti penerimanya, atau ia melakukan suatu perbuatan yang dapat membatalkannya, maka yang seperti ini adalah sama dengan pemilik taman tadi, akan tetapi ia ditimpa oleh “angina keras,” yaitu angina yang sangat kencang, “yang mengandung api, lalu terbakarlah.” Padahal ia memiliki anak keturunan yang masih kecil-kecil lagi lemah, dan dia sendiri lemah yang telah tua renta. Kondisi serti ini adalah kondisi yang paling sulit, karena itu Allah membuat perumpamaan ini dengan firmanNya,”Apakah ada di antara salah seorang dari kamu yang ingin…” hingga akhir ayat, dengan menggunakan rangkaian kalimat pertanyaan yang kengeriannya dapat di pahami oleh orang-orang yang menjadi sasaran pesan (ayat ini). Karena musnahnya dalam sekali waktu sekaligus setelah keindahan pepohonannya dan ranumnya buah-buahnya, maka itu menjadi musibah yang sangat besar. Kemudian terjadinya musibah yang tiba-tiba ini, dan dia memiliki ketirunan yang masih kecil-kecil yang tidak mampu membantunya dan meringankan bebanya adalah masalah lain. Maka subyek dari perumpamaan ini yang telah beramal karena Allah kemudian dia membatalkan amalnya itu dengan sikap yang menafikanya, menyerupai kondisi pemilik taman tadiyang telah terjadi padanya yang telah terjadi ketika keburuhanya sangan mendesak kepadanya. Perumpamaan ketiga, adalah orang yang ingin di lihat oleh orang lain, tidak disirami iman kepada Allah dan kerena tidak mengarap pahala di sisisNya, dimana Allah mengumpamakan hatinya seperti batu licin yang di atasnya ada tanah. Orang yang riya itu mengira bahwa akan tumbuh tanaman darinya bila di timpa hujan sebagaimana tanaman yang tumbuh di tanah yang subur. Akan tetapi itu adalah batu yang bila di timpa hujan deras, maka lenyaplah yang ada di batu tersebut. Hal ini adalah perumpamaan yang pas bagi orang yang riya yang tidak ada keimanan padanya, bahkan hati yang kerasyang tidak akan lembut dan tidak khusyu,Inilah amal perbuatanya infak-infaknya, tidaklah ada asasnya sama sekali yang mendasarinya dan juga tujuan yang di gapai, bahkan apa yang di lakukannya adalah bathil kerena tidak ada syaratnya. Yang sebelumnya batal setelah ada syarat,namun juga ada penghalangnya, sedang yang pertama di terima dan dilipat gandakan karena terpenuhi syarat-syaratnya, yaitu keimanan dan keihklasan niat, keteguhan (hati) yang terbebasnya dari penghalang-penghalan yang merusaknya. Tiga perumpamaan ini sesuai bagi orang-orang yang beramal. Maka seorang hamba hendaklah menimbang dirinya atau selainya dengan timbangan-timbangan yang adil dan perumpamaan-perumpamaan yang sesuai tersebut. \"Dan perumpamaan-perumpamaan ini Kami buat untuk manusia; dan tiada yang memahaminya kecuali orang-orang yang berilmu.\" (QS. Al-Ankabut:43)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { إِعۡصَارٞ } I’shâr: Angin topan yang panas. Makna ayat: Pada ayat (266) Allah Ta’ala bertanya-tanya kepada hamba-hambaNya, untuk mendidik mereka dan memperbaiki akhlaknya serta mengangkat mereka ke atas derajat rohani yang sempurna. Allah Ta’ala berfirman; “Apakah ada salah seorang di antaramu yang ingin.” Yaitu apakah orang-orang yang berinfak tanpa niatan mencari keridhaan Allah Ta’ala ingin mendapatkan kebun yang berisi pepohonan kurma dan anggur, mengalir di bawahnya sungai-sungai dan terdapat di dalamnya berbagai macam buah-buahan, sedang dia sudah berusia lanjut dan lemah fisiknya, sementara itu dia memliki anak anak yang masih kecil dan belum mampu mencari penghasilan sendiri untuk menopang hidupnya. Kemudian kebun yang digunakan sebagai penghidupannya itu terkena musibah berupa angin topan yang panas dan membakarnya, bagaimana keadaan orang tua itu? Beginilah keadaan orang yang berinfak namun riya’ akan mendapatkan kerugian tatkala dia sedang membutuhkan sekali dibandingkan lelaki tua yang memiliki anak-anak kecil tadi. Itu terjadi pada hari kiamat. Pada akhir ayat ini Allah Ta’ala menganugerahi hamba-hambaNya dengan ayat-ayat yang berisikan pembahasan akidah, ibadah, muamalah, dan adab agar manusia mau memikirkannya sehingga mendapatkan petunjuk di bawah sinarnya sampai mendapatkan kesempurnaan dan kebahagiaan. Allah Ta’ala berfirman; “Demilkianlah Allah menjelaskan ayat-ayatNya agar kamu semua mau berfikir.” Pelajaran dari ayat: • Kewajiban untuk memikirkan ayat-ayat Allah, tidak terkecuali ayat yang mengandung penjelasan tentang akidah, hukum, adab dan akhlak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 266: Sehingga mudah menyiraminya atau tidak perlu disirami karena pohon-pohon itu sudah dapat menyerap air dengan akarnya. Dirinya menjadi lemah untuk menggarap tanahnya. Yang membutuhkan kebun tersebut. Orang yang tertimpa musibah seperti ini tentu sangat sedih sekali. Bagaimana tidak? Usianya sudah lanjut, fisiknya sudah lemah sehingga berat untuk berusaha, di samping itu anak-anaknya banyak dan masih kecil-kecil yang butuh diberi nafkah, tiba-tiba ada angin kencang yang membawa api, lalu membakar kebun tersebut. Inilah perumpamaan orang yang beramal shalih karena Allah, lalu ia merusaknya dengan kemaksiatan yang merusak amal tersebut. Amal yang merusak amal shalih ibarat angin yang mengandung api, yang membakar kebun-kebun yang dibutuhkan dan diharapkan hasilnya tersebut. Dan seorang hamba lebih butuh kepada amal daripada orang tersebut butuh kepada kebun tersebut, karena amal shalih dapat menyelamatkan dirinya di akhirat dari neraka jahanam. Inilah perumpamaan orang yang menginfakkan hartanya karena riya, membangga-banggakan pemberiannya kepada orang lain, dan menyakiti hati orang. Mereka akan datang pada hari kiamat tanpa membawa kebaikan. Namun menurut Ibnu Abbas, bahwa perumpamaan di atas adalah untuk orang yang mengerjakan ketaatan sekian lama, lalu setan mendatanginya, akhirnya ia terbawa oleh bujukan setan dan mengerjakan maksat sehingga amal shalihnya habis oleh maksiatnya. Sedangkan menurut Syaikh As Sa'diy, perumpamaan ini ditujukan kepada orang yang sebelumnya beramal shalih karena Allah baik berupa sedekah maupun amalan lainnya, lalu ia mengerjakan amalan yang merusak amal shalih itu, wallahu a'lam. Jika seseorang membayangkan perumpamaan tersebut, dan dirinya berakal, tentu dia tidak akan maju untuk mengerjakan sesuatu yang merugikannya. Akan tetapi, karena lemahnya keimanan, akal dan kurangnya bashirah (pandangan) menjadikan seseorang melakukan yang demikian. Oleh karena itu, dalam ayat di atas, Allah Subhaanahu wa Ta'aala memerintahkan untuk berpikir dan merenunginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 266",
    "description": "Sekali lagi Allah memberikan perumpamaan tentang orang yang tidak ikhlas dalam berderma. Ayat ini dimulai dengan sebuah pertanyaan yang ditujukan kepada siapa pun, adakah salah seorang di antara kamu yang ingin memiliki kebun yang terdapat di dalamnya pohon kurma dan pohon anggur yang mengalir di bawah pohon-pohon-Nya sungaisungai yakni memiliki sumber air yang cukup. Bahkan di sana dia memiliki segala macam buah-buahan. Kemudian datanglah masa tuanya sehingga dia tidak bisa lagi bekerja di kebun tersebut dan hanya bisa mengandalkan hasil kebun sedang dia memiliki keturunan yang masih kecil-kecil yang belum bisa bekerja dan masih membutuhkan hasil dari kebun tersebut. Lalu dalam keadaan seperti itu, tiba-tiba kebun itu ditiup angin keras yang me-ngandung api, sehingga terbakar-lah kebun tersebut dan mengha-nguskan semua pohon yang ada. Begitulah perumpamaan orang yang menginfakkan hartanya karena ria, membangga-banggakan pemberiannya kepada orang lain dan menyakiti hati orang yang diberi. Nanti di akhirat saat dia sangat membutuhkan ganjaran amal tersebut, dia tidak menjumpainya. Amal perbuatannya hangus dan punah karena niat yang tidak ikhlas dan sikap yang menyakiti orang lain. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu memikirkannya sehingga kamu berupaya untuk ikhlas dalam berinfak. Sifat ria merusak pahala amal seseorang seperti halnya kebakaran menghanguskan kebun. Wahai orang-orang yang beriman! infakkanlah sebagian dari hasil usahamu yang baik-baik' dan diperoleh dengan cara yang halal, sebab Allah itu baik dan hanya menerima yang baik-baik. Dan sedekahkanlah sebagian dari apa yang kami keluarkan dari bumi berupa hasil pertanian, tambang, dan lainnya, untukmu. Pilihlah yang baik-baik dari apa yang kamu nafkahkan itu, walaupun tidak harus semuanya baik, tetapi janganlah kamu memilih secara sengaja yang buruk untuk kamu keluarkan guna disedekahkan kepada orang lain, padahal kamu sendiri kalau diberi yang buruk-buruk seperti itu tidak mau mengambilnya melainkan dengan memicingkan mata karena rasa enggan terhadapnya. Cobalah berempati. Posisikan dirimu seperti orang yang diberi. Jika kamu tidak mau menerima yang buruk-buruk, mengapa kamu berikan yang seperti itu kepada orang lain. Dan ketahuilah dan yakinlah bahwa Allah mahakaya, tidak membutuhkan sedekah kamu, baik pemberian untuknya maupun untuk makhluk-makhluk-Nya, sebab dia bisa memberi secara langsung. Sedekah itu justru untuk kemaslahatan orang yang memberi. Dia juga maha terpuji, antara lain karena dia memberi ganjaran terhadap hamba-hamba-Nya yang bersedekah."
  }
]