[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepadaKu dan telah mengikuti Rasul-rasulKu, keluarkanlah infak dari barang halal lagi baik-baik yang kalian peroleh dari usaha kalian dan dari apa yang kami keluarkan bagi kalian dari bumi. Dan janganlah kalian sengaja memilih barang jelek darinya untuk kalian berikan kepada orang-orang fakir-miskin, padahal sekiranya itu diberikan kepada kalian, kalian enggan untuk mengambilnya kecuali dengan memicingkan pandangan kepadanya karena buruk dan cacatnya. Bagaimana kalian menyukai sesuatu bagi Allah yang kalian sendiri tidak menyukainya bagi diri kalian? Dan ketahuilah sesungguhnya Allah Dzat yang memberikan rizki kepada kalian tidak butuh terhadap sedekah-sedekah kalian, Dia berhak mendapat sanjungan, lagi Maha Terpuji dalam segala kondisi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "267. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya! Infakkanlah harta yang halal lagi baik yang telah kalian peroleh. Dan berinfaklah dari tumbuh-tumbuhan bumi yang telah Kami keluarkan untukmu. Janganlah kalian sengaja memilih harta yang jelek untuk diinfakkan. Seandainya harta yang jelek itu diberikan kepada kalian, niscaya kalian tidak mau menerimanya kecuali dengan menutup mata dan terpaksa menerima karena kejelekannya. Bagaimana mungkin kalian rela memberikan sesuatu kepada Allah padahal kalian sendiri tidak mau menerimanya?! Ketahuilah bahwa Allah tidak membutuhkan infak kalian. Dia Maha Terpuji di dalam Żat dan tindakan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "267. Allah memerintahkan orang-orang beriman untuk bersedekah dengan harta terbaik yang mereka dapatkan dan yang Allah berikan dari hasil bumi, seperti pertanian, perkebunan, dan barang tambang. Dan Allah melarang mereka sengaja berinfak dengan harta yang buruk, sebab jika mereka diberi harta yang demikian, merekapun tidak mau menerimanya kecuali dengan hati yang enggan. Maka bagaimana kalian berinfak dengan harta yang demikian untuk melaksanakan kewajiban yang Allah berikan? Dan ketahuilah Allah Maha Kaya dari sedekah kalian, dan Maha Terpuji dalam segala perbuatan dan firman-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "267. أَنفِقُوا۟ مِن طَيِّبٰتِ مَا كَسَبْتُمْ (nafkahkanlah (di jalan allah) sebagian dari hasil usahamu yang baik-baik ) Yakni dari hasil kalian usakan yang baik, terpilih, dan halal. وَمِمَّآ أَخْرَجْنَا لَكُم مِّنَ الْأَرْضِ ۖ (dan sebagian dari apa yang Kami keluarkan dari bumi untuk kamu ) Yakni buah-buahan, biji-bijian, umbi-umbian, barang tambang, dan harta yang ditemukan dari dalam tanah. وَلَا تَيَمَّمُوا۟ الْخَبِيثَ (Dan janganlah kamu memilih yang buruk-buruk ) Yakni janganlah kalian pilih harta yang berkualitas rendah. مِنْهُ تُنفِقُونَ ( lalu kamu menafkahkan daripadanya) Yakni janganlah kalian khususkan harta yang berkualitas rendah itu untuk disedekahkan. وَلَسْتُم بِـَٔاخِذِيهِ (padahal kamu sendiri tidak mau mengambilnya ) Yakni kalian sebenarnya kalian tidak mau mengambilnya dalam muamalat kalian di saat tertentu. إِلَّآ أَن تُغْمِضُوا۟ فِيهِ ۚ (melainkan dengan memincingkan mata terhadapnya ) Yakni saat kalian mendapatkannya dijual di pasar, atau saat kalian diberi seseorang hal itu maka dia tidak akan mengambilnya kecuali dengan memicingkan mata dan perasaan terpaksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "267. Wahai orang-orang mukmin tunaikanlah zakat harta kalian berupa harta yang baik dan paling utama yang dihasilkan dari usaha kalian dengan halal, dan dari berbagai jenis harta yang wajib dizakati. Dan nafkahkanlah apa yang ditumbuhkan oleh Allah dari tanah berupa hasil pertanian, buah-buahan, dan logam. Dan janganlah kalian berikan harta yang buruk yang dikeluarkan untuk berzakat, padahal kalian sendiri tidak mau mengambilnya ketika kalian dibayar menggunakan harta tersebut ketika bermuamalah, kecuali kalian bertoleransi dan tidak memperhatikan hal tersebut karena benci dan malu, dan kalian ridha dengan sebagiak hak kalian, lalu bagaimana kalian menunaikan hak Allah dari harta tersebut? Ketahuilah sesungguhnya Allah Maha Kaya dari zakat dan infak kalian, dan lebih berhak untuk dipuji di setiap keadaan atas nikmatNya yang melimpah, serta dipuji atas segala tindakanNya. Sahal bin Hanif berkata: “Ada orang-orang yang memilih buah-buahnya yang buruk dan mengeluarkannya untuk sedekah, lalu turunlah ayat {Wa laa tayammamul khabiitsa … }”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, infakkanlah sebagian dari hasil usaha kalian yang baik-baik dan sebagian dari apa yang Kami keluarkan dari bumi untuk kalian. Janganlah kalian memilih} menghendaki {yang buruk} yang buruk {untuk kalian infakkan, padahal kalian tidak mau mengambilnya, kecuali dengan memicingkan mata} kalian mengambilnya dengan disertai perasaan tidak suka {Ketahuilah bahwa Allah Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "267-268 Allah menganjurkan kepada hamba-hambaNya untuk menginfakkan sebagian yang mereka dapatkan dalam berniaga, dan sebagian apa yang mereka panen dari tanaman dari biji-bjian maupun buah-buahan, hal ini mencakup zakat uang maupun seluruh dagangan yang dipersiapkan untuk di jual belikan, juga hasil pertanian dari biji-bijian dan buah-buahan, Termasuk dalam keumuman ayat ini, infak yang wajib maupun sunah. Allah memerintahkan untuk memilih yang baik dari itu semua dan tidak memilih yang buruk,yaitu yang jelek lagi rendah mutunya lalu mereka sedekahkan kerena Allah, yang seandainya mereka memberikan barang yang seperti itu kepada orang-orang yang berhak memerimanya, pastilah merekapun tidak akan meridhoinya, mereka tidak akan menerimanya kecuali dengan kedongkolan dan memicingkan mata. Maka yang seharusnya mengeluarkan yang tengah-tengah dari semua itu, dan yang paling sempurna adalah mengeluarkan yang paling baik. Dan yang dilarang adalah mengeluarkan yang jelek, kerena yang ini tidaklah memenuhi infak yang wajib dan tidak akan memperoleh pahala yang sempurna dalam infak yang sunah. “Dan ketahuilah bahwa Allah Maha Kaya Lagi Maha Terpuji.” Allah maha kaya atas seluruh makhluk, Allah maha kaya dari orang-orang yang berinfak, dan Allah maha kaya atas orang-orang yang taat. Allah memerintahkan hal itu kepada mereka dan menganjurkan mereka dan itu demi kemaslahatan mereka sendiri, dan semata-mata kerena karunia dan kemuliaanNya atas mereka. Di samping kesempurnaan kekayaanNya dan luasnya pemberiannya, Dia pun maha terpuji atas segala perkara yang di syariatkaNya untuk hamba-hambaNya dari hukum-hukum yang menyampaikan mereka ke negeri keselamatan. Dia terpuji dalam perbuatanya yang tidak akan keluar dari koridor karunia, keadilan, dan hikmahNya. Terpuji sipat-sipatNya, karena sipat-sipat Allah semuanya baik dan sempurna, sampai kepada eksistesinya dan tidak akan mengerti seperti apa sipat-sipat tersebut. Ketika Allah menganjurkan mereka berinfak yang berguna, Allah juga melarang mereka dari menahan harta mereka yang dapat merugikan, dan Allah menjelaskan kepada mereka bahwa mereka itu di antara dua seruan: Pertama, seruan yang Maha Penyayang, yang mengajak kepada kebaikan, menjanjikan kepadanya kebaikan, karunia, dan pahala yang segera maupun tertunda serta mengganti apa yang telah mereka infakan, dan Kedua seruan dari setan yang mengajak untuk menahan harta dan menakut-nakuti mereka bila mereka mengifakan harta mereka, pastilah mereka akan menjadi miskin. Siapa yang memenuhi seruan a-Rahman lalu ia menginfakan sebagian yang Allah rezekikan kepadanya, maka bergembiralah dengan ampunan dosa dan mendapatkan apa yang di carinya. Dan barang siapa yang mengikuti penyeru setan, maka sesungguhnya setan hanyalah mengajak kelompoknya agar menjadi penghuni-penghuni neraka. Karena itu, seorang hamba harus memilih di antara dua perkara yang lebih pantas dan cocok untuknya. Lalu Allah menutup ayat ini bahwasanya dia, ”Maha Luas (karunianya) Lagi Maha Mengetahui,” maksudnya, luas sipat-sipatNya, banyak pemberiaNya, Maha Mengetahui orang yang berhak di lipatgandakan pahalanya dari orang-orang yang beramal dan Maha Mengetahui orang yang pantas yang akan di bimbing kepada perbuatan kebajikan dan meninggalkan kemungkaran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مِن طَيِّبَٰتِ مَا كَسَبۡتُمۡ } Min Thayyibâti mâ kasabtum: Harta benda kalian yang bagus dan baik. { وَمِمَّآ أَخۡرَجۡنَا لَكُم مِّنَ ٱلۡأَرۡضِۖ } Wa mimmâ akhrajnâ lakum minal ardh: Berbagai macam biji-bijian dan buah-buahan. { وَلَا تَيَمَّمُواْ ٱلۡخَبِيثَ } Wa lâ tayammamul khabîtsa: Jangan sengaja memberikan yang jelek untuk disedekahkan. { إِلَّآ أَن تُغۡمِضُواْ فِيهِۚ } Illâ an tughmidû fîhi: Kecuali engkau menutup pandangmu tidak melihat keburukannya, sehingga kamu mengambilnya dengan menganggap remeh dan penuh pembiaran. { َحميد} ẖamîd: yang Maha Terpuji di langit dan di bumi, di dunia dan akhirat, karena nikmat yang diberikan kepada makhlukNya. Makna ayat: Sebelumnya Allah Ta’ala menganjurkan kepada hamba-hambaNya yang mukmin untuk berinfak di jalanNya pada ayat yang telah lalu, Allah Ta’ala memanggil mereka di sini sekarang dengan label keimanan dan memerintahkan mereka untuk mengeluarkan zakat dari harta baik yang didapatkan. Allah Ta’ala berfirman; “Hai orang –orang yang beriman nafkahkanlah sebagian dari hasil usahamu yang baik dan sebagian dari apa yang Kami keluarkan dari bumi untuk kamu.” Maksudnya adalah biji-bijian dan buah-buahan dan begitu juga apa yang mereka hasilkan mencakup emas dan perak, hewan ternak, unta, sapi, kambing, dan melarang mereka untuk tidak mengeluarkan infak dengan harta yang jelek, Allah ta’ala berfirman; “Dan janganlah kamu memilih yang buruk-buruk lalu kamu nafkahkan dari padanya, padahal kamu senddiri tidak mau mengambilnya melainkan dengan memejamkan mata terhadapnya.” Maksudnya tidak sepantasnya kalian mengeluarkan infak yang jelek sedangkan kalian kalau diberikan yang seperti itu tidak akan menerimanya, kalaupun menerima dengan memejamkan mata dan meremehkan pemberian itu. Ini merupakan pendidikan dan pengajaran adab dari Alla Ta’ala kepada orang-orang mukmin. Kemudian Allah mengabarkan bahwa diriNya Maha Kaya tidak memerlukan makhlukNya dan infaq yang mereka keluarkan. Allah tidak memerintahkan makhlukNya mengeluarkan zakat dan sedekah untuk diriNya, akan tetapi perintah itu untuk kebahagiaan dan kesempurnaan hamba itu sendiri. Allah Ta’ala Maha terpuji dengan semua pemberian karunia kepada seluruh makhluknya. Inilah kandungan ayat (267). Pelajaran dari ayat: • Kewajiban mengeluarkan zakat dalam harta yang diam (tidak bergerak) baik berupa emas perak atau yang serupa dengan keduanya dihasilkan dari bekerja, dan hewan ternak seperti unta, sapi dan kambing. Semua itu masuk dalam cakupan firman Allah “Apa yang kamu hasilkan,” dengan syarat memperhatikan haul dan sampainya nishab. • Kewajiban zakat pada tanaman: biji-bijian dan buah-buahan jika mencapai nishab, begitu juga pada barang tambang yang tercakup dalam kata “sesuatu yang keluar dari perut bumi.” • Buruknya mengeluarkan infak dengan sesuatu yang jelek dan meninggalkan yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 267: Imam Tirmidzi meriwayatkan dari Al Barra' ia berkata: Ayat tersebut turun berkenaan dengan kami kaum Anshar, di mana kami adalah para pemilik kebun kurma. Terkadang seseorang datang dari kebunnya dengan membawa kurma tergantung banyak kurma atau sedikitnya. Ada pula seseorang yang datang membawa satu atau dua tangkai (berisi kurma), lalu ia menggantungkannya di masjid. Ketika itu penghuni Shuffah (pelataran masjid) tidak memiliki makanan, salah seorang di antara mereka apabila datang (ke masjid), mendatangi tangkai tersebut, lalu ia pukul dengan tongkatnya, kemudian jatuhlah kurma muda dan kurma kering, lalu ia makan. Ada beberapa orang yang kurang peduli dengan kebaikan datang membawa tangkai kurma berisi kurma yang kurang baik dan yang jelek, serta membawa tangkai yang sudah patah, lalu ia gantungkan di masjid, maka Allah Tabaaraka wa Ta'aala menurunkan ayat, \"Yaa ayyuhalladziina aamanuu anfiquu min thayyibaati…dst. illaa an tughmidhuu fiih.\" Rasulullah shallallahu 'alaihi wa sallam bersabda, \"Jika salah seorang di antara kamu diberi hadiah sama seperti yang dia berikan, tentu dia tidak akan mengambilnya kecuali dengan memicingkan mata atau malu.\" Setelah itu, salah seorang di antara kami datang dengan membawa kurma yang baik yang ada di sisinya. (Hadits ini hasan shahih gharib, Abu Malik di sini adalah Al Ghifariy, ada yang mengatakan bahwa namanya Ghazwan. Hadits ini diriwayatkan pula oleh Ibnu Majah no. 1822, Ibnu Jarir juz 3 hal. 82. Al Haafizh Ibnu Katsir dalam tafsirnya menyandarkan hadits tersebut kepada Ibnu Abi Hatim. Hakim juga meriwayatkan di juz 2 hal. 285 dan berkata, \"Shahih sesuai syarat Muslim\", dan hadits tersebut didiamkan oleh Adz Dzahabi). Yang halal lagi baik. Sebagai tanda syukur kepada Allah, penunaian sebagian hak saudaramu dan sebagai penyucian harta. Dia tidak butuh kepada sedekah kamu. Berhak mendapatkan pujian dan sanjungan dalam keadaan bagaimana pun. Dari ayat di atas dapat diambil kesimpulan: - Dorongan untuk berinfak. - Sebab-sebab yang menjadikannya wajib. - Wajibnya zakat pada barang yang keluar dari bumi, seperti barang tambang, biji dan buah-buahan. - Zakat diwajibkan bagi mereka yang memiliki tanaman dan buah-buahan, bukan pemilik tanah. - Harta untuk dipakai sendiri, seperti rumah dan perabotnya tidak dikenakan zakat. - Larangan mengeluarkan yang jelek dan tidak sah zakatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 267",
    "description": "Wahai orang-orang yang beriman! infakkanlah sebagian dari hasil usahamu yang baik-baik' dan diperoleh dengan cara yang halal, sebab Allah itu baik dan hanya menerima yang baik-baik. Dan sedekahkanlah sebagian dari apa yang kami keluarkan dari bumi berupa hasil pertanian, tambang, dan lainnya, untukmu. Pilihlah yang baik-baik dari apa yang kamu nafkahkan itu, walaupun tidak harus semuanya baik, tetapi janganlah kamu memilih secara sengaja yang buruk untuk kamu keluarkan guna disedekahkan kepada orang lain, padahal kamu sendiri kalau diberi yang buruk-buruk seperti itu tidak mau mengambilnya melainkan dengan memicingkan mata karena rasa enggan terhadapnya. Cobalah berempati. Posisikan dirimu seperti orang yang diberi. Jika kamu tidak mau menerima yang buruk-buruk, mengapa kamu berikan yang seperti itu kepada orang lain. Dan ketahuilah dan yakinlah bahwa Allah mahakaya, tidak membutuhkan sedekah kamu, baik pemberian untuknya maupun untuk makhluk-makhluk-Nya, sebab dia bisa memberi secara langsung. Sedekah itu justru untuk kemaslahatan orang yang memberi. Dia juga maha terpuji, antara lain karena dia memberi ganjaran terhadap hamba-hamba-Nya yang bersedekah. Setan, baik dari kalangan jin maupun manusia, selalu berusaha menjanjikan dengan cara membisiki dan menakuti kemiskinan kepadamu, misalnya dengan bersedekah harta akan berkurang, atau bahkan akan membuatmu terpuruk dalam kemiskinan, dan sebagainya. Dan setan juga selalu menyuruh kamu berbuat keji, yaitu segala sesuatu yang dianggap sangat buruk oleh akal sehat, budaya, agama, dan naluri manusia, antara lain kikir. Itulah ulah setan yang selalu menghalangi manusia untuk berbuat kebaikan, sedangkan Allah menjanjikan ampunan, sebab setiap sedekah yang kita keluarkan akan menghapuskan dosa. Dan selain itu Allah juga menjanjikan akan menambah karunia-Nya kepadamu jika kamu berinfak, sebab harta tidak berkurang dengan disedekahkan, justru sedekah akan menambah berkahnya. Bukan hanya itu, sedekah dan kedermawanan akan menghilangkan kecemburuan dan penyakit sosial lainnya di tengah masyarakat yang pada gilirannya akan menciptakan stabilitas sehingga kegiatan perekonomian akan semakin produktif dan karunia Allah bertambah. Dan Allah mahaluas ampunan, anugerah dan rahmat-Nya, maha mengetahui siapa yang berhak menerima itu semua."
  }
]