[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sikap kikir dan memilih barang buruk untuk sedekah, itu bersumber dari setan yang menghembuskan rasa kekhawatiran pada kalian terhadap kefakiran, memperdaya kalian dengan sikap kikir dan memerintahkan kalian untuk berbuat maksiat dan pelanggaran terhadap Allah. Dan Allah menjanjikan kepada kalian atas infak yang kalian keluarkan, janji berupa ampunan bagi dosa-dosa kalian dan rizki yang luas. Dan Allah Maha luas karuniaNya lagi Maha mengetahui amal perbuatan dan niat-niat kalian ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "268. \"Setan menakut-nakuti kalian dengan kemiskinan, menganjurkan kalian untuk kikir, dan mengajak kalian untuk berbuat dosa dan maksiat. Sedangkan Allah menjanjikan ampunan dan rezeki yang luas untuk kalian. Dan Allah Mahaluas anugerah-Nya lagi Maha Mengetahui keadaan hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "268. setan akan menakut-nakutimu dengan kemiskinan jika kalian berinfak atau hendak berinfak, serta akan memerintahkan kalian untuk berbuat maksiat. Sedangkan Allah menjanjikan ampunan atas kemaksiatan kalian dan rezeki yang luas atas infak yang kalian lakukan. Allah Maha Luas karunia-Nya dan Maha Mengetahui perkataan dan perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "268. الشَّيْطٰنُ يَعِدُكُمُ الْفَقْرَ (Syaitan menjanjikan (menakut-nakuti) kamu dengan kemiskinan ) Yakni menakut-nakuti kalian dengan kemiskinan agar tidak bersedekah. وَيَأْمُرُكُم بِالْفَحْشَآءِ ۖ (dan menyuruh kamu berbuat kejahatan) Yakni berbuat kemaksiatan dan mengeluarkan harta untuk bermaksiat, dan melakukan kebakhilan dalam menjalankan ketaatan. Dan yang dimaksud orang jahat menurut orang-orang arab adalah orang bakhil, karena besarnya keburukan dari sifat bakhil bagi mereka. وَاللهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ (sedang Allah menjadikan untukmu ampunan daripada-Nya) Makna (المغفرة) adalah penutupan Allah untuk hamba-Nya terhadap dosa-dosanya di dunia dan di akhirat. وَفَضْلًا ۗ (dan karunia ) Makna (الفضل) adalah Allah mengganti untuk orang yang bersedekah dengan sesuatu yang lebih baik dari pada yang ia sedekahkan, berupa kelapangan rezeki mereka, dan memberi mereka kenikmatan di akhirat dengan apa yang lebih baik, lebih banyak, lebih besar, dan lebih indah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnul qoyyim berkata : Inilah janji Allah, dan yang satu lagi janji syaithon; maka hendaklah orang bakhil dan munafiq melihat : dari dua janji itu kemana ia akan berpihak, dan kemana hati keduanya akan tenang, dan dengan janji yang mana dirinya akan bahagia, Allah menghendaki kebaikan bagi siapapun yang ia inginkan dan menelantarkan siapapun yang Ia kehendaki, dan Allah Maha Luas (karunia-Nya) lagi Maha Mengatahui. 2 ). Ketika engkau terbiasa berbuat baik dengan sedekah, lalu kemudian engkau membelenggunya takut akan kemiskinan, ketahuilah bahwasanya syaithon telah mengambil alih kepentingan itu : { الشَّيْطٰنُ يَعِدُكُمُ الْفَقْرَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "268. Setan membuat kalian mengkhawatirkan kefakiran ketika berinfak dengan membisikkan bahwa infak itu menghilangkan harta, dan memerintahkan kalian untuk berbuat kemaksiatan, bakhil, tidak berzakat, dan setiap kebaikan yang mengandung pahala akhirat. Al-Fakhis di sisi bangsa Arab adalah orang yang bakhil. Dan Allah itu menjanjikan ampunan atas dosa kalian, menutupinya di dunia dan akhirat, rejeki yang melimpah di dunia, dan pahala yang melimpah di akhirat ketika kalian berinfak. Dan Allah itu Maha memiliki keutamaan, dan Maha Mengetahui orang yang berinfak di jalanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setan menjanjikan kalian kemiskinan} menakut-nakuti kalian dengan kefakiran {dan menyuruh kalian berbuat keji} menghasut kalian untuk berbuat kikir {sedangkan Allah menjanjikan kalian ampunan dan karuniaNya} rejeki dan pengganti {Allah itu Maha luas lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "267-268 Allah menganjurkan kepada hamba-hambaNya untuk menginfakkan sebagian yang mereka dapatkan dalam berniaga, dan sebagian apa yang mereka panen dari tanaman dari biji-bjian maupun buah-buahan, hal ini mencakup zakat uang maupun seluruh dagangan yang dipersiapkan untuk di jual belikan, juga hasil pertanian dari biji-bijian dan buah-buahan, Termasuk dalam keumuman ayat ini, infak yang wajib maupun sunah. Allah memerintahkan untuk memilih yang baik dari itu semua dan tidak memilih yang buruk,yaitu yang jelek lagi rendah mutunya lalu mereka sedekahkan kerena Allah, yang seandainya mereka memberikan barang yang seperti itu kepada orang-orang yang berhak memerimanya, pastilah merekapun tidak akan meridhoinya, mereka tidak akan menerimanya kecuali dengan kedongkolan dan memicingkan mata. Maka yang seharusnya mengeluarkan yang tengah-tengah dari semua itu, dan yang paling sempurna adalah mengeluarkan yang paling baik. Dan yang dilarang adalah mengeluarkan yang jelek, kerena yang ini tidaklah memenuhi infak yang wajib dan tidak akan memperoleh pahala yang sempurna dalam infak yang sunah. “Dan ketahuilah bahwa Allah Maha Kaya Lagi Maha Terpuji.” Allah maha kaya atas seluruh makhluk, Allah maha kaya dari orang-orang yang berinfak, dan Allah maha kaya atas orang-orang yang taat. Allah memerintahkan hal itu kepada mereka dan menganjurkan mereka dan itu demi kemaslahatan mereka sendiri, dan semata-mata kerena karunia dan kemuliaanNya atas mereka. Di samping kesempurnaan kekayaanNya dan luasnya pemberiannya, Dia pun maha terpuji atas segala perkara yang di syariatkaNya untuk hamba-hambaNya dari hukum-hukum yang menyampaikan mereka ke negeri keselamatan. Dia terpuji dalam perbuatanya yang tidak akan keluar dari koridor karunia, keadilan, dan hikmahNya. Terpuji sipat-sipatNya, karena sipat-sipat Allah semuanya baik dan sempurna, sampai kepada eksistesinya dan tidak akan mengerti seperti apa sipat-sipat tersebut. Ketika Allah menganjurkan mereka berinfak yang berguna, Allah juga melarang mereka dari menahan harta mereka yang dapat merugikan, dan Allah menjelaskan kepada mereka bahwa mereka itu di antara dua seruan: Pertama, seruan yang Maha Penyayang, yang mengajak kepada kebaikan, menjanjikan kepadanya kebaikan, karunia, dan pahala yang segera maupun tertunda serta mengganti apa yang telah mereka infakan, dan Kedua seruan dari setan yang mengajak untuk menahan harta dan menakut-nakuti mereka bila mereka mengifakan harta mereka, pastilah mereka akan menjadi miskin. Siapa yang memenuhi seruan a-Rahman lalu ia menginfakan sebagian yang Allah rezekikan kepadanya, maka bergembiralah dengan ampunan dosa dan mendapatkan apa yang di carinya. Dan barang siapa yang mengikuti penyeru setan, maka sesungguhnya setan hanyalah mengajak kelompoknya agar menjadi penghuni-penghuni neraka. Karena itu, seorang hamba harus memilih di antara dua perkara yang lebih pantas dan cocok untuknya. Lalu Allah menutup ayat ini bahwasanya dia, ”Maha Luas (karunianya) Lagi Maha Mengetahui,” maksudnya, luas sipat-sipatNya, banyak pemberiaNya, Maha Mengetahui orang yang berhak di lipatgandakan pahalanya dari orang-orang yang beramal dan Maha Mengetahui orang yang pantas yang akan di bimbing kepada perbuatan kebajikan dan meninggalkan kemungkaran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يَعِدُكُمُ ٱلۡفَقۡرَ } Ya’idukumul faqra: Menakut-nakutimu dengan kefakiran agar kamu tidak mengeluarkan infaq di jalan Allah. { وَيَأۡمُرُكُم بِٱلۡفَحۡشَآءِۖ } wa ya’murukum bil fahsyâ’i: Mengajak kalian untuk melakukan perbuatan dosa seperti pelit dan bakhil. Makna ayat: Sedangkan dalam ayat (268) Allah Ta’ala memperingatkan hamba-hambaNya dari setan dan tipu dayanya dan memberi tahukan bahwa setan mencoba menakut-nakuti manusia dengan kefakiran sehingga mereka tidak mau mengeluarkan zakat, bersedekah, dan setan memerintahkan manusia untuk berbuat keji dengan mengeluarkan hartanya untuk keburukan dan kerusakan, serta pelit mengeluarkannya untuk kebaikan dan kepentingan umum. Adapun Allah Ta’ala memerintahkan manusia untuk berinfak serta menjanjikan kepada mereka ampunan bagi dosa-dosa karena sedekah dapat menghapuskan dosa dan itu merupakan anugerah dariNya. Allah Dialah pemberi rizki yang luas lagi baik, Dialah yang Maha pemurah memberikan nikmatNya dan Maha mengetahui hamba-hambaNya. Maka jawablah seruan Allah Ta’ala wahai orang-orang mukmin, dan berpalinglah dari seruan setan karena dia sejatinya adalah musuh kalian dan hanya menjanjikan keburukan serta memerintahkan untuk berbuat kebathilan dan keburukan. Pelajaran dari ayat: • Peringatan dari tipu daya setan dan kewajiban untuk memeranginya dengan berpaling dari was-was yang ditimbulkan dan menyelisihi perintahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 268: Jika kamu berinfak. Sifat bakhil dan memilih yang jelek dalam bersedekah berasal dari setan yang menakut-nakuti kita dengan kemiskinan. Inilah tipuannya yang terkesan menasehati, padahal ia mengajak ke dalam neraka. Yakni menyuruh berbuat maksiat dan melanggar perintah Allah, contohnya adalah bersikap kikir dan enggan membayar zakat. Yakni balasan yang lebih baik dari infak yang dikeluarkan baik di dunia maupun di akhirat, bisa berupa ganti di dunia seperti rziki yang banyak, kelapangan dada, ketenangan hati, ketentraman jiwa, kenikmatan sewaktu di kubur serta memperoleh pahalanya secara sempurna di akhirat, dan yang demikian tidaklah berat bagi-Nya karena Allah Mahaluas karunia-Nya. Di samping itu, Allah memerintahkan untuk berinfak dengan cara yang memudahkan dan tidak merugikan. Dia memerintahkan berinfak selebih keperluan. Terhadap amal dan niat kamu. Demikian juga infak yang kamu keluarkan, besar-maupun kecil dan secara sembunyi maupun terang-terangan, dan Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 268",
    "description": "Setan, baik dari kalangan jin maupun manusia, selalu berusaha menjanjikan dengan cara membisiki dan menakuti kemiskinan kepadamu, misalnya dengan bersedekah harta akan berkurang, atau bahkan akan membuatmu terpuruk dalam kemiskinan, dan sebagainya. Dan setan juga selalu menyuruh kamu berbuat keji, yaitu segala sesuatu yang dianggap sangat buruk oleh akal sehat, budaya, agama, dan naluri manusia, antara lain kikir. Itulah ulah setan yang selalu menghalangi manusia untuk berbuat kebaikan, sedangkan Allah menjanjikan ampunan, sebab setiap sedekah yang kita keluarkan akan menghapuskan dosa. Dan selain itu Allah juga menjanjikan akan menambah karunia-Nya kepadamu jika kamu berinfak, sebab harta tidak berkurang dengan disedekahkan, justru sedekah akan menambah berkahnya. Bukan hanya itu, sedekah dan kedermawanan akan menghilangkan kecemburuan dan penyakit sosial lainnya di tengah masyarakat yang pada gilirannya akan menciptakan stabilitas sehingga kegiatan perekonomian akan semakin produktif dan karunia Allah bertambah. Dan Allah mahaluas ampunan, anugerah dan rahmat-Nya, maha mengetahui siapa yang berhak menerima itu semuadia memberikan hikmah, yaitu kemampuan untuk memahami rahasia-rahasia syariat agama dan sifat bijak berupa kebenaran dalam setiap perkataan dan perbuatan kepada siapa yang dia kehendaki. Barang siapa diberi hikmah, sesungguhnya dia telah diberi kebaikan yang banyak, sebab dengan sifat bijak, urusan dunia dan akhirat menjadi baik dan teratur. Adakah kebaikan yang melebihi hidayah Allah kepada seseorang sehingga dapat memahami hakikat segala sesuatu secara benar dan proporsional' dan tidak ada yang dapat mengambil pelajaran kecuali orang-orang yang mempunyai akal sehat, sebab akal sehat yang tercerahkan dengan cahaya ketuhanan dapat mengetahui kebenaran hakiki tanpa dipengaruhi hawa nafsu. Maka sinarilah jiwa dengan cahaya ketuhanan bila ingin mendapat kebaikan yang banyak."
  }
]