[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menganugrahkan kebenaran dalam ucapan dan perbuatan kepada siapa saja yang dikehendakiNya dari hamba-hambaNya. Dan barang siapa telah Allah anugrahkan itu kepadanya, maka sungguh Dia telah memberinya kebaikan yang melimpah ruah. Dan tidak ada orang-orang yang mengingat-ingat ini dan mendapatkan manfaat darinya, kecuali orang-orang yang mempunyai akal-akal yang bersinar dengan cahaya dari Allah dan hidayah dariNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "269. Dia memberikan ketepatan dalam berbicara dan bertindak kepada para hamba yang Dia kehendaki. Dan siapa yang diberikan hal itu berarti dia telah diberikan kebaikan yang banyak. Dan tidak ada yang dapat mengambil pelajaran dengan ayat-ayat Allah kecuali orang-orang yang mempunyai akal sempurna, yang mendapatkan cahaya dan petunjuk dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "269. Allah memberikan ketepatan menuju kebenaran kepada siapa yang Dia kehendaki. Dan barangsiapa yang diberi hal ini maka Allah telah memberinya kebaikan yang besar. Dan tidak ada yang mengambil pelajaran dari hal ini melainkan orang-orang yang sehat akalnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "269. يُؤْتِى الْحِكْمَةَ ( Allah menganugerahkan al hikmah kepada siapa yang dikehendaki-Nya) Yakni berupa ilmu, dan pendapat lain mengatakan berupa pemahaman berbagai hal, terlebih lagi pemahaman terhadap al-Qur’an dan as-Sunnah. Dan pendapat lainnya mengatakan yakni berupa ketepatan dalam perkataan. وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِىَ خَيْرًا كَثِيرًا ۗ (Dan barangsiapa yang dianugerahi hikmah, ia benar-benar telah dianugerahi karunia yang banyak) Yakni besar ukurannya dan tinggi nilainya. Hal ini karena orang tersebut dapat meletakkan segala urusan pada tempatnya, dapat mengukur segala urusan dengan tepat, dan memiliki kemampuan dalam mengurus urusan tersebut. Dan ini merupakan kebaikan baginya dan bagi orang disekelilingnya, karena kebaikan yang ia perbuat dan keagungan apa yang ia lakukan dan ia seru."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "269. Allah memberi ilmu, pengertian tentang rahasia Al-Qur’an, pemahaman tentang berbagai perkara, terjadian suatu ucapan dan perbuatan, dan penempatan sesuatu pada tempatnya kepada hambaNya yang dikehendaki. Dan barangsiapa diberi hikmah (ilmu yang bermanfaat) maka sungguh dia telah meraik kebaikan dunia akhirat. Dan tidak ada yang bisa mengambil pelajaran dari hikmah-hikmah Al-Qur’an dan wahyu kecuali orang-orang yang memiliki akal sehat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menganugerahkan hikmah} anugerah dalam perkataan dan perbuatan {kepada siapa yang Dia kehendaki. Siapa yang dianugerahi hikmah, sungguh dia telah dianugerahi kebaikan yang banyak. Tidak ada yang dapat mengambil pelajaran} mengambil pelajaran {kecuali orang-orang yang berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "269. Tatkala Allah menjelaskan orang-orang yang menafkahkan hartanya, dan bahwa Allah-lah yang memberi kepada mereka dan mengaruniakan kepada mereka harta yang mampu mereka keluarkan nafkahnya di jalan-jalan kebaikan, dan dengan itu mereka memperoleh kedudukan yang mulia, Allah menyebut hal tersebut, yaitu Allah akan memberi hikmah kepada siapa yang di kehendakiNya dari hamba-hambaNya dan siapa yang dia kehendaki kebaikan padanya dari hamba-hambaNya. Hikmah itu adalah ilmu-ilmu yang bermanfaat yang bermanfaat, pengetahuan yang benar, akal yang lurus, pemikiran yang matang, dan terciptanya kebenaran dalam perkataan maupun perbuatan. Inilah anugrah yang paling utama dan karunia yang baik. karena itu Allah berfirman, ”Dan barang siapa yang dianugerahi hikmah, dia benar-benar telah di anugerahi karunia yang banyak.” karena dia telah keluar dari gelapnya kebodohan kepada cahaya petujuk, dari kepandingan penyimpangan perkataan dan kebenaran menuju tepatnya kebenaran padanya, serta terciptanya kebenaran, dan kerena ia telah menyempurnakan dirinya dengan kebajikan yang agung dan bermanfaat untuk makhluk dengan manfaat yang paling besar dalam agama dan dunia mereka. Seluruh perkara tidak akan berjalan baik kecuali dengan hikmah, yaitu meletakan segala sesuatu pada tempatnya dan menempatkan segala perkara pada posisinya masing-masing, mendahulukan perkara yang harus di dahulukan, megulur perkara yang memang harus di ulur. Akan tetapi perkara yang agung ini tidak akan di ingat dan tidak akan mengetahui derajat pemberian yang besar ini ”Kecuali orang-orang yang berakal.” mereka itu adalah orang-orang yang memiliki akal sehat dan cita-cita yang sempurna mereka itulah yang mengetahui yang berguna lalu mereka melakukanya dan juga mengetahui yang mudharat lalu mereka meninggalkannya. Kedua perkara ini yaitu mengarahkan nafkah harta-harta dan mengarahkan hikmah keilmuan adalah lebih utama bagi orang yang mendekatkan diri denganya kepada Allah dan perkara yang paling tinggi yang menyampaikanya kepada kemuliaan yang paling agung. ke dua perkara itulah yang disebutkan Nabi sholallohu lalaihi wasallam dalam sabdanya, ”Tidak boleh hasad kecuali dua perkara (pertama) seseorang di berikan oleh Allah harta lalu ia menguasainya dengan menghabiskannya dalam kebenaran, dan (kedua) seseorang yang di berikan oleh Allah al-Hikmah lalu dia mengajarkannya kepada manusia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱلۡحِكۡمَةَ } Al-ẖikmah: Memahami rahasia syariat dan menjaga Al-Qur’an dan sunnah. { أُوْلُواْ ٱلۡأَلۡبَٰبِ } Ulul Albâb: Orang-orang yang pandai punya akal cerdas dan mau memikirkan hal yang bermanfaat. Makna ayat: Pada ayat (269) Sesungguhnya Allah Ta’ala mendorong hamba-hambaNya untuk mempelajari ilmu yang bermanfaat, yaitu ilmu yang mendorong untuk melakukan amal shalih, dan hal itu hanya ada pada mempelajari Al-Qur’an dan sunnah dengan cara menghafalnya dan memahami keduanya. Allah Ta’ala berfirman; “Allah memberikan hikmah (kepahaman yang dalam tentang Al-Qur’an dan As-Sunnah) kepada siapa saja yang dikehendakinya.” Yaitu kepada siapa saja yang mencarinya dan senang untuk mendapatkannya, sambil meminta kepada Allah untuk mengajarinya. Pada akhir ayat Allah mengabarkan bahwa siapa yang diberikan hikmah maka sungguh telah diberikan kebaikan yang banyak. Maka hendaknya orang yang berakal mencari hikmah sebelum mencari kekayaan duniawi. Ini adalah pengingat sebagaimana disebutkan dalam firmanNya; “Dan tidak ada yang mengambil peringatan itu keucali orang-orang yang berakal.” Pelajaran dari ayat: • Memenuhi seruan Allah dan beramal sesuai dengan petunjukNya. • Keutamaan ilmu di atas harta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 269: Hikmah ialah kemampuan untuk memahami rahasia syari'at agama. Ada pula yang menafsirkan \"pemahaman yang dalam tentang Al Qur'an dan As Sunnah\" dan ada yang menafsirkan \"tepat dalam berkata dan bertindak.\" Yang lain berpendapat bahwa hikmah adalah ilmu yang bermanfaat yang membuahkan amal serta mengetahui rahasia-rahasia syari'at. Karena hal itu dapat membawanya kepada kebahagiaan di dunia dan di akhirat. Oleh karena itu, warisan para nabi adalah ilmu, bukan harta atau lainnya. Seorang yang memiliki hikmah dapat menyempurnakan jati dirinya, ia mengetahui yang hak dan mengetahui maksudnya. Dalam bertindak, ia mengerjakan yang baik dan meninggalkan yang buruk. Dengan demikian, muncullah sikap tepat baik dalam berbicara maupun dalam bertindak serta dapat memposisikan sesuatu pada tempatnya baik bagi dirinya maupun orang lain. Tanpa yang demikian, seseorang tidak mungkin dapat sempurna. Syaikh As Sa'diy berkata: \"Allah Subhaanahu wa Ta'aala menciptakan hamba-hamba-Nya di atas fitrah beribadah kepada-Nya, mencintai yang baik dan mencari yang hak. Allah mengutus para rasul untuk mengingatkan mereka apa yang sebelumnya terpendam dalam fitrah dan akal mereka serta menerangkan apa saja yang belum mereka ketahui. Ketika itu, manusia terbagi menjadi dua golongan; golongan yang menyambut seruan mereka (para rasul) sehingga mereka ingat terhadap hal yang memberi mereka manfaat, mereka pun mengerjakannya, dan terhadap hal yang memadharatkan mereka, maka mereka tinggalkan. Mereka inilah orang-orang yang memiliki daya pikir dan akal yang sempurna. Sedangkan golongan yang satu lagi tidak menyambut seruan mereka, bahkan mereka lebih memilih perkara rusak yang datang menghampiri fitrah mereka, mereka pun meninggalkan ketaatan kepada Rabbu manusia, oleh karena itu mereka bukanlah orang-orang yang berakal.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 269",
    "description": "Dia memberikan hikmah, yaitu kemampuan untuk memahami rahasia-rahasia syariat agama dan sifat bijak berupa kebenaran dalam setiap perkataan dan perbuatan kepada siapa yang dia kehendaki. Barang siapa diberi hikmah, sesungguhnya dia telah diberi kebaikan yang banyak, sebab dengan sifat bijak, urusan dunia dan akhirat menjadi baik dan teratur. Adakah kebaikan yang melebihi hidayah Allah kepada seseorang sehingga dapat memahami hakikat segala sesuatu secara benar dan proporsional' dan tidak ada yang dapat mengambil pelajaran kecuali orang-orang yang mempunyai akal sehat, sebab akal sehat yang tercerahkan dengan cahaya ketuhanan dapat mengetahui kebenaran hakiki tanpa dipengaruhi hawa nafsu. Maka sinarilah jiwa dengan cahaya ketuhanan bila ingin mendapat kebaikan yang banyak. Dan apa pun infak yang kamu berikan, berupa harta atau lainnya, sedikit atau banyak, berdasar kewajiban atau anjuran Allah, atau nazar yang kamu janjikan, yaitu janji dengan mewajibkan diri melakukan suatu kebajikan yang tidak diwajibkan oleh Allah untuk mendekatkan diri kepada-Nya, maka sungguh, Allah mengetahuinya, sebab dia maha mengetahui segala apa yang kamu niatkan. Siapa yang tidak melaksanakan kewajiban infak dan tidak menepati janjinya, yaitu bernazar tetapi tidak melaksanakannya atau tidak memenuhi hak Allah, maka dia termasuk orang yang zalim, dan bagi orang zalim tidak ada seorang penolong pun yang dapat menyelamatkannya dari azab Allah."
  }
]