[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang melanggar perjanjian Allah yang telah Dia ambil dari mereka untuk bertauhid dan taat kepada-Nya. padahal Allah telah menegaskan isi perjanjian itu dengan mengirim para rasul dan menurunkan kitab-kitab-Nya. Namun mereka menyelisihi aturan agama Allah seperti dengan memutus tali silaturahim dan menebar kerusakan di muka bumi. Mereka itu adalah orang-orang yang rugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Yaitu orang-orang yang melanggar perjanjian dengan Allah bahwa mereka hanya akan menyembah kepada Allah semata dan mengikuti Rasul-Nya yang telah diberitakan oleh para rasul sebelumnya. Ciri-ciri orang yang mengingkari perjanjian-perjanjian dengan Allah adalah mereka memutuskan hal-hal yang Allah perintahkan untuk disambung seperti tali silaturrahim, dan berusaha menyebarkan kerusakan di muka bumi dengan malakukan kemaksiatan. Mereka itulah orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Sebagian ciri-ciri dari orang-orang kafir tersebut adalah mereka melanggar perjanjian yang telah Allah ambil dari mereka yaitu agar mereka beriman kepada Allah dan mentaati-Nya, dan mereka melanggar perintah-perintah-Nya, seperti memutus tali silaturrahim, memboikot Rasulullah, dan menyebarkan kerusakan di muka bumi. Mereka adalah orang-orang yang mengharamkan diri mereka sendiri dari kehidupan yang baik di dunia dan surga di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. الَّذِيْنَ يَنْقُضُوْن عَهْدَ اللّٰهِ مِنْۢ بَعْدِ مِيْثَاقِهٖۖ ((yaitu) orang-orang yang melanggar perjanjian Allah sesudah perjanjian itu teguh) makna (النقض) adalah perusakan apa yang telah kokoh baik itu berupa bangunan, tali, ataupun perjanjian. Dan makna perjanjian Allah adalah perjanjian yang Allah ambil atas mereka yang terdapat dalam al-Qur’an yang mereka setujui dan sepakati untuk taat dan mengikutinya. وَيَقْطَعُوْنَ مَآ اَمَرَ اللّٰهُ بِهٖٓ اَنْ يُّوْصَلَ (dan memutuskan apa yang diperintahkan Allah (kepada mereka) untuk menghubungkannya) Yakni menghubungkan/menyambungkan tali silaturrahim dan kekerabatan. وَيُفْسِدُوْنَ فِى الْاَرْضِۗ (dan membuat kerusakan di muka bumi) Yakni dengan mengerjakan kemaksiatan di muka bumi. اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ (Mereka itulah orang-orang yang rugi) Yakni dengan menjadi ahli neraka. Tidak seperti apa yang mereka kira bahwa jika mereka mengingkari perjanjian Allah maka mereka akan mendapat kemaslahatan yang mereka inginkan. Padahal sesungguhnya menepati perjanjian dengan Allah merupakan maslahat terbesar yang telah mereka sia-siakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang fasik adalah orang-orang yang merusak perjanjian, melanggar apa yang diperintahkan dan dijanjikan Allah kepada mereka berupa keimanan, setelah melakukan perjanjian dan memperkuatnya dengan lisan-lisan semua rasul; memotong hubungan silaturahmi, hubungan kerabat dan menjauhi orang-orang mukmin; dan melakukan kemaksiatan di bumi, menghalangi manusia untuk beriman kepada risalah Muhammad SAW. Dan mereka semua adalah penduduk neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) orang-orang yang melanggar} orang orang yang melanggar dan mengabaikan {janji Allah} perintah Allah yang telah Dia wajibkan kepada mereka untuk beribadah kepada hanya kepadaNya dan mengikuti nabi Muhammad SAW {setelah (perjanjian) itu diteguhkan} meneguhkan janji itu dengan sumpah {dan mereka memutuskan sesuatu yang diperintahkan oleh Allah untuk disambung, dan berbuat kerusakan di bumi. Mereka itulah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “ Yaitu orang-orang yang melanggar perjanjian Allah sesudah perjanjian itu diteguhkan.” Hal ini bersifat umum yang meliputi perjanjian antara mereka dengan Rabb mereka, atau juga perjanjian yang terjadi antara mereka dengan sesama makhluk, yang dikukuhkan atas mereka dengan ikatan-ikatan yang erat dan komitmen-komitmen, namun mereka tidak peduli terhadap ikatan-ikatan tersebut bahkan mereka membatalkannya dan mereka meninggalkan perintah-perintahNya, dan mereka juga membatalkan janji-janji antara mereka dengan sesama makhluk. “dan memutuskan apa yang diperintahkan Allah (kepada mereka) untuk menghubungkannya.” Banyak hal yang termasuk kedalam ayat ini, dan Allah ta’ala telah memerintahkan kepada kita untuk menghubungkan antara kita dengan DiriNya yaitu dengan keimanan kepadaNya, melaksanakan ibadah hanya semata kepadaNya, atau antara kita dengan rosulNya yaitu dengan beriman kepada beliau, mencintai beliau, menghormati beliau, menunaikan segala hak-hak beliau, atau di antara kita dengan kedua orang tua, karib kerabat, teman sahabat dan seluruh makhluk yaitu dengan menunaikan hak-hak mereka yang mana Allah memerintahkan untuk bersilaturahim. Adapun orang-orang Mukmin, maka mereka akan menyambung silaturahim yang telah Allah perintahkan untuk di sambung dari hak-hak tersebut, dan mereka menunaikannya dengan sebaik-baik pelaksanaan, sedangkan orang-orang fasik maka mereka memutuskannya dan membuangnya dari diri mereka dan menggantikannya dengan kefasikan, memutus hubungan, dan melakukan kemaksiatan, yaitu berbuat kerusakan di muka bumi. “Mereka itulah, ” yakni orang-orang yang memiliki sifat seperti itu adalah, “orang-orang yang merugi,” di dunia dan akhirat. Allah membatasi kerugian itu hanya bagi mereka, karena kerugian mereka itu bersifat umum dalam segala kondisi mereka yang tidak ada sama sekali percikan dari keuntungan, karena setiap amalan shalih syaratnya adalah keimanan, maka barangsiapa yang tidak memiliki keimanan, niscaya ia tidak memiliki nilai amal, dan kerugian ini adalah kerugian kekufuran. Adapun kerugian yang terkadang menjadi kekufuran dan terkadang menjadi kemaksiatan dan terkadang menjadi suatu tindakan kelalaian dalam meninggalkan kesunnahan, sebagaimana disebutkan dalam firman Allah ta'ala : \"Sesungguhnya manusia itu benar-benar dalam kerugian,\" (QS. Al-Ashr : 2) Maka ini bersifat umum untuk seluruh makhluk, kecuali orang-orang yang bersifat dengan keimanan, amalan shalih, saling nasihat menasihati kepada kebenaran dan saling nasihat menasihati dengan kesabaran;maka pada hakikatnya adalah hilangnya kebaikan yang mana seorang hamba itu bertujuan memperolehnya dan itu masih dalam kemampuannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : يَنقُضُونَ : Menguraikan simpul yang telah terjalin. عَهۡدَ ٱللَّهِ : Perjanjian yang Allah buat dengan manusia agar beriman, taat kepadaNya dan kepada rasulNya. مِنۢ بَعۡدِ مِيثَٰقِهِ : Setelah terjalinnya ikatan dengan sumpah ataupun persaksian untukNya. وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ : Memotong apa yang Allah perintahkan untuk disambung berupa keimanan, tauhid, ketaatan, dan menyambung silaturahim. وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ : Berbuat kerusakan di muka bumi dengan cara berbuat kekufuran dan bergelimang kemaksiatan. ٱلۡخَٰسِرُونَ : Orang yang benar-benar merugi dimana kerugian itu menimpa dirinya dan keluarganya di hari kiamat nanti. Makna ayat : Allah hanya menyesatkan orang-orang yang fasik, yaitu mereka yang disebutkan sifat-sifatnya dalam firmanNya: ٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِۚ “Yaitu orang-orang yang melanggar perjanjian Allah sesudah perjanjian itu teguh, dan memutuskan apa yang diperintahkan Allah (kepada mereka) untuk menghubungkannya dan membuat kerusakan di muka bumi.” Allah menghukumi mereka dengan kerugian yang total pada hari kiamat nanti dengan firmanNya; “Merekalah orang-orang yang rugi” Pelajaran dari ayat : 1. Apabila Allah menurunkan kebaikan berupa petunjuk dan selainnya maka orang mukmin akan bertambah hidayah dan kebaikannya, sedangkan orang kafir akan bertambah kesesatan dan keburukannya. Hal ini dikarenakan memang potensi penerimaan terhadap apa yang diturunkan Allah antara jiwa dua kelompok ini memang berbeda. 2. Peringatan keras terhadap kefasikan dan pengikutnya berupa melepaskan perjanjian, memutus kebaikan, dan melarang dari perbuatan baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 27: Kemudian Allah menjelaskan bahwasanya mereka orang-orang yang fasik orang-orang yang keluar dari ketaatan kepada Allah adalah mereka yang mengingkari perjanjian antara mereka dengan Allah , begitu juga mengingkari perjanjian antara mereka dengan makhluk rumah dan juga mereka menyelisihi perintah-perintah Allah untuk menyambung silaturahmi . mereka memutus tali silaturahim dan menyebarkan kerusakan serta kesehatan di bumi ; Oleh sebab itu mereka adalah orang-orang yang merusak di dunia maupun di akhirat ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal mereka telah berjanji untuk mentauhidkan Allah Ta'ala dan menta'ati-Nya serta beribadah kepada-Nya sebagai amanah yang dibebankan kepada mereka ketika langit, bumi dan gunung enggan memikulnya karena khawatir tidak bisa melaksanakan, diperkuat lagi dengan diutusnya para rasul dan diturunkan kitab-kitab agar mereka mau memenuhi amanah itu. Di samping itu, mereka juga melanggar ajaran Allah seperti dengan memutuskan tali silaturrahim dan menyebarkan kerusakan di muka bumi, mereka itulah orang-orang yang rugi di dunia dan akhirat. Ada yang menafsirkan sebagai menyambung tali silaturrahim dan ada yang menafsirkan lebih luas lagi, yaitu memutuskan apa yang diperintahkan Allah untuk disampaikan berupa hak-hak. Kepada Allah Ta'ala, seperti dengan beriman dan beribadah kepada-Nya. Kepada rasul-Nya, seperti dengan beriman kepadanya, mencintainya, membelanya dan memenuhi hak-haknya. Demikian juga termasuk ke dalamnya memenuhi hak orang tua, kerabat dan orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 27",
    "description": "Orang-orang fasik itu adalah orang-orang yang melanggar perjanjian Allah setelah perjanjian itu diteguhkan, yaitu perjanjian dalam diri setiap manusia yang muncul secara fitrah dan didukung dengan akal dan petunjuk agama sebagaimana dijelaskan pada surah al-a 'ra'f/7: 172, dan memutuskan apa yang diperintahkan Allah untuk disambungkan, seperti menyambung persaudaran dan hubungan kekerabatan, berkasih sayang, dan saling mengenal sesama manusia, dan berbuat kerusakan di bumi dengan perilaku tidak terpuji, menyulut konflik, mengobarkan api peperangan, merusak lingkungan, dan lainnya. Mereka itulah orangorang yang rugi karena telah menodai kesucian fitrah dan memutus hubungan dengan orang lain. Dengan demikian, mereka akan mendapatkan kehinaan di dunia dan siksaan di akhirat. Sungguh mengherankan perbuatan kamu itu, wahai orang-orang musyrik! bagaimana kamu ingkar kepada Allah yang maha esa dengan mempersekutukan-Nya, padahal bukti keesaan-Nya ada dalam diri kamu, yaitu kamu yang tadinya mati dan belum berupa apa-apa, lalu dia menghidupkan kamu dari tiada, kemudian dia mematikan kamu setelah tiba ajal yang ditetapkan untukmu, lalu dia menghidupkan kamu kembali pada hari kebangkitan. Kemudian hanya kepada-Nyalah kamu dikembalikan untuk dimintai pertanggungjawaban dan mendapat balasan atas segala amal perbuatan."
  }
]