[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa saja yang kalian berikan dari jenis harta atau lainnya, banyak atau sedikit, yang kalian sedekahkan demi mengharap keridhaan Allah atau sesuatu (nadzar) yang kalian wajibkan atas diri kalian dari jenis harta atau lainnya, maka sesungguhnya Allah mengetahuinya. Dia mengetahui niat-niat kalian, dan akan memberikan balasan pada kalian atas amal perbuatan itu. Dan barangsiapa menahan hak Allah, maka dia adalah orang dzhalim. Orang-orang dzhalim tidak memiliki seorang pun penolong yang menolong mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "270. Apa saja yang kalian infakkan -sedikit atau banyak- untuk menggapai rida Allah, atau ibadah apa saja yang kalian jalankan secara rutin dari dirimu sendiri dan tidak dibuat-buat, sesungguhnya Allah mengetahui semuanya. Maka tidak satupun yang akan sia-sia di sisi-Nya. Dan Dia akan memberi kalian balasan atas hal itu dengan balasan yang sebesar-besarnya. Sedangkan orang-orang zalim yang menolak menjalankan kewajiban mereka dan melanggar batas-batas Allah tidak memiliki penolong yang dapat melindungi mereka dari azab di hari kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "270. harta yang kalian infakkan -baik itu banyak maupun sedikit- atau nazar yang kalian tetapkan atas diri kalian -baik itu berupa harta atau amal shalih- maka sungguh Allah Maha Mengetahuinya, dan dia akan memberi kalian pahala. Dan orang-orang yang merampas hak-hak orang lain tidak akan memiliki penolong pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "270. وَمَآ أَنفَقْتُم مِّن نَّفَقَةٍ (Apa saja yang kamu nafkahkan ) Yakni sesungguhnya Allah mengetahuinya dan membalasnya. أَوْ نَذَرْتُم مِّن نَّذْرٍ (atau apa saja yang kamu nazarkan ) Nadzar adalah mengharuskan diri untuk mentaati Allah atas sesuatu yang sebenarnya tidak diharuskan untuknya sehingga itu menjadi sesuatu yang wajib baginya untuk ia tunaikan. فَإِنَّ اللهَ يَعْلَمُهُۥ ۗ (maka sesungguhnya Allah mengetahuinya ) Dalam potongan ayat ini terdapat janji dan ancaman. وَمَا لِلظّٰلِمِينَ مِنْ أَنصَارٍ (Orang-orang yang berbuat zalim tidak ada seorang penolongpun baginya ) Yakni tidak ada penolong bagi orang-orang yang zalim disebabkan dosa melanggar perintah untuk bersedekah dan menunaikan nadzar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "270. Infak yang kalian belanjakan untuk mendapatkan ridha Allah, maka Allah itu mengetahuinya dan akan membalas kalian atas hal itu. Dia juga mengetahui nadzar kalian. Nadzar adalah melakukan kewajiban untuk mendekatkan diri yang mana Allah tidak mewajibkannya, sehingga orang yang bernadzar harus menepatinya dengan menaatinya dan tidak mengingkarinya. Dan tidaklah bagi orang-orang zalim yang tidak menunaikan zakat dan nafkah wajib, melainkan membelanjakan hartanya dalam kemaksiatan itu penolong-penolong yang melindungi mereka dari azab, akibat dosa mereka, dan menentang perintah untuk berinfak dan menepati nadzar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesuatu yang kalian infakkan atau sesuatu yang kalian nazarkan} kalian mewajibkan diri kalian untuk melakukan ketaatan yang tidak membuat kalian tidak terbebani {sesungguhnya Allah mengetahuinya. Bagi orang-orang zalim tidak ada satu pun penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "270-271. Allah mengabarkan bahwa bagaimanapun orang-orang yang berinfak itu menginfakkan hartanya, orang-orang yang besedekah itu menyedekahkan harta dan orang-orang yang bernadzar itu menunaikan nadzarnya, sesungguhnya Allah mengetahui semua itu. Kandungan dari kabar tentang pengetahuanNya itu menunjukkan tentang adanya balasan, dan bahwa Allah tidak akan melalaikannya di sisiNya walau seberat biji atom. Allah mengetahui apa yang terbersit dalam hati dan niat yang baik maupun yang buruk. Dan bahwasanya orang-orang yang zhalim yang tidak mengajarkan apa yang telah diwajibkan oleh Allah atas mereka, atau mereka melanggar apa yang telah Allah haramkan atas mereka; mereka tidak memiliki seorang penolong pun selainNya yang mampu menolong dan melindungi mereka. Mereka pasti akan dihukum. Allah mengabarkan juga bahwa sedekah yang ditampakkan oleh orang yang bersedekah itu adalah baik, dan bila dia menyembunyikannya dan menyerahkannya kepada orang yang fakir adalah lebih utama, karena menyembunyikan sedekah kepada orang fakir adalah lebih utama, karena menyembunyikan sedekah kepada orang fakir adalah kebaikan lain dan juga hal itu menunjukkan kuatnya keikhlasan. Salah satu dari tujuh kelompok yang akan dinaungi oleh naungan Allah di Hari Kiamat nanti adalah orang yang bersedekah dengan sebuah pemberian , lalu dia menyembunyikannya hingga tangan kirinya tidak mengetahui apa yang disedekahkan oleh tangan kanannya. Dan dalam firman Allah, “ Dan jika kamu menyembunyikannya dan kamu berikan kepada orang-orang fakir, maka menyembunyikan itu lebih baik bagimu,” terkandung sebuah faidah yang lembut yaitu bahwa tindakan menyembunyikan sedekah adalah lebih baik daripada menampakkannya apabila anda memberikannya kepada seorang fakir. Adapun bila anda menafkahkan harta dalam kegiatan-kegiatan social, dalam ayat ini tidak ada indikasi yang menunjukkan tentang keutamaan menyembunyikan infak, bahkan ada sebuah kaidah syariat yang menunjukkan perlunya mempertimbangkan kemaslahatan, sehingga mungkin saja menampakkannya untuk memberikan suri tauladan dan contoh, serta mendorong orang lain untuk berbuat dengan amalan kebaikan (yang sama), akan menjadi lebih baik. Dan FirmanNya, “Dan Allah akan menghapuskan darimu sebagian kesalahan-kesalahanmu.” Dalam ayat ini terdapat indikasi bahwa dalam sedekah terkumpul dua hal: pertama, memperoleh kebaikan, yaitu banyaknya balasan baik dan pahala serta ganjarannya, dan kedua, menolak kejahatan dan musibah dunia dan akhirat dengan penghapusan dosa-dosa, “dan Allah mengetahui apa yang kamu kerjakan,” maka Allah membalas dengan hikmahNya setiap orang sesuai amal-amalnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { مِّن نَّفَقَةٍ } Min nafaqatin: Nafkah yang dikeluarkan baik sedikit ataupun banyak, bagus ataupun jelek. {مِّن نَّذۡرٖ } Min nadzrin: Nadzar adalah mewajibkan sesuatu kepada diri sendiri yang tidak diwajibkan oleh syariat agama. Seperti perkataan seseorang,”Saya mewajibkan diri kepada Allah untuk bersedekah sebanyak sekian ribu, atau akan berpuasa sekian hari, atau akan shalat sekian raka’at. Bisa juga dengan mengatakan,”Apabila saya mendapatkan suatu kebaikan saya akan melakukan ini atau itu yang termasuk amalan ketaatan.” Makna ayat: Setelah Allah menyeru hamba-hambaNya untuk berinfak pada ayat sebelumnya, Allah mengabarkan bahwa Dia mengetahui apa yang disedekahkan oleh hamba-hambaNya. Apabila sesuatu yang disedekahkan baik maka Allah mengetahui dan akan membalasnya, apabila yang disedekahkan sesuatu yang jelek lagi buruk Allah mengetahui dan akan membalasnya. Allah Ta’ala berfirman kepada hamba-hambaNya yang mukmin; “Dan apa saja yang kamu nafkahkan atau nadzarkan, sesungguhnya Allah mengetahuinya.” Selama infak yang dikeluarkan dipakai untuk mencari ridha Allah dan merupakan harta yang baik, maka Allah akan menghapuskan dosa-dosannya dan mengangkat derajatnya. Namun, apabila yang dinafkahkan harta yang buruk dan nazarnya ditujukan kepada selain Allah Ta’ala maka ia termasuk orang-orang yang zhalim dan akan dibalas sedekah dan nazarnya kepada selain Allah, mereka tidak akan mendapati orang yang memberikan ganjaran untuk mereka, karena mereka itu orang –orang zhalim dimana mereka meletakkan sesuatu tidak pada tempatnya. Firman Allah,”Orang-orang yang berbuat zhalim, tidak ada seorang penolongpun bagi mereka. Inilah kandungan ayat (270). Pelajaran dari ayat: • Terdapat anjuran untuk bersedekah walaupun hanya sedikit dan terdapat peringatan agar tidak terjatuh dalam riya’ serta mengeluarkan sedekah dari harta yang jelek."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 270: Baik zakat maupun sedekah. Nazar yaitu janji untuk melakukan sesuatu ibadah kepada Allah Subhaanahu wa Ta'aala untuk mendekatkan diri kepada-Nya baik dengan syarat ataupun tidak. Ayat di atas menerangkan bahwa apa saja yang kita infakkan baik harta atau pun lainnya, banyak atau sedikit, demikian juga ibadah atau sedekah yang kita wajibkan kepada diri kita karena mencari ridha Allah, maka sesungguhnya Allah mengetahuinya. Dia melihat niat kita kemudan akan memberikan balasan terhadapnya. Adapun orang yang tidak memenuhi hak Allah seperti orang yang enggan berzakat atau orang yang mengeluarkan harta bukan pada tempatnya misalnya untuk maksiat, maka dia adalah orang yang zhalim, sedangkan orang-orang yang zhalim tidak memiliki penolong pun yang menolong mereka dari azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 270",
    "description": "Dan apa pun infak yang kamu berikan, berupa harta atau lainnya, sedikit atau banyak, berdasar kewajiban atau anjuran Allah, atau nazar yang kamu janjikan, yaitu janji dengan mewajibkan diri melakukan suatu kebajikan yang tidak diwajibkan oleh Allah untuk mendekatkan diri kepada-Nya, maka sungguh, Allah mengetahuinya, sebab dia maha mengetahui segala apa yang kamu niatkan. Siapa yang tidak melaksanakan kewajiban infak dan tidak menepati janjinya, yaitu bernazar tetapi tidak melaksanakannya atau tidak memenuhi hak Allah, maka dia termasuk orang yang zalim, dan bagi orang zalim tidak ada seorang penolong pun yang dapat menyelamatkannya dari azab Allah jika kamu menampakkan sedekah-sedekahmu, baik yang wajib seperti zakat, maupun yang sunah, bukan untuk tujuan ria dan pamer, maka itu baik selama itu didasari keikhlasan, sebab dapat mendorong orang lain bersedekah dan menutup pintu prasangka buruk yang menjerumuskan pelakunya ke dalam dosa. Dan jika kamu menyembunyikannya dan memberikannya kepada orang-orang fakir, maka itu lebih baik bagimu sebab itu dapat menghindari kamu dari sifat ria dan pamrih serta lebih memelihara air muka kaum fakir yang menerima. Dan dengan bersedekah dari harta yang halal dan disertai keikhlasan Allah akan menghapus sebagian kesalahan-kesalahanmu, yang berupa dosa-dosa kecil, bukan dosa besar dan bukan juga yang terkait dengan hak orang lain. Kebajikan yang dilakukan dengan ikhlas dapat menghapuskan dosa-dosa kecil seperti disebut dalam surah hud/11: 114. Dan Allah mahateliti dan maha mengetahui terhadap apa yang kamu kerjakan, dan dia akan memberi balasan yang setimpal."
  }
]