[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian menampakkan apa yang kalian sedekahkan karena Allah, maka itulah sebaik-baik sedekah yang kalian sedekahkan. Dan apabila kalian merahasiakannya dan kalian berikan kepada orang-orang fakir miskin, maka itu lebih utama bagi kalian. Sesungguhnya itu dikarenakan lebih menjauhkan diri dari riya. Dan dalam sedekah (yang disertai keikhlasan) terdapat penghapusan dosa-dosa kalian. Dan Allah, Dzat yang mengetahui rincian-rincian seluruh perkara, tidak ada sesuatu dari keadaan kalian yang tersembunyi bagiNya, dan Dia akan memberikan masing-masing orang sesuai dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "271. Apabila kalian memperlihatkan harta yang kalian sedekahkan, maka sebaik-baik sedekah ialah sedekah kalian. Namun apabila kalian menyembunyikannya dan memberikannya kepada orang-orang fakir, maka itu lebih baik bagi kalian daripada memperlihatkannya, karena (sedekah yang disembunyikan) itu lebih dekat kepada ikhlas. Sedekah yang diberikan oleh orang-orang yang ikhlas dapat menutupi dosa-dosa mereka dan mendatangkan ampunan Allah. Dan Allah Maha Mengetahui apa yang kalian perbuat, sehingga tidak ada sedikitpun keadaan kalian yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "271. Jika kalian menampakkan sedekah kalian tanpa ada rasa riya’ maka hal itu baik bagi kalian. Dan jika kalian bersedekah kepada fakir miskin secara sembunyi- sembunyi maka yang demikian lebih baik daripada menampakkannya. Sedekah-sedekah ini dapat menghapus dosa kalian. Dan Allah Maha Mengetahui segala yang kalian kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "271. إِن تُبْدُوا۟ الصَّدَقٰتِ ( Jika kamu menampakkan sedekah(mu)) Yakni jika kalian menampakkan sedekah kalian maka itu adalah sesuatu yang baik. وَإِن تُخْفُوهَا (Dan jika kamu menyembunyikannya ) Yakni jika kalian mengeluarkan sedekah secara rahasia dan kalian tetap bisa menyalurkannya kepada orang-orang fakir maka itu adalah lebih baik bagi kalian. Dan keutamaan ini ada pada sedekah sunnah, adapun pada (zakat) sedekah wajib maka tidak terdapat keutamaan untuk menyembunyikannya. Bahkan dikatakan bahwa menampakkannya lebih baik. وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمْ ۗ (Dan Allah akan menghapuskan dari kamu sebagian kesalahan-kesalahanmu) Yakni menghapuskannya dengan sedekah secara terang-terangan maupun secara rahasia. Dalam hadist Imam Bukhari dan Muslim dari Abu Hurairah bahwa Rasulullah bersabda: Tujuh golongan yang akan dinaungi oleh Allah dengan naungannya di hari yang tidak ada naungan kecuali naungannya: pemimpin yang adil, pemuda yang tumbuh dalam ketaatan kepada Allah, dua orang yang saling mencintai karena Allah yang berkumpul karena-Nya dan berpisah karena-Nya, orang yang hatinya terpaut dengan masjid apabila ia keluar darinya sampai ia kembali, orang yang berzikir kepada Allah dalam keadaan sendiri lalu menetes air mata dari kedua matanya, orang yang diajak berzina oleh wanita yang memiliki derajat dan kecantikan lalu ia berkata “aku takut kepada Allah”, dan orang yang bersedekah lalu ia merahasiakannya sampai tangan kirinya tidak mengetahui apa yang disedekahkan oleh tangan kanannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pengorbanan yang luas dan ketulusan yang disertai dengan belas kasihan, akan mensucikan dosa dan menghapuskan kesalahan-kesalahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "271. Jika kalian menampakkan sedekah sukarela maka hal itu baik supaya kalian bisa ditiru, maka perbuatan kalian itu baik, yaitu menampakkan sedekah itu baik. Dan jika kalian mengeluarkan sedekah secara rahasia atau kalian memberi sedekah orang-orang fakir secara rahasia maka hal itu lebih baik bagi kalian daripada menampakkannya untuk menjauhkan diri dari riya’. Allah akan menghapus dosa-dosa kalian sesuai takaran infaq kalian. Dan Allah itu mengawasi perbuatan kalian berupa menampakkan atau merahasiakan sedekah. Adapun zakat yang wajib itu lebih baik ditampakkan supaya ditiru oleh orang yang berzakat. Al-kalbi berkata: “Ketika firman Allah {Wa maaa anfaqtum min nafaqatin} turun, orang-orang bertanya: “Wahai rasulullah, manakah yang lebih utama, sedekah yang rahasia atau yang terang-terangngan?” Lalu Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menampakkan} jika kalian menunjukkan {sedekah, maka itu baik} maka kebaikan sesuatu yang ditunjukkan itu adalah sedekah {Jika kalian menyembunyikannya dan memberikannya kepada orang-orang fakir, maka itu lebih baik bagi kalian. Allah akan menghapus kesalahan kalian. Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "270-271. Allah mengabarkan bahwa bagaimanapun orang-orang yang berinfak itu menginfakkan hartanya, orang-orang yang besedekah itu menyedekahkan harta dan orang-orang yang bernadzar itu menunaikan nadzarnya, sesungguhnya Allah mengetahui semua itu. Kandungan dari kabar tentang pengetahuanNya itu menunjukkan tentang adanya balasan, dan bahwa Allah tidak akan melalaikannya di sisiNya walau seberat biji atom. Allah mengetahui apa yang terbersit dalam hati dan niat yang baik maupun yang buruk. Dan bahwasanya orang-orang yang zhalim yang tidak mengajarkan apa yang telah diwajibkan oleh Allah atas mereka, atau mereka melanggar apa yang telah Allah haramkan atas mereka; mereka tidak memiliki seorang penolong pun selainNya yang mampu menolong dan melindungi mereka. Mereka pasti akan dihukum. Allah mengabarkan juga bahwa sedekah yang ditampakkan oleh orang yang bersedekah itu adalah baik, dan bila dia menyembunyikannya dan menyerahkannya kepada orang yang fakir adalah lebih utama, karena menyembunyikan sedekah kepada orang fakir adalah lebih utama, karena menyembunyikan sedekah kepada orang fakir adalah kebaikan lain dan juga hal itu menunjukkan kuatnya keikhlasan. Salah satu dari tujuh kelompok yang akan dinaungi oleh naungan Allah di Hari Kiamat nanti adalah orang yang bersedekah dengan sebuah pemberian , lalu dia menyembunyikannya hingga tangan kirinya tidak mengetahui apa yang disedekahkan oleh tangan kanannya. Dan dalam firman Allah, “ Dan jika kamu menyembunyikannya dan kamu berikan kepada orang-orang fakir, maka menyembunyikan itu lebih baik bagimu,” terkandung sebuah faidah yang lembut yaitu bahwa tindakan menyembunyikan sedekah adalah lebih baik daripada menampakkannya apabila anda memberikannya kepada seorang fakir. Adapun bila anda menafkahkan harta dalam kegiatan-kegiatan social, dalam ayat ini tidak ada indikasi yang menunjukkan tentang keutamaan menyembunyikan infak, bahkan ada sebuah kaidah syariat yang menunjukkan perlunya mempertimbangkan kemaslahatan, sehingga mungkin saja menampakkannya untuk memberikan suri tauladan dan contoh, serta mendorong orang lain untuk berbuat dengan amalan kebaikan (yang sama), akan menjadi lebih baik. Dan FirmanNya, “Dan Allah akan menghapuskan darimu sebagian kesalahan-kesalahanmu.” Dalam ayat ini terdapat indikasi bahwa dalam sedekah terkumpul dua hal: pertama, memperoleh kebaikan, yaitu banyaknya balasan baik dan pahala serta ganjarannya, dan kedua, menolak kejahatan dan musibah dunia dan akhirat dengan penghapusan dosa-dosa, “dan Allah mengetahui apa yang kamu kerjakan,” maka Allah membalas dengan hikmahNya setiap orang sesuai amal-amalnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { إِن تُبۡدُواْ ٱلصَّدَقَٰتِ } In tubdusshadaqât: Jika kalian memperlihatkan sedekah kalian. { َفَنِعِمَّا هِيَۖ} Fani’imma hiya: Baik sekali sedekah yang kau perlihatkan untuk diikuti oleh orang lain. {وَيُكَفِّرُ عَنكُم مِّن سَيِّ‍َٔاتِكُمۡۗ } Wa yukaffiru ‘ankum min sayyiâtikum: Menghapus kesalahan maknanya adalah menutupi kesalahan dan tidak menuntutnya. Huruf min bermakna sebagian, karena dosa yang berkaitan dengan hak orang lain tidak dihapus begitu saja dengan sedekah. Makna ayat: Pada ayat selanjutnya (271) Allah memberitahukan kepada hamba-hambaNya yang mukmin bahwa harta yang disedekahkan untuk mencari ridhaNya dan termasuk harta yang terbaik miliknya secara terang-terangan merupakan harta yang mendapat keuntungan, sedekahnya diterima oleh Allah, orang yang mengeluarkannya diberikan pahala. Akan tetapi sedekah yang dikeluarkan secara rahasia dan diberikan langsung kepada orang-orang fakir miskin lebih baik bagi pemberinya, karena jauh dari riya’ kepada orang lain, dan untuk memuliakan mereka serta tidak menyebabkan kehinaan bagi mereka. Allah Ta’ala akan menghapus dosa-dosa orang yang bersedekah dengan perbuatannya itu, dan Allah Ta’ala mengabarkan bahwa Dia Maha mengetahui amalan-amalan mereka. Hal ini membuat mereka tenang karena mereka akan mendapatkan pahala dari sedekahnya dan seluruh amalan-amalan shalihnya. Pelajaran dari ayat: • Bolehnya menampakan sedekah ketika dirasa aman dari riya’ • Keutamaan bersedekah secara sembunyi-sembunyi dan besarnya pahala yang didapatkan. Dalam hadits shahih disebutkan,”...dan seorang bersedekah kemudian ia menyembunyikannya sampai-sampai tangan kirinya tidak tahu apa yang disedekahkan oleh tangan kanannya.” Orang inilah yang masuk dalam golongan tujuh orang yang dinaungi oleh Allah dengan naungan ‘Arsiynya pada hari tidak ada naungan selain naunganNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 271: Menampakkan sedekah sunat karena Allah dengan tujuan supaya dicontoh orang lain. Menyembunyikan sedekah itu lebih baik dari menampakkannya, karena Menampakkan itu dapat menimbulkan riya pada diri si pemberi. Dan bersedekah dengan ikhlas itu dapat menghapuskan dosa-dosa. Dalam Tafsir Al Jalaalain disebutkan bahwa sedekah wajib (seperti zakat) lebih utama ditampakkan agar dapat dicontoh, dan agar tidak tertuduh. Ayat ini menjelaskan, bahwa sepatutnya orang yang bersedekah memberikan sedekahnya kepada orang-orang yang membutuhkan. Dia tidak memberikan orang yang butuh, padahal di sana masih ada yang lebih butuh. Allah mengetahui perkara-perkara kecil, tidak samar bagi-Nya keaadan kamu dan Allah akan memberikan balasan kepada masing-masing kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 271",
    "description": "Jika kamu menampakkan sedekah-sedekahmu, baik yang wajib seperti zakat, maupun yang sunah, bukan untuk tujuan ria dan pamer, maka itu baik selama itu didasari keikhlasan, sebab dapat mendorong orang lain bersedekah dan menutup pintu prasangka buruk yang menjerumuskan pelakunya ke dalam dosa. Dan jika kamu menyembunyikannya dan memberikannya kepada orang-orang fakir, maka itu lebih baik bagimu sebab itu dapat menghindari kamu dari sifat ria dan pamrih serta lebih memelihara air muka kaum fakir yang menerima. Dan dengan bersedekah dari harta yang halal dan disertai keikhlasan Allah akan menghapus sebagian kesalahan-kesalahanmu, yang berupa dosa-dosa kecil, bukan dosa besar dan bukan juga yang terkait dengan hak orang lain. Kebajikan yang dilakukan dengan ikhlas dapat menghapuskan dosa-dosa kecil seperti disebut dalam surah hud/11: 114. Dan Allah mahateliti dan maha mengetahui terhadap apa yang kamu kerjakan, dan dia akan memberi balasan yang setimpal. Jangan kaitkan bantuan sedekah dengan hidayah tuhan. Kita hanya diminta membantu dengan bersedekah. Dahulu para sahabat pernah enggan berinfak kepada sanak kerabat mereka yang musyrik. Ayat ini, menurut ibnu abbas, turun untuk merespons sikap mereka, dan memerintahkan mereka bersedekah, selain yang wajib, kepada setiap yang membutuhkan bantuan terlepas dari apa agama dan keyakinannya. Bukanlah kewajibanmu, wahai nabi Muhammad, apalagi orang selain engkau, menjadikan mereka, yakni orang-orang kafir dan sesat, mendapat petunjuk yang membuat mereka melaksanakan tuntunan Allah secara benar. Engkau hanyalah sekadar penyampai risalah secara lisan dan dengan keteladanan melalui cara-cara yang terbaik, tetapi Allah-lah yang memberi petunjuk kepada siapa yang dia kehendaki. Apa pun harta yang kamu infakkan, atau keluarkan, maka kebaikannya akan kembali untuk dirimu sendiri selama kamu berusaha keras dan melakukannya secara ikhlas untuk mendapatkan keridaan-Nya. Dan janganlah kamu berinfak mengeluarkan harta melainkan karena mencari rida Allah. Dan apa pun harta yang kamu infakkan, niscaya kamu akan diberi balasan secara penuh bahkan akan dilipatgandakan balasannya dan kamu tidak akan dizalimi atau dirugikan, bahkan diuntungkan, sebab seperti dinyatakan dalam surah an-nahl/16: 96, harta yang ada pada seseorang akan habis dan punah, sedangkan yang disedekahkan untuk mencari keridaan Allah akan kekal ganjarannya hingga hari kiamat."
  }
]