[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu (wahai Rasul), tidaklah dimintai tanggung jawab atas pemberian taufik kepada orang-orang kafir untuk mendapat hidayah. Akan tetapi, Allah lah yang melapangkan dada siapa saja yang dikehendakiNya untuk memeluk agamaNya dan memberikan taufik kepada agamaNya. Dan apa saja yang kalian berikan dari harta-harta, maka manfaatnya dari Allah akan kembali kepada kalian. Dan orang-orang mukmin tidaklah menginfakkan hartanya kecuali dalam rangka mencari ridha Allah. Dan apa saja yang kalian infakkan berupa harta (dalam keadaan ikhlas karena Allah), pasti kalian akan mendapatkan pahalanya secara penuh, dan kalian tidak mengalami pengurangan sedikit pun dari pahala itu. Dalam ayat ini terkandung penetapan sifat Wajah dari Allah sesuai dengan (Keagungan) Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "272. Bukanlah tugasmu -wahai Nabi- memberikan petunjuk kepada mereka untuk menerima dan tunduk pada kebenaran, serta membawa mereka kepada kebenaran tersebut. Tugasmu hanyalah menunjukkan dan mengenalkan kebenara kepada mereka, karena wewenang untuk membimbing dan menuntun kepada kebenaran ada di tangan Allah. Dia lah yang memberikan hidayah (petunjuk) kepada siapa saja yang Dia kehendaki. Harta yang kalian infakkan, manfaatnya akan kembali kepada kalian, karena Allah tidak membutuhkannya. Hendaklah infak yang kalian berikan murni karena Allah. Orang-orang yang benar-benar beriman tidak berinfak kecuali untuk mencari rida Allah. Harta yang kalian infakkan -sedikit atau banyak- pahalanya akan diberikan kepada kalian secara penuh, tidak dikurangi, karena Allah tidak akan menzalimi siapapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "272. Allah meringankan beban Rasulullah dalam berdakwah kepada orang-orang kafir: kamu bukanlah orang yang bertanggungjawab dalam memberi mereka hidayah, namun Allah-lah yang memberi hidayah untuk menerima Islam kepada yang Dia kehendaki. Hai orang-orang beriman, harta yang kalian infakkan -baik itu banyak maupun sedikit- maka pahalanya untuk kalian sendiri. Dan orang-orang yang beriman tidak berinfak melainkan demi mencari keridhaan Allah. Dan harta yang kalian infakkan pahalanya akan dilipatgandakan, tidak akan dikurangi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "272. لَّيْسَ عَلَيْكَ هُدَىٰهُمْ (Bukanlah kewajibanmu menjadikan mereka mendapat petunjuk ) Yakni bukan suatu kewajiban bagimu untuk menjadikan mereka mendapat petunjuk dan menerima apa yang diperintahkan dan dilarang kepada mereka. وَلٰكِنَّ اللهَ يَهْدِى مَن يَشَآءُ ۗ (, akan tetapi Allah-lah yang memberi petunjuk (memberi taufiq) siapa yang dikehendaki-Nya ) Yakni petunjuk yang menghantarkannya pada yang diharapkan. مِنْ خَيْرٍ (apa saja harta yang baik) Yakni apapun kebaikan itu. فَلِأَنفُسِكُمْ ۚ (maka pahalanya itu untuk kamu sendiri ) Yakni maka manfaatnya kembali kepada kalian dan tidak membawa manfaat apapun untuk Allah. وَمَا تُنفِقُونَ إِلَّا ابْتِغَآءَ وَجْهِ اللهِ ۚ (Dan janganlah kamu membelanjakan sesuatu melainkan karena mencari keridhaan Allah ) Allah menjelaskan bahwa sedekah yang diterima hanyalah sedekah karena mengharapkan keridhaan Allah. يُوَفَّ إِلَيْكُمْ ( niscaya kamu akan diberi pahalanya dengan cukup) Yakni pahala dan balasannya sesuai dengan sifat yang telah disebutkan berupa pelipatgandaan yang berlipat-lipat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "272. Wahai rasul, tidaklah kamu bisa membuat orang-orang musyrik itu mendapatkan hidayah melalui cara mengekang, menghalangi atau membenci mereka, namun Allahlah yang memberi hidayah menuju Islam menggunakan taufikNya bagi hamba-hambaNya yang dikehendaki, Tidaklah bagi penyeru itu kecuali hanya menyampaikan (risalah), dan perkara pemberian hidayah itu hanya dikembalikan kepada Allah. Dan harta yang kalian infakkan itu merupakan tabungan pahala bagi diri kalian sendiri pada hari kiamat. Dan janganlah kecuali untuk mencari ridha dan imbalan Allah saja, bukan untuk pamer dan hal lainnya. Ibnu Abbas berkata: “Nabi SAW memerintahkan agar tidak bersedekah kecuali untuk orang Islam, lalu turunlah ayat {Laisa ‘alaikum hudaahum} lalu beliau memerintahkan untuk memberi sedekah bagi setiap orang yang meminta dari setiap agama”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukanlah kewajibanmu untuk menjadikan mereka mendapat petunjuk, tetapi Allahlah yang memberi petunjuk kepada siapa saja yang Dia kehendaki. Kebaikan apa pun yang kalian infakkan, maka itu untuk diri kalian. Dan apa yang kalian infakkan kecuali karena mencari ridha Allah. Kebaikan apa pun yang kalian infakkan, niscaya kalian akan diberi} akan dikembalikan pahalanya kepada kalian {dan kalian tidak akan dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "272. Maksudnya, sesungguhnya kewajibanmu wahai Rasul, hanyalah menyampaikan dan mengajak manusia kepada kebaikan dan memperingatkan mereka dari keburukan; adapun petunjuk, maka hanya di Tangan Allah. Dan Allah mengabarkan tentang orang-orang Mukmin secara benar, bahwasanya mereka tidaklah bersedekah kecuali hanya untuk mengharapkan wajah Allah, karena keimanan mereka mengajak mereka kepada hal tersebut. Maka kabar ini adalah sebuah kebaikan dan pernyataan baik bagi Kaum Mukminin, dan juga mengingatkan mereka untuk ikhlas, dan Allah mengulang-ulang pengetahuanNya tentang sedekah-sedekah mereka demi memberitahu mereka bahwa Allah tidak akan menyia-nyiakan sedikitpun di sisiNya dari amal hamba walaupun seberat biji atom, dan bila hal itu adalah kebaikan, maka Allah akan melipat gandakan dan akan memberikan pahala yang besar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: {هُدَىٰهُمۡ } Hudâhum: Menunjuki mereka kepada keimanan dan amal shalih {مِنۡ خَيۡرٖ } Min khoirin: berupa harta benda { فَلِأَنفُسِكُمۡۚ } Fali anfusikum: Besarnya pahala di dunia berupa keberkahan dan nama yang baik, serta besarnya pahala di hari kiamat kembali kepada dirimu sendiri. { يُوَفَّ إِلَيۡكُمۡ } Yuwaffa ilaikum: Ganjarannya diberikan sepenuhnya kepadamu, tidak berkurang sedikitpun. Makna ayat: Sesudah Allah Ta’ala memerintahkan hamba-hambaNya untuk bersedekah dan menganjurkannya, lantas orang-orang kafir dari kalangan Yahudi meminta bagian dari sedekah. Hal itu membuat Rasul dan para sahabatnya merasa tidak enak untuk memberikan sedekah kepada mereka, maka Allah Ta’ala menghilangkan perasaan itu dengan mengizinkan mereka untuk memberikan sedekah kepada orang-orang non muslim, yaitu sedekah sunnah bukan sedekah wajib (zakat,pent). Allah Ta’ala berfirman kepada rasulNya dan umatNya yang mengikuti rasul,”Bukanlah kewajibanmu menjadikan mereka mendapatkan petunjuk.” Memberikan petunjuk kepada mereka bukanlah urusanmu, apabila hal itu dibebankan kepadamu pastilah engkau tidak mampu. Hanya saja yang menjadi tanggung jawabmu adalah menjelaskan jalan menuju hidayah bukan yang lain. Sungguh engkau telah melaksanakannya maka bukan kesalahanmu tatkala mereka tidak mau mengikuti pentunjuk. Jika Allah berkehendak untuk memberikan hidayah kepada mereka tentu mereka akan mendapatkannya. Tidaklah engkau mengengeluarkan sedekah dari hartamu melainkan akan dibalas oleh Allah, baik sedekah itu kepada mukmin atau kepada orang kafir jika engkau melakukannya untuk mengharap wajah Allah dan mencari ridhaNya. Kemudian Allah menguatkan janjiNya dengan firmanNya,”Apapun harta yang kamu sedekahkan akan dikembalikan pahalanya kepadamu.” Yaitu engkau tidak akan dizhalimi dengan dikurangi dari apa yang engkau sedekahkan walaupun kekurangan itu hanya sedikit. Inilah makna ayat (272) Pelajaran dari ayat: • Bolehnya bersedekah kepada roang kafir yang membutuhnya dengan sedekah sunnah, bukan zakat karena itu adalah hak bagi orang-orang mukmin. • Pahala bersedekah kembali kepada si pemberi sedekah, bukan kepada penerimanya. Oleh karena itu tidak masalah apabila yang menerima sedekah adalah orang kafir. • Kewajiban untuk ikhlas ketika bersedekah, yaitu wajib untuk digunakan untuk mencari wajah Allah Ta’ala. • Keutamaan pahala sedekah sesuai dengan keutamaan dan kadar kebutuhan penerima sedekah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 272: Ibnu Jarir meriwayatkan dari Ibnu Abbas ia berkata, \"Mereka (kaum muslimin) tidak memberikan sedikit pun (sedekah) kepada kerabat mereka yang musyrik, maka turunlah ayat, \"Alladziina yanqudhuuna 'ahdallah mim ba'di miitsaaqih…dst (Al Baqarah: 27). Hadits ini para perawinya adalah para perawi kitab shahih, Ibnu Katsir menyebutkan sanadnya dalam tafsirnya dari Nasa'i. Hakim juga meriwayatkan dan berkata, \"Hadits ini shahih isnadnya, namun Bukhari dan Muslim tidak mengeluarkannya.\" Adz Dzahabi mengisyaratkan dalam At Talkhish bahwa hadits tersebut sesuai syarat Bukhari-Muslim. Haitsami dalam Majma'uz Zawaa'id juz 6 hal. 324 berkata, \"Diriwayatkan oleh Thabrani dari gurunya Abdullah bin Muhammad bin Sa'id bin Abi Maryam, namun ia dha'if. Al Bazzar meriwayatkan yang serupa, dan para perawinya tsiqah.\" Yaitu masuk ke dalam Islam. Tugas Nabi Muhammad shallallahu 'alaihi wa sallam hanyalah menyampaikan. Dalam ayat ini terdapat dalil bahwa infak itu, tidak hanya kepada orang muslim, orang kafir pun boleh diberikan meskipun tidak mendapatkan petunjuk, namun orang muslim tentu lebih didahulukan. Yakni keridhaan-Nya, karena arti \"mencari wajah\" adalah mencari muka. Dalam ayat ini terdapat penetapan sifat wajah bagi Allah sesuai yang layak bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 272",
    "description": "Jangan kaitkan bantuan sedekah dengan hidayah tuhan. Kita hanya diminta membantu dengan bersedekah. Dahulu para sahabat pernah enggan berinfak kepada sanak kerabat mereka yang musyrik. Ayat ini, menurut ibnu abbas, turun untuk merespons sikap mereka, dan memerintahkan mereka bersedekah, selain yang wajib, kepada setiap yang membutuhkan bantuan terlepas dari apa agama dan keyakinannya. Bukanlah kewajibanmu, wahai nabi Muhammad, apalagi orang selain engkau, menjadikan mereka, yakni orang-orang kafir dan sesat, mendapat petunjuk yang membuat mereka melaksanakan tuntunan Allah secara benar. Engkau hanyalah sekadar penyampai risalah secara lisan dan dengan keteladanan melalui cara-cara yang terbaik, tetapi Allah-lah yang memberi petunjuk kepada siapa yang dia kehendaki. Apa pun harta yang kamu infakkan, atau keluarkan, maka kebaikannya akan kembali untuk dirimu sendiri selama kamu berusaha keras dan melakukannya secara ikhlas untuk mendapatkan keridaan-Nya. Dan janganlah kamu berinfak mengeluarkan harta melainkan karena mencari rida Allah. Dan apa pun harta yang kamu infakkan, niscaya kamu akan diberi balasan secara penuh bahkan akan dilipatgandakan balasannya dan kamu tidak akan dizalimi atau dirugikan, bahkan diuntungkan, sebab seperti dinyatakan dalam surah an-nahl/16: 96, harta yang ada pada seseorang akan habis dan punah, sedangkan yang disedekahkan untuk mencari keridaan Allah akan kekal ganjarannya hingga hari kiamat. Petunjuk yang membuat mereka melaksanakan tuntunan Allah secara benar. Engkau hanyalah sekadar penyampai risalah secara lisan dan dengan keteladanan melalui cara-cara yang terbaik, tetapi Allah-lah yang memberi petunjuk kepada siapa yang dia kehendaki. Apa pun harta yang kamu infakkan, atau keluarkan, maka kebaikannya akan kembali untuk dirimu sendiri selama kamu berusaha keras dan melakukannya secara ikhlas untuk mendapatkan keridaan-Nya. Dan janganlah kamu berinfak mengeluarkan harta melainkan karena mencari rida Allah. Dan apa pun harta yang kamu infakkan, niscaya kamu akan diberi balasan secara penuh bahkan akan dilipatgandakan balasannya dan kamu tidak akan dizalimi atau dirugikan, bahkan diuntungkan, sebab seperti dinyatakan dalam surah an-nahl/16: 96, harta yang ada pada seseorang akan habis dan punah, sedangkan yang disedekahkan untuk mencari keridaan Allah akan kekal ganjarannya hingga hari kiamat."
  }
]