[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan serahkanlah sedekah-sedekah kalian kepada orang-orang fakir dari kaum muslimin yang tidak memungkinkan bagi mereka untuk bepergian jauh demi mencari rizki lantaran kesibukan mereka dalam berjihad di jalan Allah. Orang yang tidak mengenal meraka menyangka bahwa meraka adalah orang-orang yang tidak membutuhkan bantuan sedekah, karena mereka menjaga kehormatan diri mereka dari meminta-minta. Kalian mengenali mereka dengan tanda-tanda mereka dan indikasi kebutuhan ada pada diri mereka. Mereka tidak mau meminta-minta kepada manusia secara umum, dan jika mereka terpaksa meminta-minta, mereka tidak meminta dengan mendesak orang. Dan apa yang kalian infakkan berupa harta di jalan Allah, maka tidak ada sesuatu pun yang tersembunyi bagi Allah darinya. Dan Dia akan memberikan balasan atas infak itu dengan balasan yang penuh dan paling sempurna pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "273. Berikanlah sedekah kalian kepada orang-orang miskin yang kesibukannya berjihad di jalan Allah membuat mereka tidak sempat bekerja mencari rezeki. Orang yang tidak mengetahui keadaan mereka mengira bahwa mereka itu kaya karena enggan meminta-minta. Tetapi keadaan mereka yang sebenarnya diketahui oleh orang yang memperhatikan kondisi mereka melalui tanda-tanda yang ada pada tubuh dan pakaian mereka yang tampak membutuhkan bantuan. Di antara ciri mereka ialah mereka tidak seperti orang-orang miskin lainnya yang suka meminta-meminta kepada orang lain dengan sedikit memaksa. Apapun kebaikan yang kalian lakukan dan harta yang kalian sedekahkan, sesungguhnya Allah Maha Mengetahuinya dan akan memberi kalian balasan yang sebesar-besarnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "273. Berikanlah sedekah kalian bagi orang-orang fakir yang mengabdikan dirinya untuk berjihad di jalan Allah atau menuntut ilmu, sebab mereka tidak sempat mencari rezeki. Orang yang tidak mengenal mereka akan mengira bahwa mereka tidak butuh sedekah kalian, sebab mereka tidak meminta-minta kepada orang lain. Kalian dapat mengetahui bahwa mereka fakir dengan kebutuhan-kebutuhan yang tidak dapat mereka penuhi namun mereka enggan untuk meminta-minta; dan jika mereka miminta, mereka tidak akan memaksa. Dan harta yang kalian sedekahkan di jalan Allah, Allah Maha Mengetahuinya, dan Dia akan membalas sedekah kalian. Syeikh as-Syinqithi berkata: Allah tidak menjelaskan dalam ayat ini sebab kemiskinan mereka, namun Allah menjelaskannya pada surat al-Hasyr, bahwa itu disebabkan orang-orang kafir mengusir mereka dari tempat tinggal dan harta benda mereka. Abu Hurairah berkata, Rasulullah bersabda: “Orang miskin bukanlah orang yang berkeliling meminta-minta belas kasih orang lain, yang diberi sesuap atau dua suap makanan, sebiji atau dua biji kurma.” Para sahabat bertanya: “Lalu siapakah orang miskin itu ya Rasulullah?” Beliau menjawab: “dia adalah orang yang tidak dapat mencukupi kebutuhannya, namun tidak ada yang mengetahui keadaannya sehingga seseorang dapat berinfak kepadanya, dan dia tidak pula meminta-minta.” (Shahih Muslim, zakat, bab orang miskin yang tak dapat mencukupi kebutuhan, 2/219, no. 103. Dan Shahih Bukhari, tafsir, bab tidak meminta-minta orang lain dengan paksa, 8/202, no. 4539)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "273. لِلْفُقَرَآءِ ((Berinfaqlah) kepada orang-orang fakir ) Yakni jadikan sedekah itu untuk orang-orang fakir. الَّذِينَ أُحْصِرُوا۟ فِى سَبِيلِ اللهِ (yang terikat (oleh jihad) di jalan Allah ) Yakni dengan peperangan, penjagaan perbatasan, dan perang untuk pertahanan. لَا يَسْتَطِيعُونَ ضَرْبًا فِى الْأَرْضِ ( mereka tidak dapat (berusaha) di bumi) Yakni dengan berdagang, bercocok tanam atau yang lainnya karena kesibukan mereka dengan urusan jihad dan keterikatan mereka dengan hal itu, atau karena hijrah yang mereka lakukan agar senantiasa berada dalam keataatan kepada Allah dan Rasul-Nya seperti yang dilakukan oleh para Ahli Shuffah. يَحْسَبُهُمُ الْجَاهِلُ أَغْنِيَآءَ (orang yang tidak tahu menyangka mereka orang kaya) Yakni karena mereka menolak untuk meminta-minta dan menunjukkan kemiskinan mereka sehingga orang yang tidak tahu keadaan mereka akan menyangka mereka adalah orang-orang kaya, namun orang yang bijak akan mengetahui keadaan mereka yang sebenarnya dengan tanda-tanda yang ada pada mereka. تَعْرِفُهُم بِسِيمٰهُمْ ( Kamu kenal mereka dengan melihat sifat-sifatnya) Yakni dengan lemahnya badan mereka dan segala yang menunjukkan kemiskinan dan kebutuhan. لَا يَسْـَٔلُونَ النَّاسَ إِلْحَافًا ۗ (mereka tidak meminta kepada orang secara mendesak) Yakni tidak seperti orang lain yang meminta-minta secara mendesak, akan tetapi mereka adalah orang yang tidak meminta-minta sedikitpun, baik itu secara mendesak atau secara lembut demi menjaga kehormatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "273. Berikanlah sedekah untuk orang-orang fakir yang tidak bisa bekerja dan mengabdikan diri untuk taat kepada Allah dengan berjihad atau mencari ilmu, dan orang-orang fakir yang tidak bisa bekerja dengan berdagang atau bertani karena membaktikan dirinya untuk berjihad dan mencari ilmu. Orang yang tidak tahu akan menganggap mereka sebagai orang kaya yang sejahtera dengan melihat keadaan mereka, dan sesuatu yang mereka tampakkan berupa tidak mau meminta-minta, menunjukkan kemiskinan, dan menerima apa adanya. Kamu akan mengenal mereka sebagai orang-orang fakir yang sangat membutuhkan, melalui tanda-tanda dan apa yang tampak pada diri mereka berupa kebutuhan dan kefakiran, namun mereka tidak mau meminta bantuan dengan memaksa seperti yang lainnya, bahkan sebenarnya mereka itu tidak meminta-minta kepada orang-orang. Dan harta yang kalian infakkan, maka Allah itu Maha Mengetahuinya dan akan membalas kalian atas harta tersebut. Ayat ini turun terkait Ahlu Shuffah (orang-orang yang hidup di suffah masjid) Mereka itu adalah 400 kaum Muhajirin. Mereka membaktikan diri untuk mempelajari Al-Qur’an. Dan biasa keluar bersama pasukan kecil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi orang-orang fakir yang terhalang dalam berjihad di jalan Allah} diri mereka terhalang untuk berjihad di jalan Allah {dan mereka tidak dapat berusaha di bumi} mereka tidak dapat bepergian di bumi untuk berdagang dan mencari penghidupan {Orang yang tidak tahu mengira bahwa mereka} orang yang tidak tahu mengira bahwa mereka dengan keadaan itu {adalah orang-orang kaya karena mereka memelihara diri dari meminta-minta} karena menjauhkan diri dari meminta-minta {Kamu mengenal mereka dari ciri-ciri mereka} dengan tanda-tanda mereka dan jejak kebutuhan mereka {yang tidak meminta secara paksa kepada orang lain} dengan kasar {Kebaikan apa pun yang kalian infakkan, sesungguhnya Allah Maha tahu tentang itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "273. Maksudnya adalah bahwa seyogyanya kalian berusaha dalam memberikan sedekah-sedekah kalian kepada orang-orang yang fakir yang menahan diri mereka pada jalan Allah dan pada ketaatan kepadaNya, dan mereka tidak memiliki (jalan untuk mewujudkan) kehendak mencari nafkah atau malah mereka tidak memiliki kemampuan untuk itu. Mereka menahan diri dari meminta-minta, yang bila mereka dilihat oleh orang-orang bodoh, pastilah mereka akan menduga bahwa mereka adalah orang-orang kaya. “Mereka tidak meminta kepada orang secara mendesak”; mereka tidak meminta secara umum, dan bila mereka harus meminta pun karena darurat, mereka tidak akan memintanya dengan memaksa. Kelompok orang-orang fakir yang satu ini adalah lebih utama untuk diberikan nafkah untuk memenuhi kebutuhan mereka dan menolong mereka dalam menyampaikan mereka kepada tujuan mereka dan kepada jalan yang baik, dan sebagai ucapan terima kasih buat mereka karena kesabaran yang mereka lakukan dan orientasi mereka kepada Allah Yang Maha Mencipta dan bukan kepada makhluk. Walaupun demikian, berinfak dalam segala jalan kebaikan dan menutupi segala kebutuhan di mana pun didapatkan maka semua itu adalah kebaikan, dan pahala serta ganjarannya ada di sisi Allah. Oleh karena itu Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { أُحۡصرُِواْ } Uẖshirû: Tertahan dan terkepung, tidak bisa berbuat sesuatu karena mereka hijrah dari negeri mereka. { ضَرۡبٗا فِي ٱلۡأَرۡضِ } Dhorban fil ardhi: Berjalan di muka bumi untuk mencari rizki dengan berjual beli atau selainnya, karena dikepung oleh musuh. { بِسِيمَٰهُمۡ } Bisîmâhum: Tanda-tanda yang menunjukkan kebutuhan mereka terhadap harta, seperti pakaian yang compang-camping dan wajah yang memucat. { مِنَ ٱلتَّعَفُّفِ } Minatta’affufi: Tidak mengemis kepada manusia dan menolak untuk berbuat demikian. { إِلۡحَافٗاۗ } Ilẖafâ: Merengek-rengek kepada orang yang diminta sampai mau memberinya. Makna ayat: Adapun ayat (273) yaitu firman Allah Ta’ala;“Bagi orang-orang fakir yang terkepung di jalan Allah....” di sini Allah Ta’ala menjelaskan tentang penerima sedekah yang paling utama untuk diberikan harta adalah mereka orang-orang fakir dari kalangan Muhajirin yang mana mereka telah diusir dari negerinya dan meninggalkan harta bendanya di sana. Mereka terkepung di Madinah bersama Rasulullah ﷺ tidak dapat untuk berjalan di muka bumi untuk berjualan atau untuk bekerja. Allah menyebutkan sifat mereka agar dikenal oleh Rasulullah dan kaum mukminin. Seandainya tidak disebutkan sifat-sifat itu orang-orang tidak akan tahu, karena mereka menahan diri tidak meminta-minta dan menjaga kehormatan diri mereka dan menyangka mereka adalah orang-orang kaya yang tidak memerlukan sesuatu. Allah Ta’ala berfirman,”Orang yang tidak tahu mengira bahwa mereka tu orang-orang kaya karena tidak mau meminta-minta.” Sekedar meminta-minta saja mereka tidak mau, apalagi sampai harus merengek-rengek agar diberi. Kemudian pada akhir ayat Allah kembali mengulang janjiNya untuk membalas apa yang diinfakan di jalan Allah dengan firmanNya,”Apapun harta yang kamu nafkahkan, sesungguhnya Allah mengetahuinya.” Allah pasti akan mengganjarnya dengan sebaik-baik pahala maka bergembiralah dan tenanglah kalian. Pelajaran dari ayat: • Keutamaan sikap ta’affuf yaitu meninggalkan meminta-minta walaupun sangat membutuhkannya, serta mencela sikap merengek-rengek dalam meminta kepada selain Allah Ta’ala. Adapun kepada Allah wajib untuk merengek rengek dalam meminta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 273: Ayat ini turun berkenaan dengan kaum muhajirin yang tinggal di shuffah (tempat berteduh) masjid, di mana jumlah mereka sekitar 400 orang. Mereka biasa mengajarkan Al Qur'an dan ikut keluar bersama sariyyah (pasukan kecil). Mereka tidak mampu berusaha di muka bumi karena kesibukan berjihad. Mereka adalah orang yang lebih berhak mendapatkan infak, karena keadaan mereka sebagai orang-orang fakir dan terikat pula oleh jihad atau ketaatan lainnya, di samping mereka tidak mampu mengadakan safar untuk mencari rezeki. Seperti sikap tawadhu' dan bekas-bekas kesusahan. Oleh karena itu, Dia akan memberikan balasan secara penuh kepadanya pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 273",
    "description": "Petunjuk yang membuat mereka melaksanakan tuntunan Allah secara benar. Engkau hanyalah sekadar penyampai risalah secara lisan dan dengan keteladanan melalui cara-cara yang terbaik, tetapi Allah-lah yang memberi petunjuk kepada siapa yang dia kehendaki. Apa pun harta yang kamu infakkan, atau keluarkan, maka kebaikannya akan kembali untuk dirimu sendiri selama kamu berusaha keras dan melakukannya secara ikhlas untuk mendapatkan keridaan-Nya. Dan janganlah kamu berinfak mengeluarkan harta melainkan karena mencari rida Allah. Dan apa pun harta yang kamu infakkan, niscaya kamu akan diberi balasan secara penuh bahkan akan dilipatgandakan balasannya dan kamu tidak akan dizalimi atau dirugikan, bahkan diuntungkan, sebab seperti dinyatakan dalam surah an-nahl/16: 96, harta yang ada pada seseorang akan habis dan punah, sedangkan yang disedekahkan untuk mencari keridaan Allah akan kekal ganjarannya hingga hari kiamat. Orang-orang yang menginfakkan hartanya dalam berbagai situasi dan kondisi, di malam dan siang hari, baik secara sembunyi-sembunyi maupun terang-terangan, banyak atau sedikit, mereka akan mendapat pahala di sisi tuhannya selama mereka mengeluarkannya secara ikhlas dan dengan cara-cara yang baik. Tidak ada kekhawatiran atas mereka bahwa nanti mereka akan mendapat siksa, sebab mereka aman dari siksa karena amal saleh yang mereka persembahkan, dan mereka tidak pula bersedih hati, risau dan gelisah, sebab hati mereka selalu dalam keadaan tenang."
  }
]