[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengeluarkan harta mereka demi mengharap ridha Allah malam dan siang hari, baik dengan merahasiakan dan menampakkannya, maka bagi mereka pahala dari Tuhan mereka, tidak ada rasa takut pada mereka berkaitan dengan apa yang akan mereka hadapi di akhirat, dan merekapun tidak bersedih hati atas kesenangan-kesenangan dunia yang luput bagi mereka. Ketetapan ajaran syariat ilahi ini adalah manhaj islam dalam berinfak karena di dalamnya memuat unsur memenuhi kebutuhan orang-orang fakir dalam kemuliaan dan kehormatan yang terjaga serta pembersihan harta-harta orang kaya dan perwujudan semangat kerja sama dalam kebaikan dan ketakwaan demi mencari Wajah Allah tanpa ada unsur tindakan represif dan pemaksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "274. Orang-orang yang menginfakkan harta mereka untuk mencari rida Allah di malam dan siang hari, secara sembunyi-sembunyi maupun terang-terangan, namun tidak disertai niat untuk ria (pamer) dan mencari popularitas, maka pahala mereka ada di sisi Rabb mereka di hari kiamat. Tidak ada ketakutan terhadap mereka mengenai urusan mereka di masa depan dan mereka tidak bersedih atas dunia yang tidak mereka dapatkan, karena besarnya anugerah dan karunia yang mereka dapatkan dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "274. orang-orang yang menginfakkan hartanya di jalan Allah setiap saat, baik siang maupun malam, terang-terangan atau sembunyi-sembunyi, maka bagi mereka pahala dari Tuhan mereka, tidak ada yang akan mereka takutkan di hari perhitungan dan mereka tidak bersedih dengan kenikmatan dunia yang luput dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "274. الَّذِينَ يُنفِقُونَ أَمْوٰلَهُم بِالَّيْلِ وَالنَّهَارِ (Orang-orang yang menafkahkan hartanya di malam dan di siang hari ) Yakni sebab tingginya minat mereka untuk bersedekah sampai-sampai mereka tidak meninggalkannya baik itu di siang hari maupun malam hari. سِرًّا وَعَلَانِيَةً(secara tersembunyi dan terang-terangan ) Yakni saat menghampiri mereka kebutuhan orang lain, maka mereka mendapatkan pahala mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "274. Orang-orang yang menafkahkan hartanya di jalan Allah di setiap waktu baik malam ataupun siang, sembunyi-sembunyi ataupun terang-terangan, ektika seseorang membutuhkannya tanpa berlaku boros dan pelit dalam hal itu, maka bagi mereka itu pahala di sisi Tuhannya. Tiada kekhawatiran bagi mereka tentang azab hari kiamat. Mereka juga tidak bersedih atas sesuatu yang hilang dari mereka di dunia. Ayat ini turun untuk Ashabul Khail, yaitu orang-orang yang menunggang kuda di jalan Allah SWT dan mereka berinfak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menginfakkan hartanya pada malam dan siang hari baik secara rahasia maupun terang-terangan,bagi mereka itu pahala di sisi Tuhannya. Tidak ada rasa takut pada mereka dan tidak pula mereka bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "274. “Orang-orang yang menafkahkan hartanya di malam dan di siang hari secara tersembunyi dan terang-terangan, maka mereka mendapat pahala di sisi Tuhannya. Tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati,” karena allah akan menaungi mereka dengan naunganNya pada hari di mana tidak ada naungan selain naunganNya. Allah akan memberi mereka kebaikan-kebaikan dan menolak dari mereka kesedihan, perasaan takut, dan khawatir, serta segala perkara yang dibenci. Dan FirmanNya, “Maka mereka mendapat pahala di sisi Rabbnya,” setiap orang dari mereka menurut kondisinya masing-masing. Pengkhususan bahwa semua itu di sisi Tuhan mereka, menunjukkan atas kemuliaan kondisi tersebut dan keberadaannya pada suatu tempat yang besar, sebagaimana dalam hadist shahih, “Sesungguhnya seorang hamba bersedekah dengan sebiji kurma dari hasil usaha yang baik lalu diterima oleh Yang Maha Memaksa dengan TanganNya lalu Dia mengembangkannya untuk salah seorang di antara kalian sebagaimana salah seorang dari kalian mengembangkan anak kudanya hingga menjadi seperti gunung yang besar.” HR Bukhori 1410"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Adapun ayat berikutnya (274) adalah ayat terakhir mengenai ajakan untuk mengeluarkan sedekah yang membawa berita gembira bagi orang-orang yang gemar bersedekah pada setiap keadaan, siang maupun malam, secara rahasia atau terang-terangan, bahwa pahala sedekahnya tersimpan di sisi Rabbnya yang akan diterima pada hari kiamat nanti. Tidak ada rasa takut untuk mereka dan mereka tidak bersedih di dunia, alam barzakh, ataupun di akhirat. Pelajaran dari ayat: • Bolehnya bersedekah di malam hari dan siang hari, secara rahasia atau terang-terangan, karena semua itu dibalas oleh Allah berupa pahala selama dilakukan untuk mencari wajah Allah bukan yang lain. • Kabar gembira dari Allah kepada kaum mukminin dan orang yang gemar bersedekah, bahwa pahala mereka disimpan di sisiNya dan menghilangkan rasa takut dan kesedihan dari diri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 274: Di jalan Allah, yakni di atas ketaatan dan mencari keridhaan Allah, bukan untuk yang haram, yang makruh atau keinginan hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 274",
    "description": "Orang-orang yang menginfakkan hartanya dalam berbagai situasi dan kondisi, di malam dan siang hari, baik secara sembunyi-sembunyi maupun terang-terangan, banyak atau sedikit, mereka akan mendapat pahala di sisi tuhannya selama mereka mengeluarkannya secara ikhlas dan dengan cara-cara yang baik. Tidak ada kekhawatiran atas mereka bahwa nanti mereka akan mendapat siksa, sebab mereka aman dari siksa karena amal saleh yang mereka persembahkan, dan mereka tidak pula bersedih hati, risau dan gelisah, sebab hati mereka selalu dalam keadaan tenang. Orang-orang yang memakan riba yakni melakukan transaksi riba dengan mengambil atau menerima kelebihan di atas modal dari orang yang butuh dengan mengeksploitasi atau memanfaatkan kebutuhannya, tidak dapat berdiri, yakni melakukan aktivitas, melainkan seperti berdirinya orang yang kemasukan setan karena gila. Mereka hidup dalam kegelisahan; tidak tenteram jiwanya, selalu bingung, dan berada dalam ketidakpastian, sebab pikiran dan hati mereka selalu tertuju pada materi dan penambahannya. Itu yang akan mereka alami di dunia, sedangkan di akhirat mereka akan dibangkitkan dari kubur dalam keadaan sempoyongan, tidak tahu arah yang akan mereka tuju dan akan mendapat azab yang pedih. Yang demikian itu karena mereka berkata dengan bodohnya bahwa jual beli sama dengan riba dengan logika bahwa keduanya sama-sama menghasilkan keuntungan. Mereka beranggapan seper-ti itu, padahal Allah telah menghalalkan jual beli dan mengharamkan riba. Substansi keduanya berbeda, sebab jual beli menguntungkan kedua belah pihak (pembeli dan penjual), sedangkan riba sangat merugikan salah satu pihak. Barang siapa mendapat peringatan dari tuhannya, setelah sebelumnya dia melakukan transaksi riba, lalu dia berhenti dan tidak melakukannya lagi, maka apa yang telah diperolehnya dahulu sebelum datang larangan menjadi miliknya, yakni riba yang sudah diambil atau diterima sebelum turun ayat ini, boleh tidak dikembalikan, dan urusannya kembali kepada Allah. Barang siapa mengulangi transaksi riba setelah peringatan itu datang maka mereka itu penghuni neraka. Mereka kekal di dalamnya untuk selama-lamanya."
  }
]