[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang bermuamalah dengan riba (yaitu tambahan dari modal pokok), mereka itu tidaklah bangkit berdiri di akhirat kelak dari kubur-kubur mereka, kecuali sebagaimana berdirinya orang-orang yang dirasuki setan karena penyakit gila. Hal itu karena sesungguhnya mereka mengatakan, “Sesungguhnya jual beli itu sama dengan praktek ribawi dalam kehalalan keduanya, karena masing-masing menyebabkan bertambahnya kekayaan.” Maka Allah mendustakan mereka dan menjelaskan bahwa Dia menghalalkan jual beli dan mengharamkan transaksi ribawi, karena dalam jual beli terdapat manfaat bagi orang-orang secara individual dan masyarakat, dan karena dalam praktek riba terkandung unsur pemanfaatan kesempatan dalam kesempitan, hilangnya harta dan kehancuran. Maka siapa saja yang telah sampai padanya larangan Allah terkait riba, lalu dia menghindarinya, maka baginya keuntungan yang telah berlalu sebelum ketetapan pengaraman. Tidak ada dosa atas dirinya padanya. Dan urusannya dikembalikan kepada Allah terkait apa yang akan terjadi pada dirinya pada masa yang akan datang. Apabila dia komitmen terus di atas taubatnya, maka Allah tidak akan menghilangkan pahala orang-orang yang berbuat baik. Dan barangsiapa kembali kepada praktek riba dan menjalankannya setelah sampai kepadanya larangan Allah tentang itu, maka sungguh dia pantas memperoleh siksaan dan hujjah telah tegak nyata di hadapannya. Oleh sebab itu, Allah berfirman, “Maka mereka itu adalah para penghuni neraka; mereka kekal di dalamnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "275. \"Orang-orang yang bertransaksi dan mengambil harta riba tidak bisa berdiri dari kuburnya kelak pada hari kiamat kecuali seperti berdirinya orang yang kesurupan setan. Ia bangkit dari kuburnya sambil sempoyongan seperti orang kesurupan, jatuh-bangun. Hal itu karena mereka menghalalkan memakan harta riba. Mereka tidak membedakan antara riba dengan hasil jual-beli yang dihalalkan oleh Allah. Mereka mengatakan, “Sesungguhnya jual-beli itu seperti riba dalam hal kehalalannya. Karena keduanya sama-sama menyebabkan adanya pertambahan dan pertumbuhan harta.” Lalu Allah membantah ucapan mereka dan membatalkan kias mereka. Allah menjelaskan bahwa Dia menghalalkan jual-beli karena di dalamnya terdapat keuntungan yang umum dan khusus. Dan Allah mengharamkan riba karena di dalamnya terdapat kezaliman dan tindakan memakan harta orang lain secara batil tanpa imbalan apapun. Maka barangsiapa menerima nasihat dari Rabbnya yang berisi larangan dan peringatan terhadap riba, lalu ia berhenti memungut riba dan bertaubat kepada Allah dari perbuatan itu, maka ia boleh memiliki harta riba yang telah diambilnya di masa lalu tanpa dosa, dan urusan masa depannya sesudah itu diserahkan kepada Allah. Barangsiapa kembali mengambil riba setelah ia mendengar adanya larangan dari Allah dan ia telah mengetahui hujjah yang nyata, maka ia pantas masuk neraka dan kekal di dalamnya. Yang dimaksud kekal di dalam neraka ialah orang yang menghalalkan memakan riba itu, atau maksudnya adalah tinggal di sana dalam waktu yang sangat lama. Karena tinggal di neraka untuk selama-lamanya hanya berlaku bagi orang-orang kafir. Sedangkan orang-orang yang bertauhid tidak akan kekal di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "275. Allah memperingatkan dari akibat buruk di dunia dan di akhirat dari memakan harta riba -yakni bunga dari hutang piutang atau jual beli-. Allah mengabarkan bahwa orang-orang yang berinteraksi dengan riba akan bangkit dari kubur mereka di akhirat seperti orang yang kerasukan setan; hal ini akibat perkataan mereka bahwa jual beli sama dengan riba, keduanya halal. Maka Allah membantah mereka dengan menjelaskan perbedaan antara keduanya, Dia menghalalkan jual beli dan mengharamkan riba, sebab dalam jual beli terdapat manfaat bagi manusia sedangkan riba mengandung kezaliman dan kebangkrutan. Barangsiapa yang mematuhi larangan riba maka tidak ada dosa baginya, dan urusannya yang telah lalu kembali kepada kehendak Allah. Dan barangsiapa yang kembali berinteraksi dengan riba karena menganggapnya halal maka dia sungguh telah jauh dari kebenaran dan akan kekal di neraka selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "275. الَّذِينَ يَأْكُلُونَ الرِّبَوٰا۟ ( Orang-orang yang makan (mengambil) riba) Mayoritas yang dilakukan orang-orang pada masa Jahiliyah adalah apabila telah habis batas waktu untuk melunasi hutang mereka berkata kepada pemilik hutang: Apakah akan kamu lunasi atau kamu harus menambah? Dan apabila tidak dibayar maka mereka akan menambah jumlah harta yang menjadi hutang tersebut (bunga) dan memberi tenggang waktu untuk melunasinya. Hal ini merupakan sesuatu yang haram sesuai kesepakatan para ulama. Dalam ayat ini terdapat ancaman bagi orang yang memakan bunga (riba) ini, dan bagi selain pemakan riba ini sebagaimana yang disebutkan dalam hadist bahwa Rasulullah bersabda: Allah melaknat pemakan riba, wakilnya, penulisnya, dan dua saksinya. Dan Rasulullah bersabda: mereka semua sama. لَا يَقُومُونَ(tidak dapat berdiri ) Yakni pada hari kiamat. الَّذِى يَتَخَبَّطُهُ الشَّيْطٰنُ مِنَ الْمَسِّ ۚ (orang yang kemasukan syaitan lantaran (tekanan) penyakit gila ) Seperti orang yang kejang. Para ulama berkata: dia akan dibangkitkan dalam keadaan gila sebagai siksaan baginya dan kemurkaan ahli mahsyar kepadanya yang disebabkan ketamakan dan kegigihannya dalam mengumpulkan dunia menjadikan dia seperti orang gila. Dan (الخبط) adalah gerakan yang tidak beraturan seperti garakan orang yang kejang. Dan (المس) adalah penyakit gila. Begitulah balasan atas mereka disebabkan perkataan mereka: إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَوٰا۟ ۗ (sesungguhnya jual beli itu sama dengan riba) Yakni mereka menjadikan kegiatan jual beli dan riba adalah sama saja karena seseorang mendapat untung dalam riba sebagaimana mendapat untung dalam jual beli. وَأَحَلَّ اللهُ الْبَيْعَ وَحَرَّمَ الرِّبَوٰا۟ ۚ ( padahal Allah telah menghalalkan jual beli dan mengharamkan riba) Yakni ini adalah perbedaan antara keduanya, dan Allah menghalalkan jual beli namun mengharamkan salah satu jenisnya yaitu jual beli yang mengandung riba didalamnya. Dan Allah menjawab perkataan mereka dengan jawaban ini adalah sebagai pemotong kelicikan mereka dan pemutus percakapan dengan mereka; karena urusan seorang mukmin adalah mentaati merintah Allah dalam setiap perintah maupun larangan tanpa perdebatan karena keburukan-keburukan riba dan kebaikan-kebaikan jual beli adalah sesuatu yang jelas. Maka bagaimana bisa mereka berkata: jual beli itu layaknya riba. فَمَن جَآءَهُۥ مَوْعِظَةٌ مِّن رَّبِّهِۦ (Orang-orang yang telah sampai kepadanya larangan dari Tuhannya ) Dan diantaranya adalah larangan terhadap riba yang ada dalam ayat ini. فَانتَهَىٰ ( lalu terus berhenti) Yakni lalu mentaati dan berhenti dari mengambil riba. فَلَهُۥ مَا سَلَفَ ( maka baginya apa yang telah diambilnya dahulu (sebelum datang larangan)) Yakni tidak dihukum atas riba yang telah lalu karena ia melakukannya sebelum turun ayat yang mengharamkan riba. وَأَمْرُهُۥٓ إِلَى اللهِ ۖ ( dan urusannya (terserah) kepada Allah) Yakni dalam pengampunannya dan penghapusan dosa akibat riba tersebut. وَمَنْ عَادَ (Orang yang kembali (mengambil riba)) Yakni kembali memakan riba dan bermuamalah dengan riba. Pendapat lain mengatakan: kembali berkata bahwa jual beli itu seperti riba. فَأُو۟لٰٓئِكَ أَصْحٰبُ النَّارِ ۖ هُمْ فِيهَا خٰلِدُونَ ( maka orang itu adalah penghuni-penghuni neraka; mereka kekal di dalamnya) Yakni dengan lamanya mereka didalamnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pemakan riba akan hilang akalnya dengan mengejar keuntungan dari bunga { الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ } dan ketika ia dibangkitkan pada hari kiamat ia akan merasakan kejamnya siksaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "275. Orang-orang yang mengambil riba (yaitu tambahan dari takaran pinjaman atau dalam penjualan yang mengandung riba) itu pada hari kiamat tidak bisa bangkit dari kuburnya karena kebingungan yang muncul karena ketakutan yang sangat besar, atau seperti berdirinya orang yang dimasukki setan karena penyakit gila, yaitu seperti orang yang kemasukkan setan, sebagai hukuman baginya. Hal tersebut akibat dari ucapan mereka “Sesungguhnya transaksi penjualan itu seperti riba. Keduanya adalah satu hal yang sama yang bisa menghasilkan keuntungan” Lalu Allah membalas mereka dengan memisahkan keduanya, yaitu bahwa Allah menghalalkan transaksi penjualan yang dilakukan dengan saling tukar sesuai kebutuhan, dan mengharamkan riba yang dilakukan dengan mengambil harta yang bukan miliknya tanpa adanya ganti rugi. Barangsiapa mengambil pelajaran dari larangan riba, maka dia tidak akan mengambil sesuatu yang telah lalu tersebut, karena hal itu dilakukan sebelum ada pengharaman sehingga dia tidak dibalas atas perbuatan ribanya. Dan riba yang dilakukan itu sebelum adanya pengharaman. Dan perkaranya dikembalikan kepada Allah dengan diberi ampunan atau diabaikan saja. Barangsiapa kembali bermuamalah dengan riba setelah adanya pengharaman riba, maka mereka itu adalah para penghuni neraka yang tinggal di sana selama-lamanya. Yang seringkali dilakukan bangsa Arab jahiliyyah yaitu ketika tiba waktunya membayar hutang. Pemberi pinjaman akan berkata kepada peminjam: “Apakah kamu akan melunasinya atau akan melebihkannya?” Jika peminjam tidak melunasinya maka keuntungan pemberi pinjaman akan bertambah, dan menunda pembayarannya di waktu lainnya. Dan hal ini kesepakatan yang diharamkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang memakan} mengambil {riba, tidak dapat berdiri} pada hari kiamat dari kuburnya {kecuali seperti orang yang berdiri sempoyongan} seperti orang gila {karena disurupi} dimasuki {setan. Demikian itu terjadi karena mereka berkata bahwa jual beli itu sama dengan riba. Allah telah menghalalkan jual beli dan mengharamkan riba. Siapa pun yang telah sampai kepadanya peringatan} maka siapa saja yang telah sampai kepadanya peringatan dan larangan {dari Tuhannya, lalu dia berhenti} dia berhenti dengan bertaubat dan kembali dari riba {maka sesuatu yang dimilikinya sebelumnya} harta yang diambil dari riba sebelum ada pengharamannya itu tidak membuatnya bersalah {dan urusannya dikembalikan kepada Allah. Siapa saja yang mengulangi} setelah adanya pengharaman itu dia kembali memakan riba karena dia menghalalkannya {mereka itulah penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "275. Setelah Allah menyebutkan tentang kondisi orang-orang yang berinfak dan apa-apa yang akan mereka dapatkan di sisi Allah dari segala kebaikan dan digugurkannya kesalahan dan dosa-dosa mereka, lalu Allah menyebutkan tentang orang-orang yang zhalim; para pemakan riba dan yang memiliki muamalah yang licik. Allah mengabarkan bahwa mereka akan diberi balasan menurut perbuatan mereka. Untuk itu, sebagaimana mereka saat masih di dunia dalam mencari penghidupan yang keji seperti orang-orang gila, mereka disiksa di alam barzakh dan pada Hari Kiamat, bahwa mereka tidak akan bangkit dari kubur mereka hingga Hari Kebangkitan dan hari berkumpulnya makhluk, “melainkan seperti berdirinya orang yang kemasukan setan lantaran (tekanan) penyakit gila.” Maksudnya, dari kegilaan dan kerasukan. Itu adalah siksaan, penghinaan, dan dipamerkannya segala dosanya, sebagai balasan untuk mereka atas segala bentuk riba mereka dan kelancangan mereka dengan berkata, “Sesungguhnya jual beli itu sama dengan riba.” Mereka menyatukan (dengan kelancangan mereka) antara apa yang dihalalkan oleh Allah dengan apa yang diharamkan olehNya hingga mereka membolehkan riba dengan hal itu. Allah kemudian menawarkan kepada orang-orang yang melakukan praktik riba dan selain mereka untuk bertaubat dalam FirmanNya, “Orang-orang yang telah sampai kepadanya nasihat (berupa larangan) dari Rabbnya,” sebuah penjelasan yang disertai dengan janji dan ancaman, “lalu berhenti (dari mengambil riba),” yakni dari apa yang mereka lakukan pada praktik riba, “maka baginya apa yang telah diambilnya dahulu (sebelum datang larangan),” dari perkara yang lancang ia lakukan, lalu ia bertaubat darinya, “dan urusannya (terserah) kepada Allah,” pada masa yang akan datang jika dia masih terus dalam taubatnya. Allah tidak akan melalaikan pahala orang-orang yang berbuat kebajikan. “Dan orang yang mengulangi (mengambil riba)” setelah penjelasan Allah dan peringatanNya serta ancamanNya terhadap orang yang memakan riba, “maka orang itu adalah penghuni-penghuni neraka; mereka kekal di dalamnya.” Di sini terkandung isyarat bahwa riba itu berkonsekuensi masuk neraka dan kekal di dalamnya. Hal itu karena kejelekannya, selama tidak ada yang menghalangi kekekalannya yaitu keimanan. Ini antara sejumlah hukum-hukum yang tergantung kepada terpenuhinya dan terbebasnya dari penghalang. Ayat ini bukan hujjah bagi Khawarij atau lainnya dari ayat-ayat ancaman. Yang wajib adalah meyakini semua nash-nash al-Quran maupun as-Sunnah, maka seorang Mukmin harus percaya dengan nash-nash yang diriwayatkan secara mutawatir yaitu akan keluarnya orang yang ada dalam hatinya keimanan walaupun seberat biji sawi dari neraka, dan dari hal yang merupakan perkara yang membinasakan yang memasukkan ke dalam neraka apabila ia tidak bertaubat darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يَأۡكُلُونَ ٱلرِّبَوٰاْ } Ya’kulûnarribâ: Mereka makan riba maknanya mengambil riba dan mengunakannya dengan memakannya ke dalam perut mereka dan selain hal itu. Riba yang dimaksud di sini adalah Riba nasi’ah, yaitu engkau mengutangkan uang kepada seseorang, apabila telah jatuh tempo untuk mengembalikan dan orang itu tidak dapat mengembalikannya maka engkau berkata kepadanya,”Tundalah dan tambahlah” lantas engkau menambah tempo pembayaran dan menambah jumlah yang harus dikembalikan. Inilah riba jahiliyah dan diamalkan oleh kebanyakan orang pada hari ini pada bank-bank konvensional. Mereka meminjamkan uang kepada nasabahnya jumlah tertentu dengan waktu pembayaran yang ditentukan, dan menambahkan bunga sebesar sepuluh persen, lebih ataupun kurang. Riba hukumnya haram berdasarkan Al-Qur’an, As-Sunnah dan kesepakatan ulama kaum muslimin, baik berupa riba fadhl maupun riba nasi’ah. { لَا يَقُومُونَ } Lâ yaqûmûna: Tidaklah mereka berdiri dari kuburnya pada hari kiamat. { يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ } Yatakhobbathuhusy syaithân: Dipukul oleh setan dengan pukulan yang tidak beraturan (kesurupan oleh setan). { مِنَ ٱلۡمَسِّۚ } Minal massi: Mass bermakna gila, dikatakan: Fulan kesurupan karena gila. { مَوۡعِظَةٞ } Mau’izhatan: Perintah atau larangan untuk meninggalkan riba { فَلَهُۥ مَا سَلَفَ } Falahû Mâ salafa: Tidak harus mengembalikan harta yang dulu telah didapatkannya sebelum bertaubat. Makna ayat: Setelah sebelumnya Allah Ta’ala menganjurkan untuk mengeluarkan sedekah dan menjanjikan bagi siapa saja yang mengeluarkannya dengan pahala yang besar dan berlipat ganda, kemudian Allah menyebutkan tentang para pelaku riba. Yaitu orang-orang yang melipatgandakan hartanya dengan cara riba, yang menyebabkan menutup jalan-jalan kebaikan, serta menggelincirkan orang dari jalan yang baik, karena mereka tidak menumbuhkan hartanya dengan cara sedekah, akan tetapi menumbuhkannya dengan jalan riba. Maka Allah Ta’ala menyebutkan keadaan mereka ketika bangkit dari kuburnya pada hari kiamat, mereka bangkit, kemudian duduk mengantuk dan jatuh lagi ke tanah seperti orang gila yang sedang kesurupan setan. Itulah tanda-tanda mereka pada harikiamat nanti, sebagaimana diketahui juga dari perut mereka yang kembung seperti kemah yang terpasang di depannya. Allah Ta’ala berfirman,”Orang-orang yang memakan riba itu dibangkitkan dari kubur mereka pada hari kiamat seperti orang yang kerasukan setan (gila).” Allah Ta’ala menyebutkan sebab kesengsaraan yang mereka dapatkan dalam firmanNya,”Hal itu” yaitu mereka mendapatkan adzab dan kehinaan disebabkan perbuatan mereka menolak hukum keharaman riba dan mengatakan,”Sesungguhnya jual beli itu sama dengan riba”. Karena riba merupakan tambahan yang didapat pada akhir saat pelunasan, sedangkan jual beli mendapat tambahan diawal saat transaksi. Lantas Allah membantah pernyataan mereka dalam firmanNya,”Padahal Allah telah menghalalkan jual beli dan mengharamkan riba.” Jadi selama Allah mengharamkan riba tidak ada kesempatan untuk menolaknya. Mereka lupa bahwasanya pertambahan pada jual beli itu termasuk dalam harga barang, mahal ataupun murah. Itu berjalan sesuai dengan hukum pasar. Tambahan yang terdapat pada akhir jual beli hanya terjadi pada waktu itu saja. Kemudian Allah Ta’ala menjelaskan kepada hamba-hambaNya tentang jalan keselamatan dan memperingatkan dari jalan kehancuran. Firman Allah,”Barangsiapa yang telah sampai kepadanya larangan dari Rabbnya” yaitu sampai berita tentang pengharaman riba serta laranganNya agar tidak mendekati riba, kemudian ia berhenti melakukan transaksi ribawi, maka baginya apa yang dulu dia dapatkan sebelum mengetahui hukum keharamannya, atau sebelum taubatnya. Adapun perkaranya setelah itu dikembalikan kepada Allah Ta’ala, jika Allah berkehendak akan meneguhkannya di atas taubat dan menyelamatkannya, dan jika berkehendak Allah akan menyesatkannya karena amalannya atau niatnya yang buruk, lalu ia binassa dan jatuh tersungkur. Inilah makna dari firman Allah Ta’ala,”Orang yang mengulangi (mengambil riba) maka orang itu adalah penghuni-penghuni neraka, mereka kekal di dalamnya.” Ini makna yang terkandung pada ayat (275) Pelajaran dari ayat: • Penjelasan tentang hukuman yang dirasakan para pemakan riba pada hari kiamat, karena mereka telah menghalalkan riba dan memakannya serta tidak mau bertaubat dari riba. • Keharaman riba dan setiap harta yang haram karena telah terdapat ayat yang berisikan ancaman yang keras. • Menetapkan sifat cinta bagi Allah Ta’ala dan Dia mencintai wali-waliNya yaitu orang-orang yang beriman dan taat. Begitu juga Allah membenci musuh-musuhNya yaitu orang-orang kafir kepadaNya dan bermaksiat dengan memakan riba dan melakukan dosa-dosa besar lainnya. • Kehalalan jual beli apabila terpenuhi syarat-syaratnya yang disebutkan dalam kitab-kitab fiqh. • Barangsiapa yang bertaubat dari riba akan diterima taubatnya, dan halal baginya apa yang didapatkan sebelum bertaubat dengan syarat yang disebutkan pada ayat setelah ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 275: Riba itu ada dua macam: Nasi'ah dan Fadhl. Riba Nasiah adalah pembayaran lebih yang disyaratkan oleh orang yang meminjamkan. Riba Fadhl adalah penukaran suatu barang dengan barang yang sejenis, tetapi lebih banyak jumlahnya karena orang yang menukarkan mensyaratkan demikian, seperti penukaran emas dengan emas, padi dengan padi, dan sebagainya. Riba yang dimaksud dalam ayat ini Riba nasiah yang umum terjadi di masyarakat Arab zaman jahiliyah. Dari kuburnya ketika dibangkitkan. Mereka dibangkitkan dari kuburnya seperti orang-orang yang mabuk sebagaimana orang yang kemasukan setan karena tekanan penyakit gila. Ada pula yang menafsirkan bahwa tindakan mereka di dunia mirip dengan orang gila, tidak tertata dalam hidupnya dan hilang akal sehatnya. Perkataan ini tidaklah keluar kecuali dari orang yang sangat bodoh atau pura-pura bodoh, maka Allah membalas mereka dengan balasan yang sesuai. Oleh karena itu, keadaan mereka nanti seperti orang gila. Karena maslahat jual beli yang merata baik bagi individu maupun masyarakat. Sedangkan dalam riba terdapat penindasan dan kezaliman. Riba yang sudah diambil (dipungut) sebelum turun ayat ini, boleh tidak dikembalikan. Berdasarkan keterangan Al Qur'an, As Sunnah dan ijma bahwa tauhid dan iman dapat menghalangi seseorang dari kekal di dalam neraka. Jika pada diri seseorang tidak ada tauhid, maka amal ini (memakan riba) sudah mampu membuatnya kekal di neraka, belum lagi ditambah dengan tidak adanya tauhid dan iman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 275",
    "description": "Orang-orang yang memakan riba yakni melakukan transaksi riba dengan mengambil atau menerima kelebihan di atas modal dari orang yang butuh dengan mengeksploitasi atau memanfaatkan kebutuhannya, tidak dapat berdiri, yakni melakukan aktivitas, melainkan seperti berdirinya orang yang kemasukan setan karena gila. Mereka hidup dalam kegelisahan; tidak tenteram jiwanya, selalu bingung, dan berada dalam ketidakpastian, sebab pikiran dan hati mereka selalu tertuju pada materi dan penambahannya. Itu yang akan mereka alami di dunia, sedangkan di akhirat mereka akan dibangkitkan dari kubur dalam keadaan sempoyongan, tidak tahu arah yang akan mereka tuju dan akan mendapat azab yang pedih. Yang demikian itu karena mereka berkata dengan bodohnya bahwa jual beli sama dengan riba dengan logika bahwa keduanya sama-sama menghasilkan keuntungan. Mereka beranggapan seper-ti itu, padahal Allah telah menghalalkan jual beli dan mengharamkan riba. Substansi keduanya berbeda, sebab jual beli menguntungkan kedua belah pihak (pembeli dan penjual), sedangkan riba sangat merugikan salah satu pihak. Barang siapa mendapat peringatan dari tuhannya, setelah sebelumnya dia melakukan transaksi riba, lalu dia berhenti dan tidak melakukannya lagi, maka apa yang telah diperolehnya dahulu sebelum datang larangan menjadi miliknya, yakni riba yang sudah diambil atau diterima sebelum turun ayat ini, boleh tidak dikembalikan, dan urusannya kembali kepada Allah. Barang siapa mengulangi transaksi riba setelah peringatan itu datang maka mereka itu penghuni neraka. Mereka kekal di dalamnya untuk selama-lamanya. Allah memusnahkan harta yang diperoleh dari hasil praktik riba sedikit demi sedikit sampai akhirnya habis, atau menghilangkan keberkahannya sehingga tidak bermanfaat dan menyuburkan sedekah yakni dengan mengembangkan dan menambahkan harta yang disedekahkan, serta memberikan keberkahan harta, ketenangan jiwa dan ketenteraman hidup bagi pemberi dan penerima. Allah tidak menyukai dan tidak mencurahkan rahmat-Nya kepada setiap orang yang tetap dalam kekafiran karena mempersamakan riba dengan jual beli dengan disertai penolakan terhadap ketetapan Allah, dan tidak mensyukuri kelebihan nikmat yang mereka dapatkan, bahkan menggunakannya untuk menindas dan mengeksploitasi kelemahan orang lain, dan Allah tidak menyukai setiap orang yang bergelimang dosa karena praktik riba tidak hanya merugikan satu orang saja, tetapi dapat meruntuhkan perekonomian yang dapat merugikan seluruh warga masyarakat."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Setelah Allah menceritakan tentang orang-orang yang berbuat kebaikan, berinfaq, membayar zakat, serta mengutamakan kebaikan dan sedekah kepada orang-orang yang membutuhkan dan kaum kerabat, yang mereka lakukan disetiap kondisi dan disetiap waktu, kemudian pada ayat ini Allah memulai pembahasan mengenai hokum memakan Riba dan harta orang lain dengan cara yang batil dan macam-macam syubhat, maka Allah memberitahukan tentang keadaan mereka nanti pada hari keluarnya mereka dari dalam kuburan mereka, dan bagaimana kondisi berdirinya mereka dari kuburan mereka sampai dibangkitkan oleh Allah dan dikumpulkan di mahsyar-Nya. Maka firman-Nya : الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ “Orang-orang yang memakan (mengambil) riba tidak dapat berdiri melainkan seperti orang-orang yang kerasukan syetan lantara penyakit gila” Maksudnya adalah orang-orang yang memakan riba mereka tidak bisa berdiri dari kuburan mereka pada hari kiamat kecuali seperti kondisi berdirinya orang gila yang sedang mengamuk dan kerasukan syetan, hal itu merupakan posisi berdiri yang tidak wajar. Ibnu Abbas berkata, “seorang pemakan riba akan dibangkitkan pada hari kiamat dalam keadaan gila yang tercekik” Ibnu majah telah berkata, telah mencertitakan kepada kami Abu bakar bin Abi syaibah, telah menceritakan kepada kami Alhasan bin Musa dari Hamad bin Salamah, dari Ali bin Zaid, dari Abi shalt, dari Abi hurairoh telah berkata, telah bersabda Rosululloh Shallallahu 'alaihi wa Sallam: أتيت ليلة أسري بي على قوم بطونهم كالبيوت ، فيها الحيات ترى من خارج بطونهم . فقلت : من هؤلاء يا جبريل ؟ قال : هؤلاء أكلة الربا “Aku telah didatangkan pada saat malam isro kepada suatu kaum yang perut mereka seperti rumah, di dalamnya ada ular-ular yang terlihat keluar dari perut-perut mereka. Maka aku bertanya, siapa gerangan mereka itu wahai Jibril ?, maka dia menjawab “mereka itu adalah pemakan riba”. (HR : Ibnu Majah) Imam Bukhori meriwayatkan dari Samuroh bin Jundub dalam hadit panjang tentang mimpi فأتينا على نهر حسبت أنه كان يقول : أحمر مثل الدم وإذا في النهر رجل سابح يسبح ، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة ، وإذا ذلك السابح يسبح ، [ ما يسبح ] ثم يأتي ذلك الذي قد جمع الحجارة عنده فيفغر له فاه فيلقمه حجرا “maka tibalah kami disebuah sungai, aku menduga ia mengatakan “sungai itu merah semerah darah”, ternyata disungai tersebut terdapat sorang yang sedang berenang dan dipinggirnya terdapat seorang yang telah mengumpulkan batu yang sangat banyak di sampingnya. Orang itu pun berenang mendatangi orang yang mengumpulkan batu itu. Kemudian orang yang berenang itu membuka mulutnya, lalu ia menyuapinya dengan batu”. (HR. Bukhori) Dan disebutkan dalam tafsir hadits ini bahwa dia itu adalah pemakan riba. Firman-Nya : ذَٰلِكَ بِأَنَّهُمْ قَالُوا إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَا “keadaan mereka yang demikian itu disebabkan mereka berkata (berpendapat), sesungguhnya jual beli itu sama dengan riba”. Maksudnya, mereka memboleh riba dengan maksud untuk menetang hokum-hukum Allah yang terdapat dalam syari’at-Nya. Bukan karena mereka mengqiyaskan riba dengan jual beli, sebab orang-orang musyrik tidak pernah mengakui penetapan jual beli yang telah ditetapkan Allah Subhanahu wa Ta'ala di dalam Alquran. Seandainya hal itu termasuk masalah qiyas, niscaya mereka akan mengatakan “إنما الربا مثل البيع” (sesungguhnya riba itu seperti jual beli). Tatapi dalam hal ini mereka justru mengatakan “إنما البيع مثل الربا” (sesungguhnya jual beli itu seperti riba). Artinya, keduanya serupa, lalu mengapa Dia mengaharamkan yang ini dan menghalalkan yang itu?. Yang demikian itu merupakan penetangan mereka terhadap syariat. Artinya, yang ini sama dengan ini, dan Dia sendiri telah menghalalkan yang ini dan mengharamkan yang ini. Maka Allah berfirman : وَأَحَلَّ اللَّهُ الْبَيْعَ وَحَرَّمَ الرِّبَا “Padahal Allah telah menghalakan jual beli dan mengharamkan riba”. Hal itu mungkin merupakan bagian dari kesempurnaan kalam Allah sebagai penolakan terhadap apa yang mereka katakana sebelumnya, padahal mereka sebetulnya telah mengetahui perbedaan hokum yang ditetapkan oelh Allah antara jual beli dan riba. Dia lah Allah yang Maha mengetahi lagi Maha bijaksana, tidak ada yang dapat menolak ketetapan-Nya dan Allah tidak dimintai pertanggung jawaban atas apa yang telah Ia kerjakan, justru merekalah yang akan dimintai pertanggung jawaban. Karenanya Allah berfirman : فَمَن جَاءَهُ مَوْعِظَةٌ مِّن رَّبِّهِ فَانتَهَىٰ فَلَهُ مَا سَلَفَ وَأَمْرُهُ إِلَى اللَّهِ “Orang-orang yang telah sampai padanya larangan dari rabbnya, lalu terus berhenti (dari mengambil riba), maka baginya apa yang telah diambil dahulu (sebelum datangnya larangan), dan urusannya terserah kepada Allah”. Maksudnya, barang siapa yang telah sampai kepadanyalarangan memakan riba, lalu ia mengakhirinya ketika syariat sampai kepadanya, maka baginya hasil muamalah terdahulu. Yang demikian itu berdasarkan firman-Nya : عفا الله عما سلف “Allah memaafka apa yang telah berlalu” (QS. Al-Maidah : 95) Dan berdasarkan sabda Rosululloh Shallallahu 'alaihi wa Sallam pada saat pembebasan kota Mekah : وكل ربا في الجاهلية موضوع تحت قدمي هاتين ، وأول ربا أضع ربا العباس “segala bentuk riba pada masa jahiliyah diletakkan di bawah kedua kakiku ini, dan riba yang pertama kali aku letakkan adalah riba ‘Abbas”. Rosululloh tidak memerintahkan mereka mengembalikan keuntungan yang mereka peroleh pada masa jahiliyah, tetapi Allah telah memaafkan mereka atas apa yang telah berlalu. Kemuadian firman-Nya : وَمَنْ عَادَ فَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ “Dan barang siapa yang mengulangi (mengambilnya), maka mereka itu adala penghuni nereka, mereka kekal di dalamya” Maksudnya, barang siapa yang kembali mengambil riba, dan mengerjakannya setelah samapai kepada mereka larangan tersebut, maka wajib baginya hukuman atas perbuatannya yatiu mereka akan menjadi penghuni neraka dan akan kekal di dalamnya. Masalah riba ini merupakan masalah yang paling rumit menurut kebanyakan ulama. Amirul mukminin, Umar bin Khottob pernah mengatakan, “tiga hal yang seandainya saja Rosululloh Shallallahu 'alaihi wa Sallam mewasiatkan kepada kami dengan suatu wasiat yang dapat memuaskan kami yaitu dalam masalah; aljaddu (bagian warisan kakek), al-kalalah (orang yang meninggal tidak meninggalkan ayah dan anak), dan beberapa masalah riba. Maksudnya adalah sebagian masalah yang di dalamnya terdapat percampuran riba, sedangkan syariat telah menetapkan bahwa sarana yang mengantarkan kepada yang haram adalah haram, sebagaimana tidak sempurnanya suatu kewajiban kecuali dengan sesuatu, maka sesuatu itu menjadi wajib. Di dalam kitab shohihain (Bukhori dan Muslim) telah ditegaskan sebuah hadits tentang hokum-hukum dalam syariat Allah yang diriwayatkan oleh Bukhori dan Muslim dari Nu’man bin basyir, ia menceritakan, aku pernah mendengar Rosululloh Shallallahu 'alaihi wa Sallam bersabda : إن الحلال بين وإن الحرام بين ، وبين ذلك أمور مشتبهات ، فمن اتقى الشبهات استبرأ لدينه وعرضه ، ومن وقع في الشبهات وقع في الحرام ، كالراعي يرعى حول الحمى يوشك أن يرتع فيه \" “sesungguhnya yang halal itu telah jelas, dan yang haram pun telah jelas, dan diantara keduanya terdapat perkara-perkara yang samar (diragukan). Barangsiapa yang menjaga dirinya dai perkara yang diragukan, berarti dia telah menyelamatkan agama dan kehormatannya. Dan barangsiapa yang terjerumus ke dalam keraguan, berarti dia telah terjerumus ke dalam perkara yang haram. Seperti penggembala yang menggembalakan ternaknya di sekitar daerah larangan, lambat laun ia akan masuk ke dalamnya”. (HR. Bukhori dan Muslim) Imam Ahmad meriwayatkan, bahwa Umar bin Khottob pernah mengatakan, “ayat yang terahir kali turun kepada Rosululloh adalah ayat tentang riba, dan sesungguhnya beliau telah dipanggil ke hadirat-Nya sebelum menjelaskan tafsirnya kepada kami. Oleh karena itu, tinggalkanlah riba dan keraguan”. Ibnu Majah meriwayatkan dari Abdulloh Bin Mas’ud, dari Nabi Muhammad Shallallahu 'alaihi wa Sallam bersabda: الربا ثلاثة وسبعون بابا ورواه الحاكم وزاد : أيسرها أن ينكح الرجل أمه ، وإن أربى الربا عرض الرجل المسلم “Riba itu ada 73 pintu” Dalam riwayat Imam al-hakim ditambahkan: “yang paling ringan dari riba itu seperti seorang menikahi ibunya sendiri, dan sejahat-jahat riba adalah mengganggu kehormatan seorang muslim” Imam Ahmad meriwayatkan dari Abu Hurairoh bahwa rosululloh Shallallahu 'alaihi wa Sallam pernah bersabda : يأتي على الناس زمان يأكلون فيه الربا \" قال : قيل له : الناس كلهم ؟ قال : \" من لم يأكله منهم ناله من غباره “Akan datang suatu masa dimana manusia banyak memakan riba”. Lalu ditanyakan kepada Rosululloh Shallallahu 'alaihi wa Sallam, “apakah manusia secara keseluruhan?”, Beliau menjawab, “yang tidak memakannya pun akan terkena debunya” (HR. Ahmad) Dalam hadits yang lain Rosululoh Shallallahu 'alaihi wa Sallam bersabda : لعن الله آكل الربا وموكله ، وشاهديه وكاتبه “Allah melaknat orang yang memakan riba, yang mewakili transaksi riba, dua saksinya, dan yang menuliskannya”"
  }
]