[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah melenyapkan seluruh riba dan mengharamkan pelakunya dari mendapat keberkahan hartanya maka dia tida dapat menfaat darinya, dan menumbuhkan sedekah serta memperbanyaknya melipat gandakan pahala bagi orang-orang yang bersedekah dan memberkahi mereka dalam harta kekayaan mereka. Dan Allah tidak menyukai orang yang tetap bersikeras di atas kekafirannya, menghalalkan makanan hasil riba, lagi tak henti-hentinya dalam perbuatan dosa dan perkara haram serta maksiat-maksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "276. Allah akan membinasakan dan melenyapkan harta yang diperoleh dari riba, baik secara kongkrit dengan hilang atau rusaknya harta tesebut, maupun secara abstrak dengan hilangnya berkah dari harta tersebut. Dan Allah akan menambah dan mengembangkan sedekah dengan melipatgandakan pahalanya. Maka satu kebajikan akan dibalas dengan sepuluh kebaikan hingga 700 kali lipat, bahkan tidak terhingga. Allah akan memberikan berkah-Nya kepada harta orang-orang yang bersedekah. Dan Allah tidak menyukai orang-orang yang kafir lagi ingkar, menghalalkan apa yang diharamkan, dan bergelimang maksiat dan dosa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "276. Allah akan menghancurkan harta riba dan menghilangkan keberkahannya, dan memberkahi harta yang disedekahkan sebagiannya. Allah tidak menyukai orang yang terus menerus berbuat kafir dan dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "276. يَمْحَقُ اللهُ الرِّبَوٰا۟ (Allah memusnahkan riba) Yakni menghilangkan berkahnya di dunia meski harta itu banyak. وَيُرْبِى الصَّدَقٰتِ ۗ ( dan menyuburkan sedekah) Yakni menamabah harta yang dikeluarkan sedekahnya, memberkahi dan menambah pahalanya dan melipatgandakannya. وَاللهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ (Dan Allah tidak menyukai setiap orang yang tetap dalam kekafiran, dan selalu berbuat dosa) Yakni karena kecintaan Allah khusus untuk orang-orang yang bertaubat. Dalam ayat ini terdapat ancaman yang besar atas orang yang mengambil riba dan mengatakan perkataan tentang riba yang tersebut tadi karena Allah menghukuminya dengan kekafiran. Rasullullah bersabda: barangsiapa yang bersedekah dengan seukuran buah kurma dari hasil jerih payahnya yang baik -dan Allah tidak menerima kecuali yang baik- maka Allah akan menerimanya dengan tangan kanan-Nya kemudian merawatnya untuknya sebagaimana seorang diantara kalian yang merawat >>>>>>hingga tumbuh sebesar bukit."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ } Perhatikanlah hikmahnya bagaimana Allah membinasakan harta-harta pemakan riba dan mengangkat derajat dan kekayaan bagi mereka yang memeranginya, sebagaimana yang telah mereka perbuat terhadap harta-harta manusia dengan membinasakannya melalui transaksi riba, maka tidak sedikit kamu dapati orang-orang yang menghidupkan perbuatan ini melainkan pada akhirnya mereka berada dalam kebinasaan. 2 ). { يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ } Hal ini bertolak belakang dengan apa yang diketahui oelh sebagian besar ummat manusia, bahwa mengeluarkan harta untuk kebaikan akan mengurangi harta, dan dengan transaksi riba atau bunga akan melebihkannya; maka ketahuilah bahwasanya segala bentuk rezeki datangnya dari Allah, dan segala sesuatu yang diharapkan kehadirannya dari Allah akan terwujud hanya dengan ketaatan kepada-Nya, maka orang-orang berani menghidupkan riba akan mendapat balasan dari Allah bertolak belakang dengan apa yang ia kehendaki. 3 ). Sebagaimana yang diketahui bahwasanya Allah memusnahkan riba { يَمْحَقُ اللهُ الرِّبَوٰا۟ } , dan sesungguhnya Allah juga membinasakan orang-orang kafir { وَلِيُمَحِّصَ اللَّهُ الَّذِينَ آمَنُوا وَيَمْحَقَ الْكَافِرِينَ } \"Dan agar Allah membersihkan orang-orang yang beriman (dari dosa mereka) dan membinasakan orang-orang yang kafir\" [ali Imran : 141], maka bagaimana jika kekufuran dan riba berkumpul dalam diri seseorang ?! dan yang menakjubkan bawasanya dalam al-Qur'an tidak tercantum lafazh { يَمْحَقُ } kecuali di dua tempat ini. 4 ). { يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ } Tampak dari kata ( كفار ) bahwa orang yang disifatkan kedanya sifat ini adalah orang yang telah menerobos begitu banyak tahapan-tahapan yang membuatnya lupa kepada Allah, dan telah melampaui batas-batas yang telah ditetapkan oleh Allah, sampai kekufuran itu menetap dalam dirinya menjadi kegelapan yang tak bercelah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "276. Allah melenyapkan kebaikan riba dan juga harta dunia yang dicampur dengan riba sekalipun itu banyak, dan Dia menyuburkan sedekah dan menambahkan harta yang dikeluarkan untuk sedekah dan melipatkan pahala bagi orang yang bersedekah. Allah itu menghukum setiap orang yang sangat kufur dan memiliki banyak dosa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menghilangkan riba} Allah menghilangkan keberkahan riba dan menghancurkan harta yang masuk dalam riba {dan menyuburkan} dan ingin menumbuhkan {sedekah. Allah tidak menyukai setiap orang yang sangat kufur lagi bergelimang dosa} berlebihan dalam dosa karena memakan riba"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "276. Kemudian Allah mengabarkan bahwasanya Dia akan memusnahkan hasil usaha orang-orang yang berpraktik riba dan menyuburkan sedekah orang-orang yang berinfak. Ini berlawanan dengan apa yang terbersit pada pikiran sebagian besar orang bahwa berinfak itu akan mengurangi harta dan bahwa riba itu akan menambahnya. Karena materi rizki dan mendapatkan buah hasilnya adalah dari Allah, dan apa yang ada di sisi Allah tidaklah bisa didapatkan kecuali dengan ketaatan kepadaNya dan melaksanakan perintahNya. Maka orang yang lancang melakukan praktik riba, Allah akan menghukumnya dengan apa yang berlawanan dengan tujuannya. Ini telah terbukti dan dapat dilihat dalam praktik nyata dalam kehidupan sehari-hari. Dan siapakah yang lebih benar perkataannya daripada Allah? “Dan Allah tidak menyukai setiap orang yang tetap dalam kekafiran, dan selalu berbuat dosa,” yaitu orang yang tetap dalam kekafiran, dan selalu berbuat dosa,” yaitu orang yang kafir terhadap nikmat Allah, mengingkari karunia Rabbnya dan berbuat dosa dengan selalu melakukan kemaksiatan. Pemahaman ayat ini adalah bahwa Allah sangat menyukai orang yang gemar bersyukur terhadap nikmat-nikmat, bertaubat dari segala dosa dan kesalahan, kemudian Allah menyisipkan ayat yang satu berikut ini dalam ayat-ayat riba yaitu FirmanNya,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ } Yamhaqullâhur ribâ: Allah menghilangkannya sedikit demi sedikit sampai-sampai tidak tersisa sedikitpun sebagaimana menghilangnya bulan di akhir bulan. { وَيُرۡبِي ٱلصَّدَقَٰتِۗ } Wayurbish shadaqât: Allah Ta’ala memberkahi harta yang dikeluarkan untuk sedekah, menambahkannya dan melipat gandakan pahalanya berkali kali lipat. { كَفَّارٍ أَثِيمٍ } Kaffârin atsîm: Al-Kaffâr bermakna orang yang sangat ingkar. Ingkar terhadap semua kebenaran, keadilan dan kebaikan. Âtsîm maknanya orang yang menjerumuskan diri dalam dosa, tidak meninggalkan dosa besar dan dosa kecil dan terus melakukannya. Makna ayat: Allah Ta’ala mengabarkan bahwa Dia dengan keadilanNya telah menghapuskan riba, dan dengan keutamaanNya telah menyuburkan sedekah, dan Dia tidak mencintai setiap orang yang ingkar terhadap syariatNya dan batasan-batasanNya dan orang-orang yang terjerumus dalam dosa dan maksiat. Pelajaran dari ayat: • Ancaman Allah akan menghilangkan (keberkahan, pent) harta riba dan janjiNya untuk menyuburkan (pahala, pent) sedekah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 276: Ang dimaksud dengan memusnahkan riba ialah memusnahkan harta itu atau meniadakan berkahnya. Sedangkan yang dimaksud dengan menyuburkan sedekah ialah mengembangkan harta yang telah dikeluarkan sedekahnya atau melipat gandakan pahalanya serta memberkahi harta itu. Karena menghalalkan riba. Ada pula yang menafsirkan \"kafir\" di sini dengan kufur nikmat karena tidak menunaikan kewajiban pada hartanya. Maksudnya ialah orang-orang yang menghalalkan riba dan tetap melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 276",
    "description": "Allah memusnahkan harta yang diperoleh dari hasil praktik riba sedikit demi sedikit sampai akhirnya habis, atau menghilangkan keberkahannya sehingga tidak bermanfaat dan menyuburkan sedekah yakni dengan mengembangkan dan menambahkan harta yang disedekahkan, serta memberikan keberkahan harta, ketenangan jiwa dan ketenteraman hidup bagi pemberi dan penerima. Allah tidak menyukai dan tidak mencurahkan rahmat-Nya kepada setiap orang yang tetap dalam kekafiran karena mempersamakan riba dengan jual beli dengan disertai penolakan terhadap ketetapan Allah, dan tidak mensyukuri kelebihan nikmat yang mereka dapatkan, bahkan menggunakannya untuk menindas dan mengeksploitasi kelemahan orang lain, dan Allah tidak menyukai setiap orang yang bergelimang dosa karena praktik riba tidak hanya merugikan satu orang saja, tetapi dapat meruntuhkan perekonomian yang dapat merugikan seluruh warga masyarakat. Setelah dijelaskan pelaku kemaksiatan yang berupa praktik riba, selanjutnya dijelaskan keadaan orang-orang saleh yang beruntung. Sungguh, orang-orang yang beriman, mengerjakan kebajikan, melaksanakan salat secara benar, khusyuk, dan berkesinambungan dan menunaikan zakat dengan sempurna, mereka mendapat pahala di sisi tuhannya. Tidak ada kekhawatiran terhadap mereka kapan dan dari siapa pun, karena mereka berada dalam lindungan Allah dan mereka tidak bersedih hati karena apa yang mereka akan peroleh di akhirat jauh lebih baik dari apa yang bisa jadi hilang di dunia."
  }
]