[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman (dengan membenarkan) Allah dan rosul Nya, mengerjakan amal-amal shalih, menjalankan shalat sebagaimana diperintahkan Allah dan RasulNya, dan mengeluarkan zakat harta mereka, maka bagi mereka pahala besar yang khusus diperuntukkan bagi mereka di sisi Tuhan mereka dan Pemberi rizki meraka. Tidak ada rasa takut yang membuntuti mereka di kehidupan akhirat mereka, dan tidak ada kesediahan terhadap kenikmatan-kenikmatan duniawi yang luput dari tangan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "277. Sesungguhnya orang-orang yang beriman kepada Allah, mengikuti Rasul-Nya, beramal saleh, menunaikan salat secara sempurna sesuai dengan ketentuan syariat, dan membayarkan zakat kepada orang yang berhak menerimanya, mereka itu akan mendapatkan ganjaran dari Rabb mereka, tidak ada ketakutan bagi mereka dalam menghadapi urusan di masa depan, dan tidak bersedih atas kesenangan dan kenikmatan dunia yang tidak mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "277. Allah mengabarkan bahwa orang-orang yang beriman kepada Allah dan rasul-Nya, baik dalam amalannya, mendirikan shalat pada waktunya dengan menyempurnakan syarat dan rukunnya, dan membayar zakat akan mendapatkan pahala yang besar dari Tuhan mereka, tidak ada yang akan mereka takutkan di hari perhitungan dan mereka tidak bersedih dengan kenikmatan dunia yang luput dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "277. Sesungguhnya orang-orang yang beriman kepada Allah, dan mengerjakan amal shalih berupa meninggalkan riba, menunaikan shalat fadhu dengan rukun dan syarat-syaratnya, dan membayar zakat, maka bagi mereka itu pahala amal ibadah mereka di sisi Tuhan di akhirat. Tidak ada kekhawatiran bagi mereka atas azab hari kiamat, dan tidak pula mereka bersedih atas apa yang mereka tinggalkan di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang beriman, beramal shalih, menegakkan shalat, dan menunaikan zakat, bagi mereka itu pahala di sisi Tuhan mereka. Tidak ada rasa takut pada mereka dan tidak (pula) mereka bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "277-279. “Sesungguhnya orang-orang yang beriman, mengerjakan amal shalih, mendirikan shalat dan menunaikan zakat…” adalah untuk menjelaskan bahwa sebesar-besarnya sebab untuk menjauhkan diri dari apa yang diharamkan oleh Allah dari pendapatan-pendapatan ribawi adalah menyempurnakan keimanan dan hak-haknya, khususnya menegakkan shalat dan menunaikan zakat, karena shalat itu mencegah dari perbuatan yang keji dan mungkar. Dan zakat adalah kebajikan kepada makhluk yang meniadakan praktik riba yang jelas-jelas merupakan kezhaliman bagi mereka dan keburukan atas mereka. Kemudian Allah mengahadapkan firmaNya kepada kaum Mukminin dan memerintahkan mereka agar bertakwa kepadaNya dan agar mereka meninggalkan muamalah-muamalah dengan riba yang mereka kerjakan sebelumnya, dan bahwa bila mereka tidak melakukan hal itu, maka sesungguhnya mereka itu telah memerangi Allah dan RasulNya. Inilah bukti yang paling jelas yang di akibatkan oleh kebusukan riba, di mana Allah menjadikan orang-orang yang suka berpraktik riba, menjadi orang-orang yang memerangi Allah dan RasulNya. Kemudian Allah berfirman,”Dan jika kamu bertaubat. ”Maksudnya, dari muamalah ribawiyah,” maka begitu pokok hartamu; kamu tidak menganiaya,” manusia lain dengan mengambil riba, ”dan tidak pula di aniaya” dengan tindakan kalian dengan pokok harta kalian. Maka saipapun yang bertaubat dari riba walaupun muamalah yang telah berlalu adalah miliknya, maka perkaranya akan di perhatikan Allah. Namun bila muamalahnya masih berjalan, wajiblah ia hanya mengambil pokok hartanya saja. Dan apa bila ia mengambilnya lebih dari itu,maka ia telah berani melakuakan riba. Ayat ini merupakan penjelasan akan hikmah (diharamkanya riba) dan bahwa riba itu meliputi kezhaliman bagi orang-orang yang membutuhkan dengan mengambil tambahan dan melipat gandakan riba atas mereka, padahal dia seharusnya menangguhkan mereka. Oleh karena itu Allah berfirman;"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Pada ayat (277) terdapat janji dari Allah yang benar dan kabar gembira bagi orang-orang yang beriman dan beramal shalih serta mendirikan shalat sebagaimana yang diperintahkan dan memberikan zakat, bahwa mereka akan mendapatkan pahala yang cukup di sisi Rabbnya dan akan menerimanya pada saat membutuhkannya di hari kiamat. Mereka tidak akan merasakan takut terhadap apa yang akan dihadapinya dalam kehidupan dunia dan akhirat, serta tidak bersedih juga baik di dunia maupun di akhirat. Pelajaran dari ayat: • Kabar gembira dari Allah ta’ala kepada orang-orang yang beriman dan beramal shalih serta mendirikan shalat dan mengeluarkan zakat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 277",
    "description": "Setelah dijelaskan pelaku kemaksiatan yang berupa praktik riba, selanjutnya dijelaskan keadaan orang-orang saleh yang beruntung. Sungguh, orang-orang yang beriman, mengerjakan kebajikan, melaksanakan salat secara benar, khusyuk, dan berkesinambungan dan menunaikan zakat dengan sempurna, mereka mendapat pahala di sisi tuhannya. Tidak ada kekhawatiran terhadap mereka kapan dan dari siapa pun, karena mereka berada dalam lindungan Allah dan mereka tidak bersedih hati karena apa yang mereka akan peroleh di akhirat jauh lebih baik dari apa yang bisa jadi hilang di dunia. Wahai orang-orang yang beriman! bertakwalah kepada Allah dengan menghindari jatuhnya siksa dari Allah antara lain akibat praktik riba, dan tinggalkan sisa riba yang belum dipungut sampai datangnya larangan riba jika kamu benar-benar orang beriman yang konsisten dalam perkataan dan perbuatan."
  }
]