[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah den mengikuti RasulNya, takutlah kepada Allah, dan tinggalkanlah usaha untuk meminta sisa dari uang tambahan (riba) selain harta pokok kalian yang merupakan milik kalian sebelum diharamkan riba, jika kalian memang merealisasikan keimanan kalian dalam bentuk ucapan dan perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "278. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya, takutlah kalian kepada Allah dengan cara menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan janganlah kalian menuntut harta riba yang tersisa untuk kalian di tangan orang lain, jika kalian benar-benar beriman kepada Allah dan percaya akan keharaman harta riba."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "278. Allah memperingatkan orang-orang beriman: takutlah kepada Allah dan tinggalkanlah riba yang kalian ambil sebelum ia diharamkan jika kalian benar-benar beriman kepada Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "278. وَذَرُوا۟ مَا بَقِىَ مِنَ الرِّبَوٰٓا۟ (dan tinggalkan sisa riba) Yakni tinggalkanlah sisa riba miikimu yang masih tersisa. إِن كُنتُم مُّؤْمِنِينَ ( jika kamu orang-orang yang beriman) Yakni dengan sebenar-benarnya iman, karena hal itu membutuhkan ketaatan untuk menjalankan perintah Allah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "278. Wahai orang-orang mukmin, bertakwalah kepada Allah dengan menunaikan perintah-perintahNya dan menjauhi larangan-laranganNya. Dan tinggalkanlah sesuatu yang masih tersisa pada diri kalian berupa riba yang masih belum dipungut jika kalian benar-benar orang mukmin. Dan keimanan itu mendorong untuk mematuhi syariat Allah. Ayat ini dan setelahnya turun untuk Bani Amr bin Auf bin Tsaqif dan Bani Mughirah dari Bani Makhzum yang menginginkan seluruh riba (uang tambahan) setelah Fathu Makkah dengan mengadukannya kepada Gubernur Mekkah yaitu Ittab bin Usaid bahwa mereka masih memiliki uang tambahan di sisi kaum Tsaqif. Lalu Itab membuat hukum tersebut dengan rasulullah SAW, lalu turunlah ayat ini dan ayat setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan tinggalkanlah} tinggalkanlah mencari {sisa riba jika kalian orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "277-279. “Sesungguhnya orang-orang yang beriman, mengerjakan amal shalih, mendirikan shalat dan menunaikan zakat…” adalah untuk menjelaskan bahwa sebesar-besarnya sebab untuk menjauhkan diri dari apa yang diharamkan oleh Allah dari pendapatan-pendapatan ribawi adalah menyempurnakan keimanan dan hak-haknya, khususnya menegakkan shalat dan menunaikan zakat, karena shalat itu mencegah dari perbuatan yang keji dan mungkar. Dan zakat adalah kebajikan kepada makhluk yang meniadakan praktik riba yang jelas-jelas merupakan kezhaliman bagi mereka dan keburukan atas mereka. Kemudian Allah mengahadapkan firmaNya kepada kaum Mukminin dan memerintahkan mereka agar bertakwa kepadaNya dan agar mereka meninggalkan muamalah-muamalah dengan riba yang mereka kerjakan sebelumnya, dan bahwa bila mereka tidak melakukan hal itu, maka sesungguhnya mereka itu telah memerangi Allah dan RasulNya. Inilah bukti yang paling jelas yang di akibatkan oleh kebusukan riba, di mana Allah menjadikan orang-orang yang suka berpraktik riba, menjadi orang-orang yang memerangi Allah dan RasulNya. Kemudian Allah berfirman,”Dan jika kamu bertaubat. ”Maksudnya, dari muamalah ribawiyah,” maka begitu pokok hartamu; kamu tidak menganiaya,” manusia lain dengan mengambil riba, ”dan tidak pula di aniaya” dengan tindakan kalian dengan pokok harta kalian. Maka saipapun yang bertaubat dari riba walaupun muamalah yang telah berlalu adalah miliknya, maka perkaranya akan di perhatikan Allah. Namun bila muamalahnya masih berjalan, wajiblah ia hanya mengambil pokok hartanya saja. Dan apa bila ia mengambilnya lebih dari itu,maka ia telah berani melakuakan riba. Ayat ini merupakan penjelasan akan hikmah (diharamkanya riba) dan bahwa riba itu meliputi kezhaliman bagi orang-orang yang membutuhkan dengan mengambil tambahan dan melipat gandakan riba atas mereka, padahal dia seharusnya menangguhkan mereka. Oleh karena itu Allah berfirman;"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ٱتَّقُواْ ٱللَّهَ } Ittaqûllâh: Takutlah terhadap hukuman Allah dengan menjalankan ketaatan kepadaNya. Ketaatanmu akan menjadi pelindung bagimu dari kemurkaan dan hukuman Allah. { وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ } Wadzarû Mâ baqiya minarribâ: Tinggalkanlah transaksi-transaksi ribawi yang masih tersisa. Makna ayat: Selaras dengan penyebutan hukuman yang akan didapatkan oleh pemakan riba pada ayat sebelumnya, Allah Ta’ala menyeru hamba-hambaNya yang beriman dengan memerintahkan mereka untuk bertakwa kepadaNya. Hal itu direalisasikan dengan melakukan ketaatan dan meninggalkan kemaksiatan, serta dengan meninggalkan transaksi-transaksi ribawi yang masih tersisa pada beberapa orang. Allah meningatkan mereka dengan memanggil keimanannya karena seorang mukmin adalah orang yang bersegera untuk menyambut seruan Allah dan segera melaksanakan perintahNya dan meninggalkan laranganNya. Allah Ta’ala berfirman,”Wahai orang-orang yang beriman bertakwalah kepada Allah dan tinggalkanlah sisa riba (yang belum dipungut) jika kamu orang-orang yang beriman.” Pelajaran dari ayat: • Kewajiban bertaubat dari riba dan setiap maksiat-maksiat yang menggoda. • Wajib bagi penguasa untuk memerangi orang-orang yang terus melakukan transaksi-transaksi ribawi dengan memukul kedua tangannya, sampai meninggalkan riba."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 278: Karena iman itu menghendaki untuk mengikuti perintah Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 278",
    "description": "Wahai orang-orang yang beriman! bertakwalah kepada Allah dengan menghindari jatuhnya siksa dari Allah antara lain akibat praktik riba, dan tinggalkan sisa riba yang belum dipungut sampai datangnya larangan riba jika kamu benar-benar orang beriman yang konsisten dalam perkataan dan perbuatanjika kamu tidak melaksanakannya, yakni apa yang diperintahkan ini, sehingga kamu memungut sisa riba yang belum kamu pungut, maka yakinlah akan terjadi perang yang dahsyat dari Allah dan rasul-Nya antara lain berupa bencana dan kerusakan di dunia, dan siksa pedih di akhirat. Tetapi jika kamu bertobat, yakni tidak lagi melakukan transaksi riba dan melaksanakan tuntunan ilahi, tidak memungut sisa riba yang belum dipungut, maka perang tidak akan berlanjut, bahkan kamu berhak atas pokok hartamu dari mereka. Dengan demikian, kamu tidak berbuat zalim atau merugikan dengan membebani mereka pembayaran utang melebihi apa yang mereka terima dan tidak dizalimi atau dirugikan karena mereka membayar penuh sebesar utang yang mereka terima."
  }
]