[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian belum juga berhenti dari perkara yang Allah melarang kalian melakukannya, maka yakinlah akan perang dari Allah dan RasulNya (terhadap kalian). Dan jika kalian mau kembali kepada Tuhan kalian, dan kalian tinggalkan makan riba,maka kalian boleh mengambil harta yang kalian hutangkan, tanpa mengambil tambahan. Maka kalian tidak mendzhalimi siapa pun, dengan mengambil tambahan melebihi harta pokok kalian, dan tidak ada seorangpun yang mendzhalimi kalian dengan mengurangi harta yang kalian hutangkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "279. Jika kalian tidak melakukan apa yang diperintahkan kepada kalian maka ketahuilah dan yakinilah akan adanya pernyataan perang dari Allah dan Rasul-Nya. Jika kalian kembali kepada Allah dan meninggalkan kebiasaan mengambil riba, maka kalian tetap berhak atas modal yang kalian pinjamkan. Kalian tidak boleh menzalimi seseorang dengan memungut tambahan (bunga) atas modal kalian, dan kalian juga tidak dizalimi dengan dikurangi modal kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "279. Jika kalian tidak berhenti dari berinteraksi dengan riba maka yakinlah bahwa kalian sedang dalam peperangan dengan Allah dan rasul-Nya, sebagai hukuman di dunia dan akhirat. Namun jika kalian berhenti dari berinteraksi dengan riba maka bagi kalian harta yang kalian pinjamkan tanpa mengambil bunganya, dengan begitu kalian tidak menzalimi orang lain dengan mengambil bunga darinya dan tidak pula dizalimi dengan tidak berkurangnya harta yang kalian pinjamkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "279. فَإِن لَّمْ تَفْعَلُوا۟ ( Maka jika kamu tidak mengerjakan) Yakni apa yang diperintahkan kepada kalian berupa ketakwaan dan meninggalkan sisa dari riba. فَأْذَنُوا۟ بِحَرْبٍ مِّنَ اللهِ وَرَسُولِهِۦ ۖ ( maka ketahuilah, bahwa Allah dan Rasul-Nya akan memerangimu) Maka atas pemimpin kaum muslimin untuk mengumumkan kepada mereka peperangan sampai mereka meninggalkan riba. Dari Ibnu Abbas ia berkata: barangsiapa yang tetap menjalankan riba maka wajib bagi pemimpin kaum muslimin untuk memintanya agar bertaubat, jika ia bertaubat maka itulah yang diharapkan dan apabila tidak maka hukumannya adalah potong leher. Dan ayat ini menunjukkan bahwa memakan harta riba dan mengamalkan riba termasuk dalam dosa besar. وَإِن تُبْتُمْ (Dan jika kamu bertaubat ) Yakni bertaubat dari riba. فَلَكُمْ رُءُوسُ أَمْوٰلِكُمْ (maka bagimu pokok hartamu ) Yang bisa kalian ambil. لَا تَظْلِمُونَ ( kamu tidak menganiaya) Yakni menganiaya penghutang dengan mengambil tambahan darinya. وَلَا تُظْلَمُونَ (dan tidak (pula) dianiaya) Yakni kalian juga tidak dianiaya dengan penundaan dan pengurangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَإِنْ لَمْ تَفْعَلُوا فَأْذَنُوا بِحَرْبٍ مِنَ اللَّهِ وَرَسُولِهِ ۖ } Dalam ayat ini ada ancaman yang menjelaskan bahwa pemakan riba adalah orang yang memerangi Allah dan Rasul-Nya, dan Allah telah mengizinkan agar mereka diperangi, dan ancaman seperti ini tidak datang kecuali dalam perkara besar seperti berikut : orang yang menghidupkan riba, orang yang berusaha untuk berbuat rusak dimuka bumi, dan pemotong jalan (begal), maka jauhilah oleh kalian sifat-sifat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "279. Jika kalian tidak meninggalkan riba maka kalian akan menjadi musuh-musuh Allah dan rasulNya. Kalian akan dihukum di dunia dan akhirat. Dan jika kalian bertaubat untuk mengambil riba, maka bagi kalian itu harta pokok kalian pinjamkan, tanpa menambahi dan mengurahi harta pokok, yaitu bahwa memakan harta riba itu termasuk dosa-dosa besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian tidak melaksanakannya, maka ketahuilah} maka ketahuilah dan yakinlah {akan terjadi perang dari Allah dan RasulNya. Jika kalian bertaubat, maka bagi kalian pokok harta kalian. Kalian tidak menzalimi} orang-orang yang berhutang dengan meminta tambahan{dan tidak dizalimi} kalian dari sisi mereka dengan kelamaan waktunya dan kekurangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "277-279. “Sesungguhnya orang-orang yang beriman, mengerjakan amal shalih, mendirikan shalat dan menunaikan zakat…” adalah untuk menjelaskan bahwa sebesar-besarnya sebab untuk menjauhkan diri dari apa yang diharamkan oleh Allah dari pendapatan-pendapatan ribawi adalah menyempurnakan keimanan dan hak-haknya, khususnya menegakkan shalat dan menunaikan zakat, karena shalat itu mencegah dari perbuatan yang keji dan mungkar. Dan zakat adalah kebajikan kepada makhluk yang meniadakan praktik riba yang jelas-jelas merupakan kezhaliman bagi mereka dan keburukan atas mereka. Kemudian Allah mengahadapkan firmaNya kepada kaum Mukminin dan memerintahkan mereka agar bertakwa kepadaNya dan agar mereka meninggalkan muamalah-muamalah dengan riba yang mereka kerjakan sebelumnya, dan bahwa bila mereka tidak melakukan hal itu, maka sesungguhnya mereka itu telah memerangi Allah dan RasulNya. Inilah bukti yang paling jelas yang di akibatkan oleh kebusukan riba, di mana Allah menjadikan orang-orang yang suka berpraktik riba, menjadi orang-orang yang memerangi Allah dan RasulNya. Kemudian Allah berfirman,”Dan jika kamu bertaubat. ”Maksudnya, dari muamalah ribawiyah,” maka begitu pokok hartamu; kamu tidak menganiaya,” manusia lain dengan mengambil riba, ”dan tidak pula di aniaya” dengan tindakan kalian dengan pokok harta kalian. Maka saipapun yang bertaubat dari riba walaupun muamalah yang telah berlalu adalah miliknya, maka perkaranya akan di perhatikan Allah. Namun bila muamalahnya masih berjalan, wajiblah ia hanya mengambil pokok hartanya saja. Dan apa bila ia mengambilnya lebih dari itu,maka ia telah berani melakuakan riba. Ayat ini merupakan penjelasan akan hikmah (diharamkanya riba) dan bahwa riba itu meliputi kezhaliman bagi orang-orang yang membutuhkan dengan mengambil tambahan dan melipat gandakan riba atas mereka, padahal dia seharusnya menangguhkan mereka. Oleh karena itu Allah berfirman;"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: {فَأۡذَنُواْ بِحَرۡبٖ } Fa’dzanû biharbin: Ketahuilah bahwasanya engkau menyiapkan senjatamu untuk berperang dengan Allah dan rasulNya maka senjatamu tidak akan bermanfaat sama sekali dan engkau akan kalah dan hancur. { فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ } Falakum ru’ûsu amwâlikum: Setelah engkau bertaubat, maka hartamu adalah modal yang masih berada di tangan orang yang berutang kepadamu. Maka ambillah pokok (modal) itu dan tinggalkanlah tambahan riba. Makna ayat: Kemudian Allah mengancam orang-orang yang lambat dan menunda-nunda untuk melaksanakan seruan ini dengan firmanNya,”Maka jika kamu tidak mengerjakan (meninggalkan sisa riba) maka ketahuilah bahwa Allah dan rasulNya akan memerangimu.” Kemudian Allah menerangkan epada mereka tatacara bertaubat dan cara untuk berlepas diri dari ujian dan cobaan riba dengan firmanNya,“Jika kamu taubat dengan meninggalkan riba, maka kamu hanya berhak mendapatkan modal yang kamu pinjamkan itu saja, tidak ada lainnya, jangan kamu berbuat zhalim dengan minta tambahan dan kamu tidak dzhalimi dengan pengurangan modalmu.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 279",
    "description": "Jika kamu tidak melaksanakannya, yakni apa yang diperintahkan ini, sehingga kamu memungut sisa riba yang belum kamu pungut, maka yakinlah akan terjadi perang yang dahsyat dari Allah dan rasul-Nya antara lain berupa bencana dan kerusakan di dunia, dan siksa pedih di akhirat. Tetapi jika kamu bertobat, yakni tidak lagi melakukan transaksi riba dan melaksanakan tuntunan ilahi, tidak memungut sisa riba yang belum dipungut, maka perang tidak akan berlanjut, bahkan kamu berhak atas pokok hartamu dari mereka. Dengan demikian, kamu tidak berbuat zalim atau merugikan dengan membebani mereka pembayaran utang melebihi apa yang mereka terima dan tidak dizalimi atau dirugikan karena mereka membayar penuh sebesar utang yang mereka terima. Dan jika orang yang berutang itu dalam kesulitan untuk melunasi, atau bila dia membayar utangnya akan terjerumus dalam kesulitan, maka berilah dia tenggang waktu untuk melunasinya sampai dia memperoleh kelapangan. Jangan menagihnya jika kamu tahu dia dalam kesulitan, apalagi dengan memaksanya untuk membayar. Dan jika kamu menyedekahkan sebagian atau seluruh utang tersebut, itu lebih baik bagimu, dan bergegaslah meringankan yang berutang atau membebaskannya dari utang jika kamu mengetahui betapa besar balasannya di sisi Allah."
  }
]