[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana bisa kalian -wahai orang-orang musyrik- mengingkari keesaan Allah ta'ala dengan menyekutukan Allah dengan sesuatu yang lain dalam ibadah, padahal sudah disertakan bukti yang jelas tentang itu pada diri kalian? Padahal dahulu kalian belum diciptakan, lalu kemudian Dia mengadakan kalian dan meniup ruh kehidupan pada diri kalian, kemudian mematikan kalian setelah berakhirnya ajal kalian yang telah Dia tentukan bagi kalian, selanjutnya Dia akan mengembalikan kalian menjadi hidup lagi pada hari kebangkitan dan kemudian kepada-Nya lah kalian akan dikembalikan untuk perhitungan amal perbuatan dan pembahasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kalian ini -wahai orang-orang kafir- benar-benar aneh. Kalian mengingkari Allah, sementara kalian menyaksikan bukti-bukti kekuasaan-Nya di dalam diri kalian. Dulu kalian tidak ada dan bukan berupa apa-apa, kemudian Allah menciptakan dan menghidupkan kalian, kemudian Dia mematikan kalian untuk yang kedua kalinya, lalu menghidupkan kalian untuk kedua kalinya. Setelah itu kalian akan dikembalikan kepada-Nya untuk dihitung amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Akibat dari kekafiran itu Allah mengolok dan mengingkari perbuatan mereka: bagaimana bisa kalian mengingkari Allah padahal Dia telah menciptakan kalian, kemudian mematikan kalian setelah ajal kalian telah datang, kemudian menghidupkan kalian kembali di hari kebangkitan, dan mengembalikan kalian untuk mendapat balasan pahala atau siksa?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. كَيْفَ تَكْفُرُوْنَ بِاللّٰهِ وَكُنْتُمْ اَمْوَاتًا (Mengapa kamu kafir kepada Allah, padahal kamu tadinya mati?) yakni sebelum kalian diciptakan فَاَحْيَاكُمْۚ (lalu Allah menghidupkan kamu) Yakni Allah menciptakan kalian dan meniupkan ruh ke dalam diri kalian ثُمَّ يُمِيْتُكُمْ (kemudian kamu dimatikan) Yakni ketika datang ajal kalian ثُمَّ يُحْيِيْكُم (dan dihidupkan-Nya kembali) Yakni pada hari kiamat ثُمَّ اِلَيْهِ تُرْجَعُوْن (kemudian kepada-Nya-lah kamu dikembalikan) Yakni dikumpulkan di padang mahsyar di hadapan Allah Ta’ala untuk mendapat balasan atas perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Bagaimana bisa kalian mengingkari adanya Allah, takdirNya dan nikmatNya lalu kalian menyembah selainNya?! Allah adalah Dzat yang menghidupkan dan menciptakan kalian setelah sebelumnya kalian tidak ada, kemudian mematikan kalian di dunia sampai ajal kalian dating. Setelah itu, Allah menghidupkan kalian dengan membangkitkan kalian pada hari kiamat, kemudian kalian dikumpulkan di tempat yang berada di sisiNya, kemudian membalas kalian sesuai perbuatan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana kalian bisa ingkar kepada Allah, padahal kalian (tadinya) mati} hal fana yang tidak diciptakan {lalu Dia menghidupkan kalian, kemudian Dia akan mematikan kalian, kemudian Dia akan menghidupkan kalian lagi} untuk dibangkitkan {dan kepadaNyalah kalian akan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. ini adalah sebuah pertanyaan yang bermakna keheranan dan sekaligus celaan serta pengingkaran, yakni bagaimana bisa terjadi kekufuran dari kalian kepada Allah yang telah menciptakan kalian dari tidak ada, lalu memberikan nikmatNya kepada kalian dengan berbagai macam nikmat, kemudian Dia mematikan kalian dalam kubur, bila telah sampai ajal kalian lau Dia membalas kalian dalam kubur, kemudian Dia membangkitkan kalian kembali setelah Hari Kebangkitan dan berdiri di padang Mahsyar, kemudian kepadaNyalah kalian akan kembali, maka dia akan memberikan balasan kepada kalian dengan balasan yang sepadan, dan bila kalian berada dalam tindak-tandukNya, pengaturanNya, kebaikanNya, dan dalam kerangka perintah-perintahNya yang bersifat agama, kemudian setelah itu dalam kerangka pembalasanNya; maka apakah pantas bagi kalian kufur kepadaNya? Dan bukankan hal ini hanyalah suatu kebodohan dan kedunguan yang besar? Akan tetapi yang sepantasnya bagi kalian adalah agar kalian bertakwa kepadaNya, mensyukuriNya, beriman kepadaNya, takut akan azabNya, dan mengharap balasan baikNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : كَيۡفَ تَكۡفُرُونَ بِٱللَّهِ : Bentuk kata tanya disini untuk menyatakan keheranan sekaligus celaan, karena tidak ada sesuatu yang menyebabkan terjadinya kekufuran di sini. وَكُنتُمۡ أَمۡوَٰتٗا فَأَحۡيَٰكُمۡۖ : Ini merupakan bukti atas bathilnya kekufuran yang mereka lakukan. Bagaimana bisa seorang hamba kufur terhadap Rabbnya sedangkan dia diciptakan oleh Rabbnya yang sebelumnya tidak ada sama sekali. ثُمَّ يُمِيتُكُمۡ ثُمَّ يُحۡيِيكُمۡ : Sesungguhnya mematikan yang hidup yang menghidupkan yang mati, keduanya merupakan petunjuk atas keberadaan serta kekuasaan Tuhan yang Maha Tinggi. ثُمَّ إِلَيۡهِ تُرۡجَعُونَ : Yang dimaksud dengan dihidupkan kedua kalinya yaitu pada kebangkitan saat hari kiamat. Makna ayat : Masih saja fokus pembicaraan kedua ayat ini tertuju kepada orang-orang kafir yang sudah disebutkan sifat-sifat buruknya dan kondisinya yang mengenaskan pada ayat-ayat sebelumnya. Lantas Allah berkata kepada mereka dengan metode berpaling, menegur dan mencela sikap mereka; “Mengapa kamu kafir kepada Allah, padahal kamu tadinya mati, lalu Allah menghidupkan kamu.” Allah Ta’ala menyebutkan bukti-bukti wujud keberadaanNya dan kemuliaanNya, sehingga menjadikan kekufuran sebagai suatu hal yang amat buruk dan pelakunya termasuk makhluk rendahan yang paling buruk keadaannya di dunia dan di akhirat kelak. Dan di antara bukti keberadaanNya adalah menghidupkan setelah mematikan dan mematikan setelah menghidupkan. Pelajaran dari ayat : 1. Penolakan terhadap kekafiran kepada Allah Ta’ala 2. Penyampaian bukti atas wujud Allah, KekuasaanNya, dan kasih sayangNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 28: Allah bertanya dengan maksud pengingkaran : Bagaimana bisa kalian mengingkari wahai orang-orang kafir musyrik akan keesaan Allah yang telah menciptakan kalian dari sesuatu yang tiada , dan Allah telah memberikan kepada kalian segala kenikmatan , kemudian kalian mati dan terkubur , kemudian kalian dikeluarkan dari kubur kubur kalian untuk dihisab , kemudian kepada Allah kalian akan kembali dan dibalas atas amalan-amalan kalian ; sesungguhnya kebaikan akan dibalas dengan kebaikan dan keburukan akan dibalas dengan keburukan ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pertanyaan di sini maksudnya adalah ta'ajjub (menunjukkan keanehan), taubikh (mencela) dan mengingkari. Yakni bagaimana kamu wahai orang-orang musyrikin bisa ingkar kepada keesaan Allah, kamu menyekutukan-Nya dengan sesuatu padahal ada bukti yang nyata terhadap keesaan-Nya pada diri kamu. Bukankah kamu dahulu mati, lalu Allah menghidupkan kamu, lalu Dia mematikan kamu setelah tiba ajalmu dan akan membangkitkan kamu lagi dan kepada-Nya kamu dikembalikan untuk dihisab dan diberikan balasan terhadap amalmu selama di dunia. Di samping itu, kamu semua berada di bawah kekuasaan-Nya, lalu apakah pantas kamu ingkar kepada-Nya, bukankah yang demikian merupakan kebodohan yang sangat, bahkan yang sepatutnya kamu lakukan adalah beriman kepada-Nya, bertakwa dan bersyukur, takut terhadap azab-Nya dan berharap pahala-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 28",
    "description": "Sungguh mengherankan perbuatan kamu itu, wahai orang-orang musyrik! bagaimana kamu ingkar kepada Allah yang maha esa dengan mempersekutukan-Nya, padahal bukti keesaan-Nya ada dalam diri kamu, yaitu kamu yang tadinya mati dan belum berupa apa-apa, lalu dia menghidupkan kamu dari tiada, kemudian dia mematikan kamu setelah tiba ajal yang ditetapkan untukmu, lalu dia menghidupkan kamu kembali pada hari kebangkitan. Kemudian hanya kepada-Nyalah kamu dikembalikan untuk dimintai pertanggungjawaban dan mendapat balasan atas segala amal perbuatan. Tuhan yang patut untuk disembah dan ditaati itu dialah Allah yang menciptakan dan memberikan karunia berupa segala apa yang ada di bumi untuk kemaslahatan-Mu, kemudian bersamaan dengan penciptaan bumi dengan segala manfaatnya, kehendak dia menuju ke penciptaan langit, lalu dia menyempurnakannya menjadi tujuh langit yang sangat beraturan, baik yang tampak olehmu maupun yang tidak. Dan dia maha mengetahui segala sesuatu. Ilmu Allah mencakup segala ciptaan-Nya."
  }
]