[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila orang yang berhutang tidak sanggup melunasi, maka berilah dia waktu penangguhan sampai Allah memudahkan rizkinya sehingga dia dapat membayarkan harta kalian kepada kalian. Apabila kalian membiarkan semua hutang tersebut atau sebagiannya dan menggugurkan hutang itu dari orang yang berhutang, maka itu lebih utama bagi kalian, jika kalian menyadari keutamaaan sikap tersebut dan sesengguhnya tindakan tersebut lebih baik bagi kalian di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "280. Apabila orang yang kamu utangi itu mengalami kesulitan ekonomi, tidak punya uang untuk melunasinya, maka tundalah tagihannya sampai kondisi keuangannya membaik dan mampu melunasi utangnya. Bila kalian bersedekah kepadanya dengan tidak menagih utangnya atau membebaskan sebagian utangnya, itu lebih baik bagi kalian jika kalian mengetahui keutamaan tindakan kalian itu di sisi Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "280. Jika orang yang berhutang mengalami kesusahan dalam membayar maka berilah ia waktu penangguhan sampai ia mampu membayar. Dan jika kalian mengikhlaskan hutang itu atau sebagian hutang itu maka hal itu lebih utama bagi kalian andai kalian mengetahui keutamaannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "280. وَإِن كَانَ ذُو عُسْرَةٍ ( Dan jika (orang yang berhutang itu) dalam kesukaran) Yakni apabila yang berhutang mengalami kesulitan sehingga tidak mampu untuk membayar hutangnya. فَنَظِرَةٌ إِلَىٰ مَيْسَرَةٍ ۚ (maka berilah tangguh sampai dia berkelapangan ) Makna (النظرة) yakni pengakhiran. Dan makna (الميسرة) yakni kemudahan dan adanya harta. Dan ayat ini berlaku bagi setiap yang mempunyai hutang. وَأَن تَصَدَّقُوا۟ (Dan menyedekahkan ) Yakni kepada yang berhutang yang memiliki kesulitan dengan membebaskan hutang tersebut. Dan hal ini lebih baik daripada kalian menagih mereka sekarang atau memberi tenggang waktu baginya sampai beberapa waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "280. Dan jika orang yang berhutang itu kesulitan sehingga tidak bisa memenuhi hutangnya, maka kalian harus menundanya sampai waktu dia dalam keadaan mudah, dan menyedekahkan harta pokok kalian atau sebagian dari harta tersebut kepada para gharim yang berhutang dan kesulitan dengan melepaskan mereka dari hutangnya itu lebih utama bagi kalian di sisi Tuhan jika kalian mengetahui keutamaan dan pahala sedekah kepada orang yang kesulitan. Ayat ini turun ketika Bani Amr bin Amir meminta Bani Mughirah dan mengabaikan riba. Bani Mughirah berkata: “Sekarang kami dalam kesulitan, maka tundalah sampai buah-buahan kami tumbuh,” Lalu mereka menolak untuk menundanya. Kemudian Allah SWT menurunkan ayat {Wa in kaana dzuu ‘usratin …}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika dia mengalami kesulitan} jika orang yang berhutang mengalami kesusahan sehingga tidak memiliki sesuatu untuk membayar hutangnya {berilah tenggang waktu} tenggang waktu dan penundaan {sampai dia memperoleh kelapangan} lapang dalam hal harta {Kalian bersedekah} kalian menyedekahkan harta pokok kalian atau sebagian bagi orang yang kesulitan {itu lebih baik bagi kalian apabila kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "280-281. “Dan jika orang yang berhutang itu dalam kesukaran, maka berilah tangguh sampai dia berkelapangan.” Maksudnya, apabila ia memikul hutang itu dalam keadaan sulit dan tidak mampu menunaikan hutangnya, maka wajiblah atas yang memiliki piutang itu menangguhkan orang itu hingga kondisinya lapang. Dan piutang bagi orang yang berhutang itu wajib apabila telah mendapatkan kadar hutangnya dengan jalan apapun yang mubah agar segera melunasi hutangnya itu. Apabila pemilik piutang itu sedekah kepadanya dengan memaafkan hutang itu semua atau sebagianya, maka itu lebih baik baginya, dan akan mudah bagi seorang hamba untuk konsisten terhadap perkara-perkara syairat dan majauhi praktik-pratik riba serta berbuat kebajikan kepada orang yang sedang sulit. Semua itu karena pengetahuannya bahwa suatu hari nanti dirinya akan kembali kepada Allah dan akan di penuhi baginya amalnya tersebut, dan Allah tidak akan menganiaya dirinya sedikitpun, sebagaimana Allah menutup ayat ini dengan firmanya, ”Dan periharalah dirimu dari azab (yang terjadi pada) hari yang pada waktu itu kalian semua di kembalikan kepada Allah. Kemudian masing-masing diri diberi balasan yang sempurna terhadap apa yang telah di kerjakanya, sedang mereka sedikitpun tidak dianiaya (dirugikan).”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: {عُسۡرَةٖ } ‘Usrah: Sempitnya keuangan {فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ } Fanadziratun Ilâ maisarah: Tunggulah sampai orang yang berutang itu mendapatkan kelapangan dari Allah kemudian ia mengembalikan pokok utang yang dipinjamnya darimu. { وَأَن تَصَدَّقُواْ } Wa an tashaddaqû: Engkau bersedekah kepada orang yang kesulitan keuangan dengan mengikhlaskan utang yang ia pinjam darimu itu lebih baik. Makna ayat: Ketika kamu mendapati orang yang berutang kepadamu sedang dalam kesulitan keuangan maka wajib untuk memberikannya tenggang waktu sampai ia memiliki kelapangan. Ada hal lain yang lebih baik untukmu yaitu engkau bersedekah dengan mengikhlaskan piutangmu seluruhnya untuk menyucikan hartamu yang terkontaminasi oleh riba serta menyucikan dirimu sendiri dari pengaruh buruk riba. Pelajaran dari ayat: • Barangsiapa yang bertaubat dari riba tidak akan dizhalimi dengan mengambil pokok hartanya, akan tetapi akan diterima secara penuh kecuali ia ingin bersedekah dengan mengikhlaskan piutangnya maka itu lebih baik baginya di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 280: Yakni kamu wajib memberinya tangguh. Di dalam hadits disebutkan: « مَنْ أَنْظَرَ مُعْسِرًا أَوْ وَضَعَ عَنْهُ أَظَلَّهُ اللَّهُ فِى ظِلِّهِ » \"Barang siapa yang memberi tangguh orang yang susah atau membebaskannya, maka Allah akan menaunginya dalam naungan-Nya.\" (HR. Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 280",
    "description": "Dan jika orang yang berutang itu dalam kesulitan untuk melunasi, atau bila dia membayar utangnya akan terjerumus dalam kesulitan, maka berilah dia tenggang waktu untuk melunasinya sampai dia memperoleh kelapangan. Jangan menagihnya jika kamu tahu dia dalam kesulitan, apalagi dengan memaksanya untuk membayar. Dan jika kamu menyedekahkan sebagian atau seluruh utang tersebut, itu lebih baik bagimu, dan bergegaslah meringankan yang berutang atau membebaskannya dari utang jika kamu mengetahui betapa besar balasannya di sisi Allah. Dan takutlah atau hindarilah siksa yang akan terjadi pada hari yang sangat dahsyat, yang pada saat itu kamu semua dikembalikan kepada Allah, yakni meninggal dunia kemudian dibangkitkan kembali. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi yakni tidak dirugikan, bahkan yang beramal saleh akan sangat diuntungkan oleh kemurahan Allah."
  }
]