[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan takutlah kalian (wahai manusia), terhadap hari ketika kalian akan kembali kepada Allah, yaitu hari kiamat, tatkala kalian dihadapkan kepada Allah untuk membuat perhitungan amal kalian, lalu Dia memberi balasan tiap orang dari kalian dengan amal yang dia perbuat, yang baik ataupun yang buruk tanpa ada unsur ketidak adilan yang dia alami. Dalam ayat ini terkandung pesan secara implisit untuk menjauhi semua perkara yang diharamkan Allah dari bentuk-bentuk transaksi ribawi untuk menyempurnakan keimanan dan hak-haknya seperti menegakkan shalat, membayar zakat dan mengerjakan amal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "281. Dan takutlah kalian akan siksa suatu hari di mana kalian semua dikembalikan kepada Allah dan berdiri di hadapan-Nya. Kemudian setiap orang akan diberikan balasan yang setimpal dengan perbuatannya, baik atau buruk. Mereka tidak akan dizalimi dengan cara dikurangi ganjaran kebajikannya, atau ditambah hukumannya atas keburukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "281. Dan takutlah kalian dari hari kiamat, hari kalian dikembalikan kepada Allah untuk perhitungan, Dia akan membalas setiap kebaikan atau keburukan setiap orang tanpa mengurangi pahala dan tanpa menambah siksaan dari yang semestinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "281. وَاتَّقُوا۟ يَوْمًا (Dan peliharalah dirimu dari suatu hari ) Yakni hari kiamat. تُرْجَعُونَ فِيهِ إِلَى اللهِ ۖ (yang pada waktu itu kamu semua dikembalikan kepada Allah ) Yakni hari kematian kalian. Dari Ibnu Abbas ia berkata: ayat al-Qur’an yang turun terakhir adalah ayat: (وَاتَّقُوا۟ يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللهِ ) dan antara turunnya ayat ini dan kematian Nabi adalah 31 hari. Dan Rasulullah bersabda: (dahulu ada pedagang yang memberi hutang kepada orang-orang, dan apabila ia mendapati seorang yang kesulitan untuk membayarnya maka ia berkata kepada para pembantunya: “maafkanlah dia, semoga dengan itu Allah memaafkan kita”. Maka Allah memaafkannya)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Al-Qosim bin Abi Ayyub berkata : suatu ketika aku mendengar S'aid bin Jubair mengulang-ulang bacaan ayat ini dalam shalatnya sebanyak 20-an kali. 2 ). Ayat yang paling agung untuk menasihati para pemakan riba dan para pemilik harta yang mereka telah disibukkan oleh hartanya, sehingga lupa akan ketaatan kepada Allah, berikut ini adalah ayat yang Allah tutup dengannya ayat-ayat riba dan merupakan akhir ayat yang diturunkan oleh Allah diantara wahyunya : { وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ }. 3 ). Sekecil apapun perbuatan seseorang akan dituliskan baginya balasan pahala, hal itu berdasarkan makna umum dari firman Allah : { وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ۖ ثُمَّ تُوَفَّىٰ كُلُّ نَفْسٍ مَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ }"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "281. Dan takutlah kepada hari kiamat yang mana kalian akan kembali kepada Allah, kemudian masing-masing jiwa mendapati amal perbuatan mereka berupa kebaikan atau keburukan. Mereka tidak dizalimi dengan dikuranginya kebaikan mereka dan ditambahinya keburukan mereka. Ibnu Juraij berkata: “Ayat ini diturunkan 9 malam sebelum wafatnya nabi SAW, lalu setelah itu tidak ada ayat yang diturunkan” Ibnu Abbas berkata: “Akhir ayat Al-Qur’an yang diturunkan kepada Nabi SAW adalah {Wattaqu yauman …} Dan jeda waktu antara turunnya ayat tersebut dan wafatnya nabi SAW adalah 31 hari”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Waspadalah terhadap hari dimana saat itu kalian semua dikembalikan kepada Allah. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya} setiap orang diberi balasan atas apa yang dikerjaakan baik itu kebaikan atau keburukan {dan mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "280-281. “Dan jika orang yang berhutang itu dalam kesukaran, maka berilah tangguh sampai dia berkelapangan.” Maksudnya, apabila ia memikul hutang itu dalam keadaan sulit dan tidak mampu menunaikan hutangnya, maka wajiblah atas yang memiliki piutang itu menangguhkan orang itu hingga kondisinya lapang. Dan piutang bagi orang yang berhutang itu wajib apabila telah mendapatkan kadar hutangnya dengan jalan apapun yang mubah agar segera melunasi hutangnya itu. Apabila pemilik piutang itu sedekah kepadanya dengan memaafkan hutang itu semua atau sebagianya, maka itu lebih baik baginya, dan akan mudah bagi seorang hamba untuk konsisten terhadap perkara-perkara syairat dan majauhi praktik-pratik riba serta berbuat kebajikan kepada orang yang sedang sulit. Semua itu karena pengetahuannya bahwa suatu hari nanti dirinya akan kembali kepada Allah dan akan di penuhi baginya amalnya tersebut, dan Allah tidak akan menganiaya dirinya sedikitpun, sebagaimana Allah menutup ayat ini dengan firmanya, ”Dan periharalah dirimu dari azab (yang terjadi pada) hari yang pada waktu itu kalian semua di kembalikan kepada Allah. Kemudian masing-masing diri diberi balasan yang sempurna terhadap apa yang telah di kerjakanya, sedang mereka sedikitpun tidak dianiaya (dirugikan).”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kemudian Allah Ta’ala memperingatkan semua hambaNya bahwa pada hari kiamat terdapat berbagai kejadian yang mengerikan dan keadaan yang sulit, dimana hisab perhitungan amalan akan dilaksanakan dengan teliti, dan setiap orang baik yang mukmin maupun kafir, yang baik maupun yang buruk, mendapat balasan akan kebaikan atau keburukan yang telah diperbuat. Mereka tidak dizhalimi dengan mengurangi kebaikan atau ditambahkan dosa-dosanya. Allah Ta’ala berfirman; “Maka peliharalah dirimu dari (adzab yang terjadi pada) hari yang pada waktu itu kamu semua dikembalikan kepada Allah, kemudian masing-masing orang diberi balasan yang sempurna terhadap apa yang telah dikerjakannya, sedang mereka sedikitpun tidak dizhalimi (dirugikan).” Ini merupakan petunjuk yang terkandung pada ayat (280) dimana ini merupakan akhir petunjuk yang didapatkan oleh manusia dari Rabbnya karena ayat ini merupakan ayat yang terakhir turun dari langit kepada rasulNya ﷺ. Pelajaran dari ayat: • Kewajiban untuk mengingat kehidupan akhirat dan bersiap-siap menuju ke sana dengan keimanan dan amalan shalih serta meninggalkan riba dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 281: Ayat ini merupakan ayat terakhir yang turun dari ayat Al Qur'an. Ayat ini dijadikan penutup terhadap hukum-hukum, perintah dan larangan yang disebutkan sebelumnya, karena di dalam ayat ini terdapat janji terhadap kebaikan yang dilakukan seseorang dan terdapat ancaman bagi orang yang melakukan keburukan, dan bahwa orang yang mengetahui dirinya akan kembali kepada Allah, di mana Allah akan membalas amalannya yang kecil maupun yang besar, nampak maupun tersembunyi, dan bahwa Allah tidak akan menzalimi meskipun seberat dzarrah (debu) pun, maka akan membuat seseorang bersemangat melakukan kebaikan dan takut mengerjakan keburukan. Misalnya kebaikannya dikurangi atau kejahatannya ditambah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 281",
    "description": "Dan takutlah atau hindarilah siksa yang akan terjadi pada hari yang sangat dahsyat, yang pada saat itu kamu semua dikembalikan kepada Allah, yakni meninggal dunia kemudian dibangkitkan kembali. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi yakni tidak dirugikan, bahkan yang beramal saleh akan sangat diuntungkan oleh kemurahan Allahwahai orang-orang yang beriman! apabila kamu melakukan utang piutang untuk waktu pembayaran yang ditentukan, hendaklah kamu menuliskannya untuk melindungi hak masing-masing dan untuk menghindari perselisihan. Dan hendaklah seorang yang bertugas sebagai penulis di antara kamu menuliskannya dengan benar, jujur, dan adil, sesuai ketentuan Allah dan peraturan perundangan yang berlaku dalam masyarakat. Kepada para penulis diingatkan agar janganlah penulis menolak untuk menuliskannya sebagai tanda syukur, sebagaimana Allah telah mengajarkan kepadanya kemampuan membaca dan menulis, maka hendaklah dia menuliskan sesuai dengan pengakuan dan pernyataan pihak yang berutang dan disetujui oleh pihak yang mengutangi. Dan hendaklah orang yang berutang itu mendiktekan apa yang telah disepakati untuk ditulis, dan hendaklah dia bertakwa kepada Allah, tuhan pemelihara-Nya, dan janganlah dia mengurangi sedikit pun daripada utangnya, baik yang berkaitan dengan kadar utang, waktu, cara pembayaran, dan lain-lain yang dicakup oleh kesepakatan. Jika yang berutang itu orang yang kurang akalnya, tidak pandai mengurus harta karena suatu dan lain sebab, atau lemah keadaannya, seperti sakit atau sangat tua, atau tidak mampu mendiktekan sendiri karena bisu atau tidak mengetahui bahasa yang digunakan, atau boleh jadi malu, maka hendaklah walinya mendiktekannya dengan benar dan jujur. Dan persaksikanlah dengan dua orang saksi laki-laki di antara kamu. Jika tidak ada saksi dua orang laki-laki, atau kalau saksi itu bukan dua orang laki-laki, maka boleh seorang laki-laki dan dua orang perempuan di antara orang-orang yang kamu sukai dari para saksi yang ada, yakni yang disepakati oleh yang melakukan transaksi. Hal tersebut agar jika yang seorang dari perempuan itu lupa, maka perempuan yang seorang lagi yang menjadi saksi bersamanya mengingatkannya. Dan sebagaimana Allah berpesan kepada para penulis, kepada para saksi pun Allah berpesan. Janganlah saksi-saksi itu menolak memberi keterangan apabila dipanggil untuk memberi kesaksian, karena penolakannya itu dapat merugikan orang lain. Dan janganlah kamu bosan menuliskannya, baik utang itu kecil maupun besar, sampai yakni tiba batas waktu membayarnya. Yang demikian itu, yakni penulisan utang piutang dan persaksian yang dibicarakan itu, lebih adil di sisi Allah, yakni dalam pengetahuan-Nya dan dalam kenyataan hidup, dan lebih dapat menguatkan kesaksian, yakni lebih membantu penegakan persaksian, dan lebih mendekatkan kamu kepada ketidakraguan terkait jenis utang, besaran dan waktunya. Petunjuk-petunjuk di atas adalah jika muamalah dilakukan dalam bentuk utang piutang, tetapi jika hal itu merupakan perdagangan berupa jual beli secara tunai yang kamu jalankan di antara kamu, maka tidak ada dosa bagi kamu jika kamu tidak menuliskannya, sebab memang pencatatan jual beli tidak terlalu penting dibanding transaksi utang-piutang. Dan dianjurkan kepadamu ambillah saksi apabila kamu berjual beli untuk menghindari perselisihan, dan janganlah penulis dipersulit dan begitu juga saksi oleh para pihak untuk memberikan keterangan dan kesaksian jika diperlukan, begitu juga sebaliknya para pencatat dan saksi tidak boleh merugikan para pihak. Jika kamu, wahai para penulis dan saksi serta para pihak, lakukan yang demikian, maka sungguh, hal itu suatu kefasikan pada kamu. Dan bertakwalah kepada Allah dan rasakanlah keagungannya dalam setiap perintah dan larangan, Allah memberikan pengajaran kepadamu tentang hak dan kewajiban, dan Allah maha mengetahui segala sesuatu."
  }
]