[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan mengikuti RasulNya, Muhammad sholallohu alaihi wasalam, bila kalian mengadakan transaksi hutang piutang sampai waktu tempo tertentu, maka lakukanlah pencatatan demi menjaga harta orang lain dan menghindari pertikaian. Dan hendaknya yang melakukan pencatatan itu adalah seorang yang terpercaya lagi memiliki ingatan kuat, dan hendaknya orang yang telah mendapatkan pelajaran tulis menulis dari Allah tidak menolaknya, dan orang yang berhutang mendiktekan nominal hutang yang menjadi tanggungannya, dan hendaklah dia menyadari bahwa dia diawasi oleh Allah serta tidak mengurangi jumlah hutangnya sedikit pun. Apabila penghutang termasuk orang yang diputuskan tidak boleh bertransaksi dikarenakan suka berbuat mubadzir dan pemborosan, atau dia masih anak-anak atau hilang akal, atau dia tidak bisa berbicara lantaran bisu atau tidak mempunyai kemampuan normal untuk berkomunikasi, maka hendaklah orang yang bertanggung jawab atas dirinya mengambil alih untuk mendiktekannya. Dan carilah persaksian dari dua orang lelaki beragama islam, baligh lagi berakal dari orang-orang yang shalih. Apabila tidak ditemukan dua orang lelaki, maka cari persaksian satu orang lelaki ditambah dengan dua perempuan yang kalian terima persaksian mereka. Tujuannya, supaya bila salah seorang dari wanita itu lupa, yang lain dapat mengingatkannya. Dan para saksi harus datang ketika diminta untuk bersaksi, dan mereka wajib melaksanakannya kapan saja dia diminta untuk itu. Dan janganlah kalian merasa jemu untuk mencatat hutang piutang, walaupun berjumlah sedikit atau banyak hingga temponya yang telah ditentukan. Tindakan itu lebih sejalan dengan syariat Allat dan petunjukNya, dan menjadi faktor pendukung paling besar untuk menegakkan persaksian dan menjalankannya, serta cara paling efektif untuk menepis keraguan-keraguan terkait jenis hutang, kadar dan temponya. Akan tetapi, apabila transaksinya berbentuk akad jual beli, dengan menerima barang dan menyodorkan harga secara langsung, maka tidak dibutuhkan pencatatan, dan disunahkan mengadakan persaksian terhadap akad tersebut guna mengeliminasi adanya pertikaian dan pertentangan antara dua belah pihak. Kewajiban saksi dan pencatat untuk melaksanakan persaksian dan pencatatan ssebagaimana yang diperintahkan oleh Allah. Dan tidak boleh bagi pemilik piutang dan penghutang melancarkan hal-hal buruk terhadap para pencatat dan para saksi. Begitu juga tidak diperbolehkan bagi para pencatat dan para saksi berbuat keburukan kepada orang yang membutuhkan catatan dan persaksian mereka. Apabila kalian melakukan perkara yang kalian dilarang melakukannya, maka sesungguhnya tindakan itu merupakan bentuk penyimpangan dari ketaatan kepada Allah, dan efek buruknya akan menipa kalian sendiri. Dan takutlah kepada Allah dalam seluruh perkara yang diperintahkanNya kepada kalian dan perkara yang kalian dilarangNya untu melakukannya. Dan Allah mengajarkan kepada kalian semua apa-apa yang menjadi urusan dunia dan akhirat kalian. Dan Allah Maha Mengetahui segala sesuatu, maka tidak ada satupun dari urusan-urusan kalian yang tersembunyi bagiNya, dan Dia akan memberikan balasan kepada kalian sesuai dengan perbuatan-perbuatan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "282. Wahai orang-orang yang beriman kepada Allah dan mengikuti Rasul-Nya! Apabila kalian melakukan transaksi utang-piutang, di mana sebagian dari kalian memberikan pinjaman kepada orang lain sampai batas waktu tertentu, maka catatlah pinjaman itu! Dan hendaklah pinjaman di antara kalian itu dicatat oleh seorang pencatat dengan benar dan adil sesuai dengan ketentuan syariat. Dan hendaklah si pencatat tidak menolak mencatat pinjaman itu sesuai dengan apa yang diajarkan oleh Allah kepadanya, yakni mencatat secara adil. Maka hendaklah si pencatat itu mencatat apa yang didiktekan orang yang bertanggung jawab atas pinjaman itu, agar hal itu menjadi pengakuan darinya. Dan hendaklah ia takut kepada Allah, Rabbnya. Dan hendaklah ia tidak mengurangi pinjaman itu sedikitpun, baik dalam ukuran, jenis maupun kualitasnya. Jika orang yang bertanggungjawab atas pinjaman itu tidak cakap melakukan transaksi, atau lemah, baik karena usianya yang masih kecil maupun karena gangguan kejiwaan, atau tidak bisa mendiktekan karena bisu maupun lainnya, maka hendaklah ia diwakili oleh walinya yang bertanggungjawab atasnya dengan benar dan adil. Carilah dua orang laki-laki yang berakal sehat dan adil untuk menjadi saksi. Jika tidak ada dua orang laki-laki, maka carilah saksi seorang laki-laki dan dua orang wanita yang kalian percaya kualitas agama dan amanahnya. Hal itu supaya ketika salah satu dari dua wanita itu lupa, maka wanita yang lain akan mengingatkannya. Dan hendaklah para saksi itu tidak menolak apabila mereka diminta menjadi saksi terkait transaksi utang-piutang. Dan mereka harus memberikan kesaksian apabila mereka diundang untuk itu. Dan janganlah kalian merasa jemu untuk mencatat transaksi utang-piutang, baik dalam jumlah sedikit maupun banyak sampai batas waktu tertentu. Karena mencatat transaksi utang-piutang itu lebih adil dalam pandangan syariat Allah, lebih kuat dalam menegakkan dan memberikan kesaksian, dan lebih besar kemungkinannya untuk menghilangkan keragu-raguan tentang jenis, kadar dan waktu (jatuh tempo) pinjaman. Kecuali apabila transaksi itu kalian lakukan dengan cara jual-beli antara barang dan uang secara tunai, maka tidak ada masalah bila kalian tidak mencatatnya, karena memang tidak perlu dicatat. Dan dianjurkan kepada kalian untuk mencari saksi guna menghindari perselisihan. Namun tidak boleh mempersulit urusan para pencatat dan para saksi. Dan mereka juga tidak boleh mempersulit urusan orang yang meminta jasa pencatatan dan kesaksian mereka. Jika kalian mempersulit urusan tersebut, maka tindakan itu telah keluar dari ruang lingkup ketaatan kepada Allah menuju kemaksiatan kepada-Nya. Dan takutlah kalian -wahai orang-orang mukmin- kepada Allah dengan cara menjalankan perintah-Nya dan menjauhi larangan-Nya. Dan Allah akan mengajarkan kepada kalian apa-apa yang mengandung kebaikan bagi urusan dunia dan akhirat kalian. Dan Allah Maha Mengetahui segala sesuatu, maka tidak ada sesuatupun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "282. Hai orang-orang yang beriman, jika kalian saling memberi hutang piutang sampai pada waktu tertentu maka wajib bagi kalian untuk menulisnya. Dan hendaklah orang yang menulisnya adalah orang yang adil dan amanah. Dan janganlah penulis itu enggan menulisnya sesuai syariat Allah, dan orang yang berhutang hendaklah mendikte hutangnya kepadanya dan hendaklah ia takut kepada Allah dengan tidak mengurangi hutang yang harus ia bayar. Syeikh as-Syinqithi berkata: zahir ayat ini menunjukkan bahwa hutang wajib ditulis, karena perintah Allah menunjukkan hal itu wajib dilakukan, namun Dia mengisyaratkan bahwa hal ini merupakan anjuran dan bukan kewajiban, Dia berfirman: وَإِنْ كُنْتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَقْبُوضَةٌ Jika kamu dalam perjalanan (dan bermu'amalah tidak secara tunai) sedang kamu tidak memperoleh seorang penulis, maka hendaklah ada barang tanggungan yang dipegang (oleh yang berpiutang). (al-Baqarah: 283) Dalam ayat ini pemberian barang jaminan hukumnya tidak wajib secara ijma’ ulama, dan pemberian barang jaminan merupakan pengganti penulisan hutang; jika penulisan hutang hukumnya wajib maka semestinya pemberian barang jaminan hukumnya wajib pula, namun tidak berlaku demikian. Allah juga menjelaskannya dengan gamblang bahwa penulisan hutang tidak wajib dalam dalam lanjutan firman-Nya ini: فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا فَلْيُؤَدِّ الَّذِي اؤْتُمِنَ أَمَانَتَهُ Akan tetapi jika sebagian kamu mempercayai sebagian yang lain, maka hendaklah yang dipercayai itu menunaikan amanatnya (hutangnya). Jika orang yang berhutang tidak mampu berinteraksi dengan baik, masih kecil, gila, atau tidak mampu berbicara, maka hendaklah ia mewakilkannya kepada wali atau orang yang diamanahinya. Dan disamping menulisnya hendaklah kalian mencari dua lelaki muslim yang adil untuk menjadi saksi. Jika tidak ada dua lelaki maka carilah seorang lelaki dan dua orang perempuan yang kalian restui kesaksiannya, agar jika salah seorang perempuan itu lupa maka seorang lagi dapat mengingatkannya. Dan janganlah para saksi itu enggan memberi kesaksian jika dimintai kesaksiannya. Dan janganlah kalian bosan menulis hutang kalian baik itu banyak atau sedikit, sampai datang waktu pembayarannya. Apa yang Kami perintahkan kepada kalian ini lebih kuat amanahnya, lebih kuat persaksiannya, lebih aman agar kalian tidak ragu jumlah hutang dan waktu pembayarannya. Namun jika jual beli secara tunai maka tidak mengapa jika tidak ditulis. Dan hadirkanlah saksi dalam jual beli tunai maupun kredit. Dan wajib atas saksi dan penulis untuk menyampaikan kesaksian dan penulisannya sesuai kenyataan. Dan pemberi piutang atau penerima hutang tidak boleh menimbulkan mudharat bagi saksi dan penulis, baik itu dengan mengubah catatan, menghalangi persaksian, atau memaksa mereka melakukan perjalanan jauh untuk menyampaikan kesaksian atau melakukan penulisan. Jika kalian melakukan apa yang dilarang Allah maka kalian telah keluar dari ketaatan kepada Allah. Allah mengajarkan kalian ilmu yang bermanfaat bagi kehidupan di dunia dan di akhirat. Dan Allah Maha Meliputi segala sesuatu dengan ilmu-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "282. إِذَا تَدَايَنتُم بِدَيْنٍ ( apabila kamu bermu’amalah tidak secara tunai) Kata (العين) diibaratkan orang arab untuk apa yang hadir dalam muamalat, sedangkan kata (الدين) untuk apa yang gaib (tidak hadir). إِلَىٰٓ أَجَلٍ مُّسَمًّى (untuk waktu yang ditentukan ) Ayat ini menunjukkan bahwa memberi ajal (waktu tenggang) yang tidak diketahui itu tidak diperbolehkan terlebih lagi ajal dalam jual beli dengan akad salam. فَاكْتُبُوهُ ۚ ( hendaklah kamu menuliskannya) Yakni menuliskan hutang tersebut beserta ajalnya, karena hal itu lebih menghindarkan pertikaian dan menjauhkan perselisihan. وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌۢ بِالْعَدْلِ ۚ ( Dan hendaklah seorang penulis di antara kamu menuliskannya dengan benar) Ini adalah perintah bagi pemberi hutang dan penerima hutang untuk memilih seorang penulis yang tidak condong atau pilih kasih kepada salah satu dari mereka, namun orang yang senantiasa mendahulukan kebenaran dan keadilan diantara mereka. وَلَا يَأْبَ كَاتِبٌ(Dan janganlah penulis enggan menuliskannya ) Yakni janganlah seorang penulis enggan untuk menulis buku utang piutang. كَمَا عَلَّمَهُ اللهُ ۚ ( sebagaimana Allah mengajarkannya) Yakni dengan cara penulisan yang Allah ajarkan kepadanya. Atau sebagaimana Allah menajarkannya lewat firman-Nya untuk mengerakan keadilan. وَلْيُمْلِلِ الَّذِى عَلَيْهِ الْحَقُّ ( dan hendaklah orang yang berhutang itu mengimlakkan (apa yang akan ditulis itu) Yakni orang yang berhutang diperintahkan Allah untuk mengimlakkan (mendiktekan). Karena sebenarnya kesaksian itu atas pengakuannya terhadap hutang yang menjadi tanggungannya. Dan Allah memerintahkan kepadanya agar senantiasa bertakwa dalam apa yang ia diktekan kepada penulis. Dan melarangnya untuk melakukan pengurangan didalamnya. Dan pendapat lain mengatakan bahwa itu adalah larangan bagi penulis. فَإِن كَانَ الَّذِى عَلَيْهِ الْحَقُّ سَفِيهًا (Jika yang berhutang itu orang yang lemah) Makna (السفيه) adalah orang yang tidak mampu bermuamalah dengan baik. أَوْ ضَعِيفًا( akalnya atau lemah (keadaannya)) Seperti lansia, bayi, atau yang lemah akalnya. أَوْ لَا يَسْتَطِيعُ أَن يُمِلَّ(atau dia sendiri tidak mampu mengimlakkan ) Yaitu orang bisu atau orang yang tidak mampu mengibaratkan perkataan sebagaimana semestinya. فَلْيُمْلِلْ وَلِيُّهُۥ بِالْعَدْلِ ۚ ( maka hendaklah walinya mengimlakkan dengan jujur) Yakni para wali dan yang mendapat wasiat mengimlakkan sebagai berwakilan atas orang-orang yang telah disebutkan. وَاسْتَشْهِدُوا۟ شَهِيدَيْنِ مِن رِّجَالِكُمْ ۖ ( Dan persaksikanlah dengan dua orang saksi dari orang-orang lelaki) Yakni mintalah dua orang lelaki muslim untuk menjadi saksi atas surat hutang. Dan dengan ayat ini persaksian hukumnya wajib, namun pendapat lain mengatakan hukumnya sunnah. فَإِن لَّمْ يَكُونَا ( Jika tak ada dua oang lelaki ) Yakni yang menjadi saksi. رَجُلَيْنِ فَرَجُلٌ وَامْرَأَتَانِ ( maka (boleh) seorang lelaki dan dua orang perempuan) Yakni maka mintalah persaksian dari seorang lelaki dan dua orang perempuan. Dan ini adalah batas minimal (nishab) bagi persaksian dalam muamalat. مِمَّن تَرْضَوْنَ مِنَ الشُّهَدَآءِ ( dari saksi-saksi yang kamu ridhai) Yakni yang kalian ridhai agama dan keadilan mereka. أَن تَضِلَّ إِحْدَىٰهُمَا ( supaya jika seorang lupa) Kesesatan dalam persaksian adalah lupa atas persaksian tersebut atau lupa sebagiannya. فَتُذَكِّرَ إِحْدَىٰهُمَا الْأُخْرَىٰ ۚ (maka yang seorang mengingatkannya ) Yakni apabila salah satu saksi perempuan itu lupa maka yang lainnya bisa mengingatkan dan apabila yang lain lupa maka yang satu bisa mengingatkan. Hal ini karena kelemahan yang ada dalam perempuan, tidak sebagaimana para lelaki. Dan barangkali salah satu lupa bagian tertentu dan yang lain lupa bagian lainnya maka mereka bisa saling mengingatkan. وَلَا يَأْبَ الشُّهَدَآءُ إِذَا مَا دُعُوا۟ ۚ ( Janganlah saksi-saksi itu enggan (memberi keterangan) apabila mereka dipanggil) Yakni untuk memberi persaksian yang telah ditanggungnya sebelumnya. Dan pendapat lain mengatakan: apabila dipanggil untuk menanggung persaksian. وَلَا تَسْـَٔمُوٓا۟ أَن تَكْتُبُوهُ ( dan janganlah kamu jemu menulis hutang itu) Yakni janganlah bosan untuk menulis hutang yang terjadi diantara kalian. Karena kemungkinan mereka akan bosan untuk menulis akibat banyaknya hutang piutang yang terjadi diantara mereka. Kemudian Allah menekankan hal ini dengan firman-Nya setelah kalimat ini. ذٰلِكُمْ ( Yang demikian itu) Yakni penulisan itu. أَقْسَطُ (lebih adil ) Yakni lebih terjaga dan lebih benar. وَأَقْوَمُ لِلشَّهٰدَةِ ( dan lebih menguatkan persaksian) Yakni lebih membantu untuk membuktikan kebenaran kesaksian dan lebih mengokohkannya. وَأَدْنَىٰٓ أَلَّا تَرْتَابُوٓا۟ ۖ (dan lebih dekat kepada tidak (menimbulkan) keraguanmu ) Yakni buku hutang yang mereka tulis tersebut akan menghindarkan keraguan yang mendatangi mereka. تِجٰرَةً حَاضِرَةً (perdagangan tunai ) Yakni perdagangan tunai yang ada didalamnya dua alat tukar (barang dan uang). تُدِيرُونَهَا بَيْنَكُمْ (yang kamu jalankan di antara kamu ) Yakni yang kalian lakukan langsung dari tangan ke tangan, atau jual beli secara kontan. Maka dalam hal ini kalian diperbolehkan untuk tidak menulisnya. وَأَشْهِدُوٓا۟ إِذَا تَبَايَعْتُمْ ۚ ( Dan persaksikanlah apabila kamu berjual beli) Yakni dalam jual beli secara tunai/kontan cukup dengan mendatangkan saksi. Dan pendapat lain mengatakan makna potongan ayat ini adalah apabila kalian berjual beli secara tunai atau dengan hutang (kredit) maka datangkanlah saksi. Ibnu Umar apabila berjual beli secara tunai maka ia mendatangkan saksi dan apabila berjual beli secara kredit maka ia menulisnya. وَلَا يُضَآرَّ كَاتِبٌ وَلَا شَهِيدٌ ۚ (dan janganlah penulis dan saksi saling sulit menyulitkan ) Yakni dengan merubah, menambahi, dan mengurangi apa yang ia tulis. Dan bisa jadi kemadharatan itu berasal dari kedua belah pihak penjual dan pembeli sehingga keduanya dilarang Allah untuk memberi madharat kepada penulis dan saksi, misalkan si penulis dan saksi dipanggil ketika keduanya sibuk dengan urusan mereka masing-masing namun keduanya dipaksa untuk menjawab panggilan dan akan disakiti apabila mereka telat dalam menjawab panggilan, atau keduanya diminta untuk datang ke tempat yang jauh. وَإِن تَفْعَلُوا۟ ( Jika kamu lakukan (yang demikian),) Yakni melakukan yang dilarang berupa memberi kemudharatan. فَإِنَّهُۥ( maka sesungguhnya hal itu) Yakni perbuatan kalian itu. فُسُوقٌۢ بِكُمْ ۗ( adalah suatu kefasikan pada dirimu ) Yakni keluar dari ketaatan menuju kemaksiatan. وَيُعَلِّمُكُمُ اللهُ ۗ ( Allah mengajarmu) Yakni mengajarkan ilmu yang kalian butuhkan dalam ayat ini dan yang lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sebagian ulama mengatakan : Ayat yang paling besar diharapakan dalam al-qur'an adalah ayat-ayat yang membahas perkara hutang piutang; karena di dalamnya Allah membahas cara-cara yang menjamin terjaganya hutang itu dari ketidak pastian, walaupun jumlah hutang itu sedikit, mereka mengatakan : dan dengan ayat ini harta kaum muslimin akan terjaga, hal ini merupakan maslahat yang sangat besar bagi umat islam. 2 ). { وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌۢ بِالْعَدْلِ } dalam ayat disebutkan { بَّيْنَكُمْ } \"diantara kalian\" dan bukan { أحدكم } \"salah seorang dari kalian\", karena tatkala pemberi hutang yang berperan sebagai penulis untuk penerima hutang ataupun sebaliknya; Allah kemudian menetapkan syari'at-Nya dalam perkara ini dengan menjadikan seorang penulis hutang selain dari keduanya agar keadilan ditegakkan, sehingga tidak terjadi pada hati atau pena penulis kecendrungan terhadap salah satu dari keduanya. 3 ). { وَلَا يَأْبَ كَاتِبٌ أَنْ يَكْتُبَ كَمَا عَلَّمَهُ اللَّهُ } Bahwasanya pencatatan itu di antara nikmat-nikmat Allah terhadap hamba-hambaNya, di mana urusan-urusan agama dan urusan-urusan duniawi mereka tidak akan lurus kecuali dengannya. Dana bahwasanya barangsiapa yang diajarkan oleh Allah penulisan, sesungguhnya Allah mengaruniakan kepadanya keutamaan yang besar, dan menjadi kesempurnaan syukurnya terhadap nikmat Allah itu, agar dia memenuhi kebutuhan-kebutuhan hamba dengan pencatatan yang dilakukannya dan tidak dia boleh menolak untuk menulis. 4 ). { وَاتَّقُوا اللَّهَ ۖ وَيُعَلِّمُكُمُ اللَّهُ } \"Dan bertakwalah kepada Allah; Allah mengajarmu\" , Ibnu Taimiyah mengajarkan bahwa pengaruh tazkiyah dan taqwa dalam menuntut ilmu sangatlah besar, dan merupakan makna qur'ani yang sebagian besar umat islam lalai darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "282. Wahai orang-orang yang beriman jika kalian bermuamalah, dan ikatan muamalah itu dimulai. Menurut bangsa Arab Ad-Dainu adalah muamalah yang dilakukan secara tidak langsung, dan sebaliknya Al-‘Ainu adalah akad yang sedang dilakukan, dan hutang itu dilakukan sampai waktu tertentu dan harus diketahui waktunya, karena ketidak tahuan itu akan merusak akad. Maka tulislah hutang tersebut sampai waktu pembayarannya untuk mencegah pertengkaran dan perselisihan. Dan akad hutang piutang antara pemberi pinjaman dan penerima pinjaman itu sebaiknya ditulis oleh orang yang adil, yaitu ditulis dengan benar tanpa ditambahi dan dikurangi, dan penulis akad itu tidak menahan diri untuk menulisnya. Dia menulisnya sebagaimana yang disyariatkan Allah dengan adil dan tepat, dan sesuai yang didiktekan tanpa menambahi dan menguranginya, dan orang yang mendiktenya adalah orang yang berhak untuk menjelaskan seluruh syarat dan waktu akadnya untuk menghindari kezaliman dan kecurangan. Dan sebaiknya dia bertakwa kepada Allah dalam mendikte sehingga tidak mengurangi sedikitpun haknya. Al-Bakhsu adalah mengurangi sesuatu Dan apabila orang yang berhak atas hutang tersebut yaitu penerima pinjaman itu tidak tahu apa-apa yaitu karena perilaku yang buruk atau berlaku boros, atau tidak sanggup untuk mendikte karena masih kecil, terlalu tua, lemah, sakit, atau tidak mampu mendikte karena tidak tahu, bisu, gagap atau hal semacamnya, maka yang mendiktenya adalah wali, pewaris atau pengawal yang melaksanakan tugasnya di hadapan penulis berupa akad hutang dengan adil atau dengan benar. Dan persaksikanlah dengan dua orang laki-laki muslim atas penulis akad hutang itu, dan jika dua saksi itu bukan laki-laki semua, maka sebaiknya yang bersaksi adalah seorang laki-laki dan dua perempuan. Dan ini adalah takaran minimal dalam persaksian muamalah dari orang-orang yang kalian ridhai kepercayaan dan keadilannya dalam memberikan kesaksian karena dikhawatirkan jika salah satu saksi wanita itu salah atau lupa dalam memberikan kesaksian, dan saksi wanita lainnya mengingatnya, maka saksi wanita yang ingat itu akan mengingatkan saksi wanita yang lupa, ketika keduanya memiliki ingatan lemah atau kurang memperhatikan perkara tersebut. Dan para saksi itu tidak menahan diri untuk memberikan persaksian yang mereka emban sebelumnya jika mereka dipanggil untuk memberikan kesaksiannya atau menunaikan tugas yang diembannya. Persaksian atas akad hutang atau jual-beli dan penulisan akad hutang itu adalah dua hal untuk mendampingi ayat setelahnya Dan janganlah kalian bosan untuk menulis akad hutang yang kalian lakukan sekalipun itu hanya sedikit atau banyak sampai waktu yang disepakati. Menulis dan bersaksi atas akad hutang itu lebih adil, yaitu lebih benar dan lebih terjaga, lebih membantu untuk memberikan pesaksian yang haq dan lebih tepat. Menulis atau bersaksi atas akad hutang itu bisa menguatkan akad hutang dan bisa menghilangkan keraguan tentang nilai dan waktu pembayaran hutang. Maka sebaiknya (kalian) menulis akad hutang dalam suatu catatan, kecuali jika muamalah itu dalam hal perniagaan tunai yaitu dengan menghadirkan dua alat tukar yang mana kalian bisa mengaturnya yaitu kalian bisa saling bertukar atau mendapatkan sesuatu yang ditukar secara langsung tanpa menunggu waktu tertentu, maksudnya bahwa akad jual belinya sudah selesai, maka kalian tidak berdosa bila tidak menulisnya, yaitu mengabaikan penulisan akad jual-beli itu, Karena keduanya sudah memegang sesuatu yang ditukar secara langsung sebelum keduanya berpisah. Dan persaksikanlah akad jual-beli bagaimanapun keadaannya baik dilakukan secara langsung ataupun berhutang untuk mencegah perselisihan. Dan tidaklah diperbolehkan bagi pemberi dan penerima hutang itu menyulitkan penulis dan saksi akad hutang dengan melakukan kecurangan, mengganti, menambah dan mengurangi catatan atau tidak mau bersaksi. Dan tidaklah orang yang berhak atas akad tersebut membebani keduanya (penulis dan saksi akad) dengan sesuatu yang tidak sesuai berupa kecurangan dan kezaliman atau membatalkan akad tersebut seperti melakukan perjalanan jauh karena adanya catatan dan persaksian itu. Jika kalian melakukan sesuatu yang dilarang berupa sesuatu yang merugikan, maka itu adalah perbuatan fasik, yaitu keluar dari ketaatan dan menuju kemaksiatan. Dan bertakwalah kepada Allah dalam perintah dan laranganNya. Allah mengajarkan kalian tentang hal-hal yang baik bagi urusan kalian dalam hal agama dan dunia. Dan Allah itu Maha Mengetahui setiap perbuatan kalian dan akan membalas kalian atas hal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman apabila kalian melakukan transaksi utang piutang} kalian bertransaksi utang piutang {untuk waktu yang ditentukan} waktu yang telah ditentukan {hendaklah kalian mencatatnya, Hendaklah seorang pencatat di antara kalian} di antara dua orang yang melakukan transaksi utang piutang {yang menuliskannya dengan adil} dengan benar {Janganlah pencatat menolak} janganlah dia menolak {untuk menuliskannya sebagaimana Allah telah mengajarinya. Hendaklah dia mencatat, dan orang yang berutang itu mendiktekan} maka sebaiknya orang yang mendikte adalah orang yang berhutang {Hendaklah dia bertakwa kepada Allah, Tuhannya, dan janganlah dia menguranginya sedikit pun} dan janganlah dia mengurangi sedikitpun hutangnya {Jika yang berhutang itu orang yang kurang mampu akalnya} tidak baik tabiatnya {atau lemah} masih kecil atau gila {atau tidak mampu mendiktekan sendiri} tidak mampu mendiktekan sendiri karena bisu, gagap, atau bodoh {maka hendaklah walinya mendiktekannya} orang mewakili urusannya {dengan adil. Mintalah kesaksian dua orang saksi laki-laki di antara kalian} dan mintalah saksi atas nama agama kepada dua orang saksi laki-laki {Jika tidak ada dua orang laki-laki, maka seorang laki-laki dan dua orang perempuan di antara orang-orang yang kalian sukai dari para saksi} sehingga jika salah seorang lupa} lupa {yang lain mengingatkannya. Janganlah saksi-saksi itu menolak apabila dipanggil} ketika mereka dipanggil untuk bertanggung jawab dalam kesaksian itu {Janganlah kalian bosan} janganlah kalian bosan {mencatatnya baik kecil maupun besar} baik hutang itu sedikit ataupun banyak {sampai batas waktunya} sampai waktu pelunasan yang disepakati oleh orang yang melakukan transaksi utang piutang {Yang demikian itu lebih adil} lebih adil {di sisi Allah, lebih dapat menguatkan kesaksian} membantu menguatkan kesaksian {dan lebih mendekatkan kalian pada ketidakraguan} mendekatkan kalian pada ketidak raguan dalam jenis, kemampuan dan waktu hutang {kecuali jika hal itu merupakan perniagaan tunai yang kalian jalankan di antara kalian. Maka tidak ada dosa} dosa {bagi kalian jika kalian tidak mencatatnya. Ambillah saksi apabila kalian berjual beli dan janganlah pencatat mempersulit, begitu juga saksi. Jika kalian melakukan} kemudharatan yang dilarang bagi kalian {sesungguhnya hal itu merupakan kefasikan bagi kalian} penyimpangan kalian dari ketaatan menuju kemaksiatan {Bertakwalah kepada Allah, Allah mengajari kalian, dan Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "282.Ayat-ayat ini meliputi petunjuk Allah kepada hamba-hambaNya dalam muamalah diantara mereka yaitu pemeliharaan hak-hak mereka dengan cara-cara yang bermanfaat dan kemaslahatan yang orang-orang ahli berpikir pun tak mampu memberikan sarannya yang lebih baik dan lebih sempurna darinya, karena di dalamnya banyak sekali faidah-faidahnya, di antaranya: 1. Bolehnya muamalah dalam bentuk hutang piutang, baik berupa hutang-hutang salam atau pembelian barang yang harganya di tangguhkan, semua itu boleh di lakukan, karena Allah telah mengabarkanya berkaitan dengan kaum Mukminin, dan apa pun yang Allah kabarkan tentang kaum Mukminin, maka sesungguhnya hal itu termasuk konsekuensi keimanan dan juga hal itu telah di tetapkan oleh Allah yang MahaKuasa. 2. Wajibnya menyebutkan tempo pembayaran dalam seluruh transaksi hutang piutang dan masa penyewaan. 3. Bahwasanya apabila tempo itu tidak diketahui, maka itu tidak halal, karena itu (sangat rentan) adanya tipu daya dan berbahaya, maka hal itu termasuk perjudian. 4. Allah memerintahkan untuk mencatat (dokumentasi hutang) piutang. Perkara yang satu ini terkadang menjadi wajib yaitu apabila wajib memelihara hak seperti seorang hamba yang wajib atasnya perwalian contohnya harta anak yatim, wakaf, perwakilan, amanah, dan terkadang juga mendekati wajib sebagaiman bila hak itu semata-mata milik seorang hamba. Dan terkadang juga lebih berat kepada wajib dan terkadang lebih berat kepada sunah, sesuai kondisi yang di tuntut pada masalah itu. Dan pada intinya pencatatan itu adalah merupakan perangkat yang paling besar dalam menjaga muamalah-muamalah yang tertangguhkan karena rentan terjadi kelupaan dan kesalahan, dan sebagai tindakan pencegahan dari orang-orang yang tidak amanah yang tidak takut kepada Allah. 5. Perintah Allah kepada juru tulis untuk menulis kedua pihak yang bermuamalah dengan adil, ia tidak boleh condong kepada salah satu pihak karena faktor keluarga misalnya atau selainnya, atau memusuhi salah satunya karena suatu dendam dan semacamnya. 6. Bahwasanya penulisan antara kedua belah pihak yang bermuamalah adalah di antara amal-amal yang paling utama dan tindakan kebaikan kepada keduanya. Dalam pencatatan itu mengandung pemeliharaan pihak keduanya dan melepaskan tanggung jawab dari keduanya seperti apa yang di perintahkan oleh Allah. Maka hendak juru tulis mencari pahala dengan propesinya di antara manusia dengan perkara-perkara ini dengan mendapat keberuntungan dengan balasan baiknya. 7.Hendaklah juru tulis mengetahui keadilan dan terkenal dengan keadilan, karena bila dia tidak mengerti keadilan, pastilah dia tidak bisa mewujudkanya, dan apabila keadilannya tidak diakui oleh orang banyak dan tidak diridhai mereka maka pastilah pencatatnya juga tidak akan diakui, dan maksud yang diinginkan tidak akan terwujud yaitu pemeliharaan hak. 8. Bahwasanya kesempurnaan dari pencatat dan keadilan dalam muamalah itu adalah bahwa juru tulis itu ahli dalam merangkai kata dan membuat kalimat yang sesuai dengan jenisnya, dan kebiasaan yang berlaku dalan suatu masyarakat dalam hal ini memiliki peran yang cukup besar. 9. Bahwasanya pencatat itu diantara nikmat-nikmat Allah terhadap hamba-hambaNYa, dimana urusan-urusan agama dan urusan-urusan dunia mereka tidak akan lurus kecuali dengannya. Dan bahwasanya barang siapa yang di ajarkan oleh Allah penulisan, sesungguhnya Allah telah mengaruniakan keutamaan yang besar, dan menjadi kesempurnaan syukurnya terhadap nikmat Allah itu, agar dia memenuhi kebutuhan-kebutuhan hamba dengan pencatatan yang di lakukanya dan tidak boleh menolak untuk menulis. Karena itu Allah berfirman, ”Dan janganlah penulis enggan menuliskannya sebagaimana Allah mengajarkanya.” 10. Bahwasanya apa yang d tulis oleh juru tulis itu adalah pengakuan dari orang yang menanggung hak apabila ia mampu merangkai kata tentang hak yang wajib atas dirinya tersebut. Namun apabila ia tidak mampu atas hal itu karena umurnya yang masih kecil atau kebodohannya, ketidak warasannya, kebisuannya, atau ketidak mampuannya, maka walinya harus melakukannya untuknya, dan walinya itu sebagai wakil dirinya dalam hal tersebut. 11. Bahwasanya pengakuan itu adalah jalan yang paling benar dalam menetapkan suatu hak, di mana Allah memerintahkan kepada juru tulis untuk menulis apa yang didiktekan oleh orang yang menanggung hak orang lain. 12. Penetapan perwakilan bagi orang orang yang tidak mampu saperti anak kecil, orang gila, orang bodoh, dan semacamnya. 13. Bahwasanya seorang wali itu sama posisinya seperti orang yang di wakilkanya dalam segala pengakuanya yang berkaitan dengan hak-haknya 14.Bahwasanya orang yang anda percaya dalam suatu muamalah dan anda serahkan urusan, itu kepadanya maka perkataanya dalam hal itu dapat diterima, karena dia pengganti diri anda, karena apabila wali itu untuk orang-orang yang tidak mampu menepati posisi mereka, maka orang yang anda jadikan wali anda sendiri lalu anda serahkan urusan itu kepadanya adalah lebih utama diterima dan diakui perkataanya dan di dahulukan daripada perkataan anda sendiri ketika terjadi perselisihan. 15. Bahwasanya diwajibkan bagi orang yang menanggung hak orang lain, apabila mendiktekan kepada juru tulis agar bertakwa kepada Allah dan tidak berlaku curang atas hak yang di tanggungnya. Ia tidak mengurangi jumlahnya atau sipatnya, atau syarat di anatara syarat-syaratnya atau ukuran di antara ukuran-ukuranya. Akan tetapi ia harus mengakui setiap hal yang berkaitan dengan hak tersebut sebagaiman hak itu wajib atas orang lain yang menanggung hak dirinya. Barang siapa yang tidak melaksanakan hal itu, maka itu tenasuk orang-orang yang curang lagi mengurangi (timbangan dan takaran). 16 Wajib mengakui hak-hak yang tampak maupun hak-hak yang tersembunyi, dan bahwa hal itu adalah diantara karakter terbesar ketakwaan, sabagaimana menolak pengakuan adalah diantara pembatal ketakwaan dan yang menguranginya. 17. Petunjuk untuk mengadakan saksi dalam jual beli. Apabila dalam hal hutang piutang maka hukumnya adalah hukum pencatatan sebagaimana yang telah lalu. Karena penulisan itu adalah pencatatan kesaksian. Apabila jual beli itu adalah jual beli tunai maka seyogyanya ada saksi padanya dan tidak berdosa apabila meninggalkan penulisan kereka banyaknya dan adanya kesulitan untuk menulis (semua akses yang ada). 18. Petunjuk untuk mengadakan saksi dua orang laki-laki yang adil, namun apabila tidak memungkinkan atau tidak ada atau sulit, maka boleh satu laki-laki dan dua wanita. Itu mencakup semua bab muamalah transaksi obligasi dan transaksi utang piutang dengan segala hal yang berkaitan denganya, seperti syarat-syarat atau dokumen-dokumen atau semacamnya. Apabila ada keberatan yang mengatakan bahwa terdapat riwayat shahih dari Rasulolloh shalallohu alaihi wasallam bahwa beliau memutuskan dengan satu saksi saja disertai sumpah, tetapi kenapa ayat yang mulia ini tidak menunjukan kecuali hanya saksi dua laki-laki atau satu laki-laki dan dua wanita? Dapat dijawab, bahwa ayat yang mulia ini mengandung petunjuk Allah kepada hamba-hambaNya untuk menjaga hak-hak mereka, oleh karena itu Allah mendatangkan kepadanya jalan yang paling sempurna dan yang paling kuat dan ayat ini juga tidak mengandung hak yang meniadakan (menafiakan) apa yang disebutkan oleh Nabi saw dengan menetapkan satu saksi yang disertai sumpah. masalah memelihara hak-hak, pada awal-awalnya Allah mengarahkan hamba-hambaNya, untuk berhati-hati dengan secara total. Masalah ketetapan diantara dua pihak yang bersengketa di pertimbangan dengan melihat segala hal yang membantu dan keterangan-keterangan yang ada sesuai keadaan dan kondisi. 19. Bahwasanya kesaksian dua orang wanita itu sebanding dengan satu laki-laki dan hak duniawi. Adapun dalam perkara-perkara agama seperti periwayatan dan fatwa, maka satu wanita sedarajat dengan (sama dengan) laki-laki. Perbedaan antara perkara itu sangatlah jelas sekali. 20. Petunjuk kepada hikmah di balik perbandingan kesaksian dua wanita dengan satu laki-laki yang mana hal itu dikarenakan kelemahan daya ingat wanita pada umumnya dan kuatnya daya ingat laki-laki. 21. Bahwasanya sekiranya seorang saksi bila melupakan kesaksiannya namun saksi yang lainnya mengingatkannya lalu dia teringat kembali, maka kelupaan itu tidaklah mengapa bila dapat dihindarkan dengan adanya pengingatan tersebut, berdasarkan Firman Allah, “Supaya jika seorang lupa maka yang seorang mengingatkannya.” Yang lebih baik lagi adalah bila seorang saksi itu lupa kemudian dia bisa mengingat kembali tanpa diingatkan oleh saksi lainnya, karena sesungguhnya kesaksian itu intinya adalah keyakinan dan ilmu. 22. Bahwasanya kesaksian itu harus dengan dasar ilmu dan keyakinan, bukan keraguan. Maka ketika terjadi keraguan pada seorang saksi dalam kesaksiannya walaupun berdasarkan dugaan terkuatnya, tidaklah halal baginya untuk bersaksi kecuali dengan apa yang ia ketahui dengan yakin. 23. Bahwasanya seorang saksi itu tidak boleh menolak bila diminta untuk bersaksi, baik saksi untuk membela atau untuk melawan, dan bahwasanya menunaikan kesaksian itu adalah diantara amalan-amalan shalih yang paling yang paling utama sebagaimana yang telah diperintahkan oleh Allah dan mengabarkan tentang manfaatnya dan berbagai kemaslahatannya. 24. Bahwasanya tidaklah boleh memudaratkan juru tulis dan tidak juga saksi, yaitu dengan dipanggil pada waktu-waktu yang memudaratkan mereka berdua. Dan sebagaimana orang-orang yang memiliki hak dan orang-orang yang saling bermuamalah itu dilarang merugikan para juru tulis maupun para saksi, begitu pula para juru tulis dan saksi tidak boleh merugikan orang-orang yang memiliki hak maupun kedua pihak yang bermuamalah atau salah satu pihak dari keduanya. Dalam hal ini bahwa saksi maupun juru tulis bila terjadi kerugian pada mereka dalam hal penulisan maupun kesaksian, maka kewajiban keduanya gugur. 25. Peringatan bahwasanya orang-orang yang baik yang melakukan kebajikan, tidaklah halal merugikan dan memberatkan mereka dengan suatu hal yang tidak mereka sanggupi. Tidakkah pahala kebajikan itu adalah kebajikan juga? Dan demikian juga atas orang-orang yang melakukan kebajikan, agar menyempurnakan kebaikan mereka dengan tidak merugikan, baik dengan perkataan maupun dengan perbuatan terhadap orang-orang yang menjadi obyek kebaikan mereka, karena sesungguhnhya kebajikan itu tidaklah sempurna kecuali dengan sikap tersebut. 26. Bahwasanya tidaklah halal memungut biaya terhadap penulisan dan kesaksian, dimana kedua hal tersebut hukumnya adalah wajib; karena hal itu adalah haq yang telah diwajibkan oleh Allah atas saksi dan juru tulis, dan karena pungutan itu merupakan tindakan merugikan kedua pihak yang bermuamalah. 27. Peringatan terhadap kemaslahatan dan manfaat yang diakibatkan oleh pengamalan akan petunjuk yang mulia ini; bahwa dalam pengamalan tersebut terdapat pemeliharaan hak, keadilan, menghilangkan perselisihan, selamat dari kelupaan dan kebingungan. Karena itu Allah berfirman, “Yang demikian itu, lebih adil di sisi Allah dan lebih menguatkan persaksian dan lebih dekat kepada tidak (menimbulkan) keraguanmu” dan ini merupakan kemaslahatan yang asasi bagi manusia. 28. Hendaklah di ketahui bahwa menulis (pencatat) adalah di antara perkara-perkara agama, karena hal itu merupakan tindakan memelihara agama dan dunia, dan merupakan sebab kebajikan. 29. Bahwasanya barang siapa yang di istimewakan oleh Allah dengan suatu nikmat dari nimat-nikmat Allah yang di butuhkan manusia, maka menjadi kesempurnaan kesukuran terhadap nikmat itu adalah mengembalikan nikmat-nikmat itu kepada hamba-hamba Allah dan ia memenuhi kebutuhan-kebutuhan mereka denganya.karena Allah mnyebut sebab-sebab di larangnyaseorang juru tulis menolak menjadi juru tulis dengan firmanya, ”sebagaiman Allah mengajarkanya, ”Dan bersama itu barang siapa yang memenuhi kebutuhan saudaranya, niscaya Allah memenuhi kebutuhanya. 30. bahwasanya memudharatkan juru tulis dan para saksi adalah tindakan kepasikan terhadap manusia, karena kepasikan itu keluar dari iman Allah kepada kemaksiatan kepadaNya, dan itu bertambah dan berkurang serta bercabang-cabang. Oleh karena itu Allah tidak berfirman, “dan kalian adalah orang-orang yang fasik” lalu dia berfirman, ”Maka sesungguhnya suatu hal itu adalah kepasikan pada dirimu.” Maka sebarapa besar seseorang keluar dari ketaatannya kepada Allah, sebasar itu pula kepasikan yang ada padanya.Dan dapat di ambil dengan dalil firman Allah, ”Dan bertakwalah kepada Allah; Allah mengajarimu, ” Bahwa bertakwa kepada Allah menyerupai memperoleh ilmu, dan yang lebih jelas dari ayat ini adalah firmanNya \"Hai orang-orang beriman, jika kamu bertakwa kepada Allah, Kami akan memberikan kepadamu Furqaan. Dan kami akan jauhkan dirimu dari kesalahan-kesalahanmu, dan mengampuni (dosa-dosa)mu. Dan Allah mempunyai karunia yang besar\", QS -An-anfal:29-, 31. Bahwasanya sebagaiman ilmu yang bermanfaat di antaranya adalah mengajarkan ilmu-ilmu agama yang berkaitang dengan ibadah, begitu pula mengajarka perkara-perkara duniawi yang berkaitan dengan muamalah, karena Allah memelihara bagi hamba-hambaNya segala perkara agama dan dunia mereka dan kitabNya yang agung merupakan penjelas segala sesuatu. 32. Disayriatkanya penulisan dokumen-dokumen yang berkaitan dengan hak-hak, yaitu penggadaian dan jaminan-jaminan yang dibebankan kepada seseorang untuk memperoluh haknya, baik dia itu pekerja yang abaik maupun jahat, terpercaya atu pengvhianat. Karena berapa banyak sudah dokumen-dokumen telah menghilangkan hak dan menghilangkan perselisihan. 33. Bahwasanya menjadi kesempurnaan dokumen dalam penggadaian adalah barang yang menjadi jaminan harus di pegang, sekalipun itu tidaklah berarti bahwa penggadaian itu tidak sah kecuali dengan pengangan jaminan, akan tetapi adanya pembatasan dipegannya jaminan menunjukan bahwa rekadang terjadi serah terima terjadilah kepercayaan yang sempurna dan terkadang tidak sampai di pegang, sehingga menjadi kurang sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { تَدَايَنتُم } Tadâyantum: Melakukan transaksi utang piutang baik dalam jual beli, salam atau pinjaman. { إِلَىٰٓ أَجَلٖ مُّسَمّٗى } Ilâ ajalim musamma: Sampai waktu yang ditentukan baik hari, bulan ataupun tahun. { بِٱلۡعَدۡلِۚ } Bil ‘adli: Tanpa ada tambahan, pengurangan, penipuan atau rekayasa akan tetapi dengan benar dan adil. { وَلَا يَأۡبَ } Walâ ya’ba: Janganlah seorang yang bisa menulis enggan untuk menulis. { وَلۡيُمۡلِلِ ٱلَّذِي عَلَيۡهِ ٱلۡحَقُّ } Walyumlililladzîy a’laihil haqqu: Hendaklah orang yang berutang itu mendiktekan apa yang harus ditulis. { وَلَا يَبۡخَسۡ مِنۡهُ شَيۡ‍ٔٗاۚ } Walâ yabkhas minhu syaian: Tidak mengurangi jumlah utang dan menyebutkan semuanya walaupun jumlah itu kecil seperti fils. { سَفِيهًا أَوۡ ضَعِيفًا } Safîhan au dho’îfan: Safih adalah orang yang tidak dapat mengatur uangnya dengan baik, sedangkan dho’if adalah orang yang tidak mampu untuk mendiktekan karena bisu atau sudah pikun karena tua. { وَلِيُّهُۥ } Waliyyuhu: Orang yang berhak mewakili urusannya karena kelemahan atau kekurangan yang ada pada orang yang menjadi tanggung jawabnya. {مِن رِّجَالِكُمۡۖ } Min rijâlikum: Kaum muslimin yang merdeka, bukan budak apalagi kafir. { أَن تَضِلَّ إِحۡدَىٰهُمَا } An tadhilla ihdâhuma: Agar ketika salah seorang dari keduanya lupa atau salah karena tidak mengerti. { وَلَا تَسۡ‍َٔمُوٓاْ } Wa Lâ tas’amû: Janganlah engkau jemu atau bosan untuk menulisnya walaupun nilai utang piutang itu hanya kecil. { أَقۡسَطُ عِندَ ٱللَّهِ } Aqsathu ‘indallâh: lebih adil menurut hukum dan syariat Allah Ta’ala. { وَأَقۡوَمُ لِلشَّهَٰدَةِ } Wa aqwamu lisysyahâdah: Lebih memperkuat dan memantapkan persaksian karena tulisan tidak pernah terlupakan sedangkan persaksian terkadang terlupakan, saksinya wafat atau tidak diketahui keberadaannya. { وَأَدۡنَىٰٓ أَلَّا تَرۡتَابُوٓاْ } Wa adna allâ tartabû: Tidak menimbulkan perselisihan dibanding dengan persaksian tanpa diikuti dengan tulisan. { تُدِيرُونَهَا بَيۡنَكُمۡ } Tudîrûnahâ bainakum: Yang kamu jalankan di antara kamu, yaitu penjual memberikan barang dan pembeli memberikan uangnya, maka tidak perlu untuk ditulis dan tidak salah atau dosa yang menjadi akibatnya. { وَأَشۡهِدُوٓاْ إِذَا تَبَايَعۡتُمۡۚ } Wa asyhidû idzâ tabâya’tum: Dan persaksikanlah apabila salah seorang menjual rumah, kebun, atau hewan ternak, hendaknya ada saksi untuk penjualan itu. { وَلَا يُضَآرَّ كَاتِبٞ وَلَا شَهِيدٞۚ } Wa Lâ yudhârra kâtibun wa lâ syahîd: Janganlah penulis akad dan saksi dipersulit, misalnya dipanggil ke tempat yang sangat jauh susah untuk dicapai, atau diminta untuk menuliskan kedustaan atau bersaksi atas kebohongan. { فُسُوقُۢ بِكُمۡۗ } Fusûqum bikum: Sesungguhnya hal itu adalah kefasikan yang ada pada dirimu, yaitu keluar dari ketaatan kepada Rabbmu dan engkau akan mendapatkan dosa serta engkau akan menanggung akibatnya pada hari kiamat. { وَٱتَّقُواْ ٱللَّهَۖ } Wattaqûllâh: Takutlah keapda Allah, maka perintah-perintahNya laksanakanlah, dan larangan-laranganNya tinggalkanlah. Sebagaimana Allah mengajarkan ini kepadamu, juga mengajarkan semua hal yang kamu butuhkan maka pujilah Allah dengan lisanmu dan bersyukurlah kepadaNya dengan amalanmu. Maka Allah akan membalasmu dengan ganjaran dan Dia Maha mengetahui segala sesuatu. Makna ayat: Pada ayat sebelumnya, Allah Ta’ala menganjurkan hamba-hambaNya untuk bersedekah, kemudian mengharamkan riba dan mengajak untuk memaafkan dan mengikhlaskan utang bagi orang yang kesulitan mengembalikannya, seakan-akan yang terlintas dalam pikiran kita bahwa harta tidak ada harganya sama sekali dalam kehidupan manusia, namun turunlah ayat ini, ayat tentang utang piutang. Untuk menjelaskan bahwa harta benda memiliki hak dan untuk mengangkat derajat harta itu sendiri sebagai penopang kebutuhan hidup manusia. Maka ayat ini menetapkan wajibnya menjaga harta benda, di antaranya dengan mencatatkan transaksi ketika terjadi utang piutang, serta mendatangkan saksi berupa orang yang tidak diragukan kredibilitasnya (‘adil, pent), yaitu dua orang laki-laki muslim yang merdeka. Ketika tidak ada satu dari dua laki-laki yang dipersyaratkan, maka dapat digantikan kedudukannya oleh dua orang perempuan. Dan Allah ta’ala menganjurkan kepada orang yang dapat menulis untuk mencatat transaksi tersebut apabila keadaan memungkinkan. Diharamkan bagi para saksi untuk menghindar ketika dipanggil untuk memberikan kesaksian, begitu juga diharamkan bagi pihak yang melakukan utang piutang, tidak mencatat utang piutangnya walaupun nilainya kecil. Allah Ta’ala berfirman; “Dan janganlah kamu jemu untuk menulisnya baik utang itu kecil ataupun besar sampai batas waktu membayarnya.” Allah Ta’ala memberikan keringanan sebagai bentuk kasih sayangNya untuk tidak menuliskan transaksi perdagangan yang pembayarannya secara tunai. Allah Ta’ala berfirman,”Kecuali bila muamalah itu perdagangan tunai yang kamu jalankan di antara kamu, maka tidak ada dosa bagimu jika kamu tidak menulisnya.” Allah Ta’ala memerintahkan untuk mengadakan persaksian pada transaksi jual beli dalam firmanNya,”Dan persaksikanlah jika kamu berjual beli.” Dan Allah melarang untuk merugikan penulis transaksi ataupun saksi dengan memaksa penulis untuk mencatat transaksi ketika ia sedang sibuk, atau merugikan saksi dengan cara memintanya bersaksi sedang ia dalam keadaan sibuk bekerja, atau memanggilnya untuk datang ke tempat yang jauh yang mana perjalanannya berat dan sulit, karena perkaranya hanya bersifat sukarela dan berbuat kebaikan, tidak ada yang lain. Hendaknya mencari penulis dan saksi yang lain jika memang keduanya tidak dapat memenuhi panggilan karena kesibukannya. Kemudian Allah Ta’ala memperingatkan agar tidak menyembunyikan persaksian, tidak adil, dan melampaui batas ketika menuliskan transaksi utang piutang, atau merugikan penulis dan saksi. Allah Ta’ala berfirman,”Dan jia hal itu kamu lakukan, maka sesungguhnya adalah suatu kefasikan pada dirimu...” kemudian Allah menekankan hal itu dengan memerintahkan untuk bertakwa dalam firmanNya,”dan bertakwalah kepada Allah” dengan melaksanakan perintahNya dan menjauhi laranganNya. Untuk menyempurnakan dan membahagiakan kalian. Sebagaimana Allah telah mengajari ilmu yang bermanfaat, Allah senantiasa terus mengajari kalian dan Dia Maha Mengetahui segala sesuatu. Inilah makna dari ayat yang mulia; “Wahai orang-orang yang beriman, apabila kamu bermuamalah (bertransaksi) tidak secara tunai (utang-piutang) untuk waktu yang ditentukan, hendaklah kamu menuliskannya.” Pelajaran dari ayat: • Kewajiban menuliskan utang piutang baik terjadi karena ada transaksi jual beli atau pinjam meminjam, sebagaimana ditetapkan oleh Ibnu jarir. Namun pendapat ini dibantah bahwa perintah ini sifatnya berupa himbauan dan hukumnya sunnah. • Menjaga nikmat Allah dengan cara mensyukurinya berdasarkan firman Allah kepada penulis transaksi,”Sebagaimana Allah telah mengajarkannya, maka hendaklah ia menulis.” Dimana Allah mengajarkannya kepada manusia bukan kepada makhluk yang lain. • Bolehnya mewakilkan saat mendiktekan jumlah utang-piutang, apabila yang bersangkutan tidak mampu melakukannya sendiri. • Kewajiban berbuat jujur dan adil dalam setiap urusan, di antaranya dalam menuliskan utang-piutang yang tertunda pembayarannya. • Kewajiban untuk mendatangkan saksi ketika mencatat transaksi utang-piutang untuk lebih menguatkan, dan tidak melupakan jumlah utang dan waktu pembayarannya. • Saksi dalam perkara harta benda tidak kurang dari dua orang lelaki yang adil dari kalangan orang muslim dan merdeka bukan yang lain. Dan dua orang wanita muslimah dapat menggantikan kedudukan persaksian satu lelaki muslim. • Memperhatikan penulisan utang piutang dan bertekad untuk menuliskannya walaupun nilai utangnya kecil dan tidak bernilai. • Keringanan untuk tidak menuliskan transaksi jual beli dimana harga dan barang dibayar secara tunai, yang biasa dilakukan oleh penual dan pembeli. • Kewajiban mendatangkan saksi pada jual beli property (tanah dan bangunan), pertanian, dan pabrik yang mana termasuk sesuatu yang berharga. • Keharaman untuk merugikan penulis transaksi dan saksinya. • Takwa kepada Allah Ta’ala merupakan jalan mendapatkan ilmu, dan memperoleh pengetahuan dengan izin Allah Ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 282: Bermuamalah ialah seperti berjual beli, salam (jual beli yang barangnya ditunda dan bayaran disegerakan), qardh (utang-piutang), atau sewa menyewa dan sebagainya. Untuk menjaga harta dan menghilangkan pertengkaran. Hendaknya yang menuliskannya adalah orang yang amanah (terpercaya) lagi teliti. Yakni mengajarkan tulisan kepadanya. Oleh karena itu, janganlah ia bakhil (pelit). Seperti orang yang mahjur (dicegah bertindak) karena borosnya. Seperti anak-anak atau orang yang sudah tua renta. Seperti orang yang tidak mampu berbicara karena bisu, tidak sanggup berbicara secara sempurna atau orang yang tidak pandai mengerti bahasa tertentu. Baik bapaknya, washiy (orang yang mendapat wasiat), qayyim (pengurus) atau penerjemah. Yakni yang muslim, baligh dan berakal serta termasuk orang-orang yang adil. Karena agama dan keadilannya. Karena akal wanita setengah daripada akal laki-laki. Karena sering dilakukan. Baik tentang jenis barang yang dihutangkan, ukuran maupun waktu membayar. Jual beli dengan barang dan pembayaran diserahkan pada saat itu juga. Hukumnya adalah sunat. Akan diterangkan nanti insya Allah. Yakni tindakan menyalahi perintah Allah Subhaanahu wa Ta'aala, dan akibatnya adalah menimpa kepada dirimu. Allah mengajarkan kepada kita sesuatu yang bermaslahat kepada kita baik di dunia maupun di akhirat. Ayat di atas adalah ayat tentang hutang. Ia merupakan ayat terpanjang dalam Al Qur'an. Di dalam ayat ini terdapat banyak hukum yang bermanfaat dan banyak muatannya. Di antaranya: 1. Bolehnya semua jenis mudayanah (utang-piutang), seperti 'aqad salam (jual beli yang barangnya ditunda dan bayaran disegerakan) dan lainnya. 2. 'Aqad salam harus memakai tempo yang ditentukan kapan pembayarannya. 3. Barang dalam akad salam harus ditentukan dan diketahui. 4. Perintah mencatat semua bentuk mudayanah; bisa menunjukkan wajib atau sunat karena penting untuk dicatat. Tanpa dicatat berpeluang besar terjadinya kekeliruan, lupa dan dapat menimbulkan pertengkaran. 5. Perintah penulis untuk membuat tulisan. 6. Penulis harus adil terhadap dirinya, karena tulisannya dijadikan pegangan. 7. Ia wajib berlaku kepada kedua belah pihak, tidak memihak kepada salah satunya karena hubungan kerabat atau persahabatan. 8. Penulis harus mengetahui penulisan dokumen dan yang harus dilakukan kedua belah pihak, serta hal yang dapat dipakai sebagai dokumen, karena tidak ada cara untuk adil kecuali dengan cara seperti itu. 9. Apabila didapatkan dokumen dengan tulisan orang yang terkenal keadilannya, maka dipakai dokumen tersebut, meskipun dia dan para saksinya sudah meninggal. 10. Hendaknya orang yang pandai menulis berbuat ihsan kepada orang lain, yaitu dengan menuliskan hutang orang lain yang butuh kepada penulisan dan tidak menolaknya, sebagaimana Allah Subhaanahu wa Ta'aala telah berbuat ihsan kepadanya dengan mengajarkan baca-tulis. 11. Perintah bagi penulis agar tidak mencatat selain yang diimla(dikte)kan kepadanya. 12. Orang yang mendiktekan adalah orang yang menanggung hak (yang berhutang). 13. Perintah untuk menjelaskan semua hak yang ditanggungnya dan tidak mengurangi. 14. Pengakuan seseorang terhadap dirinya adalah diterima, karena Allah memerintahkan orang yang menanggung hak mengimlakan kepada pencatat. Apabila pengakuan itu telah dicatat, maka berlaku pula konsekwensi dan isinya. 15. Orang yang menanggung hutang yang jelas ukuran dan sifatnya, seperti banyak atau sedikit, dibayar segera atau lambat, bahwa perkataannya yang dipegang bukan perkataan orang yang memiliki hak. Perkataannya yang dipegang jika terkait dengan jumlah ukuran dan sifatnya. 16. Diharamkan bagi orang yang menanggung hak mengurangi ukuran atau keadaannya yang baik atau waktu pembayarannya serta hal-hal lain yang mengikutinya. 17. Bagi yang tidak mampu mengimla'kan hak tersebut karena usianya yang masih kecil, kurang akal, bisu dsb. maka walinya menggantikan posisinya dalam melakukan imla' dan iqrar (pengakuan). 18. Wali harus melakukan keadilan sebagaimana orang yang menanggung hak, dan tidak mengurangi. 19. Disyaratkan wali harus seorang yang adil. 20. Adanya kewalian (kepengurusan) bagi harta. 21. Hak itu ditanggung oleh anak kecil, orang dungu, orang gila dan kurang akal, tidak ditanggung oleh wali. 22. Pengakuan anak kecil, orang dungu, orang gila dan kurang akal dsb. serta tindakan mereka (terhadap harta) tidak sah. Hal itu, karena Allah menyerahkan imla' (dikte) kepada wali mereka. 23. Sahnya tindakan wali terhadap harta orang-orang tersebut (anak kecil, orang dungu,…dst). 24. Disyari'atkan mempelajari sesuatu yang bisa dipakai sebagai dokumen dan dipercayai oleh kedua belah pihak yang berhutang, karena tujuan yang diinginkan adalah penguatan dan keadilan. Lagi pula sesuatu yang menyempurnakan perkara yang disyari'atkan, maka disyari'atkan pula. 25. Belajar menulis adalah disyari'atkan, bahkan hukumnya fardhu kifayah, karena Allah memerintahkan untuk mencatat hutang. 26. Perintah mengangkat saksi terhadap akad. Namun perintah ini adalah sunat, karena tujuannya adalah untuk menjaga hak. Hal ini kembalinya kepada maslahat mukallaf. Namun jika yang bertindak adalah wali anak yatim atau wali waqf dsb. di mana menjaga hak tersebut adalah wajib, maka mengadakan saksi untuk menjaga hak tersebut adalah wajib. 27. Persaksian terhadap harta adalah dua orang lelaki atau satu laki-laki dan dua orang wanita. Dalam As Sunnah juga dijelaskan, bahwa seorang saksi dengan sumpah dari pendakwa adalah diterima Faedah: Ulama madzhab Hanafi berpendapat bahwa persaksian kaum wanita dengan kaum pria adalah boleh baik dalam hal harta, nikah, rujuk, talak dan segala sesuatu selain hudud dan qishas, pendapat ini dikuatkan oleh Ibnul Qayyim]. 28. Persaksian anak kecil tidaklah diterima, karena lafaz di ayat tersebut adalah rajul (orang dewasa). 29. Persaksian kaum wanita saja (tanpa ada laki-lakinya) dalam hal harta dsb. adalah tidak diterima. Hal itu, karena Allah tidak menerima mereka (kaum wanita) kecuali bersama laki-laki, namun bisa saja dikatakan, bahwa Allah menjadikan dua wanita sama seperti seorang lelaki karena hikmah yang disebutkan itu (agar tidak lupa), dan hikmah itu ada jika bersama laki-laki atau hanya wanita saja (dalam jumlah yang sama seperti dua orang laki-laki), wallahu a'lam. 30. Persaksian budak yang baligh adalah diterima sebagaimana persaksian orang merdeka berdasarkan keumuman ayat \"was tasyhiduu syahiidaini mir rijaalikum\". 31. Persaksian kaum kafir baik laki-laki saja maupun wanita tidaklah diterima, karena mereka bukan termasuk golongan kita. Di samping itu, bahwa persaksian dibangun atas keadilan, sedangkan orang-orang kafir tidak adil. 32. Kelebihan laki-laki di atas wanita, sehingga satu laki-laki sama dengan dua wanita karena kuatnya hapalan laki-laki dan lemahnya hapalan kaum wanita. 33. Barang siapa yang lupa persaksiannya lalu diingatkan, kemudian ia pun ingat, maka persaksian tersebut diterima. 34. Seorang saksi apabila khawatir lupa tentang persaksiannya dalam hak-hak yang wajib, maka ia wajib menulisnya. 35. Saksi apabila dipanggil sedangkan dirinya tidak ada 'udzur, maka wajib memenuhi panggilan. 36. Barang siapa yang tidak memiliki sifat para saksi yang persaksiannya diterima, maka tidak wajib memenuhi karena tidak ada faedahnya, di samping itu ia bukan tergolong para saksi. 37. Larangan merasa bosan menuliskan hutang baik besar maupun kecil, kapan waktu dibayar dan segala yang dicakup akad itu baik syarat maupun batasan. 38. Hikmah disyari'atkan mencatat hutang dan mengadakan saksi. Persaksian yang dibarengi tulisan adalah lebih adil, lebih sempurna, dan lebih jauh dari keraguan, pertengkaran dan perselisihan. 39. Orang yang masih ragu-ragu bersaksi tidak boleh maju sampai ia yakin. 40. Adanya rukhshah (keringanan) untuk tidak dicatat apabila mu'amalah itu secara tunai, karena tidak perlu untuk ditulis. 41. Meskipun diberi rukhshah untuk tidak dicatat, namun tetap disyari'atkan mengadakan saksi. 42. Larangan memadharatkan penulis, misalnya memanggilnya saat ia sedang sibuk atau sedang kerepotan. 43. Larangan memadharatkan saksi, misalnya memanggilnya untuk bersaksi saat ia sedang sakit atau sibuk berat. 44. Larangan bagi saksi maupun pencatat memadharatkan pemilik hak, misalnya enggan bersaksi atau meminta upah yang besar. Hal ini, jika lafaz \"yudhaaaru\", fi'il majhul (k. kerja yang dihilangkan fa'il/pelakunya). 45. Namun jika, lafaz \"kaatib\" dan \"syahiid\" sebagai fa'il, maka di sana terdapat larangan bagi saksi dan penulis memadharratkan pemilik hak, baik dengan enggan bersaksi atau meminta upah besar terhadapnya. 46. Menimpakan madharrat (bahaya) termasuk kefasikan. 47. Sifat fasik, iman, nifak, permusuhan dan persahabatan terbagi-bagi dalam diri seseorang, terkadang dalam dirinya ada sifat fasik dan lainnya, demikian juga sifat iman dan kufur. Hal ini berdasarkan ayat \"Fa innahuu fusuuqun bikum\", karena Allah tidak mengatakan \"Fa antum faasiquun\" atau \"fussaaq\" (sebagai orang-orang fasik). 48. Disyaratkan saksi harus adil, berdasarkan kata-kata \"mimman tardhauna minasy syuhadaa'\". 49. Keadilan disesuaikan dengan uruf (kebiasaan yang berlaku) pada suatu tempat atau suatu masa, berdasarkan ayat \"mimman tardhauna minasy syuhada\". Oleh karena itu setiap orang yang diridhai dan memang dipandang oleh manusia, maka persaksiannya diterima. 50. Tidak diterimanya persaksian orang yang masih majhul (tidak diketahui keadaannya) sampai ada rekomendasi. Hukum-hukum di atas diringkas dari Tafsir Syaikh As Sa'diy."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 282",
    "description": "Wahai orang-orang yang beriman! apabila kamu melakukan utang piutang untuk waktu pembayaran yang ditentukan, hendaklah kamu menuliskannya untuk melindungi hak masing-masing dan untuk menghindari perselisihan. Dan hendaklah seorang yang bertugas sebagai penulis di antara kamu menuliskannya dengan benar, jujur, dan adil, sesuai ketentuan Allah dan peraturan perundangan yang berlaku dalam masyarakat. Kepada para penulis diingatkan agar janganlah penulis menolak untuk menuliskannya sebagai tanda syukur, sebagaimana Allah telah mengajarkan kepadanya kemampuan membaca dan menulis, maka hendaklah dia menuliskan sesuai dengan pengakuan dan pernyataan pihak yang berutang dan disetujui oleh pihak yang mengutangi. Dan hendaklah orang yang berutang itu mendiktekan apa yang telah disepakati untuk ditulis, dan hendaklah dia bertakwa kepada Allah, tuhan pemelihara-Nya, dan janganlah dia mengurangi sedikit pun daripada utangnya, baik yang berkaitan dengan kadar utang, waktu, cara pembayaran, dan lain-lain yang dicakup oleh kesepakatan. Jika yang berutang itu orang yang kurang akalnya, tidak pandai mengurus harta karena suatu dan lain sebab, atau lemah keadaannya, seperti sakit atau sangat tua, atau tidak mampu mendiktekan sendiri karena bisu atau tidak mengetahui bahasa yang digunakan, atau boleh jadi malu, maka hendaklah walinya mendiktekannya dengan benar dan jujur. Dan persaksikanlah dengan dua orang saksi laki-laki di antara kamu. Jika tidak ada saksi dua orang laki-laki, atau kalau saksi itu bukan dua orang laki-laki, maka boleh seorang laki-laki dan dua orang perempuan di antara orang-orang yang kamu sukai dari para saksi yang ada, yakni yang disepakati oleh yang melakukan transaksi. Hal tersebut agar jika yang seorang dari perempuan itu lupa, maka perempuan yang seorang lagi yang menjadi saksi bersamanya mengingatkannya. Dan sebagaimana Allah berpesan kepada para penulis, kepada para saksi pun Allah berpesan. Janganlah saksi-saksi itu menolak memberi keterangan apabila dipanggil untuk memberi kesaksian, karena penolakannya itu dapat merugikan orang lain. Dan janganlah kamu bosan menuliskannya, baik utang itu kecil maupun besar, sampai yakni tiba batas waktu membayarnya. Yang demikian itu, yakni penulisan utang piutang dan persaksian yang dibicarakan itu, lebih adil di sisi Allah, yakni dalam pengetahuan-Nya dan dalam kenyataan hidup, dan lebih dapat menguatkan kesaksian, yakni lebih membantu penegakan persaksian, dan lebih mendekatkan kamu kepada ketidakraguan terkait jenis utang, besaran dan waktunya. Petunjuk-petunjuk di atas adalah jika muamalah dilakukan dalam bentuk utang piutang, tetapi jika hal itu merupakan perdagangan berupa jual beli secara tunai yang kamu jalankan di antara kamu, maka tidak ada dosa bagi kamu jika kamu tidak menuliskannya, sebab memang pencatatan jual beli tidak terlalu penting dibanding transaksi utang-piutang. Dan dianjurkan kepadamu ambillah saksi apabila kamu berjual beli untuk menghindari perselisihan, dan janganlah penulis dipersulit dan begitu juga saksi oleh para pihak untuk memberikan keterangan dan kesaksian jika diperlukan, begitu juga sebaliknya para pencatat dan saksi tidak boleh merugikan para pihak. Jika kamu, wahai para penulis dan saksi serta para pihak, lakukan yang demikian, maka sungguh, hal itu suatu kefasikan pada kamu. Dan bertakwalah kepada Allah dan rasakanlah keagungannya dalam setiap perintah dan larangan, Allah memberikan pengajaran kepadamu tentang hak dan kewajiban, dan Allah maha mengetahui segala sesuatu. Tuntunan pada ayat yang lalu mudah dilaksanakan jika seseorang tidak sedang dalam perjalanan. Jika kamu dalam perjalanan dan melakukan transaksi keuangan tidak secara tunai, sedang kamu tidak mendapatkan seorang penulis yang dapat menulis utang piutang sebagaimana mestinya, maka hendaklah ada barang jaminan yang dipegang oleh yang berpiutang atau meminjamkan. Tetapi menyimpan barang sebagai jaminan atau menggadaikannya tidak harus dilakukan jika sebagian kamu mempercayai sebagian yang lain. Maka hendaklah yang dipercayai itu menunaikan amanatnya, utang atau apa pun yang dia terima, dan hendaklah dia yang menerima amanat tersebut bertakwa kepada Allah, tuhan pemelihara-Nya. Dan wahai para saksi, janganlah kamu menyembunyikan kesaksian, yakni jangan mengurangi, melebihkan, atau tidak menyampaikan sama sekali, baik yang diketahui oleh pemilik hak maupun yang tidak diketahuinya, karena barang siapa menyembunyikannya, sungguh, hatinya kotor, karena bergelimang dosa. Allah maha mengetahui apa yang kamu kerjakan, sekecil apa pun itu, yang nyata maupun yang tersembunyi, yang dilakukan oleh anggota badan maupun hati."
  }
]