[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kalian tengah bepergian jauh,sedang kalian tidak menjumpai seorang pencatat bagi kalian, maka serahkanlah kepada pemilik hak (piutang) sesuatu yang menjadi jaminan di sisinya bagi haknya sampai orang yang berhutang mengembalikan tanggungan hutangnya. jika sebagian dari kalian saling percaya dengan yang lain,maka tidak mengapa untuk mengabaikan pencatatan (transaksi hutang), persaksian dan jaminan barang, dan kemudian hutang tetap menjadi amanat (tanggungan) pihak penghutang yang wajib membayarkannya, dia harus merasa diawasi oleh Allah, tidak menghiananti partnernya itu. Apabila penghutang mengingkari kewajiban hutangnya,sedang disitu ada orang yang dahulu hadir dan menyaksikan,maka kewajiban orang tersebut untuk mengajukan persaksiannya. dan barangsiapa yang menyembunyikan persaksiannya, maka orang itu orang yang berhati penghianat lagi jahat. Dan Allah maha mengetahui rahasia-rahasia hati, ilmuNYA meliputi seluruh urusan kalian.dan akan memberikan balasan kepada kalian sesuai dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "283. Apabila kalian bepergian jauh dan tidak menemukan orang yang bisa mencatat dokumen utang-piutang untuk kalian, maka orang yang bertanggung jawab atas utang itu cukup menyerahkan gadai (jaminan) yang diterima oleh si pemberi hutang, sebagai jaminan atas haknya sampai si penanggung jawab hutang melunasi hutangnya. Jika sebagian dari kalian percaya kepada yang lain maka tidak harus ada catatan, saksi atau jaminan. Dan ketika itu utang-piutang menjadi amanah yang harus dipikul dan dibayarkan oleh si penerima utang kepada si pemberi hutang. Dan dia harus takut kepada Allah dalam memikul amanah ini. Dia tidak boleh mengingkarinya sedikitpun. Jika dia mengingkarinya maka orang yang menyaksikan transaksi tersebut harus menyampaikan kesaksiannya dan tidak boleh menyembunyikannya. Barangsiapa menyembunyikan kesaksiannya maka sesungguhnya hatinya adalah hati yang jahat. Dan Allah Maha Mengetahui apa yang kalian perbuat, tidak ada sesuatupun yang luput dari pengetahuan-Nya, dan Dia akan memberi kalian balasan yang setimpal dengan amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "283. Hai orang-orang yang berhutang piutang, jika kalian sedang bersafar dan tidak menemui orang yang dapat menulis akad hutang piutang, maka hendaklah orang yang berhutang memberi barang jaminan kepada orang yang memberi hutang, agar orang yang berhutang mau membayar hitangnya. Dan jika kalian saling percaya maka tidak mengapa untuk tidak menulis hutang atau memberi barang jaminan. Dan orang yang hutang wajib membayar hutangnya, dan hendaklah ia merasa diawasi Allah dan tidak mengkhianati amanah. Dan bagi para saksi janganlah kalian menyembunyikan persaksian, barangsiapa yang menyembunyikannya maka baginya dosa dan hukuman. Allah Maha Mengetahui segala yang kalian lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "283. وَإِن كُنتُمْ عَلَىٰ سَفَرٍ (Jika kamu dalam perjalanan (dan bermu’amalah tidak secara tunai) ) Dalam ayat ini tertulis bagi yang dalam keadaan safar namun juga masuk dalam hukumnya semua halangan yang mengandung halangan yang ada pada safar yang berupa kesulitan untuk melakukan penulisan dan persaksian. وَلَمْ تَجِدُوا۟ كَاتِبًا( sedang kamu tidak memperoleh seorang penulis) Yakni dalam safar kalian. فَرِهٰنٌ مَّقْبُوضَةٌ ۖ ( maka hendaklah ada barang tanggungan yang dipegang (oleh yang berpiutang)) Jumhur ulama berpendapat bahwa hukum barang tanggungan (jaminan) yang dipegang ini diperhitungkan sebagimana yang dijelaskan al-Qur’an sehingga tidak sah barang jaminan ini apabila belum dipegang oleh pihak kedua. Adapun Imam Malik berpendapat bahwa pemberian jaminan itu sah dengan adanya ijab dan qabul meski barang tersebut tidak atau belum diserahkan kepada pihak kedua. فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا ( Akan tetapi jika sebagian kamu mempercayai sebagian yang lain) Yakni rasa saling percaya ini mencukupi sebagai ganti dari barang jaminan. فَلْيُؤَدِّ الَّذِى اؤْتُمِنَ ( maka hendaklah yang dipercayai itu) Yakni orang yang berhutang. أَمٰنَتَهُۥ (menunaikan amanatnya) Yakni hutang yang menjadi tanggungannya. وَلْيَتَّقِ اللهَ رَبَّهُۥ ۗ ( dan hendaklah ia bertakwa kepada Allah Tuhannya) Yakni dengan tidak mengingkari kewajibannya dalam hutang sedikitpun. وَمَن يَكْتُمْهَا فَإِنَّهُۥٓ ءَاثِمٌ قَلْبُهُۥ ۗ ( Dan barangsiapa yang menyembunyikannya, maka sesungguhnya ia adalah orang yang berdosa hatinya) Yakni orang yang rusak yang tidak peduli akan terperosok dalam kemaksiatan, karena dengan menyembunyikan kesaksian dapat menghilangkan hak dari pemiliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "283. Wahai orang-orang yang melakukan akad hutang, jika kalian dalam keadaan bepergian, dalam perjalanan itu terdapat udzur untuk bertemu, dan kalian tidak mendapati penulis untuk akad muamalah tersebut maka sebaiknya peminjam memberikan jaminan yang dipegang oleh pemberi pinjaman. Ar-Rihan adalah bentuk jama’ dari rahnun. Al-Qabdhu adalah syarat untuk menyempurnakan jaminan tersebut, menurut jumhur ulama’ selain mazhab maliki yang cukup dengan adanya ijab qabul untuk mengabsahkan jaminan tersebut. Dan jika kalian sudah saling percaya sehingga pemberi pinjaman tidak mengambil jaminan dari peminjam, maka peminjam yang dipercaya itu sebaiknya membayar hutangnya kepada pemberi pinjaman, tidak mengingkari kepercayaan tersebut, dan mengingkari hak-hak dalam hutang piutang sedikitpun. Wahai para saksi, janganlah kalian menyembunyikan kesaksian kalian ketika diminta untuk memberikan kesaksian itu. Barangsiapa menyembunyikan kesaksiannya, maka sesungguhnya dia itu hatinya tidak bermoral, dan mengerjakan kemaksiatan, sehingga dia harus dihukum atas hal tersebut karena telah mempersempit hak-hak pemberi hutang. Dan tidak ada satupun amal kalian yang luput dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian dalam perjalanan, dan tidak mendapatkan seorang pencatat, hendaklah ada barang jaminan yang dipegang} orang yang memberi pinjaman meminta barang jaminan yang bisa dia simpan untuk menjamin hutangnya {Jika sebagian kalian mempercayai yang lain} salah satu orang yang bertransaksi mempercayai yang lain dan tidak memerlukan bahan jaminan {hendaklah yang dipercayai itu menunaikan amanatnya} maka hendaklah orang yang diberi pinjaman itu menunaikan hutang yang ada pada dirinya {dan hendaklah dia bertakwa kepada Allah, Tuhannya. Janganlah kalian menyembunyikan kesaksian karena siapa saja yang menyembunyikannya, sesungguhnya hatinya berdosa} hatinya durhaka {Allah Maha Mengetahui apa yang kamu kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "283. faidah-faidah dari ayat ini : 1. firman Allah ” Maka hendaklah ada barang tanggungan yang di pegang oleh yang berpiutang,” dapat di jadikan dalil bahwasanya bila terjadi perselisihan antara pihak penggadaian dengan pihak yang memiliki piutang tentang jumlah hutang yang diambil dengan barang jaminan,maka yang diterima perkataanya adalah orang yang memiliki piutang itu yaitu pemilik hak, karena Allah menjadikan barang jaminan sebagai bukti yang kuat, karena tidak di terima perkataanya dalam hal itu, niscaya bukti itu tidak aka nada,karena tidak ada pencatatan dan saksi-saksi. 2. Bahwasanya boleh bermuamalah tanpa adanya pencatatan dokumentasi maupun saksi-saksi atas dasar firman Allah,”Akan tetapi jika sebagian kamu mempercayai dengan sabagian yang lain, maka hendaklah yang di percayai itu menunaikan amanatnya (hutangnya).’ Namun dalam kondisi yang seperti ini di butuhkan sipat ketakwaan dan takut kepada Allah. Karena jika tidak demikian, maka pemilik hak dalam posisi dapat di rugikan dalam haknya. Karena itu,dalam kondisi seperti ini Allah memerintahkan orang yang menanggung hak orang lain untuk bertakwa kepada Allah dan menunaikan amanat yang di tanggungnya. 3. Bahwasanya orang yang mempercayai orang yang bermuamalah dengannya, maka sesungguhnya ia telah melakukan kebaikan yang besar terhadapnya dan ia ridha terhadap agama dan amanahnya, sehingga orang yang menanggung hak orang lain memiliki kewajiban yang semakin kuat untuk menunaikan amanah itu dari dua sisi: pertama, penunaian hak Allah dan melaksanakan perintah-perintahNya, dan kedua, pemenuhan hak temanya yang telah meridhai amanahnya dan mempercayai dirinya. 4. Haram menyembunyikan persaksian yang bermuamalah dan bahwa orang yang melakukan hal itu hatinya benar-benar telah berdosa yang merupakan meruoakan pengendali seluruh anggota tubuh. hal itu di karenakan menyembunyikan hal tersebut adalah seperti persakasian yang bathil dan yang dusta, yang mengakibatkan hilangnya hak-hak, rusaknya muamalah, dan dosa bagi orang-orang yang melakukan hal tersebut dan orang yang menanggung hak orang lain tersebut. Adapun di batasinya penggadaian dengan berpergian musafir padahal hal itu boleh saja di lakukan pada mukim maupun berpergian adalah karena kebutuhan akan hal tersebut dan karena tidak juru tulis maupun saksi, Dan Allah menutup ayat ini dengan menyebut bahwa Dia Maha Mengetahui atas segala apa yang di perbuat oleh ahmbanya, sebagai dorongan kepada mereka untuk bermuamalah yang baik dan peringatan dari muamalah yang buruk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { سَفَرٖ } Safar: Bepergian keluar dari rumah dan negerinya sejauh jarak empat yard atau lebih. { وَلَمۡ تَجِدُواْ كَاتِبٗا } Wa lam tajidû kâtiban: Tidak menemukan orang yang mau menuliskan untuk kalian, atau tidak menemukan alat tulis seperti tinta dan pulpen. { فَرِهَٰنٞ مَّقۡبُوضَةٞۖ } Farihânun maqbudhah: Sebagai ganti dari mencatat transaksi utang piutang itu, pengutang memberikan barang gadai sebagai jaminan kepada pemberi utang. { فَإِنۡ أَمِنَ بَعۡضُكُم بَعۡضٗا } Fa in amina ba’dhuhum ba’dha: Apabila mereka saling mempercayai, maka tidak perlu mengambil barang gadai sebagai jaminannya. { فَلۡيُؤَدِّ ٱلَّذِي ٱؤۡتُمِنَ أَمَٰنَتَهُۥ } Falyuaddilladzîna’tumina Amântahû: Hendaknya orang yang dipercaya itu melaksanakan amanahnya, dengan membayarkan utang yang dipercayakan kepadanya dimana utang itu tidak tercatat dan pemberi utang tidak mengambil barang gadai sebagai jaminan atas uangnya. { ءَاثِمٞ قَلۡبُهُۥ } Âtsimun qolbuhû: Berdosa hatinya, karena menyembunyikan rahasia adalah pekerjaan hati, maka dikatakan yang berdosa adalah hatinya. Makna ayat: Pada ayat sebelumnya, Allah Ta’ala memerintahkan untuk mengadakan persaksian dan pencatatan pada transaksi jual beli, salam, dan utang piutang. Kemudian pada ayat ini dijelaskan ketika tidak didapati alat tulis atau tidak ada penulisnya pada saat bepergian (safar), Allah memerintahkan untuk mengganti pencatatan itu dengan barang gadai, yaitu pengutang menyerahkan barang gadai kepada pemberi utang sebagai jaminan karena tidak adanya pencatatan atas utang tersebut. Ini dilakukan ketika adanya keraguan tentang amanah orang yang berutang dan takut apabila mengingkari utangnya. Adapun ketika pemberi utang dan orang yang berutang sama-sama saling percaya, tidak mengapa untuk tidak menyerahkan jaminan. Allah Ta’ala berfirman; “Dan jika kamu dalam bepergian dan tidak mendapatkan penulis, maka dengan cara gadai yang dipegang.” Kata Rihân merupkan bentuk jamak dari rahnun. Kemudian Allah Ta’ala berfirman; “Jika percaya satu dengan yang lain, dan tidak mengambil gadai. Maka hendaklah orang yang dipercaya itu melaksanakan amanatnya dan hendaklah takut kepada Allah.” Takut untuk mengingkari utangnya. kemudian Allah Ta’ala melarang dengan keras para saksi untuk menyembunyikan persaksiannya dalam firmanNya,”Dan janganlah kalian merahasiakan kesaksian kamu...” dan menerangkan betapa besarnya dosa menyembunyikan persaksian itu dalam firmanNya,”Barangsiapa merahasiakannya maka berdosalah hatinya..” Ketahuilah bahwa Allah Maha Mengetahui apa yang dikerjakan oleh hamba-hambaNya dan membalas mereka sesuai dengan perbuatannya. Ini merupakan ancaman dan peringatan dari Allah Ta’ala bagi orang-orang yang menyembunyikan persaksian dan orang-orang yang berkata dusta dalam persaksiannya. Inilah kandungan ayat (282) Pelajaran dari ayat: • Bolehnya mengambil jaminan barang gadai baik ketika safar maupun tidak untuk memperkuat akad transaksi. • Bolehnya tidak mengambil jaminan gadai apabila kedua belah pihak merasa aman akan pembayaran utangnya dan tidak merasa takut pengutang akan mengingkari janjinya. • Keharaman menyembunyikan persaksian atau bersaksi palsu karena hal itu merupakan dosa besar sebagaimana disebutkan dalam kitab shahih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Baqarah ayat 283: Barang tanggungan (rahn/borg) itu diadakan ketika satu sama lain tidak saling mempercayai sampai orang yang berhutang membayar hutangnya. Dalam As Sunnah dibolehkan mengadakan rahn ketika tidak safar dan adanya orang yang siap menulis. Jika terjadi perselisihan tentang barang yang digadaikan, misalnya tentang jumlah atau ukurannya, maka perkataan yang dipegang adalah perkataan orang yang memegang rahn (yaitu orang yang berpiutang). Tidak mengapa tanpa barang jaminan. Sehingga dia tidak mengkhianati kawannya. Jika orang yang berhutang mengingkari hutangnya, dan di sana terdapat orang yang hadir dan menyaksikan, maka orang yang ikut hadir itu wajib menunjukkan persaksiannya. Ayat 282 dan 283 menunjukkan bahwa manusia jika mau memakai petunjuk Allah, tentu dunia dan agama mereka menjadi baik, karena petunjuk-Nya mengandung keadilan dan maslahat, menjaga hak dan menghilangkan pertengkaran serta menertibkan jalan kehidupan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 283",
    "description": "Tuntunan pada ayat yang lalu mudah dilaksanakan jika seseorang tidak sedang dalam perjalanan. Jika kamu dalam perjalanan dan melakukan transaksi keuangan tidak secara tunai, sedang kamu tidak mendapatkan seorang penulis yang dapat menulis utang piutang sebagaimana mestinya, maka hendaklah ada barang jaminan yang dipegang oleh yang berpiutang atau meminjamkan. Tetapi menyimpan barang sebagai jaminan atau menggadaikannya tidak harus dilakukan jika sebagian kamu mempercayai sebagian yang lain. Maka hendaklah yang dipercayai itu menunaikan amanatnya, utang atau apa pun yang dia terima, dan hendaklah dia yang menerima amanat tersebut bertakwa kepada Allah, tuhan pemelihara-Nya. Dan wahai para saksi, janganlah kamu menyembunyikan kesaksian, yakni jangan mengurangi, melebihkan, atau tidak menyampaikan sama sekali, baik yang diketahui oleh pemilik hak maupun yang tidak diketahuinya, karena barang siapa menyembunyikannya, sungguh, hatinya kotor, karena bergelimang dosa. Allah maha mengetahui apa yang kamu kerjakan, sekecil apa pun itu, yang nyata maupun yang tersembunyi, yang dilakukan oleh anggota badan maupun hati. Allah mengetahui itu semua dan akan meminta pertanggungjawaban manusia, sebab kekuasaan-Nya meliputi seluruh jagat raya. Milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan dialah yang mengatur dan mengelola semua itu. Jika kamu nyatakan apa yang ada di dalam hatimu atau kamu sembunyikan, niscaya Allah memperhitungkannya tentang perbuatan itu bagimu, dan akan memberikan balasan yang setimpal. Dia mengampuni siapa yang dia kehendaki sesuai dengan sikap dan kehendak hamba-Nya, yaitu yang menyesali perbuatannya, bertekad untuk tidak mengulangi dan memohon ampunan, atau dia akan mengampuni walau tanpa permohonan ampunan dan mengazab siapa yang dia kehendaki sesuai sikap hamba-Nya yang selalu melakukan dosa dan maksiat. Pilihan berada di tangan manusia. Siapa yang mau diampuni, maka lakukanlah apa yang ditetapkan Allah guna meraih ampun-an-Nya, dan siapa yang hendak berada dalam siksa, maka silakan langgar ketentuan-Nya. Allah mahakuasa atas segala sesuatu."
  }
]