[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Rasulullah sholallohu alaihi wasallam membenarkan dan meyakini(kebenaran) wahyu yang di wahyukan kepadanya dari tuhannya.dan kaum mukminin pun demikian juga,mereka meyakini kebenaran nya dan mengamalkan isi al-qur’an al-azhim. Masing-masing dari mereka mengimani Allah sebagai tuhan dan sembahan yang memiliki sifat sifat keagungan dan kesempurnaan, dan mengimani sesungguhnya Allah memiliki malaikat-malaikat yang mulia, Dia menurunkan kitab kitab suci dan mengutus rasul-rasul kepada makhlukNYA. kami (kaum mukminim), tidak mengimani sebagian dari mereka saja, dan mengingkari sebagian yang lain. Akan tetapi kami mengimani mereka semuanya. Rasul dan kaum mukminin mengatakan, ”kami mendengar wahai tuhan kami,apa yang engkau wahyukan, dan kami taat dalam setiap ketetapan. kami berharap Engkau sudi mengampuni dosa-dosa kami dengan kemurahanMU. Engkaulah dzat yang mengurus kami dengan karunia yang Engkau limpahkan kepada kami. dan hanya kepadaMU lah tempat kembali dan tempat kesudahan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "285. Rasulullah Muhammad -ṣallallāhu 'alaihi wa sallam- beriman kepada semua yang diturunkan kepadanya dari Tuhannya. Begitu juga dengan orang-orang mukmin. Mereka semua beriman kepada Allah, beriman kepada semua malaikat-Nya, semua kitab suci yang diturunkana kepada para Nabi, dan semua Rasul yang diutus-Nya. Mereka beriman kepada para Rasul itu seraya mengatakan, “Kami tidak membeda-bedakan antara Rasul yang satu dengan Rasul yang lain.” Dan mereka mengatakan, “Kami siap mendengarkan apa yang Engkau perintahkan kepada kami dan apa yang Engkau larang untuk kami. Kami taat kepada-Mu dengan melaksanakan apa yang Engkau perintahkan dan menjauhi apa yang Engkau larang. Dan kami memohon kepada-Mu, ya Rabb kami, agar Engkau berkenan mengampuni kami, karena sesungguhnya hanyalah Engkau satu-satunya tempat kami kembali dalam segala urusan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "285. Rasulullah mengimani apa yang diwahyukan kepadanya dari Tuhannya, dan orang-orang berimanpun mengimaninya; mereka semua beriman bahwa Allah adalah Tuhan dan sesembahan yang berhak disembah, dan beriman kepada semua malaikat, kitab-kitab yang Allah turunkan, dan semua rasul yang Dia utus tanpa membeda-bedakan. Dan rasul dan orang-orang beriman berkata: “Ya Tuhan kami,kami mendengar apa yang Engkau perintahkan, dan kami akan mentaatinya, kami mengharap ampunan atas dosa-dosa kami, Engkaulah pelindung kami, dan kepada-Mu kami akan kembali.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "285. ءَامَنَ الرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ (Rasul telah beriman kepada Al Quran yang diturunkan kepadanya dari Tuhannya ) Setelah Allah menyebutkan banyak hukum-hukum dalam surat ini kemudian Allah menyebutkan kebesaran diri-Nya dengan firmannya (لله ما في السماوات وما في الأرض) kemudian menyebutkan pembenaran Rasulullah kemudian menyebutkan pembenaran orang-orang mukmin terhadap itu semuanya lewat firman-Nya: ءَامَنَ الرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ Yakni Rasullullah membenarkan seluruh hal-hal yang telah disebutkan ini, begitupula dengan kaum mukminin yang membenarkan Allah (dan juga seterusnya). وَمَلٰٓئِكَتِهِۦ (malaikat-malaikat-Nya ) Yakni dari sisi wujud keberadaan mereka, dan bahwa mereka adalah hamba-hamba-Nya yang mulia dan menjadi perantara antara Dia dan nabi-nabi-Nya dalam penyampaian apa yang berasal dari-Nya. وَكُتُبِهِۦ (kitab-kitab-Nya) Karena kitab-kitab tersebut mengandung syariat-syariat yang denganya para hamba beribadah. وَرُسُلِهِۦ ( dan rasul-rasul-Nya) Karena mereka adalah penyampai kepada hamba-hamba-Nya apa yang diturunkan kepada mereka. لَا نُفَرِّقُ (Kami tidak membeda-bedakan ) Yakni mereka berkata: kami tidak membeda-bedakan. بَيْنَ أَحَدٍ مِّن رُّسُلِهِۦ ۚ (antara seseorangpun dari rasul-rasul-Nya ) Yakni dengan yang lain. Akan tepati kami beriman kepada mereka semua. وَقَالُوا۟ (dan mereka mengatakan ) Yakni Rasulullah dan orang-orang beriman mengatakan. سَمِعْنَا وَأَطَعْنَا ۖ (Kami dengar dan kami taat ) Yakni kami mengetahui dengan pendengaran kami, dan kami telah memahaminya dan mentaatinya, dan kami jawab seruan-Mu ya Tuhan kami. غُفْرَانَكَ (Ampunilah kami ) Yakni ampunilah kami wahai tuhan kami."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Az-zujaj berkata : setelah Allah menyebutkan dalam surah al-baqarah begitu banyak hukum-hukum dan kisah-kisah penuh hikmah, Dia جل جلاله menutupnya dengan firman-Nya : { آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ } \"Rasul telah beriman kepada Al Quran yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman\" sebagai pengagungan bagi Nabi-nabiNya dan para pengikut mereka, dan sebagai penegasan untuk semua yang telah disebutkan sebelumnya, bahwasanya mereka telah beriman kepada semua yang dikabarkan oleh Allah dan mengamalkan syariat-syari'atNya. 2 ). { آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ } \"Rasul telah beriman kepada Al Quran yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman\" kemudian Allah mengatakan { وَقَالُوا سَمِعْنَا وَأَطَعْنَا } \"dan mereka mengatakan: \"Kami dengar dan kami taat\", ayat ini menjelaskan bahwa keimanan yang benar mengantarkan pemiliknya kepada kewajiban beramal, maka bukanlah sekedar pengakuan hati, dan bayangan fikiran. 3 ). { وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ } Ummat ini adalah ummat yang mengikuti perintah, maka ketika Alllah datangkan kepadanya akal sehat yang menunjukkan kepada kebenaran Rasul-Nya dan kebenaran kitab-Nya, maka sesungguhnya ummat ini tidak akan membantah dalil-dalil yang didatangkan kepada mereka dengan akal yang mereka punya, justru mereka akan mendengarnya dan taat kepadanya. 4 ). { غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ } Ketika mereka mengetahui bahwa mereka belum mencapai tingkatan keimanan yang sebenarnya dengan ketaatan dan kepatuhan mereka, mereka kemudian memohon kepada tuhannya ampunan yang merupakan itulah tujuan utama dari kebahagiaan dan akhir dari kesempurnaanya, karena sesugguhnya tujuan seorang mukmin adalah ampunan dari Allah ta'ala. 5 ). Diantara kesesuaian dan hubungan awal surah al-baqarah dan kahirannya adalah pujian Allah kepada orang-orang bertaqwa yang beriman kepada yang ghaib, kemudian sifat-sifatnya dijelaskan lebih luas pada akhir surah ini yaitu, bahwasanya mereka adalah para Rasul dan pengikut-pengikutnya yang beriman kepada yang ghaib seperti yang ada pada rukun-rukun iman, serta mendengarkan dan taat kepada syari'at yang telah disampaikan. Di awal surah juga disebutkan bahwa mereka beriman kepada hari akhir, kemudian disebutkan di akhir surah mereka berkata : { وَإِلَيْكَ الْمَصِي } \"dan kepada Engkaulah tempat kembali\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "285. Nabi SAW beriman kepada ayat-ayat Al-Qur’an yang diturunkan kepadanya, begitu juga orang-orang mukmin. Masing-masing mereka beriman hanya kepada Allah, malaikat, kitab-kitab yang telah diturunkan, dan para rasul yang menyampaikan risalah yang diturunkan kepada mereka. Mereka berkata: “Kami orang-orang mukmin tidak membedakan-bedakan para rasul antara satu dengan yang lainnya, namun kami mengimani mereka semua” Nabi dan orang-orang mukmin berkata: “Kami memperhatikan dan menaati perintah, maka ampunilah kami wahai Tuhan, Hanya kepadamulah tempat kembali dan berlindung ketika hari kebangkitan” Ayat ini turun setelah ayat {Lillahi maa fissamawati wa ma fil ardhi …} ketika para sahabat beranggapan bahwa mereka akan disalahkan hanya karena niat. Lalu rasulullah SAW bersabda kepada mereka: “Apakah kalian akan mengucapkan perkataan sebagaimana ahli kitab “Kami mendengar dan kami mengingkaringa”? (Jangan!) Tapi katakanlah “Sami’naa wa Atha’na …””"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Rasul beriman kepada apa yang diturunkan kepadanya dari Tuhannya, begitu juga orang-orang mukmin. Masing-masing beriman kepada Allah, malaikat-malaikatNya, kitab kitabNya, dan rasul-rasulNya. “Kami tidak membeda-bedakan seorang pun dari rasul-rasulNya.” Mereka juga berkata, “Kami mendengar dan kami taat. Ampunilah kami} Kami memohon ampunanMu {wahai Tuhan kami. Hanya kepadaMu tempat kembali.”} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "285-286. Terdapat riwayat shahih dari Nabi bahwa siapa yang membaca dua ayat ini pada malam hari, maka itu cukuplah baginya, yakni dari segala kejahatan (keburukan). Hal itu karena kedua ayat ini meliputi ayat yang agung. Allah telah memerintahkan kepada manusia dalam awal ayat ini untuk beriman dengan segala pokok-pokok dalam firmanya, ”Katakanlah (hai orang-orang Mukmin), Kami berikan kepada Allah apa yang dia turunkan kepada kami.” Allah mengabarkan dalam ayat ini bahwasanya Rasululoh dan orang-orang yang bersamanya dari orang Mukmin telah beriman kepada pokok-pokok yang agung ini; kepada seluruh Rasul, dan seluruh kitab-kitab, dan mereka tidak melakukan perbuatan seperti orang-orang yang beriman dengan sebagian dan mengingkari sebagian lainya, seperti kondosi orang-orang yang menyimpang dari pemeluk-pemeluk agama lain yang tersesat. dirangkaiannya secara urut kaum Mukminin dengan Rasululoh dan disebutnya mereka sumua dengan satu kabar saja, merupakan kemuliaan yang besar bagi kaum Mukminin. Ayat ini juga menunjukan bahwa Rasululloh sama dengan umatnya dalam hal sebagai sasaran perintah syar’i, pelaksanaan beliau yang sempurna dan bahwasanya beliau itu lebih tinggi dari kaum Mukminin bahkan lebih tinggi dari seluruh Rasul dalam pelaksanaan keimanan dan hak-haknya. Dan firmanNya, ”Dan mereka megatakan, kami dengar dan taat,” Konsisiten kaum Mukminin ini adalah umum terhadap semua yang dibawa oleh nabi dari al-qur’an dan as-sunah. Dan bahwasanya mereka mendengar beliau dengan maksud penerimaan, ketundukan dan kepatuhan. Kandungan dari itu adalah penghambaan mereka terhadap Allah dalam rangka memohon pertolongan untuk melaksanakanya dan bahwasanya Allah mengampuni mereka atas kelalaian mereka dari kewajiban-kewajiban dan apa yang mereka kerjakan dari hal-hal yang di haramkan. Mereka juga menghambakan diri kepada Allah dalam doa-doa yang penuh manfaat tersebut, dan Allah telah memenuhi doa mereka melalui lisan Nabi mereka yang bersabda (dalam sebuah hadis Qudsi) “Sungguh aku telah melakukanya,” Doa-doa ini akan di terima dari seluruh kaum Mukminin secara pasti, dan juga dari pribadi-pribadi mereka tersebut. hal itu bahwa Allah menggugurkan siksaan mereka dari kesalahn dan kelupaan, dan bahwa Allah memudahkan syariat-syariatNya dengan sangat mudah, dimana Allah tidak memberatkan mereka dengan kesulitan, beban-beban, dan tambahan-tambahan seperti orang-orang sebelum mereka. Allah tidak memberatkan mereka melebihi kemampuan mereka. Allah juga telah mengampuni mereka, merahmati, dan membalas mereka dari orang-orang kafir. Maka kita memohon kepada Allah dengan nama-namaNya dan sipat-sipatNya dan dengan segala yang dikarunikannya kepada kita berupa sikap konsisten kita kepada agamanya agar dia merealisaikan hal itu buat kita agar Allah membuktikan kepada kita apa yang telah mereka janjikan kepada kita malewati lisan NabiNya, dan agar dia memperbaiki kaum Mukminin. Dalam hal ini dapat di ambil kaidah ”kemudahan dan tidak adanya rasa sungkan dalam seluruh perkara agama,” dan kaidah ”ampunan dari kesalahan dan kelupaan dalam perkara ibadah dan terhadap hak-hak Allah dan demikian juga terhadap hak-hak mahkluk dari segi menggugurkan dosa dan tidak mendapat celaan.” Adapun wajibnya menjamin kerusakan-kerusakan yang terjadi atas dasar ketidaksengajaan dan kelalaian terhadap jiwa dan harta, Maka sesungguhnya hal itu akibatkan tindakan pengrusakan tanpa hak, yang disengaja maupun tidak, atau di kerenakan kelalaian. Selesai tafsir surat Al-baqarah, segala puji dan sanjungan hanya bagi Allah, dan shlawat dan salam semoga tercurahkan kepada Nabi Muhammmad."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { ءَامَنَ }. Âmana: Membenarkan kabar berita itu dengan sungguh-sungguh dan tidak ada keragu-raguan sedikitpun. { ٱلرَّسُولُ } Ar-Rasul: Nabi kita Muhammad ﷺ { كُلٌّ } Kullun: Seluruh rasul dan orang-orang beriman { لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦ } Lâ nufarriqu baina ahadim mirrusulihi: Kami mengimani mereka semuanya dan tidak menjadi seperti orang Yahudi dan Nasrani, mereka beriman dengan sebagian rasul dan kufur kepada sebagian lainnya. { سَمِعۡنَا } Sami’nâ: Mendengar dengan memahami, menerima seruan itu dan menaatinya. { ٱلۡمَصِيرُ } Al-Mashir: Tempat kembali. “Kami kembali kepada Engkau wahai Tuhan kami maka ampunilah kami. Makna ayat: Tatkala turun ayat (284) yang di antara potongan ayatnya berbunyi,”Dan jika kamu menampakkan apa yang ada di dalam hatimu atau kamu menyembunyikannya, niscaya Allah akan membuat perhitungan dengan kamu tentang perbuatanmu itu.” Maka ayat itu membuat hati kaum mukmin menjadi kacau balau, dan mereka mengatakan,”Siapakah yang selamat di antara kami jika apa yang kami sembunyikan dalam hati berupa niat, was was, perkataan dalam hati akan dibalas oleh Allah.” Maka Rasulullah ﷺ menyuruh mereka agar ridho dengan hukum Allah Ta’ala dan menerimanya seraya bersabda kepada mereka,”Katakanlah kami mendengar dan kami taat, jangan seperti orang-orang Yahudi yang mengatakan (“Kami mendengar dan kami durhaka”).” Tatkala orang-orang mukmin itu mengatakannya dengan jujur, Allah Ta’ala menurunkan dua ayat berikut ini,”Rasul (Muhammad) itu beriman....” yang memberitahukan tentang keimanan mereka yang seiring dengan keimanan nabinya (Muhammad) sebagai penghormatan dan penenang diri mereka. Allah berfirman; “Rasul telah beriman kepada Al-Qur’an yang kepadanya diturunkan Tuhannya, demikian pada orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikatNya, kitab-kitabNya, dan rasul-rasulNya. Kami tidak membeda-bedakan antara seorangpun (dengan yang lain) dari rasul-rasulNya...” Lantas Allah Ta’ala memberi tahu tentang perkataan mereka yang membuat Allah mengabulkan doa mereka. Firman Allah Ta’ala; “Mereka mengatakan, “Kami dengar dan kami taat, dan mereka berdoa, “Ampunilah kami wahai Tuhan kami dan kepada Engkaulah tempat kembali.” Pelajaran dari ayat: • Menetapkan rukun iman yaitu iman kepada Allah, malaikatNya, kitab-kitabNya dan rasul-rasulNya • Wajib untuk beriman kepada seluruh rasul dan haram hukumnya hanya beriman kepada sebagian rasul serta meninggalkan yang lainnya, dan ini termasuk kekufuran semoga Allah melindungi kita dari hal itu. • Wajib untuk taat kepada Allah dan rasulNya serta menerima dan ridha terhadap syariat Allah dan rasulNya. Haram untuk menolak syariat walaupun hanya sedikit bagian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 285: Allah mengabarkan bahwasanya Rasul Shallallahu Alaihi Salam dan yang bersamanya dari orang-orang yang beriman yaitu beriman dengan yang diturunkan kepada mereka dari Tuhannya mereka berkata : kami mendengar wahai Tuhanku seruanmu dan kami taat atas perintahmu , kami meminta agar engkau mengampuni kami diri-diri kami dari dosa-dosa kami dan kekurangan kami, Engkau adalah Tuhanku tiada Tuhan selain Engkau , Engkau adalah tempat kembali kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kami beriman kepada semuanya. Yakni karena seorang hamba pasti memiliki kekurangan dalam memenuhi hak Allah Subhaanahu wa Ta'aala, oleh karenanya dia membutuhkan ampunan Allah secara terus-menerus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 285",
    "description": "Seorang muslim harus menaati firman Allah sebagaimana dicontohkan oleh rasulullah. Sikap beliau dan para pengikutnya yang beriman menyangkut kitab suci Al-Qur'an dan kitab-kitab terdahulu serta para nabi dan rasul adalah bahwa rasul, yakni nabi Muhammad, beriman kepada apa yang diturunkan kepadanya, yakni Al-Qur'an, dari tuhannya, demikian pula orang-orang yang beriman meski dengan kualitas keimanan yang berbeda dengan nabi. Semua, yakni nabi Muhammad dan orang mukmin, beriman kepada Allah bahwa dia wujud dan maha esa, mahakuasa, tiada sekutu bagi-Nya, dan mahasuci dari segala kekurangan. Mereka juga percaya kepada malaikat-malaikat-Nya sebagai hamba-hamba Allah yang taat melaksanakan segala apa yang diperintahkan kepada mereka dan menjauhi seluruh larangan-Nya. Demikian juga dengan kitab-kitab-Nya yang diturunkan kepada para rasul, seperti zabur, taurat, injil, dan Al-Qur'an, dan juga percaya kepada rasul-rasul-Nya sebagai hamba-hamba Allah yang diutus membimbing manusia ke jalan yang lurus dan diridai-Nya. Mereka berkata, kami tidak membeda-bedakan seorang pun dengan yang lain dari rasul-rasulnya dalam hal kepercayaan terhadap mereka sebagai utusan Allah. Dan mereka berkata, kami dengar apa yang engkau perintahkan, baik yang melalui wahyu dalam Al-Qur'an maupun melalui ucapan nabimu, dan kami taat melaksanakan perintah-perintah-Mu dan menjauhi larangan-larangan-Mu. Dengan rendah hati mereka juga berucap, ampunilah kami, ya tuhan kam tidak ada yang berat dalam beragama, dan tidak perlu ada kekhawatiran tentang tanggung jawab atas bisikan-bisikan hati, sebab Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Dia, yakni setiap manusia, mendapat pahala dari kebajikan yang dikerjakannya walaupun baru dalam bentuk niat dan belum wujud dalam kenyataan, dan dia mendapat siksa dari kejahatan yang diperbuatnya dan wujud dalam bentuk nyata. Mereka berdoa, ya tuhan kami, janganlah engkau hukum kami jika kami lupa dalam melaksanakan apa yang engkau perintahkan atau kami melakukan kesalahan karena suatu dan lain sebab. Ya tuhan kami, janganlah engkau bebani kami dengan beban yang berat sebagaimana engkau bebankan kepada orang-orang sebelum kami seperti orang-orang yahudi yang mendapat tugas yang cukup sulit karena ulah mereka sendiri, misalnya untuk bertobat harus membunuh diri sendiri. Ya tuhan kami, janganlah engkau pikulkan kepada kami apa yang tidak sanggup kami memikulnya, baik berupa ketentuan dalam beragama maupun musibah dalam hidup dan lainnya. Maafkanlah kami, yakni hapuslah dosa-dosa kami, ampunilah kami dengan menutupi aib kami dan tidak menghukum kami akibat pelanggaran, dan rahmatilah kami dengan sifat kasih dan rahmat-Mu yang luas, melebihi penghapusan dosa dan penutupan aib. Engkaulah pelindung kami, karena itu maka tolonglah kami dengan argumentasi dan kekuatan fisik dalam menghadapi orang-orang kafir."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini mengabarkan tentang keiman nabi Muhammad sholallohu ‘alaihi wasallam dan para pengikutnya. Dengan demikian orang-orang yang beriman kepada Allah haruslah beriman kepada Malaikat-Nya, kitab-kitab-Nya, Rosul-rosul-Nya, dan tidak membedakan keimanan mereka kepada seluruh rosul. Sebagaimana disebutkan dalah hadits Jibril ‘alaihi salam dalam shohih bukhori dari sahabt Umar bin Khaththab Rhadiyallahu ‘anhu, قال : أخبرني عن الإيمان قال \" أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر وتؤمن بالقدر خيره وشره \" قال : صدقت Orang itu berkata lagi,\" Beritahukan kepadaku tentang Iman\" Rasulullah menjawab,\"Engkau beriman kepada Alloh, kepada para Malaikat-Nya, Kitab-kitab-Nya, kepada utusan-utusan Nya, kepada hari Kiamat dan kepada takdir yang baik maupun yang buruk\" Orang tadi berkata,\" Engkau benar\" Beriman kepada Allah dengan meyakini bahwa Allah adalah Esa, sendiri dan kekal, tidak ada ilah yang haq selain diri-Nya dan tidak ada Rabb melainkan hanya diri-Nya. Beriman kepada Malaikat dengan meyakini bahwa Allah ta’ala telah menciptakannya dari cahaya dan mereka selalu taat kepada-Nya tidak pernah sekalipun mendurhakai perintah tuhannya. Beriman kepada seluruh kitab yang Allah telah turunkan kepada nabi dan rosul-Nya. Beriman kepada para nabi dan Rosul dengan tidak membeda-bedakan antara rosul yang satu dengan yang lainnya, sehingga mereka tidak hanya beriman kepada sebagian dan ingkar kepada sebagian yang lain. Tetapi seluruh rosul dan nabi itu itu benar, baik, mendapat bimbingan dan memberi petunjuk kepada jalan kebaikan, meskipun sebagian rosul membawa syariat yang menghapus syariat rosul sebelumnya denga izin dari Allah ta’ala hingga ahirnya semua syariat para rosul tersebut dihapus oleh syariat yang dibawa oleh nabi Muhammad sholallohu ‘alaihi wasallam sebagai penutup para nabi dan rosul, dan hari kiamat akan terjadi pada masa Syariatnya (Muhammad sholallohu ‘alaihi wasallam), dan akan tetap ada segolongan dari umatnya yang senantiasa berpegang teguh dan menetapi kebenaran. Firman-Nya : وَقَالُوا سَمِعْنَا وَأَطَعْنَا Dan mereka mengatakan: \"Kami dengar dan kami taat\" Maksudnya, kami mendengar apa yang Engkau firmankan, dan kami memahaminya dan kami melaksanakannya sesuai dengan tuntunan yang diberikan kepada kami. Iniah sifat orang yang beriman yang sebenarnya, selalu mendengarkan apa yang menjadi titah dari tuhannya dan melaksanakannya sesuai dengan keinginan tuhannya melalu petunjuk dari para utusan-Nya. Bahkan ketika mereka merasa belum mapu melaksanakan semua kewajiban dengan kesempurnaan, mereka meminta mapunan kepada tuhannya atas ketidak berdayaan mereka dalam melaksanakan kewajiban tersebut, sebagaimana firman-Nya : غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ \"Ampunilah kami ya Tuhan kami dan kepada Engkaulah tempat kembali\". Ibnu Jarir berkata dari Hakim bin Jabir telah berkata; ketika turun kepada Rosulloh sholallohu ‘alaihi wasallam ayat : آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ Rasul telah beriman kepada Al Quran yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. (Mereka mengatakan): \"Kami tidak membeda-bedakan antara seseorangpun (dengan yang lain) dari rasul-rasul-Nya\", dan mereka mengatakan: \"Kami dengar dan kami taat\". (Mereka berdoa): \"Ampunilah kami ya Tuhan kami dan kepada Engkaulah tempat kembali\". Jibril berkata kepadanya; “sesungguhnya Allah ta’ala telah memuji mu dan umatmu dengan pujian dan sanjungan terbaik, maka mintalah (berdo’alah) kepadanya, maka Dia akan memberikan (mengabulkan) permintaanmu. Maka Nabi berodo’a dengan ayat setelah ayat ini."
  }
]