[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ajaran agama Allah itu mudah,tidak ada unsur kesulitan di dalamnya. Allah tidak menuntut dari hamba-hambanya sesuatu yang tidak mereka sanggupi. Barangsiapa yang mengerjakan kebajikan, maka akan memperoleh ganjaran baik, dan barangsiapa yang berbuat keburukan, maka akan memperoleh balasan yang buruk. Wahai tuhan kami, jangan Engkau menyiksa kami jika kami lupa terhadap sesuatu yang Engkau wajibkan atas kami atau kami berbuat salah dengan melakukan sesuatu yang Engkau larang untuk dikerjakan. Wahai tuhan kami janganlah Engkau bebani kami dengan amalan-amalan yang berat yang telah Engkau bebankan kepada umat-umat yang berbuat maksiat sebelum kami sebagai hukuman bagi mereka. Wahai tuhan kami, janganlah Engkau membebankan kepada kami perkara yang kami tidak mampu memikulnya, baik dalam bentuk bentuk perintah-perintah syariat dan musibah musibah. Dan hapuskanlah dosa-dosa kami dan tutuplah kekurangan-kekurangan kami dan sudilah berbuat baik kepada kami. Engkau adalah penguasa urusan kami dan pengaturnya. maka tolonglah kami menghadapi orang orang yang mengingkari agamaMU dan mengingkari keesanMU serta mendustakan nabiMU,Muhammad sholallohu alaihi wasallam, dan jadikanlah kesudahan yang baik bagi kami di hadapan mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "286. Allah tidak membebani seseorang kecuali dengan sesuatu yang sanggup dilakukannya, karena agama Allah dibangun di atas asas kemudahan, sehingga tidak ada sesuatu yang memberatkan di dalamnya. Barangsiapa berbuat baik, dia akan mendapatkan ganjaran atas apa yang dia lakukan, tanpa dikurangi sedikitpun. Dan barangsiapa berbuat buruk, dia akan memikul dosanya sendiri, tidak dipikul oleh orang lain. Rasulullah dan orang-orang mukmin berdoa, “Ya Rabb kami, janganlah Engkau hukum kami jika kami lupa atau salah dalam perbuatan atau ucapan yang tidak kami sengaja. Ya Rabb kami, janganlah Engkau bebani kami dengan sesuatu yang memberatkan dan tidak sanggup kami jalankan, sebagaimana Engkau bebankan kepada orang-orang sebelum kami yang Engkau hukum atas kezaliman mereka, seperti orang-orang Yahudi. Dan janganlah Engkau pikulkan kepada kami perintah maupun larangan yang memberatkan dan tidak sanggup kami jalankan. Maafkanlah dosa-dosa kami, ampunilah diri kami, dan sayangilah kami dengan kemurahan-Mu. Engkaulah pelindung dan penolong kami. Maka tolonglah kami dalam menghadapi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "286. Allah tidak memerintahkan hamba-hamba-Nya dengan hal-hal yang berat, diluar kemampuan manusia. Namun Dia memerintahkan sesuai dengan kemampuan. Barangsiapa yang melakukan kebaikan akan mendapat kebaikan, dan barangsiapa yang melakukan keburukan akan mendapat keburukan. Allah mengajarkan hamba-hamba-Nya doa: “Hai pencipta kami, janganlah Engkau menyiksa kami akibat sifat lupa dan tersalah kami, janganlah Engkau membebankan kepada kami urusan yang berat yang telah Engkau bebankan kepada orang-orang bebal sebelum kami. Ya Tuhan kami, janganlah Engkau membebankan apa yang tidak mampu kami lakukan. Maafkanlah kami dan ampuni dosa-dosa kami serta rahmati kami dengan rahmat-Mu yang Maha Luas. Engkaulah pengatur urusan kami, maka tolonglah kami dalam menghadapi orang-orang yang mengingkari-Mu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "286. لَا يُكَلِّفُ اللهُ نَفْسًا إِلَّا وُسْعَهَا ۚ (Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya ) Makna (التكليف) adalah urusan yang didalamnya terdapat kesukaran, beban dan pengurasan tenaga. لَهَا مَا كَسَبَتْ(Ia mendapat pahala yang diusahakannya) Yakni baginya pahala atas kebaikan yang ia lakukan وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ( dan ia mendapat siksa (dari kejahatan) yang dikerjakannya) Yakni dosa dari keburukan. رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ( Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah) Diriwayatkan sebuah hadist bahwa para sahabat ketika berdo’a dengan do’a ini, Allah menjawab: “Iya, Aku telah melakukannya”. Maka diangkatlah dosa kesalahan yang tidak disengaja dan lupa dari mereka. وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ (janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami ) Makna (الإصر) adalah pembebanan yang berat, urusan yang rumit, dan pekerjaan yang keras. Sebagaimana Bani Israil diperumit urusan mereka seperti, membunuh diri sendiri (untuk bertaubat)memotong kain yang terkena najis. Dan ayat ini mengajarkan orang-orang mukmin untuk meminta kepada Allah agar tidak dibebani dengan beban yang berat sebagaimana yang dibabankan kepada umat-umat sebelumnya. رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ( Ya Tuhan kami,. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya ) Yakni beban yang berat yang hampir tidak mungkin untuk dipikul. وَاعْفُ عَنَّا (Beri maaflah kami ) Yakni atas dosa-dosa kami dengan penghapusan dan pengampunan. وَاغْفِرْ لَنَا ( ampunilah kami) Yakni tutupilah dosa-dosa kami. وَارْحَمْنَآ ۚ( dan rahmatilah kami ) Yakni muliakanlah kami dengan rahmat dari-Mu. أَنتَ مَوْلَىٰنَا (Engkaulah Penolong kami ) Yakni wali dan penolong kami, dan Engkau adalah Tuhan kami sedangkan kami adalah hamba-hamba-Mu. فَانصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِينَ (maka tolonglah kami terhadap kaum yang kafir ) Karena salah satu hak atas Tuhan adalah menolong hamba-Nya. Terdapat hadist shahih dari Rasulullah bahwa Allah berfirman setiap doa ini selesai dipanjatkan: “Iya, Aku telah melakukannya”, sehingga mereka tidak dihukum sedikitpun atas kesalahan yang tak disengaja dan lupa, tidak membebani mereka dengan beban berat yang telah dibebankan kepada orang-orang sebelum mereka, tidak membebani mereka diatas kemampuan mereka, dan memaafkan, mengampuni, merahmati, menolong mereka atas orang-orang kafir. Alhamdulillah Robbil ‘Alamiin. Ya Allah jadikanlah kami termasuk orang-orang yang Engkau muliakan dengan pemberian-peberian tersebut. Dari Ibnu ‘Abbas Ia berkata: Ketika Jibril sedang duduk di sisi Nabi saw., dia mendengar suara di atasnya, kemudian mengangkat kepalanya dan berkata: Ini adalah pintu dari langit yang dibuka pada hari ini dan tidak pernah dibuka sebelumnya, lalu seorang malaikat turun kemudian mendatangi Nabi lalu berkata, Bergembiralah dengan dua cahaya yang diberikan kepadamu, yang tidak diberikan kepada seorang Nabi pun sebelumnya, yaitu Fatihat al-kitab dan ayat-ayat akhir dari surat al-Baqarah. Engkau tidak membaca satu huruf pun dari ayat-ayat itu kecuali engkau diberinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا } Ibnu hazm berkata : Kalau saja kalian tidak bisa memahami hukum-hukum dalam al-qur'an, maka tidaklah Allah memerintahkan kalian untuk mentadabburinya. 2 ). { لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا } Sebagian orang berdalil dengan ayat ini atas keinginannya untuk mengambil perkara agama yang paling mudah, padahal ayat ini juga sebenarnya mengisyaratkan agar kita senantiasa memiliki keinginan kuat untuk mengambil perkara agama yang terbaik, maka dikatakan kepada mereka : sesunguhnya Allah tidak membebankan kepada hamba-Nya diatas kemampuannya, yakni : bahwa semua perkara yang masih bisa diterima oleh kemampuannya masuk dalam taklif itu. 3 ). { لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ } Ungkapan kebaikan disandigkan dengan kata ( لها ); karena hal itu memberikan manfaat bagi setiap hamba, dan ungakapan keburukan disebutkan dengan huruf ( عليها ); karena itu merupakan perkara yang mencelakai seorang hamba. 4 ). Dan tidaklah diperkenankan bagi seseorang mengikuti kekeliruan ulama sebagaimana ia tidak boleh mengatakan sesuatu yang berkenaan dengan ahli ilmu dan iman kecuali ia mengetahui lebih banyak tentang mereka, dan sesungguhnya Allah pemberi maaf bagi hamba-hambaNya jika mereka berbuat salah, sebagaimana firman-Nya : { رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا } \"(Mereka berdoa): \"Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah\" dan Dia جل جلاله memerintahkan kita untuk mengikuti apa-apa yang datang dari syari'at-Nya dan tidak mengikuti apa-apa yang datang dari selain-Nya. Allah menyuruh kita untuk tidak patuh kepada makhluq dengan maksud menyalahi aturan sang pencipta dan bersegera meminta ampunan bagi saudara-saudara kita yang telah lalu perginya dengan keimanan, maka diantara doa yang hendak kita ucapkan adalah : { رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ } \"“Ya Rabb kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dulu dari kami\" [al-hasyr : 10]. 5 ). { رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا } Dalam ayat ini Allah mengumpulkan antara perkara meninggalkan perintah dan mengerjakan larangan, karena maksud dari lupa dsisini adalah : meninggalkan, makna lupa adalah meninggalkan suatu pekerjaan karena tabir yang cacat, sedangkan yang dimaksud dengan salah adalah : mengerjakan suatu pekerjaan karena tabir yang cacat, maka dengan ini mereka memohon ampun kepada Allah agar dijauhkan dari kedua sifat ini. 6 ). { وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ } Dalam satu hadits qudsy yang berkaitan dengan ayat ini Allah berkata : “Aku telah lakukan\", perhatikanlah susunan katanya \"العفو\" : yakni, permohonan dicabutnya satu hukuman dari seseorang, kemudian naik menjadi \"المغفرة\" : yakni, memohon ditutupnya kesalahan, karena terkadang satu hukuman dicabut tapi dosa tidak ditutup dari diri seseorang, kemudian meningkat menjadi \"الرحمة\" yaitu : satu kata yang mengandung beberapa macam kebaikan dan keramahan, segala puji bagi Allah yang tidak ada rahmat yang lebih besar dari rahmat-Nya. 7 ). Dari Ibn Abbas ra. berkata: Ketika Jibril sedang duduk di sisi Nabi saw., dia mendengar suara di atasnya, kemudian mengangkat kepalanya dan berkata: Ini adalah pintu dari langit yang dibuka pada hari ini dan tidak pernah dibuka sebelumnya, lalu seorang malaikat turun. Ini adalah malaikat yang turun ke bumi. Ia belum pernah turun kecuali hari ini. Lalu malaikat itu mengucapkan salam dan berkata, Bergembiralah dengan dua cahaya yang diberikan kepadamu, yang tidak diberikan kepada seorang Nabi pun sebelumnya, yaitu Fatihatul kitab dan ayat-ayat akhir surah al-Baqarah. Engkau tidak membaca satu huruf pun dari ayat-ayat itu kecuali engkau diberinya. (HR Muslim) Sesungguhnya kedua adalah dua cahaya yang belum diberikan kepada ummat-ummat sebelum ummat ini, maka apakah orang yang membaca kedua ayat ini pernah merasakan kebaikan ini, dan apakah mereka pernah memeriksa dalam hatinya ada pengaruh dari kedua ayat yang agung ini ? 8 ). Allah menyebutkan pada bagian akhir dari surah al-baqarah beberapa hukum yang berkaitan dengan harta, yang terbagi menjadi tiga golongan : al-'adlu, yaitu : jual beli, dan azzhulmu, yaitu : riba, dan al-fadhlu, yaitu : sedekah. dan Alla juga telah memuji prang-orang yang bersedekah dan menyebutkan ganjaran bagi mereka, kemudian Allah juga menghinakan para pemakan riba dan menjelaskan akibat yang akan menyertai mereka, di bagian akhir surah ini juga Allah membolehkan jual beli dan utang piutang. 9 ). Syaikh 'Utsaimin dalam kisahnya bahwa beliau telah mengeluarkan dan menyimpulkan dari surah al-baqarah saja begitu banyak faidah-faidah 'aqdiyah, fiqhiyah, ushuliyah, dan tarbawiyah setidaknya lebih dari 2500 faidah! yakni setara dengan (9 faidah) setiap ayat. 10 ). Sesungguhnya orang yang mempelajari surah al-baqarah, jika ia belum menyerahkan wajahnya kepada Allah dalam segala hal, dan belum berjalan dengannya menuju hidayah tuhannya, dengan maksud mewujudkan kesempurnaan rukun-rukun islam dan rukun-rukun iman, berakhlaq seperti akhlaq para pejuang dijalan Allah, sabar atas segala cobaan dan permasalahan, menjauhkan dirinya dari makanan dan minuman yang diharamkan, memastikan terwujudnya ketaatan kepada perintah Allah dalam segala hal, tanpa ada keraguan dalam dirinya; maka sesungguhnya ia belum termasuk orang yang menjaga surah al-baqarah sebaik-baiknya!."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "286. Allah tidak akan membebani seseorang kecuali sesuai kemampuannya. Baginya itu pahala atas perbuatan baik yang dia usahakan, baginya pula dosa atas perbuatan buruk yang dia usahakan. Orang-orang mukmin berkata: “Wahai Tuhan, janganlah engkau menghukum Kami atas kelupaan yang kami lakukan bukan karena kehendak kami, dan juga kesalahan dalam tindakan yang tidak sesuai dengan niatan kami. Wahai Tuhan kami, janganlah Engkau bebankan kepada kami sesuatu yang tidak mampu kami pikul, yang di dalamnya mengandung penderitaan berlebih tidak seperti biasanya. Rahasiakanlah dosa-dosa dan kesalahan kami, berilah kami rahmat yang luas dengan keutamaan dan kamuliaanMu. Engkaulah wali (Dzat yang diserahi segala urusan kami) dan penolong kami, jadi selamatkanlah kami atas kaum yang mengingkari nikmatMu, yang menyembah selainMu.” Dalam hadits shahih dijelaskan dari Nabi SAW bahwa setelah masing-masing doa ini diucapkan Allah SWT berfirman “Sungguh Aku telah mengabulkannya”. Dan Jibril berkata kepada Nabi SAW: “Bergembiralah dengan dua cahaya yang telah diberikan kepadamu yang tidak diberikan kepada seorang nabi pun sebelum dirimu, yaitu surah Al-Fatihah, dan ayat-ayat terakhir surah Al-Baqarah. Kamu tidak akan pernah bisa membaca satu huruf pun dari ayat-ayat itu kecuali kamu diberinya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah tidak membebani seseorang, kecuali sesuai kesanggupannya} kecuai sesuai apa yang bisa ditanggungnya {Baginya apa yang diusahakannya dan atas hal itu pula yang diperolehnya “Wahai Tuhan kami, janganlah Engkau hukum kami} janganlah Engkau menghukum kami {jika kami lupa atau kami salah. Wahai Tuhan kami, janganlah Engkau bebani kami dengan beban yang berat} beban berat {sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Wahai Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tidak sanggup kami pikul. Maafkanlah kami} janganlah Engkau membebani kami dengan sesuatu yang tidak mampu kami pikul dan maafkanlah dosa-dosa kami {ampunilah kami, dan rahmatilah kami. Engkaulah pelindung kami} penolong dan pelindung kami {Maka tolonglah kami atas kaum kafir.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "285-286. Terdapat riwayat shahih dari Nabi bahwa siapa yang membaca dua ayat ini pada malam hari, maka itu cukuplah baginya, yakni dari segala kejahatan (keburukan). Hal itu karena kedua ayat ini meliputi ayat yang agung. Allah telah memerintahkan kepada manusia dalam awal ayat ini untuk beriman dengan segala pokok-pokok dalam firmanya, ”Katakanlah (hai orang-orang Mukmin), Kami berikan kepada Allah apa yang Dia turunkan kepada kami.” Allah mengabarkan dalam ayat ini bahwasanya Rasululoh dan orang-orang yang bersamanya dari orang Mukmin telah beriman kepada pokok-pokok yang agung ini; kepada seluruh Rasul, dan seluruh kitab-kitab, dan mereka tidak melakukan perbuatan seperti orang-orang yang beriman dengan sebagian dan mengingkari sebagian lainya, seperti kondosi orang-orang yang menyimpang dari pemeluk-pemeluk agama lain yang tersesat. dirangkaiannya secara urut kaum Mukminin dengan Rasululoh dan disebutnya mereka sumua dengan satu kabar saja, merupakan kemuliaan yang besar bagi kaum Mukminin. Ayat ini juga menunjukan bahwa Rasululloh sama dengan umatnya dalam hal sebagai sasaran perintah syar’i, pelaksanaan beliau yang sempurna dan bahwasanya beliau itu lebih tinggi dari kaum Mukminin bahkan lebih tinggi dari seluruh Rasul dalam pelaksanaan keimanan dan hak-haknya. Dan firmanNya, ”Dan mereka megatakan, kami dengar dan taat,” Konsisiten kaum Mukminin ini adalah umum terhadap semua yang dibawa oleh nabi dari al-qur’an dan as-sunah. Dan bahwasanya mereka mendengar beliau dengan maksud penerimaan, ketundukan dan kepatuhan. Kandungan dari itu adalah penghambaan mereka terhadap Allah dalam rangka memohon pertolongan untuk melaksanakanya dan bahwasanya Allah mengampuni mereka atas kelalaian mereka dari kewajiban-kewajiban dan apa yang mereka kerjakan dari hal-hal yang di haramkan. Mereka juga menghambakan diri kepada Allah dalam doa-doa yang penuh manfaat tersebut, dan Allah telah memenuhi doa mereka melalui lisan Nabi mereka yang bersabda (dalam sebuah hadis Qudsi) “Sungguh aku telah melakukanya,” Doa-doa ini akan di terima dari seluruh kaum Mukminin secara pasti, dan juga dari pribadi-pribadi mereka tersebut. hal itu bahwa Allah menggugurkan siksaan mereka dari kesalahn dan kelupaan, dan bahwa Allah memudahkan syariat-syariatNya dengan sangat mudah, dimana Allah tidak memberatkan mereka dengan kesulitan, beban-beban, dan tambahan-tambahan seperti orang-orang sebelum mereka. Allah tidak memberatkan mereka melebihi kemampuan mereka. Allah juga telah mengampuni mereka, merahmati, dan membalas mereka dari orang-orang kafir. Maka kita memohon kepada Allah dengan nama-namaNya dan sifat-sifatNya dan dengan segala yang dikarunikannya kepada kita berupa sikap konsisten kita kepada agamanya agar Dia merealisasikan hal itu buat kita agar Allah membuktikan kepada kita apa yang telah Dia janjikan kepada kita melewati lisan NabiNya, dan agar Dia memperbaiki kaum Mukminin. Dalam hal ini dapat diambil kaidah ”kemudahan dan tidak adanya rasa sungkan dalam seluruh perkara agama,” dan kaidah ”ampunan dari kesalahan dan kelupaan dalam perkara ibadah dan terhadap hak-hak Allah dan demikian juga terhadap hak-hak mahkluk dari segi menggugurkan dosa dan tidak mendapat celaan.” Adapun wajibnya menjamin kerusakan-kerusakan yang terjadi atas dasar ketidaksengajaan dan kelalaian terhadap jiwa dan harta, Maka sesungguhnya hal itu akibatkan tindakan pengrusakan tanpa hak, yang disengaja maupun tidak, atau di kerenakan kelalaian. Selesai tafsir surat Al-baqarah, segala puji dan sanjungan hanya bagi Allah, dan shlawat dan salam semoga tercurahkan kepada Nabi Muhammmad."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: { لَا يُكَلِّفُ ٱللَّهُ نَفۡسًا } Lâ yukallifullâhu nafsan: Allah Ta’ala tidak akan membebani seseorang dengan sesuatu yang sulit dan tidak dapat dipikulnya { إِلَّا وُسۡعَهَاۚ } Illâ wus’ahâ: Kecuali sesuai dengan kemampuan dan kesanggupannya { لَهَا مَا كَسَبَتۡ } Lahâ Mâ kasabat: Dia mendapatkan pahala atas kebaikan yang dikerjakannya. { وَعَلَيۡهَا مَا ٱكۡتَسَبَتۡۗ } Wa’alaihâ maktasabat: Dia akan mendapatkan siksaan atas kejahatan yang dikerjakannya { لَا تُؤَاخِذۡنَآ } Lâ tuâkhidznâ: Jangan Engkau hukum kami { إِن نَّسِينَآ } In Nasînâ: Kami meninggalkan apa yang Engkau perintahkan atau melakukan apa yang Engkau larang karena lupa tanpa ada kesengajaan. { أَوۡ أَخۡطَأۡنَاۚ } Au Akhtho’nâ: Kami melakukan kesalahan, yaitu melakukan apa yang tidak Engkau perintahkan, atau melakukan kesalahan tanpa kami sengaja dan tanpa kemauan dari diri kami. { إِصۡرٗا } Ishran: Beban yang berat bagi kami yang menahan kami dari beramal. { مَوۡلَىٰنَا } Maulânâ: Raja, tuan dan yang mengatur segala urusan kami. Tidak ada Tuhan untuk kami selain Engkau. Makna ayat: Setelah itu Allah Ta’ala mengabarkan bahwa dikarenakan hikmah dan kasih sayangNya serta perlakuanNya kepada mereka, tidak membebani mereka kecuali sesuai dengan kesanggupannya dan kemampuannya untuk beramal. Bagi mereka apa yang telah mereka upayakan berupa kebaikan akan dibalas kebaikan, dan bagi mereka yang berbuat kejahatan dan keburukan akan mendapat balasan keburukan kecuali jika Allah memaafkan dan mengampuninya. Allah Ta’ala berfirman; “Allah tidak membebani seorang melainkan sesuai dengan kesanggupannya, baginya pahala dari kebajikan yang diusahakannya, dan baginya siksa dari kejahatan yang ia lakukan...” Kemudian Allah Ta’ala mengajarkan tatacara berdoa kepadaNya dengan berfirman,”Katakanlah wahai orang-orang mukmin sekalian; رَبَّنَا لَا تُؤَاخِذۡنَآ إِن نَّسِينَآ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَآ إِصۡرٗا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِينَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ “Ya Tuhan kami, janganlah Engkau hukum kami, jika kami lupa atau tersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada 0rang-orang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepda kami apa yang tak sanggup kami memikulnya. Beri maaflah kami, ampunilah kami dan rahmatilah kami. Engkau penolong kami, maka tolonglah kami terhadap kaum yang kafir.” Sungguh memang Allah telah mengampuni mereka pada perkara yang mereka lupa atau bebuat kesalahan, dan memberikan keringanan hukum syar’i dan tidak membuat mereka merasa susah dalam beragama. Begitu juga Allah memaafkan, mengampuni, merahmati dan menolong mereka menghadapi orang-orang kafir dengan argumentasi dan penjelasan, dan pada saat peperangan dengan pedang dan tombak (persenjataan). Bagi Allah segala puji dan karunia dan Dialah yang Maha Besar lagi Maha Tinggi. Pelajaran dari ayat: • Allah Ta’ala mengangkat kesusahan bagi umat ini sebagai bentuk kasih sayangNya kepada mereka. • Allah tidak akan menghukum orang yang lupa atau tersalah. Barangsiapa yang lupa tatkala makan dan minum saat berpuasa maka tidak berdosa, begitu juga orang yang membunuh karena tidak sengaja tidak ada dosa baginya. • Dimaafkannya kata-kata yang masih di dalam hati, karena ayat ini turun untuk menerangkan hal itu selama seorang mukmin tidak mengucapkannya dengan kata-kata atau melakukannya. • Allah Ta’ala mengajarkan doa ini, dan orang-orang mukmin disunnahkan untuk membacanya mengikuti Rasulullah ﷺ dan para sahabatnya. Terdapat keterangan dari hadits bahwa siapa saja yang membaca dua ayat ini ketika akan tidur yaitu {ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ } sampai akhir surat Al-Baqarah maka sudah cukup baginya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 286: Allah mengabarkan bahwasanya kasih sayang-Nya kepada hamba-Nya yaitu berupa tidak membebankan bagi diri seseorang kecuali apa yang ia mampu ; maka bagi seluruh jiwa akan mendapatkan balasan atas amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agama Allah adalah mudah, tidak ada kesulitan di dalamnya. Oleh karena itu, Allah Subhaanahu wa Ta'aala tidak membebani sesuatu yang mereka tidak sanggup memikulnya. Pada asalnya perintah dan larangan tidaklah memberatkan seseorang, bahkan hal itu merupakan makanan bagi ruh dan obat bagi badan serta menjaganya dari bahaya. Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya sebagai rahmat dan ihsan-Nya. oleh karena itu, apabila ada udzur yang mengakibatkan berat melaksanakan perintah itu, maka ada keringanan dan kemudahan, baik dengan digugurkan kewajiban itu atau digugurkan sebagiannya sebagaimana pada keringanan-keringanan bagi musafir dan orang yang sakit. Oleh karena itu, seseorang tidaklah dihukum karena dosa orang lain dan tidak dihukum karena was-was yang menimpa hatinya selama tidak diucapkan atau dikerjakan. Demikian juga amal baik yang dilakukan seseorang tidaklah diberikan kepada orang lain. Yakni niatnya hendak melakukan perbuatan yang boleh dilakukan, namun ternyata malah terjatuh ke dalam perbuatan yang dilarang, atau melakukan kesalahan tanpa disengaja. Kedua hal ini (lupa dan tersalah) dimaafkan oleh Allah Subhaanahu wa Ta'aala. Berdasarkan ayat ini, maka barang siapa shalat memakai baju bekas rampasan, memakai baju bernajis, ada najis yang menimpa badannya, berbicara ketika shalat dsb. semua itu dilakukan karena lupa atau berbuka puasa karena lupa, mengerjakan larangan-larangan ihram yang tidak termasuk perbuatan yang membinasakan karena lupa, maka dimaafkan. Demikian juga, jika seorang yang bersumpah untuk tidak melakukan sesuatu, ternyata malah dikerjakan karena lupa, maka dimaafkan. Termasuk juga jika seseorang melakukan sesuatu ternyata malah membinasakan jiwa atau harta orang lain, maka dia tidak berdosa, akan tetapi wajib menanggung karena telah membinasakan. Demikian pula pada tempat atau keadaan yang mewajibkan membaca basmalah, namun ia lupa membacanya, maka tidak mengapa. Imam Abu Hanifah berkata: “Jika seseorang sengaja tidak membaca (basmalah ketika menyembelih), maka haram dimakan. Namun jika tidak membacanya karena lupa, maka halal.” Seperti yang menimpa Bani Israil, di mana tobat mereka dengan membunuh dirinya, zakatnya dengan mengeluarkan seperempat harta dan pakaian yang terkena najis harus dipotong. Yakni Engkau-lah Tuhan kami, Penguasa kami, sesembahan Kami, Engkau mengurus kami sejak Engkau ciptakan kami. Nikmat-Mu kepada kami begitu banyak, bergulir terus dengan berjalannya waktu. Engkau pula yang melimpahkan kepada kami nikmat yang sangat besar, di mana semua nikmat mengikutinya, yaitu nikmat Islam. Dengan menegakkan hujjah dan memenangkan peperangan ketika melawan mereka. Do'a yang dipanjatkan kaum mukminin ini diterima oleh Allah Subhaanahu wa Ta'aala sebagaimana yang diberitakan oleh Nabi shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 286",
    "description": "Tidak ada yang berat dalam beragama, dan tidak perlu ada kekhawatiran tentang tanggung jawab atas bisikan-bisikan hati, sebab Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Dia, yakni setiap manusia, mendapat pahala dari kebajikan yang dikerjakannya walaupun baru dalam bentuk niat dan belum wujud dalam kenyataan, dan dia mendapat siksa dari kejahatan yang diperbuatnya dan wujud dalam bentuk nyata. Mereka berdoa, ya tuhan kami, janganlah engkau hukum kami jika kami lupa dalam melaksanakan apa yang engkau perintahkan atau kami melakukan kesalahan karena suatu dan lain sebab. Ya tuhan kami, janganlah engkau bebani kami dengan beban yang berat sebagaimana engkau bebankan kepada orang-orang sebelum kami seperti orang-orang yahudi yang mendapat tugas yang cukup sulit karena ulah mereka sendiri, misalnya untuk bertobat harus membunuh diri sendiri. Ya tuhan kami, janganlah engkau pikulkan kepada kami apa yang tidak sanggup kami memikulnya, baik berupa ketentuan dalam beragama maupun musibah dalam hidup dan lainnya. Maafkanlah kami, yakni hapuslah dosa-dosa kami, ampunilah kami dengan menutupi aib kami dan tidak menghukum kami akibat pelanggaran, dan rahmatilah kami dengan sifat kasih dan rahmat-Mu yang luas, melebihi penghapusan dosa dan penutupan aib. Engkaulah pelindung kami, karena itu maka tolonglah kami dengan argumentasi dan kekuatan fisik dalam menghadapi orang-orang kafir. Alif laam miim. Huruf-huruf hijaiah ini juga menunjukkan kemukjizatan Al-Qur'an, sebab di situ terkandung tantangan kepada orangorang musyrik untuk mendatangkan yang serupa dengannya. Satu hal yang tidak pernah bisa mereka lakukan, dan tidak akan pernah ada seorang pun yang bisa melakukannya, padahal ayat Al-Qur'an terdiri atas rangkaian huruf-huruf yang biasa digunakan dalam bahasa arab, dan mereka yang hidup pada saat itu sedang berada pada puncak kemahiran berbahasa."
  }
]