[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah satu-satunya yang telah menciptakan segala yang ada di muka bumi ini bagi kalian dari segala jenis kenikmatan yang dapat kalian manfaatkan, kemudian Dia berkehendak menciptakan langit-langit dan menjadikannya tujuh lapisan langit. Dia Maha Mengetahui segala sesuatu. Dan ilmunya Allah subhana wata’ala meliputi seluruh apa yang diciptakan-Nya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Hanya Allah yang menciptakan semua yang ada di bumi untuk kalian, seperti sungai, pohon dan lain-lain yang tidak terhitung jumlahnya. Sementara kalian memanfaatkan dan menikmati apa yang telah Allah sediakan untuk kalian. Kemudian Allah menciptakan langit sebanyak tujuh lapis. Dan pengetahuan-Nya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Sebagian kenikmatan Allah bagi kalian wahai manusia, bahwa Dia menciptakan segala yang ada di bumi untuk kalian, agar kalian dapat mengambil manfaat darinya, kemudian Dia menciptakan tujuh langit dan menyempurnakan penciptaannya. Dia meliputi segala sesuatu dengan ilmu-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِى الْاَرْضِ جَمِيْعًا (Dialah Allah, yang menjadikan segala yang ada di bumi untuk kamu dan Dia berkehendak (menciptakan) langit, lalu dijadikan-Nya tujuh langit) Yakni sebagai bentuk kemurahan Allah dan kenikmatan dan manfaat untuk bani Adam sampai batas waktu yang telah ditentukan. ثُمَّ اسْتَوٰٓى اِلَى السَّمَاۤءِ فَسَوّٰىهُنّ Makna (الاستواء) secara bahasa adalah naik diatas sesuatu. Sebagaimana firman Allah: فَإِذَا اسْتَوَيْتَ أَنْتَ وَمَنْ مَعَكَ عَلَى الْفُلْكِ “Apabila kamu dan orang-orang yang bersamamu telah berada di atas bahtera itu…” makna (فَسَوّٰىهُنّ) adalah menyempurnakan penciptaannya sehingga tidak terdapat kebengkokan padanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah adalah satu-satunya Dzat yang menciptakan untuk kalian segala sesuatu di bumi, agar kalian dapat mengambil manfaat darinya, yaitu berupa hewan, tumbuhan, benda mati dan lain-lain. Kemudian Allah beristiwa’ sesuai dengan kehendakNya. Istiwa’ adalah naik dan berada di derajat paling tinggi di atas segala sesuatu, kemudian menciptakan tujuh langit dengan sebaik-baik ciptaan sehingga tidak ada penyimpangan di dalamnya. Samawat adalah langit-langit yang diangkat amat tinggi dan memiliki karakteristik berbeda dengan bumi. Sedangkan Sama’ adalah langit yang berhadapan langsung dengan bumi, dan Allah adalah Dzat yang Maha Mengetahui atas segala urusan dan keadaanmu serta segala sesuatu yang diciptakan di bumi dan langit. Ayat-ayat itu secara bertahap menyebutkan awalan dan akhiran, mulai dari penjelasan bukti-bukti risalah sampai kemantapan diri pada keimanan, karena hanya Allahlah yang berkuasa atas penciptaan dan pembangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Dzat yang menciptakan segala yang ada di bumi untuk kalian, kemudian Dia menuju ke langit} menciptakan langit {lalu Dia menyempurnakannya menjadi tujuh langit}Dia membuat langit menjadi tujuh tingkat langit {Dia Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Maksudnya, Dia menciptakan segala sesuatu di muka bumi ini sebagai suatu kebaikan dan kasih sayang untukmu agar dapat di ambil manfaatnya, dinikmati, dan di jadikan pelajaran. Di dalam ayat yang mulia ini merupakan sebuah dalil yang menunjukkan bahwasanya segala sesuatu itu pada dasarnya adalah mubah dan suci, karena disebutkan dalam kerangka suatu anugerah, dengan nash tersebut, maka hal-hal yang kotor tidak termasuk di dalamnya, dan sesungguhnya keharaman hal-hal yang kotor itu pun telah di ambil dari pemahaman utama ayat ini (fahwa al-ayat), penjelasan akan maksudnya dan bahwasanya Allah menciptakan-nya untuk kemaslahatan kita. Maka apapun yang ada bahaya nya dalam hal itu, maka tidak termasuk di dalamnya, dan sebagai penyempurnaan nikmatNya, Dia melarang kita dari hal-hal yang kotor demi untuk membersihkan kita. Da firman-Nya : \" Dia berkehendak (menciptakan) langit, lalu dijadikan-Nya tujuh langit.\" Kata ‘istawaa’ yang di sebutkan dalam al-Qur’an hadir dengan tiga makna: terkadang tidak dijadikan kata kerja muta’addi (transitif yang membutuhkan objek) dengan huruf, maka berarti kesempurnaan dan kepurnaan. Sebagaimana firman-Nya tentang Musa: \" Dan setelah Musa cukup umur dan sempurna akalnya,\" (QS. Al-Qoshos : 14) Terkadang juga bermakna (tinggi dan jauh di atas), hal ini bila kata kerja ini dijadikan kata kerja muta’addi dengan kaliamat 'ala , sebagaimana firman-Nya : \" (Yaitu) Tuhan Yang Maha Pemurah. Yang bersemayam di atas ‘Arsy.\" (QS. Thoha : 5) \" Supaya kamu duduk di atas punggungnya\" (QS. Az-Zukhruf : 13)\" Dan juga terkadang berarti, bermaksud, sebagaimana bila dijadikan kata kerja muta’addi (transitif) dengan “ilaa” yaitu kepada, sebagaimana yang ada pada ayat ini. Maksudnya ketika Allah ta’ala telah menciptakan bumi, Dia bermaksud menciptakan langit dan dijadikannya tujuh langit, maka Dia menciptakannya, menyeimbangkannya dan mengukuhkannya, dan Allah MahaTahu akan segala sesuatu, Dia mengetahui apa yang masuk dalam bumi dan apa yang keluar darinya, mengetahui apa yang turun dari langit dan apa yang naik kepadanya, dan Dia mengetahui juga apa yang kalian sembunyikan dan apa yang kalian perlihatkan, dan Dia mengetahui yang rahasia dan yang tersembunyi. Sangat sering sekali Allah menyandingkan penciptaanNya terhadap sesuatu dengan penetapan akan ilmuNya. Karena penciptaan Allah terhadap makhluk-mahkluk adalah dalil yang paling jelas akan pengetahuan, hikmah, dan kekuasaanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : خَلَقَ لَكُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا : Maknanya mengadakan seluruhnya dari hal yang bermanfaat di bumi semuanya untuk kalian, agar kalian mengambil manfaat dalam kehidupan kalian. ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ : Dia naik tinggi ke atas untuk menundukkannya, kemudian Allah membuat tujuh lapis langit. فَسَوَّىٰهُنَّ : Allah menyempurnakan penciptaan tujuh lapis langit dengan begitu sempurnanya. وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ : Ini berita dari Allah bahwa ilmuNya meliputi segala sesuatu, juga menunjukkan akan kekuasaanNya, keluasan ilmuNya, dan kewajiban untuk beribadah kepadaNya. Makna ayat : Bukti kemuliaan dan kekuasaanNya adalah Dia menciptakan segala sesuatu di muka bumi untuk manusia karena ketergantungan hidupnya kepadaNya, dan menciptakan langit dengan tujuh lapisnya. Dialah Allah dengan semua itu ilmunya meliputi segala sesuatu Maha Suci Allah Tidak ada sesembahan kecuali Allah dan tidak ada Rabb selainNya. Pelajaran dari ayat : 1. Kehalalan segala hal yang ada di muka bumi berupa makanan, minuman, pakaian, kendaraan, kecuali yang ada dalil spesifik pengharamannya baik dari Al-Qur’an maupun hadits berdasarkan firmanNya: “Dialah Allah yang telah menciptakan untuk kamu segala yang ada di bumi semuanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 29: Allah mengabarkan bahwasanya Allah menciptakan segala sesuatu di bumi dari kenikmatan yang bermanfaat karena sebab kalian , kenikmatan tersebut untuk manusia seluruhnya, kemudian Allah menciptakan langit yang baru dan Allah jadikan langit tersebut 7 tingkat serta Allah yang maha tahu atas segalanya ; dan ilmunya mencakup seluruhnya dari makhluk. Berkata Syeikh Ibnu utsaimin : ayat ini menunjukkan bahwasanya seluruh apa yang ada di bumi diperbolehkan bagi manusia , kecuali apa yang diharamkan di dalam nash."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk kamu manfa'atkan, untuk dipakai bersenang-senang dan untuk diambil pelajaran. Dalam ayat ini diambil sebuah ka'idah fiqh bahwa Al Ashlu fil asyaaa'il ibaahah wath thahaarah (asal pada segala sesuatu itu boleh dan suci), karena ayat di atas menerangkan bahwa itu semua merupakan pemberian Allah kepada kita, tidak termasuk ke dalamnya hal-hal yang kotor. Dia menciptakan semua yang ada di bumi untuk kita manfa'atkan, oleh karena itu jika ada bahaya di sana tidak termasuk bagiannya, dan termasuk sempurnanya nikmat Allah kepada kita adalah dengan dilarang-Nya juga sesuatu yang kotor dan membahayakan. Sering sekali disebutkan Allah Maha Mengetahui setelah menerangkan penciptaan-Nya, karena penciptaan-Nya menunjukkan ilmu-Nya, hikmah dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 29",
    "description": "Tuhan yang patut untuk disembah dan ditaati itu dialah Allah yang menciptakan dan memberikan karunia berupa segala apa yang ada di bumi untuk kemaslahatan-Mu, kemudian bersamaan dengan penciptaan bumi dengan segala manfaatnya, kehendak dia menuju ke penciptaan langit, lalu dia menyempurnakannya menjadi tujuh langit yang sangat beraturan, baik yang tampak olehmu maupun yang tidak. Dan dia maha mengetahui segala sesuatu. Ilmu Allah mencakup segala ciptaan-Nya. Setelah pada ayat-ayat terdahulu Allah menjelaskan adanya kelompok manusia yang ingkar atau kafir kepada-Nya, maka pada ayat ini Allah menjelaskan asal muasal manusia sehingga menjadi kafir, yaitu kejadian pada masa nabi adam. Dan ingatlah, wahai rasul, satu kisah ketika tuhanmu berfirman kepada para malaikat, aku hendak menjadikan khalifah, yakni manusia yang akan menjadi pemimpin dan penguasa, di bumi. Khalifah itu akan terus berganti dari satu generasi ke generasi sampai hari kiamat nanti dalam rangka melestarikan bumi ini dan melaksanakan titah Allah yang berupa amanah atau tugas-tugas keagamaan. Para malaikat dengan serentak mengajukan pertanyaan kepada Allah, untuk mengetahui lebih jauh tentang maksud Allah. Mereka berkata, apakah engkau hendak menjadikan orang yang memiliki kehendak atau ikhtiar dalam melakukan satu pekerjaan sehingga berpotensi merusak dan menumpahkan darah di sana dengan saling membunuh, sedangkan kami bertasbih memuji-Mu dan menyucikan nama-Mu' malaikat menganggap bahwa diri merekalah yang patut untuk menjadi khalifah karena mereka adalah hamba Allah yang sangat patuh, selalu bertasbih, memuji Allah, dan menyucikan-Nya dari sifat-sifat yang tidak layak bagi-Nya. Menanggapi pertanyaan malaikat tersebut, Allah berfirman, sungguh, aku mengetahui apa yang tidak kamu ketahui. Penciptaan manusia adalah rencana besar Allah di dunia ini. Allah mahatahu bahwa pada diri manusia terdapat hal-hal negatif sebagaimana yang dikhawatirkan oleh malaikat, tetapi aspek positifnya jauh lebih banyak. Dari sini bisa diambil pelajaran bahwa sebuah rencana besar yang mempunyai kemaslahatan yang besar jangan sam-pai gagal hanya karena kekhawatiran adanya unsur negatif yang lebih kecil pada rencana besar tersebut."
  }
]