[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang membenarkan perkara-perkara yang gaib yang tidak dapat ditangkap oleh panca indra dan akal mereka Semata, karena hal itu tidak dapat diketahui kecuali dengan wahyu dari Allah kepada rasul-Nya. seperti iman kepada malaikat,surge,neraka dan yang lainnya dari apa-apa yang diberitakan oleh Allah atau diberitakan oleh Rosul-Nya sholallohu’alaihi wasallam. (Iman adalah satu kalimat yang mengandung arti iqrar kepada Allah, para malaikat-Nya, kitab-kitab-Nya, para Rosulul-Nya, hari akhir dan qadar yang baik dan yang buruk. dan yang membuktikan benarnya ikrar tersebut adalah dengan ucapan dan amal dengan hati, lisan dan anggota tubuh) Dan mereka denga bukti kebenaran iman mereka terhadap yang gaib adalah dengan menjaga pelaksanaan salat pada waktu-waktunya dengan pelaksanaan yang shahih sesuai dengan yang Allah syariatkan kepada nabi-Nya Muhammad Shallallahu Alaihi Wasallam. dan dari sebagian harta yang Kami anugerahkan kepada mereka, mereka mengeluarkan zakat yang wajib maupun yang sunnah dari harta mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3-4. (Orang-orang yang bertakwa itu adalah) orang-orang yang beriman kepada perkara gaib, yaitu segala sesuatu yang tidak bisa ditangkap oleh panca indera dan tersembunyi, yang diberitakan oleh Allah atau Rasulullah seperti hari Akhir. Dan orang-orang yang mendirikan salat, yakni menunaikannya sesuai ketentuan syariat yang meliputi syarat, rukun, wajib dan sunnahnya. Dan mereka adalah orang-orang yang gemar menginfakkan sebagian rezeki yang mereka terima dari Allah, baik yang sifatnya wajib seperti zakat, maupun yang tidak wajib seperti sedekah, demi mengharap pahala dari Allah. Mereka juga yang beriman kepada wahyu yang Allah turunkan kepadamu –wahai Nabi- dan wahyu yang Dia turunkan kepada para nabi -'alaihimussalām- sebelum kamu, tanpa membeda-bedakan di antara mereka. Dan mereka juga beriman secara tegas akan adanya akhirat beserta ganjaran dan hukuman yang ada di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ Makna iman secara bahasa adalah meyakini; sedangkan makna ghaib adalah semua yang dikabarkan oleh Rasulullah yang tidak bisa dicerna oleh akal seperti: tanda-tanda kiamat, azab kubur, hari kebangkitan, shirath, mizan, surga, dan neraka. Disebutkan dalam hadist yang dikeluarkan oleh Imam Muslim dari Umar dari Nabi bahwa beliau bersabda: “iman adalah engkau beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya dan hari akhir dan engkau beriman kepada takdir yang baik maupun yang buruk. “ وَيُقِيمُونَ الصَّلَاةَ Iqamah ash-sholah adalah mengerjakannya dengan memenuhi segala rukun-rukunnya, sunnah-sunnahnya, dan hai’ah-hai’ahnya dalam waktu yang telah ditetapkan. Menurut Ibnu Abbas dalam kalimat (ويقيمون الصلاة) yakni sholat wajib lima waktu. وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ Menurut Ibnu Ibnu abbas kata infaq disini ialah zakat yang dikeluarkan dari harta mereka; sedangkan menurut Ibnu Jarir maksud dari infaq adalah infaq dalam arti luas yang mencakup zakat dan sedekah tanpa membedakan infaq untuk kerabat atau yang lainnya, yang wajib maupun yang sunnah, dan inilah pendapat yang benar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Qur'an senantiasa memuji orang-orang yang menginfakkan harta mereka dan mengajak kepada pentingnya infaq; karena infaq adalah sebaik-baiknya cara untuk mengangkat derajat suatu kaum dan menjadi sebab keselamatan mereka dari berbagai musibah dan bencana yang bermacam-macam : seperti musibah kemiskinan, kebodohan, dan berbagai jenis penyakit menular, harta yang dikeluarkan akan menutupi kebutuhan orang-orang faqir, dengannya juga lembaga-lembaga pendidikan akan mendapatkan bantuan dana untuk melancarkan kegiatan mereka, dan dengan infaq itu dapat dibangun sejumlah bangunan pusat kesehatan masyarakat, dan berbagai macam kebutuhan massal lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ciri-ciri orang yang bertakwa ada 6, yaitu membenarkan secara mutlak dan sempurna semua sesuatu yang ghaib, seperti malaikat, jin, hari kebangkitan, hari perhitungan, dan hal lain tentang kengerian hari kiamat; melaksanakan shalat secara sempurna dengan rukun dan syaratnya, khusyu’ di dalamnya karena Allah dan menjaganya sesuai waktunya; menafkahkan apa yang diberikan oleh Allah secara baik dan halal untuk zakat yang telah diwajibkan, untuk sedekah di jalan Allah, serta nafkah wajib untuk kerabat dan keluarga lainnya;"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) orang-orang yang beriman pada yang ghaib} hal yang ghaib bagi mereka, yang dikabarkan oleh Allah atau Rasulullah SAW {menegakkan shalat} dan orang-orang yang menjaga shalat mereka tepat pada waktunya sesuai yang disyari’atkan Allah {dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka} dan orang-orang yang menunaikan zakat dan bersedekah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Yaitu mereka yang beriman kepada yang ghaib.” Hakikat keimana adalah pembenaran yang total terhadap apa pun yang dikabarkan oleh para Rasul, yang meliputi ketundukan anggota tubuh. Perkara keimanan itu tidak hanya kepada hal-hal yang dapat diperoleh oleh panca indera semata, karena hal ini tidaklah mampu membedakan antara seorang Muslim dengan seorang kafir, namun perkara yang dianggap dalam keimanan kepada yang ghaib adalah yang tidak kita lihat dan tidak kita saksikan, namun kita hanya mengimaninya saja karena ada kabar dari Allah dan kabar dari RasulNya. Itulah keimanan yang mampu membedakan antara seorang Muslim dengan seorang kafir, karena itulah pembenaran yang utuh terhadap Allah dan RasulNya. Maka seorang yang beriman adalah yang mengimani segala sesuatu yang dikabarkan olh RasulNya, baik yang dia saksikan ataupun tidak, baik dia mampu memahami dan masuk akalnya, ataupun akal dan pemahamannya tidak mampu mencernanya. Berbeda dengan orang-orang atheis yang mendustakan perkara-perkara ghaib, karena akal-akal mereka yang terbatas lagi lalai tidak sampai kepadanya, akhirnya mereka mendustakan apa yang tidak mampu dipahami oleh ilmu mereka, yang pada akhirnya rusaklah akal-akal mereka, sia-sialah harapan mereka, dan (sebaliknya) bersihlah akal kaum Mukminin yang membenarkan lagi mengambil hidayah dengan petunjuk Allah. Dan termasuk dalam keimanan kepada yang ghaib adalah keimanan kepada seluruh kabar yang diberitakan oleh Allah dari hal-hal ghaib yang terdahulu maupun yang akan datang kondisi-kondisi Hari Akhirat, hakikat sifat-sifat Allah dan bentuk-bentuknya, dan kabar yang diberikan oleh RasulNya tentang semua itu; dimana mereka beriman kepada sifat-sifat Allah dan keberadaanya, dan mereka meyakininya walaupun mereka tid ak mampu memahami cara dan bentuknya. Kemudian Allah berfirman, ” yang mendirikan shalat”. Dia tidak berfirman yang mengerjakan shalat, atau menjalankan shalat, karena sesungguhnya tidaklah cukup hanya sekedar menjalankan dengan bentuknya yang lahir saja, karena mendirikan shalat yang dimaksud adalah mendirikan shalat secara lahir dengan menyempurnakan rukun-rukunnya, wajib-wajibnya, dan syarat-syaratnya, dan juga mendirikannya secara bathin dengan mendirikan ruhnya yaitu dengan menghadirkan hati padanya, merenungi apa yang dibaca dan mengamalkannya. Yaitu shalat yang memperoleh ganjaran. Maka tidak ada ganjaran bagi seorang hamba dari shalatnya kecuali apa yang dia pahami darinya, dan termasuk dalam shalat di sini adalah yang wajib maupun yang sunnah. Kemudian Allah berfirman, “ dan menafkahkan sebagian rizki yang kami anugerahkan kepada mereka.” Termasuk didalamnya nafkah-nafkah yang wajib, seperti zakat, nafkah atas istri, keluarga dan para budak dan sebagainya., dan nafkah-nafkah yang dicintai dengan segala jalan kebaikan. Dan tidak disebutkannya hal –hal yang diinfakkan karena banyaknya sebab-sebabnya dan bermacam-macam penerimaanya, dan karena nafkah itu pada dasarnya adalah sebuah ibadah kepada kepada Allah. Dia juga disebutkan dengan kata “Dari” yang menunjukkan makna sebagian, demi untuk mengingatkan mereka bahwasanya Allah tidak menghendaki dari mereka kecuali sebagian kecil saja dari harta-harta mereka yang tidak akan memudaratkan mereka dan tidak akan pula memberatkan mereka, bahkan mereka akan mengambil manfaat dari infak mereka tersebut, dan saudara-saudara mereka juga akan dapat mengambil manfaat darinya. Dan dalam firman Allah, “ rizki yang kami anugerahkan kepada mereka” terkandung sebuah isyarat bahwa yang ada di hadapanmu ini tidaklah diperoleh dari kekuatan dan kepemilikanmu, akan tetapi itu semua adalah rizki Allah yang dianugerahkan kepada kalian dan diberikanNya nikmat itu atas kalian. Maka karena nikmat yang diberikan oleh Allah atas kalian dan kemurahanNya terhadap kalian dibanding banyak hamba-hambaNya yang lain, maka bersyukurlah kepadaNya dengan mengeluarkan sebagian nikmat yang diberikan atas kalian tersebut, dan hiburlah saudara-saudara kalian yang tidak memilikinya. Dan sangatlah banyak sekali Allah menyatukan (menyandingkan) shalat dengan zakat dalam alQur’an, karena shalat itu mengandung keikhlasan hanya kepada Dzat yang disembah, sedangkan zakat dan nafkah mengandung berbuat baik kepada sesama hamba-hambaNya. Maka tanda dari kebahagiaan seorang hamba adalah keikhlasannya kepada Dzat yang disembah dan usahanya dalam membderikan manfaat kepada manusia, sebagaimana tanda kesengsaraan seorang hamba adalah tidak adanya kedua perkara tersebut pada dirinya, tidak ada keikhlasan dan tidak pula perbuatan baik kepada sesama."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : يُؤۡمِنُونَ بِٱلۡغَيۡبِ Yu’minuuna bil ghoib yaitu mereka yang membenarkan dengan penuh keyakinan adanya sesuatu yang ghoib dimana tidak bisa dirasakan oleh panca indera seperti Rabb yang Maha Tinggi lagi Maha suci, baik dzatNya ataupun sifatNya, malaikat, hari kebangkitan, surga dan kenikmatannya, serta neraka dan adzab di dalamnya. وَيُقِيمُونَ ٱلصَّلَوٰةَ Wa yuqiimuunash sholaat artinya mereka yang senantiasa melaksanakan sholat lima waktu pada waktunya dengan memperhatikan syarat, rukun, dan sunah-sunahnya, serta mengerjakan sholat sunah rawatib dan selainnya. وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ Wa mimmaa rozaqnaahum yunfiquun yakni mereka menginfakkan sebagian harta yang diberikan oleh Allah. Hal itu dilakukan dengan cara mengeluarkan zakat hartanya, dan berinfak untuk keperluan dirinya, istrinya, anaknya, dan orangtuanya. Serta bersedekah untuk fakir miskin. Makna ayat : Allah Ta’ala dalam ayat-ayat di atas menyebutkan tiga sifat orang-orang yang bertakwa, yaitu beriman kepada hal yang ghaib, mendirikan sholat, dan menunaikan zakat, serta beriman terhadap kitab-kitab Allah dan iman kepada hari akhir Pelajaran dari ayat : Seruan kepada kaum mukminin dan motivasi untuk mereka agar memiliki sifat golongan yang mendapat hidayah dan keberuntungan, agar menempuh jalan yang mereka lalui sehingga mendapatkan hidayah dan beruntung di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 3: Allah mengabarkan bahwa di antara sifat dari mereka orang-orang yang bertaqwa adalah mereka mengimani sesuatu yang ghaib, dan ghaib pengertiannya adalah apa yang tidak dapat di indera serta dilihat dari apa yang disebutkan oleh Allah akan kaifiyat dzat-Nya dan urusan-urusan akhirat serta barzakh. Di antara yang ghaib adalah kabar-kabar akan umat-umat terdahulu dan para nabi mereka. Arsy, malaikat, jin dan selainnya (termasuk yang ghaib). Di antara sifat mereka yang bertaqwa adalah mereka senantiasa menjaga shalat-shalat mereka di waktu-waktu yang telah ditentukan bersama dengan jama’ah kaum muslimin, kecuali mereka yang memiliki udzur yang Allah berikan juga udzur bagi mereka. mereka mengerjakan shalat dengan tenang dan berwibawa dengan menghadirkan hati, khusyuk, tunduk dan memperbanyak dari doa-doa mereka yang penting serta memiliki keutamaan. Di antara sifat mereka adalah mereka menginfakkan atas apa yang telah Allah berikan dari harta, mereka keluarkan untuk zakat yang wajib, bersedekah yang dianjurkan untuk mendekatkan diri kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Iman artinya kepercayaan yang teguh yang disertai dengan ketundukan dan penyerahan jiwa atau pengakuan di hati yang membuahkan ketundukkan di lisan (dengan iqrar) dan pada anggota badan. Tanda-tanda adanya iman ialah mengerjakan apa yang dikehendaki oleh iman itu. Yang ghaib ialah yang tidak dapat ditangkap oleh pancaindera. Percaya kepada yang ghjaib yaitu, mengi'tikadkan adanya yang maujud yang tidak dapat ditangkap oleh pancaindera, karena ada dalil yang menunjukkan adanya, seperti: adanya Allah, malaikat-malaikat, hari akhirat dan sebagainya. Mengapa beriman itu kepada yang ghaib? Jawabnya adalah karena beriman kepada sesuatu yang disaksikan atau dirasakan panca indera tidak dapat membedakan mana muslim dan mana kafir. Oleh karena itu, orang mukmin beriman kepada semua yang diberitakan Allah Ta'ala dan rasul-Nya, baik mereka menyaksikannya atau tidak, baik mereka memahaminya atau tidak dan baik dijangkau oleh akal mereka maupun tidak. Abdullah bin Mas'ud radhiyallahu 'anhu berkata, \"Tidak ada keimanan yang diimani oleh orang mukmin yang lebih utama daripada keimanannya kepada yang ghaib\", lalu Ibnu Mas'ud membaca ayat \"Alladziina yu'minuuna bil ghaib\". Yakni di samping beriman kepada yang ghaib, mereka buktikan dengan mendirikan shalat. Shalat menurut bahasa 'Arab: doa, menurut istilah syara' ialah ibadat yang sudah dikenal, yang dimulai dengan takbir dan diakhiri dengan salam. Shalat merupakan pembuktian terhadap pengabdian dan kerendahan diri kepada Allah Subhaanahu wa Ta'aala. Mendirikan shalat ialah menunaikannya dengan teratur, dengan melangkapi syarat-syarat, rukun-rukun dan adab-adabnya, baik yang lahir ataupun yang batin, seperti khusu', memperhatikan apa yang dibaca dan sebagainya. Shalat yang seperti inilah yang dapat mencegah dari perbuatan keji dan mungkar. Rezki: segala yang dapat diambil manfaatnya. menafkahkan sebagian rezki, ialah memberikan sebagian dari harta yang telah direzkikan oleh Allah tersebut kepada orang-orang yang disyari'atkan oleh agama memberinya, baik yang wajib maupun yang sunat. Contoh pengeluaran yang wajib adalah zakat, menafkahi anak dan istri, kerabat (seperti orang tua) dan budak, sedangkan yang sunat adalah semua jalan kebaikan. Disebutkan \"sebagian rezeki\" menunjukkan bahwa yang Allah inginkan hanyalah sedikit dari harta mereka; tidak memadharatkan mereka dan tidak membebani, dan dipakainya kata-kata \"rezeki\" untuk mengingatkan bahwa harta yang ada pada mereka merupakan rezeki dari Allah yang menghendaki untuk disyukuri dengan menyisihkan sebagiannya berbagi bersama saudara-saudara mereka yang tidak mampu. Shalat dan zakat sangat sering disebutkan secara bersamaan di dalam Al Qur'an, karena shalat mengandung sikap ikhlas kepada Allah Ta'ala, sedangkan zakat dan infak mengandung sikap ihsan terhadap sesama hamba Allah Ta'ala. Oleh karena itu, tanda kebahagiaan seorang hamba adalah dengan bersikap ikhlas kepada Allah dan berusaha memberikan manfa'at kepada makhluk, sebagaimana tanda celakanya seorang hamba adalah ketika tidak adanya kedua ini, yakni ikhlas kepada Allah Ta'ala dan berbuat ihsan kepada sesama hamba Allah Ta'ala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 3",
    "description": "Orang-orang yang bertakwa itu adalah mereka yang beriman kepada hal-hal yang gaib, yang tidak tampak dan tidak dapat dijangkau oleh akal dan indra mereka, seperti Allah, malaikat, surga, neraka, dan lainnya yang diberitakan oleh Allah dan rasul-Nya. Pada saat yang sama, sebagai bukti keimanan itu, mereka beribadah kepada Allah dengan melaksanakan salat, secara sempurna berdasarkan tuntunan Allah dan rasul-Nya, khusyuk serta memperhatikan waktu-waktunya, dan mereka juga menginfakkan di jalan kebaikan sebagian rezeki berupa harta, ilmu, kesehatan, kekuasaan, dan hal-hal lainnya yang bermanfaat yang kami berikan kepada mereka, semata-mata sebagai bentuk ketaatan kepada Allah dan mencari keridaan-Nya. Dan ciri-ciri lainnya dari orang-orang yang bertakwa adalah mereka yang beriman kepada apa-apa yang diturunkan dari Allah kepadamu, wahai nabi Muhammad, berupa Al-Qur'an dan adz-dzikr (hadis), dan kitab-kitab yang telah diturunkan sebelum engkau, seperti taurat, zabur, injil, dan suhuf-suhuf (lembaran-lembaran) yang tidak seperti kitab, dengan tidak membeda-bedakannya, sebab risalah Allah pada mulanya satu, dan mereka yakin akan adanya kehidupan di akhirat setelah kehidupan di dunia ini, dengan penuh keyakinan di dalam hati yang dibuktikan secara lisan dan perbuatan."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini merupakan penjelasan dari ayat sebelumnya tentang orang-orang yang bertaqwa. Allah ta’ala merinci beberapa karakteristik orang-orang yang bertaqwa tersebut dalam ayat ini, diantaranya : Pertama, iman kepada yang gaib Abu ja’far ar-Razi menceritakan, dari Abdulloh, ia mengatakan, “Iman itu adalah kebenaran”. Ali bin abu Thalhah dan juga yang lainnya menceritakan, dari Ibnu Abbas rhodiyallohu ‘anhu, ia mengatakan; “Mereka beriman (maksudnya adalah) mereka membenarkan”. Sedangkan Mu’ammar mengatakan dari az-Zuhri “Iman adalah amal”. Abu ja’far ar-Razi juga mengatakan dari Ar-Robi’ bin Anas, “iman itu adalah takut”. Seperti firman-Nya : إِنَّ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ لَهُمْ مَغْفِرَةٌ وَأَجْرٌ كَبِيرٌ \"Sesungguhnya orang-orang yang takut kepada Tuhannya Yang tidak nampak oleh mereka, mereka akan memperoleh ampunan dan pahala yang besar\". (QS. Al-Mulk : 12) Ibnu jarir mengatakan makna yang lebih daik dan tepat dari iman adalah mereka harus mensifati diri dengan iman kepada yang ghaib baik melalui ucapan maupun perbuatan, kata iman itu mencakup keimanan kepada Allah, kitab-kitab-Nya, dan Rosul-rosul-Nya sekaligus membenarkan pernyataan itu melalui amal perbuatan. Demikianlah makna iman yang diartikan dalam istilah syariat yang mencakup keyakinan, ucapan dan amal perbuatan. Hal ini merupakan pendapat yang menjadi pegangan mayoritas ulama, bahkan telah dinyatakan secara Ijma’ oleh Imam Syafii, Imam Ahmad bin Hanbal, Abu Ubaidah, dan lain-lain yang menyatakan : أن الإيمان قول وعمل يزيد وينقص “Bahwa iman adalah pembenaran dengan ucapan dan amal perbuatan yang dapat bertambah dan berkurang”. Mengenai hal ini banyak hadits-hadits dan atsar yang membahasnya. Adapun makna yang ghaib dalam ayat ini terdiri dari banyak hal yang dinyatakan para ulama diantaranya : Abu ja’far ar-Razi dari Abi Al-‘Aliyah mengatakan “beriman kepada Allah, para malaikat, kitab-kitab, Rosul-rosul, hari akhir, surga, neraka, dan pertemuannya. Dan beriman akan adanya kehidupan setelah kematian dan hari kebangkitan” dan semua hal tersebut merupakan sesuatu yang ghaib. Berkata As-Sadi dari abi Malik dari Abi Sholih dari Ibnu Abbas dari Muroh al-Hamdani dari Ibnu Mas’ud dari salah seorang sahabat Nabi sholallohu ‘alaihi wasallam “adapun hal yang ghaib adalah sesuatu yang tidak diketahui seorang hamba tentang masalah surge, masalah neaka, dan apa-apa yang disebutkan dalam al-quran. Ibnu abbas juga meriwayatkan, yang dimaksud yang ghaib adalah sesuatu yang datang dari Allah ta’ala. Beberapa mufasir mengatakan makna yang ghaib dengan makna yang Bergama, ada yang memaknainya taqdir, islam, dan masih banyakpendapat yang lainnya. Said bin Mansur berkata dari hadits yang diriwayatkan Abdurrahmna bin Yazid,dia berkata : “kami sedang duduk bersama Ibnu Mas’ud, maka kami menyebut sahabat-sahabat nabi yang sudah berlalu, maka berkatalah Abdulloh :, “sesungguhnya perintah nabi Muhammad sholallohu ‘alaihi wasallam ada diantara kita dan kita telah melihatnya, Demi Dzat yang tidak ada tuhan selain-Nya, tidak ada seorangpun yang lebih baik imannya, daripada iman kepada yang ghaib. Kemudian beliau membaca : الم ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ….. ….وَأُولَئِكَ هُمُ الْمُفْلِحُونَ (QS. Al-Baqarah ayat 1-5) Imam Ahmad meriwayatkan dari Ibnu Muhairiz, ia ,menceritakan قلت لأبي جمعة : حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال : نعم ، أحدثك حديثا جيدا : تغدينا مع رسول الله صلى الله عليه وسلم ومعنا أبو عبيدة بن الجراح ، فقال : يا رسول الله ، هل أحد خير منا ؟ أسلمنا معك وجاهدنا معك . قال : نعم ، قوم من بعدكم يؤمنون بي ولم يروني . Aku pernah berkata kepada Abi Jum’ah: “beritahukan kepada kami sebuah hadits yang engkau dengar dari Rosululloh sholallohu ‘alaihi wasallam ?”. ia pun berkata, “baiklah, aku akan beritahukan sebuah hadits kepadamu. Kami pernah makan siang bersama Rosululloh sholallohu ‘alaihi wasallam, dan bersama kami terdapat Abu Ubaidah bin al-Jarrah, lalu ia bertanya : “Ya Rosululloh, adakah seseorang yang lebih baik dari kami? Sedangkan kami telah masuk Islam bersamamu dan berjihad bersamamu pula?.” Beliau menjawab : “Ya, ada. Suatu kaum setelah kalian yang beriman kepadaku padahal mereka tidak melihatku” Kedua, mendirikan sholat. Ibnu Abbas mengatakan, “وَيُقِيمُونَ الصَّلَاةَ” berarti mendirikan sholat dengan segala kewajibannya. Ad-Dhohak meriwayatkan dari Ibnu Abbas, mendirikan sholat berarti mengerjakan dengan sempurna ruku’,sujud, bacaan, serta penuh kekhusyuan. Qotadah mengatakan, mendirkan sholat berarti berusaha mengerjakannya tepat waktu, berwudhu, ruku’, dan bersujud. Muqotil bin Hayyan mengatakan, “mendirikan sholat” berarti menjaga untuk selalu mengerjakannya pada waktunya, menyempurnakan wudhuu, ruku’, sujud, bacaan al-Quran, tasyahud, serta membaca sholawat kepada Rosululloh sholallohu ‘alaihi wasallam. Demikian itulah makna “mendirikan sholat”. Ketiga, menafkahkan sebagian rizki yang dianugrahkan kepadanya. Ali bin Abi Thalib dan yang lainnya menceritakan, dari Ibnu Abbas, ia mengatakan “maksud menafkahkan harta adalah mengeluarkan zakat dari harta kekayan yang dimilikinya”. As-Suddi menceritakan dari Ibnu Abbas, dari Ibnu Mas’ud, dan dari beberapa shahabat Rosululloh, ia mengatakan maksud ayat ini adalah memberi nafkah kepada keluarganya. Hal ini sebelum adanya ayat yang menjelaskan tentang kewajiban zakat, yang dikemudian hari turun dalam 7 ayat surat At-Taubah. Ibnu jarir menyimpulkan bahwa ayat ini bersifat umum mencakup segala bentuk zakat dan infaq. Ia mengatakan “sebaik-baik tafsir mengenai sifat kaum itu adalah hendaklah ereka menunaikan semua kewajiban yang berada pada harta benda mereka, baik berupa zakat ataupun memberi nafkah orang-orang yang harus ia jamin dari kalangan keluarga, anak-anak dan yang lainnya dari kalangan orang-orang yang wajib ia nafkahi. Karena hubungan kekerabatan, kepemilikan (budak) atau faktor lainnya. Yang demikian itu karena Allah ta’ala mensifati dan memuji mereka dengan hal itu secara umum. Setiap zakat dan infak merupakan sesuatu yang sangat terpuji. Ibnu Katsir berkata : “seringkali Allah ta’ala menyandingkan antara sholat dan zakat. Sholat merupakan hak Allah sekaligus bentuk ibadah kepada-Nya. Dan ia mencakup pengesaan, penyanjungan, pengharapan, pemujian, pemanjatan doa, serta tawakkal kepada-Nya. Sedangkan indak (zakat) merupakan salah satu bentuk perbuatan baik kepada sesame makhluk dengan memberi manfaat kepada mereka. Dan yang paling berhak mendapatkannya adalah keluarga, kaum kerabat, serta orang-orang dekat. Dengan demikian segala bentuk nafkah dan zakat yang wajib, tercakup dalam firman-Nya : وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ “Dan menafkahkan sebahagian rezeki yang Kami anugerahkan kepada mereka”. Dan hal itu juga disebutkan dalam hadits shohih bukhori dan muslim dari Ibnu Umar, bahwasanya Rosululloh sholallohu ‘alaihi wasallam bersabda : بني الإسلام على خمس : شهادة أن لا إله إلا الله ، وإقام الصلاة ، وإيتاء الزكاة ، وصوم رمضان ، وحج البيت “islam didirikan di atas lima landasan, bersaksi bahwa tidak ada ilah selain Allah dan Muhammad adalah rosululloh, mendirikan sholat, menunaikan zakat, berpuasa di bulan Ramadan, serta melaksanakan ibadah haji.” (HR. Bukhori dan Muslim)"
  }
]