[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebutkan -wahai Rasul- kepada manusia ketika Allah ta'ala berfirman kepada para malaikat: “Sesungguhnya Aku akan menjadikan di muka bumi sekumpulan makhluk yang sebagian mereka akan menggantikan sebagian lainnya untuk memakmurkannya.” Para malaikat berkata: “wahai Tuhan kami beritahukanlah kepada kami dan Tunjukilah kami apa hikmah dibalik penciptaan mereka itu, sedangkan karakter mereka itu melakukan kerusakan di muka bumi dan menumpahkan darah secara dzolim dan sewenang-wenang, sementara Kami selalu taat terhadap perintah-Mu, kami menyucikan-Mu dengan penyucian yang sesuai dengan sifat-sifat-Mu yang terpuji dan kebesaran-Mu, dan kami mengagungkan-Mu dengan seluruh sifat kesempurnaan dan keagungan?”. Allah menjawab mereka dengan firman-Nya: “Sesungguhnya aku lebih mengetahui hal-hal yang tidak kalian ketahui dari apa yang mengandung kemaslahatan besar pada penciptaan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Allah -Subḥānahu wa Ta'ālā- memberitahukan bahwa Dia telah berfirman kepada para Malaikat, bahwasanya Dia akan menciptakan manusia untuk ditempatkan di muka bumi secara silih berganti. Tugas utama mereka adalah memakmurkan bumi atas dasar ketaatan kepada Allah. Lalu para Malaikat bertanya kepada Tuhan mereka -dengan maksud meminta bimbingan dan penjelasan- tentang hikmah di balik penempatan anak cucu Adam -'alaihissalām- sebagai khalifah di muka bumi, sedangkan mereka akan membuat kerusakan di sana dan menumpahkan darah secara semena-mena. Para malaikat itu mengatakan, “Sementara kami ini senantiasa patuh kepada-Mu, mensucikan dan memuji-Mu, serta menghormati keagungan dan kesempurnaan-Mu. Kami tidak pernah letih dalam melakukan hal itu.” Allah menjawab pertanyaan mereka dengan firman-Nya, “Sesungguhnya Aku mengetahui apa yang tidak kamu ketahui tentang adanya hikmah-hikmah besar di balik penciptaan mereka dan tujuan-tujuan besar di balik penetapan mereka sebagai khalifah di muka bumi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Wahai Rasulullah, sebutkanlah kepada hamba-hamba, ketika Tuhanmu berfirman kepada para malaikat: “Aku akan menciptakan di bumi suatu kaum yang silih berganti untuk memakmurkan bumi.” Kemudian para malaikat mempertanyakan hikmah dari penciptaan kaum tersebut, padahal sebagian mereka akan berbuat kerusakan di bumi dengan berbagai kemaksiatan dan menumpahkan darah tanpa alasan yang benar; jika tujuannya adalah agar mereka menyembah Engkau, maka kami telah senantiasa berzikir dan mengagungkan-Mu serta menyucikan-Mu dari segala kekurangan. Lalu Allah menjawab mereka bahwa Dia mengetahui apa yang tidak diketahui para malaikat tentang tujuan penciptaan kaum ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. إِنِّي جَاعِلٌ فِي الْأَرْضِ خَلِيفَةً (Ingatlah ketika Tuhanmu berfirman kepada para Malaikat: “Sesungguhnya Aku hendak menjadikan seorang khalifah di muka bumi”). Makna dari (الخليفة) adalah penerus bagi para pendahulu (malaikat); dan yang dimaksud dengan khalifah dalam ayat ini adalah Nabi Adam. Kalimat ini ditujukan oleh Allah kepada pada malaikat bukan bertujuan untuk bermusyawarah atau meminta pendapat akan tetapi untuk mengeluarkan apa yang ada dalam diri mereka. أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا (“Mengapa Engkau hendak menjadikan (khalifah) di bumi itu orang yang akan membuat kerusakan padanya) Yakni dengan melakukan kesyirikan dan kemaksiatan. Para ulama berpendapat bahwa perkataan ini berasal dari ilmu yang diajarkan oleh Allah kepada malaikat. Karena mereka pada dasarnya tidak mengetahui hal yang ghaib. وَيَسْفِكُ الدِّمَاءَ(dan menumpahkan darah) Yakni dengan menyakiti dan membunuh. وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ (padahal kami senantiasa bertasbih dengan memuji Engkau dan mensucikan Engkau?”) Yakni kami senantiasa memuji Engkau dan mensucikan Engkau dari apa yang tidak layak untuk dinisbahkan kepada-Mu. قَالَ إِنِّي أَعْلَمُ مَا لَا تَعْلَمُونَ(Tuhan berfirman: “Sesungguhnya Aku mengetahui apa yang tidak kamu ketahui”) Qatadah berpendapat dalam tafsir ayat ini bahwa : Allah mengetahui bahwa akan ada diantara khalifah ini yang akan menjadi nabi-nabi dan rasul-rasul, orang-orang sholeh, dan penghuni surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan ingatkanlah kaummu wahai Muhammad ketika Tuhanmu berfirman kepada para malaikat: “Sesungguhnya aku hendak menjadikan seorang khalifah di muka bumi, yaitu Adam. Aku mewakilkan kepadanya urusan pemakmuran bumi dan pelaksanaan hukum-hukumKu”. Lalu para malaikat berkata dalam diri mereka sendiri: “Bukankah Engkau akan menciptakan di dalamnya seseorang yang kelak akan melakukan kerusakan dengan berbuat kemusyrikan dan kemaksiatan?”. Sungguh mereka telah mengetahui hal itu karena telah diajarkan oleh Allah dengan suatu cara tertentu. Maksud ucapan mereka adalah “Apakah Engkau hendak menciptakan di dalamnya orang yang mengalirkan darah yang haram dengan saling membunuh, menyakiti dan bertikai, sedangkan kami adalah ciptaan-ciptaan yang selalu bersyukur, memujiMu dan mensucikanMu dari hal-hal yang tidak sesuai denganMu?”. Kemudian Allah berfirman: “Aku lebih mengetahui tentang sesuatu yang tidak kalian ketahui, yaitu akan ada di antara para khalifah itu, para nabi dan orang-orang shalih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Tuhanmu berfirman kepada para malaikat,“Sesungguhnya Aku hendak menjadikan khalifah di bumi”} manusia yang mengkhalifahi satu sama lain {Mereka berkata,“Apakah Engkau hendak menjadikan orang yang merusak dan menumpahkan} dan meneteskan {darah di sana, sedangkan kami bertasbih memujiMu} kami menyucikanMu seraya memujiMu {dan menyucikanMu”} kami mengagungkan dan menyucikan namaMu dari hal-hal yang tak pantas bagiMu{Allah berfirman, “Sesungguhnya Aku mengetahui apa yang tidak kalian ketahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Ini adalah permulaan penciptaan nabi Adam alaihissalam, bapak moyang manusia dan keutamaan beliau, dan bahwasanya Allah ta’ala ketika ingin menciptakannya, Allah mengabarkan kepada para malaikat tentang hal tersebut, dan bahwasanya Allah ta’ala menjadikannya sebagai khlifah di bumi, lalu para malaikat berkata, ”mengapa Engkau hendak menjadikan (khalifah) di bumi itu orang yang akan membuat kerusakan padanya dengan kemaksiatan-kemaksiatan dan menumpahkan darah?” hal ini merupakan uraian secara khusus setelah disebutkan secara umum demi menjelaskan besarnya kerusakan akibat pembunuhan itu. Dan hal itu adalah sebatas dugaan para malaikat, bahwasanya khalifah yang akan di ciptakan di bumi itu akan melakukan hal-hal yang mereka sebutkan, lalu mereka menyucikan Sang Pencipta dari hal itu semua dan mengagungkanNya, kemudian mereka mengungkapakan bahwasanya mereka dalam setiap kondisi selalu beribadah kepadaNya tanpa berbuat kerusakan, maka mereka berkata, ”padahal kami senantiasa bertasbih dengan memujiMu, ” maksudnya, kami menyucikanMu dengan segala kesucian yang sesuai dengan segala pujian dan keagunganMu, ”dan menyucikanMu, ” kemungkinan artinya adalah menyucikanMu, jadi huruf lam mengandung maksud pengkhususan dan keikhlasan, atau mungkin juga dapat berarti kami menyucikan diri kami karenaMu yaitu membersihkannya dengan cara menghiasinya dengan akhlak-akhlak yang mulia, seperti mencintai Allah, takut kepadaNya, dan mengagungkanNya, dan membersihkannya dari akhlak-akhlak yang hina. Selanjutnya, ”Dia berkata, ” yakni, Allah berkata kepada malaikat, ”sesungguhnya Aku mengetahui, ” dari khalifah ini, ”apa yang kamu tidak ketahui, ” karena perkataan kamu adalah menurut apa yang kamu sangkakan, sedangkan Aku mengetahui yang Nampak maupun yang tersembunyi, dan Aku mengetahui bahwasanya kebaikan yang di peroleh dari penciptaan khalifah ini adalah lebih besar berlipat ganda sekalipun termasuk di dalamnya ada pula keburukan-keburukan. Dan sekiranya saja dalam hal itu tidak ada kebaikan kecuali bahwa Allah hendak memilih di antara mereka para Nabi, orang-orang shiddiq, para syuhada, dan orang-orang yang shalih, juga agar ayat-ayat Allah Nampak jelas bagi makhluk, lalu penyembahan kepada Allah menjadi ada yang tidak mungkin ada tanpa penciptaan khalifah tersebut seperti berjihad atau lain-lainnya, dan agar Nampak sesuatu yang di rahasiakan oleh insting orang-orang yang mukallaf, berupa kebaikan maupun kejahatan dengan ujian, dan agar jelas antara musuhNya dari waliNyadan golonganNya dari yang memerangiNya, dan agar Nampak pula apa yang tersirat oleh jiwa iblis dari kejahatan yang terpatri padanya dan menjadi karakternya, niscaya itu semua sudah cukup sebagai hikmah-hikmah yang agung yang tidak perlu mencari hikmah selainnya. Kemudian ketika perkataan para malaikat menunjukkan keutamaan mereka atas khalifah yang akan di ciptakan oleh Allah di muka bumi, maka Allah hendak menjelaskan kepada mereka tentang keutamaan nabi Adam yang membuat mereka mengetahui keutamaan Allah, kesempurnaan hikmah, dan ilmuNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Al-Malaaikah : Bentuk plural (jamak) dari Mal’akun dan dijadikan ringan menjadi malakun. Mereka adalah makhluk yang berada di alam ghaib, dimana Nabi shallallahu ‘alaihi wasallam memberitakan bahwa Allah menciptakan mereka dari cahaya. Al-Kholiifah : Orang yang menggantikan selainnya, dan yang dimaksud dalam ayat di sini adalah Nabi Adam ‘alaihissalam يُفۡسِدُ فِيهَا (Yufsidu fiihaa) : Bentuk kerusakan di muka bumi adalah dengan perbuatan kufur dan melakukan kemaksiatan. يَسۡفِكُ (Yasfiku) : Artinya adalah mengalirkan darah dengan membunuh atau melukai. نُسَبِّحُ بِحَمۡدِكَ (Nusabbihu bihamdika) : Kami mengatakan “Subhanallah wabihamdihi” Maha Suci Allah dengan segala pujian untukNya. Yang dimaksud dengan at-tasbiih adalah menyucikan Allah dari sesuatu yang tidak pantas untukNya. وَنُقَدِّسُ لَكَۖ (Wa Nuqoddisu laka) : Yaitu kami mensucikan Engkau dari hal-hal yang tidak sesuai dengan Mu. At-Taqdiis maknanya adalah membersihkan serta menjauhkan sesuatu yang tidak sepantasnya. Huruf lam pada kata Laka adalah tambahan sebagai penguat arti, karena kata kerja Qoddasa bisa menarik obyek kata dengan sendirinya tanpa bantuan huruf menjadi Qoddasahu. Makna ayat : Allah Ta’ala memerintahkan rasulNya agar mengingat firmanNya kepada malaikat bahwasanya Dia menjadikan di muka bumi seorang kholifah untuk menjalankan hukum-hukumNya. Lantas para malaikat bertanya-tanya dengan kekhawatiran bahwa khalifah ini akan menjadi orang yang menumpahkan darah serta berbuat kerusakan di muka bumi dengan kekufuran dan maksiat sebagai qiyas dari penciptaan jin yang terjadi apa yang mereka khawatirkan. Maka Allah memberi tahu kepada mereka bahwa Dia lebih mengetahui hikmah serta kemaslahatan yang tidak diketahui para malaikat. Maksud dari pengingat ini adalah tambahan dalil yang menunjukkan wujud keberadaan Allah Ta’ala, kekuasaanNya, ilmuNya, serta hikmahNya yang mengharuskan keimanan kepadaNya dan hanya beribadah kepadaNya saja. Pelajaran dari ayat : 1. Pentingnya bertanya bagi orang yang tidak tahu kepada orang lain yang mengetahui. 2. Tidak adanya 3. Pengetahuan tentang awal mula penciptaan makhluk 4. Kemuliaan Nabi Adam ‘alaihissalam dan keutamaan beliau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 30: Ingatlah wahai nabi Allah pada hari di mana Tuhanmu berkata kepada malaikat bahwasanya Allah akan menjadikan di bumi Khalifah untuk menegakkan kalimat Allah dan menjalankan perintah perintah-Nya serta diberikan kepadanya beban syariat kepada Adam dan keturunannya . Allah Subhanahu Wa Ta'ala akan memberikan beban syariat kepada Adam dan keturunannya satu sama lainnya di bumi . bahwasanya para malaikat untuk menjaganya dan menulis amalan Adam dan keturunannya. Allah mengabarkan kepada Malaikat akan hal tersebut dengan memuliakan keutamaan Adam. malaikat bertanya kepada Allah : Apakah engkau wahai Rabb kami akan menjadikan di bumi perusak dengan menumpahkan darah serta mengerjakan maksiat dan kerusakan sedangkan kami senantiasa mensucikan mu , memuliakanmu dan kami tidak bermaksiat kepadamu selamanya ? pertanyaan para malaikat ini menunjukkan bahwasanya dahulu telah ada makhluk sebelum Adam yang menumpahkan darah atau bahwasanya Allah telah mengabarkan hal tersebut ; sebagaimana yang telah dijelaskan oleh sebagian ahli tafsir. Maka Allah membantah mereka para malaikat bahwasanya Allah lebih tahu atas apa yang mereka tidak ketahui dari rahasia-rahasia penciptaan serta konsekuensi dari sebuah urusan ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Demikian pula ingatkanlah kepada yang lain. Makhluk yang akan mengelola bumi dan memberlakukan perintah-perintah Allah di sana, yaitu manusia di mana sebagiannya akan digantikan oleh yang lain. Dengan berbuat maksiat. Ini adalah perkiraan para malaikat. Maksud ayat di atas adalah bahwa para malaikat meminta diberitahukan hikmah di balik penciptaan mereka, padahal makhluk tesebut menurut perkiraan mereka akan mengadakan kerusakan di muka bumi dan menumpahkan darah, sedangkan mereka selalu ta'at kepada-Nya, bertasbih dengan memuji-Nya dan mengagungkan-Nya dengan semua sifat sempurna dan sifat kebesaran. Kata-kata \"nuqaddisu laka\" (lihat ayat di atas) memiliki dua makna: pertama, berarti \"kami menyucikan-Mu karena-Mu\" lam di ayat tersebut menunjukkan takhshis (pengkhususan kepada Allah saja) dan menunjukkan ikhlas (karena Allah) . Kedua, berarti \"Kami menyucikan diri kami dari akhlak buruk karena-Mu dan kami isi dengan akhlak mulia seperti cinta kepada-Mu, takut dan mengagungkan-Mu\". Berupa hikmah yang dalam pada penciptaan mereka. Karena ucapan para malaikat itu sebatas perkiraan mereka, sedangkan Allah Ta'ala mengetahui yang nampak maupun yang tersembunyi. Bahkan kebaikan yang muncul dari mereka lebih banyak daripada keburukan, dengan diciptakan-Nya mereka dipilih-Nya siapa di antara mereka yang menjadi para nabi, para shiddiqin, para syuhada dan orang-orang shalih dan agar ayat-ayat-Nya nampak jelas bagi makhluk-Nya serta dapat dilakukan ibadah yang tidak bisa dilakukan selain oleh kalangan manusia seperti jihad dan lainnya, diuji-Nya mereka (manusia) akankah mereka mau ta'at kepada-Nya dengan kecenderungan yang ada dalam diri mereka ke arah kebaikan dan keburukan, demikian juga agar semakin jelas mana wali-Nya dan mana musuh-Nya, siapa yang berhak menempati surga-Nya dan siapa yang berhak menempati neraka-Nya, agar nampak jelas karunia dan keadilan-Nya, dan agar kelihatan jelas apa yang disembunyikan oleh Iblis berupa keburukan serta hikmah-hikmah lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 30",
    "description": "Setelah pada ayat-ayat terdahulu Allah menjelaskan adanya kelompok manusia yang ingkar atau kafir kepada-Nya, maka pada ayat ini Allah menjelaskan asal muasal manusia sehingga menjadi kafir, yaitu kejadian pada masa nabi adam. Dan ingatlah, wahai rasul, satu kisah ketika tuhanmu berfirman kepada para malaikat, aku hendak menjadikan khalifah, yakni manusia yang akan menjadi pemimpin dan penguasa, di bumi. Khalifah itu akan terus berganti dari satu generasi ke generasi sampai hari kiamat nanti dalam rangka melestarikan bumi ini dan melaksanakan titah Allah yang berupa amanah atau tugas-tugas keagamaan. Para malaikat dengan serentak mengajukan pertanyaan kepada Allah, untuk mengetahui lebih jauh tentang maksud Allah. Mereka berkata, apakah engkau hendak menjadikan orang yang memiliki kehendak atau ikhtiar dalam melakukan satu pekerjaan sehingga berpotensi merusak dan menumpahkan darah di sana dengan saling membunuh, sedangkan kami bertasbih memuji-Mu dan menyucikan nama-Mu' malaikat menganggap bahwa diri merekalah yang patut untuk menjadi khalifah karena mereka adalah hamba Allah yang sangat patuh, selalu bertasbih, memuji Allah, dan menyucikan-Nya dari sifat-sifat yang tidak layak bagi-Nya. Menanggapi pertanyaan malaikat tersebut, Allah berfirman, sungguh, aku mengetahui apa yang tidak kamu ketahui. Penciptaan manusia adalah rencana besar Allah di dunia ini. Allah mahatahu bahwa pada diri manusia terdapat hal-hal negatif sebagaimana yang dikhawatirkan oleh malaikat, tetapi aspek positifnya jauh lebih banyak. Dari sini bisa diambil pelajaran bahwa sebuah rencana besar yang mempunyai kemaslahatan yang besar jangan sam-pai gagal hanya karena kekhawatiran adanya unsur negatif yang lebih kecil pada rencana besar tersebut. Salah satu sisi keutamaan manusia dijelaskan pada ayat ini. Dan dia ajarkan kepada adam nama-nama semuanya, yaitu nama bendabenda dan kegunaannya yang akan bisa membuat bumi ini menjadi layak huni bagi penghuninya dan akan menjadi ramai. Benda-benda tersebut seperti tumbuh-tumbuhan, hewan, dan benda-benda lainnya. Kemudian dia perlihatkan benda-benda tersebut kepada para malaikat dan meminta mereka untuk menyebutkan namanya seraya berfirman, sebutkan kepada-ku nama semua benda ini, jika kamu yang benar! Allah ingin menampakkan kepada malaikat akan kepatutan nabi adam untuk menjadi khalifah di bumi ini."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Allah Subhanahu wa Ta'ala menceritakan perihal anugrah-Nya yang diberikan kepada Bani Adam, yaitu sebagai makhluk yang mulia, mereka disebutkan dikalangan makhluk yang mempunyai kedudukan tertinggi -yaitu para malaikat- sebelum mereka diciptakan. Untuk itu Allah berfirman: (إني جاعل في الأرض خليفة وإذ قال ربك للملائكة ) Makna yang dimaksud adalah “dan ingatlah Muhammad, ketika Tuhanmu berkata kepada para malaikat, sesungguhnya Aku hendak seorang kholifah dimuka bumi ini, yaitu suatu kaum yang sebahagiannya akan menggantikan sebahagian yang lain dan saling berganti, abad demi abad dan generasi demi generasi. Dan ceritakanlah hal ini kepad umatmu hai Muhammad” Al Qurtubi menukil dari zaid bin ali, yang dimaksud kholifah dalam ayat ini bukan Adam AS saja, sebagaimana yang dikatakan sejumlah ahli tafsir. Alqurtubi menisbatkan pendapat ini kepada Ibnu A’bas, Ibnu Mas’ud, dan semua ahli takwil. Walaupun dalam masalah ini terjadi perselisihan pendapat diantara beberapa ahli tafsir. Akan tetapi yang dzohir dalam makna ayat tersebut memang bukanlah Nabi Adam As sebagai kholifah, akan tetapi bani adam secara umum. Hal itu bias disimpulkan dari ucapan para malaikat ketika mendengar berita kekhilafan ini dari Allah Subhanahu wa Ta'ala, mereka berkata : أتجعل فيها من يفسد فيها ويسفك الدماء “Mengapa engkau hendak menjadikan (khilafah) di bumi ini orang yang akan berbuat keruksakan padanya dan akan menumpahkan darah?” Maka maksud dari ucapan mereka (malaikat) ini adalah diantara jenis makhluk ini (manusia) akan ada yang melakukan perbuatan tersebut, dan bukan Nabi Adam yang melakukannya. Timbul pertanyaan besar dalam memahami ucapan malaikat tersebut, dari mana malaikat mengetahui bahwa manusia akan berbuat kerusakan di muka bumi dan akan menumpahkan darah sedangkan Nabi Adam sendiri belum Allah ciptakan?. Menurut imam Alqurtubi ada beberapa kemungkinan malaikat mengucapkan pertanyan tersebut : Pertama bisa jadi para malaikat mengetahui nya dengan ilmu yang khusus dari Allah Subhanahu wa Ta'ala. Kedua, mereka pahami dari watak manusia yang akan Allah ciptakan, karena sebelumnya Allah telah memberi tahu malaikat bahwa Dia akan mencipatakan makhluk ini (manusia) dari tanah liat kering (yang berasal) dari lumpur hitam, sebagaimana firman-Nya : وَإِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِّن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍ Dan (ingatlah), ketika Tuhanmu berfirman kepada para malaikat: \"Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk” (QS Al-Hijr :28) Ketiga, para malaikat memahami bahwa yang dimaksud dengan kholifah adalah mereka yang akan melerai pertengkaran diantara manusia, yaitu yang memutuskan hukum terhada apa yang terjadi dikalangan mereka yang bersangkutan dengan masalah penganiayaan dan melarang mereka dari perbuatan-perbuatan yang diharamkan ataupun perbuatan dosa. Keempat, para Malaikat mengqiyaskan manusia kepada makhluk sebelumnya yang menghuni bumi sebelum mereka yaitu bangsa Jin, sebagaimana penuturan Ibnu Jarir mengatakan, telah menceritakan kepada kami abu kurai telah menceritakan kepada kami Usman Ibnu Said, telah menceritakan kepada kami Bisyr Ibnu Imaroh, dari Abu rauq, dari Ad-dahak dari Ibnu ‘Abbas mengatakan “sesungguhnya yang pertama menghuni bumi ini adalah bangsa jin. Lalu mereka berbuat kerusakan di bumi ini dan banyak menumpahkan darah serta sebagian dari mereka membunuh sebagian yang lain.” Ibnu abbas melanjutkan “lalu Allah mengirim Iblis untuk memerangi mereka. Akhirnya iblis dan para Malaikat memerangi mereka hingga mengejar mereka sampai ke pulau-pulau yang ada diberbagai laut dan sampai ke puncak-puncak gunun. Setelah itu Allah menciptakan Adam lalu menempatkannya di bumi. Oleh karena itu Allah berfirman: إني جاعل في الأرض خليفة “Sesungguhnya Aku hendak menciptakan seorang kholifah di muka bumi” Ucapan para malaikat ini bukan untuk menentang atau memprotes keputusan Allah, dan bukan pula karena rasa iri dengki kepada manusia, kerna hakikatnya malaikat adalah makhlik yang selalu taat kepada Allah, tidak pernah menduhului Allah Subhanahu wa Ta'ala dalam segala hal, mereka akan tunduk terhadap segala perintah Allah Subhanahu wa Ta'ala. Akan tetapi maksud dari ucapan ini adalah meminta informasi kepada Allah tentang hikmah yang terkandung dari penciptaan manusia sebagai kholifah dimuka bumi ini. Mereka mengatakan “wahai tuhan kami,apakah hikmah yang terkandung dalam penciptaan mereka, padahal diantara mereka ada orang yang akan berbuat kerusakan di muka bumi dan menumpahkan darah? Jika yang dimaksudkan agar engkau disembah, maka kami selau bertasbih memujimu dan mensucikanmu dengan ibadah”. Dengan kata lain seolah malaikat ingin mengatakan “dan kami tidak pernah berbuat kerusakan dan menumpahkan darah, kenapa tidak kami saja yang engkau jadikan kholifah?”. Maka Allah berfirman untuk menjawab pertanyaan tersebut : إني أعلم ما لا تعلمون “Sesungguhnya Aku mengetahui apa yang tidak kalian ketahui” Dengan kata lain, seakan-akan Allah bermaksud bahwa sesungguhnya Aku mengetahui hal-hal yang tidak kalian ketahui menyangkut mashlahat yang jauh lebih kuat dalam penciptaan manusia sebagai khalifah daripada mafsadat yang kalin sebutkan. Karena sesungguhnya Aku akan menjadikan dari kalangan mereka nabi-nabi dan rosul-rosul, diantara mereka akan ada para siddiqin, para syuhada, orang-orang sholeh, ahli ibadah, ahli zuhud, para wali, orang-orang yang bertaqwa, para muqorrobin, para ulama yang mengamalkan ilmunya, orang-orang yang khusyuk, orang-orang yang cinta kepad Allah Subhanahu wa Ta'ala dan mengikuti jejak Rosul-Nya. Imam Al-Qurthubi dan yang lainnya menjadikan ayat ini sebagai dalil wajibnya mengangkat seorang kholifah untuk memutuskan perkara yang diperselisihkan diantara manusia, menyelesaikan persengketaan mereka, menolong orang yang teraniaya dari tindakan sewenang-wenang orang dzolim kepada mereka, menegakan hokum-hukum had, dan memperingatkan mereka dari perbuatan keji serta hal-hal penting lainnya yang tidak bisa dilaksankan keculai denga adanya seorang imam, mengingat suatu hal yang merupakan kesempurnaan sesuatu yang wajib maka hukumnya wajib. Pengangkatan imam bias dilakukan dengan metode nash seperti yang terjadi pada pengangkatan Abu Bakar ash-shidiq ra, atau dengan cara ditunjuk, atau dengan cara diangkat oleh imam sebelumnya seperti proses pengangkatan sahabat Umar bin khotob ra yang ditujuk oleh kholifah Abu bakar ra, atau dengan metode musyawarah yang dilakukan oleh orang-orang sholeh seperti yang dilakukan Umar bin Khottob saat menentukan imam pengganti dirinya yaitu kholifah terpilih sahabat Utsman bin affan ra atau dengan kesepakatan ahlul hilli wal ‘aqdi yang membaiatnya. Seorang kholifah wajib laki-laki, merdeka, balig, berakal, muslim, adil, mujtahid dan bias melihat, semua anggota tubuhnya sehat dan berpengalaman dan masalah petempuran dan memiliki pandangan yang tajam serta akurat. Dan disyaratkan dari kalangan bangsa Quraisy menurut pendapat yang shohih. Tidak disyaratkan harus terbebas dari kesalahan dan kefasiqan, sehingga walaupun sang imam berbuat fasiq, maka tetap wajib berimamah kepadanya dan tidak boleh memberontak selama tidak berbuat kekafiran. Tidak diperbolehkan ada dua imam dalam satu negeri,demikian pendapat jumhur ulama, sebagaimana sabda Nabi : “Barang siapa yang datang kepada kalian, sedangkan perkara kalian sudah bersatu, dan dia bermaksud memecah belah diantara kalian, maka bunuhlah oleh kalian dimana saja dia berada”"
  }
]