[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para malaikat berkata: “kami menyucikan Engkau wahai Tuhan kami, tidak ada pengetahuan bagi kami kecuali apa yang telah Engkau ajarkan kepada kami, hanya Engkaulah Dzat Yang Maha Mengetahui urusan-urusan seluruh makhluk lagi Dzat yang maha bijaksana dalam segala pengaturan- Mu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Para Malaikat mengakui kekurangan mereka dan mengembalikan keutamaan kepada Allah dengan mengatakan, “Mahasuci Engkau wahai Rabb kami. Tidak sepatutnya keputusan dan ketentuan-Mu dibantah. Kami tidak tahu apa-apa selain apa yang Engkau beritahukan kepada kami. Engkau Maha Mengetahui segala sesuatu dan Maha Bijaksana dalam setiap keputusan dan ketentuan-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Maka para malaikat menjawab dengan penuh adab dan pengagungan: “Kami menyucikan Engkau dan menjauhkan diri dari menentang-Mu. Kami tidak memiliki ilmu kecuali apa yang telah Engkau ajarkan kepada kami. Hanya Engkaulah yang Maha Mengetahui segala urusan makhluk-Mu dan Maha Bijaksana dalam segala firman dan perbuatan-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالُوا سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا (Mereka menjawab: “Maha Suci Engkau, tidak ada yang kami ketahui selain dari apa yang telah Engkau ajarkan kepada kami) Yakni kami tidak mengetahui hal-hal yang ghaib yang tidak bisa diketahui oleh para makhluk (yang termasuk didalamnya keutamaan Nabi Adam dan keturunannya karena ilmu mereka)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Setelah mengumumkan kelemahan dan keterbatasan mereka, para malaikat berkata: “Ya Tuhan, Maha Suci Engkau, tidak ada yang tahu tentang hal ghaib kecuali Engkau. Tidak ada pengetahuan bagi kami tanpa Engkau ajari. Sesungguhnya Engkaulah yang Maha Mengetahui segala sesuatu dan Maha Bijaksana atas segala ciptaan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,”Maha suci Engkau tidak ada pengetahuan bagi kami, selain yang telah Engkau ajarkan kepada kami. Sesungguhnya Engkaulah Yang Maha Mengetahui lagi Maha Bijaksana.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. “Mereka menjawab, ’Mahasuci Engkau, .” Maksudnya, kami menyucikanMu, dari segala pembantahan kami dan penyelisishan kami terhadap perintah Mu “tidak ada yang kami ketahui” dengan segala bentuknya, ”selain dari apa yang telah Engkau ajarkan kepada kami” tentangnya sebagai suatu anugerah dariMu dan kemuliaan, “ sesungguhnya Engkau lah Yang Maha mengetahui lagi Maha bijaksana, ” yang Maha mengetahui adalah yang mengetahui sesuatu dalam segala aspeknya, tidak ada yang tertutup olehnya dan tidak terlupakan seberat bijnin dzarrah pun di langit maupun di bumi dan tidak yang kecil maupun yang besar, dan yang Maha bijaksana adalah Dzat yang memiliki kebijaksanaan yang sempurna, yang tidak ada seorang makhluk pun yang keluar darinya dan tidak seorang pun yang di perintahkan menyimpang darinya, karena Dia tidaklah menciptakan sesuatu kecuali ada hikmah di baliknya, dan tidak pula Dia memerintahkan kepada sesuatu kecuali menyimpan hikmah padanya, dan hikmah itu sendiri meletakkan sesuatu pada tempatnya yang sesuai. Lalu mereka sadar dan mengakui ilmu Allah dan hikmahNya, dan ketidak mampuan mereka dalam mengetahui sekecil apapun, serta pengakuan mereka terhadap keutamaan Allah atas mereka dan pengajaranNya kepada meeka apa-apa yang tidak mereka ketahui."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : سُبۡحَٰنَكَ Subhaanaka : Maha Suci Engkau ! bentuk pemuliaan dan pensucian kepada Allah Ta’ala Makna ayat : Mereka tidak mampu dan mengumumkan ketidakmampuannya seraya mengatakan,”Maha Suci Engkau, tidak ada yang kami ketahui selain apa yang telah Engkau ajarkan kepada kami.” Pelajaran dari ayat : Keutamaan berani mengatakan ketidakmampuan dan kekurangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 32: Maka ketika menjadi jelas bagi para Malaikat akan keutamaan Adam, maka para malaikat berkata : wahai Rabb kami Sesungguhnya kami hanyalah mensucikanmu dari pertentangan dan menyelisihi perintahmu , Dan tidaklah bagi kami memiliki ilmu apa yang telah engkau ajarkan kepada kamu ; maka sesungguhnya engkau sajalah Yang Maha Mengetahui, yang ilmu-Mu mencakup atas segala sesuatu , dan engkaulah yang memiliki hikmah dalam setiap urusan ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari sikap kami yang berani berbicara terhadap ucapan-Mu dan menyelisihi perintah-Mu. Hikmah atau bijaksana artinya adalah tepat, yakni menempatkan sesuatu pada posisi yang layak. Dari ayat ini dapat diambil kesimpulan bahwa jika samar bagi seorang hamba hikmah Allah menciptakan sesuatu atau memerintahkan sesuatu, maka kewajibannya adalah tunduk dan menerima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 32",
    "description": "Mereka, para malaikat, tidak sanggup menyebutkan nama bendabenda tersebut dan menjawab, mahasuci engkau dari segala kekurangan, tidak ada yang kami ketahui selain apa yang telah engkau ajarkan kepada kami. Sungguh, engkaulah yang maha mengetahui, mahabijaksana. Jawaban malaikat ini adalah jawaban yang penuh santun. Pertama, malaikat mengemukakan ketidakmampuan mereka untuk menyebutkan nama-nama benda itu dengan ungkapan yang menunjukkan kemahasucian Allah. Kedua, malaikat merasa bahwa pengetahuan mereka sangatlah sedikit. Pengetahuan mereka adalah pemberian dari Allah semata. Ketiga, malaikat memuji Allah dengan dua sifat yaitu yang maha mengetahui segala sesuatu dan mahabijaksana dalam semua kebijakan dan seluruh pekerjaan-Nya, termasuk pemilihan nabi adam, manusia, sebagai khalifah. Kemudian Allah memberikan kesempatan kepada nabi adam untuk menyebutkan nama benda-benda yang telah Allah ajarkan kepadanya. Dia berfirman, wahai adam! beritahukanlah kepada mereka nama-nama itu! lalu nabi adam pun menyebutkan nama benda-benda itu dengan segala macam kegunaan dan manfaatnya. Pada saat itulah malaikat memahami bahwa manusialah yang pantas untuk menjadi khalifah di bumi ini. Setelah dia, nabi adam, menyebutkan nama-nama benda-benda tersebut dan apa manfaat dan kegunaan-Nya, Allah berkata secara lebih tegas lagi tentang kebenaran rencana besar-Nya dan berfirman dengan nada pertanyaan, bukankah telah aku katakan kepadamu, bahwa aku mengetahui rahasia langit dan bumi, dan aku mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan' Allah memberi dua alasan tentang penunjukan nabi adam menjadi khalifah. Pertama, bahwa dia mengetahui rahasia di jagat raya yaitu semua yang ada di langit dan bumi. Kedua, bahwa Allah mengetahui apa yang dipendam dalam diri malaikat dan juga hati manusia. Jika demikian, maka gagasan Allah untuk menjadikan manusia sebagai khalifah pasti mempunyai banyak hikmah."
  }
]