[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah ta'ala berfirman: “wahai Adam beritahukanlah nama-nama benda tersebut kepada mereka yang tidak sanggup mereka ketahui”. Dan setelah Adam Alaihissalam memberitahukan kepada mereka nama-nama itu, Allah berfirman kepada malaikat: “sungguh Aku telah mengabarkan kepada kalian bahwa Aku ini lebih mengetahui apa-apa yang samar bagi kalian baik di langit maupun di bumi, dan Aku lebih mengetahui terhadap apa yang kalian tampakkan maupun rahasiakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Ketika itulah Allah -Ta'ālā- berfirman kepada Adam, “Beritahu mereka nama benda-benda itu!” Setelah Adam memberitahu mereka nama benda-benda tersebut sesuai dengan apa yang telah Allah ajarkan kepadanya, maka Allah berfirman kepada para Malaikat, “Bukankah Aku sudah mengatakan kepada kalian bahwa Aku mengetahui apa-apa yang tersembunyi di langit dan di bumi. Dan Aku pun mengetahui apa yang kamu perlihatkan secara nyata dan apa yang kamu sembunyikan di dalam hati.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Setelah itu Allah memerintahkan Adam untuk menyebutkan kepada malaikat nama dari benda-benda yang tidak diketahui oleh para malaikat. Kemudian Allah berfirman kepada para malaikat: “Bukankah Aku telah mengatakan kepada kalian bahwa Aku mengetahui apa yang tersembunyi dari kalian di langit dan di bumi. Dan Aku mengetahui apa yang kalian tampakkan dan sembunyikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَأَعْلَمُ مَا تُبْدُونَ (dan Aku mengetahui apa yang kamu tampakkan) dari Ibnu Abbas, ia berkata: kalimat ini untuk menjelaskan firman Allah: أَتَجْعَلُ فِيهَا مَنْ يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ “Mengapa Engkau hendak menjadikan (khalifah) di bumi itu orang yang akan membuat kerusakan padanya dan menumpahkan darah?” وَمَا كُنْتُمْ تَكْتُمُونَ (dan apa yang kamu sembunyikan) yakni kesombongan yang disembunyikan Iblis dalam hatinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah memerintahkan Adam untuk mengabarkan kepada para malaikat tentang nama-nama yang telah disampaikan kepada mereka. Allah berfirman kepada para malaikat: “Bukankah Aku telah mengabarkan kepada kalian bahwa sesungguhnya Aku lebih mengetahui tentang sesuatu yang ghaib di langit dan bumi daripada kalian dan hal itu juga kalian saksikan. Aku mengetahui apa yang kalian tampakkan dari ucapan kalian dan apa yang kalian sembunyikan dalam diri kalian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman, “Wahai Adam, beri tahukanlah kepada mereka nama-nama benda itu” Ketika Adam memberitahukan nama-nama itu, Dia berfirman, “Bukankah telah Kukatakan kepada kalian bahwa sesungguhnya Aku mengetahui rahasia langit dan bumi, dan mengetahui apa yang kalian nyatakan dan apa yang kalian sembunyikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Saat itulah Allah berfirman, ” Hai Adam, beritahukanlah kepada mereka nama-nama benda ini, ” yakni nama-nama benda yang di kemukakan oleh Allah kepada para malaikat yang tidak mampu mereka ketahui, “maka setelah diberitahukannya kepada mereka nama benda-benda itu, ” jelaslah bagi mereka keutamaan Adam atas mereka, dan hikmah Allah yang Maha pencipta dan ilmuNya dalam menetapkannya sebagai khalifah, “Allah berfirman, ’bukankah sudah ku katakana kepadamu, bahwa sesungguhnya Aku mengetahui rahasia langit dan bumi, ” yakni apa yang tersembunyi darinya dan tidak kita lihat, sehingga apabila Dia mengetahui yang ghaib, maka alam nyata tentu lebih utama, ” dan aku juga mengetahui apa yang kamu lahirkan, ” maksudnya, apa yang kamu nampakkan, “dan apa yang kamu sembunyikan.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : غَيۡبَ ٱلسَّمَٰوَٰتِ Ghoibas samaawaati : Sesuatu yang tidak bisa dilihat oleh penglihatan di seluruh langit dan bumi. تُبۡدُونَ Tubduuna : Apa yang kalian nampakkan, yaitu ucapan malaikat pada firman Allah Ta’ala “Apakah Engkau akan menjadikan di bumi orang yang akan berbuat kerusakan padanya...” تَكۡتُمُونَ Taktumuuna : Apa yang kalian sembunyikan dan rahasiakan. Adapun yang dimaksud adalah apa yang disembunyikan oleh Iblis dalam hatinya berupa pelanggaran perintah Allah Ta’ala dan tidak mau taat kepadaNya. Al-Hakiim : Yang Maha Bijaksana, adalah Dzat yang meletakkan sesuatu pada tempatnya. Tidaklah ia melakukan sesuatu atau tidak melakukannya didasarkan pada kebijaksanaanNya. Makna ayat : Kemudian Allah Ta’ala berkata kepada Adam ‘alaihisalam “Beritahukanlah kepada mereka nama-nama makhluk yang ditampilkan di hadapanmu itu.” Maka Adam memberitahukan nama-nama itu satu persatu sampai-sampai menyebutkan nampan dan piring. Dari sini terlihat kemuliaan Adam dibandingkan para malaikat. Kemudian Allah menegur mereka dalam firmanNya,”Bukankah sudah Aku katakan kepada kalian, bahwa sesungguhnya Aku mengetahui rahasia langit dan bumi dan mengetahui segala apa yang kalian tampakkan dan apa yang kalian sembunyikan.” Pelajaran dari ayat : Kebolehan untuk menegur seseorang yang mengakui memiliki keahlian dalam suatu bidang padahal aslinya tidak memiliki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 33: Allah kemudian memerintahkan menyebutkan nama-nama kepada malaikat yang mana malaikat tidak mengetahuinya serta untuk menampakan akan keutamaan dan kemuliaan Adam . maka ketika Adam memberitahukan malaikat nama-nama tersebut , kemudian Allah berkata : Bukankah aku mengabarkan kepada kalian wahai malaikat bahwasanya aku lebih mengetahui apa yang kalian tidak ketahui dilangit dan dibumi , dan aku mengetahui segala yang nampak maupun yang tersembunyi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni nama-nama benda yang mereka tidak mengetahuinya. Setelah Adam memberitahukannya, Allah Ta'ala menegaskan bahwa Dirinya lebih mengetahui hal yang samar bagi mereka baik di langit maupun di bumi dan Dia mengetahui apa yang mereka nyatakan dan apa yang mereka sembunyikan. Rahasia atau ghaib adalah yang tidak kita ketahui dan tidak dapat kita saksikan. Jika Allah Ta'ala mengetahui yang rahasia, apalagi yang nampak atau kelihatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 33",
    "description": "Kemudian Allah memberikan kesempatan kepada nabi adam untuk menyebutkan nama benda-benda yang telah Allah ajarkan kepadanya. Dia berfirman, wahai adam! beritahukanlah kepada mereka nama-nama itu! lalu nabi adam pun menyebutkan nama benda-benda itu dengan segala macam kegunaan dan manfaatnya. Pada saat itulah malaikat memahami bahwa manusialah yang pantas untuk menjadi khalifah di bumi ini. Setelah dia, nabi adam, menyebutkan nama-nama benda-benda tersebut dan apa manfaat dan kegunaan-Nya, Allah berkata secara lebih tegas lagi tentang kebenaran rencana besar-Nya dan berfirman dengan nada pertanyaan, bukankah telah aku katakan kepadamu, bahwa aku mengetahui rahasia langit dan bumi, dan aku mengetahui apa yang kamu nyatakan dan apa yang kamu sembunyikan' Allah memberi dua alasan tentang penunjukan nabi adam menjadi khalifah. Pertama, bahwa dia mengetahui rahasia di jagat raya yaitu semua yang ada di langit dan bumi. Kedua, bahwa Allah mengetahui apa yang dipendam dalam diri malaikat dan juga hati manusia. Jika demikian, maka gagasan Allah untuk menjadikan manusia sebagai khalifah pasti mempunyai banyak hikmah. Sebagai bentuk pengakuan malaikat akan keunggulan manusia atas mereka yang dinyatakan Allah pada ayat sebelumnya, pada ayat ini Allah memerintahkan malaikat untuk bersujud hormat kepada nabi adam. Dan ingatlah ketika kami berfirman kepada para malaikat, sujudlah kamu, yakni hormatlah, kepada adam dengan menundukkan kepala atau badan, bukan sujud ibadah! mendengar perintah Allah ini, maka mereka, para malaikat, pun sujud, kecuali iblis. Iblis adalah makhluk dari jenis jin yang terbuat dari api. Iblis merasa dirinya lebih terhormat daripada nabi adam karena dia diciptakan dari api yang salah satu sifatnya adalah panas, membakar, dan membara. Sementara, nabi adam diciptakan dari tanah liat, yang kelihatan diam dan tidak bergerak. Ia, iblis, menolak bersujud kepada nabi adam dan menyombongkan diri karena merasa dirinya lebih terhormat, dan, atas tindakannya ini, ia termasuk golongan yang kafir, yaitu makhluk yang menutup diri dari menerima kebenaran, ingkar terhadap kenikmatan yang diberikan oleh Allah kepadanya, dan ingkar terhadap hikmah yang terkandung di balik titah Allah."
  }
]