[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatkanlah -wahai Rasul- kepada manusia tentang kemuliaan yang Allah anugerahkan bagi Adam ketika Allah ta’ala berfirman kepada para malaikat: “bersujudlah kalian kepada Adam untuk memuliakan dan memperlihatkan keutamaannya”. Maka seluruh malaikat taat menjalankan kecuali iblis ia menolak bersujud lantaran kesombongan dan kedengkiannya, maka ia pun menjadi makhluk yang ingkar kepada Allah dan membangkang terhadap perintah-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Allah -Ta'ālā- menjelaskan bahwa Dia memerintahkan para Malaikat agar bersujud kepada Adam -'alaihissalām- sebagai bentuk penghormatan dan pemuliaan, maka mereka segera bersujud kepadanya demi melaksanakan perintah Allah, kecuali Iblis yang berasal dari bangsa jin. Iblis melawan perintah Allah yang menyuruhnya bersujud kepada Adam, dan merasa dirinya lebih baik dari Adam. Dengan begitu Iblis telah berubah menjadi kafir kepada Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Wahai Rasul, sebutkanlah kepada pada hamba bagaimana Allah telah memuliakan dan mengutamakan Adam, saat Allah memerintahkan para malaikat untuk bersujud kepada Adam sebagai penghormatan baginya. Maka mereka mentaati-Nya kecuali Iblis yang enggan untuk bersujud dan menampakkan kesombongannya, sehingga ia menjadi makhluk yang melanggar perintah Allah. Perintah sujud ini terjadi sebelum Adam diciptakan dengan sempurna, dengan dalil firman Allah: فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين Maka apabila Aku telah menyempurnakan kejadiannya, dan telah meniup kan kedalamnya ruh (ciptaan)-Ku, maka tunduklah kamu kepadanya dengan bersujud. (al-hijr: 29)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. اسْجُدُوا (sujudlah kalian kepada Allah) Dalam bahasa arab kata sujud berarti tunduk, dan posisi terbaik adalah dengan meletakkan wajah di atas tanah. Abu Amr berkata: seseorang dikatakan bersujud apabila menundukkan kepalanya. Ayat ini menunjukkan keutamaan Nabi Adam yang mana Allah Ta’ala menyuruh para malaikat kepadanya. Adapun sujud kepada selain Allah diharamkan di syariat Nabi Muhammad Shallallahu ‘Alaihi Wasallam. إِلَّا إِبْلِيسَ (kecuali Iblis) Iblis berasal dari bangsa jin, dan dia termasuk yang diperintahkan untuk bersujud kepada Nabi Adam karena dia berada diantara malaikat. Ibnu Abbas berkata: dulunya Iblis bernama ‘Azazil dan digolongkan diantara malaikat yang paling mulia, akan tetapi kemudian dia tidak mentaati Allah, sejak saat itulah dia dinamakan dengan Iblis karena Allah menjauhkan dirinya dari segala bentuk kebaikan karena kemaksiatannya. أَبَىٰ وَاسْتَكْبَرَ (ia enggan dan takabbur) Yakni tidak mau untuk bersujud dan meresa dirinya lebih mulia. وَكَانَ مِنَ الْكَافِرِينَ (dan ia termasuk golongan orang-orang yang kafir) Yakni Allah telah mengetahui sebelumnya bahwa Iblis adalah kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu 'Abbas berkata : \"Jika kesalahan seorang laki-laki pada kesombongannya maka janganlah kamu mengarap kepadanya, dan jika kesalahannya karena kemaksiatan maka berharaplah kepadanya sesuatu, karena sesungguhnya kesalahan Adam karena kemaksiatan, sedangkan kesalahan Iblis karena kesombongannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan ingatkanlah juga wahai Rasulallah kepada kaummu ketika kami memerintahkan para malaikat untuk bersujud kepada Adam sebagai tanda penghormatan dan pemuliaan, bukan (sebagai) sujud penyembahan dan pengagungan. Kemudian mereka semua bersujud kecuali Iblis yang berasal dari golongan jin. Dia menolak bersujud melainkan mengagungkan dirinya sendiri. Di sisi Allah, dia telah ingkar karena melanggar perintah Allah SWT dan enggan bersujud kepada Adam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami berfirman kepada para malaikat,“Sujudlah kalian} sujud penghormatan bukan sujud peribadatan {kepada Adam” lalu mereka bersujud, kecuali Iblis. Ia menolaknya} dia menolak {dan menyombongkan diri dan termasuk golongan orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Kemudian Allah ta’ala memerintahkan kepada mereka untuk bersujud kepada Adam sebagai suatu penghormatan terhadapnya, dan sebagai pengagungan dan penghambaan kepada Allah ta’la. Maka mereka semua menaati perintah Allah tersebut dan mereka semuanya segera bersujud, “kecuali iblis; dia enggan” dia tidak mau bersujud dan dia takabur terhadap perintah Allah dan terhadap Adam. Iblis berkata \"apakah aku harus bersujud kepada orang yang Engkau ciptakan dari tanah\" Keengganan ini berasal darinya, dan kesombongan yang di hasilkan dari kekufuran yang merupakan perkara cakupannya, sehingga akhirnya jelaslah saat itu permusuhan iblis terhadap Allah dan Nabi Adam serta kekufuran dan kesombongannya. Dalam ayat ini terkandung banyak sekali pelajaran yang dapat diambil dan tanda-tanda kekuasaan Alllah, di antaranya: penetapan sifat berfirman (berbicara) bagi Allah ta’ala serta bahwasanya Allah senantiasa berfirman sekehendakNya dan bahwasanya Allah senantiasa bersifat berfirman dengan apa yang di kehendakiNya dan berbicara dengan apa yang Dia kehendaki, dan bahwasanya Dia Maha mengetahui lahi Maha bijaksana. Dalam ayat ini juga terkandung dalil bahwasanya seorang hamba bila tidak mengetahui tentang hikmah Allah yang terkandung di balik beberapa makhluk, dan perintah-perintah, maka wajiblah atasnya menerimanya saja dan menuduh akalnya yang lemah serta menetapkan bahwasanya Allah memiliki hikmah di balik itu semua. Dalam ayat ini juga ada dalil tentang perhatian Allah terhadap urusan para malaikat dan kebaikan Allah kepada mereka dengan mengajarkan kepada mereka apa yang mereka tidak tahu, serta peringatanNya kepada mereka akan hal-hal yang tidak mereka ketahui. Dalam ayat ini terkandung pernyataan akan keutamaan ilmu dari beberapa segi : - Bahwasanya Allah mengenalkan kepada para malaikatNya tentang ilmu dan hikmahNya. - Bahwasanya Allah mengemukakan kepada mereka akan keutamaan nabi Adam karena ilmu, dan bahwasanya ilmu itu adalah perkara yang paling baik bagi seorang hamba. - Bahwasanya Allah memerintahkan kepada para malaikat untuk bersujud kepada Adam sebagai penghormatan kepadanya ketika jelas keutamaan ilmunya. - Bahwasanya ujian bagi orang lain, bila mereka tidak mampu melakukan ujian itu kemudia Allah memberitahukan jawabannya, maka hal tersebut adalah lebih utama daripada mengetahui ujian itu sejak semula. - Mengambil pelajaran dari kondisi kedua bapak moyang manusia dan jin, dan penjelasan akan keutamaan Adam serta karunia-karunia Allah terhadapnya serta permusuhan iblis kepadanya, dan pelajaran-pelajaran lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱسۡجُدُواْ Usjuduu : Sujud adalah meletakkan kening dan hidung di atas permukaan tanah, atau bisa juga dengan menundukkan kepala ke tanah tanpa meletakannya akan tetapi disertai dengan rasa rendah dan tunduk. إِبۡلِيسَ Ibliis : Dikisahkan bahwa dahulu namanya adalah Al-Haarits, namun pada saat mulai menyombongkan diri dari ketaatan kepada Allah maka Allah Ta’ala menjadikannya putus asa (iblis) dari setiap kebaikan dan menjadikannya setan. أَبَىٰ Abaa : Tidak mau dan menolak untuk bersujud kepada Adam ٱسۡتَكۡبَرَ : Merasa dirinya lebih tinggi dan mulia sehingga rasa sombong dan hasad mencegahnya untuk taat kepada Allah dengan bersujud kepada Adam. ٱلۡكَٰفِرِينَ Al-Kaafiriin : Merupakan bentuk plural dari kafir. Yaitu orang yang mendustakan Allah atau mendustakan salah satu ayat-ayat Allah, atau mendustakan salah satu rasul-rasul Allah, atau dengan menolak taat kepadaNya. Makna ayat : Allah Ta’ala mengingatkan hamba-hambaNya dengan ilmu, kebijaksanaanNya, serta karuniaNya atas mereka dalam firmanNya: وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ “Dan ingatlah ketika Kami berfirman kepada para Malaikat, “Sujudlah kamu kepada Adam..” (QS. Al-Baqarah : 34). Perintah sujud ini merupakan bentuk penghormatan kepada Adam. Maka para malaikat bersujud kecuali Iblis. Merasa dirinya lebih tinggi dan mulia sehingga rasa sombong dan hasad mencegahnya untuk taat kepada Allah dan memberi penghormatan kepada Adam. Dikarenakan rasa sombong dan dengki kepada Adam karena kemuliaannya. Oleh karena itu Iblis digolongkan ke dalam barisan para kafir dan fasiq dari perintah Allah, karena tidak mau taat kepadaNya. Hal inilah yang membuatnya pantas untuk dijadikan berputus asa dan dijauhkan dari kebaikan. Pelajaran dari ayat 34 : 1. Mengingatkan akan karunia dari Allah terhadap perkara yang wajib untuk disyukuri serta mendorong untuk melakukannya. 2. Peringatan keras dari sifat sombong dan dengki dimana keduanya adalah sebab dijauhkannya setan dari kebaikan, termasuk juga sebab yang menjadikan orang Yahudi tidak mau menerima Islam. 3. Penetapan permusuhan Iblis, dan peringatan bahwa dia adalah musuh yang harus dijadikan musuh untuk selamanya. 4. Peringatan bahwa ada beberapa maksiat termasuk dalam kekufuran dan ada juga yang dapat mengantarkan kepada kekufuran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 34: Allah memerintahkan kepada malaikat untuk bersujud kepada Adam sebagai penghormatan dan perkenalan , maka Bergegaslah para malaikat memenuhi perintah Allah dan bersujud kepada Adam kecuali iblis yang tidak wujud karena sebab angkuh dan sombong , oleh karena itu jadilah iblis termasuk para pengingkar yang bermaksiat atas perintah Allah ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai pemuliaan Allah kepada Adam 'alaihis salam. Sujud di sini adalah sujud penghormatan kepada Adam, bukan sebagai sujud memperhambakan diri, karena sujud memperhambakan diri itu hanyalah semata-mata kepada Allah Ta'ala. Iblis enggan untuk sujud karena sombong dan dengki, sehingga ia termasuk golongan yang ingkar kepada Allah dan durhaka kepada perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 34",
    "description": "Sebagai bentuk pengakuan malaikat akan keunggulan manusia atas mereka yang dinyatakan Allah pada ayat sebelumnya, pada ayat ini Allah memerintahkan malaikat untuk bersujud hormat kepada nabi adam. Dan ingatlah ketika kami berfirman kepada para malaikat, sujudlah kamu, yakni hormatlah, kepada adam dengan menundukkan kepala atau badan, bukan sujud ibadah! mendengar perintah Allah ini, maka mereka, para malaikat, pun sujud, kecuali iblis. Iblis adalah makhluk dari jenis jin yang terbuat dari api. Iblis merasa dirinya lebih terhormat daripada nabi adam karena dia diciptakan dari api yang salah satu sifatnya adalah panas, membakar, dan membara. Sementara, nabi adam diciptakan dari tanah liat, yang kelihatan diam dan tidak bergerak. Ia, iblis, menolak bersujud kepada nabi adam dan menyombongkan diri karena merasa dirinya lebih terhormat, dan, atas tindakannya ini, ia termasuk golongan yang kafir, yaitu makhluk yang menutup diri dari menerima kebenaran, ingkar terhadap kenikmatan yang diberikan oleh Allah kepadanya, dan ingkar terhadap hikmah yang terkandung di balik titah Allah. Setelah persoalan dengan malaikat selesai dengan sujudnya malaikat kepada nabi adam, dan persoalan dengan iblis juga selesai dengan menolaknya iblis untuk sujud kepada nabi adam, maka pada ayat ini Allah memerintahkan kepada nabi adam dan istrinya, hawa, untuk menghuni surga sebagai penghormatan kepadanya. Inilah bentuk lain dari anugerah dan kenikmatan yang Allah berikan kepada manusia di samping menjadi khalifah dan sujudnya malaikat kepadanya. Dan kami berfirman, wahai adam! tinggAllah engkau dan istrimu di dalam surga, yakni surga yang dijanjikan Allah bagi orang mukmin di akhirat kelak, atau bisa juga berarti suatu taman. Allah melanjutkan firman-Nya, dan makanlah dengan nikmat berbagai makanan yang ada di sana sesukamu secara bebas, di mana saja, dan kapan saja. Tetapi, Allah mengingatkan mereka agar jangan memakan satu buah tertentu, bahkan melarang mereka mendekati tanaman tersebut, karena mendekatinya dapat menggoda mereka untuk memetiknya. Janganlah kamu dekati pohon ini, nanti kamu."
  }
]