[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman: “wahai Adam Tinggallah engkau dan istrimu Hawwa di surga, dan nikmatilah oleh kalian berdua buah-buahannya dengan penuh nikmat dan keleluasaan di tempat mana saja yang kalian kehendaki, tapi janganlah kalian berdua mendekati pohon ini agar kalian tidak terjerumus kedalam maksiat yang akibatnya kalian akan menjadi orang-orang yang melanggar perintah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Kami berfirman, “Wahai Adam! Tinggallah kamu bersama istrimu (Hawa) di dalam surga. Makanlah apa yang ada di dalamnya dengan senang hati dan leluasa, tanpa merasa terganggu, di mana saja di dalam surga. Tetapi jangan sekali-kali kalian berdua makan dari pohon ini yang terlarang ini, karena (jika memakannya) kalian berdua akan termasuk ke dalam golongan orang-orang yang zalim akibat membangkang perintah-Ku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah memuliakan Adam dan istrinya, Hawa, untuk tinggal di surga, dan menikmati buah-buahan yang ada di dalamnya sesuai kehendak mereka; namun mereka berdua dilarang mendekati pohon terlarang agar tidak terjerumus dalam kemaksiatan, sehingga menjadi orang-orang yang melanggar perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ (diamilah oleh kamu dan isterimu surga ini) yakni jadikanlah surga ini sebagai tempat tinggal bagimu dan istrimu رَغَدًا (banyak lagi baik) kata (الرغد) berarti kehidupan yang tentram tanpa kesusahan didalamnya. وَلَا تَقْرَبَا (dan janganlah kamu dekati) Larangan ini sebagai bentuk antisipasi dan pemotong sebab-sebab yang menjerumus kepada pelanggaran larangan yang sesungguhnya yang berupa memakan buah terlarang. هَٰذِهِ الشَّجَرَةَ (pohon ini) Terdapat perbedaan pendapat diantara ulama tentang jenis pohon ini; ada yang mengatakan pohon anggur, dan ada yang mengatakan pohon tin dan ada pula yang mengatakan pohon gandum. فَتَكُونَا مِنَ الظَّالِمِينَ(yang menyebabkan kamu termasuk orang-orang yang zalim) Yakni orang-orang yang menzalimi diri mereka sendiri dengan kemaksiatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah ta'ala berfirman dalam surah al-Baqarah : { وَقُلْنَا يَا آدَمُ اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ }, dan dalam surah al-A'raf : { وَقُلْنَا يَا آدَمُ اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ } hikmah dari penggunan lafazh ( اسْكُنْ ) pada kedua ayat ini tanpa menghubungkan lafazh lain yang memiliki kesesuaian makana adalah isyarat bahwasanya waktu yang dilalui Adam dan istrinya ketika disurga hanyalah sebentar, karena sesungguhnya Allah menciptakan Adam hanya untuk menjadi khalifah di muka bumi. 2 ). Berkata sahl bin Abdullah : \"meninggalkan perintah perkaranya lebih besar dibanding melakukan apa yang dilarang; sebagaimana yang terjadi pada kisah Adam yang telah dilarang untuk memakan buah dari sebuah pohon tetapi ia memakannya lalu Allah mengampuni kesalahan tersebut, sedangkan Iblis telah diperintahkan kepadanya untuk bersujud dihadapan Adam tetapi ia tidak melaksanakannya maka Allah tidak mengampuni kesalahan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatkanlah juga wahai Rasulallah ketika kami berfirman kepada Adam: “Jadikanlah surga sebagai tempat tinggal bersama istrimu Hawa’ dan makanlah darinya makanan lezat yang tidak mengandung penyakit dari setiap tempat dan tumbuhan, namun kalian jangan mendekati pohon ini, yaitu pohon anggur, pohon Tin, gandum atau yang lainnya, dan janganlah kalian memakannya! Jika kalian memakannya, niscaya kalian termasuk orang-orang yang menganiaya diri kalian sendiri dengan berbuat kemaksiatan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami berfirman,“Wahai Adam, tinggallah kamu dan istrimu di surga, makanlah dari (makanan) surga dengan nikmat} makan dengan penuh kepuasan tanpa ada yang melarang {sesuai keinginan kalian, dan janganlah kalian mendekati pohon ini, sehingga kalian termasuk orang-orang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Setelah Allah menciptakan Adam lalu memuliakannya, Dia menyempurnakan nikmat baginya dengan menjadikan seorang istri, agar dia merasa tenang dan terhibur dengannya, dan Allah memerintahkan kepada keduanya untuk menetap di surge dan memakan makanan yang berlimpah disana, yaitu dengan puas lagi nikmat, “ di mana saja kamu sukai” yakni dari berbagai buah-buahan. Allah berfirman kepada Adam : \"Sesungguhnya kamu tidak akan kelaparan di dalamnya dan tidak akan telanjang, dan sesungguhnya kamu tidak akan merasa dahaga dan tidak (pula) akan ditimpa panas matahari di dalamnya”. (QS. Thoha : 118-119) “Dan janganlah kamu dekati pohon ini, ” yaitu sebuah pohon dari pohon-pohon surga yang mana hanya Allah saja yang mengetahuinya. Allah melarang mereka berdua mendekatinya adalah sebagai suatu ujian dan cobaan atau untuk suatu hikmah yang tersembunyi yang tidak kita ketahui, “yang menyebabkan kamu termasuk orang-orang yang zhalim.” Ini menunjukan bahwasanya larangan itu adalah dengan maksud pengharaman, karena Allah menetapkan kezhaliman atasnya (bila di langgar), dan musuh mereka senantiasa mnggoda dan membujuk mereka berdua agar memakan pohon yang dilarang untuk mereka hingga dia dapat menggelincirkan keduanya atau menjatuhkan keduanya dalam suatu kesalahan dengan membuatnya indah. \"dan iblis bersuphak kepada keduanya dengan nama Allah bahwasanya dia adalah pemberi nasihat untuk keduanya\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : رَغَدًا Raghadan maknanya kehidupan yang menyenangkan dengan rezeki yang lapang dalam bahasa Arab disebut Ar-Raghadu ٱلشَّجَرَةَ Asy-Syajaroh adalah sebuah pohon di antara pepohonan surga, bisa berupa pohon anggur maupun pohon tin, atau jenis pohon yang lainnya. Selama Allah Ta’ala tidak menyebutkan secara spesifik jenisnya maka tidak semestinya bagi kita untuk mempertanyakannya. ٱلظَّٰلِمِينَ Adz-dzaalimiin yaitu orang-orang yang dzalim terhadap diri mereka sendiri dengan mengerjakan hal-hal yang dilarang oleh Allah. Makna ayat : Pada ayat 35 Allah Ta’ala mengabarkan tentang bagaimana kemuliaan yang diberikan kepada Adam dan istrinya Hawa, dengan memperbolehkan mereka berdua untuk tinggal di surga dan menikmati segala kenikmatan yang ada sekehendaknya, kecuali satu pohon yang dilarang untuk mendekatinya, dan memakan buahnya. Sehingga mereka tidak termasuk dalam golongan orang yang dzalim. Pelajaran dari ayat : 1. Kemuliaan Adam dan anak keturunannya di sisi Allah Ta’ala 2. Buruknya kemaksiatan dan pengaruhnya dalam merubah kenikmatan menjadi kesengsaraan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 35: Allah kemudian memerintahkan Adam untuk tinggal bersama istrinya Hawa di surga , mereka berdua bersenang-senang memakan buah-buahan dalam keadaan aman dan beriman , Allah melarang kepada mereka berdua untuk memakan 1 buah dari pohon yang telah ditentukan ; hingga sampailah mereka kepada kemaksiatan dan jadilah mereka orang-orang yang dzolim karena sebab bermaksiat kepada Allah ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pohon yang dilarang Allah mendekatinya tidak dapat dipastikan namanya, sebab Al Quran dan As Sunnah tidak menerangkannya. Mendekati pohon itu bagi Adam dan Hawa merupakan kemaksiatan sehingga mereka akan tergolong orang-orang yang melanggar perintah Allah. Allah Ta'ala melarang memakan pohon itu sebagai ujian atau karena hikmah yang kita tidak mengetahuinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 35",
    "description": "Setelah persoalan dengan malaikat selesai dengan sujudnya malaikat kepada nabi adam, dan persoalan dengan iblis juga selesai dengan menolaknya iblis untuk sujud kepada nabi adam, maka pada ayat ini Allah memerintahkan kepada nabi adam dan istrinya, hawa, untuk menghuni surga sebagai penghormatan kepadanya. Inilah bentuk lain dari anugerah dan kenikmatan yang Allah berikan kepada manusia di samping menjadi khalifah dan sujudnya malaikat kepadanya. Dan kami berfirman, wahai adam! tinggAllah engkau dan istrimu di dalam surga, yakni surga yang dijanjikan Allah bagi orang mukmin di akhirat kelak, atau bisa juga berarti suatu taman. Allah melanjutkan firman-Nya, dan makanlah dengan nikmat berbagai makanan yang ada di sana sesukamu secara bebas, di mana saja, dan kapan saja. Tetapi, Allah mengingatkan mereka agar jangan memakan satu buah tertentu, bahkan melarang mereka mendekati tanaman tersebut, karena mendekatinya dapat menggoda mereka untuk memetiknya. Janganlah kamu dekati pohon ini, nanti kamu lalu setan memperdayakan keduanya dengan berbagai macam cara agar mereka keluar dari dalam surga sehingga keduanya benar-benar dikeluarkan dari segala kenikmatan ketika keduanya di sana, yakni di dalam surga. Sebagai manusia yang tercipta dari tanah liat (materi), nabi adam mempunyai titik lemah yaitu keinginan untuk tetap abadi di dalam surga, karena surga adalah gudangnya materi. Adanya materi berarti keabadian. Setelah nabi adam dan hawa memakan buah larangan tersebut, keduanya mendapatkan sanksi berupa terlucutinya pakaian mereka sehingga mereka berdua mencari penutup auratnya dengan daun-daun pepohonan surga. Di samping itu, Allah memerintahkan mereka untuk turun ke dunia. Dan kami berfirman, turunlah kamu! sebagian kamu menjadi musuh bagi yang lain, yakni antara manusia (nabi adam) dengan setan, atau bisa juga antarsesama manusia. Dan bagi kamu, manusia dan setan, ada tempat tinggal dan kesenangan di bumi sampai waktu yang ditentukan, yakni hari kiamat. Selanjutnya nabi adam dan hawa dipersilakan Allah untuk hidup menetap di dunia, memanfaatkan fasilitas-fasilitas yang ada di bumi, baik berupa makanan, minuman, tempat tinggal, flora, fauna, dan lain-lainnya, sampai pada masa yang ditentukan, yaitu pada saat kematiannya yang tidak tahu kapan hal itu datang. Inilah babak baru bagi adam dalam menjalani misi kekhalifahannya di bumi."
  }
]