[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka setan menjerumuskan mereka berdua ke dalam kesalahan itu dengan cara membikin-bisikan kepada mereka sehingga mereka memakan buah dari pohon tersebut. maka setan menjadi sebab dikeluarkannya mereka berdua dari surga dengan segala kenikmatannya. Dan Allah ta'ala berfirman kepada mereka: “turunlah kalian ke bumi, sebagian kalian akan memusuhi sebagian yang lain -maksudnya Adam alaihissalam, Hawwa dan setan- dan di muka bumi ini kalian akan mendapatkan hunian dan tempat kediaman serta kalian dapat memanfaatkan isinya sampai saat ajal kalian berakhir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Kemudian setan tidak henti-hentinya menggoda dan merayu mereka berdua. Sampai akhirnya setan berhasil menjerumuskan keduanya ke dalam kesalahan dan kekhilafan, dengan memakan buah dari pohon yang terlarang bagi mereka. Maka balasannya ialah Allah mengeluarkan mereka berdua dari dalam surga. Dan Allah berfirman kepada keduanya dan kepada setan, “Turunlah kalian ke bumi. Kalian akan saling bermusuhan. Di bumi itu kalian mempunyai tempat tinggal yang tetap dan bisa merasakan berbagai kenikmatan yang ada di sana sampai ajal kalian menjemput dan hari kiamat tiba.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Ketika setan melihat pemuliaan Allah bagi Adam dan Hawa, maka ia mulai menggoda keduanya agar memakan buah dari pohon terlarang, akibatnya mereka terjerumus dalam kemaksiatan dan menyebabkan mereka dikeluarkan dari surga. Kemudian Allah memerintahkan mereka untuk turun ke bumi dan mengabarkan kepada mereka permusuhan yang akan terjadi diantara manusia dan godaan setan terhadap mereka di bumi. dan Allah menjadikan bagi mereka di bumi tempat menetap dan rezeki sampai ajal yang telah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَأَزَلَّهُمَا الشَّيْطَانُ (Lalu keduanya digelincirkan oleh syaitan) kata (الزلة) berarti kesalahan. Yakni setan menjerumuskan keduanya kedalam kesalahan. عَنْهَا(darinya) Dlomir (kata ganti) ‘nya’ merujuk pada pohon, sehingga maksud dari ayat ini adalah bahwa setan menjerumuskan adam dan hawa dengan menyuruh mereka memakan buah dari pohon terlarang. Pendapat lain menyebutkan bahwa dlomir ini merujuk pada surga, sehingga maksud dari ayat ini adalah setan mengeluarkan mereka dari surga. فَأَخْرَجَهُمَا مِمَّا كَانَا فِيه (dan dikeluarkan dari keadaan semula) Yakni keadaan yang berupa kenikmatan dan kemuliaan, atau surga. Penyebutan bahwa Iblis adalah yang mengeluarkan mereka berdua adalah karena Iblislah yang menggoda mereka agar memakan buah terlarang dengan menyebut itu adalah buah kekekalan dan kejayaan yang tak akan sirna; sehingga Allah menyuruh mereka keluar dari surga. وَقُلْنَا اهْبِطُوا (dan Kami berfirman: “Turunlah kamu!) Perintah ini ditujukan kepada Adam dan Hawa -dan keturunan mereka- agar keluar dari surga yang tinggi menuju bumi ini. بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ (sebagian kamu menjadi musuh bagi yang lain) Yakni keturunan Nabi Adam akan saling memusuhi. Dan musuh kebalikan dari teman, sedangkan permusuhan adalah perbuatan zalim yang jelas. وَلَكُمْ فِي الْأَرْضِ مُسْتَقَرٌّ (dan bagi kamu ada tempat kediaman di bumi) Yakni tempat untuk tinggal وَمَتَاعٌ (dan kesenangan hidup) Yakni sesuatu untuk dinikmati seperti makanan, minuman, pakaian, dan lain sebagainya. إِلَىٰ حِينٍ (sampai waktu yang ditentukan) Yakni sampai datang kematian, atau menurut pendapat lain, sampai hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian setan menempatkan mereka pada suatu kesalahan yaitu perbuatan dosa dan menjauhkan keduanya dari surga, dan kami mengeluarkan keduanya dari tempat mereka yaitu kenikmatan surga akibat bujukan, godaan, dan ajakan setan bahwa pohon itu adalah pohon keabadian. Kemudian kami befirman kepada Adam, Hawa’ dan Iblis: “Turunlah kalian ke bumi! keturunan kalian akan saling bermusuhan, yaitu permusuhan antara keimanan dan kekafiran sampai hari kiamat, dan bagi kalian di bumi tempat tinggal yang tetap, kesejahteraan, rejeki, dan itu dapat kalian nikmati sampai waktunya tiba, yaitu kematian di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu, setan menggelincirkan keduanya dari surga} lalu setan menempatkan keduanya dalam kesalahan supaya bisa menjauhkan mereka dari surga {Lalu mengeluarkan keduanya dari sesuatu yang dinikmati keduanya. Kami berfirman, “Turunlah kalian! Sebagian kalian menjadi musuh bagi yang lain dan bagi kalian di bumi ada tempat tinggal} tempat tinggal {dan kesenangan} kesenangan hidup {sampai waktu yang ditentukan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Akhirnya mereka berdua terpedaya dan menaati setan, maka Allah mengeluarkan mereka berdua dari kondisi semula yang penuh kenikmata dan makanan yang banyak, dan mereka berdua di turunkan ke negeri yang penuh kelelahan, kerja keras, dan perjuangan; “sebagian kamu menjadi musuh bagi yang lain, ” maksudnya Adam dan keturunannya sebagai musuh bagi iblis dan keturunannya. Telah diketahui bahwasanya seorang musuh selalu berusaha dan berjuang untuk membahayakan musuhnya dan menjahatinya dengan segala cara, serta menghalanginya dari kebaikan dengan segala cara pula, termasuk dalam kandungan hal ini adalah peringatan kepada anak cucu Adam dari godaan setan. Sebagaimana firman Allah : \"Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu), karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala\" (QS. Fatir : 6) \"Dan (ingatlah) ketika Kami berfirman kepada para malaikat: “Sujudlah kamu kepada Adam, maka sujudlah mereka kecuali Iblis. Dia adalah dari golongan jin, maka ia mendurhakai perintah Tuhannya. Patutkah kamu mengambil dia dan turanan-turunannya sebagai pemimpin selain daripada-Ku, sedang mereka adalah musuhmu? Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim.\" (QS. Al-Kahfi : 50) Kemudian Allah menyebutkan puncak maksud dari “menurunkan” seraya berfirman, “Dan bagimu ada tempat kediaman di bumi, ” maksudnya tempat tinggal dan tempat menetap, “dan kesenangan hidup sampai waktu yang ditentukan, ” maksudnya waktu habisnya ajal kalian kemudian kalian pindah darinya menuju kepada negeri yang kalian diciptakan untuknya dan dia di ciptakan untuk kalian. Di dalam ayat tersebut terkandung dalil yang menunjukkan bahwa kehidupan ini hanya sementara, yang berlalu, yang bukan tempat tinggal sebenarnya, namun hanya sebagai tempat lewat agar mengambil bekal padanya untuk negeri tujuan tersebut, dan tidak di huni untuk menetap."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فَأَزَلَّهُمَا Fa azzalahumaa : Maka Iblis menempatkan mereka berdua dalam penyelewengan, yaitu dengan tidak mengindahkan larangan Allah agar tidak memakan buah dari pohon itu. مُسۡتَقَرّٞ Al-Mustaqorrru adalah tempat untuk menetap dan tinggal. إِلَىٰ حِينٖ Al-Hiin adalah Waktu yang tidak terbatas secara mutlak, bisa jadi hanya sebentar atau lebih lama. Namun yang dimaksud dalam ayat adalah sampai akhir kehidupan mereka. Makna ayat : Sedangkan pada ayat 36 Allah Ta’ala memberitahukan bahwa Syaithan telah menjerumuskan Adam beserta istrinya dalam sebuah kesalahan. Dimana setan telah melakukan tipu daya hingga membuat Adam dan Hawa memakan buah dari pohon yang terlarang. Sehingga nampaklah aurat mereka berdua dan akhirnya tidak diperkenankan lagi untuk tinggal di surga, dan diturunkan ke bumi bersama dengan musuhnya yaitu Iblis. Agar mereka menjadi musuh satu sama lain sampai akhir kehidupan. Pelajaran dari ayat : 3. Setan menjadi musuh besar manusia, maka wajib untuk mengetahui hal itu agar bisa terhindar dari was-was yang dihembuskannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 36: Allah mengabarkan bahwasanya setan menghiasi Adam dan istrinya untuk memakan buah dari satu pohon yang terlarang . setan mengabarkan kepada keduanya bahwasanya yang memakan buah dari pohon tersebut akan menjadikan kekal di dalam surga dan setan bersumpah sesungguhnya ia adalah penasihat dan ikhlas menasehati keduanya . setan tidak akan pernah memberikan was-was bagi mereka berdua sampai mereka jatuh kepada kesalahan yang mengakibatkan hilangnya kenikmatan dari mereka berdua dan dikeluarkannya mereka berdua dari surga dan kenikmatannya . Oleh sebab itu Allah memerintahkan Adam dan Hawa serta iblis untuk turun ke bumi , dan Allah jadikan diantara mereka masing-masing atau satu sama lain menjadi musuh ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Adam dan Hawa dengan tipu daya dan bisikan setan akhirnya memakan buah pohon yang dilarang itu, yang mengakibatkan keduanya keluar dari surga. yang dimaksud dengan setan di sini ialah iblis yang disebut dalam surat Al Baqarah ayat 34 di atas. Maksud Keadaan semula ialah kenikmatan, kemewahan dan kemuliaan hidup dalam surga. Yakni Adam dan keturunannya menjadi musuh bagi Iblis dan keturunannya, dan sudah menjadi maklum bagi yang namanya musuh tentu akan berusaha sekuat tenaga menimpakan madharat kepada musuhnya, mendatangkan keburukan dengan berbagai cara dan menghalanginya dari memperoleh kebaikan. Dalam ayat tersebut terdapat peringatan Allah Ta'ala kepada bani Adam agar waspada terhadap setan. Ayat ini menerangkan bahwa dunia yang kita tempati ini bukanlah tempat tinggal yang sesungguhnya dan bahwa kita hidup di dunia hanya sementara sebagai ladang beramal menuju akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 36",
    "description": "Lalu setan memperdayakan keduanya dengan berbagai macam cara agar mereka keluar dari dalam surga sehingga keduanya benar-benar dikeluarkan dari segala kenikmatan ketika keduanya di sana, yakni di dalam surga. Sebagai manusia yang tercipta dari tanah liat (materi), nabi adam mempunyai titik lemah yaitu keinginan untuk tetap abadi di dalam surga, karena surga adalah gudangnya materi. Adanya materi berarti keabadian. Setelah nabi adam dan hawa memakan buah larangan tersebut, keduanya mendapatkan sanksi berupa terlucutinya pakaian mereka sehingga mereka berdua mencari penutup auratnya dengan daun-daun pepohonan surga. Di samping itu, Allah memerintahkan mereka untuk turun ke dunia. Dan kami berfirman, turunlah kamu! sebagian kamu menjadi musuh bagi yang lain, yakni antara manusia (nabi adam) dengan setan, atau bisa juga antarsesama manusia. Dan bagi kamu, manusia dan setan, ada tempat tinggal dan kesenangan di bumi sampai waktu yang ditentukan, yakni hari kiamat. Selanjutnya nabi adam dan hawa dipersilakan Allah untuk hidup menetap di dunia, memanfaatkan fasilitas-fasilitas yang ada di bumi, baik berupa makanan, minuman, tempat tinggal, flora, fauna, dan lain-lainnya, sampai pada masa yang ditentukan, yaitu pada saat kematiannya yang tidak tahu kapan hal itu datang. Inilah babak baru bagi adam dalam menjalani misi kekhalifahannya di bumi. Nabi adam dan hawa merasakan penyesalan yang sangat dalam atas kejadian yang baru saja berlalu. Keduanya tersadar telah diperdayakan oleh setan. Lalu keduanya meminta ampun kepada Allah. Kemudian adam menerima beberapa kalimat, yakni doa penyesalan dan permintaan tobat, sebagaimana tersirat dalam surah al-ara'f/7: 23, dari tuhannya, kemudian mereka bertobat, lalu dia pun menerima tobatnya. Sungguh, Allah maha penerima tobat, maha penyayang."
  }
]