[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Adam menerima beberapa kalimat yang diilhamkan Allah kepadanya untuk bertaubat dan memohon ampunan kepada Nya, yaitu firman Allah : قَالَا رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ \"Keduanya berkata: \"Ya Tuhan kami, kami telah menganiaya diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya pastilah kami termasuk orang-orang yang merugi.\" [QS Al-A'raaf ayat 23] Maka Allah menerima Taubat Adam dan mengampuni dosanya. dan sesungguhnya Dia Maha Penerima Taubat orang yang bertobat dari para hamba-Nya lagi maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Kemudian Adam mengambil kata-kata yang Allah limpahkan kepadanya dan menjadikannya sebagai doa. Yaitu doa yang tersebut di dalam firman Allah, \"Keduanya berkata, 'Ya Rabb kami, kami telah menganiaya diri kami sendiri. Dan jika Engkau tidak mengampuni kami dan (tidak) merahmati kami, niscaya kami termasuk orang-orang yang merugi'.\" (QS. Al-A'rāf: 23). Maka Allah menerima taubatnya dan mengampuni kesalahannya, karena Allah suka sekali menerima taubat hamba-hamba-Nya dan sangat menyayangi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Lalu Adam menerima ilham dari Allah berupa kalimat-kalimat untuk bertaubat dan beristighfar, sehingga Allah menerima taubatnya dan mengampuninya. Dialah Allah yang Maha Menerima taubat dari hamba-hamba-Nya yang berbuat dosa, serta Maha Pengasih bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. فَتَلَقَّىٰ آدَمُ مِنْ رَبِّهِ كَلِمَاتٍ (Kemudian Adam menerima beberapa kalimat dari Tuhannya) yakni kalimat doa yang dilantunkan oleh Adam dan Hawa yang terdapat pada surat al-A’raf:23 yang diilhamkan Allah kepada mereka berdua: رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ “Ya Tuhan kami, kami telah menganiaya diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya pastilah kami termasuk orang-orang yang merugi.” فَتَابَ عَلَيْهِ (maka Allah menerima taubatnya) yakni Allah kemudian merahmati mereka dan menerima taubatnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya Allah -عز وجل- maha pengasih dan maha lemah lembut, Dia mengilhamkan kepada hamba-Nya yang berbuat salah bagaimana ia memohon ampun atas kesalahan itu, jika hamba mengahadap kepada-Nya dengan memohon ampun Dia gembira menyambut kedatangannya, dan kepadanya segala kebaikan akan cepat Ia berikan; untuk itu Allah tidak meninggalkan Adam mengahdapi sendiri akibat dari kesalahannya, tetapi Dia -جل جلاله- mengajarkannya bagaimana ia kembali kepada tuhannya dan terbebas dari dosa kesalahan yang telah ia perbuat : { فَتَلَقَّىٰ آدَمُ مِنْ رَبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ ۚ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ } \"Kemudian Adam menerima beberapa kalimat dari Tuhannya, maka Allah menerima taubatnya. Sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Lalu Allah mengilhamkan kepada Adam kalimat yang dia ucapkan yaitu (Rabbana Zhalamna Anfusana Wa In Lam Taghfir Lana Wa Tarhamna Lanakunanna Minal Khasirin){Ya Tuhan Kami, Kami telah menzhalimi diri kami sendiri, bila engka tidak mengampuni kami, tidak mengasihi kami, sungguh kami termasuk orang-orang yang merugi} [QS Al-A’raf/23] Kemudian Allah menerima taubatnya. Maha Suci Allah, Dzat yang Maha menerima taubat dan Maha mengasihi hamba-hambanya yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Adam menerima} lalu Adam menerima {beberapa kalimat dari Tuhannya} yaitu firmanNya (Wahai tuhan Kami, Kami telah menzalimi diri kami, dan jika Engkau tidak mengampuni kami dan mengasihi kami maka sungguh kami akan termasuk dalam golongan orang-orang yang merugi) [QS Al-A’raf 23] {lalu Allah menerima taubatnya. Sesungguhnya Dialah Yang Maha menerima taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Kemudian Adam menerima, ” maksudnya , mengambil dan menerima serta Allah mengilhamkan kepadanya, ”beberapa kalimat dari tuhannya.” Nabi Adam mengakui kesalahannya, lalu memohon ampunan kepada Allah, “maka Allah menerima taubatnya, ” dan merahmatinya, ” “sesungguhnya Allah maha penerima taubat” bagi orang yang bertaubat dan kembali kepadaNya. Penerimaan taubat oleh Allah ada dua macam, yaitu pertama, taufik kepadanya, kedua, penerimaanNya terhadap taubat hambaNya apabila syarat-syarat taubatnya telah sempurna. “Lagi Maha penyayang” kepada hamba-hambaNya, dan di antara kasih sayangNya kepada mereka adalah taufikNya bagi mereka untuk bertaubat dan maaf serta ampuna Allah bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فَتَلَقَّىٰٓ ءَادَمُ Fa talaqqo Adam : Adam ‘alaihissalam mengambil apa yang Allah berikan berupa kalimat-kalimat taubat. كَلِمَٰتٖ Kalimaatin : Yang dimaksud dengan kalimat-kalimat taubat di sini adalah firman Allah Ta’ala فَتَابَ عَلَيۡهِۚ Fa taaba ‘alaihi : Allah memberikan taufikNya kepada Adam untuk bertaubat, maka kemudian dia bertaubat dan Allah menerima taubatnya. Karena Allah Ta’ala Maha menerima taubat lagi Maha penyayang. Makna ayat : Pada ayat 37 Allah Ta’ala mengabarkan bahwa Adam menerima beberapa kalimat taubat dari Rabbnya, yaitu firman Allah; “Ya tuhan kami, kami telah mendzalimi diri-diri kami, jika engkau tidak mengampuni dosa kami dan merahmati kami niscaya kami termasuk orang-orang yang merugi.” Maka Adam dan Hawa mengucapkan kalimat taubat itu dan Allah Ta’ala mengampuni mereka, karena Allah yang Maha menerima taubat lagi Maha Penyayang. Pelajaran dari ayat : 4. Kewajiban untuk bertaubat dari dosa-dosa, dengan cara memohon ampunan setelah mengakui perbuatan dosa dan meninggalkannya, serta menyesal karena telah melakukan perbuatan dosa itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 37: Allah kemudian mengabarkan bahwasanya Adam mengeluarkan atau mengatakan ucapan taubat dan memohon ampun atas apa yang setelah ia langgar perintah Allah maka Adam bertaubat kepada Allah sebagaimana disebutkan dalam Al A'raf ayat 23."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentang beberapa kalimat (ajaran-ajaran) dari Allah yang diterima oleh Adam sebagian ahli tafsir mengartikannya dengan kata-kata untuk bertobat, yaitu ucapan \"Rabbanaa zhalamnaa anfusanaa…dst (lih. Surat Al A'raaf: 23) Tobat dari-Nya ada dua; diberi-Nya taufiq (dorongan) untuk bertobat dan diterima-Nya tobat seseorang ketika telah terpenuhi syarat-syaratnya. Diberi-Nya taufiq untuk bertobat termasuk kasih sayang-Nya sebagaimana diajarkan-Nya kepada Adam kalimat untuk bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 37",
    "description": "Nabi adam dan hawa merasakan penyesalan yang sangat dalam atas kejadian yang baru saja berlalu. Keduanya tersadar telah diperdayakan oleh setan. Lalu keduanya meminta ampun kepada Allah. Kemudian adam menerima beberapa kalimat, yakni doa penyesalan dan permintaan tobat, sebagaimana tersirat dalam surah al-ara'f/7: 23, dari tuhannya, kemudian mereka bertobat, lalu dia pun menerima tobatnya. Sungguh, Allah maha penerima tobat, maha penyayang. Untuk menghapus kemungkinan kesalahpahaman bahwa perintah turun itu hanya dari satu tingkat ke tingkat lain yang lebih rendah di dalam surga, Allah mengulangi lagi perintah itu pada ayat ini. Kami berfirman, turunlah kamu semua, yakni setan dan manusia, dari surga! kemudian jika benar-benar datang petunjuk-ku melalui penyampaian para nabi kepadamu, wahai adam dan pasanganmu serta anak cucumu, maka barang siapa mengikuti petunjuk-ku, tidak ada rasa takut pada mereka terhadap hal-hal negatif yang akan terjadi dan mereka juga tidak akan bersedih hati terhadap hal-hal negatif yang sudah terjadi."
  }
]