[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada mereka: \"turunlah kalian dari surge, akan datang kepada kalian dan keturunan pengganti kalian wahyu yang mengandung hidayah bagi kalian kepada kebenaran. Barang siapa mengamalkannya maka tidak ada kekhawatiran terhadap mereka berkaitan dengan apa yang akan mereka hadapi di akhirat dan mereka tidak bersedih atas apa-apa yang tidak mereka raih di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Kami berfirman kepada mereka, “Turunlah kalian semua dari surga menuju bumi. Jika ada hidayah (petunjuk) yang datang kepadamu melalui utusan-utusan-Ku, maka siapa yang mengikutinya dan beriman kepada utusan-utusan-Ku niscaya mereka tidak akan dilanda kekhawatiran, dan mereka pun tidak bersedih hati atas kesenangan dunia yang mereka lewatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Kemudian Allah memerintahkan mereka untuk turun dari surga, dan memberi kabar gembira baginya dan keturunannya bahwa petunjuk menuju kebenaran akan datang kepada mereka, barangsiapa yang mengamalkan petunjuk tersebut niscaya ia tidak akan mengalami ketakutan dan penyesalan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. فَإِمَّا يَأْتِيَنَّكُمْ مِنِّي هُدًى (Kemudian jika datang petunjuk-Ku kepadamu) Yang dimaksud dengan petunjuk adalah kitabullah. فَمَنْ تَبِعَ هُدَايَ (maka barang siapa yang mengikuti petunjuk-Ku) Yakni menerima (apa yang ada dalam) kitab tersebut dan mengamalkannya. فَلَا خَوْفٌ (niscaya tidak ada kekhawatiran) Dan kata (الخوف) kekhawatiran hanya dipakai untuk hal yang akan terjadi di masa depan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَإِمَّا يَأْتِيَنَّكُمْ مِنِّي هُدًى } Janganlah kamu meminta petunjuk kecuali dari Allah -عز وجل- , karena hanya Dialah yang dapat mendatangkan petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah SWT berfirman kepada orang-orang yang melanggar perintahNya: “Turunlah kalian dari surga! dan jika datang kepada kalian petunjuk dariKu yaitu kitabKu, maka barangsiapa menerimanya dan mengamalkannya, niscaya tidak ada kekhawatiran bagi mereka tentang siksa akhirat dan mereka tidak sedih terhadap apa yang meninggalkan mereka di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami berfirman,“Turunlah kalian semua dari surga. Lalu, jika benar-benar datang petunjukKu kepada kalian. Siapa saja yang mengikuti petunjukKu, maka tidak ada rasa takut yang menimpa mereka dan mereka tidak bersedih hati.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Allah mengulangi kata menurunkan agar tersambung jelas dengan apa yang disebutkan yaitu firmanNya, “ kemudian jika datang petunjukKu kepadamu, ” yakni di waktu dan zaman apa pun petunjukKu datang kepadamu wahai sekalian makhluk, berupa seorang Rosul dan sebuah kitab suci yang menunjukkan kalian kepada perkara yang mendekatkan kalian kepadaKu dan kepada ridhaKu; maka barangsiapa di antara kalian yang mengikuti petunjukKu, yaitu dengan beriman kepada RosulKu dan kitabKu lalu mengambil petunjuk dari mereka, dan hal tersebut direalisasikan dengan membenarkan segala kabar-kabar para rosul dan kitab-kitab, dan menunaikan perintah-perintah dan menjauhi larangan-larangan (di dalamnya), “niscaya tidak ada kekhawatiran atas mereka, dan tidak pula mereka bersedih hati, ” dalam ayat lain \"barang siapa yang mengikuti petunjuk-Ku maka dia tidak akan sesat dan tidak akan celaka\" (QS. Thoha : 123) Allah mengimplikasikan bagi orang yang mengikuti petunjukNya empat perkara: Menghilangkan “kekhawatiran” dan “kesedihan”, dan perbedaan antara keduanya adalah bahwasanya suatu hal yang dibenci apabila telah berlalu, mengakibatkan kesedihan namun apabila hal itu adalah sesuatu yang ditunggu, maka mengakibatkan kekhawatiran, oleh karena itu Allah menghilangkan kedua hal itu dari orang yang mengikuti petunjuk, lalu apabila kedua hal tersebut telah hilang, niscaya terjadilah yang kebalikan dari keduanya yaitu rasa aman yang sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱهۡبِطُواْ مِنۡهَا جَمِيعٗاۖ maknanya Turunlah kalian semuanya dari surga ke bumi agar kalian hidup sebagai musuh satu sama lain. فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى : Jika datang hidayah (petunjuk) dari Rabb kalian. Petunjuk disini maksudnya adalah syariat yang tertulis dalam kitab dan dijelaskan oleh para Rasul. فَمَن تَبِعَ هُدَايَ : Yaitu barangsiapa yang mengambil dan menerapkan syariatku dan tidak menyelisihinya dan tidak berpaling darinya. فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ : Ini adalah bentuk jawaban dari pernyataan “Barangsiapa yang mengikuti petunjukKu” yang artinya mengikuti petunjuk dari Allah akan membuat hamba tidak merasa takut lagi bersedih di dunia dan di akhirat. Makna ayat : Allah Ta’ala memberitahukan bahwa Dia telah memerintahkan Adam, Hawa, dan Iblis untuk turun ke bumi setelah Setan berusaha meniupkan was-was kepada Adam dan Hawa, sehingga mereka berdua memakan buah dari pohon yang terlarang. Kemudian Allah memberitahukan kepada mereka apabila datang petunjuk maka ikutilah petunjuk itu, tidak menyimpang darinya agar mereka aman dan bahagia, serta tidak merasa takut lagi merasa sedih. Pelajaran dari ayat : 1. Maksiat akan menyebabkan kesengsaraan dan terhalang dari rahmat Allah. 2. Beramal dengan berlandaskan Al-Qur’an dan As-sunnah akan membuat orang yang mengamalkannya merasa aman dan bahagia. Sedangkan berpaling dari keduanya akan membuat orang merasakan ketakutan dan kesedihan, serta merasakan kesengsaraan dan terhalang dari rahmat Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 38: Allah mengulangi perintahnya kepada Adam dan Hawa untuk turun ke bumi dan menjelaskan kepada mereka berdua bahwasanya akan datang kepada mereka keturunan yang berikan petunjuk di atas kebenaran atas mereka. dan dengan hal itu maka diturunkan lah utusan Allah dan kitab ; maka barangsiapa yang beriman ikuti petunjuk allah , tiada keraguan atas mereka dan tidak juga bagi mereka kesedihan ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari rasul dan kitab yang dibawanya kepada kamu wahai jin dan manusia. Yaitu dengan beriman kepada rasul tersebut dan kitab yang dibawanya serta menjadikannya sebagai petunjuk; dengan membenarkan berita yang mereka sampaikan dan yang tercantum dalam kitab-kitab itu serta mengikuti perintah yang ada dan menjauhi larangannya. Terhadap hal yang akan datang dari perkara akhirat. Terhadap hal yang telah luput dari perkara dunia. Khawatir itu terjadi karena sesuatu yang tidak disukainya bisa menimpanya di masa mendatang, sedangkan kesedihan terjadi karena sesuatu yang tidak disukai telah menimpa di masa lalu. Di dalam ayat ini, Allah Ta'ala menghilangkan kedua hal tersebut menunjukkan bahwa mereka akan memperoleh keamanan yang sempurna. Di dalam ayat lain, yaitu surat Thaahaa ayat 23 diterangkan bahwa orang yang mau mengikuti petunjuk Allah, maka ia tidak akan sesat dan tidak akan celaka, yakni menunjukkan ia akan memperoleh petunjuk (lawan sesat) dan akan memperoleh kebahagiaan (lawan celaka). Dengan demikian, orang yang mau mengikuti petunjuk Allah akan memperoleh kemananan, petunjuk dan kebahagiaan di dunia dan akhirat –nas'alullah an yaj'alanaa minhum-."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 38",
    "description": "Untuk menghapus kemungkinan kesalahpahaman bahwa perintah turun itu hanya dari satu tingkat ke tingkat lain yang lebih rendah di dalam surga, Allah mengulangi lagi perintah itu pada ayat ini. Kami berfirman, turunlah kamu semua, yakni setan dan manusia, dari surga! kemudian jika benar-benar datang petunjuk-ku melalui penyampaian para nabi kepadamu, wahai adam dan pasanganmu serta anak cucumu, maka barang siapa mengikuti petunjuk-ku, tidak ada rasa takut pada mereka terhadap hal-hal negatif yang akan terjadi dan mereka juga tidak akan bersedih hati terhadap hal-hal negatif yang sudah terjadi. Adapun sebaliknya, orang-orang yang kafir dan mendustakan ayat-ayat kami dan enggan bertobat, mereka itu penghuni neraka. Mereka kekal di dalamnya bukan saja karena mereka kafir, tetapi juga karena mereka mendustakan ayat-ayat kami, yakni tahu dan mengerti ayat-ayat kami, tetapi menolaknya."
  }
]