[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang membenarkan semua yang diturunkan kepadamu wahai Rasul dari Alquran dan segala yang diturunkan kepadamu berupa Al Hikmah yaitu as-sunnah. Dan kepada semua yang yang diturunkan kepada para rasul sebelum mu berupa kitab-kitab seperti taurot, Injil dan kitab-kitab lainnya. dan mereka juga membenarkan adanya Negeri kehidupan setelah kematian dan segala yang akan terjadi di sana berupa perhitungan dan pembalasan amal perbuatannya. pembenaran ini dengan hati mereka yang kemudian diperlihatkan oleh lisan dan anggota tubuh mereka. Secara khusus hari akhir disebutkan disini karena iman kepadanya termasuk diantara dorongan paling penting untuk berbuat ketaatan, menjauhi perkara-perkara yang diharamkan dan melakukan introspeksi diri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3-4. (Orang-orang yang bertakwa itu adalah) orang-orang yang beriman kepada perkara gaib, yaitu segala sesuatu yang tidak bisa ditangkap oleh panca indera dan tersembunyi, yang diberitakan oleh Allah atau Rasulullah seperti hari Akhir. Dan orang-orang yang mendirikan salat, yakni menunaikannya sesuai ketentuan syariat yang meliputi syarat, rukun, wajib dan sunnahnya. Dan mereka adalah orang-orang yang gemar menginfakkan sebagian rezeki yang mereka terima dari Allah, baik yang sifatnya wajib seperti zakat, maupun yang tidak wajib seperti sedekah, demi mengharap pahala dari Allah. Mereka juga yang beriman kepada wahyu yang Allah turunkan kepadamu –wahai Nabi- dan wahyu yang Dia turunkan kepada para nabi -'alaihimussalām- sebelum kamu, tanpa membeda-bedakan di antara mereka. Dan mereka juga beriman secara tegas akan adanya akhirat beserta ganjaran dan hukuman yang ada di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ َ Yakni orang-orang yang mempercayai apa yang kau bawa dari Allah Ta’ala dan apa yang dibawa oleh Rasul-Rasul sebelummu tanpa membeda-bedakan mereka dan tidak mengingkari mereka. Bukan orang-orang yang mempercayai apa yang dibawa oleh Rasul-Rasul sebelummu kemudian mengingkari apa yang kau bawa dari Allah Ta’ala. وَبِالْآخِرَةِ هُمْ يُوقِنُون Yakni mereka meyakini hari kebangkitan, hari mereka dikumpulkan di Mahsyar, dan semua hal yang berhubungan dengan akhirat seperti hari kiamat, surga, neraka, hisab, dan mizan tanpa keraguan sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Meyakini apa yang diwahyukan kepadamu wahai Muhammad dari Al-Qur’an dan apa yang diwahyukan kepada rasul-rasul sebelum kamu dari kitab-kitab sebelumnya; membenarkan rumah akhirat dan apa yang ada di dalamnya yang berupa kebangkitan, surga, neraka, perhitungan amal, jembatan shirat, dan timbangan amal; dan mengimani semua itu tanpa ragu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan orang-orang yang beriman pada (Al-Qur’an) yang diturunkan kepadamu dan (kitab-kitab suci) yang telah diturunkan sebelummu dan mereka juga meyakini adanya akhirat} mereka membenarkan hal tersebut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Kemudian Allah berfirman, ”dan mereka yang beriman kepada apa yang telah diturunkan kepadamu” yaitu al-qur’an dan assunnah. Maka orang-orangb yang bertakwa itu beriman kepada seluruh perkara yang datang dari Rosul, dan mereka tidak membedakan antara sebagian dengan lainnya dari apa yang diturunkan kepadanya, di mana dia beriman dari sebagiannya dan tidak beriman dengan sebagiannya, baik dengan cara mengingkarinya atau dengan mentakwilkannya dari maksud yang dikehendaki oleh Allah dan RosulNya sebagaimana yang dilakukan oleh orang-orang yang melakukan bid’ah yang mentakwilkan nash-nash yang bertentangan dengan pendapat mereka, yang pada implikasinya tidak mempercayai makna-maknanya walaupun mereka mempercayai kata-katanya, sehingga (hakikatnya) mereka tidak beriman kepadanya secara hakiki. Dan firmanNya, “dan apa yang telah diturunkan sebelummu, ” meliputi keimanan kepada seluruh kitab-kitab terdahulu, dan keimanan kepada kitab-kitab yang mencakup keimanan kepada rosul-rosul dan kepada hal-hal yang meliputinya, khususnya, Taurat , Injil dan Zabur. Dan ini adalah keistimewaan kaum Mukminin yang beriman kepada kitab-kitab langit seluruhnya, dan kepada seluruh rosul-rosul dan mereka tidak membeda-bedakan salah satu di antara mereka. Kemudian Allah berfirman, ” serta mereka yakin akan adanya akhirat”. Akhirat adalah sebuah nama bagi kehidupan yang ada setelah kematian, dan disebutkannya secara khusus setelah kata yang umum, adalah karena keimanan kepada Hari Akhirat termasukm salah satu dari rukun iman, dan karena merupakan pendorong yang paling besar dalam hal harapan , kekhawatiran dan beramal. Sedangkan keyakinan adalah ilmu yang sempurna yang padanya tidak ada keraguan sedikit pun yang membuahkan perbuatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ Yu’minuuna bimaa unzila ilaika dengan membenarkan wahyu yang diturunkan kepada engkau wahai Rasul yaitu Al-Qur’an dan sunnah. وَمَآ أُنزِلَ مِن قَبۡلِكَ Wa Maa unzila min qoblika maknanya dan mereka beriman terhadap kitab-kitab yang Allah turunkan kepada rasul-rasul yang sebelumnya seperti Taurat, Injil, dan Zabur. وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ Wa bil Aakhiroti hum yuuqinuun maknanya dengan kehidupan akhirat dan kejadian-kejadian yang ada pada saat itu seperti hisab, penghitungan pahala, dan pembalasan. Mereka mengetahui dan meyakini tanpa ada keraguan sedikitpun, karena sempurnanya iman dan besarnya ketakwaan. Makna ayat : Ditambah serta beriman terhadap kitab-kitab Allah dan iman kepada hari akhir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 4: Allah kemudian menyebutkan bahwa sifat mereka yang bertaqwa adalah mereka membenarkan apa yang diturunkan kepada para nabi yang sebelummu wahai Nabi Allah yaitu Al-Qur’an, mereka juga membenarkan kitab-kitab samawiyyah yang diturunkan kepada para nabi sebelummu, dan mereka juga mengimani hari akhir yaitu hari kiamat, mereka juga mengetahui dengan ilmu yakin yang ada tiga macam : 1. Yakin dengan berita : Ia adalah ilmu yakin yang sempurna (dengan membenarkan), dalilnya adalah firman Allah : Sekali-kali tidak, seandainya kalian mengetahui dengan ilmu yakin. (At-Takatsur : 5) 2. Yakin dengan cara melihat : Ia adalah ainul yakin (keyakinan dengan cara melihat), dalilnya adalah firman Allah : Kemudian kalian akan melihat dengan mata-mata kalian sendiri. (At-Takatsur : 7) 3. Yakin secara langsung dan mengindra secara langsung akan sesuatu : Yaitu merasakan secara langsung dengan sebenar-benarnya keyakinan, dalilnya adalah firman Allah : Sesungguhnya ini adalah kebenaran yang pasti. (At-Takatsur : 7)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Al Qur'an, demikian juga apa yang diturunkan kepada Beliau berupa hikmah (As Sunnah). Kitab-Kitab yang telah diturunkan sebelum Nabi Muhammad shallallahu 'alaihi wa sallam. ialah kitab-kitab yang diturunkan sebelum Al Quran seperti: Taurat, Zabur, Injil dan Shuhuf-Shuhuf yang tersebut dalam Al Qur'an yang diturunkan kepada Para rasul. Allah menurunkan kitab kepada Rasul ialah dengan memberikan wahyu kepada Jibril 'alaihis salam., lalu Jibril menyampaikannya kepada rasul. Yakin ialah kepercayaan yang kuat dengan tidak dicampuri keraguan sedikitpun. Akhirat lawan dunia. Kehidupan akhirat ialah kehidupan sesudah mati dan sesudah dunia berakhir. yakin akan adanya kehidupan akhirat ialah benar-benar percaya akan adanya kehidupan sesudah mati (yaitu alam barzakh yang di dalamnya terdapat fitnah kubur, azab kubur dan nikmat kubur) dan sesudah dunia berakhir (seperti kebangkitan manusia, pengumpulan manusia di padang mahsyar, adanya hisab (pemeriksaan amalan), mizan (penimbangan amalan), surga dan neraka). Di antara hikmah mengapa Allah sering menyebutkan hari akhir dalam Al Qur’an adalah karena beriman kepada hari akhir memiliki pengaruh yang kuat dalam memperbaiki keadaan seseorang sehingga ia akan mengisi hari-harinya dengan amal shalih, ia pun akan lebih semangat untuk mengerjakan keta’atan itu sambil berharap akan diberikan pahala di hari akhir itu, demikian juga akan membuatnya semakin takut ketika mengisi hidupnya dengan kemaksiatan apalagi merasa tentram dengannya. Beriman kepada hari akhir juga membantu seseorang untuk tidak berlebihan terhadap dunia dan tidak menjadikannya sebagai tujuan hidupnya. Di antara hikmahnya juga adalah menghibur seorang mukmin yang kurang mendapatkan kesenangan dunia karena di hadapannya ada kesenangan yang lebih baik dan lebih kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 4",
    "description": "Dan ciri-ciri lainnya dari orang-orang yang bertakwa adalah mereka yang beriman kepada apa-apa yang diturunkan dari Allah kepadamu, wahai nabi Muhammad, berupa Al-Qur'an dan adz-dzikr (hadis), dan kitab-kitab yang telah diturunkan sebelum engkau, seperti taurat, zabur, injil, dan suhuf-suhuf (lembaran-lembaran) yang tidak seperti kitab, dengan tidak membeda-bedakannya, sebab risalah Allah pada mulanya satu, dan mereka yakin akan adanya kehidupan di akhirat setelah kehidupan di dunia ini, dengan penuh keyakinan di dalam hati yang dibuktikan secara lisan dan perbuatan. Mereka yang mempunyai ciri-ciri sebagaimana disebutkan itulah yang mendapat petunjuk dari tuhannya, berada pada posisi yang sangat mulia dan agung, sebab mereka menaati semua perintah dan menjauhi segala larangan-Nya, dan hanya mereka itulah orang-orang yang beruntung memperoleh apa yang mereka inginkan, yaitu kebahagiaan hidup di dunia dan keselamatan hidup di akhirat dengan dimasukkan ke dalam surga dan terbebas dari neraka."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Ayat ini masih merupakan penjelasan dari ayat sebelumnya tentang orang-orang yang bertaqwa. Allah ta’ala merinci beberapa karakteristik lain tentang orang-orang yang bertaqwa tersebut dalam ayat ini, diantaranya : Pertama, beriman kepada Kitab (Al Quran) dan Kitab-kitab yang telah diturunkan sebelum Alquran. Ibnu Abbas mengatakan, maksud dari ayat ini adalah “mereka membenarkan apa yang engkau bawa (Muhammad) dari Allah ta’ala dan apa yang dibawa oleh para Rosul sebelum dirimu. Mereka sama sekali tidak membedakan antara para Rosul tersebut serta tidak ingkar terhadap apa yang mereka bawa dari Rabb mereka. Dan mereka yakin akan adanya kebangkitan, kiamat,surge, neraka, perhitungan, dan timbangan.” Kedua, meyakini adanya hari akhir. Dinamai hari akhir (akhirat), karena ia ada setelah dunia. Yang meliputi masa setelah selesainya kehidupan dunia, mulai dari hari kebangkitan, mahsyar, hisab, mizan, shirot, surge dan neraka. Para ulama berbeda pendapat tentang siapa orang-orang disifati dalam ayat ini. Setidaknya terdapat tiga pendapat dalam masalah ini sebagaimana diriwayatkan oleh Ibnu Jarir : Pertama, orang-orang yang disifati Allah dalam ayat keempat surat Al-Baqoroh ini adalah mereka yang disifati dalam ayat sebelumnya, yaitu seluruh orang-orang yang beriman, baik dari orang arab, ahlu kitab dan yang lainnya. Pendapat ini dikemukakan oleh Mujahid, Abu al-Aliyah,Ar-Rabi’ bin Anas, dan Qotadah. Kedua, mereka itu adalah satu yakni orang-orang yang beriman dari kalangan ahlu kitab. Ketiga, mereka yang disifati di ayat sebelumnya adalah orang-orang arab dan yang disifati dalam ayat ini adalah orang beriman dari kalangan ahlu kitab. Pendapat ini dikemukakan oleh As-Suddi dalam tafsirnya dari Ibnu Abbas dan Ibnu Mas’ud dan beberapa sahabat dan dipilih juga oleh Ibnu Jarir, berdasarkan firman Allah pada ayat yang lain : وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللَّهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ Dan sesungguhnya diantara ahli kitab ada orang yang beriman kepada Allah dan kepada apa yang diturunkan kepada kamu dan yang diturunkan kepada mereka sedang mereka berendah hati kepada Allah (QS. Ali Imron :199) Dan firman-Nya : الَّذِينَ آَتَيْنَاهُمُ الْكِتَابَ مِنْ قَبْلِهِ هُمْ بِهِ يُؤْمِنُونَ - وَإِذَا يُتْلَى عَلَيْهِمْ قَالُوا آَمَنَّا بِهِ إِنَّهُ الْحَقُّ مِنْ رَبِّنَا إِنَّا كُنَّا مِنْ قَبْلِهِ مُسْلِمِينَ - أُولَئِكَ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ بِمَا صَبَرُوا وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ “Orang-orang yang telah Kami datangkan kepada mereka Al Kitab sebelum Al Quran, mereka beriman (pula) dengan Al Quran itu. Dan apabila dibacakan (Al Quran itu) kepada mereka, mereka berkata: \"Kami beriman kepadanya; sesungguhnya; Al Quran itu adalah suatu kebenaran dari Tuhan kami, sesungguhnya kami sebelumnya adalah orang-orang yang membenarkan(nya). Mereka itu diberi pahala dua kali disebabkan kesabaran mereka, dan mereka menolak kejahatan dengan kebaikan, dan sebagian dari apa yang telah Kami rezekikan kepada mereka, mereka nafkahkan.” (QS. Al-Qosos: 52-54) Dalam hadits riwayat Bukhori dan Muslim dari Abi Musa, bahwasanya Rosululloh sholallohu ‘alaihi wasallam bersabda : ثلاثة يؤتون أجرهم مرتين : رجل من أهل الكتاب آمن بنبيه وآمن بي ، ورجل مملوك أدى حق الله وحق مواليه ، ورجل أدب جاريته فأحسن تأديبها ثم أعتقها وتزوجه “ada tiga orang yang akan mendapat pahala dua kali : pertama seorang lelaki ahlu kitab yang beriman kepada Nabinya dan kepadaku, kedua seorang hamba sahaya yang memenuhi hak Allah dan hak tuannya, dan ketiga seorang laki-laki yang mengurus budak perempuannya dengan sebaik-baik pengurusan lalu kemudian dia memerdekakannya dan menikahinya” (HR. BUKHORI-MUSLIM) Ibnu katsir mengatakan, pendapat yang benar dari tiga pendapat diatas adalah pendapat Mujahid yang mengatakan bahwa empat ayat pertama dari surat Al-baqoroh menyifati orang-orang yang beriman, dan dua ayat berikutnya (enam dan tujuh) menyifati orang-orang kafir, dan tiga belas ayat setelahnya menyifati orang-orang munafik. Keempat ayat awal itu menyifati orang-orang beriman secara umum baik orang-orang beriman dari kalangan bangsa arab maupun selainnya dari kalangan ahli kitab baik umat manusia dan jin. Salah satu sifat ini tidak akan bisa sempurna tanpa ada sifat-sifat yang lainnya. Bahkan masing-masing sifat saling menuntut adanya sifat yang lainnya. Dengan demikian, iman kepada yang ghaib, shalat dan zakat tidak shohih kecuali jika ada keimanan kepada apa yang dibawa oleh rosululloh sholallohu ‘alaihi wasallam, juga apa yang dibawa oleh para Rosul sebelumnya serta keyakinan akan adanya kehidupan akhirat. Dan Allah juga telah memerintahkan orang-orang yang beriman untuk memenuhi hal tersebut melalui firman-Nya : يَا أَيُّهَا الَّذِينَ آَمَنُوا آَمِنُوا بِاللَّهِ وَرَسُولِهِ وَالْكِتَابِ الَّذِي نَزَّلَ عَلَى رَسُولِهِ وَالْكِتَابِ الَّذِي أَنْزَلَ مِنْ قَبْلُ وَمَنْ يَكْفُرْ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآَخِرِ فَقَدْ ضَلَّ ضَلَالًا بَعِيدًا Wahai orang-orang yang beriman, tetaplah beriman kepada Allah dan Rasul-Nya dan kepada kitab yang Allah turunkan kepada Rasul-Nya serta kitab yang Allah turunkan sebelumnya. Barangsiapa yang kafir kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sesungguhnya orang itu telah sesat sejauh-jauhnya. (QS. An-nisa : 136) Dan Allah telah menyebutkan tentang orang-orang yang beriman secara umum kesuluruhan yang memenuhi semuanya itu melalui firman-Nya : آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ Rasul telah beriman kepada Al Quran yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. (Mereka mengatakan): \"Kami tidak membeda-bedakan antara seseorangpun (dengan yang lain) dari rasul-rasul-Nya (QS. Al-Baqoroh : 285) Dan masih banyak ayat-ayat lain yang memerintahkan supaya beriman kepada Allah, rosul-rosul-Nya, dan kitab-kitab-Nya, khususnya orang mukmin dari kalangan ahlu kitab karena mereka beriman kepada apa yang ada ditangan mereka secara terperinci. Maka jika mereka masuk islam dan beriman kepadanya secara terperinci, mereka akan mendapatkan pahala dua kali."
  }
]