[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai keturunan Ya’kub Ingatlah nikmat-nikmat Ku yang banyak yang dilimpahkan kepada kalian dan bersyukurlah kepada Ku serta penuhilah wasiat Ku kepada kalian, yaitu Bahwa kalian akan mengimani kitab-kitab Ku dan rasul-rasul Ku semuanya serta mengamalkan ajaran-ajaran syariat Ku. Jika kalian mengamalkan hal itu, Aku akan penuhi apa-apa yang telah Aku janjikan kepada kalian berupa Rahmat di dunia dan keselamatan di akhirat. Dan hanya kepada Ku saja hendaknya kalian takut, dan waspadailah oleh kalian siksa Ku jika kalian melanggar perjanjian tersebut dan kalian kafir kepada Ku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Wahai anak-anak Nabiyullāh Ya’qūb, ingatlah akan nikmat-nikmat Allah yang datang bertubi-tubi kepada kalian dan syukurilah nikmat-nikmat itu. Dan pegang teguhlah janjimu kepada-Ku bahwa kamu akan beriman kepada-Ku, kepada rasul-rasul-Ku dan mengamalkan syariat-syariat-Ku. Jika kamu memenuhi janji itu, niscaya Aku akan menepati apa yang telah Aku janjikan kepada kalian, yaitu kehidupan yang baik di dunia dan balasan yang baik di hari kiamat. Takutlah hanya kepada-Ku dan jangan melanggar penjanjian-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Allah menyeru Bani Israil yang merupakan para keturunan Nabi Ya’qub; “Ingatlah kenikmatan-kenikmatan yang telah Aku berikan kepada kalian, dan jalankanlah perintah-Ku untuk beriman kepada para Rasul dan untuk menjalankan syariat. Jika kalian menjalankan hal itu niscaya Aku akan membalas kalian dengan kebahagiaan di dunia dan di akhirat. Dan hanya kepada-Ku hendaklah kalian takut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِسْرَائِيل (Israil) Yakni Nabi Ya’kub bin Ishaq bin Ibrahim, dan arti dari Israil adalah hamba Allah. Sedangkan makna bani Israil adalah keturunan dari Nabi Ya’kub dan mereka adalah orang-orang Yahudi. اذْكُرُوا (ingatlah) Yakni syukurilah nikmat yang telah Aku berikan kepada kalian yang berupa pengutusan rasul, penurunan kitab, penyelamatan dari Fir’aun, dan nikmat-nikmat yang lainnya. وَأَوْفُوا بِعَهْدِي (dan penuhilah janjimu kepada-Ku) Yakni janji yang kalian sepakati dalam taurat untuk mengikuti Nabi Muhammad Shallallahu ‘Alaihi Wasallam Shallallahu ‘Alaihi Wasallam; dan menurut pendapat lain janji untuk menjalankan segala kewajiban. أُوفِ بِعَهْدِكُمْ (niscaya Aku penuhi janji-Ku kepadamu) Yakni berupa ganjaran yang telah Aku jamin. وَإِيَّايَ فَارْهَبُونِ (dan hanya kepada-Ku-lah kamu harus takut (tunduk) Makna (الرهبة) yakni ketakutan yang sangat. Dan makna dari potongan ayat ini: jadikanlah dalam hati kalian ketakutan kepada-Ku, dan jangan kalian takut kepada selain-Ku"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara metode da'wah kepada Allah adalah : mengingatkan hamba-hamba Allah akan nikmat Allah atasnya; dengan cara ini akan lebih mudah hatinya menerima kebenaran itu, dan merupakan hujjah yang lebih kuat baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai keturunan Ya’kub! “Ingatlah nikmatKu atas kalian dan leluhur kalian, dengan menyelamatkan kalian dari banjir bandang dan kesesatan Fir’aun, menaungi dengan awan, menurunkan kitab, memilih rasul-rasul dari golongan kalian dan lain sebagainya. Penuhilah janjiKu kepada kalian dalam Taurat dengan mengikuti Muhammad SAW! Niscaya Aku akan memberi kalian sesuatu yang mengamankan kalian berupa balasan kebaikan dan pahala yang melimpah atas ketaatan (kalian), takutlah kalian kepadaKu dan janganlah takut kepada siapapun selain Aku!”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Bani Israil} wahai anak cucu Ya’kub {ingatlah nikmatKu yang telah Aku anugerahkan kepada kalian dan penuhilah janji kalian kepadaKu, niscaya Aku penuhi janjiKu kepada kalian. Hanya kepadaKu hendaknya kalian takut} maka takutlah kalian kepadaKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Hai Bani Israil.” Yang dimaksud dengan Israil adalah Nabi Ya’qub Alaihissalam, khitbah ini ditujukan kepada kelompok-kelompok dari Bani Israil, yang berada di Madinah dan sekitarnya, termasuk di dalamnya orang-orang yang datang setelahnya. Allah memerintahkan kepada mereka dengan suatu perintah yang bersifat umum seraya berfirman, ”Ingatlah akan nikmatKu yang telah Aku anugerahkan kepadamu,” yang termasuk didalamnya seluruh nikmat-nikmat yang akan disebutkan dalam surat ini sebagiannya, dan yang dimaksudkan dengan mengingatnya dengan hati adalah adanya pengakuan, dab dengan lisan adanya pujian, dan dengan anggota tubuh adalah dengan menggunakannya kepada hal-hal yang disukai oleh Allah dan di ridhaiNya, “dan penuhilah janjimu kepadaKu, ” maksudnya, apa-apa yang diamanatkannya kepada mereka berupa amanat iman kepadaNya, kepada Rosul-rosulNya dan menegakkan syari’atNya, ”niscaya Aku penuhi janjiKu kepadamu, ” maksudnya Allah memberikan ganjaran akan hal tersebut. Dan yang dimaksud adalah apa yang Allah sebutkan dalam firman-Nya: \"Dan sesungguhnya Allah telah mengambil perjanjian (dari) Bani Israil dan telah Kami angkat diantara mereka 12 orang pemimpin dan Allah berfirman: “Sesungguhnya Aku beserta kamu, sesungguhnya jika kamu mendirikan shalat dan menunaikan zakat serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka dan kamu pinjamkan kepada Allah pinjaman yang baik sesungguhnya Aku akan menutupi dosa-dosamu. Dan sesungguhnya kamu akan Kumasukkan ke dalam surga yang mengalir air didalamnya sungai-sungai. Maka barangsiapa yang kafir di antaramu sesudah itu, sesungguhnya ia telah tersesat dari jalan yang lurus.\" (QS. Al-Maidah : 12) Kemudian Allah memerintahkan mereka untuk melakukan sebab yang dapat mendorong mereka untuk menunaikan janjinya yaitu rahbah (takut akan pembalasan) dariNya dan khasyyah (takut disebabkan ma’rifat tentang keagungan) Nya semata, karena sesungguhnya orang yang khasyyah kepadaNya pastilah khasyyah itu akan mendorongnya untuk menaati perintahNya dan menjauhi laranganNya. Kemudian Allah memerintahkan kepada mereka dengan suatu perintah yang bersifat khusus yang mana keimanan mereka tidak akan sempurna dan tidak akan benar kecuali dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : بنو إِسۡرَٰٓءِيلَ : Israil adalah penambaan bagi Ya’qub bin Ishaq bin Ibrahim ‘alaihissalam, sedangkan anak-anak keturunan Israil yang dimaksud adalah Yahudi, karena darah keturunan mereka apabila dirunut kembali ke anak-anak Ya’qub yang jumlahnya dua belas. نِعۡمَتِيَ An-Ni’mah : Yang dimaksud dengan kenikmatan disini adalah kata benda yang menunjukkan jenisnya (isim jins) yang maknanya adalah jamak (kenikmatan-kenikmatan). Dan kenikmatan yang diberikan oleh Allah kepada Bani Israil amatlah banyak, akan disebutkan perinciannya pada ayat-ayat selanjutnya. أَوۡفُواْ بِعَهۡدِيٓ Aufuu bi’ahdiy : Menepati perjanjian adalah dengan menyempurnakannya. Pernjanjian Allah atas Bani Israil adalah agar mereka menjelaskan tentang kenabian Muhammad ﷺ dan beriman kepadanya. أُوفِ بِعَهۡدِكُمۡ Uufi bi’ahdikum : Menyempurnakan perjanjian kalian dengan memasukkan kalian ke dalam surga, dimana ketika di dunia Allah telah memuliakan dan meninggikan kedudukan kalian. وَإِيَّٰيَ فَٱرۡهَبُونِ Wa iyyaaya Farhabun : Makak takutlah kepadaKu dan jangan takut kepada selainKu. Makna ayat : Tatkala ayat-ayat sebelumnya menceritakan tentang Adam dan bagaimana Allah memuliakannya, dan sujudnya malaikat kepada Adam, serta bagaimana Iblis enggan untuk bersujud karena sombong, dan hasad yang disimpannya kepada Adam, ini semua diketahui oleh orang-orang Yahudi karena mereka memiliki kitab, sehingga Allah Ta’ala mengajak bicara Bani Israil untuk mengingatkan mereka akan kewajiban yang harus ditunaikan berupa keimanan dan keistiqomahan. Allah Ta’ala menyeru mereka dengan nama anak-anaknya Israil ‘alaihissalam untuk kemudian memerintah dan melarang mereka. Allah Ta’ala memerintahkan mereka agar mengingat nikmat-nikmat yang sudah didapatkannya agar mau bersyukur dengan berbuat ketaatan dan beriman kepada rasulNya yaitu Muhammad ﷺ beserta apa yang beliau bawa berupa petunjuk dan perintah untuk memenuhi janji yang sudah diambil dari mereka. Juga perjanjian agar mereka takut kepada Allah saja dan tidak takut kepada selainNya dari kalangan makhluk. Pelajaran dari ayat : 1. Kewajiban untuk menyebut kenikmatan-kenikmatan yang didapatkan sebagai wujud bersyukur kepada Allah atas kenikmatan yang didapat. 2. Kewajiban untuk menepati perjanjian apalagi perjanjian antara hamba dengan tuhannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 40: Kemudian Allah menyeru Bani Israil dan mereka adalah keturunan Yakub , Allah memerintahkan bagi mereka untuk mengingat nikmat Allah yang banyak diberikan kepada mereka. begitu pula Allah memerintahkan kepada mereka untuk bersyukur dan taat sebagaimana perintah Allah kepada mereka untuk bersegera mengerjakan perintah Allah kepada mereka yaitu : beriman kepada Allah, kepada kitab-kitab-Nya, kepada para utusan-Nya serta kepada syariat-syariat-Nya.; Maka jika mereka mengerjakannya, mereka akan Allah tolong dan Allah akan memuliakannya di dunia serta Allah akan muliakan di akhirat. Kemudian Allah memerintahkan untuk tidak takut kepada siapapun kecuali Dia. Israil adalah keturunan dari Ya’qub yang merupakan cucu dari bapaknya para nabi Ibrahim, yang mana ya’qub adalah bapak dari Yusuf dan saudara-saudara mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Israil adalah sebutan bagi Nabi Ya'qub. Bani Israil adalah keturunan Nabi Ya'qub; sekarang terkenal dengan bangsa Yahudi. Mencakup semua nikmat yang diberikan Allah kepada mereka, sebagian nikmat tersebut akan disebutkan dalam surat ini (lihat ayat 49 dan ayat-ayat setelahnya). Tujuan mengingatnya adalah agar mereka mengakui nikmat tersebut, memujinya dengan lisan dan menggunakan anggota badannya untuk mengerjakan perbuatan yang dicintai Allah dan diridhai-Nya. Janji Bani Israil kepada Allah ialah: bahwa mereka akan menyembah Allah dan tidak mempersekutukan-Nya dengan sesuatu apapun, serta beriman kepada rasul-rasul-Nya di antaranya Nabi Muhammad shallallahu 'alaihi wa sallam serta menegakkan syari'at-Nya sebagaimana yang disebutkan di dalam Taurat. Janji Allah kepada mereka adalah seperti yang disebutkan dalam surat Al Maa'idah: 12, yang artinya: \"Dan sesungguhnya Allah telah mengambil Perjanjian (dari) Bani Israil dan telah Kami angkat di antara mereka 12 orang pemimpin dan Allah berfirman: \"Aku bersama kamu, sesungguhnya jika kamu mendirikan shalat dan menunaikan zakat serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka dan kamu pinjamkan kepada Allah pinjaman yang baik, pasti Aku akan menutupi dosa-dosamu, dan pasti akan Aku masukkan ke dalam surga yang mengalir di bawahya sungai-sungai. Tetapi barang siapa kafir di antaramu setelah itu, maka sesungguhnya ia telah tersesat dari jalan yang lurus.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 40",
    "description": "Ayat ini dan beberapa ayat setelahnya berbicara tentang bani israil, yakni anak keturunan israil, nama lain dari nabi yakub, cucu nabi ibrahim. Mereka juga dikenal dengan sebutan yahudi. Wahai bani israil! ingatlah dan renungkanlah nikmat-nikmat-ku yang telah aku berikan kepadamu dan nenek moyangmu seperti turunnya petunjuk-petunjuk ilahi, penyelamatan dari musuh-Musuhmu, dan lain-lain. Dan penuhilah janjimu kepada-ku yang telah kamu nyatakan di dalam jiwamu, niscaya aku penuhi pula janji-ku kepadamu dengan memberi keselamatan dan kesejahteraan hidup di dunia serta pahala dan surga di akhirat nanti, dan takutlah serta tunduklah kamu hanya kepada-ku sajatuntunan pada ayat di atas dipertegas lagi dengan mengajak mereka memeluk islam yang dibawa oleh nabi Muhammad. Dan berimanlah kamu kepada apa, yakni Al-Qur'an, yang telah aku turunkan kepada nabi Muhammad yang membenarkan apa, yakni taurat, zabur, dan lain-lain, yang ada pada kamu, dan janganlah kamu menjadi orang yang pertama, yakni yang paling gigih dan paling keras mengingkari dan kafir kepadanya. Janganlah kamu jual, campakkan, atau tukar ayat-ayat ku dengan kemegahan duniawi dan dengan harga yang pada hakikatnya murah walaupun tampak mahal, dan bertakwalah hanya kepada-ku, sebab dengan itu kamu akan dapat menjalankan perintah-ku dan meninggalkan larangan-ku, sehingga kamu tidak terjerumus dalam kesesatan."
  }
]