[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berimanlah -wahai Bani Israil- kepada Alquran yang aku turunkan kepada Muhammad nabi dan rasul Ku, yang isinya sesuai dengan apa yang kalian ketahui melalui Taurat yang masih benar. Dan janganlah kalian menjadi kelompok pertama dari kalangan ahli kitab yang kafir kepadanya dan jangan pula kalian menukarkan ayat-ayat Ku dengan harga yang murah dari kenikmatan dunia yang akan sirna, dan hanya untuk Ku hendaknya kalian beramal dengan menaati Ku dan tinggalkanlah perbuatan maksiat kepada Ku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Berimanlah kepada Al-Qur`ān yang telah Ku turunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- yang isinya selaras dengan apa yang ada di dalam kitab Taurat -sebelum dimanipulasi- terkait keesaan Allah dan kenabian Muhammad -ṣallallāhu 'alaihi wa sallam-. Jangan sekali-kali kamu menjadi golongan pertama yang ingkar kepadanya. Janganlah kamu menukar ayat-ayat yang telah Kuturunkan dengan harga yang murah, seperti pangkat dan jabatan. Takutlah kamu akan murka dan azab-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Dan berimanlah kepada al-Qur’an yang telah Aku turunkan kepada Muhammad yang merupakan kitab yang sesuai dengan Taurat. Dan janganlah kalian menjadi orang-orang yang pertama mengingkarinya. Dan janganlah kalian menukar keimanan kepada ayat-ayat-Ku dengan dunia dan kenikmatannya. Hanya kepada-Ku hendaklah kalian takut, maka laksanakanlah ketaatan kepada-Ku dan janganlah bermaksiat kepada-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَآمِنُوا بِمَا أَنْزَلْتُ (Dan berimanlah kamu kepada apa yang telah Aku turunkan) Yakni al-Qur’an مُصَدِّقًا لِمَا مَعَكُمْ (yang membenarkan apa yang ada padamu) Yakni al-Qur’an ini sesuai dengan apa yang ada dalam taurat dan kabar berita yang disampaikan oleh para nabi dalam hal kebenaran. وَلَا تَكُونُوا أَوَّلَ كَافِرٍ بِهِ (dan janganlah kamu menjadi orang yang pertama kafir kepadanya) Yakni seharusnya kalianlah yang pertama-tama membenarkan al-Qur’an وَلَا تَشْتَرُوا بِآيَاتِي (dan janganlah kamu menukarkan ayat-ayat-Ku) Yakni janganlah menukarkan perintah-perintah-Ku dan larangan-larangan-Ku ثَمَنًا قَلِيلًا (dengan harga yang rendah) yakni dengan kehidupan yang kebaikannya hanya sedikit ini dan jabatan yang remeh yang taka da artinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Maksud dari lafazh { أَوَّلَ كَافِرٍ بِهِ } \"orang yang pertama kafir kepadanya\" pada ayat ini padahal sebelum mereka telah lalu kuffar quraisy; adalah mereka kaum kuffar dari kalangan ahli kitab, karena sesungguhnya mereka itu mengetahui apa yang menjadi hak-hak bagi para Nabi, dan apa yang mesti dibenarkan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka membenarkan Al-Qur’an yang telah Aku turunkan kepada Muhammad SAW. Al-Qur’an yang membenarkan Taurat tentang tauhid dan prinsip-prinsip akidah dan moral. Janganlah kalian menjadi orang pertama yang ingkar dan janganlah kalian tukar ayat-ayatKu tentang perintah dan larangan dengan ayat lain yang menyimpang! Dan janganlah kalian jual itu dengan menunjukkan sedikit bagian darinya dan bagian yang palsu untuk mendapatkan keuntungan kecil dari sampah duinia! Takutlah kalian kepadaKu, waspadalah terhadap hukumanKu, dan janganlah takut kepada siapapun selain Aku!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Berimanlah kalian kepada apa (Al-Qur'an) yang telah Aku turunkan sebagai pembenar} sebagai penyelaras {bagi apa yang ada bersama kalian (Taurat) dan janganlah kalian menjadi orang yang pertama mengingkarinya dan janganlah kalian menukarkan} dan janganlah kalian mengganti {ayat-ayatKu dengan harga murah} hal duniawi yang remeh {dan bertakwalah hanya kepadaKu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Dan berimanlah kamu kepada apa yang telah Aku turunkan, ” maksudnya al-Qur’an, yang Allah turunkan kepada hamba dan RosulNya, Muhammad SHOLALLOHU 'ALAIHI WASALLAM. Allah memerintahkan mereka untuk beriman kepadanya dan mengikutinya, hal ini mengharuskan keimanan kepada sesorang yang kitab tersebut diturunkan kepadanya, dan Allah menyebutkan pendorong dalam keimanan mereka, seraya berfirman, “ Yang membenarkan apa yang ada padamu (Taurat), ” maksudnya, kitab yang sesuai dengan kitab yang berada di sisi kalian, tidak berbeda dan tidak pula bertentangan, lalu apabila ia sesuai dengan apa yang ada pada kalian yang tidak berbeda dengannya, maka tidaklah ada penghalang bagi kalian untuk beriman kepadanya, karena ia membawa ajaran yang dibawa oleh para rosul, dan kalian lebih patut beriman kepadanya dan mempercayainya, karena kalian adalah ahli kitab dan ahli ilmu. Kemudian dalam firman Allah ta’ala, ”Yang membenarkan (Taurat) yang ada padamu, ” terkandung isyarat bahwa bila kalian tidak beriman kepadanya, maka itu akan kembali pada kalian sendiri dengan pendustaan kalian terhadap apa yang ada pada kalian, karena ajaran yang dibawa kitab tersebut adalah sama dengan ajaran yang dibawa oleh Nabi Musa, Nabi Isa, dan lain-lainnya dari para nabi. Maka pendustaan kalian terhadapnya adalah pendustaan kalian terhadap apa yang ada pada kalian. Yang demikian itu ditambah lagi dengan kenyataan bahwa dalam kitab yang ada pada kalian ada berita tentang Nabi yang membawa al-Qur’an tersebut, dan telah disampaikan sebagai kabar gembira (kepada kalian), dan apabila kalian tidak beriman kepadanya niscaya kalian telah mendustai sebagian yang telah turun kepada kalian, padahal orang yang mendustai sebagian yang diturunkan kepadanya, maka dia telah mendustai seluruhnya, sebagaimana orang yang mendustai seorang Rosul, maka dia telah mendustai para Rosul seluruhnya. Dan ketika Allah memerintahkan kepada mereka untuk beriman kepadanya, Allah melarang dan mengingatkan mereka dari kebalikannya yaitu kafir terhadapnya, Allah berfirman, ”Dan janganlah kamu menjadi orang yang pertama kafir kepadanya, ” maksudnya kafir kepada Rosul dan al-Qur’an. Dalam firmanNya, ”Orang yang pertama kafir kepadanya” adalah statemen yang lebih kuat daripada kalau mengatakan, ”dan janganlah kalian kafir kepadanya.” Karena apabila mereka yang pertama kafir kepadanya, maka itu menunjukkan bahwa mereka bersegera kepada kekakafiran, suatu tindakan terbalik dari yang seharusnya mereka lakukan , sehingga dosa-dosa mereka dan dosa orang-orang setelahnya yang mengikuti mereka dibebankan kepada mereka. Kemudian Allah menyebutkan tentang penghalang bagi mereka dari keimanan mereka tersebut yaitu memilih penawaran yang paling rendah daripada kebahagiaan yang abadi, seraya berfirman, ”Dan janganlah kamu menukarkan ayat-ayatKu dengan harga yang rendah”, maksudnya kedudukan dan penghidupan yang mereka peroleh dimana mereka mengira itu semua akan lenyap jika mereka beriman kepada Allah dan RosulNya, maka mereka menukarkan hal itu dengan ayat-ayat Allah, mereka menyukainya dan mendahulukannya, ”dan hanya kepada Aku-lah” maksudnya tidak kepada selainKu, ”kamu harus bertakwa, ” karena bila kalian bertakwa kepada Allah semata, niscaya ketakwaan kalian itu mendorong kalian untuk mendahulukan keimanan kepada ayat-ayatNya daripada penawaran yang rendah itu, sebagaimana juga bila kalian memilih penawaran yang rendah itu, maka hal itu adalah bukti petunjuk akan hilangnya ketakwaan dalam hati kalian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ءَامِنُواْ بِمَآ أَنزَلۡتُ Aaminuu bimaa anzaltu : Berimanlah terhadap Al-Qur’anul Karim وَلَا تَشۡتَرُواْ بِ‍َٔايَٰتِي wa Laa tasytaruu bi aayaatii : Janganlah kalian menyembunyikan kebenaran tentang perkara Muhammad ﷺ ثَمَنٗا قَلِيلٗا Tsamanan Qolilaa : Perhiasan kehidupan dunia وَإِيَّٰيَ فَٱتَّقُونِ Wa iyyaya fattaquun : Takutlah kepadaKu karena kalian telah menyembunyikan kebenaran dan menolah kenabian Muhammad ﷺ dan Aku akan menurunkan adzabKu. Makna ayat : Perintah agar beriman kepda Al-Qur’anul karim serta tidak menjadi orang yang pertama kali mengingkari Al-Qur’an. Allah melarang mereka agar tidak menukar penjelasan yang benar tentang keimanan kepda RasulNya Muhammad ﷺ dengan harga yang sedikit berupa perhiasan kehidupan dunia. Serta Allah menyuruh mereka agar bertakwa kepadaNya dalam hal itu dan memperingatkan apabila mereka menyembunyikan kebenaran akan turun adzab untuk mereka. Pelajaran dari ayat : 3. Kewajiban untuk menjelaskan kebenaran dan keharaman menyembunyikan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 41: Allah kemudian memerintahkan bani israil untuk beriman kepada Al Qur’an yang diturunkan kepada Muhammad ﷺ yang selaras dengan taurat, dan Allah mewanti-wanti agar tidak menjadi seseorang yang kufur pertama kali kepada rasul dan Al-Qur’an, Allah juga memrintahkan untuk membenarkan Al-Qur’an dan Allah juga memperingatkan agar tidak mengganti ayat-ayat Al-Qur’an dengan harga yang sedikit demi mendaptkan dunia yang fana. Kemudian Allah memerintahkan agar menjadi orang-orang yang bertakwa yaitu dengan ketaatan kepada Allah dan meninggalkan kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini menghendaki juga beriman kepada orang yang diturunkan kepadanya Al Qur'an, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Sesuai dengan kitab Taurat yang ada pada mereka dan tidak menyelisihi sehingga tidak ada lagi penghalang bagi mereka untuk beriman kepadanya, karena ia datang dengan membawa hal yang sama dengan dibawa para rasul. Oleh karena itu, jika mereka mendustakan kitab Al Qur'an, maka sama saja mereka mendustakan kitab Taurat dan kitab-kitab yang lain. Mereka (Bani Isra'il) adalah orang yang lebih patut beriman dan membenarkannya, karena mereka ahlul kitab dan memiliki pengetahuan. Yakni kepada Al Qur'an dan kepada Rasul-Nya. Kata-kata \"pertama kafir kepadanya\" lebih dalam daripada kata-kata \"janganlah kamu kafir kepadanya\", karena kata-kata tersebut menunjukkan kesegeraan mereka untuk kafir padahal tidak patut bagi mereka, dan mereka akan memperoleh dosa mereka serta dosa orang yang mengikuti mereka setelahnya. Perhiasan dunia yang akan lenyap. Inilah sebab yang menghalangi mereka untuk beriman, yaitu karena lebih memilih dan melebihkan perhiasan dunia di atas kebahagiaan selama-lamanya –na'uuudzu billahi min dzaalik-. Mereka lebih memilih jabatan dan harta daripada beriman kepada Allah dan Rasul-Nya. Yang menghendaki untuk mengedepankan iman daripada perhiasan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 41",
    "description": "Tuntunan pada ayat di atas dipertegas lagi dengan mengajak mereka memeluk islam yang dibawa oleh nabi Muhammad. Dan berimanlah kamu kepada apa, yakni Al-Qur'an, yang telah aku turunkan kepada nabi Muhammad yang membenarkan apa, yakni taurat, zabur, dan lain-lain, yang ada pada kamu, dan janganlah kamu menjadi orang yang pertama, yakni yang paling gigih dan paling keras mengingkari dan kafir kepadanya. Janganlah kamu jual, campakkan, atau tukar ayat-ayat ku dengan kemegahan duniawi dan dengan harga yang pada hakikatnya murah walaupun tampak mahal, dan bertakwalah hanya kepada-ku, sebab dengan itu kamu akan dapat menjalankan perintah-ku dan meninggalkan larangan-ku, sehingga kamu tidak terjerumus dalam kesesatan. Pada ayat ini, Allah memberikan larangan kepada bani israil untuk tidak mencampuradukkan antara kebenaran dan kebatilan. Dan janganlah kamu, wahai bani israil, campuradukkan kebenaran dengan kebatilan dengan memasukkan apa yang bukan firman Allah ke dalam kitab taurat, dan janganlah kamu sembunyikan kebenaran firman-firman Allah seperti berita akan datangnya nabi Muhammad, sedangkan kamu mengetahuinya. Orang-orang yahudi menyembunyikan berita tentang kedatangan nabi Muhammad yang termaktub di dalam taurat dengan maksud untuk menghalangi manusia beriman kepadanya."
  }
]