[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian mencampur adukkan kebenaran yang telah Aku jelaskan kepada kalian dengan kebatilan yang kalian ada adakan sendiri. Hindarilah tindakan menyembunyikan kebenaran yang sudah jelas tentang sifat-sifat nabi Allah dan rasul-Nya Muhammad shallallahu alaihi wasallam yang ada di kitab-kitab Suci kalian, sementara kalian mendapatkannya tertulis di kalangan kalian, seperti yang kalian ketahui dari isi kitab suci yang ada di tangan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Janganlah kamu mencampur kebenaran -yang Ku turunkan kepada rasul-rasul-Ku- dengan kebohongan-kebohongan yang kamu buat-buat sendiri. Dan janganlah kamu menyembunyikan kebenaran yang ada di dalam kitab-kitab sucimu perihal sifat Muhammad -ṣallallāhu 'alaihi wa sallam-, sementara kamu mengetahuinya dan meyakini kebenarannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Janganlah kalian mencampuradukkan kebenaran dari Allah dengan kebatilan dari kalian; dan janganlah kalian menyembunyikan kebenaran seperti berita yang jelas dalam kitab kalian tentang pengutusan dan sifat-sifat Nabi Muhammad, sedangkan kalian mengetahui bahwa dia adalah nabi yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ (Dan janganlah kamu campur adukkan yang hak dengan yang bathil) Allah melarang mereka untuk mencampuradukkan kebenaran yang ada dalam agama-Nya dengan kebathilan dari mereka, agar dapat memperkeruh pemahaman (tentang agama) dan merusak agama. وَتَكْتُمُوا الْحَقَّ (dan janganlah kamu sembunyikan yang hak itu) Yakni larangan untuk menyembunyikan dalil-dalil Allah yang wajib mereka sampaikan yang mana mereka telah berjanji untuk menyampaikannya; diantaranya adalah berita gembira tentang diutusnya nabi Muhammad Shallallahu ‘Alaihi Wasallamyang mereka sembunyikan. وَأَنْتُمْ تَعْلَمُونَ (sedangkan kamu mengetahui) yakni mengetahui bahwa Muhammad Shallallahu ‘Alaihi Wasallamadalah rasulullah dan mengetahui dalam kitab mereka bahwa mereka wajib menyampaikan hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ada dua jenis manusia yang berhubungan dengan ayat ini : yaitu orang yang mengamalkan apa-apa yang diperintahkan oleh ayat, dan mereka adalah ahli ilmu, yaitu mereka dari kalangan ulama dan da'i-da'i penyebar da'wah, dan yang kedua adalah orang-orang yang menutupi kebenaran dengan kebathilan, mereka tidak membedakan antara satu perkara dengan perkara lainnya padahal mereka mengerti tentang itu, maka mereka itu adalah da'i-da'i yang membawa kepada neraka jahannam, karena sesungguhnya manusia tidak akan mampu berdiri diatas agamanya tanpa peran ulama sebagai pembimbing, maka pilihlah untuk dirimu dari kedua golongan ini. 2 ). Para da'i yang menyesatkan ummat mereka memiliki dua cara : yaitu mencampur adukkan yang haq dengan yang bathil, dalam hal ini diisyaratkan oleh firman Allah : { وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ } , dan cara yang kedua dengan memerangi kebenaran dan menyembunyikannya, Allah menjelaskan cara ini dengan ayat-Nya : { وَتَكْتُمُوا الْحَقَّ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Janganlah kalian campur kebenaran agama dengan kebatilan kalian; dan kejujuran dengan kebohongan! Dan janganlah kalian menutupi dalil-dalil Allah yang seharusnya kalian sampaikan, di antaranya adalah berita gembira yang diundang-undangkan dalam kitab kalian tentang diutusnya nabi Muhammad SAW dan penggambarannya, sedangkan kalian telah mengetahui bahwa dia adalah utusanKu dan Al-Qur’an adalah kitab dan kalamKu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kalian mencampur adukkan} mencampur {kebenaran dengan kebatilan dan (jangan pula) kalian menyembunyikan kebenaran, sedangkan kalian mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Dan janganlah kamu campur adukkan, ” yakni mencapurkan “yang haq dengan yang batil dan janganlah kamu sembunyikan yang haq itu.” Disini Allah melarang mereka dari dua hal: pertama, mencampur antara yang haq dengan yang batil kedua, menyembunyikan yang haq, karena yang di inginkan dari ahli kitab dan ahli ilmu adalah membedakan antara yang haq dari yang batil dan menampakkan yang haq itu, agar orang-orang yang ingin mendapatkan petunjuk darinya dapat mengambil petunjuk darinya, orang-orang yang sesat dapat kembali sadar, dan tegaknya dalil atas orang-orang yang mengingkarinya, karena Allah telah menjelaskan ayat-ayatNya dan menerangkan keterangan-keteranganNya untuk membedakan yang haq dari yang batil dan agar jelas jalan orang-orang yang mengambil petunjuk dari jalan orang-orang yang mengingkari. Dan siapa yang mengamalkannya, maka dia tergolong dari para khalifah Rosul dan pemberi petunjuk bagi umat, dan barangsiapa mencampur adukkan yang haq dengan yang batil dan ia tidak membedakan antara yang ini dari yang itu, padahal ia tahu akan hal itu lalu ia menyembunyikan yang haq yang ia tahu padahal ia diperintahkan untuk menampakannya, maka ia tergolong di antara para penyeru kepada Neraka Jahanam, karena manusia tidaklah akan mencontoh siapa pun dalam urusan agama mereka kecuali kepada para ulama mereka. Nah, pilihlah bagi diri kalian salah satu dari kedua kondisi tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : وَلَا تَلۡبِسُواْ ٱلۡحَقَّ بِٱلۡبَٰطِلِ Wa laa talbisul Haqqo bil baathili : Maknanya janganlah kalian campurkan antara kebenaran dan kebathilan sampai kalian mengetahui dan mengamalkannya. Yaitu perkataan mereka : Muhammad adalah seorang nabi akan tetapi hanya diutus kepada orang Arab saja, bukan kepada Bani Israil. Makna ayat : Allah juga melarang mereka agar tidak mencampur adukkan antara kebenaran dengan kebathilan, untuk membela kebenaran dan menjauhkan kebathilan yang menyebabkan mereka tidak beriman keapada Muhammad ﷺ. Pelajaran dari ayat : Kewajiban untuk menjelaskan kebenaran dan keharaman menyembunyikan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 42: Allah kemudian memperingatkan bani israil untuk tidak mencampur adukkan yang benar dengan yang batil, dan memperingatkan juga agar tidak menyembunyikan kebenaran yang telah nampak dan jelas buktinya bagi mereka, yaitu keimanan akan kenabian Muhammad ﷺ dan membenarkan kerisalahannya, mereka mengetahu akan (isi) kitab-kitab yang ada dihadapan mereka tentang rasul adalah utusan dari sisi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena yang diharapkan dari orang yang memiliki pengetahuan adalah menerangkan yang hak dan membedakannya dari yang batil serta menampakkan yang hak itu agar orang-orang yang mencari petunjuk dapat memperolehnya, orang-orang yang tersesat dapat kembali dan tegaknya hujjah terhadap orang-orang yang tetap menyelisihi. Oleh karena itu, siapa saja ahli ilmu yang menerangkan kebenaran dan tidak mencampuradukkan dengan yang batil, maka dia termasuk para pewaris rasul dan penggantinya serta pemberi petunjuk kepada ummat. Jika sebaliknya, maka ia termasuk du'at ke arah jahannam. Di antara yang mereka sembunyikan itu ialah: Allah akan mengutus seorang Nabi dari keturunan Ismail yang akan membangun umat yang besar di belakang hari, Yaitu Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 42",
    "description": "Pada ayat ini, Allah memberikan larangan kepada bani israil untuk tidak mencampuradukkan antara kebenaran dan kebatilan. Dan janganlah kamu, wahai bani israil, campuradukkan kebenaran dengan kebatilan dengan memasukkan apa yang bukan firman Allah ke dalam kitab taurat, dan janganlah kamu sembunyikan kebenaran firman-firman Allah seperti berita akan datangnya nabi Muhammad, sedangkan kamu mengetahuinya. Orang-orang yahudi menyembunyikan berita tentang kedatangan nabi Muhammad yang termaktub di dalam taurat dengan maksud untuk menghalangi manusia beriman kepadanya. Setelah mengajak bani israil untuk memeluk islam dan meninggalkan kesesatan, perintah utama yang disampaikan kepada mereka setelah larangan di atas adalah perintah untuk melaksanakan salat. Dan laksanakanlah salat untuk memohon petunjuk dan pertolongan Allah, tunaikanlah zakat untuk menyucikan hatimu dan menyatakan syukur kepada-Nya atas segala nikmat-Nya, dan rukuklah beserta orang yang rukuk, yakni kaum muslim yang beriman dan mengikuti ajaran nabi Muhammad. Penambahan perintah untuk rukuk setelah ada perintah untuk melaksanakan salat itu mengisyaratkan ajakan agar mereka memeluk islam dan melaksanakan salat seperti salatnya umat islam. Dalam tata cara salat orang yahudi tidak dikenal gerakan rukuk."
  }
]