[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan masuklah kalian ke dalam agama Islam dengan melaksanakan shalat dengan tata cara yang benar sebagaimana dibawa oleh nabi dan rasul Allah Muhammad sholallohu ‘alaihi wasallam, dan tunaikanlah zakat yang diwajibkan sesuai dengan tuntunan syariat, dan jadilah kalian bersama golongan orang-orang yang suka ruku’ dari umat-umat beliau Shallallahu Alaihi Wasallam"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Tunaikanlah salat secara sempurna dengan melaksanakan rukun-rukunnya, wajib-wajibnya dan sunnah-sunnahnya. Bayarkanlah zakat harta yang telah Allah berikan kepada kalian. Dan tunduklah kalian kepada Allah bersama umat Muhammad -ṣallallāhu 'alaihi wa sallam- yang tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan dirikanlah shalat yang diwajibkan bagi kaum muslimin, tunaikanlah zakat untuk orang-orang yang berhak, dan shalatlah berjamaah dengan kaum muslimin dan ruku’lah bersama mereka dengan penuh keimanan dan keyakinan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ (Dan dirikanlah shalat, tunaikanlah zakat) Yakni Allah memerintahkan orang-orang Yahudi untuk memeluk islam kemudian menjalankan sholat sebagaimana yang dijelaskan oleh nabi Muhammad Shallallahu ‘Alaihi Wasallamdan juga memerintahkan mereka untuk membayar zakat dan mengerjakan sholat dalam jama’ah. وَارْكَعُوا مَعَ الرَّاكِعِينَ (dan ruku’lah beserta orang-orang yang ruku’) Karena dalam sholat orang Yahudi tidak terdapat ruku’. Dan dalam ayat ini terdapat petunjuk agar mengikuti sholat berjama’ah bersama kaum muslimin dan pergi ke masjid. Jumhur ulama meyatakan bahwa sholat berjamaah di masjid hukumnya sunnah mu’akkad karena dalam menjalankannya terdapat banyak maslahat dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Tegakkanlah shalat yang diwajibkan atas orang-orang muslim, tuniakanlah zakat yang wajib (diberikan) kepada mereka yang berhak menerimanya, tunduklah kepada perintah-perintah Allah, shalatlah dengan berjamaah bersama orang-orang yang shalat dan sempurnakanlah ruku’ kalian bersama mereka karena orang-orang Yahudi tidak memiliki ruku’ di dalam shalat mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tegakkanlah shalat, tunaikanlah zakat, dan rukuklah bersama orang-orang yang rukuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Kemudian Allah berfirman, “Dan dirikanlah shalat, ” yakni, secara lahir maupun batin, “dan tunaikanlah zakat” terhadap orang-orang yang berhak menerimanya, “dan rukuklah beserta orang-orang yang rukuk, ” maksudnya shalatlah beserta orang-orang yang shalat, karena bila kalian melakukan hal itu dengan keimanan kepada Rosul-rosul Allah dan ayat-ayatNya, maka sesungguhnya kalian telah menyatukan antara perbuatan-perbuatan yang lahir dan yang batin, dan antara keiklasan kepada Allah dan berbuat baik kepada hamba-hambaNya, dan antara ibadah-ibadah hati dengan ibadah tubuh dan ibadah harta. Dan firmanNya, “Dan rukuklah beserta orang-orang yang rukuk, ” maksudnya shalatlah bersama orang-orang yang shalat. Di sini ada suatu perintah untuk shalat berjamaah dan juga menunjukkan hukum wajibnya, dan bahwasanya rukuk itu merupakan rukun diantara rukun-rukun shalat, karena Allah menyebutkan shalat dengan kata rukuk, sedangkan mengungkapkan suatu ibadah dengan kata yang merupakan bagian darinya adalah menunjukkan kepada wajibnya hal itu padanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : وَٱرۡكَعُواْ مَعَ ٱلرَّٰكِعِينَ : Ruku’ secara syar’i bermakna membungkukkan punggung sampai lurus kedepan dengan meletakkan dua telapak tangan di lutut dengan makna tunduk dan merendahkan diri kepada Allah ‘Azza wa Jalla. Makna ayat : Allah memerintahkan mereka untuk mendirikan sholat dan mengeluarkan zakat serta tunduk kepada Allah dengan menerima agama Islam dan masuk ke dalamnya seperti kaum muslimin yang lain. Pelajaran dari ayat : Keharaman mencampur aduk antara kebenaran dan kebathilan untuk menyesatkan manusia dan memalingkan mereka dari kebenaran, seperti ucapan orang Yahudi ; “Muhammad adalah seorang nabi, akan tetapi khusus untuk orang Arab saja, sehingga orang Yahudi tidak beriman kepadanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 43: Kemudian Allah merintahkan bani israil bahwasannya mereka sudah semestinya menegakkan sholat bagaimana yang datang kepada nabi ﷺ. Dan sebagaimana mereka diperintahkan berzakat secara wajib atas dasar syariat, serta mereka diperintahkan bersaksi untuk menegakkan sholat berjamaah bersama kaum muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam shalat dan zakat terdapat ikhlas kepada Allah dan berbuat ihsan terhadap hamba-hamba Allah. Pada shalat dan zakat terdapat ibadah hati, badan dan harta. Ayat ini bisa maksudnya memerintahkan orang-orang Yahudi untuk masuk ke dalam Islam dengan mengerjakan shalat secara benar dan menunaikan zakat sehingga mereka tergolong orang-orang yang ruku', yakni tergolong ummat Nabi Muhammad shallallahu 'alaihi wa sallam. Ada juga yang menafsirkan ayat \"dan ruku'lah beserta orang yang ruku'\" adalah perintah mengerjakan shalat berjama'ah dan ada pula yang mengartikan: tunduklah kepada perintah-perintah Allah bersama orang-orang yang tunduk. Sebagian ulama berdalil dengan ayat ini untuk menerangkan wajibnya shalat berjama'ah, yaitu dari ayat \"dan ruku'lah beserta orang yang ruku'\", yakni shalatlah beserta orang yang shalat. Disebutnya shalat dengan ruku' menunjukkan bahwa ruku' merupakan rukun shalat, dan tidak dinamakan shalat jika tidak ada ruku'nya. Disebutkan bagian dari gerakan shalat, yaitu ruku' untuk shalat menunjukkan wajibnya ruku'."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 43",
    "description": "Setelah mengajak bani israil untuk memeluk islam dan meninggalkan kesesatan, perintah utama yang disampaikan kepada mereka setelah larangan di atas adalah perintah untuk melaksanakan salat. Dan laksanakanlah salat untuk memohon petunjuk dan pertolongan Allah, tunaikanlah zakat untuk menyucikan hatimu dan menyatakan syukur kepada-Nya atas segala nikmat-Nya, dan rukuklah beserta orang yang rukuk, yakni kaum muslim yang beriman dan mengikuti ajaran nabi Muhammad. Penambahan perintah untuk rukuk setelah ada perintah untuk melaksanakan salat itu mengisyaratkan ajakan agar mereka memeluk islam dan melaksanakan salat seperti salatnya umat islam. Dalam tata cara salat orang yahudi tidak dikenal gerakan rukuk. Selanjutnya, setelah memerintahkan salat dan zakat, ayat ini mengecam pemuka-pemuka yahudi yang sering kali memberi tuntunan kepada orang lain agar berbuat baik, tetapi melakukan sebaliknya dan melupakan diri mereka. Mengapa kamu, bani israil atau pemukapemuka yahudi, menyuruh orang lain, baik yang seagama dengan kamu maupun orang-orang musyrik atau siapa saja, untuk mengerjakan kebajikan, sedangkan kamu melupakan dirimu sendiri dan tidak menyuruh dirimu untuk melakukan kebajikan itu' kamu melakukan hal itu, padahal kamu membaca kitab taurat' tidakkah kamu mengerti dan berakal sehingga memiliki kendali yang menghalangi kamu terjerumus ke dalam dosa dan kesulitan' meski pembicaraan pada ayat ini ditujukan kepada orang-orang yahudi, nasihat yang terkandung di dalamnya juga berlaku bagi kaum muslim, apalagi para pemuka agama, yakni hendaknya mengingatkan diri sendiri lebih dahulu sebelum mengajak orang lain berbuat baik."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Muqotil mengatakan ayat ini ditunjukan untuk ahlu kitab, Allah memerintah mereka untuk mengerjakan sholat bersama Nabi sholallohu ‘alaihi wasallam dan memerintahkan mereka untuk mengeluarkan zakat, yaitu menyerahkannya kepada Nabi sholallohu ‘alaihi wasallam dan Allah menyuruh mereka untuk ruku’ bersama orang-orang yang ruku’ dari umat Muhammad sholalallohu ‘alaihi wasallam. Walaupun khitob ayat ini adalah kepada ahlul kitab, akan tetapi ‘ibroh dan isi kandungan ayat ini mencakup juga kaum muslimin umat nabi Muhammad sholallohu ‘alaihi wasallam hingga ahir zaman. Ada tiga perintah yang Allah ta’ala sebutkan dalam ayat ini, yaitu: Pertama, perintah mendirikan sholat. Ad-Dhohak meriwayatkan dari Ibnu Abbas, mendirikan sholat berarti mengerjakan dengan sempurna ruku’,sujud, bacaan, serta penuh kekhusyuan. Qotadah mengatakan, mendirkan sholat berarti berusaha mengerjakannya tepat waktu, berwudhu, ruku’, dan bersujud. Muqotil bin Hayyan mengatakan, “mendirikan sholat” berarti menjaga untuk selalu mengerjakannya pada waktunya, menyempurnakan wudhuu, ruku’, sujud, bacaan al-Quran, tasyahud, serta membaca sholawat kepada Rosululloh sholallohu ‘alaihi wasallam. Kedua, perintah menunaikan zakat Berkata Waki’ dari Abi Junab dari Ikrimah dari Ibnu Abbas tentang firman-Nya “وَآَتُوا الزَّكَاةَ”. Dia berkata, “apa yang wajib dizakati itu?” maka dia menjawab, “dua ratus keatas”. Sementara Mubarok bin fudhalah meriwayatakan dari Hasan al-bashri mengenai ayat ini, “pembayaran zakat itu merupakan kewajiban, yang mana amal ibadah tidak akan bermanfaat kecuali menunaikannya dan dengan mengerjakan sholat”. Ibnu Abi Hatim mengatakan dari al-Harits al-‘Akli tentang firman-Nya “وَآَتُوا الزَّكَاةَ” maksudnya adalah zakat fitrah. Ibnu Katsir berkata : “seringkali Allah ta’ala menyandingkan antara sholat dan zakat. Sholat merupakan hak Allah sekaligus bentuk ibadah kepada-Nya. Dan ia mencakup pengesaan, penyanjungan, pengharapan, pemujian, pemanjatan doa, serta tawakkal kepada-Nya. Sedangkan indak (zakat) merupakan salah satu bentuk perbuatan baik kepada sesama makhluk dengan memberi manfaat kepada mereka” Ketiga, perintahkan untuk sholat berjam’ah, sebagaimana firman-Nya : وَارْكَعُوا مَعَ الرَّاكِعِينَ \"Dan ruku'lah beserta orang-orang yang ruku'” maksudnya, lakukanlah sholat bersama orang-orang mukmin dengan sempurna pelaksanaannya. Penggunaan kalimat ruku’ dalam ayat ini untuk menggambarkan pelaksanaan sholat adalah karena ruku’ merupakan salah satu dari rukun sholat, dan bahkan dijadikan sebagai patokan dapatnya raka’at. Dan disebutkan juga alasan penyebutan ruku’ sebagai gambaran sholat dalam ayat ini adalah karena sholatnya ahlu kitab yaitu Bani Isroil tidak ada ruku’ dalam tatacara sholat mereka. Hal ini disebutkan Al-Qurtubi dalam tafsirnya. Adapun hokum sholat berjama’ah lebih jelasnya dirinci oleh para ulama menjadi beberapa pendapat : Pertama, wajib kifayah. Artinya, ketika sudah ada yang melaksanakan sholat berjamah di satu mesjid, maka kewajiban itu gugur untuk yang lain yang tidak ikut melaksanakannya. Dan apabila sama sekali tidak ada yang melaksanakan maka semuanya berdosa. Pendapat ini diungkapkan oleh Ibnu ‘Abdil Barr. Kedua, Sunnah muakkadah. pendapat ini yang dijadikan pendapat jumhur para ulama. Berdasarkan hadits nabi sholallohu ‘alaihi wasallam : صلاة الجماعة أفضل من صلاة الفرد بسبع وعشرين درجة Sholat berjama’ah lebih utama dari sholat sendirian dengan dua puluh tujuh derajat. (HR. Musllim) Ketiga, fardu ‘ain. artinya seluruh mukmin wajib melaksanakannya seperti halnya sholat jumat, barangsiapa yang meninggalkannya maka dia telah berdosa. Pendapat ini dikemukakan oleh Daud Ad-Dzohiri. Dan ini juga pendapatnya ‘Atho bin Abi Robah dan Imam Ahmad bin Hanbal, berdasarkan sabda Nabi sholallohu ‘alaihi wasallam : لا صلاة لجار المسجد إلا في المسجد Tidak sah sholat seseorang yang ada disekitar masjid kecuali di dalam masjid. (HR. Abu Daud) Imam Syafi’i berkata, “tidak ada rukhsoh bagi orang yang mampu melaksanakan berjamaah kemudian dia meninggalkannya kecuali ada udzur”. Berdasarkan hadits Nabi sholallohu ‘alaihi wasallam yang diriwayatkan Muslim dari Abu hurairoh rhodiyallohu ‘anhu, dia berkata : أتى النبي صلى الله عليه وسلم رجل أعمى فقال يا رسول الله إنه ليس لي قائد يقودني إلى المسجد فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته فرخص له فلما ولى دعاه فقال هل تسمع النداء بالصلاة ؟ قال : نعم قال فأجب Telah datang kepada Nabi sholallohu ‘alaihi wasallam seorang laki-laki yang buta, maka dia berkata, “Ya Rosululloh, sesungguhnya aku tidak punya penunjuk yang menuntunku ke mesjid” maka dia memnta keringanan kepada Rosululloh sholallohu ‘alaihi wasallam untuk sholat di rumahnya. Kemudian nabi memberinya keringanan. Akan tetapi ketika dia berpaling hendak pulang, nabi memanggilnya dan berkata, “apakah kamu mendengar adzan?”. Dia menjawab. “Ya, tentu”. Maka Nabi berkata, “kalo begitu kamu wajib”. (HR. Muslim) Demikian pendapat para ulama mengenai hukum sholat berjama’ah. Untuk lebih detailnya, silahkan merujuk kitab-kitab fiqih bab sholat berjama’ah."
  }
]