[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alangkah buruk kondisi kalian dan kondisi ulama kalian ketika kalian memerintahkan manusia untuk berbuat kebaikan-kebaikan, sedangkan kalian meninggslksn diri kalian sendiri. Maka kalian tidak memerintahkan diri kalian untuk berbuat kebaikan yang agung ini, yaitu memeluk Islam padahal Kalian membaca taurot yang didalamnya terdapat penjelasan tentang sifat-sifat Muhammad Shallallahu Alaihi Wasallam dan kewajiban beriman kepadanya. Tidakkah kalian mempergunakan akal kalian dengan benar?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Alangkah buruknya bila kamu menyuruh orang lain beriman dan berbuat baik, sementara kamu sendiri berpaling darinya dan melupakan dirimu sendiri. Padahal kalian bisa membaca Taurat dan mengetahui isinya yang memerintahkan untuk mengikuti agama Allah dan mempercayai rasul-rasul-Nya. Tidakkah kamu menggunakan akal sehatmu?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Wahai para rahib kaum Yahudi, Mengapa kalian memerintahkan orang lain untuk melakukan amal shalih, sedangkan kalian melupakan diri kalian sendiri, padahal kalian telah membaca Taurat yang melarang hal demikian? Apakah kalian tidak menyadari keburukan perbuatan kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ (Mengapa kamu suruh orang lain (mengerjakan) kebaktian) Yakni menyuruh untuk beriman kepada Allah dan rasul-rasul-Nya, memenuhi perjanjian Allah, mengerjakan sholat, dan menunaikan zakat. وَتَنْسَوْنَ أَنْفُسَكُمْ (sedang kamu melupakan diri (kewajiban)mu sendiri) Yakni membiarkan diri kalian tidak menjalankannya, padahal itu adalah hal yang sangat buruk. أَفَلَا تَعْقِلُونَ (Maka tidaklah kamu berpikir?) Yakni jika kalian bukanlah termasuk orang-orang yang berilmu, memiliki dalil-dalil, dan yang mempelajari kitab-kitab Allah maka sebenarnya cukuplah akal sebagai penghalang kalian melakukan apa yang kalian perbuat. Lalu mengapa kalian melakukan itu padahal kalian adalah orang yang berilmu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Manusia senantiasa terhalangi dari tidak tunduk kepada orang yang ucapannya menyalahi perbuatannya, karena ketaatan mereka dengan perbuatan lebih utuh daripada ketaatan dengan sekedar ucapan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai para pendeta Yahudi! Bagaimana bisa kalian memerintahkan orang untuk taat kepada Allah dan segala sesuatu yang ada di dalam Taurat, sedangkan kalian mengabaikan diri kalian dan tidak memerintahkannya untuk berbuat kebaikan dan ketaatan, dan kalian juga membaca Taurat yang mengharamkan berbicara tanpa berbuat. Apakah kalian tidak mengetahui ketidaksesuaian kalian dengan ucapan kalian dan buruknya perilaku kalian?! Asbabun Nuzul: As-Sadi berkata: “Ketika itu, Bani Israil memerintahkan manusia untuk taat kepada Allah dan bertakwa kepadaNya dengan berbuat baik, namun mereka melakukan yang sebaliknya, kemudian Allah yang Maha Agung dan Maha Tinggi menegur mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian memerintahkan orang untuk berbuat kebajikan} berbuat ketaatan dan amal shalih {sedangkan kalian melupakan diri sendiri} kalian membiarkan diri kalian dan tidak memerintahkannya untuk berbuat kebajikan {padahal kalian membaca kitab suci (Taurat)} kalian membaca Taurat {Tidakkah kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Mengapa kamu suruh orang lain mengerjakan kebajikan,” yakni dengan keimanan dan kebaikan, ”sedang kamu melupakan diri (kewajiban) sendiri,” maksudnya kalian meninggalkannya padahal kalian memerintahkannya kepada orang lain, ”padahal “kamu membaca al-kitab (Taurat)? Maka tidakkah kamu berpikir?” dinamakan akal itu sebagai akal karena ia dipakai untuk berpikir kepada kebaikan yang bermanfaat untuknya, dan sadar dengannya dari hal-hal yang memudaratkan dirinya, dan hal tersebut dibuktikan bahwa akal menganjurkan kepada pemiliknya untuk menjadi orang yang pertama meninggalkan apa yang dilarang. Maka barangsiapa yang memerintahkan orang lain kepada kebaikan lalu dia tidak melakukannya atau melarang dari kemunkaran namun dia tidak meninggalkannya, maka hal itu menunjukkan tidak adanya akal padanya dan kebodohannya, khususnya bila dia telah mengetahui akan hal itu, dan hujjah benar-benar telah tegak atasnya. Dan ayat ini walaupun turun terhadap Bani Israil namun ia bersifat umum kepada setiap orang. Sesuai firman Allah: \" Wahai orang-orang yang beriman, kenapakah kamu mengatakan sesuatu yang tidak kamu kerjakan?, Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tidak kamu kerjakan.\" (QS. As-Shoff : 2-3) Dalam ayat ini tidak ada suatu indikasi pun yang menunjukkan bahwasanya seseorang bila tidak melakukan apa yang diperintahkan kepadanya, maka dia boleh meninggalkan ajakan kepada kebaikan dan melarang dari yang munkar, karena ayat itu menunjukkan suatu kecaman berkaitan dengan kedua kewajiban tersebut. Bila tidak seperti itu, maka suatu hal yang telah diketahui bahwasanya setiap manusia memiliki dua kewajiban yaitu memerintah orang lain dan melarangnya, dan memerintah dirinya sendiri dan melarangnya. Maka meninggalkan salah satu dari kedua kewajiban itu bukanlah suatu keringanan untuk meninggalkan yang lainnya, karena idealnya adalah seseorang mampu melakukan kedua kewajiban itu dan demikian juga sangat aib sekali bila seseorang meninggalkan keduanya. Adapun jika dia melakukan salah satu dari kedua kewajiban itu tanpa lainnya, maka dia tidaklah dalam posisi yang ideal dan tidak pula pada posisi sangat aib. Lebih dari itu, diri manusia memang diciptakan dengan kecenderungan tidak respek untuk tunduk kepada orang yang perbuatannya bertentangan dengan perkataanya, maka peniruan mereka dengan perbuatan adalah lebih kuat daripada peniruan mereka dengan sekedar perkataan saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 44: Kemudian Allah mengarahkan firman-Nya kepada bani israil dengan perendahan; Allah berkata sebagai mereka : Apakah manusia diperintahkan dengan mengiman Allah dan rasul-Nya serta menegakkan sholat dan selainnya dari amalan-amalan yang baik, sedangkan kalian tidak diperintahkan untuk berbuat demikian; Padahal kalian telah membaca taurat yang didalamnya terdapat hujjah dan bukti – bukti yang jelas dan terang, apakah kalian tidak menggunakan akal – akal kalian dengan benar yang mana kalian diseru menuju kepada keutamaan – keutamaan dan menjauhkan kalian dari kehinaan – kehinaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni alangkah buruknya keadaan kamu mendorong orang lain mengerjakan kebaikan, namun kamu malah melupakan dirimu untuk memperoleh kebaikan yang besar yaitu Islam, padahal kamu membaca kitab Taurat yang di sana diterangkan sifat Nabi Muhammad shallallahu 'alaihi wa sallam dan kewajiban beriman kepadanya. Tidakkkah kamu menggunakan akal sehatmu?! Ayat ini meskipun turun berkenaan tentang ulama bani Isra'il, namun ia umum kepada setiap orang yang menyuruh orang lain berbuat baik namun ia melupakan dirinya ibarat sebuah lilin yang menerangi orang lain, namun dirinya habis terbakar. Di dalam hadits disebutkan: مَثَلُ الَّذِيْ يُعَلِّمُ النَّاسَ الْخَيْرَ وَ يَنْسَى نَفْسَهُ مَثَلُ الْفَتِيْلَةِ تُضِيء ُلِلنَّاسِ وَ تُحَرِّقُ نَفْسَهَا “Perumpamaan orang yang mengajar kebaikan kepada manusia, namun ia melupakan dirinya sendiri adalah seperti sebuah sumbu, ia menerangi manusia sedangkan dirinya sendiri terbakar.” (HR. Thabrani dari Abu Barzah dan Jundab, dishahihkan oleh Al Albani dalam Shahihul Jaami’ no. 5837)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 44",
    "description": "Selanjutnya, setelah memerintahkan salat dan zakat, ayat ini mengecam pemuka-pemuka yahudi yang sering kali memberi tuntunan kepada orang lain agar berbuat baik, tetapi melakukan sebaliknya dan melupakan diri mereka. Mengapa kamu, bani israil atau pemukapemuka yahudi, menyuruh orang lain, baik yang seagama dengan kamu maupun orang-orang musyrik atau siapa saja, untuk mengerjakan kebajikan, sedangkan kamu melupakan dirimu sendiri dan tidak menyuruh dirimu untuk melakukan kebajikan itu' kamu melakukan hal itu, padahal kamu membaca kitab taurat' tidakkah kamu mengerti dan berakal sehingga memiliki kendali yang menghalangi kamu terjerumus ke dalam dosa dan kesulitan' meski pembicaraan pada ayat ini ditujukan kepada orang-orang yahudi, nasihat yang terkandung di dalamnya juga berlaku bagi kaum muslim, apalagi para pemuka agama, yakni hendaknya mengingatkan diri sendiri lebih dahulu sebelum mengajak orang lain berbuat baikdan mohonlah pertolongan kepada Allah dengan penuh sabar, dengan memelihara keteguhan hati dan menjaga ketabahan, serta menahan diri dari godaan dalam menghadapi hal-hal yang berat, dan juga dengan melaksanakan salat. Dan salat itu sungguh amat berat, kecuali bagi orang-orang yang khusyuk dan tunduk hatinya kepada Allah. Mereka adalah orang-orang yang yakin bahwa mereka akan menemui tuhannya, dan bahwa mereka akan kembali kepada-Nya."
  }
]