[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mintalah pertolongan atas segala urusan kalian melalui kesabaran dengan seluruh jenisnya dan juga shalat, sesungguhnya hal tersebut amat berat kecuali bagi orang-orang yang khusyu. Yaitu orang yang takut kepada Allah dan mengharapkan apa-apa yang ada di sisi-Nya, serta meyakini bahwa mereka benar-benar akan berjumpa dengan Tuhan mereka setelah kematian, dan bahwasanya mereka akan kembali kepadanya pada hari kiamat untuk menghadapi perhitungan dan pembalasan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Mintalah pertolongan dalam menghadapi segala situasi yang berkaitan dengan masalah agama dan dunia kalian dengan kesabaran dan salat yang dapat mendekatkan dan menghubungkan diri kalian dengan Allah. Maka Allah akan menolongmu dalam mengatasi setiap kesulitan yang menderamu. Sesungguhnya salat itu benar-benar sulit dan berat kecuali bagi orang-orang yang tunduk dan patuh kepada Rabb mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Dan mintalah pertolongan dari Allah lewat berbagai kesabaran dan shalat, dan shalat ini sungguh berat melainkan bagi orang-orang yang takut kepada Allah yang percaya bahwa mereka akan bertemu dengan Allah setelah kematian mereka dan akan dibangkitkan pada hari kiamat untuk mendapat balasan pahala atau siksa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَاسْتَعِينُوا بِالصَّبْرِ (Jadikanlah sabar (sebagai penolongmu)) Yakni dengan menahan syahwat dan mengarahkannya kepada ketaatan. وَالصَّلَاةِ (dan shalat sebagai penolongmu) Yakni dengan menjalankan dengan penuh rasa cinta kepada Allah agar dapat membantumu dalam iman kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallam. وَإِنَّهَا لَكَبِيرَةٌ (Dan sesungguhnya yang demikian itu sungguh berat) Yakni sholat itu berat bagi orang yang tidak beriman kepada Allah dan menyombongkan diri dalam menjalankan ketaatan-Nya. إِلَّا عَلَى الْخَاشِعِين (kecuali bagi orang-orang yang khusyu’) Yakni orang-orang yang merasa diri mereka kecil dihadapan kebesaran Allah dan merasa tentram dalam keadaan itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "45-46 1 ). { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ } Shalat dan sabar adalah dua perlindungan yang sangat agung bagi hamba; oleh karena itu keduanya disandingkan dengan perintah menyampaikan kebaikan dan melarang dari kemungkaran pada firman Allah : { أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ } . 2 ). Sabar adalah bekal bagi manusia, tetapi terkadang ia habis, oleh karena itu kita juga diperintahkan untuk menjadikan shalat yang khusu' sebagai penolong; agar bekal itu terus bertambah dan semakin menguatkannya. 3 ). Diantara rambu-rambu qur'ani yang dapat dijadikan pegangan bagi siapapun ketika menghadapi ujian adalah : -Kenyamanan diri dengan : { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ }. -Kesiapan dan kesesriusan yang kuat dalam mengambil ilmu : { يَا يَحْيَىٰ خُذِ الْكِتَابَ بِقُوَّةٍ } \"Hai Yahya, ambillah Al Kitab (Taurat) itu dengan sungguh-sungguh\" [ Maryam : 12 ]. -Sabar yang dengannya akan ada kebaikan setelahnya : { وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا } \"Dan orang-orang yang berjihad untuk (mencari keridhaan) Kami, benar-benar akan Kami tunjukkan kepada mereka jalan-jalan Kami\" [ Al-Ankabut : 69 ]. -Muqoddimah (usaha) dan hasil : { إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا } \"jika kamu bertakwa kepada Allah, Kami akan memberikan kepadamu Furqaan\" [ Al-Anfal : 29 ]. Maka ambillah rambu-rambu ini, niscaya kamu akan menang dan berjaya dunia dan akhirat. 4 ). Dantara sebab-sebab yang sangat berpengaruh yang menjadikan seseorang istiqomah dalam menjaga shalatnya adalah : -Cobalah merasakan indahnya ketenangan dan kehusyu'an dalam shalat. -Selalu ingat bahwa anda akan menghadap Allah dan balasan yang agung dari-Nya, renungilah dua firman Allah ini : { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ , الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ } \"Jadikanlah sabar dan shalat sebagai penolongmu. Dan sesungguhnya yang demikian itu sungguh berat, kecuali bagi orang-orang yang khusyu’ , (yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya\". 5 ). { وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ } Yakni shalat itu berat kecuali atas orang-orang yang tunduk dan berserah diri kepada Allah -جل جلاله-, dan shalat yang merupakan ibadah terdiri dari qiyam dan rukuk dan sujud serta duduk pada hakikatnya tidak berat untuk didirikan, adapun hakikat berat yang ada dalam ibadah ini ketika dilakukan dengan menghadirkan hati yang ikhlas oleh seorang hamba, yang dengannya seseorang mengharap keridhoan Allah -عز وجل- , membaca ayat suci al-Qur'an dengan penuh tadabbur, melafalkan doa dan dzikir-dzikir yang mencakup segala maksud, tanpa disebutkan di lisan, dan seseorang terkadang lalai dari memahami makna dari doa-doa itu padahal itulah inti dari suatu ibadah. 6 ). Tidaklah Allah mengabarkan bahwasanya shalat itu berat atas siapapun kecuali orang-orang yang memiliki sifat-sifat ini; karena sesungguhnya barangsiapa yang tidak yakin dengan hari kebangkitan, dan tidak pula percaya kepada tempat kembali dan balasan serta azab, sungguh shalat baginya hanyalah kesusah payahan dan kesesatan, karena ia tidak mengharap dari shalatnya manfaat dan perlindungan dari bahaya, dan benar bahwa orang-orang yang dalam dirinya terdapat sifata-sifat buruk ini shalat baginya sangatlah berat, dan merupakan sesuatu yang sia-sia. 7 ). Selalu ingat pertemuan hamba dengan Allah dan keagungan balasan-Nya kepada orang-orang taat kepada perintah-Nya, adalah merupakan hal paling berpengaruh untuk meringankan ibadah-ibadah, dan sabar atas maksiat, serta menjadi penghibur ketika musibah menimpa, perhatikan firman Allah berikut : { الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Saling tolong-menolonglah kalian dengan bersabar dalam ketaatan dan menahan nafsu syahwat; dan melakukan shalat pada waktunya dengan khusyu’ karena dalam keduanya ada sesuatu yang dapat mengendalikan diri kalian, menahan ketidaknyamanan kalian, menghentikan kalian untuk berbuat buruk dan (mendorong) melakukan kebaikan. Shalat itu amat sangat berat kecuali bagi mereka yang menundukkan diri untuk mengagungkan Allah dan takut dengan siksaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Mohonlah pertolongan} dan carilah pertolongan kalian atas segala urusan kalian {dengan sabar dan shalat. Sesungguhnya shalat itu benar-benar berat} benar-benar berat {kecuali bagi orang-orang yang khusyuk} orang-orang yang tunduk kepada tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah memerintahkan kepada mereka untuk meminta pertolongan dalam (menyelesaikan) segala urusan mereka dengan kesabaran dalam segala bentuknya, yaitu sabar dalam ketaatan kepada Allah hingga dia mampu menunaikannya, sabar dari kemaksiatan hingga dia menghindarinya, dan sabar dalam menghadapi taqdir-taqdir Allah yang menyakitkan agar dia tidak mengecamnya. Dengan kesabaran dan menahan diri terhadap segala yang diperintahkan oleh Allah untuk bersabar atasnya adalah sebuah pertolongan yang besar dalam setiap perkara dari perkara-perkara yang ada, dan barangsiapa yang bersabar, niscaya Allah akan membuatnya menjadi sabar. Demikian juga shalat yang merupakan timbangan dari keimanan dan dapat mencegah dari perbuatan keji dan mungkar, dapat dijadikan penolong dalam segala perkara kehidupan. “Dan sesungguhnya yang demikian itu,” yaitu shalat, ”sungguh berat, ” maksudnya sulit, “kecuali bagi orang-orang yang khusyu’.” Shalat itu adalah mudah bagi mereka dan sangat ringan, karena kekhusyu’an, takut kepada Allah, dan mengharap apa yang ada di sisiNya mengharuskan adanya realisasi perbuatan itu dengan dada yang lapang demi mencari ganjaran dan takut dari hukuman. Berbeda dengan orang yang tidak demikian, karena tidak ada pendorong baginya yang mengajaknya kepada hal tersebut, dan bila pun dia melakukannya, maka hal itu menjadi suatu perkara yang paling berat yang dia rasakan. Khusyu’ adalah ketundukan hati, ketenteraman dan ketenangannya karena Allah ta’ala serta kepasrahannya di hadapan Allah dengan segala bentuk menghinakan diri, rasa butuh, dan iman kepadaNya dan kepada pertemuan denganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 45: Allah memerintahkan bani israil untuk meminta pertolongan dengan kesabaran yaitu seluruh macam – macam sabar didalam segala urusan seluruhnya, begitu juga gara senantiasa menegakkan sholat yang menghalangi dari dosa dan kemungkaran. Allah juga menjelaskan bahasanya sholat merupakan sebagian amalan yang susah dilasanakan kecuali bagai mereka yang takut kepada allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jadikanlah sabar dengan semua macamnya dan shalat sebagai penolongmu untuk mengatasi semua masalah. Sabar itu ada beberapa macam, yaitu: 1) sabar dalam menjalankan keta'atan kepada Allah, 2) sabar dalam menjauhi larangan Allah, dan 3) sabar terhadap taqdir Allah dengan tidak berkeluh-kesah. Bagi mereka yang khusyu', memiliki rasa takut kepada Allah, berharap apa yang ada di sisi-Nya dan rasa cinta kepada-Nya mengerjakan shalat itu ringan. Karena hal tersebut (khusyu', rasa takut dan harap) menghendaki untuk mengerjakannya dengan lapang dada dan senang. Berbeda dengan yang tidak memilikinya, mengerjakan shalat menjadi hal yang sangat berat meskipun hanya sebentar. Khusyu' artinya tunduknya hati, tenang dan tenteramnya kepada Allah Ta'ala, memasrahkan diri kepada-Nya dengan menghinakan diri, menampakkan rasa butuh serta beriman kepada Allah dan kepada pertemuan dengan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 45",
    "description": "Dan mohonlah pertolongan kepada Allah dengan penuh sabar, dengan memelihara keteguhan hati dan menjaga ketabahan, serta menahan diri dari godaan dalam menghadapi hal-hal yang berat, dan juga dengan melaksanakan salat. Dan salat itu sungguh amat berat, kecuali bagi orang-orang yang khusyuk dan tunduk hatinya kepada Allah. Mereka adalah orang-orang yang yakin bahwa mereka akan menemui tuhannya, dan bahwa mereka akan kembali kepada-Nya"
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Melalui firman-Nya ini, Allah ta’ala menyuruh hamba-Nya untuk meraih kebiakan dunia dan akhirat yang mereka dambakan, dengan cara menjadikan kesabaran dan sholat sebagai penolong. Sebagaimana yang dikatakan Muqotil Bin Hayyan dalam tafsirnya mengenai ayat ini : “Hendaklah kalian mengejar kehidupan dunia dan akhirat dengan cara menjadikan kesabaran dalam mengerjakan berbagai kewajiban dan shalat sebagai penolong”. Menurut Mujahid yang dimaksud dengan sabar dalam ayat ini adalah shiyam (puasa). Al-Qurtubi dan ulama lainnya mengatakan, “oleh karena itu bulan Ramadhan disebut sebagai bulan kesabaran”. Ada juga yang berpendapat bahwa yang dimaksud dengan sabar pada ayat tersebut adalah menahan diri dari perbuatan maksiat, karena disebutkan bersama dengan pelaksanaan berbagai macam ibadah, dan yang paling utama adalah ibadah sholat. Ibnu Abi Hatim telah berkata, bahwa Umar Bin Khottob pernah berkata : “Sabar itu ada dua; sabar ketika mendapatkan musibah adalah baik, dan lebih baik lagi bersabar dalam menahan diri dari mengerjakan apa yang Allah haramkan”. Hal yang semakna juga telah diriwayatkan oleh Hasan Al-Bashri. Ibnul Mubarok meriwayatkan dari Said bin Jubair, katanya, “kesabaran itu adalah pengaduan hamba kepada Allah ta’ala atas apa yang menimpa dan mengharap keridhoan di sisi-Nya menghendaki pahala-Nya. Terkadang seseorang merasa cemas tetapi ia tetap tegar, tidak terlihat darinya kecuali kesabaran”. Adapun sholat, ia merupakan pertolongan yang paling besar untuk bias tetap dan yakin dalam suatu urusan, sebagaimana firman Allah ta’ala : اتْلُ مَا أُوحِيَ إِلَيْكَ مِنَ الْكِتَابِ وَأَقِمِ الصَّلَاةَ إِنَّ الصَّلَاةَ تَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَلَذِكْرُ اللَّهِ أَكْبَرُ وَاللَّهُ يَعْلَمُ مَا تَصْنَعُونَ Bacalah apa yang telah diwahyukan kepadamu, yaitu Al Kitab (Al Quran) dan dirikanlah shalat. Sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar. Dan sesungguhnya mengingat Allah (shalat) adalah lebih besar (keutamaannya dari ibadat-ibadat yang lain). Dan Allah mengetahui apa yang kamu kerjakan. (QS. Al-‘Ankabut : 45) Imam Ahmad telah meriwayatkan dari hudaifah Ibnu Yaman bahwasanya ia berkata; “Rosululloh sholallohu’alaihi wasallam jika ditimpa satu masalah, maka segera mengerjakan sholat” (HR. Abu Daud) Adapun firman-Nya : وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ “Jadikanlah sabar dan shalat sebagai penolongmu” Sunaid meriwayatkan dari Hajjaj, dari Ibnu Juraij, Ia mengatakan bahwa sabar dan sholat merupakan penolong untuk mendapatkan rahmat Allah ta’ala. Adapun dhomir yang digunakan dalam firman-Nya : وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ Kembali kepada kalimat sholat. Demikian dinyatakan oleh Mujahid dan menjadi pilihan Ibnu Jarir. Dan bisa juga kembali pada kandungan ayat itu sendiri, yaitu perintah untuk melakukan sabar dan sholat sebagai cara meminta pertolongan. Artinya, bersabar dalam menghadapi segala ujian hidup dan melaksanakan sholat itu adalah sesuatu yang berat, kecuali untuk orang-orang yang khusyu’. Mujahid mengatakan, “Mereka adalah orang-orang yang beriman dengan sebenar-benar keimanan”. Ad-Dhohak mengatakan, “Mereka adalah orang-orang yang tunduk dalam ketaatan kepada-Nya, yang takut akan kekuasaan-Nya, serta yang yakin dengan janji dan ancaman-Nya. Ibnu jarir mengatakan, makna ayat ini adalah “wahai sekalian orang ‘alim dari kalangan ahlu kitab, mohonlah pertolongan dengan menahan diri kalian dalam ketaatan kepada Allah dan mendirikan sholat yang dapat mencegah kalian dari kekejian dan kemungkaran serta dapat mendekatkan diri kalian kepada keridhoan Allah. Hal itu sangat berat, kecuali bagi orang-orang yang khusyu’, yaitu mereka yang patuh dan tunduk dalam ketaatan kepada-Nya serta merendahkan diri karena takut kepada-Nya”. Secara kontekstual, ayat ini ditujukan kepada Bani Isroil, namun yang dimaksud tentu bukanlah hanya mereka semata, akan tetapi ditunjukan secara umum baik kepada mereka maupun selain mereka."
  }
]