[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang yang takut kepada Allah dan mengharapkan apa-apa yang ada di sisi-Nya, serta meyakini bahwa mereka benar-benar akan berjumpa dengan Tuhan mereka setelah kematian, dan bahwasanya mereka akan kembali kepadanya pada hari kiamat untuk menghadapi perhitungan dan pembalasan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Hal itu karena mereka yakin akan menghadap kepada Rabb mereka dan akan berhadapan langsung dengan-Nya kelak di hari kiamat. Dan mereka juga percaya akan kembali kepada-Nya untuk menerima balasan amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ (yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya) Yakni yakin akan pertamuan dengan Allah yang kemudian akan membalas pahala mereka dan menambah keutamaan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "45-46 1 ). { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ } Shalat dan sabar adalah dua perlindungan yang sangat agung bagi hamba; oleh karena itu keduanya disandingkan dengan perintah menyampaikan kebaikan dan melarang dari kemungkaran pada firman Allah : { أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ } . 2 ). Sabar adalah bekal bagi manusia, tetapi terkadang ia habis, oleh karena itu kita juga diperintahkan untuk menjadikan shalat yang khusu' sebagai penolong; agar bekal itu terus bertambah dan semakin menguatkannya. 3 ). Diantara rambu-rambu qur'ani yang dapat dijadikan pegangan bagi siapapun ketika menghadapi ujian adalah : -Kenyamanan diri dengan : { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ }. -Kesiapan dan kesesriusan yang kuat dalam mengambil ilmu : { يَا يَحْيَىٰ خُذِ الْكِتَابَ بِقُوَّةٍ } \"Hai Yahya, ambillah Al Kitab (Taurat) itu dengan sungguh-sungguh\" [ Maryam : 12 ]. -Sabar yang dengannya akan ada kebaikan setelahnya : { وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا } \"Dan orang-orang yang berjihad untuk (mencari keridhaan) Kami, benar-benar akan Kami tunjukkan kepada mereka jalan-jalan Kami\" [ Al-Ankabut : 69 ]. -Muqoddimah (usaha) dan hasil : { إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا } \"jika kamu bertakwa kepada Allah, Kami akan memberikan kepadamu Furqaan\" [ Al-Anfal : 29 ]. Maka ambillah rambu-rambu ini, niscaya kamu akan menang dan berjaya dunia dan akhirat. 4 ). Dantara sebab-sebab yang sangat berpengaruh yang menjadikan seseorang istiqomah dalam menjaga shalatnya adalah : -Cobalah merasakan indahnya ketenangan dan kehusyu'an dalam shalat. -Selalu ingat bahwa anda akan menghadap Allah dan balasan yang agung dari-Nya, renungilah dua firman Allah ini : { وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ , الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ } \"Jadikanlah sabar dan shalat sebagai penolongmu. Dan sesungguhnya yang demikian itu sungguh berat, kecuali bagi orang-orang yang khusyu’ , (yaitu) orang-orang yang meyakini, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya\". 5 ). { وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ } Yakni shalat itu berat kecuali atas orang-orang yang tunduk dan berserah diri kepada Allah -جل جلاله-, dan shalat yang merupakan ibadah terdiri dari qiyam dan rukuk dan sujud serta duduk pada hakikatnya tidak berat untuk didirikan, adapun hakikat berat yang ada dalam ibadah ini ketika dilakukan dengan menghadirkan hati yang ikhlas oleh seorang hamba, yang dengannya seseorang mengharap keridhoan Allah -عز وجل- , membaca ayat suci al-Qur'an dengan penuh tadabbur, melafalkan doa dan dzikir-dzikir yang mencakup segala maksud, tanpa disebutkan di lisan, dan seseorang terkadang lalai dari memahami makna dari doa-doa itu padahal itulah inti dari suatu ibadah. 6 ). Tidaklah Allah mengabarkan bahwasanya shalat itu berat atas siapapun kecuali orang-orang yang memiliki sifat-sifat ini; karena sesungguhnya barangsiapa yang tidak yakin dengan hari kebangkitan, dan tidak pula percaya kepada tempat kembali dan balasan serta azab, sungguh shalat baginya hanyalah kesusah payahan dan kesesatan, karena ia tidak mengharap dari shalatnya manfaat dan perlindungan dari bahaya, dan benar bahwa orang-orang yang dalam dirinya terdapat sifata-sifat buruk ini shalat baginya sangatlah berat, dan merupakan sesuatu yang sia-sia. 7 ). Selalu ingat pertemuan hamba dengan Allah dan keagungan balasan-Nya kepada orang-orang taat kepada perintah-Nya, adalah merupakan hal paling berpengaruh untuk meringankan ibadah-ibadah, dan sabar atas maksiat, serta menjadi penghibur ketika musibah menimpa, perhatikan firman Allah berikut : { الَّذِينَ يَظُنُّونَ أَنَّهُمْ مُلَاقُو رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "(Yaitu) orang-orang yang yakin bahwa mereka akan bertemu dengan Tuhan mereka, lalu Allah membalas mereka dengan pahala dan menambahkan kepada mereka karuniaNya. Sesungguhnya mereka adalah orang-orang yang kembali kepada Allah sesuai perhitungan amal dan pahala mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) orang-orang yang meyakini} orang-orang yang meyakini {bahwa sesungguhnya mereka akan menemui Tuhan mereka dan hanya kepadaNya mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Yaitu orang-orang yang meyakini, ” yakni yang yakin serta percaya, ”bahwa mereka akan menemui Rabbnya, ” lalu Dia akan membalas perbuatan-perbuatan mereka, ”dan bahwa mereka akan kembali kepadaNya.” Inilah yang meringankan mereka dalam beribadah, yang mewajibkan bagi mereka untuk berhibur diri dalam segala musibah, berlapang dada dalam segala kesulitan, dan mencegah mereka dari berbuat keburukan. Maka mereka itulah orang-orang yang mendapatkkan kenikmatan yang abadi dalam ruangan-ruangan yang tinggi. Adapun orang yang tidak beriman kepada pertemuan dengan Rabbnya, maka shalat dan ibadah-ibadah lainnya adalah suatu hal yang paling sulit bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 46: Kemudian Allah menjelaskan bahwasannya sifat mereka yang takut kepada Allah adalah mereka yang senantiasa takut dan mengharap apa yang di sisi Allah, dan menyakini bahwasannya mereka akan dipertemukan Rabb mereka, serta mereka juga akan kembali kepada Allah di hari kiamat untuk dihisab dan dibalas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka yakin akan bertemu dengan Tuhannya setelah mati dan akan kembali kepada-Nya pada hari kiamat untuk dihisab dan menerima pembalasan terhadap amal. Semua rasa inilah yang membuat mereka merasa ringan menjalankan ibadah, membuat mereka tetap terhibur ketika mendapatkan musibah, meringankan derita mereka dan mencegah diri mereka dari berbuat maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 46",
    "description": "Dan mohonlah pertolongan kepada Allah dengan penuh sabar, dengan memelihara keteguhan hati dan menjaga ketabahan, serta menahan diri dari godaan dalam menghadapi hal-hal yang berat, dan juga dengan melaksanakan salat. Dan salat itu sungguh amat berat, kecuali bagi orang-orang yang khusyuk dan tunduk hatinya kepada Allah. Mereka adalah orang-orang yang yakin bahwa mereka akan menemui tuhannya, dan bahwa mereka akan kembali kepada-Nya. Pada ayat ini, Allah kembali mengingatkan bani israil tentang nikmat-Nya agar lebih mendorong mereka untuk bersyukur. Wahai bani israil! ingatlah nikmat-ku yang telah aku berikan kepadamu dan nenek moyang kamu, dan aku telah melebihkan kamu dari semua umat yang lain di alam ini yang memiliki peradaban maju seperti bangsa mesir atau penduduk palestina pada masa itu. Allah memanggil mereka dengan panggilan bani israil untuk mengingatkan bahwa pada masa nenek moyang merekalah terdapat kelebihan yang dianugerahkan Allah kepada bangsa ini. Allah mengingatkan mereka agar mensyukuri nikmat itu antara lain dengan mempercayai datangnya nabi yang telah diberitakan di dalam kitab sucinya."
  }
]