[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai para keturunanYa’qub, ingatlah akan segala nikmat Ku yang banyak terlimpah pada kalian, dan bersyukurlah kepadaku karena nikmat-nikmat itu dan ingatlah oleh kalian bahwa sesungguhnya Aku telah mengistimewakan kalian di atas seluruh manusia pada zaman kalian dengan jumlah nabi yang banyak dan kitab-kitab yang diturunkan pada kalian seperti Taurat dan Injil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Wahai anak-anak Nabiyullāh Ya'qūb! Ingatlah akan nikmat-nikmat-Ku yang berkaitan dengan masalah agama maupun dunia yang Ku-berikan kepada kalian. Dan ingatlah bahwa Aku telah melebihkan kalian atas orang-orang yang hidup di zaman kalian dengan derajat kenabian dan kerajaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Allah menyeru para keturunan nabi Ya’qub: “Ingatlah kenikmatan-kenikmatan yang telah Aku berikan kepada kalian, diantaranya adalah telah Aku utamakan kalian dari segenap kaum lainnya pada zaman kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. يَا بَنِي إِسْرَائِيلَ اذْكُرُوا نِعْمَتِيَ (Hai Bani Israil, ingatlah akan nikmat-Ku) Bentuk nikmat-nikmat ini telah dijelaskan pada ayat 40. Dan makna dari ayat ini adalah apabila kalian mengingat nikmat-nikmat ini maka tunaikanlah kewajibannya dan berimanlah dengan rasul yang Aku utus. وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ(dan (ingatlah pula) bahwasanya Aku telah melebihkan kamu atas segala umat) Terdapat pendapat mengatakan maksud dari segala umat adalah umat pada zaman mereka. Dan pendapat yang lain mengatakan maksudnya adalah umat secara keseluruhan karena banyaknya nabi yang diutus dari golongan mereka; dan ini berlaku ketika mereka masih beriman kepada rasul-rasul yang diutus oleh Allah kepada mereka. Dan mereka tidak lebih mulia dari umat Nabi Muhammad Shallallahu ‘Alaihi Wasallamdengan dalil firman Allah dalam surat ali Imran:110 : كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ Kalian adalah umat yang terbaik yang dilahirkan untuk manusia"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai keturutan Ya’kub bin Ishaq bin Ibrahim! Ingatlah nikmatKu atas kalian, lalu berikanlah kepada yang berhak atasnya, dan berimanlah kepada utusanKu. Dan ingatlah bahwa sesungguhnya Aku telah mengistimewakan kalian di atas alam semesta di zaman kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Bani Israil, ingatlah nikmatKu yang telah Aku anugerahkan kepada kalian dan sesungguhnya Aku telah melebihkan kalian di seluruh alam} di seluruh alam pada zaman kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Kemudian Allah mengulangi peringatanNya kepada Bani Israil tentang nikmat-nikmatNya sebagai suatu nasihat, peringatan, dan anjuran bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : يَٰبَنِيٓ إِسۡرَٰٓءِيلَ Yaa Banii Israil : Sudah dijelaskan artinya pada ayat sebelumnya. فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ Faddholtukum ‘alal ‘aalamiin : Allah memberikan nikmat-nikmat keagamaan dan keduniaan yang tidak diberikan kepada selain mereka. Hal itu terjadi pada masa Nabi Musa ‘alaihissalam dan masa keemasan saat masih berada di atas kebaikan dan keistiqomahan. Makna ayat : Allah Ta’ala memanggil bani Israil untuk meminta mereka agar menyebut nikmat-nikmat yang didapatkan agar mereka mensyukurinya dengan beriman kepada RasulNya Muhammad ﷺ dan menerima agama serta kebenaran yang beliau bawa, yaitu Islam Pelajaran dari ayat : • Kewajiban untuk menyebut nikmat-nikmat yang diperoleh agar bani Israil mensyukuri nikmat diutusnya Muhammad dan taat kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 47: Kemudian Allah mengulangi seruan kepada bani israil dan merintahkan mereka untuk mengingat nikmat Allah yang banyak dilimpahkan kepada mereka, begitu juga agar senantiasa bersyukur dan taat. Dan diantara nikmat yang bahwasanya Allah mengkaruniakan kepada bapak – bapak mereka yaitu pengikut Musa atas orang – orang alim dijaman mereka; Karena pengikut Nabi lebih afdhal dibandingkan orang – orang pandai dijaman mereka. Dan tidak diragukan bahwasanya mengutamakan bapak lebih mulia dibandingkan mengutamakan anak, dan pengutamaan Allah bagi mereka yaitu dengan mengutus para rasul, menurunkan kitab – kitab dan bahwasannya Allah memberikan mereka ke bahagiaan dan kerajaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang mengharuskan untuk bersyukur kepada-Nya, bukan malah mengkufurinya. Bani Israil yang telah diberi rahmat oleh Allah dan dilebihkannya dari segala ummat ialah nenek moyang mereka yang berada di masa Nabi Musa alaihis salam. Termasuk kelebihan yang diberikan Allah Ta'ala kepada mereka adalah banyaknya para nabi dari kalangan mereka serta diturunkan-Nya kitab-kitab kepada mereka seperti Taurat dan Injil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 47",
    "description": "Pada ayat ini, Allah kembali mengingatkan bani israil tentang nikmat-Nya agar lebih mendorong mereka untuk bersyukur. Wahai bani israil! ingatlah nikmat-ku yang telah aku berikan kepadamu dan nenek moyang kamu, dan aku telah melebihkan kamu dari semua umat yang lain di alam ini yang memiliki peradaban maju seperti bangsa mesir atau penduduk palestina pada masa itu. Allah memanggil mereka dengan panggilan bani israil untuk mengingatkan bahwa pada masa nenek moyang merekalah terdapat kelebihan yang dianugerahkan Allah kepada bangsa ini. Allah mengingatkan mereka agar mensyukuri nikmat itu antara lain dengan mempercayai datangnya nabi yang telah diberitakan di dalam kitab sucinya. Dan takutlah kamu serta jagalah dirimu dari kesulitan pada hari kiamat, ketika tidak seorang pun dapat membela orang lain sedikit pun. Jangan kamu menduga bahwa orang tua, betapa pun terhormat dan taatnya dia kepada Allah, berkesempatan untuk membela atau memberi syafaat, sedangkan syafaat dan tebusan apa pun darinya tidak diterima dan mereka tidak akan ditolong. Syafaat (arab: syafa''ah) secara harfiah berarti genap (syaf'), lawan dari ganjil (witr). Orang yang meminta syafaat menggenapkan dirinya dengan orang lain, meminta pertolongan, untuk memperoleh sesuatu, sehingga ia tidak lagi sendiri (ganjil) di dalam pengharapan itu. Ayat ini memberikan kesan bahwa orang-orang yahudi tidak mensyukuri nikmat Allah. Pada ayat ini Allah mengingatkan mereka agar takut kepada siksaan Allah pada hari kiamat. Pada hari itu, tidak ada syafaat yang dapat menolong mereka, dan tidak ada tebusan apa pun yang dapat menggantikan siksaan Allah yang ditimpakan kepada mereka."
  }
]