[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Takutlah terhadap hari kiamat suatu hari yang tak seorangpun dapat memberikan manfaat bagi orang lain dan Allah tidak menerima syafaat bagi orang-orang kafir, serta tidak menerima tebusan dari mereka meskipun berupa semua kekayaan yang ada di muka bumi. Pada hari itu tidak ada seorangpun yang memiliki kemampuan untuk maju untuk menolong dan menyelamatkan mereka dari siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Buatlah pelindung di antara kalian dan azab di hari kiamat dengan melaksanakan perintah-perintah dan menjauhi larangan-larangan. Pada hari itu seseorang tidak dapat membela orang lain sedikitpun; tidak ada satupun syafaat (pertolongan) yang diterima untuk menghindari mudarat maupun mendatangkan manfaat kecuali dengan izin Allah; tidak akan diterima tebusan dari siapapun, walaupun berupa emas sebesar bumi; dan tidak ada seorangpun dan dapat menolong mereka. Maka apabila syafaat, tebusan dan pertolongan tidak ada gunanya, ke manakah tempat pelarian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Dan berhati-hatilah kalian dari hari kiamat, yaitu hari yang tidak berguna lagi seseorang bagi orang lain, pada hari itu Allah tidak menerima syafaat untuk orang-orang kafir, dan tidak berguna bagi mereka harta tebusan meski setara dengan seluruh harta yang ada di bumi, serta tidak ada seorangpun yang mampu menyelamatkan mereka dari azab neraka jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَاتَّقُوا يَوْمًا (Dan jagalah dirimu dari hari kiamat) Yakni dari azab pada hari tersebut. لَا تَجْزِي نَفْسٌ عَنْ نَفْسٍ شَيْئًا((yang pada hari itu) seseorang tidak dapat membela orang lain, walau sedikitpun) Yakni tidak dapat memenuhi kewajiban orang lain. وَلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ (dan (begitu pula) tidak diterima syafa’at) Yakni jika ada yang datang untuk memberi syafa’at maka syafa’at itu tidak akan diterima. وَلَا يُؤْخَذُ مِنْهَا عَدْلٌ (dan tidak diterima tebusan dari padanya) Yakni tebusan dalam bentuk apapun, baik itu harta, kerabat, ataupun anak. وَلَا هُمْ يُنْصَرُونَ (dan tidaklah mereka akan ditolong) Yakni tidak ada satupun yang akan menolong dan menyelamatkannya dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan waspadalah terhadap siksa hari kiamat, dimana seseorang tidak dapat berbuat apapun untuk yang lainnya, syafaat dari para pemberi syafaat untuk orang-orang yang mati dalam keadaan kafir tidak diterima di sisi Allah, suatu tebusan sebagai ganti dari siksa tidak diterima ketika hari itu dan tidak ada satupun orang yang dapat menolong dan menahan mereka dari siksa Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Takutlah kalian kepada hari yang mana seseorang tidak bisa menolong} tidak berguna {bagi orang lain sedikit pun, syafaat dan tebusan apa pun darinya tidak diterima} tebusan {dan tidaklah mereka akan ditolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Dan Allah mempertakutkan mereka dengan Hari kiamat, yang “tidak dapat membela, ” pada hari itu, maksudnya tidaklah “seseorang” bisa menolong walaupun dia adalah seorang yang mulia seperti para Nabi dan orang-orang shalih, bagi “orang lain’ walaupun keluarga paling terdekat sekalipun, ”walau sedikitpun, ” tidak besar dan tidak pula kecil. Akan tetapi seorang manusia hanya dapat memanfaatkan perbuatan-perbuatan yang telah dia kerjakan sebelumny. “dan begitu pula tidak diterima darinya,” yaitu dari seseorang, ”syafa’at” bagi seseorang pun tanpa ada izin dari Allah dan keridhaanNya terhadap orang yang diberi syafa’at, dan tidaklah Allah meridhai suatu amal perbuatan kecuali dilakukan karena hanya mengharap ridhaNya dan perbuatan itu sesuai dengan jalan dan sunnah. “Dan tebusan darinya tidak diambil, ” yakni pembayaran tebusan. Dan kalau setiap diri yang zhalim itu mempunyai segala yang ada di bumi ini ditambah yang seperti itu lagi, niscaya mereka tidak akan bisa menebus diri mereka dengannya dari azab Allah. Allah tidaklah menerima itu dari mereka, ”dan tidaklah mereka akan ditolong, ” maksudnya, mereka tidak akan dibela dari ancaman hal-hal yang dibenci, maka Allah menghilangkan segala bentuk bantuan dari makhluk dalam bentuk apapun. firmanNYa, ”seseorang tidak dapat membela orang lain, walau sedikit pun, ” adalah dalam mendapatkan manfaat, ”dan tidaklah mereka akan ditolong, ” adalah dalam menghilangkan kemudaratan. Maka peniadaan ini adalah untuk perkara masa yang akan datang bagi orang bersangkutan. “Dan (begitu pula) tidak diterima syafa’at dan tebusan dari padanya.” Ini adalah peniadaan akan manfaat yang diminta kepada orang yang memilikinya dengan suatu kompensasi, seperti dengan tebusan atau selainnya seperti syafa’at. Berdasarkan semua ini wajiblah atas seorang hamba untuk memutuskan ketergantungan hatinya kepada makhluk karena mengetahui bahwasanya makhluk itu tidaklah memiliki manfaat walaupun seberat biji dzarrah, dan agar dia hanya menggantungkan dirinya kepada Allah saja dalam mendapatkan manfaat-manfaat dan menolak mudarat-mudarat, sehingga dia menyembahNya semata, yang tidak ada sekutu bagiNya dan memohon pertolongan hanya kepadaNya dalam beribadah kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : وَٱتَّقُواْ يَوۡمٗا Ittaquu yauman : Hari yang dimaksud adalah hari kiamat, dalilnya adalah sifat-sifat yang ditunjukkan oleh hari tersebut. Takut pada hari itu maknanya adalah takut terhadap kejadian besar yang terjadi berupa adzab dan hal-hal yang mengerikan, dengan keimanan dan beramal shalih. لَّا تَجۡزِي نَفۡسٌ Laat tajziy nafsun : Tidak bisa satu jiwa membela jiwa yang lainnya selama masih kafir. وَلَا يُقۡبَلُ مِنۡهَا شَفَٰعَةٞ wa Laa yuqbalu minha syafaa’at : Jiwa yang masih kafir tidak dapat menerima syafa’at dari orang yang memberikan syafa’at. وَلَا يُؤۡخَذُ مِنۡهَا عَدۡلٞ Wa laa yu’khodzu minha ‘adlun : Seharusnya jiwa yang kafir itu menyerahkan tebusan, akan tetapi tidak diterima darinya. وَلَا هُمۡ يُنصَرُونَ wa laa hum yunshoruun : Tidak ditolong dengan dijauhkan adzab darinya. Makna ayat : Kemudian Allah memperingatkan bani Israil akan adzab yang menimpa pada hari kiamat, serta memerintahkan mereka agar takut terhadap hari itu dengan beriman dan beramal shalih. Karena itu adalah hari yang amat mulia dimana syafa’at bagi orang kafir tidak akan diterima dan tidak ada tebusan, serta tidak ada seorangpun yang bisa menjauhkan dari adzab. Pelajaran dari ayat : • Kewajiban untuk takut dan berlindung dari adzab pada hari kiamat dengan keimanan dan amal shalih setelah meninggalkan kesyirikan dan kemaksiatan. • Penetapan bahwa syafa’at tidak diberikan kepada orang kafir, dan tebusan tidak diterima pada hari kiamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 48: Kemudian Allah memerintahkan bani Israil agar takut kepada hari kiamat dimana hari itu tidak bermanfaat seseorang bagi seseorang yang lain, dan Allah juga menerima pada hari tersebut seseorang memberi syafa’at kepada orang – orang kafir, dan tidak menerima hujjah dari orang kafir, serta tidak memiliki kuasa seorang pun dihari itu pada orang kafir atau menolongnya atau menyelamatkan dari azab Allah yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syafa'at: usaha perantaraan dalam memberikan sesuatu manfaat bagi orang lain atau mengelakkan sesuatu mudharat bagi orang lain. syafa'at yang tidak diterima di sisi Allah adalah syafa'at bagi orang-orang kafir. Meskipun dengan harta yang ada di bumi semuanya. Ayat di atas semakna dengan ayat berikut: \"Sesungguhnya orang-orang yang kafir dan mati dalam keadaan kekafirannya, maka tidaklah diterima dari seseorang di antara mereka emas sepenuh bumi, walaupun dia menebus diri dengan emas (sebanyak) itu. bagi mereka itulah siksa yang pedih dan mereka sekali-kali tidak memperoleh penolong.\" (Ali Imran: 91) Tidak ada seorang pun yang berani maju untuk menolong mereka dan menyelamatkan mereka dari azab. Ayat di atas menyuruh kita untuk tidak bergantung kepada makhluk, karena mereka sama sekali tidak memiliki dan tidak berkuasa apa-apa meskipun seberat dzarrah pada hari kiamat, dan agar kita bergantung kepada Allah, karena Dia yang mampu mendatangkan manfa'at dan menolak madharat. Oleh karena itu, hendaknya kita beribadah kepada-Nya dan meminta-Nya pertolongan dalam beribadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 48",
    "description": "Dan takutlah kamu serta jagalah dirimu dari kesulitan pada hari kiamat, ketika tidak seorang pun dapat membela orang lain sedikit pun. Jangan kamu menduga bahwa orang tua, betapa pun terhormat dan taatnya dia kepada Allah, berkesempatan untuk membela atau memberi syafaat, sedangkan syafaat dan tebusan apa pun darinya tidak diterima dan mereka tidak akan ditolong. Syafaat (arab: syafa''ah) secara harfiah berarti genap (syaf'), lawan dari ganjil (witr). Orang yang meminta syafaat menggenapkan dirinya dengan orang lain, meminta pertolongan, untuk memperoleh sesuatu, sehingga ia tidak lagi sendiri (ganjil) di dalam pengharapan itu. Ayat ini memberikan kesan bahwa orang-orang yahudi tidak mensyukuri nikmat Allah. Pada ayat ini Allah mengingatkan mereka agar takut kepada siksaan Allah pada hari kiamat. Pada hari itu, tidak ada syafaat yang dapat menolong mereka, dan tidak ada tebusan apa pun yang dapat menggantikan siksaan Allah yang ditimpakan kepada mereka. Di ayat-ayat yang lalu, Allah mengingatkan bani israil tentang anugerah yang mereka terima yang tidak pernah diberikan kepada umatumat yang lain, ayat berikut mengingatkan mereka tentang penyelamatan dari malapetaka yang akan menimpa. Dan ingatlah peristiwa ketika kami menyelamatkan kamu dari pengikut-pengikut fir'aun, penguasa mesir. Mereka menimpakan siksaan yang sangat berat kepadamu, yakni mereka menyembelih anak-anak laki-lakimu dan membiarkan hidup anakanak perempuanmu. Dan pada peristiwa yang demikian itu merupakan cobaan dan ujian yang sangat besar dari tuhanmu."
  }
]