[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah nikmat-nikmat kami kepada kalian ketika kami telah menyelamatkan kalian dari kekejaman Firaun dan para pengikutnya, mereka itu menimpakan atas kalian siksaan yang sangat kejam , mereka banyak menyembelih anak-anak laki-laki kalian dan membiarkan anak-anak perempuan kalian hidup untuk dijadikan sebagai pelayan dan bahan penistaan. Dan dalam kejadian ini terdapat ujian bagi kalian dari Tuhan kalian. Dan pada penyelamatan kalian dari peristiwa tersebut merupakan kenikmatan besar yang mewajibkan kalian untuk bersyukur kepada Allah ta'ala pada tiap-tiap masa dan generasi kalian"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan ingatlah, wahai Bani Israil, tatkala Kami menyelamatkan kalian dari para pengikut Fir'aun yang telah menimpakan beragam siksaan kepada kalian. Mereka menyembelih anak-anak laki-laki kalian supaya kalian punah. Dan mereka membiarkan para wanita kalian hidup untuk menjadi pelayan mereka. Perbuatan mereka sangat merendahkan dan menistakan kalian. Di balik penyelamatan kalian dari kekejaman Fir'aun dan para pengikutnya terdapat ujian besar dari Rabb kalian, yaitu agar kalian mau bersyukur kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Allah mengingatkan keturunan Nabi Ya’qub tentang berbagai kenikmatan yang telah Allah berikan kepada mereka sebagaimana yang disebutkan dalam 13 ayat ke depan; yaitu ketika Allah menyelamatkan pendahulu mereka dari kezaliman Fir’aun dan bala tentaranya yang menyiksa mereka dengan azab yang sangat berat; mereka membunuh para lelaki dan membiarkan para wanita tetap hidup untuk mereka jadikan pembantu dan pekerja; dan dalam siksaan yang berat itu terdapat ujian besar dari Sang Pencipta Yang Maha Bijaksana."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَإِذْ نَجَّيْنَاكُمْ Yakni ingatlah ketika kami menyelamatkan kalian مِنْ آلِ فِرْعَوْنَ Maksud dari fir’aun adalah nama dari raja yang bertahta pada waktu itu. Namun pendapat lain mengatakan fir’aun adalah julukan dari setiap raja yang berkuasa di mesir kuno. يَسُومُونَكُمْ سُوءَ الْعَذَابِ Yakni menyiksa kalian dengan siksaan yang sangat pedih. Berupa siksaan yang disebutkan dalam kalimat setelahnya. يُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ ۚ Yakni berupa siksaan (dengan membunuh anak laki-laki dan) membiarkan anak perempuan hidup untuk dimanfaatkan dan dipekerjakan. Hal ini mereka lakukan karena para penyihir memberi tahu Fir’aun bahwa akan dilahirkan seorang anak dari bani Israel yang akan membunuhnya. وَفِي ذَٰلِكُمْ Yakni segala keburukan yang telah disebutkan dan segala kebaikan yang Allah berikan setelahnya. بَلَاءٌ مِنْ رَبِّكُمْ Yakni adalah cobaan dari tuhan kalian sesuai dengan kewajiban yang kalian tunaikan yang berupa rasa syukur, ketaatan, dan iman kepada rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah ketika Kami menyelamatkan leluhur kalian (itu adalah anugerah bagi anak laki-laki (di zaman kalian)) dari pasukan Fir’aun. Itu adalah julukan bagi raja Mesir terdahulu sebelum dinasti Ptolemeus yang telah memberikan siksa yang pedih dengan menyembelih anak laki-laki kalian dan membiarkan hidup anak perempuan kalian untuk mengabdi dan bekerja. Peristiwa itu disebabkan ucapan sebagian pendeta Fir’aun bahwa kelahiran anak laki-laki Bani Isra’il akan menjadi penyebab kehancuranmu dan runtuhnya kerajaanmu di atas tangannya. Dalam peristiwa tersebut ada hal-hal buruk dan siksa yang diterima. Penyelamatan kami dari pasukan Fir’aun adalah ujian yang sangat berat bagi kalian agar dapat kembali kepada Tuhan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami menyelamatkan kalian} Kami membebaskan kalian {dari pengikut-pengikut Fir‘aun} pengikut-pengikut Fir’aun {yang menimpakan} yang membuat kalian merasakan {siksaan terburuk} siksaan yang paling kejam {Mereka menyembelih anak laki-laki kalian dan membiarkan hidup anak-anak perempuan kalian} mereka membiarkan anak-anak perempuan kalian hidup untuk melayani dan bekerja {Dalam hal itu terdapat cobaan} ujian {yang sangat berat dari Tuhan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-54. ini adalah awal dari penyebutan satu persatu nikmat-nikmatNya terhadap Bani Israil dengan suatu perincian. Allah berfirman, “dan ingatlah ketika kami menyelamatkan kamu dari fir’aun,” maksudnya dari fir’aun, pengikut-pengikutnya dan bala tentaranya, sedangkan sebelum itu “mereka menimpakan kepadamu,” maksudnya menyiksa Bani Israil dan menimpakan kepada mereka “siksaan yang seberat-beratnya,” yaitu siksaan paling keras dengan cara “mereka menyembelih anak-anak kamu yang laki-laki,” karena khawatir akan kebangkitan kalian, ”dan membiarkan hidup anak-anak kamu yang perempuan.” Maksudnya mereka tidak membunuhnya, maka kamu sekalian dalam kondisi antara terbunuh dan terhina dengan pekerjaan-pekerjaan yang berat, yaitu dibiarkan hidup karena suatu pemberian dan kesombongannya, dan inilah puncak dari keterhinaan. Akhirnya Allah memberi karunia kepada mereka dengan keselamatan yang sempurna dan menenggelamkan musuh-musuh mereka sedang mereka melihat hal itu dengan nyata, agar hati mereka tentram. “dan pada yang demikian itu, ” yaitu pemberian keselamatan, ”ada ujian-ujian,” yaitu perbuatan baik “yang besar dari tuhanmu, ” dimana hal yang seperti ini mengharuskan kalian untuk bersyukur dan mengerjakan perintah-perintahNya. Kemudian Allah menyebutkan karuniaNya yang lain kepada mereka dengan janjiNya kepada nabi Musa selama empat puluh hari, untuk menurunkan bagi mereka Taurat yang termasuk suatu karunia yang besar dan kemaslahatan yang menyeluruh. Tapi mereka tidak bersabar sebelum masa janji tersebut selesai, hingga akhirnya mereka menyembah anak hewan setelah itu, yaitu setelah kepergian nabi Musa, ”dan kamu adalah orang-orang yang zhalim, ” kalian mengetahui kezhaliman kalian, dimana hujjah telah tegak atas kalian, maka itu merupakan kejahatan dan dosa yang paling besar. lalu Allah memerintahkan kepada kalian untuk bertaubat lewat lisan nabiNya, Musa alaihissalam yaitu dengan cara sebagian kalian membunuh sebagian lainnya, hingga Allah memaafkan kalian oleh sebab itu, ”agar kamu bersyukur kepada Allah.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : An-Najaah : Selamat dari kebinasaan, seperti selamat dari tenggelam atau selamat dari adzab. ءَالِ فِرۡعَوۡنَ Aalu Fir’aun : Maknanya adalah pengikutnya Fir’aun, sedangkan Fir’aun adalah seorang raja pada zaman Nabi Musa ‘alaihissalam. يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ Yasuumunakum Suu’al ‘adzaab : Para pengikut Fir’aun menimpakan siksaan yang amat pedih kepada Bani Israil. وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ : Tidak membunuh bayi perempuan agar mereka besar dan menjadi pelayan, dan membunuh bayi laki-laki karena merasa takut ketika mereka dewasa kelak. بَلَآءٞ عَظِيمٞ Balaaun ‘adziim : Ujian yang amat besar sehingga tidak bisa dilalui. Makna ayat : Kelima ayat di atas mengandung 4 nikmat amat besar yang Allah karuniakan kepada Bani Israil. Nikmat – nikmat itu Allah perintahkan untuk mengingatnya agar mereka mensyukurinya dan beriman kepada rasulNya yaitu Muhammad ﷺ dan agama Islam. Pertama, Allah Ta’ala menyelamatkan mereka dari Fir’aun dan bala tentaranya, lepas dari hukum yang dzalim serta berbagai macam bentuk siksaan, di antaranya : membunuh bayi laki-laki dan menjadikan anak-anak perempuan sebagai pembantu dalam rumah seperti budak. Pelajaran dari ayat : • Menyebutkan kenikmatan membuat seseorang dapat mensyukurinya. Dan syukur adalah tujuan dari menyebutkan kenikmatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 49: Allah menyebutkan bani israil nikmat – nikmat yang allah berikan kepada mereka pada hari itu yang bahwasannya Allah menyelamatkan mereka dari siksa yang didapatkan firaun dan pengikutnya, dimana mereka merasakan seluruh macam – macam azab karena sebab dosa mereka yaitu menyembelih anak laki – laki lahir dan membiarkan setiap anak perempuan yang lahir untuk digunakan sebagai pelayan – pelayan mereka yaitu yang melayani didalam rumah – rumah keluarga firaun. Ketahuilah bahwasannya keadaan yang menimpa bapak – bapak kalian dari azab merupakan ujian yang besar bagi kalian dari Allah, untuk memisahkan antara orang yang beriman dengan orang yang kafir, dan untuk memisahkan kebaikan dan kejahatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini dan setelahnya menyebutkan nikmat-nikmat Allah yang diberikan kepada bani Israil. Fir'aun adalah gelar bagi raja-raja Mesir pada masa lalu. Menurut sejarah, Fir'aun pada masa Nabi Musa 'alaihis salam ialah Menepthan (1232-1224 SM) anak Ramses. Untuk dijadikan pelayan dan pekerja keras. Di antara ulama ada yang menafsirkan kata \"balaa\" dengan ihsan atau nikmat, sehingga maksud \"wa fii dzaalikum\" (pada yang demikian itu) kembalinya bukan kepada siksaan yang ditimpakan Fir'aun, tetapi kepada \"penyelamatan Allah kepada mereka dari cengkeraman Fir'aun\", yakni diselamatkannya kamu dari cengkeraman Fir'aun adalah nikmat yang besar dari Tuhanmu Oleh karena itu, diselamatkan-Nya mereka dari cengkeraman Fir'aun merupakan nikmat yang besar, yang mengharuskan disyukuri sepanjang masa oleh mereka dan oleh generasi setelah mereka. Di antara tanda bersyukur adalah dengan mengikuti seruan-Nya; beriman kepada kitab-Nya yaitu Al Qur'an dan beriman kepada Rasul-Nya, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 49",
    "description": "Di ayat-ayat yang lalu, Allah mengingatkan bani israil tentang anugerah yang mereka terima yang tidak pernah diberikan kepada umatumat yang lain, ayat berikut mengingatkan mereka tentang penyelamatan dari malapetaka yang akan menimpa. Dan ingatlah peristiwa ketika kami menyelamatkan kamu dari pengikut-pengikut fir'aun, penguasa mesir. Mereka menimpakan siksaan yang sangat berat kepadamu, yakni mereka menyembelih anak-anak laki-lakimu dan membiarkan hidup anakanak perempuanmu. Dan pada peristiwa yang demikian itu merupakan cobaan dan ujian yang sangat besar dari tuhanmupenyelamatan lain adalah terbelahnya laut merah (dahulu laut qulzum. Dan ingatlah ketika kami membelah laut merah untukmu, wahai bani israil yang ketika itu bersama nabi musa meninggalkan mesir menuju sinai. Ketika rombongan kamu sampai di tepi laut merah, Allah memberi perintah kepada nabi musa untuk memukulkan tongkatnya ke laut merah, sehingga laut itu pun terbelah. Dengan demikian, kamu, wahai bani israil, bersama nabi musa dapat melewati laut, sehingga kamu dapat kami selamatkan dari kejaran firaun dan tentaratentaranya. Akan tetapi, ketika firaun dan tentara-tentaranya masuk ke dalam laut yang terbelah itu, air laut kemudian bertemu kembali, dan kami tenggelamkan firaun dan pengikut-pengikut fir'aun, sehingga mereka semua mati tenggelam, sedang kamu, wahai bani israil, menyaksikan peristiwa itu dengan mata kepala kamu sendiri. Sementara itu, mayat firaun diselamatkan agar menjadi pelajaran bagi generasi sesudahnya (lihat: surah yunus/10: 92)."
  }
]