[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang memiliki sifat-sifat ini berada diatas cahaya dari Robb mereka dan Taufik dari Tuhan pencipta dan pemberi hidayah bagi mereka dan mereka itulah orang-orang yang beruntung yang berhasil menggapai apa yang mereka inginkan dan selamat dari keburukan yang mereka melarikan diri darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Orang-orang yang memiliki sifat-sifat tersebut kokoh dalam mengikuti jalan kebenaran. Merekalah orang-orang yang beruntung di dunia dan di akhirat, sebab mereka akan mendapatkan apa yang mereka harapkan dan selamat dari apa yang mereka takutkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ Yakni Mereka yang pada diri mereka ketakwaan, iman kepada hal-hal yang ghaib, dan ketaatan dalam menjalankan kewajiban-kewajiban maka mereka berada diatas cahaya dari Rabb mereka. وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ Yakni mereka adalah orang-orang yang berhasil mendapatkan apa yang mereka harapkan dari Allah Ta’ala dengan amalan-amalan dan iman mereka kepada Allah Ta’ala, kitab-kitabNya dan rasul-rasul-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnul Qoyyim berkata : \"Allah ta'ala jika menyebutkan dalam al-qur'an kata ( الفلاح ) yang berarti kemenangan, Dia senantiasa menghubungkannya dengan perbuatan orang-orang yang menang. Untuk memperjelas perkataan beliau perhatikan awal surah al-Baqarah; sesungguhnya Allah telah menyebutkan sebab kemenangan orang-orang yang bertaqwa, yaitu keimanan mereka kepada yang ghaib, mereka senantiasa mendirikan shalat, dan mengeluarkan harta mereka dijalan Allah dari apa yang telah Allah rezekikan kepada mereka, dan sifat-sifat mereka yang lainnya, dan semua itu adalah merupakan amalan-amalan yang mesti dilakukan oleh orang-orang yang menang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Semua orang yang digambarkan dengan ciri-ciri tersebut adalah orang-orang yang bertakwa, yaitu orang-orang yang mengimani sesuatu yang ghaib dan melaksanakan kewajiban. Merekalah orang-orang yang mendapatkan petunjuk dan bimbingan, orang-orang yang mendapatkan kebahagiaan dunia-akhirat dan selamat dari neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Merekalah yang mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Mereka itulah, ” yaitu yang bersifat dengan sifat-sifat terpuji tersebut “yang tetap mendapat petunjuk dari tuhan mereka, ” yakni yang tetap di atas petunjuk yang besar; karena pemakaian kata yang tidak terbatas (nakirah) adalah untuk ungkapan mengagungkan. Dan hidayah apalagi yang lebih agung dari sifat-sifat yang telah disebutkan yang mengandung keyakinan yang benar dan perbuatan-perbuatan yang lurus? Pada hakikatnya hidayah itu hanya seperti hidayah yang ada pada mereka tersebut, sedangkan apa-apa yang bertentangan dengan itu adalah kesesatan. Dan dipakai kata (di atas) dalam posisi kalimat disini menunjukkan pada ketinggian, adapun dalam posisi kata kesesatan memakai kata (di dalam). Hal itu karena ahli hidayah adalah tinggi dengan hidayah tersebut adapun ahli kesesatan yang tenggelam didalamnya adalah terhina. Kemudian Allah berfirman, “Dan merekalah orang-orang yang beruntung”. Keberuntungan adalah memperoleh hal yang diinginkan dan selamat dari hal yang dikhawatirkan. Pembatasan keberuntungan hanya pada mereka, kareena tidak ada jalan menuju kepada keberuntungan kecuali dengan menempuh jalan mereka tadi, dan jalan-jalan selain jalan tersebut, maka itu semua adalah jalan kesengsaraan, kehancuran, dan kerugian yang akan menjerumuskan penempuhnya kepada kebinasaan. Oleh karena itu, ketika Allah menyebutkan sifat-sifat kaum Mukminin yang hakiki, dia menyebutkan pula sifat-sifat kaum kafir yang menampakkan kekufuran mereka yang durhaka kepada Rosul"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡ Uulaaika ‘ala hudan min robbihim maknanya isyarat kepada golongan yang memiliki lima sifat yang disebutkan sebelumnya dan pemberitaan bahwasanya mereka tetap dalam keistiqomahan dengan petunjuk dari Allah berupa keimanan dan amalan sholih, di atas jalannya Allah yang mengantarkan kepada keberuntungan. وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ Wa ulaaika humul muflihuun artinya isyarat kepada golongan yang mendapatkan hidayah sempurna serta pemberitaan bahwa mereka adalah golongan yang beruntung, layak untuk mendapat kemenangan untuk masuk surga setelah selamat dari neraka. Makna ayat : Kemudian Allah mengabarkan bahwa mereka dalam petunjuk yang sempurna dari Rabbnya, dan mereka orang-orang yang beruntung di dunia dengan kesucian dan ketenangan, sedangkan di akhirat beruntung karena masuk ke dalam surga setelah sebelumnya selamat dari neraka. Pelajaran dari ayat : Seruan kepada kaum mukminin dan motivasi untuk mereka agar memiliki sifat golongan yang mendapat hidayah dan keberuntungan, agar menempuh jalan yang mereka lalui sehingga mendapatkan hidayah dan beruntung di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 5: Allah mengabarkan bawasanya mereka yang bertaqwa mereka disifati dengan sifat-sifat terpuji yang selalu di atas petunjuk dan cahaya dari Rabb mereka, dan mereka adalah orang-orang yang selamat dengan diberikan kenikmatan oleh Allah di akhirat. Dan keselamatan yang disebutkan pada ayat ini maknanya adalah (dikatakan) : Kemenangan dan keberhasilan yang di minta, dan selamat di akhirat dari adzab Allah, dan di katakan juga maknya adalah : tetapnya suatu keabadian dalam kenikmatan. Ayat ini adalah lima ayat awal-awal yang datang dalam penyebutan sifat mereka yang beriman dan bertaqwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang memiliki sifat-sifat di atas. Mereka berjalan di atas cahaya dari Tuhan mereka dan taufiq-Nya. Ialah orang-orang yang mendapat apa-apa yang dimohonkannya kepada Allah sesudah mengusahakannya dan selamat dari sesuatu yang mereka khawatirkan atau orang-orang yang akan memperoleh surga dan selamat dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 5",
    "description": "Mereka yang mempunyai ciri-ciri sebagaimana disebutkan itulah yang mendapat petunjuk dari tuhannya, berada pada posisi yang sangat mulia dan agung, sebab mereka menaati semua perintah dan menjauhi segala larangan-Nya, dan hanya mereka itulah orang-orang yang beruntung memperoleh apa yang mereka inginkan, yaitu kebahagiaan hidup di dunia dan keselamatan hidup di akhirat dengan dimasukkan ke dalam surga dan terbebas dari neraka. Sebagai kebalikan dari sikap orang mukmin terhadap Al-Qur'an, sesungguhnya orang-orang kafir yang menutupi hati dan akal pikiran mereka dari kebenaran karena enggan dan sombong, tidak akan memenuhi seruan Allah dan rasul-Nya. Sama saja bagi mereka, engkau beri peringatan, berupa ancaman siksa dari tuhanmu, atau tidak engkau beri peringatan, mereka tidak akan beriman sebab mereka lebih memilih jalan kebatilan."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Dalam ayat ini, Allah Subhanahu wa Ta'ala memberitahukan kepada kita balasan pahala untuk orang-orang yang bertaqwa yang sifat-sifatnya telah disebutkan dalam ayat-ayat sebelumnya dalam awal surat Al-Baqoroh, Mereka adalah yang mempunyai sifat-sifat berikut ini : - iman kepada yang gaib, - mendirikan sholat - memberi nafkah dari rizki yang diberikan Allah kepada mereka - iman kepada kitab yang diturunkan kepada Rosululloh Shallallahu 'alaihi wa Sallam dan kitab-kitab yang diturunkan kepada rasul-rasul sebelumnya - yakin akan adanya kehidupan ahirat sehingga mereka mempersiapkan diri berbekal untuk menghadapinya dengan mengerjakan amal-amal saleh dan meninggalkan hal-hal yang diharamkan. Balasan yang akan Allah berikan kepada mereka adalah diberikannya cahaya petunjuk dari Allah Subhanahu wa Ta'ala dan Allah Subhanahu wa Ta'ala akan menggolongkan mereka kedalam golongan orang-orang yang beruntung di dunia dan di akhirat. Muhammad Bin Ishaq mengatakan dari Muhammad Bin Abu Muhammad, dari Ikrimah atau Said Ibnu Jubair. Dari Ibnu Abbas bahwa makna dari ayat ini ialah mereka akan tetap memperoleh cahaya dari Tuhan mereka dan tetap istiqomah (berpegang teguh) kepada Alquran yang disampaikan kepada mereka dan mereka adalah orang-orang yangberuntung yang memperoleh apa yang mereka minta dan selamat dari kejahatan yang mereka minta terhindar darinya. Ibnu Jarir mengatakan bahwa makna dari ayat ini adalah “sesungguhnya mereka tetap memperoleh cahaya dari tuhannya, pembuktian, istiqomah dan bimbingan serta taufiq-Nya dalam menjalani kehidupan di dunia ini dan mereka adalah orang-orang yang sukses dan memperoleh apa yang mereka dambakan di sisi Allah melalui amal sholeh yang mereka kerjakan dan iman mereka kepada Allah, kitab-kitab-Nya, dan rosul-rosul-Nya; dambaan tersebut berupa keberuntungan memperoleh pahala, kekekalan di surga dan selamat dari api neraka dan siksaan-siksaan yang ada di dalamnya”. Telah dinukil sebuah riwayat dari Mujahid, Abul Aliyah dan Ar-Rabi’ ibnu Anas, Qotadah dan Ibnu hatim mengatakan bahwa telah menceritakan kepada kami ayahku, telah menceritakan kepada kami Yahya ibnu Usman ibnu Sholeh Al-Misri, telah menceritakan kepada kami ayahku, telah menceritakan lepada kami Ibnu Luhai’ah, telah menceritakan kepada kami Abdulloh Ibnul Mughiroh dari Abul Hisyam yang nama aslinya adalah Sulaiman Ibnu Abdullah dari Abdullah Ibn Amr dari Nabi Shallallahu 'alaihi wa Sallam: عن النبي صلى الله عليه وسلم وقيل له : يا رسول الله ، إنا نقرأ من القرآن فنرجو ، ونقرأ من القرآن فنكاد أن نيأس ، أو كما قال . قال : فقال : أفلا أخبركم عن أهل الجنة وأهل النار ؟ . قالوا : بلى يا رسول الله . قال : ( الم ذلك الكتاب لا ريب فيه ) إلى قوله تعالى :( المفلحون ) هؤلاء أهل الجنة . قالوا : إنا نرجو أن نكون هؤلاء . ثم قال : ( إن الذين كفروا سواء عليهم ) إلى قوله : ( عظيم ) هؤلاء أهل النار . قالوا : لسنا هم يا رسول الله . قال : أجل . Pernah dikatakan kepad Rosululloh Shallallahu 'alaihi wa Sallam, “wahai Rosululloh, sesungguhnya kami tetap membaca alquran. Lalu kami berdo’a, dan kami tetap membaca Alquran hingga hamper saja kami putus asa”. Maka Nabi Shallallahu 'alaihi wa Sallam bersabda “maukah kalian aku beritahukan penduduk surga dan penduduk neraka?” Mereka menjawab, “tentu saja kami mau, wahai Rosululloh.” Lalu Nabi Shallallahu 'alaihi wa Sallam membacakan firman-Nya : الم ذلك الكتاب لا ريب فيه …….إلى قوله تعالى :…… المفلحون “alif lam mim. Kitab (alquran) ini tidak ada keraguan padanya; petunjuk bagi mereka yang bertaqwa.” Sampai dengan firman-Nya, “orang-orang yang beruntung” (QS. Al-Baqoroh :1-5) Kemudian Nabi Shallallahu 'alaihi wa Sallam bersabda, “merekalah penduduk surga”. Para sahabat berkata “sesungguhnya kami mengharap semoga kami termasuk dari mereka”. Lalu Nabi Shallallahu 'alaihi wa Sallam membacakan firman-Nya : إن الذين كفروا سواء عليهم …. إلى قوله : عظيم “Sesungguhnya orang-orang kafir, sama saja bagi mereka,” sampai firman-Nya “Siksaan yang amat berat” (QS. Al-Baqoroh :7-8) Kemudian Nabi Shallallahu 'alaihi wa Sallam bersabda, “mereka adalah penduduk neraka”. Kemudia para sahabat berkata, “wahai Rosululloh, tentunya kami bukan termasuk mereka.” Beliau menjawab, “Ya.”"
  }
]