[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat-nikmat kami yang tercurah pada kalian saat kami memisahkan lautan demi kalian dan kami menjadikan disana jalan-jalan yang kering kemudian kalian menyeberanginya dan kami selamatkan kalian dari Firaun dan bala tentaranya dan dari kebinasaan di dalam air. Maka ketika Firaun dan bala tentaranya mulai memasuki jalan-jalan kalian itu, maka kami pun membinasakan mereka di dalam air laut itu di hadapan mata kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan ingatlah di antara nikmat Kami kepada kalian yaitu Kami membelah lautan dan menjadikannya sebagai jalan yang kering sehingga kalian bisa melintasinya, kemudian Allah menyelamatkan kalian dan menenggelamkan musuh kalian, Fir'aun dan para pengikutnya di depan mata kalian, dan kalian menyaksikan pemandangan mereka itu secara langsung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Dan ingatlah ketika Kami belah bagi kalian Laut Merah bagian utara sehingga menjadi jalanan yang kering agar kalian dapat melintasinya, sehingga kalian dapat selamat dari pembantaian. Dan ingatlah pula ketika Kami tenggelamkan Fir’aun dan pengikutnya, dan ketika itu kalian melihat sendiri kejadian itu. Syeikh as-Syinqithy mengatakan: “Allah tidak menjelaskan dalam ayat ini bagaimana mereka tenggelam, namun Allah menjelaskannya dalam ayat-ayat yang lain, seperti dalam firman-Nya: فَأَتْبَعُوهُم مُّشْرِقِينَ. فَلَمَّا تَرَاءى الْجَمْعَانِ قَالَ أَصْحَابُ مُوسَى إِنَّا لَمُدْرَكُونَ. قَالَ كَلاَّ إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ. فَأَوْحَيْنَا إِلَى مُوسَى أَنِ اضْرِب بِّعَصَاكَ الْبَحْرَ فَانفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيمِ. وَأَزْلَفْنَا ثَمَّ الآخَرِينَ. Maka Fir’aun dan bala tentaranya dapat menyusuli mereka di waktu matahari terbit. Maka setelah kedua golongan itu saling melihat, berkatalah pengikut-pengikut Musa: “Sesungguhnya kita benar-benar akan tersusul”. Musa menjawab: “Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku”. Lalu Kami wahyukan kepada Musa: “Pukullah lautan itu dengan tongkatmu”. Maka terbelahlah lautan itu dan tiap-tiap belahan adalah seperti gunung yang besar. Dan di sanalah Kami dekatkan golongan yang lain. (as-Syu’ara: 60-64)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ Yakni kami belah untuk kalian sehingga menjadi kering agar kalian bisa berjalan diatas tanahnya. فَأَنْجَيْنَاكُمْ Yakni kami selamatkan dari tenggelam وَأَغْرَقْنَا آلَ فِرْعَوْنَ Yakni Fir’aun dan para pengikutnya. وَأَنْتُمْ تَنْظُرُونَ Yakni melihat bagaimana kalian selamat sedangkan fir’aun dan para pengikutnya tenggelam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah juga nikmat kami kepada kalian, ketika kami membelah laut merah untuk kalian sehingga mengering dan kalian dapat berjalan di atas tanahnya, kemudian kami tolong kalian dari lautan itu, lalu kami tenggelamkan Fir’aun berserta kaumnya dan kalian melihat mereka tenggelam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami membelah untuk kalian} Kami membelah untuk kalian {lautan lalu Kami menyelamatkan kalian dan menenggelamkan Fir’aun pengikut-pengikut Fir‘aun, dan kalian menyaksikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-54. ini adalah awal dari penyebutan satu persatu nikmat-nikmatNya terhadap Bani Israil dengan suatu perincian. Allah berfirman, “dan ingatlah ketika kami menyelamatkan kamu dari fir’aun,” maksudnya dari fir’aun, pengikut-pengikutnya dan bala tentaranya, sedangkan sebelum itu “mereka menimpakan kepadamu,” maksudnya menyiksa Bani Israil dan menimpakan kepada mereka “siksaan yang seberat-beratnya,” yaitu siksaan paling keras dengan cara “mereka menyembelih anak-anak kamu yang laki-laki,” karena khawatir akan kebangkitan kalian, ”dan membiarkan hidup anak-anak kamu yang perempuan.” Maksudnya mereka tidak membunuhnya, maka kamu sekalian dalam kondisi antara terbunuh dan terhina dengan pekerjaan-pekerjaan yang berat, yaitu dibiarkan hidup karena suatu pemberian dan kesombongannya, dan inilah puncak dari keterhinaan. Akhirnya Allah memberi karunia kepada mereka dengan keselamatan yang sempurna dan menenggelamkan musuh-musuh mereka sedang mereka melihat hal itu dengan nyata, agar hati mereka tentram. “dan pada yang demikian itu, ” yaitu pemberian keselamatan, ”ada ujian-ujian,” yaitu perbuatan baik “yang besar dari tuhanmu, ” dimana hal yang seperti ini mengharuskan kalian untuk bersyukur dan mengerjakan perintah-perintahNya. Kemudian Allah menyebutkan karuniaNya yang lain kepada mereka dengan janjiNya kepada nabi Musa selama empat puluh hari, untuk menurunkan bagi mereka Taurat yang termasuk suatu karunia yang besar dan kemaslahatan yang menyeluruh. Tapi mereka tidak bersabar sebelum masa janji tersebut selesai, hingga akhirnya mereka menyembah anak hewan setelah itu, yaitu setelah kepergian nabi Musa, ”dan kamu adalah orang-orang yang zhalim, ” kalian mengetahui kezhaliman kalian, dimana hujjah telah tegak atas kalian, maka itu merupakan kejahatan dan dosa yang paling besar. lalu Allah memerintahkan kepada kalian untuk bertaubat lewat lisan nabiNya, Musa alaihissalam yaitu dengan cara sebagian kalian membunuh sebagian lainnya, hingga Allah memaafkan kalian oleh sebab itu, ”agar kamu bersyukur kepada Allah.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فَرَقۡنَا بِكُمُ ٱلۡبَحۡرَ Faroqna bikumul bahr : Allah jadikan lautan itu terbelah menjadi dua bagian, dan bagian tengahnya berupa daratan kering yang dapat kalian lalui wahai pengikut Musa sehingga kalian akan selamat. Laut yang dimaksud dalam ayat adalah laut Qalzum (Laut merah). Makna ayat : Kedua, Terbelahnya lautan menjadi dua bagian sehingga mereka selamat, dan melihat musuh mereka tenggelam di depan mata. Pelajaran dari ayat : • Ketika Allah Ta’ala menguji hamba-hambaNya, ada hikmah yang tinggi maka tidak boleh protes terhadap ujian yang Allah berikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 50: Allah menyebutkan mereka dengan nikmat – nikmat kepada mereka pada hari itu yang bahwasannya mereka lolos dari firaun dan tentaranya dengan Allah jadikan lautan membeku sampai – sampai menjadi jalan yang kering; Allah selamatkan mereka dan Allah tenggelam kan firaun dan tentaranya dihadapan mata – mata mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Waktu Nabi Musa alaihis salam membawa Bani Israil ke luar dari negeri Mesir menuju Palestina dan dikejar oleh Fir'aun, mereka harus melalui laut merah sebelah Utara. Maka Allah memerintahkan kepada Musa memukul laut itu dengan tongkatnya. perintah itu dilaksanakan oleh Musa hingga terbelahlah laut itu dan terbentanglah jalan raya di tengah-tengahnya dan Musa melalui jalan itu sampai selamatlah ia dan kaumnya ke seberang. Sedangkan Fir'aun dan pengikut-pengikutnya melalui jalan itu pula, tetapi di waktu mereka berada di tengah-tengah laut, kembalilah laut itu sebagaimana biasa, lalu tenggelamlah mereka, sedangkan Bani Israil menyaksikan peristiwa tenggelamnya Fir'aun, sehingga hati mereka lega. Ini semua merupakan nikmat Allah kepada mereka yang patut mereka syukuri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 50",
    "description": "Penyelamatan lain adalah terbelahnya laut merah (dahulu laut qulzum. Dan ingatlah ketika kami membelah laut merah untukmu, wahai bani israil yang ketika itu bersama nabi musa meninggalkan mesir menuju sinai. Ketika rombongan kamu sampai di tepi laut merah, Allah memberi perintah kepada nabi musa untuk memukulkan tongkatnya ke laut merah, sehingga laut itu pun terbelah. Dengan demikian, kamu, wahai bani israil, bersama nabi musa dapat melewati laut, sehingga kamu dapat kami selamatkan dari kejaran firaun dan tentaratentaranya. Akan tetapi, ketika firaun dan tentara-tentaranya masuk ke dalam laut yang terbelah itu, air laut kemudian bertemu kembali, dan kami tenggelamkan firaun dan pengikut-pengikut fir'aun, sehingga mereka semua mati tenggelam, sedang kamu, wahai bani israil, menyaksikan peristiwa itu dengan mata kepala kamu sendiri. Sementara itu, mayat firaun diselamatkan agar menjadi pelajaran bagi generasi sesudahnya (lihat: surah yunus/10: 92) setelah menerima nikmat dalam bentuk penyelamatan dari dua bencana pembunuhan dan tenggelam di laut merah, Allah kemudian menyuruh bani israil agar mengingat lagi peristiwa penurunan wahyu kepada nabi musa. Dan ingatlah, wahai bani israil, ketika kami menjanjikan kepada musa empat puluh malam, waktu yang dijanjikan Allah untuk menerima wahyu. Sayang kamu tidak sabar menunggunya. Kemudian kamu menjadikan patung anak sapi yang dibuat oleh samiri sebagai sesembahan setelah kepergian-Nya (musa). Dan dengan perbuatan menyembah patung anak sapi itu, kamu, wahai bani israil, menjadi orang yang zalim yang kezalimannya itu terhunjam di dalam jiwa."
  }
]