[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat-nikmat kami kepada kalian tatkala kami berjanji kepada Musa selama 40 malam untuk menurunkan Taurat sebagai Hidayah dan cahaya bagi kalian, akan tetapi kalian justru memanfaatkan kesempatan kepergiannya selama waktu yang singkat ini, dan kalian menjadikan patung anak sapi yang kalian buat sendiri dengan tangan-tangan kalian sebagai sesembahan bagi kalian selain Allah (ini merupakan bentuk kekafiran yang paling buruk terhadap Allah), dan kalian telah berbuat kezaliman dengan menjadikan anak sapi sebagai Tuhan yang kalian sembah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan ingatlah salah satu dari nikmat itu ialah janji Kami dengan Musa selama 40 malam untuk menyempurnakan proses turunnya Taurat sebagai cahaya dan petunjuk. Tetapi yang terjadi selama periode itu justru kalian menyembah patung anak sapi. Dan kalian telah melakukan kezaliman dengan melakukan perbuatan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Dan ingatlah ketika Allah menjanjikan kepada Musa ketika ia di bukit Thur -terletak di padang pasir Sina, utara Laut Merah- untuk diberi kitab Taurat setelah 40 malam. Namun ketika ia kembali dari bukit Thur, ia mendapati kalian telah menyembah patung anak sapi dan kalian menzalimi diri kalian sendiri dengan kesyirikan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَاعَدْنَا Yakni janji dari Allah dan kesepakatan dari Musa أَرْبَعِينَ لَيْلَةً Yakni Allah membuat perjanjian dengan Musa agar ia datang ke bukit Thur setelah 40 hari untuk berbicara dengannya dan memberi wahyu kepadanya. ثُمَّ اتَّخَذْتُمُ الْعِجْلَ Yakni kalian menjadikan anak lembu sebagai sesembahan dan kalian sembah ia setelah Musa pergi ke bukit Thur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah janji kami kepada Musa, yaitu janji dan dukungan Allah kepada Musa ketika mendatangi gunung Thur setelah 40 malam agar Allah berfirman dan memberikan wahyu kepadanya serta memberinya Taurat agar kalian dapat belajar darinya. Kemudian kalian wahai Bani Israil menjadikan anak sapi yang dihias oleh Musa Samiri sebagai Tuhan, lalu kalian menyembahnya ketika Musa tidak ada dan pergi ke gunung Thur untuk menerima Taurat. Kalian menzalimi diri kalian sendiri dengan menyembah anak sapi selain menyembah Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami menjanjikan kepada Musa dalam empat puluh malam Kemudian kalian menjadikan (patung) anak sapi} kalian menjadikan patung anak sapi sebagai sesuatu yang disembah {setelahnya} setelah kepergian Musa menuju miqat Tuhannya {dan kalian menjadi orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-54. ini adalah awal dari penyebutan satu persatu nikmat-nikmatNya terhadap Bani Israil dengan suatu perincian. Allah berfirman, “dan ingatlah ketika kami menyelamatkan kamu dari fir’aun,” maksudnya dari fir’aun, pengikut-pengikutnya dan bala tentaranya, sedangkan sebelum itu “mereka menimpakan kepadamu,” maksudnya menyiksa Bani Israil dan menimpakan kepada mereka “siksaan yang seberat-beratnya,” yaitu siksaan paling keras dengan cara “mereka menyembelih anak-anak kamu yang laki-laki,” karena khawatir akan kebangkitan kalian, ”dan membiarkan hidup anak-anak kamu yang perempuan.” Maksudnya mereka tidak membunuhnya, maka kamu sekalian dalam kondisi antara terbunuh dan terhina dengan pekerjaan-pekerjaan yang berat, yaitu dibiarkan hidup karena suatu pemberian dan kesombongannya, dan inilah puncak dari keterhinaan. Akhirnya Allah memberi karunia kepada mereka dengan keselamatan yang sempurna dan menenggelamkan musuh-musuh mereka sedang mereka melihat hal itu dengan nyata, agar hati mereka tentram. “dan pada yang demikian itu, ” yaitu pemberian keselamatan, ”ada ujian-ujian,” yaitu perbuatan baik “yang besar dari tuhanmu, ” dimana hal yang seperti ini mengharuskan kalian untuk bersyukur dan mengerjakan perintah-perintahNya. Kemudian Allah menyebutkan karuniaNya yang lain kepada mereka dengan janjiNya kepada nabi Musa selama empat puluh hari, untuk menurunkan bagi mereka Taurat yang termasuk suatu karunia yang besar dan kemaslahatan yang menyeluruh. Tapi mereka tidak bersabar sebelum masa janji tersebut selesai, hingga akhirnya mereka menyembah anak hewan setelah itu, yaitu setelah kepergian nabi Musa, ”dan kamu adalah orang-orang yang zhalim, ” kalian mengetahui kezhaliman kalian, dimana hujjah telah tegak atas kalian, maka itu merupakan kejahatan dan dosa yang paling besar. lalu Allah memerintahkan kepada kalian untuk bertaubat lewat lisan nabiNya, Musa alaihissalam yaitu dengan cara sebagian kalian membunuh sebagian lainnya, hingga Allah memaafkan kalian oleh sebab itu, ”agar kamu bersyukur kepada Allah.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ Ittakhodzuul ‘ijla : Anak sapi terbuat dari emas yang dibuat oleh As-Samiriy, yang mana Bani Israil diajak untuk menyembahnya dan banyak yang mengikuti ajakannya. Hal itu terjadi saat Musa tidak berada di antara mereka. Makna ayat : Ketiga, Ampunan yang Allah berikan karena kesalahan yang telah mereka perbuat dengan menjadikan patung anak sapi sebagai berhala dan menyembahnya. Kemudian pada ayat ketiga disebutkan mengenai janji Allah kepada Musa setelah bani Israil selamat selama empat puluh hari, yaitu bulan Dzulqo’dah dan 10 Dzulhijjah untuk memberikan Taurat, agar dapat digunakan sebagai landasan hukum oleh Bani Israil, maka ketika Musa pergi terjadilah kejadian dimana Samiri mengumpulkan seluruh perhiasan wanita Bani Israil dan membuat patung anak sapi, kemudian mengajak mereka untuk menyembahnya. Maka mereka menyembah patung anak sapi itu. Hal ini mengakibatkan turunnya adzab, akan tetapi Allah memaafkannya agar mereka bersyukur. Pelajaran dari ayat : • Kesyirikan adalah kedzaliman karena meletakkan ibadah bukan pada tempatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 51: Allah menyebutkan kenikmatan yang diberikan kepada mereka pada hari ketika Musa pergi untuk memenuhi janji yang allah telah tetapkan dan yang setelah Allah tenggelam firaun dan tentaranya dalam waktu 40 malam agar supaya dikirimkan taurat kepadanya yang padanya terdapat pentunjuk dan cahaya bagi mereka, akan tetapi mereka telah sakit dengan beribadah kepada selain allah setelah perginya Musa, dan sungguh setelah dzolim bagi diri mereka karena sebab kejahatan yang telah mereka perbuat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Suatu tenggang waktu yang dijanjikan Allah untuk menerima petunjuk (Taurat), tetapi umat Nabi Musa 'alaihis salam tidak sabar menunggunya, sehingga mereka menyembah patung anak sapi yang dibuat oleh Samiri. Anak sapi itu dibuat mereka dari emas untuk disembah. Karena menyembah selain Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 51",
    "description": "Setelah menerima nikmat dalam bentuk penyelamatan dari dua bencana pembunuhan dan tenggelam di laut merah, Allah kemudian menyuruh bani israil agar mengingat lagi peristiwa penurunan wahyu kepada nabi musa. Dan ingatlah, wahai bani israil, ketika kami menjanjikan kepada musa empat puluh malam, waktu yang dijanjikan Allah untuk menerima wahyu. Sayang kamu tidak sabar menunggunya. Kemudian kamu menjadikan patung anak sapi yang dibuat oleh samiri sebagai sesembahan setelah kepergian-Nya (musa). Dan dengan perbuatan menyembah patung anak sapi itu, kamu, wahai bani israil, menjadi orang yang zalim yang kezalimannya itu terhunjam di dalam jiwa. Walaupun kedurhakaan bani israil sudah berlipat-lipat, namun Allah memberikan maaf kepada mereka. Kemudian kami memaafkan kamu atas berbagai kedurhakaan dan ketidaksyukuran yang kamu lakukan setelah itu, agar kamu kembali ke jalan lurus dan bersyukur atas nikmat yang telah dicurahkan oleh Allah. Dengan demikian, semoga kamu dapat memperbaiki diri."
  }
]