[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah oleh kalian nikmat-nikmat Kami kepada kalian ketika kami memberi Musa kitab yang memisahkan antara kebenaran dan kebatilan yaitu Kitab Taurat, supaya kalian memperoleh petunjuk setelah berada dalam kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan ingatlah salah satu dari nikmat itu ialah Kami berikan Taurat kepada Musa -'alaihissalām- sebagai pembeda antara yang hak dan yang batil, dan sebagai pemisah antara jalan yang benar dan jalan yang sesat, supaya kamu dapat menjadikannya sebagai petunjuk untuk mencapai kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Dan ingatlah ketika Kami turunkan Taurat kepada Nabi kalian Musa, yang membedakan antara kebenaran dan kebatilan agar kalian dapat mendapat petunjuk dari cahaya dan hidayahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. الْكِتَابَ Yakni kitab taurat وَالْفُرْقَانَ Ada pendapat mengatakan (الفرقان) adalah dalil dan bukti berupa ayat-ayat yang diberikan oleh Allah kepada Musa seperti tongkat, tangan yang bercahaya, dan yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah ketika kami mendatangkan kepada Musa Taurat, yaitu kitab yang memisahkan antara benar-salah dan halal-haram supaya kalian mendapatkan petunjuk darinya dan dapat mengamalkan apa yang ada di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami memberi Musa kitab} Taurat {dan furqān} pembeda antara yang benar dan yang bathil, yang halal dan yang haram {agar kalian memperoleh petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-54. ini adalah awal dari penyebutan satu persatu nikmat-nikmatNya terhadap Bani Israil dengan suatu perincian. Allah berfirman, “dan ingatlah ketika kami menyelamatkan kamu dari fir’aun,” maksudnya dari fir’aun, pengikut-pengikutnya dan bala tentaranya, sedangkan sebelum itu “mereka menimpakan kepadamu,” maksudnya menyiksa Bani Israil dan menimpakan kepada mereka “siksaan yang seberat-beratnya,” yaitu siksaan paling keras dengan cara “mereka menyembelih anak-anak kamu yang laki-laki,” karena khawatir akan kebangkitan kalian, ”dan membiarkan hidup anak-anak kamu yang perempuan.” Maksudnya mereka tidak membunuhnya, maka kamu sekalian dalam kondisi antara terbunuh dan terhina dengan pekerjaan-pekerjaan yang berat, yaitu dibiarkan hidup karena suatu pemberian dan kesombongannya, dan inilah puncak dari keterhinaan. Akhirnya Allah memberi karunia kepada mereka dengan keselamatan yang sempurna dan menenggelamkan musuh-musuh mereka sedang mereka melihat hal itu dengan nyata, agar hati mereka tentram. “dan pada yang demikian itu, ” yaitu pemberian keselamatan, ”ada ujian-ujian,” yaitu perbuatan baik “yang besar dari tuhanmu, ” dimana hal yang seperti ini mengharuskan kalian untuk bersyukur dan mengerjakan perintah-perintahNya. Kemudian Allah menyebutkan karuniaNya yang lain kepada mereka dengan janjiNya kepada nabi Musa selama empat puluh hari, untuk menurunkan bagi mereka Taurat yang termasuk suatu karunia yang besar dan kemaslahatan yang menyeluruh. Tapi mereka tidak bersabar sebelum masa janji tersebut selesai, hingga akhirnya mereka menyembah anak hewan setelah itu, yaitu setelah kepergian nabi Musa, ”dan kamu adalah orang-orang yang zhalim, ” kalian mengetahui kezhaliman kalian, dimana hujjah telah tegak atas kalian, maka itu merupakan kejahatan dan dosa yang paling besar. lalu Allah memerintahkan kepada kalian untuk bertaubat lewat lisan nabiNya, Musa alaihissalam yaitu dengan cara sebagian kalian membunuh sebagian lainnya, hingga Allah memaafkan kalian oleh sebab itu, ”agar kamu bersyukur kepada Allah.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱلۡكِتَٰبَ وَٱلۡفُرۡقَانَ Al-Kitabu wal Furqon : Al-Kitab yang dimaksud adalah Taurat, dan Al-Furqon maksudnya adalah mukjizat-mukjizat yang diberikan oleh Allah untuk memisahkan antara kebenaran dan kebathilan. تَهۡتَدُونَ Tahtadun : Kalian (Bani Israil) mendapat petunjuk untuk mengetahui kebenaran dalam setiap urusan agama maupun dunia. Makna ayat : Keempat, Allah telah memuliakan nabi yang diutus kepada Bani Israil yaitu Musa ‘alaihissalam dengan menurunkan taurat, dimana berisi petunjuk, cahaya, dan mukjizat yang melawan kebathilan Fir’aun dan membenarkan dakwah yang dibawa oleh Musa ‘alaihissalam. Nikmat-nikmat yang sudah disebutkan sebelumnya adalah kandungan ayat yang kelima, mengetahui berbagai nikmat itu maka dapat memahami secara global kecuali pada ayat pertama yang berbunyi,”Dan pada demikian itu merupakan cobaan yang besar dari Tuhanmu” merupakan berita bahwa adzab yang diperoleh Bani Israil dari Fir’aun merupakan ujian dan cobaan dari Allah Ta’ala kepada mereka. Pelajaran dari ayat : • Hikmah dari pengutusan rasul serta diturunkannya kitab adalah sebagai petunjuk bagi manusia untuk mengenal TuhanNya dan tata cara mendekatkan diri kepadaNya untuk beribadah dan menyempurnakan serta membuat bahagia di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 53: Kemudian Allah menyebutkan kenikmatan yang telah Allah berikan pada mereka pada hari itu, yang bahwasannya Allah memuliakan Musa dengan taurat yang memisahkan antara kebenaran dengan kebatilan agar supaya mereka mendapatkan petunjuk dari kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keterangan yang membedakan antara yang benar dan yang salah"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 53",
    "description": "Nikmat berikut yang diberikan kepada bani israil adalah kitab taurat dan al-furqa'n. Dan ingatlah lagi, ketika kami memberikan kepada musa kitab kumpulan dari wahyu dan berfungsi sebagai furqa'n, pembeda antara yang hak dengan yang batil, agar kamu memperoleh petunjuk untuk memperoleh kebahagiaan hidup dunia dan akhirat. Bila peringatan pada ayat-ayat yang lalu langsung disampaikan oleh Allah kepada bani israil, maka sekarang peringatan itu disampaikan melalui nabi musa. Perubahan siapa yang menyampaikan peringatan ini memberikan sinyal bahwa kedurhakaan bani israil itu sudah sangat keterlaluan sehingga seolah-olah Allah tidak mau lagi memedulikan mereka dan sekarang diberikan wewenang itu kepada nabi musa. Dan ingatlah ketika nabi musa berkata kepada kaumnya, wahai kaumku! kamu benar-benar telah melakukan kedurhakaan kepada Allah. Itu berarti kamu telah menzalimi dirimu sendiri. Perbuatan kamu dengan menjadikan patung anak sapi se-bagai sesembahan kamu adalah perbuatan yang telah mensyirikkan Allah yang membuat kamu layak diberi hukuman. Oleh karena itu, bertobatlah dengan memohon ampun kepada penciptamu, Allah yang maha pencipta, dan bunuhlah dirimu. Sejak dulu sampai sekarang terdapat tradisi bangsa-bangsa yang rela mengorbankan nyawa dengan membunuh diri sendiri demi untuk tujuan yang lebih luhur, seperti yang terdapat dalam tradisi masyarakat jepang. Membunuh diri dengan tujuan luhur itu adalah lebih baik bagimu, wahai bani israil, di sisi Allah penciptamu dengan sangat sempurna. Dengan demikian, dia Allah akan menerima tobatmu dan permohonan ampunmu. Sungguh, yakinilah bahwa dialah zat yang maha penerima tobat dosa hamba-hamba-Nya, lagi maha penyayang."
  }
]