[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat-nikmat Kami kepada kalian, ketika Musa berkata kepada kaumnya : “sesungguhnya kalian telah berbuat zalim terhadap diri kalian dengan menjadikan patung anak sapi sebagai sesembahan, maka bertaubatlah kepada pencipta kalian (Allah), dengan cara sebagian kalian membunuh sebagian lainnya, dan ini lebih baik bagi kalian disisi pencipta kalian (Allah) daripada kekal selamanya di neraka.Lalu kalian melaksanakannya. Maka Allah akan memberi karunia bagi kalian dengan menerima Taubat kalian. Sesungguhnya Allah ta'ala Maha menerima Taubat orang-orang bertaubat kepadanya dari para hambanya lagi maha penyayang terhadap mereka"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan ingatlah salah satu dari nikmat itu ialah Allah membimbing kamu untuk bertaubat dari penyembahan terhadap anak sapi. Ketika Musa -'alaihissalām- berkata kepadamu, “Sesungguhnya kalian telah menganiaya diri kalian sendiri dengan menjadikan anak sapi itu sebagai tuhan yang kalian sembah. Maka bertaubatlah kalian, dan kembalilah kepada Pencipta kalian. Yaitu dengan cara saling bunuh di antara kalian. Dan taubat dengan cara itu lebih baik bagi kalian dari pada mempertahankan kekafiran yang akan membuat kalian kekal di neraka.” Kemudian kalian melakukan (taubat) itu dengan bimbingan dan pertolongan Allah, dan Dia pun menerima taubat kalian, karena Dia amat sering menerima taubat dan Maha Penyayang terhadap hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Dan ingatlah ketika Musa berkata kepada kaumnya, Bani Israil: “Sungguh kalian telah menzalimi diri kalian dengan menyembah patung anak sapi, maka pertaubatlah kalian kepada Pencipta kalian dengan saling membunuh diri kalian sendiri. Ini lebih baik bagi kalian daripada azab neraka di akhirat, maka taatilah perintah ini agar Allah menerima taubat kalian. Sungguh Dia Maha Penerima Taubat hamba-hamba-Nya dan Maha Pengasih bagi mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. يَا قَوْمِ Yakni panggilan yang ditujukan untuk para penyembah anak lembu baik itu mereka yang laki-laki ataupun yang perempuan. فَتُوبُوا إِلَىٰ بَارِئِكُمْ Yakni bertaubatlah kepada Tuhan yang telah menciptakan kalian karena kalian telah mempersekutukannya dalam ibadah. فَاقْتُلُوا أَنْفُسَكُمْ Diriwayatkan dari Ali bin Abi thalib bahwa ia berkata: bani Israel berkata kepada Musa: bagaimana kami bertaubat. Musa menjawab: kalian harus saling membunuh diri kalian. Maka merekapun mengambil pisau dan mulai membunuh saudara, ayah, dan anaknya tanpa mempedulikan siapa yang mereka bunuh, sehingga jumlah yang terbunuh diantara mereka 70.000 orang. Kemudian Allah mewahyukan kepada Musa: perintahkanlah mereka agar berhenti karena yang terbunuh telah diampuni dan yang masih hidup telah diterima taubatnya. فَتَابَ عَلَيْكُمْ Yakni setelah mereka saling membunuh, Allah menerima taubat orang-orang yang tersisa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Dan ingatlah ketika Musa berkata kepada kaumnya yang menyembah anak sapi: “Sesungguhnya kalian telah menzalimi diri kalian dengan menyembah anak sapi, maka bertaubatlah kepada Tuhan dengan membunuh satu sama lain. Hal itu lebih baik bagi kalian di sisi Tuhan agar kalian selamat dari siksa akhirat. Kemudian mereka saling membunuh sampai ada salah satu dari mereka yang membunuh 7000 orang, kemudian Allah menghentikan pembunuhan itu dengan memberikan perintah kepada Musa. Allah mengampuni orang yang dibunuh dan menerima taubat orang yang masih hidup. Sesungguhnya Allah Maha Menerima taubat dan Maha Pengasih kepada hamba-hambaNya yang mau bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika Musa berkata kepada kaumnya, “Wahai kaumku, sesungguhnya kalian telah menzalimi diri kalian sendiri dengan menjadikan patung anak sapi (sebagai sesembahan). Maka bertaubatlah kepada Penciptamu} Pencipta kalian {dan bunuhlah diri kalian} maka sebaiknya kalian membunuh satu sama lain {Itu lebih baik bagi kalian di sisi Pencipta kalian. maka Dia akan menerima taubat kalian. Sesungguhnya Dialah Yang Maha Penerima Taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-54. ini adalah awal dari penyebutan satu persatu nikmat-nikmatNya terhadap Bani Israil dengan suatu perincian. Allah berfirman, “dan ingatlah ketika kami menyelamatkan kamu dari fir’aun,” maksudnya dari fir’aun, pengikut-pengikutnya dan bala tentaranya, sedangkan sebelum itu “mereka menimpakan kepadamu,” maksudnya menyiksa Bani Israil dan menimpakan kepada mereka “siksaan yang seberat-beratnya,” yaitu siksaan paling keras dengan cara “mereka menyembelih anak-anak kamu yang laki-laki,” karena khawatir akan kebangkitan kalian, ”dan membiarkan hidup anak-anak kamu yang perempuan.” Maksudnya mereka tidak membunuhnya, maka kamu sekalian dalam kondisi antara terbunuh dan terhina dengan pekerjaan-pekerjaan yang berat, yaitu dibiarkan hidup karena suatu pemberian dan kesombongannya, dan inilah puncak dari keterhinaan. Akhirnya Allah memberi karunia kepada mereka dengan keselamatan yang sempurna dan menenggelamkan musuh-musuh mereka sedang mereka melihat hal itu dengan nyata, agar hati mereka tentram. “dan pada yang demikian itu, ” yaitu pemberian keselamatan, ”ada ujian-ujian,” yaitu perbuatan baik “yang besar dari tuhanmu, ” dimana hal yang seperti ini mengharuskan kalian untuk bersyukur dan mengerjakan perintah-perintahNya. Kemudian Allah menyebutkan karuniaNya yang lain kepada mereka dengan janjiNya kepada nabi Musa selama empat puluh hari, untuk menurunkan bagi mereka Taurat yang termasuk suatu karunia yang besar dan kemaslahatan yang menyeluruh. Tapi mereka tidak bersabar sebelum masa janji tersebut selesai, hingga akhirnya mereka menyembah anak hewan setelah itu, yaitu setelah kepergian nabi Musa, ”dan kamu adalah orang-orang yang zhalim, ” kalian mengetahui kezhaliman kalian, dimana hujjah telah tegak atas kalian, maka itu merupakan kejahatan dan dosa yang paling besar. lalu Allah memerintahkan kepada kalian untuk bertaubat lewat lisan nabiNya, Musa alaihissalam yaitu dengan cara sebagian kalian membunuh sebagian lainnya, hingga Allah memaafkan kalian oleh sebab itu, ”agar kamu bersyukur kepada Allah.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ظَلَمۡتُمۡ أَنفُسَكُم Dzolaman nafsa : Mendzalimi diri sendiri yaitu mengotorinya dengan perbuatan dosa. بِٱتِّخَاذِكُمُ ٱلۡعِجۡلَ Bittikhoodzikumul ‘ijla : Kalian menjadikan patung anak sapi yang dibuat oleh Samiriy dari perhiasan-perhiasan wanita Bani Israil sebagai berhala yang kalian sembah. البَارِئِ Al-Bari : maknanya adalah Allah sang Maha pencipta ‘Azza wa Jalla فَٱقۡتُلُوٓاْ أَنفُسَكُمۡ Faqtuluu Anfusakum : Allah memerintahkan kepada orang yang tidak menyembah patung anak sapi agar membunuh siapa saja yang menyembahnya. Hal tersebut sebagai syarat taubat mereka. Akhirnya mereka melakukan dan Allah memberikan taubatnya dengan menerima taubat mereka. Makna ayat : Pada ayat yang sebelumnya Allah menyebutkan nikmat-nikmat yang diperoleh pendahulu mereka agar mensyukurinya dengan beriman kepada rasulNya. Kemudian di sini Allah menyebutkan beberapa dosa yang dilakukan pendahulu bani Israil agar dijadikan bahan renungan sehingga menjadi beriman. Allah menyebutkan dengan kejadian ketika Bani Israil membuat patung anak sapi sebagai berhala yang mereka sembah. Kejadian itu terjadi setelah Allah menyelamatkan mereka dari kejaran Fir’aun, saat Musa ‘alaihissalam pergi menemui Rabbnya dan menjadikan Harun sebagai wakilnya. Maka Samiriy membuat patung anak sapi dari emas, lantas mengatakan kepada Bani Israil “ini adalah Tuhan kalian dan Tuhannya Musa, maka sembahlah.” Banyak yang mengikuti seruan Samiriy sehingga mereka murtad dengan perbuatannya itu. Maka Allah menjadikan syarat diterimanya taubat dari kemurtadan agar orang-orang yang tidak menyembah anak sapi membunuh orang-orang yang menyembahnya. Terbunuhlah 70.000 orang sebagai bentuk pertaubatan mereka kepada Allah Ta’ala, dan Allah menerima taubatnya karena Dia yang Maha Penerima Taubat lagi Maha Penyayang. Pelajaran dari ayat : • Ibadah yang dilakukan oleh seorang mukmin kepada selain Allah, dan dia tahu itu merupakan ibadah kepada selain Allah akan terhitung sebagai kemurtadan dari agama dan kesyirikan. • Pensyariatan untuk membunuh orang yang murtad, dalam hadits disebutkan,”Barangsiapa yang murtad dari agama maka bunuhlah.” Akan tetapi itu dilakukan setelah memintanya untuk bertaubat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 54: Kemudian Allah menyebutkan kenikmatan yang telah Allah berikan kepada mereka pada hari itu yang bahwasanya Musa berkata kepada mereka : Sungguh kalian telah dzolim kepada diri – diri kalian dengan mengibadahi anak sapi, oleh sebab itu wajib bagi kalian untuk segera taubat kepada Rabb kalian, dengan saling membunuh satu sama lain dan hal itu yang dapat mensucikan kalian dari dosa ini yaitu dengan meninggalkan dosa; dan ini merupakan ketinggian dari umat Muhammad ﷺ dimana Allah jadikan taubat kepada umat ini sebagai penebus dosa meskipun besar,."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Membunuh dirimu ada yang mengartikan: orang-orang yang tidak menyembah patung anak sapi itu membunuh orang yang menyembahnya. Ada yang mengartikan: orang yang menyembah patung anak sapi itu saling bunuh-membunuh, dan ada juga yang mengartikan: mereka disuruh membunuh diri mereka masing-masing untuk bertobat. Daripada kekal di neraka selama-lamanya karena perbuatan syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 54",
    "description": "Bila peringatan pada ayat-ayat yang lalu langsung disampaikan oleh Allah kepada bani israil, maka sekarang peringatan itu disampaikan melalui nabi musa. Perubahan siapa yang menyampaikan peringatan ini memberikan sinyal bahwa kedurhakaan bani israil itu sudah sangat keterlaluan sehingga seolah-olah Allah tidak mau lagi memedulikan mereka dan sekarang diberikan wewenang itu kepada nabi musa. Dan ingatlah ketika nabi musa berkata kepada kaumnya, wahai kaumku! kamu benar-benar telah melakukan kedurhakaan kepada Allah. Itu berarti kamu telah menzalimi dirimu sendiri. Perbuatan kamu dengan menjadikan patung anak sapi se-bagai sesembahan kamu adalah perbuatan yang telah mensyirikkan Allah yang membuat kamu layak diberi hukuman. Oleh karena itu, bertobatlah dengan memohon ampun kepada penciptamu, Allah yang maha pencipta, dan bunuhlah dirimu. Sejak dulu sampai sekarang terdapat tradisi bangsa-bangsa yang rela mengorbankan nyawa dengan membunuh diri sendiri demi untuk tujuan yang lebih luhur, seperti yang terdapat dalam tradisi masyarakat jepang. Membunuh diri dengan tujuan luhur itu adalah lebih baik bagimu, wahai bani israil, di sisi Allah penciptamu dengan sangat sempurna. Dengan demikian, dia Allah akan menerima tobatmu dan permohonan ampunmu. Sungguh, yakinilah bahwa dialah zat yang maha penerima tobat dosa hamba-hamba-Nya, lagi maha penyayang. Kedurhakaan bani israil lebih meningkat lagi. Bukan hanya menyembah patung anak sapi, tetapi malah mereka meminta Allah agar dapat dilihat dengan mata kepala. Dengan nada yang sangat kasar, mereka memanggil nabi musa dengan menyebut nama, musa. Dan ingatlah wahai bani israil ketika kamu berkata kepada nabi musa, wahai musa! kami tidak akan beriman kepadamu, dan kepada apa yang kamu sampaikan, sebelum kami melihat Allah, tuhan yang maha pencipta itu, dengan jelas. Tentu permintaan ini sudah melampaui batas kewajaran. Bukankah mereka sudah menerima nikmat yang sangat banyak dari Allah, tetapi tetap masih durhaka. Disebabkan kedurhakaanmu yang sudah sangat berlipat-lipat, maka halilintar menyambarmu sebagai hukuman bagi kamu. Semua peristiwa itu kamu sadari terjadinya, sedang kamu menyaksikan dengan mata kepala kamu sendiri."
  }
]