[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah ketika kalian berkata “Wahai Musa Kami tidak akan mempercayai bahwa perkataan yang kami dengar darimu adalah Firman Allah, hingga kami dapat melihat Allah dengan mata kami. Maka turunlah api halilintar dari langit yang kalian dapat melihatnya dengan mata kalian secara langsung, maka api itu membinasakan kalian akibat dosa dosa kalian dan kelancangan kalian terhadap Allah Azza wa Jalla."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan ingatlah ketika leluhurmu dengan berani berbicara kepada Musa -'alaihissalām-, “Kami tidak akan beriman kepadamu sampai kami melihat Allah secara nyata tanpa ada penghalang sedikitpun.” Kemudian kalian disambar oleh api yang membakar dan membunuh kalian. Lalu kalian saling pandang satu sama lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Dan ingatlah ketika kalian berkata kepada nabi kalian, Musa: “Kami tidak akan mempercayai seruanmu kepada kami hingga kami dapat melihat Allah dengan jelas.” Maka Kami timpakan kepada kalian dengan tiba-tiba api dari langit yang kalian lihat dengan mata kepala kalian sendiri, sehingga api itu membinasakan kalian seketika."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَإِذْ قُلْتُمْ Yang berkata disini adalah 70 orang yang telah dipilih oleh Musa. جَهْرَةً Yakni melihat secara langsung dengan mata telanjang. فَأَخَذَتْكُمُ الصَّاعِقَةُ Yakni api dari langit yang menyambar mereka sehingga mereka meninggal. وَأَنْتُمْ تَنْظُرُونَ Yakni melihatnya dengan mata telanjang"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika seseorang mengucapkan suatu perkataan dan orang-orang yang mendengarkan ucapan itu tidak mengingkarinya, maka sesungguhnya itu adalah penguatan bagi semuanya, karena sikap itu merupakan dalil atas keridhoan mereka terhadapnya, dan ini adalah asas pada apa yang Allah katakan tentang Bani Israil yang hidup pada kenabian, ketika Allah menegur mereka atas perbuatan orang-orang terdahulu sebelum mereka, sebagaimana yang dituliskan dalam firman-Nya : { وَإِذْ قُلْتُمْ يَا مُوسَىٰ لَنْ نُؤْمِنَ لَكَ حَتَّىٰ نَرَى اللَّهَ جَهْرَةً } dan ayat lainnya, dan sebagaimana yang diketahui bahwasanya orang-orang yahudi yang hidup pada zaman kenabian bukanlah mereka yang mengatakan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah ketika 70 orang yang dipilih Musa untuk menyaksikan wahyu dan mendapatkan Taurat di gunung Thur berkata: “Kami tidak akan membenarkan apa yang engkau datangkan kepada kami sampai kami melihat Allah dengan mata kepala kami sendiri”. Kemudian datang di atas mereka cahaya dari langit dan menghancurkan mereka dan kalian menganggap hal itu sebagai ujian. Penyebab peristiwa itu adalah permintaan mereka atas apa yang belum diizinkan oleh Allah berupa permintaan untuk melihatNya di dunia. Adapun di akhirat maka sesungguhnya hamba Allah dapat melihat Tuhannya sesuai dalil dari kumpulan hadits-hadits mutawatir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika kalian berkata,“Wahai Musa, kami tidak akan beriman kepadamu sebelum melihat Allah dengan jelas”} dengan mata telanjang {Maka, halilintar menyambar kalian} api membara yang turun dari langit {dan kalian menyaksikan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Dan ingatlah ketika kamu berkata, ’hai Musa, kami tidak akan beriman kepadamu sebelum kami melihat Allah dengan terang’.” Ini merupakan puncak kelancangan terhadap Allah dan terhadap RosulNya “karena itu kamu disambar petir, ” baik meninggal atau pingsan yang parah, ”sedang kamu menyaksikan” terjadinya hal itu, di mana setiap mereka menyaksikan yang lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : نَرَى ٱللَّهَ جَهۡرَةٗ Narollaha jahrotan : Kami melihat Allah dengan mata telanjang. ٱلصَّٰعِقَةُ Ash-Sho’iqoh : Kilat yang menyala bersama dengan awan yang menurunkan hujan dan petir. Makna ayat : Kemudian Allah Ta’ala menyebutkan kejadian lain yaitu ketika Bani Israil menyembah patung anak sapi yang menyebabkan mereka murtad, Musa memilih (dengan perintah dari Allah) 70 orang lelaki pilihan yang tidak menyembah berhala, untuk pergi bersama Musa ke bukit Tursina meminta pengampunan kepada Allah Ta’ala karena perbuatan saudara-saudaranya menyembah berhala. Ketika sampai di sana, mereka berkata kepada Musa,”Mintalah kepada Rabbmu untuk memperdengarkan kalamNya”. Maka Allah berkata,”Sesungguhnya Aku adalah Allah, Tidak ada sesembahan selainKu. Aku telah mengeluarkan kalian dari Mesir karena tangan besi Fir’aun, maka sembahlah Aku dan jangan beribadah kepada selainKu.” Ketika Musa memberitahukan kepada orang-orang yang dibawanya bahwa syarat diterima taubat dengan membunuh diri-diri mereka. Maka mereka berkata,”Kami tidak akan beriman kepadamu, yaitu tidak mengikuti ucapanmu bahwa kami membunuh satu sama lain sampai kami melihat Allah dengan mata kepala.” Ini adalah dosa yang amat besar mereka perbuat karena mendustakan rasulnya, maka Allah murka dan menurunkan adzabNya berupa kilat yang menyambar sehingga mencelakakan mereka. Pelajaran dari ayat : • Kehidupan ini hakikatnya adalah untuk bersyukur kepada Allah Ta’ala dengan beribadah hanya kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 55: Kemudian Allah menyebutkan nikmat yang telah Allah berikan kepada mereka yang bahwasannya mereka berkata yaitu para sabi’in yang kepada Musa : Wahai Musa kami tidak akan pernah membenarkan dari kerisalahanmu sampai kami melihat Allah dengan mata kami, dan sungguh mereka berkata hanyalah sebagai kerendahan dan bukan keinginan murni untuk melihat Allah. Dan oleh sebab permintaan mereka Allah turunkan kepada mereka api dari langit yang mereka melihat dengan mata mereka sendiri; kemudian dimasalah mereka semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka tidak percaya bahwa perkataan yang disampaikan Musa dari Allah adalah firman Allah Ta'ala. Maksudnya: melihat Allah dengan mata kepala. Yang menjadikan mereka mati atau pingsan disebabkan dosa mereka itu dan lancangnya mereka terhadap Allah Ta'ala, karena permintaan semacam ini menunjukkan keingkaran dan ketakaburan mereka, sebab itu mereka disambar halilintar sebagai hukuman dari Allah. Kejadian itu disaksikan oleh mereka, di mana masing-masing mereka melihat kepada kawannya yang terkena sambaran itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 55",
    "description": "Kedurhakaan bani israil lebih meningkat lagi. Bukan hanya menyembah patung anak sapi, tetapi malah mereka meminta Allah agar dapat dilihat dengan mata kepala. Dengan nada yang sangat kasar, mereka memanggil nabi musa dengan menyebut nama, musa. Dan ingatlah wahai bani israil ketika kamu berkata kepada nabi musa, wahai musa! kami tidak akan beriman kepadamu, dan kepada apa yang kamu sampaikan, sebelum kami melihat Allah, tuhan yang maha pencipta itu, dengan jelas. Tentu permintaan ini sudah melampaui batas kewajaran. Bukankah mereka sudah menerima nikmat yang sangat banyak dari Allah, tetapi tetap masih durhaka. Disebabkan kedurhakaanmu yang sudah sangat berlipat-lipat, maka halilintar menyambarmu sebagai hukuman bagi kamu. Semua peristiwa itu kamu sadari terjadinya, sedang kamu menyaksikan dengan mata kepala kamu sendiri. Peristiwa disambar halilintar itu adalah peristiwa dahsyat sehingga layak sekali bila dikatakan itu adalah peristiwa kematian yang dapat menghancurkan kehidupan generasi mereka secara keseluruhan. Namun demikian, Allah masih tetap mencurahkan rahmat-Nya. Sesudah peristiwa halilintar itu, generasi kaum bani israil masih dibangkitkan lagi di dunia ini oleh Allah. Kemudian, setelah terjadinya peristiwa halilintar tersebut, kami membangkitkan kamu, yakni generasi yang selamat dari peristiwa, setelah sebagian besar dari kamu mati, agar kamu bersyukur atas nikmat Allah tersebut."
  }
]