[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami menghidupkan kalian kembali setelah kematian kalian akibat sambaran halilintar tersebut, supaya kalian mensyukuri nikmat Allah kepada kalian. kematian tersebut merupakan bentuk hukuman bagi mereka, kemudian Allah menghidupkan mereka kembali untuk menghabiskan sisa ajal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Kemudian Kami hidupkan kalian sesudah mati agar kalian mau bersyukur kepada Allah atas karunia tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Kemudian Kami membangkitkan kalian -karena keagungan dan kekuasaan Kami yang sempurna- setelah kalian binasa akibat api yang membakar itu. Hal ini agar kalian bersyukur kepada Allah dengan perkataan dan perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. ثُمَّ بَعَثْنَاكُمْ Yakni Allah menghidupkan mereka kembali setalah kematian mereka. Dan mereka dihukum dengan sambaran petir karena mereka meminta agar dapat melihat Allah di dunia padahal itu tidak diperbolehkan. Adapun kemungkinan untuk dapat melihat Allah di akhirat telah banyak sekali hadist-hadist shahih yang menjelaskan bahwa hamba-hamba-Nya kelak dapat melihat tuhan mereka di akhirat, dan hadist-hadist ini adalah dalil yang tak bisa dibantahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian kami menghidupkan kalian setelah mematikan kalian dengan halilintar itu agar kalian bersyukur atas nikmatKu kepada kalian dengan menghidupkan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami membangkitkan kalian} Kami menghidupkan kalian {setelah kematian kalian agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. “Setelah itu kami bangkitkan kamu sesudah kamu mati, supaya kamu bersyukur.” Kemudian Allah menyebutkan tentang nikmatNya kepada mereka pada padang sahara dan daratan yang kosong di mana mereka tersesat tetapi rizki melimpah seraya berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : بَعَثۡنَٰكُم Ba’atsnaakum : Kami menghidupkan kalian setelah sebelumnya kalian mati. Makna ayat : Satu persatu mereka mati sedangkan mereka melihat, kemudian Allah menghidupkan mereka setelah sehari semalam. Hal itu agar mereka bersyukur dan beribadah kepada Allah saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 56: Kemudian Allah mengabarkan bahwasannya kehidupan mereka setelah itu sangat berharap kepada Musa dan Syafa’atnya; karena sebab mereka mengetahui kebesaran Allah atas segala nikmat yang Allah berikan kepada mereka sehingga mereka bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan mati di sini menurut sebagian mufassirin ialah mati yang sebenarnya akibat sambaran halilintar, sedangkan yang lain menafsirkan dengan pingsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 56",
    "description": "Peristiwa disambar halilintar itu adalah peristiwa dahsyat sehingga layak sekali bila dikatakan itu adalah peristiwa kematian yang dapat menghancurkan kehidupan generasi mereka secara keseluruhan. Namun demikian, Allah masih tetap mencurahkan rahmat-Nya. Sesudah peristiwa halilintar itu, generasi kaum bani israil masih dibangkitkan lagi di dunia ini oleh Allah. Kemudian, setelah terjadinya peristiwa halilintar tersebut, kami membangkitkan kamu, yakni generasi yang selamat dari peristiwa, setelah sebagian besar dari kamu mati, agar kamu bersyukur atas nikmat Allah tersebut. Generasi tersisa bani israil yang dibangkitkan itu diriwayatkan terse-sat selama 40 tahun di padang pasir dataran sinai yang sangat panas. Mereka tersesat karena enggan memerangi orang-orang yang durhaka di syam. Dan kami menaungi kamu dengan awan, sehingga kamu ti-dak merasa kepanasan lagi di tengah padang pasir yang terik itu, dan kami menurunkan kepadamu mann, makanan sejenis madu, dan salwa', burung kecil sejenis puyuh yang dapat dibakar untuk dimakan. Ma-kanlah (makanan) yang baik-baik dari rezeki yang telah kami berikan kepadamu sehingga kamu tidak perlu lagi bersusah-payah mencari bahan makanan di padang pasir itu. Kedurhakaan yang dilakukan oleh bani israil itu sedikit pun tidak mencederai Allah. Mereka tidak menzalimi kami, dan bahkan sedikit pun tidak menodai keagungan Allah. Ditaati atau tidak ditaati, didurhakai atau tidak didurhakai, Allah tetap Allah dengan kemahaagungan-Nya. Oleh sebab itu, bukan Allah yang teraniaya, tetapi justru merekalah yang menzalimi diri sendiri karena merekalah yang akan menanggung akibat kedurhakaan mereka itu."
  }
]