[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian nikmat Kami kepada kalian ketika kalian tersesat jalan di muka bumi, yaitu ketika Kami menjadikan awan menaungi kalian dari panasnya terik matahari dan kami turunkan kepada kalian “manna” yaitu sesuatu yang bentuknya mirip dengan getah yang rasanya menyerupai madu, dan kami turunkan kepada kalian “Salwa” yaitu burung yang serupa dengan puyuh. Dan kami katakan pada kalian : “Makanlah dari makanan yang baik yang telah kami rizkikan kepada kalian, dan janganlah kalian melanggar ajaran agama kalian.” Namun kalian tidak menjalankannya. Mereka tidaklah mendzolimi Kami dengan pengingkaran nikmat yang mereka lakukan. Akan tetapi merekalah yang menzalimi diri mereka sendiri, karena akibat buruk kezoliman Itu kembali kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan salah satu nikmat yang Kami berikan kepada kalian ialah Kami mengirimkan awan yang menaungi kalian dari terik matahari tatkala kalian tersesat di muka bumi. Dan Kami menurunkan nikmat berupa minuman manis seperti madu, dan burung kecil yang dagingnya lezat seperti burung puyuh. Dan Kami firmankan kepada kalian, “Makanlah dari makanan yang baik-baik yang telah Kami berikan kepada kalian.\" Dan pengingkaran mereka terhadap nikmat-nikmat tersebut tidak sedikitpun mengurangi kemuliaan-Ku, tetapi sejatinya mereka menzalimin diri mereka sendiri dengan mengurangi bagian mereka dari pahala (yang dijanjikan) dan menjerumuskan diri mereka sendiri ke dalam siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Dan Kami jadikan awan yang menaungi kalian agar kalian terlindungi dari terik matahari, dan Kami turunkan bagi kalian makanan yang manis, nikmat, dan segar, maka makanlah makanan halal yang telah Kami berikan kepada kalian. Sungguh mereka sama sekali tidak menzalimi Kami ketika mereka mengingkari nikmat-nikmat itu, namun mereka menzalimi diri mereka sendiri, sebab mudharat kemaksiatan akan menimpa mereka berupa musibah dan siksaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ Yakni awan yang dijadikan oleh Allah sebagai naungan yang melindungi mereka dari panasnya matahari saat mereka berjalan diantara negeri Mesir dan Syam ketika mereka enggan untuk memasuki kota yang didalamnya terdapat orang-orang yang perkasa. الْمَنَّ Yakni hujan dari langit yang turun ke pohon dan batu yang kemudian menjadi buliran manis seperti madu, lalu kering seperti lilin. Diriwayatkan dari Rasulullah bahwa al-Kam’ah (sejenis jamur bawah tanah) temasuk dari al-mann yang diturunkan Allah kepada Musa. وَالسَّلْوَىٰ Ada yang berpendapat bahwa as-Salwa adalah burung puyuh, yang disembelih untuk dimakan. Dan pendapat lain mengatakan bahwa ia adalah madu. وَمَا ظَلَمُونَا Allah berfirman: “kami lebih mulia untuk berbuat zalim.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Di tengah gurun pasir antara Mesir dan Syam, kami menjadikan awan sebagai naungan bagi kalian yang menaungi kalian dari panasnya matahari. Ketika mereka berhenti memasuki kota kaum Jabarin, kami menurunkan kepada kalian Al-Manna yaitu sesuatu yang manis seperti madu yang terbentuk bersamaan dengan embun di atas pohon, dan As-Salwa yaitu burung puyuh, mereka menyembelihnya dan memakannya. Nikmatilah kelezatan makanan di gurun yang tidak ada satu pun kehidupan di dalamnya. Mereka tidak menzalimi kami dengan menentang perintah kami dan kufur atas nikmat kami namun mereka menzalimi diri mereka sendiri dengan mendekatkannya kepada siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menaungi kalian dengan awan} dan Kami menjadikan awan yang menaungi kalian dari panas matahari {dan Kami menurunkan kepada kalian manna} minuman yang manis seperti madu {dan salwa} dan burung kecil yang enak dagingnya yang mana menyerupai burung puyuh {Makanlah (makanan) yang hal-hal baik dari rezeki yang telah Kami berikan kepada kalian. Mereka tidak menzalimi Kami} Mereka tidak mencurangi Kami dengan berbuat maksiat {tetapi merekalah yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Dan kami naungi kamu dengan awan, dan kami turunkan kepadamu manna, ” yaitu sebuah kata yang mencakup setiap rizki atau kebaikan yang di hasilkan tanpa keringat, diantaranya jahe, cendawan dan roti, dan sebagainya, “dan salwa”, berupa burung kecil yang disebut “as-samany, ” suat nama burung yang dagingnya lezat, dan kepada mereka diturunkan hal-hal tersebut, berupa Manna dan Salwa yang mencukupi kebutuhan mereka dan menjadi makanan pokok mereka. “Makanlah dari makanan yang baik-baik yang telah kami berikan kepadamu, ” yaitu rizki yang tidak ada bandingannya bagi penduduk kota yang telah hidup mewah. Namun mereka tidak mensyukuri nikmat tersebut dan mereka selalu berada dalam kekerasan hati dan kemaksiatan mereka yang banyak, ”dan tidaklah mereka menganiaya kami, ” maksudnya tidaklah mereka menganiaya kami dengahn perbuatan yang bertentangan dengan apa yang telah kami perintahkan, karena Allah ta’ala tidaklah mendapatkan mudarat dari kemaksiatan pelaku maksiat sebagaimana juga tidak bermanfaatnya ketaatan seseorang yang melakukan ketaatan kepadaNya, ”akan tetapi merekalah yang menganiaya diri mereka sendiri,” maka kemudaratannya kembali kepada mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱلۡغَمَامَ Al-Ghomaam : Awan tipis yang berwrna putih. ٱلۡمَنَّ وَٱلسَّلۡوَىٰۖ Al-Manna was salwa : Manna adalah benda lengket seperti permen dan rasanya semanis madu, Salwa adalah sejenis burung yang disebut dengan As-Sumaniy. طَيِّبَٰتِ Ath-Thoyyibat : artinya adalah yang halal. Makna ayat : Lantas Allah menyebutkan nikmat yang lain berupa kemuliaan dan nikmat untuk mereka dengan naungan awan di atasnya, juga Allah menurunkan Manna dan Salwa pada saat kejadian Tiih di gurun Sina dalam firmanNya,”Kami tidak mendzalimi mereka” petunjuk bahwa ujian Tiih adalah hukuman untuk mereka karena meninggalkan jihad serta kesembronoan ketika mengucapkan kepada Musa,”Pergilah engkau dan Tuhanmu berperang, kami duduk-duduk di sini saja.” Allah tidak mendzalimi mereka saat kejadian Tiih akan tetapi itu karena mereka mendzalimi dirinya sendiri. Pelajaran dari ayat : • Makanan dan minuman disebut halal jika dihalalkan oleh Allah sedangkan disebut haram ketika diharamkan oleh Allah ‘Azza wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 57: Kemudian Allah menjelaskana atas nikmat yang berikan kepada bani israil dimana mereka tersesat dibumi; Allah jadikan awan seperti payungyang mencegah mereka dari terik matahari, dan Allah turunkan bagi mereka karunia berupa sesuatu yang menyerupai madu, dan juga salwa yaitu burung yang lezat dagingnya yang menyerupai burung puyuh; Dan Allah berkata mereka : Makanlah oleh kalian dari apa yang telah Kami rizkikan kepada kalian dari kebaikan – kebaikan ini, akan tetapi mereka tidak bersyukur atas nikmat Allah dan tidak bersegera mengerjakan perintah Allah; bahkan mereka tetap dalam kekufuran dan maksiat. Allah melanjutkan bahwasannya mereka tidak menyadari akan bahaya kekufuran dan kemaksiatan yang telah mereka perbuatan, padahal mereka telah membahayakan diri mereka sendiri; Karena sebab mereka mengikari nikmat tersebut yang menyebabkan kemarahan Allah dan azab-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara sekian banyak nikmat Allah kepada mereka ialah mereka dinaungi awan di waktu berjalan di bawah panas terik matahari dan padang pasir yang luas, bahkan memperoleh rezeki berupa mann dan salwa. Manna ialah makanan manis dan lengket seperti madu. Salwa ialah burung sebangsa puyuh. Ada juga yang mengartikan bahwa \"Mann\" adalah setiap rezeki yang baik yang diperoleh tanpa susah payah. Namun sayang, nikmat-nikmat yang diberikan Allah kepada mereka bukan mereka syukuri, bahkan malah mereka kufuri, mereka banyak melakukan dosa sehingga hati mereka mengeras seperti batu. Ketika mereka melanggar ajaran agama dan mengkufuri nikmat, sebenarnya mereka tidak menzalimi Allah, bahkan mereka menzalimi diri mereka sendiri, karena kezaliman yang mereka lakukan kembalinya kepada mereka juga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 57",
    "description": "Generasi tersisa bani israil yang dibangkitkan itu diriwayatkan terse-sat selama 40 tahun di padang pasir dataran sinai yang sangat panas. Mereka tersesat karena enggan memerangi orang-orang yang durhaka di syam. Dan kami menaungi kamu dengan awan, sehingga kamu ti-dak merasa kepanasan lagi di tengah padang pasir yang terik itu, dan kami menurunkan kepadamu mann, makanan sejenis madu, dan salwa', burung kecil sejenis puyuh yang dapat dibakar untuk dimakan. Ma-kanlah (makanan) yang baik-baik dari rezeki yang telah kami berikan kepadamu sehingga kamu tidak perlu lagi bersusah-payah mencari bahan makanan di padang pasir itu. Kedurhakaan yang dilakukan oleh bani israil itu sedikit pun tidak mencederai Allah. Mereka tidak menzalimi kami, dan bahkan sedikit pun tidak menodai keagungan Allah. Ditaati atau tidak ditaati, didurhakai atau tidak didurhakai, Allah tetap Allah dengan kemahaagungan-Nya. Oleh sebab itu, bukan Allah yang teraniaya, tetapi justru merekalah yang menzalimi diri sendiri karena merekalah yang akan menanggung akibat kedurhakaan mereka itu. Ayat-ayat sebelumnya menjelaskan beragam anugerah yang terlimpah kepada bani israil, sedang ayat ini menerangkan nikmat-nikmat yang lain. Dan selain anugerah yang telah dilimpahkan, ingatlah juga ketika kami berfirman kepada bani israil, masuklah ke negeri ini, yaitu baitulmaqdis setelah dapat mengalahkan lawan-lawanmu. Sesudah itu maka makanlah dengan nikmat berbagai makanan yang ada di sana sesukamu. Dan selanjutnya masukilah pintu gerbangnya sambil membungkuk sebagai tanda kerendahan hati dan penyesalan atas semua dosa yang telah diperbuat masa lalu, dan kemudian katakanlah dengan penuh harap, 'bebaskanlah kami dari dosa-dosa kami yang demikian banyak. ' bila hal ini kamu lakukan dengan penuh kesadaran, niscaya kami ampuni dosa-dosa dan kesalahan-kesalahanmu. Dan selain dari yang telah dianugerahkan, kami juga akan menambah karunia dan nikmat, baik ketika di dunia maupun di akhirat kelak, bagi orang-orang yang benar-benar selalu berbuat kebaikan."
  }
]