[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah nikmat kami atas kalian ketika kami berfirman: “masuklah kalian ke kota Baitul Maqdis, lalu Makanlah makanan yang baik-baik dari kota itu di tempat manapun dari kota itu sebagaimana santapan yang sedap, dan jadilah kalian saat memasuki kota itu menjadi orang-orang yang tunduk kepada Allah lagi menghinakan diri di hadapannya, dan katakanlah “wahai tuhan kami, Hapuskanlah dosa-dosa kami dari tanggungan kami”. Niscaya kami akan mengabulkan permintaan kalian, kami akan memaafkan kalian dan menutup dosa-dosa itu bagi kalian serta kami akan memberikan tambahan kebaikan dan pahala bagi orang-orang yang berbuat baik karena amalan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan ingatlah salah satu nikmat yang Allah berikan kepada kalian, yaitu ketika Dia berfirman kepada kalian, “Masuklah kalian ke Baitul Maqdis. Makanlah makanan yang baik-baik yang ada di sana dari mana saja sesuka hati kalian. Makanlah dengan enak dan leluasa. Dan masuklah ke sana seraya rukuk dan tunduk kepada Allah. Lalu memohonlah kepada Allah seraya berkata, 'Ya Rabb kami, hapuslah dosa-dosa kami,' niscaya Kami akan mengabulkan permohonan kalian. Dan Kami akan berikan tambahan ganjaran kepada orang-orang yang beramal dengan sebaik-baiknya atas kesungguhan mereka dalam beramal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Allah mengingatkan para keturunan Nabi Ya’qub kejadian ketika Allah memerintahkan pendahulu mereka: “Masuklah ke dalam Baitul Maqdis, makan dan nikmatilah segala kenikmatan yang ada di dalamnya sesuka hati kalian, dan masuklah pintu Baitul Maqdis dengan merunduk dan penuh ketundukan kepada Allah, serta mohonlah kepada-Nya ampunan atas dosa-dosa kalian. Barangsiapa yang menjalankan hal itu niscaya Kami akan mengabulkan harapannya dan Kami akan menambah pahala dan karunia bagi orang-orang yang berbuat baik.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. هَٰذِهِ الْقَرْيَةَ Yakni Baitul Maqdis. رَغَدًا Melimpah وَادْخُلُوا الْبَابَ سُجَّدًا Yakni memasuki pintu Baitul Maqdis. Dan kata sujud disini berarti menunduk, dan pendapat lain mengatakan dengan tawadlu’ dan hati yang tunduk. حِطَّةٌ Allah menyuruh mereka untuk mengatakan kata ini yang bermakna taubat, ketundukan kepada Allah, dan pengakuan atas keutamaan-Nya yang diberikan kepada mereka dalam penakhlukkan kota Baitul Maqdis. وَسَنَزِيدُ الْمُحْسِنِينَ Yakni menambah keutamaan dan kebaikan untuk orang-orang yang berbuat baik dari kalian atas kebaikan yang telah dilakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah juga nikmat kami atas kalian ketika kami berfirman kepada leluhur kalian setelah mereka keluar dari gurun: “Masuklah ke dalam Baitul Muqaddas (rumah yang disucikan), makanlah (rejeki) di dalamnya sesuka kamu dengan nikmat, banyak dan melimpah; dan masuklah pintu Baitul Muqaddas dengan membungkuk menundukkan diri kepada Allah SWT. Itu merupakan salah satu jenis sujud syukur dan katakanlah: “Sungguh hina diri kami, kami meminta kepadaMu ya Tuhan untuk menghilangkan dan mengampuni dosa-dosa kami”, lalu kami akan menambahkan orang-orang baik di antara kalian dengan cara bersyukur dan memohon ampunan, kebaikan, pahala dan keutamaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika Kami berfirman,“Masuklah ke negeri ini} Baitul Maqdis {Lalu, makanlah makanan dari negeri itu sesuka kalian dengan nikmat. Masukilah pintunya sambil membungkuk} dengan rukuk dan tunduk kepada Allah {dan katakanlah,‘Bebaskanlah kami} dengan berkata,”Wahai Tuhan kami, bebaskanlah kami dari kesalahan-kesalahan kami” {niscaya Kami akan mengampuni kesalahan-kesalahan kalian dan Kami akan menambah (karunia) kepada orang-orang yang berbuat kebaikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Ini juga termasuk di antara nikmat Allah terhadap mereka setelah kemaksiatan mereka kepadaNya, lalu Allah memerintahkan kepada mereka untuk memasuki suatu kampung yang menjadi sebuah negeri dan tempat menetap, serta kemuliaan bagi mereka, dan mereka akan memperoleh rizki yang melimpah, dan agar jalan mereka memasukinya harus dengan rasa tunduk dan patuh kepada Allah dengan perbuatan, yaitu memasuki pintu gerbang sambil bersujud, artinya tunduk dan patuh, dan juga dengan perkataan yaitu agar mereka berkata, “bebaskanlah kami dari dosa, ” yakni menghapus dosa dan kesalahan mereka dengan permohona mereka atas ampunanNya kepadaNya, ”niscaya kami ampuni kesalahan-kesalahanmu” dengan adanya permohonan kalian atas ampunanNya, ”dan kelak kami akan menambah pemberian kami kepada orang-orang yang berbuat baik, ” dengan perbuatan-perbuatan mereka, yaitu balasan yang segera maupun yang tertunda."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ٱلۡقَرۡيَةَ Al-Qoryah : yang dimaksud adalah Baitul Maqdis (Yerussalem) رَغَدٗا Roghodan : Kehidupan yang lapang lagi nyaman سُجَّدٗا Sujjadan : Maknanya agar mereka masuk pintu gerbang dengan ruku’ merendahkan diri di hadapan Allah dengan tunduk penuh kesyukuran kepada Allah atas keselamatan yang diberikan setelah kejadian berputar-putar di gurun Sinai. حِطَّةٞ Khittotun : Mengikuti wazan fi’latun seperti kata riddatun. Allah menyuruh mereka untuk mengatakan khitthoh yang artinya adalah ampuni dosa-dosa kami. Kata khittoh berharakat akhir dhommah (marfu’) karena kedudukannya sebagai khobar dari mubtada’ yang dihapus, aslinya : دُخُولُنَا البَابَ سُجَّدًا حِطَّةٌ لِذُنُوبِنَا Masuknya kami ke pintu dengan cara bersujud menjadi ampunan bagi dosa-dosa kami. نَّغۡفِرۡ Naghfir : Kami hapus dan Kami tutupi. خَطَٰيَٰكُمۡۚ Khothoyaakum : al-Khothooya merupakan bentuk plural dari Khotiah, artinya adalah dosa yang diakui oleh seorang hamba. Makna ayat : Ayat 58 mengandung pengingat kepada orang Yahudi tentang kejadian besar yang terjadi pada pendahulu mereka akan nikmat Allah yang diberikan kepada Bani Israil yang wajib untuk disyukuri. Yaitu setelah selesai mereka berputar-putar di gurun Sinai, Nabi Musa dan Harun telah wafat, dan digantikan oleh murid Nabi Musa yang bernama Yusya’ bin Nun. Yusya’ memimpin mereka untuk menyerang kaum ‘Amaliqah dan Allah membukakan Baitul Maqdis (Yerusalem) untuk mereka. Kemudian Allah memerintahkan Bani Israil sebagai pemuliaan,”Masuklah alian ke Baitul Maqis kemudian makanlah dari hasil buminya yang banyak lagi enak dari apa-apa yang kalian sukai. Dan bersyukurlah kepadaKu atas kenikmatan yang kalian peroleh dengan memasuki pintu gerbang kota dalam posisi ruku’ dengan khusyu’ seraya mengatakan,”Kami memasuki pintu gerbang denga ruku’ sebagai ampunan bagi kami dari apa yang kami perbuat, yaitu meninggalkan berjihad bersama Musa dan Harun. Apabila kalian mengucapkan itu, maka Kami akan mengampuni dosa-dosa kalian dan kami tambahkan pahala bagi orang-orang yang berbuat baik di antara kalian sebagaimana terkandung dalam ayat selanjutnya. Pelajaran dari ayat : • Mengingatkan generasi sekarang terhadap kejadian yang dialami oleh generasi pendahulu sebagai nasehat dan peringatan. • Meninggalkan jihad jika sudah wajib akan menyebabkan kehinaan dan kerugian bagi umat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 58: Dan diantara nikmat Allah yang diberikan kepada kalian wahai bani israil yaitu bahwasannya Allah memerintahkkan kalian untuk masuk kedalam negeri Baitul Maqdis untuk menjadi negeri dan tempat tinggal kalian, dan Allah juga memerintahkan kepada kalian untuk memakan makanan yang baik, serta buah – buahan yang lezat, Allah juga memerintahkan kepada kalian ketika kalian masuk ke dalam negeri Baitul Maqdis untuk menjadi orang – orang khusyuk dan berserah diri yang mensyukuri nikmat Allah, serta meminta kepada Rabb kalian untuk menggugurkan dosa – dosa kalian dan mengampuninya; Maka sesungguhnya Allah mengampuni bagi siapa yang bertaubat dan meminta ampun serta menambah kepada orang – orang yang muhsin keutamaan dan kemuliaan atas kebaikan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini termasuk nikmat Allah kepada mereka. Setelah mereka berbuat maksiat kepada-Nya, Allah memerintahkan mereka masuk ke sebuah negeri yang di sana terdapat kemuliaan bagi mereka dan bisa mereka jadikan sebagai tempat tinggal, di samping mereka akan memperoleh rezeki yang banyak. Ketika mereka hendak masuk ke negeri itu, mereka diperintahkan untuk masuk sambil menundukkan diri kepada Allah Azza wa Jalla dengan bersujud dan mengucapkan kata-kata yang disebutkan pada ayat di atas. Allah Ta'ala akan menambahkan karunia, balasan kebaikan di dunia dan akhirat, kebaikan dan pahala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 58",
    "description": "Ayat-ayat sebelumnya menjelaskan beragam anugerah yang terlimpah kepada bani israil, sedang ayat ini menerangkan nikmat-nikmat yang lain. Dan selain anugerah yang telah dilimpahkan, ingatlah juga ketika kami berfirman kepada bani israil, masuklah ke negeri ini, yaitu baitulmaqdis setelah dapat mengalahkan lawan-lawanmu. Sesudah itu maka makanlah dengan nikmat berbagai makanan yang ada di sana sesukamu. Dan selanjutnya masukilah pintu gerbangnya sambil membungkuk sebagai tanda kerendahan hati dan penyesalan atas semua dosa yang telah diperbuat masa lalu, dan kemudian katakanlah dengan penuh harap, 'bebaskanlah kami dari dosa-dosa kami yang demikian banyak. ' bila hal ini kamu lakukan dengan penuh kesadaran, niscaya kami ampuni dosa-dosa dan kesalahan-kesalahanmu. Dan selain dari yang telah dianugerahkan, kami juga akan menambah karunia dan nikmat, baik ketika di dunia maupun di akhirat kelak, bagi orang-orang yang benar-benar selalu berbuat kebaikan. Setelah mengenyam berbagai kenikmatan itu, ternyata bani israil tetap ingkar kepada Allah. Sebagai balasan dari beragam anugerah tersebut, lalu orang-orang yang zalim itu bahkan mengganti perintah Allah yang disyariatkan untuk kebaikan mereka dengan mengerjakan sesuatu yang justru tidak diperintahkan kepada mereka. Di antara perbuatan yang mereka lakukan adalah mengganti perintah sujud dengan mengangkat kepala, tunduk sebagai bukti ketaatan dengan pembangkangan, dan rendah hati dengan sikap angkuh serta sombong. Maka, akibat dari keingkaran dan kesombongan ini, Allah menegaskan, kami, melalui para malaikat atau bencana, turunkan malapetaka yang merupakan siksa yang amat pedih dari langit yang datangnya tidak terduga kepada orang-orang yang zalim itu. Hal yang sedemikian ini karena mereka selalu berbuat fasik, yaitu tidak pernah bersyukur dan selalu menyiratkan pembangkangan dan kesombongan."
  }
]