[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka telah mengganti orang-orang yang zalim lagi sesat itu dari kalangan Bani Israil terhadap firman Allah, dan mereka Mengubah ucapan dan tindakan secara bersamaan. ketika mereka masuk dengan mengangkat dengan pantat mereka Seraya berkata “biji-bijian dalam gandum” dan mereka mengolok-olok ajaran agama Allah, maka Allah pun menurunkan terhadap mereka siksaan dari langit akibat pembangkangan mereka tersebut dan keluarnya mereka dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Akan tetapi orang-orang yang zalim di antara mereka justru mengganti tindakan dan mengubah ucapan itu. Mereka masuk sambil merayap di atas pantat mereka. Dan mereka berkata, “Satu biji dalam satu rambut.” Mereka meremehkan perintah Allah. Maka balasannya ialah Allah menurunkan azab dari langit kepada orang-orang yang zalim di antara mereka, karena mereka telah keluar dari batas-batas syariat dan melanggar perintah Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Orang-orang yang zalim di antara mereka mengubah perintah Allah dengan memasuki pintu Baitul Maqdis sambil merangkak dengan tubuh bagian belakang mereka dan enggan memohon ampunan dari Allah, namun yang mereka ucapkan adalah “sebiji gandum” untuk mengolok-olok perintah Allah. Maka balasan atas perbuatan mereka ini adalah azab yang Allah turunkan dari langit yang berupa penyakit Tha’un. (sebagaimana disebutkan dalam shahih Bukhari, kitab para Nabi, no. 3473)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. فَبَدَّلَ الَّذِينَ ظَلَمُوا قَوْلًا غَيْرَ الَّذِي قِيلَ لَهُمْ Diriwayatkan oleh Bukhari dan muslim dari Nabi Shallallahu ‘Alaihi Wasallam beliau bersabda: diserukan kepada bani Israel: masukilah pintu itu seraya menundukkan diri dan katakanlah hiththah (Bebaskanlah kami dari dosa). Namun mereka mengganti kata tersebut dengan Hinthoh (satu biji gandum), sambil masuk dengan cara merangkak menggunakan dubur-dubur mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian orang-orang zalim di antara mereka mengubah ucapan yang telah disampaikan kepada mereka dan berkata: “Hinthah atau biji tanaman gandum, sebagai ganti {Hitthah} [QS Al-Baqarah/58 dan QS Al-A’raf/161] lalu mereka masuk dengan merangkak di atas kelemahan mereka, kemudian kami menurunkan kepada orang-orang yang zalim dengan menentang perintah kami suatu siksa dari langit akibat kemaksiatan dan keberpalingan mereka dari ketaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu, orang-orang yang zalim mengganti} mengubah {perintah dengan hal lain yang tidak diperintahkan kepada mereka. Lalu Kami menurunkan kepada orang-orang yang zalim itu malapetaka} azab {dari langit karena mereka berbuat fasik} mereka melanggar kataatan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. “Lalu orang-orang yang zhalim mengganti,” yakni yang zhalim diantara mereka. Allah tidak berkata \"lalu mereka mengganti\", karena tidak semua dari mereka itu mengganti “perintah dengan (mengerjakan) yang tidak diperintahkan kepada mereka, ” dan mereka berkata, gantikanlah kata (bebaskanlah kami dari dosa) dengan kata (yang berarti sebuah biji dari gandum) dengan maksud penghinaan atas perintah Allah dan olok-olokan. Ketika mereka mengganti perkataan itu padahal sangatlah ringan, maka penggantian mereka terhadap perbuatan adalah lebih patut dan utama. Oleh karena itu mereka memasukinya dengan merangkak dengan pantat mereka, dan ketika kezhaliman ini merupakan penyebab terbesar akan azab Allah terhadap mereka, Allah berfirman, “sebab itu kami timpakan atas orang-orang yang zhalim itu, ” diantara mereka “hukuman”, yaitu azab “dari langit”, disebabkan karena kefasikan dan kezhaliman mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : فَبَدَّلَ Fabaddala: Bani Israil mengubah perkataan yang diberikan kepada mereka yaitu ampunilah (Khittothun) menjadi “Habbatun fi sya’rotin\" (biji-bijian dalam gandum) رِجۡزٗا Rijzan : Wabah penyakit Tha’un يَفۡسُقُونَ Yafsuqun : Keluar dari ketaatan kepada Allah dan rasulNya. Makna ayat : Pada ayat 59 menceritakan kejadian lain yang menyingkap hakikat jeleknya tabiat orang Yahudi dan bodohnya sikap mereka. Hal itu nampak saat mereka merubah perbuatan dan perkaataan yang Allah perintahkan kepada mereka. Lantas mereka memasuki gerbang Baitul Maqdis dengan merangkak mundur dengan pantat mereka masuk terlebih dahulu dan mengatakan,”Sebutir biji dalam gandum !!!” oleh karena itu Allah menurunkan azabNya terhadap orang-orang zhalim berupa penyakit Tho’un yang menyebabkan kematian bagi banyak orang, sebagai balasan pembangkangan mereka terhadap perintah Allah Ta’ala. Semua yang disebutkan ini sebagai pengingat bagi orang-orang Yahudi kalau seandainya mereka mau mengambil peringatan. Pelajaran dari ayat : • Peringatan dari akibat kedzaliman, kefasikan, dan membangkang perintah-perintah Allah. • Keharaman mentakwil nash-nash syariat untuk keluar dari makna yang diinginkan oleh Allah. • Keutamaan berbuat ihsan (baik) dalam bentuk ucapan atau perbuatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 59: Allah kemudian menjelaskan bahwasanya mereka yang dzolim dan bodoh dari kalangan bani israil telah menyelewengan kan firman Allah dan merubah serta mengganti berdasarkan keinginan hawa nafsu mereka; Dimana mereka memasukan hawa nafsu mereka kedalamnya dan mereka berkata : Sungguh buruk syari’at agama. Mereka mengolok – olok agama Allah; Maka Allah mengukum mereka orang – orang dzolim azab dari langit berupa kerikil yang dilemparkan kepada mereka sebagai balasan atas perbuatan mereka, kefasikan mereka, dan kesombongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka rubah kata-kata dan perbuatan yang diperintahkan kepada mereka. Mereka tidak menundukkan diri, tetapi malah membalikkan bokong mereka ke depan. Mereka tidak mengucapkan \"Bebaskanlah kami dari dosa-dosa\", bahkan malah mengatakan \"sebutir biji dalam sebuah gandum\", mempermainkan agama Allah. Allah Subhaanahu wa Ta'aala menurunkan azab dari langit karena mereka selalu berbuat fasik; tidak mau menuruti perintah Allah Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 59",
    "description": "Setelah mengenyam berbagai kenikmatan itu, ternyata bani israil tetap ingkar kepada Allah. Sebagai balasan dari beragam anugerah tersebut, lalu orang-orang yang zalim itu bahkan mengganti perintah Allah yang disyariatkan untuk kebaikan mereka dengan mengerjakan sesuatu yang justru tidak diperintahkan kepada mereka. Di antara perbuatan yang mereka lakukan adalah mengganti perintah sujud dengan mengangkat kepala, tunduk sebagai bukti ketaatan dengan pembangkangan, dan rendah hati dengan sikap angkuh serta sombong. Maka, akibat dari keingkaran dan kesombongan ini, Allah menegaskan, kami, melalui para malaikat atau bencana, turunkan malapetaka yang merupakan siksa yang amat pedih dari langit yang datangnya tidak terduga kepada orang-orang yang zalim itu. Hal yang sedemikian ini karena mereka selalu berbuat fasik, yaitu tidak pernah bersyukur dan selalu menyiratkan pembangkangan dan kesombongan. Pada ayat-ayat sebelumnya dijelaskan tentang beragam anugerah yang dilimpahkan kepada bani israil. Selanjutnya pada ayat ini diingatkan pula tentang nikmat lain yang merupakan mukjizat nabi musa, yaitu ketersediaan air yang sangat diperlukan semua makhluk hidup. Dan sejalan dengan hal ini, ingatlah kamu sekalian ketika musa memohon air untuk kaumnya pada saat mereka sedang kehausan di gurun sinai, lalu kami berfirman kepadanya, pukullah batu yang ada di hadapanmu itu dengan tongkatmu yang merupakan mukjizatmu! maka seketika itu memancarlah daripadanya, yaitu dari batu yang dipukul itu, dua belas mata air, sesuai dengan jumlah suku yang ada pada bani israil, yang merupakan keturunan dari dua belas anak nabi yakub. Setiap suku telah mengetahui tempat minumnya masing-masing, seperti yang disebutkan dalam surah al-ara'f /7 : 160, yaitu bahwa setiap suku dari 12 suku dari bani israil mengetahui mata air mana yang menjadi bagian mereka. Karena itu, wahai bani israil, makan-lah dari anugerah Allah yang berupa al-mann dan as-salwa', dan minumlah air yang memancar dari batu sebagai rezeki yang diberikan Allah kepada kamu semua, dan janganlah kamu berkeliaran di bumi dengan tanpa tujuan yang jelas, apalagi dengan berbuat kerusakan yang akan mengakibatkan kerugian dan hal-hal negatif bagi makhluk lainnya."
  }
]