[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari apa yang diturunkan kepadamu dari Tuhanmu karena kesombongan dan kesewenangan, keimanan tidak akan terjadi dari mereka baik engkau -wahai Rasul- telah menakuti dan memperingatkan mereka dari siksa Allah, ataupun engkau tidak melakukan itu, karena mereka terus menerus berada di atas kebatilan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. \"Sesungguhnya orang-orang kafir itu larut dalam kesesatan dan pembangkangan mereka, maka ada atau tidak adanya peringatanmu kepada mereka akan sama saja\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Allah mengabarkan bahwa orang-orang yang mendustakan Dia dan rasul-Nya tidak akan dapat dinasehati dan dicegah dari perbuatannya tersebut karena kesombongan dan kebodohan mereka. Dan ini adalah alasan dari keinginan besar nabi agar mereka beriman, sebab mereka tetap dalam kekafiran baik itu jika mereka diberi nasehat dan dakwah maupun jika mereka dibiarkan begitu saja, hal ini karena Allah telah menutup hati mereka sehingga tidak dapat dimasuki dan ditembus oleh keimanan, sehingga mereka tidak dapat mengerti apa yang bermanfaat bagi mereka; pendengaran mereka juga ditutup sehingga tidak dapat mendengar apa yang berfaidah bagi mereka; dan Allah menjadikan penghalang pada penglihatan mereka yang menghalangi mereka dari melihat hal yang bermanfaat. Ini semua merupakan hukuman bagi mereka di dunia, sedangkan di akhira mereka akan mendapatkan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ Yakni orang-orang yang bersikeras dalam mengingkari risalah yang engkau bawa wahai Muhammad Shallallahu ‘Alaihi Wasallam Shallallahu ‘Alaihi Wasallam, dan mengingkari ayat-ayat yang, padahal kebenaran begitu jelas tanpa dihalangi oleh syubhat dan keyakinan mereka bahwa kau ada dalam kebenaran; maka peringatanmu kepada mereka tidak aka ada manfaatnya karena mereka seseungguhnya mengikuti hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Sesungguhnya tidak akan berguna sedikitpun peringatanmu wahai Muhammad bagi orang-orang yang bersikeras atas kekufuran dan keingkaran mereka terhadap keesaan Allah dan risalahmu. Sama saja jika kau memperingatkan dan menakut-nakuti mereka, mereka tetap tidak akan membenarkan risalahmu. Sungguh panutan mereka adalah hawa nafsu mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang kafir itu sama saja bagi mereka} sama saja bagi mereka {apakah kamu memberi peringatan kepada mereka} apakah kamu menakut-nakuti mereka {atau tidak kamu beri peringatan, mereka tidak akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah ta’ala mengabarkan, ”sesungguhnya orang-orang kafir”, yakni mereka yang bersifat dengan kekufuran dan terwarnai dengannya, lalu menjadi sifat yang lazim bagi mereka, dimana tidak ada sesuatu pun yang dapat menghalangi mereka darinya; nasihat tidak berguna bagi mereka dan mereka selalu tetap dalam kekufuran mereka, maka sama saja bagi mereka “kamu beri peringatan atau tidak kamu beri peringatan, mereka tidak akan beriman”. Hakikat kekufuran adalah mengingkari sesuatu yang datang dari Rosul atau mengingkari sebagiannya. Tidak akan ada manfaatnya dakwah bagi orang-orang kafir itu, kecuali hanya sebatas menegakkan hujjah atas mereka, seolah-olah dalam hal ini hanya pemutus bagi keinginan kuat Rosulullah dalam mewujudkan keimanan mereka, dan bahwasanya kamu jangan bersedih hati untuk mereka, dan bahwasanya dirimu tidak boleh berputus asa terhadap mereka. Kemudian Allah Ta’ala menyebutkan beberapa penghalang yang menghalangi mereka dari keimanan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : كَفَرُواْ : Al-Kufru secara bahasa adalah penyelubungan dan penolakan. Adapun secara syariat adalah mendustakan Allah atau syariat yang dibawa oleh rasulNya baik sebagian atau keseluruhan. سَوَآءٌ maknanya adalah sama saja mau diperingatkan ataupun tidak, karena tidak ada faidahnya. Sebab Allah sudah memutuskan untuk tidak memberikan hidayahNya kepada mereka. ءَأَنذَرۡتَهُمۡ : Al-Indzaar artinya ancaman terhadap balasan dari kekufuran, kedzaliman, dan kerusakan di muka bumi. Makna ayat : Setelah Allah menyebutkan tentang orang-orang mukmin, bertakwa, lagi mendapatkan hidayah serta keberuntungan, dilanjutkan dengan menyebutkan tentang golongan orang-orang kafir, sesat, lagi merugi dalam firmanNya : “Sesungguhnya orang-orang yang kafir...” Allah Ta’ala mengabarkan bahwa mereka tidak siap untuk beriman sampai-sampai mau diperingatkan ataupun tidak hasilnya tetap sama saja Pelajaran dari ayat : 1. Penjelasan mengenai sunnatullah bagi orang-orang yang menentang, sombong, dan terus menerus dalam kekufurannya bahwa Allah mengharamkan hidayah bagi mereka, dengan cara melumpuhkan panca inderanya yang mengakibatkan mereka tidak dapat mengambil manfaat, dan pada akhirnya mereka tidak beriman dan tidak mendapat petunjuk"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 6: 6-7. Allah mengabarkan bahwa mereka orang-orang kafir tidak beriman, dan yang pastinya tidak seluruh orang kafir, dan yang dimaksud adalah ketika turun kedua ayat ini maka orang-orang kafir terbagi menjadi dua golongan. Golongan pertama : sebagian dari para pembesar quraisy seperti abu jahl dan abu lahab, dan yang lainnya yang mereka membenci tauhid dan seruan kepadanya, mereka menolak dan menyiksa orang-orang yang berislam, mereka memaksa agar kaum muslimin hijrah ke habasyah, mereka berkata : Apakah kalian ingin menjadikan tuhan menjadi tuhan yang satu?, Sungguh ini adalah perkara yang mengherankan. (Shod : 5). Mereka juga berkata : Kami tidak akan beriman dengan Al-Qur’an ini dan tidak juga kepada apa yang di hadapannya. (Saba : 31), yaitu dengan kerisalahan yang sebelumnya, telah sampai kepada mereka sehingga mereka membenci dan dendam sembari berkata : Wahai Rabb, kalau memang ini adalah sebuah kebenaran dari sisimu maka turunkanlah hujan batu dari langit atau datangkan kepada kami adzab yang pedih. (Al Anfal : 32); Padahal Allah telah menciptakan mereka di atas fitrah, dan Allah jadikan mereka dapat memilih sebagaimana manusia yang lain, akan tetapi mereka lebih memilih kesesatan dan tetap di atas kekafiran, maka janganlah engkau wahai Nabi Allah takut karena mereka tidak akan beriman selamanya, oleh sebab itu Allah menutup hati mereka, pandangan mereka dan telinga mereka, terkuncinya mereka ini sebagai balasan dan tidak hanya sekali mereka demikian. Golongan yang kedua mereka adalah yang beriman akan tetapi murtad dan munafik, Allah berfirman akan mereka : Itulah mereka yang telah beriman kemudian kafir maka dikuncilah hati mereka. (Al Munafikun : 3). Adapun orang-orang kafir yang lain, maka mereka tergantung akan sampainya dakwah (kepada mereka). Dan bukti yang bahwasanya waktu turun pada kedua kafir yang telah disebutkan sebelumnya adalah bahwasanya seluruh orang-orang kafir dan yang disekitar mereka masuk islam setelah fathul mekkah dan setelah diperangi oleh muhajirin dan anshar untuk menegakkan kalimat Allah; Bahkan di antara mereka orang-orang kafir ada yang masuk islam kemudian menjadi panglima perang semisal Khalid bin Walid, Amr bin Ash dan selain dari mereka. Kemudian Allah menutup ayat ini dengan dikabarkan bahwa tempat kembali bagi kedua kelompok kafir ini adalah kepada adzab yang pedih pada hari kiamat yang tidak ada yang mengetahui dahsyatnya kecuali hanya Allah saja. Dan tidak diragukan bahwasanya bagi siapa saja yang disifati dengan sifat sebagaimana dua golongan kafir ini maka dia semisal dengan mereka dan hukumannya sebagaimana mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mengingkari apa yang diturunkan kepadamu dari Tuhanmu. Baik engkau memperingatkan mereka dengan azab Allah atau pun tidak. Kepada mereka hanyalah ditegakkan hujjah agar mereka tidak dapat beralasan lagi di hadapan Allah Ta'ala pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 6",
    "description": "Sebagai kebalikan dari sikap orang mukmin terhadap Al-Qur'an, sesungguhnya orang-orang kafir yang menutupi hati dan akal pikiran mereka dari kebenaran karena enggan dan sombong, tidak akan memenuhi seruan Allah dan rasul-Nya. Sama saja bagi mereka, engkau beri peringatan, berupa ancaman siksa dari tuhanmu, atau tidak engkau beri peringatan, mereka tidak akan beriman sebab mereka lebih memilih jalan kebatilan. Karena mereka ingkar dengan menutup diri dari kebenaran, maka seakan Allah telah mengunci hati mereka dengan sekat yang tertutup rapat sehingga nasihat atau hidayah tersebut tidak bisa masuk ke dalam hati mereka, dan pendengaran mereka juga seakan terkunci, sehingga tidak mendengar kebenaran dari Allah. Demikian pula penglihatan mereka telah tertutup, sehingga tidak melihat tanda-tanda kekuasaan Allah yang dapat mengantarkan kepada keimanan, dan sebagai akibatnya, mereka akan mendapat azab yang berat."
  }
]