[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah nikmat Kami kepada kalian (ketika kalian mengalami keausan saat kalian berada dalam kesesatan di tengah jalan) dan Musa memohon kepada kami (dengan penuh ketundukan hati) supaya kami memberi kaumnya air minum. Maka kami berfirman: “pukullah batu itu dengan tongkatmu”. Lalu Musa memukulnya, maka memancarlah dari nya 12 mata air sesuai dengan jumlah suku mereka disertai dengan Pemberitahuan kepada tiap-tiap suku tentang mata air yang khusus bagi mereka agar mereka tidak berebutan. Dan kami berfirman kepada mereka: “makan dan minumlah dari rizki Allah dan janganlah kalian berkeliaran di muka bumi dengan membuat kerusakan”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan ingatlah salah satu nikmat yang Allah berikan kepada kalian tatkala kalian tersesat di tengah gurun pasir yang membingungkan dan mengalami dahaga yang hebat, kemudian Musa -'alaihissalām- memanjatkan doa dan memohon kepada Rabbnya agar berkenan memberi kalian minuman, maka Kami perintahkan agar dia memukul batu itu dengan tongkatnya. Dan setelah dia memukulnya maka dari batu itu muncul dua belas mata air sesuai dengan jumlah kabilahmu. Dan air pun mengalir deras dari kedua belas mata air tersebut. Dan Kami telah menjelaskan bahwa setiap kabilah mempunyai tempat minum masing-masing yang khusus, agar tidak terjadi pertengkaran di antara mereka. Dan Kami berfirman kepada kalian, “Makanlah dan minumlah dari rezeki yang Allah berikan kepada kalian tanpa usaha dan kerja keras dari kalian, dan janganlah kalian membuat kerusakan di muka bumi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Dan ingatlah ketika Musa berdoa kepada Allah meminta air minum bagi kaumnya, Bani Israil yang membutuhkan air dan ditimpa kehausan saat mereka berkelana di padang pasir Sina -yang terletak di utara Laut Merah-, maka Kami mengabulkan doanya dengan memerintahkan kepadanya: “Pukullah batu itu dengan tongkatmu,” maka Allah mengeluarkan darinya 12 mata air, sesuai dengan jumlah kabilah mereka. Setiap kabilah telah mengetahui mata air mereka masing-masing. Kemudian Allah membolehkan mereka makanan dan minuman, dan melarang mereka berbuat kerusakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ (الاستسقاء) dilakukan ketika air tidak ada dan hujan lama tidak turun. Dan nabi Musa meminta hujan untuk kaumnya ketika mereka dalam pengembaraan. فَقُلْنَا اضْرِبْ بِعَصَاكَ الْحَجَرَ ۖ فَانْفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا Yakni setelah Musa memukul batu itu dengan tongkatnya maka keluarlah air dari batu tersebut sebagai tanda dari Allah dan kenikmatan untuk mereka ketika mereka kehabisan air. Batu yang dipukul oleh Musa berbentuk segi empat yang keluar disetiap sisinya tiga mata air; dan batu itu jika dipukul oleh Musa akan mengeluarkan air dan bila kaumnya telah cukup dengan air, air itupun berhenti mengalir. مَشْرَبَهُمْ ۖ (المشرب) yakni tempat untuk minum. Diriwayatkan bahwa setiap kabilah dari kaum Nabi Musa memiliki satu mata air dan mereka tidak mengambil dari mata air dari kabilah lain. Dan kabilah-kabilah itu berjumlah dua belas yang berasal dari anak-anak Nabi Ya’kub. كُلُوا وَاشْرَبُوا Yakni Kami katakan kepada mereka agar memakan al- mann dan as- salwa, dan meminum air yang keluar dari batu. وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ Yakni dan janganlah berbuat banyak kerusakan yang mengakibatkan diambilnya nikmat yang Allah berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah juga ketika leluhur kalian kehausan di padang gurun, kemudian Musa mencarikan mereka minuman, lalu kami berfirman kepadanya: “Pukullah batu menggunakan tongkatmu, lalu Musa memukulnya menggunakan tongkatnya, kemudian Allah mengeluarkan air dari batu itu dan keluar darinya 12 mata air sesuai jumlah kabilah mereka. Setiap kabilah mendapatkan satu mata air sehingga mereka tidak saling bermusuhan. Asbath adalah 12 anak Ya’kub lalu kami berfirman kepada mereka: “Makanlah Al-Manna dan As-Salwa, minumlah air yang memancar dari batu itu, dan jangan kalian banyak berbuat kerusakan di bumi!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Musa meminta minum} memohon minuman {untuk kaumnya. Lalu Kami berfirman, “Pukullah batu itu dengan tongkatmu!” Maka memancarlah} maka memancar dan mengalirlah {dari batu itu dua belas mata air. Setiap suku telah mengetahui tempat minumnya} tempat minum mereka {Makan dan minumlah dari rezeki Allah dan janganlah melakukan kejahatan} dan janganlah kalian sewenang-wenang {di bumi dengan berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Memohon air, ” yakni meminta air buat mereka untuk mereka minum, “lalu kami berfirman, ’pukullah batu itu dengan tongkatmu’,” baik sebuah batu yang khusus yang hanya diketahui oleh Allah atau sebuah nama jenis (yang berarti batu apa saja), ”lalu memancarlah dari padanya dua belas mata air, ” dan suku dari Bani Israil ada dua belas suku, “sungguh tiap-tiap suku telah mengetahui” di antara mereka, ”tempat minumnya (masing-masing), ” yaitu tempat mereka yang menjadi tempat minum mereka dari mata air tersebut, sehingga sebagian mereka tidak (perlu) mendesak sebagian lainnya, akan tetapi agar mereka minum dengan tenang dan tidak tergesa-gesa. Oleh karena itu Allah berfirman, ’makan dan minumlah rizki (yang diberikan ) Allah, ” yaitu yang telah dihadirkan buat kalian tanpa usaha dan keringat, ”dan janganlah kamu berkeliaran di muka bumi, ” maksudnya, merubuhkan dengan tujuan merusak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ٱسۡتَسۡقَىٰ } Istasqo : Permintaan kepada Allah agar menurunkan air untuk minum dan kebutuhan yang lain. { بِّعَصَاكَ ٱلۡحَجَرَۖ } bi’ashookal hajar : Yang dimaksud adalah tongkat Musa yang dibawa bersamanya semenjak keluar dari negeri Madyan. Apakah tongkat itu berasal dari pohon surga yang membuat nabi Adam diturunkan ke bumi sebagaimana dikabarkan? Hanya Allah yang lebih tahu. Batu disitu adalah batu berbentuk segi empat yang lunak seperti tanah liat. Apakah batu itu yang membawa lari pakaian Nabi Musa sebagaimana dalam kisah yang sudah terkenal, ataukah hanya bebatuan biasa? Allah yang lebih tahu akan hal itu. { فَٱنفَجَرَتۡ } Fanfajarot : al-Infijar artinya adalah terbelah. Maka terbelahlah batu dan memancarlah mata air disebabkan pukulan tongkat. { مَّشۡرَبَهُمۡۖ } Masyrobahum : Tempat minum mereka { رِّزۡقِ ٱللَّهِ } Rizqillah : Seluruh rizki yang Allah berikan kepada hamba berupa makanan-makanan. { وَلَا تَعۡثَوۡاْ } Wa laa ta’tsauu : العثى dan العثي maknanya adalah kerusakan yang amat besar, berasal dari kata kerja عثي seperti رضي dan يعثى seperti يرضى dan seperti عدا – يعدو { مُفۡسِدِينَ } Mufsidin : berbuat ifsad (kerusakan) artinya melakukan sesuatu di luar ketaatan kepada Allah dan rasulNya dalam setiap aspek kehidupan Makna ayat : Allah Ta’ala mengingatkan orang-orang Yahudi yang hidup pada saat waktu turunnya al-Qur’an di kota Madinah an-Nabawiyah mengenai berbagai nikmat yang diperoleh oleh pendahulu mereka . Pada ayat (60) Allah Ta’ala menyebutkan tatkala mereka sedang kehausan di gurun, maka Nabi Musa memohon kepada Allah agar menurukan hujan. Maka Allah memberi minum mereka dengan cara yang luar biasa agar mereka ingat dan mau beriman serta taat. Caranya dengan memukulkan tongkatnya ke batu, lantas air keluar dari batu itu sebanyak 12 titik yang mana tiap titiknya seperti mata air yang menjadi tempat mengambil air bagi setiap kelompok keturunan Bani Israil. Sehingga setiap kelompok tidak berdesakan sehingga tidak terjadi hal yang memicu mudarat atas kemurahaan Allah memberikan nikmat ini. Dan melarang mereka berbuat kerusakan di muka bumi dengan melakukan maksiat. Pelajaran dari ayat : • Anjuran untuk mengingatkan manusia dengan kenikmatan dan adzab dari Allah Ta’ala. • Menjadi tuntutan bagi orang yang mendapatkan nikmat agar mensyukurinya, dengan cara melakukan ketaatan kepada Allah Ta’ala dengan melakukan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 60: Ingatlah wahai bani israil atas nikmat Allah yang diberikan kepada kalian dimana kalian ketika itu kehausan disaat tersesat, maka Musa memohon kepada Allah untuk memberi kepada kalian minum untuk kalian minum, kemudian Allah memerintahkan untuk memukul batu maka terpancar lah dua belas mata air, pada setiap suku diantara kalian berhak terhadap satu mata air yang telah diketahui untuk dapat diminum. Dan berkata Allah kepada kalian : Makan dan minumlah dari sebagian rezeki Allah dan janganlah merusak di bumi dan berbuat dzolim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saat mereka kehausan. Sesuai jumlah suku Bani Israil sebagaimana tersebut dalam surat Al A'raaf ayat 160 dengan diberitahukan di mana tempat masing-masingnya agar mereka tidak bertengkar. Rezeki itu diberikan Allah Ta'ala kepada mereka tanpa kerja keras dan susah payah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 60",
    "description": "Pada ayat-ayat sebelumnya dijelaskan tentang beragam anugerah yang dilimpahkan kepada bani israil. Selanjutnya pada ayat ini diingatkan pula tentang nikmat lain yang merupakan mukjizat nabi musa, yaitu ketersediaan air yang sangat diperlukan semua makhluk hidup. Dan sejalan dengan hal ini, ingatlah kamu sekalian ketika musa memohon air untuk kaumnya pada saat mereka sedang kehausan di gurun sinai, lalu kami berfirman kepadanya, pukullah batu yang ada di hadapanmu itu dengan tongkatmu yang merupakan mukjizatmu! maka seketika itu memancarlah daripadanya, yaitu dari batu yang dipukul itu, dua belas mata air, sesuai dengan jumlah suku yang ada pada bani israil, yang merupakan keturunan dari dua belas anak nabi yakub. Setiap suku telah mengetahui tempat minumnya masing-masing, seperti yang disebutkan dalam surah al-ara'f /7 : 160, yaitu bahwa setiap suku dari 12 suku dari bani israil mengetahui mata air mana yang menjadi bagian mereka. Karena itu, wahai bani israil, makan-lah dari anugerah Allah yang berupa al-mann dan as-salwa', dan minumlah air yang memancar dari batu sebagai rezeki yang diberikan Allah kepada kamu semua, dan janganlah kamu berkeliaran di bumi dengan tanpa tujuan yang jelas, apalagi dengan berbuat kerusakan yang akan mengakibatkan kerugian dan hal-hal negatif bagi makhluk lainnya. Dan ingatlah pula sikap-sikap yang tidak menyenangkan, yaitu ketika kamu berkata kepada nabi musa, wahai musa! kami sudah tidak tahan lagi bila hanya makan dengan satu macam makanan saja yang tetap dan tidak berubah-ubah yaitu al-mann dan as-salwa', maka mohonkanlah kepada tuhanmu yang maha pemurah untuk kami, agar dia memberi kami yang sudah jenuh dengan makanan yang sama, apa yang ditumbuhkan bumi, seperti: sayur-mayur, mentimun, bawang putih, kacang adas, dan bawang merah. Dia, nabi musa, dengan nada marah, menjawab, apakah kamu meminta sesuatu yang buruk sebagai ganti dari sesuatu yang baik dengan menukar al-mann dan as-salwa' yang merupakan anugerah Allah dengan jenis-jenis makanan yang disebutkan itu' bila itu yang kamu kehendaki, tinggalkanlah tempat ini dan pergilah ke suatu kota yang kamu inginkan, pasti kamu di tempat itu akan memperoleh apa saja sesuai yang kamu minta. Akibat tidak adanya rasa syukur itu, kemudian mereka ditimpa kenistaan dalam hidup dan kemiskinan dari rezeki atau harta, dan mereka selanjutnya kembali mendapat kemurkaan dari Allah yang tidak senang dengan keingkaran mereka. Hal itu, yakni kenistaan dan kemiskinan dapat terjadi karena mereka tidak mau mensyukuri nikmat yang dianugerahkan, bahkan sering mengingkari ayat-ayat Allah yang ada di sekitarnya dan membunuh para nabi tanpa hak atau alasan yang benar. Yang demikian itu sebagai akibat dari sikap dan tingkah laku yang tidak terpuji, selain karena mereka juga selalu durhaka dan melampaui batas dalam segala tindak-tanduknya."
  }
]