[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian tatkala kami menurunkan makanan manis, dan daging burung yang lezat. Maka kalian menolak nikmat besar itu Lalu seperti kebiasaan kalian, dan kalian merasa sempit dan bosan hingga kalian berkata “wahai Musa kami tidak bisa bersabar dengan makanan yang terus sama saja yang tidak berganti-ganti selama sekian hari ini, maka mohonkanlah untuk kami kepada Tuhanmu agar mengeluarkan bagi kami dari bumi berupa tanaman-tanaman sebagai makanan seperti sayur mayur, mentimun, biji-bijian yang dapat dimakan,adas dan bawang merah.” Musa menjawab -dengan nada pengingkaran- Apakah kalian meminta makanan-makanan tersebut yang jelas berkualitas lebih rendah, sedangkan kalian mengabaikan rizki ini yang jelas bermanfaat yang telah dipilihkan Allah bagi kalian? Pergilah dari daerah ini menuju kota mana saja, maka kalian akan mendapatkan apa yang diinginkan dengan jumlah banyak di kebun-kebun dan pasar-pasar.” Maka ketika mereka pergi, jelaslah bagi mereka bahwasanya mereka lebih mengutamakan keinginan pribadi mereka - dalam setiap kesempatan mereka - daripada pilihan Allah. dan lebih mementingkan pemenuhan syahwat mereka dibandingkan apa yang telah Allah pilihkan bagi mereka. Oleh karena itu pastilah penghinaan dan kemiskinan jiwa melekat pada mereka. Mereka pun berpencar dan pulang dengan mendapat amarah dari Allah, karena mereka berpaling dari agama Allah dan juga karena mereka mengingkari ayat-ayat Allah, membunuh para nabi dengan sewenang-wenang dan permusuhan. Dan hal tersebut diakibatkan oleh pelanggaran mereka dan tindakan mereka yang melampaui batas terhadap aturan Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan ingatlah ketika kalian mengingkari nikmat Rabb kalian sehingga kalian bosan memakan makanan yang telah Allah turunkan kepada kalian, yaitu al-manna dan as-salwa. Dan kalian mengatakan, “Kami tidak tahan dengan satu jenis makanan saja dan tidak berganti-ganti.” Lalu kalian meminta kepada Musa -'alaihissalām- agar memohon kepada Allah agar berkenan memberi kalian sayur-mayur, mentimun, biji-bijian, kacang adas dan bawang merah. Musa -'alaihissalām- menjawab permintaan mereka dengan nada heran, “Kalian ingin mengganti al-manna dan as-salwa yang lebih baik dan lebih mulia dengan apa yang kalian minta itu, padahal itu lebih sedikit manfaatnya dan lebih rendah kualitasnya. Sementara kalian bisa mendapatkan al-manna dan as-salwa tanpa harus bekerja keras dan bersusah payah. keluarlah dari daerah ini ke desa manapun, niscaya kalian akan menemukan apa yang kalian minta itu di ladang-ladang dan pasar-pasar.” Dan karena mereka senantiasa mengikuti hawa nafsu dan terus-menerus menolak apa yang Allah pilihkan untuk mereka, akibatnya mereka harus menerima kehinaan, kemiskinan dan kesengsaraan. Mereka mendapatkan murka dari Allah karena mereka berpaling dari agama-Nya, ingkar kepada ayat-ayat-Nya, dan membunuh para nabi-Nya secara semena-mena. Semua itu terjadi karena mereka durhaka kepada Allah dan melampaui batas-batas yang telah ditetapkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Dan ingatlah wahai para keturunan Ya’qub ketika para pendahulu kalian enggan bersyukur, yaitu ketika mereka tidak bersabar atas sedikitnya jenis kenikmatan yang turun kepada mereka tanpa harus berlelah-lelah dan bersusah-payah, sehingga mereka meminta nabi mereka, Musa, untuk berdoa kepada Allah agar memberikan mereka rezeki yang dihasilkan dari tanam-tanaman seperti sayuran, kacang-kacangan, mentimun, gandum, adas, dan bawang. Maka Musa merasa heran terhadap mereka: “Mengapa kalian lebih memilih jenis-jenis makanan ini daripada kenikmatan-kenikmatan yang dikaruniakan kepada kalian? padahal jenis-jenis makanan yang kalian minta itu sangat banyak ditemui di setiap negeri, jika kalian memasuki suatu negeri pertanian pasti kalian akan mendapati apa yang kalian inginkan.” Akibat kesombongan dan keengganan mereka untuk bersyukur, mereka dibalas Allah dengan kehinaan, kemiskinan, dan kemurkaan Allah, sebab mereka mendustakan ayat-ayat-Nya dan membunuh para nabi tanpa alasan yang benar; hal ini karena mereka melanggar perintah-perintah Allah dan menzalimi hak-hak orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. لَنْ نَصْبِرَ عَلَىٰ طَعَامٍ وَاحِدٍ Yakni mereka mengeluhkan perubahan keadaan mereka yang menjadi penuh dengan kenikmatan, rejeki yang baik, dan kehidupan yang nikmat, dan mereka merindukan keadaan mereka sebelumnya yang keras karena mereka telah terbiasa dengan itu. Kemudian merekapun berkata: kami tidak bisa bersabar dengan satu macam makanan saja (al- mann dan as- salwa) karena setiap hari hanya memakan dua makanan itu sebab tidak ada makanan lain yang bisa dibuat ganti. تُنْبِتُ الْأَرْضُ Yakni apa yang ditumbuhkan bumi مِنْ بَقْلِهَا وَقِثَّائِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا (البقل) yakni semua tumbuhan yang tidak mempunyai batang, seperti daun mint, seledri, bawang daun, dan lain sebagainya. Sedangkan (الفوم) adalah bawang putih, dan pendapat lain mengatakan gandum. قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَىٰ بِالَّذِي هُوَ خَيْرٌ Yakni apakah kalian menjadikan makanan-makanan ini sebagai ganti dari al- mann dan as- salwa yang sebenarnya lebih enak dan lebih baik yang keduanya datang langsung dari Allah tanpa perantara makhluk-Nya dan kehalalannya tidak diragukan dan juga mudah didapat tanpa usaha yang melelahkan. اهْبِطُوا مِصْرًا Yakni mereka diizinkan untuk memasuki kota. Namun pendapat lain mengatakan perintah ini untuk menunjukkan kelemahan mereka. فَإِنَّ لَكُمْ مَا سَأَلْتُمْ Yakni kalian akan mendapatkan sayuran, bawang putih dan yang lainnya di kota itu, akan tetapi dengan diliputi rasa takut, kehinaan, dan pembunuhan. وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ Diantaranya dengan keharusan mereka membayar jizyah dan dengan terpencar-pencar ke pelosok bumi. وَبَاءُوا بِغَضَبٍ مِنَ اللَّهِ Yakni berhak mendapatkan kemurkaan Allah ذَٰلِكَ Yakni kehinaan yang telah disebutkan itu tidak lain adalah karena kekufuran mereka kepada Allah dan pembunuhan mereka terhadap para nabi seperti nabi Zakaria dan Nabi Yahya; mereka membunuh nabi-nabi itu padahal mereka mengetahui bahwa mereka menzalimi para nabi tersebut. Mereka juga ingin membunuh nabi Isa, namun Allah mengangkatnya ke langit dan menyelamatkannya dari makar mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ اهْبِطُوا مِصْرًا فَإِنَّ لَكُمْ مَا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ } Janganlah seseorang membandingkan antara kebaikan dan pemberian Allah -عز و جل- dengan kemewahan dunia, dan keridhoan-Nya tidak ada bandinganya dengan keindahan dunia ini !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah wahai kaum Yahudi ketika leluhur kalian berkata: “wahai Musa, kami tidak akan bisa sabar memakan satu jenis makanan yaitu Al-Manna dan As-Salwa saja, karena keduanya berulang-ulang (kami makan) setiap hari, maka memohonlah kepada Tuhanmu untuk kami agar mengeluarkan dari tumbuhan bumi berupa sayur mayurnya, seperti tumbuhan mint, seledri, mentimun, gandum atau bawang putih, kacang adas, dan bawang merah yang paling baik. Lalu Musa berkata: “Apakah kalian meminta sesuatu yang lebih rendah dan remeh untuk menggantikan sesuatu yang lebih baik dan utama, yaitu Al-Manna dan As-Salwa yang keduanya lebih nikmat dan sehat, dan berasal dari sisi Allah tanpa perantara siapapun? Masuklah ke dalam daerah yang melimpah hasil pertaniannya. Di dalamnya terdapat apa yang kalian kehendaki berupa sayur mayur, gandum, dan lain-lain. Kalian akan berada dalam kerendahan, kefakiran, dan ketidakcukupan. Apabila sudah kaya, mereka akan kembali menjadi orang-orang yang layak mendapat murka Allah. Semua itu karena kekafiran mereka kepada Allah SWT dan pembunuhan mereka terhadap para nabi dengan menganiaya dan memisuhi mereka, yang mana hal itu memang tidak dibenarkan, seperti (pembunuhan) nabi Syu’aib, nabi Zakariyah dan nabi Yahya, dan mereka mengetahui kezaliman mereka dengan membunuh para nabi. Hukuman tersebut akibat kemaksiatan mereka terhadap perintah-perintah Allah dan penyerangan mereka terhadap nabi-nabiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika kalian berkata,“Wahai Musa, kami tidak tahan dengan satu macam makanan saja. Berdoalah untuk kami kepada Tuhanmu agar Dia menumbuhkan untuk kami sesuatu yang ditumbuhkan bumi berupa sayur-mayur, mentimun} dan tanaman yang menyerupai mentimun namun lebih panjang {bawang putih} dan benih-benihnya {kacang adas, dan bawang merahnya.” Musa menjawab, “Apakah kamu meminta ganti sesuatu yang lebih buruk} yang lebih rendah dan lebih buruk {sebagai ganti dari sesuatu yang baik} yang lebih mulia dan lebih utama {Turunlah kalian} Turunlah kalian {ke suatu kota} yaitu suatu negeri {maka kalian akan memperoleh apa yang kalian minta.” Kemudian, mereka ditimpa} lalu mereka ditimpa {kenistaan} kehinaan dan kekurangan {dan kemiskinan} kefakiran {dan mereka kembali} mereka kembali {dengan mendapat murka dari Allah. Hal itu karena sesungguhnya mereka selalu mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak (alasan yang benar). Yang demikian itu ditimpakan karena mereka durhaka dan selalu melampaui batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Maksudnya, dan ingatlah kalian (wahai Bani Israil), ”ketika kamu berkata, ” kepada nabi Musa tentang perasaan bosan mereka terhadap nikmat-nikmat Allah dan penghinaan mereka terhadapnya, ”kami tidak bisa sabar (tahan) dengan satu macam makanan saja, ” maksudnya satu jenis makanan saja walaupun sebenarnya seperti yang telah lewat bahwa makanannya bermacam-macam namun tidak berubah, “sebab itu mohonkanlah untuk kami kepada tuhan-Mu , agar Dia mengeluarkan bagi kami dari apa yang ditumbuhkan bumi, berupa sayur-mayurnya, ” maksudnya tumbuh-tumbuhannya yang bukan pepohonan yang tegak diatas kakinya, “ketimunnya” yaitu buah mentimun, ”dan bawangnya” yaitu bawang baik putih maupun merah yang telah diketahui. Maka Musa berkata kepada mereka, “apakah kamu meminta yang rendah, ’ yaitu makanan yang disebutkan, “sebagai pengganti yang lebih baik?” yaitu Manna dan Salwa? Karena yang ini tidaklah cocok dengan kalian, makana yang kalian minta itu terdapat pada suatu kota yang kalian temui dan kalian dapatkan, adapun makanan yang telah Allah anugerahkan kepada kalian merupakan sebaik-baik makanan dan semulia-mulianya, maka bagaimana kalian bisa meminta penggantinya? Dan ketika apa yang terjadi pada mereka itu adalah sebuah isyarat terbesar tentang sedikitnya kesabaran mereka dan penghinaan mereka terhadap perintah-perintah Allah dan nikmat-nikmatNya, maka Allah membalas mereka sesuai dengan perbuatan mereka seraya berfirman, ”Lalu ditimpakanlah kepada mereka nista, ” yang terlihat pada tubuh-tubuh mereka, ”dan kehinaan” pada hati mereka, hingga diri mereka tidak lagi mulia dan tidak pula memiliki cita-cita yang tinggi, akan tetapi jiwa mereka adalah jiwa yang terhina dan cita-cita mereka adalah cita-cita yang paling buruk, ”serta mereka mendapat kemurkaan dari Allah”, maksudnya, bukan hasil baik dan kemenangan yang mereka bawa pulang, tetapi mereka pulang dengan mendapatkan kemurkaan Allah atas mereka, maka sangat jeleklah hasil mereka itu, dan sangat jeleklah kondisi mereka itu. “Hal itu terjadi,” maksudnya yang membuat murka Allah atas mereka adalah “karena mereka selau mengingkari ayat-ayat Allah” yang menunjukkan kepada kebenaran dan yang menjelaskannya kepada mereka, dan ketika mereka mengingkarinya, maka Allah menghukum mereka dengan kemurkaanNya atas mereka, dan juga disebabkan karena mereka “membunuh para nabi tanpa hak (alasan yang benar).” firmanNya, ”tanpa hak (alasan yang benar)” merupakan tambahan celaan, dan bila tidak demikian pun, maka sudah dimaklumi bahwa membunuh para nabi tidak akan terjadi dengan suatu kebenaran, akan tetapi hal itu agar kebodohan dan ketidaktahuan mereka tidak menduga-duga. “Demikian itu (terjadi) karena mereka selalu berbuat durhaka, ” dengan berbuat kemaksiatan kepada Allah, “dan mereka melampaui batas” terhadap hamba-hamba Allah, karena kemaksiatan itu sebagiannya akan menarik sebagian yang lain, kelalaian dapat menimbulkan dosa kecil kemudian tumbuh darinya dosa yang besar kemudia tumbuh lagi darinya berbagai macam bid’ah, kekufuran dan lain-lainnya. Maka kita memohon kepada Allah keselamatan dari setiap malapetaka. Ketahuilah, bahwasanya titah dalam ayat-ayat itu ditunjukkan kepada umat Bani Israil yang ada saat turunnya al-Qur’an, dan perbuatan-perbuatan yang disebutkan diatas juga dijelaskan kepada mereka karena ia adalah perbuatan-perbuatan para pendahulu mereka, dan disandarkan kepada mereka juga, untuk faidah dan manfaatnya yang beragam. Diantaranya : bahwasanya mereka meminta untuk dipiji dan di sucikan serta mengira bahwa mereka lebih utama atas Nabi Muhammad SHOLALLOHU 'ALAIHI WASALLAM dan orang-orang yang beriman kepada beliau, kemudian Allah menjelaskan kepada mereka tentang kondisi para pendahulu mereka yang telah jelas bagi mereka untuk menjelaskan kepada setiap orang dari mereka bahwasanya mereka itu bukan orang-orang yang sabar, tidak berahlak mulia, dan tidak beramal shalih, maka apabila para pendahulu mereka saja kondisinya seperti itu-padahal kesan yang ada bahwa para pendahulu itu lebih utama dan lebih mulia kondisinya daripada orang-orang yang setelah mereka- lalu bagaimanakah persepsi untuk Bani Israil yang mana pesan ayat ini dialamatkan kepada mereka (sejak ayat ini turun hingga sekarang)? Di antara faidahnya , bahwasanya nikmat Allah atas orang-orang terdahulu di antara mereka adalah nikmat yang berkesinambungan hingga generasi yang datang kemudian, nikmat atas para orangtua adalah nikmat atas anak-anak, maka pesan ayat ini diarahkan kepada mereka (yang hidup di zaman nabi hingga sekarang), karena hal itu adalah nikmat-nikmat yang mencakup dan meliputi mereka juga. Di antaranya adalah, bahwasanya pesan ini untuk mereka dengan perbuatan-perbuatan selain mereka, di mana hal ini menunjukkan bahwa suatu umat yang berkumpul dalam suatu agama akan saling menanggung dan saling membantu dalam kemmaslahatan mereka semua, hingga seolah-olah para pendahulu mereka dan orang-orang yang datang belakangan berada dalam satu waktu, dan seolah-olah kejadian dari sebagian mereka itu adalah kejadian dari semuanya; karena kebaikan yang dilakukan oleh sebagian mereka akan kembali dengan semua kemaslahatan dan kejahatan yang di lakukan oleh sebagian mereka akan kembali dengan semua kemudaratannya. Dan di antaranya adalah, bahwasanya perbuatan-perbuatan mereka kebanyakan tidak mereka ingkari, maka orang yang ridha terhadap suatu kemaksiatan adalah penolong bagi pelaku kemaksiatan itu, dan lain sebagainya dari hikmah-hikmah yang tidak kita ketahui kecuali Allah saja (yang mengetahuinya)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { البقل } al-Baqlu : Bentuk jamaknya adalah buquul, segala jenis sayur mayur seperti lobak , sawi, kentang dan yang lain sebagainya. { القثاء } al-Qitssaa’u : mentimun dan yang sejenisnya { الفوم } al-Fuum : yaitu gandum, namun ada juga yang menyebutnya sebagai bawag putih karena terdapat penyebutan al-Bashol (bawang merah) setelahnya. { َ أتَسۡتَبۡدِلُونَ} a tastabdiluuna : ibtidal artinya adalah meninggalkan sesuatu dan mencari yang lain sebagai penggantinya { أَدۡنَىٰ } adna : Lebih sedikit manfaat dan kebaikannya seperti meminta ganti manna dan salwa dengan gandum dan sayur-mayur. { مِصۡرٗا } mishro : Salah satu kota. Disebutkan kepada Bani Israil tatkala mereka tersesat dan berputar-putar di gurun sebagai bentuk hinaan atas ketidakmampuan dan tantangan, karena mereka menolak untuk memerangi kaum Jabarin sehingga mendapatkan musibah berupa tersesat dan berputar-putar di gurun serta diharamkan mendapatkan kebaikan dari kota al-Quds dan tanah Palestina. { ضُرِبَتۡ عَلَيۡهِمُ ٱلذِّلَّةُ } dhuribat ‘alaihimudz dzillah : Mereka diliputi oleh kehinaan serta kerendahan. { وَٱلۡمَسۡكَنَةُ } maskanah : Maknanya adalah kemiskinan dan keterpurukan. { وَبَآءُو بِغَضَبٖ } baa’uu bighodobin : Mereka kembali dari lamanya perbuatan dan banyaknya usaha dengan kemarahan dari Allah dan murka dariNya. Hal itu adalah seburuk-buruk kondisi kembali mereka. { ذَٰلِكَ بِأَنَّهُمۡ } dzaalika biannahum : Dzaalika merupakan isyarat terhadap musibah yang menimpa Bani Israil berupa kehinaan, kefaqiran, dan murka dari Allah karena sebab kekufuran yang mereka lakukan serta pembunuhan terhadap para nabi dan bermaksiat kepada mereka. Huruf ba’ di sini adalah sababiyah (menunjukkan penyebab). { الإعتداء } al-I’tidaa’ : Melampaui batas dari kebenaran menuju kebatilan, dari kebaikan menuju kemungkaran dan dari keadilan menuju kezhaliman. Makna ayat : Kemudian pada ayat (61) Allah Ta’ala mengingatkan mereka atas buruknya akhlak para pendahulu Bani Israil, seperti tidak sabaran, keras kepala, pemikiran yang jelek, tidak menerima kebaikan, sembrono, dan berbagai watak jelek lainnya. Hal ini nampak pada ucapan mereka “Wahai Musa” yang mana mereka selayaknya memanggil “Wahai Nabi Allah atau wahai Rasul Allah” kami tidak bisa bersabar dengan satu jenis makanan saja. Juga ucapan mereka “Berdoalah kepada Tuhanmu untuk kami” dibanding mengucapkan “Berdoalah kepada Allah untuk kami” atau “Berdoalah untuk kami kepada Rabb kami”. Mereka juga merasa bosan memakan daging dan madu sehingga meminta bawang merah dan bawang putih sebagai ganti dari keduanya. Padahal Nabi Musa mengatakan “Apakah kalian ingin mengganti yang sudah baik dengan yang lebih rendah dari itu?” Allah Ta’ala mengingatkan akan kesudahan yang pahit dikarenakan pengingkaran mereka terhadap ayat-ayat Allah, membunuh para nabi, sikap melampaui batas dan mengingkari kebenaran. Sehingga Allah Ta’ala menimpakan kehinaan, keterpurukan, dan kemurkaan dariNya kepada mereka. Semua ini dan yang lainnya, dimana Allah Ta’ala telah mengingatkan Yahudi dalam kitabnya bertujuan agar mereka mengingat dan merenungkan, mengambil pelajaran dan bersyukur sehingga mereka mau beriman kepada Nabi Muhammad ﷺ dan masuk kedalam agama Islam dan merasakan kebahagiaan karena selamat dari kehinaan, keterpurukan dan kemurkaan dari Allah di dunia dan selamat dari adzab neraka di akhirat. Pelajaran dari ayat : • Celaan terhadap akhlak yang buruk dan pelakunya sebagai peringatan dan dijadikan bahan pelajaran • Kutukan terhadap dosa besar seperti kekufuran, membunuh orang yang tidak dibenarkan untuk dibunuh, apalagi membunuh para nabi atau pengikutnya yang mana mereka adalah para ulama dan penyeru keadilan di tengah umat manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 61: Allah menyebutkan kenikmatan yang diberikan kepada mereka bani israil yang bahwasannya Allah sediakan bagi mereka sebaik – baik makanan, akan tetapi mereka menggerusu dan bosan, mereka berkata; Wahai musa kami tidak akan pernah bersabar atas satu macam dari makanan; Pada hal Alla telah memberi kepada mereka seluruh makanan yang mengandung unsur – unsure yang sehat dan mereka meminta kepadanya Musa agar berdoa kepada Allah untuk mengeluarkan tumbuh – tumbuhan kepada mereka, misal: mentimun, bawang putih, adas, dan bawang merah; Musa mengingkari keinginan mereka dan berkata : Bagaimana bisakalian meminta ganti atas makanan – makanan yang buruk atas makanan – makanan yang baik dan bermanfaat, yang Allah telah pilihkan kepada kalian ?!. oleh sebab itu bagi kalian bagi kalian agar segera berpindah dari tempat kalian yang pijak menuju ketempat selain dari negeri ini untuk mendapatkan makanan – makanan yang kalian sukai di ladang dan pasar. maka ketika mereka berpindah maka jelas lah bahwasannya mereka lebih memilih syahwat mereka dibandingkan pilihan allah, oleh sebab ituditimpakan keoada mereka kehinaan dan kemiskinan yang selalu menyertai mereka. mereka berhak mendapatkan kemarahan allh karena sebab dosa – dosa yang banyak diantaranya kejahahtan dan kemasiaktan, diantarnya adalah : kekufuran mereka terhadap ayat – ayat Allah dan merubahnya, membunuh para nabi dengan dzolim dan permusuhan; oleh karena itu mereka di azab dengan azab yang pedih yang menimpa mereka; diantaranya kemaraan Allah, kehinaan dan kemiskinan karena sebab kemaksitan yang mereka perbuat serta menerobos aturan aturan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan sikap bosan dan menganggap rendah tanda tidak bersyukur. Yakni, \"Apakah mereka masih mencari makanan yang lebih rendah nilainya dan meninggalkan rezeki bermanfa'at yang telah dipilihkan Allah Ta'ala untuk mereka?!.\" Kehinaan yang nampak pada zhahir (lahiriah) mereka. Karena lebih mengedepankan hawa nafsu daripada apa yang telah dipilihkan Allah Subhaanahu wa Ta'aala untuk mereka. Karena berpaling dari agama Allah, mengingkari ayat-ayat-Nya bahkan sampai melakukan pembunuhan kepada nabi-nabi mereka. Seperti inilah hati ketika sudah menjadi keras. Ayat-ayat yang ditunjukkan Allah Ta'ala begitu jelas bagi mereka, namun mereka ingkari. Kerasnya hati mereka disebabkan mereka selalu bermaksiat kepada Allah dan melampaui batas terhadap hamba-hamba Allah dengan berbuat zalim kepada mereka. Awalnya sikap lalai yang mengakibatkan jatuh ke dalam dosa-dosa kecil, jika sering dilakukan bisa mengakibatkan dosa-dosa besar dan akhirnya bisa mengakibatkan jatuh ke dalam bid'ah, kekufuran dan penyimpangan lainnya, kita meminta kepada Allah agar dilindungi dari setiap bala'. Perlu diketahui, bahwa ayat ini ditujukan kepada umat Bani Israil yang ada sewaktu diturunkannya Al Qur'an. Tindakan-tindakan Bani Israil yang disebutkan pada ayat-ayat di atas adalah tindakan Bani Israil terdahulu, namun dinisbahkan kepada Bani Israil yang ada pada zaman Nabi shallallahu 'alaihi wa sallam adalah karena beberapa faedah, di antaranya: Pertama, mereka sebelumnya berbangga diri, memuji dan menganggap lebih tinggi di atas umat yang lain, maka Allah mengingatkan bahwa nenek moyang mereka bukanlah orang-orang yang berakhlak mulia, bukanlah orang-orang yang sabar, bahkan biasa bermaksiat. Dengan begitu, mereka tidak berbangga diri lagi. Kedua, nikmat yang diberikan Allah kepada nenek moyang mereka merupakan nikmat juga bagi generasi setelahnya. Ketiga, perbuatan maksiat yang dilakukan oleh mereka (Bani Israil) pada umumnya tidak diingkari, padahal meridhai kemungkaran sama saja ikut serta di dalamnya. Dan faedah lainnya yang begitu banyak yang hanya diketahui oleh Allah Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 61",
    "description": "Dan ingatlah pula sikap-sikap yang tidak menyenangkan, yaitu ketika kamu berkata kepada nabi musa, wahai musa! kami sudah tidak tahan lagi bila hanya makan dengan satu macam makanan saja yang tetap dan tidak berubah-ubah yaitu al-mann dan as-salwa', maka mohonkanlah kepada tuhanmu yang maha pemurah untuk kami, agar dia memberi kami yang sudah jenuh dengan makanan yang sama, apa yang ditumbuhkan bumi, seperti: sayur-mayur, mentimun, bawang putih, kacang adas, dan bawang merah. Dia, nabi musa, dengan nada marah, menjawab, apakah kamu meminta sesuatu yang buruk sebagai ganti dari sesuatu yang baik dengan menukar al-mann dan as-salwa' yang merupakan anugerah Allah dengan jenis-jenis makanan yang disebutkan itu' bila itu yang kamu kehendaki, tinggalkanlah tempat ini dan pergilah ke suatu kota yang kamu inginkan, pasti kamu di tempat itu akan memperoleh apa saja sesuai yang kamu minta. Akibat tidak adanya rasa syukur itu, kemudian mereka ditimpa kenistaan dalam hidup dan kemiskinan dari rezeki atau harta, dan mereka selanjutnya kembali mendapat kemurkaan dari Allah yang tidak senang dengan keingkaran mereka. Hal itu, yakni kenistaan dan kemiskinan dapat terjadi karena mereka tidak mau mensyukuri nikmat yang dianugerahkan, bahkan sering mengingkari ayat-ayat Allah yang ada di sekitarnya dan membunuh para nabi tanpa hak atau alasan yang benar. Yang demikian itu sebagai akibat dari sikap dan tingkah laku yang tidak terpuji, selain karena mereka juga selalu durhaka dan melampaui batas dalam segala tindak-tanduknya. Ayat ini menunjukkan betapa Allah maha pengampun lagi maha pemberi rahmat bagi semua manusia, karena sesungguhnya orang-orang yang beriman, yaitu umat nabi Muhammad, orang-orang yahudi yang merupakan umat nabi musa, orang-orang nasrani yang merupakan umat nabi isa, dan orang-orang Å a'biin, yaitu umat sebelum nabi Muhammad yang mengetahui adanya tuhan yang maha esa dan mempercayai adanya pengaruh bintang-bintang, tentunya siapa saja di antara mereka yang beriman kepada Allah dan hari akhir dengan sebenarbenar iman sebelum diutusnya nabi Muhammad , dan selalu melakukan kebajikan yang memberikan manfaat bagi yang lainnya, mereka pasti akan mendapat pahala dari tuhannya berupa surga, selain itu tidak ada rasa takut pada mereka dalam menghadapi kehidupan di dunia maupun akhirat, dan mereka tidak pula bersedih hati ketika menghadapi beragam cobaan."
  }
]