[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang beriman dari umat ini, yang membenarkan Allah dan rasul-Nya, dan mengamalkan syariat Nya dan orang-orang yang hidup sebelum pengangkatan Muhammad Shallallahu Alaihi Wasallam sebagai nabi dari umat-umat di masa lalu, seperti kaum Yahudi, Nasrani dan kaum shabiin (dan mereka kaum yang masih berada di atas Fitrah bawaan mereka tanpa memiliki ajaran agama baru yang mereka ikuti). Mereka semua itu bila beriman kepada Allah dengan benar lagi murni, dan kepada Hari Kebangkitan dan, Hari pembalasan dan beramal dengan amalan yang diridhoi di sisi Allah. Maka pahala mereka akan tetap utuh bagi mereka di sisi Tuhan, mereka tidak ada rasa takut terhadap mereka berkaitan dengan apa yang akan mereka hadapi dari perkara akhirat, dan mereka tidak bersedih hati karena tidak mendapatkan sebagian kenikmatan dunia. Adapun setelah diutusnya Muhammad Shallallahu Alaihi Wasallam sebagai penutup para nabi dan rasul kepada seluruh umat manusia, maka Allah tidak menerima dari siapapun ajaran agama selain agama yang dibawa beliau yaitu Islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Sesungguhnya orang-orang yang beriman -baik dari umat ini maupun dari umat-umat di masa lalu sebelum kenabian Muhammad -'alaihiṣ ṣalātu was salām-, yakni kaum Yahudi, Nasrani dan Ṣābiah (pengikut beberapa orang nabi yang memiliki keimanan pada Allah dan hari Akhir)- akan mendapatkan ganjaran dari Rabb mereka, tidak ada kekhawatiran bagi mereka atas apa yang akan mereka hadapi di akhirat, dan mereka tidak akan bersedih hati atas kenikmatan dunia yang terlewatkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Sesungguhnya orang-orang yang beriman kepada Allah dan Rasul-Nya, orang-orang Yahudi, Nasrani, dan orang-orang yang keluar dari agama Yahudi dan Nasrani; mereka semua jika beriman kepada Allah dan hari akhir serta melakukan amal shalih, maka bagi mereka pahala atas keimanan dan amal shalih mereka, dan mereka tidak akan ditimpa rasa takut dari siksaan. Namun mereka adalah orang-orang yang berada pada zaman sebelum diutusnya Nabi Muhammad; adapun orang-orang yang berada pada zaman setelah Nabi Muhammad diutus maka mereka diperintahkan untuk beriman kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. إِنَّ الَّذِينَ آمَنُوا Yakni orang-orang beriman, membenarkan Nabi Muhammad Shallallahu ‘Alaihi Wasallamdan menjadi pengikutnya. هَادُوا Yakni orang-orang yang memeluk agama Yahudi. Pendapat lain mengatakan, orang-orang yang bertaubat, yakni bertaubat dari penyembahan anak lembu. وَالنَّصَارَىٰ Dinisbatkan pada desa Nasirah yang ada di Palestina karena Nabi Isa berasal dari daerah tersebut. Pendapat lain mengatakan, diberi nama Nasrani karena mereka menolong Nabi Isa. وَالصَّابِئِينَ Mereka adalah kaum yang keluar dari agama Yahudi dan Nasrani kemudian menyembah malaikat, yang sebagian mereka masih ada di Irak. مَنْ آمَنَ Yakni yang beriman diantara mereka, dari empat golongan tersebut. وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ Diriwayatkan dari Ibnu Abbas: setelah diturunkannya ayat ini kemudian Allah menurunkan ayat: ومن يبتغ غير الإسلام دينا فلن يقبل منه وهو في الآخرة من الخاسرين Barangsiapa mencari agama selain agama Islam, maka sekali-kali tidaklah akan diterima (agama itu) daripadanya, dan dia di akhirat termasuk orang-orang yang rugi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Sesungguhnya orang-orang yang membenarkan Muhammad SAW dan menjadi pengikutnya; orang-orang Yahudi; orang-orang Nasrani yang menyelamatkan Isa AS; dan orang-orang Shabi’ yaitu mereka yang meninggalkan agama Yahudi dan Nasrani, lalu menyembah para malaikat dan bintang bintang, di antara mereka ada perkumpulan mereka di Irak, barangsiapa di antara empat golongan tersebut yang beriman dengan sebenar-benarnya kepada Allah dan hari kiamat, dan melakukan amal shalih yang diperintahkan Allah, niscaya bagi mereka pahala amal shalih mereka di sisi Tuhan pada hari kiamat. Tidak ada ketakutan bagi mereka kepada kengerian kiamat, dan mereka tidak sedih terhadap apa yang meninggalkan mereka di dunia. Ayat ini diturunkan di tempat sahabat-sahabat Salman Al-Farisi. Al-Wahidi dari Mujahid mengatakan: “Ketika Salman Al-Farisi bercerita kepada Rasulallah SAW tentang sahabat-sahabatnya. Beliau bersabda: “Mereka di neraka”, lalu Salman berkata: “Bumi menjadi gelap bagiku”, kemudian turunlah Ayat ini {Innalladziina…} kemudian Salman berkata: “Seakan-akan gunung (kebenaran) telah tampak bagiku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi} orang-orang Yahudi {orang-orang Nasrani, dan orang-orang Sabiin} dan golongan yang tetap pada fitrahnya tanpa ada agama yang mereka anut {Siapa saja (di antara mereka) yang beriman kepada Allah dan hari akhir serta melakukan kebajikan, maka bagi mereka itu pahala dari Tuhannya, tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Hukum ini khusus untuk ahli kitab, karena pada hakikatnya orang-orang shabi’in yang sebenarnya termasuk kelompok-kelompok nasrani. Allah mengabarkan bahwasanya kaum Mukminin dari umat ini, Yahudi, Nasrani dan orang-orang shabi’in yang beriman kepada Allah di antara mereka, juga kepada Hari Akhir, dan mempercayai Rosul-rosul mereka; maka bagi mereka ganjaran yang besar, rasa aman dan tidak ada kekhawatiran atas meteka dan tidak pula mereka bersedih hati. Adapun orang yang kafir di antara mereka kepada Allah, Rosul-rosulNya dan Hari Akhir, tentu berbeda dengan kondisi yang pertama, maka dia ditimpa rasa kekhawatiran dan kesedihan. Yang benar adalah bahwasanya hokum ini adalah antara kelompok-kelompok tersebut menurut latar belakang mereka, dan bukan menurut keimanan kepada nabi Muhammad SHOLALLOHU ‘ALAIHI WASALLAM ini adalah kabar tentang mereka sebelum di utusnya Nabi Muhammad SHOLALLOHU ‘ALAIHI WASALLAM, dan ini adalah kandungan dari kondisi mereka, dan inilah metode al-Qur’an apabila terjadi pada beberapa orang –menurut konteks ayat- beberapa kesamaran, maka sudah seharusnya ada hal yang mampu menghilangkan kesamaran tersebut darinya, karena al-qur’an itu diturunkan oleh Tuhan Yang mengetahui sebelum terjadi, dan rahmatNya mencakup segala sesuatu, hal itu –Allah lebih mengetahui- bahwasanya ketika Allah menyebutkan Bani Israil lalu mencela mereka, dan Dia mengungkapkan kemaksiatan-kemaksiatan dan kejahatan-kejahatan mereka akan terjadi kesamaran pada jiwa beberapa orang yang semuanya termasuk dalam celaan tersebut, maka Allah Sang pencipta menghendaki untuk menjelaskan orang-orang yang tidak termasuk dalam celaan tersebut di antara mereka dengan menyebutkan sifatnya, dan juga ketika Allah menyebutkan Bani Israil secara khusus, maka hal itu membuat kesamaran akan kekhususan mereka, lalu Allah menyebutkan suatu hukum yang bersifat umum yang mencakup seluruh kelompok-kelompok, agar jelaslah kebenaran itu dan hilanglah kesamaran dan kemusykilan tersebut. Mahasuci Allah yang menetapkan dalam kitabNya hal-hal yang membuat akal-akal makhluk terpana. Kemudian Allah ta’ala menyebutkan kembali hinaan terhadap Bani Israil karena apa yang telah dilakukan para pendahulu mereka,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلَّذِينَ ءَامَنُواْ } Aladziina aamanuu : Mereka adalah orang-orang muslim yang beriman kepada Allah dan mentauhidkanNya serta beriman kepada RasulNya dan mengikuti petunjuknya. { ٱلَّذِينَ هَادُواْ } Aladziina haaduu : Mereka adalah orang-orang Yahudi. Dinamakan dengan Yahudi berasal dari ucapan mereka أنا هدنا إليك innaa hudnaa ilaika yang maknanya kami kembali kepadaMu. { ٱلنَّصَٰرَىٰ } an-Nashoro : Mereka kaum pembawa salib. Penamaan Nashoro memiliki dua pendapat, bisa dikarenakan mereka saling tolong menolong (يتناصرون) atau diambil dari nama tempat an-Naashiroh dimana Maryam dan putranya Isa sempat singgah di sana. Bentuk tunggalnya adalah Nashraan atau Nashrani, yang kedua ini adalah yang paling masyhur diucapkan. { ٱلصَّٰبِ‍ِٔينَ } ash-Shoobi’uun : Mereka adalah suatu kaum yang berada di Mosul, meyakini tidak ada sesembahan yang berhak disembah kecuali Allah (Laa ilaha illallah) serta membaca kitab Zabur. Mereka tidak termasuk kelompok Yahudi atau Nasrani. Bentuk tunggalnya adalah Shaabi’. Oleh karena itu orang-orang Quraisy menjuluki orang yang megatakan Laa ilaha illallah sebagai shaabi’, yaitu orang yang melenceng dari agama nenek moyangnya kepada agama baru yang mentauhidkan Allah Ta’ala. Makna ayat : Ayat ini masih dalam konteks dakwah kepada kaum Yahudi agar masuk Islam, sehingga masih cukup relevan untuk diketahui bahwa penamaan atau sebutan tidaklah berarti. Akan tetapi yang dinilai adalah keimanan yang benar serta amalan shalih yang dapat menyucikan dan membersihkan jiwa manusia. Oleh karena itu kaum Muslimin, Yahudi, Nasrani, dan Shaabi’un serta yang lainnya seperti Majusi dan pemeluk agama lain, barang siapa yang beriman di antara mereka kepada allah dan hari akhir dengan sebenar-benarnya iman serta beramal shalih berdasar syariat Allah ta’ala dalam peribadahan, maka tidak ada ketakutan bagi mereka setelah bertaubat serta tidak ada kesedihan saat kematiannya dikarenakan urusan duniawi yang ditinggalkan, karena negeri akhirat lebih baik dan kekal. Keimanan yang benar tidak dapat dimiliki oleh seseorang sampai dia beriman kepada penutup para nabi yaitu Muhammad ﷺ . Beramal shalih tidak dapat dilakukan kecuali dengan tuntunan yang diberikan oleh Nabi yang terangkum dalam al-Qur’an maupun yang diwahyukan kepadanya. Karena dengan syariatnya Allah telah menghapus syariat-syariat sebelumnya, sehingga tidak dapat digunakan lagi untuk menyucikan jiwa dan membersihkannya. Karena kebahagiaan di akhirat tergantung pada kesucian jiwa. Pelajaran dari ayat : • Suatu penilaian didasarkan pada hakikat sebenarnya, bukan hanya melihat kepada pengakuan atau penamaan. Seperti halnya orang munafik yang menyatakan sebagai mukmin ataupun muslim, padahal tidak beriman di dalam hatinya dan berislam pada fisiknya maka hal itu tidak bermanfaat sedikitpun baginya. Orang Yahudi, orang Nasrani maupun orang Shabi’ dan para pemeluk agama yang lain, keterkaitan mereka terhadap agamanya yang telah di naskh (dihapus). Maka amalan shalih yang dilakukan tidak dianggap dan tidak dapat menyucikan dirinya. Penyandaran mereka terhadap agamanya tidak bermanfaat, karena yang bermanfaat baginya hanyalah keimanan yang benar dan amalan shalih. • Seorang yang benar-benar beriman dan istiqomah dalam menjalankan syariat Allah yang lurus diberikan kabar gembira berupa hilangnya rasa takut dan sedih dari mereka. Jika tidak ada rasa takut maka akan merasa aman dan jika hilang kesedihan akan mendapatkan kesenangan dan kebahagiaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 62: Allah mengabarkan bahwasannya mereka yang beriman dari umat ini yaitu umat Muhammad ﷺ dan mereka yang beriman dari umat yang terdahulu; yaitu yahudi pengikut Musa dan Nashara pengikut Isa serta para shabi’in yang mereka diatas agama Ibrahim; yang bahwasannya barang siapa ynag beriman diantara mereka kepada Allah dan hari akhir serta membenarkan para rasul mereka dan beramal dengan amalan sholeh maka sungguh mereka akan mendapatkan balasan yang besar di sisi Allah dan tidak ada rasa takut pada mereka untuk menunggu hari pembalasan dan hisab serta mereka juga tidak beresedih atas apa yang luput dari urusan dunia mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Shabiin ialah orang-orang yang mengikuti syari'at nabi-nabi zaman dahulu. Ada pula yang mengatakan bahwa mereka adalah orang-orang yang menyembah bintang atau dewa-dewa. Dan ada yang mengatakan bahwa mereka adalah orang masih tetap di atas fitrahnya, wallahu a'lam. Orang-orang yang beriman dari kalangan ummat ini, begitu pula orang-orang Yahudi, Nasrani dan Shabiin yang mau beriman kepada Allah, termasuk juga beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam, percaya kepada hari akhir dan mengerjakan amalan yang saleh, maka mereka akan mendapat pahala dari Allah. Disebutkannya ayat ini setelah sebelumnya menerangkan tindakan Bani Israil dan akhlak mereka yang buruk serta celaan kepada mereka di antara faedahnya adalah agar mereka (Bani Israil) tidak berputus asa untuk bertobat dan beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam, yakni jika mereka mau merubah sikap dengan iman (masuk Islam) dan beramal shalih, maka mereka akan memperoleh kemuliaan di dunia dan di akhirat (lihat juga surat Al Maa'idah: 65). Dalam ayat tersebut, Allah juga ingin menerangkan bahwa celaan tersebut hanyalah bagi mereka yang mengikuti jejak nenek moyang mereka yang salah. Dan agar tidak ada kesan bahwa hal ini khusus mereka, maka Allah menyebutkan juga bahwa tidak hanya mereka, bahkan umat yang lain; baik Yahudi, Nasrani, Shaabi'in dan umat lainnya jika mereka sama mau beriman dengan masuk Islam dan mau beramal shalih, maka mereka akan mendapat pahala dari Allah, mereka tidak perlu takut dengan apa yang akan mereka hadapi berupa perkara akhirat, dan tidak perlu bersedih hati terhadap apa saja yang telah berlalu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 62",
    "description": "Ayat ini menunjukkan betapa Allah maha pengampun lagi maha pemberi rahmat bagi semua manusia, karena sesungguhnya orang-orang yang beriman, yaitu umat nabi Muhammad, orang-orang yahudi yang merupakan umat nabi musa, orang-orang nasrani yang merupakan umat nabi isa, dan orang-orang Å a'biin, yaitu umat sebelum nabi Muhammad yang mengetahui adanya tuhan yang maha esa dan mempercayai adanya pengaruh bintang-bintang, tentunya siapa saja di antara mereka yang beriman kepada Allah dan hari akhir dengan sebenarbenar iman sebelum diutusnya nabi Muhammad , dan selalu melakukan kebajikan yang memberikan manfaat bagi yang lainnya, mereka pasti akan mendapat pahala dari tuhannya berupa surga, selain itu tidak ada rasa takut pada mereka dalam menghadapi kehidupan di dunia maupun akhirat, dan mereka tidak pula bersedih hati ketika menghadapi beragam cobaan. Pada ayat yang lalu dijelaskan tentang pahala bagi orang yang beriman. Selanjutnya pada ayat-ayat ini diterangkan tentang pelanggaran bani israil terhadap perjanjian yang diikrarkan dengan tuhan. Karena itu, dalam kaitan dengan sikap dan keingkaran ini, ingatlah ketika kami mengambil janji kamu dengan perantaraan nabi musa agar kamu semua melaksanakan tuntunan syariat yang terdapat dalam taurat, dan kami angkat gunung sinai sejalan dengan kekuasaan kami, atau kami goncangkan gunung itu sehingga seperti akan terangkat di atasmu seraya berfirman, pegang teguhlah apa yang telah kami berikan kepadamu dengan kesungguhan yang sebenarnya dan ingatlah apa yang ada di dalamnya, yakni dalam taurat yang merupakan petunjuk bagi kehidupanmu. Yang sedemikian ini agar kamu bertakwa, dengan selalu melaksanakan semua perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Setelah Allah ta’ala menjelaskan keadaan orang-orang yang menyalahi perintah-Nya, melanggar larangan-Nya, mengerjakan hal-hal yang tidak diizinkan-Nya, dan melakukan hal-hal yang telah diharamkan serta hukuman-hukuman yang ditimpakan kepada mereka. Maka dalam ayat ini Allah memberi penjelasan bahwa siapa saja yang berbuat baik dan mentaati-Nya dari umat-umat terdahulu akan mendapatkan pahala kebaikan. Demikian itu terus berlanjut sampai hari kiamat. Setiap orang yang mengikuti Rosul, Nabi Muhammad sholallohu ‘alaihi wasallam yang ummy (buta huruf) akan memperoleh kebahagiaan abadi, dan tidak merasa hawatir dalam menghadapi apa yang akan terjadi di masa mendatang, juga tidak bersedih atas apa yang mereka tinggalkan dan terluput dari mereka, sebagaimana firman-Nya : أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ \"Ingatlah, sesungguhnya wali-wali Allah itu, tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati.” (QS. Yunus : 62) Juga seperti perkataan Malaikat kepada orang-orang mukmin saat akan dicabut nyawanya : إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ \"sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\" kemudian mereka meneguhkan pendirian mereka, maka malaikat akan turun kepada mereka dengan mengatakan: \"Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu\". (QS. Fushilat : 30) Ibnu Abu Hatim meriwayatkan dari Mujahid mengatakan, “Salman rhodiyallohu ‘anhu bercerita, aku pernah bertanya kepada Nabi Muhammad sholallohu ‘alaihi wasallam mengenai pemeluk suatu agama, yang aku bersama mereka. Lalu aku kabarkan mengenai shalat dan ibadah mereka, maka turunlah firman Allah : إِنَّ الَّذِينَ آَمَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَى وَالصَّابِئِينَ مَنْ آَمَنَ بِاللَّهِ وَالْيَوْمِ الْآَخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ أَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ \"Sesungguhnya orang-orang yang beriman dan orang-orang yahudi dan orang-orang Nasrani dan orang-orang Shabiin, siapa saja diantara mereka yang benar-benar beriman kepada Allah, hari kemudian dan beramal saleh, mereka akan menerima pahala dari Tuhan mereka, tidak ada kekhawatiran kepada mereka, dan tidak (pula) mereka bersedih hati\". Telah berkata As-Suddi, ayat ini diturunkan berkenaan dengan teman-teman salman alfarisi rhodiyallohu ‘anhu. Ketika beliau menceritakan mengenai keadaan teman-temannya kepada nabi sholallohu ‘alaihi wasallam, mak dia berkata, keadaan mereka melaksanakan shaum, sholat, mereka beriman kepadamu, dan bersaksi bahwasanya engkau akan diutus menjadi nabi. Maka ketika Salman selesai menceritakan dan memuji mereka, maka Nabi sholallohu ‘alaihi wasallam berkata ; “wahai Salma, mereka itu ahli neraka”. Mendengar ini Salman merasa berat, maka turunlah ayat ini. Keiman Orang Yahudi adalah berpegang teguh terhadap ajaran Taurot dan sunnahnya nabi Musa ‘alaihi salam sampai datangnya nabi Isa ‘alaihi salam. Maka ketika Nabi Isa ‘alaihi salam datang orang-orang ini wajib mengikutinya, dan barangsiapa yang tidak mengikuti Isa ‘alaihi salam, maka dia adalah orang yang celaka. Keiman orang Nasrani adalah berpegang teguh terhadap ajaran Injil dan syariat nabi Isa ‘alaihi salam dengan keimanan dan penerimaan sampai datang Nabi Muhammad sholallohu ‘alaihi wasallam. Dan barangsiapa diantara mereka yang tidak meninggalkan ajaran injil dan nabi Isa setelah datangnya Nabi Muhammad sholallohu ‘alaihi wasallam, maka dia orang yang celaka. Ibnu katsir mengatakan, ayat ini tidak bertentangan dengan firman-Nya yang lain : وَمَنْ يَبْتَغِ غَيْرَ الْإِسْلَامِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ وَهُوَ فِي الْآَخِرَةِ مِنَ الْخَاسِرِينَ \"Barangsiapa mencari agama selain agama Islam, maka sekali-kali tidaklah akan diterima (agama itu)daripadanya, dan dia di akhirat termasuk orang-orang yang rugi\". (QS. Ali Imron : 85) Karena ayat ini menjelaskan mengenai keadaan orang yahudi dan nasrani yang berpegang teguh terhadap ajaran Taurot dan Injil sebelum datangnya syariat nabi Muhammad sholallohu 'alaihi wasallam. Adapun ayat 85 dari surat Ali Imron menerangkan keadaan setelah datangnya ajaran nabi Muhammad sholallohu ‘alaihi wasallam. Dengan demikian siapapun yang tidak beriman dan mengikuti syariat yang dibawa oleh nabi Muhammad sholallohu ‘alaihi wasallam, maka mereka termasuk orang-orang yang rugi dan akan celaka di akhirat dan akan dimasukan kedalam neraka serta kekal di dalamnya. Kata yahudi diambil dari kata hawadah, artinya kasih saying, atau tawahhud yang berarti taubat. Seperti ucapan Musa ‘alaihi salam “نا هدنا إليك” “seseungguhnya kami kembali kepada-Mu” (QS. Al-A’raf :156). Maksudnya kami taubat. Disebut demikian kemungkinan pada awalanya karena taubat mereka dan kecintaan mereka pada sebagian lainnya. Adapula yang berpendapat dinamai Yahudi karena silsilah keturunan mereka ada hubungan dengan yahuda, putra tertua Nabi Ya’kub ‘alaihi salam. Adapun Nasrani maka mereka adalah para pemeluk dan pengikut ajaran Nabi Isa ‘alaihi salam, dinamai demikian karena mereka saling mendukung dan menolong diantara mereka sebagaimana firman-Nya : فَلَمَّا أَحَسَّ عِيسَى مِنْهُمُ الْكُفْرَ قَالَ مَنْ أَنْصَارِي إِلَى اللَّهِ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ آَمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ \"Maka tatkala Isa mengetahui keingkaran mereka (Bani lsrail) berkatalah dia: \"Siapakah yang akan menjadi penolong-penolongku untuk (menegakkan agama) Allah?\" Para hawariyyin (sahabat-sahabat setia) menjawab: \"Kamilah penolong-penolong (agama) Allah, kami beriman kepada Allah; dan saksikanlah bahwa sesungguhnya kami adalah orang-orang yang berserah diri\". (QS. Ali Imron : 52) Adapula yang mengatakan penamaan nasroni ini kerena mereka mendiami daerah bernama Nashirah. Hal itu dikatakan oleh Qotadah dan Ibnul Juraij dan Ibnu Abbas. Sedangkan mengenai Shobi'in, para ulama berbeda pendapat. Supyan As-sauri berkata “mereka adalah kaum antara majusi yahudi dan nasroni, mereka tidak punya agama” Abul ‘Aliyah berkata “mereka adalah kelompok dari ahlu kitab yang membaca Zabur” Abdurrahman Al-Mahdi mengatakan, saya mendengar al-Hasan menyebutkan Ashobiin dan berkata, “mereka adalah orang yang menyembah Malaikat”. Diantara pendapat yang paling jelas adalah pendapat Mujahid, menurutnya mereka adalah suatu kaum yang tidak memeluk agama Yahudi dan tidak juga beragama Nasroni ataupun Majusi dan bukan pula Musyrikin, tetapi mereka adalah kaum yang masih berada di atas fitrah dan tidak ada agama tertentu yang dianut dan diikutinya. Semua kaum, baik Yahudi, nasrani ataupun Shobiin mereka yang mentaati ajaran nabi mereka dan mengikutinya dengan penuh ketaatan sebelum diutusnya Nabi Muhammad sholallohu ‘alaihi wasallam, maka mereka akan mendapatkan pahalanya. Adapun setelah Allah mengutus Nabi Muhammad sholallohu ‘alaihi wasallam sebagai nabi dan Rosul terahir bagi seluruh anak cucu adam, maka wajib bagi mereka untuk membenarkan apa yang dibawanya, mentaati apa yang diperinyahkannya, dan menjauhi apa yang dilarangnya. Mereka itulah mukmin yang benar-benar beriman."
  }
]