[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah -wahai Bani Israil- ketika kami mengambil janji yang dikukuhkan dari kalian, yaitu kalian beriman kepada Allah dan mengesakan Allah dengan ibadah. Dan kami mengangkat gunung Tursina di atas kepala kalian, dan kami beriman kepada kalian: “ambil Alkitab yang telah kami berikan kepada kalian dengan serius dan sungguh-sungguh serta peliharalah dengan baik. Dan jika tidak maka kami timpakan Gunung itu kepada kalian, dan janganlah kalian melupakan Taurat untuk membaca dan mengamalkannya Agar kalian bertakwa kepada Ku dan takut akan siksaan Ku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Dan ingatlah janji kuat yang Kami ambil dari kalian untuk beriman kepada Allah dan rasul-rasul-Nya. Dan Kami angkat gunung itu di atas kalian untuk menakut-nakuti dan memperingatkan kalian agar tidak mengabaikan janji itu. Kami juga memerintahkan kepada kalian agar memegang teguh kitab Taurat yang telah Kami turunkan kepada kalian. Kalian harus menjalankannya dengan sungguh-sungguh, tidak boleh malas dan gegabah. Hafalkanlah apa yang terdapat di dalamnya dan renungkanlah maknanya agar kalian takut akan siksa Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Allah memperingatkan orang-orang beriman dari pengkhianatan orang-orang Yahudi dalam perjanjian, sifat mereka yang keras kepala, makar mereka terhadap para kekasih Allah, dan perbuatan mereka mengubah kitab Allah. Hal ini sebagaimana apa yang Allah sebutkan dalam 18 ayat yang akan datang ini. Dan ingatlah wahai para keturunan Ya’qub ketika Kami mengambil dari kalian perjanjian yang teguh pada zaman Musa, hingga Kami cabut bukit Thur dan Kami letakkan di atas kepala kalian sebagai ancaman agar kalian membaca dan mengamalkan apa yang ada dalam Taurat dengan penuh semangat dan ketaatan, sehingga kalian dapat melindungi diri kalian dari siksa dan dapat meraih pahala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. وَإِذْ أَخَذْنَا مِيثَاقَكُمْ Ini adalah bagian dari perjanjian kaum Yahudi yang dibuat oleh Allah yakni agar mereka beramal dengan syari’at yang ada dalam taurat dan beriman kepada rasul yang diutus oleh Allah. الطُّورَ Ini adalah nama dari sebuah gunung tempat Allah berbicara dengan Musa. Banyak dari ahli tafsir menyebutkan bahwa ketika Musa datang kepada Bani Israel dengan membawa Alwah (papan-papan) yang tertulis didalamnya kitab taurat, Musa berkata kepada mereka: ambillah Alwah ini, dan berpegang teguhlah padanya. Namun mereka menjawab: kami tidak mau, kecuali jika Allah berbicara dengan kami tentang hal ini sebagaimana berbicara denganmu. Maka Allah memerintahkan malaikat agar mencabut gunung yang ada di Palestina sehingga menjadikannya seperti paying yang menaungi. خُذُوا مَا آتَيْنَاكُمْ بِقُوَّةٍ Yakni dengan penuh kesungguhan dan perhatian dan berjanjilah untk tidak menyia-yiakannya jika tidak maka gunung ini akan menimpa kalian. Merekapun sujud dan bertaubat kepada Allah dan mengambil taurat dengan janji tersebut. وَاذْكُرُوا مَا فِيهِ Yakni agar senantiasa terjaga untuk bisa mereka ajarkan dan amalkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah wahai Bani Israil, ketika kami mengambil atas kalian janji yang dikuatkan dengan perbuatan sesuai yang tercantum dalam Taurat. Kami angkat di atas kalian gunung Thur di mana Tuhan menyampaikan wahyu kepada Musa di atasnya, lalu kami berfirman kepada kalian: “Peganglah dengan sungguh-sungguh dan serius apa yang kami perintahkan dalam Taurat, pelajarilah dan pahamilah apa yang ada di dalamnya agar kalian mewaspadai siksaKu dan mendapatkan keridhaanKu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan (Ingatlah) ketika Kami mengambil janji kalian} janji kalian {dan Kami angkat gunung Sinai di atasmu} gunung {(seraya berfirman), “Peganglah apa yang telah Kami berikan kepada kalian} Kami mewajibkan kepada kalian atas sesuatu yang ada dalam kitab {dengan kuat} dengan serius dan sungguh-sungguh {dan ingatlah} jagalah dan pelajarilah {apa yang ada di dalamnya agar kalian bertakwa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Maksudnya, dan ingatlah kalian, ”ketika Kami mengambil janji darimu, ” yakni jan ji yang kuat lagi kokoh dengan menakut-nakuti mereka dengan mengangkat gunung di atas mereka, dan dikatakan kepada mereka, “peganglah apa yang kami berikan kepadamu,” dari Taurat “dengan teguh” yaitu dengan semangat dan usaha yang kuat serta kesabaran atas perintah-perintah Allah, ” dan ingatlah selalu apa yang ada di dalamnya, ” yaitu apa yang ada di dalam kitab suci kalian dengan cara membaca dan mempelajarinya, “agar kamu bertakwa, ” pada azab Allah dan murkaNya atau agar kalian menjadi golongan orang-orang yang bertakwa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الميثاق } al-Miitsaaq : Perjanjian yang diperkuat dengan sumpah { ٱلطُّورَ } ath-Thuur : Sebuah bukit yaitu bukit yang menjadi tempat Nabi Musa bermunajat kepada Allah Ta’ala. { بِقُوَّةٖ } biquwwatin : Dengan sungguh-sungguh, serius, teguh Makna ayat : Allah Ta’ala menceritakan kejadian yang menimpa generasi Yahudi terdahulu mengenai kejadian yang terjadi, mudah-mudahan mereka dapat mengambil pelajaran. Allah Ta’ala mengingatkan orang-orang Yahudi tentang kejadian tatkala mereka tidak mau untuk mengambil tanggung jawab mengamalkan kitab Taurat dan terus menerus seperti itu sampai Allah mengangkat gunung Tursina di atas mereka, gunung itu seakan-akan siap dijatuhkan di atas kepala mereka. Pelajaran dari ayat : • Kewajiban menepati pernjanjian dan kesepakatan. • Kewajiban mengambil hukum syariat dengan penuh keteguhan, mengingatnya, serta tidak melupakan atau pura-pura lupa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 63: Kemudian Allah menyebutkan tentang bani israil yang terikat dengan amalan atas apa yang Allah syariatkan bagi mereka didalam taurat berserta keimanan dengan para rasul-Nya, kemudian Allah takuti nereka dengan diangkatnya gunung Thur sampai menaungi diatas kepala – kepala mereka, Allah memerintakan untuk bersungguh- sungguh didalam menerapkan Taurat dan jika tidak maka mereka akan dijatuhi gunung tersebut; Allah memerintahkan mereka agar berpegang teguh dengan Taurat secara ucapan dan perbuatan dan agar mereka menjaganya dan beramal denganapa yangada didalam Taurat, Agar mereka dijauhkan dari azab Allah dan kemarahannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Janji untuk beriman kepada Allah dan hanya beribadah kepada-Nya. Jika mereka menolak, maka akan ditimpakan kepada mereka gunung tersebut. Yakni bersungguh-sungguh dan bersabar menjalankan perintah Allah Azza wa Jalla. Perintah kepada mereka untuk membaca dan mengamalkan isi Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 63",
    "description": "Pada ayat yang lalu dijelaskan tentang pahala bagi orang yang beriman. Selanjutnya pada ayat-ayat ini diterangkan tentang pelanggaran bani israil terhadap perjanjian yang diikrarkan dengan tuhan. Karena itu, dalam kaitan dengan sikap dan keingkaran ini, ingatlah ketika kami mengambil janji kamu dengan perantaraan nabi musa agar kamu semua melaksanakan tuntunan syariat yang terdapat dalam taurat, dan kami angkat gunung sinai sejalan dengan kekuasaan kami, atau kami goncangkan gunung itu sehingga seperti akan terangkat di atasmu seraya berfirman, pegang teguhlah apa yang telah kami berikan kepadamu dengan kesungguhan yang sebenarnya dan ingatlah apa yang ada di dalamnya, yakni dalam taurat yang merupakan petunjuk bagi kehidupanmu. Yang sedemikian ini agar kamu bertakwa, dengan selalu melaksanakan semua perintah-Nya dan menjauhi larangan-Nya. Pada awalnya kamu, bani israil, taat dengan ajakan Allah melalui nabi musa ini, namun kemudian setelah itu, yaitu pada saat kamu semua tidak lagi merasakan murka-Nya, kamu berpaling dan tidak lagi menaati ajaran ini. Maka sekiranya bukan karena karunia Allah berupa anugerah yang lebih dari semestinya dan bukan pula karena rahmat-Nya kepadamu dengan selalu membuka pintu tobat, pasti kamu akan langsung diazab karena keingkaran yang kamu perbuat. Bila ini terjadi, sudah pasti kamu semua termasuk orang yang rugi di dunia maupun di akhirat."
  }
]