[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kalian melanggar dan bermaksiat lagi, setelah diambilnya perjanjian dan diangkatnya gunung tersebut sebagaimana sifat kebiasaan kalian yang terus menerus. Maka kalaulah bukan karena kemurahan Allah terhadap kalian dan rahmatnya untuk menerima Taubat, dan memaafkan dosa-dosa kalian, pastilah kalian akan termasuk orang-orang yang merugi dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Akan tetapi kalian justru berpaling dan membangkang setelah mengambil perjanjian yang kuat tersebut. Sekiranya bukan karena anugerah Allah yang berkenan mengampuni kalian dan tidak ada rahmat-Nya yang berkenan menerima taubat kalian, niscaya kalian benar-benar tergolong orang-orang yang merugi, karena kalian telah berpaling dari-Nya dan durhaka kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Namun kemudian kalian mencampakkan perjanjian dan ancaman itu. Kalaulah bukan karena kelembutan Allah dan penangguhan azab bagi kalian niscaya kalian telah binasa di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. ثُمَّ تَوَلَّيْتُمْ Yakni berpaling dari perjanjian yang mereka ambil. مِنْ بَعْدِ ذَٰلِكَ Yakni setelah diangkatnya gunung diatas kepala mereka seakan-akan paying yang menaungi. فَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ yakni dengan kelembutan dan rahmat-Nya hingga kalian mau bertaubat, kalaulah bukan karena itu semua niscaya kalian akan menjadi orang-orang yang merugi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian kalian berpaling dari janji yang telah kalian sepakati dan meninggalkan amal yang diperintahkan kepada kalian setelah janji itu dan pengangkatan gunung itu di atas kepala kalian, seakan-akan menaungi kalian. Jika kalian tidak menyadari kelembutan Allah dan kasih sayangNya kepada kalian dengan menolong kalian supaya bertaubat dan mengumumkan taubat kalian, sungguh kalian termasuk orang-orang yang dihancurkan dalam siksa yang amat pedih dan menyakitkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian kalian berpaling} kalian berpaliang {setelah itu, seandainya bukan karena karunia dan rahmat Allah kepada kalian, pasti kalian termasuk orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Dan setelah penegasan yang kuat ini, ”kemudian kamu berpaling, ” dan kalian meninggalkan hal itu, padahal ia mengakibatkan kalian tertimpa hukuman yang paling berat, akan tetapi “kalau tidak ada karunia Allah dan rahmatNya atasmu, niscaya kamu tergolong orang-orang yang rugi.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { تَوَلَّيۡتُم } tawallaitum : Kalian berbalik arah dari hal yang kalian janjikan berupa mengamalkan isi kitab Taurat Makna ayat : Maka saat itulah mereka tunduk, akan tetapi setelah itu mereka berbalik arah kembali dan tidak mau mengamalkan apa yang dijanjikan untuk mengamalkan Taurat. Akhirnya mereka mendapat kehinaan dan kerugian andai saja bukan karena rahmat Allah kepada mereka. Pelajaran dari ayat : • Kewajiban mengambil hukum syariat dengan penuh keteguhan, mengingatnya, serta tidak melupakan atau pura-pura lupa. • Tidak sempurna ketakwaan seorang hamba jika tidak mengambil hukum-hukum syariat secara tegas dan sungguh-sungguh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 64: Kemudian Allah menjelaskan bahwasannya bani israil menyelishi perjanjian yang disepakati oleh mereka,mereka juga menyelisihi perintah Allah dan bermaksiat kepada-Nya,maka sekira Allah tidak memberikan karunia atas mereka dan kasih sayang-Nya,yaitu menelantarkan mereka serta tidak menyegerakan azab kepada mereka, maka sungguh mereka orang – orang yang merugi di dunia dan di akhirat. mereka lupa bahwasannya ketakutan mereka karena sebab gunung diatas kepala mereka yang sewaktu waktu mampu kembali pada kali yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka berpaling untuk kesekian kalinya. Kalau bukan karena karunia Allah dan rahmat-Nya yang memberikan taufiq untuk bertobat dan mengampuni kesalahan-kesalahan mereka tentu mereka termasuk orang-orang yang rugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 64",
    "description": "Pada awalnya kamu, bani israil, taat dengan ajakan Allah melalui nabi musa ini, namun kemudian setelah itu, yaitu pada saat kamu semua tidak lagi merasakan murka-Nya, kamu berpaling dan tidak lagi menaati ajaran ini. Maka sekiranya bukan karena karunia Allah berupa anugerah yang lebih dari semestinya dan bukan pula karena rahmat-Nya kepadamu dengan selalu membuka pintu tobat, pasti kamu akan langsung diazab karena keingkaran yang kamu perbuat. Bila ini terjadi, sudah pasti kamu semua termasuk orang yang rugi di dunia maupun di akhirat. Ayat ini menjelaskan tentang sikap dan keingkaran bani israil. Sejalan dengan hal itu, Allah menegur dan memurkai mereka. Sungguh, kamu, wahai bani israil, telah mengetahui hukuman yang diterima oleh orang-orang yang melakukan pelanggaran di antara kamu dengan tetap mencari ikan pada hari sabat, yakni hari sabtu, hari khusus untuk beribadah bagi orang yahudi, padahal kamu semua sudah sepakat untuk menjadikannya sebagai hari ibadah dan tidak melakukan pekerjaan lain. Karena itu lalu kami katakan kepada mereka, jadilah kamu kera yang hina. Pada saat itu berubahlah fisik dan atau sikap mereka seperti kera."
  }
]