[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kalian -wahai sekalian kaum Yahudi- telah mengetahui hukuman yang menimpa para pendahulu kalian dari penduduk negeri itu yang bermaksiat kepada Allah, berkaitan dengan janji yang telah Dia ambil dari mereka untuk mengagungkan hari Sabtu, tetapi mereka membuat tipu muslihat untuk bisa menangkap ikan pada hari Sabtu dengan memasang jaring-jaring dan menggali kolam, kemudianmenangkap ikan itu pada hari Ahad, sebagai tipu muslihat untuk melakukan perbuatan yang diharamkan. Maka setelah mereka melakukan itu, Allah mengubah bentuk mereka menjadi monyet yang hina."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Dan sungguh kalian benar-benar mengetahui dengan jelas berita tentang para pendahulu kalian. Mereka telah melanggar ketentuan Allah dengan berburu ikan pada hari Sabtu yang terlarang bagi mereka. Mereka membuat rekayasa atas larangan itu dengan cara memasang jala sebelum hari Sabtu dan berburu ikan pada hari Ahad. Maka Allah merubah wujud mereka menjadi kera yang hina sebagai hukuman karena merekasaya ketentuan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Sungguh kalian telah mengetahui kejahatan para pendahulu kalian yang mereka lakukan di kota Eilat -yang terletak di utara Laut Merah semenanjung Aqabah-. Mereka melanggar perintah Allah ketika Dia melarang mereka menangkap ikan pada hari Sabtu, namun mereka melanggar perintah itu, sehingga Allah menghukum mereka di dunia dengan dikutuk menjadi kera yang hina. Dan kutukan ini merupakan kenyataan, bukan suatu majas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنْكُمْ فِي السَّبْتِ Yakni orang-orang Yahudi dari negeri Aylah (negeri dekat laut). Dulunya orang-orang Yahudi diperintahkan untuk beristirahat dan tidak berkerja di hari sabtu, namun mereka membuat tipu daya agar bisa berburu ikan pada hari itu. Kisah ini akan diceritakan di surat al-A’raf: 162-166 secara terperinci. فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ Yakni diubah menjadi kera dengan keadaan terusir dan hina."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini menjelaskan hikmah penyesuaikan dosa dengan akibatnya, dosa yang mereka lakukan sebenarnya hal yang terlihat biasa, tetapi hakikatnya tidak boleh, adapun akibat yang mereka terima yaitu menjadi kera yang seakan-akan kera yang bersifat manusia, tetapi bukan demikian. Hal ini dikarenakan balasan sesuai dengan perbuatan yang dilakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai orang-orang Yahudi! Sungguh kalian telah mengetahui urusan leluhur kalian dan mereka adalah orang-orang Yahudi Eilat yang menentang perintah Allah. Mereka mencari ikan pada hari Sabat, yang mana (perbuatan itu) dilarang untuk dilakukan karena waktu Ibadah sesuai syariat Musa AS pada hari itu sedikit. Mereka licik dalam hal itu dengan mendirikan kolam-kolam pada hari jum’at agar bisa meletakkan ikan-ikan di dalamnya sesuai fase pasang-surut air laut. Kemudian mereka berubah menjadi monyet dan menjadi hina, remeh, dijauhi dan diasingkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar telah mengetahui orang-orang yang melewati batas di antara kalian} orang-orang yang melewati batas di antara kalian dengan mencari ikan {pada hari Sabat} hari Sabtu {lalu Kami katakan kepada mereka,“Jadilah kalian kera yang hina”} yang terbuang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Maksudnya, sungguh telah jelas bagi kalian sebuah kondisi, “orang-orang yang melanggar di antaramu pada hari sabtu, ” dan mereka itulah yang disebutkan oleh Allah tentang kisah mereka secara terbuka dalam surat al-A’raf ayat 63. “Dan tanyakanlah kepada Bani Israil tentang negeri yang terletak di dekat laut ketika mereka melanggar aturan pada hari Sabtu, di waktu datang kepada mereka ikan-ikan (yang berada di sekitar) mereka terapung-apung di permukaan air, dan di hari-hari yang bukan Sabtu, ikan-ikan itu tidak datang kepada mereka. Demikianlah Kami mencoba mereka disebabkan mereka berlaku fasik.” (QS. al-A’raf : 63) Lalu dosa besar itu berkonsekuensi mendatangkan murka Allah atas mereka dan Allah menjadikan mereka, “kera yang hina’ dina dan tercela, dan Allah menjadikan hukuman ini,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱعۡتَدَوۡاْ فِي ٱلسَّبۡتِ } I’tadau fis sabti : Kalian melampaui batas dari aturan yang sudah ditetapkan, yaitu diharamkan mencari ikan dihari Sabtu namun kalian melakukannya { قِرَدَةً } qirodatan : al-Qirodah merupakan bentuk jamak dari qirdun (monyet). Hewan yang sudah diketahui. Allah mengutuk orang-orang yang melanggar aturan berburu ikan pada hari Sabtu menjadi monyet. { خَٰسِ‍ِٔينَ } Khoosi’iin : Menjauh dari kebaikan menjadi orang-orang yang dihinakan. Makna ayat : Kemudian Allah Ta’ala mengingatkan tentang kejahatan yang dibuat sebagian pendahulu merka. Yaitu bahwa Allah Ta’ala mengharamkan mereka berburu di hari Sabut. Sebagian bermain-main dengan hukum syariat dan tetap berburu. Maka Allah menurunkan adzabNya kepada mereka dan mengutuk mereka menjadi kera. Pelajaran dari ayat : • Keharaman melakukan rekayasa untuk menghalalkan sesuatu yang diharamkan serta buruknya kesudahan orang-orang yang merekayasa dan melampaui batas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 65: Allah mengabarkan tentang kisah Ahli Aylah, Allah berkata sungguh kalian telah mengetahui wahai para yahudi tentang kisah Aylah yang mereka bermaksiat perintah Allah dan mereka menyombongkan diri untuk berburu ikan dihari sabtu yang telah diharamkan atas mereka berburu di hari tersebut; Dimana mereka sombong dengan menggalang/untuk berburu ikan sebelun hari sabtu. dan pada hari sabtunya ikan masuk dalam jaring tersebut kemudian mereka meninggalnya sampai datang hari minggu kemudian mereka memburunya, maka allah menghukum mereka atas perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hari Sabat ialah hari Sabtu, hari khusus bagi orang yahudi untuk beribadah, bukan untuk bekerja; namun mereka memanfaatkannya untuk menjaring ikan. Mereka siapkan jaring dan menggali sebuah galian untuk mereka ambil pada hari Ahadnya sebagai helat (cara meloloskan diri dari larangan dengan niat yang buruk). Kisahnya bisa dibaca dalam surat Al A'raaf: 163. Jumhur mufassir menafsirkan bahwa mereka betul-betul berubah menjadi kera, hanyasaja tidak beranak, tidak makan dan minum, dan hidupnya tidak lebih dari tiga hari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 65",
    "description": "Ayat ini menjelaskan tentang sikap dan keingkaran bani israil. Sejalan dengan hal itu, Allah menegur dan memurkai mereka. Sungguh, kamu, wahai bani israil, telah mengetahui hukuman yang diterima oleh orang-orang yang melakukan pelanggaran di antara kamu dengan tetap mencari ikan pada hari sabat, yakni hari sabtu, hari khusus untuk beribadah bagi orang yahudi, padahal kamu semua sudah sepakat untuk menjadikannya sebagai hari ibadah dan tidak melakukan pekerjaan lain. Karena itu lalu kami katakan kepada mereka, jadilah kamu kera yang hina. Pada saat itu berubahlah fisik dan atau sikap mereka seperti kera. Selanjutnya, untuk menimbulkan efek jera, maka kami jadikan yang demikian itu, yaitu hukuman atau kutukan menjadi kera, sebagai peringatan bagi orang-orang pada masa itu, yaitu orang-orang yahudi, dan bagi mereka yang datang kemudian, termasuk juga umat nabi Muhammad, serta secara khusus menjadi pelajaran penting dan mesti diperhatikan bagi orang-orang yang bertakwa."
  }
]