[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami jadikan kampung itu menjadi pelajaran bagi penghuni kampong-kampung yang ada di sekitarnya, yang sampai kepada mereka berita dana pa yang menimpanya, dan menjadi pelajaran juga bagi siapa saja yang melakukan dosa sesudah mereka yang serupa dengan dosa itu, serta kami menjadikannya sebagai pengingat bagi orang-orang shaleh, agar mereka mengetahui bahwa mereka itu berada di atas jalan kebenaran hingga mereka dapat teguh berada di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Maka Kami jadikan desa yang melampaui batas ini sebagai pelajaran bagi desa-desa yang ada di sekitarnya, dan juga pelajaran bagi generasi berikutnya sehingga mereka tidak mengikuti jejak para pendahulu mereka dan mendapatkan hukuman yang sama. Dan Allah juga menjadikan desa itu sebagai peringatan bagi orang-orang bertakwa yang senantiasa takut akan hukuman dan balasan dari Allah bagi orang yang melanggar batas-batas yang telah ditentukan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Maka Kami jadikan kutukan yang terjadi di kota Eilat itu sebagai pelajaran bagi orang-orang di zaman mereka dan orang-orang setelah mereka, serta sebagai peringatan bagi orang-orang yang takut terhadap siksaan dan berharap kepada pahala dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. فَجَعَلْنَاهَا Yakni kami jadikan negeri Aylah tempat terjadinya hal tersebut نَكَالًا Peringatan dan hukuman. لِمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا Yakni penghuni negeri didepan di belakang negeri Aylah وَمَوْعِظَةً لِلْمُتَّقِينَ Yakni pelajaran untuk orang-orang yang datang setelahnya hingga hari kiamat apabila mengingat azab yang menimpa orang-orang Yahudi ketika itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Lalu kami menjadikan hukuman yang berbeda bagi wilayah Eilat sebagai pelajaran bagi wilayah-wilayah lain di sekelilingnya pada periode yang sama agar tidak melakukan hal yang serupa. Ketika hal itu didatangkan setelah (periode itu), maka itu digunakan sebagai pengingat bagi orang-orang mukmin agar lebih bertakwa, yaitu orang-orang yang datang setelah mereka sampai hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka Kami jadikan itu sebagai peringatan} maka Kami menjadikan umat yang melewati batas pada hari Sabtu itu sebagai peringatan {bagi orang-orang pada masa itu} bagi orang-orang dari beberapa umat yang ada pada masa itu dan menerima kabar tersebut {dan bagi mereka yang datang setelahnya} dan orang-orang dari beberapa umat yang ada setelah kejadian itu {serta menjadi pelajaran bagi orang-orang yang bertakwa} dan pengingat bagi orang-orang yang takut kepada Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. “peringatan bagi orang-orang di masa itu, ” yaitu bagi orang yang ada di antara umat-umat itu, dan sampai kabar tentang mereka kepadanya di antara orang yang ada pada masa itu, ”dan bagi mereka yang datang kemudian, ” maksudnya orang yang setelahnya, hingga tegaklah hujjah Allah atas hamba-hambaNya, dan agar mereka menghindari kemaksiatan kepadaNya, akan tetapi hal ini bukanlah merupakan suatu nasihat yang berguna kecuali bagi orang-orang yang bertakwa. Adapun orang-orang yang selain mereka, maka mereka tidak mengambil manfaat dari ayat-ayat tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { نَكَٰلٗا } nakaalan : Hukuman dahsyat yang membuat orang yang melihatnya atau mengalaminya menjadi jera dan tidak melakukannya. { لِّمَا بَيۡنَ يَدَيۡهَا وَمَا خَلۡفَهَا } Limaa baina yadaihaa wa maa kholfahaa : menjadi peringatan bagi orang yang hidup pada saat itu dan orang-orang setelahnya. { وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ } wa mau’idzotan lil muttaqin : Dapat diambil pelajaran oleh orang-orang yang bertakwa sehingga tidak akan mendekati kemaksiatan kepada Allah Ta’ala. Makna ayat : Allah Ta’ala mengingatkan tentang kejahatan yang dibuat sebagian pendahulu merka. Yaitu bahwa Allah Ta’ala mengharamkan mereka berburu di hari Sabut. Sebagian bermain-main dengan hukum syariat dan tetap berburu. Maka Allah menurunkan adzabNya kepada mereka dan mengutuk mereka menjadi kera. Hal itu agar dapat diambil pelajarannya bagi orang-orang yan mau merenunginya. Pelajaran dari ayat : • Buruknya akibat yang diterima oleh orang-orang yang merekayasa dan melampaui batas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 66: Kemudian Allah mengabarkan bahwasanya Allah menjadi suatu negeri tertimpa azab sebagai pelajaran dan peringatan bagi siapa yang menyaksikannya dan mendengar, bagi siapa yang datang setelahnya yaitu siapa yang meinginkan perbuatan mereka dengan perbuatan yang semisal, dan kabar tersebut sudah merupakan nasehat dan peringatan bagi orang – orang sholeh lagi bertaqwa serta seluruh manusia dalam kurun masa dan zaman setelahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga hujjah telah tegak dan agar mereka tidak bermaksiat kepada-Nya. Sehingga mereka dapat bersabar di atas ketakwaan, dan peringatan itu hanya bermanfa'at bagi orang-orang yang bertakwa saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 66",
    "description": "Selanjutnya, untuk menimbulkan efek jera, maka kami jadikan yang demikian itu, yaitu hukuman atau kutukan menjadi kera, sebagai peringatan bagi orang-orang pada masa itu, yaitu orang-orang yahudi, dan bagi mereka yang datang kemudian, termasuk juga umat nabi Muhammad, serta secara khusus menjadi pelajaran penting dan mesti diperhatikan bagi orang-orang yang bertakwa. Pada ayat-ayat yang lalu dijelaskan tentang keingkaran bani israil terhadap perintah Allah, sedang pada ayat-ayat berikut diterangkan keingkaran mereka terhadap perintah nabi musa. Dan ingatlah ketika musa berkata kepada kaumnya yang meminta agar ia memohon pada tuhan agar memberi solusi dari masalah pembunuhan di kalangan mereka, Allah memerintahkan kamu agar menyembelih seekor sapi betina, yang dimaksudkan agar mereka menghapus sisa syirik karena pernah menyembah anak sapi dan siap kembali pada akidah yang benar. Perintah ini dinilai sebagai bentuk ketidakseriusan musa, karena itu mereka bertanya, apakah engkau akan menjadikan kami sebagai ejekan' pertanyaan ini sungguh tidak pada tempatnya, karena mereka tahu sifat musa yang tidak pernah main-main. Dengan sikap prihatin, dia, musa, menjawab, aku berlindung kepada Allah agar tidak termasuk orang-orang yang bodoh yang sering menjadikan ajaran agama sebagai permainan."
  }
]