[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah -wahai Bani Israil- tindakan kejahatan para pendahulu kalian, dan banyaknya pembangkangan mereka serta debat mereka kepada Musa alaihi salam, tatkala Dia berkata kepada mereka “Sesungguhnya Allah memerintahkan kepada kalian untuk menyembelih seekor sapi betina”, mereka menjawab dengan nada Sombong “apakah kamu mau menjadikan kami bahan olokan dan ejekan”. Maka Musa menjawab dengan berkata “aku memohon perlindungan kepada Allah agar tidak termasuk orang-orang yang mengolok-olok”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dan ingatlah apa yang terjadi antara para pendahulu kalian dengan Musa -'alaihissalām- ketika dia menyampaikan kepada mereka bahwa Allah telah memerintahkan mereka agar menyembelih seekor sapi betina. Tetapi mereka bukannya segera melaksanakan perintah itu, melainkan justru berkata dengan angkuh, “Apakah engkau menjadikan kami sebagai sasaran olok-olok?!” Musa menjawab, “Aku berlindung kepada Allah dari menjadi orang bodoh yang berdusta atas nama Allah dan mengolok-olok orang banyak.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Dan ingatlah ketika Musa berkata kepada kaumnya, Bani Israil: \"Sesungguhnya Allah telah memrintahkan kalian untuk menyembelih sapi betina.\" Perintah ini untuk menyingkap pembunuh yang membunuh salah seorang dari mereka. Musa meminta mereka untuk menyembelih sapi betina mana saja, namun mereka memberatkan diri dan mengingkari Musa dengan penuh kesombongan, mereka berkata: \"Hai Musa, Apakah kamu ingin mengolok-olok kami?\" Maka Musa menjawab: \"Aku berlindung dari Allah dari menjadi orang-orang bodoh yang mengolok-olok hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تَذْبَحُوا بَقَرَةً ۖ Perkataan ini dikatakan Musa kepada kaumnya setelah terbunuhnya salah satu dari kaumnya namun si pembunuh belum diketahui. Merekapun bersengketa dihadapan Musa sebagaimana yang akan dijelaskan pada empat ayat setelah ini. قَالُوا أَتَتَّخِذُنَا هُزُوًا ۖ (الهزو) yakni permainan dan hinaan قَالَ أَعُوذُ بِاللَّهِ أَنْ أَكُونَ مِنَ الْجَاهِلِينَ Yakni bagaimana aku menisbahkan suatu perintah yang tidak diperintahkan oleh Allah, sungguh yang melakukakan hal yang demikian adalah orang yang bodoh, karena itu merupakan suatu yang sia-sia yang tidak dilakukan oleh orang yang berakal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ingatlah wahai Bani Israil, ketika Musa berkata kepada kaumnya: “Sesungguhnya Allah memerintahkan kalian untuk menyembelih sapi betina untuk mengetahui pembunuh orang kaya yang mandul dan tidak memiliki apapun kecuali satu-satunya pewaris yaitu anak dari saudara laki-lakinya. Dia membunuhnya agar mendapatkan warisannya, kemudian membuangnya di depan pintu rumah seorang laki-laki Yahudi, lalu dia memberitahukan kematian orang tua itu kepada mereka. Sebagaimana yang diriwayatkan oleh Hatim dari Ubaidah As-Salmani bahwa mereka berkata kepada Musa: “Apakah kamu mengolok-olok dan mengejek kami?”. Lalu Musa berkata: “Aku berlindung kepada Allah agar tidak termasuk orang-orang bodoh yang berbohong dengan membawa nama Allah, lalu bagaimana bisa aku menyampaikan perintah yang bahkan tidak Dia perintahkan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan (Ingatlah) ketika Musa berkata kepada kaumnya, “Allah memerintahkan kalian agar menyembelih seekor sapi.” Mereka bertanya, “Apakah engkau akan menjadikan kami sebagai ejekan?”} bahan ejekan {Musa menjawab, “Aku berlindung kepada Allah agar tidak termasuk orang-orang yang jahil.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Maksudnya, dan ingatlah kalian apa yang terjadi pada kalian bersama Musa ketika kalian membunuh sesorang lalu kalian saling tuduh menuduh tentang itu, maksudnya kalian saling mengingkari dan saling berselisih tentang pembunuhnya hingga perkara itu menjadi rumit di antara kalian, dan hampir saja –sekiranya Allah tidak menjelaskannya untuk kalian- terjadi suatu keburukan yang dahsyat di antara kalian. Lalu Nabi Musa berkata kepada kalian untuk mengungkap pelaku pembunuhannya, ’kalian sembelihlah seekor sapi” dan yang wajib adalah bersegera dalam mentaati perintahnya tanpa ada sanggahan atasnya. Akan tetapi mereka enggan melakukannya kecuali dengan memberikan sanggahan seraya mereka berkata, ”apakah kamu hendak menjadikan kami bahan ejekan?” Nabi Allah Musa menjawab, “Aku berlindung kepada Allah agar tidak menjadi salah seorang dari orang-orang yang jahil, ” karena orang yang jahil itu adalah orang yang berbicara dengan perkataan yang tidak ada gunanya dan orang bodoh seperti itulah yang mengejek orang. Adapun orang yang berakal, maka pastilah dia akan meyakini bahwa sebesar-besarnya aib yang mengurangi derajat agama dan akal, adalah olok-olokannya terhadap orang yang mana dia adalah sama manusianya seperti dirinya, walaupun (memang) dia lebih utama daripada orang yang di hinanya, karena keutamaan itu menuntutnya bersyukur kepada Allah dan berlaku kasih sayang terhadap sesama makhluk. Dan ketika nabi Musa mengatakan hal itu kepada mereka, maka mereka mengetahui bahwa itu benar, lalu mereka berkata,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { البقرة } al-Baqoroh : Maknanya Sapi. Bentuk tunggal dari kata baqor. Sapi jantan disebut dengan tsaur ثَوْرٌ sedangkan sapi betina disebut baqoroh بَقَرَةٌ { الذبح } adz-Dzabhu : Memutus dua urat nadi leher dan tenggorokan { الهزو } : al-Huzuww : Ejekan dan main-main { الجاهل } al-Jahil : Yaitu orang yang berkata atau berbuat dengan suatu hal yang tidak sepantasnya dikatakan atau dilakukan. Makna ayat : Makna ayat : Allah Ta’ala mengingatkan : “Ingatkanlah wahai Rasul kami kepada mereka orang-orang Yahudi tentang aib lain milik pendahulu mereka yang selama ini dibangga-banggakan. Yaitu aib tentang adab buruk yang mereka nampakkan kepada Nabi mereka sehingga menjadi celaan bagi diri mereka sendiri, semoga mereka mau kembali dari kesesatan dan beriman kepada engkau dan hidayah serta agama kebenaran yang engkau bawa. Ingatkan tentang kisah seorang lelaki yang dibunuh oleh keponakannya sendiri karena tergesa-gesa ingin mendapatkan harta warisannya, untuk menghilangkan jejak, lantas ia buang mayat pamannya ke desa lain. Ketika penduduk berselisih tentang siapa pembunuhnya mereka berkata,”Kita menemui Musa agar dia berdoa kepada Tuhannya untuk menerangkan kepada kita siapakah pembunuhnya.” Lantas mereka mendatangi Musa dan Musa berkata,”Sesungguhnya Allah menyuruh kalian untuk menyembelih seekor sapi betina.” Kemudian organ sapi tersebut dipukulkan kepada mayat agar mayat tersebut berbicara sendiri mengenai siapa pembunuhnya. Akan tetapi mereka malah menertawakan Nabi Musa dan menganggapnya hanya berolok-olok dan bermain-main saja. Ini merupakan dosa besar yang mereka lakukan. Pelajaran dari ayat : • Ayat-ayat di atas menerangkan tentang buruknya akhlak Bani Israil sehingga tidak layak ditiru oleh kaum Muslimin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 67: Allah menyebutkan tentang bani israil pada hari dimana mereka membunuh dan berselisih atas siapa yang membunuh, dan hampir – hampir diantara mereka terjadi gejolak, mereka dendam kepada Musa, Musa berkata kepada mereka : Sesungguhnya Allah memerintahkan kalian untuk menyembelih sapi betina dan itu adalah wajib bagi kalian bersegera mengerjakan perintah Allah dan meninggalkan perselisihan atas perintah tersebut, akan tetapi mereka menyangka bahwasannya hal tersebut adalah ejekan, mereka berkata : Apakah engkau wahai Musa mengejek kami?, maka Musa berkata kepada mereka: aku berlindung kepada Allah dari orang – orang yang bodoh; Sesungguhnya orang yang bodoh adalah ia yang mengejek manusia dan mengolok mereka, adapun orang – orang yang berakal maka mereka tidak akan demikian; maka bagaimana bisa dari kalangan para nabi dan rasul yang maksum berbuatan demikian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika di antara mereka ada yang membunuh seseorang, lalu mereka saling tuduh-menuduh dalam hal itu. Kemudian mereka membawa persoalan itu kepada Musa 'alaihis salam, maka Allah menyuruh mereka menyembelih seekor sapi betina agar orang yang terbunuh itu dapat hidup kembali dan menerangkan siapa yang membunuhnya setelah dipukul dengan sebagian tubuh sapi itu sebagaimana diterangkan dalam ayat 73 dan 74. Mudah, hanya seekor sapi betina, dan seharusnya mereka langsung mengerjakannya, tetapi mereka banyak bertanya seperti yang disebutkan pada ayat di atas sehingga semakin susah dan memberatkan. Hikmah Allah menyuruh menyembelih sapi ialah supaya hilang rasa penghormatan mereka terhadap sapi yang pernah mereka sembah. Dengan nada sombong dan menunjukkan kejahilannya. Yakni mana mungkin Nabi Musa 'alaihis salam memerintahkan sesuatu yang tidak ada faedahnya, karena hanya orang bodoh yang berkata-kata tanpa faedah. Di samping itu, orang yang berakal menganggap bahwa termasuk aib jika sampai mengejek antara sesama meskipun ia diberikan kelebihan, karena kelebihan yang diberikan kepadanya menghendaki untuk bersyukur kepada Allah dan berkasih sayang antara sesama hamba Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 67",
    "description": "Pada ayat-ayat yang lalu dijelaskan tentang keingkaran bani israil terhadap perintah Allah, sedang pada ayat-ayat berikut diterangkan keingkaran mereka terhadap perintah nabi musa. Dan ingatlah ketika musa berkata kepada kaumnya yang meminta agar ia memohon pada tuhan agar memberi solusi dari masalah pembunuhan di kalangan mereka, Allah memerintahkan kamu agar menyembelih seekor sapi betina, yang dimaksudkan agar mereka menghapus sisa syirik karena pernah menyembah anak sapi dan siap kembali pada akidah yang benar. Perintah ini dinilai sebagai bentuk ketidakseriusan musa, karena itu mereka bertanya, apakah engkau akan menjadikan kami sebagai ejekan' pertanyaan ini sungguh tidak pada tempatnya, karena mereka tahu sifat musa yang tidak pernah main-main. Dengan sikap prihatin, dia, musa, menjawab, aku berlindung kepada Allah agar tidak termasuk orang-orang yang bodoh yang sering menjadikan ajaran agama sebagai permainan. Syarat untuk mengungkap pembunuhan hanya dengan menyembelih seekor sapi. Akan tetapi, orang yahudi justru mempersulit diri dengan mengajukan beragam pertanyaan. Hal ini diawali ketika mereka berkata, mohonkanlah kepada tuhanmu (ungkapan ini mengisyaratkan pada tuhan itu hanya tuhan musa, bukan tuhan mereka) untuk kami agar dia menjelaskan kepada kami tentang sapi betina itu, apakah sapi itu masih muda atau yang tua. Mendengar pertanyaan ini, dia, musa, menjawab, dia berfirman bahwa sapi betina itu tidak tua dan tidak muda, tetapi pertengahan antara itu. Setelah penjelasan ini, maka kerjakanlah apa yang diperintahkan kepadamu. Tetapi tampaknya mereka masih tidak puas, dan kemudian mengajukan pertanyaan lain, yaitu seperti yang diungkapkan pada ayat berikutnya."
  }
]