[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata “memohonlah kepada Tuhanmu agar menjelaskan kepada kami sifat sapi betina tersebut”. Musa menjawab mereka “Sesungguhnya Allah berfirman kepada kalian bahwa sifat sapi betina itu adalah bukan sapi yang sudah tua bongkok dan bukan sapi muda belia, akan tetapi sapi betina yang berusia tengah-tengah antara keduanya. Maka bersegeralah melaksanakan perintah Tuhan kalian”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Mereka berkata kepada Musa, “Mohonlah kepada Rabbmu agar Dia menjelaskan kepada kami ciri-ciri sapi betina yang Dia perintahkan untuk kami sembelih.” Lalu Musa berkata kepada mereka, “Sesungguhnya Allah berfirman bahwa sapi betina itu tidak tua dan tidak muda, pertengahan antara itu. Jadi segeralah melaksanakan perintah Rabb kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Namun mereka tetap mengulangi sifat keras kepala mereka dengan berkata: \"Mintalah kepada Tuhanmu agar memperjelas ciri dari sapi betina itu.\" Musa menjawab: \"Allah telah memberitahukanku bahwa sapi itu bukanlah sapi yang tua dan bukan pula yang masih kecil, namun pertengahan diantara keduanya. Maka laksanakanlah perintah itu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَنَا مَا هِيَ ۚ Mereka tidak serta merta menjalankan perintah dengan menyembelih sapi apapun bentuk dan sifatnya, akan tetapi mereka malah mulai dengan kebebalan mereka dengan meminta perincian sifat sapi agar bisa menentukannya. Padahal itu tidak perlu mereka lakukan. قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَا فَارِضٌ (الفارض) berarti tua وَلَا بِكْرٌ Yakni bukan pula muda yang belum pernah hamil. عَوَانٌ Yakni pertengahan diantara itu, yaitu yang sudah pernah melahirkan satu atau dua anak. فَافْعَلُوا Ini adalah pengulangan perintah sebagai bentuk peringatan atas kebebalan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Al-Husain Ibnu al-Fadh dikenal dengan kepandaiannya mengangkat banyak amtsal arab dan 'ajam dari al-Qur'an, suatu ketika beliau ditanya : apakah kamu menemukan dalam al-Qur'an ayat-ayat yang terkandung didalamnya pepatah ini : ( خير الأمور أوسطها ) “Sebaik-baik perkara itu adalah pertengahannya” ia berkata : iya, saya menemukannya di di 4 tempat ! 1- { لَا فَارِضٌ وَلَا بِكْرٌ عَوَانٌ بَيْنَ ذَٰلِكَ ۖ فَافْعَلُوا مَا تُؤْمَرُونَ } \"yang tidak tua dan tidak muda; pertengahan antara itu; maka kerjakanlah apa yang diperintahkan kepadamu\". 2- { وَالَّذِينَ إِذَا أَنْفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا } \"Dan orang-orang yang apabila membelanjakan (harta), mereka tidak berlebihan, dan tidak (pula) kikir, dan adalah (pembelanjaan itu) di tengah-tengah antara yang demikian\" [ al-Furqan : 67 ]. 3- { وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ } \"Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu dan janganlah kamu terlalu mengulurkannya karena itu kamu menjadi tercela dan menyesal\" [ al-Isra' : 29 ]. 4- { وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا } \"dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya dan carilah jalan tengah di antara kedua itu” [ al-Isra' : 110 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka berkata: “Memohonlah kepada Tuhanmu untuk menjelaskan kepada kami ciri-ciri sapi betina ini!”. Musa berkata: “Sesungguhnya Tuhan berfirman: ”Sesungguhnya sapi itu adalah sapi betina yang tidak tua, tidak terlalu muda, dan berada di antara keduanya. Maka lakukanlah apa yang diperintahkan kepada kalian untuk mengetahui pembunuh itu dan janganlah kalian menunda-nunda!”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Berdoalah kepada Tuhanmu untuk kami agar Dia menjelaskan kepada kami tentang sapi itu.” Musa menjawab, “Allah berfirman bahwa sapi itu adalah sapi betina yang tidak tua} tidak tua {dan tidak muda} tidak muda {(tetapi) pertengahan antara itu} pertengahan antara kedua umur tersebut {Maka kerjakanlah apa yang diperintahkan kepada kalian.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Mohonkanlah kepada tuhanmu untuk kami, agar Dia menerangkan kepada kami sapi betina apakah itu?” yakni berapa umurnya? “Musa menjawab, ’sesungguhnya Allah berfirman bahwa sapi betina itu adalah sapi betina yang tidak tua’,” yakni tidak terlalu dewasa, besar, “dan tidak muda, ” yakni bukan yang masih kecil, “pertengahan antara itu; maka kerjakanlah apa yang di perintahkan kepadamu, ” dan tinggalkanlah bersikap keras dan berlebih-lebihan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الفارض } al-Faridh : Sapi yang telah berumur setahun dan tanggal giginya { البكر } al-Bikru : Sapi muda yang belum melahirkan. { العوان } al-‘Awaan : Sapi yang berumur pertengahan Makna ayat : Terus saja mereka bertanya dan mendesak Nabi Musa tentang kriteria sapi betina yang dijadikan syarat, sampai-sampai Allah Ta’ala memberikan perintah yang berat untuk mereka, hampir saja mereka tidak bisa merealisasikan persyaratan yang diminta. Pelajaran dari ayat : • Keharaman menyangkal perintah Allah Ta’ala dan kewajiban menerima segala perintahNya atau laranganNya, walaupun belum diketahui manfaat atau alasan perintah dan larangan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 68: Berkata bani israil: Wahai Musa mintahlah kepada RabbMu untuk menjelaskan kepada kami sifat – sifat dari sapi betina, berkata Musa kepada mereka: Sesungguhnya sapi betina yang tidak besar dan juga kecil atau pertengahan, maka bersegeralah kalian atas apa yang diperintahkan kepada kalian, tinggalkanlah keras kepala dan banyak bertanya tentang sifat, akan tetapi kerjakanlah maka Allah akan membalas kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kerjakan langsung apa yang diperintahkan dan jangan banyak bertanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 68",
    "description": "Syarat untuk mengungkap pembunuhan hanya dengan menyembelih seekor sapi. Akan tetapi, orang yahudi justru mempersulit diri dengan mengajukan beragam pertanyaan. Hal ini diawali ketika mereka berkata, mohonkanlah kepada tuhanmu (ungkapan ini mengisyaratkan pada tuhan itu hanya tuhan musa, bukan tuhan mereka) untuk kami agar dia menjelaskan kepada kami tentang sapi betina itu, apakah sapi itu masih muda atau yang tua. Mendengar pertanyaan ini, dia, musa, menjawab, dia berfirman bahwa sapi betina itu tidak tua dan tidak muda, tetapi pertengahan antara itu. Setelah penjelasan ini, maka kerjakanlah apa yang diperintahkan kepadamu. Tetapi tampaknya mereka masih tidak puas, dan kemudian mengajukan pertanyaan lain, yaitu seperti yang diungkapkan pada ayat berikutnya. Setelah dijawab, mereka mengajukan pertanyaan lain yang berkaitan dengan warna sapi dengan berkata, mohonkanlah kepada tuhanmu untuk kami agar dia menjelaskan kepada kami apa warnanya. Dengan gemas dia, musa, menjawab, dia berfirman bahwa sapi itu adalah sapi betina yang kuning tua warnanya'padahal warna ini sangat sulit ditemukan'dan sapi itu mesti yang menyenangkan orang-orang yang memandang-Nya. Penjelasan ini sebenarnya semakin menyulitkan mereka, tetapi mereka belum juga puas dengan keterangan tersebut, dan masih mengajukan pertanyaan lain, seperti yang diungkap pada ayat berikutnya."
  }
]