[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka pun kembali berdebat dengan berujar “mohon lah kepada Tuhanmu untuk kami agar mau menjelaskan warnanya kepada kami?”. Musa Alaihissalam berkata “Sesungguhnya Dia berfirman bahwasanya sapi itu berwarna kuning pekat dan menyenangkan orang yang melihatnya”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Tetapi mereka terus melanjutkan perdebatan dan keangkuhan mereka dengan mengatakan kepada Musa -'alaihissalām-, “Mohonkanlah kepada Rabb kalian agar Dia menjelaskan kepada kami bagaimana warna sapi itu.” Musa berkata kepada mereka, “Sesungguhnya Allah berfirman bahwa sapi betina itu warnanya kuning sekali dan menarik hati setiap orang yang melihatnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Dan mereka kembali mengulangi kebebalan mereka dengan mengatakan: \"Mintalah kepada Tuhanmu agar memperjelas warna dari sapi betina itu.\" Musa menjawab bahwa sapi betina itu berwarna kuning pekat yang membuat tertarik oarang yang melihatnya karena warnanya yang begitu bersih dan indah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَنَا مَا لَوْنُهَا ۚ Yakni mereka kembali melakukan kebiasaan mereka berbuat bebal. Sehingga Allah pun tidak mengatakan kepada mereka: ini adalah pertanyaan yang tidak perlu; akan tetapi malah menambah syarat lain agar mendapat kesusahan disebabkan kebebalan mereka. قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاءُ (الصفرة) adalah warna kuning seperti yang kita ketahui. فَاقِعٌ لَوْنُهَا Yakni kuning yang paling jelas dan terang. تَسُرُّ النَّاظِرِينَ Yakni orang yang memandangnya akan merasa senang kerena takjub akan keindahannya dan keindahan warnanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka berkata lagi kepada Musa: “Memohonlah kepada Tuhanmu untuk menjelaskan kepada kami tentang warnanya!” Lalu Musa berkata: “Allah berfirman sesungguhnya sapi itu berwarna kuning pekat. Warnanya dapat membahagiakan orang-orang yang memandang dan membuat mereka kagum pada keindahan bentuk dan warnanya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Berdoalah kepada Tuhanmu untuk kami agar Dia menjelaskan kepada kami apa warnanya.” Musa menjawab, “Allah berfirman bahwa sapi itu adalah sapi betina yang warnanya kuning tua} yang warna kuningnya sangat pekat {yang menyenangkan} membuat kagum {orang-orang yang memandangnya.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “Mereka berkata, ’ mohonkanlah kepada tuhanmu untuk kami agar Dia menerangkan kepada kami apa warnanya.’ Musa menjawab, ’sesungguhnya Allah berfirman bahwa sapi betina itu adalah sapi betina yang kuning, yang kuning tua warnanya’.” Yakni yang sangat, “lagi menyenangkan orang-orang yang memandangnya, ” karena bagusnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { فاقع } Faaqi’ : Berwarna kuning kekuningan, seperti dikatakan أحمر قانئ merah tua, dan أبيض ناصع putih cerah. Makna ayat : Terus saja mereka bertanya dan mendesak Nabi Musa tentang kriteria sapi betina yang dijadikan syarat, sampai-sampai Allah Ta’ala memberikan perintah yang berat untuk mereka, hampir saja mereka tidak bisa merealisasikan persyaratan yang diminta. Pelajaran dari ayat : • Anjuran untuk mengambil pilihan amal yang mudah dilakukan dan dibenci memberatkan diri dalam semua perkara."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 69: Berkata bani israil: Wahai Musa mintalah pada RabbMu untuk kami agar menjelaskan kepada kami apa warna dari sapi betina ini; maka Musa berkata kepada mereka: Sesungguhnya Allah berkata bahwasannya sapi betina berwarna kuning pekat yang mudah dilihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka terus bertanya tentang sapi betina itu, sehingga yang sebelumnya mudah menjadi susah, bahkan hampir saja mereka tidak mengerjakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 69",
    "description": "Setelah dijawab, mereka mengajukan pertanyaan lain yang berkaitan dengan warna sapi dengan berkata, mohonkanlah kepada tuhanmu untuk kami agar dia menjelaskan kepada kami apa warnanya. Dengan gemas dia, musa, menjawab, dia berfirman bahwa sapi itu adalah sapi betina yang kuning tua warnanya'padahal warna ini sangat sulit ditemukan'dan sapi itu mesti yang menyenangkan orang-orang yang memandang-Nya. Penjelasan ini sebenarnya semakin menyulitkan mereka, tetapi mereka belum juga puas dengan keterangan tersebut, dan masih mengajukan pertanyaan lain, seperti yang diungkap pada ayat berikutnya. Ketidakpuasan mereka atas jawaban nabi musa diungkapkan dengan berkata, mohonkanlah kepada tuhanmu untuk kami keterangan lebih lengkap agar dia menjelaskan kepada kami secara lebih detail tentang keadaan sapi betina itu. Yang sedemikian ini karena sesungguhnya sapi itu masih juga belum begitu jelas bagi kami, dan jika Allah menghendaki dan berkenan memberikan keterangan selengkapnya, niscaya kami mendapat petunjuk tentang sapi itu, sehingga kami dapat menemukannya dan melaksanakan perintah dengan tepat seperti yang dijelaskan."
  }
]