[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah mengunci hati dan pendengaran mereka dan menjadikan penutup pada pandangan mereka, disebabkan kekafiran dan penolakan keras mereka setelah jelas kebenaran bagi mereka, maka Allah tidak memberikan Taufik bagi mereka untuk mendapat Hidayah dan bagi mereka akan mendapatkan siksaan yang keras di neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Karena Allah telah menyegel dan menutup hati mereka beserta kebatilan yang ada di dalamnya. Allah juga menutup telinga mereka sehingga tidak bisa mendengarkan kebenaran untuk diterima dan diikuti. Allah juga menutup mata mereka sehingga tidak bisa melihat kebenaran yang sangat jelas di hadapan mereka. Kelak di akhirat mereka akan mendapatkan azab yang sangat berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7.خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ Yakni mereka adalah orang-orang yang tidak memahami makna hidayah dan tidak mau mendengarkan apa yang bermanfaat bagi mereka yang disebabkan kebencian mereka terhadap kebenaran dan terhadap orang yang membawa kebenaran. وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ Yakni penutup yang menghalangi menglihatan mereka untuk melihat kebenaran. Ibnu jarir berkata: sesungguhnya dosa-dosa itu jika dilakukan terus menerus maka akan menutup hati, sehingga tertutup jalannya dan kekufuran yang ada didalamnya tidak bisa keluar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Allah telah mengunci hati mereka dengan kekafiran mereka keimanan tidak berlaku bagi hati mereka. Mereka tidak mau mendengarkan kebenaran, melihat petunjuk, dan berpikir. Dan bagi mereka azab yang amat sangat pedih. Asbabun Nuzul (Penyebab turun) dua ayat ini sebagaimana Ath-Thabari mengatakan dari Ibnu Abbas dan Al-Kalbi bahwa kedua ayat tersebut turun di Romawi Yahudi, di antara mereka yang menyaksikan turunnya dua ayat ini adalah Hayy bin Akhthab dan Ka’b bin Asyraf"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah telah mengunci} Allah telah mengunci mati {hati dan pendengaran mereka. Pada penglihatan mereka terdapat penutup} penutup {dan bagi mereka azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Allah telah mengunci hati dan pendengaran mereka, ” yakni menutupnya dengan penutup yang tidak dapat dimasuki oleh keimanan dan tidak bisa ditembus, sehingga mereka tidak memahami apa yang berguna bagi mereka dan apa-apa yang mereka dengarkan tidak bermanfaat untuk mereka, ”dan penglihatan mereka ditutup, ” yakni pelapis, penutup, dan penghalang yang menghalangi mereka dari melihat yang berguna bagi mereka, dan jalan-jalan ilmu dan kebaikan telah ditutup bagi mereka, tidak ada keinginan pada mereka dan tidak ada kebaikan yang diharapkan pada meeka. Mereka telah dihalangi dan ditutup dari pintu-pintu keimanan, disebabkan oleh kekufuran dan pengingkaran mereka serta keras kepala mereka setelah jelas bagi mereka kebenaran itu. Sebagaimana firman Allah : \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat\" (QS. Al-'An'am : 110) Dan ini hanyalah hukuman yang sekarang, kemudian Allah menyebutkan hukuman yang akan datang seraya berfirman, ”dan bagi mereka siksa yang amat pedih” yakni azab api neraka, kemurkaan yang Mahaperkasa yang terus menerus dan selamanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : خَتَمَ ٱللَّهُ maknanya mengunci mati, karena al-Khotaam dan ath-Thoba’ memiliki arti yang sama yaitu melakukan stempel pada amplop sehingga tidak diketahui isinya, dan tidak bisa dibuka sehingga dapat diganti atau dirubah. غِشَٰوَةٞۖ Al-Ghisyaawah artinya adalah penutup yang membuat sesuatu menjadi tertutupi sehingga tidak ada sesuatu pun yang dapat menyentuhnya. Makna ayat : Hal itu karena sudah berlaku ketetapan Allah untuk mereka dengan dikunci mati hatinya sampai tidak bisa berfikir, pada telinganya sehingga tidak mendengar, dan dijadikan penutup pada matanya sampai-sampai tidak bisa melihat. Itulah hasil dari kesombongan, penolakan, dan konsistensi mereka dalam kekufuran. Oleh karena itu mereka berhak mendapatkan adzab yang pedih. Inilah hukum Allah bagi orang-orang yang menentang, sombong, lagi konsisten dalam kekufurannya di setiap waktu dan tempat. Pelajaran dari ayat : 2. Peringatan agar tidak terus menerus dalam kekufuran, kedzaliman, dan berbuat kerusakan di muka bumi agar tidak mendapat adzab yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 7: Allah mengabarkan bahwa mereka orang-orang kafir tidak beriman, dan yang pastinya tidak seluruh orang kafir, dan yang dimaksud adalah ketika turun kedua ayat ini maka orang-orang kafir terbagi menjadi dua golongan. Golongan pertama : sebagian dari para pembesar quraisy seperti abu jahl dan abu lahab, dan yang lainnya yang mereka membenci tauhid dan seruan kepadanya, mereka menolak dan menyiksa orang-orang yang berislam, mereka memaksa agar kaum muslimin hijrah ke habasyah, mereka berkata : Apakah kalian ingin menjadikan tuhan menjadi tuhan yang satu?, Sungguh ini adalah perkara yang mengherankan. (Shod : 5). Mereka juga berkata : Kami tidak akan beriman dengan Al-Qur’an ini dan tidak juga kepada apa yang di hadapannya. (Saba : 31), yaitu dengan kerisalahan yang sebelumnya, telah sampai kepada mereka sehingga mereka membenci dan dendam sembari berkata : Wahai Rabb, kalau memang ini adalah sebuah kebenaran dari sisimu maka turunkanlah hujan batu dari langit atau datangkan kepada kami adzab yang pedih. (Al Anfal : 32); Padahal Allah telah menciptakan mereka di atas fitrah, dan Allah jadikan mereka dapat memilih sebagaimana manusia yang lain, akan tetapi mereka lebih memilih kesesatan dan tetap di atas kekafiran, maka janganlah engkau wahai Nabi Allah takut karena mereka tidak akan beriman selamanya, oleh sebab itu Allah menutup hati mereka, pandangan mereka dan telinga mereka, terkuncinya mereka ini sebagai balasan dan tidak hanya sekali mereka demikian. Golongan yang kedua mereka adalah yang beriman akan tetapi murtad dan munafik, Allah berfirman akan mereka : Itulah mereka yang telah beriman kemudian kafir maka dikuncilah hati mereka. (Al Munafikun : 3). Adapun orang-orang kafir yang lain, maka mereka tergantung akan sampainya dakwah (kepada mereka). Dan bukti yang bahwasanya waktu turun pada kedua kafir yang telah disebutkan sebelumnya adalah bahwasanya seluruh orang-orang kafir dan yang disekitar mereka masuk islam setelah fathul mekkah dan setelah diperangi oleh muhajirin dan anshar untuk menegakkan kalimat Allah; Bahkan di antara mereka orang-orang kafir ada yang masuk islam kemudian menjadi panglima perang semisal Khalid bin Walid, Amr bin Ash dan selain dari mereka. Kemudian Allah menutup ayat ini dengan dikabarkan bahwa tempat kembali bagi kedua kelompok kafir ini adalah kepada adzab yang pedih pada hari kiamat yang tidak ada yang mengetahui dahsyatnya kecuali hanya Allah saja. Dan tidak diragukan bahwasanya bagi siapa saja yang disifati dengan sifat sebagaimana dua golongan kafir ini maka dia semisal dengan mereka dan hukumannya sebagaimana mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang itu tidak dapat menerima petunjuk, dan segala macam nasehat tidak akan berbekas kepadanya disebabkan kekafiran dan kerasnya hati mereka setelah nampak kebenaran bagi mereka. Oleh karena itu, Allah tidak memberi mereka taufiq untuk mengikuti petunjuk itu. Maksudnya: mereka tidak dapat memperhatikan dan memahami ayat-ayat Al Quran yang mereka dengar dan tidak dapat mengambil pelajaran dari tanda-tanda kebesaran Allah yang mereka lihat di cakrawala, di permukaan bumi dan pada diri mereka sendiri. Sarana-sarana untuk memperoleh petunjuk dan kebaikan telah ditutup bagi mereka. Ini merupakan hukuman yang disegerakan dan hukuman yang akan datang kepada mereka adalah azab yang sangat pedih berupa azab neraka dan kemurkaan Allah Ta'ala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 7",
    "description": "Karena mereka ingkar dengan menutup diri dari kebenaran, maka seakan Allah telah mengunci hati mereka dengan sekat yang tertutup rapat sehingga nasihat atau hidayah tersebut tidak bisa masuk ke dalam hati mereka, dan pendengaran mereka juga seakan terkunci, sehingga tidak mendengar kebenaran dari Allah. Demikian pula penglihatan mereka telah tertutup, sehingga tidak melihat tanda-tanda kekuasaan Allah yang dapat mengantarkan kepada keimanan, dan sebagai akibatnya, mereka akan mendapat azab yang berat. Dan selanjutnya disebutkan kelompok manusia yang ketiga dalam menyikapi kebenaran petunjuk Al-Qur'an, yaitu di antara manusia yang ingkar seperti disebut sebelumnya ada sekelompok orang yang mengatakan sesuatu yang sesungguhnya tidak lahir dari dalam hati nurani. Mereka berkata, kami hanya beriman kepada Allah dengan segala keagungan-Nya dan kami juga beriman kepada hari akhir yang diingkari oleh orang-orang kafir, padahal sesungguhnya mereka itu tidak jujur dalam mengatakan itu sehingga mereka bukanlah termasuk golongan orang-orang yang beriman. Kelompok ketiga ini jauh lebih berbahaya daripada yang secara terang-terangan menolak (kafir), sebab mereka menampakkan diri seperti kawan padahal sesungguhnya mereka adalah lawan."
  }
]