[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada mereka, “Sesungguhnya Allah berfirman: “sapi itu adalah sapi yang tidak diperuntukkan untuk bekerja membajak tanah untuk lahan pertanian, dan tidak dipergunakan untuk mengairi tanaman dari tempat penyiraman, dan bebas dari semua jenis cacat, tidak ada padanya tanda warna Selain warna dominan kulitnya.” Mereka berkata, “sekarang barulah kamu menyampaikan sifat karakter sapi betina itu”. Maka mereka pun terpaksa menyembelihnya setelah memakan waktu yang lama dalam usaha pencarian yang sulit. dan sesungguhnya mereka hampir saja tidak melakukannya karena sifat pembangkangan mereka. Demikianlah mereka mempersulit diri sendiri sehingga Allah pun mempersulit mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Musa bersabda kepada mereka, “Sesungguhnya Allah berfirman bahwa ciri-ciri sapi betina itu ialah tidak pernah digunakan untuk membajak sawah atau mengangkut air, selamat dari cacat, dan tidak ada warna lain di tubuhnya selain warna kuning.” Ketika itulah mereka berkata, “Nah, sekarang engkau telah memberikan ciri-cirinya secara rinci dan bisa menunjukkan sapi yang dimaksud secara tepat.” Dan mereka pun menyembelih sapi betina dengan ciri-ciri tersebut setelah mereka nyaris tidak bisa menyembelihnya gara-gara perdebatan dan keangkuhan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Kemudian Musa menjawab mereka bahwa Allah berfirman kepada kalian: \"Sapi betina itu tidak dipaksa untuk bekerja, tidak dipakai untuk menyiram tanaman seperti hewan lain yang dipakai untuk menangkat air dari dalam sumur, tidak memiliki kecacatan, serta tidak memiliki bintik yang berbeda dari warna badannya.\" Mereka lalu berseru: \"Akhirnya jelaslah penjelasan tentang sapi ini.\" Maka mereka mulai mencari sapi betina itu dan menyembelihnya, setelah mereka hampir tidak melakukan perintah ini karena tidak dapat menemukan sapi betina sesuai dengan ciri-cirinya dan karena rasa takut terhadap tersingkapnya si pembunuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. لَا ذَلُولٌ Yakni tidak dijinakkan untuk dipakai bekerja. تُثِيرُ الْأَرْضَ Yakni untuk bercocok tanam وَلَا تَسْقِي الْحَرْثَ Yakni tidak termasuk (النواضح) yaitu hewan yang dipakai mengangkat air untuk pengairan perkebunan. مُسَلَّمَةٌ Yakni terbebas dari cacat لَا شِيَةَ فِيهَا ۚ Yakni sapi ini berwarna kuning sepenuhnya, tidak memiliki belang ditubuhnya. قَالُوا الْآنَ جِئْتَ بِالْحَقِّ ۚ Yakni mereka berkata: sekaranglah baru jelas sifat yang kamu sebutkan, kamu telah menjelaskan kebenaran yang harus kita jalankan. فَذَبَحُوهَا Yakni merekapun mendapatkan sapi sesuai dengan sifat yang telah dijelaskan, kemudian mereka menyembelihnya dan menjalankan apa yang diperintahkan kepada mereka yang sebenarnya adalah perintah yang mudah akan tetapi merekalah yang mempersulit. Dan perkataan mereka ini adalah bentuk dari kebebalan mereka karena sesungguhnya kebenaran telah datang kepada mereka pada saat pertama kali. وَمَا كَادُوا يَفْعَلُونَ Yakni kerena tidak adanya sapi yang memiliki sifat-sifat ini. Pendapat lain mengatakan karena harganya yang tinggi. Ada juga yang berpendapat karena mereka takut akan terbongkar masalah pembunuhan ini. Terdapat hadist yang dikeluarkan oleh Imam Thabari dari Abu Hurairah, ia berkata: Rasulullah bersabda: kalaulah saja Bani Israel tidak berkata (dan sesungguhnya kami insya Allah akan mendapat petunjuk) niscaya mereka tidak akan diberi penjelasan sedikitpun (tentang sapi ini). Seandainya mereka menyembelih sapi dengan sifat apapun niscaya itu cukup bagi mereka, akan tetapi mereka mempersulit diri mereka, maka Allah pun mempersulit mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Lalu Musa berkata kepada mereka: “Sesungguhnya Allah berfirman kepada kalian, “Sesungguhnya sapi itu tidak digunakan untuk bekerja. Jadi, sapi itu tidak (untuk) membajak tanah, mengairi sawah seperti hewan tunggangan yang sudah dewasa lainnya yang digunakan untuk mengambil air dari sumur, tidak cacat, warna kuningnya tidak tercampur dengan warna mengkilap atau warna lain. Mereka berkata: “Sekarang kamu memberikan gambaran yang sempurna. Kemudian mereka mendapatkan sapi itu dari seorang pemuda yang patuh kepada ibunya, lalu mereka membelinya dengan harga yang sangat mahal. Mereka menyembelihnya dan hampir tidak melakukannya karena harganya yang mahal. Kalaupun mereka menyembelih sapi manapun tanpa mengajukan pertanyaan-pertanyaan ini, niscaya hal itu akan meringankan mereka. Akan tetapi mereka tetap bersikeras (dengan itu), maka Allah juga keras kepada mereka sebagaimana yang diriwayatkan Abu Hurairah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa menjawab,“Allah berfirman bahwa sapi itu adalah sapi betina yang belum pernah dipakai untuk membajak tanah} bukan sapi betina yang digunakan untuk bekerja tidak juga untuk membajak tanah untuk bercocok tanam {dan tidak (pula) untuk mengairi tanaman} dan tidak pula untuk mengairi tanaman {sehat} tidak cacat {dan tanpa belang.”} tidak ada warna yang berbeda dengan warna kulitnya {Mereka berkata, “Sekarang barulah kamu menerangkan (hal) yang sebenarnya.” Lalu, mereka menyembelihnya, dan hampir saja mereka tidak melaksanakan (perintah) itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “Musa berkata, ’sesungguhnya Allah berfirman bahwa sapi betina itu adalah sapi betina yang belum pernah dipakai’.” Yakni belum pernah dimanfaatkan untuk bekerja, baik “membajak tanah” dengan bercocok tanam, ”dan tidak pula untuk mengairi tanaman, ” yakni, bukan dari hewan untuk bekerja, “tidak bercacat” dari aib atau dari bekerja, dan “tidak ada belangnya, ” yakni tidak ada warna padanya selain warna yang telah disebutkan sebelumnya. “Mereka berkata, ’sekarang barulah kamu menerangkan hakikat sapi betina yang sebenarnya’.” Yakni dengan penjelasan yang sempurna, dan ini merupakan kejahilan mereka, kalau tidak demikian, niscaya dia telah membawakan mereka suatu kebenaran sejak semula. Sekiranya mereka tidak menyanggah sapi yang mana niscaya terlaksanalah yang di maksud dengan sapi apa saja, akan tetapi mereka ngeyel dengan memperbanyak pertanyaan, maka Allah memperlakukan mereka juga dengan keras, dan sekiranya mereka tidak mengatakan “insya allah”, niscaya mereka pun tidak akan di bimbing untuk mendapatkannya. “kemudian mereka menyembelihnya,” yaitu sapi yang telah dijelaskan dengan sifat-sifat tersebut, ”dan hampir saja mereka tidak melaksanakan perintah itu” disebabkan sikap keras kepala yang terjadi dari mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الذلول } adz-Dzalul : Sudah jinak sehingga mudah untuk dikendalikan { تُثِيرُ ٱلۡأَرۡضَ } Tutsirul ardha : Membajak sawah dengan alat sehingga debunya beterbangan. Maknanya bhwa sapi itu belum pernah dipakai untuk membajak sawah atau untuk mengairi tanaman, karena masih terlampau kecil dan belum sampai umurnya. { مُسَلَّمَةٞ } Musallamah : Bebas dari cacat yang menimpa seperti buta sebelah dan pincang { لَّا شِيَةَ فِيهَاۚ } Laa syiyata fiihaa : Syiyah artinya adalah tanda. Artinya tidak terdapat warna lain selain warna dasarnya seperti tambahan warna hitam atau putih. Makna ayat : Andai saja mereka tidak banyak bertanya tentu dapat menggunakan sapi mana saja dan itu sudah mencukupinya. Akan tetapi mereka memberatkan diri sendiri sehingga Allah memperberat untuk mereka. Akhirnya mereka mendapatkan sapi yang sesuai persyaratan dengan usaha yang cukup berat dan mahal karena mereka membeli dari pemiliknya dengan harga emas sepenuh kulit sapi tersebut. Pelajaran dari ayat : • Sudah selayaknya untuk berhati-hati serta menghindari penggunaan kalimat yang bernada melecehkan kepada para nabi, semisal dengan ucapan Bani Israil,”Sekaranglah, kamu baru membawa kebenaran.” Karena hal ini dapat dipahami bahwa Nabi Musa baru membawa kebenaraan saat itu saja sedangkan yang sebelumnya tidak pernah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 71: Berkata Musa kepada mereka: Sesungguhnya Allah berkata: Sapi betina tersebut bukanlah sapi yang rendah yaitu untuk bercocok tanam, untuk bertani, dan juga tidak untuk membajak sawah yaitu tiada celah aib dan sapi betina tersebut memiliki satu warna saja. Dan setelah mereka mendengar tentang sifat – sifat ini mereka berkata: sekarang telah datang kebenaranmaka sungguh kami telah mengenal rupa dari sapi betina ini, dan ini menunjukkan atas kebohongan mereka dan keangkuhan mereka; kemudian mereka membahas tentang sapi betina ini dengan sifat – sifatnya sampai kepada keputusan akhir serta menyembelih sapi betina , hampir – hampir mereka tidak membatasi sapi betina karena sebab sifat – sifatnya yaitu disebabkan karena mereka banyak bertanya serta kesombongan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena sapi sesuai syarat yang disebutkan itu sukar diperoleh, hampir mereka tidak dapat menemukannya. Demikianlah, ketika mereka memperberat diri dengan banyak bertanya, maka Allah memberatkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 71",
    "description": "Karena permintaan-permintaan itu, kemudian nabi musa memohon kepada Allah agar diberi keterangan lanjutan. Dan dia, musa, kemudian menjawab, dia berfirman dan menerangkan bahwa sapi itu adalah sapi betina yang belum pernah dipakai untuk membajak tanah dan tidak pula pernah dipergunakan mengangkut air untuk mengairi tanaman, badannya sehat tidak berpenyakit, dan tanpa belang. Sesudah itu, kemudian mereka berkata, sekarang barulah engkau menerangkan hal yang sebenarnya tentang sapi itu. Lalu mereka menyembelihnya setelah menemukan sapi dengan ciri-ciri yang dijelaskan, dan nyaris mereka tidak dapat melaksanakan perintah itu karena sulitnya menemukan sapi dengan segala ciri yang mereka tanyakan. Latar belakang dari perintah penyembelihan sapi ini adalah terbunuhnya seorang tua yang kaya di kalangan bani israil yang belum terungkap pelakunya. Karena permohonan yang diajukan, maka Allah mengingatkan mereka dengan mengatakan dan ingatlah ketika salah seorang dari kamu membunuh seseorang yang tidak bersalah, lalu kamu tuduh-menuduh tentang peristiwa misterius itu. Akan tetapi, Allah dengan kehendak-Nya kemudian menyingkapkan apa yang kamu sembunyikan. Peristiwa ini menunjukkan bahwa Allah itu maha mengetahui apa saja yang tampak jelas atau yang disembunyikan."
  }
]