[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami berfirman: “pukullah korban pembunuhan itu dengan bagian tubuh dari sapi betina yang telah disembelih itu, maka Sesungguhnya Allah akan membangkitkan nya dalam keadaan hidup dan ia akan memberitahukan kepada kalian siapa orang yang membunuhnya. Lalu mereka memukulnya dengan salah satu bagian tubuh sapi tu, maka Allah menghidupkannya dan dia memberitahukan siapa pembunuhnya. Seperti itulah Allah menghidupkan orang-orang yang mati pada hari kiamat, dan memperlihatkan kepada kalian -wahai Bani Israil- mukjizat-mukjizat Nya yang menunjukkan kesempurnaan kuasa Allah, Supaya kalian berpikir dengan akal kalian sehingga kalian bisa menahan diri dari perbuatan maksiat kepada Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Lalu Kami berfirman kepada kalian, “Pukullah korban pembunuhan itu dengan bagian dari tubuh sapi betina yang kalian sembelih atas perintah Allah. Karena Allah akan menghidupkannya kembali untuk memberitahukan siapa pembunuhnya.” Mereka benar-benar melakukan hal itu dan korban pembunuhan itupun memberitahukan siapa pembunuhnya. Sebagaimana Allah menghidupkan kembali orang yang sudah mati itu, begitulah kelak Allah akan menghidupkan kembali orang-orang yang mati di hari kiamat. Allah memperlihatkan kepada kalian bukti-bukti kekuasaan-Nya secara nyata, agar kalian memahaminya dan beriman kepada Allah -Ta'ālā- dengan sungguh-sungguh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Kemudian Kami memerintahkan agar si terbunuh dipukul dengan salah satu bagian tubuh sapi betina yang telah disembelih. Lalu mereka melakukannya, sehingga Allah menghidupkannya kembali dan mengabarkan siapa yang membunuh dirinya. Demikianlah Allah menghidupkan orang mati dengan kuasa-Nya dan menunjukkan kepada kalian tanda-tanda kekuasaan-Nya. Hal ini agar kalian berfikir dengan akal kalian dan agar kalian mengetahui kekuasaan Allah untuk membangkitkan makhluk yang telah mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. فَقُلْنَا اضْرِبُوهُ بِبَعْضِهَا ۚ (Pukullah mayat itu dengan sebahagian anggota sapi betina itu!) Yakni dengan bagian dari anggota tubuh sapi itu. Dan mereka pun memuluknya lalu Allah menghidupkan mayat itu. كَذَٰلِكَ يُحْيِي اللَّهُ الْمَوْتَىٰ (Demikianlah Allah menghidupkan kembali orang-orang yang telah mati) Yakni menghidupkan sebagaimana menghidupkan mayat ini. وَيُرِيكُمْ آيَاتِهِ (dan memperlihatkan padamu tanda-tanda kekuasaan-Nya) Yakni tanda-tanda yang menunjukkan kesempurnaan kekuasaan Allah. Maka setelah mayat itu dihidupkan, mayat itu berkata: Fulan-lah yang membunuhku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Lalu kami berfirman: “Pukullah korban yang terbunuh itu dengan salah satu anggota tubuh sapi betina yang telah disembelih itu. Kemudian mereka memukulnya, lalu Allah menghidupkannya dan memberitahu kepada mereka tentang siapa pembunuhnya. Seperti itulah Allah menghidupkan orang-orang mati pada hari kiamat dan menunjukkan kepada kalian tanda-tanda atas sempurnanya kekuasaanNya supaya kalian mengetahui kekuasaanNya. Bekerja keraslah kalian dalam (menjalankan) perkara yang telah diperintahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami berfirman, “Pukullah (mayat) itu dengan bagian dari itu”} bagian dari sapi betina yang disembelih itu {Demikianlah Allah menghidupkan (orang) yang telah mati dan memperlihatkan kepada kalian tanda-tanda (kekuasaan)Nya agar kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72-73. Dan ketika mereka menyembelihnya, kami berkata kepada mereka; pukullah yang terbunuh itu dengan sebagian dari sembelihan tersebut, maksudnya dengan salah satu organ tubuhnya, organ tertentu ataupun organ mana saja darinya, karena dalam penentuannya juga tidak ada gunanya. Lalu mereka memukulnya dengan sebagiannya kemudian Allah menghidupkannya kembali, dan mengemukakan apa yang mereka sembunyikan, lalu Allah mengabarkan tentang pelaku pembunuhan, dan dalam tindakan Allah menghidupkannya –sedang mereka menyaksikan- adalah suatu dalil bahwa Allah itu menghidupkan yang mati agar kalian berpikir hingga kalian menghindari segala yang memudaratkan diri kalian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بِبَعۡضِهَاۚ } bi ba’dhihaa : Dengan bagian organ tubuh tertentu dari sapi tersebut seperti bagian lidahnya, atau kakinya. Makna ayat : Lantas Allah memerintahkan kalian agar memukul mayat dengan sebagian organ tubuh sapi betina, agar mayat itu hidup dan memberi tahukan siapa pembunuhnya. Akhirnya kalian melakukannya dan Allah menghidupkan mayat itu serta memberitahukan siapa pembunuhnya, dan dibunuhlah pelakunya. Allah Ta’ala ingin memperlihatkan melalui perantara kisah ini sebuah ayat dari ayat-ayatNya yang menunjukkan tentang kebijaksanaanNya, ilmuNya, kekuasaanNya. Sepantasnya kalian memikirkannya sehingga keimanan, akhlak, dan ketaatan kalian menjadi sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 73: Berkata Musa kepada bani israil: Ambillah oleh kalian anggota badan diantara daging – daging sapi betina ini yang telah kalian sembelih, dan tampakkanlah oleh kalian yang menyembelih; maka Allah menghidupkan sapi betina tersebut dan mengabarkan siapa yang membunuhnya, kemudian Allah mengabarkan bahwasannya sebagaimana mayit yang ada didepan mata – mata kalian, akan Allah hidupkan dari kematian di hari kiamat kelak; agar kalian mengetahui kesempurnaan kuasa Allah dan juga agar kalian kembali berfikir serta menahan dari kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu Allah menghidupkan mayat itu, lantas mayat itu memberitahukan siapa pembunuhnya. Yakni seperti itulah Allah menghidupkan orang-orang yang telah mati pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 73",
    "description": "Sesudah sapi yang ditetapkan itu disembelih, lalu kami berfirman, pukullah mayat itu dengan bagian dari potongan atau daging sapi itu! dengan izin-Nya hiduplah orang yang sudah terbunuh itu. Demikianlah Allah memperlihatkan kekuasaan-Nya dengan menghidupkan kembali orang yang telah mati untuk mengungkap pelaku pembunuhan, dan dia dengan peristiwa ini memperlihatkan kepadamu tanda-tanda kekuasaannya agar kamu mengerti dan percaya akan adanya hari kebangkitan yang pasti akan terjadi kelak. Ayat-ayat berikut menerangkan respons kaum yahudi pada masa nabi Muhammad tentang kisah kakek moyangnya. Kemudian setelah kamu, kaum yahudi, mendengar kisah dan mengetahui sikap mereka itu, hatimu menjadi keras, sehingga menjadi seperti batu, atau bahkan lebih keras dari batu. Ungkapan ini mengisyaratkan bahwa mereka tetap tidak mau beriman walaupun telah mengetahui bukti-bukti kekuasaan Allah, seperti yang disebutkan pada ayat sebelumnya, bahkan mereka justru bertambah ingkar kepada tuhan. Padahal, dari batu-batu itu pasti ada sungai-sungai yang airnya memancar daripadanya, sementara dari celah hatimu tidak ada setitik cahaya ketakwaan yang memancar. Di antara batu itu ada pula yang terbelah lalu keluarlah mata air daripadanya, tetapi hatimu tertutup rapat sehingga tidak ada cahaya ilahi yang terserap. Dan ada pula di antara batu itu yang meluncur jatuh karena tunduk dan takut kepada azab Allah, sedangkan hatimu semakin menunjukkan kesombongan yang tampak dari sikap dan tingkah lakumu. Bila kamu tidak mengubah sikap dan terus dalam keangkuhan, ketahuilah bahwa Allah tidaklah lengah atau lalai terhadap apa yang kamu kerjakan. Allah pasti mengetahui semua yang kamu perbuat, karena dia selalu mengawasimu setiap saat."
  }
]