[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi kalian tidak mendapatkan manfaat sedikitpun dari kejadian itu, sebab setelah ditampakannya mukjizat-mukjizat yang luar biasa ini, hati-hati kalian justru dan mengeras dan membeku, sehingga tidak ada kebaikan yang dapat sampai kepadanya, dan tidak dapat melunak dihadapan tanda-tanda kuasa Ku yang mencengangkan itu yang aku Perlihatkan kepada kalian semua, sehingga hati-hati kalian menjadi seperti batu hitam yang amat keras, bahkan sebenarnya hati-hati mereka jauh lebih keras dari batu itu, karena sebagian bebatuan itu ada yang melebar dan berongga sehingga bisa mengalir darinya dengan kuat, maka ia menjadi sungai-sungai yang mengalir. Dan sebagian batuan ada yang terbelah dan pecah,maka keluarlah darinya mata air dan sumber air. Dan sebagian bebatuan bahkan ada yang jatuh dari gunung yang tinggi karena takut kepada Allah dan mengagungkan Nya. dan Allah tidak pernah lalai terhadap apa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Kemudian hati kalian mengeras hingga menjadi seperti batu atau lebih keras lagi setelah menerima nasihat-nasihat yang menyentuh dan menyaksikan mukjizat-mukjizat yang nyata. Hati mereka tidak pernah berubah, sementara batu bisa berubah bentuknya. Karena terkadang ada batu yang memancarkan air hingga membentuk sungai. Ada juga batu yang retak-retak kemudian mengeluarkan air yang mengalir ke bumi dan dimanfaatkan oleh manusia dan binatang. Dan ada juga batu yang jatuh dari atas gunung karena takut kepada Allah. Sementara hati kalian tidak bisa begitu. Allah tidak akan lalai terhadap apa yang kalian perbuat. Dia mengetahuinya dan akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Setelah mereka menyaksikan ayat-ayat Allah yang jelas, mereka tetap enggan mentaati-Nya, hal ini membuat hati mereka menjadi keras karena tidak bermanfaat bagi mereka nasehat. Hati seperti ini tidak akan menjadi lembut dan khusyu', ia keras bagaikan batu, bahkan lebih keras; karena batu dapat terpengaruh, sebagian batu dapat mengeluarkan air yang banyak hingga membentuk sungai, sebagian lainnya dapat terbelah dan mengeluarkan mata air, dan sebagian lainnya jatuh terhempas dari ketinggian akibat rasa takut terhadap Allah. Dan Allah tidaklah lalai terhadap apa yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. ثُمَّ قَسَتْ قُلُوبُكُمْ (kemudian hatimu menjadi keras seperti batu) Yakni kosong dari ketaatan kepada ayat-ayat Allah padahal sebab-sebab agar hati tidak menjadi keras telah ada seperti hidupnya kembali mayat yang kemudian berbicara dan menentukan siapa pembunuhnya. مِنْ بَعْدِ ذَٰلِكَ (setelah itu) Yakni setelah Allah menunjukkan bagaimana menghidupkan sapi dan mayat. وَإِنَّ مِنَ الْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ الْأَنْهَارُ ۚ (Padahal diantara batu-batu itu sungguh ada yang mengalir sungai-sungai dari padanya) Yakni kemudian Allah memberi uzur bagi batu-batu akan tetapi tidak memberi uzur bani Adam. Yakni sebagian batu yang keras lebih lembut dibandingkan dengan hati kalian dalam hal kebenaran yang kalian akui. وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ الْمَاءُ ۚ (dan diantaranya sungguh ada yang terbelah lalu keluarlah mata air dari padanya) Dan ini adalah fenomena yang banyak kita dapatkan dibanyak tempat. وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ ۗ (dan diantaranya sungguh ada yang meluncur jatuh, karena takut kepada Allah) Dan ini juga adalah fenomena yang banyak kita dapatkan ketika batu yang besar jatuh dari puncak gunung dan menggelinding ke bawah dengan perintah Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara faidah penyerupaan kerasnya hati dengan kerasnya batu; padahal kenyataannya tidaklah hati itu sekeras batu : bahwasanya besi dan dan peluru jika dimasukkan kedalam api dia akan mencair, berbeda dengan batu. 2 ). Sebagaimana kamu melihat bebatuan itu hancur, dalam diri seorang mukmin juga ada tekanan yang menimbulkan adanya kecendrungan yang kuat untuk jatuh karena takut kepada Allah, dan angin-angin kerinduan semakin kencang mengantam rantingnya yang lemah; sehingga membuatnya tunduk dan rukuk dihadapan Allah -جل جلاله- ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian hati mereka mengeras (menolak) dari kebenaran dan tidak mau tunduk kepada ayat-ayat Allah setelah melihat peristiwa itu. Hati mereka seperti batu yang sangat keras bahkan lebih keras lagi. Akan tetapi di antara batu-batu itu, ada (batu-batu) yang lebih lembut daripada hati kalian. Sebagian dari batu-batu itu memancar darinya air sungai dan sebagian lainnya terbelah sehingga keluarlah darinya mata air kecil, dan sebagian lain dari batu-batu itu jatuh karena takut kepada Allah sebagaimana jatuhnya gunung di hadapan Musa. Dan hati kalian tidak menjadi lembut (setelah melihat peristiwa itu). Sesungguhnya Allah memperhatikan amal perbuatan kalian dan tata cara kalian melaksanakannya (sampai) hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian menjadi keras} menjadi keras dan kaku {hati kalian setelah itu hingga seperti batu, bahkan lebih keras. Padahal, dari batu-batu itu pasti ada sungai-sungai yang memancar. Ada pula yang terbelah} terbelah {lalu keluarlah mata air darinya, dan ada lagi yang jatuh} jatuh dari ketinggian gunung {karena takut kepada Allah. Allah tidaklah lengah terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Kemudian hatimu menjadi keras, ” maksudnya mengeras dan menebal hingga nasihat tidak mampu berpengaruh padanya “setelah itu”, maksudnya, setelah Allah memberikan nikmat atas kalian dengan nikmat-nikmat yang besar dan memperlihatkan kepada kalian ayat-ayatNya, dan seharusnya tidaklah patut hati-hati kalian menjadi keras, karena apa yang kalian saksikan sendiri seharusnya menimbulkan kelembutan hati dan ketundukannya. Kemudian Allah menerangkan tentang kekerasan hati mereka yaitu bahwasanya ia, ”seperti batu” yang lebih keras daripada besi, karena besi dan timah apabila dibakar dalam api, niscaya akan meleleh, berbeda dengan batu. Dan firmanNya, “atau lebih keras lagi, ” maksudnya bahwa ia tidaklah terbatas hanya sekeras batu, dan (atau) di sini tidaklah bermakna (bahkan). Kemudian Allah menyebutkan tentang keutamaan batu atas hati mereka seraya berfirman, “padahal di antara batu-batu itu sungguh ada yang mengalir sungai-sungai dari padanya dan di antaranya sungguh ada yang terbelah lalu keluarlah mata air dari padanya dan di antaranya sungguh ada yang meluncur jatuh, karena takut kepada Allah.” Maka dengan sifat-sifat itu, batu itu melebihi keutamaan hati mereka. Kemudia Allah mengancam mereka dengan ancaman yang paling keras seraya berfirman, “dan Allah sekali-kali tidak lengah dari apa yang kamu kerjakan , ” bahkan Allah sangat mengetahuinya, menghafalnya, baik kecil maupun besar, dan kalian akan di beri balasan atas perbuatan kalian dengan balasan yang paling sempurna dan paling penuh. Ketahuilah bahwasanya kebanyakan para ahli tafsir telah memperbanyak penyisipan cerita-cerita Bani Israil dalam tafsir mereka, dan memaknai ayat-ayat al-Qu’an menurut cerita-cerita tersebut. Mereka berhujjah dengan sabda Nabi sholallohu ‘alihi wasallam : “ceritakan tentang Bani Isroil, tida apa-apa” (HR. Bukhori : 3461) Dan menurut hemat saya adalah bahwasanya bila pun boleh meriwayatkan cerita-cerita mereka adalah dalam bentuk dialokasikan tersendiri tanpa dikaitkan dan tidak pula menjadi makna dasar atas kitabullah, karena sesungguhnya menjadikannya sebagai tafsir bagi kitabullah tidaklah boleh sama sekali apabila tidak shahih kabarnya dari Rosululloh sholallohu ‘alaihi wasallam, hal itu jika derajatnya seperti yang Nabi sabdakan : “jangan membenarkan ahli kitab dan jangan juga mendustakan mereka” (HR. Bukhori : 4485) Apabila derajatnya diragukan, dan suatu hal yang pasti diketahui dalam agama islam bahwasanya al-Qur’an itu wajib di imani dengan keyakinan bulat, baik kata-katanya maupun makna-maknanya, oleh karena itu tidak boleh menjadikan cerita-cerita tersebut yang diriwayatkan secara majhul (tidak di ketahui) yang kemungkinan besar menurut akal adalah cerita dusta atau mayoritasnya adalah dusta, sebagai makna-makna al-Qur’an sebagai suatu yang pasti dan tidak ada seorang pun yang meragukannya, akan tetapi karena kelalaian terhadap hal ini akhirnya terjadilah apa yang terjadi. Hanya Allah sajalah Dzat yang membimbing."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Akan tetapi hati kalian justru menjadi keras dan membatu bahkan lebih keras lagi dari batu karena hati kalian tidak bisa lembut, lunak, dan merasa khusyu’. Berbanding terbalik dengan bebatuan, ada diantaranya yang memancarkan mata air, ada juga yang jatuh karena merasa takut kepada Allah Ta’ala seperti bukit Thursina yang berguncang tatkala Allah menampakkan diriNya, begitu juga seperti berguncangnya gunung Uhud tatkala berada di bawah kaki Rasulullah ﷺ dan para sahabatnya. Kemudian Allah Ta’ala memberikan peringatan keras bahwasanya Dia tidak pernah lalai atas kelakuan kalian ketika melakukan dosa-dosa, dan akan membalas kalian dengan balasan yang setimpal jika kalian tidak bertaubat kepadaNya dan kembali ke jalan yang benar. Pelajaran dari ayat : • Orang-orang Yahudi adalah manusia yang paling keras hatinya sampai hari ini. Setiap tahun mereka merekayasa bencana sedang mereka tertawa gembira. • Termasuk tanda celaka adalah kerasnya hati, dalam hadits disebutkan;”Barangsiapa yang tidak menyayangi, tidak disayangi.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 74: Setelah ayat – ayat yang sangat gamblang dan mukjizat yang diluar batas dimana pembicaraan berkenaan dengan kalian bani israil, tidak akan bermanfaat bagi kalian dan tidak akan kalian bersegera memenuhi perintah Allah; bahkan hati- hati kalian menyelisihi dan semakin menolak nikmat yang banyak yang telah Allah berikan; sampai – sampai menjadi semakin keras sebagaimana bebatuan atau lebih keras dari batu tersebut; bahkan sesungguhnya diantar bebatuan ada diantaranya lebih lembut dari hati – hati kalian; Dimana sebagiannya memancar dan mengalir padanya sungai – sungai, dan diantaranya terpecah mengeluarkan air darinya mendapat disaksikan di negeri – negeri manapun, dan diantaranya ada yang jatuh dari ketinggian gunung karena takut Allah. ketauilah oleh kalian bahwasannya Allah tidak lalai dari perbuatan – perbuatn kalian; bahkan maha tahu akan hal tersebut dan maha menjaga, Allah akan membalas kalian dihari kiamat yaitu hari pembalasan dan hisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah dikaruniakan berbagai macam nikmat dan diperlihatkan ayat-ayat-Nya. Mereka tidak dapat mengambil pelajaran daripadanya, bahkan hati mereka malah menjadi keras seperti batu atau lebih keras lagi sehingga sulit ditembus oleh kebaikan, oleh nasehat dan tidak lunak di hadapan ayat-ayat Allah yang begitu jelas. Ya, hati mereka lebih keras daripada batu, padahal di antara batu itu ada yang memancarkan air, ada yang terbelah, bahkan ada yang meluncur dari tempat yang tinggi karena takut kepada Allah Subhaanahu wa Ta'aala. Di akhir ayat ini, Allah mengancam mereka dengan ancaman yang keras, yakni bahwa Dia tidak lalai terhadap apa yang mereka kerjakan, bahkan mengetahuinya baik yang kecil maupun yang besar dan nanti Dia akan memberikan pembalasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 74",
    "description": "Ayat-ayat berikut menerangkan respons kaum yahudi pada masa nabi Muhammad tentang kisah kakek moyangnya. Kemudian setelah kamu, kaum yahudi, mendengar kisah dan mengetahui sikap mereka itu, hatimu menjadi keras, sehingga menjadi seperti batu, atau bahkan lebih keras dari batu. Ungkapan ini mengisyaratkan bahwa mereka tetap tidak mau beriman walaupun telah mengetahui bukti-bukti kekuasaan Allah, seperti yang disebutkan pada ayat sebelumnya, bahkan mereka justru bertambah ingkar kepada tuhan. Padahal, dari batu-batu itu pasti ada sungai-sungai yang airnya memancar daripadanya, sementara dari celah hatimu tidak ada setitik cahaya ketakwaan yang memancar. Di antara batu itu ada pula yang terbelah lalu keluarlah mata air daripadanya, tetapi hatimu tertutup rapat sehingga tidak ada cahaya ilahi yang terserap. Dan ada pula di antara batu itu yang meluncur jatuh karena tunduk dan takut kepada azab Allah, sedangkan hatimu semakin menunjukkan kesombongan yang tampak dari sikap dan tingkah lakumu. Bila kamu tidak mengubah sikap dan terus dalam keangkuhan, ketahuilah bahwa Allah tidaklah lengah atau lalai terhadap apa yang kamu kerjakan. Allah pasti mengetahui semua yang kamu perbuat, karena dia selalu mengawasimu setiap saat. Sesudah menjelaskan sikap orang yahudi, maka kemudian mengingatkan nabi Muhammad dan umat islam dengan mengajukan pertanyaan, yaitu apakah kamu, kaum muslim, sangat mengharapkan mereka akan percaya kepadamu, meyakini kerasulan nabi Muhammad, dan beriman pada petunjuk Al-Qur'an' hal seperti ini mustahil dapat terwujud, sedangkan segolongan dari mereka sudah mendengar dan mengetahui firman Allah yang terdapat pada kitab taurat lalu mereka mengubahnya setelah memahaminya dan menafsirkannya sekehendak hati, padahal mereka, yaitu kaum yahudi madinah, mengetahuinya bahwa taurat itu berisi petunjuk bagi mereka."
  }
]