[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang muslimin, Apakah kalian lupa terhadap tindakan-tindakan Bani Isroil, sampai jiwa kalian berhasrat kuat agar kaum Yahudi membenar agama kalian?. Dan sungguh para ulama mereka mendengarkan firman Allah yang berasal dari kitab Taurat, kemudian mereka mengubahnya dengan cara menyimpangkan ke makna yang bukan sebenarnya setelah mereka memahami hakikat nya, atau dengan cara mengubah-ubah teks bacaannya, sedang mereka itu menyadari bahwa mereka mengubah-ubah firman Tuhan alam semesta dengan sengaja dan dusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Wahai orang-orang mukmin, setelah kalian mengetahui keadaan orang-orang Yahudi dan Nasrani yang sebenarnya serta sikap keras kepala mereka, apakah kalian masih mengharapkan mereka akan beriman dan menyambut dakwah kalian?! Dahulu ada sejumlah ulama mereka yang mendengar firman Allah yang diturunkan kepada mereka di dalam Taurat, kemudian mereka merubah lafal-lafal dan maknanya setelah mereka memahaminya dan mengerti maksudnya, padahal mereka tahu bahwa tindakan mereka itu adalah dosa besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Hai orang-orang yang beriman, apakah kalian berharap orang-orang Yahudi akan membenarkan kalian dan masuk ke agama kalian? Ada segolongan pendeta mereka yang telah mendengar firman Allah dalam Taurat beserta hukum-hukum yang terkandung di dalamnya, kemudian mereka sengaja mengubah firman itu setelah mereka memahaminya, padahal mereka mengetahui bahwa mereka melakukan dosa yang besar saat mengubah firman Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. أَفَتَطْمَعُونَ أَنْ يُؤْمِنُوا لَكُمْ (Apakah kamu masih mengharapkan mereka akan percaya kepadamu) Yakni apakah kamu masih mengharapkan mereka akan percaya kepadamu dan menyambut dakwahmu ketika kamu menyeru kepada mereka untuk beriman kepada Allah dan rasul-Nya. كَلَامَ اللَّهِ (firman Allah) Yakni taurat. ثُمَّ يُحَرِّفُونَهُ (lalu mereka mengubahnya) Termasuk dari (التحريف) merubah dengan menambah kata-kata dalam taurat atau menguranginya, atau dengan menggantinya sesuai dengan apa yang mereka inginkan; Termasuk dari (التحريف) pula bahwa mereka sengaja mengubah apa yang mereka dengar dari taurat kemudian menjadikan yang halal menjadi haram, dan lain sebagainya demi mengikuti hawa nafsu mereka, seperti mengubah sifat yang ada pada Rasulullah dan menghapus apa yang menjadi bukti kebenaran Rasulullah dan kenabiannya yang terdapat dalam taurat, dan menghilangkan hukuman bagi pembesar-pembesar mereka. مِنْ بَعْدِ مَا عَقَلُوهُ (setelah mereka memahaminya) Yakni setalah memahaminya dengan akal mereka. Padahal mereka telah mengetahui apa yang mereka lakukan dengan merubah kalamullah adalah menyalahi apa yang Allah perintahkan yakni perintah untuk menyampaikan syari’at-syari’at-Nya sebagaimana yang ada. Maka bagaimana kamu mengharapkan mereka akan masuk Islam, sedang mereka memiliki hati yang keras yang menyepelekan syari’at-syari’at Allah sehingga iman kepada Allah dan ketakutan kepada-Nya tidak menbuat mereka berhenti melakukan hal itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah telah mengkhususkan sifat kaum Yahudi yang kerap merubah kalimat-kalimat firman Allah dalam al-Qur'an, dan sekarang ini sebagaimana yang disampaikan oleh kementrian luar Negri zionis Israil mereka tengah merencanakan suatu proyek yang mendunia untuk menafsirkan al-Qur'an dengan judul : ( Qur'anat ) dengan tujuan (sebagaimana yang mereka sangka) sebagai alat pendidikan; maka sepatuhnya setiap muslim waspada agar tidak terjerumus kedalam perangkap ini, dan senantiasa merenungi perkataan dzat yang menciptakan mereka : { أَفَتَطْمَعُونَ أَنْ يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ } \"Apakah kamu masih mengharapkan mereka akan percaya kepadamu, padahal segolongan dari mereka mendengar firman Allah, lalu mereka mengubahnya setelah mereka memahaminya, sedang mereka mengetahui?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai orang-orang mukmin! Apakah kalian mengharapkan orang Yahudi itu membenarkan risalah nabi kalian, Muhammad SAW? Sungguh sebagian pendeta mereka membaca kalam Allah dalam Taurat, kemudian mereka memalsukannya dengan menambah, mengurangi atau menggantinya dengan hal lain untuk mengharamkan sesuatu yang halal dan menghalalkan sesuatu yang haram sesuai hawa nafsu mereka. Seperti halnya mereka mengubah penggambaran Rasulallah SAW dengan menggambarkannya sebagai seorang yang tinggi dan kecoklat-coklatan sebagai ganti gambaran nabi Muhammad SAW (yang setengah tinggi dan putih) dan menggambarkannya sebagai orang yang menurunkan derajat kemuliaan mereka. Mereka mengubah (isi) Taurat setelah memahaminya dengan akal mereka. Mereka mengetahui bahwa mereka adalah orang yang melakukan kebatilan dan kebohongan. Ayat ini turun kepada orang-orang yang mengubah ayat tentang ramalan dan penggambaran Muhammad SAW sebagaimana disebutkan oleh Al-Wahidy"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kalian ingin} apakah kalian berharap {bahwa mereka percaya kepada kalian, sedangkan segolongan mereka mendengar firman Allah} Taurat {kemudian mereka mengubahnya} mengubahnya {setelah memahaminya} mereka mengetahui dan memahaminya {padahal mereka mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Ayat ini adalah sebuah pemupusan akan harapan kaum Mukminin dari keimanan ahli kitab. Yakni janganlah kalian terlalu berharap mereka akan beriman, sedangkan akhlak mereka tidak mereka dan ada harapan kalian terhadap mereka, karena mereka dahulu merubah kalam Allah setelah mereka memahami dan mengetahuinya, lalu mereka membuat suatu makna yang tidak Allah kehendaki untuk menipu manusia bahwasanya makna-makna itu datangnya dari sisi Allah padahal itu bukanlah dari sisi Allah. Jika perilaku mereka terhadap kitab mereka sendiri –yang mana mereka meyakininya sebagai kemuliaan bagi mereka dan agama mereka-, mereka menghalangi manusia dari jalan Allah dengan kitab itu, maka bagimana mungkin mereka diharapkan percaya kepada kalian? Hal ini adalah perkara yang mustahil."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَفَتَطۡمَعُونَ } A fatathma’uuna : Hamzah di sini berperan sebagai kata tanya untuk pengingkaran dan menunjukkan sesuatu itu tidak akan terjadi. Thoma’ adalah terkaitnya diri pada sesuatu karena menginginkannya. { يُؤۡمِنُواْ لَكُمۡ } yu’minuu lakum : Mereka mengikuti kalian dalam beragama Islam. { كَلَٰمَ ٱللَّهِ } kalaamallah : Firman Allah dalam kitab-kitabNya seperti Taurat, Injil, dan al-Qur’an. { يُحَرِّفُونَهُۥ } yuharrifuunahu : at-Tahrif adalah memelintir perkataan sehingga tidak sesuai dengan makna aslinya sebagaimana yang mereka katakan mengenai karakteristik Rasulullah dalam kitab Taurat : Tajam pandangan matanya, perawakannya tinggi semampai, rambutnya keriting, dan tampan rupanya. Diganti menjadi : Tinggi perawakannya, dua matanya berwarna hijau, dan lurus rambutnya. Makna ayat : Allah Ta’ala mengingkari ambisi orang-orang mukmin yang menginginkan orang Yahudi untuk beriman kepada Nabi dan agama mereka, dan mengingatkan orang mukmin ketidakmungkinan itu dengan berbagai penjelasan mengenai watak orang Yahudi dahulu maupun sekarang, seperti berbuat curang, suka menipu dan rekayasa, melencengkan firman Allah, mengelabui, menyesatkan orang lain, sampai-sampai mereka tidak mendapat petunjuk kepada jalan yang benar. Maka orang yang begini keadaannya berat untuk diharapkan untuk bersih dari kemunafikan, berdusta, dan menyembunyikan kebenaran Pelajaran dari ayat : • Golongan manusia yang paling susah untuk tunduk dan menerima kebenaran adalah orang-orang Yahudi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 75: Kemudian Allah mengarahkan firmannya kepada orang – orang beriman dan berkata kepada mereka: Apakah kalian senang wahai orang – orang yang beriman akan hal keimanan orang – orang yaudi akan kitab – kitab kalian dan mengikuti nabi kalian?! dan sungguh kalian mengetahui bagaimana para ulama mereka yang mendengar firman Allah dari Taurat kemudian mereka memalingkan isinya setelah mereka mengetahunya, dan mereka mengetahui bahwasannya merubah firman Allah adalah bukan tujuan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dengan menafsirkannya dengan tafsir yang tidak benar setelah mengetahui makna yang sesungguhnya mapun dengan merubah lafaz-lafaznya, padahal mereka mengetahui bahwa mereka telah merubah firman Allah dengan sengaja dan berdusta. Terutama sekali yang mereka rubah adalah mengenai sifat-sifat Nabi Muhammad shallallahu 'alaihi wa sallam yang ada dalam Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 75",
    "description": "Sesudah menjelaskan sikap orang yahudi, maka kemudian mengingatkan nabi Muhammad dan umat islam dengan mengajukan pertanyaan, yaitu apakah kamu, kaum muslim, sangat mengharapkan mereka akan percaya kepadamu, meyakini kerasulan nabi Muhammad, dan beriman pada petunjuk Al-Qur'an' hal seperti ini mustahil dapat terwujud, sedangkan segolongan dari mereka sudah mendengar dan mengetahui firman Allah yang terdapat pada kitab taurat lalu mereka mengubahnya setelah memahaminya dan menafsirkannya sekehendak hati, padahal mereka, yaitu kaum yahudi madinah, mengetahuinya bahwa taurat itu berisi petunjuk bagi mereka. Keingkaran kaum yahudi tidak saja tecermin pada keingkaran mereka terhadap kerasulan nabi Muhammad, tetapi juga pada sikap munafiknya. Karakter ini nyata dan jelas apabila mereka berjumpa dengan orang-orang yang beriman dari kelompok sahabat nabi, mereka berkata, kami telah beriman sebagaimana kalian meyakini kerasulan Muhammad. Tetapi apabila mereka kembali kepada sesamanya, mereka bertanya kepada kelompoknya, apakah akan kamu ceritakan kepada mereka yang menjadi pengikut Muhammad apa yang telah diterangkan Allah kepadamu di dalam taurat tentang akan datangnya seorang rasul yang bernama ahmad'nama lain nabi Muhammad, sehingga mereka atau umat islam itu dapat menyanggah kamu dan menyalahkanmu di hadapan tuhanmu, karena kerasulan Muhammad itu memang benar dan tercantum dalam taurat. Karena itu tidakkah kamu mengerti bahwa bila ini terjadi, yaitu penjelasan tentang kerasulan Muhammad, berarti kamu telah melakukan hal yang bodoh' ayat ini turun untuk menegaskan bahwa kaum yahudi pada dasarnya mengakui kenabian Muhammad, namun mereka tidak mengimaninya."
  }
]