[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Yahudi itu jika mereka berjumpa dengan orang-orang yang beriman mereka berkata dengan lisan mereka, “kami beriman kepada agama kalian dan rasul kalian yang diisyaratkan dalam Kitab Taurat”, dan apabila sebagian orang munafik dari golongan Yahudi itu menyendiri bersama sebagian yang lainnya mereka berkata dengan pengingkaran, “Apakah kalian menyampaikan kepada kaum Mukminin berita yang Allah Jelaskan kepada kalian di dalam Taurat perihal Muhammad, sehingga menjadi penguat hujah bagi mereka terhadap kalian di hadapan Tuhan kalian pada hari kiamat? Tidakkah kalian itu paham dan waspada dari tindakan itu?”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Salah satu kontradiksi dan tipudaya yang ditunjukkan oleh orang-orang Yahudi ialah apabila mereka berjumpa dengan orang-orang Mukmin, mereka selalu mengakui kebenaran Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- dan keabsahan risalahnya, dan itu adalah kesaksian yang dikemukakan oleh Taurat. Namun ketika mereka berkumpul dengan sesama Yahudi mereka saling mencela satu sama lain gara-gara pengakuan tersebut, karena kaum Muslimin bisa menjadikan pengakuan atas kebenaran kenabian Muhammad itu sebagai dasar untuk menyudutkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Apabila orang-orang munafik dari golongan kaum Yahudi bertemu dengan orang-orang yang beriman kepada Allah dan rasul-Nya, mereka berkata: “Kami percaya bawa Muhammad adalah Rasulullah.” Namun jika mereka berkumpul dengan golongannya mereka berkata dengan penuh keingkaran: “Apakah kalian memberitahu pengikut Muhammad tentang ciri-ciri Muhammad yang telah dijelaskan Allah dalam Taurat, sehingga menjadi hujjah atas kalian bagi orang-orang beriman pada hari kiamat? Bukankah kalian memiliki akal yang mencegah kalian membicarakan hal itu sehingga kalian tidak dicela?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَإِذَا لَقُوا الَّذِينَ آمَنُوا (Dan apabila mereka berjumpa dengan orang-orang yang beriman) Yakni apabila orang-orang munafik dari kaum Yahudi bertemu dengan orang-orang beriman. قَالُوا آمَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ (mereka berkata: “Kamipun telah beriman,” tetapi apabila mereka berada sesama mereka saja) Yakni apabila mereka jauh dari orang yang tidak munafik dan hanya bersama golongan mereka saja, mereka mengejek orang-orang yang tidak munafik itu. قَالُوا أَتُحَدِّثُونَهُمْ بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ (lalu mereka berkata: “Apakah kamu menceritakan kepada mereka (orang-orang mukmin) apa yang telah diterangkan Allah kepadamu) Yakni yang telah diterangkan kepadamu berupa hukum atas azab yang ditimpakan kepada orang-orang Yahudi yang tidak beriman. Hal ini mereka katakan karena ada sekelompok orang Yahudi yang memeluk Islam kemudian menjadi orang-orang munafik; ketika masih dalam Islam mereka menceritakan kepada orang-orang mukmin arab tentang azab yang ditimpakan kepada bapak-bapak mereka. لِيُحَاجُّوكُمْ بِهِ (supaya dengan demikian mereka dapat mengalahkan hujjahmu) Yakni jangan ceritakan kepada mereka azab yang ditimpakan kepada orang-orang Yahudi yang tidak beriman karena itu akan menjadi dalil mereka untuk mengalahkanmu. أَفَلَا تَعْقِلُونَ (tidakkah kamu mengerti?) Yakni mengerti madharat bagimu yang ada dibalik pembicaraan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Apabila orang-orang munafik Yahudi itu bertemu dengan orang-orang yang beriman, mereka berkata: “Kami telah meyakini bahwa Muhammad adalah utusan Allah.” Namun, ketika mereka berkumpul kembali dengan kelompoknya, mereka berkata kepada kelompoknya mengenai berbagai sifat dan bukti kebenaran Nabi Muhammad SAW, serta bercerita tentang sebab para pendahulu mereka mendapatkan azab. Cerita itu, telah diungkapkan di dalam kitab Taurat kepada kaum Muslim. “Apa yang akan kalian katakan kepada para pengikut Muhammad, tentang semua yang telah Allah ajarkan kepada kalian dalam kitab Taurat? Apa yang akan kalian katakan tentang semua yang telah Allah turunkan kepada kalian, terhadap berbagai bukti kebenaran Muhammad? Kemudian, apakah kalian tidak tahu bahwa semua itu akan menjadi hujjah bagi mereka untuk menyanggah kalian?” Ibnu Abbas berkata: Apabila orang-orang munafik Yahudi bertemu dengan kaum Muslim, mereka mengatakan: “Kami telah meyakini bahwa sahabat kalian itu (yaitu: Nabi Muhammad SAW) adalah utusan Allah, akan tetapi Muhammad hanyalah diutus untuk kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mereka berjumpa dengan orang-orang yang beriman, mereka berkata, “Kami telah beriman.” Akan tetapi, apabila kembali kepada sesamanya, mereka bertanya, “Apakah kamu ceritakan kepada mereka} apakah kamu memberitahu para sahabat Muhammad {tentang apa yang telah diterangkan Allah kepada kalian} tentang apa yang Allah jelaskan kepada kalian di dalam Taurat tentang sifat Muhammad {sehingga mereka dapat menyanggah kalian tentang itu} supaya mereka bisa menyanggah perkataan kalian {di hadapan Tuhan kalian Apakah kalian tidak berpikir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. kemudian Allah menyebutkan tentang kisah kaum munafik ahli kitab seraya berfirman, “Dan apabila mereka berjumpa dengan orang-orang yang beriman, mereka berkata, ’kami pun telah beriman’.” Mereka menampakkan keimanan mereka secara lisan kepada kaum Muslimin yang tidak ada dalam hati mereka, “tetapi apabila mereka berada sesama mereka saja” di sisi mereka tidak ada seorang pun selain dari pemeluk agama mereka, maka berkatalah sebagian mereka kepada sebagian lain, “Apakah kamu menceritakan kepada mereka (orang-orang Mukmin) apa yang telah di terangkan Allah kepadamu?” yakni, apakah kalian menampakkan keimanan kalian kepada kaum Muslimin dan kalian kabarkan bahwasanya kalian itu sama seperti mereka? Hingga hal itu menjadi hujjah yang membela mereka yang justru memberatkan kalian.? Mereka berkata bahwasanya mereka telah mengakui bahwa apa yang kami jadikan pedoman adalah benar dan apa yang mereka jadikan pedoman adalah batil, lalu mereka behujjah terhadap kalian dengan hal itu pada sisi Rabb kalian, “tidakkah kamu mengerti?” maksudnya, tidakkah kalian memiki pikiran hingga kalian meninggalkan hal-hal yang menjadi hujjah melawan kalian?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { لَقُواْ ٱلَّذِينَ ءَامَنُواْ } Laquu ladziina aamanuu : Jika orang-orang munafik kalangan Yahudi bertemu dengan orang-orang mukmin mereka mengatakan,”Kami beriman dengan nabi dan agama kalian.” { أَتُحَدِّثُونَهُم } Atuhadditsuunahum : Hamzah disini merupakan kata tanya untuk pengingkaran. Pembicaraan yang dimaksud adalah memberitahukan kepada orang-orang mukmin mengenai sifat dan karakteristik Nabi ﷺ dalam kitab Taurat. { بِمَا فَتَحَ ٱللَّهُ عَلَيۡكُمۡ } Bima fatahallahu ‘alaikum : Yaitu saat orang-orang munafik dari kalangan Yahudi bertemu dengan pembesar-pembesarnya mereka mengingkari telah memberitahukan sifat dan karakter Nabi Muhammad dalam Taurat kepada orang-orang mukmin. Ini adalah suatu hal yang Allah bukakan ilmunya kepada orang Yahudi secara khusus, bukan untuk bangsa lainnya. { لِيُحَآجُّوكُم بِهِۦ } Liyuhaajjuukum bihi : Para pembesar itu mengatakan,”Jangan kalian beritahukan orang-orang mukmin dengan hal yang dikhususkan ilmunya kepada kalian oleh Allah, sampai orang-orang mukmin itu tidak berhujjah atas kalian dengan hal yang kalian beritahukan. Sehingga kalian akan kalah dan hujjah tegak atas kalian dan Allah akan mengadzab kalian.” Makna ayat : { وَإِذَا لَقُواْ ٱلَّذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّا } “Ketika mereka bertemu dengan orang-orang beriman mengatakan kami beriman.” Sejujurnya mereka hanya berdusta, jika mereka berkumpul dengan para pembesarnya, mereka akan saling mengingkari apa yang sudah diucapkan kepada kaum muslimin tentang benarnya kenabian Rasulullah dan benarnya agama Islam, beralasan bahwa apa yang mereka katakan itu akan menjadi hujjah bagi kemenangan kaum muslimin terhadap orang Yahudi di sisi Allah. Maha suci Allah, betapa rusaknya perasaan mereka dan buruknya pemahaman bahwa mereka menyangka apa yang disembunyikan tidak mungkin diketahui oleh Allah Ta’ala. Pelajaran dari ayat : • Buruknya mengingkari kebenaran setelah mengetahuinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 76: Kemudian Allah menyebutkan keadaaan orang – orang munafik dari kalangan orang yahudi yang jika mereka bertemu dengan orang – orang yang beriman mereka berkata dengan lisan – lisan mereka tanpa keimanan di dalam hati - hati mereka: sungguh kami beriman dengan agama kalian dan rasul kalian yang menyampaikan Taurat, maka jika orang – orang munafik menyendiri dari orang – orang yahudi sebagian atas sebagian yang lain berkata mengikari: Apakah kalian menampakkan kepada mereka keimanan dan mengabaikan kepada mereka dengan apa yang Allah jelaskan kalian di dalam Taurat dari urusan Muhammad sehingga menjadi hujjah bagi kami di sisi Allah di hari kiamat, bukankah kalian memiliki akal yang menjelaskan kepada kalian akan bahaya atas apa yang kalian kerjakan, dan apa yang padanya keburukan bagi kalian, serta menghalangi kalian dari pembicaraan kalian terhadap orang – orang yang beriman sehingga tegak hujjah bagi kalian di hari kiamat?."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kaum munafik dari kalangan Ahlul Kitab. Sebagian Bani Israil yang mengaku beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam itu pernah bercerita kepada orang-orang Islam, bahwa dalam Taurat memang disebutkan tentang kedatangan Nabi Muhammad shallallahu 'alaihi wa sallam, maka golongan lain menegur mereka dengan mengatakan: \"Mengapa kamu ceritakan hal itu kepada orang-orang Islam sehingga hujjah mereka bertambah kuat?\" Mereka takut menjadi bumerang bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 76",
    "description": "Keingkaran kaum yahudi tidak saja tecermin pada keingkaran mereka terhadap kerasulan nabi Muhammad, tetapi juga pada sikap munafiknya. Karakter ini nyata dan jelas apabila mereka berjumpa dengan orang-orang yang beriman dari kelompok sahabat nabi, mereka berkata, kami telah beriman sebagaimana kalian meyakini kerasulan Muhammad. Tetapi apabila mereka kembali kepada sesamanya, mereka bertanya kepada kelompoknya, apakah akan kamu ceritakan kepada mereka yang menjadi pengikut Muhammad apa yang telah diterangkan Allah kepadamu di dalam taurat tentang akan datangnya seorang rasul yang bernama ahmad'nama lain nabi Muhammad, sehingga mereka atau umat islam itu dapat menyanggah kamu dan menyalahkanmu di hadapan tuhanmu, karena kerasulan Muhammad itu memang benar dan tercantum dalam taurat. Karena itu tidakkah kamu mengerti bahwa bila ini terjadi, yaitu penjelasan tentang kerasulan Muhammad, berarti kamu telah melakukan hal yang bodoh' ayat ini turun untuk menegaskan bahwa kaum yahudi pada dasarnya mengakui kenabian Muhammad, namun mereka tidak mengimaninya. Ayat sebelumnya menguraikan sikap sebagian orang-orang yahudi yang menyem bunyikan kekafiran dan berpura-pura memeluk islam, sedang ayat ini mengingat kan mereka dan siapa pun yang berperilaku seperti mereka; tidakkah mereka tahu bahwa Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan'"
  }
]