[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka melakukan semua tindakan kejahatan ini, dan tidak sadar bahwasanya Allah mengetahui seluruh perkara yang mereka sembunyikan dan mereka tampakkan dengan terang-terangan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Orang-orang Yahudi itu melakukan perbuatan keji tersebut dan mereka seolah-olah lupa bahwa Allahmengetahui ucapan dan perbuatan yang mereka rahasiakan maupun yang mereka tampakkan, dan Dia akan menunjukkannya serta mempermalukan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Tidakkah orang-orang Yahudi yang sesat itu mengetahui bahwa Allah mengetahui kekafiran yang mereka sembunyikan, dan keimanan palsu yang mereka nampakkan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. أَوَلَا يَعْلَمُونَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ (Tidakkah mereka mengetahui bahwa Allah mengetahui segala yang mereka sembunyikan dan segala yang mereka nyatakan?) Yakni berupa urusan dan percakapan mereka apabila bertemu dengan orang-orang mukmin, dan apa yang mereka rahasiakan ketika berkumpul sesama mereka yang berupa kekafiran dan pendustaan mereka terhadap Nabi Muhammad Shallallahu ‘Alaihi Wasallam"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Tidakkah orang-orang munafik Yahudi itu tahu, bahwa Allah Maha Mengetahui tentang kekafiran dan dusta yang mereka sembunyikan, juga Maha Mengetahui kemunafikan yang mereka tampakkan. Disembunyikan atau ditampakkan, tidak akan ada perbedaan, Allah Maha Mengetahui atas segala sesuatu. Dan Allah akan memberi balasan atas setiap perbuatan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah mereka tahu bahwa sesungguhnya Allah mengetahui apa yang mereka sembunyikan} yang mereka sembunyikan {dan apa yang mereka umumkan} mereka tampakkan."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Ini adalah perkataan sebagian mereka kepada sebagian yang lain. “tidakkah mereka mengetahui bahwa Allah mengetahui segala yang mereka sembunyikan dan segala yang mereka nyatakan?” mereka itu walaupun menyembunyikan apa yang mereka yakini di antara mereka saja, dan mereka mengira bahwasanya dengan tindakan menyembunyikan itu tidak ada jalan bagi kaum Mikminin berhujjah atas mereka, maka sesungguhnya hal itu adalah suatu kesalahan dan kebodohan yang besar dari mereka, karena Allah mengetahui yang rahasia dan yang terang-terangan dari mereka, lalu Allah menampakkan keadaan mereka kepada hamba-hambaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Allah ta’ala mengancam orang-orang Yahudi dalam firmanNya { أَوَ لَا يَعۡلَمُونَ أَنَّ ٱللَّهَ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَ } “Tidakkah mereka mengetahui bahwa Allah mengetahui segala yang mereka sembunyikan dan segala yang mereka nyatakan.” Pelajaran dari ayat : • Buruknya kebodohan terhadap Allah dan sifat-sifatNya yang Maha tinggi serta nama-namaNya yang indah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 77: Kemudian Allah menghinakan mereka yahudi karena kebodohan mereka dengan hakekat ilmu Allah, Allah berkata: tidakkah mereka orang – orang yahudi munafik dari bani israil mengetahui bahwasannya Allah Maha Tahu atas apa yang mereka sembunyikan dari kekufuran dan kedengkian kepada orang – orang beriman, dan apa yang mereka tampakkan dari keimanan palsu yang tidak ada hakekat keimanan padanya?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengira bahwa kemunafikan yang mereka sembunyikan dan pembicaraan rahasia antara sesama mereka tidak ada yang mengetahui, maka Allah Subhaanahu wa Ta'aala membatalkan sangkaan tersebut dengan firman-Nya di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 77",
    "description": "Ayat sebelumnya menguraikan sikap sebagian orang-orang yahudi yang menyem bunyikan kekafiran dan berpura-pura memeluk islam, sedang ayat ini mengingat kan mereka dan siapa pun yang berperilaku seperti mereka; tidakkah mereka tahu bahwa Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan' setelah kelakuan kelompok cendekia dan tokoh agama yahudi dijelaskan pada ayat-ayat sebelumnya, ayat-ayat berikut menjelaskan kelompok lain di kalangan bani israil, yaitu bahwa di antara mereka ada yang buta huruf, tidak bisa membaca dan menulis, atau bodoh dan keras hati, tidak memahami makna dan pesan kitab taurat dengan pemahaman yang penuh penghayatan, kecuali hanya berangan-angan berupa kebohongan yang disajikan oleh pemuka agama mereka dan dikatakan sebagai kebenaran, dan mereka hanya menduga-duga, sebab ka lau pun mereka membacanya, itu tidak dilakukan dengan disertai pemahaman yang men dalam."
  }
]