[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara kaum Yahudi ada segolongan yang tidak tahu tentang baca dan tulis, serta mereka tidak tahu tentang Taurat dan kandungannya yang memuat sifat-sifat nabi Allah dan rasulnya Muhammad Shallallahu Alaihi Wasallam, dan mereka tidak mempunyai sesuatu pengetahuan apapun dari Taurat itu selain kedustaan-kedustaan dan praduga-praduga yang rusak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Di antara orang Yahudi itu ada golongan yang tidak mengenal Taurat kecuali bacaannya saja, mereka tidak tahu apa maksudnya. Mereka hanya memiliki kebohongan-kebohongan yang mereka dengar dari para pembesar. Mereka mengira bahwa kebohongan-kebohongan itu adalah kitab suci Taurat yang diturunkan oleh Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Dalam kaum Yahudi terdapat golongan yang jahil dan awam yang tidak dapat membaca atau menulis, mereka tidak mengetahui Taurat melainkan dari kedustaan yang mereka dengarkan dan prasangka yang tidak benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَمِنْهُمْ أُمِّيُّونَ (Dan diantara mereka ada yang buta huruf) Yakni sekelompok orang Yahudi yang belum pernah belajar menulis dan tidak mampu untuk membaca. لَا يَعْلَمُونَ الْكِتَابَ إِلَّا أَمَانِيَّ (tidak mengetahui Al Kitab (Taurat), kecuali dongengan bohong belaka) Yakni mereka tidak mengetahui hakikat sebenarnya apa yang datang dari Allah itu (taurat). Akan tetapi mereka berangan-angan menjadi orang-orang yang diampuni karena amal-amal shaleh yang mereka klaim atau karena amal baik mereka yang telah lalu sebagaimana yang mereka yakini. وَإِنْ هُمْ إِلَّا يَظُنُّونَ (dan mereka hanya menduga-duga) Yakni hanya berlandaskan dugaan yang tidak berdasar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dan barangsiapa yang menjadikan ahli qur'an seperti itu, menyuruh mereka agar buta dari al-Qur'an, dan agar mereka tidak mengetahui dari al-Qur'an kecuali sebatas tilawah, maka dia telah menyuruh mereka kepada perkara yang Allah telah mengecam dengannya para ahli kitab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Diantara kaum Yahudi ada yang buta huruf, dan tidak bisa baca tulis. Mereka sama sekali tidak mengetahui isi Taurat, mereka hanya mengetahui isi Taurat dari angan-angan dan kebohongan. Maka dari itu, dalam kebohongan yang mereka sampaikan itu mereka hanya berlandaskan dugaan dan angan-angan. Mereka sama sekali tidak mendapatkan hakikat dari Taurat, dan mereka sama sekali tidak mempunyai ilmu tentang Taurat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara mereka itu ada yang umiy (buta huruf)} dan di antara orang-orang Yahudi itu ada orang yang tidak bisa menulis dan membaca {yang tidak memahami Kitab} Taurat {kecuali hanya berangan-angan} kebohongan-kebohongan yang disampaikan oleh uskup-uskup mereka {dan sesungguhnya mereka itu hanya menduga-duga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “Dan di antara mereka, ” yakni di antara ahli kitab, “ada yang buta huruf, ” maksudnya yang awam, tidak mengerti apa-apa dan bukan dari orang yang berilmu, “mereka tidak mengetahui al-kitab (Taurat), kecuali dongengan bohong belaka, ” maksudnya mereka tidak memiliki bagian dari kitabullah selain dari membaca saja, dan mereka juga tidak memiliki kabar tentang apa yang orang-orang terdahulu ketahui dengan sebenar-benar pengetahuan akan keadaan mereka, mereka hanyalah memiliki dugaan-dugaan semata dan taklid-taklid kepada orang yang berilmu di antara mereka. Lalu Allah menyebutkan dalam ayat-ayat ini tentang ulama-ulama, orang-orang awam, dan orang-orang munafik mereka serta orang-orang yang tidak munafik di antara mereka. Di antara ulama mereka ada yang berpegang teguh dengan pedoman kesesatan, dan orang-orang awam bertaklid kepada mereka, tidak ada bashirah dalam diri mereka, maka tidak ada harapan bagi kalian (hai orang-orang Mukmin) dari kedua kelompok tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أُمِّيُّونَ } Ummiyuun : al-Ummiy disandarkan kepada ibunya karena seakan akan dia masih berada dalam asuhan ibunya dan tidak bisa berpisah, sehingga belum belajar menulis maupun membaca. { أَمَانِيَّ } Amaaniy : al-Amaaniiy bentuk jamak dari Umniyah yaitu suatu hal yang ingin diraih oleh seseorang. Atau bisa berarti membaca, berasal dari ungkapan تَمَنَّى الكِتَابَ membaca kitab. Makna ayat : Di antara tanda kebodohan sebagian orang Yahudi tentang kitabnya sendiri yaitu Taurat, mereka tidak mengetahui kandungannya yang berupa kebenaran dan petunjuk serta cahaya adalah yang ditunjukkan oleh firman Allah Ta’ala { وَمِنۡهُمۡ أُمِّيُّونَ لَا يَعۡلَمُونَ ٱلۡكِتَٰبَ إِلَّآ أَمَانِيَّ } “Dan di antara mereka ada yang buta huruf, tidak mengetahui al-Kitab (Taurat) kecuali dongengan bohong belaka.” Maknanya mereka hanya dapat membacanya saja, adapun mengetahui kandungan wajib yang mengantarkannya untuk mengetahui kebenaran, keimanan, dan ketaatan mereka tidak mampu. Sehingga apa yang mereka ucapkan tidak lebih dari sekedar prasangka yang berbalutkan kebohongan. Pelajaran dari ayat : • Tidak semua yang membaca kitab dapat memahami maknanya, apalagi memahami hukum dan rahasianya. Begitu juga dengan keadaan kaum Muslimin hari ini adalah bukti atas hal ini. Sebagian besar menghafal al-Qur’an tanpa mengetahui makna-maknanya, apalagi yang tidak menghafal al-Qur’an."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 78: Kemudian Allah mengabarkan bahwasannya diantara dari orang – orang yahudi ada yang awam sebagai muqallid, dan mereka bukan termasuk ahli ilmu yang tidak mengerti akan taurat kecuali hanya bacaan saja dan juga tidak memahami sesuatu pun dari bacaan serta tidaklah di sisi mereka kecuali hanyalah sangkaan, taqlib, dan kebohongan – kebohongan yang rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebanyakan bangsa Yahudi itu buta huruf, dan tidak mengetahui isi Taurat selain dari dongeng-dongeng yang diceritakan pendeta-pendeta mereka. Ayat di atas menyebutkan keadaan orang-orang Yahudi, baik pendetanya maupun kalangan awamnya. Para ulamanya berpegang dengan kesesatan, sedangkan kalangan awamnya hanya mengikuti tanpa ilmu, sehingga sangat sulit sekali diharapkan untuk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 78",
    "description": "Setelah kelakuan kelompok cendekia dan tokoh agama yahudi dijelaskan pada ayat-ayat sebelumnya, ayat-ayat berikut menjelaskan kelompok lain di kalangan bani israil, yaitu bahwa di antara mereka ada yang buta huruf, tidak bisa membaca dan menulis, atau bodoh dan keras hati, tidak memahami makna dan pesan kitab taurat dengan pemahaman yang penuh penghayatan, kecuali hanya berangan-angan berupa kebohongan yang disajikan oleh pemuka agama mereka dan dikatakan sebagai kebenaran, dan mereka hanya menduga-duga, sebab ka lau pun mereka membacanya, itu tidak dilakukan dengan disertai pemahaman yang men dalam. Akibat perbuatan itu, maka celakalah dan binasalah orang-orang yahudi dan yang selain mere ka yang menulis kitab taurat atau lainnya dengan tangan mereka sendiri, kemudian berkata dengan penuh kebohongan, ini adalah kitab suci yang datang dari Allah. Mereka melakukan itu dengan maksud untuk menjualnya dengan harga murah, yaitu kesenangan dunia yang murah dengan cara menukar yang murah itu dengan sesuatu yang mahal, yaitu kebenaran. Maka celakalah mereka akibat perkataan dusta mereka tentang Allah, karena tulisan tangan mereka itu penuh kebohongan, penyelewengan, dan penyim pangan, dan celakalah mereka karena apa, yakni kebohongan, yang mereka perbuat dengan memalsukan dan mengubah ayat untuk kepentingan dan keuntungan sesaat, dan celakalah mereka karena harta yang mereka peroleh dari perbuatan mereka itu."
  }
]