[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kebinasaan dan ancaman yang keras bagi para pendeta busuk dari kalangan Yahudi yang menulis Kitab dengan tangan-tangan mereka, lalu mereka mengatakan “ini berasal dari sisi Allah” padahal bertentangan dengan apa yang Allah turunkan kepada nabi Nya Musa Alaihissalam, supaya mereka dapat mengambil keuntungan duniawi sebagai imbalannya. Maka bagi mereka siksaan yang membinasakan dikarenakan tulisan mereka yang batil yang ditulis dengan tangan-tangan mereka, dan bagi mereka siksaan yang membinasakan atas harta haram yang mereka ambil sebagai imbalannya, seperti uang suap dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Maka kebinasaan dan azab yang berat sedang menunggu orang-orang yang menulis kitab itu dengan tangan mereka sendiri, kemudian -secara dusta- mengatakan, “Ini berasal dari Allah,” dengan tujuan untuk menukar kebenaran dan keharusan mengikuti petunjuk dengan keuntungan dunia yang sedikit, seperti harta benda dan jabatan. Jadi kebinasaan dan azab yang berat lah yang akan mereka dapatkan akibat tulisan tangan mereka sendiri dan mereka klaim secara dusta sebagai firman Allah. Maka kebinasaan dan azab yang berat akan mereka dapatkan terkait harta benda dan jabatan yang mereka peroleh dari kebohongan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Allah mengancamkan kebinasaan bagi orang-orang Yahudi yang mengubah kitab Taurat lalu mengklaim bahwa itu diturunkan oleh Allah demi mendapat kenikmatan dunia. Ancaman kebinasaan ini karena mereka mengubah Taurat dan ancaman ini ditegaskan lagi karena mereka mengumpulkan harta dengan cara yang haram."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. فَوَيْلٌ (kecelakaan) Yakni kebinasaan dan kehancuran لِلَّذِينَ يَكْتُبُونَ الْكِتَابَ (bagi orang-orang yang menulis al-Kitab) Yang didikte oleh hawa nafsu mereka. بِأَيْدِيهِمْ (dengan tangan mereka sendiri) Yakni mereka mengetahui bahwa itu bukan dari Allah akan tetapi dari diri mereka sendiri. ثُمَّ يَقُولُونَ هَٰذَا مِنْ عِنْدِ اللَّهِ (lalu dikatakannya; “Ini dari Allah”) Yakni pada penulis itu tidak cukup dengan mengubah al-Kitab, menulis perubahan tersebut, menambah-nambah kalamullah, tapi bahkan menyeru di setiap perkumpulan bahwa yang mereka tulis adalah dari Allah. لِيَشْتَرُوا (untuk memperoleh keuntungan) Yakni untuk memperoleh keuntungan yang sedikit dan balasan yang sepele dari kemaksiat mereka yang berulang-ulang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَوَيْلٌ لِلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ } menulis tidak lain kecuali dengan tangan, dan tangan disebutkan dalam ayat ini, padahal lafazh { يَكْتُبُونَ } bermaksud seperti itu, namun faidah dari penyebutannya adalah membenarkan secara langsung apa yang telah mereka perbuat dari memalsukan al-Qur'an, dan menambahkan keburukan dari perbuatan mereka. 2 ). Penyebutan { يَكْسِبُونَ } datang dengan lafazh mustaqbal, dan { كَتَبَتْ } dengan lafzh madhi; hal itu bertujuan untuk mengingatkan apa yang telah diisyaratkan oleh hadits : (( من سن في الإسلام سنة حسنة فله أجرها وأجر من عمل بها إلى يوم القيامة )) \"barangsiapa yang mencontohkan suatu sunnah (perbuatan) yang baik dalam Islam maka ia mendapat pahala sekaligus pahala orang lain yang mengamalkannya sampai hari kiamat\", adapun maksud dari penyebutannya dengan menulis selain ucapan; adalah karena tulisan pada hakikatnya telah mencakup ucapan lisan dan itu sebagai tambahan penguatan makna, maka jika mereka berdusta dengan tulisan berarti berdusta dengan tangan dan lisan, dan ucapan tangan dengan tulisan akan tetap terlihat, adapun ucapan lisan dapat sirna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kebinasaan, kehancuran, dan azab bagi mereka yang merubah/memalsukan isi Taurat dengan tangan-tangan pendosa mereka. Mereka sebenarnya tahu bahwa semua itu hanya bersumber dari angan-angan mereka sendiri. Namun lebih celaka, mereka mengkalim kepada kaumnya bahwa apa yang mereka sampaikan adalah dari Allah. Mereka memberikan narasi, seakan-akan semua itu benar-benar bersumber dari Taurat. Dengan tujuan agar mereka memperoleh keuntungan dunia yang bersifat fana. Maka azab bagi mereka atas pemalsuan dan pengubahan isi Taurat yang mereka lakukan, serta azab atas harta yang mereka dapatkan dari menjual kalamullah. Ayat ini turun sebagaimana penjelasan Al Abbas bahwa para pendeta Yahudi telah merubah/memalsukan sifat-sifat Nabi Muhammad SAW dan menggantinya dengan sifat lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} Maka kecelakaan dan azab yang berat {bagi orang-orang yang menulis kitab dengan tangan mereka (sendiri), kemudian berkata, “Ini dari sisi Allah,” supaya mereka bisa menjualnya dengan harga murah} dengan hal duniawi yang remeh {Maka, celakalah mereka karena tulisan tangan mereka dan celakalah mereka karena apa yang mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Allah ta’ala mengancam orang-orang yang merubah kitab suci yang berkata tentang apa yang mereka rubah dan dan apa yang mereka tulis, ”ini dari Allah.” Ayat ini mengandung isyarat tentang menampakkan kebatilan dan menyembunyikan kebenaran, dan mereka melakukan hal itu dengan ilmu, ”untuk memperoleh keuntungan yang sedikit dengan perbuatan itu.” Seluruh dunia dari awal hingga akhirnya merupakan keuntungan yang sedikit, lalu mereka menjadikan kebatilan mereka sebagai sekutu, yang mana mereka berburu dengannya harta benda dan apa pun yang ada di tangan manusia. Dan mereka menzhalimi orang-orang tersebut dalam dua aspek: yaitu aspek mencampuradukkan agama mereka dan aspek mengambil harta mereka tanpa hak bahkan dengan cara yang paling batil. Hal itu lebih besar dosanya daripada orang yang mengambilnya tanpa izin atau mencuri dan semacamnya. Oleh karena itu, Allah mengancam mereka dengan dua perkara tersebut, Allah berfirman, “Maka kecelakaan besarlah bagi mereka, akibat apa yang di tulis oleh tangan mereka sendiri, ” yaitu disebabkan perubahan kebatilan, “dan kecelakaan besarlah bagi mdereka, akibat apa yang mereka kerjakan, ” disebabkan harta. Kata ‘wailun’ itu bermakna azab yang keras dan kerugian, dan termasuk didalamnya adalah azab yang pedih. Syaikhul Islam berkata ketika menyebutkan ayat-ayat ini dari fimanNya, “Apakah kamu masih mengharapkan mereka akan percaya kepadamu, padahal segolongan dari mereka mendengar firman Allah, lalu mereka mengubahnya setelah mereka memahaminya, sedang mereka mengetahui? Dan apabila mereka berjumpa dengan orang-orang yang beriman, mereka berkata, ‘kamipun telah beriman, ’ tetapi apabila mereka berada sesame mereka saja, mereka berkata, ‘Apakah kamu menceritakan kepada mereka apa yang telah diterangkan Allah kepadamu, supaya dengan demikian mereka dapat mengalahkan hujjahmu dihadapan Rabbmu; tidakkah kamu mengerti?’ tidakkah mereka mengetahui bahwa Allah meengetahui segala yang mereka sembunyikan dan segala yang mereka nyatakan? Dan di antara mereka ada yang buta huruf, tidak mengetahui al-Kitab (Taurat), kecuali dongengan bohong belaka dan mereka hanya menduga-duga. Maka kecelakaan besarlah bagi orang-orang yang menulis al-Kitab dengan tangan mereka sendiri, lalu dikatakannya, ’Ini dari Allah, ’ (dengan maksud) untuk memperoleh keuntungan yang sedikit dengan perbuatan itu. Maka kecelakaan besarlah bagi mereka, akibat dari apa yang mereka kerjakan.” “Sesungguhhnya Allah ta’ala mencela orang-orang yang merubah ayat-ayat dari makna-makna yang dimaksudkan. Hal ini meliputi orang yang membawa (mengajarkan) al-Qur’an dan as-sunnah dengan dasar-dasar yang mereka buat dari bid’ah-bid’ah yang batil, dan Allah juga mencela orang-orang yang tidak mengerti al-Kitab kecuali hanya dongeng bohong belaka, yang ini juga meliputi orang yang meninggalkan tadabbur al-Qur’an dan dia tidak mengerti apa-apa kecuali hanya sekedar membaca huruf-hurufnya saja, dan juga meliputi orang yang menulis sebuah karangan dengan tangannya sendiri yang bertentangan dengan kitabullah demi sekedar mendapatkan faidah dunia lalu dia bertkata bahwa tulisan itu datangnya dari sisi Allah, seperti dia mengatakan, ’inilah syariat dan agama itu, dan inilah makna al-Qur’an dan as-sunnah, dan inilah pemikiran para salaf dan para ulama umat, inilah dasar-dasar agama yang harus diyakini, baik secara wajib ain maupun kifayah.’ Dan juga meliputi orang yang menyembunyikan sesuatu yang telah dia ketahui Dari al-Qur’an dan as-Sunnah agar sesorang yang menyelisihinya tidak berhujjah dengannya atas kebenaran yang dia katakan. Perkara-perkara seperti ini sangat banyak terjadi pada hamba-hamba hawa nafsu secara umum -seperti ar-Rafidhah [dan al-jahmiyah dan semacamnya dari pengikut –pengikut hawa nafsu dan ilmu kalam, dan pada pengikut hawa nafsu ]-dan secara khusus seperti juga banyak orang-orang yang bernisbat kepada para ahli fikih…”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَيۡلٞ } wailun : al-Wail adalah kata yang diucapkan kepada orang yang jatuh dalam kebinasaan atau siksaan. { ٱلۡكِتَٰبَ } al-Kitaaba : Hasil yang ditulis oleh ulama Yahudi berisikan kedustaan yang dikesankan seolah-olah itu berasal dari Allah untuk mencapai tujuan-tujuan rendahan, berupa keelokan dunia yang amat sedikit. { مِنۡ عِندِ ٱللَّهِ } min ‘indillah : Mengesankan hasil tulisan ulama-ulama Yahudi pada Taurat seolah-olah firman Allah dan wahyu dariNya kepada Musa ‘alaihissalam. { يَكۡسِبُونَ } yaksibuuna : al-Kasab seringnya digunakan untuk hasil pekerjaan yang baik, namun di sini digunakan untuk hasil pekerjaan yang buruk sebagai bentuk celaan untuk orang-orang Yahudi. Makna ayat : Allah Ta’ala memberikan ancaman berupa adzab yang pedih kepada orang-orang Yahudi yang menyesatkan dengan melakukan tahrif (melencengkan) terhadap firman Allah. Menulis banyak kedustaan dan perkara-perkara bathil dan mengesankan seolah-olah itu adalah firman Allah, dengan tujuan untuk mendapatkan bagian remeh dari dunia. Pelajaran dari ayat : • Peringatan keras untuk fatwa-fatwa bathil yang mengharamkan apa yang dihalalkan oleh Allah dan menghalalkan apa yang diharamkan oleh Allah, dengan tujuan untuk memperoleh bagian duniawi seperti harta, atau kedudukan di sisi penguasa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 79: Kemudian Allah mengancam dengan kebinasaan dan azab bagi mereka yang menulis kalam Allah dengan hawa nafsunya ( dari diri – diri mereka ) kemudian mereka berkata: ini adalah kedustaan dari sisi Allah dan rekayasa, tujuan mereka adalah untuk sesuatu yang nampak dari dunia fana, dan tidak diragukan bahwasannya dosa mereka menyakini bahwasannya sesuatu yang besar yaitu berupa dosa adalah ringan di akhirat akan balasan azab,kemudian Allah kembali mengancam mereka dengan kebinasaan dan azab karena sebab mereka memilih taurat dengan tangan – tangan mereka dengan kedustaan dan kebohongan serta mereka juga memakan harta – harta manusia dengan kebathilan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Abbas radiyallahu 'anhuma berkata, \"Ayat ini turun berkenaan dengan Ahli Kitab. \" Yakni merubah isi Taurat sesuai yang mereka inginkan. Padahal berbeda dengan Taurat yang diturunkan kepada Nabi Musa 'alaihis salam. Mereka melakukan hal itu. hanya karena ingin mendapatkan keuntungan dunia. Pada ayat tersebut Allah mengancam beberapa kali kepada ulama yahudi, karena mereka menyamarkan urusan agama mereka kepada orang-orang awam; tidak menunjukkan yang benar bahkan sebaliknya malah menyembunyikannya dan menampakkan yang batil sebagai sebuah kebenaran ditambah lagi dengan suka memakan harta yang haram, suka menerima risywah (sogok) dsb. Lebih dari itu, mereka berani merusak agama hanya karena ingin memperoleh harta dan keuntungan dunia yang sangat rendah. Di zaman sekarang, contoh orang-orang yang mengikuti jejak mereka adalah orang-orang JIL (Jaringan Islam Liberal), karena uang yang ditawarkan kepada mereka, mereka berani mengacak-acak agama –wal 'iyaadz billah-. Syaikhul Islam menafsirkan ayat 75 sampai 79, sbb: \"Sesungguhnya Allah mencela orang-orang yang mengubah firman Allah dari tempat-tempatnya. Termasuk ke dalamnya orang-orang yang menta'wil Al Qur'an dan As Sunnah mengikuti apa yang dipegangnya berupa kebid'ahan-kebid'ahan batil. Demikian juga mencela orang-orang yang tidak mengetahui Al Kitab selain angan-angan dusta. Termasuk ke dalamnya orang-orang yang meninggalkan tadabbur Al Qur'an dan tidak mengetahui selain bacaan hurufnya saja, dan termasuk orang-orang yang menulis kitab dengan tangannya yang menyalahi kitab Allah untuk memperoleh dunia, lalu ia berkata, \"Ini dari sisi Allah\" adalah orang yang berkata, \"Inilah syari'at dan agama, inilah makna dari Al Qur'an dan As Sunnah, inilah yang dimengerti oleh kaum salaf dan para imam, inilah prinsip-prinsip agama yang wajib diyakini setiap orang dan sebagiannya.\" Demikian juga termasuk ke dalamnya orang-orang yang menyembunyikan Al Qur'an dan As Sunnah (yang diketahuinya) agar orang yang menyelisihinya tidak dapat berhujjah dengannya dalam kebenaran yang diucapkannya.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 79",
    "description": "Akibat perbuatan itu, maka celakalah dan binasalah orang-orang yahudi dan yang selain mere ka yang menulis kitab taurat atau lainnya dengan tangan mereka sendiri, kemudian berkata dengan penuh kebohongan, ini adalah kitab suci yang datang dari Allah. Mereka melakukan itu dengan maksud untuk menjualnya dengan harga murah, yaitu kesenangan dunia yang murah dengan cara menukar yang murah itu dengan sesuatu yang mahal, yaitu kebenaran. Maka celakalah mereka akibat perkataan dusta mereka tentang Allah, karena tulisan tangan mereka itu penuh kebohongan, penyelewengan, dan penyim pangan, dan celakalah mereka karena apa, yakni kebohongan, yang mereka perbuat dengan memalsukan dan mengubah ayat untuk kepentingan dan keuntungan sesaat, dan celakalah mereka karena harta yang mereka peroleh dari perbuatan mereka itudan di antara bentuk kebohongan dan penyimpangan yang mereka lakukan, mereka berkata, neraka tidak akan menyentuh kami di akhirat kelak kecuali beberapa hari atau sesaat saja. Itu pun sekadar sentuhan api, bukan siksaan yang bersifat abadi. Untuk menjelaskan itu Allah memerintahkan kepada rasul-Nya, katakanlah, wahai nabi Muhammad, 'sudahkah kamu menerima janji dari Allah, zat yang mengatur segala urusan, sehingga kamu merasa tenang karena Allah tidak akan mengingkari janji-Nya, ataukah kamu mengatakan tentang Allah yang kekuasaan dan ilmu-Nya mencakup segala hal, sesuatu yang tidak kamu ketahui' keduanya tidak pernah terjadi: tidak ada perjanjian antara mereka dengan tuhan soal itu, dan tidak pula mereka mengatakan itu karena tidak tahu. Mereka tahu, tetapi mengatakan yang sebaliknya."
  }
]