[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di antara manusia ada sekelompok orang yang bimbang dan bingung antara menjadi bagian dari orang-orang yang beriman atau menjadi bagian dari orang-orang yang kufur. dan mereka itu adalah orang-orang munafik yang dengan lisan mereka mengatakan “kami membenarkan kepada Allah dan hari akhir” sedangkan secara batin mereka berdusta dan tidak beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan di antara manusia ada golongan yang mengaku bahwa mereka beriman. Mereka mengatakan hal itu dengan mulut mereka semata-mata karena mereka mencemaskan keselamatan jiwa dan harta benda mereka. Padahal di dalam batin mereka tersimpan kekafiran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Mereka adalah jenis manusia yang munafik, hal ini sebagaimana yang Allah sebutkan dalam awal surat al-Munafiqun: إذا جاءك المنافقون قالوا نشهد إنك لرسول الله Apabila orang-orang munafik datang kepadamu (Muhammad), mereka berkata, “Kami mengakui, bahwa engkau adalah rasul Allah.” (al-Munafiqun: 1) Dan Allah berfirman pula: إن المنافقين يخادعون الله وهو خادعهم Sesungguhnya orang-orang munafik itu menipu Allah, dan Allah akan membalas tipuan mereka. (an- Nisa: 142) Dalam ayat-ayat tersebut Allah memperingatkan kita dari tipu daya mereka. Sebab mereka berucap \"kami beriman kepada Allah dan hari akhir\", namun keimanan mereka hanya di mulut saja tanpa merasuk ke dalam hati mereka. Mereka adalah orang-orang pendusta, bukan orang-orang yang beriman. Dan kedustaan mereka ini untuk menipu Allah dan orang-orang beriman dengan menyembunyikan kekafiran dan menunjukkan keimanan mereka, padahal mudharat perbuatan tersebut hanya kembali kepada mereka, dan mereka tidak merasakan hal itu karena besarnya kebodohan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُمْ بِمُؤْمِنِينَ dalam surat ini Allah Ta’ala menyebutkan orang-orang mukmin yang sebenar-benarnya, kemudian menyebutkan setelahnya orang-orang orang-orang kafir yang sebenar-benarnya, lalu menyebutkan setelahnya orang-orang munafik yakni orang-orang yang tidak termasuk dalam dua kelompok yang disebutkan sebelumnya dan menjadi kelompok ketiga karena mereka secara kasat mata menyerupai kelompok pertama dan secara batin menyerupai kelompok kedua, akan tetapi mereka pada akhirnya adalah para penghuni kerak neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam ayat ini pengulangan beberapa lafazh dengan huruf ( ب ) dengan 'athof terjadi beberapa kali, hal ini tidak lain kecuali sebagai penekanan atas kebenaran lafzh itu, adapun ayat ini adalah hikayah tentang ucapan orang-orang munafiq, mereka menekankan ucapan mereka atas keimanan sebagai penafian dari keraguan dan menjauh dari tuduhan, akan tetapi Allah mengingkari pernyataan mereka atas keimanan dengan penekanan yang lebih besar, Allah befirman : { وَمَا هُمْ بِمُؤْمِنِينَ } \"pada hal mereka itu sesungguhnya bukan orang-orang yang beriman\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Setelah menyebutkan ciri-ciri orang mukmin dan orang kafir, Allah SWT menyebutkan ciri-ciri orang munafik. Mereka adalah orang-orang yang menampakkan keislamannya dan menyembunyikan kekafirannya. Mereka bukanlah orang-orang mukmin, dan (tempat) mereka di neraka paling bawah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara para manusia ada yang berkata, “Kami beriman kepada Allah dan hari akhir,” padahal mereka itu bukanlah orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. ketahuilah bahwasanya kemunafikan itu adalah menampakkan kebaikan dan menyembunyikan kejahatan, termasuk dalam definisi ini kemunafikan I’tiqad dan kemunafikan amaliah. Adapun nifaq Amali seperti yang Nabi sebutkan dalam sabdanya : \"tanda kemunafikan itu ada tiga: jika berbicara ia berdusta, jika berjanji dia ingkari dan jika dimanahi dia berkhianat\". Dalam riwayat yang lain \"jika bertengkar dia berlebihan:. Adapun kemunafikan I’tiqadiah yang mengeluarkan seseorang dari islam yaitu yang Allah ta’ala sebutkan sebagai sifat-sifat kaum munafikin dalam surat ini dan surat lainnya. Kemunafikan ini belumlah muncul sebelum hijrahnya Nabi sholallohu 'alaihi wasallam dari Makkah menuju Madinah bahkan juga setelah hijrah hingga setelah kejadian perang Badar, dan Allah memberikan kemenangan kepada kaum Muslimin dan memuliakan mereka, dan menghinakan orang-orang yang ada di Madinah dari mereka yang belum masuk islam, lalu sebagian mereka menampakkan keislaman mereka Karena takut dan sebagai tipu daya, juga untuk menjaga darah dan harta mereka., imana mereka ini bersama kaum Muslimin secara lahiriyah, mereka menampakkan bahwa mereka adalah bagian kaum Muslimin, padahal mereka pada hakikatnya bukanlah dari kaum Muslimin. Maka sebagai tindakan kelembutan Allah bagi kaum Mukminin adalah bahwa Allah memperlihatkan kondisi-kondisi mereka, dan menggambarka mereka dengan sifat-sifat yang membedakan jati diri mereka, agar kaum Mukminin tidak terperdaya oleh mereka, dan mampu mengendalikan kejahatan mereka. Allah berfirman : \" Orang-orang munafik takut akan turun terkait kelakuan mereka suatu surat yang menerangkan apa yang mereka sembunyikan di dalam hati-hati mereka berupa kekafiran. \" (QS. At-Taubah : 64) Lalu Allah menyifati mereka dengan sifat dasar kemunafikan seraya berfirman “ diantara manusia ada yang mengatakan, ’kami beriman kepada Allah dan Hari Kemudian, ’padahal mereka itu sesungguhnya bukan orang-orang yang beriman, ” karena mereka mengatakan dengan lisan mereka apa yang tidak ada dalam hati mereka, lalu Allah mendustakan mereka dengan berfirman, “padahal mereka itu sesungguhhnya bukan orang-orang yang beriman, ” karena keimanan yang hakiki itu adalah sesuatu yang disepakati oleh hati dan lisan. Sesungguhnya hal yang tadi itu adalah tipu daya terhadap Allah dan hamba-hambaNya yang beriman. Dan tipu daya itu adalah bahwa si pelaku menampakkan sesuatu kepada yang diperdayai dan dia menyembunyikan hal yang berbeda dengannya demi memperoleh yang diinginkannya dari orang yang diperdayai tersebut. Dan inilah yang dilakukan orang-orang munafik terhadap Allah dan hamba-hambaNya, sehingga tipudaya mereka tersebut kembali kepada diri mereka sendiri. Ini adalah suatu perkara yang mengherankan sekali, karena biasanya seorang pelaku tipu daya itu kondisinya bisa jadi akan memperoleh apa yang menjadi tujuannya atau dia selamat yang mana dia tidak mendapatkan apa-apa dan tidak rugi apa-apa juga, namun lain halnya tipu daya orang-orang munafik ini, ia malah kembali kepada diri mereka sendiri. Oleh Karena itu, seolah-olah mereka itu melakukan suatu makar untuk menghancurkan diri mereka sendiri, membahayakan dan menipu diri mereka, karena Allah tidaklah tersentuh oleh mudarat sedikitpun dari tipu daya mereka, demikian juga hamba-hambaNya yang beriman. Maka tindakan kaum munafik menampakkan keimanan mereka tidak membawa dampak bagi kaum Muslimin, hingga selamatlah dengan hal itu harta-harta mereka, dan terjaga darah-darah mereka, dan tipu daya mereka kembali kepada leher-leher mereka, hingga dengan demikian mereka mendapatkan kehinaan dan cela di dunia, serta kemalangan yang terus menerus disebabkan oleh apa yang diperoleh kaum Mukminin berupa kekuatan dan kemenangan, kemudian pada hari Akhir nanti mereka mendapatkan azab yang pedih lagi menyakitkan dan menyerikan disebabkan oleh pendustaan, kekufuran dan kejahatan mereka dan keadaanya saat ini adalah bahwa mereka dengan kebodohan dan kedunguan yang ada pada mereka, mereka tidak menyadari hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : وَمِنَ ٱلنَّاسِ Wa minannaasi : artinya dari sebagian manusia مَن يَقُولُ ءَامَنَّا بِٱللَّهِ Man yaquulu aamannaa billahi : Di antara mereka ada yang berkata,”Kami membenarkan Allah sebagai Tuhan dan sesembahan, tidak ada Tuhan dan sesembahan selain-Nya.” وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ Wa bil yaumil aakhiri : Maknanya perkataan mereka,”Kami beriman dengan adanya kebangkitan dan pembalasan pada hari kiamat nanti.” Makna ayat : Setelah Allah Ta’ala menyebutkan golongan orang yang sempurna keimanannya, dan menyebutkan juga lawan dari orang mukmin yaitu golongan orang kafir yang tenggelam dalam kekufurannya, maka Allah menyebutkan golongan yang ketiga yaitu orang-orang munafik. Mereka adalah orang yang menampakkan keimanan secara lahir namun dalam hatinya menyimpan kekufuran. Mereka itu lebih buruk dibandingkan orang kafir yang sudah tenggelam dalam kekufurannya. Pelajaran dari ayat : Peringatan agar tidak melakukan kedustaan, kemunafikan, dan tipu daya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 8: Allah mengabarkan akan pembagian manusia yang keras terhadap Islam dari orang-orang kafir , yaitu mereka golongan orang-orang munafik yang berkata : sesungguhnya mereka beriman kepada Allah dan rasulnya serta hari akhir , dan mereka berdusta kepada Allah maka Allah mengabarkan bahwasanya mereka bukanlah termasuk orang-orang yang beriman , dan mereka menyembunyikan kekufuran dan terhadap orang-orang muslim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka adalah orang-orang munafik yang luarnya menampakkan keislaman, namun batinnya kafir. Kemunafikan ini adalah kemunafikan besar yang terkait dengan akidah dan mengeluarkan pelakunya dari Islam. Berbeda dengan kemunafikan kecil yang terkait dengan amalan, ia tidaklah mengeluarkan pelakunya dari Islam namun sebagai wasilah/sarana yang bisa mengarah kepada kemunafikan besar, misalnya bila bicara berdusta, bila berjanji mengingkari, bila diamanahkan berkhianat, malas beribadah, berat melaksanakan shalat berjama'ah dsb. Di antara kelembutan Allah Ta'ala kepada kaum mukminin adalah ditampakkan-Nya kepada kaum mukminin hal-ihwal serta sifat mereka yang membedakan dengan yang lain agar kaum mukminin tidak tertipu oleh mereka. Mereka dikatakan \"tidak beriman\" karena iman yang sesungguhnya adalah pengakuan lisan yang dibenarkan oleh hati dan dipraktekkan oleh anggota badan, jika tidak seperti itu sama saja hendak menipu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 8",
    "description": "Dan selanjutnya disebutkan kelompok manusia yang ketiga dalam menyikapi kebenaran petunjuk Al-Qur'an, yaitu di antara manusia yang ingkar seperti disebut sebelumnya ada sekelompok orang yang mengatakan sesuatu yang sesungguhnya tidak lahir dari dalam hati nurani. Mereka berkata, kami hanya beriman kepada Allah dengan segala keagungan-Nya dan kami juga beriman kepada hari akhir yang diingkari oleh orang-orang kafir, padahal sesungguhnya mereka itu tidak jujur dalam mengatakan itu sehingga mereka bukanlah termasuk golongan orang-orang yang beriman. Kelompok ketiga ini jauh lebih berbahaya daripada yang secara terang-terangan menolak (kafir), sebab mereka menampakkan diri seperti kawan padahal sesungguhnya mereka adalah lawanmereka menduga, dengan mengatakan seperti itu, telah berhasil menipu Allah dengan menganggap Allah tidak mengetahui rahasia yang mereka sembunyikan, padahal Allah maha mengetahui segala yang tersembunyi dan yang tampak; dan mereka juga merasa telah berhasil menipu orang-orang yang beriman, dengan berpura-pura beriman, padahal mereka hanyalah menipu diri sendiri tanpa mereka sadari. Sebab akibat buruk perbuatan mereka itu, cepat atau lambat, akan kembali kepada mereka sendiri."
  }
]