[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bani Israil berkata, “api neraka tidak akan menimpa kami di akhirat kelak kecuali beberapa hari yang tidak lama hitungannya. Katakanlah kepada mereka -wahai Rasul- untuk mematahkan klaim mereka, “Apakah kalian memiliki janji di sisi Allah tentang itu, sesungguhnya Allah tidak memungkiri janji?, justru sebaliknya kalian mengatakan atas nama Allah apa yang kalian sendiri tidak mengetahuinya dan kedustaan yang kalian buat buat itu”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Mereka mengatakan -secara dusta dan palsu-, “Kami tidak akan tersentuh oleh api neraka. Dan kami tidak akan masuk ke dalam neraka kecuali hanya beberapa hari saja.\" Katakanlah -wahai Nabi- kepada mereka, “Apakah kalian menerima janji yang kuat dari Allah terkait hal itu? Jika kalian memang memiliki janji tersebut, sesungguhnya Allah tidak akan melanggar janji-Nya; ataukah kalian mengatakan atas nama Allah -secara dusta dan palsu- sesuatu yang tidak kalian ketahui kebenarannya?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Sebagian orang-orang Yahudi yang lupa diri berkata kepada Rasulullah: “Kami tidak akan masuk neraka kecuali hanya beberapa hari saja.” Maka Allah membantah mereka dan memerintahkan Rasulullah untuk mengingkari mereka dengan mengatakan: “Apakah Allah telah menjamin kalian dalam hal ini? Sungguh ALlah tidak akan mengingkari janji-Nya, namun kalian hanya membuat kedustaan terhadap ALlah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَقَالُوا لَنْ تَمَسَّنَا النَّار (Dan mereka berkata: “Kami sekali-kali tidak akan disentuh oleh api neraka) Diriwayatkan dari Ibnu Abbas bahwa orang-orang Yahudi dahulu mengatakan: tenggang waktu di dunia ini adalah 7.000 tahun, di setiap seribu tahun dunia kita akan diazab satu hari di neraka, sehingga kita hanya akan diazab selama tujuh hari kemudian azab itu akan berhenti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang Yahudi berkata: “Kelak, kami akan masuk neraka hanya selama beberapa hari saja”, yaitu 40 hari, seperti lamanya para pendahulu mereka menyembah anak sapi. Wahai Nabi, katakanlah kepada mereka: “Apakah kalian ada perjanjian dengan Allah untuk tidak diazab kecuali dalam kisaran 40 hari itu? Kamudian apakah Allah akan menepati janji-Nya itu? Padahal, pada kenyataannya kalian semua telah membuat kebohongan atau kepalsuan atas apa yang Allah turunkan kepada kalian.” Imam Tabrani meriwayatkan dari Ibn Abbas, bahwa orang-orang Yahudi berkata: “Kami tidak akan masuk neraka kecuali kami melanggar sumpah, kami menyembah anak sapi hanya selama 40 hari saja, apabila telah cukup maka berakhir pula azab bagi kami, sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Neraka tidak akan menyentuh kami} mengenai kami {kecuali beberapa hari saja.”} sebentar saja {Katakanlah, “Sudahkah kalian menerima janji dari Allah sehingga Allah tidak akan mengingkari janjiNya ataukah kalian berkata tentang Allah sesuatu yang tidak kalian ketahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Allah menyebutkan tentang perbuatan-perbuatan mereka yang buruk, kemudian Allah menyebutkan –bersama dengan semua keburukan mereka tersebut- bahwasanya mereka menyucikan diri mereka dan mereka mempersaksikan keselamatan bagi diri mereka dari azab Allah dan kemenangan dengan ganjaranNya, dan bahwasanya mereka tidak akan tersentuh oleh api neraka kecuali hanya beberapa hari tertentu saja, maka artinya sangat sedikit yang dapat dihitung oleh jari; mereka menyatukan antara dosa-dosa dengan rasa aman (dari azab). Namun ketika semua itu hanyalah sebatas dugaan saja, Allah membantah mereka dalam firmanNya, ”Katakanlah“ kepada mereka wahai Rosul: “Sudahkah kamu menerima janji dari Allah?” yakni dengan beriman kepadaNya, kepada rosul-rosulNya dan dengan menaatinya, maka janji itu yang membawa keselamatan pelakunya yang tidak akan berubah dan tidak berganti, “ataukah kamu hanya mengatakan terhadap Allah apa yang tidak kamu ketahui?” Lalu Allah ta’ala mengabarkan bahwa kebenaran dugaan mereka itu tergantung dari salah satu dari dua perkara tersebut yang tidak ada ketiganya. Bisa karena mereka telah menerima janji dari Allah hingga dugaan mereka adalah benar, atau mungkin mereka hanya berkata bohong belaka hingga dugaan mereka hanyalah dusta dan hal itu menjadi lebih kuat dalam penghinaan dan siksaan bagi mereka, padahal telah diketahui dari sifat mereka bahwasanya mereka belum menerima janji dari Allah karena banyaknya pendustaan mereka terhadap para Nabi, hingga perkara mereka itu sampai kepada tindakan membunuh sekelompok dari para Nabi diantara mereka. Dan karena penolakan mereka untuk taat kepada Allah dan pembatalan mereka terhadap perjanjian-perjanjian, maka jelas dan pastilah dengan semua itu kebohongan dan dusta mereka yang berkata apa yang tidak mereka ketahui, dan berkata terhadap hal itu tanpa ilmu termasuk hal yang diharamkan paling besar dan keburukan yang paling keji. Kemudian Allah ta’ala menyebutkan hukum yang bersifat umum untuk setiap orang, yang meliputi Bani Israil maupun selain mereka, yaitu suatu hukum yang tidak ada hukum yang sebanding dengannya, yang bukan dongengan bohong belaka mereka dan dugaan-dugaan dengan perkara orang-orang yang celaka dan orang-orang yang selamat, Allah berfirman, “Bukan demikian yang benar, ” yaitu bukanlah perkara itu seperti apa yang kalian sebutkan, karena ia hanyalah perkataan yang tidak ada maknanya, akan tetapi,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { أَيَّامٗا مَّعۡدُودَةٗۚ } Ayyaaman ma’dudat : Empat puluh hari. Ini adalah bentuk kedustaan serta penyesatan mereka terhadap orang-orang awam di kalangan mereka untuk memalingkan dari agama Islam. { أَتَّخَذۡتُمۡ عِندَ ٱللَّهِ عَهۡدٗا } Attakhodztum ‘indallahi ‘ahda : Hamzah berperan sebagai kata tanya pengingkaran. Al-‘Ahdu maknanya janji yang kuat. Makna ayat : Allah Ta’ala mengingkari bualan mereka bahwa hanya akan merasakan adzab neraka selama 40 hari saja kemudian keluar lagi, sebesar apapun dosanya selama masih memeluk agama Yahudi. Hal ini bisa saja terjadi apabila mereka memiliki perjanjian dengan Allah, akan tetapi dimanakah perjanjian tersebut? Kecuali hal itu hanyalah bualan dan pengakuan dusta saja. Kemudian Allah yang maha Mengetahui lagi Maha Bijaksana menetapkan keputusannya bagi manusia, apakah akan masuk neraka atau masuk surga. Hukum itu berdasarkan keadilan dan rahmat Allah yang jauh dari intervensi nasab maupun kedudukan sosial."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 80: Dengan seluruh perbuatan – perbuatan ini maka sungguh orang – orang yahudi Allah hinakan sedangkan mereka mensucikan diri –diri mereka sembari berkata: tidaklah kami akan disentuh api neraka kecuali dengan hari – hari yang sebentar dimana selamanya kami akan disegerakan dari api neraka, maka Allah memerintahkan kepada nabi ﷺ agar berkata kepada mereka yahudi dengan pengingkaran: Apakah di sisi kalian terdapat perjanjian dari sisi Allah akan hari ini?! atau jika dari sisi kalian terdapat perjanjian akan hal ini maka sungguh Allah tidak akan menyelisihi perjanjian tersebut, atau kalian hanyalah menisbatkan perkataan kepada Allah padahal kalian berdusta dan berbohong atasNya?! dan ini adalah kenyataan yang bahwasannya mereka adalah para pendusta dan pendosa yang tempat mereka adalah di nerak selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sudahkah kamu mengambil perjanjian dari Allah untuk beriman kepada Allah dan Rasul-Nya serta ta'at kepada-Nya, karena perjanjian inilah yang dapat menyelamatkan seseorang dari neraka. Setelah menyebutkan perbuatan-perbuatan mereka yang buruk, kemudian Allah menerangkan bahwa mereka masih saja menganggap bersih diri mereka, bersaksi bahwa mereka akan selamat dari azab Allah dan bahwa mereka tidak tersentuh oleh neraka selain hanya beberapa hari saja. Dengan demikian, mereka menggabungkan antara perbuatan dosa dan rasa aman, keburukan apa lagi yang lebih besar daripada ini?! Terhadap sangkaan mereka ini, Allah membantah dengan firman-Nya di atas dan ayat setelahnya. Allah menerangkan bahwa kebenaran dakwaan mereka itu tergantung dua hal yang tidak ada lagi ketiganya: pertama, apakah mereka sudah menerima janji dari Allah. Kedua, atau mereka mengatakan tentang Allah sesuatu yang mereka tidak ketahui. Untuk yang pertama jelas tidak. Hal ini dapat diketahui dari keadaan mereka yang tidak mengambil janji dari Allah karena mereka mendustakan para nabi bahkan sebagian di antaranya mereka bunuh, mereka sering melakukan pelanggaran, membatalkan perjanjian dan lain-lain. Oleh karena itu, yang benar adalah yang kedua, yakni mereka mengatakan tentang Allah sesuatu yang mereka tidak ketahui, padahal mengatakan tentang Allah sesuatu yang tidak diketahui termasuk dosa yang sangat besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 80",
    "description": "Dan di antara bentuk kebohongan dan penyimpangan yang mereka lakukan, mereka berkata, neraka tidak akan menyentuh kami di akhirat kelak kecuali beberapa hari atau sesaat saja. Itu pun sekadar sentuhan api, bukan siksaan yang bersifat abadi. Untuk menjelaskan itu Allah memerintahkan kepada rasul-Nya, katakanlah, wahai nabi Muhammad, 'sudahkah kamu menerima janji dari Allah, zat yang mengatur segala urusan, sehingga kamu merasa tenang karena Allah tidak akan mengingkari janji-Nya, ataukah kamu mengatakan tentang Allah yang kekuasaan dan ilmu-Nya mencakup segala hal, sesuatu yang tidak kamu ketahui' keduanya tidak pernah terjadi: tidak ada perjanjian antara mereka dengan tuhan soal itu, dan tidak pula mereka mengatakan itu karena tidak tahu. Mereka tahu, tetapi mengatakan yang sebaliknya. Sebenarnya tidak ada janji dari Allah, bukan juga karena mereka tidak tahu. Sumber masalahnya adalah sikap mereka yang memutarbalikkan ayat-ayat Allah. Bukan demikian, yang benar adalah barang siapa berbuat keburukan, yaitu mempersekutukan Allah, dan dosanya telah menenggelamkannya, yakni ia diliputi oleh dosanya sehingga seluruh kehidupannya tidak mengandung sedikit pun kebaikan akibat ketiadaan iman kepada Allah, maka mereka itu penghuni neraka. Mereka kekal di dalamnya. Sedangkan orang-orang yang beriman dengan benar sebagaimana diajarkan nabi-nabi mereka dan mengerjakan kebajikan sesuai tuntunan Allah dan rasul, maka mereka itu penghuni surga. Mereka juga kekal di dalam nya."
  }
]