[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketetapan Allah sudah baku, bahwasanya orang yang mengerjakan perbuatan perbuatan dosa sehingga menyeretnya menuju kekafiran, dan dosa-dosa telah menguasainya dari seluruh sisinya (dan ini tidak terjadi kecuali pada orang yang menyekutukan Allah) Bahkan mereka itulah orang-orang musyrik dan kafir dan mereka itulah orang-orang menempati neraka jahanam terus menerus tanpa putus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Masalahnya tidak seperti yang mereka kira. Karena Allah akan mengazab semua orang yang melakukan dosa kufur dan dosa-dosanya mengelilinginya dari segala penjuru. Dan Allah akan membalas kesalahan itu dengan memasukkan mereka ke dalam neraka dan menempatkan mereka di dalamnya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Hal ini bukanlah seperti yang kalian anggap, namun kebenarannya adalah bahwa ALlah telah menetapkan barangsiapa yang berbuat kesalahan dan terus menerus berbuat dosa seperti kesyirikan, dan mereka ia tidak bertaubat, maka ia adalah orang yang jauh dari rahmat ALlah dan termasuk penghuni neraka yang kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. بَلَىٰ مَنْ كَسَبَ سَيِّئَةً ((Bukan demikian), akan tetapi: barangsiapa berbuat dosa) Yakni berupa dosa kesyirikan dan kesalahan yang termasuk dosa-dosa besar dan tidak bertaubat dari hal itu. وَأَحَاطَتْ بِهِ خَطِيئَتُهُ (dan ia telah diliputi oleh dosanya) Yakni orang yang beramal seperti amal-amal kalian (orang-orang Yahudi) dan kafir seperti kekafiran kalian sampai kekufuran mereka mengepung amal kebaikan mereka"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Semua itu tidak seperti yang kalian persepsikan wahai kaum Yahudi, namun siapa saja yang telah ingkar kepada ALlah dan mendustakan utusan-Nya akan Kami masukkan ke neraka. Juga siapapun yang menyekutukan-Nya, bermaksiat kepada-Nya dan belum bertaubat atas dosa-dosanya. Semua keburukan yang mereka perbuat akan menyelimuti mereka, sehingga mereka mati dalam kekafiran. Merekalah penghuni neraka, mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukan demikian Siapa saja yang berbuat keburukan} berbuat syirik {dan dikelilingi oleh dosa-dosanya} dan di kelilingi dari segala arah oleh dosa-dosanya {maka mereka itulah penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “barangsiapa yang berbuat dosa,” dengan kata berbentuk nakirah (umum) dalam susunan kalimat syarat, maka mencakup kesyirikan ataupun yang lainnya, walaupun maksudnya adalah kesyirikan, dalam hal ini dengan dasar dalil Firman Allah ta’ala , “Dan dia telah diliputi oleh dosanya, ” maksudnya pelakunya telah diliputi hingga dia tidak memiliki jalan keluar, hal ini tidaklah lain kecuali kesyirikan saja, karena barangsiapa yang memiliki keimanan, maka dia tidak akan diliputi oleh kesalahannya. “Mereka itulah penghuni neraka, mereka kekal di dalamnya.” Orang-orang khawarij berhujjah dengan ayat ini atas kufurnya pelaku kemaksiatan, padahal ayat itu sebagai hujjah bantahan terhadap mereka sebagaimana yang jelas anda lihat, karena ayat itu sebenarnya jelas tentang kesyirikan. Demikianlah setiap pelaku kebatilan selalu berhujjah dengan suatu ayat atau hadist yang shahih untuk memperkuat perkataannya yang batil, sehingga dalil yang dipakainya berhujjah menjadi bantahan yang melawannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { سَيِّئَةٗ } sayyiatan : Dosa kekufuran dan kedustaan atas nama Allah Ta’ala. { وَأَحَٰطَتۡ بِهِۦ } ahaathat bihi : Melingkupi dan mengitarinya { خَطِيٓ‍َٔتُهُۥ } khatii’atuhu : al-Khatii’ah merupakan bentuk tunggal dari al-Khathaayaa artinya adalah dosa secara umum. { الخلود } al-Khuluud : Tinggal tanpa ada batas waktu, tidak berpindah atau pergi. Makna ayat : Sungguh benar, perkaranya tidak semudah yang mereka katakan, karena timbangannya antara pahala dan dosa. Barangsiapa melakukan banyak keburukan sehingga dosa-dosanya meliputi dirinya dan mengotori jiwanya, maka tidak ada yang pantas bagi kekotoran jiwanya kecuali neraka. Barangsiapa beriman dan beramal shaleh kemudian dengan keimanan dan amalan itu ia mensucikan dirinya, maka yang pantas untuk kesucian dirinya adalah surga negeri keabadiaan. Adapun kedudukan sosial serta nasab dan pengakuan-pengakuan dusta tidak berpengaruh sama sekali untuk merubah status di akhirat nanti. Pelajaran dari ayat : • Tidak bermanfaatnya nasab dan kedudukan, serta pengukuhan bahwa kebahagiaan manusia sama faktornya dengan celakanya. Yaitu faktor kebahagiaan manusia adalah iman dan amal shaleh sedangkan celakanya karena kesyirikan dan kemaksiatan. • Peringatan terhadap bahayanya dosa baik yang kecil maupun besar. Dan anjuran untuk menghapuskan dosa dengan bertaubat dan beramal shaleh sebelum dosa itu meliputi jiwa dan menghalanginya untuk bertaubat, wal’iyaadzu billah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 81: Allah mengabarkan bahwasannya siapa yang melakukan dosa dan bergelimang dosa sampai jatuh kepada kesyirikan dan berkuasa atasnya dosa – dosa , maksiat – maksiat, dari seluruh sisi; maka mereka adalah orang – orang musyrik dan kafir dan mereka adalah penghuni neraka selamanya di dalamnya, tidak keluar mereka dari neraka tersebut selamanya; karena sebab apa yang mereka kerjakan dari kesyirikan dan dosa – dosa besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keburukan di sini adalah syirk, berdasarkan lanjutan ayatnya, yaitu \"wa ahaathat bihi khathii'atuh\" (dan dosanya telah menenggelamkannya), karena selain syirk tidak membuat seseorang tenggelam dalam dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 81",
    "description": "Sebenarnya tidak ada janji dari Allah, bukan juga karena mereka tidak tahu. Sumber masalahnya adalah sikap mereka yang memutarbalikkan ayat-ayat Allah. Bukan demikian, yang benar adalah barang siapa berbuat keburukan, yaitu mempersekutukan Allah, dan dosanya telah menenggelamkannya, yakni ia diliputi oleh dosanya sehingga seluruh kehidupannya tidak mengandung sedikit pun kebaikan akibat ketiadaan iman kepada Allah, maka mereka itu penghuni neraka. Mereka kekal di dalamnya. Sedangkan orang-orang yang beriman dengan benar sebagaimana diajarkan nabi-nabi mereka dan mengerjakan kebajikan sesuai tuntunan Allah dan rasul, maka mereka itu penghuni surga. Mereka juga kekal di dalam nya"
  }
]