[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketetapan Allah yang baku yang berlaku pada keadaan yang merupakan kebalikan dari keadaan sebelumnya adalah bahwa orang-orang yang beriman kepada Allah dan Rasul rasul-Nya dengan keimanan sejati dan mereka mengerjakan amal-amal sholeh yang sejalan dengan syariat Allah yang Allah wahyukan kepada rasul-rasul-Nya. Mereka itu akan mendapatkan surga di akhirat secara permanen terus menerus dan tidak terputus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Sedangkan orang-orang yang beriman kepada Allah dan Rasul-Nya, dan menjalankan amal saleh, ganjaran mereka di sisi Allah ialah masuk ke dalam surga dan menetap di dalamnya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Adapun orang yang beriman kepada Allah dan Rasul-Nya serta beramal dengan keimanan mereka, maka mereka akan mendapat derajat yang tinggi di surga yang kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ (Dan orang-orang yang beriman serta beramal shaleh) Yakni beriman kepada yang kalian (orang-orang Yahudi) ingkari dan mengerjakan apa yang kalian tinggalkan, mereka akan mendapatkan surga dan kekal didalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Adapun orang-orang yang beriman kepada Allah serta beriman kepada risalah para utusan-Nya, beramal kebaikan sebagaimana yang Allah perintahkan, maka merekalah penghuni surga, mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang beriman dan beramal shalih, mereka itulah penghuni surga. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. “Dan orang-orang yang beriman” kepada Allah, para malaikat, kitab-kitabNya, Rosul-rosulNya, dan Hari Akhir, “serta beramal shalih, ” dan suatu amal itu tidak menjadi shalih kecuali dengan dua syarat : Amal tersebut ikhlas hanya untuk Allah dan mengikuti Sunnah Rosululloh-Nya. Kesimpulan dari kedua ayat ini adalah bahwa orang-orang yang selamat dan berhasil adalah orang-orang yang beriman dan beramal shalih, sedangkan orang-orang yang celaka (penghuni neraka) adalah orang-orang yang musyrik kepada Allah dan kafir terhadapNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Ayat-ayat ini masih mengenai peringatan kepada orang-orang Yahudi mengenai berbagai peristiwa yang terjadi pada pendahulu mereka yang baik atau selainnya. Peringatan ini sebagai petunjuk kepada mereka, jika mereka mendapatkan petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 82: Kemudian Allah mengabarkan bahwasannya mereka yang beriman kepada Allah, malaikat – malaikat, kitab – kitab, rasul – rasul dan hari akhir serta beramal dengan amalan sholeh dengan ikhlas mengharap wajah Allah kemudian menjadi pengikut sunnah rasullullah, mak sungguh mereka adalah penghuni surga yang kekal di dalamnya selamanya atas karunia Allah dan rahmatNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Allah, malaikat-Nya, kitab-kitab, nabi dan Rasul, hari akhir dan qadar Allah yang baik atau yang buruk. Amal tidak bisa dikatakan shaleh kecuali dengan dua syarat: pertama, diniatkan karena Allah; kedua, sesuai sunnah Rasulullah shallallahu 'alaihi wa sallam. Kesimpulan dari ayat 81 dan 82 adalah bahwa orang yang beruntung mendapatkan surga dan selamat dari neraka adalah orang-orang yang beriman dan beramal shalih. Sebaliknya, orang yang rugi dan masuk ke dalam neraka adalah orang-orang yang kafir dan musyrik kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 82",
    "description": "Sebenarnya tidak ada janji dari Allah, bukan juga karena mereka tidak tahu. Sumber masalahnya adalah sikap mereka yang memutarbalikkan ayat-ayat Allah. Bukan demikian, yang benar adalah barang siapa berbuat keburukan, yaitu mempersekutukan Allah, dan dosanya telah menenggelamkannya, yakni ia diliputi oleh dosanya sehingga seluruh kehidupannya tidak mengandung sedikit pun kebaikan akibat ketiadaan iman kepada Allah, maka mereka itu penghuni neraka. Mereka kekal di dalamnya. Sedangkan orang-orang yang beriman dengan benar sebagaimana diajarkan nabi-nabi mereka dan mengerjakan kebajikan sesuai tuntunan Allah dan rasul, maka mereka itu penghuni surga. Mereka juga kekal di dalam nya. Ingatlah dan renungkanlah keadaan mereka ketika kami, melalui rasul kami, mengambil janji dari bani israil yaitu bahwa, janganlah kamu menyembah sesuatu pun dan dalam bentuk apa pun selain Allah yang maha esa, dan berbuat baiklah dalam kehidupan dunia ini kepada kedua orang tua dengan kebaikan yang sempurna, walaupun mereka kafir; demikian juga kepada kerabat, yaitu mereka yang mempunyai hubungan dengan kedua orang tua, serta kepada anak-anak yatim yakni mereka yang belum balig sedang ayahnya telah wafat, dan juga kepada orang-orang miskin, yaitu mereka yang membutuhkan uluran tangan. Dan bertuturkatalah yang baik kepa da manusia seluruhnya tanpa kecuali. Setelah memerintahkan hal-hal yang dapat memperkuat hubungan kekeluargaan dan hubungan sosial lainnya, Allah menyusulinya dengan sesuatu yang terpenting dalam hubungan dengan Allah, laksanakanlah salat sebaik mungkin dan secara istikamah, dan tunaikanlah zakat dengan sempurna. Itulah perjanjian yang kamu mereka sepakati dengan Allah, wahai bani israil, tetapi kemudian kamu berpaling dengan meng ingkari janji itu, kecuali sebagian kecil dari kamu, dan kamu masih menjadi pembangkang. Betapa objektif Al-Qur'an dalam menilai manusia; salah satu buktinya tampak pada ayat ini. Di sini dinyatakan bahwa tidak semua individu bani israil mengingkari perjanjian, seperti diisyaratkan dengan kalimat kecuali sebagian kecil dari kamu. Ini menunjukkan bahwa dalam setiap periode kehidupan bani israil atau bangsa-bangsa lain selalu saja ada sekelom pok kecil yang tetap berjalan lurus dengan mengikuti suara hati nuraninya untuk selalu berbuat baik, seperti dapat kita baca pada surah a'li imr a'n/3: 113."
  }
]