[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatkan wahai Bani Israil ketika kami mengambil janji yang dikukuhkan dari kalian, Agar kalian beribadah kepada Allah semata tidak ada sekutu baginya, hendaknya kalian berbuat baik kepada kedua orang tua, dan orang-orang dari kaum kerabat,dan sedekah kepada anak-anak yang bapak-bapak mereka meninggal dunia sebelum mereka berusia balig, dan kepada orang-orang yang membutuhkan yang tidak memiliki apa yang mencukupi kebutuhan mereka, dan hendaklah berkata kepada sekalian manusia dengan tutur kata yang terbaik disertai dengan melaksanakan sholat, membayar zakat. Tapi kemudian kalian berpaling dan melanggar perjanjian itu (kecuali sebagian kecil dari kalian yang terus diatas janji itu), sedang kalian berkelanjutan dalam keberpalingan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Dan ingatlah –wahai Bani Israil- tentang perjanjian kuat yang Kami ambil dari kalian, bahwa kalian akan mengesakan Allah dan tidak menyembah tuhan lain bersama-Nya, kalian akan berbuat baik kepada kedua orang tua, sanak famili, anak-anak yatim dan orang-orang miskin yang membutuhkan, kalian akan mengucapkan kata-kata yang baik kepada manusia untuk menyuruh berbuat kebaikan dan melarang kemungkaran tanpa kekerasan dan tanpa tekanan, kalian akan melaksanakan salat secara sempurna sebagaimana perintah yang diberikan kepada kalian, dan akan membayar zakat dengan cara memberikannya kepada orang-orang yang berhak menerimanya dengan suka rela. Namun setelah perjanjian itu kalian justru berpaling dan enggan menepatinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Dan ingatlah wahai para keturunan Ya’qub ketika Kami mengambil perjanjian yang teguh dari kalian dalam Taurat agar kalian mengesakan Allah dan mengikhlaskan peribadatan kepada-Nya, berbuat baik kepada kedua orang tua dengan perkataan dan perbuatan, berlaku baik kepada para kerabat, anak-anak yang kehilangan ayah mereka ketika mereka masih kecil, orang-orang miskin yang terhimpit kebutuhan dan tidak mampu mencukupinya, berucap kepada orang lain dengan kalimat yang baik, mendirikan shalat pada waktunya, dan menunaikan zakat bagi yang berhak menerimanya; namun kalian enggan dan menolak perjanjian ini, -kecuali sebagian kecil dari kalian yang menjalankannya- dan kalian terus menerus enggan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَإِذْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ (Dan (ingatlah), ketika Kami mengambil janji dari Bani Israil ) Yakni perjanjian yang diambil Allah atas Bani Israil dalam kehidupan mereka yang disampaikan oleh para nabi. لَا تَعْبُدُونَ إِلَّا اللَّهَ (Janganlah kamu menyembah selain Allah) Yakni perjanjian untuk mentauhidkan Allah dalam ibadah. وَبِالْوَالِدَيْنِ إِحْسَانًا (dan berbuat kebaikanlah kepada ibu bapa) Yakni dengan bergaul dengan mereka dengan baik, bertawadlu di depan mereka, dan mematuhi perintah mereka. وَذِي الْقُرْبَىٰ (kaum kerabat) Yakni berbuat baik kepada kerabat dengan menjaga hubungan dengan mereka dan membantu memenuhi yang mereka butuhkan sesuai dengan kesanggupan. وَالْيَتَامَىٰ (anak-anak yatim) Istilah yatim untuk manusia adalah anak yang kehilangan bapaknya, sedangkan untuk hewan adalah yang kehilangan ibu/induknya. وَالْمَسَاكِينِ (dan orang-orang miskin) Miskin adalah orang yang tidak mampu memenuhi kebutuhannya; dan menurut kebanyakan ahli bahasa dan sebagian ahli fikih, miskin lebih parah keadaannya daripada fakir, dan diriwayatkan dari Imam Syafi’i bahwa fakir lebih parah daripada miskin. وَقُولُوا لِلنَّاسِ حُسْنًا (serta ucapkanlah kata-kata yang baik kepada manusia) Yakni ucapkanlah ucapan yang baik, dan semua ucapan yang menurut syari’ah adalah baik maka ia termasuk dalam apa yang diperintahkan dalam ayat ini. وَآتُوا الزَّكَاةَ (dan tunaikanlah zakat) Yakni zakat yang biasa kalian (orang-orang Yahudi) keluarkan. Ibnu Athiyyah berkata: cara mereka mengeluarkan zakat adalah dengan meletakkan zakat tersebut, apabila zakat itu disambar oleh api maka berarti diterima oleh Allah dan apabila tidak maka berarti tidak diterima oleh Allah. ثُمَّ تَوَلَّيْتُمْ (Kemudian kamu tidak memenuhi janji itu) Yakni melanggar perjanjian itu dengan tidak mengamalkan apa yang ada dalam perjanjian bahkan kalian tinggalkan itu semuanya. إِلَّا قَلِيلًا (kecuali sebahagian kecil daripada kamu) Dan diantara mereka adalah Abdullah bin Salam dan para sahabatnya yang beriman kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika seseorang berbicara maka hendaklah ia berkata yang baik, dan senantiasa membiasakan lisannya mengeluarkan hal-hala yang baik; karena sesungguhnya ungkapan baik yang selalu mengiasi diri seseorang adalah adab yang tinggi derajatnya, Allah telah mewajibkan hal ini kepada ummat manusia seluruh : { وَقُولُوا لِلنَّاسِ حُسْنًا }. 2 ). { وَقُولُوا لِلنَّاسِ حُسْنًا }, perhatikanlah { لِلنَّاسِ } ayat memerintahkan kita untuk berkata baik kepada manusia tanpa membedakan diantara mereka jenis kelamin, kewarganegaraan, warna dan agamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Rasul, ingatlah isi perjanjian yang diucapkan oleh Bani Israil: bahwa mereka tidak akan menyembah selain Allah, berbakti kepada orang tua baik denganinteraksi yang baik, tawadhu’, dan melaksanakan perintah mereka. Kemudian berbuat baik kepada tetangga, menyambung silaturrahmi serta memenuhi hak-hak mereka. Kemudian berbuat baik kepada anak-anak yatim-piatu yang telah kehilangan orang tua mereka sejak kecil, juga kepada para fakir miskin yang tidak dapat memenuhi kebutuhan mereka. Interaksi dengan sesama dengan interaksi yang baik dan terpuji. Melaksanakan sholat tepat pada waktunya serta menunaikan zakat. Namun, pada kenyataanya kalian mengingkari perjanjian ini, hanya sedikit yang menepatinya, sepearti Abdullah ibn Salam dan para sahabatnya. Adapun kalian ingkar terhadap perjanjian ini dengan penuh pengingkaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami mengambil janji dari Bani Israil, “Janganlah kalian menyembah selain kepada Allah, dan berbuat baik kepada kedua orang tua, kerabat, anak-anak yatim, dan orang-orang miskin. Dan bertutur katalah yang baik kepada manusia} perkataan yang baik {dirikanlah shalat, dan tunaikanlah zakat.” Kemudian kalian berpaling} kalian berpaling dari janji itu {kecuali sebagian kecil dari kalian dan kalian menjadi orang-orang yang berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Syariat-syariat ini adalah diantara dasar-dasar agama yang diperintahkan oleh Allah pada setiap syariat yang diturunkan, karena meliputi maslahat-maslahat yang umum dalam setiap masa dan tempat, yang tidak disentuh oleh hokum naskh, sebagai dasar agama. Karenanya Allah memerintahkan kepada kita untuk itu dalam firman-Nya : \"dan sembahlah Allah dan janganlah menyekutukan_nya dengan sesuatupun\" sampai akhir ayat. firmanNya “Dan (ingatlah), ketika kami mengambil janji dari Bani Israil.” Ini merupakan bagian dari kekerasan hati mereka, bahwa setiap perintah yang ditunjukkan kepada mereka, niscaya mereka melanggarnya, dan mereka tidaklah menerimanya, kecuali dengan sumpah-sumpah yang kuat dan janji-janji yang kokoh. Dan perjanjian tersebut adalah “janganlah kamu menyembah selain Allah.” Ini merupakan perintah untuk menyembah kepada Allah semata dan larangan dari mempersekutukanNya. Ini adalah dasar agama, dimana segala perbuatan tidak akan diterima bila tidak berdasar diatasnya, dan hal itu adalah hak Allah atas hamba-hambaNya. Kemudian Allah berfirman, ”dan berbuat baiklah kepada ibu bapak, ” yakni berbaktilah kalian kepada kedua orang tua ini. Bersifat umum mencakup segala kebajikan, baik perkataan maupun tindakan yang merupakan perbuatan baik kepada mereka. Ayat ini menunjukkan larangan dari berbuat buruk kepada kedua orang tua atau larangan tidak berbuat baik dan berbuat jelek, karena yang wajib adalah berbuat baik, dan perintah kepada sesuatu adalah larangan dari hal yang bertentangan dengannya. Dan kebalikan dari berbuat kebaikan ada dua, berbuat buruk yang merupakan kejahatan yang paling besar, dan meninggalkan berbuat baik sekalipun tidak berbuat buruk, juga merupakan hal yang diharamkan, akan tetapi tidak mesti di samakan dengan yang pertama . Dan seperti ini juga hukumnya dalam hal silaturahim kepada kerabat, anak-anak yatim, dan orang-orang miskin. Adapun perincian masalah berbuat baik tidaklah terbatas oleh bilangan, akan tetapi dengan definisi sebagaimana yang telah berlalu. Kemudian Allah memerintahkan manusia untuk berbuat baik secara umum dengan firmanNya, “Serta ucapkanlah kata-kata yang baik kepada manusia,” dan diantara perkataan yang baik adalah memerintah mereka kepada yang ma’ruf dan mencegah mereka dari perbuatan mungkar, serta mengajarkan ilmu kepada mereka, menyebarkan salam dan wajah berseri, dan lain sebagainya dari perkataan-perkataan yang baik. Dan ketika tidak semua manusia mampu berbuat baik dengan hartanya, maka mereka diperintahkan dengan suatu hal yang mereka mampu melakukannya untuk berbuat baik kepada setiap makhluk, yaitu berbuat baik dengan perkataan. Dengan demikian termasuk dalam kandungan hal itu juga adalah larangan dari perkataan yang buruk kepada manusia hingga kepada kaum kafir. Oleh karena itu Allah berfirman : \"dan janganlah mendebat ahlu kitab kecuali dengan cara yang baik\" Dan di antara tata krama seorang manusia yang telah Allah didikkan kepada hamba-hambaNya adalah agar manusia itu mulia dalam perkataan maupun tindakannya, tidak berlaku keji dan tidak pula jorok, tidak mencela dan tidak juga bertengkar, akan tetapi berakhlak yang baik, luas keramahannya, pandai bergaul dengan setiap orang, bersabar atas segala yang diterima dari gangguan makhlukNya sebagai tindakan menaati perintah Allah dan peengharapan atas ganjaranNya. Kemudian Allah memerintahkan mereka untuk mendirikan Shalat dan menunaikan Zakat, karena seperti yang telah dijelaskan bahwa shalat itu mengandung sikap keikhlasan kepada dzat yang disembah, sedangkan zakat mengandung tindakan berbuat baik kepada hamba. Kemudian setelah perintah ini, kalian pasti mendapatkan kebaikan-kebaikan dan justru dengan adanya perintah –perintah yang baik tersebut, yang mana bila seorang yang sangat jeli dan paham melihat hal-hal itu niscaya dia akan mengetahui kebaikan Allah ta’ala terhadap hamba-hambaNya yang memerintahkan hal-hal tersebut kepada mereka dan memuliakan mereka dengannya, yang telah mengambil janji-janji atas kalian, ” kamu tidak memenuhi janji itu, ” dengan cara berpaling, karena orang byang berbalik pergi itu kadang masih memiliki niat untuk kembali lagi kepada hal yang dia tinggalkan, namun mereka ini sama sekali tidak memiliki keinginan dan tidak pula punya niat untuk kembali. Maka mari kita berlindung kepada Allah dari keterhinaan. Dan firmanNya, “Kecuali sebagian kecil dari kamu, ” ini adalah pengecualian, agar tidak timbul asumsi bahwasanya mereka berpaling semuanya, maka Allah mengabarkan bahwa ada sedikit diantara mereka yang dilindungi oleh Allah dan dikukuhkan dalam hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { الميثاق } al-Miitsaaq : Perjanjian yang diperkuat dengan sumpah { حُسۡنٗا } husnan : Perkataan yang baik adalah perkataan yang mengandung amar makruf nahi mungkar, serta mengajak bicara dengan lembut, serta ucapan yang baik tidak mengandung kata-kata kotor atau keji. { تَوَلَّيۡتُمۡ } tawallaitum : Kalian berbalik arah dari hal yang kalian pegang erat dan bersikukuh untuk tidak bertaubat. Makna ayat : Allah Ta’ala telah mengingatkan pada ayat 83 tentang perjanjian yang telah diambil dalam kitab Taurat agar orang-orang Yahudi beribadah kepada Allah saja dan tidak menyekutukanNya dengan sesuatu apapun dalam peribadahan kepadaNya. Juga agar berbuat baik kepada kedua orang tua, kerabat dekat, anak-anak yatim, orang-orang miskin, dan agar mereka berkata yang baik kepada manusia serta mendirikan shalat, membayar zakat. Kemudian Allah mengutuk mereka karena kebanyakan tidak mau menepati perjanjian tersebut. Pelajaran dari ayat : • Anjuran untuk mengingatkan dan menasehati manusia sehingga menjadi sebab datangnya hidayah kepada mereka. • Kewajiban beribadah dan bertauhid kepada Allah Ta’ala semata. • Kewajiban berbuat baik kepada orangtua, karib kerabat, anak-anak yatim, dan orang-orang miskin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 83: Kemudian Allah menyebutkan tentang bani israil pada suatu hari yang bahwasannya diambil kesepakatan – kesepakatan yang tidaklah mereka beribadah kecuali hanya kepada Allah saja tanpa menyekutukannya, dan Allah memerintahkan untuk berbuat baik kepada orang tua, dan menyambung silahturahmi, dan berbuat baik kepada anak yatim yang kehilangan bapak – bapak mereka sedangkan keadaan mereka belum mencapai usia baligh, dan berbuat baik kepada orang – orang yang membutuhkan dari kalangan miskin, dan agar mereka berkata kepada manusia dengan perkataan yang baik; dengan mengucapkan salam dan tersenyum serta memerintahkan yang baik dan melarang keburukan dan selain amalan – amalan baik lainnya. Allah memerintahkan kepada mereka untuk menegakkan sholat dan berzakat, akan tetapi mereka menolak dan melawan kesepakatan serta mereka terus dalam keadaan menolak dari perjanjian kecuali hanya sedikit diantara mereka berpegang teguh dengan tali Allah dan tetap diatas kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Janji ini diadakan karena mereka (Bani Israil) sering bermaksiat, maka Allah mengambil perjanjian yang kokoh dari mereka. Berbuat baik kepada mereka mencakup berbuat baik dengan perkataan dan perbuatan. Perintah berbuat baik kepada mereka menunjukkan larangan berbuat jahat (isaa'ah) dan tidak berbuat ihsan. Anak yatim adalah anak yang ditinggal mati oleh bapaknya, sedangkan usia mereka belum mencapai masa baligh. Dalam perjanjian ini, Allah memerintahkan mereka untuk bertutur kata yang baik kepada semua manusia. Termasuk bertutur kata yang baik adalah beramr ma'ruf dan bernahi munkar, mengajarkan ilmu agama, menyebarkan salam, senyum dan perkataan baik lainnya. Dalam perintah bertutur kata yang baik kepada semua manusia terdapat perintah berbuat ihsan secara umum, karena dengan perbuatan dan harta terkadang di antara manusia ada yang tidak bisa melakukannya, maka Allah Subhaanahu wa Ta'aala memerintahkan minimal dengan perkataan. Di ayat ini, Allah Subhaanahu wa Ta'aala mengajarkan manusia agar ucapan dan tindakannya bersih dari perkara keji, kotor, mencaci maki dan bermusuhan. Syari'at yang disebutkan pada ayat di atas adalah termasuk Ushuluddin (prinsip-prinsip agama) yang diperintahkan Allah Azza wa Jalla dalam semua syari'at, karena di dalamnya terdapat maslahat yang banyak di setiap waktu dan tempat, sehingga bagaimana pun juga, syari'at ini tidak akan mansukh (dihapus) sebagaimana dasar agama yang paling pertama dan utama yaitu tauhid (menyembah hanya kepada Allah) tidak akan mansukh. Lihat juga tentang Ushuluddin lainnya di surat Al An'aam: 151-153 dan Al Israa': 23-39."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 83",
    "description": "Ingatlah dan renungkanlah keadaan mereka ketika kami, melalui rasul kami, mengambil janji dari bani israil yaitu bahwa, janganlah kamu menyembah sesuatu pun dan dalam bentuk apa pun selain Allah yang maha esa, dan berbuat baiklah dalam kehidupan dunia ini kepada kedua orang tua dengan kebaikan yang sempurna, walaupun mereka kafir; demikian juga kepada kerabat, yaitu mereka yang mempunyai hubungan dengan kedua orang tua, serta kepada anak-anak yatim yakni mereka yang belum balig sedang ayahnya telah wafat, dan juga kepada orang-orang miskin, yaitu mereka yang membutuhkan uluran tangan. Dan bertuturkatalah yang baik kepa da manusia seluruhnya tanpa kecuali. Setelah memerintahkan hal-hal yang dapat memperkuat hubungan kekeluargaan dan hubungan sosial lainnya, Allah menyusulinya dengan sesuatu yang terpenting dalam hubungan dengan Allah, laksanakanlah salat sebaik mungkin dan secara istikamah, dan tunaikanlah zakat dengan sempurna. Itulah perjanjian yang kamu mereka sepakati dengan Allah, wahai bani israil, tetapi kemudian kamu berpaling dengan meng ingkari janji itu, kecuali sebagian kecil dari kamu, dan kamu masih menjadi pembangkang. Betapa objektif Al-Qur'an dalam menilai manusia; salah satu buktinya tampak pada ayat ini. Di sini dinyatakan bahwa tidak semua individu bani israil mengingkari perjanjian, seperti diisyaratkan dengan kalimat kecuali sebagian kecil dari kamu. Ini menunjukkan bahwa dalam setiap periode kehidupan bani israil atau bangsa-bangsa lain selalu saja ada sekelom pok kecil yang tetap berjalan lurus dengan mengikuti suara hati nuraninya untuk selalu berbuat baik, seperti dapat kita baca pada surah a'li imr a'n/3: 113. Bila ayat-ayat yang lalu berkaitan dengan hal-hal yang harus mereka kerjakan, maka ayat ini mengingatkan isi perjanjian menyangkut hal-hal yang harus mereka tinggalkan. Ayat ini memerintahkan lagi; dan ingatlah juga ketika kami, melalui nabi musa, mengambil janji dari leluhur kamu, wahai bani israil, janganlah kamu menumpahkan darahmu, yakni mem bunuh orang lain tanpa hak, dan jangan pula kamu mengusir dirimu, saudara sebangsa mu, dari kam pung halamanmu, apalagi kampung halaman mereka sendiri. Selanjutnya, mereka juga diingatkan, kemudian kamu berikrar di depan umum akan memenuhinya, wahai yang mendengar ayat Al-Qur'an ini dan yang hidup pada masa nabi Muhammad, dan bersaksi bahwa perjanjian itu memang pernah dilakukan oleh nenek moyang kalian. Ayat ini mengingatkan dan menegaskan pentingnya persatuan dan kesatuan antarmanusia. Isyarat ini diperoleh dari penggunaan kata darahmu, dirimu sendiri dan kampung hala manmu, padahal yang dimaksud adalah orang lain. Ini karena dalam pandang-an Allah seorang manusia pada hakikatnya merupakan saudara seketu runan manusia yang lain. Dapat juga dikatakan bahwa jika seseorang berbuat buruk kepada orang lain maka pada hakikatnya ia berbuat buruk kepada diri sendiri, seperti dinyatakan dalam surah al-a'ujura't/49: 11."
  },
  {
    "title": "Tafsir Tematis / Team Asatidz TafsirWeb",
    "description": "Melalui ayat ini Allah mengingatkan kaum Bani Isroil terhadap apa yang telah Dia perintahkan kepada mereka dan pengambilan janji oleh-Nya atas hal tersebut dari mereka, tetapi mereka berpaling dari semuanya itu dan menentang secara disengaja dan direncanakan, sedangkan mereka mengetahui dan mengingat hal itu. Hal pertama yang Allah Subhanahu wa Ta'ala perintahkan kepada mereka adalah agar menyembah-Nya dan jangan menyekutukan-Nya dengan sesuatupun. Hal yang sama diperintahkan kepada seluruh makhluk-Nya, dan untuk tujuan tersebutlah Allah Subhanahu wa Ta'ala menciptakan mereka. Sebagaimana yang diseutkan dalam ayat lain, yaitu firman-Nya : وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدُونِ Dan Kami tidak mengutus seorang rasulpun sebelum kamu melainkan Kami wahyukan kepadanya: \"Bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka sembahlah olehmu sekalian akan Aku\" (QS. Al-Anbiya :25) وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اعْبُدُوا اللَّهَ وَاجْتَنِبُوا الطَّاغُوتَ فَمِنْهُمْ مَنْ هَدَى اللَّهُ وَمِنْهُمْ مَنْ حَقَّتْ عَلَيْهِ الضَّلَالَةُ فَسِيرُوا فِي الْأَرْضِ فَانْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan): \"Sembahlah Allah (saja), dan jauhilah Thaghut itu\", maka di antara umat itu ada orang-orang yang diberi petunjuk oleh Allah dan ada pula di antaranya orang-orang yang telah pasti kesesatan baginya. Maka berjalanlah kamu dimuka bumi dan perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (rasul-rasul). (QS. An-Nahl :36) Hal ini merupakan hak yang paling tinggi dan paling besar, yaitu hak Allah Subhanahu wa Ta'ala yang mengharuskan agar Dia semata yang disembah, tiada sekutu baginya. Yang kedua yang diperintahkan setelah itu adalah memenuhi hak makhluk, dan yang paling dikuatkan untuk ditunaikan ialah hak kedua orang tua. Karena itu Allah Subhanahu wa Ta'ala selalu membarengi hak kedua orang tua dengan hak-Nya, seperti yang dijelaskan dalam firman-Nya : وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَى وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapaknya; ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam dua tahun. Bersyukurlah kepada-Ku dan kepada dua orang ibu bapakmu, hanya kepada-Kulah kembalimu. (QS. Luqman :14) Di dalam kitab shohihain disebutkan sebuah hadits dari ibnu Mas’ud RA seperti berikut : قلت : يا رسول الله ، أي العمل أفضل ؟ قال : \" الصلاة على وقتها \" . قلت : ثم أي ؟ قال : \" بر الوالدين \" . قلت : ثم أي ؟ قال : \" الجهاد في سبيل الله \" Aku bertanya “wahai Rosululloh, amalan apakah yang paling utama?”, beliau menjawab “sholat pada waktunya”, aku bertanya lagi “kemudian apa lagi?”, beliau menjawab, “berbakti kepada kedua ibu bapak.” Aku bertanya lagi, “kemudain apa lagi?”. Beliau menjawab, “jihad di jalan Allah”. Kerena itulah disebutkan juga dalam hadits shohih seperti berikut : أن رجلا قال : يا رسول الله ، من أبر ؟ قال : \" أمك \" . قال : ثم من ؟ قال : \" أمك \" . قال : ثم من ؟ قال : \" أباك . ثم أدناك أدناك \" . Seorang laki-laki bertanya, “wahai Rosululloh, siapakah yang harus didahulukan aku berbakti kepadanya?” beliau menjawab, “ibumu” lelaki itu bertanya lagi “kemudian siapa lagi?”. Beliau menjawab, “ibumu.” Lelaki itu bertanya lagi, “kemudian siapa lagi?” Beliau menjawab, “ayahmu, kemudian orang yang paling dekat kekerabatannya denganmu.” Selanjutnya Allah menerangkan bahwa berbuat kebaikan sebagai penunaian hak makhluk bukan hanya kepada orang tua saja, akan tetapi juga mesti dilakukan kepada kaum kerabat, anak yatim, orang miskin, bahkan kepada seluruh makhluk Allah Subhanahu wa Ta'ala. Karena hakikatnya Allah telah mewajibkan berbuat ihsan (kebaikan) dalam segala hal, bahkan termasuk kepada binatang sebagai mana hadits nabi Muhammad Shallallahu 'alaihi wa Sallam berikut ini : عن أبي يعلى شداد بن أوس رضي الله عنه عن رسول الله صلى الله عليه وسلم قال : \" إن الله كتب الإحسان على كل شيء , فإذا قتلتم فأحسنوا القتلة , وإذا ذبحتم فأحسنوا الذبحة وليحد أحدكم شفرته وليرح ذبيحته \" رواه مسلم Dari Abu Ya'la, Syaddad bin Aus radhiyallahu 'anhu, dari Rasulullah Shallallahu ‘alaihi wa Sallam beliau telah bersabda : “ Sesungguhnya Allah mewajibkan berlaku baik pada segala hal, maka jika kamu membunuh hendaklah membunuh dengan cara yang baik dan jika kamu menyembelih maka sembelihlah dengan cara yang baik dan hendaklah menajamkan pisau dan menyenangkan hewan yang disembelihnya”. (HR Muslim no. 1955) Yang ketiga, perintah Allah dalam ayat ini adalah berkata baik sebagaimana firman-NYA : وَقُولُوا لِلنَّاسِ حُسْنًا “Serta ucapkanlah kata-kata yang baik kepada manusia” Maksudnya, berkatalah kepada mereka dengan baik dan lemah lembut; termasuk dalam hal ini amr ma’ruf dan nahyi munkar Dengan cara uang makruf. Sebagaimana Hasan Al-Basri berkata sehubungan dengan ayat ini, bahwa perkataan yang baik ialah yang mengandung amr ma’ruf dan nahyi munkar, serta mengandung kesabaran, pamaafan, dan pengampunan serta berkata baik kepada manusia; seperti yang telah dijelaskan oleh Allah Subhanahu wa Ta'ala., yaitu semua akhlak baik yang diridoi oleh Allah Subhanahu wa Ta'ala. Imam Ahmad meriwayatakan, telah menceritakan kepada kami Rauh, telah menceritakan kepada kami Abu Amir Al-kharraz, dari Abu Imran Al-Juni, dari Abdulloh ibnus Shomit, dari Abu Zar, dari Nabi Muhammad Shallallahu 'alaihi wa Sallam telah bersabda : لا تحقرن من المعروف شيئا ، وإن لم تجد فالق‏ أخاك بوجه منطلق “Janganlah sekali-kali kamu meremehkan suatu hal yang makruf (baik) walau sedikitpun; apabila kamu tidak mendapatkannya, maka sambutlah saudaramu dengan wajah berseri.” (HR : Muslim) Dengan demikian dalam ayat ini terkandung dua kebajikan (ihsan), yaitu ihsan dalam perbuatan dan ihsan dalam ucapan. Yang keempat dan kelima, Allah Subhanahu wa Ta'ala memerintahkan untuk mendirikan sholat dan menunaikan zakat. Firman-NYA : وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ “Dirikanlah sholat dan tunaikalah zakat” Perintah melaksanakan sholat adalah bentuk keilhkasahan kepada Allah yang disembah sedangkan menunaikan zakat adalah bentuk kebaikan kepada sesame hamba. Perintah mendirikan sholat dan menunaikan zakat hampir selalu bersandingan dalam banyak ayat dalam Alquran. Demikianlah perintah yang Allah berikan kepada Bani Isroil yang terkandung dalam ayat ini, dan ternyata sebagian dari mereka berpaling dari semua perintah ini, mereka meninggalkan semuanya dan dengan sengaja berpaling sesudah mereka mengetahuinya, kecuali sedikit dari kalangan mereka yang mengerjakannya. Allah Subhanahu wa Ta'ala telah memerintahakan dengan perinyah yang sama kepada umat ini, sebagaimana disebutkan dalam surat An-Nisa, yaitu firman-NYA: وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَى وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا Sembahlah Allah dan janganlah kamu mempersekutukan-Nya dengan sesuatupun. Dan berbuat baiklah kepada dua orang ibu-bapa, karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga yang dekat dan tetangga yang jauh, dan teman sejawat, ibnu sabil dan hamba sahayamu. Sesungguhnya Allah tidak menyukai orang-orang yang sombong dan membangga-banggakan diri (QS. An-Nisa: 36)"
  }
]