[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah -wahai Bani Israil- ketika kami mengambil dari kalian janji yang dikukuhkan dalam Kitab Taurat, yang Isinya mengharamkan sebagian kalian menumpahkan darah sebagian yang lain, dan sebagian kalian mengusir sebagian yang lain dari perkampungan kalian. Kemudian kalian mengakui hal itu dan kalian mempersaksikan kebenaran janji itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan ingatlah perjanjian kuat yang telah Kami ambil dari kalian di dalam kitab Taurat yang mengharamkan pertumpahan darah dan aksi saling usir di antara kalian, kemudian kalian mengakui perjanjian tersebut dan mempersaksikan kebenarannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Dan ingatlah wahai para keturunan Ya’qub ketika Kami mengambil perjanjian yang teguh dari kalian dalam Taurat agar kalian tidak saling membunuh dan tidak saling menzalimi dengan mengusir mereka dari rumah dan negerinya, kemudian kalian mengakui perjanjian tersebut dan menyaksikan kewajiban dan kebenarannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. لَا تَسْفِكُونَ دِمَاءَكُمْ (kamu tidak akan menumpahkan darahmu) Yakni kami mengambil perjanjian atas kalian agar tidak saling membunuh dan saling mengusir dari tempat tinggal kalian ثُمَّ أَقْرَرْتُمْ (kemudian kamu berikrar (akan memenuhinya)) Yakni kemudian kalian menyetujuinya dan bersaksi atas perjanjian tersebut. Allah telah mengambil perjanjian atas Bani Israil agar tidak saling membunuh, saling mengusir, dan saling memperbudak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai kaum Yahudi, ingatlah ketika kami mengambil janji atas kalian di dalam kitab Taurat: untuk tidak membunuh sesama, tidak mengusir saudara kalian dengan kebencian dan kedzaliman. Kemudian kalian mengakui dan menerima perjanjian itu, dan kalian berikrar dan bersaksi atas diri kalian, sedang kalianpun juga mengetahui bahwa ini adalah perjanjian kalian dengan Allah dalam kitab Taurat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika Kami mengambil janji kalian (agar) kalian tidak menumpahkan darah kalian} agar kalian tidak meneteskan darah kalian dengan membunuh satu sama lain {dan tidak mengusir diri kalian dari kampong halaman kalian} dan sebagian kalian tidak mengusir yang lainnya dari kampong halamannya {Kemudian, kalian berikrar} mengakui janji ini {dan bersaksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Perbuatan yang disebutkan dalam ayat itu adalah sebuah perbuatan orang-orang yang ada pada zaman turunnya wahyu di Madinah. Hal itu karena suku Aus dan Khazraj –yang mana mereka itu adalah kaum Anshar- sebelum diutusnya Nabi sholallohu 'alaihi wasallam adalah kaum musyrikin, dan mereka dahulu saling berperang sebagaimana kebiasaan kaum jahiliyah. Lalu datang kepada mereka tiga kelompok dari kelompok-kelompok kaum Yahudi, yaitu Bani Quraizhah, Bani Nadhir, dan Bani Qainuqa, ’ dan setiap dari kelompok itu bergabung bersama salah satu kelompok penduduk Madinah. Kondisi penduduk Madinah tersebut bila saling berperang, maka orang-orang Yahudi itu mendukung sekutunya untuk memerangi kelompok yang dibantu oleh Yahudi yang lain, yang akhirnya orang Yahudi membunuh Yahudi lainnya dan dia mengusirnya dari kampungnya bila terjadi kekalahan ataupun perampasan. Kemudian bila peperangan berhenti, dan diantara kedua belah pihak memiliki tawanan-tawanan, maka sebagian mereka menebus sebagian yang lain. Ketiga perkara itu telah diwajibkan atas mereka, diwajibkan atas mereka agar tidak menumpahkan darah sebagian mereka atas sebagian lainnya, dan sebagian mereka tidak mengusir sebagian lainnya, lalu apabila mereka mendapatkan tawanan diantara mereka, maka wajib atas mereka untuk menebusnya. Namun mereka mengamalkan yang terakhir ini dan tidak mengamalkan dua hal yang sebelumnya, lalu Allah mengingkari perbuatan mereka seraya Allah berfirman, “Apakah kamu beriman kepada sebagian al-Kitab (Taurat)” yaitu penebusan tawanan, “dan ingkar terhadap sebagian yang lain?” yaitu pembunuhan dan pengusiran. Ayat ini adalah dalil bahwasanya keimanan itu menuntut pelaksanaan perintah dan menjauhi larangan, dan bahwasanya hal-hal yang diperintahkan itu adalah di antara keimanan. Allah berfirman, “Tiadalah balasan bagi orang yang berbuat demikian darimu, melainkan kenistaan dalam kehidupan dunia.” Hal itu benar-benar telah terjadi, di mana Allah telah menghinakan mereka, dan Allah telah menguasakan RosulNya terhadap mereka hingga di antara mereka ada yang terbunuh dan ada yang ditawan bahkan ada juga yang terusir, dan terusirlah orang yang mengusir, ”dan pada Hari Kiamat mereka dikembalikan kepada siksa yang sangat berat, ” yaitu yang paling besar, “dan Allah tidak lengah dari apa yang kamu perbuat.” Kemudian Allah ta’ala mengabarkan tentang sebab yang mewajibkan mereka untuk beriman kepada sebagian kitab dan kafir terhadap sebagian yang lain seraya berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { سفك الدماء } safku ad-dimaa’ : menumpahkan darah dengan membunuh atau melukai. Makna ayat : Dalam ayat 84 Allah Ta’ala mengingatkan mereka dengan perjanjian khusus yang diambil atas mereka dalam Taurat, yaitu orang Israel tidak boleh membunuh orang Israel lainnya, juga tidak boleh mengusir mereka dari negerinya secara semena-mena. Jika ada orang Israel yang tertawan maka wajib untuk dibebaskan dengan segala cara dan tidak boleh ditinggalkan sebagai tawanan musuh begitu saja. Allah Ta’ala membuat perjanjian yang kuat dan mereka menyetujuinya serta bersaksi untuk menepatinya. Pelajaran dari ayat : • Kewajiban bergaul dengan manusia menggunakan adab yang baik. • Umat Islam akan mendapatkan kehinaan dan kesengsaraan hidup di dunia dan adzab di akhirat apabila pilih-pilih dalam melaksanakan syariat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 84: Kemudian Allah menyebutkan tentang Bani israil pada hari dimana diambil atasa mereka kesepakatan yang tetap bahwasannya tidaklah mereka saling membunuh satu sama lain dan tidaklah mereka keluar satu sama lain dari negeri mereka, kemudian mereka menyelisihi kesepakatan ini dan menjadi saksi atas diri – diri mereka dengan tetap pada penyelisihannya mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 84",
    "description": "Bila ayat-ayat yang lalu berkaitan dengan hal-hal yang harus mereka kerjakan, maka ayat ini mengingatkan isi perjanjian menyangkut hal-hal yang harus mereka tinggalkan. Ayat ini memerintahkan lagi; dan ingatlah juga ketika kami, melalui nabi musa, mengambil janji dari leluhur kamu, wahai bani israil, janganlah kamu menumpahkan darahmu, yakni mem bunuh orang lain tanpa hak, dan jangan pula kamu mengusir dirimu, saudara sebangsa mu, dari kam pung halamanmu, apalagi kampung halaman mereka sendiri. Selanjutnya, mereka juga diingatkan, kemudian kamu berikrar di depan umum akan memenuhinya, wahai yang mendengar ayat Al-Qur'an ini dan yang hidup pada masa nabi Muhammad, dan bersaksi bahwa perjanjian itu memang pernah dilakukan oleh nenek moyang kalian. Ayat ini mengingatkan dan menegaskan pentingnya persatuan dan kesatuan antarmanusia. Isyarat ini diperoleh dari penggunaan kata darahmu, dirimu sendiri dan kampung hala manmu, padahal yang dimaksud adalah orang lain. Ini karena dalam pandang-an Allah seorang manusia pada hakikatnya merupakan saudara seketu runan manusia yang lain. Dapat juga dikatakan bahwa jika seseorang berbuat buruk kepada orang lain maka pada hakikatnya ia berbuat buruk kepada diri sendiri, seperti dinyatakan dalam surah al-a'ujura't/49: 11. Kemudian kamu, wahai bani israil, membunuh dirimu, yakni sesamamu, tanpa menghiraukan perjanjian Allah tadi, dan mengusir segolongan dari saudara-saudara kamu sesama manusia dari kampung halamannya. Kamu memaksakan diri saling membantu dengan kelompok-kelompok kamu dalam menghadapi mereka dalam kejahatan, yakni dengan membuat dosa, baik dalam bentuk ucapan maupun perbuatan, dan permusuhan, yakni agresi yang melampaui batas. Itulah si kapmu terhadap mereka. Dan jika mereka yang kamu usir itu datang kepadamu sebagai tawanan, maka kamu tebus mereka dengan berbagai cara, padahal kamu dilarang mengusir me reka. Apakah kamu beriman kepada sebagian kitab, yakni percaya dan mengamalkan sebagian kandungan taurat dengan menebus mereka, dan ingkar kepada sebagian yang lain sehingga kamu mengusir mereka' maka tidak ada balasan yang pantas bagi orang yang berbuat demikian di antara kamu selain kenistaan dalam kehidupan dunia walau kamu menduga dan berusaha memperoleh kemuliaan. Dan pada hari kiamat mereka dikembalikan dan dibangkitkan setelah kematian kepada azab yang paling berat. Allah mengetahui motif perbuatan kamu, dan Allah tidak lengah terhadap apa yang kamu kerjakan. Oleh karena itu, dia akan memberi balasan yang setimpal kepada kamu. Ayat ini turun berkaitan dengan peristiwa yang terjadi di madinah sebelum rasulullah diutus. Ada tiga suku yahudi di madinah, yaitu bani qainuqa', bani naa'ir dan bani qurai dhah. Ketiganya terlibat dalam perang saudara antara kabilah aus dan khazraj; penduduk asli madinah. Bani qainuqa' dan bani naa'ir memihak kabilah khazraj, sedangkan bani qurai dhah memihak suku aus. Seringkali terjadi peperangan di antara mereka, bahkan di antara sesama yahudi pun mereka saling menyerang dan membunuh. Mereka tahu bahwa hal itu melanggar perjanjian dengan Allah, namun mereka berdalih bahwa hal itu merupakan bagian dari ketaatan terhadap isi kitab suci."
  }
]