[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kemudian kalian wahai sekalian,membunuh sebagian orang dari Kalian sebagian yang lain, dan mengusir sebagian orang kalian kepada sebagian lainnya dari kampung halaman mereka, dan tiap-tiap kelompok dari kalian memperkuat diri untuk menyerang saudara-saudaranya dengan meminta pertolongan musuh dengan diliputi tindakan melampaui batas dan rasa permusuhan. Dan jika mereka datang kepada kalian dalam kodisi tertawan di tangan musuh, maka kalian berusaha membebaskan mereka dari tawanan dengan membayar tebusan. Padahal telah diharamkan kepada kalian tindakan mengusir mereka itu dari kampung halaman mereka. Alangkah buruk perbuatan yang kalian lakukan ketika kalian mengimani sebagian hukum Kitab Taurat dan mengingkari sebagian hukum lainnya! Maka tidak ada balasan bagi orang-orang yang melakukan yang demikian itu dari kalian selain kehinaan dan terbongkarnya keburukan mereka di dunia. Dan pada hari kiamat Allah mengembalikan mereka kepada siksaan yang paling buruk di neraka. Dan Allah tidak lengah terhadap apa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Kemudian kalian melanggar perjanjian itu, karena sebagian dari kalian membunuh sebagian yang lain dan mengusir mereka dari tempat tinggal mereka secara kejam dan semena-mena dengan meminta bantuan musuh. Dan ketika mereka datang kepada kalian sebagai tawanan perang di tangan musuh, kalian berusaha membayar uang tebusan untuk membebaskan mereka, padahal sesungguhnya kalian diharamkan mengusir mereka dari tempat tinggal mereka. Jadi, bagaimana mungkin kalian mempercayai sebagian isi kitab Taurat, yakni yang menunjukkan keharusan menebus tawanan perang, dan mengingkari sebagian isinya, yakni yang menunjukkan keharusan melindungi darah (nyawa) dan larangan mengusir sesama dari tempat tinggalnya? Siapapun di antara kalian yang melakukan hal itu, tidak ada balasan baginya selain kehinaan dan kenistaan selama hidup di dunia, sedangkan di akhirat mereka akan dikembalikan kepada azab yang paling berat. Allah tidak pernah lalai terhadap apa yang kalian perbuat. Dia senantiasa mengawasi dan akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Kemudian kalian Hai orang-orang Yahudi yang ada pada zaman Nabi Muhammad, melanggar perjanjian itu dengan saling membunuh dan mengusir, serta saling bantu membantu dalam hal itu dengan orang lain dengan penuh kezaliman. Namun apabila ada dari mereka yang tertawan oleh kalian, dan hendak menebus dirinya dengan sejumlah harta, kalian menyetujuinya dengan alasan bahwa itu adalah hukum yang terdapat dalam Taurat. Mengapa kalian membenarkan sebagian isi Taurat dan mendustakan sebagian lainnya? Betapa buruk perbuatan itu; tidak ada balasan bagi kalian yang melakukan hal itu melainkan kehinaan dan kerendahan di dunia, adapun di hari kiamat mereka akan mendapat azab yang pedih. Dan Allah tidaklah lalai terhadap kelakuan dan kejahatan kalian, dan Allah akan membuat perhitungan atas hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. ثُمَّ أَنْتُمْ هَٰؤُلَاءِ (Kemudian kamu (Bani Israil)) Yakni kalian yang ada pada zaman Nabi Muhammad Shallallahu ‘Alaihi Wasallam melanggar apa yang ada pada Taurat kemudian kalian saling membunuh dan saling mengusir dari negeri dan tempat tinggal kalian. تَظَاهَرُونَ عَلَيْهِمْ بِالْإِثْمِ وَالْعُدْوَانِ (kamu bantu membantu terhadap mereka dengan membuat dosa dan permusuhan) Yakni saling membantu tanpa sebab yang dibolehkan وَإِنْ يَأْتُوكُمْ أُسَارَىٰ تُفَادُوهُمْ (jika mereka datang kepadamu sebagai tawanan, kamu tebus mereka) Yakni apabila salah satu dari kalian ditawan kemudian orang yang menawan itu datang untuk meminta harta tebusan maka kalian memberikan tebusan itu sebagai bentuk keimanan dengan apa yang ada pada taurat. أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ (Apakah kamu beriman kepada sebahagian Al Kitab (Taurat) dan ingkar terhadap sebahagian yang lain?) Yakni apabila ada pertumpahan darah diantara Bani ‘Aus dan Bani Khazraj dari kota Yastrib, maka Bani Qainuqa’ (kabilah Yahudi) keluar membantu Bani Khazraj sedangkan Bani Nadlir dan Bani Quraidhah (kabilah Yahudi) keluar membantu Bani ‘Aus, kemudian kedua kelompok itu berperang bersama setiap sekutu mereka sehingga mereka saling menumpahkan darah. Dan apabila peperangan telah berhenti mereka saling menebus tawanan mereka sebagai bentuk keimanan dengan apa yang ada pada taurat. Sehingga maksud dari potongan ayat ini adalah: apakah kalian saling menebus tawanan sebagai bentuk keimanan dengan apa yang ada pada taurat, sedangkan kalian keluar untuk saling berperang padahal itu adalah kekufuran dengan apa yang ada dalam taurat. فَمَا جَزَاءُ مَنْ يَفْعَلُ ذَٰلِكَ مِنْكُمْ إِلَّا خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا (Tiadalah balasan bagi orang yang berbuat demikian daripadamu, melainkan kenistaan dalam kehidupan dunia) Yakni siksaan yang Allah berikan untuk menghinakan mereka sebelum mereka mati. وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَىٰ أَشَدِّ الْعَذَابِ (dan pada hari kiamat mereka dikembalikan kepada siksa yang sangat berat) Yakni sebagai balasan atas perbuatan mereka mempermainkan ayat-ayat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kemudian kalian para kaum Yahudi yang menyaksikan dan hidup sezaman dengan Nabi Muhammad SAW justru mengingkari janji yang telah kami ambil atas kalian di dalam Taurat. Kalian justru membunuh sesama kalian, membantu kejahatan orang-orang musyrik. Kalian membantu menghadapi mereka dan justru mengusir mereka dari kampung halamannya. Tanpa dasar apapun, kalian menghalalkann itu semua, sedang kalian melakukannya dengan dasar maksiat dan kedzaliman. Adapun jika musuh kalian menawan kelompok kalian, dan meminta tebusan, kalian lantas menebusnya dengan keimanan kepada isi Taurat. Artinya, kalian tidak mengamalkan isi Taurat kecuali ketika sebagai tebusan tawanan semata. Padahal kalian tahu, bahwa mengusir mereka dari kampung halaman itu dilarang. Ini semua adalah kecaman/celaan terhadap pembangkangan mereka. Karena penawanan, adalah akibat pengusiran dari kampung halaman, lantas bagaimana bisa kalian melakukan sesuatu, namun di sisi kalian juga menarik apa yang menjadi akibat dari perbuatan kalian itu? Bagaimana bisa, di satu sisi kalian mengimani perintah Turat untuk menebus saudara kalian, lalu di sisi lain kalian sendiri mengingkari isi Taurat dengan membunuh dan mengusir mereka dari kampung halamannya? Ayat ini turun disebabkan perselisihan antara suku Qoinaqo’ yang bersekutu dengan Khazraj, dengan suku Bani Nadhir yang bersekutu dengan suku Quraidhoh dan Aus. Mereka membebaskan sesama Yahudi yang sebelumnya mereka usir dan perangi sendiri. Akibat dari perbuatan mereka ini adalah kehinaan dan kesesatan di dunia. Adapun di akhirat, azab yang pedih akan mereka terima atas perbuatan mereka bermain-main dengan ayat Allah. Allah Maha Mengetahui dan Maha Memberi Balasan apa saja yang kalian lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian, kalian membunuh diri kalian} membunuh satu sama lain {dan mengusir segolongan dari kalian dari kampung halamannya. Kalian saling membantu mereka} kalian saling membantu mereka dalam pertengkaran {dalam perbuatan dosa dan permusuhan} dalam kemaksiatan dan kezaliman {Jika mereka datang kepada kalian sebagai tawanan, kalian tebus mereka} kalian membebaskan mereka dari tawanan itu menggunakan harta benda atau hal lain {padahal kalian dilarang mengusir mereka. Apakah kalian beriman pada sebagian Kitab (Taurat) dan mengingkari sebagian lainnya. Maka tidak ada balasan (yang pantas) bagi orang yang berbuat demikian di antara kalian selain kenistaan} kerendahan dan kehinaan {di kehidupan dunia dan pada hari Kiamat mereka akan dikembalikan kepada azab yang paling berat. Allah tidak lengah terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Perbuatan yang disebutkan dalam ayat itu adalah sebuah perbuatan orang-orang yang ada pada zaman turunnya wahyu di Madinah. Hal itu karena suku Aus dan Khazraj –yang mana mereka itu adalah kaum Anshar- sebelum diutusnya Nabi sholallohu 'alaihi wasallam adalah kaum musyrikin, dan mereka dahulu saling berperang sebagaimana kebiasaan kaum jahiliyah. Lalu datang kepada mereka tiga kelompok dari kelompok-kelompok kaum Yahudi, yaitu Bani Quraizhah, Bani Nadhir, dan Bani Qainuqa, ’ dan setiap dari kelompok itu bergabung bersama salah satu kelompok penduduk Madinah. Kondisi penduduk Madinah tersebut bila saling berperang, maka orang-orang Yahudi itu mendukung sekutunya untuk memerangi kelompok yang dibantu oleh Yahudi yang lain, yang akhirnya orang Yahudi membunuh Yahudi lainnya dan dia mengusirnya dari kampungnya bila terjadi kekalahan ataupun perampasan. Kemudian bila peperangan berhenti, dan diantara kedua belah pihak memiliki tawanan-tawanan, maka sebagian mereka menebus sebagian yang lain. Ketiga perkara itu telah diwajibkan atas mereka, diwajibkan atas mereka agar tidak menumpahkan darah sebagian mereka atas sebagian lainnya, dan sebagian mereka tidak mengusir sebagian lainnya, lalu apabila mereka mendapatkan tawanan diantara mereka, maka wajib atas mereka untuk menebusnya. Namun mereka mengamalkan yang terakhir ini dan tidak mengamalkan dua hal yang sebelumnya, lalu Allah mengingkari perbuatan mereka seraya Allah berfirman, “Apakah kamu beriman kepada sebagian al-Kitab (Taurat)” yaitu penebusan tawanan, “dan ingkar terhadap sebagian yang lain?” yaitu pembunuhan dan pengusiran. Ayat ini adalah dalil bahwasanya keimanan itu menuntut pelaksanaan perintah dan menjauhi larangan, dan bahwasanya hal-hal yang diperintahkan itu adalah di antara keimanan. Allah berfirman, “Tiadalah balasan bagi orang yang berbuat demikian darimu, melainkan kenistaan dalam kehidupan dunia.” Hal itu benar-benar telah terjadi, di mana Allah telah menghinakan mereka, dan Allah telah menguasakan RosulNya terhadap mereka hingga di antara mereka ada yang terbunuh dan ada yang ditawan bahkan ada juga yang terusir, dan terusirlah orang yang mengusir, ”dan pada Hari Kiamat mereka dikembalikan kepada siksa yang sangat berat, ” yaitu yang paling besar, “dan Allah tidak lengah dari apa yang kamu perbuat.” Kemudian Allah ta’ala mengabarkan tentang sebab yang mewajibkan mereka untuk beriman kepada sebagian kitab dan kafir terhadap sebagian yang lain seraya berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { تَظَٰهَرُونَ } tadzaaharuuna : bisa dibaca juga tadz-dzaaharuun dengan tasydid, makna bacaan tadzaaharuun adalah kalian saling tolong menolong { بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ } bil itsmi wal ‘udwaan : al-itsmu maknanya adalah suatu madharat yang berkonsekuensi mendapatkan hukuman, sedangkan al-‘udwaan artinya kezhaliman. { أُسَٰرَىٰ } usaaraa : bentuk jamak dari asiir yang berarti tawanan perang. { الخزي } al-Khizyu : Kerendahan dan kehinaan. Makna ayat : Pada ayat 85 Allah Ta’ala mencela mereka karena tidak menepati perjanjian yang telah dibuat sebelumnya, yaitu orang Yahudi membunuh orang Yahudi dan mengusir dari negerinya secara paksa dan semena-mena. Pada waktu yang sama juga jika ada orang Yahudi yang menjadi tawanan musuh mereka menebusnya dengan segala cara. Allah Ta’ala mencela perbuatan itu yang berarti meninggalkan perbuatan yang wajib dan melakukan hal lain mengikuti hawa nafsunya sendiri. Mereka seperti orang yang beriman kepada sebagian dari al-Kitab dan mengingkari sebagian lainnya. Dari sinilah Allah mengancam mereka dengan kehinaan dan kesengsaraan hidup di dunia dan adzab di akhirat. Pelajaran dari ayat : Kufurnya orang yang pilih-pilih dalam melaksanakan hukum syariat, ia hanya mau melakukan yang sesuai dengan manfaat dirinya dan hawa nafsunya, dan tidak mau melakukan yang tidak sesuai hawa nafsunya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 85: Kemudian Allah menyampaikan kepada bani israil yang ada pada zaman nabi ﷺ ; dimana Allah mengabarkan bahwasannya mereka menyelisihi perjanjian yang telah mereka sepakati dengannya, sesungguhnya saat ini mereka membunu satu sama lain; dan mereka keluar satu sama lain dari negeri mereka, dan ini adalah perkara yang nampak dari golongan – golongan yahudi dan mereka adalah: Bani Nadhir, Bani Quraizah, Bani Qainaqa, dan begitu juga dengan sebelum diutusnya nabi ﷺ ; dimana sesungguhnya mereka ketika di madinah di dapati Suku Aus dan Khazraq saling membunuh; Maka seluruh dari golongan yahudi saling menyelisihi kelompok dari Madinah, dan mereka jika saling membunuh maka akan nampak setiap golongan dari yahudi yang meminta pertolongan dan ahli Madinah dari urusan dosa dan kedengkian. Yahudi saling membunuh dan keluar dari negeri – negeri mereka dan setelah terjadi peperangan mereka membagi – bagikan harta sebagian atas sebagian yang lain mereka, mereka mengetahui bahwasannya mereka keluar dari negeri – negeri mereka adalah keharaman. Kemudian Allah rendahkan dan ingkari dengan berkata mereka: Apakah kalian beriman dengan sebagian syariat Allah di Taurat dan ia adalah tebusan yang mudah dan mengikari sebagiannya, dan ia adalah: menumpahkan darah dan keluar dari negeri – negeri sebagian mereka. Ketahuilah wahai bani israil bahwasannya hukuman bagi yang menyelisihi perintah – perintah Allah maka sesungguhnya mereka akan mendapatkan corengan dan aib dalam kehidupan dunia, dan hari kiamat akan lebih keras dan besar siksanya, dan tidaklah lalai dari amalan – amalan kalian sedikitpun, kalian akan dibalas dengan apa yang telah kalian kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Padahal mereka sama-sama sebangsa. Sebagian hukum Taurat, yaitu menebus tawanan. Yaitu hukum yang melarang pembunuhan dan pengusiran. Hal itu pun terjadi, Allah Subhaanahu wa Ta'aala memberikan kemenangan kepada Rasul-Nya, sehingga di antara mereka ada yang terbunuh, ada yang tertawan dan ada yang terusir. Ayat ini berkenaan dengan orang-orang Yahudi di Madinah pada permulaan Hijrah. Yahudi Bani Quraizhah bersekutu dengan suku Aus, dan Yahudi Bani Nadhir bersekutu dengan orang-orang Khazraj. Antara suku Aus dan suku Khazraj sebelum Islam biasa terjadi peperangan. Ketika orang-orang Yahudi menempati Madinah, di mana mereka terdiri dari tiga suku, yaitu: Bani Quraizhah, Bani Nadhir dan Bani Qainuqa'. Masing-masing mereka bersekutu dengan suku Aus atau Khazraj. Ketika suku Aus dan Khazraj berperang, maka para sekutunya yang terdiri dari orang-orang Yahudi ikut berperang. Bani Quraizhah membantu suku Aus dan Bani Nadhir membantu suku Khazraj. sampai antara kedua suku Yahudi itupun terjadi peperangan dan tawan menawan, karena membantu sekutunya. Tetapi ketika ada orang-orang Yahudi yang tertawan, maka kedua suku Yahudi itu bersepakat untuk menebusnya, meskipun awalnya mereka saling berperang. Di dalam ayat ini terdapat dalil yang tegas bahwa amal bagian dari iman, dan iman itu menghendaki untuk mengerjakan perintah dan menjauhi larangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 85",
    "description": "Kemudian kamu, wahai bani israil, membunuh dirimu, yakni sesamamu, tanpa menghiraukan perjanjian Allah tadi, dan mengusir segolongan dari saudara-saudara kamu sesama manusia dari kampung halamannya. Kamu memaksakan diri saling membantu dengan kelompok-kelompok kamu dalam menghadapi mereka dalam kejahatan, yakni dengan membuat dosa, baik dalam bentuk ucapan maupun perbuatan, dan permusuhan, yakni agresi yang melampaui batas. Itulah si kapmu terhadap mereka. Dan jika mereka yang kamu usir itu datang kepadamu sebagai tawanan, maka kamu tebus mereka dengan berbagai cara, padahal kamu dilarang mengusir me reka. Apakah kamu beriman kepada sebagian kitab, yakni percaya dan mengamalkan sebagian kandungan taurat dengan menebus mereka, dan ingkar kepada sebagian yang lain sehingga kamu mengusir mereka' maka tidak ada balasan yang pantas bagi orang yang berbuat demikian di antara kamu selain kenistaan dalam kehidupan dunia walau kamu menduga dan berusaha memperoleh kemuliaan. Dan pada hari kiamat mereka dikembalikan dan dibangkitkan setelah kematian kepada azab yang paling berat. Allah mengetahui motif perbuatan kamu, dan Allah tidak lengah terhadap apa yang kamu kerjakan. Oleh karena itu, dia akan memberi balasan yang setimpal kepada kamu. Ayat ini turun berkaitan dengan peristiwa yang terjadi di madinah sebelum rasulullah diutus. Ada tiga suku yahudi di madinah, yaitu bani qainuqa', bani naa'ir dan bani qurai dhah. Ketiganya terlibat dalam perang saudara antara kabilah aus dan khazraj; penduduk asli madinah. Bani qainuqa' dan bani naa'ir memihak kabilah khazraj, sedangkan bani qurai dhah memihak suku aus. Seringkali terjadi peperangan di antara mereka, bahkan di antara sesama yahudi pun mereka saling menyerang dan membunuh. Mereka tahu bahwa hal itu melanggar perjanjian dengan Allah, namun mereka berdalih bahwa hal itu merupakan bagian dari ketaatan terhadap isi kitab suci. Mereka melanggar perjanjian, memutarbalikkan ayat-ayat Allah, mengimani sebagian isi kitab suci dan mengingkari sebagian lainnya karena mereka itulah orang-orang yang membeli kehidupan yang fana di dunia dengan kehidupan yang kekal di akhirat, yakni mereka teperdaya oleh gemerlap duniawi serta kesenangan hidup sementara, dan berusaha dengan berba gai cara, meskipun dengan melanggar norma, untuk memilikinya. Siksa yang mere ka dapat kan di dunia tidak berarti akan meringankan azab mereka di akhirat. Sama sekali tidak! maka tidak akan diringankan azabnya, karena siksa akhirat tidak dapat diringankan, dan mereka tidak akan ditolong oleh siapa pun, termasuk oleh diri mereka sendiri."
  }
]