[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang lebih mengutamakan kehidupan dunia daripada kehidupan akhirat. Marca tidak akan diringankan siksa dari mereka, dan mereka tidak mempunyai penolong yang dapat menolong mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Mereka itulah orang-orang yang menukar kebahagiaan hidup di akhirat dengan kesenangan hidup di dunia, karena mereka lebih mementingkan kehidupan yang sementara dibanding kehidupan yang kekal. Dan ketika itu mereka tidak memiliki penolong yang bisa menolong mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Orang-orang Yahudi yang jauh dari kebenaran yang lebih memilih kehidupan dunia yang fana daripada kenikmatan akhirat yang kekal tidak akan dapat terbebas dari azab neraka jahannam, dan mereka tidak akan memiliki penolong yang dapat menolong mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ (Itulah orang-orang yang membeli kehidupan dunia dengan (kehidupan) akhirat) Yakni lebih mencintai dunia yang sedikit daripada akhirat yang begitu banyak. فَلَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنْصَرُونَ (maka tidak akan diringankan siksa mereka dan mereka tidak akan ditolong) Yakni tidak mendapatkan seorangpun yang menolong dan menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Merekalah kaum Yahudi yang lebih mencintai dunia yang sedikit dengan mengorbankan akhirat yang banyak. Mereka menjual nikmat akhirat yang kekal dengan permainan dunia yang fana. Maka dari itu, azab bagi mereka pada hari kiamat tidak akan diringankan, dan tidak ada satupun yang bisa menahan azab mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang membeli} menukar {kehidupan dunia dengan kehidupan akhirat. Maka tidak akan diringankan azab mereka dan mereka itu tidak akan ditolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “Itulah orang-orang yang membeli kehidupan dunia dengan (kehidupan) akhirat. Mereka mengira bahwasanya mereka itu bila tidak membantu sekutu-sekutu mereka, niscaya mereka akan mendapatkan aib yang besar, maka mereka lebih memilih neraka daripada aib semata. Oleh karena itu Allah berfirman, “Maka tidak akan diringankan siksa mereka, ” bahkan dia kekal dalam kerasnya siksaan dan mereka sama sekali tidak mempunyai waktu istirahat, “dan mereka tidak akan ditolong, ” maksudnya tidak ada yang akan menjauhkan hal-hal yang tidak disukai dari mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Pada ayat 86 Allah Ta’ala mengabarkan bahwa mereka orang-orang Yahudi dengan perbuatannya itu sama saja membeli kehidupan dunia dengan akhiratnya , maka balasan perbuatannya adalah adzab akhirat yang tidak ada keringanan maupun penolong bagi mereka. Pelajaran dari ayat : • Kufurnya orang yang tidak mau menegakkan agama Allah karena berpaling dan tidak mempedulikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 86: Kemudian Allah mengabarkan bahwasannya mereka yang kafir dari bani israil dan selainnya dimana mereka lebih menjumpai kehidupan dunia atas akhirat maka mereka tidakan akan takut dengan azab, dan tidaklah mereka akan mendapatkan pertolongan yang menolong mereka dari azab Allah di hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengedepankan dunia di atas akhirat. Inilah sebab mereka memperoleh kenistaan dan kehinaan serta azab pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 86",
    "description": "Mereka melanggar perjanjian, memutarbalikkan ayat-ayat Allah, mengimani sebagian isi kitab suci dan mengingkari sebagian lainnya karena mereka itulah orang-orang yang membeli kehidupan yang fana di dunia dengan kehidupan yang kekal di akhirat, yakni mereka teperdaya oleh gemerlap duniawi serta kesenangan hidup sementara, dan berusaha dengan berba gai cara, meskipun dengan melanggar norma, untuk memilikinya. Siksa yang mere ka dapat kan di dunia tidak berarti akan meringankan azab mereka di akhirat. Sama sekali tidak! maka tidak akan diringankan azabnya, karena siksa akhirat tidak dapat diringankan, dan mereka tidak akan ditolong oleh siapa pun, termasuk oleh diri mereka sendiri. Berikut ini masih merupakan uraian tentang pelanggaran-pelanggaran bani israil. Dan sungguh, kami telah memberikan kitab taurat kepada musa agar dengan membacanya, kamu selalu ingat kandungan perjanjian itu, namun kamu tetap saja melupakannya. Tidak saja menganugerahkan taurat, kami juga telah susulkan berturut-turut setelahnya, yakni sepeninggal nabi musa, dengan rasul-rasul yang silih berganti datang memperingatkan kamu dan memperbarui tuntunan agar selalu sesuai dengan perkembangan masyarakat seperti nabi daud, sulaiman, hingga yahya. Dan kami berikan kepada isa putra maryam penjelasan-penjelasan, yakni bukti-bukti kebenaran yang sangat jelas seperti kemampuannya'atas izin Allah'mengembalikan penglihatan orang buta, menyembuhkan berbagai penyakit, menghidupkan orang mati, dan mengungkap berita-berita gaib, serta kami perkuat dia dengan rohulkudus, yaitu malaikat jibril, yang datang dengan wahyu-wahyu ilahi berupa kitab injil. Karena sikap mereka terhadap para nabi dan rasul sangat tidak wajar, maka mereka dikecam dalam bentuk pertanyaan: mengapa setiap rasul yang datang kepadamu yang diutus Allah membawa sesuatu pelajaran yang tidak kamu inginkan, kamu menyombongkan diri dengan sangat angkuh, lalu sebagian kamu dustakan, seperti nabi isa dan nabi Muhammad, dan sebagian kamu bunuh, seperti nabi zakaria dan nabi yahya, dan sebagian yang lain hendak kalian bunuh, seperti nabi Muhammad' terbayang betapa licik orang-orang yahudi bani israil yang diceritakan sifat-sifatnya dalam ayat-ayat di atas. Banyak dalih yang mereka kemukakan, banyak juga kalimat bodoh yang mereka ucapkan. Dari situ dapat ditarik pelajaran bahwa kecerdasan akal seseorang tidak selalu menuntunnya kepada perilaku yang baik, terutama bila kecerdasan itu tidak disertai kemantapan iman."
  }
]