[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah memberikan Taurat kepada Musa, dan Kami mengikutkan sesudahnya dengan rasul-rasul lain dari Bani Israil, dan kami berikan kepada Isa putra Maryam mukjizat-mukjizat yang nyata, dan kami Kuatkan (kukuhkan) dia dengan malaikat Jibril Alaihissalam. Apakah tiap kali datang kepada kalian seorang rasul dengan membawa wahyu dari Allah yang tidak sejalan dengan hawa nafsu kalian, kalian bersikap sombong terhadapnya, dan kalian mendustakan sebagian dan membunuh sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan sungguh Kami telah memberikan Taurat kepada Musa -'alaihissalām- dan disusul dengan rasul-rasul yang datang sesudahnya. Dan Kami telah memberikan kepada Isa putra Maryam bukti-bukti nyata yang menunjukkan kebenarannya, seperti menghidupkan orang mati dan menyembuhkan orang yang buta sejak lahir serta orang yang sakit lepra. Dan Kami juga memperkuatnya dengan malaikat Jibril -'alaihissalām-. Apakah setiap kali kalian -wahai Bani Israil- didatangi seorang utusan Allah dengan membawa ajaran yang tidak sejalan dengan hawa nafsu kalian, maka kalian selalu enggan menerima kebenaran itu dan bersikap angkuh kepada para Rasul Allah. Kalian mendustkan sebagian Rasul tersebut, dan sebagian lagi kalian bunuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Sungguh Kami telah memberikan Taurat kepada Musa, dan mengutus beberapa rasul setelahnya, serta memberi kepada Isa bin Maryam mukjizat-mukjizat yang menakjubkan, dan Kami perkuat dia dengan malaikat Jibril. Kemudian ALlah mengolok-olok orang-orang yang sombong dan para pembunuh dari golongan kaum Yahudi dengan berfirman: “Apakah setiap kali seorang Rasul dari Allah datang kepada kalian yang menyelisihi syahwat dan kemaksiatan kalian akan kalian tentang, sehingga sebagian mereka kalian dustakan dan sebagian lainnya kalian bunuh?” Dikeluarkan Ibnu Abi Hatim dengan sanad Tsabit dari Ibnu Abbas: (Ruhul Qudus adalah JIbril)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ (Dan sesungguhnya Kami telah mendatangkan Al Kitab kepada Musa) Al-kitab yakni taurat. وَقَفَّيْنَا مِنْ بَعْدِهِ بِالرُّسُلِ (dan Kami telah menyusulinya (berturut-turut) sesudah itu dengan rasul-rasul) Yakni Allah telah mengutus rasul-rasul setelah Nabi Musa sebagai penerusnya, mereka adalah nabi-nabi Bani Israil yang diutus setelah Nabi Musa seperti Nabi Samuel dan Asy’iya’. وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ (dan telah Kami berikan bukti-bukti kebenaran (mukjizat) kepada Isa putera Maryam) Yakni dalil-dalil yang disebutkan Allah di surat Ali Imran dan al-Maidah yang berupa ayat-ayat yang ditunjukkan Allah lewat tangan Nabi Isa seperti menghidupkan orang mati, membuat tanah liat berbentuk burung kemudian dia meniupnya sehingga menjadi burung sungguhan atas izin Allah, menyembuhkan orang bisu dan kusta, mengabarkan manusia hal-hal yang ghaib, mendatangkan hidangan dari langit, dan Injil yang diturunkan kepadanya. وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ (dan Kami memperkuatnya dengan Ruhul Qudus) Yakni ruh yang suci. Ada pendapat mengatakan yang dimaksud adalah Jibril yang dikirim Allah untuk membantunya. Pendapat lain mengatakan: yang dimaksud adalah ruh yang ditiupkan kedalam diri Isa untuk membantunya kerena didalamnya terdapat kekuatan. بِمَا لَا تَهْوَىٰ أَنْفُسُكُمُ (sesuatu (pelajaran) yang tidak sesuai dengan keinginanmu) Yakni yang tidak sesuai dan sejalan dengan hawa nafsu kalian. اسْتَكْبَرْتُمْ (lalu kamu menyombong) Yakni menyombongkan diri untuk menerima ayat-ayat itu sebagai bentuk merendahkan para rasul dan penolakan pengutusan mereka. فَفَرِيقًا كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ (maka beberapa orang (diantara mereka) kamu dustakan dan beberapa orang (yang lain) kamu bunuh) Dan yang termasuk didustakan adalah Nabi Isa dan Nabi Muhammad Shallallahu ‘Alaihi Wasallam, sedangkan yang termasuk orang-orang yang dibunuh adalah Nabi Yahya dan Nabi Zakariya (dan sebenarnya mereka juga ingin membunuh Nabi Isa dan Nabi Muhammad Shallallahu ‘Alaihi Wasallam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala Allah -جل جلاله- hendak memuliakan Nabi-Nya dengan penyaksian, nampak jejak dari racun-racun Yahudi, dan nampak pula rahasia dibalik firman Allah yang ditujukan kepada musuh-musuh Nya dari kalangan Yahudi : { أَفَكُلَّمَا جَاءَكُمْ رَسُولٌ بِمَا لَا تَهْوَىٰ أَنْفُسُكُمُ اسْتَكْبَرْتُمْ فَفَرِيقًا كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ } , dalam ayat disebutkan : { كَذَّبْتُمْ } yang datang dengan bentuk lampau yang berarti pendustaan mereka telah terjadi, kemudian setelahnya disebutkan : { تَقْتُلُونَ } dengan bentuk mustaqbal yang pada masa itu mereka sedang melakukannya dan akan terus mereka lakukan setelahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Kami telah mewahyukan Taurat kepada Musa, kemudian juga Kami sertakan sesudahnya nabi-nabi bagi Bani Israil. Kami berikan Isa ibn Maryam berbagai mu’jizat sebagai bukti kebenaran risalahnya, yang dijelaskan di dalam surat Ali Imran ayat 49. Diantara mu’jizat Nabi Isa adalah menghidupkan orang yang telah mati, menciptakan burung dengan izin Allah, mengobati kusta dan lepra dengan izin Allah, mengkhabarkan yang ghoib, menurunkan makanan dari langit, dan diturunkan Injil kepadanya. Lalu kami kuatkan dia dengan ruh kudus/suci yaitu Jibril. Akankah setiap kami utus rosul yang tidak sesuai dengan keinginan kalian, lantas kalian merespon mereka dengan penuh kesombongan. Ada yang kalian dustakan, seperti Isa dan Muhammad, namun juga ada yang sampai kalian bunuh seperti Zakaria dan Yahya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan} memberikan {kepada Musa Kitab} Taurat {dan Kami menyusulkan} Kami mengikutkan {setelahnya rasul-rasul. Kami juga telah menganugerahkan kepada Isa, putra Maryam, bukti-bukti kebenaran} petunjuk-petunjuk yang jelas {serta Kami teguhkan dia} Kami kuatkan dia {dengan Ruhul kudus} dengan malaikat Jibril AS {Mengapa setiap kali datang kepada kalian para rasul dengan (membawa) sesuatu (pelajaran) yang tidak diinginkan oleh diri kalian} tidak diminati oleh diri kalian {kalian malah menyombongkan diri. Lalu sebagiannya kalian dustakan dan sebagian liannya kalian bunuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah ta’ala memberikan anugerahNya atas Bani Israil yaitu dengan mengutus kepada mereka Nabi yang pernah berbicara langsung denganNya, yaitu Musa dan memberikan kepada beliau kitab Taurat, kemudian disusul setelahnya para nabi-nabi yang berhukum dengan kitab Taurat, hingga ditutuplah nabi bagi mereka dengan Nabi Isa bin Maryam, dan Allah memberikan kepadanya bukti-bukti kebenaran yang tidak seorangpun pernah diberi amanat (mukjizat) dengan semisalnya. “Dan kami memperkuatnya dengan Ruhul Qudus,” maksudnya Allah menguatkannya dengan Ruhul Qudus. Sebagian besar ahli tafsir mengatakan bahwa Ruhul Qudus itu adalah jibril, dan ada juga yang mengatakan bahwa itu adalah keimanan yang mana Allah menolong hambaNya dengannya. Kemudian dengan kenikmatan-kenikmatan yang tidak dapat diukur banyaknya ketika hadir kepada kalian (hai Bani Israil), “yang tidak sesuai dengan keinginanmu lalu kamu menyombong diri” dari keimanan kepada mereka, ‘” maka beberapa orang” diantara mereka “kamu dustakandan beberapa orang yang lain kamu bunuh, ” karena kalian mendahulukan hawa nafsu daripada petunjuk dan kalian lebih memilih dunia daripada akhirat. Ayat ini mengandung kecaman dan celaan yang Nampak jelas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { مُوسَى } Musa : Beliau Musa bin Imran, seorang nabi yang diutus kepada Bani Israil { ٱلۡكِتَٰبَ } al-Kitab : Taurat { قَفَّيۡنَا } qoffainaa : Kami utus mereka, sebagian berada di belakang yang lain. Yaitu satu persatu berurutan. { الرسل } ar-Rusul : Bentuk plural dari rasul, yaitu seorang lelaki dari kalangan Bani Adam diberikan wahyu berupa syariat dan diperintahkan untuk menyampaikannya. { ٱلۡبَيِّنَٰتِ } al-Bayyinaat : Mukjizat dan ayat-ayat Allah dalam kitab Injil. { رُوحِ ٱلۡقُدُسِ } ruuhul qudus : Jibril ‘alaihissalam Makna ayat : Masih saja ayat-ayat ini memberitakan tentang nikmat yang Allah berikan kepada Bani Israil, dan penyebutan aib-aib serta kesalahan mereka. Semoga dengan peringatan itu dapat membawa mereka untuk beriman dan mensyukuri nikmat, dan penyebutan aib-aib mereka dapat membawanya untuk memperbaiki diri dan bertaubat. Pada ayat 87 Allah Ta’ala menyebutkan nikmatNya dengan menurunkan Taurat kepada Nabi Musa ‘alaihissalam dan mengutus rasul-rasul setelahnya secara berurutan. Kemudian memberikan mukjizat dan bukti-bukti kepada Nabi Isa ‘alaihissalam serta menguatkannya dengan Jibril ‘alaihissalam. Walaupun begitu Bani Israil masih saja belum sadar, bahkan mereka membunuh para nabi dan mendustakan mereka. Maka Allah mencelanya dalam firmanNya : أَفَكُلَّمَا جَآءَكُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُكُمُ ٱسۡتَكۡبَرۡتُمۡ فَفَرِيقٗا كَذَّبۡتُمۡ وَفَرِيقٗا تَقۡتُلُونَ ٨٧ “Apakah setiap datang kepadamu seorang rasul membawa sesuatu (pelajaran) yang tidak sesuai dengan keinginanmu lalu kamu angkuh; maka beberapa orang (di antara mereka) kamu dustakan dan beberapa orang (yang lain) kamu bunuh?” Pelajaran dari ayat : • Kewajiban terhadap nikmat adalah mensyukurinya sedangkan kewajiban terhadap dosa adalah bertaubat darinya. • Buruknya menolak kebenaran karena tidak sesuai dengan hawa nafsunya. • Besarnya dosa pembunuhan dan mendustakan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 87: Kemudian Allah memberikan kepada bani israil yang bahwasannya Allah berikan Musa dengan Taurat dan Allah putus setelahnya rasul – rasul yang saling mengiktu satu sama lain, begitu juga Allah memberikan Isa bin Maryam mukjizat yang nyata; Sebagaimana menghidupkan orang yang telah mati dan menumbuhkan penyakit kusta serta Allah tiupkan ruhnya melalui jibril."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, banyak sekali para nabi yang berasal dari Bani Israil. Nabi terakhirnya dari kalangan Bani Israil adalah Nabi Isa putera Maryam 'alahis salam. Menurut Jumhur (mayoritas) mufassir, maksud Rohul Qudus adalah malaikat Jibril, namun ada yang mengatakan bahwa Rohul Qudus adalah keimanan yang dijadikan Allah untuk menguatkan hamba-hamba-Nya. Yakni tidak sesuai dengan hawa nafsu mereka. Mereka lebih mengedepankan hawa nafsu daripada petunjuk dan lebih mengedepankan dunia daripada akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 87",
    "description": "Berikut ini masih merupakan uraian tentang pelanggaran-pelanggaran bani israil. Dan sungguh, kami telah memberikan kitab taurat kepada musa agar dengan membacanya, kamu selalu ingat kandungan perjanjian itu, namun kamu tetap saja melupakannya. Tidak saja menganugerahkan taurat, kami juga telah susulkan berturut-turut setelahnya, yakni sepeninggal nabi musa, dengan rasul-rasul yang silih berganti datang memperingatkan kamu dan memperbarui tuntunan agar selalu sesuai dengan perkembangan masyarakat seperti nabi daud, sulaiman, hingga yahya. Dan kami berikan kepada isa putra maryam penjelasan-penjelasan, yakni bukti-bukti kebenaran yang sangat jelas seperti kemampuannya'atas izin Allah'mengembalikan penglihatan orang buta, menyembuhkan berbagai penyakit, menghidupkan orang mati, dan mengungkap berita-berita gaib, serta kami perkuat dia dengan rohulkudus, yaitu malaikat jibril, yang datang dengan wahyu-wahyu ilahi berupa kitab injil. Karena sikap mereka terhadap para nabi dan rasul sangat tidak wajar, maka mereka dikecam dalam bentuk pertanyaan: mengapa setiap rasul yang datang kepadamu yang diutus Allah membawa sesuatu pelajaran yang tidak kamu inginkan, kamu menyombongkan diri dengan sangat angkuh, lalu sebagian kamu dustakan, seperti nabi isa dan nabi Muhammad, dan sebagian kamu bunuh, seperti nabi zakaria dan nabi yahya, dan sebagian yang lain hendak kalian bunuh, seperti nabi Muhammad' terbayang betapa licik orang-orang yahudi bani israil yang diceritakan sifat-sifatnya dalam ayat-ayat di atas. Banyak dalih yang mereka kemukakan, banyak juga kalimat bodoh yang mereka ucapkan. Dari situ dapat ditarik pelajaran bahwa kecerdasan akal seseorang tidak selalu menuntunnya kepada perilaku yang baik, terutama bila kecerdasan itu tidak disertai kemantapan iman. Dan mereka berkata dalam rangka menolak risalah nabi Muhammad, hati kami tertu tup karena tidak dapat memahami apa yang engkau sampaikan atau karena hati kami sudah penuh dengan pengetahuan sehingga tidak lagi butuh bimbingan. Allah menegaskan, tidak! sebenarnya mereka bukannya tidak dapat memahami dan bukan pula sudah pandai, tetapi mereka berkata demikian karena kedurhakaan yang sudah mendarah daging dalam diri mereka, maka Allah telah melaknat mereka itu karena keingkaran mereka, tetapi'sekali lagi alqur'an tidak menyatakan mereka semua ingkar atau kafir'sedikit sekali mereka beriman."
  }
]