[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Bani Israil berkata kepada nabi Allah dan rasul Nya Muhammad Shallallahu Alaihi Wasallam: “hati kami tertutup, perkataanmu tidak bisa sampai kepadanya, dan perkaranya tidak seperti yang mereka klaim, akan tetapi hati mereka dilaknat, dan telah terkunci, dan mereka adalah orang-orang yang terusir dari rahmat Allah disebabkan oleh pengingkaran mereka , maka mereka tidak beriman kecuali dengan keimanan yang sedikit yang tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Alasan orang-orang Yahudi untuk tidak mau mengikuti Muhammad -ṣallallāhu 'alaihi wa sallam- ialah ucapan mereka, “Sesungguhnya hati kami tertutup, tidak bisa dimasuki oleh ucapanmu dan tidak bisa memahaminya.” Padahal keadaan yang sebenarnya tidak seperti pengakuan mereka, tetapi Allah telah menjauhkan mereka dari rahmat-Nya akibat kekufuran mereka, sehingga mereka tidak akan beriman dengan apa yang diturunkan Allah kecuali beberapa hal saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Ketika Rasulullah menyeru orang-orang Yahudi kepada Islam, mereka menolak dan mengatakan bahwa hati mereka tidak dapat memahami karena telah tertutup dan terkunci sehingga menghalangi mereka dari menerima seruannya. Maka Allah membantah perkataan mereka dengan berfirman bahwa Dia telah menjauhkan mereka dari rahmat-Nya akibat pendustaan mereka terhadap Rasulullah, sehingga tidak ada dari mereka yang beriman melainkan segelintir orang saja, atau mereka sedikit beriman kepada sebagian kitab saja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. غُلْفٌ ۚ (tertutup) (الغلف) bentuk jamak dari (الأغلف) yang berarti penutup yang mencegah sampainya arti dari sebuah ucapan. Mereka (orang-orang Yahudi) mengaku mereka tidak memahami perkataan Rasulullah. Mereka berkata demikian agar Rasulullah menyerah dalam menyampaikan dakwah kepada mereka. بَلْ لَعَنَهُمُ اللَّهُ بِكُفْرِهِمْ (Tetapi sebenarnya Allah telah mengutuk mereka karena keingkaran mereka) Arti kata (اللعن) /kutukan secara bahasa adalah pengusiran dan penjauhan; dan secara istilah adalah penjauhan mereka dari rahmat Allah disebabkan tidak segera beriman. Dan perngakuan mereka ini sebenarnya adalah karena kekufuran mereka dan bukan karena ketidakmampuan mereka untuk memahami perkataan Rasulullah. فَقَلِيلًا مَا يُؤْمِنُون (maka sedikit sekali mereka yang beriman) Allah mensifati mereka demikian karena apa yang telah diceritakan oleh Allah tentang mereka berupa kebebalan, kesombongan, dan keengganan mereka dalam menjawab dakwah para rasul, dan termasuk pula karena mereka beriman kepada sebagian al-kitab dan mengingkari sebagian yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang Yahudi berkata kepada Nabi SAW ketika mereka diajak memeluk agama Islam: “Hati kami telah tertutup dan terbelenggu dengan belenggu yang menghalangi kami untuk mengikuti ajakanmu.” Inilah bukti, bahwasannya kekafiran itu bersifat keras kepala dan sombong. Maka dari itu, sebab kekafiran dan keenggenan mereka untuk beriman, maka Allah menjauhkan mereka dari rahmat-Nya. Kadar iman mereka hanya sedikit, mereka hanya mengimani sebagian isi kitab saja, dan hanya sedikit dari mereka yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Hati kami tertutup”} tertutup oleh tabir-tabir yang tidak bisa ditembus oleh perkataanmu {Tidak! Allah telah melaknat mereka itu karena keingkaran mereka} Allah telah menjauhkan mereka dari rahmatNya akibat keingkaran mereka {tetapi sedikit sekali dari mereka yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Maksudnya, mereka mengemukakan alasan kenapa mereka tidak beriman ketika engkau berdakwah kepada mereka, wahai rosul, karena hati mereka tertutup atau di atasnya ada pelapis dan penutup hingga apa yang engkau bicarakan tidak mereka pahami, maksudnya, mereka –menurut dugaan mereka- memiliki alasan karena tidak tahu, akan tetapi hal ini adalah dusta belaka dari mereka. Oleh karena itu Allah ta’ala berfirman, “Tetapi sebenarnya Allah telah mengutuk mereka karena keingkaran mereka,” maksudnya bahwasanya mereka terusir dan terkutuk yang disebabkan oleh kekufuran mereka, dan sangat sedikit sekali di antara mereka yang beriman, atau keimanan mereka sangat sedikit sedangkan kekufuran mereka sangatlah banyak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { غُلۡفُ } ghulf : Dalam hatinya terdapat penutup yang menghalangi untuk memahami apa yang kalian dakwahkan kepada kami, atau berarti bahwa hatinya sudah seperti wadah ilmu, sehingga kami tidak perlu belajar lagi darimu. Makna kata : Pada ayat 88 Allah Ta’ala mengingatkan tentang kesombongan mereka karena merasa memiliki ilmu dan tidak membutuhkan dari yang lain. Akan tetapi Allah membantah pengakuan mereka dan menetapkan alasannya yaitu Allah melaknat mereka karena kekufurannya, sehingga mereka tidak mau beriman. Pelajaran dari ayat : • Buruknya akibat menyombongkan ilmu dan merasa tidak butuh terhadap tambahan ilmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 88: Kemudian berkata bani israil kepada rasul ﷺ sebagai orang – orang yang menginginkan udzur dengan udzur yang bathil dan bohong: Wahai Muhammad hati – hati kami telah terkunci dengan kegelapan maka tidaklah kami memahami apa yang engkau katakan, mereka menyangka bahwasannya klaim ini adalah udzur bagi mereka untuk menerima dakwah dan keimanan kepada Allah akan tetapi Allah melaknat mereka yaitu dengan mencabut rohmat dari mereka karena sebab penolakan mereka dan kekufuran mereka serat kesesatan mereka. Dan ini merupakan laknat yang karena sebab, yang bahwasannya tidak beriman dari mereka kecuali sedikit; sebagaimana Abdullah bin Salam, Ubay bin Ka’ab, dan Wahhab bin Munabbih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata-kata ini ditujukan kepada Nabi Muhammad shallallahu 'alaihi wa sallam, di mana nasehat dan pelajaran yang Beliau sampaikan tidak masuk ke dalam hati mereka. Kata-kata mereka ini dijawab oleh Allah dengan ayat di atas, yakni sebenarnya hati mereka telah dikutuk dan dicap seperti itu. Mereka telah dijauhkan dari rahmat Allah, oleh karenanya tidak ada yang mereka imani kecuali sedikit, namun hal itu tidaklah bermanfa'at bagi mereka. Bisa juga maksud \"fa qaliilam maa yu'minuun\" adalah bahwa sedikit sekali di antara mereka yang mau beriman, yakni kebanyakan mereka kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 88",
    "description": "Dan mereka berkata dalam rangka menolak risalah nabi Muhammad, hati kami tertu tup karena tidak dapat memahami apa yang engkau sampaikan atau karena hati kami sudah penuh dengan pengetahuan sehingga tidak lagi butuh bimbingan. Allah menegaskan, tidak! sebenarnya mereka bukannya tidak dapat memahami dan bukan pula sudah pandai, tetapi mereka berkata demikian karena kedurhakaan yang sudah mendarah daging dalam diri mereka, maka Allah telah melaknat mereka itu karena keingkaran mereka, tetapi'sekali lagi alqur'an tidak menyatakan mereka semua ingkar atau kafir'sedikit sekali mereka beriman. Selain membuktikan kebohongan ucapan mereka sebelum ini, ayat di atas juga menunjuk kan keburukan lain bani israil, yaitu menolak Al-Qur'an. Penolakan tersebut sungguh aneh dan tidak berdasar sama sekali. Dan setelah sampai kepada mereka kitab Al-Qur'an dari sisi Allah yang kandungannya membenarkan apa yang ada pada mereka, menyangkut kedatangan seorang nabi yang sifat-sifatnya sudah mereka ketahui, mereka tetap mengingkari nabi itu, sedangkan sebelumnya, yakni sebelum kedatangan nabi itu, mereka memohon kemenangan mereka atas orang-orang kafir yang menjadi musuh-Musuh mereka. Tetapi ternyata setelah datang kepada mereka apa yang telah mereka ketahui itu, yakni menyangkut kitab suci Al-Qur'an, nabi Muhammad, dan sifatsifat beliau, mereka lalu mengingkarinya. Maka laknat Allah bagi orangorang yang ingkar."
  }
]