[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Alquran datang kepada mereka dari sisi Allah yang membenarkan apa yang ada sama mereka dari kitab Taurot, mereka menolaknya dan mengingkari kenabian Muhammad Shallallahu Alaihi Wasallam, Padahal sebelum diangkat menjadi nabi mereka itu dulu meminta pertolongan kepadanya untuk melawan kaum musyrikin Arab. Dan mereka berkata,”telah dekat waktu kebangkitan nabi akhir zaman, dan kami akan mengikutinya dan memerangi kalian bersamanya. Maka ketika telah datang utusan Allah kepada mereka yang mereka ketahui sifat-sifat dan kebenarannya, mereka mengingkarinya dan mendustakannya. Maka laknat Allah bagi siapa saja yang kafir kepada nabi dan rasul Allah Muhammad Shollu Alaihi Wasallam, dan kepada kitab-Nya yang diwahyukan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Tatkala Al-Qur`ān Al-Karim yang berasal dari sisi Allah datang kepada mereka dengan ajaran yang selaras dengan apa yang ada di dalam Taurat dan Injil mengenai prinsip-prinsip umum yang benar, sedangkan sebelum turunnya Al-Qur`ān itu mereka mengatakan, “Kita akan menang melawan orang-orang musyrik ketika ada seorang Nabi yang diutus lalu kita beriman kepadanya dan mengikuti jejaknya,” tetapi ketika Al-Qur`ān benar-benar datang kepada mereka bersama dengan Muhammad -ṣallallāhu 'alaihi wa sallam- yang memiliki sifat-sifat yang sudah mereka kenali sebelumnya dan membawa kebenaran yang juga sudah mereka ketahui sebelumnya, ternyata mereka mengingkarinya. Maka kutukan Allah pun ditimpakan kepada orang-orang yang ingkar terhadap Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Ketika Rasulullah mendatangkan kepada mereka al-Qur’an dari Allah yang sesuai dengan kitab Taurat yang mereka miliki sebelum diubah -padahal sebelum Rasulullah diutus mereka memohon pertolongan darinya ketika melawan musuh-musuh mereka dari golongan kaum musyrikin- namun ketika Allah mengutus Rasulullah mereka mengingkari dan mendustakannya. Karena perbuatan ini, mereka layak untuk dijauhkan dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَلَمَّا جَاءَهُمْ كِتَابٌ (Dan setelah datang kepada mereka Al Quran) Yakni datang al-Qur’an kepada orang-orang Yahudi. مُصَدِّقٌ (membenarkan) Yakni al-Qur’an membenarkan apa yang ada pada mereka berupa taurat dan injil dan membenarkan isi dari keduanya dan tidak menyelisihinya. وَكَانُوا مِنْ قَبْلُ يَسْتَفْتِحُونَ (padahal sebelumnya mereka biasa memohon (kedatangan Nabi)) Yakni mereka sebelumnya memohon kepada Allah agar menolong mereka lewat nabi yang diutus di akhir zaman yang telah mereka dapatkan sifat-sifatnya di taurat. فَلَمَّا جَاءَهُمْ مَا عَرَفُوا (maka setelah datang kepada mereka apa yang telah mereka ketahui) Yakni telah datang Rasulullah yang telah mereka ketahui sifat-sifatnya كَفَرُوا بِهِ ۚ (mereka lalu ingkar kepadanya) Terdapat sebuah hadist yang dikeluarkan oleh Ibnu Ishaq dan yang lainnya dari orang-orang Anshar, mereka berkata: tidak ada orang yang lebih mengetahui tentang Rasulullah melebihi kita, karena kita tinggal bersama orang-orang Yahudi. Ketika itu mereka adalah ahli kitab sedangkan kita penyembah berhala. Dan ketika mereka mendapatkan sesuatu dari kita yang tidak mereka sukai mereka berkata: sungguh seorang nabi saat ini telah diutus, dan inilah saatnya kami menjadi pengikut mereka kemudian kami bersamanya akan membunuh kalian seperti kaum Aad dan Iram dibunuh. Namun ketika Rasulullah telah benar-benar diutus, kami-lah yang menjadi pengikutnya sedangkan mereka kafir kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Adapun ketika Alquran telah diturunkan kepada mereka, sebagai pembenaran terhadap yang telah diturunkan kepada mereka sebelumnya, yaitu Taurat dan Injil. Sedangkan sebelum Alquran diturunkan, mereka memohon pertolongan kepada Nabi yang diutus sebagai Nabi akhir zaman untuk melawan musuh. Nabi yang telah dijelaskan sifat-sifatnya di dalam Taurat. Akan tetapi ketika Nabi yang telah mereka ketahui ciri dan sifatnya datang kepada mereka, mereka ingkar dengan penuh kedengkian, dengan alasan bahwa Nabi SAW bukan berasal dari golongan mereka. Maka laknat Allah bagi mereka, yang berarti terputus dari rahmat-Nya. Adapun, sebab turunnya ayat ini: Diriwayatkan dari Ibnu Ishaq dan Ibnu Abi Hatim dari Ibnu Abbas, bahwa kaum Yahudi menang atas suku Aus dan Khazraj atas bantuan Muhammad SAW sebelum kenabian. Akan tetapi setelah Allah mengutus Muhammad SAW sebagai Rosul dari bangsa Arab, mereka mengingkarinya dan tidak konsisten dengan apa yang mereka katakan, sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setelah sampai kepada mereka Kitab} Al-Qur’an {dari sisi Allah yang membenarkan} menyelaraskan {apa yang ada pada mereka} apa yang ada dalam Taurat dan Injil {sedangkan sebelumnya } sebelum diutusnya nabi Muhammad SAW {mereka memohon kemenangan} mereka memohon kedatangan nabi Muhammad {atas orang-orang kafir} atas musuh-musuh mereka yaitu orang-orang musyrik {lalu ketika telah sampai kepada mereka apa yang telah mereka ketahui itu, mereka mengingkarinya. Maka laknat Allahlah terhadap orang-orang yang ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-90. Maksudnya, “dan setelah datang kepada mereka al-Qur’an” dari sisi Allah melalui sebaik-baik makhluk dan penutup para nabi, yang mengandung segala hal yang membenarkan Taurat yang ada pada mereka, dan sebenarnya mereka telah mengetahuinya, dan mereka telah yakin bahwasanya bila terjadi peperangan di antara mereka dengan kaum musyrikin pada masa jahiliyah, mereka meminta bantuan kepada Nabi ini, dan mereka mengancam kepada orang-orang musyrik itu akan munculnya Nabi tersebut, dan bahwasanya mereka akan memerangi kaum musyrikin bersamanya, namun ketika benar-benar telah datang kepada mereka kitab dan Nabi yang telah mereka ketahui tersebut, mereka malah kafir terhadapnya karena dengki dan zhalim, disebabkan Allah memberikan kemuliaanNya terhadap siapa yang dikehendakiNya dari hamba-hambaNya. Maka Allah melaknat mereka dan memurkai mereka dengan murka yang sangat besar, dan banyaknya pengingkaran mereka dan berturut-turutnya keraguan dan kesyirikan mereka. Di akhirat mereka mendapatkan azab yang menghinakan, maksudnya menyakitkan dan pedih, yaitu masuk neraka Jahim dan lenyapnya nikmat surga yang abadi, maka teramat buruklah kondisi mereka, dan teramat buruklah apa yang mereka ganti dan rubah dari keimanan kepada Allah, kitab-kitabNya dan Rosul-rosulNya, kepada pengingkaran kepada Allah, kitab-kitabNya dan Rosul-rosulNya, padahal mereka mengetahui dan meyakininya, sehingga dengan begitu azabnya lebih dahsyat lagi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { كِتَٰبٞ مِّنۡ عِندِ ٱللَّهِ } kitaabun min ‘indillah : al-Qur’anul kariim { يَسۡتَفۡتِحُونَ } yastaftihuuna : Meminta kemenangan. Makna ayat : Pada ayat 89 Allah Ta’ala menyebutkan kekufuran mereka terhadap al-Qur’an dan nabiNya. Padahal sebelum pengutusan nabi mereka sesumbar kepada orang-orang Arab bahwa sudah dekat zamannya akan keluar seorang nabi yang kami beriman kepadanya dan memerangi kalian bersama kami sehingga kami menang atas kalian. Akan tetapi setelah keluarnya nabi, mereka kufur terhadap nabi sehingga Allah melaknat mereka karena kekafirannya. Pelajaran dari ayat : • Celaan terhadap rasa dengki karena sama saja dengan kezhaliman, yang akibatnya adalah kerusakan dan terhalang dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 89: Allah mengabarkan bahwasannya bani israil ketika diturunkan Al- Qur’an kepada Muhammad ﷺ mereka membenarkan apa yang sesuai dengan taurat, dan mereka sebelum kerisalahan Muhammad ﷺ saling bahu–membahu dan saling menyombongkan diri, mereka mengancam orang – orang musyrik arab dengan mengeluarkan orang – orang musyrik tersebut dari negerinya, dan mereka akan saling memerangi orang – orang musyrik, akan tetapi setelah diutusnya Muhammad ﷺ mereka mengenal sifat dan kebenaran Muhammad ﷺ , sehingga mereka hasad kepada Muhammad dan marah; karena ia juga diutus dari kalangan yahudi, oleh karena itu Allah melaknat mereka; maka laknat Allah pada setiap yang kafir kepada Muhammad ﷺ dan dengan apa yang diturunkan dari Al-Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Ishaq berkata, \"Telah menceritakan kepadaku 'Ashim bin Umar bin Qatadah dari beberapa orang kaumnya, bahwa mereka berkata, \"Sesungguhnya di antara yang menyebabkan kami masuk Islam di samping karena rahmat Allah Ta'ala dan petunjuk-Nya adalah karena kami mendengar beberapa orang-orang Yahudi, sedangkan kami –ketika itu- sebagai orang-orang musyrik penyembah berhala, sedangkan mereka Ahli Kitab memiliki ilmu yang tidak kami miliki. Ketika itu, antara kami dengan mereka senantiasa ada masalah. Ketika kami berhasil menimpakan kepada mereka apa yang tidak mereka sukai, mereka berkata, \"Sesungguhnya telah dekat waktu diutusnya nabi, di mana kami akan membunuh kamu bersamanya dengan cara seperti yang menimpa kaum 'Aad dan Iram.\" Kami sering sekali mendengar hal itu dari mereka. Ketika Allah mengutus rasul-Nya, maka kami memenuhi seruan-Nya yang mengajak kami kepada Allah Ta'ala, dan kami mengetahui apa yang mereka janjikan itu, maka kami segera mendatanginya dan beriman kepadanya, sedangkan mereka malah kafir. Tentang kami dan mereka turunlah ayat ini.\" (Sirah Ibnu Hisyam, hadits ini hasan karena Ibnu Ishaq apabila menyebutkan secara tegas \"haddatsana\" (telah menceritakan kepada kami), maka haditsnya hasan sebagaimana disebutkan oleh Al Haafzih Adz Dzahabiy dalam Al Mizan). Yakni kitab Taurat, di sana diterangkan tentang akan datangnya seorang nabi dan disebutkan juga sifat-sifatnya. Baik ingkar kepada Nabi Muhammad shallallahu 'alaihi wa sallam maupun kepada kitab yang diturunkan kepadanya (Al Qur'an)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 89",
    "description": "Selain membuktikan kebohongan ucapan mereka sebelum ini, ayat di atas juga menunjuk kan keburukan lain bani israil, yaitu menolak Al-Qur'an. Penolakan tersebut sungguh aneh dan tidak berdasar sama sekali. Dan setelah sampai kepada mereka kitab Al-Qur'an dari sisi Allah yang kandungannya membenarkan apa yang ada pada mereka, menyangkut kedatangan seorang nabi yang sifat-sifatnya sudah mereka ketahui, mereka tetap mengingkari nabi itu, sedangkan sebelumnya, yakni sebelum kedatangan nabi itu, mereka memohon kemenangan mereka atas orang-orang kafir yang menjadi musuh-Musuh mereka. Tetapi ternyata setelah datang kepada mereka apa yang telah mereka ketahui itu, yakni menyangkut kitab suci Al-Qur'an, nabi Muhammad, dan sifatsifat beliau, mereka lalu mengingkarinya. Maka laknat Allah bagi orangorang yang ingkar. Mengecam perbuatan mereka yang disebutkan dalam ayat yang lalu, Allah berfirman, sangatlah buruk perbuatan mereka menjual dirinya, yaitu menukar kebahagiaan abadi dengan kenikmatan duniawi dengan cara mengingkari, yakni terus-menerus menutupi kebenaran, apa yang diturunkan Allah, berupa wahyu melalui nabi-nabi dan rasul-rasul-Nya. Mereka mengingkarinya bukan karena tidak tahu kebenarannya, tetapi karena dengki bahwa Allah menurunkan karunia-Nya, yaitu kenabian, kepada siapa yang dia kehendaki di antara hamba-hamba-Nya yang paling wajar, dalam hal ini nabi muham mad. Karena itulah wajar jika mereka menanggung kemurkaan demi kemurkaan, yaitu murka Allah karena kedengkian dan karena kedurhakaan, termasuk keingkaran mereka terhadap nabi isa. Dan kepada orang-orang kafir ditimpakan azab yang menghinakan."
  }
]