[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka meyakini dengan kejahilan mereka bahwa mereka telah berhasil menipu Allah dan orang-orang mukmin dengan menampakan keimanan dan menyembunyikan kekufuran mereka, padahal tidaklah mereka menipu kecuali diri mereka sendiri sebab akibat buruk dari tipu daya mereka itu hanya berbalik kepada mereka sendiri dan karena parahnya kebodohan mereka, mereka tidak menyadari hal tersebut dikarenakan rusaknya hati mereka"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Karena kebodohan mereka, mereka mengira akan menipu Allah dan orang-orang mukmin dengan memperlihatkan keimanan dan menyembunyikan kekafiran. Padahal hakikatnya mereka menipu diri mereka sendiri, tetapi mereka tidak menyadarinya. Karena Allah -Ta'ālā- mengetahui rahasia dan apa yang lebih tersembunyi dari itu. Allah memberitahu orang-orang mukmin tentang sifat-sifat dan keadaan mereka yang sesungguhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَمَا يَخْدَعُوْنَ اِلَّآ اَنْفُسَهُمْ Karena mereka menipu Dzat yang tidak akan tertipu maka mereka pada hakikatnya menipu diri mereka sendiri, karena penipuan hanya dapat dilakukan kepada yang tidak mengetahui hal yang ghaib."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Mereka menipu orang yang jujur dengan menampakkan sesuatu yang bukan merupakan diri mereka untuk menyamar. Namun kenyataanya, mereka menipu diri mereka sendiri. dan Allah mengetahui isi hati mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menipu Allah dan orang-orang yang beriman, padahal mereka itu tidak lain kecuali menipu diri sendiri tanpa mereka sadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. ketahuilah bahwasanya kemunafikan itu adalah menampakkan kebaikan dan menyembunyikan kejahatan, termasuk dalam definisi ini kemunafikan I’tiqad dan kemunafikan amaliah. Adapun nifaq Amali seperti yang Nabi sebutkan dalam sabdanya : \"tanda kemunafikan itu ada tiga: jika berbicara ia berdusta, jika berjanji dia ingkari dan jika dimanahi dia berkhianat\". Dalam riwayat yang lain \"jika bertengkar dia berlebihan:. Adapun kemunafikan I’tiqadiah yang mengeluarkan seseorang dari islam yaitu yang Allah ta’ala sebutkan sebagai sifat-sifat kaum munafikin dalam surat ini dan surat lainnya. Kemunafikan ini belumlah muncul sebelum hijrahnya Nabi sholallohu 'alaihi wasallam dari Makkah menuju Madinah bahkan juga setelah hijrah hingga setelah kejadian perang Badar, dan Allah memberikan kemenangan kepada kaum Muslimin dan memuliakan mereka, dan menghinakan orang-orang yang ada di Madinah dari mereka yang belum masuk islam, lalu sebagian mereka menampakkan keislaman mereka Karena takut dan sebagai tipu daya, juga untuk menjaga darah dan harta mereka., imana mereka ini bersama kaum Muslimin secara lahiriyah, mereka menampakkan bahwa mereka adalah bagian kaum Muslimin, padahal mereka pada hakikatnya bukanlah dari kaum Muslimin. Maka sebagai tindakan kelembutan Allah bagi kaum Mukminin adalah bahwa Allah memperlihatkan kondisi-kondisi mereka, dan menggambarka mereka dengan sifat-sifat yang membedakan jati diri mereka, agar kaum Mukminin tidak terperdaya oleh mereka, dan mampu mengendalikan kejahatan mereka. Allah berfirman : \" Orang-orang munafik takut akan turun terkait kelakuan mereka suatu surat yang menerangkan apa yang mereka sembunyikan di dalam hati-hati mereka berupa kekafiran. \" (QS. At-Taubah : 64) Lalu Allah menyifati mereka dengan sifat dasar kemunafikan seraya berfirman “ diantara manusia ada yang mengatakan, ’kami beriman kepada Allah dan Hari Kemudian, ’padahal mereka itu sesungguhnya bukan orang-orang yang beriman, ” karena mereka mengatakan dengan lisan mereka apa yang tidak ada dalam hati mereka, lalu Allah mendustakan mereka dengan berfirman, “padahal mereka itu sesungguhhnya bukan orang-orang yang beriman, ” karena keimanan yang hakiki itu adalah sesuatu yang disepakati oleh hati dan lisan. Sesungguhnya hal yang tadi itu adalah tipu daya terhadap Allah dan hamba-hambaNya yang beriman. Dan tipu daya itu adalah bahwa si pelaku menampakkan sesuatu kepada yang diperdayai dan dia menyembunyikan hal yang berbeda dengannya demi memperoleh yang diinginkannya dari orang yang diperdayai tersebut. Dan inilah yang dilakukan orang-orang munafik terhadap Allah dan hamba-hambaNya, sehingga tipudaya mereka tersebut kembali kepada diri mereka sendiri. Ini adalah suatu perkara yang mengherankan sekali, karena biasanya seorang pelaku tipu daya itu kondisinya bisa jadi akan memperoleh apa yang menjadi tujuannya atau dia selamat yang mana dia tidak mendapatkan apa-apa dan tidak rugi apa-apa juga, namun lain halnya tipu daya orang-orang munafik ini, ia malah kembali kepada diri mereka sendiri. Oleh Karena itu, seolah-olah mereka itu melakukan suatu makar untuk menghancurkan diri mereka sendiri, membahayakan dan menipu diri mereka, karena Allah tidaklah tersentuh oleh mudarat sedikitpun dari tipu daya mereka, demikian juga hamba-hambaNya yang beriman. Maka tindakan kaum munafik menampakkan keimanan mereka tidak membawa dampak bagi kaum Muslimin, hingga selamatlah dengan hal itu harta-harta mereka, dan terjaga darah-darah mereka, dan tipu daya mereka kembali kepada leher-leher mereka, hingga dengan demikian mereka mendapatkan kehinaan dan cela di dunia, serta kemalangan yang terus menerus disebabkan oleh apa yang diperoleh kaum Mukminin berupa kekuatan dan kemenangan, kemudian pada hari Akhir nanti mereka mendapatkan azab yang pedih lagi menyakitkan dan menyerikan disebabkan oleh pendustaan, kekufuran dan kejahatan mereka dan keadaanya saat ini adalah bahwa mereka dengan kebodohan dan kedunguan yang ada pada mereka, mereka tidak menyadari hal tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : يُخَٰدِعُونَ ٱللَّهَ Yukhoodi’uunallaha : Yaitu mereka hendak menipu Allah dengan menampakkan keimanan dan menyembunyikan kekufuran. وَمَا يَخۡدَعُونَ إِلَّآ أَنفُسَهُمۡ Wa maa yakhda’uuna illaa anfusahum : Yaitu bahwa akibat dari tipuan yang mereka lakukan akan kembali kepada diri mereka sendiri, tidak berpengaruh terhadap Allah, rasulNya, maupun orang-orang mukmin. وَمَا يَشۡعُرُونَ Wa maa yasy’uruun : Mereka tidak mengetahui bahwa akibat dari tipuan yang dilakukan kembali kepada mereka sendiri. Makna ayat : Allah Ta’ala memberitahukan bahwa ada segolongan manusia yaitu orang-orang munafik yang mengakui keimanan dengan lisan-lisannya, dan menyembunyikan kekufuran di dalam hati. Mereka menipu Allah dan kaum mukminin dengan kemunafikan ini. Maka pada saat balasan tipuan yang dilakukan kembali kepada mereka sendiri, sejatinya mereka menipu diri sendiri bukan yang lain. Akan tetapi mereka tidak tahu dan tidak menyadarinya. Pelajaran dari ayat : Begitu juga balasan dari tipu daya yang dilakukan akan kembali kepada orang yang menipu itu sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 9: Kemudian Allah menjelaskan bahwasanya orang-orang munafik menyangka dapat memperdaya Allah dan mereka yang beriman kepada Allah , yang hakekatnya mereka sendirilah yang tertipu akan tetapi mereka tidak menyadarinya Karena sebab kebutuhan mereka kelalaian mereka dan pengingkaran mereka atas dakwah serta orang-orang yang menegakkan dakwah kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena akibat penipuan itu kembalinya tidak kepada siapa-siapa selain kepada diri mereka sendiri. Namun sayang karena kebodohan mereka yang sangat membuat mereka tidak menyadari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 9",
    "description": "Mereka menduga, dengan mengatakan seperti itu, telah berhasil menipu Allah dengan menganggap Allah tidak mengetahui rahasia yang mereka sembunyikan, padahal Allah maha mengetahui segala yang tersembunyi dan yang tampak; dan mereka juga merasa telah berhasil menipu orang-orang yang beriman, dengan berpura-pura beriman, padahal mereka hanyalah menipu diri sendiri tanpa mereka sadari. Sebab akibat buruk perbuatan mereka itu, cepat atau lambat, akan kembali kepada mereka sendirihal itu karena dalam hati mereka ada penyakit, seperti penyakit iri dan dengki kepada orang-orang yang beriman, keraguan terhadap ajaran islam, keyakinan yang keliru, dan lainnya, lalu Allah menambah parah penyakitnya itu dengan kemenangan yang besar bagi orang-orang yang beriman. Kemenangan itu sangat menyakitkan mereka karena rasa iri, dengki, dan sombong yang ada dalam diri mereka. Keraguan mereka pun semakin menjadi. Dan, sebagai akibatnya, selain menderita di dunia, mereka akan mendapat azab yang pedih, karena mereka berdusta dengan memperlihatkan keimanan padahal hati mereka ingkar."
  }
]