[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alangkah buruk pilihan Bani Israil bagi mereka, karena mereka mengganti kekafiran dengan keimanan karena dzalim dan kedengkian lantaran Allah menurunkan sebagian karunianya yaitu Alquran kepada nabi Allah dan rasulnya Muhammad Shallallahu Alaihi Wasallam, Bahkan mereka pulang dengan membawa kemarahan dari Allah atas mereka karena mereka mengingkari Nabi Muhammad Shalallahu Wassalam, setelah kemurkaan Allah pada mereka sebelumnya lantaran mereka mengubah-ubah kitab suci Taurat. Dan bagi orang-orang yang mengingkari kenabian Muhammad Shalallahu Wassalam akan mendapat azab yang akan menghinakan yang menistakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Alangkah buruknya tindakan mereka yang menukar keimanan kepada Allah dan Rasul-Nya dengan kepentingan diri mereka sendiri, sehingga mereka memilih ingkar kepada wahyu yang diturunkan oleh Allah dan mendustakan para Rasul-Nya karena kezaliman dan iri hati, karena Allah telah menganugerahkan kenabian dan kitab suci Al-Qur`ān kepada Muhammad -ṣallallāhu 'alaihi wa sallam-. Akibatnya, mereka berhak mendapatkan murka yang berlipat ganda dari Allah -Ta'ālā-, karena kekafiran mereka kepada Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- dan -sebelumnya- mereka memanipulasi kitab suci Taurat. Dan orang-orang yang mengingkari kenabian Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- akan mendapatkan siksa yang menghinakan di hari kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Allah menghina orang-orang kafir dari golongan kaum Yahudi yang lebih memilih kebatilan bagi diri mereka dengan mendustakan al-Qur’an karena rasa dengki terhadap Rasulullah dan orang-orang beriman akibat kenikmatan penurunan al-Qur’an kepada mereka; sehingga mereka berhak mendapat kemurkaan Allah yang berlipat ganda. Hal ini karena banyaknya kejahatan mereka. Dan bagi orang-orang yang mendustakan azab yang pedih yang menghinakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. بِئْسَمَا اشْتَرَوْا بِهِ أَنْفُسَهُمْ (Alangkah buruknya (hasil perbuatan) mereka yang menjual dirinya sendiri) Yakni mereka membinasakan diri mereka sendiri kedalam neraka Jahannam, dan ini tidak lain disebabkan kekufuran mereka terhadap apa yang diturunkan oleh Allah. Sungguh ini adalah seburuk jual beli. بَغْيًا (kedengkian) Yakni karena kedengkian dan keinginan untuk selalu menang sendiri. أَنْ يُنَزِّلَ اللَّهُ مِنْ فَضْلِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ ۖ(bahwa Allah menurunkan karunia-Nya kepada siapa yang dikehendaki-Nya diantara hamba-hamba-Nya) Yakni mereka dengki kepada kaum arab yang dari mereka diutus akhir para nabi. Padahal mereka seharusnya tahu bahwa kenabian adalah keutamaan yang diberikan oleh Allah kepada yang Dia kehendaki, dan bukan merupakan hal yang dikhususkan untuk Bani Israil. فَبَاءُوا بِغَضَبٍ عَلَىٰ غَضَبٍ (maka mereka kembali dengan mendapat murka sesudah (mendapat) kemurkaan) Yakni menjadi berhak mendapat murka sesudah (mendapat) kemurkaan. Ada pendapat menyebutkan: hal ini disebabkan kekufuran mereka kepada nabi Isa kemudian ditambah kekufuran mereka kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallam. Dan pendapat lain menyebutkan: disebabkan oleh kekufuran kepada Nabi Muhammad Shallallahu ‘Alaihi Wasallamdan kezaliman terhadapnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Apa yang mereka jual adalah sejelek-jelek barang dagangan, dengan begitu mereka memasukkan diri mereka sendiri ke neraka Jahannam. Sebab mereka mengingkari apa yang Allah turunkan kepada mereka dengan penuh kedengkian dan persaingan suku. Mereka tidak terima bahwa yang diutus sebagai Rosul bukan dari golongan mereka yaitu Bani Israil. Bahwa Nabi Muhammad SAW bukan dari bangsa mereka, melainkan dari bangsa Arab. Sehingga kaum Yahudi mendapat laknat Allah atas kekafiran mereka terhadap risalah Nabi Muhammad SAW. Juga sebab pemalsuan mereka terhadap hukum-hukum dalam Taurat dan pengingkaran mereka kepada Nabi Isa. Maka bagi orang-orang kafirlah azab yang menghinakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Buruk sekali (perbuatan) mereka yang menjual diri mereka} Betapa buruk perbuatan mereka menukarkan nasib mereka {dengan mengingkari apa yang diturunkan Allah karena dengki} karena zalim dan dengki {bahwa Allah menurunkan karuniaNya kepada orang yang Dia kehendaki di antara hamba-hambaNya. Maka mereka akan kembali} mereka akan kembali {kepada kemurkaan demi kemurkaan. Bagi orang-orang kafir itu azab yang menghinakan} kehinaan yang akan membuat mereka menjadi sangat hina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89-90. Maksudnya, “dan setelah datang kepada mereka al-Qur’an” dari sisi Allah melalui sebaik-baik makhluk dan penutup para nabi, yang mengandung segala hal yang membenarkan Taurat yang ada pada mereka, dan sebenarnya mereka telah mengetahuinya, dan mereka telah yakin bahwasanya bila terjadi peperangan di antara mereka dengan kaum musyrikin pada masa jahiliyah, mereka meminta bantuan kepada Nabi ini, dan mereka mengancam kepada orang-orang musyrik itu akan munculnya Nabi tersebut, dan bahwasanya mereka akan memerangi kaum musyrikin bersamanya, namun ketika benar-benar telah datang kepada mereka kitab dan Nabi yang telah mereka ketahui tersebut, mereka malah kafir terhadapnya karena dengki dan zhalim, disebabkan Allah memberikan kemuliaanNya terhadap siapa yang dikehendakiNya dari hamba-hambaNya. Maka Allah melaknat mereka dan memurkai mereka dengan murka yang sangat besar, dan banyaknya pengingkaran mereka dan berturut-turutnya keraguan dan kesyirikan mereka. Di akhirat mereka mendapatkan azab yang menghinakan, maksudnya menyakitkan dan pedih, yaitu masuk neraka Jahim dan lenyapnya nikmat surga yang abadi, maka teramat buruklah kondisi mereka, dan teramat buruklah apa yang mereka ganti dan rubah dari keimanan kepada Allah, kitab-kitabNya dan Rosul-rosulNya, kepada pengingkaran kepada Allah, kitab-kitabNya dan Rosul-rosulNya, padahal mereka mengetahui dan meyakininya, sehingga dengan begitu azabnya lebih dahsyat lagi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بِئۡسَمَا } bi’sama : Bi’sa merupakan bentuk kata celaan, lawan katanya adalah ni’ma yang berarti pujian. { بَغۡيًا } baghyan : Rasa dengki dan kezhaliman { بَآءُو بِغَضَبٍ } baa’uu bighodobin : mereka kembali dengan kemurkaan. Murka adalah lawan dari ridho. Barangsiapa yang dimurkai oleh Allah akan dijauhkan dariNya, sedangkan siapa yang diridhoi oleh Allah akan dekat denganNya. { مُّهِينٞ } muhiin : Adzab yang berisikan penghinaan, pengerdilan, bagi orang yang menerima adzab. Makna ayat : Kemudian pada ayat 90 allah Ta’ala menyebutkan jeleknya perilaku orang yahudi karena mereka menjual dirinya amat murah, mereka menjualnya dengan kekufuran dan tidak beriman kepada al-Qur’an serta nabiNya. Hal itu disebabkan perasaan hasad dikarenakan nabi itu berasal dari kalangan Arab yang diberi wahyu dan ditaati serta diikuti. Akhirnya mereka kembali dari perjalanannya dalam kesesatan degan memperoleh kemurkaan besar karena kufur terhadap ‘Isa ‘alaihissalam, juga kemurkaan besar karena mengingkari Muhammad ﷺ disertai dengan adzab yang pedih di dunia dan akhirat. Pelajaran dari ayat : • Keburukan yang paling menakutkan adalah su’ul khatimah (akhir yang buruk). Semoga Allah Ta’ala melindungi kita darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 90: Kemudian Allah mencela bani israil karena sebab mereka menjual diri – diri mereka dengan harga yang sangat rendah;maka seburuk – buruk mereka adalah pilihan mereka sendiri;dimana mereka memili untuk kafir atas keimanan secara dzolim dan hasad dengan Al-Qur’an yang diturunkan kepada Muhammad ﷺ , dan sungguh mereka membenci wahyu yang Allah turunkan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: Allah menurunkan wahyu (kenabian) kepada Muhammad shallallahu 'alaihi wa sallam. Maksudnya: mereka mendapat kemurkaan yang berlipat-ganda yaitu kemurkaan karena tidak beriman kepada Muhammad shallallahu 'alaihi wa sallam dan kemurkaan yang disebabkan perbuatan mereka dahulu, yaitu membunnuh nabi-nabi, mendustakannya, merubah isi Taurat dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 90",
    "description": "Mengecam perbuatan mereka yang disebutkan dalam ayat yang lalu, Allah berfirman, sangatlah buruk perbuatan mereka menjual dirinya, yaitu menukar kebahagiaan abadi dengan kenikmatan duniawi dengan cara mengingkari, yakni terus-menerus menutupi kebenaran, apa yang diturunkan Allah, berupa wahyu melalui nabi-nabi dan rasul-rasul-Nya. Mereka mengingkarinya bukan karena tidak tahu kebenarannya, tetapi karena dengki bahwa Allah menurunkan karunia-Nya, yaitu kenabian, kepada siapa yang dia kehendaki di antara hamba-hamba-Nya yang paling wajar, dalam hal ini nabi muham mad. Karena itulah wajar jika mereka menanggung kemurkaan demi kemurkaan, yaitu murka Allah karena kedengkian dan karena kedurhakaan, termasuk keingkaran mereka terhadap nabi isa. Dan kepada orang-orang kafir ditimpakan azab yang menghinakan. Dan kedurhakaan mereka lainnya adalah bahwa apabila dikatakan kepada mere ka, berimanlah kepada apa yang diturunkan Allah, yakni alqur'an, melalui nabi Muhammad, mereka menja wab, kami hanya akan beriman kepada apa yang diturunkan kepada kami, yaitu taurat. Dan mereka ingkar kepada apa yang setelahnya, yaitu Al-Qur'an dan kitab-kitab lain yang diturunkan sesudah taurat, padahal Al-Qur'an itu adalah kitab yang benar-benar mencapai puncak hak, yaitu kebenaran dalam segala seginya. Al-qur'an itu adalah kitab yang membenarkan apa yang ada pada mereka yang pernah disampaikan oleh nabi musa dan nabi-nabi sebelumnya. Untuk menolak pernyataan mereka, Allah berfirman, katakanlah kepada mereka, nabi Muhammad, jika benar kamu hanya percaya kepada apa yang diturunkan kepada kamu, mengapa kamu dahulu membunuh nabi-nabi Allah jika kamu orang-orang beriman' secerdik apa pun orang-orang yahudi berargumen dalam rangka menolak kebenaran, tetap saja kedok mereka akan terungkap. Ketika diajak mengikuti ajaran Al-Qur'an mereka me nolak dan menegaskan hanya akan mengikuti ajaran taurat. Faktanya, mereka bukan orangorang yang taat dan patuh kepada para nabi mereka, bahkan beberapa dari nabi-nabi itu mereka bunuh."
  }
]