[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika sebagian kaum muslimin berkata kepada orang Yahudi, “berimanlah kepada Alquran yang Allah turunkan”, mereka menjawab , “kami hanya beriman kepada apa yang diturunkan kepada nabi-nabi kami saja”, lalu mereka mengingkari kitab yang diturunkan Allah setelah itu padahal itulah kebenaran yang membenarkan kitab-kitab yang ada pada mereka. Maka seandainya mereka itu mengimani kitab-kitab mereka dengan sebenarnya pastilah mereka beriman kepada Al-quran yang membenarkan kitab-kitab mereka. Katakanlah kepada mereka -wahai Rasul- “Bila kalian memang beriman kepada wahyu yang diturunkan Allah kepada kalian, mengapa kalian membunuh nabi-nabi Allah sebelumnya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Apabila dikatakan kepada orang-orang Yahudi itu, “Berimanlah kamu kepada kebenaran dan petunjuk yang Allah turunkan kepada Rasul-Nya,” mereka menjawab, “Kami beriman kepada kitab suci yang diturunkan kepada nabi-nabi kami.” Dan mereka ingkar kepada kitab suci lainnya yang diturunkan kepada Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-, meskipun Al-Qur`ān ini adalah kebenaran dari Allah yang sesuai dengan kitab suci yang ada di tangan mereka. Sekiranya mereka benar-benar beriman kepada kitab suci yang diturunkan kepada mereka, niscaya mereka juga beriman kepada Al-Qur`ān. Untuk menjawab ucapan mereka katakanlah -wahai Nabi- kepada mereka, “Mengapa kalian membunuh nabi-nabi Allah sebelum ini, jika kalian benar-benar beriman kepada kebenaran (kitab suci) yang mereka sampaikan kepada kalian?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Apabila orang-orang Yahudi diseru menuju keimanan kepada ALlah, mereka akan menolak; dan mereka akan mengklaim bahwa mereka membenarkan Taurat dan mendustakan kitab-kitab yang diturunkan setelahnya. Sungguh mereka telah mendustakan diri mereka sendiri, sebab al-Qur’an yang diturunkan itu merupakan kitab yang benar dan sesuai dengan apa yang ada dalam Taurat sebelum diubah. Maka Allah membantah anggapan mereka dengan memerintahkan Rasulullah untuk berkata kepada mereka: “Jika kalian beriman kepada apa yang diturunkan kepada kalian, lalu mengapa kalian membunuh nabi-nabi yang diutus kepada kalian sebelumnya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. وَإِذَا قِيلَ لَهُمْ آمِنُوا بِمَا أَنْزَلَ اللَّهُ (Dan apabila dikatakan kepada mereka: “Berimanlah kepada Al Quran yang diturunkan Allah) Yakni Berimanlah kepada Al Quran, atau berimanlah kepada kitab-kitab yang diturunkan Allah. قَالُوا نُؤْمِنُ بِمَا أُنْزِلَ عَلَيْنَا(mereka berkata: “Kami hanya beriman kepada apa yang diturunkan kepada kami”) Yakni kami beriman kepada taurat وَيَكْفُرُونَ بِمَا وَرَاءَهُ(Dan mereka kafir kepada Al Quran yang diturunkan sesudahnya) Yakni mereka berkata mereka tidak beriman kepada kitab-kitab selain taurat, seperti Injil dan al-Qur’an. وَهُوَ الْحَقُّ مُصَدِّقًا لِمَا مَعَهُمْ (sedang Al Quran itu adalah (Kitab) yang hak; yang membenarkan apa yang ada pada mereka) Yakni mengapa mereka membedakan dua hal yang sama yang kedua-duanya merupakan kebenaran dan saling membenarkan. قُلْ فَلِمَ تَقْتُلُونَ (Katakanlah: “Mengapa kamu dahulu membunuh…) Yakni kalaulah kalian memang jujur dalam pengakuan kalian bahwa kalian beriman kepada yang diturunkan kepada kalian, lalu mengapa kalian membunuh para nabi padahal dalam kitab tersebut telah dilarang untuk membunuh mereka. Kalimat dalam potongan ayat ini meskipun diturunkan kepada orang-orang Yahudi di zaman Rasulullah akan tetapi yang dimaksud adalah para pendahulu mereka. Namun karena orang-orang Yahudi di zaman Rasulullah meridloi apa yang dilakukan oleh pendahulu mereka maka mereka serupa dengan pendahulu mereka. Sehingga perbuatan para pendahulu ini dinisbatkan kepada orang-orang Yahudi di zaman Rasulullah karena mereka menitih jalan yang sama dengan pendahulu mereka dalam mendustakan dan memusuhi Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ketika orang-orang Yahudi diperintahkan: “Benarkanlah dengan landasan Alquran!”, mereka menjawab: “Kami membenarkan dengan Taurat yang diturunkan kepada kami.” Mereka hanya mau percaya kepada Taurat, dan mengingkari kitab lainnya. Alquran adalah kebenaran yang membenarkan kabar yang dibawa Taurat, karena kriteria kitab Allah adalah saling membenarkan kitab yang satu dengan yang lain. Maka katakanlah kepada mereka wahai Nabi: “Jika kalian memang beriman kepada yang Allah wahyukan kepada kalian, lalu mengapa kalian membunuh para Nabi Allah, padahal itu dilarang? Adapun yang mereka maksud dengan hidup yang sezaman dengan Nabi Muhammad SAW adalah para pendahulu mereka, hal itu mereka benarkan karena mereka setuju dengan apa yang telah dilakukan para pendahulu mereka. Mereka sama dengan para pendahulu mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dikatakan kepada mereka, “Berimanlah kepada apa yang diturunkan Allah (Al-Qur’an),” mereka menjawab, “Kami beriman kepada apa yang diturunkan kepada kami.” Dan mereka ingkar pada apa yang (diturunkan) setelahnya} kepada selain kitab mereka {padahal (Al-Qur’an) itu adalah kebenaran yang membenarkan apa yang ada pada mereka. Katakanlah (Muhammad), “Mengapa kalian dahulu membunuh nabi-nabi Allah jika kalian adalah orang-orang mukmin”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Jika orang Yahudi diperintahkan untuk beriman kepada apa yang diturunkan oleh Allah kepada RosulNya yaitu al-Qur’an maka mereka takabur dan sombong serta, “mereka berkata, ’Kami hanya beriman kepada apa yang diturunkan kepada kami.’ Dan mereka kafir kepada al-Qur’an yang diturunkan sesudahnya’.” Maksudnya , kafir dengan kitab-kitab selainnya, padahal yang wajib adalah mereka harus beriman kepada apa yang diturunkan oleh Allah secara mutlak, baik yang diturunkan kepada mereka atau kepada selain mereka, dan inilah keimanan yang berguna, keimanan kepada apa yang diturunkan oleh Allah kepada seluruh Rosul-rosul Allah. Adapun membeda-bedakan antara kitab-kitab dan para Rosul atau mengaku beriman kepada sebagiannya tanpa sebagiannya yang lain, maka yang seperti ini bukanlah suatu keimanan, akan tetapi itu adalah hakikat kekufuran yang sesungguhnya. Oleh karena itu Allah berfirman : \"Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-rasul-Nya, dan bermaksud memperbedakan antara (keimanan kepada) Allah dan rasul-rasul-Nya, dengan mengatakan: “Kami beriman kepada yang sebahagian dan kami kafir terhadap sebahagian (yang lain)”, serta bermaksud (dengan perkataan itu) mengambil jalan (tengah) di antara yang demikian (iman atau kafir), merekalah orang-orang yang kafir sebenar-benarnya. Kami telah menyediakan untuk orang-orang yang kafir itu siksaan yang menghinakan\" (QS. An-Nisa : 150-151) Oleh karena itu, Allah membantah mereka dengan bantahan yang telak, dan mewajibkan mereka dengan kewajiban yang tidak ada pelarian bagi mereka darinya. Allah membantah kekufuran mereka terhadap al-Qur’an dengan dua perkara seraya berfirman, “Sedang al-Qur’an itu adalah (kitab) yang haq. “ apabila al-Qur’an itu haq dalam segala hal yang dikandungnya berupa kabar, perintah dan larangan, yang mana ia juga datang dari sisi Rabb mereka, maka mengingkarinya adalah sebuah pengingkaran kepada Allah dan kepada yang haq yang Dia turunkan. Kemudia Allah berfirman, “Yang membenarkan apa yang ada pada mereka, ” maksudnya, yang sesuai dengannya dalam segala perkara yang dijelaskan olehnya dari kebenaran, dan sebagai pelengkap baginya, lalu kenapa kalian beriman kepada Taurat yang diturunkan kepada kalian namun kalian ingkar kepada yang sepertinya? Tindakan yang demikian itu hanya fanatisme saja serta mengikuti hawa nafsu, bukan mengikuti petunjuk. Demikian juga dengan posisi al-Qur’an sebagai kitab yang membenarkan Taurat yang ada pada mereka menunjukkan bahwa kitab ini adalah hujjah bagi mereka atas kebenaran yang ada pada mereka dan kitab-kitab yang ada, dan itu berarti tidak ada jalan lain bagi mereka dalam membuktikan Taurat kecuali dengan al-Qur’an, namun bila mereka mengingkari dan menentangnya, maka mereka menjadi kaum yang berkedudukan sebagai pengklaim suatu pengakuan dengan suatu hujjah dan keterangan yang dia tidak memiliki selainnya, klaimnya tersebut tidaklah akan sempurna kecuali bila keterangannya benar, kemudian dia kembali menarik hujjah dan keterangannya itu sendiri dan mendustainya. Bukankah hal yang seperti ini adalah sebuah kebodohan dan kegilaan? Pengingkaran mereka terhadap al-Qur’an hakikatnya adalah pengingkaran terhadap Taurat yang ada pada mereka sendiri, bahkan menjadi pembatal baginya. Kemudian Allah menolak pengakuan mereka tentang keimanan mereka kepada apa yang diturunkan kepada mereka dengan firmanNya, “Katakanlah” kepada mereka, “Mengapa kamu dahulu membunuh nabi-nabi Allah jika benar kamu orang-orang yang beriman?”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بِمَآ أَنزَلَ ٱللَّهُ } Bimaa anzalallahu : Dari isi al-Qur’an { بِمَآ أُنزِلَ عَلَيۡنَا } Bimaa unzila ‘alainaa : Kitab Taurat { وَهُوَ ٱلۡحَقُّ مُصَدِّقٗا } wa huwal haqqu mushodiqqan : al-Qur’an adalah pedoman pokok agama-agama samawi seperti tauhid, kenabian, kebangkitan setelah kematian, dan balasan di akhirat kelak. Makna ayat : Ayat-ayat ini masih menceritakan mengenai Bani Israil dan hardikan kepada mereka atas berbagai perbuatan buruknya. Ada ayat 91 Allah Ta’ala mengabarkan bahwa orang-orang Yahudi ketika diseru untuk beriman kepada al-Qur’an, mereka menganggap diri mereka tidak butuh kepada keimanan yang baru, dengan alasan mereka sudah beriman sebelumnya dengan apa yang Allah turunkan dalam kitab Taurat. Oleh karena itu mereka mengingkari selain Taurat, yaitu al-Qur’an. Padahal kitab al-Qur’an berisikan kebenaran. Buktinya adalah al-Qur’an membenarkan apa yang ada dalam kitab Taurat milik mereka. Kemudian Allah Ta’ala memerintahkan rasulNya untuk menganulir anggapan mereka itu dan mencelanya dalam firmanNya (فَلِمَ تَقۡتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبۡلُ إِن كُنتُم مُّؤۡمِنِينَ ) Karena membunuh para nabi sama saja menghilangkan keimanan. Pelajaran dari ayat : • Anjuran untuk mencela orang yang berbuat kejahatan atau suatu hal yang keji ketika menampakkannya secara umum. • Kesembronoan orang Yahudi ketika mereka membunuh para nabi dan orang-orang yang menyeru perbaikan dari umat manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 91: Kemudian Allah mengabarkan bahwasannya yahudi jika mereka diperintahkan untuk beriman dengan Al-Qur’an yang diturunkan kepada Muhammad ﷺ mereka menjawab: kami tidak akan beriman kecualidengan apa diturunkan Allah kepada kami dalam Taurat, dan kami menolak setiap apa Allah turunkan dari kitab – kitab samawiyyah khususnya Al-Qur’an; yang bahwasannya Al-Qur’an adalah kebenaran dan dibenarkan didalam Taurat. Kemudian Allah memerintahkan nabi-Nya agar berkata kepada mereka: jika memang kalian orang – orang yang benar dalam dakwah kalian yang bahwasannya kalian tidak akan pernah beriman kecuali dengan apa yang Alla turunkan kepada kalian; maka mengapa kalian membunuh para nabi Allah dari kabilah kalian?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya: apabila sebagian kaum muslim berkata kepada orang-orang Yahudi. Padahal beriman kepada apa yang diturunkan Allah menghendaki beriman secara mutlak, baik kepada kitab yang diturunkan kepada mereka maupun kepada selain mereka. Keimanan seperti inilah keimanan yang bermanfa'at, adapun membeda-bedakan dengan beriman kepada sebagiannya dan ingkar kepada sebagian yang lain, maka hal ini merupakan kekafiran yang sesungguhnya sebagaimana diterangkan dalam surat Al Maa'idah: 150-151. Yakni jika mereka memang beriman kepada kitab-kitab yang diturunkan kepada mereka, seharusnya mereka beriman juga kepada Al Qur'an yang isinya benar dan membenarkan apa yang ada pada mereka. Di samping itu, jika memang mereka beriman kepada kitab-kitab yang diturunkan kepada mereka, tentu mereka tidak akan membunuh nabi-nabi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 91",
    "description": "Dan kedurhakaan mereka lainnya adalah bahwa apabila dikatakan kepada mere ka, berimanlah kepada apa yang diturunkan Allah, yakni alqur'an, melalui nabi Muhammad, mereka menja wab, kami hanya akan beriman kepada apa yang diturunkan kepada kami, yaitu taurat. Dan mereka ingkar kepada apa yang setelahnya, yaitu Al-Qur'an dan kitab-kitab lain yang diturunkan sesudah taurat, padahal Al-Qur'an itu adalah kitab yang benar-benar mencapai puncak hak, yaitu kebenaran dalam segala seginya. Al-qur'an itu adalah kitab yang membenarkan apa yang ada pada mereka yang pernah disampaikan oleh nabi musa dan nabi-nabi sebelumnya. Untuk menolak pernyataan mereka, Allah berfirman, katakanlah kepada mereka, nabi Muhammad, jika benar kamu hanya percaya kepada apa yang diturunkan kepada kamu, mengapa kamu dahulu membunuh nabi-nabi Allah jika kamu orang-orang beriman' secerdik apa pun orang-orang yahudi berargumen dalam rangka menolak kebenaran, tetap saja kedok mereka akan terungkap. Ketika diajak mengikuti ajaran Al-Qur'an mereka me nolak dan menegaskan hanya akan mengikuti ajaran taurat. Faktanya, mereka bukan orangorang yang taat dan patuh kepada para nabi mereka, bahkan beberapa dari nabi-nabi itu mereka bunuh. Berikut adalah argumen lain untuk membantah orang-orang yahudi yang mengaku beriman kepada kitab yang diturunkan kepada mereka. Dan sungguh, musa telah datang kepada mu dengan bukti-bukti yang sangat jelas tentang kebenaran yang dia ajarkan, seperti turunnya al-mann dan as-salwa', terpancarnya air dari batu, berubahnya tongkat menjadi ular, dan lain-lain. Meski begitu, kamu tidak menerimanya dengan baik, bahkan kemudian kamu mengambil patung anak sapi sebagai sembahan setelah kepergian-Nya meninggalkan kamu untuk sementara waktu menuju bukit tursina, dan kamu menjadi orang-orang zalim karena kamu tetap melakukan hal itu, meskipun kamu tahu itu salah."
  }
]