[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh telah datang kepada kalian nabi Allah Musa Alaihissalam dengan mukjizat-mukjizat yang nyata yang menunjukkan kebenarannya, seperti banjir bandang, belalang, kutu, katak dan lain-lain yang telah Allah sebutkan di dalam Alquran Al-Azim, meski demikian kalian justru menjadikan patung anak sapi sebagai Tuhan yang disembah, setelah kepergian Musa menuju tempat perjumpaan yang telah ditentukan oleh Tuhannya, dan bersama itu kalian adalah orang-orang yang melampaui batas-batas aturan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dan sungguh Rasul kalian, Musa -'alaihissalām- telah datang kepada kalian dengan membawa bukti-bukti (mukjizat-mukjizat) nyata yang menunjukkan kebenarannya. Tetapi setelah itu kalian menjadikan anak sapi itu sebagai tuhan yang kalian sembah setelah kepergian Musa ke tempat yang ditentukan oleh Tuhannya. Kalian adalah orang-orang zhalim, karena kalian telah menyekutukan Allah, padahal Dia adalah satu-satunya Rabb yang berhak disembah, bukan yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Sungguh Musa telah datang kepada kalian dengan membawa mukjizat-mukjizat yang jelas, kemudian kalian menyembah patung anak sapi ketika Musa tidak ada di sisi kalian saat ia pergi ke bukit Thur di padang pasir Sina. Akibat perbuatan itu kalian menjadi orang-orang yang menzalimi diri kalian sendiri dan orang lain kerena melanggar hak Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَلَقَدْ جَاءَكُمْ مُوسَىٰ بِالْبَيِّنَاتِ (Sesungguhnya Musa telah datang kepadamu membawa bukti-bukti kebenaran (mukjizat)) Maksud dari bukti-bukti disini adalah taurat. Dan boleh juga dimaksudkan dengan bukti-bukti yang bejumlah Sembilan yang diisyaratkan pada firman Allah surat al-Isra:101 : وَلَقَدْ آتَيْنَا مُوسَىٰ تِسْعَ آيَاتٍ بَيِّنَاتٍ Dan sesungguhnya Kami telah memberikan kepada Musa sembilan buah mukjizat yang nyata ثُمَّ اتَّخَذْتُمُ الْعِجْلَ(kemudian kamu jadikan anak sapi (sebagai sembahan)) Yakni kalian jadikan sebagai tuhan dan sesembahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Telah datang kepada kalian Nabi Musa dengan berbagai mu’jizat sebagai bukti dari kebenarannya. Seperti membelah lautan, berjalan di awan (QS Al Isra’/9). Kemudian kalian menyembah anak sapi yang telah dibuat oleh Samiri. Dan kalian menyembahnya, padahal Musa telah datang membawa penjelasan kepada kalian, namun kalian tetap saja menyembah apa yang tidak berhak disembah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Musa benar-benar telah datang kepada kalian dengan bukti-bukti kebenaran. Kemudian kalian mengambil patung anak sapi} kalian menjadikan patung anak sapi sebagai sesembahan {setelah (kepergian)nya dan kalian menjadi orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Sungguh Musa telah datang kepadamu membawa bukti-bukti kebenaran (mukjizat), ” yakni dengan keterangan-keterangan yang jelas dan berdasarkan kebenaran, “kemudian kamu jadikan anak sapi (sebagai sembahan) sesudahnya, ” maksudnya setelah kedatangannya, “dan sebenarnya kamu adalah orang-orang yang zhalim” dalam hal tersebut yang kalian tidak memiliki alasan tentangnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { بِٱلۡبَيِّنَٰتِ } al-Bayyinaat : Mukjizat-mukjizat { ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ } Ittakhodztumul ‘ijla : Menginginkan tuhan yang kalian sembah saat kepergian Musa ‘alaihissalam"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 92: Allah menyebutkan mereka bahwasannya Musa datang kepada mereka dengan mukjizat dan dengan dalil – dalil yang jelas, meskipun demikian mereka tetap beribadah kepada anak sapi ketika Musa pergi kehadapannya Rabbnya; oleh sebab itu mereka adalah orang – orang yang dzolim yang menerobos batasan – batasan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mukjizat itu adalah tongkat, tangan, belalang, kutu, katak, darah, taufan (banjir besar), laut dan gunung Sinai (Thursina). Namun demikian, mereka malah menyembah patung. Maksudnya kepergian Nabi Musa 'alaihis salam ke bukit Thur yang terletak di Sinai untuk menerima Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 92",
    "description": "Berikut adalah argumen lain untuk membantah orang-orang yahudi yang mengaku beriman kepada kitab yang diturunkan kepada mereka. Dan sungguh, musa telah datang kepada mu dengan bukti-bukti yang sangat jelas tentang kebenaran yang dia ajarkan, seperti turunnya al-mann dan as-salwa', terpancarnya air dari batu, berubahnya tongkat menjadi ular, dan lain-lain. Meski begitu, kamu tidak menerimanya dengan baik, bahkan kemudian kamu mengambil patung anak sapi sebagai sembahan setelah kepergian-Nya meninggalkan kamu untuk sementara waktu menuju bukit tursina, dan kamu menjadi orang-orang zalim karena kamu tetap melakukan hal itu, meskipun kamu tahu itu salahdan ingatlah ketika kami mengambil janji kamu, wahai bani israil, dan kami angkat gunung sinai di atasmu seraya berfirman, 'pegang teguhlah apa yang kami berikan kepadamu melalui nabi musa, yakni prinsip-prinsip ajaran agama dan rinciannya, dan dengarkanlah serta perkenankanlah apa yang diperintahkan kepada kamu!' mereka menjawab, kami mendengarkan dengan telinga kami, tetapi kami tidak menaati dan tidak pula mau mengamalkannya. Bukannya segera melaksanakan perintah, mereka justru bersegera melakukan kedurhakaan. Dan diresapkanlah ke dalam hati mereka itu kecintaan menyembah patung anak sapi karena kekafiran mereka. Katakanlah, sangat buruk apa yang diperintahkan oleh kepercayaanmu kepa damu, yang kamu anggap telah menghiasi jiwa kamu, jika kamu orang-orang beriman kepada taurat."
  }
]