[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Ingatlah ketika kami mengambil atas kalian perjanjian yang dikuatkan denan menerima ajaran Taurat yang dibawa Musa, lalu kalian melanggar perjanjian itu, sehingga kami angkat gunung Tursina di atas kepala kalian, dan kami berfirman kepada kalian, “Ambillah apa yang kami berikan kepada kalian dengan sungguh-sungguh , dan dengarkan serta taatilah, kalau tidak maka kami akan menjatuhkan Gunung itu pada kalian. Kemudian kalian berkata, “kami dengar ucapanmu dan kami langgar perintahmu”, karena penyembahan terhadap patung anak sapi telah menyatu dengan hati kalian karena telah lamanya kalian dalam kekafiran. Katakanlah kepada mereka -wahai Rasul- “amat buruk apa yang diperintahkan oleh keimanan kalian berupa kekafiran dan kesesatan, jika kalian membenarkan Wahyu yang Allah turunkan kepada kalian.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Dan ingatlah ketika Kami mengambil perjanjian yang kuat dari kalian untuk mengikuti Musa -'alaihissalām- dan menerima ajaran yang dibawanya dari Allah, serta Kami angkat gunung (Tursina) di atas kalian untuk menakut-nakuti kalian, dan kami berfirman kepada kalian, “Ambillah Taurat yang telah Kami berikan kepada kalian dengan sungguh-sungguh, dengarkanlah kitab suci itu, dalam arti menerimanya dan tunduk kepadanya, jika tidak, Kami akan menjatuhkan gunung itu kepada kalian.” Lalu kalian berkata, “Kami mendengarkan dengan telinga dan membangkang dengan perbuatan kami.” Penyembahan anak sapi itu benar-benar menancap di hati mereka karena kekafiran mereka. Katakanlah -wahai Nabi-, “Buruk sekali apa yang diperintahkan iman ini kepada kalian, yaitu ingkar dan berpaling dari perintah Allah, jika kalian benar-benar beriman. Sebab, iman yang benar tidak mungkin disertai dengan kekufuran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Dan ingatlah ketika Kami mengambil perjanjian yang teguh dari kalian agar kalian mengamalkan apa yang ada dalam Taurat. Namun kalian melanggar perjanjian itu, sehingga Kami mengancam kalian dengan mangangkat bukit Thur ke atas kepala kalian, dan Kami perintahkan kalian agar mengamalkan perjanjian itu dengan sungguh-sungguh, jika tidak maka Kami akan menimpakan bukit itu kepada kalian. Kemudian kalian menjawab akan mendengar perkataan itu, namun kalian melanggar perintah itu, sebab peribadatan kepada patung anak sapi itu telah masuk dan bercampur dengan hati kalian. Kemudian Allah memerintahkan Rasul-Nya untuk mengolok perbuatan dosa itu dengan mengatakan: “Sungguh seburuk-buruk amal dan kesesatan jika kalian beriman kepada Allah dan Rasul-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَرَفَعْنَا فَوْقَكُمُ الطُّورَ (dan Kami angkat bukit (Thursina) di atasmu) Kisah dari diangkatnya bukit Thur telah dibahas pada ayat 63 di surat ini. خُذُوا مَا آتَيْنَاكُمْ بِقُوَّةٍ (Peganglah teguh-teguh apa yang Kami berikan kepadamu) Yakni dengan penuh kesungguhan dan kepedulian وَاسْمَعُوا ۖ (dan dengarkanlah!) Yakni taatilah dan terimalah perintah yang kalian dengar. سَمِعْنَا (Kami mendengar) Yakni kami mendengar perkataan-Mu dengan indra pendengaran kami وَعَصَيْنَا (tetapi tidak mentaati) Yakni kami tidak menerima apa yang Engkau perintahkan kepada kami. وَأُشْرِبُوا(Dan telah diresapkan ke dalam hati mereka itu) Yakni dijadikan hati mereka seakan-akan meminum cinta pada anak lembu karena begitu kuatnya kecintaan itu. Diibaratkan dengan meminum karena ketika minum, air akan masuk keseluruh tubuh hingga titik paling dalam. بِكُفْرِهِمْ ۚ (karena kekafiarannya) Yakni hal itu disebabkan oleh kekufuran mereka sebagai bentuk hukuman dan hinaan untuk mereka. قُلْ بِئْسَمَا يَأْمُرُكُمْ بِهِ إِيمَانُكُمْ (Katakanlah: “Amat jahat perbuatan yang telah diperintahkan imanmu kepadamu) Yakni iman yang kalian klaim bahwa kalian berimandengan apa yang diturunkan kepada kalian. Karena perkataan: “kami mendengar tetapi tidak mentaati” menandakan kalian berbohong ketika berkata: (نؤمن بما أنزل علينا) “kami beriman dengan yang diturunkan kepada kami."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman tentang para penyembah anak sapi : { وَأُشْرِبُوا فِي قُلُوبِهِمُ الْعِجْلَ }, yakni diresapkan kepada mereka kecitaan terhadapnya, kalau saja makhluq dicintai oleh hati manusia sampai menjadikannya seperti minuman baginya, maka kecintaan orang-orang beriman kepada tuhannya harus lebih dari apa yang telah dilakukan oleh penyembah hewan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai kaum Yahudi, ingatlah ketika kami ambil perjanjian dari kalian untuk mengamalkan apa yang ada dalam Taurat, dan kami angkat gunung Thur di atas kalian (QS Al-Baqarah/63). Lalu kami katakan kepada kalian: “Amalkanlah apa yang ada dalam kitab Taurat dengan penuh kesungguhan. Taatilah dan taerimalah apa yang diperintahkan kepada kalian.” Lalu kalian menjawab: “Kami dengar perkataanmu, dan kami mengingkari perintahmu. Kami tidak menerima perintahmu. Telah tertanam di hati kalian untuk menyembah anak sapi, semua itu disebabkan kekafiran kalian. Maka katakanalah kepada mereka, wahai nabi: “Apa yang menuntun kalian untuk meyakini kekufuran kalian itu adalah seburuk-buruknya perintah. Satu waktu kalian beriman, namun di belakang itu kalian mengingkarinya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ketika Kami mengambil janji kalian dan Kami angkat gunung Sinai di atas kalian (seraya berfirman), “Pegang teguhlah apa yang Kami berikan kepada kalian dan dengarkanlah”} penuhilah dan taatilah {Mereka menjawab, “Kami mendengarkannya, tetapi kami tidak menaatinya.”} kami mendengar perkataanmu namun kami mengingkari perintahmu {dan Diresapkanlah ke dalam hati mereka itu patung anak sapi} dan dimasukkan ke dalam hati mereka kecintaan untuk menyembah patung anak sapi {karena kekufuran mereka. Katakanlah, “Sangat buruk apa yang diperintahkan oleh keimanan kalian kepada kalian jika kalian adalah orang-orang mukmin”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. “Dan (ingatlah), ketika kami mengambil janji darimu dan Kami angkat bukit (Thursina) di atasmu (seraya Kami berfirman), ‘Peganglah teguh-teguh apa yang Kami berikan kepadamu dan dengarkanlah!” Maksudnya, mendengar dengan menerima dan taat serta respon untuk menunaikan. “Mereka menjawab, ’ Kami mendengar tetapi tidak menaati’.” Karena hal ini menjadi suatu kebiasaan mereka, “dan telah diresapkan ke dalam hati mereka itu (kecintaan menyembah) anak sapi karena kekafirannya,” yakni, dijadikan dalam hati mereka kecintaan kepada anak sapi itu dan penyembahan mereka kepadanya serta menyerapnya (baca: menikmatinya) yang disebabkan oleh kekufuran mereka tersebut. “Katakanlah, ’Amat jahat perbuatan yang telah diperintahkan imanmu kepadamu jika betul kamu beriman (kepada Taurat) ‘.” Maksudnya kalian mengaku beriman dan kalian memuji diri kalian dengan agama yang benar dan kalian juga membunuh para Nabi Allah lalu kalian menjadikan anak sapi sebagai sesembahan kalian selain dari pada Allah ketika Musa nabi Allah, tidak hadir di tengah kalian, kalian tidak menerima perintah-perintah dan larangan-larangannya kecuali setelah adanya ancaman dan akan diangkatnya gunung Thursina diatas kalian, lalu kalian menaati secara lisan namun kalian mendustainya secara tindakan, maka pengakuan iman seperti apakah yang kalian klaim itu? Dan agama apakah itu? Apabila hal yang seperti itu adalah keimanan sebagaimana yang kalian klaim, maka sangat jeleklah keimanan orang yang mengajak orang lain kepada kezhaliman dan kekufuran kepada Rosul-rosul Allah dan banyak bermaksiat, padahal telah diketahui bahwasanya keimanan yang benar adalah mengajak orang kepada segala hal yang baik dan mencegahnya dari segala hal yang buruk. Dengan semua itu jelaslah kebohongan mereka dan nyatalah pertentangan dalam diri mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَأُشۡرِبُواْ فِي قُلُوبِهِمُ ٱلۡعِجۡلَ } wa usyribuu fii qulubihimul ‘ijla : Maknanya mencintai patung anak sapi yang mereka sembah karena seruan Samiri kepada mereka. Makna ayat : Pada ayat 93 Allah Ta’ala mengingatkan orang-orang Yahudi mengenai perjanjian yang telah dibuat dengan para pendahulu mereka, yaitu untuk mengamalkan isi Taurat pada saat gunung Tursina diangkat di atas mereka sebagai ancaman bagi mereka. Akan tetapi mereka tidak menepati perjanjian itu. Seakan-akan mereka mengatakan “Kami dengar dan kami durhakai”. Mereka kemudian menyembah patung anak sapi, dan hati mereka dibuat cinta kepada patung itu akibat kekafirannya. Kemudian Allah Ta’ala memerintahkan rasulNya agar mencela anggapan bodoh mereka bahwa keimanan merekalah yang menyuruh untuk membunuh para nabi, menyembah patung, dan durhaka kepada aturan Allah. Pelajaran dari ayat : • Kewajiban untuk melakukan perintah-perintah syariat Allah dengan penuh keseriusaan, kesungguhan, dan kekuatan. • Keimanan yang benar hanya akan menyuruh kepada perbuatan yang baik, sedangkan keimanan yang palsu akan mendorong untuk melakukan perbuatan mungkar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 93: Allah menyebutkan tentang bani israil ketika Allah mengambil perjanjian dengan mereka, akan tetapi mereka mengkhianatinya; maka Allah mengangkat diatas kepala mereka bukit thur bagaimana awan yang akan menjatuhi mereka, jika mereka bermaksiat kepada Allah. Agar kita mereka memiliki bukti atas kebesaran kuasa Allah dan agar mereka memiliki rasa takut dan keimanan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jika mereka menolak, maka akan ditimpakan bukit Thrsina kepada mereka. Maksudnya mendengar disertai sikap tunduk, menerima dan ta'at. Perbuatan jahat yang mereka kerjakan ialah menyembah anak sapi, membunuh nabi-nabi dan melanggar janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 93",
    "description": "Dan ingatlah ketika kami mengambil janji kamu, wahai bani israil, dan kami angkat gunung sinai di atasmu seraya berfirman, 'pegang teguhlah apa yang kami berikan kepadamu melalui nabi musa, yakni prinsip-prinsip ajaran agama dan rinciannya, dan dengarkanlah serta perkenankanlah apa yang diperintahkan kepada kamu!' mereka menjawab, kami mendengarkan dengan telinga kami, tetapi kami tidak menaati dan tidak pula mau mengamalkannya. Bukannya segera melaksanakan perintah, mereka justru bersegera melakukan kedurhakaan. Dan diresapkanlah ke dalam hati mereka itu kecintaan menyembah patung anak sapi karena kekafiran mereka. Katakanlah, sangat buruk apa yang diperintahkan oleh kepercayaanmu kepa damu, yang kamu anggap telah menghiasi jiwa kamu, jika kamu orang-orang beriman kepada taurat. Selain kedurhakaan-kedurhakaan itu, mereka juga selalu menganggap diri sebagai bangsa pilihan tuhan, meyakini tidak akan masuk neraka kecuali sebentar, dan mengklaim surga sebagai tempat yang Allah khususkan bagi mereka. Untuk membuktikan kebenaran ucapan mereka, katakanlah, wahai nabi Muhammad, jika kenikmatan negeri akhirat di sisi Allah kamu anggap khusus untukmu saja, bukan untuk orang lain, maka mintalah kematian. Itu karena semakin percaya seseorang terhadap indah dan nikmatnya sesuatu, semakin besar pula keinginannya untuk cepat-cepat menemui sesuatu tersebut. Karena keinginan mati dapat menjadi bukti hubungan baik kamu dengan Allah, maka kamu pasti ingin segera mati dan menemuinya. Mintalah kematian jika kamu orang yang benar dalam perkataanmu bahwa kenikmatan akhirat hanya untuk kamu."
  }
]