[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah -wahai rasul- kepada kaum Yahudi yang mengaku-ngaku bahwa surga hanya diperuntukkan untuk mereka secara khusus, lantaran persangkaan mereka bahwa mereka adalah orang-orang kekasih Allah tanpa ada orang lain yang menyertai mereka, dan bahwa sesungguhnya mereka adalah anak-anak dari kekasih-kekasih Allah, “apabila faktanya demikian maka mohonlah kematian agar menimpa orang-orang yang mendustakaan, baik dari kalian ataupun pihak lain. Bila kalian adalah orang-orang yang benar dengan klaim kalian itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Katakanlah -wahai Nabi-, “Jika kalian wahai orang-orang Yahudi- benar-benar memiliki surga di akhirat yang khusus diperuntukkan bagi kalian dan tidak boleh dimasuki oleh manusia lain, maka berharaplah untuk mati dan mintalah kematian itu agar kalian segera mendapatkan kedudukan tersebut, sehingga kalian bisa bebas dari beban masalah kehidupan dunia, jika pengakuan kalian tersebut memang benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Allah memerintahkan Rasulullah untuk membantah orang-orang Yahudi yang mengklaim bahwa surga hanya khusus bagi mereka. Hendaklah mereka mengharapkan kematian jika mereka benar dalam pengakuan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. قُلْ إِنْ كَانَتْ لَكُمُ الدَّارُ الْآخِرَةُ (Katakanlah: “Jika kamu (menganggap bahwa) kampung akhirat (surga)) Yakni mereka mengklaim kalua mereka akan masuk surga. خَالِصَةً (dikhususkan (bagimu)) Dan tidak masuk surga kecuali mereka. فَتَمَنَّوُا الْمَوْتَ (maka inginilah kematian(mu)) Yakni memerintahkan mereka agar mengharapkan kematian. Karena barangsiapa yang yakin bahwa dia termasuk ahli surga maka kematian akan lebih dia sukai daripada kehidupan. Terdapat hadist marfu’ dari Ibnu Abbas yang dikeluarkan oleh Imam Bukhari dan lainnya: andaisaja orang-orang Yahudi itu mengharapkan kematian niscaya mereka akan mati dan melihat tempat-tempat duduk mereka di neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Katakanlah kepada mereka wahai Nabi bahwa surga diperuntukkan bagimu, khusus kamu, bukan untuk semua manusia seperti yang kamu katakan. Maka, berharap-haraplah/persiapkanlah kematianmu agar engkau termasuk orang yang beruntung mendapatkan surga. Karena barangsiapa yang yakin bahwa dia termasuk penghuni surga, maka mati menjadi hal yang lebih dia cintai dari pada hidup: itu apabila iaman kalian benar-benar teguh. Adapun, sebab turunnya ayat ini seperti yang diriwayatkan oleh Imam Thabbrani dari Abu Aliyah berkata: Kaum Yahudi berkata: “Tidak akan masuk surga, kecuali orang-orang yang beragama Yahudi.” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Jika negeri akhirat di sisi Allah khusus untuk kalian} khusus untuk kalian {bukan untuk orang lain, mintalah kematian jika kalian adalah orang-orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. maksudnya “Katakanlah” kepada mereka dalam bentuk membenarkan pengakuan mereka, “jika kamu (menganggap bahwa) kampung akhirat itu,” maksudnya surga, “khusus untukmu di sisi Allah bukan untuk orang lain, ” sebagaimana yang kalian klaim bahwasanya tidaklah akan masuk surga kecuali orang Yahudi atau Nasrani, dan bahwasanya neraka tidaklah akan menyentuh mereka kecuali hanya dalam waktu yang dapat dihitung saja, maka bila kalian benar dalam pengakuan ini, ”maka inginilah kematian (mu).” Ini adalah sebuah bentuk mubahalah antara mereka dan Rosulullah Sholallohu 'alaihi wasallam, dan tidak ada lagi setelah itu pemaksaan dan tekanan bagi mereka setelah kedurhakaan mereka kecuali salah satu dari dua perkara : pertama mereka beriman kepada Allah dan RosulNya, atau kedua, bermubahalah dengan sesuatu yang mereka jadikan sebagai pedoman untuk dipertaruhkan dengan perkara yang ringan yaitu keinginan untuk mati yang akan menyampaikan mereka kepada negeri yang khusus bagi mereka tersebut. Namun mereka menolak hal tersebut, sehingga setiap orang dapat mengetahui bahwa mereka itu hakikatnya benar-benar dalam kondisi durhaka dan menentang Allah dan RosulNya padahal mereka mengetahui hal tersebut. Oleh karena itu Allah berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { ٱلدَّارُ ٱلۡأٓخِرَةُ } ad-Daarul aakhirah : Yang dimaksud dengan negeri akhirat adalah kenikmatan surga dan seluruh hal yang dijanjikan oleh Allah kepada para wali-Nya { خَالِصَةٗ } Khaalishah : Khusus, tidak ada yang bisa memasukinya selain kalian. { تَمَنَّوُاْ ٱلۡمَوۡتَ } Tamannaul maut : Berharaplah kematian dalam diri kalian dan mintalah dengan lisan-lisan kalian, karena orang yang mendapat kenikmatan di surga tidak akan nyaman untuk tetap hidup di dunia. { إِن كُنتُمۡ صَٰدِقِينَ } In kuntum shaadiqin : Jika kalian jujur dalam pengakuan kalian bahwa kenikmatan surga hanya khusus untuk kalian, tidak didapatkan oleh orang selain kalian. Makna ayat : Ayat-ayat ini masih mengisahkan tentang bantahan atas argumen-argumen lemah yang dimiliiki oleh orang-orang Yahudi. Pada ayat 94 Allah Ta’ala memerintahkan rasulNya untuk menantang orang Yahudi dengan perkataan,”Jika benar negeri Akhirat itu khusus untuk kalian, tidak ada yang memasukinya selain kalian, maka berharaplah kematian agar kalian lekas masuk surga. Sehingga kalian bisa bebas beristirahat dari penatnya dunia dan sulitnya mencari penghidupan. Jika kalian tidak berharap maka jelaslah kebohongan kalian dan telah tetap kekufuran kalian, dan kalian termasuk penghuni neraka.” Sungguh, mereka tidak pernah berharap kematian. Seandainya benar mereka mengharapkannya tentu matilah mereka semuanya. Pelajaran dari ayat : • Benarnya agama Islam, dan kebatilan agama Yahudi. Hal ini terbukti dengan kekalahan mereka dalam Mubahalah (sumpah mati) yang dilakukan. • Seorang mukmin yang shalih akan memilih kematian dibandingkan kehidupan dunia karena mengharapkan kebahagian dan ketenangan setelah kematian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 94: 94-95. Allah memerintahkan nabi nya : jika surga murni bagi kalian tidak bagi manusia yang lain, maka berharaplah untuk mati, untuk memasukinya jika kalian memang termasuk orang – orang dalam dakwah kalian, akan tetapi Allah menjelaskan bahwasannya mereka tidak akan berharap kematian selamanya karena sebab perbuatan-perbuatan mereka yang buruk dan seruan mereka yang dusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni surga. Hal ini karena anggapan bahwa mereka adalah para wali Allah, merekalah yang akan masuk surga dan bahwa mereka tidak akan disentuh api neraka kecuali beberapa hari saja. Maksudnya: mintalah agar kamu dimatikan sekarang juga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 94",
    "description": "Selain kedurhakaan-kedurhakaan itu, mereka juga selalu menganggap diri sebagai bangsa pilihan tuhan, meyakini tidak akan masuk neraka kecuali sebentar, dan mengklaim surga sebagai tempat yang Allah khususkan bagi mereka. Untuk membuktikan kebenaran ucapan mereka, katakanlah, wahai nabi Muhammad, jika kenikmatan negeri akhirat di sisi Allah kamu anggap khusus untukmu saja, bukan untuk orang lain, maka mintalah kematian. Itu karena semakin percaya seseorang terhadap indah dan nikmatnya sesuatu, semakin besar pula keinginannya untuk cepat-cepat menemui sesuatu tersebut. Karena keinginan mati dapat menjadi bukti hubungan baik kamu dengan Allah, maka kamu pasti ingin segera mati dan menemuinya. Mintalah kematian jika kamu orang yang benar dalam perkataanmu bahwa kenikmatan akhirat hanya untuk kamu. Tetapi, mendapat tantangan seperti itu, ternyata tidak seorang pun bersedia cepat mati. Mere ka sekali-kali tidak akan mengingin kan kematian itu sama sekali, bahkan mereka ingin hidup di dunia selamalamanya walau dalam bentuk kehidupan yang sederhana. Keinginan ini karena disebabkan oleh dosa-dosa yang telah dilakukan tangan mereka sendiri berupa kezaliman dan kemaksiatan. Dan Allah maha mengetahui orang-orang zalim."
  }
]