[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka tidak akan melakukannya selamanya, karena mereka mengetahui kebenaran Nabi Muhammad Shallallahu Alaihi Wasallam sekaligus kedustaan dan kebohongan mereka sendiri, serta disebabkan perbuatan yang telah mereka lakukan berupa kekafiran dan kemaksiatan, yang mengakibatkan mereka diharamkan memasuki surga dan masuk dan mereka akan masuk neraka. Dan Allah Subhanahu Wa Ta'ala Maha Mengetahui orang-orang yang zalim dari hamba-Nya, dan akan membalas mereka berdasarkan perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Mereka tidak akan pernah mengharapkan kematian, disebabkan apa yang telah mereka perbuat selama hidup, yaitu ingkar kepada Allah, mendustakan rasul-rasul-Nya dan memanipulasi kitab-kitab suci-Nya. Allah Maha Mengetahui orang-orang yang zalim, baik dari kalangan mereka (orang-orang Yahudi) maupun orang lain, dan akan memberikan balasan yang setimpal kepada setiap orang sesuai dengan amal perbuatannya masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Mereka tidak akan melakukan hal itu karena mereka telah melakukan banyak dosa yang akan diberi perhitungan; sedangkan Allah Maha Mengetahui dosa orang-orang yang bermaksiat. Dikeluarkan oleh Abdul Razzaq dengan sanad yang shahih dari Ibnu Abbas: “Seandainya orang-orang Yahudi mengharapkan kematian niscaya mereka akan mati.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. وَلَنْ يَتَمَنَّوْهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ (Dan sekali-kali mereka tidak akan mengingini kematian itu selama-lamanya, karena kesalahan-kesalahan yang telah diperbuat oleh tangan mereka (sendiri)) Yakni kerena perbuatan-perbuatan dosa mereka yang mana pelaku-pelaku dosa tidak akan merasa aman dari azab bahkan tidak membayangkan akan dimasukkan surga apalagi membayangkan surga hanya dikhususkan bagi mereka. وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ (dan Allah Maha Mengetahui siapa orang-orang yang aniaya) Yakni Allah menulis mereka sebagai orang-orang yang zalim dan jauh dari kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini mengisyaratkan bahwasanya orang yang berlumur dosa benci kepada kematian karena takut akan dosa-dosa yang akan ia pikul kepadanya, sebagaimana yang dikatakan oleh sebagian salaf : \"tidaklah kematian itu dibenci kecuali oleh orang yang ragu dan bimbang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Orang-orang Yahudi tidak akan pernah mengharapkan datangnya kematian, karena mereka sadar bahwa mereka melakukan banyak dosa. Diantaranya memalsukan dan mendustakan ayat Allah. Mereka tidak akan pernah selamat dari azab Allah, bahkan mereka tidak sedikitpun mengaharapkan masuk surga. Allah Maha Mengetahui atas orang-orang kafir dan atas balasan yang patut bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak akan menginginkan kematian itu sama sekali karena apa yang telah berlalu} apa yang dilakukan sebelumnya {oleh tangan-tangan mereka. Allah Maha Mengetahui orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. “Dan sekali-kali mereka tidak akan menginginkan kematian itu selama-lamanya, karena kesalahan-kesalahan yang telah diperbuat oleh tangan mereka (sendiri)” disebabkan kekufuran dan kemaksiatan, karena mereka sangat mengetahui bahwa hal itu adalah jalan bagi mereka kepada pembalasan atas perbuatan-perbuatan mereka yang buruk, maka kematian itu adalah suatu perkara yang paling mereka benci, dan mereka adalah orang yang paling rakus terhadap kehidupan disbanding setiap manusia hingga dari kaum musyrikin yang tidak beriman kepada salah seorang Rosul pun dari para Rosul dan kitab-kitab. Kemudian Allah menyebutkan tentang sifat cinta mereka yang begitu besar terhadap kehidupan dunia seraya berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Kemudian pada ayat 95 Allah Ta’ala mengabarkan bahwa orang-orang Yahudi tidak akan berharap kematian selamanya. Sebabnya karena banyaknya dosa-dosa serta kesalahan yang dilakukan akan menyebabkan mereka terseret masuk ke dalam adzab neraka. Karena mereka termasuk orang-orang yang berbuat kejahatan dan kezhaliman. Allah maha Tahu dengan orang-orang zhalim dan akan menghukum kezhaliman mereka. Sesungguhnya Allah Maha Bijaksana lagi Maha mengetahui."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 95: 94-95. Allah memerintahkan nabi nya : jika surga murni bagi kalian tidak bagi manusia yang lain, maka berharaplah untuk mati, untuk memasukinya jika kalian memang termasuk orang – orang dalam dakwah kalian, akan tetapi Allah menjelaskan bahwasannya mereka tidak akan berharap kematian selamanya karena sebab perbuatan-perbuatan mereka yang buruk dan seruan mereka yang dusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Perbuatan yang mereka lakukan adalah kekafiran dan kemaksiatan, ditambah lagi karena mereka mengetahui kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam. Oleh karena itu, sesuatu yang paling mereka takuti adalah kematian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 95",
    "description": "Tetapi, mendapat tantangan seperti itu, ternyata tidak seorang pun bersedia cepat mati. Mere ka sekali-kali tidak akan mengingin kan kematian itu sama sekali, bahkan mereka ingin hidup di dunia selamalamanya walau dalam bentuk kehidupan yang sederhana. Keinginan ini karena disebabkan oleh dosa-dosa yang telah dilakukan tangan mereka sendiri berupa kezaliman dan kemaksiatan. Dan Allah maha mengetahui orang-orang zalim. Dan tidak saja mereka enggan segera mati, sungguh demi tuhanmu, engkau, wahai Muhammad, akan mendapati mereka, yakni orang-orang yahudi yang mengaku kekasih Allah itu, manusia yang paling tamak atas kehidupan dunia, bahkan lebih tamak dari orang-orang musyrik, karena orang musyrik sejak semula tidak percaya kepada wujud tuhan dan akhirat. Ini berbeda dengan orang-orang yahudi yang mengakui wujud tuhan dan keniscayaan akhirat. Betapa tamaknya mereka, sehingga masing-masing dari mereka ingin diberi umur seribu tahun, yakni hidup selama mungkin di dunia, padahal seandainya mereka diberi umur sepanjang apa pun, umur panjang itu tidak akan menjauhkan mereka dari azab. Dan masing-masing akan mendapat sanksi sesuai dosa-dosanya karena Allah maha melihat apa yang mereka kerjakan."
  }
]