[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu -wahai Rasul- akan benar-benar mengetahui bahwa sesungguhnya kaum Yahudi itu adalah orang-orang yang paling berambisi untuk hidup lama apapun keadaan kehidupan tersebut meskipun diliputi kerendahan dan kehinaan, bahkan hasrat mereka untuk hidup lama melebihi keinginan orang-orang musyrik. Orang-orang Yahudi bermimpi untuk hidup selama 1000 Tahun lamanya, namun umur yang panjang ini (kalau terjadi) tidak akan menjauhkan mereka dari siksa Allah. Dan Allah ta'ala tidak ada sesuatupun yang tersembunyi baginya dari perbuatan-perbuatan mereka, dan dia membalas mereka atas perbuatan yang telah mereka lakukan itu dengan azab yang layak mereka dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Dan sungguh engkau -wahai Nabi- benar-benar akan mendapati orang-orang Yahudi itu adalah manusia yang paling tamak terhadap kehidupan (di dunia), meskipun hidup mereka hina dan nista. Bahkan mereka lebih tamak dari orang-orang musyrik yang tidak percaya akan adanya hari kebangkitan dan perhitungan amal (hisab), padahal orang-orang Yahudi itu adalah ahli kitab yang percaya akan adanya hari kebangkitan dan perhitungan amal (hisab). Maka satu orang dari mereka menginginkan umurnya mencapai seribu tahun. Padahal berapapun panjangnya umur seseorang tidak dapat menjauhkannya dari azab Allah. Dan Allah Maha Mengetahui dan Maha Melihat amal perbuatan mereka. Tidak ada sesuatupun yang luput dari pengetahuan Allah. Dan Allah akan memberi mereka balasan yang setimpal dengan amal perbuatan mereka tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Allah menekankan bahwa Muhammad akan mendapati orang-orang Yahudi adalah manusia yang paling tamak untuk memiliki umur yang panjang, mereka lebih tamak daripada orang-orang musyrik dan mencukupkan diri dengan kecintaan terhadap dunia, sebab mereka tidak beriman kepada akhirat. Orang-orang Yahudi berharap dapat berumur panjang sampai seribu tahun, namun umur panjang itu tidak dapat menolong dan menjauhkan mereka dari azab Allah. Allah mengetahui amalan mereka dan Dia akan memberikan balasannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلَىٰ حَيَاةٍ (Dan sungguh kamu akan mendapati mereka, manusia yang paling serakah kepada kehidupan (di dunia)) Yakni serakah kepada kehidupan yang sebenarnya adalah kehidupan yang remeh dan waktunya sangat singkat. Lalu bagaimana keserakahan mereka jika kehidupan ini melimpah dengan kebaikan dan dengan waktu yang panjang? وَمِنَ الَّذِينَ أَشْرَكُوا ۚ( bahkan (lebih serakah lagi) dari orang-orang musyrik) Yakni orang yang paling serakah kepada dunia yang melebihi keserakahan orang-orang musyrik adalah orang yang tidak beriman kepada hari kebangkitan dan kehidupan akhirat. Adapun yang menjadikan orang-orang Yahudi begitu serakah adalah karena mereka mengetahui diakhirat nanti mereka akan mendapatkan azab. يَوَدُّ أَحَدُهُمْ(Masing-masing mereka ingin) Yakni setiap orang Yahudi itu menginginkan لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ الْعَذَابِ أَنْ يُعَمَّرَ (agar diberi umur seribu tahun, padahal umur panjang itu sekali-kali tidak akan menjauhkannya daripada siksa) Yakni ingin agar dapat hidup setibu tahun. Padahal umur yang panjang itu tidak dapat menyelamatkan mereka dari api neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ } \"Masing-masing mereka ingin agar diberi umur seribu tahun\" , seperti itulah keinginan orang-orang Yahudi yang Allah kabarkan kepada kita, lalu apa maksud dibalik itu ? boleh jadi maksud dari ayat ini adalah seperti yang disampaikan oleh Mujahid rahimahullah : bahwa \"telah dicintakan kepada mereka untuk berbuat kesalahan sepanjang umur\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Muhammad, kamu akan benar-benar mengetahui bahwa kaum Yahudi itu adalah kaum yang paling tamak atas kehidupan dunia. Mereka adalah orang yang paling tamak atas kehidupan dunia, bahkan melebihi orang-orang musyrik, melebihi yang tidak beriman terhadap hari kebangkitan, akhirat maupun hari pembalasan. Kaum Yahudi berharap, andaikan umur mereka sampai seribu tahun, padahal umur panjang tidak akan menjauhkan mereka dari azab Allah, meskipun dalam keadaan masih hidup apalagi ketika sudah mati. Allah Maha Melihat terhadap perbuatan mereka di dunia, dan akan Allah balas di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kamu benar-benar akan mendapati mereka} sungguh kamu benar-benar akan mendapati orang-orang Yahudi {sebagai manusia yang paling tamak terhadap kehidupan (dunia), daripada orang-orang yang berbuat syirik} dan lebih tamah daripada orang-orang yang berbuat syirik {sangat senang} sangat berharap {salah satu dari mereka untuk diberi umur} dipanjangkan umurnya {seribu tahun, padahal itu tidak akan menjauhkannya} menjauhkannya {dari azab jika dia diberi umur panjang. Allah Maha Melihat apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. “Masing-masing mereka ingin agar diberi umur seribu tahun.” Hal ini, adalah lebih dalam maknanya dari sekedar ketamakan, di mana mereka berkhayal tentang suatu hal yang paling mustahil di antara hal-hal yang mustahil, walupun faktanya bila mereka diberikan kehidupan sebanyak yang disebutkan dalam ayat ini, tetap saja tidak ada gunanya sama sekali bagi mereka, dan tidak juga menyelamatkan mereka dari azab. “Dan Allah Maha Mengetahui apa yang mereka kerjakan.” Ini adalah sebuah ancaman bagi mereka dengan adanya pembalasan terhadap perbuatan-perbuatan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { حياة } Hayaah : Berbentuk nakirah (umum) agar mencakup seluruh kehidupan walaupun kehidupan yang tercela. { ٱلَّذِينَ أَشۡرَكُواْ } Aladziina asyrakuu : Mereka seluruh orang musyrik selain golongan ahli kitab. { يَوَدُّ } Yawaddu : Menyukai { بِمُزَحۡزِحِهِۦ } Bimuzahzihihi : Menjauhkan diri dari adzab { أَن يُعَمَّرَۗ } An yu’ammar : Diberi umur panjang seribu tahun Makna ayat : Pada ayat 96 Allah Ta’ala memberitahukan bahwa orang-orang Yahudi adalah orang-orang yang paling tamak terhadap kehidupan duniawi, bahkan melebihi orang musyrik yang berharap hidup selama seribu tahun. Bagaimana orang-orang Yahudi itu akan mengharap kematian sedangkan mereka dalam keadaan tamak terhadap kehidupan dunia? Hal itu karena mereka mengetahui akhir cerita hidupnya jika mereka mati. Lantas Allah Ta’ala mengabarkan bahwa orang-orang kafir tidak akan selamat dari adzab sepanjang hidupnya walaupun mereka hidup selama seribu tahun. Kemudian Allah mengancam orang-orang Yahudi seraya menghardiknya dalam firmanNya (وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ ) “Allah Maha Mengetahui apa yang mereka kerjakan” berupa kejahatan dan kerusakan dan akan membalas mereka atas perbuatannya. Pelajaran dari ayat : • Kebenaran al-Qur’an yang telah memberitakan mengenai ketamakan orang-orang Yahudi untuk hidup di dunia, walaupun kehidupan itu rendah lagi tercela. Hal ini terlihat dari perilaku mereka hingga hari ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 96: Ketahuilah bahwasannya orang yahudi adalah dari golongan manusia sangat cinta dunia dan terjerat kehidupan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Dia akan memberikan balasan terhadap amal yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 96",
    "description": "Dan tidak saja mereka enggan segera mati, sungguh demi tuhanmu, engkau, wahai Muhammad, akan mendapati mereka, yakni orang-orang yahudi yang mengaku kekasih Allah itu, manusia yang paling tamak atas kehidupan dunia, bahkan lebih tamak dari orang-orang musyrik, karena orang musyrik sejak semula tidak percaya kepada wujud tuhan dan akhirat. Ini berbeda dengan orang-orang yahudi yang mengakui wujud tuhan dan keniscayaan akhirat. Betapa tamaknya mereka, sehingga masing-masing dari mereka ingin diberi umur seribu tahun, yakni hidup selama mungkin di dunia, padahal seandainya mereka diberi umur sepanjang apa pun, umur panjang itu tidak akan menjauhkan mereka dari azab. Dan masing-masing akan mendapat sanksi sesuai dosa-dosanya karena Allah maha melihat apa yang mereka kerjakan. Dalam satu riwayat disebutkan bahwa orang-orang yahudi berkata, kami benci jibril karena ia membawa bencana dengan menyampaikan wahyu bukan kepada golongan kami. Ia juga membongkar rahasia kami. Menjawab pernyataan itu, katakanlah, wahai nabi Muhammad, barang siapa menjadi musuh jibril maka ketahuilah bahwa dia hanya akan mendapatkan keburukan, karena sesungguhnya dialah, jibril, yang telah menurunkan Al-Qur'an ke dalam hatimu dengan izin Allah, bukan atas kehendaknya sendiri dan bukan pula atas kehendakmu. Dengan demikian, memusuhi jibril sama dengan memusuhi Allah. Sungguh aneh kalau kamu memusuhinya padahal wahyu-wahyu yang disampaikannya membenarkan apa yang terdahulu, yakni kitab-kitab suci termasuk taurat, dan wahyu-wahyu itu juga menjadi petunjuk serta berita gembira bagi orang-orang beriman. Memusuhi jibril berarti memusuhi Allah, dan memusuhi Allah berarti memusuhi semua makhluk-Nya yang taat. Bila seseorang memusuhi Allah, maka Allah pun akan memusuhi nya dan menjauhkan rahmat darinya."
  }
]