[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah -wahai rasul- kepada kaum Yahudi ketika mereka mengatakan, “sesungguhnya Jibril adalah musuh kami dari bangsa malaikat”, barangsiapa menjadi musuh bagi Jibril maka sesungguhnya dia menurunkan Alquran ke dalam hatimu dengan izin Allah Subhanahu Wa Ta'ala yang membenarkan apa yang lalu dari kitab-kitab Allah , dan menunjukkan kepada jalan kebenaran, dan memberikan kabar gembira bagi orang-orang yang membenarkan (beriman) kepadanya dengan segala kebaikan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Katakanlah -wahai Nabi- kepada orang-orang Yahudi yang berkata, “Sesungguhnya Jibril adalah musuh kami dari bangsa Malaikat”, “Barangsiapa memusuhi Jibril, sesungguhnya Jibril adalah Malaikat yang menurunkan Al-Qur`ān ke dalam hatimu dengan izin Allah, yang membenarkan kitab-kitab suci yang datang sebelumnya, seperti Taurat dan Injil, serta menunjukkan kebajikan dan memberikan kabar gembira kepada orang-orang mukmin tentang kenikmatan yang telah Allah siapkan untuk mereka. Maka siapapun yang memusuhi Malaikat yang memiliki sifat dan pekerjaan semacam itu ia termasuk golongan orang-orang yang sesat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97-98. Allah memerintahkan Nabi Muhammad untuk menjawab orang-orang Yahudi yang memusuhi malaikat Jibril dengan berfirman: “Barangsiapa yang menjadi musuh bagi Jibril, maka sesungguhnya Jibril itu yang menurunkan al-Qur’an ke dalam hatimu dengan perintah Allah, yang merupakan kitab yang sesuai dengan kitab-kitab sebelumnya, di dalamnya terdapat petunjuk yang sempurna dan kabar gembira di dunia dan di akhirat bagi orang-orang yang beriman. Dan barangsiapa yang memusuhi Allah dengan menyelisihi agama-Nya, memusuhi para malaikat dengan membenci mereka, dan memusuhi Rasul-Rasul-Nya dengan mendustakan mereka, maka Allah akan menjadi musuh bagi orang-orang yang ingkar tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. قُلْ مَنْ كَانَ عَدُوًّا لِجِبْرِيلَ (Katakanlah: “Barang siapa yang menjadi musuh Jibril) Ayat ini diturunkan sebagai jawaban untuk orang-orang Yahudi yang mengaku bahwa Jibril adalah musuh mereka sedangkan Mikail adalah teman mereka. Dan yang menjadi sebab mereka mengatakan itu adalah perdebatan yang terjadi antara mereka dengan Rasulullah dalam hal kenabiannya. Mereka berkata kepada Rasulullah: andai saja temanmu itu bukan Jibril kami pasti menjadi pengikutmu dan beriman kepadamu. Rasulullah berkata: apa yang menghalangi kalian untuk membenarkannya? Mereka berkata: karena dia adalah musuh kami. فَإِنَّهُ نَزَّلَهُ عَلَىٰ قَلْبِكَ (maka sesungguhnya Jibril itu telah menurunkannya (Al Quran) ke dalam hatimu) Yakni Jibril menurunkan al-Qur’an ke dalam hati Nabi Muhammad Shallallahu ‘Alaihi Wasallamsecara bertahap untuk meneguhkan hatinya. Dan hal ini adalah bukti kemuliaan dan ketinggian derajat Jibril dan tidak ada hal yang menjadi pembenaran atas permusuhan orang-orang Yahudi terhadapnya; dan tidaklah ada yang datang dari Jibril kecuali hal-hal yang menumbuhkan kecintaan kepadanya, bukan malah permusuhan. Dan tugas menurunkan kitab bukanlah suatu dosa, karena kitab yang diturunkan adalah kitab Allah yang malah membenarkan apa yang ada dalam kitab Taurat (dan menjadi petunjuk serta berita gembira bagi orang-orang yang beriman)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai Rosul, katakanlah kepada kaum Yahudi yang memusuhi Jibril, bahwa mereka akan ditimpa azab dan Baitul Muqoddas akan dihancurkan oleh Bahtanshor atau lainnya: Barang siapa memusuhi Jibril, maka ketahuilah bahwa atas kehendak dan izin Allah Jibril telah menurunkan Alquran ke dalam hatimu, bukan atas kehendak Jibril sendiri. Alquran diturunkan sebagai pembenaran dari kitab-kitab Allah yang terdahulu seperti Taurat dan Injil. Kemudian juga sebagai petunjuk agar manusia tidak tersesat, dan memberi kabar gembira tentang balasan yang baik. Imam Ath Thabari berkata bahwa ijma’ ulama’ men-ta’wili ayat ini sebagai jawaban kepada Yahudi Bani Israil, karena mereka menganggap Jibril sebagai musuh dan Mikail sebagai wali/kekasih mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapa yang menjadi musuh Jibril” Padahal, dialah yang telah menurunkannya} menurunkan Al-Qur’an {ke dalam hatimu dengan izin Allah sebagai pembenaran terhadap apa yang ada di antaranya} terhadap kitab-kitab sebelumnya {dan petunjuk serta berita gembira bagi orang-orang beriman.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98. Maksudnya, katakanlah kepada orang-orang yahudi yang mengklaim bahwasanya hal yang menghalangi mereka dari beriman adalah bahwa jibril, walimu (Muhammad), seandainya dia adalah berupa malaikat-malaikat Allah yang lain selain jibril, niscaya mereka beriman kepadamu dan mempercayaimu. Sesungguhnya klaim seperti ini saling bertentangan dan merupakan kesombongan terhadap Allah, karena jibril itu adalah malaikat yang turun dengan membawa al-Qur’an dari Allah kepada hatimu, dan dialah yang turun juga kepada para Nabi sebelummu, dan Allah-lah yang memerintahkan dengan tugas seperti itu, maka dia sebatas malaikat yang diutus, padahal kitab yang diturunkan oleh jibril itu telah membenarkan apa yang telah lewat dari kitab-kitab sebelumnya dan tidak menyelisihi dan bertentangan dengannya. Kitab ini berisi petunjuk yang sempurna dari segala bentuk kesesatan, juga berisi kabar gembira tentang kebaikan dunia dan akhirat bagi orang yang beriman kepadanya, maka permusuhan terhadap jibril yang dijelaskan sifat-sifatnya diatas adalah sebuah pengingkaran terhadap allah dan ayat-ayatNya serta permusuhan kepada Allah, kepada Rosul-rosulnya dan malaikat-malaikatNya. Sesungguhnya permusuhan mereka terhadap jibril bukanlah kepada jibril pribadi, namun juga terhadap al-Qur’an yang dibawa olehnya dari sisi Allah berupa kebenaran (yang di turunkan) kepada Rosul-rosul Allah, maka permusuhan dan pengingkaran itu mencakup kepada Dzat yang menyuruhnya turun dan kepada al-Qur’an yang diturunkan olehNya serta kepada Rosul yang diturunkan kitab itu kepadanya, inilah maksud dari hal itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { جِبۡرِيلَ } Jibriil : Malaikat yang mendapat tugas untuk menyampaikan wahyu yang diturunkan kepada Rasulullah ﷺ { نَزَّلَهُۥ عَلَىٰ قَلۡبِكَ } Nazzalahu ‘ala qolbika : Jibril menurunkan al-Qur’an ke dalam hati Rasulullah ﷺ { مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ } Mushaddiqan limaa baina yadaihi : Al-Qur’an membenarkan berita yang ada pada kitab-kitab terdahulu mengenai sifat Rasul dan kabar gembira tentang kedatangannya, mengabarkan tentang tauhid, dan kewajiban tunduk kepada Allah Ta’ala. Makna ayat : Pada ayat 97 Allah Ta’ala memerintahkan rasulNya untuk membantah perkataan orang Yahudi “Kalau seandainya malaikat yang datang kepadamu itu Mikail, tentu kami beriman kepadamu, akan tetapi yang menurunkannya adalah Jibril. Kami tidak mau beriman, karena Jibril adalah musuh kami dan dia datang membawa adzab.” Dengan firmanNya (قُلۡ مَن كَانَ عَدُوّٗا لِّـجِبۡرِيلَ ) “Katakanlah, barangsiapa yang menjadi musuh bagi Jibril” maka matilah dengan kebencian dan kedengkiannya itu. Karena malaikat Jibril yang menurunkan wahyu al-Qur’an dengan izin Allah ke dalam hatimu wahai RasulNya, yang mana al-Qur’an membenarkan seluruh kitab-kitab sebelumnya, dan sebagai petunjuk yang menerangi jalan dan kabar gembira bagi orang-orang mukmin dan shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 97: Kemudian Allah memerintahkan nabi-Nya agar berkata kepada orang-orang yahudi: ketahuilah wahai yahudi bahwasannya barang siapa yang menjadi jibril maka dia akan adalah musuh Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dari Ibnu Abbas ia berkata, \"Orang-orang Yahudi datang menghadap Rasulullah shallallahu 'alaihi wa sallam dan berkata, \"Wahai Abul Qasim! Sesungguhnya kami akan bertanya kepadamu lima perkara. Jika Engkau dapat menjawabnya, maka kami mengetahui bahwa engkau adalah seorang Nabi dan kami akan mengikutimu.\" Maka Beliau mengambil janji dari mereka sebagaimana Isra'il (Nabi Ya'qub) mengambil janji dari anak-anaknya ketika mereka berkata, \"Allah menjadi saksi terhadap apa yang kita katakan.\" Beliau bersabda, \"Sebutkanlah!\" Mereka berkata, \"Beritahukanlah kepada kami tanda seorang nabi!\" Beliau bersabda, \"Kedua matanya tidur, namun hatinya tidak tidur.\" Mereka berkata, \"Beritahukanlah kepada kami bagaimana seorang wanita bisa melahirkan wanita dan bisa melahirkan laki-laki! Beliau bersabda, \"Kedua air mani menyatu, jika mani laki-laki mengalahkan mani wanita, maka lahirlah anak laki-laki. Tetapi, jika mani wanita mengalahkan mani laki-laki, maka lahirlah anak perempuan.\" Mereka berkata lagi, \"Beritahukanlah kepada kami apa yang diharamkan Isra'il (Nabi Ya'qub) terhadap dirinya!\" Beliau menjawab, \"Ia (Nabi Ya'qub) merasakan penyakit 'irqun nasaa (semacam encok) dan tidak mendapatkan sesuatu yuang menyembuhkannya selain susu ini dan itu (Perawi yang bernama Abdullah berkata, \"Bapakku berkata: Sebagian mereka berkata, \"Maksudnya adalah unta\", maka ia mengharamkan daging unta). Mereka berkata, \"Engkau benar.\" Mereka pun bertanya lagi, \"Beritahukanlah kami tentang guruh ini!\" Beliau menjawab, \"Salah satu di antara malaikat Allah yang diserahkan mengurus awan, di tangannya ada sabetan dari api untuk menyabet awan dan mengarahkannya ke tempat yang diperintahkan Allah.\" Mereka bertanya lagi, \"Apa suara yang terdengar ini?\" Beliau menjawab, \"Suaranya.\" Mereka merkata, \"Engkau Benar, namun tinggal satu lagi yang menjadi sebab kami akan membai'atmu jika kamu mau memberitahukannya, karena tidak ada satu pun nabi kecuali ada malaikat yang datang kepadanya membawa berita, maka beritahukanlah kepada kami, siapa kawanmu?\" Beliau menjawab, \"Jibril ''alaihis salam.\" Mereka berkata, \"Jibril adalah malaikat yang turun membawa peperangan dan azab yang menjadi musuh kami. Jika engkau mengatakan \"Mikail\", malaikat yang menurunkan rahmat, tumbuhan dan hujan tentu (kami akan bai'at).\" Maka Allah menurunkan ayat di atas. (Al Haitsami berkata dalam Majma'uz Zawaa'id juz 8 hal. 242, \"Diriwayatkan oleh Ahmad, Thabrani, dan para perawi keduanya tsiqah. Abu Nu'aim juga meriwayatkan dalam Al Hilyah juz 4 hal. 305. hadits tersebut dalam sanadnya ada Bukair bin Syihab. Al haafizh dalam At Taqrib berkata, \"Makbul\", yakni jika ada mutaba'ah, namun jika tidak ada maka layyin (lunak), sebagaimana diingatkan olehnya dalam mukadimahnya. Akan tetapi hadits ini memiliki jalan-jalan kepada Ibnu Abbas sebagaimana dalam tafsir Ibnu Jarir, di antaranya adalah apa yang disebutkan oleh Imam Ahmad juz 1 hal. 278; dari Hasyim bin Qasim, dari Abdul Hamid dari Syahr dari Ibnu Abbas. Syahr ini adalah Syahr bin Hausyab yang diperselisihkan oleh ulama, namun yang rajih bahwa dia adalah dha'if dari sisi hapalannya, tetapi bisa dipakai dalam hal syahid dan mutaba'ah. Hadits tersebut juga diriwayatkan oleh Thayalisi juz 2 hal. 11, Ibnu Jarir juz 1 hal. 431, Ibnu Sa'ad juz 1 Qaf 1 hal. 116 dari jalan Syahr bin Hausyab dari Ibnu Abbas. Ibnu Jarir menyebutkan adanya ijma' dari para ulama bahwa ayat di atas turun sebagai jawaban terhadap orang-orang Yahudi, ketika mereka menyatakan bahwa Jibril musuh mereka dan Mikail sebagai kawan mereka. Dengan demikian, ijma' menguatkan kedua jalan yang memiliki kelemahan tersebut. Orang-orang Yahudi mencari-cari alasan, mereka tidak mau beriman karena wali Nabi Muhammad shallallahu 'alaihi wa sallam adalah malaikat Jibril, jika sekiranya selain malaikat Jibril, tentu mereka akan beriman. Alasan seperti ini tidak bisa diterima, karena malaikat Jibril yang menurunkan Al Qur'an dari sisi Allah ke dalam hati Nabi Muhammad shallallahu 'alaihi wa sallam, dia juga yang menurunkan kitab-kitab kepada para nabi sebelumnya. Allah yang memerintahkan dan mengirimnya dengan membawa kitab itu, tugasnya adalah sebagai utusan semata. Di samping itu, kitab yang dibawanya membenarkan kitab-kitab sebelumnya, tidak menyalahi atau bertentangan, di dalamnya terdapat petunjuk yang sempurna dari semua bentuk kesesatan, terdapat kabar gembira memperoleh kebaikan di dunia dan akhirat bagi yang beriman. Memusuhi Jibril yang disebutkan sifatnya itu merupakan kekafiran kepada Allah dan ayat-ayat-Nya, demikian juga sama saja memusuhi Allah, rasul-rasul-Nya dan malaikat-malaikat-Nya. Ia sama saja mengingkari dan memusuhi yang menurunkan dan mengutusnya, mengingkari kitab yang dibawanya dan memusuhi orang yang mendapatkan kitab itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 97",
    "description": "Dalam satu riwayat disebutkan bahwa orang-orang yahudi berkata, kami benci jibril karena ia membawa bencana dengan menyampaikan wahyu bukan kepada golongan kami. Ia juga membongkar rahasia kami. Menjawab pernyataan itu, katakanlah, wahai nabi Muhammad, barang siapa menjadi musuh jibril maka ketahuilah bahwa dia hanya akan mendapatkan keburukan, karena sesungguhnya dialah, jibril, yang telah menurunkan Al-Qur'an ke dalam hatimu dengan izin Allah, bukan atas kehendaknya sendiri dan bukan pula atas kehendakmu. Dengan demikian, memusuhi jibril sama dengan memusuhi Allah. Sungguh aneh kalau kamu memusuhinya padahal wahyu-wahyu yang disampaikannya membenarkan apa yang terdahulu, yakni kitab-kitab suci termasuk taurat, dan wahyu-wahyu itu juga menjadi petunjuk serta berita gembira bagi orang-orang beriman. Memusuhi jibril berarti memusuhi Allah, dan memusuhi Allah berarti memusuhi semua makhluk-Nya yang taat. Bila seseorang memusuhi Allah, maka Allah pun akan memusuhi nya dan menjauhkan rahmat darinya. Barang siapa menjadi musuh Allah dengan memusuhi salah satu makhluk-Nya yang taat, atau memusuhi salah satu dari malaikatmalaikat-Nya, atau salah seorang dari rasul-rasul-Nya, atau jibril yang membawa wahyu dan mikail yang pembawa rezeki, maka sesungguhnya dia telah kafir dan mengantar dirinya menuju kebinasaan. Sesungguhnya Allah musuh bagi orang-orang kafir. Dua ayat di atas menegaskan dua hal. Pertama, Allah tidak membedabedakan para rasul dan malaikat-Nya. Kepercayaan, ketaatan, dan kecintaan kepada mereka adalah satu paket. Siapa pun yang memusuhi mereka atau salah seorang dari mereka, maka ia akan menjadi musuh Allah. Kedua, sanksi kepada pelanggar tidak hanya diterapkan kepada orang yahudi, tetapi kepada siapa saja yang kafir dan memusuhi-Nya."
  }
]