[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa memusuhi Allah, para malaikat, dan rasul-rasul-Nya baik dari kalangan malaikat atau manusia, terutama dua malaikat Allah Jibril dan Mikail, karena kaum Yahudi mengklaim bahwa Jibril adalah musuh mereka, dan Mikail adalah penolong mereka. Maka Allah memberitahukan kepada mereka bahwa Siapa saja yang memusuhi salah satu dari mereka maka berarti dia juga memusuhi yang lain, bahkan juga memusuhi Allah, karena sesungguhnya Allah menjadi musuh bagi orang-orang yang mengingkari apa yang dia turunkan kepada Muhammad Shallallahu Alaihi Wasallam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Barangsiapa memusuhi Allah, malaikat-malaikat-Nya dan rasul-rasul-Nya, dan memusuhi dua Malaikat yang didekatkan, yaitu Jibril dan Mikail, sesungguhnya Allah adalah musuh bagi orang-orang yang kafir dari golongan kalian maupun dari golongan lain. Dan barangsiapa yang Allah menjadi musuhnya berarti ia mendapatkan kerugian yang nyata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. مَنْ كَانَ عَدُوًّا لِلَّهِ وَمَلَائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ (Barang siapa yang menjadi musuh Allah, malaikat-malaikat-Nya, rasul-rasul-Nya, Jibril dan Mikail) Malaikat yang disebutkan Namanya hanya Jibril dan Mikail dengan tujuan memuliakan keduanya. Meskipun keduanya merupakan termasuk dalam golongan malaikat akan tetapi memiliki keistimewaan derajat daripada golongan malaikat yang lainnya. فَإِنَّ اللَّهَ عَدُوٌّ لِلْكَافِرِينَ(maka sesungguhnya Allah adalah musuh orang-orang kafir) Yakni musuh kalian wahai orang-orang Yahudi disebabkan kalimat kufur yang kalian ucapkan. Karena barangsiapa yang memusuhi kekasih-kehasih Allah dan tantara-tentara-Nya berarti ia telah memusuhi Allah dan kafir terhadap-Nya; Allah akan memusuhinya dan membuat perhitungan dengannya. Dan permusuhan ini menjerumuskan orang yang melakukannya kedalam kekufuran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Barangsiapa memusuhi Allah dan malaikat-Nya, memusuhi Jibril dan Mikail, maka dia telah kafir, Allah memusuhi orang-orang kafir. Siapapun yang memusuhi wali-wali Allah maka Allah memusuhinya juga. Allah memusuhi dan mencela mereka. Adapun Allah mengkhususkan Jibril dan Mikail dengan menyebutnya, karena Jibril dan Mikail adalah dua malaikat yang paling mulia diantara malaikat lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang menjadi musuh Allah, malaikat-malaikatNya, rasul-rasulNya, Jibril dan Mikail, maka sesungguhnya Allah adalah musuh orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98. Maksudnya, katakanlah kepada orang-orang yahudi yang mengklaim bahwasanya hal yang menghalangi mereka dari beriman adalah bahwa jibril, walimu (Muhammad), seandainya dia adalah berupa malaikat-malaikat Allah yang lain selain jibril, niscaya mereka beriman kepadamu dan mempercayaimu. Sesungguhnya klaim seperti ini saling bertentangan dan merupakan kesombongan terhadap Allah, karena jibril itu adalah malaikat yang turun dengan membawa al-Qur’an dari Allah kepada hatimu, dan dialah yang turun juga kepada para Nabi sebelummu, dan Allah-lah yang memerintahkan dengan tugas seperti itu, maka dia sebatas malaikat yang diutus, padahal kitab yang diturunkan oleh jibril itu telah membenarkan apa yang telah lewat dari kitab-kitab sebelumnya dan tidak menyelisihi dan bertentangan dengannya. Kitab ini berisi petunjuk yang sempurna dari segala bentuk kesesatan, juga berisi kabar gembira tentang kebaikan dunia dan akhirat bagi orang yang beriman kepadanya, maka permusuhan terhadap jibril yang dijelaskan sifat-sifatnya diatas adalah sebuah pengingkaran terhadap allah dan ayat-ayatNya serta permusuhan kepada Allah, kepada Rosul-rosulnya dan malaikat-malaikatNya. Sesungguhnya permusuhan mereka terhadap jibril bukanlah kepada jibril pribadi, namun juga terhadap al-Qur’an yang dibawa olehnya dari sisi Allah berupa kebenaran (yang di turunkan) kepada Rosul-rosul Allah, maka permusuhan dan pengingkaran itu mencakup kepada Dzat yang menyuruhnya turun dan kepada al-Qur’an yang diturunkan olehNya serta kepada Rosul yang diturunkan kitab itu kepadanya, inilah maksud dari hal itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : { وَمِيكَىٰلَ } Mikaal : Dibaca dengan Miikaal atau Mikail yaitu nama salah satu Malaikat mulia. Ada yang mengatakan bahwa Nama Mikail artinya sama dengan Ubaidillah. Makna ayat : Pada ayat 98 Allah Ta’ala memberitahukan bahwa siapa saja yang memusuhi Allah dan memusuhi wali-waliNya dari kalangan malaikat dan rasul-rasulNya, secara khusus malaikat Jibril maka dia kafir. Allah akan menjadi musuhnya dan bagi orang-orang kafir yang lainnya. Pelajaran dari ayat : • Permusuhan Allah terhadap orang-orang kafir. Oleh karena itu wajib bagi orang mukmin untuk memusuhi orang-orang kafir karena mereka memusuhi Allah, dan Allah Ta’ala memusuhi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 98: Allah menjelaskan bahwasannya barangsiapa yang memusuhi Allah, Malaikat-malaikatnya, Rasul-rasul-Nya, dan jibril serta mikail; maka sesungguhnya Allah adalah musuh bagi orang-orang kafir yang menolak kebenaran dan yang diturunkan kepada Muhammad ﷺ ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang Yahudi menganggap Jibril sebagai musuh mereka, sedangkan Mikail sebagai wali mereka, maka pada ayat di atas Allah memberitahukan bahwa barang siapa yang memusuhi salah satunya, sama saja memusuhi yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 98",
    "description": "Barang siapa menjadi musuh Allah dengan memusuhi salah satu makhluk-Nya yang taat, atau memusuhi salah satu dari malaikatmalaikat-Nya, atau salah seorang dari rasul-rasul-Nya, atau jibril yang membawa wahyu dan mikail yang pembawa rezeki, maka sesungguhnya dia telah kafir dan mengantar dirinya menuju kebinasaan. Sesungguhnya Allah musuh bagi orang-orang kafir. Dua ayat di atas menegaskan dua hal. Pertama, Allah tidak membedabedakan para rasul dan malaikat-Nya. Kepercayaan, ketaatan, dan kecintaan kepada mereka adalah satu paket. Siapa pun yang memusuhi mereka atau salah seorang dari mereka, maka ia akan menjadi musuh Allah. Kedua, sanksi kepada pelanggar tidak hanya diterapkan kepada orang yahudi, tetapi kepada siapa saja yang kafir dan memusuhi-Nya konteks ayat ini adalah bagian dari bantahan Allah terhadap orangorang yahudi. Namun demikian, siapa pun yang berperilaku seperti disebut dalam ayat ini, maka mereka disebut fasik. Dan demi tuhan, tidaklah wajar bila orang-orang yahudi itu atau siapa pun menolak kebenaran Al-Qur'an karena sungguh kami, dengan menugaskan jibril, telah menu runkan ayat-ayat yang jelas kandungannya serta bukti-bukti kebenarannya dan kebenaranmu sebagai rasul kepadamu, Muhammad. Dan tidaklah ada yang mengingkarinya, baik dari golongan manusia yang hidup pada masamu atau sesudahmu, selain orang-orang fasik. Bukti-bukti kebenaran Al-Qur'an sudah sangat jelas; tidak ada yang mengingkarinya selain mereka yang tertutup mata hatinya. Mereka itulah yang disebut sebagai orang-orang fasik."
  }
]