[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah menurunkan kepadamu -wahai Rasul- tanda-tanda, penjelasan kebenaran yang paling jelas, yang menunjukkan bahwa kamu adalah Rasul dari Allah secara benar dan hak, dan tidak ada yang mengingkari ayat-ayat itu kecuali orang-orang yang keluar dari agama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Dan sungguh Kami telah menurunkan kepadamu -wahai Nabi- tanda-tanda jelas yang menunjukkan kebenaranmu dalam hal kenabian dan wahyu yang engkau bawa. Tidak ada yang mengingkari tanda-tanda itu kecuali orang-orang yang keluar dari agama Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Sungguh Kami telah menurunkan kepadamu -karena keagungan dan kekuasaan Kami- hai Rasulullah, bukti-bukti yang jelas dan terang yang menunjukkan kebenaran risalahmu; dan tidak ada orang yang mendustakannya melainkan orang yang menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَلَقَدْ أَنْزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ ۖ (sesungguhnya Kami telah menurunkan kepadamu ayat-ayat yang jelas) Yakni sesungguhnya ayat-ayat yang diturunkan kepadamu dalam perihal orang-orang Yahudi ini adalah tanda-tanda yang jelas atas kenabianmu. وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ (dan tak ada yang ingkar kepadanya, melainkan orang-orang yang fasik) Yakni karena begitu jelasnya ayat-ayat ini maka tidak ada yang kafir terhadapnya kecuali orang yang telah keluar dari perintah Allah dan mengikuti hawa nafsunya sebagaimana orang-orang Yahudi yang berdebat dengan Nabi Muhammad Shallallahu ‘Alaihi Wasallambukan untuk mencari kebenaran untuk mereka ikuti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Wahai nabi, Kami telah menurunkan kepada kamu tanda dan bukti kenabianmu, karena tanda dan bukti itu sangat jelas dan terang, sehingga hanya orang-orang fasik-lah yang tidak mempercayaimu. Mereka telah keluar dari perintah Allah. Ibnu Abu Hatim meriwayatkan dari Ibnu Abbas bahwa Abdullah bin Suraya bertanya kepada Nabi SAW : Wahai Muhammad, Engkau datang kepada kami membawa agama yang belum kami ketahui, namun ayat yang Allah wahyukan kepadamu adalah ayat-ayat yang jelas dan menjelaskan. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menurunkan ayat-ayat yang jelas kepadamu} bukti-bukti yang jelas {dan tidaklah ada yang mengingkarinya selain orang-orang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Allah berfirman kepada NabiNya, Muhammad Sholallohu 'alaihi wasallam, “Dan sungguh Kami telah menurunkan kepadamu ayat-ayat yang jelas, ” yang dapat diperoleh darinya petunjuk bagi orang yang mencari hidayah, dan menegakkan hujjah atas orang yang menentangnya, di mana ayat-ayat itu dalam penjelasan dan penunjukannya (dilalah) kepada kebenaran sangatlah jelas, hingga tidak mungkin ditolak kecuali oleh orang-orang yang menyimpang dari perintah Allah dan bermaksiat dari ketaatan kepadaNya, serta berlaku sombong dengan kesombongannya yang besar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ءَايَٰتِۢ بَيِّنَٰتٖۖ } Aayatim bayyinaat : Yaitu ayat-ayat al-Qur’anul kariim yang jelas maknanya. { يَكۡفُرُ بِهَآ } Yakfuru bihaa : Mengingkarinya sebagai kitab Allah dan wahyuNya yang diturunkan kepada rasulNya Muhammad ﷺ { ٱلۡفَٰسِقُونَ } al-Faasiqun : Orang-orang yang menentang kewajiban yang seharusnya dilakukan seperti beriman kepada Allah dan tunduk kepadaNya secara lahir dan batin. Makna ayat : Masih saja ayat-ayat ini membicarakan tentang penetapan kenabian Rasulullah fdfa dan keumuman risalah yang dibawanya, serta bantahan terhadap orang-orang Yahudi dan menampakkan berbagai bentuk kefasikan, kekafiran dan kezhaliman mereka. Pada ayat 99 Allah Ta’ala membantah pernyataan seorang Yahudi yang bernama Ibnu Shuriya yang menyatakan kepada Nabi ﷺ “Engkau tidak membawa apa-apa kepada kami.” Maka Allah berfirman (وَلَقَدۡ أَنزَلۡنَآ إِلَيۡكَ ءَايَٰتِۢ بَيِّنَٰتٖۖ وَمَا يَكۡفُرُ بِهَآ إِلَّا ٱلۡفَٰسِقُونَ ) “Dan sesungguhnya Kami telah menurunkan kepadamu ayat-ayat yang jelas, dan tidaklah ada yang mengingkarinya kecuali orang-orang fasik.” Orang fasik yang dimaksud adalah A’war bin Shuriya seorang Yahudi. Pelajaran dari ayat : • Kefasikan pada umumnya dapat menyeret kepada kekafiran. Seorang hamba jika berbuat kefasikan dan terus menerus melanggar perintah-perintah Allah dan rasulNya, akan menyebabkan dia mengingkari hal-hal yang Allah haramkan dan hal-hal yang Allah wajibkan, maka dengan hal itu dia menjadi kafir. Hanya kepada Allah kita berlindung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Baqarah ayat 99: Ketahuilah wahai nabi Allah diturunkan kepadamu ayat – ayat yang jelas sebagai bukti dan tidaklah menolak ayat ini kecuali fasik dan perintah Rabb-Nya dan keluar dari ketaatan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di mana dengan ayat-ayat tersebut orang yang mencari petunjuk akan memperolehnya, dengan ayat-ayat tersebut hujjah tegak kepada orang-orang yang tetap kafir. Karena begitu jelas dan penuh dengan kebenaran sampai-sampai tidak ada yang menolaknya kecuali orang-orang yang fasik; keluar dari keta'atan kepada Allah Azza wa Jalla dan bersikap sombong."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Baqarah Ayat 99",
    "description": "Konteks ayat ini adalah bagian dari bantahan Allah terhadap orangorang yahudi. Namun demikian, siapa pun yang berperilaku seperti disebut dalam ayat ini, maka mereka disebut fasik. Dan demi tuhan, tidaklah wajar bila orang-orang yahudi itu atau siapa pun menolak kebenaran Al-Qur'an karena sungguh kami, dengan menugaskan jibril, telah menu runkan ayat-ayat yang jelas kandungannya serta bukti-bukti kebenarannya dan kebenaranmu sebagai rasul kepadamu, Muhammad. Dan tidaklah ada yang mengingkarinya, baik dari golongan manusia yang hidup pada masamu atau sesudahmu, selain orang-orang fasik. Bukti-bukti kebenaran Al-Qur'an sudah sangat jelas; tidak ada yang mengingkarinya selain mereka yang tertutup mata hatinya. Mereka itulah yang disebut sebagai orang-orang fasik. Ayat ini berisi kecaman dengan redaksi pertanyaan yang mengandung bukti-bukti yang dipaparkan oleh Allah. Dan mengapa setiap kali mereka mengikat janji dengan Allah, ter masuk janji untuk percaya jika nabi yang diutus-Nya datang, sekelompok mereka melanggarnya, menyepelekannya, dan mengingkarinya' sedikit sekali dari mereka yang menepati janji, sedang kan sebagian besar mereka tidak beriman. Sikap-sikap buruk sudah berkumpul sedemikian rupa dalam diri sebagian besar bani israil. Mereka adalah pendengki, keras kepala, licik, dan selalu mengingkari janji. Namun demi kian, masih ada sebagian kecil dari mereka yang beriman."
  }
]