[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Alif lam ra. Keterangan tentang huruf-huruf yang terpisah-pisah (seperti ini) telah berlalu dimuka pada permulaan surat al-baqarah. Al-qur’an ini adalah kitab yang kami wahyukan kepadamu -wahai rasul-, agar dengan itu kamu mengeluarkan manusia dari kesesatan dan penyimpangan menuju dan hidayah dan cahaya, -dengan izin tuhan mereka dan taufikNya-, menuju islam yang merupakan jalan menuju Allah yang Mahakuasa lagi Mahaterpuji dalam segala keadaan. Allah yang milikNya semua yang ada di langit dan semua yang ada di bumi, sebagai ciptaan dan milikNya dan dibawah kendaliNya. Maka Dialah yang peribadahan wajib diarahkan kepadaNya semata. Dan akan menimpa kepada orang-orang yang tidak beriman kepada Allah dan tidak mengikuti rasul-Nya pada hari kiamat nanti kebinasaan dan siksaan pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah. Al-Qur`ān ini adalah sebuah kitab yang Kami turunkan kepadamu -wahai Rasul- agar kamu mengeluarkan manusia dari kekufuran, kebodohan dan kesesatan menuju iman, ilmu dan hidayah kepada agama Islam yang merupakan jalan Allah yang Maha Perkasa yang tidak dikalahkan oleh siapapun, yang Maha Terpuji dalam segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Pada awal surat al-Baqarah telah disebutkan penjelasan tentang huruf muqattha’ah, dan hikmah dari huruf-huruf ini adalah untuk menjelaskan mukjizat al-Qur’an. Hai Rasulullah, Al-Qur’an yang mulia yang Kami turunkan -dengan kekuasaan dan keagungan Kami- kepadamu ini agar kami dapat mengeluarkan manusia dan jin dari gelapnya kekafiran dan kejahilan menuju cahaya keimanan dan hidayah dengan kehendak Sang Pencipta dan Pengatur urusan mereka; yaitu menuju agama Islam yang merupakan jalan Allah dalam kerajaan-Nya yang selalu terpuji dalam segala keadaan, jalan Allah Yang Memiliki segala yang ada di langit dan bumi yang tujuh. Adapun kebinasaan dan azab yang keras diperuntukkan bagi orang-orang yang mendustakan Allah dan para rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. كِتٰبٌ أَنزَلْنٰهُ إِلَيْكَ ((Ini adalah) Kitab yang Kami turunkan kepadamu) Yakni wahai Muhammad ini adalah al-Qur’an, kitab yang Kami turunkan kepadamu. لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمٰتِ إِلَى النُّورِ(supaya kamu mengeluarkan manusia dari gelap gulita kepada cahaya terang benderang) Dari gelapnya kekafiran, kebodohan, dan kesesatan menuju cahaya keimanan, ilmu, dan hidayah. بِإِذْنِ رَبِّهِمْ(dengan izin Tuhan mereka) Dengan izin Allah kepadamu untuk mengajari dan menyeru mereka kepada keimanan. Atau maknanya adalah bahwa tidak ada orang yang masuk kedalam cahaya keimanan kecuali dengan izin Allah. إِلَىٰ صِرٰطِ الْعَزِيزِ الْحَمِيدِ (menuju jalan Tuhan Yang Maha Perkasa lagi Maha Terpuji) Yakni jalan Allah yang jelas yang disyariatkan bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Alif, laam raa. Sebagai penekanan dan penetapan mukjizat Alquran, sebagaimana yang telah dijelaskan dalam surat-surat sebelumnya. Ini adalah Kitab yang Kami turunkan kepadamu supaya kamu wahai Nabi untuk mengeluarkan manusia dari kegelapan kekafiran, kebodohan dan kesesatan menuju menuju cahaya keimanan, ilmu dan hidayah yang terang benderang dengan izin, taufik dan kemudahan dari Tuhan mereka. Yaitu menuju jalan Tuhan Yang Maha Perkasa, Yang Menguasai kerajaan-Nya, Maha Menguasai para hamba-Nya, Yang Maha Terpuji atas setiap keadaan, dan Yang berhak atas segala pujian atas segala anugerah nikmat-Nya. FirmanNya {Ila shirath} adalah bayan bagi nur yang disebutkan terlebih dulu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Rā Kitab} Al-Qur’an ini {yang Kami turunkan kepadamu agar kamu mengeluarkan manusia dari berbagai kegelapan menuju cahaya dengan izin Tuhan mereka} dengan perintah dan tuntunan Allah {menuju jalan} jalan {Tuhan Yang Maha perkasa lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah memberitahukan bahwa Dia telah menurunkan kitabNya kepada RasulNYa Muhammad, demi kemaslahatan para makhluk. Yaitu untuk mengentaskan manusia dari kegelapan kebodohan, kekufuran, dan perangai-perangai yang buruk serta beragam maksiat menuju cahaya ilmu, iman, dan akhlak yang baik. Firman Allah “dengan izin Rabb mereka”, maksudnya tidak akan terwujud hal yang mereka sukai karena (mencari ridha) Allah, mellainkan dengan kehendak dan pertolongan dari Allah. Hal ini mengandung anjuran bagi para hamba untuk meminta pertolongan Allah. Hal ini mengandung anjuran bagi para hamba untuk meminta bantuan kepada Rabb mereka. Kemudian Allah menerangkan arti ‘cahaya’ yang mana kitab ini memberi petunjuk mereka kepada cahaya itu seraya berfirman, “(Yaitu) menuju jalan Rabb Yang Maha Terpuji,” maksudnya jalan yang menghubungkan kepadaNya dan ke kampung kemuliaanNya, yang mencakup penguaasan imu kebenaran dan pengamalanya. Dalam penyebutan nama Allah al- ‘aziz dan al-Hamid (Yang Maha Perkasa lagi Maha Terpuji) sesudah penyebutan jalan yang menghubungkan menuju kemuliaanNya secara implisit, terkandung isyarat bahwa siapa saja yang menelusurinya (jalan tersebut), maka dia akan menjadi orang yang penuh kemuliaan dengan kemuliaan dari Allah, insan yang kuat meskipun tanpa pendukung kecuali Allah, terpuji dalam segala urusannya, dan akhir hidupnya pun baik. Itu semua sungguh membuktikan bahwa jalan Allah menjadi salah satu bukti kuat tentang kepemilikan Allah atas sifat-sifat yang sempurna dan agung, dan bahwa Dzat yang menegakkan jembatan tersebut adalah dzat yang mempunyai kekuasaan yang kuat, terpuji dalam setiap ucapan, tindakan dan ketetapan hukumnya, dan bahwa Dia diibadahi dengan berbagai jenis ibadah yang merupakan anak tangga menuju Sirath al-Mustaqim. Dan bahwa sebagaimana Allah menguasai kerajaan langit dan bumi, dalam aspek penciptaan, pemberian rizki dan pengaturan, maka Dia juga menguasai hak penetapan hukum atas hamba-hambaNya dengan hukum-hukum agama. Sebab mereka adalah miikNya, dan tidak sepantasnya bagi Allah membiarkan mereka begitu saja dengan sia-sia. Usai menerangkan dalil dan buktinya, maka Allah mengancam orang-orang yang tidak patuh terhadap ketentuan tersebut. Allah berfirman, “Dan celakalah orang-orang kafir karena siksaan yang sangat pedih,” yang tidak bisa diperkirakan kadar tingkat (kepedihaannya) dan tidak bisa dideskripsikan hakikat siksaanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (الٓرۚ) Alif Laam Raa : ini adalah salah satu dari huruf muqatha’ah, tertulis (الر) dan dibaca: Alif Laam Raa. Menyerahkan maknya lebih selamat, yaitu dengan perkataan: Allah lebih mengetahui maksud-Nya akan hal itu. (كِتَٰبٌ) kitaabun : kitab yang agung ini. (أَنزَلۡنَٰهُ إِلَيۡكَ) anzalnaahu ilaika : “Kami turunkan kepadamu.” Wahai Muhammad shallahu ‘alaihi wa sallam. (مِنَ ٱلظُّلُمَٰتِ) minazh zhulumaati : “dari kegelapan” dari kegelapan kufur menuju cahaya iman. (ٱلۡعَزِيزِ ٱلۡحَمِيدِ) al-‘aziizil hamiid : “Yang Maha Perkasa dan Maha Terpuji.” Yang Maha Terpuji karena nikmat-nikmat-Nya. Makna ayat : Firman-Nya ta’la : (الٓرۚ) Allah lebih mengetahui maksudnya, firman-Nya : (كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ) “Kitab yang Kami turunkan kepadamu.” Yaitu kitab yang mulia yang Kami turunkan kepadamu Wahai Rasul Kami! (لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ) “agar engkau mengeluarkan manusia dari kegelapan.” Yaitu kegelapann kufur dan kebodohan menuju cahaya iman dan ilmu syar’i, dan itu semua (بِإِذۡنِ رَبِّهِمۡ) “atas izin Rabbmu” dengan taufiq dan pertolongan-Nya (إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ) “menuju jalan Yang Maha Perkasa lagi Maha Terpuji.” Yaitu menuju jalan Yang Maha Perkasa, Yang Maha Mengalahkan dan Maha Terpuji yaitu Yang terpuji atas nikmat-nikmat dan karunia-Nya atas hamba-hamba-Nya dan seluruh makhluk. Pelajaran dari ayat : • Tegaknya hujjah atas mereka yang mendustakan Al-Qur’anul Karim, karena ia tersusun dari huruf-huruf yang terpotong seperti (الر) (طسم) (الم) (حم), namun mereka tidak mampu membuat yang semisalnya walau hanya satu surat. • Penjelasan bahwa kekufuran adalah kegelapan dan iman adalah cahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 1: Yakni gelapnya kebodohan, kekafiran, akhlak yang buruk serta berbagai kemaksiatan. Yakni cahaya pengetahuan, keimanan, akhlak yang mulia serta berbagai ketaatan. Dengan kehendak dan pertolongan-Nya. Dalam ayat ini terdapat dorongan kepada hamba agar meminta pertolongan kepada Tuhan mereka. Yang mengandung pengetahuan terhadap kebenaran dan pengamalannya. Menurut Syaikh As Sa’diy, disebutkan nama-Nya “Yang Mahaperkasa lagi Maha Terpuji” setelah menyebutkan jalan yang mengarah kepada-Nya sebagai isyarat, bahwa barang siapa yang menempuh jalan itu, maka ia menjadi orang yang mulia dengan kemuliaan dari Allah, dan menjadi orang yang kuat, meskipun ia tidak memiliki pembela selain Allah, lagi terpuji dalam segala urusannya dan berkesudahan baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 1",
    "description": "Surah ar-ra'd diakhiri dengan penegasan bahwa Allah dan orangorang yang diberi al-kitab akan menjadi saksi atas kebenaran risalah nabi Muhammad. Sebagai sambungannya, surah ibrahim ini lalu diawali dengan penjelasan bahwa Allah menurunkan Al-Qur'an kepada nabi Muhammad untuk mengajak manusia keluar dari kegelapan menuju cahaya dengan izin Allah. Alif laam raa'. Ini adalah kitab Al-Qur'an yang kami turunkan kepadamu, wahai nabi Muhammad, agar engkau mengeluarkan manusia dari kegelapan kemusyrikan kepada cahaya tauhid yang terang-benderang, dengan izin tuhan, yaitu menuju jalan tuhan yang mahaperkasa lagi maha terpuji. Allah yang mahaperkasa itulah yang memiliki apa saja yang ada di langit dan apa saja yang ada di bumi. Bukti-bukti tentang wujud, keesaan, dan kekuasaan Allah berulang kali dijelaskan, tetapi masih banyak orang yang mengingkari. Oleh sebab itu, celakalah bagi orang yang ingkar kepada tuhan karena mereka pasti akan mendapat siksaan yang sangat berat."
  }
]