[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Rasul-rasul mereka berkata, ”Apakah ada keragu-raguan tentang Allah dan kewajiban beribadah kepadaNYa, sedang Dia adalah pencipta langit dan bumi dan yang mengadakannya dari tidak ada, tanpa ada contoh sebelumnya? Dia menyeru kalian untuk beriman, supaya mengampuni dosa yang telah kalian lakukan berupa kesyirikan, dan juga mencegah siksaan berupa dibinasakan secara total dan memanjangkan waktu keberadaan kalian di dunia hingga masa yang telah di tentukanNya, yaitu berakhirnya ajal kalian, Sehinggga Dia tidak menyiksa kalian di dunia,” mereka berkata kepada rasul-rasul mereka, ”kami tidaklah melihat kalian kecuali manusia sifat-sifat kalian seperti sifat-sifat kami, tidak ada keunggulan bagi kalian atas kami yang menjadikan kalian pantas menjadi utusan-utusan (Allah) kalian hanya ingin menghalangi kami menyembah berhala-berhala dan patung-patung yang disembah oleh bapak-bapak kami dahulu. Karena itu, datangkanlah hujjah yang tampak jelas yang membuktikan kebenaran apa yang kalian ucapkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Para rasul mereka menjawab, \"Apakah dalam urusan Tauhid dan mengesakan Allah dalam beribadah masih ada keraguan sementara Dia lah Pencipta langit dan bumi, yang mengadakan keduanya tanpa contoh sebelumnya? Allah mengajak agar kalian beriman karena Allah hendak menghapus dosa-dosa masa lalu kalian dan menangguhkan kalian hingga masa ajal kalian yang ditetapkan di dalam kehidupan dunia kalian ini sempurna.\" Kaum mereka berkata, \"Kalian hanya manusia biasa seperti kami, kalian tidak mempunyai keistimewaan atas kami. Kalian hendak membelokkan kami dari menyembah apa yang disembah oleh nenek moyang kami, karena itu datangkanlah hujah yang jelas menunjukkan kebenaran kalian dalam apa yang kalian katakan kepada kami bahwa kalian adalah utusan-utusan Allah kepada kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Maka Para rasul mereka menjawab: “Apakah dalam keesaan Allah dan penyembahan kepada-Nya terdapat keraguan, padahal Dia adalah Pencipta tujuh langit dan bumi. Dia menyeru kalian agar kalian menyembah dan mentaati-Nya untuk mengampuni dosa-dosa kalian dan menunda azab di dunia hingga datang ajal kalian, sehingga Dia tidak segera menimpakan azab kepada kalian? Namun mereka membantah para rasul dengan penuh kebodohan: “Kalian tidak lain hanyalah manusia biasa, sifat kalian seperti sifat kami. Kalian ingin memalingkan kami dari berhala-berhala dan patung-patung yang telah disembah para nenek moyang kami. Datangkanlah kepada kami bukti yang nyata yang menunjukkan kebenaran apa yang kalian katakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. قَالَتْ رُسُلُهُمْ أَفِى اللهِ شَكٌّ (Berkata rasul-rasul mereka: “Apakah ada keragu-raguan terhadap Allah) Yakni apakah dalam keesaan Allah itu terdapat keraguan, padahal itu sangatlah jelas? فَاطِرِ السَّمٰوٰتِ وَالْأَرْضِ ۖ (Pencipta langit dan bumi?) Yakni yang menciptakan dan mengadakan keduanya. يَدْعُوكُمْ(Dia menyeru kamu) Untuk beriman dan mengesakan-Nya. لِيَغْفِرَ لَكُم مِّن ذُنُوبِكُمْ(untuk memberi ampunan kepadamu dari dosa-dosamu) Yang Allah kehendaki untuk mengampuninya.. وَيُؤَخِّرَكُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ (dan menangguhkan (siksaan)mu sampai masa yang ditentukan) Yakni sampai kematian kalian sehingga Allah tidak mengazab kalian di dunia. قَالُوٓا۟ إِنْ أَنتُمْ إِلَّا بَشَرٌ مِّثْلُنَا (Mereka berkata: “Kamu tidak lain hanyalah manusia seperti kami juga) Dalam sifat dan bentuknya. Kalian makan dan minum sebagaimana kami makan dan minum. Dan kalian bukanlah malaikat. تُرِيدُونَ أَن تَصُدُّونَا(Kamu menghendaki untuk menghalang-halangi (membelokkan) kami) Kalian ingin membelokkan kami dari sesembahan nenek moyang kami yang berupa patung-patung dan lain sebagainya. فَأْتُونَا (karena itu datangkanlah kepada kami) Jika kalian adalah orang-orang yang benar bahwa kalian diutus oleh Allah. بِسُلْطٰنٍ مُّبِينٍ (bukti yang nyata) Yakni dengan bukti yang jelas yang menunjukkan kebenaran pengakuan kalian. Sebenarnya para rasul telah mendatangkan kepada mereka bukti yang jelas, namun ini merupakan bagian dari kedurhakaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Rasul-rasul mereka berkata: “Apakah ada keragu-raguan terhadap keesaan Allah, Pencipta langit dan bumi? Maha Suci Allah Yang telah menciptakan langit dan bumi dalam ciptaan yang sempurna, tidak ada yang menyamainya. Dia menyeru kamu untuk menyembah-Nya, taat kepada-Nya, beriman kepada-Nya dan mengesakan-Nya agar Dia memberi ampunan kepadamu atas dosa-dosamu dan menangguhkan siksaanmu sampai masa yang ditentukan?” Mereka berkata: “Kamu tidak lain hanyalah manusia seperti kami juga. Kamu menghendaki untuk menghalang-halangi kami dari apa yang selalu disembah nenek moyang kami, karena itu datangkanlah kepada kami, bukti yang nyata dan banyak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Para rasul mereka berkata,“Apakah ada keraguan terhadap Allah, Pencipta} pencipta {langit dan bumi. Dia menyeru kalian agar Dia mengampuni sebagian dosa-dosa kalian dan menangguhkan kalian sampai waktu yang ditentukan”} sampai ajal kalian terpenuhi di dunia {Mereka menjawab,“Kalian tidak lain} kalian tidak lain {hanyalah manusia seperti kami juga. Kalian ingin menghalangi kami dari apa yang telah disembah nenek moyang kami, maka datangkanlah kepada kami bukti yang nyata”} bukti yang nyata atas kebenaran seruan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Dan sungguh mereka telah mendustakannya dan telah berbuat kezhaliman. Oleh karenanya, “para rasul berkata”, kepada mereka, “Apakah ada keragu-raguan tentang Allah”, sesungguhnya itu merupakan sebuah perkara yang sangat jelas dan terang. Siapa saja yang meragukan tentang Allah “Pencipta langit dan bumi”, yang keberadaan segala sesuatu tergantung pada wujudNya. Tidak ada seorang makhluk hebat pun di sisi Allah yang memiliki pengetahuan hingga pada hal-hal yang bisa dicerna dengan panca indera. Karenanya, para rasul mengajak bicara mereka sebagaimana komunikasi kepada orang yang tidak syak lagi tentangNya, dan tidak pantas untuk terjadinya keraguan padaNYa. “Dia menyeru kamu”, kepada beragam kemanfaatan dan kemaslahatan bagi kalian “untuk memberi ampunan kepadamu dari dosa-dosamu dan menangguhkan (siksaan)mu sampai masa masa yang ditentukan”, maksudnya agar Allah memberikan pahala yang bersifat segera dan yang tertunda atas sambutan kalian terhadap seruanNya. Allah menyeru kalian bukan untuk (kepentingan) mencari manfaat dari ibadah kalian, justru nilai manfaatnya berbalik kembali kepada kalian. Maka mereka membantah para rasul dengan bantahan yang biasa dilontarkan orang-orang bodoh lagi tidak berakal, “Mereka berkata” kepada para rasul, “kamu menghendaki untuk menghalang-halangi (membelokkan) kami dari sesuatu yang selalu disembah nenek moyang kami”, bagaimana mungkin kami bisa meninggalkan ideology nenek moyang kami dan sejarah mereka karena jalan pikiran nalarmu? Bagaimana kami menaatimu padahal kamu itu manusia juga seperti kami? “ karena itu datangkanlah kepada kami bukti yang nyata”, yaitu dengan hujjah yang terang lagi jelas. Yang dimaksud dengan bukti adalah bukti yang mereka minta. Kalau tidak demikian yang dimaksud, maka seperti sudah dikemukakan, bahwa para rasul telah membawa bukti-bukti kebenaran kepada mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَفِي ٱللَّهِ شَكّٞ) a fillahi syakk : “Apakah ada keraguan akan Allah” tidak ada keraguan akan keberadaan Allah tidak pula pada tauhid kepada-Nya, karena bentuk pertanyaan di sini adalah untuk mengingkari. (إِلَىٰٓ أَجَلٖ مُّسَمّٗىۚ) ilaa ajalim musammaa : “hingga waktu yang ditentukan” yaitu hingga ajal kematian. (بِسُلۡطَٰنٖ مُّبِينٖ) bisulthanim mubiin : “dengan bukti yang nyata” dengan hujjah yang jelas yang menunjukkan kebenaran kalian. Makna ayat :’ Pembahasan masih berkaitan dengan apa yang Nabi Musa peringatkan kepada kaumnya dengan perkataannya : (أَلَمۡ يَأۡتِكُمۡ نَبَؤُاْ ٱلَّذِينَ مِن قَبۡلِكُمۡ قَوۡمِ نُوحٖ) “Apakah belum datang kepada kalian kabar orang-orang sebelum kalian; kaum Nuh...” firman-Nya : (قَالَتۡ رُسُلُهُمۡ) “Rasul-rasul mereka berkata” mereka berkata kepada umat-umat mereka yang kafir (أَفِي ٱللَّهِ شَكّٞ) “Apakah kalian ragu akan Allah?” yaitu bagaimana mungkin ada keraguan tentang keesaan Allah, sedangkan Dia yang telah menciptakan langit dan bumi, Dia menciptakan langit dan bumi sendirian, tidak masuk akal jika Dia sampai mempunyai sekutu dalam perkara ibadah, karena tidak ada sesembahan yang berhak disembah kecuali Dia. Dan firman-Nya : (يَدۡعُوكُمۡ) “menyeru kalian” menuju keimanan dan amal saleh yang bersih dari syirik (لِيَغۡفِرَ لَكُم مِّن ذُنُوبِكُمۡ) “agar Dia mengampuni dosa-dosa kalian” yaitu seluruh dosa antara kalian dan Rabb kalian berupa dosa-dosa besar atau kecil, adapun kezaliman yang terjadi di antara sesama manusia, maka kembalikan hak-hak mereka niscaya kalian akan diampuni. Firman-Nya : (وَيُؤَخِّرَكُمۡ إِلَىٰٓ أَجَلٖ مُّسَمّٗىۚ) “dan menangguhkan kalian hingga ajal yang telah ditentukan” yaitu mengakhirkan azab kalian agar kalian meningggal sesuai dengan waktu yang telah ditentukan. Dan firman-Nya : (قَالُوٓاْ) “mereka berkata” umat-umat yang kafir kepada para rasul mereka, (إِنۡ أَنتُمۡ إِلَّا بَشَرٞ مِّثۡلُنَا) “kalian hanyalah manusia sama seperti kami” kalian tidak lebih dari manusia sama seperti kami (تُرِيدُونَ أَن تَصُدُّونَا) “kalian ingin menghalangi kami” memalingkan kami (عَمَّا كَانَ يَعۡبُدُ ءَابَآؤُنَا) “dari apa yang telah disembah oleh nenek moyang kami” berupa sesembahan-sesembahan; berhala dan patung yang mereka anggap sebagai tuhan. Perkataan mereka : (فَأۡتُونَا بِسُلۡطَٰنٖ مُّبِينٖ) “maka datangkanlah kepada kami bukti yang nyata” orang-orang kafir itu berkata kepada para rasul, “Bawalah kehadapan kami bukti yang nyata.” Argumen yang jelas yang menunjukkan kebenaran bahwa kalian adalah utusan Allah kepada kami. Pelajaran dari ayat : • Batilnya keraguan akan keberadaan Allah, ilmu, kekuasaan, dan hikmah-Nya, dan wajibnya hanya beribadah kepada-Nya, karena banyak dalil dan kuatnya argumentasi serta jelasnya bukti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 10: Tidak ada keraguan tentang keesaan-Nya karena dalil-dalilnya yang begitu jelas. Dia mengajak kamu bukan untuk mengambil manfaat dari ibadah yang kamu lakukan, bahkan manfaatnya kembali kepada kamu, dosa-dosamu diampuni-Nya, amalmu diberi pahala, dan kamu diberi waktu sampai tiba ajalmu dengan tanpa menyiksamu. Yang menunjukkan kebenaranmu. Bukti yang nyata di sini maksudnya adalah sesuai permintaan mereka, karena sesngguhnya para rasul tidaklah datang kecuali dengan membawa bukti yang nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 10",
    "description": "Menanggapi jawaban kaumnya, rasul-rasul mereka berkata, apakah ada keraguan dari siapa pun yang berakal terhadap wujud dan keesaan Allah, pencipta langit dan bumi dalam keseimbangan yang begitu sempurna' dia menyeru kamu agar bertauhid dan beribadah hanya kepadanya untuk kepentinganmu sendiri, yakni agar dia mengampuni sebagian dosa-dosamu yang sengaja maupun tidak, dan menangguhkan siksaan-Mu sampai waktu yang ditentukan oleh-Nya. Mendengar nasihat para rasul itu, mereka berkata, kamu hanyalah manusia biasa seperti kami juga. Tidak ada keistimewaan apa pun dalam diri kamu yang memantaskan kamu untuk menjadi pembimbing kami. Kamu mengaku sebagai rasul hanya karena ingin menghalangi kami menyembah apa yang dari dahulu telah diyakini dan disembah oleh nenek moyang kami, lalu kamu mengajak kami menyembah tuhanmu. Karena itu, datangkanlah kepada kami bukti yang nyata bahwa kamu benar utusan Allah sehingga kami tidak lagi dapat membantahnya. Pandangan orang kafir itu sangat keliru. Mereka seolah ingin memaksakan kehendak bahwa para rasul haruslah bukan manusia biasa. Untuk mematahkan logika ini, rasul-rasul mereka berkata kepada mereka, wahai kaum kami, kami memang hanyalah manusia biasa seperti kamu, tetapi Allah memberi karunia kepada siapa yang dia kehendaki di antara hamba-hamba-Nya. Kami adalah beberapa orang di antara mereka yang Allah beri karunia itu. Ketahuilah, tidak pantas bagi kami untuk mendatangkan suatu bukti kepada kamu atas kuasa kami sendiri, melainkan semuanya haruslah dengan izin Allah. Dan oleh sebab itu, hanya kepada Allah saja hendaknya orang yang beriman bertawakal dan berserah diri."
  }
]