[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tatkala para rasul mendengar pernyataan yang dikatakan oleh kaum mereka, maka mereka berkata kepada kaum mereka, ”Benar, kami tidak lain kecuali manusia biasa seperti kalian, sebagaimana kalian katakan. Akan tetapi, Alalh telah mengaruniakan kepada kami dengan kenikmatanNya pada orang yang Dia kehendaki dari hamba-hambaNya, lalu Dia memilih mereka untuk mengemban risalahNya. sedangkan perkara yang kalian pinta berupa bukti yang nyata, maka tidak mungkin bagi kami dan kami tidak mampu untuk mendatangkannya kepada kalian kecuali dengan izin Allah dan taufikNya. dan hanya kepada Allah semata, orang-orang mukmin bergantung dalam seluruh urusan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Para Rasul mereka menjawab sebagai bantahan atas mereka, “Kami hanya manusia yang sama seperti kalian, kami mengakui bahwa kalian dengan kami adalah sama, namun hal ini tidak berarti bahwa kami dengan kalian sama persis dalam segala urusan, karena Allah melimpahkan nikmat-Nya yang khusus kepada siapa yang Dia kehendaki dari hamba-hamba-Nya, Allah memilih mereka untuk Dia angkat menjadi utusan-utusan-Nya kepada manusia, dan kami tidak berhak mendatangkan apa yang kalian minta berupa bukti kecuali dengan kehendak Allah, karena mendatangkannya bukan kewenangan kami, akan tetapi hanya Allah semata yang berkuasa atas itu. Hanya kepada Allah semata orang-orang mukmin bertawakal dalam segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Para rasul berkata kepada kaum mereka: “Kami memang hanya manusia seperti kalian dalam sisi rupa dan tabiatnya sebagaimana yang kalian katakan; akan tetapi dengan karunia-Nya, Allah melebihkan sebagian mereka dengan kenabian. Adapun bukti-bukti yang kalian minta untuk membuktikan kebenaran kami bukan merupakan urusan kami dan di luar kemampuan kami untuk mendatangkannya kecuali dengan kehendak dan kekuasaan Allah. Hanya kepada Allah hendaklah orang-orang yang beriman bertawakkal; dan apa yang menghalangi kami untuk bertawakkal kepada-Nya, sedangkan Dia telah memberi kami petunjuk kepada agama Islam dan jalan menuju surga? Sungguh kami benar-benar akan bersabar atas gangguan dan pendustaan kalian. Hanya kepada Allah hendaklah orang-orang yang mempercayai-Nya bertawakkal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قَالَتْ لَهُمْ رُسُلُهُمْ إِن نَّحْنُ إِلَّا بَشَرٌ مِّثْلُكُمْ (Rasul-rasul mereka berkata kepada mereka: “Kami tidak lain hanyalah manusia seperti kamu) Kami tidak lain hanyalah manusia seperti kalian dalam hal bentuk dan rupa sebagaimana yang kalian katakan. وَلٰكِنَّ اللهَ يَمُنُّ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ( akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya) Allah memuliakan sebagian manusia yang dikehendaki-Nya dengan kenabian, dan Allah berkehendak bahwa kami-lah orang-orang yang mendapatkan kemuliaan itu. وَمَا كَانَ لَنَآ أَن نَّأْتِيَكُم بِسُلْطٰنٍ(Dan tidak patut bagi kami mendatangkan suatu bukti kepada kamu) Yakni tidak ada kekuasaan bagi kami untuk mendatangkan kepada kalian suatu bukti. إِلَّا بِإِذْنِ اللهِ ۚ (melainkan dengan izin Allah) Yakni kecuali dengan kehendak-Nya, dan itu diluar kuasa kami. Pendapat lain mengatakan yang dimaksud dengan (السلطان) yakni mukjizat yang diminta oleh orang-orang kafir sebagai bentuk kedurhakaan mereka. وَعَلَى اللهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ (Dan hanya kepada Allah sajalah hendaknya orang-orang mukmin bertawakkal) Dan maksud para rasul dari hal ini adalah pertama-tama bagi orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara pesan yang dipetik dari para nabi adalah bahwasanya mereka diutus oleh Allah bukan untuk berbangga melainkan agar mereka bersyukur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Rasul-rasul mereka berkata kepada mereka: “Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Dan tidak patut bagi kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah. Dan hanya kepada Allah sajalah hendaknya orang-orang mukmin bertawakkal, dan menyerahkan semua urusan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Para rasul mereka berkata kepada mereka,“Kami tidak lain hanyalah manusia seperti kalian, tetapi Allah memberi karunia} memberi karunia {kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya. Tidak mungkin} tidak benar {bagi kami untuk mendatangkan suatu bukti} bukti {kepada kalian melainkan dengan izin Allah} dengan kehendak Allah {Hanya kepada Allah seharusnya orang-orang yang beriman itu bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Rasul-rasul mereka berkata kepada mereka” untuk menjawab usulan dan sanggahan mereka “kami tidak lain hanyalah manusia seperti kamu”, memang benar, dan demikianlah hakikatnya, kami adalah manusia (biasa) seperti kalian, “akan tetapi”, bukan berarti kondisi itu menyebabkan penolakan terhadap risalah yang kami bawa yang berbentuk kebenaran. Sesungguhnya “Allah memberikan karunia kepada siapa yang Dia kehendai di antara hamba-hambaNya”, apabila Allah telah menganugerahkan karunia kepada kami dengan memberi wahyu dan risalahNya, maka itu merupakan keutamaan dan kebaikan Allah bagi kami. Tidak ada seorang pun yang berhak membatasi Allah dalam mencurahkan keutamaan dan kebaikanNya, dan menghalanginya dari mengalirkan keutamaan dariNya. Maka, perhatikanlah risalah yang kami bawa kepada kalian. Jika merupakan kebenaran, maka terimalah. Jika memang bukan, maka tampiklah. Janganlah kalian menjadikan kondisi kami sebagai alasan buat kalian untuk menampik risalah yang kami bawa kepada kalian. Ucapan kalian, “karena itu, datangkanlah kepada kami bukti yang nyata”, sesungguhnya wewenang itu bukan berada di tangan kami, kami tidak mempunyai hak pengaturan sedikit pun. “Dan tidak patut bagi kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah”, Dia-lah Dzat yang bila berkehendak, niscaya akan mendatangkannya kepada kalian. Dan bila (tidak) berkehendak, maka tidak membawakannya kepada kalian. Dia tidak bertindak kecuali dengan tindakan yang menuntut hikmah dan rahmat. “dan hanya kepada Allah-lah”, tidak kepada selainNya “maka hendaknya orang-orang yang beriman itu bertawakal”, mereka bergantung kepadaNya dalam meperoleh kebaikan-kebaikan dan menepis bahaya. Karena, mereka mengetahui tentang kesempurnaan penanganan dan kekuasaanNya, dan luasnya cakupan kebaikanNYa. Maka, mereka begitu percaya kepadaNya dalam memudahkan urusan tersebut. Tergantung pada tingkat keimanan yang ada pada merekalah, kualitas tawakal mereka kepada Allah. Dengan ini, dapat diketahui, wajibnya bertawakal kepada Allah, dan bahwa ia termasuk kelaziman dari keimanan, dan juga termasuk ibadah besar yang dicintai dan diridhai oleh Allah, lantaran segenap ibadah terpaku dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَمُنُّ عَلَىٰ مَن يَشَآءُ مِنۡ عِبَادِهِۦۖ) yamunnu ‘alaa may yasyaa’ : “Dia memberi kepada yang Dia kehendaki.” Yaitu kenabian dan risalah kepada yang Dia kehendaki untuk perkara itu. Makna ayat : Maka para rasul menjawab—sebagaimana yang Allah kabarkan dalam firman-Nya : (قَالَتۡ لَهُمۡ رُسُلُهُمۡ إِن نَّحۡنُ إِلَّا بَشَرٞ مِّثۡلُكُمۡ) “Para rasul berkata, ‘Kami hanyalah manusia sama seperti kalian” kami hanya manusia yang sama seperti kalian, apa yang tidak kalian mampu, begitu pula dengan kami (وَلَٰكِنَّ ٱللَّهَ يَمُنُّ عَلَىٰ مَن يَشَآءُ) “tapi Allah memberikan karunia-Nya kepada yang Dia kehendaki” namun Allah memberikan kenabian kepada yang Dia kehendaki, sehingga Dia memberikan kami kenabian agar kami mengkabarkan kepada kalian apa yang Allah, Rabb kami dan Rabb kalian perintahkan, sebagaimana kami pula memerintahkan kalian, kami juga mengajak kalian—bukan dari diri kami pribadi—atas perintah kepada kami untuk memerintah dan mengajak kalian kepada-Nya.” (مِنۡ وَمَا كَانَ لَنَآ أَن نَّأۡتِيَكُم بِسُلۡطَٰنٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ) “kami tidak mampu mendatangkan kepada kalian bukti, kecuali atas izin Allah” dengan kehendak-Nya, Dia-lah pemilik kehendak dan kemampuan yang tidak terbatas, oleh karena itu hanya kepada-Nya lah kami bertawakkal. (وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ) “hanya kepada-Nya bertawakkal orang-orang yang beriman.” Karena Dia yang akan mencukupi kebutuhan mereka, Pelajaran dari ayat : • Penjelasan bagaimana orang-orang kafir membalas para rasul Allah subhanahu wa ta’ala dan apa jawaban para rasul kepada mereka. • Wajibnya bertawakkal kepada Allah ta’ala dan sah seseorang bertawakkal kepada selain Allah, karena tidak ada yang mampu memenuhi kebutuhan kecuali Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 11: Seperti yang kamu katakan. Dengan wahyu dan risalah-Nya. Oleh karena itu, lihatlah apa yang kami bawa kepada kamu. Jika benar, maka terimalah, namun jika tidak maka silahkan tolak. Karena kami hanyalah hamba yang diatur. Allah-lah yang mendatangkannya jika Dia menghendaki, dan Dia tidaklah berbuat kecuali sesuai hikmah dan rahmat-Nya. Kepada Allah-lah orang-orang yang beriman bersandar dalam mendatangkan maslahat dan menolak madharrat karena mereka mengetahui sempurnanya pencukupan-Nya dan sempurnanya kekuasaan-Nya serta meratanya ihsan-Nya. Mereka juga mempercayakan kepada-Nya dalam memudahkan semua itu. Tingkat tawakkal mereka tergantung keimanan yang mereka miliki. Dari sini diketahui, bahwa tawakkal adalah wajib, dan bahwa ia termasuk lawazim (hal yang menyatu) dengan keimanan, dan termasuk ibadah yang besar yang dicintai Alah dan diridhai-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 11",
    "description": "Pandangan orang kafir itu sangat keliru. Mereka seolah ingin memaksakan kehendak bahwa para rasul haruslah bukan manusia biasa. Untuk mematahkan logika ini, rasul-rasul mereka berkata kepada mereka, wahai kaum kami, kami memang hanyalah manusia biasa seperti kamu, tetapi Allah memberi karunia kepada siapa yang dia kehendaki di antara hamba-hamba-Nya. Kami adalah beberapa orang di antara mereka yang Allah beri karunia itu. Ketahuilah, tidak pantas bagi kami untuk mendatangkan suatu bukti kepada kamu atas kuasa kami sendiri, melainkan semuanya haruslah dengan izin Allah. Dan oleh sebab itu, hanya kepada Allah saja hendaknya orang yang beriman bertawakal dan berserah diri. Dan kami, para rasul, selalu bertawakal kepada Allah. Mengapa kami tidak akan bertawakal kepada Allah yang maha pencipta dan mahaperkasa, sedangkan dia telah menunjukkan jalan yang lurus kepada kami sehingga kami akan selamat dari azab-Nya, dan jika kalian menyakiti kami karenanya, baik dengan perkataan maupun perbuatan, kami sungguh akan tetap bersabar terhadap gangguan yang kamu lakukan kepada kami itu. Dan ketahuilah, hanya kepada Allah saja orang yang bertawakal berserah diri. Mereka bertawakal kepada-Nya karena yakin bahwa dia akan mengulurkan pertolongan."
  }
]