[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagaimana kami tidak bergantung kepada Allah, sedang Dialah Dzat yang menunjukan kami ke jalan keselamatan dari siksaanNya dengan cara mengikuti hukum-hukum agamaNya? Dan kami benar-benar akan bersabar mengahadapi gangguan kalian terhadap kami yang berbentuk ucapan buruk dan lainnya.Dan hanya kepada Allah semata, kaum mukminin bergantung dalam kemenangan mereka dan mengalahkan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Apa alasan yang menghalangi kami untuk bertawakal kepada Allah, sementara Allah telah membimbing kami ke jalan paling lurus dan paling jelas. Kami akan bersabar menghadapi sikap kalian yang mendustakan dan menghina kami. Hanya kepada Allah semata orang-orang yang bertawakal menyerahkan segala urusan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى اللهِ (Mengapa kami tidak akan bertawakkal kepada Allah) Yakni alasan apa yang membuat kami tidak bertawakkal kepada Allah. وَقَدْ هَدَىٰنَا سُبُلَنَا ۚ( padahal Dia telah menunjukkan jalan kepada kami) Sedangkan Allah telah mengaruniakan kepada kami sesuatu yang menjadikan kami harus bertawakkal kepada-Nya, yaitu dengan memberi kami petunjuk ke jalan yang menghantarkan kami kepada rahmat-Nya. وَلَنَصْبِرَنَّ عَلَىٰ مَآ ءَاذَيْتُمُونَا ۚ( dan kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami) Yakni kami bersumpah akan bersabar atas pendustaan kalian kepada kami dan usulan kalian yang batil itu. وَعَلَى اللهِ(Dan hanya kepada Allah) Kepada-Nya semata orang-orang yang bertawakkal itu berserah diri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَنَصْبِرَنَّ عَلَىٰ مَا آذَيْتُمُونَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ } \"dan kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami. Dan hanya kepada Allah saja orang-orang yang bertawakkal itu, berserah diri\" slogan seorang mukmin ketika gangguan orang-orang kafir dan munafiqin menimpa mereka, hanya dengan berpakain sabar dan tawakkal akan membuat mereka kuat menghadapi cobaan itu, dan diantara tawakkal itu mereka menunggu sunnatullah yang ada pada ayat setelahnya : { لَنُهْلِكَنَّ الظَّالِمِينَ } \"Kami pasti akan membinasakan orang-orang yang zalim itu\" { وَلَنُسْكِنَنَّكُمُ الْأَرْضَ مِنْ بَعْدِهِمْ ۚ ذَٰلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ } \"dan Kami pasti akan menempatkan kamu di negeri-negeri itu sesudah mereka. Yang demikian itu (adalah untuk) orang-orang yang takut (akan menghadap) kehadirat-Ku dan yang takut kepada ancaman-Ku\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Mengapa kami tidak akan bertawakkal kepada Allah, juga tidak ada yang melarang kami untuk itu, padahal Allah telah menunjukkan jalan rahmat-Nya kepada kami dan menjauhkan dari siksa-Nya. Kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami. Hanya kepada Allah saja orang-orang yang bertawakkal itu berserah diri kepadaNya”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kami} apa yang mencegah kami untuk {tidak akan bertawakal kepada Allah, sedangkan Dia telah menunjukkan kepada kami jalan-jalan kami} menuntun kami kepada jalan yang paling lurus dan paling jelas {Sungguh kami benar-benar akan bersabar terhadap gangguan yang kalian lakukan kepada kami. Hanya kepada Allah orang-orang yang bertawakal seharusnya bergantung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Mengapa kami tidak bertawakal kepada Allah padahal Dia telah menunjukan jalan kepada kami”, apakah yang menghalangi kami untuk bertawakal kepada Allah? Sementara kondisi kami berada di atas kebenaran daan hidayah. Barangsiapa berada di atas kebenaran dan petunjuk, maka hidayah (yang dia genggam) akan mengarahkannnya menuju kesempurnaan dalam bertawakal. Begitu pula yang telah diketahui, bahwa Allah akan menjamin untuk menolong dan menangani urusan orang yang mendapatkan hidayah, yang menyeru padanya. Berbeda halnya dengan orang yang tidak berdiri di atas kebenaran dan hidayah, maka dia bukan orang yang dijamin oleh Allah. Sepak terjangnya berlawanan dengan karakter orang yang bertawakal. Dalam ucapan ini, sepertinya terdapat sinyal dari para rasul kepada kaumnya dengan sebuah ayat yang agung, yaitu bahwa kaum mereka pada umumnya, mempunyai hegemoni dan penguasaan atas para rasul. Maka para rasul itu menentang mmereka (dengan bertawakal kepada Allah) dalam menghadapi tipu daya dan makar orang-orang yang mundustakan. Para rasul merasa benar-benar yakin dengan pertolongan Allah bagi mereka. Sungguh, Allah telah membebaskan mereka dari kejahatan kaumnya, padahal merekka begitu semangat dalam menghabisi para rasul dan memadamkan cahaya kebenaran yang mereka bawa. Sehingga ini laksana perkataan Nuh kepada kaumnya, \"\"Hai kaumku, jika terasa berat bagimu tinggal (bersamaku) dan peringatanku (kepadamu) dengan ayat-ayat Allah, maka kepada Allah-lah aku bertawakal, karena itu bulatkanlah keputusanmu dan (kumpulkanlah) sekutu-sekutumu (untuk membinasakanku). Kemudian janganlah keputusanmu itu dirahasiakan, lalu lakukanlah terhadap diriku, dan janganlah kamu memberi tangguh kepadaku.\"(Yunus:71). Dan seperti perkataan Hud, \"Kami tidak mengatakan melainkan bahwa sebagian sembahan kami telah menimpakan penyakit gila atas dirimu\". Huud menjawab: \"Sesungguhnya aku bersaksi kepada Allah dan saksikanlah olehmu sekalian bahwa sesungguhnya aku berlepas diri dari apa yang kamu persekutukan dari selain-Nya, sebab itu jalankanlah tipu dayamu semuanya terhadapku dan janganlah kamu memberi tangguh kepadaku.\"(Hud: 54-55). “Dan kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami”, kami akan (tetap) melanjutkan dakwah kepada kalian dan menasehati serta mengingatkan kalian. Kami tidak peduli dengan gangguan yang kalian gencarkan kepada kami. Kami akan menempa diri kami untuk menghadapi siksaan yang kami peroleh dari kalian, kalian mengharapkan pahala dari Allah, dan demi untuk menasehati kalian. Semoga Allah memberikkan hidayah kepada kalian melalui banyaknya peringatan. “Dan hanya kepada Allah-lah”, kepadaNya semata, bukan selainNya “orang-orang yang bertawakal itu berserah diri”, karena bertawakal kepadaNya merupakan kunci segala kebaikan. Ketahuilah, bahwa tingkatan tawakal para rasul itu sudah berada di level paling atas dan kedudukan paling mulia. Yakni tawakal kepada Allah dalam menegakkan agamaNya, membela dan memberi hidayah kepada para hambaNya, serta dalam upaya penghapusan kesesatan dari mereka. Ini merupakan bentuk tawakal yang paling sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَقَدۡ هَدَىٰنَا سُبُلَنَاۚ) wa qad hadaanaa subulanaa : “dan Dia telah menunjukkan kepada kami jalan kami” jalan-jalan yang dengannya kami mengetahui-Nya, dan kami mengetahui keagungan kekuasaan-Nya dan keperkasaan kerajaan-Nya. Makna ayat : kemudian para rasul itu berkata seraya menasehati kaum mereka dengan apa yang telah lampau : (وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدۡ هَدَىٰنَا سُبُلَنَاۚ) “Untuk apa kami tidak menyerahkan urusan kami kepada-Nya, sedangkan Dia telah memberikan kepada kami petunjuk atas jalan-jalan kami.” Jalan-jalan yang dengannya kami mengenal-Nya, dan mengetahui keagunggan dan kemuliaan kekuasaan-Nya, maka apa yang membuat kami tidak bertawakkal kepada-Nya? Sedangkan Dia Maha Kuat dan Maha Perkasa. (وَلَنَصۡبِرَنَّ عَلَىٰ مَآ ءَاذَيۡتُمُونَاۚ) “Dan kami sungguh akan bersabar atas gangguan kalian” baik dengan lisan atau tangan kalian seraya bertawakkal kepada Allah sampai Dia menghukum kalian. (وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ) “Dan hanya kepada Allah lah hendaknya bertawakkal orang yang bertawakkal.” Karena Dialah yang mencukupi siapa pun yang percaya kepada-Nya dan menyerahkan segala urusan-Nya hanya kepada-Nya dia bertawakkal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 12: Petunjuk yang diberikan-Nya kepada seseorang menghendaki untuk bertawakkal secara sempurna kepada-Nya. Dalam ayat ini terdapat isyarat dari para rasul ‘alaihimush shalaatu was salam kepada kaum mereka tentang ayat atau mukjizat yang besar, yaitu karena kaum mereka pada umumnya berada dalam kekuasaan, sedangkan rasul dan para pengikutnya dalam keadaan lemah, maka Rasul menantang mereka dengan tawakkalnya kepada Allah dalam menolak makar dan tipu daya mereka dan merasa yakin dengan pencukupan dari-Nya. Oleh karena itu, Allah melindungi rasul-Nya dari kejahatan mereka meskipun mereka berusaha untuk menyingkirkan kebenaran yang dibawa para rasul. Sehingga ayat ini sama seperti ucapan Nuh kepada kaumnya, \"Hai kaumku, jika terasa berat bagimu tinggal (bersamaku) dan peringatanku (kepadamu) dengan ayat-ayat Allah, maka kepada Allah-lah aku bertawakal, karena itu bulatkanlah keputusanmu dan (kumpulkanlah) sekutu-sekutumu (untuk membinasakanku). Kemudian janganlah keputusanmu itu dirahasiakan, lalu lakukanlah terhadap diriku, dan janganlah kamu memberi tangguh kepadaku.” (Terj. Nuh: 71) Mendakwahi dan menasehati kamu meskipun kamu menyakiti kami sambil berharap pahala dari Allah dan tetap berkeinginan baik kepada kamu, mudah-mudahan dengan sering diingatkan, kamu diberi-Nya hidayah Hal itu, karena tawakkal kepada Allah merupakan kunci segala kebaikan. Tawakkal para rasul merupakan tawakkal yang sempurna, karena tawakkal dalam menegakkan agama-Nya dan menunjuki hamba-hamba-Nya serta menyingkirkan kesesatan dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 12",
    "description": "Dan kami, para rasul, selalu bertawakal kepada Allah. Mengapa kami tidak akan bertawakal kepada Allah yang maha pencipta dan mahaperkasa, sedangkan dia telah menunjukkan jalan yang lurus kepada kami sehingga kami akan selamat dari azab-Nya, dan jika kalian menyakiti kami karenanya, baik dengan perkataan maupun perbuatan, kami sungguh akan tetap bersabar terhadap gangguan yang kamu lakukan kepada kami itu. Dan ketahuilah, hanya kepada Allah saja orang yang bertawakal berserah diri. Mereka bertawakal kepada-Nya karena yakin bahwa dia akan mengulurkan pertolongan. Dialog antara para rasul dengan kaum mereka yang ingkar terus berlanjut. Dan orang-orang kafir dengan angkuh dan sombong berkata dengan nada mengancam kepada rasul-rasul mereka, kami pasti akan mengusir kamu dengan paksa dari negeri kami, atau kamu benar-benar kembali kepada agama kami yang telah kamu tinggalkan. Para rasul mengacuhkan ancaman mereka dan tetap istikamah mendakwahkan kebenaran. Untuk meneguhkan hati para rasul, maka tuhan mewahyukan kepada mereka, wahai para rasul, jangan risau dan khawatir, kami yang mahaperkasa pasti akan menolongmu dan membinasakan orang yang zalim itu."
  }
]