[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami benar-benar akan menjadikan kesudahan nasib yang baik bagi rasul-rasul dan para pengikut mereka, dengan menempatkan mereka untuk mendiami negeri orang-orang kafir setelah mereka di hancurkan. Perkara pembinasaan kaum kafiir dan menempatkan kaum muslimin tinggal di wilayah mereka merupakan hal yang pasti bagi orang yang takut berdiri pada tempatnya di hadapanKu pada hari kiamat, dan takut terhadap ancaman dann siksaanKu.’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Kami akan membuat kalian -wahai para Rasul- tinggal di negeri mereka sesudah mereka binasa. Pembinasaan orang-orang kafir yang mendustakan dan tinggalnya para Rasul di negeri mereka sesudah mereka dibinasakan mengandung nasihat mendalam bagi siapa yang mengetahui keagungan-Ku dan merasakan pengawasan-Ku serta takut terhadap peringatan-Ku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَلَنُسْكِنَنَّكُمُ الْأَرْضَ (dan Kami pasti akan menempatkan kamu di negeri-negeri itu) Yakni negeri orang-orang kafir yang mengancam kalian akan mengusir kalian atau kalian harus kembali ke ajaran nenek moyang mereka. ذٰلِكَ (Yang demikian itu) Yakni pembinasaan orang-orang kafir dan menempatkan orang-orang beriman di negeri mereka. لِمَنْ خَافَ مَقَامِى((adalah untuk) orang-orang yang takut (akan menghadap) kehadirat-Ku) Yakni di hari perhitungan. Pendapat lain mengatakan yakni bagi orang yang takut kedudukan-Ku dan pengawasan-Ku terhadapnya. وَخَافَ وَعِيدِ(dan yang takut kepada ancaman-Ku) Yakni takut terhadap ancaman-Ku dengan azab. Pendapat lain mengakatan yakni takut terhadap azab-Ku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dan Kami pasti akan benar-benar menempatkan kamu di negeri-negeri para orang kafir yang telah mereka janjikan kepadamu itu sesudah mereka binasa. Yang demikian itu adalah untuk orang-orang yang takut akan menghadap kehadirat-Ku pada hari perhitungan dan yang takut kepada ancaman-Ku karena telah membantah perintah-Ku”.Tempat yang di sini adalah sebuah kinayah atas Dzat Yang Maha Suci untuk maksud mengagungkan. Seperti disebutkan dalam surat Ar Rahman ayat 46 {wa liman khaafa maqaama rabbihi jannataan}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami akan menempatkan kalian di negeri-negeri itu setelah mereka} setelah kehancuran mereka {Yang demikian itu bagi orang yang takut menghadap kehadiratKu} kehadiratNya di hari kiamat {dan takut pada ancamanKu”} azabKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Dan Kami pasti akan menempatkan kamu di negeri-negeri itu sesudah mereka”, kesudahan yang baik yang Allah gariskan bagi para rasul dan para pengikutnya sebagai balasan bagi mereka “yang demikian itu (adalah untuk) orang-orang yang takut (akan menghadap) kehadiratKu”, takut kepadaNYa di dunia, dan dia bersikap muraqabah terhadap Allah (merasa diawasi oleh Allah) layaknya muraqabah orang yang meyakini bahwa Dia melihatnya.”Dan yang takut kepada ancamanKU” ancaman yang Aku layangkan kepada orang yang bermaksiat kepadaKU. Maka hal itu menuntutnya untuk menahan diri dari perkara –perkara yang dicintaiNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لِمَنۡ خَافَ مَقَامِي) liman khaafa maqaamii : “bagi yang takut akan pertemuanKu” berdirinya di hadapan-Nya pada hari kiamat untuk perhitungan dan pembalasan. Makna ayat : Dan Kami akan menempatkan kalian di negeri tersebut setelah mereka.” Dia berfirman, Sungguh Kami akan menghancurkan orang-orang zalim. Dan Dia tidak mengatakan “Sungguh Kami akan membinasakan mereka.” sebagai isyarat dan penjelasan sebab mereka dimusnahkan, yaitu kezaliman, syirik dan perusakan agar ini bisa menjadi pelajaran bagi seluruh alam. Dan firman-Nya : (ذَٰلِكَ) “Ini” yaitu penyelamatan bagi orang-orang yang beriman dan kebinasaan bagi orang-orang zalim balasan (لِمَنۡ خَافَ مَقَامِي) “untuk mereka yang takut akan pertemuan-Ku” pertemuan dengan Ku di hari kiamat nanti (وَخَافَ وَعِيدِ) “dan takut akan ancaman-Ku.” Melalui lisan para rasul berupa azab bagi mereka yang ingkar kepada-Ku dan menyekutukan-Ku dalam ibadah, dan ia mati dalam keadaan belum bertaubat kepada-Ku dari kekafiran, syirik, dan perbuatan zalimnya. Pelajaran dari ayat : • Konsekuensi kezaliman, yaitu kerugian dan kehancuran, dan ia tidak akan meleset atau lolos dari pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 14: Setelah mereka binasa. Menghadap ke hadirat Allah ialah pertemuan dengan Allah Subhaanahu wa Ta'aala pada hari kiamat untuk dihisab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 14",
    "description": "Dan kami pasti akan menempatkan kamu kembali dan menjadikanmu penguasa di negeri-negeri itu setelah mereka kami binasakan. Yang demikian itu, yakni membinasakan orang kafir dan menempatkan kembali para rasul ke negeri mereka sendiri, adalah anugerah bagi orang-orang yang takut akan kedudukannya ketika menghadap ke hadirat-ku di hari kiamat, dan juga takut akan azab dan ancaman-ku. Allah berjanji akan membinasakan orang kafir, karena itu para rasul menyambutnya dengan memohon agar dakwah mereka menemui keberhasilan. Dan mereka memohon kepada Allah agar diberi kemenangan atas para penentang mereka. Allah mengabulkan doa itu, dan binasalah semua orang yang berlaku dan berbuat sewenang-wenang lagi keras kepala dan enggan mengakui keesaan Allah dan beribadah hanya kepada-Nya."
  }
]