[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan rasul-rasul mencari pelindungan kepada tuhan mereka, dan memohon kepadaNya kemenangan dan pertolongan menghadapi musuh-musuh mereka dan hukum diantara mereka. Kemudian Dia mengabulkan permintaan mereka. Dan binasalah setiap orang yang sombong, tidak mau menerima kebenaran dan tidak tunduk kepadanya, serta tidak mengakui keesaan Allah dan kewajiban mengikhlaskan ibadah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Para Rasul memohon kepada Rabb mereka agar Dia menolong mereka dari musuh-musuh mereka. Setiap orang yang sombong lagi menentang kebenaran pasti merugi, dia tidak mengikutinya padahal kebenaran itu sangat jelas baginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-17. Para rasul memohon pertolongan dari Allah, maka Allah mengabulkan permohonan mereka dan membinasakan semua orang yang angkuh dan sangat menentang kebenaran, tempat mereka adalah neraka Jahannam, di sana mereka diberi minum nanah dan darah yang keluar dari tubuh para penghuni neraka, mereka kekusahan untuk menelannya sehingga tersangkut di kerongkongan mereka, mereka tidak mampu menelannya karena sangat menjijikkan dan pahit. Azab pedih yang dapat menjadi sebab kematian mendatangi mereka dari segala arah, akan tetapi mereka tidak dapat mati. Hal ini agar mereka merasakan beratnya azab secara terus menerus, bahkan azab itu berganti dengan azab yang sangat menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَاسْتَفْتَحُوا۟ (Dan mereka memohon kemenangan) Para rasul memohon kemenagan dari Allah atas musuh-musuh mereka. Pendapat lain mengatakan yakni orang-orang kafir meminta kepada Allah agar menyelesaikan urusan mereka dengan para rasul, dengan membinasakan orang yang zalim dan memenangkan orang yang terzalimi. Dan setelah Allah memutuskan perkara mereka, ternyata Allah memenangkan para rasul dan orang-orang beriman. وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ (dan binasalah semua orang yang berlaku sewenang-wenang lagi keras kepala) Makna (الجبار) yakni orang yang angkuh yang merasa tidak bersalah kepada siapapun. Makna (العنيد) yakni orang yang melawan kebenaran dan menjauhinya, yang enggan mengucapkan Laa ilaaha illa Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Mereka memohon kepada para rasul untuk meohonkan kepada Allah sebuah kemenangan atas musuh-musuh mereka. Binasalah semua orang yang berlaku sewenang-wenang lagi keras kepala terhadap kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka memohon kemenangan} para rasul itu meminta kemanangan kepada Allah atas kaum mereka {dan kecewalah} binasa dan merugilah {setiap orang yang sewenang-wenang} pembesar {lagi sangat keras kepala} menentang kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Dan mereka memohon kemenangan (atas musuh-musuh mereka)”, yaitu orang-orang kafir. Mereka itu adalah orang-orang yang meminta dan memohon dipercepatnya kemenangan dari Allah dan (hari) yang membedakan antara para pembelaNYa dan musuh-musuhNya. Maka datanglah apa yang mereka minta. Apabila tidak demikian, maka sesungguhnya Allah Maha lembut, Dia tidak akan menyegerakan siksaan bagi orang yang bermaksiat kepadaNya “dan binasalah semua orang-orang yang berlaku sewenang-wenang lagi keras keras kepala”, maksudnya merugi di dunia dan akhirat, orang yang arogan di hadapan Allah dan terhadap kebenaran serta kepada para hambaNYa (menyombongkan diri) di bumi, menentang para rasul dan memusuhi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَٱسۡتَفۡتَحُواْ) wastaftahuu : para rasul memohon pertolongan atas mereka, pertolongan melawan kaum-kaum mereka yang zalim. (وَخَابَ) wa khooba : merugi dan binasa (كُلُّ جَبَّارٍ عَنِيدٖ) kullu jabbaarin ‘aniid : zalim lagi memaksa manusia mengikuti kehendaknya dan banyak membantah. Makna ayat: Ini adalah akhir dari apa yang Nabi Musa ingatkan kepada kaumnya berupa berita umat-umat terdahulu sebelum Bani Israil, Allah ta’ala berfirman mengenai kabar-kabar tersebut : (وَٱسۡتَفۡتَحُواْ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٖ) “Maka mereka (para rasul) memohon kemenangan, dan celakalah seluruh yang berlaku sewenang-wenang lagi keras kepala.” Yaitu mereka memohon kepada Allah untuk memberikan mereka kemenangan, dan pertolongan melawan kaum mereka, maka Allah mengijabahi doa mereka (وَخَابَ كُلُّ جَبَّارٍ عَنِيدٖ) “dan binasa seluruh yang berlaku sewenang-wenang lagi keras kepala.” Merugi dan binasa setiap orang yang zalim lagi melampaui batas, memerangi kebenaran dan para pengikutnya. Pelajaran dari ayat : • Tepatnya janji Allah kepada rasul-rasul-Nya, sebagaimana firman-Nya : (فَأَوۡحَىٰٓ إِلَيۡهِمۡ رَبُّهُمۡ لَنُهۡلِكَنَّ ٱلظَّٰلِمِينَ) “Maka Rabb mereka mewahyukan, ‘Sungguh Kami akan menghancurkan orang-orang zalim tersebut...” dst."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 15: Mereka meminta disegerakan keputusan Allah dan pemisahan-Nya terhadap wali-wali-Nya dan musuh-musuh-Nya, maka datanglah keputusan itu. Jika mereka tidak meminta disegerakan, maka sesungguhnya Allah Maha Penyantun, tidak lekas menyiksa orang yang bermaksiat kepada-Nya. Yakni rugilah di dunia dan akhirat. Sombong dari menaati Allah Azza wa Jalla, sombong terhadap kebenaran (dengan menolaknya), sombong terhadap hamba Allah (dengan merendahkannya) dan bersikap sombong di bumi lagi menentang rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 15",
    "description": "Allah berjanji akan membinasakan orang kafir, karena itu para rasul menyambutnya dengan memohon agar dakwah mereka menemui keberhasilan. Dan mereka memohon kepada Allah agar diberi kemenangan atas para penentang mereka. Allah mengabulkan doa itu, dan binasalah semua orang yang berlaku dan berbuat sewenang-wenang lagi keras kepala dan enggan mengakui keesaan Allah dan beribadah hanya kepada-Nya. Kebinasaan orang yang berbuat sewenang-wenang dan keras kepala antara lain karena di hadapannya ada neraka jahanam sebagai tempat tinggal mereka, dan di sana dia akan diberi minuman dengan air nanah yang keluar dari tubuh-tubuh para penghuni neraka."
  }
]