[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dihadapan orang-orang kafir itu ada neraka jahanam yang akan ia hadapai siksaannya, dan ia akan diberi minum di dalamnya dengan nanah dan darah yang keluar dari tubuh-tubuh para penghuni neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Pada hari kiamat, di depan orang yang sombong itu terbentang neraka Jahanam, ia sudah menantikan mereka, penghuninya diberi minum dari nanah para penghuni api neraka yang keluar dari jasad mereka, minuman yang tidak menghilangkan dahaga, maka yang meminumnya akan terus tersiksa karena dahaga dan berbagai bentuk azab lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. مِّن وَرَآئِهِۦ جَهَنَّمُ (di hadapannya ada Jahannam) Yakni neraka Jahannam telah mengejarnya dan ia pasti akan mendapatkannya. وَيُسْقَىٰ مِن مَّآءٍ صَدِيدٍ(dan dia akan diberi minuman dengan air nanah) Makna (الصديد) yakni apa yang mengalir keluar dari kulit penghuni neraka berupa nanah dan darah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Di hadapannya ada Jahannam mereka akan memasukinya kelak pada hari kiamat, dan dia akan diberi minuman dengan air nanah yang mengalir dari tubuh para penghuni neraka yang bercampur antara nanah dan darah,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di hadapannya} di depannya {ada neraka Jahanam dan dia akan diberi minuman dengan air nanah} dari air yang mengalir dari tubuh penduduk neraka berupa nanah dan darah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “di hadapannya ada Jahannam”, maksudnya jahanam mengintai orang yang arogan lagi penentang tadi. Ia pasti memasukinya, maka dia akan ditimpa siksaan yang keras. “Dan dia akan diberi munuman dengan air nanah”, dengan warna, rasa, dan bau yang menjijikkan, dan minuman ini berada dalam suhu yang sangat tinggi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَّآءٖ صَدِيدٖ) mimmaa’in shadiid : apa yang mengalir dari mulut para penduduk neraka yang bercampur dengan nanah, darah, dan keringat. Makna ayat : Firman-Nya : (مِّن وَرَآئِهِۦ جَهَنَّمُ) yaitu, di hadapan mereka Jahanam yang menantinya untuk memasukinya setelah mereka binasa dan kehausan serta meminta air minum, lalu Zabaniyah memberikan mereka (مِن مَّآءٖ صَدِيدٖ) “dari air nanah” yaitu cairan nanah penduduk neraka, yaitu campuran dari nanah, darah, dan keringat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 16: Ada yang mengatakan, bahwa shadid (lihat ayat tersebut) adalah yang keluar dari perut penghuni neraka bercampur nanah dan darah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 16",
    "description": "Kebinasaan orang yang berbuat sewenang-wenang dan keras kepala antara lain karena di hadapannya ada neraka jahanam sebagai tempat tinggal mereka, dan di sana dia akan diberi minuman dengan air nanah yang keluar dari tubuh-tubuh para penghuni neraka. Diteguk-teguknya air nanah itu dari waktu ke waktu, dan dia hampir tidak bisa menelannya karena sangat panas dan berbau busuk, dan datanglah bahaya maut kepadanya dari segenap penjuru. Berbagai macam azab mengenai hampir sekujur tubuhnya, tetapi dia tidak juga diberi kesempatan untuk mati sehingga rasa sakit akan selalu mereka rasakan. Dan selain itu, di hadapannya masih ada azab yang lebih berat lagi."
  }
]