[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang sombong berusaha menelan nanah dan darah itu dan lain-lain yang mengalir dari tubuh penghuni neraka seteguk demi seteguk. Namun ia tidak mampu untuk menelannya, karena kotor, panas, dan pahit. Dan siksaan pedih datang padanya dari setiap jenis siksaan dan mengenai setiap anggota tubuhnya.Ia tidak menjadi mati sehingga dapat berhenti mengalaminya. Dan baginya setelah siksaan ini ada siksaan lain yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dia meneguknya sedikit demi sedikit karena rasanya sangat pahit, panas dan busuk, dia tidak kuasa menelannya, kematian datang kepadanya dari segala penjuru karena beratnya beban azab yang dideritanya, padahal dia tidak mati sehingga bisa beristirahat, sebaliknya dia akan terus hidup untuk merasakan penderitaan. Dan di depannya ada azab berat lain yang menunggunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. يَتَجَرَّعُهُۥ (diminumnnya air nanah itu) Yakni ia tidak meminumnya sekaligus, namun sedikit demi sedikit karena rasa pahit dan panasnya. وَلَا يَكَادُ يُسِيغُهُۥ(dan hampir dia tidak bisa menelannya) Namun ia menyangkut di tenggorokan, sehingga memperlama azab yang ia dapat, kadang dengan rasa haus dan kadang dengan meminum nanah dengan cara tersebut. وَيَأْتِيهِ الْمَوْتُ مِن كُلِّ مَكَانٍ(dan datanglah (bahaya) maut kepadanya dari segenap penjuru) Yakni sebab kematian mendatangi mereka dari segala arah. وَمَا هُوَ بِمَيِّتٍ ۖ( tetapi dia tidak juga mati) Yakni sebab kematian mendatanginya namun ia tidak mati juga untuk dapat beristirahat dari rasa sakit dan kesengsaraan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Air nanah itu dia minum dan hampir tidak bisa menelannya sekalipun dicoba berkali-kali. Berbagai bahaya maut datang kepadanya dari segenap penjuru, tetapi dia tidak juga mati, dan dihadapannya masih ada azab yang berat yang tidak pernah habis"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diteguk-teguk air itu} dipaksa meminumnya lagi dan lagi, karena getir dan panasnya air itu {dan dia hampir tidak bisa menelannya} tidak bisa menelannya {dan datanglah maut kepadanya dari segala penjuru, tetapi dia tidak kunjung mati. Di hadapannya} di depannya {azab yang berat} yang dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “diminumnya air nanah itu”, lantaran kehausan yang dahsyat “dan hampir dia tidak bisa menelannya”, karena apabila mendekati wajahnya, maka ia membakarnya. Jika sampai ke perut, maka ia memotong-motong usus-usus yang dilintasinya. “Dan datanglah (bahaya) maut kepadanya dari segenap penjuru, tetapi dia tidak juga mati”, maksudnya siksaan pedih menghampirinya dengan berbagai jenisnya. Dan setiap jenis siksaan itu, lantaran sangat dahsyat, menyeretnya kepada kematian. Tetapi, Allah menetapkan mereka tidak akan mati, sebagaimana yang difirmankanNYa, \"Mereka tidak dibinasakan sehingga mereka mati dan tidak (pula) diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir.\" (Fathir:36). Dan FirmanNYa, “Dan di hadapannya”, yaitu di hadapan orang arogan lagi penentang tadi “masih ada azab yang berat”, yaitu yang kuat dan pedih, tidak ada yang mengetahui bentuk dan kengeriannya keculai Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَتَجَرَّعُهُۥ وَلَا يَكَادُ يُسِيغُهُۥ) yatajarra’uhu wa laa yakaadu yusiighuh : menelannya berkali-kali karena rasa pahit, namun tidak kunjung tertelan karena pahit dan menjijikannya. (وَيَأۡتِيهِ ٱلۡمَوۡتُ مِن كُلِّ مَكَانٖ) wa ya’tiihil maut min kulli makaan : “dan kematian mendatanginya dari segala arah” karena begitu beratnya azab yang meliputinya, seluruh penyebab kematian sudah melewatinya, namun ia tidak juga mati. Makna ayat : (يَتَجَرَّعُهُۥ) “ia meminumnya” menelan sedikit demi sedikit karena rasa pahit yang mereka rasakan (وَلَا يَكَادُ يُسِيغُهُۥ) “dan hampir ia tidak bisa menelannya” memasukkannya ke dalam kerongkongannya yang kering kehausan karena rasa jijik, busuk, pahit, dan panas minuman tersebut. Dan firman-Nya : (وَيَأۡتِيهِ ٱلۡمَوۡتُ مِن كُلِّ مَكَانٖ وَمَا هُوَ بِمَيِّتٖۖ) “dan kematian mendatanginya dari segala arah, namun ia tidak juga mati” rasa haus itu mendatangi orang yang angkuh lagi pembangkang ini lalu ia binasa dengan dituangkan air nanah tersebut, dan kematian itu mendatanginya karena sebab-sebab yang telah sempurna dari segala arah. Pada saat itu azab mengelilinginya dari segala arah; atas, bawah, kanan, dan kiri, tapi ia tidak kunjung mati, karena Allah ta’ala tidak mengkehendaki hal tersebut, Allah berfirman : (لَا يَمُوتُ فِيهَا وَلَا يَحۡيَىٰ) “dia tidak mati dan tidak pula hidup di dalamnya.” [Thaha:74]. Firman-Nya : (لَا يُقۡضَىٰ عَلَيۡهِمۡ فَيَمُوتُواْ وَلَا يُخَفَّفُ عَنۡهُم مِّنۡ عَذَابِهَاۚ) “Mereka tidak binasa sehingga mereka mati, dan tidak pula azabnya diringankan.” [Fathir:36]. Dan dari belakangnya ada azab yang di dalamnya (عَذَابٌ) “azab” bentuk lain dari siksaan (غَلِيظٞ) “berat” yaitu keras, tidak ada yang mampu menahannya. Pelajaran dari ayat : • Kebinasaan dan kerugian bagi pelaku syirik, kufur, dan kezaliman. • Besar dan pedihnya azab hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 17: Diteguknya minuman itu seteguk demi seteguk karena pahitnya. Karena keengganannya, namun terpaksa meminumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 17",
    "description": "Diteguk-teguknya air nanah itu dari waktu ke waktu, dan dia hampir tidak bisa menelannya karena sangat panas dan berbau busuk, dan datanglah bahaya maut kepadanya dari segenap penjuru. Berbagai macam azab mengenai hampir sekujur tubuhnya, tetapi dia tidak juga diberi kesempatan untuk mati sehingga rasa sakit akan selalu mereka rasakan. Dan selain itu, di hadapannya masih ada azab yang lebih berat lagi. Seperti itulah Allah menyiksa orang kafir, meski mereka selalu berbuat baik dan berjasa bagi kemanusiaan sepanjang hidupnya. Yang demikian itu karena perumpamaan orang yang ingkar kepada tuhannya, perbuatan yang telah mereka lakukan di dunia yang dipandang baik dan berjasa bagi kemanusiaan seperti abu yang ditiup oleh angin keras pada suatu hari yang berangin kencang. Angin itu menghamburkan abu tersebut hingga tidak tersisa. Demikianlah, mereka tidak kuasa mengambil pahala sama sekali di sisi Allah dari apa yang telah mereka usahakan di dunia karena kekufuran mereka telah menghapus semua amal baik itu. Yang demikian itu, yakni berbuat baik tanpa dilandasi keimanan, adalah bentuk kesesatan yang sangat jauh dari kebenaran."
  }
]