[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karakter amal perbuatan orang-orang kafir di dunia seperti amal kebajikan dan silaturahmi, adalah bagaikan abu yang terbawa terbang oleh angin pada hari yang berangin kencang, sehingga tidak meninggalkan bekas sedikitpun. maka demikian pula amal-amal orang-orang kkafir, mereka tidak mendapati darinya sesuatu yang bermanfaat bagi mereka di sisi Allah. Sungguhnya kekafiran telah melenyapkan (pahalanya) sebagaimana angin telah menghilangkan abu. Usaha dan amal perbuatan yang tidak di bangun di atas asas yang benar, maka itulah kesesatan yang jauh dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Perumpamaan amal kebaikan yang dilakukan oleh orang-orang kafir seperti sedekah, berbuat baik dan mengasihi orang-orang lemah adalah seperti abu yang ditiup angin kencang di hari yang anginnya bertiup sangat kencang, maka angin itu menerbangkannya dengan kuat dan memporak-porandakannya sehingga tidak tersisa di tempatnya, demikianlah amal-amal perbuatan orang-orang kafir, kekufuran menghancurkannya, maka pelakunya tidak memetik faedahnya pada Hari Kiamat. Amal perbuatan yang tidak berasaskan iman adalah kesesatan yang jauh dari jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. amalan orang-orang yang kafir terhadap Tuhan mereka di dunia diumpamakan dengan abu yang terhembus oleh angin kencang, sehingga tidak tersisa; mereka tidak mendapat pahala dari amalan baik yang telah mereka kerjakan. Inilah kerugian yang besar dan perkara yang jauh dari hidayah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. مَّثَلُ الَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ ۖ أَعْمٰلُهُمْ كَرَمَادٍ (Orang-orang yang kafir kepada Tuhannya, amalan-amalan mereka adalah seperti abu) Yakni amalan-amalan mereka ditolak dan dan sirna seperti angin kencang yang menghilangkan abu, angin itu membawanya dengan cepat dan menyebarkannya ke berbagai tempat sehingga tempat asalnya menjadi bersih tak tersisa sedikitpun. لَّا يَقْدِرُونَ مِمَّا كَسَبُوا۟ عَلَىٰ شَىْءٍ ۚ (Mereka tidak dapat mengambil manfaat sedikitpun dari apa yang telah mereka usahakan) Dari amalan mereka yang tertolak. Mereka tidak mendapatkan bekasnya di akhirat berupa pahala. ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِيدُ(Yang demikian itu adalah kesesatan yang jauh) Jauh dari jalan kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara keunikan tamtsil ini adalah diserupakannya dengan keadaan abu yang bersatu; karena abu dalam perumpamaan ini diibartkan sebagai bekas dari amalan yang paling baik bagi orang-orang kafir, sampai akhirnya abu yang banyak itu sebagai kinayah untuk lisan mereka tentang suatu kemuliaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Yang mengherankan dari amal para orang yang kafir kepada Tuhannya, adalah bahwa amalan-amalan mereka adalah seperti abu yang ditiup angin dengan keras pada suatu hari yang berangin kencang. Mereka tidak dapat mengambil manfaat sedikitpun dari apa yang telah mereka usahakan di dunia. Yang demikian itu adalah kesesatan yang jauh dari kemanfaatan, kebenaran, dan kerugian beserta kebinasaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perumpamaan orang-orang yang ingkar kepada Tuhannya, perbuatan mereka itu seperti abu yang ditiup oleh angin kencang pada saat badai} tiupan angin kencang {Mereka tidak mendapatkan apapun dari apa yang telah mereka usahakan} di akhirat, orang-orang kafir tidak mendapatkan pahala dari kebaikan yang mereka lakukan di dunia karena kesia-siannya dengan kekufuran {Yang demikian itu adalah kesesatan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Allah mengabarkan tentang amalan-amalan yang diperbuat oleh kaum kafir, baik yang dimaksud adalah amalan yang mereka kerjakan untuk Allah, amalan tersebut ditinjau dari aspek hilangnya manfaat, kebatilan dan kepudaran amalan mereka ibarat melayangnya abu yang merupakan obyek paling lembut dan paling ringan ketika angina bertiup kencang di hari yang anginnya sangat kencang. Ia tidak menyisakan apa pun, dan tidak dimungkinkan untuk menangkap sesuatu yang telah lenyap dan kabur. Begitu pula amalan-amalan orang-orang kafir, “mereka tidak dapat mengambil manfaat sedikit pun dari apa yang telah mereka usahakan (di dunia)”, bahkan tidak (mampu mendapatkan manfaat) sebesar biji dzarrah pun dari amalannya. Pasalnya, amalan tersebut berpondasi kekufuran dan pendustaan. “Yang demikian itu adalah kesesatan yang jauh”, di mana usaha mereka menjadi batil (sia-sia) dan amalan mereka menjadi musnah. Atau bisa juga yang dimaksud adalah usaha-usaha orang kafir yang mereka tempuh untuk menipu daya kebenaran. Mereka benar-benar berupaya dan kelelahan untuk itu. Padahal makar orang-orang kafir itu berubah menjelma boomerang bagi mereka sendiri, tidak membahayakan Allah dan rasulNya, pasukanNya dan kebenaran yang mereka sampaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَعۡمَٰلُهُمۡ كَرَمَادٍ) a’amaaluhum karamaad : “amalan-amalan mereka bagaikan debu” yaitu amalan baik seperti: silaturahmi, berbakti kepada orang tua, memuliakan tamu, membebaskan budak. Dan amalan keburukan: menyembah berhala dengan menyembelih, bernazar, bersumpah, dan berdiam diri di sekelilingnya seperti debu. (لَّا يَقۡدِرُونَ مِمَّا كَسَبُواْ عَلَىٰ شَيۡءٖۚ) laa yaqdiruuna mimmaa kasabuu ‘alaa syaii’ : tidak memperoleh apapun berupa pahala sekalipun sedikit dari amalan mereka yang telah mereka kerjakan, karena amalan mereka hancur disebabkan kesyirikan. Makna ayat : Firman-Nya : (مَّثَلُ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ أَعۡمَٰلُهُمۡ كَرَمَادٍ ٱشۡتَدَّتۡ بِهِ ٱلرِّيحُ فِي يَوۡمٍ عَاصِفٖۖ) “Perumpamaan orang-orang yang kafir kepada Rabb mereka, amalan-amalan mereka bagaikan debu yang ditiup angin pada hari yang berangin kencang” bertiup dengan kencang pada hari itu (لَّا يَقۡدِرُونَ مِمَّا كَسَبُواْ) “mereka tidak mendapatkan dari yang telah mereka kerjakan” dari amalan-amalan mereka ketika di dunia (عَلَىٰ شَيۡءٖۚ) “sedikit pun” berupa pahala dan balasan yang baik atasnya. Ini adalah perkerjaan mereka yang baik seperti perbuatan baik dan luhur, dan perbuatang mereka yang buruk; syirik, kufur, dan penyembahan kepada selain Allah yang mereka harapkan darinya kebaikan, seluruhnya hilang bagai debu yang beterbangan karena angin dan terbang bersamanya di hari yang berangin kencang. Firman-Nya : (ذَٰلِكَ هُوَ ٱلضَّلَٰلُ ٱلۡبَعِيدُ) “Itu merupakan kesesatan yang jauh.” Perkara yang ditunjukkan oleh permisalan di atas adalah kesesatan yang jauh bagi yang terjatuh kepada hal tersebut, karena seluruh amalannya hilang, musnah sia-sia tanpa sisa, ia tidak bisa memanfaatkan apapun darinya dan menjadi orang-orang yang merugi. Pelajaran dari ayat : • Musnahnya amalan orang-orang musyrik dan kafir serta sengsaranya mereka, karena tidak mendapatkan hasil dari amalan mereka sedikitpun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 18: Yakni perbuatan mereka yang saleh, seperti silaturrahim, sedekah, dan sebagainya dalam hal tidak ada manfaatnya adalah seperti abu yang ditiup angin kencang. Bisa juga maksud perbuatan di sini adalah usaha atau tipu daya mereka untuk menolak kebenaran, yakni akan menjadi sia-sia dan kembali menimpa mereka. Sehingga berhamburan, yang menunjukkan sia-sianya amal mereka. Yakni mereka tidak mendapatkan pahalanya, karena amalan tersebut dibangun di atas kekafiran dan mendustakan. Yakni kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 18",
    "description": "Seperti itulah Allah menyiksa orang kafir, meski mereka selalu berbuat baik dan berjasa bagi kemanusiaan sepanjang hidupnya. Yang demikian itu karena perumpamaan orang yang ingkar kepada tuhannya, perbuatan yang telah mereka lakukan di dunia yang dipandang baik dan berjasa bagi kemanusiaan seperti abu yang ditiup oleh angin keras pada suatu hari yang berangin kencang. Angin itu menghamburkan abu tersebut hingga tidak tersisa. Demikianlah, mereka tidak kuasa mengambil pahala sama sekali di sisi Allah dari apa yang telah mereka usahakan di dunia karena kekufuran mereka telah menghapus semua amal baik itu. Yang demikian itu, yakni berbuat baik tanpa dilandasi keimanan, adalah bentuk kesesatan yang sangat jauh dari kebenaran. Melaksanakan ancaman-Nya kepada orang kafir adalah suatu hal yang mudah bagi Allah, seperti mudahnya dia menciptakan langit dan bumi. Wahai manusia, tidakkah kamu memperhatikan bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak' Allah menciptakan kedunya beserta pernik-perniknya dengan benar, harmonis, dan penuh keteraturan agar menjadi bukti keesaan dan kekuasaan-Nya bagi kamu. Janganlah kalian mengingkari dan menyekutukan-Nya, karena jika dia menghendaki, niscaya dia dapat membinasakan kamu dan mendatangkan sebagai penggantimu makhluk yang baru dan lebih baik, lebih sempurna, serta lebih taat daripada kamu."
  }
]