[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu tahu wahai seseorang yang diajak bicara-dan yang dimaksud adalah seluruh manusia- bahwa sesungguhnya Allah telah mengadakan langit dan bumi dalam bentuk yang benar yang menunjukan sifat bijaksanaNya, dan bahwasannya Dia tidak menciptakannya dengan main-main tanpa tujuan berarti, akan tetapi keduanya untuk tujuan menunjukan keesaanNya dan kesempurnaan kekuasaanNya, sehingga mereka beribadah kepaada Allah semata dan tidak mempersekutukan apapun dengannNya? jika Dia berkehendak, niscaya Dia akan menyirnakan kalian dan mendatangkan satu kaum selain kalian yang taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Tidakkah kalian tahu -wahai manusia- bahwa Allah menciptakan langit dan bumi dengan kebenaran. Bila Allah berkehendak untuk melenyapkan kalian wahai manusia dan mendatangkan manusia lainnya yang menyembah-Nya dan menaati-Nya sebagai pengganti kalian niscaya Allah melakukannya, hal itu mudah saja bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Hai manusia, tidakkah kalian mengetahui bahwa Allah telah menciptakan tujuh langit dan bumi dengan aturan yang tetap dan sempurna? Dia tidak menciptakannya untuk sesuatu yang sia-sia, namun untuk menjadi bukti atas keesaan-Nya dan kebenaran. Jika Dia menghendaki, niscaya Dia akan membinasakan kalian dan menciptakan kaum yang lain yang lebih baik dari kalian, hal ini bagi Allah tidaklah sesuatu yang mustahil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ ۚ (Allah telah menciptakan langit dan bumi dengan hak) Yakni dengan alasan yang benar, yaitu agar menjadi bukti yang menunjukkan kesempurnaan kuasa-Nya. إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ(Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mengganti(mu) dengan makhluk yang baru) Jika Dia menghendaki niscaya Dia akan membinasakan para pelaku kemaksiatan, kemudian mendatangkan makhluk yang lain yang mentaati-Nya, baik itu dari jenis manusia atau jenis yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Tidakkah kamu perhatikan, bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak sebagai petunjuk akan kesempurnaan kekuasaan-Nya? Dengan hikmah dan pentunjuk yang jelas bahwa Dia-lah Yang telah menciptakannya. Jika Dia menghendaki, niscaya Dia membinasakan kamu dan menggantimu dengan makhluk yang baru yang lebih taat dan lebih baik dari kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak memperhatikan bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan benar. Jika Dia menghendaki, niscaya Dia membinasakan kalian dan mendatangkan makhluk yang baru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Allah mengingatkan para hambaNya bahwasanya Dia “telah menciptakan langit dan bumi dengan haq”, agar mahluk-makhlukNya beribadah kepadaNya, mengenalNya, serta memerintahkan dan melarang mereka. Juga supaya mereka menjadikan keduanya (langit dan bumi) dan seisinya sebagai bukti atas kesempurnaan sifatNYa, dan supaya mereka mengetahui bahwa Dzat yang menciptakan langit dan bumi –padahal begitu besar dan luas- mampu untuk mengembalikan mereka kepada ciptaan yang baru, untuk membalas mereka atas kebaikan dan keburukan mereka, dan (memberitahukan bahwa) kekuasaan Allah dan kehendakNya tidak kerepotan untuk melakukannya. Oleh karenanya, Allah berfirman, “Jika Dia menghendaki, niscaya DIa membinasakanmu, dan mengganti (mu) dengan makhluk yang baru”, ayat itu mengandung suatu pengertian, bila Allah menghendaki, niscaya Allah melenyapkan kalian dan mendatangkan umat yang baru selain kalian, yang akan menjadi makhluk yang lebih taat kepada Allah daripada kalian. Dan juga memuat pengertian, jika Allah menghendaki, niscaya Dia akan memusnahkan kalian lantas mengembalikan wujud kalian dengan membangkitkan kalian (dari kubur) dalam wujud manusia baru. Dua pengertian ini ditunjukkan pada pembahasan Hari Kiamat yang disebutkan Allah nanti."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ) “Apakah engkau tidak melihat bahwa Allah menciptakan langit dan bumi dengan kebenaran?” yaitu apakah engkau tidak mengetahui, wahai Rasul, bahwa Allah menciptakan langit dan bumi dengan kebenaran, agar manusia mengingat Allah dan bersyukur kepada-Nya, dan seandainya ia mengingkari Rabbnya, kufur kepada-Nya dan berbuat syirik dalam beribadah kepada-Nya, Dia akan menyiksanya dengan azab yang pedih—sebagaimana yang telah disebutkan dalam pembahasan sebelumnya, karena Allah ta’ala tidak menciptakan langit dan bumi sia-sia dan tidak berguna, namun menciptakannya dan apa yang ada di dalamnya agar Dia diingat di dalamnya dan nikmat-nikmat-Nya disyukuri. Barangsiapa yang meninggalkan dzikir dan syukur maka Dia akan menyiksanya dengan azab yang kekal dan abadi. Firman-Nya : (إِن يَشَأۡ يُذۡهِبۡكُمۡ) “Jika Dia berkehendak, Dia akan memusnahkan kalian” Wahai para manusia yang membangkang dari ketaatan kepada-Nya dan berbuat syirik! (وَيَأۡتِ بِخَلۡقٖ جَدِيدٖ) ”dan menciptakan ciptaan yang baru.” Selain kalian yang menyembah-Nya dan mengesakan-Nya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 19: Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya, bahwa Dia yang menciptakan langit dan bumi dengan kebenaran (bukan dengan percuma, melainkan dengan penuh hikmah), agar manusia menyembah Allah, mengenal-Nya, agar Dia memerintah dan melarang mereka, dan agar mereka menjadikan keduanya (langit dan bumi) sebagai dalil yang menunjukkan sifat-Nya yang sempurna, dan agar mereka mengetahui -bahwa yang menciptakan langit dan bumi meskipun begitu luas dan besar- mampu membangkitkan kembali mereka yang telah mati untuk memberikan balasan terhadap amal mereka. Yang lebih taat kepada Allah daripada kamu. Bisa juga maksudnya, bahwa jika Dia menghendaki Dia dapat membinasakan mereka lalu membangkitkan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 19",
    "description": "Melaksanakan ancaman-Nya kepada orang kafir adalah suatu hal yang mudah bagi Allah, seperti mudahnya dia menciptakan langit dan bumi. Wahai manusia, tidakkah kamu memperhatikan bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak' Allah menciptakan kedunya beserta pernik-perniknya dengan benar, harmonis, dan penuh keteraturan agar menjadi bukti keesaan dan kekuasaan-Nya bagi kamu. Janganlah kalian mengingkari dan menyekutukan-Nya, karena jika dia menghendaki, niscaya dia dapat membinasakan kamu dan mendatangkan sebagai penggantimu makhluk yang baru dan lebih baik, lebih sempurna, serta lebih taat daripada kamu. Dan ketahuilah, yang demikian itu, yakni menggantimu dengan makhluk yang lebih baik dan lebih sempurna adalah hal yang tidak sukar bagi Allah."
  }
]