[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Alif lam ra. Keterangan tentang huruf-huruf yang terpisah-pisah (seperti ini) telah berlalu dimuka pada permulaan surat al-baqarah. Al-qur’an ini adalah kitab yang kami wahyukan kepadamu -wahai rasul-, agar dengan itu kamu mengeluarkan manusia dari kesesatan dan penyimpangan menuju dan hidayah dan cahaya, -dengan izin tuhan mereka dan taufikNya-, menuju islam yang merupakan jalan menuju Allah yang Mahakuasa lagi Mahaterpuji dalam segala keadaan. Allah yang milikNya semua yang ada di langit dan semua yang ada di bumi, sebagai ciptaan dan milikNya dan dibawah kendaliNya. Maka Dialah yang peribadahan wajib diarahkan kepadaNya semata. Dan akan menimpa kepada orang-orang yang tidak beriman kepada Allah dan tidak mengikuti rasul-Nya pada hari kiamat nanti kebinasaan dan siksaan pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Hanya milik Allah semata hak kepemilkan apa yang ada di langit. Hanya milik Allah semata hak kepemilkan apa yang ada di bumi. Maka hanya Allah semata yang berhak disembah, tidak disekutukan dengan siapa pun dari makhluk-Nya. Orang-orang kafir akan memperoleh azab yang keras."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَوَيْلٌ لِّلْكٰفِرِينَ (Dan kecelakaanlah bagi orang-orang kafir) Kata (الويل) digunakan untuk mengungkapkan azab dan kebinasaan. Orang-orang kafir yang tidak berhenti dari kekafirannya dengan hidayah yang dibawa oleh Rasulullah adalah orang-orang yang berhak mendapatkan kebinasaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah-lah Tuhan Yang memiliki segala apapun yang ada di langit dan di bumi, baik semua kerajaan, semua makhluk, segala perubahan, kekuasaan dan penyembahan Dan kecelakaan dan azab bagi orang-orang yang mengingkari wujud Allah dan menyembah selain Dia berupa siksaan yang sangat pedih pada hari kiamat,Mereka diajak untuk menerima azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah yang memiliki segala apa yang ada di langit dan yang ada di bumi. Kecelakaanlah bagi orang-orang kafir karena siksaan yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Allah memberitahukan bahwa Dia telah menurunkan kitabNya kepada RasulNYa Muhammad, demi kemaslahatan para makhluk. Yaitu untuk mengentaskan manusia dari kegelapan kebodohan, kekufuran, dan perangai-perangai yang buruk serta beragam maksiat menuju cahaya ilmu, iman, dan akhlak yang baik. Firman Allah “dengan izin Rabb mereka”, maksudnya tidak akan terwujud hal yang mereka sukai karena (mencari ridha) Allah, mellainkan dengan kehendak dan pertolongan dari Allah. Hal ini mengandung anjuran bagi para hamba untuk meminta pertolongan Allah. Hal ini mengandung anjuran bagi para hamba untuk meminta bantuan kepada Rabb mereka. Kemudian Allah menerangkan arti ‘cahaya’ yang mana kitab ini memberi petunjuk mereka kepada cahaya itu seraya berfirman, “(Yaitu) menuju jalan Rabb Yang Maha Terpuji,” maksudnya jalan yang menghubungkan kepadaNya dan ke kampung kemuliaanNya, yang mencakup penguaasan imu kebenaran dan pengamalanya. Dalam penyebutan nama Allah al- ‘aziz dan al-Hamid (Yang Maha Perkasa lagi Maha Terpuji) sesudah penyebutan jalan yang menghubungkan menuju kemuliaanNya secara implisit, terkandung isyarat bahwa siapa saja yang menelusurinya (jalan tersebut), maka dia akan menjadi orang yang penuh kemuliaan dengan kemuliaan dari Allah, insan yang kuat meskipun tanpa pendukung kecuali Allah, terpuji dalam segala urusannya, dan akhir hidupnya pun baik. Itu semua sungguh membuktikan bahwa jalan Allah menjadi salah satu bukti kuat tentang kepemilikan Allah atas sifat-sifat yang sempurna dan agung, dan bahwa Dzat yang menegakkan jembatan tersebut adalah dzat yang mempunyai kekuasaan yang kuat, terpuji dalam setiap ucapan, tindakan dan ketetapan hukumnya, dan bahwa Dia diibadahi dengan berbagai jenis ibadah yang merupakan anak tangga menuju Sirath al-Mustaqim. Dan bahwa sebagaimana Allah menguasai kerajaan langit dan bumi, dalam aspek penciptaan, pemberian rizki dan pengaturan, maka Dia juga menguasai hak penetapan hukum atas hamba-hambaNya dengan hukum-hukum agama. Sebab mereka adalah miikNya, dan tidak sepantasnya bagi Allah membiarkan mereka begitu saja dengan sia-sia. Usai menerangkan dalil dan buktinya, maka Allah mengancam orang-orang yang tidak patuh terhadap ketentuan tersebut. Allah berfirman, “Dan celakalah orang-orang kafir karena siksaan yang sangat pedih,” yang tidak bisa diperkirakan kadar tingkat (kepedihaannya) dan tidak bisa dideskripsikan hakikat siksaanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (ٱللَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ) “Allah yang milik-Nyalah apa yang ada di langit dan apa yang ada di bumi.” Yang menciptakan, menguasai, mengatur, dan menjalankannya, Dia lah Allah Sang Pemilik jalan yang lurus yang mengantarkan kepada kebahagiaan dan kesempurnaan manusia, dan orang-orang kafir mereka berpaling bahkan menghalang-halangi dari jalan ini, maka celakalah mereka dengan azab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 2: Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Oleh karena itu, Dia yang berhak menetapkan syari’at bagi hamba-hamba-Nya. Yakni orang-orang yang tidak mau mengikuti jalan-Nya itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 2",
    "description": "Allah yang mahaperkasa itulah yang memiliki apa saja yang ada di langit dan apa saja yang ada di bumi. Bukti-bukti tentang wujud, keesaan, dan kekuasaan Allah berulang kali dijelaskan, tetapi masih banyak orang yang mengingkari. Oleh sebab itu, celakalah bagi orang yang ingkar kepada tuhan karena mereka pasti akan mendapat siksaan yang sangat berat. Mereka yang ingkar dan enggan beriman kepada Allah adalah orang yang lebih menyukai kehidupan dunia yang fana daripada kehidupan akhirat yang kekal dan abadi, dan menghalang-halangi manusia dari menyusuri jalan (agama) Allah, dan menginginkan jalan yang bengkok agar sesuai dengan hawa nafsu mereka. Mereka itu benar-benar berada dalam jalan kesesatan yang sangat jauh dari hidayah."
  }
]