[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah penghancuran kalian dan mendatangkan orang-orang selain kalian merupakan hal yang mustahil bagi Allah, bahkan merupakan perkara mudah lagi ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Membinasakan kalian dan mendatangkan kaum yang baru selain kalian bukan sesuatu yang sulit bagi Allah, karena Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang melemahkan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَمَا ذٰلِكَ عَلَى اللهِ بِعَزِيزٍ (dan yang demikian itu sekali-kali tidak sukar bagi Allah) Yakni mendatangkan makhluk yang lain bukanlah sesuatu yang tidak mungkin bagi Allah, karena Dia berkuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Yang demikian itu sekali-kali tidak sukar bagi Allah. Sesungguhnya Allah Maha Kuasa atas segala sesuatu, dengan kata kun jadilah, maka jadi (Albaqarah 117 dan surah-surah lainnya)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu bagi Allah tidak sulit} tidak dapat dicegah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “Dan yang demikian itu sekali-kali tidak sukar bagi Allah”, maksudnya, tidak mustahil , bahkan merupakan perkara mudah sekali bagiNya. \"Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat.\" (Luqman:28) \"Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya.\" (Ar-Rum:27)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ) wa maa dzaalika ‘alallaahi bi ‘aziiz : “tidaklah hal itu sulit bagi Allah.” Kesulitan yang tidak bisa dikerjakan. Makna ayat : (وَمَا ذَٰلِكَ عَلَى ٱللَّهِ بِعَزِيزٖ ) “dan hal itu tidaklah sulit bagi Allah.” Bukan perkara yang Dia tidak mampu atau sulit, karena Allah Maha Kuasa atas segala sesuatu. Pelajaran dari ayat : • Azab bagi pelaku kekufuran, syirik, dan kezaliman adalah pasti, karena mereka tidak mengingat (Allah) dan tidak bersyukur (kepada-Nya), karena syukur dan dzikir adalah sebab wujud segalanya, seandainya mereka menyia-nyiakan hidup, maka mereka pantas untuk diazab selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 20: Bahkan hal itu mudah bagi-Nya. Allah Subhaanahu wa Ta'aala juga berfirman di ayat lain, “Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja. Sesungguhnya Allah Maha mendengar lagi Maha melihat.” (Terj. Luqman: 28)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 20",
    "description": "Dan ketahuilah, yang demikian itu, yakni menggantimu dengan makhluk yang lebih baik dan lebih sempurna adalah hal yang tidak sukar bagi Allah. Semua makhluk pasti akan merasakan kematian. Dan setelah mati, mereka semua di padang mahsyar akan berkumpul untuk menghadap ke hadirat Allah guna mempertanggungjawabkan perbuatan mereka. Setelah mereka berkumpul lalu orang yang lemah'para pengikut orang kafir'berkata kepada orang yang sombong'pemimpin mereka di dunia, sesungguhnya kami dahulu adalah pengikut-pengikutmu dalam mendustakan para nabi dan rasul, maka dapatkah kamu pada hari ini menghindarkan kami dari azab Allah yang sangat pedih ini, walaupun sedikit saja, seperti janji kamu dahulu' mereka menjawab, sekiranya Allah memberi petunjuk kepada kami untuk beriman, niscaya kami dapat memberi petunjuk kepadamu dan membimbing kamu menuju keselamatan. Akan tetapi kita lebih memilih jalan kesesatan sehingga hari ini sama saja bagi kita, apakah kita mengeluh atau bersabar. Kita semua tidak mempunyai tempat sedikit pun untuk melarikan diri dari siksa Allah."
  }
]