[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan makhluk-makhluk akan keluar dari kubur mereka dan berdiri tegak semuanya pada hari kiamat di hadapan Allah yang maha Esa lagi amah perkasa, untuk memutuskan perkara di tengah mereka, lalu para pengikut berkata kepada para pemimpin mereka, ”sesungguhnya kami adalah pengikut-pengikut kalian di dunia, kami taat menjalankan apa diperintahkan kalian, maka apakah hari ini kalian akan menghindarkan dari kami siksaan Allah barang sedikit saja, sebagaimana dahulu kalian telah menjanjikannya kepada kami? maka para pemimpin berkata, ”seandainya Allah memberikan kami hidayah menuju keimanan, tentulah kami akan benar-benar menunjuki kalian padanya. Akan tetapi, Dia tidak memberikan taufik kepada kami, sehingga kami sesat dan menyesatkan kalian. Sama saja, berkeluh ataupun bersabar bagi kami dan kalian.Tidak ada jalan kabur dan tempat menyelamatkan diri bagi kita dari siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Makhluk-makhluk keluar dari alam kubur mereka untuk menghadap Allah pada Hari Kiamat. Maka para pengikut yang lemah berkata kepada para pemimpin dari kalangan pembesar, \"Dahulu kami -wahai para pemimpin- adalah orang-orang yang mengikuti kalian, kami melaksanakan perintah kalian, kami menahan diri dari larangan kalian, apakah sekarang kalian bisa membela kami di hadapan azab Allah sedikit saja?” Para pemimpin menjawab, “Seandainya Allah membimbing kami kepada hidayah niscaya kami membimbing kalian kepadanya sehingga kita semuanya selamat dari azab-Nya, akan tetapi kami tersesat maka kami menyesatkan kalian. Sama saja bagi kita semuanya, apakah kita kuat atau tidak kuat memikul azab Allah, kita tetap tidak bisa lari darinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah menyampaikan percakapan yang akan terjadi antara para pemimpin kekafiran dengan para pengikut mereka serta perkataan setan kepada mereka semua: Seluruh makhluk menghadap Allah setelah mereka keluar dari kubur pada hari kiamat; kemudian para pengikut pemimpin kekafiran berkata kepada para pemimpin mereka: “Dahulu di dunia kami adalah pengikut kalian dalam kekafiran, maka apakah kalian dapat menjauhkan sedikit saja azab Allah dari kami?” Maka para pemimpin mereka berkata: “Andai saja Allah memberi kami petunjuk kepada keimanan, niscaya kami akan memberi kalian petunjuk. Akan tetapi sekarang tidak bermanfaat bagi kita apakah kita akan mengeluh atau bersabar karena tidak ada yang dapat menyelamatkan kita dari azab Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَبَرَزُوا۟ لِلّٰهِ جَمِيعًا (Dan mereka semuanya (di padang Mahsyar) akan berkumpul menghadap ke hadirat Allah) Yakni mereka bangkit dari kubur mereka di hari kiamat menuju padang mahsyar, yaitu tempat yang luas dan tinggi sebagai tempat mereka semua berkumpul. فَقَالَ الضُّعَفٰٓؤُا۟( lalu berkatalah orang-orang yang lemah) Yakni prngikut-pengikut yang lemah itu berkata kepada pemimpin-pemimpin mereka yang kuat dan menyombongkan diri karena kepemimpinannya. إِنَّا كُنَّا لَكُمْ تَبَعًا (Sesungguhnya kami dahulu adalah pengikut-pengikutmu) Yakni di dunia. Sehingga kami mendustakan paara rasul dan kafir terhadap Allah karena mengikuti jejak kalian. فَهَلْ أَنتُم مُّغْنُونَ عَنَّا(aka dapatkah kamu menghindarkan daripada kami) Yakni apakah kalian akan membela dan menolong kami. مِنْ عَذَابِ اللهِ مِن شَىْءٍ ۚ( azab Allah (walaupun) sedikit saja) Yakni sedikit dari azab Allah. قَالُوا۟ لَوْ هَدَىٰنَا اللهُ(Mereka menjawab: “Seandainya Allah memberi petunjuk kepada kami) Untuk beriman. لَهَدَيْنٰكُمْ ۖ( niscaya kami dapat memberi petunjuk kepadamu) Agar kalian juga beriman. سَوَآءٌ عَلَيْنَآ أَجَزِعْنَآ أَمْ صَبَرْنَا(Sama saja bagi kita, apakah kita mengeluh ataukah bersabar) Sama saja bagi kita antara mengeluh atau bersabar. مَا لَنَا مِن مَّحِيصٍ (Sekali-kali kita tidak mempunyai tempat untuk melarikan diri) Yakni tempat lari dan menyelamatkan diri dari azab."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَبَرَزُوا لِلَّهِ } \"Dan mereka semuanya (di padang Mahsyar) akan berkumpul menghadap ke hadirat Allah\" padahal Allah maha mengetahui tentang mereka semua dan tidak akan tersembunyi sedikitpun dihadapan Allah tentang keadaan mereka, sama saja ketika mereka menampakkan diri atau tidak. Hikmah dari peristiwa ini adalah : karena sesungguhnya ketika di dunia mereka selalu menutup diri dari penglihatan orang banyak ketika melakukan kemaksiatan, dan mereka menyangka bahwa tindakan itu juga akan tertutup di hadapan Allah, namun sangkaan itu tidak sama dengan kenyataannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Mereka semuanya di padang Mahsyar akan berkumpul menghadap ke hadirat Allah, lalu orang-orang yang lemah berkata kepada orang-orang yang sombong: “Sesungguhnya kami dahulu adalah pengikut-pengikutmu, maka mampukah kamu menghindarkan kami darip azab Allah walaupun sedikit saja? Mereka orang-orang yang sombong menjawab: “Seandainya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepadamu. Sama saja bagi kita, apakah kita mengeluh ataukah bersabar. Sekali-kali kita tidak mempunyai tempat untuk melarikan diri dari azab Allah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkumpul} para makhluk keluar dari kubur mereka {untuk menghadap kepada Allah. Lalu orang-orang yang lemah berkata} para pengikut {kepada orang-orang yang sombong} para pemimpin yang mengatur {“Sesungguhnya kami dahulu adalah pengikut-pengikut kalian} para pengikut {Maka apakah kalian bisa menghindarkan} melindungi {kami dari azab Allah sedikit saja” Mereka menjawab} para pemimpin dari pengikut itu berkata {“Sekiranya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepada kalian. Sama saja} sama saja {bagi kita, apakah kita mengeluh atau bersabar. Kita tidak mempunyai tempat untuk melarikan diri”} tempat melarikan diri maupun tempat berlindung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Dan mereka akan berkumpul “, yaitu makhluk-makhluk “semuanya menghadap ke hadirat Allah”, ketika sangkakala ditiup. Mereka pun bangkit dari kubur-kubur menuju Rabb mereka, berdiri di permukaan bumi yang rata, datar sama sekali, tiada sedikit pun kamu melihat padanya tempat yang rendah dan yang tinggi. Mereka berdiri menghadap ke hadirat Allah, tidak ada sesuatu pun dari keadaan mereka yang tersembunyi atasnya. Ketika berhadapan, maka mereka melakukan perdebatan mencari-cari alasan. Setiap orang membebaskan dirinya dan berupaya membela diri sebisanya. Tetapi, apakah itu bisa mereka lakukan? Maka berkatalah, “orang-orang yang lemah,” yaitu yang mengekor dan mengedepankan fanatisme buta “kepada orang-orang yang sombong”, mereka adalah para panutan mereka yang menjadi lokomotif dalam kesesatan, “Sesungguhnya kami dahulu adalah pengikut-pengikutmu”, di dunia, kalian memerintahkan kami untuk berbuat kesesatan dan menyodorkannya kepada kami dalam keadaan memikat sehingga kalian pun menjerumuskan kami dalam kesesatan. “Maka dapatkah kamu”, pada hari ini “menghindarkan dari kami azab Allah (walaupun) sedikit saja”, meski hanya siksaan seberat biji dzarrah saja. Seandainya “mereka mengatakan”, yaitu para panutan dan pimpinan, “Kami menyesatkan kalian sebagaimana kami telah sesat, maka “seandainya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepadamu”, sehingga tidak ada seorang pun yang memberi petunjuk kepadamu”, sehingga tidak ada seorang pun yang bisa menolong orang lain. “Sama saja bagi kita apakah kita mengeluh”, karena siksaan “ataukah sabar” menghadapinya “sekali-kali kita tidak mempunyai tempat untuk melarikan diri”, (yaitu berupa) tempat perlindungan yang kami bersembunyi di sana, juga tidak ada tempat melarikan diri bagi kami dari siksaan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَبَرَزُواْ لِلَّهِ جَمِيعٗا) wa barazuu lilllahi jamii’an : seluruh makhluk menghadap kepada Allah, dan itu terjadi pada hari kiamat. (إِنَّا كُنَّا لَكُمۡ تَبَعٗا) innaa kunnaa lakum taba’aa : “Sesungguhnya kamii dahulu mengikuti kalian” yaitu mengikuti apa yang kalian yakini dan kerjakan. (فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا) fa hal antumm mughnuuna ‘annaa : “Apakah kalian mampu menghindarkan kami” yaitu menolong kami dari sebagian azab. (مَا لَنَا مِن مَّحِيصٖ) maa lanaa mim mahiish : “kita tidak memiliki jalan keluar.” Tempat kembali, lari, dan berlindung. Makna ayat : Pada ayat-ayat berikut terdapat sekilas mengenai kejadian dan apa yang terjadi setelahnya berupa menetapnya penduduk neraka di neraka, dan penduduk surga di surga, begitu juga penegasan akan perkara wahyu, tauhid, dan kebangkitan hari akhir nanti dengan dalil-dalil yang tidak terbantahkan. Firman-Nya : (وَبَرَزُواْ لِلَّهِ جَمِيعٗا) “dan mereka menghadap kepada Allah” yaitu, seluruh manusia keluar dari kubur mereka, yang beriman maupun yang kafir, yang saleh dan yang rusak. (فَقَالَ ٱلضُّعَفَٰٓؤُاْ) “Maka orang-orang yang lemah berkata” yaitu orang para pengikut mereka (لِلَّذِينَ ٱسۡتَكۡبَرُوٓاْ) “kepada orang-orang yang sombong” para pemimpin dan tokoh masyarakat karena mereka memiliki kekuatan dan kekuasaan (إِنَّا كُنَّا لَكُمۡ تَبَعٗا) “Sungguh kami dahulu adalah pengikut kalian” pengikut keyakinan kalian dan kami beragama dengannya, (فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَيۡءٖۚ) “Maka apakah kalian dapat menyelamatkan kami dari azab Allah walau sedikit saja?” apakah kalian bisa mengangkat sebagian azab ini dari kami karena kami adalah pengikut kalian? Maka mereka menjawab sebagaimana yang Allah kabarkan : (قَالُواْ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَيۡنَٰكُمۡۖ) “Mereka berkata seandainya Allah memberikan kami hidayah niscaya kami akan memberikannya juga kepada kalian.” Mereka sekarang mengakui dan menegaskan bahwa hidayah hanya milik Allah, namu kami telah sesat dan menyesatkan kalian (سَوَآءٌ عَلَيۡنَآ أَجَزِعۡنَآ) “sama saja bagi kita, mengeluh” hari ini (أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِيصٖ) “atau bersabar, sekali-kali kita tidak punya tempat untuk lari.” Yaitu lolos dan lari dari azab ini. Pelajaran dari ayat : • Penjelasan bahwa taklid dan ikut-ikutan tidak menjadi alasan di hadapan Allah ta’ala. • Penjelasan bahwa setan adalah sesembahan yang disembah selain Allah, karena dia mengajak kepada peribadahan kepada selain Allah dan menghiasi hal tersebut di pandangan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 21: Lafaz “Barazuu” (menghadap) di ayat tersebut menggunakan fi’il madhi (kata kerja lampau) untuk menunjukkan benar-benar akan terjadi. Yaitu ketika sangkakala ditiup yang kedua kalinya. Ketika itu, mereka keluar dari kubur menghadap Tuhan mereka, lalu mereka berdiri dan berkumpul di padang mahsyar yang datar; tidak ada tempat yang rendah dan tidak ada tempat yang tinggi. Di sana mereka saling berbantah-bantahan, dan masing-masing membela dirinya sendiri. Yakni para pengikut. Yakni orang yang diikuti yang menjadi pemimpin kesesatan. Ketika di dunia. Kamu memerintahkan kami perintah yang menyesatkan, menghiasi kesesatan itu sehingga kami pun tersesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 21",
    "description": "Semua makhluk pasti akan merasakan kematian. Dan setelah mati, mereka semua di padang mahsyar akan berkumpul untuk menghadap ke hadirat Allah guna mempertanggungjawabkan perbuatan mereka. Setelah mereka berkumpul lalu orang yang lemah'para pengikut orang kafir'berkata kepada orang yang sombong'pemimpin mereka di dunia, sesungguhnya kami dahulu adalah pengikut-pengikutmu dalam mendustakan para nabi dan rasul, maka dapatkah kamu pada hari ini menghindarkan kami dari azab Allah yang sangat pedih ini, walaupun sedikit saja, seperti janji kamu dahulu' mereka menjawab, sekiranya Allah memberi petunjuk kepada kami untuk beriman, niscaya kami dapat memberi petunjuk kepadamu dan membimbing kamu menuju keselamatan. Akan tetapi kita lebih memilih jalan kesesatan sehingga hari ini sama saja bagi kita, apakah kita mengeluh atau bersabar. Kita semua tidak mempunyai tempat sedikit pun untuk melarikan diri dari siksa Allah. Dan setan berkata ketika perkara hisab telah diselesaikan dan Allah telah memasukkan penghuni surga dan penghuni neraka ke tempat masingmasing, sesungguhnya Allah yang maha menepati janji telah menjanjikan kepadamu sebuah janji yang benar. Dia telah menjanjikan kepadamu kebangkitan dan hari pembalasan, dan aku pun telah menjanjikan kepadamu sebuah janji bahwa kebangkitan dan hari pembalasan adalah dusta belaka, tetapi aku menyalahi dan tidak menepati-Nya. Sekarang aku tegaskan kepadamu bahwa tidak ada kekuasaan bagiku terhadapmu untuk memaksamu mengikutiku, melainkan aku hanya menyeru kamu menuju kekafiran lalu kamu mematuhi seruanku dengan suka rela. Oleh sebab itu, janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri karena kemauanmu mengikutiku. Aku tidak dapat menolong dan menyelamatkanmu dari siksa Allah, dan kamu pun tidak dapat menolong dan menyelamatkan-ku darinya. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku dengan Allah sejak dahulu di dunia. Sungguh, orang yang zalim, berpaling dari kebenaran, dan memilih kesesatan pasti akan mendapat siksaan yang sangat pedih."
  }
]