[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan setan berkata, setelah Allah memutuskan perkara dan memperhitungkan amal perbuatan makhlukNya, dan penghuni surga telah memasuki surga dan penghuni neraka telah masuk kedalam neraka, Sesungguhnya Allah telah menjanjikan kepada kalian janji yang benar berupa kebangkitan kembali dan pembalasan amal perbuatan, dan aku menawarkan kepada kalian janji yang batil bahwa tidak ada hari kebangkitan dan pembalasan amal perbuatan, lalu aku memungkiri kalian akan janjiku. Dan tidaklah ada padaku kekuatan atas kalian untuk memaksa pengikut-pengikutku dengannya, dan tidak ada hujjah yang aku miliki. Akan tetapi, aku seru kalian kepada kekafiran dan kesesatan, lalu kalian mengikutiku, maka janganlah kalian mencelaku, tetapi celalah diri kalian sendiri, sebab dosa yang kalian perbuat adalah dosa kalian. aku tidak bisa menjadi penolong kalian dan kalianpun tidak bisa menolongku dari siksaan Allah. Sesungguhnya aku telah berlepas diri dari tindakan kalian menjadikanku sekutu bagi Allah dalam ketaatan di dunia.” Sesungguhnya orang-orang yang zhalim, dengan berpalingnya mereka dari kebenaran dan mengikuti kebatilan, bagi mereka siksaan yang pedih lagi menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Iblis berkata manakala penghuni surga masuk surga dan penduduk neraka masuk neraka, “Sesungguhnya Allah telah menjanjikan kalian janji yang benar, Allah menunaikan janji-Nya kepada kalian, aku juga menjanjikan janji batil kepada kalian, maka aku tidak memenuhi apa yang aku janjikan kepada kalian. Aku sendiri tidak mempunyai kekuatan untuk memaksa kalian di dunia supaya kafir dan sesat, akan tetapi aku hanya mengajak kalian kepada kekufuran, aku menghiasi kemaksiatan untuk kalian, lalu kalian mengikutinya dengan bergegas, maka jangan menyalahkanku atas kesesatan yang terjadi pada kalian, salahkanlah diri kalian sendiri, karena diri kalian lebih layak untuk disalahkan. Aku sendiri tak kuasa menolong kalian dari azab dan kalian juga tidak kuasa menolongku darinya, sesungguhnya aku mengingkari tindakan kalian yang menjadikanku sebagai sekutu bagi Allah dalam ibadah.\" Sesungguhnya orang-orang zalim dengan melakukan syirik kepada Allah di dunia dan kafir kepada Allah, bagi mereka azab yang telah siap menunggu pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Ketika perhitungan amal telah selesai, dan penduduk surga telah memasuki surga dan penduduk neraka telah memasuki neraka; setan berkata kepada orang-orang kafir semua untuk berlepas diri dari mereka: “Sungguh Allah telah menjanjikan kalian janji yang benar berupa pahala bagi orang yang taat dan siksaan bagi orang yang bermaksiat; maka Allah memenuhi janji-Nya. dan aku menjanjikan kalian bahwa hari kebangkitan, pahala, dan siksa tidak ada; namun aku mendustai dan mengingkari janjiku. Dan aku tidak memiliki kuasa atas kalian untuk memaksa kalian berbuat kekafiran dan kemaksiatan, namun aku hanya mengajak kalian kepada kesesatan dan kalian mengikutiku; maka janganlah kalian mengolokku, akan tetapi oloklah diri kalian sendiri, karena dosa itu adalah dosa kalian. Aku tidak dapat menolong kalian dan kalian tidak dapat menolongku dari azab Allah. Aku berlepas diri dari perbuatan kalian di dunia yang menjadikanku sebagai sekutu Allah dalam ketaatan.” Sungguh orang-orang yang melanggar larangan Allah akan mendapat azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَقَالَ الشَّيْطٰنُ لَمَّا قُضِىَ الْأَمْرُ (Dan berkatalah syaitan tatkala perkara (hisab) telah diselesaikan) Setelah penghuni surga memasuki surga dan penghuni neraka memasuki neraka. إِنَّ اللهَ وَعَدَكُمْ وَعْدَ الْحَقِّ(Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar) Berupa hari kebangkitan dan perhitungan, balasan yang baik atas kebaikan dan balasan buruk atas keburukan. وَوَعَدتُّكُمْ(dan akupun telah menjanjikan kepadamu) Dengan janji dusta, bahwa tidak ada yang namanya kebangkitan, perhitungan, surga, atau neraka. فَأَخْلَفْتُكُمْ ۖ( tetapi aku menyalahinya) Aku tidak memenuhi janjiku kepada kalian dalam hal ini. وَمَا كَانَ لِىَ عَلَيْكُم مِّن سُلْطٰنٍ(Sekali-kali tidak ada kekuasaan bagiku terhadapmu) Sehingga aku dapat menjerumuskan kalian kepadam kekafiran dengan terpaksa. إِلَّآ أَن دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِى ۖ( melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku) Yakni, akan tetapi aku menyeru kalian kepada kekafiran dan menghiasinya, dan aku tidak memaksa kalian. Namun kalian bersegera dalam mempercayaiku dan menjawab ajakanku. فَلَا تَلُومُونِى(oleh sebab itu janganlah kamu mencerca aku) Atas apa yang menimpa kalian disebabkan janji dustaku dan kebohonganku dalam hal ini. وَلُومُوٓا۟ أَنفُسَكُم ۖ( akan tetapi cercalah dirimu sendiri) Karena kalian telah mempercayaiku hanya dengan ajakanku, dan karena kalian telah meninggalkan janji Allah yang benar dan seruan-Nya kepada kalian menuju surga, padahal Allah telah menegakkan hujjah yang sangat jelas bagi orang yang berakal, yang hanya samar bagi orang yang lemah akal. مَّآ أَنَا۠ بِمُصْرِخِكُمْ وَمَآ أَنتُم بِمُصْرِخِىَّ (Aku sekali-kali tidak dapat menolongmu dan kamupun sekali-kali tidak dapat menolongku) Yakni aku tidak dapat menolong kalian dari azab, dan kalian juga tidak dapat menolongku dari keadaanku ini. Yakni pada saat itu setan juga mendapat azab seperti mereka, butuh orang yang menolong dan membebaskannya. Lalu bagaimana mereka mengharapkan pertolongan dari orang yang juga butuh pertolongan. إِنِّى كَفَرْتُ بِمَآ أَشْرَكْتُمُونِ مِن قَبْلُ ۗ (Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu) Setan berterus terang kepada mereka bahwa ia sendiri mengingkari kesyirikan mereka kepada Allah dalam ketuhanan. Dan setan pada hari itu telah melakukan sesuatu yang menghancurkan harapan mereka dan memotong-motong hati mereka dengan ucapan terlaknat ini, yang membuat mereka kehilangan harapan dari datangnya pertolongan. Ini merupakan ucapan yang mengetuk pendengaran para pengikut setan dan hati para musuh Allah dan rasul-Nya di dunia ini jika saja mereka memiliki pendengaran yang sehat atau hati yang dapat berfikir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Tatkala perhitungan telah diselesaikan syaitan berkata kepada para pengikut mereka di akhirat. Para penghuni surga memasuki surga dan penghuni neraka memasuki neraka: “Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan aku sekedar menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu jangan kamu lantas mencercaku, akan tetapi cercalah dirimu sendiri. Aku sekali-kali tidak dapat menolongmu, dan kamupun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan Allah dengan aku sejak dahulu”. Sesungguhnya orang-orang yang zalim ysng kafir dan musyrik itu mendapat siksaan yang pedih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Setan berkata ketika urusan telah diselesaikan} Hisab telah selesai, makan penduduk surga akan dimasukkan ke dalam surga dan penduduk neraka akan dimasukkan ke dalam neraka {“Sesungguhnya Allah telah menjanjikan kepada kalian janji yang benar dan aku pun telah memberi janji kepada kalian, tetapi aku mengingkari kalian. Tidak ada kekuasaan bagiku sedikit pun terhadap kalian} kekuasaan dan kekuatan untuk menaklukkan kalian {kecuali aku menyeru kalian, lalu kalian mematuhi seruanku. Maka janganlah mencercaku, tetapi cercalah diri kalian sendiri. Aku bukanlah penolong kalian} pemberi bantuan untuk kalian {dan kalian pun bukanlah penolongku} pemberi bantuan untukku {Sesungguhnya aku tidak membenarkan} menyalahkan {perbuatan kalian yang mempersekutukan aku sebelumnya” Sesungguhnya orang-orang zalim akan mendapat siksaan yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Artinya “Dan berkatalah setan”, yang menjadi faktor pemicu segala keburukan yang terjadi di alam semesta, sedang berbicara keppada para penghuni neraka, dalam rangka mencuci tangannya dari tanggung jawab kepada mereka “tatkala perkara (hisab) telah diselesaikan”, penghuni surge memasuki surga dan penghuni neraka masuk ke dalam neraka, “SEsungguhnya Allah telah menjanjikan kepadamu janji yang benar”, melalui lisan para RasulNya, namun kalian tidak menaatinya. Jikalau kalian mau menaatinya, niscaya kalian benar-benar akan menjumpai kemenangan besar, “dan aku pun telah menjanjikan kepadamu”, dengan kebaikan “tetapi aku menyalahinya”, tapi (janji tersebut) tidak terealisasikan, dan harapan yang aku janjikan kepada kalian yang berupa impian-impian yang batil tidak pernah terwujud. “SEkali-kali tidak ada kekuasaan bagiku terhadapmu”, tidak ada kekuatan hujjah yang mendukung ucapanku, “melainkan (sekedar) aku menyeru kamu, lalu kamu mematuhi seruanku”, maksudnya, inilah puncak (tujuan) yang aku canangkan, yaitu aku menyeru kalian kepada keinginanku dan aku mengondisikannya agar Nampak indah di mata kalian, lantas kalian menyambut (seruan)ku , lantaran kalian mengikuti hawa nafsu dan dorongan syahwat kalian. Kalau faktanya demikian “oleh sebab itu, janganlah kamu mencercaku. Akan tetapi cercalah dirimu sendiri”, kalianlah yang menjadi penyebab, dan pada kalianlah inti penyebab hukuman, “aku sekali-kali tidak dapat menolongmu”, aku bukan penolong kalian dari kesulitan yang kalian alami “dan kamu pun sekali-kali tidak dapat menolongku”, setiap phak menerima siksanya masing-masing. “Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dulu”, maksudnya aku berlepas diri dari tindakan kalian mempersekutukanku denganNya. Aku bukan sekutu bagi Allah, dan tidak wajib (seseorang) taat kepadaku. “Sesungguhnya orang-orang yang zhalim itu”, (berbuat zhalim) kepada diri sendiri dengan taat kepada setan “mereka mendapat siksaan yang pedih”, kekal abadi di dalamnya selamanya. Ini termasuk cerminan sifat kelembutan Allah kepada para hambaNya, dengan memperingatkan mereka dari bahaya taat kepada setan dan memberitahukan celah-celah yang digunakan setan untuk mengintervensi manusia dan (memberitahukan) maksud setan terhadap seorang manusia. Tujuannya adalah menjerumuskan manusia ke dalam api neraka. Di sini, Allah menjelaskan kepada kita bahwa setan dan punggawanya bila telah masuk neraka, maka mereka akan berkilah dengan pernyataan tersebut, mengingkari praktik kesyirikan mereka. \"dan tidak ada yang dapat memberi keterangan kepadamu sebagai yang diberikan oleh Yang Maha Mengetahui.\" (Fathir:14). Ketahuilah, di ayat ini, Allah menerangkan bahwa setan tidak mempunyai kekuasaan. Sementara di dalam ayat lain Allah berfirman, \"Sesungguhnya kekuasaannya (syaitan) hanyalah atas orang-orang yang mengambilnya jadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.\" (An-Nahl: 100). Kekuasaan yang Allah tepis darinya adalah kekuatan hujjah dan dalil. Pada dasarnya, ia tidak mempunyai hujjah yang mendukung seruannya. Kemampuannya yang paling tinggi hanyalah, melontarkan berbagai macam syubhat dan tipu daya kepada mereka, yang membuat mereka nekad dalam berbuat maksiat. Sedangkan kekuasaan yang Allah tetapkan baginya, adalah kemampuan mellancarkan tipuan kepada para pengikutnya untuk berbuat maksiat yang benar-benar menyeret mereka ke dalamnya dengan kuat. Mereka itu adalah orang-orang yang mendudukannya sebagai penguasa kelompoknya. Oleh karenanya, ia tidak mempunyai kekuasaan (kekuatan) atas orang yang beriman dan bertawakal kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَمَّا قُضِيَ ٱلۡأَمۡرُ) lammaa qudhiyal amru : “Ketika seluruh perkara telah diputuskan” ketika penduduk surga telah memasuki surga dan penduduk neraka telah memasuki neraka. (مَّآ أَنَا۠ بِمُصۡرِخِكُمۡ) maa ana bimushrikhikum : “Aku tidak mampu menyelamatkan kalian” dari yang kalian rasakan berupa azab dan bencana. Makna ayat : Pada saat itu Iblis berdiri berkhutbah sebagaimana yang Allah firmankan : (وَقَالَ ٱلشَّيۡطَٰنُ) “Dan setan berkata” yaitu Iblis, musuh anak keturunan Adam (لَمَّا قُضِيَ ٱلۡأَمۡرُ) “ketika seluruh perkara telah diputuskan” seluruh penghuni surga telah memasuki surga dan penghuni neraka telah memasuki neraka (إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ) “Sesungguhnya Allah telah menjanjikan kepada kalian janji yang benar” yaitu barangsiapa yang beriman dan beramal saleh, menjauhi syirik dan maksiat, maka Dia akan memasukkannya kedalam surga-Nya dan memuliakannya dengan menyandingkannya dengan diri-Nya, dan barangsiapa yang kafir, berbuat syirik, dan maksiat maka Dia akan menjebloskannya ke dalam neraka dan menyiksana dengan azab yang menghinakan di negeri kehancuran (وَوَعَدتُّكُمۡ) “dan aku telah menjanjikan kalian” dengan mengatakan bahwa janji dan ancaman Allah adalah bohong dan tidak nyata (فَأَخۡلَفۡتُكُمۡۖ) “maka aku ingkari janji itu.” Yaitu janji yang telah kuberikan kepada kalian, dan aku hanyalah berbohong dan menipu kalian (وَمَا كَانَ لِيَ عَلَيۡكُم مِّن سُلۡطَٰنٍ) “dan aku tidak memiliki kuasa atas kalian” kekuatan secara materi untuk memaksa kalian mengikutiku dan tidak pula pengaruh yang kuat untuk memaksa kalian menerima seruanku (إِلَّآ أَن دَعَوۡتُكُمۡ) “kecuali aku menyeru kalian” mengajak kalian (فَٱسۡتَجَبۡتُمۡ لِيۖ) “lalu kalian sambut ajakanku” oleh karena itu (فَلَا تَلُومُونِي وَلُومُوٓاْ أَنفُسَكُمۖ) “janganlah kalian mencelaku, tapi celalah diri kalian, aku tidak mampu menolong kalian,” penyelamat kalian dengan menolong kalian dengan keselamatan dan lolos dari azab ini (وَمَآ أَنتُم بِمُصۡرِخِيَّ) “dan kalian” tidak ”mampu menolongku” menyelamatkanku (إِنِّي كَفَرۡتُ بِمَآ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ ) “Sungguh aku telah ingkar tatkala kalian menyekutukanku (dengan Allah) sebelumnya” karena setiap yang menyembah kepada selain Allah adalah penyembah setan, sebab dialah yang menghiasi dan menyeru kepada perkara itu. (إِنَّ ٱلظَّٰلِمِينَ لَهُمۡ عَذَابٌ أَلِيمٞ) “Sungguh bagi orang-orang zalim adalah azab yang pedih.” Yaitu orang-orang yang berbuat syirik bagi mereka azab yang pedih lagi menyakitkan. Pelajaran dari ayat : • Penegasan ilmu Allah mencakup segala sesuatu yang belum terjadi dan bagaimana ia akan terjadi, karena adanya ayat-ayat yang menceritakan percakapan yang belum terjadi sama sekali, namun ia berdasarkan ilmu Allah akan terjadi seperti itu, dan pasti akan terjadi seperti yang terdapat di dalam ayat, tidak meleset sekalipun hanya satu huruf. • Ancaman bagi orang-orang zalim dengan azab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 22: Yakni Iblis. Dan para penghuni surga masuk ke surga, sedangkan para penghuni neraka masuk ke neraka, dan mereka berkumpul di hadapan Iblis. Yaitu janji akan membangkitkan kamu dan memberikan balasan, atau janji Allah lainnya yang disampaikan oleh rasul-rasul-Nya, namun kalian tidak mau menaati. Kalau kalian menaati, tentu kalian akan memperoleh keberuntungan yang besar. Yakni menjanjikan bahwa kebangkitan dan pembalasan itu tidak ada atau membayangkan angan-angan yang kosong. Untuk memaksamu berbuat maksiat. Atau maksudnya, tidak ada hujjah (alasan) untuk menguatkan perkataanku, aku hanya mampu membuat syubhat, membujuk dan melakukan penghiasan terhadap kemaksiatan sehingga kamu melakukannya. Dalam ayat lain disebutkan, “Sesungguhnya kekuasaannya (setan) hanyalah atas orang-orang yang mengambilnya menjadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.” (Terj. An Nahl: 100) Maksudnya adalah kekuasaan untuk membujuk dan mengajak mereka berbuat maksiat. Adapun kekuasaan dalam arti hujjah (memiliki alasan) atau memaksa orang lain berbuat maksiat, maka ia tidak memilikinya. Karena mematuhi seruanku. Masing-masing memperoleh bagian dari azab. Selanjutnya Allah berfirman. Yakni orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 22",
    "description": "Dan setan berkata ketika perkara hisab telah diselesaikan dan Allah telah memasukkan penghuni surga dan penghuni neraka ke tempat masingmasing, sesungguhnya Allah yang maha menepati janji telah menjanjikan kepadamu sebuah janji yang benar. Dia telah menjanjikan kepadamu kebangkitan dan hari pembalasan, dan aku pun telah menjanjikan kepadamu sebuah janji bahwa kebangkitan dan hari pembalasan adalah dusta belaka, tetapi aku menyalahi dan tidak menepati-Nya. Sekarang aku tegaskan kepadamu bahwa tidak ada kekuasaan bagiku terhadapmu untuk memaksamu mengikutiku, melainkan aku hanya menyeru kamu menuju kekafiran lalu kamu mematuhi seruanku dengan suka rela. Oleh sebab itu, janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri karena kemauanmu mengikutiku. Aku tidak dapat menolong dan menyelamatkanmu dari siksa Allah, dan kamu pun tidak dapat menolong dan menyelamatkan-ku darinya. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku dengan Allah sejak dahulu di dunia. Sungguh, orang yang zalim, berpaling dari kebenaran, dan memilih kesesatan pasti akan mendapat siksaan yang sangat pedih. Demikianlah nasib buruk orang kafir di hari pembalasan. Penyesalan mereka tidak lagi berguna. Dan orang yang beriman kepada Allah dan rasul-Nya dan membuktikan keimanan mereka dengan mengerjakan kebajikan dimasukkan ke dalam surga-surga yang mengalir di bawah pepohonan dan istana-Nya sungai-sungai. Mereka kekal di dalamnya untuk selama-lamanya dengan izin tuhan mereka yang maha pemurah. Ucapan penghormatan yang mereka terima dari Allah, malaikat, dan sesama kaum mukmin dalam surga itu ialah salam."
  }
]