[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu tahu wahai rasul, bagaimana Allah membuat perumpamaan kaliamat tauhid (lailahaillalah) dengan satu pohon yang besar, yaitu pohon kurma, yang akarnya kuat menancap di dalam tanah, sedang bagian atasnya menjulang tinggi ke arah langit?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Apakah kamu tidak mengetahui -wahai Rasul- bahwa Allah membuat perumpamaan bagi kalimat Tauhid yaitu lā ilāha illallāh dengan sebuah pohon yang baik, yaitu kurma, akarnya tertanam kokoh di dalam tanah, akar-akarnya mencari air di sana, sedangkan batangnya menjulang ke angkasa menyerap embun dan menghirup udara yang segar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Hai Rasulullah, Tidakkah kamu mengetahui bagaimana Allah membuat perumpamaan kalimat tauhid ‘laa ilaaha illaa Allah’ dengan sebuah pohon yang mulia, yaitu pohon kurma, akarnya kokoh menembus tanah dan batangnya menjulang tinggi ke langit?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَلَمْ تَرَ كَيْفَ ضَرَبَ اللهُ مَثَلًا كَلِمَةً طَيِّبَةً (Tidakkah kamu perhatikan bagaimana Allah telah membuat perumpamaan kalimat yang baik) Yaitu kalimat tauhid “Laa ilaaha illaa Allah”, atau kalimat yang menyuruh kepada perbuatan ma’ruf dan melarang kemungkaran. Yakni Allah mengumpamakan kalimat yang baik dengan pohon yang baik. أَصْلُهَا ثَابِتٌ (akarnya teguh) Yakni kokoh masuk ke dalam tanah, menyerap air yang baik dengan akar-akarnya. وَفَرْعُهَا فِى السَّمَآءِ (dan cabangnya (menjulang) ke langit) Yang menyerap embun dan udara segar. Demikian pula kalimat tauhid yang kokoh di dalam hati seorang mukmin di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Tidakkah kalian ketahui wahai orang yang diajak bicara, bagaimana Allah membuat perumpamaan, yaitu membuat sesuatu yang sesuai yang mengandung kalimah thayyibah, yaitu kalimat Islam “Laa ilaaha illallah” dan setiap kata-kata yang menunjukkan kepada kebenaran, kebaikan dan keutamaan, menggunakan pohon yang baik yang akarnya kokoh di bumi dan bagian atasnya menjulang di langit. Seperti itulah kalimat tauhid dan ajakan kepada Al-Qur’an yang kokoh di dalam hati orang-orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan} tidakkah kamu mengetahui {bagaimana Allah telah membuat perumpamaan kalimah ṭayyibah} kalimat tauhid ”Laa Ilaha Illallah” {seperti pohon yang baik} pohon yang baik buahnya yaitu kurma {akarnya kuat} akarnya menyangga batangnya di atas tanah {cabangnya (menjulang) ke langit} menjulang tinggi ke langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Allah berfirman, “Tidaklah kamu perhatikan bagaimana Allah telah membuat perumpamaan kalimat yang baik”, yaitu persaksian tidak ada sesembahan (yang berhak disembah) kecuali Allah, dan cabang-cabangnya adalah “seperti pohon yang baik”, yaitu pohon kurma “akarnya teguh” ke dalam tanah “dan cabangnya”, menjulang “ke langit”, selalu banyak manfaatnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَلِمَةٗ طَيِّبَةٗ) kalimatan thayyibah : “perkataan yang baik” yaitu kalimat laa ilaaha illallaah muhammadur rasulullaah shallahu ‘alaihi wa sallam. (كَشَجَرَةٖ طَيِّبَةٍ) kasyajaratin thayyibah : “bagaikan pohon yang baik” yaitu kurma. Makna ayat : Ayat-ayat ini menjelaskan tentang penetapan tauhid, kebangkitan di hari akhir nanti, dan pembalasan. Firman-Nya : (أَلَمۡ تَرَ) “Apakah engkau tidak melihat” wahai Rasul, apakah engkau tidak mengetahui (كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ) “bagaimana Allah membuat perumpamaan perkataan yang baik” yaitu perkataan iman yang diucapkan oleh seorang mukmin (كَشَجَرَةٖ طَيِّبَةٍ) “bagai pohon yang baik” yaitu pohon kurma (أَصۡلُهَا ثَابِتٞ) “akarnya kokoh” di dalam bumi (وَفَرۡعُهَا) “dan cabangnya” menjulang tinggi (فِي ٱلسَّمَآءِ) “ke langit”, Pelajaran dari ayat : • Bolehnya membuat permisalan untuk mempermudah pemahaman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 24: Termasuk dalam kalimat yang baik adalah kalimat tauhid, semua ucapan yang menyeru kepada kebajikan dan mencegah dari kemungkaran serta perbuatan yang baik. Kalimat tauhid adalah kalimat laa ilaa ha illallaah. Misalnya pohon kurma."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 24",
    "description": "Usai mengumpamakan amal orang kafir dengan abu yang ditiup angin kencang, pada ayat ini Allah beralih memberikan perumpamaan bagi amal baik orang mukmin. Tidakkah kamu memperhatikan dan merenungkan bagaimana Allah telah membuat perumpamaan kalimat yang baik (kalimat tauhid) seperti pohon yang baik, yaitu kurma. Akarnya menghunjam tanah dengan kuat dan cabangnya menjulang tinggi ke arah langit. Pohon itu menghasilkan buahnya pada setiap waktu dengan seizin tuhannya. Seperti itulah pohon keimanan; akarnya terpatri dengan kuat di dada kaum mukmin, dan cabangnya yang berupa amal saleh dipersembahkan kepada Allah setiap waktu. Dan demikianlah, Allah membuat perumpamaan itu sebagai gambaran untuk manusia renungkan agar mereka selalu ingat akan kebesaran dan kekuasaan Allah."
  }
]