[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pohon itu memberikan buah-buahannya setiap waktu dengan izin tuhannya. Dan demikianlah pohon keimanan, akarnya kokoh di hati seorang mukmin, dalam bentuk ilmu dan keyakinan, sedang cabangnya, berupa amal-amal shalih dan akhlak-akhlak yang diridhai di angkat kepada Allah dan ia menggapai pahalanya setiap waktu. Dan Allah mengadakan perumpamaan-perumpamaan bagi manusia agar mereka ingat dan mau menerima nasihat, kemudian mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Pohon yang baik ini memberikan buahnya yang baik setiap waktu dengan izin Rabbnya. Allah membuat perumpamaan bagi manusia dengan harapan mereka akan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Buahnya selalu ada pada setiap waktu dengan izin Tuhannya; sebab kalimat tauhid membawa banyak keberkahan di dunia dan di akhirat. Allah menjelaskan berbagai perumpamaan kepada manusia agar mereka mengambil pelajaran dan beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. تُؤْتِىٓ أُكُلَهَا كُلَّ حِينٍۭ بِإِذْنِ رَبِّهَا (pohon itu memberikan buahnya pada setiap musim dengan seizin Tuhannya) Yakni dengan kehendak-Nya. Demikian pula kalimat yang baik seperti pohon kurma yang berbuah setiap saat baik di siang hari maupun malam hari tanpa ada perbedaan baik itu di musim dingin maupun di musim panas. Seperti itulah kalimat tauhid yang merupakan kalimat yang baik yang membuahkan kebaikan dan mendorong pelafadz dan pendengarnya untuk melakukan amal shalih di setiap saat, dan dapat menjadi sebab masuk surga. Imam Bukhari mengeluarkan sebuah hadits dari Ibnu Umar ia berkata: suatu hari kami berada di sisi Rasulullah, kemudian ia bersabda: “beritahukanlah kepadaku sekalian tentang sebuah pohon yang menggambarkan sosok seorang muslim, dedaunannya tidak berguguran dan menghasilkan buah setiap saat?” kemudian Rasulullah bersabda: “itu adalah pohon kurma”. وَيَضْرِبُ اللهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ(Allah membuat perumpamaan-perumpamaan itu untuk manusia supaya mereka selalu ingat) Karena perumpamaan memudahkan seseorang untuk mengingat, memahami, dan menggambarkan maknanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara fungsi pemberian perumpamaan dalam beberapa ayat al-qur'an adalah mendekatkan makna-makna ayat al-quran dengan perumpamaan-perumpamaan yang nyata dalam kehidupan, dan umumnya makna yang dikehendaki oleh Allah menjadi jelas dengan sangat amat jelas, dan inilah diantara kasih sayang-Nya dan kebaikan pengajaran Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Pohon itu memberikan buahnya setiap saat sesuai kehendak dan kemauan penciptanya. Allah menjelaskan banyak perumpamaan kepada manusia, supaya mereka bisa mengambil pelajaran dan pemahaman, lalu bisa beriman dan belajar. Ini merupakan salah satu fenomena penggambaran makna-makna dalam Al-Qur’an Al-Karim yang digambarkan dengan gamblang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan menghasilkan buahnya} menghasilkan buahnya {setiap waktu dengan seizin Tuhannya. Allah membuat perumpamaan untuk manusia agar mereka mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Pohon itu memberikan buahnya”, hasil buah-buahnya “pada setiap musim dengan seizin Rabbnya” , demikian pula pohon iman, akarnya teguh di hati seorang Mukmin dalam bentuk ilmu dan keyakinan. Cabangnya berbentuk perkataan baik, amal shalih, akhlak yang disukai dan etika-etika yang bagus selalu berada di langit, menuju kepada Allah dari dirinya berupa amalan-amalan dan ucapan-ucapan yang dihasilkan oleh pohon iman, yang menorehkan manfaat bagi seorang Mukmin dan orang lain. “Allah membuat perumpamaan-perumpamaan itu untuk manusia supaya mereka selalu ingat”, kepada hal-hal yang diperintahkan dan dilarang. Karena di dalam penetapan permisalan terdapat (makna) pendekatan untuk makna yang logis dari permisalan yang dapat dicerna oleh panca indera. Dan makna yang diinginkan Allah menjadi benar-benar terang dan betul-betul jelas. Ini salah satu bentuk rahmat dan keindahan pembinaanNYa (kepada para makhluk). Bagi Allah pujian yang paling sempurna dan paling paripurna serta paling luas. Sifat ini merupakan karakteristik kalimat tauhid dan keteguhannya di hati seorang Mukmin."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (تُؤۡتِيٓ أُكُلَهَا كُلَّ حِينِۢ ) menghasilkan buah-buahannya yang bisa dimakan (بِإِذۡنِ رَبِّهَاۗ) “dengan izin dari Rabbnya” dengan kekuasaan dan pengaturan-Nya. Kalimat iman: Laa ilaaha illallaah muhammadur rasulullah akan menghasilkan untuk seorang hamba amalan-amalan yang saleh di setiap saat, yang mana kalimat tersebut terpatri di dalam hatinya dan amalan-amalan tersebut adalah hasil darinya yang diangkat menuju kehadirat Allah azza wa jalla. Firman-Nya : (وَيَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ لِلنَّاسِ لَعَلَّهُمۡ يَتَذَكَّرُونَ) “Dan Allah membuat permisalan untuk manusia agar mereka selalu mengingatnya.” Sebagaimana Allah telah membuat perumpamaan antara orang yang beriman dan orang kafir, dan pada ayat ini Allah membuat permisalan mengenai manusia, yang beriman ataupun yang kafir (لَعَلَّهُمۡ يَتَذَكَّرُونَ) “semoga mereka selalu mengingatnya.” Dengan harapan agar mereka mengingatnya, mengambil pelajaran, beriman, dan beramal saleh, sehingga mereka bisa selamat dari azab Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 25: Demikian pula kalimat tauhid atau keimanan yang menancap di hati seorang mukmin, sedangkan cabangnya yang berupa ucapan yang baik, amal yang saleh, akhlak yang terpuji dan adab yang baik akan naik ke langit dan memperoleh keberkahan serta pahala di setiap waktu, bermanfaat bagi pelakunya maupun orang lain. Sehingga mereka pun beriman. Allah Subhaanahu wa Ta'aala sering membuat perumpamaan, karena perumpamaan dapat memahamkan maksud lagi dapat meresap di hati pendengarnya daripada contoh yang nyata. Hal ini termasuk rahmat-Nya dan bagusnya pengajaran-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 25",
    "description": "Pohon itu menghasilkan buahnya pada setiap waktu dengan seizin tuhannya. Seperti itulah pohon keimanan; akarnya terpatri dengan kuat di dada kaum mukmin, dan cabangnya yang berupa amal saleh dipersembahkan kepada Allah setiap waktu. Dan demikianlah, Allah membuat perumpamaan itu sebagai gambaran untuk manusia renungkan agar mereka selalu ingat akan kebesaran dan kekuasaan Allah. Dan perumpamaan kalimat yang buruk (kalimat kufur) seperti pohon yang buruk, yang telah dicabut akar-akarnya dengan sangat mudah dari permukaan bumi. Akar pohon itu tercerabut sehingga tidak lagi dapat menopangnya supaya dapat tetap tegak berdiri sedikit pun seperti sedia kala. Demikianlah, orang kafir tidak mempunyai keyakinan yang kuat dalam hati dan tidak ada amal darinya yang akan diterima oleh Allah."
  }
]