[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan perumpamaan kalimat yang buruk, yaitu kalimat kekafiran, layaknya pohon yang buruk untuk dimakan dan dirasakan, yaitu pohon hanzhal. Pohon ini roboh dari permukaan tanah, di karenakan akar-akarnya tertanam dekat dengan permukaan tanah, tidak memiliki akar yang kokoh, dan tidak ada cabang yang menjulang tinggi. Demikian pula orang kafir, ia tidak memiliki keteguhan pada dirinya dan tidak ada kebaikan padanya, dan tidak ada amal shalihnya yang diangkat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sedangkan kalimat syirik yang buruk adalah seperti pohon yang buruk, pohon Ḥanẓal yang tercerabut dari akarnya, tidak kokoh di atas tanah, tidak menjulang ke angkasa, ia mati dan dihancurkan oleh angin. Kalimat kekufuran berakhir dengan kehancuran, tidak membawa naik amal baik pelakunya kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Sedangkan perumpamaan kalimat kekafiran seperti pohon handzal yang rasanya sangat tidak enak, akarnya tercabut karena tidak kokoh dan tidak jauh masuk ke dalam tanah sehingga tidak dapat tegak. Demikianlah kalimat kekafiran yang tidak akan kekal dan pasti akan sirna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ (Dan perumpamaan kalimat yang buruk) Yakni kalimat kekafiran, dan segala perkataan yang mengandung keburukan. كَشَجَرَةٍ خَبِيثَةٍ(seperti pohon yang buruk) Terdapat pendapat mengatakan itu merupakan pohon sejenis labu yang berasa pahit. اجْتُثَّتْ مِن فَوْقِ الْأَرْضِ(yang telah dicabut dengan akar-akarnya dari permukaan bumi) Yakni yang tercabut dari akarnya sehingga menjadi kering dan dan terbawa oleh hembusan angin. مَا لَهَا مِن قَرَارٍ(tidak dapat tetap (tegak) sedikitpun) Yakni tidak dapat tegak di tanah, demikianlah kalimat kekafiran dan keburukan, kesudahannya adalah kemusnahan. dan orang kafir serta kalimat kekafiran tidak memiliki keteguhan dan tidak memdatangkan kebaikan sama sekali, dan tidak mengundang ucapan dan perbuatan baik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang mutadabbir berkata : saat aku menunaikan shalat subuh hari ini bersama jamaah sang imam membaca surah Ibrahim, kemudian setelah selesai aku termenung sejenak mentadabburi ayat yang dibacakan oleh sang imam : { وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِنْ فَوْقِ الْأَرْضِ مَا لَهَا مِنْ قَرَارٍ } \"Dan perumpamaan kalimat yang buruk seperti pohon yang buruk, yang telah dicabut dengan akar-akarnya dari permukaan bumi; tidak dapat tetap (tegak) sedikitpun\" dan ayat yang menurutku paling membuat ku takjub adalah : { ۞ أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ } \"Tidakkah kamu perhatikan orang-orang yang telah menukar nikmat Allah dengan kekafiran dan menjatuhkan kaumnya ke lembah kebinasaan?\" seakan-akan ayat-ayat ini baru saja diturunkan semalam, begitu agungnya al-qur'an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dan kata-kata yang keji adalah kata-kata ingkar dan kata-kata yang mengajak kepada keburukan dan kemahdharatan, seperti pohon yang buruk, yaitu sejenis tanaman labu yang dipetik dan dicabut akarnya dari permukaan tanah karena akarnya hanya menempel sedikit di permukaan tanah, tidak menancap, dan tidak tersisa apapun setelah dipanen. Seperti itulah perumpamaan kata-kata ingkar dan keburukan yang berakhir pada ketiadaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan kalimah yang buruk} kalimat kemusyrikan {seperti pohon yang buruk} seperti tanaman labu {akar-akarnya telah dicabut} dicabut {dari permukaan bumi, dan tidak dapat tegak} tegak di atas bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Kemudian Allah menyebutkan lawannya, yaitu kalimat al-Kufr (perkataan kekufuran) dan cabang-cabangnya. Allah berfirman, “Dan perumpamaan kalimat yang buruk adalah seperti pohon yang buruk”, untuk dimakan dan dirasakan, ia merupakan pohon Handzhal dan pohon yang serupa lainnya “yang telah dicabut dengan akar-akarnya”, yakni pohon ini (telah dicabut) “dari permukaan bumi; tidak dapat tetap (tegak) sedikit pun, tidak ada keteguhan, tidak ada akar yang menahannya dan tidak ada buah bagus yang dihasilkannya. Bahkan kalaupun ada buahnya, tapi jenis buah yang jelek. Demikian pula kalimat kekufuran dan kemaksiatan. Tidak ada keteguhan yang bermanfaat dalam hati, tidak menghasilkan melainkan ucapan buruk, dan amalan keji. Orangnya pun justru terancam bahaya olehnya. Tidak mendapatkan manfaat darinya. Amalan shalih darinya tidak melaju naik kepada Allah. Tidak memberinya manfaat kepada dirinya, dan orang lain pun tidak merasakan manfaatnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَلِمَةٍ خَبِيثَةٖ) kalimatin khabitsah : “yaitu perkataan kufur. (كَشَجَرَةٍ خَبِيثَةٍ) kasyajaratin khabitsah : “bagai pohon yang buruk.” Yaitu hanzhalah. (ٱجۡتُثَّتۡ) ujtutstsat : tercabut dari akar-akarnya. Makna ayat : Firman-Nya : (وَمَثَلُ كَلِمَةٍ خَبِيثَةٖ) “Dan perumpamaan kalimat yang buruk,” perkataan kufur yang ada pada hati seorang kafir. (كَشَجَرَةٍ خَبِيثَةٍ) “seperti pohon yang buruk” yaitu buah hanzhalah, rasanya pahit, tidak bermanfaat, tidak memiliki akar yang kuat, dan tidak pula memiliki cabang yang menjulang ke langit. (ٱجۡتُثَّتۡ) yaitu dicabut dari akar-akarnya (مِن فَوۡقِ ٱلۡأَرۡضِ مَا لَهَا مِن قَرَارٖ) “dari permukaan bumi, tidak mempunyai tempat menetap.” Yaitu tidak punya akar yang kuat, tidak berbuah kecuali menghasilkan buah yang pahit, tidak enak rasanya, dan tidak berkah. Pelajaran dari ayat : • Perbandingan antara iman dan kufur, kalimat tauhid dan kufur, dan hasil dari keduanya berupa kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 26: Yaitu kalimat kalimat kufur dan cabang-cabangnya. Misalnya pohon hanzhalah (sejenis labu) yang pahit rasanya. Demikian pula kalimat kufur dan maksiat itu, tidak kokoh, tidak bercabang ke atas dan tidak berkah. Pelakunya tidak mendapatkan manfaat darinya, bahkan mendapatkan bahaya, amalnya tidak naik kepada Allah, tidak memberi manfaat bagi pelakunya apalagi orang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 26",
    "description": "Dan perumpamaan kalimat yang buruk (kalimat kufur) seperti pohon yang buruk, yang telah dicabut akar-akarnya dengan sangat mudah dari permukaan bumi. Akar pohon itu tercerabut sehingga tidak lagi dapat menopangnya supaya dapat tetap tegak berdiri sedikit pun seperti sedia kala. Demikianlah, orang kafir tidak mempunyai keyakinan yang kuat dalam hati dan tidak ada amal darinya yang akan diterima oleh Allah. Allah meneguhkan hati orang-orang yang beriman dengan ucapan yang teguh, yaitu kesaksian bahwa tiada tuhan selain Allah dan nabi Muhammad adalah utusan Allah, dalam kehidupan mereka di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zalim dari jalan kebenaran, dan Allah berbuat apa saja yang dia kehendaki, seperti memberi hidayah kepada orang mukmin dan membiarkan sesat orang yang ingkar."
  }
]