[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah meneguhkan orang-orang beriman dengan ucapan yang benar lagi kuat, yaitu persaksian bahwa sesungguhnya tidak ada yang berhak diibadahi kecuali Allah dan bahwasannya Muhammad adalah utusan Allah dan apa yang dibawanya adalah agama yang haq. Allah meneguhkan mereka dengannya di kehidupan dunia dan ketika mereka akan meninggal dengan husnul khatimah, dan ketika di alam kubur, tatkala menghadapi pertanyaan dua malaikat, dengan memberinya petunjuk kepada jawaban yang benar. Dan Allah akan menyesatkan orang-orang zhalim dari jalan kebenaran di dunia dan di akhirat. Dan Allah berbuat apa saja yang Dia kehendaki, untuk memberikan taufik kepada orang-orang beriman dan mengabaikan penganut kekafiran dan orang-orang yang melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Allah meneguhkan orang-orang Mukmin dengan kalimat Tauhid yang kokoh, dengan iman yang sempurna di kehidupan dunia hingga mereka mati sementara mereka tetap berpegang kepada iman, saat di alam barzakh di alam kubur, saat mereka ditanya, Allah meneguhkan mereka juga pada hari Kiamat. Allah menyesatkan orang-orang zalim dengan kesyirikan dan kekufuran kepada Allah dari jalan kebenaran dan jalan lurus. Allah melakukan apa yang Dia kehendaki, menyesatkan siapa yang Dia hendak sesatkan dengan keadilan-Nya, memberi petunjuk kepada siapa yang hendak Dia beri petunjuk dengan karunia-Nya, tidak ada yang menekan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Allah meneguhkan orang-orang beriman dengan perkataan yang benar, yaitu kalimat syahadat ‘laa ilaaha illaa Allah, Muhammad Rasulullah’. Allah meneguhkan mereka di dunia ketika kematian saat dua malaikat menanyai mereka dalam kubut, dan di hari kiamat meneguhkan mereka dari kengerian pada hari itu. Dan Allah menyesatkan orang-orang kafir sehingga mereka tidak mendapat petunjuk kepada kebenaran dan jawaban yang benar. Allah berbuat terhadap hamba-hamba-Nya dengan kehendak-Nya sesuai dengan keadilan dan kemurahan-Nya. Dari al-Barra’ bin ‘Azib, Rasulullah bersabda: “Seorang muslim jika ditanya dalam kuburnya maka akan bersaksi bahwa tidak ada Tuhan selain Allah dan Nabi Muhammad adalah utusan Allah; dan itulah maksud dari firman Allah: يثبت الله الذين ءامنوا بالقول الثابت في الحياة الدنيا وفي الآخرة (Shahih al-Bukhari 8/229, kitab tafsir surat Ibrahim, bab ayat, no. 4699. Dan Shahih Muslim 4/2201, kitab surga dan gambaran kenikmatan dan penduduknya, bab ditampakkannya tempat mayit di surga atau di neraka)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. يُثَبِّتُ اللهُ الَّذِينَ ءَامَنُوا۟ بِالْقَوْلِ الثَّابِتِ (Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh) Yang dimaksud adalah kalimat tauhid sebagaimana telah disebutkan, yakni kalimat syahadat أشهد ألا إله إلا الله وأشهد أن محمدا رسول الله, dan seluruh ucapan yang benar. Dan orang yang mengucapkan kalimat-kalimat ini akan senantiasa diliputi oleh ucapan yang teguh. فِى الْحَيَوٰةِ الدُّنْيَا وَفِى الْاٰخِرَةِ ۖ( dalam kehidupan di dunia dan di akhirat) Yakni ketika seseorang ditanya di alam kubur dan ketika di hari kiamat. Maksudnya adalah apabila mereka ditanya tentang aqidah dan agama mereka, maka mereka akan menjelaskannya dengan penuh keteguhan tanpa terbata-bata, ragu, atau malah tidak menjawabnya, seperti orang yang tidak mendapat taufik akan mengatakan “aku tidak tahu”, kemudian akan dikatakan kepada mereka “kamu tidak mengetahui dan tidak pula membaca (untuk mencari tahu.” وَيُضِلُّ اللهُ الظّٰلِمِينَ ۚ( dan Allah menyesatkan orang-orang yang zalim) Yakni Allah akan menjadikan mereka lupa dari alasan mereka sehingga mereka tidak mampu mengungkapkannya ketika mereka di dalam kubur dan ketika mereka dihisab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Allah meneguhkan orang-orang mukmin dengan ucapan yang teguh yang dikokohkan dengan hujjah di sisi mereka dan mungkin juga dalam hati mereka, yaitu kalimah thayyibah sebelumnya: kalimah syahadat dan setiap kalimah yang benar yang meneguhkan mereka di dunia ketika ditanyai dalam kubur dan hari kiamat, sehingga mereka tidak tergagap-gagap ketika ditanya tentang keyakinan mereka di tempat penghisaban dan ketika melihat kengerian yaumul hasyr. Dan Allah menyesatkan orang-orang kafir dengan hujjah mereka. Maka mereka tidak mendapat petunjuk kepada kebenaran dan jawaban yang benar, namun mereka akan berkata: “Kami tidak tahu” Dan Allah melakukan apa yang dikehendakiNya berupa pemberian keteguhan kepada sebagian manusia dan menyesatkan sisanya tanpa ada yang protes kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah meneguhkan orang-orang yang beriman dengan ucapan yang teguh} kalimat tauhid {di kehidupan dunia dan akhirat} dan di alam kubur {Allah menyesatkan orang-orang yang zalim, dan Allah berbuat apa yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Allah memberitahukan bahwa Dia meneguhkan (hati) para hambaNya yang beriman, yaitu orang-orang yang melaksanakan kewajiban mereka berupa keimanan hati yang sempurna, yang berkonsekuensi pelaksanaan amalan-amalan fisik dan mengembangkannya. Maka Allah menetapkan hati mereka di kehidupan dunia saat gencarnya syubhat-syubhat dengan kekuatan hidayah menuju keyakinan, dan saat bermunculannya syahwat-syahwat melalui tekad baja untuk lebih mengutamakan hal-hal yang dicintai Allah daripada bisikan hawa nafsu dan hasratnya. Sementara itu, di akhirat kelak, ketika kematian datang, (Dia menetapkan hati) dengan keteguhan berpedoman pada agama Islam dan husnul khatimah. Sedangkan di kubur nanti, saat menghadapi pertanyaan dua malaikat (maka Allah meneguhkannya) dengan (memudahkannya untuk) menjawabnya dengan jawaban yang benar, ketika dilontarkan kepada mayat: Siapakah Rabbmu? Apakah agamamu? Dan siapakah nabimu? Allah memberikan hidayah kepada mereka untuk menjawab dengan benar, dengan menjawab, “Allah Rabbku, Islam agamaku dan Muhammad Nabiku.” “Dan Allah menyesatkan orang-orang yang zhalim”, dari jalan kebenaran di dunia dan akhirat. Allah tidak berbuat kezhaliman kepada mereka. Mereka sendirilah yang telah menganiaya dirii mereka sendiri. Dalam ayat ini, terkandung petunjuk tentang wujud fitnah kubur, siksaan dan kenikmatan padanya, sebagaimana tertuang dalam banyak nash dari Nabi tentang fitnah dan bentuknya, kenikmatan kubur dan siksanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِٱلۡقَوۡلِ ٱلثَّابِتِ) bil qaulits tsaabit : “dengan perkataan yang kokoh” yaitu laa ilaaha illallaah. (وَفِي ٱلۡأٓخِرَةِۖ) wa fil aakhirah : “dan juga di akhirat.” Yaitu ketika di alam kubur dia mampu menjawab pertanyaan dua malaikat yang bertanya kepadanya mengenai Rabbnya, agamanya, dan nabinya. Makna ayat : Firman-Nya : (يُثَبِّتُ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ بِٱلۡقَوۡلِ ٱلثَّابِتِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَفِي ٱلۡأٓخِرَةِۖ) “Allah meneguhkan orang-orang yang beriman dengan perkataan yang kokoh ketika di dunia dan di akhirat.” Ini merupkan janji dari Allah ta’ala kepada para hamba-Nya yang beriman lagi jujut, bahwa Dia akan meneguhkan mereka di atas keimanan, seberat apapun ujian dan cobaan yang mereka hadapi, sampai mereka meninggal di atas keimanan (وَفِي ٱلۡأٓخِرَةِۖ) “dan di akhirat” ketika di alam kubur, ia adalah palang pintu menuju akhirat, tatkala dua malaikat bertanya kepadanya tentang Allah, agama, dan Nabi, “Siapakah tuhanmu?”, “Apa agamamu?”, “Siapakah nabiimu?”, maka Dia meneguhkan mereka dengan perkataan yang kokoh yaitu keimanan yang berdasarkan laa ilaaha illallaah muhammadar rasulullaah, dan amal saleh yaitu Islam. Firman-Nya : (وَيُضِلُّ ٱللَّهُ ٱلظَّٰلِمِينَۚ) “Dan Allah menyesatkan orang-orang yang zalim” lawan dari memberi hidayah kepada orang-orang yang beriman, Dia tidak menguatkan mereka dengan perkataan yang kokoh sehingga mereka mati di atas kekafiran, mereka binasa lagi merugi, karena mereka senantiasa berada di atas kesyirikan dan mereka menyeru kepada hal itu, menzalimi kaum mukminin dan menyiksa mereka karena keimanan mereka. Firman-Nya : (وَيَفۡعَلُ ٱللَّهُ مَا يَشَآءُ) “Dan Allah melakukan apa yang Dia kehendaki.” Penegasan akan kehendak-Nya yang bebas, Dia subhanahu wa ta’alaa meneguhkan siapapun yang Dia kehendaki, serta menyesatkan siapapun yang Dia kehendaki, maka tidak ada hal yang bisa melawan dan mengingkarinya, bersamaan itu juga, Dia memberikan petunjuk dan menyesatkan seseorang berdasarkan hikmah yang luhur, menjadikan hidayah begitu pula kesesatan sebagai tanda kasih sayang dan keadilan-Nya. Pelajaran dari ayat : • Kabar gembira bagi orang-orang yang beriman berupa pertolongan dari Allah ta’ala baginya—karena ia beriman hingga ajal menjemput—dari azab kubur, sehingga ia bisa menjawab pertanyaan dari Munkar dan Nakir, dikarenakan pertolongan Allah untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 27: Nasa'i meriwayatkan dengan sanadnya dari Khaitsamah dari Al Barra’ tentang ayat, “Yutsabbitullahulladziina aamanuu…dst.” Ia berkata, “Turun tentang azab kubur.” Ia juga meriwayatkan dengan sanadnya dari Sa’ad bin ‘Ubaid dari Al Barra’ dari Nabi shallallahu 'alaihi wa sallam tentang ayat, “Yutsabbitullahulladziina aamanuu…dst.” Beliau bersabda, “Turun tentang azab kubur. Dikatakan kepada (penghuni) kubur, “Siapa Tuhanmu?” Ia menjawab, “Allah Tuhanku dan agamaku adalah agama Muhammad shallallahu 'alaihi wa sallam.” Itulah maksud firman Allah Ta’ala, ““Yutsabbitullahulladziina aamanuu…dst.” (Diriwayatkan pula oleh Ibnu Majah dengan sanad yang kedua, dan diriwayatkan pula oleh Bukhari dan Muslim). Yang dimaksud ucapan yang teguh di sini ialah kalimat yang baik yang disebutkan dalam ayat 24 di atas, yakni kalimat tauhid. Yaitu ketika datang fitnah syubhat dengan ditunjukkan kepada keyakinan, ketika datang fitnah syahwat dengan ditunjukkan kepada tekad yang kuat; mendahulukan apa yang dicintai Allah daripada menuruti hawa nafsunya. Yaitu ketika maut menjemput dengan istiqamah di atas Islam, diberi husnul khatimah, dan mampu menjawab dengan benar pertanyaan malaikat Munkar dan Nakir tentang Tuhannya, agamanya dan nabinya. Sehingga tidak mampu menjawab pertanyaan itu, bahkan berkata, “Ee..,ee..,ee…, saya tidak tahu.” Sebagaimana disebutkan dalam hadits. Dalam ayat di atas terdapat dalil adanya fitnah kubur, nikmat kubur dan azab kubur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 27",
    "description": "Allah meneguhkan hati orang-orang yang beriman dengan ucapan yang teguh, yaitu kesaksian bahwa tiada tuhan selain Allah dan nabi Muhammad adalah utusan Allah, dalam kehidupan mereka di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zalim dari jalan kebenaran, dan Allah berbuat apa saja yang dia kehendaki, seperti memberi hidayah kepada orang mukmin dan membiarkan sesat orang yang ingkar. Allah membiarkan sesat orang yang ingkar, namun bukan berarti Allah berbuat sewenang-wenang. Apa yang mereka alami merupakan akibat dari perbuatan buruk mereka sendiri. Wahai manusia, tidakkah kamu memperhatikan bagaimana kesudahan orang-orang kafir yang telah menukar nikmat yang telah Allah turunkan kepada mereka, seperti nikmat kesejahteraan dan pengutusan para rasul kepada mereka, dengan ingkar kepada Allah dan menjatuhkan kaumnya ke lembah kebinasaan dengan mengajak mereka memusuhi Allah dan utusan-Nya'."
  }
]