[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu wahai orang yang diajak bicara -dan yang dimaksud adalah semua orang-, tidak melihat keadaan orang-orang yang mendustakan(rasul) seperti kaum quraisy yang telah memilih kekafiran kepada Allah sebagai ganti kewajiban bersyukur kepadaNya atas nikmat keamanan di kota suci dan nikmat diutusnya nabi Muhammad di tengah mereka? dan sesungguhnya mereka justru menempatkan para pengikutnya pada tempat kebinasaaan ketika memberangkatkan mereka ke perang badar,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Sungguh kamu telah melihat orang-orang yang kafir kepada Allah dan Rasul-Nya dari kaum Quraisy manakala mereka mengganti nikmat Allah kepada mereka, yaitu nikmat aman di tanah Haram dan diutusnya Muhammad -ṣallallāhu 'alaihi wa sallam- dari kalangan mereka, lalu mereka malah menggantinya dengan sikap kufur kepada nikmat Allah manakala mereka mendustakan apa yang Muhammad bawa dari Rabbnya, mereka mendudukkan orang-orang yang mengikuti mereka dalam kekufuran dari kaum musyrikin di negeri kebinasaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Hai Nabi, Apakah kamu tidak melihat keadaan orang-orang yang jauh dari kedudukanmu di sisi Allah? mereka mengganti kenimatan keamanan, al-Qur’an, dan kedatangan rasul dengan kekafiran, sehingga mereka membuat kaum mereka terjerumus ke dalam kebinasaan, yaitu ke dalam neraka Jahannam. Mereka merasakan panasnya, dan itulah seburuk-buruk tempat. Ibnu ‘Abbas berkata: (ألم تر إلى الذين بدلوا نعمة الله كفرا), mereka adalah orang-orang kafir dari penduduk Makkah. (Shahih al-Bukhari 8/229, kitab tafsir surat Ibrahim, bab ayat, no. 470)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا۟ نِعْمَتَ اللهِ كُفْرًا (Tidakkah kamu perhatikan orang-orang yang telah menukar nikmat Allah dengan kekafiran) Ini merupakan bentuk keheranan dari perbuatan orang-orang kafir yang mengganti rasa syukur atas kenikmatan Allah dengan keingkaran terhadap nikmat tersebut, yaitu dengan mendustakan Nabi Muhammad yang diutus oleh Allah yang berasal dari kaum mereka, dan ini merupakan suatu kenikmatan yang diberikan kepada mereka. وَأَحَلُّوا۟ قَوْمَهُمْ دَارَ الْبَوَارِ(dan menjatuhkan kaumnya ke lembah kebinasaan) Yakni Jahannam. Makna (البوار) yakni kebinasaan. Mereka adalah para pemimpin kaum Quraisy yang menjerumuskan kaumnya pada perang Badar kedalam kebinasaan. Yakni kematian yang menimpa mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Para ilmuan barat mengakui kecanggihan sistem perbankan syari'ah yang diterapkan dibeberapa negara muslim, namun sebagian anak-anak kaum muslimin yang mempunyai peran penting dalam kemajuan ekonomi di negara-negara muslim justru menganggap bahwa sistem kapitalis riba dalam dunia perbankan bagaikan darah dalam tubuh manusia, sehingga dengannya mereka menghilangkan harta mereka sendiri dan harta kaum muslimin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Tidakkah kalian melihat orang yang mengubah rasa syukur terhadap nikmat Allah menjadi kekufuran. Mereka adalah pemimpin-pemimpin orang kafir dan orang musyrik dengan mendustakan risalah Muhammad SAW dan syariatnya. Mereka memberikan rumah kehancuran terhadap kaum yang mengikuti mereka dalam kekufuran, yaitu neraka Jahanam, dengan menyiapkan mereka sebab-sebab masuk neraka, lalu mereka semua masuk ke dalamnya. Ini merupakan keadaan mereka yang mengherankan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak melihat orang-orang yang telah menukar} mengganti {nikmat Allah dengan kekufuran dan menjatuhkan} menurunkan {kaumnya ke lembah kebinasaan} kehancuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah berfirman menjelaskan kondisi riil orang-orang yang mendustakan RasulNya, dari kalangan orang-orang kafir Quraisy dan kesudahan ulah mereka. “Tidakkah kamu perhatikan orang-orang yang menukar nikmat Allah dengan kekafiran”, kenikmatan dari Allah yakni pengutusan Muhammad kepada mereka untuk menyeru mereka kepada pencapaian kebaikan-kebaikan di dunia dan akhirat, dan (menyeru) kepada kesalamatan dari macam-macam kejelekan dunia dan akhiirat. Mereka menggantikan nikmat ini dengan menampiknya dan mengingkarinya serta berpaling darinya dengan tindakan diri mereka sendiri dan menghalangi orang lain sehingga “menjatuhkan kaumnya ke lembah kebinasaan”, yaitu neraka. Mereka menjadi faktor penyeab kesesatan mereka sendiri, hingga menjelma sebagai malapetaka bagi kaum mereka, padahal diperkirakan memberikan manfaat bagi mereka. Dia antaranya, mereka berhasil membujuk kaum mereka untuk keluar menuju perang Badar guna memerangi Allah dan RasulNya. Maka, terjadilah apa yang sudah dibukukan sejarah. Banyak pembesar dan tokoh mereka yang terbunuh dalam pertempuran tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بَدَّلُواْ نِعۡمَتَ ٱللَّهِ كُفۡرٗا) baddaluu ni’matallaahi kufraa : “mengganti nikmat Allah dengan kekafiran” mereka mengganti tauhid dan islam dengan pengingkaran dan syirik. (دَارَ ٱلۡبَوَارِ) daaral bawaar : “negeri kehancuran.” Jahanam. Makna ayat : Firman-Nya : (أَلَمۡ تَرَ) “Apakah engkau tidak melihat” apakah engkau belum mengetahui, wahai Rasul Kami, (إِلَى ٱلَّذِينَ بَدَّلُواْ نِعۡمَتَ ٱللَّهِ) “orang-orang yang mengganti kenikmatan Allah” yaitu Islam yang dibawa oleh Rasulullah shallahu ‘alaihi wa sallam dan apa yang beliau bawa berupa petunjuk dan kebaikan, namun mereka mendustakan utusan Alah dan mendustakan apa yang dia bawa dan lebih menyukai kekufuran, kemudian mereka menempatkan kaum yang mereka ajak dan motivasi untuk mengikuti kekufuran dan mendustakan rasul (دَارَ ٱلۡبَوَارِ) “negeri kehancuran.” Maka binasalah siapapun yang binasa ketika perang Badar sedangkan ia dalam keadaan kafir di dalam Jahanam, daarul bawaar adalah Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 28: Allah Subhaanahu wa Ta'aala menerangkan keadaan orang-orang yang mendustakan Rasul-Nya, seperti halnya orang-orang kafir Quraisy, demikian pula menerangkan akhir yang akan mereka peroleh. Yang dimaksud dengan nikmat Allah di sini adalah diutus-Nya Muhammad shallallahu 'alaihi wa sallam kepada mereka yang mengajak kepada kebahagiaan di dunia dan akhirat, namun mereka malah membalas nikmat itu dengan sikap kufur dan mendustakan. Tidak hanya itu, mereka juga menghalangi orang lain dari jalan Allah dan mengarahkan orang lain masuk ke lembah kebinasaan. Dengan menyesatkan mereka. Termasuk dalam hal ini adalah ketika mereka membujuk kaumnya untuk berangkat ke Badar melakukan peperangan dengan kaum mukmin, akhirnya mereka dan kaumnya tewas dan jatuh ke dalam lembah kebinasaan. Di dunia mereka dikalahkan, dan di akhirat dimasukkan ke dalam Jahannam. Perumpamaan mereka adalah seperti orang yang terjatuh dari tangga lalu tertiban olehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 28",
    "description": "Allah membiarkan sesat orang yang ingkar, namun bukan berarti Allah berbuat sewenang-wenang. Apa yang mereka alami merupakan akibat dari perbuatan buruk mereka sendiri. Wahai manusia, tidakkah kamu memperhatikan bagaimana kesudahan orang-orang kafir yang telah menukar nikmat yang telah Allah turunkan kepada mereka, seperti nikmat kesejahteraan dan pengutusan para rasul kepada mereka, dengan ingkar kepada Allah dan menjatuhkan kaumnya ke lembah kebinasaan dengan mengajak mereka memusuhi Allah dan utusan-Nya'lembah kebinasaan tersebut yaitu neraka jahanam; mereka yang mengingkari Allah dan nikmat-nikmat-Nya akan masuk ke dalamnya dan merasakan betapa pedih siksa di dalamnya; dan jahanam itulah seburukburuk tempat kediaman."
  }
]