[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sehingga tempat kembali mereka adalah negeri kebinasaan, yaitu neraka jahanam, mereka akan memasukinya dan merasakan panasnya. Dan seburuk-buruk tempat tinggal adalah tempat tinggal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Negeri kebinasaan adalah neraka Jahanam yang mereka masuki, mereka merasakan panasnya, itulah seburuk-buruk tempat tinggal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَبِئْسَ الْقَرَارُ (dan itulah seburuk-buruk tempat kediaman) Seburuk-buruk tempat tinggal bagi mereka adalah neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Mereka masuk neraka Jahanam dan merasakan panasnya. Seburuk-buruk tempat tinggal adalah neraka Jahanam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) neraka Jahanam. Mereka masuk ke dalamnya} mereka masuk ke dalamnya {Seburuk-buruknya tempat kediaman} tempat tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Yaitu Neraka Jahanam, mereka masuk ke dalamnya”, panasnya akan mengitari diri mereka dari semua sisi. “Dan itulah seburuk-buruk tempat kediaman.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (جَهَنَّمَ يَصۡلَوۡنَهَاۖ) “Mereka dibakar di dalamnya” terbakar karena panas dan kobaran apinya (وَبِئۡسَ ٱلۡقَرَارُ) “dan itulah seburuk-buruk tempat tinggal.” Tempat menetap untuk kaum mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 29: Panasnya mengelilingi mereka dari segenap penjuru."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 29",
    "description": "Lembah kebinasaan tersebut yaitu neraka jahanam; mereka yang mengingkari Allah dan nikmat-nikmat-Nya akan masuk ke dalamnya dan merasakan betapa pedih siksa di dalamnya; dan jahanam itulah seburukburuk tempat kediaman. Dan tidak hanya mengingkari Allah dan nikmat-nikmat-Nya, mereka (orang kafir) itu telah menjadikan dan menyembah berhala-berhala sebagai tandingan bagi Allah yang seharusnya mereka imani dan esakan. Mereka melakukan hal tersebut untuk menyesatkan manusia dari jalan dan agama-Nya. Wahai nabi Muhammad, katakanlah kepada mereka, bersenang-senanglah di dunia ini dengan keingkaran kamu, karena sesungguhnya dunia ini akan segera sirna dan tempat kembalimu adalah ke neraka. Di sanalah kamu akan menerima balasan setimpal atas keingkaranmu."
  }
]