[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berpaling dan tidak beriman kepada Allah dan tidak mengikuti para rasulNya, mereka adalah orang-orang yang lebih memilih kehidupan dunia yang fana, dan mengabaikan kehidupan akhirat yang abadi, serta menghalangi manusia untuk mengikuti agama Allah, dan menginginkannya menjadi jalan yang bengkok supaya selaras dengan keinginan hawa nafsu mereka. Orang-orang yang bersifat demikian, berada dalam jalan kesesatan dari kebenaran dan jauh dari setiap sebab untuk meraih hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Orang-orang kafir mementingkan kehidupan dunia dan kenikmatannya yang sementara atas kehidupan Akhirat yang kenikmatannya langgeng, mereka memalingkan manusia dari jalan Allah, mereka ingin agar jalan Allah bengkok dan menyimpang dari kebenaran, mereka ingin condong dari jalan istikamah agar tidak dilalui oleh siapapun. Orang-orang yang sifatnya demikian berada di dalam kesesatan yang jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Sifat orang-orang yang mendustakan itu adalah mereka lebih mencintai kehidupan dunia yang fana daripada akhirat yang kekal, menghalangi dirinya sendiri orang lain agar tidak masuk Islam, dan selalu berusaha membuat kerusakan di muka bumi. Orang-orang yang jauh dari kebenaran dan rahmat Allah itu berada dalam kesesatan yang jauh, karena mereka sangat sesat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. الَّذِينَ يَسْتَحِبُّونَ الْحَيَوٰةَ الدُّنْيَا (orang-orang yang lebih menyukai kehidupan dunia) Lebih mengutamakan kehidupan dunia karena kecintaan mereka terhadapnya. عَلَى الْاٰخِرَةِ(dari pada kehidupan akhirat) Yang kekal dengan kenikmatan abadi, sebab mereka tidak beriman kepada akhirat. وَيَصُدُّونَ عَن سَبِيلِ اللهِ(dan menghalang-halangi (manusia) dari jalan Allah) Dengan melarang dan membelokkan mereka darinya. وَيَبْغُونَهَا عِوَجًا ۚ( dan menginginkan agar jalan Allah itu bengkok) Mereka berharap agar jalan itu menjadi bengkok agar menjadi selaras dengan keinginan dan hawa nafsu mereka. أُو۟لٰٓئِكَ فِى ضَلٰلٍۭ بَعِيدٍ(Mereka itu berada dalam kesesatan yang jauh) Yakni jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Azab bagi orang kafir yang lebih menyukai kehidupan dunia dari pada kehidupan akhirat yang kekal. Mereka menghalang-halangi manusia dari jalan keimanan dan masuk agama Islam. Mereka menginginkan agar jalan Allah itu bengkok dan menyeleweng dari kebenaran, yang sesuai dengan nafsu mereka.. Mereka itulah yang berada dalam kesesatan yang jauh dari kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang lebih menyukai} lebih suka dan memilih {kehidupan dunia daripada akhirat, menghalang-halangi dari jalan Allah} menghalangi manusia dari agama Allah {dan menginginkannya menjadi bengkok} menginginkan agar jalan Allah itu menjauh dan menyimpang dari kebenaran {Mereka itu berada dalam kesesatan yang jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Berikutnya, Allah menceritakan sifat-sifat mereka. Mereka adalah orang-orang yang menyukai “kehidupan dunia di atas kehidupan akhirat.” Mereka begitu gandrung kepadanya dan merasa tentram dengannya serta melalaikan akhirat. “Dan menghalang-halangi “, orang-orang “dari jalan Allah”, yang mana Allah telah menentukannya bagi hamba-hambaNya dan menjelaskannya di dalam kitab-kitabNya melalui penjelasan para rasulnya, mereka itu telah menentang Pelindung mereka dengan perseteruan dan peperangan “dan menginginkan agar jalan itu,” yaitu jalan Allah “bengkok.” Mereka begitu semangat berupaya memperburuk citranya dan mendiskreditkannya untuk tujuan menjauhkan (orang-orang) darinya. Tetapi Allah enggan (berkehendak) kecuali untuk menyempurnakan cahayaNya, kendatipun orang-orang kafir benci. “Mereka itu”, orang-orang yang telah disebutkan karakteristiknya “berada dalam kesesatan yang jauh”, karena mereka telah sesat dan menyesatkan (orang lain) serta menantang dan memusuhi Allah dan RasulNya. Apakah ada bentuk kesesatan yang lebih parah dari ini? Sedangkan orang-orang yang beriman, jelas berbeda dengan mereka, mereka mengimani Allah dan ayat-ayatNya, lebih mencintai akhirat daripada dunia, menyeru kepada jalan Allah serta berupaya menggambarkannya dengan citra yang baik semampu mereka dan menjelaskan unsur konsistensinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَن سَبِيلِ ٱللَّهِ) ‘an sabilillaah : “dari jalan Allah.” Yaitu Islam. (عِوَجًاۚ) ‘iwajaa : “bengkok” melenceng. Makna ayat : Orang-orang yang kafir adalah (ٱلَّذِينَ يَسۡتَحِبُّونَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا عَلَى ٱلۡأٓخِرَةِ) “Orang-orang yang lebih mencintai kehidupan dunia dari pada akhirat” yaitu lebih mengutamakan kehidupan dunia, sehingga mereka beramal untuk kehidupan dunia mereka dan meninggalkan amal untuk hari akhir karena mereka tidak beriman kepadanya (وَيَصُدُّونَ) “dan menghalang-halangi” diri mereka dan orang lain (عَن سَبِيلِ ٱللَّهِ) “dari jalan Allah” yaitu Islam (وَيَبۡغُونَهَا عِوَجًاۚ) “dan mengharapkannya untuk bengkok” melenceng, mereka menginginkan Islam mengikuti hawa nafsu mereka dan yang mereka inginkan, agar mereka bisa menerima dan meridhoinya sebagai agama mereka. Allah berfirman : (أُوْلَٰٓئِكَ فِي ضَلَٰلِۢ بَعِيدٖ) “mereka ada di dalam kesesatan yang jauh.” Sesungguhnya mereka dengan sikap yang seperti ini yang menunjukkan kecintaan kepada dunia dari pada akhirat serta menghalang-halangi dari Islam dan berusaha menguasai Islam untuk mewujudkan keinginan dan hawa nafsu mereka yang sesat lagi jauh dari kebenaran, tidak mungkin bagi orang yang memiliki sifat seperti ini untuk kembali kepada hidayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 3: Mereka merasa puas dan tenteram dengan kehidupan dunia, dan lupa terhadap akhirat. Jalan yang sudah disiapkan untuk hamba-hamba-Nya, yang diterangkan melalui kitab-kitab-Nya dan melalui lisan para rasul-Nya. Jalan tersebut maksudnya adalah agama Islam. Di antaranya dengan memperburuk citranya, akan tetapi Allah tidak menghendaki selain menyempurnakan cahaya-Nya meskipun orang-orang kafir benci. Adapun orang-orang yang beriman, maka mereka beriman kepada Allah dan ayat-ayat-Nya, menyukai kehidupan akhirat daripada dunia, mengajak manusia ke jalan Allah, menghiasnya dan menerangkan lurusnya jalan itu. Dari kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 3",
    "description": "Mereka yang ingkar dan enggan beriman kepada Allah adalah orang yang lebih menyukai kehidupan dunia yang fana daripada kehidupan akhirat yang kekal dan abadi, dan menghalang-halangi manusia dari menyusuri jalan (agama) Allah, dan menginginkan jalan yang bengkok agar sesuai dengan hawa nafsu mereka. Mereka itu benar-benar berada dalam jalan kesesatan yang sangat jauh dari hidayah. Dan ketahuilah bahwa kami tidak pernah mengutus seorang rasul pun kepada umat manusia, melainkan dengan bahasa yang dipergunakan oleh kaumnya. Yang demikian itu bertujuan agar dia dapat memberi penjelasan tentang syariat Allah dengan baik kepada mereka. Maka setelah rasul itu memberi penjelasan, Allah menyesatkan'membiarkan sesat' siapa yang dia kehendaki dari hamba-Nya yang memang memilih jalan kesesatan, dan memberi petunjuk kepada siapa yang dia kehendaki dari hamba-Nya yang memilih jalan yang lurus. Dia adalah tuhan yang mahaperkasa lagi mahabijaksana."
  }
]