[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir telah menjadikan bagi Allah sekutu-sekutu, yang mana mereka menyembah sekutu-sekutu itu di samping menyembah Allah, supaya menjauhkan manusia dari agmaNYa. katakanlah wahai rasul, ”nikmatilah kesenangan kalian di kehidupan dunia, sesungguhnya ia akan segera sirna, dan sesungguhnya tempat kembali dan tempat berpulang kalian adalah menuju neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Orang-orang musyrikin mengangkat sekutu-sekutu dan tandingan-tandingan bagi Allah untuk menyesatkan orang-orang yang mengikuti mereka dari jalan Allah sesudah mereka sendiri tersesat. Katakanlah kepada mereka -wahai Rasul-, \"Silakan kalian menikmati nafsu syahwat dan menyebarkan syubhat kalian di kehidupan dunia ini, sesungguhnya tempat kembali kalian pada hari Kiamat adalah api neraka, hanya itu tempat kembali kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Orang-orang kafir membuat sekutu-sekutu bagi Allah yang sama dengan-Nya dalam penyembahan agar mereka dapat menyesatkan diri sendiri dan orang lain dari agama Allah. Hai Rasulullah, katakanlah kepada mereka: “Bersenang-senanglah dengan kenikmatan dunia yang fana ini, karena tempat kembali kalian kelak adalah azab neraka Jahannam yang kekal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَجَعَلُوا۟ لِلّٰهِ أَندَادًا (Orang-orang kafir itu telah menjadikan sekutu-sekutu bagi Allah) Yakni sekutu-sekutu dalam sifat ketuhanan. لِّيُضِلُّوا۟ عَن سَبِيلِهِۦ ۗ( supaya mereka menyesatkan (manusia) dari jalan-Nya) Untuk menjerumuskan kaum mereka ke dalam kesesatan dari jalan Allah. Ini merupakan amalan para pemimpin kaum yang menjadikan diri mereka sebagai pelayan berhala-berhala dan sekte-sekte sesat. قُلْ تَمَتَّعُوا۟( Katakanlah: “Bersenang-senanglah kamu) Dengan syahwat kalian dan dalam menyesatkan orang lain. فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ(karena sesungguhnya tempat kembalimu ialah neraka”) Seakan-akan dikatakan kepada mereka “selama kalian tetap berbuat demikian maka tempat kembali kalian adalah neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Mereka membuat sekutu-sekutu dan pandangan-pandangan tentang tuhan lain yang layak disembah untuk Allah, supaya mereka bisa menempatkan kaumnya di dalam kesesatan daripada bertauhid di agama Islam. Katakanlah kepada mereka: “Wahai orang-orang musyrik bersenang-senanglah dengan syahwat kalian dan menyesatkan selain kalian, maka tempat kembali kalian adalah neraka, tidak ada yang lain bagi kalian kecuali itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itu telah membuat tandingan-tandingan bagi Allah} rekan dan sekutu dalam peribadatan {untuk menyesatkan dari jalanNya} agamaNya {Katakanlah,“Bersenang-senanglah} bersenang-senanglah dengan kenikmatan dunia {Sesungguhnya tempat kembali kalian adalah neraka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Dan orang-orang kafir itu telah menjadikan sekutu-sekutu bagi Allah”, tandingan-tandingan dan sekutu-sekutu “supaya mereka menyesatkan (manusiia) dari jalanNya”, untuk menyesatkan para hamba dari jalan Allah melalui tandingan-tandingan yang telah mereka tetapkan bagi Allah dan menyeru orang-orang untuk menyembahnya. “Katakanlah”, untuk mengancam mereka, “Bersenang-senanglah”, dengan kekufuran dan kesesatan kalian sejenak. Kesempatan itu tidaklah bermanfaat bagi kalian “karena sesungguhnya tempat kembalimu ialah neraka”, tempat kembali dan tempat kesudahan mereka adalah di dalamnya. Dan mereka itu merupakan seburuk-buruk tempat kembali."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَجَعَلُواْ لِلَّهِ أَندَادٗا) wa ja’aluu lillahi andaadaa : “mereka menjadikan untuk Allah tandingan-tandingan.” Sekutu-sekutu. Makna ayat : Firman-Nya : (وَجَعَلُواْ لِلَّهِ أَندَادٗا لِّيُضِلُّواْ عَن سَبِيلِهِۦۗ) “Dan mereka menjadikan untuk Allah tandingan-tandingan untuk menyesatkan mereka dari jalan-Nya.” Mereka yaitu yang membalas nikmat Allah dengan kekafiran—orang-orang kafir Mekah—membuat tandingan-tandingan untuk Allah, sekutu-sekutu: Lat, Uzza, Hubal, Manat, dan selain mereka berupa sesembahan yang batil. Mereka menjadikan berhala-berhala ini sebagai tandingan dan mengajak kepada peribadatan mereka, agar mereka tersesat dan menyesatkan selain mereka dari jalan Allah, Islam yang mengantarkan kepada keridhaan dan kebersamaan yang mulia dengan Allah ta’ala. Firman-Nya : (قُلۡ تَمَتَّعُواْ) “Katakanlah: ‘Bersenang-senanglah!” dengan apa yang kalian miliki berupa perhiasan dunia (فَإِنَّ مَصِيرَكُمۡ) “karena tempat kembali kalian.” Akhir dari urusan kalian (إِلَى ٱلنَّارِ) “menuju neraka.” Kalian akan kembali kesana seandainya kalian terus-menerus berada di atas kesyirikan dan kekafiran hingga kalian mati. Pelajaran dari ayat : • Perintah pada firman-Nya (قُلۡ تَمَتَّعُواْ) “bersenang-senanglah” bukan dalam maksud membolehkan tidak pula mewajibkan, tapi sebagai teguran dan ancaman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 30: Dikarenakan mereka mengadakan tandingan bagi Allah dan mengajak manusia untuk menyembah selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 30",
    "description": "Dan tidak hanya mengingkari Allah dan nikmat-nikmat-Nya, mereka (orang kafir) itu telah menjadikan dan menyembah berhala-berhala sebagai tandingan bagi Allah yang seharusnya mereka imani dan esakan. Mereka melakukan hal tersebut untuk menyesatkan manusia dari jalan dan agama-Nya. Wahai nabi Muhammad, katakanlah kepada mereka, bersenang-senanglah di dunia ini dengan keingkaran kamu, karena sesungguhnya dunia ini akan segera sirna dan tempat kembalimu adalah ke neraka. Di sanalah kamu akan menerima balasan setimpal atas keingkaranmu. Wahai nabi Muhammad, katakan dan pesankan-lah kepada hambahamba-ku yang telah beriman, untuk menyempurnakan iman, hendaklah mereka melaksanakan salat dengan segala aturan-aturannya, menginfakkan sebagian dari rezeki yang telah kami berikan secara sembunyi atau terang-terangan di jalan Allah, baik yang bersifat wajib maupun sunah. Hendaklah mereka berinfak sebelum datang hari kiamat ketika tidak ada lagi jual beli, yakni penebusan atas siksa Allah, dan tidak ada lagi persahabatan yang diharapkan dapat menyelamatkan manusia dari azab-Nya."
  }
]