[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai rasul, kepada hamba-hambaKu yang beriman, agar mereka menjalankan shalat dengan aturan-aturannya dan mengeluarkan sebagian yang Kami berikan kepada mereka dalam pos-pos kebajikan yang wajib maupun yang Sunnah, baik dengan sembunyi-sembunyi maupun terang-terangan, sebelum hari kiamat datang pada hari itu tidak akan bermanfaat tebusan maupun hubungan pertemanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Katakanlah -wahai Rasul- kepada orang-orang Mukmin, “Wahai orang-orang Mukmin, dirikanlah salat dengan sebaik-baiknya, infakkanlah sebagian dari apa yang telah Allah rezekikan kepada kalian, baik infak wajib maupun infak sunnah, dengan cara sembunyi-sembunyi untuk menghindari ria atau terbuka agar diikuti oleh orang lain sebelum datang satu hari di mana jual beli dan tebusan tidak berguna lagi di depan azab Allah, tidak pula hubungan pertemanan sehingga seorang teman bisa membantu temannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Hai Rasulullah, katakanlah kepada hamba-hamba-Ku yang beriman: “Dirikanlah shalat pada waktunya dengan menyempurnakan syarat-syaratnya, berikanlah sebagian harta yang telah Kami berikan kepada kalian kepada orang-orang yang membutuhkan dengan sembunyi-sembunyi atau terang-terangan sebelum datang hari kiamat yang tidak berguna lagi harta untuk menebus diri kalian dan tidak ada lagi ikatan persahabatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَيُنفِقُوا۟ مِمَّا رَزَقْنٰهُمْ سِرًّا وَعَلَانِيَةً (menafkahkan sebahagian rezeki yang Kami berikan kepada mereka secara sembunyi ataupun terang-terangan) Yakni dengan merahasiakannya atau menampakkannya. Terdapat pendapat mengatakan bahwa secara sembunyi-sembunyi pada sedekah sunnah, dan secara terang-terangan pada zakat wajib. مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا بَيْعٌ فِيهِ وَلَا خِلٰلٌ (sebelum datang hari (kiamat) yang pada bari itu tidak ada jual beli dan persahabatan) Yakni di hari kiamat tidak ada jual beli sehingga orang yang lalai dalam beramal dapat menebus dirinya dengan membayar tebusan, dan tidak ada persahabatan sehingga seorang sahabat dapat memberi syafaat bagi sahabatnya untuk menyelamatkannya dari azab."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا بَيْعٌ فِيهِ وَلَا خِلَالٌ } \"yang pada hari itu tidak ada jual beli dan persahabatan\" maka hendaklah setiap orang memperhatikan dengan siapa ia bersahabat?, dan dengan siapa a berteman? jika semuanya karena Allah maka diteruskan, namun jika karena selain Allah maka ketahuilah bahwasanya semua bersahabat akan menjadi permusuhan bagi pemiliknya pada hari kiamat kecuali persahabat orang-orang bertaqwah : { الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ } \"Teman-teman akrab pada hari itu sebagiannya menjadi musuh bagi sebagian yang lain kecuali orang-orang yang bertakwa\" [ Az-Zukhruf : 67 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai Nabi, katakanlah kepada mereka, yaitu hamba-hambaKu yang beriman kepada Allah dan hari akhir: “Dirikanlah shalat fardhu dengan sempurna, bersedekah dan berzakatlah kalian di saat rahasia dan terang-terangan sebelum datangnya hari kiamat yang sudah tidak ada harapan dan persahabatan yang bermanfaat di dalamnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada hamba-hambaKu yang beriman,“Hendaklah mereka melaksanakan shalat dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka secara sembunyi atau terang-terangan sebelum datang hari ketika tidak ada lagi jual beli} tidak ada perniagaan di dalamnya {dan persahabatan”} dan tidak ada persahabatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Artinya, katakanlah kepada para hambaKu yang beriman untuk memerintahkan mereka dengan perintah yang berisi puncak kemaslahatan bagi mereka dan sepatutnya mempergunakan kesempatan sebelum mereka tidak mampu berbuat apa-apa. “Hendaklah mereka mendirikan shalat”, secara zahir dan batin “menafkahkan sebagian rizki yang Kami berikan”, dalam bentuk kenikmatan yang telah Kami curahkan kepada mereka, sedikit atau banyak “secara sembunyi-sembunyi ataupun terang-terangan”, infak ini mencakup infak wajib, misalnya zakat, dan menafkahi orang yang wajib dinafkahi oleh seseorang, juga mencakup nafkah yang mustahab seperti sedekah-sedekah dan lainnya. “sebelum datang Hari (Kiamat) yang pada hari itu tidak ada jual beli dan persahabatan”, tidak ada sesuatu pun yang berguna pada waktu itu, dan tidak ada cara untuk mengejar sesuatu yang telah terlewatkan, tidak terbeli melalui praktek transaksi jual beli, atau dengan pemberian hibah (hadiah) dari orang terkasih atau teman akrab. Setiap insan mempunyai urusan sendiri-sendiri yang menyibukannya. Hendaklah seorang hamba mempersembahkan (amalan) bagi dirinya dan memperhatikan apa yang telah dia persiapkan untuk hari esok. Hendaklah dia memantau aktifitas-aktifitasnya, mengintrospeksi diri sebelum datangnya hari perhitungan yang agung."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَّا بَيۡعٞ فِيهِ وَلَا خِلَٰلٌ) laa bai’un fiih walaa khilaal : “Tidak ada perniagaan dan juga persaudaraan di dalamnya.” Dan itu pada hari kiamat, tidak ada jual-beli, tidak ada tebusan, persaudaraan, atau pertemanan. Makna ayat : Ketika Allah memerintahkan rasul-Nya agar berkata kepada mereka, orang-orang yang mengganti nikmat Allah dengan kekufuran (قُلۡ تَمَتَّعُواْ فَإِنَّ مَصِيرَكُمۡ إِلَى ٱلنَّارِ ) “Bersenang-senanglah, karena sesungguhnya tempat kembali kalian adalah neraka.” Memerintahkan rasul-Nya juga agar berkata kepada kaum mukminin yang mereka menegakkan shalat, dan berinfak dari sebagian harta mereka, baik secara diam-diam atau terang-terangan, agar mereka terhindar dari azab pada hari kiamat yang diancamkan kepada orang-orang kafir. Allah berfirman : (قُل لِّعِبَادِيَ ٱلَّذِينَ ءَامَنُواْ يُقِيمُواْ ٱلصَّلَوٰةَ) “Katakanlah kepada hamba-hamba-Ku yang beriman, agar mereka mendirikan shalat.” Mengerjakannya sesuai dengan yang telah disyariatkan, menyepurnakan ruku’, sujud, dan menunaikannya sesuai dengan waktu yang telah ditentukan secara berjama’ah, dengan kebersihan yang sempurna, menghadap kiblat, sehingga shalat itu dapat menghasilkan kebersihan jiwa dan ruh (وَيُنفِقُواْ) “menginfakkan” melakukan infak di segala waktu (مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ) “sembunyi-sembunyi dan terang-terangan” (مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٌ) “sebelum datang suatu hari” yaitu hari kiamat لَّا بَيۡعٞ فِيهِ وَلَا خِلَٰل) “tidak ada di sana perniagaan dan kekerabatan” tidak ada transaksi, sehingga seseorang bisa membayar tebusan akan dirinya dengan cara jual-beli, dan tidak pula kekerabatan, yaitu: pertemanan yang dapat membantunya dan memberikannya syafa’at kecuali atas izin Allah ta’ala. Pelajaran dari ayat : • Kewajiban mendirikan salat, menunaikan zakat, dan memperbanyak sedekah, sebagai pelindung dari azab nereka. • Diperbolehkan bersedekah dengan terang-terangan, begitu pula secara sembunyi-sembunyi, walaupun yang terakhir (diam-diam) lebih baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 31: Memerintahkan sesuatu yang di sana terdapat hal yang dapat memperbaiki keadaan mereka. Infak di sini mencakup infak yang wajib, seperti zakat, infak kepada orang yang ditanggungnya, dsb. Demikian pula mencakup infak yang sunat, seperti sedekah, dsb. Maksudnya, pada hari kiamat itu tidak ada penebusan dosa dan pertolongan sahabat, Lihat juga ayat 254 surat (2) Al Baqarah. Pada hari itu, bukan lagi waktunya mengejar yang telah luput, tidak berlaku jual beli, pemberian dari kawan dan sebagainya. Masing-masing sibuk dengan urusannya. Oleh karena itu, hendaknya seorang hamba memperhatikan apa yang telah disiapkan untuk hari esok (kiamat), hendaknya ia hisab dirinya sebelum menghadapi hisab yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 31",
    "description": "Wahai nabi Muhammad, katakan dan pesankan-lah kepada hambahamba-ku yang telah beriman, untuk menyempurnakan iman, hendaklah mereka melaksanakan salat dengan segala aturan-aturannya, menginfakkan sebagian dari rezeki yang telah kami berikan secara sembunyi atau terang-terangan di jalan Allah, baik yang bersifat wajib maupun sunah. Hendaklah mereka berinfak sebelum datang hari kiamat ketika tidak ada lagi jual beli, yakni penebusan atas siksa Allah, dan tidak ada lagi persahabatan yang diharapkan dapat menyelamatkan manusia dari azab-Nya. Wahai manusia, perhatikan dan renungkanlah bahwa Allah-lah yang telah menciptakan langit dan bumi dari ketiadaan dan tanpa model yang mendahuluinya. Dan dia pula yang telah menurunkan air hujan dari awan di langit, kemudian dengan air hujan itu dia menghijaukan bumi yang semula mati dengan tumbuh-tumbuhan yang mengeluarkan berbagai buah-buahan sebagai rezeki dan penopang hidup untukmu. Dan dia pula yang telah menundukkan kapal bagimu agar engkau dapat dengan mudah berlayar di lautan dengan kehendak-Nya demi memenuhi kebutuhan hidupmu. Dan dia juga yang telah menundukkan sungai-sungai bagimu agar kamu dan hewan-hewan ternakmu dapat minum darinya serta bisa kamu manfaatkan untuk keperluan lainnya."
  }
]