[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah Dialah yang menciptakan langit dan bumi dan mengadakannya dari tidak ada, dan menurunkan hujan dari awan, lalu Dia menghidupkan dengannya bumi setelah kekeringannya, juga mengeluarkan bagi kalian rizki-rizki darinya, dan mengendalikan kapal-kapal bagi kepentingan kalian, sehingga dapat berlayar di laut dengan perintahNya untuk kepentingan-kepentingan kalian, dan Dia menundukan sungai-sungai bagi kalian sebagai sumber air minum bagi kalian dan air minum bagi ternak-ternak kalian, serta pengairan bagi tanam-tanaman kalian dan seluruh manfaat-manfaat yang kalian dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Allah yang menciptakan langit dan bumi tanpa contoh sebelumnya. Allah menurunkan hujan dari langit, lalu dengan hujan tersebut Allah mengeluarkan berbagai macam buah-buahan sebagai rezeki bagi kalian wahai manusia. Allah menundukkan bahtera-bahtera yang berjalan di atas air sesuai dengan pengaturan-Nya. Allah menundukkan sungai-sungai agar kalian bisa minum darinya dan memberi minum hewan dan ladang kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32-33. Allah menyampaikan besarnya kenikmatan dan penciptaan-Nya, Dialah yang menciptakan tujuh langit dan bumi tanpa ada contoh sebelumnya, menurunkan hujan dari awan sehingga menumbuhkan berbagai macam tanaman dan buah-buahan, menundukkan bagi kalian kapal-kapal besar sehingga dapat berlayar di lautan dengan perintah-Nya agar kalian memanfaatkannya untuk bepergian dan mengangkut barang-barang, menundukkan sungai-sungai air tawar untuk kalian minum dan mengairi tanaman dan memberi minum hewan-hewan, menundukkan matahari dan bulan dengan teratur dan terus menerus sehingga bermanfaat bagi kehidupan kalian, menjadikan malam sebagai waktu kalian beristirahat, dan menjadikan siang sebagai waktu kalian mencari rezeki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَأَخْرَجَ بِهِۦ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ ۖ (Dia mengeluarkan dengan air hujan itu berbagai buah-buahan menjadi rezeki untukmu) Yakni Allah mengeluarkan dari air itu berbagai macam buah-buahan sebagai rezeki bagi bani Adam untuk kehidupan mereka. وَسَخَّرَ لَكُمُ الْفُلْكَ(dan Dia telah menundukkan bahtera bagimu) Sehingga ia dapat berlayar sesuai keinginan kalian dan kalian menggunakannya untuk maslahat kalian. وَسَخَّرَ لَكُمُ الْأَنْهٰرَ (dan Dia telah menundukkan (pula) bagimu sungai-sungai) Sehingga kalian dapat berlayar di permukaannya, dan dapat mengalirkan airnya ke tempat yang kalian kehendaki untuk menyirami pepohonan dan tanaman kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan dalil-dalil tentang kuasa, eksistensi dan keesaan Allah itu sangat banyak, di antaranya yaitu bahwa Allah itu menciptakan langit dan bumi, menurunkan hujan dari awan, lalu melalui air itu Dia menumbuhkan buah-buahan dan hasil pertanian sebagai rejeki supaya kalian bisa hidup, wahai manusia, Dia menundukkan dan menyiapkan bagi kalian kapal-kapal supaya bisa berlayar di lautan supaya kalian bisa mengambil manfaat, berdagang dan berbuat sesuatu sesuai izin dan kehendakNya. Dia juga menundukkan sungai-sungai bagi kalian untuk dinikmati, mengairi tanaman, minum hewan, menghidupkan listrik, dan manfaat-manfaat lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah adalah Dzat yang telah menciptakan langit dan bumi, menurunkan air dari langit, lalu dengan air itu Dia mengeluarkan buah-buahan sebagai rezeki untuk kalian. Dia telah menundukkan} menundukkan {kapal} bahtera {bagi kalian agar bisa berlayar di lautan dengan kehendakNya. Dia telah menundukkan sungai-sungai bagi kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah memberitakan bahwa Dia-lah semata “yang telah menciptakan langit dan bumi”, dengan segala bentuknya yang luas lagi besar “dan menurunkan air hujan dari langit”, air hujan yang Allah turunkan dari gumpalan mendung, lantas mengeluarkan dengan air itu “berbagai buah-buahan”, yang bermacam-macam jenisnya “menjadi rizki bagi kamu”, dan sebagai rizki bagi hewan ternak kalian “dan Dia telah menundukkan bahtera bagimu”, kapal-kapal dan perahu-perahu “supaya bahtera itu berlayar di lautan dengan kehendakNYa”, DIa-lah Dzat yang memudahkan proses pembuatannya bagi kalian dan memberikan kemampuan bagi kalian untuk mengerjakannya dan menjaganya (tetap mengambang) di atas aliran air. Gunanya, untuk membawa kalian dan benda perniagaan kalian serta barang-barang kalian menuju tempat yang kalian tuju. “Dan Dia telah menundukkan (pula) bagimu sungai-sungai”, untuk mengairi sawah pertanian kalian dan pepohonan, dan untuk kalian minum sebagiannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلۡفُلۡكَ) al-fulk : “bahtera-bahtera” kapal-kapal, kata al-fulk menunjukkan bentuk jamak, sehingga ia bisa menjadi mudzakkar (maskulin) atau muannats (feminim). Makna ayat : Firman-Nya : (ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ) “Allah lah, yang menciptakan langit dan bumi” memulai penciptaannya (وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ) ”dan menurunkan dari langit air” yaitu air hujan (فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ) “dan muncullah darinya buah-buahan” dan biji-bijian (رِزۡقٗا لَّكُمۡۖ) “sebagai rizki bagi kalian” kalian melangsungkan kehidupan dengannya (وَسَخَّرَ لَكُمُ ٱلۡفُلۡكَ) “dan menundukkan bagi kalian bahtera-bahtera” kapal-kapal (لِتَجۡرِيَ فِي ٱلۡبَحۡرِ بِأَمۡرِهِۦۖ) “agar ia berlayar diatas lautan dengan perintah-Nya” dengan izin-Nya dan pengaturan-Nya,kalian mengangkut dengannya barang-barang dari satu daerah ke daerah lainnya, dan menaikinya juga (وَسَخَّرَ لَكُمُ ٱلۡأَنۡهَٰرَ) “dan menundukkan sungai-sungai.” Yang mengalir dengan air yang segar, untuk kalian minum dan mengairi sawah-sawah dan kebun-kebun kalian. Pelajaran dari ayat : • Mengenal Allah ‘azza wa jalla, karena dengan mengenal Allah ta’ala dapat menumbuhkan ketakutan kepada-Nya ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 32: Dengan keadaannya yang luas dan besar. Dia yang memudahkan kamu membuatnya, membuat kamu menguasainya, menjaga kapal itu di hadapan gelombang air laut yang besar agar dapat membawamu dan membawa barang-barang kamu ke tempat yang kamu tuju. Untuk menyirami tanaman dan pepohonanmu, dan agar kamu dapat meminum airnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 32",
    "description": "Wahai manusia, perhatikan dan renungkanlah bahwa Allah-lah yang telah menciptakan langit dan bumi dari ketiadaan dan tanpa model yang mendahuluinya. Dan dia pula yang telah menurunkan air hujan dari awan di langit, kemudian dengan air hujan itu dia menghijaukan bumi yang semula mati dengan tumbuh-tumbuhan yang mengeluarkan berbagai buah-buahan sebagai rezeki dan penopang hidup untukmu. Dan dia pula yang telah menundukkan kapal bagimu agar engkau dapat dengan mudah berlayar di lautan dengan kehendak-Nya demi memenuhi kebutuhan hidupmu. Dan dia juga yang telah menundukkan sungai-sungai bagimu agar kamu dan hewan-hewan ternakmu dapat minum darinya serta bisa kamu manfaatkan untuk keperluan lainnya. Dan dia juga telah menundukkan matahari dan bulan bagimu yang terusmenerus beredar dalam orbitnya. Peredaran matahari sangat dibutuhkan oleh makhluk di bumi untuk berbagai keperluan, demikian juga bulan. Dan Allah pun telah menundukkan malam dan siang bagimu. Dengan begitu, kamu dapat beristirahat dengan tenang di malam hari dan menjalani aktivitas keseharian di siang hari."
  }
]