[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menundukan matahari dan bulan sehingga tidak mengendur dalam pergerakannya; supaya kemaslahatan-kemaslahatan terwujudkan melalui keduanya, dan Dia menundukan malam; supaya kalian dapat tenang dan beristirahat di dalamnya, dan siang hari untuk mencari sebagian dari karuniaNya dan mengatur penghidupan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Allah menundukkan matahari dan rembulan, keduanya beredar secara terus menerus, Allah menundukkan siang dan malam bagi kalian, malam untuk tidur dan istirahat dan siang untuk aktifitas dan kehidupan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ (Dan Dia telah menundukkan (pula) bagimu matahari dan bulan) Agar kalian dapat mengambil manfaat dari keduanya dan mengambil penerangan dari keduanya. دَآئِبَيْنِ ۖ( yang terus menerus beredar) Yakni yang terus menerus memperbaiki sesuatu seperti tanaman dan lainnya. Pendapat lain mengatakan yakni terus-menerus beredar karena ketaatan kepada Allah tanpa ada lelah untuk beredar. وَسَخَّرَ لَكُمُ الَّيْلَ وَالنَّهَارَ(dan telah menundukkan bagimu malam dan siang) Yang saling bergantian. Siang hari untuk usaha kalian mencari penghidupan, dan malam hari untuk beristirahat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Dia menciptakan untuk kalian matahari dan bulan yang keduanya selalu bisa diambil manfaatnya dan sinarnya, yang mana keduanya silih berganti di malam dan siang. Hal itu bisa mewujudkan kemaslahatan bagi kalian dan untuk mengetahui tahun-tahun dan perhitungannya. Dia juga menciptakan bagi kalian malam hari untuk istirahat dan siang hari untuk bekerja dan mencari keutamaan Allah dengan berdagang, bertani, membuat kerajinan dan lain-lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menundukkan bagi kalian matahari dan bulan yang terus-menerus beredar} yang terus beredar sampai hari kiamat tanpa berkurang sedikit pun {dan telah menundukkan bagi kalian malam dan siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. “Dan Dia telah menundukkan (pula) bagimu matahari dan bulan yang terus menerus beredar (dalam orbitnya)”, tidak lamban dan tidak tersendat-sendat, melaju guna menciptakan kemaslahatan bagi kalian seperti perhitungan waktu-waktu dan maslahat bagi fisik, hewan ternak, dan tanaman serta buah-buahan milik kalian. “Dan Dia telah menundukkan bagimu malam” agar kalian dapat tidur padanya “dan siang” penuh cahaya agar kalian dapat mencari sebagian dari keutamaanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (دَآئِبَيۡنِۖ) daaibain : “terus-menerus” berjalan di dalam orbitnya, senantiasa seperti itu selamanya, hingga akhir dunia. Makna ayat : (وَسَخَّرَ لَكُمُ ٱلشَّمۡسَ وَٱلۡقَمَرَ دَآئِبَيۡنِۖ) “dan mengedarkan matahari dan bulan yang terus menerus beredar.” Senantiasa berada di orbitnya selamanya, dan bergerak di orbitnya untuk kemaslahatan kalian yang tergantung akan sinar dan panas matahari dan peredaran bulan. (وَسَخَّرَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ) “dan menundukkan bagi kalian siang dan malam.” Malam agar kalian bersantai dan beristirahat di dalamnya, dan siang untuk kalian bekerja dan mencari rizki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 33: Unuk memberi maslahat bagimu, bagi hewan ternakmu, dan bagi tanamanmu. Untuk kamu beristirahat. Untuk kamu mencari karunia-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 33",
    "description": "Dan dia juga telah menundukkan matahari dan bulan bagimu yang terusmenerus beredar dalam orbitnya. Peredaran matahari sangat dibutuhkan oleh makhluk di bumi untuk berbagai keperluan, demikian juga bulan. Dan Allah pun telah menundukkan malam dan siang bagimu. Dengan begitu, kamu dapat beristirahat dengan tenang di malam hari dan menjalani aktivitas keseharian di siang hari. Dan dia telah memberikan kepadamu berbagai nikmat untuk keperluan hidup kamu sebagai anugerah atas segala apa yang kamu mohonkan kepada-Nya. Dan jika kamu berupaya menghitung nikmat Allah tersebut, niscaya kamu tidak akan mampu menghitungnya. Sungguh banyak nikmat yang telah Allah karuniakan, tetapi banyak sekali manusia yang mengingkari nikmat-nikmat itu. Mereka sangat zalim dan sangat mengingkari nikmat Allah."
  }
]