[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia telah memberikan kepada kalian dari setiap yang kalian minta. Dan jika kalian menghitung nikmat-nikmat Allah pada kalian, kalian tidak akan sanggup menghitung dan membilangnya, karena jumlahnya yang banyak dan bervariatif, sesungguhnya manusia benar-benar banyak berbuat kezhaliman terhadap dirinya lagi banyak ingkar terhadap nikmat-nikmat tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan Dia memberi kalian segala apa yang kalian minta dan apa yang tidak kalian minta. Bila kalian menghitung nikmat-nikmat Allah niscaya kalian tidak mampu menghitungnya, karena jumlahnya yang banyak dan beraneka macam, apa yang Allah sebutkan hanya sebagai contohnya saja. Sesungguhnya manusia banyak berbuat zalim terhadap dirinya sendiri, banyak mengingkari nikmat-nikmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan Allah memberi kalian segala yang kalian butuhkan dan yang kalian minta berupa kenikmatan-kenikmatan yang tidak terhitung banyaknya. Sungguh manusia sangat zalim dan banyak melupakan kenikmatan-kenikmatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلْتُمُوهُ ۚ (Dan Dia telah memberikan kepadamu (keperluanmu) dan segala apa yang kamu mohonkan kepadanya) Dan segala yang belum kalian minta. وَإِن تَعُدُّوا۟ نِعْمَتَ اللهِ لَا تُحْصُوهَآ ۗ( Dan jika kamu menghitung nikmat Allah, tidaklah dapat kamu menghinggakannya) Kalian tidak akan mampu menghitungnya dengan cara apapun. Seandainya ada seorang hamba yang hendak menghitung kenikmatan Allah yang diberikan kepadanya dalam penciptaan salah satu angota tubuhnya atau panca inderanya maka ia tidak akan mampu melakukannya. Jika demikian bagaimana dengan kenikmatan yang ada di seluruh badannya yang diciptakan Allah, serta kenikmatan-kenikmatan lain yang senantiasa menghampirinya dengan segala jenis dan macamnya. –ya Allah, kami bersyukur kepada-Mu atas segala kenikmatan yang telah Engkau berikan kepada kami, yang tidak ada yang mengetahuinya kecuali Engkau— إِنَّ الْإِنسٰنَ لَظَلُومٌ(Sesungguhnya manusia itu, sangat zalim) Yakni sangat zalim terhadap dirinya sendiri dengan melalaikan rasa syukur atas kenikmatan yang Allah karuniakan kepadanya. كَفَّارٌ(dan sangat mengingkari) Yakni sangat ingkar terhadap kenikmatan yang Allah berikan kepadanya dan tidak mensyukuri-Nya dengan semestinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا } \"Dan jika kamu menghitung nikmat Allah, tidaklah dapat kamu menghinggakannya\" sesungguhnya haq Alla itu lebih berat dibanding apapun yang telah diberikan oleh setiap hamba, dan sesungguhnya nikmat Allah itu lebih besar dibanding usaha hamba untuk menghitungnya, namun teruslah membawa dirimu kepada taubat kepada-Nya. 2 ). Suatu ketika hasan al-Bashri mengulang dalam satu malam firman Allah : { وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا }, kemudian ditanyaka kepadanya tentang amalannya itu, beliau berkata : sesungguhnya dengan ayat itu aku mengakui akan besarnya nikmat Allah, tidaklah kita membuka mata kemudian menutupnya lagi melainkan ada nikmat yang bertambah, dan sesungguhnya nikmat Allah yang tidak kita ketahui jauh lebih banyak dari apa yang kita ketahui. 3 ). { وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا } Barangsiapa yang ingin meneliti asal usul datangnya nikmat, maka hendaklah ia memerdekakan pikirannya di taman-taman qur'an, dan senantiasa memperhatikan bagaimana Allah membilang nikmat-Nya dan memperkenalkannya kepada hamba-hamba Nya dari ayat pertama sampai ayat terakhir dari al-qur'an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan Allah telah memberi segala sesuatu yang kalian inginkan melalui keadan dan ucapan kalian dan sesuatu yang tidak kalian inginkan (namun dibutuhkan). Jika kalian mau menghitung nikmat Allah yang telah dilimpahkan kepada kalian, maka kalian tidak akan bisa menghitung jumlahnya dan tidak akan cukup syukur atas segala sesuatu yang diinginkan itu. Namun manusia itu menzalimi diri sendiri dengan tidak mau mensyukuri nikmat. Karena sangat ingkar dan menyangkal nikmat Allah, sehingga tidak mensyukurinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menganugerahkan kepada kalian} memberi kalian {segala sesuatu yang kalian minta kepadaNya. Jika kalian menghitung nikmat Allah} nikmat Allah {niscaya kalian tidak akan mampu menghitungnya} tidak mampu mengetahui jumlahnya, dan tidak mampu menghitungnya karena jumlahnya yang banyak dan bermacam-macam{Sesungguhnya manusia itu benar-benar sangat zalim lagi sangat kufur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan Dia telah memberikan kepadamu (keperluanmu) dari segala apa yang kamu mohonkan kepadaNya”, Allah memberikan kepada kalian segala hal yang berhubungan dengan angan-angan dan kebutuhan kalian yang kalian mohonkan kepadaNya, baik melalui gerak-gerik kalian atau dengan pernyataan verbal berupa hewan-hewan ternak, alat-alat (piranti), produk-pruduk dan lain sebagainya. “Dan jika kamu menghitung nikmat Allah, tidaklah kamu dapat menghitungnya”, apalagi berkaitan dengan pelaksanaan syukur kalian terhadapnya “SEsungguhnya manusia itu, sangat zhalim dan sangat mengingkari (nikmat Allah)”, maksudnya sifat ini merupakan tabiat manusia, di mana dia berbuat zhalim dan nekad melakukan maksiat-maksiat, lalai Dallam memenuhi hak-hak Allah, sering mengingkari nikmat-nikmat Allah, tida mensyukurinya, tidak mengakuinya, kecuali orang-orang yang diberi hidayah oleh Allah, hingga mau bersyukur atas nikmat-nikmatNya, dan menyadari hak Rabbnya (atas dirinya) dan menjalankannya. Pada beberapa ayat ini, terdapat keterangan mengenai berbagai macam nikmat Allah yang banyak kepada hamba, baik terperinci ataupun global. Allah mengajak para hambaNya untuk berbuat syukur kepadaNya dan mengingatNya serta menganjurkan mereka untuk itu, mendorong untuk meminta dan berdoa kepadaNya di waktu-waktu malam dan siang hari, sebagaimana (timbal baliknya) bahwa nikmatNya akan datang berulang-ulang di segala waktu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَظَلُومٞ كَفَّارٞ) lazhaluumun kaffaar : “sungguh sangat zalim lagi ingkar.” Banyak berbuat zalim kepada dirinya atau orang lain, kaffaar sangat ingkar. Ini jika ia tidak beriman dan tidak mendapatkan hidayah, jika ia beriman dan mendapat hidayah maka sifat ini akan di cabut darinya. Makna ayat : (وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ) “Dan Dia memberikan segala sesuatu yang kalian minta.” Apa pun yang kalian butuhkan untuk kelangsungan kehidupan kalian. Inilah Allah, Yang berhak akan ibadah kalian, dengan penuh harap dan takut kepada-Nya. Inilah Dia, sesembahan yang benar, melazimkan agar seluruh ibadah hanya diberikan kepada-Nya, tidak ada sekutu bagi-Nya, tidak pula patung-patung dan berhala-berhala yang kalian sembah dan ajak untuk menyembahnya, yang menyebabkan kalian kafir dan ingkar, bahkan kepada kezaliman, keburukan dan kerusakan. Firman-Nya : (وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ) “dan seandainya kalian menghitung-hitung nikmat Allah, niscaya kalian tidak akan mampu.” Setelah Allah menyebutkan banyak nikmat-Nya, mengabarkan bahwa tidak mungkin seorang manusia bisa menghitung nikmat-nikmat Allah, sampai kapanpun. Kemudian menjelaskan di akhir nasihat dan peringatan ini. Bahwa jika seorang insan terhalang dari keimanan dan hidayah rabbaniyah (maka ia akan menjadi) (إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ) banyak berbuat zalim dan sangat ingkar, dan kita memohon perlindungan kepada Allah dari hal tersebut. Pelajaran dari ayat : • Kewajiban beribadah kepada Allah ta’ala dan batilnya beribadah kepada selain-Nya. • Pensifatan manusia dengan kezaliman dan ingkar yang sangat, selama dia tidak beriman dan konsisten dengan jalan Islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 34: Baik dengan lisanulmaqaal (ucapan) maupun lisaanul haal (keadaan yang menunjukkan butuh). Yakni orang kafir. Terhadap dirinya dengan bermaksiat. Inilah tabi’at manusia, zalim, berani berbuat maksiat, meremehkan hak-hak Tuhannya, mengingkari nikmat Allah, tidak mensyukurinya dan tidak mengakuinya, selain orang yang diberi petunjuk oleh Allah untuk mensyukuri nikmat-nikmat-Nya, mengenal hak Tuhannya dan menunaikannya. Dari ayat 32-34 disebutkan nikmat-nikmat Allah secara garis besar dan secara rinci; dengan ayat itu Allah mengajak hamba-hamba-Nya mensyukuri-Nya dan mengingat-Nya, mendorong mereka untuk meminta dan berdoa kepada-Nya di malam dan siang hari, sebagaimana nikmat-nikmat-Nya datang kepada mereka di setiap waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 34",
    "description": "Dan dia telah memberikan kepadamu berbagai nikmat untuk keperluan hidup kamu sebagai anugerah atas segala apa yang kamu mohonkan kepada-Nya. Dan jika kamu berupaya menghitung nikmat Allah tersebut, niscaya kamu tidak akan mampu menghitungnya. Sungguh banyak nikmat yang telah Allah karuniakan, tetapi banyak sekali manusia yang mengingkari nikmat-nikmat itu. Mereka sangat zalim dan sangat mengingkari nikmat Allah. Masih berkaitan dengan nikmat Allah, dijelaskan pula bahwa nabi ibrahim memohon kepada Allah agar anak cucunya diberi nikmat dan dihindarkan dari menyembah berhala. Dan ingatlah, ketika nabi ibrahim berdoa kepada Allah, ya tuhan, jadikanlah negeri mekah ini negeri yang aman, dan jauhkanlah aku beserta anak cucuku hingga akhir zaman agar tidak menyembah berhala."
  }
]