[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah wahai rasul, ketika Ibrahim berkata, untuk memohon kepada tuhannya, setelah menempatakan putranya, ismail dan ibunya –Hajar- untuk tinggal di lembah Makkah, ”wahai tuhanku jadikankah Makkah negeri yang aman yang setiap orang di dalamnya merasa aman, dan jauhkanlah aku dan anak-anakku dari penyembahan dari berahala-berhala."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Ingatlah -wahai Rasul- manakala Ibrahim berkata sesudah meninggalkan putranya Ismail dan ibunya Hajar di lembah Makkah, “Ya Rabbi, jadikanlah negeri ini yang padanya aku meninggalkan keluargaku, -yaitu Makkah- negeri yang aman, tidak ada darah yang ditumpahkan di sana, tidak ada seseorang yang dizalimi di sana dan jauhkanlah aku dan anak-anak turunanku dari menyembah berhala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35-36. Allah mengingatkan doa Ibrahim dan ketundukannya kepada Allah ketika dia menempatkan istrinya, Hajar dan anaknya, Ismail di Makkah. Dia berkata: “Ya Tuhanku, jadikanlah Makkah ini negeri yang aman tentram, penduduknya merasakan keamanan dan ketentraman dalam dirinya; hewan buruan dan pepohonannya juga mendapat keamanan. Dan jauhkanlah aku dan anak keturunanku dari penyembahan berhala-berhala yang telah menyesatkan banyak manusia dari agama Islam. Dan barangsiapa yang meneladaniku dalam ketauhidan dan keislaman maka dia adalah pengikut agamaku; dan barangsiapa yang menyelisihi perintahku dalam agamaku maka sesungguhnya Engkau Maha Pengampun bagi orang-orang yang bertaubat dan Maha Mengasihi mereka.” Syeikh as-Syinqithi berkata: Dalam ayat ini Allah tidak menjelaskan apakah Dia mengabulkan doa Ibrahim tersebut atau tidak; akan tetapi Allah menjelaskannya dalam ayat lain bahwa Dia mengabulkan doa itu bagi sebagian keturunannya, sebagaimana dalam firman-Nya: ومن ذريتهما محسن وظالم لنفسه مبين Dan diantara anak cucunya ada yang berbuat baik dan ada (pula) yang Zalim terhadap dirinya sendiri dengan nyata. (As-Shaffat: 113) Dan firman Allah: وجعلها كلمة باقية في عقبه Dan (lbrahim a. s.) menjadikan kalimat tauhid itu kalimat yang kekal pada keturunannya. (Zukhruf: 28)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَإِذْ قَالَ إِبْرٰهِيمُ (Dan (ingatlah), ketika Ibrahim berkata) Yakni ingatlah ketika ia mengatakan ini. Sebagian ahli tafsir berpendapat bahwa penyebutan kisah Nabi Ibrahim di sini adalah sebagai contoh dari kalimat yang baik yang mendatangkan buahnya setiap saat, yang bertujuan untuk menyeru kepada tauhid. رَبِّ اجْعَلْ هٰذَا الْبَلَدَ ءَامِنًا(Ya Tuhanku, jadikanlah negeri ini (Mekah), negeri yang aman) Yakni negeri Makkah; Nabi Ibrahim memohon kepada Tuhannya agar menjadikannya negeri yang aman. وَاجْنُبْنِى وَبَنِىَّ أَن نَّعْبُدَ الْأَصْنَامَ (dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala) Terdapat pendapat mengatakan, yang dimaksud nabi Ibrahim adalah anak-anak keturunannya sendiri saja. Dan pendapat lain mengatakan, seluruh anak cucu keturunannya. Makna (الأصنام) yakni patung yang dibuat oleh orang-orang jahiliyah dari batu dan lain sebagainya yang kemudian mereka sembah. Nabi Ibrahim memohon kepada Allah agar dijauhkan dari penyembahan berhala; maka orang selain Nabi Ibrahim lebih utama untuk takut dari perbuatan menyembah berhala, karena di setiap zaman memiliki berhalanya masing-masing yang bersembunyi di balik orang-orang yang berilmu di setiap zamannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan firman Allah ini yang mengabarkan tentang doa Ibrahim : { وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ } \"dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala\" lhatlah kepada Ibrahim yang merupakan kekasih Allah, Nabi yang benar-benar meyakini ketauhidan Allah dalam dirinya, dan bagaimana ia menghancurkan berhala-berhala dengan tangannya sendiri, takut terhadap dirinya akan penyembahan kepada berhala-berhala itu, dan ia juga takut jika terjadi pada anak-anaknya. brahim at-taimy mengatakan tentang tafsir ayat ini : adakah yang merasa lebih aman dari bala' terhadap dirinya setelah Ibrahim? dari sini kita ketahui bahwa tauhid adalah perangkap syaiton yang paling besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Ingatlah wahai Nabi, ucapan dan doa Ibrahim: “Wahai Tuhanku, jadikanlah negeri Mekah ini aman selamanya bagi siapa saja yang ada di dalamnya dari manusia, pepohonan dan binatang buruan. Jauhkanlah aku dan anak-anakku dari menyembah berhala yang tidak memberi mahdharat dan manfaat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Ibrahim berdoa,“Ya Tuhanku, jadikanlah negeri ini} Mekkah {negeri yang aman} aman {dan jauhkanlah aku} jauhkanlah aku {beserta anak cucuku dari menyembah berhala-berhala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Artinya “Dan”, ingatlah Ibrahim pada momentum yang bagus ini “ketika Ibrahim berkata, ‘Ya Rabbku, jadikanlah negeri ini (Makkah)’,” tanah Haram “negeri yang aman” kemudian Allah mengabulkan doanya, sebagai ketentuan syariat dan takdirNya. Lalu Allah menjadikannya tanah haram (suci) dalam syariat Islam dan membuat mudah faktor-faktor yang (memelihara) kesuciannya berdasarkan ketentuan takdirNya, seperti yang telah diketahui, hingga tidaklah ada orang zhalim yang berhasrat melancarkan keburukan padanya melainkan Allah membinasakannya. Sebagaimana yang dialami tentara gajah dan lain-lain. Ketika beliau memohon terciptanya keamanan baginya (tanah haram), maka beliau memohon jaminan keamanan bagi dirinya dan keturunannya. Beliau berkata “Dan jauhkanlah aku dan anak cucuku dari menyembah berhala”, jadikanlah kami dan mereka berada di posisi yang jauh dari beribadah dan berkonsentrasi dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (هَٰذَا ٱلۡبَلَدَ ءَامِنٗا) haadzal balada aaminaa : “negeri ini aman” yaitu, jadikanlah Mekah sebagai negeri yang aman bagi setiap yang memasukinya. (وَٱجۡنُبۡنِي) wajnubnii : “jauhkanlah aku” (أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ) anna’budal ashnaam : dari peribadahan kepada berhala-berhala. Makna ayat : Masih membahas perihal penegasan akan tauhid, kenabian, kebangkitan, dan pembalasan. Ayat-ayat tersebut telah mencakup semua hal di atas, firman-Nya ta’ala (وَإِذۡ قَالَ إِبۡرَٰهِيمُ) “Dan ingatlah tatkala Ibrahim berkata” ingatlah ketika Ibrahim berkata, bagaimana dia bisa mengingat hal tersebut, jika bukan karena wahyu dari Allah, maka ayat ini menafsirkan akan kenabian Rasulullah dan turunnya wahyu kepadanya. Firman-Nya : (رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا) “Wahai Rabbku, jadikanlah negeri ini negeri yang aman.” Memiliki keamanan bagi yang memasukinya, baik keamanan pada jiwa atau harta mereka. Maksud dari negeri di sini adalah Mekah. Firman-Nya : (وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ ) “dan jauhkanlah aku dan keturunanku dari peribadatan berhala.” Di sini terdapat penegasan akan tauhid, yaitu memurnikan ibadah hanya kepada Allah. Makna dari (ٱجۡنُبۡنِي) adalah jauhkanlah aku dan keturunanku, cucu-cucuku. Allah telah mengabulkan permohonannya, sehingga tidak ada dari keturunannya seorang musyrik. Pelajaran dari ayat : • Keutamaan kota Mekah dan kemuliaannya. • Rasa takut dari kesyirikan dan bahayanya, serta permohonan penjagaan kepada Allah ta’ala dari perkara tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 35: Allah Subhaanahu wa Ta'aala pun mengabulkan doa Beliau secara syara’ maupun taqdir. Secara syara’, Allah Subhaanahu wa Ta'aala menjadikannya sebagai tanah haram (suci), di mana tidak boleh dutumpahkan darah manusia di sana, tidak ada yang boleh dizalimi, binatang buruannya tidak boleh diburu, dan tidak boleh dipotong atau dicabut rerumputannya. Sedangkan secara taqdir, Allah Subhaanahu wa Ta'aala memudahkan sebab-sebab yang menjadikannya terhormat sebagaimana hal ini sudah maklum, bahkan tidak ada orang yang berniat jahat di sana kecuali Allah binasakan, sebagaimana yang terjadi pada As-habul fiil (pasukan bergajah) yang hendak merobohkan ka’bah. Yang demikian karena banyaknya orang yang terfitnah dengan berhala itu sehingga menyembahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 35",
    "description": "Masih berkaitan dengan nikmat Allah, dijelaskan pula bahwa nabi ibrahim memohon kepada Allah agar anak cucunya diberi nikmat dan dihindarkan dari menyembah berhala. Dan ingatlah, ketika nabi ibrahim berdoa kepada Allah, ya tuhan, jadikanlah negeri mekah ini negeri yang aman, dan jauhkanlah aku beserta anak cucuku hingga akhir zaman agar tidak menyembah berhala. Ya tuhan, aku tahu berhala-berhala itu telah menyesatkan banyak manusia akibat kebodohan mereka. Karena itu, barang siapa mengikutiku dan tidak menyembah berhala-berhala tersebut, maka orang itu termasuk golonganku, dan barang siapa mendurhakaiku dan menyembah berhala-berhala itu, maka hukumlah mereka. Akan tetapi, bila engkau ampuni mereka, maka engkau adalah tuhan yang maha pengampun, maha penyayang kepada hamba-hamba-Nya yang mau bertobat."
  }
]