[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhanku, sesungguhnya berhala-berhala sudah menjadi faktor penyebab dijauhkannya kebanyakan manusia dari jalan yang benar. Maka siapa saja yang mengikutiku dalam bertauhid, niscya dia berada di atas agama dan sunnahku. Dan barangsiapa menentangku dalam perkara selain syirik, maka sesungguhnya Engaku mahapengampun dosa-dosa orang-orang yang berbuat dosa -dengan kemurahanMu-, maha penyayang terhadap mereka, Engkau memaafkan siapa saja yang Engkau kehendaki dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Ya Rabbi! Sesungguhnya berhala telah menyesatkan banyak manusia, di mana manusia menyangka bahwa berhala itu memberi mereka syafaat, maka mereka terfitnah olehnya dan menyembahnya selain Allah. Barangsiapa mengikutiku dalam mentauhidkan Allah dan menaati-Nya, maka dia termasuk golonganku dan pengikutku, sebaliknya barangsiapa mendurhakaiku dan tidak mengikutiku dalam mentauhidkan Allah dan menaati-Nya, maka sesungguhnya Engkau ya Rabbi Maha Pengampun dosa-dosa siapa yang Engkau kehendaki untuk diampuni dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِّنَ النَّاسِ ۖ (Ya Tuhanku, sesungguhnya berhala-berhala itu telah menyesatkan kebanyakan daripada manusia) Padahal berhala-berhala tersebut merupakan benda mati yang tak berakal; karena berhala-berhala tersebut menjadi sebab kesesatan maka seakan-akan merekalah yang menyesatkan manusia. فَمَن تَبِعَنِى(maka barangsiapa yang mengikutiku) Dalam agamaku sehingga menjadi seorang muslim yang mengesakan Allah. فَإِنَّهُۥ مِنِّى ۖ (maka sesungguhnya orang itu termasuk golonganku) Yakni termasuk golonganku dan penganut agamaku. وَمَنْ عَصَانِى (dan barangsiapa yang mendurhakai aku) Sehingga tidak mengikutiku dan tidak masuk agamaku. فَإِنَّكَ غَفُورٌ رَّحِيمٌ(maka sesungguhnya Engkau, Maha Pengampun lagi Maha Penyayang) Engkau Mampu untuk mengampuninya. Terdapat pendapat mengatakan, yang dimaksud dengan kedurkaan disini adalah selain kesyirikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam doa Ibrahim kepada tuhannya : { وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ } \"dan barangsiapa yang mendurhakai aku, maka sesungguhnya Engkau, Maha Pengampun lagi Maha Penyayang\" menjelaskan kesempurnaan rasa simpati dan kasih sayang Ibrahim kepada orang lain, ketika umat manusia ramai-ramai melakukan kemaksiatan kepada Allah ia justru tidak mendoakan untuk mereka keburukan, melainkan ia meminta kepada Allah atas nama-Nya yang Maha pengampun dan penyayang ini agar Ia memberi ampun kepada mereka dan mengasihaninya, dan ayat ini juga membuktikan bahwa Ibrahim yang selalu bersendiri dengan tuhannya tidak hanya memohon keselamatan untuk dirinya sendiri, dan tidak juga ia meminta kemaslahatan untuk drinya diatas kemaslahatan dakwah, karena ia yakin bahwa dakwah yang benar adalah mengajak ummat manusia agar kembali kepada kebenaran yang diturunkan oleh Allah, dan bukan kesempatan untuk mengajukan kepentingan diri sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Wahai Tuhanku sesungguhnya berhala-berhala itu menjadi sebab kesesatan banyak orang dan mereka yang mengikutiku dalam Islam, tauhid dan tidak menyembah berhala, meskipun hanya benda mati, sedangkan mereka itu termasuk keluargaku dan orang yang menentangku, namun mereka tidak memeluk agamaku. Sesungguhnya engkau adalah Dzat yang Maha Pengampun bagi orang yang bertaubat dan Maha Pengasih bagi orang yang berserah diri dan memperbaiki diri. Doa ini merupakan penolong ketika berbuat maksiat, selain orang-orang musyrik dan orang-orang kafir. Dan puntu taubat itu terbuka bagi orang yang mau bertaubat, mengakui kesalahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhanku, sesungguhnya mereka telah menyesatkan banyak manusia. Maka siapa saja yang mengikutiku, sesungguhnya dia termasuk golonganku} dari golongan pemeluk agamaku {dan siapa saja yang mendurhakaiku, sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Kemudian Allah menyebutkan alasan kekhawatiran Nabi Ibrahim terhadap praktik kesyirikan pada diri dan anak-keturunannya, yaitu banyaknya orang yang terfitnah dan tergoda oleh peribadahan syirik. Dia berkata, “Ya Rabbku sesungguhnya berhala-berhala itu telah menyesatkan kebanyakan dari manusia”, mereka tersesat disebabkannya “maka barangsiapa mengikutiku”, sesuai kandungan risalah yang aku bawa, berupa tauhid dan ikhlas kepada Allah Rabb semesta alam “maka sesungguhnya dia termasuk golonganku”, lantaran integritasnya dalam mengikuti. Barangsiapa mencintai suatu kaum, niscaya akan mengikuti mereka, dan bergabung dengan mereka. “Dan barangsiapa yang mendurhakaiku, maka sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang”, ungkapan ini menjadi bukti rasa iba Ibrahim (kepada anak cucunya) di mana beliau berdoa bagi orang yang bermaksiat agar mendapatkan ampunan dan rahmat dari Allah. Allah lebih sayang daripada Ibrahim kepada para hamba Allah, tidak menyiksa kecuali orang yang keras kepala (dalam maksiat)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ) adhlalna katsiiram minannaas : “mereka telah menyesatkan banyak manusia” dengan manusia menyembah mereka. (فَمَن تَبِعَنِي فَإِنَّهُۥ مِنِّيۖ) faman tabi’anii fainnahuu minnii : “barangsiapa yang mengikutiku, maka ia termasuk dari golonganku.” Yang mengikutiku dengan tauhid maka ia adalah pemeluk agama dan ajaranku. Makna ayat : Firman-Nya : (رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِيرٗا مِّنَ ٱلنَّاسِۖ) “Wahai Rabbku, sungguh mereka telah banyak menyesatkan manusia” ini adalah sebab permintaan kepada Allah, agar dia dijauhkan dari peribadahan kepada berhala, dan sesatnya manusia karena peribadahan mereka terhadap berhala-berhala itu, sehingga mereka tersesat di lembah kesyirikan. (فَمَن تَبِعَنِي) “maka barangsiapa yang mengikutiku” sebagian dari keturunanku (فَإِنَّهُۥ مِنِّيۖ) “maka ia termasuk golonganku.” Dari golongan ajaran dan agamaku. (وَمَنۡ عَصَانِي) “dan barangsiapa yang tidak patuh kepadaku.” Tidak mengikutiku dalam perkara Islam, jika Engkau mengazab mereka, maka mereka pantas akan tersebut, namun jika engkau memaafkan dan tidak mengazab mereka, (فَإِنَّكَ غَفُورٞ رَّحِيمٞ) “maka Engkau adalah Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 36: Dengan penyembahan mereka kepadanya. Dengan mentauhidkan (mengesakan) Allah Ta’ala dan beribadah ikhlas karena-Nya. Yakni termasuk pengikut agamaku. Oleh karena itu, “Sesungguhnya orang yang paling dekat kepada Ibrahim ialah orang-orang yang mengikutinya dan Nabi ini (Muhammad), beserta orang-orang yang beriman (kepada Muhammad), dan Allah adalah pelindung semua orang-orang yang beriman.” (terj. Ali Imran: 68) Menurut penyusun tafsir Al Jalaalain, bahwa ucapan Beliau itu sebelum Beliau mengetahui bahwa Allah Ta’ala tidak mengampuni dosa syirk. Namun demikian, hal ini menunjukkan rasa kasihan yang tinggi dari khalilullah Ibrahim ‘alaihish shalaatu was salam, di mana Beliau mendoakan orang yang bermaksiat agar diberi ampunan dan rahmat Allah, dan Allah Ta’ala lebih kasihan lagi kepada hamba-hamba-Nya karena Dia Arhamurraahimin (Yang Maha Penyayang di antara yang memiliki rasa sayang), oleh karenanya Dia tidaklah mengazab kecuali orang yang memang terus menerus berbuat maksiat lagi congkak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 36",
    "description": "Ya tuhan, aku tahu berhala-berhala itu telah menyesatkan banyak manusia akibat kebodohan mereka. Karena itu, barang siapa mengikutiku dan tidak menyembah berhala-berhala tersebut, maka orang itu termasuk golonganku, dan barang siapa mendurhakaiku dan menyembah berhala-berhala itu, maka hukumlah mereka. Akan tetapi, bila engkau ampuni mereka, maka engkau adalah tuhan yang maha pengampun, maha penyayang kepada hamba-hamba-Nya yang mau bertobat. Ya tuhan, sesungguhnya aku telah menempatkan sebagian keturunanku di mekah, lembah yang tak berpenghuni dan tidak mempunyai tanamtanaman, di lokasi yang dekat dengan rumah engkau (baitullah) yang dihormati. Ya tuhan, aku tempatkan mereka di sana agar mereka melaksanakan salat. Maka, aku mohon ya Allah, jadikanlah hati sebagian manusia cenderung kepada mereka, dan berilah mereka rezeki dari buah-buahan, mudah-Mudahan dengan anugerah-Mu itu mereka selalu bersyukur kepada-Mu."
  }
]