[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami, sesungguhnya aku telah menempatkan keturunanku untuk tinggal di lembah yang tidak ada padanya tanaman dan air yang berada bersebelahan dengan rumahMu yang disucikan. wahai tuhan kami, sesungguhnya aku melakukan hal itu berdasarkan perintahMu, agar mereka mengerjakan shalat sesuai dengan aturan-aturannya, maka jadikanlah hati sebagian hambaMu tertarik dan merindukan mereka. Dan berilah rizki mereka di tempat ini dari berbagai jenis buah-buahan;supaya mereka bersyukur kepadaMu atas kenikmatan besar dariMu.” Maka Allah mengabulkan dooanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Ya Rabbana! Sesungguhnya aku meninggalkan sebagian anak keturunanku, Ismail dan anak-anaknya di suatu lembah, yaitu Makkah, yang tidak mempunyai tanaman dan air di sisi Bait-Mu al-Haram. Rabbana! Aku meninggalkan mereka di sana agar mereka menegakkan salat di sana. Ya Rabb! Buatlah hati manusia mengasihi mereka dan merindukan negeri ini. Berilah mereka rezeki dari buah-buahan dengan harapan mereka akan bersyukur atas nikmat-Mu kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Ya Tuhan kami, aku menempatkan anakku Ismail dan istriku Hajar di lembah yang tidak terdapat tanamannya, di sebelah rumah-Mu Baitul Haram -yakni Ka’bah dan sekitarnya-. Ya Tuhanku, hal ini agar mereka menyembah-Mu dan mendirikan shalat di lembah yang diberkati ini; maka jadikanlah hati sebagian manusia sangat merindukan dan mencintai mereka, dan berilah mereka rezeki dari berbagai jenis buah-buahan yang dapat menjadi sebab kehidupan manusia di sana, sehingga mereka dapat menyembah-Mu dan bersyukur kepada-Mu atas segala kenikmatan dan karunia-Mu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. رَّبَّنَآ إِنِّىٓ أَسْكَنتُ مِن ذُرِّيَّتِى (Ya Tuhan kami, sesungguhnya aku telah menempatkan sebahagian keturunanku) Yakni Ismail dan anaknya. بِوَادٍ غَيْرِ ذِى زَرْعٍ(di lembah yang tidak mempunyai tanam-tanaman) Yakni yang tidak menumbuhkan tanaman, yaitu lembah negeri Makkah al-Mukarramah yang dimuliakan Allah. عِندَ بَيْتِكَ الْمُحَرَّمِ(di dekat rumah Engkau (Baitullah) yang dihormati) Terdapat pendapat mengatakan yang dimaksud dengan (المحرم) yakni diharamkan bagi orang-orang yang sewenang-wenang dan diharamkan dari pelecehan dan penghinaan terhadap kehormatannya. رَبَّنَا لِيُقِيمُوا۟ الصَّلَوٰةَ(ya Tuhan kami (yang demikian itu) agar mereka mendirikan shalat) Yakni aku menempatkan mereka di samping Masjidil Haram agar mereka mendirikan shalat disana. وَارْزُقْهُم مِّنَ الثَّمَرٰتِ (dan beri rezekilah mereka dari buah-buahan) Yang dihasilkan oleh tanah Makkah atau yang didatangkan dari segala penjuru dunia. لَعَلَّهُمْ يَشْكُرُونَ(mudah-mudahan mereka bersyukur) Atas segala kenikmatan yang Engkau karuniakan kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ambilah hati orang-orang ketika kamu mengajak mereka kepada kebaikan, karena jika hati telah cenderung maka jasadnyapun akan ikut; olehkarena itu bukannya dari orang beriman jika hatinya tidak ada rasa cinta kepada kakbah. 2 ). Jka kamu melihat gerombolan orang-orang dari penjuru dunia yang terus berdatangan ke baitullah al-harom, bagimana mereka mengorbankan harta yang banyak, berapa tahun mereka menunggu sampai gilirannya tiba agar ia bisa sampai ke tempat itu? semua kerinduan mereka diikuti oleh hati yang telah jatuh cinta kepada pemilik rumah itu, hati-hati mereka telah terpaku oleh firman Allah : { فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ }. 3 ). Perhatkan ayat ini : { فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ } \"maka jadikanlah hati sebagian manusia cenderung kepada mereka\" Ibrahim tidak mengatakan : jadikanlah sebgian manusia datang kepada mereka; karena sesungguhnya dengan sekedar datang tujuan tidak dapat terwujudkan dengan baik, bahkan hal yang sebaliknya akan terjadi, namun jika hati yang telah cenderung, maka jasad akan mengikut kepadanya, dan tercapailah rasa cinta yang sebelumnya mreka impikan. 4 ). Diantara keagungan petunjuk dari doa Ibrahim untuk penduduk al-harom adalah : { وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ } \"dan beri rezekilah mereka dari buah-buahan, mudah-mudahan mereka bersyukur\" bahwasanya jika saja orang-orang mengetahui mereka akan menemukan kesulitan dalam mencari rezeki di tanah harom; tidaklah mereka akan rindu kepada tempat ini, sekalipun mereka datang namun ketertarikannya untuk menetap akan berkurang dikarenakan kurangnya sumber pangan di daerah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Wahai Tuhanku, sesungguhnya aku menempatkan Ismail dan Ibunya, Hajar di lembah yang tidak ada timbuhan di sana, yaitu lembah Mekah di sisi rumahMu Ka’bah yang mana pandangan remeh tentangnya diharamkan, begitu juga pelanggaran. Aku menempatkan mereka disana dan aku berdoa kepadamu supaya mereka mendirikan shalat di sana. Jadikanlah hati manusia condong kepada mereka, dan bergegas kepada mereka karena rindu dan cinta. Dan berilah mereka rejeki berupa buah-buahan yang beragam dengan menumbuhkannya dan mengirimnya, supaya mereka mensyukuri nikmat yang engkau berikan kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhan kami, sesungguhnya aku telah menempatkan sebagian keturunanku} sebagian keturunanku {di lembah yang tidak ada tanamannya} tidak ada tanaman di dalamnya {di sisi rumahMu yang dihormati. Ya Tuhan kami, agar mereka mendirikan shalat. Maka jadikanlah hati sebagian manusia cenderung kepada mereka} membuat rindu dan terpikat untuk mengunjungi tempat ini {dan anugerahkanlah kepada mereka rezeki dari buah-buahan agar mereka bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Ya Rabb kami, sesungguhnya aku telah menempatkan sebagian keturunanku di lembah yang tidak mempunyai tanam-tanaman di dekat rumah Engkau (Baitullah) yang dihormati”, kisahnya, beliau membawa Hajar, ibu Isma’il bersama putranya, Isma’il saat masih dalam masa susuan dari wilayah Syam hingga menempatkannya di Makkah. Pada waktu itu, kota Makkah tidak berpenghuni, tiada orang yang memanggil yang menjawab. Ketika Ibrahim menaruh mereka di sana, maka beliau memanjatkan doa ini. Beliau memohon dengan ketundukkan lagi tawakkal kepadaNya, wahai Rabbku, “sesungguhnya aku telah menempatan sebagian keturunanku”, tidak semua keturunanku. Karena Ishaq masih berada di negeri Syam. Demikian pula anak-anaknya yang lain. Beliau hanya menempatan Isma’il dan keturunannya di kota Makkah. FirmanNya, “di lembah yang tidak mempunyai tanam-tanaman”, karena tanah kota Makkah tidak cocok untuk lahan pertanian. “Ya Rabb kami (yang demikian itu) agar mereka mendiirikan shalat”, maksudnya jadikanlah mereka orang-orang yang bertauhid lagi mendirikan shalat. Sebab menegakkan shalat termasuk ibadah agama yang paling istimewa lagi utama. Siapa saja yang menegakannya, maka sungguh dia telah menegakkan Agamanya. “Maka jadikanlah hati sebagian manusia cenderung kepada mereka”, maksudnya mencintai mereka dan menyenangi tempat yang mereka huni. Allah mengabulkan doa beliau. Allah melahirkan Muhammad dari keturunan Isma’il yang mengajak umat keturunan beliau kepada agama Islam dan ajaran agama Ibrahim. Mereka pun menyambut dakwah Nabi Muhammad dan menjadi orang-orang yang menegakkan shalat. Dan Allah mewajibkan berhaji ke Baitullah yang mana Ibrahim telah menempatkan (sebagian) keturunannya di dalamnya, dan menciptakan rahasia yang menakjubkan di sana, memikat kalbu-kalbu (manusia). Keturunan-keturunan beliau senantiasa berangkat haji ke sana tanpa pernah menghapusan niatan ini. Bahkan, semakin sering seorang hamba bolak-balik ke sana, semakin tinggi rasa kerinduan dan semakin besar kecintaan dan hasrat untuk ke sana. Inilah rahasia kenapa lafazh “bait (rumah)” dinisbatkan kepada DzatNya yang suci (menjadi rumah Allah). “Dan berilah mereka rizki dari buah-buahan, mudah-mudahan mereka bersukur”, Allah mengabulkan doa nabi Ibrahim. Maka berubahlah keadaan, berbagai buah-buahan didatangkan ke sana. Engkau dapat melihat kota Makkah setiap saat, dalam keadaan dipenuhi bermacam-macam buah yang melimpah dan rizki datang silih berganti dari segala penjuru."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مِن ذُرِّيَّتِي) min dzurriyyatii : “dari keluargaku.” Dari sebagian keluargaku, yaitu Ismail ‘alaihis salam dan ibunya Hajar. (بِوَادٍ غَيۡرِ ذِي زَرۡعٍ) bi waadin ghairi dzii zar’in : “di sebuah lembah yang tidak memiliki pepohonan.” Mekah, karena kala itu tidak ada tetumbuhan di sekitarnya. (تَهۡوِيٓ إِلَيۡهِمۡ) tahwii ilaihim : “rindu kepada mereka” merasa kengen dan selalu ingin melaksanakan haji dan umrah. Makna ayat : Firman-Nya : (رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي) “Wahai Rabb kami, sungguh aku telah meninggalkan sebagian dari keluargaku” yaitu: sebagian dari keturunanku, Ismail bersama ibunda beliau Hajar (بِوَادٍ غَيۡرِ ذِي زَرۡعٍ) “di sebuah lembah yang tidak memiliki tetumbuhan” yaitu Mekah, karena kala itu tidak ada di sana atau sekitarnya tetumbuhan untuk waktu yang sangat lama (عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ) “di sisi rumah-Mu yang mulia.” Ia mengatakan hal ini berdasarkan pemberitahuan dari Allah ta’ala bahwa suatu saat di sana akan ada rumah milik-Nya, di lembah ini. Dan makna muharram adalah, Allah ta’ala telah mengharamkan kota Mekah untuk diburu hewan yang ada di sana, tidak dicabut rumputnya, dan tidak boleh mengalirkan dara di dalamnya, begitu juga membunuh. Firman-Nya : (رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡ‍ِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ) “Wahai Rabb kami, agar mereka menegakkan salat, dan jadikanlah hati manusia tertuju kepada mereka.” ini adalah do’a agar Allah ta’ala memudahkan kehidupan penduduk Mekah , agar mereka menyembah Allah ta’ala di dalamnya dengan mendirikan salat. Hati manusia ketika ia rindu akan kota Mekah dan ingin melakukan haji atau umrah, maka ini akan menjadi sebab datangnya rezeki dan kebaikan untuk kota Mekah. Firman-Nya : (وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ) “dan berilah mereka rizki berupa buah-buahan, agar mereka bersyukur.” Do’a yang lain, agar Allah memberikan mereka rizki kepada keturunannya berupa buah-buahan, agar mereka bersyukur kepada Allah ta’ala atas hal tersebut. Oleh karena itu, adanya rezeki dan buah-buahan adalah sebab yang mewajibkan untuk bersyukur, karena kenikmatan melazimkan syukur. Pelajaran dari ayat : • Ikatan iman dan tauhid lebih kuat dari ikatan rahim dan nasab. • Urgensi salat, dan barangsiapa enggan melaksanakan salat, ia tidak berhak mendapatkan bagian, dan dibunuh jika ia terus menerus melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 37: Nabi Ibrahim ‘alaihis salam datang dari Syam membawa Hajar dan anaknya yang masih menyusui, yaitu Isma’il, lalu menempatkan keduanya di Mekah. Tidak semuanya, karena Ishaq dan keturunannya tinggal di Syam. Yaitu Mekah, karena tanah Mekah tidak cocok untuk ditanami. Yakni jadikanlah mereka mentauhidkan Engkau dan mendirikan shalat, karena shalat adalah ibadah yang paling utama, barang siapa yang mendirikannya, sama saja mendirikan agamanya. Allah mengabulkan doa Beliau, Allah keluarkan dari keturunannya Nabi Muhammad shallallahu 'alaihi wa sallam, ia mengajak keturunan Nabi Ibrahim kepada agama Islam; agama bapak mereka, mereka pun memenuhinya dan menjadi orang-orang yang mendirikan shalat. Yakni cinta. Dan cinta kepada tempat tersebut. Ibnu Abbas radhiyallahu 'anhuma berkata, “Jika Beliau mengatakan, “hati manusia” (tidak menyebut sebagian), tentu akan cenderung (cinta) kepadanya bangsa Persia, bangsa Romawi dan semua manusia.” Akan tetapi ia berkata, “sebagian manusia,” sehingga hanya khusus kaum muslimin saja. Allah juga mengabulkan doa Beliau. Kita dapat melihat di Mekah berbagai macam buah-buahan ada di sana di setiap waktu, rezeki pun datang kepadanya dari berbagai penjuru."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 37",
    "description": "Ya tuhan, sesungguhnya aku telah menempatkan sebagian keturunanku di mekah, lembah yang tak berpenghuni dan tidak mempunyai tanamtanaman, di lokasi yang dekat dengan rumah engkau (baitullah) yang dihormati. Ya tuhan, aku tempatkan mereka di sana agar mereka melaksanakan salat. Maka, aku mohon ya Allah, jadikanlah hati sebagian manusia cenderung kepada mereka, dan berilah mereka rezeki dari buah-buahan, mudah-Mudahan dengan anugerah-Mu itu mereka selalu bersyukur kepada-Mu. Ya tuhan kami, penolong kami, sesungguhnya engkau mengetahui apa yang kami sembunyikan dalam hati kami dan apa yang kami tampakkan dalam bentuk perbuatan; dan kami yakin tidak ada sesuatu pun yang tersembunyi bagi-Mu, ya Allah, baik yang ada di bumi maupun yang ada di langit."
  }
]