[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim menyanjung Allah dengan bekata, ”segala puji bagi Allah yang telah memberikan anugerah anak kepadaku yang pada usiaku yang telah lanjut, yaitu ismail dan ishaq, setelah aku berdoa kepadaNya supaya berkenaan memberiku keturunan dari orang-orang yang shalih. Sesungguhnya tuhanku benar-benar maha mendengar doa dari orang yang berdoa kepadaNya. Dan sesungguhnya aku telah memohon kepadaNya dan Dia tidak menggagalkan harapanku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Puji syukur dan sanjungan sempurna hanya milik Allah -Subḥānahu- yang menjawab doaku agar memberiku anak keturunan yang saleh. Allah memberiku dalam usia tua Ismail dari Hajar dan Isḥāq dari Sarah. Sesungguhnya Rabbku Maha mendengar doa siapa yang berdoa kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Pujian yang agung semuanya hanya bagi Allah yang telah memberiku dua anak, Ismail dan Ishaq meski aku telah tua. Sungguh Penciptaku dan Pengatur urusanku Maha Mendengar doa dan mengabulkan hamba-hamba-Nya yang berdoa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. الْحَمْدُ لِلّٰهِ الَّذِى وَهَبَ لِى عَلَى الْكِبَرِ إِسْمٰعِيلَ وَإِسْحٰقَ (Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tua(ku) Ismail dan Ishaq) Yakni yang telah mengaruniakanku anak padahal umurku dan umur istriku telah lanjut. Terdapat riwayat mengatakan bahwa ia dikaruniai Ismail ketika berumur 99 tahun, dan dikaruniai Ishaq ketika berumur 112 tahun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Rasa syukur dan pujian tercurahkan bagi Allah yang memberiku rejeki di masa tua dengan memberi dua anak yaitu Ismail dan Ishaq. Sesungguhnya Tuhanku Maha Mendengar doa yang dipanjatkan dengan benar, ikhlas, dan penuh keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tua Ismail dan Ishaq. Sesungguhnya Tuhanku benar-benar Maha Mendengar doa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Berikutnya, beliau mendoakan kebaikan bagi dirinya dan keturunannya, dengan berkata, “Segala puji bagi Allah yang telah meganugerahkan kepadaku di hari tua (ku) Ismail dan Ishaq”, karunia dalam bentuk mereka adalah termasuk kenikmatan yang paling besar. Kelahiran mereka di usia tua beliau dalam kondisi yang sudah tiada harapan lagi untuk mendapatkan anak keturunan merupakan kenikmatan agung yang lain. Dan status mereka sebagai para Nabi yang shalih adalah kenikmatan yang paling besar lagi utama. “Sesungguhnya Rabbku, benar-benar Maha Mendengar (memperkenankan) doaku”, maksudnya, sangat dekat pengabulanNya dari orang yang berdoa kepadaNya. Aku telah berdoa kepadaNya, namun Dia tidak pernah memupuskan harapanku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ) ‘alal kibari ismaa’iila wa ishaaq : “memberikan di masa tuaku, Ismail dan Ishaq.” Karena lanjut usia, karena saat itu umurnya adalah 99 tahun dan Ishaq lahir pada umurnya yang ke 112 tahun. Makna ayat : Firman-Nya : (ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي وَهَبَ لِي عَلَى ٱلۡكِبَرِ إِسۡمَٰعِيلَ وَإِسۡحَٰقَۚ إِنَّ رَبِّي لَسَمِيعُ ٱلدُّعَآءِ) “Segala puji bagi Allah, yang telah memberikan kepadaku di masa tuaku Ismail dan Ishaq. Sungguh Rabbku Maha Mendengar permohonan.” Beliau memuji Allah dan bersyukur kepada-Nya atas apa yang telah Dia berikan, sebagaimana Dia telah memberikan Ismail dan Ishaq di masa tuanya, dan pengakuan bahwa Allah ta’ala adalah Yang Maha Mendengar permohonan siapapun yang memohon dan kembali kepada-Nya. Pelajaran dari ayat : • Penjelasan terkabulnya doa dan permintaan Ibrahim ‘alaihis salam kepada Rabbnya. • Kewajiban memuji Allah ta’ala, dan bersyukur atas nikmat-nikmat yang Dia berikan kepada hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 39: Isma’il lahir pada saat usia Beliau 99 tahun, sedangkan Ishaq lahir pada saat usia Beliau 112 tahun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 39",
    "description": "Menyelingi doanya, nabi ibrahim memuji Allah seraya berkata, segala puji bagi Allah yang telah menganugerahkan kepadaku nikmat yang sangat banyak dan besar di hari tua-ku berupa dua putra, ismail dan ishak. Sungguh, tuhanku benar-benar maha mendengar dan mengabulkan doa yang dipanjatkan kepada-Nya dengan tulus. Nabi ibrahim melanjutkan doanya, ya tuhanku yang maha pemurah, jadikanlah aku dan anak cucuku sebagai orang yang secara tetap dan konsisten melaksanakan dan mendirikan salat, ya tuhan kami, perkenankanlah doaku kepada-Mu."
  }
]