[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mengutus seorang rasul sebelummu -wahai nabi-, kecuali(berbicara) dengan Bahasa kaumnya, untuk menjelaskan kepada mereka syariat Allah. Kemudian Allah menyesatkan dari jalan hidayah orang yang dikehendakiNya, dan menujuki orang yang Dia dikehendaki menuju kebenaran. Dia Maha perkasa dalam kerajaanNya, lagi mahabijakasana yang telah meletakan perkara-perkara pada tempatnya yang tepat sesuai dengan sifat dan hikmahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kami tidak mengutus seorang Rasul kecuali Kami mengutusnya dengan berbicara memakai bahasa kaumnya agar mudah bagi mereka memahami apa yang dia bawa dari Allah, Kami tidak mengutusnya untuk memaksa manusia agar beriman kepada Allah. Allah yang menyesatkan siapa yang Dia kehendaki dengan keadilan dan memberi hidayah siapa yang Dia kehendaki dengan karunia-Nya. Allah Maha Perkasa yang tidak dikalahkan oleh siapa pun, Maha Bijaksana dalam penciptaan dan pengaturan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dan Kami tidak mengutus seorang rasul melainkan dengan bahasa kaumnya, agar dia dapat menjelaskan syariat dan hukum-hukum Allah. Kemudian Allah akan menyesatkan hamba-Nya yang Dia kehendaki dari hidayah, dan memberi petunjuk bagi hamba-Nya yang Dia kehendaki menuju kebenaran. Dia Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur segala urusan hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمَآ أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِۦ (Kami tidak mengutus seorang rasulpun, melainkan dengan bahasa kaumnya) Yakni berbicara dengan bahasa mereka, agar mereka paham apa yang ia katakan. Andai saja berbicara dengan selain bahasa mereka maka mereka tidak akan memahami perkataannya. لِيُبَيِّنَ لَهُمْ ۖ( supaya ia dapat memberi penjelasan dengan terang kepada mereka) Menjelaskan syariat yang Allah perintahkan untuk mereka kerjakan. Kemudian mereka menjelaskannya kepada orang yang berbicara dengan bahasa lain hingga ia paham sebagaimana pemahaman mereka. فَيُضِلُّ اللهُ(Maka Allah menyesatkan) Yakni rasul yang menjelaskan kepada kaumnya syariat Allah dengan bahasa mereka tidak dapat memberi hidayah kepada salah seorang dari kaum tersebut, sebab yang menyesatkan dan yang memberi hidayah adalah Allah. Dan bisa juga makna ayat ini adalah bahwa Allah menyesatkan orang-orang kafir yang Dia kehendaki yang mengatakan “Muhammad adalah orang yang berbicara dengan bahasa kita, dan dia termasuk dari kaum kita, lalu dari mana ia mendapatkan kenabian ini?”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ } \"Kami tidak mengutus seorang rasulpun, melainkan dengan bahasa kaumnya, supaya ia dapat memberi penjelasan dengan terang kepada mereka\" Syaikh Ibnu 'Utsaimin pernah berkata : \"mempelajari bahasa Arab yang dengannya kita mendakwahkan islam adalah fardhu kifayah, sebagaimana kewajiban berdakwah mengajak kepada islam adalah fardhu kifayah, oleh karena itu jika sekarang saya berbicara di tengah-tengah puluhan orang dar luar Arab dan saya berbicara kepada dengan bahasa Arab yang begitu fasih apa yang akan mereka faham? tentu tdak ada keculi bagi mereka yang faham dengan bahasa ini\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kami tidak mengutus seorang rasulpun kepada umat terdahulu, melainkan dengan bahasa kaumnya, supaya ia dapat memberi penjelasan ats syariat Allah dengan terang kepada kaumnya. Maka Allah menyesatkan siapa yang Dia kehendaki, dan memberi petunjuk kepada siapa yang Dia kehendaki. Dialah Tuhan Yang Maha Kuasa dalam kerajaan-Nya lagi Maha Bijaksana dalam segala perbuatan-Nya. Tidak ada pemberian petunjuk maupun penyesatan kecuali di situ untuk tujuan hikmah, dan dua perlakuan itu bukan semata-mata sebuah hal ketetapan cuma-cuma, namun kesesatan disebabkan oleh perilaku kufur dan membangkang, adapun pemberian petunjuk adalah sebab taufik dan penjagaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak mengutus seorang rasul, kecuali dengan lisan} bahasa {kaumnya, agar dia dapat memberi penjelasan kepada mereka. Maka Allah menyesatkan siapa saja yang Dia kehendaki, dan memberi petunjuk kepada siapa saja yang Dia kehendaki. Dia Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Ini adalah salah satu bentuk sifat kelembutan Allah kepada hamba-hambaNya, yaitu Allah tidak mengutus seorang rasul pun melainkan dengan bahasa kaumnya, untuk menjelaskan kepada mereka tentang hal-hal yang mereka butuhkan, dan membuat mereka mampu mempelajari risalah yang dia bawa. Berbeda halnya, bila datang bukan dengan bahasa (komunikasi) mereka, maka tentu mereka akan memerlukan proses pembelajaran bahasa yang dipakainya dalam berkomunikasi, baru kemudian bisa memahaminya. Jika rasul tersebut telah menjelaskan (bagi mereka) tentang perintah dan larangan yang terarah kepada mereka, dan sudah tegak hujjah Allah di hadapan mereka “maka Allah menyesatkan siapa yang Dia kehendaki”, dari orang-orang yang Allah istimewakan dengan rahmatNya “dan Dia-lah Rabb Yang Mahaperkasa lagi Mahabijaksana,” yang mana termasuk dari keperkasaan Allah, bahwa Dia-lah Dzat satu-satunya yang memiliki kekuasaan memberi hidayah dan menyesatkan serta membolak-balikkan hati kepada kondisi yang Dia kehendaki. Termasuk dari hikmahNya adalah, Dia tidak menempatkan hidayah dan ketetapan sesatNya kecuali pada tempat yang pantas. Ayat yang mulia ini bisa dijadikan sebagai dalil, bahwa (mempelajari)ilmu-ilmu bahasa Arab yang akan membantu menjelaskan Firman Allah dan ucapan RasulNYa merupakan tuntutan dan perkara yang disukai Allah. Sebab pengetahuan tentang wahyu yang Allah turunkan kepada RasulNya hanya tercapai dengannya, kecuali bila orang-orang dalam kondisi tidak membutuhkannya. Hal itu bisa diwujudkan apabila mereka telah terlatih dengan bahasa Arab, dan anak-anak mereka tumbuh dengannya serta sudah menjadi kebiasaan mereka. Saat itulah, mereka telah menuntaskan masalah dan layak bisa langsung menerima dari Allah dan RasulNya, sebagaimana yang dilakukan para sahabat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya dalam ayat (4) sebagai berikut : (وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ) “Tidaklah Kami mengutus seorang rasul kecuali dengan lisan (bahasa) kaumnya” yaitu dengan bahasa mereka yang dengannya mereka berbicara dan memahami hikmah yang akan disampaikan, dan Allah—setelah itu semua—menyesatkan siapa pun yang Dia kehendaki sesuai dengan ketentuan-Nya dan memberi petunjuk bagi yang Dia kehendaki (وَهُوَ ٱلۡعَزِيزُ) “Dialah Yang Maha Perkasa” Yang Maha Menguasai yang tidak ada yang mampu menghalangi-Nya dari sesuatupun yang Dia inginkan, (ٱلۡحَكِيمُ) “Yang Maha Bijaksana.” Yang meletakkan segala sesuatu pada tempatnya, oleh karena itu Dia tidak menyesatkan kecuali mereka yang condong, mencintai, dan suka akan kesesatan, mengingkari petunjuk, memerangi orang-orang yang beriman dan para penyeru hidayah. Dan bukan dari hikmah-Nya menyesatkan mereka yang meminta petunjuk dan berusaha meraihnya, konsisten di atas jalannya, mencintai hidayah dan orang-orang yang mendapat petunjuk. Pelajaran dari ayat : • Penjelasan hikmah dari pengutusan Allah ta’la para rasul dengan bahasa kaum mereka. • Penegasan bahwa yang menciptakan hidayah adalah Allah, adapun hamba tidak lebih baginya kecuali berusaha."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 4: Al Quran diturunkan dalam bahasa Arab itu, bukanlah berarti bahwa Al Qu'an untuk bangsa Arab saja tetapi untuk seluruh manusia. Yakni untuk memahamkan mereka apa yang dibawanya. Yakni mereka yang tidak mau mengikuti petunjuk. Di antara contoh keperkasaan-Nya adalah bahwa Dia sendiri yang memberi petunjuk dan menyesatkan manusia dan Dia pula yang membolak-balikkan hati mereka. Di antara contoh kebijaksanaan-Nya adalah, bahwa Dia tidak meletakkan hidayah dan menyesatkan kecuali kepada orang yang tepat dan layak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 4",
    "description": "Dan ketahuilah bahwa kami tidak pernah mengutus seorang rasul pun kepada umat manusia, melainkan dengan bahasa yang dipergunakan oleh kaumnya. Yang demikian itu bertujuan agar dia dapat memberi penjelasan tentang syariat Allah dengan baik kepada mereka. Maka setelah rasul itu memberi penjelasan, Allah menyesatkan'membiarkan sesat' siapa yang dia kehendaki dari hamba-Nya yang memang memilih jalan kesesatan, dan memberi petunjuk kepada siapa yang dia kehendaki dari hamba-Nya yang memilih jalan yang lurus. Dia adalah tuhan yang mahaperkasa lagi mahabijaksana. Di antara para rasul yang kami utus itu adalah nabi musa. Dan sungguh, kami telah mengutus nabi musa kepada bani israil dengan membawa tanda-tanda kami, yakni berbagai mukjizat yang membuktikan kebenarannya, dan kami perintahkan kepadanya, wahai nabi musa, keluarkanlah kaummu dari kegelapan (penindasan firaun) kepada cahaya terang-benderang (pengesaan kepada Allah) dan ingatkanlah mereka kepada hari-hari ketika Allah menurunkan nikmat dan azab-Nya kepada mereka. Sungguh, pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi setiap orang penyabar atas ketentuan Allah dan banyak bersyukur atas nikmat-Nya."
  }
]