[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhanku, jadikanlah aku orang yang senantiasa tekun menjalankan shalat dengan cara sebaik-baiknya, dan jadikanlah dari keturunanku orang yang menjaga pelaksanaannya. Wahai tuhan kami kabulkanlah doaku dan terimah ibadahku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Ya Rabb! Jadikanlah aku orang yang menegakkan salat dengan sebaik-baiknya, jadikanlah anak keturunanku menegakkannya dengan sebaik-baiknya. Ya Rabbana! Kabulkanlah doaku dan terimalah ia di sisi-Mu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Ya Tuhanku, jadikanlah aku dan keturunanku orang-orang yang senantiasa menjaga shalat. Ya Tuhanku kabulkanlah doaku dan terimalah ibadahku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَمِن ذُرِّيَّتِى ۚ (dan anak cucuku) Yakni jadikanlah aku dan sebagian keturunanku orang-orang yang senantiasa mendirikan shalat. Nabi Ibrahim mengetahui bahwa sebagian dari keturunannya terdapat orang yang tidak menegakkan shalat sebagaimana seharusnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Wahai Tuhanku, Jadikanlah aku rajin dalam shalat, dan jadikanlah keturunanku sebagai orang yang melaksanakan shalat dengan sempurna. Wahai Tuhanku terimalah doa dan permohonanku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ya Tuhanku, jadikanlah aku orang yang tetap mendirikan shalat dan sebagian anak cucuku} dan jadikan sebagian dari keturunanku orang yang mendirikan shalat {Ya Tuhan kami, perkenankanlah doaku} perkenankanlah doaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. Kemudian beliau mendoakan kebaikan bagi dirinya dan keturunanya dengan berkata, “Ya Rabbku, jadikanlah aku dan anak cucuku orang-orang yang tetap mendirikan shalat, ya Rabb kami, perkenankan doaku. Ya Rabb kami, beri ampunlah aku dan kedua ibu bapakku dan sekalian orang-orang Mukmin pada hari terjadinya hisab (hari kiamat)”, Allah menyambut seluruh permohonan beliau kecuali doa (permohonan ampunan) bagi ayahnya yang mana beliau panjatkan sekedar hanya untuk pemenuhan janji yang beliau sampaikan kepada ayahnya. Ketika telah jelas bahwa dia adalah musuh Allah, maka dia berlepas diri darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (رَبِّ ٱجۡعَلۡنِي مُقِيمَ ٱلصَّلَوٰةِ وَمِن ذُرِّيَّتِيۚ) “Wahai Rabbku, jadikanlah aku orang yang mendirikan salat dan kelurgaku” juga menunaikan salat, karena salat adalah sebab seluruh kehidupan. Ia adalah dzikir dan syukur, maka jika seorang hamba mendirikan salat dengan menunaikan syarat-syarat dan rukun-rukunnya secara sempurna, maka ia termasuk orang-orang yang berdzikir dan bersyukur, dan ketika ia meninggalkannya ia termasuk orang-orang yang lupa dan lalai dan juga termasuk dari orang-orang yang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 40: Nabi Ibrahim menggunakan kata “min dzurriyyati” (sebagian dari keturunanku) karena Allah Ta’ala memberitahukan kepadanya, bahwa di antara mereka ada yang kafir, demikian menurut penyusun tafsir Al Jalaalain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 40",
    "description": "Nabi ibrahim melanjutkan doanya, ya tuhanku yang maha pemurah, jadikanlah aku dan anak cucuku sebagai orang yang secara tetap dan konsisten melaksanakan dan mendirikan salat, ya tuhan kami, perkenankanlah doaku kepada-Mu. Ya tuhan kami, ampunilah aku dan kedua ibu bapakku dan ampunilah pula semua orang yang beriman, karena kami semua kelak akan mempertanggungjawabkan segala perbuatan pada hari diadakan perhitungan di hari mahsyar."
  }
]