[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai tuhan kami, ampunilah aku atas apa yang terjadi padaku dari hal-hal yang manusia tidak lepas darinya, dan ampunilah kedua orangtuaku (dan doa ini dia ucapkan sebelum jelas baginya bahwa ayahnya adalah musuh Allah) dan ampunilah orang-orang mukmin semuanya pada hari manusia berdiri untuk menghadapi perhitungan amal dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Rabbana! Ampunilah dosa-dosaku, ampunilah dosa-dosa bapakku (Ibrahim mengucapkannya sebelum dia mengetahui bahwa bapaknya adalah musuh Allah, manakala dia mengetahuinya, maka dia berlepas diri darinya) Ampunilah dosa orang-orang Mukmin pada hari di mana manusia bangkit kepada Rabb mereka untuk menghadapi hisab.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Ya Tuhanku, ampunilah kelalaianku dan ampuni kedua orangtuaku serta orang-orang yang beriman kepada-Mu, rasul-rasul-Mu, dan kepada hari manusia dihisab atas amal perbuatan yang telah mereka lakukan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. رَبَّنَا اغْفِرْ لِى وَلِوٰلِدَىَّ (Ya Tuhan kami, beri ampunlah aku dan kedua ibu bapaku) Nabi Ibrahim menohon kepada Allah agar mengampuni kedua orang tuanya. Terdapat pendapat mengatakan bahwa ia memohonkan ampun bagi keduanya ketika ia belum mengetahui bahwa ayahnya adalah musuh Allah, dan setelah ia mengetahuinya kemudian ia berhenti dari permohonan itu. وَلِلْمُؤْمِنِينَ(dan sekalian orang-orang mukmin) Nabi Ibrahim mengkhususkan orang-orang beriman dengan permohonan ampunan bagi mereka karena hal ini tidak boleh dilakukan bagi orang-orang kafir. يَوْمَ يَقُومُ الْحِسَابُ(pada hari terjadinya hisab) Yakni hari ditegakkannya perhitungan di padang mahsyar atas orang-orang yang dibebani syariat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Wahai Tuhanku ampunilah aku dalam setiap kelalaianku kepadamu, ampunilah juga orang tuaku (ini sebelum dia mengetahui permusuhan keduanya terhadap Allah) pada hari terjadinya hisab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ya Tuhan kami, ampunilah aku, kedua orang tuaku, dan orang-orang mukmin pada hari diadakan perhitungan} hari manusia berdiri untuk dihisab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40-41. Kemudian beliau mendoakan kebaikan bagi dirinya dan keturunanya dengan berkata, “Ya Rabbku, jadikanlah aku dan anak cucuku orang-orang yang tetap mendirikan shalat, ya Rabb kami, perkenankan doaku. Ya Rabb kami, beri ampunlah aku dan kedua ibu bapakku dan sekalian orang-orang Mukmin pada hari terjadinya hisab (hari kiamat)”, Allah menyambut seluruh permohonan beliau kecuali doa (permohonan ampunan) bagi ayahnya yang mana beliau panjatkan sekedar hanya untuk pemenuhan janji yang beliau sampaikan kepada ayahnya. Ketika telah jelas bahwa dia adalah musuh Allah, maka dia berlepas diri darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلِوَٰلِدَيَّ) wa liwaalidayya : “dan untuk kedua orang tuaku.” Ini sebelum diketahui bahwa ayahnya mati di atas kesyirikan. (يَوۡمَ يَقُومُ ٱلۡحِسَابُ) yauma yaquumul hisaab : “hari ditegakkannya penghitungan.” Hari manusia berdiri untuk penghitungan amal. Makna ayat : Terakhir beliau memohon dengan sangat kepada Rabbnya untuk mengkabulkan doanya dan memohon ampunan kepada Allah untuk dirinya, kedua orang tuanya, dan kaum mukminin pada hari manusia berdiri untuk penghitungan amal kelak hari kiamat nanti. Pelajaran dari ayat : • Disyariatkan istighfar untuk diri sendiri, kaum mukminin, dan mukminat. • Penegasan akidah kebangkitan, penghitungan, dan pembalasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 41: Ucapannya ini pun sebelum jelas bagi Beliau bahwa keduanya termasuk musuh Allah Azza wa Jalla. Namun ada yang mengatakan, bahwa ibunya masuk Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 41",
    "description": "Ya tuhan kami, ampunilah aku dan kedua ibu bapakku dan ampunilah pula semua orang yang beriman, karena kami semua kelak akan mempertanggungjawabkan segala perbuatan pada hari diadakan perhitungan di hari mahsyar. Usai mengisahkan doa-doa nabi ibrahim dalam beberapa ayat sebelumnya, pada ayat-ayat berikut Allah menegaskan betapa dia tidak pernah lengah mengawasi perbuatan orang yang zalim dan durhaka. Dia berfirman, dan janganlah sekali-kali engkau atau siapa pun juga mengira bahwa Allah lengah sehingga lalai atau lupa dari menjatuhkan sanksi atas apa yang diperbuat oleh orang yang zalim. Sesungguhnya Allah hanya sedang menangguhkan hukuman yang akan dijatuhkan-Nya kepada mereka sampai hari yang pada waktu itu mata mereka terbelalak akibat dahsyatnya hari pembalasan itu."
  }
]