[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu wahai rasul, sekali-kali mengira bahwa sesungguhnya Allah lalai terhadap hal-hal yang diperbuat oleh orang-orang yang zhalim, berupa mendustakan dirimu dan rasul-rasul selain kamu, dan melancarkan gangguan terhadap kaum mukmimin dan perbuatan-perbuatan maksiat lainnya. Sesungguhnya siksaan mereka di tangguhkan sampai hari yang dahsyat, yang pada saat itu mata-mata mereka terbelalak keatas dan tidak terpejam, karena keadaan yang amat menakutkan yang mereka saksikan. Disini terkandung hiburan bagi rasulullah Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Jangan menyangka -wahai Rasul- bahwa manakala Allah menunda azab terhadap orang-orang zalim bahwa Allah lalai dari apa yang mereka lakukan berupa pendustaan dan usaha menghalang-halangi dari jalan Allah dan sebagainnya, karena Allah mengetahui hal itu, tidak ada sesuatu pun yang samar bagi Allah, akan tetapi Allah menangguhkan azab atas mereka ke hari Kiamat, hari yang saat itu pandangan mata terbelalak karena takut akan kengerian apa yang disaksikannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Hai Rasulullah, janganlah kamu mengira Allah lalai dari perbuatan orang-orang zalim yang mendustakanmu dan mengganggu orang-orang beriman; sesungguhnya Allah menangguhkan mereka hingga hari yang sangat mengerikan yang menjadikan mata mereka terbelalak karena ketakutan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَلَا تَحْسَبَنَّ اللهَ غٰفِلًا عَمَّا يَعْمَلُ الظّٰلِمُونَ ۚ (Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim) Yakni janganlah kamu mengira bahwa Allah lalai dari penyiksaan terhadap orang-orang zalim ketika kamu melihat mereka dalam kesehatan, keamanan, dan kenikmatan. إِنَّمَا يُؤَخِّرُهُمْ(Sesungguhnya Allah memberi tangguh kepada mereka) Yakni menunda balasan atas kezaliman mereka, sehingga mereka tidak disiksa saat ini juga. لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصٰرُ(sampai hari yang pada waktu itu mata (mereka) terbelalak) Yakni pandangan orang-orang yang ada di padang mahsyar mengarah ke atas karena mereka melihat kengerian di hari itu, mata mereka terbuka dan tidak bergerak akibat besarnya kebingungan dan ketakjuban mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ketika seseorang melihat kepada dunia ini dengan akalnya, ia akan melihat bahwa ada orang yang hidup di dunia dengan kezholimannya dan matipun dalam keadaan berbuat zholim, dan ada juga yang hidup di dunia ini sedangkan dirinya terus ditimpa dengan kezholiman dan ketika ia mati kezholiman itu tetap menimpa dirnya, namun ketahuilah sesungguhnya tuhan yang maha Adil tidak akan tinggal diam membiarkan kezholiman itu terus terjadi, dan tidak akan meninggalkan pelakunya tanpa ada balasan yang setimpal untuknya, dan Dia juga tidak akan membiarkan siapapun yang tertimpa oleh kezholiman itu tanpa menegakkan keadilan untuknya, maka akal ini pun meyakini bahwa semestinya kehidupan lain yang layak sebagai keadilan bagi mereka terzholimi dan hukuman yang yang setimpal bagi mereka yang berbuat zholim : { وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ } \"Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak\". 2 ). Sudah berapa kali kita membaca dan mendengar : { وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ } namun apakah kita sudah merenungkan kandungan ayat ini; untuk melihat dan menyadari sudahkah kita menzholimi seseorang?! Istri kita, anak-anak kita, dan siapapun yang berada di bawah kekuasaan dan tanggung jawab kita? Atau mungkin kita mengira bahwa ayat ini hanya berlaku bagi para pemimpin dan penguasa?! Oleh karena itu berhentilah sejenak untuk mentadabburi ayat yang agung ini, agar kita sadar dan tidak termasuk orang-orang yang mendapatkan peringatan dari Allah karena kezholimannya. 3 ). { إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ } \"Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak\" inikah tempat kembali mereka yang senang berbuat aniaya itu? alangkah buruknya tempat kembali mereka, dan sesungguhnya inilah keadilan Allah 'azzawajallah- ; maka tenanglah wahai jiwa, dan bahagialah wahai hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Wahai Rasul, jangan sampai kamu menganggap bahwa Allah melupakan azab yang pantas bagi orang-orang zalim yang kafir dari penduduk Mekah dan penduduk lainnya karena telah menentang dakwahmu, memfitnahmu dan menolak agamamu. Sesungguhnya Dia (Allah) mengakhirkan balasan dan azab mereka sampai hari dimana penglihatan mereka lenyap dan tidak berada pada tempatnya, karena ketakutan terhadap apa yang dilihat pada hari itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jangan sekali-kali kamu mengira} mengira {bahwa Allah lengah terhadap apa yang dilakukan orang-orang zalim. Sesungguhnya Dia menangguhkan mereka} menangguhkan mereka {sampai hari penglihatan mereka terbelalak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Ini adalah ancaman keras bagi orang-orang yang berbuat aniaya sekaligus sebagai penghibur hati bagi orang-orang yang menjadi obyek penganiayaan. Allah berfirman, “Dan janganlah sekali-kali kamu (Muhammad) mengira bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zhalim”, (fakta menyatakan) Allah masih memberikan kesempatan bagi mereka, dan mencurahan berbagai jenis rizki, serta membiarkan mereka bebas bergerak di negeri-negeri dalam keadaan aman lagi tenang. Hal itu bukan menjadi pertanda baiknya kondisi mereka. Karena Allah sedang menunda waktu dan memberikan kesempatan bagi orang-orang yang berbuat aniaya, agar dosanya semakin menumpuk. Sampai akhirnya, ketika Allah menyiksanya, maka dia tidak dapat berkutik lagi. \"Dan begitulah azab Tuhanmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zalim. Sesungguhnya azab-Nya itu adalah sangat pedih lagi keras.\" (Hud:102) Kezhaliman disini mencakup setiap bentuk kezhaliman antara seorang hamba dengan Rabbnya dan kezhalimannya kepada sesama. “Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak”, maksudnya matanya tidak bergerak sekalipun karena dahsyatnya keadaan yang dia lihat, berupa kengerian-kengerian. Betapa merisaukan malapetaka di sana!"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ) ‘ammaa ya’maluzh zhaalimuun : “atas apa yang dilakukan orang-orang zalim.” Orang-orang musyrik dari Mekah dan selain mereka. (لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ) liyaumin tasykhashu fiihil abshaar : “pada hari terbelalak seluruh pandangan.” Terbuka, tidak berkedip karena beratnya yang mereka lihat berupa kengerian. Makna ayat : Pada penjelasan di atas, terdapat penguatan atas Rasulullah shallahu ‘alaihi wa sallam dan membesarkan kesabaran beliau untuk melanjutkan seruannya menuju Allah ta’ala, hingga Allah menolongnya dan menyebarlah dakwah ini sejauh yang telah ditentukan. Dan hari-hari itu sangat sulit bagi Rasulullah shallahu ‘alaihi wa sallam dan para sahabatnya, karena bertubi-tubinya gangguan kaum musyrikin kepada mereka, serta bertambahnya kezaliman mereka. Maka Allah berfirman kepada Rasul-Nya : (وَلَا تَحۡسَبَنَّ ٱللَّهَ غَٰفِلًا عَمَّا يَعۡمَلُ ٱلظَّٰلِمُونَۚ) “Janganlah engkau menyangka bahwa Allah lalai atas apa yang dilakukan oleh orang-orang zalim.” Dari kaummu, karena sesungguhnya, jika siksaan dan azab kepada mereka belum turun dan datang, Dia menginginkan untuk menunda mereka (لِيَوۡمٖ تَشۡخَصُ فِيهِ ٱلۡأَبۡصَٰرُ) “Hingga hari seluruh mata terbelalak.” Semua mata terbuka, tidak berkedip karena berat dan mengerikannya keadaan saat itu. Pelajaran dari ayat : • Penangguhan azab atas orang-orang yang zalim pada setiap zaman dan lokasi, bukan karena lalai, namun penundaan hingga hari kiamat atau hingga tiba saat yang telah ditentukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 42: Ayat ini merupakan ancaman keras bagi orang-orang yang zalim dan hiburan bagi orang-orang yang dizalimi. Yakni orang-orang kafir. Dengan tidak mengazab, memberikan rezeki, dan membiarkan mereka bolak-balik mengadakan perjalanan di berbagai negeri dalam keadaan aman dan tenang. Hal ini tidaklah menunjukkan bahwa keadaan mereka baik, karena Allah menangguhkan orang yang zalim agar bertambah dosanya. Ketika tiba waktunya, maka Dia tidak akan meloloskannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 42",
    "description": "Usai mengisahkan doa-doa nabi ibrahim dalam beberapa ayat sebelumnya, pada ayat-ayat berikut Allah menegaskan betapa dia tidak pernah lengah mengawasi perbuatan orang yang zalim dan durhaka. Dia berfirman, dan janganlah sekali-kali engkau atau siapa pun juga mengira bahwa Allah lengah sehingga lalai atau lupa dari menjatuhkan sanksi atas apa yang diperbuat oleh orang yang zalim. Sesungguhnya Allah hanya sedang menangguhkan hukuman yang akan dijatuhkan-Nya kepada mereka sampai hari yang pada waktu itu mata mereka terbelalak akibat dahsyatnya hari pembalasan itu. Pada hari itu mereka datang dengan tergesa-gesa memenuhi panggilan Allah dengan mengangkat kepalanya dan memandang dengan penuh cemas, sedang mata mereka tidak berkedip-kedip karena takut dan hati mereka kosong karena tidak mampu lagi berpikir."
  }
]