[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari dimana orang-orang yang zhalim akan bangkit dari kubur-kubur mereka dengan bergegas untuk menyambut seruan orang yang memanggil untuk meperhitungkan amal mereka, dalam keadaan mengangkat kepala-kepala mereka, namun tidak dapat melihat apapun lantaran prahara mencekam yang terjadi di tempat tersebut, dan hati mereka kosong, tidak ada apa-apa padanya, dikarenakan ketakutan dan rasa ngeri terhadap kejadian yang dilihat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Manakala manusia bangkit dari alam kubur mereka dengan bergegas menuju penyeru, mereka mengangkat kepala mereka memandang ke langit dalam kondisi ketakutan. Pandangan mereka tidak kembali kepada mereka, sebaliknya ia tetap terbelalak menengadah ke atas karena ketakutan melihat apa yang disaksikannya, hati mereka kosong tidak memahami dan tidak mengerti karena ketakutan atas apa yang terlihat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Kamu akan melihat mereka segera memenuhi seruan dengan mendongakkan kepala mereka tanpa berkedip, mata mereka terbelalak karena melihat peristiwa menakutkan yang menjadikan hati mereka tercengang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. مُهْطِعِينَ (mereka datang bergegas-gegas) Yakni dengan terburu-buru. مُقْنِعِى رُءُوسِهِمْ(dengan mangangkat kepalanya) Sambil menghadapkan wajah mereka ke langit dengan pandangan ketakutan dan kehinaan. Dan mereka tidak saling melihat satu sama lain. لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ ۖ( sedang mata mereka tidak berkedip-kedip) Mata mereka terus terbelalak. وَأَفْـِٔدَتُهُمْ هَوَآءٌ(dan hati mereka kosong) Hati mereka kosong dari suatu fikiran akibat kengerian, dan kedahsyatan yang mereka saksikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Mereka bergegas menuju penyeru dalam keadaan hina dan terpecah belah. Kepala mereka terangkat menghadap langit, seraya melihat dengan ketakutan tanpa berpaling kepada sesuatu apapun. Penglihatan mereka lenyap, meskipun mata mereka masih tetap ada di saat itu. Kelopak mata mereka berhenti bergerak karena ketakutan, hati mereka tidak bisa berpikir dan memahami sesuatu karena dahsyatnya ketakutan dan keterkejutan mereka, layaknya udara, yaitu kekosongan yang tidak mengandung apapun di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika penglihatan terbelalak karena takut dengan apa yang dilihat pada hari itu {Mereka datang tergesa-gesa} bersegera {dengan mengangkat kepala mereka} mengangkat kepala mereka {dan mata mereka tidak berkedip} dan penglihatan mereka tidak berkedip {dan hati mereka kosong} hati mereka kosong dari segala pengetahuan dan pemahaman karena ketakutan yang sangat dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Mereka datang bergegas-gegas”, maksudnya mereka bersegera merangsek kearah penyeru ketika meminta mereka untuk datang di hadapan Allah untuk menjalani proses hisab (perhitungan amal). Tidak ada penolakan pada mereka, dan tiada tempat lari maupun tempat bersembunyi “dengan mengangkat kepalanya” maksudnya menengadahkannya. Dua tangan mereka telah dirantai sampai menyentuh dagu-dagu mereka. Karenanya, kepala-kepala mereka terangkat “sedang mata mereka tidak berkedip-kedip dan hati mereka kosong”, maksudnya hati-hati mereka kosong dari dada mereka, karena telah naik kea rah kerongkongan. Akan tetapi, begitu tersesaki oleh kegelisahan, kerisauan, kesedihan, dan kegundahan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مُهۡطِعِينَ مُقۡنِعِي رُءُوسِهِمۡ) muhthi’iina muqni’ii ruusihim : “bergegas, mengangkat kepada mereka.” bergerak dengan cepat ke arah penyeru yang menyeru mereka ke tempat berkumpul mereka, seraya mengangkat kepala mereka. (وَأَفۡ‍ِٔدَتُهُمۡ هَوَآءٞ) wa afidatuhum hawaa’ : “dan hati mereka kosong” kosong dari akal, karena ketakutan dan terkejut. Makna ayat : (مُهۡطِعِينَ) “bergegas” bersegera (مُقۡنِعِي رُءُوسِهِمۡ) “seraya mengangkat kepala mereka” keadaan mereka bergegas seraya mengangkat kepala menuju penyeru untuk berkumpul di Mahsyar, Allah ta’ala berfirman : (وَٱسۡتَمِعۡ يَوۡمَ يُنَادِ ٱلۡمُنَادِ مِن مَّكَانٖ قَرِيبٖ) “Dengarkanlah, pada hari penyeru menyeru dari tempat yang dekat.” (لَا يَرۡتَدُّ إِلَيۡهِمۡ طَرۡفُهُمۡۖ) “Mata mereka tidak berkedip” kerena ketakutan (وَأَفۡ‍ِٔدَتُهُمۡ) “dan hati mereka” (هَوَآءٞ) “kosong” hampa dari kesadaran dan akal, sebab kengerian dan ketakutan yang menimpa mereka. Pelajaran dari ayat : • Penjelasan kengerian hari kiamat, dan beratnya kondisi pada saat itu, sampai orang-orang zalim berharap untuk kembali ke dunia agar mereka bisa beriman, mentaati, dan mentauhidkan Rabb mereka dalam beribadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 43: Dalam ayat ini, Allah Subhaanahu wa Ta'aala menyebutkan bagaimana bangkitnya mereka dari kubur dan segeranya mereka ke mahsyar. Untuk menghadap Allah untuk dihisab. Ke langit. Ada yang berpendapat, bahwa karena tangan mereka dibelenggu sampai ke leher sehingga kepala mereka diangkat ke atas. Karena kaget."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 43",
    "description": "Pada hari itu mereka datang dengan tergesa-gesa memenuhi panggilan Allah dengan mengangkat kepalanya dan memandang dengan penuh cemas, sedang mata mereka tidak berkedip-kedip karena takut dan hati mereka kosong karena tidak mampu lagi berpikir. Dan berikanlah peringatan, wahai nabi Muhammad, kepada semua manusia bahwa pada hari ketika azab datang kepada mereka yang durhaka, maka orang yang zalim dan durhaka itu berkata, ya tuhan kami, berilah kami kesempatan untuk kembali ke dunia, walaupun hanya sebentar, niscaya kami akan mematuhi seruan engkau yang dulu kami ingkari, dan kami akan mengikuti petunjuk rasul-rasul-Mu. Kepada mereka lalu dikatakan, bukankah dahulu di dunia kamu dengan penuh kesombongan telah bersumpah bahwa sekali-kali kamu tidak akan merasakan ke-binasa-an'."
  }
]