[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan peringatkanlah wahai rasul, kepada sekalian manusia yang Aku mengutus kamu kepada mereka, akan siksaan Allah pada hari kiamat. Dan dalam saat tersebut, orang-orang zhalim terhadap diri mereka dengan kekafiran berkata, ”wahai tuhan kami, berilah kami waktu penangguhan hingga waktu sekejap saja, niscaya kami akan beriman kepadaMu dan membenarkan rasul-rasul utusanMu.” Maka dikatakanlah kepada mereka sebagai cercaan kepada mereka, ”bukankah kalian telah bersumpah dalam hidup kalian dulu bahwa sesungguhnya tidak ada kebinasaan yang terjadi pada kalian dari kehidupan dunia menuju akhirat, dan kalian tiidak beriman kepada hari kebangkitan ini?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Peringatkanlah -wahai Rasul- umatmu terhadap azab Allah pada Hari Kiamat, pada hari itu orang-orang yang menzalimi diri mereka dengan kesyirikan dan kekufuran berkata, “Ya Rabbana! Berilah kami tempo, tundalah azab dari kami, pulangkanlah kami ke dunia walau sesaat, agar kami beriman kepada-Mu dan mengikuti rasul-rasul yang Engkau utus kepada kami”. Maka permintaan mereka dijawab dengan cibiran, “Bukankah di kehidupan dunia kalian telah bersumpah bahwa kalian tidak akan berpindah dari kehidupan dunia ke alam Akhirat dengan mengingkari kebangkitan sesudah kematian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-45. Hai Nabi, Peringatkanlah manusia dan jin dari azab pada hari kiamat, yaitu hari ketika orang-orang zalim memohon pertolongan: “Ya Tuhan kami, kembalikanlah kami sekejap saja agar kami dapat memenuhi seruan-Mu untuk mengesakan-Mu, dan beriman dan mengikuti para rasul.” Maka Allah menjawab mereka: “Bukankah kalian telah bersumpah ketika di dunia bahwa kalian akan kekal di sana, dan kalian mendustakan hari kebangkitan. Kalian telah tinggal di tempat orang-orang yang menzalimi diri mereka sendiri dengan kekafiran, seperti kaum ‘Ad dan Tsamud; dan kalian telah mengetahui bagaimana Kami membinasakan mereka akibat dosa-dosa mereka, akan tetapi kalian tidak mengambil pelajaran dari mereka; dan Kami juga telah membuat berbagai perumpamaan dalam al-Qur’an namun kalian juga tidak mengambil pelajaran darinya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَأَنذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ (Dan berikanlah peringatan kepada manusia terhadap hari (yang pada waktu itu) datang azab kepada mereka) Yakni hari kiamat. Yakni peringatkanlah mereka hari kiamat agar mereka takut. نُّجِبْ دَعْوَتَكَ (niscaya kami akan mematuhi seruan Engkau) Yakni seruan-Mu kepada hamba-hamba-Mu melalui lisan para Nabi-Mu. وَنَتَّبِعِ الرُّسُلَ (dan akan mengikuti rasul-rasul) Agar kami beramal dan memperbaiki kelalaian yang dulu kami lakukan. أَوَلَمْ تَكُونُوٓا۟ أَقْسَمْتُم مِّن قَبْلُ مَا لَكُم مِّن زَوَالٍ (Bukankah kamu telah bersumpah dahulu (di dunia) bahwa sekali-kali kamu tidak akan binasa) Yakni kemudian dikatakan kepada mereka sebagai olokan bagi mereka “bukankah dahulu kalian telah bersumpah bahwa kalian akan kekal hidup di dunia, dan hari kiamat itu tidak ada?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Wahai Nabi, ancamlah dan peringatkanlah orang-orang kafir itu tentang hari dimana azab akan mendatangi mereka, yaitu pada hari kiamat. Lalu orang-orang yang menzalimi diri sendiri dengan kekufuran itu berkata: “Wahai Tuhan kami, abaikanlah kami, tangguhkanlah azab kami sampai waktu yang ditentukan sebentar lagi, dan kembalikanlah kami ke dunia supaya kami bisa mengakui kelalaian kami, dan kami akan menerima ajakanmu untuk bertauhid serta mengikuti para rasul yang engkau utus untuk menyampaikan syariat.” Lalu mereka diejek: “Bukankah kalian telah bersumpah di dunia bahwa kalian akan abadi disana, tidak akan terpisah darinya, dan tidak ada kebangkitan serta penghisaban.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Peringatkanlah} Peringatkanlah {kepada manusia tentang hari (ketika) azab datang kepada mereka. Maka orang-orang yang zalim berkata,“Ya Tuhan kami, tangguhkanlah kami} tangguhkanlah kami {walaupun sebentar, niscaya kami akan mematuhi seruanMu dan akan mengikuti para rasul.” “Bukankah sebelumnya kalian telah bersumpah bahwa sekali-kali kalian tidak akan beralih} kalian tidak berpindah dari dunia menuju akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Allah berfirman kepada NabiNya, Muhammad “Dan berikanlah peringatan kepada manusia terhadap hari (yang pada waktu itu) datang azab kepada mereka”, maksudnya deskripsikanlah kondisinya dan peringatkanlah mereka dari amalan-amalan yang mendatangkan siksa, yang jika telah tiba membawa kesengsaraan dan malapetaka, maka berkatalah orang-orang yang berbuat kezhaliman dalam bentuk kekufuran dan pendustaan serta macam-macam maksiat dalam perasaan sesal atas tindakan mereka, permohonan untuk kembali (ke dunia) yang sudah bukan waktunya lagi, “Ya Rabb kami, beri tangguhlah kami (kembalikanlah kami ke dunia) walaupun dalam waktu yang sedikit”, maksudnya tolong kembalikanlah kami ke alam dunia. Sungguh kami telah menyaksikan (kebenaran yang kami dustakan) “niscaya kami akan mematuhi seruanMu”, dan Allah menyeru ke Darussalam (tempat keselamatan, surga) “dan kami akan mengikuti rasul-rasul”, semua omongan ini hanyalah untuk terbebaskan dari siksaan yang pedih. Apabila tidak demikian, maka sebetulnya mereka itu berbohong saja dalam janji ini. Bila mereka dikembalikan (ke dunia lagi), tentulah mereka kembali menerjang larangan-larangan. Oleh sebab itu, cercaan dialamatkan kepada mereka. Dikatakan kepada mereka “Bukankah kamu telah bersumpah dahulu (di dunia) bahwa sekali-kali kamu tidak akan binasa”, dari dunia dan berpindah ke alam akhirat. Sekarang ini, telah jelas bagi kalian batalnya sumpah kalian dan kedustaan kalian yang kalian klaim."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نُّجِبۡ دَعۡوَتَكَ) nujib da’wataka : “kami ikuti seruan-Mu.” Melalui lisan rasul-Mu, kami menyembah, mentauhidkan-Mu, dan mengikuti para rasul. (مَا لَكُم مِّن زَوَالٖ) maa lakum min zawaal : “kalian tidak akan berpindah.” Dari dunia menuju akhirat. Makna ayat : Kemudian Allah ta’la memperintahkan Rasul-Nya pada ayat 44 untuk memperingatkan manusia akan akhir mereka seandainya mereka senantiasa berbuat kesyirikan kepada Allah, ingkar kepada Rasul-Nya dan syariat-Nya. (يَوۡمَ يَأۡتِيهِمُ ٱلۡعَذَابُ فَيَقُولُ ٱلَّذِينَ ظَلَمُواْ) “Pada hari datangnya azab, maka orang-orang zalim berkata” yaitu berbuat syirik kepada Rabb mereka, mengganggu hamba-hamba-Nya yang beriman (رَبَّنَآ أَخِّرۡنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖ) “Wahai Rabb kami, tangguhkanlah kami untuk waktu yang singkat.” Mereka memohon penangguhan dan penundaan (نُّجِبۡ دَعۡوَتَكَ) “maka kami akan menjawab seruan-Mu” yaitu, kami mentauhidkan-Mu, mentaati-Mu dan Rasul-Mu, maka dikatakan kepada mereka—sebagai ejekan, peringatan, dan pengingkaran—(أَوَ لَمۡ تَكُونُوٓاْ أَقۡسَمۡتُم) “bukankan kalian telah bersumpah” (مِّن قَبۡلُ مَا لَكُم مِّن زَوَالٖ) “sebelumnya, bahwa kalian tidak akan binasa?” Apakah kalian sekarang memohon penangguhan, untuk apa kalian memintanya, sedangkan kalian pernah berkata, “Kami tidak akan binasa ataupun berpindah dari dunia menuju akhirat. Pelajaran dari ayat : • Peringatan atas kezaliman dengan menjelaskan akhir dari peluku kezaliman, dengan menyebutkan kondisi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 44: Yaitu hari kiamat. Dengan berbuat kufur, mendustakan dan melakukan berbagai maksiat dalam keadaan menyesali apa yang mereka kerjakan. Ini semua diucapkan hanyalah karena ingin lolos dari azab, karena jika tidak demikian sesungguhnya mereka berdusta dalam ucapannya ini. Jika mereka dikembalikan ke dunia, tentu mereka akan melakukan hal yang dilarang itu. Oleh karena itu, merea dicela dengan kata-kata sebagaimana disebutkan di atas. Yakni pindah dari dunia ke akhirat. Sekarang kamu mengetahui dustanya dakwaan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 44",
    "description": "Dan berikanlah peringatan, wahai nabi Muhammad, kepada semua manusia bahwa pada hari ketika azab datang kepada mereka yang durhaka, maka orang yang zalim dan durhaka itu berkata, ya tuhan kami, berilah kami kesempatan untuk kembali ke dunia, walaupun hanya sebentar, niscaya kami akan mematuhi seruan engkau yang dulu kami ingkari, dan kami akan mengikuti petunjuk rasul-rasul-Mu. Kepada mereka lalu dikatakan, bukankah dahulu di dunia kamu dengan penuh kesombongan telah bersumpah bahwa sekali-kali kamu tidak akan merasakan ke-binasa-an'dan padahal kamu telah tinggal dan menetap di tempat orang yang menzalimi diri sendiri ketika itu, dan kamu pun menyaksikan bekas-bekas kehancuran sebagai akibat dari kedurhakaan mereka, dan dengan demikian telah nyata bagimu bagaimana kami telah berbuat terhadap mereka dengan menjatuhkan siksa, dan telah kami berikan kepadamu beberapa perumpamaan sebagai peringatan."
  }
]