[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kalian telah menempati tempat-tempat tinggal orang-orang kafir terdahulu yang telah melakukan penganiayaan terhadap diri mereka, seperti kaum Hud kaum shaleh, dan kalian sudah mengetahui (dengan apa yang kaliam lihat sendiri dan memperoleh kabar dari pihak lain-, apa yang kami jatuhkan kepada mereka, berupa kebinasaan. Dan kami telah mengadakan beberapa perumpamaan bagi kalian di dalam al-qur’an, namun kalian tidak mau mengambil pelajaran darinya?’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan kalian tinggal di negeri umat-umat terdahulu yang zalim terhadap diri mereka dengan kekufuran kepada Allah seperti kaum Hūd dan kaum Ṣāleḥ. Kalian juga sudah mengetahui apa yang telah Kami timpakan atas mereka berupa kebinasaan, Kami juga telah membuat perumpamaan bagi kalian dalam kitab Allah agar kalian mengambil pelajaran, namun kalian tidak mengambil pelajaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَسَكَنتُمْ فِى مَسٰكِنِ الَّذِينَ ظَلَمُوٓا۟ أَنفُسَهُمْ (dan kamu telah berdiam di tempat-tempat kediaman orang-orang yang menganiaya diri mereka sendiri) Yakni kalian telah tinggal di sana, yaitu di negeri-negeri tempat tinggal kaum Tsamud dan orang-orang kafir lainnya yang menzalimi diri mereka sendiri dengan kekafiran dan kemaksiatan mereka terhadap Allah. وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ (dan telah nyata bagimu bagaimana Kami telah berbuat terhadap mereka) Berupa siksaan dan azab yang keras akibat dosa-dosa yang mereka lakukan. وَضَرَبْنَا لَكُمُ الْأَمْثَالَ (dan telah Kami berikan kepadamu beberapa perumpamaan) Dalam kitab-kitab Allah dan melalui lisan para Rasul-Nya sebagai penjelas bagi kalian dan penyempurna hujjah atas kalian. Yakni, lalu mengapa kalian tidak mengambil pelajaran dari perumpamaan-perumpamaan tersebut, dan kalian malah tetap mendustakannya, seakan-akan ini hanyalah permaianan belaka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَسَكَنْتُمْ فِي مَسَاكِنِ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ } \"Dan kamu telah berdiam di tempat-tempat kediaman orang-orang yang menganiaya diri mereka sendiri\" , { رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ } \"ya Tuhanku, maka janganlah Engkau jadikan aku berada di antara orang-orang yang zalim\" [ Al-Mu'minun : 94 ] seorang muslimah (sama halnya dengan seorang muslim) semestinya menjauh dari majlis-majlis yang di dalamnya ditampakkan kemaksiatan, mulai dari nyanyian dan ikhtilath dan tabarruj, baik itu tempat rekreasi ataupun perkumpulan hari raya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Dan kalian telah menempati tempat orang-orang yang menzalimi diri sendiri dengan kekufuran dan kemaksiatan seperti kaum Tsamud dan ‘Aad. Dan kalian telah tahu bagaimana Kami mengazab dan membinasakan mereka karena dosa-dosa mereka, namun kalian tetap tidak terpengaruh. Kami juga telah menjelaskan kepada kalian tentang perumpamaan dan pelajaran dalam Al-Qur’an, namun kalian tidak mengambil pelajaran dengan semua itu. Kalian juga tidak menyadari bahwa kalian seperti mereka dalam berbuat kufur dan menerima azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian telah tinggal di tempat tinggal orang-orang yang menzalimi diri sendiri dan telah nyata bagi kalian, bagaimana Kami telah berbuat terhadap mereka dan Kami telah memberikan kepada kalian beberapa perumpamaan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Dan” kalian tidak terpasung di dunia untuk mencerna ayat-ayat dan bukti-bukti nyata (tentang kebenaran akhirat). Bahkan “kamu telah berdiam di tempat-tempat kediaman orang-orang yang menganiaya diri mereka sendiri, dan telah nyata bagimu bagaimana Kami telah berbuat terhadap mereka”, yang berbentuk menimpakan macam-macam hukuman, dan bagaimana Allah menjatuhkan siksaan-siksaan pada mereka ketika berbuat pendustaan terhadap ayat-ayat (tanda-tanda kebesaran Allah) yang sudah jelas. “Dan telah kami berikan kepadamu beberapa perumpamaan”, yang terang, yang mana tidaklah dia meninggalkan satu unsur keraguan sedikit pun dalam hati seseorang melainkan dia pasti menyingkirkannya. Ayat-ayat itu tidak berfaidah bagi kalian. Justru kalian berpaling dan tetap berkubang dalam kebatilan kalian. Maka, terjadilah peristiwa yang menimpa mereka. Dan kalian sudah sampai ke momentum hari ini yang mana pengajuan alasan dengan (disertai) kebatilan padanya tidak efektif."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (وَسَكَنتُمۡ فِي مَسَٰكِنِ ٱلَّذِينَ ظَلَمُوٓاْ أَنفُسَهُمۡ) “dan kalian telah menempati tempat orang-orang yang dahulu telah menzalimi diri mereka sendiri” dengan syirik dan maksiat (وَتَبَيَّنَ لَكُمۡ) “dan telah jelas bagi kalian” kalian mengetahui (كَيۡفَ فَعَلۡنَا بِهِمۡ) “bagaimana perlakuan Kami kepada mereka” dengan membinasakan mereka dan Kami telah menjadikan mereka sebagai perumpamaan dalam kitab-kitab Kami dan melalui lisan Rasul-Rasul Kami. Maka mereka dihina dengan hinaan ini, permintaan mereka tidak dikabulkan, dan mereka dilempar ke dalam Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 45: Dengan kekafiran, yaitu umat-umat terdahulu. Dengan membinasakan mereka. Dalam Al Qur’an, namun kamu tidak mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 45",
    "description": "Dan padahal kamu telah tinggal dan menetap di tempat orang yang menzalimi diri sendiri ketika itu, dan kamu pun menyaksikan bekas-bekas kehancuran sebagai akibat dari kedurhakaan mereka, dan dengan demikian telah nyata bagimu bagaimana kami telah berbuat terhadap mereka dengan menjatuhkan siksa, dan telah kami berikan kepadamu beberapa perumpamaan sebagai peringatan. Dan ingatlah, sungguh mereka telah membuat tipu daya atas Allah padahal Allah mengetahui dan akan membalas tipu daya mereka. Dan sesungguhnya tipu daya mereka sangat ringan sehingga tidak mampu untuk sekadar melenyapkan gunung-gunung yang menjadi salah satu bukti kekuasaan Allah."
  }
]