[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kaum musyrikin telah merencanakan keburukan kepada rasul untuk membunuhnya, dan di sisi Allah (balasan) tipu daya mereka, karena Dia meliputinya, dan sungguh tipu daya mereka berbalik menjadi bumerang bagi mereka sendiri. Dan tidaklah makar mereka itu menyebabkan gunung-gunung dan lainnya lenyap, dikarenakan begitu lemah dan tak berkekuatan. Dan mereka tidak dapat melancarkan mudarat kepada Allah sedikitpun. Dan sesungguhnya mereka membahayakan diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Orang-orang yang singgah di negeri umat-umat yang zalim itu telah menyusun rencana jahat untuk membunuh Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- dan menghapus dakwahnya, Allah mengetahui rencana jahat mereka karena tidak ada sesuatu pun yang samar bagi Allah. Rencana jahat mereka itu lemah, saking lemahnya ia tidak bisa menghilangkan gunung atau apapun, berbeda dengan rencana Allah terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Orang-orang Musyrik telah bersepakat untuk menyusun makar dan permusuhan terhadap Nabi dan orang-orang beriman. Dan Allah mengetahui segala makar tersebut dan balasannya. Sungguh makar mereka tidak dapat melenyapkan gunung-gunung karena sangat lemah, sehingga tidak dapat membawa mudharat apapun bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَقَدْ مَكَرُوا۟ مَكْرَهُمْ (Dan sesungguhnya mereka telah membuat makar yang besar) Dalam melawan kebenaran dan membela kebatilan mereka dengan sekuat tenaga. وَعِندَ اللهِ مَكْرُهُمْ(padahal di sisi Allah-lah (balasan) makar mereka itu) Yakni mereka membuat makar bagi kekasih-kekasih Allah, sedangkan Allah melihat dan mendengar mereka berbuat makar dan mengetahui makar mereka. وَإِن كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ (Dan sesungguhnya makar mereka itu (amat besar) sehingga gunung-gunung dapat lenyap karenanya) Yakni meskipun makar mereka dapat melenyapkan gunung-gunung, namun Allah tetap akan menolong agama-Nya. Pendapat lain mengatakan maknanya adalah makar mereka di dalam kuasa Allah, sehingga makar mereka tidaklah besar yang mampu melenyapkan pegunungan. Dan perlawanan makar mereka tidak akan susah bagi Allah meski sebesar gunungpun akan tetap mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Orang-orang kafir Mekah telah menyusun rencana rahasia. Mereka berusaha keras untuk merusak kebenaran dan meneguhkan kebathilan. Dan di sisi Allah itu ilmu tentang rencana mereka dan balasan atas rencana tersebut. Dia itu Maha Kuasa untuk membatalkannya meskipun rencana mereka itu besar, kuat dan buruk sehingga hampir bisa menghilangkan gunung dari tempatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh mereka telah membuat tipu daya dan di sisi Allah itu tipu daya mereka} dan di sisi Allah ada balasan atas tipu daya mereka {Sesungguhnya tipu daya mereka tidak akan mampu melenyapkan gunung-gunung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Dan sesungguhnya mereka telah membuat makar”, yaitu kaum yang mendustakan para rasul “makar yang besar”, yang telah didukung oleh kehendak dan kemampuan mereka “padahal di sisi Allah-lah (balasan) makar mereka itu”, maksudnya ilmu dan kekuasaan Allah meliputinya, karena ulah makar mereka akan berbalik menyerang mereka. Dan tidaklah makar yang buruk itu menerjang melainkan kepada pencetusnya saja. “Dan sesungguhnya makar mereka itu (amat besar) sehingga gunung-gunung dapat lenyap karenanya”, maksudnya, sungguh usaha makar kaum kafir yang mendustakan para rasul yang haq dan orang-orang yang membawa kebenaran –karena besarnya- sehingga bisa menyebabkan gunung-gunung yang menjulang tinggi hilang dari tempat-tempatnya. Maksudnya, mereka telah menggerakkan makar yang begitu besar, yang tidak bisa diukur tingkatannya. Akan tetapi, Allah membalikkan pengaruh makar itu ke leher-leher mereka. Termasuk dalam konteks ini, setiap orang yang menciptakan makar dari kalangan orang-orang yang menyalahi para rasul, untuk membela kebatilan atau melumpuhkan kebenaran. Jadi, maksud ayat ini, bahwa makar mereka tidak bermanfaat bagi mereka sedikit pun, dan tidak menimbulkan bahaya apa pun bagi Allah. Justru mereka sedang menciptakan bahaya bagi diri mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَقَدۡ مَكَرُواْ مَكۡرَهُمۡ) wa qad makaruu makrahum : “mereka telah membuat makar” yaitu, kaum Quraisy telah membuat makan untuk nabi shallahu ‘alaihi wa sallam, mereka menginginkan untuk membunuh beliau, atau menangkap, dan mengasingkannya. (وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ) wa in kaana makruhum li tazuul minhul jibaal : “Sekalipun makar mereka mampu menghilangkan gunung-gunung.” Yaitu, tipu daya mereka tidak sampai menghilangkan gunung-gunung, karena itu merupakan sebuah kebodohan, tidak berguna, sehingga tidak bermanfaat. Makna ayat : Firman-Nya (وَقَدۡ مَكَرُواْ مَكۡرَهُمۡ) “Dan mereka telah berbuat makar” yaitu orang-orang kafir Quraisy terhadap Rasulullah shallahu ‘alaihi wa sallam, sebagaimana mereka telah bersepakat untuk memenjarakan beliau, diikat di dalam penjara hingga tewas, dengan membunuh beliau, mengasingkan, bahkan mereka telah bersungguh-sungguh untuk membunuh beliau, namun mereka tidak mampu (وَعِندَ ٱللَّهِ مَكۡرُهُمۡ) “dan di sisi Allah-lah makar mereka.” Allah telah mengetahui makar mereka, rencana mereka, dan balasan mereka atas perbuatan ini. Firman-Nya : (وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ) “Sekalipun makar mereka mampu mengancurkan gunung.” Dan sekali-kali tidak mungkin makar mereka dapat menghancurkan gunung, karena itu hanyalah hal yang bodoh, tidak berbobot, tidak bermanfaat, maka janganlah engkau, Wahai Rasul perhatikan, karena ia tidak akan menyebabkan apapun, dan mereka sebenarnya telah rugi serugi-ruginya. Pelajaran dari ayat : • Penegasan kejahatan kaum Quraisy atas kesepakatan mereka untuk membunuh Rasulullah shalalahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 46: Maksudnya, orang-orang kafir itu membuat rencana jahat untuk mematahkan kebenaran Islam dan berusaha menegakkan kebatilan, tetapi mereka itu tidak menyadari bahwa makar (rencana jahat) mereka akan digagalkan Allah Subhaanahu wa Ta'aala. Makar tersebut tidak memberi manfaat apa-apa, tidak memudharatkan Allah dan hanya membahayakan diri mereka sendiri. Mereka juga membuat makar terhadap Nabi Muhammad shallallahu 'alaihi wa sallam dengan berusaha membunuhnya, mengikatnya dan mengusirnya. Tentang maksud gunung di sini ada yang mengartikan hakiki, dan ada pula yang mengartikan dengan syari’at-syari’at Islam yang diserupakan dengan gunung karena kokohnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 46",
    "description": "Dan ingatlah, sungguh mereka telah membuat tipu daya atas Allah padahal Allah mengetahui dan akan membalas tipu daya mereka. Dan sesungguhnya tipu daya mereka sangat ringan sehingga tidak mampu untuk sekadar melenyapkan gunung-gunung yang menjadi salah satu bukti kekuasaan Allah. Maka karena itu, jangan sekali-kali kamu atau siapa pun mengira bahwa Allah mengingkari janji-Nya kepada rasul-rasul-Nya dalam keberhasilan tugas yang mereka laksanakan. Sungguh, Allah mahaperkasa dan mempunyai pembalasan. Dia akan menjatuhkan siksa bagi para pendurhaka."
  }
]