[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah sekali-kali kamu mengira wahai rasul, bahwa Allah akan mungkir kepada rasul-rasulNya mengenai apa yang telah Dia janjikan pada mereka berupa pertolongan dan kehancuran orang-orang yang mendustakan mereka. Sesungguhnya Allah maha perkasa, tidak ada sesuatupun yang mustahil baginya, lagi membalas ulah musuh-musuhNya dengan balasan yang pedih.” Khitob dari ayat ini walaupun khusus untuk nabi Muhammad tapi sebetulnya umum untuk seluruh umatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Jangan sekali-kali kamu -wahai Rasul- menyangka bahwa Allah yang menjanjikan para utusan-Nya dengan kemenangan dan keunggulan agamanya menyelisihi apa yang telah Dia janjikan kepada para utusan-Nya. Sesungguhnya Allah Maha Perkasa yang tidak dikalahkan oleh siapa pun, Pemilik hukuman yang berat terhadap musuh-musuh-Nya dan musuh-musuh utusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Hai Rasulullah, janganlah kamu mengira Allah mengingkari janji-Nya bagi para rasul untuk menyelamatkan mereka dan membinasakan orang-orang kafir. Allah Maha Perkasa, tidak ada yang sulit bagi-Nya; Dia mampu membalas musuh-musuh Islam, yaitu ketika hari kiamat, hari ketika bumi diganti dengan bumi yang lain yang putih bersih, dan langit diganti dengan langit yang lain; pada hari itu seluruh makhluk keluar dari kubur untuk menghadap Allah Yang Maha Esa dalam sifat uluhiyah dan rububiyah, Yang Menguasai seluruh makhluk. Sahl bin Sa’d berkata, aku mendengar Rasulullah bersabda: “Pada hari kiamat manusia akan dikumpulkan di tanah lapang yang putih seperti warna roti putih.” (Shahih al-Bukhari, kitab ar-Riqaq, bab Allah menggenggam bumi pada hari kiamat, no. 6521). ‘Aisyah berkata, aku bertanya kepada Rasulullah tentang firman Allah (يوم تبدل الأرض غير الأرض والسماوات), di mana manusia ketika itu wahai Rasulullah? Maka beliau menjawab: “Di atas shirath”. (Shahih Muslim 4/2150, kitab sifat-sifat orang munafik dan hukum-hukum yang berkaitan dengan mereka, bab hari kebangkitan, no. 2891). Syeikhul Islam Ibnu Taimiyah berkata: Manusia akan dibangkitkan di atas bumi yang telah diganti, dan al-Qur’an juga menyatakan hal itu sebagaimana dalam firman-Nya: (يوم تبدل الأرض غير الأرض والسماوات وبرزوا لله الواحد القهار) dan mereka dikumpulkan dan dihisab sebelum melewati shirath, orang yang berhasil melewati shirath akan menuju surga sedangkan para penghuni neraka akan terjatuh sebagaimana disebutkan dalam banyak hadits. (Mukhtashar al-Fatawa al-Mishriyah)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. فَلَا تَحْسَبَنَّ اللهَ مُخْلِفَ وَعْدِهِۦ رُسُلَهُۥٓ (Karena itu janganlah sekali-kali kamu mengira Allah akan menyalahi janji-Nya kepada rasul-raaul-Nya) Yang dimaksud adalah janji Allah dalam firman-Nya: إنا لننصر رسلنا “sungguh Kami akan menolong Rasul-Rasul Kami” (Al-Mu’min:51) Dan firman-Nya: كتب الله لأغلبن إنا ورسلي “Allah telah menetapkan: \"Aku dan rasul-rasul-Ku pasti menang\" (al-Mujadilah: 21) إِنَّ اللهَ عَزِيزٌ(sesungguhnya Allah Maha Perkasa) Tidak ada yang dapat mengalahkan-Nya. ذُو انتِقَامٍ(lagi mempunyai pembalasan) Membalas musuh-musuh bagi para kekasih-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai rasul, janganlah kamu menganggap bahwa Allah akan mengingkari janjiNya yang telah diberikan kepada para rasul untuk menolong dan mendukung mereka. Sesungguhnya Allah itu Maha Kuasa dan Maha Berwenang sehingga tidak ada yang bisa mengalahkanNya serta Maha Kuasa dalam membalas musuh-musuh dari wali-waliNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka jangan sekali-kali kamu mengira bahwa Allah mengingkari janjiNya kepada rasul-rasul-Nya. Sesungguhnya Allah Maha perkasa lagi mempunyai pembalasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah berfirman, “Karena itu, jangalah sekali-kali kamu mengira Allah akan menyalahi janjiNya kepada rasul-rasulNya”, dengan menyelamatkan mereka dan para pengikut mereka, dan menjadikan mereka bahagia, lalu memusnahkan musuh-musuh mereka serta menelantarkan para musuh itu (tanpa bimbingan dariNya) dan mengenakan hukuman bagi mereka di akhirat. Kejadian ini pasti terealisasikan, karena merupakan janji yang telah disampaikan oleh Dzat yang jujur melalui lisan insan yang paling jujur. Mereka itu adalah para rasul. Informasi ini sebuah berita yang paling tinggi (tingkatan keakurasiannya). Apalagi, kabar berita ini sejalan dengan hikmah ilahiyah dan ketetapan-ketetapan Rabbani serta akal-akal yang sehat. Tiada sesuatu pun yang sanggup melemahkan Allah, sesungguhnya Dia “Mahaperkasa lagi mempunyai pembalasan”, maksudnya jika Allah ingin menimpakan balasan kepada seseorang, maka tidak ada sesuatu pun yang membuatnya lolos dan lemah (tidak setimpal). Peristiwa tersebut pasti terjadi di Hari KIamat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّ ٱللَّهَ عَزِيزٞ) innallaaha ‘aziiz : “Sesungguhnya Allah Maha Perkasa” yaitu, yang Maha Menang tidak ada yang dapat menghalangi kehendak-Nya, sampai kapanpun. (ذُو ٱنتِقَامٖ) dzun tiqaam : pemilik siksaan bagi yang bermaksiat kepada-Nya dan Rasul-Nya. Makna ayat : Pembahasan ayat-ayat ini masih mengenai tentang hiburan bagi Rasulullah shallahu ‘alaihi wa sallam dan kaum mukminin, sedangkan mereka pada saat itu berada dalam kekejaman dan kezaliman orang-orang musyrik. Maka Allah ta’ala berfirman kepada Rasul-Nya shallahu ‘alaihi wa sallam : (فَلَا تَحۡسَبَنَّ ٱللَّهَ مُخۡلِفَ وَعۡدِهِۦ رُسُلَهُۥٓۚ) “Janganlah engkau mengira bahwa Allah akan mengingkari janji-Nya kepada Rasul-Nya” sebgaimana Dia tidak pernah mengingkari janji-Nya kepada Rasul-Rasul-Nya yang terdahulu, Dia juga tidak akan mengingkari janji-Nya kepadamu. Karena Dia pasti akan menepati janji-Nya berupa kemenangan atas musuh-musuhmu, oleh karena itu bersabarlah sebagaimana para Ulul Azmi dari kalangan Rasul, dan janganlah tergesa-gesa atas mereka. (إِنَّ ٱللَّهَ عَزِيزٞ) “Seungguhnya Allah Maha Perkasa” yang Maha Menang, dan tidak ada yang dapat mengalahkan-Nya, yang Maha Kuasa atas kehendak-Nya, seluruh kehendak-Nya pasti terjadi. (ذُو ٱنتِقَامٖ ) “Yang memiliki siksaan” yang keras bagi yang bermaksiat kepada-Nya, membangkang dari ketaatan kepada-Nya, dan memusuhi para Wali-Nya. Pelajaran dari ayat : • Penjelasan mengenai kebenaran janji Allah kepada Rasul-Rasul dan Wali-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 47: Dengan memberikan kemenangan kepada rasul-rasul-Nya, membinasakan musuh-musuh mereka dan mengecewakannya di dunia, serta mengazab mereka di akhirat. Tidak ada yang dapat melemahkan-Nya. Kepada orang-orang yang bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 47",
    "description": "Maka karena itu, jangan sekali-kali kamu atau siapa pun mengira bahwa Allah mengingkari janji-Nya kepada rasul-rasul-Nya dalam keberhasilan tugas yang mereka laksanakan. Sungguh, Allah mahaperkasa dan mempunyai pembalasan. Dia akan menjatuhkan siksa bagi para pendurhaka. Siksa itu akan Allah jatuhkan pada hari ketika bumi diganti dengan bumi yang lain dan langit diganti dengan langit yang lain, dan mereka, yakni manusia, berkumpul di padang mahsyar untuk menghadap Allah yang maha esa lagi mahaperkasa guna mempertanggungjawabkan perbuatan mereka di dunia."
  }
]