[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan balasan Allah terhadap musuh-musuhNya pada hari kiamat terjadi pada hari bumi ini diganti dengan bumi lain yang putih lagi bersih layaknya perak, dan demikian pula langit di ganti dengan langit lainnya, dan makhluk-mahkluk keluar dari kubur-kuburnya dalam keadaan hidup lagi berdiri tegak untuk berjumpa dengan Allah yang Maha Esa lagi mahaperkasa, yang maha Esa dengan keagungan, nama-nama dan sifat-sifatNya serta perbuatan-perbuatanNya, serta keperkasaanNya yang menundukan segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Pembalasan terhadap orang-orang kafir ini terwujud pada hari Kiamat, pada hari di mana bumi diganti dengan bumi lain yang putih bersih, langit-langit diganti dengan lainnya, manusia bangun dari alam kubur mereka dengan jasad amal-amal mereka untuk berdiri menghadap Allah Pemilik tunggal kerajaan dan keagungan, Mahakuat yang mengalahkan, tidak dikalahkan, unggul dan tidak diungguli."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ (pada hari (ketika) bumi diganti dengan bumi yang lain) Yakni berubah sifatnya saja. Pendapat lain mengatakan, diganti dengan bumi lainnya. وَالسَّمٰوٰتُ ۖ( dan (demikian pula) langit) Yakni langit diganti pula dengan langit yang lain, sesuai dengan perbedaan pendapat yang ada pada penggantian bumi. وَبَرَزُوا۟ لِلّٰهِ الْوٰحِدِ الْقَهَّارِ(dan meraka semuanya (di padang Mahsyar) berkumpul menghadap ke hadirat Allah yang Maha Esa lagi Maha Perkasa) Yakni mereka keluar dari kubur mereka. Atau amal perbuatan mereka sembunyikan menjadi tampak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Balasan itu terjadi pada hari dimana bumi berubah menjadi bukan bumi ini dan langit menjadi bukan langit ini. Mereka keluar dan muncul dari kubur karena takut kepada Allah yang Maha Esa yang berwenang atas segala sesuatu dengan kuasaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(yaitu) hari bumi diganti dengan bumi yang lain dan juga langit. Mereka berkumpul} mereka keluar dari kubur mereka {menghadap Allah Yang Maha Esa lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “(Yaitu) pada hari (Ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit”, langit pun diganti dengan rupa langit yang lain. Perubahan ini hanya pada karakteristiknya saja, bukan perubahan wujudnya. Karena bumi pada Hari KIamat akan diratakan dan dihamparkan ibarat permukaan lapangan yang datar. Seluruh isinya, seperti gunung dan dataran-dataran yang menonjol diletakkan pada permukaannya. Jadilah bumi dataran yang rata. Engkau tidak melihat tempat yang rendah maupun yang tinggi. Langit bagaikan luluhan perak lantaran kedahsyatan keadaan hari itu. Lantas, Allah menggulungnya dengan Tangan KananNya “dan mereka semuanya (di padang Mahsyar) berkumpul”, seluruh makhluk (bangkit) dari kubur-kubur mereka menuju hari kebangkitan dan mereka bangkit di tempat yang mana tidak ada sesuatu pun yang tersembunyi pada pandangan Allah. “Menghadap ke hadirat Allah yang Maha Esa lagi Mahaperkasa”, satu-satunya Dzat Yang mempunyai keagungan, nama-nama dan sifat, serta perbuatan yang agung. Dan keperkasaanNya atas seluruh alam semesta. Semuanya berada di bawah penanganan dan pengaturanNya. Tidak ada yang bergerak dan tidak ada yang tetap diam kecuali dengan seizinNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ) yauma tubaddalul ardh : “pada hari bumi diganti” ingatkanlah wahai Rasul Kami, para orang zalim tentang hari digantinya bumi. (وَبَرَزُواْ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ) wa barazuu lillaah : mereka keluar dari kubur mereka menuju Allah untuk penghitungan dan pembalasan. Makna ayat : Maka ingatlah (يَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ غَيۡرَ ٱلۡأَرۡضِ وَٱلسَّمَٰوَٰتُۖ) “Hari diganti bumi dengan bumi yang lain, begitu pula dengan langit.” Begitu pula (وَبَرَزُواْ) “Mereka menghadap” berjalan setelah mereka keluar dari kubur mereka menuju Mahsyar, seraya mematuhi seruan dari seorang penyeru dan mereka pun menghadap (لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ) “kehadiran Allah Yang Maha Esa lagi Maha Perkasa.” Pelajaran dari ayat : • Penjelasan tentang keadaan orang-orang yang berdosa ketika di padang Mahsyar dan di Jahanam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 48: Ada yang mengartikan “ingatlah.” Menurut Syaikh As Sa’diy, penggantian bumi di sini bukan penggantian zat, tetapi penggantian sifatnya, yaitu yang sebelumnya terdapat dataran tinggi dan dataran bawah, maka akan diratakan, dan ketika itu langit seperti cairan tembaga (lihat Al Ma’aarij: 8) karena dahsyatnya keadaan di hari itu, kemudian Allah melipat langit itu dengan Tangan Kanan-Nya. Imam Muslim meriwayatkan dari Aisyah radhiyallahu 'anha, ia berkata: Aku bertanya kepada Rasulullah shallallahu 'alaihi wa sallam tentang firman Allah Ta’ala, “Yauma tubaddalul ardhu ghairal ardhi was samaawaat”, di manakah manusia ketika itu, wahai Rasulullah?” Beliau menjawab, “Di atas shirat (jembatan).” Keluar dan bangkit dari kubur menghadap Allah Azza wa Jalla di tempat berkumpul (padang mahsyar) yang tidak ada satu pun tersembunyi bagi-Nya. Dengan keagungan-Nya, nama-nama-Nya, sifat-sifat-Nya, dan perbuatan-perbuatan-Nya yang agung. Dia menundukkan alam semesta, semuanya di bawah pengaturan-Nya, tidak ada satu pun yang bergerak atau diam kecuali dengan izin-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 48",
    "description": "Siksa itu akan Allah jatuhkan pada hari ketika bumi diganti dengan bumi yang lain dan langit diganti dengan langit yang lain, dan mereka, yakni manusia, berkumpul di padang mahsyar untuk menghadap Allah yang maha esa lagi mahaperkasa guna mempertanggungjawabkan perbuatan mereka di dunia. Pada hari itu engkau atau siapa pun akan melihat orang yang berdosa bersama-sama dengan rekan-rekan mereka, diikat dengan belenggu yang panas membara."
  }
]