[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu wahi rasul, dapat menyaksikan orang-orang yang gemar berbuat dosa pada hari kiamat dalam keadaan terikat dengan tali-tali pengikat, sedang tangan-tangan dan kaki-kaki mereka dirantai menjadi satu dengan belenggu-belenggu, sedang mereka berada dalam kehinaan dan kerendahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49 dan 50. Kamu -wahai Rasul- melihat pada hari di mana bumi diganti dengan bumi lain, langit-langit diganti dengan lainnya, orang-orang kafir dan orang-orang musyrikin dibelenggu, sebagian diikat dengan sebagian lainnya, tangan-tangan dan kaki-kaki mereka dibelenggu ke leher mereka dengan rantai, pakaian yang mereka kenakan adalah belangkin (ter) yang sangat mudah terbakar, api neraka meliputi wajah-wajah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-51. Dan kamu akan melihat pada hari kiamat orang-orang yang berdosa diikat kaki dan tangan mereka dengan rantai besi yang kuat, dan mereka memakai pakaian dari ter, yaitu materi hitam yang mudah terbakar dan berbau menyengat; dan wajah mereka tertutupi api neraka. Manusia akan keluar dari kubur mereka agar Allah membalas amal perbuatan mereka; membalas orang baik dengan kebaikan dan membalas orang jahat dengan keburukan. Sungguh Allah sangat cepat hisab-Nya terhadap seluruh makhluk. Syeikh as-Syinqithi berkata, dalam firman Allah (وتغشى وجوههم النار) dijelaskan bahwa pada hari kiamat, api neraka akan menutupi dan membakar wajah orang-orang kafir; dan dalam ayat-ayat lain dijelaskan: تلفح وجوههم النار وهم فيها كالحون Muka mereka dibakar api neraka, dan mereka di dalam neraka itu dalam keadaan cacat. (Al-Mu’minun: 104) لو يعلم الذين كفروا حين لا يكفون عن وجوههم النار ولا عن ظهورهم ولا هم ينصرون Andaikata orang-orang kafir itu mengetahui, waktu (di mana) mereka itu tidak mampu mengelakkan api neraka dari muka mereka dan (tidak pula) dari punggung mereka, sedang mereka (tidak pula) mendapat pertolongan, (tentulah mereka tiada meminta disegerakan). (Al-Anbiya’: 39)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُّقَرَّنِينَ فِى الْأَصْفَادِ (Dan kamu akan melihat orang-orang yang berdosa pada hari itu diikat bersama-sama dengan belenggu) Kamu akan melihat orang-orang musyrik di hari kiamat dibelenggu satu sama lain. Atau dibelenggu bersama setan-setan. Atau tangan mereka di ikat ke kaki mereka dengan belenggu dan rantai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Saat itu pada kari kiamat, kamu akan melihat orang-orang kafir diikat dengan rantai. Masing-masing mereka diikat dengan setan yang menggoda mereka. Al-Ashfad adalah ikatan rantai yang diletakkan di kedua tangan dan kaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari itu} hari kiamat {kamu akan melihat orang-orang yang berdosa diikat dengan belenggu} mereka diikat satu sama lain dengan ikatan dan belenggu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “Dan kamu akan melihat orang-orang yang berdosa”, yaitu orang-orang yang melekat padanya ciri kejahatan dan banyak dosa pada hari itu “diikat bersama-sama dengan belenggu”, maksudnya setiap orang yang berbuat dosa dirantai dengan belenggu dari neraka. Mereka pun digiring menuju siksaan dalam kondisi yang sangat nista, buruk, lagi menjijikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مُّقَرَّنِينَ) muqarraniin : tangan dan kaki mereka terikat ke tengkuk mereka. (فِي ٱلۡأَصۡفَادِ) fil ashfaad : al-ashfaad bentuk jamak dari shafad, yaitu ikatan dari tali atau yang lainnya. Makna ayat : (وَتَرَى ٱلۡمُجۡرِمِينَ) “Dan engkau akan melihat pada hari itu, orang-orang yang dosa” wahai Rasul Kami, engkau akan melihat (مُّقَرَّنِينَ فِي ٱلۡأَصۡفَادِ) “diikat dengan belenggu.” Tangan dan kaki diikat ke leher mereka, mereka adalah orang-orang yang berbuat dosa syirik, zalim, keburukan, dan kerusakan, mereka berbuat kejahatan kepada diri mereka sendiri dahulu, kemudian kepada orang lain, sama saja entah ia termasuk yang berbuat zalim kepada yang lain dengan mengganggu mereka atau membawa dan mengajak mereka menuju kesyirikan, semuanya telah berbuat kejahatan atas hak-hak mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 49: Yakni orang-orang yang dosa menjadi sifatnya karena sering melakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 49",
    "description": "Pada hari itu engkau atau siapa pun akan melihat orang yang berdosa bersama-sama dengan rekan-rekan mereka, diikat dengan belenggu yang panas membara. Pakaian mereka terbuat dari cairan aspal yang mempercepat pembakaran, dan wajah mereka ditutup oleh kobaran api neraka yang menyalanyala."
  }
]