[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus Musa kepada bani israil dan kami kuatkan dia dengan membawa mukjizat-mukjizat yang menunjukan kebenarannnya, dan kami perintahkan dia untuk menyeru mereka kepada keimanan, supaya mengentaskan mereka dari kesesatan menuju hidayah, dan mengingatkan mereka akan nikmat-nikmat Allah dan siksa-siksaNya pada hari-hari Allah (menimpakan siksaan pada orang-orang kafir). Sesungguhnya pada peringatan ini benar-benar terdapat petunjuk-petunjuk bagi setiap orang yang sabar dalam ketaatan kepada Allah, dan dalam menjauhi apa-apa yang diharamkan Allah dan dalam mengahadapi takdir-takdir Allah, lagi banyak bersyukur dan melaksanakan hak-hak Allah; bersyukur kepada Allah atas nikmat-nikmatNya. Dan Allah menghususkan dua sifat ini untk disebutkan, sebab sesungguhnya mereka itulah orang-orang yang akan mengambil pelajaran dengannya dan tidak lalai darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sungguh Kami telah mengutus Musa dan Kami mendukungnya dengan mukjizat-mukjizat yang menunjukkan kebenarannya, bahwa dia diutus dari Rabbnya. Kami memerintahkannya agar mengeluarkan kaumnya dari kekufuran, kebodohan dan penghambaan menuju iman dan ilmu. Kami memerintahkannya agar mengingatkan kaumnya dengan hari-hari Allah yang saat itu Allah memberikan kenikmatan kepada mereka. Sesungguhnya hari-hari tersebut mengandung petunjuk kepada Tauhid Allah dan keagungan kodrat-Nya, pemberian nikmat-Nya kepada orang-orang Mukmin, pembalasan-Nya terhadap orang-orang yang berbuat dosa yang mendustakan. Ini yang bermanfaat bagi orang-orang sabar di atas ketaatan kepada Allah dan yang selalu bersyukur atas nikmat dan karunia-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Sungguh Kami telah mengutus Musa kepada Bani Israil dengan berbagai mukjizat yang dapat dilihat dan bukti-bukti yang dapat didengar yang menunjukkan kebenaran risalahnya. Kami memerintahkannya untuk menyeru mereka agar beriman kepada Allah, dan mengeluarkan mereka dari gelapnya kejahiliyahan menuju cahaya hidayah, serta memberi mereka pelajaran dari kejadian-kejadian yang menimpa umat-umat terdahulu. Sungguh dalam peringatan yang agung ini terdapat tanda-tanda yang jelas atas keesaan Allah, dan ibrah dan pelajaran bagi orang-orang yang bersabar dalam menghadapi cobaan dan bersyukur saat mendapat kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايٰتِنَآ (Dan sesungguhnya Kami telah mengutus Musa dengan membawa ayat-ayat Kami) Yakni Sembilan mukjizat yang diberikan kepada Nabi Musa. أَنْ أَخْرِجْ قَوْمَكَ(Keluarkanlah kaummu) Yakni, dan Kami firmankan kepadanya dalam risalahnya “bebaskanlah bani Israil yang berada dalam kekuasaan dan perbudakan Fir’aun!” مِنَ الظُّلُمٰتِ (dari gelap gulita) Yakni dari kekafiran, atau kebodohan, atau dari perbudakan. إِلَى النُّورِ(kepada cahaya terang benderang) Menuju keimanan, atau ilmu, atau kemerdekaan. وَذَكِّرْهُم بِأَيَّىٰمِ اللهِ ۚ( dan ingatkanlah mereka kepada hari-hari Allah) Yakni ingatkanlah kepada musibah dan kenikmatan yang Allah berikan kepada mereka. Serta kepada siksaan Allah yang telah ditimpakan atas kaum Nabi Nuh, ‘Aad, dan Tsamud. إِنَّ فِى ذٰلِكَ(Sesunguhnya pada yang demikian itu) Yakni pada peringatan kepada hari-hari Allah itu. لَاٰيٰتٍ(terdapat tanda-tanda) Tanda yang agung yang menunjukkan keesaan dan kekuasaan Allah. لِّكُلِّ صَبَّارٍ(bagi setiap orang penyabar) Yang senantiasa bersabar atas ujian dan cobaan. شَكُورٍ(dan banyak bersyukur) Yang senantiasa bersyukur atas kenikmatan yang diberikan Allah kepadanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ } \"dan ingatkanlah mereka kepada hari-hari Allah\" hari yang mereka hidup di dalamnya yang penuh nikmat juga hari-hari yang di dalamnya penuh dengan penderitaan agar mereka bersyukur dan mengontrol diri dengan cara bersabar; oleh karena itu diakhiran ayat Allah mengatakan : { ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ } \"Sesunguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi setiap orang penyabar dan banyak bersyukur\" karena dengan mengingat nikmat seseorang akan terbawa kepada kesyukuran; adapun mengingat penderitaan dan cobaan akan membawa diri kita kepada kesabaran dalam mengerjakan perintah sekalipun diri kita membencinya, juga bersabar dari perkara yang dilarang meskipun itu menjadi dambaan baginya. 2 ). { وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ } Ulama sepakat akan keindahan ayat ini, ayat yang paling baik untuk diingat oleh seseorang tatkala nikmat Allah terus bertambah untuknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya Kami telah mengutus Musa dengan membawa ayat-ayat dan sembilan mukjizat dari Kami, yaitu kepada Fir’aun dan para pengikutnya. Kami perintahkan kepadanya dalam risalah: “Keluarkanlah kaummu Bani Israil dari kegelapan kekufuran dan kebodohan kekuasan Fir’aun menuju cahaya keimanan dan ilmu yang terang benderang. Dan ingatkanlah mereka atas hari-hari dimana Allah membinasakan generasi terdahulu dan dimana Allah menyelamatkan orang-orang yang mau beriman”. Sesunguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi setiap orang penyabar dan banyak bersyukur terhadap nikmat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus Musa dengan ayat-ayat Kami} dengan dalil-dalil dan bukti-bukti Kami yang menunjukkan pada kebenarannya {“Keluarkanlah kaummu dari berbagai kegelapan menuju cahaya} dari kekufuran menuju keimanan {dan ingatkanlah mereka tentang hari-hari Allah”} nikmat dan murka Allah {Sesungguhnya pada yang demikian itu terdapat tanda-tanda} petunjuk {bagi setiap orang yang sangat penyabar lagi banyak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah memberitahukan bahwa Dia mengirim Musa dengan dibekali ayat-ayat (tanda-tanda kebesaran Allah) yang agung, yang menunjukkan kejujuran dan kebenaran misi yang dia bawa. Dan Allah telah memerintahkan Musa dengan sesuatu yang juga Dia perintahkan kepada RasulNya Muhammad, bahkan kepada seluruh RasulNya dan kaum mereka, yaitu “Keluarkanlah kaummu dari gelap gulita kepada cahaya terang benderang”, dari kegelapan kebodohan, kekufuran dan cabang-cabangnya menuju cahaya ilmu, iman, dan ranting-rantingnya. “Dan ingatkanlah mereka kepada hari-hari Allah”, dengan nikmat-nikmatNya seta curahan kebaikanNya pada mereka, mengingatkan sejarah-searah tentang umat-umat yang mendustakan (ajaran Allah) serta peristiwa-peristiwa yang Allah timpakan kepada orang-orang kafir. Tujuannya, agar mereka mensyukuri nikmat-nikmatNya dan berhati-hati dari siksaNya. “Sesungguhnya pada yang demikian itu,” sejarah-sejarah ketentuan Allah terhadap hamba-hambaNya, “terdapat tanda—tanda (kekuasaan Alllah) bagi setiap orang yang penyabar lagi banyak bersyukur,” yaitu orang yang sangat sabar terhadap kesengsaraan, kesulitan, dan himpitan hidup, bersyukur atas kesenangan dan kenikmatanNya. Sesungguhnya kejadian-kejadian (yang telah Alllah tentukan) bisa dijadikan bukti kesmpurnaan kekuasaanNya dan luasnya kebaikanNya serta paripurnanya sifat keadilan dan kebijaksanaanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِ‍َٔايَٰتِنَآ) biaayaatinaa : “dengan ayat-ayat Kami.” Yaitu mukjizat yang sembilan; tongkat, tangan, banjir, belalang, kutu, katak, darah, paceklik, kekeringan, dan berkurangnya buah-buahan. (وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ) wa dzakkirhum bi ayyaamillah : “dan ingatkan mereka dengan hari-hari Allah.” Yaitu dengan cobaan dan nikmat-Nya. Makna ayat : Firman-Nya : (وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ) “Dan telah Kami utus Musa” yaitu Musa, nabi Bani Israil (بِ‍َٔايَٰتِنَآ) “dengan ayat-ayat Kami” yaitu dengan argumen-argumen dan dalil Kami yang menguatkan risalahnya dan menujukkan kebenaran seruannya, yaitu sembilan mukjizat di antaranya, tangan dan tongkat (أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ) “Agar engkau mengeluarkan kaummu dari kegelapan menuju cahaya” yaitu keluarkanlah kaummu dari kegelapan syirik menuju cahaya tauhid, (وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ) “dan ingatkanlah mereka akan hari-hari Allah.” Yaitu Kami katakan kepadanya, “Ingatkanlah mereka tentang hari-hari Allah.” Ujian dan nikmat-Nya, ketika Dia menyelamatkan mereka dari siksaan keluarga Fir’aun dan memberi mereka nikmat seperti manna dan salwa, agar mereka bersyukur kepada Allah dengan taat kepada-Nya dan Rasul-Nya. Firman-Nya : (إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ) “yang demikian terdapat tanda-tanda bagi setiap orang yang bersabar dan bersyukur.” Pada peringatan akan ujian dan nikmat ada petunjuk-petunjuk yang menandakan akan karunia-karunia Allah dan nikmat-Nya yang berkonsekuensi syukur. Namun yang mendapatkan tanda-tanda pada peringatan itu hanya mereka orang-orang yang bersabar dan bersyukur, bahkan mereka banyak bersabar dan bersyukur, adapun selain mereka maka mereka tidak melihat darinya suatu tanda dan alamat. Pelajaran dari ayat : • Keutamaan memberi peringatan dengan kebaikan dan syukur agar mensyukuri Allah dan bertakwa kepada-Nya. • Keutamaan sabar dan syukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 5: Yang menunjukkan kebenarannya. Bani Israil. Yang dimaksud dengan hari-hari Allah adalah peristiwa yang telah terjadi pada umat-umat terdahulu serta nikmat dan siksa yang dialami mereka. Dengan mengingat hal itu, seseorang dapat mengetahui sempurnanya kekuasaan Allah, meratanya ihsan-Nya, sempurnanya keadilan dan hikmah-Nya. Ketika menderita. Ketika mendapatkan nikmat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 5",
    "description": "Di antara para rasul yang kami utus itu adalah nabi musa. Dan sungguh, kami telah mengutus nabi musa kepada bani israil dengan membawa tanda-tanda kami, yakni berbagai mukjizat yang membuktikan kebenarannya, dan kami perintahkan kepadanya, wahai nabi musa, keluarkanlah kaummu dari kegelapan (penindasan firaun) kepada cahaya terang-benderang (pengesaan kepada Allah) dan ingatkanlah mereka kepada hari-hari ketika Allah menurunkan nikmat dan azab-Nya kepada mereka. Sungguh, pada yang demikian itu terdapat tanda-tanda kekuasaan Allah bagi setiap orang penyabar atas ketentuan Allah dan banyak bersyukur atas nikmat-Nya. Dan, wahai nabi Muhammad, tuturkanlah kepada kaummu suatu kisah ketika musa berkata kepada kaumnya (bani israil) sembari mengingatkan mereka tentang hari-hari Allah, ingatlah nikmat Allah atasmu ketika dia yang maha pengasih dan penyayang menyelamatkan kamu dari kekejaman pengikut-pengikut fir'aun. Mereka atas perintah fir'aun menyiksa kamu dengan siksa yang pedih, dan menyembelih anak-anakmu yang laki-laki yang baru lahir untuk memastikan tidak akan ada anak laki-laki dari bani israil yang kelak menggulingkan takhtanya, dan membiarkan hidup dengan hina anak-anak perempuanmu. Ingatlah bahwa pada yang demikian itu terdapat suatu cobaan dan ujian yang besar dari tuhanmu. Dia hendak menguji apakah mereka bersyukur atas penyelamatan itu dan mengikuti ajaran nabi musa ataukah sebaliknya."
  }
]