[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pakaian-pakaian mereka berasal dari cairan teer yang teramat mendidih, dan api neraka menutupi waajah mereka lalu membakarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49 dan 50. Kamu -wahai Rasul- melihat pada hari di mana bumi diganti dengan bumi lain, langit-langit diganti dengan lainnya, orang-orang kafir dan orang-orang musyrikin dibelenggu, sebagian diikat dengan sebagian lainnya, tangan-tangan dan kaki-kaki mereka dibelenggu ke leher mereka dengan rantai, pakaian yang mereka kenakan adalah belangkin (ter) yang sangat mudah terbakar, api neraka meliputi wajah-wajah mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. سَرَابِيلُهُم مِّن قَطِرَانٍ (Pakaian mereka adalah dari pelangkin) Yakni pakaian mereka dari ter panas yang dioleskan di kulit mereka. Dipakai ter karena sangat mudah terbakar dan memiliki bau busuk yang menyengat. وَتَغْشَىٰ وُجُوهَهُمُ النَّارُ (dan muka mereka ditutup oleh api neraka) Wajah mereka terbakat karena diliputi api neraka. Allah menyebutkan wajah karena ia adalah anggota badan yang paling mulia dan terdapat berbagai panca indra."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hikmah dibalik pemilihan ( قطران ) pelankin sebagai pakaian penghuni neraka dalam ayat ini karena jenis itu memiliki kekhususan yang unik : panas jika digunakan dikulit, cepat menyala ketika didekatkan dengan api, baunya yang busuk, warnyanya yang hitam. Namun ketahuilah bahwa perbedaan antara benda ini ketika di dunia dan di akhirat, seperti perbedaan antara api dunia dan api neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Pakaian mereka dari Qathran (sesuatu hitam yang berbau busuk) yang melapisi kulit-kulit mereka. Api menyala-nyala sampai wajah mereka dan membakar jasad mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pakaian mereka} pakain mereka {dari cairan} bahan berwarna hitam yang berbau busuk dan menyala-nyala {dan wajah mereka ditutup} ditutup {api neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Pakaian mereka”, yaitu pakaian-pakaian mereka “adalah dari cairan ter”, hal itu karena begitu dahsyatnya nyala neraka di tengah mereka, tingkat suhu panasnya serta kebusukan bau, “dan muka mereka ditutup”, yang merupakan bagian yang paling mulia pada raga mereka “oleh api neraka”, api mengitarinya, membakarnya dari segala sisi. Sudah tentu, bagian selain wajah akan lebih parah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سَرَابِيلُهُم) saraabiiluhum : pakaian mereka yang mereka kenakan dari aspal. Makna ayat : (سَرَابِيلُهُم) “Pakaian mereka” baju mereka yang mereka pakai (مِّن قَطِرَانٖ) “dari pelangkin (ter)” bahan yang digunakan untuk melumuri unta, cairan hitam yang dapat membakar tubuh, atau tembaga jika ayat ini dibaca : (قِطْرٍ آنٍ) yaitu dari tembaga yang dipanaskan hingga level panas tertinggi. (وَتَغۡشَىٰ وُجُوهَهُمُ ٱلنَّارُ) “dan wajah mereka ditutupi api neraka.” Api nereka menutupi wajah mereka, mereka lah orang-orang yang telah berbuat kejahatan di dunia dengan kesyirikan dan maksiat. Inilah balasan bagi mereka pada hari kiamat nanti, Allah memperlakukan mereka seperti ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 50: Karena ia lebih cepat menyalakan api, panas dan bau. Yang merupakan anggota badan yang paling mulia. Jika muka sampai ditutupi api, lalu bagaimana dengan anggota badan yang lain, wal ‘iyaadz billah. Yang demikian bukanlah karena Allah Ta’ala zalim kepada mereka, akan tetapi merekalah yang menzalimi dirinya sendiri. Oleh karena itu Dia berfirman pada ayat selanjutnya, “Agar Allah memberi balasan kepada setiap orang terhadap apa yang dia usahakan” baik perbuatan baik maupun perbuatan buruk dengan adil yang tidak diselipi kezaliman sedikit pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 50",
    "description": "Pakaian mereka terbuat dari cairan aspal yang mempercepat pembakaran, dan wajah mereka ditutup oleh kobaran api neraka yang menyalanyala. Itu semua dilakukan agar Allah terbukti memberi balasan kepada setiap orang durhaka terhadap apa yang telah dia usahakan di dunia. Sungguh, Allah mahacepat perhitungan-Nya, mahatepat, dan mahaadil."
  }
]