[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah melakukan itu terhadap mereka sebagai balasan bagi mereka atas apa yang mereka usahakan berupa perbuatan dosa-dosa di dunia. Dan Allah akan membalas setiap manusia berdasarkan apa yang ia perbuat, yang baik maupun yang buruk. Sesungguhnya Allah mahacepat perhitungannNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Allah hendak membalas setiap jiwa atas apa yang dilakukannya; kebaikan atau keburukan, sesungguhnya Allah Mahacepat hisab-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. لِيَجْزِىَ اللهُ كُلَّ نَفْسٍ مَّا كَسَبَتْ ۚ (agar Allah memberi pembalasan kepada tiap-tiap orang terhadap apa yang ia usahakan) Baik itu perbuatan baik maupun buruk. إِنَّ اللهَ سَرِيعُ الْحِسَابِ(Sesungguhnya Allah Maha cepat hisab-Nya) Tidak ada yang dapat menyibukkannya. Allah menghisab semua makhluk dalam waktu yang sama, hisab terhadap seseorang tidak akan menyibukkan-Nya dari hisab makhluk-Nya yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Mereka keluar dari kubur supaya Allah membalas setiap jiwa sesuai apa yang dia kerjakan di dunia berupa kebaikan dan keburukan. Sesungguhnya Allah itu Maha Cepat dalam menghisab seluruh makhluk dalam setengah hari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Allah memberi balasan kepada setiap orang atas apa yang dia usahakan. Sesungguhnya Allah Maha cepat perhitunganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Penyiksaan itu bukanlah bentuk tindak kezhaliman Allah (terhadap mereka). Itu hanyalah bentuk balasan atas amalan yang mereka kerjakan dan usahakan. Oleh karena itu, Allah berfirman, “agar Allah memberi pembalasan kepada tiap-tiap orang terhadap apa yang dia usahakan”, berupa amalan yang baik maupun yang jelek dengan keadilan dan tidak berat sebelah, yang tidak berisi kezhaliman dalam kondisi apa pun. “Sesungguhnya Allah Mahacepat hisabNya”, seperti Firman Allah \"(Al-Anbiya:1). Pengertian ayat ini juga bisa (mengarah pada realita) bahwa Allah sangat cepat perhitunganNya. Mampu menjalankan (perhitungan amalan) semua makhluk dalam satu waktu, sebagaimana Allah mencurahkan rizki, mengatur mereka dengan berbagai aturan dalam sekejap saja. Tidak ada urusan yang menyibukkan kepentingan urusan lain. Yang demikian itu tidakklah sukar bagi Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (هَٰذَا بَلَٰغٞ) haadzaa balaagh : Al-Qur’an ini adalah peringatan bagi seluruh manusia. (أُوْلُواْ ٱلۡأَلۡبَٰبِ) ulul albaab : orang yang memiliki akal. Makna ayat : (لِيَجۡزِيَ ٱللَّهُ كُلَّ نَفۡسٖ مَّا كَسَبَتۡۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ) “Sebagai balasan Allah atas apa yang dilakukan oleh setiap jiwa. Sungguh Allah sangat cepat perhitungan-Nya.” Maka tidaklah hanya tinggal di dunia, dan kemudian berakhir di dalam neraka Jahanam dan tinggal di tengah-tengah panasnya, seperti orang yang masuk dari satu pintu dan keluar dari pintu yang lain. Terakhir, Allah ta’ala berfirman : (هَٰذَا بَلَٰغٞ لِّلنَّاسِ وَلِيُنذَرُواْ بِهِۦ وَلِيَعۡلَمُوٓاْ أَنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ وَلِيَذَّكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ) “Ini adalah peringatan bagi manusia, agar mereka diberi peringatan dengannya, dan agar mereka mengetahui bahwa Dia adalah Tuhan Yang Esa, dan supaya orang-orang yang berakal dapat mengambil pelajaran.” Yaitu, Al-Qur’an ini dalah peringatan bagi manusia dari Rabb manusia, telah disampaikan kepada mereka melalui Rasul Rabb manusia (وَلِيُنذَرُواْ بِهِۦ) “agar mereka diberi peringatan darinya” dengan apa yang ada di dalamnya berupa nasihat-nasihat, pelajaran, gambaran berbagai jenis siksaan dan kebinasaan bagi pelaku kejahatan, keburukan, dan kerusakan. (وَلِيَعۡلَمُوٓاْ) “dan agar mereka mengetahui” hujjah, dalil, dan petunjuk (أَنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ) “bahwa Dia adalah Tuhan Yang Esa” satu-satunya sesembahan, tidak ada yang lain, Dialah Allah jalla jalaaluhu, sehingga mereka tidak boleh menyekutukannya dalam beribadah, karena Dialah Rabb dan Tuhan yang sebenarnya, selain-Nya adalah batil. (وَلِيَذَّكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ) “dan supaya orang-orang yang berakal dapat mengambil pelajaran.” Orang-orang yang berakal mengambil pelajaran dari Al-Qur’an, sehingga mereka mengetahui cara menyelamatkan diri mereka dari kemurkaan Allah dan azab-Nya, dan mereka memperoleh kemenangan dengan rahmat dan ridha-Nya. Pelajaran dari ayat : • Penjelasan mengenai sebab adanya kebangkitan akhir, yaitu untuk membalas setiap perbuatan yang ada di dunia. • Firman-Nya ta’ala pada akhir surat ini (هَٰذَا بَلَٰغٞ لِّلنَّاسِ وَلِيُنذَرُواْ بِهِۦ وَلِيَعۡلَمُوٓاْ أَنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ وَلِيَذَّكَّرَ أُوْلُواْ ٱلۡأَلۡبَٰبِ ) ini bisa menjadi pokok dari Al-Qur’anul Karim, karena ayat ini menunjukkan inti dari pembahasan dengan perkataan yang simpel dan susunan kata yang indah. Dan segala puji bagi Allah, pertama maupun terakhir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 51: Ada yang mengatakan, bahwa maksudnya Allah Subhaanahu wa Ta'aala menghisab makhluk dalam satu waktu sebagaimana Dia memberi rezeki dan mengatur mereka dalam satu detik, tidak disibukkan oleh sesuatu dan yang hal itu tidaklah sulit bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 51",
    "description": "Itu semua dilakukan agar Allah terbukti memberi balasan kepada setiap orang durhaka terhadap apa yang telah dia usahakan di dunia. Sungguh, Allah mahacepat perhitungan-Nya, mahatepat, dan mahaadil. Al-qur'an ini adalah penjelasan yang sempurna bagi manusia untuk kebahagiaan mereka di dunia dan akhirat; agar mereka diberi peringatan dengannya, agar mereka mengetahui bahwa dia adalah tuhan yang maha esa, dan agar orang yang berakal mengambil pelajaran dari Al-Qur'an tersebut."
  }
]