[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-qur’an yang Kami turunkan padamu ini wahai rasul, merupakan penjelasan dan pemberitahuan bagi sekalian manusia, untuk menasihati dan memperingatkan mereka, dan agar mereka meyakini bahwa sesungguhnya Allah itulah tuhan sembahan yang Maha esa, sehingga mereka kemudian menyembahNya semata, tidak mempersekutukanNya, dan agar orang-orang yang berakal sehat memetik pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- ini adalah pemberitahuan Allah kepada manusia agar mereka merasa takut terhadap peringatan keras tentang azab Allah yang ada di dalamnya dan agar mereka mengetahui bahwa sesembahan yang hak hanya Allah semata, lalu mereka menyembah-Nya dan tidak menyekutukan-Nya dengan apa pun dan agar orang-orang yang berakal lurus mengambil nasihat dan pelajaran, karena mereka adalah orang-orang yang mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Al-Qur’an yang mulia ini merupakan penjelasan bagi seluruh manusia dan jin agar mereka mendapat nasehat dan peringatan dari kisah-kisah, pelajaran-pelajaran, dan hukum-hukum yang ada di dalamnya; dan agar mereka mengetahui bukti-bukti di dalamnya yang menunjukkan keesaan Allah; serta agar orang-orang yang memiliki akal yang sehat dapat mengambil ibrah dan pelajaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. هٰذَا بَلٰغٌ لِّلنَّاسِ ((Al Quran) ini adalah penjelasan yang sempurna bagi manusia) Yakni penyampaian yang sempurna dalam pelajaran dan peringatan bagi seluruh manusia. وَلِيَعْلَمُوٓا۟ أَنَّمَا هُوَ إِلٰهٌ وٰحِدٌ (dan supaya mereka mengetahui bahwasanya Dia adalah Tuhan Yang Maha Esa) Agar lewat ayat-ayat kauniyah yang telah disebutkan sebelumnya dan lewat ayat-ayat qur’aniyah yang ada dalam surat ini mereka dapat mengetahui keesaan Allah yang tidak memiliki sekutu. وَلِيَذَّكَّرَ أُو۟لُوا۟ الْأَلْبٰبِ(dan agar orang-orang yang berakal mengambil pelajaran) Agar orang-orang yang berakal dapat mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Al-Qur’an ini diturunkan oleh Allah untuk menjelaskan kepada seluruh manusia tentang hukum-hukum syariat dan akidah, memberikan peringatan dan pelajaran bagi mereka dan untuk memberitahu mereka bahwa sesungguhnya Allah adalah Tuhan yang Esa, tiada sekutu dan sesembah selain Dia, serta agar orang-orang yang memiliki akal sehat untuk berpikir dan merenung bisa mengambil pelajaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ini} Al-Qur’an ini {adalah penjelasan} penjelasan dan pelajaran {bagi manusia agar mereka diberi peringatan} diperingatkan {dengannya, agar mereka mengetahui bahwa Dia adalah Tuhan Yang Maha Esa, dan agar orang yang berakal mengambil pelajaran} mengambil pelajaran."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Setelah menjelaskan keterangan yang nyata tentang al-Quran ini, Allah berfirman “(Al-Quran) ini adalah penjelasan yang sempurna bagi manusia”, mereka mempersiapkan dan membekali diri dengannya menuju tingkatan tertinggi dan kemulliaan teristimewa. Karena Al-Quran memuat prinsip-prinsip (al-Ushul), cabang-cabang, dan seluruh pengetahuan yang diperlukan oleh para hamba. “Supaya mereka diberi peringatan”, karena di dalamnya mengandung peringatan dari tindakan-tindakan buruk dan siksaan yang Allah persiapkan bagi para pelakunya. “Dan supaya mereka mengetahui bahwasanya Dia adalah Tuhan Yang Maha Esa”, di mana Allah telah menguraikan dalam al-Quran dalil-dalil dan bukti-bukti nyata mengenai uluhiyah (hak disembah) dan wihdaniyah (keesaan) Nya hingga telah menciptakan sebuah keyakinan yang haq. “Dan agar orang-orang yang berakal mengambil pelajaran”, yaitu akal-akal yang sempurna. (Yaitu) orang-orang yang bermanfaat bagi mereka (darinya), lantas mengerjakannya sedangkan hal-hal yang membahayakan mereka maka (segera) mereka tinggalkan. Dengan tindakan ini, mereka menjadi orang-orang yang berakal dan bermata hati jernih. Pasalnya, melalui al-quran itu, pengetahuan dan pikiran-pikiran mereka semakin meningkat, pola pikir mereka bersinar lantaran memetiknya langsung dalam keadaan utuh masih segar. Sesunggguhnya al-Quran itu tidaklah mengajak kecuali kepada akhlak yang paling luhur dan amalan yang paling utama. Tidak menguatkan pandangan itu kecuali dengan bukti yang paling kuat dan paling jelas. Kaidah ini, jika seseorang cerdik melatih diri dengannya, maka dia akan senantiasa berada di tangga atas dan selalu menanjak naik selamanya dalam setiap budi pekerti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 52: Setelah Allah menerangkan demikian jelas, Allah Subhaanahu wa Ta'aala memuji hal itu dengan firman-Nya di atas. Dengannya mereka dapat mencapai kedudukan yang tinggi karena kandungannya yang berisi ushul (dasar-dasar), furu’ (cabang-cabang), dan segala ilmu yang dibutuhkan manusia. Karena di dalamnya terdapat tarhib (ancaman untuk menakut-nakuti) terhadap perbuatan buruk agar manusia menjauhinya. Di dalamnya Allah Subhaanahu wa Ta'aala mengulang-ulang bukti dan dalil terhadap keesaan-Nya. Mereka dapat mengingat hal yang memberi manfaat bagi mereka sehingga mereka lakukan, dan dapat mengingat hal yang berbahaya sehingga mereka tinggalkan. Dengan demikian, dengan Al Qur’an pengetahuan dan pandangan mereka semakin dalam dan tajam. Selesai surah Ibrahim, wal hamdulillahi rabbil ‘aalamiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 52",
    "description": "Al-qur'an ini adalah penjelasan yang sempurna bagi manusia untuk kebahagiaan mereka di dunia dan akhirat; agar mereka diberi peringatan dengannya, agar mereka mengetahui bahwa dia adalah tuhan yang maha esa, dan agar orang yang berakal mengambil pelajaran dari Al-Qur'an tersebut. Alif laam raa'. Ayat-ayat pada surah ini adalah sebagian dari ayat-ayat kitab yang sempurna, yaitu ayat-ayat Al-Qur'an yang memberi penjelasan."
  }
]