[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebutkanlah wahai rasul, kepada kaummu kisah Musa ketika dia berakta kepada bani israil, ”ingatlah nikmat-nikmat Allah pada kalian, ketika Dia menyelamatkan kalian dari fir’aun dan para pengikutnya yang menimpakan pada kalian siksaan yang amat pedih, dan menyembelih anak-anak laki-laki kalian sehingga tidak ada seorangpun dari mereka yang muncul berkuasa atas kerajaan fir’aun, dan membiarkan anak-anak perempuan hidup untuk menjadi pembantu dan terhina. Dan pada cobaan dan penyelamatan mereka darinya tersirat ujian besar bagi kalian dari tuhan kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Ingatlah -wahai Rasul- manakala Musa melaksanakan perintah Rabbnya, dia berkata kepada kaumnya Bani Israil mengingatkan mereka terhadap nikmat-nikmat Allah atas mereka, “Wahai kaumku, ingatlah nikmat-nikmat Allah kepada kalian manakala Allah menyelamatkan kalian dari Fir'aun dan bala tentaranya, menyelamatkan kalian dari siksaan mereka yang paling buruk atas kalian, mereka menyembelih bayi laki-laki kalian agar tidak ada anak laki-laki kelak yang akan menumbangkan kekuasaan Fir'aun dan mereka membiarkan anak-anak perempuan hidup agar mereka bisa merendahkan dan melecehkan anak-anak perempuan itu. Apa yang mereka lakukan terhadap kalian ini merupakan ujian besar bagi kesabaran kalian, maka Allah membalas kalian atas kesabaran kalian itu dengan menyelamatkan kalian dari siksaan Fir'aun dan bala tentaranya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah mengingatkan ketika Musa berkata kepada Bani Israil: “Ingatlah karunia Allah yang diberikan kepada kalian ketika Allah menyelamatkan para pendahulu kalian dari kezaliman Fir’aun dan para pengikutnya yang telah menyiksa mereka dengan azab yang berat, membunuh anak-anak laki-laki mereka, dan membiarkan hidup anak-anak perempuan mereka untuk mereka jadikan pelayan dan untuk mereka hinakan. Dan dalam azab yang menghinakan tersebut terdapat ujian yang besar dari Tuhan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِذْ أَنجَىٰكُم مِّنْ ءَالِ فِرْعَوْنَ (ketika Dia menyelamatkan kamu dari (Fir’aun dan) pengikut-pengikutnya) Yaitu ketika Nabi Musa telah membebaskan mereka dari negeri Mesir kemudian Allah membelah lautan bagi mereka dan menenggelamkan Fir’aun dan bala tentaranya. يَسُومُونَكُمْ سُوٓءَ الْعَذَابِ(mereka menyiksa kamu dengan siksa yang pedih) Yakni dengan memperbudak dan mempekerjakan mereka dengan pekerjaan yang sangat berat. وَيُذَبِّحُونَ أَبْنَآءَكُمْ(mereka menyembelih anak-anak laki-lakimu) Anak laki-laki kalian. وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ( membiarkan hidup anak-anak perempuanmu) Yakni membiarkan mereka tetap hidup untuk menghinakan mereka. وَفِى ذٰلِكُم(dan pada yang demikian itu) Yakni siksaan yang telah disebutkan itu. بَلَآءٌ مِّن رَّبِّكُمْ عَظِيمٌ(ada cobaan yang besar dari Tuhanmu) Yakni ujian bagi kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Ingatlah wahai Rasul, ketika Musa berkata kepada kaumnya: “Ingatlah nikmat Allah atasmu ketika Dia menyelamatkan kamu dari Fir’aun dan pengikut-pengikutnya dengan menenggelamkan mereka. Mereka menyiksa kamu dengan siksa yang pedih, menyuruh kamu menyembahnya, mereka menyembelih anak-anak laki-lakimu, membiarkan hidup anak-anak perempuanmu; dan pada yang demikian itu ada cobaan yang besar dari Tuhanmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Musa berkata kepada kaumnya,“Ingatlah nikmat Allah atas kalian ketika Dia menyelamatkan kalian dari pengikut-pengikut Fir‘aun. Mereka membuat kalian merasakan} membuat mereka merasakan {siksa yang pedih, mereka menyembelih anak-anak laki-laki kalian, dan membiarkan hidup anak-anak perempuan kalian. Pada yang demikian itu terdapat cobaan yang besar dari Tuhan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Oleh karenanya, Musa menaati perintah Rabbnya. Dia mengingatkan mereka tentang nikmat-nikmatNya pada mereka. Ia berkata, “Ingatlah nikmat Allah atasmu”, dengan hati dan lisan kalian “ketika Dia menyelamatkan kamu dari (Firaun dan) pengikut-pengikutnya, mereka menyiksa kamu,” mereka menimpakan pada kalian “siksa yang pedih,” maksudnya yang paling keras. Musa menjelaskannya dengan berkata, “Mereka menyembelih anak-anak laki-lakimu, membiarkan hidup anak-anak perempuanmu”, membiarkan mereka (para wanita), tidak membunuh mereka. “Dan pada yang demikian itu”, penyelamatan bagi mereka “ada cobaan yang besar dari Rabbmu”, yaitu kenikmatan agung atau maksudnya dalam siksaan (yang kalian teruji dengannya yang berasal dari Firaun dan para pembesarnya) terdapat ujian besar dari Allah, untuk melihat apakah kalian bersabar ataukah tidak?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَإِذۡ قَالَ مُوسَىٰ) wa idz qaala musaa : ingatlah ketika Musa berkata. (يَسُومُونَكُمۡ) yasuumuunakum : merek menimpakan kepada kalian. (وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ) wa yastahyuuna nisaa’akum : menyisakan perempuan-perempuan kalian. (بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ) balaa’um mir rabbikum ‘azhiim : cobaan dan ujian, baik dengan kebaikan atau keburukan. Makna ayat : (وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِ) “dan ketika Musa berkata kepada kaumnya” ingatlah wahai Rasul Kami, ketika Musa berkata kepada kaumnya Bani Israil : (ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ) “Ingatlah nikmat Allah atas kalian” yaitu agar mereka mensyukuri nikmat-nikmat itu dengan mentauhidkan dan taat kepada-Nya, karena barangsiapa ingat (kepada nikmat-nikmat itu) ia akan bersyukur. Kemudian menjelaskan kepada mereka sebuah nikmat, yaitu penyelamatan mereka dari Fir’aun dan petinggi-petingginya, manakala itu mereka menyiksa Bani Israil dengan pembunuhan dan pemusnahan, seraya berkata : (يَسُومُونَكُمۡ سُوٓءَ ٱلۡعَذَابِ) “menimpakan kepada kalian azab yang buruk.” Menjatuhkan kepada kalian azab yang kejam, yaitu seburuk-buruknya dan paling kejam, (وَيُذَبِّحُونَ أَبۡنَآءَكُمۡ) “dan menyembelih anak laki-laki kalian” anak laki-laki yang lahir, karena para dukun dan petinggi-petinggi berkata kepada Fir’aun, “Kejatuhan tahtamu tidak akan jauh lagi dan negerimu akan musnah di tangan seorang laki-laki dari Bani Israil.” Maka ia pun memerintahkan untuk membunuh setiap anak laki-laki yang lahir setelah ia dilahirkan, ia membunuh setiap laki-laki dan menyisakan perempuan sebagai pembantu, karena tidak adanya ancaman pada mereka, inilah makna dari firman-Nya : (وَيَسۡتَحۡيُونَ نِسَآءَكُمۡۚ) “dan membiarkan hidup anak-anak perempuan kalian.” Firman-Nya : (وَفِي ذَٰلِكُم بَلَآءٞ مِّن رَّبِّكُمۡ عَظِيمٞ) “dan pada hal itu terdapat cobaan yang besar dari Rabbmu.” siksaan sebagai cobaan keburukan, dan keselamatan dari siksaan sebagai cobaan kebaikan. Pelajaran dari ayat : • Disyariatkannya memberikan mengingatkan akan nikmat Allah agar kita bersyukur dan tidak kufur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 6: Baik dengan hati maupun dengan lisan Yang baru lahir. Mereka lakukan hal itu karena perkataan para dukun yang memberitahukan, bahwa bayi yang baru lahir di kalangan Bani Israil akan menjadi sebab hilangnya kerajaan Fir’aun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 6",
    "description": "Dan, wahai nabi Muhammad, tuturkanlah kepada kaummu suatu kisah ketika musa berkata kepada kaumnya (bani israil) sembari mengingatkan mereka tentang hari-hari Allah, ingatlah nikmat Allah atasmu ketika dia yang maha pengasih dan penyayang menyelamatkan kamu dari kekejaman pengikut-pengikut fir'aun. Mereka atas perintah fir'aun menyiksa kamu dengan siksa yang pedih, dan menyembelih anak-anakmu yang laki-laki yang baru lahir untuk memastikan tidak akan ada anak laki-laki dari bani israil yang kelak menggulingkan takhtanya, dan membiarkan hidup dengan hina anak-anak perempuanmu. Ingatlah bahwa pada yang demikian itu terdapat suatu cobaan dan ujian yang besar dari tuhanmu. Dia hendak menguji apakah mereka bersyukur atas penyelamatan itu dan mengikuti ajaran nabi musa ataukah sebaliknya. Dan ingatlah pula ketika tuhanmu memaklumkan suatu maklumat yang dikukuhkan, sesungguhnya aku bersumpah, jika kamu bersyukur atas nikmat-nikmat-ku kepadamu, niscaya aku akan menambah kepadamu nikmat lebih banyak lagi, tetapi sebaliknya, jika kamu mengingkari nikmat-ku, maka pasti azab-ku sangat berat."
  }
]