[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada mereka, ”dan ingatlah ketika tuhan kalian memberitahukan dengan pemberitahuan yang tegas, ’jika kalian beryukur kepadaNya atas nikmat-nikmatNya, pastilah Dia akan memberikan tambahan karunia kepada kalian, dan jika kalian mengingkari nikmat-nikmat Allah, niscaya dia benar-benar akan menyiksa kalian dengan siksaan yang pedih.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Musa berkata kepada mereka, “Ingatlah manakala Rabb kalian memberitahu kalian secara pasti, jika kalian bersyukur kepada Allah atas nikmat-nikmat-Nya yang telah Dia berikan kepada kalian, niscaya Dia akan menambahkan nikmat dan karunia-Nya kepada kalian. akan tetapi jika kalian mengingkari nikmat-nikmat-Nya atas kalian dan kalian tidak mensyukurinya, maka azab Allah atas siapa yang mengingkari nikmat-nikmat-Nya dan tidak mensyukurinya benar-benar berat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Musa juga berkata kepada mereka: “Dan ingatlah ketika Allah menyampaikan dengan tegas: ‘Sungguh jika kalian bersyukur kepada-Ku dengan perkataan dan perbuatan atas segala kenikmatan yang telah Aku berikan kepada kalian, niscaya Aku pasti menambah kenikmatan itu. Dan sungguh jika kalian mengingkari kenikmatan-kenikmatan tersebut, maka Aku akan mengazab kalian dengan azab yang keras’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِذْ تَأَذَّنَ رَبُّكُمْ (Dan (ingatlah juga), tatkala Tuhanmu memaklumkan) Yakni katika Allah menyeru agar kalian mendengar dan memahami firman-Nya. لَئِن شَكَرْتُمْ(Sesungguhnya jika kamu bersyukur) Yakni jika kalian mensyukuri kenikmatan yang Aku berikan kepada kalian sebagaimana yang telah disebutkan. لَأَزِيدَنَّكُمْ ۖ( pasti Kami akan menambah (nikmat) kepadamu) Niscaya Aku akan menambah ketaatanmu kepada-Ku dan menambah kenikmatan-Ku. وَلَئِن كَفَرْتُمْ(dan jika kamu mengingkari) Dan jika kalian mengingkari hal itu. إِنَّ عَذَابِى لَشَدِيدٌ(maka sesungguhnya azab-Ku sangat pedih) Sehingga kalian akan ditimpa oleh azab itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mintalah sesuatu yang kedudukannya paling tinggi dan urutannya paling diimpikan oleh setiap orang namun semuanya harus dengan ketaatan kepada Allah; karena sesungguhnya Allah tidak memberikan kepada siapapun dari kebaikannya kecuali dengan ketaatan kepada-Nya, dan barangsiapa yang tetap berada di jalan yang diinginkan oleh Allah, niscaya Allah akan menjadi penolong baginya untuk menggapai apa yang ia inginkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Ingatlah juga, tatkala Tuhanmu mengumumkan dan mengabarkan kepada kalian dengan sangat jelas; “Sesungguhnya jika kamu bersyukur dengan mengesakan dan melakukan ketaatan, pasti Kami akan menambah nikmat kepadamu, dan jika kamu mengingkari nikmat-Ku, maka sesungguhnya azab-Ku sangat pedih bagi mereka yang durhakan dan kufur”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Tuhan kalian memaklumkan} memberikan pemakluman dengan pasti {Sungguh jika kalian bersyukur, maka Aku akan menambah kepada kalian, tetapi jika kalian ingkar} menyangkal nikmatKu {sesungguhnya azabKu benar-benar sangat keras”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Dia berkata kepada kaumnya untuk menghimbau mereka supaya mensyukuri nikmat-nikmat Allah “Dan (ingatlah juga), tatkala Rabbmu memaklumkan,” maksudnya memberi tahukan dan menjanjikan “Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu”, dari nikmat-nikmatKu. “Dan jika kamu mengingkari (nikmatKu), maka sesungguhnya azabKu sangat pedih”, dan diantara bentuk siksaNya, adalah Allah akan melenyapkan nikmat yang telah Allah curahkan dari mereka. Bersyukur hakikatnya, pengakuan hati terhadap nikmat-nikmat Allah dan menyanjung Allah karenanya, serta mempergunakannya dalam keridhaan Allah. Sementara pengingkaran terhadap nikmat Allah mempunyai pengertian yang berlawanan dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَإِذۡ تَأَذَّنَ رَبُّكُمۡ) wa idz ta’adzdzana rabbukum : ketika Rabbmu memaklumatkan. Makna ayat : Firman-Nya : (وَإِذۡ تَأَذَّنَ رَبُّكُمۡ) “ketika Rabbmu memaklumatkan” ini adalah perkataan Musa kepada Bani Israil, yaitu ingatkanlah mereka ketika Rabbmu bersumpah kepada kalian (لَئِن شَكَرۡتُمۡ) “seandainya kalian bersyukur” atas nikmat-nikmat-Ku dengan beribadah kepada-Ku dan mengesakan-Ku dalam ibadah, mentaati-Ku dan utusan-Ku dengan mengikuti perintah-perintah dan menjauhi larangan-larangan (لَأَزِيدَنَّكُمۡۖ) “niscaya pasti Aku akan menambahnya” kenikmatan dan kebahagiaan (وَلَئِن كَفَرۡتُمۡ) “dan jika kalian ingkar” tidak bersyukur atas nikmat-nikmat-Ku, bermaksiat kepada-Ku dan rasul-Ku, niscaya akan Ku cabut kenikmatan itu dari kalian dan Aku menyiksa kalian dengan hilangnya kenikmatan tersebut. (إِنَّ عَذَابِي لَشَدِيدٞ) “Sungguh azab-Ku sangatlah pedih.” Maka berhati-hatilah darinya dan takutlah kepada-Ku. Pelajaran dari ayat : • Janji Allah ta’ala akan tambahan nikmat bagi yang bersyukur atas nikmat Allah kepadanya. • Ingkar kepada nikmat merupakan sebab hilangnya kenikmatan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 7: Mendorong mereka untuk bersyukur. Terhadap nikmat-Ku dengan bertauhid dan taat. Syaikh As Sa’diy menerangkan tentang pengertian syukur, yaitu mengakui dengan hati nikmat Allah, memuji Allah terhadapnya, dan mengarahkan nikmat tersebut untuk mencari ridha Allah Ta’ala, sedangkan kufur adalah kebalikan dari itu. Dengan tetap kafir, syirk dan berbuat maksiat. Termasuk di antaranya adalah dengan mencabut nikmat yang diberikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 7",
    "description": "Dan ingatlah pula ketika tuhanmu memaklumkan suatu maklumat yang dikukuhkan, sesungguhnya aku bersumpah, jika kamu bersyukur atas nikmat-nikmat-ku kepadamu, niscaya aku akan menambah kepadamu nikmat lebih banyak lagi, tetapi sebaliknya, jika kamu mengingkari nikmat-ku, maka pasti azab-ku sangat berat. Dan musa berkata untuk mengingatkan kaumnya bahwa mensyukuri nikmat Allah bukanlah untuk kepentingan Allah, jika kamu dan orang yang ada di bumi ini semuanya mengingkari nikmat Allah, maka sesungguhnya Allah mahakaya sehingga keingkaran mereka tidak akan sedikit pun mengurangi kekayaan-Nya, maha terpuji atas segala hal yang terjadi di alam semesta."
  }
]