[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dia berkata kepada mereka, ”jika kalian dan seluruh penghuni bumi kafir kepada Allah, maka kalian sekali-kali tidak dapat memudaratkan Allah sedikitpun. Sebab sesungguhnya Allah Maha kaya, tidak membutuhkan makhlukNya lagi berhak atas sega pujian dan sanjungan, Dia terpuji dalam setiap keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Musa berkata kepada kaumnya, “Wahai kaumku! Jika kalian kafir dan seluruh penduduk bumi juga kafir, maka efek negatifnya kembali kepada kalian sendiri, karena sesungguhnya Allah Mahakaya dengan diri-Nya, berhak untuk disanjung dengan sendiri-Nya, iman orang-orang Mukmin tidak memberi-Nya manfaat, kekufuran orang-orang kafir tidak merugikan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan Musa berkata kepada mereka: “Jika kalian dan seluruh penduduk bumi mengingkari segala kenikmatan Allah dan tidak mengakui keesaan-Nya, maka hal itu tidak akan mendatangkan mudharat bagi-Nya sedikitpun. Dia Maha Kaya dari seluruh makhluk-Nya dan Maha Terpuji dalam segala ketetapan yang Dia berikan atas mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَقَالَ مُوسَىٰٓ إِن تَكْفُرُوٓا۟ أَنتُمْ وَمَن فِى الْأَرْضِ جَمِيعًا (Dan Musa berkata: “Jika kamu dan orang-orang yang ada di muka bumi semuanya mengingkari) Yakni jika kalian dan makhluk lainnya mengingkari kenikmatan-Nya, dan tidak mau mensyukurinya. فَإِنَّ اللهَ لَغَنِىٌّ(maka sesungguhnya Allah Maha Kaya) Maha Kaya dan tidak membutuhkan rasa syukur kalian, dan itu tidak akan mengurangi kuasa-Nya sedikitpun. حَمِيدٌ (lagi Maha Terpuji) Yang menjadikan pujian kepada-Nya menjadi sebab bertambahnya kenikmatan. Dan manfaat dari pujian dan rasa syukur kalian kepada Allah akan kembali kepada kalian, yaitu dengan keridhaan Allah kepada kalian dan menambah karunia-Nya kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Musa berkata: “Jika kamu dan orang-orang yang ada di muka bumi semuanya mengingkari nikmat Allah maka sesungguhnya Allah Maha Kaya, Maha Tidak Butuh atas syukur kalian, Yang berhak atas segala puji atas berbagai anugerah nikmat-Nya kepada manusia lagi Maha Terpuji atas segala kekuasaan-Nya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata,“Jika kalian dan siapa pun yang ada di bumi semuanya ingkar, sesungguhnya Allah benar-benar Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Dan Musa berkata, ‘Jika kamu dan orang-orang yang ada di muka bumi semuanya mengingkari (nikmat Allah)”, maka kalian tidak akan pernah bisa membahayakan Allah sedikit pun. Sesungguhnya, Allah Mahakaya lagi Terpuji. Ketaatan-ketaatan (yang dikerjakan makhluk) tidak menambah apa pun dalam kerajaanNya. Demikian juga maksiat-maksiat (mereka) tidak mengurangi keutuhan kerajaanNya. Dia sempurna kekayaanNYa, terpui dalam Dzat, nama-nama, sifat-sifat, serta perbuatan-perbuatanNya. Dia tidak mempunyai sifat melainkan segala sifat yang mengandung pujian dan kesempurnaan, dan tidak bertindak kecuali segala tindakan yang baik."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (وَقَالَ مُوسَىٰٓ) “dan Musa berkata” kepada Bani Israil (إِن تَكۡفُرُوٓ) “seandainya kalian ingkar” mengingkari nikmat Allah tidak mensyukurinya dengan taat kepada-Nya (أَنتُمۡ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗا) “dan seluruh yang ada di bumi” juga ingkar kepada-Nya seluruh yang ada di bumi (فَإِنَّ ٱللَّهَ لَغَنِيٌّ) “Maka sesungguhnya Allah Maha Kaya” kepada seluruh makhluk-Nya tidak butuh kepada satupun dari makhluk-Nya (حَمِيدٌ) “Maha Terpuji” yaitu teruji karena nikmat-nikmat-Nya terhadap seluruh makhluk-Nya. Pelajaran dari ayat : • Penjelasan kekayaan Allah yang mutlak atas seluruh makhluk, maka manusia sekalipun mereka bersyukur, maka itu unutk diri mereka sendiri, dan seandainya mereka kufur maka itu untuk mereka sendiri. Syukur dan kufur semuanya kembali kepada diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 8: Maka kamu tidak dapat merugikan Allah sedikit pun juga. Allah tidak memerlukan syukur hamba-hamba-Nya, ketaatan yang mereka lakukan tidaklah menambah kerajaan-Nya, dan maksiat mereka pun tidak mengurangi kerajaan-Nya. Baik dzat-Nya, nama-Nya, sifat-Nya maupun perbuatan-Nya. Sifat yang dimiliki-Nya adalah sifat yang terpuji lagi sempurna. Semua nama-Nya indah, dan semua perbuatan-Nya baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 8",
    "description": "Dan musa berkata untuk mengingatkan kaumnya bahwa mensyukuri nikmat Allah bukanlah untuk kepentingan Allah, jika kamu dan orang yang ada di bumi ini semuanya mengingkari nikmat Allah, maka sesungguhnya Allah mahakaya sehingga keingkaran mereka tidak akan sedikit pun mengurangi kekayaan-Nya, maha terpuji atas segala hal yang terjadi di alam semesta. Janganlah kalian, wahai bani israil dan umat nabi Muhammad, mengingkari nikmat Allah. Apakah belum sampai kepadamu berita tentang kebinasaan orang-orang sebelum kamu, yaitu kaum nabi nuh, kaum 'a'd, kaum Å amud, dan orang-orang setelah mereka, seperti penduduk madyan, kaum tubba', dan lain-lain. Tidak ada yang mengetahui secara detail azab seperti apa yang mereka alami, selain Allah. Rasul-rasul telah datang kepada mereka membawa bukti-bukti yang nyata tentang kerasulan para utusan itu, berupa mukjizat dan penjelasan yang mudah dipahami oleh umat masing-masing, namun mereka menutupkan tangannya ke mulutnya dengan penuh kebencian dan penolakan, dan berkata, sesungguhnya kami tidak percaya sama sekali akan bukti bahwa kamu diutus kepada kami, dan kami benar-benar berada dalam keraguan yang sangat mendalam dan menggelisahkan hati kami terhadap apa yang kamu serukan kepada kami, berupa ajakan beriman dan bertauhid kepada Allah."
  }
]