[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah telah datang kepada kalian -wahai umat Muhammad- berita uamt-umat yang telah mendahului kalian, seperti kaum Nuh, kaum Hud, kaum Shaleh dan uamt-umat yang datang setelah mereka yang tidak dapat dihitung kecuali oleh Allah, rasul-rasul mereka telah datang kepada mereka dengan (membawa) bukti-bukti yang nyata, lalu mereka menggigit tangan-tangan mereka lantaran kegeraman dan keengganan menerima keimanan, dan mereka berkata kepada rasul-rasul mereka, ”sesungguhnya kami tidak beriman dengan risalah yang kalian bawa kepada kami, dan sesungguhnya kami benar-benar dalam keraguan terhadap keimanan yang kalian menyeru kami kepadanya dan pengesaan tuhan itu menyebabkan kebimbangan saja.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Apakah belum datang kepada kalian -wahai orang-orang kafir- berita tentang pembinasaan umat-umat yang mendustakan sebelum kalian, kaum Nuh, 'Ād kaum Hūd, Ṡamūd kaum Ṣāleḥ dan umat-umat yang datang sesudah mereka, jumlah mereka besar tidak terhitung kecuali oleh Allah? Para Rasul Allah datang kepada mereka dengan membawa bukti-bukti yang nyata. Mereka meletakkan tangan di mulut sambil menggigit jari-jari telunjuk mereka karena kesal terhadap para rasul tersebut. Mereka berkata kepada Rasul-rasul yang diutus kepada mereka, \"Sesungguhnya kami kafir kepada apa yang kalian diutus dengannya, sesungguhnya kami benar-benar dalam kebimbangan terhadap apa yang kalian dakwahkan dan selalu dalam keraguan\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Hai manusia, Belum datangkah kabar tentang umat-umat sebelum kalian yang mendustakan Allah seperti kaum Nuh, ‘Ad, Tsamud, dan kaum-kaum setelah mereka yang tidak ada yang mengetahui jumlahnya kecuali Allah? Para rasul telah datang kepada mereka dengan membawa bukti-bukti yang jelas, namun mereka malah menggigit jari-jari mereka karena kedengkian dan keengganan untuk beriman. Selain itu mereka juga berkata kepada para rasul mereka: “Kami tidak mengimani apa yang kalian datangkan itu, dan kami dalam keraguan yang membuat kami harus mencurigai segala perkara agama yang kalian serukan kepada kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَلَمْ يَأْتِكُمْ نَبَؤُا۟ الَّذِينَ مِن قَبْلِكُمْ (Belumkah sampai kepadamu berita orang-orang sebelum kamu) Bisa jadi ini merupakan perkataan Nabi Musa bagi kaumnya, dan bisa pula merupakan firman Allah yang ditujukan kepada umat Nabi Muhammad sebagai peringatan bagi mereka agar tidak menyelisihinya sebagaimana yang terjadi pada umat-umat terdahulu. وَالَّذِينَ مِنۢ بَعْدِهِمْ ۛ( dan orang-orang sesudah mereka) Yakni sesudah kaum-kaum yang disebutkan itu. لَا يَعْلَمُهُمْ إِلَّا اللهُ ۚ( Tidak ada yang mengetahui mereka selain Allah) Yakni tidak ada yang mengetahui jumlahnya kecuali Allah. فَرَدُّوٓا۟ أَيْدِيَهُمْ فِىٓ أَفْوٰهِهِمْ(lalu mereka menutupkan tangannya ke mulutnya) Yakni mereka memasukkan jari-jemari mereka ke dalam mulut untuk mereka gigit karena kemurkaan mereka atas apa yang dibawa oleh para Rasul, sebab para rasul membawa risalah yang membodohkan angan-angan mereka dan mencela berhala-berhala mereka. Pendapat lain mengatakan mereka meletakkan tangan mereka di mulut para rasul sebagai tanggapan atas apa yang para rasul ucapkan. وَإِنَّا لَفِى شَكٍّ مِّمَّا تَدْعُونَنَآ إِلَيْهِ (dan sesungguhnya kami benar-benar dalam keragu-raguan terhadap apa yang kamu ajak kami kepadanya) Yakni dalam keraguan tentang keimanan kepada Allah semata. مُرِيبٍ (yang menggelisahkan) Yakni apa yang kalian bawa kepada kami menimbulkan keraguan. Yakni itu merupakan hal yang tidak pasti, bagaimana kalian menghendaki agar kami beriman kepadanya? Kami meragukan kebenaran kenabian kalian. Dan bisa jadi mereka menuduh para rasul bahwa mereka memiliki niat yang mereka sembunyikan yaitu para rasul itu ingin berkuasa atas kaum mereka dan meraup harta dan kenikmatan dunia. Mereka mengatakan hal ini untuk mengendorkan keteguhan para rasul dan melemahkan semangat mereka dalam berdakwah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Musa menambahkan: “Apakah belum sampai kepadamu berita tentang orang-orang sebelum kamu yaitu kaum Nuh, ‘Ad, Tsamud dan orang-orang sesudah mereka. Tidak ada yang mengetahui mereka selain Allah. Telah datang rasul-rasul kepada mereka membawa bukti-bukti yang nyata lalu mereka menutupkan tangannya ke mulutnya (karena kebencian), dan berkata: “Sesungguhnya kami mengingkari risalah yang engkau bawa untuk disampaikan kepada kami, dan sesungguhnya kami benar-benar dalam keragu-raguan yang menggelisahkan terhadap risalah atau ajakanmu kepada kami berupa iman kepada Allah dan meninggalkan tuhan selain Dia, yaitu perkara yang tidak diyakini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah belum sampai kepada kalian berita} kabar {orang-orang sebelum kalian, yaitu kaum Nuh, ‘Ad, Tsamud, dan orang-orang setelah mereka. Tidak ada yang mengetahui mereka} Tidak ada yang (bisa) menghitung jumlah mereka {selain Allah. Para rasul telah datang kepada mereka dengan bukti-bukti yang nyata} petunjuk yang jelas {tetapi mereka menutupkan} meletakkan {tangan mereka ke mulut mereka dan berkata,“Sesungguhnya kami mengingkari sesuatu yang diperintahkan kepada kalian dan kami benar-benar dalam keraguan yang menggelisahkan} keraguan yang membebani {tentang apa yang kalian serukan kepada kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah berkata untuk menakut-nakuti para hambaNya dengan azab yang telah Dia timpakan kepada bangsa-bangsa yang mendustakan ketika telah didatangi oleh para rasul lalu mereka justru mengingkari para rasul. Maka Allah menghukumi mereka dengan siksaan cepat yang dapat disaksikan dan di dengar oleh orang-orang. Allah berfirman, “Belumkah sampai (kepada kamu) berita orang-orang sebelum kamu (yaitu) kaum NUh, ‘Ad, Tsamud”, sungguh Allah telah mengetengahkan cerita-cerita tentang mereka di dalam kitabNya dan menerangkannya dengan panjang lebar. “Dan orang-orang sesudah mereka. Tidak ada yang mengetahui mereka kecuali Allah”, karena jumlah mereka banyak dank arena sejarah-sejarah tentang mereka telah tertelan oleh masa. Mereka semua “para rasul telah datang kepada mereka (membawa) bukti-bukti yang nyata”, dengan bermacam-macam bukti tentang kebenaran yang mereka bawa. Allah tidaklah mengutus seorang rasul melainkan pasti dibekali dengan bukti-bukti yang menjadikan orang-orang beriman dengan mukjizat semacam itu. Ketika para rasul telah datang kepada mereka dengan membawa keterangan-keterangan tapi mereka belum tunduk kepadanya (bukti-bukti tersebut), justru malah bersikap sombong terhadapnya “lalu mereka menutupkan tangannya ke mulutnya (karena kebencian)”, maksudnya mereka tidak beriman dengan risalah yang dibawa oleh para rasul, tidak mengatakan sedikit pun yang menunjukkan keimanan. Seperti FirmanNya, \"mereka menjadikan jari-jari mereka masuk ke dalam teling-telinga mereka karena takut kematian\" (Al-Baqarah:19) “Dan mereka berkata”, kepada para rasul dengan keterangan-keterangan, “Sesungguhnya kami mengingkari sesuatu yang kamu disuruh menyampaikannya (kepada kami), dan sesungguhnya kami benar-benar dalam keragu-raguan yang menggelisahkan terhadap sesuatu yang kamu ajak kami kepadanya”, maksudnya pada posisi ragu-ragu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِٱلۡبَيِّنَٰتِ) bil bayyinaat : dengan hujjah yang jelas atas kebenaran mereka dalam kenabian, dakwah tauhid, dan kebangkitan akhir. (فَرَدُّوٓاْ أَيۡدِيَهُمۡ فِيٓ أَفۡوَٰهِهِمۡ) fa radduu aidyahum fii afwaahihim : para umat meletakkan tangan mereka di mulut mereka, yaitu sebagai isyarat kepada mereka (para rasul) “Diamlah!”. (مُرِيبٖ) muriib : jatuh kedalam keraguan. Makna ayat : Firman-Nya : (أَلَمۡ يَأۡتِكُمۡ) “Apakah belum datang kepada kalian” ini adalah perkataan Musa kepada kaumnya seraya menasehati dan mengingatkan mereka (لَا يَعۡلَمُهُمۡ نَبَؤُاْ ٱلَّذِينَ مِن قَبۡلِكُمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَٱلَّذِينَ مِنۢ بَعۡدِهِمۡ) “Apakah belum datang kepada kalian berita orang-orang sebelum kalian; kaum Nuh, Ad, Tsamud, dan orang-orang setelah mereka, tidak ada yang mengetahui mereka” tidak ada yang mengetahui jumlah mereka dan tidak pula dapat menghitung mereka (إِلَّا ٱللَّهُۚ) “kecuali Allah.” (جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ) “Telah datang rasul-rasul mereka dengan bukti-bukti” yaitu hujjah-hujjah dan bukti-bukti atas kebenaran dakwah mereka dan apa yang mereka bawa berupa agama yang benar, agar hanya Allah-lah yang disembah dan ditaati, begitu pula rasul-rasul-Nya agar manusia menjadi sempurna dan dengannya mereka meraih kebahagiaan. Firman-Nya : (فَرَدُّوٓاْ أَيۡدِيَهُمۡ فِيٓ أَفۡوَٰهِهِمۡ) “Maka mereka meletakkan tangan-tangan mereka” umat-umat yang telah diutus utusan kepada mereka, meletakkan tangan mereka dimulut mereka sebagai bentuk amarah dan kebencian, atau mereka memberikan isyarat untuk diam sehingga mereka terdiam sebagai penolakan atas dakwah yang benar yang dilakukan oleh para rasul, mereka berkata kepada para rasul : (إِنَّا كَفَرۡنَا بِمَآ أُرۡسِلۡتُم بِهِۦ) “Sungguh kami ingkar kepada risalah kalian” apa yang kalian bawa berupa agama Islam dan ajakan kepadanya. (وَإِنَّا لَفِي شَكّٖ مِّمَّا تَدۡعُونَنَآ إِلَيۡهِ مُرِيبٖ) “Dan kami sungguh berada pada keraguan akan apa yang kalian dakwahkan.” Jatuh kepada keraguan, yaitu ketidak-tetapan jiwa dan guncangan serta ketidak percayaan akan suatu kabar yang datang kepadanya, dan pembahasan masih berlanjut hingga firman-Nya : (وَٱسۡتَفۡتَحُواْ وَخَابَ كُلُّ جَبَّارٍ عَنِيدٖ) “Maka mereka memohon kemenangan (kepada Allah) dan celakalah seluruh orang yang congkak lagi pembangkang.“ Pelajaran dari ayat : • Disyariatkan mengingatkan akan kisah-kisah orang-orang terdahulu dan keadaan orang yang telah lampau, karena di dalamnya ada faidah-faidah yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ibrahim ayat 9: Allah Subhaanahu wa Ta'aala berfirman menakut-nakuti hamba-hamba-Nya dengan apa yang ditimpakan kepada umat-umat terdahulu yang mendustakan rasul ketika rasul datang kepada mereka, maka Allah hukum mereka dengan azab yang segera yang disaksikan oleh manusia dan didengarnya. Kaum Nabi Hud ‘alaihis salam. Kaum Nabi Saleh ‘alaihis salam. Karena banyaknya jumlah mereka dan berita tentang mereka telah hilang. Yang menunjukkan kebenaran mereka. Oleh karena itu, Allah tidaklah mengutus seorang rasul kecuali diberikan-Nya bukti-bukti yang menunjukkan kebenarannya, di mana bukti-bukti itu biasanya diimani manusia. Namun sayang, ketika rasul-rasul datang kepada mereka membawa bukti-bukti yang nyata, mereka tidak mau tunduk, bahkan menyombongkan diri terhadapnya. Ada yang menafsirkan, bahwa maksudnya mereka tidak mengucapkan kata-kata yang menunjukkan keimanan. Dengan tegas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ibrahim Ayat 9",
    "description": "Janganlah kalian, wahai bani israil dan umat nabi Muhammad, mengingkari nikmat Allah. Apakah belum sampai kepadamu berita tentang kebinasaan orang-orang sebelum kamu, yaitu kaum nabi nuh, kaum 'a'd, kaum Å amud, dan orang-orang setelah mereka, seperti penduduk madyan, kaum tubba', dan lain-lain. Tidak ada yang mengetahui secara detail azab seperti apa yang mereka alami, selain Allah. Rasul-rasul telah datang kepada mereka membawa bukti-bukti yang nyata tentang kerasulan para utusan itu, berupa mukjizat dan penjelasan yang mudah dipahami oleh umat masing-masing, namun mereka menutupkan tangannya ke mulutnya dengan penuh kebencian dan penolakan, dan berkata, sesungguhnya kami tidak percaya sama sekali akan bukti bahwa kamu diutus kepada kami, dan kami benar-benar berada dalam keraguan yang sangat mendalam dan menggelisahkan hati kami terhadap apa yang kamu serukan kepada kami, berupa ajakan beriman dan bertauhid kepada Allah. Menanggapi jawaban kaumnya, rasul-rasul mereka berkata, apakah ada keraguan dari siapa pun yang berakal terhadap wujud dan keesaan Allah, pencipta langit dan bumi dalam keseimbangan yang begitu sempurna' dia menyeru kamu agar bertauhid dan beribadah hanya kepadanya untuk kepentinganmu sendiri, yakni agar dia mengampuni sebagian dosa-dosamu yang sengaja maupun tidak, dan menangguhkan siksaan-Mu sampai waktu yang ditentukan oleh-Nya. Mendengar nasihat para rasul itu, mereka berkata, kamu hanyalah manusia biasa seperti kami juga. Tidak ada keistimewaan apa pun dalam diri kamu yang memantaskan kamu untuk menjadi pembimbing kami. Kamu mengaku sebagai rasul hanya karena ingin menghalangi kami menyembah apa yang dari dahulu telah diyakini dan disembah oleh nenek moyang kami, lalu kamu mengajak kami menyembah tuhanmu. Karena itu, datangkanlah kepada kami bukti yang nyata bahwa kamu benar utusan Allah sehingga kami tidak lagi dapat membantahnya."
  }
]