[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Segala sanjungan adalah bagi Allah karena sifat-sifatNya yang seluruhnya adalah sifat-sifat kesempurnaan dan karena nikmat-nikmatNya, lahir dan batin, agama dan duniawi, Pencipta langit dan bumi dan pembuat keduanya tanpa contoh sebelumnya, Yang menjadikan para malaikat sebagai utusan-utusan kepada siapa yang Dia kehendaki dari hamba-hambaNya dan pada apa yang Dia kehendaki dari perintah dan laranganNya. Di antara keagungan Kuasa Allah adalah bahwa Dia menjadikan malaikat memiliki sayap-sayap, ada yang dua, tiga, dan empat untuk terbang menyampaikan apa yang Allah tugaskan kepadanya. Dan Allah menambahkan apa yang Dia kehendaki pada ciptaanNya. Sesungguhnya Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu yang sulit bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Segala puji bagi Allah Pencipta langit dan bumi tanpa contoh sebelumnya, menjadikan para Malaikat sebagai utusan yang melaksanakan keputusan takdir-Nya. Di antara mereka ada yang menyampaikan wahyu kepada para Nabi, menguatkan mereka untuk menunaikan tugas yang dibebankan kepada mereka, di antaranya ada yang memiliki dua sayap, ada yang tiga, ada yang empat, yang digunakannya untuk terbang menunaikan tugasnya. Allah menambah sesuatu pada makhluk-Nya sesuai kehendak-Nya berupa anggota badan, rupa atau suara. Sesungguhnya Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu yang melemahkan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Segala puji bagi Allah, Pencipta langit dan bumi tanpa ada yang mendahului penciptaannya; Dia menyebarkan di langit dan bumi berbagai tanda kekuasaan-Nya. segala puji bagi Allah yang menjadikan para malaikat yang mulia sebagai utusan dan makhluk yang ditugaskan; Dia menjadikan mereka berbeda-beda tingkatannya, sebagian mereka memiliki dua sayap, sebagian lainnya memiliki 3 sayap, dan ada pula yang memiliki 4 sayap dan lebih dari itu. Allah menambah apa yang Dia kehendaki bagi makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الْحَمْدُ لِلّٰهِ فَاطِرِ السَّمٰوٰتِ وَالْأَرْضِ (Segala puji bagi Allah Pencipta langit dan bumi) Allah memuji diri-Nya atas besarnya kuasa, ilmu, dan hikmah-Nya yang dibuktikan dengan penciptaan-Nya terhadap langit dan bumi, Allah menciptakan keduanya dari ketidak-adaan tanpa ada permisalannya sebelumnya. Ibnu Abbas berkata: “Dahulu aku tidak mengerti maksud dari firman-Nya (فاطر السماوات والأرض) hingga dua orang Arab badui mendatangiku untuk memperkarakan perselisihan antara mereka berdua dalam urusan sebuah sumur. Salah seorang diantara mereka berkata kepada lainnya: (هذه بئري وأنا فاطرهما) “ini adalah sumurku, dan akulah penciptanya.” جَاعِلِ الْمَلٰٓئِكَةِ رُسُلًا(Yang menjadikan malaikat sebagai utusan-utusan) Para malaikat yang menjadi utusan adalah malaikat Jibril, Mikail, Israfil, Izrail, dan lainnya. أُو۟لِىٓ أَجْنِحَةٍ مَّثْنَىٰ وَثُلٰثَ وَرُبٰعَ ۚ(yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat) Qatadah berkata: sebagian malaikat memiliki dua sayap, dan sebagaian lainnya memiliki tiga sayap, dan empat sayap, yang dipakai untuk turun dari langit menuju ke bumi serta naik ke langit dari bumi. يَزِيدُ فِى الْخَلْقِ مَا يَشَآءُ ۚ( Allah menambahkan pada ciptaan-Nya apa yang dikehendaki-Nya) Yakni Allah menciptakan malaikat dengan sayap yang lebih dari empat sesuai kehendak-Nya, dan Allah menciptakan bagi malaikat lain dengan hal lain sesuai kehendak-Nya, seperti dua mata, hidung yang indah, dan bibir yang manis. Pendapat lain mengatakan bahwa Allah menambah bagi sebagian malaikat wajah yang indah. Atau kemampuan menulis dengan tulisan yang indah. Atau rambut yang ikal. Atau akal dan fikiran. Atau ilmu dan keahlian. إِنَّ اللهَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ(Sesungguhnya Allah Maha Kuasa atas segala sesuatu) Yakni dengan kuasa-Nya Allah menambah bagi mereka sesuai apa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Surah ini tetap sama seperti surah-surah Makkiyah lainnya yang mengandung 3 dasar akidah yaitu tauhid, risalah dan hari kebangkitan. 1. Pujian yang utuh dan sempurna dari Allah atas DzatNya karena mengajarkan hamba-hambaNya cara memuji, sang Pencipta langit dan bumi serta menciptakan keduanya tanpa ada contoh sebelumnya, dan Dzat yang membuat malaikat sebagai utusan untuk para nabi dan orang lain untuk tugas tertentu. Utusan-utusan tersebut adalah Jibril, Mikail, Israfil, Izrail dan pemilik sayap yang tak diketahui hakikat dan cara kerjanya kecuali Allah. Di antara mereka ada yang memiliki dua sayap, tiga sayap dan empat sayap. Dia menambahkan sesuatu yang dikehendakiNya sesuai dengan kebijaksanaanNya dalam penciptaan sayap dan bagian lainnya untuk malaikat dan makhluk lainnya, seperti kebaikan dan keindahan di beberapa bagian tubuh, suara, akal dan karakter, atau kreatifitas dan pengetahuan. Sesungguhnya Allah Maha Kuasa atas setiap sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah, Pencipta} pencipta dan pembuat pertama {langit dan bumi yang menjadikan malaikat sebagai utusan-utusan yang mempunyai} yang mempunyai {sayap. Ada yang dua, tiga, dan empat. Dia menambahkan pada ciptaanNya apa yang Dia kehendaki. Sesungguhnya Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah memuji DiriNya sendiri yang Mahamulia lagi Mahasuci karena penciptaanNya terhadap langit dan bumi serta berbagai macam makhluk yang ada pada keduanya; karena itu adalah bukti (dalil) kesempurnaan KuasaNya, keluasan kerajaanNya, keluasan rahmatNya, keindahan hikmah dan ilmuNya yang meliputi (segala sesuatu). Dan setelah Allah menjelaskan tentang penciptaan, berikutnya Allah menjelaskan apa yang berkaitan dengan perintahNya, yaitu Dia menjadikan “malaikat sebagai utusan-utusan” di dalam mengatur perintah-perintahNya yang bersifat taqdiri dan sebagai perantara antara Allah dengan manusia di dalam menyampaikan perintah-perintahNya yang bersifat syar’i. Di dalam penjelasan bahwa Dia menjadikan malaikat-malaikat sebagai utusan-utusan, Allah tidak memberikan pengecualian terhadap seorang pun di antara mereka, dan ini sekaligus merupakan satu dalil (bukti) yang menunjukkan totalitas kepatuhan mereka kepada Rabb, Allah, dan ketundukan mereka kepada perintah-perintahNya, sebagaimana Allah firmankan, \"yang tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.\" (at-Tahrim:6). Oleh karena para malaikat itu adalah para pelaksana –berdasarkan izin Allah- melakukan hal-hal yang ditugaskanNya kepada mereka, maka Allah menjelaskan kemampuan mereka untuk melakukannya, dan betapa sangat cepatnya perjalanan mereka, di mana Allah menjadikan di antara mereka, “mempunyai sayap-sayap” yang dengannya mereka bisa terbang dan segera melaksanakan apa saja yang diperintahkan kepadanya, “ada yang memiliki dua, tiga, dan empat buah,” maksudnya: Di antara mereka ada yang mempunyai dua sayap, ada yang tiga da nada juga yang empat, masing-masing sesuai dengan tuntutan hikmah Allah. “Dia menambahkan pada ciptaanNya apa yang dikehendakiNya.” Maksudnya, memberikan kelebihan kepada sebagian makhlukNya atas sebagian yang lain dalam bentuk penciptaannya, kekuatannya, keindahannya, tambahan anggota badan melebihi biasanya, kemerduan suaranya, dan dalam kebagusan nadanya. “Sesungguhnya Allah Mahakuasa atas segala sesuatu.” Maka dari itu Kuasa Allah berlaku menurut apa yang Dia kehendaki, tidak ada sesuatu apa pun yang menjadi sulit bagiNYa; yang di antaranya adalah memberikan kelebihan kepada sebagian makhlukNya atas sebagian yang lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 1: Surat ini dimulai dengan pujian kepada Allah yang memiliki semua pujian, Dialah yang memiliki pujian bagi Dzat-Nya, sebagai pengajaran bagi hamba-Nya bahwasanya Dialah yang berhak untuk segala jenis pujian. Maka Al Hamdu, mutlak dan pujian sempurna bagi Allah sang pencipta langit dan bumi yang diciptakan keduanya dengan tanpa permisalan yang mendahului, yang menjadikan para malaikat sebagai utusan yang menyampaikan kepada mereka para Nabi Allah dan bagi siapa yang dikehendaki dari hamba-Nya dan Allah menciptakan para malaikat dengan sifat yang berbeda-beda dan menakjubkan; Di antara mereka ada yang diciptakan dengan memiliki satu sayap, ada yang dua sayap, ada juga yang memiliki tiga sayap, ada yang dengan empat sayap. Allah menambahkan atas makhluknya menurut apa yang Dia kehendaki, Dialah yang maha suci dan maha kuasa atas segala sesuatu, tidak ada yang dapat melemahkan-Nya di langit dan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memuji Diri-Nya karena Dia menciptakan langit dan bumi serta makhluk yang ada di antara keduanya, di mana hal itu menunjukkan sempurnanya kekuasaan-Nya, luasnya kerajaan-Nya, meratanya rahmat-Nya, indah kebijaksanaan-Nya, dan meliputnya ilmu-Nya. Tanpa ada contoh sebelumnya. Seperti mengurus perintah-perintah-Nya yang bersifat qadari (terhadap alam semesta), sebagai perantara antara Allah dengan makhluk-Nya untuk menyampaikan perintah-perintah agama-Nya. Oleh karena para malaikat mengurus berbagai urusan dengan izin Allah, Dia menyebutkan kekuatan dan kecepatan mereka dalam perjalanan, di mana Allah Subhaanahu wa Ta'aala menjadikan mereka memiliki sayap sehingga mereka bisa terbang dengan cepat untuk melaksanakan perintah-Nya. Di antara mereka ada yang memiliki dua sayap, tiga atau empat sesuai hikmah-Nya, bahkan ada yang lebih dari itu seperti 600 sayap sebagaimana malaikat Jibril ‘alaihis salam. Baik menambah sifat fisiknya, kekuatannya, keindahannya, anggota tubuhnya maupun suaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 1",
    "description": "Pada akhir surah saba' Allah menegaskan bahwa orang-orang kafir amat meragukan datangnya hari kiamat sehingga ketika hari itu datang mereka merasa sangat sengsara. Surah f'tir ini lalu dimulai dengan pujian kepada Allah yang mahakuasa atas segala sesuatu. Segala puji bagi Allah pencipta langit dan bumi, yang menjadikan malaikat sebagai utusan-utusan untuk mengurus berbagai hal sesuai kehendak-Nya. Di antara bukti kekuasaan-Nya adalah bahwa dia menciptakan malaikat yang mempunyai sayap, masing-masing ada yang dua, tiga, dan empat, bahkan lebih dari itu, sehingga mereka dengan mudah dan cepat berpindah dari satu tempat ke tempat lain. Hanya Allah yang mengetahui hakikat malaikat dan sayap-sayapnya tersebut. Allah berkuasa menambahkan pada ciptaan-Nya, baik malaikat maupun yang lain, apa yang dia kehendaki. Sungguh, Allah mahakuasa atas segala sesuatu tanpa ada yang mampu menghalangi. 2. Apa saja di antara rahmat Allah, seperti kesehatan, rezeki, ilmu, dan lainnya, yang dianugerahkan kepada manusia, maka tidak ada yang dapat menahannya; dan apa saja yang ditahan-Nya maka tidak ada yang sanggup untuk melepaskannya setelah itu. Dan dialah yang mahaperkasa untuk berbuat sesuai kehendak-Nya, mahabijaksana dalam setiap ketetapan-Nya."
  }
]