[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa mencari kemuliaan di dunia dan di akhirat, maka hendaknya dia mencarinya dari Allah, dan itu tidak akan diperoleh kecuali dengan ketaatan kepadaNya, karena seluruh kemuliaan adalah milik Allah. Barangsiapa merasa mulia dengan Yang Maha Pencipta, maka Allah akan memuliakannya. Hanya kepadaNya dzikirnya akan naik, dan amal shalih akan mengangkatnya. Dan orang-orang yang melakukan keburukan-keburukan akan mendapatkan siksa yang keras, dan makar orang-orang itu akan lenyap sia-sia dan rusak, tidak berguna apa pun bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Barangsiapa menginginkan kemuliaan di dunia atau di Akhirat, maka jangan mencarinya kecuali dari Allah, karena Allah adalah satu-satunya pemilik kemuliaan di dunia dan di Akhirat, hanya kepada Allah zikir-Nya yang baik naik, hanya kepada Allah amal saleh para hamba diangkat. Orang-orang yang mengatur tipu muslihat jahat, seperti upaya membunuh Rasulullah, bagi mereka azab yang keras. Makar mereka itu pasti gagal dan tidak sampai mewujudkan apa pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Barangsiapa yang mengharapkan kemuliaan, maka hendaklah dia mengharapkannya dari Allah dengan mentaati-Nya. Sebab seluruh kemuliaan hanya milik Allah, tidak ada selain-Nya yang memiliki kemuliaan. Dan perkataan baik diangkat kepada Allah. Amal kebaikan naik dengan perkataan baik, dan keduanya saling menaikkan dan melengkapi. Dan orang-orang yang berusaha mendapatkan kemuliaan semu dan palsu dengan melakukan amalan buruk, menjadikannya sebagai pengantar menuju kemuliaan dan berusaha menyembunyikan perbuatan buruk itu; mereka itu seperti orang yang membuat makar dengan sembunyi-sembunyi, dan menampakkan perbuatan yang berlainan dengan makar itu; mereka seperti orang yang menanam tanaman di tanah yang tandus. Seperti itulah amalan dan tipu daya mereka yang tidak akan menghasilkan kebaikan, dan akan mengantarkan mereka kepada kehinaan dan penyesalan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. مَن كَانَ يُرِيدُ الْعِزَّةَ (Barangsiapa yang menghendaki kemuliaan) Al-Farra berkata: maknanya adalah, barangsiapa yang ingin mengetahui kemuliaan itu milik siapa, maka itu adalah milik Allah seluruhnya. Qatadah berkata: maknanya barangsiapa yang ingin mendapat kemuliaan maka hendaklah ia mencari kemuliaan dengan ketaatan kepada Allah. فَلِلّٰهِ الْعِزَّةُ جَمِيعًا ۚ( maka bagi Allah-lah kemuliaan itu semuanya) Maka hendaklah memintanya dari Allah semata, sebab selain-Nya tidak ada yang memilikinya sedikitpun. Dan Allah memberi kemuliaan kepada siapa yang Dia kehendaki. إِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ(Kepada-Nya-lah naik perkataan-perkataan yang baik) Yakni para malaikat yang bertugas menulis catatan amal naik kepada-Nya. Dan makna (الكلم الطيب) yakni segala bentuk perkataan baik, seperti berzikir kepada Allah, menyuruh kepada kebaikan, melarang kemungkaran, membaca al-Qur’an, dan lain sebagainya. وَالْعَمَلُ الصّٰلِحُ يَرْفَعُهُۥ ۚ( dan amal yang saleh dinaikkan-Nya) Yakni Allah mengangkatnya kepada diri-Nya dan menerimanya. Pendapat lain mengatakan, bahwa amal shalih akan mengangkat perkataan baik seperti do’a dan zikir sehingga dapat diterima dan dikabulkan. والذين يمكرون السسئات (Dan orang-orang yang merencanakan kejahatan) Merkea adalah orang yang berbuat keburukan di dunia. لَهُمْ عَذَابٌ شَدِيدٌ ۖ (bagi mereka azab yang keras) Bagi mereka azab yang sangat berat. وَمَكْرُ أُو۟لٰٓئِكَ هُوَ يَبُورُ(Dan rencana jahat mereka akan hancur) Yakni akan gagal dan binasa. Asal makna (المكر) adalah tipuan dan rencana jahat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Barangsiapa menginginkan kemuliaan, kehormatan dan kenikmatan, maka sebaiknya dia mencarinya di sisi Allah. BagiNya setiap kemuliaan di dunia dan akhirat. Kemuliaan itu tidak akan didapat kecuali dengan menaatiNya. Hanya kepadaNyalah perkataan yang baik itu ditujukan. Maknanya Dia (Allah) menerima kalimat Tauhid dan setiap kalam yang baik berupa dzikrullah, doa, dan bacaan Al-Qur’an. Allah juga mengangkat dan menerima amal shalih dari orang mukmin. Adapun orang-orang yang beramal buruk di dunia dengan berbuat tipu daya dan kecurangan serta menentang orang-orang muslim, maka bagi mereka itu azab yang dahsyat dari Allah saat di akhirat. Dan tipu muslihat orang-orang yang berkonspirasi tersbut itu buruk dan merusak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa yang menghendaki kemuliaan} kemuliaan dan kehormatan {maka kemuliaan itu semuanya milik Allah. KepadaNyalah akan naik} akan naik {perkataan-perkataan yang baik} dzikir, bacaan Al-Qur’an dan doa {dan amal shalih akan Dia angkat. Adapun orang-orang yang merencanakan kejahatan} membuat tipudaya yang jahat {maka bagi mereka azab yang sangat keras dan rencana jahat mereka akan hancur} hancur dan lenyap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Artinya: Hai orang yang menghendaki kemuliaan, carilah kemuliaan itu pada dzat Yang kemuliaan itu ada di TanganNya. Dan sesungguhnya kemuliaan itu hanya di Tangan Allah, dan ia tidak bisa diperoleh kecuali ndengan cara menaatiNya. Allah telah menyebutkannya melalui FirmanNya, “KepadaNyalah naiknya perkataan-perkataan yang baik,” seperti bacaan tasbih, tahmid, tahlil dan setiap ucapan yang baik. Maka naiklah kepada Allah dan diperlihatkan kepadanya dan Allah memuji pemiliknya diantara semua penghuni ketinggian. “Dan amal yang shalih,” berupa amalan-amalan hati dan amalan-amalan lahiriah. “Yang dinaikkanNya.” Yakni, diangkat oleh Allah sebagaimana halnya kalimat-kalimat yang baik. Dikatakan, amal sholeh mengangkat perkataan baik, maka diangkatnya perkataan yang baik tergantung amal hamba yang sholeh, karena amal itulah yang mengangkat perkataan yang baik, maka jika tida Ada amal shalih, maka tidak ada satu perkataan pun yang dinaikkan kepada Allah. Itulah amal-amal yang dinaikkan kepada Allah dan Allah meninggikan dan memuliakan pelakunya. Adapun amal- lakukan tipu daya dan muslihat namun akibatnya menimpa dirinya sendiri. Ia tidak makin bertambah kecuali kehinaan dan kerendahan. Maka dari itu Allah berfirman, “Dan amal yang shalih dinaikanNya, sedangkan orang-orang yang merencanakan kejahatan bagi mereka azab akna hancur.” Maksudnya, akan binasa dan menjadi sirna, dan rencana jahat mereka sama sekali tidak menguntungkan mereka sedikit pun; swebab ia adalah rencana jahat dengan kebatilan dan untuk tujuan kebatilan pula."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 10: Allah mengabarkan, barangsiapa yang menginginkan kemuliaan di dunia dan akhirat maka wajib baginya untuk taat kepada Allah dan bergantung kepada-Nya saja, karena sungguh kemulian adalah milik Allah, maka barangsiapa yang memuliakan Allah, Allah akan berikan kemuliaan, dan barangsiapa yang kemuliaan untuk makhluk, Allah akan hinakan dia dan permalukan. Kemudian Allah menjelaskan bahwa setiap ucapan yang baik dari dzikir, doa, tilawah Al Qur’an dan selainnya terangkat pada Allah, Allah akan balas dan terima bagi pemilik ucapan tersebut dengan balasan yang baik, dan setiap amalan yang shalih terangkat kepada Allah dan Allah terima dari mereka hamba-Nya dan Allah berikan ganjaran. Dikatakan juga bahwa ucapan yang baik dalam ayat ini adalah dua kalimat syahadat yang terangkat ketika beramal shalih dan membenarkan kedua kalimat tersebut. Yaitu bahwa dua kalimat syahadat tidak cukup dengan tanpa amalan jika memungkinkan untuk beramal. Dikatakan juga bahwa amalan shalih mengangkat ucapan yang baik, dan terangkatnya ucapan yang baik berdasarkan amalan seorang hamba yang shalih; Maka jika tidak memiliki amalan shalih, maka ucapannya tidak akan naik kepada Allah. Kemudian Allah mengabarkan bahwa mereka yang bermakar yaitu dari orang-orang musyrik dan munafik dan yang semisal dengna mereka; Mereka ditimpakan adzab yang pedih dari Allah, dan makar mereka yang mereka berusaha melakukannya, tempat kembalinya adalah keburukan dan kerugian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah wahai orang yang menginginkan kemuliaan, carilah kemuliaan itu dari yang memilikinya, dan yang memilikinya adalah Allah, dan hal itu tidak mungkin dicapai kecuali dengan ketaatan kepada-Nya. Yakni diangkat kepada Allah, dihadapkan kepada-Nya dan akan dipuji Allah pelakunya di hadapan makhluk yang berada di dekat-Nya. Seperti membaca Al Qur’an, ucapan tasbih, tahmid, tahlil (Laailaahaillallah), dan semua ucapan yang baik lainnya. Baik amal hati, lisan maupun anggota badan. Perkataan yang baik dan amal salehnya itu dinaikkan oleh Allah Ta’ala untuk diterima dan diberi-Nya pahala. Adapula yang berpendapat, bahwa amal saleh akan mengangkat perkataan yang baik sesuai amal saleh pada seorang hamba, amal itulah yang mengangkatnya. Apabila ia tidak memiliki amal saleh, maka tidak akan diangkat ucapannya kepada Allah Ta’ala. Amal itulah yang diangkat kepada Allah Subhaanahu wa Ta'aala dan mengangkat pelakunya dan memuliakannya. Adapun amal buruk, maka kebalikannya, tidak menambahkan selain kehinaan dan kerendahan. Seperti orang-orang Quraisy yang berkumpul di Darunnadwah untuk menangkap dan memenjarakan Rasulullah shallallahu 'alaihi wa sallam, membunuh Beliau atau mengusir Beliau. Mereka dihinakan sehina-hinanya. Yakni akan binasa dan tidak membuahkan hasil apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 10",
    "description": "Kekuasaan Allah tidak sebatas keberadaan alam semesta. Dia juga pemilik kemuliaan yang didambakan oleh banyak orang. Melalui ayat ini Allah mengingatkan, 'barang siapa menghendaki kemuliaan, maka ketahuilah bahwa kemuliaan itu semuanya milik Allah. Karena itu, jika kamu menginginkannya, mendekatlah dan taatilah Allah. Kepada-Nyalah akan naik perkataan-perkataan yang baik, yakni kalimat tauhid l' il'ha illall'h, kalimat zikir, atau semua perkataan yang baik dalam pandangan agama, dan amal kebajikan, dia akan mengangkatnya. Perkataan baik akan naik dan amal yang baik itu dinaikkan untuk diterima dan diberi-Nya pahala, sehingga pelakunya mendapat kemuliaan dan kedudukan tinggi di sisi-Nya. Adapun orang-orang yang karena meng-ikuti hawa nafsu merencanakan kejahatan terhadap orang-orang yang beriman, mereka akan mendapat azab yang sangat keras, dan rencana jahat mereka akan hancur serta tidak mencapai sasarannya. Mereka inilah orang-orang yang jauh dari kemuliaan. 11. Dan di antara tanda kekuasaan-Nya adalah bahwa Allah menciptakan bapak kamu, nabi adam, dari tanah kemudian menciptakan kamu dari air mani yang bersumber dari saripati makanan yang juga berasal dari tanah, kemudian dia menjadikan kamu berpasangan laki-laki dan pe-rempuan sebagai suami istri. (lihat juga: an-najm/53: 45) tidak ada seorang perempuan pun yang mengandung dan melahirkan, melainkan de-ngan sepengetahuan-Nya. Dan tidak dipanjangkan umur seseorang dan ti-dak pula dikurangi umurnya, melainkan sudah ditetapkan dalam kitab, yaitu lau' ma'f''. Sungguh, yang demikian itu mudah bagi Allah karena dia mahakuasa dan maha mengetahui."
  }
]