[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menciptakan bapak kalian, Adam dari tanah, kemudian menjadikan keturunannya dari air yang hina, kemudian Dia menjadikan kalian laki-laki dan perempuan. Seorang wanita tidak hamil dan tidak melahirkan kecuali dengan ilmuNya, seseorang tidak dipanjangkan umurnya, dan seseorang tidak dipendekkan umurnya kecuali dalam Kitab di sisi Allah, yaitu Lauhul Mahfuzh sebelum ibunya mengandungnya dan melahirkannya, dan Kitab tersebut telah mencatat semua itu, Allah mengetahuinya sebelum menciptakannya, apa yang telah ditulis dengannya tidak bertambah dan tidak berkurang. Sesungguhnya penciptaan kalian, ilmu tentang keadaan kalian dan penulisannya di Lauhul Mahfuzh, semuanya adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah yang menciptakan bapak kalian Adam dari tanah, kemudian Allah menciptakan kalian dari setetes air, kemudian Allah menjadikan kalian laki-laki dan wanita yang berpasang-pasangan. Tidak ada ibu yang mengandung dan melahirkan kecuali dalam ilmu Allah, tidak ada sesuatu pun yang tersembunyi bagi-Nya. Umur seorang hamba tidak ditambah dan tidak dikurangi kecuali hal itu tertulis di Lauḥul Maḥfuẓ. Sesungguhnya penciptaan Adam dari tanah dan penciptaan kalian yang melalui beberapa fase serta penulisan umur kalian di Lauḥul Maḥfuẓ adalah perkara yang mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah menciptakan kalian dari tanah; darinya Adam diciptakan dan darinya diciptakan makanan yang merupakan sumber kehidupan manusia. Kemudian Allah menciptakan kalian dari air mani, dan menjadikan kalian berpasangan, ada laki-laki dan perempuan. Tidak ada perempuan yang hamil dan melahirkan, melainkan dengan pengetahuan, perhatian, dan pengaturan Allah. Dan tidak ada orang yang berumur panjang atau yang berumur pendek melainkan telah Allah tetapkan dalam kitab yang mencantumkan ajal mereka. Semua itu merupakan hal mudah bagi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَاللهُ خَلَقَكُم مِّن تُرَاب (Dan Allah menciptakan kamu dari tanah) Yakni dalam cakupan penciptaan bapak kalian Adam yang diciptakan dari tanah. ثُمَّ مِن نُّطْفَةٍ(kemudian dari air mani) Yang dikeluarkan dari tulang punggung bapak kalian. ثُمَّ جَعَلَكُمْ أَزْوٰجًا ۚ( kemudian Dia menjadikan kamu berpasangan) Yakni Allah memasangkan sebagian kalian dengan sebagian lainnya, laki-laki dan perempuan sepasang. وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ ۚ( Dan tidak ada seorang perempuanpun mengandung dan tidak (pula) melahirkan melainkan dengan sepengetahuan-Nya) Sehingga tidak ada ilmu rencana yang keluar dari pengetahuan Allah. وَمَا يُعَمَّرُ مِن مُّعَمَّرٍ وَلَا يُنقَصُ مِنْ عُمُرِهِۦٓ( Dan sekali-kali tidak dipanjangkan umur seorang yang berumur panjang dan tidak pula dikurangi umurnya) Yakni tidak dipanjangkan umur seseorang dan tidak pula mengurangi umur orang lain. إِلَّا فِى كِتٰبٍ ۚ( melainkan (sudah ditetapkan) dalam Kitab) Yakni kitab Lauh Mahfuhz. Said bin Jabir berkata: umur yang telah lewat merupakan pengurangan umurnya, dan umur yang akan datang adalah umur yang dipanjangkan. Pendapat lain mengatakan, yakni Allah tidak memperpanjang umur seseorang sampai masa tua dan tidak pula mengurangi umur orang lain agar tidak mencapai masa tua kecuali telah tercantum dalam kitab, yakni telah ditetapkan Allah. Penambahan dan pengurangan umur merupakan ketentuan dan takdir Allah, yang dipengaruhi sebab-sebab yang mempengaruhi penambahan dan pengurangan umur. Hal yang dapat menjadi sebab penambahan umur adalah silaturrahim; sedangkan sebab pengurangan umur adalah banyak melakukan kemaksiatan kepada Allah. إِنَّ ذٰلِكَ عَلَى اللهِ يَسِيرٌ(Sesungguhnya yang demikian itu bagi Allah adalah mudah) Tidak ada yang sulit bagi-Nya, dan tidak ada yang tersembunyi dari-Nya baik itu sesuatu yang banyak maupun sedikit, yang besar maupun yang kecil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Allah SWT menciptakan leluhur kalian, Adam dari tanah. Kemudian Kami menciptakan kalian dari sperma (mani), lalu menjadikan kalian dua jenis, laki-laki dan perempuan. Tidak ada perempuan yang mengandung dan melahirkan kecuali sepengetahuan dan seizinNya. Dia juga tidak memanjangkan umur seseorang dan mengurangi umur yang lain kecuali sudah ada di lauhil mahfudz sesuai (umur) biasanya dan berlaku. Sesungguhnya orang yang umurnya panjang maka akan dikatakan kepadanya “Dia mendapatkan umurnya” dan orang yang mati saat kecil maka akan dikatakan kepadanya dibandingkan dengan yang lainnya “Umurnya belum sempurna”, meskipun umur masing-masing dari keduanya itu dibatasi dan sudah ditentukan, tidak ditambah dan tidak dikurangi. Sesungguhnya membatasi umur itu adalah perkara mudah bagi Allah, bukan perkara yang sulit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Menciptakan kalian dari tanah, lalu air mani, kemudian Dia menjadikan kalian berpasang-pasangan} laki-laki dan perempuan, lalu laki-laki menikahi perempuan {Tidak ada seorang perempuan pun yang mengandung dan melahirkan} tidak pula melahirkan {kecuali Dia mengetahuinya. Tidak dipanjangkan umur seseorang} dan tidak dipanjangkan umur seseorang {dan tidak pula dikurangi umurnya, kecuali (ada) dalam kitab} di Lauhil Mahfudz {Sesungguhnya yang demikian itu sangat mudah bagi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah mengingatkan penciptaanNya kepada manusia dan bagaimana manusia berpindah fase demi fase, sejak dari tanah lalu menjadi air mani dan seterusnya. “Kemudian Dia menjadikan kamu berpasangan,” yakni, Dia terus memindahkan kalian dari satu fase ke fase berikutnya hingga menjadikan kalian sampai berpasang-pasangan, yang laki-laki mengawini yang perempuan; yang melalui perkawinan itu diharapkan adanya anak keturunan. Sekalipun nikah itu merupakan salah satu sebabnya, namun ia tetap selalu disertai qadha’, takdir, dan ilmu Allah. “Dan tidak ada seorang perempuanpun yang mengandung dan tidak pula melahirkan melainkan denga ilmu-Nya\" begitupula perkembangan manusia seluruhnya ada dalam ketentuan dan ilmu Allah. \"dan tidaklah dia memberi umur dari yang diberi umur dan tidak pula dikurangi umurnya.” Maksudnya, orang yang diberi umur panjang, “melainkan” dengan ilmu-Nya. Atau, tidaklah dikurangi dari umur manusia dan dia berusaha untuk menyambungnya, dan sekiranya ia tidak melakukan hal-hal yang menjadi sebab makin pendeknya umur, seperti zina, durhaka terhadap kedua ibu-bapak, memutus hubungan kerabat (silaturahim) dan yang serupa; yang tersebut di atas adalah termasuk faktor penyebab pendeknya umur. Artinya: panjang atau pendeknya umur, baik karena suatu sebab atau tanpa sebab, semuanya berdasarkan ilmu Allah, dan Dia telah mengukuhkannya “dalam KItab” yang terjadi atas hamba, dalam setiap waktu, hari dan kehidupan. \"sesungguhnya hal itu mudah bagi Allah\" yakni, kecakupan ilmu Allah dengan semua mua'amalah yang banyak itu dan juga cakupan kitabNya padanya. Itulah tiga dalil dari sekian dalil-dalil tentang (kebenaran) kebangkitan dan akan dihidupkannya kembali manusia, semuanya rasional. Allah mengingatkannya di dalam ayat-ayat ini: menghidupkan bumi setelah kematiannya, dan sesunggunya yang menghidupkannya dialah yang akan menghidupkan yang mati. Dan memindahkan manusia dalam setiap fase perkembangan hidup, dan Dia yang mengadakannya dan memindahkannya setingkat demi setingkat, darisatu kondisi ke kondisi yang lain, sehingga sampailah pada satu takdirnya, maka Dialah Allah lebih mampu untuk mengembalikan dan menciptakannya kembali dalam bentuk ciptaan yang lain adalah lebih mudah dan itu lebih gampang bagiNya. Begitu pula cakupan ilmuNya terhadap seluruh bagian-bagian (partikel-partikel) alam samawi dan alam bumi, yang kecil dan yang besar, yang ada di dalam hati, dan janin yang ada di dalam Rahim, bertambah dan berkurangnya umur, semua itu ada di dalam suatu kitab. Dan karena yang telah terjadi itu sudah terbukti mudah bagiNYa, maka kalau Dia menghidupkan kembali orang-orang yang sudah mati tentu lebih mudah dan lebih gampang lagi. Maka Mahasuci Allah yang kebaikanNya amat sangat banyak, dan Dia mengingatkan hamba-hambaNya akan apa yang mengandung kebaikan bagi mereka untuk kehidupan dunia dan akhirat mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 11: Ketahuilah wahai manusia, bahwasanya Allah Dialah yang awal pertama kali yang menciptakan bapak kalian Adam dari tanah, kemudian Allah jadikan keturunannya berasal dari air yang suci, yaitu air yang keluar dari kemaluan laki-laki yang masuk dalam rahim perempuan setelah jima’, kemudian Allah menciptakan dari air ini manusia seluruhnya, baik laki-laki maupun perempuan. Ketahuilah bahwa setiap perempuan tidaklah mengandung dan menyusui kecuali dengna izin Allah saja. Dan sekali-kali tidak dipanjangkan umurnya satupun dari makhluk sehingga tua renta, dan tidak pula dikurangi dari umurnya dan mati ketika masih kecil atau masih muda kecuali telah tertulis di Lauhil Mahfudz, Allah tidak menambah dan mengurangi atas apa yang telah Allah tetapkan. Ketahuilah bahwa Allah menciptakan kalian dan mengajarkan keadaan-keadaan kalian dan menulis seluruhnya, adalah mudah bagi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan menciptakan nenek moyangmu Adam ‘alaihis salam dari tanah. Yakni keturunannya dari air mani. Dia senantiasa memindahkan keadaan kamu dari periode yang satu kepada periode yang selanjutnya sampai kamu berpasang-pasangan laki-laki dan perempuan dan menikah, lalu kamu mempunyai anak dan keturunan. Menikah meskipun termasuk sebab untuk menghasilkan keturunan, namun tetap terikat dengan qadha’ Allah dan qadar-Nya serta ilmu-Nya. Tidak ada seorang perempuan pun yang mengandung dan melahirkan, melainkan dengan sepengetahuan-Nya. Demikian pula periode yang dilalui manusia juga dengan sepengetahuan-Nya dan qadha’-Nya. Yakni dengan sepengetahuan-Nya, atau maksudnya tidaklah berkurang umur seseorang yang hendak sampai kepada akhirnya kalau bukan karena dia mengerjakan sebab-sebab berkurangnya umur seperti zina, durhaka kepada kedua orang tua, memutuskan tali silaturrahim dan perbuatan lainnya yang termasuk sebab pendeknya umur. Artinya, panjang dan pendeknya umur dengan adanya sebab dan tanpa sebab itu, semuanya dengan sepengetahuan Allah dan hal itu sudah dicatat dalam Lauh Mahfuzh. Oleh karena itu, Tuhan yang mengadakan manusia dan merubah dari satu keadaan kepada keadaan yang lain sampai keadaan yang telah ditentukan baginya, tentu lebih mampu mengadakannya kembali, bahkan yang demikian mudah bagi-Nya. Demikian pula peliputan ilmu-Nya kepada semua bagian alam, baik alam bagian bawah maupun alam bagian atas, yang kecil maupun yang besar, yang tersembunyi dalam dada maupun janin yang tersembunyi dalam perut, bertambahnya amal dan berkurangnya dan dicatatnya semua itu dalam sebuah kitab, juga sama sebagai dalil bahwa Dia mampu menghidupkan kembali orang-orang yang telah mati. Dan lagi Dia juga yang menghidupkan bumi setelah matinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 11",
    "description": "Dan di antara tanda kekuasaan-Nya adalah bahwa Allah menciptakan bapak kamu, nabi adam, dari tanah kemudian menciptakan kamu dari air mani yang bersumber dari saripati makanan yang juga berasal dari tanah, kemudian dia menjadikan kamu berpasangan laki-laki dan pe-rempuan sebagai suami istri. (lihat juga: an-najm/53: 45) tidak ada seorang perempuan pun yang mengandung dan melahirkan, melainkan de-ngan sepengetahuan-Nya. Dan tidak dipanjangkan umur seseorang dan ti-dak pula dikurangi umurnya, melainkan sudah ditetapkan dalam kitab, yaitu lau' ma'f''. Sungguh, yang demikian itu mudah bagi Allah karena dia mahakuasa dan maha mengetahui. 12. Allah mahakuasa, maha pencipta. Di antara bukti kekuasaan Allah adalah penciptaan manusia. Untuk memenuhi keperluan hidup manusia, Allah menciptakan lautan dengan beragam sumber dayanya. Dan tidak sama antara dua lautan; yang ini tawar, menyuburkan tanah, menumbuhkan tanam-tanaman, sangat segar, dan sedap diminum, dan lautan yang lain airnya asin lagi pahit karena sangat asin dan tentu tidak sedap untuk diminum. Dan dari masing-masing lautan itu kamu dapat memakan daging yang segar dan kamu dapat secara bersungguh-sungguh mengeluarkan perhiasan yang kamu pakai, yakni mutiara dan marjan (lihat juga: ar-ra'm'n/55: 22). Dan di sana kamu melihat kapal-kapal berlayar membelah laut agar kamu dapat mencari karunia-Nya dan agar kamu bersyukur kepada-Nya atas limpahan rahmat tersebut."
  }
]