[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dua laut tidak sama, ini tawar dan sangat tawar, mudah melewati kerongkongan dan melenyapkan dahaga, sedangkan yang itu sangat asin. Dan dari keduanya kalian makan ikan segar yang lezat dan kalian mengeluarkan perhiasan, yaitu mutiara dan batu marjan yang kalian gunakan. Dan engkau melihat kapal-kapal membelah air, agar kalian bisa mencari karunia Allah melalui perniagaan dan lainnya. Dama ayat ini mengandung petunjuk bagi Kuasa Allah dan keesaanNya dan agar kalian bisa besyukur kepada Allah atas nikmat-nikmatNya yang Dia berikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan dua laut tidak sama; yang pertama tawar yang sangat tawar, enak diminum karena ia tawar, sedangkan yang kedua adalah asin-pahit yang tidak bisa diminum karena asinnya. Dari masing-masing laut tersebut kalian bisa memakan ikan yang segar, kalian mengeluarkan mutiara dan batu permata yang kalian pakai sebagai perhiasan. Kamu -wahai orang yang memandang- melihat kapal-kapal berlayar di lautan, hilir mudik untuk mencari karunia Allah melalui perdagangan, agar kalian bersyukur kepada Allah atas nikmat-nikmat-Nya yang banyak yang telah Dia berikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah menjelaskan bahwa dua lautan tidak sama jika saling bertemu; yang satu memiliki air tawar dan yang satu lagi memiliki air asin, dan setiap laut itu memiliki kandungan, ciri khas, dan manfaat masing-masing. Keduanya berbeda kandungan, keenceran, makhluk hidup yang ada di dalamnya, dan lain sebagainya. Dari dua lautan itu tersingkap keagungan Allah dan kesempurnaan kenikmatan-Nya bagi manusia. Meskipun keduanya memiliki banyak kesamaan; dari keduanya Kami mengeluarkan daging segar dari ikan dan hewan laut lainnya, dan perhiasan berupa mutiara dan marjan; dan menjadi tempat kapal-kapal yang berlayar membawa berbagai kemaslahatan dan sebagai kendaraan untuk berpindah dari satu tempat ke tempat lain dengan kekuasaan dan kemudahan dari Allah, agar kalian bersyukur kepada Allah atas segala kenikmatan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَمَا يَسْتَوِى الْبَحْرَانِ هٰذَا عَذْبٌ فُرَاتٌ (Dan tiada sama (antara) dua laut; yang ini tawar, segar, sedap diminum) Yaitu sungai-sungai dan sebagian danau air tawar. وَهٰذَا مِلْحٌ أُجَاجٌ ۖ (dan yang lain asin lagi pahit) Makna (الأجاج) adalah air yang sangat asin, yaitu air lautan dan Samudra serta laut yang bersambung dengannya. وَمِن كُلٍّ(Dan dari masing-masing laut itu) Yakni dari kedua laut itu. تَأْكُلُونَ لَحْمًا طَرِيًّا(kamu dapat memakan daging yang segar) Yakni hewan-hewannya yang ditangkap untuk dimakan. وَتَسْتَخْرِجُونَ حِلْيَةً(dan kamu dapat mengeluarkan perhiasan) Yakni untuk kalung dan gelang dari mutiara atau permata, yang dikeluarkan dari lautan yang asin dan sungai yang airnya bercampur dengan air asin. Dan inilah makna firman-Nya “dari masing-masing laut itu.” وَتَرَى الْفُلْكَ فِيهِ مَوَاخِرَ (dan pada masing-masingnya kamu lihat kapal-kapal berlayar membelah laut) Dan kamu dapat melihat kapal-kapal di lautan yang membelah air, sebagian kapal itu pergi menjauh dan sebagian lainnya datang mendekati. لِتَبْتَغُوا۟ مِن فَضْلِهِۦ(supaya kamu dapat mencari karunia-Nya) Yakni untuk berdagang lewat jalur laut menuju negeri yang jauh dalam waktu yang singkat. Sebagaimana disebutkan dalam surat al-Baqarah: 174. وَلَعَلَّكُمْ تَشْكُرُونَ(dan supaya kamu bersyukur) Yakni bersyukur kepada Allah atas kenikmatan yang telah Dia berikan kepada kalian itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dan tidak ada kesamaan antara dua lautan yaitu tawar dan asin (ini perumpamaan antara keimanan dan kekufuran). Yang ini tawar, sangat segar, menghilangkan dahaga, dan mudah diminum (mudah mengalir di tenggorokan), sedangkan yang ini asin, sangat asin dan susah mengalir di tenggorokan. Demikian itu adalah perumpamaan bagi orang mukmin dan orang kafir. Dari kedua laut itu kalian bisa memakan daging segar yaitu ikan. Dari laut yang asin, kalian bisa mengeluarkan permata yang digunakan sebagai perhiasan wanita, yaitu mutiara dan permata. Kamu bisa melihat kapal-kapal di setiap bagian dari dua lautan itu yang menyeberangi kerasnya arus laut agar kalian bisa mencari keutamaan Allah SWT dengan berdagang dan menumpanginya dan bersyukur kepadaNya atas nikmat yang diberikan kepada kalian dalam hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sama (antara) dua laut itu: yang ini tawar, segar} sangat segar {dan mudah} mudah {diminum, dan yang ini sangat asin} sangat asin {Dari masing-masing itu kalian dapat memakan daging yang segar} ikan yang lunak dan lembut {dan dapat mengeluarkan perhiasan} perhiasan berupa mutiara dan batu permata {yang kalian pakai. Di sana kamu melihat bahtera} bahtera {membelah} membelah lautan untuk berlayar di atasnya dengan didorong satu tiupan angin {agar kalian dapat mencari} agar kalian mencari {sebagian karuniaNya dan agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Ini adalah pemberitaan tentang Kuasa, hikmah, dan rahmatNya, yaitu bahwasanya Dia menjadikan dua laut untuk kepentingan alam bumi ini semuanya, dan Allah tidak menyamakan antara laut itu, sebab maslahat menuntut adanya sungai-sungai itu tawar, segar dan sedap diminum agar bisa dimanfaatkan oleh orang-orang yang ingin meminumnya, oleh para pemilik kebun dan para petani; dan menuntut keberadaan laut asin lagi pahit agar udara yang melingkupi bumi ini tidak rusak karena berbagai bau binatang-binatang laut yang mati, dan keberadaannya yang diam tidak bergerak. Keasinannya mencegahnya untuk cepat membusuk, dan supaya hewan-hewannya menjadi lebih indah dan lebih lezat. Maka dari itu Allah berfirman, “Dan dari masing-masing” laut yang asin dan sungai yang tawar “kamu dapat memakan daging yang segar” yaitu ikan yang mudah ditangkap di lautan “dan kamu dapat mengeluarkan perhiasan yang dapat kamu memakainya” seperti mutiara, permata, dan lain-lain dari apa-apa yang terdapat di dalam lautan. Ini adalah kemaslahatan yang sangat besar bagi manusia. Dan di antara maslahat dan kegunaan lain dari lautan adalah bahwasanya Allah telah menundukannya untuk mengapungkan berbagai bahtera seperti kapal dan berbagai alat-alat transportasi, maka anda melihatnya dari satu pulau ke pulau yang lain, dari satu tempat ke tempat yang lain. Bahtera itu mengangkut para penumpang, barang-barang kebutuhan, dan barang-barang perniagaan mereka, sehingga banyak karunia Allah dan nikmatNYa yang bisa diambil. Maka dari itu Allah berfirman, “Supaya kamu dapat mencari karuniaNya dan supaya kamu bersyukur.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 12: Allah mengabarkan bahwasanya air sungai dan laut, keduanya tidaklah sama; Air sungai, memiliki mata air yang segar di tenggorokan, adapun air laut airnya asin yang tidak dapat dinikmati untuk diminum. Oleh karenanya, kalian diberikan dari kedua air tersebut ikan untuk kalian makan, dikeluarkan juga dari keduanya perhiasan yang bermanfaat bagi pakaian istri-istri kalian semisal mutiara, dan selainnya. Kalian melihat dengan mata-mata kalian kapan-kapal yang mengarungi dan berjalan pada kedua air tersebut dengan cepat dari satu tempat ke tempat yang lain; Di mana Allah menjadikannya untuk diambil manfaat untuk kalian mencari rezeki, dan agar kalian bersyukur kepad Allah atas nikmat ini yang Allah tela berikan kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan tentang kekuasaan Allah, hikmah-Nya dan rahmat-Nya, bahwa Dia menjadikan dua buah laut (satu laut dan satu lagi sungai) untuk maslahat penduduk bumi, dan bahwa keduanya tidaklah sama, karena maslahat menghendaki agar sungai-sungai itu tawar dan segar lagi sedap diminum sehingga dapat diminum dan dapat dipakai untuk menyirami tanaman, sedangkan laut terasa asin lagi pahit agar tidak merusak udara yang meliputi bumi dan agar keadaan airnya tidak berubah, karena air laut itu diam tidak mengalir, maka dengan dijadikan asin menghalanginya untuk berubah dan agar hewan yang hidup di sana (ikannya) lebih indah dan lebih nikmat. Yakni ikan yang mudah dijaring di laut. Seperti mutiara, marjan dan perhiasan lainnya yang diperoleh dari dalam lautan. Ini merupakan maslahat yang sangat besar bagi hamba. Termasuk maslahat di laut adalah Allah menundukan laut agar dapat membawa kapal, di mana kita melihat kapal membelah lautan, pindah dari tempat yang satu ke tempat yang lain. Kapal itu membawa penumpangnya, barang-barang berat dan perdagangan mereka. Sehingga karena karunia Allah dan ihsan-Nya itu tercapailah banyak maslahat. Dengan berdagang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 12",
    "description": "Allah mahakuasa, maha pencipta. Di antara bukti kekuasaan Allah adalah penciptaan manusia. Untuk memenuhi keperluan hidup manusia, Allah menciptakan lautan dengan beragam sumber dayanya. Dan tidak sama antara dua lautan; yang ini tawar, menyuburkan tanah, menumbuhkan tanam-tanaman, sangat segar, dan sedap diminum, dan lautan yang lain airnya asin lagi pahit karena sangat asin dan tentu tidak sedap untuk diminum. Dan dari masing-masing lautan itu kamu dapat memakan daging yang segar dan kamu dapat secara bersungguh-sungguh mengeluarkan perhiasan yang kamu pakai, yakni mutiara dan marjan (lihat juga: ar-ra'm'n/55: 22). Dan di sana kamu melihat kapal-kapal berlayar membelah laut agar kamu dapat mencari karunia-Nya dan agar kamu bersyukur kepada-Nya atas limpahan rahmat tersebut. 13. Bukti lain atas kekuasaan dan rahmat Allah adalah pergantian siang dan malam. Dia memasukkan sebagian waktu malam ke dalam siang sehingga waktu siang lebih panjang, dan memasukkan sebagian waktu siang ke dalam malam sehingga waktu malam lebih panjang (lihat juga: 'li 'imr'n/3: 27 dan al-'ajj/22: 61), dan dia telah menundukkan matahari dan bulan, masing-masing beredar menurut waktu yang ditentukan. Dengan demikian, perhitungan hari, bulan, dan tahun dapat diketahui. Yang berbuat demikian itulah Allah tuhan kamu yang mahakuasa dan mahasempurna; hanya milik-Nyalah segala kerajaan. Dan orang-orang yang kamu seru dan sembah selain Allah, wahai kaum musyrik, sama sekali tidak mempunyai apa-apa walaupun setipis kulit ari."
  }
]