[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memasukkan sebagian waktu malam ke dalam siang, sehingga siang bertambah sesuai dengan kadar berkurangnya malam, sehingga malam bertambah sesuai dengan kadar berkurangnya siang. Allah menundukkan matahari dan rembulan, keduanya berjalan untuk waktu yang telah ditetapkan. Yang melakukan ini adalah Allah, Tuhan kalian, bagiNya seluruh kerajaan, dan apa-apa yang kalian sembah selain Allah tidak memilki kuasa sekalipun setipis selaput ari yang ada antara daging kurma dengan bijinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah memasukkan malam ke dalam siang sehingga ia bertambah panjang, Allah memasukkan siang ke malam sehingga ia bertambah panjang. Allah menundukkan matahari dan bulan, keduanya berjalan hingga masa yang telah ditentukan yang Allah ketahui yaitu hari Kiamat. Yang mengatur semua itu dan yang menjalankannya adalah Allah Tuhan kalian, bagi-Nya semata kerajaan. Dan mereka yang kalian sembah selain Allah berupa berhala-berhala, mereka itu tidak memiliki sesuatu apapun walaupun hanya selaput tipis pada biji kurma, bagaimana kalian menyembah mereka selain Aku?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Allah memasukkan malam ke dalam siang, dan memasukkan siang ke dalam malam; sehingga terkadang siang lebih lama dari malam, dan terkadang sebaliknya; dan perbedaan ini memiliki banyak manfaat. Dan matahari dan bulan bergerak dengan perhitungan yang detail, sehingga keduanya tidak berhenti atau berubah pergerakannya. Maka dimana tuhan-tuhan yang mereka anggap itu, yang tidak memiliki sesuatu apapun walau hanya sebesar kulit biji kurma?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. يُولِجُ الَّيْلَ فِى النَّهَارِ وَيُولِجُ النَّهَارَ فِى الَّيْلِ (Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam) dengan menambah salah satunya dan mengurangi yang lain. وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ۚ( dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan) Allah telah menetapkan waktu peredarannya, yaitu satu tahun bagi matahari dan satu bulan bagi bulan. Pendapat lain mengatakan yakni peredaran matahari pada siang hari dan peredaran bulan pada malam hari. ذٰلِكُمُ(Yang (berbuat) demikian itu) Yakni Dzat yang melakukan hal ini. اللهُ رَبُّكُمْ لَهُ الْمُلْكُ ۚ( Allah Tuhanmu, kepunyaan-Nya-lah kerajaan) Yang memiliki seluruh alam semesta dan yang mengaturnya. وَالَّذِينَ تَدْعُونَ مِن دُونِهِۦ مَا يَمْلِكُونَ مِن قِطْمِيرٍ(Dan orang-orang yang kamu seru (sembah) selain Allah tiada mempunyai apa-apa walaupun setipis kulit ari) Makna (القطمير) yakni kulit tipis yang berada diantara daging dengan biji kurma, yang seperti pembungkus biji kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dia memasukkan malam dalam siang dan memasukkan siang dalam malam, lalu menambahkan jangka waktu salah satunya dan mengurangi yang lain. Dia menundukkan matahari dan bulan dalam hal yang maslahat bagi manusia. Masing-masing dari keduanya beredar di orbit tertentu sampai waktu telah ditentukan dan hanya diketahui oleh Allah. Dzat yang menciptakan dan bertindak atas hal yang telah disebutkan itu adalah Allah, Tuhan kalian yang Maha Kuasa, Pemilik kerajaan alam semesta yang diatur sesuai kehendakNya. Wahai orang orang musyrik, hal-hal yang kalian sembah selain Allah berupa berhala-berhala itu tidak memiliki sekecil apapun sesuatu, seperti kulit biji kurma (biji kurma kering) yang sangat tipis dan berwarna putih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia memasukkan} memasukkan {malam ke dalam siang dan memasukkan siang ke dalam malam. Dia menundukkan} menundukkan {matahari dan bulan. Masing-masing beredar sampai batas waktu yang ditentukan} waktu tertentu {yang (berbuat) demikian itu adalah Allah Tuhan kalian. MilikNyalah segala kerajaan. Mereka yang kalian seru selain Dia tidak mempunyai apapun walaupun setipis kulit ari} serat pada biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Hal lain adalah bahwa Allah menggantikan siang dengan malam dan malam kepada siang. Apabila siang tiba, maka malam pun pergi, dan terkadang memperpanjang yang satu dan memperpendek yang lain dan kadang menjadikannya sama panjang; sehingga dengan demikian terciptalah berbagai maslahat bagi manusia untuk tubuh,hewan ternak, pepohonan, dan tanaman-tanaman mereka. Demikian pula apa-apa yang diciptakan oleh Allah seperti ditundukkannya matahari dan bulan, sep[erti berbagai maslahat sinar dan cahaya, gerak, diam dan bertebarannya manusia dalam mencari karuniaNya, lalu fungsi cahaya matahari dalam mematangkan buah-buahan dan mengeringkan apa saja yang hendak dikeringkan dan berbagai hal lainnya yang menjadi kebutuhan primer yang kalau saja ia tidak ada, maka manusia akan mendapatkan bahaya (mudarat) yang sangat besar. Dan FirmanNya, “Masing-masing berjalan menurut waktu yang ditentukan.” Masing-masing matahari dan bulan beredar pada garis orbitnya sebagaimana dikehendaki oleh Allah. Lalau apabila batas waktunya telah datang dan kehancuran dunia telah dekat waktunya, maka terhentilah peredarannya, kekuatannya menjadi tersendat, dan bulan pun redup, matahari pun digulung, dan bintang-bintang berjatuhan. Setelah Allah menjelaskan sebagian dari makhluk-0makhluk ciptaan tersebut dan menjelaskan apa-apa yang terkandung di dalamnya, yaitu ibrah (pelajaran) yang membuktikan kemahasempurnaanNYa dan karuniaNya, Dia berfirman, “Yang demikian itu itulah Allah Rabbmu, kepunyaanNya-lah kerajaan.” Artinya, Dia-lah satu-satunya yang menciptakan semua apa yang disebutkan di atas dan yang menundukkannya adalah Rabb Sembahan yang berhak diibadahi, yang kepunyaanNYa jualah semua kerajaan. “Dan orang-orang yang kamu seru selain Dia” seperti patung-patung dan berhala-berhala sama sekali tidak memiliki apa-apa “walaupun setipis kulit ari.” Makusdnya, sama sekali tidak mempunyai sesuatu apa pun, sedikit atau banyak, walaupun setipis kulit ari yang merupakan sesuatu yang paling remeh. Ini merupakan peniadaan yang total dan berlaku umum. Lalu bagaimana mereka diseru (disembah), padahal mereka sama sekali tidak mempunyai sesuatu pun dari kerajaan langit dan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 13: Allah mengabarkan yang nampak karunia-Nya dari hamba-Nya adalah Allah menciptakan malam dan siang dengan aturan yang indah; Dan bahwasanya Allah menggantikan malam ke siang, dan menggantikan siang ke malam, dan menjadikan keduanya saling bergantian. Dan sebagian juga dari karunia-Nya yang nampak adalah menundukkan matahari dan bulan, yang keduanya berjalan sesuai aturan sebagai kebaikan bagi mereka seorang hamba. Dan keadaannya tetap demikian sampai waktu yang ditentukan. Ketahuilah bahwa yang berbuat demikian adalah Allah Tuhan kalian yang agung, yang memiliki kerajaan dan kekuasaan, adapun mereka yang di ibadahi selain Allah, tidak ada kepemilikan apapun meskipun secuil dari kulit biji kurma. Seorang hamba tidak mengambil manfaat dari sesembahan-sesembahan tersebut bahwa menjadikan mereka mudharat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk pula ketika Allah memasukkan malam ke dalam siang dan siang ke dalam malam, setiap kali datang yang satu, maka yang satu lagi pergi, terkadang yang satu bertambah lamanya, sedangkan yang lain berkurang, dengan begitu tegaklah maslahat hamba baik untuk fisik mereka, hewan mereka maupun tanaman mereka. Masing-masing beredar di tempat peredarannya sesuai yang Allah kehendaki, maka apabila ajal telah tiba, dunia telah dekat dengan kehancuran, maka keduanya berhenti berjalan, dan kekuatannya tidak berfungsi lagi, cahaya bulan akan hilang, matahari dilipat, dan bintang-bintang bertaburan.. Setelah Allah Subhaanahu wa Ta'aala menerangkan tentang makhluk-makhluk yang besar ini dan pelajaran yang ada di dalamnya yang menunjukkan sempurnanya Allah dan menunjukkan ihsan-Nya, Allah Subhaanahu wa Ta'aala berfirman, “Yang (berbuat) demikian itulah Allah Tuhanmu, milik-Nyalah segala kerajaan.” Dia sendiri yang menciptakan makhluk-makhluk besar itu dan menundukkannya, Dialah Allah Tuhan yang berhak disembah, yang memiliki segala kerajaan. Seperti patung dan berhala. Yakni tidak memiliki apa-apa, sedikit atau banyak, dan tidak memiliki sedikit pun meskipun setipis kulit ari (kulit tipis pada buah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 13",
    "description": "Bukti lain atas kekuasaan dan rahmat Allah adalah pergantian siang dan malam. Dia memasukkan sebagian waktu malam ke dalam siang sehingga waktu siang lebih panjang, dan memasukkan sebagian waktu siang ke dalam malam sehingga waktu malam lebih panjang (lihat juga: 'li 'imr'n/3: 27 dan al-'ajj/22: 61), dan dia telah menundukkan matahari dan bulan, masing-masing beredar menurut waktu yang ditentukan. Dengan demikian, perhitungan hari, bulan, dan tahun dapat diketahui. Yang berbuat demikian itulah Allah tuhan kamu yang mahakuasa dan mahasempurna; hanya milik-Nyalah segala kerajaan. Dan orang-orang yang kamu seru dan sembah selain Allah, wahai kaum musyrik, sama sekali tidak mempunyai apa-apa walaupun setipis kulit ari. 14. Jika kamu menyeru, menyembah, dan meminta pertolongan mereka, yakni berhala atau sesembahan lain yang merupakan benda mati, mereka tidak mendengar seruanmu, dan sekiranya mereka yang kamu sembah itu makhluk hidup yang dapat mendengar, mereka juga tidak memperkenankan permintaanmu kecuali atas izin Allah. Dan pada hari kiamat mereka akan mengingkari dan berlepas diri dari kemusyrikanmu dan tidak ada yang dapat memberikan keterangan tentang segala sesuatu kepadamu seperti yang diberikan oleh Allah yang mahateliti dalam segala urusan."
  }
]