[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kalian (wahai manusia), memanggil sesembahan-sesembahan selain Allah tersebut, mereka tidak mendengar panggilan kalian, dan seandainya mereka mendengar pun, mereka tetap tidak mampu menjawab kalian. Di Hari Kiamat sesembahan-sesembahan tersebut akan bersikap berlepasdiri dari kalian. Tiada yang mengabarkan kepadamu (wahai rasul) yang lebih benar daripada Allah yang Maha Mengetahui lagi Mahateliti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Bila kalian memanggil sesembahan-sesembahan kalian, mereka tidak mendengar panggilan kalian, karena mereka adalah benda mati yang tidak memiliki kehidupan dan pendengaran. Seandainya pun mereka mendengar panggilan kalian -andai demikian- niscaya mereka tidak bisa menjawab panggilan itu. Dan pada hari Kiamat mereka berlepas diri dari kesyirikan kalian dan penyembahan kalian kepada mereka. Tidak satu pun yang memberimu kabar -wahai Rasul- yang lebih benar daripada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Jika mereka berdoa kepada tuhan-tuhan itu, maka ia tidak akan dapat mendengarnya. Bagaimana tidak, sedangkan ia hanyalah berhala yang tidak dapat mendengar. Dan seandainya dapat mendengar, bagaimana pula ia dapat mengabulkan doa? Pada hari kiamat, Allah akan menjadikan berhala-berhala itu dapat berbicara, agar menjadi saksi atas kekafiran orang yang menyembahnya; dan berhala-berhala itu akan berlepas diri dari kesyirikan mereka. Tidak ada yang dapat memberitahukan kepadamu suatu perkara seperti yang dilakukan Allah, sebab Allah Maha Mengetahui apa yang Dia beritahukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِن تَدْعُوهُمْ لَا يَسْمَعُوا۟ دُعَآءَكُمْ (Jika kamu menyeru mereka, mereka tiada mendengar seruanmu) Sebab berhala-berhala itu hanyalah benda mati yang tidak memahami apapun. وَلَوْ سَمِعُوا۟( dan kalau mereka mendengar) Sebagai pengandaian saja. مَا اسْتَجَابُوا۟ لَكُمْ ۖ( mereka tidak dapat memperkenankan permintaanmu) Sebab mereka tidak mampu melakukannya. وَيَوْمَ الْقِيٰمَةِ يَكْفُرُونَ بِشِرْكِكُمْ ۚ( Dan dihari kiamat mereka akan mengingkari kemusyirikanmu) Yakni berlepas diri dari penyembahan kalian kepada mereka, dan mengingkari apa yang kalian lakukan itu sesuatu yang benar, serta menafikan bahwa mereka yang memerintahkan kalian untuk menyembah mereka. وَلَا يُنَبِّئُكَ مِثْلُ خَبِيرٍ (dan tidak ada yang dapat memberi keterangan kepadamu sebagai yang diberikan oleh Yang Maha Mengetahui) Yakni tidak ada yang mampu memberitahukanmu seperti apa yang diberitahukan oleh Yang Maha Mengetahui segala sesuatu, yaitu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Jika kalian berdoa kepada berhala-berhala ini, mereka tidak akan mendengar doa kalian, karena berhala itu adalah benda-benda mati. Kalaupun mereka bisa mendengar doa, mereka tidak akan mengabulkan doa kalian. Dan pada hari kiamat mereka menyangkal perbuatan kalian yang menyekutukan mereka dengan Allah dan peribadatan kalian kepada mereka. Mereka berlepas diri dari kalian. Wahai Rasulallah, tidak ada yang bisa memberimu kabar tentang hakikat perintah itu dan keadaan-keadaan kiamat seperti kabar yang diberikan oleh Dzat yang Maha Mengetahui sesuatu yang akan terjadi, yaitu Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian menyeru mereka, mereka tidak mendengar seruan kalian, dan sekiranya mendengar, mereka tidak dapat memenuhi permintaan kalian. Pada hari kiamat mereka akan mengingkari kemusyrikan kalian} mereka berlepas diri dari persembahan kalian terhadap mereka {dan tidak ada yang dapat memberikan keterangan kepadamu seperti Dzat Yang Maha Mengetahui} dan tidak ada satupun yang memberitahu kalian tentang kesudahan segala perkara seperti Dzat Yang Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Di sisi lain, “Jika kamu menyeru mereka,” mereka tidak mendengar kalian, karena mereka ada yang berwujud benda mati, orang-orang yang sudah mati dan para malaikat yang sibuk dengan ketaatan kepada TUhannya. “Dan kalau mereka mendengar,” ini jika berandai-andai, “mereka tidak dapat memperkenankan permintaanmu,” sebab mereka tidak mempunyai sesuatu pun dan kebanyakan mereka tidak meridhai ibadah orang yang menyembahnya. Oleh karenannya, Allah berfirman, “Dan di hari Kiamat mereka akan mengingkari kemusyrikanmu.” Maksudnya, mereka berlepas diri dari kalian, dan mereka mengatakan: Mahasuci Engkau, Engkau-lah Pelindung Kami dari mereka. “Dan tidak ada yang dapat memberikan keterangan kepadamu sebagaimana yang diberikan oleh Yang Maha Mengetahui,” maksudnya, tidak ada seorang pun yang dapat memberikan keterangan kepadamu yang lebih benar daripada Allah Yang Maha Mengetahui, maka pastikanlah bahwa perkara yang diberitakanNya seakan-akan penglihatan dengan mata, maka janganlah anda ragu dan syak hati padanya. Maka ayat-ayat ini mengandung dalil-dalil dan argument-argumen yang pasti yang membuktikan bahwasanya Allah adalah Dzat yang berhak diibadahi danm disembah, yang tidak ada siapa pun selain Dia yang berhak disembah; dan bahwa sesungguhnya ibadah (penyembahan) kepada selain Dia adalah kebatilan (kepalsuan) yang bergantung kepada kebatilan; sama sekali tidak berguna bagi penyembahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 14: Ketahuilah wahai manusia, bahwa sesembahan-sesembahan ini hanyalah klain yan mereka tidaklah mendengar kalian, seandainya mendengar kalian, tidak akan menjawab kalian, tidak akan memberikan apa yang kalian minta dari keselamatan adzab Allah; Bahkan kalian di hari kiamat, kalian akan berlepas diri dari kalian begitu juga sekutu-sekutu kalian. Ketahuilah bahwa sesembahan kalian tidaklah memberikan kabar yang benar kepada kalian dan tidaklah lebih mengetahui dibandingkan Allah yang maha tahu, yang tidak tersembunyi sesuatupun bagi-Nya di bumi dan di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena yang mereka seru antara benda mati, orang-orang yang telah mati atau para malaikat yang sibuk beribadah dan menaati Tuhan mereka. Karena mereka tidak memiliki apa-apa dan tidak ridha dengan penyembahan orang yang menyembah mereka. Mereka akan berlepas diri darimu dan dari penyembahanmu kepada mereka. Tentang keadaan dunia dan akhirat. Yakni tidak ada satu pun yang memberi keterangan kepadamu yang lebih benar daripada keterangan yang diberikan Allah. Oleh karena itu, yakinilah berita yang disampaikan-Nya dan jangan meragukannya. Kandungan ayat ini menerangkan bahwa Allah Subhaanahu wa Ta'aala yang berhak disembah dan bahwa menyembah selain-Nya adalah batil tidak memberikan faedah apa-apa bagi yang menyembahnya. Yakni tidak ada satu pun yang memberi keterangan kepadamu yang lebih benar daripada keterangan yang diberikan Allah. Oleh karena itu, yakinilah berita yang disampaikan-Nya dan jangan meragukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 14",
    "description": "Jika kamu menyeru, menyembah, dan meminta pertolongan mereka, yakni berhala atau sesembahan lain yang merupakan benda mati, mereka tidak mendengar seruanmu, dan sekiranya mereka yang kamu sembah itu makhluk hidup yang dapat mendengar, mereka juga tidak memperkenankan permintaanmu kecuali atas izin Allah. Dan pada hari kiamat mereka akan mengingkari dan berlepas diri dari kemusyrikanmu dan tidak ada yang dapat memberikan keterangan tentang segala sesuatu kepadamu seperti yang diberikan oleh Allah yang mahateliti dalam segala urusan. 15. Hanya Allah tuhan yang patut disembah. Dia mahakuasa, pemilik langit dan bumi, sehingga itu manusia sudah pasti sangat memerlukan rahmat dan pertolongan-Nya. Wahai manusia! kamulah yang memerlukan Allah; dan Allah, dialah yang mahakaya, tidak memerlukan apa pun, lagi maha terpuji nama, sifat, dan perbuatan-Nya."
  }
]