[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia, kalianlah yang membutuhkan Allah dalam segala sesuatu, kalian tidak bisa tidak memerlukanNya sekejap pun, sebaliknya Allah Mahakaya sehingga Dia tidak membutuhkan manusia dan tidak memerlukan apa pun dari makhlukNya, Maha terpuji pada dzat, nama-nama dan sifat-sifatNya, Maha Terpuji atas nikmat-nikmatNya, karena segala nikmat bagi manusia adalah dariNya, maka bagiNya segala puji dan syukur dalam segala keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Wahai manusia! Kalian memerlukan Allah dalam segala urusan dan dalam segala keadaan kalian, dan Allah adalah Mahakaya yang tidak membutuhkan apa pun dari kalian, Żat yang Maha Terpuji di dunia dan di Akhirat atas takdir yang Dia tentukan bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Allah menyeru hamba-hamba-Nya: “Kalian membutuhkan Allah dalam setiap urusan kalian, baik itu yang kecil maupun yang besar, dan yang mudah maupun yang sulit. Hanya Allah Yang Maha Kaya dan Maha Terpuji; Dia memberi manfaat dan kenikmatan bagi hamba-Nya dengan kekayaan dan kemurahan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. أَنتُمُ الْفُقَرَآءُ إِلَى اللهِ ۖ (kamulah yang berkehendak kepada Allah) Yakni kalianlah yang membutuhkan Allah dalam segala urusan dunia atau agama. Sehingga kita benar-benar membutuhkannya dalam segala hal. وَاللهُ هُوَ الْغَنِىُّ (dan Allah Dialah Yang Maha Kaya) Secara mutlak. الْحَمِيدُ(lagi Maha Terpuji) Yakni yang berhak dipuji oleh hamba-hamba-Nya karena telah berbuat baik kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Wahai manusia, kalian membutuhkan Allah dalam segala urusan agama dan dunia. Allah adalah Dzat yang tidak butuh pengakuan kalian, Dzat yang layak menerima pujian dari hamba-hambaNya atas segala tindakanNya dan Dzat yang disembah atas segala keadaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai manusia, kalianlah yang memerlukan Allah} yang membutuhkan Allah di segala urusan dan keadaan kalian {Hanya Allahlah Yang Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Allah mengalamatkan FirmanNya kepada seluruh manusia, memberitahu mereka tentang kondisi dan sifat mereka, dan sesungguhnya mereka adalah benar-benar butuh kepada Allah dari segala segi. - Mereka butuh diciptakan; kalau saja bukan karena Allah menciptakan mereka, tentu mereka tidak ada. - Mereka juga butuh untuk dibekali dengan kekuatan, dan anggota tubuh, yang kalau saja Allah tidak memberikannya kepada mereka, tentu mereka tidak bisa melakukan suatu pekerjaan apa pun. - Mereka butuh untuk dibekali dengan makanan pokok; rizki, dan berbagai nikmat yang Nampak dan yang tidak Nampak; yang kalau saja bukan karena karunia, kebaikan, dan pemberian kemudahan segala urusan dariNya, maka tentu mereka tidak bisa memperoleh rizki dan kenikmatan sedikit pun. - Mereka juga butuh untuk dihindarkan dari berbagai bencana, dilepaskan dari segala hal yang tidak disukai, dijauhkan dari berbagai kesengsaraan dan penderitaan, yang kalau saja bukan karena pembelaan Allah terhadap mereka, yang melepaskan mereka dari berbagai penderitaan dan menghilangkan berbagai kesulitan mereka, tentu saja berbagai hal yang tidak disukai dan berbagai penderitaan tetap menimpa mereka. - Mereka juga butuh kepadaNya untuk dibimbing dengan berbagai bentuk bimbingan dan berbagai jenis pengaturan. - Mereka sangat butuh kepadaNya di dalam menghambakan diri dan mencintaiNya, beribadah kepadaNya dan ketulusan ibadah kepadaNya; yang kalau saja Allah tidak memberi hidayah kepada mereka untuk semua itu, tentu mereka binasa, ruh, jiwa, hati, hati dan keadaan mereka menjadi rusak. - Mereka sangat membutuhkanNya di dalam mengajarkan kepada mereka apa-apa yang tidak mereka ketahui dan amal yang dapat memperbaiki keadaan mereka; yang kalau saja bukan karena Allah mengajarkan kepada mereka, tentu mereka tidak akan pernah belajar; dan kalau saja bukan karena taufikNya, tentu mereka tidak akan bisa menjadi baik. - Jadi, mereka sangat fakir (butuh) secara dasar kepadaNya dengan segala arti kefakiran; sama saja, apakah mereka menyadari akan sebagian bentuk kefakiran itu ataukah tidak! Akan tetapi orang yang mendapat taufik di antara mereka, yaitu yang selalu merasakan kefakiran (kebutuhan) dirinya dalam setiap keadaan dalam permasalahan dunia dan agamanya, merendahkan diri dan memohon kepadaNya untuk tidak diserahkan kepada dirinya sendiri sekejap mata pun, dan memohon kepadaNya agar diberi pertolongan atas segala urusannya, dan ia merasakan (menyertakan) makna seperti ini dalam setiap saat, maka orang seperti ini pantas mendapatkan pertolongan yang sempurna dari Allah sesembahannya Yang lebih saying kepadanya daripada seorang ibu terhadap anaknya. “Dan Allah Dia-lah Yang Mahakaya lagi Maha Terpuji.” Maksudnya, Dia-lah yang memiliki kekayaan yang sempurna dari segala sisi. Dia sama sekali tidak membutuhkan kepada apa yang dibutuhkan oleh makhlukNya, dan DIa juga sama sekali tidak memerlukan kepada apa yang diperlukan oleh manusia. Hal itu adalah karena kesempurnaan sifat-sifatNya dan nkeberadaan semua sifat-sifatNya sebagai sifat-sifat kesempurnaan dan kemuliaan. Dan diantara kemahakayaan Allah adalah bahwa Dia menjadikan DzatNya, nama-namaNya, karena semua namaNya adalah husna (sangat indah), juga sifat-sifatNya, karena semua sifatNya adalah tinggi (mulia), dan semua perbuatanNya, karena semua perbuatanNya adalah merupakan karunia, kebaikan, keadilan, hikmah dan rahmat; dan juga (Maha Terpuji) dalam semua perintah dan semua laranganNya. Maka Dia Maha Terpuji atas apa yang ada di dalamnya dan atas apa yang dikaruniakanNya. Dan Dia Maha Terpuji di dalam kemahakayaanNya dan DIa Mahakaya di dalam keterpujianNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 15: Ketahuilah wahai manusia, sungguh kalian membutuhkan Allah atas semua urusan kalian di seluruh kehidupan kalian di dunia dan akhirat, Allah sajalah yang maha kaya atas seluruh makhluk-Nya, yang dipuji atas segala nikmat yang diberikan-Nya, yang tidak dapat dihitung dari seluruh waktu dan kondisi; Allah memiliki pujian dan rasa syukur atas seluruh keadaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada semua manusia dan memberitahukan keadaan dan sifat mereka, bahwa mereka butuh kepada Allah dalam semua keadaan. Mereka butuh diciptakan, mereka butuh diberikan kemampuan untuk melakukan sesuatu, mereka butuh diberi-Nya rezeki dan kenikmatan, mereka butuh dihindarkan dari bencana, mereka butuh diurus dan diatur-Nya, mereka butuh beribadah kepada-Nya, mereka butuh diajarkan-Nya sesuatu yang belum mereka ketahui, dan mereka butuh segalanya kepada Allah, baik mereka sadari atau tidak. Akan tetapi, orang yang diberi taufik di antara mereka seantiasa menyadari kebutuhannya baik yang terkait dengan urusan dunia maupun agama dan merendakan diri kepada-Nya serta meminta-Nya agar tidak menyerahkan urusan kepada dirinya walau sekejap pun serta membantunya dalam semua urusan, maka orang inilah yang lebih berhak mendapatkan pertolongan sempurna dari Allah Tuhannya, di mana Dia lebih sayang kepadanya daripada sayangnya seorang ibu kepada anaknya. Dia Mahakaya secara sempurna dari berbagai sisi, sehingga Dia tidak membutuhkan seperti halnya makhluk-Nya membutuhkan dan tidak membutuhkan apa-apa dari alam semesta. Yang demikian karena kesempurnaan sifat-Nya, di mana semua sifat-Nya adalah sifat sempurna dan agung. Di antara Mahakayanya Dia adalah, Dia memberikan kekayaan kepada makhluk-Nya di dunia dan akhirat. Dia juga Maha Terpuji, pada zat-Nya, nama-Nya karena semuanya indah, dan sifat-Nya karena semua sifat-Nya Tinggi. Di samping itu, perbuatan-perbuatan-Nya berjalan di antara memberi karunia dan ihsan, berbuat adil, hikmah (bijaksana), dan rahmat (sayang). Demikian pula pada perintah dan larangan-Nya yang semuanya mengandung keadilan, kebijaksanaan dan rahmat. Dia Maha Terpuji karena apa yang ada pada-Nya dan karena pemberian dari-Nya. Dia Maha Terpuji di tengah Mahakaya-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 15",
    "description": "Hanya Allah tuhan yang patut disembah. Dia mahakuasa, pemilik langit dan bumi, sehingga itu manusia sudah pasti sangat memerlukan rahmat dan pertolongan-Nya. Wahai manusia! kamulah yang memerlukan Allah; dan Allah, dialah yang mahakaya, tidak memerlukan apa pun, lagi maha terpuji nama, sifat, dan perbuatan-Nya. 16-17. Ketaatan manusia sedikit pun menambah kebesaran Allah dan keingkaran mereka sama sekali tidak mengurangi keagungan-Nya. Jika dia menghendaki, niscaya dia membinasakan kamu yang ingkar dan mendatangkan makhluk yang baru yang taat kepada-Nya untuk menggantikan kamu. (lihat juga: mu'ammad/47: 38). Dan yang demikian itu tidak sulit bagi Allah. Dia mahakuasa atas segala sesuatu. (lihat juga: al-'ankab't/29: 19)."
  }
]