[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Allah berkehendak, maka Dia akan membinasakan kalian dan mendatangkan kaum yang lain yang menaatiNya dan menyembahNya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Jika Allah -Subḥānahu- ingin menghabisi kalian dengan membinasakan kalian, niscaya Dia akan melakukannya, lalu Dia mendatangkan kaum lain sebagai ganti kalian yang akan menyembah-Nya, tidak menyekutukan-Nya dengan apapun juga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-17. Seandainya Allah menghendaki, niscaya Allah akan mengganti kalian dengan umat yang lain; sebab Dia tidak membutuhkan kalian. Dan itu bukanlah hal yang sulit bagi Allah, sebab Dia Maha Kuasa atas segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. إِن يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ (Jika Dia menghendaki, niscaya Dia memusnahkan kamu dan mendatangkan makhluk yang baru) Yakni jika Allah menghendaki niscaya Dia akan membinasakan kalian dan mengganti kalian dengan manusia yang lain atau dengan makhluk yang lain, yang mentaati-Nya dan tidak bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Jika berkehendak, Dia akan menghancurkan kalian dan mendatangkan kaum lain sebagai pengganti kalian dan mereka lebih taat daripada kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika berkehendak, niscaya Dia akan membinasakan kalian} melenyapkan kalian {dan mendatangkan makhluk yang baru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16.“Jika Dia menghendaki, niscaya Dia memusnahkan kamu dan mendatangkan mahkluk yang baru.” Ada kemungkinan bahwa maknanya adalah jika Dia menghendaki, maka Dia memusnahkan kalian wahai manusia dan mendatangkan manusia selain kalian yang lebih taat kepada Allah daripada kalian. Dengan demikian, ayat ini mengandung ancaman bagi mereka berupa kebinasaan dan kemusnahan, dan sesungguhnya masyi’ah (kehendak) Allah tidak hanya terbatas pada yang demikian saja. Bisa juga maknanya adalah penetapan kebenaran kebangkitan dan kehidupan kembali, dan bahwa kehendak Allah berlaku terhadap segala sesuatu dan terhadap penghidupan kembali setelah kalian mati menjadi makhluk yang baru. Namun waktunya telah ditetapkan oleh Allah, tidak akan dimajukan dan tidak pula ditunda."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 16: Ketahuilah wahai manusia jika Allah berkehendak untuk mematikan dan menggantikan kalian dengan yang lain yang mereka akan beribadah kepada Allah dan tidak menyekutukan-Nya; Allah akan perbiuat hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya bisa juga, bahwa jika Dia menghendaki, Dia dapat membinasakan kamu wahai manusia dan menggantimu dengan manusia yang baru yang taat kepada Allah. Sehingga ayat ini merupakan ancaman kepada manusia. Bisa juga maksudnya adalah menetapkan adanya kebangkitan, dan bahwa kehendak Allah berlaku dalam segala sesuatu, demikian pula Dia mampu menghidupkan kembali manusia setelah mati, akan tetapi waktunya telah ditetapkan Allah Subhaanahu wa Ta'aala, tidak maju dan tidak mundur. Makna ini ditunjukkan oleh ayat 18."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 16",
    "description": "16-17. Ketaatan manusia sedikit pun menambah kebesaran Allah dan keingkaran mereka sama sekali tidak mengurangi keagungan-Nya. Jika dia menghendaki, niscaya dia membinasakan kamu yang ingkar dan mendatangkan makhluk yang baru yang taat kepada-Nya untuk menggantikan kamu. (lihat juga: mu'ammad/47: 38). Dan yang demikian itu tidak sulit bagi Allah. Dia mahakuasa atas segala sesuatu. (lihat juga: al-'ankab't/29: 19)16-17"
  }
]