[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pembinasaan kalian dan penggantian kalian dengan makhluk yang lain oleh Allah bukanlah sesuatu yang mustahil, sebaliknya hal itu sangat mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Pemusnahan kalian dengan membinasakan kalian dan mendatangkan makhluk baru, bukanlah suatu hal yang mustahil bagi Allah -Subḥānahu wa Ta'ālā-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَمَا ذٰلِكَ (Dan yang demikian itu) Yakni pemusnahan kalian dan mengganti dengan yang lain itu. عَلَى اللهِ بِعَزِيزٍ (sekali-kali tidak sulit bagi Allah) Yakni tidaklah mustahil atau sulit bagi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Menghapus dan menghilangkan kalian serta menghadirkan kaum lainnya itu tidaklah sesuatu yang sulit (bagi Allah) dan tidak ada yang bisa mencegah Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu bagi Allah tidak sulit} sulit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Dan yang demikian itu sekali-kali tidak sulit bagi Allah.” Maksudnya, tidak ada halangan bagiNya dan tidak pula ada yang dapat membuatNya lemah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 17: Allah menjelaskan bahwa menjadikan makhluk-Nya dengan makhluk yang lain tidak menyulitkan Allah; Bahkan hal tersebut adalah mudah bagi-Nya; Dia kuasa atas segala sesuatu. Ini adalah bukti bahwa Allah tidak membutuhkan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 17",
    "description": "16-17. Ketaatan manusia sedikit pun menambah kebesaran Allah dan keingkaran mereka sama sekali tidak mengurangi keagungan-Nya. Jika dia menghendaki, niscaya dia membinasakan kamu yang ingkar dan mendatangkan makhluk yang baru yang taat kepada-Nya untuk menggantikan kamu. (lihat juga: mu'ammad/47: 38). Dan yang demikian itu tidak sulit bagi Allah. Dia mahakuasa atas segala sesuatu. (lihat juga: al-'ankab't/29: 19)18. Pada hari kiamat setiap orang akan mempertanggungjawabkan perbuatannya. Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang dibebani berat dosanya memanggil orang lain untuk membantu memikul bebannya itu, tidak akan dipikulkan sedi-kit pun, meskipun yang ia panggil itu kaum kerabatnya, apalagi bila ia bukan kerabatnya (lihat juga: 'abasa/80: 34'37). Sesungguhnya yang dapat engkau beri peringatan hanya orang-orang yang takut kepada azab tuhannya sekalipun mereka tidak melihat-Nya atau ketika mereka sedang menyendiri, dan demikian pula mereka yang melaksanakan salat secara baik dan sempurna syarat dan rukunnya. Dan barang siapa menyucikan dirinya dari syirik dan maksiat dengan menjalankan salat dan takut kepada Allah, sesungguhnya dia menyucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allah-lah tempat kembali segala urusan. Setiap orang akan dibalas sesuai perbuatannya."
  }
]