[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jiwa pelaku dosa tidak memikul dosa jiwa yang lain. Bila jiwa yang berat memikul dosa-dosanya bertanya tentang siapa yang berkenan untuk memikul sebagian dosanya, niscaya ia tidak akan menemukannya, sekalipun yang diminta adalah kerabatnya, baik ayah atau saudara atau lainnya. Dan engkau (wahai Rasul) hanya memperingatkan orang-orang yang takut kepada azab Tuhan mereka sekalipun tidak melihatNya, juga menunaikan shalat dengan sebaik-baiknya. Barangsiapa membersihkan dirinya dari syirik dan kemaksiatan, maka sesungguhnya dia hanya membersihkan untuk dirinya sendiri. Hanya kepada Allah-lah tempat kembali seluruh makhluk, lalu Dia membalas masing-masing sesuai dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Seorang pelaku dosa tidaklah memikul dosa yang dilakukan orang lain, akan tetapi setiap jiwa menanggung dosa masing-masing. Bila seorang pelaku dosa yang telah memikul beban berat dosanya sendiri memanggil orang lain untuk ikut memikul sebagian dari dosanya, maka ia tidak akan bisa memikul sedikit pun darinya, sekalipun yang dipanggil itu adalah orang terdekatnya. Kamu wahai Rasul hanya memperingatkan orang-orang yang takut kepada azab Tuhan mereka yang belum terlihat darinya dan mereka menyempurnakan salat dengan sebaik-baiknya, mereka itu adalah orang-orang yang peringatanmu berguna bagi mereka. Barangsiapa membersihkan dirinya dari kemaksiatan-kemaksiatan, terutama yang terbesar yaitu syirik maka dia hanya membersihkan untuk kebaikan dirinya, karena faedahnya kembali kepada dirinya sendiri. Allah tidak memerlukan ketaatannya. Hanya kepada Allah tempat kembali pada hari Kiamat untuk menghadapi hisab dan menerima balasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Suatu jiwa tidak akan memikul dosa jiwa lainnya. Dan seandainya ada orang yang menanggung dosa yang meminta orang lain untuk memikul dosanya, maka dosa itu tidak akan dapat memikulnya sedikitpun, meski yang diminta itu adalah kerabatnya; apalagi dengan orang yang tak memiliki hubungan? Orang-orang yang mendapat menfaat dari nazar dan yang menjalankannya hanyalah mereka yang takut kepada Tuhan mereka meski tidak melihat-Nya, dan takut kepada-Nya ketika sedang sendiri dan jauh dari penglihatan manusia; serta mereka yang mendirikan shalat sebagaimana yang Allah perintahkan. Dan barangsiapa yang menyucikan diri dari kotoran kesyirikan dan kemaksiatan, dan menghiasi diri dengan akhlak mulia, maka manfaat penyucian dirinya kembali kepadanya di dunia dan di akhirat. Allah tidak mendapat manfaat dari ketaatan orang-orang yang taat, tidak pula mendapat mudharat dari kemaksiatan orang-orang yang bermaksiat. Dan hanya kepada-Nya tempat kembali, untuk membalas orang yang baik dengan kebaikannya dan membalas orang yang jahat dengan keburukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ (Dan orang yang berdosa tidak akan memikul dosa orang lain) Yakni satu jiwa tidak menanggung beban dosa jiwa lainnya, namun tiap-tiap jiwa menanggung beban dosanya sendiri. وَإِن تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَىْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰٓ ۗ( Dan jika seseorang yang berat dosanya memanggil (orang lain) untuk memikul dosanya itu tiadalah akan dipikulkan untuknya sedikitpun meskipun (yang dipanggilnya itu) kaum kerabatnya) Yakni meskipun satu jiwa yang menanggung beban dosa memanggil jiwa yang lain untuk ikut menanggung sebagian dosa yang ia tanggung, permintaan itu tidak dapat menanggungkan dosanya sedikitpun meski yang dipanggil adalah orang yang dekat dengannya, terlebih lagi orang yang tidak memiliki hubungan kekerabatan sedikitpun. إِنَّمَا تُنذِرُ الَّذِينَ يَخْشَوْنَ رَبَّهُم بِالْغَيْبِ(. Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada azab Tuhannya (sekalipun) mereka tidak melihat-Nya) Yakni peringatanmu tidak akan bermanfaat kecuali bagi orang yang takut kepada Allah, meski mereka belum pernah menyaksikan azab-Nya; atau orang yang takut terhadap azab Allah meski azab itu tidak mereka lihat; atau orang yang takut kepada Allah meskipin dia dalam keadaan sendiri tanpa ada orang lain yang melihatnya. وَأَقَامُوا۟ الصَّلَوٰةَ ۚ( dan mereka mendirikan sembahyang) Yakni senantiasa memperhatikan urusan shalat, dan tidak ada yang menjadikannya lalai dari shalat. وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِۦ ۚ( Dan barangsiapa yang mensucikan dirinya, sesungguhnya ia mensucikan diri untuk kebaikan dirinya sendiri) Yakni barangsiapa yang membersihkan dirinya dengan meninggalkan kemaksiatan dan memperbanyak amal shalih, sesungguhnya dia memberihkan dirinya sendiri, sebab manfaat hal itu akan kembali pada dirinya; sebagaimana dosa orang yang mengotori dirinya tidak akan ditanggung oleh orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Pada hari kiamat seseorang tidak akan memikul dosa orang lain selain dosanya yang diperbuat di dunia. Jika seseorang yang memikul dosa banyak mencari orang lain untuk memikul sebagian dosanya, maka tidak akan dipikulkan sedikitpun dari dosanya meskipun yang diseru itu adalah kerabat dekatnya dalam nasab seperti ayah dan anak, bagaimana jika bukan kerabat?! Sesungguhnya peringatanmu berlaku pada orang-orang yang takut kepada Tuhan dengan merahasiakan dan menyembunyikan keadaan mereka dari manusia dan mereka itu jauh dari riya’, atau diketahui oleh mereka (manusia). Mereka mendirikan shalat pada waktunya dan senantiasa menjaganya. Barangsiapa bersih dari kesyirikan dan kemaksiatan, dan melakukan amal shalaih, maka sesungguhnya dia mensucikan dirinya sendiri karena manfaat hal tersebut diperuntukkan untuknya. Dan hanya kepada Allahlah tempat akembali dan tempat terakhir, lalu Dia membalas setiap manusia sesuai amalnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang yang berdosa} orang yang berdosa {tidak akan memikul} tidak memikul {dosa orang lain} dosa orang lain {Jika seseorang yang (dibebani) dosa yang berat} orang yang terbebani dengan dosa {memanggil} meminta {untuk memikul bebannya itu} untuk memikul dosa yang ada padanya {maka tidak akan dipikulkan sedikit pun meskipun dia kerabatnya. Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada Tuhan mereka tanpa melihatNya dan menegakkan shalat. Siapa saja yang menyucikan diri} menyucikan diri dari kemusyrikan dan kemaksiatan {sesungguhnya dia menyucikan diri untuk dirinya sendiri. Hanya kepada Allah tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Makna yang terakhir dikuatkan oleh apa yang disebutkanNya sesudahnya pada FirmanNYa, “Dan orang-orang yang berdosa tidak akan memikul dosa orang lain,” maksudnya, pada Hari Kiamat kelak, setiap orang akan diberi pembalasan menurut amal perbuatannya, dan tidak seorang pun menanggung dosa orang lain. “Dan jika seorang yang berat dosanya memanggil untuk memikul dosanya itu,” maksudnya, seorang jiwa yang penuh kesalahan dan dosa meminta pertolongan kepada orang yang mau menanggung sebagian dosa-dosanya, “tiadalah akan dipikulkan untuknya sedikitpun meskipun kaum kerabatnya.” Dia sama sekali tidak akan menanggung dosa seorang kerabatnya, karena keadaan di akhirat tidak sama dengan keadaan di dunia, di mana seseorang bisa menolong teman dekatnya, seorang sahabat dapat menolong sahabatnya. Bahkan pada di Hari Kiamat nanti, masing-masing orang mendambakan kalau dirinya mempunyai ha katas orang lain, sekalipun atas kedua orang tua dan kaum kerabatnya. “Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada azab RabbNya, sekalipun mereka tidak melihatNya; dan mereka mendirikan shalat.” Maksudnya, mereka yang mau mendengar peringatan dan mengambil pelajaran darinya, adalah orang-orang yang takut kepada Allah, sekalipun mereka tidak melihatNya; yaitu orang-orang yang takut kepadaNya dalam kondisi sembunyi maupun terlihat orang dan berada di tempat jauh (ghaib), dan mereka adalah orang-orang yang menegakkan shalat dengan segala batasan-batasannya, syarat-syaratnya, rukun-rukun, kewajiban-kewajiban dan kekhusyuannya. Sebab, takut kepada Allah mendorong seorang hamba untuk mengerjakan apa-apa yang jika diabaikan akan ditimpa azab, dan jauh dari apa-apa yang jika dilakukan dapat mengakibatkan siksa. Sedangkan shalat itu sendiri mengajak kepada kebaikan dan mencegah dari yang keji dan mengkar. “Dan barangsiapa yang menyucikan dirinya, sesungguhnya ia menyucikan diri untuk kebaikan dirinya sendiri.” Maksudnya, siapa saja yang menyucikan dirinya dengan cara membersihkan diri dari sifat-sifat tercela, seperti riya’, sombong, dusta, curang, makar, penipuan, kemunafikan, dan akhlak buruk yang serupa dengannya, dan menghiasi dirinya dengan akhlak mulia, seperti jujur, ikhlas, tawadhu (merendahkan hati), bersikap santun, memberikan nasihat baik kepada orang lain, dan bersih dari rasa dengki, iri dan akhlak-akhlak tercela lainnya, maka sesungguhnya pembersihan itu, manfaatnya pasti kembali kepada dirinya sendiri dan tujuannya (melakukan itu semua) pasti smapai kepada dirinya, tidak ada sesuatu apa pun dari amalnya yang tersia-siakan. “Dan kepada Allah-lah semua akan kembali,” lalu Dia akan memberikan balasan kepada segenap manusia atas apa yang telah mereka kerjakan, dan Allah akan memperhitungkan mereka berdasarkan apa yang telah mereka lakukan, Dia sama sekali tidak akan mengabaikan satu perbuatan kecil ataupun besar, melainkan Dia pasti menghitungnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 18: Allah mengabarkan bahwa setiap jiwa akan membawa urusan amalan-amalan mereka masing-masing. Mereka tidak akan membawa dosa dan kesalahan manusia yang lain, Dan jika seseorang yang berat dosanya memanggil (orang lain) untuk memikul dosanya itu tiadalah akan mau dipikulkan untuknya sedikitpun meskipun (yang dipanggilnya itu) kaum kerabatnya dalam nasab. Ketahuilah wahai Nabi Allah, bahwasanya peringatanmu akan memberikan manfaat bagi mereka yang takut kepada Allah, yang khusyu dalam sendiri maupun keramain, yang menegakkan shalat dan menjaga waktu-waktunya, rukun-rukunnya dan sunnah-sunnahnya. Dan barangsiapa yang mensucikan Allah dengan tauhid dan meninggalkan dosa serta maksiat, maka semua kebaikan itu akan kemabali kepadanya. Kepada Allah sajalah tempat kembali seluruh manusia, mereka dibalas berdasarkan apa yang telah mereka usahaan, dan akan dihisab atas apa yang telah mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, masing-masing orang memikul dosanya sendiri-sendiri. Keadaan di akhirat tidaklah seperti di dunia, di mana beban yang dipikul seseorang dapat dibantu dipikul oleh yang lain. Di antara ahli tafsir ada yang menafsirkan bil ghaib dalam ayat ini ialah orang-orang yang takut kepada Allah di waktu rahasia atau terang-terangan. Rasa takut dari seorang hamba membuatnya beramal agar tidak disiksa karena menyia-nyiakan yang diperintahkan serta menghindarkan diri dari mengerjakan sesuatu yang mendatangkan azab. Mereka inilah yang mau menerima peringatan dan memperoleh manfaat darinya. Maksud mendirikan shalat adalah melaksanakannya dengan batasan-batasannya, syarat-syarat dan rukun-rukunnya serta melaksanakan kewajibannya dan melakukan kekhusyuan di dalamnya. Shalat yang dilakukannya itu dapat mengajaknya kepada kebaikan dan mencegahnya dari perbuatan keji dan munkar. Dari berbagai aib, seperti riya’, sombong, dusta, menipu, membuat makar, melakukan kemunafikan dan akhlak tercela lainnya, serta menghiasi dirinya dengan akhlak mulia seperti ikhlas, tawadhu’, jujur, bersikap lembut, dan memberikan ketulusan kepada manusia (tidak menipu), selamatnya dada dari dengki dan dendam, serta akhlak buruk lainnya, maka pembersihan dirinya itu manfaatnya untuk dirinya sendiri sebagaimana dierangkan dalam lanjutan ayatnya. Dia akan menghisab amal yang dikerjakan makhluk-Nya dan akan memberikan balasan. Dia sama sekali tidak akan meninggalkan amal yang besar maupun yang kecil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 18",
    "description": "Pada hari kiamat setiap orang akan mempertanggungjawabkan perbuatannya. Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang dibebani berat dosanya memanggil orang lain untuk membantu memikul bebannya itu, tidak akan dipikulkan sedi-kit pun, meskipun yang ia panggil itu kaum kerabatnya, apalagi bila ia bukan kerabatnya (lihat juga: 'abasa/80: 34'37). Sesungguhnya yang dapat engkau beri peringatan hanya orang-orang yang takut kepada azab tuhannya sekalipun mereka tidak melihat-Nya atau ketika mereka sedang menyendiri, dan demikian pula mereka yang melaksanakan salat secara baik dan sempurna syarat dan rukunnya. Dan barang siapa menyucikan dirinya dari syirik dan maksiat dengan menjalankan salat dan takut kepada Allah, sesungguhnya dia menyucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allah-lah tempat kembali segala urusan. Setiap orang akan dibalas sesuai perbuatannya. 19-21. Usai menjelaskan bahwa yang mau menerima peringatan dari nabi adalah mereka yang takut kepada Allah dan menjalankan salat, pada ayat-ayat berikut Allah mendatangkan perumpamaan perbedaan antara orang mukmin dengan orang kafir. Dan tidaklah sama orang yang buta mata dan hatinya sehingga tidak dapat melihat dan menerima kebenaran, dengan orang yang melihat mata dan hatinya sehingga mau menerima kebenaran, dan tidak pula sama antara gelap gulita, yakni kesesatan atau kekafir-an, dengan cahaya, yakni petunjuk atau iman, dan tidak pula sama antara yang teduh, yakni kenyamanan dan ketenangan di surga, dengan yang panas, yakni pedihnya siksa neraka."
  }
]