[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-24. Tidak sama, orang yang buta terhadap agama Allah dengan orang yang melihat jalan kebenaran dan mengikutinya. Tidak sama, kegelapan-kegelapan kekafiran dengan cahaya iman, Tidak sama juga antara naungan dengan angin yang panas. Tidak sama orang-orang yang hatinya hidup dengan iman dengan orang-orang yang hatinya mati karena kekafiran. Engkau (wahai Rasul) tidak bisa memperdengarkan siapa yang ada dalam kubur. Dan sebagaimana engkau tidak kuasa memperdengarkan orang-orang mati dalam kubur mereka, engkau juga tidak kuasa untuk memperdengarkan orang-orang kafir tersebut karena hati mereka telah mati, engkau hanyalah pemberi peringatan bagi mereka dari hukuman dan azab Allah. Sesungguhnya Kami mengutusmu dengan membawa kebenaran, yaitu iman kepada Allah dan syariat-syariat agama, sebagai penyampai berita gembira dengan surga bagi siapa yang membenarkanmu dan mengamalkan petunjukmu, dan penyampai peringatan kepada siapa yang mendustakanmu dan mendurhakaimu dengan api neraka. Tidak ada satu umat dari umat-umat yang ada kecuali ia telah didatangi oleh rasul yang memperingatkan mereka terhadap akibat dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Orang kafir tidak sama dengan orang Mukmin dalam kedudukan, sebagaimana orang buta tidak sama dengan orang yang melihat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-22. Ini merupakan perumpamaan antara orang kafir dan orang mukmin, atau orang bodoh dengan orang berilmu; keduanya sama sekali tidak sama. Apakah sama antara orang yang buta dan berpaling dari kebenaran dengan orang yang melihat dan menjadikannya sebagai penerang? Apakah sama antara gelapnya kekafiran dan kemaksiatan dengan cahaya keimanan dan hidayah? Apakah sama antara naungan yang manusia gunakan sebagai tempat istirahat dan berlindung dari panas matahari, dengan api yang sangat panas? Tidak sama antara orang hidup dengan orang yang telah mati, dan antara orang yang Allah luaskan hatinya dengan Islam, dengan orang yang tetap dalam kekafiran dan kesesatan. Allah memperdengarkan hamba-Nya yang Dia kehendaki, dan kamu tidak dapat menjadikan orang yang telah mati dapat mendengar; bagaimana mereka dapat mendengar, sedangkan mereka telah terkubur dalam gelapnya kesyirikan dan kesesatan saat mereka masih hidup."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَمَا يَسْتَوِى الْأَعْمَىٰ (Dan tidaklah sama orang yang buta) Yakni kemampuan penglihatannya hilang. وَالْبَصِيرُ(dengan orang yang melihat) Yakni yang memiliki kemampuan penglihatan. Allah menyerupakan orang kafir dengan orang buta, dan menyerupakan orang beriman dengan orang yang dapat melihat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Tidak sama antara orang buta dan orang yang bisa melihat, yaitu orang kafir dengan orang mukmin dan orang bodoh dengan orang berilmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak sama orang yang buta dengan orang yang melihat} orang kafir dan orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Allah mengabarkan bahwa sesungguhnya tidak sama dalam hikmah (kebijaksanaan) Allah hal-hal yang berlawanan dan dalam apa-apa yang telah Allah letakkan dalam fitrah hamba-hambaNYa. Maka tidaklah “sama orang yang buta,” yaitu yang daya penglihatannya rusak, “dengan orang yang melihat. Dan tidak pula sama gelap gulita dengan cahaya. Dan tidak pula sama yang teduh dengan yang panas, dan tidak pula sama orang-orang yang hidup dan orang-orang yang mati.” Sebagaimana telah kalian akui dan tidak akan ada keraguan bahwa hal-hal yang disebutkan ini tidak sama, maka demikian pula, hendaklah kalian ketahui bahwa tidak adanya kesamaan di antara hal-hal yang berlawanan yang bersifat spiritual tentu lebih utama dan lebih utama. Maka tidak sama orang yang beriman dengan orang yang kafir, tidak sama orang yang mendapat petunjuk dengan orang yang sesat, tidak sama orang yang berilmu dengan orang yang bodoh, tidak sama pula para penghuni surge dengan penghuni neraka, dan tidak juga orang-orang yang hatinya hidup dengan orang-orang yang hatinya mati. Perbedaan dan perselisihan yang ada di antara hal-hal tersebut sangat banyak sekali, hanya Allah yang mengetahuinya secara pasti. Lalu, apabila Anda telah mengetahui tingkatan-tingkatan (nya) dan anda dapat membedakan segala sesuatu, dan apa yang sepantasnya diperlombakan untuk diraih itu sudah menjadi jelas dari lawannya, maka hendaklah orang yang mempunyai tekad sungguh-sungguh memilih untuk dirinya apa yang lebih utama baginya dan lebih berhak diutamakan. “Sesungguhnya Allah memberikan pendengaran kepada siapa yang dikehendakiNya,” pendengaran untuk memahami dan menerima. Sebab Allah-lah Yang memberi petunjuk dan taufik. “Dan kamu sekali-kali tiada sanggup menjadikan orang yang di dalam kubur dapat mendengar.” Maksudnya, orang-orang mati hatinya. Atau, sebagaimana seruanmu tidak berguna bagi para penghuni kubur sedikit pun, maka demikian pula tidak berguna bagi pembangkang lagi keras kepala sedikitpun. Kewajibanmu hanyalah memberikan peringatan dan menyampaikan apa yang karenanya kamu diutus, baik ucapanmu diterima ataupun tidak. Maka dari itu Dia berfirman, “Kamu tidak lain hanyalah seorang pemberi peringatan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 19: Allah menyampaikan sebagian permisalan sebagai penjelasan perbedaan besar antara mukmin dan kafir dengan berkata : Ketahuilah wahai manusia, bahwasanya tidaklah sama orang yang buta dan tidak melihat dengan orang yang melihat sesuatu, dengan pandangan ilmu untuk melihat, begitu juga tidaklah sama orang yang beriman dan kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan, tidak sama antara orang mukmin dengan orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 19",
    "description": "19-21. Usai menjelaskan bahwa yang mau menerima peringatan dari nabi adalah mereka yang takut kepada Allah dan menjalankan salat, pada ayat-ayat berikut Allah mendatangkan perumpamaan perbedaan antara orang mukmin dengan orang kafir. Dan tidaklah sama orang yang buta mata dan hatinya sehingga tidak dapat melihat dan menerima kebenaran, dengan orang yang melihat mata dan hatinya sehingga mau menerima kebenaran, dan tidak pula sama antara gelap gulita, yakni kesesatan atau kekafir-an, dengan cahaya, yakni petunjuk atau iman, dan tidak pula sama antara yang teduh, yakni kenyamanan dan ketenangan di surga, dengan yang panas, yakni pedihnya siksa neraka"
  }
]