[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang Allah anugerahkan untuk manusia berupa rizki, hujan, kesehatan, ilmu dan nikmat-nikmat lainnya, tidak seorang pun yang kuasa untuk menahan rahmat tersebut, sedangkan apa yang Allah tahan darinya, maka tidak seorang pun mampu melepaskannya sesudahNya. Allah Mahaperkasa yang mengalahkan segala sesuatu, Mahabijaksana yang mengirimkan rahmat dan menahannya sesuai dengan hikmahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sesungguhnya kunci-kunci segala sesuatu ada di tangan Allah, apa yang Allah bukakan bagi manusia berupa rezeki, hidayah dan kebahagiaan, maka tidak ada seorang pun yang bisa menahannya, apa yang Allah tahan dari semua itu, maka tidak ada seorang pun yang kuasa melepasnya sesudah Allah menahannya. Dia lah yang Maha Perkasa yang tidak sesuatu pun mengalahkan-Nya, Maha Bijaksana dalam penciptaan, takdir dan pengaturan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah menjelaskan bahwa rahmat yang Dia berikan kepada hamba-hamba-Nya tidak akan ada seorangpun yang mampu menghalanginya, dan jika Dia menghalangi turunnya rahmat itu maka tidak akan ada yang mampu menurunkannya. Rahmat itu ada di tangan Allah, Dia memberikannya kepada hamba-Nya yang Dia kehendaki. Allah Maha Perkasa, tidak ada yang mampu menghalangi-Nya, dan Maha Bijaksana dalam mengatur dan menetapkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مَّا يَفْتَحِ اللهُ لِلنَّاسِ مِن رَّحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ (Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya) Yakni apa yang Allah berikan bagi mereka berupa hujan, rezeki, dan kebaikan, tidak ada seorangpun yang dapat menolaknya. وَمَا يُمْسِكْ(dan apa saja yang ditahan oleh Allah) Yakni dan tidak ada yang mampu memberi hal-hal itu jika Allah menahannya. Disebutkan dari Mughirah bin Syu’bah bahwa Rasulullah jika selesai mengerjakan shalat, beliau berdoa: اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد “Ya Allah tidak ada Dzat yang mampu menghalangi terhadap orang yang Engkau berikan se-suatu kepadanya. Dan tidak ada Dzat yang mampu mem¬berikan sesuatu kepada orang yang Engkau halangi. Dan tiada berguna orang yang mempunyai keberuntungan di hadapan keberuntungan dari pada-Mu” Pendapat lain mengatakan maknanya adalah bahwa rasul-rasul diutus sebagai rahmat bagi manusia, dan tidak ada yang mampu mengutus mereka kecuali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Nikmat yang dibukakan dan diberikan Allah kepada manusia seperti kesehatan, keamanan, rejeki, pengetahuan, kenabian dan kebijaksanaan, maka tidak ada seorangpun yang mampu mencegahnya. Dan sesuatu berupa kebaikan yang dicegah Allah dari mereka, maka tidak ada seorangpun yang bisa mencegah terjadinya setelah itu kecuali Allah. Dia adalah Dzat yang Maha Kuat lagi Maha perkaya yang tidak dapat ditaklukkan dan Maha Bijaksana dalam tindakan dan pengaturannya sehingga tidak mungkin salah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang dianugerahkan} Apa yang dikirim dan diberi {Allah kepada manusia berupa rahmat} nikmat {tidak ada yang dapat menahannya} mencegahnya {Apa yang Dia tahan, maka tidak ada yang memberinya} memberinya {Dialah Dzat Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kemudian Allah menjelaskan bahwa hanya Dia yang mengatur, memberi, dan menahan (tidak memberi), seraya berfirman, “Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorang pun yang dapat menahannya; dan apa saja yang ditahan oleh Allah” dari mereka berupa bagian dari rahmatNya, “maka tidak ada seorang pun yang sanggup untuk melepaskannya sesudah itu.” Hal ini mengharuskan ketergantungan kepada Allah dan butuh kepadaNya dari segala sisi, dan mengharuskan tidak ada yang dimohon selain Dia, tidak ditakuti, dan tidak pula diharapkan kecuali Dia. “Dan Dia-lah Yang Mahaperkasa” Yang menundukkan dan menguasai segala sesuatu, “lagi Mahabijaksana,” Yang meletakkan segala sesuatu pada tempat-tempatnya yang semestinya dan menundukkannya pada kedudukannya masing-masing."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 2: Ketahuilah bahwa karunia yang diberikan Allah bagi hamba-Nya tidak dapat dihitung; Tidak ada satupun yang mampu menahan karunia-Nya, begitu juga apa yang Allah tahan dari hamba-Nya dari nikmat, tidak ada yang dapat melancarkannya atau memberikan kepada hamba-Nya, Dialah yang maha kuat, yang menguasai dan tidak dikuasai, yang memiliki hikmah dengan meletakkan urusan sesuai pada tempatnya dengan ukuran hikmah dan kemaslahatan yang Allah lihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan tentang kesendirian-Nya dalam mengatur, memberi dan menahan. Hal ini mengharuskan kita bergantung kepada Allah Ta’ala, butuh kepada-Nya dalam semua hal, dan agar kita tidak beribadah kecuali kepada-Nya. Yang berkuasa terhadap urusan-Nya. Dia meletakkan segala sesuatu pada tempatnya dan memposisikan sesuatu pada posisinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 2",
    "description": "Apa saja di antara rahmat Allah, seperti kesehatan, rezeki, ilmu, dan lainnya, yang dianugerahkan kepada manusia, maka tidak ada yang dapat menahannya; dan apa saja yang ditahan-Nya maka tidak ada yang sanggup untuk melepaskannya setelah itu. Dan dialah yang mahaperkasa untuk berbuat sesuai kehendak-Nya, mahabijaksana dalam setiap ketetapan-Nya. 3. Limpahan rahmat yang demikian besar harus menjadi pendorong bagi manusia untuk bersyukur. Wahai manusia! ingatlah akan nikmat Allah yang dilimpahkan kepadamu. Bersyukurlah dengan menaati perintah-Nya dan tidak mendurhakai-Nya. Adakah pencipta selain Allah yang dapat memberikan rezeki kepadamu dari langit dan bumi' tentu tidak ada. Tidak ada tuhan yang berhak disembah selain dia; maka mengapa kamu bisa berpaling dari tauhid'."
  }
]