[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-24. Tidak sama, orang yang buta terhadap agama Allah dengan orang yang melihat jalan kebenaran dan mengikutinya. Tidak sama, kegelapan-kegelapan kekafiran dengan cahaya iman, Tidak sama juga antara naungan dengan angin yang panas. Tidak sama orang-orang yang hatinya hidup dengan iman dengan orang-orang yang hatinya mati karena kekafiran. Engkau (wahai Rasul) tidak bisa memperdengarkan siapa yang ada dalam kubur. Dan sebagaimana engkau tidak kuasa memperdengarkan orang-orang mati dalam kubur mereka, engkau juga tidak kuasa untuk memperdengarkan orang-orang kafir tersebut karena hati mereka telah mati, engkau hanyalah pemberi peringatan bagi mereka dari hukuman dan azab Allah. Sesungguhnya Kami mengutusmu dengan membawa kebenaran, yaitu iman kepada Allah dan syariat-syariat agama, sebagai penyampai berita gembira dengan surga bagi siapa yang membenarkanmu dan mengamalkan petunjukmu, dan penyampai peringatan kepada siapa yang mendustakanmu dan mendurhakaimu dengan api neraka. Tidak ada satu umat dari umat-umat yang ada kecuali ia telah didatangi oleh rasul yang memperingatkan mereka terhadap akibat dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Orang-orang Mukmin tidak sama dengan orang-orang kafir, sebagaimana orang-orang yang hidup tidak sama dengan orang-orang yang mati. Sesungguhnya Allah membuat mendengar siapa yang hendak diberi-Nya hidayah. Sedangkan kamu -wahai Rasul- tidak kuasa memperdengarkan orang-orang kafir yang mereka itu seperti orang-orang mati di kuburan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَا يَسْتَوِى الْأَحْيَآءُ وَلَا الْأَمْوٰتُ ۚ (dan tidak (pula) sama orang-orang yang hidup dan orang-orang yang mati) Allah menyerupakan orang-orang beriman dengan orang-orang yang hidup, dan menyerupakan orang-orang kafir dengan orang-orang yang mati. Pendapat lain mengatakan yang dimaksud adalah perumpamaan antara orang yang berilmu dan orang yang bodoh. وَمَآ أَنتَ بِمُسْمِعٍ مَّن فِى الْقُبُورِ (dan kamu sekali-kali tiada sanggup menjadikan orang yang didalam kubur dapat mendengar) Yakni orang kafir yang telah hatinya telah dimatikan oleh kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dan tidak sama antara orang-orang yang hidup hatinya yaitu orang-orang mukmin dan orang-orang yang mati jiwanya yaitu orang-orang kafir. Sesungguhnya Allah mendengarkan orang yang dikehendaki untuk didengar dan diberi hidayah dari golongan para wali yang taat. Dan kamu wahai Nabi, bukanlah pendengar orang-orang kafir, pemilik hati yang mati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak sama juga orang yang hidup dengan orang yang mati. Sesungguhnya Allah memberi pendengaran kepada siapa saja yang Dia kehendaki dan kamu tidak sanggup menjadikan orang yang di dalam kubur dapat mendengar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Allah mengabarkan bahwa sesungguhnya tidak sama dalam hikmah (kebijaksanaan) Allah hal-hal yang berlawanan dan dalam apa-apa yang telah Allah letakkan dalam fitrah hamba-hambaNYa. Maka tidaklah “sama orang yang buta,” yaitu yang daya penglihatannya rusak, “dengan orang yang melihat. Dan tidak pula sama gelap gulita dengan cahaya. Dan tidak pula sama yang teduh dengan yang panas, dan tidak pula sama orang-orang yang hidup dan orang-orang yang mati.” Sebagaimana telah kalian akui dan tidak akan ada keraguan bahwa hal-hal yang disebutkan ini tidak sama, maka demikian pula, hendaklah kalian ketahui bahwa tidak adanya kesamaan di antara hal-hal yang berlawanan yang bersifat spiritual tentu lebih utama dan lebih utama. Maka tidak sama orang yang beriman dengan orang yang kafir, tidak sama orang yang mendapat petunjuk dengan orang yang sesat, tidak sama orang yang berilmu dengan orang yang bodoh, tidak sama pula para penghuni surge dengan penghuni neraka, dan tidak juga orang-orang yang hatinya hidup dengan orang-orang yang hatinya mati. Perbedaan dan perselisihan yang ada di antara hal-hal tersebut sangat banyak sekali, hanya Allah yang mengetahuinya secara pasti. Lalu, apabila Anda telah mengetahui tingkatan-tingkatan (nya) dan anda dapat membedakan segala sesuatu, dan apa yang sepantasnya diperlombakan untuk diraih itu sudah menjadi jelas dari lawannya, maka hendaklah orang yang mempunyai tekad sungguh-sungguh memilih untuk dirinya apa yang lebih utama baginya dan lebih berhak diutamakan. “Sesungguhnya Allah memberikan pendengaran kepada siapa yang dikehendakiNya,” pendengaran untuk memahami dan menerima. Sebab Allah-lah Yang memberi petunjuk dan taufik. “Dan kamu sekali-kali tiada sanggup menjadikan orang yang di dalam kubur dapat mendengar.” Maksudnya, orang-orang mati hatinya. Atau, sebagaimana seruanmu tidak berguna bagi para penghuni kubur sedikit pun, maka demikian pula tidak berguna bagi pembangkang lagi keras kepala sedikitpun. Kewajibanmu hanyalah memberikan peringatan dan menyampaikan apa yang karenanya kamu diutus, baik ucapanmu diterima ataupun tidak. Maka dari itu Dia berfirman, “Kamu tidak lain hanyalah seorang pemberi peringatan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 22: Sebagaimana tidaklah sama di antara sesuatu yang Allah telah sebutkan; Karena sungguh tidaklah serupa mereka yang hidup dengan keimanan dengan sebuah kematian yang hal itu ibarat dengan orang yang kafir (yang mati hatinya). Kemudian Allah menjelaskan bahwasanya Allah kuasa untuk mendengar doa hamba-Nya dan mengabulkannya dengan kehendak-Nya dan juga melapangkan dada hamba-Nya. Adapun engkau wahai Nabi ﷺ, maka engkau tidaklah mampu mendengar siapa yang telah mati hatinya dan menjawab orang-orang yang serupa dengan mayit yang mati di kuburnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa tidaklah sama sesuatu yang berlawanan menurut kebijaksanaan Allah dan menurut apa yang Dia tanamkan ke dalam hati hamba-hamba-Nya berupa fitrah yang selamat. Orang yang hidup adalah orang mukmin, sedangkan orang yang mati adalah orang kafir. Maksudnya, Allah memberi petunjuk kepada siapa yang Dia kehendaki dengan memberi kesanggupan untuk mendengarkan dan menerima keterangan-keterangan yang disampaikan. Maksudnya, Nabi Muhammad shallallahu 'alaihi wa sallam tidak dapat memberi petunjuk kepada orang-orang musyrik yang telah mati hatinya, sebagaimana panggilan seseorang kepada penghuni kubur tidak ada faedahnya, demikian pula seruan yang ditujukan kepada orang byang berpaling lagi membangkang, akan tetapi kewajibanmu hanyalah memberi peringatan dan menyampaikan, baik mereka menerima atau tidak sebagaimana diterangkan dalam lanjutan ayatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 22",
    "description": "22-23. Dan tidak pula sama antara orang yang hidup hatinya, yakni orang mukmin, dengan orang yang mati hatinya, yakni orang kafir. Sungguh, Allah memberikan pendengaran untuk menerima petunjuk kepada siapa yang dia kehendaki, dan engkau, wahai nabi Muhammad, tidak akan sanggup menjadikan orang yang di dalam kubur, yakni orang yang menutup hatinya dari kebenaran sehingga menyerupai orang mati, dapat mendengar. Engkau tidak akan dapat memberi petunjuk kepada orang-orang musyrik yang telah mati hatinya. Engkau tidak lain hanyalah seorang pemberi peringatan kepada manusia agar beriman kepada Allah dan tidak mendurhakai-Nya supaya terhindar dari siksa neraka"
  }
]