[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-24. Tidak sama, orang yang buta terhadap agama Allah dengan orang yang melihat jalan kebenaran dan mengikutinya. Tidak sama, kegelapan-kegelapan kekafiran dengan cahaya iman, Tidak sama juga antara naungan dengan angin yang panas. Tidak sama orang-orang yang hatinya hidup dengan iman dengan orang-orang yang hatinya mati karena kekafiran. Engkau (wahai Rasul) tidak bisa memperdengarkan siapa yang ada dalam kubur. Dan sebagaimana engkau tidak kuasa memperdengarkan orang-orang mati dalam kubur mereka, engkau juga tidak kuasa untuk memperdengarkan orang-orang kafir tersebut karena hati mereka telah mati, engkau hanyalah pemberi peringatan bagi mereka dari hukuman dan azab Allah. Sesungguhnya Kami mengutusmu dengan membawa kebenaran, yaitu iman kepada Allah dan syariat-syariat agama, sebagai penyampai berita gembira dengan surga bagi siapa yang membenarkanmu dan mengamalkan petunjukmu, dan penyampai peringatan kepada siapa yang mendustakanmu dan mendurhakaimu dengan api neraka. Tidak ada satu umat dari umat-umat yang ada kecuali ia telah didatangi oleh rasul yang memperingatkan mereka terhadap akibat dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kamu -wahai Rasul- hanyalah pemberi peringatan bagi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Hai Muhammad, Tidak lain kamu adalah seorang pemberi peringatan. Kami mengutusmu dengan membawa kebenaran, agar kamu menjadi penyeru, pemberi petunjuk, dan pemberi kabar gembira berupa surga, serta pemberi peringatan dari neraka. Dan tidak ada suatu umatpun melainkan Kami telah mengutus pemberi peringatan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِنْ أَنتَ إِلَّا نَذِيرٌ (Kamu tidak lain hanyalah seorang pemberi peringatan) Yakni kamu hanyalah seorang rasul dan pemberi peringatan, kamu tidak ditugaskan melainkan untuk memberi peringatan dan menyampaikan; sedangkan pemberian hidayah dan kesesatan berada di tangan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Wahai Nabi, kamu tidak lain hanyalah rasul pemberi peringatan orang yang bermaksiat kepadamu tentang neraka. Adapun petunjuk dan kesesatan maka itu kuasa Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak lain hanyalah seorang pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-23. Allah mengabarkan bahwa sesungguhnya tidak sama dalam hikmah (kebijaksanaan) Allah hal-hal yang berlawanan dan dalam apa-apa yang telah Allah letakkan dalam fitrah hamba-hambaNYa. Maka tidaklah “sama orang yang buta,” yaitu yang daya penglihatannya rusak, “dengan orang yang melihat. Dan tidak pula sama gelap gulita dengan cahaya. Dan tidak pula sama yang teduh dengan yang panas, dan tidak pula sama orang-orang yang hidup dan orang-orang yang mati.” Sebagaimana telah kalian akui dan tidak akan ada keraguan bahwa hal-hal yang disebutkan ini tidak sama, maka demikian pula, hendaklah kalian ketahui bahwa tidak adanya kesamaan di antara hal-hal yang berlawanan yang bersifat spiritual tentu lebih utama dan lebih utama. Maka tidak sama orang yang beriman dengan orang yang kafir, tidak sama orang yang mendapat petunjuk dengan orang yang sesat, tidak sama orang yang berilmu dengan orang yang bodoh, tidak sama pula para penghuni surge dengan penghuni neraka, dan tidak juga orang-orang yang hatinya hidup dengan orang-orang yang hatinya mati. Perbedaan dan perselisihan yang ada di antara hal-hal tersebut sangat banyak sekali, hanya Allah yang mengetahuinya secara pasti. Lalu, apabila Anda telah mengetahui tingkatan-tingkatan (nya) dan anda dapat membedakan segala sesuatu, dan apa yang sepantasnya diperlombakan untuk diraih itu sudah menjadi jelas dari lawannya, maka hendaklah orang yang mempunyai tekad sungguh-sungguh memilih untuk dirinya apa yang lebih utama baginya dan lebih berhak diutamakan. “Sesungguhnya Allah memberikan pendengaran kepada siapa yang dikehendakiNya,” pendengaran untuk memahami dan menerima. Sebab Allah-lah Yang memberi petunjuk dan taufik. “Dan kamu sekali-kali tiada sanggup menjadikan orang yang di dalam kubur dapat mendengar.” Maksudnya, orang-orang mati hatinya. Atau, sebagaimana seruanmu tidak berguna bagi para penghuni kubur sedikit pun, maka demikian pula tidak berguna bagi pembangkang lagi keras kepala sedikitpun. Kewajibanmu hanyalah memberikan peringatan dan menyampaikan apa yang karenanya kamu diutus, baik ucapanmu diterima ataupun tidak. Maka dari itu Dia berfirman, “Kamu tidak lain hanyalah seorang pemberi peringatan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 23: Allah kemudian berkata kepada Nabi-Nya ﷺ : Tidaklah engkau wahai Nabi Allah kecuali hanyalah pembawa peringatan, peringatkan manusia dan sampaikan kepada mereka agama Allah, dan tidaklah engkau dibebani dengan memberi hidayah kepada mereka; Karena hidayah adalah di tangan Allah saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 23",
    "description": "22-23. Dan tidak pula sama antara orang yang hidup hatinya, yakni orang mukmin, dengan orang yang mati hatinya, yakni orang kafir. Sungguh, Allah memberikan pendengaran untuk menerima petunjuk kepada siapa yang dia kehendaki, dan engkau, wahai nabi Muhammad, tidak akan sanggup menjadikan orang yang di dalam kubur, yakni orang yang menutup hatinya dari kebenaran sehingga menyerupai orang mati, dapat mendengar. Engkau tidak akan dapat memberi petunjuk kepada orang-orang musyrik yang telah mati hatinya. Engkau tidak lain hanyalah seorang pemberi peringatan kepada manusia agar beriman kepada Allah dan tidak mendurhakai-Nya supaya terhindar dari siksa neraka. 24. Sungguh, kami mengutus engkau, wahai nabi Muhammad, dengan membawa kebenaran agama tauhid dan hukum-hukumnya, sebagai pembawa berita gembira bahwa orang yang taat akan masuk surga, dan se-bagai pemberi peringatan bahwa orang yang durhaka akan masuk neraka. Dan tidak ada satu pun umat dari umat-umat terdahulu melainkan di sana telah datang seorang pemberi peringatan, yakni nabi atau rasul yang Allah utus untuk mengajak mereka beriman kepada Allah."
  }
]