[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-24. Tidak sama, orang yang buta terhadap agama Allah dengan orang yang melihat jalan kebenaran dan mengikutinya. Tidak sama, kegelapan-kegelapan kekafiran dengan cahaya iman, Tidak sama juga antara naungan dengan angin yang panas. Tidak sama orang-orang yang hatinya hidup dengan iman dengan orang-orang yang hatinya mati karena kekafiran. Engkau (wahai Rasul) tidak bisa memperdengarkan siapa yang ada dalam kubur. Dan sebagaimana engkau tidak kuasa memperdengarkan orang-orang mati dalam kubur mereka, engkau juga tidak kuasa untuk memperdengarkan orang-orang kafir tersebut karena hati mereka telah mati, engkau hanyalah pemberi peringatan bagi mereka dari hukuman dan azab Allah. Sesungguhnya Kami mengutusmu dengan membawa kebenaran, yaitu iman kepada Allah dan syariat-syariat agama, sebagai penyampai berita gembira dengan surga bagi siapa yang membenarkanmu dan mengamalkan petunjukmu, dan penyampai peringatan kepada siapa yang mendustakanmu dan mendurhakaimu dengan api neraka. Tidak ada satu umat dari umat-umat yang ada kecuali ia telah didatangi oleh rasul yang memperingatkan mereka terhadap akibat dari kekafiran dan kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sesungguhnya Kami mengutusmu -wahai Rasul- dengan membawa kebenaran yang tidak ada keraguan padanya, sebagai pembawa kabar gembira bagi orang-orang Mukmin dengan apa yang telah Allah sediakan bagi mereka berupa pahala yang mulia, sebagai pemberi peringatan bagi orang-orang kafir dengan apa yang telah disiapkan bagi mereka berupa azab yang pedih. Tidak ada satu umat pun dari umat-umat terdahulu kecuali telah diutus kepadanya utusan Allah yang memperingatkannya dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. إِنَّآ أَرْسَلْنٰكَ بِالْحَقِّ (Sesungguhnya Kami mengutus kamu dengan membawa kebenaran) Yakni dengan janji yang benar. بَشِيرًا(sebagai pembawa berita gembira) Bagi orang yang taat. وَنَذِيرًا ۚ( dan sebagai pemberi peringatan) Bagi orang yang bermaksiat. وَإِن مِّنْ أُمَّةٍ إِلَّا خَلَا فِيهَا نَذِيرٌ(Dan tidak ada suatu umatpun melainkan telah ada padanya seorang pemberi peringatan) Yakni tidak ada umat terdahulu kecuali telah ada Nabi yang memberi peringatan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Wahai Nabi, sesungguhnya Kami mengutusmu dengan dibarengi kebenaran yaitu petunjuk dan agama yang haq, sebagai pemberi kabar gembira tentang surga kepada orang yang menaatimu dan pemberi peringatan tentang neraka kepada orang yang bermaksiat kepadamu. Tidak ada perkumpulan kecuali didatangi oleh rasul pemberi peringatan tentang perbuatan maksiat dan pemberi kabar gembira karena peringatan itu berhubungan dengan kabar gembira"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami mengutusmu dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Tidak ada satu umat pun, kecuali telah datang} berlalu {kepadanya seorang pemberi peringatan} nabi yang memberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Sesungguhnya Kami mengutus kamu dengan membawa kebenaran.” Maksudnya, Kami mengutusmu hanya dengan kebenaran. Sebab Allah mengutusmu pada saat kekosongan para rasul dan lenyapnya jalan-jalan (kebenaran), terhapusnya ilmu dan kebutuhan yang sangat mendesak kepada penugasanmu sebagai rasul. Maka Allah mengutusmu sebagai rahmat bagi semesta alam. Demikian pula, apa yang karenanya Kami mengutusmu, yaitu agama yang benar dan jalan yang lurus itu adalah haq, bukan kepalsuan, dan demikian pula apa yang Kami utuskan kepadamu, yaitu al-Quran yang agung dan Dzikir yang penuh hikmah, yang termuat di dalamnya adalah haq dan kebenaran. Ia merupakan “pembawa berita gembira,” bagi siapa saja yang patuh kepadamu, yaitu kabar gembira dengan pahala dunia dan akhirat dari Allah. “Dan sebagai pemberi peringatan” bagi siapa saja yang durhaka terhadapmu, yaitu dengan azab Allah di dunia ini dan di akhirat nanti. Kamu bukanlah hal yang baru dari para rasul. Maka tidaklah ada “suatu umat pun” dari umat-umat yang terdahulu dan dari generasi-generasi yang silam “melainkan telah ada padanya seorang pemberi peringatan,” yang menegakkan hujjah Allah atas mereka, \"yaitu agar orang yang binasa itu binasanya dengan keterangan yang nyata dan agar orang yang hidup itu hidupnya dengan keterangan yang nyata (pula).\" (Al-Anfal:42)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 24: Allah berkata kepada Nabi-Nya ﷺ juga : Sungguh Allah mengutusmu wahai Nabi Allah dengan tauhid dan agama yang benar, berilah kabar gembira kepada siapa yang beriman kepada Allah dan mengikutimu dan peringatkan serta waspadai siapa yang kufur kepada Allah dan mendustakanmu. Dan tidaklah umat-umat yang terdahulu kecuali telah di utus para rasul pemberi peringatan, yang mereka memerintahkan untuk beribadah kepada Allah saja dan meninggalkan ibadah kepada selain-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan membawa petunjuk karena manusia membutuhkannya, dan lagi ketika itu belum ada rasul, pengetahuan agama hilang dan manusia sangat butuh sekali kepada petunjuk, maka Allah mengutus Nabi-Nya Muhammad shallallahu 'alaihi wa sallam sebagai rahmat kepada alam semesta. Allah mengutus Beliau dengan membawa agama yang lurus dan jalan yang lurus, ia merupakan kebenaran dan Allah menurunkan kepada Beliau Al Qur’an juga sebagai kebenaran. Kepada orang yang mau memenuhi seruan (beriman) dengan pahala segera atau ditunda. Kepada orang yang tidak mau memenuhi seruan (kafir) dengan azab Allah segera atau ditunda.. Yakni seorang nabi yang memberi peringatan untuk menegakkan hujjah. Oleh karena itu, Beliau bukanlah seorang rasul yang baru."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 24",
    "description": "Sungguh, kami mengutus engkau, wahai nabi Muhammad, dengan membawa kebenaran agama tauhid dan hukum-hukumnya, sebagai pembawa berita gembira bahwa orang yang taat akan masuk surga, dan se-bagai pemberi peringatan bahwa orang yang durhaka akan masuk neraka. Dan tidak ada satu pun umat dari umat-umat terdahulu melainkan di sana telah datang seorang pemberi peringatan, yakni nabi atau rasul yang Allah utus untuk mengajak mereka beriman kepada Allah. 25. Dan jika mereka mendustakanmu, wahai nabi Muhammad, maka bersabarlah layaknya rasul-rasul terdahulu bersabar menghadapi penolakan umatnya. Sungguh, orang-orang yang sebelum mereka pun telah mendustakan rasul-rasul; ketika rasul-rasulnya datang dengan membawa keterangan yang nyata, yakni mukjizat yang menjadi bukti benarnya risalah mereka, zubur, dan kitab yang memberi penjelasan yang sempurna. Allah memberi petunjuk kepada orang yang dia kehendaki dengan memberinya kesanggupan untuk mendengarkan dan menerima ke-terangan yang nyata."
  }
]