[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila orang-orang musyrik itu mendustakanmu, maka sungguh orang-orang sebelum mereka telah mendustakan rasul-rasul mereka yang datang kepada mereka dengan membawa mukjizat-mikjizat yang nyata yang menunjukkan kenabian mereka. Para utusan itu juga datang membawa kitab-kitab yang menghimpun hokum-hukum dalam jumlah besar, mendatangkan kitab yang terang yang menjelaskan jalan kebaikan dan jalan keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Bila kaummu -wahai Rasul- mendustakanmu, maka bersabarlah karena kamu bukan rasul pertama yang didustakan oleh kaumnya. Umat-umat terdahulu telah mendustakan para rasul mereka seperti 'Ād, Ṡamūd dan kaum Lūṭ. Rasul-rasul mereka datang kepada mereka membawa hujah-hujah yang jelas dan mukjizat-mukjizat mencengangkan yang membuktikan kebenaran mereka, para rasul itu juga datang membawa suhuf-suhuf dan kitab yang bercahaya bagi orang yang merenungkan dan memikirkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Jika mereka tetap mendustakan, maka pendustaan memang sudah menjadi tabiat orang kafir dan sesat, sebagaimana yang dilakukan orang-orang sebelum mereka terhadap para rasul yang datang membawa ayat-ayat yang jelas dan mukjizat-mukjizat yang menakjubkan serta kitab-kitab yang diturunkan dari Allah. Maka lihatlah bagaimana balasan dan kesudahan orang-orang kafir, dan siksaan berat mereka, sehingga mereka menjadi ibrah bagi orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَإِن يُكَذِّبُوكَ فَقَدْ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ (Dan jika mereka mendustakan kamu, maka sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasulnya)) Yakni umat-umat terdahulu telah mendustakan Nabi-Nabi mereka. جَآءَتْهُمْ رُسُلُهُم بِالْبَيِّنٰتِ(kepada mereka telah datang rasul-rasulnya dengan membawa mukjizat yang nyata) Yakni mukjizat yang jelas, dan bukti yang terang. وَبِالزُّبُرِ(zubur) Yakni dengan kitab-kitab yang tertulis, seperti suhuf-suhuf Ibrahim. وَبِالْكِتٰبِ الْمُنِيرِ(dan kitab yang memberi penjelasan yang sempurna) Seperti kitab Taurat dan Injil. Terdapat pendapat mengatakan yang dimaksud dengan (البينات) adalah mukjizat, dan (الزبر) adalah kitab-kitab yang mengandung nasehat-nasehat dan peringatan, serta (الكتاب) yakni kitab yang mengandung syari’at-syari’at dan hukum-hukum."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Wahai Nabi, Jika orang-orang musyrik di Mekah mendustakanmu, sungguh umat-umat terdahulu juga mendustakan nabi-nabi mereka. Ini bukanlah hal baru. Maka janganlah bersedih. Para Rasul mendatangi mereka dengan mukjizat, dalil-dalil yang jelas, kitab-kitab Tuhan yang tertulis seperti shuhuf Ibrahim dan Musa, serta kitab yang diberi cahaya terang yang di dalamnya terkandung syariat-syariat dan hukum seperti kitab Taurat dan Injil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka mendustakanmu, sungguh orang-orang yang sebelum mereka pun telah mendustakan. Telah datang rasul-rasul mereka dengan membawa keterangan} keterangan nyata yang menunjukkan pada kebenaran mereka {zubur} lembaran-lembaran yang tertulis {dan kitab yang memberi penerangan} kitab yang jelas bagi orang yang merenungi dan memperhatikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Maknanya: Jika mereka, kaum musyrikin, mendustakanmu, wahai Rasul maka engkau bukanlah rasul pertama yang didustakan, “maka sungguh orang-orang yang sebelum mereka telah mendustakan; kepada mereka telah datang rasul-rasulNya dengan membawa mukjizat yang nyata” yang membuktikan kebenaran dan kejujuran mereka dalam apa yang mereka beritakan, “dan dengan zubur,”maksudnya kitab-kitab yang tertulis, yang di dalamnya terhimpun berbagai hukum-hukum Allah, “dan kitab yang memberikan cahaya,” yakni, yang memberikan penjelasan di dalam berita-beritanya yang benar dan hukum-hukumnya yang adil. Jadi, pendustaan mereka terhadap para rasul itu bukan karena ketidakjelasan atau kelemahan ajaran yang disampaikan oleh para rasul, melainkan disebabkan oleh kezhaliman dan sikap keras kepala mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 25: Allah menghibur Nabi-Nya Muhammad ﷺ dengan berkata kepadanya : Maka jika mereka orang-orang musyrik mendustakanmu, maka juga telah didustakan nabi-nabi dan para rasul sebelummu setela datang kepada mereka ayat-ayat yang jelas, dan petunjuk-petunjuk yang terang (nampak), maka ketika telah datang utusan kepada mereka dan kitab yang diturunkan dari sisi Allah, mereka mendustakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wahai rasul, maka engkau bukanlah rasul pertama yang didustakan. Zubur ialah lembaran-lembaran yang berisi wahyu yang diberikan kepada nabi-nabi sebelum Nabi Muhammad shallallahu 'alaihi wa sallam yang isinya mengandung hukum dan hikmah. Yakni yang bersinar beritanya dan adil hukumnya seperti Taurat dan Injil. Oleh karena itu, pendustaan mereka kepada para rasul bukanlah karena ketidakjelasan atau karena kurang pada apa yang dibawa rasul, bahkan disebabkan kezaliman dan pembangkangan mereka"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 25",
    "description": "Dan jika mereka mendustakanmu, wahai nabi Muhammad, maka bersabarlah layaknya rasul-rasul terdahulu bersabar menghadapi penolakan umatnya. Sungguh, orang-orang yang sebelum mereka pun telah mendustakan rasul-rasul; ketika rasul-rasulnya datang dengan membawa keterangan yang nyata, yakni mukjizat yang menjadi bukti benarnya risalah mereka, zubur, dan kitab yang memberi penjelasan yang sempurna. Allah memberi petunjuk kepada orang yang dia kehendaki dengan memberinya kesanggupan untuk mendengarkan dan menerima ke-terangan yang nyata. 26. Karena mereka memilih tetap dalan kekafiran, kemudian aku azab orang-orang yang kafir sebagai balasan atas kedurhakaan mereka; maka lihatlah bagaimana akibat kemurkaan-ku, yakni siksaanku kepada mereka."
  }
]