[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Aku menimpakan berbagai macam azab kepada orang-orang kafir. Maka perhatikanlah bagaimana pengingkaranKu terhadap perbuatan mereka dan turunnya hukumanKu atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sekalipun demikian, mereka tetap kafir kepada Allah dan kepada para rasul-Nya, mereka tidak membenarkan para rasul tentang ajaran yang mereka bawa dari sisi Allah. Maka Aku membinasakan orang-orang kafir. Maka perhatikanlah -wahai Rasul- bagaimana pengingkaran-Ku atas mereka manakala Aku membinasakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. فَكَيْفَ كَانَ نَكِيرِ (maka (lihatlah) bagaimana (hebatnya) akibat kemurkaan-Ku) Yakni bagaimana keingkaran-Ku terhadap mereka dan siksaan-Ku bagi mereka?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Kemudian Aku (Allah) menghukum orang-orang kafir akibat dosa-dosa mereka, lalu bagaimana bisa Aku ingkar terhadap mereka atas hukuman dan pembinasaan itu?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Aku mengazab orang-orang yang ingkar. Maka bagaimana akibat pengingkaranKu} peingingkaranKu dan hukumanKu terhadap mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Kemudian Aku azab orang-orang yang kafir” dengan berbagai macam siksaan, “maka bagaimana akibat kemurkaanKu” terhadap mereka? Ia benar-benar kemurkaan yang paling keras dan penyiksaan yang paling besar. Maka jangan sekali-kali kalian mendustakan Rasul yang mulia ini, sebab kalian akan ditimpa azab yang sangat pedih dan kehinaan yang sangat nista sebagaimana telah menimpa orang-orang (yang telah mendustakan para rasul sebelumnya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 26: Allah mengabarkan bahwa Dia membinasakan mereka yang mendustakan para rasul mereka yang datang kepada mereka, maka lihatlah wahai Nabi Allah bagaimana adzab Allah kepada mereka ?! Dan bagaimana mereka Allah binasakan ?! Sungguh adzab Allah dahsyat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan berbagai hukuman. Yakni akibat pengingkaran-Ku kepada mereka dengan menghukum dan membinasakan mereka. Oleh karena itu, janganlah kamu mendustakan rasul yang mulia ini (Nabi Muhammad shallallahu 'alaihi wa sallam), sehingga nantinya kamu akan ditimpa seperti yang menimpa mereka, berupa azab yang pedih dan memperoleh kehinaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 26",
    "description": "Karena mereka memilih tetap dalan kekafiran, kemudian aku azab orang-orang yang kafir sebagai balasan atas kedurhakaan mereka; maka lihatlah bagaimana akibat kemurkaan-ku, yakni siksaanku kepada mereka. 27. Setelah menjelaskan kemurkaan-Nya kepada kaum kafir, Allah lalu menyusulinya dengan menyebutkan bukti-bukti kekuasaan-Nya di alam semesta yang dapat disaksikan oleh manusia. Tidakkah engkau melihat bahwa Allah menurunkan air hujan dari langit lalu dengan air itu kami hasilkan buah-buahan yang beraneka macam jenis, warna, dan rasa-Nya. Dan engkau juga bisa melihat di antara gunung-gunung itu tampak ada garis-garis putih dan merah yang beraneka macam warnanya dan ada pula yang berwarna hitam pekat."
  }
]