[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak melihat bahwa Allah menurunkan hujan dari langit, lalu Kami menyiramkannya ke pohon-pohon itu di bumi, lalu Kami mengeluarkan dari pohon-pohon itu buah-buahan yang bermacam-macam warnanya, ada yang merah, ada yang hitam, ada yang kuning dan ada yang lain? Dan kami menciptakan gunung dengan keanekaragamannya, ada yang putih dan ada yang merah, dengan berbagai macam warna, dan Kami menciptakan gunung dengan batunya yang sangat hitam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Tidakkah kamu melihat -wahai Rasul- bahwa Allah menurunkan air hujan dari langit, lalu Kami mengeluarkan dengan hujan itu buah-buahan yang warnanya berbeda-beda, ada yang merah, hijau, kuning dan lainnya sesudah Kami menyiram pohonnya dengan hujan. Dan di antara gunung-gunung, ada yang putih dan ada yang merah dan ada yang hitam kelam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-28. Tidakkah kamu melihat ke langit ketika menurunkan hujan, sehingga tanah dapat menumbuhkan tanaman dan pepohonan; buah-buahannya bermunculan dari kelopaknya dengan berbagai warna yang indah, siapakah yang menciptakan keindahan ini dan memberikan warna? Tidakkah kamu melihat pegunungan dan jalan yang ada di antaranya yang berwarna-warni; ada yang putih dan merah dengan kepekatan yang berbeda-beda, dan ada yang hitam pekat. Begitu pula dengan manusia, binatang melata, dan binatang ternah; mereka memiliki warna yang berbeda-beda. Sungguh orang yang benar-benar takut kepada Allah adalah orang-orang yang mengenal dan mengetahui-Nya, yang menghayati ayat-ayat kauniyah-Nya, dan mencermati betapa menakjubkan dan luar biasa ciptaan Allah. Allah Berkuasa melakukan segalanya; Dia memuliakan para kekasih-Nya dan mengampuni hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَأَخْرَجْنَا بِهِۦ ثَمَرٰتٍ مُّخْتَلِفًا أَلْوٰنُهَا ۚ (lalu Kami hasilkan dengan hujan itu buah-buahan yang beraneka macam jenisnya) Sebagiannya berwarna putih, merah, kuning, hijau, atau hitam. وَمِنَ الْجِبَالِ جُدَدٌۢ( Dan di antara gunung-gunung itu ada garis-garis) Yakni jalan dan celah-celah yang ada di gunung-gunung seperti urat-urat. بِيضٌ وَحُمْرٌ مُّخْتَلِفٌ أَلْوٰنُهَا وَغَرَابِيبُ سُودٌ(putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat) Makna (الغرابيب) adalah hitam pekat seperti warna yang terdapat pada burung gagak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Apakah kamu tidak mengetahui bahwa hanya dengan kekuasaan dan hikmahNya Dia menurunkan hujan dari awan. Kemudian melalui hujan itu, Kami mengeluarkan (berpaling dari objek orang ketiga menjadi subjek yang berbicara) buah-buahan yang berbeda-beda jenis dan warnanya. Dia juga menciptakan gunung-gunung yang berbeda warnanya. Di dalamnya terdapat jalan dan garis-garis warna yang terbentuk seperti pembuluh darah, ada yang putih, merah dan hitam. Kepekatan warna hitam itu menyerupai warna gagak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak melihat bahwa sesungguhnya Allah menurunkan air dari langit, lalu dengan air itu Kami mengeluarkan hasil tanaman yang beragam warnanya. Di antara gunung-gunung itu ada bergaris-garis} jalur-jalur dan garis-garis {putih dan merah yang beragam warnanya dan ada yang hitam pekat} jalur yang sangat gelap seperti warna gagak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Allah mengingatkan bahwa Dia menciptakan segala sesuatu yang berlawanan yang asalnya adalah satu dan materinya pun satu (sama), namun terdapat perbedaan yang sangat jauh sebagaimana dapat kita lihat dan kita saksikan, untuk membuktikan kepada hamba-hambaNya kesempurnaan KuasaNya dan keindahan HikmahNya: 27. Di antaranya adalah bahwa sesungguhnya Allah menurunkan air (hujan) dari langit, kemudian dengan air hujan itu Dia menumbuhkan berbagai jenis buah-buahan dan tumbuh-tumbuhan yang beragam seperti yang disaksikan oleh orang-orang yang memperhatikannya. Padahal airnya sama dan tanahnya pun sama. Dan di antaranya juga adalah gunung-gunung yang dijadikan sebagai pasak bumi oleh Allah, Anda menjumpainya sebagai gunung-gunung yang menyatu, bahkan satu gunung, dan padanya terdapat banyak warna, ada “garis-garis putih,” maksudnya, jalan-jalan putih, da nada pula “yang hitam pekat,” maksudnya, sangat hitam sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 27: Allah mengabarkan akan kesempurnaan kuasa-Nya, Allah berkata : Sungguh telah Aku ketahui wahai manusia, bahwa Allahlah yang menurunkan air dari langit yang kemudian pepohonan tersirami; Keluarlah dari pepohonan itu buah-buahan beraneka macam warnanya. Allah menjadikan gunung-gunung sebagai pasak bagi bumi, Allah juga menjadikan hasil tambangan beraneka macam yang menunjukkan kebesaran kuasa Allah dan indahnya apa yang Dia buat; Maha suci Allah dari apa yang melemahkan-Nya di bumi dan di langit. Makhluk-makhluk-Nya diciptakan dengan sebaik-baik rupa, ini menunjukkan kuasa Allah atas makhluk-Nya yang beraneka ragam dari sesuatu yang satu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan ciptaan-Nya yang beraneka macam di mana asalnya adalah satu dan materinya juga satu, namun terjadi perbedaan yang mencolok sebagaimana yang kita saksikan, untuk menunjukkan kepada hamba-hamba-Nya betapa sempurnanya kekuasaan-Nya dan betapa indah kebijaksanaan-Nya. Contoh dalam hal ini adalah, Allah Subhaanahu wa Ta'aala menurunkan air dari langit, lalu Dia mengeluarkan daripadanya tumbuh-tumbuhan dan buah-buahan yang beraneka macam sebagaimana yang kita saksikan, padahal airnya satu macam dan tanahnya juga satu macam. Termasuk pula gunung-gunung yang Allah jadikan sebagai pasak di bumi, kita dapat melihat gunung-gunung yang yang berbeda-beda, bahkan satu gunung saja ada beberapa warna pada jalannya; ada jalan yang berwarna putih, ada yang berwarna kuning dan merah, bahkan ada yang berwarna hitam pekat. Termasuk pula manusia, hewan melata dan hewan ternak sebagaimana diterangkan dalam ayat selanjutnya, yakni pada mereka juga terdapat keanekaragaman warna, sifat, suara, dan rupa sebagaimana yang kita lihat, padahal semuanya dari asal dan materi yang satu. Perbedaan itu merupakan dalil ‘aqli (akal) yang menunjukkan kepada kehendak Allah Subhaanahu wa Ta'aala yang mengkhususkan masing-masingnya dengan warna tertentu dan sifat tertentu. Demikian pula menunjukkan qudrat (kekuasaan) Allah Subhaanahu wa Ta'aala yang mengadakan hal itu, dan menunjukkan hikmah dan rahmat-Nya, di mana adanya perbedaan itu terdapat berbagai maslahat dan manfaat, dapat mengenal jalan dan mengenal antara yang satu dengan yang lain, berbeda jika sama tentu sulit dikenali. Yang demikian juga menunjukkan luasnya ilmu Allah Subhaanahu wa Ta'aala, dan bahwa Dia akan membangkitkan manusia yang berada dalam kubur, akan tetapi orang yang lalai melihat hal itu dengan pandangan yang lalai, tidak membuatnya sadar. Oleh karena itulah hanya orang-orang yang takut kepada Allah-lah yang dapat mengambil manfaat darinya, dan dengan pikirannya yang lurus dapat membuatnya mengetahui hikmahnya sebagaimana diterangkan dalam ayat selanjutnya. Judad di ayat tersebut bisa diartikan jalan di pegunungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 27",
    "description": "Setelah menjelaskan kemurkaan-Nya kepada kaum kafir, Allah lalu menyusulinya dengan menyebutkan bukti-bukti kekuasaan-Nya di alam semesta yang dapat disaksikan oleh manusia. Tidakkah engkau melihat bahwa Allah menurunkan air hujan dari langit lalu dengan air itu kami hasilkan buah-buahan yang beraneka macam jenis, warna, dan rasa-Nya. Dan engkau juga bisa melihat di antara gunung-gunung itu tampak ada garis-garis putih dan merah yang beraneka macam warnanya dan ada pula yang berwarna hitam pekat. 28. Dan demikian pula di antara manusia, makhluk bergerak yang bernyawa, seperti ular, dan hewan-hewan ternak, seperti ayam, kambing, dan lainnya, ada yang bermacam-macam warna dan jenis-Nya sebagaimana buah-buahan dan gunung-gunung itu. Dan di antara hamba-hamba Allah, yang takut kepada-Nya hanyalah para ulama, yakni orang-orang yang mengetahui kebesaran dan kekuasaan Allah. Sungguh, Allah mahaperkasa, maha pengampun. Dia akan menghukum orang kafir dan tidak memerlukan bantuan apa pun dari hamba-Nya, namun dia juga mengampuni dosa-dosa mereka yang tulus bertobat."
  }
]