[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami juga menciptakan manusia, hewan-hewan, unta, sapi dan kambing dengan warna yang berbeda-beda pula, ada yang merah, putih, hitam dan ada yang lainnya, seperti perbedaan warna buah-buahan dan gunung-gunung. Sesungguhnya yang takut kepada Allah dan membentengi diri dari azab Allah dengan menaatiNya dan menjauhi laranganNya adalah para ulama, orang-orang yang mengetahuiNya, mengetahui sifat-sifatNya, SyariatNya dan KuasaNya atas segala sesuatu, yang di antaranya adalah perbedaan makhluk-makhluk ini sekalipun penciptanya adalah satu, dan mereka merenungkan nasihat-nasihat dan pelajaran-pelajaran yang ada padanya. Sesungguhnya Allah Mahaperkasa lagi MahaKuat yang tidak terkalahkan, juga Maha pengampun yang memberi pahala kepada orang-orang yang menaatiNya dan memaafkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Manusia, binatang melata, binatang ternak (unta, sapi dan domba), warna mereka juga berbeda-beda. Yang mengagungkan kedudukan Allah dan yang takut kepada-Nya hanyalah para ulama yang mengetahui Allah, karena mereka mengetahui sifat-sifat-Nya, syariat-syariat-Nya dan bukti-bukti kemahakuasaan-Nya. Sesungguhnya Allah Mahaperkasa yang tidak ada suatu pun mengalahkan-Nya, Maha Pengampun terhadap dosa-dosa orang yang bertobat di antara hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَمِنَ النَّاسِ وَالدَّوَآبِّ وَالْأَنْعٰمِ مُخْتَلِفٌ أَلْوٰنُهُۥ (Dan demikian (pula) di antara manusia, binatang-binatang melata dan binatang-binatang ternak ada yang bermacam-macam warnanya) Yakni ciptaan yang bermacam-macam warnanya seperti warna buah-buahan dan gunung-gunung yang bermacam-macam. Allah menyebutkan macam-macam warna dalam makhluk-makhluk itu karena warna yang bermacam-macam merupakan bukti yang jelas atas kekuasaan Allah dan kesempurnaan ciptaan-Nya. Oleh sebab itu Allah menyebutkan perbedaan warna pada buah-buahan, benda-benda mati, manusia, dan hewan-hewan. إِنَّمَا يَخْشَى اللهَ مِنْ عِبَادِهِ الْعُلَمٰٓؤُا۟ ۗ (Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama) Yakni orang yang takut kepada Allah dengan ghaib hanyalah orang-orang yang mengetahui-Nya serta mengetahui sifat-sifat dan perbuatan Allah yang sesuai dengan keagungan-Nya. Maka barangsiapa yang lebih mengetahui Allah maka ia akan semakin takut kepada-Nya, dan barangsiapa yang tidak takut kepada Allah maka ia bukanlah orang yang mengetahui-Nya. Dan yang dimaksud dengan orang yang mengetahui-Nya adalah yang mengetahui hakikat warna yang bermacam-macam dan lain sebagainya merupakan ciptaan Allah. Dan rasa takut orang yang mengetahui hal ini selagi dia adalah orang yang beriman adalah rasa takut yang lebih besar daripada rasa takut orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Dia (Allah) juga menciptakan ciptaan lain berupa manusia, hewan melata dan hewat ternak sebagai ciptaan yang berbeda-beda warnanya seperti perbedaan buah-buahan dan gunung-gunung dalam ukuran dan warnanya. Sesungguhnya di antara hamba-hamba Allah yang takut kepadaNya adalah orang-orang yang mengetahui Allah melalui sifat-sifat dan tindakan-tindakanNya karena mereka menyadari keakuratan ciptaan Allah SWT, sehingga mereka mengagungkanNya dengan sebenar-benar keagungan. Sesungguhnya Allah adalah Dzat yang Maha Kuat, Maha Perkasa dan Maha Kuasa serta Maha Pengampun bagi dosa hamba-hambaNya yang bertaubat dan beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara manusia, makhluk bergerak yang bernyawa, dan hewan-hewan ternak ada yang beragam warnanya. Sesungguhnya yang takut kepada Allah di antara hamba-hambaNya hanyalah orang-orang yang alim. Sesungguhnya Allah Maha perkasa lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Dan termasuk di antaranya juga adalah manusia, binatang melata dan binatang-binatang ternak berkaki empat, padanya terdapat perbedaan warna, perbedaan bulu, bunyi (suara), dan bentuk, sebagaimana dapat dilihat dengan pandangan mata dan dapat disaksikan oleh orang-orang yang memperhatikannya. Semuanya berasal dari asal dan materi yang sama. Maka perbedaannya merupakan dalil (bukti) rasional atas masyi’ah (kehendak) Allah yang telah memberikan keistimewaan pada masing-masing dengan warna dan sifatnya, (dan menunjukkan kepada) Kuasa Allah di mana Dia telah menciptakannya seperti itu, dan menunjukkan kepada hikmah dan rahmatNya di mana perbedaan dan keragaman itu mempunyai banyak maslahat dan berbagai manfaat, untuk mengenal jalan-jalan, mengenal manusia satu sama lainnya sebagaimana telah dimaklumi. Dan hal itu juga merupakan dalil (bukti) yang menunjukkan kemahaluasan ilmu Allah, dan sesungguhnya Dia pasti akan membangkitkan orang-orang yang ada di dalam kubur. Namun, orang yang lalai melihat hal-hal di atas dengan penglihatan kelalaian yang tidak bisa menimbulkan kesadaran baginya. Sesungguhnya yang dapat mengambil pelajaran darinya hanyalah orang yang takut kepada Allah dan berusaha mengetahui dengan pikiran-pikirannya yang focus apa yang menjadi hikmah dari makhluk-makhluk tersebut. Maka dari itu Allah berfirman, “SEsungguhnya yang takut kepada Allah di antara hamba-hambaNya, hanyalah ulama.” Maka setiap orang yang lebih mengenal Allah, ia akan menjadi lebih takut kepadaNYa, dan takutnya kepada Allah menjadikannya menahan diri dari perbuatan maksiat dan selalu bersiap untuk perjumpaan dengan Tuhan yang ditakutinya. Ini merupakan satu dalil yang menunjukkan tingginya keutamaan ilmu, sebab ilmu mengajak takut kepada Allah, dan orang-orang yang takut kepadaNYa adalah orang-orang yang dianugerahi karamah, sebagaimana FirmanNYa, \"Allah rida terhadap mereka dan mereka pun rida kepada-Nya. Yang demikian itu adalah (balasan) bagi orang yang takut kepada Tuhannya.\" (Al-Bayyinah:8) “Sesungguhnya Allah Mahaperkasa,” yakni, Maha sempurna keperkasaanNYa; dan di antara keperkasaanNya adalah Dia menciptakan makhluk-makhluk yang berbeda-beda itu. “Lagi Maha Pengampun” terhadap dosa-dosa orang-orang yang bertaubat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 28: Allah menjelaskan bahwa perbedaan warna bukanlah hanya pada buah-buahan dan pegunungan, akan tetapi juga terjadi kepada manusia, Dialah yang maha suci yang menciptakan Adam dan istrinya Hawa, kemudian dari keduanya Allah ciptakan anak keturunannya berkulit merah, putih, kuning, hitam dan Allah ciptakan juga hewan melata dan binatang ternak, Allah jadikan bergolong-golongan dan beraneka ragam dalam warna kulit. Maka lihatlah kebanyakan manusia yang lali dari ciptaan-Nya. Sesungguhnya yang takut di antara mereka adalah ulama yang tahu bahwasanya makhluk-makhluk Allah tidak diciptakan dengan tujuan sia-sia. Karena mereka semua memiliki tanggung jawab atas apa yang mereka perbuat, yang dimaksud bukanlah ulama syariah saja; Akan tetapi setiap ulama yang teranggap dan pemikir dari ulama alam. pengobatan, dan selainnya yang mereka mengetahui dan berilmu. Ketahuilah bahwa Allah maha kuat, gagah yang tidak ada yang dapat melemahkan-nya sesuatu apapun, maha pengampun bagi yang bertaubat dari hamba-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, orang yang lebih mengenal Allah, maka akan bertambah rasa takutnya, di mana hal itu akan membuatnya menahan diri dari maksiat dan mempersiapkan diri untuk bertemu dengan Zat yang dia takuti. Ayat ini menunjukkan keutamaan ilmu, karena ilmu menambah seseorang takut kepada Allah, dan orang-orang yang takut kepada Allah itulah orang-orang yang mendapatkan keistimewaan dari-Nya, sebagaimana firman Allah Ta’ala, “Balasan mereka di sisi Tuhan mereka ialah surga 'Adn yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Allah ridha terhadap mereka dan mereka pun ridha kepada-Nya. Yang demikian itu adalah (balasan) bagi orang yang takut kepada Tuhannya.” (terj. Al Bayyinah: 8) Yakni Mahasempuna keperkasaan-Nya, di mana dengan keperkasaan-Nya Dia menciptakan makhluk yang beraneka macam itu. Dosa-dosa hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 28",
    "description": "Dan demikian pula di antara manusia, makhluk bergerak yang bernyawa, seperti ular, dan hewan-hewan ternak, seperti ayam, kambing, dan lainnya, ada yang bermacam-macam warna dan jenis-Nya sebagaimana buah-buahan dan gunung-gunung itu. Dan di antara hamba-hamba Allah, yang takut kepada-Nya hanyalah para ulama, yakni orang-orang yang mengetahui kebesaran dan kekuasaan Allah. Sungguh, Allah mahaperkasa, maha pengampun. Dia akan menghukum orang kafir dan tidak memerlukan bantuan apa pun dari hamba-Nya, namun dia juga mengampuni dosa-dosa mereka yang tulus bertobat. 29-30. Pada ayat ini Allah menyebutkan sebagian tanda orang yang takut kepada-Nya. Sesungguhnya orang-orang yang selalu membaca kitab Allah, yakni Al-Qur'an, lalu mereka mengkaji dan mengamalkan kan-dungannya, dan melaksanakan salat dengan sempurna syarat dan rukunnya, dan menginfakkan sebagian rezeki yang kami anugerahkan kepada-Nya dengan diam-diam dan terang-terangan, baik dalam keadaan lapang maupun sempit, mereka itu mengharapkan perdagangan dengan Allah yang tidak akan pernah rugi, agar Allah menyempurnakan pahalanya kepada mereka dan menambah karunia-Nya. Sungguh, Allah maha pengampun segala khi-laf dan dosa, maha mensyukuri, yakni memberi pahala atas perbuatan baik hamba-Nya, memaafkan kesalahannya, menambah nikmat-Nya, dan sebagainya."
  }
]