[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Sesungguhnya orang-orang yang membaca al-Qur’an dan mengamalkannya, menjaga shalat pada waktunya, menafkahkan dari apa yang Kami rizkikan kepada mereka dengan berbagai bentuk nafkah, baik yang wajib maupun yang dianjurkan, secara rahasia dan terang-terangan, mereka itu mengharapkan dengan itu sebuah perniagaan yang tidak merugi dan tidak binasa, yaitu ridha Allah kepada mereka, keberuntungan meraih pahalaNya yang agung, Agar Allah memberikan pahala amal kebaikan mereka secara sempurna tanpa dikurangi, dan melipatgandakan kebaikan-kebaikan dari karuniaNya. Sesungguhnya Allah Maha Pengampun terhadap keburukan-keburukan mereka, juga Maha membalas dengan kebaikan-kebaikan mereka dan memberi mereka balasan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sesungguhnya orang-orang yang membaca kitab yang Allah turunkan kepada utusan Kami dan mengamalkan kandungannya, menyempurnakan salat dengan sebaik-baiknya, berinfak dengan rezeki yang Kami berikan dengan jalan zakat dan lainnya secara diam-diam ataupun terang-terangan, mereka berharap dengan amal-amal itu transaksi yang takkan merugi dengan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-30. Orang-orang yang senantiasa membaca al-Qur’an dan mengamalkannya, mendirikan shalat pada waktunya, dan menginfakkan sebagian harta mereka untuk kebaikan, demi mendapatkan kebaikan dalam perniagaan yang menguntungkan dengan Allah; agar mereka meraih apa yang mereka harapkan dan mendapat pahala yang berlipat ganda; maka Allah akan mengampuni mereka dari dosa-dosa dan kesalahan, dan membalas usaha mereka dengan memberi pahala yang besar atas amalan kecil yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. إِنَّ الَّذِينَ يَتْلُونَ كِتٰبَ اللهِ (Sesungguhnya orang-orang yang selalu membaca kitab Allah) Yakni orang-orang yang senantiasa membaca al-Qur’an. وَأَقَامُوا۟ الصَّلَوٰةَ(dan mendirikan shalat) Mendirikannya pada waktunya dengan penuh kesempurnaan pada rukun dan zikirnya. وَأَنفَقُوا۟ مِمَّا رَزَقْنٰهُمْ سِرًّا وَعَلَانِيَةً(dan menafkahkan sebahagian dari rezeki yang Kami anugerahkan kepada mereka dengan diam-diam dan terang-terangan) Ayat ini mengandung dorongan untuk senantiasa berinfak bagaimanapun kemungkinannya, jika dia dapat merinfak secara diam-diam maka itu lebih baik, dan jika tidak maka ia berinfak secara terang-terangan, dan kekhawatirannya infak itu akan menjadi riya’ tidak mencegahnya untuk tetap berinfak. يَرْجُونَ تِجٰرَةً(mereka itu mengharapkan perniagaan) Yakni mengharap pahala ketaatannya. لَّن تَبُورَ(yang tidak akan merugi) Yakni tidak akan rugi dan lenyap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Sesungguhnya orang-orang yang terus membaca Al-Qur’an, melaksanakan shalat pada waktunya dengan menyempurnakan rukun-rukun dan syarat-syaratnya, dan menginfakkan sebagian dari rejeki yang diberikan Allah secara sembunyi-sembunyi dan terang-terangan berupa zakat dan sedekah itu mengharapkan perniagaan yang tidak akan rugi dari amal mereka itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang selalu membaca kitab Allah, menegakkan shalat, dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka secara sembunyi-sembunyi dan terang-terangan, mereka itu mengharapkan perdagangan yang tidak akan pernah rugi} rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Sesungguhnya orang-orang yang selalu membaca kitab Allah.” Maksudnya, mengkaji perintah-perintahnya dan mereka mengerjakannya, dan terhadap larangan-larangannya lalu mereka membenarkan dan meyakininya, serta mereka tidak mengutamakan apa-apa yang bertentangan dengannya dari pendapat-pendapat manusia. Dan mereka pun membaca lafazh-lafazhnya dengan mempelajarinya, membaca artinya dengan menghayati dan menyimpulkannya. Kemudian, setelah menjelaskan tentang membaca al-quran secara khusus dan shalat secara umum yang merupakan tiang agama, cahaya bagi kaum Muslimin, standar keimanan dan tanda ketulusan dalam berislam, Allah secara khusus menjelaskan tentang pemberian nafkah kepada kaum kerabat, orang-orang miskin, anak-anak yatim, dan lain-lainnya dalam bentuk zakat, kaffarat, nadzar dan berbagai bentuk sedekah, “dengan diam-diam dan terang-terangan,” sepanjang waktu, “mereka itu mengharapkan” dengan itu, “perniagaan yang tidak akan merugi.” Maksudnya, tidak akan bangkrut atau rusak. Bahkan ia adalah perniagaan yang paling mulia, paling tinggi, dan paling utama, yaitu keridhaan Allah, Rabb mereka, menang dengan meraih pahala yang berlipat ganda dan selamat dari murka dan siksaanNya. Di sini terkandung keikhlasan dalam amal-amal kebajikan mereka, yang mana sesungguhnya mereka tidak mengharapkan sedikitpun dari amal-amal tersebut tujuan-tujuan buruk dan niat-niat yang tidak benar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 29: Allah kemudian memuji ahli qur’an dan shalat serta sedekah dengan berkata : Sesungguhnya yang membaca Al Qur’an, mengamalkan apa yang ada padanya, mengerjakan perintahnya, menjauhi larangannya, membenarkan dengan menegakkan shalat terus menerus demikian dengan menjaga rukunnya, wajibnya, sunnahnya dan mencintainya, kemudian juga bersedekah dari harta-harta mereka yang telah Allah berikan dalam diam dan keramaian; Maka barangsiapa yang memiliki sifat demikian maka mereka berharapa perniagaan yang menguntungkan, bukan merugikan, tidak juga kehancuran bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang mengikuti perintah-perintahnya dan menjauhi larangan-larangannya, membenarkan beritanya dan meyakininya, tidak mengedapan ucapan apa pun di atasnya, dan membaca pula lafaz-lafaznya serta mempelajarinya, mempelajari maknanya dan menggali isinya. Inilah arti tilawah, yakni mengikuti dan membaca. Kemudian Allah Subhaanahu wa Ta'aala menyebutkan tentang shalat secara khusus setelah umum, di mana shalat adalah tiang agama, cahaya kaum muslimin, timbangan keimanan dan tanda benarnya keislamannya. Demikian pula disebutkan infak, baik kepada kerabat, orang-orang miskin, anak yatim dan lainnya, dan termasuk pula zakat, kaffarat, nadzar dan sedekah. Yakni dalam setiap waktu. Karena perdagangan itu adalah perdagangan yang paling tinggi dan paling utama keuntungannya, yaitu memperoleh keridhaan Allah, memperoleh pahala-Nya yang banyak (surga) dan selamat dari kemurkaan dan siksa-Nya (neraka). Yang demikian karena mereka ikhlas dalam melakukan amal itu, tidak ada maksud atau niat yang buruk sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 29",
    "description": "29-30. Pada ayat ini Allah menyebutkan sebagian tanda orang yang takut kepada-Nya. Sesungguhnya orang-orang yang selalu membaca kitab Allah, yakni Al-Qur'an, lalu mereka mengkaji dan mengamalkan kan-dungannya, dan melaksanakan salat dengan sempurna syarat dan rukunnya, dan menginfakkan sebagian rezeki yang kami anugerahkan kepada-Nya dengan diam-diam dan terang-terangan, baik dalam keadaan lapang maupun sempit, mereka itu mengharapkan perdagangan dengan Allah yang tidak akan pernah rugi, agar Allah menyempurnakan pahalanya kepada mereka dan menambah karunia-Nya. Sungguh, Allah maha pengampun segala khi-laf dan dosa, maha mensyukuri, yakni memberi pahala atas perbuatan baik hamba-Nya, memaafkan kesalahannya, menambah nikmat-Nya, dan sebagainya"
  }
]