[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia, ingatlah nikmat Allah kepada kalian dengan hati, lisan dan anggota badan kalian, tidak ada Khaliq bagi kalian selain Allah yang memberi rizki kepada kalian dari langit dengan hujan dan dari bumi dengan air, barang tambang dan lainnya. Tidak ada tuhan yang berhak disembah kecuali Allah, tiada sekutu bagiNya, maka bagaimana kalian bisa dipalingkan dari tauhid dan ibadah kepadaNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Wahai manusia! Ingatlah nikmat Allah kepada kalian dengan hati dan lisan kalian, dan dengan anggota tubuh kalian lewat amal perbuatan. Apakah ada pencipta selain Allah yang memberi kalian rezeki dari langit dengan menurunkan hujan kepada kalian, memberi kalian rezeki dari bumi dengan menumbuhkan buah-buahan dan tanaman? Tidak ada sesembahan yang hak kecuali Allah, maka bagaimana kalian bisa dipalingkan dari kebenaran dan membuat kebohongan atas nama Allah dan kalian mengaku bahwa Allah mempunyai sekutu-sekutu, padahal Dialah yang menciptakan kalian dan memberi kalian rezeki?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah mengingatkan seluruh manusia kenikmatan-kenikmatan yang telah Allah berikan kepada mereka yang wajib mereka ingat dan syukuri. Tidak ada Pencipta dan tidak ada Pemberi rezeki selain Dia, tidak ada Tuhan dan tidak ada Sesembahan selain Dia. Mengapa kalian berpaling dari kebenaran yang jelas ini?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. يٰٓأَيُّهَا النَّاسُ اذْكُرُوا۟ نِعْمَتَ اللهِ عَلَيْكُمْ ۚ (Hai manusia, ingatlah akan nikmat Allah kepadamu) Agar nikmat itu terus mengalir dan bertambah serta untuk mensyukurinya. هَلْ مِنْ خٰلِقٍ غَيْرُ اللهِ يَرْزُقُكُم مِّنَ السَّمَآءِ(Adakah pencipta selain Allah yang dapat memberikan rezeki kepada kamu dari langit) Yakni dengan hujan. وَالْأَرْضِ ۚ( dan bumi?) Dengan tanaman dan lainnya. فَأَنَّىٰ تُؤْفَكُونَ (maka mengapakah kamu berpaling (dari ketauhidan)?) Yakni mengapa kalian berpaling dari kebenaran, yaitu dengan mengesakan Allah dan bersyukur kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai seluruh manusia, ingat-ingatlah nikmat Allah yang diberikan kepada kalian. Jagalah itu dengan mengenali kebenarannya dan bersyukur kepadaNya atas nikmat itu. Pikirkanlah apakah ada pencipta lain selain Allah? Maknanya tidak ada pencipta lain selain Allah . Dia memberi rejeki kalian dari langit dan bumi, lalu bagaimana bisa kalian menyekutukanNya dengan yang lain? Tidak ada Tuhan yang dapat disembah dengan haq kecuali Dia. Bagaimana bisa kalian menghindar untuk mengesakanNya sedangkan kalian juga memberitahukan bahwa Dialah sang Pencipta dan Pemberi Rejeki?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, ingatlah nikmat Allah kepada kalian. Apakah ada pencipta selain Allah yang dapat memberikan rezeki kalian dari langit dan bumi. Tidak ada Tuhan selain Dia. Lalu bagaimana kalian dapat dipalingkan} lalu bagaimana kalian dipalingkan ketauhidan menuju kesyirikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah memerintah seluruh manusia untuk mengingat nikmatNya atas mereka. Ini mencakup mengingat nikmat dengan hati sebagai bentuk pengakuan, dengan lisan sebagai bentuk pujian, dan dengan seluruh anggota badan dalam bentuk ketundukkan. Sebab, sesungguhnya mengingat nikmat-nikmat Allah itu bisa memotivasi diri untuk bersyukur kepadaNya. Kemudian Allah mengingatkan mereka akan pokok-pokok kenikmatan, yaitu bahwa mereka diciptakan dan diberikan rizki, seraya berfirman, “Adakah pencipta selain Allah yang dapat memberikan rizki kepadamu dari langit dan dari bumi?” oleh karena sudah dimaklumi bahwa tidak ada satu pun yang dapat menciptakan dan memberikan rizki kecuali Allha, maka hal ini menjadi bukti (dalil) akan ke-Tuhanan-NYa dan keberkahanNya untuk disembah. Maka dari itu Dia berfirman, “Tidak ada sembahan yang haq melainkan Dia; maka mengapakah kamu berpaling?” maksudnya, mengapa kalian berpaling dari peribadatan kepada Sang Pencipta lagi Pemberi rizki kepada peribadatan makhluk yang justru (sama dengan kalian) diberi rizki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 3: Wahai manusia ingatlah nikmat Allah yang besar yang diberikan kepada kalian, ingatlah dengan hati kalian, lisan kalian, dan anggota badan kalian, teruslah mengingat nikmat-nikmat tersebut dan jagalah dengan rasa syukur, pujian dan ketaatan serta menegakkan apa yang diwajibkan-Nya seperti zakat dan selainnya. Ketahuilah bahwasanya tidak ada yang menciptakan selain-Nya yang memberikan rezeki kepada kalian dari langit berupa air hujan dan selainnya, dan dari bumi dengan pertanian dan buah-buahan dan yang lainnya, dan tidak ada Tuhan selain-Nya yang berhak di ibadahi dan di taati kecuali Allah; Karena Dia adalah Pencipta segala sesuatum dan selama urusannya demikian, lalu bagaimana bisa memalingkan ibadah kepada selain-Nya dan menyekutukan-Nya ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan semua manusia untuk mengingat nikmat-Nya kepada mereka. Hal ini mencakup mengingat dengan hati dengan mengakui, mengingat dengan lisan dengan memuji, dan mengingat dengan anggota badan dengan tunduk, karena mengingat nikmat Allah Subhaanahu wa Ta'aala membuat seseorang bersyukur. Ketika itu tertuju kepada penduduk Mekah, di mana Allah Subhaanahu wa Ta'aala telah menempatkan mereka di tanah haram dan mencegah adanya penyerangan dari pihak luar. Selanjutnya Allah Subhaanahu wa Ta'aala mengingatkan mereka terhadap dasar nikmat, yaitu menciptakan mereka dan memberikan rezeki kepada mereka. Oleh karena tidak ada yang mencipta dan memberi rezeki kecuali Allah, maka yang demikian menunjukkan keberhakan Allah untuk diibadahi dan disembah. Oleh karena itu Dia berfirman, “Tidak ada Tuhan yang berhak disembah selain Dia,” Sedangkan kamu mengetahui bahwa Dialah Pencipta alam semesta dan Pemberi rezeki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 3",
    "description": "Limpahan rahmat yang demikian besar harus menjadi pendorong bagi manusia untuk bersyukur. Wahai manusia! ingatlah akan nikmat Allah yang dilimpahkan kepadamu. Bersyukurlah dengan menaati perintah-Nya dan tidak mendurhakai-Nya. Adakah pencipta selain Allah yang dapat memberikan rezeki kepadamu dari langit dan bumi' tentu tidak ada. Tidak ada tuhan yang berhak disembah selain dia; maka mengapa kamu bisa berpaling dari tauhid'4. Dan jika mereka mendustakan engkau, wahai nabi Muhammad, setelah engkau memberi mereka seruan untuk beriman kepada Allah yang telah melimpahkan rahmat, maka sungguh, rasul-rasul sebelum engkau telah didustakan pula. Karena itu, janganlah bersedih dan bersabarlah seperti halnya mereka (lihat juga: al-an''m/6: 34). Dan hanya kepada Allah segala urusan dikembalikan. Dia akan memberi balasan sesuai perbuatan setiap orang."
  }
]