[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Sesungguhnya orang-orang yang membaca al-Qur’an dan mengamalkannya, menjaga shalat pada waktunya, menafkahkan dari apa yang Kami rizkikan kepada mereka dengan berbagai bentuk nafkah, baik yang wajib maupun yang dianjurkan, secara rahasia dan terang-terangan, mereka itu mengharapkan dengan itu sebuah perniagaan yang tidak merugi dan tidak binasa, yaitu ridha Allah kepada mereka, keberuntungan meraih pahalaNya yang agung, Agar Allah memberikan pahala amal kebaikan mereka secara sempurna tanpa dikurangi, dan melipatgandakan kebaikan-kebaikan dari karuniaNya. Sesungguhnya Allah Maha Pengampun terhadap keburukan-keburukan mereka, juga Maha membalas dengan kebaikan-kebaikan mereka dan memberi mereka balasan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Allah hendak memberi mereka pahala mereka dengan sempurna dan menambah mereka dari karunia-Nya, karena Allah adalah pemiliknya, sesungguhnya Allah Maha Pengampun bagi dosa-dosa orang-orang yang memiliki sifat-sifat tersebut, membalas amal-amal mereka yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. لِيُوَفِّيَهُمْ أُجُورَهُمْ (agar Allah menyempurnakan kepada mereka pahala mereka) Perniagaan itu tidak akan merugi karena Allah akan menyempurnakan pahala amal shalih mereka. وَيَزِيدَهُم مِّن فَضْلِهِۦٓ ۚ( dan menambah kepada mereka dari karunia-Nya) Yakni memberi karunia kepada mereka dengan menambah pahala sebagai balasan bagi amal mareka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Dalam perniagaan yang tidak mungkin rugi itu mereka ingin agar Allah menyempurnakan untuk mereka pahala amal shalih mereka dan menambahkan dalam hal itu keutamaan dan kebaikanNya. Sesungguhnya Allah itu Maha Luas ampunanNya untuk dosa-dosa mereka dan Maha Bersyukur atas ketaatan mereka dengan menerimanya dengan baik dan memperbaiki balasan untuk mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Allah menyempurnakan pahala mereka} pahala amal mereka {dan menambah karuniaNya kepada mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Allah menyebutkan bahwa mereka pasti meraih apa yang mereka harapkan itu, seraya berfirman, “Agar Allah menyempurnakan kepada mereka pahala mereka, maksudnya pahala amal-amal kebajikan mereka sesuai dengan sedikit atau banyaknya, baik atau tidaknya. “Dan menambah kepada mereka dari karuniaNya” sebagai tambahan atas pahala yang mereka terima. “Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri,” Dia mengampuni dosa-dosa mereka dan menerima kebajikan mereka sekalipun kecil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 30: Mereka yang mengerjakan amalan-amalan itu selaras dengan perintah Allah, Allah balas dengan balasan atas amalan mereka secara sempurna, lengkap tanpa dikurangi. Bahkan Allah tambahkan dalam ganjaran mereka. Sesungguhnya Dia memiliki banyak ampunan bagi siapa yang meminta ampun dan bertaubat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutrkan, bahwa mereka memperoleh apa yang mereka harapkan. Sesuai banyak atau sedikitnya amal itu. Yakni menerima kebaikan mereka meskipun sedikit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 30",
    "description": "29-30. Pada ayat ini Allah menyebutkan sebagian tanda orang yang takut kepada-Nya. Sesungguhnya orang-orang yang selalu membaca kitab Allah, yakni Al-Qur'an, lalu mereka mengkaji dan mengamalkan kan-dungannya, dan melaksanakan salat dengan sempurna syarat dan rukunnya, dan menginfakkan sebagian rezeki yang kami anugerahkan kepada-Nya dengan diam-diam dan terang-terangan, baik dalam keadaan lapang maupun sempit, mereka itu mengharapkan perdagangan dengan Allah yang tidak akan pernah rugi, agar Allah menyempurnakan pahalanya kepada mereka dan menambah karunia-Nya. Sungguh, Allah maha pengampun segala khi-laf dan dosa, maha mensyukuri, yakni memberi pahala atas perbuatan baik hamba-Nya, memaafkan kesalahannya, menambah nikmat-Nya, dan sebagainya. 31. Usai memberi janji pahala yang sempurna bagi orang-orang yang selalu membaca dan mengamalkan Al-Qur'an, Allah lalu menyusuli-Nya dengan penegasan bahwa Al-Qur'an itu adalah benar-benar wahyu dari Allah. Dan apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, yaitu kitab Al-Qur'an, itulah yang benar; tidak ada sedikit pun kebatilan dan keraguan di dalamnya; ia juga membenarkan kitab-kitab yang sebelumnya bahwa kitab-kitab itu berasal dari Allah. Sungguh, Allah benar-benar maha mengetahui, maha melihat keadaan hamba-hamba-Nya."
  }
]