[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa yang Kami turunkan kepadamu (wahai Rasul) berupa al-Qur’an adalah haq yang membenarkan kitab-kitab yang Allah turunkan kepada Rasul-rasulNya sebelummu. Sesungguhnya Allah mahateliti terhadap segala urusan hamba-hambaNya, juga Maha Melihat amal perbuatan mereka dan akan membalas mereka karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Apa yang Kami wahyukan kepadamu -wahai Rasul- berupa kitab adalah kebenaran yang tidak ada keraguan padanya, yang Allah turunkan untuk membenarkan kitab-kitab sebelumnya. Sesungguhnya Allah Maha mengenal dan Maha melihat hamba-hamba-Nya. Dia mewahyukan kepada Rasul setiap umat apa yang dibutuhkan pada masanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Kitab yang Kami wahyukan kepadamu merupakan kebenaran, sebagaimana tanda-tanda dan bukti yang telah kamu saksikan. Kitab itu membenarkan kitab-kitab sebelumnya tentang kabar beritanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَالَّذِىٓ أَوْحَيْنَآ إِلَيْكَ مِنَ الْكِتٰبِ (Dan apa yang telah Kami wahyukan kepadamu yaitu Al Kitab) Yakni al-Qur’an. هُوَ الْحَقُّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ ۗ( itulah yang benar, dengan membenarkan kitab-kitab yang sebelumnya) Yakni sesuai dengan kitab-kitab terdahulu. إِنَّ اللهَ بِعِبَادِهِۦ لَخَبِيرٌۢ بَصِيرٌ(Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat (keadaan) hamba-hamba-Nya) Allah Mengetahui segala urusan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai Rasulallah, apa yang Kami wahyukan kepadamu berupa Al-Qur’an (min itu adalah min bayaniyah) adalah kebenaran yang kokoh yang tidak ada keraguan di dalamnya, serta membenarkan dan memperkuat kitab-kitab sebelumnya. Sesungguhnya Allah Maha Mengetahui keadaan hamba-hambaNya dan selalu memantaunya, Maha Melihat urusan-urusan mereka, dan Maha Meliputi seluruh perkara mereka baik yang tampak maupun yang tersembunyi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang telah Kami wahyukan kepadamu, yaitu kitab, itulah kebenaran yang membenarkan kitab-kitab sebelumnya} kitab-kitab samawi sebelumnya {Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Allah mengingatkan bahwa sesungguhnya al-Kitab yang telah diwahyukanNya kepada RasulNya “itulah yang benar,” karena banyaknya kebenaran (al-Haq) yang terkandung di dalamnya, sehingga seakan-akan kebenaran hanya terbatas pada yang ada di dalamnya saja. Maka hendaknya jangan sampai ada rasa keberatan di dalam hati kalian terhadapnya dan jangan pula kalian merasa bosan kepadanya atau meremehkannya. Kalau al-Kitab ini adalah yang haq (benar), maka sudah pasti setiap apa yang dijelaskannya, seperti permasalahan-permasalahan ketuhanan dan hal-hal yang ghaib serta lain-lainnya sesuai dengan apa yang terjadi dalam realita. Maka tidak boleh diartikan dengan makna yang bertentangan dengan makna lahirnya dan dengan makna yang dikandungnya. “Dengan membenarkan apa-apa yang sebelumnya,” yaitu berupa kitab-kitab dan para rasul, sebab kitab-kitab tersebut telah mengabarkan tentangnya dan menginformasikannya, dan al-kitab ini pun membenarkannya, maka dari itu, tidak mungkin seseorang beriman kepada kitab-kitab terdahulu sementara ia kafir kepada al-Quran! Sama sekali tidak mungkin! Sebab kekafirannya kepada al-Quran berarti merusak imannya kepada kitab-kitab sebelum al-Quran tersebut. Sebab, di antara sejumlah khabar (informasi) kitab-kitab tersebut adalah informasi tentang al-Quran, dan juga karena khabar-khabarnya sesuai dengan khabar-khabar al-Quran. “Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat hamba-hambaNYa\", maka dari itu Dia memberikan kepada setiap umat dan setiap orang apa yang sesuai (layak) dengan keadaannya, termasuk di antaranya adalah bahwa syariat-syariat yang telah lalu tidak sesuai kecuali pada masa dan waktunya saat itu. Maka dari itu Allah terus mengutus para RasulNya secara silih berganti hingga akhirnya Allah menutupnya dengan Nabi Muhammad. Maka dari itu beliau datang dengan membawa syariat yang selalu sesuai dengan kemaslahatan manusia hingga Hari Kiamat kelak dan memberikan jaminan dengan apa yang lebih baik pada setiap saat. Maka dari itu, setelah umat ini menjadi umat yang paling sempurna (matang) akal pikirannya, paling lembut hatinya, dan paling bersih jiwanya, maka Allah memilih mereka dan memilih Agama Islam sebagai agama mereka dan mewariskan kitab yang mewakili seluruh kitab-kitab suci sebelumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 31: Allah mengabarkan kepada Nabi-Nya ﷺ bahwa Al Qur’an ini yang Allah telah turunkan kepada engkau adalah kebenaran tanpa keraguan karena dia adalah dari sisi Allah, dia membenarkan dan menyepakati atas apa yang sebelumnya dari kitab-kitab yang telah lalu yang diturunkan dari sisi Allah. Kemudian Allah menjelaskan baha Dia maha tahu atas hamba-Nya, Dia maha melihat hamba-nya atas niat mereka dan ucapan mereka serta amalan mereka, dan mereka semua akan dibalas dengan seluruh amalan yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan, bahwa kitab yang yang diwahyukan-Nya kepada Rasul-Nya adalah kebenaran, karena kandungannya benar sehingga seakan-akan kebenaran terbatas hanya di dalamnya. Jika ia merupakan kebenaran, maka berarti apa yang ditunjukkannya seperti tentang masalah ketuhanan, masalah gaib dan lainnya adalah benar dan sesuai kenyataan, sehingga tidak boleh mengartikan yang berbeda dengan zahirnya atau berbeda dengan yang ditunjukkan olehnya. Baik kitab-kitab maupun rasul-rasul sebelumnya, karena kitab-kitab dan rasul-rasul sebelumnya memberitakan tentang kedatangan kitab Al Qur’an itu dan kedatangan rasul yang membawanya. Oleh karena itu, seseorang tidak bisa dikatakan beriman kepada kitab-kitab sebelumnya jika ia tidak beriman kepada Al Qur’an ini, karena dengan kafir kepadanya maka berarti kafir kepada semua kitab yang diturunkan sebelumnya. Oleh karena itu, Dia memberikan kepada setiap umat dan setiap orang pemberian yang sesuai dengan keadaannya. Contohnya adalah, bahwa syariat-syariat sebelumnya tidaklah cocok kecuali pada zaman itu, dan pada zaman sekarang karena rasul terakhir yang tidak ada lagi rasul setelahnya adalah Nabi Muhammad shallallahu 'alaihi wa sallam, maka syariat yang cocok untuk zaman sekarang dan seterusnya sampai hari Kiamat adalah syariat yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam. Oleh karena itu, ketika Nabi Isa ‘alihis salam nanti turun menjelang hari Kiamat, maka Beliau mengikuti syariat Nabi Muhammad shallallahu 'alaihi wa sallam. Syariat Nabi Muhammad itulah syariat yang cocok untuk saat ini dan seterusnya, cocok di setiap umat dan setiap tempat dan menjamin kebaikan di setiap waktu. Oleh karenanya, umat ini adalah umat yang paling sempurna akalnya, paling baik pikirannya, paling halus hatinya dan paling bersih jiwanya. Allah Subhaanahu wa Ta'aala telah memilih mereka dan memilih agama Islam untuk mereka serta mewariskan kepada mereka kitab-Nya sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 31",
    "description": "Usai memberi janji pahala yang sempurna bagi orang-orang yang selalu membaca dan mengamalkan Al-Qur'an, Allah lalu menyusuli-Nya dengan penegasan bahwa Al-Qur'an itu adalah benar-benar wahyu dari Allah. Dan apa yang telah kami wahyukan kepadamu, wahai nabi Muhammad, yaitu kitab Al-Qur'an, itulah yang benar; tidak ada sedikit pun kebatilan dan keraguan di dalamnya; ia juga membenarkan kitab-kitab yang sebelumnya bahwa kitab-kitab itu berasal dari Allah. Sungguh, Allah benar-benar maha mengetahui, maha melihat keadaan hamba-hamba-Nya. 32. Kemudian kitab Al-Qur'an itu kami wariskan kepada orang-orang yang benar-benar kami pilih di antara hamba-hamba kami, lalu mereka terbagi menjadi tiga kelompok; di antara mereka ada yang menzalimi diri sen-diri, yakni kurang memperhatikan pesan-pesan kitab tersebut sehingga lebih banyak berbuat salah daripada berbuat baik; ada yang pertengahan, yaitu orang yang kebaikannya setara dengan keburukannya, dan ada pula yang lebih dahulu berbuat kebaikan dengan izin Allah. Mereka itulah orang yang segera dan berlomba berbuat kebajikan sehingga kebaikannya sangat banyak dan amat sedikit jarang berbuat salah. Yang demikian itu, yakni pewarisan Al-Qur'an kepada umat nabi Muhammad dan kesegeraan mereka berbuat kebajikan, adalah karunia yang besar."
  }
]