[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami memberikan al-Qur’an (setelah binasanya umat-umat) kepada orang-orang yang kami pilih dari umat Muhammad, diantara mereka ada yang menzhalimi dirinya sendiri dengan melakukan sebagian kemaksiatan, diantara mereka ada yang pertengahan, yaitu orang yang menjalankan kewajiban dan meninggalkan larangan-larangan, dan diantara mereka ada yang berlomba-lomba dalam kebaikan dengan izin Allah, yakni bersungguh-sungguh dan bersegera dalam melakukan amal-amal shalih, baik yang fardhu maupun yang sunnah. Pemberian kitab suci itu dan pemilihan umat ini adalah karunia yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Kemudian Kami memberi umat Muhammad yang Kami pilih di atas umat-umat lainnya Al-Qur`ān, di antara mereka ada orang yang menzalimi dirinya sendiri dengan melakukan hal-hal yang haram dan meninggalkan kewajiban-kewajiban, di antara mereka ada yang pertengahan dengan melakukan kewajiban-kewajiban dan meninggalkan hal-hal yang haram disertai meninggalkan sebagian hal-hal yang dianjurkan, di antara mereka ada orang yang berlomba dalam kebaikan-kebaikan dengan izin Allah, hal itu dengan menjalankan kewajiban-kewajiban dan hal-hal yang dianjurkan, meninggalkan hal-hal yang diharamkan dan yang dimakruhkan. Yang demikian itu, yakni pemilihan umat ini dan pemberian Al-Qur`ān kepada mereka adalah karunia besar yang tidak tertandingi oleh karunia manapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Kemudian Kami mewariskan kitab Kami yang paling mulia bagi hamba yang Kami pilih; sebagian mereka menzalimi diri mereka sendiri dengan mencampur antara amal shalih dengan amal keburukan. Sebagian lain menjadi orang yang pertengahan dengan mencukupkan diri dengan meninggalkan hal haram dan menjalankan hal wajib. Dan sebagian lainnya menjadi orang yang berlomba-lomba untuk meraih kebaikan; mereka adalah orang-orang memiliki semangat tinggi, jiwa yang damai, dan ruh yang selalu rindu kepada keutamaan; sungguh itu merupakan karunia yang besar dan kemuliaan yang agung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. ثُمَّ أَوْرَثْنَا الْكِتٰبَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا ۖ (Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami) Yakni hai Muhammad, Kami wariskan kepada orang-orang yang berilmu dari umatmu kitab yang Kami turunkan kepadamu. Dan tidak diragukan lagi bahwa orang berilmu dari umat ini adalah para sahabat dan orang-orang setelahnya. Allah memuliakan mereka atas hamba-hamba yang lain, dan menjadikan mereka umat pertengahan yang akan menjadi saksi atas umat yang lain, serta Allah memuliakan mereka dengan menjadikan mereka umat bagi Nabi yang terbaik dan pemimpin para Bani Adam. Kemudian Allah membagi mereka menjadi tiga golongan, sebagaimana yang disebutkan dalam lanjutan ayat. فَمِنْهُمْ ظَالِمٌ لِّنَفْسِهِۦ وَمِنْهُم مُّقْتَصِدٌ وَمِنْهُمْ سَابِقٌۢ بِالْخَيْرٰتِ(lalu di antara mereka ada yang menganiaya diri mereka sendiri dan di antara mereka ada yang pertengahan dan diantara mereka ada (pula) yang lebih dahulu berbuat kebaikan) Orang yang menzalimi diri sendiri adalah orang yang lalai dalam menjalankan kewajibannya atau orang yang melakukan perbuatan haram. Dan orang pertengahan adalah orang yang pertengahan dalam menjalankan agama; dia menjalankan kewajibannya dan menjauhi perbuatan haram, namun tidak lebih dari itu, dan mereka termasuk penghuni surga. Sedangkan orang yang lebih dulu berbuat kebaikan adalah orang yang bersegera dan mendahului orang lain dalam urusan agama; golongan ini adalah golongan yang terbaik dari tiga golongan ini. ذٰلِكَ (Yang demikian itu) Yakni pewarisan kitab al-Qur’an ini dan pemilihan Allah terhadap mereka ini. Pendapat lain mengatakan yang dimaksudkan adalah, orang yang bersegera dalam kebaikan itu. هُوَ الْفَضْلُ الْكَبِيرُ(adalah karunia yang amat besar)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Kemudian Kami wariskan dan berikan Al-Qur’an kepada ulama’ yang Kami pilih dari hamba-hamba Kami. Di antara mereka ada yang zhalim terhadap diri sendiri dengan berbuat maksiat dan menghamburkan (diri) di dalamnya sehingga keburukannya mengungguli kebaikannya. Di antara mereka juga ada yang sederhana dan tengah-tengah dalam beramal. Dia banyak mengamalkan Al-Qur’an dan mencampur amal shalih dengan yang buruk. Di antara mereka juga ada yang mengutamakan untuk beramal shalih dengan hanya menginginkan Allah dan pertolonganNya. Dialah yang terbaik di antara ketiganya. Pewarisan Al-Qur’an dan pemilihan itu adalah keutamaan besar dari Allah SWT atas mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami mewariskan} Kami memberikan {kitab itu} Al-Qur’an {kepada orang-orang yang Kami pilih} Kami pilih {di antara hamba-hamba Kami. Lalu di antara mereka ada yang menzalimi diri sendiri} mengerjakan hal-hal yang diharamkan dan meninggalkan hal-hal yang diwajibkan {ada yang pertengahan} mengerjakan hal-hal yang diwajikan dan meninggalkan hal-hal yang diharamkan {dan ada yang lebih dahulu berbuat kebaikan} yang mengerjakan hal-hal yang diwajibkan dan hal-hal yang disukai (Allah), dan meninggalkan hal-hal yang haram dan makruh {dengan izin Allah. Itulah karunia yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Maka dari itu Allah berfirman, “Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami.” Mereka yang terpilih tersebut adalah umat ini. “Lalu di antara mereka ada yang menganiaya diri mereka sendiri,” dengan perbuatan-perbuatan maksiat selain kekafiran, “dan di antara mereka ada yang pertengahan,” hanya melakukan hal-hal yang diwajibkan kepadanya dan meninggalkan yang diharamkan, “dan di antara mereka ada pula yang lebih dahulu berbuat kebaikan.” Maksudnya, segera melakukannya dan bersungguh-sungguh hingga mengalahkan orang yang lain. Dia adalah orang yang selalu menunaikan apa-apa yang fardhu dan banyak mengerjakan amalan-amalan sunnah, meninggalkan yang haram dan yang makruh. Mereka semua dipilih oleh Allah untuk mewarisi kitab al-Quran ini, sekalipun tingkatan-tingkatan mereka berbeda-beda dan kondisi mereka tidak sama, namun masing-masing dari mereka mempunyai bagian dari warisannya hingga orang yang zhalim terhadap dirinya sendiri sekalipun, sebab sesungguhnya dasar iman, ilmu-ilmu iman, dan amal-amal iman yang mereka miliki merupakan bagian dari warisan al-KItab (al-Quran), karena yang dimaksud warisan al-Kitab adalah warisan ilmu, amal, dan mempelajari lafazh-lafazhnya, serta mengambil makna-maknanya. Sedang Firman Allah “Dengan izin Allah.” Kalimat ini merujuk kepada “yang lebih dahulu berbuat kebaikan” agar ia tidak tertipu dengan amal kebajikannya. Sebab, ia tidak akan bergegas melakukan kebaikan-kebaikan kecuali karena taufik dari Allah dan pertolonganNya. Maka semestinya dia aktif bersyukur kepada Allah atas karunia yang telah dikaruniakan kepadanya. “Yang demikian itu adalah karunia yang amat besar.” Maksudnya, warisan al-Kitab yang sangat mulia bagi orang yang dipilih oleh Allah di antara hamba-hambaNya itulah karunia yang sangat besar, yang semua nikmat bila dibandingkan dengannya sama sekali tidak ada artinya. Jadi, nikmat yang paling besar secara keseluruhan dan karunia yang paling agung adalah warisan kitab suci al-Quran ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 32: Allah mengabarkan bahwasanya Al Qur’an ini yang Allah telah turunkan kepada Nabi-Nya Muhammad ﷺ adalah sebagai warisan bagi umatnya, di mana Allah memilih ﷺ dari sekian banyak umat. Kemudian Allah menjelaskan bahwa berpegangnya manusia dengan Al Qur’an ini terbagi beberapa golongan. Golongan yang mendzalimi dirinya sendiri, golongan yang pertengahan dan juga golongan yang lebih dahulu berbuat kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu umat Islam. Dengan meremehkan dalam mengamalkannya atau lebih banyak kesalahannya daripada kebaikannya atau melakukan maksiat namun di bawah kufur. Yakni mengamalkannya pada sebagian besar waktunya atau orang yang kebaikannya berbanding dengan kesalahannya atau membatasi dirinya dengan yang wajib dan meninggalkan yang haram. Yakni orang-orang yang kebaikannya sangat banyak dan jarang berbuat kesalahan. Ada pula yang berpendapat, bahwa yang dimaksud yang lebih dahulu berbuat kebaikan adalah orang yang menggabung ilmunya dengan mengajarkan dan mengamalkannya. Ada pula yang berendapat, bahwa maksudnya adalah orang yang bersegera dan bersungguh-sungguh sehingga ia mendahului yang lain, ia mengerjakan yang wajib dan menambah dengan yang sunat, serta meninggalkan yang haram dan yang makruh. Meskipun demikian, semuanya dipilih oleh Allah Subhaanahu wa Ta'aala meskipun tingkatan mereka berbeda-beda, masing-masingnya mendapat warisan kitab-Nya itu (Al Qur’an) bahkan orang yang menzalimi dirinya sekali pun. Adapun maksud mewarisi kitab-Nya adalah mewarisi ilmunya dan pengamalannya, mempelajari lafaznya dan menggali maknanya. Kata-kata “dengan izin Allah” ini kembali kepada orang yang lebih dahulu berbuat kebaikan agar ia tidak tertipu dengan amalnya, karena ia tidaklah sampai seperti itu kecuali dengan taufik dari Allah Subhaanahu wa Ta'aala dan pertolongan-Nya, sehingga sepatutnya ia menyibukkan dirinya untuk bersyukur kepada Allah Subhaanahu wa Ta'aala atas nikmat-Nya itu. Yakni mewarisi kitab-Nya yang agung itu merupakan karunia yang besar, di mana semua nikmat jika dibandingkan dengannya menjadi tidak ada apa-apanya. Sehingga nikmat yang paling besar secara mutlak adalah mewarisi kitab Al Qur’an ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 32",
    "description": "Kemudian kitab Al-Qur'an itu kami wariskan kepada orang-orang yang benar-benar kami pilih di antara hamba-hamba kami, lalu mereka terbagi menjadi tiga kelompok; di antara mereka ada yang menzalimi diri sen-diri, yakni kurang memperhatikan pesan-pesan kitab tersebut sehingga lebih banyak berbuat salah daripada berbuat baik; ada yang pertengahan, yaitu orang yang kebaikannya setara dengan keburukannya, dan ada pula yang lebih dahulu berbuat kebaikan dengan izin Allah. Mereka itulah orang yang segera dan berlomba berbuat kebajikan sehingga kebaikannya sangat banyak dan amat sedikit jarang berbuat salah. Yang demikian itu, yakni pewarisan Al-Qur'an kepada umat nabi Muhammad dan kesegeraan mereka berbuat kebajikan, adalah karunia yang besar. 33. Mereka akan mendapat surga 'adn; mereka masuk ke dalamnya. Di dalamnya mereka diberi berbagai kenikmatan jasmani dan rohani. Di antara kemikmatan jasmani ialah perhiasan gelang-gelang dari emas dan mutiara, dan pakaian mereka di dalamnya adalah sutera."
  }
]