[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Surga yang merupakan tempat tinggal yang langgeng adalah bagi orang-orang yang telah Allah beri kitab, mereka dihias dengan gelang-gelang dari emas dan mutiara dan baju biasa mereka di surga adalah sutra, yakni baju-baju yang halus"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Orang-orang yang terpilih itu masuk ke dalam Surga sebagai tempat tinggal mereka, di sana mereka diberi pakaian berupa gelang-gelang dari emas dan mutiara, pakaian mereka di sana adalah sutera."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-35. Surga-surga ‘and memiliki naungan yang luas, buah yang matang, dan air yang melimpah; mereka semua akan memasukinya. Di dalamnya mereka akan dihiasi gelang-gelang dari emas dan mutiara, berpakaian kain sutera, dan mengucapkan syukur dan pujian bagi Allah atas kenikmatan yang diberikan kepada mereka; dan Allah menghilangkan kesedihan dan kegundahan mereka. Sungguh Tuhan kita Maha Mengampuni dosa hamba-hamba-Nya, Maha Mensyukuri dengan melipatgandakan balasan amal kebaikan, Dia menyiapkan tempat tinggal bagi kita di surga dengan rahmat dan karunia-Nya; kita tidak kelelahan dan kesusahan di dalamnya, karena ini merupakan tempat kenikmatan dalam jamuan Yang Maha Mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. جَنّٰتُ عَدْنٍ يَدْخُلُونَهَا ((Bagi mereka) surga ‘Adn mereka masuk ke dalamnya) Ini merupakan janji bagi orang yang bersegera dalam kebaikan. Atau bagi semua orang yang Allah pilih itu. يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ(di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas, dan dengan mutiara, dan pakaian mereka didalamnya adalah sutera) Kalimat ini telah dijelaskan tafsirnya dalam surat al-Hajj: 23."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Surga-surga yang selamanya berdiri tegak dimasuki oleh orang-orang yang terpilih itu. Di dalamnya mereka diberi perhiasan-perhiasan emas dan mutiara. Dan pakaian mereka di surga adalah sutera"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Surga ‘Adn} yang ditinggali {yang mereka masuki. Di dalamnya mereka dihiasi} mereka dihiasi {dengan gelang-gelang dari emas dan mutiara. Pakaian mereka di dalamnya adalah sutra"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Kemudian Allah menjelaskan balasan untuk orang-orang yang diwarisi kitabNya tersebut dengan, “Surga ‘Adn, mereka masuk ke dalamnya.” Yakni, surge-surga yang penuh dengan pohon-pohon, naungan dan pohon-pohon yang rindang, kebun-kebun yang baik, sungai-sungai yang mengalir, istana-istana yang menjulang tinggi, mtempat-tempat tinggal yang terukir indah selama-lamanya, tidak akan pernah sirna dan kehidupan yang tidak akan pernah berkesudahan. “Al-Adn” artinya: Tinggal (menetap). Maka Jannatu Adn itu adalah surge tempat tinggal. Di idhafahkan kepada iqamah (diam, tinggal) karena tinggal dan kekekalan di dalamnya menjadi sifat dan ciri para penghuninya. “Di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas.” Perhiasan ini adalah perhiasan yang dikenakan di lengan tangan dengan sesuka mereka dan mereka pandang lebih indah daripada yang lainnya. Laki-laki dan perempuan sama-sama mengenakan perhiasan di surge. “Dan” mereka di hiasi di dalamnya “dengan mutiara” yang teruntai indah pada pakaian dan tubuh mereka, “dan pakaian mereka di dalamnya adalah sutera,” berupa sutra tipis dan sutra tebal berwarana hijau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 33: Allah mengabarkan bahwasanya golongan-golongan ini memiliki surga, Allah masukkan mereka kedalamnya, tidak keluar mereka semua darinya selamanya. Mereka berpakaian dengan sutera dan perhiasan-perhiasan ditangan mereka, semua itu karena sebab karunia Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan balasan-Nya kepada orang-orang yang telah diwariskan-Nya kitab kepada mereka. Surga penuh dengan pohon-pohon, tempat berteduh, kebun-kebun yang indah, sungai yang memancar, istana-istana yang tinggi, tempat-tempat yang mewah dalam waktu yang kekal selama-lamanya. Adapun ‘Adn artinya adalah tempat tinggal. Sehingga surga ‘Adn adalah surga yang menjadi tempat tinggal yang kekal. Baik laki-laki maupun wanita. Mereka diberi gelang emas, dan diberikan mutiara yang dirangkaikan di pakaian dan badan mereka. Baik sutera tipis maupun sutera tebal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 33",
    "description": "Mereka akan mendapat surga 'adn; mereka masuk ke dalamnya. Di dalamnya mereka diberi berbagai kenikmatan jasmani dan rohani. Di antara kemikmatan jasmani ialah perhiasan gelang-gelang dari emas dan mutiara, dan pakaian mereka di dalamnya adalah sutera. 34-35. Adapun kenikmatan rohani yang mereka terima adalah ungkapan syukur kepada Allah dan ketenangan batin. Dan mereka berkata, 'segala puji bagi Allah yang telah menghilangkan kesedihan dari kami dengan memasukkan kami ke surga. Sungguh, tuhan kami benar-benar maha pengampun atas segala dosa, maha mensyukuri dengan memberi balasan yang baik untuk hamba-Nya yang taat. Dialah Allah yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal di surga; di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu. ' keadaan ini sangat berbeda dengan kondisi mereka saat di dunia."
  }
]