[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata saat mereka masuk surga, “Segala puji bagi Allah yang telah menghilangkan segala kesulitan dari kami, sesungguhnya Tuhan kami benar-benar Maha Pengampun, dimana Dia mengampuni kesalahan-kesalahan kami, juga Maha membalas dengan kebaikan di mana Dia menerima kebaikan-kebaikan dari kami dan melipatgandakannya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Mereka berkata sesudah mereka memasukinya, “Segala puji bagi Allah yang telah menghilangkan kesedihan dari kami, karena kami takut sebelumnya akan dimasukkan ke dalam api Neraka. Sesungguhnya Tuhan Kami adalah Maha Pengampun bagi dosa-dosa orang yang bertobat dari hamba-hamba-Nya, menerima ketaatan mereka dan membalasnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَقَالُوا۟ الْحَمْدُ لِلّٰهِ الَّذِىٓ أَذْهَبَ عَنَّا الْحَزَنَ ۖ (Dan mereka berkata: “Segala puji bagi Allah yang telah menghilangkan duka cita dari kami) Allah melenyapkan segala duka cita dari penghuni surga yang mereka rasakan pada saat kehidupan di dunia atau ketika mereka dibangkitkan, sebab orang yang beriman masih merasa takut dan resah dari azab Allah, apakah amalan mereka diterima Allah atau ditolak, mereka sangat berhati-hati dari akibat yang buruk atau kematian yang jelek. Oleh sebab itu keresahan dan ketakutan mereka terus berlanjut sampai mereka memasuki surga, dan mereka memuji Allah yang telah menghilangkan ketakutan dan keresahan mereka. إِنَّ رَبَّنَا لَغَفُورٌ(Sesungguhnya Tuhan kami benar-benar Maha Pengampun) Pengampun bagi orang yang bermaksiat kemudian bertaubat. شَكُورٌ (lagi Maha Mensyukuri) Mensyukuri orang yang mentaati-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Mereka berkata: “Segala puji bagi Allah yang telah menghilangkan ketakutan dari kami tentang bahaya masa mendatang. Sesungguhnya Tuhan Kami Maha Luas ampunanNya bagi dosa orang-orang mukmin dan Maha Bersyukur atas ketaatan mereka, yaitu memperbaiki balasan kepada mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Segala puji bagi Allah Dzat yang telah menghilangkan kesedihan dari kami. Sesungguhnya Tuhan kami benar-benar Maha Pengampun lagi Maha Mensyukuri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan” setelah sempurna nikmat untuk mereka dan lengkap kelezatan yang mereka rasakan, “Mereka berkata, ‘ Segala puji bagi Allah yang telah menghilangkan duka cita dari kami’.” Ini mencakup segala bentuk rasa duka. Maka mereka sama sekali tidak merasakan rasa sedih (duka) yang disebabkan kekurangan pada keindahan mereka atau pada makanan dan minuman mereka, tidak pula pada kelezatan, pada tubuh atau pada keabadian mereka tinggal. Jadi, mereka selalu berada di dalam kenikmatan yang mereka rasakan selalu bertambah. Ia selalu bertambah terus selama-lamanya. “Sesungguhnya Rabb kami benar-benar Maha Pemgampun,” yang mana Dia mengampuni kekhilafan-kekhilafan kami, “lagi Maha Mensyukuri,” di mana Dia menerima amal-amal kebajikan kami dan melipatgandakannya, dan Dia berikan kepada kami bagian dari karunia yang sebenarnya tidak bisa dijangkau oleh amal-amal maupun oleh angan-angan kami. Maka, karena ampunanNya-lah mereka selamat dari segala yang tidak diinginkan dan yang dikhawatirkan, dan dengan syukur dan karuniaNya mereka memperoleh segala apa saja yang disuka dan diinginkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 34: Kemudian berkata orang-orang yang selamat tersebut setelah mereka dimasukkan ke dalam surga : Segala puju bagi Allah yang mengeluarkan kami dari kesedihan akan urusan dunia dan akhirat, sungguh Tuhan kami dengan karunia, kemulian sungguh Dia maha luas ampunan-Nya; Di mana Allah ampunkan kami atas apa yang lalai dari diri kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah sempurna kenikmatan dan kesenangan mereka. Oleh karena itu, mereka tidak akan sedih karena apa pun seperti halnya di dunia, di mana mereka bersedih karena kurangnya keelokan mereka, kurangnya makanan dan minuman mereka, kurangnya kesenangan dan kurangnya penghidupan mereka. Mereka memperoleh kesenangan yang bertambah-tambah. Karena Dia mengampuni ketergelinciran kami. Dengan ampunan-Nya mereka selamat dari segala yang tidak diinginkan dan yang ditakuti. Dengan syukur-Nya dan karunia-Nya mereka memperoleh segala yang diinginkan dan dicintai. Karena Dia menerima kebaikan kami dan melipatgandakan, dan memberikan kepada kami karunia-Nya melebihi amal yang kami lakukan dan melebihi yang kami cita-citakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 34",
    "description": "34-35. Adapun kenikmatan rohani yang mereka terima adalah ungkapan syukur kepada Allah dan ketenangan batin. Dan mereka berkata, 'segala puji bagi Allah yang telah menghilangkan kesedihan dari kami dengan memasukkan kami ke surga. Sungguh, tuhan kami benar-benar maha pengampun atas segala dosa, maha mensyukuri dengan memberi balasan yang baik untuk hamba-Nya yang taat. Dialah Allah yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal di surga; di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu. ' keadaan ini sangat berbeda dengan kondisi mereka saat di dunia. 34-35"
  }
]