[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang membuat kami tinggal di surga ini dengan karuniaNya, di dalamnya kami tidak merasa lelah atau capek.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Allah yang telah mengizinkan kami tinggal di Surga secara tetap, tidak berpindah darinya sesudahnya karena karunia-Nya, bukan karena daya dan kekuatan kami, di sana kami tidak mendapatkan kelelahan dan kesusahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. الَّذِىٓ أَحَلَّنَا دَارَ الْمُقَامَةِ مِن فَضْلِهِۦ (Yang menempatkan kami dalam tempat yang kekal (surga) dari karunia-Nya) Yakni tempat tinggal yang mereka huni selamanya dan tidak akan berpindah, sebagai karunia dan rahmat-Nya. لَا يَمَسُّنَا فِيهَا نَصَبٌ(didalamnya kami tiada merasa lelah) Yakni rasa lelah, letih, dan berat. وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ (dan tiada pula merasa lesu) Yakni rasa letih dan lemah akibat kekelahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dzat yang memasukkan Kami ke dalam surga, yaitu rumah yang selamanya berdiri yang merupakan salah satu pemberian dan keutamaanNya. Kami tidak merasa lelah dan sakit. Kami juga tidak merasa letih dan lemah. Ayat ini diturunkan saat Nabi SAW ditanya tentang kondisi tidur dan istirahat saat di surga, kemudian beliau bersabda: “Tidak ada kelelahan di dalamnya, Setiap perkara (yang dilakukan) di dalamnya adalah suatu istirahat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menempatkan kami} menempatkan kami {di tempat yang kekal} rumah yang kekal {dengan karunia-Nya. Di dalamnya kami tidak ditimpa} Kami tidak ditimpa {kelelahan} kelelahan {dan kami tidak ditimpa keletihan} keletihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Yang menempatkan kami,” yakni, Dia menempatkan kami untuk keabadian dan selama-lamanya, bukan untuk sekedar melintasi atau singgah, “dalam tempat yang kekal,” yakni, negeri yang didiami adalah untuk selama-lamanya, dan memang negeri yang diidam-idamkan untuk tinggal di dalamnya, karena kebaikannya yang sangat banyak, hal-hal yang menyenangkan silih berganti dan tidak adanya hal-hal yang tidak menyenangkan di dalamnya. Penempatan itu semuanya adalah karena karunia dan kemurahanNYa kepada kami, bukan karena amal-amal kami. Kalau saja bukan karena karuniaNya, tentu kami tidak pernah mencapai kepada apa yang telah kami capai ini. “Di dalamnya kami tiada merasa lelah dan tiada pula merasa lesu,” artinya, tidak ada rasa letih di badan, di hati dan kekuatan sekalipun karena banyaknya bersenang-senang. Ini membuktikan bahwasanya Allah menjadikan tubuh mereka dalam pertumbuhan yang sempurna, menyediakan segala fasilitas ketenangan bagi mereka untuk selama-lamanya sehingga mereka menjadi seperti itu, yang mana mereka tidak pernah merasa lesu, letih, sedih, ataupun duka. Dan juga menunjukkan bahawasanya mereka di surge tidak tidur, karena fungsi tidur adalah menghilangkan rasa lesu dan merasa istirahat karenanya. Sedangkan para penghuni surge kebalikan dari semua itu. Dan juga, karena tidur adalah bentuk mati kecil, sedangkan para penghuni surge tidak akan mengalami mati. Semoga Allah menjadikan kita termasuk golongan mereka dengan karunia dan kemurahanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 35: Mereka juga berkata : Segala puji bagi Allah yang memberikan kepada kami kehidupan surga. Dengan karunia dan kemuliaan-Nya, kami tidak tertimpa kelelahan, kesusahan dan keterasingan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bukan karena amal kami. Kalau bukan karena karunia dan kepemurahan-Nya, tentu kami tidak akan sampai ke tempat ini karena amal kami sedikit dan kurang. Yakni tempat tinggal yang kekal, tempat tinggal yang memang sangat diharapkan karena banyak kebaikannya, berturut-turutnya kesenangannya dan hilang kekeruhannya. Karena sudah tidak ada lagi beban atau kewajiban agama. Di surga tidak ada lagi kelelahan baik bagi badan dalam menikmati kesenangannya yang begitu banyak maupun bagi hati. Ini menunjukkan bahwa Allah Subhaanahu wa Ta'aala menjadikan badan mereka sempurna, sehingga mereka tidak merasakan kelelahan maupun kelesuan, di samping tidak merasakan kesedihan dan kegundahan. Demikian pula menunjukkan, bahwa mereka tidak tidur di surga, karena tidur merupakan kematian kecil, sedangkan penghuni surga tidak akan mati, mudah-mudahan Allah Subhaanahu wa Ta'aala menjadikan kita semua sebagai penguninya, Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar, Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar, Allahumma innaa nas’alukal jannah wa na’uudzu bika minan naar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 35",
    "description": "34-35. Adapun kenikmatan rohani yang mereka terima adalah ungkapan syukur kepada Allah dan ketenangan batin. Dan mereka berkata, 'segala puji bagi Allah yang telah menghilangkan kesedihan dari kami dengan memasukkan kami ke surga. Sungguh, tuhan kami benar-benar maha peng-ampun atas segala dosa, maha mensyukuri dengan memberi balasan yang baik untuk hamba-Nya yang taat. Dialah Allah yang dengan karunia-Nya menempatkan kami dalam tempat yang kekal di surga; di dalamnya kami tidak merasa lelah dan tidak pula merasa lesu. ' keadaan ini sangat berbeda dengan kondisi mereka saat di dunia. 36. Bila orang-orang yang mengikuti tuntunan Al-Qur'an dimasukkan ke surga, maka mereka yang durhaka akan disiksa di dalam neraka. Dan orang-orang yang kafir kepada Allah, rasul, dan kitab-Nya, maka bagi mereka neraka jahanam. Mereka terus disiksa di dalamnya dan sama sekali tidak dibinasakan hingga mereka mati supaya rasa pedih dari azab yang mereka terima tidak akan pernah berhenti, dan tidak diringankan dari mereka azabnya sedikit pun meski waktu berlalu. Demikianlah kami membalas setiap orang yang sangat kafir."
  }
]