[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan orang-orang yang kafir kepada Allah dan rasulNya, bagi mereka api Neraka Jahanam yang membakar, tidak ditetapkan kematian untuk mereka sehingga mereka bisa mati lalu beristirahat dari azab dan siksanya juga tidak diringankan dari mereka. Dengan balasan seperti ini Allah akan membalas setiap orang yang kafir yang berkubang dalam kekafiran dan bersikukuh mempertahankannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Bagi orang-orang yang kafir kepada Allah ada api neraka Jahanam, mereka kekal di dalamnya, kematian tidak akan tiba atas mereka sehingga mereka mati untuk bebas dari azab. Siksa Jahanam juga tidak diringankan sedikit pun dari mereka. Dengan balasan seperti inilah Kami membalas setiap orang yang mengingkari nikmat-nikmat Tuhannya pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Sedangkan orang-orang yang mati dalam keadaan kafir, maka balasan bagi mereka adalah neraka Jahannam; di dalamnya mereka tidak akan mati agar terlepas dari azab dan tidak pula diringankan siksaannya. Ini merupkan balasan yang adil bagi orang yang tetap dalam kekafiran sehingga mati dalam keadaan itu dan berpaling dari kebenaran. Mereka berteriak meminta pertolongan dari api naraka kerena merasakan kesakitan dan penyesalan, berharap kepada Allah agar mengeluarkan mereka darinya sehingga dapat menggapai apa yang telah mereka lewatkan dan memperbaiki apa yang telah mereka rusak ketika di dunia. Namun bagaimana mereka akan melakukan hal itu; sedangkan Allah telah memberi mereka kesempatan dan memanjangkan umur mereka? Akan tetapi mereka tidak mendekat kepada Tuhan mereka, bahkan mereka mendustakan dan berpaling dari peringatan-Nya. Kemudian Allah berfirman kepada mereka: “Rasakanlah azab yang dahulu ingin kalian segerakan sebagai bentuk pendustaan dan penentangan kalian, maka tidak ada penolong bagi kalian dari kezaliman yang telah kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. لَا يُقْضَىٰ عَلَيْهِمْ (Mereka tidak dibinasakan) Dengan kematian. فَيَمُوتُوا۟( sehingga mereka mati) Dan dapat beristirahat dari azab. وَلَا يُخَفَّفُ عَنْهُم مِّنْ عَذَابِهَا ۚ( dan tidak (pula) diringankan dari mereka azabnya) Namun setiap kali kulit mereka terbakar, Kami ganti dengan kulit yang baru agar mereka merasakan azab. كَذٰلِكَ نَجْزِى كُلَّ كَفُورٍ(Demikianlah Kami membalas setiap orang yang sangat kafir) Yakni demikianlah balasan buruk itu Kami berikan bagi orang yang yang sangat kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Dan orang-orang yang mengingkari Allah, rasulNya dan Al-Qur’an, maka bagi mereka itu adalah neraka Jahanam yang mana mereka abadi di dalamnya. Tidak ada ketentuan bagi mereka untuk mati lagi sehingga mereka bisa beristirahat dari siksaan dan tidak pula azab Jahanam diringankan untuk mereka. Seperti itulah Kami membalas setiap orang yang banyak kekufurannya, bersikeras untuk menolak (keimanan) dan belebih-lebihan dalam kekufuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang ingkar, bagi mereka itu neraka Jahanam. Mereka tidak dibinasakan hingga mereka mati dan tidak diringankan azabnya} azab neraka {dari mereka. Demikianlah Kami membalas setiap orang yang sangat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Setelah Allah menjelaskan keadaan para penghuni surge dengan segala kenikmatan yang mereka dapatkan, maka Allah menjelaskan keadaan para penghuni neraka dan azab yang akan mereka dapatkan, seraya berfirman, “Dan orang-orang kafir” yaitu orang-orang yang mengingkari apa-apa yang dibawa oleh para Rasul, seperti ayat-ayat, dan mereka mengingkari perjumpaan dengan Allah. “Bagi mereka Neraka Jahanam”; mereka disiksa di dalamnya dengan siksaan yang paling dahsyat dan hukuman yang paling keras. “Mereka tidak dibinasakan” dengan kematian “sehingga mereka mati” sehingga mereka bisa beristirahat ”dan tidak pula diringankan dari mereka azabnya.” Jadi, dahsyat dan besarnya siksaan itu terus melanda mereka sepanjang waktu dan setiap detik. “Demikianlah Kami membalas setiap orang yang sangat kafir.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 36: Adapun mereka yang kafir, sungguh telah Allah siapkan api jahannam, mereka diadzab di dalamnya dengan adzab yang keras yang tidak akan pernah berakhir. Mereka semua berada di dalam adzab ini, Allah tidak berikan mereka kematian dan istirahat dari adzab, Allah juga tidak meringankan adzab pada mereka dari kerasnya adzab dan api jahannam. Inilah balasan bagi orang yang kafir, dan mengingkari Allah dan Rasul-Nya ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan penghuni surga dan kenikmatannya, maka Allah Subhaanahu wa Ta'aala menyebutkan keadaan penghuni neraka dan siksaannya. Kepada ayat-ayat yang dibawa para rasul dan mengingkari pertemuan dengan Tuhan mereka. Yakni mereka akan disiksa dengan siksaan yang dahsyat. Dengan dimatikan. Dan dapat beristirahat. Bahkan mereka tidak mati dan tidak hidup di sana. Azab yang pedih senantiasa menimpa mereka di setiap saat dan setiap waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 36",
    "description": "Bila orang-orang yang mengikuti tuntunan Al-Qur'an dimasukkan ke surga, maka mereka yang durhaka akan disiksa di dalam neraka. Dan orang-orang yang kafir kepada Allah, rasul, dan kitab-Nya, maka bagi mereka neraka jahanam. Mereka terus disiksa di dalamnya dan sama sekali tidak dibinasakan hingga mereka mati supaya rasa pedih dari azab yang mereka terima tidak akan pernah berhenti, dan tidak diringankan dari mereka azabnya sedikit pun meski waktu berlalu. Demikianlah kami membalas setiap orang yang sangat kafir. 37. Dan pedihnya siksa membuat mereka berteriak di dalam neraka itu untuk memohon kepada Allah, 'ya tuhan kami, keluarkanlah kami dari neraka ini, niscaya kami akan mengerjakan kebajikan, yang berlainan de-ngan kedurhakaan dan kemaksiatan yang telah kami kerjakan dahulu. ' (lihat juga: al-Mu'min'n/23: 107'108). Teriakan itu tidak sama sekali mengurangi siksaan yang mereka terima, bahkan dikatakan kepada mereka, 'bukankah kami telah memanjangkan umurmu untuk dapat berpikir bagi orang yang mau berpikir, untuk mengambil pelajaran, padahal telah datang kepadamu seorang pemberi peringatan, yaitu para rasul dengan penjelasan-penjelasan dari Allah' maka rasakanlah azab kami, dan bagi orang-orang zalim tidak ada seorang penolong pun. '."
  }
]