[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu berteriak minta tolong di Neraka jahanam karena kerasnya azab yang mereka terima, “Wahai Tuhan kami, keluarkanlah kami dari Neraka Jahanam, kembalikanlah kami ke dunia, kami akan melakukan yang lain dari apa yang kami lakukan di dunia sebelum ini, kami akan beriman dan meninggalkan kekafiran.” Maka Allah menjawab, “Bukankah Kami telah menyediakan usia yang cukup bagi kalian, lalu siapa yang mengambil pelajaran maka dia mengambil pelajaran, Nabi telah datang kepada kalian, sekalipun demikian kalian tetap tidak merenungkan dan mengambil pelajaran? Maka rasakanlah siksa Api Neraka Jahanam. Orang-orang kafir tidak memiliki penolong yang membebaskan mereka dari azab Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Mereka berteriak dengan suara tertinggi mereka, meminta tolong seraya berkata, “Tuhan kami, keluarkanlah kami dari api Neraka, agar kami bisa beramal saleh berbeda dengan apa yang dahulu kami lakukan di dunia agara kami mendapatkan rida-Mu dan selamat dari azab-Mu.” Allah menjawab mereka, “Bukankah Kami sudah memberi kalian kesempatan hidup yang cukup bagi siapa yang hendak mengambil pelajaran, lalu dia bertobat kepada Allah dan beramal saleh dan telah datang kepada kalian seorang pemberi peringatan yang memperingatkan kalian dari azab Allah. Tidak ada alasan bagi kalian dan tidak ada uzur sesudah semua ini, maka rasakanlah azab api Neraka. Orang-orang yang menzalimi diri mereka dengan kekufuran dan kemaksiatan tidak memiliki seorang penolong pun yang mengentaskan mereka dari azab Allah atau meringankannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَهُمْ يَصْطَرِخُونَ فِيهَا (Dan mereka berteriak di dalam neraka itu) Yakni mereka berteriak dalam neraka meminta pertolongan dengan suara yang tinggi. Mereka berkata: رَبَّنَآ أَخْرِجْنَا نَعْمَلْ صٰلِحًا غَيْرَ الَّذِى كُنَّا نَعْمَلُ رَبَّنَآ أَخْرِجنَا نَعْمَلْ صٰلِحًا غَيْرَ الَّذِى كُنَّا نَعْمَلُ ۚ( Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh berlainan dengan yang telah kami kerjakan) Berupa kesyirikan dan kemaksiatan. Sehingga kami dapat mengganti kekafiran kami dahulu dengan keimanan, dan mengganti kemaksiatan dengan ketaatan. أَوَلَمْ نُعَمِّرْكُم مَّا يَتَذَكَّرُ فِيهِ مَن تَذَكَّرَ(Dan apakah Kami tidak memanjangkan umurmu dalam masa yang cukup untuk berfikir bagi orang yang mau berfikir) Yakni bukankah Kami telah memanjangkan umur kalian yang memungkinkan untuk berfikir bagi orang yang mau berfikir. Terdapat pendapat mengatakan yang dimaksud adalah menjadikan mereka sampai umur dewasa, yaitu 18 tahun. Pendapat lain mengatakan 60 tahun. Dan pendapat lain: 40 tahun. وَجَآءَكُمُ النَّذِيرُ ۖ( dan (apakah tidak) datang kepada kamu pemberi peringatan?) Mayoritas ahli tafsir mengatakan bahwa yang dimaksud adalah Rasulullah. Dan pendapat lain mengatakan yang dimaksud adalah uban di kepala. فَذُوقُوا۟ فَمَا لِلظّٰلِمِينَ مِن نَّصِيرٍ(maka rasakanlah (azab Kami) dan tidak ada bagi orang-orang yang zalim seorang penolongpun) Yakni rasakanlah azab neraka Jahannam, sebab kalian tidak mau mengambil ibrah dan pelajaran, sehingga kalian tidak memiliki penolong yang dapat mencegah dan menghalangi kalian dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Di dalam neraka mereka meminta tolong dengan suara yang keras seraya berkata: “Wahai Tuhan Kami, keluarkanlah kami dari neraka Jahanam, maka kami akan mengerjakan amal shalih yang Engkau perintahkan, bukan amal yang telah kami kerjakan di dunia berupa pertentangan dan kemaksiatan.” Bukankah Kami telah menjadikan umur kalian panjang sehingga mungkin bagi kalian dalam masa itu untuk berpikir bagi orang yang mau berpikir. Dan telah datang utusan yang memberi peringatan tentang azab Allah. Jadi, rasakanlah azab neraka. Tidaklah bagi orang-orang kafir itu penolong yang melindungi mereka dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berteriak di dalamnya} di dalam neraka mereka berteriak dengan sangat keras dan sungguh-sungguh {“Ya Tuhan kami, keluarkanlah kami, niscaya kami akan beramal shalih, bukan (amal) yang pernah kami kerjakan. “Bukankah Kami telah memanjangkan umur kalian selama masa dimana orang yang mau berpikir bisa berpikir} bukankan kalian telah hidup di dunia pada umur-umur yang memungkinkan bagi orang yang diberi tugas (untuk berpikir) untuk mengambil pelajaran dan berpikir {telah datang kepada kalian seorang pemberi peringatan} Rasulullah SAW {Maka rasakanlah. Tidak ada bagi orang-orang zalimseorang penolong pun”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Dan mereka berteriak di dalamnya.” Mereka berteriak (menjerit) dan meraung-raung (karena kesakitan) serta meminta pertolongan seraya mengatakan, “Ya Rabb kami, keluarkanlah kami, niscaya kami akan mengerjakan amal shalih yang berlainan dengan yang telah kami kerjakan.” Jadi, mereka mengakui dosa-dosa mereka dan mereka mengetahui bahwa Allah benar-benar telah berlaku adil terhadap mereka, namun mereka meminta agar dikembalikan ke dunia bukan pada waktunya. Maka mereka dijawab, “Dan apakah Kami tidak memanjangkan umurmu dalam masa” maksudnya: Waktu dan usia “yang cukup untuk berpikir bagi orang yang mau berpikir,” maksudnya, yang memungkinkan untuk merenungkan amal perbuatan. Kami telah memberikan kepada kalian kesenangan di dunia, Kami limpahkan berbagai rizki kepada kalian, Kami sediakan untuk kalian berbagai fasilitas untuk bersenang-senang, Kami panjangkan umur kalian, Kami turunkan ayat-ayat (mukjizat-mukjizat) secara bergantian kepada kalian, Kami utus secara silih berganti para pemberi peringatan kepada kalian dan Kami telah menguji kalian dengan kesenangan dan kesempitan agar kalian mau bertaubat dan kembali kepada Kami. Namun tidak satu pun peringatan itu yang membekas terhadap kalian, tidak satu nasihat pun yang berguna bagi kalian dan siksaan pun telah Kami tangguhkan terhadap kalian hingga akhirnya usia kalian berakhir, umur kalian ditutup dan kalian tinggalkan negeri ini, yaitu negeri pembalasan terhadap semua perbuatan, lalu kalian meminta agar dikembalikan? Sungguh tidak mungkin! Dan tidak mungkin ! kesempatan sudah berlalu, kalian telah dimurkai oleh Allah yang Maha Pengasih lagi Maha Penyayang, azab pun sudah makin dahsyat menimpa kalian dan kalian telah dilupakan oleh para penghuni syurga. Maka tinggallah kalian di dalam neraka dengan kekal abadi, dalam keadaan terhina di dalam siksaan. Maka dari itu Allah berfirman, “Maka rasakanlah dan tidak ada bagi orang-orang yang zhalim seorang penolong pun” yang dapat menolong mereka untuk mengeluarkannya darinya, atau meringankan azabnya dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 37: Mereka orang-orang kafir di neraka, mereka berteriak dengan kencang, dan meminta kepada Allah ampunan dengan berkata : Wahai Tuhan kami, keluarkan kami dari neraka, kembalikan kami ke dunia; kami akan beriman kepadamu dan beramal shalih. Allah menjawab mereka : Bukankah Kami telah memberikan umur untuk hidup kepada kalian dengan umur yang kalian dapat mengingat amalan dan menambah kebaikan ?! Telah Kami datangkan utusan Kami, mengabarkan dan memperingatkan kalian dari tempat kembali ini. Kalian malah mendustkannya dan tidak mentaatinya ?! Maka tinggallah kalian di neraka, dan rasakan panasnya, rasakan adzabnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maka mereka mengakui dosa mereka, mereka mengakui bahwa Allah Subhaanahu wa Ta'aala Maha Adil kepada mereka. Oleh karena itu mereka meminta kembali ke dunia, padahal bukan waktunya lagi. Yakni bukankah Kami telah memanjangkan umurmu di mana pada masa-masa itu seharusnya kamu dapat berpikir. Allah Subhaanahu wa Ta'aala pun telah mendatangkan ayat-ayat-Nya kepadamu, mengutus para rasul dan penerusnya (para ulama yang memberi peringatan dan nasihat), memberikan cobaan dan musibah agar kamu sadar, menampakkan musibah yang menimpa orang lain di hadapanmu, panggilan beribadah kepada-Nya dan beramal (azan) selalu berulang-ulang dan didengar oleh telingamu. Namun semua itu, tidak membuatmu sadar, hingga datang kematian kepadamu barulah kamu sadar, dan jika sudah ke alam yang baru (alam kubur dan alam akhirat), maka sudah tidak mungkin lagi kembali ke dunia, karena alam itu adalah alam pembalasan, adapun alam tempat beramal adalah alam dunia dan alam itu telah kamu lewati namun tidak kamu isi dengan beriman, beribadah dan beramal saleh. Yang menghindarkan mereka dari azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 37",
    "description": "Dan pedihnya siksa membuat mereka berteriak di dalam neraka itu untuk memohon kepada Allah, 'ya tuhan kami, keluarkanlah kami dari neraka ini, niscaya kami akan mengerjakan kebajikan, yang berlainan de-ngan kedurhakaan dan kemaksiatan yang telah kami kerjakan dahulu. ' (lihat juga: al-Mu'min'n/23: 107'108). Teriakan itu tidak sama sekali mengurangi siksaan yang mereka terima, bahkan dikatakan kepada mereka, 'bukankah kami telah memanjangkan umurmu untuk dapat berpikir bagi orang yang mau berpikir, untuk mengambil pelajaran, padahal telah datang kepadamu seorang pemberi peringatan, yaitu para rasul dengan penjelasan-penjelasan dari Allah' maka rasakanlah azab kami, dan bagi orang-orang zalim tidak ada seorang penolong pun. '38. Allah mengabaikan permohonan orang-orang kafir itu, karena sungguh, Allah mengetahui yang gaib dan tersembunyi di langit dan di bumi; tidak ada yang luput dari pengetahuan-Nya. Sungguh, dia maha mengetahui segala isi hati dan akan memberinya balasan yang sepadan."
  }
]