[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah mengetahui segala yang ghaib di langit dan di bumi, Dia Maha Mengetahui apa yang tersimpan di dalam dada, maka waspadalah jangan sampai Allah mengetahui dada kalian memendam keraguan atau kesyirikan dalam keesaanNya atau pada kenabian Muhammad atau kalian bermaksiat dengan selain itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Sesungguhnya Allah Maha mengetahui apa yang gaib di langit dan di bumi, tidak ada sesuatu yang tersembunyi dari ilmu Allah, sesungguhnya Allah Maha mengetahui apa yang dirahasiakan oleh hamba-hamba-Nya di dalam dada mereka berupa kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Allah Maha Mengatahui segala yang tersembunyi di langit dan bumi, Maha Mengetahui segala yang tersimpan dalam dada dan tersembunyi dalam hati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. إِنَّ اللهَ عٰلِمُ غَيْبِ السَّمٰوٰتِ وَالْأَرْضِ ۚ (Sesungguhnya Allah mengetahui yang tersembunyi di langit dan di bumi) Yakni Allah mengetahui segala yang tersembunyi di langit dan di bumi, dan termasuk diantaranya adalah amalan-amalan mereka itu. Tidak ada yang tersembunyi dari Allah; seandainya Allah mengembalikan kalian ke dunia niscaya kalian juga tidak akan melakukan amal shalih, sebagaimana firman Allah: ولو ردوا لعادوا لما نهوا عنه “Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya.” (Al-An'am:28) إِنَّهُۥ عَلِيمٌۢ بِذَاتِ الصُّدُورِ(Sesungguhnya Dia Maha Mengetahui segala isi hati) Sebab jika Allah mengetahui apa yang ada dalam hati maka untuk mengetahui yang selain itu lebih mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Sesungguhnya Allah Maha Mengetahui keghaiban di langit dan bumi. Tidak ada yang luput dariNya. Sesungguhnya Dia Maha Mengetahui rahasia-rahasia jiwa dan apa yang ada dalam hati berupa keyakinan-keyakinan dan anggapan-anggapan. Dan Dia membalas setiap orang dengan sesuatu yang layak (baginya)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah mengetahui yang gaib di langit dan di bumi. Sesungguhnya Dia Maha Mengetahui segala isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Setelah Allah menjelaskan balasan bagi para penghuni dua negeri akhirat (surge dan neraka) dan menjelaskan amal perbuatan kedua golongan (penghuninya), maka Allah memberitakan tentang kemahaluasan ilmu dan pengetahuanNya atas segala yang ghaib di langit dan di bumi yang tidak dapat diketahui oleh pandangan mata manusia dan oleh pengetahuan mereka; dan bahwa sesungguhnya Allah mengetahui semua apa-apa yang tersembunyi dan semua yang tersimpan di dalam dada, seperti kebaikan, keburukan, kesucian, dan lain-lain, lalu Dia akan memberikan kepada masing-masing orang apa yang berhak ia terima dan menempatkan setiap orang pada tempatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 38: Allah mengabarkan bahwasanya Dia maha tahu atas segala yang tersembunyi di langit dan di bumi, dan Allah mengetahui dengan apa yang ada di dalam dada hamba-Nya dan niat dari hamba tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala sebutkan balasan kepada penghuni surga dan penghuni neraka serta menyebutkan amal masing-masingnya, maka Allah Subhaanahu wa Ta'aala memberitahukan tentang luasnya ilmu-Nya, pengetahuan-Nya terhadap yang gaib di langit dan di bumi, dan bahwa Dia mengetahui segala rahasia dan yang disembunyikan dalam dada berupa maksud baik dan buruk, dan Dia akan memberikan balasan masing-masingnya yang sesuai dan menempatkan seseorang pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 38",
    "description": "Allah mengabaikan permohonan orang-orang kafir itu, karena sungguh, Allah mengetahui yang gaib dan tersembunyi di langit dan di bumi; tidak ada yang luput dari pengetahuan-Nya. Sungguh, dia maha mengetahui segala isi hati dan akan memberinya balasan yang sepadan. 39. Di antara bukti kekuasaan-Nya adalah bahwa dialah yang menjadikan kamu, wahai manusia, sebagai khalifah-khalifah, yakni penguasa-penguasa yang datang silih berganti dari generasi ke generasi untuk menebarkan kemakmuran di bumi. Barang siapa kafir kepada Allah, maka akibat kekafirannya akan menimpa dirinya sendiri dan tidak sedikit pun berpengaruh kepada kekuasaan dan kebesaran Allah. Dan kekafir-an orang-orang kafir itu, yakni tetap memilih kufur dan menolak per-ingatan Allah melalui rasulullah, hanya akan menambah kemurkaan terhadap mereka di sisi tuhan mereka. Dan kekafiran orang-orang kafir itu hanya akan menambah kerugian mereka belaka, baik di dunia maupun di akhirat."
  }
]