[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah-lah Yang menjadikan kalian (wahai manusia) sebagian kalian meneruskan sebagian yang lain di muka bumi. Barangsiapa di antara kalian mengingkari keesaan Allah, maka mudarat dan kekafirannya itu akan menimpa dirinya sendiri, kekufuran orang-orang kafir di sisi Tuhan mereka tidak menambah kecuali kebencian dan kemarahan, kekafiran mereka kepada Allah tidak menambah mereka kecuali kesesatan dan kebinasaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Allah yang menjadikan sebagian dari kalian -wahai manusia- menggantikan sebagian yang lain di muka bumi, untuk menguji kalian bagaimana kalian beramal. Barangsiapa kafir kepada Allah dan kepada apa yang dibawa oleh para Rasul, maka dosanya dan hukuman atasnya kembali kepadanya. Kekufurannya tidak merugikan Tuhannya. Kekufuran orang-orang kafir di sisi Allah tidak menambah bagi mereka kecuali kemurkaan dan kebencian-Nya. Kekufuran orang-orang kafir di sisi Allah tidak menambah mereka kecuali kerugian, di sebabkan mereka merugi dengan gagal mendapatkan Surga yang telah Allah siapkan seandainya mereka beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Allah menjadikan kalian khalifah di bumi; Dia menjadikan bumi layak untuk kalian huni dan menundukkan kesusahan bagi kalian. Barangsiapa yang mengingkari kenikmatan-kenikmatan ini maka dosa keingkarannya akan dia tanggung sendiri, dan yang dia lakukan itu hanya akan menambah kejauhan dan kemurkaan dari Allah, serta menambah penyesalan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. هُوَ الَّذِى جَعَلَكُمْ خَلٰٓئِفَ فِى الْأَرْضِ ۚ (Dialah yang menjadikan kamu khalifah-khalifah di muka bumi) Yakni Allah menjadikan kalian umat yang mengganti umat sebelumnya. Qatadah mengatakan: maknanya adalah menjadikan kalian khalifah setelah khalifah sebelumnya, dan umat setelah umat sebelumnya. فَمَن كَفَرَ(Barangsiapa yang kafir) Kenikmatan ini. فَعَلَيْهِ كُفْرُهُۥ ۖ( maka (akibat) kekafirannya menimpa dirinya sendiri) Maka akibat kekafirannya akan menimpa dirinya, dan tidak menimpa orang lain. وَلَا يَزِيدُ الْكٰفِرِينَ كُفْرُهُمْ عِندَ رَبِّهِمْ إِلَّا مَقْتًا ۖ( Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kemurkaan pada sisi Tuhannya) Yakni menambah kemarahan dan kemurkaan kepada Allah. وَلَا يَزِيدُ الْكٰفِرِينَ كُفْرُهُمْ إِلَّا خَسَارًا (dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka) Yakni menambah kerugian dan kebinasaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Dialah Allah SWT yang telah menjadikan kalian generasi-generasi dan umat-umat yang meneruskan setiap umat sebelumnya, yaitu pengganti bagi orang sebelum kalian dalam bertahan hidup dan mengambil manfaat dari kebaikan-kebaikan bumi. Barangsiapa mengingkari keesaan Allah dan tidak mensyukuri nikmatNya, maka baginya itu kemudharatan dan konsekwensi kekufurannya. Kekufuran mereka tidak menambahi apapun di sisi Allah, Tuhan mereka kecuali kemarahan dan kebencian yang sangat dahsyat. Tidak pula kekufuran itu menambahi sesuatu kecuali kehancuran dan kerugian di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menjadikan kalian sebagai khalifah-khalifah} saling menggantikan satu sama lain {di bumi. Maka siapa saja yang kufur, maka kekufurannya akan menimpa dirinya. Kekufuran orang-orang kafir itu di sisi Tuhan mereka tidak lain kecuali menambah kemurkaan} kemurkaan yang dahsyat {Kekufuran orang-orang kafir itu tidak lain hanya akan menambah kerugian} kehancuran dan kerugian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Allah mengabarkan tentang kemahasempurnaan hikmah dan rahmatNya terhadap hamba-hambaNya, yaitu bahwa sesungguhnya Dia telah menetapkan dengan ketetapan takdirNya yang azali untuk menjadikan sebagian mereka menggantikan sebagian yang lain di bumi ini dan mengurus pada setiap umat seorang rasul yang memberikan peringatan, lalu Dia memperhatikan bagaimana mereka berbuat. “Barangsiapa yang kafir” kepada Allah dan apa-apa yang disampaikan oleh para RasulNya, maka akibat buruk kekafirannya pasti menimpa dirinya sendiri, dosa dan siksaannya melanda dirinya sendiri, tidak ada seorang pun yang akan menanggungnya; dan kekafiran orang yang kafir itu hanya menambah kebencian dan kemurkaan RabbNya terhadap dirinya. Siksaan apakah yang lebih besar daripada murka Rabb yang Mahasuci.? “Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka.” Maksudnya, merugikan diri mereka sendiri dan keluarga, (menyia-nyiakan) amal perbuatan serta (gagal meraih) tempat-tempat tinggal mereka di surge. Jadi, orang yang kafir itu selalu makin bertambah sengsara, rugi dan hina di sisi Allah dan di sisi MakhlukNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 39: Ketahuilah wahai manusia, bahwasanya Allah lah yang menjadikan kalian berbeda-beda, berbeda dari umat-umat yang sebelum kalian. Yaitu kalian berbeda-beda dalam beribadah kepada Allah, berbeda dalam kemajuan di bumi, dan Allah lahyang mengeluarkan hasil tambang dan buah-buahan agar kalian bersyukur kepada Allah atas nikmat-Nya, beramalah dengan ketaatan; Maka barangsiapa yang mengingkari dan kufur kepada Allah serta kufur kepada nikmat Allah, maka sungguh kekufurannya akan kembali kepada dia sendiri, tidak memudharatkan Allah apapun itu. Dan tidaklah bertambah kekafiran mereka yang kafir kecuali hanyalah menambah kemarahan Allah, dengan kemarahan yang besar, tidak juga menambah mereka kecuali kesesatan dan kebinasaan di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya hikmah-Nya dan rahmat-Nya kepada hamba-hamba-Nya. Dia menentukan dengan qadar-Nya yang terdahulu, bahwa Dia menjadikan sebagian mereka menjadi pengganti bagi sebagian yang lain, mengutus pemberi peringatan untuk setiap umat, lalu Dia memperhatikan apa yang mereka kerjakan. Barang siapa yang kafir kepada Allah dan kepada apa yang dibawa para rasul-Nya, maka kekafiran itu akibatnya menimpa dirinya, demikian pula dosa dan hukumannya, dan tidak akan dipikul oleh seorang pun. Padahal hukuman apa yang lebih besar daripada kemurkaan Allah Yang Mahamulia. Mereka merugikan diri mereka dan amal mereka. Oleh karena itu, orang kafir senantiasa bertambah sengsara dan rugi, serta mendapatkan kehinaan baik di sisi Allah maupun di sisi manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 39",
    "description": "Di antara bukti kekuasaan-Nya adalah bahwa dialah yang menjadikan kamu, wahai manusia, sebagai khalifah-khalifah, yakni penguasa-penguasa yang datang silih berganti dari generasi ke generasi untuk menebarkan kemakmuran di bumi. Barang siapa kafir kepada Allah, maka akibat kekafirannya akan menimpa dirinya sendiri dan tidak sedikit pun berpengaruh kepada kekuasaan dan kebesaran Allah. Dan kekafir-an orang-orang kafir itu, yakni tetap memilih kufur dan menolak per-ingatan Allah melalui rasulullah, hanya akan menambah kemurkaan terhadap mereka di sisi tuhan mereka. Dan kekafiran orang-orang kafir itu hanya akan menambah kerugian mereka belaka, baik di dunia maupun di akhirat. 40. Untuk menunjukkan bukti bagi kekuasaan-Nya, Allah meminta nabi berdialog dengan orang-orang kafir yang meyakini Allah mempunyai sekutu. Katakanlah, wahai nabi Muhammad, kepada orang-orang kafir itu, 'terangkanlah olehmu tentang sekutu-sekutumu yang kamu seru dan sembah selain Allah!' apa yang mendorong kamu menyembah dan minta pertolongan kepada mereka' mampukan mereka menciptakan sesuatu' perlihatkanlah kepada-ku bagian manakah dari bumi ini yang telah mereka ciptakan; ataukah mereka mempunyai peran serta dalam penciptaan langit; atau adakah kami memberikan kitab kepada mereka sehingga mereka mendapat keterangan-keterangan yang jelas darinya bahwa Allah mempunyai sekutu-sekutu yang mereka sembah itu' pasti tidak ada! sebenarnya orang-orang zalim itu, sebagian mereka hanya menjanjikan tipuan belaka kepada sebagian yang lain, antara lain dengan mengatakan bahwa sembahan selain Allah itu akan memberi syafaat kepada pe-nyembahnya. Janji-janji itu adalah kebohongan belaka."
  }
]