[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kaummu mendustakanmu (wahai Rasul) maka sungguh para Rasul sebelummu juga telah didustakan. Segala perkara akan kembali kepada Allah di akhirat, lalu Dia membalas setiap orang sesuai dengan haknya. Dalam ayat Ini mengandung hiburan bagi Rasulullah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Bila kaummu mendustakanmu -wahai Rasul- maka bersabarlah, karena kamu bukanlah Rasul pertama yang didustakan oleh kaumnya. Umat-umat terdahulu telah mendustakan rasul mereka seperti 'Ād, Ṡamūd dan kaum Lūṭ. Dan hanya kepada Allah semata segala urusan berpulang. Allah membinasakan orang-orang yang mendustakan, dan Dia memenangkan utusan-utusan-Nya dan orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Jika mereka mendutakanmu atas risalah yang kamu bawa, sesungguhnya para rasul sebelummu juga telah didustakan. Kedustaan mereka tidak dapat dibenarkan, dan keadaan mereka seperti keadaan umat terdahulu yang telah mendustakan. Dan kepada Allah tempat mereka kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Wahai Nabi, jika orang-orang musyrik mendustakanmu saat mengajak untuk bertauhid dan beriman kepada hari akhir, maka sungguh para rasul sebelummu juga didustakan demikian. Maka bersabarlah sebagaimana mereka bersabar dan hanya kepada Allah perkara-perkara itu dikembalikan. Dia membalas tiap-tiap orang dengan apa yang layak untuknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka mendustakanmu, sungguh rasul-rasul sebelummu juga telah didustakan. Hanya kepada Allah segala urusan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan jika mereka mendustakan kamu” wahai Rasul, maka kamu mempunyai suri tauladan dari para Rasul sebelummu, “maka sungguh telah didustakan pula rasul-rasul sebelum kamu.” Kemudian orang-orang yang mendustakan itu pun dibinasakan, dan Allah menyelamatkan para rasul tersebut beserta para pengikutnya. “Dan hanya kepada Allah-lah dikembalikan segala urusan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 4: Allah berkata menghibur Nabi ﷺ : Jika orang-orang musyrik dari umatmu mendustakanmu wahai Nabi Allah, atas dakwahmu dari kebenaran dan cahaya yang jelas; Maka janganlah bersedih atas pengingkaran mereka, bersabarlah sampai datang pertolongan Allah, ikutilah saudara-saudaramu dari kalangan Nabi sebelummu yang juga didustakan oleh kaum mereka, maka bersabarlah sampai datang pertolongan Allah, ketahuilah bahwa seluruh makhluk tempat kembalinya adalah Allah saja dan Allah akan membalas dengan apa yang mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti tentang tauhid, kebangkitan, hisab dan pembalasan. Oleh karena itu, bersabarlah sebagaimana mereka bersabar. Di akhirat. Dia akan membalas orang-orang yang mendustakan dan akan membela para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 4",
    "description": "Dan jika mereka mendustakan engkau, wahai nabi Muhammad, setelah engkau memberi mereka seruan untuk beriman kepada Allah yang telah melimpahkan rahmat, maka sungguh, rasul-rasul sebelum engkau telah didustakan pula. Karena itu, janganlah bersedih dan bersabarlah seperti halnya mereka (lihat juga: al-an''m/6: 34). Dan hanya kepada Allah segala urusan dikembalikan. Dia akan memberi balasan sesuai perbuatan setiap orang. 5. Usai mengisyaratkan bahwa kiamat pasti akan tiba, Allah lalu secara tegas menyatakan bahwa janji tentang kiamat, pahala, dan siksa adalah benar adanya. Karenanya, manusia tidak boleh terlena dan teperdaya oleh kehidupan dunia. Wahai manusia! sungguh, janji Allah tentang pahala dan siksa itu benar, maka janganlah kehidupan dunia seperti kekayaan dan kekuasaan memperdayakan kamu sehingga kamu sedikit bahkan tidak sama sekali menyiapkan diri untuk kehidupan akhirat. Dan janganlah setan yang pandai menipu dapat memperdayakan kamu tentang Allah dan ajaran agama-Nya."
  }
]