[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah (wahai Rasul) kepada orang-orang musyrik, “beritahukanlah kepadaku, apa yang telah dibuat oleh sekutu-sekutu kalian di bumi, atau apakah sekutu-sekutu yang kalian sembah selain Allah itu memiliki wewenang untuk berserikat bersama Allah dalam menciptakan langit atau Kami memberi kalian kalian sebuah kitab sehingga dengannya mereka memiliki hujjah?” sebaliknya, apa yang dijanjikan oleh sebagian orang-orang kafir kepada sebagian lainnya hanyalah tipu daya dan kebohongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Katakanlah -wahai Rasul- kepada orang-orang musyrikin, “Jelaskan kepadaku tentang sekutu-sekutu kalian yang kalian sembah selain Allah, apa yang telah mereka ciptakan di bumi, apakah mereka menciptakan gunung-gunungnya atau sungai-sungainya atau hewan-hewannya, atau mereka itu sekutu-sekutu bagi Allah dalam menciptakan langit, atau Kami telah memberi mereka suatu kitab yang berisi hujah atas kebenaran ibadah mereka kepada sekutu-sekutu mereka?” Tidak satu pun dari semua perkara itu. Sebaliknya orang-orang zalim itu tidak menyediakan bagi diri mereka dengan kekufuran dan kemaksiatan mereka kecuali tipu daya, sebagian dari mereka atas sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Allah memerintahkan Nabi Muhammad untuk bertanya kepada orang-orang kafir sebagai bentuk pengingkaran dan teguran: “Apakah kalian melihat sekutu-sekutu yang kalian sembah selain Allah? Tunjukkanlah kepadaku, apa yang telah mereka ciptakan dari hal yang ada di bumi, ataukah mereka memiliki bagian di langit, atau Kami telah memberi mereka kitab sehingga mereka berada dalam keimanan dan jalan yang benar? Jika telah jelas bahwa mereka tidak dapat menciptakan, tidak memiliki apapun, dan tidak pula mendapat hujjah; maka telah jelas pula bahwa janji di antara orang-orang zalim itu adalah janji dusta.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَرُونِى مَاذَا خَلَقُوا۟ مِنَ الْأَرْضِ (Perlihatkanlah kepada-Ku (bahagian) manakah dari bumi ini yang telah mereka ciptakan) Sehingga kalian menyembah mereka. أَمْ لَهُمْ شِرْكٌ فِى السَّمٰوٰتِ(ataukah mereka mempunyai saham dalam (penciptaan) langit) Ataukah mereka turut menciptakan langit bersama Allah, atau turut memiliki dan mengaturnya, sehingga mereka berhak untuk dijadikan tuhan? أَمْ ءَاتَيْنٰهُمْ كِتٰبًا(atau adakah Kami memberi kepada mereka sebuah Kitab) Apakah Kami memberi orang-orang kafir Makkah itu sebuah kitab yang menjelaskan bahwa Allah memiliki sekutu? بَلْ إِن يَعِدُ الظّٰلِمُونَ بَعْضُهُم بَعْضًا إِلَّا غُرُورًا (Sebenarnya orang-orang yang zalim itu sebahagian dari mereka tidak menjanjikan kepada sebahagian yang lain, melainkan tipuan belaka) Sebagaimana yang dilakukan oleh para pemimpin yang memberi janji-janji bagi para pengikut untuk menipu dan memperdaya mereka, padahal itu hanyalah kedustaan untuk menipu mereka dengan mengatakan: ini adalah tuhan-tuhan yang dapat memberi manfaat dan mendekatkan mereka kepada Allah serta memberi syafaat di sisi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Wahai Nabi, katakanlah kepada orang-orang musyrik: “Kabarkanlah kepadaku tentang sekutu-sekutu kalian yang kalian sembah selain Allah, yaitu berhala-berhala dan patung-patung yang kalian anggap itu sebagai sekutu-sekutu Allah SWT. Kabarkanlah kepadaku tentang apa yang mereka ciptakan di bumi sehingga kalian menyembah mereka?” Ataukah mereka ikut serta dalam penciptaan langit sehingga menjadi salah satu Tuhan, ataukah Kami menurunkan kitab untuk mereka yang memperbolehkan mereka untuk menyekutukan Allah dan menjadi hujjah yang terang bagi mereka. Akan tetapi ((Bal) Untuk meniadakan sesuatu sebelumnya dan berpindah pada kalam lain) pertolongan dan hal lain yang dijanjikan sebagian orang-orang zalim yang kafir itu kepada sebagian lainnya tidak lain kecuali kebathilan yang dihias saja dan tidak ada faktanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah, “Bagaimana pendapat kalian} terangkanlah kepadaku {tentang sekutu-sekutu yang kalian seru selain Allah. Perlihatkanlah kepadaKu apa yang telah mereka ciptakan dari bumi ataukah mereka ikut serta dalam (penciptaan) langit} ikut serta dalam penciptaan langin {atau apakah ada yang Kami anugerahkan kepada mereka} Kami berikan kepada orang-orang kafir Mekkah {kitab sehingga mereka mendapat keterangan-keterangan yang jelas darinya} dalil dari kitab tersebut {Sebenarnya orang-orang zalim itu sebagian mereka tidak menjanjikan apapun kepada sebagian yang lain melainkan hanya tipuan} tipu daya dan kepalsuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah berfirman sebagai pernyataan kelemahan bagi sembahan-sembahan kaum musyrikin, dan menjelaskan kerapuhan dan kepalsuan kesyirikan mereka dari segala sisinya, “Katakanlah.” Artinya, jelaskanlah kepadaku tentang sembahan-sembahan kalian, “yang kamu seru selain Allah,” apakah mereka berhak diseru dan diibadahi?! Cobalah perlihatkan kepadaku, “manakah (bagian) dari bumi ini yang telah mereka ciptakan” apakah mereka yang menciptakan lautan, atau merekakah yang telah menciptakan gunung, atau merekakah yang telah menciptakan hewan, atau merekakah yang telah menciptakan benda-benda mati?! Mereka akan mengakui bahwa Pencipta semua benda-benda itu adalah Allah. Ataukah sembahan-sembahan kalian mempunyai “saham dalam langit,” yakni, dalam menciptakan dan mengaturnya?! Mereka akan mengatakan, kalau mereka tidak mempunyai andil! Kalau mereka sama sekali tidak menciptakan sesuatu apa pun dan tidak mempunyai andil bersama Sang Pencipta di dalam menciptakannya. Lalu kenapa kalian menyembah dan berdoa kepada mereka, padahal kalian mengakui kelemahan dan kerapuhan mereka? maka sirnalah dalil aqli (logika) yang membenarkan peribadahan kepada mereka dan membuktikan kepalsuannya. Kemudian Allah menyebutkan dalil sam’i (wahyu), dan itu juga ditiadakan, maka dari itu Allah berfirman, “Atau adakah Kami memberi kepada mereka sebuah kitab” yang membicarakan tentang apa yang mereka persekutukan, yang menyuruh mereka melakukan syirik dan menyembah berhala, “sehingga mereka,” di dalam kesyirikan mereka tersebut “mendapat keterangan-keterangan yang jelas,” dari kitab yang diturunkan kepada mereka itu tentang sahnya perbuatan syirik mereka? Sama sekali tidak demikian adanya, sebab mereka sama sekali tidak mendapat satu kitab pun sebelum diturunkannya al-Quran, dan tidak pula ada seorang rasul pun yang datang sebelum kedatangan Rasulullah, Muhammad. Kalau seandainya dipastikan bahwa ada sebuah kitab yang diturunkan dan seorang rasul telah diutus kepada mereka dan mereka mengaku bahwa rasul itu telah memerintah mereka melakukan syirik, maka Kami dengan tegas menyatakan kedustaan mereka, sebab Allah telah berfirman, \"Dan Kami tidak mengutus seorang rasul pun sebelum kamu, melainkan Kami wahyukan kepadanya: \"Bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka sembahlah olehmu sekalian akan Aku\". (Al-Anbiya:25). Jadi, para rasul dan kitab-kitab suci samawi semua sepakat atas perintah mengiklaskan agama (kepatuhan) hanya kepada Allah, sebagaimana ditegaskan oleh Allah, \"Padahal mereka tidak disuruh kecuali supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama dengan lurus, dan supaya mereka mendirikan salat dan menunaikan zakat; dan yang demikian itulah agama yang lurus.\" (Al-Bayyinah:5). Kalau ada yang mengatakan, apabila dalil aqli dan naqli sudah membuktikan kepalsuan syirik, lalu apa yang menyeret kaum musyrikin kepada syirik, padahal di antara mereka ada orang-orang yang berakal, cerdik dan pintar?! Allah menjawab dengan FirmanNya, “Sebenarnya orang-orang yang zhalim itu sebagian dari mereka tidak menjanjikan kepada sebagian yang lain, melainkan tipuan belaka.” Maksudnya, jalan (syirik) yang mereka tempuh itu sama sekali mereka tidak memiliki hujjahnya (argument, dalil). Ia hanyalah merupakan pesan sebagian mereka kepada sebagian yang lain untuk melakukannya, pengelabuan sebagian mereka kepada sebagian yang lain, taklid buta orang yang datang kemudian kepada para pendahulunya yang sesat dan angan-angan kosong yang dibisikkan oleh setan. Setan telah menjadikan indah perbuatan-perbuatan buruk mereka sehingga terpatri dalam hati mereka dan menjadi salah satu sifatnya, sehingga sulit dihilangkan dan sukar untuk dipisahkan darinya. Maka terjadilah apa yang terjadi, yaitu kukuh dalam kekafiran dan kesyirikan batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 40: Katakanlah wahai Nabi Allah kepada mereka orang-orang yang musyrik : Kabarkan kepadaku tentang mereka yang kalian sembah selain Allah, perlihatkan kepadaku apa saja yang telah mereka ciptakan di bumi dan menjadikan yang wujud sebelum ketiadaan ?! Ataukah sesembahan ini hanyalah klaim belaka yang dikatakan bersekutu kepada Pencipta langit ? Atau apakah Kami kah yang telah memberikan kepada orang-orang musyrik kitab yang mencocoki hawa nafsu mereka, sehingga mereka menyeru seruan-seruan mereka, mereka membacakan kitab tersebut atau berhujjah dengan apa yang ada di dalamnya ?! Bahkan tidak orang-orang yang kafir sebagiannya atas sebagian yang lain kecuali hanyalah kesombongan dan tipuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman melemahkan sesembahan orang-orang musyrik, menerangkan kekurangannya, dan membatalkan syirk mereka dari berbagai sisi. Yakni wahai Rasul kepada mereka. Yakni apakah mereka memang berhak disembah dan diminta? Apakah laut yang mereka ciptakan, atau apakah gunung yang mereka ciptakan, atau apakah hewan yang mereka ciptakan, atau apakah benda mati yang mereka ciptakan? Tentu mereka akan mengakui, bahwa yang menciptakan semua itu adalah Allah Subhaanahu wa Ta'aala. Tentu mereka akan mengatakan, bahwa sekutu-sekutu mereka itu tidak memiliki peran apa-apa terhadap penciptaan langit apalagi mengaturnya. Jika mereka tidak menciptakan apa-apa dan tidak ikut serta dengan Allah Subhaanahu wa Ta'aala dalam menciptakan makhluk-Nya dan mengaturnya, maka mengapa kamu menyembahnya dan berdoa kepadanya padahal kamu mengakui kelemahannya. Dengan demikian, dalil akal menunjukkan tidak benarnya menyembah mereka dan menunjukkan batilnya. Pada lanjutan ayatnya, Allah Subhaanahu wa Ta'aala sebutkan tentang dalil naqli (wahyu), bahwa ternyata mereka tidak memiliki dalil naqlinya sebagaimana tidak memiliki dalil ‘aqli (akal). Yang menyuruh mereka berbuat syirk dan menyembah patung dan berhala. Yakni keterangan yang membenarkan perbuatan syirk. Ternyata tidak ada, karena sebelum Al Qur’an tidak ada kitab yang turun kepada mereka dan sebelum Rasulullah shallallahu 'alaihi wa sallam, tidak ada yang memberi peringatkan mereka. Jika seseorang bertanya, “Jika dalil naqli dan dalil ‘aqli menunjukkan batilnya syirk, lalu apa yang membuat kaum musyrik tetap di atas perbuatan syirk, padahal di tengah-tengah mereka ada orang yang berakal, yang cerdas dan pandai? Maka jawabannya tercantum dalam lanjutan ayatnya, yaitu firman-Nya, “Sebenarnya orang-orang zalim itu, sebagian mereka hanya menjanjikan tipuan belaka kepada sebagian yang lain.” Inilah yang mereka lakukan, mereka tidak memiliki hujjah tetapi hanya mendapat pesan dari kawan-kawannya serta penghiasan dari mereka, demikian pula karena orang yang terlambat dari mereka mengikuti orang yang di depan padahal sesat, dan karena angan-angan setan yang menghias indah perbuatan buruk mereka, sehingga tertanamlah dalam hati mereka dan menjadi sifat yang melekat dalam diri mereka, sehingga sulit disingkirkan, dan berat dipisahkan, maka terjadilah apa yang terjadi berupa tetap di atas syirk dan kekafiran serta kebatilan. Ada yang berpendapat, yaitu menjanjikan bahwa patung-patung itu memberi syafaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 40",
    "description": "Untuk menunjukkan bukti bagi kekuasaan-Nya, Allah meminta nabi berdialog dengan orang-orang kafir yang meyakini Allah mempunyai sekutu. Katakanlah, wahai nabi Muhammad, kepada orang-orang kafir itu, 'terangkanlah olehmu tentang sekutu-sekutumu yang kamu seru dan sembah selain Allah!' apa yang mendorong kamu menyembah dan minta pertolongan kepada mereka' mampukan mereka menciptakan sesuatu' perlihatkanlah kepada-ku bagian manakah dari bumi ini yang telah mereka ciptakan; ataukah mereka mempunyai peran serta dalam penciptaan langit; atau adakah kami memberikan kitab kepada mereka sehingga mereka mendapat keterangan-keterangan yang jelas darinya bahwa Allah mempunyai sekutu-sekutu yang mereka sembah itu' pasti tidak ada! sebenarnya orang-orang zalim itu, sebagian mereka hanya menjanjikan tipuan belaka kepada sebagian yang lain, antara lain dengan mengatakan bahwa sembahan selain Allah itu akan memberi syafaat kepada pe-nyembahnya. Janji-janji itu adalah kebohongan belaka. 41. Setelah terbukti bahwa tidak ada siapa dan apa pun yang terlibat dalam penciptaan serta pengaturan langit dan bumi selain Allah, lalu ditegaskan bahwa sungguh, Allah-lah yang menahan langit dan bumi agar tidak lenyap dengan memelihara sistem peredarannya; dan jika kedua-Nya akan lenyap akibat gangguan pada sistem peredarannya, maka tidak ada seorang pun yang mampu menahannya selain Allah. Sungguh, dia maha penyantun, selalu berbelas kasih, tidak menyegerakan kehancuran alam raya, dan menunda siksa bagi pendurhaka untuk memberinya kesempatan bertobat; sungguh Allah maha pengampun kepada siapa pun yang bertobat."
  }
]