[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah memegang langit dan bumi sehingga keduanya tidak lepas dari tempatnya masing-masing, seandainya langit dan bumi lepas dari orbitnya, maka tidak ada seorang pun yang mampu memegang keduanya selain Allah. sesungguhnya Allah Maha Penyantun dengan menunda hukumanNya terhadap orang-orang kafir dan para pendurhaka, Maha Pengampun bagi siapa yang bertaubat dari dosanya dan kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Sesungguhnya Allah menahan langit dan bumi sehingga keduanya tidak hilang dari tempatnya, seandainya keduanya terlepas -andai terjadi demikian- maka tidak ada seorang pun yang menahannya sesudah-Nya. Sesungguhnya Allah Maha Penyantun, tidak menyegerakan hukuman, Maha Pengampun bagi siapa yang bertobat di antara hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Allah -dengan keagungan dan kekuasaan-Nya- menahan langit dan bumi; jika tidak, niscaya bumi dan langit akan hancur. Dan jika telah hancur maka tidak ada yang dapat menghentikannya kecuali Allah. Sungguh besar kelembutan dan kasih sayang Allah bagi hamba-hamba-Nya. Seandainya Allah menghendaki, Allah akan segera membinasakan setiap orang yang berdosa dan lalai; akan tetapi Allah Maha Lembut kepada mereka, menutupi dosa dan mengampuni mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. إِنَّ اللهَ يُمْسِكُ السَّمٰوٰتِ وَالْأَرْضَ أَن تَزُولَا ۚ (Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap) Ayat ini menjelaskan kuasa Allah dan kehebatan penciptaan-Nya, setelah Allah menjelaskan lemahnya para berhala itu dan ketidakberdayaan mereka untuk melakukan sesuatu apapun. وَلَئِن زَالَتَآ إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِّنۢ بَعْدِهِۦٓ ۚ( dan sungguh jika keduanya akan lenyap tidak ada seorangpun yang dapat menahan keduanya selain Allah) Yakni tidak ada yang mampu menahan keduanya kecuali Allah jika keduanya akan hancur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Sesungguhnya Allah menjaga langit (yaitu setiap sesuatu yang diangkat di atas kepala berupa benda-benda langit, planet-planet dan bintang-bintang) dan bumi dengan kuasaNya agar tidak menghilang dari tempatnya. Dan jika langit dan bumi hilang, maka tidak ada satupun kecuali Dia (Allah) yang dapat menjaga keduanya agar tidak hilang. Sesungguhnya Allah SWT Maha Pemurah sehingga tidak mempercepat hukuman dan Maha Pengampun bagi dosa orang-orang yang bertaubat. Itu adalah sebab penjagaanNya terhadap langit dan bumi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Allah yang menahan langit dan bumi agar tidak lenyap. Jika keduanya akan lenyap, Sungguh jika keduanya akan lenyap, maka tidak ada yang menahan keduanya} jika keduanya akan lenyap maka tidak ada yang menahannya {selain Dia. Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah menginformasikan tentang kemahasempurnaan KuasaNya dan keparipurnaan rahmatNya serta keluasan sifat santun dan ampunanNYa, dan bahwasanya Allah “menahan langit dan bumi” agar tidak lenyap, sebab kalau keduanya lenyap, maka tak seorang pun di antara makhluk ini yang dapat menahannya, dan sudah pasti kuasa dan kekuatan mereka tidak mampu untuk bisa menahannya. Namun, Allah telah menetapkan keberadaan keduanya sebagaimana adanya, agar tercipta rasa aman, manfaat, dan sikap mengambil pelajaran bagi manusia, dan agar mereka mengetahui keagungan kerajaanNya dan kehebatan kekuasaanNya yang dapat membuat hati mereka penuh dengan rasa membesarkan, mengagungkan, mencintai dan memuliakan (Nya), dan supaya mereka mengetahui kesempurnaan sifat santunNya dan mengampuni dengan menangguhkan orang-orang yang berdosa dan Allah tidak segera mengazab orang-orang yang durhaka, padahal kalau saja Allah memerintah langit, niscaya ia melempari mereka (dengan hujan azab); dan kalau saja Allah mengizinkan kepada bumi, niscaya ia menelan mereka. Akan tetapi ampunan, kelembutan, dan kemurahanNya Mahaluas. “Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 41: Allah mengabarkan bahwasanya di antara yang nampak dari kekuasaan-Nya dan hikmah-Nya adalah Dia menahan langin dan bumi berpindah dari posisinya, maka jika tergelincir keduanya dari posisinya, maka tidaklah ada makhluk yang menahan keduanya kecuali hanyalah Allah, Dia lah Allah yang murah hati kepada hamba-Nya, maha pengampun bagi siapa yang bertaubat dan berharap kembali kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya kekuasaan-Nya, sempurnanya rahmat-Nya, dan luasnya santun dan ampunan-Nya, dan bahwa Dia menahan langit dan bumi agar tidak lenyap, dan bahwa jika keduanya lenyap, maka tidak ada yang dapat yang dapat menahannya kecuali Allah Subhaanahu wa Ta'aala., di samping itu karena kelemahan mereka (makhluk-Nya) baik kemampuan maupun kekuatan untuk menjaganya. Akan tetapi Allah Subhaanahu wa Ta'aala menetapkan agar langit dan bumi tetap ada sebagaimana disaksikan agar menjadi tempat bagi makhluk-Nya, bisa memberi manfaat dan mengambil pelajaran agar mereka mengetahui sebagian dari besarnya kekuasaan-Nya dan kekuatan kemampuan-Nya sehingga membuat hati mereka membesarkan-Nya dan mengagungkan-Nya, mencintai dan memuliakan-Nya, dan agar mereka mengetahui sempurnanya santun dan ampunan-Nya dengan memberi tangguh orang-orang yang berdosa, tidak segera menyiksa orang-orang yang bermaksiat, padahal jika Dia memerintahkan langit untuk menimpakan bebatuan kepada manusia tentu akan terjadi, dan jika Dia mengizinkan bumi untuk membinasakan manusia, tentu bumi akan menelan mereka, akan tetapi ampunan-Nya begitu luas sehingga mengena mereka, demikian pula santun (kesabaran)-Nya dan kepemurahan-Nya, dan sesungguhnya Dia Maha Penyantun lagi Maha Pengampun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 41",
    "description": "Setelah terbukti bahwa tidak ada siapa dan apa pun yang terlibat dalam penciptaan serta pengaturan langit dan bumi selain Allah, lalu ditegaskan bahwa sungguh, Allah-lah yang menahan langit dan bumi agar tidak lenyap dengan memelihara sistem peredarannya; dan jika kedua-Nya akan lenyap akibat gangguan pada sistem peredarannya, maka tidak ada seorang pun yang mampu menahannya selain Allah. Sungguh, dia maha penyantun, selalu berbelas kasih, tidak menyegerakan kehancuran alam raya, dan menunda siksa bagi pendurhaka untuk memberinya kesempatan bertobat; sungguh Allah maha pengampun kepada siapa pun yang bertobat. 42. Meski melihat banyak bukti kekuasaan Allah di alam raya, kaum kafir tetap ingkar. Mereka menuntut agar Allah mengutus seorang rasul kepada mereka. Dan sebelum nabi Muhammad diutus, mereka bersumpah dengan nama Allah dengan sungguh-sungguh bahwa jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat yang lain, misalnya umat yahudi atau nasrani. Tetapi, ketika pemberi peringatan datang kepada mereka, mereka justru mengingkari sumpah mereka sendiri. Kedatang-an rasulullah tidak menambah apa-apa kepada mereka, bahkan semakin jauh saja mereka dari kebenaran."
  }
]