[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir Quraisy bersumpah dengan Nama Allah dengan sumpah yang paling kuat, bahwa jika mereka didatangi oleh seorang Rasul dari sisi Allah yang menakut-nakuti mereka dengan azab Allah, niscaya mereka akan menjadi orang-orang yang paling kuat istiqamahnya dan paling teguh mengikuti kebenaran daripada orang-orang Yahudi, Nasrani dan lainnya, tetapi ketika Muhammad datang kepada mereka, justru hal itu tidak menambah apapun kecuali hanya semakin menambah mereka jauh dari kebenaran dan semakin membuat mereka berlari darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Orang-orang kafir yang mendustakan itu mengucapkan sumpah yang ditegaskan dan ditekankan, “Seandainya seorang rasul datang kepada mereka yang memperingatkan mereka dari azab-Nya, niscaya mereka lebih kuat istikamahnya dan lebih kokoh dalam mengikuti kebenaran dibandingkan orang-orang Yahudi, Nasrani dan lainnya.” Namun ketika Muhammad -ṣallallāhu 'alaihi wa sallam- datang kepada mereka sebagai utusan dari Tuhannya yang memperingatkan mereka dari azab Allah, ternyata kedatangannya hanya membuat mereka semakin jauh dari kebenaran dan semakin berkait erat dengan kebatilan. Mereka tidak memenuhi sumpah iman yang mereka ucapkan dengan penegasan bahwa mereka akan lebih baik jalannya dari orang-orang sebelum mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Mereka bersumpah dengan tegas atas nama Allah, jika datang kepada mereka pemberi peringatan yang dapat menunjukkan hidayah bagi mereka, niscaya mereka akan lebih cepat dalam menyambut hidayah daripada orang-orang yahudi dan Nasrani. Namun ketika pemberi peringatan telah datang kepada mereka, mereka semakin berpaling dan jauh dari hidayah. Padahal seharunya mereka bersyukur kepada Allah yang telah mendarangkan pemberi peringatan; akan tetapi mereka sangat menjauhi seruannya, menentang dan membuat tipu daya terhadap Rasulullah dan para sahabatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَأَقْسَمُوا۟ بِاللهِ جَهْدَ أَيْمٰنِهِمْ لَئِن جَآءَهُمْ نَذِيرٌ لَّيَكُونُنَّ أَهْدَىٰ مِنْ إِحْدَى الْأُمَمِ ۖ (Dan mereka bersumpah dengan nama Allah dengan sekuat-kuat sumpah; sesungguhnya jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat) Yang dimaksud adalah kaum Quraisy bersumpah dengan sumpah ini sebelum diutusnya Rasulullah Muhammad ketika mereka mendengar bahwa Ahli Kitab mendustakan rasul-rasul mereka. Sedangkan orang-orang Arab berharap akan diutus seorang Rasul dari kaum mereka sebagaimana rasul-rasul yang ada di Bani Israil. فَلَمَّا جَآءَهُمْ نَذِيرٌ(Tatkala datang kepada mereka pemberi peringatan) Yakni setelah apa yang mereka harapkan itu terwujud, yaitu Muhammad Rasulullah yang diutus dari kaum mereka, yang merupakan pemberi peringatan dan rasul yang paling mulia. مَّا زَادَهُمْ إِلَّا نُفُورًا (maka kedatangannya itu tidak menambah kepada mereka kecuali jauhnya mereka dari (kebenaran)) Yakni kedatangannya tidak menambah mereka kecuali keengganan untuk menerima risalahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Orang-orang musyrik dari suku Quraisy telah berkeyakinan kuat sebelum pengutusan Muhammad SAW yaitu jika datang kepada mereka seorang rasul pemberi peringatan maka mereka akan lebih diberi petunjuk daripada kaum Yahudi atau Nasrani. Ketika mereka melihat pendustaan mereka satu sama lain, setiap kelompok berkata: “Kelompok lain tidak berhak atas apapun”. Ketika datang kepada mereka apa yang mereka harapkan yaitu Rasulallah SAW, semulia-mulia pemberi peringatan dan utusan, maka tidak bertambah keinginan mereka untuk mendatanginya kecuali menjauh dari kebenaran, hidayah dan keimanan”. Ayat ini diturunkan setelah kaum Quraisy berkata: “Jika Allah mengutus seorang nabi dari golongan kami, maka tidak ada umat yang lebih taat kepada penciptanya, lebih mendengar nabinya serta lebih berpegang teguh kepada kitabnya daripada kami” Kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah atas (nama) Allah dengan sungguh-sungguh} bersungguh-sungguh dengan sumpah mereka yang paling kuat {bahwa jika datang kepada mereka seorang pemberi peringatan} Rasul dari sisi Allah yang memberi peringatan kepada mereka tentang azabNya Pniscaya mereka akan lebih banyak mendapat petunjuk daripada salah satu umat (lain). Dan ketika datang kepada mereka pemberi peringatan} nabi Muhammad SAW {maka tidak menambah apapun kepada mereka, kecuali menjauh} menjauh dan lari dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Maksudnya, mereka yang mendustakanmu, wahai Rasulullah, bersumpah dengan satu sumpah yang sungguh-sungguh mereka lakukan dan sumpah yang sangat berat, “sesungguhnya jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat.” Maksudnya, lebih lurus di atas petunjuk daripada orang-orang Yahudi dan orang-orang Nasrani, Ahli kitab. Akan tetapi mereka tidak memenuhi sumpah-sumpah dan janji-janji tersebut. “Tatkala datang kepada mereka pemberi peringatan,” mereka tidak mau menerima petunjuk dan tidak mau menjadi manusia yang paling lurus di atas petunjuk, bahkan mereka tetap di dalam kesesatan mereka yang dahulu, bahkan, “tidak menambah kepada mereka,” yang demikian itu, “kecuali makin jauh,” makin bertambah sesat, congkak, dan keras kepala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 42: Orang-orang kafir quraisy terbagi dari sisi kekeliruan mereka, sebagian mereka berkata : Jika telah datang Rasul dari sisi Allah dan menjelaskan kepada kami keimanan kepada Allah, dan mengajak kami kepada tauhid, dan menakuti kami dari adzab Allah dan kemarahan-Nya atas orang-orang yang kafir; Maka kami akan menjadikan kebanyakan hidayah dan mengikuti kebanyakan dari kebenaran dari yahudi dan nasrani dan selain mereka. Maka ketika telah datang Muhammad ﷺ dan dia adalah sebaik-baik Rasul dan suri tauladan, mereka mengingkari dan mendustakan serta tidak beriman kepadanya; Bahkan bertambah jauh dan lari dari kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kaum musyrik Mekah. Yakni lebih mendapat petunjuk daripada orang-orang Yahudi, Nasrani dan selainnya. Namun kenyataannya, mereka tidak memenuhi sumpah dan janji ini. Yakni Nabi Muhammad shallallahu 'alaihi wa sallam, mereka tidak memperoleh petunjuk, bahkan tidak lebih mendapat petunjuk dari umat-umat yang ada, mereka tetap saja sesat seperti sebelumnya. Yakni hanya menambah kesesatan saja, kezaliman dan pembangkangan. Sumpah mereka itu bukanlah karena niat yang baik dan mencari yang hak, karena jika seperti itu tentu mereka akan diberi taufik kepadanya, akan tetapi muncul dari sikap sombong terhadap kebenaran dan menghias ucapan mereka dengan tujuan makar dan tipu daya, agar mereka disebut sebagai orang yang berada di atas kebenaran lagi ingin mencarinya, sehingga orang yang tertipu, akan tertipu kepadanya dan orang-orang yang ikut-ikutan berjalan di belakang mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 42",
    "description": "Meski melihat banyak bukti kekuasaan Allah di alam raya, kaum kafir tetap ingkar. Mereka menuntut agar Allah mengutus seorang rasul kepada mereka. Dan sebelum nabi Muhammad diutus, mereka bersumpah dengan nama Allah dengan sungguh-sungguh bahwa jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat yang lain, misalnya umat yahudi atau nasrani. Tetapi, ketika pemberi peringatan datang kepada mereka, mereka justru mengingkari sumpah mereka sendiri. Kedatang-an rasulullah tidak menambah apa-apa kepada mereka, bahkan semakin jauh saja mereka dari kebenaran. 43. Menjauhnya mereka dari kebenaran adalah karena kesombongan me-reka di muka bumi dan karena rencana mereka yang jahat, yaitu menipu lawan bicaranya dengan sumpah palsu. Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri, kalau tidak menimpa di dunia pasti akan menimpa di akhirat. Mereka hanyalah menunggu berlakunya ketentuan kepada orang-orang yang terdahulu, yakni turunnya azab kepada orang-orang yang mendustakan rasul. Maka kamu tidak akan mendapatkan perubahan bagi ketetapan-ketetapan Allah yang berlaku bagi umat manusia yaitu mengazab orang-orang yang durhaka dan memberi pahala kepada yang taat, dan tidak pula akan menemui penyimpangan bagi ketentuan Allah itu, yakni apa yang ditetapkan Allah bagi seseorang, maka tidak akan beralih kepada yang lain."
  }
]