[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sumpah mereka bukan dengan tujuan baik dan bukan demi mencari kebenaran, akan tetapi hanya kesombongan di muka bumi atas makhluk lainnya, maksud mereka dengannya adalah makar busuk dan tipuan batil, tetapi makar busuk hanya akan menimpa orang yang melakukannya. Tidak ada yang dinanti-nantikan oleh orang-orang yang sombong pembuat makar tersebut kecuali hanyalah siksa yang telah menimpa orang-orang seperti mereka yang telah mendahului mereka. Kamu tidak akan mendapati perubahan dan pergantian pada jalan Allah, tidak ada seorang pun yang mampu mengganti atau merubah azab dari dirinya atau orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sumpah mereka dengan nama Allah atas apa yang mereka janjikan bukan berasal dari niat yang baik dan tujuan yang benar, akan tetapi dalam rangka menyombongkan diri di bumi dan menipu manusia, padahal makar jahat tidak menimpa kecuali pada pelakunya sendiri. Dan orang-orang membuat makar lagi menyombongkan diri itu tidak menunggu kecuali Sunnah Allah yang tetap berlaku, yaitu membinasakan mereka sebagaimana Allah telah membinasakan orang-orang seperti mereka sebelum mereka. Kamu tidak akan menemukan pada Sunnah Allah -dalam membinasakan orang-orang yang menyombongkan diri- perubahan apa pun, sehingga azab tidak turun atas mereka, tidak pula pengalihan sasaran sehingga jatuh menimpa selain mereka, karena ia adalah Sunnah Ilahiyah yang baku tidak berubah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Mereka melakukan itu karena kesombongan dan tipu daya mereka, lalu apa yang mereka tunggu setelah itu? Tidak lain adalah balasan atas kekafiran dan pendustaan mereka, serta ketetapan Allah seperti yang telah berlaku pada kaum sebelum mereka yang mendustakan. Mereka akan mendapat azab di dunia, serta azab neraka yang mereka tunggu. Itulah sunnatullah yang tidak akan berubah, yang tidak akan menimpa kecuali kepada orang-orang yang layak mendapatkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. اسْتِكْبَارًا فِى الْأَرْضِ (karena kesombongan (mereka) di muka bumi) Yakni mereka tidak menjauh dari Muhammad dan mendustakan risalahnya karena menganggapnya berdusta, namun mereka melakukan itu keangkuhan mereka yang menjadikan mereka enggan untuk menjadi pengikutnya serta akibat kebengisan dan kebiasaan mereka melakukan kerusakan. وَمَكْرَ السَّيِّئِ ۚ (dan karena rencana (mereka) yang jahat) Yakni juga karena rencana mereka yang jahat. Makna (المكر) yakni tipu daya dan perbuatan yang buruk. وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِهِۦ ۚ (Rencana yang jahat itu tidak akan menimpa selain orang yang merencanakannya sendiri) Yakni akibat buruk akan menimpa orang yang berbuat jahat sebelum kejahatannya menimpa orang yang akan menjadi sasaran kejahatannya. فَهَلْ يَنظُرُونَ إِلَّا سُنَّتَ الْأَوَّلِينَ ۚ( Tiadalah yang mereka nanti-nantikan melainkan (berlakunya) sunnah (Allah yang telah berlaku) kepada orang-orang yang terdahulu) Yakni tidaklah orang-orang yang angkuh dan pembuat tipu daya itu menunggu selain ketetapan Allah yang telah berlaku pada orang-orang terdahulu, yaitu Allah akan menimpakan kepada mereka azab sebagaimana telah menimpakan azab kepada umat-umat terdahulu saat mendustakan para Nabi. فَلَن تَجِدَ لِسُنَّتِ اللهِ تَبْدِيلًا ۖ( Maka sekali-kali kamu tidak akan mendapat penggantian bagi sunnah Allah) Yakni tidak ada yang mampu mengganti ketetapan Allah yang telah berlaku bagi umat-umat terdahulu yang berupa menimpakan azab kepada mereka, dengan mengganti azab itu dengan yang lainnya. وَلَن تَجِدَ لِسُنَّتِ اللهِ تَحْوِيلًا(dan sekali-kali tidak (pula) akan menemui penyimpangan bagi sunnah Allah itu) Dengan mengalihkan azab yang telah Allah tetapkan, yaitu dengan menghalau azab itu dari mereka dan mengalihkannya kepada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Mereka tidak mengimani risalah nabi Muhammad SAW dengan keras dan angkuh serta terus menerus berada dalam kerusakan. Mereka juga melakukan tipu muslihat buruk terhadap rasulallah dan orang-orang mukmin (Al-Makru adalah muslihat, tipuan dan perbuatan buruk). Tipu muslihat buruk tersebut tidak akan meliputi dan menimpa seseorang kecuali orang-orang jahat yang merencanakannya. Tidak ada yang orang-orang musyrik itu tunggu kecuali sunnatullah dan cara Allah menghancurkan umat-umat terdahulu dengan menurunkan azab kepada mereka. Ketentuan Allah dalam memberikan azab, tidak akan diganti dan tidak akan diubah untuk orang yang tidak berhak menerimanya. Sunnatullah adalah kelaziman Allah dalam menghukum para pendusta rasul dan pelaku maksiat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{karena kesombongan di bumi dan tipu daya yang jahat. Akibat tipu daya jahat itu tidak akan menimpa} tidak akan meliputi {melainkan kepada orang yang merencanakannya. Mereka tidak menunggu} menunggu {melainkan ketetapan orang-orang terdahulu} ketetapan Allah bagi orang-orang terdahulu dengan mengazab mereka atas pendustaan mereka {Maka kamu tidak akan mendapati perubahan atas ketetapan Allah dan tidak akan mendapati penyimpangan bagi ketetapan Allah itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Sumpah mereka tersebut bukan untuk tujuan baik dan bukan untuk mencari kebenaran. Kalau tidak, tentu mereka diberi taufik kepadanya. Akan tetapi sumpah itu berasal dari sikap sombong mereka di muka bumi ini terhadap manusia dan terhadap kebenaran, serta kecongkakan dalam perkataan yang mereka ucapkan itu. Maksud mereka sebenarnya adalah makar dan tipu daya. Dan mereka menyatakan bahwa mereka adalah ahlul haq (orang-orang yang benar) yang sangat giat dalam mencari kebenaran, sehingga banyak orang yang terpedaya dengan mereka dan diikuti oleh orang-orang yang taklid (ikut-ikutan). “Rencana jahat itu tidak akan menimpa,” yakni rencana yang tujuannya adalah tujuan jahat, akibat dan targetnya adalah jahat lagi batil, “selain orang yang merencanakannya sendiri.” Rencana jahat mereka hanya akan menimpa mereka. Allah telah menyingkap kedua hamba-hambaNya dalam perkataan-perkataan mereka tersebut dan dalam sumpah-sumpah itu, bahwa mereka dusta dalam semua itu dan berbohong besar, sehingga kehinaan mereka tampak, kebusukan mereka terungkap, niat jahat mereka jelas, dan akibatnya, rencana jahat mereka menimpa diri mereka sendiri dan Allah mengembalikan tipu muslihat mereka ke dalam dada mereka. Maka tidak ada yang tersisa bagi mereka selain menunggu azab yang akan menimpa, yaitu azab yang sudah menjadi sunnatullah terhadap orang-orang terdahulu, yang tidak akan diganti atau dirubah. Dan sesungguhnya setiap orang yang berjalan di dalam lembah kezhaliman, sikap menentang, dan congkak terhadap sesame menusia, bencananya akan menimpa dirinya sendiri dan nikmatNYa akan diangkat darinya. Hendaknya mereka memperhatikan apa yang ditimpakan terhadap orang-orang yang zhalim itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 43: Allah menjelaskan bahwasanya pembagian mereka tidaklah menjadikan mereka baik, hal itu hanyasanya menjadikan mereka sombong atas makhluk, dan dengan keinginan mereka berbuat makar yang buruk, yang tidaklah mengerjakan kecuali dari orang-orang yang berbuat makar, maka apa lagi yang menunggu orang-orang yang berbuat makar kecuali hanyalah adzab yang Allah turunkan dengan yang semisal dengan makar mereka dan Allah berikan musibah dengan apa yang semisal dengan apa yang telah mereka lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya adalah untuk kejahatan dan ujung-ujungnya adalah kejahatan. Yakni makar jahat mereka kembalinya menimpa mereka, dan Allah telah menjelaskan kepada hamba-hamba-Nya ucapan dan janji mereka itu, sehingga diketahui bahwa mereka dusta dalam sumpah dan ucapannya. Sehingga jelaslah kehinaan mereka, tampak cacat mereka, dan jelas maksud mereka yang buruk, makar mereka iitu kembalinya kepada mereka, dan Allah mengembalikan tipu daya mereka ke dalam diri mereka. Sehingga tidak ada yang tetinggal selain menunggu kapan azab menimpa mereka, di mana yang demikian merupakan sunnatullah terhadap orang-orang yang terdahulu yang tidak berubah dan berganti, yaitu siapa saja yang berjalan di atas kezaliman, sifat pembangkangan, dan sombong kepada hamba-hamba-Nya bisa saja Allah menurunkan siksa dan mencabut nikmat-Nya. Oleh karena itu, hendaknya mereka berwaspada jika melakukan hal yang dengan sebelum mereka, Dia akan menimpakan azab kepada mereka. Yang dimaksud dengan sunnah orang-orang yang terdahulu ialah turunnya siksa kepada orang-orang yang mendustakan rasul. Sunnatul awwaliin dalam ayat tersebut adalah sunnah Allah dalam bertindak kepada makhluk-Nya, yaitu menimpakan azab karena mendustakan para rasul-Nya. Yakni tidak akan diganti dengan azab selainnya dan tidak pula berpindah kepada yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 43",
    "description": "Menjauhnya mereka dari kebenaran adalah karena kesombongan me-reka di muka bumi dan karena rencana mereka yang jahat, yaitu menipu lawan bicaranya dengan sumpah palsu. Rencana yang jahat itu hanya akan menimpa orang yang merencanakannya sendiri, kalau tidak menimpa di dunia pasti akan menimpa di akhirat. Mereka hanyalah menunggu berlakunya ketentuan kepada orang-orang yang terdahulu, yakni turunnya azab kepada orang-orang yang mendustakan rasul. Maka kamu tidak akan mendapatkan perubahan bagi ketetapan-ketetapan Allah yang berlaku bagi umat manusia yaitu mengazab orang-orang yang durhaka dan memberi pahala kepada yang taat, dan tidak pula akan menemui penyimpangan bagi ketentuan Allah itu, yakni apa yang ditetapkan Allah bagi seseorang, maka tidak akan beralih kepada yang lain. 44. Allah telah menegaskan bahwa ketetapan-ketetapan-Nya (sunatullah) pasti berlaku bagi seluruh umat manusia. Pada ayat ini Allah menunjukkan bukti-bukti berlakunya sunatullah bagi umat-umat terdahulu. Dan tidakkah mereka, yakni kaum musyrik mekah, bepergian di bumi lalu melihat bagaimana kesudahan yang buruk bagi orang-orang sebelum mereka yang mendustakan rasul, seperti kaum 'ad, samud, dan lainnya, padahal orang-orang itu lebih besar kekuatannya dari mereka, baik fisik maupun harta' andaikata kaum musyrik mekah merasa lebih kuat daripada umat-umat terdahulu itu, kekuatan tersebut tidak akan ada artinya di hadapan Allah, karena Allah mahaperkasa, dan tidak ada sesuatu pun yang dapat melemahkan Allah baik di langit maupun di bumi. Sungguh, dia maha mengetahui perbuatan dan perkataan serta rencana jahat mereka, mahakuasa mewujudkan apa yang dia kehendaki."
  }
]