[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir Makkah itu tidak berjalan di muka bumi, lalu mereka melihat bagaimana kesudahan orang-orang sebelum mereka seperti Ad, Tsamud dan semisal mereka, dan siksaan yang menimpa mereka semua, dan negeri mereke yang dihancurkan karena kedustaan mereka kepada rosul, dan orang-orang kafir itu lebih kuat dan lebih tangguh daripada orang-orang kafir Makkah ? tidak ada sesuatu pun di langit dan di bumi yang bisa melemahkan Allah atau bisa luput dariNya. Sesungguhnya Allah Maha Mengetahui perbuatan mereka, juga Mahakuasa untuk membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Apakah orang-orang yang mendustakan itu tidak berjalan di muka bumi, lalu memperhatikan bagaimana akhir dari orang-orang yang mendustakan dari umat-umat sebelum mereka. Bukankah akhir mereka adalah akhir yang buruk, karena Allah membinasakan mereka, padahal orang-orang terdahulu itu lebih kuat daripada mereka. Tidak ada sesuatu di langit dan di bumi yang luput dari Allah, karena sesungguhnya Allah Maha mengetahui amal perbuatan orang-orang yang mendustakan itu, tidak ada sesuatu pun dari amal perbuatan mereka yang terlepas dan terlewatkan dari ilmu Allah, Dia Mahakuasa untuk membinasakan mereka ketika Dia berkehendak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Apakah mereka tidak pernah melakukan perjalanan di bumi sehingga tidak dapat melihat kesudahan umat-umat terdahulu dan peninggalan mereka yang telah hancur? Bagaimana peradaban mereka yang sangat maju, kemudian hancur dan sirna? Sungguh kekuatan mereka tidak dapat menyelamatkan mereka, dan tidak ada yang dapat menghalangi kuasa Allah. Dia Maha Mengetahui segalanya, tidak ada yang tersembunyi dari-Nya, dan Dia Maha Kuasa memberi azab bagi orang yang menyelisihi dan menentang-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. أَوَلَمْ يَسِيرُوا۟ فِى الْأَرْضِ فَيَنظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الَّذِينَ مِن قَبْلِهِمْ (Dan apakah mereka tidak berjalan di muka bumi, lalu melihat bagaimana kesudahan orang-orang yang sebelum mereka) Sebagaimana azab yang telah Kami timpakan kepada kaum ‘Aad, Tsamud, Madyan, dan yang lainnya ketika mereka mendustakan para rasul. Dan itu merupakan ketetapan Allah yang berlaku bagi orang-orang yang mendustakan, suatu ketetapan yang tidak mungkin diganti atau dialihkan. Dan bekas azab yang Allah turunkan kepada mereka masih ada pada rumah-rumah mereka; dan kaummu telah melewatinya ketika mereka melakukan perjalanan wahai Muhammad, maka tidakkah mereka memikirkan bagaimana kebinasaan orang-orang zalim, dan tidakkah mereka takut akan seperti kaum-kaum tersebut. وَكَانُوٓا۟ أَشَدَّ مِنْهُمْ قُوَّةً ۚ( sedangkan orang-orang itu adalah lebih besar kekuatannya dari mereka) Yakni memiliki umur yang lebih panjang, harta yang lebih banyak, dan tubuh yang lebih kuat daripada yang dimiliki oleh penduduk Makkah. وَمَا كَانَ اللهُ لِيُعْجِزَهُۥ مِن شَىْءٍ فِى السَّمٰوٰتِ وَلَا فِى الْأَرْضِ ۚ( Dan tiada sesuatupun yang dapat melemahkan Allah baik di langit maupun di bumi) Yakni tidak ada yang dapat menghalangi Allah atau meloloskan diri dari-Nya jika Dia hendak menimpanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Apakah orang-orang musyrik itu tidak bepergian di bumi sehingga mereka bisa melihat bagaimana takdir orang-orang sebelum mereka seperti kaum ‘Aad, Tsamud, penduduk Madyan dan lainnya yang diazab karena mereka mendustakan para rasul. Kenyataannya, mereka memiliki badan lebih kuat, umur lebih panjang dan harta lebih banyak daripada orang-orang Quraisy. Dan tidak ada yang dapat mengungguli dan mengalahkan Allah di langit dan di bumi. Sesungguhnya Dia Maha Mengetahui segala sesuatu sehingga tidak ada yang luput dariNya dan Maha Kuasa atas segala sesuatu sehingga tidak ada satupun perkara yang sulit bagiNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak berjalan di bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka. Dan orang-orang itu lebih dahsyat kekuatannya daripada mereka. Tidak ada sesuatu pun yang dapat melemahkan Allah{ untuk melepaskan diri dan melewatiNya {baik di langit maupun di bumi. Sesungguhnya Dia Maha Mengetahui lagi Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Allah menghimbau untuk melakukan perjalanan di muka bumi dengan jiwa dan raga untuk mengambil pelajaran bukan sekedar melihat yang membawa kepada sikap lalai (bersantai-santai), melainkan supaya mereka memperhatikan kepada akhir kesudahan orang-orang sebelum mereka, yaitu mereka yang mendustakan para rasul, yang jumlah, harta, dan anak-anaknya lebih banyak daripada mereka dan lebih kuat, dan telah meramaikan bumi lebih dari apa yang dilakukan oleh mereka. Namun, tatkala mereka memiliki itu tidak berguna, harta vdan anak-anak mereka sama sekali tidak bermanfaat. Kuasa dan masyi’ah (kehendak) Allah berlaku terhadap mereka. “Dan tiada sesuatu pun yang dapat melemahkan Allah, baik di langit maupun di bumi,” karena kesempurnaan ilmu dan KuasaNya. “Sesungguhnya Allah Maha Mengetahui lagi Mahakuasa.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 44: Allah menjelaskan apa yang menunjukkan atas sunnah-Nya yang tidak akan berubah dan tergantikan dengan berkata : Tidakkah mereka kaummu wahai Muhammad ﷺ berjalan di muka bumi dengan akal dan hati mereka dan kemudian melihat dan bertafakkur atas kejadian pada umat-umat yang sebelum mereka ? Bagaimana keadaan akhir mereka ketika mereka mendustakan utusan Allah ?!, Sungguh mereka (umatmu) adalah orang-orang Mekkah yang kuat, dalam harta, anak. Mereka mampu untuk menegakkan bangunan-bangunan di bumi ?! Tidaklah mendahului Allah apa yang di langit dan di bumi, sesungguhnya Dia maha tahu atas hamba-Nya dan keadaan hamba-Nya, akhir kehidupan mereka, ucapan-ucapan mereka, amalan-amalan mereka dan Dial ah yang maha kuasa untuk membinasakan mereka siapa yang kufur kepada-Nya dan mengingkari Rasul-Nya, Dialah Allah yang maha kuasa atas segala sesuatunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Alllah Subhaanahu wa Ta'aala mendorong untuk mengadakan perjalanan di bumi dengan hati dan badannya untuk mengambil pelajaran, tidak sekedar melihat dengan lalai, dan agar mereka melihat akibat orang-orang sebelum mereka yang mendustakan para rasul, di mana mereka lebih banyak harta dan anak-anaknya serta lebih memiliki kekuatan. Mereka memakmurkan bumi melebih yang lain, namun ketika azab datang, kekuatan, harta dan anak-anak tidaklah bermanfaat apa-apa agar dapat menghindari azab itu, dan berlaku kepada mereka kekuasaan Allah dan kehendak-Nya. Tetapi Allah berkuasa membinasakan mereka karena mendustakan rasul-Nya. Yakni karena sempurnanya ilmu dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 44",
    "description": "Allah telah menegaskan bahwa ketetapan-ketetapan-Nya (sunatullah) pasti berlaku bagi seluruh umat manusia. Pada ayat ini Allah menunjukkan bukti-bukti berlakunya sunatullah bagi umat-umat terdahulu. Dan tidakkah mereka, yakni kaum musyrik mekah, bepergian di bumi lalu melihat bagaimana kesudahan yang buruk bagi orang-orang sebelum mereka yang mendustakan rasul, seperti kaum 'ad, samud, dan lainnya, padahal orang-orang itu lebih besar kekuatannya dari mereka, baik fisik maupun harta' andaikata kaum musyrik mekah merasa lebih kuat daripada umat-umat terdahulu itu, kekuatan tersebut tidak akan ada artinya di hadapan Allah, karena Allah mahaperkasa, dan tidak ada sesuatu pun yang dapat melemahkan Allah baik di langit maupun di bumi. Sungguh, dia maha mengetahui perbuatan dan perkataan serta rencana jahat mereka, mahakuasa mewujudkan apa yang dia kehendaki. 45. Orang-orang kafir sering menantang agar Allah menyegerakan turunnya azab kepada mereka. Melalui ayat ini Allah menegaskan, 'dan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi dia menangguhkannya bagi orang-orang yang melanggar sampai waktu yang sudah ditentukan. Nanti, apabila ajal, yakni batas waktu yang ditentukan bagi mereka telah tiba, maka Allah maha melihat keadaan hamba-hamba-Nya, baik yang taat maupun yang bermaksiat, dan akan memberi mereka balasan sesuai perbuatan masing-masing. []."
  }
]