[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya Allah Menghukum manusia karena dosa-dosa dan kemaksiatan-kemaksiatan yang mereka lakukan, niscaya Dia tidak membiarkan seekor hewan hidup pun di muka bumi, akan tetapi Allah menangguhkan mereka dan menunda hukuman mereka sampai batas waktu yang sudah Dia tetapkan. Bila saat hukuman atas mereka sudah tiba, maka sesungguhnya Allah Maha Melihat hamba-hambaNya, tidak ada seorang pun dari mereka yang samar bagiNya, tidak ada sedikit pun ilmu tentang mereka yang tidak diketahui olehNya, dan Dia akan membalas mereka sesuai dengan apa yang mereka lakukan, yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Seandainya Allah menyegerakan azab atas manusia karena apa yang mereka lakukan berupa kemaksiatan-kemaksiatan dan atas apa yang mereka perbuat berupa dosa-dosa, niscaya Allah membinasakan seluruh penduduk bumi seketika, termasuk apa saja yang mereka miliki berupa harta kekayaan dan hewan ternak, akan tetapi Allah menunda mereka hingga masa yang Dia tentukan dalam ilmu-Nya, yaitu hari Kiamat. Jika hari Kiamat datang, maka sesungguhnya Allah Maha melihat hamba-hamba-Nya, tidak ada sesuatu pun yang tersembunyi bagi-Nya, lalu Dia membalas mereka atas itu, bila baik maka dibalas baik, bila buruk maka buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Bagian dari kelembutan dan kasih sayang Allah kepada hamba-hamba-Nya, Dia tidak segera menurunkan siksaan. Akan tetapi Allah memberi mereka kesempatan, agar mereka dapat bertaubat dan kembali ke jalan yang benar. Seandainya siksaan itu disegerakan, dan setiap orang yang berbuat dosa segera tertimpa azab; niscaya tidak akan tersisa lagi makhluk di muka bumi. Akan tetapi Allah memberi kesempatan dan mengakhirkan siksaan sampai pada waktu yang telah Dia tetapkan; baik itu dengan memberi mereka azab di dunia dan di akhirat, atau azab mereka dikumpulkan di akhirat agar azab itu semakin berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَلَوْ يُؤَاخِذُ اللهُ النَّاسَ بِمَا كَسَبُوا۟ (Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya) Berupa dosa-dosa dan kesalahan yang mereka telah perbuat. ما ترك على ظهرها (niscaya Dia tidak akan meninggalkan di atas permukaan bumi) Yakni makhluk hidup yang ada di muka bumi. مِن دَآبَّةٍ (suatu mahluk yang melatapun) Yakni dari suatu hewan melata yang merayap, apapun itu. Adapun kebinasaan Bani Adam adalah karena dosa-dosa mereka, sedangkan makhluk lainnya adalah karena akibat buruk dari kemaksiatan Bani Adam. Pendapat lain mengatakan bahwa yang dimaksud dengan makhluk melata dalam ayat ini adalah manusia saja tanpa makhluk lainnya. وَلٰكِن يُؤَخِّرُهُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۖ( akan tetapi Allah menangguhkan (penyiksaan) mereka, sampai waktu yang tertentu) Kani sampai hari kiamat. فَإِذَا جَآءَ أَجَلُهُمْ فَإِنَّ اللهَ كَانَ بِعِبَادِهِۦ بَصِيرًۢا(maka apabila datang ajal mereka, maka sesungguhnya Allah adalah Maha Melihat (keadaan) hamba-hamba-Nya) Yakni Allah Maha Melihat siapa yang berhak mendapat pahala dan siapa yang berhak mendapat siksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Kalaupun Allah mempercepat hukuman terhadap manusia karena dosa-dosa mereka niscaya tidak ada satupun sesuatu yang melata di atas permukaan bumi. Maksudnya adalah manusia, karena mereka adalah yang diberi tugas. Akan tetapi, Allah menangguhkan hukuman mereka sampai waktu yang ditentukan di sisiNya yaitu hari kiamat. Sesungguhnya Allah Maha Mengetahui keadaan hamba-hambaNya lalu membalas mereka atas perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menghukum} menghukum {manusia karena apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu makhluk bergerak yang bernyawa pun di permukaan bumi} di permukaan bumi {Akan tetapi, Dia menangguhkan mereka} memberi mereka penangguhan waktu {sampai waktu yang sudah ditentukan. Maka, apabila datang ajal mereka, sesungguhnya Allah Maha Melihat hamba-hambaNya}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Kemudian Allah menyebutkan kesempurnaan sifat santunNya dan betapa Dia menangguhkan para pelaku maksiat dan dosa, seraya berfirman, “Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya,” yaitu berupa dosa-dosa, “niscaya Dia tidak akan meninggalkan di atas permukaan bumi suatu makhluk yang melata pun,” yakni, niscaya siksaan itu merata hingga menimpa hewan-hewan yang tidak mukallaf. “Akan tetapi,” mereka ditangguhkan oleh Allah dan Dia tidak mengabaikan mereka. “Allah menangguhkan mereka sampai waktu yang tertentu; maka apabila datang ajal mereka, maka sesungguhnya Allah Maha Melihat hamba-hambaNYa.” Lalu Dia akan memberikan balasan terhadap mereka sesuai dengan perbuatan baik atau buruk yang telah Dia ketahui dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 45: Allah menutup surat ini dengan penjelasan kasih sayang-Nya dan kelembutan-Nya kepada hamba-Nya. Allah mengabarkan bahwa sekiranya Allah mengadzab manusia karena sebab dosa mereka dan maksiat, niscaya Dia tidak akan menyisakan sesuatupun yang melata di bumi, akan tetapi Allah mengakhirkan adzabnya sampai waktu yang diketahui di sisi-Nya dengan hikmah yang besar; Maka jika telah sampa ajal makhluk, Allah maha melihat; Allah ampunkan apa yang menurut Allah dapat diampunkan, dan Allah siksa apa yang pantas untuk diberikan siksaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sempurnanya santun(kesabaran)-Nya, benar-benar memberi tangguh, dan pemberian tangguh kepada para pelaku dosa dan maksiat. Yakni hukuman itu mengena semuanya sampai hewan yang tidak terkena beban.. Yakni hari Kiamat, Dia menangguhkan mereka namun tidak membiarkan. Maka Dia akan membalas mereka sesuai ilmu-Nya dengan memberi pahala kepada orang-orang mukmin dan memberi hukuman kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 45",
    "description": "Orang-orang kafir sering menantang agar Allah menyegerakan turunnya azab kepada mereka. Melalui ayat ini Allah menegaskan, 'dan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi dia menangguhkannya bagi orang-orang yang melanggar sampai waktu yang sudah ditentukan. Nanti, apabila ajal, yakni batas waktu yang ditentukan bagi mereka telah tiba, maka Allah maha melihat keadaan hamba-hamba-Nya, baik yang taat maupun yang bermaksiat, dan akan memberi mereka balasan sesuai perbuatan masing-masing. []1. Allah memulai surah ini dengan huruf y' s'n."
  }
]