[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Wahai manusia, sesungguhnya janji kebangkitan, pahala dan hukuman dari Allah adalah haq yang pasti terjadi, maka janganlah kalian tertipu oleh kehidupan dunia dengan segala hawa nafsunya dan tuntutannya. Jangan sampai setan menipu kalian dari Allah, sesungguhnya setan adalah musuh bagi anak cucu Adam, maka jadikanlah dia sebagai musuh dan jangan menaatinya, karena dia hanya mengajak orang-orang yang mengikutinya kepada kesesatan, sehingga mereka menjadi penghuni neraka yang menyala-nyala"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Wahai manusia! Apa yang Allah janjikan, yaitu kebangkitan dan pembalasan pada hari Kiamat adalah benar, tidak ada keraguan padanya, maka jangan sekali-kali kalian tertipu oleh kesenangan kehidupan dunia dan syahwatnya sehingga kalian tidak mempersiapkan diri menghadapi hari itu dengan amal saleh. Jangan sekali-kali kalian terpedaya oleh setan yang menghiasi kebatilan dan mengajak kalian untuk cenderung pada kehidupan dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah menyeru manusia untuk mengingatkan janji-Nya yang pasti akan terjadi; maka berimanlah kepadanya dan bersiaplah menghadapinya, dan janganlah kalian tertipu oleh perhiasan dan keindahan dunia, dan jangan pula tertipu oleh setan dengan janji dustanya dan godaannya yang menipu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. يٰٓأَيُّهَا النَّاسُ إِنَّ وَعْدَ اللهِ حَقٌّ ۖ (Hai manusia, sesungguhnya janji Allah adalah benar) Yakni janji Allah tentang hari kebangkitan, pengumpulan, perhitungan, pembalasan, surga, dan neraka. فَلَا تَغُرَّنَّكُمُ الْحَيَوٰةُ الدُّنْيَا ۖ( maka sekali-kali janganlah kehidupan dunia memperdayakan kamu) Janganlah perhiasan dan kenikmatan dunia memperdayamu dari beramal untuk kehidupan akhirat. وَلَا يَغُرَّنَّكُم بِاللهِ الْغَرُورُ(dan sekali-kali janganlah syaitan yang pandai menipu) Yakni janganlah setan menipu kalian dengan Allah, dengan mengatakan “Allah telah memaafkan dan mengampuni kalian karena keutamaan, kedudukan, dan kekayaan kalian, atau karena keluasan rahmat-Nya bagi kalian” sehingga kalian kembali melakukan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Wahai manusia, sesungguhnya janji Allah tentang pembangkitan dan pembalasan itu benar, tidak berubah dan pasti. Maka jangan sampai dunia mengacaukanmu dengan jebakan-jebakan dan kelezatannya dari amal akhirat. Jangan sampai setan yang pandai menipu itu menyesatkan kalian dengan hanya memimpikan Allah dan tidak bergegas kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, sesungguhnya janji Allah itu benar} pasti terjadi bukan mustahil {Maka jangan sekali-kali kehidupan dunia memperdaya kalian} maka jangan sampai menipu kalian {dan jangan setan yang pandai menipu itu} setan {menipu kalian juga} dan jangan sampai menipu kalian juga {tentang Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Allah berfirman, “Hai manusia, sesungguhnya janji Allah“ akan adanya kebangkitan dan pembalasan terhadap amal perbuatan “adalah benar adanya.” Maksudnya: tidak ada keraguan, kebimbangan ataupun ketidakpastian padanya. Hal ini telah dibuktikan oleh berbagai dalil sam’i (wahyu) dan berbagain argument aqli (logis). Jika janjiNya adalah benar, maka bersiap-siaplah untuk menghadapinya dan pergunakanlah segera waktu-waktu kalian yang sangat berharga itu untuk beramal shalih, dan jangan sekali-kali ada yang menghalangi kalian dari yang demikian. “Maka sekali-kali janganlah kehidupan dunia memperdayakan kamu” dengan segala kelezatan dan kegemerlapannya serta segala tuntutannya, sehingga melalaikan kalian dari tujuan kalian diciptakan, “dan sekali-kali janganlah setan yang pandai menipu memperdayakan kamu tentang Allah,” yaitu setan, musuh kalian yang sesungguhnya, “maka anggaplah ia musuh.” Maksudnya: hendaknya permusuhan setanh terhadap kalian menjadi perhatian, dan jangan kalian meremehkan serangannya yang bisa terjadi setiap waktu, sebab dia bisa melihat kalian sedangkan kalian tidak dapat melihatnya, dan dia selalu mengintai kalian. “Karena sesungguhnya setan-setan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala.” Inilah maksud dan yang diinginkannya dari siapa saja yang mengikutinya, yaitu dihinakan sehina-hinanya dengan azaab yang sangat dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 5: Wahai manusia, ketahuilah bahwa janji Allah akan hari kebangkitan dan pembalasan adalah benar dan pasti; Maka janganlah terlena dengan kesenangan dunia sehingga memalingkan kalian dari ibadah kepada syahwat, di mana Allah menciptakan kalian dengan sebab ibadah begitu juga Allah membebani kalian dengan ibadah. Janganlah kalian wahai manusia, berpaling dari taat kepada Allah dan ibadah kepada-Nya. Yaitu dipalingkan oleh setan yang memalingkan kalian dari ketaatan kepada-Nya dan juga dari setiap kebaikan yang kalian lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kebangkitan dan pembalasan terhadap amal. Tidak ada keraguan padanya, dalil-dalil naqli dan ‘aqli telah menunjukkan demikian. Oleh karena janji-Nya adalah benar, maka bersiap-siaplah untuk menghadapinya dan manfaatkanlah waktu-waktumu dengan beramal saleh. Sehingga kamu lupa terhadap tujuan diciptakannya kamu. Karena santun-Nya dan penundaan hukuman dari-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 5",
    "description": "Usai mengisyaratkan bahwa kiamat pasti akan tiba, Allah lalu secara tegas menyatakan bahwa janji tentang kiamat, pahala, dan siksa adalah benar adanya. Karenanya, manusia tidak boleh terlena dan teperdaya oleh kehidupan dunia. Wahai manusia! sungguh, janji Allah tentang pahala dan siksa itu benar, maka janganlah kehidupan dunia seperti kekayaan dan kekuasaan memperdayakan kamu sehingga kamu sedikit bahkan tidak sama sekali menyiapkan diri untuk kehidupan akhirat. Dan janganlah setan yang pandai menipu dapat memperdayakan kamu tentang Allah dan ajaran agama-Nya. 6. Sungguh, setan itu musuh yang nyata dan abadi bagimu, maka perlakukanlah ia sebagai musuh. Jangan kamu ikuti ajakan, rayuan, dan tipu dayanya, karena sesungguhnya setan itu hanya mengajak golongannya agar mereka menjadi penghuni neraka yang menyala-Nyala. Salah satu cara setan memperdaya manusia adalah menganggap kecil perbuatan dosa karena Allah maha pengampun."
  }
]