[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Wahai manusia, sesungguhnya janji kebangkitan, pahala dan hukuman dari Allah adalah haq yang pasti terjadi, maka janganlah kalian tertipu oleh kehidupan dunia dengan segala hawa nafsunya dan tuntutannya. Jangan sampai setan menipu kalian dari Allah, sesungguhnya setan adalah musuh bagi anak cucu Adam, maka jadikanlah dia sebagai musuh dan jangan menaatinya, karena dia hanya mengajak orang-orang yang mengikutinya kepada kesesatan, sehingga mereka menjadi penghuni neraka yang menyala-nyala"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya setan bagi kalian wahai manusia adalah musuh abadi, maka jadikanlah ia sebagai musuh kalian dengan terus-menerus melawannya, karena setan itu hanya mengajak para pengikutnya pada kekufuran kepada Allah agar mereka masuk api Neraka yang menyala-nyala pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Sungguh setan adalah musuh kalian, maka musuhilah dia sebagaimana mereka memusuhi kalian, yaitu dengan menyelisihi dan tidak menuruti godaannya, serta berhati-hati dari tipu dayanya agar kalian tidak terjerumus ke dalam tipuannya. Dia tidak memiliki tujuan lain selain menggiring pengikutnya agar menjadi penghuni neraka selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ الشَّيْطٰنَ لَكُمْ عَدُوٌّ فَاتَّخِذُوهُ عَدُوًّا ۚ (Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu)) Maka musuhillah dia dengan ketaatan kepada Allah, dan janganlah kalian mentaatinya dengan bermaksiat kepada Allah. إِنَّمَا يَدْعُوا۟ حِزْبَهُۥ لِيَكُونُوا۟ مِنْ أَصْحٰبِ السَّعِيرِ(karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala) Mengajak pengikut-pengikutnya untuk bermaksiat kepada Allah agar mereka menjadi penghuni neraka. Hal ini dia lakukan karena rasa permusuhan yang dia miliki terhadap Bani Adam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya setan itu adalah musuh sejak dulu bagi kalian, maka musuhilah dia dengan menaati Allah. Jangan menaatinya (setan) dalam berbuat maksiat dan jangan mengikutinya. Sesungguhnya dia mengajak pengikut-pengikutnya yang taat untuk menjadi salah satu penduduk neraka yang membara dan menyala-nyala karena permusuhan mereka terhadap anak Adam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya setan itu musuh bagi kalian. Maka jadikanlah dia sebagai musuh. Sesungguhnya setan itu hanya mengajak golongannya} para pengikutnya {agar mereka menjadi penghuni neraka Sa‘ir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Allah berfirman, “Hai manusia, sesungguhnya janji Allah“ akan adanya kebangkitan dan pembalasan terhadap amal perbuatan “adalah benar adanya.” Maksudnya: tidak ada keraguan, kebimbangan ataupun ketidakpastian padanya. Hal ini telah dibuktikan oleh berbagai dalil sam’i (wahyu) dan berbagain argument aqli (logis). Jika janjiNya adalah benar, maka bersiap-siaplah untuk menghadapinya dan pergunakanlah segera waktu-waktu kalian yang sangat berharga itu untuk beramal shalih, dan jangan sekali-kali ada yang menghalangi kalian dari yang demikian. “Maka sekali-kali janganlah kehidupan dunia memperdayakan kamu” dengan segala kelezatan dan kegemerlapannya serta segala tuntutannya, sehingga melalaikan kalian dari tujuan kalian diciptakan, “dan sekali-kali janganlah setan yang pandai menipu memperdayakan kamu tentang Allah,” yaitu setan, musuh kalian yang sesungguhnya, “maka anggaplah ia musuh.” Maksudnya: hendaknya permusuhan setanh terhadap kalian menjadi perhatian, dan jangan kalian meremehkan serangannya yang bisa terjadi setiap waktu, sebab dia bisa melihat kalian sedangkan kalian tidak dapat melihatnya, dan dia selalu mengintai kalian. “Karena sesungguhnya setan-setan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala.” Inilah maksud dan yang diinginkannya dari siapa saja yang mengikutinya, yaitu dihinakan sehina-hinanya dengan azaab yang sangat dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 6: Ketahuilah bahwa setan adalah musuh hakiki, yang menyampaikan permusuhan secara terang-terangan, maka jadilah hamba yang berhati-hati darinya, jadikan ia musuh kalian dalam pikiran kalian, berpegang teguhlah dan jangan taati perintahnya. Dan ketahuilah bahwa tujuan setan adalah memalingkan kalian agar menjadikan kalian penghuni neraka bersamanya yang menyala-nyala apinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu musuhilah dia dan jangan menaati, karena dia selalu mencari kesempatan untuk menjatuhkan kamu, dan dia melihatmu, sedangkan kamu tidak melihatnya. Inilah tujuannya. Oleh karena itu, barang siapa yang mengikutinya, maka dia akan dihinakan dengan azab yang menyala-nyala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 6",
    "description": "Sungguh, setan itu musuh yang nyata dan abadi bagimu, maka perlakukanlah ia sebagai musuh. Jangan kamu ikuti ajakan, rayuan, dan tipu dayanya, karena sesungguhnya setan itu hanya mengajak golongannya agar mereka menjadi penghuni neraka yang menyala-Nyala. Salah satu cara setan memperdaya manusia adalah menganggap kecil perbuatan dosa karena Allah maha pengampun. 7. Di antara golongan setan adalah mereka yang ingkar kepada Allah dan rasul-Nya. Mereka itulah orang-orang yang kafir; mereka di hari kiamat akan mendapat azab yang sangat keras dan pedih. Dan orang-orang yang beriman dan mengerjakan kebajikan dengan menjadikan setan se-bagai musuhnya, mereka memperoleh ampunan dari segala dosa dan pahala yang besar, yakni surga."
  }
]