[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengingkari bahwa hanya Allah adalah Tuhan Yang haq, mengingkari apa yang dibawa oleh para RasulNya, bagi mereka azab yang keras di akhirat. Dan orang-orang yang membenarkan Allah dan rasulNya dan mengerjakan amal-amal shalih, mereka mendapatkan maaf dari Tuhan mereka, Tuhan mereka menghapus kesalahan-kesalahn mereka setelah menutupinya bagi mereka, mereka juga mendapatkan pahala yang besar yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Orang-orang yang kafir kepada Allah karena mengikuti setan, bagi mereka azab yang berat. Sedangkan orang-orang yang beriman dan beramal saleh, bagi mereka ampunan dari Allah atas dosa-dosa mereka, bagi mereka juga pahala besar yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Orang-orang yang mengingkari Allah dan para rasul akan mendapat azab yang berat dan kekal. Sedangkan orang-orang beriman kepada Allah dan para rasul-Nya, dan mengerjakan amal shalih, maka mereka akan mendapat ampunan dari Allah dan pahala yang besar sebagai balasan atas kebaikan amalannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Orang-orang yang mengingkari Allah dan rasulNya, bagi mereka itu siksa yang dahsyat pada hari kiamat. Inilah yang dijanjikan bagi pengikut setan. Dan orang-orang yang beriman kepada Allah dan rasulNya serta mengerjakan amal shalih yang diperintahkan maka bagi mereka itu ampunan untuk dosa mere dan pahala yang agung yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir bagi mereka itu azab yang sangat keras, dan orang-orang yang beriman dan beramal shalih bagi mereka itu ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Kemudian Allah menjelaskan bahwa manusia, dilihat dari (sudut pandang) patuh dan tidaknya kepada setan terbagi menjadi dua golongan. Lalu Allah menyebutkan balasan masing-masing golongan, seraya berfirman, “Orang-orang yang kafir” yang mengingkari apa yang dibawa oleh para rasul dan dijelaskan oleh kitab-kitab suci, “bagi mereka azab yang keras” di dalam Neraka Jahanam; sangat dahsyat keadaan dan sifat-sifatnya, dan mereka kekal abadi di dalamnya selama-lamanya. “Dan orang-orang yang beriman” dengan hati mereka kepada hal-hal yang Allah serukan untuk diimani, “dan mengerjakan,” dengan anggota badan mereka, amal-amal shalih sesuai dengan konsekuensi iman tersebut “bagi mereka ampunan” terhadap dosa-dosa mereka, yang dengannya keburukan dan segala hal yang tidak diinginkan menjadi hilang dari mereka “dan pahala yang besar,” yang dengannya segala hal yang diinginkan pasti tercapai."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 7: Ketahuilah wahai manusia barangsiapa yang kufur kepada Allah dan mendustakan para rasul-Nya; Allah akan siapkan bagi mereka adzab yang pedih di akhirat. Adapun yang beriman kepada Allah dan mengikuti Rasul-Nya ﷺ serta beramal dengan amalan yang shalih; Maka mereka akan diampuni Allah atas dosa-dosa mereka, dan Allah hapuskan keburukan mereka, dan mereka mendapatkan ganjaran yang besar, mereka kekal di dalam surga yang penuh kenikmatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan, bahwa manusia terhadap setan ada dua golongan; ada golongan yang menaati setan, yaitu orang-orang kafir, dan ada golongan yang tidak menaati setan, yaitu orang-orang yang beriman. Dia juga menjelaskan balasan terhadap masing-masingnya. Kepada yang dibawa para rasul. Keras zat maupun sifatnya, dan bahwa mereka kekal di dalamnya selam-lamanya. Dengan hati mereka kepada semua yang diperintahkan Allah untuk diimani. Sebagai konsekwensi dari keimanan. Terhadap dosa-dosa mereka, dan tersingkir dari mereka keburukan dan hal yang tidak diinginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 7",
    "description": "Di antara golongan setan adalah mereka yang ingkar kepada Allah dan rasul-Nya. Mereka itulah orang-orang yang kafir; mereka di hari kiamat akan mendapat azab yang sangat keras dan pedih. Dan orang-orang yang beriman dan mengerjakan kebajikan dengan menjadikan setan se-bagai musuhnya, mereka memperoleh ampunan dari segala dosa dan pahala yang besar, yakni surga. 8. Allah membedakan dengan sangat nyata mereka yang menjadikan setan sebagai musuh dan mereka yang menjadikannya kawan. Maka, apakah pantas orang yang dijadikan terasa indah perbuatan buruknya karena berkawan dengan setan, lalu menganggap baik perbuatannya itu' tentu tidak pantas! sesungguhnya Allah menyesatkan siapa yang dia kehendaki karena dia lebih memilih kesesatan daripada petunjuk Allah melalui rasul-Nya, dan memberi petunjuk kepada siapa yang dia kehendaki karena dia memilih petunjuk atas izin Allah. Maka, jangan engkau, wahai nabi Muhammad, biarkan dirimu binasa karena kesedihan hatimu dan larut dalam penyesalan terhadap kesesatan dan keingkaran mereka. Sesungguhnya Allah maha mengetahui apa yang mereka perbuat dan akan memberi balasan yang sepadan."
  }
]