[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang setan tampakan indah baginya amal-amal buruknya berupa kemaksiatan-kemaksiatan kepada Allah, kekafiran, penyembahan kepada tuhan-tuhan lain dan berhala-berhala selain Allah sehingga dia melihatnya bagus sama seperti orang yang diberi petunjuk oleh Allah, sehingga dia melihat yang baik adalah baik dan yang buruk adalah buruk? Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dari hamba-hambaNya dan memberi petunjuk kepada siapa yang Dia kehendaki, maka jangan mencelakai dirimu sendiri karena kesedihan terhadap kekafiran orang-orang yang tersesat itu. Sesungguhnya Allah Maha Mengetahui keburukan-keburukan mereka dan akan membalas mereka karenanya dengan balasan yang paling buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya orang yang dibaguskan amal jahatnya oleh setan, sehingga ia pun meyakininya baik, tidak seperti orang yang Allah hiaskan kebenaran kepadanya sehingga dia pun meyakininya. Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk pada siapa yang Dia kehendaki, tidak ada yang menekan Allah, maka janganlah kamu -wahai Rasul- membinasakan dirimu karena sedih terhadap kesesatan orang-orang yang tersesat. Sesungguhnya Allah Maha mengetahui apa yang mereka lakukan, tidak ada sedikit pun amal mereka yang tersembunyi bagi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Apakah orang yang tergoda oleh setan untuk melakukan perbuatan buruk sehingga dia menganggapnya sebagai perbuatan baik, seperti orang yang mendapat hidayah dari Allah? Sesungguhnya Allah memalingkan orang yang Dia kehendaki dari kebenaran, dan memberi petunjuk kepada kebenaran bagi orang yang Dia kehendaki pula. Petunjuk adalah bagi orang yang menempuh jalannya, mencari cara untuk mendapatkannya, dan menginginkannya dengan sungguh-sungguh. Wahai Nabi, maka janganlah kamu membinasakan dirimu dengan kesedihan dan kegalauan akibat orang-orang yang memilih jalan kesesatan. Allah Maha Mengetahui keadaan dan rahasia mereka, dan Allah akan membalas mereka dengan siksaan yang pantas mereka dapatkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَفَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ فَرَءَاهُ حَسَنًا ۖ (Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik) Orang yang menganggapnya suatu kebaikan akibat setan yang selalu menghiasinya agar dapat menyesatkannya dan senantiasa melakukan amal keburukan, dengan anggapan bahwa dia sedang melakukan amal shalih; apakah dia seperti orang yang berada di atas petunjuk dan mengetahui bahwa ia berada dalam kebenaran? فَإِنَّ اللهَ يُضِلُّ مَن يَشَآءُ(Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya) Yakni yang Allah kehendaki untuk disesatkan. وَيَهْدِى مَن يَشَآءُ ۖ (dan menunjuki siapa yang dikehendaki-Nya) Yakni yang Allah kehendaki untuk diberi petunjuk. فَلَا تَذْهَبْ نَفْسُكَ عَلَيْهِمْ حَسَرٰتٍ ۚ (maka janganlah dirimu binasa karena kesedihan terhadap mereka) Yakni janganlah kamu membunuh dirimu sendiri akibat rasa sedih atas kesesatan mereka yang tanpa henti, sebab Allah-lah yang menghendaki untuk menyesatkan mereka akibat keburukan amal mereka. إِنَّ اللهَ عَلِيمٌۢ بِمَا يَصْنَعُونَ(Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat) Yakni perbuatan mereka yang tersembunyi tidak dapat disembunyikan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Apakah orang yang perbuatan buruknya dihiasi oleh setan (perbuatan jeleknya), maka dia akan melihatnya sebagai kebaikan, yaitu dia melihat suatu keburukan sebagai suatu kebaikan) sebagaimana orang beriman yang tidak dihiasi amalnya oleh setan? Tidak, sesungguhnya keduanya berbeda (hamzah tersebut adalah istifham inkary yang memberikan fungsi nafi). Maka sesungguhnya Allah menyesatkan orang yang dikehendaki dengan memberinya kesesatan, jadi dia mengutamakan amal jelek dan perbuatan buruknya. Dia (Allah) juga menunjukkan orang yang dikehendaki dengan memberinya petunjuk sehingga dia mendahulukan amal (baik)nya dengan petunjuk tersebut dan pertolongan menuju jalan petunjuk dan keimanan. Maka janganlah kalian menghancurkan diri kalian dengan bersedih atas kekufuran dan kesesatan mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka kerjakan dan tidak ada yang luput dariNya. Dia juga membalas setiap orang dengan apa yang layak baginya. Ibnu Abbas berkata: “Ayat ini diturunkan {Afaman Zuyyina …} saat nabi SAW berdoa: “Ya Allah Muliakanlah agamaMu dengan Umar bin Khattab atau dengan Abu Jahal bin Hisyam” lalu Allah memberi hidayah kepada Umar dan menyesatkan Abu Jahal. Untuk keduanyalah ayat ini diturunkan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah pantas orang yang dibuat terasa indah perbuatan buruknya} dibuat indah baginya perbuatan buruknya {lalu menganggapnya baik. Sesungguhnya Allah menyesatkan siapa saja yang Dia kehendaki dan memberi petunjuk kepada siapa saja yang Dia kehendaki. Maka jangan binasakan dirimu} maka jangan hancurkan dirimu {karena bersedih terhadap mereka} karena bersedih atas kesesatan mereka {Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Allah berfirman, “Maka apakah orang yang dijadikan menganggap baik” pekerjaannya yang buruk lagi keji, yang dihiasi dan diperbagus oleh setan dalam pandangan matanya, “lalu ia meyakini pekerjaan itu baik.” Yakni, seperti orang yang diberi hidayah oleh Allah kepada jalan yang lurus dan Agama yang benar; apakah sama yang ini dengan yang itu?! Yang pertama melakukan amal keburukan dan memandang yang haq itu batil, sedangkan yang batil itu haq, dan orang yang kedua melakukan kebaikan dan melihat yang haq adalah haq dan yang batil adalah batil. Namun, pemberian hidayah dan penyesatan itu hanya ada di Tangan Allah, “maka sesungguhnya Allah menyesatkan siapa yang dikehendakiNya; maka janganlah dirimu binasa terhadap mereka,” yakni terhadap orang-orang yang sesat di mana perbuatan-perbuatan buruk mereka pandang baik dan mereka dihalang-halangi oleh setan dari yang haq, “karena kesedihan.” Hal itu karena kewajibanmu hanyalah menyampaikan, dan sedikit pun kamu tidak berwenang memberi petunjuk kepada mereka, dan Allah-lah yang akan memberikan pembalasan kepada mereka atas amal perbuatan mereka. “Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 8: Allah mengabarkan perbedaan yang besar antara ahli iman dan ketaatan, dengan ahli kufur dan maksiat, Allah berkata : Apakah manusia yang amalan buruknya dihiasi oleh setan kemudian melihat suatu kebaikan, apakah sama bagi siapa yang melihat kebenaran yang benar dengan kebathilan yang bathil ?!, Maka tidak ragu lagi keduanya tidaklah serupa. Allah menyesatkan bagi siapa yang dikehendaki-Nya dengan adil dan penuh hikmah, bagi siapa yang berjalan di atas kekafiran dan kesesatan, Allah memberi petunjuk bagi siapa yang dikehendaki-Nya dengan karunia dan kasih sayang-Nya, bagi siapa yang memilih jalan petunjuk. Maka jika urusannya demikian wahai Nabi Allah, lewatilah ketika engkau berdakwah dan menyampaikan risalah Rabbmu (bagi siapa yang menolak), dan janganlah engkau membinasakan dirimu sendiri karena sebab merasa susah, bersedih dan berduka cita bagi siapa yang menggantikan petunjuk dengan kesesatan, tauhid dengan syirik, dan ketahuilah bahwasanya Allah maha tahu dengan apa yang diperbuat oleh mereka yang jahil, tidak tersembunyi bagi-Nya atas urusan-urusan mereka sedikitpun, dan mereka akan dibalas atas amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang yang pertama amalnya buruk, melihat yang hak sebagai kebatilan dan melihat kebatilan sebagai kebenaran, sedangkan orang yang kedua amalnya baik, melihat hak sebagai kebenaran dan batil sebagai kebatilan, apakah sama keduanya? Tentu tidak sama. Akan tetapi karena mendapatkan hidayah dan tersesat di Tangan Allah, maka Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk kepada siapa yang Dia kehendaki. Yakni kepada orang-orang yang tersesat, di mana amal buruk mereka terasa indah dan setan menghalangi mereka dari kebenaran. Tugas Beliau hanyalah menyampaikan, dan tidak berkewajiban menjadikan mereka mendapat hidayah. Dan Allah-lah yang akan memberikan balasan terhadap amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 8",
    "description": "Allah membedakan dengan sangat nyata mereka yang menjadikan setan sebagai musuh dan mereka yang menjadikannya kawan. Maka, apakah pantas orang yang dijadikan terasa indah perbuatan buruknya karena berkawan dengan setan, lalu menganggap baik perbuatannya itu' tentu tidak pantas! sesungguhnya Allah menyesatkan siapa yang dia kehendaki karena dia lebih memilih kesesatan daripada petunjuk Allah melalui rasul-Nya, dan memberi petunjuk kepada siapa yang dia kehendaki karena dia memilih petunjuk atas izin Allah. Maka, jangan engkau, wahai nabi Muhammad, biarkan dirimu binasa karena kesedihan hatimu dan larut dalam penyesalan terhadap kesesatan dan keingkaran mereka. Sesungguhnya Allah maha mengetahui apa yang mereka perbuat dan akan memberi balasan yang sepadan. 9. Usai menjelaskan kepastian janji Allah, kedatangan hari kiamat, dan perbedaan antara orang yang taat dengan yang ingkar serta balasan yang akan mereka peroleh, pada ayat ini Allah menunjukkan tanda-tanda kekuasan-Nya di alam semesta sekaligus menjadi perumpamaaan terjadinya hari kebangkitan. Dan Allah-lah yang mengirimkan angin; lalu angin itu menggerakkan awan, maka kami arahkan awan yang mengan-dung air itu ke suatu negeri yang mati, yakni tandus, lalu turunlah hujan dan dengan hujan itu lalu kami hidupkan bumi setelah mati, yakni kering. Seperti itulah kebangkitan itu akan terjadi."
  }
]