[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengirimkan angin sehingga angina itu menggerakan awan, lalu Kami menumpahkannya ke tanah yang gersang, air hujan turun kepadanya lalu dengannya Kami menghidupkan bumi setelah sebelumnya kering sehingga sekarang ia menghijau karena tumbuh-tumbuhan, seperti penghidupan bumi inilah Allah menghidupkan orang-orang mati pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Allah lah yang menghembuskan angin, lalu angin ini menggerakkan awan, selanjutnya Kami menurunkan hujan di atas negeri kering yang tak bertanaman, lalu Allah menghidupkan dengan air tersebut bumi dengan tanaman yang Kami tumbuhkan padanya padahal sebelumnya kering. Sebagaimana Kami menghidupkan bumi setelah kekeringannya dengan tanaman yang Kami simpan padanya, maka demikianlah kebangkitan orang-orang yang mati nanti pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Salah satu tanda keesaan dan keagungan Allah adalah, Dia mengirim dan mengarahkan angin agar terjadi proses pembentukan hujan pada awan, kemudian Kami arahkan awan itu menuju tempat yang tandus dan menurunkan hujan itu di sana. Dan Kami penghidupkan tanah itu yang sebelumnya kering dan tandus. Demikianlah Allah menghidupkan dan membangkitkan manusia setelah kematian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَاللهُ الَّذِىٓ أَرْسَلَ الرِّيٰحَ فَتُثِيرُ سَحابًا (Dan Allah, Dialah Yang mengirimkan angin; lalu angin itu menggerakkan awan) Yakni yang memproses awan dari uap air laut, kemudian meniupnya agar bergerak ke tempat yang Allah kehendaki. فَسُقْنٰهُ إِلَىٰ بَلَدٍ مَّيِّتٍ(maka Kami halau awan itu kesuatu negeri yang mati) Yakni tanah yang telah mati tanamannya dan kehausan penduduk dan hewan-hewannya. فَأَحْيَيْنَا بِهِ الْأَرْضَ(lalu Kami hidupkan bumi dengan hujan itu) Yakni Kami hidupkan bumi dengan tanamannya menggunakan air hujan. بَعْدَ مَوْتِهَا ۚ( setelah matinya) Yakni setelah kering dan kosong dari tanaman. كَذٰلِكَ النُّشُورُ(Demikianlah kebangkitan itu) Yakni demikianlah Allah akan menghidupkan hamba-hamba-Nya setelah kematian mereka, sebagaimana menghidupkan bumi setelah matinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah adalah Dzat yang mengirim angin sebagai sarana pembawa hujan lebat, lalu angin itu menggerakkan awan dan mendorongnya ke suatu arah, kemudian Kami menggerakkan awan yang berisi hujan ini ke negeri gersang dan kering yang tidak ada tumbuhannya, Melalui hujan itu, Kami hidupkan tanah negeri itu dengan menumbuhkan tanamannya setelah kering dan gersang. Seperti proses penghidupan itulah Allah menghidupkan hamba-hambaNya dari kematian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allahlah Dzat yang mengirimkan angin, lalu angina itu menggerakkan} menggerakkan {awan. Lalu Kami arahkan awan itu ke suatu negeri yang mati} yang tandus tidak ada tanaman di dalamnya {lalu dengannya Kami hidupkan bumi itu setelah kematiannya. Seperti itulah kebangkitan} kebangkitan dari kubur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah menginformasikan tentang kemahasempurnaan KuasaNya dan kemahaluasan belas kasihNya, dan sesungguhnya Dia-lah “yang mengirimkan angin; lalu angin itu menggerakkan awan, maka Kami halau awan itu ke suatu negeri yang mati” kemudian Allah menurunkannya di atasnya “lalu Kami hidupkan bumi setelah kematiannya dengan hujan itu,” maka hiduplah daerah tersebut dan juga para penghuninya, hewan-hewan pun mendapat makanan dan berkeliaran di lading-ladang rumput itu. “Demikianlah,” Allah Yang telah menghidupkan bumi setelah kematiannya, akan menghiduplkan kembali orang-orang yang sudah mati dari dalam kuburnya; maka kelak mereka akan datang untuk menghadap Allah, supaya Dia memberikan keputusan di antara mereka dan menetapkan keputusan dengan keputusan hukum yang adil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fatir ayat 9: Ketahuilah wahai manusia bahwasanya Allah sajalah yang mengirimkan angin dan mengalirkannya, yang kemudian menggiring awan dan berkumpul sebagian atas sebagian yang lainnya, Allah turunkan (hujan) bagi negeri yang mati dengan tidak ada tumbuhan padanya, tidak juga pertanian. Allah memerintahkan hujan turun atas negeri tersebut; Allah hidupkan negeri tersebut dengan hujan, tumbuhlah tumbuh-tumbuhan di tanahnya dan menghijau setelah kering tanahnya serta kekurangan hujan. Begitu juga Allah hidupkan seorang hamba setelah kematian mereka, dan dibangkitkan untuk dibalas dan di hisab; Sebagaimana Allah hidupkan tanah yang kering ini setelah kematiannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya kuasa-Nya dan luasnya kepemurahan-Nya. Lalu Allah turunkan hujan kepadanya. Maka bumi menjadi hidup dan makhluk hidup memperoleh rezeki. Yakni Allah Subhaanahu wa Ta'aala apabila hendak membangkitkan, maka Dia menurunkan hujan dari bawah ‘Arsy yang mengena kepada bumi secara merata, lalu jasad-jasad itu tumbuh dalam kuburnya sebagaimana tumbuhnya sebutir biji di bumi, kemudian mereka datang menghadap Allah agar Dia memberikan keputusan kepada mereka dengan keputusan-Nya yang adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fatir Ayat 9",
    "description": "Usai menjelaskan kepastian janji Allah, kedatangan hari kiamat, dan perbedaan antara orang yang taat dengan yang ingkar serta balasan yang akan mereka peroleh, pada ayat ini Allah menunjukkan tanda-tanda kekuasan-Nya di alam semesta sekaligus menjadi perumpamaaan terjadinya hari kebangkitan. Dan Allah-lah yang mengirimkan angin; lalu angin itu menggerakkan awan, maka kami arahkan awan yang mengan-dung air itu ke suatu negeri yang mati, yakni tandus, lalu turunlah hujan dan dengan hujan itu lalu kami hidupkan bumi setelah mati, yakni kering. Seperti itulah kebangkitan itu akan terjadi. 10. Kekuasaan Allah tidak sebatas keberadaan alam semesta. Dia juga pemilik kemuliaan yang didambakan oleh banyak orang. Melalui ayat ini Allah mengingatkan, 'barang siapa menghendaki kemuliaan, maka ketahuilah bahwa kemuliaan itu semuanya milik Allah. Karena itu, jika kamu menginginkannya, mendekatlah dan taatilah Allah. Kepada-Nyalah akan naik perkataan-perkataan yang baik, yakni kalimat tauhid l' il'ha illall'h, kalimat zikir, atau semua perkataan yang baik dalam pandangan agama, dan amal kebajikan, dia akan mengangkatnya. Perkataan baik akan naik dan amal yang baik itu dinaikkan untuk diterima dan diberi-Nya pahala, sehingga pelakunya mendapat kemuliaan dan kedudukan tinggi di sisi-Nya. Adapun orang-orang yang karena meng-ikuti hawa nafsu merencanakan kejahatan terhadap orang-orang yang beriman, mereka akan mendapat azab yang sangat keras, dan rencana jahat mereka akan hancur serta tidak mencapai sasarannya. Mereka inilah orang-orang yang jauh dari kemuliaan."
  }
]