[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alif lam ra. Keterangan tentang huruf-huruf yang terputus-putus (diawal sejumlah surat seperti ini) telah berlalu di muka pada permulaan surat al-baqarah. Ini adalah ayat-ayat al-qur’an yang tinggi kedudukannya. Dan al-qur’an yang diturunkan kepadamu ini (wahai rasul), adalah merupakan kebenaran, bukan seperti yang dikatakan kaum musyrikin, bahwa sesungguhnya kamulah yang mendatangkannya dari dirimu sendiri. Meskipun demikian banyak manusia tidak beriman kepadanya dan tidak mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Penjelasan tentang susunan huruf seperti ini telah hadir di awal surah Al-Baqarah. Ayat-ayat yang mulia di dalam surah ini dan Al-Qur`ān yang Allah turunkan kepadamu wahai Rasul adalah kebenaran yang tidak ada keraguan padanya, tidak ada kebimbangan bahwa ia dari sisi Allah, akan tetapi kebanyakan manusia tidak membenarkannya karena menentang dan menyombongkan diri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah disebutkan penjelasan tentang huruf muqattha’ah, dan hikmah dari huruf-huruf ini adalah untuk menjelaskan mukjizat al-Qur’an. Ayat-ayat yang memiliki kedudukan tinggi ini adalah ayat-ayat al-Qur’an, al-Qur’an ini diturunkan kepadamu -Hai Rasulullah- dari Tuhanmu dengan kebenaran yang tidak diragukan; kisah-kisahnya benar dan hukum-hukumnya juga benar; akan tetapi mayoritas manusia tidak beriman kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تِلْكَ ءَايٰتُ الْكِتٰبِ ۗ (Ini adalah ayat-ayat Al Kitab) Yakni ayat-ayat yang ada dalam surat ini. وَالَّذِىٓ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ(Dan Kitab yang diturunkan kepadamu daripada Tuhanmu itu adalah benar) Yakni seluruh ayat al-Qur’an merupakan kebenaran yang sesungguhnya. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ(akan tetapi kebanyakan manusia tidak beriman) Tidak beriman kepada kebenaran yang diturunkan Allah kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. {Alif Lam Mim Ra’}, Alif, Lam, Mim, Ra’: huruf-huruf yang menunjukkan kekokohan Al-Qur’an bagi manusia dan jin, dan menunjukkan bahwa Al-Qur’an itu benar-benar dari sisi Allah. Ini juga termasuk cara menantang bangsa Arab untuk menandinginya, meskipun itu terdiri dari huruf-huruf bahasa mereka, bahasa Arab. Ayat-ayat ini dan ayat lainnya merupakan ayat-ayat Al-Qur’an. Dan yang diturunkan Tuhanmu kepadamu melalui wahyu itu kebenaran yang tidak ada keraguan di dalamnya, namun kebanyakan manusia tidak percaya bahwa itu diturunkan dari sisi Allah, karena tidak mereka tidak mau merenung dan berpikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Mīm Rā. Itulah ayat-ayat kitab. yang diturunkan kepadamu dari Tuhanmu itu adalah kebenaran, tetapi kebanyakan manusia tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah mengabarkan bahwa al-Quran merupakan himpunan ayat-ayat yang dapat menunjukkan kebutuhan manusia, berupa prinsip-prinsip agama dan cabang-cabangnya. (Juga memberitahukan) bahwa wahyu yang diturunkan kepada Rasulullah dari Rabb nya adalah kebenaran yang nyata. Sebab, berita-beritanya merupakan kebenaran, seluruh perintah dan larangannya mencerminkan keadilan, dengan didukung oleh berbagai dalil dan petunjuk yang pasti. Barangsiapa yang menyambutnya dan merengkuh ilmunya, maka dia termasuk dari orang-orang yang menguasai kebenaran. Ilmu mereka akan mewajibkan mereka untuk mengamalkan hal-hal yang dicintai oleh Allah. “Akan tetapi kebanyakan manusia tidak beriman (kepadanya),” yaitu beriman kepada al-Quran, baik karena kebodohan mereka, sikap antipasti, tidak peduli atau lantaran sikap penentangan dan kezhaliman. Oleh karena itu, mayoritas manusia tidak mengambil manfaat dengannya, lantaran tidak ada faktor yang mendukung untuk menerima manfaat dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (الٓمٓرۚ) alif laam raa : ini adalah Huruf Muqatha’ah, tertulis, (الٓمٓرۚ) dan dibaca alif laam raa. Allah lebih mengetahui maknanya. Makna ayat : Firman-Nya : (الٓمٓرۚ) Allah lebih mengetahui maknanya. Firman-Nya : (تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ) Isyarat kepada kisah-kisah yang terdapat pada surat Yusuf. Maksud al-kitaab adalah Taurat dan Injil, dan termasuk ayat-ayatnya apa yang Allah kisahkan kepada rasul-Nya. Firman-Nya : (وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ) yaitu Al-Qur’an yang agung (ٱلۡحَقُّ) yang benar. Firman-Nya : (وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ) Kebanyakan orang dari kaummu dan selain mereka tidak beriman, padahal apa yang turun kepadamu dari Rabbmu adalah kebenaran, mereka tidak beriman bahwa Al-Qur’an adalah wahyu Allah dan turun dari sisi-Nya, sehingga mereka mengamalkannya dan memperoleh kesempurnaan dan kebahagiaan. Pelajaran dari ayat : • Penetapan akidah wahyu ilahi dan kenabian Muhammad shallahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 1: Hal itu karena beritanya benar, perintah dan larangannya adil, diperkuat oleh dalil-dalil dan bukti yang nyata. Oleh karena itu, barang siapa yang mendatangi Al Qur’an dan mendalaminya, maka ia termasuk orang yang mengetahui kebenaran dan hal ini menghendaki orang itu mengamalkannya. Bahwa Al Qur'an berasal dari sisi-Nya, bisa karena kebodohannya, sikap berpalingnya, tidak peduli, membangkang, atau bersikap zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 1",
    "description": "Alif laam miim raa'. Hanya Allah yang mengetahui maksud ungkapan ini. Itu adalah ayat-ayat kitab Al-Qur'an yang Allah turunkan kepada nabi Muhammad. Ia berisi petunjuk dan ajaran bagi umat manusia. Dan ketahuilah bahwa kitab yang diturunkan kepadamu, wahai nabi Muhammad, dari tuhanmu itu adalah benar dari-Nya, tuhan yang maha mengetahui; tetapi kebanyakan manusia tidak beriman kepada-Nya. Setelah pada ayat sebelumnya Allah menjelaskan bahwa Al-Qur'an adalah benar dari-Nya, lalu pada ayat ini Allah membuktikan kebenarannya melalui keunikan penciptaan alam semesta. Hanya Allah yang meninggikan langit tanpa tiang penyangga sebagaimana yang kamu lihat, kemudian dia bersemayam di atas 'arsy. Dia menundukkan matahari dan bulan di bawah aturan hukum alam-Nya; masing-masing dari keduanya beredar menurut waktu yang telah ditentukan. Dia mengatur urusan makhluk-Nya, baik yang di bumi maupun di langit, dan dia menjelaskan tanda-tanda kebesaran-Nya agar kamu yakin akan pertemuan dengan tuhanmu kelak di akhirat."
  }
]