[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sama dalam ilmu Allah orang yang menyamarkan perkataan diantara kalian dan orang yang mengatakannya secara terang-terangan. dan sama pula bagiNYa orang yang menyembunyikan amal-amalnya di kegelapan malam dan orang yang melakukannya secara terang-terangan di siang bolong."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah mengetahui rahasia dan apa yang tersembunyi. Dalam ilmu Allah sama saja siapa yang merahasiakan perkataannya di antara kalian -wahai manusia- dan siapa yang mengumumkannya. Sama saja dalam ilmu Allah siapa yang bersembunyi di dalam kegelapan malam sehingga mata manusia tidak melihatnya dan siapa yang menampakkan amal perbuatannya di siang bolong."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dan salah satu tanda keluasan ilmu Allah tentang segala kejadian, sama bagi-Nya perkataan yang kalian samarkan dan yang kalian keraskan, sama juga bagi-Nya orang yang bersembunyi dalam berbuat sesuatu dalam kegelapan malam dan orang yang menampakkan perbuatannya pada terangnya siang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. سَوَآءٌ مِّنكُم مَّنْ أَسَرَّ الْقَوْلَ وَمَن جَهَرَ بِهِۦ (Sama saja (bagi Tuhan), siapa diantaramu yang merahasiakan ucapannya, dan siapa yang berterus-terang dengan ucapan itu) Allah mengetahui sepenuhnya apa yang dirahasiakan manusia sebagaimana mengetahui apa yang dinampakkannya, baik itu berupa kebaikan maupun keburukan. وَمَنْ هُوَ مُسْتَخْفٍۭ بِالَّيْلِ(dan siapa yang bersembunyi di malam hari) Yang tersembunyi dalam kegelapan dan tidak terlihat oleh pandangan mata. وَسَارِبٌۢ بِالنَّهَارِ(dan yang berjalan (menampakkan diri) di siang hari) Jadi segala yang nampak berjalan di jalanan atau bersembunyi dalam kegelapan, Allah mengetahui mereka semua tanpa ada perbedaan bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Orang yang menyembunyikan dan menampakkan ucapannya berupa kebaikan atau keburukan itu sama saja dalam ilmu Allah SWT, termasuk orang yang bersembunyi dalam bayang-bayang malam atau tampak lalu berjalan di siang hari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sama saja di antara kalian} sama saja bagi Allah di antara kalian {orang yang merahasiakan ucapan dan yang berterus terang dengannya, siapa yang bersembunyi pada malam hari} menutup-nutupi amalnya dalam kegelapan malam {dan yang berjalan pada siang hari} menampakkan amalnya di cahaya siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Sama saja (bagi Allah),” pada ilmu, pendengaran, dan pandanganNya “siapa di antaramu yang merahasiakan ucapannya, dan siapa yang berterus terang dengan ucapan itu, dan siapa yang bersembunyi di malam hari,” berdiam di suatu tempat, tersembunyi. “Dan yang berjalan (menampakkan diri) di siang hari,” maksudnya berada dalam tempat tinggalnya di siang hari. Yang dimaksud dengan ‘assirbu’ ialah tempat yang dijadikan oleh seseorang sebagai tempat persembunyian dan lain-lain."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَسَارِبُۢ بِٱلنَّهَارِ) wa saaribum binnahaar : terlihat ketika berjalan Makna ayat : Masih menjelaskan tentang keagungan Allah, besarnya kekuasaan-Nya, dan luasnya ilmu-Nya. Allah berfirman dalam ayat ini : (سَوَآءٞ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ) Allah mengetahui segala rahasia dan yang tampak, dan yang lebih tersembunyi dari itu semua (وَمَنۡ هُوَ مُسۡتَخۡفِۢ بِٱلَّيۡلِ) berjalan di dalam kegelapan, dan yang berjalan di siang hari, perjalanannya terlihat dan tampak oleh Allah ta’ala. Pelajaran dari ayat : • Luasnya ilmu Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 10: Dengan bersembunyi, seperti di gua, terowongan, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 10",
    "description": "Karena dia mengetahui yang gaib dan yang nyata, maka sama saja bagi Allah, siapa di antaramu yang mencoba merahasiakan ucapannya sehingga tidak diketahui orang lain, dan siapa yang berterus terang dengan ucapan-Nya; dan sama mudahnya bagi-Nya untuk tahu siapa di antara kamu yang bersembunyi pada malam hari sehingga tidak diketahui orang lain, dan yang berjalan pada siang hari sehingga disaksikan orang lain. Tidak saja mengetahui sesuatu yang tersembunyi di malam hari dan yang tampak di siang hari, Allah, melalui malaikat-Nya, juga mengawasinya dengan cermat dan teliti. Baginya, yakni bagi manusia, ada malaikat-malaikat yang selalu menjaga dan mengawasi-Nya secara bergiliran, dari depan dan dari belakangnya. Mereka menjaga dan mengawasinya atas perintah Allah. Sesungguhnya Allah yang mahakuasa tidak akan mengubah keadaan suatu kaum dari suatu kondisi ke kondisi yang lain, sebelum mereka mengubah keadaan diri menyangkut sikap mental dan pemikiranmereka sendiri. Dan apabila, yakni andaikata, Allah menghendaki keburukan terhadap suatu kaum'dan ini adalah hal yang mustahil bagi Allah'maka tak ada kekuatan apa pun yang dapat menolaknya dan tidak ada yang dapat menjadi pelindung bagi mereka selain dia."
  }
]