[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memiliki maliakat yang datang secara bergantian kepada manusia, baik dari depan maupun dari belakangnya, yang menjaganya dari perintah Allah dan menghitung apa-apa yang berasal darinya;kebaiakn maupun keburukan.Sesungguhnya Allah tidak merubah nikmat yang telah Dia berikan kepada suatu kaum, kecuali apabila mereka sendiri yang merubah apa yang Dia perintahkan kepada mereka, lalu mereka berbuat maksiaat kepadaNya. Dan apabila Allah ingin menimpakan malapetaka kepada suatu kelompok, maka tidak jalan untuk menghindarinya, dan tidak ada penolong bagi mereka selain Allah yang akan menangani urusan mereka, yang akan mendatangkan apa-apa yang mereka cintai dan menolak Dari mereka apa-apa yang tidak mereka sukai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah -Subḥānahu wa Ta'ālā- mempunyai malaikat-malaikat yang datang kepada manusia silih berganti, sebagian dari mereka datang di waktu malam, sebagian dari mereka datang di waktu siang, menjaga manusia dengan perintah Allah dari beberapa takdir yang memang Allah tuliskan akan dicegah darinya, mencatat segala perkataan dan perbuatan manusia. Allah tidak merubah keadaan satu kaum, dari keadaan yang baik kepada keadaan buruk yang tidak mereka sukai, hingga mereka sendiri yang merubah apa yang mereka dapati dari keadaan syukur (menjadi keadaan kufur). Bila Allah hendak membinasakan suatu kaum, maka tidak ada yang dapat mencegah kehendak-Nya. Dan kalian -wahai manusia- tidak memiliki penolong yang mengurusi urusan kalian, yang kalian bisa berlindung kepadanya untuk menepis malapetaka yang menimpa kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan setiap manusia memiliki malaikat-malaikat yang silih berganti untuk menjaganya, mereka menjaganya dengan perintah Allah dan menghitung segala amal perbuatannya, baik itu amal kebaikan maupun keburukan. Allah tidak mengubah kenikmatan yang diberikan kepada suatu kaum, melainkan jika mereka mengubah perintah Allah dengan melanggarnya. Dan jika Allah hendak menguji suatu kaum dengan musibah maka tidak ada yang mampu menghalangi hal itu, dan mereka tidak memiliki penolong selain Allah dalam mencari kebaikan atau menjauhi keburukan. Dari Abu Hurairah, Rasulullah bersabda: “Para malaikat malam dan para malaikat siang silih berganti menjaga kalian, dan mereka berkumpul pada shalat ashar dan shalat subuh. Kemudian malaikat yang menjaga pada malam hari naik ke langit, lalu Allah menanyai mereka -dan Allah lebih mengetahui tentang mereka-: “Bagaimana kalian tinggalkan hamba-hamba-Ku?” Mereka menjawab: “Kami meninggalkan mereka dalam keadaan shalat dan kami mendatangi mereka ketika mereka dalam keadaan shalat.” (Shahih Bukhari 13/426 no. 4729, kitab tauhid, bab firman Allah \"تعرج الملائكة والروح إليه\" dan diriwayatkan Imam Muslim dalam kitab shahihnya 1/439, kitab masjid-masjid, bab keutamaan shalat subuh dan ashar no. 632)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. لَهُۥ مُعَقِّبٰتٌ (Bagi manusia ada malaikat-malaikat yang selalu mengikutinya bergiliran) Mereka adalah para malaikat penjaga yang datang secara bergiliran. مِّنۢ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِۦ(di muka dan di belakangnya) Yakni para malaikat penjaga itu menjaga manusia dari segala sisi. يَحْفَظُونَهُۥ مِنْ أَمْرِ اللهِ (mereka menjaganya atas perintah Allah) Yakni mereka menjaga sesuai dengan perintah Allah, dan mereka tidak dapat mencegah takdir Allah. Dikatakan bahwa mereka menjaga manusia dari jin. Dikatakan pula bahwa mereka menjaga manusia dari ketetapan Allah dengan perintah-Nya, dan apabila telah datang takdir Allah maka mereka akan menyingkir. إِنَّ اللهَ لَا يُغَيِّرُ مَا بِقَوْمٍ(Sesungguhnya Allah tidak merubah keadaan sesuatu kaum) Dari keadaan penuh nikmat dan kesehatan. حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ ۗ( sehingga mereka merubah keadaan yang ada pada diri mereka sendiri) Dengan ketaatan kepada Allah. Maka Allah tidak mencabut kenikmatan yang Allah berikan kepada hamba-Nya sampai seseorang itu merubah kebaikan dan amal shalih mereka menjadi keburukan. وَإِذَآ أَرَادَ اللهُ بِقَوْمٍ سُوٓءًا(Dan apabila Allah menghendaki keburukan terhadap sesuatu kaum) Yakni kebinasaan dan siksaan. فَلَا مَرَدَّ لَهُۥ ۚ( maka tak ada yang dapat menolaknya) Maka tidak akan dapat ditolak. Terdapat pendapat mengatakan maknanya adalah apabila Allah menghendaki keburukan bagi suatu kaum maka Allah akan membutakan hati mereka sehingga mereka memilih sesuatu yang mendatangkan musibah. وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ(dan sekali-kali tak ada pelindung bagi mereka selain Dia) Yang mengatur urusan mereka dan menjadi pelindung beri mereka, yang mencegah siksaan yang turun kepada kaum itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ } \"Bagi manusia ada malaikat-malaikat yang selalu mengikutinya bergiliran, di muka dan di belakangnya, mereka menjaganya atas perintah Allah\" barangsiapa yang senantiasa menjaga Allah, niscaya Allah akan menjaganya bahkan sampai ketika binatang buas akan membahayakan dirinya, dan barangsiapa yang selalu menempitkan hak Allah, sungguh ia akan disempitkan pula diantara makhluk-Nya; bahkan dari sesuatu yang ia harapkan kebaikan darinya akan menjadi malapetaka baginya. 2 ). Kapanpun kamu menemukan kekacauan pada dirimu, maka ingatlah kepada nikmat yang belum kamu syukuri atau kesalahan yang telah kamu perbuat; karena sesungguhnya Allah berfirman : { إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ ۗ} \"Sesungguhnya Allah tidak merubah keadaan sesuatu kaum sehingga mereka merubah keadaan yang ada pada diri mereka sendiri.\" 3 ). Ada kelompok manusia yang hidup dalam kesengsaraan, dan kelompok lainnya hidup dalam gelimang harta dan kenikmatan yan berlimpah, kelompok pertama terus mencari jalan keluar dari kesengsaraa itu dengan berpegang kepada ayat Allah : { إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ }, namun kelompok lainnya takut akan kehilangan semua yang mereka nikmati itu, tapi sesungguhnya keselamatan hanya akan berpihak kepada siapa yang melihatnya : { ذَٰلِكَ بِأَنَّ اللَّهَ لَمْ يَكُ مُغَيِّرًا نِعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنْفُسِهِمْ } \"yang demikian itu adalah karena sesungguhnya Allah sekali-kali tidak akan meubah sesuatu nikmat yang telah dianugerahkan-Nya kepada suatu kaum, hingga kaum itu meubah apa-apa yang ada pada diri mereka sendiri\".[ Al-Anfal : 53 ]. 4 ). Bulan suci Ramadhan merupakan musim untuk berbuat perubahan bagi diri setiap muslim menjadi diri yang lebih baik; kesempatan agar kita merubah apa yang ada pada diri kita dari perkata yang buruk, namun sedihnya tidak sedikit dari anak-anak umat islam justru menjadi lebih buruk, siangnya hanya diisi dengan tidur dan melalaikan shalatnya, dan malam mereka diisi dengan bergadang yang tidak bermanfaat bahkan merusak ramadhannya, maka berhati-hatilah ketika kamu menjadi sebab berubahnya nikmat Allah itu menjadi malapetaka bagimu dan bagi masyarakat sekitarmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Bagi setiap manusia itu ada malaikat-malaikat yang mengikutinya untuk menjaga dan memeliharanya. Mereka adalah para malaikat penjaga yang menjaga manusia dengan perintah dan pertolongan Allah, bukan untuk menolak perintahNya. Dan jika berlaku suatu takdir, maka mereka akan berlepas darinya. Mereka menghitung amal perbuatannya yang baik dan buruk. Sesungguhnya Allah tidak mengubah nikmat atau kesehatan suatu kaum, sampai mereka mengubah ketaatan dan kebaikannya sendiri menjadi kemaksiatan dan keburukan. Jika Allah menghendaki suatu azab dan kehancuran bagi suatu kaum, maka itu tidak akan bisa ditolak. Dan tidak ada bagi mereka selain Allah seorang penolong yang membantu urusan mereka, yang membimbing mereka menuju kebaikan dan melindungi mereka dari keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Baginya ada yang menyertainya secara bergiliran} bagi seorang hamba ada beberapa malaikat yang saling bergiliran {dari depan dan belakangnya yang menjaganya atas perintah Allah} dari sesuatu yang bisa membinasakaannya sampai datang ajalnya lalu mereka tidak menjaganya lagi {Sesungguhnya Allah tidak mengubah keadaan suatu kaum hingga mereka mengubah apa yang ada pada diri mereka. Apabila Allah menghendaki terhadap suatu kaum suatu keburukan} azab dan kehancuran {maka tidak ada yang dapat menolaknya} tidak ada yang bisa menolaknya {dan sekali-kali tidak ada pelindung bagi mereka selain Dia} pelindung yang melindungi perkara mereka dan mencegah dari azab yang menimpa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Baginya,” yaitu bagi manusia “ada yang selalu mengikutinya bergiliran,” dari kalangan malaikat, mereka silih berganti di malam dan siang hari “di muka dan di belakangnya, mereka menjaganya atas perintah Allah,” maksudnya memelihara jasmani dan nyawanya dari setiap orang yang ingin berbuat buruk padanya. Mereka memelihara amalan-amalannya, selalu menyertainya terus menerus. Sebagaimana juga ilmu Allah meliputinya, maka Allah pun telah mengutus para malaikat penjaga kepada hamba-hambaNya, di mana hal itu menjadikan kondisi-konsdisi dan amalan-amalan mereka tidak tersembunyi, juga tidak dilupakan sedikit pun darinya. “Sesungguhnya Allah tidak merubah keadaan suatu kaum,” berupa kenikmatan, curahan kebaikan, dan kehidupan yang enak, “sehingga mereka merubah keadaan yang ada pada diri mereka sendiri,” dengan beralih dari keimanan kepada kekufuran, dari ketaatan menuju maksiat atau dari mensyukuri nikmat-nikmat Allah kepada mengingkarinya, maka Allah akan mencabut semua kenikmatan itu dari mereka. Begitu pula, jikalau para hamba merubah kondisi mereka, dari maksiat menuju ketaatan kepada Allah, niscaya Allah akan merubah kondisi yang menyelimuti mereka sebelumnya berupa kesengsaraan menuju kepada kebaikan, kebahagiaan, dan ghibtah (semangat iri dalam kebaikan) serta rahmat. “Dan apabila Allah menghendaki keburukan terhadap suatu kaum,” berupa siksa, perkara yang berat, serta hal yang mereka benci, maka sesungguhnya kehendakNya pasti terlaksana pada mereka. Karena “tidak ada yang dapat menolaknya,” tidak ada seorang pun yang mampu menghindarkan mereka darinya. “Dan sekali-kali taka da pelindung bagi mereka selain Dia,” yang menangani urusan-urusan mereka, mendatangkan hal-hal yang disukai bagi mereka dan menyingkirkan hal-hal yang dibenci mereka. Maka, hendaklah mereka berhati-hati agar tidak berkutat pada perkara-perkara yang dibenci oleh Allah, karena dikhawatirkan siksa Allah akan menimpa mereka, yang tidak bisa ditolak dari kaum yang telah berbuat jahat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَهُۥ مُعَقِّبَٰتٞ) lahuu mu’aqqibaat : para malaikat yang bergantian siang dan malam. (مِنۡ أَمۡرِ ٱللَّهِۗ) min amrillah : atas perintah dan izin Allah ta’ala. (لَا يُغَيِّرُ مَا بِقَوۡمٍ) laa yughayiru maa bi qaumin : tidak akan merubah apa yang dimiliki suatu kaum berupa kesehatan dan kenikmatan menjadi ujian dan azab. (مَا بِأَنفُسِهِمۡۗ) maa bianfusihim : berupa kebersihan dan kesucian iman dan ketaatan menjadi dosa dan kesalahan. (وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ ) wa maa lahum min duunihi miw waal : dan mereka tidak memiliki selain Allah yang dapat menunaikan urusan mereka dan menyelamatkan mereka dari azab. Makna ayat : Firman-Nya : (لَهُۥ مُعَقِّبَٰتٞ مِّنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦ يَحۡفَظُونَهُۥ) boleh dhamir (kata ganti) pada kata (لَهُۥ) kembali kepada (مُسۡتَخۡفِۢ بِٱلَّيۡلِ وَسَارِبُۢ بِٱلنَّهَارِ ) sehingga makna dari al-mu’aqqibaat adalah penjaga dan pengawal yang menjaga raja—atas izin Allah—menurut pandangan mereka. Namun jika Allah berkehendak baginya keburukan, maka tidak ada yang dapat menolaknya, dan ia tidak memiliki pelindung yang melindunginya dan menolongnya selain Allah. Kata ganti juga dapat kembali kepada Allah, sehingga makna dari al-mu’aqqibaat adalah para malaikat penjaga, para penulis kebaikan dan keburukan, sehingga makna (مِنۡ أَمۡرِ ٱللَّهِۗ) atas perintah dan izin dari Allah ta’ala. Firman-Nya : (إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوۡمٍ حَتَّىٰ يُغَيِّرُواْ مَا بِأَنفُسِهِمۡۗ) Allah mengabarkan tentang sunnah dari sunnah-sunnah-Nya yang telah berjalan pada makhluk-Nya, bahwa Dia tidak akan menghilangkan nikmat dari suatu kaum berupa kesehatan, keamanan, kelapangan karena keimanan dan amal saleh mereka hingga mereka mengganti apa yang jiwa mereka miliki berupa kebersihan dan kesucian dengan melakukan dosa dan tenggelam di dalamnya, sebagai hasil dari berpalingnya mereka dari kitab Allah, tidak peduli dengan syariat-Nya, tidak memperhatikan batasan-batasan-Nya, tenggelam di dalam syahwat, dan mengikuti jalan kesesatan. Firman-Nya : (وَإِذَآ أَرَادَ ٱللَّهُ بِقَوۡمٖ سُوٓءٗا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ) sebuah kabar dari-Nya, bahwa jika Dia menginginkan kepada suatu kaum, person, atau kelompok sebuah keburukan yaitu apa saja yang menyulitkan mereka berupa bala dan azab, maka tidak ada yang dapat menolaknya bagaimanapun dan pasti akan mengenai mereka, dan mereka tidak punya pelindung selain Allah yang mampu menghindarkan mereka dari azab, adapun permberian dari Allah seandainya mereka kembali kepada, memohon ampunan, dan bertaubat kepada-Nya, maka Dia akan menghilangkan dari mereka semua keburukan dan menjauhkan dari mereka azab. Pelajaran dari ayat : • Para penjaga dan pengawal bagi yang menggunakan mereka untuk menjaganya (tidak bisa menjaga kecuali) atas izin Allah, tidak pula bermanfaat menolak apa yang telah Allah tetapkan sama sekali. • Penetapan akidah bahwa setiap orang memiliki malaikat yang bergantian menjaganya siang dan malam seperti para pencatat yang mulia, penjaga manusia dari para setan dan jin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 11: Bagi setiap manusia ada beberapa malaikat yang menjaganya secara bergiliran di malam dan siang hari, dan ada pula beberapa malaikat yang mencatat amalan-amalannya. Namun yang dimaksud dalam ayat ini adalah malaikat yang menjaga secara bergiliran, yaitu malaikat hafazhah, baik menjaga badan maupun ruhnya, dari makhluk yang hendak berbuat buruk kepadanya seperti jin, manusia dan lainnya. Mereka juga menjaga semua amalnya. Allah tidak akan mengubah keadaan mereka, selama mereka tidak mengubah sebab-sebab kemunduran mereka. Ada pula yang menafsirkan, bahwa Allah tidak akan mencabut nikmat yang diberikan-Nya, sampai mereka mengubah keadaan diri mereka, seperti dari iman kepada kekafiran, dari taat kepada maksiat dan dari syukur kepada kufur. Demikian pula apabila hamba mengubah keadaan diri mereka dari maksiat kepada taat, maka Allah akan mengubah keadaanya dari sengsara kepada kebahagiaan. Seperti azab dan perkara yang tidak mereka inginkan. Yang akan menghindarkan azab itu. Oleh karena itu, hendaknya orang yang tetap berada di atas perbuatan yang dimurkai Allah berhati-hati jika nanti Allah timpakan siksaan yang tidak dapat ditolak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 11",
    "description": "Tidak saja mengetahui sesuatu yang tersembunyi di malam hari dan yang tampak di siang hari, Allah, melalui malaikat-Nya, juga mengawasinya dengan cermat dan teliti. Baginya, yakni bagi manusia, ada malaikat-malaikat yang selalu menjaga dan mengawasi-Nya secara bergiliran, dari depan dan dari belakangnya. Mereka menjaga dan mengawasinya atas perintah Allah. Sesungguhnya Allah yang mahakuasa tidak akan mengubah keadaan suatu kaum dari suatu kondisi ke kondisi yang lain, sebelum mereka mengubah keadaan diri menyangkut sikap mental dan pemikiranmereka sendiri. Dan apabila, yakni andaikata, Allah menghendaki keburukan terhadap suatu kaum'dan ini adalah hal yang mustahil bagi Allah'maka tak ada kekuatan apa pun yang dapat menolaknya dan tidak ada yang dapat menjadi pelindung bagi mereka selain dia. Melanjutkan penyebutan tanda-tanda kekuasaan-Nya pada ayatayat yang lalu, beberapa ayat berikut Allah berbicara tentang kilat, halilintar, mendung, dan air hujan. Allah berfirman, dialah Allah, tuhan yang mahakuasa, yang memperlihatkan kilat kepadamu, yakni seberkas cahaya yang memancar dan menghilang secara cepat, yang kadangkala menimbulkan ketakutan pada diri kamu, dan kadangkala menimbulkan harapan yang menggembirakan'yakni pertanda segera turun hujan. Dan dia pula yang menjadikan mendung yang akan menurunkan hujan."
  }
]