[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah Dzat yang memperlihatkan kepada kalian sebagian dari tanda kekuasaanNya, berupa kliat yaitu cahaya amat terang yang tampak di sela awan-awan mendung, lalu kalian takut halilintar-halilintar yang membakar menyambar kalian darinya, dan kalian amat berharap hujan turun bersamaan dengannya. Dan dengan kuasaNya, Allah menciptakan awan yang penuh dengan air yang banyak untuk kepentingan-kepentingan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah yang memperlihatkan kilat kepada kalian -wahai manusia-, dan Allah menyatukan dengannya pada diri kalian rasa takut kepada halilintar dan harapan turunnya hujan. Allah yang menciptakan awan yang berat karena mengandung air hujan di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah yang memperlihatkan kalian cahaya terang dari awan yang saling bertumpuk sehingga kalian takut dari suaranya yang keras, dan petir-petir yang membakar. Kemudian kalian berharap agar turun hujan yang membawa manfaat. Dialah yang menciptakan awan mendung yang pekat yang membawa air yang banyak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. خَوْفًا وَطَمَعًا (ketakutan dan harapan) Agar kalian benar-benar takut dan mengharapkan. Ketakutan bagi orang yang sedang bepergian akibat hujan yang mungkin membahayakannya, dan harapan bagi orang yang bermukim jika melihat kilat dari langit ia mengharapkan hujan. وَيُنشِئُ السَّحَابَ الثِّقَالَ(dan Dia mengadakan awan mendung) Yakni awan yang berat karena mengandung berjuta-juta ton air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah adalah Dzat yang memperlihatkan kepada kalian kilat (percikan cahaya di langit akibat gesekan benda-benda langit) untuk memberi peringatan tentang petir dan harapan terhadap turunnya hujan. Dan awan yang padat dan penuh dengan air"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang memperlihatkan kepada kalian kilat untuk membuat ketakutan} petir yang menyambar {dan harapan} untuk turunnya hujan {serta menjadikan} menjadikan {awan yang berat} yang membawa air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman, “Dialah Rabb yang memperlihatkan kilat kepadamu untuk menimbulkan ketakutan dan harapan,” menjadi sumber ketakutan karena kemunculan suara-suara guruh, kehancuran dan berbagai macam bahaya yang bisa menimpa sebagian buah-buahan dan lainnya, dan (menjadi sumber harapan) kebaikan dan manfaat darinya. “Dan Dia mengadakan awan mendung,” dengan curahan huan lebat yang mengandung manfaat bagi umat manusia dan negeri-negeri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (هُوَ ٱلَّذِي يُرِيكُمُ ٱلۡبَرۡقَ خَوۡفٗا) “Dialah yang memperlihatkan kepada kalian kilat untuk menimbulkan ketakutan,” terhadap petir dan (وَطَمَعٗا) harapan agar hujan turun (وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ) Dialah yang mengadakan, yaitu awan-awan tebal yang mengandung hujan"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 12: Seperti bagi mereka yang sedang bepergian. Seperti bagi mereka yang mukim. Di mana dengannya suatu negeri dan penduduknya memperoleh manfaat yang banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 12",
    "description": "Melanjutkan penyebutan tanda-tanda kekuasaan-Nya pada ayatayat yang lalu, beberapa ayat berikut Allah berbicara tentang kilat, halilintar, mendung, dan air hujan. Allah berfirman, dialah Allah, tuhan yang mahakuasa, yang memperlihatkan kilat kepadamu, yakni seberkas cahaya yang memancar dan menghilang secara cepat, yang kadangkala menimbulkan ketakutan pada diri kamu, dan kadangkala menimbulkan harapan yang menggembirakan'yakni pertanda segera turun hujan. Dan dia pula yang menjadikan mendung yang akan menurunkan hujan. Lazimnya, sambaran kilat akan diiringi oleh guruh. Dan guruh senantiasa bertasbih kepada Allah dengan memuji-Nya, demikian pula para malaikat karena takut kepada-Nya, dan Allah melepaskan halilintar yang kadangkala membakar apa yang ditemuinya, lalu Allah menimpakannya kepada siapa yang dia kehendaki melalui hukum sebab akibat yang telah diletakkan Allah di alam semesta. Sementara itu, walaupun bukti-bukti kekuasaan Allah tampak begitu nyata, namun mereka (orang-orang kafir) masih berbantah-bantahan dengan engkau, wahai nabi Muhammad, tentang Allah. Dan dia-lah tuhan yang mahakeras siksaan-Nya."
  }
]