[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya milik Allah semata seruan kepada tauhid “lailahaillalah”, sehingga tidak disembah dan tidak di seru kecuali Dia, sedang tuhan-tuhan sesembahan yang mereka sembah selain Allah, tidak dapat mengabulkan doa orang yang meminta kepadanya. Dan keadaan mereka itu bersama tuhan-tuhan sesembahan mereka adalah seperti keadaan orang yang dahaga yang membentangkan tangannya dari kejauhan untuk meraih air supaya sampai kemulutnya dan tidak sampai kepadanya. Dan tidaklah permintaan orang-orang kafir terhadap tuhan-tuhan sesembahan itu kecuali merupakan bentuk teramat jauhnya mereka dari kebenaran, lantaran mereka mempersekutukan sesuatu dengan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Hanya Allah semata pemilik hak untuk di esakan, tidak seorang pun berserikat dengan Allah di dalamnya. Berhala-berhala yang disembah oleh orang-orang musyrikin selain Allah tidak dapat mengabulkan permohonan orang-orang yang berdoa kepadanya dalam masalah apa pun. Doa mereka kepada berhala hanya seperti orang haus yang mengulurkan tangannya ke air lalu mengangkatnya ke mulutnya untuk dia minum dan air itu tidak pernah sampai ke mulutnya. Doa orang-orang kafir kepada berhala-berhala mereka hanya sia-sia dan jauh dari kebenaran, karena berhala-berhala itu tidak kuasa mendatangkan manfaat atau menolak mudarat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Bagi Allah dakwah kepada ketauhidan, sehingga tidak ada yang disembah selain Dia. Dan orang-orang yang menyembah dan berdoa kepada berhala-berhala dan patung-patung yang tidak dapat mengabulkan doa, seperti orang kehausan yang menjulurkan tangannya ke dalam air agar dia dapat memasukkan air ke dalam mulutnya namun dia tidak bisa, karena telapak tangan yang terbuka tidak dapat digunakan untuk mengambil air sampai ke mulutnya. Dan doa orang-orang yang mendustakan Allah itu hanya sia-sia dan kerugian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. لَهُۥ دَعْوَةُ الْحَقِّ ۖ (Hanya bagi Allah-lah (hak mengabulkan) doa yang benar) Doa yang dipanjatkan kepada-Nya ketika dalam keadaan takut adalah doa yang tulus dan benar, dan Allah Maha Kuasa untuk mengabulkannya. وَالَّذِينَ يَدْعُونَ مِن دُونِهِۦ لَا يَسْتَجِيبُونَ لَهُم بِشَىْءٍ(Dan berhala-berhala yang mereka sembah selain Allah tidak dapat memperkenankan sesuatupun bagi mereka) Adapun doa yang dipanjatkan orang-orang kafir kepada tuhan-tuhan selain Allah adalah doa yang mungkar yang tidak akan bermanfaat bagi mereka, sebab tuhan-tuhan tersebut tidak akan mampu mengabulkannya, seperti orang yang hendak mengambil air dengan kedua telapak tangan yang terbuka sehingga air itu tidak akan dapat mereka ambil, sebab air itu hanyalah benda mati yang tidak mengerti kebutuhan orang itu terhadapnya dan tidak memahami bahwa ia diminta agar sampai ke mulut orang tersebut. وَمَا هُوَ (padahal itu tidak dapat) Yakni air itu. بِبٰلِغِهِۦ ۚ( sampai ke mulutnya) Sampai ke dalam mulut orang yang menciduknya. وَمَا دُعَآءُ الْكٰفِرِينَ إِلَّا فِى ضَلٰلٍ (Dan doa (ibadat) orang-orang kafir itu, hanyalah sia-sia belaka) Yakni doa itu hanya akan pergi sia-sia, dan tidak akan memberi manfaat kepada mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Hanya milik Allah hak pengabulan doa, karena hanya Dia yang Maha kuasa atas pengabulan doa. Dan orang-orang yang menyembah dan berdoa kepada berhala, bukan kepada Allah, maka berhala-berhala itu tidak akan mengabulkan sedikitpun yang mereka minta, kecuali seperti pengabulan air bagi orang yang menegadahkan telapak tangannya dari kejauhan, dia meminta air itu mendatanginya supaya bisa sampai pada mulutnya, namun air itu tidak akan sampai pada mulut orang yang berdoa selama-lamanya. Dan doa orang-orang kafir dan peribadatan mereka kepada tuhan-tuhan mereka itu tidak lain kecuali hanya berada dalam kesia-siaan dan kerugian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi Allahlah seruan yang benar} Bagi Allah seruan untuk bertauhid {dan yang mereka seru selain Dia} selain Dia {tidak dapat mengabulkan apa pun bagi mereka, kecuali seperti orang yang membukakan kedua telapak tangannya ke dalam air} seperti memberi air kepada orang yang membuka kedua telapak tangannya dari kejauhan {agar sampai ke mulutnya, dan air itu tidak akan sampai ke mulutnya} dan air itu tidak sampai pada mulutnya {Tidaklah seruan orang-orang kafir itu kecuali dalam kesia-siaan} sia-sia dan merugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Maksudnya, hanya bagi Allah semata (hak mengabulkan) “doa yang benar,” yaitu beribadah kepadaNya saja, tidak ada sekutu bagiNya serta mengikhlaskan doa ibadah dan doa permintaan epadaNya. Maksudnya, sepatutnya seluruh ibadah doa, khauf (rasa takut), raja’ (rasa berharap), kecintaan, keinginan dan kekhawatiran serta taubah diarahkan hanya kepadaNya. Sebab aspek ketuhananNya adalah benar. Sementara sisi ketuhanan selainNya adalah batil. Maka, “berhala-berhala yang mereka sembah selain Allah,” yang berupa patung-patung dan tandingan-tandingan yang mereka jadikan sebagai sekutu bagi Allah, “tidak dapat memperkenankan sesuatu pun bagi mereka,” yaitu bagi orang yang menyeru dan menyembahnya, dengan (memberikan jawaban) yang sedikit atau banyak, baik berkaitan dengan urusan duniawi maupun urusan ukhrawi, “melainkan seperti oraang yang membukakan kedua telapak tangannya ke dalam air,” yang tidak bisa dijangkau oleh dua telapak tangannya karena letaknya yang jauh. “Supaya ampai,” dengan membentangkan tangannya ke air “ke mulutnya,” karena dia sedang kehausan. Saking hausnya, dia menyodorkan telapak tangan dan membukanya ke arah air yang mustahil sampai kepadanya. Maka air itu pun tidak bisa sampai kepadanya. Demikian juga, orang-orang kafir yang menyembah sesembahan lain bersama Allah, mereka (sesembahan-sesembahan itu) tidak bisa merealisasikan apapun bagi mereka, tidak bermanfaat bagi mereka pada kondisi-kondisi yang mana merekka benar-benar membutuhkannya. Sebab mereka makhluk-makhluk yang tidak memiliki apa pun, begitu pula orang-orang yang menyeru mereka dalam keadaan kekurangan. \"mereka tidak memiliki (kekuasaan) seberat zarrahpun di langit dan di bumi, dan mereka tidak mempunyai suatu sahampun dalam (penciptaan) langit dan bumi dan sekali-kali tidak ada di antara mereka yang menjadi pembantu bagi-Nya.\"(Saba:22) “Dan doa (ibadah) orang-orang kafir itu hanyalah sia-sia belaka,” karena kebatilan sesuatu yang mereka seru, selain Allah. Maka, ibadah dan doa mereka pun batil (sia-sia). Sebab, perantaranya pun (wasilah) batil disebabkan kebatilan tujuannya. Karena Allah adalah Raja, Pemilik kebenaran yang nyata, maka beribadah kepadaNya merupakan perkara yang benar, manfaatnya benar-benar mengalir kepada pelakunya di dunia dan akhirat. Permisalan doa orang-orang kafir kepada selain Allah dengan (permisalan) orang yang membentangkan dua telapak tangannya kea rah air agar supaya mencapai mulutnya adalah termasuk analogi yang terbaik. Itu merupakan permisalan dengan perkara yang muhal terjadi. Sebagaimana hal itu mustahil terjadi, maka perkara yang dianalogikan dengannya pun tidak mungkin terwujud. Pengaitan kepada perkara yang mustahil terjadi adalah termasuk cara penafian masalah yang paling mengena. Seperti yang diungkapkan Allah, \"Sesungguhnya orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, sekali-kali tidak akan dibukakan bagi mereka pintu-pintu langit dan tidak (pula) mereka masuk surga, hingga unta masuk ke lubang jarum. Demikianlah Kami memberi pembalasan kepada orang-orang yang berbuat kejahatan.\"(Al-A’raf:40)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ) lahuu da’watul haqq : milik Allah lah seruan yang nyata, yaitu: bahwa tidak ada tuhan yang berhak disembah kecuali Dia. (لِيَبۡلُغَ فَاهُ) liyablugha faah : agar mulutnya mencapai air (minum) (إِلَّا فِي ضَلَٰلٖ) illaa fii dhalaal : tidak berguna, tidak mencapai apa yang diharapkan selamanya. Makna ayat: Masih menjelaskan akidah tauhid dengan dalil dan bukti, Allah berfirman : (لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ) Milik Allah lah subhanahu wa ta’ala seruan yang benar, yaitu; bahwa Dia adalah sesembahan Yang Benar yang tidak ada tuhan yang berhak disembah kecuali Dia. Adapun sesembahan selain-Nya, maka penggunaan kata ilaah (tuhan) adalah untuk menafikan (menghapus), sehingga patung-patung dan berhala serta segala sesuatu yang disembah selain Allah maka penggunaan kata ilaah untuk mereka adalah hal yang batil, maka menyeru kepada peribadatannya adalah batil, adapun seruan yang benar adalah hanya milik Allah semata. Firman-Nya : (وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ) Orang-orang yang menyeru selain dari Allah, berupa sesembahan-sesembahan (لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ) mereka tidak akan memberikan apapun dari yang mereka minta (إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ) kecuali seperti orang yang menjulurkan tangannya ke air, dan air itu ada di dasar sumur, tangannya tidak sampai kepada air, tidak pula air itu sampai ketangannya sedangkan ia dalam keadaan haus, ia terus seperti itu hingga akhirnya ia binasa karena kehausan. Inilah perumpamaan orang yang beribadah kepada selain Allah ta’ala dengan berdoa kepadanya, menyembelih, nadzar, takut, atau berharap, maka ia tidak akan mendapatkan jawaban, sia-sia usahanya, dan tidak akan mendapatkan apapun kecuali neraka dan kerugian, itulah makna dari firman-Nya ta’ala (وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ) kebatilan dan sia-sia. Pelajaran dari ayat : • Seruan yang benar hanya milik Allah, Dialah sesembahan yang benar tidak ada sesembahan yang berhak disembah selain-Nya, tidak ada rabb selain-Nya. • Terhalangnya orang-orang musyrik dari hasil do’a dan ibadah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 14: Yakni Dialah Allah Tuhan yang segala ibadah sepatutnya hanya ditujukan kepada-Nya, seperti doa, takut dan cemas, cinta dan harap, tawakkal, menyembelih, ruku’ dan sujud, dsb. karena ketuhanan-Nya adalah benar, sedangkan ketuhanan selain-Nya adalah batil. Sedikit maupun banyak, terkait dengan urusan dunia maupun akhirat. Orang-orang yang berdoa kepada berhala dimisalkan seperti orang yang mengulurkan telapak tangannya yang terbuka ke air agar air sampai ke mulutnya. Hal ini tidak mungkin terjadi karena telapak tangan yang terbuka tidak dapat menampung air. Ada pula yang menafsirkan, bahwa orang yang berdoa kepada berhala seperti orang yang kehausan mengulurkan tangannya ke bawah sumur sedangkan airnya berada jauh darinya, dan sudah pasti air itu tidak akan sampai ke mulutnya. Demikianlah keadaan orang-orang kafir, di saat mereka membutuhkan bantuan, berhala-berhala yang mereka sembah tidak dapat mengabulkan permintaan mereka, karena berhala itu sendiri fakir, tidak memiliki apa-apa meskipun seberat biji sawi. Atau ibadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 14",
    "description": "Allah mahakuasa dalam menciptakan dan mengatur alam semesta. Keluasan ilmu Allah juga tak terbatas. Karena itu, hanya kepada-Nyalah seharusnya manusia memanjatkan doa. Hanya kepada Allah doa yang benar untuk dimohonkan. Berhala-berhala yang mereka (kaum kafir) sembah dan agungkan selain Allah tidak akan dapat mengabulkan permintaan apa pun bagi mereka. Keadaan mereka yang memohon kepada berhala tidak ubahnya seperti orang yang membukakan kedua telapak tangannya ke dalam air di dalam sumur agar air itu dapat diciduknya untuk dia arahkan sampai ke mulutnya. Padahal telapak tangannya yang terbuka itu tidak sampai ke kedalaman air sumur itu, sehingga air tersebut tidak akan sampai ke mulutnya. Dan doa orang-orang kafir itu hanyalah doa yang sia-sia belaka. Hanya kepada Allah-lah manusia pantas memanjatkan doa. Karena itu, hanya kepada dia pula seharusnya makhluk bersujud dan merendahkan diri. Dan semua makhluk sujud kepada Allah, baik makhluk yang ada di langit maupun makhluk yang ada di bumi, baik dengan sadar dan kemauan sendiri, maupun dengan cara terpaksa; dan bersujud pula bayang-bayang mereka, pada waktu pagi dan petang hari."
  }
]