[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepada Allah semata bersujudnya dalam keadaan tunduk dan patuh setiap yang ada di langit dan dibumi. Maka orang-orang mukmin itu tunduk kepadaNya dengan suka rela, sedang orang-orang kafir tunduk dengan dipaksa, sebab mereka menyombongkan diri, enggan untuk beribadah kepadaNya. Adapaun keadaan dan fitrah mereka justru mendustakan mereka terkait hal tersebut. Begitu juga bayang-bayang makhluk-makhluk tunduk kepada keagunganNya, bergerak dengan iradahNya di permulaan siang dan penutup hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Hanya kepada Allah semata seluruh apa yang ada di langit dan di bumi tunduk dengan bersujud, orang Mukmin dan orang kafir dalam hal ini adalah sama, hanya saja orang Mukmin tunduk dan sujud kepada Allah dengan suka rela, sementara orang kafir tunduk karena terpaksa. Fitrah orang mukmin membisikinya untuk tunduk kepada-Nya secara suka rela. Hanya kepada-Nya semua bayangan makhluk tunduk di pagi dan petang hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Dan hanya kepada Allah penduduk langit dan bumi tunduk dan patuh; orang-orang yang beriman tunduk dengan suka rela, sedangkan orang-orang kafir tunduk dengan terpaksa pada saat mereka tertimpa musibah; demikian pula orang-orang zalim. Dan segala makhluk dan bayangannya bersujud kepada Allah dengan memanjang di tanah pada waktu pagi dan sore hari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَ ِللهِ يَسْجُدُ مَن فِى السَّمٰوٰتِ وَالْأَرْضِ (Hanya kepada Allah-lah sujud (patuh) segala apa yang di langit dan di bumi) Yang dimaksud dengan sujud disini adalah ketaatan kepada perintah dan aturan-Nya dalam diri makhluk-makhluk tersebut seperti kesehatan dan penyakit, hidup dan mati, dan kaya dan miskin. طَوْعًا وَكَرْهًا(baik dengan kemauan sendiri ataupun terpaksa) Orang-orang kafir patuh kepada aturan Allah dengan terpaksa, sedangkan orang-orang beriman patuh dengan penuh kerelaan sehingga mereka menyembah Allah sebagaimana yang Dia perintahkan. وَظِلٰلُهُمْ بِالْغُدُوِّ وَالْاٰصَالِ((dan sujud pula) bayang-bayangnya di waktu pagi dan petang hari) Yakni bayangan manusia yang selalu mengikutinya, ikut bersujud dengan perintah Allah. Allah menyebutkan waktu pagi dan petang karena di waktu tersebut bayangan tampak lebih jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Dan hanya kepada Allahlah seluruh yang ada di langit dan bumi itu tunduk karena taat, yaitu orang-orang yang beriman pada waktu senang dan susah, atau karena terpaksa, yaitu orang-orang kufur pada saat menderita dan susah. Sel-sel mereka juga tunduk mengikuti tunduknya pemiliknya di permulaan siang dan waktu setelah ashar sampai maghrib. Dua waktu ini lebih baik dipenuhi dengan dzikir karena bertambahnya bayang-bayang yang tampak pada saat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya kepada Allahlah siapa saja yang ada di langit dan di bumi bersujud, karena sukarela maupun terpaksa, begitu juga bayang-bayang mereka} bayang-bayang orang yang memiliki bayangan di antara mereka {pada waktu pagi dan petang} di awal dan akhir siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Segala sesuatu yang berada di dalam langit dan bumi tunduk patuh kepada Rabbnya, sujud kepadaNya “baik dengan kemauan sendiri ataupun terpaksa,” maka sikap sukarela adalah bagi orang yang melakukan sujud dan tunduk patuh atas keinginan sendiri sebagaimana (tunduknya) kaum Mukminin. Sementara keterpaksaan adalah bagi oranag yang menyombongkan diri dari beribadah kepada Rabbnya. Padahal kondisi dan fitrahnya mendustakannya dalam hal tersebut. “Dan bayang-bayangnya di waktu pagi dan waktu petang sujud pula,” dan bayang-bayang para makhluk di permulaan hari dan penghujungnya bersujud pula. Cara bersujud masing-masing makhluk sesuai dengan kondisinya sebagaimana yang difirmankan Allah, \"Dan tak ada suatupun melainkan bertasbih dengan memuji-Nya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.\" (Al-Isra:44). Apabila setiap makhluk telah bersujud kepada Rabbnya, baik dengan sukarela atau terpaksa, maka Dia-lah sesembahan yang benar, Dzat yang disembah lagi terpuji dengan sebenarnya. Maka, label ketuhanan baagi selainnya adalah batil. Olleh karenanya, Dia menyebutkan kebatilan ketuhanan bagi selainNya, dan mengetengahkan sejumlah buktinya dengan berfirman,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ) bil ghuduwwi wal aashaal : pada al-bukr jamak dari bukrah (pagi hari) dan al-‘asyaayaa jamak dari ‘asyiyyah (malam hari). Makna ayat : Firman-nya : (وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ) yaitu: para malaikat (وَٱلۡأَرۡضِ) dari kalangan orang yang beriman sujud kepada-Nya dengan senang hati dan munafik sujud secara terpaksa, (وَظِلَٰلُهُم) bayangan mereka juga ikut bersujud (بِٱلۡغُدُوِّ) di awal siang (وَٱلۡأٓصَالِ) di akhir siang, dan makna dari ayat yang mulia ini: Jika orang-orang kafir enggan sujud, tidak mau taat beribadah hanya kepada Allah ta’ala, maka sesungguhnya senantiasa sujud kepada Allah, siapapun yang ada di langit, berupa malaikat, dan di bumi, berupa jin dan manusia yang beriman, mereka sujud dengan senang hati, orang kafir mereka akan bersujud jika dipaksa, orang munafik mereka sujud dengan berat hati dan terpaksa, dan bayangan mereka sujud kepada-Nya di pagi hari dan petang sebagaimana mereka tunduk kepada ketentuan Allah dan hukum-Nya sehingga mereka tidak bias keluar darinya bagaimananpun juga. Dia lah yang telah menciptakan mereka, membentuk mereka sesuai kehendak-Nya, memberikan mereka rizki, dan mematikan mereka kapanpun ia kehendaki, maka sujud, ketundukkan, serta ruku’ apa yang pantas untuk ini semua? Pelajaran dari ayat : • Makhluk seluruhnya sujud kepada Allah baik ia dengan senang hati atau dengan terpaksa, karena seluruhnya tunduk dan patuh di bawah hukum Allah dan pengaturan-Nya. • Disyariatkan sujud bagi qari’ dan pendengar ketika dibacakan ayat (وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩), disunnahkan juga dalam keadaan suci, menghadap kiblat, dan bertakbir ketika turun sujud dan naik darinya, dan tidak perlu salam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 15: Seperti halnya orang-orang mukmin. Seperti halnya orang-orang munafik. Segala sesuatu sujud sesuai keadaannya masing-masing. Jika semua semakhluk bersujud kepada-Nya baik dengan senang atau terpaksa, maka dapat diketahui bahwa Allah Dialah Tuhan yang sebenarnya, yang berhak disembah dan dipuji dengan sebenarnya, dan bahwa penuhanan selain-Nya adalah batil. Oleh karena itu, pada ayat selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan kebatilannya dan menyebutkan buktinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 15",
    "description": "Hanya kepada Allah-lah manusia pantas memanjatkan doa. Karena itu, hanya kepada dia pula seharusnya makhluk bersujud dan merendahkan diri. Dan semua makhluk sujud kepada Allah, baik makhluk yang ada di langit maupun makhluk yang ada di bumi, baik dengan sadar dan kemauan sendiri, maupun dengan cara terpaksa; dan bersujud pula bayang-bayang mereka, pada waktu pagi dan petang hari. Ayat-ayat yang lalu telah membuktikan betapa Allah mahakuasa, maha mengetahui, dan mahaperkasa. Melalui ayat berikut Allah lalu meminta nabi Muhammad mengajukan pertanyaan kepada orangorang kafir. Katakanlah, siapakah tuhan pemilik langit dan bumi' katakanlah, wahai nabi Muhammad, Allah. Katakanlah lagi kepada mereka, pantaskah kamu, wahai penduduk mekah, mengambil berhala sebagai pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri' katakanlah, wahai nabi, samakah orang yang buta dengan yang dapat melihat' atau samakah keadaan yang gelap gulita dengan keadaan yang terang benderang' apakah mereka, yakni orang yang menyekutukan Allah, menjadikan pula sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya, sehingga kedua ciptaan itu serupa menurut pandangan mereka' katakanlah, Allah adalah pencipta segala sesuatu, tidak akan pernah ada yang wujud kecuali dia ciptakan, dan dia tuhan yang maha esa, mahaperkasa."
  }
]