[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”siapakah pencipta langit dan bumi dan pengaturnya?” Maka katakanlah, ”Allah dialah pencipta lagi pengatur keduanya, dan kalian mengakuinya.” Kemudian katakanlah kepada mereka untuk membungkam hujjah mereka, ”apakah kalian menjadikan selain Allah sebagi sesembahan-sesembahan bagi kalian, padahal mereka tidak berkuasa memberikan manfaat bagi diri sendiri dan membahayakannya, apalagi mendatangkan manfaat atau menimpakan mudarat terhadap diri kalian, dan kalian tinggalkan beribadah kepada Dzat yang menguasainya?” katakanlah (wahai rasul), kepada mereka, ”apakah menurut kalian sama antara orang kafir yang seperti orang buta dengan orang mukmin yang menyerupai orang yang dapat melihat? atau apakah sama menurut kalian antara kekafiran yang menyerupai kegelapan-kegelapan dan keimanan yang serupa dengan cahaya? ataukah sesungguhnya pembela-pembela mereka yang mereka jadikan sebagai sekutu-sekutu bagi Allah dapat menciptakan seperti ciptaan Allah, sehingga menjadi samar perbedaan antara hasil ciptaan sekutu-sekutu itu dan ciptaan Allah, lalu mereka meyakini sekutu-sekutu Allah tersebut berhak untuk di sembah?” katakanlah kepada mereka (wahai rasul), ”Allah pencipta segala sesuatu dari tidak ada sebelumnya. Dialah semata yang berhak diibadahi. Dialah yang maha Esa lagi Mahaperkasa yang berhak dipertuhankan dan disembah, bukan berhala-berhala dan patung-patung yang tidak dapat menimpakan mudarat dan mendatangkan manfaat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Katakanlah -wahai Rasul- kepada orang-orang kafir yang menyembah bersama Allah selain-Nya, siapakah Pencipta langit dan bumi dan mengatur urusan keduanya? Katakanlah -wahai Rasul-, Allah yang menciptakan dan mengatur urusan keduanya. Kalian mengakui hal itu. Katakanlah kepada mereka -wahai Rasul-, apakah kalian mengangkat untuk diri kalian sesembahan yang lemah selain Allah, tidak kuasa mendatangkan manfaat dan tidak pula menghilangkan mudarat dari diri mereka, jadi mana mungkin mereka mampu melakukan itu untuk selain mereka? Katakanlah kepada mereka -wahai Rasul-, apakah sama orang kafir yang buta penglihatannya dengan orang mukmin yang melihat lagi mendapat petunjuk? Apakah sama kekufuran yang merupakan kegelapan dengan iman yang merupakan cahaya? Apakah mereka mengangkat sekutu-sekutu bagi Allah -Subḥānahu- dalam penciptaan yang menciptakan seperti yang Allah ciptakan, sehingga mereka tidak bisa membedakan antara ciptaan Allah dengan ciptaan sekutu-sekutu mereka? Katakanlah kepada mereka -wahai Rasul- hanya Allah semata Pencipta segala sesuatu, tidak ada sekutu bagi Allah dalam penciptaan, Dia lah Pemilik tunggal hak ulūhiyyah yang berhak untuk disembah semata, Allah Mahakuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Allah memerintahkan rasulullah untuk mengingkari orang-orang musyrik dan mengolok mereka dengan beberapa pertanyaan dan jawaban. Katakanlah kepada mereka, siapa yang menciptakan langit dan bumi yang tujuh? Katakanlah, Allah yang menciptakan. Katakanlah kepada mereka, Apakah kalian membuat sekutu-sekutu bagi Allah yang kalian sembah, sedangkan mereka tidak dapat memberi manfaat atau menjauhkan mudharat bagi diri mereka sendiri, maka bagaimana mereka akan melakukannya untuk orang lain? Katakanlah kepada mereka, Apakah menurut kalian sama antara orang kafir dan orang beriman? Dan antara kegelapan kesesatan dan cahaya petunjuk? Apakah orang-orang musyrik mengangkat tuhan-tuhan yang dapat menciptakan makhluk-makhluk yang diciptakan Allah sehingga mereka merasa bingung dan tidak dapat membedakan mana yang diciptakan Allah dan mana yang diciptakan tuhan-tuhan mereka? Katakanlah kepada mereka, Allah menciptakan seluruh makhluk dari ketidakadaan, hanya Dia yang memiliki sifat ketuhanan, uluhiyah dan rububiyah, kepadanya seluruh makhluk taat dan tunduk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قُلْ مَن رَّبُّ السَّمٰوٰتِ وَالْأَرْضِ (Katakanlah: “Siapakah Tuhan langit dan bumi?”) Allah memerintahkan Rasul-Nya agar bertanya kepada orang-orang kafir. قُلِ اللهُ ۚ( Jawabnya: “Allah”) Dia menjawab sendiri pertanyaan itu dengan jawaban “Allah”. Seakan-akan dia menghikayatkan jawaban mereka dan apa yang mereka percayai. قُلْ أَفَاتَّخَذْتُم مِّن دُونِهِۦٓ أَوْلِيَآءَ(Katakanlah: “Maka patutkah kamu mengambil pelindung-pelindungmu dari selain Allah) Yakni, lalu mengapa kalian menjadikan pelindung-pelindung yang lemah selain Allah bagi diri kalian. لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًا (padahal mereka tidak menguasai kemanfaatan bagi diri mereka sendiri) Tidak dapat memberi manfaat bagi diri mereka dengan pelindung-pelindung tersebut. وَلَا ضَرًّا ۚ (dan tidak (pula) kemudharatan) Kemudharatan yang dapat mereka timpakan kepada orang lain, atau menghindarkan mudharat itu dari diri mereka. قُلْ هَلْ يَسْتَوِى الْأَعْمَىٰ( Katakanlah: “Adakah sama orang buta) Yakni buta dalam agama mereka, yakni orang yang kafir. وَالْبَصِيرُ(dan yang dapat melihat) Yakni orang yang beriman dan mengesakan Allah. Orang pertama tidak mengetahui kewajibannya sebagai hamba, sedangkan orang kedua mengetahui hal tersebut. أَمْ هَلْ تَسْتَوِى الظُّلُمٰتُ وَالنُّورُ ۗ( atau samakah gelap gulita dan terang benderang) Yakni antara kekafiran dan keimanan. فَتَشٰبَهَ الْخَلْقُ عَلَيْهِمْ ۚ (sehingga kedua ciptaan itu serupa menurut pandangan mereka) Mereka mensekutukan Allah dengan patung-patung dan lainnya, padahal sekutu-sekutu itu tidak dapat menciptakan apapun, lalu bagaimana mereka tidak dapat membedakan antara keduanya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai Nabi, katakanlah kepada orang-orang musyrik kaummu: “Siapakah yang menciptakan langit dan bumi, dan mengatur urusan-urusannya?” dan jika mereka tidak bisa menjawab, maka memang mereka tidak memiliki jawaban, kecuali kamu ucapkan: “Allah adalah Dzat yang Maha Pencipta” Katakanlah kepada mereka: “Lalu bagaimana bisa kalian mengambil berhala sebagai tuhan yang kalian sembah selain Dia, yang mana tidak bisa memberi manfaat bagi kalian dan melindungi kalian dari keburukan, dan kalian tinggalkan Dzat yang Merajai langit dan bumi?” Katakanlah kepada mereka: “Apakah sama antara orang kafir yang tidak tahu apa-apa dengan orang mukmin yang berpengetahuan, dan apakah sama kegelapan kekufuran dan keimanan? Itu tidak sama,” Apakah orang-orang musyrik itu membuat sekutu-sekutu bagi Allah yang bisa menciptakan sesuatu sebagaimana Allah menciptakan, sehingga layak untuk disembah layaknya Allah? Tidak mungkin mereka bisa membedakan dua ciptaan. Katakanlah kepada mereka: “Hanya Allahlah yang Maha Menciptakan setiap sesuatu. Dialah satu-satunya yang Tuhan yang berada di atas segala sesuatu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Siapakah Tuhan langit dan bumi” Katakanlah,“Allah” Katakanlah,“Pantaskah kalian menjadikan selain Dia sebagai pelindung yang tidak mampu mendatangkan manfaat maupun mudarat bagi dirinya sendiri” Katakanlah,“Apakah sama orang yang buta dengan orang yang dapat melihat. Atau samakah kegelapan dengan cahaya, Atau apakah mereka menjadikan sekutu-sekutu bagi Allah yang (diyakini) dapat menciptakan sesuatu seperti ciptaanNya sehingga kedua ciptaan itu mirip menurut mereka”} lalu ciptaan para sekutu mereka itu bercampur dengan ciptaan Allah menurut mereka {Katakanlah,“Allah pencipta segala sesuatu dan Dialah Yang Maha Esa lagi Maha perkasa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya, ‘Katakanlah kepada orang-orang yang menyekutukan berhala-berhala dan sesembahan-sesembahan tandingan lainnya dengan Allah, yang mana mereka mencintai sesembahan-sesembahan itu layaknya kecintaan mereka kepada Allah, mempersembahkan bermacam-macam bentuk qurban (untuk mendekatkan diri kepada Allah) dan ibadah baginya. Apakah akal pikiran kalian telah tumpul sehingga mendaulat selain Allah sebagai wali (penolong) yang mereka agungkan dengan ibadah, padahal mereka itu tidak patut untuk diperlakukan demikian? Mereka (sesembahan selain Allah) itu “mereka tidak menguasai kemanfaatan dan tidak (pula) kemudaratan bagi diri mereka sendiri,” dan kalian mengesampingkan pertolongan dari Dzat yang sempurna Nama-nama dan sifat-sifatNya, Pemilik semua makhluk hidup dan benda mati. Di TanganNya-lah hak penciptaan, pengaturan, pemberian manfaat dan pengarahan bahaya. Maka tidak sama, ibadah kepada Allah semata dengan ibadah kepada tuhan yang disekutukan dengan Allah, sebagaimana tidak sama orang buta dengan orang yang bisa melihat, juga sebagaimana tidak “sama gelap gulita dengan terang benderang.” Apabila mereka mempunyai unsur keragua –raguan serta ketidakjelasan sehingga mengangkat beberapa sekutu bagiNya, dengan beranggapan bahwa sekutu-sekutu itu mampu menciptakan seperti penciptaan Allah, dan sanggup berbuat apa saja seperti yang diperbuat Allah, maka singkirkanlah kesimpangsiuran dan kerancuan ini dari mereka dengan bukti yang menunjukkan ketauhidan Allah dengan keesaanNya dan katakanlah kepada mereka, “Allah-lah pencipta segala sesuatu.” Sungguh merupakan perkara mustahil, sesuatu bisa menciptakan dirinya sendiri. Begitu pula, termasuk hal yang tidak mungkin terjadi, sesuatu muncul tanpa pencipta. Maka akan teridentifikasilah bahwa makhluk itu memiliki Pencipta yang menciptakan, tidak ada sekutu bagiNya dalam penciptaan. Karena Dia-lah Yang Maha Esa lagi Mahaperkasa. Tidak ada keesaan dan keperkasaan kecuali bagi Allah semata. Seluruh makhluk, masing-masing saling menundukkan makhluk lainnya dengan kegagahannya. Kemudian di atas sang penakluk tadi terdapat Dzat Yang Maha Penakluk yang lebih kuat darinya, sampai berakhir kepada keperkasaan Dzat Yang Maha Esa lagi Mahaperkasa. Keperkasaan dan keesaan, dua sifat yang saling berkolerasi yang mesti dimiliki oleh Allah saja, maka jelaslah sebuah keniscayaan, ditinjau dari sudut nalar akal bahwa segala sesuatu yang diseru selain Allah, tidak mempunyai sedikit pun andil dalam penciptaan makhluk-makhluk. Dengan berdasarkan itu, maka ibadah kepadanya menjadi sebuah kebatilan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (قُلۡ مَن رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) Siapakah yang menciptakan keduanya, pemilik, dan pengatur perkara yang ada di dalamnya? Kemudian Dia memerintahkan rasul-Nya untuk mendahului mereka dalam menjawab (قُلِ ٱللَّهُۚ) karena tidak ada jawaban bagi mereka selain Dia, dan setelah mereka meyakini bahwa Rabb yang benar adalah Allah, Dia memperintahkan rasul-Nya shallahu ‘alaihi wa sallam untuk mengatakan kepada mereka mencela dan memperingatkan mereka (قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦٓ أَوۡلِيَآءَ) apakah kalian mencari selain dari-Nya pelindung-pelindung yaitu, sekutu-sekutu yang mereka tidak mampu memberikan manfaat untuk diri mereka tidak pula keburukan, terlebih lagi memberikan kalian kebaikan atau menolak bahaya dari kalian, kemana perginya akal kalian, wahai orang-orang musyrik!? Untuk menjelaskan lebih gamblang dan penetapan hujjah dan bukti atas wajibnya tauhid dan batilnya syirik dan membuat tandingan untuk Allah, Dia memerintahkan rasul-Nya untuk berkata kepada mereka, (هَلۡ يَسۡتَوِي ٱلۡأَعۡمَىٰ وَٱلۡبَصِيرُ أَمۡ هَلۡ تَسۡتَوِي ٱلظُّلُمَٰتُ وَٱلنُّورُۗ) “Apakah sama antara orang yang buta dengan yang melihat atau apakah sama antara kegelapan dan cahaya?” Dan jawabannya tentu tidak, bagaimana mungkin sama antara orang yang beriman dan orang yang kafir? Bagaimana mungkin petunjuk sama dengan kesesatan? Maka seorang mukmin menyembah Allah ta’ala berdasarkan ilmu, serta mengetahui bahwa Dia lah Yang Menciptakan, Yang Memberi rizki, Yang Mengetahui rahasia dan perkataan rahasianya, dan Dia pula yang mengkabulkan doa yang berdoa kepada-Nya, mengutus kepada mereka rasul-Nya, menurunkan kepadanya kitab-Nya, adapun orang yang kafir dan musyrik mereka menyembah makhluk dari makhluk-makhluk Allah mereka tidak mampu memberikan manfaat dan keburukan untuk diri mereka sendiri, terlebih kepada penyembahnya, tidak pula mereka mendengar seruan mereka, dan menjawab do’a mereka. seorang mukmin menyembah Allah dengan apa yang telah disyariatkan berupa ibadah-ibadah dan perintah berupa ketaatan dan pendekatan diri kepada Allah, adapun orang kafir dan musyrik menyembah hal yang batil dengan hawa nafsu mereka dan meniti jalan kesesatan dalam kehidupan mereka. Firman-Nya : (أَمۡ جَعَلُواْ لِلَّهِ شُرَكَآءَ خَلَقُواْ كَخَلۡقِهِۦ فَتَشَٰبَهَ ٱلۡخَلۡقُ عَلَيۡهِمۡۚ) bahkan mereka menjadikan untuk Allah tandingan-tandingan yang mereka menciptakan ciptaan yang persis seperti ciptaan Allah, sehingga ciptaan mereka membuat rancu pikiran orang-orang musyrik sehingga mereka menyembah tandingan-tandingan tersebut, dengan prasangka bahwa sekutu-sekutu tersebut mampu menciptakan seperti ciptaan Allah? Maka jawabannya adalah tidak, mereka tidak akan menciptakan dan tidak akan mampu menciptakan seekor lalat sekalipun, bagaimana mungkin selainnya. Oleh karena itu, bagaimana mungkin peribadahan terhadap berhala tersebut benar, sedangkan ia tidak mampu menciptakan sesuatu pun? Firman-Nya : (قُلِ ٱللَّهُ خَٰلِقُ كُلِّ شَيۡءٖ وَهُوَ ٱلۡوَٰحِدُ ٱلۡقَهَّٰرُ) katakanlah wahai Rasul, kepada orang-orang kafir dan musyrik ketika mereka telah mengakui bahwa tuhan-tuhan mereka tidak mampu menciptakan sesuatu, katakanlah kepada mereka: Allah lah Pencipta segala sesuatu, Dialah Yang Maha Esa, tidak ada sekutu, tandingan, dan yang menyerupai-Nya, Yang Maha Kuat atas setiap yang sombong, Yang Maha Merendahkan para penentang dan orang kafir, hanya Dialah yang pantas untuk ditaati, beriman kepada-Nya adalah petunjuk dan kufur ingkar kepada-Nya adalah kesesatan. Pelajaran dari ayat : • Batilnya syirik, karena tidak ada dalil yang menjelaskannya baik dari akal ataupun naql (Al-Qur’an dan Hadits). • Wajib beribadah hanya kepada Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 16: Kepada orang-orang yang menyekutukan Allah dengan patung dan berhala, di mana mereka arahkan kurban dan ibadah kepada patung dan berhala itu. Kalau pun mereka tidak mengucapkannya, maka tidak ada jawaban selain itu. Seperti halnya patung dan berhala. Dan kamu malah meninggalkan yang berkuasa memberikan manfaat dan menolak mudharrat. Pertanyaan ini merupakan pertanyaan celaan. Yakni samakah orang kafir dengan orang mukmin? Atau samakah kekafiran dengan keimanan? Samakah beribadah kepada makhluk yang lemah dengan beribadah kepada al Khaliq (Pencipta) yang memiliki nama dan sifat yang sempurna, yang menguasai makhluk hidup hidup dan makhluk yang mati, yang di Tangan-Nya mencipta, mengatur, memberi manfaat dan menolak bahaya? Tentu tidak sama, sebagaimana kegelapan dengan cahaya tidak sama. Padahal kenyataannya sekutu-sekutu itu tidak mampu mencipta, dan lagi mereka dicipta. Tidak ada sekutu bagi-Nya dalam mencipta. Oleh karena hanya Dia yang menciptakan segala sesuatu, maka Dia pula yang berhak disembah saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 16",
    "description": "Ayat-ayat yang lalu telah membuktikan betapa Allah mahakuasa, maha mengetahui, dan mahaperkasa. Melalui ayat berikut Allah lalu meminta nabi Muhammad mengajukan pertanyaan kepada orangorang kafir. Katakanlah, siapakah tuhan pemilik langit dan bumi' katakanlah, wahai nabi Muhammad, Allah. Katakanlah lagi kepada mereka, pantaskah kamu, wahai penduduk mekah, mengambil berhala sebagai pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri' katakanlah, wahai nabi, samakah orang yang buta dengan yang dapat melihat' atau samakah keadaan yang gelap gulita dengan keadaan yang terang benderang' apakah mereka, yakni orang yang menyekutukan Allah, menjadikan pula sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya, sehingga kedua ciptaan itu serupa menurut pandangan mereka' katakanlah, Allah adalah pencipta segala sesuatu, tidak akan pernah ada yang wujud kecuali dia ciptakan, dan dia tuhan yang maha esa, mahaperkasa. Ayat berikut merinci kekuasaan Allah yang tidak dimiliki oleh berhala sesembahan orang-orang musyrik mekah. Allah telah menurunkan dalam bentuk curahan air hujan dari langit, maka mengalirlah ia, yakni air hujan yang dicurahkan itu, di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat yang beraneka ragam, ada pula buihnya seperti buih arus itu. Demikianlah Allah membuat perumpamaan tentang mana yang benar dan mana yang batil. Adapun buih, lambang dari kebatilan, akan hilang sebagai sesuatu yang tidak ada gunanya; tetapi kebenaran adalah sesuatu yang bermanfaat bagi manusia, dan manfaat itu akan tetap ada di bumi. Demikianlah Allah membuat perumpamaan bagi orang-orang yang mau berpikir."
  }
]