[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah membuat perumpamaan untuk yang haq dan yang batil dengan air yang diturunkanNya dari langit, lalu mengalirlah air di lembah-lembah di bumi karenanya, sesuai dengan kecil dan luasnya. Lalu aliran air mengalir membawa buih-buih yang mengambang di permukaan tanpa ada manfaatnya sama sekali. Dan Allah juga membuat perumpamaan lain, yaitu logam-logam mulia yang mereka panasi dengan api untuk melelehkannya demi mendapatkan perhiasan, seperti pada tambang emas, perak, atau demi mencari manafat-manfaat lain yang mereka pergunakan seperti dalam tambang tembaga, lalu keluarlah darinya material buruk yang tidak ada gunanya seperti halnya buih yang ikut bersama air. Seperti inilah Allah membuat perumpamaan untuk (menggambarkan) kebenaran dan kebatilan; dimana yang batil adalah bagaikan buih air yang menguap begitu saja atau dicampakan, karena ia samasekali tidak memiliki manfaat. Dan kebenaran itu bak air murni dan logam-logam mulia yang murni, akan bertahan dimuka bumi untuk dimanfaatkan orang. Sebagaimana Dia menerangkan kepada kalian perumpamaan-perumpamaan ini, demikian pula Dia mengadakan perumpamaan itu bagi sekalian manusia, supaya kebenaran tampak jelas bedanya dari kebatilan dan begitu juga hidayah dari kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Allah membuat perumpamaan bagi terkikisnya kebatilan dan kelanggengan kebenaran dengan air hujan yang turun dari langit sehingga lembah-lembah mengalirkan airnya, masing-masing dengan kadarnya, besar dan kecilnya, lalu air banjir dari hujan itu membawa buih dan busa di permukaannya. Allah membuat perumpamaan lain bagi kebenaran dan kebatilan dengan sebagian barang tambang berharga yang disepuh dengan api untuk dimurnikan dan menjadikannya perhiasan bagi manusia. Allah mengumpamakan kebenaran dengan kebatilan dengan dua perumpamaan di atas. Kebatilan adalah seperti buih dan busa yang mengapung di permukaan air, dan seperti ampas tambang yang dibersihkan oleh api, sedangkan kebenaran adalah seperti air jernih yang diminum, menumbuhkan buah-buahan, tanaman dan rerumputan, dan seperti barang berharga yang tersisa dari barang tambang sesudah dibakar dengan api lalu manusia mengambil manfaat darinya. Sebagaimana Allah membuat dua perumpamaan ini, Allah membuat perumpamaan-perumpamaan lain bagi manusia agar kebaikan menjadi jelas dari kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Allah menurunkan hujan dari awan, sehingga airnya mengalir menuju lembah-lembah sesuai ukurannya, arus air itu membawa busa yang banyak, dan beberapa logam seperti emas dan perak yang mereka panaskan di atas api agar meleleh untuk mereka jadikan perhiasan dan barang yang bermanfaat, namun di permukaan logam itu juga terdapat busa yang tidak bermanfaat; demikianlah perumpamaan antara kebatilan dan kebenaran. Perumpamaan kebenaran yang tetap kokoh seperti air jernih yang menyirami tanaman dan logam murni yang bermanfaat bagi manusia. Sedangkan perumpamaan kebatilan yang cepat sirna seperti busa yang tidak membawa kebaikan yang ada di permukaan air atau logam. Demikianlah Allah menjelaskan perumpamaan bagi manusia, agar jelas bagi mereka antara kebenaran dan kebatilan, dan petunjuk dan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَسَالَتْ أَوْدِيَةٌۢ (maka mengalirlah air di lembah-lembah) Yakni airnya mengalir. بِقَدَرِهَا(menurut ukurannya) Jika lembahnya kecil maka airnya sedikit, dan jika lembahnya luas maka airnya banyak. Allah menyerupakan turunnya al-Qur’an yang mengandung petunjuk dan penjelasan seperti turunnya air hujan, karena turunnya al-Qur’an manfaatnya menyeluruh seperti manfaat turunnya air hujan. Dan Allah juga menyerupakan hati seseorang seperti lembah, sebagian hati manusia mampu menampung kebaikan dan ilmu yang banyak, dan sebagian lainnya tidak demikian. فَاحْتَمَلَ السَّيْلُ زَبَدًا رَّابِيًا ۚ( maka arus itu membawa buih yang mengambang) Makna (الزبد) yakni gelembung putih yang mengapung di atas permukaan air. Disebut juga dengan الرغوة، الغشاء dan الرابي, semua kata ini menunjuk pada gelembung yang berada di permukaan air. وَمِمَّا يُوقِدُونَ عَلَيْهِ فِى النَّارِ(Dan dari apa (logam) yang mereka lebur dalam api) Yang meleleh dari dalam logam seperti emas dan besi. ابْتِغَآءَ حِلْيَةٍ(untuk membuat perhiasan) Yakni yang dijadikan sebagai bahan perhiasan untuk menghias diri seperti emas dan perak. أَوْ مَتٰعٍ(atau alat-alat) Seperti wadah-wadah dan alat-alat yang berasal dari besi, kuningan, tembaga, dan timah. زَبَدٌ مِّثْلُهُۥ ۚ( ada (pula) buihnya seperti buih arus itu) Yakni terdapat pula sesuatu yang terapung dari benda-benda yang meleleh tersebut, dan benda yang terapung darinya itu merupakan kotoran dan tanah. كَذٰلِكَ يَضْرِبُ اللهُ الْحَقَّ وَالْبٰطِلَ ۚ( Demikianlah Allah membuat perumpamaan (bagi) yang benar dan yang bathil) Allah memberi perumpamaan kebenaran dan perumpamaan kebatilan. فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَآءً ۖ( Adapun buih itu, akan hilang sebagai sesuatu yang tak ada harganya) Buih itu terbawa oleh arus ke permukaan tanah, dan kotoran dari logam dibuang karena tidak dapat dipakai sebagai perhiasan atau alat-alat; seperti itulah perumpamaan kebatilan yang akan lenyap. وَأَمَّا مَا يَنفَعُ النَّاسَ(adapun yang memberi manfaat kepada manusia) Yaitu air yang jernih dan logam murni yang meleleh itu. فَيَمْكُثُ فِى الْأَرْضِ ۚ( maka ia tetap di bumi) Air itu akan mengalir di sungai-sungai yang ada di bumi sehingga dapat dimanfaatkan oleh manusia. Adapun logam yang dilelehkan itu akan dibuat sebagai perhiasan dan peralatan; dan seperti itulah perumpamaan kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا } \"maka mengalirlah air di lembah-lembah menurut ukurannya\" Ibnu 'Abbas mengatakan : ayat ini merupakan perumpamaan yang dibuat oleh Allah, yang di dalamnya mencakup hati-hati umat manusia dalam menerima wahyu sesuai keyakinan dan keraguan, jika keraguan mendominasi hatinya maka amalan apapun yang ia kerjakan tidak akan bermanfaat baginya, namun jika keyakinan yang lebih besar niscaya Allah akan menerangkan untuknya jalan untuk beramal. 2 ). Allah yang menurunkan perumpamaan yang benar dan menjaganya sebagimana ia menjaga semua yang dimanfaatkan oleh manusia, { كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ } \"Demikianlah Allah membuat perumpamaan (bagi) yang benar dan yang bathil. Adapun buih itu, akan hilang sebagai sesuatu yang tak ada harganya; adapun yang memberi manfaat kepada manusia, maka ia tetap di bumi\". 3 ). { وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ } \"adapun yang memberi manfaat kepada manusia, maka ia tetap di bumi\" Inilah standar yang ditetapkan oleh al-qur'an untuk ilmu yang benar : bermanfaat bagi manusia, dan setiap ilmu yang tidak bermanfaat bagi mereka , akan menimbulkan kerugian bagi kehidupan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Allah menurunkan hujan dari langit, lalu air mengalir ke lembah-lembah sesuai ukuran dan luas lembah itu, sedikit maupun banyak. Dalam aliran yang deras itu, terkandung buih yang mengapung di atas air. Sebagian logam yang dipanaskan diatasnya akan meleleh ketika diletakkan di api, yaitu logam-logam besi, emas, perak dan lain-lain, dengan tujuan sebagai hiasan dan permata, yaitu emas dan perak atau untuk dibuat peralatan, yaitu besi dan tembaga untuk dimanfaatkan sebagai bejana, alat-alat perang, pertanian dan perindustrian ketika dicairkan. Logam itu memiliki buih layaknya buih pada aliran itu. Maknanya bahwa logam itu juga memiliki buih, yaitu kotoran dari logam-logam ini. Seperti yang disebutkan itulah perumpamaan yang hak dan yang bathil serta orang yang melakukan keduanya. Adapun busa yang mengapung itu membawa kebathilan yang terbuang melalui buih itu, sedangkan air dan logam yang dimanfaatkan manusia dan pemiliknya itu masih tetap ada di bumi selama beberapa waktu. Seperti yang disebutkan itulah Allah menjelaskan perumpamaan-perumpamaan yang masih samar. Maksudnya, sesungguhnya setelah menerangkan kesalahan orang-orang kafir dalam ayat-ayat sebelumnya (14) dan ayat setelahnya bahwa mengambil tuhan lain itu tidak memberi manfaat dan mahdharat, Dia memberikan 2 perumpamaan untuk meneguhkan kebenaran yaitu keimanan terhadap Al-qur'an dan menghilangkan kebathilan, yaitu kekufuran. Dan kebathilan itu layaknya buih-buih di atas air yang menghilang dan menyebar, sedangkan kebenaran itu tetap ada seperti air dan logam murni yang terus ada di bumi, sehingga manusia dapat memanfaatkannya. Di antara dua perumpamaan itu ada yang bersifat pedesaan yaitu air dan tanaman, dan ada yang bersifat perkotaan yaitu produksi logam. FirmanNya {mimma} adalah khobar ibtida'iy, dan {zabadun} adalah mubtada'nya, sedangkan {mitsluhu} adalah na'at untuk zabadun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia telah menurunkan air dari langit, lalu mengalirlah air lembah-lembah sesuai ukurannya} sesuai ukuran lembahnya, kecil dan besar {Aliran itu membawa buih} buih dan sampah yang tidak ada manfaatnya {yang mengambang} mengambang di atas permukaan air {Dari sesuatu yang mereka lebur dalam api untuk} dengan maksud {membuat perhiasan atau alat-alat, ada (pula) buih seperti itu. Demikianlah Allah membuat perumpamaan tentang yang benar dan yang bathil. Buih itu akan hilang tidak berguna} terlempar terhempas {sedangkan yang bermanfaat bagi manusia akan menetap} akan tetap ada {di bumi. Demikianlah Allah membuat perumpamaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Allah menyerupakan hidayah yang diturunkan kepada RasulNya bagi kehidupan kalbu dan ruh manusia dengan air yang diturunkan bagi kehidupan pepohonan. Allah menganalogikan manfaat luas lagi melimpah yang terkandung dalam hidayah yang sangat dibutuhkan oleh manusia dengan haal-haal yang dikandung oleh hujan, berupa manfaat-manfaat makro yang mendesak. Allah mempemisalkan hati yang berhasil mengemas hidayah dan tingkatan-tingkatannya dengan lembah-lembah yang menjadi muara aliran air. Lembah yang luas, mampu menampung air yang banyak adalah ibarat hati lapang, yang memuat ilmu yang banyak. Sedangkan lembah kecil yang hanya membutuhkan sedikit air seperti halnya hati yang sempit yang hanya memuat ilmu yang sedikit…dan demikianlah seterusnyaa. Selanjutnya, Allah mengumpamakan nafsu syahwat dan syubhat (kerancuan) pada hati manusia saat kebenaran datang kepadanya dengan buih yang berada di atas permukaan air, dan benda yang dipanaskan di atas api berupa perhiasan yang akan dimurnikan dan dillebur untuk dimasukkan ke dalam cetakan. Ia akan tetap di atas air dalam keadaan mengambang menyebabkannya keruh sampai akhirnya hilang dan lenyap. Dan akan tersisa hal-hal yang berguna bagi manusia daalam wujud air jernih dan perhiasan yang murni. Demikian pula keadaan dengan syahwat dan syubhat, karena hati akan senantiasa membenci dan berusaha menaklukannya melalui bukti-bukti yang benar dan tekad-tekad yang bulat agar pergi dan lenyap. Hati pun menjadi bersih lagi murni, di dalamnya hanya ada hal-hal yang bermanfaat bagi manusia berupa ilmu dan kebenaran serta tindakan untuk mengutamakan dan mencintainya. Kebatilan akan lenyap, dan kebenaranlah yang menyirnakannya. \"sesungguhnya kebatilan akan sirna\" (Al-Isra:81). Di sini, Allah berfirman, “Demikianlah Allah membuat perumpamaan-perumpamaan,” tujuannya agar kebenaran menjadi jelas dan terbedakan dari kebatilan, dan hidayah terbedakan dari kesesatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا) fasaalat awdiyatum biqadarihaa : sesuai dengan kadar air yang mengalir di dalam lembah itu. (زَبَدٗا رَّابِيٗاۖ) zabardarraabiyaa : buih yang mengambang. Az-Zabad adalah gelembung pada air yang mendidih atau aliran air sungai. (وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ) wa mimmaa yuuqiduuna ‘alaihi finnaar : yaitu seperti emas, perak, dan tembaga. (ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ) ibtighaa’a hilyatin aw mataa’i : untuk membuat perhiasan dari emas atau perak, dan perkakas berupa bejana-bejana. (زَبَدٞ مِّثۡلُهُۥۚ) zabadum mitsluh : seperti buih banjir. (فَأَمَّا ٱلزَّبَدُ) fa’ammaz zabadu : buih banjir atau yang dihasilkan dari sesuatu yang dipanaskan dengan api. (فَيَذۡهَبُ جُفَآءٗۖ) faydzhabu jufaa’a : hilang, dibuang jauh-jauh, karena ia hanya sebuah buih dan gelembung, tidak ada manfaatnya. (فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ) fayamkutsu fil ardh : menetap dibumi untuk waktu yang lama, sehingga manusia memanfaatkannya. Makna ayat : Masih dalam penjelasan tauhid serta ancaman dari perilaku kufur dan syirik. Pada ayat yang mulia ini, Allah membuat sebuah perumpamaan antara kebenaran dan kebatilan; kelanggengan kebenaran dan kefanaan kebatilan. Firman-Nya : (أَنزَلَ) yaitu Allah menurunkan (مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا) maka lembah-lembah itu mengalirkan air sesuai dengan besar dan kecilnya, karena lembah bisa berukuran besar, atau kecil, (فَٱحۡتَمَلَ ٱلسَّيۡلُ) maka aliran air itu membawa (زَبَدٗا رَّابِيٗاۖ) buih dan sampah yang mengambang di permukaan air, ini adalah perumpamaan dengan air, adapun perumpamaan dengan api, firman-Nya ta’ala : (وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ) apa yang dipanaskan oleh para penjual emas dan pandai besi (ٱبۡتِغَآءَ حِلۡيَةٍ) untuk membuat perhiasan (أَوۡ مَتَٰعٖ) atau membuat peralatan yang bisa digunakan seperti bejana-bejana, karena ketika pengerajin emas dan pandai besi memanaskan emas dan perak di dalam pelebur logam dan membakarnya dengan alat peniup api, maka akan naik kotoran yang tidak berguna dalam bentuk buih dan yang berguna akan tetap ada di dalam pelebur tersebut, dengannya dibuat perhiasan dan perkakas. Firman-Nya : (كَذَٰلِكَ) yaitu hal yang telah disebutkan berupa empat hal, dua permisalan kebenaran, yaitu air dan perhiasan, dan dua permisalan kebatilan, yaitu buih air dan kotoran logam (فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ) adapun buih dan kotoran logam akan hilang mengering terbuang oleh arus air hingga pinggiran lembah kemudian menempel pada pohon-pohon dan batu serta dibuang pula oleh pengerajin emas dari pelebur logam. Sedangkan apapun yang bermanfaat bagi manusia berupa air untuk pengairan dan minum, maka ia akan tetap tinggal di bumi, begitu pula hal yang bermanfaat untuk membuat perhiasan dan perkakas, akan tetap ada di pelebur logam milik pengrajin dan pandai besi. Firman-Nya : (كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ) menjadikan permisalan ini untuk kebenaran yang kekal serta kebatilan yang akan hilang serta punah sekalipun terkadang ia memiliki kekuatan dan melampaui batas. (يَضۡرِبُ) menjelaskan perbandingan ini, agar mereka mengetahui lalu beriman, mendapatkan hidayah, memperoleh kesempurnaan, dan meraih kebahagiaan. Inilah isi dari ayat pertama. Adapun ayat yang kedua. Allah ta’ala mengkabarkan tentang janji dan ancaman-Nya. Adapun janji-Nya adalah untuk orang-orang beriman dan taat kepadanya, bagi mereka surga. Serta bagi para pelaku maksiat, bagi mereka ancaman yang paling buruk dan kejam. Pelajaran dari ayat : • Bolehnya membuat permisalan untuk memudahkan pemahaman. • Tetapnya kebenaran dan hilangnya kebatilan adalah ketetapan dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 17: Dalam ayat ini Allah Subhaanahu wa Ta'aala membuat permisalan untuk kebenaran dan kebatilan. Seperti logam emas, perak, tembaga, dsb. Yaitu kotorannya. Syaikh As Sa’diy berkata, “Allah Ta'aala mengumpamakan petunjuk yang menghidupkan hati dan ruh (manusia); yang diturunkan-Nya kepada Rasul-Nya dengan air yang diturunkan-Nya untuk kehidupan manusia. Dia mengumpamakan apa yang ada dalam petunjuk yang mengandung manfaat secara umum dan banyak lagi dibutuhkan hamba dengan apa yang ada dalam air yang di dalamnya mengandung manfaat yang umum lagi dibutuhkan sekali. Allah mengumpamakan hati yang siap menerima petunjuk dan keadaannya yang berbeda-beda (pada masing-masing orang) dengan lembah yang dialiri air. Ada lembah yang besar yang menampung banyak air seperti hati yang besar yang menampung ilmu yang banyak. Ada pula lembah yang kecil yang menampung sedikit air seperti hati yang kecil yang menampung ilmu yang sedikit, dan begitulah seterusnya. Allah mengumpamakan apa yang ada dalam hati berupa syahwat dan syubhat ketika kebenaran datang kepadanya seperti buih yang berada di atas air dan buih yang berada di atas api yang sedang meleburkan logam perhiasan yang hendak dibersihkan dan dituang dalam cetakan, dan bahwa buih itu senantiasa mengambang di atas air lagi mengeruhkannya sampai akhirnya buih itu hilang dan lenyap, dan tinggallah yang bermanfaat bagi manusia berupa air yang jernih dan perhiasan yang murni. Seperti itulah syubhat dan syahwat, hati (yang baik) membencinya, melawannya dengan bukti-bukti yang benar dan keinginan yang keras sehingga syubhat dan syahwat itu hilang dan lenyap, dan tinggallah hati yang bersih lagi jernih yang di dalamnya tidak ada lagi selain yang memberi manfaat bagi manusia berupa pengetahuan terhadap kebenaran, pengutamaannya, dan rasa cinta kepadanya. Oleh karena itu, yang batil akan hilang dan dikalahkan oleh kebenaran, “Sesungguhnya yang batil itu adalah sesuatu yang pasti lenyap (terj. Al Israa’: 81).” Yaitu buih yang mengambang di atas air atau buih dari logam yang dileburkan. Demikianlah kebatilan itu, ia akan hilang dan sirna meskipun dalam sebagian waktu berada di atas kebenaran. Dalam waktu yang lama seperti air dan perhiasan. Demikianlah perumpamaan terhadap kebenaran. Agar kebenaran semakin jelas dari kebatilan, dan petunjuk semakin jelas dari kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 17",
    "description": "Ayat berikut merinci kekuasaan Allah yang tidak dimiliki oleh berhala sesembahan orang-orang musyrik mekah. Allah telah menurunkan dalam bentuk curahan air hujan dari langit, maka mengalirlah ia, yakni air hujan yang dicurahkan itu, di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat yang beraneka ragam, ada pula buihnya seperti buih arus itu. Demikianlah Allah membuat perumpamaan tentang mana yang benar dan mana yang batil. Adapun buih, lambang dari kebatilan, akan hilang sebagai sesuatu yang tidak ada gunanya; tetapi kebenaran adalah sesuatu yang bermanfaat bagi manusia, dan manfaat itu akan tetap ada di bumi. Demikianlah Allah membuat perumpamaan bagi orang-orang yang mau berpikir. Allah menyebut perumpamaan-perumpaan itu agar menjadi pelajaran bagi orang-orang yang mau berpikir. Melalui berpikir dan merenung, manusia akan menemukan kebenaran. Bagi orang-orang yang mau berpikir jernih dan memenuhi seruan tuhan, maka bagi mereka disediakan balasan yang terbaik. Dan orang-orang yang tidak memenuhi seruan-Nya dan enggan menerima kebenaran dari Allah maka mereka akan menemui kesulitan dan kesengsaraan. Oleh sebab itu, sekiranya mereka memiliki semua yang ada di bumi dan ditambah pula kekayaan sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan kekayaan itu. Orang-orang itu jauh dari rahmat Allah dan akan mendapat hisab yang buruk di hari kiamat sebagai akibat dari keburukan yang mereka lakukan. Dan tempat kediaman mereka adalah neraka jahanam, dan itulah seburuk-buruk tempat kediaman."
  }
]