[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18 Orang-orang mukmin yang taat kepada Allah dan rasulNya akan mendapatkan surga. Sedang orang-orang yang tidak taat dan kafir kepadaNya akan mendapatkan neraka. Dan walaupun mereka memiliki semua yang ada di muka bumi dan sebesar itu lagi yang menyertainya, untuk mereka sodorkan sebagai tebusan bagi diri mereka dari siksaan Allah pada hari kiamat, sekali-kali tidak akan diterima dari mereka. Mereka itu orang-orang yang akan mengahadapi perhitungan atas semua yang telah mereka lakukan di masa lalu berupa perbuatan yang buruk. Tempat tinggal dan kediaman mereka adalah Neraka jahanam, mereka akan diam disitu, dan amat buruk kediaman yang telah mereka persiapkan bagi diri mereka itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang mukmin yang menjawab seruan Rabb mereka manakala Dia mengajak kepada Tauhid-Nya dan menaati-Nya akan mendapatkan pahala yang baik yaitu surga. Sedangkan orang-orang yang tidak menjawab seruan Rabb mereka kepada Tauhid-Nya dan menaati-Nya mendapatkan azab yang pedih. Seandainya mereka memiliki berbagai macam harta di bumi ini dan juga apa yang semisalnya dengannya, niscaya mereka rela melepaskan semuanya demi menebus diri mereka dari azab Allah. Orang-orang yang tidak menjawab seruan Rabb mereka itu akan dihisab atas keburukan-keburukan mereka seluruhnya, tempat tinggal yang mereka tuju adalah Jahanam. Api neraka adalah alas dan kasur mereka, dan itulah seburuk-buruk alas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Balasan bagi orang-orang beriman yang mentaati Allah dan rasul-Nya adalah surga. Sedangkan balasan bagi orang-orang yang mendustakan dan menentang mereka adalah neraka. Seandainya mereka memiliki segala isi bumi, kemudian mereka menyerahkannya sebagai tebusan diri mereka dari azab Allah pada hari kiamat, niscaya tebusan itu tidak akan diterima dari mereka. Orang-orang yang jauh dari kebenaran itu mendapatkan azab yang buruk di akhirat akibat dosa-dosa mereka, dan tempat mereka adalah neraka Jahannam, itulah seburuk-buruk tempat kembali mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. لِلَّذِينَ اسْتَجَابُوا۟ لِرَبِّهِمُ (Bagi orang-orang yang memenuhi seruan Tuhannya) Apabila diseru untuk mengesakan Allah dan beriman kepada para Nabi-Nya serta menjalankan syariat-Nya. الْحُسْنَىٰ ۚ (pembalasan yang baik) Balasan yang baik yakni surga. وَالَّذِينَ لَمْ يَسْتَجِيبُوا۟ لَهُۥ (Dan orang-orang yang tidak memenuhi seruan Tuhan) Yakni menjawab seruan-Nya. لَوْ أَنَّ لَهُم مَّا فِى الْأَرْضِ جَمِيعًا(sekiranya mereka mempunyai semua yang ada di bumi) Yakni semua jenis kekayaan di dunia. وَمِثْلَهُۥ مَعَهُۥ(dan (ditambah) sebanyak isi bumi itu lagi) Yakni ditambah lagi dengan yang semisal kekayaan di dunia itu. لَافْتَدَوْا۟ بِهِۦٓ ۚ( niscaya mereka akan menebus dirinya dengan kekayaan itu) Karena azab yang besar dan kegentingan di hari kiamat. Namun itu semua tidak akan diterima. أُو۟لٰٓئِكَ(Orang-orang itu) Yakni orang-orang yang tidak menjawab seruan Allah. لَهُمْ سُوٓءُ الْحِسَابِ(disediakan baginya hisab yang buruk) Yakni orang tersebut akan dihisab atas seluruh dosa-dosanya dan tidak akan diampuni sama sekali. وَمَأْوَىٰهُمْ جَهَنَّمُ ۖ( dan tempat kediaman mereka ialah Jahanam) Yakni tempat tinggal mereka. وَبِئْسَ الْمِهَادُ (dan itulah seburuk-buruk tempat kediaman) Yakni tempat yang mereka tinggali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Balasan kebaikan, yaitu surga itu bagi orang-orang menerima ketentuan Tuhannya dengan beriman dan taat. Sedangkan orang yang tidak menaati Allah dan rasulnya, maka tidak bermanfaat bagi mereka tebusan dunia dan seisinya itu di akhirat dan tempat tinggal mereka adalah neraka Jahanam, yaitu seburuk-buruk tempat tinggal bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi orang-orang yang memenuhi seruan Tuhannyaitu balasan yang terbaik} surga {dan orang-orang yang tidak memenuhi seruanNya, sekiranya mereka memiliki semua yang ada di bumi dan (ditambah) sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan hal itu} sungguh mereka akan memakainya sebagai tebusan untuk diri mereka dari (siksa) nereka {Mereka itulah orang-orang yang akan mendapatkan hisab yang buruk, tempat tinggal mereka adalah neraka Jahanam, seburuk-buruk tempat tinggal} tempat beristirahat dan tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Ketika Allah menerangkan kebenaran untuk menyisihkannya dari kebatilan, maka Allah menyebutkan bahwa manusia terkualifikasi menjadi dua golongan: Golongan yang menyambut seruan Rabbnya lalu disebutkan balasan baiknya, dan golongan yang tidak menyambut lalu disebutkan hukumannya. Allah berfirman, “Bagi orang-orang yang memenuhi seruan Rabbnya,” maksudnya orang-orang yang hatinya tunduk kepada ilmu dan keimanan, dan anggota tubuh mereka patuh pada perintah dan larangan, maka mereka menjadi insan-insan yang sejalan dengan Rabb mereka dalam hal-hal yang diinginkanNYa dari mereka. Maka bagi mereka “(disediakan) pembalasan yang baik,” yaitu kondisi yang baik dan pahala yang bagus. Mereka memiliki sifat yang termulia dan budi pekerti yang paling luhur, serta balasan segera (di dunia ini) dan balasan yang akan datang, yang tidak pernah disaksikan pandangan, tidak pernah didengar pendengaran serta tidak pernah terbetik di dalam hati manusia. “Dan orang-orang yang tidak memenuhi seruan Rabbnya,” sesudah Allah membuat permisalan-permisalan dan menjelaskan kebenaran kepada mereka, maka mereka mendapatkan kondisi yang tidak baik. “Sekiranya mereka mempunyai semua (kekayaan) yang ada di bumi,” berupa emas, perak, dan lain-lain, “dan (ditambah) sebanyak isi bumi itu lagi bersertanya, niscaya mereka akan menebus dirinya dengan kekayaan itu,” dari siksa pada Hari Kiamat. Semua itu tidak akan diterima dari mereka. Dan daari mana mereka memiliki itu semua? “Orang-orang itu disediakan baginya hisab yang buruk,” yaitu proses hisab (perhitungan amal) yang akan berlaku bagi semua perkara yang pernah mereka kerjakan, yang berbentuk amalan yang buruk, dan hak-hak Allah serta hak-hak manusia yang telah mereka sepelekan. Hal tersebut telah ditulis dan digariskan pada mereka, \"dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun\".(Al-Kahfi:49). “Dan” pasca perhitungan (amal) yang buruk ini “tempat kediaman mereka ialah Jahanam,” yang menghimpun berbagai macam siksaan, berupa kelaparan yang dahsyat, rasa haus yang menyakitkan, serta api yang menyala-nyala, buaha Zaqqum, hawa dingin yang sangat menusuk, dan makanan dari pohon yang berduri dan seluruh macam siksaan yang telah Allah sebutkan. “Dan itulah seburuk-buruk tempat kediaman,” yaitu seburuk-buruk hunian dan tempat tinggal adalah tempat mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ) lilladziinastajaabuu lirabbihimul husnaa : untuk orang-orang yang beriman dan beramal saleh surga. (لَمۡ يَسۡتَجِيبُواْ) lam yastajiibuu : tidak beriman dengan-Nya dan taat. (لَٱفۡتَدَوۡاْ بِهِۦٓۚ) laftadau bih : dari adzab. (سُوٓءُ ٱلۡحِسَابِ) suu’u hisaab : yaitu disiksa karena setiap dosa yang mereka lakukan dan tidak diampuni darinya sedikitpun. (وَبِئۡسَ ٱلۡمِهَادُ) wa bi’sal mihaad : tempat yang telah mereka persiapkan untuk mereka sendiri yaitu Jahanam. Makna ayat : Allah berfirman mengenai janji-Nya : (لِلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ) dan tentang ancaman-Nya : (وَٱلَّذِينَ لَمۡ يَسۡتَجِيبُواْ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا) dengan harta benda (وَمِثۡلَهُۥ مَعَهُۥ) dengan dua kali lipatnya, niscaya mereka akan menebus diri mereka dari azab yang dibawa oleh ancaman yang berat ini, kemudian berfirman tentang ancaman-Nya : (أُوْلَٰٓئِكَ) mereka orang-orang yang celaka, (لَهُمۡ سُوٓءُ ٱلۡحِسَابِ) mereka dipertanggung jawabkan atas segala perbuatan mereka baik kecil atau besar dari seluruh perbuatan mereka dan tidak pula mereka diampuni (وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ) tempat tinggal dan kembali mereka (وَبِئۡسَ ٱلۡمِهَادُ) seburuk-buruk tempat tinggal adalah Jahanam. Pelajaran dari ayat : • Penjelasan janji Allah bagi mereka yang menyambut seruan-Nya—dengan iman dan ketaatan—dengan surga. • Ancaman Allah bagi mereka yang tidak menyambut seruan-Nya dengan iman dan ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 18: Setelah Allah Ta’ala menerangkan yang hak dan yang batil, maka Allah menerangkan bahwa manusia terbagi menjadi dua bagian; yang memenuhi seruan Tuhan-Nya dan yang tidak memenuhi seruan Tuhan-Nya. Disebutkan pula masing-masing balasannya. Dengan menaati-Nya. Berupa keadaan yang baik dan balasan yang baik, yaitu surga. Seperti halnya orang-orang kafir, setelah Allah memberikan permisalan untuk mereka dan menerangkan kebenaran kepada mereka, maka mereka akan mendapatkan keadaan yang buruk. Kalau pun mereka memilikinya, namun tetap tidak diterima. Yakni semua amal buruk yang mereka kerjakan baik terkait dengan hak Allah maupun hak hamba Allah akan diberikan hukuman tanpa diampuni, dan mereka akan berkata, “Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya.” Dan mereka dapati apa yang telah mereka kerjakan tertulis (di hadapan). Dan Tuhanmu tidak menganiaya seorang pun juga.” (Terj. Al Kahfi: 49) Yang menghimpun segala siksa, berupa lapar yang sangat, haus yang sangat, panas yang sangat, makanan dan minuman yang tidak enak seperti zaqqum dan pohon yang berduri, minuman yang mendidih dan siksaan lainnya, wal ‘iyaadz billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 18",
    "description": "Allah menyebut perumpamaan-perumpaan itu agar menjadi pelajaran bagi orang-orang yang mau berpikir. Melalui berpikir dan merenung, manusia akan menemukan kebenaran. Bagi orang-orang yang mau berpikir jernih dan memenuhi seruan tuhan, maka bagi mereka disediakan balasan yang terbaik. Dan orang-orang yang tidak memenuhi seruan-Nya dan enggan menerima kebenaran dari Allah maka mereka akan menemui kesulitan dan kesengsaraan. Oleh sebab itu, sekiranya mereka memiliki semua yang ada di bumi dan ditambah pula kekayaan sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan kekayaan itu. Orang-orang itu jauh dari rahmat Allah dan akan mendapat hisab yang buruk di hari kiamat sebagai akibat dari keburukan yang mereka lakukan. Dan tempat kediaman mereka adalah neraka jahanam, dan itulah seburuk-buruk tempat kediaman. Usai menjelaskan balasan bagi manusia yang memenuhi dan yang abai atas seruan-seruan-Nya, Allah lalu membandingkan antara orang yang mengetahui kebenaran dengan yang tidak. Bila dibandingkan, maka apakah orang yang mengetahui bahwa apa (Al-Qur'an) yang diturunkan tuhan kepadamu itu adalah kebenaran, lalu dia beriman kepadanya, sama dengan orang yang buta mata hatinya dan enggan beriman kepadanya' tentu tidak sama. Hanya orang berakal saja'yang biasa Al-Qur'an sebut dengan ulul albab'yang dapat memahami perbandingan tersebut dan mengambil pelajaran darinya."
  }
]