[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Apakah orang yang mengetahui bahwa apa yang datang kepadamu (wahai rasul), dari sisi Allah merupakan kebenaran, lalu mengimaninya, sama seperti orang buta yang tidak dapat melihat kebenaran yang dia tidak Imani? sesungguhnya orang-orang yang dapat mengambil pelajaran hanyalah orang-orang yang berakal lurus. Yaitu orang-orang yang memenuhi perjanjian dengan Allah yang telah diperintahkanNya kepada mereka, dan tidak membatalkan perjanjian teguh yang telah mereka kukuhkan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Tidak sama orang yang mengetahui bahwa apa yang Allah turunkan kepadamu -wahai Rasul- dari Rabbmu adalah kebenaran yang tidak ada keraguan padanya sementara dia beriman dan menjawabnya, dengan orang buta yang kafir lagi tidak menjawab panggilan Allah. Hanya orang-orang yang berakal lurus yang mengambil nasihat dan pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Sesungguhnya orang-orang yang mendapat hidayah dan orang-orang yang sesat tidaklah sama. Hai Rasulullah, apakah orang yang mengetahui apa yang kamu datangkan dari Tuhanmu adalah kebenaran sehingga dia mengimaninya, seperti orang yang hatinya buta dari kebenaran sehingga dia tidan mengimaninya? Sungguh orang-orang yang mengambil pelajaran adalah mereka yang memiliki akal sehat yang memenuhi perjanjian Allah yang Dia perintahkan kepada mereka dan tidak melanggar perjanjian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. كَمَنْ هُوَ أَعْمَىٰٓ ۚ (sama dengan orang yang buta) Bukanlah orang yang mengetahui al-Qur’an yang diturunkan Allah kepada rasul-Nya merupakan kebenaran yang tidak ada keraguan sedikitpun didalamnya seperti orang yang buta hatinya yang tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Apakah orang yang mengetahui lantas bisa beriman dan menerima seperti Hamzah? Mengetahui bahwasanya apa yang diturunkan Tuhanmu kepada rasul-Nya itu benar-benar haq dan benar sama seoerti mereka yang tidak mengetahui layaknya Abu Jahal? Bahkan dia adalah orang yang hati dan mata batinnya buta juga tidak beriman. Keduanya tidaklah sama, hanyalah orang-orang yang berakal saja yang dapat mengambil pelajaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah orang yang mengetahui bahwa apa yang diturunkan kepadamu dari Tuhanmu adalah kebenaran sama dengan orang yang buta. Hanya orang yang berakal sehat saja} orang-orang yang berakal sehat {yang dapat mengambil pelajaran} mengambil pelajaran dan teladan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. Allah berfirman untuk membedakan antara orang-orang yang berilmu dan mengamalkannya dengan orang yang tidak demikian adanya, “Adakah orang yang mengetahui bahwasanya apa yang diturunkan kepadamu dari Rabbmu itu benar,” lalu dia memahami dan mengamalkannya “sama dengan orang yang buta,” yang tidak mengetahui kebenaran sehingga tidak mengamalkannya? Perbedaan antara keduanya bak perbedaan antara langit dan bumi. Oleh karenanya, sudah semestinya seorang hamba mengingat dan berpikir, siapakah di antara dua macam orang itu yang paling bagus kondisinya dan terbaik penghujung kehidupannya, sehingga jalannya diikuti dan dititi di belakang golongannya. Namun, tidak setiap orang mengingat-ingat hal yang bermanfaat dan berbahaya baginya. “Hanyalah orang-orang yang berakal saja yang dapat mengambil pelajaran,” yaitu orang-orang yang mempunyai akal yang matang dan pemikiran yang sempurna, yang merupakan unsur penting alam semesta dan keturunan Adam yang terpilih. Jika engkau menanyakan tentang karakteristik mereka, maka engkau tidak akan menumpai sifat yang lebih baik dari sebutan Allah bagi mereka dengan FirmanNya, “orang-orang yang memenuhi janji Allah,” yang telah Allah amanatkan kepada mereka dan mengikat mereka dengan janji itu, berupa pelaksanaan hak-hakNya secara sempurna lagi komplet. Yang dimaksud dengan menepatinya ialah memenuhi hak-haknya dalam bentuk menyempurnakan dan bersikap tulus terhadapnya. Dan termasuk indikasi pemenuhan hak tersebut, bahwa mereka “tidak merusak perjanjian,” perjanjian yang telah mereka tetapkan sendiri dengan Allah. Seluruh akad, perjanjian, sumpah dan nadzar yang telah diikrarkan seseorang masuk ke dalamnya. Seseorang tidak termasuk dalam kategori ‘ulul albab’ (orang-orang yang berakal) yang mendapatkan pahala kecuali dengan melaksanakannya secara utuh, tidak membatalkan dan menguranginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَمَنۡ هُوَ أَعۡمَىٰٓۚ) kaman huwa a’maa : tidak melihat kebenaran tidak mengetahuinya dan tidak pula beriman . (أُوْلُواْ ٱلۡأَلۡبَٰبِ) ulul albaab : orang-orang yang berakal. Makna ayat : Ayat ini mengandung perbandingan dan perbedaan antara dua kepribadian: pertama; kepribadian seorang mukmin yang saleh, seperti Hamzah bin Abdul Muthallib, dan kedua; kepribadian seorang kafir yang rusak, seperti Abu Jahal Al-Makhzumi, begitu pula apa yang akan didapatkan oleh keduanya di negeri akhirat kelak. Allah berfirman : (أَفَمَن يَعۡلَمُ أَنَّمَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ) ”Apakah orang yang mengetahui bahwa apa yang diturunkan kepadamu adalah kebenaran dari Rabbmu “maka dia beriman setelah memiliki ilmu dan konsisten diatas manhajnya dalam akidah, ibadah, muamalah, dan seluruh perilakunya, ini adalah kepribadian yang pertama, (كَمَنۡ هُوَ أَعۡمَىٰٓۚ) “sama dengan orang yang buta?” tidak mengetahui kebenaran dan tidak beriman kepadanya, tidak beramal dengan apa yang telah diturunkan kepada Rasul berupa syariat. Maka jawabannya tentu tidaklah sama, tidak akan pernah sama jika ditimbang dengan timbangan yang adil dan benar. Firman-Nya : (إِنَّمَا يَتَذَكَّرُ أُوْلُواْ ٱلۡأَلۡبَٰبِ) yang mengambil pelajaran dari perbandingan ini hanyalah orang-orang yang memiliki akal dan pengetahuan tentang kebenaran. Perbandingan antara dua hal yang bertentangan, seperti kebenaran dan kebatilan, kebaikan dan keburukan, manfaat dan bahaya. Pelajaran dari ayat : • Seorang mukmin dia hidup, melihat, mengetahui, dan beramal. Adapun orang kafir ia mati, buta, tidak mengetahui, dan tidak pula beramal. • Pelajaran hanya bisa diambil oleh orang yang berakal lurus dan sehat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 19: Ada yang mengatakan, bahwa ayat ini turun berkenaan dengan Hamzah dan Abu Jahal atau ‘Ammar dan Abu Jahal, wallahu a’lam. Dalam ayat ini Allah Subhaanahu wa Ta'aala membedakan antara orang yang berilmu lagi mengamalkannya dengan orang yang tidak berilmu lagi tidak beramal. Antara keduanya terdapat perbedaan, bahkan seperti antara langit dan bumi. Oleh karena itu, sepantasnya manusia berpikir siapakah di antara kedua orang itu yang lebih baik keadaannya, dan siapakah yang diikuti jalannya. Akan tetapi, tidak semua orang dapat mengambil pelajaran. Hanya orang-orang yang berakal saja yang dapat mengambil pelajaran. Mereka adalah manusia pilihan yang sifatnya sebagaimana disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 19",
    "description": "Usai menjelaskan balasan bagi manusia yang memenuhi dan yang abai atas seruan-seruan-Nya, Allah lalu membandingkan antara orang yang mengetahui kebenaran dengan yang tidak. Bila dibandingkan, maka apakah orang yang mengetahui bahwa apa (Al-Qur'an) yang diturunkan tuhan kepadamu itu adalah kebenaran, lalu dia beriman kepadanya, sama dengan orang yang buta mata hatinya dan enggan beriman kepadanya' tentu tidak sama. Hanya orang berakal saja'yang biasa Al-Qur'an sebut dengan ulul albab'yang dapat memahami perbandingan tersebut dan mengambil pelajaran darinya. Ulul albab yaitu orang yang senantiasa memenuhi janji dengan sesama manusia yang dikukuhkan dengan nama Allah dan tidak melanggar perjanjian tersebut, ."
  }
]