[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah , Dialah yang meninggikan langit berlapis tujuh dengan kuasaNya tanpa penyangga, sebagaimana yang kalian lihat. Kemudian Dia bersemayam (yakni tinggi yang berada di atas jauh di sana) di atas arasy, sesuai dengan keagunganNya. Dan Dia menundukan matahari dan bulan bagi kemaslahatan hamba-hambaNya. Masing-masing dari keduanya berputar dalam garis edarnya hingga hari kiamat. Allah juga mengatur urusan-urusan dunia dan akhirat dan menjelaskan kepada kalian bukti-bukti petunjuk yang menunjukan kuasaNya dan bahwasannya tidak ada sesembahan yang berhak diibadahi selain Dia supaya kalian yakin kepada Allah dan tempat kembali hanya kepadaNYa, lalu kalian mengimani janji dan ancamanNya, dan mengikhlaskan ibadah hanya kepadaNya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah yang menciptakan langit-langit terangkat tinggi tanpa pilar-pilar seperti yang kalian saksikan, kemudian bersemayam di atas Arasy dengan bersemayam yang laik dengan keagungan-Nya tanpa menanyakan bagaimana Allah bersemayam dan tanpa menyamakan dengan yang lain. Allah menundukkan matahari dan bulan untuk manfaat-manfaat makhluk-Nya. Masing-masing dari matahari dan bulan berjalan untuk waktu yang ditentukan dalam ilmu Allah. Dia mengatur urusan di langit dan di bumi sekehendak-Nya dan menjelaskan ayat-ayat yang menunjukkan kekuasaan-Nya dengan harapan manusia akan meyakini perjumpaan dengan Tuhan mereka pada Hari Kiamat, lalu mereka menyiapkan diri dengan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah yang meninggikan langit dengan tujuh tingkat tanpa memiliki tiang yang menopangnya. Kemudian setelah menciptakan dan meninggikannya, Allah bersemayam di atas ‘arsy yang merupakan makhluk Allah yang terbesar, Dia bersemayam sesuai dengan keagungan dan kesempurnaan-Nya. Dan Allah menundukkan matahari dan bulan untuk memberi manfaat bagi hamba-hamba-Nya; keduanya beredar pada orbitnya dengan teratur bersama bintang-bintang yang lain hingga masa kehancuran dunia. Allah mengatur segala urusan dunia dan akhirat dengan penuh ketelitian. Allah menjelakan ayat-ayat-Nya dengan besarnya kekuasaan-Nya, agar kalian meyakini adanya hari kebangkitan dan perhitungan amal perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. اللهُ الَّذِى رَفَعَ السَّمٰوٰتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ (Allah-lah Yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat) Makna (العمد) yakni tiang-tiang. Yakni langit berdiri tanpa tiang yang menyanggahnya. Pendapat lain mengatakan bahwa langit memiliki tiang-tiang namun kita tidak dapat melihatnya. ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ (kemudian Dia bersemayam di atas ‘Arasy) Yakni berada di atas ‘Arsy, dan hakikatnya hanya Allah yang mengetahui, namun kita harus beriman bahwa Allah benar-benar bersemayam di atas ‘Arsy tanpa membayangkan bagaimana itu terjadi dan tanpa menyerupakannya dengan cara bersemayam makhluk-Nya, serta tanpa mentakwilkannya dan tidak mengingkarinya; namun kita harus mengimaninya sebagaimana Imam Malik berkata “bersemayamnya di atas ‘Arsy adalah sesuatu yang kita ketahui, namun bagaimana hakikatnya tidak dapat dijangkau oleh akal, dan beriman terhadapnya adalah sesuatu yang wajib, serta menanyakannya merupakan perbuatan bid’ah.” وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ( dan menundukkan matahari dan bulan) Yakni menundukkan keduanya demi kemaslahatan dan kebaikan makhluk-makhluk-Nya. كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ۚ( Masing-masing beredar hingga waktu yang ditentukan) Yakni matahari dan bulan beredar sampai dengan waktu yang ditentukan, yaitu sampai kehancuran dunia dan datangnya hari kiamat. Pendapat lain mengatakan maksud dari waktu yang ditentukan adalah peredaran dalam orbitnya masing-masing, yaitu satu tahun bagi matahari, dan satu bulan bagi bulan. يُدَبِّرُ الْأَمْرَ(Allah mengatur urusan) Yakni mengaturnya sesuai dengan kehendak-Nya. يُفَصِّلُ الْاٰيٰتِ(menjelaskan tanda-tanda (kebesaran-Nya)) Dan ini menunjukkan kesempurnaan kuasa-Nya. Dan bagian dari tanda-tanda kebesaran-Nya yang Dia jelaskan adalah Allah meninggikan langit tanpa tiang, dan menundukkan matahari dan bulan serta mengedarkannya dengan waktu yang telah ditentukan. لَعَلَّكُم بِلِقَآءِ رَبِّكُمْ تُوقِنُونَ (supaya kamu meyakini pertemuan(mu) dengan Tuhanmu) Tanpa meragukannya sama sekali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ } \"menjelaskan tanda-tanda (kebesaran-Nya), supaya kamu meyakini pertemuan(mu) dengan Tuhanmu\" banyaknya dalil dan penjelasannya merupakan diantara sebab datangnya keyakinan dalam hati seorang mukmin dalam segala permasalahan ilahiyah, khususnya dalam perkara keimanan yang besar, seperti : keimanan kepada hari kebangkitan dan peritungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Hanya Allahlah yang mengangkat langit yang tegak tanpa ada pilar yang menyangganya, kemudian Dia (Allah) bersemayam di atas ‘Arsy yang merupakan salah satu ciptaan paling agung dengan cara yang sesuai denganNya yang sama sekali tidak kita ketahui dan hanya kita imani bahwa itu benar tanpa ada yang menyamai, meniru, menta’wili dan membatalkannya. Dia menundukkan matahari dan bulan agar memberi manfaat bagi kebaikan para hamba. Masing-masing matahari dan bulan berotasi pada orbitnya sampai waktu yang ditentukan yaitu kehancuran dunia dan terjadinya kiamat. Dia mengatur perkara dengan kebijaksanaanNya. Dia menjelaskan ayat-ayat yang menunjukkan kepada kekuasaan dan keesaanNya, supaya kalian mengimani dan membenarkan kesempurnaan kekuasaan Allah atas hari kebangkitan dan hari penghisaban wahai penduduk Mekah dan penduduk negeri lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah yang meninggikan langit tanpa tiang} tanpa penyangga {(seperti) yang kalian lihat. Kemudian Dia bersemayam di atas ‘Arasy} naik dan meninggi di atas Arsy, bersemayam sesuai dengan kemuliaan dan keagungannya {dan menundukkan} menundukkan {matahari dan bulan. Masing-masing beredar hingga waktu yang telah ditentukan} sampai waktu yang ditentukan yaitu kencuran dunia {Dia mengatur} mengatur {urusan dan memerinci tanda-tanda} menjelaskan {agar kalian meyakini pertemuan dengan Tuhan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah memberitahukan tentang keesaanNya dalam penciptaan, pengaturan, serta kekuasaan yang menandakan bahwa Dia-lah Dzat satu-satunya yang berhak disembah, tidak sepantasnya ibadah dilakukan kecuali untukNya saja. Allah berfirman, “Allah-lah Yang meninggikkan langit,” sesuai dengan bentuknya yang besar dan begitu luas dengan (menggunakan) kekuasaanNya yang agung “tanpa tiang (sebagaimana) yang kamu lihat,” maksudnya tidak ada tiang dari arah bawahnya. Karena seandainya langit mempunyai tiang, niscaya kalian akan benar-benar menyaksikannya. “Kemudian” usai menciptakan langit dan bumi “Dia bersemayam di atas Arasy,” yang agung yang merupakan makhluk Allah yang berada di tempat paling tinggi, dengan cara isiwa’ (bersemayam) yang selaras dengan keagunganNya dan sesuai dengan kesempurnaanNya. “Dan menundukkan matahari dan bulan,” bagi kepentingan manusia dan kemaslahatan bagi hewan-hewan ternak serta tanaman-tanaman mereka. “Masing-masing,” dari matahari dan bulan “beredar”, atas dasar pengaturan al-‘Aziz al-‘Alim (Yang Mahaperkasa lagi Maha Mengetahui) “hingga waktu yang ditentukan,” dengan bentuk perjalanan yang teratur, tidak lamban dan tidak melemah, sampai datang masa yang telah ditentukan, yaitu saat Allah melipat alam semesta ini dan mengalihkan mereka ke kampung akhirat, yang merupakan tempat hunia abadi. Pada waktu itu, Allah melipat langit-langit dan bulan, serta merubah bumi dan menggantikannya. Matahari dan bulan terbelah dan (disatukan), selanjutnya keduanya dilemparkan di neraka, agar orang yang menyembah keduanya (matahari dan bulan) menyaksikan bahwa keduanya (matahari dan bulan) tidak sepantasnya menerima (ibadah (dari manusia). Dengan kejadian itu, dia akan merasakan penyesalan yang tiada taranya, dan supaya orang-orang kafir mengetahui bahwa mereka sebenarnya telah berbohong. Firman Allah, “Allah mengatur urusan (makhlukNya) dan menjelaskan tanda-tanda (kebesaranNya),” keterangan ini berbentuk kombinasi antara al-Khalqu (kekuasaan dalam menciptakan) dan al-amru (perintah). Maksudnya, Allah al-‘Azhim (Yang Mahaagung) bersemayam di singgasana kerajaan, mengendalikan segala urusan di alam semesta bagian atas dan di bagian bawah. Dia menciptakan dan memberi rizki, membuat orang menjadi kecukupan dan kekurangan, mengangkat derajat sejumlah orang dan menghinakan yang lain. Dia memuliakan dan merendahkan, menurunkan dan mengangkat (tingkatan makhlukNya), memberikan toleransi pada kekeliruan-kekeliruan (makhluk), mengentaskan berbagai permasalahan pelik, mengaktualisasikan berbagai ketentuan takdir di waktu-waktunya yang telah diketahui sebelumnya oleh Allah dan ditulis dengan al-Qalam (penaNya). Allah mendelegasikan para malaikat yang mulia untuk mengatur segala sesuatu, sehingga makhluk berada di bawah pengaturanNYa. Dia menurunkan kitab-kitab ilahiyah (yang berasal dariNya) kepada para RasulNya, menerangkan apa saja yang mereka butuhkan, berupa hukum-hukum syariat, perintah-perintah dan larangan-larangan. Dia memaparkannya dengan sangat gamblang, melalui keterangan dan penjelasan dan pemilah-milahannya. “Supaya kamu,” disebabkan berbagai tanda-tanda kekuasaan alam dan ayat-ayat al-Quran yang sudaha ditampilkan “meyakini pertemuan (mu) dengan Rabbmu”. Karena kuantitas dalil yang banyak, keterangan dan kejelasannya termasuk sebab kausalitas yang bisa menghadirkan keyakinan dalam perkara-perkara ilahiyah (yang berhubungan dengan Allah), terutama dalam perkara-perkara akidah yang sangat prinsipil, seperti Hari Kebangkitan, hari Penyebaran dan keluar dari kubur. Begitu pula, telah diketahui bahwa Allah Mahabijaksana, tidak menciptakan makhluk tanpa tujuan pasti, tidaak membiarkan mereka (dalam permainan) yang sia-sia. Sebagaimana Dia telah mengutus para rasulNya dan menurunkan kitab-kitabNya untuk memerintahkan para hamba dan melarang mereka, maka pasti Dia juga memindahkan mereka menuju tempat pembalasan bagi mereka. Dia akan membalas orang-orang yang berbuat baik dengan balasan terbaik dan membalas orang-orang yang berbuat buruk sesuai keburukan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ) bi ghairi ‘amadin taraunahaa : al-‘amad jamak dari ‘amud (tiang) yang dapat dilihat oleh kalian, karena kata (تَرَوۡنَهَاۖ) na’at (sifat) dari (عَمَدٖ). (ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ) tsummas tawaa ‘alal ‘arsy : istiwa’ yang pantas bagi keagungan-Nya. (وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ) wa sakhkharasy syamsa wal qamar : menundukkan keduanya agar terus berputar di orbitnya untuk menjaga kehidupan hingga sampai ajalnya. Makna ayat : Firman-Nya : (ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ) Bahwa Tuhan kalian Yang Sebenarnya yang harus kalian beriman, beribadah, dan mentauhidkannya, Allah lah yang mengangkat langit di atas bumi tanpa tiang yang terlihat oleh kalian, Dia mengangkatnya dengan kekuasaan-Nya dan sesuai kehendak-Nya. Firman-Nya : (ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ) Setelah menciptakan langit dan bumi, kemudian ber-istiwa bersemayam di atas ‘Arsy-Nya dengan cara yang sesuai dengan keagungan-Nya, mengurus seluruh urusan kerajaan-Nya. Firman-Nya : (وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ) menundukkan keduanya setelah menciptakannya, keduanya berjalan di orbitnya dengan rapih hingga akhir dunia. Firman-Nya (كُلّٞ يَجۡرِي) masing-masing beredar di orbitnya, matahari selesai mengelilingi orbitnya selama satu tahun penuh, dan bulan dalam satu bulan penuh, dan keduanya akan terus seperti itu hingga dunia ini berakhir. Bulan akan kehilangan cahayanya, dan matahari akan redup. Firman-Nya : (يُدَبِّرُ ٱلۡأَمۡرَ) menentukan apa yang Dia kehendaki kepada siapa yang dikehendaki baik di langit atau di dalam bumi, serta mengatur urusan seluruh makhluk, dengan kematian, kehidupan, menghalangi, dan memberi, terserah kehendak-Nya, tidak ada sekutu bagi-Nya dalam pengaturan ini. Firman-Nya : (يُفَصِّلُ ٱلۡأٓيَٰتِ) menjelaskan ayat-ayat Al-Qur’an dengan menyebutkan kisah-kisah, perumpamaan, penjelasan halal dan haram, semuanya untuk mempersiapkan dan menguatkan iman kalian terhadap pertemuan kalian di hadapan Rabb kalian. Sehingga kalian beriman kepada Allah dan menyembah-Nya, mentauhidkan-Nya dalam hal ibadah, sehingga menjadi sempurna jiwa dan akhlak kalian, serta berbahagia di dunia dan di akhirat. Pelajaran dari ayat : • Penetapan akidah tauhid, bahwa tidak ada tuhan yang berhak disembah kecuali Allah. • Penetapan akidah kebangkitan akhir dan pembalasan atas apa yang dikerjakan selama di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 2: Allah Subhaanahu wa Ta'aala memberitakan tentang keesaan-Nya dalam mencipta dan mengatur, dan keesaan-Nya dalam hal kebesaran dan keuasaan-Nya, di mana hal itu menunjukkan bahwa hanya Dia yang berhak disembah satu-satunya. Dia bersemayam di atas ‘Arsy sesuai dengan kebesaran dan kesempurnaan-Nya. ‘Arsy adalah makhluk paling besar yang menjadi atap seluruh makhluk. Untuk maslahat manusia, hewan ternak mereka dan pohon-pohon yang mereka tanam. Yakni sampai hari kiamat, hari di mana Allah melipat alam ini dan memindahkan penghuninya ke negeri akhirat. Ketika itu, Allah Subhaanahu wa Ta'aala melipat langit dan menggantinya, merubah bumi dan menggantinya, matahari dan bulan digulung dan dilipat, lalu disatukan kemudian dijatuhkan ke dalam neraka agar manusia yang pernah menyembahnya menyaksikan langsung bahwa matahari dan bulan tidak pantas disembah sehingga mereka pun menyesal dan agar orang-orang kafir mengetahui bahwa mereka berdusta. Allah Subhaanahu wa Ta'aala yang mengatur semua urusan di alam atas maupun bawah, Dia mencipta dan memberi rezeki, mengkayakan seseorang dan menjadikannya miskin, meninggikan sebagian orang dan merendahkan yang lain, memuliakan dan menghinakan, memaafkan ketergelinciran hamba, menghilangkan derita yang menimpa hamba, menjalankan taqdir-Nya pada waktu-waktu yang telah diketahui-Nya dan mengutus para malaikat untuk mengurus apa yang ditugaskan bagi mereka untuk mengurusnya. Dia pula yang menurunkan kitab kepada rasul-rasul-Nya, menerangkan apa yang dibutuhkan hamba berupa syari’at, perintah dan larangan serta menerangkannya secara rinci. Dengan sebab ayat-ayat-Nya yang ada di ufuk maupun yang ada dalam Al Qur’an. Karena dengan banyaknya dalil, jelas dan rincinya termasuk sebab untuk memperoleh keyakinan dalam semua perkara ilahi, khususnya dalam masalah ‘Aqidah, seperti kebangkitan dan keluarnya manusia dari alam kubur. Di samping itu, sudah maklum bahwa Allah Ta’ala Mahabijaksana, Dia tidak menciptakan makhluk begitu saja dan tidak membiarkan mereka, Dia juga telah mengutus para rasul dan menurunkan kitab, maka tidak dapat tidak mereka harus dipindahkan ke negeri di mana mereka menerima balasan, lalu orang-orang yang berbuat baik dibalas dengan balasan terbaik, sedangkan orang-orang yang berdosa dibalas dengan dosa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 2",
    "description": "Setelah pada ayat sebelumnya Allah menjelaskan bahwa Al-Qur'an adalah benar dari-Nya, lalu pada ayat ini Allah membuktikan kebenarannya melalui keunikan penciptaan alam semesta. Hanya Allah yang meninggikan langit tanpa tiang penyangga sebagaimana yang kamu lihat, kemudian dia bersemayam di atas 'arsy. Dia menundukkan matahari dan bulan di bawah aturan hukum alam-Nya; masing-masing dari keduanya beredar menurut waktu yang telah ditentukan. Dia mengatur urusan makhluk-Nya, baik yang di bumi maupun di langit, dan dia menjelaskan tanda-tanda kebesaran-Nya agar kamu yakin akan pertemuan dengan tuhanmu kelak di akhirat. Usai berbicara tentang matahari dan bulan, Allah melalui ayat ini menjelaskan perihal bumi dan isinya. Dan dia yang maha pencipta adalah tuhan yang juga menghamparkan bumi untuk tempat kamu berdiam, dan menjadikan gunung-gunung yang beragam tingginya, dan sungai-sungai yang mengalir di atas permukaan-Nya. Dan padanya dia menjadikan semua buah-buahan dari bermacam jenisnya secara berpasang-pasangan sehingga dapat berkembang biak. Dia pula yang menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau berpikir."
  }
]