[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Apakah orang yang mengetahui bahwa apa yang datang kepadamu (wahai rasul), dari sisi Allah merupakan kebenaran, lalu mengimaninya, sama seperti orang buta yang tidak dapat melihat kebenaran yang dia tidak Imani? sesungguhnya orang-orang yang dapat mengambil pelajaran hanyalah orang-orang yang berakal lurus. Yaitu orang-orang yang memenuhi perjanjian dengan Allah yang telah diperintahkanNya kepada mereka, dan tidak membatalkan perjanjian teguh yang telah mereka kukuhkan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang yang menjawab panggilan Allah adalah orang-orang yang memenuhi apa yang telah mereka janjikan kepada Allah atau kepada hamba-hamba-Nya, mereka tidak melanggar perjanjian yang disepakati dengan Allah dengan lain-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. الَّذِينَ يُوفُونَ بِعَهْدِ اللهِ (orang-orang yang memenuhi janji Allah) Yakni memenuhi janji yang mereka buat dengan Tuhan mereka, atau dengan sesama makhluk jika mereka berjanji atas nama Allah. وَلَا يَنقُضُونَ الْمِيثٰقَ(dan tidak merusak perjanjian) Yakni perjanjian yang telah mereka teguhkan dan tekankan dengan keimanan dan lain sebagainya. Dan termasuk didalamnya adalah segala yang diwajibkan seseorang atas dirinya sendiri seperti nazar dan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20 Orang-orang yang berakal dan mau berfikir adalah mereka yang memenuhi janji Allah dan janji sebagai hamba. Sehingga mereka melaksanakan kewajiban yang telah Allah berikan, memenuhi hak sesama, dan tidak merusak poin perjanjian yang telah ditetapkan. Mitsaq adalah janji yang teguh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang memenuhi janji Allah dan tidak membatalkan perjanjian} perjanjian yang dibuat dengan Allah atau bersama makhlukNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. Allah berfirman untuk membedakan antara orang-orang yang berilmu dan mengamalkannya dengan orang yang tidak demikian adanya, “Adakah orang yang mengetahui bahwasanya apa yang diturunkan kepadamu dari Rabbmu itu benar,” lalu dia memahami dan mengamalkannya “sama dengan orang yang buta,” yang tidak mengetahui kebenaran sehingga tidak mengamalkannya? Perbedaan antara keduanya bak perbedaan antara langit dan bumi. Oleh karenanya, sudah semestinya seorang hamba mengingat dan berpikir, siapakah di antara dua macam orang itu yang paling bagus kondisinya dan terbaik penghujung kehidupannya, sehingga jalannya diikuti dan dititi di belakang golongannya. Namun, tidak setiap orang mengingat-ingat hal yang bermanfaat dan berbahaya baginya. “Hanyalah orang-orang yang berakal saja yang dapat mengambil pelajaran,” yaitu orang-orang yang mempunyai akal yang matang dan pemikiran yang sempurna, yang merupakan unsur penting alam semesta dan keturunan Adam yang terpilih. Jika engkau menanyakan tentang karakteristik mereka, maka engkau tidak akan menumpai sifat yang lebih baik dari sebutan Allah bagi mereka dengan FirmanNya, “orang-orang yang memenuhi janji Allah,” yang telah Allah amanatkan kepada mereka dan mengikat mereka dengan janji itu, berupa pelaksanaan hak-hakNya secara sempurna lagi komplet. Yang dimaksud dengan menepatinya ialah memenuhi hak-haknya dalam bentuk menyempurnakan dan bersikap tulus terhadapnya. Dan termasuk indikasi pemenuhan hak tersebut, bahwa mereka “tidak merusak perjanjian,” perjanjian yang telah mereka tetapkan sendiri dengan Allah. Seluruh akad, perjanjian, sumpah dan nadzar yang telah diikrarkan seseorang masuk ke dalamnya. Seseorang tidak termasuk dalam kategori ‘ulul albab’ (orang-orang yang berakal) yang mendapatkan pahala kecuali dengan melaksanakannya secara utuh, tidak membatalkan dan menguranginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (ٱلَّذِينَ يُوفُونَ) ini adalah awal penjelasan akan sifat-sifat mereka yang membuahkan datangnya kenikmatan dan kemuliaan, kemudian menyebutkan delapan sifat yang mereka miliki, sebagai berikut : • Menepati janji dan tidak mengingkarinya : (ٱلَّذِينَ يُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا يَنقُضُونَ ٱلۡمِيثَٰقَ) karena agama seseorang tidak dianggap jika ia tidak ada perjanjian sebelumnya. Pelajaran dari ayat : • Keutamaan delapan sifat yang disebutkan dalam ayat-ayat di atas. Yang paling tinggi, memenuhi janjinya kepada Allah, dan yang terendah menutup kesalahan dengan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 20: Yang diambil dari mereka dahulu (lihat Al A’raaf: 172), atau setiap perjanjian yang mereka buat dengan Allah seperti sumpah, nadzar, dsb. Dengan tidak beriman atau dengan meninggalkan kewajiban."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 20",
    "description": "Lul albab yaitu orang yang senantiasa memenuhi janji dengan sesama manusia yang dikukuhkan dengan nama Allah dan tidak melanggar perjanjian tersebut, dan orang-orang yang senantiasa menghubungkan apa yang diperintahkan oleh Allah agar dihubungkan, seperti kekerabatan, dan mereka takut kepada tuhannya dengan menaati segala perintah-Nya dan menjauhi larangan-Nya, dan takut kepada hisab yang buruk dan berat pada hari kemudian, ."
  }
]