[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka adalah orang-orang yang menyambung apa yang diperintahkan Allah untuk dihubungkan, seperti menjalin hubungan silaturahmi dengan kaum kerabat dan (membantu) orang-orang yang membutuhkan, dan selalu merasa diawasi oleh tuhan mereka dan mengkhawatirkan Allah memperhitungkan setiap dosa-dosa mereka dan tidak mengampuni dosa-dosa mereka sedikitpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Mereka adalah orang-orang yang menyambung segala apa yang Allah perintahkan agar disambung, yaitu hubungan rahim kekerabatan, mereka takut kepada Rabb mereka sehingga mendorong mereka melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, mereka takut Allah akan menghisab dosa yang telah mereka perbuat. Barangsiapa yang hisabnya dipersulit, maka dia celaka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-23. Dan orang-orang yang menyambung silaturrahim, membantu orang-orang yang membutuhkan, takut dari ancaman Tuhan mereka, takut dari perhitungan amal yang sulit dilalui yang dapat menjerumuskan ke dalam neraka, bersabar dalam menjalankan ketaatan dan menjauhi kemaksiatan demi meraih keridhaan Allah, mendirikan shalat fardhu pada waktunya, menunaikan zakat wajib dan sedekah secara rahasia dan terang-terangan, melakukan kebaikan untuk menghapus kesalahan. Mereka adalah orang-orang yang memiliki derajat yang tinggi, bagi mereka kesudahan yang baik dalam surga-surga yang mereka tinggali selamanya bersama orang-orang shalih dari bapak-bapak, istri-istri, dan anak-anak mereka; para malaikat masuk ke tempat mereka dari delapan pintu surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَالَّذِينَ يَصِلُونَ مَآ أَمَرَ اللهُ بِهِۦٓ أَن يُوصَلَ (dan orang-orang yang menghubungkan apa-apa yang Allah perintahkan supaya dihubungkan) Seperti silaturrahim. وَيَخْشَوْنَ رَبَّهُمْ(dan mereka takut kepada Tuhannya) Ketakutan yang membawa mereka pada ketaatan dalam menjalankan kewajiban dan menjauhi larangan. وَيَخَافُونَ سُوٓءَ الْحِسَابِ (dan takut kepada hisab yang buruk) Yakni hisab yang terperinci dan memojokkan; barangsiapa yang dihisab dengan hisab yang seperti ini niscaya akhirnya ia akan diazab. Sehingga mereka akan menghisab diri mereka sendiri di dunia sebelum mereka dihisab di akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Apakah kamu ingin diringankan hisabmu pada hari kiamat ? Ja'far bin Muhammad berkata : silaturrahim meringankan hisab seseorang pada hari kiamat, kemudian beliau membaca frman Allah : { وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ } \"Dan orang-orang yang menghubungkan apa-apa yang Allah perintahkan supaya dihubungkan, dan mereka takut kepada Tuhannya dan takut kepada hisab yang buruk\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21 Orang-orang yang menjalankan perintah Allah untuk menyambung tali persaudaraan yaitu silaturrahim dan lainnya. Mereka takut kepada janji terhadap Tuhannya sehingga mereka tidak durhaka. Mereka takut kepada hisab yang buruk, sehingga mereka mengkoreksi diri mereka sendiri sebelum mereka dihisab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang menyambung apa yang diperintahkan Allah untuk disambung, takut kepada Tuhan mereka, dan takut pada hisab yang buruk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Dan orang-orang yang menghubungkan apa-apa yang Allah perintahkan supaya dihubungkan,” hal ini bersifat umum, mencakup seluruh perkara yang diperintahkan oleh Allah untuk dijalin, berupa iman kepadaNya dan kepada RasulNya, mencintaiNya daan mencintai RasulNya, tunduk patuh untuk beribadah kepadaNya semata tanpa menyekutukanNya dengan apa pun, taat kepada RasulNya, menjalin hubungan dengan ayah dan ibu mereka, melalui bakti kepada mereka dengan ucapan dan tindakan, tidak berbuat durhaka kepada mereka, menyambung tali silaturahim dengan kerabat dekat dan handai taulan melalui curahan sikap baik kepada mereka dalam bentuk ucapan maupun perbuatan, menyambung tali silaturahim antara mereka dengan istri-istri, teman-teman, budak belian dengan memenuhi hak mereka secara penuh lagi sempurna, baik hak agama maupun hak duniawi. Faktor sebab yang menjadikan seorang hamba menjalin hubungan yang Allah perintahkan untuk diretas, adalah khasyyatullah (rasa takut kepada Allah) dan khawatir terhadap Hari Perhitungan. Atas dasar itu, Allah berfirman, “Dan mereka takut kepada Rbab mereka,” maksudnya mereka takut kepadaNya. Rasa takut mereka kepada Allah dan kekhawatiran terhadap Hari Perhitungan amalan menghalangi mereka untuk berbuat seenaknya dalam bermaksiat kepada Allah, atau menyepelekan sebagian dari perintah Allah, lantaran takut terhadap siksaan dan mengharapkan pahalaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ) yashiluuna maa amarallahu bihi ay yushal : menyambung hal yang diperintahkan untuk disambung berupa iman, tauhid, dan kekerabatan. Makna ayat : • Menyambung hal yang Allah perintahkan untuk disambung berupa: iman, islam, ihsan, dan kekerabatan. (وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ). • Takut kepada Allah yang membuahkan ketaatan (وَيَخۡشَوۡنَ رَبَّهُمۡ). • Rasa takut akan pertanggung jawaban yang buruk pada hari kiamat nanti, untuk mengintrospeksi diri atas perbuatannya baik yang kecil atau yang besar (وَيَخَافُونَ سُوٓءَ ٱلۡحِسَابِ )."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 21: Yaitu hubungan kekerabatan (silaturahim) dan tali persaudaraan (ukhuwwah). Menurut Syaikh As Sa’diy, ayat ini umum mencakup semua yang diperintahkan Allah untuk dihubungkan, seperti beriman kepada-Nya, beriman kepada Rasul-Nya, beribadah hanya kepada-Nya saja dan menaati Rasul-Nya. Mereka juga menyambung hubungan mereka dengan bapak dan ibu mereka, seperti dengan berbakti dan tidak mendurhakai. Mereka juga menyambung hubungan kekerabatan dengan bersilaturrahim, dan menyambung hubungan dengan lainnya yang diperintahkan untuk disambung, seperti dengan istri, kawan dan budak mereka, yaitu dengan memenuhi hak mereka secara sempurna, baik hak yang terkait dengan agama maupun dunia. Sebab yang menjadikan mereka menyambung apa yang diperintahkan untuk disambung adalah karena mereka takut kepada Allah dan takut terhadap hisab-Nya, sehingga mereka tidak berani bermaksiat atau meremehkan apa yang diperintahkan Allah karena takut kepada siksa-Nya dan berharap kepada pahala-Nya. Yakni ancaman-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 21",
    "description": "An orang-orang yang senantiasa menghubungkan apa yang diperintahkan oleh Allah agar dihubungkan, seperti kekerabatan, dan mereka takut kepada tuhannya dengan menaati segala perintah-Nya dan menjauhi larangan-Nya, dan takut kepada hisab yang buruk dan berat pada hari kemudian, -."
  }
]