[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka adalah orang-orang yang bersabar menghadapi gangguan, bersabar dalam ketaatan dan dari maksiat, dikarenakan mencari ridha tuhan mereka, menjalankan shalat dengan kesempurnaan pelaksannannya, dan membayarkan zakat wajib dan infak yang disunnahkan dari harta benda mereka dalam keadaan sembunyi-sembunyi dan terang-terangan, serta menolak perbuatan buruk dengan kebaikan, sehingga menghapuskannya. Orang-orang yang bersifat demikian, bagi mereka tempat kesudahan yang terpuji di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Mereka adalah orang-orang yang sabar dalam menaati Allah, sabar atas takdir Allah pada mereka, baik yang membahagiakan atau yang menyedihkan, mereka sabar menahan diri dari kemaksiatan kepada Allah demi mendapatkan rida Allah, mereka menegakkan salat secara sempurna, memberikan sebagian dari apa yang Kami berikan kepada mereka, yaitu hak-hak harta yang wajib, juga memberikan sebagian dari harta secara suka rela secara sembunyi-sembunyi karena takut ria dan secara terbuka agar diteladani oleh orang lain, dan mereka menolak keburukan orang yang berbuat buruk kepada mereka dengan berbuat baik kepadanya. Orang-orang yang memiliki sifat tersebut mendapatkan akhir yang baik pada Hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَالَّذِينَ صَبَرُوا۟ ابْتِغَآءَ وَجْهِ رَبِّهِمْ (Dan orang-orang yang sabar karena mencari keridhaan Tuhannya) Yakni bersabar dalam ketaatan kepada Allah dan bersabar dalam menjauhi larangan-larangan-Nya, serta bersabar dalam menjalani takdir yang menyakitkan. وَأَقَامُوا۟ الصَّلَوٰةَ (mendirikan shalat) Yakni yang menjalankannya pada waktunya dan sesuai dengan cara yang disyariatkan Allah dalam doa-doanya dan rukun-rukunnya, dengan penuh kekhusyu’an dan keikhlasan. وَأَنفَقُوا۟ مِمَّا رَزَقْنٰهُمْ(dan menafkahkan sebagian rezeki yang Kami berikan kepada mereka) Mereka menunaikan zakat dari harta mereka, serta menginfakkan harta mereka baik itu infak yang wajib atau yang sunnah. سِرًّا(secara sembunyi) Yakni dengan rahasia. وَعَلَانِيَةً(atau terang-terangan) Agar menjadi panutan bagi orang lain. وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ (serta menolak kejahatan dengan kebaikan) Yakni membalas keburukan yang ditujukan kepada mereka dengan kebaikan; atau mengganti amal buruk mereka dengan amal baik; atau mengganti dosa mereka dengan bertaubat. أُو۟لٰٓئِكَ (orang-orang itulah) Yakni orang-orang yang memiliki sifat-sifat yang disebutkan itu. لَهُمْ عُقْبَى الدَّارِ(yang mendapat tempat kesudahan (yang baik)) Yang mewarisi kehidupan dunia dan meraih surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22 Mereka adalah orang-orang yang sabar untuk melakukan ketaatan kepada Tuhannya, sabar atas ketentuan-Nya, meninggalkan maksiat hanya karena mencari keridhaan Tuhannya, bukan semata untuk tujuan dunia baik kebanggaan atau nama baik atau lainnya. Mereka mendirikan shalat, mensedekahkan sebagian rezeki yang Kami berikan kepada mereka dalam ketaatan, mereka menunaikan zakat baik secara sembunyi atau terang-terangan. Mereka menolak kejahatan dengan kebaikan, orang-orang itulah yang mendapat tempat yang baik yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang bersabar dalam mencari keridhaan Tuhan mereka, mendirikan shalat, menginfakkan sebagian rezeki yang Kami berikan kepada mereka secara sembunyi-sembunyi atau terang-terangan, dan membalas} membalas {keburukan dengan kebaikan} perbuatan buruk dengan perbuatan yang baik {orang-orang itulah yang mendapatkan tempat kesudahan (yang baik)} tempat terpuji di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Dan orang-orang yang sabar,” terhadap segala perintah dengan menaatinya dan semua larangan dengan menahan diri darinya dan menjauhinya, dan (sabar) terhadap seluruh ketentuan Allah yang menyakitkan dengan tidak geram terhadapnya, tapi dengan syarat, sabar tersebut mesti “karena mencari Wajah Rabbnya,” tidak didorong oleh tujuan-tujuan dan kepentingan-kepentingan yang rusak, karena jenis sabar yang bermanfaat ini, yang seorang hamba berusaha mengekang jiwanya karena mencari ridha rabbnya, berharap dekat kepadaNya serta berhasil menggapai pahalaNya, itulah sabar yang merupakan ciri spesifik orang-orang yang beriman. Adapun kesabaran yang telah mengalami percampuran yang tujuannya untuk penempaan diri dan bermuara kepada kebanggaan diri, maka ini bisa muncul dari orang yang baik dan orang yang buruk, orang Mukmin dan orang kafir. Kesabaran demikian ini secara hakikat tidak terpuji. “mendirikan shalat,” dengan memenuhi rukun-rukun dan syarat-syaratnya, serta hal-hal yang menyempurnakannya, baik secara lahiriyah maupun batiniyah. “dan menafkahkan sebagian rizki yang Kami berikan kepada mereka, secara sembunyi-sembunyidan terang-terangan,” termasuk di dalamnya infak-infak (pembayaran-pembayaran) yang wajib, seperti zakat, kaffarah, dan infak-infak yang Sunnah. Mereka mengeluarkan nafkah di saat dibutuhkan, dengan sembunyi-sembunyi atau terang-terangan, “serta menolak kejahatan dengan kebaikan,” barangsiapa yang berulah buruk kepada mereka, melalui ucapan atau perbuatan, maka mereka tidak membalas orang itu dengan hal yang sama, justru menyikapinya dengan berbuat baik kepadanya. Memberi kepada orang yang bakhil kepada mereka, memaafkan orang yang berbuat aniaya kepada mereka, menjalin hubungan dengan orang yang mengucilkan mereka dan bersikap baik kepada orang yang jahat dengan mereka. Kalau mereka membalas orang yang berbuat jelek kepada mereka dengan kebaikan, maka menurutmu, bagaimana (sikap mereka) dengan orang yang tidak berbuat jelek (kepada mereka)? “mereka” adalah orang yang diberi sifat mulia dan perangai yang indah “mereka itulah yang mendapat tempat kesudahan (yang baik)”."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ) wa yadra’uuna bil hasanah : membalas dengan ilmu dan tenang serta bersabar atas gangguan. (عُقۡبَى ٱلدَّارِ) ‘uqbad daar : akhir yang bahagia di negeri akhirat nanti. Makna ayat : • Bersabar dalam ketaatan, menjauhi maksiat, dan ketika datang musibah untuk meraih ridha Allah : (وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ). • Mendirikan salat, yaitu menunaikannya pada waktu-waktunya secara jama’ah beserta syarat, rukun, sunnah, dan adab-adabnya : (وَأَقَامُواْ ٱلصَّلَوٰةَ). • Meninfakkan apa yang telah Allah berikan dengan menunaikan zakat, sedekah baik yang wajib atau yang dianjurkan : (وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ). • Membalas keburukan dengan kebaikan, sehingga menyikapi keburukan yang disebabkan kebodohan dengan kebaikan dan ketenangan, gangguan dengan kesabaran. Firman-Nya : (أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ) bagi mereka akhir yang mulia. Pelajaran dari ayat : • Tafsir kata uqbad daar, yang maknanya adalah surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 22: Baik sabar di atas ketaatan, sabar dalam meninggalkan yang haram, maupun sabar terhadap musibah dengan tidak keluh kesah. Bukan karena mencari perhiasan dunia. Sabar karena mencari keridhaan Allah itulah sabar yang bermanfaat. Adapun sabar yang tujuannya sebagai uji nyali, di mana tujuannya adalah untuk berbangga-bangga, maka sabar tersebut tidaklah terpuji dan sia-sia, nas’alullahas salaamah wal ‘aafiyah. Dengan rukun, syarat, dan pelengkapnya lahir maupun batin. Baik pengeluaran yang wajib seperti zakat dan kaffarat, maupun pengeluaran yang sunat. Seperti tindak kebodohan dari orang lain dengan sikap hilm (santun), gangguan dengan kesabaran, memberi ketika tidak diberi, memaafkan ketika dizalimi, menyambung hubungan ketika diputuskan dan membalas dengan kebaikan orang yang berbuat jahat kepada mereka. Di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 22",
    "description": "-tempat kesudahan yang baik itu adalah surga-surga 'adn; mereka masuk ke dalamnya bersama dengan orang yang saleh yang beriman dan taat kepada Allah dari nenek moyangnya, pasangan-pasangannya, dan anak cucunya. Lebih dari itu, mereka pun mendapat layanan yang sangat membahagiakan, sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu."
  }
]