[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tempat kesudahan (yang terpuji) itu adalah surga-surga Adn, mereka tinggal disana, tidak berpindah darinya. dan tinggal bersama mereka, orang-orang shalih dari orangtua, istri dan anak keturunan mereka, baik yang lelaki maupun perempuan. Dan malaikat-malaikat datang masuk menemui mereka dari semua pintu, untuk memberi selamat kepada mereka atas keberhasilan memasuki surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Akhir yang baik itu adalah Surga yang mereka tinggal di dalamnya dengan mendapatkan nikmat-nikmat yang abadi, dan di antara kesempurnaan nikmat yang mereka dapatkan adalah masuknya bapak-bapak, ibu-ibu, istri-istri dan anak-anak mereka yang saleh bersama mereka, hal ini menambah ketenangan mereka karena bisa berkumpul dengan orang-orang tersebut. Dan para Malaikat mendatangi mereka untuk menyampaikan ucapan selamat dari segala pintu di tempat mereka di Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. جَنّٰتُ عَدْنٍ ((yaitu) surga ‘Adn) Surga sebagai tempat tinggal abadi bagi penghuninya. وَمَن صَلَحَ مِنْ ءَابَآئِهِمْ (bersama-sama dengan orang-orang yang saleh dari bapak-bapaknya) Mencakup bapak dan ibu mereka. وَأَزْوٰجِهِمْ وَذُرِّيّٰتِهِمْ ۖ( isteri-isterinya dan anak cucunya) Agar mereka mendapatkan kesejahteraan yang sempurna dengan bertemu dengan orang-orang tercinta mereka. Allah menyebutkan kata “shalih” dalam ayat ini sebagai dalil bahwa kerabat mereka yang tidak termasuk orang-orang yang shalih tidak dapat masuk surga. Tidak hanya dengan menjadi ibu bapak, pasangan, atau keturunannya saja tanpa menjadi orang yang shalih. وَالْمَلٰٓئِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍ(sedang malaikat-malaikat masuk ke tempat-tempat mereka dari semua pintu) Dari seluruh pintu tempat tinggal yang mereka diami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23 Tempat tinggal yang baik itu adalah surga yang kekal, mereka masuk ke dalamnya bersama-sama dengan bapak-bapak mereka, isteri-isteri dan anak cucu mereka. Sekalipun jika ketakwaan dan kesalehan keluarga mereka tidak semisal dengan mereka. Itu sebagai penghormatan dengan memepertemukan mereka dengan orang-orang yang mereka cintai untuk kebahagiaan mereka. Adapun malaikat-malaikat masuk ke tempat-tempat mereka dari semua pintu sambil berucap kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Yaitu) surga-surga ‘Adn} yang tetap dan kekal {Mereka memasukinya bersama orang shalih dari leluhur, pasangan-pasangan, dan keturunan-keturunan mereka, dan malaikat-malaikat masuk ke tempat mereka dari semua pintu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. Allah menjelaskannya (terdapat kesudahan yang baik) dengan FirmanNya “(yaitu) surga ‘Adn,” artinya surga tempat menetap, mereka tidak akan terpisahkan darinya, dan mereka tidak mengharapkan relokasi ke tempat lain sebagai gantinya. Sebab, mereka tidak menyaksikan ada tempat lain yang lebih baik, lantaran sarat dengan kenikmatan dan kebahagiaan, yang menjadi puncak segala obsesi dan tujuan. Termasuk bagian dari kesempurnaan kenikmatan dan kebahagiaan pandangan mereka, bahwa “mereka masuk ke dalamnya bersama dengan orang-orang shalih dari bapak-bapaknya, istri-istrinya dan anak cucunya,” dari kaum lelaki, perempuan dan pasangan-pasangan mereka, maksudnya suami atau istri mereka. Begitu pula orang-orang semisal mereka, orang yang menyerupai mereka, dan kawan, serta orang-orang yang mereka cintai, semua masuk dalam makna ‘pasangan-pasangan dan keturunan-keturunan mereka.’ “Sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu,” untuk menyambut mereka dengan ucapan selamat dan (menyampaikan) karamah Allah untuk mereka. Para malaikat itu mengucapkan, “Keselamatan atasmu,” keselamatan dan penghormatan dari Allah telah menghampiri kalian dan menjadi milik kalian. Kondisi demikian ini, berimplikasi lenyapnya segala hal yang dibenci dan munculnya semua yang disukai “berkat kesabaranmu,” kesabaran kalianlah yang mengantarkan kalian menuju kedudukan nan tinggi dan surga yang sangat bernilai, “maka alangkah baiknya tempat kesudahan itu,” maka sepatutnya orang yang menuluskan dirinya, -dan menurut pandangannya surga mempunyai nilai tinggi-, untuk memperolehnya dengan usaha keras, semoga ia ikut mengambil bagian dari karakteristik orang-orang yang berakal itu. Semoga, ia bisa beruntung mendapatkan tempat kesudahan tersebut yang menjadi impian manusia dan kebahagiaan jiwa, yang menyatukan berbagai kelezatan dan kesenangan. Dan untuk haal semacam itu, hendaknya orang-orang beramal dan berlomba-lomba."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (جَنَّٰتُ عَدۡنٖ) jannaatu ‘adn : surga-surga tempat tinggal yang abadi. Makna ayat : Tempat yang mulia dijelaskan dengan firman-Nya : (جَنَّٰتُ عَدۡنٖ) tempat tinggal yang tidak ada di sana rasa haus bagi orang-orang yang masuk ke dalamnya, mereka adalah “orang-orang yang saleh dari bapak-bapaknya, isteri-isterinya dan anak cucunya,” kebaikan di sini adalah iman dan amal saleh. Firman-Nya : (وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ) ini terjadi ketika mereka hendak memasuki surga, para malaikat masuk dan menyambut mereka atas keselamatan dan teraihnya cita-cita."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 23: Surga sebagai tempat bermukim, di mana mereka tidak akan pindah darinya, dan tidak menginginkan pindah darinya, karena mereka tidak melihat kenikmatan yang lebih dari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 23",
    "description": "Tempat kesudahan yang baik itu adalah surga-surga 'adn; mereka masuk ke dalamnya bersama dengan orang yang saleh yang beriman dan taat kepada Allah dari nenek moyangnya, pasangan-pasangannya, dan anak cucunya. Lebih dari itu, mereka pun mendapat layanan yang sangat membahagiakan, sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu. Para malaikat masuk untuk memberi mereka selamat, selamat sejahtera atasmu. Kamu telah selamat dari segala siksa karena di dunia kamu telah menunjukkan kesabaranmu yang tinggi dalam menaati Allah. Maka alangkah nikmatnya surga tempat kesudahan yang telah Allah sediakan itu."
  }
]