[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malaikat berkata kepada mereka, ”selamat atas kalian sebagai salam penghormatan bagi kalian. kalian telah selamat dari semua keburukan, dikarenakan kesabaran kalian untuk taat kepada Allah. Maka sebaik-baik tempat kesudahan adalah surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Penghormatan para Malaikat manakala mereka datang kepada penghuni-penghuni Surga itu adalah ucapan salāmun 'alaikum, yakni kalian selamat dari malapetaka berkat kesabaran kalian di atas ketaatan kepada Allah, di atas takdir-Nya yang pahit dan dari kemaksiatan kepada-Nya, sebaik-baik rumah tempat tinggal adalah rumah kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Para malaikat memberi mereka penghormatan: “Keselamatan bagi kalian dari segala keburukan dan hal yang tidak diinginkan berkat kesabaran kalian, sebaik-baik tempat tinggal adalah surga.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. سَلٰمٌ عَلَيْكُم ((sambil mengucapkan): “Salamun ‘alaikum) Yakni keselamatan bagi kalian dari segala kekurangan. بِمَا صَبَرْتُمْ ۚ(atas kesabaran kamu semua”) Berkat kesabaran kalian dalam ketaqwaan kepada Allah. فَنِعْمَ عُقْبَى الدَّارِ(Maka alangkah baiknya tempat kesudahan itu) Ini merupakan sanjungan bagi tempat kediaman yang diberikan kepada mereka yang telah disebutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24 “Keselamatan untuk kalian, kalian selamat dari berbagai kesulitan atas kesabaran yang telah kalian dalam ketaatan dan ketakwaan, kesabaran dalam meninggalkan maksiat”. Maka alangkah baiknya surga ini sebagai tempat tinggal bagi kalian wahai orang-orang yang senantiasa berbuat kebaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Semoga keselamatan tercurah kepada kalian atas kesabaran kalian” Sebaik-baiknya tempat kesudahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-24. Allah menjelaskannya (terdapat kesudahan yang baik) dengan FirmanNya “(yaitu) surga ‘Adn,” artinya surga tempat menetap, mereka tidak akan terpisahkan darinya, dan mereka tidak mengharapkan relokasi ke tempat lain sebagai gantinya. Sebab, mereka tidak menyaksikan ada tempat lain yang lebih baik, lantaran sarat dengan kenikmatan dan kebahagiaan, yang menjadi puncak segala obsesi dan tujuan. Termasuk bagian dari kesempurnaan kenikmatan dan kebahagiaan pandangan mereka, bahwa “mereka masuk ke dalamnya bersama dengan orang-orang shalih dari bapak-bapaknya, istri-istrinya dan anak cucunya,” dari kaum lelaki, perempuan dan pasangan-pasangan mereka, maksudnya suami atau istri mereka. Begitu pula orang-orang semisal mereka, orang yang menyerupai mereka, dan kawan, serta orang-orang yang mereka cintai, semua masuk dalam makna ‘pasangan-pasangan dan keturunan-keturunan mereka.’ “Sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu,” untuk menyambut mereka dengan ucapan selamat dan (menyampaikan) karamah Allah untuk mereka. Para malaikat itu mengucapkan, “Keselamatan atasmu,” keselamatan dan penghormatan dari Allah telah menghampiri kalian dan menjadi milik kalian. Kondisi demikian ini, berimplikasi lenyapnya segala hal yang dibenci dan munculnya semua yang disukai “berkat kesabaranmu,” kesabaran kalianlah yang mengantarkan kalian menuju kedudukan nan tinggi dan surga yang sangat bernilai, “maka alangkah baiknya tempat kesudahan itu,” maka sepatutnya orang yang menuluskan dirinya, -dan menurut pandangannya surga mempunyai nilai tinggi-, untuk memperolehnya dengan usaha keras, semoga ia ikut mengambil bagian dari karakteristik orang-orang yang berakal itu. Semoga, ia bisa beruntung mendapatkan tempat kesudahan tersebut yang menjadi impian manusia dan kebahagiaan jiwa, yang menyatukan berbagai kelezatan dan kesenangan. Dan untuk haal semacam itu, hendaknya orang-orang beramal dan berlomba-lomba."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Malaikat menyalami mereka seraya berkata : \"Salamun 'alaikum bima shabartum\" karena kesabaran kalian serta iman dan ketaatan (Maka alangkah baiknya tempat kesudahan itu.) ini adalah ucapan selamat dari para malaikat kepada mereka, ucapan selamat yang paling agung, dan paling penuh berkah. Ya Allah, masukkanlah aku, kedua orang tuaku, keluargaku, dan seluruh kaum muslimin bersama mereka. Pelajaran dari ayat : • Penjelasan bahwa para malaikat menyambut dan memberi salam kepada mereka para penghuni surga ketika memasuki surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 24: Dari Allah Ta’ala. Ucapan selamat ini mengandung hilangnya semua yang tidak diinginkan dan diperolehnya semua yang diinginkan. Oleh karena itu, bagi mereka yang memiliki perhatian dalam untuk kebahagiaan dirinya, maka hendaknya ia berjihad melawan hawa nafsunya agar termasuk mereka yang disebut Allah sebagai orang-orang yang berakal sehingga memperoleh keberuntungan di akhirat, Allahumaj’alnaa minhum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 24",
    "description": "Para malaikat masuk untuk memberi mereka selamat, selamat sejahtera atasmu. Kamu telah selamat dari segala siksa karena di dunia kamu telah menunjukkan kesabaranmu yang tinggi dalam menaati Allah. Maka alangkah nikmatnya surga tempat kesudahan yang telah Allah sediakan itu. Dan sebagai kebalikan dari mereka yang menerima kebenaran adalah orang-orang yang menolak kebenaran dengan melanggar dan membatalkan janji dengan sesama manusia yang dikukuhkan dengan nama Allah setelah diikrarkannya, dan memutuskan apa yang diperintahkan Allah agar disambungkan, seperti hubungan kekerabatan, dan berbuat kerusakan di bumi dengan bermaksiat; mereka itu memperoleh kutukan sehingga jauh dari rahmat Allah, dan tempat kediaman yang buruk'neraka jahanam."
  }
]