[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapaun orang-orang yang celaka, sungguh mereka telah disifati dengan sifat-sifat yang berlawanan dengan sifat-sifat kaum mukminin. Mereka tidak memenuhi perjanjian dengan Allah untuk mengesakan Allah dengan ibadah, setelah meneguhkan janji itu pada diri mereka. Dan mereka adalah orang-orang yang memutus hal yang Allah perintahkan mereka untuk menyambungnya, seperti menyambung hubungan kekerabatan dan lain-lain dan melakukan kerusakan di muka bumi dengan berbuat maksiat-maksiat. Orang-orang yang berkarakter buruk ini, mereka dijauhkan dari rahmat Allah, dan bagi mereka hukuman yang memperburuk keadaan mereka berupa siksaan yang keras di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. \"Orang-orang yang melanggar perjanjian dengan Allah sesudah disepakati, memutuskan apa yang Allah perintahkan agar disambung yaitu silaturrahmi, mereka itulah orang-orang sengsara yang dijauhkan dari rahmat Allah, bagi mereka akhir yang buruk yaitu api Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dan orang-orang yang melanggar perjanjian yang teguh dengan Allah, memutus hubungan kekeluargaan dan lainnya, membuat kerusakan di muka bumi dengan kekafiran, kezaliman, dan kemasiatan. Mereka adalah orang-orang yang jauh dari kebenaran dan mendapat laknat dari Allah yang tiada henti, bagi mereka azab yang buruk di kehidupan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَيُفْسِدُونَ فِى الْأَرْضِ ۙ (dan mengadakan kerusakan di bumi) Dengan kekafiran, kemaksiatan, dan merusak diri dan harta. لَهُمُ (mereka memperoleh) Dengan perbuatan tersebut. اللَّعْنَةُ (kutukan) Yakni dijauhkan dari rahmat Allah. وَلَهُمْ سُوٓءُ الدَّارِ (dan bagi mereka tempat kediaman yang buruk) Yakni tempat kesudahan yang buruk setelah kehidupan dunia berupa azab neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25 Adapun orang-orang yang merusak janji Allah setelah diikrarkan dengan teguh untuk senantiasa taat, dan memutuskan perintah Allah supaya menyambung tali persaudaraan, serta mengadakan berbagai kerusakan di bumi dengan kekafiran, kezaliman dan fitnah, maka orang-orang itulah yang akan dijauhkan dari rahmat Allah sehingga memperoleh kutukan dan akan ditempatkan di tempat yang buruk di akhirat yaitu neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang melanggar perjanjian Allah setelah diteguhkan} dikuatkan {memutus apa yang diperintahkan Allah untuk disambung, dan berbuat kerusakan di bumi. Mereka itulah orang-orang yang mendapat laknat} dijauhkan dari rahmat Allah {dan bagi mereka tempat kediaman yang buruk} tempat yang buruk di akhirat yatiu neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Usai menceritakan mengenai sifat-sifat penduduk surga, Allah menyebutkan bahwa penduduk neraka berada dalam karakter yang berlawanan dengan sifat-sifat yang Allah ceritakan mengenai para penghuni surga. Allah berfirman tentang mereka, “Orang-orang yang merusak janji Allah setelah diikrarkan dengan teguh,” sesudah ditekankan dan ditegaskan oleh Allah atas mereka melalui kehadiran para rasulNya, maka mereka tidak menyikapinya dengan kesetiaan dan penyerahan diri. Justru menghdapinya dengan sikap berpaling dan mencampakkannya. “dan memutuskan apa-apa yang Allah perintahkan supaya dihubungkan,” mereka itu tidak sudi menyambung hubungan antara mereka dengan Rabb mereka dengan keimanan dan amalan shalih, tidak juga menjalin hubungan dengan handai taulan, tidak melaksanakan hak-hak (orang-orang). Justru melaksnakan kerusakan di dunia dengan kekufuran, maksiat dan menghalangi orang dari jalan Allah sserta mengharapakannya (jalan itu) menjadi bengkok. “Orang-orang itulah yang memperoleh kutukan” maksudnya pengusiran dan celaan dari Allah, para malaikat dan kaum Mukminin. “Dan mereka mendapatkan tempat kediaman amat buruk,” yaitu Neraka Jahim dengan segala siksaan yang pedih di dalamnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ) walladziina yanqudhuuna ‘ahdallah : mengingkari dan tidak konsisten dengannya, tidak hanya menyembah kepada Allah saja. (وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ) wayaqtha’uuna maa amarallah bihii ayyuushal : memutus keimanan dan kekerabatan. (وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ) wayufsiduuna filardh : dengan meninggalkan shalat, tidak menunaikan zakat, melakukan keburukan, dan meninggalkan kebajikan. (لَهُمُ ٱللَّعۡنَةُ) lahumul la’nah : jauh dari rahmat Allah ta’ala. (وَلَهُمۡ سُوٓءُ ٱلدَّارِ) wa lahum suu’uddaar : Jahanam, seburuk-buruk tempat kembali. Makna ayat : Firman-Nya : (وَٱلَّذِينَ يَنقُضُونَ) ini adalah sisi negatif atau kepribadian kedua seseorang yang tidak berilmu dan tidak beriman, seperti Abu Jahal, lawan dari Hamzah bin Abdul Muthallib radhiyallahu ‘anhu, Allah menyebutkan di sini sifat-sifat yang mendatangkan azab-Nya dan terhalangnya dari rahmat-Nya. Menyebutkan sifat-sifat berikut yang dimilikinya atau orang yang sejenis dengannya : • Mengingkari janji, tidak beribadah kepada Allah, tidak mentauhidkan-Nya. Janji itu adalah janji yang diambil ketika masih berada di alam ruh (وَٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ). • Memutus perkara yang Allah perintahkan untuk disambung: iman dan silaturahmi (وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ). • Membuat kerusakan di muka bumi dengan syirik dan maksiat : (وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِ). Dengan sifat-sifat ini mereka pantas mendapatkan balasan ini. Firman-Nya : (أُوْلَٰٓئِكَ لَهُمُ ٱللَّعۡنَةُ ) yaitu jauh dari rahmat-Nya (وَلَهُمۡ سُوٓءُ ٱلدَّارِ) Jahanam, seburuk-buruk tempat kembali, Pelajaran dari ayat : • Tidak boleh mengikuti sifat-sifat orang yang celaka; mengingkari janji, memutus perkara yang Allah perintahkan untuk disambung, membuat kerusakan di muka bumi dengan kesyirikan dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 25: Setelah Allah menyebutkan keadaan penghuni surga, Allah menyebutkan keadaan penghuni neraka. Yang disampaikan melalui para rasul, lalu mereka tidak mau tunduk dan menerima, bahkan malah berpaling dan melanggarnya. Mereka tidak menyambung hubungan mereka dengan Tuhan mereka dengan iman dan amal saleh, dan tidak menyambung hubungan mereka dengan kerabat dengan bersilaturrahim, dan mereka tidak memenuhi hak-hak, bahkan mengadakan kerusakan di bumi dengan berbuat kekafiran dan kemaksiatan serta menghalangi manusia dari jalan Allah dan menginginkannya menjadi bengkok. Dijauhkan dari rahmat Allah, dan mendapatkan celaan dari Allah, malaikat-Nya dan hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 25",
    "description": "Dan sebagai kebalikan dari mereka yang menerima kebenaran adalah orang-orang yang menolak kebenaran dengan melanggar dan membatalkan janji dengan sesama manusia yang dikukuhkan dengan nama Allah setelah diikrarkannya, dan memutuskan apa yang diperintahkan Allah agar disambungkan, seperti hubungan kekerabatan, dan berbuat kerusakan di bumi dengan bermaksiat; mereka itu memperoleh kutukan sehingga jauh dari rahmat Allah, dan tempat kediaman yang buruk'neraka jahanam. Allah yang maha pemurah melapangkan rezeki bagi siapa yang dia kehendaki dan membatasi rezeki siapa yang dia kehendaki dari hambahamba-Nya. Mereka yang ingkar bergembira ria dengan kebahagian hidup yang mereka peroleh di kehidupan dunia, padahal kehidupan dunia hanyalah kesenangan yang berlangsung begitu singkat dibanding kehidupan akhirat yang kekal dan abadi."
  }
]