[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah semata yang melapangkan rizki bagi siapa saja yang Dia kehendaki dari hamba-hambaNya dan mempersempit rizki bagi orang yang Dia kehendaki dari mereka. Dan orang-orang kafir begitu bergembira dengan keluasan rizki di kehidupan dunia. Dan tidaklah kehidupan dunia ini dibandingkan dengan kehidupan akhirat, kecuali sesuatu yang amat sedikit yang dinikmati begitu saja, yang akan cepat sirna."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkannya atas siapa yang Dia kehendaki dari hamba-hamba-Nya. Rezeki yang lapang bukan berarti kebahagiaan dan bukan bukti bahwa Allah mencintainya, sempitnya rezeki bukan tanda kesengsaraan. Orang-orang kafir berbahagia dengan kehidupan dunia ini, maka mereka cenderung kepadanya dan merasa tenteram kepadanya, padahal kehidupan dunia ini dibandingkan dengan kehidupan Akhirat hanyalah kesenangan yang sementara dan sedikit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Allah menyampaikan perbedaan rezeki di antara manusia; Dia meluaskan rezeki bagi hamba-Nya yang Dia kehendaki, dan menyempitkan rezeki bagi hamba-Nya yang lain. Adapun orang-orang kafir sangat bahagia dengan keluasan rezeki di kehidupan dunia yang fana, padahal kehidupan dunia jika dibandingkan dengan kehidupan akhirat tidak lain kenikmatan dan waktunya tidak seberapa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. اللهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ (Allah meluaskan rezeki dan menyempitkannya bagi siapa yang Dia kehendaki) Terkadang Allah meluaskan rezeki orang kafir, dan menyempitkan rezeki orang beriman sebagai ujian dan cobaan. Keluasan rezeki tidak menunjukkan kehormatan seseorang dan dan tidak pula kesempitan sebagai kehinaan. وَفَرِحُوا۟ بِالْحَيَوٰةِ الدُّنْيَا (Mereka bergembira dengan kehidupan di dunia) Dan tidak mengetahui apa yang ada di sisi Allah. وَمَا الْحَيَوٰةُ الدُّنْيَا فِى الْاٰخِرَةِ إِلَّا مَتٰعٌ(padahal kehidupan dunia itu (dibanding dengan) kehidupan akhirat, hanyalah kesenangan (yang sedikit)) Yakni jika dibandingkan dengan akhirat maka dunia adalah sesuatu yang sangat sedikit dan akan sirna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26 Allah meluaskan rezeki dan juga menyempitkannya bagi siapapun yang Dia kehendaki. Kelapangan rezeki tidak selalu berarti sebagai rahmat Allah, begitu juga kesempitan tidak berarti selalu berarti kemurkaan Allah. Adapun kegembiraan penduduk Makkah dengan kehidupan di dunia yang lapang, dan tidak tahu kemuliaan yang ada di sisi Allah. Padahal kehidupan dunia itu jika dibanding dengan kehidupan akhirat, hanyalah kesenangan yang sedikit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dan menyempitkan} dan menyempitkan siapa saja yang dikehendaki {Mereka bergembira dengan kehidupan dunia, dan tidaklah kehidupan dunia itu dibandingkan akhirat melainkan hanya kesenangan} sesuatu yang sedikit dan akan hilang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allaha semata-lah yang meluaskan dan melapangkan rizki bagi orang-orang yang dikehendakiNya. “Mereka bergembira,” yakni orang-orang kafir “dengan kehidupan dunia,” dengan kegembiraan yang menyebabkan mereka merasa nyaman dengannya dan melalaikan akhirat. Hal itu sebabnya adalah kekurangan akal pada mereka, “padahal kehidupan dunia itu (dibanding dengan) kehidupan akhirat, hanyalah kesenangan (yang sedikit),” merupakan sesuatu yang hina, dinikmati dalam waktu sekejap, kemudian berpisah dari pemiliknya dan orang-orang yang menggemgamnya, dan akhirnya akan melahirkan banyak kesulitan bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَيَقۡدِرُۚ) wa yaqdir : menyempit dan sedikit. (إِلَّا مَتَٰعٞ) illaa mataa’ : bersenang-senang dengannya sebentar kemudian habis. Makna ayat : Firman-Nya : (ٱللَّهُ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا مَتَٰعٞ) Allah ta’ala mengabarkan ketentuan dari semua ketentuan-Nya pada makhluk-Nya yaitu Dia (يَبۡسُطُ ٱلرِّزۡقَ) melapangkan rezeki untuk siapa pun yang Dia kehendaki sebagai ujian, apakah ia bersyukur atau ingkar? Dan juga menyempitkan dan mengurangi rizki siapa pun yang Dia kehendaki sebagai cobaan, apakah ia bersabar atau mengeluh? Terkadang Dia melapangkan rizki bagi sebagian yang pantas untuk diberi keluasan dan terkadang Dia juga menyempitkan orang yang pantas untuk disempitkan. Kekayaan tidak akan menjadi tolak ukur keridhaan Allah dan tidak pula kefakiran tanda akan murka-Nya ta’ala atas hamba-hamba-Nya. Firman-Nya : (وَفَرِحُواْ بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا) Orang-orang kafir berbahagia dengan kehidupan dunia karena ketidaktahuan mereka akan durasi, akhir, dan buruknya efek yang ditinggalkannya, tidaklah dunia jika dibandingkan dengan apa yang Allah sediakan bagi para wali-Nya—mereka adalah orang-orang yang beriman dan taat kepada-Nya—kecuali hanya sedikit. Seperti segenggam kurma atau sepotong roti yang diberikan kepada seorang pengembala sebagai bekal selama siang hari, kemudian habis. Pelajaran dari ayat : • Penjelasan bahwa kaya dan miskin keduanya terjadi sesuai dengan ilmu Allah ta’ala sebagai ujian dan cobaan, keduanya tidak menunjukkan keridhaan Allah tidak pula murka-Nya. • Rendahnya dunia dan perhiasan-perhiasan yang ada padanya akan hilang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 26: Karena apa yang mereka peroleh darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 26",
    "description": "Allah yang maha pemurah melapangkan rezeki bagi siapa yang dia kehendaki dan membatasi rezeki siapa yang dia kehendaki dari hambahamba-Nya. Mereka yang ingkar bergembira ria dengan kebahagian hidup yang mereka peroleh di kehidupan dunia, padahal kehidupan dunia hanyalah kesenangan yang berlangsung begitu singkat dibanding kehidupan akhirat yang kekal dan abadi. Demikianlah Allah menjelaskan balasan bagi orang yang enggan menerima kebenaran dan orang kafir yang hanya mengejar kesenangan duniawi. Dan tidak hanya menolak kebenaran, orang-orang kafir juga berkata dengan nada mengejek, mengapa tidak diturunkan kepadanya (nabi Muhammad) tanda berupa mukjizat yang dapat dilihat secara kasat mata dari tuhannya, seperti halnya mukjizat nabi musa dan isa' katakanlah, wahai nabi Muhammad, sesungguhnya Allah menyesatkan'membiarkan sesat'siapa yang dia kehendaki karena keingkarannya sendiri, betapapun banyak mukjizat yang dilihatnya, dan Allah memberi petunjuk bagi orang yang bertobat dan kembali kepada-Nya, ."
  }
]