[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah memberikan petunjuk bagi orang-orang yang hatinya tentram dengan tauhidullah dan mengingatNYa, sehingga menjadi tenang dengannya. Ingatlah dengan ketaatan kepada Allah dan mengingatNya serta dengan pahala dariNya, hati menjadi tenang dan damai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Orang-orang yang Allah beri petunjuk adalah orang-orang yang beriman, hati mereka merasa tenang dengan mengingat Allah, bertasbih dan bertahmid kepada Allah, membaca dan mendengar Kitab-Nya, ingatlah bahwa ketenangan hati diwujudkan dengan mengingat Allah, sudah selayaknya ia demikian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. الَّذِينَ ءَامَنُوا۟ ((yaitu) orang-orang yang beriman) Mereka adalah orang-orang yang diberi petunjuk oleh Allah dan yang bertaubat kepada-Nya. وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللهِ ۗ( dan hati mereka manjadi tenteram dengan mengingat Allah) Yakni yang menjadi tenang dan tentram dengan berzikir kepada Allah dengan lisan mereka, seperti membaca al-Qur’an, bertasbih, bertahmid, bertakbir, bertahlil, atau dengan mendengarkan zikir tersebut dari orang lain. أَلَا بِذِكْرِ اللهِ(Ingatlah, hanya dengan mengingati Allah-lah) Tanpa menyebut selain-Nya. تَطْمَئِنُّ الْقُلُوبُ(hati menjadi tenteram) Meskipun mentafakkuri makhluk-makhluk Allah, ciptaan-ciptaan, dan mukjizat-mukjizat-Nya secara umum menjadikan hati menjadi tentram, namun hasilnya tidak seperti ketentraman dengan berzikir kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28 Mereka adalah orang-orang yang beriman kepada Allah dan kitab-Nya. Hati mereka manjadi tenteram dengan mengingat Allah dan mengingat janji kepada-Nya.. Ingatlah, hanya dengan mengingati Allah dan kekuasaan-Nya lah hati bisa menjadi tenteram"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang beriman dan hati mereka menjadi tenteram} tenang {dengan mengingat Allah. Ingatlah bahwa dengan mengingat Allah hati akan tenteram"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Berikutnya, Allah menyebutkan tanda kaum Mukminin. Allah berfirman, “(Yaitu) orang-orang yang beriman dan hati mereka menjadi tentram dengan mengingat Allah,” maksudnya, kegundahan dan kegelisahannya (hati mereka) lenyap dan berganti dengan kebahagiaan hati dan kenikmatan-kenikmatannya. “Ingatlah, hanya dengan mengingati Allah-lah hati menjadi tentram,” maksudnya , semestinya dan sudah seyogyanya, kalbu-kalbu itu tidak menjadi tenang dengan sesuatu selain dengan mengingatNya. Karena tidak ada sesuatu pun yang lebih nikmat, lebih memikat dan lebih manis bagi kalbu ketimbang (kenikmatan dalam) mencintai Penciptanya, berdekatan dan mengenalNya. Berdasarkan tingkat ma’rifah (pengenalan)nya dan kecintaannya kepada Allah-lah tingkat intensitas dzikirnya kepada Allah. Demikian ini, merujuk keterangan bahwa dzikrullah yang dimaksud adalah seorang hamba yang mengingat Allah dengan lantutan tasbih, tahlil, takbir dan lain-lain. Ada yang menafsirkan bahwa ‘dzikrullah’ maksudnya kitabNya yang diturunkan sebagai dzikra (peringatan) bagi kaum Mukminin. Atas dasar ini, maka thuma’ninah al-Qalbi (ketenangan hati) dengan dzikrullah yakni ketika mengenal makna-makna al-Quran dan hukum-hukumnya, hati menjadi tenang dengannya. Sebab, hal-hal itu akan menunjukkannya kepada kebenaran yang nyata yang didukung oleh dalil-dalil dan bukti-bukti. Dengan itu, hati akan menjadi tentram. Sungguh, hati tidak akan tenang kecuali dengan sebuah keyakinan dan ilmu. Hal ini sudah dijamin dalam KItabullah dengan jaminan dalam bentuk yang paling sempurna dan paripurna. Sedangkan kitab-kitab lainnya yang tidak mengacu kepada dzikir, maka hati tidak merasakan ketentraman dengannya. Bahakan akan senantiasa dilanda kebingungan karena adanya kontradiksi antar dalil dan unsur pertentangan antar hukum yang ada. \"Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.\" (An-Nisa:82) Masalah ini hanya diketahui oleh orang-orang yang menguasai seluk-beluk Kitabullah, menghayatinya dan mencermati kitab-kitab lainnya yang mengandung berbagai jenis ilmu (untuk memperbandingkannya), niscaya dia akan menjumpai perbedaan tajam antara al-Quran dan kitab-kitab lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya pada ayat (28) : (ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ) merekalah orang-orang yang kembali kepada-Nya ta’ala dengan keimanan dan tauhid, sehingga Dia memberikan mereka petunjuk menuju jalan yang lurus, (وَتَطۡمَئِنُّ قُلُوبُهُم) hati mereka tenang dan tentram dengan berdzikir kepada Allah, mengingat janji-Nya, menyebut orang-orang saleh dari hamba-Nya Muhammad shallahu ‘alaihi wa sallam dan para sahabatnya. Firman-Nya : (أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ) “Ingatlah, hanya dengan mengingati Allah-lah hati menjadi tenteram.” yaitu hati orang-orang yang beriman, adapun hati orang-orang yang kafir menjadi tenang dengan mengingat dunia dan kenikmatan-kenikmatannya dan orang musyrik menjadi tenang dengan mengingat berhala-berhala mereka. Pelajaran dari ayat : • Keutamaan mengingat Allah dan tentramnya hati dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 28: Dan memang patut demikian. Hal itu, karena tidak ada yang lebih nikmat bagi hati dan lebih manis baginya daripada mencintai Tuhannya, dekat dengan-Nya dan mengenal-Nya. Semakin tinggi tingkat ma’rifat(mengenal)nya kepada Allah dan kecintaan kepada-Nya, maka semakin banyak menyebut nama Tuhannya dan mengingat-Nya, seperti dengan bertasih, bertahlil (mengucapkan Laailaahaillallah), bertakbir, dsb. Ada yang menafsirkan “mengingat Allah” di sini dengan mengingat janji Allah Ta’ala. Ada pula yang menafsirkan “mengingat Allah” dengan kitab-Nya yang diturunkan sebagai pengingat bagi orang-orang mukmin. Oleh karena itu, maksud tenteramnya hati karena mengingat Allah adalah ketika mengenali kandungan Al Qur’an dan hukum-hukumnya, karena kandungannya menunjukkan kebenaran kebenaran lagi diperkuat dalil-dalil dan bukti sehingga hati semakin tenteram, karena hati tidaklah tenteram kecuali dengan ilmu dan keyakinan, dan hal itu ada dalam kitab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 28",
    "description": "Mereka yang mendapat petunjuk adalah orang-orang yang beriman kepada Allah dan rasul-Nya, dan hati mereka menjadi tenang dan tenteram dengan banyak mengingat Allah. Ingatlah, bahwa hanya dengan banyak mengingat Allah hati menjadi tenteram. Mereka itulah orang-orang yang beriman kepada Allah dan rasulnya dan mengerjakan kebajikan serta amal saleh. Mereka pasti mendapat kebahagiaan dan tempat kembali yang baik di akhirat kelak, berupa surga dan keridaan Allah."
  }
]