[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang beriman kepada Allah dan rasulNya, dan mengerjakan amal-amal shalih, bagi mereka kebahagiaan, pandangan sejuk dan keadaan yang baik, serta tempat kembali yang baik menuju surga dan keridoan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Orang-orang yang beriman kepada Allah, melakukan amal-amal saleh yang mendekatkan mereka kepada Allah, mereka berada di dalam kehidupan yang baik di alam Akhirat, bagi mereka adalah akhir yang baik, yaitu surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah memberi kabar gembira bagi orang-orang beriman yang mengerjakan amal shalih, bahwa mereka akan mendapatkan kehidupan yang bahagia yang membuat mereka ridha, dan mendapatkan tempat terbaik di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29 Orang-orang yang beriman dan beramal saleh, bagi mereka kebahagiaan dan tempat kembali yang baik kelak di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman dan beramal shalih, bagi mereka itu kebahagiaan} bagi mereka itu kehidupan yang baik di akhirat {dan tempat kembali yang baik} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Kemudian Allah berfirman, “Orang-orang yang beriman dan beramal salih,” yaitu orang-orang yang beriman dengan sepenuh hati mereka kepada Allah, para malaikatNya, kitab-kitabNya, para rasulNya dan Hari Akhir, membuktikan keimanannya dengan amalan-amalan shalih berupa amalan-amalan hati seperti cinta Allah, rasa takut dan pengharapan kepadaNya dan amalan-amalan anggota tubuh seperti shalat dan lainnya. “Mereka mendapatkan kebahagiaan dan tempat kembali yang baik,” mereka mendapatkan kondisi yang baik dan tempat kembali yang bagus. Balasan demikian itu, lantaraan mereka mendapatkan keridhaan Allah dan kemuliaan dariNya di dunia dan akhirat. Mereka juga memperoleh kesempurnaan dalam menikmati kenyamanan istirahat dan ketentraman yang uttuh. Termasuk hal itu adalah, pohon Thuba yang berada di surga, yang mana naungannya yang panjang tidak bisa ditempuh oleh seseorang yang berkendaraan di bawahnya selama seratus tahun lamanya, sebagaimana keterangannya tertuang dalam hadits-hadits shahih."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ) thuubaa lahum wa husnu ma’aab : bagi mereka pohon Tuba di surga, dan tempat kembali yang baik, Negeri Keselamatan. Makna ayat : Firman-Nya : (ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَ‍َٔابٖ) berita dari Allah ta’ala tentang apa yang telah Allah siapkan untuk orang-orang yang beriman dan beramal saleh, yaitu dengan thuuba yaitu keadaan yang indah dan baik, tidak bisa dijelaskan dengan kata-kata, atau sebuah pohon di surga dan tempat kembali yang baik; surga negeri keselamatan dan kenikmatan yang abadi. Pelajaran dari ayat : • Janji Allah ta’ala kepada orang-orang yang beriman dan beramal saleh dengan kebahagiaan dan tempat kembali yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 29: Kepada rukun iman yang enam. Mereka membuktikan keimanannya dengan amal saleh. Karena mereka mendapatkan keridhaan Allah dan kemuliaan-Nya di dunia dan akhirat. Mereka juga memperoleh istirahat dan ketenangan yang sempurna, di antaranya adalah dengan memperoleh pohon thubaa di surga; di mana seorang pengendara berjalan di bawah naungannya selama seratus tahun, namun belum juga dilaluinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 29",
    "description": "Mereka itulah orang-orang yang beriman kepada Allah dan rasulnya dan mengerjakan kebajikan serta amal saleh. Mereka pasti mendapat kebahagiaan dan tempat kembali yang baik di akhirat kelak, berupa surga dan keridaan Allah. Orang kafir dengan nada mengejek meminta rasul untuk mendatangkan mukjizat yang kasat mata. Mereka lupa bahwa Al-Qur'an adalah mukjizat yang begitu nyata. Wahai nabi Muhammad, demikianlah, kami telah mengutus engkau kepada suatu umat'yakni seluruh manusia sampai akhir zaman'yang sungguh sebelumnya telah berlalu beberapa umat yang kepada mereka juga dikirim para rasul. Kami mengutusmu agar engkau bacakan kepada mereka Al-Qur'an yang kami wahyukan kepadamu, padahal mereka tetap saja ingkar kepada tuhan yang maha pengasih, maha penyayang. Katakanlah, dia yang maha pengasih dan penyayang itu adalah tuhanku, dan tidak ada tuhan yang layak disembah selain dia; hanya kepada-Nya aku bertawakal dan berserah diri, dan hanya kepada-Nya aku bertobat dan memohon ampunan."
  }
]