[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dialah yang menjadikan bumi lapang lagi terhampar luas, dan meyiapkannya untuk tempat hidup kalian, dan menjadikan padanya gunung-gunung yang meneguhkannya dan sungai-sungai untuk kebutuhan air minum dan manfaat-manfaat lain bagi kalian, dan menjadikan di dalamnya dari setiap buah-buahan dua jenis yang saling berpasangan, maka sebagian ada yang berwarna hitam dan berwarna putih, manis dan masam, dan Dia menjadikan malam menutup siang hari dengan kegelapannya. Sesungguhnya pada semua itu terdapat pelajaran-pelajaran bagi orang-orang yang berfikir tentangnya lagi mau memetik pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Allah -Subḥānahu- yang membentangkan bumi dan menciptakan pada bumi gunung-gunung yang tegak kokoh agar bumi tidak goncang. Allah menciptakan jantan dan betina dari setiap jenis buah-buahan seperti hewan. Allah menutup siang dengan malam sehingga ia menjadi gelap padahal sebelumnya terang. Sesungguhnya pada yang demikian itu terdapat bukti-bukti dan tanda-tanda bagi kaum yang memikirkan penciptaan Allah dan merenungkannya. Mereka adalah orang-orang yang mengambil faedah dari bukti-bukti dan tanda-tanda tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dia yang menghamparkan bumi dengan panjang dan luasnya dan menyiapkannya sebagai tempat kehidupan dengan menciptakan di dalamnya gunung-gunung yang kokoh, sungai-sungai yang tawar, dan menumbuhkan dengan air sungai, air hujan, air mata air, dan air sumur berbagai jenis buah-buahan yang berpasangan, jantan dan betina; dan juga menciptakan malam yang menutupi siang dengan kegelapannya. Sesungguhnya dalam penjelasan kenikmatan ini merupakan bukti-bukti kekuasaan Allah yang jelas yang tidak terlepas dari kehidupan manusia; hal ini agar manusia berfikir dan mengetahui keagungan kuasa Sang Pencipta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَهُوَ الَّذِى مَدَّ الْأَرْضَ (Dan Dialah Tuhan yang membentangkan bumi) Yakni membentangkannya memanjang dan melebar; dan ini tidak menyelisihi bahwa bumi berbentuk bulat karena ujung-ujungnya saling berjauhan sehingga terlihat oleh orang yang berada di permukaannya seakan-akan berbentuk datar, padahal berbentuk bulat. وَجَعَلَ فِيهَا رَوٰسِىَ(dan menjadikan gunung-gunung) Yakni gunung-gunung yang kokoh. وَمِن كُلِّ الثَّمَرٰتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ (Dan menjadikan padanya semua buah-buahan berpasang-pasangan) Jantan dan betina. Dan ini merupakan sebuah mukjizat, karena dalam penemuan terbaru disebutkan bahwa setiap buah memiliki dua jenis, yaitu jantan dan betina. يُغْشِى الَّيْلَ النَّهَارَ ۚ (Allah menutupkan malam kepada siang) Yakni malam mengganti posisi siang, sehingga menjadi gelap gulita setelah terang benderang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Allah adalah Dzat yang membentangkan bumi dengan luas dan terpampang untuk memudahkan kehidupan di dalamnya dan bisa dengan mudah diambil manfaatnya. Hal tersebut tidak menafikan bentuk bulat bumi karena sisinya yang saling berjauhan. Dia menciptakan di dalamnya gunung-gunung yang kokoh, dan sungai-sungai yang mengalirkan air. Dia juga menciptakan setiap buah-buahan itu berpasang-pasangan, jenis laki-laki dan perempuan untuk berkembang biak, dan dua kategori yang saling berlawanan seperti manis dan asam, hitam dan putih, serta kecil dan besar. Dia membuat malam menutupi cahaya siang, sehingga menghilang. Sesungguh dalam sesuatu yang disebutkan itu terdapat dalil-dalil atas keesaan Allah SWT bagi kaum yang mau merenung, sehingga mereka menyadari keberadaan dan keesaan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menghamparkan} menghamparkan {bumi dan menjadikan gunung-gunung} gunung-gunung sebagai pondasinya {dan sungai-sungai di sana. Dia menjadikan di sana setiap buah-buahan berpasang-pasangan} pasangan-pasangan {menutupkan} menyelimutkan {malam pada siang. Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi kaum yang berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan Dia-lah Rabb yang membentangkan bumi,” Dia menciptakannya bagi manusia dan melebarkannya serta mencurahkan berkah padanya. Dia mempersiapkannya sebagai pijakan bagi manusia serta memasukkan ke dalamnya segala sesuatu yang menjadi maslahat bagi mereka. “Dan menjadikan gunung-gunung padanya,” yaitu gunung-gunung yang besar, supaya bumi tidak bergoncang disebabkan penghuninya. Bila wujud gunung-gunung tidak ada, sudah tentu bumi akan bergoncang beserta isinya. Sebab, bumi berada di atas aliran air, sehingga tidak ada kekokohan dan tidak ada kestabilan kecuali dengan sebab keberadaan gunung-gunung yang besar yang Allah jadikan sebagai pasak-pasaknya. “dan” menjadikan di dalamnya “sungai-sungai,” yang menyediakan air minum bagi manusia dan hewan-hewan ternak serta tanaman pertanian mereka. Dengan air itu, Dia mengeluarkan berbagai kebaikan yang banyak dalam bentuk pepohonan, tanaman, buah-buahan. Oleh karenanya, DIa berfirman, “dan menjadikan padanya semua buah-buahan berpasang-pasangan,” dua jenis yang dibutuhkan manusia. “Dia menutupkan malam kepada siang,” sehingga cakrawala menjadi gelap dan setiap binatang berteduh kepada tempat bermalamnya. Manusia beristirahat dari rasa capek dan kelelahan di siang hari. Lantas, bila mereka telah menuntaskan kebutuhan-kebutuhan mereka berupa tidur, maka siang akan menutupi malam. Kemudian mereka akan berada di pagi hari untuk (bertebaran) kembali memenuhi kepentingan-kepentingan dan pekerjaan-pekerjaan mereka di siang hari. \"Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebahagian dari karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya.\" (Al-Qashash:73). “SEsungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah),” yang menunjukkan orientasi-orientasi ilahiyah “bagi kaum yang memikirkan,” tentangnya, dan mencermatinya dengan pandangan kognitif yang menunjukkan bahwa Dzat yang menciptakan, mengatur, dan mengendalikannya adalah Allah, tidak ada sesembahan selainNya. Dia mengetahui alam ghaib dana lam nyata, ar-Rahman ar-Rahim (Yang Maha Pengasih lagi Maha bijaksana) dalam segala urusan, al-Mahmud (Yang Maha Terpuji) atas seluruh yang diciptakan dan diperintahkanNya Yang Mahasuci lagi Mahatinggi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ) wa wahuwal ladzii maddal ardh : membentangkannya untuk kehidupan makhluk di atasnya. (رَوَٰسِيَ) rawaasiya : gunung-gunung yang kokoh. (زَوۡجَيۡنِ ٱثۡنَيۡنِۖ) zaujainitsnain : dua jenis yang sepasang, contoh: manis dan asam, kuning dan hitam. (يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ) yughsyillailan nahaar : menyelimuti siang dengan malam, sehingga cahaya siang tidak tersisa. (لَأٓيَٰتٖ) laayaat : tanda-tanda akan ke-esaan Allah ta’ala. Makna ayat : Firman-Nya : (وَهُوَ ٱلَّذِي مَدَّ ٱلۡأَرۡضَ) Dia lah yang membentangkannya (وَجَعَلَ فِيهَا رَوَٰسِيَ) gunung-gunung yang kokoh (وَأَنۡهَٰرٗاۖ) mengalirkan di atas bumi sungai-sungai (وَمِن كُلِّ ٱلثَّمَرَٰتِ جَعَلَ فِيهَا زَوۡجَيۡنِ ٱثۡنَيۡنِۖ) menjadikannya dua jenis, delima ada yang manis dan ada pula yang asam rasanya, zaitun ada yang berwarna kuning dan ada juga yang hitam, buah tin ada yang berwarna putih dan ada yang berwarna merah. Firman-Nya : (يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَۚ) Allah subhanahu wa ta’ala menutup siang hari dengan gelapnya malam, agar kalian tidur dan beristirahat dari kelelahan siang hari. Firman-Nya : (إِنَّ فِي ذَٰلِكَ) yang telah disebutkan tadi berupa dibentangkannya bumi, ditancapkannya gunung-gunung, dialirkannya sungai, penciptaan berbagai jenis buah, dan pergantian siang dan malam, semua ini adalah (لَأٓيَٰتٖ) tanda-tanda yang jelas akan keberadaan Allah ta’ala, ilmu, kekuasaan, hikmah-Nya, dan kewajiban beribadah kepada-Nya dan mentauhidkan-Nya, serta iman kepada janji dan ancaman-Nya, pertemuan dengan-Nya, serta apa pun yang disediakan bagi wali-wali-Nya berupa kenikmatan, dan azab bagi musuh-musuh-Nya. Pelajaran dari ayat : • Keutamaan merenungi ayat-ayat kauniyah (alam semesta)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 3: Meluaskannya, memberkahinya, menyiapkannya untuk manusia dan menyimpan di dalamnya hal-hal yang bermaslahat bagi manusia. Jika gunung tidak ada tentu terjadi kegoncangan, karena tempat yang mereka tempati berada di atas air, tidak bisa kokoh dan diam kecuali dengan adanya gunung-gunung kokoh yang menancap bagai pasak. Yang dapat diminum oleh manusia, hewan dan diserap oleh pepohonan. Dengan sungai-sungai keluar pepohonan, tanaman, dan buah-buahan yang banyak. Yang dimaksud berpasang-pasangan, ialah jantan dan betina, pahit dan manis, putih dan hitam, besar-kecil dan sebagainya. Ufuk langit pun menjadi gelap, semua makhluk hidup kembali ke tempatnya dan beristirahat setelah dibuat lelah di siang hari. Setelah mereka memenuhi kebutuhan mereka beristirahat, Allah menutup malam dengan siang, dan manusia pun bertebaran mencari maslahat mereka. Di mana pada semua itu terdapat dalil yang menunjukkan bahwa yang menciptakan, mengatur dan mengolahnya adalah Allah yang tidak ada tuhan yang berhak disembah melainkan Dia, Yang Maha Pemurah lagi Maha Penyayang, Yang berkuasa terhadap segala sesuatu, Yang Mahabijaksana lagi Maha terpuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 3",
    "description": "Usai berbicara tentang matahari dan bulan, Allah melalui ayat ini menjelaskan perihal bumi dan isinya. Dan dia yang maha pencipta adalah tuhan yang juga menghamparkan bumi untuk tempat kamu berdiam, dan menjadikan gunung-gunung yang beragam tingginya, dan sungai-sungai yang mengalir di atas permukaan-Nya. Dan padanya dia menjadikan semua buah-buahan dari bermacam jenisnya secara berpasang-pasangan sehingga dapat berkembang biak. Dia pula yang menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau berpikir. Dan di bumi yang terhampar dengan gunung-gunung yang tegak berdiri dan sungai-sungai yang berkelok-kelok dan bermuara ke laut, terdapat bagian-bagian tanah yang berdampingan dengan jarak yang berbeda serta kualitas kesuburan yang berbeda pula. Ada bagian tanah yang baik menjadi kebun-kebun anggur, ada yang cocok ditanami tanaman-tanaman tertentu, dan ada pula yang cocok ditanami pohon kurma yang bercabang dan yang tidak bercabang. Bagian-bagian tanah yang ditanami itu disirami dengan air yang sama. Tanaman-tanaman itu tumbuh, berkembang, lalu mengeluarkan bunga dan buah yang jenisnya beragam. Meski demikian, kami lebihkan tanaman yang satu dari yang lainnya, baik dalam hal rasa, warna, ukuran, maupun bobot-Nya. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau mengerti."
  }
]