[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana kami telah mengutus rasul-rasul sebelummu, kami mengutusmu (wahai rasul), ditengah umat, sunggguh telah berlalu sebelumnya umat-umat para rasul; supaya kamu membacakan kepada umat ini al-qur’an yang diturunkan kepadamu, sedang keadaan kaummu adalah mengingkari keesaan Tuhan yang Maha pengasih. Katakanlah kepada mereka (wahai rasul), ”yang maha pengasih yang tidak kalian jadikan sebagai tuhan yang esa adalah tuhanku satu-satunya, tiada sesembahan yang berhak diibadahi selainNya. kepadaNyalah aku bergantung dan percaya, dan kepadaNyalah tempat kembali dan inabahku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Sebagaimana Kami telah mengutus Rasul-rasul terdahulu kepada umat-umat mereka, Kami juga mengutusmu -wahai Rasul- kepada umatmu agar kamu membacakan Al-Qur`ān yang Kami wahyukan padamu kepada mereka, ia sudah cukup sebagai bukti bahwa kamu benar, namun reaksi kaummu adalah pengingkaran terhadap mukjizat ini, karena mereka kafir kepada Ar-Raḥmān, di mana mereka menyekutukan-Nya dengan selain-Nya. Katakanlah -wahai Rasul- kepada mereka, “Ar-Raḥmān yang kalian sekutukan dengan selain-Nya adalah Rabbku yang tidak ada sesembahan yang hak kecuali Dia, hanya kepada-Nya aku bertawakal dalam segala urusanku dan hanya kepada Allah aku bertobat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hai Rasulullah, sebagaimana Kami telah mengutus para rasul sebelummu, Kami mengutusmu kepada umat yang telah berlalu sebelum mereka banyak umat. Hal ini agar kamu membacakan kepada mereka al-Qur’an yang Kami turunkan kepadamu; akan tetapi mereka mendustakan Allah Yang Maha Pengasih. Maka katakanlah kepada mereka: “Yang Maha Pengasih yang kalian ingkari itu adalah Penciptaku dan Pengatur urusanku, tidak ada yang berhak disembah selain Dia, kepada-Nya aku bertawakkal dan berserah diri, dan kepada-Nya aku bertaubat dan kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. كَذٰلِكَ أَرْسَلْنٰكَ فِىٓ أُمَّةٍ قَدْ خَلَتْ مِن قَبْلِهَآ أُمَمٌ (Demikianlah, Kami telah mengutus kamu pada suatu umat yang sungguh telah berlalu beberapa umat sebelumnya) Yakni Kami telah mengutus para rasul kepada sekelompok manusia sebelum mereka. لِّتَتْلُوَا۟ عَلَيْهِمُ الَّذِىٓ أَوْحَيْنَآ إِلَيْكَ(supaya kamu membacakan kepada mereka (Al Quran) yang Kami wahyukan kepadamu) Agar kamu membacakan kepada mereka al-Qur’an. وَهُمْ يَكْفُرُونَ بِالرَّحْمٰنِ ۚ( padahal mereka kafir kepada Tuhan Yang Maha Pemurah) Sedangkan mereka mengingkari bahwa Allah memiliki nama ar-Rahman. قُلْ هُوَ رَبِّى(Katakanlah: “Dialah Tuhanku) Seakan-akan mereka mengatakan “dan apakah ar-Rahman itu?”. Kemudian Allah berfirman “katakanlah wahai Muhammad, Dia adalah Tuhanku”. Yakni penciptaku. لَآ إِلٰهَ إِلَّا هُوَ(tidak ada Tuhan selain Dia) Tidak ada yang berhak disembah selain Dia. عَلَيْهِ تَوَكَّلْتُ(hanya kepada-Nya aku bertawakkal) Segala urusanku. وَإِلَيْهِ(dan hanya kepada-Nya) Dan tidak kepada selain-Nya. مَتَابِ (aku bertaubat) Yakni pertaubatanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30 Demikianlah Kami telah mengutus para rasul yang lebih dulu, Kami juga telah mengutus kamu pada suatu umat manusia. Sudah ada generasi yang hidup sebelum mereka, supaya kamu membacakan Al Quran kepada mereka yang telah Kami wahyukan kepadamu. Padahal mereka kafir kepada Tuhan Yang Maha Pemurah. Mereka telah mengingkari asma Allah Yang Maha Pengasih. Mereka tidak mensyukuri nikmat-Nya. Katakanlah kepada mereka Nabi: “Dia Yang Maha Pengasih adalah Tuhanku, Yang Menciptakan dan Mengurusi urusanku. Tidak ada Tuhan selain Dia; hanya kepada-Nya aku bertawakkal menyerahkan diri dan hanya kepada-Nya aku bertaubat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seperti itulah} seperti Kami mengutus para nabi sebelummu {Kami mengutusmu kepada suatu umat yang sungguh berlalu} telah berlalu} sebelumnya beberapa umat agar kamu membacakan} membacakan {kepada mereka sesuatu yang Kami wahyukan kepadamu, padahal mereka ingkar kepada Tuhan Yang Maha Pengasih. Katakanlah,“Dia Tuhanku, tidak ada tuhan selain Dia. Hanya kepadaNya aku bertawakal} bergantung {dan hanya kepadaNya aku bertaubat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Allah berfirman kepada NabiNya, Muhammad, “Demikianlah, Kami telah mengutus kamu,” kepada kaummu, untuk menyeru mereka kepada hidayah “pada suatu umat yang sungguh telah berlalu beberapa umat sebelumnya,” Kami telah mengutus kepada mereka para rasul kami. Engkau bukanlah seorang rasul yang pertama dari para rasul yang ada, hingga mereka merasa perlu mengingkari risalahmu. Dan engkau pun tidak mengatakan sesuatu dari dirimu sendiri. Bahkan engkau itu membacakan ayat-ayat Allah kepada mereka yang Allah wahyukan kepadamu, yang akan membersihkan hati dan menyucikan jiwa. Dan sebenarnya, kaummu itu mengingkari ar-Rahman. Mereka tidak membalas rahmat dan kebaikanNya –yang paling besar adalah, Kami mengutus dirimu kepada mereka sebagai rasul dan menurunkan kitab kepadamu- dengan sambutan dan rasa syukur. Justru mereka menyikapinya dengan pengingkaran dan penolakan. Tidakkah mereka mengambil pelajaran dengan dengan orang-orang yang telah berlalu dari umat-umat yang telah mendustakan, bagaimana Allah menyiksa mereka lantaran dosa-dosa mereka? “Katakanlah, ‘Dia-lah Rabbku , tidak ada tuhan (yang berhak disembah) kecuali Dia,” ayat ini mengandung (dua bentuk tauhid) : tauhid uluhiyah dan tauhid rububiyah. Dia adalah rabbku yang telah mendidikku dan memeliharaku dengan berbagai nikmatNya semenjak Dia menciptakanku. Dia-lah Illahku (sesembahanku) yang “hanya kepadaNya aku bertawakal,” di seluruh urusanku, dan kepadaNya-lah aku berinabah maksudnya aku kembali kepadaNya dalam ibadahku dan kebutuhan-kebutuhanku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَذَٰلِكَ أَرۡسَلۡنَٰكَ) kadzalika arsalnaaka : seperti itulah Kami mengutusmu sebagaimana para rasul terdahulu. (لِّتَتۡلُوَاْ عَلَيۡهِمُ) litatluwa ‘alaihim : agar engkau membacakan kepada mereka Al-Qur’an sebagai pengingat, pelajaran, peringatan, dan kabar gembira. (وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ) wa hum yakfuruna birrahmaan : karena mereka berkata, “Siapa itu Ar-Rahman?” dan mereka berkata, “Tidak ada Rahman, kecuali Rahman Al-Yamamah.” Makna ayat : Masih membahas penetapan dasar-dasar aqidah: tauhid, nubuwah, kebangkitan, dan pembalasan terakhir. Pada ayat yang pertama pada pembahasan ini, firman-Nya : (كَذَٰلِكَ أَرۡسَلۡنَٰكَ) penetapan kenabian Rasulullah shallahu ‘alaihi wa sallam dengan firman-Nya : (كَذَٰلِكَ) yaitu Kami mengutusmu sebagaimana Kami mengutus para rasul sebelummu kepada umat-umat terdahulu. Kemudian menjelaskan tujuan dari pengutusan tersebut, firman-Nya : (لِّتَتۡلُوَاْ عَلَيۡهِمُ ٱلَّذِيٓ أَوۡحَيۡنَآ إِلَيۡكَ) “agar engkau membacakan kepada mereka apa yang telah Kami wahyukan kepadamu.” Yaitu rahmat, petunjuk, dan penyembuh (وَهُمۡ يَكۡفُرُونَ بِٱلرَّحۡمَٰنِۚ) “sedangkan mereka menginkari Ar-Rahman.” Yaitu Ar-Rahman yang telah mengutusmu kepada mereka dengan petunjuk dan agama yang benar, agar mereka meraih kesempurnaan dan kebahagiaan, namun mereka kufur kepada-Nya, oleh karena itu, katakanlah wahai Rasul! (هُوَ رَبِّي لَآ إِلَٰهَ إِلَّا هُوَ) : tidak ada sesembahan yang berhak disembah kecuali Dia (عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ مَتَابِ) “Hanya kepada-Nya aku bertawakkal dan kepada-Nya aku kembali.”kepada-Nyalah aku bertaubat dan kembali, Allah menegaskan dengan firman-Nya dasar-dasar tauhid dengan perkataan yang paling jujur. Pelajaran dari Ayat: • Penetapan akidah tauhid. • Tidak ada tawakal kecuali hanya kepada Allah dan tidak ada yang menerima taubat kecuali hanya Dia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 30: Sebagaimana Kami telah mengutus para nabi sebelummu. Agar engkau (Muhammad) mengajak mereka kepada petunjuk. Yang kepada mereka diutus pula para rasul. Sehingga engkau bukanlah rasul yang baru yang menyebabkan mereka mengingkari kerasulanmu. Mereka mengatakan saat diperintahkan untuk sujud kepada Tuhan Yang Maha Pengasih, “Siapakah Tuhan Yang Maha Pengasih itu?” Mereka tidak membalas rahmat dan ihsan-Nya -yang salah satunya adalah dengan diutus-Nya rasul dan diturukan-Nya kitab- dengan menerima dan bersyukur, bahkan mereka menolak dan mengingkarinya. Kalimat ini mengandung dua tauhid; tauhid rububiyyah dan tauhid uluhiyyah, yakni memberitahukan bahwa hanya Allah Tuhan yang mencipta, memberi rezeki dan menguasai alam semesta, dan hanya Dia yang berhak disembah; tidak selain-Nya. Dalam semua urusanku. Ada yang mengartikan dengan, “Aku kembali kepada-Nya dalam semua ibadah dan kebutuhanku.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 30",
    "description": "Orang kafir dengan nada mengejek meminta rasul untuk mendatangkan mukjizat yang kasat mata. Mereka lupa bahwa Al-Qur'an adalah mukjizat yang begitu nyata. Wahai nabi Muhammad, demikianlah, kami telah mengutus engkau kepada suatu umat'yakni seluruh manusia sampai akhir zaman'yang sungguh sebelumnya telah berlalu beberapa umat yang kepada mereka juga dikirim para rasul. Kami mengutusmu agar engkau bacakan kepada mereka Al-Qur'an yang kami wahyukan kepadamu, padahal mereka tetap saja ingkar kepada tuhan yang maha pengasih, maha penyayang. Katakanlah, dia yang maha pengasih dan penyayang itu adalah tuhanku, dan tidak ada tuhan yang layak disembah selain dia; hanya kepada-Nya aku bertawakal dan berserah diri, dan hanya kepada-Nya aku bertobat dan memohon ampunan. Dan peringatkanlah orang kafir bahwa sekiranya ada suatu bacaan dalam bentuk kitab suci yang dengan bacaan itu gunung-gunung dapat digoncangkan dari tempatnya semula, atau bumi jadi terbelah dan mengalirkan sungai-sungai, atau orang yang sudah mati kembali hidup dan dapat berbicara'sekiranya Allah menghendaki'maka bacaan itu adalah Al-Qur'an, bukti kerasulan nabi Muhammad. Sebenarnya segala urusan itu adalah milik Allah dan atas kehendak serta kewenangan-Nya. Maka tidakkah orang-orang yang beriman mengetahui bahwa sekiranya Allah menghendaki, tentu Allah memberi petunjuk kepada manusia semuanya sehingga semua beriman tanpa kecuali. Dan orang-orang kafir yang mengingkari Al-Qur'an senantiasa ditimpa bencana, seperti kekalahan melawan kaum mukmin, disebabkan perbuatan buruk mereka sendiri, atau bencana itu terjadi dekat tempat kediaman mereka, sampai akhirnya datang janji Allah berupa kemenangan kaum mukmin dalam penaklukan kota mekah. Sungguh, Allah tidak akan pernah menyalahi janji."
  }
]