[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah membantah orang-orang kafir yang menuntut diturunkannya mukjizat pada diri nabi yang dapat mereka tangkap dengan pancaindra mereka. Dia berfirman kepada mereka, ”Dan sekiranya ada satu bacaan(kitab) yang dibaca, yang kemudian menyebabkan gunung-gunung runtuh dari tempat-tempatnya, atau bumi terbelah menjadi sungai-sungai atau orang-orang mati hidup dan dapat berkomunikasi, sebagaimana mereka memintanya kepadamu, maka bacaan yang memiliki sifat-sifat demikian adalah kitab al-qur’an, yang tidak ada pada bacaan lainnya, tetapi mereka tetap tidak akan beriman kepadanya. Akan tetapi, semua perkara adalah hak Allah terkait diturunkannya mukjizat-mukjizat dan perkara lainnya. Apakah kaum mukminin belum mengetahui bahwa seandainya Allah menghendaki, niscaya semua penduduk bumi akan beriman tanpa melihat mukjizat? Dan orang-orang kafir akan terus-menerus tertimpa musibah disebabkan kekafiran mereka, berupa terbunuh dan menjadi tawanan dalam peperangan kaum muslimin, atau musibah turun pada mereka di dekat tempat tinggal mereka, sampai akhirnya datanglah janji Allah berupa pertolongan (bagi kaum muslimin) atas mereka. Sesungguhnya Allah tidak menyalahi janji."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Seandainya di antara ciri khas suatu kitab dari kitab-kitab Ilahiyah adalah menyingkirkan gunung-gunung dari tempatnya atau membelah bumi sehingga ia berubah menjadi sungai-sungai dan mata air-mata air atau dibacakan kepada orang-orang mati sehingga mereka bangkit hidup kembali, niscaya kitab tersebut adalah Al-Qur`ān yang diturunkan kepadamu -wahai Rasul-. Kitab ini jelas buktinya, besar efeknya seandainya mereka adalah orang-orang yang berhati bersih, sayangnya mereka adalah orang-orang yang mengingkari. Akan tetapi segala urusan, menurunkan mukjizat atau lainnya kembali kepada Allah. Apakah orang-orang yang beriman kepada Allah belum mengetahui bahwa seandainya Allah berkehendak memberi hidayah kepada manusia semuanya tanpa menurunkan mukjizat niscaya Allah melakukannya, tetapi Allah tidak berkehendak demikian. Dan orang-orang yang kafir kepada Allah akan senantiasa ditimpa musibah berat yang mengetuk hati mereka dengan keras karena apa yang mereka lakukan berupa kekufuran dan kemaksiatan, atau malapetaka itu turun di dekat negeri mereka sehingga terwujud janji Allah tentang turunnya azab yang terus-menerus. Sesungguhnya Allah tidak melalaikan janji yang Dia janjikan manakala waktunya sudah tiba."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Seandainya ada kitab dari kitab-kitab yang diturunkan jika dibacakan dapat membuat gunung-gunung berpindah dan hancur, tanah-tanah terbelah menjadi sungai-sungai sehingga menumbuhkan tanaman, atau mayat-mayat dapat menjadi hidup dan berbicara; maka itu adalah al-Qur’an yang di dalamnya terdapat ayat-ayat yang dapat dilihat jika mereka mengimaninya. Akan tetapi Allah tidak mengabulkan permintaan mereka untuk didatangkan ayat-ayat yang mereka mau, karena Dia adalah Penguasa bagi segala urusan, Dia mengaturnya sesuai kehendak-Nya. Apakah orang-orang beriman berputus asa dari keimanan orang-orang kafir yang meminta ayat-ayat yang dapat dilihat, dan tidak mengetahui bahwa jika Allah menghendaki untuk memberi mereka petunjuk niscaya mereka semua akan beriman? Dan orang-orang kafir terus menerus merasakan azab akibat dosa-dosa yang mereka lakukan, atau azab itu menimpa negeri sebelah mereka sehingga mereka merasa ketakutan, hingga Allah menghendaki kemenangan agama Islam dan menolongnya dari musuh-musuh. Allah tidak menyelisihi janji-Nya kepada para kekasih-Nya untuk menolong mereka di dunia dan memuliakan mereka di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَلَوْ أَنَّ قُرْءَانًا سُيِّرَتْ بِهِ الْجِبَالُ (Dan sekiranya ada suatu bacaan (kitab suci) yang dengan bacaan itu gunung-gunung dapat digoncangkan) Terdapat pendapat mengatakan bahwa kalimat ini merupakan sambungan dari jawaban atas perkataan orang-orang kafir “tidakkah diturunkan kepadanya mukjizat dari Tuhannya?”. Yakni al-Qur’an sendiri sudah merupakan mukjizat seandainya saja mereka memikirkannya. Makna dari potongan ayat ini adalah seandainya ada suatu ucapan yang jika diucapkan kepada gunung maka gunung tersebut akan sirna dari tempatnya. أَوْ قُطِّعَتْ بِهِ الْأَرْضُ(atau bumi jadi terbelah) Yang menjadikan orang yang mengucapkannya terlempar ke tempat yang jauh. أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ( atau oleh karenanya orang-orang yang sudah mati dapat berbicara) Yakni orang-orang mati itu menjadi hidup kembali setelah dibacakan ucapan tersebut, sehingga dapat memahami apa yang diucapakan kepada mereka seperti orang yang hidup. Yakni seandainya terdapat ucapan yang seperti itu maka itu pasti al-Qur’an. Diriwayatkan dari Ibnu Abbas, ia berkata: orang-orang kafir berkata kepada Nabi: “jika itu memang seperti yang kamu katakan maka tunjukkanlah kepada kami nenek monyang kami yang telah mati agar kami dapat berbicara dengan mereka, dan hilangkanlah perbukitan Makkah yang telah mempersempit kami”. Maka turunlah ayat ini. بَل لِّلّٰهِ الْأَمْرُ جَمِيعًا ۗ( Sebenarnya segala urusan itu adalah kepunyaan Allah) Yakni seandainya terdapat bacaan yang dapat melakukan hal itu maka al-Qur’an pasti dapat melakukannya, namun Allah tidak menghendakinya dan menghendaki apa yang terjadi sekarang. Seandainya Allah berkehendak agar mereka beriman niscaya mereka akan beriman, namun jika Allah tidak berkehendak agar mereka beriman maka tidak akan bermanfaat gunung yang dijadikan berjalan, atau mukjizat-mukjizat lainnya yang mereka usulkan, karena mereka akan tetap pada kekafiran mereka. أَفَلَمْ يَا۟يْـَٔسِ الَّذِينَ ءَامَنُوٓا۟( Maka tidakkah orang-orang yang beriman itu mengetahui) Yakni tidakkah mereka mengetahui dan jelas bagi mereka. أَن لَّوْ يَشَآءُ اللهُ لَهَدَى النَّاسَ جَمِيعًا (bahwa seandainya Allah menghendaki (semua manusia beriman), tentu Allah memberi petunjuk kepada manusia semuanya) Tanpa harus menyaksikan terlebih dahulu mukjizat-mukjizat. وَلَا يَزَالُ الَّذِينَ كَفَرُوا۟ تُصِيبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ(Dan orang-orang yang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri) Ini merupakan ancaman bagi orang-orang kafir Makkah bahwa mereka akan ditimpa bencana akibat kekafiran dan kedustaan mereka terhadap para Rasul. Yakni musibah besar yang menimpa mereka dari para pasukan Islam berupa pembunuhan atau penyanderaan. أَوْ تَحُلُّ(atau bencana itu terjadi) Atau bencana tersebut turun. قَرِيبًا مِّن دَارِهِمْ(dekat tempat kediaman mereka) Sehingga mereka ketakutan. حَتَّىٰ يَأْتِىَ وَعْدُ اللهِ ۚ( sehingga datanglah janji Allah) Yakni datang kematian mereka atau datang hari kiamat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Orang-orang kafir senantiasa ditimpa bencana dan ayat-ayat Allah begitu banyak menyebut tentang mereka dalam al-qur'an, semuanya karena akibat dari perbuatan mereka sendiri sebagai peringatan dan membuat takut orang-orang selain dari mereka, dan maha benar Allah yang mengatakan : { وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُمْ بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِنْ دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ } \"Dan orang-orang yang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri atau bencana itu terjadi dekat tempat kediaman mereka, sehingga datanglah janji Allah\" akan tetapi : { وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ } \"Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31 Alquran itu sendiri adalah sebuah mukjizat atau tanda kebenaran jika kalian mau berfikir. Sekiranya ada suatu bacaan kitab suci yang dengan bacaan itu gunung-gunung dapat digoncangkan atau bumi jadi terbelah atau bisa menjadikan orang-orang yang sudah mati dapat hidup kembali, maka tentulah itu adalah Al Quran. Adapun ketika penduduk Makkah mau beriman sesudah menyaksikan kandungan Alquran, namun sesungguhnya segala urusan itu adalah kepunyaan Allah. Maka tidakkah orang-orang yang beriman itu mengetahui bahwa seandainya Allah menghendaki semua manusia beriman, tentu Allah memberi petunjuk kepada manusia semuanya. Meskipun mereka telah diperlihatkan mukjizat dengan mata telanjang, maka pasti para kafir Makkah itu akan tetap dalam kekafiran dan mendustakan rasul mereka. Orang-orang yang kafir itu senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri atau bencana itu terjadi dekat tempat kediaman mereka, sehingga datanglah janji Allah. Sesungguhnya Allah tidak menyalahi janji. Dan tidak ada pertentangan dalam firmanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku bertaubat {Jika ada suatu bacaan yang dengannya gunung-gunung dapat digeser} Gunung-gunung dapat dipindah dari tempatnya {bumi dibelah} tanah dibelah dengannya sehingga membuat sungai dan mata air {atau orang mati dapat diajak bicara} orang mati dapat diajak bicara dengannya sehingga mereka hidup kembali dengan bacaan itu terhadap mereka {Sebenarnya segala urusan itu milik Allah. Apakah orang-orang yang beriman tidak mengetahui} mengetahui dan jelas {bahwa jika Allah menghendaki, tentu Allah telah memberi petunjuk kepada semua manusia. Orang-orang yang ingkar itu senantiasa ditimpa bencana disebabkan perbuatan mereka} bencana dan musibah yang menimpa mereka {atau bencana itu terjadi di dekat rumah mereka sampai datang janji Allah. Sesungguhnya Allah tidak menyalahi janji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Allah berfirman untuk menjelaskan keutamaan al-Quran al-Karim atas seluruh kitab yang diturunkan. “dan sekiranya ada suatu bacaan (kitab suci),” dari kitab-kitab Allah “yang dengan itu gunung-gunung dapat digoncangkan,” dari tempat-tempatnya dan “dan bumi jadi terbelah,” menjadi bentuk kebun-kebun dan sungai-sungai, dan “karenanya orang-orang yang sudah mati dapat berbicara,” maka kitab itu tentulah al-Quran. “Sebenarnya segala urusan itu adalah kepunyaan Allah,” Dia membawakan ayat-ayat yang dituntut oleh hikmahNya. Mengapa orang-orang yang mendustakan saling mengusulkan ayat-ayat (yang mesti diturunkan)? Apakah pakah mereka dan orang lain mempunyai hak pengaturan? “Maka tidaklah orang-orang yang beriman itu mengetahui bahwa seandainya Allah menghendaki (semua manusia beriman), tentu Allah memberi petunjuk kepada manusia semuanya,” sehingga mereka mengetahui bahwa Allah Mahakuasa untuk memberikan hidayah kepada mereka semua? Akan tetapi Dia tidak menghendakinya. Allah mencurahkan hidayah kepada orang yang dikehendakiNya dan menyesatkan orang yang dikehendakiNYa. “dan orang-orang yang kafir senantiasa,” berada dalam kekufuran mereka, tidak sudi mengambil ‘ibrah (pelajaran) dan tidak menyambut nasihat. Allah akan menuangkan bahaya besar dengan bertubi-tubi yang akan menimpa mereka di kampung-kampung mereka atau muncul di dekatnya, dalam keadaan mereka tetap bersikeras berpegang teguh pada kekufuran, “sehingga datanglah janji Allah,” yang mana Allah menjanjikan mereka dengannya, untuk menurunkan siksaan yang berkelanjutan yang tidak mungkin diberhentikan. “Sesungguhnya Allah tidak menyalahi janji.” Ini merupakan ancaman dan peringatan yang menakutkan bagi mereka, dalam bentuk turunnya sesuatu yang telah Allah janjikan sebagai balasan kekufuran dan penentangan serta tindak ke zhaliman mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سُيِّرَتۡ بِهِ ٱلۡجِبَالُ) suyyirat bihil jibaalu : dipindah dari tempatnya (gunung). (أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ) aw quthi’at bihil ardh : dibelah dan dibuat didalamnya sungai-sungai dan mata air. (أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ) aw kullima bihil mautaa : para mayit dihidupkan dan berbicara. (أَفَلَمۡ يَاْيۡ‍َٔسِ) afalam yai’as : belum mengetahui. (قَارِعَةٌ) qaari’atun : hentakan yang menggetarkan hati mereka dengan rasa takut dan kesedihan, sehingga mereka binasa dan musnah seluruhnya. (أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ) aw tahullu qariibam min daarihim : bencana atau pasukan Islam. Makna ayat : Firman-Nya ta’ala (وَلَوۡ أَنَّ قُرۡءَانٗا)... dan seterusnya, tidak diragukan bahwa para musyrikin Mekah dahulu mereka meminta hal-hal yang telah disebutkan, dan pada ayat ini, ketika mereka berkata, “Jika engkau adalah seorang rasul, berdoalah kepada Rabbmu untuk kami, hilangkanlah gunung-gunung disekitar kami, sehingga kami bisa memperluas lahan kami, dan belahlah tanah kami dan keluarkan untuk kami mata air dan sungai-sungai, dan hidupkanlah fulan dan fulan, hingga kami bisa bertanya kepada mereka tentang kebenaran perkataan dan klaimmu bahwa engkau adalah nabi. Maka Dia berfirman : (وَلَوۡ أَنَّ قُرۡءَانٗا سُيِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ) “Seandainya ada bacaan yang mampu mengguncangkan gunung-gunung, atau membelah bumi, atau membuat mayit berbicara.” Yaitu (bacaan itu) tentulah Al-Qur’an, namun bukanlah ayat-ayat yang dapat memberikan hidayah, bahkan seluruh keputusan adalah milik Allah, memberi hidayah bagi yang Dia kehendaki dan menyesatkan siapa yang Dia kehendaki. Ketika Allah memalingkan mereka dari ayat-ayat kauniyah karena Dia mengetahui seandainya Dia memberi mereka ayat-ayat tersebut, mereka tetap tidak akan beriman kepadanya, lalu mereka akan mendapatkan azab yang membinasakan sebagaimana umat-umat terdahulu. Ada sebagian dari orang-orang yang beriman yang mengharapkan (datangnya) ayat-ayat kauniyah tersebut, dengan prasangka sekirannya para musyrikin melihat ayat-ayat itu, mereka akan beriman dan peperangan antara syirik dan tauhid akan terselesaikan. Allah berfirman : (أَفَلَمۡ يَاْيۡ‍َٔسِ ٱلَّذِينَ ءَامَنُوٓاْ) yaitu orang-orang beriman mengetahui (أَن لَّوۡ يَشَآءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِيعٗاۗ) “Seandainya Allah berkehendak, niscaya seluruh manusia akan beriman.” Dia memberi hidayah dengan ayat-ayat atau tidak, maka seluruh urusan hanya milik Allah, Dia melakukan apapun yang dikehendaki-Nya dan menghukumi dengan kehendak-Nya. Firman-Nya : (وَلَا يَزَالُ ٱلَّذِينَ كَفَرُواْ تُصِيبُهُم بِمَا صَنَعُواْ) “Dan orang-orang kafir senantiasa tertimpa musibah disebabkan perbuatan mereka.” yaitu berupa kesyirikan dan maksiat (قَارِعَةٌ) yaitu bencana yang menggetarkan hati mereka dengan rasa takut dan khawatir, dan menimpa jiwa mereka dengan kekhawatiran dan kesedihan, yaitu seperti bencana kekeringan, penyakit, pembunuhan, dan penawanan (أَوۡ تَحُلُّ قَرِيبٗا مِّن دَارِهِمۡ) yaitu atau datangnya Rasul beserta pasukan Islam membuka kota Mekah hingga datang janji Allah berupa kemenangan—Wahai Rasul—atas mereka. Dan ayat ini bersifat umum setelah orang-orang Quraisy, dan ayat ini mencakup seluruh umat kafir, dan lihatlah peperangan yang menimpa mereka setiap satu atau dua abad dan peperangan senantiasa dekat dengan mereka, dan ini akan senantiasa menimpa mereka hingga datang pasukan Islam dekat dengan mereka agar mereka masuk ke dalam agama Allah atau menghancurkan mereka (إِنَّ ٱللَّهَ لَا يُخۡلِفُ ٱلۡمِيعَادَ ) “Sungguh Allah tidak pernah mengingkari janji-Nya.” Dan Dia telah menetapi janji-Nya kepada Quraisy. Pelajaran dari ayat : • Keagungan Al-Qur’an dan penjelasan mengenai keutamaannya. • Penggunaan kata al-ya’s yang bermakna ilmu. • Ancaman Allah ta’ala dengan bencana-bencana di dunia, terlebih akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 31: Dalam ayat ini, Allah Subhaanahu wa Ta'aala menerangkan kelebihan Al Qur’an di atas kitab-kitab lainnya yang diturunkan. Disebutkan dalam tafsir Al Jalaalain, bahwa ayat ini turun ketika orang-orang musyrik berkata kepada Rasulullah shallallahu 'alaihi wa sallam, “Jika engkau memang seorang nabi, maka singkirkanlah dari kami gunung-gunung Mekah, dan jadikanlah untuk kami di sana sungai-sungai dan mata air agar kami menanam dan menggarapnya, serta bangkitkanlah nenek-moyang kami yang sudah meninggal agar berbicara dengan kami bahwa engkau adalah seorang nabi.” Namun kami belum mengetahui kesahihan riwayat ini, wallahu a’lam. Menjadi kebun-kebun dan sungai-sungai. Ayat ini dapat juga diartikan, “Dan sekiranya ada suatu bacaan (kitab suci) yang dengan membacanya gunung-gunung dapat digoncangkan atau bumi jadi terbelah atau oleh karenanya orang-orang yang sudah mati dapat berbicara, maka itulah Al Qur’an (namun mereka tetap tidak juga akan beriman).” Bukan milik selain-Nya. Oleh karena itu, jika apa yang mereka usulkan itu didatangkan, maka tidak ada yang beriman selain orang yang Dia kehendaki untuk beriman. Disebutkan dalam tafsir Al Jalaalain, bahwa ayat ini turun berkenaan dengan keinginan para sahabat agar ditunjukkan mukjizat yang diusulkan orang-orang musyrik karena keinginan dari mereka agar orang-orang musyrik itu beriman. Tanpa perlu mendatangkan mukjizat. Tetapi Dia tidak menghendaki, Dia memberi petunjuk siapa yang Dia kehendaki dan menyesatkan siapa yang Dia kehendaki. Seperti dibunuh, ditawan, diperangi atau ditimpa kemarau panjang. Yang ditimpakan pasukan engkau wahai Muhammad. Ada yang menafsirkan dengan penaklukkan Mekah. Ada pula yang menafsirkan dengan ancaman Allah untuk diturunkan azab yang tidak mungkin ditolak. Ini merupakan ancaman untuk mereka (orang-orang kafir) dan untuk menakut-nakuti mereka terhadap turunnya azab yang diancamkan itu karena kekafiran, pembangkangan dan kezaliman mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 31",
    "description": "Dan peringatkanlah orang kafir bahwa sekiranya ada suatu bacaan dalam bentuk kitab suci yang dengan bacaan itu gunung-gunung dapat digoncangkan dari tempatnya semula, atau bumi jadi terbelah dan mengalirkan sungai-sungai, atau orang yang sudah mati kembali hidup dan dapat berbicara'sekiranya Allah menghendaki'maka bacaan itu adalah Al-Qur'an, bukti kerasulan nabi Muhammad. Sebenarnya segala urusan itu adalah milik Allah dan atas kehendak serta kewenangan-Nya. Maka tidakkah orang-orang yang beriman mengetahui bahwa sekiranya Allah menghendaki, tentu Allah memberi petunjuk kepada manusia semuanya sehingga semua beriman tanpa kecuali. Dan orang-orang kafir yang mengingkari Al-Qur'an senantiasa ditimpa bencana, seperti kekalahan melawan kaum mukmin, disebabkan perbuatan buruk mereka sendiri, atau bencana itu terjadi dekat tempat kediaman mereka, sampai akhirnya datang janji Allah berupa kemenangan kaum mukmin dalam penaklukan kota mekah. Sungguh, Allah tidak akan pernah menyalahi janji. Dan ingatlah, wahai nabi Muhammad, bahwa apabila kaummu yang kafir menghina dan memperolok dakwahmu, sesungguhnya beberapa rasul sebelum engkau telah pula diperolok-olokkan oleh kaum mereka yang ingkar. Karena perbuatan buruk itu, maka aku beri tenggang waktu be-berapa lama kepada orang-orang kafir itu untuk bersenang-senang dalam kedurhakaan mereka, kemudian setelah waktu yang telah aku tetapkan tiba, aku binasakan mereka dengan siksa yang sangat pedih. Maka alangkah hebatnya siksaan-ku yang aku timpakan itu!."
  }
]