[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka mengolok-olok dakwahmu (wahai rasul), maka sungguh umat-umat sebelummu telah memperolok rasul-rasul mereka. Karena itu, janganlah kamu bersedih hati. Sungguh aku hanya menangguhkan waktu orang-orang kafir itu, kemudian aku binasakan mereka dengan siksaanKu. Dan siksaan itu adalah siksaan yang amat dahsyat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Kamu bukan Rasul pertama yang didustakan dan dilecehkan oleh kaumnya. Umat-umat sebelumnya -wahai Rasul- telah melecehkan dan mendustakan rasul-rasul mereka, lalu Kami menangguhkan orang-orang yang kafir kepada Rasul-rasul mereka itu sehingga mereka menyangka bahwa Kami tidak akan membinasakan mereka, kemudian Aku mengazab mereka sesudah penangguhan tersebut dengan berbagai bentuk azab. Bagaimana kamu melihat hukuman-Ku atas mereka? Suatu azab yang sangat berat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Hai Rasulullah, Sungguh orang-orang kafir selalu menghina rasul-rasul mereka sebelummu, akan tetapi Aku menangguhkan azab mereka dan membiarkan mereka dalam keadaan aman, kemudian Aku akan mengazab mereka secara tiba-tiba; maka bagaimana azab-Ku bagi mereka akibat kekafiran yang mereka lakukan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا۟ (maka Aku beri tangguh kepada orang-orang kafir) Makna (الإملاء) yakni penangguhan dan penundaan. فَكَيْفَ كَانَ عِقَابِ (Alangkah hebatnya siksaan-Ku itu) Yakni betapa besarnya siksaan-Ku bagi orang-orang kafir yang menghina para rasul."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Membiarkan orang-orang kafir dengan kekejian mereka selama sesaat yang singkat, bukan untuk melupakan dan lalai atas perbuatan mereka, dan bukan pula dengan memberikan keleluasan bagi mereka dengan segala kenikmatan untuk memuliakan sebagaimana yang mereka sangka, melainkan adalah istidroj sampai kemudian mereka akan dibinasakan dengan siksaan yang pedih namun mereka tidak dapat mengetahui kapan terjadinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32 Sebagaimana mereka para musyrikin telah memperolok kamu wahai rasul, mereka juga telah memperolok beberapa rasul sebelum kamu ketika mereka diseru kepada keimanan. Namun mereka sabar atas itu, maka Aku beri waktu tangguh kepada orang-orang kafir itu waktu agar mereka bertaubat. Kemudian Aku binasakan mereka dengan azab yang pedih. Alangkah hebatnya siksaan dan hinaan-Ku itu!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh para rasul sebelummu benar-benar telah diolok-olok. Maka Aku memberi tenggang waktu kepada orang-orang kafir} maka Aku memberi menangguhkan orang-orang kafir dan memanjangkan waktu mereka {kemudian Aku menyiksa mereka} menghukum mereka {Alangkah dahsyatnya hukumanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berfirman kepada RasulNya untuk meneguhkan hati dan menghiburnya, “Dan sesungguhya telah diperolok-olokkan beberapa rasul sebelum kamu,” engkau bukanlah rasul pertama yang didustakan dan disakiti “maka Aku beri tangguh kepada orang-orang kafir itu,” (yang mengingkari) rasul-rasul yang diutus kepada mereka. Maksudnya, Aku memberikan penagguhan tempo bagi mereka sampai mereka mengira tidak akan disiksa. “Kemudian Aku binasakan mereka,” dengan berbagai macam siksaan. “Alangkah hebatnya siksaanKu itu,” hal ini merupakan hukuman yang keras dan siksaan yang menyakitkan, maka jangan sampai orang-orang yang mendustakan dan memperolokmu itu tertipu daya dengan penangguhan siksaan dari Kami. Mereka mempunyai cermin pada (kisah) orang-orang yang telah berlalu. Hendaknya mereka berhati-hati, jangan sampai hal itu diwujudkan kepada mereka sebagaimana telah ditimpakan kepada mereka (yang terdahulu kisahnya)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَأَمۡلَيۡتُ) fa’amlaitu : Aku undur dan akhirkan mereka untuk waktu yang lama. Makna ayat : Dan pada ayat (32) Allah ta’ala mengabarkan kepada Rasul-Nya seraya menghiburnya atas kesulitan dan rasa sakit yang ia rasakan dari sikap keras kaum musyrikin dan penentangan mereka, Dia berfirman : (وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ) “Dan sungguh rasul-rasul sebelum engkau sudah dihina.” Sebagaimana engkau dihina, dan mereka bersabar, maka bersabarlah engkau, (فَأَمۡلَيۡتُ لِلَّذِينَ كَفَرُواْ) yaitu Aku undur mereka dan tangguhkan, sampai tegak hujjah atas mereka, kemudian Aku siksa mereka dan tidak-Ku sisakan mereka satu pun (فَكَيۡفَ كَانَ عِقَابِ) “Maka, betapa berat azab-Ku.” azab itu adalah keras, meliputi seluruhnya, dan terjadi sesuai dengan janji-Nya, dan begitulah yang Aku perbuat untuk mereka yang menghinamu—Wahai Rasul Kami—jika mereka tidak mau bertaubat dan masuk Islam. Pelajaran dari ayat : • Allah jalla jalaaluhu menunda dan menangguhkan tetapi tidak membiarkan, bahkan Dia akan menjatuhkan siksa dan hukuman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 32: Oleh karena itu, engkau bukanlah orang pertama yang didustakan dan disakiti. Ayat ini merupakan hiburan bagi Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni tepat mengenai sasaran. Demikian pula tindakan Allah kepada orang-orang yang mengolok-olok Rasul-Nya. Oleh karena itu, janganlah sekali-kali mereka yang mendustakan dan mengolok-olok itu tertipu bahwa mereka tidak akan diazab hanya karena diberi tenggang waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 32",
    "description": "Dan ingatlah, wahai nabi Muhammad, bahwa apabila kaummu yang kafir menghina dan memperolok dakwahmu, sesungguhnya beberapa rasul sebelum engkau telah pula diperolok-olokkan oleh kaum mereka yang ingkar. Karena perbuatan buruk itu, maka aku beri tenggang waktu be-berapa lama kepada orang-orang kafir itu untuk bersenang-senang dalam kedurhakaan mereka, kemudian setelah waktu yang telah aku tetapkan tiba, aku binasakan mereka dengan siksa yang sangat pedih. Maka alangkah hebatnya siksaan-ku yang aku timpakan itu!azab yang Allah timpakan kepada orang kafir tidak bersifat semena-mena, melainkan berdasarkan hasil pengawasan yang akurat. Maka apakah tuhan yang menjaga, mengawasi, dan mencatat melalui para malaikat, setiap jiwa terhadap apa yang diperbuatnya sama dengan berhalaberhala yang orang kafir itu sembah' mereka menjadikan sekutu-sekutu bagi Allah dengan membuat dan menyembah berhala. Katakanlah, wahai nabi Muhammad, hai orang kafir, sebutkanlah sifat-sifat mereka' yakni berhala-berhala yang kamu sembah itu! atau apakah kamu mengira dengan nada mengejek hendak memberitahukan kepada Allah apa yang tidak diketahui-Nya di bumi'yaitu terkait berhala-berhala tersebut'atau kamu mengatakan tentang hal itu hanya sekadar perkataan pada lahirnya saja tanpa ada substansinya sama sekali' sebenarnya bagi orang kafir ejekan dan tipu daya mereka itu dijadikan terasa indah oleh setan, dan mereka dihalangi olehnya dari jalan yang benar. Dan barang siapa disesatkan oleh Allah akibat kekufurannya sendiri, maka tidak ada seorang pun yang dapat memberi petunjuk baginya menuju kebenaran."
  }
]