[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah tuhan yang selalu mengurus setiap jiwa, menghitung semua yang diperbuatnya lebih berhak untuk disembah, atau apakah makhluk-makhluk yang lemah ini? mereka -lantaran kebodohan mereka- menjadikan sekutu-sekutu bagi Allah dari makhlukNya yang mereka sembah. Katakanlah -wahai rasul-, kepada mereka, ”sebutlah nama-nama dan sifat-sifat mereka,” niscaya mereka tidak akan mendapati sesuatu dari sifat-sifatnya yang menjadikan tuhan-tuhan itu layak untuk disembah, ”ataukah kalian mau memberitahukan kepada Allah sekutu-sekutuNya di muka bumi yang tidak diketahuiNya, ataukah kalian menamai mereka sebagai sekutu-sekutu dengan istilah semata sementara ia tidak memiliki hakikat?” Bahkan sebetulnya setan telah menjadikan orang-orang kafir memandang baik perkataan mereka yang batil dan menghalangi mereka dari jalan Allah. Maka barangsiapa yang tidak diberi taufik oleh Allah untuk memperoleh hidayahNya, maka tidak ada seorangpun yang dapat memberinya petunjuk dan taufik menuju jalan kebenaran dan jalan lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Apakah Allah yang menjaga rezeki semua makhluk dan yang Maha mengawasi setiap jiwa dengan amal perbuatan yang dilakukannya lalu membalasnya atas amal tersebut lebih layak untuk disembah atau berhala-berhala yang tidak berhak untuk disembah? Orang-orang kafir menjadikannya sebagai sekutu-sekutu bagi Allah secara zalim dan dusta. Katakanlah kepada mereka -wahai Rasul-, tunjukkanlah kepada kami sekutu-sekutu yang kalian sembah bersama Allah bila kalian adalah orang-orang yang benar dalam klaim kalian katakan, ataukah kalian memberitahu Allah tentang sekutu-sekutu yang tidak Dia ketahui di bumi, atau kalian memberitahu Allah tentang perkataan palsu yang tidak ada hakikatnya? Setanlah yang menjadikan makar jahat orang-orang kafir kelihatan baik di depan mata mereka sehingga mereka kafir kepada Allah dan setan juga yang memalingkan mereka dari jalan hidayah dan jalan yang lurus. Barangsiapa yang Allah sesatkan dari jalan lurus maka tidak ada seorang pun yang memberinya hidayah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Apakah Yang Maha Melihat dan Mengawasi perbuatan seluruh manusia, seperti berhala-berhala yang tidak dapat mendengar atau memberi manfaat? Mereka membuat sekutu-sekutu bagi Allah dari makhluk-Nya, kemudian menyembah mereka. Hai Nabi, Katakanlah: “Sebutkanlah nama-nama dan sifat-sifat mereka, apakah mereka berhak disembah?” Kemudian Allah kembali mengingkari mereka: “Atau dapatkah kalian memberitahukan kepada-Nya sekutu-sekutu kalian yang tidak Allah ketahui? Atau kalian memberi nama sekutu-sekutu itu dengan lafadz yang batil? Sungguh setan telah menghiasi bagi orang-orang kafir perkataan mereka yang sesat, menghalangi mereka dari hidayah dan menghalangi manusia lainnya. Barangsiapa yang disesatkan Allah maka tidak ada seorangpun yang dapat memberinya hidayah. Di dunia mereka akan mendapat azab berupa terbunuh, tertawan, atau tertindas; sedangkan azab akhirat bagi mereka lebih keras dan lebih berat, tidak ada yang dapat menolong mereka dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. أَفَمَنْ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفْسٍۭ (Maka apakah Tuhan yang menjaga setiap diri) Yakni tidaklah Allah yang mengatur seluruh urusan makhluk-Nya dan menentukan ajal dan rezeki mereka seperti patung-patung dan orang-orang mati yang dijadikan oleh orang-orang musyrik sebagai sekutu Allah; mereka tidak dapat mengatur dan menjaga sesuatu apapun. وَجَعَلُوا۟ ِللهِ شُرَكَآءَ (Mereka menjadikan beberapa sekutu bagi Allah) Yakni mereka telah menjadikan sekutu bagi-Nya. قُلْ سَمُّوهُمْ ۚ( Katakanlah: “Sebutkanlah sifat-sifat mereka itu) Yakni katakanlah wahai Muhammad “kalian telah menjadikan sekutu-sekutu bagi-Nya, maka sebutkanlah siapa mereka itu? Mereka sangat hina untuk disebut sebagai tuhan-tuhan sebagaimana yang kalian anggap”. أَمْ تُنَبِّـُٔونَهُۥ(Atau apakah kamu hendak memberitakan kepada Allah) Yakni atau apakah kalian akan memberitahukan Allah. بِمَا لَا يَعْلَمُ فِى الْأَرْضِ(apa yang tidak diketahui-Nya di bumi) Yaitu sekutu-sekutu yang kalian sembah; padahal Allah Maha Mengetahui segala yang ada di langit dan di bumi. أَم بِظٰهِرٍ مِّنَ الْقَوْلِ ۗ( atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja) Tanpa mengatakan hal yang sebenarnya. Allah hanya menyebutkan “di bumi” sebab mereka menjadikan sekutu yang berada di bumi dan bukan di langit. بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا۟ مَكْرُهُمْ(Sebenarnya orang-orang kafir itu dijadikan (oleh syaitan) memandang baik tipu daya mereka) Tipu daya mereka adalah kekafiran mereka yang digunakan oleh pemimpin dan setan-setan mereka sebagai tipu daya bagi pengikut-pengikutnya agar mereka tersesat. وَصُدُّوا۟ عَنِ السَّبِيلِ ۗ( dan dihalanginya dari jalan (yang benar)) Yakni kebebalan mereka menghalangi mereka. Atau setan menghalangi mereka. وَمَن يُضْلِلِ اللهُ فَمَا لَهُۥ مِنْ هَادٍ(Dan barangsiapa yang disesatkan Allah, maka baginya tak ada seorangpun yang akan memberi petunjuk) Yakni barangsiapa yang dijadikan Allah sebagai orang yang sesat sesuai dengan hikmah kehendak-Nya, maka ia tidak akan memiliki seorangpun yang dapat memberinya petunjuk kepada kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika seorang pastur mengunjungi salah satu festival yang diadakan oleh kementrian urusan islam di afrika bagian selatan, mereka pun menjelaskan kepada pastur ini beberapa poin tetang pengajaran al-qur'an dengan singkat, kemudian memberikan hadiah selembaran terjemahan dari al-qur'an, setelah beranjak pergi dan membaca lembaran itu sang pastur kembali lagi dan berkata : \"ini bukan sekedar buku bacaan, melainkan juga sebagai pedoman hidup\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33 Lalu apakah sama antara Dia yang senantiasa menjaga setiap jiwa, atas apapun yang diperbuatnya, sama dengan para berhala yang bahkan tidak mampu memberi manfaat ataupun memberi bencana, serta sama sekali tidak memiliki sifat seperti itu? Mereka telah membuat beberapa sekutu bagi Allah. Katakanlah wahai nabi: “Sebutkanlah sifat-sifat mereka itu”. Atau apakah kamu hendak memberitahukan kepada Allah apa yang di bumi ini tidak Allah ketahui, atau kamu mengatakan tentang hal itu sekadar perkataan lahir saja. Sebenarnya orang-orang kafir itu telah syetan jadikan setiap mereka memandang sebagai tipu daya mereka dan mereka dihalangi dari jalan yang benar. Barangsiapa yang disesatkan Allah dari kebenaran dan petunjuk, maka baginya tak ada seorangpun yang akan memberi petunjuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah Dia yang mengawasi} menjaga dan mengawasi {setiap jiwa atas apa yang diperbuat} diperbuat berupa kebaikan atau keburukan {Mereka menjadikan sekutu-sekutu bagi Allah. Katakanlah,“Sebutkanlah sifat-sifat mereka} jelaskanlah nama-nama mereka atau apakah kalian akan memberitahu Dia} mengabarkan kepada Allah SWT {apa yang tidak diketahuiNya di bumi atau sekedar perkataan pada lahirnya saja”} bahkan kalian memberinama para sekutu itu dengan perkataan sekedar pada bagian luar saja tanpa ada hakikatnya {bahkan telah dijadikan indah bagi orang-orang kafir tipu daya mereka dan mereka dihalangi dari jalan} mereka dihalangi dari jalan agama {Siapa saja yang disesatkan Allah, maka tidak ada seorang pun yang dapat memberi petunjuk baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah berfirman, “Maka apakah Rabb yang menjaga setiap jiwa terhadap apa yang diperbuatnya (sama dengan yang tidak demikian sifatnya)?” dengan balasan cepat dan balasan yang ditunda dengan pertimbangan keadilan dan keseimbangan. Dan Dia-lah Allah Yang Mahasuci dan Mahatinggi, (apakah) sama dengan Dzat yang tidak melakukan demikian. Oleh karenanya, Allah berfirman, “Mereka menjadikan beberapa sekutu bagi Allah,” Dia-lah Allah Yang Mahasatu lagi esa dan ash-shamad (menjadi tempat bergantung (segala sesuatu)), yang tidak ada sekutu bagiNya, juga tidak ada tandingan dan padanan bagiNya. “Katakanlah,” kepada mereka jika mereka mau jujur “Sebutkanlah sifat-sifat mereka itu,” agar engkau mengetahui kondisi-kondisi mereka (sekutu-sekutu) “Atau apakah kamu hendak memberitahukan kepada Allah apa yang tidak diketahuiNya di bumi,” apabila Allah Maha mengetahui yang ghaib dan yang nyata namun Dia tidak mengetahui adanya sekutu bagiNya, dan kalian laksana orang yang memberitahukan kepada Allah bahwa Dia mempunyai sekutu yang tidak diketahui olehNya. Ini merupakan kebatilan yang tiada taranya! Karenanya, Allah berfirman, “Atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja”. Maksudnya, kemungkinan maksimal dari klaim keberadaan sekutu bagi Allah bahwa ia adalah sekedar perkataan pada lahirnya saja. Adapun faktanya, maka tidak ada ilah (sesembahan) yang berhak disembah kecuali Allah, tidak ada seorang makhluk pun yang berhak untuk disembah. Tetapi, “(Sebenarnya) orang-orang kafir itu dijadikan (oleh setan) memandang baik tipu daya mereka” yang telah mereka rencanakan, yaitu kekufuran, kesyirikan, dan kedustaan mereka kepada ayat-ayat Allah “dan dihalanginya dari jalan (yang benar),” yakni dari jalan lurus yang menghubungkan kepada Allah dan ke tempat kemuliaanNya “Dan barangsiapa yang disesatkan Allah, maka tak ada seorang pun yang akan memberinya petunjuk,” sebab, tidak ada seorang makhluk pun yang memegang kendali pengaturan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ) afaman huwa qaa’imun ‘alaa kulli nafsim bimaa kasabat : Yang Menjaga, Memberinya rizki, Mengetahui jiwanya, dan seluruh amal yang dia lakukan, kemudian membalas atas setiap perbuatannya. (قُلۡ سَمُّوهُمۡۚ) qul sammuuhum: jelaskan kepada kami sifat-sifatnya. (أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ) am tunabbiuhu bimaa laa ya’lamu : apakah kalian mengabarkan kepada-Nya sesuatu yang tidak Dia ketahui? (بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ) bizhaahirim minal qaul : dengan prasangka yang batil, tidak nyata. Makna ayat : Masih membahas mengenai penegasan tauhid dan penghapusan segala sekutu selain Allah dengan firman-Nya : (أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۢ بِمَا كَسَبَتۡۗ) yaitu penjaganya, yang memberikan rizki, yang mengetahui tentang dirinya dan segala perbuatannya baik yang baik ataupun yang buruk, dan yang membalas segala perbuatannya, sama dengan yang tidak menjaga, tidak memberikan rizki, tidak mengetahui, tidak pula membalas suatu perbuatan, berhala. Oleh karena itu, penuhanan mereka terhadap berhala-berhala tersebut telah hilang, dan tidak tersisa lagi bagi mereka kecuali sesembahan yang benar yaitu Allah yang tidak ada sesembahan yang berhak disembah kecuali Dia dan tidak ada yang mengatur alam semesta ini selain Dia. Firman-Nya : (وَجَعَلُواْ لِلَّهِ شُرَكَآءَ) yaitu mereka menyekutukan Allah dengan berhala-berhala tersebut dalam ibadah (قُلۡ سَمُّوهُمۡۚ) Katakanlah kepada mereka, wahai Rasul Kami! “Beritahu kami nama-nama berhala itu, sifat mereka, dan jelaskan siapa mereka?!” (أَمۡ تُنَبِّ‍ُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ) apakah kalian menyampaikan sesuatu yang tidak Allah ketahui di bumi? (أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ) atau bahkan hanya perkataan yang batil, yaitu dengan prasangka yang salah tidak ada bukti yang nyata Firman-Nya : (بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ) yaitu perkataan dusta mereka dan tuduhan-tuduhan yang penuh makar, sehingga mereka menghalang-halangi jalan kebenaran, dan berpaling darinya lalu mereka pun tidak mendapatkan hidayah kepadanya (وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ) “Dan barangsiapa yang Allah sesatkan, maka tidak akan ada yang dapat memberikannya petunjuk.” Pelajaran dari ayat : • Penetapan akidah tauhid; karena berhala-berhala tidak dapat menjaga, memberi rizki, tidak menghitung perbuatan hamba dan tidak pula membalasnya, sedangkan Allah, Dialah Yang Mengurus seluruh makhluk, Dialah sesembahan yang berhak disembah, adapun selain-Nya, maka dia hanyalah sesembahan yang batil tidak benar dan hanya sekedar nama saja. • Teguhnya orang-orang kafir di atas kekufuran mereka adalah buah dari penghiasan syaitan terhadap mereka, sehingga mereka terhalang dari jalan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 33: Tentu tidak sama. Padahal Dia Mahaesa dan semua makhluk bergantung kepada-Nya. Agar diketahui keadaan yang sebenarnya. Bahwa Dia memiliki sekutu. Jika memang Dia memiliki sekutu, tentu Dia mengetahuinya. Yakni sebagai sekutu. Yang sama sekali tidak ada hakikatnya. Yakni perbuatan kufurnya, syirknya dan pendustaannya terhadap ayat-ayat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 33",
    "description": "Azab yang Allah timpakan kepada orang kafir tidak bersifat semena-mena, melainkan berdasarkan hasil pengawasan yang akurat. Maka apakah tuhan yang menjaga, mengawasi, dan mencatat melalui para malaikat, setiap jiwa terhadap apa yang diperbuatnya sama dengan berhalaberhala yang orang kafir itu sembah' mereka menjadikan sekutu-sekutu bagi Allah dengan membuat dan menyembah berhala. Katakanlah, wahai nabi Muhammad, hai orang kafir, sebutkanlah sifat-sifat mereka' yakni berhala-berhala yang kamu sembah itu! atau apakah kamu mengira dengan nada mengejek hendak memberitahukan kepada Allah apa yang tidak diketahui-Nya di bumi'yaitu terkait berhala-berhala tersebut'atau kamu mengatakan tentang hal itu hanya sekadar perkataan pada lahirnya saja tanpa ada substansinya sama sekali' sebenarnya bagi orang kafir ejekan dan tipu daya mereka itu dijadikan terasa indah oleh setan, dan mereka dihalangi olehnya dari jalan yang benar. Dan barang siapa disesatkan oleh Allah akibat kekufurannya sendiri, maka tidak ada seorang pun yang dapat memberi petunjuk baginya menuju kebenaran. Mereka (orang kafir yang menyimpang dari jalan Allah) mendapat siksaan dalam kehidupan dunia, seperti kekalahan dalam perang dan kehinaan hidup, dan mereka juga akan mendapat azab di akhirat. Sungguh, azab di akhirat itu pasti lebih keras. Tidak ada seorang pun yang dapat melindungi dan menyelamatkan mereka dari azab Allah di dunia maupun akhirat."
  }
]