[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir yang menghalang-halangi (manusia) dari jalan Allah akan mendapatkan siksaan berat di dunia, dengan terbunuh, ditawan dan kehinaan. Dan siksaan mereka di akhirat benar-benar lebih berat dan lebih dahsyat. Dan tidak ada seorang pelindung pun bagi mereka yang melindungi mereka dari siksaan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Mereka mendapatkan azab di kehidupan dunia ini melalui pembunuhan dan penawanan di tangan orang-orang mukmin dan azab alam Akhirat yang menantikan mereka lebih berat bagi mereka, lebih besar daripada azab dunia, karena di samping ia berat, ia abadi tidak terputus, mereka tidak memiliki pelindung yang melindungi mereka dari azab Allah pada Hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. لَّهُمْ عَذَابٌ فِى الْحَيَوٰةِ الدُّنْيَا ۖ (Bagi mereka azab dalam kehidupan dunia) Dengan pembunuhan, penyanderaan, dan lain sebagainya yang menimpa mereka. وَلَعَذَابُ الْاٰخِرَةِ أَشَقُّ ۖ( dan sesungguhnya azab akhirat adalah lebih keras) Lebih berat bagi mereka daripada azab di dunia. وَمَا لَهُم مِّنَ اللهِ مِن وَاقٍ(dan tak ada bagi mereka seorang pelindungpun dari (azab) Allah) Yang dapat melindungi dan menjauhkan mereka dari azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34 Bagi mereka para orang kafir adalah azab dalam kehidupan dunia berupa dibinasakan, dan sesungguhnya azab akhirat adalah lebih keras dan tak ada bagi mereka seorang pelindungpun dari azab Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka itu azab di kehidupan dunia dan sungguh azab akhirat itu lebih pedih} lebih dahsyat {Tidak ada bagi mereka itu pelindung dari (azab) Allah} penjaga yang menjaga mereka dari azabNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Mereka mendapatkan azab dalam kehidupan dunia, dan sesungguhnya azab akhirat adalah lebih keras,” daripada siksaan dunia karena kedahsyatan dan kontinyuitasnya “dan tak ada bagi mereka seorang pelindungpun dari (azab) Allah,” yang akan melindungi mereka dari siksa (Allah). SiksaNya bila sudah diarahkan kepada mereka, maka tidak ada seorang pun yang mampu menghalanginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَشَقُّۖ) asyaqq : lebih berat. (وَاقٖ) waaqin : penghalang yang menghalanginya dari azab. Makna ayat : Firman-Nya : (لَّهُمۡ عَذَابٞ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ) “Bagi mereka azab di kehidupan dunia,” dengan pembunuhan dan penangkapan (وَلَعَذَابُ ٱلۡأٓخِرَةِ أَشَقُّۖ) “dan azab akhirat lebih berat.” Yaitu lebih berat dari azab di dunia sebesar apapun (وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقٖ) “dan mereka tidak mempunyai penolong dari azab Allah.” Yaitu mereka tidak memiliki pelindung dan penyelamat dari Allah dan membelanya sehingga mereka bisa menyelamatkannya dari azab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 34: Seperti dengan dibunuh dan ditawan. Karena dahsyat dan kekalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 34",
    "description": "Mereka (orang kafir yang menyimpang dari jalan Allah) mendapat siksaan dalam kehidupan dunia, seperti kekalahan dalam perang dan kehinaan hidup, dan mereka juga akan mendapat azab di akhirat. Sungguh, azab di akhirat itu pasti lebih keras. Tidak ada seorang pun yang dapat melindungi dan menyelamatkan mereka dari azab Allah di dunia maupun akhirat. Usai menggambarkan sanksi bagi orang kafir pada ayat-ayat sebelumnya, pada ayat berikut Allah menjelaskan anugerah-Nya kepada orang yang bertakwa. Perumpamaan dan gambaran surga yang dijanjikan oleh Allah kepada orang yang bertakwa ialah bahwa surga itu seperti taman yang mengalir di bawahnya'yakni di bawah pepohonan dan istana-istananya'sungai-sungai; pepohonan di sana senantiasa berbuah dengan aneka rasa yang lezat dan juga menciptakan suasana yang teduh. Anugerah Allah yang sedemikian indah itulah tempat kesudahan yang hanya diberikan-Nya bagi orang yang bertakwa; sedang tempat kesudahan bagi orang yang ingkar kepada tuhan ialah neraka beserta siksaannya yang sangat pedih."
  }
]