[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sifat surga yang Allah janjikan kepada orang-orang yang takut kepadaNya, adalah surga yang dibawah pepohonan dan istana-istannya mengalir sungai-sungai. Buah-buahnnya tidak pernah putus, dan naungannya tidak hilang dan tidak berkurang. Balasan dengan surga itu adalah kesudahan orang-orang yang takut kepada Allah, maka mereka menjauhi maksiiat-maksiat kepadaNya dan melaksanakan kewajiban-kewajiban dariNya, sedangkan kesudahan orang-orang kafir kepada Allah adalah neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sifat Surga yang Allah janjikan untuk orang-orang yang bertakwa kepada-Nya dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya adalah bahwa di bawah istana-istana dan pepohonannya mengalir sungai-sungai, buah-buahannya langgeng tidak terputus, berbeda dengan buah-buahan di dunia. Naungannya langgeng tidak terputus, dan tidak menghilang. Itu adalah balasan bagi orang-orang yang bertakwa dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Sedangkan balasan bagi orang-orang kafir adalah api neraka yang akan mereka masuki untuk tinggal selama-lamanya di sana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Sifat surga yang dijanjikan Allah bagi orang-orang yang bertakwa adalah di dalamnya terdapat sungai-sungai yang mengalir di bawah pohon-pohon dan istana-istananya; pohon-pohonnya tidak pernah berhenti berbuah dan naungannya sangat panjang. Itulah balasan yang memiliki derajat yang tinggi sebagai balasan bagi orang-orang yang bertakwa; sedangkan balasan bagi orang-orang yang mendustakan Allah adalah neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. مَّثَلُ الْجَنَّةِ الَّتِى وُعِدَ الْمُتَّقُونَ ۖ (Perumpamaan surga yang dijanjikan kepada orang-orang yang takwa) Yang mempunyai sifat yang menakjubkan, yaitu: mengalir sungai-sungai di dalamnya; buah dab naungannya tak henti-henti. تَجْرِى مِن تَحْتِهَا الْأَنْهٰرُ ۖ أُكُلُهَا دَآئِمٌ((seperti taman); mengalir sungai-sungai di dalamnya; buahnya tak henti-henti) Yakni pepohonannya berbuah tak henti-henti, tidak seperti buah dari pepohonan yang ada di dunia. وَظِلُّهَا ۚ( sedang naungannya (demikian pula)) Tidak berkurang dan tidak pula hilang oleh sinar matahari. وَّعُقْبَى الْكٰفِرِينَ النَّارُ (sedang tempat kesudahan bagi orang-orang kafir ialah neraka) Tidak memiliki tempat lain kecuali neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35 Perumpamaan surga yang dijanjikan kepada orang-orang yang bertakwa ialah; bahwa di bawah taman-taman surga mengalir sungai-sungai, buahnya tak henti-henti berbuah dan terus menerus rimbun. Itulah tempat tinggal bagi orang-orang yang bertakwa yang senantiasa melakukan perintah Allah dan menjauhi larangan-Nya, sedangkan tempat tinggal bagi orang-orang kafir ialah neraka, tidak ada lagi selain itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Perumpamaan} ciri {surga yang dijanjikan kepada orang-orang yang bertakwa itu mengalir di bawahnya sungai-sungai, buah-buahnya} buah-buahnya {senantiasa ada dan teduh. Itulah tempat kesudahan} tempat akhir {bagi orang-orang yang bertakwa. Sedangkan tempat kesudahan} tempat akhir {bagi orang-orang kafir ialah neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Allah mengatakan, “Perumpamaan surga yang dijanjikan kepada orang-orang yang bertakwa,” orang-orang yang meninggalkan apa yang dilarang oleh Allah, tidak menyepelekan perintah-perintahNya; maksudnya sifat dan hakikat surga itu “ialah (seperti taman yang) mengalir sungai-sungai di bawahnya,” yakni , sungai-sungai madu, sungai-sungai khamar, sungai-sungai susu, dan sungai-sungai air tawar yang mengalir pada selain parit, mengairi kebun-kebun dan pepohonan, sehingga menjadi sarat dengan berbagai macam buah-buahan. “Buahnya tak henti-henti, dan naungannya (demikian pula),” yakni, juga abadi. “Itulah tempat kesudahan bagi orang-orang yang bertakwa,” yaitu tempat kesudahan dan tempat kembali yang mana mereka menuju kepadanya. “Sedang tempat kesudahan bagi orang-orang kafir ialah neraka,” betapa besar perbedaan antara dua golongan tersebut!"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَّثَلُ ٱلۡجَنَّةِ) matsalul jannah : sifat dan ciri-ciri yang Kami ceritakan kepadamu. (أُكُلُهَا دَآئِمٞ وَظِلُّهَاۚ) ukuluhaa daaimuw wazhilluhaa : apa yang dimakan di sana abadi tidak akan habis, dan keteduhannya kekal tidak akan hilang. Makna ayat : Firman-Nya : (مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ) “Perumpamaan surga yang disediakan untuk orang-orang yang bertakwa.” Setelah Allah menyebutkan azab akhirat untuk orang-orang yang kafir dan jahat, melanjutkan penyebutan kenikmatan akhirat bagi orang-orang yang beriman dan bertakwa, firman-Nya : (مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ) sifat surga dan Allah sebutkan dalam firman-Nya : (تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ) “mengalir di bawahnya sungai-sungai, buahnya senantiasa ada, begitu pula naungannya.” Abadi, maka makanannya tidak akan habis, naungannya tidak akan hilang, tidak pula terhapus sinar matahari sebagimana naungan yang ada di dunia. Firman-Nya : (تِلۡكَ) yaitu surga (عُقۡبَى ٱلَّذِينَ ٱتَّقَواْۚ) “akhir bagi mereka yang bertakwa.” Bertakwa kepada Rabb mereka, beriman, menyembah, mentauhidkan-Nya, serta mentaati perintah-Nya dan menjauhi larangan-Nya (وَّعُقۡبَى ٱلۡكَٰفِرِينَ ٱلنَّارُ) “dan akhir bagi orang-orang kafir adalah neraka.” Makna al-‘uqbaa adalah akibat dari perbuatan baik ataupun buruk. Pelajaran dari ayat : • Keistimewaan Al-Qur’anul Karim dalam menggabungkan antara janji dan ancaman, dengan keduanya seseorang mampu meraih hidayah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 35: Ada sungai madu, sungai arak, sungai susu, dan sungai-sungai air biasa yang mengalir tanpa parit, lalu sungai-sungai itu menyirami kebun dan pepohonan, dan menghasilkan berbagai macam buah-buahan. Bandingkanlah keadaan keduanya, betapa jauh perbedaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 35",
    "description": "Usai menggambarkan sanksi bagi orang kafir pada ayat-ayat sebelumnya, pada ayat berikut Allah menjelaskan anugerah-Nya kepada orang yang bertakwa. Perumpamaan dan gambaran surga yang dijanjikan oleh Allah kepada orang yang bertakwa ialah bahwa surga itu seperti taman yang mengalir di bawahnya'yakni di bawah pepohonan dan istana-istananya'sungai-sungai; pepohonan di sana senantiasa berbuah dengan aneka rasa yang lezat dan juga menciptakan suasana yang teduh. Anugerah Allah yang sedemikian indah itulah tempat kesudahan yang hanya diberikan-Nya bagi orang yang bertakwa; sedang tempat kesudahan bagi orang yang ingkar kepada tuhan ialah neraka beserta siksaannya yang sangat pedih. Dan ketahuilah, wahai nabi Muhammad, bahwa ada sebagian dari orang yang telah kami berikan kitab kepada mereka (yahudi dan nasrani) yang bergembira dengan apa (Al-Qur'an) yang diturunkan kepadamu, seperti 'abdulla'h bin sala'm, karena kesesuaian antara Al-Qur'an dengan kitab mereka; dan ada pula di antara golongan yang bersekutu, yakni kaum musyrik mekah, yahudi, dan nasrani yang mengingkari sebagiannya. Katakanlah kepada mereka, aku hanya diperintah secara tegas untuk menyembah Allah semata dan tidak mempersekutukan-Nya dengan apa pun. Hanya kepada-Nya aku seru manusia menuju kebenaran, dan hanya kepada-Nya aku kembali untuk bertobat."
  }
]