[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang telah kami berikan kepada mereka kitab suci, dari kalangan yahudi dan nasrani, ada orang yang beriman kepadamu dari kalangan mereka seperta abdulloh bun salam dan Najasayi, mereka merasa gembira dengan al-qur’an yang diturunkan padamu, karena sesuai dengan apa yang mereka miliki. Dan dari golongan-golongan yang bersekutu di atas kekafiran untuk menentangmu, seperti sayyid dan A’qib, dua uskup najran, dan ka’ab bin asyraf, ada orang yang mengingkari sebagain yang diturunkan padamu. Katakanlah kepada mereka, ”Sesungguhnya Allah memerintahkanku untuk menyembahNya saja, dan tidak mempersekutukan apapun denganNya. kepada perwujudan peribadahan kepada Allah, aku menyeru sekalain manusia. dan kepadaNyalah tempat kembaliku dan tempat berpulangku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Orang-orang yang telah Kami beri Taurat dari kalangan orang-orang Yahudi, orang-orang yang telah Kami beri Injil dari kalangan orang-orang Nasrani, mereka berbahagia dengan apa yang diturunkan kepadamu -wahai Rasul ṣallallāhu 'alaihi wa sallam- karena ia sesuai dengan sebagian dari apa yang diturunkan kepada mereka. Di antara orang-orang Yahudi dan Nasrani ada orang-orang yang mengingkari sebagian dari apa yang diturunkan kepadamu yang tidak sesuai dengan keinginan hawa nafsu mereka atau pernyataan bahwa mereka telah merubah dan menyelewengkan. Katakanlah kepada mereka -wahai Rasul ṣallallāhu 'alaihi wa sallam-, “Sesungguhnya Rabbku hanya memerintahkanku agar menyembah-Nya semata tidak menyekutukan-Nya dengan sesuatu, hanya kepada Allah semata aku berdoa dan aku tidak berdoa kepada selain-Nya, hanya kepada Allah semata aku akan kembali, inilah yang diiyakan oleh Taurat dan Injil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan para ahli kitab yang beriman merasa bahagia dengan al-Qur’an yang diturunkan, karena mereka mengetahui kebenaran. Sedangkan orang-orang kafir yang selalu memusuhi orang-orang beriman mengingkari sebagian hukum dan kisah yang ada dalam al-Qur’an. Hai Rasulullah, katakanlah kepada mereka: sesungguhnya Tuhanku memerintahkanku untuk menyembah-Nya semata dan tidak menyekutukan-Nya dengan sesuatu apapun, aku menyeru manusia dan jin untuk menyembah-Nya, hanya kepada-Nya tempatku kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَالَّذِينَ ءَاتَيْنٰهُمُ الْكِتٰبَ يَفْرَحُونَ بِمَآ أُنزِلَ إِلَيْكَ ۖ (Orang-orang yang telah Kami berikan al-kitab kepada mereka bergembira dengan kitab yang diturunkan kepadamu) الكتاب yakni Taurat dan Injil. Dan orang-orang yang bergembira adalah para ahli kitab dari orang-orang Yahudi dan Nasrani, sebab mereka mendapati al-Qur’an sesuai dan membenarkan apa yang ada dalam kitab mereka. وَمِنَ الْأَحْزَابِ مَن يُنكِرُ بَعْضَهُۥ ۚ( dan di antara golongan-golongan (Yahudi dan Nasrani) yang bersekutu, ada yang mengingkari sebahagiannya) Mereka adalah orang-orang musyrik, Yahudi, dan Nasrani; mereka mengingkari kandungan dari al-Qur’an karena ia menasakh (mengganti) syariat mereka. Orang yang bergembira dari mereka condong kepada isi al-Qur’an yang sesuai dengan kitab mereka, dan orang yang mengingkari condong kepada apa yang menyelisihi kitab mereka. قُلْ إِنَّمَآ أُمِرْتُ أَنْ أَعْبُدَ اللهَ وَلَآ أُشْرِكَ بِهِۦٓ (Katakanlah “Sesungguhnya aku hanya diperintah untuk menyembah Allah dan tidak mempersekutukan sesuatupun dengan Dia) Yakni aku hanya diperintah dalam al-Qur’an yang diturunkan kepadaku adalah untuk beribadah dan mentauhidkan Allah. Dan perintah ini sesuai dengan seluruh syariat yang ada, dan seluruh agama yang dibawa oleh para Rasul tidak ada yang mengingkarinya. إِلَيْهِ أَدْعُوا۟ (Hanya kepada-Nya aku seru (manusia)) Yakni hanya kepada Allah semata. وَإِلَيْهِ مَـَٔابِ (dan hanya kepada-Nya aku kembali) Han hanya kepada-Nya semata aku kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36 Orang-orang yang telah Kami berikan kitab kepada mereka seperti Abdullah bin Salam dan para temannya dari golongan mukmin Yahudi. Jumlah mereka sekitar 80 orang yang bergembira dengan kitab Alquran yang telah diturunkan kepadamu, Di antara golongan Yahudi dan Nasrani yang bersekutu dan membantu orang musyrik, seperti Ka’ab bin Asyraf dan para temannya adalah yang mengingkari sebagian Alquran. Yaitu tidak mengimani ayat yang dihapus (naskh) Katakanlah kepada mereka wahai Nabi: “Sesungguhnya aku hanya diperintah untuk menyembah Allah semata, dan tidak mempersekutukan sesuatupun dengan Dia. Hanya kepada-Nya aku mengajak manusia dan hanya kepada-Nya aku kembali”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang telah Kami beri kitab kepada mereka} Taurat dan Injil {bergembira dengan apa yang diturunkan kepadam. Di antara golongan-golongan itu} golongan Yahudi dan Nasrani {ada yang mengingkari sebagiannya. Katakanlah,“Sesungguhnya aku hanya diperintah untuk menyembah Allah dan tidak menyekutukanNya. Hanya kepadaNya aku menyeru manusia dan hanya kepadaNya aku kembali”} aku kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman, “Orang-orang yang telah Kami berikan kitab kepada mereka, “ yang Kami berikan kenikmatan dengannya disertai penguasaan pengetahuan tentangnya, “bergembira dengan kitab lainnya. Demikian ini adalah kondisi orang-orang yang beriman dari kalangan ahli kitab. “dan di antara golongan-golongan (Yahudi dan Nasrani) yang bersekutu ada yang mengingkari sebagiannya,” maksudnya dan di antara golongan orang kafir yang memusuhi kebenaran, ada yang mengingkari sebagian al-Quran dan tidak membenarkannya. Barangsiapa mendapatkan hidayah, maka (manfaat) itu adalah bagi dirinya sendiri. Dan barangsiapa yang tersesat, maka dia menyesatkan dirinya atas hal itu. Engkau, sesungguhnya wahai Muhammad hanyalah seorang pemberi peringatan yang menyeru kepada Allah. “katakanlah, ‘Sesungguhnya aku hanya diperintah untuk menyembah Allah dan tidak mempersekutukan sesuatu pun dengan Dia,” yaitu dengan memurnikan agama bagi Allah semata, “hanya kepadaNya aku menyeru (manusia), dan hanya kepadaNya aku kembali,” tempat kembaliku yang mana aku akan menuju kepadaNya melaluinya, maka, Allah akan membalasku dengan apa yang telah aku kerjakan, berupa dakwah untuk menyeru kepada agamaNya dan melaksanakan perintah-perintahNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ) walladziina aatainaa humul kitaab : “Dan orang-orang yang telah Kami berikan Al-Kitab.” Seperti Abdullah bin Salam dan yang beriman dari kalangan Yahudi. (يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ) yafrahuuna bimaa unzila ilaik : mereka berbahagia dengannya, karena mereka orang-orang yang beriman lagi jujur dan hal itu sama dengan yang mereka miliki. (وَمِنَ ٱلۡأَحۡزَابِ) wa minal ahzaab : dari orang-orang Yahudi dan kaum musyrikin. (مَن يُنكِرُ بَعۡضَهُۥ) may yunkiru ba’dhah : “ada yang mengingkari sebagian darinya.” Yaitu sebagian dari Al-Qur’an, orang-orang musyrik mengingkari lafaz Ar-Rahman, merka berkata, “Tidak ada rahman, kecuali rahmanul yamamah.” Yang mereka maksud adalah Musailamah Al-Kadzab. Makna ayat: Masih membahas penetapan dasar-dasar akidah: tauhid, kenabian, kebangitan, dan pembalasan. Firman-Nya : (وَٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ) “Dan orang-orang yang telah Kami beri Al-Kitab.” Seperti Abdullah bin Salam (يَفۡرَحُونَ بِمَآ أُنزِلَ إِلَيۡكَۖ) “mereka berbahagia dengan apa yang telah diturunkkan kepadamu.” Yaitu Al-Qur’an, dari sini terdapat penegasan dan penetapan atas wahyu, dan firman-Nya : (وَمِنَ ٱلۡأَحۡزَابِ) “dan dari kelompok-kelompok” seperti orang-orang kafir dari Ahlul Kitab dan kaum musyrikin (مَن يُنكِرُ بَعۡضَهُۥۚ) “ada yang menginkari sebagian darinya.” Kaum Yahudi mengingkari sebagian besar Al-Qur’an berupa hukum-hukum dan tidak akan membenarkan kecuali kisah-kisahnya saja, dan kaum musyrikin mengingkari Ar-Rahman, mereka berkata, “Tidak ada rahman kecuali rahmanul yamamah.” Yang mereka maksud Musailamah Al-Kadzab—laknat Allah atasnya. Firman-Nya : (قُلۡ إِنَّمَآ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَآ أُشۡرِكَ بِهِۦٓۚ) Rabbku memerintahkan aku untuk menyembah-Nya dan tidak berbuat syirik, hanya kepada-Nya ta’ala aku mengajak manusia yaitu menuju iman, mengesakan-Nya, dan taat kepada-Nya. (وَإِلَيۡهِ مَ‍َٔابِ) kepada-Nya aku kembali, dan ini adalah penetapan tauhid. Pelajaran dari ayat : • Penegasan akidah wahyu dan kenabian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 36: Yaitu orang-orang Yahudi yang telah masuk agama Islam seperti Abdullah bin salam dan orang-orang Nasrani yang telah memeluk agama Islam. Karena sesuai dengan kitab yang ada pada mereka. Seperti ketika disebutkan Ar Rahman, dan ketika yang disampaikan selain kisah-kisah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 36",
    "description": "Dan ketahuilah, wahai nabi Muhammad, bahwa ada sebagian dari orang yang telah kami berikan kitab kepada mereka (yahudi dan nasrani) yang bergembira dengan apa (Al-Qur'an) yang diturunkan kepadamu, seperti 'abdulla'h bin sala'm, karena kesesuaian antara Al-Qur'an dengan kitab mereka; dan ada pula di antara golongan yang bersekutu, yakni kaum musyrik mekah, yahudi, dan nasrani yang mengingkari sebagiannya. Katakanlah kepada mereka, aku hanya diperintah secara tegas untuk menyembah Allah semata dan tidak mempersekutukan-Nya dengan apa pun. Hanya kepada-Nya aku seru manusia menuju kebenaran, dan hanya kepada-Nya aku kembali untuk bertobat. Dan sebagaimana telah kami turunkan kitab suci kepada kaum yahudi dan nasrani dengan bahasa masing-masing, demikianlah pula kami telah menurunkannya (Al-Qur'an) kepadamu, wahai nabi Muhammad, sebagai peraturan hukum yang kami turunkan dalam bahasa arab. Sekiranya engkau mengikuti keinginan mereka untuk mempersekutukan Allah setelah datang pengetahuan yang benar dan lurus, yakni Al-Qur'an kepadamu, maka tidak akan ada yang dapat melindungi dan menolong engkau dari siksa Allah."
  }
]