[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana kami turunkan kitab-kitab suci kepada para nabi dengan Bahasa mereka, kami turunkan kepadamu -wahai rasul- al-qur’an dengan berbahasa arab, agar kamu menentukan hukum dengannya. Dan jika kamu mengikuti keinginan-keinginan hawa nafsu kaum musyrikin untuk menyembah selain Allah, -setelah kebenaran datang kepadamu dari sisi Allah-, niscaya kamu tidak memiliki penolong yang akan menolongmu dan pelindung yang melindungimu dari siksaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Sebagaimana Kami telah menurunkan kitab-kitab terdahulu dengan menggunakan bahasa mereka, Kami juga menurunkan Al-Qur`ān kepadamu -wahai Rasul- sebagai perkataan yang tegas, menjelaskan kebenaran dengan menggunakan bahasa Arab. Bila kamu -wahai Rasul- mengikuti hawa nafsu ahli kitab yang memintamu menghapus bagian yang tidak sejalan dengan keinginan mereka sesudah kamu menerima ilmu yang Allah sampaikan kepadamu, maka kamu tidak akan memiliki penolong di hadapan Allah yang mengurusi perkaramu, menolongmu atas musuh-musuhmu, kamu tidak mempunyai pelindung yang melindungimu dari azab-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Hai Rasulullah, sebagaimana Kami menurunkan kitab-kitab kepada para rasul dengan bahasa mereka, Kami menurunkan al-Qur’an kepadamu yang banyak mengandung hikmah-hikmah yang benar dan terperinci dengan menggunakan bahasa Arab. Sungguh jika kamu mematuhi ajakan orang-orang musyrik untuk mengikuti hawa nafsu setelah Allah memberimu hujjjah dan bukti-bukti yang jelas, maka tidak ada yang akan dapat menolongmu dari azab Allah. Ini adalah peringatan bagi umatnya, sebab Rasulullah terlindungi dari perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَكَذٰلِكَ أَنزَلْنٰهُ حُكْمًا عَرَبِيًّا ۚ (Dan demikianlah, Kami telah menurunkan Al Quran itu sebagai peraturan (yang benar) dalam bahasa Arab) Kami turunkan al-Qur’an yang mengandung asas-asas dan perincian syariat dengan menggunakan bahasa arab, sebagaimana Kami turunkan kitab-kitab yang lain kepada para rasul dengan bahasa mereka. وَلَئِنِ اتَّبَعْتَ أَهْوَآءَهُم(Dan seandainya kamu mengikuti hawa nafsu mereka) Yang mereka harap agar kamu mengikutinya. بَعْدَمَا جَآءَكَ مِنَ الْعِلْمِ(setelah datang pengetahuan kepadamu) Yang diajarkan Allah kepadamu. مَا لَكَ مِنَ اللهِ مِن وَلِىٍّ(maka sekali-kali tidak ada pelindung terhadap (siksa) Allah) Yang mengatur urusanmu dan menolongmu. وَلَا وَاقٍ(dan tidak ada pemelihara bagimu) Melindungimu dari azab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37 Sebagaimana Kami telah mencakupkan di dalam Alquran berbagai dasar agama, Kami juga telah mencakupkan dalam Al Quran itu berbagai dasar syariat dan percabangannya untuk menyelesaikan permasalahan di antara manusia berupa contoh nyata maupun konsep yang disampaikan dengan hikmah dan adil. Aturan yang teguh yang membedakan antara benar dan salah, yang diturunkan dengan bahasa Arab agar memudahkan mereka dalam memahami dan menghafalkannya. Kami juga menurunkan kitab-kitab kepada para rasul sebelummu dengan bahasa kaum mereka. Dan seandainya kamu mengikuti hawa nafsu mereka setelah pengetahuan ini datang kepadamu, maka sekali-kali tidak ada pelindung dan pemelihara bagimu terhadap siksa Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah Kami telah menurunkannya sebagai hukum} hukum {yang berbahasa Arab. Sungguh jika kamu mengikuti keinginan mereka setelah datang pengetahuan kepadamu, Tidak ada bagimu pelindung} penolong yang menolongmu dan tidak pula pemelihara dari (siksa) Allah (37)} penjaga yang menjaga dari azabNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Sungguh Kami telah menurunkan al-Quran dan al-KItab “sebagai peraturan (yang benar) dalam Bahasa Arab,” maksudnya yang menetapkan hukum dan sempurna dengan ungkapan yang paling jelas dan bahasa yang paling fasih, agar tidak timbul keragu-raguan dan kesamaran serta untuk mendorong agar kitab itu (al-Quran) menjadi satu-satunya kitab yang diikuti, tidak ada unsur penipuan di dalamnya dan tidak mengikuti hal-hal yang bertentangan dan berlawanan dengannya seperti hawa nafsu orang-orang yang tidak berilmu. Oleh karena itu, Allah mengancam RasulNya –meskipun beliau seorang yang ma’shum- untuk mengokohkan beliau dengan menjaganya. Supaya umat Islam meniru beliau dalam hukum-hukum agama. Allah berfirman, “Dan seandainya kamu mengikuti hawa nafsu mereka setelah datang pengetahuan kepadamu,” yang jelas yang melarangmu dari mengikuti hawa nafsu mereka “maka sekali-kali tidak ada pelindung bagimu dari (siksa) Allah,” yang akan memelihara dirimu hingga hal-hal yang menyenangkan terwujud untukmu. “Dan pemelihara,” yang melindungimu dari perkara yang tidak mengenakkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ) wa kadzalika anzalnaahu hukman arabiyyya : dengan bahasa arab agar engkau menegakkan hukumnya di antara mereka. Makna ayat : Firman-Nya : (وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ) Kami menurunkan Al-Qur’an dengan bahasa Arab, agar engkau menegakkan hukum di antara mereka dengannya. Pada penjelasan diatas terdapat penegasan akan wahyu ilahi dan kenabian Muhammad shallahu ‘alaihi wa sallam. Firman-Nya : (وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ) “dan jika engkau mengikuti hawa nafsu mereka setelah datang kepadamu ilmu.” Yaitu dengan menyepakati agama-agama dan kebatilan mereka dalam hal kepercayaan, dan mustahil Rasulullah shallahu ‘alaihi wa sallam melakukannya, adapun ungkapan di atas adalah dalam maksud memperingatkan dan himbauan.(مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ) “engkau tidak memiliki penolong dan penyelamat dari Allah.” Yaitu engkau tidak memiliki penolong selain Allah yang dapat menyelamatkanmu dan menjagamu, tidak pula penghalang yang menghalangimu dari azab Allah jika Dia berkehendak mengazabmu kerena engkau mengikuti orang-orang yang batil dan meninggalkan kebenaran dan para pengikutnya. Pelajaran dari ayat : • Penegasan bahwa ketentuan dan hukum dalam Islam, yang pertama berdasarkan Al-Qur’anul Karim, kemudian As-Sunnah sebagai penjelas terhadap Al-Qur’an, kemudian qiyas yang diperbolehkan berdasarkan ijma’ (kesepakatan) Ulama, karena tidak mungkin mereka bersepakat dalam perkara yang tidak Allah cintai dan ridhai. • Peringatan dari mengikuti para pelaku bid’ah, hawa nafsu, dan agama-agama dan keyakinan yang menyimpang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 37: Di mana hal itu menghendaki engkau memutuskan masalah di antara manusia dengannya. Ada pula yang mengartikan, “hukman ‘arabiyya” dengan kokoh dan rapi dalam bahasa Arab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 37",
    "description": "Dan sebagaimana telah kami turunkan kitab suci kepada kaum yahudi dan nasrani dengan bahasa masing-masing, demikianlah pula kami telah menurunkannya (Al-Qur'an) kepadamu, wahai nabi Muhammad, sebagai peraturan hukum yang kami turunkan dalam bahasa arab. Sekiranya engkau mengikuti keinginan mereka untuk mempersekutukan Allah setelah datang pengetahuan yang benar dan lurus, yakni Al-Qur'an kepadamu, maka tidak akan ada yang dapat melindungi dan menolong engkau dari siksa Allah. Dan jika kaum kafir bertanya mengapa kamu mempunyai istri, maka ketahuilah wahai nabi Muhammad, bahwa sungguh kami telah mengutus beberapa rasul kepada umat-umat sebelum engkau dari golongan manusia, dan kami berikan kepada sebagian dari mereka istri-istri dan keturunan sebagaimana dimiliki oleh manusia lainnya. Jika kaum kafir itu menuntutmu untuk mendatangkan mukjizat yang kasat mata, maka sesungguhnya tidak ada hak bagi seorang rasul pun untuk mendatangkan sesuatu bukti (mukjizat) guna memenuhi tuntutan kaumnya atas kekuatannya sendiri, melainkan dengan izin Allah. Untuk setiap masa ada kitab, yakni mukjizat para nabi dan rasul yang sesuai kondisi dengan masanya."
  }
]