[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka berkata, ”mengapa kamu -wahai rasul-, menikahi wanita-wanita?” maka sesungguhnya kami telah mengutus sebelummu rasul-rasul dari kalangan manusia, dan kami memberikan kepada mereka istri-istri dan anak-anak. Dan apabila mereka berkata, ”seandainya dia benar utusan Allah, pastilah dia akan datang membawa mukjizat-mukjizat yang kami minta. ”Maka bukan pada jangkauan kemampuan seorang rasul untuk mendatangkan mukjizat yang diinginkan kaumnya kecuali dengan izin Allah. Tiap-tiap perkara yang telah diputuskan oleh Allah memiliki catatan dan batas waktu tertentu, yang Allah telah menuliskannya di sisiNya; tidak akan maju dan tidak akan mundur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Sungguh Kami telah mengutus para rasul sebelummu -wahai Rasul- dari kalangan manusia, kamu bukan utusan yang baru. Kami menjadikan istri-istri bagi para Rasul dan anak-anak seperti manusia pada umumnya. Kami tidak menjadikan mereka para malaikat yang tidak menikah dan tidak beranak-pinak. Kamu adalah salah satu dari mereka, sama-sama manusia, menikah dan beranak-pinak. Lalu mengapa orang-orang musyrikin merasa heran dengan hal itu. Seorang Rasul tidak berhak mendatangkan satu mukjizat dari sisi dirinya kecuali bila Allah mengizinkannya. Segala urusan yang Allah tetapkan telah ditulis dalam satu kitab dan memiliki ajal yang tidak maju dan tidak mundur darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Hai Rasulullah, sungguh Kami telah mengutus rasul-rasul secara terus menerus dari golongan manusia sebelummu, dan Kami menciptakan bagi mereka istri-istri dan anak-anak. Dan tidak ada seorangpun yang datang kepada kaumnya dengan membawa mukjizat melainkan dengan izin Allah. Segala urusan memiliki waktu yang telah ditetapkan Allah dan telah Allah tulis dalam kitab yang ada di sisi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَجَعَلْنَا لَهُمْ أَزْوٰجًا وَذُرِّيَّةً ۚ (dan Kami memberikan kepada mereka isteri-isteri dan keturunan) Yakni sesungguhnya para Rasul itu berasal dari golongan manusia, mereka memiliki istri dan memiliki keturunan yang menghasilkan keturunan mereka selanjutnya. Dan Kami tidak mengutus para rasul dari golongan malaikat yang tidak menikah atau memiliki anak. Oleh sebab itu wahai Muhammad, kamu bukanlah rasul yang pertama diutus. Lalu mengapa kalian mengingkari seruan Muhammad padahal seruan itu layaknya seruan para nabi sebelumnya. وَمَا كَانَ لِرَسُولٍ أَن يَأْتِىَ بِـَٔايَةٍ(Dan tidak ada hak bagi seorang Rasul mendatangkan sesuatu ayat (mukjizat)) Dan termasuk hal ini adalah mukjizat yang diusulkan oleh orang-orang kafir. لِكُلِّ أَجَلٍ كِتَابٌ (Bagi tiap-tiap masa ada Kitab (yang tertentu)) Yakni segala urusan yang telah ditentukan Allah telah tertulis dengan waktu terjadinya. Dan kitab ini adalah kitab Lauh mahfudz; sehingga kejadian sesuatu sesuai dengan waktu yang telah ditulis."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Nikah adalah diantara sunnah-sunnah para rasul yang diutus, sebagaimana firman Allah : { وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً } \"Dan sesungguhnya Kami telah mengutus beberapa Rasul sebelum kamu dan Kami memberikan kepada mereka isteri-isteri dan keturunan\" maka beruntunglah mereka yang dikehendaki oleh Allah baginya melaksanakan sunnah yang mulia ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38 Sesungguhnya Kami telah mengutus beberapa Rasul sebelum kamu wahai Nabi, dan Kami memberikan kepada mereka isteri-isteri dan keturunan. Tidak ada hak bagi seorang Rasul untuk mendatangkan suatu ayat/mukjizat melainkan hanya dengan izin Allah. Bagi tiap-tiap masa ada Kitab yang tertentu. Maksud kitab di sini adalah sesuatu yang tertulis, atau mukjizat yang menyesuaikan dengan kondisi zaman rasul yang diutus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah mengutus para rasul sebelummu dan Kami menjadikan untuk mereka istri-istri dan keturunan. Tidak mungkin bagi seorang rasul mendatangkan sesuatu ayat melainkan dengan izin Allah. Untuk setiap masa ada ketentuannya} setiap perkara yang diputuskan oleh Allah ada ketentuan yang telah diputuskan di dalamnya dan waktu terjadinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Maksudnya, engkau bukan seorang rasul pertama yang diutus kepada umat manusia sehingga mereka pantas untuk merasa asing dengan risalahmu. Sungguh “Kami telah mengutus beberapa rasul sebelum kamu, dan Kami memberikan kepada mereka istri-istri dan keturunan,” maka jangan sampai musuh-musuhmu melancarkan celaan pada dirimu lantaran engkau memiliki istri-istri dan keturunan sebagaimana yang terjadi pada saudara-saudaramu, para rasul untuk tujuan mencelamu dengan itu, padahal mereka mengetahui bahwa sesungguhnya para rasul sebelumnya pun sama saja, selain (untuk mewujudkan) kepentingan-kepentingan busuk dan dorongan hawa nafsu mereka saja. Apabila mereka menginginkan suatu ayat (tanda kebenaran) yang mereka usulkan, engkau tidak memiliki hak sedikit pun tentang itu. Tidaklah “ada hak seorang Rasul mendatangkan suatu ayat (mukjizat) melainkan dengan izin Allah,” Allah tidak mengizinkan untuk mendatangkan suatu ayat kecuali pada waktunya yang telah ditentukan dan ditetapkanNya. “Tiap-tiap masa memiliki Kitab (yang tertentu),” tidak maju dan tidak mundur darinya. Tuntutan mereka untuk menyegerakan turunnya ayat-ayat (mukjizat) atau siksa tidak mengharuskan Allah untuk menyegerakan sesuatu yang telah Dia tetapkan agar diakhirkan, meskipun Allah Mahakuasa berbuat apa saja yang diinginkanaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لِكُلِّ أَجَلٖ كِتَابٞ) likulli ajalin kitaab : kitab untuk setiap masa yang tertulis di dalamnya batas waktu tertentu. Makna ayat : Firman-Nya : (وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ) “Sungguh telah Kami utus para rasul sebelummu dan Kami jadikan bagi mereka istri-istri dan keturunan.” Maka tidak ada lagi manfaat perkataan orang-orang yang batil, “Kenapa Muhammad memiliki istri-istri?, kenapa dia mempunyai keturunan? Sedangkan dia mengaku bahwa dia adalah nabi dan rasul?!” karena para rasul sebelum kalian: Nuh, Ibrahim, Musa, Daud, Sulaiman, dan semuanya mereka memiliki istri-istri dan keturunan. Dan ketika mereka berkata “Mengapa tidak diturunkan kepadanya sebuah ayat?” Allah ta’ala membantah mereka dengan firman-Nya : (وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِ‍َٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ) “tidaklah seorang rasul mampu mendatangkan suatu mukjizat kecuali atas izin Allah.” Oleh karena itu, seluruh rasul mereka berada dibawah kekuasaan dan aturan Allah, mereka tidak memiliki sesuatu pun yang Allah miliki, Dialah Yang Maha Menguasai dan Maha Mengatur, jika berkehendak, Dia akan memberi mereka, dan jika berkehendak Dia akan menghalanginya. Firman-Nya : (لِكُلِّ أَجَلٖ كِتَابٞ ) yaitu setiap waktu memiliki batas Allah ta’ala memberi dan menghalangi, ketentuan tertulis disana ajal, dan telah diatur maka tidak akan ada kekacauan. Pelajaran dari ayat : • Penetapan akidah qadha dan qadar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 38: Yakni kamu (Muhammad shallallahu 'alaihi wa sallam) bukanlah rasul yang pertama kali diutus kepada manusia sehingga mereka mengganggap aneh terhadap kerasulanmu. Allah Subhaanahu wa Ta'aala mengutus Nabi-Nya Muhammad shallallahu 'alaihi wa sallam sebagai rasul dari kalangan manusia, sebagaimana Dia telah mengutus sebelum Beliau para rasul dari kalangan manusia yang butuh makan, minum, berjalan di pasar, mendatangi istri, memiliki anak dsb. Karena rasul itu hamba yang diatur. Allah Subhaanahu wa Ta'aala juga tidak mengizinkan kecuali pada waktu yang ditetapkan-Nya. Yang tidak maju dan tidak mundur. Ada yang mengartikan, bahwa bagi setiap rasul ada kitabnya yang sesuai dengan keadaan masanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 38",
    "description": "Dan jika kaum kafir bertanya mengapa kamu mempunyai istri, maka ketahuilah wahai nabi Muhammad, bahwa sungguh kami telah mengutus beberapa rasul kepada umat-umat sebelum engkau dari golongan manusia, dan kami berikan kepada sebagian dari mereka istri-istri dan keturunan sebagaimana dimiliki oleh manusia lainnya. Jika kaum kafir itu menuntutmu untuk mendatangkan mukjizat yang kasat mata, maka sesungguhnya tidak ada hak bagi seorang rasul pun untuk mendatangkan sesuatu bukti (mukjizat) guna memenuhi tuntutan kaumnya atas kekuatannya sendiri, melainkan dengan izin Allah. Untuk setiap masa ada kitab, yakni mukjizat para nabi dan rasul yang sesuai kondisi dengan masanya. Allah yang mahabijaksana menghapus hukum yang layak untuk dihapus, dan menetapkan apa (hukum) yang dia kehendaki untuk ditetapkan. Allah melakukan hal itu sesuai dengan hikmah dan kebijaksanaan yang dimiliki-Nya. Dan di sisi-Nya terdapat ummul-kitab, yakni lauh mahfudh."
  }
]