[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menghapus hukum-hukum dan ketetapan lainnya yang Dia kehendaki, dan mempertahankan dari perkara-perkara itu apa yang dikehendakiNya, sesuai dengan hikmah yang diketahuiNya. Dan di sisiNya terdapat kitab, yaitu lauhil mahfuzh. Yang ditetapkan di sana segala keaadan makhluk sampai hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Allah menghapus apa yang Dia kehendaki untuk dihapus berupa kebaikan atau keburukan, kebahagiaan atau kesengsaraan atau selainnya. Allah menetapkan apa yang Allah kehendaki untuk Dia tetapkan. Di sisi-Nya Lauḥul Maḥfuẓ yang merupakan induk dari segala urusan, apa yang nampak berupa penghapusan atau penetapan sejalan dengan apa yang tertulis di sana."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Allah menghapus suatu hukum dan menetepkannya sesuai kehendak-Nya dengan dasar hikmah dan kemaslahatan. Dan di sisi-Nya induk dari segala kitab yaitu lauhul mahfudz."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. يَمْحُوا۟ اللهُ مَا يَشَآءُ وَيُثْبِتُ ۖ (Allah menghapuskan apa yang Dia kehendaki dan menetapkan) Yang tercantum dalam kitab tersebut. Allah menghapus apa yang Dia kehendaki seperti kemelaratan, kebahagiaan, rezeki, umur, kebaikan, atau keburukan, Allah dapat mengganti yang satu dengan yang lainnya. Dan menempatkan yang satu ditempat lainnya. وَعِندَهُۥٓ أُمُّ الْكِتٰبِ(dan di sisi-Nya-lah terdapat Ummul-Kitab (Lauh mahfuzh) Terdapat pendapat mengatakan bahwa penghapusan dan penetapan ini pada kitab yang ada di tangan para malaikat, adapun kitab Lauhul mahfudz tidak dihapus atau dirubah sama sekali, tidak ada pergantian yang satu dengan yang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39 Terkadang Allah menghapuskan hukum-hukum yang Dia kehendaki dan Dia juga menetapkan hukum yang Dia kehendaki dengan disertai hikmah dan manfaat yang disesuaikan dengan zaman. Di sisi-Nya lah terdapat Ummul-Kitab yaitu Lauh mahfuzh yang tidak ada ganti dan perubahannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah menghapus} menghilangkan {dan menetapkan apa yang Dia kehendaki} menyisakan apa yang Dia kehendaki {dan di sisiNya terdapat Ummul-Kitāb} asal dari kitab, yaitu Lauhil Mahfuz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “Allah menghapuskan apa yang Dia kehendaki,” dari takdir-takdirNya “dan menetapkan,” apa yang dikehendakiNya dari yang sudah ditetapkan. Penghapusan dan perubahan ini bukan pada hal-hal yang mana ilmu Allah telah mendahului (bahwa akan terjadi dan Pena Allah telah menuliskan takdirnya). Sesungguhnya, hal itu tidak mengalami perubahan dan pergantian. Karena, menjadi suatu perkara yang mustahil bagi Allah jika terjadi suatu kekurangan dan kekeliruan pada ilmu Allah (tentang segala sesuatu yang akan terjadi). Oleh karena itu, Allah berfirman “dan di sisiNya terdapat Ummul KItab,” yaitu Lauh Mahfuzh yang menjadi buku rujukan bagi segala sesuatu. Itu adalah intinya, ia mempunyai cabang dan sisi. Misalnya, amalan pagi dan siang hari yang dicatat oleh malaikat, dan Allah menciptakan sebab kausalitas yang bisa menetapkannya dan sebab-sebab yang bisa menghapuskannya. Sebab-sebab tersebut tidak akan melampaui batas dengan apa yang telah di gariskan di Lauh Mahfuzh. Sebagaimana Allah menjadikan kebaikan, silaturahim, dan perbuatan baik sebagai sebab kausalitas yang bisa memanjangkan usia dan meluaskan rizki. Sebagaimana Allah menjadikan maksiat-maksiat sebagai sebab yang menghilangkan berkah rizki dan usia. Sebagaimana Allah menetapkan beberapa sebab kausalitas keselamatan dari berbagai kebinasaan dan kehancuran sebagai jalan menuju keselamatan, dan menjadikan sebab kausalitas penghalang keselamatan sebagai penyebab kehancuran. Dia-lah yang mengatur segala urusan sesuai dengan kekuasaan dan kehendakNya. Hal-hal yang Allah atur tidak bertentangan dengan apa yang sudah diketahui Allah (akan terjadi) dan dituliskan di Lauh Mahfuzh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ) yamhullahu maa yasyaa’ : “Allah menghapus apa yang Dia kehendaki.” Yaitu menghapus hukum-hukum dan selainnya sesuai dengan kehendak-Nya, apa yang Dia hapuskan maka itu adalah mansukh (dihapus hukumnya) dan yang Dia tetapkan adalah muhkam. Makna ayat : Firman-Nya : (يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ) “Allah menghapus apa yang Dia kehendaki, dan menetapkan apa yang Dia kehendaki, dan milik-Nya lah Ummul Kitab.” Ayat ini adalah bantahan atas perkataan mereka, “Mengapa Dia menetapkan sesuatu, lalu menghapusnya lagi?” seperti diubahnya kiblat dari Baitul Maqdis menuju Ka’bah dan masa iddah dari satu tahun menjadi empat bulan sepuluh hari? Maka Dia menegaskan bahwa Allah ta’ala memiliki kekuasaan dan kehendak yang akan bisa dikalahkan oleh kekuasaan dan kehendak manusia, Dia menghapus yang apa yang Dia kehendaki berupa syariat dan hukum, tergantung kepada kebutuhan hamba-hamba-Nya, dan begitu juga menetapkan hal yang baik dan bermanfaat bagi mereka, (وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ) “dan milik-Nya lah Ummul Kitab.” Yaitu kitab yang mencakup segala takdir, tidak dapat diubah dan diganti, seperti kematian, kehidupan, kebahadiaan, dan kesengsaraan. Dalam hadits “Pena-pena telah diangkat, dan kertas-kertas sudah kering.” Diriwayatkan oleh Muslim. Pelajaran dari ayat : • Penjelasan bahwa naskh (penghapusan) hukum-hukum berdasarkan kitab (Al-Qur’an) dan sunnah (Al-Hadits)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 39: Allah Subhaanahu wa Ta'aala menghapus taqdir-Nya dan menetapkan sesuai yang Dia kehendaki. Perubahan ini bukanlah pada taqdir yang terdahulu yang telah didahului ilmu-Nya dan dicatat oleh pena-Nya, karena taqdir ini sudah tidak dapat dirubah lagi, yang demikian karena jika masih dirubah sama saja terjadi kekurangan dalam ilmu-Nya. Syaikh As Sa’di berkata, “Yakni Lauh Mahfuzh, di mana semua perkara kembali kepadanya, ia merupakan pokoknya, sedangkan perkara-perkara itu cabang dan rantingnya. Perubahan hanyalah terjadi pada cabang dan ranting, seperti halnya amalan yang dilakukan pada siang dan malam hari yang dicatat oleh malaikat. Allah mengadakan sebab-sebab untuk tetapnya dan mengadakan sebab-sebab untuk terhapusnya, dan sebab-sebab itu tidak melewati apa yang tertulis dalam Lauh Mahfuzh, sebagaimana Allah menjadikan birrul walidain, silaturrahim dan ihsan termasuk sebab panjang umur dan luasnya rezeki, dan sebagaimana Dia menjadikan maksiat sebagai sebab tercabutnya keberkahan rezeki dan umur, dan sebagaimana Dia menjadikan sebab-sebab selamat dari kebinasaan sebagai sebab untuk keselamatan, dan menjadikan coba-coba kepadanya sebagai sebab untuk binasa. Dialah yang mengatur urusan sesuai kemampuan dan iradah-Nya, dan apa yang diatur-Nya tidaklah menyalahi apa yang telah diketahui-Nya dan ditulis-Nya dalam Lauh Mahfuzh.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 39",
    "description": "Allah yang mahabijaksana menghapus hukum yang layak untuk dihapus, dan menetapkan apa (hukum) yang dia kehendaki untuk ditetapkan. Allah melakukan hal itu sesuai dengan hikmah dan kebijaksanaan yang dimiliki-Nya. Dan di sisi-Nya terdapat ummul-kitab, yakni lauh mahfudh. Kami'Allah'mahakuasa menetapkan atau menghapus hukum yang kami kehendaki sesuai kebijaksanaan kami. Dan sungguh, jika kami perlihatkan kepadamu, wahai nabi Muhammad, di dunia ini sebagian dari siksaan dan balasan yang kami ancamkan kepada mereka (orang kafir) sebagaimana permintaan mereka, atau kami wafatkan engkau sebelum menyaksikan siksaan itu datang kepada mereka'namun mereka pasti akan merasakannya'maka sesungguhnya tugasmu hanya menyampaikan saja dakwah dan risalah yang kami titipkan kepadamu, dan kamilah yang akan memperhitungkan amal mereka serta balasan yang akan mereka terima atasnya."
  }
]