[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di bumi terdapat bagian-bagian yang sebagian bersebelahan dengan sebagian yang lain. Sebagian darinya merupakan tanah yang baik yang dapat menumbuhkan tanam-tanaman yang bermanfaat bagi manusia, dan sebagian (lagi) bergaram lagi asin tidak dapat menumbuhkan apapun. Dan pada bagian tanah yang baik terdapat kebun-kebun anggur, dan menjadikan padanya tanaman-tanaman yang beraneka ragam, pohon kurma yang berkelompok pada satu lokasi tanam, dan ada yang tidak berkelompok pada satu tempat. Semua itu (tumbuh) pada satu tanah yang sama dan menyerap air yang sama, akan tetapi bermacam-macam dalam hasil buah-buahan, bentuk, cita rasa dan aspek lainnya. Ini manis, sedang yang itu masam, sebagian lebih utama daripada sebagian yang lain untuk dikonsumsi. Sesungguhnya pada yang demikian ini terdapat tanda-tanda nyata bagi orang-orang yang memiliki hati yang memahami perintah dan larangan dari Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Di bumi ada bagian-bagian yang berdampingan; di sana ada kebun-kebun anggur, tanaman pokok, pohon-pohon kurma yang bercabang dan pohon-pohon kurma yang tidak bercabang. Kebun-kebun dan tanaman-tanaman pokok tersebut disiram dengan air yang sama namun Kami membedakan sebagiannya dari sebagian lainnya dalam rasa dan faedah-faedah lainnya, padahal semuanya bersebelahan dan disiram dengan air yang sama. Sesungguhnya pada yang demikian itu terdapat bukti-bukti dan tanda-tanda bagi kaum yang berakal, karena mereka adalah orang-orang yang mengambil faedah darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dengan penciptaan-Nya yang menakjubkan dan kemurahan-Nya yang besar, Allah menjadikan di bumi bagian-bagian tanah yang saling berdekatan dan bersambung, namun tekstur, air, dan buah-buahannya berbeda-beda; dan kebun-kebunnya memiliki berbagai macam jenis anggur, biji-bijian, dan kurma. Di antara pohon-pohon kurma itu ada yang tumbuh dengan dua cabang atau lebih dari satu batang, dan ada yang tumbuh hanya dengan satu cabang. Dan berbagai buah-buahan dan tanaman yang memiliki rasa dan warna yang berbeda-beda ini berasal dari siraman air yang sama, sebagiannya lebih baik kualitas, rasa, dan manfaatnya daripada yang lain. Sungguh dalam hal yang agung dari Tuhan ini terdapat bukti-bukti yang jelas dan benar bagi orang yang mau mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَفِى الْأَرْضِ قِطَعٌ مُّتَجٰوِرٰتٌ (Dan di bumi ini terdapat bagian-bagian yang berdampingan) Yakni saling berdekatan tapi dengan tanah dan air yang sama, dan meski begitu tanah itu menumbuhkan buah-buahan dengan jenis yang berbeda-beda. وَجَنّٰتٌ مِّنْ أَعْنٰبٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ(dan kebun-kebun anggur, tanaman-tanaman dan pohon korma yang bercabang dan yang tidak bercabang) Yakni jenis-jenis yang serupa dan tidak serupa. يُسْقَىٰ بِمَآءٍ وٰحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِى الْأُكُلِ ۚ (disirami dengan air yang sama. Kami melebihkan sebahagian tanam-tanaman itu atas sebahagian yang lain tentang rasanya) Dalam jenis buah-buahan atau bagian-bagian yang dapat dimakan dari suatu pohon, sebagiannya berasa manis dan sebagian lainnya berasa masam, sebagiannya berkualitas tinggi dan sebagian lainnya berkualitas rendah, sebagiannya sangat bagus dan sebagian lainnya kurang bagus. Hal ini memastikan bagi orang-orang yang berfikir dengan akal sehat bahwa ini semua merupakan ciptaan Allah Yang Maha Bijaksana dan Maha Mengetahui; karena tanaman-tanaman ini tumbuh di tempat yang sama, di tanah yang berdekatan, dan dengan siraman air yang sama, dan tidak ada factor yang menjadikan buah-buahannya sama kecuali oleh kekuasaan Allah yang Maha Besar. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَعْقِلُونَ (Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berfikir) Yang tidak lalai dalam bertafakkur dalam ciptaan Allah dan mengambil pelajaran dari makhluk-makhluk-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Satu pelajaran bagi siapapun yang mengamati... Lihatlah bumi yang terbagi menjadi bagian-bagian yang saling berdampingan, dan bagaimana air turun kepadanya dari satu sumber yang sama, sehingga tumbuhlah berbagai jenis tumbuhan, warnanya yang masing-masing memiliki keelokannya tersendiri dan bentuknya yang begitu menakjubkan serta rasa yang menjadi ciri khas dari masing-masing tumbuhan itu, Maha besar Allah atas segala kekuasannya. { يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ } \"disirami dengan air yang sama. Kami melebihkan sebahagian tanam-tanaman itu atas sebahagian yang lain tentang rasanya. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berfikir\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Di bumi itu terdapat titik-titik dan bagian-bagian yang saling berdampingan namun memiliki tumbuhan-tumbuhan, pertanian, tingkat kesuburan, dan ragam tanah yang berbeda-beda. Di dalamnya juga ada kebun-kebun anggur, tanaman-tanaman, dan pohon-pohon kurma yang kami kumpulkan dari satu jenis pohon, lalu bercabang-cabang, atau membentuk klasifikasi yang serupa dan tidak serupa. Dan masing-masing tanaman dan pohon itu disiram dengan satu jenis air. Dan terdapat buah-buahan yang dimakan itu unggul dalam bentuk, rasa, warna, aroma, ukuran dan beratnya. Sesungguhnya dalam sesuatu yang disebutkan itu terdapat dalil-dalil yang menunjukkan kepada kekuasaan Allah bagi kaum yang berpikir tentang keagungan sang Pencipta sehingga mereka beriman kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di bumi terdapat bagian-bagian} tempat-tempat {yang berdampingan } saling berdekatan {kebun-kebun} kebun-kebun {anggur, tanaman-tanaman, dan pohon kurma yang bercabang} pohon kurma yang berkumpul pada satu pangkal {dan yang tidak bercabang} pohon kurma yang pangkalnya salng terpisah {(Semua) disirami dengan air yang sama, Kami melebihkan sebagian atas yang lainnya dalam hal rasanya} dalam ukuran dan rasanya {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan,” di antara tanda kebesaran Allah yang menunjukkan kesempurnaan kekuasaan dan keistimewaan ciptaanNya, Dia menjadikan “di bumi ini bagian-bagian yang berdampingan dan kebun-kebun,” di dalamnya terdapat berbagai macam pepohonan, berupa pohon anggur, kurma, biji-bijian dan lain-lain. Ada pohon kurma yang sebagiannya “bercabang-cabang,” artinya beberapa batang pohon berada di atas satu pongkol tanaman “yang tidak bercabang-cabang,” maksudnya setiap pohon berada pada pongkolnya masing-masing. Semuanya “disirami dengan air yang sama,” dan tanahnya pun sejenis. “Kami melebihkan sebagian tanaman itu di atas sebagian tanaman yang lain tentang rasanya,” dalam aspek warna, cita rasa, manfaat, dan tingkat kelezatn. Ada jenis tanh yang baik (subur), bisa menumbuhkan ilalang dan rerumputan yang banyak, bermacam pohon dan tanaman. Ada tanah yang berada di dekat tanah tadi, (namun) tidak bisa menumbuhkan tanaman ataupun menyimpan cadangan air. Ada tanah yang mampu menyimpan suplai air, namun tidak mampu menumbuhkan ilalang. Ada tanah yang lain mampu menumbuhkan tanaman biji-bijian dan berbagai pepohonan, namun tidak menumbuhkan rumput ilalang. Buah ini begitu manis, sementara buah itu pahit. Dan buah yang lain rasanya sedang-sedang saja. Apakah keanekaragaman ini muncul dari Dzatnya itu sendiri dan karakteristisknya, ataukah merupakan ketentuan dari al-Aziz aar-Rahim (Dzat Yang Mahaperkasa lagi Maha Penyayang)? “Seungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berpikir,” maksudnya bagi orang-orang yang mempunyai akal pikiran yang mengantarkan mereka menuju hal-hal yang bermanfaat bagi mereka dan mengajak mereka kepada kematangan hidayah dan berpikir tentang Allah, berupa pesan-pesan, perintah-perintah dan larangan-laranganNya. Adapun orang-orang yang kerap berpaling dan orang-orang yang berpikiran tumpul, maka mereka berada dalam kubangan kegelapan tanpa mengetahui apa-apa, berjalan mondar-mansir dalam kesesatan mereka, tidak mendapatkan jalan petunjuk kepada Rabb mereka, dan tidak memahami ucapan-ucapanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (قِطَعٞ مُّتَجَٰوِرَٰتٞ) qithaum mutaawiraat : tempat yang saling menempel. (وَنَخِيلٞ صِنۡوَانٞ) wa nakhiilun shinwaan : jenis kurma yang bermacam-macam dari sumber yang satu. Ash-Shinw bentuk tunggal dari ash-shinwaan. (فِي ٱلۡأُكُلِۚ) fil ukul : rasanya, ada yang manis, pahit, dan asam, ada pula yang enak dan tidak. Makna ayat : Firman-Nya : (وَفِي ٱلۡأَرۡضِ قِطَعٞ مُّتَجَٰوِرَٰتٞ) sebagian tempat di bumi yang saling menempel satu sama lain, namun yang ini tanahnya baik, yang ini buruk tandus. Di sana juga ada (وَجَنَّٰتٞ) kebun-kebun anggur, persawahan, dan kurma (صِنۡوَانٞ) dua jenis kurma, atau tiga dalam satu pohon yang sama, (وَغَيۡرُ صِنۡوَانٖ) dan kurma yang hanya satu jenis, firman-Nya : (يُسۡقَىٰ) anggur, persawahan, dan kurma tersebut diairi (بِمَآءٖ وَٰحِدٖ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضٖ فِي ٱلۡأُكُلِۚ) dengan air yang sama, dan Kami jadikan sebagian lebih baik dari yang lain dalam hal rasa, ada yang manis, asam, yang ini enak dan yang ini tidak. Firman-Nya : (إِنَّ فِي ذَٰلِكَ) semua yang disebutkan, tanah yang berjejeran namun berbeda kualitasnya, kebun-kebun anggur dan kurma disiram dengan air yang sama, dan perbedaan rasa, wangi, dan khasiatnya (لَأٓيَٰتٖ) adalah merupakan tanda-tanda yang jelas akan wajibnya beriman kepada Allah dan mentauhidkan-Nya, serta meyakini akan pertemuan dengan-Nya, namun (لِّقَوۡمٖ يَعۡقِلُونَ) tanda-tanda ini hanya untuk orang-orang yang berakal, adapun mereka yang kehilangan akal mereka, karena dikuasai oleh materialisme dan merajalelanya syahwat pada dirinya, mereka tidak mengetahui dan tidak pula memahaminya sama sekali. Maka bagaimana mereka melihat tanda-tanda keberadaan Allah, ilmu, kekuasaan, dan hikmah-Nya, sehingga mereka bisa beriman, menyembah, dan mendekatkan diri kepada-Nya. Pelajaran dari ayat : • Kegunaan akal untuk mencari petunjuk akan kebenaran dan mengikutinya, untuk meraih kebahagiaan dan kesempurnaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 4: Di antaranya ada tanah yang yang menumbuhkan rerumputan, pohon-pohon, dan tanaman-tanaman. Ada pula tanah yang tidak menumbuhkan rerumputan dan tidak menahan air. Ada pula tanah yang menahan air, namun tidak menumbuhkan rerumputan, dan ada pula tanah yang menumbuhkan tanaman dan pohon-pohon, namun tidak menumbuhkan rerumputan. Demikian pula warna, manfaat, dan kelezatannya. Kemudian, apakah bermacam-macam ini dengan sendirinya ataukah dengan pengaturan dari Yang Mahaperkasa lagi Mahabijaksana?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 4",
    "description": "Dan di bumi yang terhampar dengan gunung-gunung yang tegak berdiri dan sungai-sungai yang berkelok-kelok dan bermuara ke laut, terdapat bagian-bagian tanah yang berdampingan dengan jarak yang berbeda serta kualitas kesuburan yang berbeda pula. Ada bagian tanah yang baik menjadi kebun-kebun anggur, ada yang cocok ditanami tanaman-tanaman tertentu, dan ada pula yang cocok ditanami pohon kurma yang bercabang dan yang tidak bercabang. Bagian-bagian tanah yang ditanami itu disirami dengan air yang sama. Tanaman-tanaman itu tumbuh, berkembang, lalu mengeluarkan bunga dan buah yang jenisnya beragam. Meski demikian, kami lebihkan tanaman yang satu dari yang lainnya, baik dalam hal rasa, warna, ukuran, maupun bobot-Nya. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau mengerti. Semua itu dengan sangat jelas membuktikan keesaan Allah. Dan sebab itu, jika ada sesuatu yang engkau patut merasa heran, maka yang mengherankan adalah ucapan mereka, apa-kah benar, bila kami telah meninggal, dikubur, dan kemudian menjadi tanah, apakah kami kelak akan dikembalikan atau dibangkitkan menjadi makhluk yang baru lagi' mereka yang berkata seperti itulah orang-orang yang ingkar kepada tuhannya. Mereka mengingkari keesaan Allah dan kepastian datangnya hari kiamat, dan mereka itulah orang-orang yang akan dilekatkan belenggu di lehernya. Mereka adalah para penghuni neraka, dan mereka kekal di dalamnya untuk waktu yang sangat lama."
  }
]