[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila kami memperlihatkan padamu -wahai rasul-, sebagian hukuman yang kami ancamkan kepada musuh-musuhmu, berupa kehinaan dan siksaan di dunia, maka itulah balasan bagi mereka yang disegerakan. Dan bila kami mewafatkanmu sebelum kamu menyaksikannya, maka tugasmu tiada lain hanyalah menyampaikan dakwah saja, dan kewajiban Kami lah urusan perhitungan amal dan memberikan balasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Jika Kami menunjukkan kepadamu -wahai Rasul ṣallallāhu 'alaihi wa sallam- sebagian dari apa yang Kami ancamkan kepada mereka sebelum kamu mati, maka hal tersebut berpulang kepada Kami, atau Kami mematikanmu sebelum Kami memperlihatkan hal itu. Tugasmu hanya menyampaikan apa yang wajib kamu sampaikan, kamu tidak berwenang untuk menghisab dan membalas mereka, karena keduanya adalah urusan Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Hai Rasulullah, sama saja apakah Kami menunjukkan kepadamu sebagian azab yang Kami janjikan kepada mereka berupa terbunuh, tertawan, atau tertindas di dunia; atau Kami mewafatkanmu sebelum mengazab mereka; sebab tugasmu hanyalah menyampaikan dakwah di dunia, sedangkan Kami yang akan memberi azab atau pahala di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَإِن مَّا نُرِيَنَّكَ بَعْضَ الَّذِى نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ (Dan jika Kami perlihatkan kepadamu sebahagian (siksa) yang Kami ancamkan kepada mereka atau Kami wafatkan kamu) Yakni Kami tunjukkan kepada kamu sebelum kematianmu sebagian azab yang Kami siapkan bagi mereka, atau Kami akan mewafatkanmu sebelum kamu melihatnya. فَإِنَّمَا عَلَيْكَ الْبَلٰغُ(karena sesungguhnya tugasmu hanya menyampaikan saja) Tidak ada kewajiban atasmu kecuali menyampaikan hukum-hukum yang ada dalam risalah ini. وَعَلَيْنَا الْحِسَابُ(sedang Kami-lah yang menghisab amalan mereka) Yakni menghisab amal perbuatan mereka dan membalasnya. Dan kamu tidak dibebani agar mereka beriman atau disiksa semasa kamu masih hidup."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40 Jika Kami perlihatkan kepadamu beberapa siksa yang Kami ancamkan kepada mereka dalam hidupmu, atau Kami wafatkan kamu maka hal itu tidak penting bagimu, karena sesungguhnya tugasmu hanya menyampaikan risalah saja, sedang Kami-lah yang akan menghisab dan membalas amalan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya jika Kami memperlihatkan kepadamu sebagian yang Kami janjikan kepada mereka atau Kami wafatkan kamu, sesungguhnya kamu hanyalah sebagai penyampai dan Kamilah yang menghisab} memberi balasan pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah berfirman kepada nabiNya, “Janganlah engkau bersegera menimpakan apa yang telah diancamkan kepada mereka yang berbentuk siksaan. Mereka bila melampaui batas dan kufur secara terus menerus, maka pasti akan dilanda azab yang diancamkan kepada mereka, baik Kami akan memperlihatkannya kepadamu agar pandanganmu menjadi sejuk dengannya, atau mewafatkanmu sebelum menimpakan (siksaan) mereka, maka itu bukanlah urusan yang merepotkanmu. “Karena sesungguhnya tugasmu hanya menyampaikan saja,” dan menjelaskan kepada manusia “sedang Kami-lah yang menghisab amalan mereka,” Kami akan memperhitungkan amalan makhluk-makhluk berdasarkan apa yang telah mereka perbuat dan kewajiban yang mereka sepelekan serta Kami akan memberi pahala atau menghukumi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نَعِدُهُمۡ) na’iduhum : “Kami janjikan kepada mereka” berupa azab. (أَوۡ نَتَوَفَّيَنَّكَ) aw natawaffayannak : “atau Kami mewafatkanmu” yaitu sebelum turunnya azab tersebut. Makna ayat : Makna ayat : Firman-Nya : (وَإِن مَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ) Seandainya Aku perlihatkan kepadamu sebagian dari apa yang Aku janjikan kepada kaummu berupa azab, atau pun jika Aku mewafatkanmu sebelum hal itu terjadi, maka tidak ada kewajiban bagimu kecuali untuk menyampaikan, engkau telah menyampaikan dan perhitungannya adalah urusan Kami, dan Kami akan membalas apa yang telah mereka kerjakan. Janganlah bersedih hati wahai Rasul dan jangan pula engkau berkecil hati karena makar mereka. Pelajaran dari ayat : • Kemenangan Islam dan penyebarannya selama empat abad, adalah tanda terbesar atas kebenarannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 40: Allah Subhaanahu wa Ta'aala berfirman kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam memerintahkan Beliau agar Beliau tidak tergesa-gesa meminta disegerakan azab yang diancamkan. Yang demikian karena kalau pun mereka tetap di atas kekufuran dan keangkuhan, mereka tetap akan mendapatkan azab yang diancamkan itu. Di saat engkau masih hidup sehingga dirimu lega. Sebelum mengazab mereka. Apabila mereka telah kembali kepada Kami, lalu Kami berikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 40",
    "description": "Kami'Allah'mahakuasa menetapkan atau menghapus hukum yang kami kehendaki sesuai kebijaksanaan kami. Dan sungguh, jika kami perlihatkan kepadamu, wahai nabi Muhammad, di dunia ini sebagian dari siksaan dan balasan yang kami ancamkan kepada mereka (orang kafir) sebagaimana permintaan mereka, atau kami wafatkan engkau sebelum menyaksikan siksaan itu datang kepada mereka'namun mereka pasti akan merasakannya'maka sesungguhnya tugasmu hanya menyampaikan saja dakwah dan risalah yang kami titipkan kepadamu, dan kamilah yang akan memperhitungkan amal mereka serta balasan yang akan mereka terima atasnya. Di antara bukti-bukti Allah melaksanakan ancaman-Nya adalah peristiwa yang dialami oleh orang-orang kafir tersebut. Dan apakah mereka orang-orang kafir itu tidak melihat bahwa kami melalui hambahamba kami yang berjihad, mendatangi dan menaklukkan daerahdaerah yang dikuasai orang yang ingkar kepada Allah, lalu kami kurangi daerah-daerah yang dikuasai itu sedikit demi sedikit dari tepi-tepinya' dan Allah menetapkan hukum menurut kehendak-Nya. Tidak ada kekuatan apa pun yang dapat menolak ketetapan-Nya bila Allah sudah menetapkannya; dia mahacepat lagi mahabijaksana perhitungan-Nya."
  }
]