[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir itu tidak melihat bahwa sesungguhnya Kami mendatangi daerah-daerah dibumi dan menguranginya dari sisi-sisinya, yaitu dengan cara kaum muslimin menaklukan negeri-negeri kaum musyrikin dan memasukannya menjadi negeri kaum muslimin. Dan Allah menetapkan hukum, tidak ada yang dapat menolak ketetapanNya dan keputusanNya. Dan Dia mahacepat perhitunganNya, maka janganlah mereka meminta agar siksaan ditimpakan pada mereka dengan segera, sebab setiap yang akan tiba itu dekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Apakah orang-orang kafir itu tidak menyaksikan bahwa Kami mendatangi bumi orang-orang kafir, lalu Kami menguranginya sedikit demi sedikit dengan menyebarkan Islam dan penaklukan oleh kaum Muslimin terhadapnya. Allah menetapkan hukum dan keputusan sesuai dengan kehendak-Nya di antara hamba-hamba-Nya, tidak ada yang mengoreksi hukum Allah dengan membatalkan atau merubah atau menggantinya. Allah Mahacepat hisab-Nya, menghisab orang-orang terdahulu dan orang-orang yang datang kemudian hanya dalam sehari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Allah mengingkari dan mengolok orang-orang kafir karena mereka tidak pernah mengambil pelajaran dari suatu kejadian: “Apakah orang-orang kafir itu tidak mengetahui bahwa Kami mengurangi sisi-sisi tanah yang mereka tinggali dengan menenggelamkan, membakar, atau membiarkannya dikuasai orang lain atau ditakhlukkan orang-orang beriman demi tersebarnya dakwah kepada Allah dan terhentinya kerusakan? Allah memberi ketetapan sesuai kehendak-Nya, tidak ada yang dapat mencegah ketetapan-Nya; dan Dia sangat cepat perhitungannya dalam memberi pahala atau siksaan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. أَوَلَمْ يَرَوْا۟ (Dan apakah mereka tidak melihat) Yakni para penduduk Makkah. أَنَّا نَأْتِى الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا ۚ (bahwa sesungguhnya Kami mendatangi daerah-daerah (orang-orang kafir), lalu Kami kurangi daerah-daerah itu (sedikit demi sedikit) dari tepi-tepinya?) Yakni Kami mendatangi negeri orang-orang kafir dari tepi-tepinya dengan penakhlukkan kaum muslimin terhadap negeri-negeri tersebut sedikit demi sedikit sampai selesai urusan ini dengan ditakhlukkannya kota Makkah. وَاللهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِۦ ۚ( Dan Allah menetapkan hukum (menurut kehendak-Nya), tidak ada yang dapat menolak ketetapan-Nya) Yakni Allah menentukan ketetapan yang Dia kehendaki bagi makhluk-Nya; Dia meninggikan derajat yang satu dan menghinakan yang lain, menghidupkan seseorang dan mematikan yang lainnya. Dan Allah telah menetapkan kemuliaan agama Islam diatas agama-agama yang lain. Tidak ada orang yang dapat menolak ketetapan Allah dengan membatalkannya atau mengubahnya. وَهُوَ سَرِيعُ الْحِسَابِ (dan Dialah Yang Maha cepat hisab-Nya) Dia memberi balasan bagi orang baik dan orang Jahat dengan cepat, perhitungan terhadap mereka tidak akan membuatnya letih, dan perhitungan-Nya terhadap seseorang tidak akan menjadikan-Nya lalai dari perhitungan makhluk-Nya yang lain, namun Allah memberi perhitungan terhadap mereka dalam satu waktu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41 Apakah mereka para penduduk Makkah tidak melihat bahwa sesungguhnya Kami mendatangi daerah orang-orang kafir, lalu Kami kurangi daerah-daerah itu sedikit demi sedikit dari tepi-tepinya baik dengan peperangan maupun bencana atau dengan memenangkan orang muslim dalam peperangan? Allah Maha menetapkan hukum menurut kehendak-Nya, tidak ada yang dapat menolak ketetapan-Nya; dan Dialah Yang Maha cepat hisab-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak melihat bahwa Kami mendatangi tempat-tempat} tempat orang yang ingkar {lalu Kami menguranginya dari tepi-tepinya} memenangkannya dari bagian sisinya untuk orang-orang muslim sedikit demi sedikit. Dan Kami menempatkan di sana bangunan-bangunan Islam {Allah menetapkan hukum tanpa ada yang dapat menolak ketetapanNya} tidak ada yang bisa menolak dan membatalkan ketetapan dan perintahNya {Dia Maha cepat perhitunganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Kemudian Allah mengancam orang-orang yang mendustakan, “Dan apakah mereka tidak melihat bahwa sesungguhnya Kami mendatangi daerah-daerah (orang-orang kafir), lalu Kami kurangi daerah-daerah itu (sedikit demi sedikit) dari tepi-tepinya?” ada pendapat yang menyatakan, “Dengan cara membinasakan orang-orang yang mendustakan dan menghabisi orang-orang yang zhalim sampai tuntas.” Pendapat lain, dengan menaklukan wilayah-wilayah kaum musyrikin dan pengurangan pada harta-benda mereka dan jasmani mereka.” Dan masih ada pendapat-pendapat lain dalam masalah ini. Pendapat yang tampak kebenarannya –wallahu a’lam- maksudnya; bahwa Allah memulai menaklukan tanah-tanah milik orang-orang yang mendustakan itu dan menguasainya serta menimpakan berbagai musibah di segala sisinya sebagai pengingat bagi mereka sebelum mereka mengalami kekurangan, dan Allah menimpakan musibah-musibah yang tidak bisa ditampik oleh siapa pun. Oleh karenanya, Allah berfirman, “Dan Allah menetapkan hukum (menurut kehendakNya), tidak ada yang dapat menolak ketetapanNya, yang bersifat syar’I, takdir dan balasanNya. Ketetapan-ketetapan ini, (yang dijadikan Allah sebagai hukum di dalamnya), terlihat sangat mengandung puncak hikmah dan kerapian. Tidak ada kekeliruan atau kekurangan padanya . Bahkan berbasis keadilan dan keseimbangan serta pujina. Tidak ada seorang pun yang bisa mengritiknya, dan tidak ada acara untuk mencelanya, berbeda dengan ketetapan hukum selainNya. Kadang-kadang benar, namun suatu waktu mengalami kekeliruan. “Dan Dia-lah Yang Mahacepat hisabNya,” janganlah meminta disegerakan (datangnya) siksaan. Sesungguhnya segala sesuatu yang akan tiba itu dekat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نَنقُصُهَا مِنۡ مِنۡ أَطۡرَافِهَاۚ) nanqushuhaa min athraafihaa : “Kami menguranginya sedikit demi sedikit” dari negeri satu ke yang lain, dengan pembebasan dan masuknya Islam ke dalam negeri tersebut dan musnahnya syirik darinya. (لَا مُعَقِّبَ لِحُكۡمِهِۦۚ) laa mu’aqqiba lihukmih : “tidak ada yang menentang hukum-Nya.” Tidak ada yang membantahnya sehingga tidak ada yang menyanggah hukumnya seraya hilang. Makna ayat : Firman-Nya : (أَوَ لَمۡ يَرَوۡاْ) “Apakah mereka tidak melihat” orang-orang musyrik yang menentang lagi senantiasa membuat makar dan menuntut ayat-ayat sebagai bukti kebenaran kenabian nabi Kami (أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ) “Kami mendatangi daerah-daerah lalu Kami kurangi sedikit demi sedikit dari tepinya.” Kami buka satu per-satu negeri untuk Islam, bukankah itu adalah tanda akan benarnya Rasul dan dakwahnya? Firman-Nya : (وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ) Allah jalla jalaaluh menetapkan hukum untuk makhluk-Nya sesuai dengan kehendak-Nya, memuliakan dan menghinakan, memberi dan menahan, menolong dan mengalahkan, dan tidak ada yang mampu menolak hukum-Nya, yaitu tidak ada yang bisa mengubah hukum-Nya sehingga rusak. Apabila Dia telah menetapkan kemenangan Islam dan hancur kekufuran, siapa yang dapat menolak-Nya? Firman-Nya : (وَهُوَ سَرِيعُ ٱلۡحِسَابِ) “Dan Dia Maha Cepat perhitungannya.” Jika Dia menghitung perbuatan seorang hamba, maka perhitungannya sangat cepat membalas pelakunya dengan segara tanpa lama dan ditunda. Pelajaran dari ayat : • Ketentuan-ketentuan Allah tidak dapat ditolak, dan tidak boleh merevisi suatu hukum dari hukum-hukum Allah ta’la dalam kitab-Nya atau sunnah Rasul-Nya shallahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 41: Yaitu dengan membinasakan orang-orang yang mendustakan dan orang-orang yang zalim. Ada pula yang mengatakan, yaitu dengan ditaklukkannya negeri-negeri kaum musyrik. Ada pula yang mengatakan, yaitu dengan mengurangi harta dan fisik mereka. Ada pula yang berpendapat lain. Menurut Syaikh As Sa’diy, zhahirnya –dan Allah yang lebih mengetahui- bahwa maksudnya adalah negeri-negeri mereka yang mendustakan (para rasul), Allah jadikan dapat ditaklukkan dan dibinasakan, dan tepi-tepinya tertimpa bencana untuk mengingatkan mereka sebelum mereka dihabiskan oleh pengurangan (daerah sedikit demi sedikit), dan Allah akan menimpakan mereka berbagai musibah yang tidak dapat ditolak oleh siapa pun. Mencakup hukum syar’i-Nya (terkait dengan syari’at-Nya), qadari-Nya (terkait dengan taqdir-Nya di alam semesta) dan jaza’i-Nya (terkait dengan balasan). Oleh karena hukum-Nya demikian bijaksana dan tepat, tidak ada cela dan kekurangan sama sekali, bahkan tegak di atas keadilan dan pujian, sehingga tidak ada jalan untuk mengkritik atau mencelanya; berbeda dengan hukum selain-Nya yang terkadang sesuai dengan kebenaran dan terkadang tidak. Oleh karena itu, janganlah meminta disegerakan azab, karena semua yang akan tiba itu sama saja dekat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 41",
    "description": "Di antara bukti-bukti Allah melaksanakan ancaman-Nya adalah peristiwa yang dialami oleh orang-orang kafir tersebut. Dan apakah mereka orang-orang kafir itu tidak melihat bahwa kami melalui hambahamba kami yang berjihad, mendatangi dan menaklukkan daerahdaerah yang dikuasai orang yang ingkar kepada Allah, lalu kami kurangi daerah-daerah yang dikuasai itu sedikit demi sedikit dari tepi-tepinya' dan Allah menetapkan hukum menurut kehendak-Nya. Tidak ada kekuatan apa pun yang dapat menolak ketetapan-Nya bila Allah sudah menetapkannya; dia mahacepat lagi mahabijaksana perhitungan-Nya. Kaum kafir mekah secara rahasia merencanakan penentangan kepada nabi Muhammad, sebagaimana kaum kafir terdahulu juga melakukan hal yang sama kepada rasul yang Allah utus kepada mereka. Dan sungguh, orang sebelum mereka, yakni kaum kafir yang hidup sebelum kaum kafir mekah, telah mengadakan tipu daya menentang para rasul, tetapi semua tipu daya yang mereka lakukan itu berada dalam genggaman kekuasaan Allah sehingga sangat mudah bagi-Nya untuk menggagalkannya. Dia mengetahui apa yang diusahakan oleh setiap orang, tidak terkecuali upaya mereka menyusun rencana rahasia, dan pada saat dihadapkan kepada tuhan, orang yang ingkar kepada tuhan akan mengetahui untuk siapa tempat kesudahan yang baik di dunia dan di akhirat kelak'tentu bagi para pengikut rasul-rasul itu."
  }
]