[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya orang-orang sebelum mereka telah mengatur berbagai tipu daya terhadap rasul-rasul mereka, sebagaimana mereka melakukan hal yang sama terhadapmu. Padahal hanya milik Allah semua makar itu, lalu Dia menggagalkan makar mereka, dan mengembalikan makar itu pada mereka dalam bentuk kegagalan dan penyesalan. Dia mengetahui apa yang diusahakan oleh setiap diri, yang baik maupun yang buruk, lalu dia diberi balasan atasnya. Orang-orang kafir akan mengetahui, bila mereka datang kepada tuhan mereka, bagi siapakah kesudahan yang baik setelah kehidupan dunia ini? sesungguhnya itu bagi para pengikut rasul-rasul. Disini terkandung peringatan dan ancaman bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Umat-umat terdahulu telah berbuat makar terhadap Nabi-nabi mereka, namum makar mereka ibarat senjata makan tuan, mereka mendustakan apa yang dibawa oleh Rasul-rasul mereka. Lalu apa yang mereka lakukan dengan rencana mereka? Tidak ada, karena pengaturan yang berefek adalah pengaturan Allah bukan selain-Nya, sebagaimana Allah mengetahui apa yang dilakukan oleh setiap jiwa dan membalasnya, saat itu mereka akan mengetahui betapa mereka sangat bersalah manakala mereka memilih untuk tidak beriman kepada Allah dan betapa orang-orang Mukmin adalah orang-orang yang benar, maka orang-orang Mukmin itu meraih Surga dan akibat yang baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Orang-orang kafir telah berusaha untuk membinasakan para nabi dengan berbagai tipu daya dan perlawanan, sebagaimana orang-orang kafir Quraisy membuat tipu daya terhadapmu hai Rasulullah; akan tetapi segala tipu daya adalah milik Allah, tidak ada yang mampu membuat tipu daya dan menyusun makar melainkan dengan ketetapan Allah. Allah Maha Mengetahui segala perbuatan yang dilakukan setiap insan, baik itu berupa keburukan maupun kebaikan. Dan semua orang kafir akan mengetahui bagi siapa kesudahan yang baik di akhirat, apakah bagi mereka atau bagi orang-orang beriman?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَقَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ فَلِلّٰهِ الْمَكْرُ جَمِيعًا ۖ (Dan sungguh orang-orang kafir yang sebelum mereka (kafir Mekah) telah mengadakan tipu daya, tetapi semua tipu daya itu adalah dalam kekuasaan Allah) Yakni tipu daya yang dilakukan orang-orang kafir kepada para rasul yang diutus Allah kepada mereka sebelum orang-orang kafir Makkah; mereka membuat makar terhadap para rasul tersebut dan kafir kepada mereka. Padahal makar mereka selalu gagal seakan-akan tidak pernah ada. فَلِلّٰهِ الْمَكْرُ جَمِيعًا ۖ (tetapi semua tipu daya itu adalah dalam kekuasaan Allah) Yakni tipu daya selain Allah tidak berlaku dan tidak memiliki kekuatan dalam menghadapi tipu daya Allah terhadap mereka. يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ( Dia mengetahui apa yang diusahakan oleh setiap diri) Dan barangsiapa yang mengetahui segala yang dilakukan oleh setiap orang dan menyiapkan balasan atas perbuatan itu maka Dia adalah pemilik semua tipu daya. Tidak ada kekuatan bagi makar selain-Nya jika berhadapan dengan makar-Nya. لِمَنْ عُقْبَى الدَّارِ (untuk siapa tempat kesudahan (yang baik) itu) Yakni bagi siapa kesudahan yang baik dari kedua golongan tersebut, baik itu di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42 Sungguh orang-orang kafir yang sebelum mereka para kafir Mekah telah membuat tipu daya, tetapi semua tipu daya itu adalah dalam kekuasaan Allah. Dia mengetahui apa yang dilakukan oleh setiap jiwa, sehingga akan disiapkan balasannya. Orang-orang kafir itu akan mengetahui untuk siapa tempat kesudahan yang baik itu, untuk mereka atau orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh orang-orang sebelum mereka telah mengadakan tipu daya} orang-orang sebelum orang-orang musyrik Mekkah {tetapi semua tipu daya itu dalam kekuasaan Allah. Dia mengetahui apa yang diusahakan oleh setiap orang. Orang-orang kafir akan mengetahui untuk siapa tempat kesudahan itu} tempat akhir di akhirat ketika mereka masuk neraka dan orang-orang mukmin masuk surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah berfirman, “Dan sungguh orang-orang kafir yang sebelum mereka (yaitu kafir Makkah) telah mengadakan tipu daya,” kepada kebenaran yang dibawa oleh para rasul (yang diutus kepada) mereka dan kepada kebenaran yang dibawa oleh para rasul. Rencana makar mereka tidak berguna, dan mereka tidak berkutik sedikit pun. Mereka memusuhi Allah dan menentangnya. “Tetapi semua tipu daya itu adalah dalam kekuasaan Allah,” tidak ada seorang pun yang bisa menciptakan makar kecuali dengan izinNya dan di bawah ketentuan dan takdirNya. Apabila mereka ingin berbuat makar mereka akan berbalik kepada mereka dengan kegagalan dan penyesalan. Sesungguhnya Allah “Dia mengetahui apa yang diusahakan oleh setiap diri,” yaitu mengetahui pikiran-pikirannya, kehendak dan amalan-amalan lahiriyah dan batiniyah. Dan tindakan makar itu mesti muncul dari usahanya, sehingga makar yang akan membahayakan (tindakan) makar itu mesti muncul dari usahanya, sehingga makar mereka tidak tersembunyi di hadapan Allah. Tidak akan terjadi (tindakan) mereka melancarkan makar yang akan membahayakan kebenaran dan para pengikutnya dan (tidak akan terjadi) kemanfaatan bagi mereka sama sekali. “Dan orang-orang kafir akan mengetahui untuk siapa tempat kesudahan (yang baik) itu,” apakah bagi mereka atau para rasul? Dan sudah diketahui bahwa akibat yang baik adalah peruntukkan bagi orang-orang yang bertakwa, bukan untuk kekufuran dan ahli kufur itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (وَقَدۡ مَكَرَ ٱلَّذِينَ مِن قَبۡلِهِمۡ) “Telah membuat makar orang-orang sebelum mereka” orang-orang sebelum mereka yaitu kaum Quraisy dan orang-orang kafir Mekah, telah membuat makar dan bagaimana hasil dari perbuatan mereka? merekapun musnah seluruhnya, tidakkah para petinggi kafir Mekah tidak takut akan akhir yang seperti ini? Firman-Nya : (فَلِلَّهِ ٱلۡمَكۡرُ جَمِيعٗاۖ) “Maka milik Allah-lah seluruh makar.” Yaitu tidak ada gunanya makar mereka, tidak berharga, dan tidak memberi efek negatif atau berharga. Firman-Nya : (يَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسٖۗ) “Dia mengetahui segala perbuatan setiap jiwa.” Baik perbuatan yang baik ataupun yang buruk, maka seberapa jauh (perbandingan) makar orang yang tidak tahu apa-apa dengan makar Yang Maha Mengetahui segalanya, dan maka itu akan menggiring sasarannya hingga jurang kehancuran sedangkan dia tidak sadar, maka apakah orang-orang kafir Quraisy tidak memperhatikan ini, lalu mereka berhenti dari perbuatan makar mereka kepada Rasulullah shallahu ‘alaihi wa sallam dan dakwah beliau? Firman-Nya : (وَسَيَعۡلَمُ ٱلۡكُفَّٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ) “Dan kelak orang-orang kafir akan mengetahui bagi siapa akhir yang bahagia.” Dan orang-orang musyrik akan mengetahui—musuh-musuh tauhid—pada hari kiamat nanti milik siapakah akhir yang bahagia, akhir yang mulia bagi siapa saja yang memasuki surga, yaitu Muhammad shallahu ‘alaihi wa sallam dan para pengikutnya atau siapa yang masuk ke dalam nereka mereka lah para penyeru kesyirikan dan kufur serta para pengikut mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 42: Terhadap nabi-nabi mereka. Oleh karena itu, tipu daya mereka tidaklah dapat menimpakan apa-apa kecuali dengan izin-Nya, sesuai qadha’ dan qadar-Nya, dan tipu daya itu akan kembali kepada mereka sehingga mereka kecewa dan menyesal. Niatnya, kehendaknya, dan amalnya yang nampak maupun yang tersembunyi diketahui-Nya, termasuk tipu daya mereka. Apakah untuk mereka atau untuk Nabi shallallahu 'alaihi wa sallam dan para pengikutnya. Mereka akan mengetahui ketika orang-orang kafir masuk ke dalam neraka, dan orang-orang mukmin masuk ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 42",
    "description": "Kaum kafir mekah secara rahasia merencanakan penentangan kepada nabi Muhammad, sebagaimana kaum kafir terdahulu juga melakukan hal yang sama kepada rasul yang Allah utus kepada mereka. Dan sungguh, orang sebelum mereka, yakni kaum kafir yang hidup sebelum kaum kafir mekah, telah mengadakan tipu daya menentang para rasul, tetapi semua tipu daya yang mereka lakukan itu berada dalam genggaman kekuasaan Allah sehingga sangat mudah bagi-Nya untuk menggagalkannya. Dia mengetahui apa yang diusahakan oleh setiap orang, tidak terkecuali upaya mereka menyusun rencana rahasia, dan pada saat dihadapkan kepada tuhan, orang yang ingkar kepada tuhan akan mengetahui untuk siapa tempat kesudahan yang baik di dunia dan di akhirat kelak'tentu bagi para pengikut rasul-rasul itu. Kaum kafir menolak kerasulan nabi Muhammad. Dan orang-orang kafir berkata, engkau, wahai Muhammad, bukanlah seorang rasul, melainkan pesihir. Jika mereka berkata demikian, katakanlah kepada mereka, cukuplah Allah yang maha mengetahui dan orang yang menguasai ilmu al-kitab'yahudi dan nasrani yang mengimani risalahku dan Al-Qur'an yang aku sampaikan'yang bertindak menjadi saksi antara aku sebagai penyampai kebenaran yang termaktub dalam alqur'an dan kamu yang menolak kebenaran Al-Qur'an itu. Surah ini diawali dengan penegasan tentang kebenaran Al-Qur'an yang diturunkan kepada nabi Muhammad, tetapi banyak manusia yang tetap saja enggan beriman. Surah ini kemudian ditutup dengan pene-gasan bahwa Allah dan orang-orang yang memahami al-kitab menjadi saksi atas kebenaran rasulullah sebagai penyampai alqur'an dan orang-orang kafir sebagai penolak Al-Qur'an itu. Antara bagian awal dan akhir surah ini terjalin sebuah hubungan serasi yang membentuk kesatuan kandungan bahwa Al-Qur'an adalah benar dari Allah."
  }
]