[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir berkata kepada nabi Allah ”wahai Muhammad, Allah tidak mengutus kamu.” katakanlah kepada mereka, ”Cukuplah Allah menjadi saksi atas kebenaranku dan kedustaan kalian. Dan cukuplah persaksian orang yang memiliki pengetahuan tentang kitab suci dari kalangan yahudi dan nasrani yang beriman kepada risalahku dan wahyu yang aku bawa dari sisi Allah, dan mengikuti kebenaran, lalu mengutarakan persaksian itu dengan terang-terangan dan tidak menyembunyiakannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Orang-orang kafir berkata, “Engkau -wahai Muhammad- bukan utusan Allah”. Jawablah mereka -wahai Rasul- “Cukuplah Allah sebagai saksi antara diriku dengan kalian bahwa aku adalah utusan dari Rabbku kepada kalian, dan orang yang memiliki ilmu tentang kitab-kitab terdahulu yang di sana tertera sifat-sifatku. Barangsiapa Allah menjadi saksi bagi kebenarannya, maka dia tidak terpengaruh oleh pendustaan siapa yang mendustakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Orang-orang yang mendustakan Allah dan rasul-Nya berkata: “Hai Muhammad, kamu bukanlah seorang rasul yang diutus Allah kepada seluruh manusia.” Katakanlah kepada mereka: “Cukup bagiku kesaksian dari Allah atas kebenaranku dan kedustaan kalian, dan mukjizat-mukjizat dan bukti-bukti yang jelas yang diturunkan kepadaku, serta kesaksian orang-orang beriman dari kalangan Yahudi dan Nasrani yang memiliki ilmu.” Syeikh as-Syinqithi berkata: Secara dzahir kalimat (ومن عنده علم الكتاب) berkaitan dengan lafadz (الله) dalam ayat ini; akan tetapi maksud dari kalimat tersebut adalah para ulama yang mengetahui Taurat dan Injil, dengan dalil firman Allah: شهد الله أنه لا إله إلا هو والملائكة وأولو العلم Allah menyatakan bahwa tidak ada tuhan selain Dia; (demikian pula) para malaikat dan orang berilmu. (Ali Imran: 18). Dan firman Allah, فإن كنت في شك مما أنزلنا إليك فسئل الذين يقرؤون الكتاب من قبلك Maka jika kamu (Muhammad) berada dalam keragu-raguan tentang apa yang Kami turunkan kepadamu, maka tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu. (Yunus: 94) Dan firman Allah, فسئلوا أهل الذكر إن كنتم لا تعلمون maka bertanyalah kepada orang yang mempunyai pengetahuan jika kamu tidak mengetahui. (an-Nahl: 43) Dan ayat-ayat lain yang semisalnya. Sedangkan Syeikhul Islam Ibnu Taimiyah berkata: (ومن عنده علم الكتاب) adalah para ahli kitab; mereka bersaksi atas risalah yang dibawa para nabi sebelum nabi Muhammad, mereka bersaksi bahwa nabi-nabi itu datang dengan seperti apa yang didatangkan Nabi Muhammad, seperti perintah untuk menyembah Allah semata, melarang kesyirikan, dan menyampaikan berita tentang hari kiamat, dan syariat-syariat asas. Mereka juga bersaksi bahwa dalam kitab mereka disebutkan sifat-sifat Nabi Muhammad, dan risalah dan kitabnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَيَقُولُ الَّذِينَ كَفَرُوا۟ لَسْتَ مُرْسَلًا ۚ (Berkatalah orang-orang kafir: “Kamu bukan seorang yang dijadikan Rasul”) Yakni wahai Muhammad, kamu bukanlah seorang Rasul yang diutus Allah kepada manusia. قُلْ كَفَىٰ بِاللهِ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ(Katakanlah: “Cukuplah Allah menjadi saksi antaraku dan kamu) Karena Allah mengetahui kebenaran kerasulanku, dan kebenaran seruanku. وَمَنْ عِندَهُۥ عِلْمُ الْكِتٰبِ(dan antara orang yang mempunyai ilmu Al Kitab) Yaitu orang-orang yang masuk Islam dari golongan ahli kitab seperti Abdullah bin Salam. Mereka bersaksi tentang kerasulanku. Pendapat lain mengatakan yakni Dzat yang mempunyai pengetahuan tentang Lauhul Mahfudz, yaitu Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43 Orang-orang kafir berkata: “Kamu bukanlah seorang utusan yang dijadikan Rasul untuk manusia wahai Muhammad”. Katakanlah: “Cukuplah Allah menjadi saksi antara aku dan kamu. Hanya Dia lah Yang Maha Mengetahui kebenaran risalahku, begitu juga Yang Menguasai Ilmu Ahli Kitab yaitu para mukmin Yahudi dan Nasrani yang juga telah bersaksi atas kebenaran risalahku ketika mereka mengetahui kebenaran dari kitab mereka”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang kafir berkata,“Kamu bukanlah seorang Rasul.” Katakanlah,“Cukuplah Allah dan orang yang menguasai ilmu kitab menjadi saksi antara aku dan kalian”}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Orang-orang kafir berkata, ‘Kamu bukan orang yang dijadikan rasul’,” maksudnya, mereka mendustakanmu dan mendustakan risalahmu “Katakanlah,” kepada mereka bila mereka meminta saksi “Cukuplah Allah menjadi saksi antara aku dan kamu,” dan persaksian Allah itu dengan ucapan, tindakan, dan penetapanNya. Adapun (persaksian) ucapanNya, maka dengan segala berita yang diwahyukan kepada makhlukNya yang paling jujur yang menguatkan risalahNya. Sedangkan (persaksian) tindakanNya, maka dengan cara Allah telah mendukung RasulNya dan menolongnya dengan pertolongan yang di luar jangkauan kemampuannya dan kemampuan para sahabat serta para pengikutnya. Ini adalah persaksianNya melalui tindakan dan dukungan. Sedangkan penetapanNya, maka (perwujudannya adalah bahwa) Rasulullah telah memberitahukan tentang dirinya bahwa ia seorang rasul (Allah), dan memerintahkan orang-orang untuk mengikutinya. Barangsiapa yang mengikutinya, maka akan meraih kemuliaan dan keridhaanNya. Barangsiapa yang tidak mengikutinya, maka dia mendappatkan neraka dan murka. Harta dan nyawanya halal. Dan Allah menetapkannya atas hal tersebut. Seandainya, beliau berbicara macam-macam, niscaya beliau akan segera dikenakan hukuman. “Dan antara orang yang mempunyai ilmu al-Kitab,” ini mencakup semua ulama ahli kitab dari kedua golongannya (Yahudi dan Nasrani). Karena mereka bersaksi atas (kebenaran) Rasulullah. Barangsiapa yang beriman dan mengikuti kebenaran, niscaya akan menyampaikan kesaksian yang menjadi kewajibannya. Sedangkan orang yang menyembunyikannya, maka pemberitahuan Allah tentang dirinya, bahwa dia mempunyai persaksian adalah lebih gamblang daripada pernyataannya (dari dirinya sendiri). Seandainya dia tidak memiliki kesaksian, maka kesaksiannya akan tertolak dengan petunjuk bukti. Karena itu, sikap diamnya menunjukkan bahwa dia mempunyai kesaksian yang disembunyikan. Allah memerintahkan beliau untuk meminta persaksian ahli kitab, sebab mereka orang-orang yang berkompeten dalam masalah ini. Dan setiap perkara, maka hanya para ahlinyalah yang dimintai keterangan dan orang-orang yang lebih tahu daripada orang lain tentang itu. Berbeda dengan orang yang tidak tahu sama sekali tentangnya, misalnya bangsa yang buta huruf, dari kalangan kaum musyrikin Arab dan lainnya, maka tidak ada manfaatnya untuk meminta keterangan dari mereka. Karena mereka tidak mengetahui dan tidak mengerti. Wallahu a’lam."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ) wa man ‘indahuu ‘ilmul kitaab : “dan mereka yang memiliki ilmu Al-Kitab.” Dari orang-orang beriman dari kalangan Yahudi dan Nasrani. Makna ayat : Firman-Nya : (وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ) “Dan orang-orang kafir berkata, ‘Engkau bukanlah seorang utusan.” Mereka mendebat mengingkarimu dan menentang kenabian dan risalahmu, katakanlah wahai Rasul Kami, “Allah-lah yang menjadi saksi di antara kita, dan Dia telah menjadi saksi atas risalah dan bersumpah di dalam firman-Nya (يسٓ١ وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ٢ إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ٣) “Yaa siin. Demi Al-Qur’an yang penuh hikmah, sungguh engkau termasuk dari para rasul.” Dan cukuplah kesaksian Allah sebagai bukti (وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ) “dan orang-orang yang memiliki ilmu Al-Kitab.” Kitab yang pertama yaitu Taurat dan Injil, mereka adalah orang-orang yang beriman dari kalangan Ahlul Kitab dari Yahudi dan Nasrani, seperti Abdullah bin Salam, Salman Al-Farisi, An-Nakha’i, Tamim Ad-Dari, dan selain mereka. Pelajaran dari ayat : • Kesaksian Allah adalah kesaksian yang terbesar, maka tidak perlu lagi meminta kesaksian jika perselisihan terjadi di antara kaum mukminin. • Keutamaan orang yang mengetahui atas orang yang tidak mengetahui, karena kesaksian orang-orang yang beriman dari kalangan Ahlul Kitab adalah bantahan bagi orang yang tidak mengetahui dari kalangan orang-orang musyrik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 43: Persaksian Allah Ta’ala ada yang berupa firman-Nya, perbuatan-Nya dan pengakuan-Nya. Firman-Nya adalah wahyu-Nya yang disampaikan kepada Beliau yang mengokohkan kerasulan-Nya. Perbuatan-Nya adalah dengan penguatan-Nya dan pertolongan-Nya yang diberikan kepada Rasul-Nya sehingga Beliau dapat mengalahkan musuh-musuh-Nya. Sedangkan pengakuan-Nya adalah pemberitahuan-Nya bahwa Beliau adalah utusan-Nya. Dia juga memerintahkan semua manusia untuk mengikuti Beliau. Yaitu ulama-ulama ahli kitab yang memeluk agama Islam. Di zaman dahulu ada Abdullah bin Salam dan kawan-kawannya yang menguasai al kitab dan mereka pun memeluk Islam, sedangkan di zaman sekarang tidak sedikit missionaris dan pendeta yang memeluk Islam. Selesai tafsir surah Ar Ra’d dengan pertolongan Allah dan taufiq-Nya, wal hamdulillahi Rabbil ‘aalamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 43",
    "description": "Kaum kafir menolak kerasulan nabi Muhammad. Dan orang-orang kafir berkata, engkau, wahai Muhammad, bukanlah seorang rasul, melainkan pesihir. Jika mereka berkata demikian, katakanlah kepada mereka, cukuplah Allah yang maha mengetahui dan orang yang menguasai ilmu al-kitab'yahudi dan nasrani yang mengimani risalahku dan Al-Qur'an yang aku sampaikan'yang bertindak menjadi saksi antara aku sebagai penyampai kebenaran yang termaktub dalam alqur'an dan kamu yang menolak kebenaran Al-Qur'an itu. Surah ini diawali dengan penegasan tentang kebenaran Al-Qur'an yang diturunkan kepada nabi Muhammad, tetapi banyak manusia yang tetap saja enggan beriman. Surah ini kemudian ditutup dengan pene-gasan bahwa Allah dan orang-orang yang memahami al-kitab menjadi saksi atas kebenaran rasulullah sebagai penyampai alqur'an dan orang-orang kafir sebagai penolak Al-Qur'an itu. Antara bagian awal dan akhir surah ini terjalin sebuah hubungan serasi yang membentuk kesatuan kandungan bahwa Al-Qur'an adalah benar dari Allah. Surah ar-ra'd diakhiri dengan penegasan bahwa Allah dan orangorang yang diberi al-kitab akan menjadi saksi atas kebenaran risalah nabi Muhammad. Sebagai sambungannya, surah ibrahim ini lalu diawali dengan penjelasan bahwa Allah menurunkan Al-Qur'an kepada nabi Muhammad untuk mengajak manusia keluar dari kegelapan menuju cahaya dengan izin Allah. Alif laam raa'. Ini adalah kitab Al-Qur'an yang kami turunkan kepadamu, wahai nabi Muhammad, agar engkau mengeluarkan manusia dari kegelapan kemusyrikan kepada cahaya tauhid yang terang-benderang, dengan izin tuhan, yaitu menuju jalan tuhan yang mahaperkasa lagi maha terpuji."
  }
]