[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kamu terheran-heran (wahai rasul), terhadap keengganan berimannya orang-orang kafir setelah adanya petunjuk-petunjuk ini, maka keheranan yang lebih besar lagi patut muncul adalah terhadap pernyatan orang-orang kafir, ”apakah apabila kami telah mati dan kami telah menjadi tanah, kami akan dibangkitkan kembali?” Mereka itu adalah orang-orang yang ingkar terhadap tuhan-tuhan mereka yang telah menciptakan mereka dari tidak ada sebelumnya. Dan mereka itu, belenggu-belenggu rantai dari neraka akan diikatkan pada leher-leher mereka pada hari kiamat, dan mereka itulah orang-orang yang akan terus berada di dalam neraka, tidak akan keluar darinya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Bila kamu merasa heran wahai Rasul terhadap sesuatu, maka sesuatu yang paling baik bagimu untuk heran terhadapnya adalah pendustaan mereka terhadap kebangkitan dan ucapan mereka membuktikan pengingkaran mereka terhadapnya, “Bila kami telah mati dan menjadi tanah dan tinggal tulang belulang yang lapuk, apakah kami akan dibangkitkan dan dikembalikan dalam keadaan hidup?” Orang-orang yang mengingkari kebangkitan sesudah kematian yang kafir kepada Rabb mereka lalu mereka mengingkari kekuasaan-Nya untuk menghidupkan orang-orang mati, leher-leher mereka dibelenggu di dalam Neraka pada Hari Kiamat. Mereka adalah para penghuni Neraka, mereka tinggal selama-lamanya di dalamnya, tidak ada kematian bagi mereka dan azab mereka pun tidak pernah berhenti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Hai Rasulullah, jika kamu heran terhadap pendustaan orang-orang kafir terhadapmu, maka heranlah terhadap pendustaan mereka tentang hari kebangkitan dan terhadap perkataan mereka: “Apakah jika kami telah mati dan menjadi tanah, kami akan dibangkitkan kembali?” Mereka yang jauh dari kebenaran itu adalah orang-orang yang mendustakan kekuasaan Tuhan mereka; mereka yang jauh dari rahmat Allah, pada hari kiamat leher mereka akan dibelenggu dengan rantai, mereka adalah bahan bakar api neraka dan mereka akan kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَإِن تَعْجَبْ (Dan jika (ada sesuatu) yang kamu herankan) Yakni, wahai Muhammad, jika kamu heran terhadap kedustaan mereka terhadapmu, maka lebih mengherankan lagi kedustaan mereka terhadap hari kebangkitan, dengan ucapan yang mereka katakan: أَءِذَا كُنَّا تُرٰبًا أَءِنَّا لَفِى خَلْقٍ جَدِيدٍ أَءِذَا كُنَّا تُرٰبًا أَءِنَّا لَفِى خَلْقٍ جَدِيدٍ ۗ (Apabila kami telah menjadi tanah, apakah kami sesungguhnya akan (dikembalikan) menjadi makhluk yang baru?) Apakah kami akan dibangkitkan kembali? أُو۟لٰٓئِكَ الَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ ۖ( Orang-orang itulah yang kafir kepada Tuhannya) Orang-orang yang mengingkari kekuasaan-Nya dalam membangkitkan mereka kembali adalah orang-orang yang tidak mau terlepas dari kekafiran mereka. وَأُو۟لٰٓئِكَ الْأَغْلٰلُ فِىٓ أَعْنَاقِهِمْ ۖ( dan orang-orang itulah (yang dilekatkan) belenggu di lehernya) Sehingga mereka dipalingkan dari keimanan, sehingga tidak akan beriman. Terdapat pendapat mengatakan yang dimaksud dengan belenggu adalah amalan-amalan buruk yang tidak dapat terlepas dari mereka seakan-akan belenggu yang dikalungkan di leher mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dan jika kamu terkejut, wahai Nabi terhadap pendustaan orang-orang kafir kepadamu dan sebaliknya menyembah berhala, maka sesuatu yang lebih mengejutkan dari itu adalah pedustaan dan pengingkaran mereka terhadap hari kebangkitan dengan berkata: ”Apakah mungkin kita dibangkitkan lagi setelah kita menjadi tanah yang sudah rusak?” Orang-orang yang mengingkari hari kebangkitan itu adalah orang-orang yang menyangkal kekuasaan Tuhan mereka. Dan mereka itu akan diikat di bagian leher mereka. Mereka itu adalah penduduk neraka yang tinggal di dalamnya selama-lamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu heran, maka yang mengherankan adalah ucapan mereka,“Apakah bila kami telah menjadi tanah, kami benar-benar akan menjadi makhluk yang baru” Mereka itulah orang-orang yang ingkar kepada Tuhannya. Mereka itulah orang-orang yang ada belenggu} rantai {di lehernya. Mereka adalah para penghuni neraka. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Firman Allah tersebut mengandung kemungkinan pengertian, “Dan jika (ada sesuatu) yang kamu herankan,” karena keagungan Allah dan banyaknya jumlah petunjuk tentang keesaanNya, maka sesungguhnya keheranan yang bersama ini adalah sikap pengingkaran para pendusta serta pengingkaran mereka terhadap Hari kebangkitan, dan komentar mereka, “Apabila kami telah menjadi tanah, apakah kami sesungguhnya akan (dikembalikan) menjadi makhluk yang baru?” maksudnya bahwa setelah mereka menjadi tanah, lalu Allah akan mengembalikan mereka (hidup kembali), maka ini terlalu mustahil untuk terjadi menurut anggapan mereka. Karena sebagian tanda kebodohan mereka adalah mereka menganalogikan kekuasaan Allah al-Khaliq (Sang Pencipta) dengan kekuatan makhluk, maka mereka berasumsi bahwa kejadian itu juga tidak mungkin terjadi dengan kekuasaan Allah. Mereka lupa bahwa Allah telah menciptakan mereka pertama kali saat mereka tidak berwujud apa-apa. Pengertian ayat ini jug bisa diarahkan kepada makna, kalau engkau keheranan terhadap ucapan dan pendustaan mereka terhadap Hari Kebangkitan, maka sungguh itu merupakan salah satu keajaiban. Sesungguhnya orang yang telah menerima penjelasan tentang berbagai tanda kebesaran Allah dan menyaksikan berbagai bukti pasti yang menunjukkan kedatangan Hari Kebangkitan, dengan keterangan yang tidak menimbulkan keraguan dan rasa syak pun, kemudian dia mengingkarinya, maka perkataan itu termasuk keajaiban. Namun (sebenarnya) hal itu tidak perlu menjadi bahan keheranan pada “orang-orang yang kafir kepada Rabbnya,” dan mereka menentang keesaanNya, padahal merupakan hakikat yang sangat jelas lagi paling tampak terang. “Dan orang-orang itulah (yang dilekatkan) belenggu,” yang memasung mereka dari petunjuk Allah “di lehernya,” di mana mereka diseru kepada keimanan namun tidak menyambut, ditawarkan kepada mereka hidayah, namun mereka tidak berhasil mendapatkan hidayah. Maka hati dan kalbu mereka terombang-ambing, sebagai bentuk hukuman bagi mereka karena tidak beriman kepadaNya secara langsung “mereka itulah penghuni neraka, mereka kekal di dalamnya,” mereka tidak akan keluar darinya selama-lamanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَإِن تَعۡجَبۡ) wa in ta’jab : engkau heran dengan pengingkaran mereka terhadap kenabianmu dan ajaran tauhid yang engkau bawa. (فَعَجَبٞ) fa’ajab : yang lebih mengherankan lagi, keingkaran mereka terhadap kebangkitan dan kehidupan kedua, padahal bukti-bukti dan hujjah begitu jelas dan kuat. (لَفِي خَلۡقٖ جَدِيدٍۗ) lafii khalqin jadiid : kami kembali hidup seperti sediakala. (ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ) al-aghlaalu fii a’naaqihim : penghalang-penghalang dari keimanan dan hidayah di dunia, dan belenggu yang mengikat tangan di atas leher mereka kelak di akhirat. Makna ayat: Masih dalam ajakan kepada kaum musyrikin untuk beriman dengan tauhid dan kenabian Muhammad shallahu ‘alaihi wa sallam, kebangkitan pada hari kiamat untuk hisab dan pembalasan. Firman-Nya : (۞وَإِن تَعۡجَبۡ) jika engkau takjub wahai nabi kami, akan keengganan mereka beriman kepada risalahmu dan mentauhidkan Rabbmu, maka lebih mengherankan lagi bahwa mereka tidak beriman dengan kebangkitan hari kiamat. Mereka berkata dengan heran dan pengingkaran : (أَءِذَا كُنَّا تُرَٰبًا أَءِنَّا لَفِي خَلۡقٖ جَدِيدٍۗ) “Apakah jika kami sudah menjadi tanah kami akan dibangkitan seperti sedia kala? Padahal kami sudah hancur dan binasa? Allah berfirman seraya menetapkan kekufuran mereka dan pasti akan mendapatkan azab (أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡۖ وَأُوْلَٰٓئِكَ ٱلۡأَغۡلَٰلُ فِيٓ أَعۡنَاقِهِمۡۖ) di dunia ia akan terhalang dari hidayah, karena taklid buta, kesombongan, pengingkaran, dan pembangkangan. Sedangkan di akhirat belenggu-belenggu yang mengikat tangan mereka ke tengkuk mereka, (وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ) merekalah penduduk neraka (هُمۡ فِيهَا خَٰلِدُونَ ) tinggal di dalamnya selamanya tidak akan keluar darinya sampai kapanpun. Pelajaran dari ayat : • Penetapan pokok-pokok akidah yang tiga; tauhid, nubuwah, kebangkitan dan pembalasan terakhir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 5: Karena orang-orang kafir mendustakanmu. Bisa juga maksudnya, jika engkau heran terhadap kebesaran Allah Ta’ala dan banyaknya dalil-dalil yang menunjukkan keesaan-Nya. Menurut mereka, hal itu adalah mustahil. Nampaknya mereka tidak menyadari, bahwa yang mampu mengadakan makhluk pertama kali sudah pasti mampu mengadakan makhluk kembali setelah mati, karena hal itu lebih mudah. Tetapi karena kebodohan mereka, mereka mengqiaskan kemampuan Allah dengan kemampuan makhluk. Menurut mereka, jika makhluk saja tidak mampu, demikian pula Al Khaliq (Allah Subhaanahu wa Ta'aala). Mereka lupa, bahwa Allah-lah yang menciptakan mereka pertama kali, sedang mereka sebelumnya tidak ada sama sekali, di mana hal itu sebenarnya lebih berat daripada menciptakan kembali yang sebelumnya sudah ada. Yaitu belenggu-belenggu yang menghalangi mereka dari mengikuti petunjuk, sehingga ketika mereka diajak beriman, mereka tidak mau beriman, dan ketika disodorkan petunjuk kepada mereka, namun mereka tidak mau mengambilnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 5",
    "description": "Semua itu dengan sangat jelas membuktikan keesaan Allah. Dan sebab itu, jika ada sesuatu yang engkau patut merasa heran, maka yang mengherankan adalah ucapan mereka, apa-kah benar, bila kami telah meninggal, dikubur, dan kemudian menjadi tanah, apakah kami kelak akan dikembalikan atau dibangkitkan menjadi makhluk yang baru lagi' mereka yang berkata seperti itulah orang-orang yang ingkar kepada tuhannya. Mereka mengingkari keesaan Allah dan kepastian datangnya hari kiamat, dan mereka itulah orang-orang yang akan dilekatkan belenggu di lehernya. Mereka adalah para penghuni neraka, dan mereka kekal di dalamnya untuk waktu yang sangat lama. Selain pertanyaan mereka tentang kebangkitan, permintaan mereka yang aneh juga mengherankan. Dan mereka, yakni kaum kafir mekah, meminta kepadamu agar dipercepat datangnya siksaan yang akan dijatuhkan bagi mereka, sebelum mereka meminta kebaikan, padahal telah terjadi bermacam-macam contoh siksaan yang telah dijatuhkan kepada kaum sebelum mereka. Sungguh, tuhanmu, wahai nabi Muhammad, benar-benar memiliki ampunan bagi manusia atas kezaliman yang mereka lakukan, dan sungguh, tuhanmu benar-benar sangat keras siksaan-Nya bagi orang-orang yang terus-menerus durhaka dan enggan bertobat."
  }
]