[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "orang-orang yang mendustakan meminta kepadamu supaya disegerakan siksaan yang aku belum menimpakan pada mereka siksaan dengan segera, sebelum keimanan yang diharapkan menjadi sumber keamanan dan kebaikan. Dan sungguh telah berlalu hukuman-hukuman atas orang-orang yang mendustakan sebelum mereka, maka mengapa mereka tidak mau mengambil pelajaran darinya? sesungguhnya tuhanmu (wahai rasul), benar-benar memberi pengampunan terhadap dosa-dosa manusia yang bertaubat dari dosa-dosa lantaran perbuatan kezhaliman mereka, dengan membukakan pintu ampunan bagi mereka dan menyeru mereka kepadanya, sementara mereka berbuat kezhaliman terhadap diri mereka dengan berbuat maksiat kepada tuhan mereka. Dan sesungguhnya tuhanmu benar-benar amat keras siksaanNya terhadap orang yang terus menerus di atas kekafiran, kesesatan dan maksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Orang-orang musyrikin meminta kepadamu -wahai Rasul- menyegerakan hukuman atas mereka dan mereka merasa azab tersebut lambat datangnya kepada mereka sebelum mereka mengenyam semua kenikmatan yang Allah tetapkan bagi mereka. Padahal telah berlalu sebelum mereka siksaan Allah yang menimpa umat-umat yang mendustakan. Apakah orang-orang musyrikin itu tidak mengambil pelajaran darinya? Sesungguhnya Rabbmu -wahai Rasul-, Maha Penyantun kepada manusia sekalipun mereka berbuat zalim, sehingga Dia tidak menyegerakan hukuman agar mereka segera bertobat, namun Allah juga Mahakuat, mampu menyegerakan hukuman atas orang-orang yang bersikukuh di atas kekufuran bila mereka tidak bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Para pemimpin kesesatan menantang dan meminta Rasulullah untuk menyegerakan turunnya azab bagi mereka sebelum mereka mendapat kabar gembira yang akan disampaikan kepada mereka; padahal telah berlalu azab-azab yang ditimpakan kepada umat-umat yang mendustakan para rasul mereka. Hai Nabi, sungguh Penciptamu dan Pengatur urusanmu memiliki ampunan atas dosa-dosa bagi hamba-hamba-Nya yang bertaubat dari kezaliman terhadap diri mereka sendiri dengan bermaksiat kepada-Nya. dan sungguh Tuhanmu sangat keras siksaan dan azab-Nya bagi orang-orang yang mendustakan-Nya dan mendustakan hari perhitungan. Syeikh as-Syinqithi berkata, dalam ayat ini yang dimaksud dengan (السيئة) adalah siksaan, dan yang dimaksud dengan (الحسنة) adalah keselamatan, atau menurut pendapat lain adalah keimanan. Dalam ayat ini Allah menjelaskan bahwa orang-orang kafir meminta Rasulullah untuk menyegerakan azab yang diancamkan kepada mereka jika mereka tetap dalam kekafiran. Dan makna ini terdapat dalam banyak ayat, seperti dalam firman Allah: ويستعجلونك بالعذاب ولن يخلف الله وعده “Dan mereka meminta kepadamu agar azab itu disegerakan, padahal Allah sekali-kali tidak akan menyalahi janji-Nya.” (Al-Hajj: 47)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ (Mereka meminta kepadamu supaya disegerakan (datangnya) siksa, sebelum (mereka meminta) kebaikan) Maksud dari (السيئة) adalah siksaan yang membinasakan. Dan maksud dari (الحسنة) yakni kesehatan dan keselamatan. Yakni mereka meminta siksaan sebelum meminta keselamatan dan kesehatan. وَقَدْ خَلَتْ مِن قَبْلِهِمُ الْمَثُلٰتُ ۗ (padahal telah terjadi bermacam-macam contoh siksa sebelum mereka) Yakni siksa-siksa yang ditimpakan bagi orang-orang yang berdusta seperti mereka; mengapa mereka tidak mengambil pelajaran dari kaum-kaum tersebut, dan berhati-hati agar tidak siksa itu tidak menimpa mereka. وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِّلنَّاسِ ()Sesungguhnya Tuhanmu benar-benar mempunyai ampunan (yang luas) bagi manusia) Yakni mempunyai ampunan yang sangat luas. عَلَىٰ ظُلْمِهِمْ ۖ( sekalipun mereka zalim) Sehingga Allah tidak segera menyiksa mereka meskipun mereka terus-menerus melakukan perbuatan dosa. وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ(dan sesungguhnya Tuhanmu benar-benar sangat keras siksanya) Menyiksa orang-orang kafir yang bermaksiat dan mendustakan Allah dengan siksaan yang sangat keras atas kehendak-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika dibacakan kepada Muthrof bin Abdillah ayat ini : { وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَىٰ ظُلْمِهِمْ } \"Sesungguhnya Tuhanmu benar-benar mempunyai ampunan (yang luas) bagi manusia sekalipun mereka zalim\" beliau kemudian berkata : jika saja manusia mengetahui besarnya rahmat dan ampunan Allah; sungguh mata mereka akan mejadi sejuk, dan jika saja manusia mengetahui bagaimana pedihnya azab dan siksaan Allah; sungguhnya mata mereka tidak akan pernah kering dari luapan air matanya, dan sekalipun mereka tidak akan merasa nikmat dengan makanan dan minuman yang mereka santap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Orang-orang musyrik yang pendusta itu memintamu untuk mempercepat hukuman sebelum waktunya agar diturunkan (kepada mereka) hukuman yang memberikan kehancuran. Dan seungguh telah lewat hukuman-hukuman bagi para pendusta yang serupa dengan mereka. Lalu tidakkah mereka tidak mengambil pelajaran dari para pendahulu itu? Wahai Nabi, sesungguhnya Tuhanmu memiliki satir yang yang agung untuk dosa-dosa, Dia juga akan menghukum orang-orang kafir yang durhaka dengan hukuman yang dahsyat. Al-Matsulat adalah hukuman yang setimpal dengan dosa (yang dilakukan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka meminta kepadamu agar dipercepat keburukan itu} hukuman itu {sebelum ada kebaikan} kesejahteraan {sungguh telah berlalu} berlalu {bermacam-macam contoh sebelum mereka} akibat-akibat yang serupa untuk mereka bagi orang-orang yang berdusta {Sesungguhnya Tuhanmu benar-benar memiliki ampunan bagi manusia atas kezaliman mereka. Sesungguhnya Tuhanmu benar-benar keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Allah mengabarkan tentang kebodohan orang-orang yang mendustakan RasulNya lagi menyekutukanNya. Mereka diberi nasihat tetapi mereka tidak mengambil nasihat itu. Bermacam-macam dalil disampaikan kepada mereka, namun mereka tidak tunduk kepadanya. justru terang-terangan melakukan pengingkaran dan (membela diri) berdalih dengan kelembutan Allah al-Wahid al-Qahhar (kepada mereka) dan tidak mengobati dosa-dosa mereka dengan alasan bahwa mereka berada di atas kebenaran. Mereka pun memulai meminta kepada rasul untuk menyegerakan siksaan. Ada yang berkata \" \"Ya Allah, jika betul (Al Quran) ini, dialah yang benar dari sisi Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih\".(Al-Anfal:32), padahal mereka itu “padahal telah terjadi bermacam-macam siksa sebelum mereka,” maksudnya berbagai peristiwa dan sejarah yang menimpa umat-umat pendusta. Apakah mereka tidak merenungi kondisi orang-orang itu dan meninggalkan kebodohan mereka? “Dan sesungguhnya Rabbmu benar-benar mempunyai ampunan (yang luas) bagi manusia atas kezhaliman mereka,” maksudnya senantiasa kebaikan, kebajikan, dan maafNya tercurah kepada para hamba. Semetara, praktik syirik dan maksiat mereka masih saja melaju kepada Allah. Mereka bermaksiat kepadaNya, tetapi Allah menyuruh mereka menuju pintuNya. Mereka berbuat jahat, tetapi Dia tetap tidak menghalangi kebaikanNya bagi mereka. Bila mereka bertaubat kepadaNya, niscaya Dia menjadi kekasih mereka, sebab Dia mencintai orang-orang yang bertaubat dan mencintai orang-orang yang menyucikan diri. Bila mereka tidak bertaubat, maka Dia akan memberikan terapi penyembuhan bagi mereka dengan menimpakan berbagai musibah atas mereka untuk membersihkan mereka dari keburukan-keburukan. \" Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.\"(Az-Zumar:53). “Dan sesungguhnya Rabbmu benar-benar sangat keras siksaanNya,” terhadap orang yang kontinyu berulang-ulang dalam bermaksiat. Ia sudah benar-benar enggan bertaubat, beristighfar, dan kembali kepada al-Aziz al-Ghaffar (Yang Mahaperkasa lagi Maha Pengampun). Hendaknya para hamba berhati-hati terhadap siksa-siksaNya (yang menimpa) orang-orang yang berbuat jahat. Sesungguhnya siksaanNya sangat pedih lagi keras."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِٱلسَّيِّئَةِ) bissayyiah : dengan azab. (قَبۡلَ ٱلۡحَسَنَةِ) qablal hasanah : rahmat dan apa yang baik bagi mereka berupa keselamatan, kelapangan, dan kekayaan. (ٱلۡمَثُلَٰتُۗ) al-matsulaat : hukuman-hukuman, bentuk jamak dari mutslatun yaitu hukuman yang menimpa para pendusta dari umat-umat terdahulu. Makna ayat : Firman-Nya : (وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ) Allah mengabarkan kepada rasul-Nya menjelaskan perkataan mereka orang-orang yang kafir kepada Rabb mereka, dengan pertemuan-Nya, dan kepada Nabi Allah, serta ajarannya, serta apa yang mereka katakan meremehkan dan memohon percepatan, yaitu permintaan mereka turunnya azab di dunia, karena Rasulullah shallahu ‘alaihi wa sallam sering menakut-nakuti mereka dengan azab dunia dan akhirat, sehingga mereka memintanya, seperti perkataan sebagian mereka (فَأَمۡطِرۡ عَلَيۡنَا حِجَارَةٗ مِّنَ ٱلسَّمَآءِ أَوِ ٱئۡتِنَا بِعَذَابٍ أَلِيمٖ) “Maka hujanilah kami dengan batu dari langit atau datangkan kepada kami azab yang pedih.” [QS:Al-Anfal:32] sebelum mereka memohon kebaikan, dan hal ini terjadi karena kebodohan dan kekufuran mereka. Jika bukan, niscaya mereka akan memohon kebaikan; kesehatan, kelapangan, dan kemakmuran sebelum keburukan; kehancuran dan azab. Firman-Nya : (وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ) sedangkan siksaan-siksaan telah terjadi pada umat-umat terdahulu sebelum mereka, seperti azab Allah kepada kaum ‘Ad, Tsamud, Penghuni Aikah, dan negeri yang dijungkir-balikkan, untuk apa mereka meminta siksaan itu karena mereka menggangap hal itu mustahil meremehkan hal tersebut, kemana perginya akal mereka? Firman-nya : (وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ) “Dan Rabbmu sungguh memiliki ampunan bagi manusia atas kezaliman mereka.” dan inilah realitanya, karena seandainya Dia mengazab setiap kezaliman yang dilakukan dan tidak mengampuninya, niscaya tidak ada satupun makhluk yang hidup di atas bumi. Firman-Nya : (وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ) siksaan-Nya sangat pedih bagi yang bermaksiat kepada-Nya setelah Dia memberikan peringatan sebelumnya dan menjelaskan hal-hal yang menyelamatkannya, namun ia tidak mau berlindung dari perkara yang dapat mendatangkan azab seperti syirik dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 6: Allah Subhaanahu wa Ta'aala memberitahukan tentang kebodohan orang-orang yang mendustakan rasul-Nya lagi menyekutukan-Nya dengan sesuatu, yang diberi nasehat namun tidak mau menerimanya, yang telah ditegakkan hujjah namun tidak mau tunduk kepadanya, bahkan terang-terangan menampakkan keingkaran, dan mereka berdalih dengan santunnya Allah terhadap mereka dan tidak mengazab mereka segera bahwa mereka di atas kebenaran. Lebih dari itu, mereka meminta kepada Rasulullah shallallahu 'alaihi wa sallam agar didatangkan segera azab kepada mereka, padahal contoh-contoh siksaan Allah yang diberikan kepada orang-orang yang mendustakan rasul demikian banyak. Apakah mereka tidak memikirkan keadaan itu sehingga meninggalkan sikap bodohnya? Orang-orang musyrik sambil mengejek, meminta kepada Nabi Muhammad shallallahu 'alaihi wa sallam, agar disegerakan turunnya siksa, padahal seharusnya mereka lebih dahulu meminta rahmat dan keselamatan. Jika setiap kezaliman diberikan hukuman, tentu tidak ada makhluk yang tersisa di bumi, akan tetapi Dia memberikan tangguh mereka agar mereka kembali dan bertobat. Kebaikan, ihsan dan maaf-Nya senantiasa turun kepada hamba, akan tetapi keburukan mereka malah yang naik kepada-Nya. Mereka mendurhakai-Nya, namun Dia mengajak mereka untuk kembali kepada-Nya, mereka berbuat dosa, tetapi kebaikan dan ihsan-Nya tidak dihalangi dari mereka. Jika mereka bertobat, maka Dia cinta kepada mereka, dan jika mereka tidak bertobat, maka Dia tabib (dokter) mereka, Dia uji mereka dengan musibah untuk membersihkan mereka dari cela dan kekurangan, Dia berfirman: Katakanlah, \"Wahai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang.” (Terj. Az Zumar: 53) Bagi mereka yang tidak berhenti dari dosa-dosa, enggan bertobat, beristighfar, dan enggan kembali kepada Allah yang Mahaperkasa lagi Maha Pengampun. Oleh karena itu, hendaknya manusia takut terhadap siksaan-Nya kepada pelaku dosa, karena siksa-Nya begitu pedih dan keras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 6",
    "description": "Selain pertanyaan mereka tentang kebangkitan, permintaan mereka yang aneh juga mengherankan. Dan mereka, yakni kaum kafir mekah, meminta kepadamu agar dipercepat datangnya siksaan yang akan dijatuhkan bagi mereka, sebelum mereka meminta kebaikan, padahal telah terjadi bermacam-macam contoh siksaan yang telah dijatuhkan kepada kaum sebelum mereka. Sungguh, tuhanmu, wahai nabi Muhammad, benar-benar memiliki ampunan bagi manusia atas kezaliman yang mereka lakukan, dan sungguh, tuhanmu benar-benar sangat keras siksaan-Nya bagi orang-orang yang terus-menerus durhaka dan enggan bertobat. Tidak cukup sampai di situ, kaum kafir mekah juga meminta nabi Muhammad mendatangkan mukjizat yang kasat mata seperti mukjizat nabi musa. Dan orang-orang kafir berkata dengan maksud mengejek nabi Muhammad dan kaum muslim, mengapa tidak diturunkan kepadanya suatu tanda mukjizat inderawi dari tuhannya' sesungguhnya engkau, wahai Muhammad, hanyalah seorang pemberi peringatan, petunjuk, dan bimbingan menuju jalan kebenaran; dan bagi setiap kaum di mana pun berada, selalu ada orang yang memberi petunjuk, baik itu nabi maupun pewarisnya."
  }
]