[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir Makkah berkata, ”mengapa tidak datang kepadanya satu mukjizat yang bisa dirasakan pancaindra, seperti, tongkat musa, dan unta Shaleh?” itu tidaklah berada dalam kekuasaanmu (wahai rasul). Kamu tidak lain hanyalah seorang penyampai kepada mereka, dan seorang yang memperingatkan mereka dari siksaan Allah. Dan bagi tiap-tiap umat terdapat seorang rasul yang mengarahkan kepada Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Orang-orang kafir kepada Allah berkata sambil memperlihatkan penentangan dan pembangkangan mereka, “Mengapa tidak diturunkan kepada Muhammad suatu bukti dari Rabbnya seperti yang telah diturunkan kepada Musa dan Isa”. Sesungguhnya kamu -wahai Rasul- hanyalah seorang pemberi peringatan yang memperingatkan manusia dari azab Allah, kamu tidak punya mukjizat kecuali apa yang Allah berikan kepadamu. Setiap kaum mempunyai seorang nabi yang membimbing mereka ke jalan kebenaran dan menunjukkan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Mereka terus menerus mendustakan Rasulullah dengan meminta mukjizat yang lain; mereka berkata: “Mengapa tidak diturunkan kepada Muhammad mukjizat dari Tuhannya seperti mujizat Musa, Isa, dan Shalih?” Namun itu bukan dalam kuasamu, kamu hanya diutus untuk menyampaikan dakwah kepada Allah dan memperingatkan orang-orang kafir dari neraka. Dan bagi setiap umat terdapat rasul yang menyeru mereka untuk mengikuti kebenaran dan mengesakan dan menyembah Allah, sebagaimana kamu adalah penyeru bagi umatmu. Syeikhul Islam Ibnu Taimiyah berkata, firman Allah (إنما أنت منذر ولكل قوم هاد) menurut pendapat yang paling kuat, maknanya adalah setiap kaum memiliki penyeru yang mendakwahi mereka. (al-Jawab as-Shahih 2/99)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَيَقُولُ الَّذِينَ كَفَرُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ ءَايَةٌ مِّن رَّبِّهِۦٓ ۗ (Orang-orang yang kafir berkata: “Mengapa tidak diturunkan kepadanya (Muhammad) suatu tanda (kebesaran) dari Tuhannya?”) Yakni tidakkah diturunkan kepadanya mukjizat selain dari mukjizat-mukjizat yang telah ia datangkan. إِنَّمَآ أَنتَ مُنذِرٌ ۖ( Sesungguhnya kamu hanyalah seorang pemberi peringatan) Yang memperingatkan mereka dari neraka. Dan kamu tidak mempunyai kuasa untuk mendatangkan suatu mukjizat. Nabi Muhammad telah menjalankan kewajiban yang dibebankan kepadanya, yaitu menyampaikan peringatan. وَلِكُلِّ قَوْمٍ هَادٍ (dan bagi tiap-tiap kaum ada orang yang memberi petunjuk) Yakni seorang Nabi yang menyeru mereka kepada hidayah dan petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Orang-orang kafir yang angkuh itu berkata: “Tidaklah turun kepada Muhammad itu mukjizat lain yang bisa dirasakan dari Tuhannya yang menunjukkan pada kebenaran dan kenabiannya.” Lalu Allah membalas mereka: ”Sesungguhnya kamu wahai rasulallah adalah pemberi ancaman tentang neraka kepada orang yang bermaksiat kepada Allah. Dan bukan tugasmu untuk menurunkan ayat. Bagi setiap kaum itu seorang nabi atau rasul yang menunjukkan dan membimbing mereka menuju jalan keberhasilan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir berkata,“Mengapa tidak} mengapa tidak {diturunkan kepadanya} kepada Muhammad {suatu tanda} tanda dan bukti atas kenabiannya {dari Tuhannya” Sesungguhnya kamu hanyalah seorang pemberi peringatan dan bagi setiap kaum ada pemberi petunjuk} nabi yang membimbing mereka menuju kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Maksudnya, orang-orang yang kafir melontarkan usulan kepadamu tentang tanda-tanda kebenaran (adanya Hari Kebangkitan) sesuai yang mereka tentukan sendiri. Mereka menyatakan, “Mengapa tidak diturunkan kepadanya (Muhammad) suatu tanda (kebesaran) dari Rabbnya?” pernyataan ini, mereka jadikan sebagai alasan untuk menjastifikasi sikap penolakan mereka terhadap Rasul. Padahal, beliau hanyalah seorang pemberi peringatan, tidak memiliki wewenang atas sesuatu pun. Allah-lah yang menurunkan tanda-tanda kebenaran risalah. Dia telah mendukung beliau dengan beraneka bukti kebenaran yang tidak tersembunyi bagi orang-orang yang berakal. Dengan itu, orang yang niatnya mencari kebenaran akan mendapatkan petunjuk. Adapun orang kafir, dikarenakan kezhaliman dan kebodohannya, maka akan melontarkan usulan kepada Allah tentang tanda-tanda kebenaran (yang mesti diturunkan). Itu merupakan pengajuan usulan yang batil, kedustaan, dan mengada-ada. Sesungguhnya bila datang sebuah ayat (tanda kebenaran) apa pun itu, niscaya dia tidak akan beriman dan tidak akan tunduk kepadanya. Dia menampik beriman bukan lantaran tidak ada yang menunjukkannya kepada kebenaran, tapi karena hawa nafsu dan syahwat belaka. “Dan bagi tiap-tiap kaum ada orang yang memberi petunjuk,” maksudnya mempunyai penyeru yang mengajak mereka menuju hiadayah, dari kalangan para rasul dan pengikut-pengikut mereka. Mereka dibekali bermacam-macam dalil dan bukti kebenaran yang menunjukkan kebenaran hidayah yang ada pada mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَوۡلَآ أُنزِلَ عَلَيۡهِ) laulaa unzila ‘alaihi : Mengapa tidak diturunkan, kata لولا berfungsi untuk mengajak sama seperti هلا. (َايَةٞ مِّن رَّبِّهِۦٓۗ) ayatum mir rabbih : mukjizat seperti tongkat Nabi Musa dan onta Nabi Saleh. (وَلِكُلِّ قَوۡمٍ هَادٍ) wa likulli qaumin haad : seorang nabi yang mengajak kaumnya untuk beribadah kepada Rabb mereka dan tidak menyekutukannya dengan apa pun. Makna ayat : Firman-Nya : (وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ) Allah ta’ala mengkabarkan kepada rasul-Nya dan orang-orang beriman tentang perkataan orang-orang kafir terhadap tauhid, kebangkitan, dan nubuwah (لَوۡلَآ) yaitu: kenapa tidak diturunkan kepada Muhammad shallahu ‘alaihi wa sallam tanda dari Rabbnya, seperti tongkat Nabi Musa dan onta Nabi Shaleh, sehingga kami beriman dengan kenabianmu dan membenarkan risalahmu, maka Allah ta’ala membantah mereka dengan firman-Nya : (إِنَّمَآ أَنتَ مُنذِرٞۖ) dan seorang pemberi peringatan akan azab tidak melazimkan untuk turun datang bersamanya tanda-tanda, oleh karena itu janganlah engkau mempedulikan permintaan mereka, dan lanjutkanlah dakwahmu, karena bagi setiap kaum ada yang membawa petunjuk, dan engkau adalah pemberi petunjuk ummat ini dan penyeru mereka kepada Rabb mereka, jadi berdakwahlah dan bersabarlah. Pelajaran dari ayat : • Hal-hal yang menghalangi keimanan yang mana ia seperti belenggu; taklid buta, kesombongan, dan keras kepala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 7: Mereka mengusulkan mukjizat sesuai yang mereka inginkan, dan kata-kata ini mereka jadikan sebagai uzur untuk tidak mengikuti seruan rasul, padahal tugas Beliau hanyalah menyampaikan (yakni Beliau tidak dibebani mendatangkan mukjizat), Allah-lah yang mendatangkannya. Allah Subhaanahu wa Ta'aala sebenarnya telah menguatkan Beliau dengan mukjizat yang tidak samar bagi orang-orang yang berakal, dan dengannya orang yang mencari petunjuk mendapatkan hidayah. Adapun usulan orang kafir yang sebenarnya timbul dari kezaliman dan kebodohan hanyalah sebatas usulan yang batil dan dusta. Hal itu, karena kalau pun mukjizat itu datang, ia tetap tidak beriman dan tidak tunduk, karena ia tidak beriman bukan karena tidak ada bukti yang menunjukkan kebenarannya, akan tetapi karena mengikuti hawa nafsunya. Yakni seorang nabi yang mengajak mereka kepada Tuhan mereka dengan membawa mukjizat yang menunjukkan kebenarannya, namun tidak mengikuti permintaan kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 7",
    "description": "Tidak cukup sampai di situ, kaum kafir mekah juga meminta nabi Muhammad mendatangkan mukjizat yang kasat mata seperti mukjizat nabi musa. Dan orang-orang kafir berkata dengan maksud mengejek nabi Muhammad dan kaum muslim, mengapa tidak diturunkan kepadanya suatu tanda mukjizat inderawi dari tuhannya' sesungguhnya engkau, wahai Muhammad, hanyalah seorang pemberi peringatan, petunjuk, dan bimbingan menuju jalan kebenaran; dan bagi setiap kaum di mana pun berada, selalu ada orang yang memberi petunjuk, baik itu nabi maupun pewarisnya. Usai membeberkan bukti-bukti kemahakuasaan-Nya, pada ayat berikut Allah menjelaskan betapa luas ilmu yang dimiliki-Nya. Allah mengetahui apa yang dikandung oleh setiap perempuan berupa janin, baik terkait jenis kelaminnya, berat badan, maupun tinggi badannya kelak semenjak dalam kandungan. Allah juga mengetahui batas usia dan rezeki janin tersebut ketika kelak ia lahir dan tumbuh. Allah pun mengetahui apa yang kurang sempurna dari janin itu dan apa yang bertambah sehingga janin itu tumbuh dan berkembang dalam rahim. Dan segala sesuatu, baik yang ada dalam kandungan maupun tidak, pasti ada ukuran di sisi-Nya."
  }
]