[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengetahui apa yang dikandung setiap perempuan di dalam perutnya; apakah dia laki-laki atau perempuan, apakah dia celaka ataukah bahagia. Allah juga mengetahui apa yang kurang dari Rahim, dimana janin yang dikandung nya keguguran atau dilahirkan sebelum umur Sembilan bulan, serta apa yang lebih dari masa hamilnya. Dan segala sesuatu telah ditetapkan takdirnya di sisi Allah dengan ketentuan-ketentuan baik, kurang, maupun bertambah, yang tidak akan ia lewati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah mengetahui janin yang dikandung oleh setiap wanita hamil dalam rahimnya. Allah mengetahui segala sesuatu. Allah mengetahui apa yang terjadi di dalam kandungan berupa tambahan dan pengurangan, kesehatan dan cacatnya, segala sesuatu di sisi Allah telah ditentukan dengan kadar tertentu yang tidak bertambah dan tidak berkurang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Allah menyampaikan keluasan ilmu-Nya mengenai segala kejadian dan rahasia: Allah mengetahui segala keadaan kandungan seorang wanita mengenai anaknya laki-laki atau perempuan, dan akan menjadi orang yang bahagia atau sengsara; dan mengetahui apa yang mengurangi kandungan dengan gugurnya janin yang ada dalam rahim sebelum penuh sembilan bulan, dan apa yang bertambah pada kandungan setelah mencapai sembilan bulan atau dengan bertambahnya jumlah janin menjadi kembar dua atau lebih. Segala sesuatu di sisi Allah telah diketahui kadarnya dan ditetapkan waktunya. Allah Maha Mengetahui apa yang tersembunyi dari makhluk dan yang nampak; Dia Maha Besar dalam Dzat, nama, dan sifat-sifat-Nya, dan Maha Tinggi dengan Dzat dan kekuasaan-Nya dari seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. اللهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنثَىٰ (Allah mengetahui apa yang dikandung oleh setiap perempuan) Dikandung dalam perutnya. Allah mengetahui apakah itu masih berupa embrio atau gumpalan darah, apakah laki-laki atau perempuan, rupawan atau tidak, akan hidup bahagia atau sengsara, atau dalam keadaan apa ia. وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ( dan kandungan rahim yang berkurang dan yang bertambah) Yakni penambahan ukuran rahim karena pertumbuhan kehamilan dari hari ke hari. Dan berkurang ukurannya dengan lahirnya bayi. Dan dalam kedua keadaan terdapat mukjizat. وَكُلُّ شَىْءٍ عِندَهُۥ بِمِقْدَارٍ(Dan segala sesuatu pada sisi-Nya ada ukurannya) Yakni ukuran yang telah ditentukan Allah; yakni Allah telah mengatur timbangan, ukuran, dan nasab yang telah ditetapkan yang berlaku diatas aturan yang terukur; diantara hal ini adalah bentuk janin, ukuran rahim, usia kehamilan dan masa haidh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Allah mengetahui apa yang dikandung wanita dalam rahimnya dari berbagai janin, sifatnya, kondisinya, umurnya dan lain-lain. Rahim itu tidak kurang dalam mengeluarkan anak, tidak mengurangi jangka waktu hamil, anggota tubuh, dan juga pengeluaran darah haid. Dan janin itu melewati fase-fase perkembangan hari demi hari. Dan setiap sesuatu di sisi Allah itu memiliki ukuran tertentu dan hubungan yang sudah ditentukan. Dan pengetahuan manusai tentang dua jenis janin yaitu laki-laki dan perempuan menggunakan analisis kimia atau seperti sinar X itu tidak bisa menganggu kewenangan Allah tentang pengetahuan perkara-perkara lain tentang kehamilan. Rahim itu memberikan pengaruh (pengurangan dan penambahan) bagi janin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah mengetahui apa yang dikandung oleh setiap perempuan dan apa yang berkurang pada rahim dan apa yang bertambah} apa yang berkurang pada rahim dan apa yang bertambah dalam hal bagian tubuh, ukuran dan jumlahnya {Segala sesuatu ada ketentuan di sisiNya} ada takaran dan batasan yang tidak dilewati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. Allah memberitahukan tentang cakupan ilmuNya yang merata dan luasnya pengetahuan dan penguasaanNya yang meliputi segala sesuatu, Dia berfirman, “Allah mengetahui apa yang dikandung oleh setiap perempuan,” baik pada kalangan anak Adam dan lainnya “dan kandungan Rahim yang kurang sempurna,” yang mengalami penyusutan apa yang ada di dalamnya, baik kandungannya rusak atau mengecil ataupun mengerut, “dan (kandungan Rahim) yang bertambah,” pada Rahim-rahim wanita, dan (proses) besarnya janin di dalamnya. “Dan segala sesuatu pada sisiNya ada ukurannya,” tidak maju maupun mundur, tidak bertambah ataupun berkurang kecuali berdasarkan tuntutan hikmah dan ilmuNya. Maka sesungguhnya Allah \"mahamengetahui segala yang ghaib dan Nampak dan maha besar\" pada dzat-nya. Nama dan sifat Nya, \"yang maha tinggi\" atas seluruh makhlukNya dengan dzat, kekuasaan dan kekuatanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَا تَحۡمِلُ كُلُّ أُنثَىٰ) maa tahmilu kullu untsaa : yang mereka kandung, baik itu laki-laki ataupun perempuan, satu atau lebih, putih atau coklat. (وَمَا تَغِيضُ ٱلۡأَرۡحَامُ) wa taghiidhul arhaam : darah haidh yang berkurang dan darah yang bertambah. Makna ayat : Firman-Nya : (ٱللَّهُ يَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ) Allah mengetahui apa yang dikandung oleh setiap wanita, baik itu laki-laki atau perempuan, jumlahnya satu atau dua, putih atau coklat, bahagia atau sengsara. Firman-Nya : (وَمَا تَغِيضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ) dan mengetahui apa yang berkurang dari rahim berupa darah haid dan apa yang bertambah darinya, karena berkurangnya darah tersebut dikarenakan masa kehamilan, dan akan bertambah selama fase kehamilan, sehingga terkadang mencapai satu tahun atau lebih. Firman-Nya : (وَكُلُّ شَيۡءٍ عِندَهُۥ بِمِقۡدَارٍ) segala sesuatu berada dibawah hukum, keputusan, pengaturan-Nya sesuai dengan kadar tertentu, tidak ada yang lebih atau kurang dalam dzat, sifat, keadaan, waktu, dan tempat. Pelajaran dari ayat : • Keagungan kekuasaan Allah dan keluasan ilmu-Nya. • Penetapan akidah qadha dan qadar (takdir)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 8: Allah Subhaanahu wa Ta'aala menerangkan tentang pengetahuan-Nya yang mencakup segalanya dan meliputinya. Apakah bayinya laki-laki atau perempuan, kembar atau tidak, dsb. Dari waktu hamil atau berkurang dalam arti kandungan itu binasa, menciut atau mati. Tidak maju dan tidak mundur, tidak bertambah dan tidak berkurang melainkan sesuai yang dikehendaki hikmah dan ilmu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 8",
    "description": "Usai membeberkan bukti-bukti kemahakuasaan-Nya, pada ayat berikut Allah menjelaskan betapa luas ilmu yang dimiliki-Nya. Allah mengetahui apa yang dikandung oleh setiap perempuan berupa janin, baik terkait jenis kelaminnya, berat badan, maupun tinggi badannya kelak semenjak dalam kandungan. Allah juga mengetahui batas usia dan rezeki janin tersebut ketika kelak ia lahir dan tumbuh. Allah pun mengetahui apa yang kurang sempurna dari janin itu dan apa yang bertambah sehingga janin itu tumbuh dan berkembang dalam rahim. Dan segala sesuatu, baik yang ada dalam kandungan maupun tidak, pasti ada ukuran di sisi-Nya. Allah adalah tuhan yang maha mengetahui semua yang gaib dan yang nyata; dia adalah tuhan yang mahabesar, mahatinggi."
  }
]