[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah maha mengetahui apa-apa yang samar dari pandangan mata (manusia) dan juga apa-apa yanag (nyata), yang Maha besar DzatNya, Nama-nama dan sifat-sifatNya, yang juga mahatinggi di atas semua makhlukNya dengan Dzat, kuasa dan kekuasaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Karena Allah -Subḥānahu- mengetahui apa yang gaib dari panca indra manusia, dan mengetahui apa yang diketahui oleh indra mereka, Mahagung pada sifat-sifat, nama-nama dan perbuatan-perbuatan-Nya, Mahatinggi atas seluruh makhluk dengan Zat dan sifat-sifat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. عٰلِمُ الْغَيْبِ وَالشَّهٰدَةِ (Yang mengetahui semua yang ghaib dan yang nampak) Maha Mengetahui segala yang ghaib dan segala yang nampak, atau segala yang tidak ada dan yang ada. الْكَبِيرُ الْمُتَعَالِ(Yang Maha Besar lagi Maha Tinggi) Yang Maha Agung, diatas segala sesuatu dengan kuasa dan kebesaran-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah SWT adalah Dzat yang Maha Mengetahui perkara yang tampak dan perkara ghaib yang tidak dapat dilihat, Maha Agung urursanNya dan Maha Tinggi atas segala sesuatu dengan kuasa dan kewenanganNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat yang mengetahui semua yang gaib dan yang nyata. Dzat Yang Maha besar lagi Maha tinggi} Dzat yang Maha tinggi atas segala sesuatu dengan Dzaat dan segala sifatNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. Allah memberitahukan tentang cakupan ilmuNya yang merata dan luasnya pengetahuan dan penguasaanNya yang meliputi segala sesuatu, Dia berfirman, “Allah mengetahui apa yang dikandung oleh setiap perempuan,” baik pada kalangan anak Adam dan lainnya “dan kandungan Rahim yang kurang sempurna,” yang mengalami penyusutan apa yang ada di dalamnya, baik kandungannya rusak atau mengecil ataupun mengerut, “dan (kandungan Rahim) yang bertambah,” pada Rahim-rahim wanita, dan (proses) besarnya janin di dalamnya. “Dan segala sesuatu pada sisiNya ada ukurannya,” tidak maju maupun mundur, tidak bertambah ataupun berkurang kecuali berdasarkan tuntutan hikmah dan ilmuNya. Maka sesungguhnya Allah \"mahamengetahui segala yang ghaib dan Nampak dan maha besar\" pada dzat-nya. Nama dan sifat Nya, \"yang maha tinggi\" atas seluruh makhlukNya dengan dzat, kekuasaan dan kekuatanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ) segala sesuatu berupa ciptaan yang tidak tampak dan yang bisa dilihat . yaitu: Maha Mengetahui segala sesuatu. Firman-Nya : (ٱلۡكَبِيرُ ٱلۡمُتَعَالِ) Yang tidak ada lebih besar dari-Nya, setiap yang besar dihadapan-Nya adalah kecil, Maha Tinggi dari makhluk-Nya, Maha Suci dari sekutu, peniru, istri, dan anak, inilah Allah, dan inilah sifat-sifat-Nya, maka apakah seorang yang berakal akan menolak hak-Nya untuk hanya beribadah kepada-Nya? Apakah pantas orang yang berakal mengingkari wahyu-Nya kepada yang Dia kehendaki dari para hamba-Nya? Apakah pantas seorang yang berakal mengingkari Dzat yang memiliki kemampuan dan ilmu yang seperti ini untuk menghidupkan manusia setelah mereka mati untuk bertanya tentang penghasilan mereka, menghisab mereka, dan membalas mereka? Sekali-kali tidak, jadi orang-orang yang mengingkari Allah; apa yang diserukan kepada mereka berupa iman kepada-Nya, tidak dihitung sebagai orang berakal, sekalipun mereka terbang di langit atau menyelam di air."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Ar-Ra’d ayat 9: Baik dzat-Nya, nama-Nya maupun sifat-Nya. Di atas seluruh makhluk-Nya, baik dzat-Nya, kedudukan dan kekuasaan-Nya, serta tinggi dari semua sifat kekurangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ar-Ra’d Ayat 9",
    "description": "Allah adalah tuhan yang maha mengetahui semua yang gaib dan yang nyata; dia adalah tuhan yang mahabesar, mahatinggi. Karena dia mengetahui yang gaib dan yang nyata, maka sama saja bagi Allah, siapa di antaramu yang mencoba merahasiakan ucapannya sehingga tidak diketahui orang lain, dan siapa yang berterus terang dengan ucapan-Nya; dan sama mudahnya bagi-Nya untuk tahu siapa di antara kamu yang bersembunyi pada malam hari sehingga tidak diketahui orang lain, dan yang berjalan pada siang hari sehingga disaksikan orang lain."
  }
]