[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan angin saat ia bertiup terus-menerus, sebagian menyusul sebagian lainnya, juga dengan angin yang bertiup kencang yang membinasakan, juga dengan para malaikat yang bertugas mengurus awan, mereka menggiringnya sebagaimana mereka kehendaki, juga dengan para malaikat yang menerima wahyu dari Allah dengan urusan yang memisahkan antara yang haq dengan yang batil, yang halal dengan haram, juga dengan para malaikat yang menerima wahyu dari Allah dan membawanya turun kepada nabi-nabiNya, sebagai penegakkan hujjah dari Allah atas makhlukNya dan peringatanNya kepada mereka, agar mereka tidak lagi bisa beralasan, bahwa apa yang dijanjikan kepada kalian, yaitu Hari Kiamat berikut perhitungan amal dan balasannya adalah haq, pasti terjadi pada kalian, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan angin yang beriringan seperti barisan kuda."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah bersumpah dengan angin yang berhembus lembut yang mendatangkan berbagai manfaat bagi makhluk lain. Dan Allah bersumpah dengan angin yang berhembus kencang yang membinasakan orang-orang yang mendustakan dan mendatangkan kehancuran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالْمُرْسَلٰتِ عُرْفًا (Demi malaikat-malaikat yang diutus untuk membawa kebaikan) Dari ayat ini hingga ayat kelima: (فَالْمُلْقِيٰتِ ذِكْرًا) adalah sumpah Allah dengan para malaikat yang Allah utus untuk menyampaikan wahyu kepada para Nabi. Para malaikat itu menimbulkan angin kencang karena mereka terbang dengan kencang, dan mengembangkan sayap mereka untuk datang membawa sesuatu yang dapat membedakan antara kebenaran dan kebatilan, serta halal dan haram, hingga mereka menyampaikan wahyu kepada para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku (Allah) bersumpah demi angin yang berhembus terus. Angin yang memiliki tiupan yang kuat dan gemuruh yang riuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi (angin) yang diutus untuk membawa kebaikan} Aku bersumpah demi angin ketika berhembus terus-menerus seperti hembusan kuda betina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Allah bersumpah atas kebangkitan dan pembalasan terhadap amal-amal. “Demi malaikat-malaikat yang diutus untuk membawa kebaikan,” mereka adalah para malaikat yang diutus Allah untuk masalah-masalah takdir dan pengaturan alam serta untuk masalah-masalah syariat dan wahyu kepada para RasulNya, “yang diutus untuk membawa kebaikan,” adalah salah satu kondisi dari para malaikat yang diutus untuk membawa kebaikan tadi, yaitu diutus untuk kebaikan, hikmah dan kemaslahatan, bukan diutus untuk kemungkaran dan perbuatan sia-sia. “Dan (malaikat-malaikat) yang terbang dengan kencangnya,” mereka juga para malaikat yang diutus oleh Allah. Allah menyebutkan sifatnya yang amat cepat melakukan perintahNya dan cepatnya mereka menunaikan perintah-perintah Allah seperti perintah agar angin bertiup kencang. Atau yang dimaksud dengan sangat kencang dalam ayat ini adalah angin yang berhembus dengan kencang. “Dan (malaikat-malaikat) yang menyebarkan (rahmat RabbNya) dengan seluas-luasnya.” Kemungkinan yang dimaksud adalah para malaikat yang menyebarkan segala sesuatu yang telah diatur untuk disebarkan. Atau yang dimaksud adalah mendung yang dikirim Allah untuk menghidupkan bumi setelah sebelumnya mati. “Dan (malaikat-malaikat) yang menyampaikan wahyu,” mereka adalah para malaikat yang menyampaikan perintah-perintah mulia berupa peringatan yang dengannya Allah merahmati para hambaNya. Allah mengingatkan manfaat dan kepentingan mereka di dalam peringatan itu yang disampaikan pada para rasulNya, “untuk menolak alasan-alasan atau memberi peringatan,” yakni untuk memberi alasan dan peringatan bagi manusia. Mengingatkan manusia akan berbagai hal mengerikan yang ada di hadapan mereka serta untuk menolak alasan-alasan mereka sehingga mereka tidak memiliki hujjah atas Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 1: Surat ini dibuka dengan berbagai macam sumpah, Allah bersumpah sesuai dengan keinginan-Nya yaitu dengan ciptaan-Nya, diri-Nya, dan sifat di antara sifat-sifat-Nya. Allah memulai dengan besumpah dengan angin yang membawa adzab bagi orang-orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah terhadap kebangkitan dan pembalasan terhadap amal dengan mursalaat ‘urfaa, yaitu para malaikat yang diutus Allah Ta’ala dengan membawa urusan qadari-Nya dan pengaturan-Nya terhadap alam serta dengan membawa urusan syar’i-Nya dan wahyu-Nya kepada para rasul-Nya. Sedangkan maksud ‘urfaa adalah keadaan mereka diutus, yakni mereka diutus dengan membawa ‘uruf (perkara yang baik), hikmah dan maslahat, bukan dengan membawa sesuatu yang mungkar dan main-main. Sebagian mufassir mengartikan, “Demi angin yang dikirim.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 1",
    "description": "1-2. Orang-orang kafir mendustakan janji dan ancaman Allah. Surah ini dimulai dengan sumpah Allah, demi malaikat-malaikat yang diutus untuk membawa kebaikan, dan demi malaikat-malaikat yang terbang dengan kencangnya, 1-2"
  }
]