[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-15. Manakala bintang-bintang dihapus dan cahayanya menghilang. Manakala langit terbelah. Manakala gunung-gunung terbang dan hancur sehingga ia seperti debu yang diterbangkan angin. Manakala waktu penetapan keputusan antara para rasul dengan umat-umat mereka ditetapkan, lalu dikatakan, “Hingga hari besar apakah para rasul itu ditunda?” ditunda hingga hari ditetapkannya keputusan di antara para makhluk. Adakah yang memberitahumu (wahai manusia) apa itu hari penetapan keputusan, berikut kesulitan dan kengeriannya? Kebinasaan besar pada hari itu bagi orang-orang yang mendustakan hari yang dijanjikan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan apabila gunung-gunung tercerabut dari tempatnya dan dihancurkan hingga menjadi debu,"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَإِذَا الْجِبَالُ نُسِفَتْ (dan apabila gunung-gunung telah dihancurkan menjadi debu) Yakni tercabut dari tempatnya dan terbang di udara, sehingga tempatnya menjadi tanah yang rata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10 Apabila langit telah terbuka dan terbelah. Apabila gunung telah berpindah dari tempatnya dan menjadi debu/pasir yang bertebaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{apabila gunung-gunung dihancurkan menjadi debu} dicabut dari tempatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-14. Bila sudah terjadi, terjadilah perubahan pada alam dan huru hara hebat yang menakutkan hati dan memperbesar bencana. Bintang-bintang lenyap bertaburan dan hilang dari tempatnya. Gunung bertebangan seperti debu yang ditaburkan. Gunung dan bumi menjadi datar sama sekali, tidak terlihat adanya gundukan dan tidak ada bukit. Itulah hari dimana “Rasul-rasul telah ditetapkan waktu (mereka),” dan disegerakan putusan antara mereka dan kaum mereka. Karena itu Allah berfirman, “Sampai hari apakah ditangguhkan (mengazab orang-orang kafir itu?” kata tanya ini untuk memperbesar, mengagungkan, dan membuat takut. Selanjutnya dijawab dengan FirmanNya, “Sampai hari keputusan,” antara manusia satu sama lain dan perhitungan amal mereka satu persatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 10: Dan jika gunung-gunung berterbangan dan menyebar dimana menjadi biji-bijian yang berhamburan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 10",
    "description": "10-11. Tidak hanya sampai di situ. Dan juga apabila gunung-gunung dihancurkan menjadi debu yang beterbangan, dan apabila rasul-rasul telah ditetapkan waktunya, untuk dimintai pertanggung jawaban akan tugas dan kesaksiannya. Dan ketika itu terjadilah awal masa jatuhnya siksa, dan ketika itu dikatakan juga kepada para rasul itu"
  }
]