[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-15. Manakala bintang-bintang dihapus dan cahayanya menghilang. Manakala langit terbelah. Manakala gunung-gunung terbang dan hancur sehingga ia seperti debu yang diterbangkan angin. Manakala waktu penetapan keputusan antara para rasul dengan umat-umat mereka ditetapkan, lalu dikatakan, “Hingga hari besar apakah para rasul itu ditunda?” ditunda hingga hari ditetapkannya keputusan di antara para makhluk. Adakah yang memberitahumu (wahai manusia) apa itu hari penetapan keputusan, berikut kesulitan dan kengeriannya? Kebinasaan besar pada hari itu bagi orang-orang yang mendustakan hari yang dijanjikan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Pada hari agung, yang ditangguhkan agar mereka bersaksi atas umat-umat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. لِأَىِّ يَوْمٍ أُجِّلَتْ ((Niscaya dikatakan kepada mereka:) “Sampai hari apakah ditangguhkan (mengazab orang-orang kafir itu)?”) Yakni sampai hari yang besar yang menakutkan bagi para makhluk karena kengeriannya ini Para rasul diberi batas waktu agar dapat mereka dapat berkumpul dan memberi kesaksian atas umat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sampai kapan lagi waktu para rasul untuk bersaksi atas umatnya ini ditangguhkan. Ayat ini bermaksud untuk mengancam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Sampai hari apakah ditangguhkan} sampai hari yang agung para utusan itu ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-14. Bila sudah terjadi, terjadilah perubahan pada alam dan huru hara hebat yang menakutkan hati dan memperbesar bencana. Bintang-bintang lenyap bertaburan dan hilang dari tempatnya. Gunung bertebangan seperti debu yang ditaburkan. Gunung dan bumi menjadi datar sama sekali, tidak terlihat adanya gundukan dan tidak ada bukit. Itulah hari dimana “Rasul-rasul telah ditetapkan waktu (mereka),” dan disegerakan putusan antara mereka dan kaum mereka. Karena itu Allah berfirman, “Sampai hari apakah ditangguhkan (mengazab orang-orang kafir itu?” kata tanya ini untuk memperbesar, mengagungkan, dan membuat takut. Selanjutnya dijawab dengan FirmanNya, “Sampai hari keputusan,” antara manusia satu sama lain dan perhitungan amal mereka satu persatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 12: Allah kemudian bertanya dengan pertanyaan agar supaya mereka (orang-orang kadir) sadar, Allah berkata : Inilah urusan yang dahulu didakwahkan oleh para Rasul, dimana dahulu didustakan oleh orang-orang kafir dan dibenarkan oleh orang-orang yang bertakwa, lalu sampai hari apakah akan ditangguhkan (untuk ditimpakan adzab bagi orang-orang kafir itu)?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat tanya ini adalah untuk memperbesar perkaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 12",
    "description": "12-14. Dan ketika itu terjadilah awal masa jatuhnya siksa, dan ketika itu dikatakan juga kepada para rasul itu, 'sampai hari apakah ditangguhkan azab orang-orang kafir itu'' sampai hari keputusan. Dan tahukah kamu apakah hari keputusan itu' sungguh dahsyat hari keputusan itu, tidak terjangkau nalar dan tidak juga terbayangkan oleh khayalan manusia"
  }
]