[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-15. Manakala bintang-bintang dihapus dan cahayanya menghilang. Manakala langit terbelah. Manakala gunung-gunung terbang dan hancur sehingga ia seperti debu yang diterbangkan angin. Manakala waktu penetapan keputusan antara para rasul dengan umat-umat mereka ditetapkan, lalu dikatakan, “Hingga hari besar apakah para rasul itu ditunda?” ditunda hingga hari ditetapkannya keputusan di antara para makhluk. Adakah yang memberitahumu (wahai manusia) apa itu hari penetapan keputusan, berikut kesulitan dan kengeriannya? Kebinasaan besar pada hari itu bagi orang-orang yang mendustakan hari yang dijanjikan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Kehancuran, siksa dan kerugian pada hari itu bagi para pendusta yang mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Celaka dan azab bagi mereka pada hari itu. Al wailu adalah ancaman terhadap kebinasaan bagi mereka yang mendustakan hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah} kecelakaan dan azab {pada hari itu bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Kemudian Allah mengancam orang yang mendustakan hari ini seraya berfirman, “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” yakni alangkah celakanya mereka, alangkah besar siksaan mereka dan alangkah buruknya tempat kembali mereka. Allah memberitahu mereka dan bersumpah pada mereka, tapi mereka tidak membenarkannya. Karena itulah mereka berhak mendapatkan siksaan berat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 15: Allah mengabarkan bahwasanya kecelakaanlah dan merugi serta sengsara pada hari kiamat ini bagi orang-orang kafir yang mendustakan Allah, Rasul-Nya dan kitab suci-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sungguh kecewa, rugi dan sangat besar azab serta sangat buruk tempat kembali mereka. Allah Subhaanahu wa Ta'aala telah memberitahukan mereka dan bersumpah untuk mereka, namun mereka tetap tidak mau membenarkan beritanya sehingga mereka berhak mendapatkan hukuman yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 15",
    "description": "Ketika hari keputusan itu telah tiba maka celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 16-17. Dahsyatnya kiamat yang dilukiskan pada ayat di atas mungkin belum bisa menyadarkan para pendurhaka, kini ditunjukkan kuasa Allah yang lebih konkrit. Bukankah telah kami binasakan generasi orang-orang yang dahulu karena keingkaran mereka' lalu kami juga akan susulkan azab kami terhadap orang-orang yang datang kemudian seperti terhadap kamu wahai kaum musyrik mekah, dan juga generasi pembangkang yang datang setelah kamu."
  }
]