[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-18. Bukankah Kami telah membinasakan umat-umat yang telah berlalu karena mereka mendustakan para rasul, seperti kaum Nuh, Ad dan Tsamud? Kemudian Kami menyusulkan orang-orang yang datang kemudian yang berbuat seperti yang mereka perbuat, yaitu mendustakan dan mendurhakai para rasul. Pembinasaan seperti ini yang telah Kami timpakan kepada orang-orang tersebut, Kami juga akan menimpakannya kepada orang-orang kafir Makkah, karena mereka juga mendustakan Rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Bukankah Kami telah membinasakan umat-umat terdahulu saat mereka kafir terhadap Allah dan mendustakan Rasul-rasul-Nya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-19. Allah menegaskan bahwa Dia telah membinasakan umat-umat terdahulu, seperti kaum Nabi Nuh, dan kaum ‘Ad; dan membinasakan kaum-kaum setelahnya yang sama-sama kafir dan mendustakan, seperti kaum Nabi Luth dan kaum Nabi Syuaib. Demikianlah Allah membinasakan seluruh orang yang kafir dan mengikuti jalan orang-orang yang jahat dan menentang kebenaran; mereka akan mendapat azab yang berat pada hari kiamat sebagai balasan atas kekafiran dan kejahatan mereka. Pada ayat ini terdapat ancaman dan peringatan dari azab Allah di dunia dan di akhirat bagi orang yang kafir dan tidak mengikuti kebenaran dan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. أَلَمْ نُهْلِكِ الْأَوَّلِينَ (Bukankah Kami telah membinasakan orang-orang yang dahulu?) Yakni orang-orang kafir dari umat-umat terdahulu sejak Nabi Adam sampai sebelum Nabi Muhammad. Yang dimaksud adalah dengan mengazab mereka di dunia saat mereka mendustakan para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Bukankah umat terdahulu sudah Kami binasakan, sebab mendustakan para rasul? Seperti kaum Nuh, Tsamud dan ‘Ad"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Kami telah membinasakan orang-orang yang dahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-19. Maknanya, bukankah Kami telah membinasakan para pendusta terdahulu kemudian Kami teruskan dengan membinasakan orang yang berdusta selanjutnya? Ini adalah ketetapan Allah dahulu dan selanjutnya bagi setiap pendosa. Orang berdosa pasti disiksa Allah, lantas mengapa kalian tidak mengambil pelajaran dari apa yang kalian lihat dan kalian dengar? “Kecelakaan besarlah pada hari itu bagi orang-orang yang mendustakan,” yakni setelah mereka menyaksikan tanda-tanda kebesaran Allah yang jelas, siksaan-siksaan, dan hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 16: 16-17. Kemudian Allah menujukan perkataannya kepada orang-orang musyrik yang mendustakan hari kebangkitan, Allah berkata : Bukankah kami telah membinasakan atas kaum yang terdahulu, yang mereka mendustakan Rasu-Rasul mereka, seperti kaum Nuh, Ad dan Tsamud. Kami juga akan menyertakan kaum yang belakangan dimana mereka mengikuti jalan orang-orang sebelum mereka dalam pendustaan dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mereka mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 16",
    "description": "16-17. Dahsyatnya kiamat yang dilukiskan pada ayat di atas mungkin belum bisa menyadarkan para pendurhaka, kini ditunjukkan kuasa Allah yang lebih konkrit. Bukankah telah kami binasakan generasi orang-orang yang dahulu karena keingkaran mereka' lalu kami juga akan susulkan azab kami terhadap orang-orang yang datang kemudian seperti terhadap kamu wahai kaum musyrik mekah, dan juga generasi pembangkang yang datang setelah kamu"
  }
]