[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "16-18. Bukankah Kami telah membinasakan umat-umat yang telah berlalu karena mereka mendustakan para rasul, seperti kaum Nuh, Ad dan Tsamud? Kemudian Kami menyusulkan orang-orang yang datang kemudian yang berbuat seperti yang mereka perbuat, yaitu mendustakan dan mendurhakai para rasul. Pembinasaan seperti ini yang telah Kami timpakan kepada orang-orang tersebut, Kami juga akan menimpakannya kepada orang-orang kafir Makkah, karena mereka juga mendustakan Rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sebagaimana kehancuran bagi umat-umat itu, Kami juga menghancurkan para pendosa dan orang-orang yang mendustakan apa yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sebagaimana perlakuan itu, akan Kami berlakukan seperti apa yang mereka durhakakan. Baik kafir maupun kesyirikan, di dunia dan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-19. Maknanya, bukankah Kami telah membinasakan para pendusta terdahulu kemudian Kami teruskan dengan membinasakan orang yang berdusta selanjutnya? Ini adalah ketetapan Allah dahulu dan selanjutnya bagi setiap pendosa. Orang berdosa pasti disiksa Allah, lantas mengapa kalian tidak mengambil pelajaran dari apa yang kalian lihat dan kalian dengar? “Kecelakaan besarlah pada hari itu bagi orang-orang yang mendustakan,” yakni setelah mereka menyaksikan tanda-tanda kebesaran Allah yang jelas, siksaan-siksaan, dan hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 18: Allah menyebutka bahwasanya dengan permisalan adzab yang keras ini, Allah menimpakan kepada mereka orang-orang yang bermaksiat dari kafir Mekkah; Karena sebab mereka mendustakan Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni demikianlah Kami perlakukan kepada setiap orang yang berdosa di masa mendatang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 18",
    "description": "18-19. Demikianlah yang akan terus terjadi, kami akan perlakukan orang-orang yang berdosa sesuai dengan ketetapan kami, kapan dan di mana pun. Maka celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]