[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19. Kebinasaan dan azab berat pada Hari Kiamat bagi setiap yang mendustakan bahwa Allah adalah satu-satunya Tuhan Yang Haq, Yang tidak ada sekutu bagiNya, juga mendustakan kenabian, kebangkitan dan perhitungan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Kehancuran, siksa dan kerugian pada hari itu bagi para pendusta yang mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kebinasaan dan azab pada hari kiamat bagi mereka yang mendustakan ayat Allah dan para nabinya dan hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah pada hari itu, bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-19. Maknanya, bukankah Kami telah membinasakan para pendusta terdahulu kemudian Kami teruskan dengan membinasakan orang yang berdusta selanjutnya? Ini adalah ketetapan Allah dahulu dan selanjutnya bagi setiap pendosa. Orang berdosa pasti disiksa Allah, lantas mengapa kalian tidak mengambil pelajaran dari apa yang kalian lihat dan kalian dengar? “Kecelakaan besarlah pada hari itu bagi orang-orang yang mendustakan,” yakni setelah mereka menyaksikan tanda-tanda kebesaran Allah yang jelas, siksaan-siksaan, dan hukuman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 19: Kemudian Allah mengancam orang-orang yang mendustakan hari kebangkitan, Allah berkata : Sungguh celaka dan merugi pada hari itu bagi orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah mereka (orang-orang yang mendustakan) itu menyaksikan ayat-ayat yang jelas dan bukti-buktinya, demikian juga mengetahui berbagai hukuman yang menimpa orang-orang terdahulu dan beberapa macam contoh siksaan yang menimpa generasi sebelum mereka, namun mereka tetap saja tidak mau beriman. Diulangi lagi kalimat di atas adalah untuk menguatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 19",
    "description": "18-19. Demikianlah yang akan terus terjadi, kami akan perlakukan orang-orang yang berdosa sesuai dengan ketetapan kami, kapan dan di mana pun. Maka celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 20-22. Setelah mengecam para pendurhaka, ayat-ayat berikut mengingatkan tentang kelemahan manusia dan bagaimana makhluk ini benar-benar berada dalam kendali-Nya. Bukankah kami menciptakan kamu dari air yang hina yaitu sperma, kemudian kami letakkan ia sperma tersebut setelah melalui proses yang telah ditetapkan, dalam tempat yang kokoh, yaitu rahim, sampai waktu dan tahap penciptaan yang ditentukan Allah, ."
  }
]