[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-23. Bukankah Kami telah menciptakan kalian (wahai orang-orang kafir) dari air yang lemah dan hina, yaitu sperma, lalu Kami meletakkan air ini pada tempat yang terjaga kokoh, yaitu rahim ibu hingga waktu yang ditentukan yang diketahui oleh Allah? Lalu Kami mampu menciptakan dan membentuknya serta mengeluarkannya. Maka sebaik-baik pihak yang kuasa adalah Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sampai pada masa tertentu, yaitu masa hamil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. إِلَىٰ قَدَرٍ مَّعْلُومٍ (sampai waktu yang ditentukan) Yaitu selama masa kehamilan, dan pada manusia adalah sembilan bulan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21-22. Kemudian Kami letakkan air mani itu dalam tempat yang kuat yaitu rahim, sampai waktu yang ditentukan yaitu waktu kehamilan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sampai waktu yang ditentukan} waktu yang ditentukan yaitu masa kehamilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-24. Maksudnya, bukankah Kami telah menciptakan kalian wahai anak cucu Adam, “dari air yang hina,” yaitu amat hina dina yang keluar di antara tulang sulbi dengan tulang rusuk hingga Allah meletakannya “dalam tempat yang kokoh (rahim),” yakni didalam rahim. Di tempat itu air mani menetap dan tumbuh, “sampai waktu yang ditentukan,” dan saat yang telah ditetapkan, “lalu Kami tentukan (bentuknya),” yakni Kami tentukan dan atur janin itu didalam kegelapan-kegelapan dan Kami rubah dari nutfah menjadi segumpal darah kemudian menjadi segumpal daging hingga Allah menjadikannya jasad dan meniupkan ruh padanya. Di antara mereka ada yang meninggal sebelum itu. “Maka Kami-lah sebaik-baik yang menentukan,” yakni DzatNya yang Suci dengan hal itu karena ketentuanNya sejalan dengan kebijaksanaanNya dan sesuai dengan pujian. “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” setelah jelas bagi mereka tanda-tanda kebesaran Allah dan setelah Allah memperlihatkan berbagai pelajaran dan penjelasan-penjelasan kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 22: 20-23. Allah memberikan nikmat atas makhluknya dengan menjadikannya wujud hidup di dunia. Allah berkata : Bukankah Kami yang menciptakan kalian wahai manusia dan jin, dari air yang lemah dan hina, yaitu air mani laki-laki ? Dan dengan kuasa Kami, Kami jadikan air mani ini bertempat di tempat yang terjaga, yaitu rahim yang ada di tubuh wanita yang terjaga dari empat penjuru. Kemudian menetap air ini di dalam rahim perempuan sampai waktu yang ditentukan sesuai ilmu Allah. Kemudian Allah memuji dzat-Nya karena Allah yang memiliki segala sesuatunya dengan berkata : Sesungguhnya Kami yang menyusun makhluk ini yang terdapat di dalam rahim perempuan dengan sebaik-baik rupa dan keadaannya, maka nikmat atas sesuatu yang Allah takdirkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu waktu kelahiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 22",
    "description": "20-22. Setelah mengecam para pendurhaka, ayat-ayat berikut mengingatkan tentang kelemahan manusia dan bagaimana makhluk ini benar-benar berada dalam kendali-Nya. Bukankah kami menciptakan kamu dari air yang hina yaitu sperma, kemudian kami letakkan ia sperma tersebut setelah melalui proses yang telah ditetapkan, dalam tempat yang kokoh, yaitu rahim, sampai waktu dan tahap penciptaan yang ditentukan Allah, 23-24. Lalu kami tentukan bentuknya serta masa kelahirannya, maka kamilah sebaik-baik yang menentukan bentuk setiap makhluk. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran."
  }
]