[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan Kuasa Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Kehancuran, siksa dan kerugian pada hari itu untuk para pendusta yang mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Celaka dan azab bagi yang mendustakan hari kiamat kekuasan Kami atas makhluk, hari kebangkitan dan pengembalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Celakalah pada hari itu, bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20-24. Maksudnya, bukankah Kami telah menciptakan kalian wahai anak cucu Adam, “dari air yang hina,” yaitu amat hina dina yang keluar di antara tulang sulbi dengan tulang rusuk hingga Allah meletakannya “dalam tempat yang kokoh (rahim),” yakni didalam rahim. Di tempat itu air mani menetap dan tumbuh, “sampai waktu yang ditentukan,” dan saat yang telah ditetapkan, “lalu Kami tentukan (bentuknya),” yakni Kami tentukan dan atur janin itu didalam kegelapan-kegelapan dan Kami rubah dari nutfah menjadi segumpal darah kemudian menjadi segumpal daging hingga Allah menjadikannya jasad dan meniupkan ruh padanya. Di antara mereka ada yang meninggal sebelum itu. “Maka Kami-lah sebaik-baik yang menentukan,” yakni DzatNya yang Suci dengan hal itu karena ketentuanNya sejalan dengan kebijaksanaanNya dan sesuai dengan pujian. “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” setelah jelas bagi mereka tanda-tanda kebesaran Allah dan setelah Allah memperlihatkan berbagai pelajaran dan penjelasan-penjelasan kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 24: Allah mengancam para pendusta yang mendustakan hari kebangkitan dengan berkata : Sungguh (mereka) akan celaka dan merugi pada hari ini yaitu orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menerangkan kepada mereka ayat-ayat-Nya, memperlihatkan berbagai ibrah (pelajaran) dan bukti-bukti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 24",
    "description": "23-24. Lalu kami tentukan bentuknya serta masa kelahirannya, maka kamilah sebaik-baik yang menentukan bentuk setiap makhluk. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 25-26. Nikmat penciptaan manusia telah diuraikan, kini nikmat lain yang diberikan kepada manusia yaitu tempat kediaman di bumi yang nyaman untuk ditinggali. Bukankah kami jadikan bumi untuk tempat berkumpul, bagi yang masih hidup di permukaan bumi mereka berkeliaran, dan di perut bumi makhluk yang sudah mati itu dikuburkan'."
  }
]