[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-27. Bukankah Kami telah menjadikan bumi yang kalian hidup di atasnya, permukaanya dihuni oleh makhluk hidup yang tidak terhitung, sedangkan perutnya menyimpan makhluk mati yang tidak terhitung juga? Kami juga menciptakan gunung-gunung yang kokoh dan menjulang tinggi agar bumi tidak guncang dan Kami memberi kalian minum air yang tawar dan nikmat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Bukankah Kami telah menjadikan bumi tempat berkumpulnya manusia semua,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-28. Allah menjadikan bumi siap dihuni oleh manusia, untuk hidup di atasnya dan dikubur di dalamnya; ia bagaikan induk bagi seluruh manusia, permukaannya untuk mereka yang hidup dan perutnya untuk mereka yang telah mati. Dan Allah menciptakan di bumi gunung-gunung yang menjulang tinggi yang menjaganya agar tidak bergoncang, ia adalah pasak bagi bumi. Dan Allah menciptakan air tawar di bumi sebagai minuman manusia, untuk menyirami tanaman, dan untuk berbagai manfaat lainnya. Kalaulah bukan karena air, niscaya manusia akan binasa dan kehidupan di bumi akan sirna. Dan di akhirat terdapat azab yang berat bagi orang yang mengingkari Allah dan mendustakan para Rasul-Nya, padahal dia telah mendapatkan banyak kenikmatan, dan telah melihat tanda-tanda kekuasaan yang ada disekitarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25-26. أَحْيَآءً وَأَمْوٰتًا أَلَمْ نَجْعَلِ الْأَرْضَ كِفَاتًا (Bukankah Kami menjadikan bumi (tempat) berkumpul, orang-orang hidup dan orang-orang mati?) Yakni sebagai tempat tinggal bagi kalian, di permukaan bumi ketika kalian hidup dan di dalam tanah ketika kalian telah mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Bukankah Kami jadikan bumi sebagai tempat berkumpul bagi mereka. Kifatun adalah bentuk masdar yang dimaksudkan sebagai bentuk isim fa’il"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Kami jadikan bumi untuk berkumpul} diisi oleh semua manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-28. Maknanya, bukankah Kami telah memberi kalian karunia dan nikmat berupa ditundukannya bumi demi kemaslahatan kalian lalu Kami menjadikannya, “(tempat) berkumpul,” bagi kalian semua, “orang-orang hidup,” di bumi “dan orang-orang mati,” di dalam kubur. Sebagaimana rumah dan istana merupakan salah satu nikmat dan karunia yang diberikan Allah pada hamba-hambaNya, kuburan juga merupakan rahmat bagi mereka dan sebagai pelindung agar jasad mereka tidak dimakan oleh binatang buas dan lainnya. “Dan Kami jadikan padanya gunung-gunung yang tinggi,” yakni gunung tinggi melebihi bumi agar tidak goncang bersama penghuninya. Allah mengokohkan bumi dengan gunung-gunung yang tinggi dan membentang. “Dan kami beri minum kamu dengan air tawar,” yaitu air yang enak dikonsumsi (yang tidak asin). Allah berfirman, “Maka terangkanlah kepadaku tentang air yang kamu minum. Kamukah yang menurunkannya atau Kamikah yang menurunkannya? Kalau Kami kehendaki, niscaya Kami jadikan dia asin, maka mengapakah kamu tidak bersyukur? -Al-Waqiah:68-70- “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” padahal Allah telah memperlihatkan berbagai nikmat pada mereka yang dikhususkan pada mereka, tapi mereka justru membalasnya dengan mendustakan (nya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 25: 25-27. Kemudian Allah berhujjah dengan kejadian yang akan terjadi di hari kebangkitan dengan bukti-bukti yang lain, Allah berkata : Bukankah kami yang menjadikan bumi ini, yang kalian hidup di atasnya, sebagaimana seorang ibu yang mengandung anak di perutnya. Kalian dibiarkan hidup berkumpul di atas tanahnya dan mati di dalam kubur (tanahnya). Sebagian ahli tafsir kontemporer berkata : Maksud dari ayat ini adalah gravitasi bumi, maka maknanya adalah : Bukankah kami yang menjadikan gravitasi bumi bagi kalian agar kalian dapat hidup di atasnya (di atas bumi), kemudian kalian mati tergeletak di dalam kubur menjadi mayat-mayat. Kemudian Allah berkata : Kami jadikan di bumi gunung-gunung yang tertancap di kedalaman bumi dan puncaknya menjulang tinggi, (semua itu) sebagai pasak bagi bumi agar kalian tidak bergoncang. Dan kami alirkan air tawar yang mengalir yang mudah untuk diminum bagi siapapun yang meminumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bukankah Kami telah memberimu nikmat dengan menundukkan bumi untuk maslahat kamu; Kami jadikan bumi itu sebagai tempat berkumpul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 25",
    "description": "25-26. Nikmat penciptaan manusia telah diuraikan, kini nikmat lain yang diberikan kepada manusia yaitu tempat kediaman di bumi yang nyaman untuk ditinggali. Bukankah kami jadikan bumi untuk tempat berkumpul, bagi yang masih hidup di permukaan bumi mereka berkeliaran, dan di perut bumi makhluk yang sudah mati itu dikuburkan'25-26"
  }
]