[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-27. Bukankah Kami telah menjadikan bumi yang kalian hidup di atasnya, permukaanya dihuni oleh makhluk hidup yang tidak terhitung, sedangkan perutnya menyimpan makhluk mati yang tidak terhitung juga? Kami juga menciptakan gunung-gunung yang kokoh dan menjulang tinggi agar bumi tidak guncang dan Kami memberi kalian minum air yang tawar dan nikmat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Yang menghimpun orang-orang yang masih hidup dari mereka dengan menempati dan membangunnya, dan orang-orang yang telah meninggal dari mereka dengan dikubur di dalamnya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Yang masih hidup di atasnya, dan yang mati terpendam di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bagi yang masih hidup dan yang sudah mati} yang hidup di atas permukaan bumi dan mati terkubur di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-28. Maknanya, bukankah Kami telah memberi kalian karunia dan nikmat berupa ditundukannya bumi demi kemaslahatan kalian lalu Kami menjadikannya, “(tempat) berkumpul,” bagi kalian semua, “orang-orang hidup,” di bumi “dan orang-orang mati,” di dalam kubur. Sebagaimana rumah dan istana merupakan salah satu nikmat dan karunia yang diberikan Allah pada hamba-hambaNya, kuburan juga merupakan rahmat bagi mereka dan sebagai pelindung agar jasad mereka tidak dimakan oleh binatang buas dan lainnya. “Dan Kami jadikan padanya gunung-gunung yang tinggi,” yakni gunung tinggi melebihi bumi agar tidak goncang bersama penghuninya. Allah mengokohkan bumi dengan gunung-gunung yang tinggi dan membentang. “Dan kami beri minum kamu dengan air tawar,” yaitu air yang enak dikonsumsi (yang tidak asin). Allah berfirman, “Maka terangkanlah kepadaku tentang air yang kamu minum. Kamukah yang menurunkannya atau Kamikah yang menurunkannya? Kalau Kami kehendaki, niscaya Kami jadikan dia asin, maka mengapakah kamu tidak bersyukur? -Al-Waqiah:68-70- “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” padahal Allah telah memperlihatkan berbagai nikmat pada mereka yang dikhususkan pada mereka, tapi mereka justru membalasnya dengan mendustakan (nya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 26: 25-27. Kemudian Allah berhujjah dengan kejadian yang akan terjadi di hari kebangkitan dengan bukti-bukti yang lain, Allah berkata : Bukankah kami yang menjadikan bumi ini, yang kalian hidup di atasnya, sebagaimana seorang ibu yang mengandung anak di perutnya. Kalian dibiarkan hidup berkumpul di atas tanahnya dan mati di dalam kubur (tanahnya). Sebagian ahli tafsir kontemporer berkata : Maksud dari ayat ini adalah gravitasi bumi, maka maknanya adalah : Bukankah kami yang menjadikan gravitasi bumi bagi kalian agar kalian dapat hidup di atasnya (di atas bumi), kemudian kalian mati tergeletak di dalam kubur menjadi mayat-mayat. Kemudian Allah berkata : Kami jadikan di bumi gunung-gunung yang tertancap di kedalaman bumi dan puncaknya menjulang tinggi, (semua itu) sebagai pasak bagi bumi agar kalian tidak bergoncang. Dan kami alirkan air tawar yang mengalir yang mudah untuk diminum bagi siapapun yang meminumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bumi mengumpulkan orang-orang hidup di permukaannya dan orang-orang mati dalam perutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 26",
    "description": "25-26. Nikmat penciptaan manusia telah diuraikan, kini nikmat lain yang diberikan kepada manusia yaitu tempat kediaman di bumi yang nyaman untuk ditinggali. Bukankah kami jadikan bumi untuk tempat berkumpul, bagi yang masih hidup di permukaan bumi mereka berkeliaran, dan di perut bumi makhluk yang sudah mati itu dikuburkan'27-28. Dan di samping nikmat di atas kami juga jadikan padanya gunung-gunung yang tinggi lagi kokoh, sehingga menjadikan bumi tetap stabil, dan kami beri minum kamu dengan air tawar' celakalah pada hari itu, bagi mereka yang mendustakan kebenaran."
  }
]