[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-27. Bukankah Kami telah menjadikan bumi yang kalian hidup di atasnya, permukaanya dihuni oleh makhluk hidup yang tidak terhitung, sedangkan perutnya menyimpan makhluk mati yang tidak terhitung juga? Kami juga menciptakan gunung-gunung yang kokoh dan menjulang tinggi agar bumi tidak guncang dan Kami memberi kalian minum air yang tawar dan nikmat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan Kami jadikan di bumi itu gunung-gunung yang teguh guna mencegah bumi bergoncang dan gunung-gunung yang tinggi, dan Kami beri kalian -wahai manusia- minuman dari air yang segar. Maka Żat Yang menciptakan hal itu tidaklah sulit bagi-Nya untuk membangkitkan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَأَسْقَيْنٰكُم مَّآءً فُرَاتًا (dan Kami beri minum kamu dengan air tawar?) Yakni ait yang tawar. Dan ini semua adalah hal yang lebih mengherankan daripada kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kami telah menjadikan gunung-gunung tinggi di atas bumi, dan Kami memberi kalian minum dari air tawar. Ini semua adalah suatu yang lebih menakjubkan jika dibandingkan membangkitkan yang telah mati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan Kami jadikan padanya gunung-gunung} gunung-gunung yang meneguhkan {yang tinggi} yang tinggi {dan Kami memberi minum kalian dengan air tawar} tawar"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 27: 25-27. Kemudian Allah berhujjah dengan kejadian yang akan terjadi di hari kebangkitan dengan bukti-bukti yang lain, Allah berkata : Bukankah kami yang menjadikan bumi ini, yang kalian hidup di atasnya, sebagaimana seorang ibu yang mengandung anak di perutnya. Kalian dibiarkan hidup berkumpul di atas tanahnya dan mati di dalam kubur (tanahnya). Sebagian ahli tafsir kontemporer berkata : Maksud dari ayat ini adalah gravitasi bumi, maka maknanya adalah : Bukankah kami yang menjadikan gravitasi bumi bagi kalian agar kalian dapat hidup di atasnya (di atas bumi), kemudian kalian mati tergeletak di dalam kubur menjadi mayat-mayat. Kemudian Allah berkata : Kami jadikan di bumi gunung-gunung yang tertancap di kedalaman bumi dan puncaknya menjulang tinggi, (semua itu) sebagai pasak bagi bumi agar kalian tidak bergoncang. Dan kami alirkan air tawar yang mengalir yang mudah untuk diminum bagi siapapun yang meminumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar bumi tidak mengguncang penghuninya, maka Allah Subhaanahu wa Ta'aala mengokohkannya dengan gunung-gunung yang teguh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 27",
    "description": "27-28. Dan di samping nikmat di atas kami juga jadikan padanya gunung-gunung yang tinggi lagi kokoh, sehingga menjadikan bumi tetap stabil, dan kami beri minum kamu dengan air tawar' celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]