[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan nikmat-nikmat ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kehancuran, siksa dan kerugian pada hari itu untuk para pendusta yang mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Celaka dan azab, bagi mereka yang mendustakan nikmat yang Kami berikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Celakalah pada hari itu, bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-28. Maknanya, bukankah Kami telah memberi kalian karunia dan nikmat berupa ditundukannya bumi demi kemaslahatan kalian lalu Kami menjadikannya, “(tempat) berkumpul,” bagi kalian semua, “orang-orang hidup,” di bumi “dan orang-orang mati,” di dalam kubur. Sebagaimana rumah dan istana merupakan salah satu nikmat dan karunia yang diberikan Allah pada hamba-hambaNya, kuburan juga merupakan rahmat bagi mereka dan sebagai pelindung agar jasad mereka tidak dimakan oleh binatang buas dan lainnya. “Dan Kami jadikan padanya gunung-gunung yang tinggi,” yakni gunung tinggi melebihi bumi agar tidak goncang bersama penghuninya. Allah mengokohkan bumi dengan gunung-gunung yang tinggi dan membentang. “Dan kami beri minum kamu dengan air tawar,” yaitu air yang enak dikonsumsi (yang tidak asin). Allah berfirman, “Maka terangkanlah kepadaku tentang air yang kamu minum. Kamukah yang menurunkannya atau Kamikah yang menurunkannya? Kalau Kami kehendaki, niscaya Kami jadikan dia asin, maka mengapakah kamu tidak bersyukur? -Al-Waqiah:68-70- “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,” padahal Allah telah memperlihatkan berbagai nikmat pada mereka yang dikhususkan pada mereka, tapi mereka justru membalasnya dengan mendustakan (nya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 28: Allah mengancam orang-orang yang mendustakan hari kebangkitan dengan berkata : Sungguh (mereka) akan celaka dan merugi pada hari ini yaitu orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memperlihatkan kepada mereka berbagai nikmat yang diberikan-Nya, namun mereka (orang-orang yang mendustakan) masih saja menyikapinya dengan mendustakan, sehingga pantaslah jika mereka mendapatkan kecelakaan yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 28",
    "description": "27-28. Dan di samping nikmat di atas kami juga jadikan padanya gunung-gunung yang tinggi lagi kokoh, sehingga menjadikan bumi tetap stabil, dan kami beri minum kamu dengan air tawar' celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 29-31. Pada bagian terdahulu dijelaskan tentang ancaman Allah kepada yang durhaka. Kelompok ayat ini menerangkan sekelumit ancaman tersebut nanti di akhirat. Akan dikatakan kepada mereka, 'pergilah kamu wahai para pendurhaka, mendapatkan apa azab yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan asap api neraka yang mempunyai tiga cabang, yang tidak melindungi yaitu tidak menaungi dari panasnya api neraka, dan tidak pula menolak jilatan nyala api neraka yang sangat panas. '."
  }
]