[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-33. Dikatakan kepada orang-orang kafir pada Hari Kiamat, “Berjalanlah kepada azab Jahanam yang dulu kalian dustakan di dunia, berjalanlah dan bernaunglah di bawah asap api Neraka Jahanam yang bercabang tiga, naungan itu tidak melindungi dari panas api yang menyala-nyala sedikit pun.” Sesungguhnya Neraka Jahanam melemparkan percikan-percikan api yang besar, setiap percikannya seperti bangunan tinggi menjulang. Percikan-percikan Jahanam yang beterbangan ini laksana unta hitam yang kekuning-kuningan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan dikatakan kepada orang-orang yang mendustakan apa yang dibawa oleh para Rasul mereka, “Pergilah kalian -wahai para pendusta- menuju siksa yang dulu pernah kalian dustakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-31. Ayat-ayat ini membahas tentang sebagian peristiwa pada hari kiamat; Allah mengolok orang-orang yang mendustakan hari kiamat: Pergilah kalian ke dalam neraka Jahannam, yang bayangan dari asapnya akan terpencar ke tiga arah sehingga tidak dapat digunakan sebagai naungan untuk melindungi diri dari kobaran api Jahannam. Allah menyebutnya naungan sebagai olokan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. انطَلِقُوٓا۟ إِلَىٰ مَا كُنتُم بِهِۦ تُكَذِّبُونَ (“Pergilah kamu mendapatkan azab yang dahulunya kamu mendustakannya) Akan dikatakan kepada mereka: “pergilah kepada azab yang dahulu kalian dustakan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Para penjaga Jahannam berkata kepada mereka: Jalanlah kalian wahai manusia, menuju azab kalian sebab dusta kalian sendiri atas nikmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Pergilah menuju apa yang dahulu kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-34. Inilah salah satu kecelakaan yang disediakan untuk para pendosa. Pada Hari Kiamat dikatakan pada mereka, “Pergilah kamu mendapatkan azab yang dahulunya kamu mendustakannya.” Hal itu dijelaskan dengan FirmanNya, “Pergilah kamu mendapatkan naungan yang mempunyai tiga cabang,” yakni dalam naungan Neraka Jahanam yang di sela-selanya terkenal ada tiga cabang, yaitu bagian-bagian dari neraka yang saling mempergilir dan menyatu dengannya. “Yang tidak melindungi,” yakni naungan tersebut, artinya pada naungan tersebut tidak ada kenyamanan dan tidak ada ketenangan, “dan tidak pula menolak,” untuk menghindarkan orang yang tinggal di dalamnya, “dari nyala api neraka,” bahkan nyala api meliputinya dari sisi kiri dan kanan serta dari segala penjuru. Seperti yang disebutkan dalam Firman Allah, “Bagi mereka lapisan-lapisan dari api di atas mereka dan di bawah merekapun lapisan-lapisan (dari api). Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu. Maka bertakwalah kepada-Ku hai hamba-hamba-Ku.” -Az-Zumar:16- “Mereka mempunyai tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim” -Al-A’raf:41- Selanjutnya Allah menyebutkan besarnya kobaran api yang menunjukkan besar dan ngerinya api neraka serta buruknya pemandangan seraya berfirman, “Sesungguhnya neraka itu melontarkan bunga api sebesar dan setinggi istana, seolah-olah ia iringan unta yang kuning,” yakni warna hitam yang berubah menjadi kekuning-kuningan. Hal ini menunjukkan bahwa kobaran, bara, dan bunga api neraka gelap. Api neraka berwarna hitam, buruk di pandangan mata dan amat panas. Semoga Allah menyelamatkan kita dari neraka serta dari perbuatan-perbuatan yang mendekatkan ke neraka. “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 29: 29-33. Allah mengabarkan tempat kembali mereka yaitu orang-orang yang mendustakan, Allah berkata : Pergilah kalian wahai orang-orang kafir munuju adzab jahannam yang dahulu kalian telah dustakan di dunia. Pergilah kalian munuju naungan yang terbentuk dari asap neraka dan yang memiliki tiga cabang. Dan naungan ini tidaklah menaungi orang yang berada di bawahnya kecuali orang tersebut mendapatkan panas yang menyengat, ia juga tidak mampu menjaga mereka dari mulut-mulut neraka yang menyala-nyala. Sesungguhnya neraka itu memuntahkan bunga api, setiap bunga api besarnya setinggi benteng yang tinggi. Dan warnanya serta gerakannya yang cepat menyerupai unta yang kuning."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang mendustakan pada hari Kiamat. Ayat ini termasuk ancaman wail (kecelakaan besar) yang disiapkan untuk orang-orang yang berdosa; yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 29",
    "description": "29-31. Pada bagian terdahulu dijelaskan tentang ancaman Allah kepada yang durhaka. Kelompok ayat ini menerangkan sekelumit ancaman tersebut nanti di akhirat. Akan dikatakan kepada mereka, 'pergilah kamu wahai para pendurhaka, mendapatkan apa azab yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan asap api neraka yang mempunyai tiga cabang, yang tidak melindungi yaitu tidak menaungi dari panasnya api neraka, dan tidak pula menolak jilatan nyala api neraka yang sangat panas. '29-31"
  }
]