[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-33. Dikatakan kepada orang-orang kafir pada Hari Kiamat, “Berjalanlah kepada azab Jahanam yang dulu kalian dustakan di dunia, berjalanlah dan bernaunglah di bawah asap api Neraka Jahanam yang bercabang tiga, naungan itu tidak melindungi dari panas api yang menyala-nyala sedikit pun.” Sesungguhnya Neraka Jahanam melemparkan percikan-percikan api yang besar, setiap percikannya seperti bangunan tinggi menjulang. Percikan-percikan Jahanam yang beterbangan ini laksana unta hitam yang kekuning-kuningan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Pergilah kalian menuju naungan dari asap Neraka yang terbagi menjadi tiga cabang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. انطَلِقُوٓا۟ إِلَىٰ ظِلٍّ ذِى ثَلٰثِ شُعَبٍ (Pergilah kamu mendapatkan naungan yang mempunyai tiga cabang) Yakni menuju naungan dari asap neraka Jahannam yang telah terbentuk yang kemudian terbelah menjadi tiga bagian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Pergilah kalian menuju kepulan asap Jahannam yang mempunyai tiga cabang. Ini bermaksud untuk menunjukkan kedahsyatannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pergilah menuju naungan} asap neraka Jahanam {yang mempunyai tiga cabang} terbagi menjadi tiga bagian"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 30: 29-33. Allah mengabarkan tempat kembali mereka yaitu orang-orang yang mendustakan, Allah berkata : Pergilah kalian wahai orang-orang kafir munuju adzab jahannam yang dahulu kalian telah dustakan di dunia. Pergilah kalian munuju naungan yang terbentuk dari asap neraka dan yang memiliki tiga cabang. Dan naungan ini tidaklah menaungi orang yang berada di bawahnya kecuali orang tersebut mendapatkan panas yang menyengat, ia juga tidak mampu menjaga mereka dari mulut-mulut neraka yang menyala-nyala. Sesungguhnya neraka itu memuntahkan bunga api, setiap bunga api besarnya setinggi benteng yang tinggi. Dan warnanya serta gerakannya yang cepat menyerupai unta yang kuning."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya diterangkan lebih lanjut azab yang disebutkan dalam ayat sebelumnya. Yang dimaksud dengan naungan di sini menurut terjemah Al Qur’an DEPAG RI bukanlah naungan untuk berteduh, akan tetapi asap api neraka yang mempunyai tiga gejolak, yaitu di kanan, di kiri dan di atas. Hal ini berarti bahwa azab itu mengepung orang-orang kafir dari segala penjuru."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 30",
    "description": "29-31. Pada bagian terdahulu dijelaskan tentang ancaman Allah kepada yang durhaka. Kelompok ayat ini menerangkan sekelumit ancaman tersebut nanti di akhirat. Akan dikatakan kepada mereka, 'pergilah kamu wahai para pendurhaka, mendapatkan apa azab yang dahulu kamu dustakan. Pergilah kamu mendapatkan naungan asap api neraka yang mempunyai tiga cabang, yang tidak melindungi yaitu tidak menaungi dari panasnya api neraka, dan tidak pula menolak jilatan nyala api neraka yang sangat panas. '29-31"
  }
]