[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Ini adalah Hari Kiamat di mana orang-orang yang mendustakannya tidak mengucapkan perkataan yang berguna bagi mereka. Mereka juga tidak punya izin untuk berbicara sehingga mereka bisa beralasan, sebab mereka memang tidak punya alasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Tidak pula mereka mendapat kesempatan untuk beralasan kepada Rabb mereka atas kekufuran dan kejahatan mereka, sehingga alasan mereka diterima."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Mereka tidak diizinkan untuk mengungkapkan alasan agar dimaafkan. Mereka meminta ampun atas kedurhakaan mereka, kekufuran dan kemaksiatan mereka selama di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan tidak diizinkan kepada mereka mengemukakan alasan agar mereka dimaafkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-37. Maknanya, ini adalah hari besar dan dahsyat bagi orang-orang yang mendustakan. Mereka tidak bisa berkata-kata di dalamnya karena amat takut. “Dan tidak diizinkan kepada mereka meminta udzur sehingga mereka (dapat) minta udzur,” maksudnya udzur mereka tidak diterima meski mereka mengemukakannya. (Dalam ayat lain), “Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka, dan tidak pula mereka diberi kesempatan bertaubat lagi.” -Ar-Rum:57-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 36: 35-36. Pada hari ini (hari kiamat), para pendusta tidak dapat berkata-kata tentang hari kebangkitan dan pembalasan ini; Karena mereka pada hari itu (mengalami) kedahsyatan akan keadaannya; Bahkan tidak ada udzur (alasan) apapun bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni alasan mereka tidak akan diterima meskipun mereka mengemukakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 36",
    "description": "35-37. Bagi yang mendustakan azab Allah tersebut, maka ayat ini menguraikan tentang kepastian datangnya azab tersebut. Inilah hari yaitu hari kiamat, saat mereka tidak dapat berbicara pada waktu dan tempat-tempat tertentu, dan tidak diizinkan kepada mereka mengemukakan alasan agar mereka dimaafkan. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]