[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan hari ini dan apa yang terjadi padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Kehancuran, siksa dan kerugian pada hari itu bagi para pendusta yang telah mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Celaka dan azab bagi yang mendustakan segala kejadian hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah pada hari itu bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-37. Maknanya, ini adalah hari besar dan dahsyat bagi orang-orang yang mendustakan. Mereka tidak bisa berkata-kata di dalamnya karena amat takut. “Dan tidak diizinkan kepada mereka meminta udzur sehingga mereka (dapat) minta udzur,” maksudnya udzur mereka tidak diterima meski mereka mengemukakannya. (Dalam ayat lain), “Maka pada hari itu tidak bermanfaat (lagi) bagi orang-orang yang zalim permintaan uzur mereka, dan tidak pula mereka diberi kesempatan bertaubat lagi.” -Ar-Rum:57-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 37: Allah mengancam orang-orang yang mendustakan hari kebangkitan dengan berkata : Sungguh (mereka) akan celaka dan merugi pada hari ini yaitu orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 37",
    "description": "35-37. Bagi yang mendustakan azab Allah tersebut, maka ayat ini menguraikan tentang kepastian datangnya azab tersebut. Inilah hari yaitu hari kiamat, saat mereka tidak dapat berbicara pada waktu dan tempat-tempat tertentu, dan tidak diizinkan kepada mereka mengemukakan alasan agar mereka dimaafkan. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 38-40. Untuk lebih menekankan tentang dahsyatnya situasi saat itu, maka Allah menambahkan penegasannya, inilah hari keputusan yaitu penentuan keadaan manusia. Pada hari ini kami kumpulkan kamu wahai para pendurhaka yang hidup pada masa nabi Muhammad dan setelahnya, dan orang-orang yang terdahulu yang telah kami binasakan. Maka jika kamu punya tipu daya yaitu upaya untuk menghindari siksa, maka lakukanlah tipu daya itu terhadap-ku. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran."
  }
]