[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Pada hari ini Allah menetapkan keputusanNYa di antara makhluk-makhluk, dan kebenaran terpilah dari kebatilan. Kami mengumpulkan kalian padanya (wahai orang-orang kafir) dari umat ini, bersama orang-orang kafir dari umat-umat terdahulu. Bila kalian punya cara agar lolos dari azab Allah maka lakukanlah, selamatkanlah diri kalian dari hukuman dan murka Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Ini adalah hari penentuan di antara seluruh makhluk. Kami mengumpulkan kalian beserta umat-umat terdahulu dalam area."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-40. Pada hari kiamat, Allah akan memutuskan perkara di antara para makhluk dengan adil; seluruh makhluk yang terdahulu dan yang terakhir akan dikumpulkan, dan jika ada seseorang yang memiliki cara untuk selamat dari azab maka hendaklah dia melakukannya. Perintah ini merupakan olokan dan penegasan kelemahan mereka, sebab mereka tidak akan mampu melakukannya, dan mereka layak mendapat azab yang paling berat akibat kekafiran dan pendustaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. هٰذَا يَوْمُ الْفَصْلِ ۖ جَمَعْنٰكُمْ وَالْأَوَّلِينَ (Ini adalah hari keputusan; (pada hari ini) Kami mengumpulkan kamu dan orang-orang terdahulu) Dan akan dikatakan kepada mereka: inilah hari keputusan yang menjadi waktu diputuskannya perkara di antara para makhluk, dan akan terbedakan antara kebenaran dan kebatilan. Kami mengunpulkan kalian hai orang-orang kafir Quraisy pada hari ini bersama orang-orang kafir dari umat-umat terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38-39. Inilah hari keputusan untuk memutuskan antara benar dan batil. Kami kumpulkan kalian semua bersama para pendusta terdahulu seperti kalian. Apabila kalian memiliki tipu daya untuk dapat terbebas dari azab dan siksa ini maka lakukanlah dan jaga diri kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah hari keputusan; Kami mengumpulkan kalian dan orang-orang yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40. “Ini adalah hari keputusan; (oada hari ini) Kami mengumpulkan kamu dan orang-orang yang terdahulu,” agar Kami memutuskan di antara kalian dan Kami memutuskan antara manusia. “Jika kamu mempunyai tipu daya,” yang membuat kalian mampu keluar dari kekuasaanKu dan selamat dari azabKu, “maka lakukanlah tipu dayamu itu terhadapKu,” yakni kalian tidak memiliki kemampuan dan kekuasaan, seperti yang disebutkan dalam Firman Allah, “Hai jama'ah jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan.” -Ar-Rahman:33- Pada hari itu gugur semua tipu daya orang-orang zhalim. Lenyap semua makar dan tipu daya mereka dan mereka pasrah untuk disiksa, dan pada saat itu Allah menjelaskan kedustaan mereka, “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 38: 38-39. Kemudian dikatakan kepada orang-orang kafir : Ini adalah hari dimana Allah memisahkan di antara seluruh makhluk-Nya, dan Dia akan menghukumi dengan hukum yang Maha Adil dari kebaikan ataupun keburukan. Oleh karena itu kalian dikumpulkan wahai orang-orang kafir bersamaan dengan orang-orang kafir yang semisal kalian yaitu dari umat-umat sebelumnya, yang Allah akan hukumi atas kalian semua. Kemudian Allah berkata kepada mereka : Maka jika ada tempat keluar atau tipu daya agar kalian dapat lolos dari adzab jahannam, maka silahkan kalian lakukan. Ini dikatakan kepada mereka atas dasar mengolok-olok mereka atau dengan kata lain, mau kemana kalian orang-orang yang telah terbelenggu di dalam nereka akan meloloskan diri dan mengambil tempat keluar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wahai orang-orang yang mendustakan. Yakni untuk Kami berikan keputusan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 38",
    "description": "38-40. Untuk lebih menekankan tentang dahsyatnya situasi saat itu, maka Allah menambahkan penegasannya, inilah hari keputusan yaitu penentuan keadaan manusia. Pada hari ini kami kumpulkan kamu wahai para pendurhaka yang hidup pada masa nabi Muhammad dan setelahnya, dan orang-orang yang terdahulu yang telah kami binasakan. Maka jika kamu punya tipu daya yaitu upaya untuk menghindari siksa, maka lakukanlah tipu daya itu terhadap-ku. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]