[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Kehancuran, siksa dan kerugian pada hari itu bagi para pendusta yang telah mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Celaka dan azab hari kiamat bagi mereka yang mendustakan Allah, rasul-Nya, kitab-Nya dan hari kiamat. Mereka tidak akan bisa membuat tipu daya untuk bisa terbebas/selamat dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Celakalah pada hari itu, bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40. “Ini adalah hari keputusan; (oada hari ini) Kami mengumpulkan kamu dan orang-orang yang terdahulu,” agar Kami memutuskan di antara kalian dan Kami memutuskan antara manusia. “Jika kamu mempunyai tipu daya,” yang membuat kalian mampu keluar dari kekuasaanKu dan selamat dari azabKu, “maka lakukanlah tipu dayamu itu terhadapKu,” yakni kalian tidak memiliki kemampuan dan kekuasaan, seperti yang disebutkan dalam Firman Allah, “Hai jama'ah jin dan manusia, jika kamu sanggup menembus (melintasi) penjuru langit dan bumi, maka lintasilah, kamu tidak dapat menembusnya kecuali dengan kekuatan.” -Ar-Rahman:33- Pada hari itu gugur semua tipu daya orang-orang zhalim. Lenyap semua makar dan tipu daya mereka dan mereka pasrah untuk disiksa, dan pada saat itu Allah menjelaskan kedustaan mereka, “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 40: Allah mengancam orang-orang yang mendustakan hari kebangkitan dengan berkata : Sungguh (mereka) akan celaka dan merugi pada hari ini yaitu orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 40",
    "description": "38-40. Untuk lebih menekankan tentang dahsyatnya situasi saat itu, maka Allah menambahkan penegasannya, inilah hari keputusan yaitu penentuan keadaan manusia. Pada hari ini kami kumpulkan kamu wahai para pendurhaka yang hidup pada masa nabi Muhammad dan setelahnya, dan orang-orang yang terdahulu yang telah kami binasakan. Maka jika kamu punya tipu daya yaitu upaya untuk menghindari siksa, maka lakukanlah tipu daya itu terhadap-ku. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 41-42. Setelah dijelaskan sekilas tentang siksa bagi yang durhaka, kini diuraikan sekilas tentang kenikmatan bagi yang bertakwa. Sungguh, orang-orang yang bertakwa berada dalam naungan pepohonan surga yang teduh dan di sekitar mata air yang mengalir jernih. Dan juga buah-buahan serta aneka hidangan surga yang mereka sukai."
  }
]