[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-45. Sesungguhnya orang-orang yang takut kepada Tuhan mereka di dunia, menjaga diri mereka dari azabNya dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya, pada Hari Kiamat mereka berada di bawah naungan pohon-pohon yang rindang, mata air yang mengalir, buah-buahan yang banyak yang menggugah selera mereka dan merekapun menikmatinya. Kepada mereka dikatakan, “Makanlah dengan lezat. Dan minumlah dengan nikmat, ini adalah balasan amal shalih yang kalian kerajakan di dunia.” Balasan besar seperti ini Kami berikan kepada orang-orang yang berbuat baik dengan menaati dan mematuhi Kami. Kebinasaan dan azab yang berat pada Hari KIamat bagi orang-orang yang mendustakan Hari KIamat, serta Hari Pembalasan dan perhitungan amal dengan segala kenikmatan dan azab di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Seperti balasan yang telah Kami berikan kepada kalian, maka Kami akan membalas orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Sesungguhnya Kami akan memberi balasan kepada orang yang bertaqwa sebagaimana balasan kepada orang-orang yang senantiasa berbuat kebaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-45. Setelah Allah menjelaskan hukuman bagi orang-orang yang mendustakan, Allah menyebutkan pahala orang-orang yang berbuat baik seraya berfirman, “Sesungguhnya orang-orang yang bertakwa,” yakni menjaga diri agar tidak mendustakan dan memiliki sifat membenarkan dalam perkataan, perbuatan dan amal, di mana hal itu tidak berlaku tanpa menunaikan semua kewajiban dan meninggalkan semua yang diharamkan, “berada dalam naungan (yang teduh),” karena banyaknya pohon yang beraneka ragam dan berbunga menawan, “dan (di sekitar) mata air-mata air,” yang mengalir dari mata air surga dan dari sumber lain, “dan (mendapat) buah-buahan terbaik dan paling enak. Dikatakan pada mereka, “Makan dan minumlah kamu,” berbagai makanan nikmat dan minuman lezat, “dengan enak,” yakni tanpa kotoran dan sesuatu yang membuat keruh. Kelezatannya belum sempurna hingga makanan dan minumannya aman dari berbagai mudarat dan kekurangan dan hingga mereka yakin bahwa makanan dan minumannya tidak terputus dan hilang, “karena apa yang telah kamu kerjakan.” Amal perbuatan kalian adalah sebab yang mengantarkan kalian ke surga kenikmatan abadi. Dan begitu juga bagi semua orang yang beribadah menyembah Allah dengan ihsan dan berbuat baik pada hamba-hamba Allah. Karena itu Allah berfirman, “Sesungguhnya demikianlah kami memberi balasan kepada orang-orang yang berbuat baik. Kecelakaan yang besarlah pada hari itu bagi orang-orang yang berbuat baik. Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” Meski celaka ini hanyalah hilangnya kenikmatan tersebut, niscaya hal itu sudah cukup sebagai duka dan terhalang mendapatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 44: 41-44. Kemudian Allah mensifati surga dan para penghuninya dengan berkata : Sungguh bagi mereka yang takut kepada Tuhannya dan mengamalkan dengan apa yang diperintahkan kepadanya serta menjauhi apa yang dilarang padanya, maka mereka pada hari kiamat akan bernaung di bawah pepohonan dan mereka akan melihat mata air yang di sungai-sungai. Mereka menikmati dengan berbagai macam kenikmatan yang banyak dari buah-buahan yang diri-diri mereka senangi. Kemudian Allah berkata kepada mereka : Makanlah oleh kalian dari sesuatu yang lezat dan kalian sukai dan minumlah oleh kalian dengan sesuatu yang membuat tenggorkan kalian senang; Itulah balasan dari amalan-amalan kalian di dunia dari keshalihan dan ketaatan dan ketahuilah, balasan yang agung ini diperuntukkan bagi orang-orang yang ikhlas, serta Kami muliakan mereka karena sebab amalan-amalan mereka yang shalih dan ketaatan mereka kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 44",
    "description": "43-45. Dikatakan kepada mereka, 'makan dan minumlah dengan rasa nikmat, lezat dan menyenangkan tanpa khawatir ada dampak negatifnya. Itu semua sebagai balasan dari apa yang telah kamu kerjakan ketika di dunia. ' sungguh, demikianlah kami memberi balasan kepada orang-orang yang berbuat baik dengan istikamah, kebaikan tersebut telah menjadi karakter hidupnya. Celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]