[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46. Kemudian Allah mengancam orang-orang kafir, Dia berkata, “Makanlah kenikmatan-kenikmatan dunia dan bersenang-senanglah dengan hawa nafsunya yang fana dalam masa yang pendek, sesungguhnya kalian adalah orang-orang yang berbuat jahat dengan kesyirikan kalian kepada Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan dikatakan kepada para pendusta, “Makanlah dan bersenang-senanglah dengan kesenangan kehidupan dalam waktu yang pendek di dunia, sesungguhnya dengan kekufuran kalian kepada Allah dan pendustaan kalian terhadap para Rasul, kalian adalah orang-orang yang berdosa.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-47. Ini merupakan ancaman bagi orang-orang kafir agar mereka memakan apa yang mereka inginkan dan menikmati segala yang mereka mampu di kehidupan dunia, karena itu hanya sementara dan terbatas oleh ajal yang akan menghentikan segala kenikmatan mereka. Mereka tidak berhak mendapat kenikmatan lebih dari itu, karena mereka adalah orang-orang jahat dan zalim. Mereka akan mendapat azab yang pedih di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. كُلُوا۟ وَتَمَتَّعُوا۟ قَلِيلًا إِنَّكُم مُّجْرِمُونَ (Makanlah dan bersenang-senanglah kamu (di dunia dalam waktu) yang pendek; sesungguhnya kamu adalah orang-orang yang berdosa”) Dikatakan kepada mereka perkataan ini ketika di dunia. Dan (المجرمون) yakni orang-orang yang menyekutukan Allah dan para pelaku kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Namun, orang-orang kafir dan pendusta, mereka diancam di dunia: Makan dan nikmatilah yang hanya sedikit dari kenikmatan dunia ini. Kalian sungguh telah menyekutukan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Makan dan bersenang-senanglah kamu sebentar, sesungguhnya kalian adalah orang-orang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46-50. Ini adalah ancaman bagi orang-orang yang mendustakan. Sesungguhnya mereka itu meski makan dan minum di dunia serta mengenyam berbagai kenikmatan dan melalaikan berbagai amalan yang mendekatkan diri mereka kepada Allah, mereka adalah para pendosa yang berhak mendapatkan sesuatu yang didapatkan oleh orang-orang yang berdosa. Terputuslah semua kelezatan mereka dan yang tersisa hanyalah kecelakaan. Di antara dosa mereka adalah ketika mereka diperintahkan untuk shalat yang merupakan ibadah paling mulia dan “apabila dikatakan kepada mereka, ‘Rukuklah’,” mereka enggan melakukannya. Dosa mana yang lebih besar dari dosa ini dan kedustaan mana yang lebih besar dari kedustaan ini? “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” Di antara celaka mereka adalah tertutupnya pintu-pintu pertolongan dan terhalang dari semua kebaikan. Ketika mereka mendustakan al-Quran ini yang merupakan puncak tingkat kebenaran dan keyakinan secara mutlak, “maka kepada perkataan apakah selain al-Quran ini mereka akan beriman,” apakah pada kebatilan yang sama seperti namanya yang tidak berdasar pada syubhat, lebih-lebih dalil? Ataukah pada perkataan orang-orang musyrik dan pendusta yang nyata? Yang ada setelah cahaya terang hanyalah pekatnya kegelapan. Yang ada setelah kebenaran yang dikuatkan oleh berbagai dalil jelas dan bukti-bukti pasti hanyalah kedustaan jelas dan nyata yang hanya layak bagi orang sepertinya. Celakalah mereka dan alangkah butanya mereka. Kita memohon ampunan dan keselamatan kepada Allah karena sesungguhnya Dia Maha Pemurah lagi Mahamulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 46: Dikatakan kepada orang-orang kafir dengan ancaman di dunia : Makanlah oleh kalian dari kelezatan-kelezatan dunia sebagaimana binatang-binatang ternak, dan bersenang-senanglah dengan syahwat yang fana; Sesungguhnya kalian adalah para pendosa yang lebih jelek daripada binantang-binatang ternak dan tidak ada kemulian bagi kalian di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan ancaman keras bagi orang-orang yang mendustakan, bahwa mereka meskipun makan, minum dan bersenang-senang dengan kenikmatan dunia dan lalai dari beribadah, maka karena mereka adalah orang-orang yang berdosa, mereka pantas mendapatkan hukuman orang-orang yang berdosa; dimana segala kenikmatan akan hilang dari mereka dan tinggallah beban pertanggungjawaban."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 46",
    "description": "46-47. Bagi para pendurhaka, janji kenikmatan surga nampaknya tidak menjadikan mereka tertarik, karena merasa sudah meraihnya itu semua di dunia. Katakan kepada orang-orang kafir, 'makan dan bersenang-senanglah kamu di dunia sebentar, sesungguhnya kamu orang-orang durhaka dan di akhirat pasti akan mendapat siksa!' celakalah pada hari itu, bagi mereka yang mendustakan kebenaran"
  }
]