[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "47. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan hari perhitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Kehancuran, siksa dan kerugian pada hari itu bagi para pendusta yang telah mendustakan apa yang dibawa oleh para Rasul dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47-48. Celaka dan azab bagi mereka para pendusta. Ungkapan/ayat ini diulang 10 kali untuk menambah celaan kepada mereka. Apabila orang kafir diperintah untuk shalat dan berserah diri atas kehendak/perintah Allah, mereka membangkang dengan kesombongan dan kekeraskepalaan. Mujahid berkata: Ayat ini turun untuk suku Tsaqif yang menolak untuk shalat. Sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Celakalah pada hari itu, bagi mereka yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46-50. Ini adalah ancaman bagi orang-orang yang mendustakan. Sesungguhnya mereka itu meski makan dan minum di dunia serta mengenyam berbagai kenikmatan dan melalaikan berbagai amalan yang mendekatkan diri mereka kepada Allah, mereka adalah para pendosa yang berhak mendapatkan sesuatu yang didapatkan oleh orang-orang yang berdosa. Terputuslah semua kelezatan mereka dan yang tersisa hanyalah kecelakaan. Di antara dosa mereka adalah ketika mereka diperintahkan untuk shalat yang merupakan ibadah paling mulia dan “apabila dikatakan kepada mereka, ‘Rukuklah’,” mereka enggan melakukannya. Dosa mana yang lebih besar dari dosa ini dan kedustaan mana yang lebih besar dari kedustaan ini? “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” Di antara celaka mereka adalah tertutupnya pintu-pintu pertolongan dan terhalang dari semua kebaikan. Ketika mereka mendustakan al-Quran ini yang merupakan puncak tingkat kebenaran dan keyakinan secara mutlak, “maka kepada perkataan apakah selain al-Quran ini mereka akan beriman,” apakah pada kebatilan yang sama seperti namanya yang tidak berdasar pada syubhat, lebih-lebih dalil? Ataukah pada perkataan orang-orang musyrik dan pendusta yang nyata? Yang ada setelah cahaya terang hanyalah pekatnya kegelapan. Yang ada setelah kebenaran yang dikuatkan oleh berbagai dalil jelas dan bukti-bukti pasti hanyalah kedustaan jelas dan nyata yang hanya layak bagi orang sepertinya. Celakalah mereka dan alangkah butanya mereka. Kita memohon ampunan dan keselamatan kepada Allah karena sesungguhnya Dia Maha Pemurah lagi Mahamulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 47: Allah mengancam orang-orang yang mendustakan hari kebangkitan dengan berkata : Sungguh (mereka) akan celaka dan merugi pada hari ini yaitu orang-orang yang mendustakan Allah, Rasul-Nya dan Kitab suci-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 47",
    "description": "46-47. Bagi para pendurhaka, janji kenikmatan surga nampaknya tidak menjadikan mereka tertarik, karena merasa sudah meraihnya itu semua di dunia. Katakan kepada orang-orang kafir, 'makan dan bersenang-senanglah kamu di dunia sebentar, sesungguhnya kamu orang-orang durhaka dan di akhirat pasti akan mendapat siksa!' celakalah pada hari itu, bagi mereka yang mendustakan kebenaran. 48-49. Salah satu bentuk kedurhakaan mereka digambarkan pada ayat ini. Dan apabila dikatakan kepada mereka, 'rukuklah, ' yaitu salatlah dan taatlah kepada Allah, mereka tidak mau rukuk. Maka celakalah pada hari itu, bagi mereka yang mendustakan kebenaran!."
  }
]