[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50. Kebinasaan dan azab yang berat pada Hari Kiamat bagi orang-orang yang mendustakan ayat-ayat Allah. Bila mereka tidak beriman kepada al-Quran ini, lalu kepada kitab apa mereka akan beriman sesudahnya? Padahal al-Quran adalah penjelas bagi segala sesuatu, yang jelas hikmah-hikmah, hukum-hukum dan berita-beritanya, yang merupakan mukjizat dari segala lafazh dan maknanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Jika mereka tidak beriman kepada Al-Qur`ān yang diturunkan dari sisi Rabb mereka, lantas terhadap perkataan selain Al-Qur`ān mana lagi mereka akan beriman?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Jika tidak juga beriman orang-orang yang mendustakan al-Qur’an itu dan segala yang ada di dalamnya seperti tanda-tanda keberadaan, kekuasaan, dan keagungan Allah; tanda-tanda keberadaan hari akhir dan hari perhitungan; serta penjelasan yang ada di dalamnya yang menggunakan cara yang begitu indah dan sempurna. Maka kepada apa lagi mereka akan beriman? Ini merupakan bukti betapa besar kekafiran dan kebebalan mereka, padahal hujjah-hujjah telah dijelaskan dengan terang. Dan ini juga merupakan bukti keagungan al-Qur’an yang penuh mukjizat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَبِأَىِّ حَدِيثٍۭ بَعْدَهُۥ يُؤْمِنُونَ (Maka kepada perkataan apakah selain Al Quran ini mereka akan beriman?) Yakni dengan perkataan apalagi selain al-Qur’an mereka akan percaya jika mereka tidak percaya kepada al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Artinya, adakah kitab yang lebih bermukjizat dan lebih jelas yang akan mereka percayai, apabila mereka tidak mau beriman kepada Alquran ini?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka kepada ajaran manakah setelahnya} kitab dan kalam setelah Al-Qur'an {mereka akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46-50. Ini adalah ancaman bagi orang-orang yang mendustakan. Sesungguhnya mereka itu meski makan dan minum di dunia serta mengenyam berbagai kenikmatan dan melalaikan berbagai amalan yang mendekatkan diri mereka kepada Allah, mereka adalah para pendosa yang berhak mendapatkan sesuatu yang didapatkan oleh orang-orang yang berdosa. Terputuslah semua kelezatan mereka dan yang tersisa hanyalah kecelakaan. Di antara dosa mereka adalah ketika mereka diperintahkan untuk shalat yang merupakan ibadah paling mulia dan “apabila dikatakan kepada mereka, ‘Rukuklah’,” mereka enggan melakukannya. Dosa mana yang lebih besar dari dosa ini dan kedustaan mana yang lebih besar dari kedustaan ini? “Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan.” Di antara celaka mereka adalah tertutupnya pintu-pintu pertolongan dan terhalang dari semua kebaikan. Ketika mereka mendustakan al-Quran ini yang merupakan puncak tingkat kebenaran dan keyakinan secara mutlak, “maka kepada perkataan apakah selain al-Quran ini mereka akan beriman,” apakah pada kebatilan yang sama seperti namanya yang tidak berdasar pada syubhat, lebih-lebih dalil? Ataukah pada perkataan orang-orang musyrik dan pendusta yang nyata? Yang ada setelah cahaya terang hanyalah pekatnya kegelapan. Yang ada setelah kebenaran yang dikuatkan oleh berbagai dalil jelas dan bukti-bukti pasti hanyalah kedustaan jelas dan nyata yang hanya layak bagi orang sepertinya. Celakalah mereka dan alangkah butanya mereka. Kita memohon ampunan dan keselamatan kepada Allah karena sesungguhnya Dia Maha Pemurah lagi Mahamulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 50: Allah menutup surat ini dengan ketakjuban-Nya atas ketiadaan keimanan mereka, Allah berkata : Maka jika seandainya mereka beriman (yaitu orang-orang kafir), dengan Al Qur’an ini, yang padahal telah nyata dan jelas; Maka sungguh mereka tetap saja tidak beriman dan tidak akan membenarkan setelahnya akan segala sesuatunya, selamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 50",
    "description": "Sudah berulang kali Al-Qur'an menasihati dan memperingatkan mereka, namun tetap saja mereka menolak, maka kepada ajaran mana-kah selain Al-Qur'an ini mereka akan beriman' pasti tidak ada lagi, karena Al-Qur'an dalah kitab petunjuk yang paling sempurna. 1. Saat nabi Muhammad diutus, kaum kafir mekah bertanya-tanya tentang diri nabi, dakwah, dan ajarannya, salah satunya adalah perihal hari kebangkitan. Tentang apakah mereka saling bertanya-tanya di antara mereka'"
  }
]