[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan angin saat ia bertiup terus-menerus, sebagian menyusul sebagian lainnya, juga dengan angin yang bertiup kencang yang membinasakan, juga dengan para malaikat yang bertugas mengurus awan, mereka menggiringnya sebagaimana mereka kehendaki, juga dengan para malaikat yang menerima wahyu dari Allah dengan urusan yang memisahkan antara yang haq dengan yang batil, yang halal dengan haram, juga dengan para malaikat yang menerima wahyu dari Allah dan membawanya turun kepada nabi-nabiNya, sebagai penegakkan hujjah dari Allah atas makhlukNya dan peringatanNya kepada mereka, agar mereka tidak lagi bisa beralasan, bahwa apa yang dijanjikan kepada kalian, yaitu Hari Kiamat berikut perhitungan amal dan balasannya adalah haq, pasti terjadi pada kalian, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Malaikat itu turun dengan membawa wahyu sebagai alasan (hujah) dari Allah untuk manusia dan peringatan bagi mereka dari siksa Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. عُذْرًا أَوْ نُذْرًا (untuk menolak alasan-alasan atau memberi peringatan) Yakni para malaikat menyampaikan wahyu kepada para makhluk sebagai bantahan dari Allah terhadap segala alasan, dan sebagai peringatan dari azab-Nya. Pendapat lain mengatakan: yakni sebagai alasan bagi orang yang benar dan peringatan bagi orang yang salah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sebagai menolak alasan-alasan hamba, sehingga dia tidak butuh kecuali hanya kepada Allah. Juga sebagai ancaman apabila manusai enggan untuk beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{untuk memberi alasan-alasan atau memberi peringatan} alasan dari Allah dan peringatan kepada ciptaanNya dengan azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Allah bersumpah atas kebangkitan dan pembalasan terhadap amal-amal. “Demi malaikat-malaikat yang diutus untuk membawa kebaikan,” mereka adalah para malaikat yang diutus Allah untuk masalah-masalah takdir dan pengaturan alam serta untuk masalah-masalah syariat dan wahyu kepada para RasulNya, “yang diutus untuk membawa kebaikan,” adalah salah satu kondisi dari para malaikat yang diutus untuk membawa kebaikan tadi, yaitu diutus untuk kebaikan, hikmah dan kemaslahatan, bukan diutus untuk kemungkaran dan perbuatan sia-sia. “Dan (malaikat-malaikat) yang terbang dengan kencangnya,” mereka juga para malaikat yang diutus oleh Allah. Allah menyebutkan sifatnya yang amat cepat melakukan perintahNya dan cepatnya mereka menunaikan perintah-perintah Allah seperti perintah agar angin bertiup kencang. Atau yang dimaksud dengan sangat kencang dalam ayat ini adalah angin yang berhembus dengan kencang. “Dan (malaikat-malaikat) yang menyebarkan (rahmat RabbNya) dengan seluas-luasnya.” Kemungkinan yang dimaksud adalah para malaikat yang menyebarkan segala sesuatu yang telah diatur untuk disebarkan. Atau yang dimaksud adalah mendung yang dikirim Allah untuk menghidupkan bumi setelah sebelumnya mati. “Dan (malaikat-malaikat) yang menyampaikan wahyu,” mereka adalah para malaikat yang menyampaikan perintah-perintah mulia berupa peringatan yang dengannya Allah merahmati para hambaNya. Allah mengingatkan manfaat dan kepentingan mereka di dalam peringatan itu yang disampaikan pada para rasulNya, “untuk menolak alasan-alasan atau memberi peringatan,” yakni untuk memberi alasan dan peringatan bagi manusia. Mengingatkan manusia akan berbagai hal mengerikan yang ada di hadapan mereka serta untuk menolak alasan-alasan mereka sehingga mereka tidak memiliki hujjah atas Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 6: Allah menjelaskan bahwa malaikat ini (yang turun), adalah hujjah Allah bagi manusia agar tidak berkilah. Dan sebagai hujjah bagi manusia akan adzab yang Allah akan datangkan, jika manusia menyelisihi perintah-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menegakkan hujjah sehingga mereka tidak memiliki hujjah lagi di hadapan Allah Subhaanahu wa Ta'aala. Kepada manusia terhadap apa yang ada di hadapan mereka berupa hal-hal yang menakuttkan mereka.."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 6",
    "description": "5-6. Dan demi malaikat-malaikat yang bertugas menyampaikan wahyu kepada yang dipilih Allah untuk menerimanya, wahyu tersebut diturunkan untuk menolak alasan-alasan atau memberi peringatan bagi yang durhaka. 7-9. Demi semua yang telah disebut itu, sungguh, apa yang dijanjikan kepadamu, yaitu hari kebangkitan, juga surga dan neraka pasti terjadi. Kehidupan akhirat itu dimulai setelah kiamat dunia ini. Dan inilah gambaran kiamat itu. Maka apabila bintang-bintang dihapuskan cahayanya dengan mudah oleh Allah, dan apabila langit terbelah, sehingga langit dengan segala yang ada hancur."
  }
]