[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Allah bersumpah dengan angin saat ia bertiup terus-menerus, sebagian menyusul sebagian lainnya, juga dengan angin yang bertiup kencang yang membinasakan, juga dengan para malaikat yang bertugas mengurus awan, mereka menggiringnya sebagaimana mereka kehendaki, juga dengan para malaikat yang menerima wahyu dari Allah dengan urusan yang memisahkan antara yang haq dengan yang batil, yang halal dengan haram, juga dengan para malaikat yang menerima wahyu dari Allah dan membawanya turun kepada nabi-nabiNya, sebagai penegakkan hujjah dari Allah atas makhlukNya dan peringatanNya kepada mereka, agar mereka tidak lagi bisa beralasan, bahwa apa yang dijanjikan kepada kalian, yaitu Hari Kiamat berikut perhitungan amal dan balasannya adalah haq, pasti terjadi pada kalian, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sesungguhnya apa yang dijanjikan kepada kalian berupa kebangkitan, perhitungan amal dan pembalasan pasti terjadi, tidak diragukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Sesungguhnya apa yang sudah dijanjikan padamu wahai manusia tentang datangnya hari kiamat dan hari kebangkitan juga hari pembalasan bukanlah suatu keraguan. Apabila bintang-bintang dihapuskan dan hilang sinarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh apa yang dijanjikan kepada} sesungguhnya yang dijanjikan untuk kalian berupa perkara hari kiamat, kebangkitan dan pembalasan {pasti terjadi} pasti akan menimpa kalian bukan sesuatu yang mustahil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Sesungguhnya apa yang dijanjikan kepadamu,” berupa Hari Kebangkitan dan pembalasan amal perbuatan, “itu pasti terjadi,” yakni jelas-jelas akan terjadi tanpa ragu dan bimbang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 7: Allah menjelaskan bahwa sumpah di antara sumpah-sumpah ini sebagai ketegasan bahwa hari kebangkitan itu benar adanya, dan Allah pada saat itu akan turun kepada kalian tanpa sekutu apapun. Pada hari itu sempurnalah perhitungan-Nya, dan Allah akan menghisab setiap amalan manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kebangkitan dan pembalasan terhadap amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 7",
    "description": "7-9. Demi semua yang telah disebut itu, sungguh, apa yang dijanjikan kepadamu, yaitu hari kebangkitan, juga surga dan neraka pasti terjadi. Kehidupan akhirat itu dimulai setelah kiamat dunia ini. Dan inilah gambaran kiamat itu. Maka apabila bintang-bintang dihapuskan cahayanya dengan mudah oleh Allah, dan apabila langit terbelah, sehingga langit dengan segala yang ada hancur"
  }
]