[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-15. Manakala bintang-bintang dihapus dan cahayanya menghilang. Manakala langit terbelah. Manakala gunung-gunung terbang dan hancur sehingga ia seperti debu yang diterbangkan angin. Manakala waktu penetapan keputusan antara para rasul dengan umat-umat mereka ditetapkan, lalu dikatakan, “Hingga hari besar apakah para rasul itu ditunda?” ditunda hingga hari ditetapkannya keputusan di antara para makhluk. Adakah yang memberitahumu (wahai manusia) apa itu hari penetapan keputusan, berikut kesulitan dan kengeriannya? Kebinasaan besar pada hari itu bagi orang-orang yang mendustakan hari yang dijanjikan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Maka apabila bintang telah hilang cahayanya dan pergi sinarnya,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-10. Kemudian Allah menjelaskan sebagian peristiwa yang akan terjadi pada hari kiamat; bintang-bintang akan jatuh dan redup cahayanya, langit akan terbelah dan terbuka menjadi pintu-pintu, gunung-gunung akan berterbangan sehingga tidak tersisa padanya. Para rasul akan dan kaum mereka akan mendapat keputusan pada waktu tertentu di hari kiamat, keputusan ini diakhirkan hingga hari tersebut karena itu adalah hari yang besar yang menjadi waktu berkumpulnya seluruh makhluk dan waktu mereka menjalani hisab dari Allah, sehingga keputusan antara makhluk dengan yang lain sesuai dilakukan pada hari itu, di antaranya adalah pemberian keputusan antara para rasul dengan kaum mereka. Pertanyaan dalam kalimat “Sampai hari apakah akan ditangguhkan?” [ayat 12] dan “Dan tahukah kamu apa itu hari keputusan?” [ayat 14], adalah untuk mengagungkan perkara itu dan menegaskan kengeriannya; itulah hari kebangkitan, pengumpulan, dan pemberian ketetapan di antara seluruh makhluk, serta pembalasan atas seluruh perbuatan. Pada hari itu terdapat azab yang berat dan menghinakan bagi orang yang mendustakan Allah dan para Rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَإِذَا النُّجُومُ طُمِسَت (Maka apabila bintang-bintang telah dihapuskan) Yakni ketika dihilangkan cahayanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Sesungguhnya apa yang sudah dijanjikan padamu wahai manusia tentang datangnya hari kiamat dan hari kebangkitan juga hari pembalasan bukanlah suatu keraguan. Apabila bintang-bintang dihapuskan dan hilang sinarnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apabila bintang-bintang dihapus} dihapus cahayanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-14. Bila sudah terjadi, terjadilah perubahan pada alam dan huru hara hebat yang menakutkan hati dan memperbesar bencana. Bintang-bintang lenyap bertaburan dan hilang dari tempatnya. Gunung bertebangan seperti debu yang ditaburkan. Gunung dan bumi menjadi datar sama sekali, tidak terlihat adanya gundukan dan tidak ada bukit. Itulah hari dimana “Rasul-rasul telah ditetapkan waktu (mereka),” dan disegerakan putusan antara mereka dan kaum mereka. Karena itu Allah berfirman, “Sampai hari apakah ditangguhkan (mengazab orang-orang kafir itu?” kata tanya ini untuk memperbesar, mengagungkan, dan membuat takut. Selanjutnya dijawab dengan FirmanNya, “Sampai hari keputusan,” antara manusia satu sama lain dan perhitungan amal mereka satu persatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Mursalat ayat 8: Allah menjelaskan akan waktu kedatangan hari kiamat, Allah berkata : Maka jika bintang-bintang itu redup dan hilang sinarnya dan tidak tersisa lagi cahayanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika terjadi perubahan dan peristiwa dahsyat terhadap alam semesta yang mencemaskan hati, maka bintang-bintang dihapuskan cahayanya atau bertaburan dan bergeser dari tempatnya, gunung-gunung dihancurkan menjadi seperti debu, sedangkan bumi menjadi rata tidak ada tempat tinggi dan tidak ada tempat rendah. Itulah hari dimana para rasul ditetapkan waktunya untuk berkumpul bersama umat mereka masing-masing dan diberikan keputusan antara mereka (para rasul) dengan umat-umat mereka. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Sampai hari apakah ditangguhkan (azab orang-orang kafir itu)?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Mursalat Ayat 8",
    "description": "7-9. Demi semua yang telah disebut itu, sungguh, apa yang dijanjikan kepadamu, yaitu hari kebangkitan, juga surga dan neraka pasti terjadi. Kehidupan akhirat itu dimulai setelah kiamat dunia ini. Dan inilah gambaran kiamat itu. Maka apabila bintang-bintang dihapuskan cahayanya dengan mudah oleh Allah, dan apabila langit terbelah, sehingga langit dengan segala yang ada hancur"
  }
]