[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Semua yang ada di langit dan di bumi menyucikan Allah dari apa yang tidak pantas bagiNya. Dan Dia-lah Yang Mahaperkasa yang tidak terkalahkan, juga Mahabijaksana dalam perkataaan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Seluruh makhluk yang ada di langit dan di bumi menyucikan Allah dan membersihkan-Nya dari segala yang tidak pantas bagi-Nya dan Dia Maha Perkasa, tidak ada seorang pun yang mampu mengalahkan-Nya, Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah menjelaskan kebesaran-Nya di alam semesta dan ketundukan seluruh makhluk kepada-Nya; seluruh makhluk yang ada di tujuh langit dan bumi bertasbih, memuji dan menyucikan-Nya. Dia Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur seluruh urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad dari Abdullah bin Salam, berkata: \"Kami berunding apa yang kalian tanyakan kepada rasul\", maka dia bertanya: \"Amal apa yang paling disukai Allah?\" Maka kami tidak ada yang berdiri. Kemudian rasul mengutus pemuda kepada kami, yang membacakan surah ini, surah As-shaf awal hingga akhir. 1. Seluruh makhluk di bumi dan langit mensucikan Allah dari segala sesuatu yang tidak sesuai denganNya. Itu menunjukkan adanya kewajiban mensucikan Allah setiap saat. Dialah Dzat yang Maha Kuat dan tidak ada yang dapat mengungguliNya, Dzat yang Maha Bijaksana dalam firman dan tindakanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang ada di langit dan yang ada di bumi bertasbih kepada Allah. Dialah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah penjelasan tentang keagungan dan keperkasaan Allah, segala sesuatu tunduk padaNya. Seluruh yang ada di langit dan bumi bertasbih dengan memuji, menyembah, dan meminta segala kebutuhan kepada rabb mereka. “Dan Dia-lah Yang Mahaperkasa.” Yang memaksa segala sesuatu dengan keperkasaan dan KuasaNya, “lagi mahabijaksana,” dalam penciptaan dan perintahNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 1: Allah mengabarkan bahwa segala sesuatu di langit maupun di bumi bertasbih kepada Allah dan mensucikan-Nya dari apa yang tidak pantas bagi Allah, dari sifat-sifat-Nya yang kurang dan cacat. Kemudian Allah mengabarkan bahwa Allah Maha Gagah yang tak dapat dikalahkan, Yang Maha Bijaksan atas apa yang Allah perbuat. Pada ayat ini terdapat petunjuk untuk bertasbih pada setiap waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Darimi di juz 2 hal. 200 berkata: Telah mengabarkan kepada kami Muhammad bin Katsir, dari Al Auzaa’iy dari Yahya bin Katsir dari Abu Salamah dari Abdullah bin Salam ia berkata, “Sekelompok sahabat Rasulullah shallallahu 'alaihi wa sallam pernah duduk bersama kami lalu kami berbincang-bincang dan berkata, “Kalau kita mengetahui amal apa yang paling dicintai Allah Ta’ala tentu kita akan lakukan,” maka Allah Ta'aala menurunkan ayat, “Apa yang ada di langit dan apa yang ada di bumi bertasbih kepada Allah; dan Dialah Yang Mahaperkasa lagi Mahabijaksana.-- Wahai orang-orang yang beriman! Mengapa kamu mengatakan sesuatu yang tidak kamu kerjakan?” sampai akhirnya. Abdullah (bin Salam) berkata, “Maka Rasulullah shallallahu 'alaihi wa sallam membacakannya kepada kami sampai akhirnya.” Abu Salamah berkata, “Lalu (Abdullah) ibnu Salam membacakannya kepada kami.” Yahya berkata, “Lalu Abu Salamah membacakannya kepada kami,” dan Yahya juga membacakannya kepada kami, demikian pula Al Auzaa’iy membacakannya kepada kami dan Muhammad juga membacakannya kepada kami. (Hadits ini diriwayatkan oleh Ahmad juz 5 hal. Hal. 452, Tirmidzi juz 4 hal. 199 dan ia menerangkan apa yang di sana berupa perselisihan terhadap Al Auza’iy, Ibnu Hibban hal. 383 di Mawaariduzh Zham’aan, Hakim di juz 2 hal. 69, 229 dan 487, dan ia berkata pada tiga tempat tersebut, “Shahih sesuai syarat Bukhari dan Muslim, namun keduanya tidak meriwayatkan, dan didiamkan oleh Adz Dzahabi dan pada tempat yang pertama ia menerangkan tentang perselisihan terhadap Al Auza’iy. Al Haafizh dalam Al Fat-h juz 10 hal. 265, “Telah terjadi ‘mendengarkan surah ini’ secara berantai dalam hadits yang disebutkan pada bagian awalnya sebab turunnya, dan isnadnya shahih. Sedikit sekali jika terjadi penyebutan secara berantai (pembacaan surah secara berantai) yang sepertinya dengan keadaannya yang bertambah ketinggiannya.” Ia (Al Haafizh) juga berkata, “Hadits itu adalah hadits musalsal (berantai) yang paling shahih.” Ayat ini menerangkan keagungan Allah Subhaanahu wa Ta'aala dan kekuasaan-Nya, dimana semua makhluk tunduk kepada-Nya dan bahwa semua yang ada di langit dan di bumi bertasbih dengan memuji Allah, beribadah kepada-Nya dan meminta kebutuhan-Nya. Dia menundukkan segala sesuatu dengan keperkasaan dan kekuasaan-Nya. Dalam ciptaan-Nya dan dalam perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 1",
    "description": "Apa yang ada di langit, bintang, bulan, matahari, dan seluruh planet; dan apa yang ada di bumi, hewan dan tetumbuhan bertasbih kepada Allah, mengakui dan menyatakan kemahasucian Allah yang berbeda dengan seluruh makhluk ciptaan-Nya; dan dialah yang mahaperkasa menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghancurkan jagat raya atau menghukum manusia yang berdosa. 2. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! mengapa kamu mengatakan secara terbuka di hadapan orang banyak atau secara tertutup sesuatu yang tidak kamu kerjakan' apakah kamu merasa tidak bersalah melakukannya'."
  }
]