[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, apakah kalian berkenan aku tunjukkan sebuah bisnis besar yang menyelamatkan kalian dari azab yang pedih?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan bagi mereka, maukah kalian Aku tuntun dan Aku tunjukkan kepada suatu perniagaan yang menguntungkan, yang menyelamatkan kalian dari siksa yang menyakitkan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-13. Allah mendorong orang-orang beriman agar berjihad dengan jiwa dan harta mereka: Apakah kalian mau Aku tunjukkan kepada kalian perniagaan yang menguntungkan, yang dapat menyelamatkan kalian dari azab yang pedih? Yaitu dengan senantiasa beriman kepada Allah dan rasul-Nya, dan berjihad dengan jiwa dan harta demi meninggikan kalimat Allah. Petunjuk yang agung ini lebih baik bagi kalian daripada seluruh perniagaan lainnya jika kalian mengetahui besarnya perniagaan menguntungkan yang istimewa ini; karena Allah akan mengampuni dosa kalian, memasukkan kalian ke dalam surga-surga yang di bawah istana dan pepohonannya terdapat sungai-sungai air tawar yang mengalir, dan memuliakan kalian dengan tempat tinggal yang indah yang kalian tinggali di surga selamanya. Kedudukan yang mulia ini merupakan kemenangan yang besar. Dan dalam perniagaan ini terdapat kenikmatan lain yang kalian sukai, yaitu pertolongan dari Allah dan kemenangan yang segera datang. Hai Rasulullah, sampaikanlah kepada orang-orang beriman tentang perniagaan besar yang istimewa ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ هَلْ أَدُلُّكُمْ عَلَىٰ تِجٰرَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ (Hai orang-orang yang beriman, sukakah kamu aku tunjukkan suatu perniagaan yang dapat menyelamatkanmu dari azab yang pedih?) Allah menjadikan amalan tersebut seperti perniagaan, sebab mereka akan mendapat keuntungan seperti dalam perniagaan, yaitu dengan dapat masuk surga dan selamat dari neraka. Dan perdagangan ini dijelaskan dalam dua ayat setelah ayat ini. Makna ayat dua ayat tersebut bahwa keimanan dan jihad adalah harga surga yang ditetapkan Allah, dan itu merupakan perniagaan yang menguntungkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Wahai orang-orang mukmin yang beriman kepada Allah dan RasulNya. Apakah (kalian senang) jika Aku menunjukkan kalian pada amal yang menguntungkan di bidang perniagaan yang apabila dilakukan akan menjadikan kalian masuk surga, menyelamatkan dari neraka dan membebaskan kalian dari azab yang pedih dan menyakitkan pada hari kiamat? Amalan itu adalah keimanan dan jihad yang keduanya dijelaskan pada ayat selanjutnya. Ibnu Jarir dari Shalih berkata: “Mereka berkata: “Mungkinkah kami mengetahui amal yang paling dicintai oleh Allah?” Kemudian turunlah ayat ini dan mereka membenci jihad, lalu turunlah ayat yang sebelumnya {Lima taquuluna maa laa taf’aluun}“"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, maukah kalian Aku tunjukkan suatu perdagangan yang dapat menyelamatkan kalian dari azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Ini adalah wasiat, petunjuk, dan arahan dari Allah Yang Maha Pemurah di antara para pemurah terhadap para hamba-hambaNya yang beriman, kepada bisnis terbesar, tuntutan paling luhur dan tujuan paling tinggi, yang jika didapat, akan menyelamatkan dari azab yang pedih dan mendapatkan kenikmatan abadi. Allah menyebutkan kata penawaran yang menunjukkan bahwa hal ini adalah sesuatu yang diinginkan oleh orang yang bersabar dan yang berakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 10: Allah menunjukkan kepada orang-orang yang beriman dari hamba-Nya dengan menunjukkan perdagangan yang menguntungkan di dunia dan akhirat, Allah berkata : Apakah aku telah menunjukkan kepada kalian wahai orang-orang yang beriman atas perdagangan yang besar dan menguntungkan, yang buahnya adalah selamat dari adzab yang pedih di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan wasiat, petunjuk dan bimbingan dari Allah Subhaanahu wa Ta'aala Tuhan Yang paling sayang kepada hamba-hamba-Nya yang mukmin terhadap perdagangan yang paling menguntungkan, dimana setelahnya mereka akan memperoleh keselamatan dari azab yang pedih dan memperoleh surga yang penuh kenikmatan. Allah Subhaanahu wa Ta'aala menggunakan kata-kata tawaran yang menunjukkan bahwa hal ini merupakan sesuatu yang paling diinginkan oleh orang-orang yang berpandangan tajam, seakan-akan ada jawaban dari mereka, “Apa perdagangan yang begitu menguntungkan ini?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 10",
    "description": "Wahai orang-orang yang beriman di mana pun dan pada zaman apa pun kamu hidup! maukah kamu aku tunjukkan melalui bimbingan rasulullah suatu perdagangan yang dapat menyelamatkan kamu dari azab yang pedih di akhirat'11. Bisnis yang menyelamatkan manusia dari azab itu adalah kamu beriman kepada Allah dan rasul-Nya dengan mantap dan kokoh dan berjihad di jalan Allah, yaitu berusaha sekuat tenaga untuk mengharumkan islam dan kaum muslim, serta membela hak, martabat dan kehormatan kaum muslim dari serangan musuh-Musuh islam dengan harta dan jiwa kamu hingga kamu mati syahid. Itulah yang lebih baik bagi kamu, dalam berbisnis dengan Allah, jika kamu mengetahui, kebaikan dan keuntungan beriman dan berjihad dengan benar."
  }
]