[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Yaitu, kalian beriman kepada Allah dan RasulNya dengan konsisten, berjihad di jalan Allah dalam rangka menolong agamaNYa dengan harta dan jiwa yang kalian miliki. Itu lebih baik bagi kalian daripada bisnis dunia, bila kalian tahu mana yang bermanfaat dan mana yang tidak. Maka laksanakanlah hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Perniagaan yang menguntungkan itu adalah hendaknya kalian beriman kepada Allah dan berjuang di jalan-Nya dengan menafkahkan harta kalian dan mengorbankan jiwa kalian untuk mencari rida Allah. Perbuatan tersebut lebih baik bagi kalian andai kalian mengetahuinya, maka bersegeralah melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kalian beriman kepada Allah dan RasulNya dengan sempurna tanpa keraguan dan tanpa menyekutukanNya. Kalian berjihad di jalan Allah dengan harta benda dan jiwa kalian. Keimanan dan jihad kalian itu lebih baik bagi kalian daripada dunia. Jika kalian mengetahuinya, kalian tidak akan mengabaikannya, maka dari itu lakukanlah!. Ibnu Abu Hatim dari Sa’id bin Jabir berkata: “Saat ayat {Hal Adullukum ‘ala tijaaratin} [ayat 10] diturunkan, orang-orang muslim berkata: “Jika saja kami mengetahui perniagaan ini, sungguh kami akan memberikan harta benda dan keluarga kali untuk hal itu”. Kemudian turunlah ayat {Tu’minuuna billahi}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian beriman kepada Allah dan RasulNya dan berjihad di jalan Allah dengan harta dan jiwa kalian. Yang demikian itu lebih baik bagi kalian jika kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Seolah-olah ada yang bertanya, “Transaksi apa yang nilainya sedemikian besar?” Allah berfirman, “(Yaitu) kamu beriman kepada Allah dan RasulNya,” sebagaimana diketahui bahwa keimanan yang sempurna adalah membenarkan dengan bulat terhadap perintah Allah dengan cara membenarkannya yang mengharuskan untuk diamalkan oleh anggota badan. Dan yang paling utama adalah berjihad di jalanNya, karena itu Allah berfirman, “Dan berjihad di jalan Allah dengan harta dan jiwamu,” dengan mencurahkan diri dan nyawa kalian untuk menyerang musuh Islam dengan maksud untuk menolong agama Allah dan meninggikan kalimatNya. Kalian mengeluarkan dana semampu kalian untuk tujuan itu meski hal itu tidak disukai dan terasa berat bagi jiwa, tapi jihad “itulah yang yang lebih baik bagimu jika kamu mengetahuinya.” Dalam jihad terdapat kebaikan dunia seperti kemenangan dari musuh, kemuliaan yang menafikan kerendahan, keleluasaan rizki, dan kelapangan dada. Sedangkan kebaikan akhirat adalah mendapatkan pahala Allah dan selamat dari siksaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 11: Allah menjelaskan bahwa pedagangan ini adalah kalian beriman kepada Allah dan Rasul-Nya dengan keimanan yang jujur, yang tidak ada keraguan dan kemunafikan. Dan hendaklah kalian berjihad melawan musuh-musuh dalam agama dengan harta dan diri, agar tinggi kalimat Allah. Ketahuilah bahwa keimanan dan jihad ini baik bagi kalian dai apapun di dunia; Lebih baik dari jiwa, harta dan anak-anak kalian, jika kalian mengetahui apa yang bermanfaat dan merugikan bagi kalian. Allah menjadikan keimanan dan jihad keduanya sebagai perdagangan yang menguntungkan, yaitu sebagai penyerupaan atas keuntungan secara makna yang digantikan. Menuntut untuk meraih karuni dan tambahan dalam ganjaran dan derajat ketinggian di sisi Allah; Karena sebab perdagangan itu dengan harta yang menuntut akan keuntungan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tetap terus beriman. Iman yang sempurna adalah pembenaran yang pasti terhadap apa yang diperintahkan Allah untuk diimani, dimana hal ini menghendaki untuk beramal saleh, dan di antara amal saleh yang paling besar adalah jihad fii sabilillah. Yakni kamu korbankan jiwa ragamu dan hartamu untuk melawan musuh-musuh Islam dan bertujuan menegakan agama Allah dan meninggikan kalimat-Nya serta mengorbankan sedikit hartamu untuk itu, karena hal itu meskipun tidak enak bagi jiwa dan berat melakukannya, tetapi lebih baik bagi kamu jika kamu mengetahui, karena di sana terdapat kebaikan di dunia dan di akhirat. Kebaikan di dunia adalah dengan mendapatkan kemenangan terhadap musuh, kemuliaan, rezeki, kelapangan dada dsb. Sedangkan di akhirat dengan memperoleh pahala Allah, selamat dari siksa-Nya dan lain sebagainya yang telah diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 11",
    "description": "Bisnis yang menyelamatkan manusia dari azab itu adalah kamu beriman kepada Allah dan rasul-Nya dengan mantap dan kokoh dan berjihad di jalan Allah, yaitu berusaha sekuat tenaga untuk mengharumkan islam dan kaum muslim, serta membela hak, martabat dan kehormatan kaum muslim dari serangan musuh-Musuh islam dengan harta dan jiwa kamu hingga kamu mati syahid. Itulah yang lebih baik bagi kamu, dalam berbisnis dengan Allah, jika kamu mengetahui, kebaikan dan keuntungan beriman dan berjihad dengan benar. 12. Keuntungan yang bisa kamu peroleh dengan perniagaan itu adalah niscaya Allah mengampuni dosa-dosamu, baik dosa yang disengaja maupun yang tidak disengaja dan memasukkan kamu ke dalam surga di akhirat yang penuh kenikmatan, yang mengalir di bawahnya sungai-sungai, sehingga kehidupan terasa indah dan menyenangkan; dan juga Allah memasukkan kamu ke tempat-tempat tinggal yang baik di dalam surga 'adn sehingga kenikmatan terasa di atas kenikmatan. Itulah kemenangan yang besar, karena keputusan yang tepat selama hidup di dunia untuk beriman dan berjihad."
  }
]