[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Jika kalian (wahai orang-orang beriman) melakukan apa yang Allah perintahkan kepada kalian, niscaya Allah menutupi dosa-dosa kalian, memasukkan kalian ke dalam surga-surga yang sungai-sungai mengalir di bawah istana-istana dan kebun-kebunnya, juga rumah-rumah yang suci dan bersih di surga abadi yang tidak ada habisnya. Itulah kemenangan sejati yang sesudahnya tidak ada kemenangan. Dan ada nikmat lain bagi kalian wahai orang-orang beriman, yang (amat) kalian cintai, yaitu kemenangan dari Allah yang kalian dapatkan dan kemenangan dunia yang terwujud melalui tangan kalian. Gembirakanlah orang-orang beriman (wahai Nabi) dengan kemenangan dan keunggulan di dunia dan surga di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan keuntungan dari perniagaan ini adalah Allah mengampuni dosa-dosa kalian dan memasukkan kalian ke dalam Surga yang sungai-sungai mengalir di bawah istana-istana dan pepohonannya serta memasukkan kalian ke tempat tinggal yang baik di dalam surga-surga tempat menetap, tidak pernah pindah. Balasan yang disebutkan itu adalah kemenangan besar yang tidak ada kemenangan lain yang menyerupainya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. يَغْفِرْ لَكُمْ ذُنُوبَكُمْ (Niscaya Allah akan mengampuni dosa-dosamu) Pertama Allah menyebutkan harga yang harus dibayar dalam perniagaan ini, kemudian Allah menyebutkan apa yang akan mereka dapatkan dari perniagaan ini, yaitu jika kalian beriman maka Allah akan mengampuni kalian. وَمَسٰكِنَ طَيِّبَةً فِى جَنّٰتِ عَدْنٍ ۚ (dan (memasukkan kamu) ke tempat tinggal yang baik di dalam surga ‘Adn) Yakni di dalam surga mereka akan tinggal selamanya, tidak akan terputus dengan kematian atau keluar darinya. ذٰلِكَ الْفَوْزُ الْعَظِيمُ(Itulah keberuntungan yang besar) Yakni ampunan dan dapat masuk surga yang disebutkan itu adalah keberuntungan yang tidak ada duanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Ini adalah nilai barang yang dijual dalam perniagaan itu. Jika kalian beriman, maka dosa-dosa kalian yang telah lalu akan diampuni, kalian akan dimasukkan ke dalam tempat suci dan murni yang dipenuhi kebahagiaan di dalam taman-tamannya dan kalian akan berada di sana selama-lamanya. Balasan yang disebutkan berupa ampunan dan surga itu adalah kemenangan dan pencapaian agung yang tiada taranya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Niscaya Allah mengampuni dosa-dosa kalian dan memasukkan kalian ke dalam surga yang mengalir di bawahnya} di bawah istana-istana dan pohon-pohonnya {sungai-sungai dan ke tempat-tempat tinggal yang baik di dalam surga ‘Adn} tempat untuk tinggal selamanya {Itulah kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Karena itu Allah menyebutkan pahala di akhirat seraya berfirman, “Niscaya Allah akan mengampuni dosa-dosamu,” mencakup dosa-dosa kecil dan dosa-dosa besar, karena beriman kepada Allah dan berjihad di jalanNya bisa menghapus dosa meski dosa besar. “Dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai,” maksudnya, di bawah tempat tinggal, istana, runagna kamar, dan pepohonannya mengalir sungai-sungai yang besumber dari air yang rasa, aroma, dan warnanya tidak berubah, sungai-sungai dari susu yang rasanya tidak berubah, sungai dari khamar nikmat untuk mereka yang meminumnya, dan sungai dari madu murni, dan mereka mendapatkan berbagai macam buah-buahan. “Dan (memasukkan kamu) ke tempat tinggal yang baik di Surga ‘Adn .” maksudnya mencakup segala kebaikan berupa ketinggian, indahnya perhiasan, hingga para penghuni kamar penghuni surga tertinggi dapat dilihat oleh seluruh penduduk surga, laksana bintang gemerlap yang dapat dilihat di ufuk langit timur dan barat. Bahkan bangunan surga ada yang berasal dari batu bata emas, ada juga yang berbatu bata perak dan marmernya terbuat dari mutiara dan mutu manikam. Sebagian rumah di surga terbuat dari mutiara dengan berbagai warna-warni. Karena begitu cerahnya, sisi dalam dapat dilihat dari luar dan sebaliknya. Di dalam surga terdapat kebaikan dan keindahan yang tidak dapat dilukiskan oleh siapa pun dan tidak pernah terlintas di hati satu makhluk pun dari seluruh alam. Mereka tidak akan bisa mengangankannya hingga mereka melihatnya, menikmati keindahannya, dan menyejukkan mata mereka. Dalam kondisi seperti itu andai Allah tidak menciptakan penghuni surga secara sempurna dan tidak kekal, tentu hampir saja mereka mati karena terlalu bahagia. Mahasuci Dzat yang tidak ada satu pun makhlukNya yang bisa menghitung pujian untukNya. Tapi Dia adalah seperti yang Dia puji DiriNya sendiri dan di atas pujian seluruh makhluk. Mahasuci Allah Yang Mahaluhur lagi Indah yang menciptakan tempat kenikmatan. Menciptakan keluhuran dan keindahan di dalamnya yang membuat akal semua makhluk terpana dan tertarik hatinya. Mahatinggi Allah Yang bagiNya hikmah sempurna yang seandainya memperlihatkan surga pada para hambaNya hingga mereka melihat apa saja yang terdapat didalamnya, tentu tidak ada seorang pun yang mau hidup di dunia yang kenikmatannya dicampuri kepedihan dan kesenangannya dicampuri kesengsaraan. Surga tersebut dinamakan ‘Adn karena penghuninya menempatinya dan tidak keluar selamanya, serta tidak ingin mencari ganti. Itulah balasan besar dan pahala yang indah yang merupakan suatu keberuntungan besar tanpa tandingan. Dan inilah balasan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 12: Allah mengabarkan, barangsiapa yang berbuat demikian di antara kalian wahai orang-orang yang beriman, yaitu mengimani Allah dan berjihad di jalan Allah; Maka sungguh Allah akan mengampuni segala dosa dan menghapuskan bagimu dengan karunia dari-Nya dan kasih sayang-Nya, serta memasukkan ke dalam surga yang mengalir di bawah pepohonan dan istananya sungai-sungai. Dan Allah akan memberikan kalian istana yang di dalamnya terdapat segala jenis kebaikan dan manfaat. Istana ini terdapat di surga yang tinggi yang tidak akan terputus kenikmatannya. Ketahuilah bahwa semai ini yang diberikan kepada kalian dari ampunan dosa dan kekekalan di surga adalah sebuah keberhasilan yang besar, yang tidak ada keberhasilan yang semisalnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dosa-dosa kecil maupun dosa-dosa besar. Yakni di bawah tempat tinggal, istana dan pohon-pohon mengalir sungai-sungai dari air yang tidak berubah rasa dan baunya, sungai-sungai dari air susu yang tidak beubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh segala macam buah-buahan di dalamnya. Yang menghimpun semua yang baik berupa tempat yang tinggi, bangunan yang indah dan menarik sampai-sampai penghuni surga yang berada di tempat yang tinggi dilihat oleh penghuni surga yang lain seperti dilihatnya bintang yang gemerlap di ufuk timur atau di ufuk barat, bahkan bangunan surga sebagiannya dari bata emas dan sebagian lagi dari bata perak, kemahnya dari mutiara dan marjan, sebagian tempat dari zamrud dan permata yang berwarna indah. Saking beningnya; bagian luar dapat terlihat dari dalam dan bagian dalam dapat terlihat dari luar. Kebaikan dan keindahan di dalamnya tidak dapat disifatkan oleh orang-orang yang menyifatkan, tidak pernah terlintas di hati manusia, dan mereka tidak mengkin mengetahui sampai mereka melihatnya, dan mereka bersenang-senang dengan indahnya serta merasa sejuk mata mereka karenanya. Surga dinamakan ‘Adn karena penduduknya kekal di sana, tidak akan keluar darinya selama-lamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 12",
    "description": "Keuntungan yang bisa kamu peroleh dengan perniagaan itu adalah niscaya Allah mengampuni dosa-dosamu, baik dosa yang disengaja maupun yang tidak disengaja dan memasukkan kamu ke dalam surga di akhirat yang penuh kenikmatan, yang mengalir di bawahnya sungai-sungai, sehingga kehidupan terasa indah dan menyenangkan; dan juga Allah memasukkan kamu ke tempat-tempat tinggal yang baik di dalam surga 'adn sehingga kenikmatan terasa di atas kenikmatan. Itulah kemenangan yang besar, karena keputusan yang tepat selama hidup di dunia untuk beriman dan berjihad. 13. Bagi orang yang beriman dan berjihad selain mendapat ampunan dan masuk surga 'adn juga akan mendapat keuntungan lain yang sangat berharga. Dan ada lagi karunia yang lain yang kamu sukai dari keuntungan beriman dan berjihad pada jalan Allah, yaitu pertolongan dari Allah dalam menghadapi musuh-Musuh islam dan kaum muslim sehingga islam menjadi harum; dan kemenangan yang dekat waktunya untuk meraih kekuasaan dalam mengatur kehidupan ini. Dan sampaikanlah berita gembira kepada orang-orang mukmin karena dengan beriman dan berjihad mereka akan mendapat pertolongan dan kemenangan di dunia dan mendapat ampunan dan surga di akhirat."
  }
]