[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Jika kalian (wahai orang-orang beriman) melakukan apa yang Allah perintahkan kepada kalian, niscaya Allah menutupi dosa-dosa kalian, memasukkan kalian ke dalam surga-surga yang sungai-sungai mengalir di bawah istana-istana dan kebun-kebunnya, juga rumah-rumah yang suci dan bersih di surga abadi yang tidak ada habisnya. Itulah kemenangan sejati yang sesudahnya tidak ada kemenangan. Dan ada nikmat lain bagi kalian wahai orang-orang beriman, yang (amat) kalian cintai, yaitu kemenangan dari Allah yang kalian dapatkan dan kemenangan dunia yang terwujud melalui tangan kalian. Gembirakanlah orang-orang beriman (wahai Nabi) dengan kemenangan dan keunggulan di dunia dan surga di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan di antara keuntungan perdagangan ini adalah suatu pemberian yang pasti kalian menyukainya, dan itu disegerakan di dunia, yaitu Allah menolong kalian atas musuh-musuh kalian dan kemenangan yang dekat yang diberikan kepada kalian, yaitu pembebasan kota Makkah dan lainnya. Dan kabarkan -wahai Rasul- kepada orang-orang yang beriman apa yang menggembirakan mereka berupa pertolongan di dunia dan kemenangan dengan Surga di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَأُخْرَىٰ تُحِبُّونَهَا ۖ (Dan (ada lagi) karunia yang lain yang kamu sukai) Yakni hal lain yang kalian sukai. نَصْرٌ مِّنَ اللهِ((yaitu) pertolongan dari Allah) Yaitu pertolongan Allah bagi kalian. وَفَتْحٌ قَرِيبٌ ۗ( dan kemenangan yang dekat) Yaitu penakhlukan bagi kalian. Yakni Allah akan memenangkan kalian dalam menghadapi kaum Quraisy dan menakhlukkan kota Makkah. Imam ‘Atha berpendapat: yang dimaksud adalah penakhlukan negeri Persia dan Ramawi. وَبَشِّرِ الْمُؤْمِنِينَ(Dan sampaikanlah berita gembira kepada orang-orang yang beriman) Hai Muhammad, berilah kabar gembira kepada orang-orang beriman bahwa bagi mereka kemenangan dan penahklukan di dunia, dan surga di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dan bagi kalian di sisi Allah ada pahala lain yang akan membuat kalian takjub, yaitu pertolongan Allah atas kalian, dan kemenangan yang hendak kalian dapatkan berupa penaklukan Mekah. Sampaikanlah kabar gembira wahai Nabi kepada kaum muslim tentang pertolongan dan kemenangan di dunia dan tentang surga di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan yang lain} dan bagi kalian nikmat lain {yang kalian sukai, pertolongan dari Allah dan kemenangan yang dekat. Sampaikanlah berita gembira kepada orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Adapun pahala duniawi untuk transaksi ini disebutkan oleh Allah dalam FirmanNya, “Dan (ada lagi) karunia lain yang kamu sukai,” yakni, terdapat hal lain yang kalian peroleh yang kalian sukai yaitu, “pertolongan dari Allah” untuk kalian atas musuh-musuh kalian. Dengan kemenangan itu kalian mendapatkan kejayaan dan kesenangan, “dan kemenangan yang dekat (waktunya).” Dengan kemenangan ini kawasan Islam semakin meluas dan rizki yang luas pun didapat. Ini adalah balasan bagi orang-orang Mukmin yang berjihad. Adapun kaum Mukminin yang tidak berjihad, Allah tidak membuat mereka berputus asa dari karunia dan kebaikanNya, tapi Allah berfirman, “Dan sampaikanlah berita gembira kepada orang-orang yang beriman.” Maksudnya, dengan pahala yang langsung di dunia dan tertunda di akhirat. Masing-masing mendapatkan pahala berdasarkan keimanannya, meski mereka tidak mencapai tingkatan para mujahid yang berjuang di jalan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 13: Allah menjelaskan penyandaran atas kenikmatan yang telah lalu yang bahwasanya Allah memberikan kalian kenikmatan yang lain yang kalian akan menyukainya dan akan mendapatinya, dan ia adalah pertolongan yang akan datang kepada kalian, dan kemenangan yang segera menyempurnakan kenikmatan itu di hadapan kalian. Dan kabarkanlah wahai Nabi Allah kepada orang-orang yang beriman atas pertolongan dan kemenangan di dunia, dan surga di akhirat, hingga bertambah keimanan atas keimanan yang telah mereka miliki, dan bertambah hati-hati mereka dengan kelapangan dan kebahagiaan. Dan tidak diragukan lagi bahwa penaklukan Mekkah dan masuknya manusia menuju agama Allah dengan berbondong-bondong adalah termasuk pertolongan Allah dan kemengan itu dekat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Adapun balasan di dunia terhadap perdagangan ini sebagaimana dalam ayat tersebut adalah pertolongan dari Allah terhadap musuh sehingga diperoleh kemuliaan dan kegembiraan, serta kemenangan yang dekat (waktunya). Dari kemenangan itu wilayah Islam menjadi meluas dan kaum muslimin mendapatkan rezeki yang banyak. Ini merupakan balasan bagi kaum mukmin yang berjihad, adapun kaum mukmin yang tidak berjihad karena sudah diwakili oleh yang lain, maka Allah Subhaanahu wa Ta'aala tidak membuat mereka berputus asa karena karunia dan ihsan-Nya, bahkan Dia berfirman, “Dan sampaikanlah berita gembira kepada orang-orang mukmin.” Yakni dengan pahala yang segera atau ditunda, masing-masing disesuaikan dengan keimanannya meskipun mereka tidak mencapai derajat para mujahid fii sabilillah sebagaimana dalam hadits berikut: عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ صلى الله عليه وسلم قَالَ : مَنْ آمَنَ بِاللَّهِ وَرَسُولِهِ ، وَأَقَامَ الصَّلاَةَ ، وَصَامَ رَمَضَانَ ، كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ هَاجَرَ ، فِى سَبِيلِ اللَّهِ ، أَوْ جَلَسَ فِى أَرْضِهِ الَّتِى وُلِدَ فِيهَا . قَالُوا : يَا رَسُولَ اللَّهِ أَفَلاَ نُنَبِّئُ النَّاسَ بِذَلِكَ . قَالَ : إِنَّ فِى الْجَنَّةِ مِائَةَ دَرَجَةٍ أَعَدَّهَا اللَّهُ لِلْمُجَاهِدِينَ فِى سَبِيلِهِ ، كُلُّ دَرَجَتَيْنِ مَا بَيْنَهُمَا كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ ، فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَ ، فَإِنَّهُ أَوْسَطُ الْجَنَّةِ وَأَعْلَى الْجَنَّةِ ، وَفَوْقَهُ عَرْشُ الرَّحْمَنِ ، وَمِنْهُ تَفَجَّرُ أَنْهَارُ الْجَنَّةِ » . Dari Abu Hurairah dari Nabi shallallahu 'alaihi wa sallam, Beliau bersabda, “Barang siapa beriman kepada Allah dan Rasul-Nya, mendirikan shalat dan berpuasa di bulan Ramadhan, maka Allah berhak memasukkannya ke surga, baik ia berhijrah di jalan Allah atau duduk di negeri tempat ia dilahirkan.” Para sahabat berkata, “Wahai Rasulullah, bolehkah kami memberitahukan hal itu kepada manusia.” Beliau menjawab, “Sesungguhnya di surga ada seratus derajat yang Allah siapkah bagi mujahid fi sabiilillah, di mana masing-masing derajat sebagaimana jarak antara langit dan bumi. Jika kamu meminta (surga) kepada Allah, maka mintalah surga Firdaus, karena ia adalah surga yang paling tengah dan paling tinggi, di atasnya ada singgasana Ar Rahman dan dari sana mengalir sungai-sungai surga.” (HR. Bukhari)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 13",
    "description": "Bagi orang yang beriman dan berjihad selain mendapat ampunan dan masuk surga 'adn juga akan mendapat keuntungan lain yang sangat berharga. Dan ada lagi karunia yang lain yang kamu sukai dari keuntungan beriman dan berjihad pada jalan Allah, yaitu pertolongan dari Allah dalam menghadapi musuh-Musuh islam dan kaum muslim sehingga islam menjadi harum; dan kemenangan yang dekat waktunya untuk meraih kekuasaan dalam mengatur kehidupan ini. Dan sampaikanlah berita gembira kepada orang-orang mukmin karena dengan beriman dan berjihad mereka akan mendapat pertolongan dan kemenangan di dunia dan mendapat ampunan dan surga di akhirat. 14. Wahai orang-orang yang beriman! di mana pun dan kapan pun kamu hidup, jadilah kamu penolong-penolong agama Allah dengan memahami, mengamalkan, dan mengharumkan islam dan kaum muslim, serta berjihad membela hak dan kehormatan islam sebagaimana isa putra maryam telah berkata kepada pengikut-pengikutnya yang setia, kaum hawariyun, 'siapakah yang akan menjadi penolong-penolongku untuk menegakkan agama Allah dalam kehidupan ini'' pengikut-pengikutnya yang setia itu berkata kepada nabi isa dengan meyakinkan, 'kamilah penolong-penolong agama Allah. ' mereka menyampaikan ajaran Allah kepada masyarakat dan mengajak masyarakat beriman dan mengamalkannya; lalu segolongan dari bani israil beriman kepada Allah dan mengikuti ajaran nabi isa dengan setia; dan segolongan yang lain yang jumlahnya jauh lebih banyak memilih kafir, yaitu menjadi orang yang menutup diri, menolak, dan mendustakan ajaran nabi isa, bahkan berusaha menghalangi penyebaran ajarannya dan membunuh para juru dakwahnya. Orang beriman itu bermunajat kepada kami, lalu kami memberikan kekuatan kepada orang-orang yang beriman terhadap musuh-Musuh mereka dengan menghilangan perasaan lemah, takut, dan ragu untuk berjihad sehingga mereka menjadi orang-orang yang menang dalam menghadapi musuh."
  }
]