[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, jadilah kalian orang-orang yang menolong agama Allah sebagaimana rekan-rekan Isa dan para sahabat dekatnya menjadi orang-orang yang menolong agama Allah ketika Isa berkata kepada mereka, “Siapa di antara kalian yang bersedia menolong dan membantuku dalam urusan yang mendekatkan kepada Allah?” mereka menjawab, “kami adalah orang-orang yang menolong agama Allah.” Maka sekelompok Bani Israil mendapatkan petunjuk dan sekelompok lainnya tersesat. Lalu Kami menguatkan orang-orang yang beriman kepada Allah dan RasulNya, Kami menangkan mereka atas orang-orang yang memusuhi mereka dari kelompok-kelompok kaum Nasrani, sehingga mereka berkuasa atas mereka, dan hal itu dengan mengutus Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan untuk mereka, jadilah penolong-penolong Allah dengan pertolongan kalian kepada agama-Nya yang dibawa oleh Rasul-Nya, seperti pertolongan kaum Hawariyun tatkala Isa berkata kepada mereka, “Siapakah yang mau menjadi penolong-penolongku kepada Allah?” Maka mereka menjawab dengan segera, “Kami adalah penolong Allah.” Lalu sebagian dari Bani Israil beriman kepada Isa -'alaihissalām- dan sebagian yang lain kafir terhadapnya, maka Kami berikan kekuatan kepada orang-orang yang beriman kepada Isa -'alaihissalām- atas orang-orang yang kafir kepadanya, sehingga mereka menang atas orang-orang yang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Hai orang-orang beriman, jadilah para penolong agama Allah; sebagaimana para sahabat Nabi Isa yang menjadi para penolong agama Allah; ketika Nabi Isa berkata kepada mereka: “Siapa yang akan membantuku untuk menolong agama Allah?” Maka para sahabatnya itu menjawab: “Kami adalah para penolong agama Allah. Maka sebagian Bani Israil beriman kepada dakwah Nabi Isa, dan sebagian lainnya mengingkarinya. Dan kemudian Kami menguatkan orang-orang beriman dan menolong mereka dalam menghadapi musuh-musuh mereka yang kafir; sehingga mereka meraih kemenangan berkat hujjah dan keimanan mereka. Ibnu Abbas berkata: (Lalu segolongan dari Bani Israil beriman) Yakni: golongan yang beriman di zaman Nabi Isa. (Dan segolongan lainnya kafir) Yakni: golongan yang kafir di zaman Nabi Isa. (Maka Kami berikan kekuatan kepada orang-orang yang beriman) Yakni pada zaman Nabi Isa. (Terhadap musuh-musuh mereka) Yakni dengan bantuan Nabi Muhammad bagi agama mereka dalam menghadapi orang-orang kafir, (Sehingga mereka menjadi orang-orang yang menang). (Diriwayatkan oleh Ibnu Abi Syaibah dalam al-Mushannaf 7/461 dan sanadnya shahih)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ كُونُوٓا۟ أَنصَارَ اللهِ (Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah) Yakni tetaplah kalian menjadi penolong agama Allah. كَمَا قَالَ عِيسَى ابْنُ مَرْيَمَ لِلْحَوَارِيِّۦنَ مَنْ أَنصَارِىٓ إِلَى اللهِ ۖ (sebagaimana Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?”) Yakni tolonglah agama Allah seperti pertolongan yang diberikan oleh Hawariyun kepada Isa, ketika ia berkata kepada mereka: “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?” Maka mereka mengatakan: نَحْنُ أَنصَارُ اللهِ ۖ(“Kamilah penolong-penolong agama Allah”) Yakni siapa yang siap menolong dan membantuku dalam hal yang dapat mendekatkan diri kepada Allah. Hawariyun adalah para penolong Isa al-Masih dan para sahabatnya yang paling setia serta orang-orang yang pertama-tama beriman kepadanya. Mereka berjumlah 12 orang. فَـَٔامَنَت طَّآئِفَةٌ مِّنۢ بَنِىٓ إِسْرٰٓءِيلَ(lalu segolongan dari Bani Israil beriman) Yakni beriman kepada Isa. وَكَفَرَت طَّآئِفَةٌ ۖ فَأَيَّدْنَا الَّذِينَ ءَامَنُوا۟ عَلَىٰ عَدُوِّهِمْ(dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka) Yakni Kami kuatkan orang-orang yang benar untuk menolong orang-orang yang batil dari Bani Israil. فَأَصْبَحُوا۟ ظٰهِرِينَ(lalu mereka menjadi orang-orang yang menang) Yakni menang dan berkuasa. Abdurrazzaq dan Abdun bin Hamid meriwayatkan dari Qatadah, tentang firman Allah: يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ كُونُوٓا۟ أَنصَارَ اللهِ ia berkata: “Hal itu telah terwujud, Alhamdulillah. 70 orang mendatangi Rasulullah kemudian membaiat beliau di ‘Aqabah, mereka melindungi dan menolong beliau hingga Allah memenangkan agama-Nya.” Dan Ibnu Ishaq dan Ibnu Sa’d meriwayatkan, Rasulullah bersabda kepada orang-orang yang menemuinya di Aqabah: “Pilihlah bagiku dua belas orang dari kalian untuk menjadi pelindung dari kaumnya, sebagaimana Hawariyun menjadi pelindung bagi Isa bin Maryam.” Kemudian Rasulullah bersabda kepada orang-orang yang dipilih: “Kalian adalah pelindung dari kaum kalian seperti perlindungan yang diberikan Hawariyun bagi Isa bin Maryam; dan aku adalah pelindung dari kaumku.” Maka mereka menjawab: “Iya, (kami siap melakukannya).”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Wahai kaum mukmin, jadilah kalian sebagai penolong-penolong agama Allah dengan selalu mengikuti perintah-perintahNya dan menjauhi larangan-laranganNya. Sebagaimana yang dikatakan Isa bin Maryam kepada pengikut-pengikut setianya: “Siapa di antara kalian yang menjadi tentara-tentaraku untuk menolong agama Allah dan mendakwahkannya?, Lalu mereka berkata: “Kami adalah orang-orang yang menolong agama Allah bersamamu”. Kemudian satu kelompok Bani Israil beriman melalui dakwah Isa AS, sedangkan kelompk lainnya menyimpang dari risalahnya. Lalu kami menguatkan orang-orang yang beriman dalam hujjahnya atau dalam peperangannya melawan musuh-musuh yang bathil. Setelah Isa diangkat, mereka unggul dengan hujjah dan penjelasan itu. Abdur Razaq dan Abd bin Hamid mengutip dari Qatadah tentang firmanNya {Kuunuu Anshaarallah}, dia berkata: “Ayat tersebut adalah untuk memuji Allah. Suatu saat datang kepadanya (Nabi SAW) 7 orang. Mereka berjanji untuk mematuhinya, melindunginya dan menolongnya sehingga Allah menampakkan agamaNya (kepada mereka)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jadilah penolong-penolong (agama) Allah sebagaimana Isa putra Maryam berkata kepada pengikut-pengikutnya yang setia,“Siapakah para penolongku menuju kepada Allah” Para pengikutnya yang setia itu berkata,“Kamilah penolong-penolong (agama) Allah” Maka segolongan dari Bani Israil beriman dan segolongan lainnya ingkar. Lalu Kami menguatkan} Kami menguatkan {orang-orang yang beriman atas musuh-musuh mereka sehingga menjadi orang-orang yang menang} menang atas mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Kemudian Allah berfirman, “Hai orang-orang yang beriman, jadilah kamu penolong-penolong (agama) Allah,” yaitu dengan perkataan dan perbuatan dengan cara menegakkan agama Allah serta gigih dalam menyebarkannya pada orang lain dan memerangi mereka yang menentang dan menolaknya dengan raga dan harta. Memerangi orang yang menolong kebatilan yang dikiranya sebagai ilmu dan menolak kebenaran dengan cara meruntuhkan hujjahnya dan waspada terhadapnya. Termasuk menolong agama Allah adalah mempelajari kitab Allah dan Sunnah rasulNya serta mengajarkannya dan mendorong orang lain untuk mempelajari kitab Allah dan Sunnah RasulNya serta mengajarkannya serta memerintahkan kebaikan dan mencegah kemungkaran. Selanjutnya Allah mendorong orang-orang yang beriman agar meneladani orang-orang shalih sebelumnya seraya berfirman, “SEbagaimana Isa putra Maryam telah berkata kepada pengikut-pengikutnya yang setia, ‘Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?’” maksudnya, Nabi Isa berkata kepada mereka seraya mengingatkan siapa yang menolongnya dan tegak bersamanya untuk menolong agama Allah, masuk dan keluar bersamaku. Para pengikut-pengikutnya yang setia bersegera dan berkata, “Kamilah penolong-penolong agama Allah!” Nabi Isa pun menunaikan perintah Allah dan menolong agamaNya bersama penolong-penolong yang setia. “Maka segolongan dari Bani Israil beriman,” karena seruan Nabi Isa dan penolong-penolongnya yang setia, “dan segolongan (yang lain) kafir,” dari kalangan mereka dengan tidak tunduk pada seruan Isa dan dan para penolongnya. Kemudian orang-orang Mukmin memerangi orang-orang kafir “maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka,” maksudnya Kami kuatkan mereka dan Kami memberikan kemenangan bagi mereka atas musuh-musuh mereka, “lalu mereka menjadi orang-orang yang menang” atas mereka dan menundukkan mereka. Dan kalian wahai umat Muhammad! Jadilah penolong Allah dan penyeru agamaNya, niscaya Allah akan menolong orang-orang sebelum kalian dan memenangkan kalian dari musuh-musuh kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 14: Allah menganjurkan kepada orang-orang yang beriman agar menolong agama-Nya, Allah berkata : Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, jadilah kalian penolong-penolong Allah dengan meninggikan kalimat-Nya, sebagaimana perkataan Isa bin Maryam kepada Hawariyyun: Siapa yang akan menolongku dan membantuku untuk menyampaikan dakwah di jalan Allah ? Berkata Hawariyun : Kami yang akan menolongmu. Ketika sampai kerisalahan Isa dari Rabbnya, maka sekelompok manusia dari bani israil mendapatkan petunjuk, dan tersesat kelompok yang lain. Dan Allah menguatkan dan menolong orang-orang yang beriman atas musuh-musuh mereka, dan mereka disini adalah orang-orang kafir. Dengan ini jadilah orang-orang yang beriman menang dan menguasai para musuh-musuh mereka dengan karunia dari Allah yang utamanya, kemudian dengan pertolongan yang diberikan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan menegakkan agama Allah baik dengan ucapan maupun perbuatan, pada diri dan orang lain. Demikian juga berjihad kepada orang-orang yang menentangnya baik dengan jiwa maupun harta. Termasuk menegakkan agama Allah adalah mempelajari kitabullah dan sunnah Rasul-Nya serta mendorong manusia kepadanya, dan melakukan amr ma’ruf dan nahi munkar. Selanjutnya, Allah mendorong kaum mukmin untuk mengikuti generasi sebelum mereka yang saleh. Dengan sebab dakwah Nabi Isa ‘alaihis salam dan para pengikut setianya (hawariyyin). Mereka tidak mau mengikuti dakwah mereka (Nabi Isa dan hawariyyin), sehingga kaum mukmin berjihad melawan orang-orang kafir. Oleh karena itu, kamu wahai umat Muhammad jadilah penolong agama Allah dan para penyeru kepadanya, niscaya Allah akan menolongmu sebagaimana Dia telah menolong orang-orang sebelummu dan memenangkan mereka terhadap musuh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 14",
    "description": "Wahai orang-orang yang beriman! di mana pun dan kapan pun kamu hidup, jadilah kamu penolong-penolong agama Allah dengan memahami, mengamalkan, dan mengharumkan islam dan kaum muslim, serta berjihad membela hak dan kehormatan islam sebagaimana isa putra maryam telah berkata kepada pengikut-pengikutnya yang setia, kaum hawariyun, 'siapakah yang akan menjadi penolong-penolongku untuk menegakkan agama Allah dalam kehidupan ini'' pengikut-pengikutnya yang setia itu berkata kepada nabi isa dengan meyakinkan, 'kamilah penolong-penolong agama Allah. ' mereka menyampaikan ajaran Allah kepada masyarakat dan mengajak masyarakat beriman dan mengamalkannya; lalu segolongan dari bani israil beriman kepada Allah dan mengikuti ajaran nabi isa dengan setia; dan segolongan yang lain yang jumlahnya jauh lebih banyak memilih kafir, yaitu menjadi orang yang menutup diri, menolak, dan mendustakan ajaran nabi isa, bahkan berusaha menghalangi penyebaran ajarannya dan membunuh para juru dakwahnya. Orang beriman itu bermunajat kepada kami, lalu kami memberikan kekuatan kepada orang-orang yang beriman terhadap musuh-Musuh mereka dengan menghilangan perasaan lemah, takut, dan ragu untuk berjihad sehingga mereka menjadi orang-orang yang menang dalam menghadapi musuh. 1. Apa yang ada di langit, bintang, bulan, matahari dan seluruh planet; dan apa yang ada di bumi, hewan dan tetumbuhan bertasbih kepada Allah, mengakui dan menyatakan kemahasucian Allah yang berbeda dengan seluruh makhluk ciptaan-Nya; dia adalah maharaja yang kekuasaan-Nya mutlak; yang mahasuci dari segala yang diduga manusia; dan dialah yang mahaperkasa menciptakan dan menghancurkan jagat raya sekejap mata; mahabijaksana, tidak terburu menggunakan kekuasaan-Nya yang tiada terbatas untuk menghancurkan jagat raya atau menghukum manusia yang berdosa."
  }
]