[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan SyariatNya, mengapa kalian menjanjikan sesuatu dan mengucapkan sesuatu yang kalian tidak lakukan? Ini adalah pengingkaran terhadap orang yang perbuatannya menyelisihi perkataaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Wahai orang-orang yang beriman kepada Allah! Kenapa kalian berkata, “Kami telah berbuat sesuatu.” Padahal sebenarnya kalian tidak melakukannya? Seperti ucapan seseorang di antara kalian, “Aku telah berperang dengan pedangku dan aku telah menebaskannya.” Padahal dia tidak berperang dengan pedangnya dan tidak menebas dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Allah menegur orang-orang beriman: “Mengapa kalian mengaku beriman namun tidak kalian buktikan dengan perbuatan? Sungguh besar kemurkaan Allah jika kalian mengatakan sesuatu, namun kalian tidak menjalankannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لِمَ تَقُولُونَ مَا لَا تَفْعَلُونَ (Wahai orang-orang yang beriman, kenapakah kamu mengatakan sesuatu yang tidak kamu kerjakan?) Ibnu Abbas berkata: dahulu sebelum diwajibkan jihad, sebagian orang-orang beriman berkata: “Kami berharap Allah memberitahu kami amal yang paling Dia cintai agar kami dapat menjalankannya.” Namun setelah Allah memberitahu mereka bahwa amal yang paling Dia cintai adalah jihad, ternyata mereka enggan melakukannya dan merasa berat untuk menjalankan perintah-Nya itu. maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Wahai orang-orang mukmin, kenapa kalian berkata: “Sungguh kami telah melakukan sesuatu”, sedangkan kalian tidak melakukannya?. Hal ini sebagai teguran atas kebohongan mereka saat meminta (perintah) jihad atau ibadah lainnya. Ibnu Jarir dari Ibnu Abbas berkata: “Sebelum ada perintah jihad, orang-orang mukmin berkata:”Kami senang jika Allah menunjukkan kami amalan-amalan yang paling dicintaiNya, maka kami akan mengerjakannya”. Kemudian Allah memberitahu NabiNya bahwa amalan yang paling dicintai Allah adalah beriman kepadaNya tanpa ragu, berjihad melawan orang-orang yang selalu berbuat maksiat yang menolak beriman kepadaNya, dan mengakui risalah NabiNya SAW. Saat perintah jihad turun, orang-orang mukmin tersebut tidak menyukainya dan membuat mereka terpecah belah. Kemudian Allah menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman mengapa kalian mengatakan sesuatu yang tidak kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-3. “Hai orang-orang yang beriman, mengapa kamu mengatakan apa yang tidak kamu perbuat,” maksudnya, mengapa kalian mengatakan kebaikan dan mendorongnya, dan boleh jadi kalian memuji-muji kebaikan itu namun tidak kalian lakukan? Mengapa kalian melarang keburukan, boleh jadi kalian sucikan diri kalian dari keburukan tersebut namun kalian lakukan bahkan menjadi sifat kalian? Lantas apakah kondisi tercela seperti ini pantas bagi orang-orang yang beriman? Bukankah amat besar murka Allah pada orang yang mengatakan sesuatu namun tidak dikerjakan? Karena itu, orang yang memerintahkan berbuat baik seharusnya menjadi orang pertama yang melakukannya. Dan orang yang melarang keburukan seharusnya menjadi orang yang paling jauh darinya. Allah berfirman, “Mengapa kamu suruh orang lain (mengerjakan) kebaktian, sedang kamu melupakan diri (kewajiban)mu sendiri, padahal kamu membaca Al Kitab (Taurat)? Maka tidaklah kamu berpikir?” -Al-baqarah:44 Nabi syuaib berkata kepada kaumnya, “Dan aku tidak berkehendak menyalahi kamu (dengan mengerjakan) apa yang aku larang.” -Hud: 88-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 2: 2-3. Allah memperingatkan atas ibadah seorang hamba yang beriman untuk meninggalkan persetujuan atas amalan yang hanya berupa perkataan, Allah berkata : Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, kenapa kalian katakan dari kebaikan atas apa yang tidak kalian kerjakan ? Sungguh besar perbuatan jahat ini di sisi Allah, yaitu kalian yang mengatakan, tapi kalian tidak mengamalkan. Karena sebuah amanah yang diberikan kepada manusia yang lain adalah petunjuk bagi kejujuran dan kemulian atas tabiat manusia dan baiknya kebiasaan yang mengatakan. Diriwayatkan dari hadits yang dikeluarkan oleh Ahmad dan Tirmidzi dari Abdullah bin Sallam : Bahwasanya para lelaki dari para sahabat berkata : Seandainya kami mengetahui sebuah amalan yang utama, yang dicintai Allah ketika seorang hamba mengamalkannya, sungguh kami pasti mengamalkannya. Kemudian Allah menurunkan : Telah bertasbih kepada Allah apa saja yang ada di langit dan apa saja yang ada di bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana. Wahai orang-orang yang beriman, kenapa kamu mengatakan sesuatu yang tidak kamu kerjakan? {Ash Shaf 1-2}. Berkata Abdullah bin Sallam : Maka Rasulullah ﷺ membacakan ayat tersebut kepada kami. Ini adalah hadits yang disebutkan Ibnu Katsir dalam tafsirnya, kemudian Ibnu Katsir berkata : Sesungguhnya ucapan yang tanpa pembenaran dengan amal, menjadi penyebab celaan dan sesuatu yang tidak disenangi, ia adalah sebesar-besar sesuatu yang dibenci dan membuat kemurkaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengapa kamu berkata tentang kebaikan dan mendorong orang lain kepadanya, bahkan terkadang kamu berbangga dengannya, namun kamu tidak melakukannya, dan kamu melarang mengerjakan keburukan bahkan terkadang kamu menganggap bersih dirimu, namun ternyata kamu malah dilumuri oleh dosa-dosa? Apakah keadaan yang tercela ini layak bagi orang-orang mukmin? Atau bukankah yang demikian termasuk sangat dibenci Allah, yakni mengatakan apa yang tidak dikerjakannya? Oleh karena itu, sepatutnya bagi orang yang memerintahkan kepada kebaikan menjadi orang yang pertama melakukannya, dan orang yang melarang keburukan menjadi orang yang pertama paling jauhi darinya. Allah Subhaanahu wa Ta'aala berfirman, “Mengapa kamu suruh orang lain (mengerjakan) kebaikan, sedang kamu melupakan diri (kewajiban)mu sendiri, padahal kamu membaca kitab? Maka tidakkah kamu berpikir?” (Terj. Al Baqarah: 44)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 2",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! mengapa kamu mengatakan secara terbuka di hadapan orang banyak atau secara tertutup sesuatu yang tidak kamu kerjakan' apakah kamu merasa tidak bersalah melakukannya'3. Perbuatan kamu, wahai orang-orang yang beriman, yang tidak melakukan apa yang sudah dikatakan atau disampaikan kepada orang lain sangatlah dibenci di sisi Allah, jika kamu mengikuti kebiasaan orang-orang munafik, mengatakan apa-apa yang tidak kamu kerjakan, bermuka dua, tidak ada kesatuan kata dan perbuatan dan tidak ada integritas."
  }
]