[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Amat besar murka Allah bila kalian berkata dengan lisan kalian apa yang tidak kalian lakukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sungguh besar kebencian dan kemurkaan di sisi Allah bila kalian mengatakan sesuatu yang tidak kalian kerjakan. Tidak pantas bagi seorang yang beriman kecuali berbuat jujur terhadap Allah, amalnya sesuai ucapannya"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. كَبُرَ مَقْتًا عِندَ اللهِ أَن تَقُولُوا۟ مَا لَا تَفْعَلُونَ (Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tidak kamu kerjakan) Yakni Allah sangat membenci perbuatan itu. Pendapat lain mengatakan bahwa ayat ini diturunkan bagi kaum yang mendatangi Rasulullah kemudian salah seorang mereka berkata: “Aku telah ikut berperang dengan pedangku, dan aku telah memukul ini dan itu.” padahal mereka tidak melakukan itu semua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Kemudian Allah mencela orang-orang yang berkata-kata tersebut. Allah membenci mereka (Al-Maqtu adalah kebencian yang sangat besar) dengan kebencian yang amat besar. {Kabura} artinya agung dan besar. {Maqtan} adalah kebencian yang sangat besar di sisi Allah bagi kalian akibat ucapan kalian yang tidak kalian laksanakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sangat besarlah kemurkaan} sangat besar kemurkaan {di sisi Allah bahwa kalian mengatakan apa yang tidak kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-3. “Hai orang-orang yang beriman, mengapa kamu mengatakan apa yang tidak kamu perbuat,” maksudnya, mengapa kalian mengatakan kebaikan dan mendorongnya, dan boleh jadi kalian memuji-muji kebaikan itu namun tidak kalian lakukan? Mengapa kalian melarang keburukan, boleh jadi kalian sucikan diri kalian dari keburukan tersebut namun kalian lakukan bahkan menjadi sifat kalian? Lantas apakah kondisi tercela seperti ini pantas bagi orang-orang yang beriman? Bukankah amat besar murka Allah pada orang yang mengatakan sesuatu namun tidak dikerjakan? Karena itu, orang yang memerintahkan berbuat baik seharusnya menjadi orang pertama yang melakukannya. Dan orang yang melarang keburukan seharusnya menjadi orang yang paling jauh darinya. Allah berfirman, “Mengapa kamu suruh orang lain (mengerjakan) kebaktian, sedang kamu melupakan diri (kewajiban)mu sendiri, padahal kamu membaca Al Kitab (Taurat)? Maka tidaklah kamu berpikir?” -Al-baqarah:44 Nabi syuaib berkata kepada kaumnya, “Dan aku tidak berkehendak menyalahi kamu (dengan mengerjakan) apa yang aku larang.” -Hud: 88-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 3: 2-3. Allah memperingatkan atas ibadah seorang hamba yang beriman untuk meninggalkan persetujuan atas amalan yang hanya berupa perkataan, Allah berkata : Wahai orang-orang yang beriman kepada Allah dan Rasul-Nya, kenapa kalian katakan dari kebaikan atas apa yang tidak kalian kerjakan ? Sungguh besar perbuatan jahat ini di sisi Allah, yaitu kalian yang mengatakan, tapi kalian tidak mengamalkan. Karena sebuah amanah yang diberikan kepada manusia yang lain adalah petunjuk bagi kejujuran dan kemulian atas tabiat manusia dan baiknya kebiasaan yang mengatakan. Diriwayatkan dari hadits yang dikeluarkan oleh Ahmad dan Tirmidzi dari Abdullah bin Sallam : Bahwasanya para lelaki dari para sahabat berkata : Seandainya kami mengetahui sebuah amalan yang utama, yang dicintai Allah ketika seorang hamba mengamalkannya, sungguh kami pasti mengamalkannya. Kemudian Allah menurunkan : Telah bertasbih kepada Allah apa saja yang ada di langit dan apa saja yang ada di bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana. Wahai orang-orang yang beriman, kenapa kamu mengatakan sesuatu yang tidak kamu kerjakan? {Ash Shaf 1-2}. Berkata Abdullah bin Sallam : Maka Rasulullah ﷺ membacakan ayat tersebut kepada kami. Ini adalah hadits yang disebutkan Ibnu Katsir dalam tafsirnya, kemudian Ibnu Katsir berkata : Sesungguhnya ucapan yang tanpa pembenaran dengan amal, menjadi penyebab celaan dan sesuatu yang tidak disenangi, ia adalah sebesar-besar sesuatu yang dibenci dan membuat kemurkaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 3",
    "description": "Perbuatan kamu, wahai orang-orang yang beriman, yang tidak melakukan apa yang sudah dikatakan atau disampaikan kepada orang lain sangatlah dibenci di sisi Allah, jika kamu mengikuti kebiasaan orang-orang munafik, mengatakan apa-apa yang tidak kamu kerjakan, bermuka dua, tidak ada kesatuan kata dan perbuatan dan tidak ada integritas. 4. Ayat ini menyatakan bahwa Allah suka kepada orang-orang yang berjihad dalam barisan yang teratur. Sesungguhnya Allah mencintai orang-orang yang berperang di jalan-Nya untuk membela diri dan membela kehormatan islam dan kaum muslim dalam barisan yang teratur, kuat, militan, dan terorganisir dengan baik; mereka seakan-akan dalam membangun kekuatan umat seperti suatu bangunan yang tersusun kokoh, saling menguatkan komponen umat muslim yang satu terhadap komponen umat muslim lainnya."
  }
]