[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4. Sesungguhnya Allah mencintai orang-orang yang berperang di jalanNya dengan berbaris rapi seolah-olah mereka adalah bangunan yang kokoh lagi mantap sehingga musuh tidak dapat menembusnya. Ayat ini menetapkan keutamaan jihad dan para mujahidin, karena Allah mencintai hamba-hambaNYa yang beriman ketika mereka berbaris rapi menghadapi musuh-musuh Allah dan memerangi mereka dijalanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya Allah menyukai orang-orang beriman yang berperang di jalan-Nya untuk mencari rida-Nya dalam barisan, sebagian mereka berjejer dengan sebagian yang lain seakan-akan mereka adalah bangunan yang saling mengikat satu dengan yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Allah memuji orang-orang yang berjihad dan menegaskan kecintaan-Nya bagi mereka; ketika mereka berperang demi membela agama-Nya membentuk barisan-barisan, seakan-akan mereka adalah bangunan yang kokoh yang tidak dapat ditembus musuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنَّ اللهَ يُحِبُّ الَّذِينَ يُقٰتِلُونَ فِى سَبِيلِهِۦ (ungguhnya Allah menyukai orang yang berperang dijalan-Nya) Allah menjelaskan kepada mereka bahwa perang di jalan Allah merupakan hal yang paling dicintai Allah dari hamba-Nya. dan dalam hadits disebutkan: “Pokok perkara adalah Islam, tiangnya adalah shalat, dan tiangnya adalah jihad di jalan Allah.” صَفًّا(dalam barisan yang teratur) Yakni mereka mengatur diri mereka dalam barisan. كَأَنَّهُم بُنْيٰنٌ مَّرْصُوصٌ(seakan-akan mereka seperti suatu bangunan yang tersusun kokoh) Yakni mereka saling berdempetan sampai seperti satu tubuh, ini mereka lakukan karena kesungguhan mereka dalam menjalankan perintah Allah, tidak ada dari mereka yang menunda, dan mereka tidak dapat ditembus musuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya Allah meridhai orang-orang yang berperang di jalanNya untuk menjunjung tinggi firmanNya dengan berbaris dalam satu barisan, seakan-akan mereka adalah suatu bangunan yang (material-materialnya) saling berhimpitan dan melekat (kokoh) satu sama lain. Maknanya adalah seakan-akan mereka adalah satu kesatuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah mencintai orang-orang yang berperang di jalanNya dalam satu barisan} mereka membentuk barisan-barisan {seakan-akan mereka suatu bangunan yang tersusun kokoh} yang saling bergabung satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Ini merupakan dorongan motivasi dari Allah untuk hamba-hambaNya agar berjihad di jalanNya dan sebagai pengajaran bagi mereka apa yang harus dikerjakan. Yaitu, mereka harus berbaris dalam jihad secara sejajar dan lurus tanpa adanya celah dalam barisan. Barisan-barisan mereka harus teratur sehingga akan tercapai kesetaraan di antara mujahidin, saling memperkuat dan menimbulkan rasa takut bagi musuh serta saling menggiatkan satu sama lain. Karena itu, ketika Rasulullah menghadiri peperangan, beliau menata para sahabat dallam beberapa barisan serta mengatur mereka dalam berbagai posisi, agar masing-masing tidak mengandalkan pada yang lain, tapi masing-masing kelompok berkonsentrasi di posisinya dan menunaikan tugasnya. Dengan cara seperti ini, pekerjaan bisa tuntas dan kesempurnaan bisa di dapatkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 4: Allah menjelaskan bahwa siapa yang mencintai Allah, dia akan berjihad di jalan Allah; Allah menyukai mereka yang berperang di jalan Allah, yaitu berbaris-baris, seolah-olah mereka berbaris menyerupai tembok yang tidak ada celah padanya. Atau yang kokoh dan menempel yang padanya tiada celah. Dan sungguh ketika sebelumnya dalam memerangi orang-orang non arab pasukan kocar kacir, setiap pasukan mencari musuh masing-masing, dengan kata lain tercerai berai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan dorongan dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya untuk berjihad di jalan-Nya dan mengajarkan kepada mereka bagaimana yang seharusnya mereka lakukan, dan bahwa sepatutnya mereka berbaris secara rapi dalam jihad tanpa ada celah dalam barisan, dimana barisan mereka tersusun rapi dan tertib yang dengannya dicapai kesamaan antara para mujahid, saling bantu-membantu, membuat musuh gentar dan membuat semangat. Oleh karena itulah, Nabi shallallahu 'alaihi wa sallam apabila berperang menyusun barisan para sahabatnya dan merapikan posisi-posisi mereka sehingga tidak terjadi bersandarnya sebagian mereka kepada yang lain, bahkan masing-masing kelompok fokus di tempatnya dan mengerjakan tugasnya, sehingga dengan cara seperti ini sempurnalah amal dan tercapailah kesempurnaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 4",
    "description": "Ayat ini menyatakan bahwa Allah suka kepada orang-orang yang berjihad dalam barisan yang teratur. Sesungguhnya Allah mencintai orang-orang yang berperang di jalan-Nya untuk membela diri dan membela kehormatan islam dan kaum muslim dalam barisan yang teratur, kuat, militan, dan terorganisir dengan baik; mereka seakan-akan dalam membangun kekuatan umat seperti suatu bangunan yang tersusun kokoh, saling menguatkan komponen umat muslim yang satu terhadap komponen umat muslim lainnya. 5. Allah selanjutnya berbicara tentang orang-orang fasik yang menyakiti nabi musa karena pembangkangannya. Dan ingatlah wahai Muhammad, ketika musa berkata kepada kaumnya, bani israil, 'wahai kaumku! mengapa kamu menyakitiku dengan menyembah patung anak sapi ketika aku munajat kepada Allah di gunung sinai, dan menolak berjihad, padahal Allah menjanjikan kemenangan kepada kamu untuk masuk ke yerussalem. Apakah kamu tidak menyadari, padahal kamu sungguh mengetahui, bahwa sesungguhnya aku utusan Allah kepadamu untuk mengajarkan prinsip tiada tuhan selain Allah, tiada ibadah kecuali kepada-Nya, dan tidak mempertuhankan manusia'' maka ketika mereka berpaling dari kebenaran dengan menutup mata, telinga, pikiran, dan hati, maka Allah pun memalingkan hati mereka dari kebenaran dan membiarkan mereka sesat sehingga mereka bertambah jauh dari kebenaran. Dan Allah tidak akan memberi petunjuk kepada kaum yang fasik, yaitu yang terus-menerus berbuat dosa besar, tanpa merasa bersalah."
  }
]