[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Dan sampaikanlah kepada kaummu (wahai rosul) ketika Nabi Allah, Musa berkata kepada kaumnya, “Mengapa kalian menyakitiku dengan kata-kata dan perbuatan sedangkan kalian tahu bahwa aku adalah utusan Allah kepada kalian?” ketika mereka menyimpang dari kebenaran padahal mereka mengetahuinya dan bersikukuh di atasnya, maka Allah memalingkan hati mereka dari petunjuk sehingga tidak menerimanya, sebagai hukuman bagi mereka atas penyimpangan yang mereka pilih sendiri untuk diri mereka. Allah tidak memberikan hidayah kepada orang-orang yang menyimpang dari ketaatan dan jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan ingatlah -wahai Rasul- ketika Musa berkata kepada kaumnya, “Wahai kaumku, kenapa kalian menyakitiku dengan mengingkari perintahku, sedangkan kalian mengetahui bahwa aku adalah utusan Allah kepada kalian?” Ketika mereka condong dan melenceng dari kebenaran yang dibawa Musa kepada mereka, Allah jadikan hati mereka melenceng dari kebenaran dan istikamah. Sungguh Allah tidak memberi taufik kepada suatu kaum yang keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Hai Rasulullah, sampaikanlah kisah ketika Musa berkata kepada kaumnya dengan lembut: Hai kaumku, mengapa kalian menyakitiku dengan menyelisihiku dan memperlakukanku dengan adab yang buruk, sedangkan kalian mengetahui dengan yakin bahwa aku adalah Rasulullah yang diutus kepada kalian? Ketika mereka tetap berpaling dari kebenaran, maka Allah memalingkan hati mereka dari mengikuti kebenaran. Allah tidak akan memberi petunjuk bagi orang-orang yang menyelisihi perintah-perintah-Nya. Ibnu Katsir berkata: “Ayat ini mengandung larangan bagi orang-orang beriman dari menyakiti Nabi Muhammad, karena Allah berfirman: يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ ءَاذَوْا۟ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُوا۟ ۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهًا Hai orang-orang yang beriman, janganlah kamu menjadi seperti orang-orang yang menyakiti Musa; maka Allah membersihkannya dari tuduhan-tuduhan yang mereka katakan. Dan adalah dia seorang yang mempunyai kedudukan terhormat di sisi Allah. (al- Ahzab: 69)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ (Dan (ingatlah) ketika Musa berkata kepada kaumnya) Setelah Allah menyebutkan bahwa Dia mencintai orang yang berperang di jalan-Nya, kemudian Allah menjelaskan bahwa Musa dan Isa juga telah menyuruh untuk mengesakan Allah dan berjihad di jalan-Nya, serta siksaan telah menimpa orang yang menyelisihi mereka berdua. Hal ini agar umat Nabi Muhammad tidak melakukan terhadap Nabinya sebagaimana umat Nabi Musa dan Isa berlaku terhadap Nabi mereka. يٰقَوْمِ لِمَ تُؤْذُونَنِى(“Hai kaumku, mengapa kamu menyakitiku) Dengan menyelisihi perintahku kepada kalian yang berupa syariat-syariat yang diwajibkan Allah bagi kalian, atau dengan menyakitiku dengan cacian dan olokan. Dan ini telah disebutkan penjelasannya pada surat al-Ahzab: 69. وَقَد تَّعْلَمُونَ أَنِّى رَسُولُ اللهِ إِلَيْكُمْ ۖ( sedangkan kamu mengetahui bahwa sesungguhnya aku adalah utusan Allah kepadamu?”) Yakni mengapa kalian menyakitiku padahal kalian telah mengetahui bahwa aku adalah Rasulullah, dan seorang rasul seharusnya dihormati dan diagungkan; dan kalian juga sama sekali tidak meragukan risalahku karena telah menyaksikan berbagai mukjizat yang mengharuskan kalian untuk mengakui risalahku dan menjadikan kalian mengetahuinya dengan penuh keyakinan. فَلَمَّا زَاغُوٓا۟ أَزَاغَ اللهُ قُلُوبَهُمْ ۚ( Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka) Yakni setelah mereka enggan mengambil kebenaran dengan menyakiti nabi mereka, maka Allah membelokkan hati mereka dari kebenaran sebagai balasan atas apa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Ingatlah wahai Nabi, saat Musa berkata kepada kaumnya: “Wahai kaumku, kenapa kalian menyakitiku dengan berbuat maksiat dan menyeleweng dari perintah-perintahku dalam menjalani syariat-syariat yang diwajibkan oleh Allah kepada kalian? Sedangkan kalian mengetahui dengan seyakin-yakinnya bahwa aku adalah utusan Allah yang diutus kepada kalian dan Rasul itu ditaati dan dimuliakan”. Saat mereka condong menjauh dari kebenaran dan menyimpang dari petunjuk (Allah) dan kebenaran, maka Allah memalingkan pula hati mereka dari kebenaran dan membuatnya lebih jauh dari kebaikan sebagai balasan apa yang mereka perbuat. Allah tidak menolong kaum yang keluar dari ketaatan untuk melihat kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika Musa berkata kepada kaumnya,“Wahai kaumku, mengapa kalian menyakitiku. Padahal kalian mengetahui bahwa aku adalah utusan Allah kepada kalian” Maka ketika mereka berpaling} berpaling dari kebenaran {Allah memalingkan hati mereka} Allah memalingkan hati mereka dari menerima kebenaran {Allah tidak memberi petunjuk kepada kaum yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan (ingatlah)ketika Musa berkata kepada kaumnya,” seraya mencela mereka atas perbuatan yang mereka lakukan dan menegur dengan keras atas penyiksaan yang mereka lakukan padahal mereka mengetahui bahwa Nabi Musa adalah utusan allah, “Hai kaumku, mengapa kamu menyakitiku,” dengan perkataan dan perbuatan, “sedang kamu mengetahui bahwa aku adalah utusan Allah kepadamu?” hak seorang rasul adalah dimuliakan, diagungkan dan semua perintah dan hukumnya dilaksanakan segera. Adapun menyakiti utusan Allah yang kebaikannya terhadap manusia melebihi segala bentuk kebaikan setelah kebaikan Allah, adalah puncak sikap tidak tahu malu, sembrono dan menyimpang dari jalan yang lurus yang telah mereka ketahui dan mereka tinggalkan. Karena itu Allah berfirman, “Maka tatkala mereka berpaling,” maksudnya berpaling dari kebenaran sesuai keinginan mereka, “Allah memalingkan hati mereka,” sebagai hukuman bagi mereka atas penyimpangan yang mereka pilih untuk diri mereka dan keridhaan mereka pada penyimpangan itu. Allah tidak memberi pertolongan pada mereka untuk mendapatkan petunjuk, karena mereka tidak layak mendapatkan kebaikan. Yang layak bagi mereka hanyalah keburukan. “Dan Allah memberi petunjuk kepada kaum yang fasik.” Maksudnya, orang-orang yang sifat kefasikan terus menempel pada dirinya, dan mereka tidak memiliki niat untuk mencari petunjuk. Ayat mulia ini menunjukkan bahwa kesesatan manusia yang digariskan Allah bukanlah suatu kezhaliman Allah dan bukan hujjah manusia atas Allah. Kesesatan itu timbul disebabkan oleh mereka sendiri. Mereka menutup diri dari pintu hidayah, padahal sebenarnya mereka mengetahui. Allah pun membalas mereka dengan kesesatan dan penyimpangan, serta dirubah-rubahnya hati mereka, sebagai hukuman bagi mereka dan sebagai keadilan Allah terhadap mereka. Ini semakna dengan firman Allah “Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.” Al-An’am :110"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 5: Katakan wahai Nabi pada kaummu kisah seorang hamba dan kalimullah yaitu Musa bin Imran, ketika dia berkata kepada kaumnya bani israil : Wahai kaumku, jangan kalian mencela dan menyelisihi perintahku dan jangan kalian tinggalkan peperangan, sedangkan kalian mengetahui bahwa aku orang yang jujur atas apa yang aku bawa kepada kalian dari kerisalahan Tuhanku ? Dimana kaumnya menolak berperang bersama Musa dan mereka berkata : Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang gagah perkasa {Al Maidah : 22}. Setelah mereka condong kepada kebathilan, dan tellah diberitahukan akan kebenaran dan dampak dari kebathilan atas kebenaran, maka adzab Allah lah yang akan menimpa mereka, hati-hati mereka telah berubah dari mengikuti sebuah petunjuk menuju kepada adzab Allah. Dan Allah tidak akan memberi petunjuk bagi siapa yang keluar dari ketaatan dan hidayah-Nya. Dan tujuan dari disebutkannya kisah Musa adalah sebagai hiburan bagi Rasul ﷺ dan pengkabaran bahwasanya para Nabi ditimpa musibah dan orang-orang yang menyelisihi mereka dari kaum mereka, padahal mereka mengetahui bahwa mereka para Nabi adalah utusan Allah. Hal ini juga berlaku sebagai pengajaran dan pendidikan (qudwah) dari mereka yang sebelumnya dari para nabi dan orang-orang shalih, dan Allah menganjurkan untuk bersabar dan bermunasabah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kata-kata dan perbuatan. Yang seharusnya dihormati, dimuliakan, diikuti perintahnya dan diikuti ketetapannya. Hal itu, karena rasul telah berbuat baik kepada manusia yang seharusnya dibalas dengan kebaikan. Menimpalinya dengan keburukan merupakan tindakan kurang ajar, berani dan menyimpang dari jalan yang lurus. Dengan sengaja. Maksudnya karena mereka berpaling dari kebenaran, maka Allah membiarkan mereka sesat dan bertambah jauh dari kebenaran sebagai hukuman terhadap penyimpangan mereka atas pilihan mereka sehingga Allah tidak memberi mereka taufiq kepada petunjuk karena memang mereka tidak layak memperolehnya dan tidak cocok mendapatkan kebaikan. Yaitu mereka yang senantiasa berlaku fasik dan tidak ada maksud mencari petunjuk. Ayat yang mulia ini memberikan faedah bahwa Allah Subhaanahu wa Ta'aala tidaklah menyesatkan seseorang karena Dia berbuat zalim kepada mereka, bahkan karena keadilan-Nya dan bahwa mereka tidak memiliki hujjah terhadap-Nya. Yang demikian disebabkan oleh mereka sendiri; mereka tutup untuk diri mereka pintu petunjuk setelah mereka mengetahuinya sehingga Allah membalas mereka dengan menyesatkan dan menyimpangkan mereka serta membalikkan hati mereka sebagai hukuman dan keadilan dari-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 5",
    "description": "Allah selanjutnya berbicara tentang orang-orang fasik yang menyakiti nabi musa karena pembangkangannya. Dan ingatlah wahai Muhammad, ketika musa berkata kepada kaumnya, bani israil, 'wahai kaumku! mengapa kamu menyakitiku dengan menyembah patung anak sapi ketika aku munajat kepada Allah di gunung sinai, dan menolak berjihad, padahal Allah menjanjikan kemenangan kepada kamu untuk masuk ke yerussalem. Apakah kamu tidak menyadari, padahal kamu sungguh mengetahui, bahwa sesungguhnya aku utusan Allah kepadamu untuk mengajarkan prinsip tiada tuhan selain Allah, tiada ibadah kecuali kepada-Nya, dan tidak mempertuhankan manusia'' maka ketika mereka berpaling dari kebenaran dengan menutup mata, telinga, pikiran, dan hati, maka Allah pun memalingkan hati mereka dari kebenaran dan membiarkan mereka sesat sehingga mereka bertambah jauh dari kebenaran. Dan Allah tidak akan memberi petunjuk kepada kaum yang fasik, yaitu yang terus-menerus berbuat dosa besar, tanpa merasa bersalah. 6. Ayat ini membicarakan umat nabi isa yang menolak beriman kepada nabi Muhammad, padahal Allah sudah memberitahukan tentang kelahiran beliau di dalam injil. Dan ingatlah wahai Muhammad, ketika isa putra maryam berkata kepada kaumnya, 'wahai bani israil! sesungguhnya aku utusan Allah kepadamu untuk mengajarkan prinsip tiada tuhan selain Allah, tiada ibadah kecuali kepada-Nya, dan tidak mempertuhankan sesama manusia yang membenarkan kitab yang turun sebelumku, yaitu kitab taurat yang diturunkan kepada nabi musa dan memberi kabar gembira kepada kamu dengan seorang rasul yang akan datang setelahku, yang bernama ahmad dan/atau Muhammad yang merupakan nabi dan rasul terakhir; namun ketika rasul itu datang kepada mereka, kaum nasrani, dengan membawa bukti-bukti yang nyata tentang kenabian dan kerasulan beliau di dalam Al-Qur'an, mereka berkata kepada sesama orang-orang kristen, 'Al-Qur'an ini adalah sihir yang nyata, bukan wahyu Allah, bukan kitab suci. '"
  }
]