[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Orang-orang zhalim itu ingin membatalkan kebenaran yang dengannya Muhammad diutus, yaitu al-Quran, dengan ucapan-ucapan mereka yang dusta. Allah memenangkan kebenaran dengan menyempurnakan agamaNya sekalipun orang-orang yang mengingkari dan mendustakan membencinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Orang-orang yang mendustakan itu ingin untuk memadamkan cahaya Allah dengan ucapan-ucapan buruk dan menjelek-jelekkan kebenaran. Sungguh Allah menyempurnakan cahaya-Nya, meski mereka tidak suka. Yaitu dengan memenangkan agama-Nya, meninggikan kalimat-Nya di bagian timur bumi dan baratnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Orang-orang zalim itu ingin membantah kebenaran-kebenaran al-Qur’an dengan menyebarkan berita-berita bohong yang menentang Nabi Muhammad. Namun Allah akan memenangkan dan menolong agama-Nya, meskipun orang-orang yang mendustakan Allah dan rasul-Nya itu tidak menyukai hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. يُرِيدُونَ لِيُطْفِـُٔوا۟ نُورَ اللهِ بِأَفْوٰهِهِمْ (Mereka ingin memadamkan cahaya Allah dengan mulut mereka) Yakni usaha mereka dalam menghinakan Islam dan menghalangi petunjuknya dengan perkataan-perkataan dusta seperti orang yang hendak memadamkan api sang sangat besar dengan tiupan dari mulutnya. وَاللهُ مُتِمُّ نُورِهِۦ (tetapi Allah (justru) menyempurnakan cahaya-Nya) Dengan memenangkan agama Islam di seluruh penjuru dunia dan meninggikannya di atas agama lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Orang-orang kafir itu ingin berbuat bathil terhadap syariat Allah dengan kebohongan mereka kepada para Rasul melalui ucapan-ucapan mereka yang mereka-reka bahwa Al-Qur’an itu adalah sihir, syair atau ilmu perdukunan. Allah adalah Dzat yang menampakkan agamaNya dan menebarkanNya di cakrawala dunia, meskipun orang-orang kafir yang menyimpang itu membencinya. Ibnu Abbas berkata: “Sesungguhnya Nabi SAW pernah terlambat menerima wahyu selama 40 hari. Sungguh Allah telah meredupkan cahaya Muhammad dalam menurunkan wahyu kepadanya, sedangkan perintahNya belumlah sempurna. Kemudian Rasulallah SAW bersedih, lalu Allah SWT menurunkan ayat ini dan wahyu-wahyu selanjutnya pun berlanjut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka hendak memadamkan cahaya Allah} kebenaran yang dibawa Rasulullah SAW {dengan mulut mereka} dengan ucapan mereka yang dusta {dan Allah tetap menyempurnakan cahayaNya} menampakkan kebenaran dengan menyempurnakan agamaNya {walaupun orang-orang kafir tidak menyukai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Karena itu Allah berfirman tentang mereka, “Mereka ingin memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka,” maksudnya dengan berbagai perkataan busuk yang mereka kemukakan yang menolak kebenaran yang sebenarnya tidak ada wujudnya, namun semakin membuat orang yang tahu lebih memahami bahwa ia berada di atas kebatilan. “Dan Allah tetap menyempurnakan cahayaNya meskipun orang-orang kafir benci.” Maksudnya, Allah menjamin akan memenangkan AgamaNya, menyempurnakan kebenaran yang dibawa oleh para rasulNya, dan menampakkan cahayaNya di berbagai penjuru, meski orang-orang kafir membencinya. Karena kebencian, mereka mencurahkan segala daya upaya agar bisa memadamkan cahaya Allah, tapi mereka pasti kalah. Mereka tidak ubahnya seperti orang yang ingin memadamkan matahari dengan cara meniup dengan mulutnya. Tujuan mereka tidak tercapai dan akal mereka terbebas dari kekurangan dan celaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 8: Allah mengabarkan bahwa yahudi dan kafir ingin memadamkan agama Allah dan syariat-Nya yang terang dengan mencelanya dan membuat-buat kebohongan; Maka mereka yang semisal ini semisal dengan orang yang meniup matahari dengan mulutnya agar padam cahayanya dan tertutup sinarnya. Maka ketahuilah wahai orang-orang musyrik, bahwa Allah akan menyempurnakan cahayanya walaupun orang-orang yang mengingkari dan mendustkan membenci, dan mereka tidak akan dapat membalas hukum Allah dan ketetapan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti dengan kata-kata mereka bahwa ia adalah sihir, syair atau perdukunan. Padahal ini semua adalah ucapan yang tidak ada hakikatnya, bahkan menambah jelas kebatilan mereka bagi orang yang berpandangan dalam. Yakni Allah Subhaanahu wa Ta'aala yang menjamin untuk menolong agama-Nya dan menyempurnakan kebenaran yang dibawa para rasul-Nya serta menyebarkan cahaya-Nya ke seluruh penjuru meskipun orang-orang kafir benci dan mengerahkan segala sebab untuk memadamkan cahaya Allah, tetapi mereka tetap akan kalah. Bahkan mereka seperti orang yang meniup sinar matahari dengan mulutnya agar padam, tetapi tetap saja tidak akan hilang cahayanya itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 8",
    "description": "Mereka, orang-orang yang mengada-adakan kebohongan tentang Allah, hendak memadamkan cahaya agama Allah yang menekankan prinsip tauhid, prinsip tidak ada tuhan selain Allah, prinsip tidak dibenarkan beribadah kecuali kepada-Nya dan prinsip tidak ada manusia yang mempertuhankan manusia dengan mulut, ucapan-ucapan mereka, bahkan dengan sikap dan tindakan mereka, tetapi Allah tetap menyempurnakan cahaya, agama-Nya dengan menurunkan wahyu, mengutus rasul dan memerintahkan rasul, mengajak umat meyakininya, meskipun orang-orang kafir membencinya dan merintanginya dengan berbagai cara. 9. Dialah yang mengutus rasul-Nya dengan membawa petunjuk dan agama yang benar, prinsip tauhid yang lurus untuk memenangkannya di atas segala agama yang bertentangan dengan prinsip tauhid, mempertuhankan manusia dan tidak memanusiakan manusia, meskipun orang-orang musyrik membencinya, bahkan merintanginya dengan berbagai cara."
  }
]