[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Allah-lah Yang mengutus RasulNya, Muhammad, dengan al-Quran dan agama Islam, untuk Dia tinggikan di atas seluruh agama yang menyelisihinya sekalipun orang-orang musyrik membencinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Allah, Dia lah yang mengutus Rasul-Nya Muhammad -ṣallallāhu 'alaihi wa sallam- dengan agama Islam, agama petunjuk dan tuntunan menuju kebaikan, agama ilmu yang bermanfaat dan amal yang saleh, agar Dia meninggikannya di atas seluruh agama, meski tidak disukai oleh orang-orang musyrikin yang benci bila Islam mengakar di bumi ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah-lah yang mengutus Nabi Muhammad untuk menyampaikan al-Qur’an dan agama Islam, agar dia meninggikannya di atas agama-agama yang lain dengan menyebarkan dan mengamalkannya; meski kemenangan agama Islam ini tidak disukai orang-orang yang teguh di atas kesyirikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. هُوَ الَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُۥ عَلَى الدِّينِ كُلِّهِۦ (Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar agar Dia memenangkannya di atas segala agama-agama) Agar Allah menjadikan agama Islam berkuasa dan lebih tinggi dari agama-agama lainnya. وَلَوْ كَرِهَ الْمُشْرِكُونَ (meskipun orang musyrik membenci) Sebab kemenangan itu pasti akan terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah adalah Dzat yang menurunkan Al-Qur’an untuk mengantarkan (manusia) kepada petunjuk paling akhir (menuju Allah), seakan-akan dia (Al-Qur’an) adalah petunjuk dan meninggikan seluruh agama, meskipun orang-orang musyrik membenci Al-Qur’an yang di dalamnya mengandung tauhid itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang mengutus RasulNya dengan petunjuk dan agama yang benar agar Dia mengunggulkannya} agar Dia meninggikannya{ atas semua agama} seluruh agama {walaupun orang-orang musyrik tidak menyukai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Selanjutnya Allah menyebutkan sebab muncul dan menangnya agama Islam, baik secara indrawi (konkret) maupun maknawi, seraya berfirman, “Dia-lah yang mengutus RasulNya dengan membawa petunjuk dan Agama yang benar,” yakni, dengan ilmu yang bermanfaat dan amal shalih, dengan ilmu yang menunjukkan kepada Allah dan kepada tempat kemuliaanNya dan menunjukkan kepada amal dan akhlak yang baik serta kebaikan dunia dan akhirat, “dan Agama yang benar,” yaitu agama yang dipeluk dan dipakai untuk menyembah Rabb semesta alam. Itulah agama kebenaran dan kejujuran yang tidak terdapat kekurangan dan aib yang bisa menyebabkannya dicela. Perintah-perintah agama Islam merupakan hidangan hati, ruh, dan kenyamanan raga. Meninggalkan larangan-larangan agama adalah keselamatan dari keburukan dan kerusakan. Petunjuk dan agama kebenaran yang dibawa oleh Nabi merupakan bukti terbesar atas kebenarannya. Agama itu adalah bukti nyata yang tetap bertahan selama waktu masih ada. Orang berakal yang semakin memikirkan agama Islam akan semakin berbahagia dan mengetahui. “Agar Dia memenangkannya di atas segala agama-agama,” maksudnya agar Islam mengungguli seluruh agama dengan berbagai hujjah dan bukti nyata dan memenangkan para penegak Islam, baik dengan pedang maupun tombak. Sifat ini tetap lekat dalam agama Islam di segala waktu. Tidak bisa dikalahkan dan dibantah oleh siapa pun, sehingga Islam tetap mendapatkan kemenangan dan keperkasaan. Adapun para pemeluknya, jika mereka menegakannya dan menjadikannya sebagai lentera dan petunjuk dalam berbagai kepentingan mereka, baik kepentingan dunia maupun akhirat, maka tidak ada yang dapat menentangnya, mereka pasti menang di atas para pemeluk agama-agama lain. Namun jika mereka menyia-nyiakan Islam dan hanya sekedar memeluk saja, maka hal itu tidak berguna bagi mereka. Tindakan mereka yang menyia-nyiakan agama Islam ini menjadi penyebab musuh mampu menguasai mereka. Siapa pun yang banyak mempelajari sejarah dan merenungkan kondisi awal kaum Muslimin dan juga lainnya pasti tahu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Shaff ayat 9: Allah mengabarkan bahwa dengan kekuasaan dan hikmah-Nya Allah mengutus Rasul-Nya Muhammad ﷺ dengan Al Qur’an yang jelas dan nyata, dan jalan yang wajib diikuti dan itu adalah jalan islam; Agar Rasul tersebut meninggikan agama islam atas seluruh agama, meskipun orang-orang musyrik membenci, karena menyaingi sesembahannya selain Allah. Dan Allah Maha Kuat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sebab tetap tampilnya agama Islam dan tetap menangnya, baik sebab hissiy (konkret) maupun sebab maknawi (abstrak). Yakni membawa ilmu yang bermanfaat dan amal yang saleh. Ilmu tersebut menunjukkan seseorang kepada Allah dan kepada surga, menunjukkan kepada amal dan akhlak yang paling baik serta menunjukkan kepada hal yang bermaslahat di dunia dan akhirat. Agama yang benar adalah ibadah yang benar dan amal yang saleh, dimana semua itu merupakan makanan bagi ruh dan badan, penyegar bagi badan sekaligus penyelamat dari keburukan dan kerusakan. Apa yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam berupa petunjuk dan agama yang benar merupakan dalil dan bukti yang paling besar yang menunjukkan kebenarannya, dimana ia merupakan bukti yang kekal sepanjang zaman, dimana setiap kali orang yang berakal meningkat kedewasaannya dalam berpikir, maka semakin jelas pula buktinya. Maksudnya, untuk meninggikannya di atas seluruh agama dengan hujjah dan bukti, dan meninggikan para pemeluknya dengan persenjataan seperti pedang dan tombak. Keadaan agama ini, sifatnya yang unggul selalu melekat padanya sehingga tidak bisa dikalahkan di setiap waktu, sedangkan para pemeluknya jika mereka mengamalkannya maka mereka akan unggul dan tidak terkalahkan. Tetapi jika mereka hanya mengaku Islam tetapi tidak mau mengamalkannya, maka mereka dapat dikalahkan oleh musuh. Dengan demikian, jelaslah, bahwa sebab kemunduran umat Islam adalah ketika mereka meninggalkan agamanya sebagaimana sabda Rasulullah shallallahu 'alaihi wa sallam: إِذَا تَبَايَعْتُمْ بِالْعِينَةِ وَأَخَذْتُمْ أَذْنَابَ الْبَقَرِ وَرَضِيتُمْ بِالزَّرْعِ وَتَرَكْتُمْ الْجِهَادَ سَلَّطَ اللَّهُ عَلَيْكُمْ ذُلًّا لَا يَنْزِعُهُ حَتَّى تَرْجِعُوا إِلَى دِينِكُمْ “Apabila kamu berjual-beli dengan cara ‘iinah (salah satu jenis riba), kamu pegang buntut-buntut sapi dan kamu ridha dengan tanaman kamu serta kamu tinggalkan jihad, maka Allah akan menimpakan kehinaan kepada kamu, di mana Dia tidak akan mencabutnya sampai kamu kembali kepada agama kamu.” (HR. Abu Dawud, dishahihkan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 423)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Shaff Ayat 9",
    "description": "Dialah yang mengutus rasul-Nya dengan membawa petunjuk dan agama yang benar, prinsip tauhid yang lurus untuk memenangkannya di atas segala agama yang bertentangan dengan prinsip tauhid, mempertuhankan manusia dan tidak memanusiakan manusia, meskipun orang-orang musyrik membencinya, bahkan merintanginya dengan berbagai cara. 10. Wahai orang-orang yang beriman di mana pun dan pada zaman apa pun kamu hidup! maukah kamu aku tunjukkan melalui bimbingan rasulullah suatu perdagangan yang dapat menyelamatkan kamu dari azab yang pedih di akhirat'."
  }
]