[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1. Wahai Nabi, mengapa kamu menghalangi dirimu dari apa yang halal yang Allah halalkan bagimu hanya untuk mencari kerelaan istri-istrimu? Allah Maha Pengampun lagi Maha Penyayang kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai Rasul! Kenapa engkau mengharamkan apa yang dibolehkan oleh Allah untukmu seperti bersenang-senang dengan budak wanitamu, yaitu Mariyah? Dengan itu kamu ingin mencari kerelaan istri-istrimu karena mereka cemburu padanya. Sedang Allah Maha Pengampun dan Maha Penyayang padamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah menyeru Rasul-Nya dengan kemuliaan kenabiannya, dan Dia menegurnya ketika beliau melarang dirinya untuk menggauli budak wanitanya karena telah bersumpah tidak akan menggaulinya, demi menjaga kasih sayang Aisyah dan Hafshah; dan Rasulullah berpesan kepada Hafshah untuk tidak menceritakan kepada siapapun tentang sumpah ini. Atau teguran ini Allah sampaikan ketika Rasulullah melarang dirinya dari minum madu yaitu setelah beliau meminum madu di rumah Zainab, maka Aisyah dan Hafshah bersepakat untuk berkata kepada Rasulullah ketika beliau masuk ke rumah mereka, “Aku mencium bau maghafir -sejenis tanaman yang berasa manis namun baunya tidak sedap-. Maka Rasulullah berkata kepada Hafshah, “Tidak mengapa, aku telah meminum madu di tempat Zainab, dan aku tidak akan mengulanginya lagi.” Oleh sebab itulah Allah menegur beliau, “Mengapa kamu melarang dirimu dari sesuatu yang Allah halalkan bagimu, demi mendapat kerelaan Aisyah dan Hafshah? Allah Maha Besar ampunan dan rahmat-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا النَّبِىُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ اللَّـهُ لَكَ ۖ (Hai Nabi, mengapa kamu mengharamkan apa yang Allah halalkan bagimu) Dikatakan bahwa Rasulullah suatu hari meminum madu di tempat Zainab binti Jahsy; lalu Aisyah dan Hafsah bersepakat untuk membuat tipu daya terhadap Zainab dengan mengatakan kepada Rasulullah jika beliau mendatangi mereka berdua: “Kami mencium bau darimu.” Maka Rasulullah mengharamkan madu atas dirinya. تَبْتَغِى مَرْضَاتَ أَزْوٰجِكَ ۚ( kamu mencari kesenangan hati isteri-isterimu?) Dengan mengharamkan atas dirimu apa yang Allah halalkan bagimu. وَاللَّـهُ غَفُورٌ رَّحِيمٌ (Dan Allah Maha Pengampun lagi Maha Penyayang) Atas kesalahan yang kamu lakukan dengan mengharamkan sesuatu yang Allah halalkan bagimu. Terdapat pendapat mengatakan bahwa itu termasuk dosa kecil, oleh sebab itu Allah mencela beliau."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. {Wahai Nabi} kenapa kamu mengharamkan atau melarang untuk dirimu sesuatu yang dihalalkan oleh Allah berupa makanan dan hal lainnya yang halal. Apakah melalui itu (pengharaman sesuatu) kamu mencari ridha istri-istrimu? Yaitu Aisyah dan Hafsah saja. Allah adalah Dzat yang Maha Pengampun dan Maha Pengasih bagi hamba-hambaNya yang bertaubat begitu juga bagimu dengan menegurmu karena telah mengharamkan apa yang dihalalkan oleh Allah bagimu dan memperingatkanmu sebagai bentuk penjagaan bagimu. Istifham itu berfungsi sebagai peringatan. Dalam hadits shahih sebagaimana yang disebutkan oleh Imam Bukhari dan Imam Muslim bahwa sesungguhnya ayat ini dan ayat setelahnya diturunkan ketika Nabi SAW mengharamkan madu untuk dirinya, karena beliau telah meminumnya bersama Zainab dan Bintu Jahsy, lalu Aisyah dan Hafsah berkompromi untuk berkata kepada beliau ketika mendatangi keduanya: “Sesungguhnya kami mencium sebuah bau dari engkau”, kemudian beliau mengharamkan madu untuk dirinya sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, mengapa mengharamkan apa yang dihalalkan Allah bagimu. Kamu bermaksud menyenangkan hati istri-istrimu. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini merupakan teguran Allah untuk Nabi Muhammad ketika mengharamkan Mariyah atau meminum madu atas dirinya demi menjaga perasaan sebagian istrinya dalam kisah yang masyhur. Kemudian Allah menurunkan ayat-ayat ini. “Hai Nabi,” maksudnya wahai nabi yang diberi karunia oleh Allah berupa kenabian, kerasulan, dan wahyu, “mengapa kamu mengharamkan apa yang Allah halalkan bagimu.” Yakni, mengapa engkau mengharamkan kebaikan-kebaikan yang diberikan Allah padamu dan umatmu. “Kamu mencari,” dengan pengharaman itu “kesenangan hati istri-istrimu. Dan Allah Maha Pengampun lagi Maha Penyayang.” Ini adalah penegasan bahwa Allah mengampuni RasulNya, menghapus teguran, dan menyayangi beliau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 1: Surat ini dibuka dengan teguran Nabi ﷺ yang menegur dengan ringan; Dimana Nabi mengharamkan atas dirinya meminum madu demi menjaga kehormatannya (dan) karena mengkhawatirkan istrinya Aisyah dan Hafsah di dalam cerita yang telah dikenal. Dan dikatakan juga bahwa Nabi ﷺ mengharamkan atas dirinya untuk seorang hamba sahaya Maria Al Qibthiyyah untuk supaya istrinya yaitu Aisyah dan Hafsah ridha kepada diri Nabi ﷺ. Maka Allah berkata : Wahai Nabi janganlah engkau melarang meminum madu yang Allah telah halalkan kepadamu, yang engkau hanya mencari ridha istri-istrimu ? Oleh karenanya, tidak semstinya engkau mengharamkan apa yang Allah halalkan, dan ketahuilah bahwa Allah Maha Luas ampunan-Nya, dan Maha Besar kasih sayang-Nya; Maka Allah telah ampuni Nabi dan mengampuni umatnya dengan menurunkan kafarat al yamin, maka jadilah umat secara umum menjadi ahli iman. Dapat dipetik manfaat pada ayat ini yaitu larangan mengharamkan apa yang Allah halalkan, dan berkata sebagian ulama : Sumpah Allah atas pengharaman apa yang telah Allah halalkan yang tidak mungkin dapat berkumpul (urusannya) satu sama lain. Berkata para ulama yang lain : Termasuk dari sumpah Allah, maka jika berharap apa yang telah Allah halalkan (kemudian dijadikan haram), kufur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada ‘Ubaid bin ‘Umair ia berkata, “Aku mendengar Aisyah radhiyallahu 'anha (berkata), “Bahwa Nabi shallallahu 'alaihi wa sallam ketika berdiam di sisi Zainab binti Jahsy dan meminum madu di dekatnya, maka aku dengan Hafshah bersepakat bahwa siapa saja di antara kami yang didatangi Nabi shallallahu 'alaihi wa sallam hendaknya berkata, “Sesungguhnya aku mencium bau getah darimu; engkau telah meminum getah.” Lalu Nabi shallallahu 'alaihi wa sallam menemui salah seorang di antara keduanya dan diucapkanlah hal itu kepada Beliau, lalu Beliau berkata, “Bahkan yang aku minum adalah madu di sisi Zainab binti Jahsy dan aku tidak akan mengulangi lagi,” maka turunlah ayat, “Wahai Nabi! Mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu? Sampai ayat, “Jika kamu berdua bertobat kepada Allah…dst (ayat 4).” Tertuju kepada Aisyah dan Hafshah. (Sedangkan ayat), “Dan ingatlah ketika secara rahasia Nabi membicarakan suatu peristiwa kepada salah seorang istrinya (Hafsah)…dst.” Yaitu terhadap perkataan Beliau, “Bahkan yang aku minum adalah madu…dst.” (Syaikh Muqbil berkata, “Hadits tesebut disebutkan lagi (oleh Bukhari) secara bersanad dengan adanya perubahan sedikit pada matan di juz 14 hal. 385 kemudian ia (Bukhari) berkata: Dari Ibrahim bin Musa dari Hisyam disebutkan, “Dan aku tidak akan mengulangi lagi, aku juga telah bersumpah, maka janganlah memberitahukan hal itu kepada seorang pun.” Hadits tersebut diriwayatkan pula oleh Muslim juz 10 hal. 75, Abu Dawud juz 3 hal. 386, penyusun ‘Aunul Ma’bud berkata: Al Mundziri berkata, “Diriwayatkan oleh Bukhari, Muslim, Tirmidzi, Nasa’i, dan Ibnu Majah secara singkat dan panjang.” Hadits tersebut dalam Nasa’i di juz 6 hal. 123, juz 17 hal. 13, Ibnu Sa’ad juz 8 hal. 76 qaaf 1, dan Abu Nu’aim dalam Al Hilyah juz 3 hal. 276.) Imam Nasa’i rahimahullah di juz 2 hal. 242 berkata: Telah memberitahukan kepadaku Ibrahim bin Yunus bin Muhammad, telah menceritakan kepada kami bapakku, telah menceritakan kepada kami Hammad bin Salamah dari Tsabit dari Anas, bahwa Rasulullah shallallahu 'alaihi wa sallam mempunyai seorang budak wanita yang Beliau gauli, Aisyah dan Hafshah selalu merasa (cemburu) kepada Beliau sehingga Beliau mengharamkannya (budak wanita itu), maka Allah ‘Azza wa Jalla menurunkan ayat, “Wahai Nabi! Mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu? Engkau ingin menyenangkan hati istri-istrimu?...dst.” (Syaikh Muqbil berkata, “Hadits tersebut diriwayatkan oleh Hakim juz 2 hal. 493, ia berkata, “Hadits ini shahih sesuai syarat Muslim, namun keduanya (Bukhari dan Muslim) tidak meriwayatkannya,” dan didiamkan oleh Adz Dzahabi. Abu Abdurrahman berkata, “Dalam sanadnya terdapat Muhammad bin Bukair Al Hadhramiy dimana ia tidak termasuk para perawi Muslim. Dalam Tahdzibut Tahdzib diisyaratkan kepada Bukhari mengikuti dalam Al Kamal, akan tetapi Al Mizziy berkata, “Saya belum mendapatkan riwayatnya darinya (Bukhari), baik dalam kitab shahih maupun selainnya.” Dengan demikian yang dikatakan pada hadits tersebut adalah shahih, namun tidak dikatakan sesuai syarat Muslim. Al Haafizh dalam Al Fat-h setelah menisbatkannya kepada Nasa’i berkata, “Sesungguhnya sanadnya shahih,” juz 11 hal. 292. ) Dalam Majma’uzzawaa’id juz 7 hal. 126 dari Ibnu ‘Abbas (tentang ayat), “Wahai Nabi! Mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu?” Ia berkata, “Ayat ini turun berkenaan dengan budak wanita Beliau.” (Diriwayatkan oleh Al Bazzar dengan dua isnad, dan Thabrani. Para perawi Al Bazzar adalah para perawi hadits shahih selain Bisyr bin Adam dan dia tsiqah. Dalam Ta’liq terhadap Ash Shahihul Musnad, Syaikh Muqbil berkata, “Jalan yang di sana terdapat Bisyr bin Adam riwayat Al Bazzar terdapat seorang yang matruk (ditinggalkan haditsnya), sedangkan jalan yang setelahnya adalah hasan, lihat Kasyful Astaar 3/76)). Al Haafizh dalam Al Fat-h juz 10 hal. 283 berkata, “Bisa juga ayat tersebut turun karena dua sebab secara bersamaan.” Yakni karena sebab pengharaman Beliau terhadap madu dan karena pengharaman Beliau terhadap budaknya. Imam Syaukani dalam tafsirnya juz 5 hal. 252 berkata, “Kedua sebab tersebut adalah shahih terhadap turunnya ayat tersebut, dan penggabungan keduanya adalah bisa karena terjadinya dua cerita; cerita tentang madu dan cerita tentang Mariyah, dan bahwa Al Qur’an turun karena keduanya secara bersamaan, dan pada masing-masing dari keduanya (kedua asbaabun nuzul) disebutkan bahwa Beliau membicarakan secara rahasia suatu peristiwa kepada salah seorang istrinya. Ayat ini merupakan kritik dari Allah Subhaanahu wa Ta'aala kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam ketika Beliau mengharamkan budaknya ‘Mariyah’ atau mengharamkan meminum madu karena ingin menyenangkan hati istri-istrinya sebagaimana telah disebutkan dalam asbabunnuzul(sebab turunnya)nya, maka Allah Subhaanahu wa Ta'aala menurunkan ayat ini. Yakni wahai orang yang diberi nikmat oleh Allah dengan kenabian, wahyu dan risalah. Yaitu sesuatu yang baik-baik yang Allah karuniakan kepadamu dan kepada umatmu. Ayat ini merupakan penegasan bahwa Allah Subhaanahu wa Ta'aala mengampuni Rasul-Nya dan mengangkat celaan terhadapnya serta merahmatinya, dan pengharaman tersebut menjadi sebab pensyariatan hukum yang umum untuk manusia yaitu hukum yang diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 1",
    "description": "Setelah pada surah sebelumnya Allah menyapa nabi tentang hukum dan etika menceraikan istri, pada awal surah ini Allah menyapa, 'wahai nabi! mengapa engkau mengharamkan apa yang dihalalkan Allah bagimu dengan bersumpah tidak akan pernah minum madu setelah minum madu di rumah zainab binti jahsy, salah seorang istrimu, dan tidak akan pernah melakukan hubungan suami istri dengan mariyah al-qib'iyyah, setelah berhubungan di rumah hafsah' hanya karena engkau ingin menyenangkan hati istri-istrimu, terutama hafsah dan '''isyah'' dan Allah maha pengampun, maha penyayang kepada siapa saja yang bertobat, termasuk dua istri nabi, yaitu hafsah dan '''isyah. 2. Pada ayat ini Allah memerintahkan kepada nabi untuk membatalkan sumpah beliau mengharamkan minum madu dan berhubungan dengan salah seorang istri beliau, mariyah al-qib'iyyah. 'sungguh, Allah telah mewajibkan kepada kamu, wahai nabi untuk membebaskan diri dari sumpah kamu untuk tidak akan minum madu dan tidak akan berhubungan dengan istri dengan membayar kafarat; dan Allah adalah pelindungmu, wahai nabi dari segala keadaan yang tidak menyenangkan dan dia maha mengetahui, semua yang dirahasiakan manusia; mahabijaksana dalam menilai perbuatan mereka. '."
  }
]