[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Allah membuat perumpamaan untuk keadaan orang-orang kafir (dalam pergaulan mereka dengan kaum Muslimin, kedekatan mereka dari kaum Muslimin dan persinggungan mereka dengan kaum Muslimin, bahwa hal itu tidak berguna bagi mereka karena kekafiran mereka kepada Allah) dengan keadaan istri Nabi Allah, Nuh dan istri Nabi Allah, Luth, di mana keduanya berada dalam pernikahan dengan dua hamba shalih dari hamba-hamba Kami, tetapi keduanya adalah wanita kafir, kedua Rasul Allah, Nuh dan Luth tidak bisa menolak sedikit pun azab Allah dari keduanya. Kepada kedua istri tersebut dikatakan, “Masuklah kalian berdua ke dalam neraka bersama orang-orang yang memasukinya.” Dalam perumpamaan ini terdapat dalil bahwa kekerabatan dengan para Nabi dan orang-orang sholeh sama sekali tidak memberikan manfaat jika tetap berbuat keburukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah membuat perumpamaan bagi orang-orang yang kafir kepada Allah dan Rasul-Nya -bahwa hubungan mereka dengan orang-orang yang beriman tidak bermanfaat sedikitpun- dengan dua istri Nabi, yaitu Nuh dan Lūṭ. Kedua wanita itu adalah dua istri bagi dua hamba yang saleh, lalu mereka mengkhianati suami mereka dengan menghalang-halangi dari jalan Allah dan menolong orang-orang kafir dari kaum mereka berdua. Maka kedudukan mereka sebagai istri dari hamba yang saleh ini tidak bermanfaat bagi mereka, dan dikatakan kepada keduanya, “Masuklah ke dalam Neraka bersama sejumlah orang-orang yang masuk ke dalamnya dari kalangan orang-orang kafir dan orang-orang yang fasik.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Allah membuat perumpamaan tentang keadaan orang-orang beriman dan orang-orang kafir: Hubungan kekeluargaan antara orang kafir dengan orang beriman tidak akan bermanfaat sedikitpun bagi orang kafir, dan tidak akan mendatangkan mudharat sedikitpun bagi orang beriman, dan hendaknya dia menjalankan kewajibannya untuk berdakwah, semoga orang kafir itu dapat bertaubat kepada Allah. Hal ini sebagaimana yang disebutkan dalam tiga ayat berikut; Allah membuat perumpamaan keadaan orang-orang kafir seperti istri Nabi Nuh dan Nabi Luth; kedua wanita itu adalah istri dari dua nabi, namun keduanya mendurhakai mereka dalam perkara agama. Namun dua Nabi ini tidak dapat membela istri mereka dari azab Allah; dan dikatakan kepada dua orang istri itu, “Masuklah kalian berdua ke dalam neraka Jahannam bersama orang-orang yang masuk ke dalamnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَخَانَتَاهُمَا (lalu kedua isteri itu berkhianat kepada suaminya) Yakni kedua istri tersebut menyelisihi kedua suami mereka. Dikatakan bahwa istri nabi Nuh dahulu berkata kepada orang-orang bahwa suaminya itu gila. Sedangkan istri nabi Luth membocorkan kepada kaumnya tentang kedatangan tamunya. فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّـهِ شَيْـًٔا(maka suaminya itu tiada dapat membantu mereka sedikitpun dari (siksa) Allah) Yakni Nuh dan Luth tidak dapat memberi mereka berdua manfaat sedikitpun meski mereka adalah istri mereka. Tidak pula mampu menghalangi azab Allah bagi mereka berdua, meskipun mereka mulia di sisi Allah. وَقِيلَ ادْخُلَا النَّارَ مَعَ الدّٰخِلِينَ(dan dikatakan (kepada keduanya): “Masuklah ke dalam jahannam bersama orang-orang yang memasukinya) Bersama orang-orang yang kafir dan selalu bermaksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Allah membuat perumpamaan bagi orang-orang kafir yang tidak saling membutuhkan satu sama lain itu perumpamaan istri Nuh dan istri Luth yang keduanya merupakan istri dua nabi yang shalih, namun keduanya menghianati mereka dengan melakukan kemunafikan dalam urusan agama. Istri Nuh berkata kepada kaumnya bahwa suaminya adalah orang gila, dan istri Luth menunjukkan kepada kaumnya tentang tamu-tamu suaminya. Mereka berdua tidak memberi manfaat bagi Nuh dan Luth. Keberadaan mereka berdua sebagai dua istri nabi tidak berguna untuk terhindar dari azab Allah. Dikatakan kepada mereka berdua saat akan mati: “Masuklah kalian berdua ke dalam neraka bersama orang-orang lainnya yang merupakan orang-orang kafir seperti kaum Nuh dan kaum Luth”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah membuat perumpamaan bagi orang-orang kafir, yaitu istri Nuh dan istri Luth. Keduanya berada di bawah tanggung jawab dua orang hamba yang shaloh di antara hamba-hamba Kami, lalu keduanya berkhianat kepada mereka} Keduanya berkhianat dengan melakukan kekufuran {Mereka tidak dapat membantunya sedikit pun dari (azab) Allah} sehingga Nuh dan Luth tidak bisa melindungi istri-istri mereka dari azab Allah sedikit pun {dan dikatakan,“Masuklah kamu berdua ke neraka bersama orang-orang yang masuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Kedua perumpamaan ini dibuat oleh Allah untuk orang-orang yang beriman dan orang-orang kafir adalah untuk menjelaskan kepada mereka bahwa hubungan dan kedekatan orang kafir dengan orang Mukmin sama sekali tidak berguna dan hubungan antara orang Mukmin dan orang kafir sama sekali tidak memudaratkannya apabila orang bersangkutan tetap menunaikan kewajibannya. Sepertinya dalam ayat ini terdapat isyarat dan peringatan untuk para istri-istri Rasulullah dari kemaksiatan, dan bahwa hubungan mereka dengan Rasulullah tidak akan berguna bagi mereka jika mereka menyakiti beliau, seraya berfirman, “Allah membuat istri Nuh dan istri Luth perumpamaan bagi orang-orang kafir. Keduanya,” maksudnya, kedua wanita itu, “berada di bawah pengawasan dua orang hamba yang shalih di antara hamba-hamba kami,” yaitu Nabi Nuh dan Nabi Luth, “lalu kedua istri itu berkhianat kepada kedua suaminya” di dalam agama, karena keduanya tidak memeluk agama suami masing-masing. Dan inilah yang dimaksud dengan pengkhianatan sebenarnya, bukan pengkhianatan nasab maupun hubungan suami-istri, karena tidak ada satu pun istri nabi yang membangkang. Dan Allah tidak menjadikan seorang pun istri nabi melakukan kekejian. “Maka kedua suaminya itu tiada dapat membantu,” yaitu Nuh dan Luth, “mereka berdua,” yakni kedua istrinya, “sedikitpun dari (siksa) Allah, dan dikatakan (kepada keduanya),” yakni kepada kedua istrinya, “Masuklah ke neraka bersama orang-orang yang masuk (neraka).”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 10: Kemudian Allah memberikan dua permisalan : Permisalan yang pertama : Keadaan orang-orang kafir yang tidak bermanfaat nasihat para Nabi dan Rasul, dan mereka tidak mau mengambil manfaat dari orang-orang yang beriman yang dekat dengan mereka, dan inilah istri dari Nabi Nuh, dan Istri Nabi Luth yang mereka berdua dalam penjagaan dua Nabi yang mulia, yang tidak berguna petunjuk dari mereka berdua; Mereka berdua jatuh dalam pengkhianatan yang kufur dan tanpa keimanan, dan bukan khianat dengan penolakan; Karena Allah mensucikan para Nabi-Nya dari dosa. Kemudian Allah menjelaskan keadaan istri mereka berdua karena sebab mereka istri Nabi tidak menjadikannya tercegah dari adzab Allah, dan pada hari kiamat dikatakan kepada mereka berdua : Masuklah ke dalam neraka jahannam bersama dengan orang-orang yang masuk ke dalamnya. Dari sini diketahui bahwa hidayah ada di tangan Allah, sebagaimana Allah katakan kepada Nabi-Nya Muhammad ﷺ, ketika ia bersedih karena pamannya Abu Thalib tidak masuk islam : إِنَّكَ لَا تَهْدِى مَنْ أَحْبَبْتَ, yang artinya : Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, {AL Qashash : 56}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan bahwa hubungan orang kafir dengan orang mukmin dan kedekatannya kepadanya tidaklah berguna apa-apa baginya, dan bahwa hubungan orang mukmin dengan orang kafir tidaklah merugikannya sedikit pun ketika dia (orang mukmin) melaksanakan kewajiban. Dalam ayat ini seakan-akan terdapat isyarat dan peringatan terhadap istri-istri Nabi shallallahu 'alaihi wa sallam agar mereka tidak melakukan maksiat dan bahwa hubungan mereka dengan Beliau shallallahu 'alaihi wa sallam tidaklah bermanfaat apa-apa jika mereka tidak beramal saleh sebagaimana istri Nabi Nuh dan Nabi Luth, meskipun suami mereka nabi, tetapi jika mereka kafir, maka kedekatan hubungan mereka dengannya tidalah berguna apa-apa. Dengan kafir kepada agama suaminya. Ayat ini menunjukkan bahwa para nabi pun tidak dapat membela istri-istrinya atas azab Allah apabila mereka menentang agama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 10",
    "description": "Allah menerangkan bahwa istri seorang nabi tidak dijamin masuk surga, jika tidak beriman kepada Allah. Allah membuat perumpamaan bagi orang-orang kafir bahwa menjadi istri nabi itu tidak otomatis dijamin masuk surga apabila tidak beriman kepada Allah seperti istri nabi nuh dan istri nabi lut. Keduanya sebagai istri berada di bawah pengawasan suami masing-masing, dua orang hamba yang saleh, yaitu nabi nuh dan lut, di antara hamba-hamba kami; lalu kedua istri itu berkhianat kepada kedua suaminya, istri nabi nuh menuduh suaminya gila dan istri nabi lut memberitahukan kehadiran para tamu ganteng kepada orang banyak yang homoseks, tetapi kedua suaminya itu tidak dapat membantu mereka sedikit pun untuk menyelamatkannya dari siksaan Allah karena kekufuran mereka; dan dikatakan kepada kedua istri nabi itu di akhirat, 'masuklah kamu berdua ke dalam neraka bersama orang-orang yang masuk neraka karena kekufuran mereka kepada Allah. '11. Begitu juga sebab kaya, istri yang beriman tidak bisa juga menyelamatkan suamiya yang kaifr dari azab Allah. Dan Allah membuat perumpamaan bagi orang-orang yang beriman bahwa perempuan beriman, meskipun menjadi istri seorang kafir yang pada waktu dibolehkan, akan memperoleh keselamatan di akhirat seperti istri firaun, ketika dia berkata dalam doanya kepada Allah waktu menghadapi siksaan suaminya yang memaksanya untuk murtad, 'ya tuhanku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam surga, karena tidak nyaman berada di istana firaun; dan selamatkanlah aku dari firaun dan perbuatannya yang terus menyiksa; dan doanya kepada Allah, selamatkanlah aku dari kaum yang zalim, balatentara firaun yang terus menyiksanya hingga wafat sehingga ia tidak merasakan siksaan mereka. '"
  }
]