[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Dan Allah membuat perumpamaan bagi keadaan orang-orang yang beriman (yang membenarkan Allah, menyembahNya semata, serta melaksanakan syariatNya, bahwa pergaulan mereka dengan orang-orang kafir tidak berdampak buruk terhadap mereka) dengan istri Firaun yang berada dalam pernikahan dengan laki-laki yang paling kafir kepada Allah sementara dia adalah wanita beriman kepada Allah. Ketika dia berkata, “Wahai Tuhanku, bangunkanlah untukku sebuah rumah di surga. Selamatkanlah aku dari fitnah dan kekuasaan Firaun, serta dari perbuatan buruk yang dilakukannya terhadapku. Selamatkanlah aku dari kaum yang mengikutinya dalam kezhaliman dan kesesatan dan dari siksa mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan Allah membuat perumpamaan bagi orang-orang yang beriman kepada Allah dan Rasul-Nya -bahwa hubungan mereka dengan orang-orang kafir tidak membawa mudarat bagi mereka dan tidak berpengaruh pada mereka selama mereka tetap istikamah dalam kebenaran- dengan kondisi istri Fir’aun ketika ia berkata, “Wahai Rabb, bangunlah bagiku satu rumah di sisi-Mu di Surga dan selamatkan aku dari kekejaman Fir'aun, kekuasaannya dan dari perbuatan jahatnya, dan selamatkanlah aku dari kaum yang menganiaya diri mereka sendiri dengan mengikuti Fir'aun dalam kejahatan dan kezalimannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Dan Allah membuat perumpamaan keadaan orang-orang beriman dengan Asiyah, istri Fir’aun, saat ia berkata: “Ya Tuhanku, buatkanlah bagiku istana di surga, dan selamatkanlah aku dari kezailman dan kejahatan Fir’aun, dan selamatkanlah aku dari orang-orang yang zalim.” Dan Allah membuat perumpamaan lain tentang keadaan orang-orang beriman dengan Maryam binti Imran yang menjaga kemaluannya dari perbuatan keji; dan Allah memerintahkan malaikat Jibril untuk meniupkan ruh pada saku bajunya, kemudian dia mengandung Isa. Maryam beriman kepada Tuhannya, kitab-kitab-Nya, dan syariat-syariat yang ada di dalamnya; dan dia orang yang senantiasa mentaati Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَضَرَبَ اللَّـهُ مَثَلًا لِّلَّذِينَ ءَامَنُوا۟ امْرَأَتَ فِرْعَوْنَ (Dan Allah membuat isteri Fir’aun perumpamaan bagi orang-orang yang beriman) Yakni kekuasaan orang kafir tidak dapat membahayakan mereka sebagaimana Firi’aun tidak dapat membahayakan istrinya, padahal ia berada di bawah naungan orang yang paling kafir, namun dengan keimanannya ia berhasil meraih surga yang penuh kenikmatan. إِذْ قَالَتْ رَبِّ ابْنِ لِى عِندَكَ بَيْتًا فِى الْجَنَّةِ(ketika ia berkata: “Ya Rabbku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam surga) Yakni buatkanlah aku rumah yang dekat dengan rahmat-Mu di tempat yang disiapkan bagi orang-orang yang dekat denagn-Mu. وَنَجِّنِى مِن فِرْعَوْنَ وَعَمَلِهِۦ(dan selamatkanlah aku dari Fir’aun dan perbuatannya) Yakni dari dirinya dan amal buruknya. وَنَجِّنِى مِنَ الْقَوْمِ الظّٰلِمِينَ(dan selamatkanlah aku dari kaum yang zhalim) Mereka adalah orang-orang kafir dari kaum Fir’aun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Allah juga membuat perumpamaan bagi orang-orang mukmin bahwa lingkungan dan kekuasaan orang kafir tidak menciutkan mereka dan masih terus berpegang teguh pada agama. Perumpamaan mereka yaitu perempuan (istri) Fir’aun yang beriman kepada Allah dan rasulNya Musa. Dia tidak takut dengan kejahatan Fir’aun. Dia berdoa: “Wahai Tuhanku, bangunkanlah untukku rumah di surga, yang dekat dengan rahmatMu! Bebaskanlahah aku dari kesewenang-wenangan Fir’aun, dari siksanya dan perbuatannya yang buruk. Bebaskanlah aku juga dari kaum kafir yang menzalimi diri mereka sendiri yaitu suku Qubthi dan para penyembah berhala yang menganut Fir’aun ”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah juga membuat perumpamaan bagi orang-orang yang beriman, yaitu istri Fir‘aun, ketika dia berkata,“Ya Tuhanku, bangunkanlah untukku di sisiMu sebuah rumah dalam surga, selamatkanlah aku dari Fir‘aun dan perbuatannya, serta selamatkanlah aku dari kaum yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Dan Allah membuat istri Firaun perumpamaan bagi orang yang beriman,” namanya Asia binti Muzahim, “ketika ia berkata, ‘Ya Rabbku, bangunlah untukku sebuah rumah di sisiMu dalam surga dan selamatkanlah aku dari Firaun dan perbuatannya dan selamatkanlah aku dari kaum yang zhalim’.” Allah menyebutkan sifatnya sebagai sosok beriman, tunduk pada Rabbnya dan memohon permintaan tertinggi, yaitu masuk surga dan berada di dekat Rabb Yang Mahamulia serta memohon agar diselamatkan dari fitnah Firaun serta perbuatan-perbuatan busuknya serta fitnah semua orang yang zhalim. Dan Allah mengabulkan permintaannya. Asia pun hidup dalam keimanan sempurna dan kokoh, serta selamat dari berbagai fitnah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Dr. Abdul Malik bin Muhammad bin 'Abdurrahman al-Qaasim",
    "description": "11. وَضَرَبَ اللَّـهُ مَثَلًا لِّلَّذِينَ ءَامَنُوا۟ امْرَأَتَ فِرْعَوْنَ (Dan Allah membuat isteri Fir’aun perumpamaan bagi orang-orang yang beriman) Yakni kekuasaan orang kafir tidak dapat membahayakan mereka sebagaimana Firi’aun tidak dapat membahayakan istrinya, padahal ia berada di bawah naungan orang yang paling kafir, namun dengan keimanannya ia berhasil meraih surga yang penuh kenikmatan. إِذْ قَالَتْ رَبِّ ابْنِ لِى عِندَكَ بَيْتًا فِى الْجَنَّةِ(ketika ia berkata: “Ya Rabbku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam surga) Yakni buatkanlah aku rumah yang dekat dengan rahmat-Mu di tempat yang disiapkan bagi orang-orang yang dekat denagn-Mu. وَنَجِّنِى مِن فِرْعَوْنَ وَعَمَلِهِۦ(dan selamatkanlah aku dari Fir’aun dan perbuatannya) Yakni dari dirinya dan amal buruknya. وَنَجِّنِى مِنَ الْقَوْمِ الظّٰلِمِينَ(dan selamatkanlah aku dari kaum yang zhalim) Mereka adalah orang-orang kafir dari kaum Fir’aun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 11: Adapun permisalan yang kedua : Adalah mereka yang beriman kepada Allah dan Rasul-Nya, dimana Allah menjelaskan bahwa keterkaitan mereka dengan orang-orang kafir tidak membahayakan mereka dan tidak juga berdampak pada mereka selama mereka mampu istiqamah di atas kebenaran; Dan ia adalah istri Fir’aun yang bernama Asiyah binti Muzahim dialah perempuan yang shalihah yang menjadi istri dari musuh Allah ketika ia di dunia. Sungguh ia (Asiyah) telah bermunajat untuk suaminya dan amalannya, ia berdoa : Wahai Tuhanku, jadikanlah aku dekat dengan rahmat-Mu, dan bangunkanlah aku rumah di surga yang tinggi, dan jauhkan aku dari amalan Fir’aun yang buruk dan lindungi aku dari kaumnya yang dzalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Asiyah bintu Muzaahim radhiyallahu 'anha, ia beriman kepada Nabi Musa ‘alaihis salam hingga akhirnya ia disiksa oleh Fir’aun. Maka Allah mengabulkan doanya, ia pun hidup di atas keimanan yang sempurna, keteguhan yang sempurna dan keselamatan dari segala fitnah (cobaan). Oleh karena itu, Nabi shallallahu 'alaihi wa sallam bersabda, “ كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ ، وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ إِلاَّ آسِيَةُ امْرَأَةُ فِرْعَوْنَ ، وَمَرْيَمُ بِنْتُ عِمْرَانَ ، وَإِنَّ فَضْلَ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ “Laki-laki yang sempurna banyak, sedangkan wanita yang sempurna hanyalah Asiyah istri Fira’un dan Maryam bintu Imran, dan sesungguhnya kelebihnan Aisyah daripada wanita lain adalah seperti kelebihan makanan tsarid (roti yang direndam dalam kuah) di atas makanan yang lain.” (HR. Bukhari dan Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 11",
    "description": "Begitu juga sebab kaya, istri yang beriman tidak bisa juga menyelamatkan suamiya yang kaifr dari azab Allah. Dan Allah membuat perumpamaan bagi orang-orang yang beriman bahwa perempuan beriman, meskipun menjadi istri seorang kafir yang pada waktu dibolehkan, akan memperoleh keselamatan di akhirat seperti istri firaun, ketika dia berkata dalam doanya kepada Allah waktu menghadapi siksaan suaminya yang memaksanya untuk murtad, 'ya tuhanku, bangunkanlah untukku sebuah rumah di sisi-Mu dalam surga, karena tidak nyaman berada di istana firaun; dan selamatkanlah aku dari firaun dan perbuatannya yang terus menyiksa; dan doanya kepada Allah, selamatkanlah aku dari kaum yang zalim, balatentara firaun yang terus menyiksanya hingga wafat sehingga ia tidak merasakan siksaan mereka. ' 12. Ayat ini menjelaskan kesalehan seorang perempuan yang tak pernah bersuami, tetapi memiliki seorang putra. Dan maryam putri imran yang memelihara kehormatannya, lalu Allah memberikan penghargaan, penghomatan, dan kemuliaan kepadanya, maka kami meniupkan ke dalam rahimnya sebagian dari roh ciptaan kami sehingga ia hamil dan melahirkan bayi tanpa bapak; dan dia, maryam putri imran, membenarkan kalimat-kalimat tuhannya yang menjelaskan kekuasaan Allah yang tak terbatas dan kitab-kitab-Nya, yaitu kitab taurat dan zabur; dan dia termasuk orang-orang yang taat kepada Allah dengan rukuk dan sujud dan menjaga kehormatan dirinya."
  }
]