[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12. Allah membuat perumpamaan bagi orang-orang beriman, yaitu Maryam binti Imran yang menjaga kehormatannya dan melindunginya dari perbuatan keji, maka Allah memerintahkan JIbril agar meniup di balik celah pakaiannya, maka tiupan itu sampai ke rahimnya, maka dia mengandung Isa, dia membenarkan kalimat TUhannya, mengamalkan syariat-syariatNYa yang Dia syariatkan bagi hamba-hambaNya dan kitab-kitabNya yang Dia turunkan kepada para RasulNya, dia termasuk orang-orang yang taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan Allah membuat perumpamaan bagi orang-orang yang beriman kepada Allah dan Rasul-Nya dengan kondisi Maryam binti Imran yang telah menjaga kemaluannya dari zina, lalu Allah memerintahkan kepada Jibril untuk meniupkan ke dalam rahimnya lalu ia hamil dengan takdir Allah dan melahirkan Isa bin Maryam tanpa seorang ayah. Dia membenarkan syariat-syariat Allah dan kitab-kitab-Nya yang diturunkan kepada para rasul-Nya, dan dia termasuk hamba yang taat kepada Allah dengan menjalankan segala perintah-Nya dan menahan diri dari yang dilarang oleh-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَمَرْيَمَ ابْنَتَ عِمْرٰنَ(dan (ingatlah) Maryam binti Imran) Allah memberinya kemuliaan di dunia dan di akhirat, dan memilihnya dari wanita-wanita lainnya di dunia, padahal ketika itu ia tinggal di lingkungan orang-orang pelaku maksiat. الَّتِىٓ أَحْصَنَتْ فَرْجَهَا(yang memelihara kehormatannya) Dari perbuatan keji. فَنَفَخْنَا فِيهِ مِن رُّوحِنَا(maka Kami tiupkan ke dalam rahimnya sebagian dari ruh (ciptaan) Kami) Yakni Jibril meniupkan ke kerah pakaiannya, maka ia hamil, mengandung Isa. وَصَدَّقَتْ بِكَلِمٰتِ رَبِّهَا(dan dia membenarkan kalimat Rabbnya) Yakni membenarkan segala syariat yang ditetapkan bagi hamba-hamba-Nya, dan kalimat yang disampaikan malaikat kepadanya, yaitu ucapan Jibril kepadanya: “Aku adalah utusan Tuhanmu”, serta kalimat yang mengandung pengabaran tentang kelahiran Isa dan bahwa ia akan menjadi seorang rasul yang dekat dengan Allah. –lihat surat Ali Imran: 42-48. وَكُتُبِهِۦ(dan Kitab-Kitab-Nya) Yakni kitab-kitab yang diturunkan kepada para nabi. وَكَانَتْ مِنَ الْقٰنِتِينَ (dan dia adalah termasuk orang-orang yang taat) Yakni termasuk kaum yang mentaati Tuhan mereka. Dan keluarga Maryam adalah keluarga yang penuh dengan kebaikan dan ketaatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah juga membuat perumpamaan lain bagi orang-orang mukmin yang mengumpulkan kemuliaan dunia dan akhirat meskipun berada dalam lingkungan yang penuh maksiat, yaitu Maryam binti Imran yang menjaga kehormatannya dan memeliharanya dari perbuatah-perbuatan keji. Kemudian kami tiupkan ruh di antara farjinya atau lubang kehormatannya. Kami menciptakan itu tanpa melalui perantara seorang ayah. Lalu dia mengandung Isa AS. Dia (Maryam) membenarkan syariat-syariat Allah dan kitab-kitabNya yang diturunkan kepada rasul-rasulNya, melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya. Dia termasuk dalam golongan orang-orang yang taat kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Maryam putri Imran yang memelihara} yang memelihara dari zina {kehormatannya, lalu Kami meniupkan ke dalam rahimnya sebagian dari ruh (ciptaan) Kami} Lalu Kami memerintahkan Jibril, lalu dia meniupkan melalui sela-sela pakaiannya sehingga dia mengandung Isa di dalam perutnya {dan yang membenarkan kalimat-kalimat Tuhannya} ketentuan Tuhannya {dan kitab-kitabNya, serta yang termasuk orang-orang taat} orang orang yang taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman, “Dan Maryam putri Imran yang memelihara kehormatannya,” yaitu menjaganya dari kekejian karena kesempurnaan agama, penjagaan diri, dan kesuciannya, “maka Kami tiupkan ke dalam rahimnya sebagian ruh (ciptaan) Kami,” di mana Jibril meniupkan ruh ke kerah bajunya dan tiupan itu sampai ke Maryam kemudian dari situ lahirlah Nabi Isa, sosok Rasul mulia dan pemimpin besar. “Dan dia membenarkan kalimat Rabbnya dan kitab-kitabNya.” Maryam memiliki sifat berilmu dan berpengetahuan, karena membenarkan kalimat Allah mencakup Firmna-firman agama dan takdir, sedangkan membenarkan kitab-kitabNya mengharuskan adanya pengetahuan yang bisa memunculkan sikap pembenaran. Kedua hal ini tidak bisa dilakukan tanpa ilmu dan amal. Karena itu Allah berfirman, “Dan dia termasuk orang-orang yang taat,” yaitu orang yang senantiasa taat kepada Allah dengan rasa takut dan khusyu. Kesempurnaan amal inilah sifat Maryam. Di adalah sosok yang membenarkan. Dan orang yang membenarkan itu memiliki kesempurnaan ilmu dan amal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 12: Dan juga Maryam binti Imran yang shalihah, yang bertakwa dan suci, Allah memujinya, yang bahwasanya Maryam suci kemaluannya dari keburukan zina; Maka datanglah Jibril dan meniupkan di saku gamis (yang ia biasa gunakan di dalam rumahnya); Kemudian sampailah tiupan itu menuju ke tempat yang menjadikan janin ada di dalamnya (rahim) dengan izin Allah. Kemudian Maryam mengandung Isa; Ia adalah kalimatullah yang diciptakan dengan kata “jadilah” atau, dia diciptakan dengan perintah “kun”, sebagaimana Allah berfirman membantah orang-orang yang celaka : إِنَّ مَثَلَ عِيسَىٰ عِندَ ٱللَّهِ كَمَثَلِ ءَادَمَ ۖ خَلَقَهُۥ مِن تُرَابٍۢ ثُمَّ قَالَ لَهُۥ كُن فَيَكُونُ, yang artinya : Sesungguhnya misal (penciptaan) Isa di sisi AllAh, adalah seperti (penciptaan) Adam. Allah menciptakan Adam dari tanah, kemudian Allah berfirman kepadanya: \"Jadilah\" (seorang manusia), maka jadilah dia. {Al Imran : 59}. Kemudian Allah memuji Maryam yang dia adalah perempuan yang membenarkan atas ucapan Tuhannya, dan beramal dengan syariat-Nya, yang Allah mensyariatkan bagi hambanya. Allah juga menempatkan derajatnya di sisi para utusan-Nya. Kemudian Allah memuji bahwa dia adalah termasuk orang-orang yang menjaga atas ketaatan kepada Allah dan beribadah kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena sempurnanya agamanya, ‘iffah (sikap menjaga diri dari yang haram) dan kebersihannya. Yaitu dengan mengutus Malaikat Jibril meniupkan roh ciptaan-Nya ke leher bajunya lalu sampai kepada Maryam, maka dari sanalah muncul Isa ‘alaihis salam rasul yang mulia. Ini merupakan sifat bagi Maryam, yaitu berilmu dan berpengetahuan, karena membenarkan kalimat Allah mencakup kalimat Allah yang terkait agama maupun taqdir. Membenarkan kitab-kitab-Nya menghendaki mengetahui sesuatu yang dengannya tercapai sikap membenarkan dan hal itu tidak bisa kecuali dengan ilmu dan amal. Yakni kepada Allah dan selalu taat dengan rasa takut dan khusyu’. Ini merupakan sifat untuk Maryam yaitu amalnya yang sempurna, karena Beliau adalah shiddiqah (wanita yang sangat membenarkan), sedangkan shiddiqah adalah kesempurnaan dalam ilmu dan amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 12",
    "description": "Ayat ini menjelaskan kesalehan seorang perempuan yang tak pernah bersuami, tetapi memiliki seorang putra. Dan maryam putri imran yang memelihara kehormatannya, lalu Allah memberikan penghargaan, penghomatan, dan kemuliaan kepadanya, maka kami meniupkan ke dalam rahimnya sebagian dari roh ciptaan kami sehingga ia hamil dan melahirkan bayi tanpa bapak; dan dia, maryam putri imran, membenarkan kalimat-kalimat tuhannya yang menjelaskan kekuasaan Allah yang tak terbatas dan kitab-kitab-Nya, yaitu kitab taurat dan zabur; dan dia termasuk orang-orang yang taat kepada Allah dengan rukuk dan sujud dan menjaga kehormatan dirinya. 1. Surah sebelumnya yaitu at-tahr'm, diakhiri dengan uraian tentang kebinasaan yang menimpa siapa yang durhaka tanpa dapat ditolong oleh siapa pun, seperti halnya istri nuh dan lut. Dan kebahagiaan akan diraih bagi yang taat tanpa dapat diganggu oleh siapa pun, seperti halnya istri fir'aun dan maryam. Ini disebabkan yang mengatur itu semua adalah Allah yang mahakuasa, karena itu awal surah ini menguraikan kuasa Allah serta limpahan anugerah-Nya: mahasuci Allah yang menguasai segala kerajaan, di langit dan di bumi, dan dia mahakuasa atas segala sesuatu, tidak ada satu perkara pun yang melemahkan-Nya."
  }
]