[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2. Alah telah mensyariatkan bagi kalian (wahai orang-orang Mukmin) pembebasan dari sumpah kalian dengan membayar kafarat untuknya, yaitu memberi makan 10 orang miskin atau memberi mereka pakaian, atau memerdekakan budak, barangsiapa tidak mampu, maka berpuasa 3 hari. Allah adalah penolong kalian dan pengurus urusan-urusan kalian. Allah Maha Mengetahui tentang apa yang baik bagi kalian lalu Dia mensyariatkannya bagi kalian, lagi Mahabijaksana dalam perkataan dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah telah mensyariatkan untuk kalian cara untuk membebaskan diri dari sumpah-sumpah kalian jika kalian melanggarnya atau ada yang lebih baik daripadanya dengan membayar kafarat. Sungguh Allah adalah Penolong kalian, dan Dia Maha Mengetahui tentang kondisi kalian dan apa yang baik bagi kalian. Dia Maha Bijaksana dalam syariat dan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hai orang-orang beriman, Allah telah mensyariatkan kepada kalian cara membatalkan sumpah kalian dengan membayar kafarat; yaitu dengan memberi makan sepuluh orang miskin, atau dengan memberi mereka pakaian, atau juga dengan memerdekakan satu orang budak. Dan barangsiapa yang tidak memperoleh salah satu dari tiga hal ini, maka hendaklah dia berpuasa selama tiga hari. Allah adalah penolong kalian dan pengatur urusan kalian; Dia Maha Mengetahui urusan makhluk-Nya, dan Maha Bijaksana dalam menetapkan hukum-hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. قَدْ فَرَضَ اللَّـهُ لَكُمْ تَحِلَّةَ أَيْمٰنِكُمْ ۚ (Sesungguhnya Allah telah mewajibkan kepadamu sekalian membebaskan diri dari sumpahmu) Yakni Allah mensyariatkan penebusan sumpah dengan membayar kaffarat sebagaimana disebutkan dalam surat al-Maidah: 89, dan Allah telah menjelaskan hal itu. Tidak ada seorangpun yang boleh mengharamkan apa yang telah dihalalkan Allah, jika ada yang melakukan itu maka hukum itu tidak sah dan tidak berlaku bagi dirinya. Karena penghalalan dan pengharaman merupakan ketetapan Allah. Namun jika ada orang yang melakukan itu maka para ahli fiqih berpendapat bahwa barangsiapa yang mengharamkan atas dirinya baju, pakaian, makanan, minuman, atau segala sesuatu yang dibolehkan Allah maka itu seperti sebuah sumpah; jika ia membatalkan apa yang diharamkan atas dirinya itu maka ia harus membayar kaffarat, sehingga jika ia telah membayar kaffarat maka sumpahnya sudah tidak berlaku lagi baginya. Hal ini berlaku pada segala sesuatu bahkan pada istri jika suaminya bertekat mengharamkan istrinya itu bagi dirinya. Namun sebagian ahli fiqih berpendapat jika ia mengharamkan istrinya dengan niat mentalaknya maka itu dianggap talak. Allahu a’lam. وَاللَّـهُ مَوْلَىٰكُمْ ۖ( dan Allah adalah Pelindungmu) Yakni pelindung dan penolong kalian. وَهُوَ الْعَلِيمُ الْحَكِيمُ (dan Dia Maha Mengetahui lagi Maha Bijaksana) Mengetahui apa yang bermanfaat bagi kalian, dan bijaksana dalam perbuatan dan perkataan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Sungguh Allah mewajibkan kepadamu untuk membebaskan diri dari sumpah kalian dengan melanggar kebenaran (sebagaiman disebutkan) dalam surah Al-Maidah ayat 89. Allah adalah Dzat yang menjaga urusan-urusan kalian dan juga menolong kalian. Dialah Dzat yang Maha Mengetahui apa yang baik bagi kalian, juga Dzat yang Berkuasa dalam menangani, menentukan hukum dan menata urusan-urusan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Allah telah menentukan} mensyariatkan {untuk kalian pembebasan diri dari sumpah kalian} pembebasan dari sumbah kalian, dengan membayar kafarat untuknya. Allah adalah pelindung kalian} penolong kalian dan pengawas urusan-urusan kalian {dan Dia Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Pengharaman yang bersumber dari nabi Muhammad itu menjadi sebab disyariatkannya hukum secara umum untuk seluruh umat, kemudian Allah berfirman, “Sungguh Allah telah mewajibkan kamu sekalian membebaskan diri dari sumpahmu,” dan ini berlaku pada sumpah kaum Mukminin secara umum. Maksudnya, Allah mensyariatkan dan menentukan ketetapan yang bisa menghapus sumpah kalian sebelum dilanggar serta tebusan yang harus ditunaikan apabila sumpah itu dilanggar. Ini semakna dengan firman Allah: “Hai orang-orang yang beriman, janganlah kamu haramkan apa-apa yang baik yang telah Allah halalkan bagi kamu, dan janganlah kamu melampaui batas. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas. Dan makanlah makanan yang halal lagi baik dari apa yang Allah telah rezekikan kepadamu, dan bertakwalah kepada Allah yang kamu beriman kepada-Nya. Allah tidak menghukum kamu disebabkan sumpah-sumpahmu yang tidak dimaksud (untuk bersumpah), tetapi Dia menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja, maka kaffarat (melanggar) sumpah itu, ialah memberi makan sepuluh orang miskin, yaitu dari makanan yang biasa kamu berikan kepada keluargamu, atau memberi pakaian kepada mereka atau memerdekakan seorang budak. Barang siapa tidak sanggup melakukan yang demikian, maka kaffaratnya puasa selama tiga hari. Yang demikian itu adalah kaffarat sumpah-sumpahmu bila kamu bersumpah (dan kamu langgar). Dan jagalah sumpahmu. Demikianlah Allah menerangkan kepadamu hukum-hukum-Nya agar kamu bersyukur (kepada-Nya).” – Al maidah: 87-89- Setiap orang yang mengharamkan sesuatu yang halal, baik berupa makanan, minuman ataupun sahaya wanita maupun bersumpah atas nama Allah untuk melakukan seseuatu atau tidak melakukan sesuatu kemudian dilanggar, maka harus membayar kaffarat seperti tersebut di atas. Firman Allah, “Dan Allah adalah pelindungmu,” yakni yang melindungi segala urusanmu dan mendidikmu dengan baik dalam urusan agama dan duniamu serta segala sesuatu yang bisa menghindarkanmu dari keburukan. Karena itu Allah mewajibkanmu untuk melepaskan dirimu dari sumpah itu agar tanggung jawabmu menjadi bebas. “Dan Dia Maha Mengetahui lagi Mahabijaksana.” ilmuNya meliputi lahir dan batinmu. Dia Maha bijaksana terhadap seluruh makhluk dan menguasainya. Karena itu Dia mensyariatkan hukum-hukum yang Dia ketahui sesuai dengan kemaslahatan dan kondisi kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 2: Surat ini dibuka dengan teguran Nabi ﷺ yang menegur dengan ringan; Dimana Nabi mengharamkan atas dirinya meminum madu demi menjaga kehormatannya (dan) karena mengkhawatirkan istrinya Aisyah dan Hafsah di dalam cerita yang telah dikenal. Dan dikatakan juga bahwa Nabi ﷺ mengharamkan atas dirinya untuk seorang hamba sahaya Maria Al Qibthiyyah untuk supaya istrinya yaitu Aisyah dan Hafsah ridha kepada diri Nabi ﷺ. Maka Allah berkata : Wahai Nabi janganlah engkau melarang meminum madu yang Allah telah halalkan kepadamu, yang engkau hanya mencari ridha istri-istrimu ? Oleh karenanya, tidak semstinya engkau mengharamkan apa yang Allah halalkan, dan ketahuilah bahwa Allah Maha Luas ampunan-Nya, dan Maha Besar kasih sayang-Nya; Maka Allah telah ampuni Nabi dan mengampuni umatnya dengan menurunkan kafarat al yamin, maka jadilah umat secara umum menjadi ahli iman. Dapat dipetik manfaat pada ayat ini yaitu larangan mengharamkan apa yang Allah halalkan, dan berkata sebagian ulama : Sumpah Allah atas pengharaman apa yang telah Allah halalkan yang tidak mungkin dapat berkumpul (urusannya) satu sama lain. Berkata para ulama yang lain : Termasuk dari sumpah Allah, maka jika berharap apa yang telah Allah halalkan (kemudian dijadikan haram), kufur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apabila seseorang bersumpah mengharamkan yang halal maka wajib atasnya membebaskan diri dari sumpahnya itu dengan membayar kaffarat, seperti yang disebutkan dalam surat Al Maaidah ayat 89. Yakni yang mengurus urusanmu dan mengajarkan kamu dengan pengajaran yang sebaik-baiknya dalam urusan agama maupun dunia serta mengajarkan sesuatu yang dengannya seseorang dapat terhindar dari keburukan. Oleh karena itulah, Dia mewajibkan membebaskan dirimu dari sumpah agar lepas tanggung jawabmu. Ilmu-Nya meliputi zahir dan batinmu dan Dia Mahabijaksana dalam ciptaan-Nya dan dalam keputusan-Nya, oleh karena itulah Dia mensyariatkan beberapa hukum untuk kamu yang dari sana dapat diketahui bahwa hal itu sesuai dengan maslahat kamu dan keadaan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 2",
    "description": "Pada ayat ini Allah memerintahkan kepada nabi untuk membatalkan sumpah beliau mengharamkan minum madu dan berhubungan dengan salah seorang istri beliau, mariyah al-qib'iyyah. 'sungguh, Allah telah mewajibkan kepada kamu, wahai nabi untuk membebaskan diri dari sumpah kamu untuk tidak akan minum madu dan tidak akan berhubungan dengan istri dengan membayar kafarat; dan Allah adalah pelindungmu, wahai nabi dari segala keadaan yang tidak menyenangkan dan dia maha mengetahui, semua yang dirahasiakan manusia; mahabijaksana dalam menilai perbuatan mereka. '3. Dan ingatlah ketika secara rahasia nabi membicarakan suatu peristiwa kepada salah seorang istrinya, yaitu kepada hafsah bahwa beliau bersumpah tidak akan pernah berhubungan suami-istri dengan mariyah al-qib'iyyah setelah berhubungan dengannya di rumah hafsah. Beliau berpesan agar kejadian ini tidak diberitahukan kepada siapa pun. Lalu dia, hafsah, menceritakan peristiwa itu kepada '''isyah sehingga rahasia nabi diketahui '''isyah. Dan Allah pun segera memberitahukan peristiwa pembocoran rahasia itu kepadanya, yakni kepada nabi. Lalu beliau memberitahukan kasus pembocoran rahasia itu kepada hafsah sebagian, yakni berkenaan dengan sumpah beliau tidak akan pernah berhubungan suami istri dengan mariyah al-qib'iyyah dan tidak akan pernah minum madu di rumah zainab binti jahsy; dan menyembunyikan sebagian yang lain perihal kepemimpinan setelah beliau wafat akan jatuh kepada abu bakar kemudian kepada 'umar. Maka ketika dia, yakni nabi memberitahukan pembicaraan itu kepadanya, yakni kepada hafsah, maka segera dia bertanya, sangat kaget. 'siapa yang telah memberitahukan kejadian ini kepada kamu, wahai nabi Allah' nabi menjawab, 'yang memberitahukan kepadaku tentang pembocoran rahasia itu adalah Allah yang maha mengetahui segala yang tampak maupun yang tersembunyi, mahateliti terhadap segala keadaan. '."
  }
]