[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3. Ketika Nabi mengabarkan sesuatu kepada istrinya, Hafshah, secara rahasia, lalu Hafshah menyampaikannya kepada Aisyah, dan Allah memberitahu NabiNya tentang penyebaran Hafshah terhadap rahasiaNya, Nabi memberitahu Hafshah sebagian dari apa yang dia kabarkan dan Nabi tidak memberitahu Hafshah sebagian lainnya karena kemurahan hati Nabi, ketika Nabi memberitahu Hafshah pembicaraaan yang dia sebarkan, dia bertanya, “Siapa yang memberitahumu ini?” Nabi menjawab, “ Yang mengabariku adalah Allah yang Maha Mengetahui lagi Maha teliti, yang tidak ada sesuatu pun yang samar bagiNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Ingatlah ketika Nabi -ṣallallāhu 'alaihi wa sallam- menyampaikan berita secara khusus kepada Hafṣah, istrinya, diantaranya bahwa ia tidak akan mendekati istrinya, Mariyah. Maka ketika Hafṣah mengabarkannya kepada Aisyah dan Allah memberi tahu Nabi-Nya tentang penyebaran rahasia tersebut maka Nabi mencela Hafṣah, lalu beliau menyebutkan sebagian yang dibicarakan Hafṣah dan mendiamkan sebagiannya. Lalu Hafṣah bertanya, “Siapa yang memberitahumu?” Maka Nabi menjawab, “Allah yang Mahatinggi dan Mahatahu atas segala yang tersembunyi.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan ketika Nabi berbicara secara rahasia kepada Hafshah bahwa beliau telah melarang dirinya menggauli budak wanita, atau meminum madu; namun Hafshah menyampaikan rahasia ini kepada Aisyah. Maka Allah mengabarkan kepada Rasulullah tentang pembocoran rahasia yang dilakukan Hafshah kepada Aisyah ini; kemudian Rasulullah mengatakan kepada Hafshah tentang beberapa hal yang dia bocorkan, dan beberapa lainnya tidak beliau katakan kepadanya. Ketika Rasulullah mengatakan kepada Hafshah tentang beberapa hal yang dia bocorkan itu, dia merasa heran dan berkata: “Siapa yang telah memberitahukan engkau bahwa aku telah membocorkan rahasia itu?” Maka Rasulullah menjawab: “Allah-lah yang telah memberitahukanku, Yang Maha Mengetahui segala hal yang tersembunyi dan yang tampak.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَإِذْ أَسَرَّ النَّبِىُّ إِلَىٰ بَعْضِ أَزْوٰجِهِۦ حَدِيثًا (Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang isterinya suatu peristiwa) Yakni kepada Hafsah sebagaimana telah disebutkan. Dan peristiwa yang dimaksud adalah pengharaman madu atas dirinya. Al-Kalby mengatakan: yakni Rasulullah berbicara dengan Hafsah secara rahasia bahwa ayahmu dan ayah Aisyah akan menjadi khalifah bagi umatku setelahku. فَلَمَّا نَبَّأَتْ بِهِۦ(Maka tatkala (Hafsah) menceritakan peristiwa itu) Yakni menceritakan pembicaraan itu kepada orang lain. وَأَظْهَرَهُ اللَّـهُ عَلَيْهِ(dan Allah memberitahukan hal itu kepada Muhammad) Yakni Allah memberitahukan apa yang terjadi tentang Hafsah yang menceritakan peristiwa itu kepada orang lain. عَرَّفَ بَعْضَهُۥ (lalu Muhammad memberitahukan sebagian) Yakni Rasulullah memberitahu Hafsah sebagian yang ia ceritakan kepada orang lain. وَأَعْرَضَ عَنۢ بَعْضٍ ۖ( dan menyembunyikan sebagian yang lain) Yakni enggan untuk memberitahu sebagian hal lainya. فَلَمَّا نَبَّأَهَا بِهِۦ(Maka tatkala (Muhammad) memberitahukan pembicaraan itu) Yakni setelah Rasulullah memberitahu apa yang telah Hafsah sebarkan kepada orang lain. قَالَتْ مَنْ أَنۢبَأَكَ هٰذَا ۖ(ia bertanya: “Siapakah yang telah memberitahukan hal ini kepadamu?”) Yakni siapa yang memberitahukanmu. قَالَ نَبَّأَنِىَ الْعَلِيمُ الْخَبِيرُ (Nabi menjawab: “Telah diberitahukan kepadaku oleh Allah yang Maha Mengetahui lagi Maha Mengenal”) Yakni yang memberitahuku adalah Allah yang tidak ada sesuatu yang tersembunyi bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Ingatlah ketika Nabi merahasiakan pembicaraan dengan sebagian istrinya yaitu Hafsah. Beliau mengharamkan madu (bagi dirinya) yang beliau minum bersama Zainab dan Bintu Jahsy. Ketika Hafsah memberitahu hal ini kepada Aisyah dan bahwa muslihat mereka berdua berhasil serta Allah menunjukkan kepada beliau tentang rahasia Hafsah, Rasulallah memberitahu Hafsah tentang sebagian hal (yang diberitakan Allah) tentang pembicaraan yang berlangsung antara dia dan Aisyah dan apa yang dia sembunyikan dari beliau, yaitu ucapan beliau “Aku tidak akan mengulangi meminum madu lagi”. Sebagian berita itu dirahasiakan untuk memuliakan beliau dan agar tidak membuat Hafsah lebih malu. Hafsah bertanya: “Siapakah yang memberitahu engkau tentang hal ini?”. Beliau menjawab: “Yang memberitahuku tentang hal ini adalah Allah yang Maha Mengetahui tentang segala sesuatu yang tersembunyi, Dzat yang juga Maha Memberitahu urusan-urusan yang tersembunyi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Nabi membicarakan secara rahasia suatu peristiwa kepada salah satu istrinya} yaitu Hafsah binti Umar RA {Kemudian, ketika dia menceritakan itu} mengabarkan hal itu kepada Aisyah {dan Allah memberitahukannya kepadanya} Allah menampakkan kepada Nabi bahwa Hafsah menceritakan hal itu {dia memberitahukan sebagian} Nabi menceritakan sebagian kepada Hafsah {dan menyembunyikan sebagian yang lain. Ketika dia memberitahukan (pembicaraan) itu kepadanya (Hafsah), dia bertanya,“Siapa yang telah memberitahumu tentang hal ini” Nabi menjawab, “Yang memberitahuku adalah Allah Dzat Yang Maha Mengetahui lagi Maha teliti.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Allah berfirman, “Dan ingatlah ketika Nabi membicarakan secara rahasia kepada salah seorang dari istri-istrinya suatu peristiwa.” Kebanyakan ahli tafsir menyatakan bahwa istri yang dimaksud adalah Hafshah, Ummul Mukminin. Rasulullah membisikkan suatu rahasia kepadanya dan diperintahkan agar tidak diberitahukan pada siapa pun. Ternyata Hafshah menceritakan rahasia itu kepada Aisyah dan Allah memberitahukan hal itu kepada Rasulullah. Kemudian Rasulullah memberitahukan pada Hafshah sebagian yang dikatakannya dan menyembunyikan sebagin lainnya, karena sifat mulia dan kesabaran Rasulullah. Hafshah bertanya, “Siapakah yang memberitahukan hal ini kepadamu,” yakni kabar yang tidak kami sebarkan itu? “Nabi menjawab, ‘ Telah diberitahukan kepadaku oleh Allah Yang Maha MEngetahui lagi Maha Mengenal’.” Yang tidak ada sesuatu pun yang samar bagiNya. Dia mengetahui yang rahasia dan yang samar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 3: Ingatlah wahai Nabi ketika membicarakan secara rahasia kepada Hafshah, dan Nabi menuntut Hafshah agar tidak mengabarkan kepada siapapun, akan tetapi Hafshah tidak menjaga rahasia Nabi, ia mengabarkan kepada Aisyah. Dan datang kepada Nabi ﷺ kabar dari langit bahwa Hafshah mengabarkan rahasia Nabi, maka Nabi menegur Hafshah dan mengabarkan kepadanya tentang apa yang dikabarkan kepada Nabi dan diam pada sebagian kabar yang lain sebagai penghormatan dan malu kpada Hafshah. Setelah Nabi mengabarkan kesalahannya dan menegur Hafshah, maka Hafshah berkata : Siapa yang telah mengabarkan semuanya ini kepadamu ? Maka Nabi berkata kepadanya : Allah yang mengabarkanku yang Dia Maha Tahu atas semua rahasia seorang hamba, dan Yang Maha Mengabarkan dimana tidak ada sesuatupun yang tersembunyi di dumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu pengharaman Mariyah, dan Beliau berkata kepada Hafshah, “Jangan memberitahukan kepada seorang pun.” Karena mengira bahwa hal itu tidak berdosa. Karena keramahan Beliau dan santunnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 3",
    "description": "Dan ingatlah ketika secara rahasia nabi membicarakan suatu peristiwa kepada salah seorang istrinya, yaitu kepada hafsah bahwa beliau bersumpah tidak akan pernah berhubungan suami-istri dengan mariyah al-qib'iyyah setelah berhubungan dengannya di rumah hafsah. Beliau berpesan agar kejadian ini tidak diberitahukan kepada siapa pun. Lalu dia, hafsah, menceritakan peristiwa itu kepada '''isyah sehingga rahasia nabi diketahui '''isyah. Dan Allah pun segera memberitahukan peristiwa pembocoran rahasia itu kepadanya, yakni kepada nabi. Lalu beliau memberitahukan kasus pembocoran rahasia itu kepada hafsah sebagian, yakni berkenaan dengan sumpah beliau tidak akan pernah berhubungan suami istri dengan mariyah al-qib'iyyah dan tidak akan pernah minum madu di rumah zainab binti jahsy; dan menyembunyikan sebagian yang lain perihal kepemimpinan setelah beliau wafat akan jatuh kepada abu bakar kemudian kepada 'umar. Maka ketika dia, yakni nabi memberitahukan pembicaraan itu kepadanya, yakni kepada hafsah, maka segera dia bertanya, sangat kaget. 'siapa yang telah memberitahukan kejadian ini kepada kamu, wahai nabi Allah' nabi menjawab, 'yang memberitahukan kepadaku tentang pembocoran rahasia itu adalah Allah yang maha mengetahui segala yang tampak maupun yang tersembunyi, mahateliti terhadap segala keadaan. '4. Jika kamu berdua, wahai hafsah dan '''isyah, bertobat kepada Allah dengan menghentikan kebiasaan yang tidak nyaman bagi nabi, maka sungguh, hati kamu berdua telah condong untuk menciptakan kedamaian bagi beliau; dan jika kamu berdua saling bantu-membantu menyusahkan nabi seperti selama ini terjadi, maka sungguh, Allah menjadi pelindungnya dan juga jibril dan orang-orang mukmin yang baik; dan selain itu malaikat-malaikat adalah penolongnya yang menunjukkan bahwa nabi dilindungi Allah, para malaikat, dan para sahabat beliau."
  }
]