[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Jika Nabi mentalak kalian wahai para istri, maka boleh jadi Tuhannya akan menikahkannya sebagai ganti dari kalian dengan para istri yang tunduk dan patuh kepada Allah, beriman kepada Allah dan RasulNya, taat kepada Allah, kembali kepada apa yang Allah cintai, yaitu ketaatan kepadaNya, banyak beribadah, berpuasa dan di antara mereka ada janda dan ada yang gadis perawan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Jika Nabi menceraikan kalian boleh jadi Rabbnya akan memberikan ganti dengan istri-istri yang lebih baik dari kalian, wanita-wanita yang patuh kepada perintah-Nya, yang beriman kepada-Nya dan kepada Rasul-Nya, yang taat kepada Allah, yang bertobat atas dosa-dosa mereka, yang beribadah kepada Rabb mereka, yang berpuasa, yang janda maupun yang perawan. Akan tetapi beliau tidak menceraikan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah menyampaikan kepada sebagian istri Nabi: “Jika Nabi Muhammad menceraikan kalian, maka mudah-mudahan Allah memberinya ganti dari kalian dengan menikahkannya dengan istri-istri yang lebih baik dari kalian; yaitu yang patuh kepada Allah, beriman kepada Allah dan rasul-Nya, taat kepada-Nya, senantiasa melaksanakan yang Allah sukai, rajin beribadah, senantiasa berpuasa, dan senantiasa menghayati ciptaan Allah; dari mereka ada yang janda dan ada yang perawan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبْدِلَهُۥٓ أَزْوٰجًا خَيْرًا مِّنكُنَّ (Jika Nabi menceraikan kamu, boleh jadi Tuhannya akan memberi ganti kepadanya dengan isteri yang lebih baik daripada kamu) Allah memberitahukan kepada istri-istri Rasulullah tentang kuasa-Nya untuk memberi Rasulullah istri pengganti yang lebih baik jika istri-istri itu diceraikan Rasulullah, hal ini untuk menakut-nakuti mereka. مُسْلِمٰتٍ مُّؤْمِنٰتٍ(yang patuh, yang beriman) Yakni yang menegakkan kewajiban-kewajiban agama Islam, dan percaya kepada Allah, malaikat, kitab-kitab dan para rasul. قٰنِتٰتٍ(yang taat) Yakni yang taat kepada Allah dan Rasulullah. تٰٓئِبٰتٍ(yang bertaubat) Dari dosa-dosa mereka. عٰبِدٰتٍ(yang mengerjakan ibadat) Yakni taat dan tunduk kepada Allah. سٰٓئِحٰتٍ(yang berpuasa) Yakng yang senantiasa berpuasa. ثَيِّبٰتٍ وَأَبْكَارًا(yang janda dan yang perawan) Makna (الثيب) adalah wanita yang telah menikah kemudian dicerai atau ditinggal mati suaminya. Sedangkan (البكر) yakni wanita yang masih gadis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Barangkali Tuhan akan menggantikan untuk beliau istri-istri yang lebih baik dari mereka yang menuntun menuju Islam dan Allah dengan sempurna, jika beliau menceraikan istri-istrinya atau sebagian dari mereka, dan hal itu dilakukan sesuai kuasa beliau (dalam rumah tangga)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika dia menceraikan kalian, boleh jadi Tuhannya akan memberi ganti kepadanya istri-istri yang lebih baik daripada kalian, yang berserah diri, beriman, taat} taat {bertaubat, beribadah, dan berpuasa} berpuasa {baik yang janda maupun perawan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Kemudian Allah mengancam keduanya dengan sesuatu yang amat memberatkan bagi para istri yaitu talak yang merupakan hal terbesar bagi mereka seraya berfirman, “Jika Nabi menceraikan kamu, boleh jadi Rabbnya akan memberi ganti kepadanya dengan istri-istri yang llebih baik daripada kamu.” Maksudnya, janganlah kalian menyusahkan Nabi, sebab andai dia menceraikan kalian, hal itu tidak akan membuatnya susah dan dia tidak melakukan tindakan yang membahayakan kalian. Karena Allah akan memberinya ganti istri-istri yang lebih baik dari kalian dari segi agama dan kecantikan. Hal ini dikaitkan dengan sesuatu, yang jika sesuatu itu tidak ada atau tidak terjadi, maka hal tersebut tidak berlaku. Maksudnya, Rasulullah tidak menceraikan keduanya, sebab andai keduanya dicerai, tentu Allah tidak menyebutkan sifat-sifat baik kedua istri tersebut yang memadukan antara Islam dengan menunaikan syariat-syariat yang zahir, keimanan dengan menunaikan syariat-syariat batin seperti akidah-akidah dan amalan hati dan senantiasa taat. “yang bertaubat,” dari segala sesuatu yang tidak disenangi Allah. Kedua istri mulia Rasulullah tersebut disifati sebagai sosok yang menunaikan amalan yang disukai Allah dan bertaubat dari amalan yang tidak disukai Allah. “Yang janda dan yang perawan.” Maksudnya, ada yang janda dan ada yang perawan, agar Rasulullah bisa memilih apa pun yang beliau senangi. Ketika keduanya mendengar ancaman dan didikan ini, mereka langsung melakukan amalan yang membuat Rasulullah ridha. Sifat tersebut di atas cocok dan berlaku pada kedua istri mulia Rasulullah ini sehingga mereka berdua adalah wanita-wanita Mukmin terbaik. Hal ini menunjukkan bahwa Allah selalu memilihkan kondisi dan keputusan terbaik bagi Rasulullah. Karena Allah memilihkan untuk Rasulullah agar tetap mempertahankan istri-istrinya, hal itu menunjukkan bahwa mereka adalah istri-istri paling baik dan paling sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 5: Kemudian Allah mengarahkan perkataan-Nya kepada istri-istri Nabi ﷺ, setelah di antara mereka ada yang merusak dan mencela rahasia Nabi. Allah mengabarkan bahwasanya jika Nabi mentalak mereka semua, maka Allah pasti akan memberikan ganti dengan istri-istri yang lebih baik yang kokoh keislamannya dan keimanannya, yang gigih dalam beribadah dan terbebas dari dosa, dan tunduk dengan perintah Rasulullah ﷺ, yang sebagiannya adalah janda dan sebagian yang lain masih gadis. Telah datang pada turunnya ayat ini bahwa istri-istri Nabi ﷺ ketika mereka melihat penaklukkan dan harta ghanimah dan melihat para istri-istri sahabat Anshar yang memberikan keluasan nafkah dan pakaian, maka mereka menyangkan bahwa para istri-istri sahabat Anshar tersebut mendapatkan banyak harta ghanimah dan fa’i (harta yang di dapat tanpa peperangan), dan pada saat itu ﷺ membagikan kepada Muhajirin dan orang-orang faqir, dan tidak membagikan kepada (istri-istri Nabi). Maka para istri Nabi meminta untuk meluaskan pemberian Nabi kepada mereka, maka mereka diberi pilihan untuk tetap bersama Nabi dengan kondisi yang telah diterimanya atau talak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Ibnu Abbas dari Umar bin Khaththab, ia berkata, \"Ketika Nabi shallallahu 'alaihi wa sallam menjauhi istri-istrinya, aku pun masuk ke masjid ternyata orang-orang sedang melempari kerikil dan berkata, \"Rasulullah shallallahu 'alaihi wa sallam telah mentalak istri-istrinya.\" Hal itu terjadi ketika mereka belum diperintahkan berhijab. Umar berkata, \"Saya akan beritahukan hal itu hari ini.\" Maka saya menemui Aisyah dan berkata, \"Wahai puteri Abu Bakar, apakah engkau sampai menyakiti Rasulullah shallallahu 'alaihi wa sallam?\" Aisyah menjawab, \"Apa urusanmu terhadapku wahai Ibnul Khaththab, urusilah aibmu sendiri.\" Umar berkata, \"Maka saya menemui Hafshah binti Umar dan berkata kepadanya, \"Wahai Hafshah! Apakah engkau sampai menyakiti Rasulullah shallallahu 'alaihi wa sallam. Demi Allah, sesungguhnya saya tahu bahwa Rasulullah shallallahu 'alaihi wa sallam tidak menyukaimu. Kalau bukan karena saya, tentu Rasulullah shallallahu 'alaihi wa sallam sudah mentalakmu.\" Hafshah pun menangis dengan tangisan yang begitu serius. Saya pun bertanya kepadanya, \"Di mana Rasulullah shallallahu 'alaihi wa sallam?\" Ia menjawab, \"Dia sedang berada di dekat lemarinya di kamar.\" Saya pun masuk, ternyata saya menemui Ribah pelayan Rasulullah shallallahu 'alaihi wa sallam sedang duduk di palang (kayu bawah) pintu kamar sambil memanjangkan kakinya di atas kayu berlubang, yaitu batang pohon kurma yang dipakai tangga oleh Rasulullah shallallahu 'alaihi wa sallam untuk naik dan turun. Ribah melihat ke kamar, lalu melihatku dan tidak berkata apa-apa, kemudian saya keraskan suara sambil berkata, \"Wahai Ribah, izinkan saya di bersamamu untuk menghadap Rasulullah shallallahu 'alaihi wa sallam, karena saya mengira bahwa Rasulullah shallallahu 'alaihi wa sallam mengira bahwa saya datang karena Hafshah. Demi Allah, jika Rasulullah shallallahu 'alaihi wa sallam memerintahkan aku memenggal lehernya, tentu saya penggal lehernya.\" Saya keraskan suara saya. Ia pun berisyarat kepadaku agar masuk kepadanya, maka saya masuk menemui Rasulullah shallallahu 'alaihi wa sallam, ternyata Beliau sedang berbaring di atas tikar, saya pun duduk, lalu Beliau mendekatkan kainnya dan Beliau tidak mengenakan apa-apa selain itu. Ketika itu, tikarnya membekas pada rusuk Beliau. Saya melihat dengan mata saya lemari Rasulullah shallallahu 'alaihi wa sallam, ternyata di sana terdapat segenggam gandum seukuran satu shaa' (4 mud/kaupan), demikian juga daun salam di pojok kamar serta ada kulit yang digantungkan. Saya pun meneteskan air mata, lalu Beliau bertanya, \"Apa yang membuatmu menangis, wahai Ibnul Khaththab?\" Aku menjawab, \"Wahai Nabi Allah, mengapa saya tidak menangis, sedangkan tikar ini membekas pada rusukmu. Sedangkan lemarimu tidak menyimpan apa-apa selain yang saya lihat. Berbeda dengan Kaisar dan Kisra yang memperoleh banyak buah dan berada di dekat sungai yang mengalir. Sedangkan engkau utusan Allah dan pilihan-Nya dengan keadaan lemari seperti ini.\" Beliau bersabda, \"Wahai Ibnul Khaththab, tidakkah kamu ridha, untuk kita akhirat dan untuk mereka dunia?\" Saya menjawab, \"Ya.\" Ketika saya masuk menemuinya, saya melihat tampak marah di mukanya, maka saya berkata, \"Wahai Rasulullah, para istri tidak akan menyusahkan dirimu. Jika engkau mentalak mereka, maka sesungguhnya Allah bersamamu, demikian pula, malaikat-Nya, Jibril, Mikail, saya, Abu Bakar, dan kaum mukmin bersamamu. \" Saya tidaklah berbicara –wal hamdulillah- kecuali saya berharap agar dibenarkan oleh Allah. Ketika itu turunlah ayat takhyir (pemberian pilihan), \"Jika kamu berdua bertaubat kepada Allah, Maka Sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan); dan jika kamu berdua bantu-membantu menyusahkan Nabi, Maka Sesungguhnya Allah adalah Pelindungnya dan (begitu pula) Jibril dan orang-orang mukmin yang baik; dan selain dari itu malaikat-malaikat adalah penolongnya pula. ---Jika Nabi menceraikan kamu, boleh Jadi Tuhannya akan memberi ganti kepadanya dengan istri yang lebih baik daripada kamu, yang patuh,...dst.\"(Terj. At Tahrim: 4-5) Ketika itu Aisyah binti Abu Bakar dan Hafshah saling bantu-membantu menyusahkan Nabi shallallahu 'alaihi wa sallam terhadap istri-istri yang lain. Saya pun berkata, \"Wahai Rasulullah, apakah engkau mentalak mereka?\" Beliau menjawab, \"Tidak.\" Saya berkata, \"Wahai Rasulullah, sesungguhnya saya masuk ke masjid sedangkan kaum muslimin sedang melempari kerikil sambil berkata, \"Rasulullah shallallahu 'alaihi wa sallam mentalak istri-istrinya.\" Bolehkah saya turun agar saya memberitahukan mereka bahwa Engkau tidak mentalak mereka?\" Beliau menjawab, \"Ya, jika engkau mau.\" Saya senantiasa berbicara dengan Beliau sampai hilang marah dari mukanya dan sampai Beliau memperlihatkan giginya dan tersenyum, dan Beliau adalah orang yang paling bagus giginya. Nabi Allah pun turun dan aku turun bersandar dengan batang tersebut. Rasulullah shallallahu 'alaihi wa sallam turun tampak seperti berjalan di tanah, di mana Beliau tidak menyentuhnya (batang tersebut) dengan tangannya, lalu saya berkata, \"Wahai Rasulullah, Engkau berada di kamar hanya 29 hari?\" Beliau bersabda, \"Sesungguhnya sebulan itu 29 hari.\" Saya pun berdiri di pintu masjid dan menyeru dengan suara keras, \"Rasulullah shallallahu 'alaihi wa sallam tidak mentalak istri-istrinya.\" Ketika itu turunlah ayat, \"Dan apabila datang kepada mereka suatu berita tentang keamanan ataupun ketakutan, mereka lalu menyiarkannya. dan kalau mereka menyerahkannya kepada Rasul dan ulil Amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya dari mereka (Rasul dan ulil Amri)…dst.\" Sayalah yang mengetahui perkara itu, dan Allah menurunkan ayat takhyir (pilihan). Yaitu melaksanakan syariat Islam yang tampak. Yaitu yang melaksanakan syariat Islam yang tidak tampak (batin) berupa ‘aqidah (keyakinan) dan amalan hati. Yaitu yang selalu taat. Dari apa yang dibenci Allah Subhaanahu wa Ta'aala. Allah menyifati mereka dengan mengerjakan apa yang dicintai Allah dan bertobat dari apa yang dibenci-Nya. Ketika istri-istri Nabi shallallahu 'alaihi wa sallam mendengar peringatan ini, maka segeralah mereka mencari keridhaan Rasulullah shallallahu 'alaihi wa sallam dan sifat mulia pun menjadi melekat pada diri mereka sehingga mereka menjadi wanita mukminah paling utama. Dalam ayat ini terdapat dalil bahwa Allah Subhaanahu wa Ta'aala tidaklah memilih untuk Rasul-Nya shallallahu 'alaihi wa sallam kecuali wanita yang keadaannya yang paling utama dan bahwa istri-istri Beliau adalah wanita paling baik dan paling utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 5",
    "description": "Allah lalu menyampaikan peringatan kepada para istri nabi. Jika dia, yakni nabi, menceraikan kamu, karena kamu bersikap keras dan menyakiti beliau, boleh jadi tuhannya, yaitu Allah akan memberi ganti kepadanya dengan istri-istri yang lebih baik dari kamu segala-galanya, karena Allah melindungi dan menyayangi beliau. Allah bisa mengganti dengan perempuan-perempuan yang patuh kepada Allah, yang beriman, yang taat kepada suami, yang bertobat setiap saat, yang beribadah dengan ikhlas, yang berpuasa dan berhasil mengendalikan ucapan dan perbuatan, yang janda dan yang perawan, keduanya mudah bagi nabi. 6. Wahai orang-orang yang beriman! peliharalah dirimu dan keluargamu dengan mentaati perintah Allah dan menjauhi larangan-Nya dari api neraka, yakni dari murka Allah yang menyebabkan kamu diseret ke dalam neraka yang bahan bakarnya adalah manusia dan batu; ada manusia yang dibakar dan ada manusia yang menjadi bahan bakar; penjaganya malaikat-malaikat yang kasar dan keras, yang tidak durhaka kepada Allah terhadap apa yang dia perintahkan kepada mereka sehingga tidak ada malaikat yang bisa disogok untuk mengurangi atau meringankan hukuman; dan mereka patuh dan disiplin selalu mengerjakan apa yang diperintahkan Allah kepada mereka."
  }
]