[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan Syariatnya, lindungilah diri kalian dengan melaksanakan apa yang Allah perintahkan kepada kalian dan meninggalkan apa yang Allah larang dari kalian, serta lindungilah keluarga kalian dengan apa yang dengannya kalian melindungi diri kalian dari api neraka yang bahan bakarnya adalah manusia dan batu. Yang menyiksa penghuninya adalah para malaikat yang kuat dan keras dalam perlakuan mereka. Mereka tidak menyelisihi perintah Allah, sebaliknya mereka senantiasa melaksanakan apa yang diperintahkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan kepada mereka, buatlah perisai untuk diri dan keluarga kalian dari api besar (Neraka) yang dinyalakan dengan manusia dan bebatuan. Di atas Neraka ada Malaikat yang kasar terhadap orang-orang yang memasukinya dan keras, mereka tidak mendurhakai perintah Allah jika diperintahkan dan melaksanakan apa yang diperintahkan-Nya tanpa malas dan enggan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai orang-orang beriman, jauhkanlah diri kalian, istri-istri kalian, dan anak-anak kalian dari api neraka dengan mentaati perintah Allah dan menjauhi kemaksiatan. Api neraka itu dinyalakan dengan jasad orang-orang kafir dan bebatuan yang membara. Yang mengazab para penghuninya adalah para malaikat yang bengis dan perkasa, dan tidak menyelisihi perintah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ قُوٓا۟ أَنفُسَكُمْ (Hai orang-orang yang beriman, peliharalah dirimu) Yakni jagalah diri kalian dengan menjalankan apa yang diperintahkan kepada kalian dan menjauhi apa yang dilarang bagi kalian. وَأَهْلِيكُمْ (dan keluargamu) Dengan memerintahkan mereka untuk taat kepada Allah dan melarang mereka berbuat maksiat. نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ(dari api neraka yang bahan bakarnya adalah manusia dan batu) Yakni dari api yang besar yang menyala dengan manusia dan batu, sebagaimana api lain yang menyala dengan kayu. Ibnu Jarir mengatakan: maka wajib bagi kita untuk mengajarkan kepada anak-anak kita agama dan perbuatan baik serta adab yang sangat mereka perlukan. عَلَيْهَا مَلٰٓئِكَةٌ غِلَاظٌ شِدَادٌ(penjaganya malaikat-malaikat yang kasar, keras) Yakni di atas api neraka itu berdapat para penjaga dari golongan malaikat yang bertugas mengatur neraka dan mengazab penghuninya, mereka sangat bengis terhadap penghuni neraka, sama sekali tidak merasa kasihan jika penghuni neraka meminta belas kasihan, sebab mereka diciptakan untuk mengazab penghuni neraka. لَّا يَعْصُونَ اللَّـهَ مَآ أَمَرَهُمْ(dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka) Yakni tidak menyelisihi perintah Allah. وَيَفْعَلُونَ مَا يُؤْمَرُونَ (dan selalu mengerjakan apa yang diperintahkan) Yakni melaksanakan perintah itu segera tanpa menundanya. Dan mereka mampu untuk menjalankan perintah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Wahai orang-orang yang beriman kepada Allah dan rasulNya, jauhkanlah diri kalian dan keluarga kalian dari neraka dengan meninggalkan kemaksiatan dan melaksanakan ketaatan. Neraka yang bahan bakarnya adalah manusia (kafir) dan batu-batu (berhala yang disembah). Neraka itu dijaga oleh malaikat-malaikat yang jumlahnya ada 19 malaikat yang memiliki sikap kasar, badannya sangat keras. Mereka tidak pernah melakukan kemaksiatan terhadap perintah Allah sebelumnya dan mengerjakan apa yang diperintahkan kepadanya di masa yang akan datang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jagalah diri kalian dan keluarga kalian dari api neraka yang bahan bakarnya adalah manusia dan batu. Penjaganya adalah malaikat-malaikat yang kasar dan keras} kasar lagi sangat keras {Mereka tidak mendurhakai apa yang diperintahkan Allah kepada mereka dan selalu mengerjakan apa yang diperintahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Maksudnya, hai orang yang diberi karunia berupa keimanan oleh Allah, tunaikanlah tuntutan dan syarat keimanan. Maka “peliharalah dirimu dan keluargamu dari api neraka,” yang memiliki ciri-ciri mengerikan. Menjaga diri dengan menunaikan perintah Allah dan menjauhi laranganNya serta bertaubat dari perbuatan yang membuat Allah murka dan mengundang azab serta menjaga keluarga dan anak-anak dengan cara mendidik, mengajarkan serta memaksa mereka untuk menunaikan perintah-perintah Allah. Seorang hamba tidak akan selamat hingga menunaikan perintah Allah terhadap dirinya sendiri dan orang-orang yang ada di bawah kekuasaannya seperti istri dan anak, serta yang lainnya yang berada di bawah kekuasaannya. Allah menyebutkan sifat-sifat neraka seperti itu agar hamba-hambaNya tidak menyepelekan perintah-perintahNya. Allah berfirman, “Yang bahan bakarnya adalah manusia dan batu.” Ini semakna dengan Firman Allah,” Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahannam, kamu pasti masuk ke dalamnya.” -Al-Anbiya: 98 “Penjaganya malaikat-malaikat yang kasar, yang keras,” maksudnya, watak mereka keras, gertakan mereka amat keras, suara mereka menakutkan apa pun yang mereka lihat, menyiksa penghuni neraka dengan kekuatan mereka dan mereka melakukan perintah Allah yang mengaharuskan menyiksa penduduk neraka dengan sekeras-kerasnya. “Yang tidak mendurhakai Allah terhadap apa yang diperintahkanNya kepada mereka dan selalu mengerjakan apa yang diperintahkan.” Dalam ayat ini juga terdapat pujian bagi para malaikat mulia, kepatuhan mereka terhadap perintah , dan ketaatan mereka dalam segala sesuatu yang diperintahkan pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 6: Wahai orang-orang yang membenarkan Allah dan Rasul-Nya serta beramal dengan syariat Allah; Ambillah perkara untuk menjaga diri-diri kalian dan keluarga-keluarga kalian dari kemarahan dan kebencian Allah dengan mengerjakan perintah-perintah dan menjauhi larangan-larangan-Nya. Ketahuilah bahwa balasan bagi yang membangkang dan melanggar perintah-perintah Allah adalah masuknya kalian ke dalam neraka. Dan neraka ini bahan bakarnya adalah kayu api dan manusia yang menyala-nyala, sebagaimana juga di dalam neraka ini ada malaikat yang kuat dan bengis hatinya yang akan mengadzab penghuni nereka, mereka para malaikat tidak bermaksiat kepada apa yang Allah perintahkan dari segala kondisinya; Bahkan mereka melaksanakan perintah Allah dengan tanpa nanti-nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni wahai orang-orang yang Allah karuniakan keimanan kepada mereka, kerjakanlah hal yang menjadi lazim (bagian) dari keimanan serta syarat-syaratnya. Yaitu dengan mendorong diri kita untuk menaati Allah Subhaanahu wa Ta'aala dan menjauhi larangan-Nya, bertobat dari sesuatu yang membuat Allah murka dan mendatangkan azab-Nya. Yaitu dengan menta’dib (mengajarkan adab) dan mengajari mereka agama serta mendorong mereka melaksanakan perintah Allah. Oleh karena itu, seorang hamba tidaklah akan selamat sampai ia dapat melaksanakan perintah Allah pada dirinya dan pada orang yang berada di bawah kekuasaannya seperti istri, anak dan sebagainya. Seperti orang-orang kafir. Seperti patung-patung yang mereka sembah. Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahannam, kamu pasti masuk ke dalamnya.” (Terj. Al Anbiyaa’: 98). Allah Subhaanahu wa Ta'aala menyifati neraka dengan sifat-sifat ini agar hamba tidak meremehkan perintah-Nya. Yakni kasar akhlaknya dan keras bentakannya sehingga mereka takut ketika mendengar suaranya dan melihat mereka. Jumlahnya ada sembilan belas malaikat sebagaimana diterangkan dalam surah Al Muddatstsir: 30."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 6",
    "description": "Wahai orang-orang yang beriman! peliharalah dirimu dan keluargamu dengan mentaati perintah Allah dan menjauhi larangan-Nya dari api neraka, yakni dari murka Allah yang menyebabkan kamu diseret ke dalam neraka yang bahan bakarnya adalah manusia dan batu; ada manusia yang dibakar dan ada manusia yang menjadi bahan bakar; penjaganya malaikat-malaikat yang kasar dan keras, yang tidak durhaka kepada Allah terhadap apa yang dia perintahkan kepada mereka sehingga tidak ada malaikat yang bisa disogok untuk mengurangi atau meringankan hukuman; dan mereka patuh dan disiplin selalu mengerjakan apa yang diperintahkan Allah kepada mereka. 7. Wahai orang-orang kafir! janganlah kamu mengemukakan alasan pada hari ini, karena rasul sudah datang, informasi sudah disampaikan dan ayat Al-Qur'an sudah dibacakan. Sesungguhnya kamu pada hari ini hanya diberi balasan menurut apa yang telah kamu kerjakan, sebanding dengan perbuatan kamu, karena Allah tidak akan pernah menzalimi hamba-Nya sedikit pun."
  }
]