[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7. Dikatakan kepada orang-orang yang mengingkari bahwa Allah adalah Tuhan Sembahan Yang Haq dan kafir kepadaNya saat mereka dimasukkan kedalam api neraka, “Tidak usah mencari-cari alasan hari ini, karena kalian hanya dibalas sesuai dengan apa yang kalian kerjakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan dikatakan kepada orang-orang kafir pada hari Kiamat, “Wahai orang-orang yang kafir kepada Allah, janganlah kalian mengemukakan alasan pada hari ini terhadap kekufuran dan kemaksiatan yang telah kalian lakukan, karena sekali-kali alasan kalian tidak akan diterima. Sesungguhnya pada hari ini kalian hanyalah diberi balasan karena kekufuran kalian kepada Allah dan pendustaan kalian terhadap Rasul-Rasul-Nya yang pernah kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Dikatakan kepada orang-orang kafir ketika di neraka: “Janganlah kalian memohon ampun atas dosa-dosa kalian, karena hari ini tidak berguna lagi permohonan ampun. Kalian disiksa karena dosa-dosa yang telah kalian lakukan di dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يٰٓأَيُّهَا الَّذِينَ كَفَرُوا۟ لَا تَعْتَذِرُوا۟ الْيَوْمَ ۖ (Hai orang-orang kafir, janganlah kamu mengemukakan uzur pada hari ini) Perkataan ini dikatakan kepada mereka saat mereka dimasukkan ke dalam neraka untuk menghentikan harapan dan ketamakan mereka. إِنَّمَا تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ(Sesungguhnya kamu hanya diberi balasan menurut apa yang kamu kerjakan) Berupa amalan-amalan di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dikatakan kepada orang-orang kafir saat dimasukkan ke dalam neraka: “Wahai orang-orang kafir, pada hari ini (hari kiamat) kalian tidak akan diampuni, karena hal itu tidak akan berguna bagi kalian. Kalian akan menerima balasan atas apa yang kalian perbuat di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang ingkar, janganlah mencari-cari alasan pada hari ini. Sesungguhnya kalian hanya diberi balasan atas apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Penghuni neraka pada Hari Kiamat dicela sedemikian rupa, dikatakan pada mereka, “Hai orang-orang kafir, janganlah kamu mengemukakan udzur pada hari ini,” karena waktu mengemukakan udzur sudah tidak ada dan sudah tidak lagi berguna. Yang tersisa sekarang hanyalah pembalasan atas amal perbuatan. Yang kalian persembahkan hanyalah kekufuran terhadap Allah, mendustakan tanda-tanda kebesaranNya, dan memerangi para rasul serta para kekasih Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 7: Pada hari ‘asir yaitu hari kiamat dikatakan kepada orang-orang kafir ketika mereka masuk ke dalam neraka : Wahai orang-orang yang mengingkari agama Allah dan mendustakan kerisalahan-Nya dan mereka yang menolak ayat-ayat Allah; Tidak ada udzur bagi kalian pada hari ini, dan sungguh telah tiba waktunya, dan telah usai waktu untuk beramal, maka tidak ada harapan dan udzur, karena kalian pada hari ini hanya dibalas dan diberikan balasan atas amalan-amalan kalian yang kalian amalkan di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syaikh As Sa’diy menerangkan, bahwa penghuni neraka akan dicela dengan celaan ini pada hari Kiamat. Menurut penyusun tafsir Al Jalaalain, kalimat ini diucapkan kepada mereka ketika mereka dimasukkan ke dalam neraka. Ketika itu yang ada adalah pembalasan terhadap amal, sedangkan amal yang kamu siapkan wahai orang-orang kafir untuk hari Kiamat ini adalah kekafiran kepada Allah, mendustakan ayat-ayat-Nya, memerangi para rasul-Nya dan para wali-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 7",
    "description": "Wahai orang-orang kafir! janganlah kamu mengemukakan alasan pada hari ini, karena rasul sudah datang, informasi sudah disampaikan dan ayat Al-Qur'an sudah dibacakan. Sesungguhnya kamu pada hari ini hanya diberi balasan menurut apa yang telah kamu kerjakan, sebanding dengan perbuatan kamu, karena Allah tidak akan pernah menzalimi hamba-Nya sedikit pun. 8. Wahai orang-orang yang beriman! bertobatlah kepada Allah dari dosa besar maupun dosa kecil dengan tobat yang semurni-Murninya yang melahirkan perubahan sikap dan perbuatan; mudah-Mudahan tuhan kamu akan menghapus kesalahan-kesalahanmu yang sudah ditinggalkan secata total dan memasukkan kamu dengan izin-Nya ke dalam surga yang mengalir di bawahnya sungai-sungai, sebagai tanda kenikmatan yang sempurna, pada hari ketika Allah tidak mengecewakan nabi dan orang-orang yang beriman bersama dengannya, ketika dibangkitkan menuju mahsyar; sedangkan cahaya mereka memancar di hadapan dan di sebelah kanan mereka, yang bersumber dari iman dan amal saleh mereka, sambil mereka berkata, memohon kepada Allah, 'ya tuhan kami, sempurnakanlah untuk kami cahaya kami dengan cahaya keridaan-Mu, dan ampunilah, semua kesalahan kami di dunia; sungguh, engkau mahakuasa atas segala sesuatu, termasuk mengampuni dan menyelamatkan kami dari api neraka. '"
  }
]