[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8. Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, kembalilah dari dosa-dosa kalian kepada ketaatan kepada Allah dengan kembali yang sesudahnya tidak ada lagi kemaksiatan, semoga Tuhan kalian menghapus keburukan-keburukan amal kalian, memasukkan kalian ke surga-surga yang mana sungai-sungai mengalir di bawah istana-istana dan kebun-kebunnya, di hari yang Allah tidak menghinakan Nabi dan orang-orang yang beriman bersamanya, tidak mengazab mereka, sebaliknya meninggikan kedudukan mereka, cahaya mereka berjalan di depan mereka dan di kanan mereka saat mereka berjalan di atas ash-shirath sesuai dengan amal-amal mereka. Mereka berkata, “Wahai Tuhan kami, sempurnakanlah cahaya kami agar kami selamat melewati jembatan ini dan sampai ke surga. Maafkanlah kami, ampunilah dosa-dosa kami dan tutupilah ia atas kami, sesungguhnya Engkau Mahakuasa atas segala sesuatu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Wahai orang-orang yang beriman kepada Allah dan menjalankan apa yang disyariatkan untuk mereka, bertobatlah kalian kepada Allah dari dosa-dosa kalian dengan tobat yang jujur, semoga Rabb kalian menghapuskan kesalahan-kesalahan kalian dan memasukkan kalian ke dalam Surga-surga yang di bawah istana-istananya dan pepohonannya mengalir sungai-sungai pada hari Kiamat, yaitu hari di mana Allah tidak menghinakan Nabi dan orang-orang yang beriman bersamanya dengan memasukkan mereka ke dalam Neraka. Cahaya mereka memandu di hadapan mereka dan di sebelah kanan mereka di atas Ṣiraṭ (titian di atas Neraka). Mereka berkata, “Wahai Rabb kami, sempurnakan bagi kami cahaya kami hingga kami masuk Surga, sehingga kami tidak seperti orang-orang munafik yang mana cahaya mereka padam di atas Ṣiraṭ. Dan ampunilah bagi kami dosa-dosa kami, sesungguhnya Engkau Mahakuasa atas segala sesuatu, tidak lemah dalam menyempurnakan cahaya kami dan menghapus dosa-dosa kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Hai orang-orang beriman, bertaubatlah kepada Allah dari dosa-dosa kalian dengan taubat yang sebenar-benarnya, yaitu dengan menyesali perbuatan dosa itu dan bertekat untuk tidak mengulanginya lagi; mudah-mudahan Allah menghapus dosa-dosa kalian dan memasukkan kalian ke dalam surga-surga yang di bawah pepohonannya terdapat sungai-sungai yang mengalir. Pada hari itu Allah tidak akan menghinakan Nabi-Nya dan orang-orang beriman yang bersamanya; cahaya keimanan dan amal shalih mereka bersinar di depan dan di sekitar mereka ketika mereka berjalan menuju ke surga seraya berdoa: “Ya Tuhan kami, sempurnakanlah cahaya kami agar kami dapat sampai di surga, dan ampunilah dosa-dosa kami. sungguh Engkau Maha Kuasa atas segalanya, tidak ada yang sulit bagi-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ تُوبُوٓا۟ إِلَى اللَّـهِ تَوْبَةً نَّصُوحًا (Hai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubat yang sesungguhnya) Taubat nasuha adalah taubat yang tulus ikhlas. Yaitu dengan penyesalan dalam hati atas dosa yang telah dilakukan, memohon ampun dengan lisan, menjauhi dosa itu dengan badan, dan bertekat untuk tidak mengulanginya lagi. نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمٰنِهِمْ (cahaya mereka memancar di hadapan dan di sebelah kanan mereka) Telah dijelaskan dalam surat al-Hadid bahwa cahaya ini akan menyertai mereka pada saat menyebrangi sirath."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Wahai orang-orang yang beriman kepada Allah dan rasulNya, bertaubatlah kepada Allah dengan taubat yang benar dan ikhlas, yaitu dengan melakukan penyesalan dalam hati atas dosa, meminta ampun melalui lisan, menghentikan (perbuatan dosa) melalui badan, bertekad untuk tidak mengulangi apa yang telah diperbuat di masa mendatang, dan memberikan hak-hak orang yang berhak menerimanya. Barangkali Tuhan kalian akan menghapus dosa-dosa kalian, memasukkan kalian di surga yang di dalamnya mengalir sungai-sungai di bawah rumah-rumah dan taman-tamannya pada hari dimana Allah mencegah Nabi untuk memberikan syafaatnya kepada orang yang hendak diberi syafaat, tidak pula bagi orang-orang mukmin dengan risalahnya. Cahaya keimanan menuntun mereka (untuk berjalan) di atas shirat setelah usai penghisaban, dan menerangi jalan mereka. Mereka berkata: “Wahai Tuhan kami, abadikanlah dan sempurnakanlah bagi kami cahaya kami sampai ke surge, tutupilah dan ampunilah dosa-dosa kami, sesungguhnya Engkau Maha Kuasa atas segala sesuatu”. Adapun terhadap orang-orang munafik, Allah meredupkan cahaya mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubat yang semurni-murninya} yang benar dan mutlak {Mudah-mudahan Tuhan kalian akan menghapus kesalahan-kesalahan kalian dan memasukkan kalian ke dalam surga yang mengalir di bawahnya sungai-sungai pada hari ketika Allah tidak menghinakan} menghinakan {Nabi dan orang-orang yang beriman bersamanya. Cahaya mereka memancar} memancar {di hadapan mereka} di depan mereka {dan di sebelah kanan mereka. Mereka berkata,“Ya Tuhan kami, sempurnakanlah untuk kami cahaya kami dan ampunilah kami. Sesungguhnya Engkau Maha kuasa atas segala sesuatu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Allah memerintahkan untuk bertaubat dengan sungguh-sungguh dalam ayat ini,menjanjikan penghapusan kesalahan-kesalahan, dimasukkan ke dalam surga dan mendapatkan keberuntungan dan kemenangan pada saat orangt-orang yang beriman berjalan dengan cahaya keimanan pada Hari Kiamat. Mereka menikmati rizki dan kenikmatan. Mereka berbelas kasih pada orang-orang munafik ketika cahaya mereka dipadamkan. Allah mengabulkan permintaan mereka dan Allah mengantarkan mereka berserta cahaya dan keyakinan yang ada pada diri mereka menuju surga penuh kenikmatan dan berada di dekat Rabb Yang Mahamulia. Ini semua adalah buah dari taubat secara umum, mencakup seluruh dosa yang dilakukan oleh hamba Allah yang hanya dilakukan semata-mata mengharap bertemu dengan Allah serta berada dekat denganNya. Taubat terus menerus dilakukan di seluruh hal-ihwalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 8: Allah memerintahkan hambanya yang beriman untuk bersegera bertaubat dengan taubat yang nasuha, Allah berkata : Wahai manusia yang membenarkan Allah dan Rasul-Nya ﷺ serta beramal dengan syariat-Nya, tobatlah kalian kepada Allah dari dosa-dosa kalian dengan taubat yang jujur dan ikhlas karena Allah, dan dengan itupala segera tinggalkan dosa dan berlepas dirilah darinya, dan berniat untuk tidak kembali melakukan dosa tersebut. Maka jika kalian melakukannya, maka engkau akan mendapatkan hakumu berupa pengampunan dari amalan-amalan buruk kalian yang telah lalu kalian kerjakan, dan kalian akan dimasukkan ke dalam keun-kebun yang mengalir di bawah pepohonan dan istanya sungai-sungai, pada hari yang Allah tidak hinakan Nabi-Nya dan yang beriman kepada-Nya, dan Allah akan mengangkat pada hari itu urusan mereka dan meninggikan dengan kuasa-Nya. Karena perendahan dan keburukan pada hari itu menimpa orang-orang yang kafir dan yang semisal dengan mereka. Kemudian Allah menjelaskan kondisi mereka yang beriman dan melewati jembatan yang diterangi cahaya di hadapan-hadapan mereka dan diterangi keimanan mereka, mereka berkata : Wahai Tuhan kami, berikan keberlangsungan cahaya untuk kami, hingga kami sampai ke Darussalam (surga), dan hapuskan dari kami apa yang telah kami lakukan dari dosa dan maksiat, sungguh Engkau yang maha kuasa atas segala sesuatunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan tobat nasuh (yang sesungguhnya) dalam ayat ini dan menjanjikan akan menghapuskan segala kesalahan, memasukkan ke dalam surga, memperoleh kemenangan dan keberuntungan ketika orang-orang mukmin berjalan pada hari Kiamat dengan cahayanya dan mereka takut kalau cahaya itu padam seperti yang menimpa orang-orang munafik. Oleh karena itu, mereka meminta kepada Allah Subhaanahu wa Ta'aala agar menyempurnakan cahaya mereka, lalu Allah mengabulkan doa mereka dan menyampaikan mereka dengan cahaya dan keyakinan mereka ke surga yang penuh kenikmatan. Ini semua merupakan pengaruh dari tobat yang nasuh. Tobat yang nasuh adalah tobat yang menyeluruh teradap semua dosa yang telah diazamkan oleh seorang hamba kepada Allah untuk tidak mengulanginya lagi, dimana maksudnya adalah mencari keridhaan-Nya, mendekatkan diri kepada-Nya dan tetap terus di atasnya dalam semua keadaannya. Agar sampai ke surga, sedangkan cahaya orang-orang munafik padam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 8",
    "description": "Wahai orang-orang yang beriman! bertobatlah kepada Allah dari dosa besar maupun dosa kecil dengan tobat yang semurni-Murninya yang melahirkan perubahan sikap dan perbuatan; mudah-Mudahan tuhan kamu akan menghapus kesalahan-kesalahanmu yang sudah ditinggalkan secata total dan memasukkan kamu dengan izin-Nya ke dalam surga yang mengalir di bawahnya sungai-sungai, sebagai tanda kenikmatan yang sempurna, pada hari ketika Allah tidak mengecewakan nabi dan orang-orang yang beriman bersama dengannya, ketika dibangkitkan menuju mahsyar; sedangkan cahaya mereka memancar di hadapan dan di sebelah kanan mereka, yang bersumber dari iman dan amal saleh mereka, sambil mereka berkata, memohon kepada Allah, 'ya tuhan kami, sempurnakanlah untuk kami cahaya kami dengan cahaya keridaan-Mu, dan ampunilah, semua kesalahan kami di dunia; sungguh, engkau mahakuasa atas segala sesuatu, termasuk mengampuni dan menyelamatkan kami dari api neraka. ' 9. Melalui ayat ini, Allah mengingatkan nabi untuk berperang ketika kaum muslim diperangi hanya karena keyakinan mereka tidak ada tuhan selain Allah. Wahai nabi! perangilah orang-orang kafir dan orang-orang munafik ketika mereka memerangi kamu setelah kamu hijrah ke madinah; dan bersikap keraslah terhadap mereka, jika mereka tidak menunjukkan niat baik untuk hidup berdampingan secara damai dengan orang yang berbeda agama, padahal tempat mereka di akhirat adalah neraka jahanam dan itulah seburuk-buruk tempat kembali bagi orang-orang kafir dan munafik."
  }
]