[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9. Wahai Nabi, berjihadlah melawan orang-orang yang menampakkan kekafiran dan memperlihatkannya, perangilah mereka dengan pedang, dan berjihadlah melawan orang-orang yang menyembunyikan kekafiran dan memendamnya dengan hujjah, penegakan hudud dan syiar-syiar agama. Gunakanlah untuk menghadapi kedua kubu, kekerasan dan ketegasan dalam berjihad melawan mereka. Tempat tinggal mereka di akhirat adalah Jahanam, dan itu adalah seburuk-buruk tempat kembali bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Wahai Rasul! Perangilah orang-orang kafir dengan pedang, dan perangilah orang-orang munafik dengan lisan dan menegakkan hukum, dan bersikaplah keras terhadap mereka sehingga mereka takut kepadamu. Tempat kembali yang akan mereka datangi pada hari Kiamat adalah Jahanam. Seburuk-buruk tempat kembali adalah tempat kembali mereka, yang kepadanya mereka akan kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Allah memerintahkan Rasulullah untuk berjihad melawan orang-orang kafir dan munafik, demi menolong agama-Nya dan melindungi kaum muslimin. Dan Allah memerintahkannya untuk bersikap tegas dan menegakkan hujjah atas mereka. Tempat kesudahan orang-orang kafir dan munafik itu adalah neraka Jahannam, dan itu adalah seburuk-buruk kesudahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يٰٓأَيُّهَا النَّبِىُّ جٰهِدِ الْكُفَّارَ (Hai Nabi, perangilah orang-orang kafir) Yakni berjihadlah melawan orang kafir dengan memeranginya. وَالْمُنٰفِقِينَ(dan orang-orang munafik) Dengan menegakkan hukum had bagi mereka, sebab mereka telah melakukan perbuatan yang harus diberikan hukum had. Dan bersikaplah keras terhadap orang kafir dan orang munafik agar menunjukkan wibawa kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Wahai Nabi, berjihadlah melawan orang-orang kafir dan orang-orang munafik dengan cara yang berbeda-beda, dengan pedang dan hujjah atau lisan. Berjuanglah melawan mereka dalam dakwan dan peperangan, karena sesungguhnya mereka adalah orang-orang yang merencanakan kerusakan. Tempat peristirahatan mereka adalah neraka Jahanam. Seburuk-buruk tempat kembali adalah tempat mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, berjihadlah (melawan) orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka} bersikap keraslah kepada mereka {Tempat mereka adalah neraka Jahanam dan itulah seburuk-buruk tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah memerintahkan NabiNya, untuk memerangi orang-orang kafir dan munafik serta bersikap kasar terhadap mereka pada saat memerangi mereka. Ini mencakup berjihad melawan orang-orang kafir dan munafik dengan menegakkan hujjah, menyeru mereka dengan tutur kata yang baik, meruntuhkan berbagai kebatilan yang ada pada mereka serta memerangi dengan senjata bagi yang tidak menerima seruan Allah dan tidak tunduk pada hukumNYa. Orang seperti ini harus diperangi dan diperlakukan secara kasar. Tingkatan pertama harus dengan menggunakan cara yang baik. Orang-orang kafir dan munafik ketika di dunia mendapatkan siksaan berupa kekuasaan RasulNya atas mereka serta kekuasaan golongan Allah atas mereka dan mereka juga diperangi. Di akhirat mereka mendapatkan siksa neraka, “dan itu adalah seburuk-buruk tempat kembali.” Ke tempat itulah semua orang sengsara dan rugi kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Tahrim ayat 9: Allah memerintahkan Nabi-Nya Muhammad ﷺ untuk memerangi orang-orang kafir yang menghalangi dakwah dengan pedang dan berjihad melawan orang-orang munafik yang mereka menyembunyikan kekafirannya, dengan hujjah dan ancaman yang nyata. Dan wajib bagimu (Muhammad) untuk keras kepada orang-orang kafir dan munafik, serta jangan bergaul dengan mereka dengan lemah lembut; Sebab mereka telah seperti ini dengan kaum mukminin. Sebagaimana yang dikatakan oleh pepatah : Tidaklah bisa menekuk (memelintir) besi, kecuali dengan besi pula; Ketahuilah bahwa tempat kembali mereka yaitu kafir dan munafik adalah jahannam; di situlah tempat tinggal mereka selamanya, dan seburuk-buruk tempat kembali adalah tempat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan Nabi-Nya Muhammad shallallahu 'alaihi wa sallam untuk berjihad terhadap orang-orang kafir dan munafik serta bersikap keras terhadap mereka. Jihad di sini mencakup melawan mereka dengan menegakkan hujjah terhadap mereka, mengajak mereka dengan nasihat yang baik, membatalkan kesesatan yang mereka pegang selama ini, dan melawan mereka dengan senjata bagi yang enggan memenuhi seruan Allah dan enggan tunduk kepada hukum-Nya. Orang yang enggan inilah yang dijihadi dan dikerasi, adapun yang pertama adalah didakwahi dengan cara yang baik. Dengan senjata. Dengan kata-kata dan hujjah. Dimana orang-orang yang sengsara dan rugi akan kembali ke sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Tahrim Ayat 9",
    "description": "Melalui ayat ini, Allah mengingatkan nabi untuk berperang ketika kaum muslim diperangi hanya karena keyakinan mereka tidak ada tuhan selain Allah. Wahai nabi! perangilah orang-orang kafir dan orang-orang munafik ketika mereka memerangi kamu setelah kamu hijrah ke madinah; dan bersikap keraslah terhadap mereka, jika mereka tidak menunjukkan niat baik untuk hidup berdampingan secara damai dengan orang yang berbeda agama, padahal tempat mereka di akhirat adalah neraka jahanam dan itulah seburuk-buruk tempat kembali bagi orang-orang kafir dan munafik. 10. Allah menerangkan bahwa istri seorang nabi tidak dijamin masuk surga, jika tidak beriman kepada Allah. Allah membuat perumpamaan bagi orang-orang kafir bahwa menjadi istri nabi itu tidak otomatis dijamin masuk surga apabila tidak beriman kepada Allah seperti istri nabi nuh dan istri nabi lut. Keduanya sebagai istri berada di bawah pengawasan suami masing-masing, dua orang hamba yang saleh, yaitu nabi nuh dan lut, di antara hamba-hamba kami; lalu kedua istri itu berkhianat kepada kedua suaminya, istri nabi nuh menuduh suaminya gila dan istri nabi lut memberitahukan kehadiran para tamu ganteng kepada orang banyak yang homoseks, tetapi kedua suaminya itu tidak dapat membantu mereka sedikit pun untuk menyelamatkannya dari siksaan Allah karena kekufuran mereka; dan dikatakan kepada kedua istri nabi itu di akhirat, 'masuklah kamu berdua ke dalam neraka bersama orang-orang yang masuk neraka karena kekufuran mereka kepada Allah. '."
  }
]