[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Ha Mim), pembicaraan tentang huruf-huruf terpisah (seperti ini) telah hadir di awal Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Abd bin Hamid, Abu Ya’la dan Al-Baghawi berkata: “Sesungguhnya nabi SAW membaca surah ini sampai firman Allah {Fa in A’radhu} [ayat 13] untuk Utbah bin Rabi’ah. Kaum Quraisy mengutusnya dengan keadaan meratap supaya bisa bernegosiasi dengan nabi untuk meninggalkan dakwahnya. Mereka mengirimkan harta benda, perempuan dan lain-lain. Lalu Utbah kembali dan berkata tentang Al-Qur’an: “Demi Allah, Al-Qur’an itu bukanlah syair ataupun ilmu perdukunan, namun dia (Muhammad) membacakan apa yang didengarnya” 1. Haa, Miim, berfungsi untuk memberi perhatian tentang pentingnya ayat setelahnya dan untuk menantang bangsa Arab agar mendatangkan sesuatu yang serupa dengan Al-Qur’an yang menggunakan bahasa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥa Mīm"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 1: (Haa Miim) hanya Allah saja yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lihat tafsirnya di ayat pertama surah Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 1",
    "description": "'' m'm. Hanya Allah saja yang maha tahu tentang apa maksudnya. 2. Al-qur'an ini diturunkan secara bertahap dari Allah, tuhan yang maha pengasih kepada semua makhluk ciptaan-Nya, lagi maha penya-yang hanya kepada orang-orang yang beriman."
  }
]