[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah meletakkan di permukaan bumi gunung-gunung yang kokoh, Allah memberkahinya sehingga ia selalu memberikan kebaikan kepada penghuninya, dan juga menetapkan rizki-rizki penduduknya berupa makanan dan sarana-sarana kehidupan yang mereka perlukan dalam empat hari sempurna. Dua hari untuk menciptakan bumi, dua hari untuk menetapkan gunung-gunung dan menetapkan makanan penduduknya, yang memadai bagi orang-orang yang bertanya tentang hal ini untuk mengetahuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Allah menjadikan di bumi gunung-gunung yang terpancang kokoh untuk meneguhkan bumi agar tidak bergoncang. Allah menentukan di bumi makanan manusia dan hewan-hewan dalam empat hari guna menyempurnakan dua hari sebelumnya, yaitu hari Selasa dan Rabu, sama saja bagi siapa yang hendak bertanya tentangnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَجَعَلَ فِيهَا رَوٰسِىَ (Dan dia menciptakan di bumi itu gunung-gunung yang kokoh) Yakni gunung-gunung yang kokoh. مِن فَوْقِهَا(di atasnya) Yakni yang berada di atas bumi, karena gunung-gunung adalah bagian dari bumi. وَبٰرَكَ فِيهَا(Dia memberkahinya) Allah menjadikan bumi penuh keberkahan dan kebaikan karena terdapat berbagai hal yang dibutuhkan oleh hamba-hamba-Nya. وَقَدَّرَ فِيهَآ أَقْوٰتَهَا(dan Dia menentukan padanya kadar makanan-makanan (penghuni)nya) Yakni rezeki-rezeki penghuninya yang mereka butuhkan untuk kehidupan mereka, seperti pepohonan dan berbagai hal yang dapat dimanfaatkan lainnya; dan Allah menjadikan di setiap tempat apa yang tidak ada di tempat lain agar para penghuninya dapat hidup dengan berdagang ke tempat lain. Allah menjadikan ini semua dalam empat hari, termasuk dua hari sebelumnya. سَوَآءً لِّلسَّآئِلِينَ((Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya) Seakan-akan dikatakan: penetapan empat hari ini adalah jawaban bagi orang-orang yang bertanya “berapa hari bumi dan seisinya diciptakan?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Tuhan inilah yang menciptakan gunung-gunung yang kokoh dan menjulang tinggi di bumi. Dia juga menciptakan banyak kebaikan di bumi. Dia memperhitungkan rejeki-rejeki penduduknya dalam empat hari dengan perhitungan sama tanpa ada perbedaan di antaranya, bagi orang yang meminta sejak penciptaan bumi. Dia menjadikan rejeki itu sama bagi para pencari rejeki di bumi dengan berusaha"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakan pada (bumi) itu gunung-gunung yang kokoh} gunung-gunung yang kokoh {di atasnya, lalu Dia memberkahi padanya} memperbanyak kebaikannya {dan menentukan} membagi} {padanya makanan-makanannya} makanan bagi hamba dan hewan {dalam empat masa} empat hari itu untuk menyempurnakan dua hari yang sebelumnya itu {dengan sempurna} dengan sempurna tidak ada pengurangan dan penambahan di dalamnya {untuk orang-orang yang memintanya} untuk orang yang meminta hal tersebut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah mengingkari dan heran terhadap kekafiran orang-orang yang kafir kepadaNYa, yaitu mereka yang menjadikan sekutu-sekutu bagiNya, mereka persekutukan denganNya, dan mereka menyembah pada sekutu-sekutu itu apa saja yang mereka suka dari pemujaan-pemujaan mereka, dan mereka menyetarakannya dengan Rabb yang Maha agung, maha raja, lagi maha pemurah, yang telah menciptakan langit yang tebal lagi amat sangat besar dalam du hari dengan menjadikan guinung-gunung diatasnya yang menjadi pasak baginya agar tidak goyah, tidak goncang dan agar diam. Diapun menyempurnakan penciptaannya dan membentangkannya serta mengeluarkan makan-makanannya serta segala hal yang berkaitan dengannya “dalam empat masa, sebagai jawaban bagi orang-orang yang bertanya,” tentang hal ini. Tidak ada yang mengabarkannya kepadamu sebagaimana Allah yang maha mengetahui. Inilah informasi yang benar,tidak ditambah dan tidak dikurangi sedikitpun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 10: (Dan Dia menjadikan) merupakan jumlah Istinaf, dan tidak boleh di'athafkan kepada Shilah Al-Ladzii karena ada pemisah yang bersifat Ajnabii yaitu ayat, Wataj'aluuna Lahuu Andaadan dan seterusnya (di bumi itu gunung-gunung) yang kokoh dan kuat (di atasnya dan Dia memberkahinya) dengan air yang banyak, dan tanam-tanaman serta pohon-pohon yang banyak pula (dan Dia menentukan) artinya, membagi-bagikan (padanya kadar makanan-makanannya) untuk manusia dan fauna (dalam) masa penjadian yang sempurna yaitu (empat hari) hal ini dijadikan-Nya pada hari Selasa dan Rabu (yang genap) dinashabkan karena menjadi Mashdar, maksudnya penciptaan itu selama empat hari genap; tidak bertambah dan tidak pula berkurang dari itu (bagi orang-orang yang bertanya) maksudnya, sebagai jawaban bagi orang-orang yang menanyakan tentang penciptaan bumi dan segala isinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti dengan banyak air, tanaman, dan lain-lain. Manusia dan hewan. Yaitu hari Selasa dan hari Rabu, ditambah dengan dua hari sebelumnya (hari Ahad dan Senin). Kalimat “Sawaa’allis saa’iliin” bisa juga diartikan, “sebagai jawaban bagi orang-orang yang bertanya tentang itu.” Oleh karena itu, tidak ada yang dapat memberitakan seperti pemberitaan Allah Yang Maha Mengetahui, berita tersebut adalah berita yang benar yang tidak ditambah dan tidak dikurang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 10",
    "description": "Dan setelah menciptakan bumi, dia ciptakan pula padanya gunung-gunung yang kokoh di atasnya yang menjadi pasak bagi bumi. Dan kemudian dia berkahi bumi itu sehingga layak menjadi tempat kehidup-an bagi makhluk tumbuhan, hewan, dan manusia, dan dia pula yang tentukan makanan-makanan bagi para penghuni-Nya. Semua itu tercipta dalam empat masa. Penjelasan ini sangat memadai untuk memenuhi kebutuhan orang-orang yang bertanya tentang penciptaan alam raya, serta mereka yang memerlukannya. 11. Dari menguraikan ihwal penciptaan bumi dan sarana kehidupan bagi makhluk yang mendiaminya, Al-Qur'an kemudian beralih kepada ihwal penciptaan langit. Kemudian dia, yakni perintah atau kekuasaan-Nya menuju ke langit dan langit ketika itu masih berupa asap, lalu dia berfirman kepadanya dan kepada bumi, 'datanglah kamu berdua menuruti perintah-ku dengan patuh atau terpaksa. ' mendengar perintah itu, keduanya, langit dan bumi, lalu menjawab, 'kami datang kepada-Mu ya Allah dengan tunduk dan patuh guna mengikuti aturan-Mu. '."
  }
]