[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah bersemayam, yaitu menuju langit yang sebelumnya adalah kabut, lalu Dia berfirman kepada langit dan bumi, “Tunduklah kalian berdua kepada perintahKu, dengan sukarela atau terpaksa.” Maka keduanya menjawab, “Kami menghadap kepadaMu dengan tunduk, kami tidak memiliki keinginan yang mnyelisihi keinginanMu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Kemudian Allah -Subḥānahu- menciptakan langit yang saat itu adalah asap, Allah berfirman kepadanya dan kepada bumi, “Tunduklah kalian berdua kepada perintah-Ku secara suka rela atau terpaksa, kalian berdua tidak mempunyai pilihan kecuali itu.” Maka keduanya menjawab, “Kami datang dengan suka rela, tidak ada keinginan bagi kami tanpa keinginan-Mu wahai Rabb kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَجَعَلَ فِيهَا رَوٰسِىَ (Dan dia menciptakan di bumi itu gunung-gunung yang kokoh) Yakni gunung-gunung yang kokoh. مِن فَوْقِهَا(di atasnya) Yakni yang berada di atas bumi, karena gunung-gunung adalah bagian dari bumi. وَبٰرَكَ فِيهَا(Dia memberkahinya) Allah menjadikan bumi penuh keberkahan dan kebaikan karena terdapat berbagai hal yang dibutuhkan oleh hamba-hamba-Nya. وَقَدَّرَ فِيهَآ أَقْوٰتَهَا(dan Dia menentukan padanya kadar makanan-makanan (penghuni)nya) Yakni rezeki-rezeki penghuninya yang mereka butuhkan untuk kehidupan mereka, seperti pepohonan dan berbagai hal yang dapat dimanfaatkan lainnya; dan Allah menjadikan di setiap tempat apa yang tidak ada di tempat lain agar para penghuninya dapat hidup dengan berdagang ke tempat lain. Allah menjadikan ini semua dalam empat hari, termasuk dua hari sebelumnya. سَوَآءً لِّلسَّآئِلِينَ((Penjelasan itu sebagai jawaban) bagi orang-orang yang bertanya) Seakan-akan dikatakan: penetapan empat hari ini adalah jawaban bagi orang-orang yang bertanya “berapa hari bumi dan seisinya diciptakan?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kemudian Dia berkehendak atau mulai menciptakan langit yaitu kumpulan gas (kabut) yang menyerupai asap (sesuatu yang membumbung tinggi dari kobaran api). Kemudian Dia berfirman kepada langit dan bumi usai menciptakan keduanya: “Kalian berdua akan dihuni oleh orang-orang yang taat dan yang dibenci” Lalu keduanya berkata: “Berilah kami orang-orang yang menyerahkan urusannya kepadaMu tanpa ditunda-tunda”. Itu adalah gambaran betapa berpengaruhnya kekuasaan Allah SWT dalam mempersiapkan keduanya agar dapat diambil manfaatnya dan betapa mereka bergegas melaksanakan perintah sang pencipta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia menuju ke langit} naik dan meninggi untuk menciptakan langit {dan itu masih berupa asap} kabut asap yang tinggi {Dia berfirman kepadanya dan kepada bumi,“Tunduklah kepadaKu} tunduklah kepada perintahKu {dengan patuh atau terpaksa”} terpilih dan terpaksa {Keduanya menjawab,“Kami tunduk dengan patuh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. ”kemudian” setelah Dia menciptakan bumi “dia menuju” mengarah “kepada” penciptaan “langit dan ia (ketika itu) masih merupakan asap,” yang menguap di atas permukaan air “lalu dia berkata kepadanya,”oleh karena takhsish (penghususan) ini mengisyaratkan pengecualian, maka Allah menyambungnya dengan firmanNYa,”dan kepada bumi, ’datanglah kamu berdua menurut perintahku dengan suka hati atau terpaksa,” maksudnya, tunduklah pada perintahku dengan suka hati atau terpaksa, karena ia harus terlaksana “keduanya menjawab,’kami datang dengan suka hati’,” artinya, kami tidak mempunyai keinginan yang menyelisihi keinginanMu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 11: (Kemudian Dia menuju) bermaksud kepada (penciptaan langit dan langit itu masih merupakan asap) masih berbentuk asap yang membumbung tinggi (lalu Dia berfirman kepadanya dan kepada bumi, \"Datanglah kamu keduanya) menurut perintah-Ku (dengan suka hati atau terpaksa\") kedua lafal ini berkedudukan sama dengan Hal, yakni baik dalam keadaan senang hati atau terpaksa (keduanya menjawab, \"Kami datang) beserta makhluk yang ada pada kami (dengan suka hati\") di dalam ungkapan ini diprioritaskan Dhamir Mudzakkar lagi Aqil; atau khithab kepada keduanya disamakan dengan jamak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menciptakan bumi. Yang membumbung di atas permukaan air."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 11",
    "description": "Dari menguraikan ihwal penciptaan bumi dan sarana kehidupan bagi makhluk yang mendiaminya, Al-Qur'an kemudian beralih kepada ihwal penciptaan langit. Kemudian dia, yakni perintah atau kekuasaan-Nya menuju ke langit dan langit ketika itu masih berupa asap, lalu dia berfirman kepadanya dan kepada bumi, 'datanglah kamu berdua menuruti perintah-ku dengan patuh atau terpaksa. ' mendengar perintah itu, keduanya, langit dan bumi, lalu menjawab, 'kami datang kepada-Mu ya Allah dengan tunduk dan patuh guna mengikuti aturan-Mu. '12. Ayat ini masih menjelaskan tentang penciptaan langit. Lalu diciptakan-Nya tujuh langit dalam waktu dua masa, dan pada setiap langit dia mewahyukan dan menetapkan urusan masing-masing. Kemudian langit yang dekat dengan bumi, kami hiasi dengan bintang-bintang yang bersinar cemerlang, dan kami ciptakan bintang-bintang itu untuk memelihara langit dengan pemeliharaan yang sempurna. Demikianlah ketentuan Allah berlaku, dan dia adalah zat yang mahaperkasa lagi maha mengetahui."
  }
]