[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menyelesaikan penciptaan langit-langit yang tujuh dan menyempurnakannya dalam dua hari, maka sempurnalah penciptaan langit dan bumi adalah enam hari, karena sebuah hikmah yang Allah ketahui, padahal Allah kuasa untuk menciptakan keduanya dalam sesaat. Dan Allah mewahyukan di setiap langit apa yang Dia inginkan dan perintahkan padanya. Dan Kami menghiasi langit dunia dengan bintang-bintang yang bersinar sebagai penjagaan baginya dari setan-setan yang mencuri-curi pendengaran. Penciptaan yang unik itu adalah penetapan dari Allah yang Mahaperkasa dan kerajaanNya, juga MahaMengetahui, di mana IlmuNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah menyempurnakan penciptaan langit dalam dua hari, yaitu hari Kamis dan Jumat. Dengan tambahan dua hari, sempurnalah penciptaan langit dan bumi dalam enam hari. Allah mewahyukan di setiap langit apa yang Dia takdirkan padanya, dan apa yang Dia perintahkan berupa ketaatan dan ibadah kepada-Nya. Allah menghiasi langit dunia dengan bintang-bintang. Dan Kami menjaganya dari setan-setan yang naik hendak mencuri pendengaran. Semua yang disebutkan itu adalah pengaturan dari Allah yang Maha Perkasa, yang tidak dikalahkan oleh siapapun, yang Maha mengetahui makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Kemudian Allah menyempurnakan penciptaan tujuh langit dalam waktu dua hari, dan mengatur di setiap lapisan langit para malaikat sesuai jumlah yang dibutuhkan, dan segala hal lainnya yang hanya Allah yang mengetahuinya. Dan Allah menghiasi langit dunia -lapisan pertama- dengan bintang-bintang yang bersinar, yang juga untuk menjaga langit dari kerusakan dan setan-setan yang hendak mencuri berita langit. Penciptaan yang menakjubkan dan pengaturan yang detail itu merupakan ketetapan Allah Yang Maha Perkasa dalam kerajaan-Nya dan Maha Mengetahui keadaan makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. فَقَضَىٰهُنَّ سَبْعَ سَمٰوَاتٍ (Maka Dia menjadikannya tujuh langit) Yakni Allah menciptakan, mengatur, dan menyelesaikan cipataan langit-langit tersebut. فِى يَوْمَيْنِ(dalam dua masa) Sehingga totalnya adalah enam hari. Imam Mujahid berkata: dan setiap hari dari enam hari tersebut seperti seribu tahun menurut perhitungan kalian. وَأَوْحَىٰ فِى كُلِّ سَمَآءٍ أَمْرَهَا ۚ( Dia mewahyukan pada tiap-tiap langit urusannya) Yakni Allah menjadikan aturan yang berlaku di langit. Qatadah mengatakan, yakni Allah menciptakan di langit matahari, bulan, bintang, orbit-orbit, para malaikat, lautan, batu es, dan salju. Kemudian Allah menghamparkan bumi setelah itu. sehingga bumi lebih dulu diciptakan namun ia yang terakhir dihamparkan. Wallahu a’lam. وَزَيَّنَّا السَّمَآءَ الدُّنْيَا بِمَصٰبِيحَ(Dan Kami hiasi langit yang dekat dengan bintang-bintang yang cemerlang) Yakni dengan bintang-bintang yang bersinar di langit seperti cahaya lampu-lampu. وَحِفْظًا ۚ( dan Kami memeliharanya) Yakni Kami menciptakan bintang-bintang itu sebagai hiasan dan penjagaan. Yakni penjagaan dari setan-setan yang hendak mencuri-curi berita langit. ذٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ (Demikianlah ketentuan Yang Maha Perkasa lagi Maha Mengetahui) Yakni aturan yang sangat luar biasa ini merupakan pengaturan dari Allah yang Maha Kuasa dan Mengetahui atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Kemudian Dia menyempurnakannya dengan menciptakan 7 langit dalam waktu 2 hari. Dapat dikatakan bahwa sempurnanya penciptaan langit dan bumi itu dalam 6 hari. Dia mewahyukan (menciptakan, yaitu sesuatu yang sudah tersusun) kepada setiap langit itu sesuatu yang sudah siap untuk diambil manfaatnya seperti matahari, bulan, bintang dan lain-lain. Dia menghiasi langit dunia dengan planet-planet seperti lampu-lampu (Kalam itu diubah dari hujatan menjadi percakapan untuk menarik perhatian pendengar terhadap kehebatan sesuatu yang disebutkan setelahnya), Dia juga menjaganya dari gangguan dan penurunan serta melindunginya dari setan yang mencuri kabar langit dengan melemparinya dengan meteor. Ciptaan itu memiliki nilai yang sempurna serta merupakan kekuasaanNya dalam kerajaanNya. (Dialah) Dzat yang Maha Mengetahui tentang sesuatu yang berguna bagi ciptaanNya. Penciptaan langit itu sebelum penciptaan bumi sebagaimana pilihan Abu Hayan. Susunan dalam firmanNya {Tsummastawaa ilas samaa’} [11] itu hanya dalam penyebutan saja bukan dalam kenyataannya. Ar-Razi, Asy-Syaukani dan lainnya itu menentukan pilihan bahwa bumi adalah ciptaan yang pertama dan yang terakhir dibentangkan atau dihamparkan. Itu adalah yang paling benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Dia menjadikannya} lalu Dia menyempurnakannya dan menyelesaikan penciptaannya {tujuh langit dalam dua masa dan pada setiap langit Dia mewahyukan urusan masing-masing} apa yang Dia kehendaki dan Dia perintahkan di dalamnya {Kemudian langit dunia Kami hiasi dengan bintang-bintang} binatng-bintang yang bersinar {sebagai penjagaan} Kami menjaganya dengan planet-planet untuk menjaganya dari setanpsetan yang mencuri-curi pendengaran {Demikianlah ketetapan Dzat Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “maka Dia menjadikannya tujuh langit dalam dua masa”. Dengan demikian, selesailah penciptaan langit dan bumi dalam enam hari, dimulai hari Ahad dan berakhir hari jumat, sekalipun sebenarnya kekuasaan Allah dan kehendaknya bisa menciptakan itu semua dalam sekejap saja. Namun, sekalipun Dia Mahakuasa, namun Dia Mahabijaksana lagi Mahalembut. Di antara kebijaksanaan dan kelembutanNya yaitu adalah, Dia menciptakan langit dan bumi dalam tempo yang telah ditetapkan. Ketahuilah bahwa zahir ayat ini bila dipadukan dengan firmanNya dalam surat An-Nazi’at, yaitu setelah Allah menyebutkan penciptaan langit berfirman, “Dan bumi sesudah itu Dia bentangkan,” (An-Nazi’at :30) Nampak ada kontradiksi pada keduanya! Padahal Kitabulloh ini tidak ada kontradiksi atau perselisihan padanya! Jawabannya adalah apa yang sudah dikatakan oleh banyak kaum salaf, bahwa sesungguhnya penciptaan bumi dan bentuknya itu lebih dahulu daripada penciptaan langit, seperti dijelaskan di sini. Pembentangan bumi maksudnya adalah “Dian pancarrkan darinya mata air, dan (ditumbuhkan) tumbuhan-tumbuhan, dan gunung-gunung Dia pancangkan dengan teguh” dan itu belakangan, lebih dahulu penciptaan langit, sebagaimana dijelaskan dalam surat an-Nazi’at. Maka dari itu, di sana Dia berfirman, “Dan bumi sesudah itu Dia bentangkan, Dia keluarkan darinya…” hingga akhir ayat. Dia tidak mengatakan : dan bumi sesudah itu Dia ciptakan. firmanNya, “Dan Dia mewahyukan pada tiap-tiap langit urusannya,” maksudnya, urusan dan wewenang yang layak dengannya, sesuai dengan tuntutan kebijaksanaan Tuhan Yang Mahabijaksana. “Dan Kami hiasi langit dunia dengan lampu-lampu yang cemerlang”, yaitu bintang-bintang yang dapat dijadikan penerangan dan pedoman arah, dan menjadi keindahan dan perhiasan bagi langit secara lahiriyah, dan sebagai keindahannya secara batin yang mana ia dijadikan sebagai alat untuk melempari setan-setan agar mereka tidak mencuri untuk mendengarkan wahyu di sana. “demikianlah,” yang disebutkan di atas, yaitu bumi dengan segala isinya dan langit dengan segala isinya, adalah “ketentuan Yang Maha perkasa”, yang dengan keperkasaanNya Dia mengalahkan segala sesuatu, Dia mengaturnya dan dengannya pula Dia menciptakan semua makhluk “lagi Maha Mengetahui” yang pengetahuanNya meliputi seluruh makhluk, yang ghaib dan yang Nyata. Maka pengabaian kaum musyrikin terhadap sikap ikhlas kepada Rabb yang Mahaagung, Maha Esa lagi Maha Mengalahkan, yang semua makhluk tunduk kepada perintahNya, dan ketentuanNya berlaku padanya, adalah merupakan hal yang paling mengherankan. Dan pengangkatan sekutu-sekutu bagiNya yang mererka sejajarkan denganNya, padahal sekutu-sekutu itu lemah pada sifat-sifat dan perbuatan-perbuatanNya, adalah lebih mengherankan dan lebih mengherankan lagi! Tidak ada terapi bagi mereka jika sikap berpaling mereka harus terus berlanjut selain hukuman-hukuman duniawi dan ukhrawi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 12: (Maka Dia menjadikannya) dhamir yang ada pada lafal ayat ini kembali kepada lafal As-Samaa atau langit, karena memandang dari segi maknanya (tujuh langit dalam dua hari) yakni hari Kamis dan hari Jumat, Dia telah selesai dari menciptakan langit pada saat-saat terakhir dari hari tersebut. Dan pada hari itu juga diciptakan Nabi Adam, oleh karena itu maka di sini tidak dikatakan Fasawwaahunna tetapi Faqadhaahunna. Dan sesuai dengan makna ayat ini yaitu ayat-ayat tentang penciptaan langit dan bumi dalam enam hari (dan Dia mewahyukan pada tiap-tiap langit urusannya) yang telah Dia perintahkan kepada penduduk yang ada di dalamnya, yaitu taat dan beribadah kepada-Nya. (Dan Kami hiasi langit yang dekat dengan pelita-pelita) yakni bintang-bintang yang cemerlang (dan Kami memeliharanya) dinashabkan oleh Fi'ilnya yang keberadaannya diperkirakan, Kami menjaganya dengan meteor-meteor dari setan yang mau mencuri-curi pembicaraan para malaikat. (Demikianlah ketentuan Yang Maha Perkasa) di dalam kerajaan-Nya (lagi Maha Mengetahui) makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kamis dan Jum’at. Dengan demikian Allah Subhaanahu wa Ta'aala menciptakan langit dan bumi dalam enam hari (dimulai dari hari Ahad dan berakhir sampai hari Jum’at), sebagaimana firman-Nya, “Sesungguhnya Tuhan kamu ialah Allah yang telah menciptakan langit dan bumi dalam enam hari.” (Terj. Al A’raaf: 54) Meskipun begitu, Allah Subhaanahu wa Ta'aala mampu menciptakan semua itu hanya sekejap, akan Dia Mahabijaksana lagi Mahalembut. Oleh karena kebijaksanaan dankelembutan-Nya, maka Dia menciptakannya dalwam waktu tersebut. Faedah/catatan: Dalam surah An Naazi’at: 30 diterangkan, bahwa Allah Subhaanahu wa Ta'aala setelah menyebutkan penciptaan langit, Dia berfirman, “Dan bumi setelah itu dihamparkan-Nya.” Zhahir ayat di atas dengan surah An Naazi’at ayat 30 tersebut tampak bertentangan, padahal kitab Allah tidak ada pertentangannya. Jawaban terhadap kemusykilan ini adalah seperti yang diterangkan oleh Ibnu Abbas radhiyallahu 'anhuma berikut. Imam Bukhari menyebutkan dari Sa’id bin Jubair ia berkata: Seorang laki-laki berkata kepada Ibnu Abbas radhiyallahu 'anhuma, “Sesungguhnya aku menemukan dalam Al Qur’an beberapa hal yang bertentangan menurutku, yaitu ayat, “Apabila sangkakala ditiup maka tidak ada lagi pertalian nasab di antara mereka pada hari itu, dan tidak pula mereka saling bertanya.” (Al Mu’minun: 101), dengan ayat, “Dan sebagian mereka menghadap kepada sebagian yang lain saling bertanya-tanya.” (Ath Thur: 25). Firman Allah Ta’ala, “Dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadian pun.” (An Nisaa’: 42) dengan ayat, “Demi Allah, Tuhan kami, tidaklah kami mempersekutukan Allah.” (Al An’aam: 23), dalam ayat ini mereka menyembunyikan (kebohongan)nya. Demikian pula firman Allah Ta’ala, “Apakah kamu lebih sulit penciptaanya ataukah langit? Allah telah membinanya,…dst. Sampai ayat, ”Dan bumi setelah itu dihamparkan-Nya--31. Ia memancarkan daripadanya mata airnya, dan (menumbuhkan) tumbuh-tumbuhannya.” (An Naazi’aat: 27-31), Allah menyebutkan penciptaan langit sebelum penciptaan bumi, sedangkan (di ayat lain) Allah Subhaanahu wa Ta'aala berfirman, “Katakanlah, \"Pantaskah kamu ingkar kepada Tuhan yang menciptakan bumi dalam dua hari…dst. Sampai firman Allah Ta’ala, “dengan patuh.” (Fushshilat: 9-11) di ayat ini Allah menyebutkan penciptaan bumi sebelum penciptaan langit. Demikian pula pada firman Allah Ta’ala, “Allah Maha Pengampun lagi Maha Penyayang,” “Allah Mahaperkasa lagi Mahabijaksana,” dan firman-Nya, ”Allah Maha Mendengar lagi Maha Melihat.” Seakan-akan ia (sifat itu) ada lalu hilang.” Ibnu Abbas menjawab, “(Firman Allah), “Apabila sangkakala ditiup maka tidak ada lagi pertalian nasab di antara mereka pada hari itu, dan tidak pula mereka saling bertanya.” Adalah pada saat tiupan sangkakala pertama sebagaimana firman Allah Ta’ala, “Dan ditiuplah sangkakala, maka matilah siapa yang di langit dan di bumi kecuali siapa yang dikehendaki Allah.” (Az Zumar: 68) sedangkan pada tiupan yang lain (yang kedua), (Allah berfirman), “Dan sebagian mereka menghadap kepada sebagian yang lain saling bertanya-tanya.” Firman Allah, “Demi Allah, Tuhan kami, tidaklah kami mempersekutukan Allah.” dan, ”Dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadian pun.” Maka sesungguhnya Allah mengampuni dosa-dosa orang-orang yang ikhlas, lalu orang-orang musyrik berkata, “Mari (bersama kami) mengatakan, “Kita tidak berbuat syirk.” Lalu ditutuplah mulut mereka, maka tangan merekalah yang bicara. Ketika itu orang itu mengetahui bahwa ia tidak dapat menyembunyikan (dari Allah) sesuatu kejadian pun.” Saat itu, “Orang-orang kafir …dst.(lihat An Nisaa’: 42) (Masalah selanjutnya), Allah menciptakan bumi dalam dua hari, kemudian menciptakan langit; Dia menuju ke langit dan menjadikannya (tujuh langit) dalam dua hari yang lain. Kemudian Dia membentangkan bumi, dan membentangkan itu maksudnya dengan mengeluarkan mata airnya, menumbuhkan tumbuhan-tumbuhannya, menciptakan gunung-gunung, pasir, benda mati, dan bukit-bukit dan antara keduanya, hal itu dalam dua hari yang lain. Itulah firman Alah Ta’ala, “Dahaahaa” (dihamparkan-Nya). Firman Allah, “yang menciptakan bumi dalam dua hari,” Dia menciptakan bumi dan sesuatu yang ada di sana dalam empat hari, serta menciptakan langit dalam dua hari. (Firman Allah), “Allah Maha Pengampun lagi Maha Penyayang.” Dia menamai Diri-Nya dengannya, dan itulah firman-Nya, yakni Dia senantiasa seperti itu, karena Allah Ta’ala tidaklah menginginkan sesuatu kecuali Dia kenakan yang Dia inginkan itu, maka jangan ada lagi pertentangan dalam Al Qur’an pada dirimu, karena semuanya berasal dari Allah ‘Azza wa Jalla.” Syaikh As Sa’diy juga menyebutkan hal yang sama, ia menyebutkan pendapat mayoritas kaum salaf, bahwa penciptaan bumi dan pembentukannya lebih dulu daripada penciptaan langit sebagaimana dalam ayat di atas (9 s.d 11 surah Fushshilat), adapun pembentangan bumi, yaitu dengan mengeluarkan mata airnya, menumbuhkan tumbuh-tumbuhannya, menancapkan bumi dan seterusnya, maka ia setelah menciptakan langit sebagaimana di surah An Naazi’at. Oleh karena itu di surah An Naazi’at Allah Subhaanahu wa Ta'aala berfirman, “Wal ardha ba’da dzaalika dahaahaa—akhraja minhaa maa’ahaa wa mar’aahaa.” tidak berfirman, “Wal ardha ba’da dzaalika khalaqahaa” (dan bumi setelah itu diciptakan-Nya). Maksudnya menurut Jalaaluddin Al Mahalliy adalah, bahwa Dia memerintahkan penghuni masing-masingnya agar taat dan beribadah kepada-Nya. Menurut Syaikh As Sa’diy, bahwa Allah mewahyukan perintah dan aturan yang layak baginya yang sesuai dengan kebijaksanaan Allah Tuhan yang Mahabijaksana, wallahu a’lam. Yaitu bintang-bintang yang bersinar serta dapat dipakai petunjuk, sebagai penghias langit luar dan dalam, luarnya tampak indah dengan kilauan bintang-bintang, dan dalamnya sebagai pelempar bagi setan yang hendak mencuri berita di langit. Yakni bumi dan apa saja yang ada di dalamnya serta langit dan apa saja yang ada di dalamnya. Dengan keperkasaan-Nya, Dia tundukkan segala sesuatu, Dia atur dan Dia ciptakan semua makhluk. Ilmu-Nya meliputi semua makhluk, yang tersembunyi maupun yang tampak. Dengan demikian, sikap orang-orang musyrik yang meninggalkan berbuat ikhlas Kepada Tuhan Yang Maha Agung ini adalah sikap yang paling aneh, terlebih mereka mengadakan tandingan untuk-Nya dengan sesuatu yang memiliki kekurangan dari berbagai sisi. Oleh karena itu, tidak ada obat untuk mereka itu jika tetap berpaling selain hukuman di dunia dan akhirat. Oleh karena itulah pada ayat selanjutnya Allah Subhaanahu wa Ta'aala mengancam mereka dengan firman-Nya, “Fa in a’radhuu…dst.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 12",
    "description": "Ayat ini masih menjelaskan tentang penciptaan langit. Lalu diciptakan-Nya tujuh langit dalam waktu dua masa, dan pada setiap langit dia mewahyukan dan menetapkan urusan masing-masing. Kemudian langit yang dekat dengan bumi, kami hiasi dengan bintang-bintang yang bersinar cemerlang, dan kami ciptakan bintang-bintang itu untuk memelihara langit dengan pemeliharaan yang sempurna. Demikianlah ketentuan Allah berlaku, dan dia adalah zat yang mahaperkasa lagi maha mengetahui. 13. Ihwal penciptaan langit dan bumi sebagai bukti kemahakuasaan Allah, yang dijelaskan oleh ayat-ayat terdahulu, ternyata tidaklah membuat orang-orang musyrik mekah berubah sikap dan keyakinan. Oleh sebab itu, ayat-ayat berikut memerintahkan nabi Muhammad menyampaikan peringatan berupa pengalaman kaum 'ad dan Samud yang telah menolak kebenaran. Jika mereka, orang-orang musyrik mekah, masih saja berpaling dari kebenaran yang disampaikan itu, maka katakanlah kepada mereka, 'aku telah memperingatkan kamu akan bencana petir seperti petir yang menimpa kaum 'ad dan kaum Samud. '."
  }
]