[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila orang-orang yang mendustakan itu berpaling, setelah dijelaskan kepada mereka sifat-sifat al-Qur’an yang terpuji dan sifat-sifat Allah yang agung, maka katakanlah kepada mereka, “Aku sudah memperingatkan kalian dari azab yang membinasakan kalian seperti azab yang menimpa kaum Ad dan Tsamud saat mereka kafir kepada Tuhan mereka dan mendurhakai utusan-utusan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Jika orang-orang itu berpaling dari iman kepada apa yang kamu bawa, maka katakanlah kepada mereka -wahai Rasul-, “Aku memperingatkan kalian dari azab yang akan menimpa kalian sebagaimana azab yang telah menimpa 'Ād kaum Hūd dan Ṡamūd kaum Ṣāleḥ manakala mereka mendustakan kedua Nabi tersebut.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-16. Jika mereka tetap berpaling dari keimanan setelah penjelasan tentang ayat-ayat kauniyah yang menunjukkan keesaan Allah ini, maka katakanlah kepada mereka wahai Rasulullah: Aku telah memberi peringatan kepada kalian dari azab yang berat berupa petir, seperti petir yang menimpa kaum ‘Ad dan Tsamud, ketika para rasul silih berganti datang kepada mereka untuk memerintahkan mereka agar mengesakan Allah. Namun mereka menanggapi para rasul mereka dengan berkata: “Seandainya Tuhan kami menghendaki kita untuk mengesakan-Nya niscaya Dia akan menurunkan para malaikat kepada kami. Kami sungguh mendustakan pengesaan Allah yang kalian serukan itu.” Adapun kaum ‘Ad, mereka angkuh terhadap Nabi Hud dan orang-orang beriman yang bersamanya; mereka telah terlena dengan kekuatan yang mereka miliki dengan berkata: “Tidak ada kaum yang lebih kuat dari kami.” Tidakkah mereka mengetahui bahwa Allah, Pencipta mereka lebih kuat dan lebih berkuasa dari mereka? Mereka telah mendustakan ayat-ayat dan mukjizat Kami, sehingga Kami mengazab mereka. Kami mengirim kepada mereka angin yang sangat dingin selama empat hari, agar Kami menjadikan mereka merasakan azab yang menghinakan di kehidupan dunia. Dan azab akhirat berupa neraka lebih berat, dan mereka tidak akan mendapat penolong yang dapat menyelamatkan mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَإِنْ أَعْرَضُوا۟ (Jika mereka berpaling) Yakni berpaling dari berfikir dan menghayati makhluk-makhluk ini, atau berpaling dari mentaati dan mengimani ayat-ayat al-Qur’an. فَقُلْ(maka katakanlah) Katakanlah kepada mereka hai Muhammad. أَنذَرْتُكُمْ (Aku telah memperingatkan kamu) Yakni aku menakut-nakuti kalian. صٰعِقَةً مِّثْلَ صٰعِقَةِ عَادٍ وَثَمُودَ (dengan petir, seperti petir yang menimpa kaum ‘Aad dan Tsamud”) Yang dimaksud dengan (الصاعقة) yakni petir yang menyambar yang dapat mematikan seketika."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Jika mereka (orang-orang kafir Mekah) menolak untuk mengimani ayat-ayat yang diturunkan ini, maka katakanlah kepada mereka wahai nabi: “Aku memperingatkan kalian dengan petir seperti petir yang menyambar kaum ‘Aad dan Tsamud. Petir itu adalah sesuatu langsung membunuh, bersuara dahsyat dan sangat mengganggu serta terbuat dari api yang membakar, angin (kencang) yang menghancurkan atau hal lainnya” Maksudnya bahwa aku memperingatkan kalian tentang azab yang menghancurkan kaum-kaum itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka berpaling, katakanlah,“Aku telah memperingatkan kalian} Aku telah memperingatkan kalian {dengan petir} azab mengerikan yang menyambar kalian {seperti petir yang menimpa kaum ‘Ad dan Tsamud”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. maknanya, jika orang yang mendustakan itu berpaling setelah beberapa ciri al-Quran yang sangat tepuji dan sebagian sifat-sifat ilah yang Mahaagung dijelaskan kepada mereka, “maka katakanlah, ‘Aku telah memperingatkan kamu dengan petir.” Maksudnya, azab yang membinasakan dan menghabisi kalian semua “seperti petir yang menimpa kaum’Ad dan kaum Tsamud,” dua kaum yang sangat terkenal, di mana mereka dibinasakan oleh azab dan mererka ditimpa seburuk-buruk hukuman. Semua itu terjadi karena kezhaliman dan kekafiran mereka, di mana “ketika rosul-rosul datang kepada mereka dari depan dan dari belakang mereka”. Artinya, silih berganti kedatangan mereka secara beruntun, sedangkan dakwah mereka semua sama, yaitu “janganlah kamu menyembah selain Allah”, artinya mareka memerintahkan untuk ikhlas kepada Allah dan melarang mereka dari perbuatan mempersekutukanNya, namun mereka menolak kerosulan para Rrosul itu dan mereka mendustakannya. “dan mereka menjawab, ‘kalau Rabb kami menghendaki, tentu Dia akan menurunkan malaikat-malaikatNya’.” Artinya, sedangkan kalian para rosul hanyalah manusia biasa seperti kami, “maka sesungguhnya kami kafir kepada wahyu yang kamu diutus membawakannya.” Ini adalah suatu alasan rapuh yang terus diwariskan secara turrum-temurun di kalangan orang-oang yang mendustkan. Ia merupakan syubhat yang sangat rapuh, sebab tidak termasuk syarat dalam pengutusan rosul itu harus seorang malaikat. Yang sebenarnya menjadi persyaratan kerosulan adalah sang rosul mendatangkan bukti-bukti yang membuktikan kebenarannya. Setelah itu silahkan mereka mencari kecacatan kebenaran rosul itu jika mereka mampu dengan cara yang rasional maupun syar’i! tentu mereka sama sekali tidak akan pernah menemukan jalan ke sana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 13: (Jika mereka berpaling) yaitu orang-orang kafir Mekah dari iman sesudah adanya penjelasan ini (maka katakanlah, \"Aku memperingatkan kalian) aku mempertakuti kalian (dengan petir, seperti petir yang menimpa kaum Ad dan kaum Tsamud) yakni dengan azab yang akan membinasakan kalian sama dengan azab yang membinasakan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah diterangkan kepada mereka sifat-sifat Al Qur’an yang terpuji dan sifat-sifat Allah Yang Agung. Yang menghabiskan kamu. Karena kezaliman dan kekafiran mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 13",
    "description": "Ihwal penciptaan langit dan bumi sebagai bukti kemahakuasaan Allah, yang dijelaskan oleh ayat-ayat terdahulu, ternyata tidaklah membuat orang-orang musyrik mekah berubah sikap dan keyakinan. Oleh sebab itu, ayat-ayat berikut memerintahkan nabi Muhammad menyampaikan peringatan berupa pengalaman kaum 'ad dan Samud yang telah menolak kebenaran. Jika mereka, orang-orang musyrik mekah, masih saja berpaling dari kebenaran yang disampaikan itu, maka katakanlah kepada mereka, 'aku telah memperingatkan kamu akan bencana petir seperti petir yang menimpa kaum 'ad dan kaum Samud. '14. Demikianlah, sebagaimana juga dikisahkan oleh Al-Qur'an, ketika para rasul datang kepada masing-masing mereka, kaum 'ad dan Samud, baik dari arah depan dan juga dari arah belakang mereka. Hal ini bermakna bahwa para rasul itu menyampaikan seruan kebenaran dengan berbagai cara, baik terang-terangan maupun dengan sembunyi-sembunyi. Para rasul itu menyerukan, 'janganlah kamu menyembah selain Allah. ' mendengar seruan itu mereka, kaum 'ad dan Samud menjawab, 'kalau tuhan kami menghendaki untuk mengutus rasul, tentu dia mengutus dan menurunkan malaikat-malaikat-Nya kepada kami, bukan manusia biasa seperti kamu. Maka sesungguhnya dengan kenyataan seperti itu, kami mengingkari wahyu yang engkau sengaja diutus untuk menyampaikannya kepada kami. '."
  }
]