[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saat para Rasul datang kepada kaum Ad dan Tsamud, sebagian datang sesudah yang lain secara berkesinambungan, memerintahkan mereka agar menyembah Allah semata, yang tidak ada sekutu bagiNya, maka mereka berkata kepada rasul-rasul mereka, “Sekiranya tuhan kami berkehendak agar kami mentauhidkanNya dan tidak menyembah selainNya, niscaya Dia menurunkan malaikat dari langit sebagai utusan-utusan kepada kami, yang menyampaikan apa yang kalian sampaikan kepada kami, Dia tidak mengutus kalian karena kalian adalah manusia yang sama dengan kami. Sesungguhnhya kami mengingkari apa yang Allah mengutus kalian dengannya kepada kami untuk beriman dan mengesakanNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Ketika para rasul datang kepada mereka silih berganti dengan membawa satu dakwah yang mereka serukan, yaitu agar mereka tidak menyembah kecuali Allah semata, maka orang-orang kafir dari mereka menjawab, “Seandainya Rabb kami berkehendak untuk menurunkan malaikat-malaikat kepada kami sebagai rasul-rasul niscaya Dia melakukannya, sesungguhnya kami ini tetap kafir kepada apa yang kalian diutus dengannya, karena kalian adalah manusia yang sama dengan kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِذْ جَآءَتْهُمُ الرُّسُلُ مِنۢ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ(Ketika para rasul datang kepada mereka dari depan dan belakang mereka) Yakni telah datang kepada mereka rasul-rasul terdahulu dan belakangan, adapun rasul-rasul yang datang belakangan telah mereka lihat sendiri, sedangkan rasul-rasul terdahulu telah sampai kepada mereka ucapan-ucapannya, seakan-akan para rasul itu telah mendatangi mereka dan berbicara dengan mereka dengan mengatakan: أَلَّا تَعْبُدُوٓا۟ إِلَّا اللهَ (Janganlah kamu menyembah selain Allah”) قَالُوا۟ لَوْ شَآءَ رَبُّنَا لَأَنزَلَ مَلٰٓئِكَةً (Mereka menjawab: “Kalau Tuhan kami menghendaki tentu Dia akan menurunkan malaikat-malaikat-Nya) Yakni niscaya Tuhan akan mengirim para malaikat kepada kami dan tidak akan mengirim manusia seperti kami. فَإِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كٰفِرُونَ (maka sesungguhnya kami kafir kepada wahyu yang kamu diutus membawanya”) Yakni kami mengingkari ucapan kalian bahwa kalian diutus Allah kepada kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Saat datang kepada mereka para rasul sebelum atau sesudah mereka yang terdahulu dan terakhir yang saling membantu untuk meyakinkan mereka dengan berbagai cara agar tidak menyembah kecuali hanya kepada Allah, Tuhan yang Maha Esa, mereka akan berkata: “Jika berkehendak, sungguh Allah mengutus para malaikat kepada kami, bukan mengutus manusia yang sama dengan kami. Sesungguhnya kami mengingkari apa yang kalian yakini bahwa kalian diutus kepada kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika datang kepada mereka para rasul dari depan dan dari belakang mereka} pada masa sebelum mereka, setelah adanya mereka serta pada masa sempurnanya umur mereka {“Janganlah ka menyembah selain Allah,” mereka menjawab,“Kalau Tuhan kami menghendaki, sungguh Dia menurunkan malaikat-malaikat. Sesungguhnya kami ingkar pada kerasulanmu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. maknanya, jika orang yang mendustakan itu berpaling setelah beberapa ciri al-Quran yang sangat tepuji dan sebagian sifat-sifat ilah yang Mahaagung dijelaskan kepada mereka, “maka katakanlah, ‘Aku telah memperingatkan kamu dengan petir.” Maksudnya, azab yang membinasakan dan menghabisi kalian semua “seperti petir yang menimpa kaum’Ad dan kaum Tsamud,” dua kaum yang sangat terkenal, di mana mereka dibinasakan oleh azab dan mererka ditimpa seburuk-buruk hukuman. Semua itu terjadi karena kezhaliman dan kekafiran mereka, di mana “ketika rosul-rosul datang kepada mereka dari depan dan dari belakang mereka”. Artinya, silih berganti kedatangan mereka secara beruntun, sedangkan dakwah mereka semua sama, yaitu “janganlah kamu menyembah selain Allah”, artinya mareka memerintahkan untuk ikhlas kepada Allah dan melarang mereka dari perbuatan mempersekutukanNya, namun mereka menolak kerosulan para Rrosul itu dan mereka mendustakannya. “dan mereka menjawab, ‘kalau Rabb kami menghendaki, tentu Dia akan menurunkan malaikat-malaikatNya’.” Artinya, sedangkan kalian para rosul hanyalah manusia biasa seperti kami, “maka sesungguhnya kami kafir kepada wahyu yang kamu diutus membawakannya.” Ini adalah suatu alasan rapuh yang terus diwariskan secara turrum-temurun di kalangan orang-oang yang mendustkan. Ia merupakan syubhat yang sangat rapuh, sebab tidak termasuk syarat dalam pengutusan rosul itu harus seorang malaikat. Yang sebenarnya menjadi persyaratan kerosulan adalah sang rosul mendatangkan bukti-bukti yang membuktikan kebenarannya. Setelah itu silahkan mereka mencari kecacatan kebenaran rosul itu jika mereka mampu dengan cara yang rasional maupun syar’i! tentu mereka sama sekali tidak akan pernah menemukan jalan ke sana."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 14: (Ketika rasul-rasul datang kepada mereka dari depan dan dari belakang mereka) rasul-rasul itu datang kepada mereka dari arah depan dan dari arah belakang, akan tetapi mereka tetap ingkar dan kafir, sebagaimana yang akan dijelaskan nanti. Dan pengertian pembinasaan ini hanya berlaku pada zamannya saja (\"Janganlah kalian menyembah selain Allah. Mereka menjawab, 'Kalau Rabb kami menghendaki tentu Dia menurunkan) kepada kami (malaikat-malaikat-Nya, maka sesungguhnya kami kepada wahyu yang kalian diutus membawanya) sesuai dengan sangkaan kalian itu (adalah orang-orang yang kafir.'\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, dari segala penjuru, atau maksudnya para rasul datang kepada mereka secara berturut-turut dengan dakwah yang sama, yaitu tauhid. Membantah risalah para rasul dan mendustakan mereka. Maksud mereka, adapun kamu wahai rasul adalah manusia yang sama seperti kami. Inilah syubhat yang menghalangi mereka untuk beriman yang kemudian diwarisi oleh generasi setelah mereka, padahal syubhat ini termasuk syubhat paling lemah, karena tidak menjadi syarat bahwa rasul itu harus malaikat, yang menjadi syarat adalah bahwa rasul tersebut datang membawa sesuatu yang menunjukkan kebenarannya. Sedangkan para rasul itu telah membawanya, maka silahkan mereka mencari alasan untuk menolaknya secara akal dan naql (penukilan), tentu mereka tidak akan sanggup mencarinya, karena akal dan naql menghendaki untuk mengikuti para rasul yang datang dengan membawa bukti kebenarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 14",
    "description": "Demikianlah, sebagaimana juga dikisahkan oleh Al-Qur'an, ketika para rasul datang kepada masing-masing mereka, kaum 'ad dan Samud, baik dari arah depan dan juga dari arah belakang mereka. Hal ini bermakna bahwa para rasul itu menyampaikan seruan kebenaran dengan berbagai cara, baik terang-terangan maupun dengan sembunyi-sembunyi. Para rasul itu menyerukan, 'janganlah kamu menyembah selain Allah. ' mendengar seruan itu mereka, kaum 'ad dan Samud menjawab, 'kalau tuhan kami menghendaki untuk mengutus rasul, tentu dia mengutus dan menurunkan malaikat-malaikat-Nya kepada kami, bukan manusia biasa seperti kamu. Maka sesungguhnya dengan kenyataan seperti itu, kami mengingkari wahyu yang engkau sengaja diutus untuk menyampaikannya kepada kami. '15. Ayat berikut memerinci apa yang dialami oleh kaum 'ad dan apa pula yang dialami oleh kaum Samud. Maka adapun kaum 'ad, mereka sangat menyombongkan diri di bumi tanpa mengindahkan kebenaran yang diserukan oleh nabi hud, rasul yang dibangkitkan di kalangan mere-ka, dan bahkan dengan congkak mereka berkata, 'siapakah, yakni tidak ada siapa pun, yang lebih hebat kekuatannya dari kami'' sungguh sangat congkak dan sombong sikap kaum 'ad itu. Tidakkah mereka memperhatikan dan menyadari bahwa sesungguhnya Allah yang menciptakan mereka adalah zat yang mahakuasa lagi mahaperkasa' dia adalah zat yang lebih hebat kekuatan-Nya dari kekuatan yang mereka punya. Dan dalam sikap kesombongan dan kecongkakan seperti itu, mereka juga telah mengingkari tanda-tanda kebesaran kami."
  }
]