[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun Ad, kaum Hud, maka mereka menyombongkan diri di muka bumi terhadap manusia tanpa haq. Mereka berkata dengan penuh kesombongan, “Siapa yang lebih hebat kekuatannya dari kami?” apakah mereka tidak melihat bahwa Allah yang menciptakan mereka lebih kuat dan lebih hebat daripada mereka? Mereka adalah orang-orang yang ingkar kepada dalil-dalil dan hujjah-hujjjah Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Adapun 'Ād kaum Hūd, di samping mereka kafir kepada Allah, mereka juga menyombongkan diri di muka bumi tanpa alasan yang benar, dan menzalimi orang-orang di sekitar mereka. Mereka berkata membanggakan kekuatan mereka, “Siapa yang lebih kuat dari kami?” Menurut mereka tidak ada yang lebih kuat daripada mereka. Maka Allah membantah mereka, apakah mereka tidak mengetahui dan tidak melihat bahwa Allah yang menciptakan mereka dan memberi mereka kekuatan yang membuat mereka menyombongkan diri lebih kuat dibandingkan mereka. Mereka adalah orang-orang kafir kepada ayat-ayat Allah yang dibawa oleh Hūd -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَأَمَّا عَادٌ فَاسْتَكْبَرُوا۟ فِى الْأَرْضِ بِغَيْرِ الْحَقِّ (Adapun kaum ‘Aad maka mereka menyombongkan diri di muka bumi tanpa alasan yang benar) Yakni mereka menyombongkan diri dari keimanan kepada Allah dan membenarkan para rasul-Nya serta berbuat sewenang-wenang kepada penduduk bumi tanpa asalah yang benar. وَقَالُوا۟ مَنْ أَشَدُّ مِنَّا قُوَّةً ۖ( dan berkata: “Siapakah yang lebih besar kekuatannya dari kami?”) Dan mereka memang memiliki tubuh yang tinggi kekar, sehingga mereka terperdaya dengan tubuh mereka, sehingga mereka diancam oleh Nabi Hud dengan azab. Dan yang mereka maksudkan dengan perkataan mereka ini adalah mereka merasa mampu untuk menolak azab yang akan menimpa mereka. أَوَلَمْ يَرَوْا۟ أَنَّ اللهَ الَّذِى خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً (Dan apakah mereka itu tidak memperhatikan bahwa Allah Yang menciptakan mereka adalah lebih besar kekuatan-Nya daripada mereka?) Sehingga Dia mampu untuk menurunkan kepada mereka berbagai macam azab yang Dia kehendaki dengan firman-Nya ‘kun’, maka yang dikehendaki-Nya itupun terjadi. وَكَانُوا۟ بِـَٔايٰتِنَا يَجْحَدُونَ(Dan mereka mengingkari tanda-tanda (kekuatan) Kami) Yakni mengingkari mukjizat-mukjizat para rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Adapun kaum ‘Aad yang merupakan kaum nabi Hud itu enggan beriman kepada Allah dan rasulNya tanpa alasan dan kebenaran. Mereka berkata: “Tidak ada yang lebih kuat dari kami” Mereka tidak mengetahui bahwa Allah adalah pencipta mereka. Dialah Dzat yang lebih kuat dan lebih berkuasa daripada mereka. Mereka mengingkari ayat-ayat Kami dan mukjizat-mukjizat rasul dengan keras. Ucapan mereka {Man Asyaddu …} adalah istifham inkary yang menunjukkan makna nafi. Maknanya adalah tidak ada satupun orang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun kaum ‘Ad, mereka menyombongkan diri di bumi tanpa alasan yang benar. Mereka berkata,“Siapakah yang lebih hebat kekuatannya daripada kami” Apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan mereka itu lebih hebat kekuatanNya daripada mereka. Mereka telah mengingkari ayat-ayat Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “Kaum ‘ad”, di samping mereka kafir kepada Allah, ingkar kepada ayat-ayat Allah dan kafir kepada RosulNya, mereka juga menyombongkan diri “di muka bumi,” semena-mena terhadap masyarakat sekitarnya, zhalim terhadap mereka, dan mereka terpedaya dengan kekuatan yang mereka miliki, “dan berkata, ‘siapakah yang lebih besar kekuatannya dari kami?,”. Allah berfirman menolak mereka dengan apa yang diketahui oleh setiap orang. “Dan apakah mereka tidak memperhatikan bahwa Allah yang menciptakan mereka adalah lebih besar kekuatanNya dari mereka?” kalau saja bukan karerna Allah yang menciptakan mereka, tentu mereka tidak akan ada, kalau saja mereka memperhatikan kenyataan ini dengan benar, tentu mereka tidak terperdaya dengan kekuatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 15: (Adapun kaum Ad maka mereka menyombongkan diri di muka bumi tanpa alasan yang benar dan berkata) ketika mereka diperingatkan dengan azab, (\"Siapakah yang lebih besar kekuatannya dari kami?\") maksudnya, tiada seorang pun yang lebih kuat dari kami. Menurut suatu riwayat disebutkan, bahwa seseorang dari mereka mampu mengangkat batu yang sangat besar dari sebuah gunung, kemudian ia mengolahnya sesuai dengan apa yang dia kehendaki. (Dan apakah mereka tidak memperhatikan) apakah mereka tidak mengetahui (bahwa Allah Yang menciptakan mereka adalah lebih besar kekuatan-Nya dari mereka? Dan bahwasanya mereka terhadap tanda-tanda Kami) yakni mukjizat-mukjizat Kami (adalah orang-orang yang ingkar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan lebih lanjut kisah dua umat yang mendustakan, yaitu kaum ‘Aad dan Tsamud. Di samping mereka kafir kepada Allah dan mengingkari ayat-ayat-Nya serta kafir kepada rasul-Nya, mereka juga berlaku sombong di bumi, menindas manusia yang tinggal di sekitar mereka dan menzalimi mereka serta merasa ujub dengan kekuatannya. Ketika diancam dengan azab. Allah Ta’ala membantah mereka dengan sesuatu yang sudah maklum oleh setiap orang. Kalau bukan karena Dia yang menciptakan mereka (kaum ‘Aad), tentu mereka tidak akan ada. Seandainya mereka memperhatikan kepada hal ini dengan perhatian yang benar tentu mereka tidak akan tertipu oleh kekuatan mereka, karena yang mencipta tentu lebih besar kekuatannya. Maka Allah hukum mereka dengan azab yang sesuai dengan kekuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 15",
    "description": "Ayat berikut memerinci apa yang dialami oleh kaum 'ad dan apa pula yang dialami oleh kaum Samud. Maka adapun kaum 'ad, mereka sangat menyombongkan diri di bumi tanpa mengindahkan kebenaran yang diserukan oleh nabi hud, rasul yang dibangkitkan di kalangan mere-ka, dan bahkan dengan congkak mereka berkata, 'siapakah, yakni tidak ada siapa pun, yang lebih hebat kekuatannya dari kami'' sungguh sangat congkak dan sombong sikap kaum 'ad itu. Tidakkah mereka memperhatikan dan menyadari bahwa sesungguhnya Allah yang menciptakan mereka adalah zat yang mahakuasa lagi mahaperkasa' dia adalah zat yang lebih hebat kekuatan-Nya dari kekuatan yang mereka punya. Dan dalam sikap kesombongan dan kecongkakan seperti itu, mereka juga telah mengingkari tanda-tanda kebesaran kami. 16. Sebagai ganjaran bagi kecongkakan dan kesombongan mereka itu, maka kami tiupkan kepada mereka angin yang sangat bergemuruh dan di-ngin hingga terasa menusuk tulang yang berlangsung dalam beberapa hari, yakni selama tujuh malam dan delapan hari yang mereka anggap sebagai hari yang nahas. Itu semua kami timpakan kepada para pendurhaka itu karena kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dibandingkan siksaan di dunia, dan mereka tidak diberi pertolongan sedikit pun."
  }
]