[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mengirimkan kepada mereka angin yang sangat dingin dengan suara yang mengguntur di hari-hari yang membawa sial kepada mereka, agar mereka merasakan azab kehinaan dan kerendahan di dunia, dan azab akhirat benar-benar lebih menghinakan dan lebih merendahkan, mereka tidak ditolong dengan dicegahnya azab dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Maka Kami mengirimkan kepada mereka angin dengan suara yang menyeramkan dan menakutkan di hari-hari yang membawa bencana bagi mereka karena ia membawa azab. Kami hendak membuat mereka merasakan kehinaan dan kerendahan di kehidupan dunia ini, dan azab Akhirat yang menunggu mereka lebih menghinakan dan lebih merendahkan. Mereka tidak mendapatkan orang yang menolong dan mengentaskan mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا (Maka Kami meniupkan angin yang amat gemuruh kepada mereka) Makna (الصرصر) yakni angin yang mengeluarkan suara kencang. Pendapat lain mengatakan, yakni angin yang sangat dingin yang dapat merusak tanaman dan pepohonan sebagaimana api yang membakar. فِىٓ أَيَّامٍ نَّحِسَاتٍ(dalam beberapa hari yang sial) Yakni hari-hari yang mengandung kesialan. Dan angin itu menimpa mereka selama delapan hari tujuh malam, sebagaimana yang disebutkan dalam surat al-Haaqqah. لِّنُذِيقَهُمْ عَذَابَ الْخِزْىِ فِى الْحَيَوٰةِ الدُّنْيَا ۖ( karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia) Makna (الخزي) yakni kehinaan yang disebabkan oleh kesombongan mereka. وَلَعَذَابُ الْاٰخِرَةِ أَخْزَىٰ ۖ( Dan Sesungguhnya siksa akhirat lebih menghinakan) Yakni lebih menghinakan dan merendahkan. وَهُمْ لَا يُنصَرُونَ(sedang mereka tidak diberi pertolongan) Yakni tidak ada yang dapat memberi mereka pertolongan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kami mengirimkan untuk mereka angin kencang dan bersuara keras pada hari kedelapan yang sial bagi mereka. Sungguh Kami membuat mereka merasakan azab yang sangat rendah dan hina di dunia akibat kesombongan mereka. Azab akhirat itu lebih hina dan rendah. Mereka itu tidak dapat ditolong dengan mencegah azab yang menimpa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Kami mengirimkan kepada mereka angin yang bergemuruh} angin yang hembusannya sangat kencang {selama beberapa hari yang nahas} yang sial {karena Kami membuat mereka merasakan siksaan yang menghinakan} yang menghinakan dan rendah {di kehidupan dunia. Sungguh azab akhirat lebih menghinakan} lebih menghinakan dan merendahkan mereka {dan mereka tidak diberi pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. lalu mereka dihukum oleh Allah dengan hukuman yang setara dengan kekuatan mereka yang membuat mereka terpedaya. “maka Kami meniupkan angina yang amat gemuruh kepada mereka”. Yakni, angin yang sangat besar karena kekuatan dan kedahsyatannya, mempunyai gemuruh yang sangat menakutkan bagaikan petir yang menyambar. Allah menundukannya, “yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum Ad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul-tunggul pohon kurma yang telah kosong (lapuk).” (Al-Haqqah :7) Pada hari-hari “yang sial” yang menghancurkan dan membinasakan mereka, sehingga mereka tidak tampak kecuali tempat-tempat tinggal mereka saja. Dan di sini Allah berfirman, “ karena Kami hendak meresakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia,” yang dengannya mereka menjadi hina dan dipermalukan di tengah-tengah manusia, “dan sesungguhnya siksaan akhirat lebih menghinakan sedang mereka tidak dibei pertolongan,” yakni, mereka tidak dicegah dari azab Allah dan mereka tidak dapat menyelamatkan diri mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 16: (Maka Kami meniupkan angin yang amat gemuruh kepada mereka) yakni angin dingin yang sangat keras suaranya, tetapi tanpa hujan (dalam beberapa hari yang sial) dapat dibaca Nahisaatin atau Nahsaatin, artinya hari-hari yang penuh dengan kesialan bagi mereka (karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan) azab yang menghinakan (dalam kehidupan dunia. Dan sesungguhnya siksaan akhirat lebih menghinakan) lebih keras penghinaannya (sedangkan mereka tidak diberi pertolongan) yang dapat mencegah azab dari diri mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni angin yang dahsyat, dimana saking kuat dan kerasnya, angin tersebut sampai memiliki suara yang menakutkan seperti guruh yang bergemuruh. Allah timpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; lalu kaum 'Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk) (lihat Al Haaqqah: 7). Sehingga tidak terlihat lagi selain tempat tinggal mereka. Dimana dengan begitu mereka menjadi hina di hadapan makhluk-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 16",
    "description": "Sebagai ganjaran bagi kecongkakan dan kesombongan mereka itu, maka kami tiupkan kepada mereka angin yang sangat bergemuruh dan di-ngin hingga terasa menusuk tulang yang berlangsung dalam beberapa hari, yakni selama tujuh malam dan delapan hari yang mereka anggap sebagai hari yang nahas. Itu semua kami timpakan kepada para pendurhaka itu karena kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dibandingkan siksaan di dunia, dan mereka tidak diberi pertolongan sedikit pun. 17. Dan adapun terhadap kaum Samud, mereka telah kami beri petunjuk untuk mencapai jalan kebaikan dengan mengutus nabi saleh. Seba-gai bukti kebenaran risalahnya, kami berikan kepada nabi saleh itu mukjizat berupa unta yang tidak boleh disembelih, tetapi mereka lebih menyukai kebutaan atau kesesatan yang disebabkan kebutaan mata hati, daripada petunjuk yang kami sampaikan itu. Maka, mereka disambar petir dan halilintar sebagai azab yang menghinakan dan membinasakan disebabkan apa yang telah mereka kerjakan."
  }
]