[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan Tsamud, kaum Shaleh, maka Kami menjelaskan kepada mereka jalan kebenaran dan jalan yang lurus, namun mereka memilih kesesatan di atas petunjuk, maka halilintar yang menghinakan membinasakan mereka disebabkan dosa-dosa yang mereka lakukan dan kekafiran mereka kepada Allah dan pendustaan mereka terhadap utusan-utusan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Adapun Ṡamūd kaum Ṣāleḥ, maka Kami telah membimbing mereka dengan menjelaskan jalan kebenaran, namun mereka berpaling darinya dan memilih jalan kesesatan, maka azab yang menghinakan turun menimpa mereka karena apa yang mereka lakukan berupa kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Sedangkan kaum Tsamud telah Kami utus kepada mereka Nabi Shalih untuk menjelaskan kepada mereka jalan hidayah dan memperingatkan mereka dari kesesatan. Akan tetapi mereka lebih memilih jalan kesesatan, sehingga Kami hancurkan mereka dengan petir sebagai azab yang menghinakan akibat dosa-dosa yang mereka lakukan. Dan Kami selamatkan Nabi Shalih dan orang-orang yang beriman kepada risalahnya, mereka adalah orang-orang yang takut kepada Allah dengan mentaati perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَأَمَّا ثَمُودُ فَهَدَيْنٰهُمْ (Dan adapun kaum Tsamud, maka mereka telah Kami beri petunjuk) Yakni telah Kami jelaskan kepada mereka jalan keselamatan dan Kami tunjukkan jalan kebenaran dengan mengirim para rasul kepada mereka dan memberikan mereka tanda-tanda yang berasal dari makhluk-makluk Allah. فَاسْتَحَبُّوا۟ الْعَمَىٰ عَلَى الْهُدَىٰ( tetapi mereka lebih menyukai buta (kesesatan) daripada petunjuk) Mereka lebih memilih kekafiran daripada keimanan, dan kemaksiatan daripada ketaatan. فَأَخَذَتْهُمْ صٰعِقَةُ الْعَذَابِ الْهُونِ(maka mereka disambar petir azab yang menghinakan) Makna (الصاعقة) yakni api yang menyambar yang dapat membunuh orang yang tertimpa dengan sekejap. Dan (العذاب الهون) adalah azab yang menghinakan. بِمَا كَانُوا۟ يَكْسِبُونَ(disebabkan apa yang telah mereka kerjakan) Yakni akibat perbuatan mereka, dan Allah sama sekali tidak menzalimi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Adapun kaum Tsamud yang merupakan kaumnya nabi Shalih, kami menjelaskan kepada mereka tentang jalan petunjuk, jalan kebaikan, dan keberhasilan. Kami juga memperkenalkan kepada mereka jalan keburukan dengan mengutus rasul dan menjelaskan hujjah-hujjah dan dalil. Akan tetapi mereka lebih memilih kekufuran daripada keimanan. Lalu kami memasukkan mereka ke dalam neraka yang menghancurkan mereka dengan seketika akibat kekufuran dan pendustaan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun kaum Tsamud, mereka telah Kami memberi petunjuk} Kami menjelaskan petunjuk dan kesesatan kepada mereka {tetapi mereka lebih menyukai} mereka memilih {kebutaan} kesesatan {daripada petunjuk itu. Maka mereka disambar petir sebagai azab yang menghinakan} yang menghinakan {karena apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Dan adapun kaum tsamud”, mereka adalah suku yang sangat terkenal, mereka mendiami daerah al-hijr dan sekitarnya. Kepada mereka Allah mengutus Nabi Shaleh yang mengajak mereka untuk bertauhid, mengesakan Allah dan mencegah mereka dari perbuatan-perbuatan mepersekutukanNya. Dan Allah mendatangkan kepada mereka seekor untu betina sebagai bukti yang sangat agung, ia mempunyai giliran untuk mendapatkan air, dan mereka mempunyai giliran pula untuk mendapatkan air di hari tertentu. Mereka minum susunya satu hari dan minum air biasa satu hari, dan mereka tidak memberinya makan apa-apa, melainka ia mencari makanan sendiri di bumi Allah. Maka darri itu Allah berfirman, “Dab adapun kaum Tsamud, mereka telah Kami beri petunjuk,” Mkasudnya, petunjuk penjelasan. Kenapa mereka yang disebutkan secara khusus di dalam ayat ini, padahal seluruh umat yang dibinasakan telah ditegakkan hujjah dan penjelasan terhadap mereka, hal itu kaena mukjizat yang diberikan kepada kaumTsamud adalah mukjizat yang luar bisa, dilihat oleh anak-anak dan orang dewasa mereka, yang laki-laki maupun yang peempuan. Dan ayat itu adalah ayat yang sangat jelas sekali. Maka dari itu Allah mengistimewakan mereka dengan tambahan penjelasan dan petunjuk. Akan tetapi karena kezhaliman dan kejahat mereka, maka mereka lebih mencintai “kebutaan” yakni kekafiran dan kesesata “dari pada petunjuk” yaitu ilmu dan iman. Maka mereka dilanda “azab” disebabkan apa yang telah mereka kerjakan, bukan karena kezhaliman Allah terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 17: (Adapun Kaum Tsamud maka mereka telah Kami beri petunjuk) yaitu Kami telah menjelaskan kepada mereka jalan petunjuk (tetapi mereka lebih menyukai buta) artinya, lebih memilih kafir (daripada petunjuk itu, maka mereka disambar petir azab yang menghinakan) mereka dihinakan oleh azab berupa petir (disebabkan apa yang telah mereka kerjakan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tsamud adalah kabilah yang sudah dikenal yang tinggal di Hijr dan sekitarnya. Allah mengutus kepada mereka Nabi Saleh ‘alaihis salam yang mengajak mereka mentauhidkan Allah, melarang mereka berbuat syirk, dan Allah memberikan mukjizat kepada Beliau dengan unta betina, dimana unta tersebut dengan kaum Nabi Saleh memiliki giliran minum; pada hari ini unta tersebut minum dan mereka dapat meminum susunya sedangkan pada hari yang lain mereka dapat mengambil minum. Di samping itu, mereka tidak perlu mengeluarkan biaya dan tenaga untuk mengurus unta itu, bahkan unta betina itu makan sendiri dari rerumputan di bumi. Tetapi kemudian, mereka malah membunuh unta betina itu. Yakni telah Kami tegakkan hujjah bagi mereka dengan memperlihatkannya secara jelas. Karena kezaliman dan keburukan mereka. Yaitu ilmu dan iman. Bukan karena Allah menzalimi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 17",
    "description": "Dan adapun terhadap kaum Samud, mereka telah kami beri petunjuk untuk mencapai jalan kebaikan dengan mengutus nabi saleh. Seba-gai bukti kebenaran risalahnya, kami berikan kepada nabi saleh itu mukjizat berupa unta yang tidak boleh disembelih, tetapi mereka lebih menyukai kebutaan atau kesesatan yang disebabkan kebutaan mata hati, daripada petunjuk yang kami sampaikan itu. Maka, mereka disambar petir dan halilintar sebagai azab yang menghinakan dan membinasakan disebabkan apa yang telah mereka kerjakan. 18. Setelah menjelaskan azab yang ditimpakan kepada kaum 'ad dan Samud yang mendurhakai nabinya masing-masing, Allah lalu menjelaskan keadaan nabi hud dan nabi saleh beserta para pengikutnya. Allah berfirman, 'dan kami selamatkan kedua nabi itu, nabi hud dan nabi saleh, beserta orang-orang beriman yang menjadi pengikut keduanya karena mereka adalah orang-orang yang senantiasa bertakwa dengan melaksanakan segala yang kami perintahkan dan meninggalkan apa yang kami larang."
  }
]