[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menyelamatkan orang-orang beriman dari azab yang menimpa Ad dan Tsamud, dan orang-orang yang selamat itu adalah orang-orang yang takut kepada Allah dan bertakwa kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan Kami menyelamatkan orang-orang yang beriman kepada Allah dan rasul-rasul-Nya. Mereka bertakwa kepada Allah dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Kami menyelamatkan mereka dari azab yang menimpa kaum mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَنَجَّيْنَا الَّذِينَ ءَامَنُوا۟ وَكَانُوا۟ يَتَّقُونَ (Dan Kami selamatkan orang-orang yang beriman dan mereka adalah orang-orang yang bertakwa) Mereka adalah Nabi Shalih dan orang-orang beriman yang bersamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kami menolong orang-orang mukmin yang bertakwa. Mereka adalah orang shalih dan beriman kepada risalahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menyelamatkan orang-orang yang beriman dan selalu bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Dan Kami selamatkan oang-oang yang beriman dan mereka adalah orang-orang yang bertakwa.” Maksudnya, kami selamatkan Nabi Shaleh dan orang-orang yang mengikuti beliau dari orang-orang yang beriman yang menghindarkan diri dari syirrik dan maksiat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 18: (Dan Kami selamatkan) dari azab itu (orang-orang yang beriman dan mereka adalah orang-orang yang bertakwa.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Nabi Saleh dan para pengikutnya dari kalangan kaum mukmin. Yakni menjaga dirinya dari syirk dan maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 18",
    "description": "Setelah menjelaskan azab yang ditimpakan kepada kaum 'ad dan Samud yang mendurhakai nabinya masing-masing, Allah lalu menjelaskan keadaan nabi hud dan nabi saleh beserta para pengikutnya. Allah berfirman, 'dan kami selamatkan kedua nabi itu, nabi hud dan nabi saleh, beserta orang-orang beriman yang menjadi pengikut keduanya karena mereka adalah orang-orang yang senantiasa bertakwa dengan melaksanakan segala yang kami perintahkan dan meninggalkan apa yang kami larang. 19. Ayat-ayat sebelum ini berbicara tentang azab dan siksaan yang ditimpakan kepada kaum pendurhaka ketika mereka masih di dunia, dan mengisyaratkan bahwa siksaan di akhirat jauh lebih dahsyat dan menghinakan. Ayat-ayat berikut menjelaskan bagaimana penggambaran azab akhirat tersebut. Dan ingatkanlah kaum kafir mekah itu, wahai nabi Muhammad, bahwa pada hari kiamat ketika mereka musuh-Musuh Allah itu, seperti kaum 'ad dan 'amud, digiring dengan kasar dan tanpa belas kasihan oleh para malaikat ke dalam neraka lalu mereka dipisah-pisahkan."
  }
]