[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Qur’an yang mulia ini diturunkan dari Allah yang Maha Pengasih lagi Maha Penyayang, Dia menurunkannya kepada Nabi-Nya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Al-Qur`ān ini diturunkan dari Allah yang Maha Pengasih lagi Maha Penyayang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Al-Qur’an ini diturunkan oleh Allah Yang Maha Pengasih bagi seluruh makhluk di dunia dan Maha Penyayang bagi orang-orang beriman di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. تَنزِيلٌ مِّنَ الرَّحْمٰنِ الرَّحِيمِ (Diturunkan dari Tuhan Yang Maha Pemurah lagi Maha Penyayang) Yakni al-Qur’an ini diturunkan oleh Allah sebagai rahmat bagi seluruh alam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Al-Qur’an ini diturunkan dari Allah SWT, Pemilik rahmat yang luas dan pemberi nikmat-nikmat yang agung dan terperinci"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diturunkan dari Tuhan Yang Maha Pengasih lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah mengabarkan hamba-hambaNYa bahwa kitab suci yang sangat mulia dan al-qur’an yang sangat indah ini adalah “diturunkan” dan berasal “dari yang maha pemurah lagi maha penyayang,” yang rahmatNYa meliputi segala sesuatu, yang diantara rahmatNya yang paling besar dan paling mulia adalah diturunkannya al-kitab (al-qur’an) ini sendiri, yang dengannya dapat diraih berbagai ilmu, petunjuk, nur, kesembuhan, rahmat, dan kebaikan yang berlimpah, yang menjadikannya di antara nikmatNya yang termulia atas hamba-hambaNYa, dan ia adalah jalan kebahagiaan di dua negeri (dunia akhirat)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 2: (Diturunkan dari Tuhan Yang Maha Pemurah lagi Maha Penyayang) kalimat ayat ini berkedudukan menjadi Mubtada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan kepada hamba-hamba-Nya bahwa kitab-Nya yang agung ini turun dari Allah Yang Maha Pengasih lagi Maha Penyayang, dimana rahmat-Nya meliputi segala sesuatu, dan di antara rahmat-Nya yang paling agung dan paling besar adalah dengan menurunkan kitab tersebut yang daripadanya keluar berbagai ilmu, petunjuk, cahaya, penyembuh, rahmat dan kebaikan yang banyak yang merupakan nikmat paling besar kepada hamba-hamba-Nya, dan ia merupakan jalan menuju kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 2",
    "description": "Al-qur'an ini diturunkan secara bertahap dari Allah, tuhan yang maha pengasih kepada semua makhluk ciptaan-Nya, lagi maha penya-yang hanya kepada orang-orang yang beriman. 3. Kitab itu adalah Al-Qur'an yang dalam ayat-ayatnya dijelaskan semua yang diperlukan oleh manusia untuk meraih kebahagiaan hidup dunia-wi dan ukhrawi, bacaan yang mulia dalam bahasa arab, sebagai petunjuk untuk kaum yang mau dan berpotensi mengetahui."
  }
]