[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Pada hari di mana musuh-musuh Allah di seret ke Neraka Jahanam, para malaikat Zabaniyah menggiring mereka dari awal hingga akhir mereka. Sehingga saat mereka tiba di neraka, mereka mengingkari dosa-dosa mereka, maka pada saat itu pendengaran,penglihatan, dan kulit mereka bersaksi dengan apa yang mereka lakukan di dunia berupa dosa dan kesalahan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Hingga tatkala mereka tiba di Neraka tempat mereka digiring, mereka mengingkari apa yang mereka lakukan di dunia, namun pendengaran, penglihatan dan kulit mereka bersaksi atas mereka terkait apa yang telah mereka lakukan di dunia berupa kekufuran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصٰرُهُمْ وَجُلُودُهُم بِمَا كَانُوا۟ يَعْمَلُونَ (Sehingga apabila mereka sampai ke neraka, pendengaran, penglihatan dan kulit mereka menjadi saksi terhadap mereka tentang apa yang telah mereka kerjakan) Yakni kemaksiatan yang mereka kerjakan di dunia. Anggota tubuh mereka akan berbicara tentang kesyirikan yang disembunyikan oleh lidah mereka. Dan yang dimaksud dengan kulit adalah kulit sebagaimana yang kita ketahui. Namun pendapat lain mengatakan bahwa yang dimaksud adalah sebagai kiasan tentang kemaluan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Sehingga ketika mereka sampai di neraka, pendengaran, penglihatan dan kulit mereka bersaksi untuk mereka dengan berbicara kepada Allah. Maksud dari kulit pada kalimat ini adalah seluruh anggota badan mereka (Itu adalah penyebutan sesuatu yang khusus dengan maksud sesuatu yang lebih umum). (Semua itu) akibat perbuatan dan usaha mereka di dunia berupa kemaksiatan, kekufuran dan perbuatan dosa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga ketika mereka sampai ke neraka} datang di neraka {pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “sehingga apabila mereka sampai ke sana,” maksudnya, hingga apabila mereka sudah tiba di neraka dan hendak melakukan pengingkaran, atau mengingkari kemaksiatan-kemaksiatan yang telah mereka kerjakan, “pendengaran, penglihatan, dan kulit mereka bersaksi melawan mereka.” Ini adalah ungkapan umum setelah ungkapan yang bermakna khusus, “tentang apa yang telah mereka kerjakan”. Setiap anggota tubuh mereka memberi kesaksian. Setiap anggota badan mereka mengatakan: aku telah melakukan perbuatan ini pada hari anu, dan seterusnya. Hanya tiga anggota tubuh ini saja yang disebutkan, karena kebanyakan dosa-dosa disebabkan karenanya atau disebabkan olehnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 20: (Sehingga apabila) huruf Maa di sini adalah Zaidah atau tambahan (mereka sampai ke neraka, pendengaran, penglihatan dan kulit mereka menjadi saksi terhadap mereka tentang apa yang telah mereka kerjakan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka hendak mengingkari apa yang yang telah mereka kerjakan selama di dunia. Yakni setiap anggota badannya memberikan kesaksian terhadap mereka. Setiap anggota akan berkata, “Saya pernah melakukan ini dan itu.” Disebutkan tiga anggota ini secara khusus karena kebanyakan dosa dilakukan olehnya atau karena sebabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 20",
    "description": "Sehingga apabila mereka, para musuh Allah itu, sampai ke depan pintu neraka, lalu diajukanlah kepada mereka pertanyaan tentang dosa-dosa yang telah mereka lakukan selama hidup di dunia. Akan tetapi, mereka mengingkarinya dan tidak mengakui perbuatan dosa itu. Maka, Allah mengambil anggota badan mereka, seperti pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap apa yang telah mereka lakukan selama hidup di dunia itu. 21. Ketika anggota tubuh mereka, seperti pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap perbuatan dosa yang mereka lakukan selama hidup di dunia, mereka pun mempertanyakan hal itu. Dan ingatlah ketika mereka para musuh Allah itu, berkata kepada kulit mereka sendiri, 'mengapa kamu menjadi saksi yang memberatkan terhadap kami'' kulit mereka menjawab, 'yang menjadikan kami dapat berbicara adalah Allah, yang juga menjadikan segala sesuatu dapat berbicara, dan dialah juga yang menciptakan kamu yang pertama kali serta menganugerahkan kemampuan berbicara, dan hanya kepada-Nya saja kamu dikembalikan. '."
  }
]