[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musuh-musuh Allah yang digiring ke neraka itu berkata mengingkari kulit-kulit mereka, “Mengapa kalian bersaksi memberatkan kami?” maka kulit-kulit itu menjawab, “Allah yang membuat kami berbicara, Dia-lah yang membuat segala sesuatu berbicara, Dia-lah yang menciptakan kalian pertama kali saat kalian bukan apa-apa dan hanya kepadaNya tempat kembali kalian setelah kematian untuk menghadapi perhitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Orang-orang kafir berkata kepada kulit mereka, “Mengapa kamu bersaksi atas kami dengan apa yang kami perbuat di dunia?” Maka kulit menjawab, “Allah yang membuat segala sesuatu berbicara membuat kami berbicara, Dia lah yang menciptakan kalian pertama kali manakala kalian masih hidup di dunia, dan hanya kepada-Nya kalian kembali di kehidupan Akhirat untuk menghadapi hisab dan menerima pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Mereka mengingkari kulit mereka yang bersaksi, dengan berkata: “Mengapa kalian bersaksi atas kami?” Maka kulit mereka menjawab: “Allahlah yang menjadikan kami dapat berbicara dengan kuasa-Nya menjadikan segalanya dapat berbicara, dan Dia yang menciptakan kalian pertama kali ketika kalian belum menjadi sesuatu apapun; and kepada-Nya kalian akan kembali untuk menjalani hisab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَقَالُوا۟ لِجُلُودِهِمْ لِمَ شَهِدتُّمْ عَلَيْنَا ۖ قَالُوٓا۟ أَنطَقَنَا اللهُ الَّذِىٓ أَنطَقَ كُلَّ شَىْءٍ (Dan mereka berkata kepada kulit mereka: “Mengapa kamu menjadi saksi terhadap kami?” Kulit mereka menjawab: “Allah yang menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai (pula) berkata) Yakni Allah menjadikan segala sesuatu dapat berbicara sebagaimana lidah yang berbicara di dunia, demikian pula-lah Allah menjadikan kami dapat berbicara di akhirat, sehingga kami dapat bersaksi atas kalian tentang amal-amal buruk kalian. وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ(dan Dialah yang menciptakan kamu pada kali pertama dan hanya kepada-Nya lah kamu dikembalikan) Yakni Dzat yang mampu menciptakan kalian pertama kali juga mampu menciptakan kalian kembali dan mengembalikan kalian kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Musuh-musuh Allah berkata kepada anggota tubuh mereka: “Kenapa kalian bersaksi untuk kami?” Lalu mereka menjawab: “Allah menjadikan kami bisa berbicara. Dialah Dzat yang menjadikan setiap makhluk dapat berbicara. Jadi kami bersaksi tentang perbuatan kalian yang buruk-buruk. Dzat yang mampu menciptakan kalian di awal penciptaan juga mampu mejadikan kalian kembali kepadaNya. Kalian semua kembali kepadaNya setelah mati untuk dihisab dan dibalas”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} orang-orang kafir berkata {kepada kulit mereka,“Mengapa kalian menjadi saksi terhadap kami” Mereka menjawab} kulit-kulit itu menjawab orang yang memilikinya {“Allah yang menjadikan segala sesuatu dapat berbicara telah menjadikan kami dapat berbicara. Dialah Dzat yang menciptakan kalian pertama kali dan hanya kepadaNya kalian dikembalikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. apabila angota-anggota tubuh itu telah memberikan kesaksiannya, mereka pun mencelanya,”dan mereka berkata kepada kulit mereka,” ini dalil (bukti) bahwa kesaksian dilakukan oleh setiap anggota tubuh, sebagaimana kami sebutkan tadi, “mengapa kamu menjadi saksi melawan kami,” pada kami “kulit meeka menjawab,’Allah yang telah menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai pula berkata’.” Jadi, kami tidak punya kemampuan untuk menghindari pemberian kesaksian saat kami dijadikan pandai berbicara oleh tuhan yang tidak ada seoang pun yang bisa terlepas dari masyi’ah (kehendak)Nya, “dan Dia-lah yang menciptakan kamu pada kali yang pertama,” sebagaimana Dia telah menciptakan kalian dengan perangkat tubuh kalian, Dia juga telah menciptakan sifat-sifat kalian, yang diantaranya adalah kemampuan berbicara,”dan hanya kepadaNYalah kamu dikembalikan,” di akhirat kelak, lalu Dia akan memberikan balasan atas apa yang telah kalian kerjakan. Ada kemungkinan maksud dari penjelasan di atas adalah berargumen dengan penciptaan pertama untuk membenarkan kebangkitan, sebagaimana itu adalah metode al-qur’an."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 21: (Dan mereka berkata kepada kulit mereka, \"Mengapa kalian menjadi saksi terhadap kami?\" Kulit mereka menjawab, \"Allah yang menjadikan segala sesuatu pandai berkata telah menjadikan kami pandai berkata) yakni segala sesuatu yang dikehendaki-Nya dapat berbicara (dan Dialah Yang menciptakan kalian pada kali yang pertama dan hanya kepada-Nyalah kalian dikembalikan\") menurut suatu pendapat, dikatakan bahwa perkataan ini adalah perkataan kulit. Menurut pendapat yang lain, perkataan ini adalah firman Allah swt. sebagaimana hal yang telah diterangkan sebelumnya, dan hal ini mirip sekali dengannya, yaitu: Bahwasanya Tuhan Yang mampu menciptakan kalian pada kali yang pertama, lalu menghidupkan kalian kembali sesudah mati, Dia mampu pula untuk menjadikan kulit kalian dan anggota tubuh kalian lainnya untuk dapat berbicara."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika anggota badan mereka memberikan kesaksian, maka mereka mencelanya dengan berkata seperti yang disebutkan dalam ayat di atas. Syaikh As Sa’diy berkata, “Ini merupakan dalil bahwa persaksian dilakukan oleh setiap anggota badan sebagaimana yang telah kami sebutkan.” Yakni padahal kami membela kamu. Yakni kami tidak dapat menolak memberikan kesaksian ketika Dia menjadikan kami dapat berbicara, karena tidak ada yang dapat menolak kehendak-Nya. Oleh karena Dia yang menciptakan zat dan jasmani kamu, maka Dia pula yang menciptakan sifat untukmu, termasuk di antaranya berbicara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 21",
    "description": "Ketika anggota tubuh mereka, seperti pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap perbuatan dosa yang mereka lakukan selama hidup di dunia, mereka pun mempertanyakan hal itu. Dan ingatlah ketika mereka para musuh Allah itu, berkata kepada kulit mereka sendiri, 'mengapa kamu menjadi saksi yang memberatkan terhadap kami'' kulit mereka menjawab, 'yang menjadikan kami dapat berbicara adalah Allah, yang juga menjadikan segala sesuatu dapat berbicara, dan dialah juga yang menciptakan kamu yang pertama kali serta menganugerahkan kemampuan berbicara, dan hanya kepada-Nya saja kamu dikembalikan. '22. Dan kamu benar-benar tidak dapat dan tidak mampu bersembunyi dari kesaksian yang diberikan oleh pendengaran, penglihatan, dan kulitmu terhadap diri-Mu sendiri. Bahkan kamu mengira bahwa Allah yang maha mendengar dan maha melihat itu tidak mengetahui banyak tentang apa yaitu perbuatan jahat yang telah kamu lakukan itu."
  }
]