[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-23. Kalian tidak bersembunyi saat melakukan kemaksiatan-kemaksiatan karena takut bila pendengaran, penglihatan dan kulit kalian akan bersaksi memberatkan kalian di Hari Kiamat. Akan tetapi kalian mengira dengan melakukan kemaksiatan-kemaksiatan bahwa Allah tidak mengetahui banyak dari amal-amal perbuatan kalian yang dengannya kalian mendurhakaiNya. Itulah dugaan buruk kalian yang kalian sangkakan terhadap Tuhan kalian, ia mencelakakan kalian dan membuat kalian masuk neraka, maka di hari ini kalian termasuk orang-orang yang merugi pada diri dan keluarga mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kalian tetap tidak bisa bersembunyi manakala kalian melakukan kemaksiatan karena pendengaran, penglihatan dan kulit kalian akan bersaksi atas kalian, karena kalian tidak beriman kepada hisab, hukuman dan pahala sesudah kematian, akan tetapi kalian menduga bahwa Allah tidak mengetahui kebanyakan dari amal perbuatan kalian, sebaliknya ia samar bagi Allah, maka kalian tertipu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-24. Dan kalian dahulu tidak dapat bersembunyi dari saksi-saksi itu ketika kalian melakukan dosa secara sembunyi-sembunyi karena takut terbongkar aib kalian; dan kalian mengira Allah tidak mengetahui banyak dosa yang kalian lakukan. Hal yang sangat buruk adalah prasangka buruk kalian terhadap Tuhan kalian itu. Prasangka itulah yang menjerumuskan kalian ke dalam kehancuran, sehingga kalian termasuk orang-orang yang merugikan diri sendiri dan kehilangan kebahagiaan. Jika mereka bersabar di dalam azab itu, maka neraka memang telah menjadi tempat tinggal mereka, dan jika mereka berharap agar dapat meraih keridhaan Allah supaya mendapat ampunan dari Allah maka mereka tidak akan diridhai dan Allah tidak akan mengampuni mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَا كُنتُمْ تَسْتَتِرُونَ أَن يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَآ أَبْصٰرُكُمْ وَلَا جُلُودُكُمْ (Kamu sekali-sekali tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan dan kulitmu kepadamu) Dikatakan bahwa ini merupakan bagian dari firman Allah atau perkataan kulit mereka. Yakni kalian tidak dapat bersembunyi ketika melakukan keburukan dari kesaksian anggota badan kalian. Dan ketika manusia tidak dapat bersembunyi dari anggota tubuhnya ketika bermaksiat maka makna bersembunyi yang dimaksud di sini adalah meninggalkan maksiat karena takut dari kesaksian anggota badan. وَلٰكِن ظَنَنتُمْ أَنَّ اللهَ لَا يَعْلَمُ كَثِيرًا مِّمَّا تَعْمَلُونَ(bahkan kamu mengira bahwa Allah tidak mengetahui kebanyakan dari apa yang kamu kerjakan) Yakni kemaksiatan yang kalian kerjakan. Sehingga kalian berani untuk melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Kalian tidak bisa menutup-nutupi dan menyembunyikan perbuatan keji saat seluruh anggota tubuh bersaksi untuk kalian pada hari kiamat. Akan tetapi kalian bersaksi bahwa sesungguhnya Allah tidak mengetahui banyak tentang perbuatan kalian yang berupa kemaksiatan, sehingga kalian berani mengerjakannya. Ini, bisa jadi ucapan anggota tubuh, kalam Allah atau ucapan malaikat. Ayat ini diturunkan untuk tiga orang Quraisy yang saling bertanya-tanya bahwa Allah mendengar ucapan mereka. Salah satu mereka berkata: “Jika kami mengeraskan suara kami, Dia bisa mendengarnya, namun jika kami tidak mengeraskan suara, maka Dia tidak akan bisa mendengarnya” Kemudian yang lainnya berkata: “Jika Dia bisa mendengar sedikit suara kami, tentu Dia bisa mendengar seluruh ucapan kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak dapat menutupi} menutupi perbuatan maksiat kalian {kesaksian} menyembunyikan kesaksian {pendengaran, penglihatan, dan kulit kalian terhadap kalian, bahkan kalian mengira Allah tidak banyak mengetahui tentang apa yang kalian lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “kamu sekali-kali tidak dapat bersembunyi dari persaksian pendengaran, penglihatan, dan kulitmu yang melawanmu,” artinya, kalian sekali-kali tidak akan bisa bersembunyi dari persaksian anggota tubuh kalian yang melawan kalian dan kalian tidak akan dapat menghindarinya, “bahwa kamu mengira,” dengan kelancangan kalian melakukan maksiat-maksiat, “bahwa Allah tidak mengetahui kebanyakan dari apa yang kamu kerjakan,” maka dari itu lahirlah apa yang telah lahir dari perbuatan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 22: (Dan kalian sekali-kali tidak dapat bersembunyi) bila kalian berbuat hal-hal yang keji (dari persaksian pendengaran, penglihatan dan kulit kalian terhadap kalian) karena sesungguhnya kalian tidak percaya dengan adanya hari berbangkit (bahkan kalian mengira) sewaktu kalian menyembunyikan diri (bahwa Allah tidak mengetahui kebanyakan dari apa yang kalian kerjakan.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Mas’ud (tentang ayat), “Dan kamu tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan…dst.” Ia berkata, “Ada dua orang laki-laki dari Quraisy dan kerabatnya dari Tsaqif atau dua orang laki-laki dari Tsaqif dan kerabatnya dari Quraisy (ini adalah keragu-raguan dari Abu Ma’mar perawi hadits ini) di sebuah rumah, lalu sebagian mereka berkata kepada yang lain, “Apakah menurutmu bahwa Allah mendengar pembicaraan kita?” Sebagian mereka berkata, “Dia mendengar sebagiannya.” Sebagian lagi berkata, “Jika mendengar sebagiannya maka berarti Dia mendengar semuanya.”Maka turunlah ayat, “Dan kamu tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan…dst.” Mereka yang berbuat dosa secara terang-terangan karena mereka menyangka bahwa Allah tidak mengetahui perbuatan mereka dan karena mereka tidak mengetahui bahwa pendengaran, penglihatan dan kulit mereka akan menjadi saksi di akhirat kelak atas perbuatan mereka. Ketika kamu melakukan maksiat. Oleh karena itu kamu lakukan perbuatan yang telah kamu lakukan yang menjadi penyebab kamu binasa dan celaka sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 22",
    "description": "Dan kamu benar-benar tidak dapat dan tidak mampu bersembunyi dari kesaksian yang diberikan oleh pendengaran, penglihatan, dan kulitmu terhadap diri-Mu sendiri. Bahkan kamu mengira bahwa Allah yang maha mendengar dan maha melihat itu tidak mengetahui banyak tentang apa yaitu perbuatan jahat yang telah kamu lakukan itu. 23. Dan sungguh itulah dugaan buruk-Mu yang telah kamu sangkakan terhadap tuhan yang telah berbuat baik kepada-Mu, dan sekarang ternyata dugaan itulah yang telah membinasakan kamu, sehingga jadilah kamu termasuk dalam kelompok orang yang rugi, ."
  }
]