[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-23. Kalian tidak bersembunyi saat melakukan kemaksiatan-kemaksiatan karena takut bila pendengaran, penglihatan dan kulit kalian akan bersaksi memberatkan kalian di Hari Kiamat. Akan tetapi kalian mengira dengan melakukan kemaksiatan-kemaksiatan bahwa Allah tidak mengetahui banyak dari amal-amal perbuatan kalian yang dengannya kalian mendurhakaiNya. Itulah dugaan buruk kalian yang kalian sangkakan terhadap Tuhan kalian, ia mencelakakan kalian dan membuat kalian masuk neraka, maka di hari ini kalian termasuk orang-orang yang merugi pada diri dan keluarga mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dugaan buruk kalian kepada Rabb kalian itu telah membinasakan kalian, karena itu kalian termasuk orang-orang yang merugi di dunia dan di Akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَذٰلِكُمْ ظَنُّكُمُ الَّذِى ظَنَنتُم بِرَبِّكُمْ أَرْدَىٰكُمْ (Dan yang demikian itu adalah prasangkamu yang telah kamu sangka kepada Tuhanmu, Dia telah membinasakan kamu) Yakni sangkaan kalian bahwa Allah tidak mengetahui kebanyakan perbuatan kalian menjadikan kalian berani untuk melakukan kemaksiatan, sehingga kalian bersegera melakukannya, dan inilah yang membinasakan kalian dan menjerumuskan kalian ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Demikian itu adalah asumsi kalian bahwa Allah itu tidak mengetahui banyak tentang apa yang kalian kerjakan. Maka Dia meletakkan kalian dalam kerusakan dan kehancuran dalam neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah dugaan kalian yang telah kalian sangkakan terhadap Tuhan kalian. Itu telah membinasakan kalian} membinasakan kalian {sehingga kalian termasuk orang-orang yang rugi} yang celaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. prasangka ini menjadi sebab kebinasaan darri kesengsaraan kalian. Maka dari itu Allah berfirman,”dan yang demikian itu adalah prasangkamu yang telah kamu sangka terhadap Rabbmu,” yaitu prasangka buruk, dimana kalian berprasangka terhadapnya sesuatu yang sangat tidak layak dengan kebesaranNYa “dan ia telah membinasakan kamu” maksudnya, mencelakakan kalian,”maka jadilah kamu termasuk orang-orang yang merugi,”merugikan diri mereka, keluarga, dan agama mereka sendiri, disebabkan amal-amal perbuatan yang di akibatkan oleh prasangka buruk kalian terhadap Rabb kalian. Maka pastilah ketetapan azab dan kesengsaraan terhadap kalian, maka kekekalan abadi di dalam azab itu pun menjadi pasti terhadap kalian, azab yang tidak akan pernah dihentikan sesaatpun terhadap kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 23: (Dan yang demikian itu) menjadi Mubtada (adalah prasangka kalian) menjadi Badal dari lafal Dzaalika (yang kalian sangka terhadap Rabb kalian) menjadi Na`at, sedangkan Khabar Mubtada ialah (akan menghancurkan kalian) akan membinasakan diri kalian sendiri (maka jadilah kalian termasuk orang-orang yang merugi.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dugaan yang tidak sesuai dengan kebesaran-Nya. Yang merugikan dirimu, keluargamu dan agamamu karena amal yang didasari dugaan buruk kepada Allah, kamu pun berhak memperoleh ketetapan azab dan kesengsaraan, serta berhak kekal dalam azab, dimana azab itu tidak akan diringankan darimu walaupun sesaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 23",
    "description": "Dan sungguh itulah dugaan buruk-Mu yang telah kamu sangkakan terhadap tuhan yang telah berbuat baik kepada-Mu, dan sekarang ternyata dugaan itulah yang telah membinasakan kamu, sehingga jadilah kamu termasuk dalam kelompok orang yang rugi, 24. Agar terasa betapa besar murka Allah terhadap musuh-Musuh-Nya itu, maka pembicaraan tidak ditujukan kepada mereka, karena mereka tidak layak lagi untuk diajak bicara, tetapi dikatakan bahwa meskipun mereka bersabar atau menahan rasa pedih atas azab neraka, maka memang yang pantas nerakalah yang menjadi tempat tinggal mereka, dan jika mereka minta belas kasihan agar diampuni dan diringankan siksanya, maka mereka itu tidak termasuk orang yang pantas dikasihani untuk diberi ampunan dan keringanan siksa."
  }
]