[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "jika mereka bersabar menerima azab, maka neraka adalah tempat tinggal mereka, dan bila mereka minta kembali ke dunia untuk memulai amal shalih, maka permintaan mereka tidak dituruti dan alasan-alasan tidak diterima dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Bila orang-orang yang pendengaran, penglihatan dan kulit mereka bersaksi atas mereka itu bersabar, maka Neraka adalah tempat tinggal mereka, tempat kembali yang kepadanya mereka kembali. Jika mereka mencari rida Allah dan berharap masuk Surga, maka mereka tidak akan pernah mendapatkannya dan tidak akan pernah masuk Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَإِن يَصْبِرُوا۟ فَالنَّارُ مَثْوًى لَّهُمْ ۖ (Jika mereka bersabar (menderita azab) maka nerakalah tempat tinggal mereka) Yakni sebagai tempat tinggal mereka yang tidak mungkin mereka keluar darinya. وَإِن يَسْتَعْتِبُوا۟ فَمَا هُم مِّنَ الْمُعْتَبِينَ (dan jika mereka mengemukakan alasan-alasan, maka tidaklah mereka termasuk orang-orang yang diterima alasannya) Yakni jika mereka meminta untuk dikembalikan kepada apa yang mereka sukai maka mereka tidak akan dikembalikan sebab mereka tidak berhak mendapatkannya. Dan jika mereka meminta keridhaan niscaya mereka tidak akan diberi keridhaan itu, sebab mereka berhak dimasukkan ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Jika mereka melihat azab, maka neraka itulah tempat bermukim dan tempat tinggal bagi mereka. Ketika mereka mencari keridhaan. Maknanya (ketika mereka) kehilangan penyebab keridhaan, berupa kemarahan Allah, mereka berharap Allah meridhai mereka. Akan tetapi mereka bukanlah orang-orang yang diridhai. Maknanya kalian bukan orang yang dikabulkan permintaannya karena waktunya telah habis."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika mereka bersabar, maka nerakalah tempat tinggal bagi mereka dan jika mereka meminta belas kasihan} mereka meminta agar dikembalikan kepada sesuatu yang mereka sukai yaitu keringanan azab tersebut bagi mereka {maka mereka bukanlah orang yang pantas dikasihani} orang-orang yang diterima alasannya dan dikabulkan apa yang mereka inginkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “jika mereka bersabar, maka nerakalah tempat diam mereka,” dan tidak akan ada kesanggupan ataupun kesabaran untuk menanggungnya. Setiap kondisi dimungkinkan untuk bisa disikapi dengan sabar, namun neraka tidak mungkin sabar atasnya. Bagaimana mungkin bisa bersabar atas neraka yang pansanya makin dahsyat dan panasnya melebihi panasnya api di dunia sampai lebih dari tujuh puluh kali lipat, dan didihan airnya pun sangat dahsyat, bau busuk nanah yang bercampur darah yang ada di dalamnya pun makin bertambah, air dinginnya berlipat-lipat derajat, belenggu dan rantai pengikatnya pun amat sangat besar, alat-alat cambuknya besar-besar, para petugasnya sangat kasar, mereka sama seklai tidak mempunyai belas kasih, dan yang terakhir adalah kemurkaan Allah yang Mahaperkasa. Jawaban Allah ketika mereka menyeruNya dan meminta keselamatan kepadaNYa adalah:”tinggalah dengan hina di dalamnya, dan janganlah kamu berbicara dengan aku,” (al-mu’minun:108) “dan jika mereka mengemukakan alasan-alasan,” maksudnya, mereka minta agar celaan dilepaskan dari mereka, lalu dikembalikan kedunia untuk memulai amal perbuatan yang baru, “maka tidaklah mereka termasuk orang-orang yang diterima alasannya.” Karena waktu sudah berlalu, mereka telah diberi usia cukup untuk mengambil pelajaran,dan mereka pun telah didatangi oleh pemberi peringatan(rasul) hujjah mereka pun sudah terputus, dan disisi lain alasan yang mereka kemukakan adalah dusta bagi mereka, sebab kalau mewreka dikembalikan ke dunia, tentu mereka akan kembali pada apa-apa yang dilarang. Sesungguhnya mereka benar-benar pendusta."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 24: (Jika mereka bersabar) menderita azab (maka nerakalah tempat tinggal) tempat kediaman (bagi mereka, dan jika mereka mengemukakan alasan-alasan) maksudnya, jika mereka meminta kerelaan (maka tidaklah mereka termasuk orang-orang yang diterima alasannya) yakni orang-orang yang tidak mendapat kerelaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga tidak ada lagi kesabaran bagi mereka. Setiap keadaan masih bisa diberlakukan kesabaran, akan tetapi untuk menghadapi neraka maka tidak akan bisa bersabar. Bagaimana seseorang dapat bersabar terhadap api yang sangat panas yang diberi kekuatan 69 kali api di dunia (sebagaimana dalam hadits riwayat Muslim), minumannya air mendidih dan ghassaq (nanah penghuni neraka atau air yang sangat dingin), alat pukul untuk memukul penghuni neraka begitu besar, para penjaganya kasar yang sudah tidak memiliki rasa kasihan lagi kepada mereka, dan diakhiri dengan kemurkaan Allah serta firman-Nya ketika mereka memohon pertolongan kepada-Nya, “Hinalah di dalamnya dan jangan berbicara lagi dengan-Ku.” Dengan diberikan kesempatan hidup lagi di dunia agar mereka dapat memulai amal yang baru. Karena telah habis waktunya, dan lagi ketika mereka di dunia, mereka telah diberi waktu yang panjang yang biasanya manusia sadar, ditambah dengan datangnya pemberi peringatan kepada mereka dan hujjah telah tegak kepada mereka. Kalau pun mereka dikasihani dengan dikembalikan ke dunia, niscaya mereka akan melakukan hal yang sama, dan sesungguhnya mereka benar-benar dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 24",
    "description": "Agar terasa betapa besar murka Allah terhadap musuh-Musuh-Nya itu, maka pembicaraan tidak ditujukan kepada mereka, karena mereka tidak layak lagi untuk diajak bicara, tetapi dikatakan bahwa meskipun mereka bersabar atau menahan rasa pedih atas azab neraka, maka memang yang pantas nerakalah yang menjadi tempat tinggal mereka, dan jika mereka minta belas kasihan agar diampuni dan diringankan siksanya, maka mereka itu tidak termasuk orang yang pantas dikasihani untuk diberi ampunan dan keringanan siksa. 25. Setelah pada ayat-ayat yang lalu Al-Qur'an memberi kecaman terhadap para pendurhaka musyrikin mekah dan siapa pun yang sama dengan mereka, pada ayat-ayat berikut Al-Qur'an menjelaskan lebih jauh sebab kedurhakaan itu. Dan kami tetapkan bagi mereka para pendurhaka itu, teman-teman, yang sifat dan perangainya sama dengan mereka, yakni memuji-Muji apa saja yang ada di hadapan mereka, yakni kelezatan duniawi, dan yang ada di belakang mereka, yakni kehidupan akhirat yang mereka ingkari. Dan oleh sebab itu, tetaplah atas mereka putusan, yakni azab, bersama umat-umat yang terdahulu sebelum mereka, dari golongan jin dan manusia. Sungguh, mereka semua para pendurhaka itu, adalah orang-orang yang benar-benar menderita kerugian."
  }
]