[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menyiapkan untuk orang-orang zhalim yang ingkar itu kawan-kawan yang rusak dari setan jin dan manusia, lalu para setan itu menghiasi perbuatan buruk mereka di dunia, dan mengajak mereka kepada kenikmatan dan syahwatnya yang haram, serta membuat mereka lalai terhadap kehidupan akhirat yang menanti mereka, sehingga mereka pun melupakannya dan tidak mengingatnya, para setan itu mengajak mereka untuk mendustakan hari kebangkitan, maka dengan itu mereka berhak masuk neraka bersama umat-umat terdahulu dari kalangan jin dan manusia yang kafir. Sesungguhnya mereka adalah orang-orang yang merugi (dalam) amal perbuatan mereka di dunia, dan terhadap diri serta keluarga mereka pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Kami mengirimkan kepada orang-orang kafir itu rekan-rekan dari setan yang menempel mereka, maka rekan-rekan dari setan itu menghiasi bagi mereka kekufuran, kemaksiatan, pengingkaran kepada kebangkitan dan pembalasan, maka azab pun berlaku atas mereka bersama umat-umat yang telah berlalu dari kalangan jin dan manusia. Sesungguhnya mereka adalah orang-orang yang merugi di mana mereka merugikan diri dan keluarga mereka pada hari Kiamat dengan masuk ke dalam api Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dan Kami tetapkan bagi orang-orang zalim, teman-teman dari golongan jin dan manusia yang suka berbuat kerusakan, yang menggoda dan menghiasi perbuatan-perbuatan buruk kepada mereka, dan menjadikan mereka lupa kehidupan akhirat; sehingga mereka layak mendapat azab seperti umat-umat terdahulu dari golongan jin dan manusia yang menentang Allah. Mereka adalah orang-orang yang merugi terhadap diri dan amalan mereka di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَقَيَّضْنَا لَهُمْ قُرَنَآءَ (Dan Kami tetapkan bagi mereka teman-teman) Yakni Kami berikan mereka setan-setan yang menjadi teman mereka sehingga setan-setan itu akan menyesatkan mereka. فَزَيَّنُوا۟ لَهُم مَّا بَيْنَ أَيْدِيهِمْ(yang menjadikan mereka memandang bagus apa yang ada di hadapan mereka) Yakni memandang baik urusan duniawi dan syahwatnya, dan setan-setan itu menjerumuskan mereka kepada kemaksiatan, serta mengindahkan perilaku mereka yang tidak menghiraukan akhirat sehingga mereka mengatakan tidak ada hari kebangkitan, hisab, surga, maupun neraka. وَحَقَّ عَلَيْهِمُ الْقَوْلُ(dan tetaplah atas mereka keputusan azab) Yakni ditetapkan mereka azab. فِىٓ أُمَم(pada umat-umat) Yakni umat-umat yang kafir. قَدْ خَلَتْ(yang terdahulu) Yang telah berlalu. مِن قَبْلِهِم مِّنَ الْجِنِّ وَالْإِنسِ (sebelum mereka dari jinn dan manusia) Di atas kekafiran. إِنَّهُمْ كَانُوا۟ خٰسِرِينَ (sesungguhnya mereka adalah orang-orang yang merugi) Yakni orang-orang yang merugikan diri mereka sendiri akibat mendustakan para rasul dan keburukan amalan mereka; dan mereka tidak mendapat keuntungan apapun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Kami mempersiapkan dan menyerahkan untuk mereka itu pendamping-pendamping dari golongan setan manusia dan jin seperti sahabat akibat penyimpangan mereka dari kebenaran. Para pendamping itu menghiasi mereka dengan kesenangan dunia yang diharamkan, kekufuran dan kesesatan. Para pendamping itu juga menghiasi mereka dengan urusan akhirat bahwa sesungguhnya hari kebangkitan, penghisaban, dan azab yang diperuntukkan untuk mereka itu tidak ada, sebagaimana umat-umat terdahulu sebelum mereka dari golongan jin dan manusia yang bersikeras atas kekufuran sampai mati. Sesungguhnya mereka merugi akibat pendustaan dan kemaksiatan mereka. Maknanya sebagai bentuk pembenaran karena mereka pantas menerima azab itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menetapkan} Kami menyediakan {bagi mereka teman-teman} teman-teman yang menemani yaitu setan {yang membuat terasa indah} yang membuat bagus {apa saja yang ada di hadapan mereka} berupa perkara dunia dengan mengikuti syahwat {dan di belakang mereka} berupa perkara akhirat sehingga mengajak mereka untuk mendustakannya {Tetaplah atas mereka putusan itu} maka pastilah azab itu atas mereka {bersama umat-umat yang terdahulu} telah berlalu {sebelum mereka dari golongan jin dan manusia. Sesungguhnya mereka adalah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “dan kami tetapkan” bagi mereka orang-orang yang zhalim lagi mengingkari kebenaran itu, “teman-teman,” dari bangsa setan, sebagaimana difirmankan Allah “tidakakh kamu lihat, bahwasannya kami telah mengirim setan-setan itu kepada orang-orang kafir untuk menghasut mereka membuat maksiat dengan sungguh-sungguh?” (Maryam:83) Maksudnya, menyeret mereka kepada perbuatan-perbuatan maksiat dan merayu mereka disebabkan bujukan mereka.”menjadikan mereka memandang bagus apa yang ada dihadapan dan belakang mereka.\" dunia mereka percantik di pandangan mata mereka, dan setan pun menyeru mereka untuk memperoleh kelezatan dan kenikmatannya yang diharamkan, sehingga mereka terpedaya, lalu mereka berani melakukan maksiat-maksiat terhadap Allah, dan mereka menempuh cara-cara apa sajan yang mereka suka untuk memerangi Allah dan rasulNya. Sedangkan terhadap alam akhirat, setan-setan berhasil menjadikan mereka memandangnya tidak mungkin terjadi, dan setan-setan berhasil membuat mereka lupa kepadanya. Dan kadang-kadang setan membisikkan syubhat kepada mereka bahwa akhirat itu tidak akan pernah ada, sehingga rasa takut kepada alam akhirat tersingkir diri di dalam hati merreka. Kemudian setan-setan mengiring mereka kepada keafiran, berbagai bid’ah, dan maksiat. Pemberian kekuasaan kepada setan dan penetapan qarin (teman) adalah berasal dari Allah bagi setan-setan yang mendustakan, disebabkan mereka berpaling dari dzikrillah, ayat-ayatnya, dan disebabkan kekafiran mereka terhadap kewbenaran, sebagaimaan dikatakan oleh Allah, “barangsiapa yang berpaling dari pengajaran (Rabb) yang Maha pemurah (al-qur’an), kami adakan baginya setan (yang menyesatkan), maka setan itulah yang menjadi teman yang sellau menyertainya. Dan sesungguhnya setan-setan itu benar-benar menghalangi mereka dari jalan yang benar dan mereka menyangka bahwa mereka mendapat petunjuk,” (az-zuhruf:36-37) “dan tetaplah atas mereka keputusan,” yakni, maka pastilah atas mereka dan turunlah ketetapan qadha dan qadar siksaan bagi mereka, “pada” sederet “umat-umat yang terdahulu sebelum mereka, dari jin dan manusia; sesungguhnya mereka adalah orang-orang yang merugi,” merugikan agama dan akhirat mereka. Dan siapa yang merugi, maka pasti menjadi hina, sengsara dan diazab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 25: (Dan Kami tetapkan) Kami tentukan (bagi mereka teman-teman) dari kalangan setan-setan (yang menjadikan mereka memandang bagus apa yang ada di hadapan mereka) yaitu perkara duniawi dan memperturutkan nafsu syahwat (dan di belakang mereka) yaitu perkara akhirat, melalui perkataan mereka, bahwa tidak ada yang namanya hari berbangkit dan hari hisab itu (dan tetaplah atas mereka keputusan azab) sebagaimana yang telah diungkapkan oleh ayat yang lain, yaitu firman-Nya, \"Sesungguhnya Aku akan penuhi neraka Jahanam...\" (Q.S. As-Sajdah, 13) (pada) kalangan (umat-umat terdahulu) yang telah dibinasakan (sebelum mereka dari jin dan manusia, sesungguhnya mereka adalah orang- orang yang merugi.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini sebagaimana firman Allah Ta’ala, “Tidakkah kamu melihat, bahwa Kami telah mengirim setan-setan kepada orang-orang kafir untuk menghasung mereka berbuat maksiat dengan sungguh-sungguh?, (Terj. Maryam: 83) Yang dimaksud dengan yang ada di hadapan ialah hawa nafsu dan kelezatan di dunia yang sedang dicapai, sedang yang dimaksud dengan di belakang mereka ialah angan-angan dan cita-cita yang tidak dapat dicapai. Ada pula yang menafsirkan, bahwa yang ada di hadapan mereka adalah dunia, sedangkan yang ada di belakang mereka adalah akhirat, yakni setan-setan menghiasi dunia di hadapan mereka sehingga mereka tergoda dan jatuh mengerjakan berbagai maksiat dan mereka mengerjakan apa saja yang mereka lakukan berupa menentang Allah dan Rasul-Nya. Demikian pula setan-setan itu menghias akhirat mereka, sehingga mereka anggap masih jauh serta menjadikan mereka lupa kepadanya, bahkan terkadang setan-setan itu melemparkan berbagai syubhat bahwa akhirat tidak akan terjadi, sehingga hilanglah rasa takut dari hati mereka dan mereka berani mengerjakan kekufuran, kebid’ahan dan kemaksiatan. Pemberian kekuasaan kepada setan untuk menguasai orang-orang yang mendustakan adalah disebabkan mereka berpaling dari mengingat Allah dan ayat-ayat-Nya serta menolak kebenaran sebagaimana firman Allah Ta’ala, “Barang siapa yang berpaling dari pengajaran Tuhan Yang Maha Pemurah (Al Quran), Kami adakan baginya setan (yang menyesatkan) Maka setan itulah yang menjadi teman yang selalu menyertainya.-- Dan di antara tanda-tanda kekuasaan-Nya ialah malam, siang, matahari dan bulan. Janganlah kamu sembah matahari maupun bulan, tetapi sembahlah Allah yang menciptakannya, jika Dialah yang kamu sembah.” (Terj. Az Zukhruf: 36-37) Dunia dan akhiratnya, dan jika sudah rugi maka pasti akan hina, sengsara dan akan diazab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 25",
    "description": "Setelah pada ayat-ayat yang lalu Al-Qur'an memberi kecaman terhadap para pendurhaka musyrikin mekah dan siapa pun yang sama dengan mereka, pada ayat-ayat berikut Al-Qur'an menjelaskan lebih jauh sebab kedurhakaan itu. Dan kami tetapkan bagi mereka para pendurhaka itu, teman-teman, yang sifat dan perangainya sama dengan mereka, yakni memuji-Muji apa saja yang ada di hadapan mereka, yakni kelezatan duniawi, dan yang ada di belakang mereka, yakni kehidupan akhirat yang mereka ingkari. Dan oleh sebab itu, tetaplah atas mereka putusan, yakni azab, bersama umat-umat yang terdahulu sebelum mereka, dari golongan jin dan manusia. Sungguh, mereka semua para pendurhaka itu, adalah orang-orang yang benar-benar menderita kerugian. 26. Contoh dari teman-teman para pendurhaka itu dapat dilihat pada perbuatan orang-orang yang melarang mendengarkan bacaan Al-Qur'an. Dan orang-orang yang kafir berkata satu sama lain di antara sesama mereka, 'janganlah kamu mendengarkan dengan cara apa pun bacaan Al-Qur'an ini, dan buatlah kegaduhan terhadapnya dengan cara berteriak-teriak atau bertepuk tangan sehingga bacaan itu tidak bisa didengar, agar dengan berbuat kegaduhan itu kamu dapat mengalahkan bacaan Al-Qur'an itu."
  }
]