[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir saling berwasiat diantara mereka, “Jangan mendengarkan al-Qur’an ini dan jangan menaatinya, jangan tunduk kepada perintah-perintahnya, buatlah kegaduhan dengan meninggakan siulan, suara dan teriakan kalian di depan Muhammad bila dia membaca al-Qur’an, agar kalian bisa mengalahkannya, lalu dia menghentikan bacaannya, maka kita menang atasnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Orang-orang kafir, sebagian dari mereka berpesan kepada sebagian lainnya manakala mereka tidak kuasa menghadapi kebenaran dengan hujah, “Jangan dengarkan Al-Qur`ān yang dibacakan oleh Muhammad kepada kalian, jangan mengikuti isinya, berteriaklah dan buatlah kegaduhan saat ia dibacakan, semoga dengan itu kalian bisa mengalahkannya, lalu dia pun tidak membacakannya lagi dan meninggalkan dakwahnya, dengan itu kalian bisa terbebas darinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Para pemimpin orang-orang kafir berkata kepada para pengikut mereka di Makkah: “Janganlah kalian mendengar Muhammad saat dia membaca al-Qur’an, dan buatlah kebisingan saat dia membacanya, agar orang yang mendengarnya tidak terpengaruh dan agar kalian dapat mengalahkan agamanya.” Sungguh Kami akan menimpakan azab yang berat bagi orang-orang kafir, dan di akhirat Kami akan membalas mereka dengan balasan yang lebih buruk dari dosa yang mereka perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَقَالَ الَّذِينَ كَفَرُوا۟ لَا تَسْمَعُوا۟ لِهٰذَا الْقُرْءَانِ (Dan orang-orang yang kafir berkata: “Janganlah kamu mendengar dengan sungguh-sungguh akan Al Quran ini) Yakni sebagian mereka berkata kepada sebagian lainnya: janganlah kalian mendengarkannya. Atau janganlah kalian mentaatinya. وَالْغَوْا۟ فِيهِ(dan buatlah hiruk-pikuk terhadapnya) Yakni hadapilah dia dengan permainan dan kebatilan. Atau tinggikanlah suara kalian agar mengganggu orang yang membacanya, dan ganggulah dia dengan siulan, tepuk tangan, dan kebisingan. لَعَلَّكُمْ تَغْلِبُونَ(supaya kamu dapat mengalahkan mereka”.) Agar kalian mengalahkan mereka sehingga mereka dapat diam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Ketika mendengarkan Al-Qur’an dari Nabi SAW, orang-orang kafir itu berkata satu sama lain: “Kalian jangan mendengar bacaan Al-Qur’an ini dan bantahlah dengan omong kosong yang tidak bermakna, berupa hiruk-pikuk yang kacau dan ramai sehingga Al-Qur’an itu tidak memberikan pengaruh kepada orang yang mendengarnya atau supaya hiruk pikuk itu lebih ramai daripada Muhammad dan para sahabatnya sehingga mereka terdiam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir berkata,“Janganlah mendengarkan Al-Qur’an ini dan buatlah kegaduhan terhadapnya} dan tinggikanlah suara kalian dengan bersiul, berteriak, dan berbuat kegaduhan ketika ada bacaan Al-Qur’an {agar kalian dapat mengalahkan} dengan harapan agar kalian bisa mengalahkan nabi Muhammad ketika membaca Al-Qur’an, sehingga tidak tampak dan sampai pada hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah mengabarkan tentang berpalingnya orang-orang kafir dari al-qur’an dan saling pesan memesan mereka untuk hal ini, seraya berfirman,”dan orang-orang yang kafir berkata,’janganlah kamu mendengar al-qur’an ini’.” Maksudnya, palingkanlah pendengaran kalian darinya. Janganlah sekali-kali kalian menoleh kepadanya, atau mendengarkannya dan mendengarkan orang yang datang membawanya. Lalu jika kebetulan kalian telah mendengarnya atau kalian telah mendengar ajakan kepada hukum-hukum yang dikandungnya, maka berbutalah sia-sia kepadanya. Maksudnya, ucapkanlah perkataan yang tidak ada gunanya padanya. Sebab sesunggguhnya di dalamnya terkandung hal yang berbahaya. Jangan kalian berikan kesempatan, dengan kemapuan kalian, kepada seseorang untuk membicarakan al-qur’an itu kepada kalian, membacakan lafazh-lafazh dan makna-makananya. Inilah bahasa oral mereka, sedangkan bahasa realitas mereka adalah sikap berpaling dari al-qur’an ini. “supaya kamu,” yakni, jika kalian melakukan semua itu, “dapat mengalahkan,” Ini adalah sebuah kesaksian dari musuh. Kebenaran yang paling jelas adalah kebenaran yang diberikan kesaksiannya oleh musuh. Sebab, mereka tidak menentukan kemenangan mereka terhadap orang yang membawa kebenaran itu dan saling berpesan untuk berpaling darinya. Mafhum (arti) perkataan mereka adalah bahwa jika mereka tidak berkata sia-sia tentangnya, dan justru mendengarkan dan mengarahkan perhatian kepadanya, maka mereka tidak akan bisa mengalahkan. Hal itu karena kebenaran pasti menang, tidak akan bisa dikalahkan. Hal ini diketahui oleh mereka yang berpegang kepada kebenaran dan oleh musuh-musuhnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 26: (Dan orang-orang yang kafir berkata) sewaktu Nabi saw. membaca Alquran, (\"Janganlah kalian mendengar bacaan Alquran ini dan buatlah hiruk-pikuk terhadapnya) yakni buatlah suara gaduh dan hiruk-pikuk untuk mengganggu bacaannya, dan mereka memang membuat hiruk-pikuk bilamana Nabi membaca Alquran (supaya kalian dapat mengalahkan\") bacaannya lalu ia menjadi diam tidak membaca Alquran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang berpalingnya orang-orang kafir dari Al Qur’an dan saling berwasiatnya mereka untuk itu. Ketika Nabi shallallahu 'alaihi wa sallam membacakan Al Qur’an. Yakni palingkanlah pendengaranmu dan janganlah menoleh kepadanya, jangan mendengarkannya dan jangan memperhatikan orang yang membawanya. Jika ternyata berbetulan kamu mendengarnya atau kamu mendengar seruan kepadanya, maka buatlah kegaduhan terhadapnya. Sehingga Beliau berhenti membacakan. Ini merupakan persaksian dari musuh, bahwa apabila mereka mau mendengarnya tentu mereka akan kalah karena apa yang disebutkan dalam Al Qur’an adalah kebenaran; sejalan dengan akal dan fitrah mereka. Dengan demikian, pantaslah mereka disesatkan Allah karena niat mereka memang buruk, tidak mau mencari yang hak bahkan menghalangi manusia daripadanya, dan pantaslah mereka mendapat hukuman yang berat, dan benarlah Allah, bahwa Dia tidak pernah berbuat zalim kepada seorang pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 26",
    "description": "Contoh dari teman-teman para pendurhaka itu dapat dilihat pada perbuatan orang-orang yang melarang mendengarkan bacaan Al-Qur'an. Dan orang-orang yang kafir berkata satu sama lain di antara sesama mereka, 'janganlah kamu mendengarkan dengan cara apa pun bacaan Al-Qur'an ini, dan buatlah kegaduhan terhadapnya dengan cara berteriak-teriak atau bertepuk tangan sehingga bacaan itu tidak bisa didengar, agar dengan berbuat kegaduhan itu kamu dapat mengalahkan bacaan Al-Qur'an itu. 27. Menanggapi saran para pendurhaka itu kepada teman-temannya agar membuat kegaduhan ketika Al-Qur'an sedang dibacakan, maka Allah akan menimpakan azab kepada mereka. Firman Allah, 'maka sungguh, akan segera kami timpakan azab yang keras serta siksa yang pedih kepada orang-orang yang kafir itu, dan di samping itu sungguh akan kami beri balasan kepada mereka dengan seburuk-buruk balasan di akhirat nanti terhadap apa yang telah mereka kerjakan di dunia."
  }
]