[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan yang diberikan kepada orang-orang kafir itu adalah balasan untuk musuh-musuh Allah, yaitu neraka. Ia adalah rumah langgeng dan abadi bagi mereka, sebagai balasan atas pengingkaran mereka terhadap ayat-ayat dan hujjah-hujjah Kami di dunia. Ayat ini menunjukkan besarnya kejahatan orang yang memalingkan manusia dari al-Qur’an yang agung dan menghalang-halangi mereka sehingga mereka tidak bisa merenungkannya dan mengambil petunjuk darinya dengan sarana apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Balasan tersebut adalah balasan bagi musuh-musuh Allah yang kafir kepada-Nya dan mendustakan rasul-rasul-Nya, yaitu Neraka. Mereka kekal di dalamnya, azab yang tidak terputus selama-lamanya, sebagai balasan atas pengingkaran mereka terhadap ayat-ayat Allah dan kekufuran mereka kepadanya sekalipun ia jelas dan hujahnya kuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Balasan yang berat bagi para musuh Allah dari kalangan orang-orang kafir dan pelaku kemaksiatan itu berupa neraka., mereka akan tinggal di neraka selamanya karena mereka telah mendustakan ayat-ayat dan hujjah-hujjah Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. لَهُمْ فِيهَا دَارُ الْخُلْدِ ۖ (mereka mendapat tempat tinggal yang kekal di dalamnya) Yakni tempat tinggal yang kekal dan tidak akan berakhir. جَزَآءًۢ بِمَا كَانُوا۟ بِـَٔايٰتِنَا يَجْحَدُونَ(sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami) Yakni mereka dibalas akibat keingkaran mereka terhadap al-Qur’an dan mengingkarinya bahwa itu dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Balasan itu adalah balasan untuk musuh-musuh Allah. Mereka adalah orang-orang kafir dan orang-orang yang berbuat maksiat. Balasan mereka adalah neraka. Bagi mereka itu neraka Jahanam sebagai tempat tinggal yang abadi. Mereka dibalas akibat pendustaan mereka terhadap ayat-ayat Al-Qur’an"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu adalah balasan musuh-musuh Allah. Bagi mereka itu tempat tinggal yang kekal di dalamnya} tempat tinggal yang tidak mungkin berpindah dari sana {sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “demikianlah balasan terhadap musuh-musuh Allah,” yaitu orang-orang yang memerangiNya dan memerangi para kekasihNya dengan melakukan kekafiran, mendustakan, mendebat, dan menentang, “yaitu neraka;mereka mendapat tempat tinggal yang kekal di dalamnya.” Maksudnya, kekal selamanya, tidak sesaat pun azab dihentikan dari mereka dan tidak pula mereka ditolong. Yang demikian itu adalah “sebagai pembalasan atas keingkaran mereka terhadap ayat-ayat kami,” sebab, ia adalah ayat-ayat yang sangat jelas sekali dan merupakan bukti-bukti yang pasti yang memberikan keyakinan. Maka kezhaliman terbesar dan sikap menentang yang paling berat adalah mengingkari dan kafir terhadpnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 28: (Demikianlah) azab yang keras itu dan pembalasan yang paling buruk itu (balasan terhadap musuh-musuh Allah) dapat dibaca Jazaa-u A'daaillaahi atau Jazaa-uwa`daaillaahi, yaitu dapat dibaca Tahqiq dan Tas-hil (yaitu neraka) menjadi 'Athaf bayan dari lafal Jazaa-u dan berfungsi menjelaskan maknanya (mereka mendapat tempat tinggal yang kekal di dalamnya) tempat menetap yang tidak akan dipindahkan lagi daripadanya (sebagai pembalasan) dinashabkan karena menjadi Mashdar dari Fi'ilnya yang diperkirakan keberadaannya (dari sikap mereka terhadap ayat-ayat Kami) yakni Alquran (yang mereka ingkari.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni azab yang keras dan balasan yang paling buruk itu. Yaitu mereka yang menentang Allah dan memerangi para wali-Nya dengan sikap kufur, mendustakan, mendebat dan memerangi secara fisik. Azab yang ditimpakan kepada mereka tidak akan diringankan meskipun sesaat, dan mereka tidak akan ditolong. Padahal ayat-ayat-Nya merupakan ayat-ayat yang jelas, dalil-dalilnya qath’i (pasti) dan membuahkan keyakinan. Oleh karena itu, merupakan kezaliman dan kekerasan yang paling besar adalah mengingkari ayat-ayat yang begitu jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 28",
    "description": "Demikianlah, siksa yang seburuk-buruknya itu merupakan balasan terhadap musuh-Musuh Allah yaitu neraka; mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka yang terus menerus terhadap ayat-ayat kami. 29. Berkaitan erat dengan siksa yang menanti orang-orang kafir itu di neraka, ayat ini menggambarkan permintaan mereka agar diperlihatkan siapa yang telah menyesatkan mereka. Dan ketika sudah berada di neraka, orang-orong yang kafir berkata, 'ya tuhan kami, perlihatkanlah kepada kami dua golongan makhluk yang telah menyesatkan dan mengakibatkan kami terjerumus masuk neraka ini, yaitu golongan jin dan manusia, agar kami letakkan mereka keduanya di bawah telapak kaki kami, agar kedua golongan itu menjadi orang yang paling bawah atau hina. '."
  }
]