[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang berkata, “Tuhan kami adalah Allah semata, tidak ada sekutu bagiNya,” kemudian mereka beristiqamah di atas syariatNya, maka para malaikat turun kepada mereka saat kematian dan berkata kepada mereka, “Jangan takut mati dan apa yang sesudahnya, jangan bersedih atas perkara-perkara dunia yang kalian tinggalkan, dan berbahagialah dengan surga yang dijanjikan kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Sesungguhnya orang-orang yang berkata, “Rabb kami adalah Allah, tidak ada Rabb bagi kami kecuali Allah,” mereka istikamah menjalankan perintah-Nya dan menjauhi larangan-Nya, maka para Malaikat turun kepada mereka saat mereka menghadapi ajal dengan mengatakan, “Jangan takut kepada kematian dan kejadian sesudahnya, jangan bersedih atas dunia yang kalian tinggalkan, berbahagialah dengan Surga yang dijanjikan kepada kalian di dunia karena iman dan amal saleh kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-32. Allah memuji orang-orang beriman dan memberi mereka kabar gembira berupa kebahagian dunia dan akhirat: Orang-orang yang berkata dengan jujur, “Tuhan kami hanyalah Allah, tiada sekutu bagi-Nya”, kemudian mereka senantiasa menjalankan kewajiban; maka malaikat akan turun kepada mereka saat ajal tiba dan saat di alam kubur untuk menyampaikan kabar gembira: “Janganlah kalian takut dari apa yang akan kalian hadapi, dan janganlah kalian bersedih atas apa yang telah berlalu. Bergembiralah dengan surga yang telah Allah janjikan kepada kalian melalui lisan para rasul. Kami adalah para penolong kalian di nunia, dan kami bersama kalian di akhirat. Di dalam surga kalian akan mendapatkan segala kenikmatan yang kekal yang kalian inginkan dan kedudukan yang kalian minta; sebagai kemuliaan dan sambutan dari Tuhan Yang Maha Mengampuni dosa-dosa dan Maha Mengasihi kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. إِنَّ الَّذِينَ قَالُوا۟ رَبُّنَا اللهُ (Sesungguhnya orang-orang yang mengatakan: “Tuhan kami ialah Allah”) Yakni Allah semata, tidak ada sekutu bagi-Nya. ثُمَّ اسْتَقٰمُوا۟( kemudian mereka meneguhkan pendirian mereka) Yakni istiqamah di atas tauhid, dan tidak mencari tuhan selain Allah, serta istiqamah di atas perintah dan syari’at Allah; sehingga mereka melakukan ketaatan dan menjauhi kemaksiatan hingga mati. تَتَنَزَّلُ عَلَيْهِمُ الْمَلٰٓئِكَةُ(maka malaikat akan turun kepada mereka) Yakni turun dari sisi Allah dengan membawa kabar gembira yang mereka inginkan. Mujahid mengatakan bahwa itu terjadi saat kematian. Dan Qatadah mengatakan bahwa itu terjadi ketika mereka dibangkitkan dari kubur mereka. أَلَّا تَخَافُوا۟( dengan mengatakan: “Janganlah kamu takut) terhadap urusan akhirat yang akan kalian hadapi. وَلَا تَحْزَنُوا۟( dan janganlah merasa sedih) Terhadap urusan dunia yang kalian tinggalkan berupa istri, anak, dan harta. وَأَبْشِرُوا۟ بِالْجَنَّةِ الَّتِى كُنتُمْ تُوعَدُونَ(dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu”) Yakni yang dijanjikan kepada kalian di dunia. Sebab kalian akan memasukinya dan tinggal di dalamnya serta kekal dalam kenikmatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Sesungguhnya orang-orang yang berkata: “Tuhan Kami hanyalah Allah. Tiada sekutu bagiNya”, Kemudian mereka meneguhkan jiwa dan terus beristiqamah dalam beramal shalih serta mengikrarkah ketauhidannya, maka para malaikat rahmat akan mendatangi mereka dengan membawa kabar gembira yang menyenangkan ketika mereka mati, berada di kubur dan dibangkitkan darinya. Selayaknya mereka tidak khawatir tentang apa yang akan mendatangi mereka berupa urusan-urusan akhirat dan tidak bersedih tentang apa yang telah lewat dari mereka berupa urusan-urusan dunia. Dikatakan kepada mereka: “Bergembiralah kalian dengan surga yang dijanjikan untuk kalian di dunia melalui lisan para rasul. Sesungguhnya kalian telah sampai kepadanya”. Ayat ini diturunkan untuk Abu Bakar As-Siddiq yang berkata: “Tuhan kami hanyalah Allah. Tiada sekutu bagiNya. Dan Muhammad SAW adalah hamba dan utusanNya” Lalu dia beristiqamah (dalam beribadah). Lalu orang-orang musyrik berkata: “Tuhan kami adalah Allah dan para malaikat adalah puteri-puteriNya. Mereka adalah penolong-penolong kami di sisi Allah” Kemudian mereka tidak beristiqamah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang berkata,“Tuhan kami adalah Allah” kemudian mereka beristiqamah, maka akan kepada mereka} maka akan turun kepada mereka ketika mati {para malaikat (dengan berkata),“Janganlah takut} terhadap apa yang akan kalian hadapi berupa perkara akhirat {dan janganlah bersedih hati} atas apa yang telah kalian lalui berupa perkara dunia {serta bergembiralah dengan surga yang telah dijanjikan kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Allah mengabarkan tentang para kekasihNya, dan di dalamnya terkandung pemberian semangat kepada mereka dan himbauan untuk meneladani mereka, seraya berfirman,”sesungguhnya orang-orang yang mengatakan,’Rabb kami ialah Allah’ kemudian mereka meneguhkan pendirian mereka,” maksudnya, mengakui, mengucapkan dan ridha dengan rububiyah Allah serta berserah diri kepadaNya, lalu mereka istiqamah di atas jalan yang lurus itu, baik secara teori maupun praktik, maka mereka memperoleh berita gembira di dalam kehidupan dunia ini dan di akhirat nanti. “maka malaikat akan turun kepada mereka,” maksudnya, para malaikat yang mulia. Kedatangan para malaikat itu kepada mereka silih berganti seraya menyampaikan berita gembira kepada mereka saat menjelang kematian, “janganlah kamu merasa takut,” terhadap perkara yang akan kalian hadapi, “dan janganlah kamu merasa sedih,” atas apa-apa yang telah berlalu. Segala yang tidak dikehendaki yang telah berlalu dan yang akan datang disingkirkan dari mereka. “dan bergembiralah kamu dengan surga yang telah dijanjikan Allah kepadamu,” karena ia sudah pasti untuk kalian, dan janji Allah itu pasti ditepati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 30: (Sesungguhnya orang-orang yang mengatakan, \"Rabb kami adalah Allah,\" kemudian mereka meneguhkan pendirian mereka) dalam ajaran tauhid dan lain-lainnya yang diwajibkan atas mereka (maka malaikat akan turun kepada mereka) sewaktu mereka mati (\"Hendaknya kalian jangan merasa takut) akan mati dan hal-hal yang sesudahnya (dan jangan pula kalian merasa sedih) atas semua yang telah kalian tinggalkan, yaitu istri dan anak-anak, maka Kamilah yang akan menggantikan kedudukan mereka di sisi kalian (dan bergembiralah dengan surga yang telah dijanjikan Allah kepada kalian.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang para wali-Nya, dimana di dalamnya terdapat dorongan agar mengikuti mereka. Yakni istiqamah di atas tauhid dan kewajiban lainnya. Mereka mengakui dan mengatakan dengan ridha bahwa Tuhannya adalah Allah, berserah diri kepada perintah-Nya dan istiqamah di atas jalan yang lurus baik yang berupa ilmu maupun amal, maka mereka –sebagaimana diterangkan dalam ayat di atas- mendapatkan kabar gembira dalam kehidupan dunia dan akhirat. Menjelang mereka mati. Dengan kematian dan peristiwa setelahnya. Yakni ditiadakan dari mereka sesuatu yang tidak mereka inginkan. Terhadap masa lalu dan terhadap yang telah kamu tinggalkan, seperti anak dan istri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 30",
    "description": "Pada ayat-ayat yang lalu telah dijelaskan adanya teman-teman bagi para pendurhaka yang menjerumuskan mereka ke dalam neraka, maka pada ayat-ayat berikut disajikan kebalikan dari itu, yakni orang-orang beriman yang bersaksi bahwa Allah adalah tuhan mereka. Sesungguhnya orang-orang beriman yang berkata, 'tuhan kami adalah Allah, ' kemudian mereka bermohon kepada Allah agar meneguhkan pendirian mereka beristikamah dalam hidup, maka malaikat-malaikat akan turun kepada mereka yang akan menjadi teman mereka dengan berkata, 'janganlah kamu merasa takut menghadapi masa datang, dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan memperoleh surga yang telah dijanjikan Allah kepadamu melalui rasul-Nya. '31. Demikianlah para malaikat menenangkan orang-orang beriman dan membuat mereka lebih merasa nyaman. Para malaikat itu berkata, 'kami, atas perintah Allah, menjadi pelindung-pelindungmu dan akan selalu siap membantu kamu dalam kehidupan dunia dan demikian pula dalam kehidupan akhirat. Maka di dalamnya, yakni di dalam surga ini, kamu memperoleh apa yang kamu inginkan dalam bentuk berbagai kenikmatan, dan memperoleh apa saja yang pernah kamu minta dulu di dunia."
  }
]