[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-32. Para malaikat berkata kepada mereka, “Kami adalah penolong-penolong kalian dalam kehidupan dunia, kami meluruskan langkah kalian dan menjaga kalian dengah perintah dari Allah, demikian pula di akhirat, kami tetap bersama kalian. Di dalam surga, kalian mendapatkan apa yang diinginkan oleh jiwa kalian dari apa-apa yang kalian pilih, dan juga menyenangkan pandangan mata kalian. Apa pun yang kalian minta, kalian mendapatkannya di depan kalian sebagai jamuan dan kenikmatan untuk kalian dari Allah yang Maha Pengampun terhadap dosa-dosa kalian dan Maha Penyayang kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Kami adalah wali kalian di kehidupan dunia, kami meluruskan langkah kalian dan menjaga kalian, kami adalah wali kalian di kehidupan Akhirat, pertolongan kami kepada kalian terus berlanjut. Di Surga kalian memperoleh apa yang kalian idam-idamkan berupa berbagai kesenangan dan kenikmatan. Di Surga kalian akan mendapatkan semua yang kalian minta dari apa yang kalian hasratkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. نَحْنُ أَوْلِيَآؤُكُمْ فِى الْحَيَوٰةِ الدُّنْيَا وَفِى الْاٰخِرَةِ ۖ (Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat) Yakni Kami yang bertugas menjaga dan membantu kalian dalam urusan dunia dan akhirat. Dan barangsiapa yang penjaganya adalah Allah niscaya dia akan meraih apa yang dia harapkan, dan selamat dari apa yang dia takuti. Pendapat lain mengatakan bahwa para malaikatlah yang mengatakan: “kami adalah para penjaga yang menulis amal kebaikan kalian di dunia dan penolong kalian di akhirat.” Dan para malaikat itu akan memberi mereka kehormatan. وَلَكُمْ فِيهَا مَا تَشْتَهِىٓ أَنفُسُكُمْ(di dalamnya kamu memperoleh apa yang kamu inginkan) Dari segala kenikmatan dan kelezatan. وَلَكُمْ فِيهَا مَا تَدَّعُونَ(dan memperoleh (pula) di dalamnya apa yang kamu minta) Yakni apa yang kalian minta dari segala yang kalian ingini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Para malaikat berkata kepada mereka: “Kami adalah para penolong kalian dalam urusan-urusan kalian. Kami akan menjaga dan membantu kalian dalam urusan yang mengandung kebaikan dan kebenaran di dunia. Kami juga penolong kalian di akhirat dengan syafaat dan kemuliaan sehingga kalian bisa masuk surga. Bagi kalian dalam surga itu ada sesuatu yang dapat menyenangkan diri kalian berupa kenikmatan dan berbagai macam kelezatan. Bagi kalian juga sesuatu yang kalian cari-cari”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamilah pelindung-pelindung kalian} penolong-penolong kalian {dalam kehidupan dunia dan akhirat. Bagi kalian di dalamnya ada apa saja yang kalian sukai dan apa saja yang kalian minta} yang kalian inginkan dan harapkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. dan para malaikat itu berkata kepada mereka untuk meneguhkan hati mereka dan menyampaikan berita gembira, “kamilah pelindung-pelindungmu dalam kehidupan dunia dan di akhirat.” Para malaikat itu menghimbau mereka untuk melakukan kebaikan di dunia dan memperindahkannya bagi mereka, juga menakut-nakuti mereka dari kejahatan dan menjadikannya buruk dalam jiwa mereka, dan mereka juga berdoa kepada Allah untuk mereka, meneguhkan pendirian mereka dalam berbagai musibah dan kesulitan, terutama saat menjelang kematian dan dahsyatnya sakaratul maut, saat dikuburan dan didalam kegelapannya, saat hari kiamat dan praharanya, saat diatas jembatan menuju surga dan saat di dalam surga. Mereka memberikan ucapan selamat atas kehormatan dari Allah yang mereka raih. Para malikat itu masuk menjumpai mereka raih. Para malaikat itu masuk menjumpai mereka dari semua pintu (sambil mengucapankan) “kesejahteraan bagi kalian berkat kesabaran kalian. Maka alangkah baiknya tempat kesudah itu.” (ar-ra’d:24) Dan mereka juga mengatakan, “didalamnya kamu memperoleh,” maksudnya, di surga “apa yang kamu inginkan,” sudah dipersiapkan dan dihidangkan “dan memperoleh pula di dalmnya apa yang kamu minta,” maksudnya, apa saja yang kamu minta dari segala yang digandrungi oleh keinginan kalian dan kalian cari dari berbagai kelezatan dan hal-hal yang merangsang yang belum pernah dilihat mata, didengar telinga dan belum pernah terlintas di dalam hati seorang manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 31: (Kamilah pelindung-pelindung kalian dalam kehidupan dunia) artinya, Kami memelihara kalian di dalamnya (dan di akhirat) maksudnya, Kami akan selalu bersama kalian di akhirat hingga kalian masuk surga (di dalamnya kalian memperoleh apa yang kalian inginkan dan memperoleh pula di dalamnya apa yang kalian minta) berupa semua kenikmatan yang kalian minta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para malaikat juga berkata memberikan keteguhan dan memberikan berita gembira. Yakni kami jaga kamu di dunia, mendorongmu berbuat baik, menghias kebaikan kepadamu dan menakut-nakuti keburukan, meneguhkan kamu ketika mendapatkan musibah dan peristiwa yang ditakuti, khususnya ketika mati dan merasakan sekaratnya, demikian pula ketika kamu di kubur dan mendapatkan kegelapannya, ketika pada hari Kiamat dan peristiwa yang menegangkannya dan kami akan bersama kamu sampai kamu masuk ke surga, dan ketika kamu di surga, kami akan mengucapkan selamat, dan masuk menemui kamu dari setiap pintu sambil mengucapkan, “Saalaamun ‘alaikum bimaa shabartum.” (keselamatan atasmu karena kesabaranmu). Mereka juga akan mengatakan seperti yang disebutkan dalam ayat di atas, “Di dalamnya (surga) kamu memperoleh apa yang kamu inginkan dan memperoleh apa yang kamu minta.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 31",
    "description": "Demikianlah para malaikat menenangkan orang-orang beriman dan membuat mereka lebih merasa nyaman. Para malaikat itu berkata, 'kami, atas perintah Allah, menjadi pelindung-pelindungmu dan akan selalu siap membantu kamu dalam kehidupan dunia dan demikian pula dalam kehidupan akhirat. Maka di dalamnya, yakni di dalam surga ini, kamu memperoleh apa yang kamu inginkan dalam bentuk berbagai kenikmatan, dan memperoleh apa saja yang pernah kamu minta dulu di dunia. 32. Yang demikian itu adalah sebagai penghormatan bagimu dari Allah yang maha pengampun lagi maha penyayang."
  }
]