[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada yang lebih bagus perkataannya daripada seseorang yang mengajak kepada tauhid Allah dan penyembahan kepadaNya semata, lalu dia melakukan amal shalih dan dia berkata, “Sesungguhnya aku termasuk orang-orang Muslim yang tunduk kepada perintah dan syariat Allah.” Ayat ini mengandung dorongan untuk berdakwah kepada Allah, menjelaskan keutamaan para ulama yang mengajak kepada Allah berdasarkan ilmu yang mantap (bashirah) sesuai dengan apa yang dibawa oleh Rasulullah Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Tidak ada seorangpun yang lebih bagus perkataannya dibandingkan orang yang mengajak untuk mentauhidkan Allah dan mengamalkan syariat-Nya, mengerjakan amal saleh yang diridai oleh Rabbnya, dan dia berkata, “Sesungguhnya aku termasuk orang-orang yang berserah diri lagi tunduk kepada Allah.” Barangsiapa melakukan hal itu seluruhnya, maka dia adalah manusia yang paling bagus perkataannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Tidak ada orang yang lebih baik perkataannya daripada orang yang menyeru untuk mengesakan dan mentaati Allah, dan mengerjakan amal shalih, serta berucap: “Aku termasuk orang-orang Islam yang mentaati Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَمَنْ أَحْسَنُ قَوْلًا مِّمَّن دَعَآ إِلَى اللهِ (Siapakah yang lebih baik perkataannya daripada orang yang menyeru kepada Allah) Yakni kepada keesaan dan ketaatan kepada Allah. Inilah perkataan terbaik yang diucapkan seseorang kepada orang lain. وَعَمِلَ صٰلِحًا وَقَالَ إِنَّنِى مِنَ الْمُسْلِمِينَ(mengerjakan amal yang saleh, dan berkata: “Sesungguhnya aku termasuk orang-orang yang berserah diri?”) Yakni berserah diri kepada Tuhan-Ku. Setiap orang yang menjalankan dakwah kepada syariat Allah dan melakukan amal baik dengan mengerjakan kewajiban yang diperintahkan Allah dan menjauhi larangan-Nya serta termasuk orang yang beragama Islam, maka tidak ada yang lebih baik perkataannya darinya dan tidak ada yang lebih terang jalannya serta tidak ada yang lebih besar balasan amalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Tidak ada orang yang lebih baik ucapannya daripada orang yang mengajak agar hanya menyembah Allah dan mengerjakan amal shalih yang diperintahkan olehNya. Dia berkata dengan lantang: “Sesungguhnya aku termasuk orang-orang yang tunduk kepada perintah Allah” Ini merupukan penggabungan antara akidah dan amal. {Man} adalah istifham yang mengandung makna nafi. Maknanya adalah tidak ada satupun yang ucapannya lebih baik. Ayat ini diturunkan untuk Rasulallah SAW dan para sahabatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih baik} tidak ada yang lebih utama {perkataannya daripada orang yang menyeru kepada Allah, mengerjakan kebajikan, dan berkata,“Sesungguhnya aku termasuk orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. ini adalah satu bentuk pertanyaan yang bermakna menafikan sesuatu yang sudah pasti tidak ada. Artinya, tidak seorangpun, “yang lebih baik perkataannya,”ucapan, jalan hidup dan kondisinya “daripada orang yang menyeru kepada Allah,” dengan memberikan pengajaran kepada orang-orang yang bodoh, memberikan nasihat kepada orang-orang yang lali dan berpaling serta berdialog dengan orang-orang yang berpaham menyimpang agar mereka hanya beribadah kepada Allah dengan berbagai bentuk ibadah, menganjurkannya dan memperindahnya semampunya, dan agar mereka berhenti melakukan apa-apa yang Allah larang serta memperburuknya dengan segala cara yang bisa membuat mereka meninggalkannya, terutama adalah mengajak kepada prinsip dinul islam, memperindahnya dan mendebat musuh-musuhnya dengan metode yang terbaik, dan melarang lawan prinsip tersebut, yaitu kekafiran dan syirik, serta mengajak kepada kebaikan dan mencegah yang mungkar. Termasuk dakwah kepada Allah adalah mengajak mereka mencintaiNya dengan cara menjelaskan rincian nikmat-nikmatNya, kemahaluasan kauniaNYa dan kemahasempurnaan rahmatNYa serta menjelaskan sifat-sifat kesempurnaan dan kebesaranNYa. Termasuk bedakwah kepada Allah adalah memberikan motivasi untuk mencai ilmu dan pedoman hidup kitabullah dan Sunnah rasulNya dan menghimbaukannya dengan segala metode yang bisa mengantakan kepada maksud. Dan temasuk dakwah juga adalah mengajak berakhlak mulia dan bebuat ihsan kepada segenap makhluk, membalas oang yang berbuat buruk dengan bebuat baik kepadanya, mengajak menjalin silatuahim dan bebakti kepada kedua ibu bapak. Tremasuk juga memberikan nasihat kepada masyarakat umum pada momen-momen tertentu, pada kesempatan-kesempatan temporal dan pada momen tejadinya bencana sesuai dengan kondisi, dan lain-lainnya yang sangat banyak sekali, yang tidak mungkin disebutkan satu persatu yang mencakup dakwah kepada kebaikan dan larangan dari segala keburukan. Kemudian Allah befirman,”dan mengerjakan amal yang shalih,” maksudnya, disamping dakwahnya mengajak manusia kepada Allah, ia sendii segea mematuhi perintah Allah dengan beramal shalih yang membuat Rabbnya ridha,”dan berkata,’sesungguhnya aku termasuk orang-orang yang berserah diri” maksudnya, tunduk pada perintahNYa dan menempuh jalanNya. Derajat sempuna sepeti ini adalah milik ashidiqin yaitu orang-oang yang bebuat untuk menyempurkan diri mereka sendiri dan menyempurnakan oang-orang lain dan mereka memperoleh warisan sempurna dari para rasul. Dan sebaliknya orang yang paling buuk perkataannya adalah orang yang tergolong penyeru kepada kesesatan lagi menelusuri jalan-jalannya. Diantara dua predikat (kedudkan) yang salah satunya menjulang tinggi tak terjangkau, sedangkan yang lain turun kebawah hingga pada tingkat yang paling rendah, terdapat tingkatan-tingkatan yang hanya diketahui oleh Allah, semuanya ada tersebar pada manusia, dan masing-masing memiliki tingkatan-tingkatan tesendiri dari apa yang dikerjakannya. Dan sekali-kali Allah tidak pernah lalai terhadap apa yang mereka kerjakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 33: (Siapakah yang lebih baik perkataannya) maksudnya, tiada seorang pun yang lebih baik perkataannya (daripada seorang yang menyeru kepada Allah) yakni mentauhidkan-Nya (mengerjakan amal yang saleh dan berkata, \"Sesungguhnya aku termasuk orang-orang yang berserah diri?\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang paling baik ucapannya, jalannya dan keadaannya. Yaitu dengan mengajarkan orang-orang yang tidak tahu, menasihati orang-orang yang lalai dan berpaling serta membantah orang-orang yang batil, yaitu dengan memerintahkan manusia beribadah kepada Allah dengan semua bentuknya, mendorong melakukannya, menghias semampunya, melarang apa yang dilarang Allah, memperburuk larangan itu dengan segala cara agar manusia menjauhinya. Terutama sekali dalam hal ini (dakwah) adalah mengajak manusia masuk Islam, agar mereka mengikrarkan Laailaahaillallah, menghiasnya, membantah musuh-musuhnya dengan cara yang baik, melarang hal yang berlawanan dengannya berupa kekafiran dan kemusyrikan, serta melakukan amar ma’ruf dan nahi mungkar. Termasuk dakwah ilallah adalah membuat manusia mencintai Allah dengan menyebutkan lebih rinci nikmat-nikmat-Nya, luasnya kepemurahan-Nya, sempurnanya rahmat-Nya, serta menyebutkan sifat-sifat sempurna-Nya dan sifat-sifat keagungan-Nya. Termasuk dakwah ilallah juga adalah mendorong manusia mengambil ilmu dan petunjuk dari kitab Allah dan sunnah Rasul-Nya. Termasuk pula mendorong manusia mengamalkan akhlak Islam seperti berakhlak mulia, berbuat ihsan kepada manusia, membalas keburukan dengan kebaikan, menyambung tali silaturrahmi dan berbakti kepada kedua orang tua. Termasuk pula memberi nasihat kepada manusia pada musim-musim tertentu di mana mereka berkumpul pada musim-musim itu dengan dakwah yang sesuai dengan kondisi ketika itu dan lain sebagainya yang isinya mengajak kepada semua kebaikan serta menakut-nakuti terhadap semua keburukan. Termasuk dakwah ilallah pula adalah mengumandangkan azan, karena di dalamnya terdapat seruan mengajak manusia untuk beribadah kepada Allah. Di samping ia mengajak manusia kepada Allah, dia juga segera mengerjakan perintah Allah dengan beramal saleh, amal yang membuat Allah ridha. Yakni termasuk orang-orang yang tunduk kepada perintah-Nya dan menempuh jalan-Nya. Tingkatan dakwah ini sempurnanya adalah bagi para shiddiqin, dimana mereka mengerjakan sesuatu yang menyempurnakan diri mereka dan menyempurnakan orang lain; mereka memperoleh warisan yang sempurna dari para rasul. Sebaliknya, orang yang paling buruk ucapannya adalah orang yang menjadi penyeru kepada kesesatan dan menempuh jalannya. Antara kedua orang ini sungguh berjauhan tingkatannya, yang satu yang menyeru kepada Allah berada di tingkatan yang tinggi, sedangkan yang satu lagi yang menyeru kepada kesesatan berada di tingkatan yang bawah. Antara keduanya terdapat tingkatan-tingkatan yang tidak diketahui kecuali oleh Allah dan semua tingkatan itu dipenuhi oleh makhluk yang sesuai dengan keadaannya sebagaimana firman-Nya, “Dan masing-masing orang memperoleh derajat-derajat (seimbang) dengan apa yang dikerjakannya. Dan Tuhanmu tidak lengah dari apa yang mereka kerjakan.” (Terj. Al An’aam: 132)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 33",
    "description": "Setelah ayat-ayat yang lalu menjelaskan penghargaan kepada orang-orang yang istikamah dengan kedatangan malaikat yang membantu mereka, maka ayat-ayat berikut memberikan pujian terhadap orang yang menyeru ke jalan Allah. Dan siapakah yang lebih baik perkataannya di antara manusia, daripada orang yang menyeru kepada Allah agar manusia tidak melakukan kemusyrikan, dan selalu gemar mengerjakan kebajikan dan berkata dengan penuh keyakinan, 'sungguh, aku termasuk ke dalam kelompok orang-orang muslim yang berserah diri''34. Orang seperti itulah orang yang terbaik. Dan dengan demikian tidaklah sama antara kebaikan dan pelaku kebaikan itu dengan kejahatan dan pelaku kejahatan itu. Oleh sebab itu, tolaklah kejahatan itu dengan cara yang lebih baik, dalam arti sebaik-baiknya. Jika itu yang dilakukan sehingga orang yang ada rasa permusuhan antara kamu dan dia akan ber-ubah sikapnya kepadamu menjadi seperti teman yang setia."
  }
]