[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Kebaikan orang-orang yang beriman kepada Allah dan beristiqamah di atas syariatNya serta berbuat baik kepada makhlukNya, tidak sama dengan keburukan orang-orang yang kafir kepadaNya, menyelisihi perintahNya dan berbuat buruk kepada makhlukNya. Sikapilah (wahai Rasul) dengan maafmu, kesantunanmu dan kebaikanmu orang yang berbuat buruk kepadamu, balaslah keburukannya terhadapmu dengan kebaikanmu kepadanya, dengan itu orang yang berbuat buruk kepadamu, di mana antara dirimu dengan dirinya terdapat permusuhan, akan menjadi kawan akrab bagimu. Dan tidak dibimbing kepada sifat yang terpuji ini kecuali orang-orang yang sabar menghadapi gangguan dan hal-hal yang tidak diinginkan, membawa jiwa mereka kepada apa yang dicintai oleh Allah, dan tidak dibimbing kepadanya kecuali orang yang memiliki bagian besar dari kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Tidak sama melakukan berbagai kebaikan dan ketaatan yang diridai oleh Allah dengan melakukan berbagai keburukan dan kemaksiatan yang dimurkai-Nya. Balaslah tindakan buruk orang-orang yang berlaku buruk kepadamu dengan cara yang lebih baik, maka orang yang sebelumnya memiliki permusuhan denganmu, jika kamu menolak tindakan buruknya dengan kebaikan, menjadi seolah-olah teman yang dekat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Tidak sama antara sifat baik orang-orang beriman dengan sifat buruk orang-orang kafir dan fasik. Balaslah perilaku buruk dengan sikap baik, dengan begitu orang yang berbuat buruk kepadamu itu akan menjadi seperti orang yang dekat kepadamu. Tidaklah orang yang mendapat rezeki berupa sifat yang baik, dengan membalas keburukan dengan kebaikan; melainkan orang-orang yang sabar dalam mentaati Allah, dan tidak ada orang yang mendapat taufik untuk melakukannya melainkan orang yang mendapat taufik berupa kebaikan dan pahala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَا تَسْتَوِى الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ (Dan tidaklah sama kebaikan dan kejahatan) Yakni tidak sama kebaikan yang diridhai Allah dan dibalas dengan pahala, jika dibandingkan dengan keburukan yang dibenci Allah dan dibalas dengan siksaan. Terdapat pendapat mengatakan bahwa yang dimaksud dengan kebaikan di sini adalah sifat ramah, sedangkan keburukan di sini adalah sifat yang keras. ادْفَعْ بِالَّتِى هِىَ أَحْسَنُ(Tolaklah (kejahatan itu) dengan cara yang lebih baik) Yakni balaslah keburukan yang datang dari orang lain dengan perkataan baik, termasuk juga membalas keburukan dengan kebaikan, kesalahan dengan pemberian maaf, dan kemarahan dengan kesabaran. فَإِذَا الَّذِى بَيْنَكَ وَبَيْنَهُۥ عَدٰوَةٌ كَأَنَّهُۥ وَلِىٌّ حَمِيمٌ(maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia) Yakni jika kamu membalas dengan seperti itu maka musuhmu akan menjadi seperti temanmu. Muqatil berkata bahwa ayat ini diturunkan bagi Abu Sufyan bin Harb yang dahulu menentang Rasulullah kemudian menjadi orang dekatnya dengan perbesanan yang terjalin antara dirinya dengan Rasulullah. Kemudian dia masuk Islam, sehingga dia menjadi pembelanya dalam Islam dan orang terdekatnya dengan perbesanan. Adab yang terkandung dalam ayat ini secara mendasar ditujukan kepada para da’i yang berdakwah di jalan Allah dan secara umum ditujukan kepada semua orang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Tidak ada kesamaan antara kebaikan yang diridhai Allah dan keburukan yang dibenci olehNya dalam hal balasan dan akibat yang baik. Tolaklah kebiasaan buruk dengan kebaikan yaitu dengan cara yang tenang dan tidak ada kekerasan di dalamnya. Tolaklah juga keburukan dengan kebaikan, dosa dengan permohonan maaf, kemarahan dengan kesabaran, dan kebodohan dengan pengertian. Jika kamu melakukan hal itu, maka musuhmu akan menjadi teman dekat dalam kebaikan dan kelembutan. Ayat ini diturunkan untuk Abu Sufyan bin Harb saat melawan Nabi SAW, kemudian dia menjadi sahabat setianya dengan terjalinnya hubungan antara keduanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sama kebaikan dengan kejahatan itu. Tolaklah (kejahatan) dengan perilaku yang lebih baik sehingga apabila ada permusuhan antara kamu dan seseorang maka dia seakan-akan teman yang sangat setia} sangat dekat dan penuh kasih sayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Allah berfirman ”dan tidaklah sama kebaikan dan kejahatan,” atau tidaklah sama mengerjakan kebajikan dan ketaatan karena demi mendapat ridha Allah dengan mengerjakan dosa-dosa dan maksiat yang bisa membuat Allah murka dan tidak membuatNya ridha;dan tidak pula sama perbuatn baik kepada manusia dengan berbuat buruk kepada mereka, baik pada keburukan itu sendii, karakternya maupun pada balasannya kelak. “tidak ada balasan bagi kebajikan melainkan kebajikan pula,”(ar-ahman:60) Kemudian Allah memerintahkannya untuk bebuat ihsan (baik) yang khusus baginya, karena mempunyai pengaruh yang sangat besar, yaitu berbuat ihsan kepada orang yang justru berbuat tidak baik kepadamu, seraya befiman,”tolaklah dengan cara yang lebih baik,” apabila ada seseorang manusia yang berbuat baik kepadamu, terutama orang yang mempunyai hak yang sangat besar atasmu, sepeti kaum kerabat para sahib dan yang semisal dengan mereka, maka balaslah dengan berbuat yang terbaik kepadanya. Jika ia memutus hubungan denganmu, maka jalinlah hubungan itu dan jika ia bebuat zhalim (aniaya) tehadapmu, maka maafkanlah ia, dan jika ia membicarakanmu ketika kamu absen atau hadir, maka janganlah kamu membalasnya, tetapi maafkanlah ia dan pergaulilah dia dengan cara yang lembut. Dan jika ia memboikotmu dan tidak mau bicara padamu, maka maniskanlah ucapan-ucapanmu kepadanya dan ucapkanlah salam kepadanya. Jika kamu telah membalas pebuatan buruk itu dengan ihsan (perbuatan yang terbaik), maka akan diperoleh faidah (keuntungan) yang sangat besar. “maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia,” maksudnya, seakan-akan ia adalah kerabat yang sangat sayang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 34: (Dan tidaklah sama kebaikan dan kejahatan) dalam tingkatan rinciannya, karena sebagian daripada keduanya berada di atas sebagian yang lain. (Tolaklah) kejahatan itu (dengan cara) yakni dengan perbuatan (yang lebih baik) seperti marah, imbangilah dengan sabar, bodoh imbangilah dengan santunan, dan perbuatan jahat imbangilah dengan lapang dada atau pemaaf (maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah menjadi teman yang setia) maka jadilah yang dulunya musuhmu kini menjadi teman sejawat dalam hal saling kasih mengasihi, jika kamu mempunyai sikap seperti tersebut. Lafal Al Ladzii Mubtada, dan Ka-annahu adalah Khabarnya, lafal Idzaa menjadi Zharaf bagi makna Tasybih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidaklah sama antara mengerjakan kebaikan untuk mencari ridha Allah dengan mengerjakan keburukan yang mendatangkan kemurkaan-Nya, dan tidak sama antara berbuat baik kepada manusia dengan berbuat buruk kepada mereka, baik secara zat(perbuatan)nya, sifatnya maupun balasannya. Selanjutnya Allah memerintahkan secara khusus untuk berbuat ihsan, dimana ia memiliki kedudukan yang besar. Ihsan di sini adalah berbuat ihsan kepada orang yang berbuat buruk kepadanya. Misalnya marah disikapi dengan sabar, sikap bodoh dihadapi dengan santun, sikap mengganggu dengan memaafkan, pemutusan silaturrahmi dengan disambung, jika ia membicarakan kita di hadapan kita atau tidak di hadapan kita, maka kita tidak membalasnya, bahkan memaafkannya dan menyikapinya dengan kata-kata yang lembut. Ketika mereka menjauhi kita dan tidak mau berbicara dengan kita, maka kita mengucapkan kata-kata yang baik kepadanya serta mengucapkan salam. Yakni jika kamu melakukan hal itu (menyikapi keburukan dengan kebaikan), maka ada faedah yang besar, yaitu orang yang sebelumnya sebagai musuh menjadi teman akrab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 34",
    "description": "Orang seperti itulah orang yang terbaik. Dan dengan demikian tidaklah sama antara kebaikan dan pelaku kebaikan itu dengan kejahatan dan pelaku kejahatan itu. Oleh sebab itu, tolaklah kejahatan itu dengan cara yang lebih baik, dalam arti sebaik-baiknya. Jika itu yang dilakukan sehingga orang yang ada rasa permusuhan antara kamu dan dia akan ber-ubah sikapnya kepadamu menjadi seperti teman yang setia. 35. Dan ketahuilah bahwa sifat-sifat yang baik itu, yakni membalas keburukan dengan kebaikan, tidak akan dianugerahkan kecuali kepada orang-orang yang sudah terbiasa bersikap sabar dan juga tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar serta mempunyai hati yang bersih."
  }
]