[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Kebaikan orang-orang yang beriman kepada Allah dan beristiqamah di atas syariatNya serta berbuat baik kepada makhlukNya, tidak sama dengan keburukan orang-orang yang kafir kepadaNya, menyelisihi perintahNya dan berbuat buruk kepada makhlukNya. Sikapilah (wahai Rasul) dengan maafmu, kesantunanmu dan kebaikanmu orang yang berbuat buruk kepadamu, balaslah keburukannya terhadapmu dengan kebaikanmu kepadanya, dengan itu orang yang berbuat buruk kepadamu, di mana antara dirimu dengan dirinya terdapat permusuhan, akan menjadi kawan akrab bagimu. Dan tidak dibimbing kepada sifat yang terpuji ini kecuali orang-orang yang sabar menghadapi gangguan dan hal-hal yang tidak diinginkan, membawa jiwa mereka kepada apa yang dicintai oleh Allah, dan tidak dibimbing kepadanya kecuali orang yang memiliki bagian besar dari kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Tidak terbimbing kepada sifat yang terpuji ini kecuali orang-orang yang bersabar menghadapi gangguan dan keburukan yang mereka dapatkan dari manusia, tidak terbimbing kepadanya kecuali pemilik keberuntungan yang agung, karena ia mengandung kebaikan besar dan manfaat melimpah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَمَا يُلَقَّىٰهَآ(Sifat-sifat yang baik itu tidak dianugerahkan) Yakni kemampuan untuk membalas keburukan dengan kebaikan ini tidak diberikan, إِلَّا الَّذِينَ صَبَرُوا۟(melainkan kepada orang-orang yang sabar) Yakni yang sabar dalam menahan kemarahan dan menanggung hal yang tidak disukai. وَمَا يُلَقَّىٰهَآ إِلَّا ذُو حَظٍّ عَظِيمٍ (dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keuntungan yang besar) Yakni dalam pahala dan kebaikan, sebab itu adalah karunia dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Watak alami yang berupa penolakan keburukan dengan kebaikan ini tidak diberi dan tidak dipikul, kecuali kepada orang-orang yang sabar atas sesuatu yang dibenci dan menahan amarah. Watak ini juga tidak diberi, tidak diterima dan tidak didapatkan kecuali oleh orang yang memiliki keberuntungan besar berupa kebaikan dan sempurnanya jiwa dan pahala yang didapatkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak akan dianugerahkan} tidak dianugerahkan pada kebiasaan yang terpuji ini {kecuali kepada orang-orang yang sabar dan tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar} pemilik bagian yang melimpah berupa kebaikan di dunia dan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “ia tidak dianugerahkan” maksudnya, tidak ada yang dianugerahkan sifat-sifat terpuji itu,”melainkan kepada oang-orang yang,” menyebarkan drii mereka dalam menghadapi hal-hal yang tidak disukai dan memaksanya untuk tunduk kepada apa-apa yang dicintai Allah. Sesungguhnya jiwa itu sudah menjadi tabiatnya membalas orang yang bebuat buruk dengan berbuat buruk kepadanya dan tidak memaafkannya. Lalu bagaimana dengan ihsan?! Apabila seseorang mampu menyebakan dirinya, mematuhi peratuan tuhannya mengetahui pahala yang berlimpah, ia mengethaui bahwa membalas orang yang berbuat buruk dengan keburukan yang serupa itu sama sekali berguna baginya dan malah makin menambah kerasnya permusuhan, dan bahwa sesungguhnya perbuatan ihsan kepada orang yang berbuat jahat itu tidak akan merendahkan martabatnya, bahkan siapa saja yang merendahkan diri kepada Allah, niscaya Allah mengangkat derajatnya, maka perrmasalahan akan menjadi ringan baginya dan ia melakukannya dengan penuh rasa lezat lagi merasakan manisnya.”dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keberuntungan yang besar,” sebab sifat-sifat tersebut merupakan karakteristik manusia-manusia yang di istimewakan, yang dengannya seseorang akan memperoleh derajat tinggi di dunia akhiat, yang merupakan sifat-sifat terbesar dari akhlak mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 35: (Sifat-sifat yang baik itu tidak dianugerahkan) tidak akan diberikan (melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keberuntungan) yakni pahala (yang besar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka yang menahan diri terhadap hal yang tidak disukainya dan memaksa dirinya untuk mengerjakan hal yang dicintai Allah. Hal itu, karena jiwa diciptakan dalam keadaan ingin membalas keburukan dengan keburukan serta tidak mau memaafkan. Lalu bagaimana bisa berbuat ihsan? Jika seseorang berusaha menyabarkan dirinya, mengikuti perintah Tuhannya, mengetahui besarnya pahala dari-Nya, serta mengetahui bahwa membalasnya dengan perbuatan yang serupa tidaklah berfaedah apa-apa bahkan hanya menambah permusuhan, dan bahwa berbuat ihsan kepadanya tidaklah mengurangi kedudukannya, bahkan barang siapa yang bertawadhu’ karena Allah, maka Allah akan meninggikannya, maka semua urusannya akan mudah dan ia dapat melakukannya dengan senang hati dan merasakan manisnya. Hal itu, karena sifat-sifat itu hanyalah diberikan kepada makhluk-makhluk pilihan-Nya, dimana dengannya seorang hamba memperoleh ketinggian di dunia dan akhirat, dan yang demikian merupakan akhlak mulia yang paling besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 35",
    "description": "Dan ketahuilah bahwa sifat-sifat yang baik itu, yakni membalas keburukan dengan kebaikan, tidak akan dianugerahkan kecuali kepada orang-orang yang sudah terbiasa bersikap sabar dan juga tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar serta mempunyai hati yang bersih. 36. Sikap terpuji yang membalas keburukan dengan kebaikan itu sa-ngat dibenci oleh setan. Ltulah sebabnya setan selalu menghalang-halangi manusia agar tidak bersikap seperti demikian. Untuk itu, Allah mengajarkan bagaimana menghadapi setan berkaitan dengan hal itu. Dan jika setan mengganggumu wahai nabi Muhammad, dengan suatu godaan, membalas keburukan dengan keburukan atau berbuat perbuatan lain yang tidak terpuji, maka mohonlah perlindungan kepada Allah. Sungguh, dialah yang maha mendengar, maha mengetahui sebagai tempat berlindung."
  }
]