[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika setan membisikkan godaannya ke dalam hatimu untuk membalas orang yang berbuat buruk kepadamu dengan keburukan, maka mohonlah perlindungan kepada Allah dan bernaunglah kepadaNya. Sesungguhnya Dia Maha Mendengar permohonanmu dan Maha Mengetahui segala urusan MakhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Jika setan membisikimu kapan pun dengan keburukan maka berlindunglah kepada Allah dan kembalilah kepada-Nya. Sesungguhnya Allah Maha Mendengar apa yang kamu katakan, Maha Mengetahui keadaanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Jika setan menggodamu agar kamu berpaling dari perintah Allah, maka mintalah perlindungan kepada Allah dari keburukan setan. Allah Maha Mendengar segala perkataan dan Maha Mengetahui segala keadaan dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللهِ ۖ (Dan jika syetan mengganggumu dengan suatu gangguan, maka mohonlah perlindungan kepada Allah) Yakni jika setan menghalangimu untuk membalas keburukan dengan kebaikan dan menghiasi kepadamu perbuatan untuk membalas keburukan dengan keburukan semisalnya atau keburukan yang lebih parah, maka mintalah perlindungan Allah dari keburukan setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Jika gangguan setan mengacaukanmu dari kebiasaan baik atau menolak sesuatu yang lebih baik, maka minta perlindunganlah kepada Allah dari kejahatan setan. Berlindunglah kepada Allah dan jangan mengikuti setan. Allah akan melindungimu dari gangguannya. Sesungguhnya Allah Maha mendengan permohonanmu untuk berlindung serta ucapanmu. Dia juga Maha Mengetahui niat dan tindakanmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika setan benar-benar menggodamu} menggodamu {dengan godaan} bisikan, halangan untuk berbuat baik dan dorongan kepada keburukan {maka berlindunglah kepada Allah} maka mohon perlindungan dan penjagaan kepada Allah {Sesungguhnya Dialah Dzat Yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. selain Allah menjelaskan apa yang seharusnya dibalaskan kepada musuh dari golongan manusia, yaitu membalas kejahatannya dengan berbuat baik kepadanya, maka di sini Allah menjelaskan bagaimana seharusnya menolak musuh dari bangsa jin, yaitu dengan cara memohon perlindungan kepada Allah dari kejahatannya, seraya befiman,”dan jika setan mengganggumu dengan suatu gangguan,” maksudnya pada suatu waktu kamu merasa ada bisikan-bisaikan setan. Maksudnya, bisikan dan bujukannya untuk melakukan kejahatan dan membuatnya malas berbuat kebaikan serta rayuannya untuk melakukan dosa dan supaya mematuhi sebagian perinthanya. “maka mohonlah perlindungan kepada Allah,” artinya, memohonlah kepadaNYa dengan penuh rasa butuh kepadaNYa untuk dilindungi dan dijaga darinya. “sesungguhnya Dialah yang maha mendengar dan lagi maha mengetahui,” karena sesunguhnya Dia maha mengetahui ucapan dan sikap rendah dirimu dan Dia mengetahui kondisi dan kebutuhanmu yang sangat mendesak kepada perlindungan dan pemeliharaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 36: (Dan jika) lafal Immaa ini pada asalnya terdiri dari In Syarthiyyah dan Maa Zaidah yang kemudian keduanya diidgamkan menjadi satu sehingga jadilah Immaa (setan mengganggumu dengan suatu gangguan) yakni jika setan mengalihkan perhatianmu dari pekerti yang baik kepada pekerti yang buruk (maka mohonlah perlindungan kepada Allah) lafal ayat ini menjadi Jawab Syarat, sedangkan Jawab Amar tidak disebutkan, yakni niscaya Dia akan menolak gangguan setan itu dalam dirimu. (Sesungguhnya Dialah Yang Maha Mendengar) semua percakapan (lagi Maha Mengetahui) semua perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan cara untuk menghadapi musuh dari kalangan manusia, yaitu dengan menyikapi perbuatan buruknya dengan sikap ihsan, maka Allah menyebutkan cara untuk menghadapi musuh dari kalangan jin, yaitu dengan meminta perlindungan kepada Allah dan menjaga diri dari kejahatannya. Seperti bisikan dan was-wasnya, penghiasannya terhadap keburukan, menjadikannya malas mengerjakan kebaikan, terjatuh ke dalam sebagian dosa atau menaati sebagian perintahnya. Yakni mintalah kepada-Nya dengan rasa butuh kepada perlindungan-Nya. Dia mendengar ucapan dan doamu. Dia mengetahui keadaan kamu dan butuhnya kamu kepada perlindungan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 36",
    "description": "Sikap terpuji yang membalas keburukan dengan kebaikan itu sa-ngat dibenci oleh setan. Ltulah sebabnya setan selalu menghalang-halangi manusia agar tidak bersikap seperti demikian. Untuk itu, Allah mengajarkan bagaimana menghadapi setan berkaitan dengan hal itu. Dan jika setan mengganggumu wahai nabi Muhammad, dengan suatu godaan, membalas keburukan dengan keburukan atau berbuat perbuatan lain yang tidak terpuji, maka mohonlah perlindungan kepada Allah. Sungguh, dialah yang maha mendengar, maha mengetahui sebagai tempat berlindung. 37. Al-qur'an memang kitab hidayah yang menuntun manusia agar menempuh jalan yang lurus. Setelah berbicara tentang sikap terpuji, yakni membalas keburukan dengan kebaikan, Al-Qur'an kemudian mengingatkan manusia betapa Allah itu sangat berkuasa sehingga malam, siang, matahari dan bulan dengan caranya sendiri-sendiri bersujud kepada Allah. Dengan metode observasi terhadap fenomena alam ini merupakan bentuk pengajaran yang menyentuh, bagi orang-orang yang mau mempergunakan nalarnya dengan baik."
  }
]