[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diantara hujjah-hujjah Allah atas makhlukNya dan bukti-bukti keesaanNya dan kesempurnaan KuasaNya adalah silih bergantinya malam dengan siang dan saling mengejar di antara keduanya, silih bergantinya matahari dengan rembulan dan pergantian di antara keduanya. Semua ini dibawah pengaturan dan keperkasaan Allah. janganlah bersujud kepada matahari atau rembulan (karena keduanya adalah makhluk yang diatur) sebaliknya bersujudlah kepada Allah yang menciptakan mereka, bila kalian benar-benar tunduk kepada perintahNya, mendengar dan menaatiNya, menyembahNya semata, tidak ada sekutu bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Di antara ayat-ayat Allah yang menunjukkan keagungan-Nya dan tauhid-Nya adalah malam dan siang yang datang silih berganti, matahari dan rembulan. Jangan bersujud -wahai manusia- kepada matahari dan jangan bersujud kepada rembulan, akan tetapi sujudlah kalian kepada Allah semata yang telah menciptakan mereka semuanya jika kalian benar-benar menyembah-Nya semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Salah satu tanda keesaan dan kekuasaan Allah adalah perbedaan malam dan siang; malam dengan kegelapannya dan siang dengan cahayanya; pergantian matahari dan bulan; matahari dengan sinarnya dan bulan dengan cahayanya. Hai para hamba, janganlah kalian bersujud kepada matahari dan jangan pula kepada bulan, karena keduanya adalah makhluk Allah. Namun sujudlah kepada Allah semata Yang telah menciptakan keduanya, jika kalian benar-benar ingin menyembah-Nya semata. Hai Rasulullah, jika manusia berbuat angkuh, maka para malaikat yang di sisi Allah senantiasa bertasbih kepada-Nya siang malam, tanpa pernah bosan dari berzikir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَمِنْ ءَايٰتِهِ الَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ ۚ (Dan di antara tanda-tanda kekuasaan-Nya ialah malam, siang, matahari dan bulan) Yakni ini semua adalah tanda-tanda yang menunjukkan kekuasaan Allah dan keagungan serta hikmah-Nya. لَا تَسْجُدُوا۟ لِلشَّمْسِ وَلَا لِلْقَمَرِ(Janganlah sembah matahari maupun bulan) Sebab keduanya adalah makhluk Allah, sehingga tidak layak menjadi sekutu bagi-Nya. وَاسْجُدُوا۟ لِلّٰهِ الَّذِى خَلَقَهُنَّ(tapi sembahlah Allah Yang menciptakannya) Yakni menciptakan empat makhluk tersebut. إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ(Jika Ialah yang kamu hendak sembah) Dikatakan bahwa dahulu manusia bersujud kepada matahari dan bulan, seperti Sha’biin yang menyembah bintang-bintang, mereka mengatakan bahwa meniatkan sujud kepada matahari dan bulan itu sebagai sujud kepada Allah; maka mereka dilarang melakukan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Di antara dalil-dalil keesaan Allah, kekuasaanNya, keagunganNya dan hikmahNya adalah penciptaan malam dengan kegelapannya, siang dengan sinarnya, matahari dengan silau cahanya, dan bulan dengan cahayanya. Janganlah kalian bersujud kepada matahari dan bulan wahai manusia karena keduanya adalah makhluk Allah. Mereka bukanlah sekutuNya. Bersujudlah kepada Allah yang telah menciptakan 4 makhluk ini, jika kalian ingin benar dalam beribadah. Ini untuk menanggapi kaum shabi’ yang menyembah planet-planet"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sebagian dari ayat-ayatNya adalah malam, siang, matahari, dan bulan. Janganlah bersujud pada matahari dan jangan pula pada bulan. Bersujudlah kepada Allah yang menciptakannya jika kalian hanya menyembah kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. kemudian Allah menjelaskan bahwa “diantara sebagian dari tanda-tandaNYa” yang menunjukan pada kemahasempurnaan kekuasaanNya, kemahamampuan kehendakNYa, kemahaluasan wewenangNYa, dan kasih sayangNYa terhadap hamba-hambaNYa dan sesungguhnya Dialah yang esa, tiada sekutu bagiNYa. ”ialah malam dan siang” yakni siang dengan segala manfaat terangnya dan pekerjaan manusia di siang hari, sedangkan malam dengan manfaat kegelapannya dan istirahat manusia padanya,”matahari dan bulan,” yang tidak akan sempurna kehidupan manusia dan badan mereka, juga badan hewan-hewan ternak mereka kecuali dengan keberadaan keduanya;dan dari kedua matahari dan bulan inilah terjadi bebagai macam maslahat yang tidak tehitung.” “Janganlah bersujud pada matahari dan janganlah pula kepada bulan,” karena sesungguhnya keduanya dikendalikan dan ditundukan dan diciptakan, ”tetapi bersujudlah kepada Allah yang menciptakannya,” maksudnya, sembahlah Allah semata, sebab Dialah pencipta yang maha agung, dan tinggalkanlah segala bentuk penyembahan kepada selain Dia dari berbagai macam makhluk ini, seklaipun ia (selain Dia) besar bentuknya dan banyak manfaatnya. Sebab semua itu tidak berasal darinya, melainkan dari sang pencipta yang Maha suci yang telah menciptakannya,”jika kamu hanya kepadaNYa saja menyembah,”maka istimewakanlah Dia dengan ibadah dan murnikanlah kepatuhan hanya kepadaNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 37: (Dan sebagian dari tanda-tanda kekuasaan-Nya ialah malam, siang, matahari, dan bulan. Janganlah kalian bersujud kepada matahari dan jangan pula kepada bulan, tetapi bersujudlah kepada Allah Yang menciptakannya) yang telah menciptakan keempat tanda-tanda tersebut (jika kalian hanya kepada-Nya saja menyembah.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian Allah Subhaanahu wa Ta'aala menyebutkan, bahwa di antara tanda-tanda yang menunjukkan sempurnanya kekuasaan-Nya, berlakunya kehendak-Nya, luasnya kekuasaan-Nya dan rahmat-Nya kepada hamba-hamba-Nya, dan bahwa Dia Maha Esa tidak ada sekutu bagi-Nya adalah malam dan siang. Dengan manfaat kegelapannya manusia dapat beristirahat dengan tenang. Dengan manfaat terangnya, manusia dapat beraktifitas. Dimana kehidupan manusia, badan mereka dan badan hewan ternak mereka tidak akan baik kecuali dengan keduanya, dan banyak maslahat yang dihasilkan dari keduanya. Karena keduanya diatur dan sebagai makhluk. Karena Dia yang menciptakannya dan Dia Maha Agung. Tinggalkanlah menyembah kepada selain-Nya betapa pun besar makhluk itu dan betapa pun banyak maslahat yang dihasilkannya, karena semua itu bukan darinya akan tetapi Dari Penciptanya yang mengadakan demikian, yaitu Allah Tabaaraka wa Ta'aala. Oleh karena itu beribadahlah hanya kepada-Nya dan ikhlaskanlah dalam menjalankannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 37",
    "description": "Al-qur'an memang kitab hidayah yang menuntun manusia agar menempuh jalan yang lurus. Setelah berbicara tentang sikap terpuji, yakni membalas keburukan dengan kebaikan, Al-Qur'an kemudian mengingatkan manusia betapa Allah itu sangat berkuasa sehingga malam, siang, matahari dan bulan dengan caranya sendiri-sendiri bersujud kepada Allah. Dengan metode observasi terhadap fenomena alam ini merupakan bentuk pengajaran yang menyentuh, bagi orang-orang yang mau mempergunakan nalarnya dengan baik. 38. Jika mereka orang-orang kafir itu masih menyombongkan diri tidak mau mengikuti tuntunan ini janganlah kecewa. Sebab, Allah tidak memerlukan penyembahan dari siapa pun dan sudah ada malaikat yang tunduk dan patuh kepada Allah. Dengan ketundukan dan kepatuhan itu, maka mereka para malaikat yang di sisi tuhanmu itu senantiasa bertasbih kepada-Nya pada malam dan siang hari, sedang mereka dalam bertasbih itu tidak pernah merasa jemu dan bosan."
  }
]