[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila orang-orang musyrik itu menyombongkan diri dengan menolak untuk sujud kepada Allah, maka sesungguhnya para malaikat yang ada di sisi Tuhanmu tidak menyombongkan diri untuk itu, sebaliknya mereka bertasbih dan menyucikan Allah dari segala kekurangan di waktu siang dan malam, mereka tak henti-hentinya melakukan itu dan tidak pernah bosan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Bila mereka menyombongkan diri dan berpaling, tidak bersujud kepada Allah sang Khalik, maka para Malaikat yang ada di sisi Allah bertasbih dan bertahmid kepada-Nya siang dan malam, mereka tidak pernah bosan untuk beribadah kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. فَإِنِ اسْتَكْبَرُوا۟ فَالَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُۥ بِالَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْـَٔمُونَ (Jika mereka menyombongkan diri, maka mereka (malaikat) yang di sisi Tuhanmu bertasbih kepada-Nya di malam dan siang hari, sedang mereka tidak jemu-jemu) Yakni jika mereka enggan untuk menjalankannya maka sesungguhnya para malaikat tidak enggan untuk menyembah-Nya, bahkan mereka senantiasa bertasbih kepada Allah siang dan malam tanpa rasa bosan dan lelah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Jika manusia enggan mengamalkan dan bersujud kepada Allah SWT, maka para malaikat itu tidak enggan menyembahNya. Mereka selalu bertasbih kepada Allah setiap malam dan siang. Mereka tidak berpaling dan tidak lelah. Yang dimaksud berada di sisinya pada kalimat {inda rabbika} adalah dalam hal derajat tinggi dan kemuliaan, bukan berada di sisinya dalam hal tempat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka menyombongkan diri, mereka yang berada di sisi Tuhanmu} para malaikat yang berada di sisi Allah SWT {selalu bertasbih kepadaNya pada malam dan siang hari tanpa bosan} tanpa bosan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. ”jika mereka menyombongkan diri,” tidak mau beribadah kepada Allah dan tidak mau tunduk untukNYa, maka sesungguhnya mereka sama sekali tidak dapat membahayakanmu, dan Allah tidak butuh kepada mereka dan Dia mempunyai hamba-hamba yang dimuliakan, mereka sama sekali tidak pernah mendurhakai Allah atas apa-apa yang diperintahkan kepada mereka dan mereka selalu melaksanakan apa saja yang diperintahkan. Maka dari itu Dia berfirman ”maka mereka yang berada di sisi Rabbmu,” maksudnya, para malaikat al-muqarabbin, ”bertasbih kepadaNYa di malam dan siang hari, sedang mereka tidak jemu-jemu,” maksudnya, mereka tidak pernah jemu dari menyembahNYa, karena kekuatan mereka dan karena sangat dahsyatnya motivasi mereka untuk itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 38: (Jika mereka menyombongkan diri) tidak mau bersujud atau menyembah kepada Allah semata (maka mereka yang di sisi Rabbmu) yakni malaikat-malaikat (bertasbih) artinya, salat (kepada-Nya di malam dan siang hari, sedangkan mereka tidak jemu-jemu) tidak pernah merasa jemu bertasbih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari beribadah kepada Allah ‘Azza wa Jalla, tidak mau tunduk kepada-Nya, maka sesungguhnya mereka tidak akan merugikan Allah sedikit pun, karena Allah tidak butuh kepada mereka. Dia punya hamba-hamba yang mulia yang tidak mendurhakai perintah-Nya lagi melakukan apa yang diperintahkan, yaitu para malaikat. Yaitu malaikat yang didekatkan. Ada yang menafsirkan dengan melakukan shalat. Atau bisa juga maksudnya, bahwa mereka tidak pernah bosan beribadah kepada-Nya karena kuatnya mereka dan karena kuatnya pendorong dalam diri mereka untuk melakukan ibadah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 38",
    "description": "Jika mereka orang-orang kafir itu masih menyombongkan diri tidak mau mengikuti tuntunan ini janganlah kecewa. Sebab, Allah tidak memerlukan penyembahan dari siapa pun dan sudah ada malaikat yang tunduk dan patuh kepada Allah. Dengan ketundukan dan kepatuhan itu, maka mereka para malaikat yang di sisi tuhanmu itu senantiasa bertasbih kepada-Nya pada malam dan siang hari, sedang mereka dalam bertasbih itu tidak pernah merasa jemu dan bosan. 39. Dan sebagian dari tanda-tanda kebesaran dan kekuasaan-Nya adalah engkau melihat dengan kasat mata atau dengan pemikiran bumi itu kering dan tandus juga gersang dan mati, tetapi apabila kami turunkan hujan dari langit di atas tanah yang kering dan tandus itu, niscaya dengan air hujan ia bergerak dan subur memberikan kehidupan, sehingga dapat ditumbuhi oleh tanam-tanaman yang sangat diperlukan oleh manusia dalam kehidupan. Ketahuilah, bahwa sesungguhnya Allah-lah yang menghidupkannya, dan dengan demikian pasti Allah dapat menghidupkan yang mati; sesungguhnya dia mahakuasa atas segala sesuatu."
  }
]