[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diantara tanda-tanda keesaan dan Kuasa Allah adalah bahwa kamu melihat bumi kering dan tidak ada tanaman padanya, lalu bila Kami menurunkan hujan atasnya, maka kehidupan pun menggeliat padanya, ia bergerak dengan tumbuhnya pohon-pohon yang membesar dan meninggi. Sesungguhnya Allah Yang menghidupkan bumi setelah kegersangannya ini juga berkuasa menghidupkan makhluk setelah kematian mereka. Sesungguhnya Dia Mahakuasa atas segala sesuatu. Maka sebagaimana tidak ada yang mampu melemahkan kuasa Allah dalam menumbuhkan bumi yang mati, maka tidak ada yang mampu melemahkan kuasa-Nya untuk menghidupkan orang-orang yang sudah mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Di antara ayat-ayat Allah yang menunjukkan keagungan-Nya, tauhid-Nya dan kekuasaan-Nya dalam membangkitkan makhluk-makhluk adalah bahwa kamu melihat bumi yang tidak bertanaman, manakala Kami menurunkan hujan kepadanya, maka ia menggeliat karena ada sesuatu yang tersimpan di dalamnya yang tumbuh lalu ia muncul ke permukaannya. Sesungguhnya Allah yang menghidupkan bumi yang mati dengan tumbuh-tumbuhan pasti akan menghidupkan dan membangkitkan orang-orang yang mati untuk menghadapi hisab dan menerima balasan. Sesungguhnya Allah Mahakuasa atas segala sesuatu, mampu menghidupkan bumi yang mati, sebagaimana Allah mampu menghidupkan orang-orang mati dan membangkitkan mereka dari alam kubur mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Dan salah satu tanda kekuasaan Allah dalam membangkitkan makhluk: Hai manusia, kamu dapat melihat tanah kering yang tandus, namun ketika Kami menurunkan hujan kepadanya maka tanaman-tanaman mulai bergerak tumbuh, merimbun, dan menghasilkan buah-buahan. Sungguh Yang dapat menghidupkan tanah itu dengan penumbuhan tanaman, maka Dia Maha Menghidupkan makhluk-makhluk mati pada hari kiamat; Dia Maha Berkuasa atas segalanya, tidak ada yang sulit bagi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَمِنْ ءَايٰتِهِۦٓ أَنَّكَ تَرَى الْأَرْضَ خٰشِعَةً (Dan di antara tanda-tanda-Nya (Ialah) bahwa kau lihat bumi kering) Yakni dikatakan bumi gersang jika telah kering dan tidak ada hujan yang menyiraminya. فَإِذَآ أَنزَلْنَا عَلَيْهَا الْمَآءَ اهْتَزَّتْ(maka apabila Kami turunkan air di atasnya, niscaya ia bergerak) Yakni bergerak dengan tanamannya; yakni tanaman itu bergerak di atasnya. وَرَبَتْ ۚ( dan subur) Yakni membesar dan meninggi sebelum tumbuh. Pendapat lain mengatakan bahwa pertumbuhannya adalah jika tanaman yang ada di atasnya mulai tumbuh. Dan makna dua kalimat ini adalah untuk menggambarkan bumi yang mati dengan gambaran yang lebih hidup. إِنَّ الَّذِىٓ أَحْيَاهَا لَمُحْىِ الْمَوْتَىٰٓ ۚ( Sesungguhnya Tuhan Yang menghidupkannya, Pastilah dapat menghidupkan yang mati) Dengan membangkitkan dan mengumpulkan mereka. إِنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ(Sesungguhnya Dia Maha Kuasa atas segala sesuatu) Tidak ada yang dapat menghalangi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Di antara bukti-bukti kekuasaan Allah atas adanya hari kebangkitan yaitu bahwa sesungguhnya kamu dapat melihat bumi yang gersang tidak ada tumbuhan, lalu ketika Kami menurunkan hujan, maka bumi itu menggerakkan dan menumbuhkan tumbuh-tumbuhan (gambaran bumi yang mengembangkan tumbuhan ini adalah gambaran proses penghidupan). Sesungguhnya Dzat yang menghidupkannya dengan menumbuhkan tumbuh-tumbuhan itu juga menghidupkan kematian pada hari kiamat dengan pembangkitan.Sesungguhnya Dia Maha berkuasa atas segala sesuatu termasuk menghidupkan dan mematikan.Tidak ada yang dapat melemahkannya sekalipun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagian dari ayat-ayatNya adalah bahwa kamu melihat bumi kering} tandus tanpa ada tumbuhan di dalamnya {kemudian apabila Kami menurunkan air padanya, (bumi) itu pun hidup} bergerak dengan tumbuhan {dan menjadi subur} meninggi {Sesungguhnya Dzat yang menghidupkannya pasti dapat menghidupkan yang mati. Sesungguhnya Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “Dan di antara tanda-tandaNya” yang membuktikan kemahasempurnaan KuasaNya dan KeesaanNya dalam kerajaan, mengatur dan wahdaniyyah adalah “bahwa kamu melihat bumi itu kering tandus” tidak ada tumbuh-tumbuhannya “maka apabila Kami turunkan air di atasnya” maksudnya hujan “niscaya ia bergerak”. Artinya bergerak mengeluarkan tumbuh-tumbuhan “dan subur” menumbuhkan berbagai macam tumbuhan yang subur, sehingga dengannya hiduplah manusia dan daerah itu. “sesungguhnya Yang menghidupkannya” sesudah kematian dan ketandusannya “tentu dapat menghidupkan yang mati” dari dalam kubur mereka pada hari kebangkita mereka “sesungguhnya Dia Mahakuasa atas segala sesuatu.” Sebagaimana kekuasaanNya tidak susah untuk menghidupkan tanah setelah ketandusannya, maka demikian pula tidak susah bagiNya untuk menghidupkan orang-orang yang sudah mati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 39: (Dan sebagian dari tanda-tanda kekuasaan-Nya bahwa kamu melihat bumi itu kering tandus) yaitu tidak ada tumbuhtumbuhan padanya (maka apabila Kami turunkan air di atasnya, niscaya ia bergerak) berubah (dan subur) yakni menjadi subur dan rimbun penuh dengan tetumbuhan. (Sesungguhnya Tuhan Yang menghidupkannya tentu dapat menghidupkan yang mati; sesungguhnya Dia Maha Kuasa atas segala sesuatu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan sempurnanya kekuasaan-Nya, sendirinya Dia dalam menguasai, mengatur dan sekaligus menunjukkan keesaan-Nya. Yakni menumbuhkan berbagai tumbuhan yang indah, sehingga dengan hujan itu Allah menghidupkan manusia dan tanah. Setelah mati dan keringnya bumi itu. Oleh karena tidak sukar bagi-Nya menghidupkan tanah setelah matinya, maka tidak sukar pula bagi-Nya menghidupkan orang-orang yang mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 39",
    "description": "Dan sebagian dari tanda-tanda kebesaran dan kekuasaan-Nya adalah engkau melihat dengan kasat mata atau dengan pemikiran bumi itu kering dan tandus juga gersang dan mati, tetapi apabila kami turunkan hujan dari langit di atas tanah yang kering dan tandus itu, niscaya dengan air hujan ia bergerak dan subur memberikan kehidupan, sehingga dapat ditumbuhi oleh tanam-tanaman yang sangat diperlukan oleh manusia dalam kehidupan. Ketahuilah, bahwa sesungguhnya Allah-lah yang menghidupkannya, dan dengan demikian pasti Allah dapat menghidupkan yang mati; sesungguhnya dia mahakuasa atas segala sesuatu. 40. Sangatlah logis bila dikatakan bahwa orang-orang yang mengingkari tanda-tanda kebesaran dan kemahakuasaan Allah tidak akan mampu bersembunyi dari penglihatan-Nya, karena Allah itu zat yang maha melihat lagi maha mengetahui. Ayat berikut memperingatkan dengan mengancam mereka. Sesungguhnya orang-orang yang mengingkari tanda-tanda kebesaran kami dengan menempuh jalan yang sesat, mereka itu sedetik pun tidak tersembunyi dari tilikan kami. Maka jika demikian manakah yang terbaik, apakah arang-orang yang dilemparkan ke dalam neraka yang lebih baik, ataukah mereka yang datang dengan aman sentosa pada hari kiamat' oleh sebab itu, katakanlah kepada orang-orang yang durhaka itu, 'lakukanlah apa saja yang kamu kehendaki sesuka hatimu! sungguh, dia maha melihat apa yang kamu kerjakan dan membalas kamu sesuai dengan apa yang kamu perbuat itu."
  }
]