[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang menyampaikan berita gembira dengan pahala di dunia dan di akhirat, bagi siapa yang beriman dan beramal sesuai dengan tuntunannya, juga memberikan peringatan dengan azab di dunia dan di akhirat, bagi siapa yang kafir kepadanya. Tetapi kebanyakan manusia justru berpaling darinya, mereka tidak mendengarnya dengan pendengaran untuk menerima dan memenuhi seruannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Yang menyampaikan kabar gembira bagi orang-orang Mukmin dengan apa yang Allah sediakan bagi mereka, yaitu balasan besar, yang memperingatkan orang-orang kafir dari azab Allah yang pedih, lalu kebanyakan dari mereka malah berpaling darinya. Mereka tidak mendengar kandungannya yang merupakan petunjuk dengan pendengaran untuk menerimanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. بَشِيرًا (yang membawa berita gembira) Bagi para kekasih Allah. وَنَذِيرًا(dan yang membawa peringatan) Bagi para musuh Allah. فَأَعْرَضَ أَكْثَرُهُمْ (tetapi kebanyakan mereka berpaling) Sehingga kebanyakan orang kafir berpaling dari peringatan yang dikandungnya. فَهُمْ لَا يَسْمَعُونَ (dan mereka tidak mau mendengarkan) Yakni enggan mendengar untuk mendapat manfaat darinya akibat keberpalingan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Al-Qur’an itu memberikan kabar gembira kepada orang-orang mukmin tentang surga jika mereka mau mengamalkannya dan memberi peringatan kepada orang-orang yang berbuat maksiat yang menyimpang tentang neraka. Kebanyakan orang-orang kafir tidak mau menerimanya. Mereka tidak mau mendengarkannya dengan penuh perhatian, tidak mau menerimanya dan tidak mau mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang membawa berita gembira dan peringatan} kabar gembira bagi orang-orang mukmin dan peringatan bagi orang-orang kafir {Dan kebanyakan mereka berpaling serta tidak mendengarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “yang membawa berita gembira dan yang membawa peringatan,” maksudnya, membawa berita gembira berupa pahala di dunia dan akhirat, dan membawa peringatan berupa siksa di dunia dan akhirat. Lalu Allah menjelaskan rinciannya, menyebutkan sebab-sebab dan karakter-karakter yang dengannya kabar gembira dan peringatan itu terlaksana. Ciri-ciri yang dimilki al-qur’an ini mengharuskan supaya ia direspon dengan sikap menerima, tunduk, meyakini, dan mengamalkannya. Akan tetapi kebanyakan manusia berpaling seperti berpalingnya orang-orang yang menyombongkan diri, “maka mereka tidak mau mendengarkan,” nya dengan tujuan menerima dan merespon positif, sekalipun mereka telah mendengarnya yang dengannya hujjah syar’I telah tegak atas mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 4: (Yang membawa berita gembira) menjadi sifat dari lafal Qur-aanan (dan yang membawa peringatan, tetapi kebanyakan mereka berpaling darinya maka mereka tidak mau mendengarkan) dengan pendengaran yang terdorong oleh perasaan mau menerima apa yang didengarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sebagai pemberi kabar gembira dengan pahala baik cepat atau lambat, serta pemberi peringatan dengan azab baik cepat atau lambat. Demikian pula merincikannya, menyebutkan sebab maupun sifat yang membuat mereka memperoleh berita gembira atau peringatan itu. Sifat demikian yang dimiliki kitab ini mengharuskan kitab tersebut diterima, diikuti, diimani dan diamalkan, akan tetapi kebanyakan manusia berpaling darinya dengan sikap sombong. Maksudnya tidak mendengarkan yang membuat mereka menerima dan mengikuti, mereka hanya mendengarkan sebagai penegak hujjah bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 4",
    "description": "Al-qur'an itu adalah kitab yang membawa berita gembira bagi orang-orang yang beriman dan beramal saleh, dan peringatan bagi orang-orang yang membuat kerusakan di muka bumi, tetapi sangat disayang-kan karena kebanyakan dari mereka orang-orang yang membuat kerusakan itu berpaling dari petunjuk-Nya serta hal itulah yang membuat mereka tidak mendengarkan yakni tidak menyambut berita gembira dan per-ingatan itu. 5. Penolakan dan keberpalingan orang-orang musyrik mekah terhadap Al-Qur'an itu mereka nyatakan dalam bentuk pengakuan langsung. Dan mereka orang-orang musyrik mekah itu, berkata, 'hati dan akal pikiran kami sudah tertutup dan terkunci rapat dari apa yang engkau seru kami kepadanya, dan telinga kami sudah tersumbat sehingga kami tidak dapat mendengar apa pun yang engkau sampaikan, dan di antara kami dan engkau ada dinding pembatas yang sangat tebal. Oleh karena itu, lakukanlah apa yang sesuai menurut kehendakmu, dan demikian pula sesungguhnya kami akan melakukan apa yang sesuai menurut kehendak kami. '."
  }
]