[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menyimpang dari kebenaran, di mana mereka kafir kepada al-Qur’an dan merubahnya, tidaklah samar bagi Kami, sebaliknya Kami mengetahui mereka. Maka apakah orang yang menyimpang dalam ayat-ayat Allah ini yang akan dicampakkan ke dalam api neraka lebih baik atau orang yang datang di Hari Kiamat dalam keadaan aman dari azab Allah dan dia berhak atas pahalaNya karena dia beriman kepadaNya dan membenarkan ayat-ayatNya? Berbuatlah kalian (wahai orang-orang yang menyimpang) sesuka kalian, karena sesungguhnya Allah Maha Melihat amal perbuatan kalian, tiada sedikit pun yang samar bagiNya, dan Dia akan membalas kalian atas itu. Dalam ayat ini mengandung ancaman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya orang-orang yang menyimpang dari kebenaran dalam ayat-ayat Allah dengan mengingkarinya, mendustakannya dan menyelewengkannya, keadaan mereka tidaklah samar bagi Kami, Kami mengetahui mereka. Siapa yang lebih baik keadaannya, orang yang dicampakkan ke dalam Neraka atau orang yang datang di hari Kiamat dalam keadaan aman dari azab? Beramallah -wahai manusia- sesuka kalian, berupa yang baik maupun yang buruk, Kami telah menjelaskan kepada kalian kebaikan dan keburukan. Sesungguhnya Allah Maha melihat apa yang kalian lakukan berupa kebaikan atau keburukan, tidak ada sedikit pun dari amal kalian yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Orang-orang yang mendustakan dan mengubah ayat-ayat al-Qur’an sama sekali tidak dapat sembunyi dari Allah. Apakah orang yang dilempar ke neraka karena kekafirannya lebih baik daripada orang yang datang pada hari kiamat dalam keadaan aman dari azab Allah? Jawaban dari pertanyaan ini tidak disebutkan agar dapat mempersingkat kalimatnya, karena jawabannya telah diketahui dengan jelas; yaitu: Tidak, namun orang yang datang pada hari kiamat dalam keadaan aman dari azab Allah lebih baik, dan mereka adalah oarng-orang yang beriman dan mengesakan Allah. Kemudian Allah mengancam orang-orang yang ingkar: “Berbuatlah sesuka hati kalian, karena Allah Maha Melihat apa yang kalian perbuat, tidak ada yang tersembunyi dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّ الَّذِينَ يُلْحِدُونَ فِىٓ ءَايٰتِنَا (Sesungguhnya orang-orang yang mengingkari ayat-ayat Kami) Yakni orang-orang yang berpaling dari kebenaran, sehingga mereka mengubah kalamullah dan meletakkannya bukan pada tempatnya. لَا يَخْفَوْنَ عَلَيْنَآ ۗ( mereka tidak tersembunyi dari Kami) Namun Kami mengetahui mereka, sehingga Kami akan membalas mereka sesuai amalan mereka. أَفَمَن يُلْقَىٰ فِى النَّارِ خَيْرٌ أَم مَّن يَأْتِىٓ ءَامِنًا يَوْمَ الْقِيٰمَةِ ۚ( Maka apakah orang-orang yang dilemparkan ke dalam neraka lebih baik, ataukah orang-orang yang datang dengan aman sentosa pada hari Kiamat) Yakni orang-orang yang ingkar yang disebutkan dalam ayat ini akan dilemparkan ke dalam neraka, sedangkan orang-orang beriman datang dengan rasa aman pada hari kiamat; maka tegaskanlah golongan mana yang lebih baik. اعْمَلُوا۟ مَا شِئْتُمْ ۖ إِنَّهُۥ بِمَا تَعْمَلُونَ بَصِيرٌ(Perbuatlah apa yang kamu kehendaki; Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan) Dan Allah akan membalas kalian sesuai dengan amalan kalian. Al-Zajjaj mengatakan bahwa kata ‘perbuatlah’ merupakan kata perintah yang berarti ancaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya orang-orang yang menyimpang dari ayat-ayat Al-Qur’an dengan memberikan penafsiran yang bathil dan hujatan tentangnya. Mereka tidak takut kepada Allah, namun Kami akan memberitahu mereka dan menghukum mereka dengan sesuatu yang layak bagi mereka. Manakah yang lebih baik antara orang yang dilemparkan ke dalam neraka karena kekufuran dan kemaksiatannya atau orang yang diberi keamanan dari azab Allah pada hari kiamat karena keimanannya kepada Allah dan rasulNya ?! Wahai manusia kenalilah apa yang kalian inginkan berupa kebaikan atau keburukan. Sesungguhnya Allah mengetahui apa yang kalian kerjakan dan membalas kalian atas perbuatan tersebut. Ancaman, peringatan keras dan janji pembalasan ini supaya manusia mau memperhatikan kelalaian mereka. Ayat ini diturunkan untuk Abu Jahal dan Ammar bin Yasir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mengingkari} menyimpang dari kebenaran {ayat-ayat Kami, mereka tidak tersembunyi dari Kami. Apakah orang-orang yang dilemparkan ke dalam neraka itu lebih baik ataukah orang yang datang pada hari kiamat dengan aman. Lakukanlah apa yang kalian kehendaki. Sesungguhnya Dia Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. ilhad terhadap ayat-ayat Allah adalah membelokkan dari sebenarnya dengan cara apapun, apakah dengan cara mengingkari, tidak mempercayainya dan mendustakan orang yang membawanya, ataupun dengan cara memalingkan dan mengalihkannya dari maknanya yang hakiki dan menetapkan makna-makna yang samasekali bukan yang Allah kehendaki. Maka dari itu Allah mengancam siapa yang bersikaf ilhad terhadap ayat-ayatNya, bahwa semua itu tidak ada yang tersembunyi dari Allah, bahkan Dia mengetahui lahir dan batin orang itu, dan Dia akan membalasnya atas sikap ilhadnya sesuai dengan apa yang telah dilakukannya. Karena itu di sini Allah berfirman, “Maka apakah orang-orang yang dilemparkan ke dalam nereka” seperti orang yang mulhid terhadap ayat-ayat Allah itu “lebih baik ataukah orang-orang yang datang dengan aman sentosa pada Hari Kiamat.” Dari azab Allah lagi berhak mendapat pahalaNya? Sudah dimaklumi bahwa inilah yang terbaik. Setelah yang haq menjadi jelas dari kebatilan, dan jalan yang dapat menyelamatkan dari azabNya dari jalan yang membinasakan, Dia berfirman “perbuatlah apa yang kamu kehendaki” jika kalian mau, silahkan menempuh jalam leberuntungan yang dapat mengantarkan kepada ridha dan surga Rabb kalian, dan jika kalian mau, silahkan menempuh jalan kesesatan yang membuat murka Rabb, yang bisa menceburkan kalian ke negeri kesengsaraan.”sesungguhnya Dia Maha Melihat apa yang kamu kerjakan”. Dia akan membalas kalian sesuai dengan kondisi dan perbuatan kalian. Ayat ini sama dengan firrmanNya yang lain, “Dan katakanlah: \"Kebenaran itu datangnya dari Tuhanmu; maka barangsiapa yang ingin (beriman) hendaklah ia beriman, dan barang siapa yang ingin (kafir) biarlah ia kafir\". (Al-Kahfi :29)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 40: (Sesungguhnya orang-orang yang mengingkari) diambil dari kata Alhada dan Lahada artinya ingkar (kepada ayat-ayat Kami) yakni Alquran dengan cara mendustakannya (mereka tidak tersembunyi dari Kami) maka pasti Kami akan membalas mereka. (Maka apakah orang-orang yang dilemparkan ke dalam neraka lebih baik ataukah orang-orang yang datang dengan aman sentosa pada hari kiamat? Perbuatlah apa yang kalian kehendaki; sesungguhnya Dia Maha Mengetahui apa yang kalian kerjakan) ayat ini merupakan ancaman bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yulhiduun (menyimpang) dalam ayat tersebut maksudnya menyimpang dari yang benar, yaitu bisa dengan mengingkarinya, menolaknya, mendustakan yang membawanya, mengalihkannya dari makna yang hakiki serta menetapkan makna-makna lain yang tidak dikehendaki Allah ‘Azza wa Jalla. Yakni oleh karena itu, Kami akan balas mereka. Allah mengancam orang-orang yang berbuat ilhad (penyimpangan) terhadap ayat-ayat-Nya, bahwa orang itu tidak tersembunyi bagi-Nya, bahkan Allah melihat luar dan dalamnya, dan Dia akan membalas ilhadnya itu. Oleh karena itulah, lanjutan ayatnya, “Apakah orang-orang yang dilemparkan ke dalam neraka yang lebih baik ataukah mereka yang datang dengan aman sentosa pada hari Kiamat?” Sudah jelas bahwa orang ini (yang datang dalam keadaan aman sentosa) lebih baik. Setelah jelas yang hak dari yang batil, jalan yang selamat dan jalan yang membinasakan, Allah berfirman, “Lakukanlah...dst.” Kalimat ini merupakan kalimat ancaman. Yakni jika kamu mau, maka tempuhlah jalan yang lurus yang menghubungkan kepada keridhaan Allah dan surga-Nya, dan jika kamu mau, maka tempuhlah jalan yang sesat yang membuat murka Tuhanmu yang membawamu ke tempat yang menyengsarakan. Hal ini sebagaimana firman Allah Ta’ala, “Dan katakanlah, \"Kebenaran itu datangnya dari Tuhanmu; maka barang siapa yang ingin (beriman) hendaklah ia beriman, dan barang siapa yang ingin (kafir) biarlah ia kafir.” Sesungguhnya Kami telah menyediakan bagi orang orang zalim itu neraka, yang gejolaknya mengepung mereka. dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.” (Al Kahfi: 29) Dia akan membalas kamu sesuai keadaan dan amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 40",
    "description": "Sangatlah logis bila dikatakan bahwa orang-orang yang mengingkari tanda-tanda kebesaran dan kemahakuasaan Allah tidak akan mampu bersembunyi dari penglihatan-Nya, karena Allah itu zat yang maha melihat lagi maha mengetahui. Ayat berikut memperingatkan dengan mengancam mereka. Sesungguhnya orang-orang yang mengingkari tanda-tanda kebesaran kami dengan menempuh jalan yang sesat, mereka itu sedetik pun tidak tersembunyi dari tilikan kami. Maka jika demikian manakah yang terbaik, apakah arang-orang yang dilemparkan ke dalam neraka yang lebih baik, ataukah mereka yang datang dengan aman sentosa pada hari kiamat' oleh sebab itu, katakanlah kepada orang-orang yang durhaka itu, 'lakukanlah apa saja yang kamu kehendaki sesuka hatimu! sungguh, dia maha melihat apa yang kamu kerjakan dan membalas kamu sesuai dengan apa yang kamu perbuat itu. 41. Ayat-ayat Allah ada yang terbentang di alam raya dan ada yang termaktub dalam Al-Qur'an. Bahkan Al-Qur'an adalah himpunan dari ayat-ayat Allah. Sebagaimana orang-orang yang mengingkari ayat-ayat Allah yang terbentang di alam raya ini, orang-orang yang mengingkari Al-Qur'an juga akan menjadi celaka. Sesungguhnya orang-orang yang mengingkari Al-Qur'an ketika Al-Qur'an itu disampaikan kepada mereka, mereka itu pasti akan celaka jika tidak segera bertobat, dan sesungguhnya Al-Qur'an itu adalah kitab yang mulia dari zat yang mahamulia lagi mahaperkasa."
  }
]