[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Sesungguhnya orang-orang yang ingkar kepada Al-Quran itu dan mendustakannya saat ia datang kepada mereka adalah orang-orang yang celaka lagi disiksa. Sesungguhnya al-Quran ini adalah kitab yang mulia dengan pemuliaan dari Allah dan penjagaanNYa terhadapnya dari segala perubahan dan pergantian, kebatilan tidak menyusupinya dari arah manapun dan tidak ada sesuatu pun yang membatalkannya, ia terjaga sehingga tidak bisa dikurangi atau ditambah, diturunkan dari Allah yang Mahabijaksana dengan mengatur segala perkara hamba-hambaNya, Dia Mahaterpuji karena Dia memiliki sifat-sifat kesempurnaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Sesungguhnya orang-orang yang kafir kepada Al-Qur`ān ketika datang kepada mereka dari sisi Allah benar-benar akan diazab pada hari Kiamat. Sesungguhnya Al-Qur`ān itu adalah kitab yang mulia lagi sangat kokoh, tidak orang yang bisa memanipulasinya dan juga tidak ada orang yang bisa merubahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Orang-orang yang mendustakan al-Qur’an dari Allah saat al-Qur’an itu datang kepada mereka maka akan mendapat azab yang sangat berat. Al-Qur’an adalah kitab yang Allah jaga dan lindungi dari segala perubahan, pengurangan, dan penambahan; sehingga tidak akan bercampur dengan kebatilan dari sisi manapun. Ia adalah kitab yang diturunkan Tuhan Yang Maha Bijaksana dalam perkataan dan perbuatan-Nya, dan Maha Terpuji setiap saat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. إِنَّ الَّذِينَ كَفَرُوا۟ بِالذِّكْرِ لَمَّا جَآءَهُمْ ۖ (Sesungguhnya orang-orang yang mengingkari Al Quran ketika Al Quran itu datang kepada mereka) Yakni orang-orang yang kafir terhadap al-Qur’an ketika al-Qur’an itu didatangkan kepada mereka, maka mereka akan dibalas atas kekafiran mereka. وَإِنَّهُۥ لَكِتٰبٌ عَزِيزٌ(dan sesungguhnya Al Quran itu adalah kitab yang mulia) Yakni al-Qur’an yang dahulu mereka ingkari sungguh sangat mulia yang tidak pantas untuk dilawan atau dijelek-jelekkan, dan ia jauh dari kekurangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Sesungguhnya orang-orang yang mengingkari Al-Qur’an dan mendustakan apa yang terkandung di dalamnya maka mereka akan dibalas atas kekufuran mereka. Sesungguhnya Al-Qur’an yang mulia itu adalah kitab yang tidak bisa diperlakukan dengan bathil, tidak ada penyimpangan darinya dan tidak bisa diubah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mengingkari Adz-Dzikr} Al-Qur’an {ketika disampaikan kepada mereka, Sesungguhnya (Al-Qur’an) itu adalah kitab yang mulia} dijaga sehingga tidak ada kesia-siaan dan tidak pula penyimpangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. kemudian Allah berfirman, “sesungguhnya orang-orang yang mengingkari ad-dzikr,” maksudnya mengingkari al-quran al-karim yang mengingatkan manusia akan seluruh kepentingan dunia, agama dan akhirat mereka, yang meninggikan kedudukan siapa saja yang mengikutinya “ketika ia datang kepada mereka” sebagai nikmat dari Tuhan mereka melalui tangan manusia termulia dan tersempurna “dan” padahal “sesungguhnya ia” adalah kitab yang mencakup seluruh sufat-sifat kesempurnaan “yang mulia” yang kokoh dari setiap siapa saja yang menghendaki tahrif atau keburukan terhadapnya, dan karena itu Allah berfirman “yang tidak datang kepada kebatilan, baik dari depan maupun dari belakangnya,” maksudnya tidak akan didekati oleh setan dari golongan manusia dan dari golongan jin, apakah untuk mencuri, atau menyusupkan sesuatu yang bukan darinya, atau melakukan penambahan atau pengurangan, jadi ia terpelihara pada saat diturunkan, terpelihara lafazh-lafazh dan makna-maknanya, telah dijamin oleh Allah yang menurunkan keterpeliharaannya, sebagaimana difirmankan oleh Allah, “Sesungguhnya Kami-lah yang menurunkan Al Qur'an, dan sesungguhnya Kami benar-benar memeliharanya.” (Al-Hijr :9) “yang diturunkan dari yang Mahabijaksana” dalam menciptakan dan memerintah, Dia menempatkan segala sesuatu secara tepat pada tempatnya dan mendudukannya pada kedudukan masing-masing “lagi Maha Terpuji” atas sifat-sifat kesempurnaan dan kemuliaan yang dimilikiNya. Dan atas keadilan dan pemberian karuniaNya, maka dari itu kitabNYa mengandung kesempurnaan hikmah dan perolehan berbagai maslahat dan manfaat serta pencegahan terhadap segala hal yang merusak dan berbagai hal yang membahayakan, yang karena semua itu Dia terpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 41: (Sesungguhnya orang-orang yang mengingkari peringatan) Alquran (ketika ia datang kepada mereka) niscaya Kami akan membalas mereka (dan sesungguhnya Alquran itu adalah kitab yang mulia) artinya, perkasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Qur’an dalam ayat di atas disebut adz dzikr (pengingat), karena ia mengingatkan hamba segala maslahat mereka baik yang terkait dengan agama, dunia maupun akhirat dan meninggikan kedudukan orang yang mengikutinya. Sebagai nikmat dari Tuhanmu melalui tangan manusia paling baik (Nabi Muhammad shallallahu 'alaihi wa sallam). Yang menghimpun semua sifat sempurna. Bisa juga diartikan dengan yang disegani, yakni orang yang berkeinginan buruk terhadapnya seperti merubah atau berniat buruk lainnya merasa segan dan enggan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 41",
    "description": "Ayat-ayat Allah ada yang terbentang di alam raya dan ada yang termaktub dalam Al-Qur'an. Bahkan Al-Qur'an adalah himpunan dari ayat-ayat Allah. Sebagaimana orang-orang yang mengingkari ayat-ayat Allah yang terbentang di alam raya ini, orang-orang yang mengingkari Al-Qur'an juga akan menjadi celaka. Sesungguhnya orang-orang yang mengingkari Al-Qur'an ketika Al-Qur'an itu disampaikan kepada mereka, mereka itu pasti akan celaka jika tidak segera bertobat, dan sesungguhnya Al-Qur'an itu adalah kitab yang mulia dari zat yang mahamulia lagi mahaperkasa. 42. Al-qur'an itu adalah kitab yang tidak akan didatangi oleh kebatilan baik dari depan maupun dari belakang, baik pada masa lalu dan yang akan datang, kitab yang diturunkan dari tuhan yang mahabijaksana lagi maha terpuji."
  }
]