[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Sesungguhnya orang-orang yang ingkar kepada Al-Quran itu dan mendustakannya saat ia datang kepada mereka adalah orang-orang yang celaka lagi disiksa. Sesungguhnya al-Quran ini adalah kitab yang mulia dengan pemuliaan dari Allah dan penjagaanNYa terhadapnya dari segala perubahan dan pergantian, kebatilan tidak menyusupinya dari arah manapun dan tidak ada sesuatu pun yang membatalkannya, ia terjaga sehingga tidak bisa dikurangi atau ditambah, diturunkan dari Allah yang Mahabijaksana dengan mengatur segala perkara hamba-hambaNya, Dia Mahaterpuji karena Dia memiliki sifat-sifat kesempurnaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Kebatilan tidak bisa datang kepadanya, tidak dari depan dan tidak dari belakangnya dengan pengurangan, penambahan, penggantian atau penyelewengan. Dia diturunkan dari Allah yang Maha Bijaksana dalam penciptaan, takdir dan tasyri'-Nya, Maha Terpuji dalam segala keadaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. لَّا يَأْتِيهِ الْبٰطِلُ مِنۢ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِۦ ۖ (Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya) Yakni al-Qur’an itu terjaga dari pengurangan atau penambahan, dan tidak didustakan oleh kitab-kitab terdahulu, serta tidak ada kitab setelahnya yang akan menghapusnya. تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ (yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji) Yakni bagaiman ia akan terjangkit kebatilan sedangkan Yang menurunkannya memiliki hikmah yang sempurna dan sifat yang Maha Tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Orang bathil itu tidak bisa merintangi Al-Qur’an dengan menguranginya, menambahinya, dan mendustakannya dengan mendatangkan kitab lain, atau mencabut kitab lain yang digunakan untuk mencacatinya, Al-Qur’an itu diturunkan dari Tuhan yang Maha Bijaksana dalam segala tindakanNya, mengatur urusan-urusan ciptaanNya, dipuji dalam segala keadaan dan dipuji oleh seluruh makhlukNya atas kenikmatan melimpah yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada kebathilan yang mendatanginya} yang mendatanginya {baik dari depan maupun dari belakang} dari segala arah {yang diturunkan dari Tuhan Yang Maha bijaksana lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. kemudian Allah berfirman, “sesungguhnya orang-orang yang mengingkari ad-dzikr,” maksudnya mengingkari al-quran al-karim yang mengingatkan manusia akan seluruh kepentingan dunia, agama dan akhirat mereka, yang meninggikan kedudukan siapa saja yang mengikutinya “ketika ia datang kepada mereka” sebagai nikmat dari Tuhan mereka melalui tangan manusia termulia dan tersempurna “dan” padahal “sesungguhnya ia” adalah kitab yang mencakup seluruh sufat-sifat kesempurnaan “yang mulia” yang kokoh dari setiap siapa saja yang menghendaki tahrif atau keburukan terhadapnya, dan karena itu Allah berfirman “yang tidak datang kepada kebatilan, baik dari depan maupun dari belakangnya,” maksudnya tidak akan didekati oleh setan dari golongan manusia dan dari golongan jin, apakah untuk mencuri, atau menyusupkan sesuatu yang bukan darinya, atau melakukan penambahan atau pengurangan, jadi ia terpelihara pada saat diturunkan, terpelihara lafazh-lafazh dan makna-maknanya, telah dijamin oleh Allah yang menurunkan keterpeliharaannya, sebagaimana difirmankan oleh Allah, “Sesungguhnya Kami-lah yang menurunkan Al Qur'an, dan sesungguhnya Kami benar-benar memeliharanya.” (Al-Hijr :9) “yang diturunkan dari yang Mahabijaksana” dalam menciptakan dan memerintah, Dia menempatkan segala sesuatu secara tepat pada tempatnya dan mendudukannya pada kedudukan masing-masing “lagi Maha Terpuji” atas sifat-sifat kesempurnaan dan kemuliaan yang dimilikiNya. Dan atas keadilan dan pemberian karuniaNya, maka dari itu kitabNYa mengandung kesempurnaan hikmah dan perolehan berbagai maslahat dan manfaat serta pencegahan terhadap segala hal yang merusak dan berbagai hal yang membahayakan, yang karena semua itu Dia terpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 42: (Yang tidak datang kepadanya Alquran kebatilan baik dari depan maupun dari belakangnya) yakni tidak ada suatu kitab pun sebelumnya yang mendustakannya, dan tidak pula sesudahnya (yang diturunkan dari Tuhan Yang Maha Bijaksana lagi Maha Terpuji) Allah Yang Maha Terpuji di dalam semua urusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan dengan tidak didekati oleh setan baik dari kalangan jin maupun manusia, baik dengan dicuri, dimasukkan ke dalamnya sesuatu yang bukan bagian darinya, ditambah atau dikurangi, sehingga ia terjaga ketika turunnya, baik lafaz maupun maknanya, karena telah dipelihara oleh Tuhan yang menurunkannya sebagaimana firman Allah Ta’ala, “Sesungguhnya Kamilah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya.” (Terj. Al Hijr: 9). Baik dalam ciptaan-Nya maupun perintah-Nya, dan Dia menempatkan sesuatu pada tempatnya serta memposisikan sesuatu pada posisinya. Karena sifat-sifat sempurna dan sifat-sifat keagungan yang dimiliki-Nya dan karena keadilan dan karunia-Nya. Oleh karena itulah, kitab-Nya penuh hikmah, menghasilkan maslahat dan manfaat, menghindarkan mafsadat dan bahaya, yang berhak untuk dipuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 42",
    "description": "Al-qur'an itu adalah kitab yang tidak akan didatangi oleh kebatilan baik dari depan maupun dari belakang, baik pada masa lalu dan yang akan datang, kitab yang diturunkan dari tuhan yang mahabijaksana lagi maha terpuji. 43. Jelaslah sekarang, dari ungkapan ayat-ayat yang lalu, tindakan durhaka yang dilakukan oleh para pendurhaka yang memaki dan mengejek nabi dan rasul sama saja dengan apa yang dilakukan oleh musyrik mekah terhadap nabi Muhammad. 'apa yang dikatakan oleh orang-orang kafir musyrik mekah kepadamu wahai nabi Muhammad, apakah itu menyangkut dirimu, ataupun menyangkut Al-Qur'an, tidak lain adalah sama dengan apa yang telah dikatakan kepada rasul-rasul sebelummu. Oleh sebab itu, bersabarlah atas makian dan ejekan mereka. Sungguh, tuhanmu akan melindungi dan membimbingmu, dan dia mempunyai ampunan bagi orang-orang beriman dan mempunyai azab yang pedih untuk orang-orang yang durhaka. '."
  }
]