[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu tidak berkata kepadamu (wahai Rasul) kecuali apa yang telah dikatakan oleh umat-umat sebelum mereka kepada utusan-utusan mereka. Maka bersabarlah atas apa yang kamu dapatkan di jalan dakwah kepada Allah. Sesungguhnya Tuhanmu adalah pemilik ampunan bagi dosa orang-orang yang bertaubat, namun Dia juga pemilik hukuman bagi siapa yang mempertahankan kekafiran dan mendustakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Pendustaan yang di alamatkan kepadamu -wahai Rasul- sama dengan pendustaan yang dialamatkan kepada rasul-rasul sebelummu, maka bersabarlah, sesungguhnya Rabbmu Pemilik ampunan bagi siapa yang bertobat kepada-Nya dari hamba-hamba-Nya, sekaligus Pemilik hukuman yang pedih bagi siapa yang bersikukuh di atas dosa-dosanya dan tidak bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Hai Rasulullah, kebohongan-kebohongan yang dikatakan orang-orang musyrik kepadamu tidak lain seperti yang dikatakan umat-umat terdahulu yang mendustakan para rasul mereka. Sungguh Tuhanmu Pemilik ampunan bagi orang-orang beriman dan bertaubat dan Pemilik azab yang pedih bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. مَّا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِن قَبْلِكَ ۚ (Tidaklah ada yang dikatakan (oleh orang-orang kafir) kepadamu itu selain apa yang sesungguhnya telah dikatakan kepada rasul-rasul sebelum kamu) Yakni orang-orang kafir yang menuduhmu sebagai tukang sihir, pendusta, dan orang gila adalah seperti apa yang dituduhkan kepada rasul-rasul sebelummu, begitulah kaum mereka menuduh mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Ucapan orang-orang kafir Qurays kepadamu tentang penggambaran bahwa kamu penyihir, pendusta, orang gila, dan pendustaan terhadap risalahmu itu tidak lain kecuali hal serupa yang diucapkan oleh umat-umat terdahulu kepada para rasul mereka. Maka bersabarlah atas penderitaan sebagaimana mereka bersabar. Sesungguhnya Tuhanmu itu pemilik ampunan bagi orang-orang mukmin yang mau bertaubat dan pemilik azab yang pedih bagi orang-orang kafir yang menjadi musuh-musuh Allah dan mendustakan risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang dikatakan kepadamu tidak lain adalah apa yang telah dikatakan kepada rasul-rasul sebelummu. Sesungguhnya Tuhanmu pasti mempunyai ampunan dan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. artinya “tidak ada yang dikatakan kepadamu” wahai Rosul, dari perkataan-perkataan yang berasal dari orang-orang yang mendustakanmu dan keras kepala terhadapmu, “selain apa yang sesungguhnya telah dikatakan kepada rosul-rosul sebelum kamu,” maksudnya, yang sejenis dengannya. Bahkan bisa jadi mereka mengutarakan perkataan yang persis sama, seperti rasa heran seluruh umat yang mendustakan para rosul terhadap seruan para rosul untuk ikhlas kepada Allah dan beribadah hanya kepadaNya, tiada sekutu baginya, dan penolakan mererka terhadap seruan ini dengan segala cara yang mampu mereka lakukan. Dan ucapan mereka, “kalian hanyalah seorang manusia biasa seperti kami,” dan usulan mereka kepada para rasul untuk menghadirkan ayat-ayat yang diharuskan kepada mereka kehadirannya.. dan berbagai ucapan lainnya dari orang-orang yang mendustakan. Setelah hati mereka serupa dalam kekafiran, maka serupa pula perkataan-perkataan mereka. Dan para rosul pun bersikaf sabar terhadap gangguan dan pendustaan mereka. Maka bersabarlah kamu sebagaimana para rosul sebelummu bersabar. Kemudian Allah menyeru mereka kepada taubat dan melakukan segala sebab yang bisa membuahkan ampunan, dan Allah juga memperingatkan mereka dari sikap terus bergelimang dalam kesesatan, seraya befirman, “Sesungguhnya Rabmu benar-benar mempunyai ampunan” yang sangat agung, yang dengannya Dia menghapus semua dosa orang yang berhenti melakukan dosa lagi bertaubat, “dan hukuman yang pedih” terhadap siapa saja yang terus durhaka dan menyombongkan diri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 43: (Tidaklah ada yang dikatakan kepadamu itu) yakni kedustaan (kecuali) sebagaimana (apa yang sesungguhnya telah dikatakan kepada rasul-rasul sebelum kamu. Sesungguhnya Rabbmu benar-benar mempunyai ampunan) buat orang-orang yang beriman (dan hukuman yang pedih) bagi orang-orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa kata-kata pendustaan. Yakni seperti yang dikatakan kepada para rasul sebelummu, seperti ucapan mereka, bahwa para rasul adalah manusia seperti mereka, usulan mereka kepada para rasul agar mendatangkan ayat sesuai yang mereka inginkan dsb. Ucapan tersebut sama antara sesama mereka karena memang hati mereka sama dalam kekafiran. Namun para rasul tetap bersabar atas gangguan dan pendustaan mereka, oleh karena itu bersabarlah engkau wahai Muhammad sebagaimana para rasul sebelummu bersabar. Selanjutnya Allah mengajak mereka untuk bertobat dan mendatangi sebab-sebab ampunan serta mengancam mereka agar tidak terus-menerus di atas kesesatan. Bagi orang yang berhenti dan bertobat. Bagi orang yang tetap terus di atas kekafiran dan tidak mau bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 43",
    "description": "Jelaslah sekarang, dari ungkapan ayat-ayat yang lalu, tindakan durhaka yang dilakukan oleh para pendurhaka yang memaki dan mengejek nabi dan rasul sama saja dengan apa yang dilakukan oleh musyrik mekah terhadap nabi Muhammad. 'apa yang dikatakan oleh orang-orang kafir musyrik mekah kepadamu wahai nabi Muhammad, apakah itu menyangkut dirimu, ataupun menyangkut Al-Qur'an, tidak lain adalah sama dengan apa yang telah dikatakan kepada rasul-rasul sebelummu. Oleh sebab itu, bersabarlah atas makian dan ejekan mereka. Sungguh, tuhanmu akan melindungi dan membimbingmu, dan dia mempunyai ampunan bagi orang-orang beriman dan mempunyai azab yang pedih untuk orang-orang yang durhaka. '44. Salah satu pernyataan orang-orang durhaka itu tentang Al-Qur'an adalah bahwa mereka telah menutup hati dari Al-Qur'an (ayat 5). Pernyataan itu sebenarnya ungkapan lain dari pengingkaran bahwa mereka sebenarnya tidak mau mengerti dengan Al-Qur'an. Dan sekiranya Al-Qur'an yang kami turunkan itu, kami jadikan sebagai bacaan dalam bahasa selain bahasa arab atau dalam bahasa arab tetapi tidak jelas maknanya bagi orang-orang kafir itu, niscaya mereka mengatakan dengan nada mengecam, 'mengapa tidak dijelaskan dan diperinci apa maksud ayat-ayatnya'' kecaman orang-orang kafir itu dijawab Allah dalam Al-Qur'an sendiri, 'apakah patut Al-Qur'an diturunkan dalam bahasa selain bahasa arab, sedangkan rasul yang membawanya dan masyarakat yang ditujunya ketika itu adalah orang arab yang berbahasa arab' katakanlah, wahai nabi Muhammad, 'Al-Qur'an itu secara khusus adalah sebagai petunjuk dan penyembuh bagi orang-orang yang beriman. Dan sedangkan bagi orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan Al-Qur'an itu merupakan kegelapan bagi mereka. Mere-ka itu seperti orang-orang yang dipanggil dari tempat yang jauh sehingga mereka tidak mendengar panggilan orang yang memanggil. ''."
  }
]