[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Kami menjadikan al-Quran yang telah Kami turunkan kepadamu ini (wahai Rasul) dengan bahasa Ajam (selain Arab), niscaya orang-orang musyrik akan berkata, “Mengapa ayat-ayatnya tidak dijelaskan kepada kami agar kami bisa memahami dan mengetahuinya?” apakah patut al-Quran ini dengan bahasa Ajam sedangkan ia diturunkan kepada pemilik lisan Arab? Hal ini tidak terjadi. Katakanlah kepada mereka (wahai Rasul) “Al-Quran ini bagi orang-orang yang beriman kepada Allah dan RasulNya adalah hidayah dari kesesatan, kesembuhan bagi apa yang ada di dalam dada berupa keragu-raguan dan penyakit. Dan orang-orang yang tidak beriman kepada al-Quran, telinga mereka tuli sehingga tidak mendengarnya dan tidak merenungkannya, sedangkan hati mereka juga buta terhadap al-Quran sehingga tidak mengambil petunjuk darinya. Orang-orang musyrik itu adalah seperti orang yang dipanggil dari tempat yang jauh, dia tidak mendengar suara pemanggilnya dan tidak pula menjawabnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Seandainya Kami menurunkan Al-Qur`ān ini bukan dengan bahasa Arab, niscaya orang-orang kafir akan berkata, \"Seandainya ayat-ayatnya dijelaskan agar kami memahaminya. Apakah Al-Qur`ān hadir dengan bahasa Ajam sedangkan orang yang membawanya adalah orang Arab?\" Katakankah kepada mereka -wahai Rasul-, “Al-Qur`ān bagi orang-orang yang beriman kepada Allah dan membenarkan para rasul adalah hidayah dari kesesatan dan penyembuh bagi apa yang ada di dalam dada berupa kebodohan dan dampaknya.” Dan orang-orang yang tidak beriman kepada Allah, telinga mereka tersumbat, mata mereka buta sehingga mereka tidak memahaminya. Orang-orang yang memiliki sifat-sifat demikian seperti orang yang diseru dari tempat yang jauh, bagaimana mungkin mereka mendengar seruan tersebut?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Seandainya Kami menurunkan al-Qur’an dengan selain bahasa arab niscaya orang-orang musyrik itu akan mengingkarinya dengan berkata: “Mengapa ayat-ayatnya tidak dijelaskan dengan bahasa kami sehingga kami dapat memahaminya, mengapa firman ini dengan selain bahasa arab, sedangkan rasulnya adalah orang arab?” Allah membantah mereka: Katakanlah kepada mereka, “Al-Qur’an ini merupakan hidayah bagi orang-orang beriman menuju kebenaran dan penyembuh hati dari keraguan dan kegalauan. Adapun orang-orang yang mendustakannya, dalam telinga mereka terdapat menghalang yang menghalangi mereka mendengar dan mentadabburinya, dan pada hati mereka terdapat kebutaan sehingga tidak dapat menjadikannya sebagai petunjuk. Orang-orang yang jauh dari kebenaran itu seperti orang yang dipanggil dari tempat yang jauh sehingga tidak dapat mendengar dan menjawab, tidak pula memahami panggilan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَلَوْ جَعَلْنٰهُ قُرْءَانًا أَعْجَمِيًّا (Dan jikalau Kami jadikan Al Quran itu suatu bacaan dalam bahasa selain Arab) Yakni seandainya Kami menjadikan al-Qur’an ini menggunakan selain bahasa Arab. لَّقَالُوا۟ لَوْلَا فُصِّلَتْ ءَايٰتُهُۥٓ ۖ( tentulah mereka mengatakan: “Mengapa tidak dijelaskan ayat-ayatnya?”) Yakni mengapa tidak dijelaskan dengan bahasa kami, karena kami adalah orang-orang arab yang tidak memahami bahasa selain arab. ءَا۬عْجَمِىٌّ وَعَرَبِىٌّ ۗ( Apakah (patut Al Quran) dalam bahasa asing sedang (rasul adalah orang) Arab?) Ini adalah lanjutan dari perkataan mereka. Yakni mereka tentu mengatakan “mengapa menggunakan bahasa selain Arab, sedangkan rasul adalah orang Abar? Pendapat lain mengatakan yang dimaksud adalah mengapa ayat-ayatnya tidak dibagi dan dijadikan sebagiannya berbahasa selain arab agar orang yang bukan arab dapat memahaminya. Yakni seandainya Kami melakukan itu nicaya mereka akan mengatakan perkataan yang campur aduk. قُلْ هُوَ لِلَّذِينَ ءَامَنُوا۟ هُدًى وَشِفَآءٌ ۖ( Katakanlah: “Al Quran itu adalah petunjuk dan penawar bagi orang-orang mukmin) Yang dapat menjadi petunjuk mereka kepada kebenaran dan menyembuhkan mereka dari keraguan dan syubhat. وَالَّذِينَ لَا يُؤْمِنُونَ فِىٓ ءَاذَانِهِمْ وَقْرٌ(Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan) Yakni sumbatan yang menghalangi mereka untuk mendengarnya dan memahami maknanya. Oleh sebab itu mereka saling menganjurkan agar membuat hiruk pikuk ketika al-Qur’an dibacakan. وَهُوَ عَلَيْهِمْ عَمًى ۚ( sedang Al Quran itu suatu kegelapan bagi mereka) Yang menghalangi mata mereka sehingga tidak mampu melihat kebenaran. Mereka menjadi buta dan tuli terhadap al-Qur’an. أُو۟لٰٓئِكَ يُنَادَوْنَ مِن مَّكَانٍۭ بَعِيدٍ(Mereka itu adalah (seperti) yang dipanggil dari tempat yang jauh”) Yakni mereka seperti orang yang dipanggil orang lain dari tempat yang jauh, yang dapat mendengar sedikit suara itu tanpa dapat memahami apa yang dikatakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Kalaupun Kami menjadikan Al-Qur’an selain bahasa Arab, maka orang-orang musyrik Arab itu akan berkata: “Tidakkah sebaiknya ayat-ayatnya menggunakan bahasa kami sehingga kami bisa memahaminya?!”. Mereka juga berkata: “Bagaimana bisa kalam asing selain Arab sedangkan rasulnya orang Arab?” Katakanlah kepada mereka wahai rasulallah: “Bagi orang-orang mukmin, Al-Qur’an ini adalah petunjuk menuju kebenaran dan kebaikan, obat hati dan jiwa dari kebodohan, keragu-raguan dan kesamaran” Adapun orang-orang yang tidak mengimani Al-Qur’an, maka di dalam pikiran mereka itu ada kebuntuan untuk mendengarnya dan memahami maknanya. Hati mereka dibutakan tentangnya sehingga mereka tidak bisa memahaminya, karena mereka pura-pura buta tentang ayat-ayat Al-Qur’an. Orang-orang yang tidak mengimani Al-Qur’an itu seperti orang yang diseru dari kejauhan sehingga mereka tidak mampu mendengar dan memahami apa yang diserukan kepadanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Kami menjadikannya bacaan dalam bahasa ‘ajam} bahasa selain bahasa Arab {niscaya mereka akan berkata,“Mengapa ayat-ayatnya tidak dijelaskan} mengapa ayat-ayatnya tidak dijelaskan {”Apakah pantas dalam bahasa ‘ajam, sedangkan (rasul) orang Arab} apakah pantas Al-Qur’an itu dalam bahasa ‘ajam sedangkan rasul orang Arab {Katakanlah,“Al-Qur’an adalah petunjuk dan penyembuh bagi orang-orang yang beriman, sedangkan orang-orang yang tidak beriman, pada telinga mereka ada penyumbat} ketulian {dan mereka buta terhadapnya. Mereka itu (seperti) orang-orang yang dipanggil} seperti orang yang diseru {dari tempat yang jauh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Allah mengabarkan tentang karunia dan kemurahanNya, yang mana Dia telah menurunkan kitab suciNya dalam bahasa arab kepada rasul yang berasal dari bangsa arab, dengan bahasa kaumnya agar ia bisa menjelaskanya kepada meeka. Hali ini tentu termasuk hal semestinya wajib mendapat perhatian lebih, dipelajari dan tunduk kepadanya. Dan sesungguhnya jikalau Allah menjadikan al-qur’an ini suatu bacaan dalam bahasa ajam, bukan dalam bahasa arab, tentu oang yang akan mendustakan itu melakukan protes dan mengatakan,”mengapa tidak dijelaskan ayat-ayatnya,” maksudnya, kenapa ayat-ayatnya tidak diterangkan, tidak diuraikan dan tidak ditafsirkan.”apakah dalam bahasa ajam sedang ia arab?” maksudnya, bagaimana Muhammad itu seorang arab lalu al-qur’annya berbahasa selain arab?! Ini tidak mungkin! Karena itu Allah menafikan segala perkara yang ada di dalamnya tentang kitab suciNya, dan Dia menguraikan dengan uraian yang memastikan mereka harus tunduk. Akan tetapi hanya orang-orang yang beriman yang mendapat taufik sajalah yang akan bisa mengambil manfaat (pelajaran) darinya dan menjadi mulia, sedangkan selain mereka adalah kebalikan dari sikap orang-orang yang beriman itu. Maka dari itu Allah berfirman ”katakanlah,’al-qur’an itu adalah petunjuk dan penawar bagi orang-orang yang beriman.” Ia menunjukkan kepada mereka kebenaran dan jalan yang lurus dan mengajarkan kepada mereka kebenaran dan jalan yang lurus dan mengajarkan kepada mereka berbagai ilmu yang berguna yang dengannya hidayah yang sempurna dapat dicapai; dan sebagai penawar bagi mereka dari berbagai penyakit fisik dan penyakit hati. Sebab al-qur’an melarang akhlak yang tidak baik dan segala perbuatan yang buruk, dan ia mengajak pada taubat yang tulus yang dapat membersihkan dosa dan menyembuhkan hati. “dan orang-orang yang tidak beriman,” kepada al-qur’an “pada telinga mereka ada sumbatan,” maksudnya, tuli, tidak dapat mendengarkannya dan berpaling. “sedang al-qur’an itu suatu kegelapan bagi mereka,” maksudnya,mereka tidak bisa melihat kebenaran dengannya, tidak dapat petunjuk dengannnya dan hanya makin menambah mereka sesat. Sebab, apabila mereka menolak yang benar, maka mereka menambah kebutaan kepada kebutaan mereka yang sudah menambah kesesatan mereka yang sudah ada. “mereka dipanggil untuk tempat yang jauh,” maksudnya, mereka diseru untuk beriman dan diajak kepadanya, namun mereka tidak terima. Seperti orang-orang yang dipanggil dari suatu tempat yang sangat jauh, ia tidak dapat mendengar orang yang menyerunya dan tidak pula dapat memenuhi seruan orang yang memanggilnya. Maksudnya, adalah orang-orang yang tidak beriman kepada al-qur’an, tidak bisa memanfaatkan petunjuknya dan tidak bisa melihat dengan cahayanya, serta tidak bisa mengambil kebaikan darinya. Sebab mereka telah menutup pintu-pintu hidayah terhadap diri mereka sendiri dengan sikap berpaling dan kufur yang mereka lakukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 44: (Dan jika Kami jadikan ia) yakni Alquran itu (suatu bacaan dalam bahasa selain bahasa Arab tentu mereka mengatakan, \"Mengapa tidak) kenapa tidak (dijelaskan) diterangkan (ayat-ayatnya?) sehingga kami dapat memahaminya. (Apakah) patut Alquran (dalam bahasa asing sedangkan) nabi (adalah orang Arab) Istifham atau kata tanya di sini mengandung makna ingkar, yakni menunjukkan keingkaran mereka. Dan lafal A'jamiyyun ini dapat dibaca Tahqiq dan dapat pula dibaca Tas-hil. (Katakanlah, \"Alquran ini bagi orang-orang yang beriman adalah petunjuk) dari kesesatan (dan penawar) dari kebodohan. (Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan) penutup, sehingga mereka tidak dapat mendengar (sedangkan Alquran itu suatu kegelapan bagi mereka) karena itu mereka tidak dapat memahaminya. (Mereka itu adalah seperti orang-orang yang dipanggil dari tempat yang jauh\") karenanya mereka tidak dapat mendengar dan tidak dapat memahami panggilan yang ditujukan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang karunia dan kemurahan-Nya, dimana Dia telah menurunkan kitab-Nya dengan bahasa Arab kepada Rasul yang berasal dari bangsa Arab dengan lisan kaumnya agar Beliau dapat menerangkan kepada mereka. Hal ini tentu mengharuskan mereka lebih memperhatikan, tunduk dan menerima, dan kalau sekiranya Allah jadikan Al Qur’an berbahasa selain Arab tentu orang-orang yang mendustakan akan memprotesnya dengan mengatakan, “Mengapa tidak dijelaskan ayat-ayatnya?” Yakni agar kami paham. Yakni hal ini tidaklah pantas. Maka Allah Subhaanahu wa Ta'aala menafikan semua perkara yang di sana bisa dijadikan syubhat oleh orang-orang yang batil, terhadap kitab-Nya, demikian pula Dia menyifatkan kitab-Nya dengan sifat yang mengharuskan mereka untuk tunduk. Meskipun demikian, hanya orang-orang mukmin dan mendapat taufiq saja yang dapat mengambil manfaat darinya, tidak selain mereka sebagaimana diterangkan dalam lanjutan ayatnya. Agar tidak tersesat. Al Qur’an menunjukkan mereka ke jalan yang benar dan lurus serta mengajarkan kepada mereka berbagai ilmu yang bermanfaat, dimana dengannya mereka memperoleh hidayah yang sempurna. Terhadap kebodohan. Termasuk pula penyembuh terhadap penyakit badan dan hati, karena Al Qur’an melarang akhlak yang buruk dan perbuatan yang jelek, mendorong untuk bertobat secara murni yang dapat mencuci dosa-dosa dan menyembuhkan hati. Kepada Al Qur’an. Sehingga tidak masuk ke telinga mereka. Yang dimaksud suatu kegelapan bagi mereka ialah tidak memberi petunjuk bagi mereka, atau mereka tidak dapat melihat petunjuk dengannya dan tidak mendapatkannya, serta tidak dapat mengambil kebaikan darinya, karena mereka telah menutup pintu-pintu petunjuk, dan bahwa Al Qur’an itu hanyalah menambah kesesatan bagi mereka, karena ketika mereka menolak kebenaran, maka bertambahlah kebutaan mereka di atas kebutaan serta kesesatan di atas kesesatan. Mereka seperti orang yang dipanggil dari tempat yang jauh, dimana ia (orang yang berada jauh) tidak dapat mendengar dan memahami seruan. Oleh karena itulah, ketika mereka diajak kepada keimanan, maka mereka tidak mau memenuhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 44",
    "description": "Salah satu pernyataan orang-orang durhaka itu tentang Al-Qur'an adalah bahwa mereka telah menutup hati dari Al-Qur'an (ayat 5). Pernyataan itu sebenarnya ungkapan lain dari pengingkaran bahwa mereka sebenarnya tidak mau mengerti dengan Al-Qur'an. Dan sekiranya Al-Qur'an yang kami turunkan itu, kami jadikan sebagai bacaan dalam bahasa selain bahasa arab atau dalam bahasa arab tetapi tidak jelas maknanya bagi orang-orang kafir itu, niscaya mereka mengatakan dengan nada mengecam, 'mengapa tidak dijelaskan dan diperinci apa maksud ayat-ayatnya'' kecaman orang-orang kafir itu dijawab Allah dalam Al-Qur'an sendiri, 'apakah patut Al-Qur'an diturunkan dalam bahasa selain bahasa arab, sedangkan rasul yang membawanya dan masyarakat yang ditujunya ketika itu adalah orang arab yang berbahasa arab' katakanlah, wahai nabi Muhammad, 'Al-Qur'an itu secara khusus adalah sebagai petunjuk dan penyembuh bagi orang-orang yang beriman. Dan sedangkan bagi orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan Al-Qur'an itu merupakan kegelapan bagi mereka. Mere-ka itu seperti orang-orang yang dipanggil dari tempat yang jauh sehingga mereka tidak mendengar panggilan orang yang memanggil. ''45. Sama dengan apa yang dilakukan oleh orang-orang musyrik mekah yang memperselisihkan Al-Qur'an, hal yang sama juga terjadi atas kitab taurat yang diturunkan kepada nabi musa. Firman Allah, 'dan sungguh, telah kami berikan kepada musa kitab taurat, lalu kitab taurat itu diperselisihkan oleh bani israil. Sekiranya tidak ada keputusan yang terdahulu dari tuhanmu, yakni menunda jatuhnya siksa sampai nanti pada hari yang ditetapkan, niscaya orang-orang kafir itu pasti sudah dibinasakan. Dan sesungguhnya mereka menyikapi Al-Qur'an itu benar-benar dalam keraguan yang mendalam, terutama terhadap kepastian-Nya se-bagai wahyu yang berasal dari Allah."
  }
]