[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh Kami telah memberikan Taurat kepada Musa, sebagaimana Kami juga memberimu al-Quran (wahai Rasul), lalu kaum Musa berselisih padanya, diantara mereka ada yang beriman dan diantara mereka ada yang mendustakan. Kalau bukan karena kalimat (ketetapan) yang mendahului dari Tuhanmu untuk menunda azab dari kaummu, niscaya mereka diberi keputusan pasti dengan membinasakan orang-orang kafir saat itu juga. Sesungguhnya orang-orang musyrik benar-benar dalam keraguan terhadap al-Quran dengan keraguan yang berat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Kami telah memberi Musa Taurat, lalu kaumnya berselisih tentangnya. Di antara mereka ada yang beriman kepadanya, dan ada juga yang kafir. Kalau bukan karena ada janji Allah yang akan memberikan keputusan di antara mereka pada hari Kiamat terkait apa yang mereka perselisihkan, niscaya Allah memutuskan di antara orang-orang yang berselisih tentang Taurat, lalu Allah menjelaskan siapa yang benar dan siapa yang salah, lalu Allah memuliakan orang yang benar dan merendahkan orang yang salah. Sesungguhnya orang-orang kafir itu berada dalam keraguan dan kebimbangan terhadap perkara Al-Qur`ān ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Sungguh Kami telah memberi Musa kitab Taurat; namun kaumnya menjadi berselisih, sebagian mereka mengimaninya dan sebagian lainnya mendustakannya. Kalaulah bukan karena ketetapan Allah sebelumnya untuk menjadikan hisab pada hari kiamat, niscaya Allah akan menyelesaikan perselisihan mereka dengan membinasakan orang-orang kafir. Dan orang-orang yang mendustakan sangat ragu terhadap al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَلَقَدْ ءَاتَيْنَا مُوسَى الْكِتٰبَ فَاخْتُلِفَ فِيهِ ۗ (Dan sesungguhnya telah Kami berikan kepada Musa Taurat lalu diperselisihkan tentang Taurat itu) Ini merupakan kebiasaan umat-umat terdahulu, mereka selalu berselisih tentang kitab-kitab yang diturunkan kepada mereka. وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ(Kalau tidak ada keputusan yang telah terdahulu dari Rabb-mu) Dalam mengakhirkan azab bagi umatmu yang mendustakan. لَقُضِىَ بَيْنَهُمْ ۚ( tentulah orang-orang kafir itu sudah dibinasakan) Dengan azab yang disegerakan bagi orang yang mendustakan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Sungguh Kami telah memberi Musa kitab Taurat sebagaimana memberimu kitab Al-Qur’an wahai Nabi. Kaum Musa saling bertentangan tentang Taurat, yaitu antara orang yang beriman dan pendusta, sebagaimana mereka juga bertentangan tentang Al-Qur’an. Kalaupun tidak ada ketentuan sebelumnya dari Tuhanmu terkait pengakhiran hisab dan balasan bagi para makhluk sampai tiba hari kiamat, sungguh akan tetap ditentukan hukum di antara mereka terkait apa yang mereka pertentangkan dengan mempercepat azab bagi para pendusta. Sesungguhnya para pendusta itu berada dalam keragu-raguan tentang Taurat dan Al-Qur’an, yaitu dalam keraguan dan kebathilan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kepada Musa kitab} Taurat {lalu kitab itu diperselisihkan. Seandainya tidak ada ketetapan yang terdahulu dari Tuhanmu} janji dari Allaah dengan menentukan keputusan di antara para hamba pada hari kiamat {niscaya telah ditunaikan hukuman di antara mereka} niscaya ditunaikan keputusan di antara orang-orang yang berselisih {Sesungguhnya mereka benar-benar dalam kebimbangan dan keraguan terhadapnya} bertempat pada keraguan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah berfirman,”dan sesungguhnya telah kami berikan kepada Musa al-kitab,” sebagaimana kami telah memberikan kepadamu (Muhammad) al-kitab, kemudian manusia melakukan terhadapnya apa yang telah mereka lakukan terhadapmu. Mereka berselisih, di antara mereka ada yang beriman kepadanya, berpedoman kepadanya dan mengambil pelajaran. Dan diantara mereka ada yang mendustakannya dan tidak mengambil pelajaran darinya. Allah, jika bukan karena kesantuananNYa dan ketetapanNYa terdahulu yang menangguhkan azab hingga waktu yang telah ditentukan tidak bisa dimajukan dan tidak pula bisa ditunda, “tentulah orang-orang kafir itu sudah dibinasakan,” hanya dengan terpisahkannya orang-orang yang beriman dari orang-orang yang kafir, dengan membinasakan orang-orang yang kafir pada saat itu juga. Karena sebab kebinasaan sudah pasti dan ada. “dan sesungguhnya mereka terhadap al-qur’an benar-benar berada dalam keragu-raguan yang membingungkan,” artinya, mereka sudah sampai pada keragu-raguan yang membuat mereka gelisah, maka dari itu mereka mendustakannya dan mengingkarinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 45: (Dan sesungguhnya telah Kami berikan kepada Musa Kitab) yakni Taurat (lalu diperselisihkan tentang Taurat itu) ada yang mempercayainya dan ada pula yang mendustakannya, sama dengan apa yang dialami oleh Alquran. (Kalau tidak ada keputusan yang telah terdahulu dari Rabbmu) yang telah memutuskan untuk menangguhkan hisab dan pembalasan bagi semua makhluk sampai hari kiamat nanti (tentulah telah diputuskan di antara mereka) di dunia ini tentang apa yang mereka perselisihkan itu. (Dan sesungguhnya mereka) yaitu orang-orang yang mendustakan terhadap Alquran (benar-benar dalam keragu-raguan yang membingungkan terhadap Alquran) mereka benar-benar ragu terhadapnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ada yang membenarkan dan ada yang mendustakan sebagaimana Al Qur’an, ada yang membenarkan dan ada yang mendustakan. Yaitu ditundanya hisab dan pembalasan terhadap manusia sampai nanti hari Kiamat karena santun-Nya dank arena ketetapan-Nya sejak dahulu. Pada saat itu juga, karena sebab untuk dibinasakan telah ada. Oleh karena itulah mereka mendustakan dan mengingkarinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 45",
    "description": "Sama dengan apa yang dilakukan oleh orang-orang musyrik mekah yang memperselisihkan Al-Qur'an, hal yang sama juga terjadi atas kitab taurat yang diturunkan kepada nabi musa. Firman Allah, 'dan sungguh, telah kami berikan kepada musa kitab taurat, lalu kitab taurat itu diperselisihkan oleh bani israil. Sekiranya tidak ada keputusan yang terdahulu dari tuhanmu, yakni menunda jatuhnya siksa sampai nanti pada hari yang ditetapkan, niscaya orang-orang kafir itu pasti sudah dibinasakan. Dan sesungguhnya mereka menyikapi Al-Qur'an itu benar-benar dalam keraguan yang mendalam, terutama terhadap kepastian-Nya se-bagai wahyu yang berasal dari Allah. 46. Oleh sebab itu, sadarilah apa yang telah diajarkan oleh Al-Qur'an itu bahwa barang siapa mengerjakan kebajikan maka pahalanya untuk dirinya sendiri, dan barang siapa berbuat jahat maka dosanya menjadi tanggungan dirinya sendiri, bukan dibebankan kepada orang lain. Dan tuhanmu sama sekali tidak menzalimi hamba-hamba-Nya yang durhaka itu."
  }
]