[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu ditinggalkan oleh sekutu-sekutu mereka yang dulu mereka sembah di dunia selain Allah, sekutu-sekutu itu tidak berguna apa pun bagi mereka, dan mereka pun meyakini bahwa tidak ada tempat berlari untuk selamat dari siksa Allah, dan tidak ada tempat bersembunyi darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Berhala-berhala yang dulu mereka sembah menghilang dari mereka, dan mereka pun yakin bahwa tidak ada tempat berlari bagi mereka dari azab Allah dan tidak ada jalan untuk lolos."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَدْعُونَ مِن قَبْلُ ۖ (Dan hilang lenyaplah dari mereka apa yang selalu mereka sembah dahulu) Yakni di akhirat akan lenyap dan sirna berhala-berhala dan lain sebagainya yang dahulu mereka sembah di dunia. وَظَنُّوا۟ مَا لَهُم مِّن مَّحِيصٍ (dan mereka yakin bahwa tidak ada bagi mereka satu jalan keluarpun) Yakni mereka mengetahui dan meyakini tidak ada tempat bagi mereka untuk lari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Apa yang mereka sembah di dunia berupa berhala-berhala dan lainnya itu menghilang dari mereka. Sehingga semua itu tidak membantu mereka sama sekali dan mereka meyakini bahwa tidak ada tempat melarikan diri bagi mereka dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka lenyaplah} hilanglah {dari mereka apa yang dahulu selalu mereka sembah dan mereka meyakini} mereka meyakini {bahwa tidak ada bagi mereka tempat untuk menghindar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47-48. INi adalah informasi tentang kemahaluasan ilmu Allah dan kekhususanNya dengan ilmu yang tidak ada yang mengetahuinya selain Dia, seraya berfirman, “Kepada Nya lah dikembalikan pengetahuan tentang Hari Kiamat.” Maksudnya, seluruh makhluk mengembalikan pengetahuan tentang KIamat kepada Allah, dan mereka mengakui kelemahan mereka tentangnya. Para Rasul, para malaikat, dan lain-lainnya pun sama. “Dan tidak ada buah-buahan yang keluar dari kelopaknya,” yakni dari tempatnya ia keluar, dan ini meliputi semua buah-buahan seluruh pepohonan yang ada di berbagai negeri dan daratan; maka tidak ada satu pun buah salah suatu pohon keluar melainkan Dia mengetahuinya serta terperinci. “Dan tidak seorang perempuan pun yang mengandung,” maksudnya, perempuan dari anak cucu Nabi Adam dan selain mereka dari seluruh jenis hewan melainkan berdasarkan pengetahuanNya, “dan tidak pula melahirkan” seorang perempuan akan kandungannya “melainkan dengan sepengetahuanNya.” Lalu bagaimana kaum musyrikin menyamakan sesuatu yang tidak mempunyai pengetahuan, pendengaran ataupun penglihatan dengan Allah? “Pada hari Dia memanggil mereka,” maksudnya, memanggil orang-orang musyrik pada Hari Kiamat sebagai cercaan terhadap mereka dan untuk membeberkan kedustaan mereka. Lalu Dia berkata kepada mereka, “Di manakah sekutu-sekutuKu itu,” yakni, yang kalian klaim bahwa mereka adalah sekutu-sekutuKu, lalu kalian menyembahnya dan kalian mendebat (ayat-ayatKu) karenanya serta kalian melakukan permusuhan terhadap para rasulKu juga karenanya? “Mereka menjawab,” seraya mengakui kepalsuan ketuhanan dan persekutuan sembahan-sembahan itu bersama Allah, “Kami nyatakan kepadaMu bahwa tidak ada seorang pun di antara kami yang memberi kesaksian,” maksudnya kami maklumkan kepadaMu, ya rabb kami, dan berikanlah kesaksian kepada kami bahwa tidak ada seorang pun di antara kami yang bisa memberikan kesaksian akan kebenaran ketuhanan dan persekutuan dari sesembahan-sesembahan itu. Jadi, masing-masing kami saat ini telah mengakui ketidakbenaran menyembahnya dan kami berlepas diri darinya. Maka dari itu Allah berfirman, “Dan lenyaplah dari mereka apa yang selalu mereka sembah dahulu,” selain Allah. Maksudnya, lenyaplah kepercayaan-kepercayaan dan amal perbuatan mereka yang karenanya mereka menghabiskan usia untuk menyembah selain Allah, dan mereka mengira bahwa itu semua berguna bagi mereka dan dapat mencegah azab dari mereka serta dapat memberikan syafa’at kepada mereka di sisi Allah. Sia-sialah usaha mereka dan batallah dugaan mereka serta tidak berguna sedikitpun sembahan-sembahan mereka itu. “Dan mereka mengira,” maksudnya, mereka yakin pada saat itu, “bahwa tidak ada bagi mereka satu pun jalan keluar,” maksudnya, seorang penyelamat yang bisa menyelamatkan mereka, juga tidak seorang penolong ataupun tempat berlindung. Inilah akhir kesudahan orang yang mempersekutukan Allah dengan yang lain. Allah menjelaskannya kepada hamba-hambaNya agar mereka tidak mempersekutukanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 48: (Dan lenyaplah) hilanglah (dari mereka apa yang selalu mereka seru) yang selalu mereka sembah (dahulu) di dunia yaitu berhala-berhala (dan mereka yakin) merasa yakin (bahwa tidak ada bagi mereka sesuatu jalan keluar pun) jalan selamat dari azab. Huruf Nafi pada dua tempat tidak beramal, dan jumlah yang dinafikan menduduki tempatnya Maf'ul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan dengan lenyapnya akidah dan amal mereka yang mereka kerjakan selama di dunia untuk beribadah kepada selain Allah, dimana mereka mengira bahwa berhala-berhala itu memberikan manfaat kepada mereka dan menghindarkan azab, ternyata perkiraan mereka salah dan ternyata sekutu-sekutu mereka itu tidak berguna apa-apa bagi mereka. Inilah akibat bagi orang yang berbuat syirk. Allah Subhaanahu wa Ta'aala menerangkannya kepada hamba-hamba-Nya agar mereka menjauhi syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 48",
    "description": "Dan dengan pernyataan mereka itu, lenyaplah dari hadapan mereka pada hari kiamat itu apa yang di dunia dahulu selalu mereka sembah, dan mereka pun ketika itu juga tahu bahwa tidak ada jalan keluar bagi mereka yang dapat menghindarkan mereka dari azab Allah. 49. Ayat-ayat yang lalu menggambarkan azab di akhirat yang diperoleh manusia yang menyekutukan Allah. Ayat-ayat berikut ini menggambarkan sifat-sifat buruk manusia ketika di dunia ini. Allah menyatakan bahwa manusia pada umumnya tidak jemu memohon kebaikan untuk mendapat kesenangan bagi kehidupan mereka di dunia ini, dan jika sesudah itu disentuh dan ditimpa malapetaka, walau sedikit, yang mengganggu kesenangan mereka, mereka berputus asa terhadap nikmat Allah dan hilang harapannya untuk dikabulkan doanya."
  }
]