[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manusia tidak merasa bosan untuk selalu berdo’a kepada Tuhan-nya meminta kebaikan dunia, namun bila dia ditimpa kemiskinan dan kesulitan, maka dia berputus asa dari rahmat Allah, berputus harapan dengan berburuk sangka kepada Tuhanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Manusia tidak pernah bosan meminta kesehatan, harta kekayaan, anak dan nikmat-nikmat dunia lainnya, namun bila manusia ditimpa penyakit, kemiskinan atau lainnya, maka dia banyak berputus asa dan putus harapan dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Manusia tidak pernah bosan dari meminta kekayaan, kesehatan, dan keturunan kepada Allah; dan jika dia tertimpa musibah maka dia akan berputus asa dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. لَّا يَسْـَٔمُ الْإِنسٰنُ مِن دُعَآءِ الْخَيْرِ (Manusia tidak jemu memohon kebaikan) Yakni manusia tidak ada bosan-bosannya untuk berdoa meminta kebaikan bagi dirinya. Dan kebaikan di sini maknanya adalah harta, kekuasaan, dan kedudukan. وَإِن مَّسَّهُ الشَّرُّ فَيَـُٔوسٌ قَنُوطٌ(dan jika mereka ditimpa malapetaka dia menjadi putus asa lagi putus harapan) Namun jika dia ditimpa musibah, kesulitan, kemiskinan, dan penyakit, dia menjadi sangat berputus asa dari rahmat Allah, sampai-sampai dia merasa apa yang tidak dikehendakinya itu tidak akan berhenti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Orang kafir itu tidak bosan-bosan untuk mencari kebaikan bagi dirinya. Yang dimaksud kebaikan (disini) adalah harta benda, kesehatan, kehidupan, kekuasaan, dan ketenaran. Namun jika mereka tertimpa kesempitan berupa kefakiran, kesengsaraan, sakit dan lain-lain, dia akan sangat putus asa dari fadhilah dan rahmat Allah dengan menampakkan pengaruh keputusasaan, kesedihan, tangisan dan kepasrahan (mereka)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tempat untuk berlindung dan lari dari azab Allah {Manusia tidak bosan} tidak bosan {memohon kebaikan} meminta harta dan kesehatan {dan jika ditimpa} ditimpa {keburukan} kefakiran dan penyakit {mereka berputus asa dan kehilangan harapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Ini adalah informasi tentang tabiat manusia sebagaimana adanya, tidak mempunyai kesabaran dan ketangguhan dalam melakukan kebaikan maupun mencegah diri dari keburukan kecuali orang dipindahkan oleh Allah dari kondisi ini ke tingkat kesempurnaan, seraya berfirman, Manusia tidak jemu memohon kebaikan,” maksudnya, manusia tidak bosan berdoa kepada Allah untuk meminta kekayaan, harta, anak, dan berbagai tuntutan duniawi lainnya, dan ia terus melakukan itu, ia tidak pernah merasa puas dengan yang sedikit maupun dengan yang banyak darinya. Sekalipun ia telah memperoleh kekayaan dunia secukupnya, ia akan terus mencari untuk menambah. “Dan jika mereka ditimpa malapetaka,” maksudnya, sesuatu yang tidak disukai, seperti penyakit, kefakiran, dan berbagai cobaan lainnya, “maka dia menjadi putus asa lagi putus harapan.” Maksudnya, ia berputus asa dari rahmat Allah, dan ia mengira bahwa cobaan itulah yang menentukan kebinasaannya, dan ia merasa terganggu dengan datangnya berbagai sebab yang tidak seperti apa yang ia suka dan ia cari. Kecuali orang-orang yang beriman dan beramal shalih. Orang-orang yang beriman apabila dikaruniai kebaikan, kenikmatan dan apa-apa yang disukai maka mereka bersyukur kepada Allah, dan mereka khawatir kalau karunia-karunia Allah itu menjadi istidraj dan imhal. Dan jika mereka ditimpa suatu musibah pada diri, harta benda, atau pada anak-anak mereka, maka mereka sabar dan berharap akan karunia Rabbnya; mereka tidak berputus asa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 49: (Manusia tidak jemu memohon kebaikan) artinya, masih tetap terus meminta kepada Rabbnya akan harta, kesehatan dan lain-lainnya (dan jika ia ditimpa malapetaka) berupa kemiskinan dan kesengsaraan (dia menjadi putus asa lagi putus harapan) dari rahmat Allah. Ayat ini merupakan gambaran bagi keadaan orang-orang kafir, demikian pula gambaran dalam ayat selanjutnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menerangkan tentang tabiat manusia dari sisi jati dirinya, tidak punya kesabaran, baik terhadap yang baik maupun yang buruk kecuali orang yang Allah rubah dari keadaan itu kepada keadaan yang sempurna. Seperti harta, kesehatan dan harapan-harapan lainnya yang terkait dengan kesenangan dunia. Ia tidak pernah puas baik terhadap yang sedikit maupun yang banyak. Jika ia telah memperoleh harapannya itu, ia tetap terus meminta tambahan. Seperti kemiskinan, sakit dan musibah. Yakni ia berputus asa dari rahmat Allah Subhaanahu wa Ta'aala dan ia mengira bahwa musibah itu adalah yang akan membuatnya binasa. Berbeda dengan orang yang bersabar dan beramal saleh, saat ia mendapatkan nikmat, maka ia bersyukur kepada Allah dan khawatir jika nikmat itu sebagai istidraj (penguluran azab dari Allah), dan jika mereka mendapatkan musibah baik pada diri mereka, harta mereka maupun anak-anak mereka, maka mereka bersabar, mengharapkan karunia Allah dan tidak berputus asa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 49",
    "description": "Ayat-ayat yang lalu menggambarkan azab di akhirat yang diperoleh manusia yang menyekutukan Allah. Ayat-ayat berikut ini menggambarkan sifat-sifat buruk manusia ketika di dunia ini. Allah menyatakan bahwa manusia pada umumnya tidak jemu memohon kebaikan untuk mendapat kesenangan bagi kehidupan mereka di dunia ini, dan jika sesudah itu disentuh dan ditimpa malapetaka, walau sedikit, yang mengganggu kesenangan mereka, mereka berputus asa terhadap nikmat Allah dan hilang harapannya untuk dikabulkan doanya. 50. Dan sifat buruk manusia yang lain adalah jika kami berikan kepada-Nya suatu rahmat atau hal-hal yang menyenangkan mereka dari kami setelah ditimpa kesusahan sebelumnya, pastilah dengan bangga dia berkata, 'ini adalah hakku yang aku dapatkan dari usahaku, dan aku tidak menduga atau yakin bahwa hari kiamat itu akan terjadi. Dan jika hari kiamat itu pun akan terjadi dan aku dikembalikan kepada tuhanku untuk mempertanggungjawabkan segala amalku, sesungguhnya aku pasti akan memperoleh bagian yang sangat baik di sisi-Nya. ' apa yang mere-ka katakan itu tidak akan pernah didapatkannya, bahkan sebaliknya. Maka sungguh di hari akhirat nanti, akan kami beritahukan kepada mere-ka orang-orang kafir tentang apa yang telah mereka kerjakan di dunia, dan sungguh, akan kami timpakan kepada mereka azab yang berat akibat keka-firan dan kedurhakaan mereka."
  }
]