[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir yang berpaling itu berkata kepada Nabi Muhammad, “Hati kami terkunci yang menghalangi kami untuk bisa memahami apa yang kamu serukan, telinga kami tersumbat sehingga kami tidak mendengar, diantara kami dan kamu terdapat penghalang (wahai Muhammad), sehingga kami tidak memenuhi ajakanmu, maka beramallah sesuai dengan ajaran agamamu, sebagaimana kami juga beramal sesuai dengan tuntunan agama kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Mereka berkata, \"Hati kami telah tertutup oleh selaput-selaput sehingga ia tidak bisa memahami apa yang kamu serukan kepada kami, sementara telinga kami tersumbat sehingga ia tidak mendengarnya, lalu di antara kami dengan kamu ada tabir penghalang sehingga apa yang kamu katakan tidak sampai kepada kami. Maka beramallah di atas agamamu dan kami beramal di atas agama kami. Kami tidak akan mengikutimu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-7. Orang-orang musyrik berkata kepada Nabi Muhammad: “Hati kami telah tertutup sehingga keimanan yang kamu serukan itu tidak dapat merasuk kepadanya, dan telinga kami tidak dapat mendengar. Hai Muhammad, antara kami dan dirimu terdapat pembatas yang menghalangi kami menerima dakwahmu; maka berbuatlah sesuai dengan tuntunan agamamu, karena kami akan berbuat sesuai dengan tuntunan agama kami.” Maka Allah membantah mereka, katakanlah kepada mereka hai Rasulullah: “Aku hanyalah manusia seperti kalian; Allah mewahyukan kepadaku bahwa Tuhan kalian yang benar hanya Dia semata, maka menghadaplah kepada Allah dengan ketaatan dan mintalah ampunan dari-Nya atas dosa-dosa kalian.” Dan kebinasaan akan menimpa orang-orang musyrik yang enggan membayar zakat dan mendustakan kehidupan akhirat dan hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَقَالُوا۟ قُلُوبُنَا فِىٓ أَكِنَّةٍ(Mereka berkata: “Hati kami berada dalam tutupan) Yakni tertutup, sehingga tidak memahami apa yang kamu katakan dan tidak dapat didengarnya. وَفِىٓ ءَاذَانِنَا وَقْرٌ(dan telinga kami ada sumbatan) Yakni ketulian. وَمِنۢ بَيْنِنَا وَبَيْنِكَ حِجَابٌ(dan antara kami dan kamu ada dinding) Yakni penutup yang menghalangi kami dari melihatmu, atau menghalangi suaramu sehingga kami tidak mengerti apa yang kamu katakan. Perumpamaan-perumpamaan yang mereka buat ini karena keberpalingan hati mereka untuk mendapat kebenaran dan kebencian pendengaran mereka terhadapnya serta keengganan mereka berinteraksi dengan Rasulullah. فَاعْمَلْ إِنَّنَا عٰمِلُونَ(maka bekerjalah kamu; sesungguhnya kami bekerja (pula)”) Yakni beramal-lah sesuai agamamu, karena kami juga akan beramal sesuai dengan agama kami. Dan pendapat lain mengatakan maknanya adalah beramal-lah untuk akhiratmu karena kami akan beramal untuk dunia kami saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Orang-orang kafir Quraisy berkata: “Hati kami tertutup oleh banyak penutup, jadi kamu tidak dapat memahami apapun (tentang kami) dan pikiran kami tertutup. Di antara kami dan kamu wahai nabi ada penutup dan sekat. Hal itu karena kami sangat membencimu dan enggan mengikuti risalahmu. Maka amalkanlah agamamu. Sesungguhnya kami mengamalkan agama kami dan tidak akan meninggalkannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Hati kami sudah tertutup} tertutup {dari apa yang kamu serukan kepada kami. Di telinga kami ada penyumbat} ketulian dan keberatan, sehingga kami tidak mendengar apa yang kamu katakan {dan di antara kami dan kamu ada tabir} penghalang yang menghalangi untuk menerima seruanmu {Maka lakukanlah. Sesungguhnya kami akan melakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “mereka berkata,” maksudnya, orang-orang yang berpaling dari al-qur’an itu berkata untuk menjelaskan keengganan mereka mengambil pelajaran darinya dengan menutup semua pintu yang bisa menyampaikan kepadanya, “hati kami berada dalam tutupan,” penutup yang menutupi “terhadap apa yang kamu seru kami kepadanya, dan di telinga kami ada sumbatan,” maksudnya, tuli sehingga kami tidak dapat mendengarmu, “diantara kami dan kamu ada dinding,” sehingga kami tidak dapat melihatmu. Maksudnya, mereka menampakkan sikap berpaling drai al-qur’an dari segala sisi, dan mereka menampakkan kebencian kepadanya dan puas dengan apa yang mereka anut. Maka dari itu mereka berkata, ”maka bekerjala kamu sesungguhnya kami bekerja pula,” maksudnya, sebagaimana kamu puas mengamalkan agamamu, maka kami pun sangat puas mengamalkan agama kami. Ini benar-benar sikap mengabaikan yang sangat kentara, di mana mereka rela dengan kesesatan, menjauhi petunjuk dan lebih mengutamakan kekafiran daripada keimanan, dan mereka menjual akhirat dengan dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 5: (Mereka berkata) kepada Nabi saw., (\"Hati kami berada dalam tutupan) tertutup dari (apa yang kamu seru kami kepadanya dan di telinga kami ada sumbatan) yakni penutup (dan di antara kami dan kamu ada dinding) pemisah dalam masalah agama (maka bekerjalah kamu) sesuai dengan tuntunan agamamu (sesungguhnya kami bekerja pula\") sesuai dengan tuntunan agama kami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang berpaling sambil menerangkan bahwa mereka tidak dapat mengambil manfaat darinya karena pintu-pintu ke arahnya telah mereka tutup. Kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Sehingga kami tidak dapat memahami. Sehingga kami tidak dapat mendengarkan. Sehingga kami tidak dapat melihat. Maksud dari kata-kata mereka ini adalah, bahwa mereka menampakkan sikap berpaling dari berbagai sisi, menampakkan kebencian terhadapnya dan ridha dengan apa yang mereka pegang selama ini. Oleh karena itulah mereka berkata, “karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).\" Yakni sebagaimana engkau ridha mengamalkan agamamu, maka kami telah ridha mengamalkan agama kami. Hal ini menunjukkan bahwa mereka benar-benar telah ditelantarkan oleh Allah, dimana mereka telah ridha dengan kesesatan daripada petunjuk, memilih kekafiran daripada keimanan serta menjual akhirat dengan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 5",
    "description": "Penolakan dan keberpalingan orang-orang musyrik mekah terhadap Al-Qur'an itu mereka nyatakan dalam bentuk pengakuan langsung. Dan mereka orang-orang musyrik mekah itu, berkata, 'hati dan akal pikiran kami sudah tertutup dan terkunci rapat dari apa yang engkau seru kami kepadanya, dan telinga kami sudah tersumbat sehingga kami tidak dapat mendengar apa pun yang engkau sampaikan, dan di antara kami dan engkau ada dinding pembatas yang sangat tebal. Oleh karena itu, lakukanlah apa yang sesuai menurut kehendakmu, dan demikian pula sesungguhnya kami akan melakukan apa yang sesuai menurut kehendak kami. '6. Setelah mendengar pernyataan langsung dari kaum musyrik me-kah tentang penolakan mereka tersebut, Allah memerintah nabi Muhammad untuk menjawabnya. Katakanlah kepada mereka, wahai nabi Muhammad, 'aku ini hanyalah seorang manusia seperti kamu juga. Aku adalah nabi dan rasul Allah dengan membawa Al-Qur'an yang diwahyukan kepadaku. Di dalam Al-Qur'an itu terdapat ajaran dasar bahwa tuhan kamu adalah Allah dan dia adalah tuhan yang maha esa; karena itu tetaplah kamu beribadah kepada-Nya, dan mohonlah ampunan kepada-Nya agar kamu tidak terjerumus kepada kesesatan. Dan sadari-lah bahwa dengan bercermin kepada umat terdahulu yang telah diazab Allah, maka akan celakalah orang-orang yang mempersekutukan-Nya de-ngan yang lain."
  }
]