[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kami berikan kenikmatan kepada manusia setelah sebelumnya dia ditimpa kesulitan dan ujian, maka dia tidak bersyukur kepada Allah sebaliknya dia melampui batas dan berkata, “ Ini semuanya adalah milikiku karena aku memang berhak atasnya dan aku tidak yakin hari kiamat akan datang. Ini adalah pengingkaran darinya terhadap kebangkitan. Kalaupun Kiamat tetap datang dan aku akan kembali kepada Tuhanku, maka aku akan tetap mendapatkan syurga.” Di Hari Kiamat nanti Kami akan mengabarkan kepada orang-orang kafir tentang keburukan-kaburukan yang mereka kerjakan dan Kami akan membuat mereka merasakan azab yang keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Bila Kami memberi manusia kesehatan, kecukupan dan keselamatan sesudah ujian dan penyakit yang menimpanya, maka manusia akan berkata, “Ini bagiku, karena aku memang berhak dan layak mendapatkannya, aku tidak yakin hari Kiamat akan datang. Seandainya pun hari Kiamat datang, maka aku tetap memiliki kecukupan dan harta di sisi Allah, sebagaimana di dunia ini Allah memberiku kenikmatan karena aku memang berhak, maka Allah akan memberiku kenikmatan juga di Akhirat.” Kami akan mengabari orang-orang yang kafir kepada Allah karena melakukan kekufuran dan kemaksiatan, dan Kami akan membuat mereka merasakan azab yang sangat berat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Sungguh jika Kami memberi rahmat bagi orang kafir setelah dia tertimpa musibah, niscaya dia akan berkata: “Kenikmatan ini memang berhak aku dapatkan, dan aku yakin hari kiamat tidak akan datang. Dan jikalau aku kembali kepada Tuhanku dengan membangkitkanku setelah kematian, maka aku pasti akan mendapatkan surga di sisi-Nya.” Sungguh Kami akan sampaikan kepada orang-orang kafir segala dosa yang telah mereka lakukan, dan sungguh Kami akan memberi mereka azab yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَلَئِنْ أَذَقْنٰهُ رَحْمَةً مِّنَّا مِنۢ بَعْدِ ضَرَّآءَ مَسَّتْهُ (Dan jika Kami merasakan kepadanya sesuatu rahmat dari Kami sesudah dia ditimpa kesusahan) Yakni jika Kami memberinya kebaikan, kesehatan, dan kekayaan setelah kesulitan, penyakit, dan kemiskinannya. لَيَقُولَنَّ هٰذَا لِى(pastilah dia berkata: “Ini adalah hakku) Yakni kebaikan yang aku dapatkan ini adalah sesuatu yang sudah menjadi hakku untuk dipenuhi Allah karena keridhaan-Nya dengan amalanku. Dia merasa kenikmatan yang didapatkannya merupakan haknya, tanpa mengetahui bahwa Allah menguji hamba-hamba-Nya dengan kebaikan dan keburukan agar menjadi jelas siapa yang bersyukur dan siapa yang ingkar, siapa yang bersabar dan siapa yang selalu mengeluh. وَمَآ أَظُنُّ السَّاعَةَ قَآئِمَةً(dan aku tidak yakin bahwa hari Kiamat itu akan datang) Sebagaimana yang dikatakan para nabi. Dan keraguan terhadap hari kebangkitan tidak akan terjadi kecuali pada orang-orang kafir atau orang yang goyang dalam agamanya yang hanya menampakkan keislamannya dan menyembunyikan kekafiran dalam hatinya. وَلَئِن رُّجِعْتُ إِلَىٰ رَبِّىٓ( Dan jika aku dikembalikan kepada Tuhanku) Jika memang apa yang dikabarkan para nabi itu benar seperti tentang terjadinya hari kiamat, hari kebangkitan dan pengumpulan. إِنَّ لِى عِندَهُۥ لَلْحُسْنَىٰ ۚ( maka sesungguhnya aku akan memperoleh kebaikan pada sisi-Nya) Yakni memperoleh kemuliaan. Dia merasa berhak mendapatkan kebaikan dunia, dan berhak mendapatkan kebaikan akhirat karena di dunia dia juga mendapat kebaikan. فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا۟ بِمَا عَمِلُوا۟( Maka Kami benar-benar akan memberitakan kepada orang-orang kafir apa yang telah mereka kerjakan) Yakni Kami pasti akan memberitahukan amalan-amalannya pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Sungguh jika kami memberikan orang kafir yang putus asa ini suatu kelapangan, kemudahan dan kebaikan setelah mendapat kesengsaraan dan penderitaan, dia pasti akan berkata: “Ini adalah hak yang seharusnya aku terima. Aku layak mendapatkannya dengan kesungguhanku daripada mengimani Allah karena hal itu tidak ada gunanya. Aku tidak meyakini bahwa kiamat itu akan ada sebagaimana yang dikabarkan oleh para nabi”. Jika aku dikembalikan kepada Tuhanku dengan kebangkitan setelah kematianku, aku beranggapan bahwa aku akan berada di sisiNya dengan diberi kenikmatan surga dan kemuliaan”. Sungguh kami akan mengabarkan kepada orang-orang yang mengingkari adanya hari kiamat tentang apa yang mereka kerjakan di dunia berupa kemaksiatan. Sungguh Kami juga akan membuat mereka merasakan azab yang sangat dahsyat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Kami membuatnya merasakan rahmat dari Kami setelah ditimpa} ditimpa {kesusahan sungguh dia akan berkata,“Ini adalah hakku dan aku tidak yakin bahwa hari kiamat itu akan terjadi. Dan jika aku dikembalikan kepada Tuhanku, sesungguhnya aku akan memperoleh kebaikan} keadaan yang baik berupa kemuliaan {di sisiNya.” Maka sungguh Kami akan memberitahukan} Sungguh Kami akan memberitahukan {kepada orang-orang kafir tentang apa yang telah mereka kerjakan dan sungguh Kami benar-benar akan menimpakan kepada mereka azab yang sangat berat} yang sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Kemudian Allah berfirman, “Dan jika Kami merasakan kepadanya,” maksudnya, kepada manusia yang tidak pernah bosan memohon kebaikan tersebut, dan apabila ia ditimpa keburukan lalu berputus asa, “sesuatu rahmat dari Kami,” yakni, setelah keburukan yang menimpanya itu, yaitu dengan disembuhkan dari sakitnya, atau Allah berikan kekayaan padanya dari kefakirannya, maka ia tidak bersyukur kepada Allah. Ia congkak dan semena-mena dan berkata, “Ini adalah hakku.” Artinya, ia datang kepadaku karena aku memang pantas dan berhak mendapatkannya, “dan aku tidak yakin bahwa Hari Kiamat itu akan datang.” Ini adalah sikap ingkarnya terhadap kebangkitan dan sikap kufurnya terhadap nikmat dan rahmat yang Allah berikan kepadanya untuk ia nikmati. “Dan jika aku dikembalikan kepada Rabbku, maka sesungguhnya aku akan memperoleh kebaikan di sisiNya.” Maksudnya, andai pun kalimat itu pasti dan aku akan dikembalikan kepada Allah, maka aku pasti memperoleh yang terbaik di sisiNya. Sebagaimana kenikmatan telah aku raih di dunia, maka sedemikian pula akan aku peroleh di akhirat nanti! Ini benar-benar merupakan kelancangan dan perkataan terhadap Allah tanpa dasar ilmu. Maka dari itu Allah mengancamnya dengan FirmanNya, “Maka Kami benar-benar akan memberitakan kepada orang-orang kafir apa yang telah mereka kerjakan dan akan Kami rasakan kepada mereka azab yang keras,” yakni, yang sangat dahsyat sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 50: (Dan sungguh jika) huruf Lamnya menunjukkan makna Qasam (Kami rasakan kepadanya) Kami berikan kepadanya (rahmat) kecukupan dan kesehatan (dari Kami sesudah kesusahan) yakni kesengsaraan dan malapetaka (yang telah menimpanya, pastilah dia berkata, \"Ini adalah hakku) artinya, berkat karyaku sendiri (dan aku tidak yakin bahwa hari Kiamat itu akan datang. Dan sungguh jika) huruf Lamnya menunjukkan makna Qasam (aku dikembalikan kepada Rabbku maka sesungguhnya aku akan memperoleh kebaikan di sisi-Nya\") yakni surga. (Maka Kami benar-benar akan memberitakan kepada orang-orang kafir apa yang telah mereka kerjakan dan akan Kami rasakan kepada mereka azab yang keras) siksaan yang keras. Huruf Lam yang terdapat pada dua Fi'il bermakna Qasam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan setelahnya menerangkan tentang keadaan orang-orang kafir. Seperti kekayaan dan kesehatan setelah ditimpa kemiskinan dan sakit. Tidak bersyukur kepada Allah. Yakni karena amalku atau karena aku memang layak memperolehnya. Ini merupakan pengingkarannya kepada kebangkitan, kufur kepada nikmat dan rahmat yang Allah berikan. Yaitu surga. Yakni kalau memang Kiamat itu terjadi, maka aku akan memperoleh kebaikan sebagaimana aku memperolehnya di dunia. Ini merupakan sikap beraninya dia kepada Allah dan berkata tentang Allah tanpa ilmu. Oleh karena itu, pada lanjutan ayatnya Allah mengancamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 50",
    "description": "Dan sifat buruk manusia yang lain adalah jika kami berikan kepada-Nya suatu rahmat atau hal-hal yang menyenangkan mereka dari kami setelah ditimpa kesusahan sebelumnya, pastilah dengan bangga dia berkata, 'ini adalah hakku yang aku dapatkan dari usahaku, dan aku tidak menduga atau yakin bahwa hari kiamat itu akan terjadi. Dan jika hari kiamat itu pun akan terjadi dan aku dikembalikan kepada tuhanku untuk mempertanggungjawabkan segala amalku, sesungguhnya aku pasti akan memperoleh bagian yang sangat baik di sisi-Nya. ' apa yang mere-ka katakan itu tidak akan pernah didapatkannya, bahkan sebaliknya. Maka sungguh di hari akhirat nanti, akan kami beritahukan kepada mere-ka orang-orang kafir tentang apa yang telah mereka kerjakan di dunia, dan sungguh, akan kami timpakan kepada mereka azab yang berat akibat keka-firan dan kedurhakaan mereka. 51. Dan demikian pula halnya apabila kami berikan nikmat dan berbagai kebajikan kepada manusia, dia berpaling dari kami dengan mengingkari nikmat-nikmat itu dan menjauhkan diri dari ajaran-ajaran kami dengan sombong. Akan tetapi, apabila ditimpa malapetaka sebagai peringatan atas keingkaran dan kesombongan mereka, maka dia banyak berdoa dengan doa yang panjang."
  }
]