[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Kami memberikan kenikmatan kepada manusia dengan kesehatan atau rizki atau lainya, maka dia berpaling dan menyombongkan diri sehingga dia menolak kepada kebenaran. Bila dia ditimpa kesulitan, maka dia banyak berdo’a kepada Allah agar mengangkat kesulitanya. Dia mengetahui Tuhanya saat dia berada dalam keadaan susah dan tidak mengenalNya dalam keadaan senang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Jika Kami memberi manusia nikmat berupa kesehatan, keselamatan dan yang sepertinya, maka manusia lalai dari mengingat Allah maupun menaati-Nya, dia berpaling ke samping dengan kesombongan. Namun bila manusia ditimpa musibah berupa penyakit, kemiskinan dan yang sepertinya, maka ia akan berdoa kepada Allah berulang kali, mengadukan apa yang menimpanya kepada Allah agar Allah mengangkatnya, ia tidak bersyukur kepada Rabbnya bila Rabbnya memberinya kenikmatan, ia tidak sabar atas ujian Rabbnya manakala Dia mengujinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Dan jika Kami memberi kenikmatan kepada manusia, maka dia berpaling dari rasa syukur kepada Allah Yang telah memberi kenikmatan; namun jika dia tertimpa musibah maka dia akan banyak berdoa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَإِذَآ أَنْعَمْنَا عَلَى الْإِنسٰنِ (Dan apabila Kami memberikan nikmat kepada manusia) Ini merupakan tabiat manusia secara umum. أَعْرَضَ(ia berpaling) Yakni berpaling dari rasa syukur. وَنَـَٔا بِجَانِبِهِۦ(dan menjauhkan diri) Yakni angkuh dan sombong serta enggan untuk melakukan ketaatan. وَإِذَا مَسَّهُ الشَّرُّ(tetapi apabila ia ditimpa malapetaka) Yakni musibah, kesulitan, kemiskinan, dan penyakit. فَذُو دُعَآءٍ عَرِيضٍ(maka ia banyak berdoa) Yakni jika dia tertimpa keburukan maka dia tunduk kepada Allah dan memohon pertolongan dari-Nya dengan harapan dapat diangkat apa yang telah menimpanya, dia akan berulang-ulang melakukan ini. Dia mengingat Allah dikala tertimpa musibah dan melupakan-Nya dikala lapang; dia memohon pertolongan ketika musibah datang dan meninggalkan-Nya ketika mendapat kenikmatan. Ini merupakan perbuatan orang-orang kafir, serta orang-orang Islam yang tidak kokoh dalam agamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Jika kami memberi nikmat kepada manusia, maka dia akan tidak bersyukur kepada yang memberi nikmat itu dan enggan menerima kebenaran. Dan jika dia tertimpa musibah berupa kefakiran atau sakit maka dia akan banyak-banyak berdoa secara terus-menerus. Ayat-ayat ini diturunkan untuk orang-orang kafir seperti Walid bin Mughirah dan Utbah bin Rabi’ah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila Kami menganugerahkan kenikmatan kepada manusia, niscaya dia berpaling dan menjauhkan diri} menjauhkan diri dari rasa syukur kepada Allah dan ketaatan kepadaNya, karena sombong {dan apabila kesusahan menimpanya, dia akan banyak berdoa} orang yang banyak berdoa agar diangkat kemudharatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan apabila Kami memberikan nikmat kepada manusia,” berupa kesehatan, rizki, atau lainnya “ia berpaling” dari Rabbnya dan dari mensyukuriNya, “dan menjauhkan diri,” maksudnya, menghindarkan diri “di sampingNya,” dengan sukap takjub dan sombong. “Tetapi apabila ia ditimpa malapetaka,” maksudnya, penyakit, kefakiran, atau lainnya, “maka ia banyak berdoa,” sangat sering sekali berdoa karena tidak mempunyai kesabaran. Tidak ada kesabaran saat ditimpa kesusahan dan tidak ada syukur saat mendapat kelapangan, kecuali orang yang diberi hidayah oleh Allah dan diberi karuniaNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 51: (Dan apabila Kami berikan nikmat kepada manusia) yang dimaksud adalah jenis manusia (ia berpaling) tidak mau bersyukur (dan menjauhkan diri) yakni memutarkan badannya seraya menyombongkan diri; menurut suatu qiraat lafal Na-aa dibaca dengan didahulukan huruf Hamzahnya (tetapi apabila ia ditimpa malapetaka maka ia banyak berdoa) banyak permintaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kesehatan dan rezeki. Dari Tuhannya dan dari bersyukur kepada-Nya. Seperti sakit, kemiskinan dan lainnya. Yakni karena tidak kuat bersabar di samping keadaannya yang tidak bersyukur saat mendapatkan kesenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 51",
    "description": "Dan demikian pula halnya apabila kami berikan nikmat dan berbagai kebajikan kepada manusia, dia berpaling dari kami dengan mengingkari nikmat-nikmat itu dan menjauhkan diri dari ajaran-ajaran kami dengan sombong. Akan tetapi, apabila ditimpa malapetaka sebagai peringatan atas keingkaran dan kesombongan mereka, maka dia banyak berdoa dengan doa yang panjang. 52. Ayat ini menggambarkan kesesatan orang-orang yang mengingkari Al-Qur'an. Katakanlah kepada mereka, wahai nabi Muhammad, 'bagaimana pendapatmu jika dia, yakni Al-Qur'an, yang kamu tolak tuntunannya dan keberadaannya itu benar-benar datang dari sisi Allah, kemudian kamu mengingkarinya. Jika demikian halnya, maka siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh dari kebenaran seperti keadaan kamu'' pastilah tidak ada yang lebih sesat."
  }
]