[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katankanlah wahai Rasul kepada oarang-orang yang mendustakan itu, “ Sampaikan pendapat kalian kepadaku bila Al- Qur’an ini memang datang dari sisi Allah kemudian kalian mengingkari dan mendustakanya, maka tidak ada yang lebih sesat dari kalian, karena kalian dalam keadaan menyelisihi yang jauh dari kebenaran dengan kekafiran kepada Al-Qur’an dan pendustaan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Katakanlah -wahai Rasul- kepada orang-orang musyrikin yang mendustakan itu, “Katakanlah kepadaku, bila Al-Qur`ān ini datang dari Allah kemudian kalian mengingkarinya dan mendustakannya, bagaimana keadaan kalian? Siapa yang lebih tersesat daripada orang yang selalu menentang kebenaran sekalipun kebenaran itu jelas, nyata dan kuat?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Hai Rasulullah, katakanlah kepada orang-orang musyrik: “Sampaikan kepadaku jika al-Qur’an ini dari Allah, lalu kalian dustakan, maka kalian akan menjadi orang yang paling sesat dan sangat bertentangan dengan kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. قُلْ أَرَءَيْتُمْ (Katakanlah: “Bagaimana pendapatmu) Yakni kabarkanlah kepadaku. إِن كَانَ مِنْ عِندِ اللهِ(jika (Al Quran) itu datang dari sisi Allah) Yakni al-Qur’an. ثُمَّ كَفَرْتُم بِهِۦ(kemudian kamu mengingkarinya) Yakni kalian mendustakannya dan tidak menerima dan mengamalkan kandungannya. مَنْ أَضَلُّ مِمَّنْ هُوَ فِى شِقَاقٍۭ بَعِيدٍ(Siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh?”) Yakni tidak ada yang lebih sesat dari kalian karena permusuhan kalian yang sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Wahai Nabi, katakanlah kepada orang-orang musyrik: “Kabarkanlah kepadaku (pendapat kalian) jika Al-Qur’an ini dari sisi Allah, kemudian kalian mendustakannya dan menyangkal apa yang ada di dalamnya. Tidak ada yang lebih parah kesesatannya daripada kalian. Kalian sangat jauh dari kebenaran dan hal itu tidak mungkin disangkal”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Bagaimana pendapat kalian} Kabarkanlah kepadaku {jika (Al-Qur’an) ini} Al-Qur’an ini {datang dari sisi Allah, kemudian kalian mengingkarinya. Siapakah yang lebih sesat} tidak ada yang lebih sesat {daripada orang yang menyimpang jauh} sangat keras kepala terhadap kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Katakanlah” kepada mereka yang mendustakan al-Quran, yang berlomba memilih kekafiran, “Bagaimana pendapatmu jika ia” maksudnya, al-Quran ini, “datang dari sisi Allah,” tanpa keraguan dan kebimbangan, “kemudian kamu mengingkarinya. Siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh?” yakni, menentang Allah dan RasulNya. Sebab sudah tampak jelas bagi kalian kebenaran dan yang benar, lalu kalian berpaling darinya, bukan kepada yang benar, melainkan kepada kebatilan dan kebodohan. Maka dengan demikian kalian menjadi manusia yang paling sesat dan paling zalim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 52: (Katakanlah, \"Bagaimana pendapat kalian jika ia) yakni Alquran itu (datang dari sisi Allah) sebagaimana yang telah dikatakan oleh Nabi saw. (kemudian kalian mengingkarinya. Siapakah) yakni tiada seorang pun (yang lebih sesat daripada orang yang selalu berada dalam penyimpangan) yakni perselisihan (yang jauh?\") dari kebenaran. Lafal Ba'iidun ini menduduki tempatnya lafal Minkum sebagai penjelasan tentang keadaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang mendustakan Al Qur’an. Tanpa ada keraguan lagi. Karena yang benar telah jelas, namun kamu malah berpaling darinya, bukan mendatangi kebenaran, tetapi malah mendatangi kebatilan sehingga kamu menjadi manusia paling sesat dan paling zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 52",
    "description": "Ayat ini menggambarkan kesesatan orang-orang yang mengingkari Al-Qur'an. Katakanlah kepada mereka, wahai nabi Muhammad, 'bagaimana pendapatmu jika dia, yakni Al-Qur'an, yang kamu tolak tuntunannya dan keberadaannya itu benar-benar datang dari sisi Allah, kemudian kamu mengingkarinya. Jika demikian halnya, maka siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh dari kebenaran seperti keadaan kamu'' pastilah tidak ada yang lebih sesat. 53. Untuk mendukung kebenaran Al-Qur'an, kami juga akan memperlihatkan kepada mereka tanda-tanda kebesaran kami di segenap penjuru yang dapat mereka saksikan di luar diri mereka dan apa saja yang ada pada diri mereka sendiri yang dapat mereka rasakan, sehingga jelaslah bagi mereka bahwa Al-Qur'an itu adalah benar datang dari Allah. Tidak cukupkah bagi kamu, wahai nabi Muhammad, bahwa tuhanmu menjadi saksi atas segala sesuatu'."
  }
]