[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami akan memperlihatkan kepada orang-orang yang mendustakan itu ayat-ayat Kami berupa kemenangan dan keungulan islam yang menaklukan negri-negri dan menggungguli agama-agama, dari penjuru langit dan belahan bumi, peristiwa-peristiwa besar yang terjadi pada keduanya dan pada diri mereka sendiri yang mengandung keajaiban penciptaan Allah dan Ayat-AyatNya, sehingga dari ayat-ayat tersebut mereka mengetahui dengan jelas dan tidak menyisakan keraguan bahwa al-Qur’an yang mulia ini adalah haq yang di wahyukan kepadamu dari Tuhan semesta alam. Apakah kesaksian Allah belum cukup bukti bahwa al-Qur’an adalah haq dan orang yang membawanya adalah benar? Allah telah bersaksi dengan membenarkanya dan Dia Maha menyaksikan segala sesuatu, dan tidak ada kesaksian yang lebih besar dari pada kesaksian Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Kami akan memperlihatkan kepada mereka ayat-ayat Kami di langit dan di bumi, Kami akan memperlihatkan ayat-ayat Kami pada diri mereka agar jelas bagi mereka sehingga terangkat keraguan bahwa Al-Qur`ān ini adalah kebenaran yang tidak ada kebimbangan padanya. Apakah belum cukup bagi orang-orang musyrikin itu bukti bahwa Al-Qur`ān ini adalah kebenaran dengan kesaksian Allah bahwa ia datang dari sisi-Nya? Siapakah yang lebih besar kesaksiannya daripada Allah? Kalau mereka menginginkan kebenaran, niscaya kesaksian Allah Rabb mereka sudah cukup bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Kami akan menunjukkan kepada mereka bukti-bukti kebenaran di penjuru-penjuru langit dan bumi, dan di penciptaan diri mereka sendiri dan kebesaran kuasa Allah padanya, hingga jelas bagi mereka bahwa al-Qur’an merupakan kebenaran dari Allah. Tidakkah cukup sebagai tanda kebenaran al-Qur’an bagi orang-orang musyrik bahwa Tuhanmu Maha Melihat segala yang dilakukan makhluk-Nya? Dan jawabannya, tentu itu cukup."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. سَنُرِيهِمْ ءَايٰتِنَا (Kami akan memperlihatkan kepada mereka tanda-tanda (kekuasaan) Kami) Yakni Kami akan memperlihatkan kepada mereka tanda-tanda kebenaran al-Qur’an dan bukti bahwa ia berasal dari Allah. فِى الْاٰفَاقِ(di segala wilayah bumi) Yakni di setiap ufuk langit dan bumi seperti matahari, bulan, bintang, malam, siang, angin, hujan, Guntur, kilat, petir, gunung, laut, dan lain sebagainya. وَفِىٓ أَنفُسِهِمْ(dan pada diri mereka sendiri) Berupa hikmah dan kelembutan penciptaan Allah pada tubuh dan jiwa manusia. حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ( hingga jelas bagi mereka bahwa Al Quran itu adalah benar) Yakni sampai jelas seterang-terangnya bagi mereka bahwa al-Qur’an, Dzat yang menurunkannya, dan rasul yang menyampaikannya adalah benar. أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ (Tiadakah cukup bahwa sesungguhnya Tuhanmu menjadi saksi atas segala sesuatu?) Yakni sebagai saksi atas perbuatan orang-orang kafir dan sebagai saksi bahwa al-Qur’an diturunkan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kami akan memperlihatkan kepada orang-orang kafir itu tentang dalil-dalil kebenaran ayat kami dalam Al-Qur’an bahwa sesungguhnya Al-Qur’an itu dari sisi Allah dan dalil tentang kekuasaan dan keesaan kami itu mencakup langit, bumi dan setiap sisinya yang berisi matahari, bulan, bintang, malam, siang, angin, hujan, pohon, gunung, laut dan lain-lain. (Dalil itu juga ada) dalam penciptaan diri mereka dan dalam diri mereka yang diciptakan dengan penuh keagungan dan ketelitian, untuk menjelaskan bagi mereka bahwa Al-Qur’an adalah kebenaran yang sudah pasti diturunkan dari Allah. Apakah (bukti itu) belum cukup bagi mereka bahwa Tuhanmu itu Maha Menyaksikan segala amal perbuatan mereka dan bahwa Al-Qur’an itu diturunkan dari sisiNya?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami akan memperlihatkan kepada mereka ayat-ayat Kami di sgala penjuru} di segala penjuru langit dan bumi {dan pada diri mereka sendiri sehingga jelas bagi mereka bahwa (Al-Qur’an) itu adalah benar} bahwa sesungguh Al-Qur’an itu benar tidak ada keraguan di dalamnya {Apakah tidak cukup bahwa sesungguhnya Tuhanmu menjadi saksi atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Jika kalian mengatakan atau kalian ragu terhadap kebenaran dan hakikatnya, maka Allah akan menegakkan terhadap kalian dan akan memperlihatkan kepada kalian tanda-tandaNya di ufuq, seperti tanda-tanda (ayat-ayat) Nya yang ada di langit dan di bumi dana pa-apa yang Aallah timbulkan di berbagai kejadian luar biasa yang menunjukkan kepada kebenaran bagi orang yang mencari tahu, “dan pada diri mereka sendiri,” dari apa-apa yang diliputi oleh raga mereka berupa keindahan ciptaan (tanda-tanda kekuasaan) Allah dan betapa luar biasanya kekuasaanNya, dan pada berbagai azab dan bencana yang menimpa orang-orang yang mendustakan, serta pada kemenangan orang-orang yang beriman, “sehingga jelaslah bagi mereka” dari tanda-tanda itu dengan penjelasan yang tidak ada keraguannya, “bahwa ia benar” dana pa yang dikandungnya pun benar. Allah telah melakukan hal itu, dan Allah telah memperlihatkan kepada hamba-hambaNya sebagian dari ayat-ayat (tanda-tanda) yang dengannya menjadi terbukti bahwa al-Quran itu benar. Akan tetapi Allah-lah yang memberikan bimbingan dan taufikNya kepada siapa saja yang Dia kehendaki untuk beriman, dan yang menelantarkan siapa saja yang Dia kehendaki. “Dan apakah Rabbmu tidak cukup bahwa sesungguhnya Dia menyaksikan segala sesuatu?” maksudnya, apakah tidak cukup kesaksian Allah bagi mereka untuk membuktikan bahwa al-Quran ini adalah benar dan orang yang membawanya adalah seorang yang jujur, yaitu kesaksian Allah yang telah mempersaksikan kebenarannya, dan Dia adalah sebenar-benar saksi, dan Dia juga telah mendukungnya dan memberikannya pertolongan yang mengandung makna kesaksianNya bagi siapa saja yang meragukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 53: (Kami akan memperlihatkan kepada mereka tanda-tanda kekuasaan Kami di segenap penjuru) di segenap penjuru langit dan bumi, yaitu berupa api, tumbuh-tumbuhan dan pohon-pohonan (dan pada diri mereka sendiri) yaitu berupa rapihnya ciptaan Allah dan indahnya hikmah yang terkandung di dalam penciptaan itu (sehingga jelaslah bagi mereka bahwa ia) yakni Alquran itu (adalah benar) diturunkan dari sisi Allah yang di dalamnya dijelaskan masalah hari berbangkit, hisab dan siksaan; maka mereka akan disiksa karena kekafiran mereka terhadap Alquran dan terhadap orang yang Alquran diturunkan kepadanya, yaitu Nabi saw. (Dan apakah Rabbmu tidak cukup bagi kamu) lafal Birabbika adalah Fa'il dari lafal Yakfi (bahwa sesungguhnya Dia menyaksikan segala sesuatu?) lafal ayat ini menjadi Mubdal Minhu yakni, apakah tidak cukup sebagai bukti tentang kebenaranmu bagi mereka, yaitu bahwasanya Rabbmu tiada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jika mereka masih meragukan kebenarannya. Seperti yang ada di langit dan di bumi, serta segala kejadian yang besar yang menunjukkan kepada kebenaran. Berupa indahnya ayat-ayat Allah dan keajaiban penciptaan-Nya, dan besar kekuasaan-Nya. Demikian pula dengan ditimpanya hukuman kepada orang-orang yang mendustakan dan ditolong-Nya kaum mukmin. Dari ayat-ayat itu. Demikian pula isinya. Allah Subhaanahu wa Ta'aala telah melakukannya, Dia telah memperlihatkan kepada hamba-hamba-Nya ayat-ayat yang dengannya semakin jelas kebenaran. Akan tetapi, Allah akan memberi taufik kepada keimanan siapa yang Dia kehendaki dan akan menelantarkan siapa yang Dia kehendaki. Yakni tidak cukupkah bagi mereka persaksian Allah bahwa Al Qur’an adalah benar dan yang membawanya juga benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 53",
    "description": "Untuk mendukung kebenaran Al-Qur'an, kami juga akan memperlihatkan kepada mereka tanda-tanda kebesaran kami di segenap penjuru yang dapat mereka saksikan di luar diri mereka dan apa saja yang ada pada diri mereka sendiri yang dapat mereka rasakan, sehingga jelaslah bagi mereka bahwa Al-Qur'an itu adalah benar datang dari Allah. Tidak cukupkah bagi kamu, wahai nabi Muhammad, bahwa tuhanmu menjadi saksi atas segala sesuatu'54. Allah lalu mengingatkan nabi Muhammad dengan menyatakan, 'ingatlah, sesungguhnya mereka dalam keraguan, yakni tidak meyakini tentang pertemuan dengan tuhan mereka kelak di hari kiamat. Ingatlah pula, sesungguhnya dia maha meliputi segala sesuatu dengan ilmu dan kekuasaan-Nya. '."
  }
]