[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketahuilah, bahwa orang-orang kafir itu dalam keraguan yang besar terhadap kebangkitan sesudah mati. Ketahulah, bahwa sesungguhnya ilmu, kemuliaan, dan kuasa Allah meliputi segala sesuatu, tiada sesuatupun di langit dan di bumi yang samar baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Ingatlah, bahwa orang-orang musyrikin itu berada di dalam keraguan terhadap perjumpaan dengan Rabb mereka pada hari Kiamat karena mereka mengingkari kebangkitan. Mereka tidak beriman kepada Akhirat, karena itu mereka tidak bersiap menghadapinya dengan amal saleh. Ingatlah, bahwa sesungguhnya Allah meliputi segala sesuatu dengan ilmu dan kodrat-Nya"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Hai para hamba, sadarilah bahaya dari kepercayaan orang-orang musryik yang meragukan hari kebangkitan dan perhitungan. Dan berhati-hatilah dari kemurkaan Allah, karena Dia Maha Meliputi segalanya, tidak ada yang tersembunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. أَلَآ إِنَّهُمْ فِى مِرْيَةٍ مِّن لِّقَآءِ رَبِّهِمْ ۗ (Ingatlah bahwa sesungguhnya mereka adalah dalam keraguan tentang pertemuan dengan Tuhan mereka) Dengan adanya hari kebangkitan, hisab, pahala, dan siksaan. أَلَآ إِنَّهُۥ بِكُلِّ شَىْءٍ مُّحِيطٌۢ (Ingatlah bahwa sesungguhnya Dia Maha Meliputi segala sesuatu) Ilmu dan kuasa-Nya meliputi segala hal. Maka mengapa mereka masih meragukan hari kebangkitan dan pengumpulan, padahal mereka juga telah mengetahui bahwa Allah-lah yang menciptakan mereka pertama kali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Ingatlah bahwa orang-orang musyrik itu berada dalam keragraguan tentang adanya kebangkitan setelah kematian. Ingatlah bahwa sesungguhnya Allah SWT itu meliputi segala sesuatu dan membalas kekufuran orang-orang kafir itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya mereka dalam keraguan} keraguan {tentang pertemuan dengan Tuhan mereka. Ketahuilah sesungguhnya Dia Maha Meliputi segala sesuatu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Ingatlah, bahwa sesungguhnya mereka adalah dalam keraguan tentang pertemuan dengan Rabb mereka,” maksudnya, berada dalam kebimbangan atas kebenaran kebangkitan dan Hari Kiamat dan mereka tidak mempunyai negeri lain selain dunia, maka dari itu mereka tidak beramal untuk akhirat dan tidak menghiraukannya. “Ingatlah, bahwa sesungguhnya Dia Maha Meliputi segala sesuatu,” dari segi ilmu pengetahuan, kekuasaan, dan keperkasaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 54: (Ingatlah bahwa sesungguhnya mereka adalah dalam keraguan) yakni keragu-raguan (tentang pertemuan dengan Rabb mereka) karena mereka ingkar kepada adanya hari berbangkit. (Ingatlah, bahwa sesungguhnya Dia) yakni Allah swt. (Maha Meliputi segala sesuatu) yaitu ilmu dan kekuasaan-Nya meliputi segala sesuatu, maka dari itu Dia akan membalas mereka disebabkan kekafiran mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kebangkitan dan hari Kiamat, dan menurut mereka yang ada hanyalah dunia saja, sehingga mereka tidak mengerjakan amalan untuk akhirat dan tidak menengok kepadanya. Baik ilmu-Nya, kekuasaan-Nya maupun keperkasaan-Nya, lalu Dia akan membalas mereka karena kekafirannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 54",
    "description": "Allah lalu mengingatkan nabi Muhammad dengan menyatakan, 'ingatlah, sesungguhnya mereka dalam keraguan, yakni tidak meyakini tentang pertemuan dengan tuhan mereka kelak di hari kiamat. Ingatlah pula, sesungguhnya dia maha meliputi segala sesuatu dengan ilmu dan kekuasaan-Nya. '1. Hanya Allah yang lebih tahu tentang makna h' m'm."
  }
]