[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. katakanlah kepada mereka (wahai rasul), “Sesungguhnya aku hanyalah manusia yang sama dengan kalian, hanya saja Allah mewahyukan kepadaku, bahwa Tuhan kalian yang berhak kalian sembah hanyalah Tuhan yang Esa yang tiada sekutu bagiNya, maka tempuhlah jalan yang menyampaikan kepadaNya dan carilah ampunanNya. Kebinasaan dan siksaan bagi orang-orang musyrik yang menyembah selain Allah berupa berhala-berhala yang tidak dapat memberi manfaat dan tidak pula mudarat, yaitu orang-orang yang tidak menyucikan diri mereka dengan mentauhidkan Tuhan mereka dan ikhlas kepadaNya, tidak menunaikan zakat kepada yang berhak menerimanya, sehingga dia tidak memiliki keikhlasan kepada Yang Maha Pencipta dan tidak pula manfaat kepada makhluk dan mereka tidak beriman kepada kebangkitan, mereka juga tidak beriman kepada surga dan neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Orang-orang yang tidak menunaikan zakat harta mereka, dan mereka kafir kepada Akhirat dengan segala apa yang terkait dengannya berupa nikmat abadi dan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الَّذِينَ لَا يُؤْتُونَ الزَّكَوٰةَ (yaitu) orang-orang yang tidak menunaikan zakat) Mereka enggan membayar zakat kepada orang-orang fakir, tidak pula menginfakkannya dalam ketaatan. وَهُم بِالْاٰخِرَةِ هُمْ كٰفِرُونَ(dan mereka kafir akan adanya (kehidupan) akhirat) Yakni mengingkarinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Mereka adalah orang-orang yang tidak menunaikan zakat kepada orang-orang yang membutuhkan. Mereka menyangkal adanya akhirat dan tidak membenarkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang tidak menunaikan} tidak memberikan {zakat dan mereka ingkar terhadap kehidupan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-7. “katakanlah” kepada mereka, wahai nabi “bahwasanya aku hanyalah seorang manusia seperti kamu, diwahyukan kepadaku,” inilah sifat dan tugasku, yaitu bahwa aku adalah manusia biasa, aku tidak memiliki wewnang apa pun, dan aku juga tidak memilki apa yang kalian minta segera. Sesungguhnya Allah hanya mengutamakanku atas kalian, mengistimewakanku dengan wahyu yang diwahyukanNya kepadaku dan memerintahkanku untuk mengikutinya dan mengajak kalian kepadanya. “maka tetaplah pada jalan yang lurus menuju kepadaNYa,” maksudnya, tempuhlah jalan yang dapat mengantarkan kepada Allah, dengan cara membenarkan berita yang aku sampaikan dan mengikuti perintah dan jauhi larangan. Inilah hakikat istiqamah. Kemudian konsisten kepadanya. Ungkapan, “padanya,” mengingatkan tentang keikhlasan, dan orang yang akan beramal hendaknya menjadikan tujuan dan niat beramalnya adalah untuk sampai kepada Allah dan kepada negeri kemuliaanNYa.maka dengan begitu amalnya tulus, shalih, lagi bermanfaat, dan dengan terbaiknya ikhlas maka amalnya menjadi sia-sia. Oleh karena seorang hamba, sekalipun ia telah bersungguh-sungguh untuk tetap istiqamah, pasti terjadi kekeliruan darinya karena mengabaikan perintah atau melakukan yang dilarang, maka Allah menyuruh mengobatinya dengan istigfar yang mengandung makna taubat, seraya berfirman, ”dan mohonlah ampun kepadanya,” kemudian Allah mengancam orang yang mengabaikan istiqamah, seraya berfirman, ”dan kecelakaan yang besarlah bagi orang-orang yang mempersekutukanNYa, yaitu orang-orang yang tidak menunaikan zakat,” yaitu orang-orang yang menyembah apa-apa yang tidak mampu mendatangkan manfaat, mudaat, kematian, kehidupan dan tidak pula mampu menghidupkan kembali. Dan mereka menginjak-nginjak diri mereka, tidak membersihkannya dengan mengesakan Allah,Rabb mereka dan ikhlas kepadaNYa. Mereka tidak melakukan shalat dan tidak juga membayar zakat. Tidak ada keikhlasan kepada sang pencipta dengan tauhid dan shalat, dan tidak pula ada pemberian manfaat kepada sesame dengan menunaikan zakat dan lain-lainnya. “dan mereka kafir akan adanya akhirat,” artinya, mereka tidak beriman kepada kebangkitan, kepada adanya surga ataupun adanya neraka. Maka dari itu, setelah rasa takut sirna dari hati mereka, maka mereka berani melakukan apa yang telah mereka lakukan, yaitu perbuatan yang dapat mencelakakan mereka di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 7: (Yaitu orang-orang yang tidak menunaikan zakat dan mereka kepada kehidupan akhirat benar-benar mereka) Hum yang kedua ini mengandung makna mengukuhkan lafal Hum yang pertama (kafir.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak membersihkan dirinya dengan tauhid dan ikhlas kepada Allah, tidak melaksanakan shalat dan tidak menunaikan zakat. Mereka tidak berbuat ikhlas kepada Allah dengan tauhid dan shalat, serta tidak memberi manfaat kepada manusia dengan zakat dan lainnya. Yakni mereka tidak beriman kepada kebangkitan, surga dan neraka, sehingga hilanglah rasa takut kepada azab neraka dan mereka pun berani mengerjakan hal yang membahayakan diri mereka di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 7",
    "description": "Siapakah orang-orang yang mempersekutukan Allah itu' mereka adalah orang-orang yang tidak menunaikan zakat, dan mereka juga ingkar terhadap kehidupan akhirat dan tidak mempercayai adanya kebangkitan manusia kembali setelah mereka dimatikan. 8. Setelah menggambarkan ancaman bagi orang-orang musyrik mekah, Al-Qur'an mengalihkan perhatian kepada orang-orang beriman. Sesungguhnya orang-orang yang beriman dengan tulus ikhlas dan yang membuktikan iman mereka dengan mengerjakan kebajikan dan ber-amal saleh, mereka mendapat anugerah pahala yang sangat besar serta dilimpahi rezeki yang tidak ada putus-putusnya. '."
  }
]