[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah, RasulNya, kitabNya dan melakukan amal-amal shalih dengan ikhlas dalam melakukannya, bagi mereka pahala besar yang tidak terputus dan tidak terhalangi.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-rasul-Nya, melakukan amal-amal saleh, bagi mereka pahala abadi tidak terputus, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Orang-orang yang beriman kepada Allah dan mengikrarkan keesaan-Nya serta menjalankan ketaatan, maka mereka akan mendapat pahala yang besar tanpa dikurangi sedikitpun dan tanpa terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. إِنَّ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (Sesungguhnya orang-orang yang beriman dan beramal saleh, mereka mendapat pahala yang tiada putus-putusnya”) Yakni mendapat pahala yang tidak terputus. Pendapat lain mengatakan makna ayat ini adalah bahwa mereka tidak dikaruniai pahala mereka, sebab karunia berasal dari kemurahan pemberi karunia, sedangkan pahala adalah hak yang harus diberikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya orang-orang yang beriman kepada Allah dan Rasulnya serta beramal shalih, bagi mereka itu pahala yang tiada putusnya dan tidak pernah dibayangkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dan beramal shalih, bagi mereka itu pahala yang tidak ada putus-putusnya”} tanpa terputus dan dikurangi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. setelah menjelaskan orang-oang kafir, maka Allah menjelaskan orang-orang beriman, sifat mereka dan balasan untuk mereka, seraya berfirman,”sesungguhnya orang-orang yang beriman,” kepada kitab al-qur’an ini dan apa-apa yang dikandungnya dari iman yang diserukan kepadanya, dan mereka membenarkan iman yang diserukan kepadanya, dan mereka membenarkan iman mereka dengan amal shalih yang mencakup ikhlas dan mutaba’ah (mengikuti Rasulullah), “mereka mendapat pahala” yang sangat besar “yang tiada putus-putusnya,” yakni, tidak pernah terhenti dan tidak pernah habis, melainkan terus mengalir sepanjang waktu, selalu tumbuh sepanjang masa, penuh dengan semua kelezatan dan hal-hal yang menyenangkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Fussilat ayat 8: (Sesungguhnya orang-orang yang beriman dan mengerjakan amal yang saleh mereka mendapat pahala yang tiada putusputusnya\") tanpa henti-hentinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah menyebutkan orang-orang kafir, maka Dia menyebutkan orang-orang mukmin, menyifati mereka dan menyebutkan balasan yang akan diberikan untuk mereka. Yakni kepada kitab ini (Al Qur’an) dan kepada semua yang wajib diimani yang diserukan oleh kitab tersebut. Mereka juga membenarkannya dengan amal saleh yang mencakup ikhlas dan mutaba’ah (mengikuti rasul). Yakni yang tidak habis-habisnya, bahkan tetap terus sepanjang waktu, bertambah di setiap saat dan menghimpun semua kesenangan dan kenikmatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Fussilat Ayat 8",
    "description": "Setelah menggambarkan ancaman bagi orang-orang musyrik mekah, Al-Qur'an mengalihkan perhatian kepada orang-orang beriman. Sesungguhnya orang-orang yang beriman dengan tulus ikhlas dan yang membuktikan iman mereka dengan mengerjakan kebajikan dan ber-amal saleh, mereka mendapat anugerah pahala yang sangat besar serta dilimpahi rezeki yang tidak ada putus-putusnya. '9. Penggambaran sikap orang-orang musyrik mekah yang memper-sekutukan Allah dan menolak keniscayaan hari kiamat merupakan sikap yang tidak pantas untuk dilakukan terhadap sang pencipta alam semesta. Oleh sebab itu, nabi Muhammad diperintahkan untuk memberikan peringatan keras terhadap orang-orang musyrik mekah itu dan orang-orang yang bersikap sama dengan mereka. Katakanlah wahai nabi Muhammad, 'pantaskah kamu ingkar kepada Allah, tuhan yang menciptakan planet bumi dalam dua masa, dan pada waktu yang sama kamu adakan pula sekutu-sekutu bagi-Nya' Allah yang maha esa itulah tuhan pencipta dan pemelihara seluruh alam. '."
  }
]