[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saling berbangga dengan banyaknya harta dan anak anak telah melenakan kalian dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Bersombong-sombong dengan harta dan anak telah melalaikan kalian -wahai manusia- dari ketaatan terhadap Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah menujukan firman-Nya kepada para pemimpin orang-orang musyrik: Kalian telah dilalaikan dari hal yang wajib kalian kerjakan, yaitu dilalaikan oleh perbuatan berlomba-lomba dan menyombongkan harta, derajat, kabilah, dan banyaknya jabatan. Perilaku ini merupakan sifat orang-orang musyrik, maka hendaklah kaum muslimin mengetahui bahwa sifat ini tercela di hadapan Allah. Kalian melakukan perbuatan ini hingga kalian mendatangi kubur, yakni hingga kalian mati. Dan manusia memiliki tabiat ini hingga kematian datang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. اَلۡهٰٮكُمُ التَّكَاثُرُۙ‏ (Bermegah-megahan telah melalaikan kamu) Yakni memperbanyak harta dan keturunan, serta berbangga-bangga dengan itu, dan saling berlomba untuk mengumpulkannya telah melalaikan kalian dari ketaatan kepada Allah dan beramal untuk akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Hamzah al-Kannany berkata : \"Aku telah mengeluarkan sebuah hadits yang diriwayatkan melalui 200 jalan yang berbeda, akhirnya rasa senang yang berlebihan menguasaiku, dan aku juga ditakjubkan olehnya, kemudian aku melihat Yahya bin Ma'in dalam mimpi, lalu aku berkata kepadanya : \"wahai abu Zakaria, aku telah mengeluarkan sebuah hadits melalui 200 jalan yang berbeda ! kemudian ia terdiam beberapa saat, lalu berkata : aku hawatir hal itu termasuk dalam ayat yang berbunyi : { أَلْهَاكُمُ التَّكَاثُرُ } 2 ). Maimun bin mahran berkata : suatu ketika aku duduk disisi Umar bin Abdul Aziz kemudian ia membaca : { أَلْهَاكُمُ التَّكَاثُرُ , حَتَّىٰ زُرْتُمُ الْمَقَابِرَ }, tiba-tiba ia menangsis, kemudian berkata : \"wahai ma'mun !\" aku tidak pernah melihat kuburan kecuali aku mengunjunginya, dan setiap orang yang mengunjunginya pasti akan kembali kerumahnya di surga atau di neraka ! 3 ). { حَتَّىٰ زُرْتُمُ الْمَقَابِرَ } Jika seandainya keberadaan sesorang didalam kuburnya hanya sekedar ziaroh padahal masa keberadaan mereka ada yang sampai seribu tahun, lalu bagaimana kita menggambarkan dan menjelasakan keberadaan kita didunia yang tidak terikat waktu ? perhatikanlah ayat ini : { قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَاسْأَلِ الْعَادِّينَ } \" Mereka menjawab: “Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada orang-orang yang menghitung”. [ al-Mu'minun : 113 ], sungguh merugilah orang-orang yang menyia-nyiakan hidupnya !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Kesibukanmu wahai manusia, hanya berlomba-lomba untuk mengumpulkan harta dan merasa bangga dengan harta dan anak yang banyak. Imam Ahmad, Imam Muslim, Tirmidzi dan An-Nasa’I dari Abdullah bin Syikhir berkata: “Aku berhenti saat bertemu Rasulallah SAW yang sedang bersabda “{Alhaakumut takaatsur}, dan anak Adam menyebut-nyebut: “hartaku hartaku”, (beliau bertanya) “Tidaklah kamu memiliki hartamu kecuali kamu memakannya lalu menghancurkannya atau kamu memakainya lalu membuatnya lusuh atau kamu menyedekahkannya, maka kamu membuatnya tetap abadi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian telah dilalaikan} kalian telah disibukkan dari ketaatan kepada Allah {oleh kegiatan bermegahan} bermewah-mewahan dengan harta dan anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kelalaian, bermain-main, dan mempersibuk dirimu terus berlangsung, “sampai kamu masuk ke dalam kubur.” Pada saat itu terbukalah penutup bagimu, hanya saja setelah kalian tidak bisa memulainya. Firman Allah, “Sampai kamu masuk ke dalam kubur,” menunjukkan bahwa alam barzakh sebagai para pengunjung, tidak menyebut mereka sebagai para penghuni. Hal itu menunjukkan bahwa kebangkitan dan pembalasan amal perbuatan di akhirat yang kekal, bukan di tempat fana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَلْهَاكُمُ } Telah melalaikanmu { التَّكَاثُرُ } sikap berbanyak-banyak, yakni berbanyak-banyak dalam kemegahan harta dunia, Allah - عز وجل - berfirman : { اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ } ( Ketahuilah, bahwa sesungguhnya kehidupan dunia ini hanyalah permainan dan suatu yang melalaikan, perhiasan dan bermegah-megah antara kamu serta berbangga-banggaan tentang banyaknya harta dan anak ) [ Al-Hadid : 20 ] , berapa banyak manusia didunia ini sedang mneyibukkan dirinya untuk mencari dan terus memperbanyak harta kekayaan, dan mereka membanggakan itu semua, sehingga dengan kebanggaannya itu mereka lala dari mengerjakan amal shalih, bagi mereka amal shalih tidak begitu penting dibandikan dengan kekayaan yang mereka anggap akan menyenangkan kehidupan dunia mereka, dan kepada hari akhir mereka lalai. { أَلْهَاكُمُ } Telah melalaikanmu, dari perkara apa ? dari hari akhir, dunia telah melalaikanmu dari mengingat hari akhir dan sibuk bersiap diri untuk menghadapinya, dunia ini akan punah, sedangkan akhirat akan tiba dan kehidupannya kekal selamanya, lalu mengapa kamu meninggalkan perkara yang kamu akan kekal hidup didalamnya dan sibuk dengan perkara yang pasti akan berakhir ? .. maka berfikirlah kalian."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَلْهَاكُمُ التَّكَاثُرُ (1) حَتَّى زُرْتُمُ الْمَقَابِرَ \" Bermegah-megahan telah melalaikan kamu, sampai kamu masuk ke dalam kubur.\" Ungkapan dalam ayat ini adalah ungkapan pemberitaan, Allah 'Azza Wa Jalla memberitakan dengannya hamba-hamba-Nya, Dia mengajak bicara mereka dengan mengatakan: أَلْهَاكُمُ التَّكَاثُرُ \" Bermegah-megahan telah melalaikan kamu \" Makna أَلْهَاكُمُ adalah: Telah melalaikan kalian, hingga kalaian lali terhadapa apa yang lebih penting , berupa mengingat Allah Ta'ala dan melaksanakan ketaatan kepada-Nya, yang diajak bicara di sini adalah semua umat, tetapi dikecualikan orang-orang yang tersibukkan dengan urusan-urusan akhirat dari urusan-urusan dunia, dan orang seperti ini sedikit. Kita katakan sedikit karena telah tetap dalam shahihain bahwa Allah Tabaaraka wa Ta'ala berfirman pada hari kiamat: يَا آدَمُ، فَيَقُوْلُ: لَبَّيْكَ وَسَعَدَيكَ وَالْخَيْرُ فِي يَدَيْكَ. فَيَقُوْلُ: أَخْرِجْ مِنْ ذُرِّيَّتِكَ بَعْثًا إِلَى النَّارِ، قَالَ: وَمَا بَعْثُ النَّارِ؟ قَالَ: مِنْ كُلِّ أَلْفٍ تِسْعُمِائَةٍ وَتِسْعَةً وَتِسْعِيْنَ \"Wahai Adam. Maka ia menjawab: Kami saya mendengar dan segera mentaati panggilan-Mu, dan kebaikan berada di kedua tangan-Mu. Lalu Allah berkata: Keluarkanlah orang pilihan (diutus) ke neraka! Adam bertanya: Berapa jumlah orang pilihan dari neraka? Allah menjawab: Dari setiap seribu, (keluarkan satu) sembilan ratus sembilan puluh sembilan\" (1) satu di surga dan sisanya (yaitu 999) di neraka. Ini adalah jumlah yang sangat timpang! Jika demikian, maka tidak ada dari anak-anak Adam melainkan hanya satu saja dari seribu orang yang menjadi penduduk surga, sedangkan sisanya adalah penghuni neraka. Dengan demikian maka yang diajak bicara di sini dalam ayat ini dengan keumumannya (mencakup semua manusia) diterapkan sesuai konteks asalnya, karena satu orang dibanding seribu tidak ada apa-apanya. Sedangkan firman-Nya: التَّكَاثُرُ \"berbanyak-banyak\" Ini mencakup berbanyak-banyak dalam harta, jumlah suku, jabatan, ilmu dan segala sesuatu yang bisa dibangga-banggakan. Hal ini ditunjukkan oleh ucapan pemilik kebun kepada temannya: أَنَا أَكْثَرُ مِنْكَ مَالًا وَأَعَزُّ نَفَرًا \" Hartaku lebih banyak dari pada hartamu dan pengikut-pengikutku lebih perkasa\"(QS. Al-Kahfi: 34) Manusia bisa saja ia berbangga dengan banyaknya harta, sehingga ia mencari harta lebih banyak dari yang lainnya atau mencari bisnis yang lebih luas lagi, bisa juga ia berbangga dengan sukunya, dengan mengatakan: Kami lebih banyak jumlahnya dari mereka, sebagaimana yang diungkapkan penyair: وَلَسْتُ بِالأَكْثَرِ مِنْهُمْ حَصًى وَإِنَّمَا الْعِزَّةُ لِلْكَاثِرِ Aku Bukanlah yang paling banyak kerikilnya dari mereka. Tetapi keperkasaan sejati adalah yang lebih banyak jumlahnya (orangnya).. Yang paling banyak kerikilnya, karena mereka dahulu, mereka menjadikan alat hitung sesuatu dengan kerikil, misalnya, apabila kerikil mereka berjumlah sepuluh ribu, dan yang lain jumlah kerikilnya delapan ribu, maka qobilah pertama adalah yang lebih banyak dan lebih perkasa, maka dari itu, penyair bersenandung: وَلَسْتُ بِالأَكْثَرِ مِنْهُمْ حَصًى وَإِنَّمَا الْعِزَّةُ لِلْكَاثِرِ Aku Bukanlah yang paling banyak kerikilnya dari mereka. Tetapi keperkasaan sejati adalah yang lebih banyak jumlahnya (orangnya). Manusia pun berbangga bangga dengan ilmu, anda mendapati dirinya membanggakan ilmu dari yang lainnya, tetapi jika dengan ilmu syar'iy maka ini baik, jika bukan dengan selain ilmu syar'iy maka bisa jadi mubah atau pun haram. Ini lah kebanyakan pada anak Adam yaitu berbangga-bangga, mereka berbanyak-banyak pada perkara-perkara tersebut dari tujuan mereka diciptakan berupa ibadah kepada Allah 'Azza Wa Jalla. (1) Dikeluarkan Bukhari (3348) dan Muslim (222) dari hadits Abu Sa'id Al-Khudriy radhiyallaah 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 1: 1-2. Allah mengabarkan bahwa manusia telah disibukkan dari ketaatan kepada Allah dengan berbangga diri dan pamer atas banykanya harta dan anak; Sampai-sampai umurnya berakhir dan mereka binasa (hingga) menuju ke kuburan, dikuburkannya mereka di dalamnya sebelum dirinya (mampu) mendahulukan amalan yang baik (ketika di dunia). Dan ini adalah kondisi kebanyakan manusia. Kami meminta keselamatan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menegur hamba-hamba-Nya yang dibuat lalai oleh bermegah-megahan dari mengerjakan tujuan mereka diciptakan, yaitu beribadah kepada Allah Subhaanahu wa Ta'aala, mengenal-Nya, kembali kepada-Nya dan mengutamakan kecintaan kepada-Nya di atas segala sesuatu. Maksudnya, bermegah-megahan dalam hal banyak harta, anak, pengikut, kemuliaan, kedudukan dan semisalnya yang tujuannya bukan untuk mencari keridhaan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 1",
    "description": "Wahai manusia, bermegah-megahan dalam hal harta, keturunan, dan pengikut telah melalaikan kamu dari ketaatan kepada Allah dan mempersiapkan diri untuk menghadapi hari akhir. 2. Kamu tidak akan berhenti bermegah-megahan seperti itu sampai kamu mati dan masuk ke dalam kubur."
  }
]