[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kesibukan kalian terus demikian hingga kalian dibawa ke kuburan dan di makamkan disana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Hingga kalian mati dan masuk ke dalam kuburan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. حَتّٰى زُرۡتُمُ الۡمَقَابِرَؕ‏ (sampai kamu masuk ke dalam kubur) Yakni hingga kematian mendatangi kalian sedangkan kalian masih dalam keadaan tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Hamzah al-Kannany berkata : \"Aku telah mengeluarkan sebuah hadits yang diriwayatkan melalui 200 jalan yang berbeda, akhirnya rasa senang yang berlebihan menguasaiku, dan aku juga ditakjubkan olehnya, kemudian aku melihat Yahya bin Ma'in dalam mimpi, lalu aku berkata kepadanya : \"wahai abu Zakaria, aku telah mengeluarkan sebuah hadits melalui 200 jalan yang berbeda ! kemudian ia terdiam beberapa saat, lalu berkata : aku hawatir hal itu termasuk dalam ayat yang berbunyi : { أَلْهَاكُمُ التَّكَاثُرُ } 2 ). Maimun bin mahran berkata : suatu ketika aku duduk disisi Umar bin Abdul Aziz kemudian ia membaca : { أَلْهَاكُمُ التَّكَاثُرُ , حَتَّىٰ زُرْتُمُ الْمَقَابِرَ }, tiba-tiba ia menangsis, kemudian berkata : \"wahai ma'mun !\" aku tidak pernah melihat kuburan kecuali aku mengunjunginya, dan setiap orang yang mengunjunginya pasti akan kembali kerumahnya di surga atau di neraka ! 3 ). { حَتَّىٰ زُرْتُمُ الْمَقَابِرَ } Jika seandainya keberadaan sesorang didalam kuburnya hanya sekedar ziaroh padahal masa keberadaan mereka ada yang sampai seribu tahun, lalu bagaimana kita menggambarkan dan menjelasakan keberadaan kita didunia yang tidak terikat waktu ? perhatikanlah ayat ini : { قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَاسْأَلِ الْعَادِّينَ } \" Mereka menjawab: “Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada orang-orang yang menghitung”. [ al-Mu'minun : 113 ], sungguh merugilah orang-orang yang menyia-nyiakan hidupnya !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Sehingga kalian meninggal dan dikubur dalam kuburan. Maksudnya adalah Aku menyibukkanmu di tempat peristirahatan dunia. {Kalla} : untuk mencegah(mu) melakukan sesuatu sebelumnya seperti memperbanyak harta. Hal itu bukanlah hal yang kamu inginkan, kalian akan mengetahui buruknya hukuman atas kebanggaan kalian (atas harta) setelah meninggal dan pada hari kiamat. Sesungguhnya itu bukanlah kebahagiaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sampai kalian masuk ke dalam kubur} kalian mati dan dimasukkan dalam kubur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kelalaian, bermain-main, dan mempersibuk dirimu terus berlangsung, “sampai kamu masuk ke dalam kubur.” Pada saat itu terbukalah penutup bagimu, hanya saja setelah kalian tidak bisa memulainya. Firman Allah, “Sampai kamu masuk ke dalam kubur,” menunjukkan bahwa alam barzakh sebagai para pengunjung, tidak menyebut mereka sebagai para penghuni. Hal itu menunjukkan bahwa kebangkitan dan pembalasan amal perbuatan di akhirat yang kekal, bukan di tempat fana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kalian tidak menyadari begitu jauhnya kalian mengembara untuk mengumpulkan kenikmatan dunia kecuali ketika kematian menjemput, dan kalian tidak sama sekali merasa puas dengan apa yang telah diperoleh dari harta dunia ini. Kalian sibuk, sibuk dengan dunia hingga ajal menjemut, dan kemana kalian akan dibawa setelah kematian ? apakah kalian akan digiring ke istana-istana dan kekayaan-kekayaan yang telah kalian kumpulkan ? jasad kalian akan dibawa kemana ? jasad yang kaku itu akan ditimbun didalam kubur, kalian tidak lagi akan bersama dengan kemegahan yang berlimpah itu, melainkan sehelai kain yang membungkus badan, kalian keluar kedunia dari rahim ibu tanpa sehelai kain apapun, dan kalian akan dikeluarkan dari dunia ini kembali dengan tidak berbusana pula kecuali kain kafan sebagai penutup atau amalan shalih sebagai bekal untuk akhirat yang kekal. Pada ayat ini dikatakan ( زرتم ) yang berarti mengunjungi, yakni manusia akan masuk kedalam kubur hanya sekedar sebagai kunjungan, karena kubur bukanlah tempat kembali yang paling terakhir, setiap manusia akan singgah di kuburnya masing-masing untuk menunggu waktu terjadinya kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian firman Allah Ta'ala: حَتَّى زُرْتُمُ الْمَقَابِرَ \" sampai kamu masuk ke dalam kubur.\" Yakni: Hingga kalian mendatangi atau masuk ke kubur, yakni: sampai kamu mati. Manusia memiliki sifat bawaan untuk bermewah-mewahan sampai ia mati, bahkan setiap kali kesombongannya bertambah, maka angan-angannya pun semekin bertambah. Usia semakin beruban namun angan-angan semakin dirasa memuda. Sampai-sampai sesorang yang sudah berumur 90 tahun misalnya, anda dapati ia mempunyai angan-angan dan panjang harapan yang tidak anda dapati pada seorang pemuda yang baru berusia15 tahun, inilah makna ayat yang mulia ini, bahwa kaliau terlalaikan dengan bermegah-megahan dari akhirat hingga kalian mati. Dikatakan juga bahwa makna حَتَّى زُرْتُمُ الْمَقَابِرَ \" sampai kamu masuk ke dalam kubur.\" Sampai-sampai kalian berbangga-bangga dengan jumlah yang mati (dari suku kalian) sebagaimana kalian bebangga-bangga dengan banyaknya yang hidup. Datang seorang manusia mengatakan: Bahwa sukuku lebih banyak dari sukumu, jika mau silahkan kamu datangi kuburan, hitunglah jumlah kuburan kami dan hitunglah jumlah kuburan anda, mana yang lebih banyak? Tetapi ini adalah pendapat yang lemah dan jauh dari konteks ayat ini. Makna yang pertama adalah yang tepat, bahwa kalian akan bermegah-megah sampai kalian mati. Firman Allah : حَتَّى زُرْتُمُ الْمَقَابِرَ \" sampai kamu masuk ke dalam kubur.\" Umar Bin Abdul'Aziz rahimahullah menjadikan ayat ini sebagai dalil bahwa zair (pendatang; dalam ayat ini maksudnya yang mendatangi masuk kubur) pasti dia akan kembali ke negerinya, dan kuburan bukanlah negeri tempat menetap. Begitu juga disebutkan dari sebagian orang-orang arab badui bahwa ketika ia mendenga seorang membaca: أَلْهَاكُمُ التَّكَاثُرُ (1) حَتَّى زُرْتُمُ الْمَقَابِرَ \" Bermegah-megahan telah melalaikan kamu, sampai kamu masuk ke dalam kubur.\", ia mengatakan:وَاللهِ مَا الزَّائِرُ بِمُقِيْمٍ، وَاللهِ لَنُبْعَثَنَّ \"Demi Allah pendatang tidaklah akan menetap, demi Allah kita akan dibangkitkan\" Karena pendatang sebgaimana sudah diketahui ia akan datang dan akan kembali pulang, maka orang arab tadi mengatakan: Demi Allah kita akan dibangkitkan, inilah kebenaran. Dengan begini kita mengetahui bahwa yang didengungkan sebagian orang di koran-koran dan lainnya, mengatakan tentang orang yang telah meninggal: Ia telah berpindak ke tempat akhirnya\" ini adalah ucapan batil dan dusta, karena kuburan bukanlah tempat kembali akhir. Bahkan seorang yang meyakini konsekuensi ucapan ini maka dia telah kafir (mengingkari) kebangkitan. Sedangkan kufur kepada kebangkitan adalah kemurtadan dari islam, tetapi banyak manusia yang mengambil ungkapan-ungkapan namun mereka tidak memahami maknanya, kemingkinan ini diwarisi dari orang-orang atheis yang tidan meyakini kebangkitan setelah kematian, oleh karenanya wajib bagi kita menjauhi ucapan ini. Maka tidaklah dikatakan tentang kubur bahwa itu adalah tempat tinggal terakhir, karena tempat tinggal terakhir itu, bisa surga atau pun neraka di hari kiamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 2: 1-2. Allah mengabarkan bahwa manusia telah disibukkan dari ketaatan kepada Allah dengan berbangga diri dan pamer atas banykanya harta dan anak; Sampai-sampai umurnya berakhir dan mereka binasa (hingga) menuju ke kuburan, dikuburkannya mereka di dalamnya sebelum dirinya (mampu) mendahulukan amalan yang baik (ketika di dunia). Dan ini adalah kondisi kebanyakan manusia. Kami meminta keselamatan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kelalaianmu dan kesibukanmu dengannya (bermegah-megahan) berlanjut terus sampai kamu masuk ke liang kubur. Allah Subhaanahu wa Ta'aala menyebut masuk ke dalam kubur dengan “zurtum” (kamu menziarahi) menunjukkan bahwa alam kubur atau alam barzakh bukan merupakan tempat terakhir, bahkan hanya sekedar diziarahi, kemudian ditinggalkan menuju ke tempat yang kekal (akhirat). Hal ini menunjukkan adanya kebangkitan dan pembalasan terhadap amal di negeri yang kekal yang tidak fana’. Oleh karena itu, Allah Subhaanahu wa Ta'aala menakut-nakuti mereka dengan firman-Nya, “Janganlah begitu! Kelak kamu akan mengetahui (akibat perbuatanmu itu),-- kemudian jangan begitu! Kelak kamu akan mengetahui.-- Janganlah begitu! Sekiranya kamu mengetahui dengan pasti (akibat bermegah-megahan itu),”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 2",
    "description": "Kamu tidak akan berhenti bermegah-megahan seperti itu sampai kamu mati dan masuk ke dalam kubur. 3-4. Tidak patut bagimu untuk lalai karena bermegah-megahan. Sekali-kali tidak! kelak kamu akan mengetahui dan menyadari bahwa akhirat itu lebih baik bagimu. Dan sekali-kali tidak patut bagimu berbuat demikian! kelak kamu akan mengetahui akibat dari kesibukanmu dengan dunia dan kelalaianmu dari ketaatan."
  }
]