[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak sepatutnya kalian disibukkan oleh berlomba-lomba dalam urusan harta. nanti pasti kalian akan sadar bahwa akhirat lebih baik bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Tidak sepantasnya kalian tersibukkan oleh kesombongan dengan harta dan anak hingga melalaikan ketaatan kepada Allah, sungguh kalian akan mengetahui akibat dari kesibukan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Kemudian disebutkan celaan dan olokan atas perbuatan mereka ini: Kalian akan mengetahui perkara kalian ini jika kalian telah kembali ke akhirat bahwa hal itu tidak bermanfaat bagi kalian. Dan pengulangan kalimat ini sebagai penegasan atas celaan dan olokan, yakni ancaman yang ditegaskan dengan ancaman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. كَلَّا سَوۡفَ تَعۡلَمُوۡنَۙ (Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu)) Allah melarang mereka dari sibuk memperbanyak harta dan keturunan, dan ini merupakan peringatan bagi mereka bahwa mereka akan mengetahui akibat dari perbuatan mereka itu pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Sehingga kalian meninggal dan dikubur dalam kuburan. Maksudnya adalah Aku menyibukkanmu di tempat peristirahatan dunia. {Kalla} : untuk mencegah(mu) melakukan sesuatu sebelumnya seperti memperbanyak harta. Hal itu bukanlah hal yang kamu inginkan, kalian akan mengetahui buruknya hukuman atas kebanggaan kalian (atas harta) setelah meninggal dan pada hari kiamat. Sesungguhnya itu bukanlah kebahagiaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah begitu, kelak kalian akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-6. Karena itu Allah mengancam mereka, “Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui. Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin.” Yakni, andai saja kalian mengetahui apa yang akan terjadi di kemudian hari padamu dengan pengetahuan yang sampai di hati, niscaya bermegah-megahan tidak membuat kalian lalai dan niscaya kalian bersegera menunaikan amal-amal baik. Hanya saja karena kalian tidak mengetahui dengan sebenarnya itulah yang membuat kalian seperti yang kalian lihat. “Niscaya kamu benar-benar akan melihat Neraka Jahanam,” yakni, kalian akan benar-benar mendatangi Hari Kiamat dan akan melihat Neraka Jahim yang disediakan Allah untuk orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh kalian benar-banar akan mengetahui apa yang akan terjadi didepan kalian, saat ini kalian belum melihan tanda-tanda kejadian itu, akan tetapi pasti kalian akan mengetahuinya pada waktunya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "3-4. Kemudian Allah Ta'ala berfirman: كَلَّا سَوْفَ تَعْلَمُونَ (3) ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ \" Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui.\" Bermakna teguran, yakni: Janganlah bermegah-megahan. Dikatakan juga ini bermakna :Benar-benar (kalian akan tahu). Dan makna سَوْفَ تَعْلَمُونَ adalah: Kalian akan mengetahui akibat dari perbuatan kalian ketika kalian telah kembali ke akhirat, bahwa bermegah-megahan ini tidak akan bermanfaat bagi kalian. Telah datang dalam hadits dari Nabi shallallaahu 'alaihi wa sallam yang diriwayatkan oleh Muslim: يَقُوْلُ ابْنُ آدَمَ: مَالِي وَمَالِي يعنِي يَفتَخِرُ بِهِ- وَلَيْسَ لَكَ مِنْ مَالِكَ إِلَّا مَا أَكَلْتَ فَأَفْنَيْتَ، أَوْ لَبِسْتَ فَأَبْلَيْتَ، أَوْ تَصَدَّقْتَ فَأَمْضَيْتَ \" Anak Adam mengatakan: Ini hartaku dan ini hartaku (ia berbangga-bangga dengannya), tidak ada dari hartamu yang menjadi milikmu melainkan yang kamu makan lalu sirna, atau (pakaian) yang kamu kenakan lalu menjadi lusuh (rusak), ataua yang kamu sedekahkan dan akan berlalu(dan tersisa di hari kiamat)\"(1) sedangkan yang tersisa akan kamu tinggalkan untuk selainmu, dan ini adalah kebenaran. Harta-harta yang berada di tangan kita, bisa jadi kita makan lalu akan sirna, bisa pula pakaian yang kita kenakan lalu akan rusak, dan bisa juga sesuatu yang kita sedekahkan kita akan melaluinya dan akan ada di hadapan kita pada hari kiamat, atau bisa juga kita tinggalkan untuk selain kita. Tidak mungkin harta yang ada di tangan kita terlepas dari empat bagian tersebut. كَلَّا سَوْفَ تَعْلَمُونَ \" Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), \" Maknanya: Kelak kalian akan mengetahui akibat dari bermegah-megahan itu yang telah melalaikan kalian dari akhirat. ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ \" dan janganlah begitu, kelak kamu akan mengetahui.\" Penggalan ayat ini adalah penegasan teeguran kedua kalinya. (1) Dikeluarkan Muslim (2958) dari hadits Abdullah Bin Syikhir radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 3: 3-4. Allah menegur mereka yang disibukkan dengan dunia, berbangga diri dengan banyaknya anak dan harta, (berpaling) dari ketaatan kepada Allah; Kemudian Allah kabarkan kepada mereka (jika masih tetap dengan kondisi seperti ini), maka mereka akan mengetahui hukuman yang buruk atas perbuatannya. Kemudian Allah ulangi teguran dan ancaman, menegaskan hari kebangkitan dan penyesalan yang mereka akan menuju kesana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 3",
    "description": "3-4. Tidak patut bagimu untuk lalai karena bermegah-megahan. Sekali-kali tidak! kelak kamu akan mengetahui dan menyadari bahwa akhirat itu lebih baik bagimu. Dan sekali-kali tidak patut bagimu berbuat demikian! kelak kamu akan mengetahui akibat dari kesibukanmu dengan dunia dan kelalaianmu dari ketaatan"
  }
]