[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian waspadalah kalian, karena kalian akan mengetahui buruknya akibat dari kesibukannya kalian yang melalaikan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kemudian sungguh kalian akan mengetahui akibatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Maka janganlah begitu! Kalian akan mengetahuinya. Allah mengulang-ulang hal itu untuk menegaskan dan memperingatkan (manusia) agar tidak menimbun harta dan meninggalkan ketaatan kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu janganlah begitu, kelak kalian akan mengetahui."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-6. Karena itu Allah mengancam mereka, “Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui. Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin.” Yakni, andai saja kalian mengetahui apa yang akan terjadi di kemudian hari padamu dengan pengetahuan yang sampai di hati, niscaya bermegah-megahan tidak membuat kalian lalai dan niscaya kalian bersegera menunaikan amal-amal baik. Hanya saja karena kalian tidak mengetahui dengan sebenarnya itulah yang membuat kalian seperti yang kalian lihat. “Niscaya kamu benar-benar akan melihat Neraka Jahanam,” yakni, kalian akan benar-benar mendatangi Hari Kiamat dan akan melihat Neraka Jahim yang disediakan Allah untuk orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh kelak kalian akan mengetahuinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "3-4. Kemudian Allah Ta'ala berfirman: كَلَّا سَوْفَ تَعْلَمُونَ (3) ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ \" Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui.\" Bermakna teguran, yakni: Janganlah bermegah-megahan. Dikatakan juga ini bermakna :Benar-benar (kalian akan tahu). Dan makna سَوْفَ تَعْلَمُونَ adalah: Kalian akan mengetahui akibat dari perbuatan kalian ketika kalian telah kembali ke akhirat, bahwa bermegah-megahan ini tidak akan bermanfaat bagi kalian. Telah datang dalam hadits dari Nabi shallallaahu 'alaihi wa sallam yang diriwayatkan oleh Muslim: يَقُوْلُ ابْنُ آدَمَ: مَالِي وَمَالِي يعنِي يَفتَخِرُ بِهِ- وَلَيْسَ لَكَ مِنْ مَالِكَ إِلَّا مَا أَكَلْتَ فَأَفْنَيْتَ، أَوْ لَبِسْتَ فَأَبْلَيْتَ، أَوْ تَصَدَّقْتَ فَأَمْضَيْتَ \" Anak Adam mengatakan: Ini hartaku dan ini hartaku (ia berbangga-bangga dengannya), tidak ada dari hartamu yang menjadi milikmu melainkan yang kamu makan lalu sirna, atau (pakaian) yang kamu kenakan lalu menjadi lusuh (rusak), ataua yang kamu sedekahkan dan akan berlalu(dan tersisa di hari kiamat)\"(1) sedangkan yang tersisa akan kamu tinggalkan untuk selainmu, dan ini adalah kebenaran. Harta-harta yang berada di tangan kita, bisa jadi kita makan lalu akan sirna, bisa pula pakaian yang kita kenakan lalu akan rusak, dan bisa juga sesuatu yang kita sedekahkan kita akan melaluinya dan akan ada di hadapan kita pada hari kiamat, atau bisa juga kita tinggalkan untuk selain kita. Tidak mungkin harta yang ada di tangan kita terlepas dari empat bagian tersebut. كَلَّا سَوْفَ تَعْلَمُونَ \" Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), \" Maknanya: Kelak kalian akan mengetahui akibat dari bermegah-megahan itu yang telah melalaikan kalian dari akhirat. ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ \" dan janganlah begitu, kelak kamu akan mengetahui.\" Penggalan ayat ini adalah penegasan teeguran kedua kalinya. (1) Dikeluarkan Muslim (2958) dari hadits Abdullah Bin Syikhir radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 4: 3-4. Allah menegur mereka yang disibukkan dengan dunia, berbangga diri dengan banyaknya anak dan harta, (berpaling) dari ketaatan kepada Allah; Kemudian Allah kabarkan kepada mereka (jika masih tetap dengan kondisi seperti ini), maka mereka akan mengetahui hukuman yang buruk atas perbuatannya. Kemudian Allah ulangi teguran dan ancaman, menegaskan hari kebangkitan dan penyesalan yang mereka akan menuju kesana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 4",
    "description": "3-4. Tidak patut bagimu untuk lalai karena bermegah-megahan. Sekali-kali tidak! kelak kamu akan mengetahui dan menyadari bahwa akhirat itu lebih baik bagimu. Dan sekali-kali tidak patut bagimu berbuat demikian! kelak kamu akan mengetahui akibat dari kesibukanmu dengan dunia dan kelalaianmu dari ketaatan. 5. Sekali-kali tidak pantas bagimu bermegah-megahan! sekiranya kamu mengetahui dengan pasti akibat buruk dari perbuatanmu itu di akhirat nanti, niscaya kamu akan meninggalkannya dan beralih menyibukkan diri dengan hal-hal yang menyelamatkanmu dari siksa neraka."
  }
]