[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Tidak sepatutnya kalian disibukkan oleh berlomba lomba dalam urusan memperbanyak harta, seandainya kalian mengetahui dengan sebenarnya,niscaya kalian tidak melakukan hal itu, dan niscaya kalian bersegera menyelamatkan diri kalian dari kebinasaan. Kalian akan melihat neraka jahim, Kemudian kalian pasti melihatnya tanpa keraguan, Kemudian kalian akan ditanya pada hari kiamat tentang berbagai macam kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sungguh, apabila kalian mengetahui dengan yakin bahwa kalian akan dibangkitkan kepada Allah dan bahwasanya Allah akan membalas kalian atas perbuatan kalian, niscaya kalian tidak akan tersibukkan oleh kesombongan dengan harta dan anak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Sungguh jika kalian mengetahui dengan sebenar-benarnya niscaya kalian akan mengetahui bahwa kalian berada dalam kesesatan; namun karena kalian dilalaikan perbuatan memperbanyak kesenangan dunia dari ketaatan kepada Allah, maka kalian menjadi tidak menyadarinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. كَلَّا سَوۡفَ تَعۡلَمُوۡنَۙ (Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu)) Allah melarang mereka dari sibuk memperbanyak harta dan keturunan, dan ini merupakan peringatan bagi mereka bahwa mereka akan mengetahui akibat dari perbuatan mereka itu pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. {Kalla}, pencegahan lainnya. Jika kalian mengetahui dengan sebenar-benarnya tentang hukuman dari kebanggaan atas apa yang kalian sibukkan (sebelumnya). Jawab dari {Law} itu dikira-kirakan. Sungguh kalian akan meninggalkan kebanggan itu dan kalian akan mengerjakan hal yang benar-benar dapat mewujudkan kebahagiaan abadi. Demi Allah kalian akan melihat neraka yang tampak nyata dan tidak jauh menggunakan pengelihatan kalian setelah mati. Itu adalah neraka yang menyala-nyala."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah begitu, jika kalian mengetahui dengan pengetahuan yang yakin} dengan pengetahuan yang sebenarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-6. Karena itu Allah mengancam mereka, “Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui. Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin.” Yakni, andai saja kalian mengetahui apa yang akan terjadi di kemudian hari padamu dengan pengetahuan yang sampai di hati, niscaya bermegah-megahan tidak membuat kalian lalai dan niscaya kalian bersegera menunaikan amal-amal baik. Hanya saja karena kalian tidak mengetahui dengan sebenarnya itulah yang membuat kalian seperti yang kalian lihat. “Niscaya kamu benar-benar akan melihat Neraka Jahanam,” yakni, kalian akan benar-benar mendatangi Hari Kiamat dan akan melihat Neraka Jahim yang disediakan Allah untuk orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sungguh jika kalian benar-benar mengetahuinya dengan penuh keyakinan, yang tidak ada keraguan sedikitpun didalamnya, maka apa yang akan terjadi dengan nasibmu saat ini ? sungguh nasibmu akan beda dengan yang sekarang ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin,\" Yakni: Benar-benar kalau kalian mengetahuinya dengan yakin, sungguh kalian akan mengetahui bahwa kalian di dalam kesesatan, akan tetapi kalian tidak mengetahuinya dengan benar-benar yakin, karena kalian lalai dan mengabaikan di dunia ini, seandainya kalian benar-benar mengetahuinya dengan yakin, maka sungguh kalian akan menyadari bahwa kalian dalam kesesatan dan kesalahan besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 5: Ketahuilah oleh kalian wahai manusia, jika kalian benar-benar mengetahui apa yang kalian ketahui tentang akhirat, sungguh kalian akan tersibukkan darinya, (ketimbang) sibuk untuk berbangga diri dan menggebu-gebu dalam mencari harta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kalau sekiranya kamu mengetahui hal yang akan terjadi di hadapan kamu dengan pengetahuan yang masuk sampai ke hati, tentu kamu tidak dibuat lalai oleh bermegah-megahan dan tentu kamu akan bersegera mengerjakan amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 5",
    "description": "Sekali-kali tidak pantas bagimu bermegah-megahan! sekiranya kamu mengetahui dengan pasti akibat buruk dari perbuatanmu itu di akhirat nanti, niscaya kamu akan meninggalkannya dan beralih menyibukkan diri dengan hal-hal yang menyelamatkanmu dari siksa neraka. 6. Aku bersumpah, niscaya kamu benar-benar akan melihat neraka jahim dan merasakan panasnya."
  }
]