[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Tidak sepatutnya kalian disibukkan oleh berlomba lomba dalam urusan memperbanyak harta, seandainya kalian mengetahui dengan sebenarnya,niscaya kalian tidak melakukan hal itu, dan niscaya kalian bersegera menyelamatkan diri kalian dari kebinasaan. Kalian akan melihat neraka jahim, Kemudian kalian pasti melihatnya tanpa keraguan, Kemudian kalian akan ditanya pada hari kiamat tentang berbagai macam kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Demi Allah, sungguh kalian akan menyaksikan Neraka pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Sungguh kalian akan menyaksikan neraka jahim secara langsung. Imam al-Alusi berkata: Ini merupakan isi dari sumpah yang tidak disebutkan secara langsung untuk menegaskan ancaman dan menjelaskan peringatannya. (Tafsir al-Alusi: 30/225)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. لَتَرَوُنَّ الۡجَحِيۡمَۙ‏ (niscaya kamu benar-benar akan melihat neraka Jahiim) Di akhirat kelak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. {Kalla}, pencegahan lainnya. Jika kalian mengetahui dengan sebenar-benarnya tentang hukuman dari kebanggaan atas apa yang kalian sibukkan (sebelumnya). Jawab dari {Law} itu dikira-kirakan. Sungguh kalian akan meninggalkan kebanggan itu dan kalian akan mengerjakan hal yang benar-benar dapat mewujudkan kebahagiaan abadi. Demi Allah kalian akan melihat neraka yang tampak nyata dan tidak jauh menggunakan pengelihatan kalian setelah mati. Itu adalah neraka yang menyala-nyala."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar akan melihat neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-6. Karena itu Allah mengancam mereka, “Janganlah begitu, kelak kamu akan mengetahui (akibat perbuatanmu itu), dan janganlah begitu, kelak kamu akan mengetahui. Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin.” Yakni, andai saja kalian mengetahui apa yang akan terjadi di kemudian hari padamu dengan pengetahuan yang sampai di hati, niscaya bermegah-megahan tidak membuat kalian lalai dan niscaya kalian bersegera menunaikan amal-amal baik. Hanya saja karena kalian tidak mengetahui dengan sebenarnya itulah yang membuat kalian seperti yang kalian lihat. “Niscaya kamu benar-benar akan melihat Neraka Jahanam,” yakni, kalian akan benar-benar mendatangi Hari Kiamat dan akan melihat Neraka Jahim yang disediakan Allah untuk orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya kalian benar-benar akan melihat neraka pada hari kiamat dengan mata telanjang, dalam ayat lain Allah - عز وجل - berfirman : { وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ } ( Dan pada hari itu diperlihatkan neraka Jahannam ) [ Al-Fajr : 23 ] , neraka jahannam akan didatangkan dihadapan manusia pada hari kiamat dan mereka pun melihatnya dengan jelas, setelah mereka mendengarkan tentangnya, dan disampaikan pula kepada mereka tentang sifat-sifat naeraka itu didunia, maka pada hari akhri mereka pun melihatnya dengan mata kepala mereka sendiri, mereka pada hari itu mereka tidak meragukan keberadaan neraka, Allah - عز وجل - berfirman : { وَرَأَى الْمُجْرِمُونَ النَّارَ فَظَنُّوا أَنَّهُمْ مُوَاقِعُوهَا وَلَمْ يَجِدُوا عَنْهَا مَصْرِفًا } ( Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat berpaling dari padanya ) [ Al-Kahfi : 53 ] dan mereka ( orang-orang berdosa ) pun akan dimasukkan ke dalamnya, Allah - تعالى - berfirman : { وَلَوْ تَرَىٰ إِذْ وُقِفُوا عَلَى النَّارِ فَقَالُوا يَا لَيْتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِآيَاتِ رَبِّنَا وَنَكُونَ مِنَ الْمُؤْمِنِينَ } ( Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka, lalu mereka berkata: “Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman”, (tentulah kamu melihat suatu peristiwa yang mengharukan) ) [ Al-An'am : 27 ] , orang-orang kafir mengharapkan diri mereka dikembalikan lagi kedunia untuk mengimani ayat-ayat Allah, akan tetapi keinginan mereka itu mustahil untuk mereka dapatkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta'ala berfirman: لَتَرَوُنَّ الْجَحِيمَ (6) ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ \" niscaya kamu benar-benar akan melihat neraka Jahiim, dan sesungguhnya kamu benar-benar akan melihatnya dengan 'ainulyaqin,\" لَتَرَوُنَّ الْجَحِيمَ \" niscaya kamu benar-benar akan melihat neraka Jahiim,\" Penggalan ayat ini adalah kalimat tersendiri, bukan sebagai jawaban kata لَو (kalau). Oleh karenanya seorang qari wajib berhenti pada ayat كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin,\" Kita mendengar banyak dari para imam-imam yang shalat dan membaca dengan menyambungkan dua ayat كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ (5) لَتَرَوُنَّ الْجَحِيمَ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin, niscaya kamu benar-benar akan melihat neraka Jahiim,\" dan menyambung dua ayat tersebut bisa jadi kelalaian dan keluapaan mereka, atau bisa jadi karena mereka tidak benar benar perhatian pada makna ayatnya, andai saja mereka benar-benar memperhatikan dua ayat tersebut, pasti mereka akan mendapatkan menyambung kedua ayat tadi akan merusak makna, karena jika ia membaca: كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ (5) لَتَرَوُنَّ الْجَحِيمَ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin, niscaya kamu benar-benar akan melihat neraka Jahiim,\" Maka berarti maknanya adalah bahwa penglihatan mereka kepada neraka jahim bersyarat dengan syarat pengetahuan mereka (terhadap neraka itu) dan ini tidaklah benar, oleh karenanya wajib perhatian dan memberi peringatan pada kekeliruan ini siapa pun yang mendengar yang membaca dua ayat ini disambung : كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ (5) لَتَرَوُنَّ الْجَحِيمَ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin, niscaya kamu benar-benar akan melihat neraka Jahiim,\" Diingatkan dan katakan kepadanya: Wahai saudaraku penyambungan bacaan antara dua ayat tersebut akan menimbulkan rusaknya makna, maka janganlah disambung, tapi berhentilah dahulu. Sebab yang pertama adalah kerena ayat tersebut adalah awalan ayat, dan yang disyari'atkan adalah seorang pembaca berhenti di setiap awalan setiap ayat. Sebab kedua: Karena menyambung dua ayat tersebut merusak makna كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ (5) لَتَرَوُنَّ الْجَحِيمَ \" Janganlah begitu, jika kamu mengetahui dengan pengetahuan yang yakin, niscaya kamu benar-benar akan melihat neraka Jahiim,\" Dengan demikian maka لَتَرَوُنَّ الْجَحِيمَ \" niscaya kamu benar-benar akan melihat neraka Jahiim,\" Adalah kalimat tersendiri yang tidak berhubungan dengan kalimat sebelumnya, ini adalah kalimat yang disertai sumpah. Di dalamnya terdapat sumpah yang tersembunyi yaitu: Demi Allah, kalian benar-benar akan melihat neraka jahim. Oleh karenanya orang-orang yang mengi'rab mengi'rabnya: Bahwa huruf lam adalah penunjuk sumpah (yang tersembunyi) dan kalimat: تَرَونَ [kalian melihat] adalah jawaban sumpah, dan sumpah di sini tersembunyi, yaitu: Demi Allah, kalian benar-benar akan melihat jahim. Jahim adalah salah satu nama-nama neraka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 6: Allah bersumpah dan menegaskan bahwa manusia akan melihat adzab di akhirat (dengan mata) dan dengan hati-hati mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kamu akan sampai pada hari Kiamat lalu kamu akan melihat neraka yang telah Allah siapkan untuk orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 6",
    "description": "Aku bersumpah, niscaya kamu benar-benar akan melihat neraka jahim dan merasakan panasnya. 7. Untuk menambah ketakutan manusia terhadap neraka jahim, Allah mengulangi sumpahnya. Kemudian aku bersumpah, kamu benar-benar akan melihatnya dengan mata kepala sendiri. Ketika itu kamu sadar betapa buruk akibat kelalaianmu dari iman dan taat kepada Allah."
  }
]