[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Tidak sepatutnya kalian disibukkan oleh berlomba lomba dalam urusan memperbanyak harta, seandainya kalian mengetahui dengan sebenarnya,niscaya kalian tidak melakukan hal itu, dan niscaya kalian bersegera menyelamatkan diri kalian dari kebinasaan. Kalian akan melihat neraka jahim, Kemudian kalian pasti melihatnya tanpa keraguan, Kemudian kalian akan ditanya pada hari kiamat tentang berbagai macam kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Kemudian kalian akan menyaksikannya dengan penuh keyakinan, tidak ada keraguan padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. ثُمَّ لَتَرَوُنَّهَا عَيۡنَ الۡيَقِيۡنِۙ‏ (dan sesungguhnya kamu benar-benar akan melihatnya dengan ‘ainul yaqin) Yakni kemudian kalian akan melihat neraka dengan penglihatan yang meyakinkan, yaitu melihatnya dengan mata kepala kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Setelah itu kalian akan melihat menggunakan mata kalian dengan penglihatan yang sangat yakin bahwa kalian akan memasukinya. Ayat ini sebagai penegas ayat sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan sungguh kalian benar-benar akan melihatnya dengan penglihatan yang sebenarnya} sungguh kalian akan menyaksikannya dengan sebenar-benarnya tanpa ada keraguan tentangnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Dan sesungguhnya kamu benar-benar akan melihatnya dengan ‘ainul yaqin,” yakni dengan penglihatan mata. Allah berfirman : Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat berpaling dari padanya. (QS. al-kahfi.53)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian kalian akan melihatnya dengan penuh keyakinan, didunia kalian mendengarkan dan mengetahui tentang neraka itu, dan pada hari hari kiamat neraka itu akan kalian saksikan dengan mata kalian sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ \" dan sesungguhnya kamu benar-benar akan melihatnya dengan 'ainulyaqin,\" Penegasan bahwa akan benar-benar melihat jahim, kapan akn terlihat? Ia akan terlihat pada hari kiamat, akan didatangkan neraka jahim, akan digiring dengan tujuh puluh ribu rantai, setiap rantai akan ditarik oleh tujuh puluh ribu malaikat. Maka bagaimana menurt dugaan anda tentang neraka ini, wal'iyaadzu billaah, Ini adalah neraka yang besar, kerena ia digiring dengan tujuh puluh ribu tali, setiap tali ditarik oleh tujuh puluh ribu malaikat, mereka sangat besar dan kasar, itulah neraka yang besar, semoga Allah melindungi kita darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 7: Kemudian Allah tegaskan bahwa mereka akan melihat adzab dengan mata kepala hakiki tanpa ragu akan adzab tersebut dan tanpa bimbang. Uutan yakin ada tiga, disebutkan dalam surat ini hanya dua : Yang pertama yakin karena sebab ilmu, disebutkan dalam ayat yang kelima, yang kedua adalah keyakinan dengan melihat melalui mata kepala langsung, disebutkan dalam ayat yang ketujuh, dan yang terakhir adalah sebenar-benarnya keyakinan, disebutkan Allah dalam surat Al Waqi’ah : 95, Allah berfirman : إِنَّ هَـٰذَا لَهُوَ حَقُّ ٱلْيَقِينِ, yang artinya : Sesungguhnya (yang disebutkan ini) adalah suatu keyakinan yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini sebagaimana firman Allah Ta’ala, “Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat berpaling dari padanya.” (Terj. Al Kahfi: 53)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 7",
    "description": "Untuk menambah ketakutan manusia terhadap neraka jahim, Allah mengulangi sumpahnya. Kemudian aku bersumpah, kamu benar-benar akan melihatnya dengan mata kepala sendiri. Ketika itu kamu sadar betapa buruk akibat kelalaianmu dari iman dan taat kepada Allah. 8. Kemudian, pada saat kamu menyaksikan neraka jahim dengan mata kepalamu, kamu benar-benar akan ditanya pada hari itu tentang kenikmatan yang kamu jadikan bahan bermegah-megahan di dunia itu, seperti harta, keturunan, pengikut, dan sebagainya. Semua itu pada haki-katnya adalah cobaan. Jika diperoleh secara halal dan digunakan dengan benar, semua itu akan menguntungkan pemiliknya, baik di dunia maupun akhirat. Bila tidak, semua itu akan menjadikan hidup pemilik-Nya tidak berkah dan menjerumuskannya ke dalam siksaan Allah di akhirat nanti."
  }
]