[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Tidak sepatutnya kalian disibukkan oleh berlomba lomba dalam urusan memperbanyak harta, seandainya kalian mengetahui dengan sebenarnya,niscaya kalian tidak melakukan hal itu, dan niscaya kalian bersegera menyelamatkan diri kalian dari kebinasaan. Kalian akan melihat neraka jahim, Kemudian kalian pasti melihatnya tanpa keraguan, Kemudian kalian akan ditanya pada hari kiamat tentang berbagai macam kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Kemudian sungguh Allah akan bertanya kepada kalian pada Hari itu tentang nikmat sehat, kekayaan dan lainnya yang telah diberikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Sungguh pada saat yang agung itu, kalian akan ditanya tentang kenikmatan yang telah kalian dapatkan. Ini mencakup orang beriman dan orang kafir. Orang kafir akan ditanya sebagai bentuk celaan dan olokan, karena mereka tidak menjalankan kewajiban mensyukuri kenikmatan, bahkan mereka malah menyekutukan Allah. Mereka layak ditanya tentang kenikmatan itu sebagai bentuk olokan kerana mereka menyia-nyiakan kenikmatan tersebut. Sedangkan orang beriman akan ditanya tentang itu untuk menampakkan kenikmatan Allah yang telah diterimanya, jika dia telah mensyukurinya maka dia tidak akan mendapat celaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. ثُمَّ لَتَرَوُنَّهَا عَيۡنَ الۡيَقِيۡنِۙ‏ (dan sesungguhnya kamu benar-benar akan melihatnya dengan ‘ainul yaqin) Yakni kemudian kalian akan melihat neraka dengan penglihatan yang meyakinkan, yaitu melihatnya dengan mata kepala kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Wahai kalian yang bergelimang kenikmatan. berhati-hatilah ! { ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ } Pertanyaan ini umum untuk kafir dan orang beriman, tetapi pertanyaan ini sebagai kabar gembira bagi orang-orang beriman yakni dilimpahkannya kepada mereka kenikmatan dunia dan kenikmatan akhirat, sedangkan bagi orang-orang kafir pertanyaan ini sebagai teguran bagi mereka yang membalas kenikamatan dunia dengan kekafiran dan kemaksiatan. 2 ). Tatkala orang-orang kafir menyibukkan diri untuk memperbanyak harta dan segala bentuk kenikmatan dan kemegahan dunia, dan meninggalkan keataan dan kesyukuran mereka kepada Allah, mereka akan ditanya dan dimintai pertangguung jawaban atas semua kenikmatan itu pada hari kiamat nanti, agar jelas bagi mereka yang selama ini menjadi sangkaan sebagai sebab untuk meraih kebahagiaan padahal semua itu adalah sebab terbesar yang akan merubah hidup mereka menjadi kesengsaraan tiada henti. 3 ). { ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ } Ibnu taimiyah berkata : mensyukuri nikmat Allah setiap hamba wajib melakukannya; dan Allah ta'ala tidaklah Ia membalas apa yang Ia perbolehkan untuk hamba-Nya dengan azab, tetapi azab itu hanya akan ditimpakan kepada mereka yang meninggalkan dan mengamalkan larangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kemudian kalian akan ditanyai pada hari perhitungan amal tentang kenikmatan dunia yang lebih kalian sibukkan daripada beramal untuk akhirat (kalian). {Tsumma} digunakan untuk mengurutkan berita. Karena di tempat hisab, pertanyaan itu diberikan sebelum melihat neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian kalian pasti akan ditanyai pada hari itu tentang kenikmatan} setiap jenis kenikmatan berupa keamanan, kesehatan, rezeki dan lain-lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Kemudian kamu pasti akan ditanyai pada hari itu tentang kenikmatan itu,” yakni yang kalian megah-megahkan di dunia, apakah kalian mensyukurinya dan kalian tunaikan hak-hak Allah di dalamnya dan tidak kalian jadikan penopang untuk kemaksiatan sehingga Allah memberi kalian nikmat yang lebih tinggi dan lebih baik darinya? Ataukah kalian terpedaya olehnya, tidak kalian syukuri bahkan bisa jadi kalian jadikan sebagai penopang untuk berbagai kemaksiatan sehingga Allah menyiksa kalian karena hal itu?. Allah berfirman : Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan): “Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniawimu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik”. (QS. al-ahqaf.20)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian kalian akan ditanya pada hari kiamat tentang nikmat yang Allah ﷻ karuniakan kepada kalian ketika didunia, kesyukuran kalian terhadap nikmat Allah ﷻ akan dipertanggung jawabkan pada hari itu, Allah ﷻ melimpahkan nikmat sehat kepada kalian, dan melimpahkan rezki yang banyak, nikmat keamanan dan ketenangan, dan sesungguhnya jika seandainya nikmat itu kalian hitung tidak akan selesai perkaranya, Allah ﷻ berfirman : { وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ } ( Dan jika kamu menghitung-hitung nikmat Allah, niscaya kamu tak dapat menentukan jumlahnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang ) [ An-Nahl : 18 ] , semua nikmat yang kalian dapatkan didunia tidak akan dilupakan, karena semua nikmat itu akan di tanya pada hari kiamat. { ثُمَّ لَتُسْأَلُنَّ } Pada ayat ini terdapat huruf qosam ( huruf yang dipakai untuk sumpah ) , dan huruf nun pada akhir kata ( لَتُسْأَلُنَّ ) yang digunakan dalam bahasa arab untuk menekankan makna suatu perkara, yang maksud kedua huruf ini adalah bahwasanya perkara ini benar-benar akan terjadi, nikmat yang Allah karuniakan kepada hambanya benar-benar akan di tanya. { يَوْمَئِذٍ } Pada hari kiamat. { عَنِ النَّعِيمِ } Semua kenikmatan yang Allah - عز وجل - limpahkan kepada setiap hamba-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ \" kemudian kamu pasti akan ditanyai pada hari itu tentang kenikmatan (yang kamu megah-megahkan di dunia itu).\" Yakni: Kemudian pada waktu tersebut, pada pemberhentian besar tersebut, kalian akan ditanya tentang kenikmatan. Para ulama rahimahumullah berbeda pendapat dalam penafsiran: ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ \" kemudian kamu pasti akan ditanyai pada hari itu tentang kenikmatan (yang kamu megah-megahkan di dunia itu).\" Apakah maksudnya adalah orang kafir saja ataukah orang kafir dan mukmin? Yang benar adalah:Yang dimaksud di sini adalah orang kafir dan mukmin, semuanya akan ditanya tentang kenikmatan. Tatapi orang kafir ditanya dengan pertanyaan celaan dan tindasan, sedangkan orang yang beriman ditanya dengan pertanyaan pengingat. Dalil yang menunjukkan keumuman makna ayat: Adalah yang terjadi dalam kisah Nabi shallallaahu 'alaihi wa sallam, Abu Bakar dan Umar. Dari Abu Hurairah radhiyallaahu anhum, ia bercerita: Rasulullah shallallaahu 'alaihi wa sallam pada suata hari atau malam, ternyata beliau bertemu dengan Abu Bakar dan Umar, beliau bertanya: مَا أَخْرَجَكُمَا مِنْ بُيُوتِكُمَا هَذِهِ السَّاعَةَ؟ \"Apa yang menyebabkan kalian berdua keluar dari rumah kalian?\" Mereka menjawab: Rasa lapar, wahai Rasulullah! Beliau menimpal: وَأَنَا، وَالَّذِي نَفْسِي بِيَدِهِ! لَأَخْرَجَنِي الَّذِي أَخْرَجَكُمَا، قُوْمُوا \" Dan saya pun , demi (Allah) yang jiwaku berada di tangan-Nya! Sungguh Aku pun telah dikeluarkan oleh sebab yang menyebabkan kalian keluar, berdirilah\" Maka mereka berdiri bersama beliau, kemudian beliau menjumpai seorang lelaki dari kalangan anshar, ternyata dia tidak sedang berada di rumahnya, maka ketika terlihat oleh seorang perempuan, perempuan itu berkata: Selamat datang, silahkan! Maka Rasulullah shallallaahu 'alaihi wa sallam berkata padanya: أَيْنَ فُلَان؟ \"Di mana fulan?\" Perempuan itu menjawab: Ia pergi, mencari air bersih untuk kami, seketika itu seorang anshar tersebut datang, lalu melihat Rasulullah shallallaahu 'alaihi wa sallam dan kedua sahabatnya, kemudian berkata: Alhamdulullah, tidak ada seorang pun di hari ini yang mendapat kemuliaan tamu-tamu lebih dariku. Abu Hurairah berkata: Orang itu lalu pergi, kemudian ia datang kembali dengan membawa ranting kurma, yang terdiri dari kurma muda, sedang dan basah, lalu ia berkata: makanlah itu, lalu ia mengambil pisau. Lalu Rasulullah shallallaahu 'alaihi wa sallam bersabda: إِيَّاكَ وَالْحَلُوبَ \"Janganlah menyembelih kambing betina yang produktif (melahirkan)\". Maka ia menyembelih untuk mereka, mereka makan seekor kambing dan dari ranting buah kurma itu, lalu mereka minum. Ketika mereka kenyang dan hilang dahaganya, Rasulullah shallallaahu 'alaihi wa sallam bersabda kepada Abu Bakar dan Umar: وَالَّذِي نَفْسِي بِيَدِهِ لَتُسْأَلُنَّ عَنْ هَذَا النَّعِيْمِ يَوْمَ الْقِيَامَةِ، أَخْرَجَكُمْ مِنْ بُيُوْتِكُمْ الْجُوْعُ، ثُمَّ لَمْ تَرْجِعُوْا حَتَّى أَصَابَكُمْ هَذَا النَّعِيْمُ \"Demi (Allah) yang jiwaku berada di tangan-Nya, sungguh kalian akan ditanya tentang kenikmatan ini pada hari kiamat kelak. Rasa lapar telah mengeluarkan kalian dari rumah, kemudian kalian tidak pulang sampai kalian mendapatkan kenikmatan ini\" (1) Dan dalam redaksi riwayat lain: هَذَا وَالَّذِي نَفْسِي بِيَدِهِ مِنَ النَّعِيْمِ الَّذِي تُسْأَلُوْنَ عَنْهُ يَوْمَ الْقِيَامَةِ، ظِلٍّ بَارِدٍ وَرُطَبٍ طَيِّبٍ وَمَاءٍ بَارِدٍ \"Ini, demi (Allah) yang jiwaku berada di tangannya, adalah di antara kenikmatan yang kalian akan ditanyakan tentangnya di hari kiamat, naungan yang sejuk, kurma yang bagus dan air yang dingin\"(2) Ini adalah dalil bahwa yang akan ditanya adalah orang mukmin dan orang kafir, tapi pertanyaannya bertujuan berbeda, pertanyaan bagi orang mukmin adalah pertanyaan pengingat kenikmatan dari Allah 'Azza Wa Jalla padanya sehingga dengannya ia akan senang, dan ia mengetahui bahwa yang telah memberinya kenikmatan di dunia juga memberinya kenikmatan di akhirat. Berarti Allah telah memberikan kedermaan-Nya dengan kenikmatan dunia Allah pun juga memberikan kenikmatan-Nya di akhirat, sedangkan pertanyaan bagi orang kafir maka pertanyaan berupa celaan dan penyesalan. Kita meminta kepada Allah Ta'ala agar memudahkan kita dalam mengamalkan ketaatan kepada-Nya dan menjadikan apa-apa yang Dia karuniakan kepada kita (berupa rejeki) sebagai pembantu kita dalam ketaatan kepada-Nya, sesungguhnya Dialah yang Maha Kusa atas segala sesuatu. (1) Dikeluarkan Muslim (2038) (2) Dikeluarkan Tirimdziy (2369) dari hadits Abu Hurairah radhiyallaah 'anhu, dan dinyatakan shahih oleh al-Albaniy dalam shahih al-Jaami' (7001)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat At-Takatsur ayat 8: Sesungguhnya kalian wahai manusia, akan meminta di akhirat macam-macam kenikmatan, yang Allah berikan kenikmatan itu untuk kalian di dunia, dimana kalian berupaya berpaling (dari kemewahan dunia) dan bersungguh-sungguh dalam kehidupan kalian untuk menggapai selain (dunia) dan (bersungguh-sungguh meuju kepada) yang berkaitan dengan hari pembalasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti nikmat sehat, nikmat waktu luang, nikmat keamanan, nikmat makan, nikmat minum dan lain-lain. Kamu akan ditanya, apakah kamu sudah bersyukur terhadapnya dan memenuhi hak Allah di sana ataukah kamu malah menggunakan kenikmatan itu untuk bermaksiat kepada-Nya dan tertipu dengannya sehingga kamu tidak melakukan sikap syukur? Sehingga kamu diberi hukuman terhadapnya. Allah Subhaanahu wa Ta'aala berfirman, “Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan), \"Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniamu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik.” (Terj. Al Ahqaaf: 20)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat At-Takatsur Ayat 8",
    "description": "Kemudian, pada saat kamu menyaksikan neraka jahim dengan mata kepalamu, kamu benar-benar akan ditanya pada hari itu tentang kenikmatan yang kamu jadikan bahan bermegah-megahan di dunia itu, seperti harta, keturunan, pengikut, dan sebagainya. Semua itu pada haki-katnya adalah cobaan. Jika diperoleh secara halal dan digunakan dengan benar, semua itu akan menguntungkan pemiliknya, baik di dunia maupun akhirat. Bila tidak, semua itu akan menjadikan hidup pemilik-Nya tidak berkah dan menjerumuskannya ke dalam siksaan Allah di akhirat nanti. 1. Demi masa, waktu sore, atau salat asar. Allah bersumpah dengan masa agar manusia memperhatikan masa dan memanfaatkannya dengan baik; bersumpah dengan waktu sore, sebagaimana dengan waktu duha, sebagai salah satu bukti kuasa Allah; dan bersumpah dengan salat asar karena keutamaanya atas salat-salat yang lain."
  }
]