[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Sesungguhnya Kami telah mengutus Nuh kepada kaumnya. Kami berfirman kepadanya, “Peringakanlah kaummu sebelum azab yang pedih datang kepada mereka.” Nuh berkata, “Wahai kaumku, sesungguhnya aku memperingatkan kalian dengan peringatan yang jelas terhadap azab Allah bila kalian mendurhakaiku. Sesungguhnya aku adalah utusan Allah kepada kalian, maka sembahlah Allah semata, takutlah kepada hukumanNYa, taatilah aku dalam apa yang aku perintahkan kepada kalian dan aku larang. Bila kalian menaatiku dan menjawab seruanku, niscaya Allah memaafkan dan mengampuni dosa-dosa kalian, serta memanjangkan umur-umur kalian hingga waktu yang ditentukan dalam ilmu Allah. Sesungguhnya kematian, bila ia datang, sama sekali tidak dapat diakhirkan. Bila kalian mengetahui, niscaya kalian bersegera untuk beriman dan patuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sesungguhnya Kami telah mengutus Nuh kepada kaumnya untuk menyeru mereka, menakuti kaumnya sebelum mereka kedatangan siksa yang menyakitkan disebabkan syirik yang mereka lakukan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah mengabarkan tentang diri-Nya dengan menggunakan dhamir pengagungan dan dengan penegasan untuk menarik perhatian menuju kabar yang akan disampaikan ini; bahwa Allah mengutus Nabi Nuh kepada kaumnya untuk menyeru mereka kepada tauhid, dan memperingatkan mereka dari azab Allah jika tidak beriman, dan itu adalah zab yang pedih dan menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِنَّآ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِۦٓ (Sesungguhnya Kami telah mengutus Nuh kepada kaumnya) Telah dijelaskan sebelumnya bahwa Nuh adalah Rasul pertama yang diutus Allah, dan telah dijelaskan pula lama ia tinggal bersama kaumnya pada surat al-Ankabut. أَنْ أَنذِرْ قَوْمَكَ(“Berilah kaummu peringatan) Yakni Kami firmankan kepadanya: “berilah peringatan kepada kaummu. مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ (sebelum datang kepadanya azab yang pedih”) Yakni azab yang sangat menyakitkan, yaitu azab neraka, atau banjir bandang yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Sesungguhnya kami mengutus Nuh kepada kaumnya. Peringatkanlah kaummu tentang azab saat mereka berpaling dari perintah Allah, yaitu azab yang didatangkan sebelum azab yang sangat pedih (azab neraka) jika mereka tidak beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah mengutus Nuh kepada kaumnya,“Berilah peringatan kepada kaummu sebelum datang azab yang pedih kepada mereka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Dalam surat ini Allah hanya menyebutkan kisah Nabi Nuh saja, karena lamanya Nabi Nuh berada di tengah kaumnya serta berulang-ulangnya Nabi Nuh menyeru mereka untuk bertauhid dan melarang kesyirikan. 1. Allah memberitahukan bahwa Dia mengutus Nabi Nuh pada kaumnya sebagai rahmat bagi mereka serta sebagai ancaman untuk mereka dari siksaan yang pedih karena tidak ingin mereka terus-menerus berada dalam kekufuran, yang akan menyebabkan Allah membinasakan dan menyiksa mereka dengan azab yang abadi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 1: Surat ini dimulai dengan diutusnya Nuh kepada kaumnya, dan ia diperintahkan untuk memberi peringatan kepada kaumnya akan peribadatan mereka kepada berhala-berhala (mereka) dan kesyirikan serta dosa dan maksiat; Sebelum didatangkan adzab yang pedih di dunia dan akhirat. Nuh adalah nabi pertama dari keturunan Adam, ia adalah Syaikhnya para Nabi karena sebab umurnya paling panjang. Nuh adalah orang yang pertama kali ber-azzam untuk berdakwah kepada kaumnya, sebagian ahli tafsir mengatakan : Sesungguhnya Nuh tidak di utus kepada manusia secara umum, akan tetapi diutus kepada kaumnya saja. Berkata ahli tafsir yang lain : Sesungguhnya ia diutus kepada manusia secara umum; Karena tidak didapati di bumi pada waktu itu, selain hanya kaumnya, mereka berdalili dengan رَّبِّ لَا تَذَرْ عَلَى ٱلْأَرْضِ مِنَ ٱلْكَـٰفِرِينَ دَيَّارًا yang artinya : Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi, mereka berkata : Kalau lah di sana ada umat-umat selain umatnya, tidak akan ia (Nuh) doakan bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala tidak menyebutkan dalam surah ini selain kisah Nabi Nuh ‘alaihis salam menerangkan bagaimana dakwah Beliau di tengah-tengah kaumnya dengan waktu yang cukup lama, yaitu selama 950 tahun, dan berulang kalinya Beliau mendakwahi mereka kepada tauhid serta melarang mereka berbuat syirk. Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia telah mengutus Nuh kepada kaumnya karena rahmat-Nya kepada mereka dan memperingatkan mereka sebelum datang azab yang pedih karena khawatir jika mereka tetap terus di atas kekafiran, Allah membinasakan mereka dengan kebinasaan yang kekal dan mengazab mereka selama-lamanya. Maka Nuh ‘alaihis salam melaksanakan perintah itu sebagaimana yang diterangkan dalam ayat selanjutnya. Di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 1",
    "description": "Pada penutup surah sebelumnya diuraikan tentang ancaman siksa yang akan diterima kaum yang durhaka. Di awal surah ini diuraikan kisah nabi nuh dan kaumnya sebagai peringatan bagi siapa saja termasuk kaum musyrik mekah, apabila durhaka maka bagi Allah mudah untuk mengazabnya. Sesungguhnya kami telah mengutus nuh kepada kaumnya dengan perintah, 'berilah kaummu peringatan sebelum datang kepadanya azab yang pedih. '2-3. Nabi nuh melaksanakan perintah Allah tersebut. Dia nuh berkata, 'wahai kaumku! sesungguhnya aku ini seorang pemberi peringatan akan azab Allah yang menjelaskan peringatan itu kepada kamu yaitu sembahlah Allah yang esa dan tidak menyekutukan-Nya dengan sesuatu yang lain, bertakwalah kepada-Nya dengan menjalankan perintah dan menjauhi larangan-Nya dan taatlah kepadaku."
  }
]