[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-16. Bila kalian bertaubat dan beristigfar, niscaya Allah menurunkan kepada kalian hujan deras yang terus-menerus, memperbanyak anak-anak dan harta kalian, membuatkan untuk kalian kebun-kebun yang indah dengan buah-buahan yang kalian nikmati, membuatkan untuk kalian sungai-sungai yang darinya kalian menyiram kebun-kebun kalian dan memberi minum ternak-ternak kalian. Mengapa kalian wahai kaumku, tidak takut kepada keagungan Allah dan kekuasaanNya, sementara Allah telah menciptakan kalian dalam beberapa tahapan: setetes air, kemudian segumpal darah, kemudian seonggok daging, kemudian tulang dan daging? Tidakkah kalian melihat bagaimana Allah menciptakan tujuh langit yang sebagian di atas sebagian lainnya, menciptakan rembulan yang bercahaya di langit, dan menjadikan matahari sebagai lampu bagi penduduk bumi?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan Dia memperbanyak harta dan anak-anak kalian, dan membuatkan taman-taman yang buah-buahannya bisa kalian makan, serta membuatkan untuk kalian sungai-sungai yang airnya kalian minum, mengairi tanaman-tanaman kalian dan memberi minum ternak-ternak kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Allah menjadikan kalian memiliki banyak harta dan anak. Maknanya adalah Allah memperbanyak harta dan anak kalian. Allah menciptakan untuk kalian taman-taman dan sungai-sungai"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Memperbanyak harta dan anak-anak kalian, serta menjadikan kebun-kebun} kebun-kebun {dan sungai-sungai untuk kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10-12. “Maka aku katakan kepada mereka, ‘Mohonlah ampun kepada Rabbmu’.” Yakni, tinggalkan dosa kalian dan mintalah ampunan pada Allah atas dosa-dosa kalian itu, “sesungguhnya Dia adalah Maha Pengampun,” yang banyak ampunanNya bagi orang yang bertaubat dan meminta ampun. Nabi Nuh mendorong kaumnya untuk meminta ampunan atas segala dosa serta melakukan apa-apa yang mendatangkan pahala dan terhindar dari siksa. Nabi Nuh juga mendorong mereka pada kebaikan dunia yang disegerakan seraya berkata “Niscaya Dia akan mengirimkan hujan kepadamu dengan lebat,” yakni, hujan lebat yang menghidupkan negeri dan manusia, “dan membanyakkan harta dan anak-anakmu,” yakni memperbanyak harta yang dengan harta itu kalian bisa mendapatkan apa saja yang kalian inginkan dan juga anak-anak kalian, “dan mengadakan untukmu kebun-kebun dan mengadakan (pula di dalamnya) untukmu sungai-sungai,” inilah di antara puncak kenikmatan dan tuntutan dunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 12: 11-12. Berkata Nuh kepada kaumnya : Ketahuilah oleh kalian wahai kaum, keutamaan dari bersegera menuju Allah dan beristighfar kepada-Nya adalah, Allah akan memberikan rezeki kepada kalian dengan berbagai macam bentuknya; Allah perintahkan langit kepada kalian agar menurunkan hujan yang terus menerus, maka kalian akan dapati banyak manfaat. Allah juga memperbanyak harta dan anak-anak kalian, serta menjadikan bagi kalian kebun dan ladang. Kemudian Allah juga jadikan sungai-sungai yang mengalir yang indah pemandangannya dan penuh manfaat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni memperbanyak hartamu yang dengannya kamu dapat memperoleh apa yang kamu inginkan dari dunia. Ini termasuk kenikmatan dunia yang disukai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 12",
    "description": "11-12. \"kalau kamu benar-benar memohon ampunan-Nya niscaya dia akan menurunkan hujan yang lebat dari langit kepadamu, dan dia memperbanyak harta dan anak-anakmu, dan mengadakan pula kebun-kebun untukmu yang dapat kamu nikmati keindahan dan buahnya dan mengadakan sungai-sungai untukmu guna mengairi kebun dan memberi minum ternakmu. '13-14. Nabi nuh menasihati kaumnya seperti dijelaskan di atas dan beliau melanjutkan nasihatnya. Mengapa kamu tidak mengagungkan Allah dengan sebenarnya dan tidak takut akan kebesaran Allah' dan sungguh, dia telah menciptakan kamu dalam beberapa tingkatan kejadian dan pertumbuhan yaitu dari nutfah, segumpal daging, kemudian menjadi janin dan bentuk yang sempurna sebagai manusia."
  }
]