[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-16. Bila kalian bertaubat dan beristigfar, niscaya Allah menurunkan kepada kalian hujan deras yang terus-menerus, memperbanyak anak-anak dan harta kalian, membuatkan untuk kalian kebun-kebun yang indah dengan buah-buahan yang kalian nikmati, membuatkan untuk kalian sungai-sungai yang darinya kalian menyiram kebun-kebun kalian dan memberi minum ternak-ternak kalian. Mengapa kalian wahai kaumku, tidak takut kepada keagungan Allah dan kekuasaanNya, sementara Allah telah menciptakan kalian dalam beberapa tahapan: setetes air, kemudian segumpal darah, kemudian seonggok daging, kemudian tulang dan daging? Tidakkah kalian melihat bagaimana Allah menciptakan tujuh langit yang sebagian di atas sebagian lainnya, menciptakan rembulan yang bercahaya di langit, dan menjadikan matahari sebagai lampu bagi penduduk bumi?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Bagaimana kalian -wahai kaumku- tidak takut kepada keagungan Allah dengan melakukan maksiat kepada-Nya tanpa peduli?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Pada dua ayat ini terjadi perubahan cara, dari cara pendekatan menjadi cara peneguran; Nabi Nuh bertanya kepada kaumnya tentang hal yang menghalangi mereka dari beriman dan mengagungkan Allah, serta dari berharap rahmat-Nya dan takut azab-Nya; padahal mereka telah menyaksikan tanda-tanda keberadaan dan keagungan Allah dengan jelas, tidak ada satu makhlukpun yang mampu melakukan hal tersebut kecuali Allah, yaitu tentang penciptaan manusia melalui tahapan-tahapan, dari air mani, segumpal darah, segumpal daging, dan pertumbuhannya setelah kelahiran hingga menjadi anak kecil dan dewasa. Sungguh pada penciptaan ini terdapat tanda yang sangat besar yang menunjukkan keberadaan Allah. Maka apa lagi yang memalingkan mereka dari keimanan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. مَّا لَكُمْ لَا تَرْجُونَ لِلَّـهِ وَقَارًا (Mengapa kamu tidak percaya akan kebesaran Allah?) Yakni tidak takut kepada keagungan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Wahai kaumku kalian tidak menghitung (segala sesuatu yang diberikan) Allah sekalipun. Lalu kenapa kalian tidak tunduk pada keagungan dan kemuliaanNya?. Al-Waqar adalah keagungan. Maknanya adalah kalian tidak dapat membayangkan suatu kondisi yang penuh kebaikan dan imbalan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kamu tidak takut akan kebesaran Allah} kalian tidak takut pada keagungan dan kuasa Allah"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 13: 13-16. Berkata Nuh kepada kaumnya : Mengapa kalian wahai kaum, tidak takut kepada Allah dan dari kebesaran-Nya serta keagungan-Nya. Dialah yang menciptakan kalian dari ketiadaan. Dan Allah menciptakan kalian dengan tahapan-tahapan setelah sempurnanya penciptaan-Nya. Nuh juga berkata : Tidakkah kalian melihat dan menyaksikan bagaimana Allah menciptakan langit yang tujuh dan menjadikannya dari yang tiada, dan menjadikan setiap langit di atas langit yang lainnya. Allah jadikan bulan ini memiliki cahaya untuk menyinari penghuni bumi, dan menjadikan matahari sebagai pelita dan dibutuhkan cahayanya?!."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 13",
    "description": "13-14. Nabi nuh menasihati kaumnya seperti dijelaskan di atas dan beliau melanjutkan nasihatnya. Mengapa kamu tidak mengagungkan Allah dengan sebenarnya dan tidak takut akan kebesaran Allah' dan sungguh, dia telah menciptakan kamu dalam beberapa tingkatan kejadian dan pertumbuhan yaitu dari nutfah, segumpal daging, kemudian menjadi janin dan bentuk yang sempurna sebagai manusia"
  }
]