[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-16. Bila kalian bertaubat dan beristigfar, niscaya Allah menurunkan kepada kalian hujan deras yang terus-menerus, memperbanyak anak-anak dan harta kalian, membuatkan untuk kalian kebun-kebun yang indah dengan buah-buahan yang kalian nikmati, membuatkan untuk kalian sungai-sungai yang darinya kalian menyiram kebun-kebun kalian dan memberi minum ternak-ternak kalian. Mengapa kalian wahai kaumku, tidak takut kepada keagungan Allah dan kekuasaanNya, sementara Allah telah menciptakan kalian dalam beberapa tahapan: setetes air, kemudian segumpal darah, kemudian seonggok daging, kemudian tulang dan daging? Tidakkah kalian melihat bagaimana Allah menciptakan tujuh langit yang sebagian di atas sebagian lainnya, menciptakan rembulan yang bercahaya di langit, dan menjadikan matahari sebagai lampu bagi penduduk bumi?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Padahal Dia telah menciptakan kalian secara bertahap; dari setetes air mani, segumpal darah, kemudian segumpal daging."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَقَدْ خَلَقَكُمْ أَطْوَارًا (Padahal Dia sesungguhnya telah menciptakan kamu dalam beberapa tingkatan kejadian) Yakni dari air mani, kemudian segumpal darah, kemudian segumpal daging, sampai menjadi ciptaan yang sempurna, sebagaimana telah disebutkan pada surat al-Mu’minun, kemudian kalian menjadi bayi, remaja, dan orang tua; maka bagaimana kalian lalai dari pengagungan kepada penciptaan kalian dengan fase-fase yang menakjubkan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sungguh Allah menciptakan kalian tahap demi tahap dalam tingkatan-tingkatan perkembangan dan penciptaan yang berbeda, yaitu mulai dari air mani, kemudian menjadi segumpal darah, lalu menjadi segumpal daging sampai menjadi ciptaan yang sempurna"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan sungguh Dia telah menciptakan kalian dalam beberapa tahapan} keadaan demi keadaan, yaitu mani, darah yang melekat, gumpalan daging, lalu daging dan tulang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. “Mengapa kamu tidak percaya akan kebesaran Allah,” yakni, kalian tidak takut pada keagungan Allah dan kalian tidak memuliakanNya, “padahal Dia sesungguhnya telah menciptakan kamu dalam beberapa tingkatan kejadian,” yakni ciptaan demi ciptaan di dalam perut ibu, kemudian dalam masa susuan, selanjutnya masa kecil, baligh, remaja hingga batas akhir ciptaan. Dzat yang sendiri dalam menciptakan dan mengatur secara sempurna harus disembah dan diesakan. Dalam sebutan permulaan penciptaan manusia terdapat adanya peringatan akan adanya hari kebangkitan dan sesungguhnya Dzat yang menciptakan manusia setelah sebelumnya tidak ada Maha Mampu untuk mengembalikan mereka setelah kematian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 14: 13-16. Berkata Nuh kepada kaumnya : Mengapa kalian wahai kaum, tidak takut kepada Allah dan dari kebesaran-Nya serta keagungan-Nya. Dialah yang menciptakan kalian dari ketiadaan. Dan Allah menciptakan kalian dengan tahapan-tahapan setelah sempurnanya penciptaan-Nya. Nuh juga berkata : Tidakkah kalian melihat dan menyaksikan bagaimana Allah menciptakan langit yang tujuh dan menjadikannya dari yang tiada, dan menjadikan setiap langit di atas langit yang lainnya. Allah jadikan bulan ini memiliki cahaya untuk menyinari penghuni bumi, dan menjadikan matahari sebagai pelita dan dibutuhkan cahayanya?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dari mani lalu menjadi segumpal darah kemudian menjadi segumpal daging dst. kemudian lahir ke dunia, lalu disusui, kemudian menjadi anak-anak, lalu menjadi besar sehingga bisa membedakan, kemudian menjadi pemuda dan menjadi orang tua dan seterusnya sampai keadaannya yang terakhir. Lihat pula surat Al Mu'minun ayat 12, 13 dan 14. Nah, Tuhan yang menciptakan sendiri dan mengatur dengan pengaturan yang indah jelas berhak satu-satunya diibadahi. Disebutkan awal penciptaan untuk mengingatkan manusia agar mereka mengakui adanya kebangkitan dan bahwa yang menciptakan mereka dari yang sebelumnya tidak ada berkuasa menghidupkan mereka kembali setelah mereka mati untuk diberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 14",
    "description": "13-14. Nabi nuh menasihati kaumnya seperti dijelaskan di atas dan beliau melanjutkan nasihatnya. Mengapa kamu tidak mengagungkan Allah dengan sebenarnya dan tidak takut akan kebesaran Allah' dan sungguh, dia telah menciptakan kamu dalam beberapa tingkatan kejadian dan pertumbuhan yaitu dari nutfah, segumpal daging, kemudian menjadi janin dan bentuk yang sempurna sebagai manusia. 15-16. Setelah ajakan kepada manusia untukmemperhatikan dirinya, ayat ini melanjutkan untuk memperhatikan alam raya. Tidakkah kamu memperhatikan bagaimana Allah telah menciptakan tujuh langit yang indah serta berlapis-lapis' dan di sana di langit yang indah itu dia menciptakan bulan yang bercahaya dan menjadikan matahari sebagai pelita yang cemerlang'."
  }
]