[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-16. Bila kalian bertaubat dan beristigfar, niscaya Allah menurunkan kepada kalian hujan deras yang terus-menerus, memperbanyak anak-anak dan harta kalian, membuatkan untuk kalian kebun-kebun yang indah dengan buah-buahan yang kalian nikmati, membuatkan untuk kalian sungai-sungai yang darinya kalian menyiram kebun-kebun kalian dan memberi minum ternak-ternak kalian. Mengapa kalian wahai kaumku, tidak takut kepada keagungan Allah dan kekuasaanNya, sementara Allah telah menciptakan kalian dalam beberapa tahapan: setetes air, kemudian segumpal darah, kemudian seonggok daging, kemudian tulang dan daging? Tidakkah kalian melihat bagaimana Allah menciptakan tujuh langit yang sebagian di atas sebagian lainnya, menciptakan rembulan yang bercahaya di langit, dan menjadikan matahari sebagai lampu bagi penduduk bumi?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan menciptakan bulan di langit bumi, darinya memantul cahaya untuk penduduk bumi, dan menjadikan matahari sebagai sumber cahaya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَجَعَلَ الْقَمَرَ فِيهِنَّ (Dan Allah menciptakan pada bulan) Yakni menjadikan bulan di langit dunia. نُورًا(cahaya) Yakni dengan cahaya yang menyinari permukaan bumi tanpa memiliki panas. وَجَعَلَ الشَّمْسَ سِرَاجًا (dan menjadikan matahari sebagai pelita) Seperti lampu bagi penduduk bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Dan menciptakan bulan di langit dunia yang memantulkan cahaya (matahari) untuk penduduk bumi, dan menciptakan matahari sebagai lampu yang menyinari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di sana Dia menjadikan bulan bercahaya dan matahari sebagai pelita} bersinar terang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. Allah juga berdalil dengan penciptaan langit dan bumi yang lebih agung dari penciptaan manusia seraya berfirman, “Tidakkah kamu perhatikan bagaimana Allah telah menciptakan tujuh langit bertingkat-tingkat,” yakni masing-masing langit di atas yang lain, “dan Allah menciptakan padanya bulan sebagai cahaya” bagi penduduk bumi, “dan menjadikan matahari sebagai pelita.” Di dalam ayat ini terdapat peringatan akan agungnya penciptaan berbagai hal ini serta banyaknya manfaat pada matahari dan bulan sebagai petunjuk atas rahmat Allah dan kebaikanNya yang amat luas. Dzat Yang Mahaagung lagi Maha Penyayang berhak untuk diagungkan, dicintai, ditakuti, dan diharap."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 16: 13-16. Berkata Nuh kepada kaumnya : Mengapa kalian wahai kaum, tidak takut kepada Allah dan dari kebesaran-Nya serta keagungan-Nya. Dialah yang menciptakan kalian dari ketiadaan. Dan Allah menciptakan kalian dengan tahapan-tahapan setelah sempurnanya penciptaan-Nya. Nuh juga berkata : Tidakkah kalian melihat dan menyaksikan bagaimana Allah menciptakan langit yang tujuh dan menjadikannya dari yang tiada, dan menjadikan setiap langit di atas langit yang lainnya. Allah jadikan bulan ini memiliki cahaya untuk menyinari penghuni bumi, dan menjadikan matahari sebagai pelita dan dibutuhkan cahayanya?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Besarnya makhluk-makhluk itu menunjukkan keagungan Allah Subhaanahu wa Ta'aala, dan banyaknya manfaat pada matahari dan bulan menunjukkan rahmat Allah dan luasnya ihsan-Nya Oleh karena itu, Allah Yang Mahaagung dan Maha Penyayang berhak untuk diagungkan, dicintai, diibadahi, ditakuti dan diharap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 16",
    "description": "15-16. Setelah ajakan kepada manusia untukmemperhatikan dirinya, ayat ini melanjutkan untuk memperhatikan alam raya. Tidakkah kamu memperhatikan bagaimana Allah telah menciptakan tujuh langit yang indah serta berlapis-lapis' dan di sana di langit yang indah itu dia menciptakan bulan yang bercahaya dan menjadikan matahari sebagai pelita yang cemerlang'17-18. Setelah disinggung tentang penciptaan langit, kini diuraikan tentang bumi. Dan Allah menumbuhkan yaitu menciptakan kamu dari tanah, tumbuh berangsur-angsur dalam keadaan yang sangat menakjubkan, kemudian setelah berakhir pertumbuhan yaitu tiba saat kematian, dia akan mengembalikan kamu ke dalamnya, yaitu tanah, dan mengeluarkan kamu pada hari kiamat dengan pasti."
  }
]