[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Allah menciptakan bapak kalian dari tanah, kemudian mengembalikan kalian ke tanah saat kalian mati, dan mengeluarkan kalian darinya pada hari kebangkitan secara pasti. Allah menjadikan bumi bagi kalian terbentang seperti tikar agar kalian dapat menelusuri jalan-jalan yang lapang padanya’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan Allah menciptakan kalian dari bumi dengan menciptakan bapak kalian, Adam, dari tanah kemudian kalian memakan apa yang ditumbuhkan bumi untuk kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-18. Nabi Nuh kembali mengingatkan kaumnya tentang nikmat penciptaan manusia; Allah menciptakan Adam dari tanah yang ada di bumi, dan manusia akan kembali ke bumi setelah kematian, dikubur dan hancur lebur di dalam tanah, kemudian Allah akan mengeluarkan mereka dari tanah pada hari kiamat. Tiga hal ini; penciptaan dari tanah, kembali ke tanah, dan dibangkitkan dari tanah merupakan tanda yang besar atas kekuasaan Allah Yang Maha Pencipta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَاللَّـهُ أَنۢبَتَكُم مِّنَ الْأَرْضِ نَبَاتًا (Dan Allah menumbuhkan kamu dari tanah dengan sebaik-baiknya) Yakni Adam, Allah menciptakannya dari permukaan tanah di bumi, kemudian Allah menjadikan keturunannya tumbuh dengan gizi yang berasal dari tanah yang telah berubah bentuk menjadi tanaman atau hewan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Allah menumbuhkan kalian melalui unsur-unsur bumi seperti tanaman, (sama seperti) ketika menciptakan Adam dari unsur bumi (tanah). Allah juga menciptakan dari bumi itu bahan pertumbuhanmu dan bahan makananmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah benar-benar menciptakan kalian} menciptakan asal mula kalian {dari tanah dengan ditumbuhkan} ditumbuhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Dan Allah menumbuhkan kamu dari tanah dengan sebaik-baiknya,” ketika Allah menciptakan ayah kalian, Adam, saat kalian masih berada di dalam tulang rusuknya, “kemudian Dia mengembalikan kamu ke dalam tanah,” pada saat meninggal dunia, “dan mengeluarkan kamu (dari padanya pada Hari Kiamat) dengan sebenar-benarnya,” pada hari kebangkitan dan pengumpulan kembali. Dia-lah Yang berkuasa untuk menghidupkan, mematikan, dan membangkitkan kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 17: 17-20. Berkata Nuh : Ketahuilah oleh kalian, bahwa Allah lah yang mencipatakan dan menjadikan bapak moyang kalian Adam dari tanah. Kemudian Allah kembalikan kalian menjadi tanah ketika kalian semua mati dan kalian dikuburkan di dalam bumi, kemudian Allah keluarkan kami darinya pada kalia yang lain di hari kebangkitan sebagai balasan atas amalan-amalan kalian. Ketahuilah bahwa hanya Allah saja yang menghamparkan bumi dan meluaskannya dan sebagia tempat tinggal kalian yang kondisi (di atasnya) menjadikan bermanfaat bagi kalian; Agar supaya kalian bisa menyusuri, berjalan mengelilingi (bumi) yang luas, dan ini tidak menafikan bahwasanya bumi itu bulat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Dia menciptakan nenek moyang kamu Adam sedangkan kamu dalam tulang shulbi(punggung)nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 17",
    "description": "17-18. Setelah disinggung tentang penciptaan langit, kini diuraikan tentang bumi. Dan Allah menumbuhkan yaitu menciptakan kamu dari tanah, tumbuh berangsur-angsur dalam keadaan yang sangat menakjubkan, kemudian setelah berakhir pertumbuhan yaitu tiba saat kematian, dia akan mengembalikan kamu ke dalamnya, yaitu tanah, dan mengeluarkan kamu pada hari kiamat dengan pasti"
  }
]