[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Allah menciptakan bapak kalian dari tanah, kemudian mengembalikan kalian ke tanah saat kalian mati, dan mengeluarkan kalian darinya pada hari kebangkitan secara pasti. Allah menjadikan bumi bagi kalian terbentang seperti tikar agar kalian dapat menelusuri jalan-jalan yang lapang padanya’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kemudian mengembalikan kalian kepadanya setelah kematian kalian, lalu mengeluarkan kalian untuk dibangkitkan darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. ثُمَّ يُعِيدُكُمْ فِيهَا (kemudian Dia mengembalikan kamu ke dalam tanah) Yakni kalian akan mati di dalam tanah sehingga anggota tubuh kalian akan hancur hingga manjadi tanah dan bersatu dengan bumi. وَيُخْرِجُكُمْ إِخْرَاجًا(dan mengeluarkan kamu (pada hari kiamat) dengan sebenar-benarnya) Yakni mengeluarkan kalian dari tanah dengan membangkitkan kalian di hari kiamat. Yakni Allah akan mengeluarkan kalian sekaligus, dan bukan tumbuh bertahap sebagaimana pada penciptaan yang pertama kali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kemudian mengembalikan (mengubur) kalian di bumi melalui proses kematian, lalu mengeluarkan kalian melalui proses pembangkitan dan mengumpulkan kalian pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia akan mengembalikan kalian ke dalamnya dan mengeluarkan kalian dengan pasti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. “Dan Allah menumbuhkan kamu dari tanah dengan sebaik-baiknya,” ketika Allah menciptakan ayah kalian, Adam, saat kalian masih berada di dalam tulang rusuknya, “kemudian Dia mengembalikan kamu ke dalam tanah,” pada saat meninggal dunia, “dan mengeluarkan kamu (dari padanya pada Hari Kiamat) dengan sebenar-benarnya,” pada hari kebangkitan dan pengumpulan kembali. Dia-lah Yang berkuasa untuk menghidupkan, mematikan, dan membangkitkan kembali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 18: 17-20. Berkata Nuh : Ketahuilah oleh kalian, bahwa Allah lah yang mencipatakan dan menjadikan bapak moyang kalian Adam dari tanah. Kemudian Allah kembalikan kalian menjadi tanah ketika kalian semua mati dan kalian dikuburkan di dalam bumi, kemudian Allah keluarkan kami darinya pada kalia yang lain di hari kebangkitan sebagai balasan atas amalan-amalan kalian. Ketahuilah bahwa hanya Allah saja yang menghamparkan bumi dan meluaskannya dan sebagia tempat tinggal kalian yang kondisi (di atasnya) menjadikan bermanfaat bagi kalian; Agar supaya kalian bisa menyusuri, berjalan mengelilingi (bumi) yang luas, dan ini tidak menafikan bahwasanya bumi itu bulat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam keadaan terkubur. Untuk dibangkitkan. Dengan demikian, Dialah yang berkuasa menghidupkan, mematikan dan membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 18",
    "description": "17-18. Setelah disinggung tentang penciptaan langit, kini diuraikan tentang bumi. Dan Allah menumbuhkan yaitu menciptakan kamu dari tanah, tumbuh berangsur-angsur dalam keadaan yang sangat menakjubkan, kemudian setelah berakhir pertumbuhan yaitu tiba saat kematian, dia akan mengembalikan kamu ke dalamnya, yaitu tanah, dan mengeluarkan kamu pada hari kiamat dengan pasti. 19-20. Dan Allah menjadikan bumi untukmu sebagai hamparan, supaya kamu dapat menetap di sana dengan nyaman, dan agar kamu dapat pergi kian kemari di jalan-jalan yang luas, sehingga dapat memenuhi kebutuhanmu."
  }
]