[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Allah menciptakan bapak kalian dari tanah, kemudian mengembalikan kalian ke tanah saat kalian mati, dan mengeluarkan kalian darinya pada hari kebangkitan secara pasti. Allah menjadikan bumi bagi kalian terbentang seperti tikar agar kalian dapat menelusuri jalan-jalan yang lapang padanya’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan Allah menjadikan bumi terbentang untuk kalian, siap untuk dihuni."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Nabi Nuh menarik perhatian kaumnya kepada salah satu tanda kekuasaan Allah yang jelas dan ada di dekat mereka, yaitu bumi yang menjadi tempat kita hidup, ia terbentang luas bagi manusia agar mereka dapat berjalan di berbagai penjurunya untuk memenuhi kebutuhan dan penghidupan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah menjadikan bumi membentang luas agar kalian dapat menempatinya dan beradaptasi di dalamnya dengan melakukan pergerakan di tanah yang membentang itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah menjadikan bumi untuk kalian sebagai hamparan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. “Dan Allah menjadikan bumi untukmu sebagai hamparan,” yakni, terbentang dan siap untuk dimanfaatkan, “supaya kamu menjalani jalan-jalan yang luas di bumi itu,” andai Allah tidak membentangkannya, niscaya tidak dapat dimanfaatkan, bahkan tidak mungkin bisa ditanami, didirikan bangunan dan ditempati di atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 19: 17-20. Berkata Nuh : Ketahuilah oleh kalian, bahwa Allah lah yang mencipatakan dan menjadikan bapak moyang kalian Adam dari tanah. Kemudian Allah kembalikan kalian menjadi tanah ketika kalian semua mati dan kalian dikuburkan di dalam bumi, kemudian Allah keluarkan kami darinya pada kalia yang lain di hari kebangkitan sebagai balasan atas amalan-amalan kalian. Ketahuilah bahwa hanya Allah saja yang menghamparkan bumi dan meluaskannya dan sebagia tempat tinggal kalian yang kondisi (di atasnya) menjadikan bermanfaat bagi kalian; Agar supaya kalian bisa menyusuri, berjalan mengelilingi (bumi) yang luas, dan ini tidak menafikan bahwasanya bumi itu bulat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni terhampar dan siap untuk dimanfaatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 19",
    "description": "19-20. Dan Allah menjadikan bumi untukmu sebagai hamparan, supaya kamu dapat menetap di sana dengan nyaman, dan agar kamu dapat pergi kian kemari di jalan-jalan yang luas, sehingga dapat memenuhi kebutuhanmu"
  }
]