[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Sesungguhnya Kami telah mengutus Nuh kepada kaumnya. Kami berfirman kepadanya, “Peringakanlah kaummu sebelum azab yang pedih datang kepada mereka.” Nuh berkata, “Wahai kaumku, sesungguhnya aku memperingatkan kalian dengan peringatan yang jelas terhadap azab Allah bila kalian mendurhakaiku. Sesungguhnya aku adalah utusan Allah kepada kalian, maka sembahlah Allah semata, takutlah kepada hukumanNYa, taatilah aku dalam apa yang aku perintahkan kepada kalian dan aku larang. Bila kalian menaatiku dan menjawab seruanku, niscaya Allah memaafkan dan mengampuni dosa-dosa kalian, serta memanjangkan umur-umur kalian hingga waktu yang ditentukan dalam ilmu Allah. Sesungguhnya kematian, bila ia datang, sama sekali tidak dapat diakhirkan. Bila kalian mengetahui, niscaya kalian bersegera untuk beriman dan patuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Nuh berkata kepada kaumnya, “Wahai kaumku, aku adalah pemberi peringatan dengan peringatan yang jelas atas datangnya siksa menyakitkan yang menunggu kalian jika kalian tidak bertobat kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Nabi Nuh menjalankan tugasnya dan menyampaikan kepada kaumnya bahwa dia adalah utusan dari Allah yang menyeru mereka agar mentauhidkan-Nya, memperingatkan mereka dari balasan bagi orang yang kafir, menjelaskan isi dari risalahnya, dan memerintahkan mereka untuk menyembah Allah dengan cara yang Dia ridhai dan untuk menjauhi segala yang mengundang kemurkaan-Nya. Nabi Nuh juga memerintahkan mereka untuk mentaatinya dalam segala yang dia sampaikan, karena dia adalah orang yang menyampaikan pesan dari Tuhannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Nuh berkata: “Wahai kaumku, sesungguhnya aku adalah pemberi peringatan kepada kalian tentang hukuman Allah dengan peringatan yang sangat jelas menggunakan penjelasan risalah Allah SWT.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Wahai kaumku, sesungguhnya aku ini adalah seorang pemberi peringatan yang menjelaskan kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-4. Nabi Nuh menunaikan tugas itu serta bersegera menunaikan perintah Allah seraya berkata, “Hai kaumku, sesungguhnya aku adalah pemberi peringatan yang menjelaskan kepadamu,” yakni, yang jelas ancamannya karena jelasnya apa-apa yang diperingatkan dan apa yang bisa menyelamatkan. Hal itu dijelaskan secara terang. Nabi Nuh memberitahu dan memerintahkan landasan hal itu pada kaumnya seraya berkata, “(yaitu) sembahlah olehmu Allah, dan bertakwalah kepadaNya,” dengan mengesakan Allah dalam ibadah, tauhid, jauh dari kesyirikan serta segala jalan dan perantaranya. Bila mereka bertakwa, maka Allah akan mengampuni dosa-dosa mereka, dan bila mereka diampuni, mereka akan mendapatkan keselamatan dari siksa dan mendapatkan keuntuntungan berupa pahala, “dan menangguhkan kamu sampai kepada waktu yang ditentukan,” yakni, Allah memberi kesenangan pada kalian di dunia ini dan mencegah kebinasaan dari kalian hingga waktu yang ditentukan. Batas waktu berada di dunia berdasarkan takdir dan kekuasaan Allah hingga waktu tertentu, bukan kesenangan abadi, sebab kematian adalah keniscayaan. Karena itu Allah berfirman, “Sesungguhnya ketetapan Allah apabila telah datang tidak dapat ditangguhkan, kalau kamu mengetahui,” sebagaimana kalian kufur kepada Allah dan menentang kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 2: 2-4. Allah mengabarkan bahwa Nuh bergegas mengerjakan perintah Allah dengan berkata (kepada kaumnya) : Wahai kaumku, aku adalah utusan yang membawa peringatan kepada kalian, (yaitu) menjelaskan adzab Allah jika kalian masih tetap atas kekafiran dan pengingkaran kalian, dan aku meminta kepada kalian agar kalian beribadah kepada Allah saja tanpa menyekutukan-Nya, dan agar supaya kalian takut akan adzab Allah. Kalian harus mentaatiku dalam apa yang Allah perintahkan kepadaku, untuk disampaikan kepada kalian; Maka, jika kalian mengikuti seruanku, maka Allah akan menghapuskan dosa-dosa kalian dan mengampuni kalian, dan Allah akan panjangkan waktu untuk kalian hidup, sampai batas yang Allah tentukan. Ketahuilah oleh kalian bahwa maut jika datang (kepada kalian) tidak akan dapat ditunda (diakhirkan) selamanya. Seandainya kalian mengetahui dengan yakin (tanpa ragu), sungguh kalian akan bersegera menjadi orang yang beriman dan taat kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang demikian karena jelasnya peringatan Beliau sehingga tegak hujjah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 2",
    "description": "2-3. Nabi nuh melaksanakan perintah Allah tersebut. Dia nuh berkata, 'wahai kaumku! sesungguhnya aku ini seorang pemberi peringatan akan azab Allah yang menjelaskan peringatan itu kepada kamu yaitu sembahlah Allah yang esa dan tidak menyekutukan-Nya dengan sesuatu yang lain, bertakwalah kepada-Nya dengan menjalankan perintah dan menjauhi larangan-Nya dan taatlah kepadaku"
  }
]