[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Allah menciptakan bapak kalian dari tanah, kemudian mengembalikan kalian ke tanah saat kalian mati, dan mengeluarkan kalian darinya pada hari kebangkitan secara pasti. Allah menjadikan bumi bagi kalian terbentang seperti tikar agar kalian dapat menelusuri jalan-jalan yang lapang padanya’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dengan harapan agar kalian menelusuri ujung-ujungnya yang luas untuk mencari rezeki yang halal.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. لِّتَسْلُكُوا۟ مِنْهَا سُبُلًا فِجَاجًا (supaya kamu menjalani jalan-jalan yang luas di bumi itu”) Yakni jalan-jalan yang luas. Sedangkan makna (الفج) yakni jalan yang terhimpit di antara dua gunung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Agar kalian dapat berjalan di atas permukaannya dengan membuat jalan yang luas dan lebar di atasnya. Fijaj adalah bentuk jamak dari fajjun, yaitu jalan yang membentang di antara dua gunung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terhampar luas {agar kalian dapat pergi di jalan-jalan} jalan-jalan {yang luas} luas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. “Dan Allah menjadikan bumi untukmu sebagai hamparan,” yakni, terbentang dan siap untuk dimanfaatkan, “supaya kamu menjalani jalan-jalan yang luas di bumi itu,” andai Allah tidak membentangkannya, niscaya tidak dapat dimanfaatkan, bahkan tidak mungkin bisa ditanami, didirikan bangunan dan ditempati di atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 20: 17-20. Berkata Nuh : Ketahuilah oleh kalian, bahwa Allah lah yang mencipatakan dan menjadikan bapak moyang kalian Adam dari tanah. Kemudian Allah kembalikan kalian menjadi tanah ketika kalian semua mati dan kalian dikuburkan di dalam bumi, kemudian Allah keluarkan kami darinya pada kalia yang lain di hari kebangkitan sebagai balasan atas amalan-amalan kalian. Ketahuilah bahwa hanya Allah saja yang menghamparkan bumi dan meluaskannya dan sebagia tempat tinggal kalian yang kondisi (di atasnya) menjadikan bermanfaat bagi kalian; Agar supaya kalian bisa menyusuri, berjalan mengelilingi (bumi) yang luas, dan ini tidak menafikan bahwasanya bumi itu bulat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika sekiranya Dia tidak membentangkannya, tentu mereka tidak tidak dapat pergi kian-kemari di jalan yang luas, bahkan mereka tidak akan bisa menggarap tanahnya, menanam tanaman, membuat bangunan dan tinggal di atasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 20",
    "description": "19-20. Dan Allah menjadikan bumi untukmu sebagai hamparan, supaya kamu dapat menetap di sana dengan nyaman, dan agar kamu dapat pergi kian kemari di jalan-jalan yang luas, sehingga dapat memenuhi kebutuhanmu. 21. Kaum nabi nuh yang dinasihati dengan aneka cara itu tidak bergeming, tetap saja membangkang, maka nabi nuh pun kembali mengadu kepada Allah. Nuh berkata, 'ya tuhanku, sesungguhnya mereka yang kuseru untuk beriman itu durhaka kepadaku, dan mereka mengikuti pemuka-pemuka masyarakat yaitu orang-orang yang harta dan anak-anaknya hanya menambah kerugian baginya kelak di akhirat. \"."
  }
]