[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-25. Nuh berkata, “Wahai Tuhanku, sesungguhnya kaumku mendurhakaiku dan mendustakanku dengan sangat, orang-orang lemah dari mereka mengikuti para pemimpin yang sesat yang harta dan anak-anak mereka hanya menambah kesesatan bagi mereka di dunia dan hukuman di akhirat. Para pemimpin kesesatan itu melakukan makar besar terhadap orang-orang lemah yang mengikuti mereka. Mereka berkata kepada orang-orang lemah, ‘Jangan meninggalkan tuhan-tuhan kalian untuk menyembah Allah semata yang diserukan oleh Nuh. Jangan meninggalkan Wadd, Suwa’, Yaghuts,Yau’uq dan Nasr’.” Dan itu adalah nama berhala-berhala mereka yang mereka sembah selain Allaah. Mereka aslinya adalah nama orang-orang shalih, saat orang-orang shalih tersebut wafat, setan membisikkan kepada kaum mereka agar membuar relief-relief dan patung-patung, agar hal itu membuat mereka giat, dalam anggapan mereka, untuk melakukan ketaatan dengan melihat mereka. Manakala orang-orang tersebut telah meninggal dunia, masa berlalu, dan mereka digantikan oleh generasi sesudah mereka, maka setan datang membisikkan kepada mereka bahwa para leluhur mereka menyembah relief-relief dan patung-patung itu dan menjadikan mereka sebagai wasilah. Ini adalah salah satu hikmah diharamkannya patung dan mendirikan bangunan kubah di atas kuburan, karena dengan berlalunya masa, ia bisa disembah oleh orang-orang bodoh. Para pemimpin itu telah menyesatkan banyak orang melalui jalan-jalan kesesatan dan penyimpangan yang mereka perindah. Kemudian Nuh berkata, “Wahai TUhan kami, jangan menambahkan kepada orang-orang yang menzhalimi diri mereka dengan kekafiran dan penentangan kecuali semakin jauh dari kebenaran.” Disebabkan oleh dosa-dosa, kekafiran dan pelanggaran mereka, mereka ditenggelamkan oleh banjir besar, dan sesudah mereka ditenggelamkan, mereka dimasukkan kedalam api neraka yang berkobar besar dan menyala-nyala, mereka tidak mendapatkan siapapun selain Allah yang dapat menolong mereka atau melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Nuh berkata, “Wahai Rabbku, sesungguhnya kaumku telah mendurhakaiku dalam perkara yang Engkau perintahkan kepada mereka, yaitu untuk mentauhidkan-Mu dan beribadah kepada-Mu semata. Dan golongan yang rendah dari mereka mengikuti pemimpin-pemimpin mereka yang telah Engkau karuniai harta dan anak, lalu karunia-Mu itu tidak menambah bagi mereka melainkan kesesatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Ayat ini menjelaskan pengaduan Nabi Nuh terhadap kaumnya, mereka enggan mentaatinya untuk beriman dan memohon ampun, dan mereka lebih memilih menjadi pengikut para pembesar kaum mereka yang tidak mendapat manfaat dari harta dan keturunan yang telah Allah berikan; namun mereka menggunakan harta mereka untuk melawan jalan Allah, dan memerintahkan keturunan meka agar mengingkari-Nya dan memohon bantuan kepada para keturunan itu untuk membantu para pengikut mereka. Dan itulah yang menyebabkan bertambahnya kerugian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَاتَّبَعُوا۟ مَن لَّمْ يَزِدْهُ مَالُهُۥ وَوَلَدُهُۥٓ إِلَّا خَسَارًا (dan telah mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka) Yakni orang-orang rendahan akan mengikuti pemimpin mereka dan para pemilik kekayaan yang merupakan orang-orang yang tidak menjadikan pertambahan harta dan anak mereka kecuali kesesatan di dunia dan siksaan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Nuh berkata: “Tuhanku, sesungguhnya kaumku bermaksiat kepadaku tentang apa yang Engkau perintahkan kepada mereka, yaitu keimanan. Mereka juga tidak merespon ajakanku. Orang-orang kecil di antara mereka mengikuti para pemimpin dan para ilmuan mereka yang tidak memberikan harta dan anak yang banyak kecuali hanya kesesatan di dunia dan kerugian di akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Nuh berkata,“Ya Tuhanku, sesungguhnya mereka durhaka kepadaku dan mengikuti orang-orang yang tidak menambah harta dan anak-anaknya melainkan hanya kerugian baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Nabi Nuh berkata” seraya mengadu pada Rabbnya bahwa perkataan, nasihat, dan peringatan ini tidak berguna bagi mereka, “Ya Rabbku, sesungguhnya mereka telah mendurhakaiku,” dalam perintahku, “dan (mereka justru) mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka.” Yakni, mereka mendurhakai seorang rasul yang memberi nasihat dan petunjuk pada kebaikan, tapi mereka justru mengikuti golongan besar dan para pembesar yang hanya semakin membuat harta dan anak-anak mereka rugi (binasa dan tidak mendapatkan keuntungan), lantas bagaimana dengan orang yang mereka patuhi dan taati itu sendiri? “Dan melakukan tipu daya yang amat besar,” yaitu tipu daya besar dan hebat dalam menentang kebenaran. Para pembesar kaum berkata menyeru pada kesyirikan dan menghiasinya, “jangan sekali-kali kamu meninggalkan (penyembahan) terhadap sesembahan-sesembahan kamu.” Mereka menyeru sesama mereka untuk bersikap fanatis di atas kesyirikan dan agar mereka tidak meninggalkan kebiasaan nenek moyang mereka terdahulu, mereka menentukan tuhan-tuhan mereka seraya berkata, “Dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwa,’ yaghuts, ya’uq dan nasr.” Ini sebenarnya adalah nama-nama orang shalih, dan ketika mereka meninggal dunia, setan menghiasi kaum mereka agar membuat patung mereka demi menyulut semangat mereka untuk beribadah ketika melihat patung-patung itu sesuai anggapan mereka. Masa pun berlalu dan datanglah generasi lain, setan berkata kepada mereka, “Para pendahulu kalian menyembah mereka dan menjadikan mereka sebagai perantara, dengan mereka para pendahulu kalian meminta hujan, mereka menyembah patung-patung itu.” Karena itulah, para pemimpin mereka berpesan untuk tidak meninggalkan penyembahan berhala-berhala ini, “dan sesudahnya mereka telah menyesatkan kebanyakan (manusia),” yakni para pembesar dan pemimpin menyesatkan dengan seruan mereka pada kebanyakan orang. “Dan janganlah Engkau tambahkan bagi orang-orang zhalim itu selain kesesatan,” yakni, andaikan kesesatan mereka pada saat aku menyeru mereka pada kebenaran ada kebaikannya, tapi seruan para pembesar itu hanya semakin menyesatkan. Tidak tersisa satu tempat pun untuk keselamatan dan kebaikan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 21: 21-22. Berkata Nuh : Rabbku, sungguh kaumku telah bermaksiat kepadaku atas apa yang Engkau perintahkan pada mereka, dan mereka mengingkari atas apa yang aku dakwahkan kepada mereka; Bahkan, sungguh mereka telah meninggalkan aku dan lebih memilih untuk mengikuti orang-orang rendahan diantara mereka dan dedengkot-dedengkot kesesatan yang mereka melampaui batas dengan harta-harta mereka, dan sombong dengan anak-anak mereka. Dan tidaklah harta-harta dan anak-anak mereka kecuali hanyalah menambah kesesatan di atas kesesatan mereka, setelah mereka semua diberikan rahmat dari Tuhan mereka. Mereka membuat makar yang besar dengan niat yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mengeluhkan kepada Tuhannya bahwa dakwahnya itu tidak berpengaruh apa-apa bagi mereka. Yakni rakyat jelata dan orang-orang fakir. Yaitu para pemimpin yang mendapatkan kesenangan; yang harta dan anaknya hanya menambah kerugian bagi mereka dan menghilangkan keuntungan. Jika demikian, bagaimana dengan orang yang tunduk menaati mereka?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 21",
    "description": "Kaum nabi nuh yang dinasihati dengan aneka cara itu tidak bergeming, tetap saja membangkang, maka nabi nuh pun kembali mengadu kepada Allah. Nuh berkata, 'ya tuhanku, sesungguhnya mereka yang kuseru untuk beriman itu durhaka kepadaku, dan mereka mengikuti pemuka-pemuka masyarakat yaitu orang-orang yang harta dan anak-anaknya hanya menambah kerugian baginya kelak di akhirat. \"22-23. Dan mereka para pemuka masyarakat itu melakukan tipu daya yang sangat besar untuk menghalangiku menyampaikan dakwah. Dan mere-ka memprovokasi masyarakat dengan berkata, jangan sekali-kali kamu meninggalkan penyembahan tuhan-tuhan kamu dan untuk menegaskan larangannya itu mereka menyebut satu demi satu tuhan-tuhan yang mereka sembah sambil lebih tegas lagi menyatakan jangan pula sekali-kali kamu meninggalkan penyembahan wadd, dan jangan pula suwa', yag'', ya''q dan nasr. Itu semua adalah nama-nama berhala yang terbesar pada kabilah-kabilah kaum nuh, yang semula nama-nama orang saleh."
  }
]