[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-25. Nuh berkata, “Wahai Tuhanku, sesungguhnya kaumku mendurhakaiku dan mendustakanku dengan sangat, orang-orang lemah dari mereka mengikuti para pemimpin yang sesat yang harta dan anak-anak mereka hanya menambah kesesatan bagi mereka di dunia dan hukuman di akhirat. Para pemimpin kesesatan itu melakukan makar besar terhadap orang-orang lemah yang mengikuti mereka. Mereka berkata kepada orang-orang lemah, ‘Jangan meninggalkan tuhan-tuhan kalian untuk menyembah Allah semata yang diserukan oleh Nuh. Jangan meninggalkan Wadd, Suwa’, Yaghuts,Yau’uq dan Nasr’.” Dan itu adalah nama berhala-berhala mereka yang mereka sembah selain Allaah. Mereka aslinya adalah nama orang-orang shalih, saat orang-orang shalih tersebut wafat, setan membisikkan kepada kaum mereka agar membuar relief-relief dan patung-patung, agar hal itu membuat mereka giat, dalam anggapan mereka, untuk melakukan ketaatan dengan melihat mereka. Manakala orang-orang tersebut telah meninggal dunia, masa berlalu, dan mereka digantikan oleh generasi sesudah mereka, maka setan datang membisikkan kepada mereka bahwa para leluhur mereka menyembah relief-relief dan patung-patung itu dan menjadikan mereka sebagai wasilah. Ini adalah salah satu hikmah diharamkannya patung dan mendirikan bangunan kubah di atas kuburan, karena dengan berlalunya masa, ia bisa disembah oleh orang-orang bodoh. Para pemimpin itu telah menyesatkan banyak orang melalui jalan-jalan kesesatan dan penyimpangan yang mereka perindah. Kemudian Nuh berkata, “Wahai TUhan kami, jangan menambahkan kepada orang-orang yang menzhalimi diri mereka dengan kekafiran dan penentangan kecuali semakin jauh dari kebenaran.” Disebabkan oleh dosa-dosa, kekafiran dan pelanggaran mereka, mereka ditenggelamkan oleh banjir besar, dan sesudah mereka ditenggelamkan, mereka dimasukkan kedalam api neraka yang berkobar besar dan menyala-nyala, mereka tidak mendapatkan siapapun selain Allah yang dapat menolong mereka atau melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Para pembesar dari kalangan mereka melakukan tipu daya yang besar dengan memprovokasi golongan rendah dari mereka untuk melawan Nuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Sungguh para pembesar kaum Nabi Nuh itu telah menyusun makar dan tipu daya terhadap Nabi mereka dan berusaha menimpakan keburukan padanya dengan mengerahkan waktu dan fikiran. Dan makar yang mereka susun ini dijelaskan pada ayat selanjutnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَمَكَرُوا۟ مَكْرًا كُبَّارًا (dan melakukan tipu-daya yang amat besar) Yakni makar yang besar, mereka menuntut dan mendorong para pengikut mereka untuk membunuh Nabi Nuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Pemimpin-pemimpin mereka melakukan tipu daya yang sangat besar, yaitu melakukan hasutan yang sangat kotor untuk membunuh Nuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka melakukan tipu daya yang sangat besar} yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Nabi Nuh berkata” seraya mengadu pada Rabbnya bahwa perkataan, nasihat, dan peringatan ini tidak berguna bagi mereka, “Ya Rabbku, sesungguhnya mereka telah mendurhakaiku,” dalam perintahku, “dan (mereka justru) mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka.” Yakni, mereka mendurhakai seorang rasul yang memberi nasihat dan petunjuk pada kebaikan, tapi mereka justru mengikuti golongan besar dan para pembesar yang hanya semakin membuat harta dan anak-anak mereka rugi (binasa dan tidak mendapatkan keuntungan), lantas bagaimana dengan orang yang mereka patuhi dan taati itu sendiri? “Dan melakukan tipu daya yang amat besar,” yaitu tipu daya besar dan hebat dalam menentang kebenaran. Para pembesar kaum berkata menyeru pada kesyirikan dan menghiasinya, “jangan sekali-kali kamu meninggalkan (penyembahan) terhadap sesembahan-sesembahan kamu.” Mereka menyeru sesama mereka untuk bersikap fanatis di atas kesyirikan dan agar mereka tidak meninggalkan kebiasaan nenek moyang mereka terdahulu, mereka menentukan tuhan-tuhan mereka seraya berkata, “Dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwa,’ yaghuts, ya’uq dan nasr.” Ini sebenarnya adalah nama-nama orang shalih, dan ketika mereka meninggal dunia, setan menghiasi kaum mereka agar membuat patung mereka demi menyulut semangat mereka untuk beribadah ketika melihat patung-patung itu sesuai anggapan mereka. Masa pun berlalu dan datanglah generasi lain, setan berkata kepada mereka, “Para pendahulu kalian menyembah mereka dan menjadikan mereka sebagai perantara, dengan mereka para pendahulu kalian meminta hujan, mereka menyembah patung-patung itu.” Karena itulah, para pemimpin mereka berpesan untuk tidak meninggalkan penyembahan berhala-berhala ini, “dan sesudahnya mereka telah menyesatkan kebanyakan (manusia),” yakni para pembesar dan pemimpin menyesatkan dengan seruan mereka pada kebanyakan orang. “Dan janganlah Engkau tambahkan bagi orang-orang zhalim itu selain kesesatan,” yakni, andaikan kesesatan mereka pada saat aku menyeru mereka pada kebenaran ada kebaikannya, tapi seruan para pembesar itu hanya semakin menyesatkan. Tidak tersisa satu tempat pun untuk keselamatan dan kebaikan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 22: 21-22. Berkata Nuh : Rabbku, sungguh kaumku telah bermaksiat kepadaku atas apa yang Engkau perintahkan pada mereka, dan mereka mengingkari atas apa yang aku dakwahkan kepada mereka; Bahkan, sungguh mereka telah meninggalkan aku dan lebih memilih untuk mengikuti orang-orang rendahan diantara mereka dan dedengkot-dedengkot kesesatan yang mereka melampaui batas dengan harta-harta mereka, dan sombong dengan anak-anak mereka. Dan tidaklah harta-harta dan anak-anak mereka kecuali hanyalah menambah kesesatan di atas kesesatan mereka, setelah mereka semua diberikan rahmat dari Tuhan mereka. Mereka membuat makar yang besar dengan niat yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni para pemimpin itu. Untuk menolak kebenaran. Mereka mendustakan Nabi Nuh, menyakiti Beliau dan menyakiti orang-orang yang mengikuti Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 22",
    "description": "22-23. Dan mereka para pemuka masyarakat itu melakukan tipu daya yang sangat besar untuk menghalangiku menyampaikan dakwah. Dan mere-ka memprovokasi masyarakat dengan berkata, jangan sekali-kali kamu meninggalkan penyembahan tuhan-tuhan kamu dan untuk menegaskan larangannya itu mereka menyebut satu demi satu tuhan-tuhan yang mereka sembah sambil lebih tegas lagi menyatakan jangan pula sekali-kali kamu meninggalkan penyembahan wadd, dan jangan pula suwa', yag'', ya''q dan nasr. Itu semua adalah nama-nama berhala yang terbesar pada kabilah-kabilah kaum nuh, yang semula nama-nama orang saleh"
  }
]