[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-25. Nuh berkata, “Wahai Tuhanku, sesungguhnya kaumku mendurhakaiku dan mendustakanku dengan sangat, orang-orang lemah dari mereka mengikuti para pemimpin yang sesat yang harta dan anak-anak mereka hanya menambah kesesatan bagi mereka di dunia dan hukuman di akhirat. Para pemimpin kesesatan itu melakukan makar besar terhadap orang-orang lemah yang mengikuti mereka. Mereka berkata kepada orang-orang lemah, ‘Jangan meninggalkan tuhan-tuhan kalian untuk menyembah Allah semata yang diserukan oleh Nuh. Jangan meninggalkan Wadd, Suwa’, Yaghuts,Yau’uq dan Nasr’.” Dan itu adalah nama berhala-berhala mereka yang mereka sembah selain Allaah. Mereka aslinya adalah nama orang-orang shalih, saat orang-orang shalih tersebut wafat, setan membisikkan kepada kaum mereka agar membuar relief-relief dan patung-patung, agar hal itu membuat mereka giat, dalam anggapan mereka, untuk melakukan ketaatan dengan melihat mereka. Manakala orang-orang tersebut telah meninggal dunia, masa berlalu, dan mereka digantikan oleh generasi sesudah mereka, maka setan datang membisikkan kepada mereka bahwa para leluhur mereka menyembah relief-relief dan patung-patung itu dan menjadikan mereka sebagai wasilah. Ini adalah salah satu hikmah diharamkannya patung dan mendirikan bangunan kubah di atas kuburan, karena dengan berlalunya masa, ia bisa disembah oleh orang-orang bodoh. Para pemimpin itu telah menyesatkan banyak orang melalui jalan-jalan kesesatan dan penyimpangan yang mereka perindah. Kemudian Nuh berkata, “Wahai TUhan kami, jangan menambahkan kepada orang-orang yang menzhalimi diri mereka dengan kekafiran dan penentangan kecuali semakin jauh dari kebenaran.” Disebabkan oleh dosa-dosa, kekafiran dan pelanggaran mereka, mereka ditenggelamkan oleh banjir besar, dan sesudah mereka ditenggelamkan, mereka dimasukkan kedalam api neraka yang berkobar besar dan menyala-nyala, mereka tidak mendapatkan siapapun selain Allah yang dapat menolong mereka atau melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Mereka berkata kepada para pengikutnya, “Janganlah kalian meninggalkan penyembahan kepada tuhan-tuhan kalian, janganlah kalian meninggalkan penyembahan terhadap berhala kalian: Wadd, Suwā', Yagūṡ, Ya'ūq dan Nasr.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Para pembesar kaum Nabi Nuh memerintahkan para pengikut mereka untuk tetap berpegang teguh pada tuhan-tuhan yang mereka sembah selain Allah; tuhan-tuhan itu adalah Wadd, Suwa’, Yaghuts, Ya’uq, dan Nasr. Ini semua adalah patung-patung berbentuk orang-orang shalih dari kaum Nabi Nuh. Ketika orang-orang shalih itu meninggal, setan menggoda kaum Nabi Nuh untuk membuat patung-patung di majelis mereka dan menamainya dengan nama mereka, agar dapat mengingatkan mereka ketaatan jika mereka melihat patung orang-orang shalih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَقَالُوا۟ (Dan mereka berkata) Yakni para pemimpin berkata kepada para pengikut mereka untuk memperdaya mereka agar menyelisihi Nuh. لَا تَذَرُنَّ ءَالِهَتَكُمْ(Jangan sekali-kali kamu meninggalkan (penyembahan) tuhan-tuhan kamu) Yakni janganlah kalian meninggalkan penyembahan tuhan-tuhan kalian, yaitu patung-patung dan gambar-gambar yang mereka miliki, yang kemudian disembah oleh orang-orang Arab setelah mereka. وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا(dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwwa’, yaghuts, ya’uq dan nasr) Yakni janganlah berhenti menyembah patung-patung ini. Ini merupakan nama-nama orang shalih yang hidup pada rentang zaman antara Nabi Adam dan Nabi Nuh, namun kemudian kaum Nabi Nuh membuat patung mereka di tempat-tempat ibadah mereka. Kemudian datang generasi setelah mereka, dan Iblis membisikkan kepada mereka: “orang-orang sebelum kalian dahulu menyembah patung-patung ini, maka sembahlah ia.” Maka mereka menyembahnya; sehingga itulah pertama kali terjadi penyembahan berhala. Lalu patung-patung itu sampai di jazirah Arab dan disembah oleh sebagian kabilah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Para pemimpin itu berkata kepada para pengikutnya: “Kalian jangan sampai meninggalkan ibadahmu kepada tuhan-tuhanmu yaitu berhala-berhala. Jangan kalian tinggalkan peribadatan untuk Wadd (berhala Bani Kalab), Wusa’ (berhala Bani Hudzail), Yaghuts (berhala Bani Rhuthaif di negeri saba dan madhaj), Ya’uq (berhala Bani Hamdan) dan Nasr (berhala Bani Himyar yang masih keluarga Kala’) karena mereka adalah berhala-berhala (yang disembah) leluhur kalian. Khususkanlah untuk mengingat mereka setelah kalian mengingat berhala-berhala yang umum”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,\"Jangan sekali-kali kalian meninggalkan tuhan-tuhan kalian} janganlah meninggalkan penyembahan kepada tuhan kalian {dan jangan sekali-kali meninggalkan Wadd, Suwā‘, Yagūṡ, Ya‘ūq, dan Nasr.’} ini adalah nama-nama berhala yang mereka sembah selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Nabi Nuh berkata” seraya mengadu pada Rabbnya bahwa perkataan, nasihat, dan peringatan ini tidak berguna bagi mereka, “Ya Rabbku, sesungguhnya mereka telah mendurhakaiku,” dalam perintahku, “dan (mereka justru) mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka.” Yakni, mereka mendurhakai seorang rasul yang memberi nasihat dan petunjuk pada kebaikan, tapi mereka justru mengikuti golongan besar dan para pembesar yang hanya semakin membuat harta dan anak-anak mereka rugi (binasa dan tidak mendapatkan keuntungan), lantas bagaimana dengan orang yang mereka patuhi dan taati itu sendiri? “Dan melakukan tipu daya yang amat besar,” yaitu tipu daya besar dan hebat dalam menentang kebenaran. Para pembesar kaum berkata menyeru pada kesyirikan dan menghiasinya, “jangan sekali-kali kamu meninggalkan (penyembahan) terhadap sesembahan-sesembahan kamu.” Mereka menyeru sesama mereka untuk bersikap fanatis di atas kesyirikan dan agar mereka tidak meninggalkan kebiasaan nenek moyang mereka terdahulu, mereka menentukan tuhan-tuhan mereka seraya berkata, “Dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwa,’ yaghuts, ya’uq dan nasr.” Ini sebenarnya adalah nama-nama orang shalih, dan ketika mereka meninggal dunia, setan menghiasi kaum mereka agar membuat patung mereka demi menyulut semangat mereka untuk beribadah ketika melihat patung-patung itu sesuai anggapan mereka. Masa pun berlalu dan datanglah generasi lain, setan berkata kepada mereka, “Para pendahulu kalian menyembah mereka dan menjadikan mereka sebagai perantara, dengan mereka para pendahulu kalian meminta hujan, mereka menyembah patung-patung itu.” Karena itulah, para pemimpin mereka berpesan untuk tidak meninggalkan penyembahan berhala-berhala ini, “dan sesudahnya mereka telah menyesatkan kebanyakan (manusia),” yakni para pembesar dan pemimpin menyesatkan dengan seruan mereka pada kebanyakan orang. “Dan janganlah Engkau tambahkan bagi orang-orang zhalim itu selain kesesatan,” yakni, andaikan kesesatan mereka pada saat aku menyeru mereka pada kebenaran ada kebaikannya, tapi seruan para pembesar itu hanya semakin menyesatkan. Tidak tersisa satu tempat pun untuk keselamatan dan kebaikan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 23: Berkata dedengkot dan pemimpin mereka dengan maksud supaya diikuti : Kalian jangan meninggalkan sesembahan/tuhan-tuhan kalian dan jangan biarkan Nuh berkuasa atas kalian; Jangan kalian tinggalkan beribadah kepada wad, yaguts, yauqa, dan nasr. Ini semua adalah nama-nama orang shalih; Ketika mereka semua mati, setan menghiasi dengan membisikkan kepada mereka agar membuat sesuatu yang menggambarkan mereka dengan permisalan yang sama dengan mereka, agar supaya mengingat mereka dan meniru semangat ibadah orang shalih tersebut. Kemudian seiring berlalunya zaman, dan berganti masa ke masa, maka iblis laknatullah menyeru mereka untuk beribadah kepada selain Allah. Berkata manusia dari masa ke masa : Sungguh bapak moyang kalian tidaklah menjadikan bentuk sedemikian rupa, tidak juga menjadikan dengan bentuk yang semisal ini kecuali untuk mengibadahinya. Maka mereka semua taat dan beribadah kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni para pemimpin itu. Kepada orang-orang yang berada di bawah mereka (rakyat jelata) mengajak mereka berbuat syirk dan membuat indah perbuatan itu. Wadd, Suwa', Yaghuts, Ya'uq dan Nasr adalah nama-nama berhala yang terbesar pada kabilah-kabilah kaum Nuh yang semula nama-nama orang saleh. Ketika mereka meninggal, maka kaum Nuh merasa kehilangan mereka, sehingga untuk mengenang mereka dibuatlah patung-patung dengan nama-nama mereka mengikuti bisikan setan. Ketika itu, patung-patung tersebut belum disembah, maka ketika mereka telah wafat dan diganti oleh generasi selanjutnya dan ilmu agama pun telah hilang, setan pun membisikkan kepada generasi setelah mereka untuk menyembah patung dan menghias perbuatan itu, mulailah mereka menyembahnya. Oleh karena itulah, mengapa Islam melarang membuat patung meskipun tidak disembah, karena bisa saja suatu saat patung-patung itu disembah di samping sebagai sarana kepada perbuatan syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 23",
    "description": "22-23. Dan mereka para pemuka masyarakat itu melakukan tipu daya yang sangat besar untuk menghalangiku menyampaikan dakwah. Dan mere-ka memprovokasi masyarakat dengan berkata, jangan sekali-kali kamu meninggalkan penyembahan tuhan-tuhan kamu dan untuk menegaskan larangannya itu mereka menyebut satu demi satu tuhan-tuhan yang mereka sembah sambil lebih tegas lagi menyatakan jangan pula sekali-kali kamu meninggalkan penyembahan wadd, dan jangan pula suwa', yag'', ya''q dan nasr. Itu semua adalah nama-nama berhala yang terbesar pada kabilah-kabilah kaum nuh, yang semula nama-nama orang saleh. 24. Dan sungguh, mereka dengan menggunakan berhala-berhala itu telah menyesatkan banyak orang serta menyimpangkan dari fitrah kesucian mereka. Dan janganlah engkau tambahkan bagi orang-orang yang zalim sudah mendarah daging itu selain kesesatan."
  }
]