[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-25. Nuh berkata, “Wahai Tuhanku, sesungguhnya kaumku mendurhakaiku dan mendustakanku dengan sangat, orang-orang lemah dari mereka mengikuti para pemimpin yang sesat yang harta dan anak-anak mereka hanya menambah kesesatan bagi mereka di dunia dan hukuman di akhirat. Para pemimpin kesesatan itu melakukan makar besar terhadap orang-orang lemah yang mengikuti mereka. Mereka berkata kepada orang-orang lemah, ‘Jangan meninggalkan tuhan-tuhan kalian untuk menyembah Allah semata yang diserukan oleh Nuh. Jangan meninggalkan Wadd, Suwa’, Yaghuts,Yau’uq dan Nasr’.” Dan itu adalah nama berhala-berhala mereka yang mereka sembah selain Allaah. Mereka aslinya adalah nama orang-orang shalih, saat orang-orang shalih tersebut wafat, setan membisikkan kepada kaum mereka agar membuar relief-relief dan patung-patung, agar hal itu membuat mereka giat, dalam anggapan mereka, untuk melakukan ketaatan dengan melihat mereka. Manakala orang-orang tersebut telah meninggal dunia, masa berlalu, dan mereka digantikan oleh generasi sesudah mereka, maka setan datang membisikkan kepada mereka bahwa para leluhur mereka menyembah relief-relief dan patung-patung itu dan menjadikan mereka sebagai wasilah. Ini adalah salah satu hikmah diharamkannya patung dan mendirikan bangunan kubah di atas kuburan, karena dengan berlalunya masa, ia bisa disembah oleh orang-orang bodoh. Para pemimpin itu telah menyesatkan banyak orang melalui jalan-jalan kesesatan dan penyimpangan yang mereka perindah. Kemudian Nuh berkata, “Wahai TUhan kami, jangan menambahkan kepada orang-orang yang menzhalimi diri mereka dengan kekafiran dan penentangan kecuali semakin jauh dari kebenaran.” Disebabkan oleh dosa-dosa, kekafiran dan pelanggaran mereka, mereka ditenggelamkan oleh banjir besar, dan sesudah mereka ditenggelamkan, mereka dimasukkan kedalam api neraka yang berkobar besar dan menyala-nyala, mereka tidak mendapatkan siapapun selain Allah yang dapat menolong mereka atau melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Mereka telah menyesatkan manusia yang banyak dengan berhala-berhala mereka ini. Dan janganlah Engkau -wahai Rabb- menambah untuk orang-orang yang telah berbuat aniaya terhadap diri mereka sendiri dengan terus menerus dalam kekufuran dan maksiat kecuali kesesatan dari kebenaran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Arahan para pembesar kaum Nabi Nuh kepada para pengikutnya agar menyembah patung-patung telah menjadi sebab kesesatan banyak orang dari mereka, karena kebiasaan manusia adalah mengikuti arahan dan perintah dari para pembesar mereka. Perbuatan para pembesar kaum Nabi Nuh dan para pengikut mereka ini telah mendorong Nabi Nuh untuk berdoa bagi keburukan mereka; yaitu agar Allah menambah kesesatan mereka, dan mengazab mereka semua setelah mereka bersikeras untuk tetap di atas kekafiran dan kesyirikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَقَدْ أَضَلُّوا۟ كَثِيرًا ۖ( Dan sesudahnya mereka menyesatkan kebanyakan (manusia)) Yakni para pemimpin dan pembesar mereka telah menyesatkan banyak orang. Pendapat lain mengatakan: yang dimaksud adalah patung-patung itu telah menjadikan banyak orang tersesat. وَلَا تَزِدِ الظّٰلِمِينَ إِلَّا ضَلٰلًا(dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kesesatan) Yakni melainkan kerugian. Pendapat lain mengatakan: yakni melainkan menambah kesesatan dalam tipu daya mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Sungguh para pemimpin itu menyesatkan pengikut-pengikutnya dalam kesesatan yang besar dengan memerintahkan mereka untuk menyembah berhala. Peribadatan mereka itu tidak menambahkan apapun kepada orang-orang musyrik kecuali hanya kebimbangan, jauh dari kebenaran, dan kerugian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka telah menyesatkan banyak orang. Janganlah menambahkan bagi orang-orang zalim itu selain kesesatan.”} jauh dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Nabi Nuh berkata” seraya mengadu pada Rabbnya bahwa perkataan, nasihat, dan peringatan ini tidak berguna bagi mereka, “Ya Rabbku, sesungguhnya mereka telah mendurhakaiku,” dalam perintahku, “dan (mereka justru) mengikuti orang-orang yang harta dan anak-anaknya tidak menambah kepadanya melainkan kerugian belaka.” Yakni, mereka mendurhakai seorang rasul yang memberi nasihat dan petunjuk pada kebaikan, tapi mereka justru mengikuti golongan besar dan para pembesar yang hanya semakin membuat harta dan anak-anak mereka rugi (binasa dan tidak mendapatkan keuntungan), lantas bagaimana dengan orang yang mereka patuhi dan taati itu sendiri? “Dan melakukan tipu daya yang amat besar,” yaitu tipu daya besar dan hebat dalam menentang kebenaran. Para pembesar kaum berkata menyeru pada kesyirikan dan menghiasinya, “jangan sekali-kali kamu meninggalkan (penyembahan) terhadap sesembahan-sesembahan kamu.” Mereka menyeru sesama mereka untuk bersikap fanatis di atas kesyirikan dan agar mereka tidak meninggalkan kebiasaan nenek moyang mereka terdahulu, mereka menentukan tuhan-tuhan mereka seraya berkata, “Dan jangan pula sekali-kali kamu meninggalkan (penyembahan) wadd, dan jangan pula suwa,’ yaghuts, ya’uq dan nasr.” Ini sebenarnya adalah nama-nama orang shalih, dan ketika mereka meninggal dunia, setan menghiasi kaum mereka agar membuat patung mereka demi menyulut semangat mereka untuk beribadah ketika melihat patung-patung itu sesuai anggapan mereka. Masa pun berlalu dan datanglah generasi lain, setan berkata kepada mereka, “Para pendahulu kalian menyembah mereka dan menjadikan mereka sebagai perantara, dengan mereka para pendahulu kalian meminta hujan, mereka menyembah patung-patung itu.” Karena itulah, para pemimpin mereka berpesan untuk tidak meninggalkan penyembahan berhala-berhala ini, “dan sesudahnya mereka telah menyesatkan kebanyakan (manusia),” yakni para pembesar dan pemimpin menyesatkan dengan seruan mereka pada kebanyakan orang. “Dan janganlah Engkau tambahkan bagi orang-orang zhalim itu selain kesesatan,” yakni, andaikan kesesatan mereka pada saat aku menyeru mereka pada kebenaran ada kebaikannya, tapi seruan para pembesar itu hanya semakin menyesatkan. Tidak tersisa satu tempat pun untuk keselamatan dan kebaikan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 24: Berkata Nuh kepada Rabbnya : Sungguh telah sesat pemimpin-pemimpin mereka, dan manusia yang mengikutinya sangatlah banyak serta tujuan mereka adalah memalingkan dari tauhid dan keimanan kepada Allah. Dan janganlah Engkau tambah kepada mereka orang-orang dzalim dan melampaui batas dari batasan Mu dengan menyekutukanmu dan berpaling dari jalanmu kecuali kesesatan yang datang setelah kebenaran. Dan Nuh telah berdoa atas mereka setelah Allah berkata : لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ ءَامَنَ, yang artinya : Bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja). {Hud : 36}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan perintah mereka (para pemimpin) menyembah patung-patung itu. Nabi Nuh ‘alaihis salam mendoakan keburukan untuk mereka adalah karena Beliau telah mendapatkan wahyu bahwa kaumnya tidak ada lagi yang beriman kepada Beliau selain yang telah beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 24",
    "description": "Dan sungguh, mereka dengan menggunakan berhala-berhala itu telah menyesatkan banyak orang serta menyimpangkan dari fitrah kesucian mereka. Dan janganlah engkau tambahkan bagi orang-orang yang zalim sudah mendarah daging itu selain kesesatan. 25. Allah menyambut doa nabi nuh dan menjelaskan mengapa mereka disiksa. Disebabkan oleh kesalahan-kesalahan mereka, maka mereka ditenggelamkan oleh banjir besar yang dikirim Allah kepada para pendurhaka itu, lalu segera setelah kiamat datang mereka dimasukkan ke neraka, maka mereka tidak mendapat penolong selain Allah."
  }
]