[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-25. Nuh berkata, “Wahai Tuhanku, sesungguhnya kaumku mendurhakaiku dan mendustakanku dengan sangat, orang-orang lemah dari mereka mengikuti para pemimpin yang sesat yang harta dan anak-anak mereka hanya menambah kesesatan bagi mereka di dunia dan hukuman di akhirat. Para pemimpin kesesatan itu melakukan makar besar terhadap orang-orang lemah yang mengikuti mereka. Mereka berkata kepada orang-orang lemah, ‘Jangan meninggalkan tuhan-tuhan kalian untuk menyembah Allah semata yang diserukan oleh Nuh. Jangan meninggalkan Wadd, Suwa’, Yaghuts,Yau’uq dan Nasr’.” Dan itu adalah nama berhala-berhala mereka yang mereka sembah selain Allaah. Mereka aslinya adalah nama orang-orang shalih, saat orang-orang shalih tersebut wafat, setan membisikkan kepada kaum mereka agar membuar relief-relief dan patung-patung, agar hal itu membuat mereka giat, dalam anggapan mereka, untuk melakukan ketaatan dengan melihat mereka. Manakala orang-orang tersebut telah meninggal dunia, masa berlalu, dan mereka digantikan oleh generasi sesudah mereka, maka setan datang membisikkan kepada mereka bahwa para leluhur mereka menyembah relief-relief dan patung-patung itu dan menjadikan mereka sebagai wasilah. Ini adalah salah satu hikmah diharamkannya patung dan mendirikan bangunan kubah di atas kuburan, karena dengan berlalunya masa, ia bisa disembah oleh orang-orang bodoh. Para pemimpin itu telah menyesatkan banyak orang melalui jalan-jalan kesesatan dan penyimpangan yang mereka perindah. Kemudian Nuh berkata, “Wahai TUhan kami, jangan menambahkan kepada orang-orang yang menzhalimi diri mereka dengan kekafiran dan penentangan kecuali semakin jauh dari kebenaran.” Disebabkan oleh dosa-dosa, kekafiran dan pelanggaran mereka, mereka ditenggelamkan oleh banjir besar, dan sesudah mereka ditenggelamkan, mereka dimasukkan kedalam api neraka yang berkobar besar dan menyala-nyala, mereka tidak mendapatkan siapapun selain Allah yang dapat menolong mereka atau melindungi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Disebabkan karena kesalahan yang telah mereka lakukan, mereka ditenggelamkan dengan topan di dunia dan dimasukkan ke dalam Neraka setelah kematian mereka secara langsung, dan mereka tidak mendapati penolong-penolong selain Allah yang mampu menolong mereka dari tenggelam dan Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dan hasil dari kekafiran, penentangan, dan kebebalan kaum Nabi Nuh di atas kesesatan adalah menjadikan mereka semua tenggelam pada banjir bandang, dan pada hari kiamat mereka akan di azab dengan azab neraka sebagai balasan atas perbuatan yang mereka lakukan. Mereka tidak akan mendapat pertolongan dari tuhan-tuhan mereka dan makhluk lainnya agar dapat selamat dari azab di dunia ketika mereka ditenggelamkan Allah atau dari azab di akhirat. Tuhan-tuhan itu tidak akan bermanfaat sedikitpun bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. مِّمَّا خَطِيٓـٰٔتِهِمْ أُغْرِقُوا۟ (Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan) Yakni karena kesalahan-kesalahan itu mereka ditenggelamkan dengan banjir bandang. فَأُدْخِلُوا۟ نَارًا (lalu dimasukkan ke neraka) Yakni setelah mereka ditenggelamkan, yaitu neraka di akhirat. Pendapat lain mengatakan: yakni azab kubur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Akibat dosa-dosa mereka yang sangat banyak, mereka ditenggelamkan di dunia melalui banjir bandang. Di akhirat mereka dimasukkan ke dalam neraka Jahanam. Mereka tidak menemukan penolong pun selain Allah yang dapat melindungi mereka dari azab Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Karena kesalahan-kesalahan mereka} karena dosa-dosa mereka {mereka ditenggelamkan, lalu dimasukkan ke neraka. Mereka tidak mendapat penolong pun selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Karena itu Allah mengingatkan pembangkangan dan hukuman dunia serta akhirat mereka seraya berfirman, “Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan,” dalam lautan yang mengitari mereka, “lalu dimasukkan ke neraka,” artinya jasad mereka lenyap dalam lautan sedangkan ruh mereka berada dalam neraka. Semua itu disebabkan oleh kesalahan-kesalahan yang telah diperingatkan oleh nabi mereka dan telah diberitahukan akan keburukannya, tapi mereka menolak apa yang disampaikan hingga datanglah siksaan yang menimpa mereka. “Maka mereka tidak mendapat penolong-penolong bagi mereka selain dari Allah,” yang dapat menolong mereka pada saat hal pedih menimpa mereka dan tidak ada seorang pun yang bisa menentang Qadha’ dan Qadar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 25: Allah mengabarkan dengan sebab dosanya kaum Nuh, pengingkaran mereka kepada Nabinya, dan keras kepalanya mereka untuk beribadah kepada selain Allah serta menyekutukan-Nya; Maka Allah menenggelamkan mereka dengan banjir bandang dimana tidak tersisa sedikitpun di antara mereka dan tidak juga dikecualikan dari mereka satupun. Kemudian ketika datang hari kiamat mereka akan dimasukkan ke dalam nereka jahannam, mereka diadzab di dalamnya. mereka mengelami penderitaan dengan sebab panas apinya. Tidaklah keadaan mereka mengharuskan turunnya adzab, dan tidak ada penolong yang menolong mereka, tidak juga membantu dan tidak juga menghalang-halangi dari kondisi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu telah diberi peringatan tetapi malah ditolaknya. Maksudnya, berhala-berhala mereka tidak dapat memberi pertolongan kepada mereka. Hanya Allah yang dapat menolong mereka, tetapi karena mereka menyembah berhala, maka Allah tidak memberi pertolongan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 25",
    "description": "Allah menyambut doa nabi nuh dan menjelaskan mengapa mereka disiksa. Disebabkan oleh kesalahan-kesalahan mereka, maka mereka ditenggelamkan oleh banjir besar yang dikirim Allah kepada para pendurhaka itu, lalu segera setelah kiamat datang mereka dimasukkan ke neraka, maka mereka tidak mendapat penolong selain Allah. 26. Ayat ini merekam kembali doa nabi nuh. Dan nuh berkata, 'ya tuhanku, janganlah engkau biarkan, seorang pun di antara orang-orang kafir yang sudah mendarah daging dan mantap kekafirannya itu tinggal di atas bumi."
  }
]