[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-28. Nuh berkata sesudah merasa pesimis terhadap kaumnya, “Wahai Tuhanku, janganlah Engkau biarkan seorang kafir pun hidup di muka bumi ini bergerak dan beraktivitas. Karena bila Engkau membiarkan mereka, niscaya mereka akan menyesatkan hamba-hambaMu yang beriman kepadaMu dari jalan kebenaran, tidak hadir dari tulang sulbi dan rahim mereka kecuali orang yang menyimpang dari kebenaran, serta sangat kuat penentangan dan kekafirannya kepadaMu. Wahai Tuhanku, ampunilah aku, kedua orangtuaku, orang yang masuk ke rumahku dalam keadaan beriman, dan orang-orang beriman laki-laki dan perempuan, serta janganlah Engkau tambahkan kepada orang-orang kafir itu kecuali kebinasaan dan kerugian dunia dan akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Tatkala Allah mengabarkan kepada Nuh bahwa tidak ada lagi kaumnya yang akan beriman kecuali yang telah beriman sebelumnya, maka Nuh berkata, “Wahai Rabbku, janganlah Engkau sisakan di atas bumi ini seorang pun dari orang-orang kafir yang bisa bepergian atau bergerak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-28. Nabi Nuh berdoa agar kaumnya dibinasakan tanpa tersisa setelah dia merasa putus asa mengajak mereka beriman, dan setelah Allah berfirman kepadanya, “Tidak akan ada lagi yang akan beriman dari kaummu melainkan yang telah beriman” [QS. Hud: 36]. Sehingga Nabi Nuh memohon kepada Allah agar membinasakan kaumnya yang kafir itu tanpa ada yang tersisa, sebab jika masih ada yang tersisa maka mereka akan tetap dalam kekafiran dan kesesatan, dan akan terus menyesatkan keturunan yang ada setelah mereka. Kemudian Nabi Nuh menutup doanya dengan permohonan ampun bagi dirinya, kedua orangtuanya, orang yang memasuki rumahnya dalam keadaan beriman, dan bagi seluruh laki-laki dan perempuan yang beriman. Dan Nabi Nuh kembali berdoa agar orang-orang kafir dan zalim benar-benar dibinasakan dan mendapat kerugian sepenuhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَقَالَ نُوحٌ رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكٰفِرِينَ دَيَّارًا (Nuh berkata: “Ya Tuhanku, janganlah Engkau biarkan seorangpun di antara orang-orang kafir itu tinggal di atas bumi) Yakni setelah Nuh kehilangan harapan terhadap keimanan mereka, maka ia mendoakan mereka agar mendapat azab setelah diwahyukan kepadanya: أنه لن يؤمن من قومك إلا من قد آمن “bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja).” (Huud: 36) Maka Allah mengabulkan doanya, sehingga Allah menenggelamkan mereka. Makna (الديار) yakni orang-orang yang tinggal di rumah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Nuh berkata setelah putus asa tentang keimanan kaumnya dan wahyu yang diturunkan kepadanya: “Wahai Tuhan, Jangan Engkau sisakan satu pun orang kafir itu di bumi”. Ad-Dayar adalah orang yang tinggal di rumah atau seseorang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nuh berkata,“Ya Tuhanku, janganlah Engkau membiarkan} janganlah membiarkan {seorang pun di antara orang-orang kafir itu tinggal di atas bumi} satu orang pun yang tinggal dan bergerak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “Nabi Nuh berkata, ‘Ya Rabbku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi,” dengan bebas berjalan di muka bumi. Nabi Nuh menyebutkan sebabnya, “Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hambaMu, dan mereka tidak akan melahirkan selain anak yang berbuat maksiat lagi sangat kafir,” yakni keberadaan mereka hanya membuat mereka rusak bagi mereka sendiri dan bagi yang lain. Kenyataan bahwa Nabi Nuh berdo’a demikian, meski Nabi Nuh sendiri berbaur dengan kaumnya dan berinteraksi dengan akhlak mereka, adalah karena resiko hal itu dapat diketahui. Karena itu Allah mengabulkan permintaan Nabi Nuh dan menenggelamkan mereka semua dan menyelamatkan Nabi Nuh serta orang-orang yang beriman bersamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 26: 26-27. Setelah Nuh berputus asa atas keimanan mereka dan hilangnya harapan karena sebab kekufuran, maka Nuh mendoakan mereka dengan kebinasaan. Nuh berkata : Wahai Rabbku janganlah engkau tinggalkan seorang pun kafir di muka bumi ini dalam keadaan hidup; Jika Engkau biarkan mereka hidup, mereka akan lebih menyesatkan hambamu yang mentauhidkan Engkau dan beriman kepadamu, dan tidaklah mereka kecuali melahirkan kekafiran yang semisal mereka. Ia (Nuh) telah berdoa untuk mereka (sebagaimana telah lalu) setelah Allah berfirman : لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ ءَامَنَ, artinya : bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja). {Hud : 36}. Ketika berdakwah dan setelah Nuh berdakwah kepada mereka dengan masa yang panjang, dan setelah Allah katakan tidak akan beriman dari kaumnya kecuali dengan jumlah yang sedikit, maka benarlah Nuh berputus asa. Karena Allah tidaklah meninggalkan seorangpun dari kaumnya yang mau mendekatkan diri kepada iman kepada Allah dan menjawab (dakwah) Nuh ? Zaman untuk Nuh berdakwah sangatlah panjang, tidakkah hal ini menjadikan Nuh berputus asa ?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 26",
    "description": "Ayat ini merekam kembali doa nabi nuh. Dan nuh berkata, 'ya tuhanku, janganlah engkau biarkan, seorang pun di antara orang-orang kafir yang sudah mendarah daging dan mantap kekafirannya itu tinggal di atas bumi. 27. Sesungguhnya jika engkau biarkan mereka tinggal hidup di bumi, niscaya mereka akan menyesatkan hamba-hamba-Mu yang taat kepada-Mu, dan jika engkau biarkan mereka tinggal di bumi mereka hanya akan melahirkan anak-anak yang jahat yaitu selalu berbuat maksiat dan tidak tahu bersyukur kepada-Mu."
  }
]