[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-28. Nuh berkata sesudah merasa pesimis terhadap kaumnya, “Wahai Tuhanku, janganlah Engkau biarkan seorang kafir pun hidup di muka bumi ini bergerak dan beraktivitas. Karena bila Engkau membiarkan mereka, niscaya mereka akan menyesatkan hamba-hambaMu yang beriman kepadaMu dari jalan kebenaran, tidak hadir dari tulang sulbi dan rahim mereka kecuali orang yang menyimpang dari kebenaran, serta sangat kuat penentangan dan kekafirannya kepadaMu. Wahai Tuhanku, ampunilah aku, kedua orangtuaku, orang yang masuk ke rumahku dalam keadaan beriman, dan orang-orang beriman laki-laki dan perempuan, serta janganlah Engkau tambahkan kepada orang-orang kafir itu kecuali kebinasaan dan kerugian dunia dan akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya Engkau -wahai Rabb kami- jika membiarkan dan menangguhkan mereka, maka mereka akan menyesatkan hamba-hamba-Mu yang beriman, dan mereka tidak melahirkan kecuali pelaku maksiat yang tidak menaati-Mu, dan yang sangat ingkar, tidak mensyukuri nikmat-nikmat-Mu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا۟ عِبَادَكَ (Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu) Menyesatkan dari jalan yang benar. وَلَا يَلِدُوٓا۟ إِلَّا فَاجِرًا(dan mereka tidak akan melahirkan selain anak yang berbuat maksiat) Yakni selain orang yang enggan mentaati-Mu. كَفَّارًا(lagi sangat kafir) Yakni sangat ingkar terhadap kenikmatan yang Engkau berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Seseungguhnya jika Engkau sisakan orang-orang kafir itu untuk hidup, maka mereka akan menyesatkan hamba-hambaMu dari jalan kebenaran dan keimanan tentang keesaanMu. Mereka tidak melahirkan keturunan kecuali keturunan yang fasik bukan keturunan yang taat. Generasi yang sangat mengingkari wujudMu, keesaanMu dan nikmatMu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya jika Engkau membiarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hambaMu. Mereka tidak melahirkan melainkan anak-anak yang jahat dan sangat ingkar} sangat ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26-27. “Nabi Nuh berkata, ‘Ya Rabbku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi,” dengan bebas berjalan di muka bumi. Nabi Nuh menyebutkan sebabnya, “Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hambaMu, dan mereka tidak akan melahirkan selain anak yang berbuat maksiat lagi sangat kafir,” yakni keberadaan mereka hanya membuat mereka rusak bagi mereka sendiri dan bagi yang lain. Kenyataan bahwa Nabi Nuh berdo’a demikian, meski Nabi Nuh sendiri berbaur dengan kaumnya dan berinteraksi dengan akhlak mereka, adalah karena resiko hal itu dapat diketahui. Karena itu Allah mengabulkan permintaan Nabi Nuh dan menenggelamkan mereka semua dan menyelamatkan Nabi Nuh serta orang-orang yang beriman bersamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 27: 26-27. Setelah Nuh berputus asa atas keimanan mereka dan hilangnya harapan karena sebab kekufuran, maka Nuh mendoakan mereka dengan kebinasaan. Nuh berkata : Wahai Rabbku janganlah engkau tinggalkan seorang pun kafir di muka bumi ini dalam keadaan hidup; Jika Engkau biarkan mereka hidup, mereka akan lebih menyesatkan hambamu yang mentauhidkan Engkau dan beriman kepadamu, dan tidaklah mereka kecuali melahirkan kekafiran yang semisal mereka. Ia (Nuh) telah berdoa untuk mereka (sebagaimana telah lalu) setelah Allah berfirman : لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ ءَامَنَ, artinya : bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja). {Hud : 36}. Ketika berdakwah dan setelah Nuh berdakwah kepada mereka dengan masa yang panjang, dan setelah Allah katakan tidak akan beriman dari kaumnya kecuali dengan jumlah yang sedikit, maka benarlah Nuh berputus asa. Karena Allah tidaklah meninggalkan seorangpun dari kaumnya yang mau mendekatkan diri kepada iman kepada Allah dan menjawab (dakwah) Nuh ? Zaman untuk Nuh berdakwah sangatlah panjang, tidakkah hal ini menjadikan Nuh berputus asa ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tetap tinggalnya mereka di bumi hanyalah menambah mafsadat (kerusakan) saja. Nabi Nuh ‘alaihis salam mengatakan demikian karena Beliau telah mendakwahi mereka sekian lama dan mengetahui keadaan dan akhlak mereka, sehingga Beliau dapat menyimpulkan demikian. Maka Allah Subhaanahu wa Ta'aala mengabulkan doa Beliau, Dia menenggelamkan mereka semua dan menyelamatkan Nuh ‘alaihis salam dan orang-orang yang mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 27",
    "description": "Sesungguhnya jika engkau biarkan mereka tinggal hidup di bumi, niscaya mereka akan menyesatkan hamba-hamba-Mu yang taat kepada-Mu, dan jika engkau biarkan mereka tinggal di bumi mereka hanya akan melahirkan anak-anak yang jahat yaitu selalu berbuat maksiat dan tidak tahu bersyukur kepada-Mu. 28. Setelah doa untuk mereka yang durhaka, kini nabi nuh, berdoa untuk yang taat kepada Allah. Ya tuhanku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan dan janganlah engkau tambahkan untuk mereka kecuali kebahagiaan. Dan janganlah engkau tambahkan bagi orang-orang yang zalim yang mantap kezalimannya itu selain kehancuran. '."
  }
]