[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya jika kalian melaksanakan hal itu niscaya Allah mengampuni dosa-dosa kalian yang tidak berhubungan dengan hak-hak manusia, dan Allah memanjangkan umur umat kalian di kehidupan dunia hingga waktu tertentu yang hanya diketahui oleh Allah, sehingga kalian bisa memakmurkan bumi ini jika kalian istikamah dalam hal ini. Sesungguhnya kematian itu jika telah datang tidak akan bisa ditunda. Jika kalian mengetahui tentulah kalian akan bersegera beriman kepada Allah dan bertobat dari kesyirikan dan kesesatan yang telah kalian lakukan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Nabi Nuh menyampaikan kepada kaumnya, jika mereka mentaatinya dan beriman kepada Allah, maka Allah akan mengampuni dosa-dosa mereka yang telah mereka lakukan sebelum beriman, memberi keberkahan pada umur mereka, dan menjauhkan dari mereka azab yang turun kepada orang-orang kafir. Dan jika telah datang waktu kematian mereka, maka ajal itu tidak akan ditunda, karena itu telah ditentukan dalam ilmu Allah, dan ditetapkan bagi seluruh makhluk; maka barangsiapa yang mengetahui hal ini, maka dia akan segera beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. يَغْفِرْ لَكُم مِّن ذُنُوبِكُمْ (niscaya Allah akan mengampuni sebagian dosa-dosamu) Yakni sebagian dosa kalian, yaitu dosa yang kalian lakukan sebelum kalian menerima dakwah Nuh dan mentaatinya وَيُؤَخِّرْكُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ( dan menangguhkan kamu sampai kepada waktu yang ditentukan) Yakni mengangguhkan kematian kalian sampai waktu terlama yang ditetapkan Allah bagi kalian. Yakni Allah akan memanjangkan umur umat kalian di bumi selama kalian berada dalam ketaatan. إِنَّ أَجَلَ اللَّـهِ إِذَا جَآءَ لَا يُؤَخَّرُ (Sesungguhnya ketetapan Allah apabila telah datang tidak dapat ditangguhkan) Yakni apa yang telah ditetapkan Allah bagi kalian jika telah datang waktunya sedangkan kalian tetap dalam kekafiran tidak akan dapat ditunda, namun pasti akan terjadi; maka bergegaslah kalian beriman dan melakukan ketaatan. لَوْ كُنتُمْ تَعْلَمُونَ (kalau kamu mengetahui”) Yakni kalian akan mengetahui bahwa ketetapan Allah jika telah datang waktunya tidak akan dapat ditunda lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dia akan mengampuni sebagian dosa-dosa kalian dan pengampunan ini adalah hak Allah bukan hak hamba. Dia akan mengakhirkan umur kalian sampai waktu tertentu di sisi Allah dan tidak lebih dari itu. Karena sesungguhnya umat yang taat dan istiqamah itu memiliki umur panjang. Sesungguhnya ajal yang telah ditetapkan oleh Allah untuk kalian itu tidak akan ditangguhkan waktunya jika kalian masih dalam kekufuran, bahkan ajal kalian tidak pasti (bisa dipercepat). Jika saja kalian mengetahui hal itu, sungguh kalian akan bergegas untuk beriman. Maknanya adalah seakan-akan mereka cemas dengan kematian karena sangat sibuk dengan mencintai kehidupan dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Niscaya Dia akan mengampuni sebagian dosa-dosa kalian dan menangguhkan kalian sampai pada batas waktu yang ditentukan} waktu yang sudah di tentukan dalam ilmu Allah SWT {Sesungguhnya ketetapan Allah itu} ketetapan tentang kematian {apabila telah datang, maka tidak dapat ditunda. Seandainya kalia mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2-4. Nabi Nuh menunaikan tugas itu serta bersegera menunaikan perintah Allah seraya berkata, “Hai kaumku, sesungguhnya aku adalah pemberi peringatan yang menjelaskan kepadamu,” yakni, yang jelas ancamannya karena jelasnya apa-apa yang diperingatkan dan apa yang bisa menyelamatkan. Hal itu dijelaskan secara terang. Nabi Nuh memberitahu dan memerintahkan landasan hal itu pada kaumnya seraya berkata, “(yaitu) sembahlah olehmu Allah, dan bertakwalah kepadaNya,” dengan mengesakan Allah dalam ibadah, tauhid, jauh dari kesyirikan serta segala jalan dan perantaranya. Bila mereka bertakwa, maka Allah akan mengampuni dosa-dosa mereka, dan bila mereka diampuni, mereka akan mendapatkan keselamatan dari siksa dan mendapatkan keuntuntungan berupa pahala, “dan menangguhkan kamu sampai kepada waktu yang ditentukan,” yakni, Allah memberi kesenangan pada kalian di dunia ini dan mencegah kebinasaan dari kalian hingga waktu yang ditentukan. Batas waktu berada di dunia berdasarkan takdir dan kekuasaan Allah hingga waktu tertentu, bukan kesenangan abadi, sebab kematian adalah keniscayaan. Karena itu Allah berfirman, “Sesungguhnya ketetapan Allah apabila telah datang tidak dapat ditangguhkan, kalau kamu mengetahui,” sebagaimana kalian kufur kepada Allah dan menentang kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 4: 2-4. Allah mengabarkan bahwa Nuh bergegas mengerjakan perintah Allah dengan berkata (kepada kaumnya) : Wahai kaumku, aku adalah utusan yang membawa peringatan kepada kalian, (yaitu) menjelaskan adzab Allah jika kalian masih tetap atas kekafiran dan pengingkaran kalian, dan aku meminta kepada kalian agar kalian beribadah kepada Allah saja tanpa menyekutukan-Nya, dan agar supaya kalian takut akan adzab Allah. Kalian harus mentaatiku dalam apa yang Allah perintahkan kepadaku, untuk disampaikan kepada kalian; Maka, jika kalian mengikuti seruanku, maka Allah akan menghapuskan dosa-dosa kalian dan mengampuni kalian, dan Allah akan panjangkan waktu untuk kalian hidup, sampai batas yang Allah tentukan. Ketahuilah oleh kalian bahwa maut jika datang (kepada kalian) tidak akan dapat ditunda (diakhirkan) selamanya. Seandainya kalian mengetahui dengan yakin (tanpa ragu), sungguh kalian akan bersegera menjadi orang yang beriman dan taat kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka selamat dari azab dan mendapatkan pahala. Dengan mendapatkan nikmat dan tidak diazab. Yaitu ajal kematian. Untuk mengazab kamu jika tidak beriman. Seandainya kamu mengetahui, tentu kamu tidak akan kafir kepada Allah dan menentang kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 4",
    "description": "Kalau kamu lakukan itu semua niscaya dia akan mengampuni sebagian dosa-dosamu dan menangguhkan kamu yaitu dengan memanjangkan umurmu untuk kemaslahatanmu sampai pada batas waktu yang ditentukan. Sungguh, ketetapan Allah itu apabila telah datang tidak dapat ditunda sedikit pun, seandainya kamu mengetahui hal itu maka tentu kamu akan menjadi orang yang beriman. ' 5-6. Ajakan nabi nuh tidak disambut dengan baik oleh kaumnya, maka dia nabi nuh mengadu kepada Allah, 'ya tuhanku, sesungguhnya aku telah menyeru kaumku untuk beriman kepada-Mu dengan berbagai cara, dan itu kulakukan siang dan malam terus menerus, tetapi seruanku itu tidak menambah iman dan kebaikan mereka, justru mereka lari menjauh dari kebenaran."
  }
]