[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-10. Nuh berkata, “wahai Tuhanku, sesungguhnya aku telah mengajak kaumku untuk beriman kepadaMu malam dan siang, tetapi ajakanku kepada mereka agar beriman tidak membuat mereka kecuali berlari dan berpaling. Setiap kali aku mengajak mereka agar beriman kepadaMu, agar dosa-dosa mereka diampuni, mereka meletakkan jari-jari mereka di telinga-telinga mereka, agar mereka tidak mendengar dakwah kebenaran, mereka menutup wajah mereka dengan kain agar tidak melihatku, mereka tetap bersikukuh di atas kekafiran mereka, menyombongkan diri dan menolak iman dengan kesombongan yang besar. Kemudia aku mengajak mereka agar beriman secara terang-terangan, tidak bersembunyi. Kemudian aku mengumumkan dakwah dengan suara tinggi dalam satu kondisi dan memelankannya dalam kondisi lainnya. Aku berkata kepada kaumku, ‘Mintalah ampunan dari dosa-dosa kalian, sesungguhnya Allah Maha Pengampun bagi siapa yang bertaubat dari hamba-hambaNya dan kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Nuh berkata, “Wahai Rabbku, sesungguhnya aku telah mengajak kaumku untuk menyembah-Mu dan mentauhidkan-Mu siang dan malam dengan terus menerus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Ayat-ayat ini akan menjelaskan tentang dakwah Nabi Nuh kepada kaumnya yang dia sampaikan dengan berbagai cara: 5-6. Nabi Nuh bermunajat kepada Allah untuk mengadukan kaumnya dalam menyikapi dakwahnya: “Ya Tuhanku, aku telah mengajak kaumku siang dan malam agar mereka beriman; hal ini aku lakukan untuk mencari waktu yang tepat yang dapat mereka terima, akan tetapi mereka tetap menolak nasehat dan dakwahku; setiap kali aku menyeru mereka, maka mereka akan menjauh dan berpaling dariku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Nuh berkata: “Tuhanku, sesungguhnya aku telah mengajak kaumku untuk beriman secara terus menerus tanpa henti di siang dan malam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Ya Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-7. Mereka tidak memenuhi seruan Nabi Nuh dan tidak mau patuh terhadap perintah beliau. Maka Nabi Nuh mengadu pada Rabbnya, “Ya Rabbku, sesungguhnya aku telah menyeru kaumku malam dan siang, maka seruanku itu hanyalah menambah mereka lari (dari kebenaran),” yakni lari dan berpaling dari kebenaran, sehingga tidak ada gunanya menyeru mereka, karena manfaat dari seruan adalah agar seluruh atau sebagian maksudnya tercapai. “Dan sesungguhnya setiap kali aku menyeru mereka (kepada iman) agar Engkau mengampuni mereka,” yakni agar mereka mau merespon, dimana bila mereka menerima, Engkau ampuni mereka, dan seruan ini adalah murni demi kebaikan mereka, tapi mereka tetap saja berada dalam kebatilan dan lari kebenaran. “Mereka memasukkan jari-jari mereka ke dalam telinganya,” karena khawatir mendengarkan kata-kata yang diucapkan nabi mereka, Nabi Nuh . “Dan menutupkan bajunya (ke mukanya),” yaitu mereka menjadikannya sebagai penutup mereka demi menjauhi dan membenci kebenaran. “Dan mereka tetap (mengingkari)” dalam kekufuran dan keburukan mereka, “dan menyombongkan diri” di atas kebenaran “dengan sangat”, yakni keburukan mereka semakin bertambah sedangkan kebaikan mereka semakin jauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 5: 5-6. Berkata Nuh kepada Tuhannya : Sungguh aku wahai Tuhanku, ketika aku mendakwahkan kepada kaumku setiap saat; Aku tidak meninggalkan dakwahku kepada mereka malamnya maupun siangnya, bersamaan dengan itu pula tidak bertambah mereka dimana aku menyeru kepada mereka agar beriman dan mengikuti kebenaran kecuali aku hanya mendapati mereka lari dan menolak, serta semakin menjadi-jadi kekufuran atas mereka dan penentangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kaum Nuh ‘alaihis salam meskipun telah didakwahi berkali-kali, tetapi mereka tetap saja kafir dan tidak mau beriman sehingga setelah nyata bagi Nabi Nuh ‘alaihis salam bahwa mereka tidak akan beriman dan tidak akan tunduk kepada perintahnya, maka Beliau mengeluhkan kepada Allah Subhaanahu wa Ta'aala keadaan kaumnya. Yakni terus menerus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 5",
    "description": "5-6. Ajakan nabi nuh tidak disambut dengan baik oleh kaumnya, maka dia nabi nuh mengadu kepada Allah, 'ya tuhanku, sesungguhnya aku telah menyeru kaumku untuk beriman kepada-Mu dengan berbagai cara, dan itu kulakukan siang dan malam terus menerus, tetapi seruanku itu tidak menambah iman dan kebaikan mereka, justru mereka lari menjauh dari kebenaran"
  }
]