[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-10. Nuh berkata, “wahai Tuhanku, sesungguhnya aku telah mengajak kaumku untuk beriman kepadaMu malam dan siang, tetapi ajakanku kepada mereka agar beriman tidak membuat mereka kecuali berlari dan berpaling. Setiap kali aku mengajak mereka agar beriman kepadaMu, agar dosa-dosa mereka diampuni, mereka meletakkan jari-jari mereka di telinga-telinga mereka, agar mereka tidak mendengar dakwah kebenaran, mereka menutup wajah mereka dengan kain agar tidak melihatku, mereka tetap bersikukuh di atas kekafiran mereka, menyombongkan diri dan menolak iman dengan kesombongan yang besar. Kemudia aku mengajak mereka agar beriman secara terang-terangan, tidak bersembunyi. Kemudian aku mengumumkan dakwah dengan suara tinggi dalam satu kondisi dan memelankannya dalam kondisi lainnya. Aku berkata kepada kaumku, ‘Mintalah ampunan dari dosa-dosa kalian, sesungguhnya Allah Maha Pengampun bagi siapa yang bertaubat dari hamba-hambaNya dan kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan sesungguhnya setiap kali aku menyeru mereka kepada apa yang menyebabkan pengampunan dosa-dosa mereka, yaitu berupa ibadah hanya kepada-Mu semata, menaati-Mu dan menaati Rasul-Mu, mereka menutup telinga mereka dengan jari-jemari mereka agar mereka tidak mendengar seruanku dan mereka menutup wajah mereka dengan pakaiannya agar mereka tidak melihatku. Mereka terus melakukan kesyirikan, dan sombong tidak mau menerima apa yang aku serukan kepada mereka dan tidak mau tunduk padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Ketika aku menyeru mereka kepada keimanan, dan menjelaskan kepada mereka bahwa keimanan merupakan sebab datangnya ampunan, maka mereka sangat enggan mendengar perkataanku, bahkan mereka meletakkan jari-jari mereka di telinga agar tidak mendengar ucapanku, dan menutup kepala dan tubuh mereka dengan pakaian agar tidak melihatku; mereka terus melakukan hal ini karena enggan mentaati dan mengikutiku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِنِّى كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ(Dan sesungguhnya setiap kali aku menyeru mereka (kepada iman) agar Engkau mengampuni mereka) Yakni setiap aku menyeru mereka kepada hal yang dapat mendatangkan ampunan bagi mereka berupa keimanan dan ketaatan kepada-Mu. جَعَلُوٓا۟ أَصٰبِعَهُمْ فِىٓ ءَاذَانِهِمْ(mereka memasukkan anak jari mereka ke dalam telinganya) Agar mereka tidak mendengar suaraku. وَاسْتَغْشَوْا۟ ثِيَابَهُمْ(dan menutupkan bajunya) Yakni mereka menutup wajah mereka dengan baju agar tidak melihatku dan tidak mendengar perkataanku. وَأَصَرُّوا۟( dan mereka tetap (mengingkari)) Yakni tetap dalam kekafiran. وَاسْتَكْبَرُوا۟( dan menyombongkan diri) Sehigga enggan menerima kebenaran. اسْتِكْبَارًا(dengan sangat) Dengan kesombongan yang sangat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sesungguhnya setiap kali aku mengajak mereka untuk beriman dan taat, (aku berharap) agar Engkau mau mengampuni dosa dosa mereka. Telinga mereka ditutup ketika mendengar aku berdakwa. Mereka menutupi wajahnya menggunakan pakaian-pakaiannya agar tidak melihatku dan mendengarkan ucapanku. Mereka bersikeras dengan kekufuran. Mereka sangat enggan mengikutiku dan menerima ajakanku menuju kebenaran dan keimanan. Tabiat mereka ini sangat membenci dan enggan dengan keimanan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya setiap kali aku menyeru mereka agar Engkau mengampuni mereka, mereka memasukkan anak jari mereka ke telinga mereka dan menutupkan bajunya} dan menutupkan pakaian mereka ke wajah mereka, agar tidak melihatku {Mereka pun tetap (ingkar)} mereka tetap pada kekufuran {dan sangat menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-7. Mereka tidak memenuhi seruan Nabi Nuh dan tidak mau patuh terhadap perintah beliau. Maka Nabi Nuh mengadu pada Rabbnya, “Ya Rabbku, sesungguhnya aku telah menyeru kaumku malam dan siang, maka seruanku itu hanyalah menambah mereka lari (dari kebenaran),” yakni lari dan berpaling dari kebenaran, sehingga tidak ada gunanya menyeru mereka, karena manfaat dari seruan adalah agar seluruh atau sebagian maksudnya tercapai. “Dan sesungguhnya setiap kali aku menyeru mereka (kepada iman) agar Engkau mengampuni mereka,” yakni agar mereka mau merespon, dimana bila mereka menerima, Engkau ampuni mereka, dan seruan ini adalah murni demi kebaikan mereka, tapi mereka tetap saja berada dalam kebatilan dan lari kebenaran. “Mereka memasukkan jari-jari mereka ke dalam telinganya,” karena khawatir mendengarkan kata-kata yang diucapkan nabi mereka, Nabi Nuh . “Dan menutupkan bajunya (ke mukanya),” yaitu mereka menjadikannya sebagai penutup mereka demi menjauhi dan membenci kebenaran. “Dan mereka tetap (mengingkari)” dalam kekufuran dan keburukan mereka, “dan menyombongkan diri” di atas kebenaran “dengan sangat”, yakni keburukan mereka semakin bertambah sedangkan kebaikan mereka semakin jauh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 7: Berkata Nuh kepada Rabbnya : Sesungguhnya aku wahai Tuhanku, ketika aku berdakwah (kepada kaumku) agar mentauhidkanmu dan agar beriman kepadamu dimana itu semua adalah sebab agar mereka mendapat ampunan atas dosa-dosa mereka; Akan tetapi mereka malah memasukkan jarinya ke telingannya, agar tidak mendengar ucapanku. Dan mereka tutup wajah-wajah mereka dengan baju sebagai bentuk penolakan, dan semakin menjadi-jadi kekufuran, kesyirikan, kesombongan mereka dari menerima tauhid dengan kesombongan yang luar biasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jika mereka memenuhi seruan itu Engkau akan mengampuni mereka. Hal ini menunjukkan, bahwa maslahatnya adalah untuk mereka sendiri, tetapi mereka menolaknya dan tetap di atas kebatilan. Agar tidak mendengar kata-kata Nabi Nuh ‘alaihis salam. Agar mereka tidak melihat Nabi Nuh ‘alaihis salam karena benci kepada Beliau dan kepada apa yang Beliau serukan. Terhadap kebenaran, sehingga keburukan mereka semakin bertambah dan mereka semakin jauh dari kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 7",
    "description": "Dan sesungguhnya aku setiap kali menyeru mereka untuk beriman kepada ajaran-Mu agar engkau mengampuni mereka, mereka memasukkan anak jarinya ke telinganya karena enggan untuk mendengar bahkan membenci seruanku itu, dan menutupkan bajunya ke wajahnya sehingga tidak melihatku dan mereka tetap keras kepala mengingkari dan sangat menyombongkan diri sehingga tidak mempan dengan segala cara yang kulakukan. 8-9. Nabi nuh melanjutkan pengaduannya kepada Allah. Lalu sesungguhnya aku telah menyeru mereka dengan cara terang-terangan dengan suara yang jelas dan di hadapan umum. Kemudian pada kesempatan lain aku menyeru mereka dengan dua cara sekaligus yaitu secara terbuka dan dengan diam-diam."
  }
]