[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-10. Nuh berkata, “wahai Tuhanku, sesungguhnya aku telah mengajak kaumku untuk beriman kepadaMu malam dan siang, tetapi ajakanku kepada mereka agar beriman tidak membuat mereka kecuali berlari dan berpaling. Setiap kali aku mengajak mereka agar beriman kepadaMu, agar dosa-dosa mereka diampuni, mereka meletakkan jari-jari mereka di telinga-telinga mereka, agar mereka tidak mendengar dakwah kebenaran, mereka menutup wajah mereka dengan kain agar tidak melihatku, mereka tetap bersikukuh di atas kekafiran mereka, menyombongkan diri dan menolak iman dengan kesombongan yang besar. Kemudia aku mengajak mereka agar beriman secara terang-terangan, tidak bersembunyi. Kemudian aku mengumumkan dakwah dengan suara tinggi dalam satu kondisi dan memelankannya dalam kondisi lainnya. Aku berkata kepada kaumku, ‘Mintalah ampunan dari dosa-dosa kalian, sesungguhnya Allah Maha Pengampun bagi siapa yang bertaubat dari hamba-hambaNya dan kembali kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Kemudian aku meninggikan suaraku kepada mereka dalam menyeru mereka, dan aku juga menyeru mereka dengan sembunyi-sembunyi, aku seru mereka dengan suara yang lembut, berbagai macam cara aku pakai dalam seruanku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَأَسْرَرْتُ لَهُمْ (dan dengan diam-diam) Yakni merahasiakan dakwah itu. إِسْرَارًا(dengan sebenar-benarnya) Yakni dengan berdakwah kepada seorang demi seorang dengan mengajak mereka secara rahasia. Nuh berdakwah kepada mereka dengan berbagai cara. Pendapat lain mengatakan: yakni aku mendatangi rumah mereka satu persatu untuk berdakwah kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Aku menampakkan ajakanku dengan suaraku lalu aku (mencoba) berdakwah secara tertutup kepada mereka setekah sekian kalinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu aku menyeru mereka secara terbuka} meninggikan suaraku untuk menyeru {dan aku menyeru mereka diam-diam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. “Kemudian sesungguhnya aku telah menyeru mereka (kepada iman) dengan cara terang-terangan,” yakni didengar oleh mereka semua, “kemudian sesungguhnya aku (menyeru) mereka (lagi) dengan terang-terangan dan dengan diam-diam.” Semua ini adalah kegigihan dan ketulusan serta usaha yang dinilai bisa mengarahkan pada tujuan yang dimaksud."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Nuh ayat 9: 8-10. Nuh berkata : Kemudian sungguh aku wahai Tuhanku, berdakwah dengan terang-terangan kepada mereka untuk mengajak kepada tauhid dan aku jelaskan akan tauhid di hadapan mereka semuanya. Dan aku mendatangi mereka wahai Tuhanku dari segala pintu, berharap agar mendapatkan hasil dengan maksud agar mereka menerima tauhid. Aku juga terkadang mengumumkan dakwahku dengan suara lantang kepada mereka, dan dengan sembunyi-sembunyi dengan suara yang pelan (terkadang pula). Kemudian berkata Nuh kepada kaumnya : Kalian mintalah ampunan dari Rabb kalian atas kesyrikan, pengingkaran dan maksiat kalian yang terang-terangan. Dan ketahuilah bahwa Allah Maha Pengampun bagi hamba-Nya yang bertauhid, bertaubat dan beristighfar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah melakukan dakwah secara diam-diam kemudian secara terang-terangan namun tidak juga berhasil, maka Nabi Nuh ‘alaihis salam melakukan kedua cara itu sekaligus. Ini menunjukkan perhatian dan sikap nasihat dalam diri Beliau serta menggunakan berbagai cara agar mereka mau menerima dakwah Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Nuh Ayat 9",
    "description": "8-9. Nabi nuh melanjutkan pengaduannya kepada Allah. Lalu sesungguhnya aku telah menyeru mereka dengan cara terang-terangan dengan suara yang jelas dan di hadapan umum. Kemudian pada kesempatan lain aku menyeru mereka dengan dua cara sekaligus yaitu secara terbuka dan dengan diam-diam. 10. Itu semua telah kulakukan maka aku pun berkata kepada mereka, 'mohonlah ampunan kepada tuhanmu atas segala dosa terutama dosa syirik. Sungguh, dia maha pengampun bagi siapa saja yang tulus memohon ampunan-Nya. \"."
  }
]