[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sahabat-sahabatmu bertanya kepadamu (wahai nabi), tentang ghanimah (harta rampasan perang) pada perang (badar), bagaimana kamu membagi-bagikannya diantara mereka? katakanlah kepada mereka, ”urusan harta itu tergantung kepada Allah dan rasulNya.” maka rasulullah yang menangani pembagiannya berdasarkan perintah tuhannya, ”maka takutlah kepada siksaan Allah dan janagnlah kalian maju untuk melakukan maksiat kepadaNYa. Dan tinggalakanlah pertikaian dan permusuhan disebabkan harta ini. Dan perbaikilah hubungan di anatara kalian.dan tetaplah teguh untuk taat kepada Allah dan rasulNya, bila kalian orang-orang yang beriman. Sebab sesungguhnya keimanan itu akan mengajak kepada ketaatan kepada Allah dan rasulNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sahabat-sahabatmu bertanya kepadamu -wahai Rasul- tentang bagaimana cara pembagian ganimah (harta rampasan perang) dan siapa yang berhak menerima pembagiannya? Katakanlah -wahai Rasul- untuk menjawab pertanyaan mereka, “Harta rampasan perang itu adalah milik Allah dan rasul-Nya. Wewenang untuk mengelola dan membaginya ada di tangan Allah dan rasul-Nya. Kalian tidak mempunyai wewenang apa pun selain tunduk dan patuh. Maka bertakwalah kalian wahai orang-orang yang beriman kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan perbaikilah hubungan yang rusak di antara kalian akibat sikap saling memutuskan hubungan dan saling bertolak belakang dengan membangun rasa saling menyayangi, menjalin hubungan (komunikasi), menunjukkan akhlak yang baik, dan saling memaafkan. Tetaplah taat kepada Allah dan taat kepada rasul-Nya jika kalian benar-benar beriman. Karena iman selalu mendorong seseorang untuk taat dan menjauhi maksiat.” Pertanyaan itu muncul sesudah perang Badar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Hai Muhammad, sebagian sahabat bertanya kepadamu tentang bagaimana pembagian harta ghanimah dari perang Badar? Dan siapa yang berhak menerimanya? Katakanlah kepada mereka: \"Harta ghanimah merupakan milik Allah yang akan ditetapkan hukumnya sesuai hukum Allah, dan milik Rasulullah karena dia yang akan membaginya sesuai dengan hukum Allah.\" Kemudian Allah memerintahkan mereka: \"Hai orang-orang beriman, bertakwalah kepada Allah dengan menjalankan perintah-Nya dan menjauhi larangan-Nya; dan perbaikilah hubungan di antara kalian, dari saling membenci dan menjauhi menjadi saling mencintai dan saling menjalin hubungan; serta tetaplah mentaati Allah dan rasul-Nya dalam setiap urusan kalian jika kalian memang benar-benar orang yang beriman kepada Allah dan rasul-Nya"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يَسْـَٔلُونَكَ عَنِ الْأَنفَالِ ۖ (Mereka menanyakan kepadamu tentang (pembagian) harta rampasan perang) Yakni harta ghanimah. قُلِ الْأَنفَالُ لِلّٰهِ وَالرَّسُولِ ۖ (Katakanlah: “Harta rampasan perang kepunyaan Allah dan Rasul) Yakni hukumnya adalah sesuai ketetapan Allah dan rasul-Nya; Rasulullah membagikannya kepada kalian sesuai dengan perintah Allah, dan kalian tidak mempunyai wewenang untuk menentukan hukum tentangnya. Ubadah bin Shamit berkata: kami pergi bersama Rasulullah untuk mengikuti perang Badar, dua pasukanpun saling bertemu dan Allah mengalahkan musuh kami, sebagian pasukan kami mengejar musuh-musuh yang kabur untuk membunuh mereka, sebagian yang lain menuju tentara musuh yang telah gugur untuk mengambil dan mengumpulkan harta rampasan (ghanimah), dan sebagian yang lain mengelilingi Rasulullah untuk melindunginya hingga beliau tidak terkena pukulan musuh sedikitpun. Dan pada saat malam tiba dan semua pasukan telah berkumpul orang-orang yang mengumpulkan harta ghanimah berkata: “kami yang telah mengambil dan mengumpulkan harta ghanimah maka tidak seorangpun yang mendapat bagian selain kami”. Dan orang-orang yang telah mengejar musuh menanggapi: “kalian tidak lebih berhak daripada kami, karena kami-lah yang mengusir musuh dan mengalahkan mereka”. Dan orang-orang yang melindungi Rasulullah berkata: “kalian tidak lebih berhak daripada kami, karena kami telah melindungi Rasulullah, kami khawatir beliau akan terkena serangan musuh sehingga kami sibuk melindunginya”. Maka turunlah ayat ini. Rasulullah membagi harta ghanimah ini kepada kaum muslimin. Pendapat lain mengatakan bahwa ayat ini menunjukkan bahwa harta ghanimah menjadi milik Rasulullah, kemudian ayat ini dinasakh dengan firman Allah: واعلموا أنما غنمتم من شيء “Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang”. وَأَصْلِحُوا۟ ذَاتَ بَيْنِكُمْ ۖ (dan perbaikilah perhubungan di antara sesamamu) Setelah mereka berselisih dalam masalah harta ghanimah. Makhul berkata: ketika itu perbaikan hubungan diantara mereka adalah dengan mengembalikan harta ghanimah mereka kepada Rasulullah kemudian dibagikan kepada orang-orang yang melindungi Rasulullah, orang-orang yang menghadapi musuh, dan orang-orang yang mengumpulkan ghanimah. وَأَطِيعُوا۟ اللهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤْمِنِينَ (dan taatlah kepada Allah dan Rasul-Nya jika kamu adalah orang-orang yang beriman) Sebagai penggerak mereka untuk senantiasa bertakwa, memperbaiki hubungan diantara mereka, dan taat kepada Allah dan Rasulullah, karerna keimanan tidak akan sempurna kecuali dengan tiga hal ini. Oleh sebab itu ketaatan adalah tanda kejujuran iman seseorang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Suatu ketika disaat sakaratul maut menghampiri Imam Nafi' al-madani, anak-anaknya meminta wasiat kepadanya, maka beliau pun membacakan ayat : { فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ } \"bertakwalah kepada Allah dan perbaikilah perhubungan di antara sesamamu; dan taatlah kepada Allah dan Rasul-Nya jika kamu adalah orang-orang yang beriman\". Betapa indah ketika wasiat yang kita sampaikan kepada keluarga, kerabat dan anak-anak kita adalah wasiat qurani; karena sesungguhnya ia adalah wasiat yang paling agung, paling mahal dan sebaik-baiknya wasiat. 2 ). Perhatikan bagaimana Allah mendahulukan perintah memperbaki hubungan diantara kaum muslimin sebelum perintah ketaatan kepada-Nya dan kepada Rasul-Nya dalam ayat ini : { فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ } \"oleh sebab itu bertakwalah kepada Allah dan perbaikilah perhubungan di antara sesamamu; dan taatlah kepada Allah dan Rasul-Nya\"! sangat disayangkan ketika hari raya yang diagungkan oleh ummat yang selalu membaca ayat ini, namun hubungannya dengan saudaranya terputus? bukankah hari raya merupakan kesempatan besar untuk mewujudkan panggilan yang mulia ini ? dan meraih keutamaan dari ayat ini?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Ini adalah surah Madaniyyah yang berbicara tentang hukum-hukum jihad dan harta rampasan. Surah ini turun setelah perang badar 1 Mereka menanyakan kepadamu wahai Nabi tentang cara pembagian harta rampasan perang. Katakanlah: “Hukum harta rampasan perang adalah mutlak milik Allah dan Rasul. Rasul membaginya atas perintah Allah berdasar atas kemanfaatan umum. Oleh sebab itu bertakwalah kepada Allah dan perbaikilah hubungan antara sesamamu; dan taatlah kepada perintah dan larangan Allah dan Rasul-Nya jika kamu memang orang-orang yang beriman. Sebab iman tidak akan sempurna tanpa ketakwaan dan memperbaiki hubungan silaturrahim dan taat kepada Allah serta rasul-Nya”. Ayat ini turun untuk harta rampasan perang Badr dan cara pembagiannya, untuk siapa hukumnya, apakah untuk Muhajirin atau Anshor ataukah keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang harta rampasan perang} harta rampasan {Katakanlah,“Harta rampasan perang itu milik Allah dan Rasul. Maka bertakwalah kepada Allah dan perbaikilah hubungan di antara kalian dan taatlah kepada Allah dan RasulNya jika kalian adalah orang-orang mukmin.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Anfal adalah harta rampasan perang yang Allah berikan kepada kaum Muslimin yang berasal dari orang orang kafir. Ayat-ayat dalam surat ini turun terkait dengan kisah perang badar, tentang ghanimah (harta rampasan perang) besar pertama kali yang didapatkan kaum Muslimin dari kaum musyrikin, maka dikalangan sebagian kaum Muslimin terjadi sengketa tentangnya, lalu mereka bertanya kepada Rasulullah tentangnya, maka Allah menurunkan ayat “mereka menanyakan kepadamu tentang pembagian harta rampasan perang” bagaimana dia dibagi dan kepada siapa ia dibagi? “katakanlah” kepada mereka bahwa anfal itu adalah hak Allah dan rasulNya. Sebaliknya jika Allah dan RasulNya telah menetapkan hukum kamu wajib menerima dan menyerahkan perkara kepada keduanya. Dan hal itu masuk ke dalam firmanNya ”sebab itu bertakwalah kepada Allah” dengan menjalankan perintah perintahNya dan menjauhi larangan laranganNya”dan perbaikilah hubungan diantara sesamamu” yakni perbaikilah kebencian, permusuhan, dan persengketaan diantaramu dengan kasih sayang, hubungan baik, dan saling cinta. Dengan itu kalian bia bersepakat, dan kebencian, permusuhan, serta persengketaan dianatara kalian bisa sirna. Termasuk dalam perbaikan diantara sesama adalah membaguskan akhlak kepada mereka dan memaafkan mereka yang berbuat salah, karena dengan itu permusuhan dan kebencian yang ada di dalam hati bisa disingkirkan. Perkara yang menggabungkan kedua itu adalah Firman Allah ”dan taatlah kepada Allah dan RasulNya jika kamu adalah orang orang yang beriman” karena iman mengajak kepada ketaatan kepada Allah dan RasulNya, sebagaimana orang tidak menaati Allah dan Rasulnya adalah bukan orang Mukmin, dan barangsiapa yang ketaatannya kepada Allah dan RasulNya berkurang, maka itu karena imannya yang kurang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 1: Tirmidzi meriwayatkan dengan sanadnya dari Mush’ab bin Sa’ad dari bapaknya, ia berkata, “Ketika telah terjadi peperangan Badar, aku datang membawa pedang, lalu aku berkata, “Wahai Rasulullah, sesungguhnya Allah telah mengobati (rasa marah) dadaku kepada kaum musyrik” atau kata-kata seperti itu. Berikanlah untukku pedang ini.” Beliau mejawab, “(Pedang) ini tidak untukku dan tidak untukmu.” Aku pun berkata, “Boleh jadi pedang ini akan diberikan kepada orang yang tidak berbuat seperti yang aku lakukan.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Sesungguhnya engkau telah meminta kepadaku, sedangkan pedang itu bukan milikku, namun (sekarang) telah jadi milikku, dan ia (pedang itu) adalah untukmu.”, maka turunlah ayat, “Yas’aluunaka ‘anil anfaal.” Tirmidzi berkata, “Hadits ini hasan shahih.” Abu Dawud juga meriwayatkan dengan sanadnya dari Ibnu Abbas ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda pada peperangan Badar, “Barang siapa yang melakukan ini dan itu, maka ia memperoleh ini dan itu dari harta rampasan perang.” Maka para pemuda maju, sedangkan kaum tua memegang panji-panji dan tetap di tempatnya. Ketika Allah memberikan kemenangan kepada mreka, maka kaum tua berkata, “Kami merupakan pembela kamu. Jika kamu mundur, maka kamu akan kembali kepada kami. Oleh karena itu, kamu tidak boleh membawa harta rampasan semuanya, sedangkan kami tidak mengambilnya.” Akan tetapi para pemuda enggan melakukannya, mereka berkata, “Rasulullah shallallahu 'alaihi wa sallam telah menjadikannya untuk kami.” Maka Allah Ta’ala menurunkan ayat, “Yas’aluunaka ‘anil anfaal…dst. Sampai Kamaa akhrajaka Rabbuka min baitika bil haq wa ina fariiqam minal mu’miniina la kaarihuun.” Ia (Ibnu Abbas) berkata, “Hal itu (berangkat ke perang Badar) lebih baik bagi mereka.” Demikian juga (pembagian secara sama antara para pemuda dan kaum tua dan tidak menyelisihi Nabi shallallahu 'alaihi wa sallam) Nabi shallallahu 'alaihi wa sallam bersabda, “Oleh karena itu, taatilah aku. Karena aku mengetahui akhir dari semua ini daripada kamu.” Kedua sebab ini tidaklah bertentangan, karena mungkin saja ayat tersebut turun berkenaan kedua sebab ini, wallahu a’lam. Dia memberikannya kepada yang Dia kehendaki, dan tidak ada yang boleh menentangnya, bahkan sikap yang harus kamu lakukan adalah ridha dan menerima yang merupakan pengamalan dari firman-Nya, “Maka bertakwalah kepada Allah.” Beliau membaginya mengikuti perintah Allah. Ketika itu, Beliau membaginya secara sama rata. Dengan saling mencintai dan meninggalkan pertengkaran, karena ketika kaum muslimin memperoleh harta rampasan perang, mereka bertengkar, lalu mereka bertanya kepada Rasulullah shallallahu 'alaihi wa sallam bagaimana cara membaginya dan kepada siapakah dibagi? Karena iman mengajak untuk taat kepada Allah dan Rasul-Nya. Oleh karena itu, jika kurang taat kepada Allah dan Rasul-Nya, maka hal itu disebabkan kekurangan imannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 1",
    "description": "Ketika terjadi perang badar besar, antara kaum mukmin dan pasukan musyrik, kemenangan yang gemilang ada di pihak orang-orang mukmin. Harta rampasan pun cukup banyak melimpah, sehingga sempat mengundang perselisihan menyangkut persoalan pembagiannya. Mereka para sahabat menanyakan kepadamu, wahai nabi Muhammad, tentang bagaimana cara pembagian harta rampasan perang badar. Sebagai jawaban, katakanlah kepada mereka, harta rampasan perang itu adalah milik Allah dan rasul, sehingga rasul yang akan membagikannya menurut ketentuan Allah. Janganlah kalian berbeda pendapat menyangkut persoalan harta itu, cukuplah kalian menjadikan rasa takut dan taat pada Allah sebagai simbol kebanggaan kalian, maka bertakwalah kepada Allah. Hindari perselisihan yang akan terjadi akibat pembagian harta rampasan dan perbaikilah hubungan di antara sesamamu, serta jadikanlah rasa cinta kasih dan keadilan sebagai asas tali persaudaraan. Dan taatlah kepada Allah dalam segala perintah dan larangan-Nya dan demikian juga kepada rasul-Nya jika memang kamu adalah orangorang yang beriman yang telah mantap keimanan dalam hati. Sebagian sifat mereka yang menyandang predikat mukmin sejati disebutkan di sini, yaitu; sesungguhnya orang-orang yang beriman kepada Allah dengan sebenar-benarnya, yang mantap keimanannya, adalah mereka yang apabila disebut nama Allah dengan sifat-sifat keagungan dan kemuliaan-Nya gemetar hatinya karena mereka sadar akan kekuasaan dan keagungan-Nya, dan apabila dibacakan oleh siapa pun ayat-ayatnya kepada mereka, bertambah kuat imannya. Semakin mereka mendengar ayat-ayat Al-Qur'an dibacakan, semakin kokoh keimanan mereka dan semakin mendalam rasa tunduk serta semakin bertambah pengetahuan mereka pada Allah. Dan oleh karena itu, hanya kepada tuhan mereka senantiasa bertawakal dan berserah diri setelah berusaha keras, sehingga tidak berharap dan gentar kepada selain-Nya."
  }
]