[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mendatangkan bala bantuan pasukan tersebut, kecuali sebagai kabar gembira bagi kalian akan datangnya kemenangan, dan supaya hati kalian menjadi tenang, serta meyakini pertolongan Allah bagi kalian. Dan tidaklah kemenangan itu, kecuali dari sisi Allah, bukan dengan dahsyatnya serangan dan kekuatan kalian. Sesungguhnya Allah Mahaperkasa dalam kerajaanNYa, Maha bijaksana dalam pengaturan dan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan tidaklah Allah menjadikan pengiriman bala bantuan berupa malaikat itu melainkan sebagai kabar gembira bagi kalian -wahai orang-orang mukmin- bahwa Allah akan menolong kalian untuk mengalahkan musuh kalian, dan supaya hati kalian merasa tenang serta yakin akan memang. Karena kemenangan bukan ditentukan oleh banyaknya jumlah pasukan dan peralatan perang, namun kemenangan itu dari Allah -Subḥānahu-. Sesungguhnya Allah Maha Perkasa di dalam kerajaan-Nya, tidak ada yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menetapkan syariat dan ketentuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Hai orang-orang beriman, tidaklah pengiriman pasukan malaikat itu melainkan kabar gembira bagi kalian akan kemenangan yang akan kalian dapatkan dalam melawan musuh-musuh. Hal ini agar kalian semakin percaya kepada-Ku dan tidak putus asa ketika sebab-sebab kemenangan sangat sedikit, dan agar hati kalian menjadi tenang dan tidak ketakutan sehingga kalian dapat menyerang musuh-musuh tanpa keraguan. Kemenangan dengan bantuan para malaikat atau lainnya tidak lain adalah dari sisi Allah Semata, Dia Maha Perkasa sehingga tidak ada yang dapat mengalahkan-Nya; bahkan Dia berkuasa mengalahkan pasukan yang besar dan memiliki peralatan yang lengkap. Dan Dia Maha Bijaksana dengan menetapkan suatu perkara menurut sebab-sebabnya dan menempatkan sesuatu sesuai pada tempatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَمَا جَعَلَهُ اللهُ (Dan Allah tidak menjadikannya) Yakni dengan mengirim pasukan dari para malaikat. إِلَّا بُشْرَىٰ (melainkan sebagai kabar gembira) Melainkan sebagai kabar gembira kemenangan bagi kalian وَلِتَطْمَئِنَّ بِهِۦ قُلُوبُكُمْ ۚ (dan agar hatimu menjadi tenteram karenanya) Karena bala bantuan malaikat tersebut. وَمَا النَّصْرُ إِلَّا مِنْ عِندِ اللهِ ۚ (Dan kemenangan itu hanyalah dari sisi Allah) Tidak dari selain-Nya dan tidak dari para malaikat. إِنَّ اللهَ عَزِيزٌ(Sesungguhnya Allah Maha Perkasa) Yang tidak terkalahkan. حَكِيمٌ(lagi Maha Bijaksana) Bijaksana dalam setiap perbuatan-Nya. Umar bin Khattab berkata: adapun di hari terjadinya perang badar tidak diragukan lagi bahwa para malaikat berperang bersama kami, adapun pada peperangan setelah itu maka Allahu a’lam (Allah-lah yang mengetahui apakah kami di bantu dengan malaikat atau tidak)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "9-10 1 ). Doa yang tulus dari hati yang tunduk adalah merupakan senjata yang ampuh atas izin Allah : { إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ } \"(Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu, lalu diperkenankan-Nya bagimu\". Ibnu Taimiyah berkata : \"Hati yang tulus dan doa yang baik adalah pasukan yang tidak dapat terkalahkan\". 2 ). Pada peristiwa perang Badr senjata dan iman saling berpelukan dengan sangat erat, Rasulullah sebagai panglima mempersiapkan bala tentaranya, mengatur strategi peperangan, dan memilih lokasi peperangan, dan mengangkat semangat para sahabatnya, kemudian beliau menghadap tuhannya dengan hati yang tunduk, memohon turunya pertolongan dan kemenangan, sampai akhirnya terwujudlah keinginan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10 Allah tidak menjadikan kiriman bala bantuan itu, melainkan sebagai kabar gembira bagimu dan agar hatimu menjadi tenteram dari ketakutan yang menghantui. Kemenangan dan pertolongan itu hanyalah dari sisi Allah, bukan dari lain-Nya. Kehendak Allah bisa terwujud dengan adanya kejadian sebab. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana dalam segala perbuatannya. Yang Maha Meletakkan sesuatu sesuai tempatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah tidak menjadikannya} Allah tidak menjadikan bala bantuan malaikat itu {melainkan sebagai kabar gembira} kabar gembira {dan menjadi tenteram} menjadi tenang {hati kalian karena itu. Kemenangan itu tidak lain kecuali dari sisi Allah. Sesungguhnya Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10 “dan Allah tidak menjadikannya” yakni pengiriman malaikat tersebut “melainkan sebagai kabar gembira” agar jiwa mereka gembira dengan itu. ”dan agar hatimu menjadi tenteram karenanya” namun pada hakikatnya kemenangan itu di tangan Allah, bukan dengan banyaknya tentara dan senjata, ”sesungguhnya Allah Maha perkasa\" tidak ada yang bias mengalahkannya siapapun, bahkan Diam aha perkasa yang mampu mengalahkan siapapun walaupun orang itu di lengkapi oleh kekuatan jumlah dan senjata yang demikian besarnya. ”lagi maha bijaksana” dimana Dia menentukan perkara dengan sebab sebabnya. Dan meletakan segala urusan pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 10: Kalau pun tidak dikirimkan para malaikat-Nya, maka sesungguhnya kemenangan di Tangan Allah, tidak karena banyaknya pasukan dan lengkapnya persenjataan. Tidak ada yang dapat mengalahkan-Nya. Di mana Dia menetapkan berbagai perkara dengan sebab-sebabnya dan meletakkan sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 10",
    "description": "Meski berita keterlibatan malaikat sangat menggembirakan, tetapi jangan menduga bantuan pasukan malaikat itu adalah sebab kemenangan. Dan tidaklah Allah menjadikannya, yakni pemberian bala bantuan itu melainkan sebagai kabar gembira berupa kemenangan bagi kamu kaum muslim agar hatimu menjadi tenteram karenanya dan terus maju. Dan kemenangan itu hanyalah dari sisi Allah, bukan dari kekuatan pasukanmu dan atau bantuan malaikat. Kemenangan hanya diraih dengan restu dan kehendak Allah. Sungguh, Allah mahaperkasa, tidak dapat dikalahkan oleh siapa pun, mahabijaksana, dalam menetapkan segala urusan sebagaimana mestinya sesuai dengan ilmu-Nya yang meliputi segala sesuatu wahai orang-orang yang beriman, ingatlah nikmat Allah yang lain, yaitu ketika kamu kekurangan perbekalan air dan di saat kalian dicekam rasa takut pada musuh, lalu Allah membuat kamu mengantuk sehingga beberapa saat kamu terlena dan tidak menghiraukan sesuatu, dan dengan demikian kamu dapat beristirahat menghilangkan kepenatan. Itu dilakukan oleh Allah untuk memberi ketenteraman dari-Nya, dengan hilangnya rasa takut, dan di antara nikmat lainnya Allah juga menurunkan air hujan dari langit kepa-damu. Air hujan itu berguna untuk menyucikan kamu dengan hujan itu, yakni dengan menggunakannya untuk berwudu, mandi wajib dan sunah, dan hujan itu juga menghilangkan gangguangangguan setan dari dirimu dan untuk menguatkan hatimu dalam menghadapi musuh serta memperteguh telapak kakimu, sebab tanah berupa pasir yang disiram air akan menjadi padat, sehingga mudah diinjak dan tidak membuat kaki tergelincir atau terbenam di pasir. Dengan cara itu pula Allah memperteguh pendirian kaum muslim."
  }
]