[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah ketika Allah melemparkan rasa kantuk pada kalian sebagai rasa aman dariNya bagi kalian dari rasa takut musuh dapat mengalahkan kalian, dan menurunkan pada kalian dari awan mendung air yang suci, untuk menyucikan kalian dengan air itu dari berbagai macam hadats zahir, serta menghilangkan dari batin kalian gangguan was-was setan dan bisikan-bisikannya, dan supaya Allah menguatkan hati kalian dengan kesabaran saat peperangan, dan mengokohkan dengannya kaki-kaki kaum mukminin melalui pemadatan tanah berpasir dengan guyuran air hujan sehingga kaki tidak tergelincir di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan ingatlah -wahai orang-orang mukmin- ketika Allah membuat kalian mengantuk untuk menenteramkan hati kalian yang tengah dilanda ketakutan kepada musuh kalian, dan menurunkan air hujan dari langit untuk menyucikan kalian dari hadas, menghindarkan kalian dari gangguan setan, dan meneguhkan hati kalian, untuk menguatkan tubuh kalian saat berhadapan dengan musuh, serta untuk memperkukuh pijakan kaki kalian dengan mengeraskan tanah pasir agar kaki kalian tidak terbenam ke dalam tanah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan bentuk pengabulan doa kalian adalah dengan memberi kalian rasa kantuk sebelum kalian menghadapi musuh, untuk memberi rasa aman bagi hati kalian, dan istirahat untuk badan kalian, serta tanda kebaikan bagi kalian. Karena jika seseorang takut dari musuhnya tidak akan dapat tidur, akan tetapi jika orang yang takut itu tidur maka dia akan merasa aman; sehingga tidur yang mereka dapatkan ketika terjadi ketakutan merupakan tanda telah hilangnya rasa takut dan datangnya rasa aman. Oleh sebab itu mereka dapat tidur dengan penuh kepercayaan kepada Allah dan keyakinan atas janji-Nya, sehingga ketika mereka bangun, mereka dalam keadaan penuh semangat dalam menghadapi musuh mereka. Dan bentuk pengabulan doa kalian adalah Allah menurunkan air hujan kepada kalian. Dan hal ini memiliki beberapa manfaat; Pertama, sebagai pembersih badan kalian. Kedua, untuk menghilangkan bisikan setan dari kalian untuk menakut-nakuti kalian akan kehausan dan menimbulkan prasangka dan dugaan; dan ini merupakan pembersih batin kalian. Ketiga, untuk menguatkan keyakinan hati mereka terhadap pertolongan Allah dan meneguhkan kesabaran mereka. Hal ini karena adanya air dalam genggaman orang-orang yang berperang akan menambah kekuatan dan keteguhan mereka; Adapun jika air itu tidak ada, maka akan menghilangkan rasa percaya diri dan ketenangan mereka, bahkan dapat menyebabkan kekalahan. Keempat, untuk meneguhkan pijakan kaki mereka sehingga tidak tenggelam ke dalam pasir dan memudahkan mereka untuk berjalan. Karena sebagaimana diketahui berjalan diatas pasir sangat susah, namun jika turun hujan maka pijakan kaki akan menjadi kokoh sehingga mudah untuk berjalan di atasnya, dan ketika turun hujan debu-debu juga akan hilang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِّنْهُ ((Ingatlah), ketika Allah menjadikan kamu mengantuk sebagai suatu penenteraman daripada-Nya) Allah memberi rasa tenang dan aman dalam hati mereka hingga mereka tidur dengan penuh rasa aman, ini terjadi ketika malam sebelum perang yang akan dilakukan esok hari. Pendapat lain mengatakan bahwa tidur itu menyelimuti mereka ketika terjadi pertemuan antara dua pasukan. وَيُنَزِّلُ عَلَيْكُم مِّنَ السَّمَآءِ مَآءً (dan Allah menurunkan kepadamu hujan dari langit) Allah menurunkan hujan kepada para pasukan muslimin sebelum dimulai peperangan hingga air hujan itu mengalir ke lembah. لِّيُطَهِّرَكُم بِهِۦ (untuk mensucikan kamu dengan hujan itu) Untuk mengangkat kotorang-kotoran dari kalian. Yakni agar kalian dapat mandi dan mendirikan sholat dalam keadaan yang sempurna, dan ketika itu belum disyariatkan tayammum. وَيُذْهِبَ عَنكُمْ رِجْزَ الشَّيْطٰنِ(dan menghilangkan dari kamu gangguan-gangguan syaitan) Yakni menghilangkan bisikan setan kepada kalian berupa rasa takut dan pesimis untuk menang. وَلِيَرْبِطَ عَلَىٰ قُلُوبِكُمْ(dan untuk menguatkan hatimu) Sehingga menjadikan hati kalian penuh kesabaran, kuat, dan teguh dalam menghadapi peperangan. وَيُثَبِّتَ بِهِ الْأَقْدَامَ (dan memperteguh dengannya telapak kaki(mu)) Dengan hujan itu tanah dan pasir menjadi kuat untuk dipijak dan debu menjadi hilang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tidur merumakan karunia yang sangat berharga dari Allah untuk hamba-hamba Nya, dan sebagaimana yang diketahui bahwa semakin tenang tempat tidur seseorang, maka tidur pun semakin baik, oleh karena itu kita mencoba mentadabburi ayat Allah yang satu ini : { فَضَرَبْنَا عَلَىٰ آذَانِهِمْ فِي الْكَهْفِ سِنِينَ عَدَدًا } \"Maka Kami tutup telinga mereka beberapa tahun dalam gua itu\" [ al-kahfi : 11 ], ayat tidak mengatakan : (hati-hati mereka) atau (mata-mata mereka), sebagaimana juga yang dikatakan oleh orang banyak : bahwa menutup telinga saat hendak tidur memberikan ketenagan dan kepulasan yang lebih dalam tidur kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11 Ingatlah, ketika Allah menjadikan kamu mengantuk pada malam peperangan. sebagai suatu penenteraman dari-Nya dari ketakutan dan hiruk pikuk perang. Allah menurunkan kepadamu hujan dari langit untuk mensucikan kamu dengan hujan itu dari hadas dan jinabah. Allah telah menurunkan hujan untuk tentara muslim hingga mengaliri lembah. Untuk menghilangkan dari kamu gangguan-gangguan syaitan dan untuk menguatkan hatimu dengan kesabaran dan kekuatan dan memperteguh langkah dan kakimu di medan perang dengan hujan yang menambah kelunakan tanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah membuat kalian} membuat kalian {mengantuk sebagai bentuk rasa aman dariNya} rasa aman dari Allah {dan menurunkan air dari langit kepada kalian untuk menyucikan kalian dengan itu, menghilangkan} menghilangkan {gangguan-gangguan} bisikan {setan dari kalian, dan menguatkan} meneguhkan dan menguatkan {hati kalian serta memperteguh telapak kaki kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. diantara pertolongan Allah kepadamu dan jawabanNya terhadap do'amu adalah bahwa Dia mengirimkan rasa kantuk kepadamu. ”Allah menjadikanmu mengantuk” yakni dengan kantuk itu Allah melenyapkan rasa takut dan cemas yang ada di hatimu. Dan ia sebagai “penentraman” bagimu dan tanda ketenangan dan kemenangan. Diantara pertolonganNYa kepadamu juga adalah bahwa Dia menurunkan hujan kepadamu dari langit untuk menyucikanmu dari godaan dan bisikan setan. ”dan untuk menguatkan hatimu” yakni meneguhkannya, karena keteguhan hati adalah dasar bagi keteguhan badan. ”dan memperteguh dengannya telapak kaki(mu)” karena bumi sebelum hujan rata dan datar, dan setelah hujan ia menjadi kempal dan dapat meneguhkan telapak kaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 11: Yang sebelumnya kamu ditimpa ketakutan. Hal ini termasuk pertolongan-Nya dan pengabulan-Nya terhadap doamu. Dari hadats maupun kotoran. Yakni was-wasnya kepadamu, seperti was-wasnya kepadamu bahwa jika kamu berada di atas kebenaran, tentu kamu tidak akan kehausan lagi berhadats, sedangkan kaum musyrik berada di dekat air. Dengan keyakinan dan kesabaran, karena kuatnya hati mempengaruhi kokohnya badan. Ada yang mengartikan dengan teguh hati dan pendirian, dan ada pula yang mengartikan dengan tidak terperosok ke dalam pasir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 11",
    "description": "Wahai orang-orang yang beriman, ingatlah nikmat Allah yang lain, yaitu ketika kamu kekurangan perbekalan air dan di saat kalian dicekam rasa takut pada musuh, lalu Allah membuat kamu mengantuk sehingga beberapa saat kamu terlena dan tidak menghiraukan sesuatu, dan dengan demikian kamu dapat beristirahat menghilangkan kepenatan. Itu dilakukan oleh Allah untuk memberi ketenteraman dari-Nya, dengan hilangnya rasa takut, dan di antara nikmat lainnya Allah juga menurunkan air hujan dari langit kepa-damu. Air hujan itu berguna untuk menyucikan kamu dengan hujan itu, yakni dengan menggunakannya untuk berwudu, mandi wajib dan sunah, dan hujan itu juga menghilangkan gangguangangguan setan dari dirimu dan untuk menguatkan hatimu dalam menghadapi musuh serta memperteguh telapak kakimu, sebab tanah berupa pasir yang disiram air akan menjadi padat, sehingga mudah diinjak dan tidak membuat kaki tergelincir atau terbenam di pasir. Dengan cara itu pula Allah memperteguh pendirian kaum muslim. Semua itu adalah peringatan bagi mereka yang berjuang di jalan Allah dan bertawakal kepada-Nya, bahwa kemenangan pasti akan datang. Nikmat dan berita gembira lainnya yang juga harus disyukuri dan selalu diingat adalah ketika tuhanmu wahai nabi Muhammad mewahyukan kepada para malaikat yang dikirim untuk memperkuat pasukan kaum muslim pada perang badar tentang tugas-tugas mereka, sesungguhnya aku bersama kamu, membantu dan melindungimu. Yakinlah akan kemenangan, sebab siapa yang ditemani Allah pasti menang, maka karena itu teguhkanlah hati dan pendirian orang-orang yang telah beriman dengan berbagai cara. Karena aku bersama kamu semua, maka kelak akan aku berikan rasa ketakutan ke dalam hati orangorang kafir, sehingga pasukan mereka akan kocar-kacir, maka pukullah dan tebaslah bagian yang di atas leher mereka, karena dalam peperangan, sasaran yang mematikan adalah leher, dan apabila lawan memakai baju besi, sehingga sulit dikalahkan, maka tangannya yang dilumpuhkan, pukullah tiap-tiap ujung jari mereka, agar tidak dapat memegang senjata, seperti: pedang, tombak, dan lain-lainnya sehingga mudah ditawan."
  }
]