[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah juga (wahai nabi), ketika tuhanmu mewahyukan kepada para malaikat yang Allah menguatkan pasukan kaum Muslimin dengan mereka dalam perang badar, ”sesungguhnya aku bersama kalian, aku bantu dan aku tolong kalian, maka kuatkanlah tekad orang-orang yang beriman.” kemudian aku akan tanamkan pada hati orang-orang kafir rasa ketakutan yang dahsyat, kehinaan dan kerendahan. Maka penggallah wahai kaum mukminin, kepala-kepala orang kafir, dan potong-potonglah ujung jari dan persendian mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan ingatlah -wahai Nabi- ketika Rabbmu mewahyukan kepada para malaikat yang Allah kirimkan sebagai bala bantuan bagi orang-orang mukmin dalam perang Badar, “Sesungguhnya Aku bersama kalian -wahai para malaikat- dengan pertolongan dan dukungan. Maka kuatkanlah tekad orang-orang mukmin untuk berperang melawan musuh mereka. Aku akan memasukkan rasa takut yang dahsyat ke dalam hati orang-orang kafir. Maka tebaslah -wahai kaum mukminin- leher orang-orang kafir itu agar mereka tewas. Dan babatlah persendian dan pergelangan mereka agar mereka tidak sanggup melawan kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Dan bentuk pengambulan doa mereka adalah Allah mengingatkan mereka dengan kenikmatan lain yang memiliki efek besar dalam kemenangan mereka menghadapi orang-orang musyrik. Allah berfirman: \"Hai Rasulallah, ingatlah ketika Tuhanmu mewahyukan kepada para malaikat yang menolong kaum muslimin pada perang Badar, 'Aku bersama kalian dengan pertolongan dan bantuan-Ku, maka bantulah orang-orang beriman dan kuatkanlah hati mereka. Penuhilah diri mereka dengan keyakinan akan kemenangan, dan luruskanlah niat mereka dalam berperang dengan menjadikan tujuan mereka adalah untuk meninggikan kalimat Allah. Yaitu dengan cara tetap teguh dalam menghadapi kerasnya peperangan.\" Dan sebagian malaikat menyerupai menjadi manusia yang mereka kenal. Dan bentuk dikabulkannya doa mereka adalah Allah memberi orang-orang beriman kabar gembira yang besar: \"Aku akan memenuhi hati orang-orang kafir dengan ketakutan terhadap kalian, dan aku akan menjadikan mereka panik agar kalian dapat mengalahkan mereka. Kemudian Allah menyuruh orang-orang beriman untuk melakukan hal-hal yang dapat menjadi sebab kemenangan, dan memerintahkan mereka untuk menyerang para musuh dengan kuat dan keras, dan menebas leher, kepala, kaki, dan tangan mereka agar mereka tidak dapat bergerak sehingga mereka tidak mampu lagi membela diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِذْ يُوحِى رَبُّكَ إِلَى الْمَلٰٓئِكَةِ أَنِّى مَعَكُمْ ((Ingatlah), ketika Tuhanmu mewahyukan kepada para malaikat: “Sesungguhnya Aku bersama kamu) Ini merupakan kenikmatan lain yang Allah ingatkan kepada mereka. فَثَبِّتُوا۟ الَّذِينَ ءَامَنُوا۟ ۚ (maka teguhkan (pendirian) orang-orang yang telah beriman”) Dengan memberi kabar gembira kemenangan, atau meneguhkan mereka dalam peperangan dengan turut serta mendampingi mereka dan menambah jumlah pasukan mereka. سَأُلْقِى فِى قُلُوبِ الَّذِينَ كَفَرُوا۟ الرُّعْبَ(Kelak akan Aku jatuhkan rasa ketakutan ke dalam hati orang-orang kafir) Ayat ini telah dijelaskan pada surat Ali Imran: 151. فَاضْرِبُوا۟ فَوْقَ الْأَعْنَاقِ (maka penggallah kepala mereka) Yakni pada leher atas mereka, karena itu merupakan sendi-sendi yang apabila dipukul dengan pedang akan mudah terputus. Terdapat pendapat mengatakan bahwa perintah ini ditujukan kepada para malaikat. Pendapat lain mengatakan ditujukan untuk orang-orang beriman. وَاضْرِبُوا۟ مِنْهُمْ كُلَّ بَنَانٍ (dan pancunglah tiap-tiap ujung jari mereka) Yakni ujung jari-jari tangan mereka. Karena apabila ia dipotong maka korban tidak akan mampu melanjutkan perang lagi; berbeda dengan anggota tubuh yang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ditanyakan kepada as-Subki tentang hikmah dari peran Malaikat dalam perang Badr, padahal Jibril sesungguhnya mampu memusnahkan musuh-musuh kaum muslimin dengan satu helai saja dari sayapnya ? beliau kemudian menjawab : hal itu menjadi pelajaran bahwa agar peperangan ini dilakukan oleh Rasulullah dan para sahabatnya, dan adapun para Malaikat itu sebagai tambahan daripada jumlah pasukan kaum muslimin; sebagai hikmah bahwa hal ini merupakan sunnah kehidupan yang dijalankan oleh Allah untuk hamba-hamba Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12 Ingatlah wahai Nabi, ketika Tuhanmu mewahyukan kepada para malaikat: “Sesungguhnya Aku bersama kamu dengan pertolongan, maka teguhkan pendirian orang-orang yang telah beriman dalam berperang dan berilah kabar gembira kepada mereka dengan akan datangnya pertolongan”. Kelak akan Aku jatuhkan rasa ketakutan ke dalam hati orang-orang kafir, hingga mereka takut, maka penggallah kepala mereka dan pancunglah tiap-tiap ujung jari tangan dan kaki mereka. Sebab jika engkau menebasnya maka tangan mereka tidak akan mampu untuk menyerang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Tuhanmu memberi wahyu kepada para malaikat,“Sesungguhnya Aku bersama kalian} dengan bantuan dan pertolongan {Maka teguhkanlah} kuatkanlah {orang-orang yang beriman. Aku akan menimpakan ke dalam hati orang-orang kafir rasa takut} rasa takut yang sangat kuat {Maka tebaslah bagian atas leher mereka dan potonglah tiap-tiap ujung jari mereka} bagian penghubung dan bagian ujung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12 termasuk pertolongan Allah bahwa Dia mewahyukan kepada para malaikat, ”sesungguhnya aku bersama kamu” dengan bantuan, pertolongan, dan kemenagan. ”maka teguhkanlah pendirian orang orang yang telah beriman” yakni tanamkanlah di dalam hati mereka keberanian melawan musuh serta doronglah mereka kepada jihad dan keutamaannya. ”kelak akan Aku jatuhkan rasa ketakutan kedalam hati orang orang kafir”, yang merupakan tentara terbesarmu dalam menghadapi mereka, karena jika Allah meneguhkan orang orang yang beriman dan menyusupkan rasa takut dihati orang orang kafir, maka orang orang kafir tidak akan mampu teguh di hadapan kaum muslimn, dan Allah menyerahkan pundak pundak mereka kepada orang orang mukmin. ”maka penggallah kepala mereka” yakni leher mereka ”dan pancunglah tiap tiap ujung jari mereka” yakni pergelangan. ucapan ini bisa jadi untuk para malaikat yang mana Allah mewahyukan kepada mereka agar meneguhkan hati orang orang yang beriman. Ini menunjukan bahwa para malaikat turut berpartisipasi secara langsung dalam perang badar. Bisa pula ucapan ini tertuju kepada orang orang yang beriman dimana Allah menyemangati mereka dan mengajarkan kepada mereka bagaimana mereka membunuh orang orang kafir dan bahwa mereka tidak perlu mengasihani orang orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 12: Yang membantu kaum muslimin. Dengan memberikan bantuan dan pertolongan. Dengan membantu dan memberikan kabar gembira, mendorong mereka untuk berani melawan musuh serta mendorong mereka berjihad. Khithab (pembicaraan) ini bisa ditujukan kepada para malaikat dan bisa ditujukan kepada kaum mukmin. Jika ditujukan kepada para malaikat, maka hal ini menunjukkan bahwa para malaikat ikut terjun dalam perang Badar, dan jika ditujukan kepada kaum mukmin, maka berarti Allah mendorong mereka dan mengajari mereka bagaimana mereka membunuh kaum musyrik, dan bahwa mereka tidak perlu mengasihani orang-orang musyrik karena mereka telah menentang Allah dan Rasul-Nya. Yakni penggallah leher mereka. Oleh karena itulah, ketika salah seorang kaum muslimin hendak memenggal leher orang kafir dalam perang Badar, ternyata lehernya sudah jatuh lebih dahulu karena pukulan malaikat. Maksud ujung jari di sini adalah persendian anggota tangan dan kaki. Dalam peperangan, sasaran yang mematikan adalah leher, tetapi apabila lawan memakai baju besi sehingga sulit dikalahkan, maka tangannya yang dilumpuhkan agar tidak dapat memegang senjata sehingga mudah ditawan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 12",
    "description": "Semua itu adalah peringatan bagi mereka yang berjuang di jalan Allah dan bertawakal kepada-Nya, bahwa kemenangan pasti akan datang. Nikmat dan berita gembira lainnya yang juga harus disyukuri dan selalu diingat adalah ketika tuhanmu wahai nabi Muhammad mewahyukan kepada para malaikat yang dikirim untuk memperkuat pasukan kaum muslim pada perang badar tentang tugas-tugas mereka, sesungguhnya aku bersama kamu, membantu dan melindungimu. Yakinlah akan kemenangan, sebab siapa yang ditemani Allah pasti menang, maka karena itu teguhkanlah hati dan pendirian orang-orang yang telah beriman dengan berbagai cara. Karena aku bersama kamu semua, maka kelak akan aku berikan rasa ketakutan ke dalam hati orangorang kafir, sehingga pasukan mereka akan kocar-kacir, maka pukullah dan tebaslah bagian yang di atas leher mereka, karena dalam peperangan, sasaran yang mematikan adalah leher, dan apabila lawan memakai baju besi, sehingga sulit dikalahkan, maka tangannya yang dilumpuhkan, pukullah tiap-tiap ujung jari mereka, agar tidak dapat memegang senjata, seperti: pedang, tombak, dan lain-lainnya sehingga mudah ditawan. Ketentuan yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan rasul-Nya nabi Muhammad; dan barang siapa terus menerus menentang Allah dan rasul-Nya, sungguh, Allah sangat keras siksa-Nya."
  }
]