[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang dialami oleh orang-orang kafir berupa pukulan terhadap kepala-kepala mereka, leher-leher mereka, dan ujung-ujung tubuh mereka, adalah disebabkan oleh penentangan mereka terhadap perintah Allah dan rasulNya. Dan barangsiapa menyelisihi perintah Allah dan RasulNYa, maka sesungguhnya Allah itu amat pedih siksaanNya bagi orang tersebut di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Apa yang terjadi pada orang-orang kafir itu yaitu terbunuh atau terluka disebabkan karena mereka menentang Allah dan rasul-Nya. Mereka tidak mau menjalankan perintah-Nya dan menjauhi larangan-Nya. Barangsiapa yang menentang Allah dan rasul-Nya dalam hal itu sesungguhnya hukuman Allah sangat berat baginya di dunia, yaitu terbunuh atau tertawan, dan di Akhirat, yaitu api Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Kemudian Allah menjelaskan sebab Allah memerintahkan untuk menebas leher, kaki, dan tangan mereka; yaitu karena mereka menyelisihi perintah Allah dan rasul-Nya, dan mentaati perintah setan. Dan barangsiapa yang menyelisihi perintah Allah dan rasul-Nya, maka sungguh Allah sangat berat siksaan-Nya, sehingga Dia akan menimpakan kepada musuh-musuh-Nya berbagai siksaan di dunia serta menjadikan mereka kekal di neraka pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. ذٰلِكَ (yang demikian itu) Yakni pembunuhan orang-orang musyrik. بِأَنَّهُمْ شَآقُّوا۟ اللهَ وَرَسُولَهُۥ ۚ( karena sesungguhnya mereka menentang Allah dan Rasul-Nya) Karena mereka menentang dan durhaka kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13 Ketentuan yang demikian itu adalah untuk orang-orang musyrik karena sesungguhnya mereka menentang Allah dan Rasul-Nya dengan mengusir orang-orang mukmin dari tempat tinggal mereka. Barangsiapa menentang Allah dan Rasul-Nya, maka sesungguhnya Allah amat keras siksaan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang demikian itu adalah karena sesungguhnya mereka menentang} mendurhakai dan menentang {Allah dan RasulNya. Siapa saja yang menentang} mendurhakai dan menentang {Allah dan RasulNya, sesungguhnya Allah sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. hal itu karena orang orang kafir itu menentang Allah dan rasulNya yakni memerangi dan memusuhi secara terang terangan. ”dan barangsiapa menentang Allah dan RasulNya, maka sesungguhnya Allah amat keras siksaanNya.” di antara siksaanNya pada orang orang kafir adalah kemenangan yang diberikanNya kepada orang orang yang beriman atas mereka dan pembunuhan terhadap mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 13: Di antara siksaan-Nya adalah dengan memberikan kekuasaan kepada para wali-Nya terhadap musuh-musuh-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 13",
    "description": "Ketentuan yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan rasul-Nya nabi Muhammad; dan barang siapa terus menerus menentang Allah dan rasul-Nya, sungguh, Allah sangat keras siksa-Nya. Demikianlah hukuman dunia yang ditimpakan atasmu, wahai para pembangkang, maka rasakanlah hukuman itu. Sesungguhnya bagi orangorang kafir ada lagi selain siksa duniawi tersebut berupa azab neraka."
  }
]