[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "itulah siksaan yang aku segerakan terhadap kalian wahai orang-orang kafir yang menentang perintah-perintah Allah dan rasulNya di dunia, dan rasakanlah ia dikehidupan dunia, dan bagi kalian diakhirat kelak siksaan neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Azab yang telah disebutkan itu diperuntukkan bagi kalian -wahai orang-orang yang menentang Allah dan rasul-Nya-. Maka rasakanlah azab itu yang disegerakan bagi kalian di dunia. Dan di Akhirat kelak kalian akan mendapatkan siksa Neraka apabila kalian mati dalam kekafiran dan pembangkangan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Kemudian Allah mengalihkan pembahasan-Nya kepada orang-orang yang memusuhi Allah dan rasul-Nya untuk memberi mereka ancaman dengan kesudahan yang buruk: \"Hai orang-orang kafir, apa yang menimpa kalian pada perang Badar yang berupa terbunuh dan tertawan merupakan balasan yang sesuai atas kemaksiatan, kesyirikan, dan pembangkangan kalian. Maka rasakanlah rasa sakitnya di dunia; sedangkan di akhirat kalian akan mendapat azab neraka yang lebih berat dan lebih lama daripada azab di dunia. Rasakanlah itu semua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. ذٰلِكُمْ (Itulah) Ini merupakan isyarat yang ditujukan kepada siksaan yang disegerakan kepada orang-orang musyrik ini. فَذُوقُوهُ(maka rasakanlah hukuman itu) Yakni rasakanlah hai orang-orang musyrik, dan rasakanlah rasa sakitnya, serta telanlah penderitaannya. وَأَنَّ لِلْكٰفِرِينَ عَذَابَ النَّارِ(Sesungguhnya bagi orang-orang yang kafir itu ada (lagi) azab neraka) Ini merupakan ancaman bagi mereka berupa siksaan yang menunggu mereka di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14 Itulah hukuman yang disegerakan di dunia untuk orang-orang musyrik, maka rasakanlah hukuman itu wahai orang-orang kafir. Sesungguhnya bagi orang-orang yang kafir itu ada lagi azab neraka di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu. rasakanlah hukuman itu, dan sesungguhnya bagi orang-orang kafir itu azab neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14 “itulah (hukum dunia yang ditimpakan atasmu)” yakni siksa yang disebutkan diatas, ”maka rasakanlah hukuman itu” wahai orang orang yang menentang Allah dan RasulNya, sebagai hukuman yang disegerakan. ”sesungguhnya bagi orang orang yang kafir itu ada (lagi) azab neraka. ” Kisah ini mengandung tanda tanda kekuasaan Allah yang agung menunjukan bahwa apa yang dibawa oleh Muhammad sholallohu alaihi wasallam sebagai Rasul Allah adalah benar. Diantaranya adalah bahwa Allah menjanjikan sesuatu kepada kaum Mukminin dan merealisasikan janji tersebut Firman Allah ”sesungguhnya telah ada tanda bagi kamu pada dua golongan yang telah bertemu (bertempur), segolongan berperang dijalan Allah dan (segolongan) yang lain kafir yang dengan mata kepala melihat (seakan akan) orang orang Muslimin dua kali jumlah meraka.” Diantaranya adalah jawaban Allah terhadap do'a orang orang mukmin ketika mereka memohon pertolongan kepadaNya dengan sebab sebab yang dijelaskanNYa. Kisah ini juga menunjukan bahwa Allah sangat perhatian terhadap kondisi hamba hambaNya yang beriman dan Dia mendatangkan sebab sebab (kemenangan) yang dengannya iman mereka menjadi teguh dan hal yang tidak diinginkan serta godaan setan pun lenyap. Diantaranya juga adalah bahwa diantara kasih sayang Allah terhadap hambaNya adalah bahwa Allah memudahkannya untuk menaatiNya dan memudahkannya dengan sebab sebab dari dalam dan dari luar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 14: Dalam kisah di atas terdapat ayat-ayat Allah yang besar yang menunjukkan bahwa apa yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam adalah benar, janji Allah adalah benar, pengabulan Allah terhadap doa hamba-Nya, perhatian yang besar dari Allah kepada keadaan hamba-hamba-Nya yang beriman dan pengadaan-Nya terhadap sebab yang mengokohkan iman dan pendirian mereka serta penyingkiran-Nya terhadap bahaya dan was-was setan yang datang kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 14",
    "description": "Demikianlah hukuman dunia yang ditimpakan atasmu, wahai para pembangkang, maka rasakanlah hukuman itu. Sesungguhnya bagi orangorang kafir ada lagi selain siksa duniawi tersebut berupa azab neraka. Setelah ayat-ayat yang lalu menjelaskan dukungan Allah terhadap kaum muslim dan kemenangan yang dianugerahkan kepada mereka, pada ayat ini Allah menjelaskan hakikat kemenangan dan tugas mereka ketika menghadapi musuh. Wahai orang yang beriman! apabila kamu bertemu dengan orang-orang kafir yang menentang Allah dan rasul-Nya dalam barisan yang akan menyerangmu dan mengancam keberada-anmu, maka janganlah kamu berbalik mundur membelakangi mereka, sehingga kalah. Tetaplah tegar menghadapi mereka, sebab Allah bersama kamu untuk memenangkanmu."
  }
]