[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, bila kalian menghadapi orang-orang kafir dalam pertempuran, sedang mereka telah merangsek dekat kepada kalian, maka janganlah kalian berpaling lari memperlihatkan punggung-punggung kalian,sehingga kalian seperti pencundang di hadapan mereka. Akan tetapi, teguhlah kalian di hadapan mereka, sebab sesungguhnya Allah bersama kalian dan penolong kalian terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya! Apabila kalian berhadapan dengan orang-orang musyrik di medan perang dalam jarak dekat, janganlah kalian kalah dari mereka dan membelakangi mereka untuk melarikan diri. Tetapi teruslah menghadap ke arah mereka dan bersabarlah dalam menghadapi mereka. Karena Allah bersama kalian dengan pertolongan dan dukungan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Hai orang-orang yang beriman kepada Allah dengan sebenar-benarnya keimanan, jika kalian menghadapi orang-orang kafir yang datang untuk memerangi kalian, maka janganlah kalian melarikan diri dan berpaling ketakutan; namun hadapilah mereka dengan kekuatan dan keberanian kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. زَحْفًا(yang sedang menyerangmu) Yakni sedang kalian sedang berkumpul. فَلَا تُوَلُّوهُمُ الْأَدْبَارَ(maka janganlah kamu membelakangi mereka (mundur)) Allah melarang orang-orang yang beriman untuk melarikan diri dari orang-orang kafir apabila menemui mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15 Hai orang-orang yang beriman, apabila kamu bertemu dengan orang-orang yang kafir yang sedang menyerangmu, maka janganlah kamu takut/mundur dari mereka. Jangan kalian berbalik badan atau lari dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jika kalian bertemu orang-orang kafir yang mendekat} yang dekat dengan kalian {janganlah kalian berbalik membelakangi mereka} maka janganlah berbalik membelakangi mereka sebagai orang yang kalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Allah memerintahkan hamba hambaNya yang beriman dengan keberanian iman keteguhan dalam menjalankan perintahNya dan usaha untuk mendatangkan sebab sebab yang menguatkan hati dan badan. Dan Dia melarang mereka kabur pada saat dua pasukan telah bertemu. Dia berfirman ”hai orang orang yang beriman, apabila kamu bertemu dengan orang orang yang kafir yang sedang menyerangmu” yakni di barisan perang, pada saat pasukan saling serang dan sebagian mendekat kepada sebagian yang lain, ”maka janganlah kamu membelakangi mereka (mundur)” akan tetapi teguhkanlah dirimu untuk memerangi mereka dan sabarlah dalam menghadapi mereka karena hal itu berarti menolong agama Allah, menguatkan hati orang orang Mukminin, dan menakut nakuti orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 15",
    "description": "Setelah ayat-ayat yang lalu menjelaskan dukungan Allah terhadap kaum muslim dan kemenangan yang dianugerahkan kepada mereka, pada ayat ini Allah menjelaskan hakikat kemenangan dan tugas mereka ketika menghadapi musuh. Wahai orang yang beriman! apabila kamu bertemu dengan orang-orang kafir yang menentang Allah dan rasul-Nya dalam barisan yang akan menyerangmu dan mengancam keberada-anmu, maka janganlah kamu berbalik mundur membelakangi mereka, sehingga kalah. Tetaplah tegar menghadapi mereka, sebab Allah bersama kamu untuk memenangkanmu dan barang siapa yang tidak mempunyai keberanian menghadapi musuh lalu mundur pada waktu itu karena takut, melarikan diri, dan meninggalkan medan laga, kecuali berbelok untuk menerapkan siasat perang dengan berpura-pura seakan dia mundur, atau tujuannya membelakangi karena hendak menggabungkan diri dengan pasukan yang lain sebagai tambahan kekuatan, maka sungguh, orang itu kembali dengan membawa kemurkaan besar dari Allah, dan tempatnya kelak setelah kematiannya jika tidak bertobat ialah neraka jahanam, itulah seburuk-buruk tempat kembali."
  }
]