[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa diantara kalian membelakangi mereka dengan punggungnya saat pertempuran berkecamuk sengit, kecuali orang yang berbelok untuk memperdayai orang-orang kafir atau untuk bergabung dengan pasukan muslimin yang berada di tengah medan pertempuran di manapun mereka berada, sesunggguhnya ia telah memperoleh kemurkaan dari Allah, dan tempat tinggalnya adalah neraka jahanam. Itulah seburuk-buruk tempat kembali dan tempat berpulang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Barangsiapa yang membelakangi mereka untuk melarikan diri bukan untuk berbalik menyerang mereka dengan memperlihatkan gerakan seolah-olah melarikan diri untuk menipu mereka, padahal sesungguhnya ia hendak kembali lagi untuk menyerang mereka, atau tidak bergabung dengan kelompok Islam lain yang ada di sana untuk meminta pertolongan mereka, maka ia telah kembali dengan murka Allah dan ia berhak menerimanya. Dan tempatnya di akhirat ialah Neraka Jahanam. Seburuk-buruk akhir perjalanan adalah akhir perjalanannya. Dan seburuk-buruk tempat kembali adalah tempat kembalinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Dan barangsiapa yang melarikan diri dari mereka pada saat peperangan bukan untuk kemaslahatan seperti karena melihat tempat yang lebih baik untuk berperang atau karena ingin bergabung dengan pasukan lain agar menambah kekuatan dan serangan bagi musuh; maka dia telah melarikan diri dengan membawa kemurkaan besar dari Allah, dan tempat kembalinya di akhirat adalah neraka jahanam, dan itu adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَمَن يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُۥٓ (Barangsiapa yang membelakangi mereka (mundur) di waktu itu) Yakni barangsiapa yang memalingkan punggungnya untuk melarikan diri ketika orang-orang kafir menyerang. إِلَّا مُتَحَرِّفًا لِّقِتَالٍ (kecuali berbelok untuk (sisat) perang) Yakni berlari dari sisi ke sisi yang lain dalam perang untuk menyiasati peperangan dan menipu musuh, seperti orang yang mengelabuhi bahwa ia akan melarikan diri agar dikejar oleh musuh kemudian ia kembali menyerang dan menghadapinya. Karena peperangan merupakan adu siasat. أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ(atau hendak menggabungkan diri dengan pasukan yang lain) Yakni menuju pasukan muslimin yang lain yang tidak berhadapan langsung dengan musuh. فَقَدْ بَآءَ بِغَضَبٍ مِّنَ اللهِ(maka sesungguhnya orang itu kembali dengan membawa kemurkaan dari Allah) Yakni melarikan diri dengan membawa kemurkaan dari Allah, kecuali orang yang lari dari musuh untuk membuat siasat atau untuk bergabung dengan pasukan lain. وَمَأْوَىٰهُ جَهَنَّمُ ۖ (dan tempatnya ialah neraka Jahannam) Perbuatan melarikan diri itu menjerumuskannya kepada siksaan yang lebih berat daripada akibat dari menghadapi musuh yang ia takuti itu. وَبِئْسَ الْمَصِيرُ (Dan amat buruklah tempat kembalinya) Yaitu azab neraka yang menjadi tempat kembalinya itu. Disebutkan bahwa Rasulullah menyatakan bahwa orang yang melarikan diri ketika musuh menyerang merupakan termasuk dosa-dosa besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16 Barangsiapa yang membelakangi mereka atau mundur di waktu itu maka sesungguhnya orang itu kembali dengan membawa kemurkaan dari Allah. Kecuali berbelok untuk siasat perang atau hendak menggabungkan diri dengan pasukan yang lain untuk menyerang musuh. Adapun tempatnya di akhirat ialah neraka Jahannam. Dan amat buruklah tempat kembalinya.Dan apa yang kembali kepadanya adalah azab neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang pada waktu itu berpaling mundur} menunjukkan punggungnya {kecuali berbelok untuk perang} menunjukkan kekalahan sebagai siasat sedangkan dia ingin kembali lagi {atau hendak menggabungkan diri dengan pasukan yang lain} untuk bergabung dengan kelompok muslim yang hadir untuk meminta bantuan {dia pasti akan kembali} kembali {dengan membawa kemurkaan Allah. Tempatnya adalah neraka Jahanam. dan seburuk-buruk tempat kembali} tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “barangsiapa yang membelakangi mereka (mundur) di waktu itu kecuali berbelok untuk (siasat) perang atau hendak menggabungkan diri dengan pasukan yang lain, maka sesungguhnya orang itu kembali membawa kemurkaan dari Allah dan tempatnya ialah neraka jahanam. Dan amat buruklah tempat kembalinya. ” Ini menunjukan baha berlari dari medan perang tanpa alasan adalah termasuk dosa besar, sebagaimana hal itu dinyatakan oleh hadits hadits shahih. dan sebagaimana dinyatakan secara tegas dalam ayat ini akan ancaman yang keras atas perbuatan itu. mafhum ayat ini menunjukan bahwa orang yang berbelok untuk siasat dalam perang yaitu dia berpindah dari satu arah ke arah lainnya agar lebih leluasa untuk berperang dan lebih kuat dalam menghadapi musuh, tidaklah mengapa, karena dia tidak mundur untuk berlari. Dia hanyalah mundur untuk strategi agar dapat mengalahkan musuh, atau menyerang dari arah yang merupakan titik lengah atau lemah mereka, atau sebagai siasat siasat perang lainnya. Dan bahwa orang yang bergabung dengan pasukan lain yang membuatnya kuat dan membantunya dalam memerangi orang orang kafir juga di bolehkan, jika kelompok yang lain tersebut berada markas pasukan maka perkaranya jelas. Jika pasukan itu tidak di tempat perang seperti mundurnya kaum Muslimin yang lain maka terdapat atsar sahabat yang menunjukan bahwa hal itu dibolehkan. Mungkin ini dibatasi dengan apabila kaum muslimin mengira bahwa mundur dari medan perang lebih baik akibatnya dan lebih menjamin keberadaan mereka. Adapun jika mereka menduga bahwa kemenangan mereka atas kaum kafir adalah dengan keteguhan di depan mereka, maka sulit dikatakan bahwa ia termasuk keadaan yang di bolehkan, karena dalam keadaan tersebut sulit dibayangkan adanya berlari dari medan perang yang dilarang. Ayat ini bersifat mutlak, dan di akhir surat akan disebutkan pembatasannya dengan jumlah pasukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 16: Seperti memperlihatkan kepada musuh seakan-akan lari ke belakang sebagai tipu daya, padahal akan kembali menyerang atau berpindah dari satu tempat ke tempat lain agar lebih mudah memerangi. Yakni meminta bantuan kepada pasukan kaum muslimin yang lain. Jika pasukan lain berada dekat dengannya (di sekitar medan peperangan), maka masalahnya sudah jelas, yakni boleh. Tetapi apabila pasukan lain di luar medan peperangan, misalnya kaum muslimin kalah dan pergi menuju ke salah satu negeri kaum muslimin atau ke pasukan lain dari pasukan kaum muslimin, maka telah ada riwayat dari para sahabat yang menunjukkan bolehnya. Namun mungkin saja, hal ini apabila mundur lebih baik akibatnya, akan tetapi apabila mereka melihat jika tetap di tempat dapat mengalahkan musuh, maka dalam hal ini tidak termasuk keadaan yang diberi rukhshah (keringanan) sehingga mereka tidak boleh mundur. Ayat ini masih mutlak, dan akan disebutkan di akhir surat batasan jumlahnya yang membolehkan mundur. Hal ini apabila kaum kafir tidak berjumlah lebih dari dua kali lipat kaum muslimin sebagaimana akan diterangkan nanti. Ayat ini menunjukkan bahwa melarikan diri dari peperangan merupakan dosa yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 16",
    "description": "Dan barang siapa yang tidak mempunyai keberanian menghadapi musuh lalu mundur pada waktu itu karena takut, melarikan diri, dan meninggalkan medan laga, kecuali berbelok untuk menerapkan siasat perang dengan berpura-pura seakan dia mundur, atau tujuannya membelakangi karena hendak menggabungkan diri dengan pasukan yang lain sebagai tambahan kekuatan, maka sungguh, orang itu kembali dengan membawa kemurkaan besar dari Allah, dan tempatnya kelak setelah kematiannya jika tidak bertobat ialah neraka jahanam, itulah seburuk-buruk tempat kembaliapabila kamu telah memenangkan peperangan itu dan berhasil membunuh musuh, maka ketahuilah sesungguhnya itu bukan sematamata karena kekuatan kalian. Allahlah yang memenangkan kalian dan dialah yang membunuh mereka dengan jalan memberikan kekuatan pada kalian dan meniupkan ke dalam jiwa orang-orang kafir itu rasa takut dan gentar. Maka sebenarnya bukan kamu kaum muslim yang membunuh mereka pada saat perang badar, melainkan Allah yang membunuh mereka dengan jalan memberikan kekuatan pada kalian dan meniupkan ke dalam jiwa orang-orang kafir itu rasa takut dan gentar. Dan demikian pula bukan engkau nabi Muhammad yang melempar batu-batu kecil ketika engkau melempar, tetapi Allah yang melempar dengan menyampaikan lemparanmu itu ke muka orang-orang musyrik, karena akibat dari lemparan itu tidak mungkin terjadi jika yang melakukannya makhluk biasa. Allah berbuat demikian untuk membinasakan mereka dan untuk memberi kemenangan kepada orang-orang mukmin yang mantap imannya, dengan kemenangan yang baik. Sungguh, Allah maha mendengar doa dan ucapanmu, baik yang disembunyikan maupun yang dinyatakan, maha mengetahui apa yang lebih maslahat untuk hamba-Nya."
  }
]