[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bukanlah kalian wahai kaum mukminin, yang membunuh kaum musyrikin pada hari perang badar, akan tetapi Allah lah yang membunuh mereka, karena Dia yang menolong kalian untuk itu. Dan bukanlah kamu yang melempar mereka ketika kamu melempar (wahi nabi), akan tetapi Allah lah yang melemparkannya, karena Dia yang menyampaikan lemparan yang kamu lontarkan ke wajah-wajah kaum musyrikin. Hal itu untuk menguji kaum mukminin yang beriman kepada Allah dan rasulNya, dan mengantarkan mereka melalui jihad ini menuju derajat tertinggi, dan memberitahukan kepada mereka nikmat-nikmatNYa sehingga mereka bersyukur kepada Allah atas nikmat-nikmat itu. Sesungguhnya Allah maha mendengar doa kalian dan ucapan-ucapan kalian, baik yang kalian rahasiakan maupun yang kalian nyatakan terang-terangan, lagi maha mengetahui hal-hal yang mengandung kemaslahatan bagi hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Maka tidaklah kalian -wahai orang-orang mukmin- membunuh orang-orang musyrik dalam perang Badar dengan daya dan kekuatan kalian. Tetapi Allah-lah yang membantu kalian untuk itu. Dan tidaklah kamu -wahai Nabi- melempar orang-orang musyrik itu ketika kamu melempar mereka. Tetapi Allah-lah yang melempar mereka ketika Dia membuat lemparanmu sampai kepada mereka. Dan Allah hendak menguji orang-orang mukmin dengan kemenangan mereka atas musuh mereka kendati jumlah pasukan dan peralatan perang mereka sangat sedikit agar mereka bersyukur kepada-Nya. Sesungguhnya Allah Maha Mendengar doa dan ucapan kalian lagi Maha Mengetahui apa yang kalian perbuat dan apa yang terbaik untuk kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Kalian tidak memerangi mereka dengan kekuatan kalian, akan tetapi Allah-lah yang menjadikan kalian menang dengan kekuatan-Nya, dengan memasukkan rasa takut ke dalam hati mereka dan menguatkan hati kalian, dan mengirim kepada kalian pasukan malaikat, serta memberikan pertolongan dan perlindungan sehingga kalian dapat meraih kemenangan. Hai Muhammad, tidaklah kamu melempar segenggam tanah dan mengenai sasaran kecuali Allah-lah yang menepatkannya. Ketika perang terjadi, Rasulullah memasuki tendanya untuk berdoa dan meminta kemenangan dari Allah, kemudian dia keluar dan mengambil segenggam tanah, lalu melemparnya ke arah orang-orang musyrik; kemudian Allah menjadikannya tepat di wajah, mata, dan mulut mereka, sehingga tidak ada seorangpun dari mereka melainkan telah terkena lemparan itu; sehingga ketika itu tampak kelemahan mereka, sehingga mereka dapat dikalahkan. Kemudian Allah menjelaskan bahwa Dia Maha Kuasa untuk menolong orang-orang beriman dalam menghadapi orang-orang kafir tanpa melalui peperangan, akan tetapi Allah hendak menguji orang-orang beriman, dan meninggikan derajat mereka dengan jihad ke derajat yang paling tinggi, serta memberi mereka pahala yang baik dan besar. Allah Maha Mendengar dan Maha Melihat; Dia mendengar apa yang dirahasiakan dan yang ditampakkan oleh hamba-Nya, dan Maha Mengetahui niat yang ada dalam hati hamba-Nya; sehingga Dia menetapkan takdir dan ketetapan sesuai dengan ilmu dan hikmah-Nya, serta kemaslahatan hamba-Nya, Dan Dia membalas setiap hamba-Nya sesuai dengan niat dan amalannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَلَمْ تَقْتُلُوهُمْ وَلٰكِنَّ اللهَ قَتَلَهُمْ ۚ (Maka (yang sebenarnya) bukan kamu yang membunuh mereka, akan tetapi Allahlah yang membunuh mereka) Dengan kemudahan yang Allah berikan untuk kalian berupa sebab-sebab yang menjadikan kalian menang. وَمَا رَمَيْتَ إِذْ رَمَيْتَ(dan bukan kamu yang melempar ketika kamu melempar) Lemparan itu bukan dari Rasulullah pada perang Badar, ketika itu beliau mengambil segenggam tanah lalu beliau lemparkan ke wajah orang-orang musyrik dan mengenai setiap mereka sehingga memasuki kedua mata dan lubang hidung mereka. وَلٰكِنَّ اللهَ رَمَىٰ ۚ (tetapi Allah-lah yang melempar) Yakni sebenarnya kamu bukanlah yang melempar, karena seandainya kamu yang melemparkannya sebagaimana lemparan manusia pada umumnya maka tidak mungkin sampai mengenai kecuali seperti lemparan manusia biasa. Namun itu merupakan lemparan Allah karena mengenai sasaran secara luar biasa dan ketepatan yang tidak mungkin dilakukan manusia merupakan hasil pekerjaan Allah. وَلِيُبْلِىَ الْمُؤْمِنِينَ مِنْهُ بَلَآءً حَسَنًا ۚ (dan untuk memberi kemenangan kepada orang-orang mukmin, dengan kemenangan yang baik) Yakni untuk memberi kenikmatan kepada mereka dengan nikmat-nikmat yang baik maka Allah melakukan hal itu, dan bukan untuk sesuatu yang lain. إِنَّ اللهَ سَمِيعٌ(Sesungguhnya Allah Maha Mendengar) Mendengar doa mereka. عَلِيمٌ (lagi Maha Mengetahui) Mengetahui keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17 Maka sebenarnya bukan kamu dengan kekuatanmu yang mampu membunuh mereka, akan tetapi Allah-lah yang membunuh mereka dengan sebab pertolongan yang Dia turunkan. Bukan kamu wahai Nabi yang sebenarnya melempar ketika kamu melempari orang musyrik dengan batu, tetapi Allah-lah yang melempari orang musyrik sehingga lemparan itu menuju kepada mereka. Allah berbuat demikian untuk membinasakan orang musyrik itu tidak lain untuk memberi ujian kepada orang mukmin dengan nikmat yang baik dan agung dan untuk memberi kemenangan kepada orang-orang mukmin, dengan kemenangan yang baik. Bukan dengan amarah, agar mereka senantiasa bersyukur. Sesungguhnya Allah Maha Mendengar atas perkataan dan doa mereka lagi Maha Mengetahui atas kondisi mereka. Ayat ini turun menjelaskan tentang lemparan Nabi dengan batu dari lembah pada saat perang. Nabi melempari mereka dengan lemparan itu, hingga orang-orang musyrik tidak bersisa sama sekali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bukan kalian yang membunuh mereka, melainkan Allah yang membunuh mereka} kalian tidak membunuh mereka dengan kekuatan mereka melainkan Allahlah yang membunuh mereka dengan memberi pertolongan kepada kalian dan memperkuat kalian {dan bukan kamu yang melempar ketika kamu melempar, melainkan Allah yang melempar} kamu tidak melempar hati mereka dengan ketakutan ketika kami melempari wajah mereka dengan debu, melainkan Allahlah yang melempari hati mereka dengan ketakutan dan wajah mereka dengan debu {dan untuk memberi kemenangan kepada orang-orang mukmin dengan kemenangan yang baik} dan untuk memberi anugerah yang indah kepada orang-orang yang beriman dari sisiNya dengan kemenangan dan harta rampasan {Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Allah berfirman ketika orang orang musyrik kalah di perang badar dan kaum Muslimin berhasil membunuh mereka. ”maka (yang sebenarnya) bukan kamu yang membunuh mereka” dengan kemampuan dan kekuatanmu. ”akan tetapi Allah lah yang membunuh mereka” Dimana Dia membantu melakukan itu dengan apa yang telah disebutkan ”dan bukan kamu yang melempar ketika kamu melempar, tetapi Allah lah yang melempar” hal itu karena Nabi pada saat terjadi perang, beliau masuk ke kemah beliau. Beliau berdoa kepada Allah dan memohon pertolonganNya kemudian nabi keluar darinya lalu mengambil segenggam tanah dan menaburkannya ke wajah orang orang kafir, dan Allah menyampaikan tanah itu ke semua wajah mereka. Tidak seorangpun dari mereka kecuali tanah tersebut mengenai wajah, mulut, dan kedua matanya. Dalam kondisi tersebut kekuatan mereka luruh, semangat mereka melemah, dan nampaklah kegagalan dan kelemahan mereka, sehingga merekapun kalah. Allah berfirmankepada NabiNya ”ketika kamu melempar tanah dan ia sampai pada mata mereka, itu bukan dengan kekuatanmu, akan tetapi ia sampai kepada mereka dengan keuatan dan kemampuan kami” Allah berbuat demikian untuk membinasakan (mereka) dan untuk memberi kemenangan untuk orang orang Mukmin, dengan kemenangan yang baik ” yakni Allah Maha mampu memberi kemenangan kepada orang orang Mukmin atas orang orang kafir tanpa harus ada perang akan tetapi Allah hendak menguji orang orang Mukmin dan menyampaikan mereka dengan jihad ke derajat tertinggi dan maqam termulia serta memberi mereka pahala yang baik lagi besar. ”sesungguhnya Allah maha mendengar lagi maha mengetahui” Allah mendengar apa yang dirahasiakan dan ditampakkan oleh hamba. Dia mengetahui niat baik dan niat buruk yang disembunyikannya. Dia menakdirkan untuk hamba hamba ketentuan ketentuan yang sesuai dengan ilmuNYa, hikmahNYa dan kemaslahatan hambaNya. dan Dia membalas setiap hamba sesuai dengan niat dan amalNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 17: Ketika kaum musyrik telah kalah, maka dalam ayat ini Allah menerangkan, bahwa sesungguhnya yang membunuh dan melempar mereka adalah Allah. Thabrani meriwayatkan dari Hakim bin Hizam ia berkata, “Ketika perang Badar, Rasulullah shallallahu 'alaihi wa sallam memerintahkan (diambilkan batu kerikil), lalu Beliau mengambil segenggam batu kerikil dan menghadap kepada kami serta melempar kami dengannya. Beliau bersabda, “Muka-muka yang buruk.” Kami pun kalah, dan Allah Azza wa Jalla menurunkan firman-Nya, “Wa maa ramaita idz ramaita wa laakinnallaha ramaa (artinya: Dan bukan kamu yang melempar ketika kamu melempar, tetapi Allah yang melempar).” Haitsami dalam Majma’ juz 2 hal. 84 berkata, “Sanadnya hasan.” Menurut Syaikh Muqbil bahwa perkataannya “Sanadnya hasan” maksudnya adalah hasan lighairihi. Syaikh Muqbil juga menjelaskan, bahwa Haitsami menghasankannya karena hadits tersebut memiliki syawahid (penguat dari jalan lain) dan mutaba’ah (penguat dari jalan yang sama), karena ia menyebutkan setelahnya, dari Ibnu Abas bahwa Nabi shallallahu 'alaihi wa sallam bersabda kepada ‘Ali, “Berikanlah kepadaku segenggam batu kerikil.” Maka Ali memberikannya, lalu Beliau melemparkannya ke arah wajah-wajah kaum musyrik, sehingga tidak ada salah seorang di antara mereka kecuali kedua matanya penuh kerikil. Ketika itulah turun ayat, “Wa maa ramaita idz ramaita wa laakinnallaha ramaa.” Haitsami berkata, “Diriwayatkan oleh Thabrani. Para perawinya adalah para perawi kitab shahih.” Yaitu ghanimah. Ada pula yang menafsirkan, bahwa Allah Ta’ala sessungguhnya berkuasa untuk memenangkan kaum mukmin di atas orang-orang kafir tanpa perlu adanya peperangan, akan tetapi Allah ingin menguji orang-orang mukmin dengan jihad agar mereka mencapai derajat yang tinggi, kedudukan yang mulia dan mendapat pahala yang baik dan banyak. Allah mendengar apa yang dirahasiakan hamba dan apa yang ditampakkannya, dan mengetahui apa yang ada dalam hati manusia berupa niat yang baik dan yang buruk, sehingga Dia menetapkan untuk hamba taqdir yang sesuai ilmu-Nya, kebijaksanaan-Nya dan maslahat hamba-hamba-Nya, dan akan memberikan balasan masing-masingnya sesuai niat dan amalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 17",
    "description": "Apabila kamu telah memenangkan peperangan itu dan berhasil membunuh musuh, maka ketahuilah sesungguhnya itu bukan sematamata karena kekuatan kalian. Allahlah yang memenangkan kalian dan dialah yang membunuh mereka dengan jalan memberikan kekuatan pada kalian dan meniupkan ke dalam jiwa orang-orang kafir itu rasa takut dan gentar. Maka sebenarnya bukan kamu kaum muslim yang membunuh mereka pada saat perang badar, melainkan Allah yang membunuh mereka dengan jalan memberikan kekuatan pada kalian dan meniupkan ke dalam jiwa orang-orang kafir itu rasa takut dan gentar. Dan demikian pula bukan engkau nabi Muhammad yang melempar batu-batu kecil ketika engkau melempar, tetapi Allah yang melempar dengan menyampaikan lemparanmu itu ke muka orang-orang musyrik, karena akibat dari lemparan itu tidak mungkin terjadi jika yang melakukannya makhluk biasa. Allah berbuat demikian untuk membinasakan mereka dan untuk memberi kemenangan kepada orang-orang mukmin yang mantap imannya, dengan kemenangan yang baik. Sungguh, Allah maha mendengar doa dan ucapanmu, baik yang disembunyikan maupun yang dinyatakan, maha mengetahui apa yang lebih maslahat untuk hamba-Nya demikianlah karunia Allah yang dilimpahkan kepadamu, dan sungguh, Allah selalu melemahkan tipu daya orang-orang kafir sehingga tidak berhasil, agar mereka tunduk kepada kebenaran atau binasa. Karena itu jangan ragu menghadapi musuh-Musuh agama Allah kapan dan di mana pun."
  }
]