[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "perbuatan ini yaitu membunuh kamu musyrikin dan melempar mereka ketika mereka terkalahkan, serta cobaan baik berupa kemenangan kaum Mukminin atas musuh mereka, itu berasal dari Allah bagi kaum Mukminin. Dan bahwasannya Allah, (pada waktu yang akan datang) akan melemahkan dan menggugurkan tipu daya orang-orang kafir sampai mereka mejadi terhinaan dan tunduk kepada kebenaran atau mereka binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Hal-hal tersebut di atas -yaitu terbunuhnya orang-orang musyrik, dan tepatnya lemparanmu ke arah mereka hingga mereka mengalami kekalahan dan lari tunggang langgang, serta anugerah yang Allah berikan kepada orang-orang mukmin berupa kemenangan atas musuh mereka- adalah berasal dari Allah. Dan Allah lah yang melemahkan tipu daya orang-orang kafir terhadap Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Itulah karunia yang Aku berikan kepada kalian; berupa pemberian yang baik, pertolongan para malaikat, penurunan hujan bagi kalian, dan kekalahan orang-orang musyrik. Itu semua adalah kenikmatan yang Aku berikan kepada kalian. Selain itu, Akulah yang melemahkan tipu daya orang-orang kafir dan membatalkan makar mereka yang akan ditujukan kepada kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. ذٰلِكُمْ وَأَنَّ اللهَ مُوهِنُ كَيْدِ الْكٰفِرِينَ (Itulah (karunia Allah yang dilimpahkan kepadamu), dan sesungguhnya Allah melemahkan tipu daya orang-orang yang kafir) Yakni sesungguhnya tujuan dari kejadian yang telah dikisahkan dalam ayat-ayat yang telah disebutkan adalah untuk menguji orang-orang beriman dan melemahkan tipu daya orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18 Itulah karunia Allah yang dilimpahkan kepadamu pada saat perang Badar untuk menguji orang-orang mukmin dan untuk melemahkan tipu daya orang-orang yang kafir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu (karunia Allah) dan sesungguhnya Allah melemahkan} melemahkan {tipu daya orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18 “itulah karunia Allah yang dilimpahkan kepadamu” yakni kemenangan dari Allah kepadamu. ”dan sesungguhnya Allah melemahkan tipu daya orang orang yang kafir” yakni mematahkan segala makar dan tipu daya yang di lancarkan oleh musuh kepada islam dan kaum muslimin, dan menjadikan makar mereka menimpa diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 18: Allah melemahkan tipu daya dan makar orang-orang kafir yang mereka lancarkan kepada Islam dan pemeluknya, dan menjadikan tipu daya mereka berbalik menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 18",
    "description": "Demikianlah karunia Allah yang dilimpahkan kepadamu, dan sungguh, Allah selalu melemahkan tipu daya orang-orang kafir sehingga tidak berhasil, agar mereka tunduk kepada kebenaran atau binasa. Karena itu jangan ragu menghadapi musuh-Musuh agama Allah kapan dan di mana pundemikianlah Allah akan melemahkan tipu daya orang-orang kafir, oleh karenanya jika kamu kaum kafir meminta keputusan perihal siapa yang benar, dengan cara bergelantungan pada kain penutup kakbah, agar dia memutuskan perkara antara kamu dengan orangorang beriman, maka sesungguhnya keputusan telah datang kepadamu yaitu kemenangan kaum muslim pada perang badar; dan jika kamu berhenti memusuhi rasul dan tidak melakukan hal-hal lain yang tidak direstui Allah, maka itulah yang lebih baik bagimu; dan jika kamu kembali melakukan kedurhakaan serupa, dan memerangi nabi Muhammad dan para pengikutnya, niscaya kami kembali mengalahkan kamu dan memberi pertolongan kepada kaum muslim seperti saat perang badar; dan pasukanmu yang bergelimang dosa tidak akan dapat menolak sesuatu bahaya sedikit pun darimu, biarpun jumlah pasukan dan perlengkapannya banyak. Sungguh, Allah beserta orang-orang beriman yang percaya dan tunduk pada kebenaran."
  }
]