[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian meminta (wahai orang-orang kafir) dari Allah agar menimpakan hukuman dan siksaanNya pada orang-orang yang telah berbuat melampaui batas lagi berbuat zalim, maka sungguh Allah telah mengabulkan permintaan kalian, yaitu ketika Dia menimpakan pada kalian siksaanNya, sebagai peringatan keras bagi kalian dan pelajaran bagi orang-orang yang bertakwa. Dan apabila kalian berhenti (wahai orang-orang kafir), dari kekafiran kepada Allah dan rasulNya, serta memerangi nabiNya, Muahmmad , maka itu lebih baik bagi kalian di dunia dan akhirat kalian. Dan jika kalian kembali untuk berperang dan melawan Muhammad dan memerangi para pengikutnya yang beriman, kami akan kembali mengalahkan kalian sebagaimana kalian terkalahkan pada hari perang badar. Dan kelompok kalian tidak berguna bagi kalian sedikitpun sebagaimana tidak bermanfaat bagi kalian pada hari perang badar, walaupun jumlah pasukan dan persenjataan kalian banyak, dan sedikitnya jumlah kaum mukminin dan persenjataan mereka. Dan sesungguhnya Allah bersama kaum mukminin dengan dukungan dan pertolonganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Jika kalian -wahai orang-orang musyrik- meminta agar Allah menimpakan azab dan hukuman-Nya kepada orang-orang zalim yang melampaui batas, maka Allah benar-benar telah menimpakan apa yang kalian minta itu kepada diri kalian. Maka Allah menurunkan kepada kalian sesuatu yang menjadi hukuman bagi kalian dan menjadi pelajaran yang bisa dipetik oleh orang-orang yang bertakwa. Dan jika kalian menahan diri untuk tidak meminta hal itu, tentu akan lebih baik bagi kalian. Karena boleh jadi Allah akan memberikan tenggang waktu kepada kalian dan tidak segera menjatuhkan hukuman-Nya kepada kalian. Namun, jika kalian kembali meminta hal itu dan kembali menyerang orang-orang mukmin, maka Kami pun akan kembali menimpakan azab kepada kalian dan menolong orang-orang mukmin. Dan kalian tidak akan mendapatkan manfaat apa pun dari jumlah personel dan pendukung kalian, walaupun jumlah pasukan dan peralatan perang kalian lebih banyak daripada orang-orang mukmin. Sesungguhnya Allah bersama orang-orang mukmin dengan pertolongan dan dukungan-Nya. Dan siapa saja yang ditolong dan didukung oleh Allah pasti tidak ada yang dapat mengalahkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Kemudian Allah menujukan firman-Nya kepada orang-orang kafir yang kekafiran mereka membuat mereka berdoa agar Allah memberi kekalahan pada perang Badar bagi golongan yang paling sesat. Disebutkan bahwa orang-orang kafir Quraisy sebelum pergi menuju Badar, mereka bergantung pada kain penutup Ka'bah seraya berdoa: \"Ya Allah, berilah kemenangan kepada pasukan yang paling mendapat petunjuk. Dan disebutkan bahwa Abu Jahal berdoa ketika dua pasukan saling bertemu: \"Ya Allah, tunjudkanlah pada hari ini dari dua golongan yang paling memutus tali silaturahim di antara kita. Dan ini adalah permulaan doanya. Oleh sebab itu Allah menjelaskan kepada mereka dengan firman-Nya: \"Jika kalian meminta keputusan antara kalian dengan musuh-musuh kalian dari kaum muslimin, maka telah datang bagi kalian keputusan yang kalian minta itu. Allah telah menetapkan antara kalian dengan orang-orang beriman bahwa Dia akan memuliakan dan memenangkan mereka, karena mereka berada di atas kebenaran, dan akan menghinakan dan mengalahkan kalian karena kalian berada di atas kebatilan.\" Ketetapan Allah ini menyelisihi apa yang mereka inginkan. Maka firman yang ditujukan bagi orang-orang musyrik yang berbunyi (إن تستفتحوا فقد جاءكم الفتح) adalah sebagai olokan dan hinaan bagi mereka, sebagaimana firman-Nya: ذق إنك أنت العزيز الحكيم “Rasakanlah, sesungguhnya kamu orang yang perkasa lagi mulia.” Kemudian Allah memperingatkan mereka agar tidak terus-menerus di dalam kebatilan, setelah Allah mendorong mereka agar mau mengikuti kebenaran. Allah berfirman kepada mereka: \"Jika kalian kembali memerangi dan memusuhi Rasulullah dan orang-orang beriman, maka Kami akan kembali memberi kalian kekalahan dan kehinaan, dan memberi orang-orang beriman kemenangan dan kemuliaan. dan pasukan kalian sebanyak apapun tidak akan mampu mencegah sedikitpun kekalahan dan kehinaan yang Allah tetapkan bagi kalian.\" Allah menutup ayat ini dengan peneguhan bagi orang-orang beriman, dan pemberian ketenangan bagi jiwa mereka dengan menegaskan bahwa Dia bersama orang-orang beriman dengan bala bantuan dan pertolongan-Nya. Dan barangsiapa yang Allah bersamanya niscaya dia akan menang meskipun jumlah dan perbekalannya sangat sedikit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. إِن تَسْتَفْتِحُوا۟ فَقَدْ جَآءَكُمُ الْفَتْحُ ۖ (Jika kamu (orang-orang musyrikin) mencari keputusan, maka telah datang keputusan kepadamu) Kalimat ini ditujukan bagi orang-orang kafir sebagai olokan bagi mereka, karena mereka sebelum mereka keluar dari kota Makkah untuk berperang mereka momohon kepada Allah agar memberi kemenangan kepada golongan yang paling berhak untuk menang. وَإِن تَنتَهُوا۟( dan jika kamu berhenti) Dari kekafiran dan permusuhan yang kalian lakukan. فَهُوَ(maka itulah) Yakni berhenti itu. خَيْرٌ لَّكُمْ ۖ وَإِن تَعُودُوا۟( yang lebih baik bagimu; dan jika kamu kembali) Kembali kepada kekafiran dan permusuhan. نَعُدْ (niscaya Kami kembali (pula)) Dengan menjadikan orang-orang beriman berkuasa dan menolong mereka atas kalian, sebagaimana Kami memenangkan mereka di perang Badar. وَلَن تُغْنِىَ عَنكُمْ فِئَتُكُمْ (dan angkatan perangmu sekali-kali tidak akan dapat menolak dari kamu sesuatu bahayapun) Yakni kaum mereka yang ada di Makkah. وَأَنَّ اللهَ مَعَ الْمُؤْمِنِينَ (dan sesungguhnya Allah beserta orang-orang yang beriman) Dan barangsiapa yang bersama Allah maka ia akan dimenangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19 Jika kamu orang-orang musyrikin mencari kemenangan dan pertolongan dalam perang, maka Allah lebih berhak untuk memilih menolong orang-orang yang berdoa kepada Allah ketika mereka keluar dari kota Makkah. Telah datang keputusan kepadamu berupa pertolongan; kebatilan telah dikalahkan, orang-orang yang berbuat batil telah binasa. Jika kalian tidak kafir dan memerangi Rasul lagi maka itu lebih baik bagi kalian di dunia dan akhirat. Namun jika kamu kembali lagi memerangi orang muslim dan membunuh mereka, niscaya Kami akan kembali pula; dan angkatan perangmu sekali-kali tidak akan dapat menolak dari kamu sesuatu bahayapun, biarpun jumlah tentaramu banyak dan sesungguhnya Allah beserta orang-orang yang beriman dengan memberi pertolongan. Ayat ini turun ketika Abu Jahal berkata: Ya Allah tolonglah para pemuka dua kelompok ini, dan para pembesarnya, dan orang-orang musyrik pun berkata demikian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian meminta putusan} wahai orang-orang kafir kalian meminta kepada Allah agar dia meletakkan azabNya kepada orang-orang yang zalim {sungguh telah datang kepada kalian putusan itu} Sungguh Allah telah meletakkan atas kalian apa yang kalian cari {Jika kalian berhenti maka itu lebih baik bagi kalian. Jika kalian kembali (melakukan kezaliman), maka Kami akan kembali (mengalahkan kalian). Pasukan kalian} kelompok kalian {sedikit pun tidak akan dapat menolak bahaya pada kalian meskipun banyak. Sesungguhnya Allah bersama orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19 “jika kamu mencari keputusan” wahai orang orang yang musyrikin, yakni kamu menuntut Allah menurunkan siksa dari azabNya kepada orang orang zhalim lagi melampaui batas, ”maka telah datang keputusan kepadamu” ketika Dia menimpakan kepadamu azabNya sebagai hukuman bagimu dan pelajaran bagi orang orang yang bertakwa. ”dan jika kamu berhenti” menuntut datangnya keputusan, ”maka itulah yang lebih baik bagimu” karena mungkin Dia memberimu tempo dan tidak menyegerakan azabNya “dan jika kamu kembali” menuntut keputusan dan memerangi tentara Allah yaitu orang orang Mukmin, ”niscaya kami kembali (pula)” memenangkan tentara kami atasmu “dan angkatan perangmu sekali kali tidak akan menolak dari kamu sesuatu bahya pun” yakni penolongmu dan pembantumu yang berperang dengan sengaja melawan mereka. ”dan sesunggguhnya Allah beserta orang orang yang beriman” barangsiapa yang Allah bersamanya, niscaya dia akan menang meskipun dia lemah dan kekuatannya minim. Ma’iyah (kebersamaan) ini yang Allah kabarkan bahwasanya dengannya Dia membantu orang orang yang beriman adalah dengan sesuai amal amal iman yang mereka kerjakan, jika terkadang musuh menang atas orang orang Mukmin dalam beberpa waktu, maka hal itu tidak lain kecuali karena kelalaian dari kaum mukminin dan karena mereka tidak melakukan apa yang menjadi tuntutan keimanannya, dan jika seandainya mereka melaksanakan perintah Allah dari berbagai segi, niscaya tidak ada panji mereka yang terkalahkan dan tidak ada musuh yang mengungguli mereka untuk selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 19: Yakni keputusan dari Allah dengan menimpakan azab kepada orang yang zalim dan salah. Ibnu Jarir meriwayatkan dari Abdullah bin Tsa’labah bin Shaghir ia berkata, “Orang yang meminta keputusan pada perang Badar adalah Abu Jahal, ketika dia berkata, “Ya Allah, siapakah di antara kami yang lebih memutuskan tali silaturrahim dan datang membawa sesuatu yang tidak kami kenali? Oleh karena itu, binasakanlah ia pada pagi hari ini.” Maka Allah menurunkan ayat, “In tastaftihuu faqad jaa’akumul fat-h.” Hadits ini asalnya ada dalam Musnad juz 5 hal. 431, namun di sana tidak diterangkan tentang turunnya ayat tersebut. Hakim meriwayatkannya dan berkata, “Hadits ini shahih sesuai syarat dua syaikh (Bukhari-Muslim), namun keduanya tidak menyebutkannya”, tetapi Muslim tidak meriwayatkan hadits Abdullah bin Ta’labah, oleh karena itu hanya sesuai syarat Bukhari saja, dan Adz Dzahabi mendiamkannya. Al Haafizh Ibnu Katsir dalam tafsirnya menyandarkannya kepada Nasa’i, dan Al Waahidiy menyebutkannya dalam Asbaabunnuzul. Dengan membinasakan yang layak dibinasakan, yaitu Abu Jahal dan orang-orang yang terbunuh bersamanya. Dari kekufuran dan dari memerangi Rasulullah shallallahu 'alaihi wa sallam. Maksudnya kembali memusuhi dan memerangi Rasul. Barang siapa Alah bersamanya, maka dialah yang akan tertolong meskipun ia lemah dan jumlahnya sedikit. Kebersamaan Allah ini dengan memberikan bantuan dan pertolongan sesuai amalan iman yang mereka kerjakan. Oleh karena itu, apabila terjadi kekalahan pada kaum muslimin di sebagian waktu, maka hal itu tidak lain karena sikap remeh mereka dan tidak mengerjakan kewajiban iman dan konsekwensinya. Karena jika mereka melakukan apa yang diperintahkan Allah, tentu mereka tidak akan kalah dan musuh tidak akan menang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 19",
    "description": "Demikianlah Allah akan melemahkan tipu daya orang-orang kafir, oleh karenanya jika kamu kaum kafir meminta keputusan perihal siapa yang benar, dengan cara bergelantungan pada kain penutup kakbah, agar dia memutuskan perkara antara kamu dengan orangorang beriman, maka sesungguhnya keputusan telah datang kepadamu yaitu kemenangan kaum muslim pada perang badar; dan jika kamu berhenti memusuhi rasul dan tidak melakukan hal-hal lain yang tidak direstui Allah, maka itulah yang lebih baik bagimu; dan jika kamu kembali melakukan kedurhakaan serupa, dan memerangi nabi Muhammad dan para pengikutnya, niscaya kami kembali mengalahkan kamu dan memberi pertolongan kepada kaum muslim seperti saat perang badar; dan pasukanmu yang bergelimang dosa tidak akan dapat menolak sesuatu bahaya sedikit pun darimu, biarpun jumlah pasukan dan perlengkapannya banyak. Sungguh, Allah beserta orang-orang beriman yang percaya dan tunduk pada kebenaran kemenangan gemilang yang diraih kaum muslim pada perang badar adalah karena ketaatan mereka mengikuti petunjuk Allah dan rasulnya. Di sisi lain, malapetaka yang dialami oleh kaum musyrik adalah karena pembangkangan dan keberpalingan mereka dari tuntunan-Nya, karena itu ayat ini mengingatkan, wahai orang-orang yang beriman! taatlah kepada Allah dan rasul-Nya, yakni buktikan keimananmu dalam sikap dan tingkah laku, dan janganlah kamu berpaling sedikit dan sesaat pun dari-Nya, padahal kamu mendengar perintah-perintah-Nya yang disampaikan kepadamu,"
  }
]