[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sesungguhnya orang-orang yang beriman kepada Allah dengan sebenarnya, mereka hanyalah orang-orang yang apabila disebut Nama Allah, hati mereka merasa takut, dan apabila dibacakan kepada mereka ayat-ayat al-qur’an bertambahlah keimanan mereka bersama keimanaan yang sudah ada. Karena mentadaburi makna-makna nya. Dan hanya kepada Allah mereka itu bertawakal, sehingga tidak mengharapkan selainNya dan tidak takut kepada SelainNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Sesungguhnya orang-orang mukmin sejati ialah orang-orang yang apabila nama Allah -Subḥānahu wa Ta'ālā- disebut maka hati mereka merasa takut, kemudian hati dan tubuh mereka tergerak untuk taat (kepada-Nya). Apabila ayat-ayat Allah dibaca, maka mereka merenungkannya sehingga iman mereka terus bertambah dan bertambah. Dan hanya kepada Rabb mereka saja mereka bersandar dalam meraih kebaikan dan menghindari keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Lalu Allah menjelaskan sifat-sifat dari orang-orang beriman: Pertama, jika disebutkan nama dan sifat-sifat Allah di depan mereka, maka hati mereka menjadi takut karena tunduk pada keagungan-Nya dan takut siksaan-Nya serta berharap pahala-Nya. Hal ini karena mereka telah mengenal Allah dengan benar dan memuliakan-Nya dengan pemuliaan yang sesungguhnya. Sifat kedua dari orang-orang beriman adalah jika dibacakan kepada mereka ayat-ayat Allah maka akan bertambah kuat keimanan mereka karena keyakinan mereka yang kokoh, kesegeraan mereka menjalankan amal sholih, dan keluasan ilmu yang mereka miliki. Ini merupakan dalil yang paling penting bahwa keimanan dapat berkurang dan bertambah. Dan sifat ketiga adalah mereka senantiasa bertawakal kepada Tuhan yang telah menciptakan mereka dengan kekuasaancnya dan memelihara mereka dengan kenikmatan dari-Nya, sehingga mereka tidak berharap kepada selain-Nya, tidak menghadap kecuali kepada-nya, tidak meminta hajat kecuali dari-Nya, dan mereka mengetahui bahwa segala yang Dia kehendaki akan terjadi dan apa yang tidak Dia kehendaki tidak akan terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَجِلَتْ قُلُوبُهُمْ (gemetarlah hati mereka) Yakni hadirnya ketakutan kepada Allah ketika Dia disebutkan adalah sifat dari orang-orang beriman. وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ (dan hanya kepada Tuhanlah mereka bertawakkal) Tidak kepada selain-Nya. Tawakkal kepada Allah yakni menyerahkan segala urusan kepada-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tadabbur 'amaly : { إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ } \"Sesungguhnya orang-orang yang beriman ialah mereka yang bila disebut nama Allah gemetarlah hati mereka\" , As-Suddy mengatakan : \"Seperti halnya seorang laki-laki yang dihadapkan oleh maksiat namun ia berdzikir mengingat Allah; lalu ia pun terhindar dari maksiat itu\" 2 ). Bukanlah banyaknya jumlah bacaan qur'an yang menjadi tujuan utama, melainkan bagaimana perubahan yang kamu dapati dalam dirimu setelah membaca ayat-ayat suci itu ?. Benrhentilah sejenak kamu untuk kamu renungkan kebaikan apa saja yang telah dihasilkan oleh dirimu, kemudian kamu mengamati ayat ini : { إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ }. 3 ). Jika seorang hamba mencoba merasakan manisnya iman dan ia menemukan rasa dan manisnya, sesungguhnya akan nampak berbagai kebaikan dari manisnya iman itu pada lisannya dan anggota badannya; lisannya akan merasakan manisnya berdzikir kepada Allah, dan badannya akan semakin cepat dan giat dalam menjalankan ketaatan kepada Allah. Dan hal itu telah dibuktikan dalam firman Allah : { إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ } \"Sesungguhnya orang-orang yang beriman ialah mereka yang bila disebut nama Allah gemetarlah hati mereka, dan apabila dibacakan ayat-ayat-Nya bertambahlah iman mereka (karenanya), dan hanya kepada Tuhanlah mereka bertawakkal\". 4 ). Keadaan orang beriman ketika dibacakan kepadanya al-qur'an : { وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا } \"dan apabila dibacakan ayat-ayat-Nya bertambahlah iman mereka\" ; karena mereka menyiapkan pendengaran untuk ayat-ayat yang agung itu, dan mereka juga menghadirkan hati untuk menghayati maknanya, maka tatkala itulah keimanan mereka akan bertambah. 5 ). { وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا } Apakah kita termasuk diantara orang-orang yang ketika mendengarkan ayat suci al-1ur'an kemudian keimanan kita bertambah, atau justru kita termasuk orang yang mendegarkan al-qur'an hanya karena kesenangan dan takjub, maka tatkala ayat-ayat itu dibacakan tidaklah ia sampai ke hati dan terhenti di telinga saja ?."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2 Sesungguhnya orang-orang imannya sempurna ialah mereka yang bila disebutkan nama Allah maka gemetarlah hati mereka atas keagungan nama-Nya. Apabila dibacakan ayat-ayatNya maka bertambahlah iman mereka, dan hanya kepada Tuhanlah mereka menyerahkan urusannya dengan penuh keteguhan, bukan kepada lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang mukmin adalah mereka yang jika disebut nama Allah, gemetar} takut dan bergetar {hati mereka dan jika dibacakan} dibacakan {ayat-ayatNya kepada mereka, bertambah iman mereka dan hanya kepada Tuhannya mereka bertawakal} bergantung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. karena iman ada dua bagian, yaitu iman yang sempurna yang menghasilkan pujian dan keberuntungan yang sempurna, dan iman yang selain itu, maka disini Allah menyebutkan yang pertama yaitu iman yang sempurna Dia berfirman ”sesungguhnya orang-orang yang beriman itu” Alif dan Lam menunjukan kecakupan terhadap cabang cabang iman, ”adalah mereka yang apabila disebut nama Allah, bergetarlah hati mereka” yakni takut kepada Allah sehingga ia menahan dirinya dari yang haram, karena bukti ketakutan kepada Allah yang paling besar adalah mengendalikan pemiliknya dari dosa dosa ”dan apabila dibacakan kepada mereka ayat-ayatNya bertambahlah iman mereka (karenanya)” hal itu karena mereka menyimaknya dengan baik dan menghadirkan hati untuk merenungkannya. Dengan itu iman mereka bertambah, karena merenungkan termasuk perbuatan hati, dan juga karena mereka akan menemukan makna yang baru yang sebelumnya belum mereka ketahui dan mengingat apa yang telah mereka lupakan, atau memunculkan keinginan dalam hati mereka kepada kebaikan dan kerinduan kepada kemuliaan Allah, atau memunculkan rasa takut berbuat dosa dan azab Allah yang semua itu akan menambah keimanan. ”dan kepada Rabblah” semata tanpa sekutu bagiNya ”mereka bertawakal” yakni mereka menyandarkan hati mereka kepada Allah dalam mendatangkan kemaslahatan dan menolak kemudaratan, baik dalam urusan agama maupun duniawi. Mereka percaya bahwa Allah akan melakukan itu, dan tawakal adalah pendorong kepada seluruh amal, dimana amal itu tidak ada dan tidak sempurna tanpanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 2: Oleh karena iman terbagi menjadi dua bagian; iman yang sempurna yang menjadikan pemiliknya dipuji, disanjung dan memperoleh keberuntungan yang sempurna, dan iman yang kurang, maka pada ayat di atas Alah Subhaanahu wa Ta'aala menerangkan tentang iman yang sempurna. Maksudnya orang mukmin yang sempurna imannya. Yakni ancaman-Nya.. Hatinya takut sehingga membuatnya menjauhi larangan Allah dan bertakwa kepada-Nya. Hal itu, karena takut kepada Alah merupakan penghalang terbesar seseorang mengerjakan larangan-larangan Allah dan pendorong utama seseorang mengerjakan perintah-perintah-Nya. Karena mereka memasang telinganya dan menghadirkan hatinya untuk mentadabburinya sehingga imannya bertambah, tentunya mereka mengetahui makna yang dikandung ayat tersebut, mengingat apa yang telah mereka lupakan, adanya kecintaan kepada kebaikan, rindu dengan keutamaan dari sisi Allah, takut terhadap siksa-nya dan menghindari maksiat, semua ini dapat menambah imannya. Mereka bersandar kepada Alah dalam mendatangkan maslahat dan menghindarkan madharrat dan yakin kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 2",
    "description": "Sebagian sifat mereka yang menyandang predikat mukmin sejati disebutkan di sini, yaitu; sesungguhnya orang-orang yang beriman kepada Allah dengan sebenar-benarnya, yang mantap keimanannya, adalah mereka yang apabila disebut nama Allah dengan sifat-sifat keagungan dan kemuliaan-Nya gemetar hatinya karena mereka sadar akan kekuasaan dan keagungan-Nya, dan apabila dibacakan oleh siapa pun ayat-ayatnya kepada mereka, bertambah kuat imannya. Semakin mereka mendengar ayat-ayat Al-Qur'an dibacakan, semakin kokoh keimanan mereka dan semakin mendalam rasa tunduk serta semakin bertambah pengetahuan mereka pada Allah. Dan oleh karena itu, hanya kepada tuhan mereka senantiasa bertawakal dan berserah diri setelah berusaha keras, sehingga tidak berharap dan gentar kepada selain-Nya. Selain memiliki keimanan yang mantap dan kuat, serta amal kalbu lainnya, secara lahiriah orang mukmin sejati adalah orang-orang yang melaksanakan salat secara berkesinambungan sesuai waktu dan tatacara yang telah ditetapkan, dengan penuh rasa khusyuk dan ikhlas, dan mereka yang menginfakkan sebagian dari rezeki yang kami berikan kepada mereka sesuai ketentuan."
  }
]