[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian wahai kaum mukminin, menjadi orang-orang yang terjerumus dalam penentangan terhadap Allah dan rasulNya seperti kaum musyrikin dan kaum munafikin yang bila mendengar kitabullah dibacakan kepada mereka, mereka berkata, ”kami telah mendengarnya dengan telinga-telinga kami,” namun mereka sebenarnya tidak merenungi apa yang mereka dengar dan tidak memikirkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan janganlah kalian -wahai orang-orang mukmin- bersikap seperti orang-orang munafik dan orang-orang musyrik yang apabila dibacakan ayat-ayat Allah kepada mereka maka mereka berkata, “Kami mendengar dengan telinga kami ayat-ayat Al-Qur`ān yang dibacakan kepada kami.” Akan tetapi mereka tidak mendengarnya sambil merenungkan maknanya dan mengambil pelajaran lalu mendapatkan manfaat darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Dan janganlah sekali-kali kalian menyerupai orang-orang kafir dan munafik yang mengaku telah mendengarkan dengan berkata: 'kami telah mendengar'. Padahal mereka belum mendengarkan dengan sungguh-sungguh, sebab mereka tidak mempercayai apa yang mereka dengar, sehingga mereka tidak mendapat manfaat darinya; bahkan mereka mengacuhkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَلَا تَكُونُوا۟ كَالَّذِينَ قَالُوا۟ سَمِعْنَا (dan janganlah kamu menjadi seperti orang-orang (munafik) vang berkata “Kami mendengarkan) Mereka adalah orang-orang munafik atau orang-orang Yahudi. Karena mereka mendengar seruannya dengan telinga mereka namun tidak memahami dan tidak menjalankannya maka mereka seperti orang yang tidak mendengar. Atau yang dimaksud adalah bahwa mereka mendengar seruan namun tidak menjawab dan hanya berkata “kami mendengar namun kami tidak mentaatinya”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Begitu banyak diantara manusia yang mengatakan tatkala ia mendengarkan ayat-ayat Allah : ayat ini diturunkan pada orang-orang kafir atau munafiq, bukan pada orang seperti saya yang beriman, dan jika saja dalam mereka ada sifat yang dilarang oleh ayat itu, dan ayat itu memberi peringatan kepada mereka dari sifat-sifat itu dan dari perbuatan itu, maka sesungguhnya mereka menyadari bahwa diri mereka termasuk ke dalam golongan orang-orang yang : { قَالُوا سَمِعْنَا وَهُمْ لَا يَسْ } \"vang berkata \"Kami mendengarkan, padahal mereka tidak mendengarkan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Janganlah kamu menjadi seperti orang-orang munafik dan musyrik serta Yahudi vang berkata dan menunjukkan “Kami mendengarkan,” padahal mereka tidak mendengarkan. Mereka mendengar dengan teling tapi tidak faham dan tidak mengerjakan. Selamanya mereka tidak mendengarkan dengan sungguh-sungghuh dan kefahaman sedikitpun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menjadi seperti orang-orang yang berkata,“Kami mendengarkan.” Sedangkan mereka tidak mendengarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21 “dan janganlah kamu menjadi orang orang (munafik) yang berkata 'kami mendengarkan padahal mereka tidak mendengarkan” yakni jangan merasa cukup dengan klaim kosong yang tanpa hakikat, karena hal tersebut tidak diridhai oleh Allah dan rasulNya. iman bukanlah dengan angan-angan dan impian, akan tetapi ia adalah apa yang menancap dalam hati dan dibenarkan oleh perbuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 21: Yakni tidak mendengar sambil mentadaburi dan mengambil pelajaran daripadanya. Maksud ayat ini adalah janganlah kita hanya menyampaikan di lisan dakwaan yang tidak ada hakikatnya, karena yang demikian tidak diridhai Allah dan Rasul-Nya, dan lagi iman bukan sekedar angan-angan dan hiasan, akan tetapi iman sesungguhnya yang menancap di hati dan dibenarkan oleh amalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 21",
    "description": "Dan janganlah kamu menjadi seperti orang-orang munafik atau musyrik yang berkata, kami mendengarkan, yakni mengetahui apa yang disampaikan kepada kami, padahal mereka terus-menerus tidak mendengarkan dan tidak mengamalkan karena hati mereka mengingkarinya. Ayat ini secara tidak langsung menyindir orang-orang yang mendengar tuntunan agama tetapi enggan mengamalkannya, yaitu dengan mengingatkan bahwa sesungguhnya makhluk bergerak yang bernyawa yang paling buruk, termasuk manusia, dalam pandangan Allah ialah mereka yang tuli, sehingga tidak dapat mendengar tuntunan dan memahami kebenaran, dan bisu sehingga tidak dapat berbicara, yaitu orang-orang yang tidak mengerti. Mereka memang tidak mau mendengar, mengatakan, dan memikirkan yang benar."
  }
]