[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sesungguhnya seburuk-buruk makhluk yang berjalan di muka bumi di sisi Allah, (dari makhluk-makhluk Allah) adalah manusia-manusia tuli yang telinga-telinga mereka tertutup rapat untuk mendengar kebenaran, sehingga tidak dapat mendengarnya, manusia bisu yang mulut-mulut mereka terkunci untuk mengatakan kebenaran, sehingga tidak dapat mengucapkannya.Mereka itu adalah orang-orang yang tidak memahami perintah dan larangan dari Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sesungguhnya seburuk-buruk makhluk yang ada di muka bumi ini menurut Allah ialah orang-orang tuli yang tidak bisa mendengar kebenaran dengan pendengaran yang membuatnya bisa menerimanya dan orang-orang bisu yang tidak mau menyerukannya. Mereka itulah orang-orang yang tidak bisa memahami perintah-perintah Allah dan larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Kemudian Allah menyebutkan sifat orang-orang kafir dan munafik serta orang-orang yang seperti mereka, dengan sifat yang menjadikan orang-orang yang berakal menjauhi mereka. Allah berfirman: \"Sesungguhnya makhluk melata yang paling buruk di muka bumi di sisi Allah adalah orang-orang yang tuli dari kebenaran agar mereka tidak mendengarnya untuk mendapat ibrah dan pelajaran, berpaling darinya, dan tidak memahaminya, serta lebih memilih siapa yang membawa mudharat bagi mereka. Mereka adalah makhluk yang paling buruk disisi Allah dari seluruh hewan melata lainnya.\" Allah menyerupakan orang-orang kafir dengan binatang, bahkan lebih buruk darinya; karena orang kafir tidak mendengar dan tidak mengatakan kebenaran sebagaimana binatang, dan orang kafir butuh makan sebagaimana binatang juga membutuhkannya, akan tetapi orang kafir membawa kemudharatan sedangkan hewan tidak membawa kemudharatan. Maka bagaimana mereka tidak lebih buruk darinya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. إِنَّ شَرَّ الدَّوَآبِّ (Sesungguhnya binatang (makhluk) yang seburuk-buruknya) Yakni makhluk yang merayap di tanah. عِندَ اللهِ(pada sisi Allah ialah) Yakni dalam hukum Allah. الصُّمُّ الْبُكْمُ(orang-orang yang pekak dan tuli) Yang tidak dapat mendengar dan tidak dapat berbicara. Mereka disifati seperti itu padahal mereka mampu mendengar dan berbicara karena mereka tidak memanfaatkan pendengaran dan kemampuan bicara mereka. الَّذِينَ لَا يَعْقِلُونَ (yang tidak mengerti apa-apapun) Yakni tidak memahami apa yang bermanfaat bagi mereka untuk mereka datangi, dan tidak memahami apa yang berbahaya bagi mereka untuk mereka jauhi; maka mereka lebih buruk daripada hewan melata di sisi Allah, karena hewan dapat sedikit membedakan apa yang bermanfaat dan yang berbahaya bagi dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22 Sesungguhnya binatang/makhluk yang paling buruk di sisi Allah ialah; orang-orang yang pekak dan tuli dari mendengarkan kebenaran. Juga mereka yang tidak mampu mengatakan kebenaran, mereka yang tidak amu berfikir dan tidak mau memahami apa yang bermanfaat dan mana yang buruk baginya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya seburuk-buruk makhluk yang bergerak di atas bumi di sisi Allah adalah mereka yang tuli} orang-orang yang tidak mau mendengar kebenaran {dan bisu} orang-orang yang tidak mau mengatakan kebenaran {yaitu orang-orang yang tidak mau berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22 Allah berfirman ”sesungguhnya binatang (makhluk) yang seburuk-buruknya pada sisi Allah” yakni orang-orang yang peringatan dan ayat ayat Allah tidak berguna bagi mereka dan mereka “ialah orang orang yang tuli” dari mendengar kebenaran, ”dan bisu” dari menyuarakan kebenaran, ”yang tidak mengerti apa apa” yang bermanfaat bagi mereka dan terpengaruh dari apa yang merugikan mereka. Mereka itu lebih buruk di sisi Allah daripada binatang yang buruk, karena Allah telah memberi mereka pendengaran, penglihatan, dan hati agar digunakan dalam ketaatan kepadaNya, tetapi mereka menggunakannya untuk bermaksiat kepadaNya. Dengan itu mereka banyak kehilangan kebaikan. Mereka berada di ujung jalan yang membawa mereka untuk menjadi makhluk mulia, tetapi mereka menolak jalan itu dan mereka malah memilih menjadi manusia yang buruk. Pendengaran yang dinafikan oleh Allah dari mereka adalah pendengaran yang berpengaruh kepada hati. adapun pendengaran yang merupakan hujjah maka ia telah tegak atas mereka dengan ayat-ayatNya yang mereka dengar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 22: Maksudnya manusia yang paling buruk di sisi Allah ialah yang tidak mau mendengar, menuturkan dan memahami kebenaran. Ayat-ayat dan peringatan sama sekali tidak bermanfaat bagi mereka. Mereka ini disebut Allah sebagai orang-orang yang tidak mengerti, yakni tidak mengerti hal yang bermanfaat bagi mereka, dan tidak mengutamakannya di atas madharrat. Mereka ini di sisi Allah lebih buruk dari semua makhluk bergerak, karena Alah Ta’ala telah memberikan mereka pendengaran, penglihatan dan hati agar mereka menggunakannya untuk memahami ayat-ayat Allah dan menaati-Nya, namun mereka menggunakannya untuk maksiat sehingga terhalang dari banyak kebaikan. Mereka sesungguhnya dapat mendengar, akan tetapi tidak masuk ke dalam hati, mereka hanya mendengar sesuatu yang menjadi hujjah atas mereka, dan mereka tidak mendengar sesuatu yang bermanfaat bagi mereka karena Alah mengetahui bahwa dalam hati mereka tidak ada kebaikan sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 22",
    "description": "Ayat ini secara tidak langsung menyindir orang-orang yang mendengar tuntunan agama tetapi enggan mengamalkannya, yaitu dengan mengingatkan bahwa sesungguhnya makhluk bergerak yang bernyawa yang paling buruk, termasuk manusia, dalam pandangan Allah ialah mereka yang tuli, sehingga tidak dapat mendengar tuntunan dan memahami kebenaran, dan bisu sehingga tidak dapat berbicara, yaitu orang-orang yang tidak mengerti. Mereka memang tidak mau mendengar, mengatakan, dan memikirkan yang benar. Masih berkaitan dengan mereka yang tidak mendengar dan tidak menggunakan akalnya, ayat ini menegaskan sekiranya Allah berkehendak mengetahui dengan ilmu-Nya yang azali, bahwa ada keinginan untuk menerima dan mengamalkan kebaikan pada mereka, tentu dia jadikan mereka dapat mendengar sehingga memperoleh hidayah. Pengandaian dalam ayat ini bukan berarti Allah tidak tahu, tetapi Allah mahatahu bahwa pada mereka tidak ada kebaikan. Dan jika Allah menjadikan mereka dapat mendengar dan memahamai kebenaran, niscaya mereka akan tetap meninggalkan juga apa yang mereka dengar itu, dan mereka dalam keadaan memalingkan diri dari kebenaran, sebab mereka telah dikuasai hawa nafsu."
  }
]