[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya Allah mengetahui pada diri mereka ada kebaikan, pastilah Allah akan menjadikan mereka dapat mendengarkan nasihat-nasihat al-qur’an dan pelajaran-pelajaran baiknya, sehingga mereka dapat memahami dari Allah berupa hujjah-hujjah dan bukti-bukti kebenaran. Akan tetapi, Allah telah mengetahui bahwa sesungguhnya tidak ada lagi kebaikan pada diri mereka dan sesungguhnya mereka itu tidak beriman. Sekiranya Allah benar-benar menjadikan mereka dapat mendengar dengan baik sekalipun, pastilah mereka akan tetap berpaling dari keimanan dengan kesengajaan dan penentangan setelah pemahaman mereka kepadanya, sedang mereka tetap berpaling darinya, tidak ada perhatian dari mereka kepada kebenaran dalam bentuk apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sekiranya Allah mengetahui bahwa di dalam diri orang-orang musyrik yang ingkar itu ada kebaikan niscaya Allah telah memberi mereka pendengaran yang dapat memberikan manfaat bagi mereka dan membuat mereka mampu memahami dalil-dalil dan bukti-bukti yang ada. Akan tetapi Allah mengetahui bahwasanya di dalam diri mereka sama sekali tidak ada kebaikan. Dan seandainya Allah -Subḥānahu- memperdengarkan (ayat-ayat-Nya) kepada mereka, niscaya mereka akan menolak beriman kepadanya dan berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Seandainya Allah mengetahui bahwa mereka memiliki keinginan untuk beriman dan memperbaiki diri dan hati mereka, niscaya Allah akan menjadikan mereka mau mendengar dan menerima kebenaran; akan tetapi Allah tidak mendapati mereka memiliki hal tersebut, oleh sebab itu Allah menghalangi kebaikan dari mereka. Seandainya Allah menjadikan mereka dapat mendengar dengan penuh penghayatan dan pemahaman sedangkan mereka memiliki sifat yang jauh dari kebaikan tersebut, niscaya mereka juga akan berpaling dari kebenaran yang mereka dengar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَوْ عَلِمَ اللهُ فِيهِمْ (Kalau sekiranya Allah mengetahui kebaikan ada pada mereka) Yakni pada orang-orang yang tuli dan bisu tersebut. لَّأَسْمَعَهُمْ ۖ (tentulah Allah menjadikan mereka dapat mendengar) Dengan pendengaran yang memberi manfaat bagi mereka dan memahami hujjah dan bukti-bukti. وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوا۟ وَّهُم مُّعْرِضُونَ (Dan jikalau Allah menjadikan mereka dapat mendengar, niscaya mereka pasti berpaling juga, sedang mereka memalingkan diri) Karena Allah telah mengetahui mengenai apa yang akan terjadi bahwa mereka tidak akan beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Bertawakkal lah kamu kepada Allah semata, dan bergaul lah hanya kepada-Nya, dan jadikanlah cinta-Nya dan ridho-Nya adalah ka'bah hatimu yang senantiasa menggitarinya, senantiasa berserah diri kepada perintah-perintah Nya, dan sungguh begitu bahagianya engkau tatkala Allah mengetahui hal itu ada pada hatimu! apalagi yang lebih baik daripada nikmat yang ia limpahkan kepadamu ? { وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَأَسْمَعَهُمْ } \"Kalau sekiranya Allah mengetahui kebaikan ada pada mereka, tentulah Allah menjadikan mereka dapat mendengar\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23 Kalau sekiranya Allah mengetahui bahwa dalam hati para pembangkang itu ada kecondongan kepada kebaikan, dan kecondongan untuk beriman dan mendapat petunjuk dengan cahaya Islam maka tentulah Allah menjadikan mereka dapat mendengar. Dan jikalau Allah menjadikan mereka dapat mendengar dengan mau memahami dan mengambil manfaat, meskipun mereka diperdengarkan niscaya mereka pasti berpaling juga, sedang mereka memalingkan diri dari apa keimanan yang mereka dengar itu dengan keras."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah mengetahui ada kebaikan pada diri mereka, pasti Dia menjadikan mereka dapat mendengar} pendengaran yang bisa bermanfaat bagi mereka {Seandainya Allah menjadikan mereka dapat mendengar, sungguh mereka berpaling dan mereka memang orang-orang yang berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23 Allah tidak membuat mereka mendengar dengan pendengaran yang berguna karena Dia tidak mendapati adanya kebaikan pada mereka yang menjadikan mereka layak mendengar ayat ayatNya ”kalu kiranya Allah mengetahui kebaikan ada pada mereka, tentulah Allah menjadikan mereka dapat mendengar” berdasarkan dugaan dan perkiraan ”niscaya mereka pasti berpaling juga” dari ketaatan. ”sedang mereka memalingkan diri (dari apa yang mereka dengar itu)” tak menoleh sedikitpun pada kebenaran. ini menunjukan bahwa Allah tidak menghalangi iman dan kebaikan kecuali bagi orang yang tidak ada kebaikan padanya, yang tidak suci di sisiNya dan tidak bermanfaat di sisiNya. Segala puji dan hikmah bagiNya dalam hal ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 23: Karena sudah diketahui tidak ada kebaikan dalam hati mereka. Tidak mau menerima ditambah dengan sikap keras dan mengingkari atau mereka tidak akan menoleh kepada kebenaran satu pun juga. Dalam ayat ini terdapat dalil bahwa Allah tidak menghalangi iman dan kebaikan kecuali kepada orang yang tidak ada kebaikan padanya, karena keimanan tidak akan berkembang dan berbuah dalam dirinya, maka segala puji bagi Allah yang Mahabijaksana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 23",
    "description": "Masih berkaitan dengan mereka yang tidak mendengar dan tidak menggunakan akalnya, ayat ini menegaskan sekiranya Allah berkehendak mengetahui dengan ilmu-Nya yang azali, bahwa ada keinginan untuk menerima dan mengamalkan kebaikan pada mereka, tentu dia jadikan mereka dapat mendengar sehingga memperoleh hidayah. Pengandaian dalam ayat ini bukan berarti Allah tidak tahu, tetapi Allah mahatahu bahwa pada mereka tidak ada kebaikan. Dan jika Allah menjadikan mereka dapat mendengar dan memahamai kebenaran, niscaya mereka akan tetap meninggalkan juga apa yang mereka dengar itu, dan mereka dalam keadaan memalingkan diri dari kebenaran, sebab mereka telah dikuasai hawa nafsu. Pada ayat ke-20 Allah menuntut orang-orang beriman untuk taat kepada Allah dan rasul-Nya, dan selanjutnya mengecam mereka yang enggan mendengar dan menggunakan akalnya, maka sebagai kesimpulannya Allah meminta orang beriman untuk memenuhi seruan Allah dan rasul-Nya. Wahai orang-orang yang beriman! penuhilah sebagai bukti keimananmu seruan Allah dan rasul nabi Muhammad, dengan sepenuh hati apabila dia, yakni rasul menyerumu kepada sesuatu ajakan apa pun, karena seruan itu merupakan sesuatu yang memberi kehidupan kepadamu, dengan mengerjakan perintah dan menegakkan hukum Allah yang menjamin kehidupan jiwa, raga, pikiran, dan kalbu kalian. Memenuhi seruan itu akan mendatangkan kebaikan dalam hidup di dunia dan akhirat. Dan ketahuilah, dengan penuh keyakinan, bahwa sesungguhnya Allah akan membuat dinding pemisah yang akan membatasi antara manusia dan keinginan hatinya jika mendapat bisikan hawa nafsu, karena dialah yang menguasai seluruh jiwa dan raga manusia. Dan ketahuilah sesungguhnya kepada-Nyalah, tidak kepada lainnya, kamu akan dikumpulkan untuk diminta pertanggungjawaban dan masing-masing akan mendapat balasan yang setimpa."
  }
]