[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah sebagai tuhan mereka dan Muhammad sebagai nabi dan rasul mereka, penuhilah (seruan) Allah dan RasulNya dengan ketaatan apabila rasul menyeru kalian kepada hal yang menghidupkan kalian berupa kebenaran.Dalam memenuhi seruan ini, terkandung kemashlahatan bagi hidup kalian di dunia dan di akhirat. Dan ketahuilah (wahai kaum Mukminin), bahwa sesungguhnya Allah yang mengendalikan segala sesuatu, yang maha kuasa untuk menghalang-halangi antara manusia dari apa yang diinginkan hatinya. Dia dzat yang sepatutnya dipenuhi seruannNya apabila menyeru kalian, sebab ditanganNya lah kekuasaan segala sesuatu. Dan ketahuilah bahwa sesungguhnya kalian akan dikumpulkan pada hari yang tidak ada keraguan tentangnya, lalu Dia memberikan balasan kepada masing-masing dengan balasan yang berhak diterimanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya, jawablah Allah dan rasul-Nya dengan patuh pada apa yang keduanya perintahkan dan menjauhi apa yang keduanya larang, apabila keduanya menyerukan kepada kalian untuk mengikuti kebenaran yang di dalamnya ada kehidupan bagi kalian. Dan yakinlah bahwa Allah Mahakuasa atas segala sesuatu. Maka Dia sanggup membuat kalian terhalang dari kepatuhan pada kebenaran setelah kalian menolaknya. Oleh karena itu bersegeralah menerima kebenaran itu. Dan yakinlah bahwa kalian akan dikumpulkan di hadapan Allah saja di hari Kiamat. Kemudian Dia akan memberikan balasan yang setimpal kepada kalian menurut amal perbuatan yang kalian kerjakan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Kemudian Allah menyampaikan seruan yang ketiga kepada orang-orang beriman untuk menjalankan konsekuensi keimanan mereka dengan bersegera mentaati perintahnya dan mendakwahkannya dengan penuh kerelaan, kesiapan, dan semangat; karena dalam seruan Allah dan para rasul-Nya terdapat kehidupan bagi hati dan ruh, yaitu kehidupan yang baik di dunia dan kebahagiaan di akhirat. Dan janganlah kalian sekali-kali menolak perintah Allah pada saat pertama kali diturunkan, karena itu dapat menyebabkan kalian terhalang dari-Nya dan hati kalian akan saling berselisih. Allah adalah pengatur antara seseorang dengan hatinya, Dia membolak-balikkan hati itu sesuai kehendak-Nya. Dan ketahuilah bahwa kalian akan dikumpulkan pada hari yang tidak diragukan kedatangannya, agar orang yang baik mendapatkan balasan kebaikannya, dan orang yang jahat mendapatkan balasan kejahatannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. اسْتَجِيبُوا۟ لِلّٰهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ (penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu) Yakni bersegeralah dalam melaksanakan ketaatan kepada Rasulullah dan menjalankan perintahnya. Karena dalam menjalankan perintah-perintahnya terdapat kebaikan hidup, kemuliaan dan kesempurnaan bagi kalian. Sebagaimana ketika ia menyeru kalian kepada apa yang memberi kalian kehidupan seperti ilmu-ilmu syariat, kerena pengetahuan adalah kehidupan dan kebodohan adalah kematian; dan kepada perintah-perintah dan larangan-larangan yang ada dalam al-qur’an karena didalamnya terdapat kehidupan yang abadi dan kenikmatan yang kekal; serta menyeru kepada jihad karena jihad merupakan sebab kehidupan, karena musuh jika tidak diperangi maka akan memerangi. Abu Sa’id bin Mu’la berkata: suatu hari aku shalat di masjid, lalu Rasulullah memanggilku namun aku tidak langsung menjawabnya, kemudian aku mendatanginya seraya berkata: “wahai Rasulullah, aku tadi sedang mengerjakan shalat”. Rasulullah berkata: “bukankah Allah telah berfirman: “penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu”. وَاعْلَمُوٓا۟ أَنَّ اللهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِۦ(ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya) Terdapat pendapat mengatakan maknanya adalah bergegaslah dalam menjawab perintah-perintah Allah selagi hati kalian masih lembut dan taat pada kalian, sebelum keadaannya berubah menjadi tidak lagi mentaati kalian, yaitu ketika seseorang mati sehingga tidak dapat beramal lagi; dan barangsiapa yang banyak bermaksiat bisa jadi tidak diberi taufik untuk menjawab perintah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ } \"Hai orang-orang yang beriman, penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu\". Kehidupan yang bermanfaat hanya dapat diraih dengan memenuhi panggilan Allah dan Rasul-Nya, maka barangsiapa yang belum mampu memenuhi panggilan itu tiada kehidupan baginya, oleh karena itu kehidupan yang hakiki adalah ketika panggilan Allah dan Rasul-Nya telah terpenuhi baik zohir maupun bathin; mereka hidup sekalipun mereka telah mati, sedangkan yang lainnya bagaikan orang mati sekalipun mereka hidup. 2 ). Di dalam al-qur'an setidaknya (ada 97 ayat) berbicara tentang kewajiban mendengar panggilan wahyu Allah, diantaranya ada tiga macam pendengaran itu : - Mendengarkannya melalui suara, yaitu dengan telinga. - Mendegarkan melalui pemahaman, yaitu dengan otak. - Mendegarkan melalui ketaatan dan menerimanya, yaitu dengan hati dan anggota badan, dari dua macam yang pertama adalah wasilah untuk kita aplikasikan pada pendengaran yang ketiga, dan itu ada pada surah al-Anfal : 19-23, oleh karena itu janganlah kamu jauhkan hatimu dari mendegaran al-Qur'an. 3 ). Ketahuilah bahwasanya Allah lah yang melindungimu dari kesalahan-kesalahan : { وَاعْلَمُوا أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ } \"ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya dan sesungguhnya kepada-Nya-lah kamu akan dikumpulkan\". Suatu ketika Umar mendengar seorang lelaki berkata dalam doanya : 'Ya Allah sesungguhnya engkaulah yang membatasi antara manusia dan hatinya, maka batasilah antara aku dan maksiat kepada-Mu\" Umar kemudian tersentuh dengan doa itu lalu ia mendokan lelaki tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24 Hai orang-orang yang beriman, penuhilah seruan Allah dan seruan Rasul dengan ketaatan, mengambil petunjuk dan melaksanakan perintah. Apabila Rasul menyeru kamu kepada suatu yang memberi kemanfaatan dalam kehidupan kamu, berupa ilmu syariat atau agama maka ketahuilah dengan sepenuh hati bahwa Allah memberi batas atas harapan panjang hidupnya dengan kematian yang mendadak. Sehingga tidak lagi bisa beriman dan beramal, atau tidak bisa berbuat kebaikan. Allah telah menyegerakan kematian kepadamu, kemudian akan mengumpulkan dan mengembalikan kalian kepada-Nya pada hari kiamat, dan akan diberi balasan atas amal kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, penuhilah seruan Allah dan Rasul apabila dia menyerumu pada sesuatu yang memberi kehidupan kepadamu!} di dalamnya ada kebenaran yang menjadi sebab kehidupan kalian {Ketahuilah bahwa sesungguhnya Allah membatasi} membatasi {antara manusia dengan hatinya dan sesungguhnya kepadaNyalah kalian akan dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24 Allah memerintahkan hamba hambaNya yang beriman dengan apa yang menjadi konsekuensi keimanan mereka, yaitu memenuhi seruan Allah dan rasulNya, yakni tunduk kepada perintah keduanya, bersegera melakukannya, dan berdakwah (menyeru manusia) kepadaNya, menjauhi segala sesuatu yang dilarang oleh Allah dan RasulNya, menahan diri dan mencegah darinya. FirmanNya ”apabila Rasul menyeru kamu kepada sesuatu yang memberi kehidupan kepada kamu” adalah suatu sifat yang pasti ada pada semua perkara yang diserukan oleh Allah dan RasulNya sekaligus penjelasan tentang faidah dan hikmahNya, karena kehidupan hati dan rohani adalah dengan beribadah kepada Allah senantiasa menaatiNya dan menaati RasulNya. Kemudian Allah memperingatkan hamba hambaNya dari sikap tidak menjawab seruan Allah dan RasulNya. Dia berfirman ”dan ketahuilah bahwa Allah membatasi antara manusia dan hatinya” maka janganlah kamu menentang perintah Allah saat pertama kali ia datang kepadamu, karena akibatnya adalah kamu dihalangi darinya, jika kamu menginginkannya setelah itu, hatimupun berselisih, karena Allah membatasi anatara manusia dengan hatinya. Allah membolak balik sesukaNya, dan memalingkannya kemana yang Dia inginkan, maka hendaknya seorang hamba memperbanyak doa, ”wahai dzat yang Maha membolak balikan hati, teguhkan hatiku diatas agamaMu, wahai dzat yang memalingkan hati, palingkanlah hatiku kepada ketaatan kepadaMu” \"dan sesungguhnya kepadaNYalah kamu akan dikumpulkan” yakni kamu dikumpulkan untuk suatu hari yang tiada keraguan padanya, lalu orang yang baik akan di balas dengan kebaikannya dan orang jahat akan dibalas dengan kejahatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 24: Dengan menaati Allah dan Rasul-Nya. Maksudnya menyeru kamu berperang untuk meninggikan kalimat Allah yang dapat membinasakan musuh serta menghidupkan Islam dan muslimin. Demikian juga berarti menyeru kamu kepada iman, petunjuk, dan perkara-perkara agama lainnya, di mana hal itu merupakan sebab kebahagiaan hidup di dunia dan akhirat serta sebab hidupnya hati dan ruh. Allah memperingatkan agar seseorang tidak menolak seruan Allah dan Rasul-Nya dengan firman-Nya, “Dan ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dan hatinya.” Oleh karena itu, berhati-hatilah jangan sampai menolak perintah Allah ketika datang, sehingga diadakan penghalang antara seseorang dengan hatinya apabila seseorang menginginkan sesuatu setelah itu, hatinya pun bercerai berai karena Allah membatasi seseorang dengan hatinya; Dia membolak-balikkan hati sesuai yang Dia kehendaki. Oleh karena itu, hendaknya seoarang hamba banyak berdoa, “Yaa muqallibal quluub tsabit qalbii ‘alaa diinik” (“Wahai Allah yang membola-balikkan hati, teguhkanlah hatiku di atas agama-Mu.”) Maksudnya Allah-lah yang menguasai hati manusia, sehingga seseorang tidak mampu beriman atau berbuat kufur melainkan dengan iradah (kehendak)-Nya. Maka Dia akan memberikan balasan terhadap amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 24",
    "description": "Pada ayat ke-20 Allah menuntut orang-orang beriman untuk taat kepada Allah dan rasul-Nya, dan selanjutnya mengecam mereka yang enggan mendengar dan menggunakan akalnya, maka sebagai kesimpulannya Allah meminta orang beriman untuk memenuhi seruan Allah dan rasul-Nya. Wahai orang-orang yang beriman! penuhilah sebagai bukti keimananmu seruan Allah dan rasul nabi Muhammad, dengan sepenuh hati apabila dia, yakni rasul menyerumu kepada sesuatu ajakan apa pun, karena seruan itu merupakan sesuatu yang memberi kehidupan kepadamu, dengan mengerjakan perintah dan menegakkan hukum Allah yang menjamin kehidupan jiwa, raga, pikiran, dan kalbu kalian. Memenuhi seruan itu akan mendatangkan kebaikan dalam hidup di dunia dan akhirat. Dan ketahuilah, dengan penuh keyakinan, bahwa sesungguhnya Allah akan membuat dinding pemisah yang akan membatasi antara manusia dan keinginan hatinya jika mendapat bisikan hawa nafsu, karena dialah yang menguasai seluruh jiwa dan raga manusia. Dan ketahuilah sesungguhnya kepada-Nyalah, tidak kepada lainnya, kamu akan dikumpulkan untuk diminta pertanggungjawaban dan masing-masing akan mendapat balasan yang setimpadan di samping kamu berkewajiban memenuhi panggilan Allah dan rasul-Nya, peliharalah dirimu dari siksaan yang ketika datang sekalikali tidak hanya menimpa secara khusus orang-orang yang zalim saja, yakni yang melanggar dan enggan memperkenankan seruan rasul, di antara kamu, tetapi juga kepada mereka yang membiarkan kemungkaran merajalela. Lindungilah diri kalian dari dosa-dosa besar yang merusak tatanan masyarakat. Jauhilah sikap enggan berjihad di jalan Allah, perpecahan dan rasa malas melaksanakan kewajiban amar makruf nahi mungkar. Karena, akibat buruk dosa itu akan menimpa semua orang, tidak khusus hanya orang yang berbuat kejahatan saja. Ketahuilah bahwa Allah sangat keras siksa-Nya."
  }
]