[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan waspadalah kalian (wahai kaum mukminin), satu cobaan dan ujian yang akan merata dialami oleh orang yang berbuat buruk dan lainnya, yang tidak khusus cobaan tersebut mengenai orang yang bermaksiat semata, tidak pula orang yang melakukan dosa tersebut, akan tetapi juga menimpa orang-orang yang shalih bersama mereka sekaligus, bila orang-orang shalih itu sebenarnya mampu mengingkari kezhaliman , namun mereka tidak mengingkarinya. Dan ketahuilah, bahwa sesungguhnya Allah amat dahsyat siksaanNya bagi orang yang melanggar perintah dan laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan waspadalah -wahai orang-orang mukmin- terhadap azab yang tidak hanya menimpa orang yang durhaka saja di antara kalian, melainkan menimpa semuanya, baik yang durhaka maupun tidak. Hal itu akan terjadi manakala kezaliman merajalela dan tidak ada yang berusaha mengubahnya. Dan yakinlah bahwa Allah sangat kuat hukuman-Nya bagi orang yang durhaka kepada-Nya. Maka jangan sekali-kali kalian durhaka kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Lalu Allah menegaskan peringatan-Nya bagi mereka, agar tidak lalai dalam mengingkari kemungkaran: \"Berhati-hatilah kalian dari azab yang menimpa orang-orang baik dan orang-orang jahat sekaligus; yaitu jika telah nampak kezaliman namun tidak ada yang mengubahnya, maka ketika itu akan turun azab bagi orang yang melakukan kejahatan itu dan bagi orang lainnya. Ketahuilah bahwa Allah sangat keras siksaan-Nya bagi orang orang yang menyelisihi perintah-Nya dan melanggar larangan-Nya serta memancing kemurkaan-Nya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَاتَّقُوا۟ فِتْنَةً لَّا تُصِيبَنَّ الَّذِينَ ظَلَمُوا۟ مِنكُمْ خَآصَّةً ۖ (Dan peliharalah dirimu dari pada siksaan yang tidak khusus menimpa orang-orang yang zalim saja di antara kamu) Yakni hati-hatilah dari siksaan yang tidak hanya menimpa orang zalim saja tapi juga menimpa orang shalih dan yang jahat. Yakni apabila kalian tidak menjalankan seruan perintah dari Allah dan rasul-Nya dengan berhenti menguatkan kebenaran dan mengingkari kebathilan, bisa jadi kalian akan ditimpa siksaan yang membinasakan orang-orang zalim dan juga menimpa orang-orang shalih. وَاعْلَمُوٓا۟ أَنَّ اللهَ شَدِيدُ الْعِقَابِ (Dan ketahuilah bahwa Allah amat keras siksaan-Nya) Dan bagian dari kerasnya siksaan-Nya, Allah menimpakan azab kepada orang yang tidak secara langsung melakukan hal yang mendatangkan azab. Dan orang yang tidak termasuk orang-orang zalim bisa saja menjadi layak untuk mendapat siksaan karena beberapa hal semisal meninggalkan amar ma’ruf dan nahi mungkar sehingga kerusakan menjadi terlihat, maka siksaan akan ditimpakan kepada seluruh penduduk dan bukan hanya kepada orang-orang yang zalim saja."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Yakni : siksaan ini tidak saja menimpa orang zhalim, tetapi juga menimpa orang yang diam dari larangan berbuat kezhaliman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25 Dan peliharalah dirimu wahai orang mukmin dari siksaan, bencana dan terlena dengan kenikmatan dunia yang itu tidak hanya menimpa orang-orang yang zalim saja di antara kamu namun menimpa semua orang. Dan ketahuilah bahwa Allah amat keras siksaan-Nya kepada orang yang membangkang. Maksudnya adalah peringatan atas fitnah dan perlawanan orang-orang yang sombong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Waspadalah terhadap siksaan} waspadalah terhadap ujian {yang tidak hanya menimpa orang-orang yang zalim di antara kalian secara khusus} tidak hanya menimpa orang-orang yang suka bermaksiat saja melainkan berlaku juga untuk orang yang berbuat keburukan dan yang lainnya {Ketahuilah bahwa Allah itu Maha keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25 “dan perihalah dirimu dari siksaan yang tidak khusus menimpa orang orang yang zhalim saja diantara kamu” akan tetapi ia menimpa pelaku kezhaliman dan juga selainnya. hal itu jika kezhaliman muncul dan tidak dirubah maka azabnya akan menimpa pelaku dan selainnya. Menghindari fitnah ini adalah dengan melarang kemungkaran dan melawan para pengusung kejahatan dan kerusakan serta tidak memberi mereka peluang untuk berbuat dosa dan kemaksiatan sebisa mungkin. ”dan ketahuilah bahwa Allah amat keras siksaanNya” bagi orang yang melakukan penyebab kemungkaranNya dan menjauhi ridhaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 25: Caranya adalah dengan mengingkari kemungkaran yang terjadi sesuai kemampuan. Hal ini apabila kezaliman nampak dan tidak dirubah, maka jika datang musibah sebagai hukumannya akan mengena kepada pelaku dan selainnya. Bagi orang yang melanggar perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 25",
    "description": "Dan di samping kamu berkewajiban memenuhi panggilan Allah dan rasul-Nya, peliharalah dirimu dari siksaan yang ketika datang sekalikali tidak hanya menimpa secara khusus orang-orang yang zalim saja, yakni yang melanggar dan enggan memperkenankan seruan rasul, di antara kamu, tetapi juga kepada mereka yang membiarkan kemungkaran merajalela. Lindungilah diri kalian dari dosa-dosa besar yang merusak tatanan masyarakat. Jauhilah sikap enggan berjihad di jalan Allah, perpecahan dan rasa malas melaksanakan kewajiban amar makruf nahi mungkar. Karena, akibat buruk dosa itu akan menimpa semua orang, tidak khusus hanya orang yang berbuat kejahatan saja. Ketahuilah bahwa Allah sangat keras siksa-Nya. Salah satu bentuk bencana yang menimpa semua pihak'yang terlibat langsung dalam dosa atau tidak'adalah kekacauan dalam masyarakat, kegelisahan dan hilangnya rasa aman, serta penindasan. Ketika hukum itu diabaikan, semua orang merasa cemas sebagaimana pernah dialami masyarakat di mekah. Oleh karenanya, mereka diingatkan kembali tentang itu agar dapat mensyukuri nikmat Allah. Dan ingatlah wahai kaum muslim'meski saat ini kamu telah menjadi bangsa yang kuat' masa-masa ketika kamu para muhajirin masih berjumlah sedikit, lagi tertindas karena satu dan lain sebab di bumi mekah, atau di mana saja di persada bumi ini. Dan kamu dicekam rasa takut orang-orang mekah atau di mana saja yang merupakan musuh-Musuhmu akan menculik kamu satu per satu. Kemudian kamu berhijrah atas perintah Allah ke kota yasrib (madinah) atau ke mana saja yang ditetapkan Allah, maka dia memberi kamu tempat menetap di madinah atau lainnya dan menjadikan kamu kuat dengan pertolongan-Nya, terutama saat terjadi perang badar, dan menganugerahkan kepada kamu rezeki berupa harta rampasan perang dan lainnya yang baik-baik agar kamu bersyukur atas pemberian itu dan terus berjuang demi menjunjung tinggi kalimat yang benar."
  }
]