[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian wahai kaum Mukminin, nikmat-nikmat Allah pada kalian, tatkala kalian masih berada di Makkah berjumlah sedikit lagi tertindas. kalian takut orang-orang kafir menyiksa kalian dengan tiba-tiba, kemudian Dia menjadikan bagi kalian tempat menetap bagi kalian untuk ditinggali, yaitu Madinah, dan menguatkan kalian dengan pertolonganNya melawan mereka pada perang badar, dan memberikan makanan kepada kalian yang halal (secara umum berupa ghanimah), supaya kalian bersyukur kepadaNya atas rizki dan kenikmatan yang dilimpahkanNya pada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan ingatlah (wahai orang-orang mukmin) ketika kalian berada di Makkah berjumlah sedikit, ditindas dan ditekan oleh para penduduknya. Kalian takut diculik oleh musuh-musuh kalian dengan cepat. Kemudian Allah menampung kalian di tempat penampungan kalian, yaitu kota Madinah. Dia memperkuat kalian dengan pertolongan untuk mengalahkan musuh-musuh kalian di beberapa medan perang, termasuk dalam perang Badar. Dia memberikan rezeki yang baik kepada kalian. Salah satunya ialah ganimah (harta rampasan perang) yang kalian dapatkan dari musuh-musuh kalian. Hal itu supaya kalian bersyukur kepada Allah atas nikmat-nikmat yang diberikan oleh-Nya sehingga Dia berkenan menambahnya. Dan jangan sampai kalian mengingkari nikmat-nikmat-Nya karena Dia bisa mencabutnya dari kalian dan menimpakan azab kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Kemudian Allah mengingatkan mereka tentang karunia yang telah Allah berikan berupa kemenangan setelah kelemahan yang mereka alami, memperbanyak jumlah mereka yang sebelumnya sedikit, dan menjadikan mereka kaya setelah sebelumnya menanggung kemiskinan. Hal ini agar mereka menyadari dengan akal dan hati mereka atas kenikmatan-kenikmatan Allah, dan agar senantiasa mensyukuri kenikmatan kenikmatan tersebut sehingga Allah menambah karunia-Nya bagi mereka. Hai orang-orang beriman, ingatlah ketika kalian masih sedikit dan lemah, saat masih berada di kota Makkah di bawah kekuasaan orang-orang kafir Quraisy atau di negeri Jazirah Arab. Ketika itu kalian takut jika musuh menyerang kalian dengan tiba-tiba, karena mereka sangat kuat sedangkan kalian sangat lemah. Kemudian Allah menghilangkan keadaan itu dari kalian dengan karunia-Nya dan menggantinya dengan keadaan yang lebih baik; yaitu dengan memberi kalian perlindungan di kota Madinah dan menyatukan hati kalian wahai orang-orang Muhajirin dan Anshar. Dan Allah memberi pertolongan kepada kalian pada perang Badar, memasukkan rasa takut ke dalam hati musuh-musuh kalian, memberi kalian harta ghanimah yang telah dihalalkan bagi kalian padahal sebelumnya diharamkan bagi umat terdahulu, dan memberikan rezeki berupa makanan dan minuman yang baik dan banyak yang sebelumnya tidak kalian miliki. Ini semua agar kalian senantiasa taat dan bersyukur kepada Allah, tidak dilalaikan oleh suatu apapun dari-Nya, dan agar kalian menyembah-Nya tanpa menyekutukan dengan yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَاذْكُرُوٓا۟ إِذْ أَنتُمْ قَلِيلٌ (Dan ingatlah ketika kamu masih berjumlah sedikit) Kalimat ini ditujukan kepada kaum muhajirin. Pendapat lain mengatakan ditujukan kepada orang-orang arab. مُّسْتَضْعَفُونَ فِى الْأَرْضِ(lagi tertindas di muka bumi) Yakni di negeri Makkah. تَخَافُونَ أَن يَتَخَطَّفَكُمُ النَّاسُ(kamu takut orang-orang akan menculik kamu) Makna (الخطف) yakni penculikan. Dan orang-orang tersebut adalah para kafir Quraisy, namun pendapat lain mengatakan yakni orang-orang Persia dan romawi. فَـَٔاوَىٰكُمْ (maka Allah memberi kamu tempat menetap) Yakni Allah mengumpulkan kalian di kota Madinah. Atau Allah mengumpulkan kalian dengan kaum Anshar. وَأَيَّدَكُم بِنَصْرِهِۦ (dan dijadikan-Nya kamu kuat dengan pertolongan-Nya) Yakni menguatkan kalian dengan pertolongan di berbagai peperangan diantaranya adalah di perang Badar. وَرَزَقَكُم مِّنَ الطَّيِّبٰتِ(dan diberi-Nya kamu rezeki dari yang baik-baik) Dan diantaranya adalah harta ghanimah. لَعَلَّكُمْ تَشْكُرُونَ(agar kamu bersyukur) Yakni mensyukuri nikmat-nikmat yang telah dikaruniakan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26 Dan ingatlah hai para muhajirin ketika kamu masih berjumlah sedikit, lagi tertindas di muka bumi Mekah, kamu takut bahwa orang-orang kafir Makkah akan menculik kamu, atau lainnya. Lalu kamu takut mereka membunuh atau menyiksamu. Lalu Allah menjadikan bagimu kota Madinah untuk berlindung, serta pertolongan di medan peperangan Badar. Lalu mepertemulkanmu dengan kaum Anshor dan memberi kamu rezeki dari yang baik-baik berupa ghanaim agar kamu bersyukur atas nikmat anugerah Allah ini. Imam Thabbrani meriwayatkan dari Qatadah sesuatu yang menunjukkan bahwa ayat ini turun di tanah Arab ketika mereka sedang terhina. Persi dan Rum tengah menguasai mereka. Kemudian Allah memuliakan mereka dengan Islam dan keluasan wilayah negara, itu yang mewajibkan bersyukur atas anugerah Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah ketika kalian masih sedikit dan tertindas di bumi} di tanah Makkah {kalian takut bahwa orang-orang akan menculik kalian} orang-orang kafir Makkah akan menculik kalian dengan cepat {lalu Dia memberi kalian tempat menetap} lalu Allah mengumpulkan kalian di Madinah {menguatkan kalian} menguatkan kalian {dengan pertolonganNya, dan memberi kalian rezeki yang baik agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26 Allah berfirman menjelaskan nikmatNya kepada hamba hambaNYa dalam bentuk pertolonganNYa kepada mereka setelah sebelumnya terhina, memperbanyak mereka setelah sebelumnya sedikit, dan mencukupi mereka setelah sebelumnya kekurangan, ”dan ingatlah (hai para muhajirin) ketika kamu masih berjumlah sedikit lagi tertindas di muka bumi (makkah)” yakni tertindas di bawah hukum orang lain. ”kamu takut orang orang makkah akan menculik kamu” yakni mengambilmu. ”maka Allah memberi kamu tempat menetap (madinah) dan dijadikanNya kamu kuat dengan pertolonganNya dan diberiNya kamu rizki dari yang baik baik” Allah menyediakan kota tempat tinggal untukmu, mengalahkan musuh musuhmu dengan tanganmu, dan kamu dapat merampas harta perang dari mereka yang dengannya kamu berkecukupan. ”agar kamu bersyukur” kepada Alah atas nikmatNya yang besar dan kebaikanNya yang sempurna, dengan menyembahNya tanpa menyekutukanNya dengan suatupun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 26: Sebagaimana pada perang Badar. Seperti ghanimah. Dengan hanya beribadah kepada-Nya dan tidak menyekutukan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 26",
    "description": "Salah satu bentuk bencana yang menimpa semua pihak'yang terlibat langsung dalam dosa atau tidak'adalah kekacauan dalam masyarakat, kegelisahan dan hilangnya rasa aman, serta penindasan. Ketika hukum itu diabaikan, semua orang merasa cemas sebagaimana pernah dialami masyarakat di mekah. Oleh karenanya, mereka diingatkan kembali tentang itu agar dapat mensyukuri nikmat Allah. Dan ingatlah wahai kaum muslim'meski saat ini kamu telah menjadi bangsa yang kuat' masa-masa ketika kamu para muhajirin masih berjumlah sedikit, lagi tertindas karena satu dan lain sebab di bumi mekah, atau di mana saja di persada bumi ini. Dan kamu dicekam rasa takut orang-orang mekah atau di mana saja yang merupakan musuh-Musuhmu akan menculik kamu satu per satu. Kemudian kamu berhijrah atas perintah Allah ke kota yasrib (madinah) atau ke mana saja yang ditetapkan Allah, maka dia memberi kamu tempat menetap di madinah atau lainnya dan menjadikan kamu kuat dengan pertolongan-Nya, terutama saat terjadi perang badar, dan menganugerahkan kepada kamu rezeki berupa harta rampasan perang dan lainnya yang baik-baik agar kamu bersyukur atas pemberian itu dan terus berjuang demi menjunjung tinggi kalimat yang benar. Bersyukur adalah sebuah keharusan, sebab aneka nikmat tersebut bersumber dari Allah. Tidak bersyukur berarti mengkhianati nikmat tersebut dari pemberinya, karena itu Allah menyatakan, wahai orangorang yang beriman! janganlah kamu mengkhianati, yakni mengurangi sedikit pun hak Allah sehingga mengkufurinya atau tidak mensyukurinya, dan juga jangan mengkhianati rasul, yakni nabi Muhammad, tetapi penuhilah seruannya, dan juga janganlah kamu mengkhianati amanat yang dipercayakan kepadamu oleh siapa pun, baik amanat itu ada-lah amanat orang lain maupun keluarga; seperti istri dan anak, muslim atau non-Muslim, sedang kamu mengetahui bahwa itu adalah amanat yang harus dijaga dan dipelihara. Segala sesuatu yang berada dalam genggaman manusia adalah amanat Allah yang harus dijaga dan dipelihara."
  }
]