[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya seerta melaksanakan syariatNya, janganlah kalian mengkhianati Allah dan rasulNya dengan meninggalkan kewajiban yang telah ditetapkanNya atas kalian dan melakukan perkara yang kalian dilarang Allah darinya. Dan janganlah menyepelekan amanat yang dipercayakan Allah kepada kalian sedang kalian tahu bahwa itu merupakan amanat yang harus dipenuhi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya, janganlah kalian berkhianat kepada Allah dan rasul-Nya dengan mengabaikan perintah-perintah-Nya dan melanggar larangan-larangan-Nya. Dan janganlah kalian mengkhianati amanah yang dipercayakan kepada kalian, seperti hutang dan lain-lain, sedangkan kalian tahu bahwa apa yang kalian lakukan adalah pengkhianatan, sehingga kalian termasuk ke dalam golongan para pengkhianat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Kemudian Allah menyampaikan seruan keempat bagi orang-orang beriman: \"Janganlah kalian menghianati Allah dengan meninggalkan kewajiban dan perintah-perintah yang telah dibebankan kepada kalian, serta melanggar larangan-larangan yang tidak boleh kalian dekati; dan janganlah kalian menghianati Rasulullah dengan meninggalkan sunnah-sunnahnya, menyelisihi perintahnya, dan melanggar larangannya; serta janganlah kalian menghianati amanah yang telah diberikan kepada kalian dengan menyebar rahasia di antara kalian, melanggar perjanjian yang telah kalian buat, mengingkari barang titipan yang dititipkan orang lain kepada kalian, dan melalaikan hak-hak materiil orang lain yang wajib kalian jaga. Padahal kalian telah mengetahui akibat buruk dari menghianati Allah dan rasul-Nya serta amanat yang telah diserahkan kepada kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. لَا تَخُونُوا۟ اللهَ وَالرَّسُولَ وَتَخُونُوٓا۟ أَمٰنٰتِكُمْ (janganlah kamu mengkhianati Allah dan Rasul (Muhammad) dan (juga) janganlah kamu mengkhianati amanat-amanat yang dipercayakan kepadamu) Allah melarang mereka untuk mengkhianati Rasulullah dengan meninggalkan suatu kewajiban yang ditetapkan kepada mereka, atau mengkhianati suatu amanat yang diberikan kepada mereka. وَأَنتُمْ تَعْلَمُونَ(sedang kamu mengetahui) Yakni mengetahui bahwa berbuatan itu merupakan perbuatan khianat, sehingga kalian melakukan khianat dengan sengaja."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 Sesungguhnya perkara yang paling banyak mendorong seseorang untuk khianat kepada Allah dan Rasul-Nya, serta amanah yang dibebankan kepadanya adalah : harta dan anak-anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27 Hai orang-orang yang beriman, janganlah kamu mengkhianati perjanjian kepada Allah dan Rasul dengan menyepelekan perintah kewajiban dan menerjang batasa perkara yang diharamkan, juga menyebarkan rahasia kepada orang-orang musyrik dan juga janganlah kamu mengkhianati amanat-amanat yang dipercayakan kepadamu baik itu hutang atau hak manusia, sedang kamu mengetahui bahwa khianat adalah dilarang, atas dasar kesadaran bukan karena lupa, dan kamupun juga mengetahui akibatnya. Ayat ini turun untuk Abu Lubabah: Marwan bin Abdul Mundzir ketika mengabarkan Bani Quraidhah atas apa yang diklaim Nabi bahwa nabi telah mengalahkan mereka setelah dikepung selama dua puluh satu malam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah mengkhianati Allah dan Rasul, dan janganlah mengkhianati amanat yang dipercayakan kepada kalian, sedangkan kalian mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27 Allah memerintahkan hamba hambaNya yang beriman agar menunaikan perintah perintah dan larang larangan yang Allah amanatkan kepada mereka, karena Allah telah menawarkan amanat kepada langit, bumi, dan gunung, semua menolak memikulnya dan khawatir akan menghianatinya, lalu dipikullah amanat itu oleh manusia. sesungguhnya manusia itu amat zhalim dan amat bodoh. barangsiapa yang menunaikan amanat, maka dia berhak mendapatkan pahala besar dari Allah dan barangsiapa menghianatinya dan tidak menunaikannya, maka dia berhak mendapatkan azab yang keras dan dia menjadi penghianat Allah, Rasulullah, dan amanatnya itu sendiri, menodai dirinya sendiri karena dia telah mengambil sifat terburuk dan ciri terjelek yaitu khianat serta mengabaikan sifat yang paling baik dan semurna yaitu amanat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 27: Dalam ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan kepada kaum mukmin agar mereka menjalankan amanah Allah yang telah diamanahkan kepada mereka berupa mengerjakan perintah dan menjauhi larangan, di mana amanah tersebut sebelumnya telah ditawarkan kepada langit, bumi, dan gunung namun mereka semua enggan menerimanya dan khawatir tidak mampu menjalankannya, lalu manusia merasa mampu memikulnya, maka dipikullah amanah itu oleh manusia. Barang siapa yang menjalankan amanah itu, maka ia berhak mendapatkan pahala yang besar dari Allah, sebaliknya barang siapa yang tidak menjalankannya, maka ia berhak memperoleh azab yang keras dan menjadi orang yang mengkhianati Allah dan Rasul-Nya serta mengkhianati amanahnya. Yakni mengetahui bahwa amanah itu wajib ditunaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 27",
    "description": "Bersyukur adalah sebuah keharusan, sebab aneka nikmat tersebut bersumber dari Allah. Tidak bersyukur berarti mengkhianati nikmat tersebut dari pemberinya, karena itu Allah menyatakan, wahai orangorang yang beriman! janganlah kamu mengkhianati, yakni mengurangi sedikit pun hak Allah sehingga mengkufurinya atau tidak mensyukurinya, dan juga jangan mengkhianati rasul, yakni nabi Muhammad, tetapi penuhilah seruannya, dan juga janganlah kamu mengkhianati amanat yang dipercayakan kepadamu oleh siapa pun, baik amanat itu ada-lah amanat orang lain maupun keluarga; seperti istri dan anak, muslim atau non-Muslim, sedang kamu mengetahui bahwa itu adalah amanat yang harus dijaga dan dipelihara. Segala sesuatu yang berada dalam genggaman manusia adalah amanat Allah yang harus dijaga dan dipelihara. Salah satu bentuk motivasi mengkhianati amanat Allah dan rasulnya adalah cinta kepada harta dan anak yang berlebihan. Maka pada ayat ini Allah menyatakan, dan ketahuilah bahwa hartamu yang merupakan titipan Allah kepadamu dan anak-anakmu yang merupakan anugerah Allah itu hanyalah sebagai cobaan. Maka, ja-nganlah berlebihan dalam mencintai harta dan anak melebihi cinta pada Allah. Cinta harta dan anak yang berlebihan membuat seseorang enggan memenuhi panggilan Allah dan rasul-Nya karena takut atau kikir, sebab panggilan tersebut menuntut tanggung jawab dan pengorbanan. Dan ketahuilah, sesungguhnya di sisi Allah ada pahala yang besar, jauh lebih besar daripada harta dunia dan anak keturunan."
  }
]