[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketahuilah (wahai kaum mukminin), sesungguhnya harta benda kalian yang telah Allah kuasakan kepada kalian, dan anak-anak kalian yang Allah anugerahkan bagi kalian merupakan cobaan dari Allah dan ujian bagi hamba-hambaNya, supaya Dia mengetahui apakah mereka akan bersyukur kepadaNya atas nikmat-nikmat tersebut dan menaati Allah dalam mempergunakannya, ataukah mereka justru menjadi terlena dengan itu dari mengingatNya? Dan ketahuilah bahwa sesungguhnya Allah, di sisisNYa ada kebaikan dan pahala besar bagi orang-orang yang bertakwa dan taat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. \"Ketahuilah -wahai orang-orang mukmin- bahwa harta dan anak-anak kalian sejatinya merupakan cobaan dan ujian dari Allah untuk kalian. Karena harta dan anak-anak kalian dapat menghalangi-halangi kalian beramal untuk Akhirat dan mendorong kalian untuk berkhianat. Dan ketahuilah bahwa di sisi Allah terdapat pahala yang sangat besar. Maka janganlah kalian kehilangan kesempatan untuk mendapatkan pahala itu karena terlalu sibuk mengurus harta dan anak-anak kalian, serta berlaku khianat demi kepentingan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Karena kecintaan terhadap harta dan anak keturunan merupakan hal paling besar yang menyebabkan terjadinya pengkhianatan, maka Allah memberi peringatan tentang hal ini dengan berfirman: \"Ketahuilah hai orang-orang beriman, sesungguhnya harta dan anak-anak kalian adalah cobaan dari Allah agar menjadi jelas siapa yang memiliki iman yang kuat dan yang memiliki iman yang lemah. Orang yang memiliki iman yang kuat tidak akan disibukkan oleh harta dan anaknya dari ketaatan Allah; sedangkan orang yang imannya lemah, semua itu akan menyibukkannya dari ketaatan Allah, sehingga ia akan menjadikan kehidupannya sebagai hamba dari harta dan akan selalu memenuhi permintaan anak-anaknya meskipun hal itu bertentangan dengan ajaran agama dan adabnya. Kemudian Allah mendorong orang-orang beriman agar mentaati-Nya setelah Dia memperingatkan mereka dari ujian harta dan keturunan, dengan menyatakan bahwa di sisi-Nya terdapat pahala yang besar bagi orang yang lebih mementingkan ketaatan dan keridhaan-Nya daripada mengumpulkan harta dan kecintaan terhadap anak-anak. Hai orang-orang beriman maka jadilah kalian orang-orang yang lebih mementingkan kecintaan kepada Allah daripada kecintaan kepada harta dan anak-anak agar kalian dapat meraih kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-28 Sesungguhnya perkara yang paling banyak mendorong seseorang untuk khianat kepada Allah dan Rasul-Nya, serta amanah yang dibebankan kepadanya adalah : harta dan anak-anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28 Ketahuilah, bahwa harta dan anak-anakmu itu hanyalah sebagai sebab cobaan/fitnah untuk mengetahui apakah kamu menjalankan amanah atau menyia-nyiakannya dengan menjaga harta serta mendidik anak. Sesungguhnya di sisi Allah-lah pahala yang besar. Pemberiannya jauh lebih baik bagi kalian daripada harta dan anak, maka jangan kalian sia-siakan hak Allah dan perhatikanlah kemaslahatan harta dan anak-anak kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya harta kalian dan anak-anak kalian itu hanyalah ujian} ujian Allah untuk kalian {dan sesungguhnya di sisi Allah ada pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 karena hamba diuji dengan harta dan anak anaknya dan mungkin saja kecintaannya mendorongnya mendahulukan hawa nafsunya diatas amanatnya, maka Allah memberitahukan bahwa anak dan harta benda adalah fitnah yang dengannya Allah menguji hambaNya, dan bahwa ia adalah pinjaman yang akan ditunaikan kepada yang memberinya dan dikembalikan kepada yang menitipkannya. ”dan sesungguhnya disisi Allah lah pahala yang besar” jika kamu memiliki akal dan pemikiran maka dahulukanlah karuniaNya yang besar atas kenikmatan kecil yang akan lenyap dan fana. Orang yang berakal akan menimbang segala urusan, dia tahu mana yang mesti didahulukan dan dikedepankan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 28: Yang dapat menghalangimu dari urusan akhirat atau dari menunaikan amanah karena cinta kepada harta dan anak. Maka janganlah kamu sia-siakan karena mementingkan harta dan anak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 28",
    "description": "Salah satu bentuk motivasi mengkhianati amanat Allah dan rasulnya adalah cinta kepada harta dan anak yang berlebihan. Maka pada ayat ini Allah menyatakan, dan ketahuilah bahwa hartamu yang merupakan titipan Allah kepadamu dan anak-anakmu yang merupakan anugerah Allah itu hanyalah sebagai cobaan. Maka, ja-nganlah berlebihan dalam mencintai harta dan anak melebihi cinta pada Allah. Cinta harta dan anak yang berlebihan membuat seseorang enggan memenuhi panggilan Allah dan rasul-Nya karena takut atau kikir, sebab panggilan tersebut menuntut tanggung jawab dan pengorbanan. Dan ketahuilah, sesungguhnya di sisi Allah ada pahala yang besar, jauh lebih besar daripada harta dunia dan anak keturunan. Dalam menghadapi ujian hidup, apalagi menyangkut anak dan harta, manusia seringkali bingung dan sulit menentukan sikap. Maka melalui ayat ini Allah menjelaskan cara untuk menyingkirkan kebingungan itu. Wahai orang-orang yang beriman! jika kamu bertakwa kepada Allah, patuh pada perintah Allah dalam kesendirian atau di tengah keramaian, niscaya dia akan memberikan karunia berupa furqa'n, yakni kemampuan membedakan antara yang hak dan batil kepadamu, dan menghapus segala kesalahanmu dengan menutupinya di dunia dan akhirat serta tidak menuntut pertanggungjawabanmu, dan mengampuni dosadosa-Mu. Allah memiliki karunia yang besar."
  }
]