[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syari’atNya, jika kalian bertakwa kepada Allah dengan mengerjakan perintah-perintahNya dan menjauhi larangan-laranganNYa, niscaya Dia akan menjadiakan bagi kalian pemisah atara yang haq dengan yang batil, menghapuskan dari kalian dosa-dosa kalian yang sudah terjadi, dan menutupnya bagi kalian, sehingga Dia tidak menghukum kalian karenanya.Dan Allah memiliki kebaikan dan pemberian yang banyak lagi luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya, ketahuilah! Apabila kalian bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, maka Allah akan memberi kalian sesuatu yang dapat kalian gunakan untuk membedakan antara perkara yang benar dan perkara yang batil, sehingga keduanya tidak membingungkan kalian. Allah juga akan menghapus keburukan-keburukan yang pernah kalian lakukan dan mengampuni dosa-dosa kalian. Dan Allah memiliki anugerah yang sangat besar. Salah satu anugerah-Nya yang sangat besar ialah Surga yang Dia siapkan untuk hamba-hamba-Nya yang bertakwa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Allah menutup seruan-seruan-Nya bagi orang-orang beriman dengan seruan yang dapat memberi mereka petunjuk menuju jalan kebaikan dan kemenangan, Dia berfirman: \"Hai orang-orang beriman, jika kalian bertakwa kepada Allah dengan menjauhkan diri dari segala yang mengundang kemurkaan-Nya, dan dengan mentaati-Nya setiap saat, baik itu ketika kalian sedang sendiri maupun ketika dalam keramaian; maka Allah akan memberi kalian: Pertama, hidayah dalam hati yang dapat kalian gunakan untuk membedakan antara kebenaran dan kebatilan; kemenangan yang dapat meninggikan derajat kalian; jalan keluar dari syubhat-syubhat yang menggoyahkan jiwa; dan keselamatan dari segala yang kalian ikuti. Kedua, Allah akan menghapus kesalahan-kesalahan kalian, yaitu dengan menutupi kesalahan-kesalahan tersebut di dunia. Ketiga, mengampuni dosa-dosa kalian pada hari kiamat dengan kelembutan dan kebaikan-Nya. Keempat, Allah akan memberi pahala yang besar bagi orang yang bertaqwa kepada-Nya dan lebih memilih keridhaan Allah daripada hawa nafsunya. Ini semua merupakan karunia dari Allah yang Maha Pemurah bagi hamba-hamba-Nya yang taat dan bertakwa serta menjauhkan diri dari segala yang dapat mendatangkan kemurkaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. يَجْعَل لَّكُمْ فُرْقَانًا (Kami akan memberikan kepadamu Furqaan) Yakni dengan ketakwaan Allah memberikan kalian keteguhan hati, ketajaman mata hati, dan kebaikan hidayah sehingga kalian dapat membedakan antara kebenaran dan kebathilan, mengetahui jawaban dari berbagai syubhat, dan selamat dari segala yang kalian takuti."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika Imam Malik berpesan kepada muridnya yakni Asy-Syafi'i ketika pertama kali bertemu dengannya : ((Sesungguhnya aku melihat Allah telah memasukkan ke dalam hatimu cahaya, maka janganlah kamu mematikannya dengan gelapnya kemaksiatan)), dan makna yang terkandung dalam pesan Imam Malik ini diambil dari firman Allah : { يَا أَيُّهَا الَّذِينَ آمَنُوا إِنْ تَتَّقُوا اللَّهَ يَجْعَلْ لَكُمْ فُرْقَانًا } \"Hai orang-orang beriman, jika kamu bertakwa kepada Allah, Kami akan memberikan kepadamu Furqaan\" , Ibnul Qayyim berkata : ((Dan diantara furqon itu adalah : cahaya yang denganya seorang hamba dapat membedakan antara yang haq dan bathil, maka semakin hatinya mendekat kepada Allah niscaya furqonnya semakin sempurna, dan hanya kepada Allah kita mengharap datangnya taufiq))."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29 Hai orang-orang beriman, jika kamu bertakwa kepada Allah dengan taat dan menjauhi maksiat, Kami akan memberikan kepadamu cahaya yang mampu membedakan baik dan buruk serta ilmu yang bermanfaat. Pertolongan dari musuh dan menghapus dosa-dosa kalian. Dan Allah mempunyai karunia yang besar Yang akan memberikan pahala yang banyak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jika kalian bertakwa kepada Allah, niscaya Dia akan memberi kalian pemisah} pemisah antara yang benar dan yang bathil {menghapus} menghapus {kesalahan-kesalahan kalian, dan mengampuni kalian} menutupi dosa-dosa kalian dari manusia {Allah memiliki karunia yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29 ketakwaan seorang hamba kepada Rabbnya adalah tanda keberuntungan dan kebahagiaan, Allah mengaitkan banyak sekali kebaikan dunia dan akhirat dengan takwa. dalam ayat ini Allah menyebutkan bahwa barangsiapa yang bertakwa kepada Allah, maka dia akan mendapatkan empat perkara, setiap satu perkara darinya leih baik daripada dunia dan isinya. Pertama, furqan, yaitu ilmu dan hidayah yang dengannya pemiliknya dapat membedakan anatara petunjuk dan kesesatan, kebenaran dan kebatilan, halal dengan haram, dan orang orang yang berbahagia dengan orang orang yang sengsara. Kedua dan ketiga, pelebur keburukan dan ampunan dosa dosa, masing masing dari keduanya adalah satu makna jika disebutkan secara mutlak, jika digabung maka yang pertama berarti pelebur dosa dosa kecil dan yang kedua adalah ampunan dosa dosa besar. Yang keempat, pahala dan ganjaran yang besar bagi yang bertakwa kepada Allah dan mementingkan ridhaNya diatas hawa nafsunya. ”dan Allah mempunyai karunia yang besar”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 29: Furqan artinya kemampuan membedakan antara yang haq (benar) dan yang batil, petunjuk dan kesesatan, dan yang halal dengan yang haram. Furqan dapat juga diartikan dengan pertolongan. Yaitu dosa-dosa kecil. Yaitu dosa-dosa besar. Allah memiliki pahala yang besar dan banyak bagi orang-orang yang bertakwa kepada-Nya dan mendahulukan keridhaan-Nya di atas hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 29",
    "description": "Dalam menghadapi ujian hidup, apalagi menyangkut anak dan harta, manusia seringkali bingung dan sulit menentukan sikap. Maka melalui ayat ini Allah menjelaskan cara untuk menyingkirkan kebingungan itu. Wahai orang-orang yang beriman! jika kamu bertakwa kepada Allah, patuh pada perintah Allah dalam kesendirian atau di tengah keramaian, niscaya dia akan memberikan karunia berupa furqa'n, yakni kemampuan membedakan antara yang hak dan batil kepadamu, dan menghapus segala kesalahanmu dengan menutupinya di dunia dan akhirat serta tidak menuntut pertanggungjawabanmu, dan mengampuni dosadosa-Mu. Allah memiliki karunia yang besar nabi Muhammad pun diingatkan oleh Allah tentang nikmat yang harus disyukuri, terutama ketika Allah menyelamatkannya dari upaya jahat orang-orang kafir mekah. Dan ingatlah wahai nabi Muhammad, ketika tokoh dan pemuka orang-orang kafir mekah, terutama dari kalangan kaum quraisy memikirkan dan merencanakan tipu daya terhadapmu nabi Muhammad untuk mence-lakakanmu dengan menangkap dan memenjarakanmu, atau membunuhmu, atau mengusirmu dari mekah. Mereka selalu memikirkan dan membuat tipu daya dan Allah membuat apa yang serupa dengan tipu daya yang lebih hebat, sehingga menggagalkan tipu daya mereka itu. Mereka mengatur rencana jahat, tapi Allah juga punya rencana menyelamatkan dirimu dari kejahatan mereka. Dan rencana Allah itu lebih baik, lebih kuat dan lebih unggul, karena Allah adalah sebaik-baik pembalas tipu daya."
  }
]