[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang terus menerus dalam menjalankan shalat fardu pada waktu-waktunya, dan dari rizki yang kami berikan kepada mereka dari harta-harta mereka infakan sesuai apa yang Allah perintahkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yaitu orang-orang yang selalu menunaikan salat secara sempurna dan tepat pada waktunya, serta menginfakkan sebagian rezeki yang Kami berikan kepada mereka, baik yang bersifat wajib maupun sunah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Sifat keempat adalah mereka senantiasa menegakkan shalat pada waktunya dengan menyempurnakan rukun, syarat, sunnah, adab, dan kekhusyuannya. Sedangkan sifat kelima adalah mereka memberikan harta mereka kepada orang-orang miskin dan yang membutuhkan, dengan penuh kerelaan dan keridhaan demi memenuhi perintah Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3 Yaitu orang-orang yang mendirikan shalat dengan sempurna pada waktunya dan melengkapi rukunnya. Juga yang menafkahkan sebagian dari rezeki yang Kami berikan kepada mereka dalam ketaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang mendirikan shalat dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3 “yaitu orang orang yang mendirikan shalat” yang fardhu dan yang sunnah dengan amal amalnya yang lahir dan yang batin, seperti hadirnya hati yang merupakan inti dan ruh shalat, ”dan yang menafkahkan sebagian dari rizki yang kami berikan kepada mereka” yakni nafkah nafkah wajib seperti zakat, kafarat, nafkah kepada istri, kerabat dan hamba sahaya, dan nafkah sunnah seperti sedekah pada jalan jalan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 3: Yang wajib maupun yang sunat disertai sikap khusyu’ (hadirnya hati dan diamnya anggota badan). Baik infak yang wajib (seperti zakat, kaffarat, menafkahi anak dan istri, orang tua, dan budak yang dimiliki) maupun yang sunat (seperti sedekah di semua jalan-jalan kebaikan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 3",
    "description": "Selain memiliki keimanan yang mantap dan kuat, serta amal kalbu lainnya, secara lahiriah orang mukmin sejati adalah orang-orang yang melaksanakan salat secara berkesinambungan sesuai waktu dan tatacara yang telah ditetapkan, dengan penuh rasa khusyuk dan ikhlas, dan mereka yang menginfakkan sebagian dari rezeki yang kami berikan kepada mereka sesuai ketentuan setelah menjelaskan beberapa bentuk amal yang berkaitan dengan hati, anggota tubuh dan harta, Allah menjelaskan bahwa mereka yang memiliki sifat-sifat seperti tersebut di atas itulah orang-orang yang benarbenar beriman, lahir dan batin, yang sempurna lagi mantap imannya. Mereka akan memperoleh derajat-derajat yang tinggi di sisi tuhannya, sesuai dengan amal mereka. Dan ampunan atas segala dosa mereka serta rezeki yang mulia berupa kehidupan yang baik di dunia dan kehidupan yang membahagiakan di akhirat."
  }
]