[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah olehmu (wahai rasul), ketika kaum musyrikin dari kaummu di Mekah melancarkan tipu daya terhadp dirimu, untuk menahan kamu, menghabisi kamu atau mengasingkan dirimu dari negerimu, dan menyusun rencana jahat terhadapmu, dan Allah menggagalkan makar mereka sebagai balasan bagi mereka, dan Allah menyusun (pembalasan) makar dan Allah adalah sebaik-baik yang menyusun (pembalasan) makar. Maka Dia membalas makar mereka tanpa mereka sadari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Ingatlah -wahai Rasul- ketika orang-orang musyrik bersekongkol untuk menahanmu, membunuhmu, atau mengusirmu dari negerimu ke negeri lain. Mereka membuat tipu daya untuk mencelakakanmu, tetapi Allah membalas tipu daya mereka. Dan Allah adalah sebaik-baik pembalas tipu daya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hai Muhammad, ingatlah bersama umatmu apa yang Allah karuniakan pada hari ketika para pemimpin orang-orang musyrik mengatur siasat tipu daya terhadapmu, mereka berdiskusi di Darun Nadwah untuk memenjarakanmu agar dapat menghalangimu menyampaikan dakwah dan menghalangi orang-orang agar tidak dapat sampai kepadamu; untuk membunuhmu agar mereka dapat beristirahat darimu dan dari risalahmu; atau untuk mengusirmu dari kota Makkah. Hingga mereka bersepakat untuk mengumpulkan seorang pemuda dari setiap kabilah agar mereka membunuhmu secara bersama-sama, sehingga darahmu menjadi tanggungan setiap kabilah, dengan begitu Bani Hasyim akan rela untuk menerima diyat sebagai ganti dari darahmu karena mereka tidak mampu melawan seluruh kabilah Quraisy. Orang-orang musyrik itu membuat tipu daya kepadamu dan kepada para pengikutmu dengan tipu daya yang buruk. Namun Allah mengembalikan tipu daya mereka kepada diri mereka sendiri dan menjadikan usaha mereka sia-sia. Kemudian Allah mengeluarkan nabi-Nya dari Makkah menuju Madinah tanpa mendapat keburukan sedikitpun, lalu Allah memberinya kejayaan di muka bumi. Allah adalah sebaik-baik pengatur tipu daya, karena tipu daya mereka sama sekali tidak berarti dihadapan tipu daya Allah. Dia Maha Lembut kepada hamba-Nya dan tidak ada yang dapat mengalahkan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُوا۟ لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ ۚ (Dan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan daya upaya terhadapmu untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu) Ibnu Abbas berkata: suatu malam kaum Quraisy bermusyawarah; sebagian mereka berkata: “bila pagi telah tiba maka ikatlah ia dengan perjanjian –yang dimaksud adalah Rasulullah—, sebagian lain mengatakan: “tidak, tapi bunuhlah ia”. Dan sebagian lainnya mengatakan: “tidak, tapi bunuhlah ia”. Tapi Allah mengabarkan tentang itu, maka Ali bin Abi Thalib malam itu tidur di tempat tidur Rasulullah, agar Rasulullah dapat menuju gua Thur. وَيَمْكُرُونَ وَيَمْكُرُ اللهُ ۖ (Mereka memikirkan tipu daya dan Allah menggagalkan tipu daya itu) Mereka menyembunyikan rencana tipu daya mereka untuk Rasulullah, maka Allah membalas mereka dengan hal itu dan mengembalikan tipu daya mereka di leher-leher mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30 Dan ingatlah wahai Nabi, ketika orang-orang kafir Quraisy memikirkan daya upaya terhadapmu untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu dari Makkah dengan kekalahan kalian. Mereka memikirkan tipu daya dan Allah menggagalkan tipu daya mereka itu. Allah sebaik-baik Pembalas tipu daya/makar. Ayat ini turun ketika orang musyrik merencankan tipu daya di Makkah pada perkumpulan dengan melibatkan berbagai kabilah untuk membunuh Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika orang-orang kafir merencanakan tipu daya terhadapmu untuk menahanmu} menawanmu {membunuh, atau mengusirmu} mengusirmu dari negerimu ke negeri lain {Mereka membuat tipu daya dan Allah membalas tipu daya itu. Allah adalah sebaik-baik pembalas tipu daya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30 dan ingatlah wahai Rasulullah apa yang Allah limpahkan sebagai nikmat kepadamu “ketika orang orang kafir (quraisy) memikirkan tipudaya terhadapmu” ketika orang orang musyrikin berunding di Dar an-nadwah tentang apa yang akan mereka lakukan terhadap Nabi, apakah mereka hendak memenjarakan dan memasung beliau, atau mereka akan membunuh beliau sehingga mereka bisa terbebas -kata mereka- dari keburukan beliau, atau mereka akan mengusir dan mengeluarkan beliau dari negeri mereka. Setiap orang menyodorkan pendapatnya dari pendapat pendapat tersebut, dan akhirnya mereka bersepakat diatas pendapat orang terburuk dari mereka, abu jahal -semoga Allah melaknatnya-, yakni hendaknya masing masing suku di quraisy memilih seorang pemuda, lalu dia dibekali pedang yang tajam, lalu semuanya serempak membunuh beliau agar darah beliau terbagi pada suku suku yang berpartisipasi sehingga mau tidak mau bani hasyim akan menerima diyatnya, karena mereka tidak akan kuasa mengahadapi seluruh suku quraisy. Dimalam hari mereka mengincar nabi untuk membunuh beliau jika terbangun dari tidurnya. Akan tetapi datang wahyu dari langit kepada beliau. nabi keluar melewati mereka dengan menaburkan pasir ke kepala mereka, maka Allah menutup pandangan mereka, sehingga tatkala merasa telah menunggu sangat lama, ada seseorang menghampiri mereka dan berkata ”Allah telah menggagalkan kalian, Muhammad telah pergi dan menaburkan pasir ke kepala kalian” maka masing masing dari mereka ingin mengibaskan pasir dari kepalanya. Allah melindungi RasulNya dari mereka dan mengijinkan hijrah ke madinah, maka nabipun berhijrah ke sana. Selain itu Allah mendukungnya dengan sahabat sahabatnya dari kalangan muhajirin dan anshar, seterusnya dakah beliau berkembang pesat sehingga beliau kembali masuk ke Makkah dengan kekuatan dan dapat menundukan penduduknya. Merekapun takluk kepada nabi berlutut dibawah hukumnya. Padahal sebelum itu nabi keluar dari sana secara sembunyi sembunyi dengan rasa takut. maha suci Allah yang maha kasih kepada hambaNya tidak ada seorang makhluk pun yang dapat mengalahkanNYa"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 30: Mereka bermusyawarah di Darun Nadwah untuk menyikapi Rasulullah shallallahu 'alaihi wa sallam. Muhammad bin Ishaq meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma, bahwa sekelompok orang Quraisy yang terdiri dari para pemuka setiap suku berkumpul memasuki Darun Nadwah, lalu Iblis datang kepada mereka menjelma menjadi orang tua yang disegani. Ketika mereka melihatnya, mereka bertanya, “Siapa kamu?” Iblis menjawab, “Orang tua yang berasal dari Nejd. Saya mendengar kamu sedang berkumpul dan saya senang menghadirinya. Pendapat dan saran saya niscaya tidak menghilangkan (maksud)mu.” Mereka berkata, “Ya, masuklah.” Maka ia pun masuk bersama mereka. Iblis berkata, “Perhatikanlah masalah orang ini! Demi Allah, hampir saja dia memegang urusan kamu dengan perintahnya.” Lalu salah seorang di antara mereka berkata, “Tahanlah ia dengan diikat lalu tunggulah sampai kecelakaan menimpanya sehingga ia binasa sebagaimana para penyair sebelumnya telah binasa, yaitu Zuhair dan Nabighah, dan ia seperti mereka.” Lalu orang tua dari Nejd itu (yakni Iblis) berkata dengan keras, “Demi Allah, pendapat ini tidak tepat. Demi Allah, tentu Tuhannya akan mengeluarkannya dari tahanan dan memberikannya kepada para sahabatnya. Mereka (para sahabat) tentu akan meraihnya dan mengambilnya dari kalian serta akan melindungi Beliau dari kalian. Mungkin saja ia nanti akan mengusirmu dari negerimu.” Mereka berkata, “Orang tua ini betul, cobalah cari pendapat yang lain.” Salah seorang di antara mereka berkata, “Usirlah dia dari tengah-tengah kalian sehingga kalian dapat beristirahat darinya, karena apabila ia keluar, maka perbuatannya tidak akan membahayakan kamu, dan lagi di manakah bahayanya jika ia sudah tidak ada di dekat kalian. Kalian pun dapat beristirahat, dan urusannya bukan kepada kalian lagi.” Orang tua Nejd itu berkata, “Demi Allah, pendapat ini tidak cocok bagi kamu. Tidakkah kamu memperhatikan kata-katanya yang manis dan lancar lisannya, sedangkan ucapannya sebagaimana yang kamu dengar menyentuh hati? Demi Allah, jika kalian melakukannya, lalu ia menawarkan ajarannya kepada orang-orang Arab (lainnya), tentu mereka akan berkumpul (membela)nya dan akan menyerang kamu dan mengusirmu dari negerimu serta membunuh para pemukamu.” Mereka berkata, “Demi Allah, benar sekali. Cobalah cari pendapat selain ini.” Maka Abu Jahal la’natullah ‘alaih berkata, “Demi Allah, aku akan memberimu pendapat yang nampaknya belum pernah kamu pikirkan, dan saya lihat tidak ada lagi pendapat selainnya.” Mereka bertanya, “Apa itu?” Ia berkata, “Kamu ambil seorang pemuda terhormat yang gagah dari setiap suku, lalu setiap pemuda diberikan pedang yang tajam, kemudian mereka sama-sama menusuknya seperti tusukan yang dilakukan seseorang. Jika mereka telah membunuhnya, maka darahnya akan mengena ke semua kabilah, sehingga saya kira suku dari Bani Hasyim ini tidak akan sanggup memerangi orang-orang Quraisy semua, dan mereka setelah melihat kejadian itu akan menerima diat. Kita pun dapat beristirahat dan menyelesaikan bahayanya.” Maka orang tua Nejd itu berkata, “Ini, demi Allah, adalah pendapat yang tepat. Sesuai yang dikatakan pemuda itu (Abu Jahal), dan saya lihat tidak ada yang lain.” Setelah itu mereka pun berpencar dengan menyepakati usulan itu. Jibril pun mendatangi Nabi shallallahu 'alaihi wa sallam, memerintahkannya agar Beliau tidak bermalam di tempat tidur yang biasa Beliau tempati untuk bermalam, dan memberitahukan kepada Beliau tipu daya mereka. Maka Rasulullah shallallahu 'alaihi wa sallam tidak bermalam di rumahnya pada malam itu, dan Allah telah mengizinkan Beliau keluar (berhijrah). Allah juga menurunkan surat Al Anfal kepada Beliau setelah tiba di Madinah, yang di sana Allah menerangkan nikmat-nikmat-Nya dan ujian dari sisi-Nya, “Dan (ingatlah), ketika orang-orang kafir (Quraisy) memikirkan tipu daya terhadapmu (Muhammad) untuk menangkap dan memenjarakanmu atau membunuhmu, atau mengusirmu. Mereka membuat tipu daya dan Allah menggagalkan tipu daya itu. Allah adalah sebaik-baik pembalas tipu daya.” Sedangkan terhadap ucapan mereka, “Tunggulah sampai kecelakaan menimpanya sehingga ia pun binasa sebagaimana para penyair sebelumnya binasa” turunlah ayat, “Bahkan mereka mengatakan, \"Dia (Muhammad) adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya\". (Terj. Ath Thuur: 30) dan hari tersebut disebut sebagai hari berdesakan karena mereka berkumpul terhadap suatu pendapat.” (lihat Ibnu HIsyam 1/480-482). Dengan mengatur urusan Rasulullah shallallahu 'alaihi wa sallam, memberi wahyu tentang apa yang mereka rencanakan terhadap Beliau dan memerintahkan Beliau berhijrah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 30",
    "description": "Nabi Muhammad pun diingatkan oleh Allah tentang nikmat yang harus disyukuri, terutama ketika Allah menyelamatkannya dari upaya jahat orang-orang kafir mekah. Dan ingatlah wahai nabi Muhammad, ketika tokoh dan pemuka orang-orang kafir mekah, terutama dari kalangan kaum quraisy memikirkan dan merencanakan tipu daya terhadapmu nabi Muhammad untuk mence-lakakanmu dengan menangkap dan memenjarakanmu, atau membunuhmu, atau mengusirmu dari mekah. Mereka selalu memikirkan dan membuat tipu daya dan Allah membuat apa yang serupa dengan tipu daya yang lebih hebat, sehingga menggagalkan tipu daya mereka itu. Mereka mengatur rencana jahat, tapi Allah juga punya rencana menyelamatkan dirimu dari kejahatan mereka. Dan rencana Allah itu lebih baik, lebih kuat dan lebih unggul, karena Allah adalah sebaik-baik pembalas tipu daya. Begitulah rencana makar mereka terhadap rasulullah, dan masih ada lagi sikap buruk mereka terhadap apa yang diturunkan kepada beliau. Dan perhatikanlah sikap permusuhan yang diperlihatkan oleh orang-orang kafir apabila ayat-ayat kami, yakni ayat-ayat Al-Qur'an, dibacakan atau disampaikan oleh siapa pun kepada mereka. Kebodohan dan keangkuhan mereka yang sangat, mendorong mereka untuk berkata, sesungguhnya kami telah mendengar ayat-ayat seperti ini. Ia biasa biasa saja, tidak memiliki keistimewaan, jika kami menghendaki niscaya kami dapat membacakan atau membuat yang seperti ini. Yang dibacakan dari ayat-ayat al-qur`an ini tidak lain hanyalah dongeng orang-orang terdahulu."
  }
]