[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika dibacakan kepada orang-orang kafir kepada Allah ayat-ayat al-qur’an al-aziz, mereka mengatakan karena kebodohan dan lantaran penentangan mereka terhadap kebenaran, ”sesungguhnya kami telah mendengar ini sebelumnya. Kalau kami menghendaki, tentulah kami dapat menyampaikan sesuatu yang serupa dengan al-qur’an. Tidaklah al-qur’an yang kamu bacakan kepada kami (wahai rasul), kecuali merupakan dongeng-dongeng bohong orang-orang terdahulu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Apabila ayat-ayat Kami dibacakan kepada mereka maka dengan angkuh dan sombongnya mereka berkata, “Kami sudah mendengar yang seperti ini sebelumnya. Sekiranya kami mau mengatakan sesuatu yang mirip dengan Al-Qur`ān, pasti kami akan mengatakannya. Sesungguhnya Al-Qur`ān yang kami dengar itu tidak lebih dari bualan orang-orang terdahulu. Oleh karena itulah kami tidak akan mempercayainya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Lalu Allah menyebutkan kejahatan lain yang dilakukan oleh musuh-musuh agama. Orang-orang musyrik telah sampai pada batas pendustaan dan kebebalan di dalam kemaksiatan sehingga ketika mereka dibacakan ayat-ayat Allah, mereka berkata: \"Kami telah mendengar dan memahami apa yang kamu bacakan kepada kami, seandainya kami menginginkan niscaya kami dapat mengatakan seperti Alquran yang kamu bacakan itu! Tidaklah Alquran itu melainkan hanya dongeng-dongeng dan cerita-cerita dari orang-orang terdahulu, dan bukan dari Tuhanmu sebagaimana yang kamu katakan!\" Ini merupakan bentuk pembangkangan dan kezaliman mereka karena sesungguhnya Allah telah menentang mereka agar mendatangkan satu surat semisal yang ada dalam al-quran dengan meminta pertolongan siapapun selain Allah; namun mereka tidak mampu melakukan itu. Mereka telah mengetahui bahwa Rasulullah tidak dapat membaca dan menulis, tidak pernah pula pergi untuk mempelajari cerita-cerita orang terdahulu; namun dia datang dengan membawa kitab yang mulia ini yang tidak akan tercampur dengan kebatilan sampai kapanpun, ia diturunkan dari sisi Yang Maha Bijaksana dan Terpuji. Adapun yang mereka katakan itu hanyalah bentuk perang urat saraf yang bertujuan untuk merusak nama dakwah islamiyah, agar dapat menyesatkan orang banyak, dan menghalangi Alquran agar tidak mempengaruhi hati mereka, serta berusaha menghilangkan tanda-tanda kebenaran meski hanya sebentar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. قَالُوا۟ (mereka berkata) Dengan penuh keras kepala, kedurhakaan, dan jauh dari kebenaran. قَدْ سَمِعْنَا (Sesungguhnya kami telah mendengar) Yakni mendengar apa yang kamu bacakan kepada kami. لَوْ نَشَآءُ لَقُلْنَا مِثْلَ هٰذَآ ۙ (kalau kami menhendaki niscaya kami dapat membacakan yang seperti ini) Yakni membacakan apa yang kamu bacakan kepada kami. Dan ketika mereka hendak membacakan yang seperti al-qur’an itu ternyata mereka tidak mampu melakukannya. Kemudian mereka berkata dengan penuh kedurhakaan dan keras kepala “ini tidak lain hanyalah dongeng-dongeng orang-orang terdahulu”. إن هذا إلا أساطير الأولين (ini tidak lain hanyalah dongeng-dongengan orang-orang terdahulu) Yakni apa yang ditulis oleh pengarang-pengarang tentang dongeng orang-orang terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31 Apabila dibacakan kepada mereka ayat-ayat Kami, mereka berkata: “Sesungguhnya kami telah mendengar ayat-ayat yang seperti ini, kalau kami menghendaki niscaya kami dapat membacakan yang seperti ini, Al Quran ini tidak lain hanyalah dongeng-dongengan orang-orang purbakala yang tidak benar”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila ayat-ayat Kami dibacakan kepada mereka, mereka berkata,“Sungguh kami telah mendengarnya. Jika kami menghendaki, sungguh kami dapat mengucapkan yang seperti ini juga. Ini tidak lain hanyalah dongeng} kebohongan dan sesuatu yang tidak berguna {orang-orang terdahulu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31 Allah berfirman menjelaskan kebengalan orang orang yang mendustakan rasulullah “dan apabila dibacakan kepada mereka ayat ayat kami” yang menunjukan kebenaran apa yang dibawa oleh Rasulullah ”mereka berkata sesungguhnya kami telah mendengar (ayat ayat yang seperti ini) kalau kami menghendaki niscaya kami dapat membacakan yang seperti ini (al qur’an), ini tidak lain hanyalah dongengan dongengan orang orang purbakala” ini termasuk pengingakaran dan kezhaliman mereka, padahal sebenarnya Allah telah menantang mereka untuk menghadirkan satu surat yang sepertinya dan memanggil siapapun yang mampu selain Allah, namun mereka tidak mampu untuk itu dan ketidak mampuan mereka terbukti. Ucapan yang diucapkan oleh orang ini hanyalah klaim kosong yang di dustakan oleh realita. Telah diketahui bahwa nabi adalah ummi, tidak membaca, tidak menulis, tidak pula bepergian untuk mempelajari berita berita orang orang terdahulu, lalu beliau hadir dengan kitab yang mulia ini yang tidak ada kebatilan yang datang di depannya dan tidak pula dari belakangnya yang turun dari yang maha bijak lagi maha terpuji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 31: Inilah sikap keras dan kezaliman mereka, padahal sesungguhnya Alah telah menantang mereka membuat satu surat yang semisalnya dan menyuruh mereka memanggil yang lain selain Allah untuk berkumpul membuatnya, namun mereka tidak sanggup juga membuatnya. Oleh karena itu ucapan ini hanyalah dakwaan semata yang didustakan oleh kenyataan, padahal telah diketahui bahwa Beliau adalah seorang ummiy; yang tidak bisa membaca dan menulis, dan tidak pernah mengadakan perjalanan untuk mempelajari berita orang-orang terdahulu. Menurut penyusun tafsir Al Jalalain, bahwa yang mengucapkan kata-kata di atas adalah An Nadhr bin Al Harits, di mana sebelumnya ia mendatangi negeri Hirah untuk berdagang, lalu ia membeli buku-buku orang asing dan menceritakannya kepada penduduk Mekah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 31",
    "description": "Begitulah rencana makar mereka terhadap rasulullah, dan masih ada lagi sikap buruk mereka terhadap apa yang diturunkan kepada beliau. Dan perhatikanlah sikap permusuhan yang diperlihatkan oleh orang-orang kafir apabila ayat-ayat kami, yakni ayat-ayat Al-Qur'an, dibacakan atau disampaikan oleh siapa pun kepada mereka. Kebodohan dan keangkuhan mereka yang sangat, mendorong mereka untuk berkata, sesungguhnya kami telah mendengar ayat-ayat seperti ini. Ia biasa biasa saja, tidak memiliki keistimewaan, jika kami menghendaki niscaya kami dapat membacakan atau membuat yang seperti ini. Yang dibacakan dari ayat-ayat al-qur`an ini tidak lain hanyalah dongeng orang-orang terdahulu. Mereka bukan hanya melecehkan rasulullah dan Al-Qur'an yang diturunkan kepadanya, tetapi juga menantang Allah. Dan ingatlah wahai nabi Muhammad, ketika mereka, yakni orang-orang musyrik berkata guna mengelabui orang lain seakan-akan apa yang mereka ucapkan tentang Al-Qur'an memang benar dan sesuai keyakinan mereka, ya Allah, jika Al-Qur'an yang dibawa oleh Muhammad ini benar wahyu dari sisi engkau, maka hujanilah kami dengan batu-batu yang benar-benar turun, atau batu-batu sebanyak hujan dari langit, atau kalau siksa itu bukan berupa batu, maka datangkanlah kepada kami azab yang pedih."
  }
]