[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah olehmu (wahai rasul), pernyataan orang-orang musyrik dari kaummu yang berdoa kepada Allah, ”bila ajaran yang dibawa oleh Muhammad adalah benar dariMu, maka turunkanlah kepada kami hujan batu dari langit, atau datangkanlah kepada kami siksaan yang berat lagi pedih.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan ingatlah -wahai Rasul- ketika orang-orang musyrik berkata, “Ya Allah, jika agama yang dibawa oleh Muhammad itu benar, timpakanlah kepada kami batu-batu dari langit yang akan membinasakan kami. Atau datangkanlah azab yang sangat berat kepada kami.” Mereka mengatakan hal itu untuk menunjukkan betapa kerasnya penolakan dan pengingkaran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Dan ayat-ayat ini tetap berlanjut dalam pembahasan tentang kejahatan ketiga dari kejahatan-kejahatan yang dilakukan orang-orang musyrik Quraisy. Ayat ini menyebutkan hal yang mengherankan dari pembangkangan dan pengingkaran mereka terhadap kebenaran sehingga mereka tidak hanya mengingkari bahwa Alquran datang dari sisi Allah dan Muhammad telah datang kepada mereka dengan kebenaran, namun mereka juga mengatakan: \"Ya Allah, jika yang didatangkan Muhammad kepada kami berupa Alquran dan lainnya merupakan kebenaran yang diturunkan dari sisi-Mu, maka siksalah kami akibat keingkaran dan kekafiran kami terhadapnya, dengan menurunkan kepada kami batu-batu dari langit yang membinasakan kami, sebagaimana yang engkau lakukan terhadap pasukan bergajah yang akan menyerang Makkah; atau dengan menurunkan azab yang pedih yang dapat membinasakan kami.\" Mereka tidak mengatakan: \"Jika ini adalah kebenaran maka Berilah kami hidayah kepadanya\". Dan yang mereka maksudkan adalah untuk menegaskan bahwa yang dibawa Muhammad bukanlah suatu kebenaran. Perkataan mereka ini menunjukkan pembangkangan yang sangat besar dan kebencian terhadap kebenaran meskipun sangat jelas tanda-tandanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَأَمْطِرْ عَلَيْنَا (maka hujanilah kami) Mereka mengatakan ini karena keingkaran mereka yang begitu besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32 Ingatlah, ketika mereka orang-orang musyrik berkata: “Ya Allah, jika betul Al Quran yang dibaca Muhammad ini, memang benar dan diturunkan dari sisi Engkau, maka hujanilah kami dengan batu dari langit sehingga kami binasa sebagaimana apa yang sudah terjadi pada kaum Nabi Luth, atau datangkanlah kepada kami azab yang pedih”. Ayat ini turun untuk An Nadhr bin Harits ketika dia berkata: Alquran ini tidak lain hanyalah dongeng purbakala, kemudia dia menyeru sebagaimana yang telah disebutkan dengan penuh kesombongan, pembangkangan dan pengolokan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka berkata,“Ya Allah, jika ini adalah kebenaran} jika Al-Qur’an ini adalah kebenaran yang diturunkan {dari sisiMu, hujanilah kami dengan batu dari langit atau datangkanlah kepada kami azab yang sangat pedih.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32 “dan ingatlah ketika mereka (orang orang musrik) berkata 'ya Allah jika betul (al qur’an) ini yang mana Muhammad berdakwah kepadanya adalah yang benar dari sisiMu, maka hujanilah kami dengan batu dari langit atau datangkanlah kepada kami azab yang pedih” mereka mengucapkan itu dengan penuh keyakinan karena kebatilan dan kebodohan mereka terhadap ucapan yang pantas. seandainya mereka apabila mereka tetap memegang syubhat dan tipu daya batil yang semestinya membuat mereka tahu dan yakin terhadapnya, mereka berkata kepada orang yang mendebat mereka dan mengklaim bahwa kebenaran ada padanya, ”jika memang ini adalah kebenaran darimu maka tunjukan kami kepadanya” niscaya hal itu lebih utama dan lebih menutupi kezhaliman mereka sejak mereka berkata ”ya Allah jika betul al quran ini ialah yang benar dari sisiMu” dengan hanya perkataan ini saja telah diketahui bahwa mereka adalah orang orang bodoh, dungu, pander, dan zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 32: Padahal yang seharusnya mereka ucapkan adalah, “Ya Allah, jika (Al Quran) ini benar (wahyu) dari Engkau, maka tunjukkanlah kami kepadanya.” Namun karena kebodohan mereka yang begitu dalam, mereka malah mengucapkan sebaliknya. Padahal kalau Allah segera menimpakan azab kepada mereka, maka tidak ada satu pun dari mereka yang selamat, akan tetapi Dia menghindarkan azab itu karena Rasul masih berada di tengah-tengah mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 32",
    "description": "Mereka bukan hanya melecehkan rasulullah dan Al-Qur'an yang diturunkan kepadanya, tetapi juga menantang Allah. Dan ingatlah wahai nabi Muhammad, ketika mereka, yakni orang-orang musyrik berkata guna mengelabui orang lain seakan-akan apa yang mereka ucapkan tentang Al-Qur'an memang benar dan sesuai keyakinan mereka, ya Allah, jika Al-Qur'an yang dibawa oleh Muhammad ini benar wahyu dari sisi engkau, maka hujanilah kami dengan batu-batu yang benar-benar turun, atau batu-batu sebanyak hujan dari langit, atau kalau siksa itu bukan berupa batu, maka datangkanlah kepada kami azab yang pedihtetapi permohonan mereka yang bersifat menantang itu, tidak segera dikabulkan oleh Allah, sebab dengan hikmah-Nya Allah sekalikali tidak akan menghukum mereka sekarang dengan siksa duniawi yang berat dan memusnahkan, selama engkau nabi Muhammad berada di antara mereka dengan harapan mereka menyambut seruanmu itu. Dan sekali-kali tidaklah pula Allah akan menghukum mereka secara mantap dan langgeng di masa yang akan datang, sedang mereka masih memohon ampunan, menyadari dan meninggalkan kekeliruan mereka."
  }
]