[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekali-kali Allah tidaklah menyiksa kaum musyrikin itu, sedang kamu wahai rasul, masih berada ditengah mereka, dan Allah tidak menyiksa mereka, ketika mereka beristigfar memohon ampunan (kepada Allah) dari dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Allah tidak akan menimpakan azab kepada umatmu (baik dari kalangan umat yang sudah menerima dakwahmu maupun umat yang belum menerima dakwah) dengan azab yang memusnahkan mereka selagi kamu (wahai Muhammad) hidup di tengah-tengah mereka. Jadi keberadaanmu di tengah-tengah mereka adalah jaminan keamanan bagi mereka dari azab Allah. Dan Allah tidak akan menimpakan azab kepada mereka selagi mereka mau memohon ampun kepada Allah atas dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Dan Allah tidak menghendaki untuk mengazab orang-orang yang berdoa dengan doa yang aneh itu dengan azab yang dapat membinasakan mereka semua sedangkan kamu masih tinggal bersama mereka di kota Makkah wahai Muhammad. Dan telah berlaku sunatullah bahwa Dia tidak akan membinasakan suatu negeri sedangkan nabi dan orang-orang beriman berada di dalamnya hingga mereka keluar darinya kemudian Allah baru akan mengazab orang-orang kafir. Dan Allah juga tidak menghendaki untuk mengazab mereka sedangkan diantara mereka terdapat orang-orang beriman yang lemah yang memohon ampun kepada Allah, yaitu orang-orang beriman yang tidak mampu meninggalkan Makkah untuk berhijrah ke Madinah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَمَا كَانَ اللهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ ۚ (Dan Allah sekali-kali tidak akan mengazab mereka, sedang kamu berada di antara mereka) Yakni kamu ada diantara mereka wahai Muhammad, karena selama kamu diantara mereka maka mereka berada dalam penangguhan turunnya azab, yaitu azab yang memusnahkan mereka semua. وَمَا كَانَ اللهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ (Dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun) Diriwayatkan bahwa mereka ketika melakukan thawaf mengatakan “kami mohon ampunanmu ya Allah”. Pendapat lain mengatakan maknanya adalah seandainya mereka termasuk orang-orang yang beriman kepada Allah dan memohon ampunan-Nya niscaya Allah tidak akan mengazab mereka. Dan pendapat lain mengatakan: Allah tidak akan mengazab mereka selama diantara mereka terdapat orang-orang beriman yang memohon ampun. Dan ketika orang-orang beriman pergi dari mereka, maka Allah mengazab mereka dengan kekalahan di perang Badar dan perang-perang setelahnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sebagian ulama berdalil dari ayat ini bahwasanya ketika cinta Rasul dan sunnahnya masuk ke hati seorang hamba, sesungguhnya Allah tidak akan memberi azab kepada hatinya, baik di dunia maupun di akhirat. Oleh karena itu jika dengan cinta Rasul saja hati tidak akan diazab, maka bagaimana dengan hadirnya cinta kepada Allah ke dalam hati seorang hamba. 2 ). Diantara keistimewaan orang beriman adalah orang yang paling kuat jiwa dan raganya, maka mereka senantiasa bertawakkal kepada Allah, dan dengan istighfar mereka diampuni dan dijauhkan dari siksaan : { Dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun }. 3 ). Jika anda menghubungkan firman Allah dalam hadits qudsy : (( يا عبادي إنكم تخطئون بالليل والنهار وأنا أغفر الذنوب جميعا فاستغفروني أغفر لكم )) \"Wahai hamba-hamba-Ku…, sesungguhnya kalian berbuat dosa diwaktu malam dan siang sedangkan Aku mengampuni seluruh dosa, maka mohon ampunlah kalian kepada-Ku niscaya Akan memberi ampun kepada kalian\", dan firman-Nya dalam al-qur'an : { وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ } \"Dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun\" , dan bahwasanya dalam ayat ini kalimat (istighfar) datang dengan lafazh (fi'il mudhori) yang menunjukkan kata kerja yang terus berlangsung; anda akan mengetahui bahwasanya kita senantiasa butuh kepada permohonan ampun kepada Allah disetiap waktu dan setiap saat, tetapi ada perkara aneh yang menjadi kebiasaan buruk yang disenangi oleh sebagian muslim dalam istighfar namun hakikatnya cara mereka itu akan semakin menjauhkan mereka dari perintah wahyu Allah, maka ayat ini juga dapat menjadi pintu taubat bagi mereka dari perkara-perkara bid'ah dalam masalah dzikir. 4 ). Susunan kata yang datang dalam bentuk (isim) menandakan suatu ketetapan yang senantiasa berlangsung tersus menerus, dan susunan kata yang datang dalam bentuk kata kerja (fi'il) menunjukkan sesuatu yang baru yang juga selalu dalam kelangsungan yang terus berlanjut, dan diantara keindahan ungkapan ini ada pada adalah firman Allah : { وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنْتَ فِيهِمْ ۚ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ } maka datang dalam ayat ini kata dalam bentuk (fi'il) { لِيُعَذِّبَهُمْ } \"akan mengazab mereka\"; karena keberadaan Rasul pada zamannya adalah penghalang sementara bagi mereka dari azab, kemudian datang pada kata selanjutnya dalam bentuk (isim) : { مُعَذِّبَهُمْ } \"akan mengazab mereka\" dengan makna yang sama namun bentuk yang berbeda; karena istighfar mereka adalah penghalang dari azab yang selalu berlaku di setiap zaman. 5 ). Sebagaimana yang kita alami saat-saat ini bencana terus melanda negri, sesungguhny peristiwa itu adalah ketetapan Allah agar kita bertaubat memohon ampun kepada-Nya; namu sangat sedikit diantara kita yang mengambil pelajaran darinya dan menghabiskan masa untuk bertaubat dan beristighfar : { وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ }, kesempatan yang sangat berharga untuk kita tunduk memohon kepada Allah; bukankah Allah telah berfiman : { وَلَقَدْ أَرْسَلْنَا إِلَىٰ أُمَمٍ مِنْ قَبْلِكَ فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ 42 فَلَوْلَا إِذْ جَاءَهُمْ بَأْسُنَا تَضَرَّعُوا وَلَٰكِنْ قَسَتْ قُلُوبُهُمْ وَزَيَّنَ لَهُمُ الشَّيْطَانُ مَا كَانُوا يَعْمَلُونَ 43 } \"Dan sesungguhnya Kami telah mengutus (rasul-rasul) kepada umat-umat yang sebelum kamu, kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan dan kemelaratan, supaya mereka memohon (kepada Allah) dengan tunduk merendahkan diri (42) Maka mengapa mereka tidak memohon (kepada Allah) dengan tunduk merendahkan diri ketika datang siksaan Kami kepada mereka, bahkan hati mereka telah menjadi keras, dan syaitanpun menampakkan kepada mereka kebagusan apa yang selalu mereka kerjakan (43)\" [ Al-An'am ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33 Allah sekali-kali tidak akan mengazab mereka sesuai apa yang mereka minta, sedang kamu berada di antara mereka. Ini sebagai penghormatan kepadamu. Dan Allah juga tidak akan mengazab mereka di Makkah, sedang mereka masih meminta ampun sambil bertawaf dan berkata mengelilingi Ka’bah: Kami memohon ampunan-Mu. Maksudnya bahwa di sana ada orang-orang muslim yang senantiasa meminta ampun kepada Allah. Ayat ini turun ketika Abu Jahal bin Hisyam berkata: “Ya Allah jika ....” akhir ayat turun ketika orang-orang musyrik tawaf di Ka’bah dengan berkata: Kami memohon ampun, kami memohon ampun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah sekali-kali tidak akan mengazab mereka selama kamu berada di antara mereka} kamu tinggal di antara mereka {dan Allah sekali-kali tidak akan mengazab mereka selama mereka memohon ampunan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 seandainya Allah menyegerakan azabNya niscaya tiada yang tertinggal akan tetapi Allah menunda azabNya disebabkan oleh keberadaan Rasulullah diantara mereka. Dia berfirman ”dan Allah sekali kali tidak akan mengazab mereka, sedang kamu berada diantara mereka” keberadaan Rasulullah diantara mereka adalah pelindung dari azab. Dan dengan perkataan yang mereka ucapkan secara terbuka di depan khalayak, mereka menyadari keburukannya, mereka khawatir ia akan menimpa mereka, maka mereka memohon ampun kepada Allah. Oleh karena itu Dia berfirman ”dan tidaklah (pula) Allah akan mengazab mereka, sedang mereka meminta ampun” ini adalah pencegah azab dari mereka padahal sebab sebab turunnya azab itu telah tercapai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 33: Imam Bukhari meriwayatkan dari Anas bin Malik, ia berkata: Abu Jahal berkata, “Ya Allah, jika (Al Quran) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.” Maka turunlah ayat, “Wa maa kaanallahu liyu’adzdzibahum wa anta fiihim…dst sampai wa hum yashudduuna ‘anil masjidil haraam…dst.” Lihat surat Al Anfaal: 33-34. Ibnu Jarir meriwayatkan dari Ibnu Abbas, bahwa kaum musyrik melakukan thawaf di Baitullah dan berkata, “Labbaika laa syariika lah, labbaik.” (artinya: Aku penuhi panggilan-Mu, tidak ada sekutu bagi-Mu), lalu Nabi shallallahu 'alaihi wa sallam bersabda, “Sungguh, sungguh.” Kemudian mereka berkata, “Laa syariika lak illaa syariikun huwa laka tamlikuhu wa maa malak.” (artinya: Tidak ada sekutu bagi-Mu, selain sekutu yang Engkau memilikinya dan ia miliki), dan berkata, “Ghufraanak, ghufraanak” (Ampunan-Mu ya Allah, kami minta), maka Allah menurunkan ayat, “Wa maa kaanalllahu liyu’adzdzibahum wa anta fiihim wa maa kaanallahu liyu’adzdzibahum wa hum yastaghfiruun.” Ibnu Abas berkata, “Pada mereka ada dua keamanan; nabi Allah dan istighfar. Namun Nabi shallallahu 'alaihi wa sallam telah pergi dan masih ada istighfar,” (Allah berfirman), “Mengapa Allah tidak menghukum mereka padahal mereka menghalang-halangi orang untuk (mendatangi) Masjidilharam dan mereka bukanlah orang-orang yang berhak menguasainya? Orang yang berhak menguasai(nya) hanyalah orang-orang yang bertakwa.” Ibnu Abbas berkata, “Ini adalah azab akhirat.” Ia juga berkata, “Sedangkan yang tadi adalah azab dunia.” (Hadits ini hasan, disebutkan oleh Ibnu Abi Hatim juz 3 hal. 241). Bisa saja ayat di atas turun berkenaan sebab pertama atau kedua atau secara bersamaan karena kedua sebab itu, wallahu a’lam. Hal itu, karena azab apabila turun maka akan merata, dan suatu umat tidaklah diazab kecuali setelah nabinya dan kaum mukmin keluar daripadanya. Yakni dalam ucapan mereka ketika thawaf, “Ghufraanak, Ghufraanak” (artinya Ampunan-Mu yang Allah kami minta). Ada pula yang menafsirkan bahwa yang memohon ampunan itu adalah orang-orang mukmin yang tertindas. Dan ada pula yang berpendapat, bahwa setelah mereka mengucapkan kata-kata itu di hadapan banyak orang, mereka menyadari keburukannya, mereka takut kalau azab itu menimpa mereka sehingga mereka beristighfar, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 33",
    "description": "Tetapi permohonan mereka yang bersifat menantang itu, tidak segera dikabulkan oleh Allah, sebab dengan hikmah-Nya Allah sekalikali tidak akan menghukum mereka sekarang dengan siksa duniawi yang berat dan memusnahkan, selama engkau nabi Muhammad berada di antara mereka dengan harapan mereka menyambut seruanmu itu. Dan sekali-kali tidaklah pula Allah akan menghukum mereka secara mantap dan langgeng di masa yang akan datang, sedang mereka masih memohon ampunan, menyadari dan meninggalkan kekeliruan mereka. Allah bukannya tidak akan menyiksa mereka, tetapi hanya menangguhkan, karena nabi Muhammad masih berada di tengah mereka dan juga karena masih ada yang beristigfar. Pada waktunya mereka tetap akan disiksa. Dan mengapa Allah tidak menghukum mereka padahal mereka wajar untuk disiksa, antara lain karena mereka menghalang-halangi orang secara terus-menerus untuk mendatangi masjidilharam guna beribadah dan menghormatinya. Mereka berdalih bahwa mereka adalah auliya'-Nya; pembina, pemelihara dan penguasanya, padahal mereka bukanlah auliya', yakni orang-orang yang berhak menguasai, membina, dan memelihara-Nya' sesungguhnya para auliya', yakni orangorang yang berhak menguasai, membina, dan memelihara-Nya tidak lain hanyalah orang-orang yang bertakwa, yakni yang benar-benar telah mantap ketakwaan dalam jiwanya, bukan sekadar orang yang beriman, apalagi orang yang bergelimang dalam dosa. Demikian seharusnya, tetapi kebanyakan mereka, yakni kaum musyrik, tidak mengetahui siapa yang seharusnya membina dan memelihara masjid, sehingga menguasai sesuatu yang semestinya menjadi hak orang lain. Mereka pun tidak mau memahami agama dan mengerti kedudukan masjid itu di sisi Allah."
  }
]