[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagaimana mereka tidak berhak ditimpa siksaan Allah, sedang mereka itu menghalang-halangi para kekasihNya yang beriman dari bertawaf di ka’bah dan mengerjakan shalat di masjidil haram? dan mereka bukanlah kekasih-kekasih Allah, karena sesungguhnya wali-wali Allah itu adalah orang-orang yang bertakwa kepadaNya dengan menjalanakan kewajiban-kewajiban dariNya dan menjauhi perbuatan maksiat-maksiat kepadaNya. Akan tetapi, kebanyakan orang kafir tidak mengetahui. Mala oleh karena itu mereka mengaku-aku bahwa dirinya bergelar sesuatu, padahal orang lain lebih berhak berpredikat demikian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Apa yang bisa menghalangi mereka dari azab Allah, sedangkan mereka telah melakukan perbuatan yang membuat mereka layak ditimpa azab, yaitu mereka menghalangi-halangi manusia dari Masjidilharam untuk melaksanakan tawaf atau menunaikan salat di sana? Orang-orang musyrik bukanlah kekasih-kekasih Allah. Karena kekasih-kekasih Allah tidak lain adalah orang-orang bertakwa yang takut kepada-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Tetapi sebagian besar orang-orang musyrik tidak sadar ketika mereka mengaku bahwa mereka adalah kekasih-kekasih Allah, padahal sebetulnya mereka bukanlah kekasih-kekasih Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Kemudian Allah menjelaskan kejahatan lain yang dilakukan orang-orang musyrik sehingga menjadikan mereka berhak mendapat azab-Nya; dan menjelaskan bahwa tidak ada sesuatu yang dapat mencegah azab Allah sedangkan mereka telah berbuat hal yang mengundang azab tersebut, yaitu menghalangi orang-orang dari Masjidil Haram dan menghalangi darinya orang-orang yang lebih mulia dari mereka. Orang-orang musyrik tidak pernah menjadi para penolong Allah sehingga mereka bukanlah para penolong dan penguasa Baitullah, namun mereka adalah para penolong kepentingan pribadi dan syahwat mereka sendiri. Adapun para penolong Allah adalah orang-orang bertaqwa yang menjauhkan diri dari kekafiran, kesyirikan, dan segala sesuatu yang mengundang kemurkaan Allah; akan tetapi mayoritas orang musyrik tidak mengetahui hal itu, akibat kebodohan dan kebebalan mereka dalam keingkaran dan kesesatan. Kalimat (إن أولياؤه إلا المتقون) diungkapkan dengan penegasan yang paling kuat, untuk menafikan segala penguasaan atas Baitul Haram kecuali penguasaan orang-orang bertakwa. Dan pada kalimat ini terdapat kabar gembira bahwa orang-orang musyrik akan lenyap dari kota Makkah dan diganti Allah dengan orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَمَا لَهُمْ أَلَّا يُعَذِّبَهُمُ اللهُ (Kenapa Allah tidak mengazab mereka) Yakni mereka berhak mendapatkan azab Allah kerena mereka melakukan berbagai perbuatan buruk. وَهُمْ يَصُدُّونَ (padahal mereka menghalangi) Yakni menghalangi orang-orang. عَنِ الْمَسْجِدِ الْحَرَامِ (untuk (mendatangi) Masjidilharam) Menghalangi darinya orang-orang yang beriman kepada Allah dan mengikuti Rasulullah sehingga tidak dapat menjalankan manasik haji. وَمَا كَانُوٓا۟ أَوْلِيَآءَهُۥٓ ۚ (dan mereka bukanlah orang-orang yang berhak menguasainya) Ini merupakan bantahan atas pengakuan mereka bahwa mereka adalah orang-orang yang menguasai Baitul Haram. إِنْ أَوْلِيَآؤُهُۥٓ إِلَّا الْمُتَّقُونَ(Orang-orang yang berhak menguasai(nya) hanyalah orang-orang yang bertakwa) Yakni para penguasanya adalah orang-orang yang menjauhi kesyirikan dan kemaksiatan karena Baitul Haram adalah milik Allah maka tidak ada kekuasaan atasnya bagi para penyembah berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34 Kenapa Allah tidak mengazab mereka dengan azab yang berkepanjangan atau kebinasaan secara umum, dengan membunuh sebagian mereka atau keluarga mereka, padahal mereka telah melakukan keburukan. Mereka telah menghalangi orang untuk mendatangi Masjidil haram dan melaksanakan ibadah Haji. Mereka bukanlah orang-orang yang berhak menguasai wilayah tanah haram bahkan ditambah mereka telah memusuhi rasul. Orang-orang yang berhak menguasainya hanyalah orang-orang yang beriman dan bertakwa. tetapi kebanyakan orang musyrik tidak mengetahui selain wilayah yang mereka anggap milik mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa Allah tidak mengazab mereka} apa yang mencegah azab Allah atas mereka {sedangkan mereka menghalang-halangi} menghalangi nabi Muhammad SAW dan orang-orang muslim {untuk ke Masjidil haram. Mereka bukanlah orang-orang yang mengurusnya} orang-orang musyrik itu bukanlah wakil Allah {Orang yang berhak menjadi pengurusnya hanyalah orang-orang yang bertakwa, tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 kemudian Allah berfirman “kenapa Allah tidak mengazab mereka” yakni apa yang menghalangi mereka dari azab Allah padahal mereka telah melakukan sebab sebabnya? yaitu menghalang halangi manusia dari masjidil haram lebih lebih mereka menghalangi Nabi dan para sahabat yang sebenarnya lebih layak dengannya daripada mereka. oleh karena itu Dia berfirman ”dan mereka bukanlah” yakni orang orang musyrik itu “orang orang yang berhak menguasainya” ada kemungkinan dhamir (kata ganti) kembali kepada Allah yakni wali wali Allah, ada kemungkinan ia kembali ke masjidil haram, yakni mereka tidak lebih berhak terhadapnya daripada orang lain. ”orang orang yang berhak menguasainya, hanyalah orang orang yang bertakwa” yaitu orang orang yang beriman kepada Allah dan RasulNya, mengesakanNya dengan tauhid dan ibadah dan mengikhlaskan agama hanya untukNya. ”tetapi kebanyakan mereka tidak mengetahui” oleh karena itu mereka mengklaim perkara padahal orang lain lebih berhak terhadap perkara tersebut daripada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 34: Dan Allah telah melakukannya dengan mengazab mereka di Badar dan lainnya. Yaitu Nabi shallallahu 'alaihi wa sallam dan para sahabatnya. Untuk melakukan thawaf. Seperti yang mereka sangka. Kata-kata “wa maa kaanuu awliyaa’ah”, dhamir (kata ganti) hu (dia) bisa kembalinya kepada Allah, sehingga artinya bahwa “mereka bukanlah wali-wali-Nya,” dan bisa juga kembali kepada Masjidilharam, sehingga artinya, bahwa “mereka bukanlah orang-orang yang berhak menguasainya.” Oleh karena ketidaktahuan mereka, akhirnya mereka mengaku berhak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 34",
    "description": "Allah bukannya tidak akan menyiksa mereka, tetapi hanya menangguhkan, karena nabi Muhammad masih berada di tengah mereka dan juga karena masih ada yang beristigfar. Pada waktunya mereka tetap akan disiksa. Dan mengapa Allah tidak menghukum mereka padahal mereka wajar untuk disiksa, antara lain karena mereka menghalang-halangi orang secara terus-menerus untuk mendatangi masjidilharam guna beribadah dan menghormatinya. Mereka berdalih bahwa mereka adalah auliya'-Nya; pembina, pemelihara dan penguasanya, padahal mereka bukanlah auliya', yakni orang-orang yang berhak menguasai, membina, dan memelihara-Nya' sesungguhnya para auliya', yakni orangorang yang berhak menguasai, membina, dan memelihara-Nya tidak lain hanyalah orang-orang yang bertakwa, yakni yang benar-benar telah mantap ketakwaan dalam jiwanya, bukan sekadar orang yang beriman, apalagi orang yang bergelimang dalam dosa. Demikian seharusnya, tetapi kebanyakan mereka, yakni kaum musyrik, tidak mengetahui siapa yang seharusnya membina dan memelihara masjid, sehingga menguasai sesuatu yang semestinya menjadi hak orang lain. Mereka pun tidak mau memahami agama dan mengerti kedudukan masjid itu di sisi Allah. Salah satu bukti ketidaklayakan mereka mengelola masjidilharam adalah seperti diuraikan pada ayat ini. Dan apa yang mereka anggap sebagai salat mereka yang seharusnya dilakukan dengan dengan penuh khusyuk, ketulusan, dan penghormatan kepada Allah, apalagi itu dilakukan di sekitar baitullah itu, tidak lain hanyalah siulan dan tepuk tangan. Maka kelak ketika azab telah jatuh, dikatakan kepada mereka, rasakanlah azab disebabkan sejak dahulu hingga kini kamu terus-menerus melakukan kekufuran. Terimalah kematian kamu di medan perang, agar kesyirikan itu menjauh dari masjidilharam, dan kematian itu tidak lain akibat kekufuran kamu."
  }
]