[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari keesaan Allah dan mendurhakai rasulNya, mereka menginfakkan harta benda mereka memberikannya kepada orang-orang yang sepaham dengan mereka dari kalangan kaum musyrikin dan para pengikut kesesatan, untuk menghalang-halangi (manusia) dari jalan Allah dan mencegah kaum muminin dari beriman kepada Allah dan rasulNya. Mereka itu akan menginfakan harta mereka dalam usaha tersebut, kemudian akibat dari sumbangan mereka itu adalah penyesalan dan kerugian bagi mereka. Sebab sesungguhnya harta benda mereka itu akan lenyap, dan mereka tidak akan dapat menggapai apa yang mereka impi-impikan, yaitu untuk memadamkan cahaya Allah dan menghalangi (manusia) dari jalanNya, kemudian pada akhirnya kaum mukminin akan mengalahkan mereka.Dan orang-orang yang kafir akan dikumpulkan ke neraka jahanam lalu disiksa didalamnnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sesungguhnya orang-orang yang kafir kepada Allah akan membelanjakan hartanya untuk menghalang-halangi manusia dari agama Allah. Mereka terus mengeluarkan harta mereka tetapi apa yang mereka inginkan tidak akan terwujud. Kemudian kegemaran mereka membelanjakan harta (untuk tujuan yang jahat) itu akan berakhir dengan penyesalan. Karena mereka telah kehilangan harta mereka tetapi tidak berhasil mencapai cita-cita mereka dan mereka akan dikalahkan oleh orang-orang mukmin. Dan orang-orang yang ingkar kepada Allah akan digiring ke dalam neraka Jahanam kelak di hari Kiamat. Lalu mereka akan memasukinya untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan Allah menyebutkan bentuk lain dari kesesatan dan permusuhan dan tipu daya yang dilakukan orang-orang musyrik terhadap Allah dan Rasul-Nya, serta usaha mereka dalam memadamkan cahaya-Nya. Mereka menginfakkan harta mereka demi melenyapkan kebenaran dan menolong kebatilan, agar dapat menyesatkan manusia dari jalan Allah. Kemudian Allah menjelaskan kerugian dan kekalahan yang akan mereka dapatkan di dunia. Mereka menginfakkan harta mereka demi keburukan dan permusuhan; namun hal itu akan menjadi penyesalan, dan kehinaan bagi mereka. Mereka akan kalah, dan harta mereka akan lenyap bersama harapan mereka, kemudian mereka akan diazab di akhirat dengan azab yang sangat keras. Mereka akan dikumpulkan di neraka Jahannam untuk merasakan azabnya yang kekal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. إِنَّ الَّذِينَ كَفَرُوا۟ يُنفِقُونَ أَمْوٰلَهُمْ (esungguhnya orang-orang yang kafir menafkahkan harta mereka) Untuk menghalangi jalan kebenaran dengan memerangi Rasulullah dan mengumpulkan bala tentara dan mengeluarkan harta kalian untuk membiayai perang tersebut. فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ (Mereka akan menafkahkan harta itu) Yakni hasil dari harta yang mereka keluarkan adalah penyesalan karena mereka mengeluarkan harta tersebut tanpa mendapat manfaat sedikitpun, bahkan malah mendatangkan musibah kepada mereka. ثُمَّ يُغْلَبُونَ ۗ (dan mereka akan dikalahkan) Sebagaimana yang dijanjikan oleh Allah, seperti dalam firman-Nya: كتب الله لأغلبن أنا ورسلي “Allah telah menetapkan: \"Aku dan rasul-rasul-Ku pasti menang\".” Dan Allah benar-benar melakukannya. Dan berita yang disampaikan oleh ayat ini termasuk mukjizat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36 Sesungguhnya orang-orang yang kafir dan musyrik itu menafkahkan harta mereka untuk menghalangi orang untuk masuk Islam. Mereka akan menafkahkan harta itu, kemudian menjadi sebuah sesalan dan siksa bagi mereka sendiri, dan mereka akan dikalahkan di dunia. Mereka yang mati dalam keadaan kafir adalah orang-orang yang akan diseret ke dalam Jahannam untuk pembalasan amal mereka. Ayat ini turun ketika kafir Qurays mulai mengumpulkan harta untuk memerangi Nabi dan merencankan tipu daya kepada Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang kafir menginfakkan harta mereka untuk menghalang-halangi} untuk merintangu {dari jalan Allah} agama Allah {Mereka akan menginfakkan harta itu, kemudian itu menjadi penyesalan bagi mereka} penyesalan {Kemudian mereka akan dikalahkan. Orang-orang kafir itu di neraka Jahanam akan dikumpulkan} digiring"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36 Allah berfirman dalam rangka menjelaskan permusuhan orang orang kafir, tipu daya dan makar mereka, serta perlawanan mereka kepada Allah dan RasulNya, dan usaha mereka untuk memadamkan cahaya dan kalimatNya, dan bahwa akibat makar mereka akan kembali kepada diri mereka sendiri, dan makar yang buruk tidak akan menimpa kecuali pelakunya. Dia berfirman ”sesungguhnya orang orang yang kafir itu menafkahkan harta untuk menghalangi orang dari jalan Allah” yakni untuk membatalkan kebenaran dan menyokong kebatilan membatalkan tauhid dan menegakan penyembahan kepada berhala, “mereka akan menafkahkan harta itu” mereka mengeluarkan nafkah ini dengan ringan karena keteguhan mereka memegang kebatilan dan kebencian mereka yang mendalam terhadap kebenaran, akan tetapi ia akan menjadi “sesalan bagi mereka” kehinaan dan kerendahan “dan mereka akan dikalahkan” lalu harta dan angan angan mereka lenyap sedangkan di akhirat diazab yang keras. Oleh karena itu Dia berfirman “dan ke dalam neraka jahanamlah orang orang yang kafir itu dikumpulkan” di dalamnya mereka dikumpulkan untuk merasakan azab neraka, karena ia adalah tempat keburukan dan orang orang yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 36: Allah Subhaanahu wa Ta'aala menerangkan permusuhan yang dilakukan orang-orang musyrik dan makar yang mereka buat serta penentangan mereka kepada Allah dan Rasul-Nya, dan bahwa mereka berusaha memadamkan cahaya Allah dan kalimat-Nya, dan bahwa akibat dari makar mereka berpulang kepada mereka, lagi pula makar yang buruk tidaklah menimpa kecuali kepada pembuatnya. Untuk membatalkan yang hak dan membela yang batil, membatalkan tauhid dan menegakkan syirk, Seperti yang mereka lakukan ketika memerangi Nabi shallallahu 'alaihi wa sallam. Mereka rela mengorbankan harta dalam jumlah besar karena kebencian mereka terhadap kebenaran, akan tetapi hal itu akan menjadi penyesalan bagi mereka, dan mereka akan dikalahkan sehingga harta dan apa yang mereka harapkan sia-sia, sedangkan di akhirat mereka akan diazab dengan keras. Di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 36",
    "description": "Demikianlah, perbuatan buruk mereka akan sia-sia dan berbuah azab. Demikian pula harta mereka akan sia-sia seperti dijelaskan pada ayat ini. Sesungguhnya orang-orang yang kafir itu, yang mengingkari ayatayat dan menyekutukan Allah, bertekad untuk terus-menerus menginfakkan harta mereka dengan tujuan untuk menghalang-halangi orang lain dari jalan Allah. Mereka akan terus menginfakkan harta itu, kemudian setelah beberapa lama apa yang mereka lakukan itu menjadi sebab penyesalan bagi mereka, penyesalan yang sangat besar karena mereka hilang dan tujuan mereka tidak tercapai, dan akhirnya mereka akan dikalahkan. Harta itu akan musnah dan sia-sia, sebab mereka tidak akan mampu menghalangi orang dari jalan Allah, dan semua itu hanya akan melahirkan penyesalan dan rasa sakit. Mereka akan dikalahkan dalam perang dan kelak ke dalam neraka jahanamlah orang-orang kafir itu, yang tetap atau bertambah kekufurannya, akan dikumpulkan, selama mereka masih mempertahankan kekufuranAllah mengalahkan mereka yang membelanjakan harta untuk menghalang-halangi orang dari jalan Allah dan mengumpulkan mereka di neraka jahannam agar dengan itu Allah memisahkangolongan manusia yang buruk, yang jiwa, tingkah laku, dan ucapannya kotor, dari yang baik, yang hati dan budinya luhur dan ucapan serta tingkah lakunya terpuji. Dan juga agar Allah menjadikan golongan yang buruk itu sebagiannya di atas sebagian yang lain, lalu demikian sempit tempat mereka dikumpulkan itu dan demikian menyatu, sehingga kesemuanya ditumpukkan-Nya satu di atas yang lain bagaikan barang-barang yang tidak berharga, dan dimasukkan-Nya semua tumpukan itu ke dalam neraka jahanam. Mereka itulah orang-orang yang rugi di dunia dan akhirat."
  }
]