[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah akan mengumpulkan dan menghinakan orang-orang yang kafir kepada tuhan mereka dan menginfakan harta benda mereka untuk menghambat manusia dari keimanan kepada Allah dan menghadang jalanNya, agar Allah memisahkan (golongan) mana yang buruk dan (golongan) mana yang baik, dan kemudian Allah menjadikan harta yang haram yang diinfakan untuk menghambat (manusia) dari jalan Allah sebagian berada di atas sebagian yang lain dengan bertumpuk-tumpuk lagi bersusun-susun, lalu Dia menjadikannya di neraka jahanam. Orang-orang kafir itulah orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Orang-orang kafir yang gemar membelanjakan harta mereka untuk menghalang-halangi manusia dari jalan Allah itu akan digiring ke dalam neraka Jahanam untuk memisahkan antara golongan kafir yang jahat dan golongan mukmin yang baik. Dan Allah hendak menjadikan orang-orang yang jahat, amal perbuatan, dan harta benda mereka tumpang-tindih di dalam Neraka Jahanam. Mereka itulah orang-orang yang merugi. Karena mereka merugikan diri mereka sendiri dan keluarga mereka di hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Lalu Allah menjelaskan bahwa Dia menghinakan orang-orang kafir di dunia dan mengumpulkan mereka di neraka Jahannam pada hari kiamat, agar terbedakan antara golongan yang buruk -yaitu golongan orang-orang kafir- dan golongan yang baik -yaitu golongan orang-orang beriman-. Dan ketika mereka telah terbedakan, Allah mengumpulkan mereka untuk dilemparkan ke dalam neraka Jahannam sebagai balasan kekafiran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. لِيَمِيزَ اللهُ (supaya Allah memisahkan) Yakni memisahkan golongan yang buruk yang merupakan orang-orang kafir dari golongan yang baik, yaitu orang-orang beriman. وَيَجْعَلَ الْخَبِيثَ بَعْضَهُۥ عَلَىٰ بَعْضٍ فَيَرْكُمَهُۥ جَمِيعًا (dan menjadikan (golongan) yang buruk itu sebagiannya di atas sebagian yang lain, lalu kesemuanya ditumpukkan-Nya) Allah mengumpulkan sebagian mereka dengan sebagian lainnya sehingga mereka saling bertumpukkan, karena telah penuh sesak dalam neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37 Allah melakukan itu semua supaya golongan yang buruk/kafir bisa dipisahkan dengan golongan yang baik / mukmin. Serta menjadikan sebagian golongan yang buruk/kafir itu di atas sebagian yang lain, lalu kesemuanya ditumpukkan di dalam Jahannam. Mereka itulah orang-orang yang merugi di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Allah memisahkan} memisahkan {yang buruk} orang kafir {dari yang baik} orang mukmin {dan menjadikan yang buruk itu sebagiannya di atas} di atas {sebagian yang lain, lalu Dia menumpuk semuanya} mengumpulkan semuanya {Kemudian Dia menjadikannya di dalam neraka Jahanam. Mereka itulah orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37 Allah ingin membedakan antara yang buruk dengan yang baik dan masing masing dari keduanya di letakkan ditempat yang khusus, dia menjadikan yang buruk dari perbuatan, harta dan pelaku kebaikan sebagiannya di atas sebagian yang lain “lalu semuanya ditumpukkanNya, dan dimasukkanNya ke dalam neraka jahanam, mereka itulah orang orang yang merugi” orang orang yang rugi diri dan keluarga mereka pada hari kiamat, itulah kerugian yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 37: Yaitu orang-orang kafir. Yaitu orang-orang mukmin. Baik berupa amal yang buruk, harta maupun jiwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 37",
    "description": "Allah mengalahkan mereka yang membelanjakan harta untuk menghalang-halangi orang dari jalan Allah dan mengumpulkan mereka di neraka jahannam agar dengan itu Allah memisahkangolongan manusia yang buruk, yang jiwa, tingkah laku, dan ucapannya kotor, dari yang baik, yang hati dan budinya luhur dan ucapan serta tingkah lakunya terpuji. Dan juga agar Allah menjadikan golongan yang buruk itu sebagiannya di atas sebagian yang lain, lalu demikian sempit tempat mereka dikumpulkan itu dan demikian menyatu, sehingga kesemuanya ditumpukkan-Nya satu di atas yang lain bagaikan barang-barang yang tidak berharga, dan dimasukkan-Nya semua tumpukan itu ke dalam neraka jahanam. Mereka itulah orang-orang yang rugi di dunia dan akhirat. Meskipun ucapan tuhan itu bernada keras dan berisi ancaman, akan tetapi pintu tobat masih tetap terbuka lebar. Maka katakanlah wahai nabi Muhammad kepada orang-orang yang kafir itu, yakni abu sufyan dan kawan-kawannya, serta siapa pun yang tidak percaya keesaan Allah dan berusaha memadamkan cahaya ajaran-Nya, jika mereka berhenti dari kekafirannya dan memeluk islam serta tidak memerangi nabi Muhammad dan para pengikutnya, niscaya Allah akan mengampuni dosa-dosa mereka yang telah lalu; dan jika mereka kembali lagi melakukan dosa serupa dan memerangi nabi, maka Allah akan menjatuhkan sanksi atas mereka, karena sungguh, berlaku kepada mereka sunnah, yakni ketetapan Allah, terhadap orang-orang dahulu yang disegerakan jatuhnya sanksi sehingga binasa. Allah akan memenangkan kebenaran atas kebatilan, selama orang-orang yang berpihak pada kebenaran itu tetap tunduk kepada-Nya dan mengikuti ketentuan-ketentuan untuk menang."
  }
]