[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang yang mengingkari keesaan Allah dari kalangan kaum musyrikin dari kaummu bahwa bila mereka berhenti dari kekafiran dan permusuhannya kepada nabi dan kembali menuju keimanan kepada Allah semata dan tidak memerangi rasul dan kaum Mukminin, niscaya Allah akan mengampuni bagi mereka dosa-dosa mereka yang dahulu, sebab islam menutup apa (dosa) yang terjadi sebelumnya. Dan apabila kaum musyrikin itu kembali memerangimu (wahai rasul), setelah kekalahan yang kamu timpakan pada mereka pada hari perang badar, maka sungguh telah berlaku jalan (buruk) orang-orang dahulu. Yaitu bila, mereka mundustakan dan terus bertahan dengan penentangan mereka, maka kami akan menyegerakan pada mereka siksaan dan hukuman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Katakanlah -wahai Rasul- kepada orang-orang yang kafir kepada Allah dan rasul-Nya di antara kaummu, jika mereka berhenti dari kekafiran mereka kepada Allah dan rasul-Nya dan berhenti menghalang-halangi orang-orang mukmin dari jalan Allah, niscaya Allah akan mengampuni dosa-dosa mereka yang sudah lalu. Karena Islam menghapus dosa-dosa yang terjadi sebelumnya. Dan jika mereka kembali kepada kekafiran mereka, maka sunatullah telah berlaku bagi orang-orang terdahulu. Yaitu apabila mereka mendustakan (utusan Allah) dan mempertahankan kekafiran mereka, maka Allah menyegerakan hukuman mereka (di dunia)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Setelah menyampaikan ancaman bagi orang-orang kafir, kemudian Allah mengalihkan firman-Nya kepada Rasulullah mengenai orang-orang yang kafir terhadap kebenaran dari kalangan penduduk Makkah dan lainnya: “Jika mereka berhenti dari kekafiran dan permusuhan mereka terhadap orang-orang beriman, lalu beriman kepada Allah semata, niscaya Allah akan mengampuni kekafiran dan kemaksiatan yang dahulu mereka lakukan. Namun jika mereka kembali memerangi kalian, dan tetap dalam kekafiran dan kesesatan mereka, maka Kami akan menyiksa mereka dan menolong orang-orang beriman dari mereka. Telah berlaku ketetapan Allah bagi orang-orang yang memerangi para Nabi, bahwa Allah akan memenangkan orang-orang beriman dan menghancurkan orang-orang yang memerangi tersebut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. قُل لِّلَّذِينَ كَفَرُوٓا۟ إِن يَنتَهُوا۟ (Katakanlah kepada orang-orang yang kafir itu: “Jika mereka berhenti) Yakni berhenti dari memusuhi dan memerangi Rasulullah dengan masuk ke dalam agama Islam. يُغْفَرْ لَهُم مَّا قَدْ سَلَفَ(niscaya Allah akan mengampuni mereka tentang dosa-dosa mereka yang sudah lalu) Yakni dosa memusuhi Rasulullah tersebut. Karena dengan masuk ke dalam Agama Islam maka itu menjadi penghapus dosa yang dilakukan sebelum masuk Islam. وَإِن يَعُودُوا۟ (dan jika mereka kembali lagi) Kembali kepada memerangi dan memusuhi Rasulullah serta kepada kekafiran. فَقَدْ مَضَتْ سُنَّتُ الْأَوَّلِينَ (sesungguhnya akan berlaku (kepada mereka) sunnah (Allah tenhadap) orang-orang dahulu) Yakni telah berlaku sunnatullah atas orang-orang terdahulu yang berbuat seperti perbuatan mereka yaitu dengan menimpa mereka dengan azab. Maka hendaklah mereka membayangkan seandainya itu terjadi terhadap mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ } \"Katakanlah kepada orang-orang yang kafir itu: \"Jika mereka berhenti (dari kekafirannya), niscaya Allah akan mengampuni mereka tentang dosa-dosa mereka yang sudah lalu\", inilah kelembutan; karena bahwasanya orang-orang kafir telah menerobos aturan untuk masuk ke dalam kekufuran dan kejahatan, dan kemaksiatan dan dosa-dosa. maka jika perbuatan mereka itu membawa kepada siksaan dan azab niscaya mereka tidak akan berjumpa dengan taubat selamanya, dan tidak pula bagi mereka ampunan; oleh karena itu Allah memberikan kemudahan bagi mereka tatkala mereka kembali kepada Allah, dan berusaha menggapai ampunan dalam islam, dan memusnahkan segala perbuatan yang telah lalu kejadiannya; agar mereka lebih dekat kepada agama ini, dan lebih mudah dalam menerima kalimat tauhid. 2 ). Allah memberikan satu syarat bagi orang kafir agar taubat mereka diterima : { قُلْ لِلَّذِينَ كَفَرُوا إِنْ يَنْتَهُوا يُغْفَرْ لَهُمْ مَا قَدْ سَلَفَ } \"Katakanlah kepada orang-orang yang kafir itu: \"Jika mereka berhenti (dari kekafirannya), niscaya Allah akan mengampuni mereka tentang dosa-dosa mereka yang sudah lalu\", dan bagi orang munafiq empat syarat : { إِلَّا الَّذِينَ تَابُوا وَأَصْلَحُوا وَاعْتَصَمُوا بِاللَّهِ وَأَخْلَصُوا دِينَهُمْ لِلَّهِ فَأُولَٰئِكَ مَعَ الْمُؤْمِنِينَ } \"Kecuali orang-orang yang taubat dan mengadakan perbaikan dan berpegang teguh pada (agama) Allah dan tulus ikhlas (mengerjakan) agama mereka karena Allah. Maka mereka itu adalah bersama-sama orang yang beriman\" [ An-Nisa : 146 ], hal ini menunjukkan bahwasanya kemunafiqan adalah perkara besar dan lebih berbahaya, dan taubat darinya lebih berat!."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Katakanlah kepada orang-orang yang kafir Makkah itu wahai Nabi: “Jika mereka berhenti dari kekafirannya, dengan berhenti memusuhi dan memerangi orang mukmin dengan masuk Islam, niscaya Allah akan mengampuni dosa-dosa mereka yang sudah lalu berupa memusuhi orang mukmin, kafir dan maksiat dalam suka cita Islam. Namun jika mereka kembali lagi untuk memusuhi orang mukmin, maka sesungguhnya akan berlaku keputusan Allah kepada mereka azab terhadap orang-orang dahulu berupa pembinasaan, sehingga hal itu akan terjadi kepada mereka”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada orang-orang kafir itu, jika mereka berhenti} meninggalkan kekufuran dan memerangi nabi Muhammad SAW {niscaya akan diampuni dosa-dosa mereka yang telah lalu} dosa-dosa mereka yang telah lalu {Jika mereka kembali lagi} kembali kepada apa yang telah mereka lakukan {sungguh telah berlaku} telah berlaku dahulu {sunah orang-orang terdahulu.”} sunnatullah bagi umat-umat terdahulu dengan menolong para nabiNya dan membinasakan musuh-musuhNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38 Ini termasuk kasih sayang Allah kepada hamba hambaNYa, Kekufuran mereka dan keberadaan mereka dalam penentangan secara terus menerus tidak menghalangiNya untuk mengajak mereka ke jalan petunjuk yang lurus dan mencegah mereka dari segala perkara yang menjadi penyebab kesesaatan dan kebinasaan. Dia berfirman ”katakanlah kepada orang orang kafir itu, jika mereka berhenti (dari kekafirannya)” hal itu dengan masuk ke dalam islam hanya karena Allah semata tanpa sekutu bagiNya, ”niscaya Allah akan mengampuni mereka tentang dosa dosa mereka mereka yang sudah lalu” dari kejahatan kejahatan mereka. ”dan jika mereka kembali” kepada kekufuran dan penentangan ”sesungguhnya akan berlaku (kepada mereka) sunnah (Allah terhadap) orang orang dahulu” dengan dibinasakannya umat umat yang mendustakan. Maka hendaknya mereka melihat apa yang menimpa orang orang yang menentang. Akan hadir kepada mereka berita berita yang sebelumnya mereka perolok olokan. Ini adalah firmanNya kepada orang orang yang mendustakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 38: Seperti Abu Sufyan dan kawan-kawannya. Ayat ini termasuk bukti kelembutan Allah Ta’ala kepada hamba-hamba-Nya, di mana kekafiran mereka dan terus-menerusnya mereka di atas kekafiran tidaklah menghalangi-Nya untuk tetap mengajak mereka menempuh jalan yang lurus dan petunjuk, dan melarang mereka dari sesuatu yang membinasakan mereka berupa sebab-sebab kesesatan dan kebinasaan. Maksudnya jika mereka kafir dan kembali memerangi Nabi. Dan mereka tinggal menunggu saja. Khithab (pembicaraan) ini ditujukan kepada mereka yang mendustakan, adapun ayat selanjutnya, maka ditujukan kepada kaum mukmin dalam menyikapi orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 38",
    "description": "Meskipun ucapan tuhan itu bernada keras dan berisi ancaman, akan tetapi pintu tobat masih tetap terbuka lebar. Maka katakanlah wahai nabi Muhammad kepada orang-orang yang kafir itu, yakni abu sufyan dan kawan-kawannya, serta siapa pun yang tidak percaya keesaan Allah dan berusaha memadamkan cahaya ajaran-Nya, jika mereka berhenti dari kekafirannya dan memeluk islam serta tidak memerangi nabi Muhammad dan para pengikutnya, niscaya Allah akan mengampuni dosa-dosa mereka yang telah lalu; dan jika mereka kembali lagi melakukan dosa serupa dan memerangi nabi, maka Allah akan menjatuhkan sanksi atas mereka, karena sungguh, berlaku kepada mereka sunnah, yakni ketetapan Allah, terhadap orang-orang dahulu yang disegerakan jatuhnya sanksi sehingga binasa. Allah akan memenangkan kebenaran atas kebatilan, selama orang-orang yang berpihak pada kebenaran itu tetap tunduk kepada-Nya dan mengikuti ketentuan-ketentuan untuk menang. Ayat yang lalu mengancam jatuhnya siksa bagi yang melanjutkan pembangkangan. Salah satu cara Allah menyiksa adalah melalui kaum muslim, karena itu ayat ini memerintahkan kaum muslim bahwa jika mereka terus membangkang dan berusaha menghalangi kebebasan, maka bertindaklah dan perangilah terus mereka itu sampai tidak ada lagi fitnah, yakni kekacauan, penganiayaan terhadap kaum mukmin dan atau syirik, dan supaya agama atau ketaatan seluruhnya hanya bagi Allah semata. Jika mereka berhenti dari penganiayaan dan atau kemusyrikan serta berpihak pada kebenaran, maka sesungguhnya Allah maha melihat apa yang mereka kerjakan sekecil dan tersembunyi apa pun, lahir dan batin, sehingga memperlakukan mereka seimbang dengan sikap dan kelakuan mereka."
  }
]