[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka yang mengerjakan amal-amal tersebut, itulah orang-orang Mukmin sejati, secara lahir dan batin terhadap wahyu yang Allah turunkan kepada mereka. Bagi mereka tempat-tempat tinggal yang tinggi d sisi Allah, dan ampunan terhadap dosa-dosa mereka, serta rizki yang mulia, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Orang-orang semacam itulah yang disebut orang-orang mukmin sejati. Karena mereka dapat memadukan antara perilaku iman (yang batin) dan ajaran Islam yang lahiriah. Dan balasan bagi mereka ialah tempat yang tinggi di sisi Rabb mereka, pengampunan atas dosa-dosa mereka, dan rezeki yang mulia. Itulah kenikmatan yang Allah siapkan untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Kemudian Allah memuji orang-orang yang memiliki sifat-sifat tersebut bahwa mereka adalah orang-orang yang benar-benar beriman, sehingga mereka akan mendapatkan derajat yang tinggi di sisi Tuhan mereka. Dan ini merupakan kemuliaan tersendiri bagi mereka dan penyampaian bahwa apa yang Allah janjikan kepada mereka pasti akan terjadi. Dan orang-orang beriman itu akan mendapat ampunan yang sempurna atas dosa-dosa yang telah mereka lakukan, serta rezeki yang paling agung dan paling utama berupa surga, mereka akan hidup di dalamnya dengan kehidupan yang bahagia tanpa terdengar perkataan yang batil di dalamnya atau yang mengandung dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. أُو۟لٰٓئِكَ (merekalah) Yakni orang-orang yang memiliki sifat-sifat yang disebutkan tadi. هُمُ الْمُؤْمِنُونَ حَقًّا ۚ( yang beriman dengan sebenar-benarnya) Memiliki keimanan yang sempurna, yang telah sampai pada derajat keimanan yang paling tinggi. لَّهُمْ دَرَجٰتٌ(Mereka akan memperoleh beberapa derajat ketinggian) Yakni derajat-derajat kebaikan dan kemuliaan surga yang sebagiannya lebih tinggi dari yang lain sesuai dengan keimanan dan amal shalih penghuninya. Dan sifat derajat tersebut di sisi Allah yakni sebagai penambahan atas kemuliaan mereka. وَمَغْفِرَةٌ (dan ampunan) Atas dosa-dosa mereka. وَرِزْقٌ كَرِيمٌ(serta rezeki (nikmat) yang mulia) Dari keluasan karunia-Nya dan banyaknya kemurahan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Itulah orang-orang yang beriman dengan sebenar-benarnya tanpa keraguan. Mereka akan memperoleh beberapa derajat ketinggian di sisi Tuhannya di surga dan ampunan serta rezeki nikmat yang mulia di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang benar-benar beriman. Bagi mereka derajat} tempat {di sisi Tuhan mereka dan ampunan serta rezeki yang mulia} baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4 “mereka itulah” yang memiliki sifat sifat diatas adalah “orang-orang yang beriman dengan sebenar benarnya” karena mereka menggabungkan antara islam dengan iman, antara amal lahir dan amal batin, antara ilmu dengan amal, dan antara hak Allah dengan hak hamba hambaNya. Allah mendahulukan amalan hati karena ia adalah dasar bagi amalan anggota tubuh sekaligus ia lebih utama darinya. dan di dalam ayat ini terkandung dalil bahwa iman itu bertambah dan berkurang, ia bertambah dengan ketaatan dan bekurang dengan sebaliknya. bahwa seorang hamba harus menjaga dan memupuk imannya, dan bahwa perkara yang pertama menghasilkan itu adalah mentadaburi dan merenungkan makna kitabullah. Kemudian Allah menyebutkan pahala orang oang yang beriman, dengan sebenar benarnya, Dia berfirman ”mereka akan memperoleh beberapa derajat ketinggian di sisi Rabb mereka” yakni derajat yang tinggi sesuai dengan ketinggian amal mereka. ”dan ampunan” bagi dosa dosa mereka ”serta rizki yang nikmat dan mulia” yaitu apa yang Allah sediakan untuk mereka di surge dari apa yang belum pernah terlihat oleh mata, belum pernah terdengar oleh telinga, dan belum pernah terlintas di benak manusia. ini menunjukan bahwa barangsiapa yang tidak sampai pada derajat mereka dalam keimanan, maka walaupun dia masuk surge namun dia tidak dapat dari kemuliaan dari Allah yang sempurna seperti apa yang mereka dapatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 4: Karena mereka menggabung antara Islam dengan iman, antara amalan batin dengan amalan zhahir (nampak), antara ilmu dengan amal, antara hak Allah dan hak hamba-hamba Allah. Ayat ini menunjukkan, bahwa sepatutnya seorang hamba memperhatikan imannya dan menguatkannya, yang di antara caranya adalah dengan mentadabburi (memikirkan) kitab Allah dan memperhatikan maknanya. Di surga, yaitu yang Allah siapkan untuk penghuni surga berupa sesuatu yang belum pernah terlihat oleh mata, belum pernah terdengar oleh telinga dan belum pernah terlintas di hati manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 4",
    "description": "Setelah menjelaskan beberapa bentuk amal yang berkaitan dengan hati, anggota tubuh dan harta, Allah menjelaskan bahwa mereka yang memiliki sifat-sifat seperti tersebut di atas itulah orang-orang yang benarbenar beriman, lahir dan batin, yang sempurna lagi mantap imannya. Mereka akan memperoleh derajat-derajat yang tinggi di sisi tuhannya, sesuai dengan amal mereka. Dan ampunan atas segala dosa mereka serta rezeki yang mulia berupa kehidupan yang baik di dunia dan kehidupan yang membahagiakan di akhirat. Sesungguhnya kemenangan itu bersumber dari Allah, tempat bergantungnya segala urusan. Persengketaan orang-orang beriman menyangkut soal pembagian harta rampasan perang itu mirip keadaan mereka ketika Allah memberi perintah kepada mereka untuk memerangi orang-orang musyrik di badar. Sebagaimana keadaan kaum muslim ketika berselisih soal pembagian harta rampasan, lalu Allah dan rasulnya mengambil alih pembagian itu, demikian pula ketika tuhanmu menyuruhmu pergi dari rumahmu di madinah untuk menghadang kafilah quraisy dan berperang di badar dengan cara dan tujuan yang benar melalui wahyu, meskipun sesungguhnya sebagian dari orang-orang yang beriman itu benar-benar tidak menyukainya ikut keluar menghadang musuh. Ketidaksenangan mereka sekarang soal pembagian harta rampasan sama dengan ketidaksenangan mereka dahulu ketika diperintah ke badar, tetapi kemudian terbukti pilihan Allah-lah yang menghasilkan kemenangan dan kebahagiaan."
  }
]