[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kaum musyrikin berpaling dari seruan dakwah yang kalian serukan kepada mereka (wahai kaum mukminin), untuk beriman kepada Allah dan rasulNya, serta meninggalkan usaha memerangi kalian, namun mereka tetap menolak, terus bertahan di atas kekafiran dan tetap memerangi kalian, maka yakinlah kalian bahwa sesungguhnya Allah akan menolong dan memenangkan kalian atas musuh kalian.Dia lah sebaik-baik Dzat yang menolong dan membantu kemenangan bagi kalian dan bagi para kekasihNya atas musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Jika mereka mengabaikan perintah untuk menghentikan praktik kekafiran dan menghalang-halangi orang dari jalan Allah, maka yakinlah -wahai orang-orang mukmin- bahwa Allah akan menolong kalian untuk mengalahkan mereka. Allah adalah sebaik-baik pelindung bagi siapa saja yang Dia lindungi, dan sebaik-baik penolong bagi siapa saja yang Dia tolong. Siapa saja yang Dia lindungi akan beruntung. Dan siapa saja yang Dia tolong akan menang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Jika mereka berpaling dari keimanan dan tidak berhenti dari kekafiran dan kemaksiatan, maka yakinlah Allah akan senantiasa melindungi dan menolong kalian, dan percayalah terhadap pertolongan-Nya, karena Dia adalah sebaik-baik penolong bagi hamba-hamba-Nya yang beriman yang menetapkan kemaslahatan bagi mereka dan memudahkan mereka dalam mendapatkan manfaat di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَإِن تَوَلَّوْا۟ (Dan jika mereka berpaling) Dari apa yang diperintahkan kepada mereka, yaitu berhenti dari kekafiran mereka. فَاعْلَمُوٓا۟( maka ketahuilah) Wahai orang-orang beriman. أَنَّ اللهَ مَوْلَىٰكُمْ ۚ( bahwasanya Allah Pelindungmu) Yakni penolong kalian atas mereka. نِعْمَ الْمَوْلَىٰ وَنِعْمَ النَّصِيرُ(Dia adalah sebaik-baik Pelindung dan sebaik-baik Penolong) Dan barangsiapa yang menjadikan-Nya sebagai penolong maka ia akan beruntung, dan barangsiapa yang ditolong oleh Allah niscaya ia akan menang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40 Dan jika mereka berpaling dari keimanan, dan tetap dalam kekufuran, maka ketahuilah wahai orang-orang yang beriman bahwasanya Allah adalah Pengatur segala urusanmu dan juga Pelindungmu dari mereka. Dia adalah sebaik-baik Pelindung dan sebaik-baik Penolong. Tidak akan ada yang bisa melawan siapa yang Dia tolong."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka berpaling} berpaling dari keimanan {ketahuilah bahwa sesungguhnya Allah pelindung kalian} penolong dan penyelamat kalian {Sebaik-baik pelindung dan sebaik-baik penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40 “dan jika mereka berpaling” dari ketaatan dan terbenam ke dalam kelalaian ”maka ketahuilah bahwasannya Allah pelindungmu. Dia adalah sebaik baik pelindung” yang melindungi orang orang yang beriman, menyampaikan kebaikan kepada mereka dan memudahan urusan dunia dan agama mereka, ”dan sebaik baik penolong” yang menolong mereka dan menolak dari mereka tipu daya orang orang busuk serta jebakan orang orang jahat. Barangsiapa penolong dan pelindungnya adalah Allah, maka tidak ada ketakutan baginya, dan barangsiapa yang Allah tidak menolongnya, maka tidak ada kemuliaan ataupun kemenangan untuknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 40: Dia akan menyampaikan kepada hamba-hamba-Nya yang mukmin hal yang bermaslahat bagi mereka dan memudahkan untuk mereka manfaat agama maupun dunia. Dia akan menolong mereka dan menghindarkan tipu daya yang dilancarkan orang-orang fasik. Barang siapa Allah Pelindungnya, maka tidak ada yang perlu dikhawatirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 40",
    "description": "Dan jika mereka berpaling dari ajakanmu untuk beriman kepada Allah dan rasul-Nya dan tidak menghentikan penganiayaan, maka ketahuilah dengan penuh keyakinan bahwa sesungguhnya Allah pelindungmu, karena itu jangan khawatirkan ancaman mereka, serahkan sepenuhnya kepada Allah setelah kamu berusaha sesuai kemampuan kamu. Dia adalah sebaik-baik pelindung, karena tidak ada yang dapat membatalkan perlindungan-Nya, dan tidak ada selain-Nya yang dapat memberi perlindungan, dan dia juga adalah sebaik-baik penolong, karena selain Allah boleh jadi suatu ketika melemah dan tidak mampu menolongsetelah memerintahkan umat islam memerangi orang-orang kafir jika mereka memerangi umat islam, maka pada ayat ini Allah menjelaskan ketentuan pembagian ganimah, yang ketentuannya hanya dilakukan oleh Allah semata. Karena itu, ketahuilah, wahai orang-orang beriman, sesungguhnya segala yang kamu peroleh sebagai rampasan perang, yaitu harta yang diperoleh dari orang-orang kafir melalui pertempuran, maka seperlima untuk Allah, rasul yang digunakan untuk kemaslahatan umat yang ditetapkan sendiri oleh beliau, kerabat rasul, bani ha'syim dan bani mua'a'alib, anak yatim, karena mereka kehilangan orang tua yang bertanggung jawab untuk membiayai hidupnya, orang miskin yang membutuhkan bantuan, dan ibnu sabil, yaitu orang yang kehabisan bekal ketika sedang dalam perjalanan. Demikian ini, jika kamu beriman kepada Allah dan kepada apa yang kami turunkan berupa ayat-ayat yang berfungsi untuk penguatan mental dan pertolongan, kepada hamba kami, nabi Muhammad, di hari furqa'n, yaitu pada hari bertemunya dua pasukan pada perang badar, 17 ramadan tahun kedua hijriah, yang dalam hitungan kalian kalah, sementara mereka menduga keras akan memperoleh kemenangan, ternyata kaum musliminlah yang memperoleh kemenangan berkat pertolongan Allah, sebab Allah mahakuasa atas segala sesuatu, termasuk memenangkan kelompok kecil atas kelompok yang besar."
  }
]