[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketahuilah oleh kalian (wahai kaum mukminin, bahwa harta rampasan yang kalian dapatkan dari musuh kalian melalui jihad di jalan Allah, maka empat perlima bagiannya menjadi hak pasukan perang yang ikut serta dalam peperangan. Sedangkan seperlima bagian yang tersisa dibagi menjadi lima bagian; bagian pertama milik Allah dan rasulNya, untuk dipakai dalam urusan-urusan kemaslahatan umum bagi kaum muslimin, yang kedua bagi kaum kerabat rasulullah , yaitu bani hasyim dan bani muthalib. Dijadikanya bagi mereka seperlima bagian adalah sebagai ganti sedekah, sebab sedekah diharamkan bagi mereka. Dan bagian yang ketiga diperuntukan bagi anak-anak yatim yang ayahnya meninggal sedangkan usia mereka masih belum balig, yang keempat bagi orang-orang miskin yang tidak memiliki sesuatu untuk menutupi dan mencukupi kebutuhan mereka, dan bagi yang kelima bagi orang musafir yang kehabisan bekal perjalanan. (semua itu) bila kalian mengakui keesaan Allah, lagi taat kepadaNya, serta beriman dengan apa yang diturunkan Allah pada hambaNya, Muhammad , berupa ayat-ayat, bantuan, dan pertolongan pada hari Allah memisahkan antara kebenaran dan kebatilan dalam perang badar, yaitu hari ketika golongan kaum mukminin berhadapan dengan golongan kaum musyrikin. Dan Allah mahakuasa atas segala sesuatu, dan tidak ada sesuatupun yang dapat melemahkanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan ketahuilah -wahai orang-orang mukmin- bahwa sesuatu yang kalian ambil dari orang-orang kafir secara paksa dalam jihad fi sabilillah itu (harus) dibagi menjadi lima bagian. Empat bagian darinya dibagikan kepada para mujahid. Dan satu bagian yang tersisa dibagi lagi menjadi lima bagian, satu bagian untuk Allah dan rasul-Nya, digunakan untuk kepentingan umum bagi umat Islam, satu bagian untuk kerabat Nabi -ṣallallāhu 'alaihi wa sallam- dari kalangan Bani Hasyim dan Bani Muṭṭalib, satu bagian untuk anak-anak yatim, satu bagian untuk fakir miskin, dan satu bagian untuk para musafir yang kehabisan bekal di jalan. Itu jika kalian beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami, Muhammad -ṣallallāhu 'alaihi wa sallam- dalam perang Badar yang Allah gunakan untuk memisahkan antara yang benar dan yang salah. Yaitu tatkala Allah menolong kalian untuk mengalahkan musuh-musuh kalian. Dan Allah-lah yang menolong kalian serta Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Setelah Allah memerintahkan orang-orang beriman untuk memerangi orang-orang kafir, maka kemudian Allah menjelaskan cara pembagian harta ghanimah: \"Hai orang-orang beriman, ketahuilah bahwa harta yang kalian ambil dari orang-orang kafir harbi melalui peperangan jadikanlah seperlimanya bagi Allah untuk diinfakkan bagi kemaslahatan agama; kemudian bagi Rasulullah dan ahlul bait, kemudian bagi para kerabat Rasulullah dari Bani Hasyim dan Bani Muthalib; kemudian bagi orang-orang yang membutuhkan dari kalangan anak-anak yatim, fakir miskin, dan orang yang kehabisan bekal dalam perjalanan. Lakukanlah hal ini jika kalian beriman kepada Allah dan kepada kebenaran yang diturunkan Allah kepada rasul-Nya pada hari terjadinya perang Badar; yaitu hari ketika Allah mengumpulkan antara orang-orang beriman dan orang-orang kafir, dan pada hari itu terdapat banyak mukjizat dan tanda-tanda kekuasaan Allah. Allah Maha Kuasa atas segala sesuatu, dengan kekuasaan-Nya Dia menolong kalian dan mendatangkan harta ghanimah kepada kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَاعْلَمُوٓا۟ أَنَّمَا غَنِمْتُم مِّن شَىْءٍ (Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang) Harta ghaminah adalah harta orang-orang kafir yang dirampas apabila mereka dikalahkan oleh kaum muslimin sebagai bentuk kemenangan dan kekuasaan atas mereka. Harta ini dibagi menjadi lima bagian, dan seperlima dari harta ini adalah hak bagi orang-orang yang disebutkan dalam ayat ini. Harta ghanimah meliputi segala yang didapat oleh kaum muslimin dalam perang seperti tanah, harta benda, dan lain sebagainya. Namun pendapat lain mengatakan bahwa yang dimaksud dalam ayat ini adalah harta selain tanah, karena tanah tidak dibagikan kepada para kaum muslimin yang ikut berperang sebab para sahabat tidak membagi harta ghanimah kecuali harta yang dapat dipindah, adapun harta dalam bentuk tanah maka mereka menjadikannya untuk Baitul maal kaum muslimin. فَأَنَّ لِلّٰهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِى الْقُرْبَىٰ وَالْيَتٰمَىٰ وَالْمَسٰكِينِ وَابْنِ السَّبِيلِ(maka sesungguhnya seperlima untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan ibnussabil) Imam Syafi’I berkata: seperlima harta ghanimah ini dibagikan kepada lima golongan, dan bagian untuk Allah dan Rasulullah dijadikan satu dan dipakai untuk kemaslahatan umat. Adapun empat bagian sisanya diberikan kepada empat golongan lain yang disebutkan dalam ayat ini. Imam Abu Hanifah berkata: seperlima harta ghanimah ini dibagikan kepada tiga golongan saja yaitu: anak-anak yatim, orang-orang miskin dan ibnussabil; adapun bagian milik kerabat Rasuulullah telah tercabut dengan kematian Rasulullah sebagaimana telah tercabut bagian Rasulullah. وَلِذِى الْقُرْبَىٰ (kerabat Rasul) Kerabar Rasulullah yakni: keturunan bani Hasyim dan bani Mutthalib. Adapun empat bagian sisa dari keseluruhan harta ghanimah dibagikan kepada para pasukan yang ikut berperang. إن كنتم آمنتم بالله (jika kamu beriman kepada Allah) Yakni jika kalian beriman kepada Allah maka taati dan laksanakanlah urusan Allah dalam pembagian harta ghanimah sebagaimana Dia telah mengajarkannya pada kalian. Dan tinggalkanlah ketamakan kalian terhadapnya serta terimalah 4/5 harta ghanimah itu dengan hati yang lapang. وَمَآ أَنزَلْنَا عَلَىٰ عَبْدِنَا (dan kepada apa yang kami turunkan kepada hamba Kami) Yakni kepada nabi Muhammad pada perang Badar, yang berupa turunnya para malaikat, pertolongan, ayat-ayat, dan mukjizat-mukjizat. يَوْمَ الْفُرْقَانِ (di hari Furqaan (pembeda)) Yakni di hari terjadinya perang Badar, karena di hari itu terbedakan antara orang-orang yang membawa kebenaran dari orang-orang pembawa kebathilan. يَوْمَ الْتَقَى الْجَمْعَانِ ۗ (yaitu di hari bertemunya dua pasukan) Yakni pasukan dari kaum muslimin dan dari orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41 Ketahuilah wahai orang-orang muslim bahwa ghanimah adalah harta orang-orang kafir yang didapat setelah umat muslim mengalahkan atau menguasai peperangan melawan orang kafir yang pembagiannya dibagi menjadi lima bagian. Empat per lima bagian adalah untuk yang merampas dan yang berperang. Adapun seperlima sisa yang ada dibagi lagi menjadi lima bagian. Satu bagian diperuntukkan oleh Allah dan rasul-Nya untuk kemaslahatan orang mukmin secara keseluruhan. Satu bagian untuk keluarga Nabi, dari bani Hasyim dan bani Muthallib. Satu bagian untuk anak-anak dan para yatim yang ditinggal wafat ayahnya sebelum baligh, dan mereka termasuk orang fakir. Satu bagian untuk orang-orang miskin dan orang-orang yang membutuhkan. Satu bagian lagi untuk orang muslim yang berada dalam perjalanan (musafir) dan mereka dalam kondisi kehabisan bekal serta jauh dari negerinya. Itu jika memang engkau termasuk orang-orang yang beriman kepada Allah, Alquran yang diturunkan kepada nabi Muhammad pada waktu perang Badr, hari dimana Allah memisahkan antara yang haq dan bathil, serta memisahkan yang melakukan kebenaran dengan keburukan. Hari dimana orang muslim dan orang musyrik bertemu satu sama lain. Dan Allah Maha Kuasa atas segala sesuatu. Dari-Nya lah pertolongan untuk kalian sehingga kalian bisa mengalahkan musuh kalian, padahal musuh kalian sangat banyak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya apa pun yang kalian peroleh sebagai harta rampasan perang} apa yang kalian ambil dari orang-orang kafir sebagai pemenang {maka seperlimanya untuk Allah, Rasul, kerabat} kerabat nabi Muhammad SAW dari Bani Hasyim dan Bani Muthalib {anak-anak yatim, orang-orang miskin, dan ibnu sabil} musafir yang terpisah {jika kalian beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami pada hari pembeda} hari perang Badar yang mana Allah membedakan pada saat itu antara kebenaran dan kebathilan {yaitu pada hari bertemunya dua pasukan} dua pasukan yaitu pasukan orang-orang muslim dan pasukan orang-orang kafir {Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah berfirman, “Ketahuilah, sesungguhnya apa saja yang dapat kamu peroleh sebagai rampasan perang.” Yakni harta orang kafir yang kamu ambil dengan cara kekuatan yang dibenarkan, banyak ataupun sedikit, “maka sesungguhnya seperlima untuk Allah”, yakni, sisanya adalah untukmu wahai pasukan perang, karena Allah menisbatkan ghanimah tersebut kepada mereka dan mengeluarkan seperlimanya darinya. Ini menunjukkan bahwa sisanya adalah untuk mereka, dibagi seperti pembagian Rasulullah: untuk pasukan berjalan kaki satu bagian dan untuk yang berkuda dua bagian, satu untuk kudanya dan satu untuk penunggangnya. Adapun yang seperlima itu maka ia dibagi menjadi lima bagian: Satu bagian untuk Allah dan RasulNya, yang didistribusikan untuk kepentingan kaum Muslimin secara umum tanpa pengkhususan, karena Allah menajdikanNya dan untuk RasulNya, sementara keduanya tidak memerlukannya, dari sini dapat diketahui bahwa ia untuk hamba-hamba Allah, jika tidak menentukan pos distribusinya maka itu menunjukan bahwa ia untuk kepentingan kaum Muslimin. Bagian seperlima yang kedua adalah untuk kerabat nabi dari Bani Hasyim dan BAni al- Muthallib. Allah menisbatkannya kepada kerabat adalah merupakan dalil bahwa illatnya hanyalah kekerabatan semata, maka tidak ada beda antara kaya, miskin, laki-laki, dan perempuam di kalangan mereka. Bagian seperlima yang ketiga adalah untuk anak-anak yatim, yaitu anak-anak yang di tinggal mati oleh bapak mereka sedangkan mereka masih kecil. Allah memberikan satu bagian dari seperlima untuk meyantuni mereka, dimana mereka belum mampu memenuhi kebutuhan mereka secara mandiri, sementara orang yang mengurusi kebutuhan mereka telah wafat. Bagian seperlima yang keempat adalah untuk orang-orang miskin, yaitu orang-orang yang membutuhkan baik besar, kecil, laki-laki, dan perempuan. Bagian seperlima yang kelima adalah untuk ibnu sabil, yaitu orang asing yang kehilangan bekal di selain negerinya. Sebagian ahli tafsir menyatakan bahwa seperlima dari ghanimah tidak harus dikeluarkan untuk semua lima kelompok ini, dan tidak harus disamaratakan, akan tetapi hal itu disesuaikan dengan kemaslahatan. Dan ini lebih utama. Allah menjadikan penuanian terhadap seperlima dengan sebaik-baiknya sebagai syariat iman. Dia berfirman, “jika kamu beriman kepada Allah kepada apa yang kami turunkan kepada hamba Kami (Muhammad) di Hari Furqan.” Yakni Hari Perang Badar, dimana pada hati itu Allah mebedakan antara yang haq dengan yang bathil. Dia memenangkan yang hak dan membatalkan yang bathil. “Yaitu di hari bertemunya dua pasukan.” Pasukan Muslimin dan pasukan kafirin. Yakni, jiika imanmu kepada Allah dan kepada kebenaran yang menunjukan bahwa apa yang di bawa oleh Muhammad adalah benar. “Dan Allah Mahakuasa atas segala sesuatu.” Tidak ada seseorangpun yang melawannya kecuali kalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 41: Sedikit atau banyak. Yang dimaksud dengan rampasan perang (ghanimah) adalah harta yang diperoleh dari orang-orang kafir melalui pertempuran, sedangkan yang diperoleh tanpa melalui pertempuran dinamakan fa'i. Pembagian dalam ayat ini terkait dengan ghanimah saja. Adapun fa'i dibahas dalam surat Al Hasyr. Bagian untuk Allah dan Rasul-Nya disalurkan untuk maslahat (kepentingan) kaum muslimin secara umum, karena Allah dan Rasul-Nya tidak membutuhkannya, dan tidak disebutkan ke mana disalurkan sehingga penyalurannya untuk maslahat umum. Dari kalangan Bani Hasyim dan Bani Muththalib baik yang kaya maupun yang miskin, laki-laki maupun perempuan. Yaitu anak kecil yang ditinggal mati oleh bapaknya. Yakni orang yang berhajat (membutuhkan) atau kekurangan. Yaitu orang yang terhenti di perjalanan karena kehabisan bekal. Maksud ayat ini adalah bahwa seperlima dari ghanimah itu dibagikan kepada Allah dan Rasul-Nya, kerabat Rasul, anak yatim, fakir miskin dan Ibnussabil. Sedangkan empat-perlima dari ghanimah itu dibagikan kepada yang ikut berperang, untuk yang berjalan kaki memperoleh satu bagian, sedangkan penunggang kuda memperoleh dua bagian; bagian untuknya dan untuk kudanya. Sebagian mufassir berpendapat, bahwa 1/5 dari ghanimah tidak boleh keluar dari 5 golongan itu, dan tidak mesti mereka dibagi secara sama, bahkan disesuaikan dengan maslahat. Allah menjadikan pembagian ghanimah sesuai dengan aturannya sebagai syarat keimanan. Yang dimaksud dengan “apa” di sini bisa maksudnya ayat-ayat Al-Quran, malaikat dan pertolongan. Yang dimaksud dengan hari Al Furqaan adalah hari yang memisahkan antara yang hak dan yang batil atau hari ditampakkan kebenaran dan dikalahkan kebatilan, yaitu hari bertemunya dua pasukan di Badar, pada hari Jum'at 17 Ramadhan tahun ke 2 Hijriah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 41",
    "description": "Setelah memerintahkan umat islam memerangi orang-orang kafir jika mereka memerangi umat islam, maka pada ayat ini Allah menjelaskan ketentuan pembagian ganimah, yang ketentuannya hanya dilakukan oleh Allah semata. Karena itu, ketahuilah, wahai orang-orang beriman, sesungguhnya segala yang kamu peroleh sebagai rampasan perang, yaitu harta yang diperoleh dari orang-orang kafir melalui pertempuran, maka seperlima untuk Allah, rasul yang digunakan untuk kemaslahatan umat yang ditetapkan sendiri oleh beliau, kerabat rasul, bani ha'syim dan bani mua'a'alib, anak yatim, karena mereka kehilangan orang tua yang bertanggung jawab untuk membiayai hidupnya, orang miskin yang membutuhkan bantuan, dan ibnu sabil, yaitu orang yang kehabisan bekal ketika sedang dalam perjalanan. Demikian ini, jika kamu beriman kepada Allah dan kepada apa yang kami turunkan berupa ayat-ayat yang berfungsi untuk penguatan mental dan pertolongan, kepada hamba kami, nabi Muhammad, di hari furqa'n, yaitu pada hari bertemunya dua pasukan pada perang badar, 17 ramadan tahun kedua hijriah, yang dalam hitungan kalian kalah, sementara mereka menduga keras akan memperoleh kemenangan, ternyata kaum musliminlah yang memperoleh kemenangan berkat pertolongan Allah, sebab Allah mahakuasa atas segala sesuatu, termasuk memenangkan kelompok kecil atas kelompok yang besar. Ayat berikutnya menginformasikan tentang faktor penting yang membuat perang badar yang sesungguhnya tidak seimbang itu benarbenar terjadi, yaitu ketika kalian, wahai orang-orang mukmin, berada di pinggir lembah yang dekat ke arah kota madinah, dan mereka, orangorang kafir, berada di pinggir lembah yang jauh dari kota madinah sedang kafilah itu yang dipimpin oleh abu sufya'n berada lebih rendah, yakni lebih dekat dari kalian, kira-kira 5 mil saja. Sekiranya kalian mengadakan persetujuan untuk menentukan hari pertempuran, niscaya kalian berbeda pendapat dalam menentukan-Nya karena jumlah kalian jauh lebih sedikit dibanding jumlah pasukan kafir, tetapi Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan atau mesti terjadi dalam kehidupan, yaitu meninggikan kalimat-Nya dengan memberi kemenangan dan kemuliaan kepada kaum muslim serta kehancuran dan kehinaan bagi orang-orang kafir. Demikian ini, agar orang yang binasa atau terbunuh dalam peperangan itu binasa dengan bukti yang nyata, yakni melihat dan mengalami sendiri akibat kedurhakaannya dan agar orang yang hidup atau selamat dari pertempuran itu hidup dengan bukti yang nyata juga, yaitu dengan melihat bukti kekuasaan Allah. Sungguh, Allah maha mendengar permohonan orang-orang beriman agar diberi kemenangan pada perang yang sangat menentukan tersebut, maha mengetahui keadaan mereka bahwa mereka memang berhak atas pertolongan itu."
  }
]