[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan ingatlah oleh kalian ketika kalian berada di sisi lembah yang lebih dekat dengan Madinah, sedang musuh kalian menempati bagian lembah yang jauh, sementara kafilah dagang berada di bawah kalian menuju tepi pantai laut merah. Kalau saja kalian telah menetapkan waktu untuk berhadapan (untuk peperangan ini) pastilah kalian akan menyalahi perjanjian. Akan tetapi, Allah mengumpulkan kalian tanpa ada kesepakatan sebelumnya, supaya Allah merealisasikan ketetapan perkara yang mesti terlaksana, guna menolong para pembelaNya, dan menghinakan musuh-musuhNya dengan menjadi korban dan tawanan. Dan yang demikian itu, agar menjadi binasa orang yang binasa dari mereka dengan hujjah Allah yang telah tegak jelas baginya lalu ia melihatnya lansung dan memutus udzur baginya. Dan agar hidup orang yang hidup dengan hujjah Allah yang telah datang dengan kuat dan tampak jelas baginya, dan sesungguhnya Allah Maha mendengar ucapan-ucapan dua belah pihak, tidak ada yang samar sesuatupun bagiNya, dan Dia Maha mengetahui dari niat-niat mereka dan perbuatan-perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Dan ingatlah ketika kalian berada di sisi lembah yang dekat dengan Madinah, dan orang-orang kafir berada di sisi lembah yang jauh ke arah Makkah. Sedangkan kafilah dagang berada di tempat yang lebih rendah dari kalian ke arah pantai laut Merah. Seandainya kalian dan orang-orang musyrik sengaja membuat janji untuk bertemu di Badar, tentu kalian akan berselisih paham satu sama lain. Akan tetapi Allah -Subḥānahu- mempertemukan kalian di Badar tanpa ada perjanjian sebelumnya, agar Allah dapat menuntaskan apa yang hendak dilakukan-Nya, yaitu memenangkan orang-orang mukmin dan mengalahkan orang-orang kafir, memuliakan agama-Nya dan menghinakan kemusyrikan. Hal itu supaya orang yang harus binasa segera binasa setelah disampaikan hujjah kepadanya dengan kemenangan orang-orang mukmin, kendati jumlah pasukan dan peralatan perang mereka sangat minim; dan supaya orang yang pantas hidup dapat menjalani hidupnya berdasarkan bukti dan hujjah yang diperlihatkan oleh Allah kepadanya. Maka tidak ada lagi orang yang dapat mengajukan hujjah di hadapan Allah. Dan Allah Maha Mendengar ucapan semua makhluk-Nya lagi Maha Mengetahui perbuatan mereka. Tidak ada sesuatupun yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan yang setimpal kepada mereka berdasarkan amal masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Para musuh yang bersenjata berada di arah depan pada lembah yang jauh dari kota Madinah, sedangkan kafilah dagang Abu Sufyan berada di tepi pantai laut merah. Seandainya kalian saling berjanji dengan mereka untuk berperang niscaya kalian akan mengingkari janji itu, karena kalian takut berperang disebabkan jumlah kalian yang sedikit, dan karena tujuan kebanyakan kalian adalah untuk menghadang kafilah dagang tanpa peperangan. Akan tetapi kalian bertemu dengan pasukan itu tanpa ada janji sebelumnya atau keinginan untuk berperang, agar Allah menetapkan urusan yang telah ada dalam ilmu dan hikmah-Nya bahwa itu akan terjadi; yaitu urusan terjadinya peperangan yang menghinakan mereka, memberi kemenangan kepada kalian, membenarkan janji Allah kepada rasul-Nya, dan memenangkan agama-Nya diatas seluruh agama lainnya meskipun orang-orang musyrik itu tidak menyukai kemenangan tersebut. Perkara ini juga agar Allah membinasakan orang-orang kafir setelah keterangan yang jelas diberikan kepada mereka, dan agar orang-orang beriman hidup di atas keterangan dan bukti yang telah mereka saksikan, sehingga semakin menambah keimanan dengan semangat mereka dalam beramal. Allah Maha Mendengar doa orang-orang beriman yang meminta pertolongan, dan Maha Mendengar perbincangan yang terjadi di antara mereka dalam urusan kepergian menuju Perang Badar. Dan Allah Maha Mengetahui apa yang terbesit dalam pikiran mereka, dan Maha Mengetahui yang terbaik bagi mereka untuk saat ini dan masa depan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِذْ أَنتُم بِالْعُدْوَةِ الدُّنْيَا (ketika kamu berada di pinggir lembah yang dekat) Yakni sisi lembah yang dekat dengan kota Madinah, sedangkan musuh kalian berada di sisi yang jauh yang berada di sebelah arah Makkah. وَالرَّكْبُ أَسْفَلَ مِنكُمْ ۚ (sedang kafilah itu berada di bawah kamu) Yang dimaksud adalah kafilah yang dipimpin oleh Abu Sufyan. Ketika itu mereka berada di bawah mereka, di sisi pantai. Dan Allah mengaruniai kaum muslimin dengan kemenangan atas mereka, padahal keadaan ketika itu sedemikian rupa. وَلَوْ تَوَاعَدتُّمْ لَاخْتَلَفْتُمْ فِى الْمِيعٰدِ ۙ( Sekiranya kamu mengadakan persetujuan pastilah kamu tidak sependapat dalam menentukan hari pertempuran itu) Yakni seandainya kalian mengadakan persetujuan dengan orang-orang musyrik untuk menentukan tempat diadakannya pertempuran niscaya kalian akan saling berselisih, sehingga sebagian kecil dari kalian dan sebagian besar dari mereka akan mengendorkan tekat untuk memenuhi persetujuan tersebut. Dan akan melemahkan wibawa Rasulullah di hati orang-orang musyrik. وَلٰكِن(akan tetapi) Akan tetapi Allah mengumpulkan kalian semuanya di tempat ini. لِّيَقْضِىَ اللهُ أَمْرًا كَانَ مَفْعُولًا(agar Dia melakukan suatu urusan yang mesti dilaksanakan) Yaitu memenangkan para kekasih-Nya dan menghinakan para musuh-Nya. Memuliakan agama-Nya dan menghinakan kekafiran. Dan hal ini belum terprediksi oleh kedua pasukan bahwa kesepakatan akan menjadi seperti ini. لِّيَهْلِكَ مَنْ هَلَكَ عَنۢ بَيِّنَةٍ وَيَحْيَىٰ مَنْ حَىَّ(yaitu agar orang yang binasa itu binasanya dengan keterangan yang nyata dan agar orang yang hidup itu hidupnya) Yakni agar gugur orang yang telah ditetapkan untuk gugur dengan hujjah yang telah ditegakkan dan agar selamat orang yang telah ditetapkan untuk selamat. عَنۢ بَيِّنَةٍ ۗ( dengan keterangan yang nyata (pula)) Agar tidak ada lagi orang yang memiliki alasan di hadapan Allah. Pendapat lain mengatakan yakni agar kekafiran orang kafir itu tanpa ada syubhat dan keislaman orang islam itu tanpa ada syubhat; karena syubhat itu telah hilang dengan kemenangan orang-orang beriman dan dengan terlihatnya hasil dari furqaan (pembedaan antara iman dan kafir). Karena apabila seseorang meninggal setelah ini kemudian ia layak mendapatkan azab karena terus-menerus dalam kekafiran, kematiannya dalam keadaan ini tidak dalam keadaan syubhat, akan tetapi ia di azab karena ia terus menerus berada dalam kesesatan padahal ia mengetahui. Begitu pula tidak ada syubhat sedikitpun bahwa orang-orang yang beriman berada dalam kebenaran dan telah jelas bahwa agama Allah adalah agama yang Berjaya dan para pemeluknya adalah orang-orang yang menang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42 Ingatlah suatu hari pembedaan, yaitu ketika kamu berada di pinggir lembah bagian bawah yang dekat dengan Madinah. Adapun mereka musuh kalian berada di pinggir lembah di balik tempat kalian berada yang jauh Madinah, sedangkan kafilah Abu Sufyan itu berada di bawah tempat yang kalian pijaki yaitu pesisir laut.. Sekiranya kamu mengadakan persetujuan untuk menentukan hari pertempuran dengan tentara Qurasy saat itu juga. Namun kalian ditakdirkan belum melakukan perjanjian untuk perang saat itu juga, pastilah kamu tidak sependapat dalam menentukan hari pertempuran itu. Akan tetapi Allah mempertemukan dua pasukan itu tanpa suatu perjanjian agar Dia melakukan suatu urusan yang mesti dilaksanakan, yaitu untuk menolong orang-orang mukmin dan membinasakan orang kafir. Allah mentakdirkan itu untuk melenyapkan orang kafir setelah mereka ditunjukkan bukti yang nyata, serta untuk membuat orang-orang yang sudah beriman semakin beriman dengan adanya bukti yang nyata yang belum pernah ada contohnya. Sesungguhnya Allah Maha Mendengar perkataan kalian lagi Maha Mengetahui kondisi kalian. Makna dari kebinasaan pada ayat ini adalah untuk orang kafir sebab kekufuran adalah sebab diturunkannya kebinasaan. Makna dari kehidupan adalah keimanan, karena iman adalah sebab kehidupan dan kekufuran adalah kematian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika kalian berada di pinggir lembah yang dekat} di pinggir lebah yang dekat dengan Madinah {dan mereka berada di pinggir lembah yang jauh} di pinggir lembah yang jauh dari Madinah {sedangkan kafilah itu} kafilah Abu Sufyan {berada lebih rendah daripada kalian} di tempat yang leboh rendah daripada posisi kalian, yaitu di tepi pantai. {Seandainya kalian mengadakan perjanjian, niscaya kalian berbeda pendapat dalam menentukan hari pertempuran itu, tetapi supaya Allah melaksanakankan suatu urusan yang harus terjadi, yaitu agar orang yang binasa itu binasa} supaya orang yang akan mati itu mati {dengan bukti yang nyata} dalil yang menjelaskannya {dan agar orang yang hidup itu hidup} orang yang bertahan hidup itu hidup {dengan bukti yang nyata. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “(Yaitu di hari) ketika kamu berda di pinggir lembah yang dekat.” Yakni di pinggir lembah yang dekat Madinah. Satu lembah yang talah mengumpulkan kamu dengan mereka “sedang kafilah” yang kamu incar itu bukanlah yang diinginkan oleh Allah “berada di bawah kamu,” melewati pinggir laut . “sekiranya kamu mengadakan persetujuan untuk menentukan hari pertempuran”, dengan mereka sesuatu dengan kondisi dan keadaan tersebut “pastilah kamu tidak sependapat dalam menentukan hari pertempuran itu.” Yakni pasti ada maju mundurnya atau pemilihan tempat dan lain-lain sebagiannya yang memalingkanmu atau mereka dari perjanjian. Akan tetapi Allah-lah yang mengumpulkanmu dengan mereka dalam kondisi tersebut. “Agar Dia melakukan suatu urusan yang mesti dilaksanakan,” yang telah di takdirkan sejak azali yang mesti terjadi. “YAitu agar orang yang binasa itu binasa dengan keterangan yang nyata.” Yakni supaya ia menjadi hujjah dan bukti bagi penentang, sehingga ketika dia memilih kekufuran yang dasar ilmu dan keyakinan terhadap kebathilannya, maka tidak ada lagi alasan dihadapan Allah. “Dan agar orang yang hidup itu hidup dengan keterangan yang nyata pula.” Yakni bashirah dan keyakinan orang Mukmin bertambah dengan bukti-bukti kebenaran yang di tunjukan oleh Allah kepada Dua kelompok yang cukup sebagi peringatan bagi orang-orang yang berakal. “Sesungguhnya Allah Maha mendengar Lagi Maha Mengetahui,” Maha Mendengar segala suara dan bahasa yang beraneka ragam dan keperluan yang bermacam-macam, Maha Mengetahui yang lahir, batin, yang rahasia, yang ghaib, dan yang Nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 42: Maksudnya kaum muslimin ketika itu berada di pinggir lembah yang dekat ke Madinah, dan orang-orang kafir berada di pinggir lembah yang jauh dari Madinah. Sedangkan kafilah yang dipimpin oleh Abu Sofyan itu berada di tepi pantai kira-kira 5 mil dari Badar. Dengan mereka (kaum kafir Quraisy). Maksudnya kemenangan kaum muslimin dan kehancuran kaum musyrikin, dan dikumpulkan-Nya mereka tanpa ada persetujuan waktunya terlebih dahulu merupakan ketentuan Allah yang mesti terjadi. Maksudnya agar orang-orang yang tetap di dalam kekafirannya tidak mempunyai alasan lagi di hadapan Allah untuk tetap dalam kekafiran itu karena telah tegak hujjah dan bukti yang nyata (seperti bisa menangnya kaum muslimin terhadap musuh mereka yang berjumlah banyak padahal jumlah mereka hanya sedikit), dan orang-orang yang beriman bertambah lagi keimanannya karena Allah telah menampakkan bukti-bukti yang nyata yang menunjukkan kebenaran mereka, di mana di dalamnya terdapat peringatan bagi orang-orang yang berakal. Allah Maha Mendengar semua suara dengan berbagai macam bahasa dan berbagai macam kebutuhan, Dia mengetahui pula yang nampak maupun yang tersembunyi dan semua rahasia, serta mengetahui yang ghaib maupun yang kelihatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 42",
    "description": "Ayat berikutnya menginformasikan tentang faktor penting yang membuat perang badar yang sesungguhnya tidak seimbang itu benarbenar terjadi, yaitu ketika kalian, wahai orang-orang mukmin, berada di pinggir lembah yang dekat ke arah kota madinah, dan mereka, orangorang kafir, berada di pinggir lembah yang jauh dari kota madinah sedang kafilah itu yang dipimpin oleh abu sufya'n berada lebih rendah, yakni lebih dekat dari kalian, kira-kira 5 mil saja. Sekiranya kalian mengadakan persetujuan untuk menentukan hari pertempuran, niscaya kalian berbeda pendapat dalam menentukan-Nya karena jumlah kalian jauh lebih sedikit dibanding jumlah pasukan kafir, tetapi Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan atau mesti terjadi dalam kehidupan, yaitu meninggikan kalimat-Nya dengan memberi kemenangan dan kemuliaan kepada kaum muslim serta kehancuran dan kehinaan bagi orang-orang kafir. Demikian ini, agar orang yang binasa atau terbunuh dalam peperangan itu binasa dengan bukti yang nyata, yakni melihat dan mengalami sendiri akibat kedurhakaannya dan agar orang yang hidup atau selamat dari pertempuran itu hidup dengan bukti yang nyata juga, yaitu dengan melihat bukti kekuasaan Allah. Sungguh, Allah maha mendengar permohonan orang-orang beriman agar diberi kemenangan pada perang yang sangat menentukan tersebut, maha mengetahui keadaan mereka bahwa mereka memang berhak atas pertolongan itulebih lanjut dijelaskan dengan rinci terjadinya perang badar yang tidak seimbang tersebut. Ingatlah wahai nabi Muhammad, ketika Allah memperlihatkan jumlah mereka, pasukan kafir, di dalam mimpimu berjumlah sedikit, lalu engkau menyampaikan kepada sahabat-sahabatmu sehingga mereka kuat mentalnya dan lebih berani. Sebab, sekiranya Allah memperlihatkan mereka berjumlah banyak, tentu kalian, wahai orangorang mukmin, menjadi gentar dan tentu kalian akan berbantah-bantahan dalam urusan itu menyangkut keterlibatan mereka pada perang badar tersebut, tetapi Allah telah menyelamatkan kamu dengan cara menunjukkan jumlah mereka terlihat sedikit dan lemah melalui mimpi nabi. Sungguh, Allah maha mengetahui apa yang ada dalam hatimu, termasuk rasa berani dan gentar dalam menghadapi peperangan."
  }
]