[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah wahai nabi, ketika Allah memperlihatkan sedikitnya jumlah musuhmu dalam mimpimu, dan kemudian kamu memberitahukan itu kepada kaum mukminin, sehingga hati mereka menjadi teguh dan mereka berani menyongsong peperangan menghadapi musuh mereka. Dan seandainya tuhanmu memperlihatkan kepadamu banyaknya jumlah mereka, tentulah sahabat-sahabatmu akan maju mundur dalam menghadapi mereka, kalian menjadi takut serta bersilang pendapat dalam perkara memerangi mereka. Akan tetapi, Allah menyelamatkan kalian dari kegagalan dan menjauhkan kalian dari dampak buruknya. Sesungguhnya Dia maha mengetahui rahasia-rahasia yang tersembunyi di dalam hati dan tabiat-tabiat jiwa-jiwa manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan ingatlah -wahai Rasul- nikmat-nikmat Allah yang diberikan kepadamu dan kepada orang-orang mukmin ketika Allah memperlihatkan kepadamu di dalam mimpimu bahwa jumlah orang-orang musyrik sangat sedikit. Kemudian kamu menceritakan mimpi itu kepada orang-orang mukmin sehingga mereka merasa gembira dan tekad mereka untuk menghadapi dan memerangi musuh-musuh mereka itu semakin kuat. Sekiranya Allah -Subḥānahu- memperlihatkan kepadamu di dalam mimpimu bahwa jumlah orang-orang musyrik sangat banyak, tentu semangat juang sahabat-sahabatmu akan runtuh dan mereka akan takut berperang. Tetapi Allah telah menyelamatkan mereka dari kondisi semacam itu dan melindungi mereka dari kegagalan. Maka Allah membuat jumlah mereka tampak sedikit di mata rasul-Nya -ṣallallāhu 'alaihi wa sallam-. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan di dalam hati dan apa yang tersembunyi di dalam jiwa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43- 44. Hai Muhammad, ingatlah ketika Allah memperilihatkanmu dalam mimpi bahwa jumlah pasukan musuh hanya sedikit, kemudian kamu memberitahukan hal ini kepada orang-orang beriman, sehingga hati mereka menjadi tenang dan harapan mereka terhadap kemenangan menjadi kuat. Seandainya Allah memperlihatkanmu bahwa jumlah mereka sangat banyak niscaya para sahabat akan lemah dan takut serta tidak akan mampu memerangi musuh karena diakibatkan pula oleh perselisihan pandangan di antara mereka dalam perkara peperangan ini. Akan tetapi Allah menyelamatkan kalian dari kelemahan dan perselisihan yang dapat mengakibatkan perpecahan dan kekalahan. Allah Maha Mengetahui apa yang tersembunyi di dalam dada yang berupa rasa takut yang membuatnya sempit sehingga enggan melakukan peperangan, serta rasa berserah diri dan penuh keimanan yang timbul dari diri yang tenang dan sabar sehingga membuatnya berani. Dan Allah menjadikan bagi setiap perasaan itu sebab-sebab yang mengantarkan kepada hal yang Dia kehendaki. Ingatlah ketika Allah menampakan kalian berjumlah sedikit di pandangan orang-orang kafir ketika kalian saling bertemu dengan mereka di medan perang, berkat keimanan yang Allah masukkan ke dalam hati kalian terhadap janji-Nya untuk menolong kalian, membantu kalian dengan para malaikat, dan menghinakan musuh kalian. Dan Allah membuat jumlah kalian sedikit pada pandangan mereka karena kalian memang berjumlah sedikit, namun ketika kalian bertemu dengan mereka di medan perang, Allah meneguhkan hati kalian dan menurunkan semangat mereka agar Allah menetapkan kemenangan bagi kalian sebagai perkara yang telah ada dalam ilmu yang Dia ketahui yang pasti terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. إِذْ يُرِيكَهُمُ اللهُ فِى مَنَامِكَ قَلِيلًا ۖ (ketika Allah menampakkan mereka kepadamu di dalam mimpimu (berjumlah) sedikit) Yakni Rasulullah melihat dalam mimpinya bahwa pasukan orang-orang musyrik berjumlah sedikit, maka Rasulullah menceritakan hal ini kepada para sahabatnya sehingga ini menjadi sebab keteguhan mereka. Andai saja Rasulullah melihat dalam mimpinya bahwa jumlah pasukan orang-orang musyrik banyak niscaya mereka akan merasa lemah dan takut memerangi mereka serta saling berselisih apakah akan menghadapi mereka atau tidak. وَلٰكِنَّ اللهَ سَلَّمَ ۗ (akan tetapi Allah telah menyelamatkan kamu) Dan melindungi mereka dari kekalahan, sehingga Allah menjadikan orang-orang musyrik berjumlah sedikit dalam penglihatan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43 Ingatlah wahai Nabi ketika sebelum peperangan Allah menampakkan kepadamu di dalam mimpimu bahwa orang-orang musyrik itu berjumlah sedikit. Kemudian engkau kabarkan kepada para sahabatmu, kemudian mereka menjadi bersemangat dan percaya diri. Andaikata Kami memperlihatkan bahwa jumlah mereka banyak maka pasti kalian akan gusar dan berbeda pendapat untuk memerangi mereka atau tidak wahai orang-orang mukmin, Jumlah sebenarnya tentara Qurasy adalah lebih dari seribu, adapun jumlah tentara muslim hanya 314, akan tetapi Allah telah menyelamatkan kalian dari kekalahan dan perdebatan. Sehingga Allah memperlihatkan jumlah mereka hanya sedikit kepada Nabi. Sesungguhnya Allah Maha Mengetahui segala isi hati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah memperlihatkan mereka kepadamu di dalam mimpimu itu sedikit} sedikit jumlahnya {Seandainya Allah memperlihatkan mereka kepadamu itu banyak, niscaya kalian gentar} kalian akan menjadi pengecut dan merasa lemah {dan kalian akan berbantah-bantahan dalam urusan itu} kalian akan berselisih tentang urusan peperangan itu {tetapi Allah telah menyelamatkan} Allah melindungi dari kegagalan dan perselisihan {Sesungguhnya Dia Maha Mengetahui apa yang ada dalam hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-44. Allah memperlihatkan ke dalam mimpi Rasululoh, bahwa orang-orang musyrik berjumlah sedikit, kemudian Rasululoh memberitahukan berita gembira itu kepada sahabat-sahabatnya, maka hati mereka pun menjadi tenang dan teguh. “Dan sekiranya Allah memperlihatkan mereka kepadamu (berjumlah) banyak.” Lalau kamu menyampaikan berita itu kepada sahabat-sahabatmu, “tentu saja mereka menjadi gentar tentu saja kamu akan berbantah-bantahan dalam urusan itu.” Di antara kamu ada yang berpendapat meneruskan perang, ada pula yang tidak berpendapat demikian, dan percekcokan adalah kekalahan. “Akan tetapi Allah telah menyelamatkan kamu.” Yakni melindungimu. “Sesungguhnya Allah Maha Mengetahui segela isi hati.” Yakni keteguhan, kekhawatiran, kejujuran, keteguhan, dan kedustaan yang ada padanya. Allah mengetahui apa yang ada di dalam hatimu yang membuatnya mengasihiMu, berlaku baik kepadamu, dan mebuktikan mimpi RasulNya. Allah menampakan kepada orang-orang Mukmin seakan-akan musuh-musuh mereka berjumlah sedikit. Masing-masing pasukan melihat musuhnya sedikit, agar masing-masing pasukan menyerang yang lain. “Karena Allah hendak melakukan suatu urusan yang mesti dilaksanakan.” Yakni, memberi kemenangan kepada kaum Muminin dan menimpakan kekalahan kepada orang kafir, serta membinasakan para pemimpin dan pembesar kekafiran mereka, sehingga tidak seorangpun dari mereka yang bisa di banggakan, sehingga setelah itu mereka mudah di ajak masuk islam, ia juga menjadi bukti kelembutan bagi yang lain yang Allah beri nikmat Islam. “Dan hanya kepada Allah-lah segala urusan dikembalikan.” Yakni, segala urusan makhluk kembali kepada Allah, maka Dia membedakan yang baik dan yang buruk, dan memutuskan urusan makhluk dengan adil tanpa sedikitpun kezhaliman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 43: Kemudian engkau memberitahukan para sahabatmu, sehingga mereka bergembira. Yakni di antara kamu ada yang mengusulkan untuk tetap maju berperang, dan ada pula yang mengusulkan untuk tidak maju berperang sehingga mengakibatkan kegentaran. Dari sikap gentar dan berbantah-bantahan. Seperti keteguhan hati dan sikap keluh kesah, kejujuran dan kedustaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 43",
    "description": "Lebih lanjut dijelaskan dengan rinci terjadinya perang badar yang tidak seimbang tersebut. Ingatlah wahai nabi Muhammad, ketika Allah memperlihatkan jumlah mereka, pasukan kafir, di dalam mimpimu berjumlah sedikit, lalu engkau menyampaikan kepada sahabat-sahabatmu sehingga mereka kuat mentalnya dan lebih berani. Sebab, sekiranya Allah memperlihatkan mereka berjumlah banyak, tentu kalian, wahai orangorang mukmin, menjadi gentar dan tentu kalian akan berbantah-bantahan dalam urusan itu menyangkut keterlibatan mereka pada perang badar tersebut, tetapi Allah telah menyelamatkan kamu dengan cara menunjukkan jumlah mereka terlihat sedikit dan lemah melalui mimpi nabi. Sungguh, Allah maha mengetahui apa yang ada dalam hatimu, termasuk rasa berani dan gentar dalam menghadapi peperangan. Setelah menjelaskan apa yang dilihat oleh nabi dalam mimpi, maka pada ayat ini dijelaskan apa yang dilihat kaum muslim dengan mata kepala sendiri di medan perang. Ingatlah ketika Allah memperlihatkan mereka, orang-orang kafir, kepada kalian ketika kalian berjumpa dengan mereka seakan-akan berjumlah sedikit menurut penglihatan mata kalian di medan perang; dan kalian, wahai orang-orang mukmin, diperlihatkannya seakan-akan berjumlah sedikit menurut penglihatan mereka sebelum bertemu di medan pertempuran. Demikian itu karena Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan. Hanya kepada Allah segala urusan dikembalikan, sehingga tidak ada satu pun yang terlepas dari kehendak-Nya. Peristiwa perang badar seharusnya menguatkan mental dan keyakinan setiap orang mukmin bahwa Allah pasti menolong hamba-Nya yang memiliki keimanan yang benar, meski pertolongan itu datang dengan cara yang unik dan tidak masuk akal."
  }
]