[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah juga ketika musuh sudah muncul ke medan perangan, lalu kalian melihat mereka berjumlah sedikit, sehingga kalian pun berani melawan mereka. Dan Allah menampakan kalian berjumlah sedikit pada pandangan mata mereka, supaya mereka meremehkan persiapan untuk memerangi kalian, karena Allah hendak menetapkan satu perkara yang harus terlaksana, lalu terwujudlah janji Allah bagi kalian dengan datangnya pertolongan dan kemenangan. Kemudian kalimat Allah menjadi paling tinggi dan slogan orang-orang kafir menjadi yang paling rendah. Dan kepada Allah semua urusan kembali, lalu Dia memberikan balasan bagi masing-masing orang dengan apa yang berhak di terimanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Dan ingatlah -wahai orang-orang mukmin- ketika Allah memperlihatkan kepada kalian bahwa orang-orang musyrik yang kalian hadapi itu hanya sedikit, sehingga kalian berani maju melawan mereka. Dan Allah juga membuat kalian tampak sedikit di mata mereka sehingga mereka pun maju untuk melawan kalian dan tidak berpikir untuk mundur. Hal itu karena Allah hendak menuntaskan sesuatu yang hendak dilakukan-Nya. Yaitu menghukum orang-orang musyrik dengan membunuh sebagian dari mereka dan menjadikan sebagian lainnya sebagai tawanan perang. Dan menganugerahi orang-orang mukmin dengan pertolongan dan kemenangan atas musuh-musuh mereka. Hanya kepada Allah segala urusan akan dikembalikan. Kemudian Dia akan membalas orang yang jahat dengan balasan yang setimpal dengan kejahatannya, dan membalas orang yang baik atas kebaikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ فِىٓ أَعْيُنِكُمْ قَلِيلًا وَيُقَلِّلُكُمْ فِىٓ أَعْيُنِهِمْ (Dan ketika Allah menampakkan mereka kepada kamu sekalian, ketika kamu berjumpa dengan mereka berjumlah sedikit pada penglihatan matamu) Allah menampakkan bagi kedua pasukan bahwa jumlah mereka sedikit di pandangan musuhnya masing-masing, sebagai penegas apa yang dilihat Rasulullah dalam mimpinya; sebagaimana dalam ayat lain disebutkan: يرونهم مثليهم رأي العين “mereka melihat diri mereka dengan mata kepala mereka seakan-akan dua kali lebih banyak dari musuhnya” (ali-Imran: 13) Hal ini agar kedua pasukan tertipu dengan kelemahan musuhnya masing-masing. Sehingga seseorang dari kaum muslimin berkata pada temannya: apakah kamu mengira jumlah mereka tujuh puluh orang? Lalu temannya menjawab: mereka sekitar seratus orang. Dan Allah menampakkan kaum muslimin berjumlah sedikit pada pandangan kaum musyrikin sehingga seseorang dari mereka berkata: mereka hanyalah أكلة جزور hal ini terjadi sebelum perang dimulai, adapun setelah mereka memulai perang Allah menampakkan kaum muslimin terlihat lebih banyak pada pandangan kaum musyrikin. لِيَقْضِىَ اللهُ أَمْرًا كَانَ مَفْعُولًا (karena Allah hendak melakukan suatu urusan yang mesti dilaksanakan) Yakni menjadikan perang ini sebagai siksaan bagi kaum yang hendak Allah siksa dan sebagai karunia bagi kaum yang hendak Allah beri karunia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Inilah diantara keindahan seuatu yang diciptakan Allah ta'ala, Dia menjadikan untuk satu hal dua jejak yang berbeda, kebingungan kaum muslimin atas sedikitnya jumlah kaum musyrikin yang nampak dihadapan mereka menjadikan mereka lebih kuat untuk menghancurkan benteng pertahanan kaum musyrikin, dan hilangnya rasa takut kepada musuh mereka, sebagaimana kaum musyrikin melihat jumlah umat islam yang sedikit justru itu menjadi sebab tumbangnya kekuatan mereka, mereka menyangka akan menang diatas umat islam dengan serangan yang tidak besar, akan tetapi perkiraan mereka itu salah dan tumbang ditangan kaum muslimin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44 Dan ingatlah wahai orang-orang mukmin ketika Allah menampakkan kepada kamu sekalian bahwa jumlah mereka hanya tujuh puluh atau seratus agar kalian tidak takut terlebih dahulu kepada mereka. Dia juga yang menjadikan jumlah kalian kurang dari 300 orang di mata orang-orang musyrik agar mereka tidak melakukan banyak persiapan untuk memerangi kalian dan setiap kelompok berani untuk berperang. Karena Allah hendak melakukan suatu urusan yang mesti dilaksanakan. Dan hanyalah kepada Allahlah dikembalikan segala urusan. Setiap orang akan diberi balasan atas segala amalnya. Ini semua adalah terjadi sebelum peperangan. Adapun setelah peperangan sesungguhnya Allah memperlihatkan kepada musuh bahwa jumlah tentara muslim sebanyak jumlah mereka agar mereka terperingatkan sebagaimana dalam surat Ali Imran 13"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah ketika Dia memperlihatkan mereka kepada kalian, ketika kalian berjumpa dengan mereka dalam penglihatan mata kalian itu berjumlah sedikit dan Dia memperlihatkan kalian berjumlah sedikit dalam penglihatan mereka supaya Allah melaksanakan suatu urusan yang harus terjadi. Hanya kepada Allah segala urusan dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43-44. Allah memperlihatkan ke dalam mimpi Rasululoh, bahwa orang-orang musyrik berjumlah sedikit, kemudian Rasululoh memberitahukan berita gembira itu kepada sahabat-sahabatnya, maka hati mereka pun menjadi tenang dan teguh. “Dan sekiranya Allah memperlihatkan mereka kepadamu (berjumlah) banyak.” Lalau kamu menyampaikan berita itu kepada sahabat-sahabatmu, “tentu saja mereka menjadi gentar tentu saja kamu akan berbantah-bantahan dalam urusan itu.” Di antara kamu ada yang berpendapat meneruskan perang, ada pula yang tidak berpendapat demikian, dan percekcokan adalah kekalahan. “Akan tetapi Allah telah menyelamatkan kamu.” Yakni melindungimu. “Sesungguhnya Allah Maha Mengetahui segela isi hati.” Yakni keteguhan, kekhawatiran, kejujuran, keteguhan, dan kedustaan yang ada padanya. Allah mengetahui apa yang ada di dalam hatimu yang membuatnya mengasihiMu, berlaku baik kepadamu, dan mebuktikan mimpi RasulNya. Allah menampakan kepada orang-orang Mukmin seakan-akan musuh-musuh mereka berjumlah sedikit. Masing-masing pasukan melihat musuhnya sedikit, agar masing-masing pasukan menyerang yang lain. “Karena Allah hendak melakukan suatu urusan yang mesti dilaksanakan.” Yakni, memberi kemenangan kepada kaum Muminin dan menimpakan kekalahan kepada orang kafir, serta membinasakan para pemimpin dan pembesar kekafiran mereka, sehingga tidak seorangpun dari mereka yang bisa di banggakan, sehingga setelah itu mereka mudah di ajak masuk islam, ia juga menjadi bukti kelembutan bagi yang lain yang Allah beri nikmat Islam. “Dan hanya kepada Allah-lah segala urusan dikembalikan.” Yakni, segala urusan makhluk kembali kepada Allah, maka Dia membedakan yang baik dan yang buruk, dan memutuskan urusan makhluk dengan adil tanpa sedikitpun kezhaliman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 44: Sekitar 70 atau 100 orang, padahal sesungguhnya jumlah mereka 1.000 orang lebih. Abdulah bin Mas’ud radhiyallahu 'anhu berkata, “Sungguh, mereka dijadikan sedikit dalam penglihatan kami pada perang Badar, sampai aku bertanya kepada seorang yang berada di sebelahku, “Apakah kamu melihat bahwa jumlah mereka 70 orang?” Ia menjawab, “Tidak, bahkan 100 orang.” Sampai kami menangkap salah seorang di antara mereka dan bertanya kepadanya (tentang jumlah mereka), ia menjawab, “Jumlah kami 1.000 orang.” (Diriwayatkan oleh Ibnu Abi Hatim dan Ibnu Jarir). Agar mereka tetap maju dan tidak mundur. Hal ini sebelum berkecamuknya peperangan, namun setelah berkecamuk maka ditampakkan-Nya kaum muslimin berjumlah dua kali lipat dari mereka sebagaimana disebutkan dalam surat Ali Imran ayat 13. Seperti menolong orang-orang mukmin dan mengecewakan orang-orang kafir, mematikan para tokoh dan pemimpin kesesatan sehingga pengikutnya mudah diajak kepada Islam, sekaligus sebagai kelembutan-Nya kepada orang-orang yang masih hidup. Semua urusan makhluk dikembalikan kepada Allah, kemudian Dia memisahkan yang baik dengan yang buruk dan menghukumi makhluk-makhluk-Nya dengan keputusan-Nya yang adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 44",
    "description": "Setelah menjelaskan apa yang dilihat oleh nabi dalam mimpi, maka pada ayat ini dijelaskan apa yang dilihat kaum muslim dengan mata kepala sendiri di medan perang. Ingatlah ketika Allah memperlihatkan mereka, orang-orang kafir, kepada kalian ketika kalian berjumpa dengan mereka seakan-akan berjumlah sedikit menurut penglihatan mata kalian di medan perang; dan kalian, wahai orang-orang mukmin, diperlihatkannya seakan-akan berjumlah sedikit menurut penglihatan mereka sebelum bertemu di medan pertempuran. Demikian itu karena Allah berkehendak melaksanakan suatu urusan yang harus dilaksanakan. Hanya kepada Allah segala urusan dikembalikan, sehingga tidak ada satu pun yang terlepas dari kehendak-Nya. Peristiwa perang badar seharusnya menguatkan mental dan keyakinan setiap orang mukmin bahwa Allah pasti menolong hamba-Nya yang memiliki keimanan yang benar, meski pertolongan itu datang dengan cara yang unik dan tidak masuk akalusai memaparkan kenikmatan yang Allah karuniakan kepada umat islam pada perang badar, seperti kemenangan dan ganimah, pada ayat ini Allah mengajarkan apa yang seharusnya dilakukan seorang mukmin saat menghadapi musuh. Wahai orang-orang yang beriman! apabila kamu bertemu pasukan musuh, maka berteguh hatilah dengan tetap menunjukkan keberanian setelah melakukan persiapan yang matang dan janganlah gentar apalagi melemah dalam membela kebenaran, dan sebutlah nama Allah banyak-banyak, yakni berzikir dan berdoalah semoga Allah memberikan kemenangan agar kamu beruntung."
  }
]