[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, bila kalian berhadapan dengan golongan dari pengikut kekafiran yang sungguh-sungguh telah bersiap memerangi kalian, maka bertahanlah kalian dan jangan mundur dari mereka. Dan ingatlah Allah banyak-banyak dengan memohon diturunkannya pertolongan pada kalian dan kemenangan atas musuh kalian, agar kalian beruntung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Wahai orang-orang yang percaya kepada Allah dan mengikuti rasul-Nya, apabila kalian berperang melawan sekumpulan orang-orang kafir, maka hadapilah mereka dengan gagah berani dan jangan takut. Banyak-banyaklah berzikir dan berdoa kepada Allah. Karena Dia lah yang sanggup menolong kalian untuk mengalahkan mereka agar kalian mendapatkan apa yang kalian inginkan dan terhindar dari apa yang kalian takutkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Setelah Allah menyebutkan kenikmatan-kenikmatan yang telah Dia berikan kepada Rasulullah dan orang-orang beriman pada Perang Badar, kemudian Allah menyebutkan adab-adab ketika bertemu musuh di medan perang; Dia berfirman: \"Jika kalian bertemu dengan musuh-musuh kalian yang kafir maka teguhkanlah diri kalian dan janganlah melarikan diri dari mereka; perbanyaklah dzikir kepada Allah dalam hati kalian ketika berperang dengan mengingat kuasa-Mya dan janji-Nya untuk menolong para rasul dan orang-orang beriman; taatilah Allah dalam segala perintah-Nya yang menjadi sebab kemenangan dalam perang dan dalam hal lainnya; dan taatilah Rasulullah karena dialah yang menjelaskan firman Allah dengan perkataan perbuatan, dan hukum; dia ikut serta bagi kalian dalam memberi pendapat dan pandangan dalam segala urusan. Dan janganlah saling berselisih, karena itu akan menjadi sebab kekalahan dan kelemahan, sehingga kalian dapat dikalahkan oleh musuh. Dan bersabarlah atas segala kesulitan yang kalian temui, yang berupa kekuatan dan jumlah musuh yang besar; Sesungguhnya Allah bersama orang-orang yang sabar, Dia memberi mereka pertolongan dan bantuan. Dan barangsiapa yang Allah adalah penolongnya maka tidak ada yang dapat mengalahkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. إِذَا لَقِيتُمْ فِئَةً (apabila kamu memerangi pasukan (musuh)) Apabila kalian memerangi sekelompok kaum musyrikin. فَاثْبُتُوا۟( maka berteguh hatilah kamu) Yakni teguhlah menghadapi mereka dan janganlah kalian takut. Dan bisa jadi keteguhan dalam menghadapi mereka hanya bisa diperoleh dengan membentuk siasat dan bergabung dengan pasukan lain. وَاذْكُرُوا۟ اللهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ(dan sebutlah Allah sebanyak-banyaknya agar kamu beruntung) Yakni sebutkanlah pertolongan, keagungan, dan kuasa-Nya ketika hati kalian sangat ketakutan karena dengan menyebut-Nya akan menjadi faktor yang membuat kalian berteguh hati. Berzikirlah menyebut-Nya dengan lisan kalian dan berdoalah kepada-Nya di saat itu sebagaimana para pasukan Thalut berdoa: “Ya Tuhan kami, tuangkanlah kesabaran atas diri kami dan kokohkanlah pendirian kami dan tolonglah kami terhadap orang-orang kafir”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45 Hai orang-orang yang beriman. apabila kamu memerangi pasukan musuh, maka berteguh hatilah kamu untuk memerangi mereka dan jangan gentar dan sebutlah nama Allah sebanyak-banyaknya agar kamu beruntung di dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila kalian bertemu dengan pasukan} pasukan kafir {maka teguhlah dan sebutlah (nama) Allah sebanyak-banyaknya agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah berfirman, “Hai, orang-orang yang beriman, apabila kamu memerangi musuh.” Yakni, sekelompok orang-orang kafir yang memerangi kamu, “maka berteguh hatilah”, dalam menghadapi mereka, gunakan kesabaran atas ketaatan besar ini, yang hasilnya adalah kemuliaan dan kemenangan, minta tolonglah dengan memperbanyak dzikir kepada Allah, “Agar kamu beruntung.” Yakni, kemenangan atas musuhmu yang kamu inginkan. Jadi, kesabaran, keteguhan dan memperbanyak dzikir kepada Allah adalah penyebab besar kemenangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 45: Tahanlah jiwamu dan bersabarlah di atas ketaatan yang besar ini, di mana akibatnya adalah kemuliaan dan kemenangan. Untuk memperoleh kesabaran di waktu ini caranya adalah dengan memperbanyak dzikrullah. Berdasarkan ayat ini, sabar, teguh hati dan banyak berdzikr merupakan sebab terbesar seseorang memperoleh kemenangan. Yakni memperoleh apa yang kamu inginkan berupa kemenangan atas musuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 45",
    "description": "Usai memaparkan kenikmatan yang Allah karuniakan kepada umat islam pada perang badar, seperti kemenangan dan ganimah, pada ayat ini Allah mengajarkan apa yang seharusnya dilakukan seorang mukmin saat menghadapi musuh. Wahai orang-orang yang beriman! apabila kamu bertemu pasukan musuh, maka berteguh hatilah dengan tetap menunjukkan keberanian setelah melakukan persiapan yang matang dan janganlah gentar apalagi melemah dalam membela kebenaran, dan sebutlah nama Allah banyak-banyak, yakni berzikir dan berdoalah semoga Allah memberikan kemenangan agar kamu beruntung. Bukan hanya itu, orang-orang mukmin juga diperintahkan agar senantiasa menghiasi diri dengan menaati Allah dan rasul-Nya. Dan taatilah Allah dan rasul-Nya dan janganlah kamu berselisih atau saling berdebat yang menyebabkan kamu menjadi gentar dan bahkan kekuatan kalian hilang sehingga tidak berdaya sama sekali; dan bersabarlah ketika menghadapi musuh dalam situasi dan kondisi apa pun. Sungguh, Allah beserta orang-orang sabar. Allah akan selalu menolong hamba-hambanya yang membela dan mempertahankan kebenaran dengan penuh kesabaran, kesungguhan, dan semata-mata didasari atas ketaatan kepada Allah dan rasul-Nya."
  }
]