[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berpegang teguhlah kalian untuk taat kepada Allah dan taat kepada rasulNya dalam seluruh keadaan kalian, dan janganlah kalian saling bersilang pendapat diantara kalian sehingga tercerai berai persatuan kalian dan bertentangan isi hati kalian, sehingga kalian akan melemah serta kekuatan dan kemenangan kalian akan sirna.Dan bersabarlah ketika mengahadpi musuh. Sesungguhnya Allah bersama orang-orang yang bersabar dengan bantuan, pertolongan dan dukunganNya, serta tidak akan menelantarkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan tetaplah taat kepada Allah dan taat kepada rasul-Nya dalam ucapan-ucapan, perbuatan-perbuatan, dan seluruh hal ihwal kalian. Dan janganlah kalian berselisih pendapat. Karena perselisihan akan membuat kalian menjadi lemah, takut, dan kehilangan kekuatan kalian. Dan bersabarlah ketika kalian berhadapan dengan musuh kalian. Sesungguhnya Allah bersama orang-orang yang bersabar dalam bentuk pertolongan, dukungan, dan bantuan. Dan barangsiapa yang Allah menyertai-Nya, maka ialah orang yang pasti meraih kemenangan dan mendapatkan pertolongan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَلَا تَنٰزَعُوا۟ فَتَفْشَلُوا۟ (dan janganlah kamu berbantah-bantahan, yang menyebabkan kamu menjadi gentar) Allah melarang mereka saling berselisih pendapat kerena itu menjadi sebab kekalahan dalam perang. وَتَذْهَبَ رِيحُكُمْ ۖ( dan hilang kekuatanmu) Makna (الريح) yakni kekuatan dan kemenangan. Dan mendapat lain mengatakan yakni negara yang pelaksanaan pemerintahannya diserupakan dengan hembusan angin."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sesungguhnya perpecahan akan melemahkan ummat yang telah kuat, dan akan mematikan ummat yang telah melemah { وَلَا تَنَازَعُوا فَتَفْشَلُوا وَتَذْهَبَ رِيحُكُمْ } \"dan janganlah kamu berbantah-bantahan, yang menyebabkan kamu menjadi gentar dan hilang kekuatanmu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46 Taatlah kepada Allah dan Rasul-Nya dalam hal perintah maupun larangan tanpa penyepelan. Janganlah kamu berbantah-bantahan, yang menyebabkan kamu menjadi gentar dan hilang kekuatanmu sehingga kalian tidak mendapatkan pertolongan. Serta bersabarlah atas kesempitan dan kesulitan perang. Sesungguhnya Allah beserta orang-orang yang sabar dengan memberi pertolongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Taatlah kepada Allah dan RasulNya, janganlah berbantah-bantahan} janganlah berselisih {sehingga kalian menjadi gentar} sehingga kalian merasa lemah dan pengecut {dan kekuatan kalian} kekuatan kalian {hilang dan bersabarlah. Sesungguhnya Allah bersama orang-orang yang sabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Dan taatlah kepada Allah dan RasulNya”, dalam melaksanakan perintah keduanya dan tetaplah demikian dalam segala kondisi. “dan janganlah kamu berbantah-bantahan”, dengan bantah-bantahan yang menyebabkan perpecahan hati-hati kalian “yang menyebabkan kamu menjadi gentar,” yakni takut, “dan hilang kekuatanmu.” Yakni, tekadmu melempem, kekuatanmu luruh, dan kemenangan yang dijanjikan kepadamu atas ketaatan kepada Allah dan rasulNya hilang lenyap. “dan bersabarlah,” di atas ketaatan kepada Allah. “sesungguhnya Allah beserta orang-orang yang sabar”, dengan pertolongan, dukungan , dan kemenangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 46: Dengan melakukan apa yang diperintahkan dan berjalan di belakangnya. Di atas ketaatan kepada Allah. Dengan memberikan pertolongan dan bantuan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 46",
    "description": "Bukan hanya itu, orang-orang mukmin juga diperintahkan agar senantiasa menghiasi diri dengan menaati Allah dan rasul-Nya. Dan taatilah Allah dan rasul-Nya dan janganlah kamu berselisih atau saling berdebat yang menyebabkan kamu menjadi gentar dan bahkan kekuatan kalian hilang sehingga tidak berdaya sama sekali; dan bersabarlah ketika menghadapi musuh dalam situasi dan kondisi apa pun. Sungguh, Allah beserta orang-orang sabar. Allah akan selalu menolong hamba-hambanya yang membela dan mempertahankan kebenaran dengan penuh kesabaran, kesungguhan, dan semata-mata didasari atas ketaatan kepada Allah dan rasul-Nya"
  }
]