[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian ketika setan memperindah pandangan kaum musyrikin terhadap motivasi mereka datang dan apa yang hendak mereka perbuat. Ia berkata kepada mereka, ” tidak ada seorangpun yang bisa mengalahkan kalian hari ini. Dan sesungguhnya aku akan menjadi penolong bagi kalian.” maka ketika dua pasukan telah saling berhadapan; yaitu kaum musyrikin beserta setan mereka dan kaum muslimin bersama para malaikat, setan mundur kabur kebelakang, sambil berkata kepada kaum musyrikin, ”sesungguhnya aku berlepas diri dari kalian dan sesungguhnya aku melihat apa yang kalian tidak lihat, yatu para malaikat yang datang sebagai bala bantuan bagi kaum muslimin. Dan sesungguhnya aku takut kepada Allah.” maka setan membiarkan mereka dan berlepas diri dari mereka. Dan Allah maha dahsyat siksaanNya bagi orang-orang yang durhaka kepadaNya dan tidak bertaubat dengan taubat nasuha."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan ingatlah -wahai orang-orang mukmin- sebagian dari nikmat yang Allah berikan kepada kalian, yaitu ketika setan membuat perbuatan orang-orang musyrik terlihat baik di mata mereka sehingga memotivasi mereka untuk berhadapan dan berperang melawan orang-orang Islam, dan berkata kepada mereka, “Tidak ada yang dapat mengalahkan kalian pada hari ini. Dan aku benar-benar akan menolong kalian dan melindungi kalian dari musuh kalian.” Kemudian tatkala kedua kelompok itu bertemu maka kelompok orang-orang mukmin diiringi oleh para malaikat yang akan membantu mereka, sedangkan kelompok orang-orang musyrik diiringi oleh setan yang akan menelantarkan mereka. Setan akan melarikan diri (dari medan perang) dan berkata kepada orang-orang musyrik, “Sesungguhnya aku berlepas diri dari kalian. Sesungguhnya aku melihat malaikat-malaikat yang datang untuk membantu orang-orang mukmin, aku takut Allah akan membinasakanku, dan hukuman Allah sangat pedih, sehingga tidak ada seorang pun yang mampu bertahan dengan hukuman-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Hai Rasulallah, sampaikanlah kepada orang-orang beriman ketika setan menghiasi amalan orang-orang musyrik dengan godaannya, dan menggambarkan bagi mereka bahwa mereka tidak akan terkalahkan karena memiliki jumlah dan bekal yang banyak, serta menjadikan mereka menyangka bahwa dia akan menolong mereka. Namun ketika dua pasukan itu sudah semakin dekat sehingga dapat saling melihat sebelum mereka saling bertempur, ternyata setan itu mundur dan berlepas diri dari mereka, karena melihat Allah telah menurunkan pertolongannya dengan mengutus para malaikat bagi orang-orang beriman. Allah menutup ayat ini dengan firman-Nya: \"Dan Allah sangat keras siksaannya\". Dan yang dimaksud adalah bahwa termasuk dari ketakutan kepada Allah adalah khawatir Jika Allah menimpakan keburukan kepada dirinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَإِذْ زَيَّنَ لَهُمُ الشَّيْطٰنُ أَعْمٰلَهُمْ (Dan ketika syaitan menjadikan mereka memandang baik pekerjaan mereka) Setan menjadikan mereka mengira bahwa mereka telah melakukan kebaikan dengan memerangi orang-orang beriman. Diriwayatkan bahwa setan menyerupa menjadi seseorang dari mereka kemudian berkata kepada mereka: “Tidak ada seorang manusiapun yang dapat menang melawan kalian pada hari ini, dan sesungguhnya saya ini adalah pelindung kalian”. لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّى جَارٌ لَّكُمْ ۖ (Tidak ada seorang manusiapun yang dapat menang terhadapmu pada hari ini, dan sesungguhnya saya ini adalah pelindungmu) Yakni pelindung kalian dari setiap musuh, atau dari kaum Bani Kinanah. Setan menyerupa menjadi Suraqah bin Malik bin Ja’syam, salah seorang dari bani Bakar bin Kinanah, dan dahulu kaum Quraisy takut bani Bakar akan menyerang mereka dari belakang. فَلَمَّا تَرَآءَتِ الْفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيْهِ (Maka tatkala kedua pasukan itu telah dapat saling lihat melihat (berhadapan), syaitan itu balik ke belakang) Yakni mundur kebelakang. وَقَالَ إِنِّى بَرِىٓءٌ مِّنكُمْ(seraya berkata: “Sesungguhnya saya berlepas diri daripada kamu) Yakni setan berlepas diri dari mereka setelah melihat tanda-tanda kemenangan kaum muslimin dengan bala bantuan malaikat yang diturunkan Allah, dan ia mengungkapkan alasan ia berlepas diri dengan mengatakan “sesungguhnya aku dapat melihat apa yang tidak dapat kalian lihat”. إِنِّىٓ أَرَىٰ مَا لَا تَرَوْن(sesungguhnya saya dapat melihat apa yang kamu sekalian tidak dapat melihat) Yakni setan melihat Jibril bersama malaikat. إني أخاف الله (sesungguhnya aku takut kepada Allah) Setan yakut akan ditimpa sesuatu yang tidak ia inginkan dari malaikat yang mengikuti peperangan. Pendapat lain mengatakan bahwa setan melihat bahwa ia dan kaum musyrikin tidak memiliki kemampuan untuk mengalahkan kaum muslimin, sehingga ia beralasan untuk mundur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48 Ingatlah ketika syaitan menjadikan orang musyrik memandang baik atas pekerjaan mereka berupa keluar rumah untuk memerangi orang muslim dan berkata dalam hati mereka: “Tidak ada seorang manusiapun yang dapat menang atas kalian pada hari ini sebab kekuatan dan jumlah pasukan serta senjata kalian, sesungguhnya aku ini adalah pelindung dan penolongmu dari setiap musuh”. Maka tatkala kedua pasukan mukmin dan kafir itu saling berhadapan di medan pertempuran, syaitan itu balik ke belakang seraya berkata: “Sesungguhnya saya berlepas diri dari kalian, sesungguhnya saya dapat melihat apa yang kamu sekalian tidak dapat melihat. Yaitu para malaikat yang datang untuk menolong orang-orang mukmin; sesungguhnya aku takut kepada Allah bahwa Dia akan membinasakanku”. Allah sangat keras siksa-Nya kepada mereka yang membangkang dan durhaka atas perintah-Nya. Syaitan telah datang kepada kaum Qurays dengan perwujudan Saraqah bin Malik dari Bani Bakr bin Kinanah. Sesungguhnya kaum Qurays takut jika Bani Bakr menghalangi mereka dari belakang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika setan menghiasi} membuat indah {bagi mereka perbuatan-perbuatan mereka dan mengatakan,“Tidak ada yang dapat mengalahkan kalian pada hari ini dan sesungguhnya aku adalah penjaga kalian.”} penjaga dan penyelamat {Maka ketika kedua pasukan itu telah saling melihat} saling bertemu {setan berbalik ke belakang} berpaling lari {dan berkata,“Sesungguhnya aku berlepas diri dari kalian, sesungguhnya aku melihat apa yang tidak kalian lihat. Sesungguhnya aku takut kepada Allah.” Allah sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Dan ketika setan menjadikan mereka memandang baik pekerjaan mereka,” menjadikannya indah dalam hati mereka dan menipunya, “dan mengatakan, ‘Tidak ada seorang manusia pun yang dapat mengalahkanmu pada hari ini,” karena kamu dengan jumlah, senjata dan kondisi yang mana Muhammad dan teman-temannya tidak mampu melawanmu. “Dan sesungguhnya saya ini adalah pelindungmu.” Dari siapa pun yang kamu takutkan keburukannya, karena iblis menampakkan diri dalam wujud Suraqah bin Malik bin Ju’syum al-Mudliji, dan mereka takut kepada Bani Mudlij karena adanya permusuhan di antara mereka. Setan berkata kepada mereka, “Aku lah pelindungmu.” Maka tenanglah mereka dan hadir dengan kesombongan dan keyakinan menang. “Maka tatkala kedua pasukan itu telah dapat saling melihat (berhadapan)”, pasukan Muslimin dan pasukan kafirin, lalu tiba-tiba setan melihat Jibril memimpin pasukan malaikat, maka ia sangat ketakutan. “setan itu balik ke belakang”, yakni lari terbirit-birit “seraya berkata”, kepada orang yang ia tipu dan perdayai. “Sesungguhnya saya berlepas diri darimu, sesungguhnya saya dapat melihat apa yang kamu sekalian tidak dapat melihat.” Yakni aku melihat malaikat yang tak seorang pun sanggup melawannya. “Sesungguhnya saya takut kepada Allah.” Yakni takut akan menyegerakan azab kepadaku di dunia. “Dan Allah sangat keras siksaNya.” Ada kemungkinan setan telah menipu mereka dan membisikkan di dalam dada mereka bahwa mereka tidak akan dikalahkan oleh manusia siapa pun, dan bahwa ia melindungi mereka. Ketika ia berhasil menggiring ke medan perang, maka ia berlepas diri dari mereka dan meninggalkan mereka, sebagaimana Allah berfirman, (Bujukan orang-orang munafik itu adalah) seperti (bujukan) shaitan ketika dia berkata kepada manusia: \"Kafirlah kamu\", maka tatkala manusia itu telah kafir, maka ia berkata: \"Sesungguhnya aku berlepas diri dari kamu, karena sesungguhnya aku takut kepada Allah, Rabb semesta Alam\". Maka adalah kesudahan keduanya, bahwa sesungguhnya keduanya (masuk) ke dalam neraka, mereka kekal di dalamnya. Demikianlah balasan orang-orang yang zalim. (Al-Hasyr:16-17)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 48: Yaitu Iblis. Yakni karena kamu berjumlah besar dan telah menyiapkan persenjataan yang lengkap, oleh karena itu Nabi Muhammad dan para pengikutnya tidak akan sanggup menghadapimu. Terhadap orang yang kamu khawatirkan bahayanya. Ketika itu Iblis menampakkan diri kepada orang-orang Quraisy sebagai Suraqah bin Malik bin Ju’syam tokoh Bani Madlaj, di mana mereka (orang-orang Quraisy) takut kepada Bani Madlaj karena permusuhan yang terjadi di antara mereka. Bisa juga maksudnya, bahwa Iblis membujuk mereka dan membisikkan mereka bahwa “Tidak ada yang dapat mengalahkan kamu”, wallahu a’lam. Karena melihat malaikat, terutama malaikat Jibril yang merapihkan para malaikat. Dari sini diketahui, bahwa Iblis suka mengingkari janji, dan bahwa janji-janjinya adalah dusta sehingga janganlah kita tergoda olehnya. Dalam ayat lain disebutkan, “(Bujukan orang-orang munafik itu adalah) seperti (bujukan) setan ketika dia berkata kepada manusia, \"Kafirlah kamu\", maka ketika manusia itu telah kafir, ia berkata, \"Sesungguhnya aku berlepas diri dari kamu, karena sesungguhnya aku takut kepada Allah, Rabb semesta alam\"--Maka kesudahan keduanya adalah, bahwa keduanya (masuk) ke dalam neraka, mereka kekal di dalamnya. Demikianlah balasan orang-orang yang zalim.” (Terj. Al Hasyr: 16-17) Jika Dia segera menimpakan hukuman kepadaku di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 48",
    "description": "Setelah beberapa ayat sebelumnya memaparkan berbagai hal yang terkait dengan perang badar, maka ayat ini menjelaskan kebohongan janji setan terhadap kaum musyrik pada perang badar tersebut. Ingatlah ketika setan menjadikan terasa atau terlihat indah bagi mereka, orangorang musyrik, perbuatan dosa mereka, yakni berperang melawan kebenaran dan seraya mengatakan, tidak ada seorang pun yang dapat mengalahkan kalian, wahai orang-orang musyrik, pada hari ini, yakni perang badar. Dan kalau ada yang berani melawan kalian, sungguh, aku adalah penolongmu. Maka ketika kedua pasukan itu telah saling melihat, berhadapan, setan berbalik ke belakang meninggalkan kaum musyrik seraya berkata, sesungguhnya aku berlepas diri dari kalian; aku dapat melihat apa yang kalian tidak dapat melihatnya; yakni para malaikat yang turun membantu kaum mukmin, sesungguhnya aku takut kepada Allah. Demikian ini, disebabkan Allah sangat keras siksa-Nyakaum munafik senantiasa menghina kaum mukmin yang tetap berangkat perang meski jumlah lawan jauh lebih banyak. Ingatlah, ketika orang-orang munafik di madinah dan orang-orang yang ada penyakit di dalam hatinya, yakni orang-orang islam yang belum mantap keimanannya sehingga tidak ikut hijrah ke madinah, berkata, ketika menyaksikan jumlah pasukan mukmin sangat sedikit dibanding jumlah pasukan ka-um musyrik, mereka itu, orang-orang mukmin, ditipu oleh agamanya dengan tetap berperang. Mereka mengira hanya dengan bekal iman dan takwa akan memperoleh kemenangan. Katakanlah, wahai rasul, barang siapa bertawakal kepada Allah dengan disertai usaha yang sung-guh-sungguh, maka ketahuilah bahwa Allah akan membela bahkan mem-berinya kemenangan, sebab Allah mahaperkasa lagi mahabijaksana."
  }
]