[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian ketika orang-orang yang dipenuhi keraguan dan kemunafikan dan orang-orang yang memiliki hati yang sakit, dan mereka melihat jumlah kaum muslimin yang sedikit dan banyak jumlah musuh mereka berkata, ”Kaum muslimin terpedaya oleh agama mereka, sehingga mengantarakan mereka ke tempat-tempat ini.” Orang-orang munafik tidak tahu bahwa sesungguhnya orang yang bertawakal dan yakin dengan janjiNya, maka sesungguhnya Allah tidak akan menelantarkannya dan sesungguhnya Allah Mahaperkasa, tidak dapat dilemahkan oleh apapun, lagi maha bijaksana dalam pengaturan dan tindakanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan ingatlah ketika orang-orang munafik dan orang-orang yang lemah iman berkata, “Orang-orang Islam itu tertipu oleh agama mereka yang menjanjikan kepada mereka kemenangan atas musuh-musuh mereka meskipun jumlah mereka sedikit dan peralatan perang mereka tidak kuat, sedangkan musuh-musuh mereka berjumlah banyak dan peralatan perangnya sangat kuat.” Mereka tidak tahu bahwa orang yang bersandar hanya kepada Allah yakin akan pertolongan yang dijanjikan oleh-Nya, sesungguhnya Allah benar-benar akan menolong mereka dan tidak akan menelantarkan mereka, betapa pun lemahnya diri mereka. Dan Allah Maha Perkasa, tidak ada yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menetapkan takdir dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Dan ketika setan menghiasi amal mereka sehingga orang-orang munafik dan orang-orang yang serupa dengan mereka berkata: \"Tidaklah ada yang membuat orang-orang beriman memiliki keberanian seperti itu padahal jumlah mereka sangat sedikit dan musuh mereka sangat banyak, melainkan karena mereka tertipu oleh agama mereka.\" Dan barangsiapa yang menyerahkan urusannya kepada Allah dan beriman bahwa Dia adalah penolongnya yang tidak terkalahkan oleh apapun dan tidak ada yang dapat menghalangi kehendak-Nya, maka Allah akan mengabulkan harapannya dan menolongnya atas musuh-musuh, meskipun mereka memiliki jumlah dan bekal yang banyak. Dia Maha Perkasa dan Kuasa atas urusan-Nya, dan Maha Bijaksana yang menetapkan segala urusan sesuai dengan sunnah kauniyah-Nya, yang di antaranya adalah menolong kebenaran atas kebatilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. إِذْ يَقُولُ الْمُنٰفِقُونَ (berkata ketika orang-orang munafik) Mereka adalah orang-orang yang menampakkan keimanan dan menyembunyikan kekafiran dalam diri mereka. وَالَّذِينَ فِى قُلُوبِهِم مَّرَضٌ (dan orang-orang yang ada penyakit di dalam hatinya) Mereka adalah orang-orang yang masih ragu terhadap Islam namun tidak memiliki sifat kemunafikan, karena mereka adalah orang-orang yang baru masuk Islam. غَرَّ هٰٓؤُلَآءِ دِينُهُمْ ۗ (Mereka itu (orang-orang mukmin) ditipu oleh agamanya) Sehingga memaksakan diri untuk memerangi kaum Quraisy padahal mereka tidak memiliki kekuatan. وَمَن يَتَوَكَّلْ عَلَى اللهِ فَإِنَّ اللهَ عَزِيزٌ حَكِيمٌ(Barangsiapa yang bertawakkal kepada Allah, maka sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana) Yakni tidak akan dikalahkan oleh orang yang ingin mengalahkan-Nya dan tidak menghinakan orang yang bertawakkal kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49 Ingatlah ketika orang-orang munafik yaitu orang yang menampakkan keimanan dan menyembunyikan kekufuran. Juga orang-orang yang mempunyai penyakit di dalam hatinya atau lemah imannya mereka orang yang ragu secara terang-terangan atas kejadian janji atas mereka dalam Islam berkata: “Mereka itu orang-orang mukmin sudah tertipu oleh agamanya, mereka meyakini bahwa mereka akan memperoleh pertolongan sebab menolong agama mereka. Meskipun mereka berjumlah sedikit dan tidak begitu kuat katakanlah kepada mereka wahai Rasul (Allah berfirman): “Barangsiapa yang bertawakkal kepada Allah, maka sesungguhnya Allah akan meneguhkan hatinya, mengalahkan musuhnya, sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana dalam segala perbuatan-Nya maka Dia akan menyulitkan musuh-musuhNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika orang-orang munafik dan orang-orang yang dalam hatinya ada penyakit} lemah iman {berkata,“Mereka itu ditipu} tertipu {oleh agama mereka.” Siapa saja yang bertawakal} bergantung {kepada Allah, sesungguhnya Allah Maha perkasa lagi Maha bijaksana.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “(Ingatlah), ketika orang-orang munafik dan orang-orang yang ada penyakit di dalam hatinya berkata,“ yakni keraguan dan syubhat dari orang-orang yang lemah iman terhadap orang-orang yang beriman ketika mereka pergi berperang dengan jumlah minim melawan orang-orang musyrik dengan jumlah yang besar, “Mereka itu (orang-orang Mukmin) ditipu oleh agamanya.” Yakni agama yang mereka anut menggiring mereka ke medan perang ini yang mana mereka tidak memiliki kemampuan dan kekuatan untuk memenangkannya. Orang-orang munafik itu mengatakannya untuk melecehkan orang-orang Mukmin dan menghina akal mereka padahal justru orang-orang munafik itulah –demi Allah- orang-orang yang bodoh akal dan pikirannya. Karena keimanan akan mewajibkan pemiliknya maju menghadapi perkara-perkara besar yang tidak dihadapi oleh pasukan-pasukan besar karena seorang Mukmin yang bertawakal kepada Allah yang mengetahui bahwa tidak ada daya, kekuatan, dan kemampuan bagi siapa pun kecuali dengan pertolongan Allah, dan seandainya seluruh mahkluk bersepakat untuk memberi manfaat sedikit saja kepada seseorang, niscaya mereka tidak mampu melakukannya, begitu pula jika mereka bersepakat untuk memudaratkannya niscaya mereka tidak mampu memudaratkannya, kecuali dengan sesuatu yang telah Allah tulis atasnya, dan dia mengetahui bahwa dia di atas kebenaran, bahwa Allah Mahabijaksana lagi Maha Penyayang dalam semua takdir dan keputusanNya, maka dia tidak akan peduli dengan kekuatan dan jumlah yang dia hadapi, dia percaya diri kepada Rabbnya, tenang tanpa rasa takut dan cemas. Oleh karena itu Allah berfirman, “Barangsiapa yang tawakal kepada Allah, maka sesungguhnya Allah Mahaperkasa lagi MahaBijaksana.” Tak ada kekuatan yang dapat mengalahkannya, “lagi Mahabijaksana”, dalam keputusanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 49: Yakni lemahnya keyakinan. Karena berangkat melawan musuh yang banyak dalam jumlah sedikit. Maka dia akan menang. Hal itu, karena jika sekiranya manusia berkumpul untuk memberikan manfaat kepada seseorang meskipun sedikit niscaya mereka tidak akan mampu kecuali sesuai yang ditetapkan Allah Ta’ala, dan jika sekiranya mereka berkumpul untuk menimpakan bahaya, niscaya mereka tidak akan mampu kecuali sesuai yang ditetapkan Allah Ta’ala. Tidak ada yang dapat mengalahkan-Nya. Dalam tindakan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 49",
    "description": "Kaum munafik senantiasa menghina kaum mukmin yang tetap berangkat perang meski jumlah lawan jauh lebih banyak. Ingatlah, ketika orang-orang munafik di madinah dan orang-orang yang ada penyakit di dalam hatinya, yakni orang-orang islam yang belum mantap keimanannya sehingga tidak ikut hijrah ke madinah, berkata, ketika menyaksikan jumlah pasukan mukmin sangat sedikit dibanding jumlah pasukan ka-um musyrik, mereka itu, orang-orang mukmin, ditipu oleh agamanya dengan tetap berperang. Mereka mengira hanya dengan bekal iman dan takwa akan memperoleh kemenangan. Katakanlah, wahai rasul, barang siapa bertawakal kepada Allah dengan disertai usaha yang sung-guh-sungguh, maka ketahuilah bahwa Allah akan membela bahkan mem-berinya kemenangan, sebab Allah mahaperkasa lagi mahabijaksana. Ayat sebelumnya menjelaskan sikap angkuh kaum musyrik dalam perang badar, pada satu sisi, dan sikap orang-orang munafik yang berusaha melemahkan mental kaum mukmin sebelum berperang, pada sisi yang lain. Ayat ini menginformasikan kondisi mereka pada saat menghadapi maut. Sekiranya kamu melihat kaum musyrik dan munafik pada perang badar pasti akan memunculkan kengerian, yaitu ketika para malaikat mencabut nyawa orang-orang kafir sambil memukul wajah dan punggung mereka, yakni mereka dibantai oleh kaum mukmin di medan perang; dan dikatakan kepada mereka, rasakanlah oleh kalian siksa neraka yang membakar di akhirat kelak."
  }
]