[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya kamu (wahai rasul) menyaksikan langsung bagaimana para malaikat mencabut nyawa-nyawa orang-orang kafir dan menariknya, mereka memukuli wajah-wajah orang-orang kafir ketika mereka maju, dan memukuli punggung-punggung mereka ketika melarikan diiri dan seraya berkata kepada mereka, ”Rasakanlah siksaan yang membakar ini,” tentulah kamu menyaksikan perkara yang sangat menakutkan.Dan rangkaian redaksi ayat ini, sekalipun sebabnya adalah perang badar, tetapi ia berlaku umum pada setiap orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan sekiranya kamu -wahai Rasul- menyaksikan pemandangan ketika malaikat maut mencabut nyawa orang-orang yang ingkar kepada Allah dan rasul-Nya sambil memukul wajah mereka ketika mereka menghadap ke arahnya dan memukul pantat mereka ketika mereka mencoba melarikan diri. Dan malaikat maut berkata kepada mereka, “Rasakanlah -wahai orang-orang kafir- azab yang membakar ini.” Sekiranya kamu menyaksikan peristiwa itu niscaya hal itu akan menjadi sesuatu yang sangat besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50-51. Hai Muhammad, Seandainya kamu melihat keadaan orang-orang kafir ketika dimatikan oleh malaikat dengan mencabut nyawa mereka dari jasad, dan memukul wajah dan tengkuk mereka seraya berkata: “Rasakanlah azab neraka yang dahulu kalian dustakan”; niscaya kamu akan melihat pemandangan besar saat orang kafir berhenti dari kekafirannya dan orang zalim berhenti dari kezalimannya karena telah mengetahui akibat dari perbuatan itu. Azab yang kalian Rasakan ini adalah akibat dari perbuatan buruk berupa kekafiran dan kezaliman yang dilakukan tangan kalian ketika di dunia. Allah tidak menzalimi seorangpun dari hamba-nya, sehingga Dia tidak mengazab seseorang kecuali karena kejahatannya, dan tidak menyiksa seseorang kecuali karena kemaksiatannya, sedangkan kemaksiatan itu berasal dari kalian, maka kalianlah sebenarnya yang menzalimi diri kalian sendiri, maka salahkanlah diri kalian itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. إِذْ يَتَوَفَّى الَّذِينَ كَفَرُوا۟ ۙ الْمَلٰٓئِكَةُ يَضْرِبُونَ وُجُوهَهُمْ (ketika para malaikat mencabut jiwa orang-orang yang kafir seraya memukul muka mereka) Mereka adalah orang-orang yang dibunuh malaikat di perang Badar. Yakni seandainya kamu melihat hal itu niscaya kamu akan melihat suatu kejadian yang besar. Pendapat lain mengatakan bahwa pukulan malaikat ini ketika orang-orang kafir telah mati. Dan pendapat lain mengatakan yakni ketika di hari kiamat saat para malaikat menggiring mereka ke neraka. وَذُوقُوا۟ عَذَابَ الْحَرِيقِ (Rasakanlah olehmu siksa neraka yang membakar) Yakni para malaikat berkata kepada mereka “rasakanlah azab yang membakar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50 Kalau kamu melihat ketika para malaikat mencabut jiwa orang-orang yang kafir maka engkau akan melihat sesuatu hal yang sungguh menakutkan, mereka memukul muka dan pungguh mereka dengan besi. Ruh mereka dicabut dengan keras. Para malaikat berkata: “Rasakanlah siksamu di neraka yang membakar”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya kamu melihat} jika kamu melihat whai Muhammad {ketika para malaikat mematikan} mencabut nyawa {orang-orang yang kafir sambil memukul wajah-wajah dan punggung-punggung mereka, Rasakanlah siksa yang membakar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah berfirman, “Kalau kamu melihat”, orang-orang yang kafir terhadap ayat-ayat Allah, ketika malaikat yang bertugas mencabut nyawa mewafatkan mereka, mereka sangat takut, sangat cemas, sementara para malaikat itu “memukul muka dan belakang mereka.” Para malaikat berkata kepada mereka, “Keluarkan nyawamu.” Padahal nyawa mereka sangat sulit dikeluarkan, karena ia mengetahui azab yang pedih yang ada di depannya. Oleh karena itu malaikat berkata, “Rasakanlah olehmu siksa neraka yang membakar’.” Yakni siksa keras lagi panas membakar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 50: Tentu kamu akan menyaksikan peristiwa yang mengerikan. Para malaikat mencabut nyawa orang-orang kafir sambil berkata, “Keluarlah kamu”, namun ruh mereka tidak mau keluar karena mengetahui akan memperoleh azab yang pedih, lalu ditariklah ruh tersebut dengan keras. Yang demikian merupakan sunnatullah yang berlaku pada orang-orang terdahulu maupun yang kemudian, yaitu dengan menghukum mereka disebabkan dosa-dosanya sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 50",
    "description": "Ayat sebelumnya menjelaskan sikap angkuh kaum musyrik dalam perang badar, pada satu sisi, dan sikap orang-orang munafik yang berusaha melemahkan mental kaum mukmin sebelum berperang, pada sisi yang lain. Ayat ini menginformasikan kondisi mereka pada saat menghadapi maut. Sekiranya kamu melihat kaum musyrik dan munafik pada perang badar pasti akan memunculkan kengerian, yaitu ketika para malaikat mencabut nyawa orang-orang kafir sambil memukul wajah dan punggung mereka, yakni mereka dibantai oleh kaum mukmin di medan perang; dan dikatakan kepada mereka, rasakanlah oleh kalian siksa neraka yang membakar di akhirat kelak. Azab Allah yang demikian dahsyat itu disebabkan oleh perbuatan tangan kalian sendiri. Dan sesungguhnya Allah sama sekali tidak menzalimi masing-masing dari hamba-hamba-Nya. Sebab, turunnya azab Allah sebagai akibat perilaku manusia merupakan perwujudan dari keadilan-Nya."
  }
]