[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan (kekalahan) yang menimpa kalian wahai kaum musyrikin di perang badar itu disebabkan oleh perbuatan-perbuatan buruk mereka sendiri, dan Allah tidak menzhalimi siapapun dari makhlukNya sebesar biji sawi sekalipun.Akan tetapi, itu merupakan keputusan adil yang tidak ada unsur kecurangan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Azab yang sangat menyakitkan ketika nyawa kalian -wahai orang-orang kafir- dicabut, azab yang membakar di dalam kubur dan di akhirat itu penyebabnya ialah amal perbuatan kalian sendiri selama di dunia. Dan Allah tidak akan berbuat zalim kepada manusia. Dia benar-benar akan memutuskan perkara mereka secara adil. Karena Dia lah Yang Maha Memutuskan perkara lagi Mahaadil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. ذٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ (Demikian itu disebabkan oleh perbuatan tanganmu sendiri) Yakni kejadian itu disebabkan perbuatan maksiat yang kalian lakukan dan dosa-dosa yang telah kalian lakukan dan disebabkan Allah tidak menzalimi hamba-hamba-Nya karena Allah telah mengutus para Rasul kepada mereka, menurunkan kitab-kitab-Nya, dan menerangkan jalan yang benar bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kotornya maksiat yang tertumpuk dalam hati manusia karena buruknya syahwatnya adalah penghalang bagi hati untuk menjadi lebih bersih dan suci, sehingga kebenaran akan sukar nampak karena kegelapan yang telah menutupi { ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ } \"Demikian itu disebabkan oleh perbuatan tanganmu sendiri. Sesungguhnya Allah sekali-kali tidak menganiaya hamba-Nya\". 2 ). Satu tahun itu bagaikan sebuah pohon, dan bulan-bulan adalah cabangnya yang menjulang tinggi, dan hari-hari adalah tangkainya, dan jam-jam adalah daunnya, dan nafas-nafas adalah buahnya. Maka barangsiapa yang nafasnya berada pada ketaatan; niscaya buah pohonya akan baik, tetapi barangsiapa yang nafasnya berada pada kemaksiatan, sungguh buah yang akan dihasilkan adalah seperti buah hanzhol, kemudian masa panennya akan terjadi pada hari kemudian, dan ketika itupun akan jelas manis dan pahitnya buah itu, { ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51 Azab itu adalah azab yang nyata untuk musyrik Qurays dalam perang Badr disebabkan oleh perbuatan tangan mereka sendiri berupa kekafiran, zalim kepada orang mukmin dan bermaksiat. Juga sebab bahwa Allah tidak akan mendholimi hamba-Nya sedikitpun.Allah bahkan telah menurunkan kitab dan mengutus Rasul untuk memberi petunjuk kepada mereka namun mereka berpaling"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu, disebabkan oleh apa yang diperbuat} apa yang dilakukan {tangan kalian dan sesungguhnya Allah tidak menzalimi hamba-hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Azab ini menimpamu bukan karena kezhaliman dan ketidakadilan dari Rabbmu, akan tetapi akibat dari kemaksiatan yang kamu lakukan yang berakibat seperti yang kamu rasakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 51: Digunakan kata “tangan” karena pada umumnya perbuatan manusia dilakukan oleh tangannya. Yakni Dia tidak akan menyiksa hamba-Nya tanpa dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 51",
    "description": "Azab Allah yang demikian dahsyat itu disebabkan oleh perbuatan tangan kalian sendiri. Dan sesungguhnya Allah sama sekali tidak menzalimi masing-masing dari hamba-hamba-Nya. Sebab, turunnya azab Allah sebagai akibat perilaku manusia merupakan perwujudan dari keadilan-Nyapenentangan mereka terhadap rasulullah itu serupa dengan sikap pengikut fir'aun dalam memperlakukan nabi musa dan orang-orang yang sebelum mereka seperti kaum nabi nuh, kaum 'ad, samud, lut, dan lain-lain, terhadap para rasul mereka. Mereka mengingkari ayat-ayat Allah, baik yang tersebar di alam raya (tidak tertulis) maupun kebenaran yang dibawa oleh para rasul, maka Allah menyiksa mereka dengan bentuk azab yang berbeda-beda, seperti banjir bandang, gempa bumi, angin kencang, halilintar dan lain-lain. Itu semua disebabkan dosadosanya yang telah menjadi budaya masyarakat sehingga mengancam kehidupan manusia yang lain. Sungguh, Allah mahakuat lagi sangat keras siksa-Nya sehingga tidak ada seorang pun yang bisa lari darinya."
  }
]