[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya apa yang menimpa kaum musyrikin pada hari itu merupakan sunnatullah dalam menghukum orang-orang yang berbuat melampaui batas dari umat-umat terdahulu, semisal fir’aun dan orang-orang zhalim sebelumnya, ketika mereka mendustakan rasul-rasul Allah dan mengingkari ayat-ayatNya.Sesungguhnya Allah menimpakan pada mereka siksaanNya disebabkan dosa-dosa mereka. Sesunggguhnya Allah mahakuat, tidak dapat dipaksa, amat dahsyat siksaanNya bagi orang-orang yang mendurhakaiNya dan tidak bertaubat dari dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan azab yang menimpa orang-orang kafir itu tidak hanya menimpa mereka saja, melainkan merupakan sunatullah yang berlaku bagi orang-orang kafir kapan saja dan di mana saja. Karena azab itu telah menimpa keluarga Fir’aun dan umat-umat sebelum mereka ketika mereka ingkar kepada ayat-ayat Allah -Subḥānahu-. Maka Allah menghukum mereka disebabkan karena dosa-dosa mereka dengan hukuman yang sesuai dengan sifat-Nya sebagai Rabb Yang Maha Perkasa lagi Mahakuasa. Kemudian Allah benar-benar menurunkan hukuman-Nya kepada mereka. Sesungguhnya Allah Mahakuat, tidak ada yang dapat memaksa-Nya dan tidak ada yang dapat mengalahkan-Nya, lagi Mahakeras hukuman-Nya bagi orang yang durhaka kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Kebiasaan orang-orang musyrik Quraisy yang terbunuh pada perang Badar seperti kebiasaan para pengikut Fir’aun dan umat-umat terdahulu yang lain. Mereka mengingkari ayat-ayat Allah, sehingga Allah menyiksa mereka akibat dosa-dosa mereka dengan siksaan yang dahsyat; Allah sama sekali tidak menzalimi mereka sedikitpun. Dan Allah menolong para Rasul-Nya dan orang-orang beriman yang bersama mereka. Ketetapan Allah terhadap kaum-kaum itu dengan memberi mereka azab, sebagaimana ketetapan-Nya terhadap kaum Quraisy; Allah menolong Rasulullah dan orang-orang beriman, serta mengazab orang-orang kafir. Allah Maha Kuat, sehingga tidak ada yang dapat mengalahkan-Nya, dan Dia sangat keras siksaan-Nya bagi orang yang berhak mendapatkannya dan ingkar terhadap ayat-ayat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. كَدَأْبِ ءَالِ فِرْعَوْنَ ۙ ((keadaan mereka) serupa dengan keadaan Fir’aun dan pengikut-pengikutnya) Setelah Allah menyebutkan apa yang Dia turunkan untuk para pasukan perang Badar, Allah melanjutkannya dengan menyebutkan hal yang menunjukkan bahwa kejadian di perang badar merupakan sunnatullah yang belaku bagi golongan orang-orang kafir. Makna dari (الدأب) yakni hal yang senantiasa berlangsung. Dan azab yang berlangsung pada orang-orang kafir di perang Badar adalah seperti kejadian yang berlangsung di masa-masa dahulu yang diturunkan Allah dengan mengazab golongan-golongan orang kafir. Yakni mereka senantiasa kafir terhadap ayat-ayat Allah sehingga kekafiran itu menyebabkan mereka disiksa oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52 Keadaan mereka orang musyrik serupa dengan keadaan Fir’aun dan pengikut-pengikutnya serta orang-orang kafir sebelumnya. Mereka mengingkari ayat-ayat Allah yang menunjukkan keesaan Allah dan menolak untuk menyembah-Nya, serta mendustakan rasul sehingga Allah menyiksa mereka disebabkan dosa-dosanya. Sesungguhnya Allah Maha Kuat lagi amat keras siksaan-Nya bagi orang yang durhaka dan kafir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serupa dengan keadaan} seperti keadaan dan peristiwa {pengikut Fir‘aun dan orang-orang sebelum mereka. Mereka mengingkari ayat-ayat Allah, lalu Allah menyiksa mereka karena dosa-dosa mereka. Sesungguhnya Allah Maha kuat lagi sangat keras hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Ini adalah sunnatullah yang berlaku untuk orang-orang yang dahulu dan yang datang berikutnya. Keadaan para pendusta itu, yakni Sunnatullah atas mereka serta kebinasaan yang Allah tampakkan kepada mereka akibat dosa-dosa mereka, “serupa dengan keadaan Firaun dan pengikut-pengikutnya serta orang-orang yang sebelumnya”, dari umat-umat yang mendustakan. “Mereka mengingkari ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Sesungguhnya Allah mahakuat lagi amat keras siksaNya.” Tak seorang pun mampu melindungi dirinya dari siksaNya. \"Tidak ada suatu binatang melatapun melainkan Dialah yang memegang ubun-ubunnya. Sesungguhnya Tuhanku di atas jalan yang lurus\" (Hud:56)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 52: Yakni umat-umat yang mendustakan rasul. Inilah sebab mereka disiksa. Terhadap apa yang diinginkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 52",
    "description": "Penentangan mereka terhadap rasulullah itu serupa dengan sikap pengikut fir'aun dalam memperlakukan nabi musa dan orang-orang yang sebelum mereka seperti kaum nabi nuh, kaum 'ad, samud, lut, dan lain-lain, terhadap para rasul mereka. Mereka mengingkari ayat-ayat Allah, baik yang tersebar di alam raya (tidak tertulis) maupun kebenaran yang dibawa oleh para rasul, maka Allah menyiksa mereka dengan bentuk azab yang berbeda-beda, seperti banjir bandang, gempa bumi, angin kencang, halilintar dan lain-lain. Itu semua disebabkan dosadosanya yang telah menjadi budaya masyarakat sehingga mengancam kehidupan manusia yang lain. Sungguh, Allah mahakuat lagi sangat keras siksa-Nya sehingga tidak ada seorang pun yang bisa lari darinya. Turunnya azab atas orang-orang kafir merupakan bukti keadilan Allah, sebab yang demikian itu, yakni turunnya azab, karena sesungguhnya Allah tidak akan mengubah suatu nikmat yang tampak pada penglihatan dan bisa dirasakan langsung, seperti rasa aman, kemakmuran, kesuburan, dan lain-lain, yang telah diberikan-Nya kepada suatu kaum, hingga kaum itu mengubah apa yang ada pada diri mereka sendiri menyangkut perubahan sikap mental dan perilaku, seperti dari peduli menjadi tidak peduli, adil menjadi tidak adil, berani berkorban menjadi serakah, dan lain-lain. Sungguh, Allah maha mendengar lagi maha mengetahu."
  }
]