[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan buruk tersebut, karena sesungguhnya Allah ketika melimpahkan kenikmatan tercurah pada suatu kaum, Dia sekali-kali tidak akan mencabutnya dari mereka sampai mereka sendiri mengubah keadaan mereka yang baik menuju keadaan buruk, dan sesungguhnya Allah maha mendengar ucapan-ucapan makhlukNya, maha mengetahui terhadap segala kondisi mereka, dan Dia akan membalas kepada mereka sesuai dengan apa yang ditentukan ilmuNya dan kehendakNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Hukuman yang berat itu terjadi karena apabila Allah memberikan nikmat-Nya kepada suatu kaum maka Allah tidak akan mencabutnya dari mereka sampai mereka sendiri mengubah perilaku mereka, yaitu dari iman, istikamah, dan mensyukuri nikmat menjadi kafir, durhaka, dan mengingkari nikmat Allah. Sesungguhnya Allah Maha Mendengar ucapan hamba-hamba-Nya lagi Maha Mengetahui perbuatan mereka, tidak ada sesuatu pun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Siksaan yang diberikan kepada kaum Quraisy kerena mengingkari kenikmatan-kenikmatan Allah, seperti siksaan yang diberikan kepada umat-umat sebelumnya akibat dosa-dosa mereka. Telah ditetapkan sunnatullah bahwa suatu kenikmatan yang diberikan kepada suatu kaum tidak akan diubah, hingga mereka mengubah keadaan mereka sendiri sesuai dengan apa yang layak bagi kenikmatan tersebut. Allah Maha Mendengar apa yang dikatakan orang-orang yang mendustakan para rasul, dan Maha Mengetahui apa yang mereka perbuat dan apa yang tidak mereka perbuat. Allah akan membalas mereka atas perkataan dan perbuatan mereka. Jika mereka berbuat kebaikan maka Dia akan membalas kebaikan, begitu juga sebaliknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. ذٰلِكَ (yang demikian itu) Yakni siksaan yang diturunkan Allah kepada mereka. بِأَنَّ اللهَ لَمْ يَكُ مُغَيِّرًا نِّعْمَةً أَنْعَمَهَا عَلَىٰ قَوْمٍ (karena sesungguhnya Allah sekali-kali tidak akan merubah sesuatu nikmat yang telah dianugerahkan-Nya kepada suatu kaum) Yakni karena sunnatullah yang berlaku bagi hamba-hamba-Nya adalah bahwa Allah tidak akan merubah nikmat-nikmat-Nya yang telah dikaruniakan kepada mereka. حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ ۙ (hingga kaum itu meubah apa-apa yang ada pada diri mereka sendiri) Seperti perbuatan dan sikap-sikap yang menunjukkan keingkaran atas nikmat Allah, menutup mata atas kebaikan yang diberikan-Nya, dan melalaikan perintah dan larangan-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini menjadi dalil bahwasanya Allah akan mengangkat suatu kenikmatan dari seorang hamba karena kemaksiatan yang berlaku dalam dirinya, Allah tidak akan mengubah apa yang ada pada diri mereka sampai mereka melakukan sesuatu yang dapat diterima di sisi Allah sebagai ampunan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53 Siksaan untuk orang-orang kafir itu disebabkan bahwa sesungguhnya Allah sekali-kali tidak akan mengubah suatu nikmat yang telah dianugerahkan-Nya kepada suatu kaum dengan murka. Atau mengubah nikmat yang telah Allah anugerahkan kepada suatu kaum hingga mereka menggantinya dengan kekufuran sehingga mereka ingkar dengan nikmat Allah, kemudian meninggalkan perintah dan larangan Allah. Sesungguhnya Allah Maha Mendengar atas setiap perkataan lagi Maha Mengetahui atas segala perbuatan dan maksud hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu karena sesungguhnya Allah tidak akan mengubah} mengubah {suatu nikmat yang telah dianugerahkan kepada suatu kaum sehingga mereka mengubah} mengganti {apa yang ada pada diri mereka. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Yang demikian (siksaan) itu.” Yakni siksa yang Allah timpakan kepada umat-umat yang mendustakan dan melenyapkan nikmat yang mereka rasakan adalah disebabkan oleh dosa-dosa mereka dan pengubahan terhadap apa yang ada pada diri mereka sendiri, karena “sesungguhnya Allah sekali-kali tidak akan merubah suatu nikmat yang telah dianugerahkanNya kepada suatu kaum”, dari nikmat agama dan dunia, tetapi Dia membiarkannya dan akan menambahnya jika mereka mensyukurinya, “hingga kaum itu merubah apa yang ada pada diri mereka sendiri”, dari ketaatan kepada kemaksiatan, kemudian mereka mengkufuri nikmat Allah, menggantinya dengan kekufuran, maka Dia pun menariknya kembali dan merubahnya sebagaimana mereka mengubah apa yang ada pada diri mereka. Dan dalam semua itu Allah memiliki hikmah, keadilan, dan kebaikan kepada hamba-hambaNya, yang mana Allah tidak menyiksa mereka kecuali karena kezhaliman mereka dan Allah menarik hati para waliNya agar selalu ingat kepadaNya dengan melihat azab yang menimpa hamba-hambaNya yang menyelisihi perintahNya. “Dan sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui”, mendengar semua yang diucapkan orang yang berucap,baik yang dikeraskan maupun yang dirahasiakan. Dan Allah mengetahui apa yang disimpan oleh hati dan dipendam dalam dada, maka Dia memberlakukan takdir kepada hamba-hambaNya sesuai dengan ilmu dan kehendakNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 53: Berubah menjadi azab. Dari taat kepada maksiat. Allah tidak mencabut nikmat yang telah dilimpahkan-Nya kepada suatu kaum, bahkan akan mengekalkan dan menambahnya selama kaum itu tetap taat dan bersyukur kepada Allah. Tetapi jika mereka kufur, maka Allah akan cabut nikmat itu. Seperti yang dilakukan kaum kafir Quraisy, mereka diberi makan oleh Allah Ta’ala ketika lapar dan diamankan dari ketakutan (lihat surat Quraisy), lalu mereka mendustakan utusan Allah dan menghalangi manusia dari jalan-Nya serta memerangi orang-orang yang beriman kepada-Nya. Sehingga Dia tetapkan taqdir untuk mereka sesuai ilmu-Nya dan kehendak-Nya yang berlaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 53",
    "description": "Turunnya azab atas orang-orang kafir merupakan bukti keadilan Allah, sebab yang demikian itu, yakni turunnya azab, karena sesungguhnya Allah tidak akan mengubah suatu nikmat yang tampak pada penglihatan dan bisa dirasakan langsung, seperti rasa aman, kemakmuran, kesuburan, dan lain-lain, yang telah diberikan-Nya kepada suatu kaum, hingga kaum itu mengubah apa yang ada pada diri mereka sendiri menyangkut perubahan sikap mental dan perilaku, seperti dari peduli menjadi tidak peduli, adil menjadi tidak adil, berani berkorban menjadi serakah, dan lain-lain. Sungguh, Allah maha mendengar lagi maha mengetahukeadaan mereka serupa dengan keadaan pengikut fir'aun terhadap nabi musa dan orang-orang yang sebelum mereka, seperti kaum nabi nuh, kaum 'ad, kaum samud, kaum sodom, dan lain-lain. Mereka men-dustakan ayat-ayat tuhannya melalui sikap dan perilakunya, maka kami menurunkan azab yang membinasakan mereka dengan bentuk yang bermacam-macam (lihat : surah al-'ankabut/29: 40), disebabkan oleh dosa-dosanya. Dosa-dosa yang mereka lakukan bukan sematamata terkait dengan akidah atau keyakinan, akan tetapi kejahatan sosial yang dapat mengancam kehidupan kemanusiaan secara umum, seperti membudayanya kejahatan ekonomi (madyan, kaum nabi syuaib), penyimpangan seksual (sodom, kaum nabi lut), dan lain-lain, dan karena itulah kami juga menenggelamkan fir'aun dan pengikut-pengikutnya; sebab mereka adalah orang-orang yang zalim yaitu dengan menjadikan kekuasaannya sebagai alat untuk menindas orangorang lemah dan bahkan memperbudak mereka. Perilaku fir'aun ini esensinya sama dengan perilaku umat-umat terdahulu. Inilah hukum Allah (sunatullah) yang bersifat pasti dan universal dalam perjalanan kehidupan manusia sepanjang masa, bahwa siapa pun yang memiliki sifat dan perilaku yang sama dengan mereka pasti akan mendapat hukuman atau azab dari Allah dengan bentuknya yang berbeda-beda, tanpa memandang kebenaran akidahnya."
  }
]