[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perumpamaan orang-orang kafir dalam hal tersebut adalah seperti fir’aun dan para pengikutnya yang mendustakan Musa , dan seperti orang-orang yang mendustakan rasul-rasul mereka dari umat-umat dahulu, lalu Allah membinasakan mereka disebabkan oleh dosa-dosa mereka, dan Allah menenggelamkan fir’aun dan bala tentaranya di laut. Dan setiap dari mereka telah melakukan sesuatu yang tidak sepantasnya ia perbuat, berupa pendustaan terhadap rasul-rasul Allah, pengingkaran mereka terhadap ayat-ayat Allah, dan kesyirikan mereka dalam beribadah kepada selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Apa yang terjadi pada mereka itu sama seperti yang terjadi pada orang-orang kafir lainnya, seperti keluarga Fir’aun dan umat-umat yang kafir sebelum mereka. Mereka mendustakan ayat-ayat Rabb mereka, maka Allah membinasakan mereka disebabkan perbuatan maksiat yang mereka lakukan. Dan Allah membinasakan keluarga Fir’aun dengan menenggelamkan mereka di laut. Baik keluarga Fir’aun maupun umat-umat lain sebelum mereka adalah orang-orang yang zalim. Karena mereka ingkar kepada Allah dan menyekutukan-Nya dengan sesuatu. Oleh sebab itulah mereka pantas mendapatkan hukuman dari Allah -Subḥānahu-. Maka Allah-pun menimpakan hukuman-Nya kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Allah menyerupakan orang-orang kafir itu dalam pendustaan dan dosa-dosa besar mereka dengan para pengikut Fir’aun yang mendustakan Musa serta para pendahulu mereka yang lain yang mendustakan ayat-ayat yang diturunkan Allah serta mukjizat-mukjizat yang menunjukkan keesaan-Nya. Allah membinasakan mereka akibat dosa-dosa besar mereka. Kami menenggelamkan Fir’aun dan para pengikutnya di Laut Merah. Dan seluruh umat tersebut adalah orang-orang yang menzalimi diri mereka sendiri dan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. كَدَأْبِ ءَالِ فِرْعَوْنَ ۙ وَالَّذِينَ مِن قَبْلِهِمْ ۚ ((keadaan mereka) serupa dengan keadaan Fir’aun dan pengikut-pengikutnya serta orang-orang yang sebelumnya) Yakni seperti sunnatullah yang berlaku bagi mereka, apabila mereka kafir dan berbuat dosa maka Allah akan menyiksa mereka, oleh karena itu Allah menyiksa mereka dengan menenggelamkan mereka di laut, dan membinasakan orang-orang kafir selain mereka. Allah menetapkan bahwa kedua golongan; golongan Fir’aun dan pengikutnya serta orang-orang kafir sebelumnya dan golongan kafir Quraisy bahwa mereka semua adalah orang-orang yang menzalimi diri mereka sendiri dengan mengingkari Allah, ayat-ayat-Nya dan Rasul-Rasul-Nya serta orang-orang yang menzalimi orang lain dengan berbuat berbagai kezaliman ketika bermuamalah dengan orang lain, dan inilah yang menjadikan mereka ditimpa oleh azab Allah. Disebutkan dalam sejarah bahwa Rasulullah ketika mendapat kabar terbunuhnya seorang pemimpin kekafiran Abu Jahal pada perang Badar, ia berjalan sampai berdiri di dekatnya kemudian berkata: “Orang ini merupakan Fir’aun dalam umat ini”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54 Keadaan mereka orang-orang kafir Qurays sehingga menyebabkan mereka mendapat azab Allah sebab kufur, dholim dan dusta atas ayat Allah dan rasul-Nya adalah serupa dengan keadaan Fir’aun dan pengikut-pengikutnya serta orang-orang kafir sebelumnya. Mereka mendustakan ayat-ayat Tuhannya Yang telah memelihara mereka dengan berbagai kenikmatan dan anugerah-Nya. Maka Kami membinasakan mereka disebabkan dosa-dosanya dan Kami tenggelamkan Fir’aun dan pengikut-pengikutnya bersamanya. Setiap umat yang mendustakan ayat-ayat Kami adalah orang-orang yang zalim atas diri mereka sendiri Kalimat ini diulang sebagai tanda bahwa ayat yang pertama menunjukkan kufur akidah dan pengesaan, yang kedua menunjukkan ingkar atas nikmat dan pemeliharaan, sehingga kata rabba di sini menunjukkan bahwa Allah adalah Maha Pemelihara dan Maha Pemberi Nikmat. Pada yang pertama dengan lafadz Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serupa dengan keadaan} keadaan dan peristiwa {pengikut Fir‘aun dan orang-orang sebelum mereka. Mereka mendustakan ayat-ayat Tuhan mereka. Lalu Kami membinasakan mereka karena dosa-dosa mereka dan Kami menenggelamkan pengikut Fir‘aun. Semuanya adalah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “(Keadaan mereka) serupa dengan keadaan Firaun dengan pengikut-pengikutnya”, yakni Firaun dan kaumnya. “Serta orang-orang yang sebelumnya. Mereka mendustakan ayat-ayat Rabb mereka”, ketika ia datang kepada mereka. “Maka Kami membinasakan mereka disebabkan dosa-dosa mereka”, semua sesuai dengan kejahatannya. “Dan Kami tenggelamkan Firaun dan pengikut-pengikutnya, dan kesemuanya”, yakni orang-orang yang diazab dan dibinasakan “adalah orang-orang yang zhalim”, kepada diri mereka sendiri dengan berusaha membinasakannya. Allah tidak menzhalimi dan tidak menyiksa mereka tanpa dosa yang mereka lakukan maka hendaknya orang-orang yang ucapan ini ditujukan kepadanya tidak menyerupai mereka dalam kezhaliman, karena Allah akan menurunkan azabNya kepadanya seperti kepada orang-orang fasik itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 54: Ketika ayat-ayat itu datang kepada mereka. Oleh karena itu, hendaknya kita berhati-hati agar tidak berbuat zalim seperti mereka sehingga nantinya Allah akan menimpakan hukuman-Nya kepada kita sebagaimana mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 54",
    "description": "Keadaan mereka serupa dengan keadaan pengikut fir'aun terhadap nabi musa dan orang-orang yang sebelum mereka, seperti kaum nabi nuh, kaum 'ad, kaum samud, kaum sodom, dan lain-lain. Mereka men-dustakan ayat-ayat tuhannya melalui sikap dan perilakunya, maka kami menurunkan azab yang membinasakan mereka dengan bentuk yang bermacam-macam (lihat : surah al-'ankabut/29: 40), disebabkan oleh dosa-dosanya. Dosa-dosa yang mereka lakukan bukan sematamata terkait dengan akidah atau keyakinan, akan tetapi kejahatan sosial yang dapat mengancam kehidupan kemanusiaan secara umum, seperti membudayanya kejahatan ekonomi (madyan, kaum nabi syuaib), penyimpangan seksual (sodom, kaum nabi lut), dan lain-lain, dan karena itulah kami juga menenggelamkan fir'aun dan pengikut-pengikutnya; sebab mereka adalah orang-orang yang zalim yaitu dengan menjadikan kekuasaannya sebagai alat untuk menindas orangorang lemah dan bahkan memperbudak mereka. Perilaku fir'aun ini esensinya sama dengan perilaku umat-umat terdahulu. Inilah hukum Allah (sunatullah) yang bersifat pasti dan universal dalam perjalanan kehidupan manusia sepanjang masa, bahwa siapa pun yang memiliki sifat dan perilaku yang sama dengan mereka pasti akan mendapat hukuman atau azab dari Allah dengan bentuknya yang berbeda-beda, tanpa memandang kebenaran akidahnya. Setelah ayat sebelumnya menjelaskan sikap orang-orang kafir mekah pada perang badar dan menyifatinya sebagai orang-orang yang zalim, maka ayat ini menjelaskan kelompok lain yang juga memusuhi nabi Muhammad, yakni yahudi bani quraidhah, yang disifati sebagai makhluk terburuk. Sesungguhnya makhluk bergerak yang bernyawa yang paling buruk dalam pandangan Allah ialah orang-orang kafir, karena mereka tidak beriman, yakni mereka terus-menerus melakukan pengingkaran terhadap ayat-ayat Allah dan merusak perjanjian yang sudah dikuatkan dengan sumpah, sebagaimana yang dilakukan oleh yahudi bani quraidha."
  }
]