[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya makhluk terburuk yang berjalan di muka bumi di sisi Allah adalah orang-orang kafir yang bertahan di atas kekafiran. Mereka tidak membenarkan utusan-utusan Allah, tidak mengakui keesaan Allah, dan tidak mengikuti syari’atNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Sesungguhnya seburuk-buruk makhluk yang berjalan di muka bumi ialah orang-orang yang ingkar kepada Allah dan rasul-Nya. Mereka tidak mau beriman walaupun semua bukti kekuasaan Allah telah datang kepada mereka. Mereka bersikeras mempertahankan kekafiran mereka. Semua sarana penangkap hidayah seperti akal pikiran, pendengaran, dan penglihatan yang mereka miliki benar-benar tidak berfungsi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Sesungguhnya seburuk-buruk makhluk yang berjalan di muka bumi dalam ketetapan dan keadilan Allah adalah orang-orang kafir yang memiliki dua sifat: Pertama, mereka terus menerus berada di atas kekafiran; dan kedua, mereka selalu mengingkari perjanjian, mereka sama sekali tidak takut kepada Allah saat melanggar perjanjian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. إِنَّ شَرَّ الدَّوَآبِّ (sesungguhnya binatang (makhluk) yang paling buruk) Yakni seburuk-buruk makhluk yang berjalan di muka bumi, karena mereka tidak memikirkan apa yang baik bagi diri mereka. عِندَ اللهِ(di sisi Allah) Yakni dalam ketetapan Allah. الَّذِينَ كَفَرُوا۟( ialah orang-orang yang kafir) Yakni yang terus-menerus dalam kekafiran dan berlarut-larut dalam kesesatan. فَهُمْ لَا يُؤْمِنُونَ (karena mereka itu tidak beriman) Yakni tidak beriman selamanya dan tidak berhenti dari kesesatan sama sekali. Dan mereka adalah orang-orang yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55-56 Sesungguhnya binatang melata/segala makhluk yang berjalan di atas bumi yang paling buruk di sisi Allah ialah orang-orang yang kafir, karena mereka itu tidak beriman atas keesaan dan kesempurnaan kekuasaan Allah. Yaitu orang-orang yang telah kamu ambil perjanjian untuk tidak menolong orang musyrik. Mereka adalah Yahudi bani Quraidhah sesudah itu mereka mengkhianati janjinya pada setiap kalinya, dan mereka tidak takut atas akibat-akibatnya. Mereka tidak takut kepada Allah atas hukuman berkhianat. Ayat ini turun untuk Bani Quraidhah yang telah mengingkari janji mereka kepada Rasul dan menolong kaum musyrik dalam peperangan Badr kemudian mereka berkata: Kami lupa dan kami telah berbuat salah. Kemudian mereka telah berjanji kedua kali dan mengingkari kembali pada perang Khandaq"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya seburuk-buruk makhluk yang bergerak} makhluk yang bergerak di permukaan bumi {di sisi Allah ialah orang-orang kafir karena mereka tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56. Mereka yang mengumpulkan tiga sifat buruk ini –kekufuran, ketidak imanan, dan khianat- yang mana mereka tidak memegang janji yang disepakati dan ucapan yang mereka ucapkan, adalah “binatang (makhluk) yang paling buruk di sisi Allah.” Mereka lebih buruk daripada keledai, anjing, dan binatang lainnya, karena tidak adanya kebaikan pada mereka, yang ada hanyalah keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 55: Ayat ini turun berkenaan dengan Yahudi Bani Quraizhah, yang di antaranya adalah Ka’ab bin Al Asyraf dan kawan-kawannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 55",
    "description": "Setelah ayat sebelumnya menjelaskan sikap orang-orang kafir mekah pada perang badar dan menyifatinya sebagai orang-orang yang zalim, maka ayat ini menjelaskan kelompok lain yang juga memusuhi nabi Muhammad, yakni yahudi bani quraidhah, yang disifati sebagai makhluk terburuk. Sesungguhnya makhluk bergerak yang bernyawa yang paling buruk dalam pandangan Allah ialah orang-orang kafir, karena mereka tidak beriman, yakni mereka terus-menerus melakukan pengingkaran terhadap ayat-ayat Allah dan merusak perjanjian yang sudah dikuatkan dengan sumpah, sebagaimana yang dilakukan oleh yahudi bani quraidha di sini lebih ditegaskan lagi bahwa mereka, yahudi bani quraidhah, itu adalah orang-orang yang terikat perjanjian dengan kamu, wahai nabi Muhammad, kemudian setiap kali berjanji mereka mengkhianati janjinya, sedang sikap semacam itu berarti mereka tidak mengagungkan Allah dan tidak takut terhadap azab-Nya."
  }
]