[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diantara manusia-manusia terburuk tersebut adalah bangsa yahudi yang sepakat denganmu menjalin hubungan perdamaian untuk tidak memerangimu dan tidak mendukung siapapun untuk melawanmu. Tetapi kemudian mereka melanggar isi perjanjian mereka berulang-ulang kali dan mereka tidak takut kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Orang-orang yang telah mengadakan perjanjian denganmu -seperti Bani Quraiẓah-, kemudian mereka melanggar janji mereka berulang kali. Mereka tidak pernah takut kepada Allah. Sehingga mereka tidak menepati janji-janji mereka dan tidak konsisten dengan perjanjian yang telah dibuat bersama mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. الَّذِينَ عٰهَدتَّ مِنْهُمْ ثُمَّ يَنقُضُونَ عَهْدَهُمْ (orang-orang yang kamu telah mengambil perjanjian dari mereka, sesudah itu mereka mengkhianati janjinya) Yakni mengkhianati perjanjian yang telah kamu sepakati dengan mereka. فِى كُلِّ مَرَّةٍ(pada setiap kalinya) Yakni disetiap perjanjian. وَهُمْ لَا يَتَّقُونَ(dan mereka tidak takut) Yakni tidak berhenti berkhianat, tidak takut akibatnya, dan tidak menjauhi sebab-sebab pelanggaran. Di antara mereka adalah orang-orang dari Bani Quraidhah, Rasulullah mengikat perjanjian dengan mereka bahwa mereka tidak akan membantu orang-orang kafir, namun mereka tidak menepati hal tersebut, bahkan mereka malah pergi ke kota Makkah untuk mendorong orang-orang kafir agar memerangi kaum muslimin dan mereka menjanjikan kepada orang-orang kafir pertolongan dan bantuan, dan orang-orang kafir Quraisy pun datang ke perang Khandak. Lalu Bani Quraidhah melanggar perjanjian dengan kaum muslimin, sehingga pada akhirnya mereka mendapat balasannya dari kaum muslimin sebagaimana diketahui dalam sejarah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman tentang Yahudi : { الَّذِينَ عَاهَدْتَ مِنْهُمْ ثُمَّ يَنْقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لَا يَتَّقُونَ } \"(Yaitu) orang-orang yang kamu telah mengambil perjanjian dari mereka, sesudah itu mereka mengkhianati janjinya pada setiap kalinya, dan mereka tidak takut (akibat-akibatnya).\" dalam ayat dikatakan { يَنْقُضُونَ } datang dengan lafazh fi'il istiqbal padahal mereka telah melakukan penolakan sebelum turunya ayat ini; hal ini menunjukkan bahwa mereka akan terus melakukan hal yang sama, dan mereka sekali-kali tidak ingin berhenti dari perbuatan itu, dan tidak pula pada diri mereka penyesalan atas perbuatan yang telah mereka lakukan, bahkan mereka mendustakan ayat-ayat Allah setiap kali disampaikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55-56 Sesungguhnya binatang melata/segala makhluk yang berjalan di atas bumi yang paling buruk di sisi Allah ialah orang-orang yang kafir, karena mereka itu tidak beriman atas keesaan dan kesempurnaan kekuasaan Allah. Yaitu orang-orang yang telah kamu ambil perjanjian untuk tidak menolong orang musyrik. Mereka adalah Yahudi bani Quraidhah sesudah itu mereka mengkhianati janjinya pada setiap kalinya, dan mereka tidak takut atas akibat-akibatnya. Mereka tidak takut kepada Allah atas hukuman berkhianat. Ayat ini turun untuk Bani Quraidhah yang telah mengingkari janji mereka kepada Rasul dan menolong kaum musyrik dalam peperangan Badr kemudian mereka berkata: Kami lupa dan kami telah berbuat salah. Kemudian mereka telah berjanji kedua kali dan mengingkari kembali pada perang Khandaq"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang kamu telah mengikat perjanjian dengan mereka, kemudian setiap kali berjanji mereka mengkhianati janjinya sedangkan mereka tidak bertakwa} mereka tidak tahut hukuman dari pengkhianatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56. Mereka yang mengumpulkan tiga sifat buruk ini –kekufuran, ketidak imanan, dan khianat- yang mana mereka tidak memegang janji yang disepakati dan ucapan yang mereka ucapkan, adalah “binatang (makhluk) yang paling buruk di sisi Allah.” Mereka lebih buruk daripada keledai, anjing, dan binatang lainnya, karena tidak adanya kebaikan pada mereka, yang ada hanyalah keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 56: Untuk tidak membantu kaum musyrik. Makhluk bergerak yang paling buruk dalam pandangan Allah adalah mereka yang memiliki tiga sifat ini; kafir, tidak beriman dan khianat, karena mereka tidak ada kebaikannya sama sekali dan yang ada hanya keburukan. Oleh karena itu , dibinasakannya mereka sangat pantas sekali agar penyakit mereka tidak menular kepada yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 56",
    "description": "Di sini lebih ditegaskan lagi bahwa mereka, yahudi bani quraidhah, itu adalah orang-orang yang terikat perjanjian dengan kamu, wahai nabi Muhammad, kemudian setiap kali berjanji mereka mengkhianati janjinya, sedang sikap semacam itu berarti mereka tidak mengagungkan Allah dan tidak takut terhadap azab-Nya. Karena itu, maka jika engkau, wahai nabi Muhammad, berkesempatan mendapati bahkan mengungguli mereka, yakni yahudi bani quraidhah yang telah berjanji untuk tidak membantu kaum musyrik pada perang badar ternyata mereka merusak perjanjian itu, dalam peperangan yang lain, maka cerai-beraikanlah mereka dan orang-orang yang di belakang mereka dengan menumpasnya, agar mereka mengambil pelajaran melalui hukuman itu sehingga tidak merusak perjanjian lagi. Rangkaian ayat di atas, meski terkait dengan yahudi bani quraidhah, juga pelajaran sekaligus peringatan bagi siapa saja yang merusak perjanjian. Artinya, siapa pun yang merusak perjanjian sesungguhnya ia patut memperoleh laknat Allah."
  }
]