[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila kamu menghadapi orang-orang yang melanggar perjanjian dan kesepakatan dalam suatu pertempuran, maka timpakanlah pada mereka serangan yang dapat menghujamkan rasa ketakutan di dalam hati orang-orang selain mereka dan mencerai beraikan kelompok mereka, mudah-mudahan mereka mau mengambil pelajaran, sehingga mereka tidak lagi berani bertindak serupa dengan perbuatan yang telah dilakukan para pendahulu mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Jika kamu -wahai Rasul- berhadapan dengan orang-orang yang suka melanggar janji-janji mereka itu di medan perang, maka seranglah mereka dengan serangan yang sangat dahsyat supaya hal itu didengar oleh kelompok-kelompok lainnya dan dijadikan sebagai pelajaran. Kemudian mereka akan takut menyerangmu atau membantu musuh-musuhmu yang hendak menyerangmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Jika kamu mendapatkan orang-orang yang senantiasa melanggar perjanjian dan mengalahkan mereka dalam medan peperangan, maka siksalah mereka dengan keras hingga dapat menjauhkan dan memecah belah para musuh yang ada di belakang mereka; agar para musuh itu mengingat siksaan tersebut sehingga mereka tidak berani melanggar perjanjian dan memerangi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. فَإِمَّا تَثْقَفَنَّهُمْ فِى الْحَرْبِ (Jika kamu menemui mereka dalam peperangan) Yakni jika kamu mampu menghadapi mereka dan memiliki kekuatan untuk mengalahkan Mereka. فَشَرِّدْ بِهِم مَّنْ خَلْفَهُمْ(maka cerai beraikanlah orang-orang yang di belakang mereka) Yakni maka cerai beraikanlah mereka dengan membunuh mereka dan siksalah mereka dibelakang orang-orang musyrik yang memerangi kamu agar mereka segan dan takut kepadamu serta berhenti memerangimu karena takut ditimpa apa yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57 Jika kamu menemui mereka dalam peperangan, maka takutilah dan siksa mereka dengan siksaan yang pedih, serta cerai beraikanlah orang-orang yang di belakang mereka dengan menumpas mereka yaitu orang-orang kafir. Sehingga mereka takut dan gentar untuk memerangi kalian, supaya mereka mengambil pelajaran dan tidak lagi mengingkari janji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka jika kamu benar-benar mendapati mereka} benar-benar mendapati mereka {dalam peperangan, maka cerai-beraikanlah orang-orang yang di belakang mereka dengan (menumpas) mereka} maka hancurkanlah orang dibelakang mereka dengan {agar mereka mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Melenyapkan dan membinasakan mereka adalah keniscayaan, agar penyakit mereka tidak merembet kepada selain mereka. Oleh karena itu Allah berfirman, “Jika kamu menemui mereka dalam peperangan.” Yakni kamu bertemu mereka dalam peperangan di mana tidak ada perjanjian dan perdamaian, “maka cerai-beraikanlah orang-orang yang dibelakang mereka dengan (menumpas) mereka.” Yakni jadikanlah selain mereka takut dengan cara menumpas mereka, timpakan hukuman kepada mereka yang bisa menjadi pelajaran bagi yang datang dan sesudah mereka, “Supaya mereka mengambil pelajaran.” Yakni orang-orang yang datang sesudah mereka menghindari apa yang mereka lakukan agar tidak tertimpa apa yang menimpa mereka. Ini adalah salah satu manfaat hukuman dan hudud yang disebabkan karena kemaksiatan, yakni ia menjadi sebab jeranya orang yang tidak melakukan kejahatan, bahkan ia juga merupakan sebab jeranya pelaku kejahatan agar tidak mengulangi perbuatannya. Pembatasan hukuman ini di waktu perang menunjukkan bahwa orang kafir –meskipun dia sering dan mudah berkhianat- jika dia telah diberi janji, maka dia tidak boleh dihukum dan dikhianati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 57: Atau menemukan mereka dalam peperangan. Taqyid (pembatasan) “dalam peperangan” menunjukkan bahwa orang kafir meskipun sering berkhianat dan mengingkari janji apabila diberi perjanjian, maka kita tidak boleh mengkhianatinya dan melanggarnya. Yang tidak ikut berperang. Yang ikut berperang. Orang yang berada di belakang mereka tersebut. Sehingga mereka tidak melakukan hal yang sama. Inilah faedah adanya sanksi dan hukuman hudud terhadap maksiat agar orang yang melakukannya jera dan orang lain yang belum melakukan tidak melakukan hal yang sama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 57",
    "description": "Karena itu, maka jika engkau, wahai nabi Muhammad, berkesempatan mendapati bahkan mengungguli mereka, yakni yahudi bani quraidhah yang telah berjanji untuk tidak membantu kaum musyrik pada perang badar ternyata mereka merusak perjanjian itu, dalam peperangan yang lain, maka cerai-beraikanlah mereka dan orang-orang yang di belakang mereka dengan menumpasnya, agar mereka mengambil pelajaran melalui hukuman itu sehingga tidak merusak perjanjian lagi. Rangkaian ayat di atas, meski terkait dengan yahudi bani quraidhah, juga pelajaran sekaligus peringatan bagi siapa saja yang merusak perjanjian. Artinya, siapa pun yang merusak perjanjian sesungguhnya ia patut memperoleh laknat Allah. Dan jika engkau, wahai nabi Muhammad, khawatir akan terjadinya pengkhianatan dari suatu golongan, baik dari yahudi bani quraidhah maupun lainnya, dengan melihat tanda-tandanya yang cukup jelas, maka kembalikanlah perjanjian itu kepada mereka dan kamu jangan melakukan hal yang sama, serta tetap konsistenlah dalam memegang janji dengan cara yang jujur dan tidak berkhianat seperti me-reka. Sungguh, Allah tidak menyukai orang yang berkhiana."
  }
]