[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila kamu (wahai rasul), mengkhawatirkan adanya pengkhianatan dari suatu kaum yang telah tampak gejala-gejalanya, maka lemparkan saja perjanjian itu kepada mereka, agar kedua belah pihak sama-sama mengetahui bahwa sudah tidak ada perjanjian yang berlaku lagi setelah hari ini. Sesungguhnya Allah tidak menyukai orang-orang yang berkhianat dalam perjanjian-perjanjian lagi melanggar perjanjian dan kesepakatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Jika kamu -wahai Rasul- merasa khawatir bahwa orang-orang yang mengadakan perjanjian denganmu akan menipumu atau melanggar janji lantaran adanya gerak-gerik yang menunjukkan hal tersebut, maka umumkanlah kepada mereka bahwa kamu membatalkan perjanjian dengan mereka agar kamu dan mereka sama-sama mengetahui hal itu. Dan jangan menyerang mereka secara tiba-tiba sebelum memberitahu mereka tentang pembatalan perjanjian itu. Sebab, menyerang mereka secara tiba-tiba sebelum memberitahu mereka tentang pembatalan perjanjian itu adalah pengkhianatan. Dan Allah tidak menyukai bahkan membenci orang-orang yang berkhianat. Maka jangan sekali-kali kamu berkhianat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Jika kamu mengira kaum yang memiliki perjanjian itu akan berkhianat dan melanggar janjinya, atas dasar tanda-tanda yang nampak dari mereka; maka putuskanlah jalan pengkhianatan bagi mereka sebelum itu terjadi dengan membatalkan perjanjian dengan mereka dan memeringatkan mereka bahwa kamu tidak lagi terikat dengan perjanjian itu, dengan cara yang jelas tanpa penipuan atau rahasia; sebab Allah tidak menyukai mereka yang memiliki sifat khianat, maka janganlah kamu lanjutkan perjanjian dengan mereka, sehingga kamu tidak lagi memiliki perjanjian dengan kaum yang tidak disukai Allah; karena sesungguhnya Allah tidak menyukai orang-orang yang berkhianat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَإِمَّا تَخَافَنَّ مِن قَوْمٍ خِيَانَةً (Dan jika kamu khawatir akan (terjadinya) pengkhianatan dari suatu golongan) khawatir akan pengkhianatan dan pelanggaran perjanjian oleh kaum yang mempunyai perjanjian dengan kaum muslimin, apabila muncul dari mereka awal-awal pengkhianatan. فَانۢبِذْ إِلَيْهِمْ(maka kembalikanlah perjanjian itu kepada mereka) Maka batalkanlah perjanjian yang ada diantara kamu dengan mereka. عَلَىٰ سَوَآءٍ ۚ( dengan cara yang jujur) Yakni dengan cara yang lurus. Yaitu dengan cara memberi tahu bahwa telah muncul dari mereka pengkhianatan dan tidak dengan cara langsung memerangi mereka seketika itu. Dan ayat ini mencakup seluruh kaum yang ditakutkan akan melanggar perjanjian. إِنَّ اللهَ لَا يُحِبُّ الْخَآئِنِينَ(Sesungguhnya Allah tidak menyukai orang-orang yang berkhianat) Ini merupakan peringatan untuk Rasulullah agar tidak langsung memerangi mereka sebelum membatalkan perjanjian yang ada dengan cara yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 Jika kamu khawatir atau tahu akan terjadinya pengkhianatan dari suatu golongan, maka kembalikanlah perjanjian itu kepada mereka dengan cara memerangi mereka, sehingga mereka akan mengetahui akibat mengingkakri janji sebagaimana apa yang kalian ketahui, agar kalian tidak khawatir dihianati oleh mereka. Sesungguhnya Allah akan mengazab dan juga tidak menyukai orang-orang yang berkhianat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kamu benar-benar khawatir tentang pengkhianatan dari suatu kaum} pembatalan perjanjian {maka kembalikanlah (perjanjian itu) kepada mereka} kembalikanlah perjanjian itu kepada mereka secara terang-terangan {dengan cara seimbang} dengan seimbang antara kamu dan mereka mengetahui pembatalan perjanjian itu {Sesungguhnya Allah tidak menyukai para pengkhianat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Yakni, jika diantara kamu dengan suatu kaum terdapat perjanjian damai, lalu kamu khawatir mereka akan berkhianat, di mana kamu mencium indikasi pengkhianatan mereka dan mereka tidak berkhianat dengan terang-terangan, “maka kembalikanlah perjanjian itu kepada mereka.” Yakni, katakanlah kepada mereka bahwa antara kamu dengan mereka tidak ada perjanjian, “dengan cara yang jujur.” Yakni sehingga pengetahuanmu dan pengetahuan mereka tentang itu adalah sama, tidak halal bagimu mengkhianati mereka atau melakukan sesuatu yang dilarang sesuai dengan tuntutan perjanjian sebelum kamu mengatakan itu kepada mereka. “Sesungguhnya Allah tidak menyukai orang-orang yang berkhianat.” Bahkan Dia sangat membencinya. Jadi, harus ada hal yang jelas yang membebaskanmu dari khianat. Ayat ini menunjukkan bahwa jika pengkhianat telah terbukti terjadi dari mereka, maka tidak perlu lagi mengembalikan perjanjian kepada mereka, karena ia telah diketahui dengan jelas dari mereka, dan karena tidak ada kegunaannya, serta berdasarkan FirmanNya, “Dengan cara yang jujur.” Dan disini penghianatan mereka telah diketahui mereka tidak dikhawatirkan, di mana mereka diindikasi kearah sana dari mereka, maka tidak boleh membatalkannya, bahkan wajib dipenuhi sampai habis masanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 58: Misalnya ada qarinah (tanda) dari keadaan mereka yang menunjukkan khianatnya mereka meskipun tidak secara tegas. Yakni sama-sama mengetahui bahwa perjanjian dibatalkan agar mereka tidak menuduh engkau mengkhianati janji setelahnya. Mafhum ayat ini adalah bahwa jika tidak dikhawatirkan adanya pengkhianatan dari mereka, misalnya keadaan mereka menunjukkan bahwa mereka akan menjaga baik-baik perjanjian itu, maka wajib dipenuhi sampai habis waktunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 58",
    "description": "Dan jika engkau, wahai nabi Muhammad, khawatir akan terjadinya pengkhianatan dari suatu golongan, baik dari yahudi bani quraidhah maupun lainnya, dengan melihat tanda-tandanya yang cukup jelas, maka kembalikanlah perjanjian itu kepada mereka dan kamu jangan melakukan hal yang sama, serta tetap konsistenlah dalam memegang janji dengan cara yang jujur dan tidak berkhianat seperti me-reka. Sungguh, Allah tidak menyukai orang yang berkhianamelihat perilaku buruk mereka itulah, Allah mengancam dengan firman-Nya pada ayat ini. Dan janganlah orang-orang kafir itu, baik yahudi bani quraidhah, sesuai konteks ayat ini, maupun siapa saja yang merusak perjanjian dan pengkhianatan, mengira bahwa mereka akan dapat lolos menyelamatkan diri dari kekuasaan atau azab Allah sebagai akibat dari sikap pengkhianatan tersebut. Sungguh, mereka tidak dapat melemahkan Allah atau menghindar dari pengawasan-Nya; dan Allah pasti membalasnya dengan balasan yang setimpal. Rangkaian ayat ini memberi pelajaran kepada kita, bahwa siapa saja yang berlaku khianat dan merusak perjanjian akan menerima laknat Allah, bahkan seandainya ia beragama islam sekalipun. Karena itu, pengkhianatan dalam konteks apa pun dan dengan alasan apa pun tidak dibenarkan dalam agama."
  }
]