[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Segolongan darikaum mukminin mendebatmu (wahai nabi), tentang peperangan setelah menjadi jelas bagi mereka bahwa itu bakal terjadi, seakan-akan mereka dihalau menuju kematian, sedang mereka melihatnya dengan mata kepala mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sekelompok orang mukmin itu mencoba membantah perintahmu -wahai Rasul - terkait perang melawan orang-orang musyrik setelah mereka tahu bahwa perang itu benar-benar terjadi. Mereka merasa seolah-olah mereka sedang digiring menuju kematian sedangkan mata mereka melihatnya secara nyata. Hal itu disebabkan keengganan mereka yang amat berat untuk pergi ke medan perang. Karena mereka tidak membawa bekal untuk perang dan tidak menyiapkan perlengkapannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Allah berfirman kepada rasul-Nya untuk mengingkari keengganan sebagian para sahabat pergi berperang: \"Hai Muhammad, sebagian sahabat mendebatmu dalam perkara perang dengan mengatakan, 'Bukankah kepergian kita hanya untuk mengejar kafilah dagang? Kalau saja engkau mengatakan kepada kami bahwa kita pergi untuk berperang niscaya kami akan membuat persiapan terlebih dahulu'.\" Perkataan mereka ini memang benar setelah jelas bagi mereka dengan kabar yang kamu sampaikan bahwa kemenangan akan menyertai mereka, dan memang tidak ada jalan lain selain bertemu kaum Quraisy di medan perang. Ini merupakan pemenuhan janji Allah untuk memenangkan salah satu golongan. Dalam ayat ini ditegaskan olokan bagi mereka dan dijelaskan buah dari ketaatan kepada perintah Allah dan rasul-Nya; meskipun pada awalnya belum terlihat hikmah dari perintah tersebut. Allah menggambarkan keadaan mereka dengan sangat jelas, hingga mereka enggan berperang karena seakan-akan mereka digiring kepada kematian, sebab mereka telah melihat tanda-tandanya. Ayat ini menggambarkan ketakutan yang menguasai golongan ini untuk berperang akibat sedikitnya jumlah dan persiapan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. يُجٰدِلُونَكَ فِى الْحَقِّ بَعْدَمَا تَبَيَّنَ (mereka membantahmu tentang kebenaran) Bantahan mereka katika Rasulullah menyeru mereka untuk menyerbu salah satu kelompok dari dua kelompok kafir Quraisy (kelompok kafilah dagang dan kelompok pasukan perang), karena kelompok kafilah dagang telah berlalu maka Rasulullah memerintahkan untuk menyerang pasukan perang, namun ketika itu kaum muslimin tidak membawa banyak persiapan untuk perang sehingga mereka merasa berat dan mengatakan: “seandainya engkau memerintahkan kami untuk berperang pasti kami akan membawa perbekalan dan melengkapi persiapan kami. كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنظُرُونَ (seolah-olah mereka dihalau kepada kematian, sedang mereka melihat) Mereka pergi ke medan perang dengan rasa pesimis untuk menang bahkan tidak terbesit di pikiran mereka untuk menang. Mereka mengira akan kalah seperti orang yang digiring untuk dibunuh sambil menyaksikan alat-alat yang menjadi sebab-sebab kematiannya yang tidak bisa diragukan lagi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-6 1 ). Dari peristiwa perang Badr kita didik untuk senantiasa berserah diri dan tunduk kepada perintah baik itu perintah syar'i maupun kauni, sekalipun itu menyalahi tujuan yang kita harapkan, bukankah Allah berfirman : { ( 6 ) وَإِنَّ فَرِيقًا مِنَ الْمُؤْمِنِينَ لَكَارِهُونَ ( 5 ) يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنْظُرُونَ } \"padahal sesungguhnya sebagian dari orang-orang yang beriman itu tidak menyukainya ( 5 ) mereka membantahmu tentang kebenaran sesudah nyata (bahwa mereka pasti menang), seolah-olah mereka dihalau kepada kematian, sedang mereka melihat (sebab-sebab kematian itu)\" ? akan tetapi mereka tidak memahami bahwasnya ketentuan itu menggiring mereka kepada pertolongan yang lebih besar yang menjadi penopang dakwah islam semasa hidup Rasulullah. 2 ). Ketika kebenaran telah terungkap, maka tidak pantas bagi orang berakal dan beriman menentangnya. { يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6 Mereka sebagian orang-orang mukmin membantahmu wahai Nabi tentang kebenaran sesudah nyata bahwa mereka pasti menang. Seolah-olah mereka merasa dihalau kepada kematian, sedang mereka melihat sebab-sebab kematian itu. Seakan-akan mereka benar-benar akan mati, sebab mereka sangat ketakutan untuk berperang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka membantahmu tentang kebenaran setelah nyata (kebenaran itu). Seakan-akan mereka dihalau pada kematian dan melihatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Allah mengemukakan dalam perang besar yang penuh berkah ini sifat sifat yang selayaknya bagi orang orang Mukmin untuk melakukannya, karena barangsiapa yang meakukannya maka keadaannya akan lurus dan amalnya akan baik, iman yang paling besar adalah berjihad di jalanNya. 5-6. sebagaimana iman mereka adalah iman yang hakiki dan balasan mereka adalah kebenaran yang Alah janjikan kepada mereka, maka begitulah Allah merintahkan rasulNya keluar dari rumahnya untuk berperang dengan orang-orang musyrik di badar dengan kebenaran yang dicintai dan diputuskan serta ditakdirkan oleh Allah meskipun orang orang mukmin tidak pernah menyangka akan terjadi perang antara mereka dengan orang orang musyik, maka ketika mereka mengetahui bahwa hal itu benar terjadi, muncullah sebagian orang-orang Mukmin yang membantah nabi, dalam hal itu dan tidak menyukai bertemu musuh seolah olah mereka itu digiring kepada kematian sedangkan mereka melihatnya. padahal hal ini tidak sepatutnya mereka lakukan, lebih-lebih setelah jelas bahwa keluarnya mereka adalah dengan kebenaran dan itu termasuk yang di perintahkan dan diridhai oleh Allah, keadaan seperti itu tidak membuka peluang untuk berbantah-bantahan, karena tempat dan faidah berbantah bantahan adalah pada saat perkara kebenaran itu samar. Adapun jika ia telah jelas dan nyata, maka yang ada hanya patuh dan tunduk. namun kebanyakan orang orang MUkmin saat itu tidak terpengaruh sedikitpun oleh bantahan bantahan ini, mereka juga tidak membenci bertemu musuh, demikian juga dengan orang orang yang di tegur oleh Allah mereka tetap patuh kepada jihad dengan sempurna, dan Allah meneguhkan mereka serta memudahkan sebab sebab yang menenangkan hati mereka sebagaimana sebagian darinya akan dijelaskan nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 6: Padahal yang seperti ini tidak patut muncul dari mereka, terlebih setelah mereka mengetahui bahwa keluarnya mereka dari rumah adalah dengan hak (kebenaran), termasuk yang diperintahkan Allah dan diridhai-Nya. Oleh karena itu, tidak sepatutnya mereka memperdebatkannya, karena memperdebatkan hanyalah ketika kebenaran samar dan perkaranya rancu. Adapun apabila telah jelas dan terang, tidak ada sikap yang lain selain tunduk dan mengikuti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 6",
    "description": "Sebagai bukti ketidaksenangan mereka untuk keluar ke badar, mereka, yakni golongan yang enggan berperang itu membantahmu wahai nabi Muhammad tentang kebenaran, yakni keharusan keluar kota menghadang kafilah setelah nyata bahwa mereka pasti akan menang sesuai janji Allah. Karena ketidaksenangan mereka yang didasari rasa enggan dan takut pada akibat-akibat perang itu, seakan-akan ketika berangkat menuju medan laga, mereka bagaikan orang yang dihalau menuju kepada kematian, sedang mereka terus-menerus melihat sebab-sebab kematian itukemudian Allah mengingatkan orang-orang mukmin tentang janji Allah kepada rasul-Nya. Dan ingatlah wahai orang-orang yang beriman ketika Allah yang mahakuasa menjanjikan kepadamu bahwa salah satu dari dua golongan yang kamu hadapi adalah untukmu, yaitu kamu akan menang menghadapi pasukan bersenjata dan berkekuatan yang datang dari mekah di bawah pimpinan 'utbah bin rabi'ah bersama abu jahal, sedang kamu sangat menginginkan bahwa yang tidak mempunyai kekuatan senjatalah untukmu, yaitu kafilah abu sufyan yang membawa dagangan dari syam (suriah). Kalian lebih berkeinginan untuk memerangi mereka yang membawa komoditi dagang dan tidak memiliki kekuatan. Tetapi Allah hendak membenarkan yang benar dengan ayatayat-Nya yang diturunkan berkenaan dengan perintah memerangi pasukan yang bersenjata dan berkekuatan serta janji-janji kemenangan dari Allah, dan Allah berkehendak memusnahkan orang-orang kafir sampai ke akar-akarnya, dengan memenangkan orang-orang mukmin. Mereka yang hendak terjun ke medan perang, biasanya berangan-angan untuk berhadapan dengan musuh yang sedikit jumlahnya, tidak mau bertemu musuh yang lebih kuat dan ingin mendapatkan harta rampasan yang banyak. Tapi ditegaskan di sini bahwa Allah berkehendak lain. Dia ingin mengangkat syiar agama, memproklamirkan kebenaran dan membasmi kekufuran."
  }
]