[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan persiapkanlah (wahai kaum muslimin), untuk menghadapi musuh-musuh kalian, semua yang dapat kalian perbuat dalam jumlah dan perlengkapan militer, supaya kalian bisa memasukan dengan itu rasa ketakutan di hati musuh-musuh Allah dan musuh-musuh kalian yang senantiasa menunggu-nunggu kesempatan menghabisi kalian, dan juga kalian dapat menakut-nakuti orang-orang lain yang belum menampakan api permusuhan kepada kalian sekarang. Akan tetapi Allah mengetahui mereka dan mengetahui apa yang mereka tutup-tutupi dalam hati mereka. Dan apa saja yang kalian keluarkan baik harta benda atau lainnya di jalan Allah sedikit ataupun banyak, Allah akan memberikan ganti bagi kalian di dunia dan menyimpan pahala amalan itu bagi kalian hingga hari kiamat, sedang kalian tidak mengalami pengurangan dari pahala amalan itu sedikitpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan siapkanlah -wahai orang-orang mukmin- apa yang bisa kalian siapkan, baik berupa jumlah pasukan maupun peralatan perang, termasuk menyiapkan kuda-kuda untuk persiapan jihad fi sabilillah, guna menggentarkan hati musuh-musuh Allah dan musuh-musuh kalian, baik dari golongan orang-orang kafir yang senantiasa menunggu-nunggu kesempatan untuk menyerang kalian maupun golongan-golongan lainnya. Kalian tidak mengetahui siapa mereka dan apa yang mereka sembunyikan di dalam hati mereka dari rasa permusuhan. Hanya Allah yang mengetahui siapa mereka dan apa yang mereka sembunyikan di dalam hati mereka. Dan harta yang kalian belanjakan, sedikit maupun banyak, akan diganti oleh Allah di dunia. Dan Dia akan memberi kalian ganjaran yang sempurna di Akhirat tanpa pengurangan sedikit pun. Maka bergegaslah membelanjakan harta kalian di jalan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Setelah Allah mewajibkan Rasulullah untuk menghancurkan kaum yang melanggar perjanjian dan membatalkan perjanjian dengan kaum yang dikhawatirkan akan melanggar perjanjian; maka kemudian Allah memerintahkan untuk menyiapkan diri untuk menghadapi orang-orang kafir, dengan berfirman: “Dan siapkanlah untuk menghadapi orang-orang kafir harbi segala yang dapat kalian mampu, seperti kekuatan, senjata, dan semisalnya yang dapat digunakan untuk memerangi mereka.” Termasuk di dalamnya adalah segala jenis produk dari berbagai macam senjata dan alat-alat perang seperti, tembak, meriam, pistol, kendaraan untuk pasukan angkatan darat, laut, dan udara; dan benteng, parit, alat pelindung diri, ide-ide, dan politik yang dapat menjadikan kaum muslimin maju dan dapat membela diri dari serangan musuh. Dengan ini kalian dapat membuat takut musuh-musuh Allah yang selalu mengintai kesempatan menyerang kalian. Orang-orang kafir jika mengetahui persiapan orang-orang beriman dalam berjihad dan melihat kelengkapan segala jenis senjata dan alat perang yang mereka miliki, maka mereka akan takut. Kalian juga dapat membuat takut kaum yang belum kalian ketahui permusuhannya kepada kalian, sedangkan Allah mengetahuinya; Dia Maha Mengerahui hal-hal ghaib. Dan apa yang kalian kerahkan -baik itu banyak maupun sedikit- dalam menyiapkan apa yang kalian mampu seperti kekuatan dan perjuangan di jalan Allah; maka Allah akan membalas perbuatan tersebut dengan balasan yang sempurna; dan musuh-musuh kalian tidak akan memberi kezaliman kepada kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَأَعِدُّوا۟ لَهُم مَّا اسْتَطَعْتُم مِّن قُوَّةٍ (Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi) Makna (القوة) yakni segala apa yang dapat memberi kekuatan seperti senjata, benteng-benteng, pengumpulan peralatan perang, latihan perang, dan segala latihan-latihan lain yang bermanfaat dalam perang. وَمِن رِّبَاطِ الْخَيْلِ (dan dari kuda-kuda yang ditambat untuk berperang) Yakni kuda yang disiapkan untuk menghadapi musuh. تُرْهِبُونَ بِهِۦ عَدُوَّ اللهِ وَعَدُوَّكُمْ((yang dengan persiapan itu) kamu menggentarkan musuh Allah dan musuhmu) Mereka adalah orang-orang musyrik kota Makkah dan lainnya yang memerangi kalian. وَءَاخَرِينَ مِن دُونِهِمْ(dan orang orang selain mereka) Mereka adalah orang-orang munafik. Pendapat lain mengatakan mereka adalah orang-orang Yahudi, dan pendapat lain mengatakan mereka adalah orang-orang Persia, Romawi dan lainnya yang tidak kamu ketahui tingkat permusuhan mereka kepadamu. وَمَا تُنفِقُوا۟ مِن شَىْءٍ فِى سَبِيلِ اللهِ (Apa saja yang kamu nafkahkan pada jalan Allah) Yakni dalam jihad di jalan Allah baik itu dengan harta yang sedikit ataupun yang banyak. يُوَفَّ إِلَيْكُمْ (niscaya akan dibalasi dengan cukup kepadamu) Yakni akan datang kepada kalian pahalanya secara sempurna."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah memerintahkan kepada orang-orang beriman agar mereka mempersiapkan kekuatan untuk menghadapi musuh-musuh; namun hakikatnya Allah mampu membinaskan mereka hanya dengan ucapan-Nya, dan segenggam debu, sebagaimana yang dilakukan oleh Rasulullah ketika musuh-musuh mengepung beliau dari luar rumah, akan tetapi Allah ingin menguji sebagian hamba-Nya kepada sebagian lainnya, maka mereka pun diperintahkan untuk mempersiapkan kekuatan dan peralatan tempur, dan perintah ini terus berlaku hingga zaman kita saat ini, dan Allah menjanjikan atas kesabaran dan ketaqwaan mereka dengan bantuan Malaikat yang lebih besar kekuatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60 Siapkanlah segala perlengkapan senjata materi maupun maknawi untuk menghadapi mereka dengan kekuatan apa saja yang kamu sanggupi dan dari kuda-kuda yang ditambat untuk berperang yang dengan persiapan itu kamu bisa menggentarkan musuh Allah dan musuhmu dan orang orang selain mereka yang kamu tidak mengetahuinya; sedang Allah mengetahuinya. Apa saja yang kamu nafkahkan pada jalan Allah niscaya akan dibalasi dengan cukup kepadamu dan kamu tidak akan dirugikan sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Persiapkanlah} Persiapkanlah {untuk mereka apa yang kalian mampu, berupa kekuatan dan pasukan berkuda. Kalian bisa membuat gentar} membuat takut {musuh Allah dengan itu, musuh kalian dan orang-orang selain mereka} orang-orang kafir selain mereka {yang tidak kalian ketahui} yang tidak kalian kenali menggunakan mata kalian {Allah mengetahui mereka} mengenali mereka {Apa pun yang kalian infakkan di jalan Allah niscaya akan dibalas secara penuh kepada kalian, dan kalian tidak akan dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Dan siapkanlah,” untuk menghadapi musuh-musuhmu, orang-orang kafir yang selalu berusaha mencelakakanmu dan membatalkan agamamu, “kekuatan apa saja yang mereka sanggupi.” Yakni, kekuatan akal (strategi), jasmani, senjata, dan apa saja yang kamu mampu, dimana kekuatan itu dapat membantu kekuatan mereka, termasuk dalam hal ini adalah berbagai keahlian membuat senjata perang dan perangkatnya seperti Meriam, peluru, senapan, pesawat tempur, kendaraan darat, dan laut, benteng, kapal layar, parit, perangkat-perangkat pertahanan, dan mampu menangkal ancaman musuh, termasuk belajar membidik, melatih keberanian, dan seni perang, oleh karena itu Nabi bersabda, “ketahuilah bawa kekutan itu adalah memanah (mambidik).” Termasuk juga mempersiapkan kendaraan yang diperlukan dalam waktu perang. Oleh karena itu Allah berfirman, “Dan dari kuda-kuda yang ditambat untuk berperang yang dipersiapkan itu kamu menggentarkan musuh Allah dan musuhmu.” Illat itu ada padanya pada musuh itu, yaitu yang dapat menggentarkan musuh, dan hukum selalu beriringan dengan illatnya, jika memang ada sesuatu yang lebih mengentarkan daripadanya, seperti kandaraan perang darat dan udara dimana serangannya kepada musuh lebih telak, maka ia pun diperintahkan untuk diusahakan dan dipersiapkan, bahkan jika ia tidak bisa mempelajarinya adalah wajib, karena suatu perkara yang kewajibannya tidak terlaksana kecuali dengannya, maka perkara tersebut hukumnya wajib. Dan FirmnanNya, “ yang dengan persiapan itu kamu menggentarkan musuh Allah dan musuhmu”, dari kalangan orang-orang yang kamu ketahui bahwa mereka adalah musuhmu, “dan orang-orang diesekitarnnya yang kamu tidak mengetahuinya”, dari kalangan orang-orang yang akan memerangimu sesudah ini yang Allah berbicara kepada mereka dengan kekalahan. “sedang Allah mengetahuinya.” Oleh karena itu Allah memerintahkan kamu untuk bersiap-siap menghadapi mereka juga. Dan di antara perkara besar yang membantu dalam memerangi mereka adalah menginginkan harta untuk berjihad melawan orang-orang kafir. Oleh karena itu, Allah mendorong hal itu dengan firmannya, “apasaja yang kamu nafkahan ke jalan Allah”, baik sedikit ataupun banyak “niscaya akan dibalas dengan cukup”, pahalanya pada Hari Kiamat sangat besar, bahkan sedekah di jalan Allah akan dilipat gandakan menjadi tujuh ratus kali lipat berkali- kali. “dan kamu tidak akan di aniaya.” Yakni sedikitpun pahalamu tidak akan dikurangi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 60: Orang-orang kafir yang berusaha membinasakan kamu dan membatalkan agamamu. Baik kepandaian, keterampilan, kekuatan fisik , berbagai persenjataan dan perlengkapan lainnya yang membantu mengalahkan mereka seperti berbagai macam senjata, meriam, senapan, pistol, kendaraan, pesawat tempur, tank, kapal tempur, parit, benteng dan mengetahui taktik berperang. Termasuk di antaranya memanah, Rasulullah shallallahu 'alaihi wa sallam bersabda, “Alaa innal quwwatar ramyu.” (artinya: Ingat! Kekuatan itu adalah memanah.”) ‘Illatnya adalah ini, yakni untuk menggentarkan musuh Allah, dan hukum berjalan bersama ‘illatnya, sehingga apa saja yang membuat mereka gentar, maka perlu dipersiapkan. Seperti kaum musyrik Mekah. Seperti kaum munafik dan orang-orang Yahudi. Kepada mujahidin untuk membantu mereka sedikit maupun banyak. Dikurangi pahalanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 60",
    "description": "Usai memerintahkan agar nabi Muhammad memberi tindakan keras bahkan sampai mengusir yahudi bani quraidhah yang telah merusak perjanjian, maka ayat ini memerintahkan agar mempersiapkan kekuatan semaksimal mungkin untuk menghadapi kemungkinan buruk atau balas dendam dari mereka. Dan karena itu, persiapkanlah dengan segala kemampuan untuk menghadapi mereka yang terbukti secara nyata memusuhi islam, dengan mengerahkan kekuatan apa saja yang kalian miliki dan dari pasukan berkuda yang memang dipersiapkan untuk berperang. Persiapan kekuatan secara maksimal tersebut bertujuan agar dapat menggentarkan musuh Allah, musuh kalian dan juga untuk menggentarkan orang-orang selain mereka yang kalian tidak mengetahuinya baik disebabkan oleh kemunafikannya maupun musuh-Musuh islam yang belum tampak permusuhannya; tetapi Allah senantiasa mengetahuinya, kapan dan di mana saja. Disebabkan sebuah perjuangan di jalan Allah itu membutuhkan biaya besar, maka redaksi berikutnya berisi anjuran untuk mengeluarkan infak: apa saja yang kamu infakkan di jalan Allah niscaya akan dibalas dengan cukup bahkan berlipat ganda asalkan ikhlas kepada kalian dan kalian tidak akan dizalimi, yakni dirugikan atau dikurangi sedikit pun balasan kebaikannyaperang diizinkan dalam islam adalah demi melindungi dakwah, mempertahankan diri dan atau melawan kezaliman, meski berperang bukanlah satu-satunya cara yang dikehendaki, bahkan terciptanya perdamaian adalah lebih didambakan oleh islam. Dan karena itu, wahai kaum muslim, jika mereka atau sebagian dari orang-orang kafir itu condong kepada perdamaian, maka terimalah, sebab bukan perang itu sendiri yang dikehendaki islam, dan untuk menguatkan mental kalian dari kemungkinan munculnya pengkhianatan di balik perdamaian tersebut, maka bertawakAllah kepada Allah, serahkan seluruh urusan kepada-Nya setelah berusaha sekuat tenaga. Sungguh, dia maha mendengar segala bentuk percakapan mereka, maha mengetahui apa saja yang mereka rencanakan atas kalian, dan Allah pasti akan membela kalian."
  }
]