[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila mereka condong untuk meninggalkan peperangan dan berkeinginan untuk menjalin perdamian dengan kalian, maka condonglah kepada hal itu (wahai nabi), dan serahkan urusanmu kepada Allah dan percayalah kepadaNya. Sesungguhnya Dia maha mendengar ucapan-ucapan mereka lagi mahamengetahui niat-niat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Apabila mereka cenderung kepada perdamaian dan berhenti memerangimu, maka -wahai Rasul- silakan menyetujuinya dan ajaklah mereka untuk membuat sebuah perjanjian. Lalu bersandarlah kepada Allah dan percayalah kepada-Nya, niscaya Dia tidak akan menelantarkanmu. Karena Dia Maha Mendengar ucapan mereka lagi Maha Mengetahui apa yang tersimpan di dalam hati mereka dan seluruh perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Jika musuh menginginkan perdamaian dan berhenti dari peperangan, maka terimalah perdamaian mereka, lalu serahkanlah urusan kepada Allah. Allah Maha Mendengar apa yang mereka katakan dan Maha Mengetahui apa yang mereka lakukan, sehingga tidak ada makar dan tipu daya mereka yang tersembunyi dari-Nya, meskipun itu tersembunyi darimu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَإِن جَنَحُوا۟ لِلسَّلْمِ فَاجْنَحْ لَهَا (Dan jika mereka condong kepada perdamaian, maka condonglah kepadanya) Yakni apabila mereka menginginkan perdamaian maka terima dan harapkanlah juga perdamaian. Terdapat pendapat mengatakan bahwa hukum ayat ini telah dinasakh. وَتَوَكَّلْ عَلَى اللهِ ۚ (dan bertawakkallah kepada Allah) Yakni bertawakkallah kepada Allah dalam kecondongan kamu untuk berdamai dengan mereka dan janganlah takut dari tipu daya mereka karena Allah Sesungguhnya Maha Mendengar apa yang mereka katakan dan Maha Mengetahui apa yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61 Jika mereka condong untuk melakukan perdamaian, maka condonglah kepadanya dan bertawakkallah kepada Allah. Sesungguhnya Dialah Yang Maha Mendengar segala perkataan lagi Maha Mengetahui segala perbuatan dan maksud hati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka condong} condong {pada perdamaian} pada perdamaian {maka condonglah pada hal itu} maka condonglah pada hal itu dan berdamailah dengan mereka {dan bertawakallah kepada Allah. Sesungguhnya hanya Dialah Yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Allah berfirman “dan jika mereka condong”, yakni orang-orang kafir yang memerangi kaum Muslimin. Yakni mereka condong kepada kedamaian dan genjatan senjata, “ maka condonglah kepadanya dan bertakwalah kepada Allah.” Yakni, ikutilah keinginan mereka dan bertakwalah kepada Allah karena hal itu mengandung banyak faidah, diantaranya kedamaian adalah tuntutan disetiap waktu, jika mereka yang memulai dalam hal itu maka harus diikuti. Di antara faidah lainya adalah, hal itu memberi waktu bagi pasukan Muslim untuk menyusun kekuatan dan mempersiapkan diri untuk waktu berikutnya jika diperlukan. Di antara faidahnya pula adalah, bahwa jika kamu berdamai dan masing-masing pihak mengetahui apa yang ada pada selainya, maka Islam adalah agama yang tinggi dan tidak ada yang di atasnya. Siapapun yang mempuyai akal dan ilmu, jika memang dia itu obyektip, maka dia pasti akan mengutamakan agama Islam daripada agama lainnya, karena keindahan Islam dan perintahnya dan larangan, dalam pergaulan dalam makhluk, dan dalam keadilan. Dan bahwa tidak ada kezhaliman dan aniaya sedikitpun dalam agama Islam, maka dalam kondisi tersebut akan muncul simpatisan dan pengikut dalam jumlah yang banyak, sehingga perdamaian itu menjadi batu loncatan orang-orang Muslim untuk mengalahkan orang-orang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 61: Ajaran-ajaran Islam begitu mulia, Islam memerintahkan kita memiliki sifat pemaaf, namun dengan memperhatikan agar kejahatan tetap diberikan hukuman yang setimpal agar tidak memunculkan kejahatan yang baru. Islam memerintahkan agar manusia selalu berbuat baik, sekalipun terhadap orang yang pernah berbuat jahat kepadanya. Islam mengajarkan manusia agar mereka banyak beribadah kepada Allah, tetapi jangan menjadi rahib yang melupakan hak diri dan orang lain. Islam memerintahkan manusia berendah hati, namun jangan melupakan harga diri. Oleh karena itu, Islam melarang bersikap lemah dan meminta damai dalam peperangan ketika belum tercapai tujuan, bahkan berdamai di saat seperti ini merupakan kelemahan dan kehinaan. Allah Subhaanahu wa Ta'aala berfirman: \"Janganlah kamu lemah dan minta damai padahal kamulah yang lebih tinggi dan Allah pun bersamamu…\" (Terj. Muhammad: 35) Sesungguhnya perdamaian dalam Islam tidak ada kecuali setelah kuat dan mampu. Oleh karena itu, Allah tidak menjadikan perdamaian secara mutlak dalam semua keadaan, bahkan dengan syarat dapat menghentikan musuh dari permusuhan, dan dengan syarat tidak ada lagi kezhaliman di muka bumi serta seseorang tidak boleh dianiaya ketika menjalankan agamanya dan mendakwahkannya. Menurut Ibnu Abbas, bahwa ayat ini dimansukh dengan ayat perang, sedangkan menurut Mujahid, bahwa ayat ini khusus Ahli Kitab karena turun berkenaan dengan Bani Quraizhah. Namun yang lain berpendapat, bahwa ayat ini berlaku pula terhadap orang-orang kafir harbi (yang memerangi). Menurut Syaikh As Sa’diy, bahwa dari ayat ini dapat diambil beberapa faedah: - Mencari keselamatan dituntut di setiap waktu, jika mereka (musuh) yang memulai maka sangat layak diterima. - Dapat menyegarkan kembali kekuataan kaum muslimin dan mempersiapkan diri untuk berperang pada waku yang lain jika diperlukan. - Jika telah mengadakan perdamaian dan satu sama lain merasa aman sehingga masing-masing pihak dapat mengenal yang lain. Karena Islam adalah tinggi dan tidak ada yang mengalahkan ketinggiannya, maka pihak lain, jika mereka memang memiliki akal dan basirah (mata hati) tentu akan mengutamakan Islam dengan memeluknya, karena ajarannya yang begitu indah. Ketika itulah banyak orang yang cinta kepadanya dan mengikutinya. Dengan demikian, perdamaian dapat membantu kaum muslimin terhadap kaum kafir. Memang, tidak ada yang dikhawatirkan dari adanya perdamaian selain satu perkata; yaitu menipu kaum muslimin dan mereka mengambil kesempatan di sana, maka dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala menerangkan, bahwa Dia yang akan melindungi mereka dari tipu daya mereka, dan bahwa bahayanya akan kembali kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 61",
    "description": "Perang diizinkan dalam islam adalah demi melindungi dakwah, mempertahankan diri dan atau melawan kezaliman, meski berperang bukanlah satu-satunya cara yang dikehendaki, bahkan terciptanya perdamaian adalah lebih didambakan oleh islam. Dan karena itu, wahai kaum muslim, jika mereka atau sebagian dari orang-orang kafir itu condong kepada perdamaian, maka terimalah, sebab bukan perang itu sendiri yang dikehendaki islam, dan untuk menguatkan mental kalian dari kemungkinan munculnya pengkhianatan di balik perdamaian tersebut, maka bertawakAllah kepada Allah, serahkan seluruh urusan kepada-Nya setelah berusaha sekuat tenaga. Sungguh, dia maha mendengar segala bentuk percakapan mereka, maha mengetahui apa saja yang mereka rencanakan atas kalian, dan Allah pasti akan membela kalian. Dan jika mereka, orang-orang kafir, hendak menipumu dengan bersikap baik dan seolah-olah cenderung kepada perdamaian, maka sesungguhnya cukuplah Allah menjadi pelindung bagimu. Dialah satu-satu-Nya yang memberikan kekuatan kepadamu dengan pertolongan-Nya, baik melalui cara yang wajar maupun yang tidak disadari dan dengan dukungan orang-orang mukmin, yaitu dari kaum muhajirin dan ansar."
  }
]