[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan apabila orang-orang yang menjalin perdamaian denganmu bermaksud melakukan makar buruk terhadapmu, maka sesungguhnya Allah akan melindungimu dari tipu daya mereka. Sesungguhnya Dialah Dzat yang mendatangkan kemenangan padamu dan menguatkanmu dengan kaum mukminin dari kalangan kaum muhajirin dan anshar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Jika mereka bermaksud menipumu -wahai Rasul- dengan memperlihatkan kecenderungan untuk berdamai dan berhenti berperang agar mereka bisa kembali menyerangmu, sesungguhnya Allah akan melindungimu dari tipu daya mereka. Dia lah yang akan menguatkanmu dengan pertolongan-Nya dan mendukungmu dengan bantuan orang-orang mukmin dari kalangan Muhajirin dan Ansar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-63. Karena permintaan dari musuh untuk berdamai dan melakukan genjatan senjata bisa jadi adalah tipu daya perang mereka agar dapat menipu kaum muslimin sehingga mereka dapat menyerang mereka ketika sedang lalai; maka Allah memberi arahan pada kemungkinan ini dengan memerintahkannya untuk memperlakukan para musuh sesuai apa yang nampak dari mereka dan memperlakukan mereka sebagai orang yang jujur. Allah berfirman: “Jika mereka menghendaki perdamaian agar dapat membuat tipu daya dan makar, maka cukuplah Allah bagimu dalam mengurusi urusan mereka dan sebagai penolongmu atas mereka. Dan salah satu perhatian Allah kepadamu adalah dengan menjadikan orang-orang beriman menjadi penolongmu, dan menjadikan mereka umat yang saling bahu membahu dalam menolongmu, serta menjadikan mereka beriman kepadamu. Kalaulah bukan karena kenikmatan Allah bagi mereka dengan menjadikan mereka saling bersaudara dalam keimanan yang menjadi persaudaraan yang lebih kuat dari persaudaraan sedarah atau setanah air, niscaya kamu tidak akan mampu mempersatukan hati mereka dengan iming-iming kesenangan dunia; akan tetapi Allah memberi mereka hidayah keimanan. Allah Maha Perkasa atas ketetapan-Nya, sehingga tidak ada tipu daya dan makar yang dapat membatalkan ketetapan-Nya. dan Dia Maha Bijaksana dalam perbuatan-Nya, sehingga Dia menolong kebenaran atas kebatilan, dan lebih mengutamakan perdamaian jika musuh menginginkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَإِن يُرِيدُوٓا۟ أَن يَخْدَعُوكَ (Dan jika mereka bermaksud menipumu) Menipu dengan perdamaian yang kamu sepakati dengan menyembunyikan dalam hati mereka rencana penipuan dan pengkhianatan. فَإِنَّ حَسْبَكَ اللهُ ۚ (maka sesungguhnya cukuplah Allah (menjadi pelindungmu)) Yakni cukuplah Allah sebagai pelindungmu dari apa yang kamu takutkan berupa kejahatan pelanggaran dan pengkhianatan mereka terhadap perdamaian. هُوَ الَّذِىٓ أَيَّدَكَ بِنَصْرِهِۦ وَبِالْمُؤْمِنِينَ (Dialah yang memperkuatmu dengan pertolongan-Nya dan dengan para mukmin) Sesungguhnya Allah telah menguatkanmu dalam menghadapai mereka dengan kemenangan di perang Badar yang lalu, maka Allah juga yang akan menolong dan menguatkanmu ketika mereka melanggar dan mengkhianati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62 Jika mereka bermaksud menipumu dalam janji maupun niat perdamaian dengan berkhianat makar dan merencanakan peperangan, maka sesungguhnya cukuplah Allah yang menjadi pelindungmu. Dialah yang memperkuatmu dengan pertolongan-Nya dan dengan para orang mukmin yang sesungguhnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka ingin menipumu} mengkhianati dan membuat tipu daya kepadamu {sesungguhnya cukuplah Allah bagimu} cukuplah bagimu {Dialah yang menguatkanmu} menguatkanmu {dengan pertolonganNya dan dengan orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-63. tidak ada yang di khawatirkan dalam perdamaian kecuali suatu hal, yaitu bahwa mungkin saja tujuan mereka dalam perdamaian tersebut adalah untuk menipu kaum Muslimin dengan memanfaatkan kesempatan untuk menyerang mereka, maka Allah memberi tahukan bahwa Dia adalah pelindung mereka dan cukuplah Allah sebagai pelindung, bahwa akibat buruk makar mereka akan menimpa mereka sendiri. Dia berfirman, “dan jika mereka hendak bermaksud untuk menipumu, maka sesungguhnya cukuplah Allah menjadi pelindungmu.” Yakni melindungimu dari apa yang menyakitimu. Dia-lah yang mengurusi kemaslahatan dan keperluanmu sebagaimana perlindungan batuannya yang menetramkan hatimu telah kamu rasakan sebelumnya. “dia-lah yang memperkuatmu dengan pertolongannya dan dengan para Mukmin.” Yakni, Allah membantu dengan pertolongan langit yakni pertolongan dariNya yang tidak ada sesuatupun yang dapat menadinginya, dan pertolongan dengan orang-orang Mumin dengan membimbing mereka untuk membantumu. “Dan yang mempersatukan hati mereka,” sehingga mereka kompak bersatu yang karena persatuan itu kekuatan mereka pun bertambah, dan ini bukan karena usaha seseorang, bukan pula dengan kekuatan yang selain kekuatan Allah. “ walaupun kamu membelanjakan semua kekayaanmu yang berada di bumi”, serupa, emas, perak, dan yang selainnya untuk menyatukan mereka setelah perselisihan dan perpecahan yang berat itu, “ niscaya kamu tidak akan dapat mempersatukan hati mereka”, karena tidak ada yang mampu membolak-balik hati kecuali Allah. “Akan tetapi Allah telah mempersatukan hati mereka. Sesungguhnya Dia Mahaperkasa Lagi Mahabijaksana.” Dan diantara keperkasaaNya adalah menyatukan dan mempertemukan setelah sebelumnya tercerai-berai sebagaimana firman Allah, \"dan ingatlah akan nikmat Allah kepadamu ketika kamu dahulu (masa Jahiliyah) bermusuh-musuhan, maka Allah mempersatukan hatimu, lalu menjadilah kamu karena nikmat Allah, orang-orang yang bersaudara; dan kamu telah berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari padanya. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu, agar kamu mendapat petunjuk.\" (Ali-Imran:103)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 62: Dengan mengadakan perdamaian agar mereka dapat bersiap-siap memerangimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 62",
    "description": "Dan jika mereka, orang-orang kafir, hendak menipumu dengan bersikap baik dan seolah-olah cenderung kepada perdamaian, maka sesungguhnya cukuplah Allah menjadi pelindung bagimu. Dialah satu-satu-Nya yang memberikan kekuatan kepadamu dengan pertolongan-Nya, baik melalui cara yang wajar maupun yang tidak disadari dan dengan dukungan orang-orang mukmin, yaitu dari kaum muhajirin dan ansar. Dan sebagai bukti dukungan Allah kepada nabi Muhammad adalah bahwa dia yang mempersatukan hati mereka orang yang beriman, seperti suku aus dan khazraj. Bahkan hal itu rasanya mustahil bisa terwujud, walaupun kamu menginfakkan semua kekayaan yang berada di bumi, dan meski kamu mengerahkan segala upaya dan kemampuanmu niscaya kamu tidak dapat mempersatukan hati mereka. Demikian ini, karena mereka telah bermusuhan dalam rentang waktu yang cukup lama dalam sebuah peperangan yang dikenal dengan perang bu'aÅ¡, bahkan itu telah berjalan sampai ratusan tahun. Akan tetapi, Allah melalui agama islam telah mempersatukan hati mereka. Mereka rela meninggalkan rasa kesukuan yang sudah sedemikian melekat untuk melebur ke dalam ukhuwwah isla'miyyah. Sungguh, dia mahaperkasa, sehingga tidak ada seorang pun yang mampu menandingi-Nya, mahabijaksana atas segala kebijakan-Nya. Hal ini menunjukkan bahwa persatuan dan kesatuan atas dasar cinta dan kasih sayang yang hakiki tidak mungkin terwujud hanya dengan harta kekayaan, akan tetapi harus didasarkan atas keluhuran budi dan ketulusan jiwa."
  }
]