[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mengumpulkan hati-hati kalian setelah setelah berpecah belah. Sekiranya kamu mengeluarkan seluruh kekayaan dunia untuk menyatukan hati mereka, tentulah kamu tidak mampu mencapai jalan menuju ke sana. Akan tetapi, Allah lah yang telah memadukan hati mereka di atas keimannan , sehingga mereka menjadi orang-orang bersaudara yang saling mencintai. Sesungguhnya Dia mahaperkasa dalam kekuasaannNya, lagi maha bijaksana dalam perintah dan pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Dan Allah menyatukan hati orang-orang mukmin yang mendukungmu setelah mereka bercerai-berai. Seandainya kamu membelanjakan semua harta yang ada di bumi ini untuk menyatukan hati mereka yang bercerai-berai itu pasti kamu tidak dapat menyatukan hati mereka. Tetapi Allah sendiri yang mampu menyatukan hati mereka. Sesungguhnya Dia Maha Perkasa dalam kerajaan-Nya, tidak ada seorang pun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menentukan takdir-Nya, mengatur makhluk-Nya, dan menetapkan syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. وَأَلَّفَ بَيْنَ قُلُوبِهِمْ ۚ (dan Yang mempersatukan hati mereka (orang-orang yang beriman)) Yang dimaksud adalah kaum Aus dan Khazraj, dahulu terdapat fanatisme yang sangat kuat terhadap suku masing-masing dan terjadi banyak peperangan diantara keduanya. Kemudian Allah menyatukan hati mereka dengan keimanan kepada Rasulullah Pendapat lain mengatakan yang dimaksud adalah penyatuan hati antara kaum Muhajirin dan kaum Anshar. لَوْ أَنفَقْتَ مَا فِى الْأَرْضِ جَمِيعًا مَّآ أَلَّفْتَ بَيْنَ قُلُوبِهِمْ (Walaupun kamu membelanjakan semua (kekayaan) yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka) Kerena fanatisme kelompok dan permusuhan diantara mereka telah mencapai derajat yang tidak mungkin dihindari dengan cara apapun. وَلٰكِنَّ اللهَ أَلَّفَ بَيْنَهُمْ ۚ (akan tetapi Allah telah mempersatukan hati mereka) Dengan keagungan Kebesaran-Nya dan keindahan apa yang Dia lakukan serta hikmah agama-Nya yang lurus yang diberikan Allah kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Abbas berkata : Sesunguhnya nikmat telah dikufuri, dan kasih sayang telah diputuskan, dan sesungguhnya Allah ta'ala mempersatuhan diantara hati-hati hamba-Nya, dan jika Dia mendekati hati-hati hamba-hamba Nya niscaya tidak akan terusik oleh hal apapun selamanya, kemudian Ibnu Abbas mengutip firman Allah : { لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَلَّفْتَ بَيْنَ قُلُوبِهِمْ } \"Walaupun kamu membelanjakan semua (kekayaan) yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63 Allah Yang mempersatukan hati mereka orang-orang yang beriman, sebagaimana keadaan suku Aus dan Khazraj dari golongan Anshor berupa peperangan. Walaupun kamu membelanjakan semua kekayaan yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka, akan tetapi Allah telah mempersatukan hati mereka dalam petunjuk. Sesungguhnya Dia Maha Gagah tidak terkalahkan lagi Maha Bijaksana dalam segala perbuatan-Nya Yang membuat sesuatu untuk kebaikan dan kemanfaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mempersatukan} mengumpulkan {hati mereka. Jika kamu menginfakkan semua yang berada di bumi, niscaya kamu tidak dapat mempersatukan hati mereka, tetapi Allah telah mempersatukan hati mereka. Sesungguhnya Dia Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-63. tidak ada yang di khawatirkan dalam perdamaian kecuali suatu hal, yaitu bahwa mungkin saja tujuan mereka dalam perdamaian tersebut adalah untuk menipu kaum Muslimin dengan memanfaatkan kesempatan untuk menyerang mereka, maka Allah memberi tahukan bahwa Dia adalah pelindung mereka dan cukuplah Allah sebagai pelindung, bahwa akibat buruk makar mereka akan menimpa mereka sendiri. Dia berfirman, “dan jika mereka hendak bermaksud untuk menipumu, maka sesungguhnya cukuplah Allah menjadi pelindungmu.” Yakni melindungimu dari apa yang menyakitimu. Dia-lah yang mengurusi kemaslahatan dan keperluanmu sebagaimana perlindungan batuannya yang menetramkan hatimu telah kamu rasakan sebelumnya. “dia-lah yang memperkuatmu dengan pertolongannya dan dengan para Mukmin.” Yakni, Allah membantu dengan pertolongan langit yakni pertolongan dariNya yang tidak ada sesuatupun yang dapat menadinginya, dan pertolongan dengan orang-orang Mumin dengan membimbing mereka untuk membantumu. “Dan yang mempersatukan hati mereka,” sehingga mereka kompak bersatu yang karena persatuan itu kekuatan mereka pun bertambah, dan ini bukan karena usaha seseorang, bukan pula dengan kekuatan yang selain kekuatan Allah. “ walaupun kamu membelanjakan semua kekayaanmu yang berada di bumi”, serupa, emas, perak, dan yang selainnya untuk menyatukan mereka setelah perselisihan dan perpecahan yang berat itu, “ niscaya kamu tidak akan dapat mempersatukan hati mereka”, karena tidak ada yang mampu membolak-balik hati kecuali Allah. “Akan tetapi Allah telah mempersatukan hati mereka. Sesungguhnya Dia Mahaperkasa Lagi Mahabijaksana.” Dan diantara keperkasaaNya adalah menyatukan dan mempertemukan setelah sebelumnya tercerai-berai sebagaimana firman Allah, \"dan ingatlah akan nikmat Allah kepadamu ketika kamu dahulu (masa Jahiliyah) bermusuh-musuhan, maka Allah mempersatukan hatimu, lalu menjadilah kamu karena nikmat Allah, orang-orang yang bersaudara; dan kamu telah berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari padanya. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu, agar kamu mendapat petunjuk.\" (Ali-Imran:103)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 63: Penduduk Madinah yang terdiri dari suku Aus dan Khazraj sebelum Nabi shallallahu 'alaihi wa sallam berhijrah ke Madinah selalu bermusuhan dan setelah mereka masuk Islam, permusuhan itu hilang (lihat pula surat Ali Imran: 103). Dengan qudrat (kekuasaan)-Nya, karena tidak ada yang mampu membolak-balikkan hati selain Dia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 63",
    "description": "Dan sebagai bukti dukungan Allah kepada nabi Muhammad adalah bahwa dia yang mempersatukan hati mereka orang yang beriman, seperti suku aus dan khazraj. Bahkan hal itu rasanya mustahil bisa terwujud, walaupun kamu menginfakkan semua kekayaan yang berada di bumi, dan meski kamu mengerahkan segala upaya dan kemampuanmu niscaya kamu tidak dapat mempersatukan hati mereka. Demikian ini, karena mereka telah bermusuhan dalam rentang waktu yang cukup lama dalam sebuah peperangan yang dikenal dengan perang bu'aÅ¡, bahkan itu telah berjalan sampai ratusan tahun. Akan tetapi, Allah melalui agama islam telah mempersatukan hati mereka. Mereka rela meninggalkan rasa kesukuan yang sudah sedemikian melekat untuk melebur ke dalam ukhuwwah isla'miyyah. Sungguh, dia mahaperkasa, sehingga tidak ada seorang pun yang mampu menandingi-Nya, mahabijaksana atas segala kebijakan-Nya. Hal ini menunjukkan bahwa persatuan dan kesatuan atas dasar cinta dan kasih sayang yang hakiki tidak mungkin terwujud hanya dengan harta kekayaan, akan tetapi harus didasarkan atas keluhuran budi dan ketulusan jiwa. Setelah ayat sebelumnya menegaskan kalau masuknya seseorang ke dalam islam bukan semata-mata usaha manusia tetapi juga anugerah Allah, maka melalui ayat ini Allah hendak menguatkan jiwa rasulullah dan kaum mukmin agar tetap konsisten dalam berdakwah dan tidak pernah merasa gentar dengan orang-orang kafir atau siapa pun yang menghalang-halangi dan bahkan memeranginya, sebab di belakangnya ada yang mahakuat, Allah. Karena itu, beliau diseru, wahai nabi Muhammad! tidak ada satu pun yang bisa diandalkan untuk melindungimu, cukuplah Allah menjadi pelindung bagimu dan dikuatkan dengan dukungan dari orang-orang mukmin yang mengikutimu."
  }
]