[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai nabi, sesungguhnya Allah akan mencukupimu dan mencukupi orang-orang mukmin yang bersamamu dari keburukan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Wahai Nabi! Sesungguhnya Allah melindungimu dari kejahatan musuh-musuhmu dan juga melindungi orang-orang mukmin yang bersamamu. Maka percayalah kepada Allah dan bersandarlah kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Allah memberi kabar gembira kepada Nabi Muhammad bahwa Dia akan mencukupkan segala yang dia inginkan terhadap para musuh dan lainnya; dan Dia cukup bagi orang-orang beriman yang menolongnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. يٰٓأَيُّهَا النَّبِىُّ حَسْبُكَ اللهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ (Hai Nabi, cukuplah Allah (menjadi Pelindung) bagimu dan bagi orang-orang mukmin yang mengikutimu) Yakni Allah dan orang-orang beriman cukup bagimu. Dan juga maknanya bisa berarti bahwa Allah cukup bagi kamu dan bagi orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64 Hai Nabi, cukuplah Allah menjadi Pelindung atas kejahatan mereka, bagimu dan bagi orang-orang mukmin yang mengikutimu. Al Kalbiy berkata: ayat ini turun di padang pasir sebelum peperangan di medan Badr"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, cukuplah Allah bagimu dan orang-orang mukmin yang mengikutimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Kemudian Allah berfirman, “ Hai Nabi cukuplah Allah menjadi pelindung bagimu dan bagi orang-orang Mukmin yang mengikutimu.” Yakni pelindung orang-orang Mukmin yang mengikutimu. Ini adalah janji Allah bagi hamba-hambaNya yang beriman yang mengikuti RasulNya, bahwa Dia akan mencukupi, melindungi, dan memenangkan mereka atas musuh, jika mereka melakukan sebabnya, yaitu iman dan ittiba’. Allah pasti akan menjamin apa yang mereka perlukan dari perkara agama dan dunia, perlindungan ini hanya tidak diberikan pada saat syaratnya tidak terlaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 64: Yakni Allah Subhaanahu wa Ta'aala akan menjadikan kaum mukmin membela Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 64",
    "description": "Setelah ayat sebelumnya menegaskan kalau masuknya seseorang ke dalam islam bukan semata-mata usaha manusia tetapi juga anugerah Allah, maka melalui ayat ini Allah hendak menguatkan jiwa rasulullah dan kaum mukmin agar tetap konsisten dalam berdakwah dan tidak pernah merasa gentar dengan orang-orang kafir atau siapa pun yang menghalang-halangi dan bahkan memeranginya, sebab di belakangnya ada yang mahakuat, Allah. Karena itu, beliau diseru, wahai nabi Muhammad! tidak ada satu pun yang bisa diandalkan untuk melindungimu, cukuplah Allah menjadi pelindung bagimu dan dikuatkan dengan dukungan dari orang-orang mukmin yang mengikutimuagar tidak menimbulkan kesan yang salah bahwa seakan-akan mereka hanya mengandalkan pertolongan Allah tanpa usaha, maka ayat ini melanjutkan perintah-Nya kepada nabi Muhammad. Wahai nabi Muhammad! jangan pernah patah semangat dalam situasi dan kondisi apa pun, bahkan kobarkanlah terus semangat para mukmin untuk berperang melawan musuh yang memerangi kalian dalam peperangan. Sebab, jika ada dua puluh orang yang sabar di antara kalian dengan kesabaran yang mantap dan mendarah daging sehingga melahirkan keberanian dan ketahanan jiwa untuk menghadapi kesulitan, niscaya mereka, yakni dua puluh orang itu, akan dapat mengalahkan dua ratus orang musuh. Dan apalagi jika ada seratus orang yang sabar dengan kesabaran yang mantap di antara kamu, niscaya mereka dapat mengalahkan seribu orang kafir. Keberhasilan kaum mukmin yang sabar dalam mengalahkan orangorang kafir meski dengan jumlah yang tidak seimbang tersebut disebabkan orang-orang kafir itu adalah kaum yang tidak mengerti hikmah di balik syariat perang. Mereka berperang hanya semata-mata mempertahankan tradisi jahiliah dan maksud-maksud duniawi lainnya."
  }
]