[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai nabi, doronglah orang-orang yang beriman kepadamu untuk berperang. Jika dari kalian ada duapuluh orang yang teguh bersabar ketika menghadpi musuh, niscaya mereka akan mengalahkan dua ratus orang dari mereka (musuh). lalu bila dari kalian ada seratus mujahid yang teguh bersabar, niscaya mereka akan mengalahkan seribu orang dari orang-orang kafir. Hal itu karena mereka itu (kaum kafir) adalah orang-orang yang tidak memiliki pengetahuan dan tidak memiliki pemahaman sedikitpun tentang kenikmatan yang disediakan Allah bagi orang-orang yang berjihad di jalanNya. sedang mereka berperang demi meraih martabat tinggi di dunia dan melakukan kerusakan di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Wahai Nabi! Doronglah orang-orang mukmin untuk maju ke medan perang. Kobarkanlah semangat juang mereka dengan hal-hal yang dapat menguatkan tekad mereka dan menggugah semangat mereka. Jika di antara kalian -wahai orang-orang mukmin- ada dua puluh orang yang sabar dalam bertempur melawan dua ratus orang-orang kafir niscaya mereka akan mampu mengalahkan orang-orang kafir itu. Dan jika di antara kalian -wahai orang-orang mukmin- ada seratus orang yang sabar niscaya mereka akan mampu mengalahkan seribu orang kafir. Hal itu disebabkan karena orang-orang kafir itu adalah orang-orang yang tidak memahami sunatullah dalam menolong kekasih-kekasih-Nya dan menghancurkan musuh-musuh-Nya. Dan mereka juga tidak mengerti apa tujuan dari perang yang mereka lakukan. Karena mereka berperang hanya untuk menggapai kejayaan di dunia saja."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Setelah Allah memberi kabar gembira bahwa Dia akan menjaga dan menolong Rasulullah, kemudian Allah memerintahkannya untuk memberi dorongan dan semangat kepada orang-orang beriman agar mau berperang, demi mencegah permusuhan dari orang-orang kafir: “Jika terdapat 20 orang yang sabar dari kalian, niscaya kalian akan dapat mengalahkan -berkat keimanan, kesabaran, dan kecerdasan mereka- 200 orang kafir yang tidak memiliki tiga sifat ini.” Ini merupakan janji dan kabar gembira bagi orang-orang beriman; jika mereka bersabar, maka mereka akan dapat mengalahkan sepuluh kali lipat orang kafir dengan pertolongan dan bantuan Allah. Orang-orang beriman dapat mengalahkan mereka karena orang-orang kafir itu tidak memahami hikmah dan tujuan dari perang, yaitu untuk mendapatkan keridhaan Allah dengan menegakkan hukum-hukum-Nya yang adil dan memperbaiki manusia dengan akidah dan akhlak yang benar; mereka juga tidak memahami kewajiban menjalankan hukum-hukum-Nya dengan menyiapkan segala kekuatan yang dapat dilakukan; serta tidak memahami tujuan orang-orang beriman berperang adalah untuk meraih salah satu dari dua kebaikan; yaitu mendapat kemenangan dan harta ghanimah di dunia, atau meraih kesyahidan dan kebahagiaan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. يٰٓأَيُّهَا النَّبِىُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ ۚ (Hai Nabi, kobarkanlah semangat para mukmin untuk berperang) Allah mendorong dan memotifasi mereka, kemudian memberi mereka kabar gembira sebagai peneguh hati dan menenang fikiran mereka dengan firman-Nya: إِن يَكُن مِّنكُمْ عِشْرُونَ صٰبِرُونَ يَغْلِبُوا۟ مِا۟ئَتَيْنِ إِن يَكُن مِّنكُمْ عِشْرُونَ صٰبِرُونَ يَغْلِبُوا۟ مِا۟ئَتَيْنِ ۚ( Jika ada dua puluh orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan dua ratus orang musuh) Kabar gembira ini berisi jumlah tertentu, namun berlaku dengan jumlah berapapun. وَإِن يَكُن مِّنكُم مِّا۟ئَةٌ يَغْلِبُوٓا۟ أَلْفًا(Dan jika ada seratus orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan seribu) Dan jika kaum muslimin dikalahkan dengan jumlah yang lebih sedikit dari jumlah ini maka itu dikarenakan lemahnya iman, kesabaran, persiapan, perselisihan yang terjadi diantara mereka, atau sebab-sebab lain yang telah disebutkan sebagiannya dalam surat ini. Pendapat lain mengatakan bahwa kabar gembira dalam ayat ini bermakna perintah, mereka diperintah oleh Allah agar mereka tetap teguh dalam perang ketika menghadapi musuh mereka yang sepuluh kali lipat lebih banyak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ } \"Hai Nabi, kobarkanlah semangat para mukmin untuk berperang. Jika ada dua puluh orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan dua ratus orang musuh\" seorang relawan gazah mengatakan : sungguh aku belum pernah merasakan makna yang paling indah dari ayat ini sebagaimana yang aku rasakan tatkala aku berada di sebuah parit yang saya gali, ketika itu aku sedang menanti pertemuan dengan musuh, dan sesungguhnya aku bersumpah dengan dzat yang meninggikan langit tanpa tiang, bahwa jika musuh-musuh itu mengetahui bagaimana ruh-ruh kami membumbung tinggi untuk memerangi mereka; niscaya kaki-kaki mereka akan jatuh tunduk dan ketakutan dengan kekuatan kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65 Hai Nabi, kobarkanlah semangat para mukmin untuk memerangi orang musyrik dan musuh sekutunya . Jika ada dua puluh orang yang sabar diantaramu wahai orang mukmin, niscaya mereka akan dapat mengalahkan dua ratus orang musuh. Dan jika ada seratus orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan seribu dari pada orang kafir, disebabkan orang-orang kafir itu kaum yang tidak mengerti hikmah dari peperangan, dan mereka berperang tanpa menggunakan mata hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, kobarkanlah semangat} doronglah {orang-orang mukmin untuk berperang. Jika ada dua puluh orang yang sabar di antara kalian, niscaya mereka dapat mengalahkan dua ratus; dan jika ada seratus orang di antara kalian, niscaya mereka dapat mengalahkan seribu orang kafir karena mereka adalah kaum yang tidak memahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Allah berfirman kepada NabiNya, “Hai Nabi, kobankanlah semangat para Mukmin itu untuk berperang.” Yakni doronglah dan paculah mereka untuk berperang dengan apa yang dapat menguatkan tekad mereka dan melecut semangat mereka, dengan memberikan anjuran dan janji pahala jihad dan melawan musuh, serta memberikan ancaman dan janji dosa terhadap sebaliknya, menjelaskan keutamaan kesabaran dan keberanian, serta apa yang dihasilkannya berupa kebaikan dunia dan akhirat, menjelaskan bahayanya sifat penakut, dan bahwa ia termasuk akhlak tercela yang menodai agama dam muru’ah, dan bahwa orang Mukmin lebih berhak untuk berani daripada yang lain. \"Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.\" (An-Nisa: 104). “JIka di antara kamu”, wahai orang-orang Mukmin “dua puluh orang yang sabar di antara kamu, niscaya mereka dapat mengalahkan dua ratus orang musuh. Dan jika ada seratus orang (yang sabar) di antaramu, mereka dapat mengalahkan seribu orang-orang kafir.” Satu Muslim melawan sepuluh orang kafir. Hal itu karena orang-orang kafir itu adalah “kaum yang tidak mengerti.” Yakni mereka tidak mengetahui tentang apa yang Allah sediakan bagi para mujahidin di jalanNya. Orang-orang kafir berperang demi kekuasaan dan membuat kerusakan di bumi, sementara kamu memahami maksud dari berperang, bahwa ia adalah untuk meninggikan kalimat Allah, meninggikan agamaNya, membela kitabNya, dan meraih kemenangan besar di sisi Allah. Semua itu adalah pendorong untuk berani bersabar, dan maju ke medan perang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 65: Seperti mennyampaikan targhib dan tarhib; yakni dorongan untuk berjihad dan ancaman meninggalkannya, menyebutkan keutamaan jihad, keberanian dan kesabaran, serta bahaya sikap penakut, dan bahwa sikap itu termasuk akhlak yang hina yang mengurangi agama dan kehormatan, dsb. Ayat ini meskipun berupa khabar (berita), namun sesungguhnya mengandung perintah, yakni hendaknya dua puluh orang di antara kamu tidak mundur menghadapi dua ratus orang musuh, dan seratus orang di antara kamu tidak mundur menghadapi seribu orang musuh serta tetap teguh melawan mereka. Menurut Al Baghawi, hal ini berlaku pada perang Badar, yakni Allah mewajibkan seorang dari kaum mukmin untuk melawan sepuluh orang musyrik, namun kemudian yang demikian terasa berat bagi kaum mukmin, maka Allah meringankan mereka dengan menurunkan ayat selanjutnya. Perintah ini namun bentuknya khabar (berita) terdapat rahasia di dalamnya, yaitu untuk menguatkan hati kaum mukmin, dan memberikan kabar gembira, bahwa jika mereka bersabar, maka mereka akan menang. Maksudnya mereka tidak mengerti bahwa perang itu seharusnya untuk membela keyakinan dan menaati perintah Allah. mereka berperang hanya semata-mata mempertahankan tradisi Jahiliyah dan maksud-maksud duniawi lainnya. Mereka juga tidak mengetahui, bahwa Allah telah menyiapkan pahala yang besar untuk para mujahid, sedangkan mereka berperang hanya ingin bersikap sombong dan berbuat kerusakan di bumi. Mereka juga tidak mengetahui, bahwa kaum mukmin memiliki pendorong kuat untuk berperang, untuk meninggikan kalimatullah, meninggikan dan membela agama-Nya, serta untuk memperoleh kenikmatan yang sesunguhnya, yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 65",
    "description": "Agar tidak menimbulkan kesan yang salah bahwa seakan-akan mereka hanya mengandalkan pertolongan Allah tanpa usaha, maka ayat ini melanjutkan perintah-Nya kepada nabi Muhammad. Wahai nabi Muhammad! jangan pernah patah semangat dalam situasi dan kondisi apa pun, bahkan kobarkanlah terus semangat para mukmin untuk berperang melawan musuh yang memerangi kalian dalam peperangan. Sebab, jika ada dua puluh orang yang sabar di antara kalian dengan kesabaran yang mantap dan mendarah daging sehingga melahirkan keberanian dan ketahanan jiwa untuk menghadapi kesulitan, niscaya mereka, yakni dua puluh orang itu, akan dapat mengalahkan dua ratus orang musuh. Dan apalagi jika ada seratus orang yang sabar dengan kesabaran yang mantap di antara kamu, niscaya mereka dapat mengalahkan seribu orang kafir. Keberhasilan kaum mukmin yang sabar dalam mengalahkan orangorang kafir meski dengan jumlah yang tidak seimbang tersebut disebabkan orang-orang kafir itu adalah kaum yang tidak mengerti hikmah di balik syariat perang. Mereka berperang hanya semata-mata mempertahankan tradisi jahiliah dan maksud-maksud duniawi lainnya. Meski ayat ini turun jauh setelah ayat sebelumnya, keduanya memiliki hubungan yang cukup jelas. Yakni setelah ayat sebelumnya memerintahkan agar tetap tegar dalam menghadapi musuh meski dengan jumlah tidak seimbang, maka sekarang, di saat ayat ini turun, Allah telah meringankan kalian, yaitu tidak lagi satu orang sebanding dengan sepuluh orang, karena dia mengetahui bahwa ada kelemahan pada kalian, baik dari segi mentalitas maupun kelengkapan persenjataan, tidak seperti orang-orang mukmin sebelumnya. Maka jika di antara kalian, wahai kaum mukmin, ada seratus orang yang sabar dengan kesabaran yang mantap, niscaya mereka dapat mengalahkan dua ratus orang musuh dalam peperangan; dan jika di antara kalian ada seribu orang yang sabar, niscaya mereka dapat mengalahkan dua ribu orang kafir dengan seizin Allah. Allah beserta orang-orang yang sabar dengan selalu memberi pertolongan dan atau menguatkan mental mereka."
  }
]