[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekarang, Allah telah meringankan kewajiban dari kalian wahai kaum mukminin, karena pada diri kalian terdapat kelemahan. maka apabila dari kalian ada serratus orang teguh bersabar, niscaya mereka akan dapat mengalahkan dua ratus orang kafir. Dan apabila dari kalian terdapat seribu orang, niscaya akan sanggup mengalahkan dua ribu orang dari mereka dengan izin Allah .Dan Allah bersama orang-orang yang bersabar dengan dukungan dan pertolonganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Sekarang Allah telah memberikan keringanan kepada kalian -wahai orang-orang mukmin- setelah Dia mengetahui kelemahan kalian. Dia memberikan keringanan kepada kalian sebagai wujud kasih sayang-Nya kepada kalian. Maka Dia mewajibkan satu orang dari kalian untuk bertahan jika berhadapan dengan dua orang kafir, bukan sepuluh, di medan perang. Jika ada seratus orang dari kalian yang sabar dalam menghadapi orang-orang kafir di medan perang mereka akan mengalahkan dua ratus orang kafir. Dan jika ada seribu orang dari kalian yang sabar niscaya akan mengalahkan dua ribu orang kafir dengan izin Allah. Dan Allah senantiasa bersama orang-orang mukmin yang sabar dengan memberikan pertolongan dan dukungan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Setelah Allah menjelaskan tingkatan yang tinggi yang seharusnya dimiliki orang-orang beriman, kemudian Allah menjelaskan tingkatan dibawahnya, yaitu tingkatan yang lemah sehingga mengganti tingkatan yang sebelumnya: “Jika kalian adalah pasukan yang sabar dengan jumlah 100 orang -setelah Allah mengetahui kelamahan yang ada dalam diri kalian- maka kalian akan dapat mengalahkan 200 orang musuh. Dan jika kalian adalah pasukan yang sabar yang berjumlah seribu orang, maka kalian akan dapat mengalahkan dua ribu orang musuh dengan izin, kuasa, dan kehendak Allah. Allah bersama orang-orang yang sabar dengan bantuan dan pertolongan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. الْـٰٔنَ خَفَّفَ اللهُ عَنكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضَعْفًا ۚ فَإِن يَكُن مِّنكُم مِّا۟ئَةٌ صَابِرَةٌ يَغْلِبُوا۟ مِا۟ئَتَيْنِ ۚ (Sekarang Allah telah meringankan kepadamu dan dia telah mengetahui bahwa padamu ada kelemahan. Maka jika ada diantaramu seratus orang yang sabar, niscaya mereka akan dapat mengalahkan dua ratus orang kafir) Setelah kaum muslimin merasa berat dan kesusahan untuk melakukan perintah untuk menghadapi musuh mereka yang sepuluh kali lipat lebih banyak maka Allah memberi keringanan dan rukhshoh untuk mereka sebab Allah mengetahui bahwa dalam diri mereka terdapat ketikamampuan. Dan dengan ayat ini Allah mewajibkan satu orang dari mereka untuk tetap teguh dalam perang ketika menghadapi dua orang kafir. بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ(disebabkan orang-orang kafir itu kaum yang tidak mengerti) Mereka berperang tanpa petunjuk yang lurus, dan barangsiapa yang melakukan hal ini maka kebanyakan mereka akan kalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66 Saat Allah memberi ujian berat maka Allah telah meringankan kepada mereka dan dia telah mengetahui bahwa padamu ada kelemahan untuk satu orang membunuh sepuluh semisalnya, dan yang wajib hanyalah membunuh dua. Maka jika ada di antaramu seratus orang yang sabar, niscaya mereka akan dapat mengalahkan dua ratus orang kafir; dan jika di antaramu ada seribu orang yang sabar, niscaya mereka akan dapat mengalahkan dua ribu orang, dengan seizin Allah. Dan Allah beserta orang-orang yang sabar. Ibnu Abbas berkata ketika Allah mewajibkan setiap orang untuk membunuh sepuluh orang itu terlalu berat untuk mereka. Sehingga Allah hanya mewajibkan untuk setiap orang membunuh dua orang saja, maka turunlah dua ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekarang Allah telah meringankan kalian dan Dia mengetahui sesungguhnya ada kelemahan pada kalian. Jika di antara kalian ada seratus orang sabar, niscaya mereka dapat mengalahkan dua ratus orang dan jika di antara kalian ada seribu orang, niscaya mereka dapat mengalahkan dua ribu orang dengan seizin Allah. Allah bersama orang-orang yang sabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Kemudian Allah meringankan hukum ini atas hamba-hambaNYa. Dia berfirman, “Sekarang Allah telah meringankan kepadamu dan Dia telah mengetahui bahwa padamu ada kelemahan.” Oleh karena itu hikmah dan rahmatNya menuntut adanya keringanan. “Maka jika ada di antaramu seratus orang yang sabar, niscaya mereka dapat mengalahkan dua ratus orang, dan jika di antaramu ada seribu orang (yang sabar), niscaya mereka dapat mengalahkan dua ribu orang dengan seizin Allah. Dan Allah beserta orang-orang yang sabar”, dengan dukungan dan pertolonganNya. Konteks ayat-ayat ini berbentuk berita tentang orang-orang Mukmin bahwa jika mereka mencapai jumlah tertentu tersebut, mereka akan mengalahkan jumlah tertentu dari orang-orang kafir, bahwa Allah memberikan nikmat kepada mereka dengan keberanian iman yang mereka miliki, akan tetapi makna dan hakikatnya adalah perintah, bahwa pada awalnya Allah memerintahkan orang-orang Mukmin, bahwa satu orang Mukmin melawan sepuluh orang kafir dan tidak boleh berlari dari mereka, sepuluh menghadapi seratus dan seratus menghadapi seribu kemudian Allah meringankan itu, maka orang Muslim tidak boleh berlari jika berhadapan dengan orang-orang kafir yang berjumlah dua kali dari mereka, jika lebih maka boleh berlari: Akan tetapi pemahaman ini disanggah dengan dua hal: Pertama: konteks ayat ini berbentuk berita, dan berita pada dasarnya sesuai dengan keberadaannya, bahwa maksud dari itu adalah penyebutan nikmat dan pemberitahuan tentang realita yang terjadi. Kedua: Pembatasan angka tersebut, apabila mereka adalah orang-orang yang sabar, terlatih di atas kesabaran, makna tersiratnya adalah bahwa jika mereka bukan orang-orang yang bersabar, maka dibolehkan untuk berlari, meski orang-orang kafir itu kurang dari dua kali lipat mereka, jika perkiraan mereka akan kalah, sebagaimana hal itu merupakan tuntutan hikmah ilahiyah. Yang pertama dijawab dengan mengatakan bahwa FirmanNya, “Sekarang Allah telah meringankan kepadamu…” dan seterusnya adalah dalil bahwa perkara ini adalah wajib dan perintah tak bisa ditawar. Kemudian Allah meringankannya menjadi jumlah tersebut, ini jelas sekali bahwa ia adalah perintah, meski dengan konteks berita. Bisa juga dikatakan bahwa konteks berita yang dihadirkan mengandung rahasia indah yang tidak ada pada bahasa perintah, yaitu memompa semangat orang-orang Mukmin dan berita gembira bahwa mereka akan mengalahkan orang-orang kafir. Yang kedua dijawab dengan mengatakan bahwa yang dimaksud pembatasan dengan orang-orang yang bersabar adalah sebagai pemacu kepada kesabaran, bahwa orang-orang Mukmin harus melakukan sebab-sebabnya, jika mereka telah melakukannya maka sebab-sebab iman dan materiil memberi isyarat gembira terwujudnya kemenangan yang dijanjikan oleh Allah untuk kelompok kecil ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 66: Imam Bukhari meriwayatkan dari Ibnu Abbas, bahwa ketika turun ayat, “Jika ada dua puluh orang yang sabar di antara kamu, niscaya mereka dapat mengalahkan dua ratus orang musuh.” Yang demikian memberatkan mereka (kaum muslimin) ketika seorang diri diwajibkan untuk tidak melarikan diri dari sepuluh orang, maka datanglah keringanan. Allah Ta’ala berfirman, “Sekarang Allah telah meringankan kamu karena Dia mengetahui bahwa ada kelemahan padamu. Maka jika ada di antara kamu ada seratus orang yang sabar, niscaya mereka dapat mengalahkan dua ratus orang (musuh);…dst.” Ayat ini pun sama, khabar (berita) namun maksudnya adalah perintah, yakni perintah agar tetap menghadapi musuh dan tidak mundur ketika mereka berjumlah dua kali lipat. Jika lebih dari dua kali lipat, barulah dibolehkan mundur. Dengan pertolongan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 66",
    "description": "Meski ayat ini turun jauh setelah ayat sebelumnya, keduanya memiliki hubungan yang cukup jelas. Yakni setelah ayat sebelumnya memerintahkan agar tetap tegar dalam menghadapi musuh meski dengan jumlah tidak seimbang, maka sekarang, di saat ayat ini turun, Allah telah meringankan kalian, yaitu tidak lagi satu orang sebanding dengan sepuluh orang, karena dia mengetahui bahwa ada kelemahan pada kalian, baik dari segi mentalitas maupun kelengkapan persenjataan, tidak seperti orang-orang mukmin sebelumnya. Maka jika di antara kalian, wahai kaum mukmin, ada seratus orang yang sabar dengan kesabaran yang mantap, niscaya mereka dapat mengalahkan dua ratus orang musuh dalam peperangan; dan jika di antara kalian ada seribu orang yang sabar, niscaya mereka dapat mengalahkan dua ribu orang kafir dengan seizin Allah. Allah beserta orang-orang yang sabar dengan selalu memberi pertolongan dan atau menguatkan mental merekabeberapa ayat sebelumnya menjelaskan tentang ketentuan-ketentuan dalam peperangan, di antaranya adalah ketentuan pembagian rampasan perang, maka ayat ini menjelaskan hukum-hukum lainnya, yaitu me-Nyangkut tawanan perang. Tidaklah pantas, bagi seorang nabi mempunyai tawanan sebelum dia kukuh di muka bumi sehingga dapat melumpuhkan musuhnya di bumi. Teguran ini ditujukan kepada beliau, namun yang dimaksudkan adalah kaum muslim saat itu, dengan pengalihan arah pembicaraan dari orang ketiga kepada orang kedua jamak (kalian). Demikian ini, karena melalui tawanan biasanya kalian menghendaki harta benda duniawi dengan cara tawanan tersebut dibebaskan dan diganti dengan tebusan. Padahal, balasan duniawi itu akan sirna, sedangkan Allah menghendaki pahala akhirat yang bersifat kekal untuk kalian; dan justru pahala akhirat inilah yang sesungguhnya menjadi tujuan kalian dalam berjihad demi menegakkan agama Allah. Allah mahaperkasa sehingga tidak mampu dikalahkan oleh siapa pun, bahkan dia mampu memberi kemenangan kepada umat islam dalam peperangan, seperti pada pe."
  }
]