[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak sepatutnya bagi nabi, untuk memiliki tawanan perang dari musuh-musuhnya sampai ia benar-benar mengambil tindakan tegas dalam membunuh mereka, untuk menenamkan rasa takut ke dalam hati mereka dan menancapkan tonggak-tonggak agama. Kalian menghendaki (wahai kaum muslimin) untuk mengambil tebusan dari para tawanan perang badar berupa kekayaan dunia, padahal Allah menghendaki untuk menampakkan agamaNya yang menjadi sarana mencapai akhirat. Dan Allah mahaperkasa yang tidak terkalahkan, juga mahabijaksana dalam aturan syari’atNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Tidak sepatutnya seorang Nabi memiliki tawanan perang dari golongan kafir yang menyerangnya sebelum ia berhasil menghabisi banyak orang kafir. Hal itu dimaksudkan untuk menggentarkan hati mereka sehingga tidak kembali menyerangnya. Kalian -wahai orang-orang mukmin- ingin menjadikan tawanan perang Badar sebagai alat untuk meminta tebusan. Sedangkan Allah menghendaki (kalian mendapatkan kebahagiaan hidup di) Akhirat yang dapat diperoleh dengan menolong dan memenangkan agama-Nya. Dan Allah Maha Perkasa di dalam Żāt-Nya, sifat-sifat-Nya, dan kekuatan-Nya, tidak ada seorang pun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menentukan takdir-Nya dan menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Bukan sikap dan perbuatan seorang nabi ketika dalam perang dan mendapatkan banyak tawanan, kemudian dia ragu dalam memperlakukan mereka, apakah akan membebaskan atau meminta tebusan mereka, kecuali jika dia telah mendapat kemenangan dengan membunuh musuh-musuhnya. Kalian menginginkan harta dunia yang fana yang akan kalian ambil dari tebusan para tawanan; sedangkan Allah menghendaki pahala akhirat yang kekal bagi kalian dengan hukum-hukum yang Allah syariatkan kepada kalian agar kalian dapat meraih pahala tersebut selama kalian mengamalkannya. Allah Maha Sempurna kemuliaan-Nya; seandainya Dia menghendaki kemenangan bagi kalian dalam melawan orang-orang kafir tanpa perang, niscaya Allah akan melakukannya; akan tetapi Allah Maha Bijaksana dengan menguji sebagian kalian dengan sebagian lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. مَا كَانَ لِنَبِىٍّ أَن يَكُونَ لَهُۥٓ أَسْرَىٰ حَتَّىٰ يُثْخِنَ فِى الْأَرْضِ ۚ (Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi) Dengan tercapainya kehancuran dari pertahanan yang dapat dilakukan oleh orang-orang kafir dan kamampuan gerakan mereka untuk melawan kalian. Allah mengabarkan dalam ayat ini bahwa orang-orang musyrik wajib dibunuh oleh orang-orang beriman pada perang Badar, dan bukan dengan menjadikan mereka tawanan lalu meminta mereka tebusan sebagaimana yang orang-orang beriman lakukan ketika itu. تُرِيدُونَ عَرَضَ الدُّنْيَا(Kamu menghendaki harta benda duniawiyah) Yakni manfaat dan kenikmatannya melalui harta yang kalian dapatkan dari tebusan para tawanan. وَاللهُ يُرِيدُ الْاٰخِرَةَ ۗ( sedangkan Allah menghendaki (pahala) akhirat (untukmu)) Dengan pahala yang kalian dapatkan melalui penghancuran orang-orang kafir dengan membunuh mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 Tidak patut, bagi seorang Nabi mempunyai tawanan dan mengambil tebusan sebelum ia dapat melumpuhkan musuhnya di muka bumi, dan menetapkan perkara dan meninggikan kerajaannya Wahai orang mukmin, kamu menghendaki harta benda duniawiyah dengan mengambil tebusan dari tawanan, sedangkan Allah menghendaki pahala akhirat untukmu.. Dan Allah Maha Perkasa tidak terkalahkan lagi Maha Bijaksana dalam segala perbuatan-Nya. Ayat ini turun ketika Nabi memilih pendapat Abu Bakar dadlam memberi maaf atas tawanan Badr dan menerima tebusan dari mereka, dan tidak menerima pendapat Umar untuk membunuh mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak patut} tidak sepatutnya {bagi seorang nabi mempunyai tawanan sampai dia dapat melumpuhkan musuhnya} banyak mengalaahkan orang-orang kafir {di bumi. Kalian menghendaki harta benda} kesenangan {dunia, dan Allah menghendaki akhirat. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Ini adalah teguran Allah kepada RasulNya dan orang-orang yang beriman pada hari Perang Badar, manakala mereka menawan orang-orang musyrik dan membiarkan mereka untuk harta tebusan. Ketika itu Umar bin al-Khattab telah mengusulkan agar para tawanan itu dibunuh dan dihabisi saja. Allah berfirman, “Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi.” Yakni tidak layak dan tidak pantas bagi Nabi, jika Nabi memerangi orang-orang kafir yang hendak memadamkan cahaya Allah, berusaha mematikan agamaNya, memberangus siapa pun di bumi ini yang menyembah Allah, untuk menawan orang-orang kafir dan membiarkannya hidup demi harta tebusan dari mereka, karena ia hanyalah harta sedikit jika dibandingkan dengan kemaslahatan yang menuntut pemusnahan mereka dan penangkalan terhadap keburukan mereka. Selama mereka memendam keburukan dan memiliki gerakan, maka yang lebih utama adalah tidak menawan mereka, jika mereka telah bisa dilumpuhkan, kejahatan mereka terkikis dan kekuatan mereka sirna, maka dalam kondisi tersebut tidak mengapa menawan mereka dan membiarkan mereka hidup. Allah berfirman, “Kamu menghendaki”, dengan menerima tebusan dari mereka “harta benda dunia”, bukan kemaslahatan yang kembali kepada agamamu “sedangkan Allah menghendaki (pahala) akhirat (untukmu).” Dengan memuliakan agamaNya, memenangkan para walliNya, dan menjadikan kalimat mereka tinggi di atas yang lain, maka Dia memerintahkanmu untuk melakukan sesuatu yang dapat menyampaikanmu ke sana. “Dan Allah Mahaperkasa lagi Mahabijaksana.” Yakni perkasa dengan sempurna, jika Allah mau, Allah bisa mengalahkan orang-orang kafir tanpa perang, akan tetapi Allah Mahabijaksana, menguji sebagian kamu dengan sebagian yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 67: Ayat ini turun ketika mereka (Nabi shallallahu ‘alaihi wa sallam dan para sahabat) mengambil tebusan dari para tawanan perang Badar. Hakim meriwayatkan dari Ibnu Umar radhiyallahu 'anhuma, ia berkata, “Rasulullah shallallahu 'alaihi wa sallam bermusyawarah dengan Abu Bakar untuk menyikapi para tawanan. Abu Bakar berkata, ”Mereka adalah kaummu dan keluargamu, maka lepaskanlah.” Lalu Beliau bermusyawarah dengan Umar, ia berkata, “Bunuhlah mereka.” Lalu Rasulullah shallallahu 'alaihi wa sallam mengambil tebusan dari mereka, maka Allah Azza wa Jalla menurunkan ayat, “Maa kaana linabiyyin…dst. Sampai ayat, “Fa kulu mimmaa ghanimtum halaalan thayyibaa.” (Al Anfal: 67-69). Ibnu Umar berkata, “Maka Nabi shallallahu 'alaihi wa sallam menemui Umar dan berkata, “Hampir saja kami ditimpa azab karena menyelisihimu.” (Hadits ini shahih isnadnya, menurut Adz Dzahabi sesuai syarat Muslim). Padahal mereka menginginkan agar cahaya Allah padam dan berusaha menghancurkan agama-Nya. Mereka menginginkan agar Allah tidak disembah dan agar yang disembah adalah selain-Nya. Mereka menginginkan agar kezaliman dan kemaksiatanlah yang menguasai dunia, dan tidak suka kalau keadilan dan ketaatan yang menguasai dunia. Mereka suka jika bumi ini rusak dan tidak suka diperbaiki. Oleh karenanya, mereka patut dilumpuhkan. Yakni menghabisi. Dengan mengambil tebusan itu, bukan menginginkan maslahat untuk agama kamu. Dengan mengunggulkan agama-Nya, memenangkan para wali-Nya, dan menjadikan mereka berada di atas yang lain. Oleh karena itu, Dia memerintahkan sesuatu yang dapat mencapai kepadanya. Namun ayat ini dimansukh dengan surat Muhammad ayat 4. Keperkasaan-Nya sempurna, jika Dia menghendaki, Dia mampu memberikan kemenangan terhadap orang-orang kafir tanpa melalui peperangan, akan tetapi Dia Mahabijaksana, Dia menguji sebagian kamu dengan sebagian yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 67",
    "description": "Beberapa ayat sebelumnya menjelaskan tentang ketentuan-ketentuan dalam peperangan, di antaranya adalah ketentuan pembagian rampasan perang, maka ayat ini menjelaskan hukum-hukum lainnya, yaitu me-Nyangkut tawanan perang. Tidaklah pantas, bagi seorang nabi mempunyai tawanan sebelum dia kukuh di muka bumi sehingga dapat melumpuhkan musuhnya di bumi. Teguran ini ditujukan kepada beliau, namun yang dimaksudkan adalah kaum muslim saat itu, dengan pengalihan arah pembicaraan dari orang ketiga kepada orang kedua jamak (kalian). Demikian ini, karena melalui tawanan biasanya kalian menghendaki harta benda duniawi dengan cara tawanan tersebut dibebaskan dan diganti dengan tebusan. Padahal, balasan duniawi itu akan sirna, sedangkan Allah menghendaki pahala akhirat yang bersifat kekal untuk kalian; dan justru pahala akhirat inilah yang sesungguhnya menjadi tujuan kalian dalam berjihad demi menegakkan agama Allah. Allah mahaperkasa sehingga tidak mampu dikalahkan oleh siapa pun, bahkan dia mampu memberi kemenangan kepada umat islam dalam peperangan, seperti pada penamun begitu, Allah tetap menunjukkan belas kasih-Nya terhadap orang-orang yang beriman, dan ayat ini menjadi bukti kasih sayangnya. Sekiranya tidak ada ketetapan terdahulu dari Allah, yaitu bahwa dia akan memaafkan hamba-Nya yang melakukan ijtihad dan ternyata salah, niscaya kalian ditimpa siksaan yang besar karena kalian telah mengambil keputusan yang salah melalui tebusan yang kalian ambil."
  }
]