[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya tidak ada kitab dari Allah yang telah berjalan qadha dan qadar di atas ketetapan itu untuk menghalalkan harta rampasan dan diperbolehkannya tebusan terhadap tawanan bagi umat ini, pastilah akan menimpa kalian siksaan di sebabkan kalian mengambil harta rampasan perang dan uang tebusan sebelum turun aturan syariat tentang dua perkara tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Kalaulah bukan karena adanya ketetapan dari Allah yang sudah ditetapkan dengan kada dan kadar-Nya, bahwa Dia menghalalkan ganimah (harta rampasan perang) bagi kalian dan memperbolehkan kalian mengambil tebusan dari tawanan perang, niscaya kalian akan ditimpa azab yang sangat berat dari Allah karena kalian telah mengambil ganimah dan tebusan sebelum turunnya wahyu dari Allah yang memperbolehkan hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Kalaulah tidak ada ketetapan Allah sebelumnya dalam ilmu-Nya yang azali, untuk tidak mengazab kalian ketika Rasulullah bersama kalian dan kalian senantiasa memohon ampun niscaya kalian akan mendapat azab yang besar akibat harta tebusan yang kalian ambil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. لَّوْلَا كِتٰبٌ مِّنَ اللهِ سَبَقَ لَمَسَّكُمْ فِيمَآ أَخَذْتُمْ (Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah, niscaya kamu ditimpa karena tebusan yang kamu ambil) Yakni disebabkan harta tebusan yang kalian ambil dari para tawanan di perang Badar. عَذَابٌ عَظِيمٌ (dengan siksaan yang besar) Yakni ketetapan Allah ini merupakan ilmu Allah yang telah ada sebelumnya bahwa Allah telah mengampuni para pasukan muslimin di perang Badar terhadap dosa-dosa mereka yang telah lalu dan yang akan datang. Rasulullah pernah berkata kepada Umar bin Khattab: ketahuilah bahwa Allah ketika melihat para pasukan perang Badar Dia berfirman: “Lakukanlah apa saja yang kalian mau, sesungguhnya Aku telah mengampuni kalian”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "68-69 1 ). Sebagaimana yang ditetapkan dalam syari'at bahwa ada pengampunan ketika seseorang berbuat kesalahan dalam ijtihadnya, tentunya tergantung bagaimana para ulama dan ahli ushul menjelaskannya secara terperinci, dan diantara ayat yang menjadi dalil rujukannya adalah : { لَوْلَا كِتَابٌ مِنَ اللَّهِ سَبَقَ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ عَذَابٌ عَظِيمٌ } \"Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah, niscaya kamu ditimpa siksaan yang besar karena tebusan yang kamu ambil\". Oleh karena itu hendaklah setiap ayah dan para pendidik menyesuaikan ayat ini tatkala sedang dalam fase didikan kepada orang selainnya. 2 ). AL-Qur'an senantiasa menjadi penawar bagi kesalahan-kesalahan anak adam dan mencela secara lembut orang-orang yang berbuat salah, namun bukan untuk menghukum mereka, sungguh tidaklah peringatan itu datang kecuali agar mereka tidak mengulangi kesalahan itu, dan agar mereka segera bertaubat dari kesalahan itu, oleh karena itu sering didapati ayat rahmat datang setelah ayat peringatan dan ancaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68 Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah di Lauhil Mahfudz, untuk tidak menyiksa orang yang salah dalam ijtihad, niscaya kamu akan ditimpa siksaan yang besar karena tebusan yang kamu ambil. Juga ditafsirkan dalam kitab bahwa umat Muhammad tidak disiksa sebab ampunan Allah kepada para ahli Badr"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika tidak ada ketetapan} ketetapan dan hukum {terdahulu dari Allah, niscaya kalian ditimpa} kalian ditimpa {siksaan yang besar karena apa yang kalian ambil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Kalau sekiranya tidak ada ketetapan yang telah terdahulu dari Allah”, yaitu qadha dan qadarNya, bahwa Dia telah menghalalkan harta rampasan perang untukmu dan bahwa Allah telah mengangkat azab darimu wahai umat “niscaya kamu ditimpa siksaan yang besar karena tebusan yang kamu ambil.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 68: Thayalisi meriwayatkan dari Abu Hurairah ia berkata, “Ketika perang Badar, orang-orang segera mendatangi ghanimah dan mengambilnya, maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Sesungguhnya ghanimah tidaklah halal bagi seorang yang berkepala (berambut) hitam selain kamu.” Oleh karena itu, (dahulu) nabi dan para sahabatnya apabila mendapatkan ghanimah, mereka mengumpulkannya, lalu turunlah api memakannya, maka Allah menurunkan ayat ini, “Laulaa kitaabum minallah…dst.” (Al Anfaal: 68-69). Hadits ini diriwayatkan pula oleh Tirmidzi dan ia berkata, “Hadits hasan shahih”, dan Ibnul Jariud hal. 368, penta’liq kitab tersebut berkata, “Diriwayatkan pula oleh Ahmad, Nasa’i, Ibnu Hibban hal. 402 dari Mawaarid, Ibnu Jarir juz 10 hal. 46, Ibnu Abi Hatim juz 4 hal. 20, Baihaqi juz 6 hal. 290, dan Thahawi dalam Musykilul Atsar juz 4 hal. 292.” Imam Hakim meriwayatkan dari Khaitsamah, ia berkata, “Sa’ad bin Abi Waqqas radhiyallahu 'anhu pernah berada dalam sebuah rombongan, lalu mereka menyebut-nyebut Ali dan memakinya, maka Sa’ad berkata, “Sabar dulu terhadap para sahabat Rasulullah shallallahu 'alaihi wa sallam, karena kami memperoleh dunia bersama Rasulullah shallallahu 'alaihi wa sallam, lalu Allah Azza wa Jalla menurunkan ayat, “Laulaa kitaabum minallah sabaqa lamassakum fiimaa akhadztum ‘adzaabun ‘azhiim.” (Al Anfal: 68), saya berharap rahmat dari sisi Allah datang mendahului untuk kita.” Lalu sebagian mereka berkata, “Demi Allah, sesunguhnya dia membencimu dan menamaimu sebagai Akhnas (kutu).” Maka Sa’ad tertawa sampai terbahak-bahak, kemudian ia berkata, “Bukankah seseorang terkadang marah kepada saudaranya dalam masalah yang terjadi antara dia dengan orang lain, lalu ia tidak mau menyampaikan amanahnya.” Dan ia menyebut kata-kata lagi yang lain. (Hadits ini shahih, sesuai syarat Bukhari dan Muslim, namun keduanya tidak menyebutkannya). Yang menetapkan halalnya ghanimah dan diangkat-Nya azab dari kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 68",
    "description": "Namun begitu, Allah tetap menunjukkan belas kasih-Nya terhadap orang-orang yang beriman, dan ayat ini menjadi bukti kasih sayangnya. Sekiranya tidak ada ketetapan terdahulu dari Allah, yaitu bahwa dia akan memaafkan hamba-Nya yang melakukan ijtihad dan ternyata salah, niscaya kalian ditimpa siksaan yang besar karena kalian telah mengambil keputusan yang salah melalui tebusan yang kalian ambilsetelah Allah menegur nabi Muhammad disebabkan mengambil keputusan yang salah karena mengikuti pendapat beberapa sahabat beliau, yaitu mengambil tebusan dari tawanan, maka melalui ayat ini Allah membolehkan untuk mengambil dan memanfaatkan rampasan perang tersebut sesuai dengan ketentuan Allah sebelumnya. Karena itu, makanlah dari sebagian rampasan perang yang telah kalian peroleh itu yang boleh jadi, sebelumnya kalian mengira hal itu tidak diperbolehkan sebagai akibat dari teguran keras tersebut. Karena itu, janganlah kalian ragu untuk memakannya sebagai makanan yang halal lagi baik bagi diri kalian dan bertakwalah kepada Allah. Sungguh, Allah maha pengampun, maha penyayang bagi siapa saja yang bertobat dan kembali kepada-Nya."
  }
]