[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah oleh kalian (wahai orang-orang yang mendebat), janji Allah kepada kalian berupa kemenangan dengan salah satu dari dua golongan yang ada; yaitu kafilah rombongan dagang dan barang-barang perniagaan yang dibawanya atau berperang menghadapi musuh dan menang atas mereka, sedang kalian lebih suka meringkus rombongan dagang itu tanpa ada peperangan.Dan Allah menghendaki untuk menegaskan kebenaran islam dan meninggikannya dengan perintahNya kepada kalian untuk memerangi orang-orang kafir dengan kebinasaan sampai akar-akarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Ingatlah -wahai orang-orang mukmin yang membantah perintah Rasulullah- tatkala Allah menjanjikan kepada kalian bahwa Dia akan memberi kalian kemenangan terhadap salah satu dari dua golongan orang-orang musyrik. Yaitu kafilah dagang berikut barang dagangan yang mereka bawa, maka kalian dapat mengambilnya sebagai ganimah. Atau pasukan perang yang dapat kalian lawan dan kalian kalahkan berkat pertolongan Allah. Kalian menginginkan kafilah dagang karena mudah ditaklukkan, bahkan tanpa pertempuran. Tetapi Allah berkehendak untuk mengukuhkan kebenaran dengan cara memerintahkan kalian berperang melawan para pembesar orang-orang musyrik dan menjadikan banyak dari mereka sebagai tawanan perang, sehingga kekuatan Islam nampak gemilang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7- 8. Kemudian Allah menjelaskan sebagian karunia-Nya yang diberikan kepada orang-orang beriman, meskipun sebagian mereka enggan untuk memerangi musuh-Nya dan musuh mereka, serta lebih memilih untuk mengejar kafilah dagang daripada berperang: \"Hai orang-orang beriman, ingatlah ketika Allah menjanjikan kalian melalui lisan rasul-Nya bahwa kalian akan mendapatkankemenanagn dari salah satu dari dua golongan; kafilah dagang atau yang akan memerangi kalian, sehingga kalian dapat memperlakukannya seakan-akan kalian adalah pemiliknya. Ketika itu kalian lebih memilih golongan kafilah dagang karena tidak memerlukan peperangan daripada golongan pasukan perang yang membutuhkan peperangan sengit dan harus mengerahkan jiwa dan raga. Dalam ayat ini terdapat sindiran bagi mereka karena mereka membenci peperangan dan menginginkan harta dari kafilah dagang; padahal bukan seperti itu sifat orang yang beriman kepada hal ghaib dan percaya dengan Tuhannya. Dan kata 'شوكة' (duri) dijadikan sebagai majas untuk mengungkapkan kata 'senjata' karena Duri memiliki kekuatan dan ketajaman. Kemudian Allah menjelaskan hikmah mengapa Allah memilihkan bagi mereka golongan yang memiliki senjata dan menjadikan mereka dapat mengalahkannya, yaitu agar menegaskan bahwa agama yang benar adalah agama Islam serta untuk menghilangkan kebatilan berupa kekafiran dan kemaksiatan dari orang-orang musyrik. Allah telah menetapkan dengan kehendak-Nya untuk memenangkan agama yang benar yaitu agama Islam dan membinasakan agama lainnya, meski orang-orang kafir tidak merelakan hal itu, karena ketidakrelaan mereka sama sekali tidak berarti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِذْ يَعِدُكُمُ اللهُ إِحْدَى الطَّآئِفَتَيْنِ أَنَّهَا لَكُمْ (Dan (ingatlah), ketika Allah menjanjikan kepadamu bahwa salah satu dari dua golongan (yang kamu hadapi) adalah untukmu) Dua golongan itu adalah kafilah dagang dan pasukan perang. Allah mewahyukan kepada Rasul-Nya ketika pergi ke Badar bahwa kalian akan memperoleh kemenangan, baik itu atas kafilah dagang yaitu kafilah milik kafir Quraisy yang datang dari negeri Syam yang membawa barang-barang dagangan, atau atas pasukan perang yaitu tentara-tentara kafir Quraisy yang datang untuk memerangi kalian. وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ (sedang kamu menginginkan bahwa yang tidak mempunyai kekekuatan) Makna (الشوكة) yakni persenjataan. Yakni ingin memerangi kelompok kafilah dagang karena itu merupakan harta rampasan yang mudah didapat tanpa membutuhkan peperangan, sebab kafilah itu tidak memiliki pasukan untuk membela diri. وَيُرِيدُ اللهُ أَن يُحِقَّ الْحَقَّ بِكَلِمٰتِهِۦ (dan Allah menghendaki untuk membenarkan yang benar dengan ayat-ayat-Nya) Berupa kemenangan kalian atas golongan yang memiliki kekuatan dan persenjataan, dengan membunuh bala tentara mereka dan menawan banyak dari mereka agar kekuatan Islam terlihat. وَيَقْطَعَ دَابِرَ الْكٰفِرِينَ (dan memusnahkan orang-orang kafir) Yakni membinasakan mereka semuanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan ingatlah wahai orang-orang mukmin, ketika Allah menjanjikan kepadamu bahwa salah satu dari dua golongan yang kamu hadapi adalah untukmu, yaitu Al ‘iir kafilah Qurays dari Syam atau kelompok tentara Qurays. Sedang kamu menginginkan bahwa kelompok Al ‘iir yang tidak mempunyai kekekuatan senjatalah yang menjadi milikmu. Allah menghendaki untuk membenarkan janji-Nya kepada orang-orang mukmin dengan pertolongan selain ini, yaitu pertolongan kepada agama Islam dan orang mukmin untuk membela ayat-ayat-Nya yang turun kepada rasul untuk memerangi dan memusnahkan orang-orang kafir dan musyrik. Daabirul kafirin atau kelompok lain yang datang dari belakang mereka. Ini adalah kinayah atas kedekatan mereka dengan kebinasaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah menjanjikan kepada kalian bahwa salah satu dari dua golongan} salah satu golongan, baik Abu Sufyan beserta kafilahnya atau Abu Jahal beserta pasukannya {adalah milik kalian, dan kalian menginginkan} menginginkan {bahwa yang tidak mempunyai kekuatan senjata} yang tidak memiliki senjata dan kekuatan, yaitu pasukan {itu milik kalian. Allah hendak menampakkan} menampakkan dan meninggikam {yang benar dengan ketentuanNya} dengan perintahNya kepada kalian untuk berperang {dan memusnahkan} mencabut {orang-orang kafir sampai ke akar-akarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. keluarnya kaum muslimin pada mulanya untuk mencegat kafilah dengan besar quraisy yang dipimpin oleh abu sofyan yang sedang berangkat ke syam. Manakala kaum muslimin mendengar kepulangan kafilah tersebut dari syam, nabi mengajak para sahabat maka berangkatlah tiga ratus ditambah belasan orang dengan di lengkapi tujuh puluh unta yang mereka tunggangi secara bergiiran sekaligus untuk mengangkut perlengkapan mereka. Orang orang quraisy mendengarkan persiapan kaum muslimin tersebut maka merekapun keluar demi melindungi kafilah mereka dengan kekuatan pasukan, senjata, dan kuda dalam jumlah yang besar. jumlah mereka mendekati seribu prajurit. Allah menjanjikan kepada orang orang Muslim satu dari dua perkara. menguasai kafilah dagang atau memenangi peperangan. Kaum muslimin menyukai yang pertama karena minimnya persiapan mereka dan tentu tanpa peperangan yang berarti. akan tetapi Allah menginginkan dan mencintai perkara yang lebih tinggi daripada apa yang mereka inginkan. Allah ingin kaum muslimin memenangkan peperangan yang dihadiri oleh para pembesar atau tokoh quraisy Allah ingin menetapkan yang haq dengan kalimat kalimatNya dan memenangkan pengikutnya. ”dan memusnahkan orang orang kafir” yakni mengikis pengikut kebatilan dan menunjukkan pertolonganNya untuk kebenaran kepada hamba hambaNya yang sebelumnya tidak mereka duga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 7: Yaitu kafilah Abu Sofyan yang membawa dagangan dari Syam atau kelompok yang datang dari Mekkah untuk berperang dibawah pimpinan Utbah bin Rabi'ah bersama Abu Jahal. Yaitu kafilah Abu Sufyan yang jumlahnya sedikit. Dengan bukti-bukti-Nya. Oleh karena itu, Dia memerintahkan kamu memerangi kelompok yang datang dari Mekah itu yang jumlahnya lebih besar dan sudah lengkap senjatanya. Mereka terdiri dari tokoh-tokoh Quraisy dan pendekarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 7",
    "description": "Kemudian Allah mengingatkan orang-orang mukmin tentang janji Allah kepada rasul-Nya. Dan ingatlah wahai orang-orang yang beriman ketika Allah yang mahakuasa menjanjikan kepadamu bahwa salah satu dari dua golongan yang kamu hadapi adalah untukmu, yaitu kamu akan menang menghadapi pasukan bersenjata dan berkekuatan yang datang dari mekah di bawah pimpinan 'utbah bin rabi'ah bersama abu jahal, sedang kamu sangat menginginkan bahwa yang tidak mempunyai kekuatan senjatalah untukmu, yaitu kafilah abu sufyan yang membawa dagangan dari syam (suriah). Kalian lebih berkeinginan untuk memerangi mereka yang membawa komoditi dagang dan tidak memiliki kekuatan. Tetapi Allah hendak membenarkan yang benar dengan ayatayat-Nya yang diturunkan berkenaan dengan perintah memerangi pasukan yang bersenjata dan berkekuatan serta janji-janji kemenangan dari Allah, dan Allah berkehendak memusnahkan orang-orang kafir sampai ke akar-akarnya, dengan memenangkan orang-orang mukmin. Mereka yang hendak terjun ke medan perang, biasanya berangan-angan untuk berhadapan dengan musuh yang sedikit jumlahnya, tidak mau bertemu musuh yang lebih kuat dan ingin mendapatkan harta rampasan yang banyak. Tapi ditegaskan di sini bahwa Allah berkehendak lain. Dia ingin mengangkat syiar agama, memproklamirkan kebenaran dan membasmi kekufuran. Juga, agar Allah memperkuat yang hak, kebenaran yang sempurna, yakni agama islam dan menghilangkan yang batil, yaitu syirik dan segala hal yang bertentangan dengan nilai-nilai islam, walaupun orang-orang yang berdosa, kaum musyrik dan musuh-Musuh islam itu tidak menyukainya."
  }
]