[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Nabi, katakanlah kepada orang-orang yang kalian tawan dalam perang Badar, “janganlah kalian putus harapan terhadap uang tebusan yang diambil dari kalian. Sebab bila Allah mengetahui di dalam hati kalian ada kebaikan, niscaya dia akan memberikan sesuatu kepada kalian yang lebih baik dari apa yang diambil dari kalian dari harta dengan melapangkan dada kalian dengan keutamaanNya yang baik serta banyak (sungguh Allah telah memenuhi janjiNya bagi Abbas rodiyallohu ‘anhu dan yang lainnya) dan mengampuni dosa-dosa kalian.” Dan Allah maha pengampun terhadap dosa-dosa hamba-hambaNya bila mereka bertaubat, juga Maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Wahai Nabi! Katakanlah kepada tawanan perang yang ada di tanganmu dari kalangan orang-orang musyrik yang berhasil kamu tawan dalam perang Badar, “Jika Allah mengetahui ada iktikad baik di dalam hati kalian, niscaya Allah akan memberi kalian sesuatu yang lebih baik dari tebusan yang diambil dari kalian. Oleh karena itu janganlah kalian bersedih atas tebusan yang diambil dari kalian. Dan Allah juga akan mengampuni kalian. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat. Dan janji Allah telah terlaksana bagi Al-'Abbās, paman Nabi -ṣallallāhu 'alaihi wa sallam- dan lain-lain yang menyatakan masuk Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70-71. Setelah Rasulullah mengambil harta tebusan dari para tawanan, sebagian mereka yang telah beriman merasa berat untuk mengambil kembali harta mereka. Maka Allah menyampaikan kepada mereka apa yang mereka sukai dan dapat mendorong mereka untuk menyukai agama Islam; Allah berfirman kepada rasul-Nya: \"Katakanlah kepada para tawanan yang ada di tanganmu ketika kamu mengambil dari mereka harta tebusan, 'Jika Allah mengetahui dalam hati kalian terdapat keimanan, maka Allah akan memberi kalian apa yang lebih baik dari harta tembusan yang diambil oleh orang-orang beriman dari kalian, seperti kalian akan mendapat bagian harta ghanimah dan kenikmatan kenikmatan lain yang dijanjikan Allah bagi orang-orang beriman; dan Allah akan mengampuni kalian atas kesirikan dan dosa-dosa yang telah kalian lakukan. Allah Maha Pengampun bagi orang yang bertaubat dari kekafiran dan dosa-dosanya dan Maha menyayangi orang-orang beriman, sehingga Allah akan memberikan perlindungan dan taufik-Nya serta menyiapkan kebahagiaan di dunia dan akhirat'. Namun jika mereka ingin menghianatimu dengan menampakan keinginan untuk melakukan perdamaian, maka jangan takut mereka akan kembali memerangi kamu; karena mereka juga telah menghianati Allah sebelumnya dengan melanggar perjanjian yang telah Allah ambil kepada manusia tentang keesaan-Nya melalui dalil-dalil secara akal maupun dalil-dalil kauniyah, padahal Allah telah memberi mereka akal yang dapat mereka pakai untuk menghayati sunatullah yang ada pada makhluk-makhluk-Nya. Namun Allah membuatmu dan para sahabat dapat mengalahkan mereka pada perang Badar padahal terdapat perbedaan jauh antara kekuatan dan jumlah kalian dengan kekuatan dan jumlah mereka. Demikianlah Allah juga akan memenangkanmu atas seorang yang akan menghianatimu. Allah Maha Mengetahui apa yang mereka niatkan dan balasan apa yang layak mereka dapatkan, dan Maha Bijaksana dengan melakukan sesuatu sesuai dengan hikmah-Nya, sehingga Dia menolong orang-orang beriman dan memenangkan mereka atas orang-orang kafir.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. قُل لِّمَن فِىٓ أَيْدِيكُم مِّنَ الْأَسْرَىٰٓ (katakanlah kepada tawanan-tawanan yang ada di tanganmu) Yakni orang-orang yang kalian tawan dan kalian ambil tebusan dari mereka pada perang Badar. إِن يَعْلَمِ اللهُ فِى قُلُوبِكُمْ خَيْرًا(Jika Allah mengetahui ada kebaikan dalam hatimu) Yakni dari orang yang bertujuan dan berniat baik. يُؤْتِكُمْ خَيْرًا مِّمَّآ أُخِذَ مِنكُمْ(niscaya Dia akan memberikan kepadamu yang lebih baik dari apa yang telah diambil daripadamu) Yakni lebih baik dari harta tebusan. Yakni Allah akan mengganti untuk kalian di dunia ini dengan rezeki yang lebih baik dan lebih bermanfaat. وَيَغْفِرْ لَكُمْ ۗ (dan Dia akan mengampuni kamu) Atas dosa-dosa kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ ۗ وَاللَّهُ غَفُورٌ رَحِيمٌ } \"Jika Allah mengetahui ada kebaikan dalam hatimu, niscaya Dia akan memberikan kepadamu yang lebih baik dari apa yang telah diambil daripadamu dan Dia akan mengampuni kamu\". Dan Allah Maha Pengampun lagi Maha Penyayang\" maka jika kamu menghadap Allah dengan niat yang bersih, dan kamu berkehendak besar untuk memahami kitab-Nya, bertawakkal sepenuhnya kepada-Nya bahwa Dialah yang akan membukakan segala pintu untuk memahami kitab-Nya, bukan atas kehebatan dirimu yang meminta, dan bukan pula dari hatimu yang senantiasa berdzikir; niscaya tidak akan ada yang menghalangimu untuk memahami kitab-Nya atas izin Allah. 2 ). Begitu agungnya kejujuran kepada Allah, perhatikan ayat ini : { إِنْ يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ } \"Jika Allah mengetahui ada kebaikan dalam hatimu, niscaya Dia akan memberikan kepadamu yang lebih baik dari apa yang telah diambil daripadamu dan Dia akan mengampuni kamu\". { فَلَوْ صَدَقُوا اللَّهَ لَكَانَ خَيْرًا لَهُمْ } \"Tetapi jikalau mereka benar (imannya) terhadap Allah, niscaya yang demikian itu lebih baik bagi mereka\" [ Muhammad : 21 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70 Wahai Nabi, katakanlah kepada tawanan-tawanan Badr yang ada di tanganmu dan engkau minta tebusan: “Jika Allah mengetahui ada kebaikan dalam hatimu berupa arah keimanan, serta ketulusan dan niat yang baik niscaya Dia akan memberikan kepadamu yang lebih baik dari apa yang telah diambil darimu dan Dia akan mengampuni kamu”. Allah Maha Pengampun atas dosa kalian dan lagi Maha Penyayang atas orang yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Nabi, katakanlah kepada para tawanan perang yang ada di tanganmu,“Jika Allah mengetahui ada kebaikan di dalam hati kalian, niscaya Dia akan menganugerahkan kepada kalian} akan memberi kalian {yang lebih baik daripada apa yang telah diambil dari kalian dan Dia akan mengampuni kalian.” Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Ayat ini turun terkait dengan tawanan perang Badar, yang salah satunya adalah al- Abbas, paman Nabi, ketika dia diminta uang tebusan, dia menyatakan bahwa dia telah masuk Islam sebelumnya, tetapi mereka tetap mengambil tebusan darinya. Maka Allah menurunkan ayat ini untuk menangkan pikirannya dan orang-orang yang sepertinya. “Hai, Nabi katakanlah kepada para tawanan-tawanan yang ada di tanganmu, ‘jika Allah mengetahui ada kebaikan dalam hatimu, niscaya Dia akan memberikan kepadamu labih baik daripada apa yang telah diambil darimu’,” berupa harta, yaitu dengan memudahan untuk mu banyak kebaikan yang labih baik dari apa yang diambil darimu dan karunianya. “Dan Dia akan mengampuni kamu,”yakni dosa-dosamu dan memasukanmu kedalam syurga. “Dan Allah Mahapengampun Lagi Maha Penyayang.” Allah telah membuktikan janjiNya kepada Al-Abbas dan selainnya, maka setelah itu dia mendapatkan hartanya sampai suatu kali Nabi mendapatkan harta yang melimpah, lalu Abbas datang kepada beliau, maka beliau memintanya mengambil dari harta itu dengan lembar pakaiannya yang mampu yang mampu ia angkut, dia pun mengambil apa-apa yang hampir Dia tidak dapat mengangkutnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 70: Ayat ini turun berkenaan dengan para tawanan perang Badar, yang di antaranya adalah Abbas bin Abdul Muththalib paman Rasulullah shallallahu 'alaihi wa sallam. Ketika ia diminta menebus dirinya, ia mengaku bahwa dirinya adalah sebagai muslim sebelum peristiwa tersebut, namun mereka (para sahabat) tidak menggugurkan tebusan terhadapnya, maka Allah Subhaanahu wa Ta'aala menurunkan ayat-Nya untuk menenangkan hatinya dan menenangkan hati orang-orang yang semisalnya. Yunus bin Bukair meriwayatkan dari Az Zuhriy dari jama’ah yang ia sebutkan nama mereka, bahwa mereka berkata, “Orang-orang Quraisy mengirim utusan kepada Rasulullah shallallahu 'alaihi wa sallam untuk menebus para tawanan mereka, lalu masing-masing menebus tawanan mereka sesuai yang mereka suka. Abbas berkata, “Wahai Rasulullah, saya sudah muslim sebelumnya.” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Allah lebih mengetahui terhadap keislamanmu. Jika benar seperti yang engkau katakan, maka Allah akan menggantinya. Adapun zahir(luar)mu maka telah kami tawan. Oleh karena itu, tebuslah dirimu dan kedua putera saudaramu, yaitu Naufal bin Harits bin Abdul Muththalib dan ‘Aqil bin Abu Thalib bin Abdul Muththalib; dan sekutumu Utbah bin ‘Amr saudara Bani Harits bin Fihr.” Abbas berkata, “Wahai Rasulullah, tidak ada padaku barang (sebagai tebusan).” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Lalu di manakah harta yang engkau pendam bersama Ummul Fadhl? Engkau katakan kepadanya, “Jika saya tertangkap dalam perjalananku ini, maka harta yang aku pendam adalah untuk Bani (anak-anak) Fadhl, Abdullah dan Qutsam?” Abbas berkata, “Demi Allah, wahai Rasulullah! Sesungguhnya aku mengetahui bahwa engkau benar-benar utusan Allah. Sungguh, hal ini tidak ada yang mengetahui selain aku dan Umul Fadhl, maka hargailah aku ini wahai Rasulullah dengan 20 uqiyyah (1 uqiyyah = 40 dirham) dari harta yang ada padaku.” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Tidak, itu adalah sesuatu yang diberikan Allah Ta’ala kepada kami darimu.” Maka Abbas menebus dirinya dan kedua putera saudaranya serta sekutunya. Kemudian Allah Azza wa Jalla menurunkan ayat tentangnya, “Yaa ayyuhan nabiyyu qull liman…dst. sampai “Wallahu ghafuurur rahiim (lihat Al Anfal: 70).” Abbas berkata, “Maka Allah memberikan kepadaku sebagai ganti 20 uqiyyah ketika sudah masuk Islam dengan 20 budak, di mana di tangannya masing-masing ada harta yang digunakan untuk berusaha dengan tetap berharap ampunan dari Allah Azza wa Jalla.” Al Haafizh Abu Bakar Al Baihaqi meriwayatkan dari Anas bin Malik ia berkata, “Rasulullah shallallahu 'alaihi wa sallam diberi harta dari Bahrain, lalu Beliau bersabda, “Tebarkanlah harta itu di masjidku.” Anas berkata, “Itu adalah harta yang paling banyak yang pernah diberikan kepada Rasulullah shallallahu 'alaihi wa sallam. Maka Beliau pergi untuk shalat dan tidak memperhatikannya. Setelah selesai shalat, Beliau datang dan duduk menghadapnya (kepada harta itu). Tidaklah Beliau melihat seseorang melainkan Beliau berikan harta itu kepadanya. Tiba-tiba Abbas datang dan berkata, “Wahai Rasulullah, berikanlah kepadaku, karena aku telah menebus diriku dan menebus ‘Aqil.” Rasulullah shallallahu 'alaihi wa sallam bersabda, “Ambillah.” Ia pun mengeruk ke dalam bajunya, lalu pergi sambil mengangkutnya dan (merasa keberatan) sehinga tidak sangup mengangkut, ia pun berkata, “Suruhlah sebagian mereka untuk mengangkutkan untukku.” Beliau bersabda, “Tidak.” Ia berkata, “Kalau begitu engkau saja yang mengangkutkan untukku.” Beliau bersabda, “Tidak”, ia pun kemudian menebarnya dan mengangkutnya kembali di atas pundaknya, lalu pergi. Rasulullah shallallahu 'alaihi wa sallam senantiasa memperhatikanya sampai ia hilang dari pandangan karena merasa heran terhadap ketamakannya. Rasulullah shallallahu 'alaihi wa sallam tidaklah bangun, (kecuali) di sana tinggal satu dirham.” (Imam Bukhari juga meriwayatkannya dalam beberapa tempat di shahihnya secara mu’allaq (tanpa sanad) namun dengan shighat jazm (menunjukkan memang terjadi)), Dengan memudahkan kepadamu karunia-Nya, di mana hal itu lebih baik dan lebih banyak dari harta yang diambil dari kamu atau Dia akan memberimu pahala di akhirat. Serta memasukkan kamu ke dalam surga. Allah Subhaanahu wa Ta'aala memenuhi janji-Nya, Dia menjadikan Abbas dan lainnya setelah itu mendapatkan harta yang banyak, bahkan ketika Nabi shallallahu 'alaihi wa sallam memperoleh harta yang banyak, maka Abbas datang, lalu Rasulullah shallallahu 'alaihi wa sallam memerintahkan kepadanya mengambil harta itu dengan bajunya yang bisa diangkut, maka ia mengambilnya dan hampir saja ia tidak mampu mengangkutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 70",
    "description": "Wahai nabi Muhammad! katakanlah kepada para tawanan perang yang ada di tanganmu, yakni kekuasaanmu dan sahabat-sahabatmu, jika Allah mengetahui, baik pada saat ini maupun akan datang, ada kebaikan di dalam hatimu, berupa keimanan yang benar, tobat yang tulus, niat yang baik serta tekad yang kuat untuk taat kepada Allah dan rasulnya serta menolong agama-Nya, niscaya dia akan memberikan, kamu wahai kaum musyrik, anugerah yang lebih baik, berupa ampunan dan surga, dari apa yang telah diambil dari kamu berupa tebusan, dan dia akan mengampuni dosa-dosa kamu. Allah maha pengampun bagi siapa saja yang bertobat dengan sebenar-benarnya, maha penyayang terhadap kaum mukmin dengan senantiasa memberi pertolongan, taufik dan kebahagiaan hakiki di akhirat kelak. Boleh jadi muncul rasa kekhawatiran dalam benak rasullah jika di kemudian hari mereka berkhianat, maka ayat ini menguatkan jiwa beliau. Jika mereka, tawanan-tawanan itu, hendak mengkhianatimu, wahai nabi Muhammad, dengan menunjukkan sikap seakan condong kepada islam padahal mereka berbohong, maka jangan khawatir, sesungguhnya sebelum itu pun mereka telah berkhianat kepada Allah berupa kemusyrikan dan perbuatan-perbuatan dosa lainnya, maka dia memberikan kekuasaan kepadamu atas mereka, yaitu kemenangan di perang badar meski dengan jumlah pasukan yang tidak seimbang. Allah maha mengetahui segala sesuatu, mahabijaksana dalam segala ketetapan-Nya."
  }
]