[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila orang-orang yang akan kamu lepaskan penawaran mereka dari para tawanan itu (wahai Nabi), hendak berhianat kepadamu sekali lagi, maka janganlah kamu berputus asa, sesungguhnya mereka telah berhianat kepada Allah sebelummya dan memerangimu, kemudian Allah memenangkanmu atas mereka. Dan Allah maha mengetahui apa yang disimpan oleh hati-hati manusia, juga Mahabijaksana dalam mengatur urusan-urusan hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan jika mereka hendak berkhianat kepadamu -wahai Muhammad- dengan kata-kata manis yang mereka ucapkan kepadamu, sesungguhnya mereka telah berkhianat kepada Allah sebelum itu. Dan Allah benar-benar menolongmu untuk mengalahkan mereka. Sebagian dari mereka terbunuh dan sebagian lagi tertawan. Maka tunggulah kejadian semacam itu jika mereka kembali lagi. Allah Maha Mengetahui apa yang terbaik bagi makhluk-Nya lagi Maha Bijaksana dalam mengatur mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَإِن يُرِيدُوا۟ خِيَانَتَكَ (Akan tetapi jika mereka (tawanan-tawanan itu) bermaksud hendak berkhianat kepadamu) Apabila keinginan mereka untuk masuk Islam yang mereka katakan itu bohong. فَقَدْ خَانُوا۟ اللهَ مِن قَبْلُ(maka sesungguhnya mereka telah berkhianat kepada Allah sebelum ini) Maka sebenarnya mereka telah kafir terhadapmu dan memerangimu. فَأَمْكَنَ مِنْهُمْ ۗ( lalu Allah menjadikan(mu) berkuasa terhadap mereka) Yakni Allah akan menjadikanmu berkuasa atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71 Akan tetapi jika tawanan-tawanan itu bermaksud berkhianat kepadamu dilihat dari perkataan mereka, maka sesungguhnya mereka telah berkhianat kepada Allah sebelum peperangan Badr dengan makar kufur dan makar, lalu Allah menjadikanmu berkuasa terhadap mereka. Allah Maha Mengetahui atas makhluk-Nya lagi Maha Bijaksana atas segala perbuatan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka ingin mengkhianatimu, sungguh sebelumnya mereka telah berkhianat kepada Allah. Lalu Dia menjadikanmu menguasai mereka} membuatmu menguasai mereka pada perang Badar dengan mengalahkan dan menawan {Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “Akan tetapi mereka (para tawanan-tawanan itu), bermaksud hendak berkhianat kepadamu”, dengan usaha untuk memusuhimu dan memerangimu.” Maka sesungguhnya mereka telah berkhianat kepada Allah sebelum ini, lalu Allah menjadikanmu berkuasa terhadap mereka.” Sehingga mereka mewaspadai pengkhianatanmu karena Allah Maha Berkuasa atas mereka, sementara mereka di bawah kekuasanNya. “ dan Allah Maha Mengetahui Lagi Mahabijaksana.” Yakni, mengetahui segala sesuatu, Bijaksana dengan meletakkan segala urusan pada tempatnya. Dan termasuk ilmu dan hikmahNya adalah Dia meletakkan hukum-hukum yang mulia lagi baik ini, dan dia telah menjamin penjeganmu itu ari kejahatan para tawanan-tawanan itu jika mereka ingin menghianatimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 71: Dengan berusaha memerangimu. Yakni sebelum terjadi perang Badar. Di Badar, dengan membunuh dan menawan mereka. Oleh karena itu, hendaknya mereka berhati-hati ditimpa lagi hal yang sama jika mereka mengulangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 71",
    "description": "Boleh jadi muncul rasa kekhawatiran dalam benak rasullah jika di kemudian hari mereka berkhianat, maka ayat ini menguatkan jiwa beliau. Jika mereka, tawanan-tawanan itu, hendak mengkhianatimu, wahai nabi Muhammad, dengan menunjukkan sikap seakan condong kepada islam padahal mereka berbohong, maka jangan khawatir, sesungguhnya sebelum itu pun mereka telah berkhianat kepada Allah berupa kemusyrikan dan perbuatan-perbuatan dosa lainnya, maka dia memberikan kekuasaan kepadamu atas mereka, yaitu kemenangan di perang badar meski dengan jumlah pasukan yang tidak seimbang. Allah maha mengetahui segala sesuatu, mahabijaksana dalam segala ketetapan-Nya. Setelah ayat sebelumnya menjelaskan tentang ketentuan-ketentuan perang dan perdamaian dengan orang-orang kafir, bagaimana memperlakukan tawanan, serta bagaimana pengakuan keislaman yang tidak terbukti itu tidak ada manfaatnya, surah ini diakhiri dengan menjelaskan kegiatan yang bisa menjadi bukti keislaman seseorang, yakni hijrah. Sesungguhnya orang-orang yang beriman dan berhijrah dari mekah ke madinah serta berjihad dengan harta dan jiwanya pada jalan Allah, yakni kaum muhajirin, dan orang-orang yang memberikan tempat kediaman, yakni penduduk asli madinah, dan memberi pertolongan kepada muhajirin, mereka itu satu sama lain menjadi pelindung dan bahu-membahu dalam menegakkan kebenaran. Sementara terhadap orang-orang yang beriman tetapi belum berhijrah, maka tidak ada kewajiban sedikit pun bagi kalian, wahai kaum muslim yang berhijrah, untuk melindungi mereka, sampai mereka berhijrah. Meskipun begitu, jika mereka yang tidak ikut berhijrah meminta pertolongan kepada kalian dalam urusan pembelaan agama islam disebabkan adanya paksaan dari orang-orang kafir untuk murtad, maka kalian wajib memberikan pertolongan kecuali terhadap kaum yang telah terikat perjanjian antara kalian dengan mereka, orang-orang kafir, karena menjaga perjanjian dengan siapa pun harus selalu dipegang teguh oleh setiap muslim. Dan Allah maha melihat apa yang kamu kerjakan."
  }
]