[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan RasulNya serta melaksanakan syariatNya, juga berhijrah ke negri islam atau ke negri yang memungkinkan mereka untuk beribadah kepada Tuhan mereka, dan berjihad di jalanNya dengan harta dan jiwa, dan orang-orang yang menerima kaum muhajirin di tempat- tempat tinggal mereka, dan mereka memberi kesamaan dengan mereka dengan harta benda mereka, dan membela agama Allah, mereka itu sebagian dari mereka menjadi pembela sebagian yang lain. Sedangkan orang-orang yang telah beriman, namun belum berhijrah dari negri kafir, maka tidaklah kalian terbebani untuk melindungi mereka dan menolong mereka, hingga mereka berhijrah. Apabila mereka mengalami tindakan kezhaliman dari orang-orang kafir, lalu mereka meminta pertolongan kepadamu maka penuhilah permintaan mereka, kecuali meminta untuk melawan kaum yang antara kalian dan mareka ada jalinan perjanjian yang kuat yang tidak mereka langgar. Dan Allah maha melihat amal perbuatan kalian, dia akan membalas masing-masing orang sesuai dengan niat dan amalnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Sesungguhnya orang-orang yang beriman kepada Allah, percaya kepada rasul-Nya, menjalankan syariat-Nya, berhijrah dari negeri kafir menuju ke negeri Islam, atau ke tempat di mana mereka dapat menyembah Allah dengan aman, dan berjuang dengan menggunakan harta dan jiwa mereka untuk menjunjung tinggi kalimat Allah, dan orang-orang yang menampung mereka di tempat tinggal mereka dan memberikan pertolongan kepada mereka, orang-orang yang hijrah dan orang-orang yang menolong mereka (yaitu tuan rumah) satu sama lain saling menolong dan membantu. Sedangkan orang-orang yang beriman kepada Allah tetapi tidak berhijrah dari negeri kafir ke negeri Islam, maka kalian tidak berkewajiban untuk menolong dan melindungi mereka sampai mereka berhijrah di jalan Allah. Jika mereka ditindas oleh orang-orang kafir kemudian mereka meminta tolong kepada kalian maka tolonglah mereka melawan musuh mereka. Kecuali apabila di antara kalian dan musuh mereka itu ada perjanjian damai yang tidak pernah mereka langgar. Allah Maha Mengetahui apa yang kalian perbuat, tidak ada satu pun perbuatan kalian yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan yang setimpal dengan perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Setelah Allah menyebutkan Apa yang harus dilakukan terhadap para tawanan, Allah menutup surat ini dengan kewajiban orang-orang mukmin untuk saling tolong menolong sebagai konsekuensi dari keimanan dan hijrah yang telah mereka lakukan, karena orang-orang kafir juga saling tolong menolong sesama mereka. Kemudian Allah memerintahkan untuk menjaga perjanjian-perjanjian yang dilakukan dengan orang-orang kafir selama mereka juga menjaga perjanjian-perjanjian tersebut. Allah berfirman: \"Orang-orang beriman yang berhijrah meninggalkan negeri mereka untuk menyelamatkan agama dari fitnah orang-orang musyrik, mencari keridhaan Allah, menolong Rasulullah dengan mengerahkan seluruh tenaga dan menghadapi banyak kesulitan; dan orang-orang yang memberi perlindungan bagi Rasulullah dan para Sahabat yang hijrah bersamanya, dan menolong dan mengamankan mereka, berbagi harta yang mereka miliki, mengutamakan mereka daripada diri mereka sendiri, memerangi siapa saja yang memerangi mereka; maka mereka saling tolong menolong dalam perkara peperangan dan harta ghanimah. Adapun orang-orang beriman yang masih tinggal di negeri orang-orang musyrik dan di bawah kekuasaan dan hukum mereka, maka orang-orang beriman itu tidak memiliki hak perlindungan dari orang-orang beriman yang ada di negeri Islam, karena kalian tidak memiliki cara untuk menolong mereka, dan kalian juga tidak memiliki hak perlindungan atas mereka. Kecuali jika mereka diperangi dan disiksa orang-orang kafir demi agama mereka, kemudian mereka meminta pertolongan dari kalian, maka wajib bagi kalian untuk menolong mereka, dengan syarat orang-orang kafir yang memerangi mereka adalah dari kafir Harbi yang tidak memiliki perjanjian damai dengan kalian. Adapun jika orang-orang kafir itu memiliki perjanjian dengan kalian maka wajib bagi kalian untuk memenuhi perjanjian tersebut, dan tidak boleh menghianati dan melanggar perjanjian itu. Allah Maha Melihat apa yang kalian lakukan maka wajib bagi kalian untuk menjalankan hukum-hukum-Nya, senantiasa merasa mendapat pengawasan dari-Nya, menegakkan hukum-hukum itu dengan kebenaran dan keadilan, dan menjauhi hawa nafsu yang dapat menghalangi seseorang dari kebenaran dan keadilan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَهَاجَرُوا۟ (dan berhijrah) Allah menutup surat ini dengan menyebutkan masalah tentang kepada siapa kesetiaan seseorang diberikan dan kepada siapa meminta pertolongan, hal ini agar setiap golongan mengetahui kepada siapa ia meminta pertolongan. Allah menamai orang-orang yang berhijrah ke kota Madinah dengan sebutan Muhajirin, kerena mereka meninggalkan negeri mereka mengharapkan apa yang di sisi Allah dan memenuhi panggilan Rasul-Nya. وَالَّذِينَ ءَاوَوا۟ وَّنَصَرُوٓا۟ (dan orang-orang yang memberikan tempat kediaman dan pertoIongan) Mereka adalah orang-orang Anshar yang memberi tempat kediaman di negeri dan rumah mereka untuk orang-orang Muhajirin dan menolong Rasulullah dalam perang menghadapi orang-orang Quraisy dan orang-orang Arab lainnya, dan dengan mereka Allah meninggikan kalimat-Nya dan mengangkat panji Islam. أُو۟لٰٓئِكَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۚ( mereka itu satu sama lain lindung-melindungi) Dalam hal tolong menolong dan bantuan. Pendapat lain mengatakan termasuk didalamnya urusan warisan, karena dahulu mereka saling mewarisi antara kaum Muhajirin dan kaum Anshar; kemudian Allah menasakh hukum ini dengan firman-Nya: وأولو الأرحام بعضهم أولى ببعض “Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya” وَالَّذِينَ ءَامَنُوا۟ وَلَمْ يُهَاجِرُوا۟ مَا لَكُم مِّن وَلٰيَتِهِم مِّن شَىْءٍ حَتَّىٰ يُهَاجِرُوا۟ ۚ( Dan (terhadap) orang-orang yang beriman, tetapi belum berhijrah, maka tidak ada kewajiban sedikitpun atasmu melindungi mereka, sebelum mereka berhijrah) Yakni apa urusan kalian dengan menolong dan membantu mereka. Yakni tidak wajib bagi kalian untuk menolong mereka. Atau maknanya: apa urusan kalian dengan harta warisan mereka meski terdapat hubungan kekerabatan dengan kalian, sebab mereka belum berhijrah. وَإِنِ اسْتَنصَرُوكُمْ(jika mereka meminta pertolongan kepadamu) Yakni orang-orang yang beriman namun belum berhijrah apabila meminta pertolongan kepada kalian untuk menghadapi orang-orang musyrik. فَعَلَيْكُمُ النَّصْرُ (maka kamu wajib memberikan pertolongan) Yakni maka wajib bagi kalian untuk menolong mereka. إِلَّا(kecuali) Apabila mereka meminta pertolongan kepada kalian. عَلَىٰ قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثٰقٌ ۗ( terhadap kaum yang telah ada perjanjian antara kamu dengan mereka) Maka janganlah kalian menolong mereka untuk melawan kaum tersebut karena perjanjian yang ada harus dijaga, sedangkan pertolongan kalian untuk orang-orang beriman yang belum berhijrah tersebut merupakan pelanggaran terhadap perjanjian, sedangkan Allah tidak menyukai orang-orang yang berkhianat dan yang melanggar perjanjian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72 Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya dan berhijrah dari negeri mereka untuk menolong agama Islam, serta berjihad dengan harta dan jiwanya pada jalan Allah mereka adalah orang-orang Muhajirin. Serta orang-orang yang memberikan tempat kediaman dan pertoIongan kepada orang-orang Muhajirin di Madinah Al munawwaroh yaitu kaum Anshor, mereka itu satu sama lain saling melindungi. Dan orang-orang yang beriman, tetapi belum berhijrah dari rumah mereka, maka tidak ada kewajiban sedikitpun atasmu untuk melindungi mereka, dan juga tidak ada bagian untuk mereka dalam hal harta ghanimah sebelum mereka berhijrah menuju tempat keselamatan. Akan tetapi jika mereka meminta pertolongan kepadamu dalam urusan pembelaan agama dari siksaan orang kafir, maka kamu wajib memberikan pertolongan. Kecuali terhadap kaum yang telah berjanji dengan kamu juga dengan mereka, sebab janji harus dijaga dan ditepati. Dan Allah Maha Melihat apa yang kamu kerjakan. Ayat untuk hijrah pada awal kemudian dinaskh dan menjadi hukum untuk menyambung silaturrahmi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman, berhijrah, dan berjihad dengan harta dan jiwanya pada jalan Allah, serta orang-orang yang memberikan tempat tempat tinggal} memberi tempat tinggal untuk orang-orang mukmin di tempat mereka {dan memberi pertolongan} menolong mereka dari musuh-musuh mereka {mereka itu sebagiannya merupakan pelindung bagi sebagian lainnya. Orang-orang yang beriman tetapi belum berhijrah, maka tidak ada kewajiban sedikit pun atas kalian untuk melindungi mereka} menolong mereka {sehingga mereka berhijrah. Jika mereka meminta pertolongan kepada kalian} memohon pertolongan kalian atas musuh mereka {dalam urusan agama, maka wajib atas kalian untuk menolong, kecuali dalam menghadapi kaum yang telah terikat perjanjian} perjanjian {antara kalian dengan mereka. Allah Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Ini adalah muamalah (loyalitas) dan kecintaan yang Allah buat di antara orang-orang Muhajirin yang beriman, yang berhijrah di jalan Allah, meninggalkan tanah kelahiran untuk Allah demi berjihad di jalanNya, dengan orang-orang Anshar yang melindungi Rasululoh dan kawan-kawannya, dan memberi mereka bantuan di negeri mereka dengan harta dan jiwa mereka . mereka itu adalah wali bagi sebagian yang lainnya, karena kesempurnan iman mereka dan eratnya sebagian hubungan mereka dengan sebagian yang lain. “Dan terhadap orang-orang yang beriman, tetapi belum berhijrah, maka tidak ada kewajiban atasmu meindungi mereka, sebelum mereka berhijrah.” Karena mereka memutuskan amal muamalah darimu dengan memisahkan diri darimu pada waktu dimana kebutuhan kepada kaum laki-laki sangat mendesak, karena mereka tidak berhijrah maka mereka tidak memiliki sedikitpun akad muamalah dengan orang-orang yang beriman.”akan tetapi jika mereka meminta pertolongan dalam urusan pembelaan agama”, yakni untuk memerangi orang-orang yang memerangi mereka Karena agamanya. “maka kamu wajib memberikan pertolongan”, dengan berpegang kepada mereka. Adapun jika perangnya bukan untuk tersebut maka kamu tidak harus menolongnya. FirmanNya “Kecuali terhadap kaum yang telah ada perjanjian antara kamu dengan mereka.” Yakni perjanjian damai, jika orang-orang Mukmin yang tidak berhijrah itu hendak memerangi mereka, maka janganlah kamu membantu mereka atasnya, karena perjanjian yang ada di antara dirimu dengan diri mereka. “Dan Allah Maha Melihat apa yang kamu kerjakan.” Mengetahui keadaanmu, sehingga Dia meletakkan hukum yang sesuai denganmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 72: Ayat ini merupakan ‘akad untuk saling melindungi, memberikan pertolongan dan saling mencintai yang Allah jalin anara kaum muhajirin dengan Anshar. Mereka adalah Muhajirin. Mereka adalah kaum Anshar. Yang dimaksud saling melindungi adalah bahwa di antara muhajirin dan anshar terjalin persaudaraan yang amat teguh, untuk membentuk masyarakat yang baik. Oleh karena keteguhan dan keakraban persaudaraan mereka, sehingga pada pemulaan Islam mereka saling mewarisi seakan-akan mereka saudara kandung. Ada yang menafsirkan, bahwa tidak ada wais-mewarisi antara kamu dengan mereka dan bahwa mereka (yang tidak ikut berhijrah) tidak memperoleh bagian dari ghanimah sampai mereka berhijrah, namun waris-mewarisi karena persaudaraan kemudian dimansukh dengan akhir ayat surat Al Anfal ini. Untuk memerangi orang-orang yang memerangi mereka karena agama, adapun selain itu, maka tidak ada kewajiban atas kamu menolong mereka karena mereka tidak mau berhijrah. Yakni kecuali jika mereka meminta pertolongan untuk melawan kaum kafir yang terikat perjanjian antara kamu dengan mereka, maka jangan menolong mereka dan membatalkan perjanjian. Oleh karena itu, Dia mensyari’atkan kepadamu hukum yang layak bagimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 72",
    "description": "Setelah ayat sebelumnya menjelaskan tentang ketentuan-ketentuan perang dan perdamaian dengan orang-orang kafir, bagaimana memperlakukan tawanan, serta bagaimana pengakuan keislaman yang tidak terbukti itu tidak ada manfaatnya, surah ini diakhiri dengan menjelaskan kegiatan yang bisa menjadi bukti keislaman seseorang, yakni hijrah. Sesungguhnya orang-orang yang beriman dan berhijrah dari mekah ke madinah serta berjihad dengan harta dan jiwanya pada jalan Allah, yakni kaum muhajirin, dan orang-orang yang memberikan tempat kediaman, yakni penduduk asli madinah, dan memberi pertolongan kepada muhajirin, mereka itu satu sama lain menjadi pelindung dan bahu-membahu dalam menegakkan kebenaran. Sementara terhadap orang-orang yang beriman tetapi belum berhijrah, maka tidak ada kewajiban sedikit pun bagi kalian, wahai kaum muslim yang berhijrah, untuk melindungi mereka, sampai mereka berhijrah. Meskipun begitu, jika mereka yang tidak ikut berhijrah meminta pertolongan kepada kalian dalam urusan pembelaan agama islam disebabkan adanya paksaan dari orang-orang kafir untuk murtad, maka kalian wajib memberikan pertolongan kecuali terhadap kaum yang telah terikat perjanjian antara kalian dengan mereka, orang-orang kafir, karena menjaga perjanjian dengan siapa pun harus selalu dipegang teguh oleh setiap muslim. Dan Allah maha melihat apa yang kamu kerjakan. Adapun orang-orang yang kafir, sebagian mereka menjadi pelindung sebagian yang lain, yakni satu sama lain tolong-menolong dalam kebatilan dan bersekongkol untuk memusuhi kalian. Jika kamu tidak melaksanakan apa yang telah diperintahkan Allah untuk saling melindungi dan bahu-membahu dalam membela serta meninggikan agama Allah, pada satu sisi, dan tidak melakukan hubungan yang intensif dengan orang-orang kafir yang memusuhi kalian, pada sisi lain, niscaya akan terjadi kekacauan yang dahsyat di bumi dan kerusakan yang besar antara lain bocornya rahasia dan tercerai-berainya barisan kaum muslimin. '"
  }
]