[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang kafir, sebagian mereka menjadi pembela sebagian yang lain. Dan kalian wahai kaum mukminin, bila tidak menjadi pembela bagi sebagian yang lain, niscaya munculah di muka bumi fitnah bagi kaum mukminin yang menjauhkan mereka dari agama Allah dan timbul kerusakan yang merajarela dengan adanya hambatan menuju jalan Allah dan menguatkan tiang-tiang penyangga kekafiran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Sedangkan orang-orang yang ingkar kepada Allah, yang mereka dipersatukan oleh kekafiran mereka sehingga satu sama lain saling melindungi. Maka jangan sekali-kali orang mukmin menjadikan mereka sebagai walinya. Jika kalian tidak mau menjadikan orang-orang mukmin sebagai wali kalian dan menjadikan orang-orang kafir sebagai musuh, niscaya akan terjadi fitnah (malapetaka) bagi orang-orang mukmin. Karena mereka tidak menemukan saudara seagama yang mau menolong mereka. Dan akan terjadi kerusakan besar di muka bumi karena maraknya upaya menghalang-halangi manusia dari jalan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Setelah menetapkan kewajiban saling tolong-menolong antara orang-orang beriman, Allah menyampaikan bahwa orang-orang kafir juga saling tolong-menolong karena mereka sama-sama dalam kekafiran; mereka adalah satu golongan dalam melawan orang-orang beriman meskipun sesungguhnya mereka terpecah belah dan saling memusuhi. Maka jika kalian tidak menjalankan kewajiban saling tolong menolong dalam menghadapi orang-orang kafir yang saling tolong menolong dalam memerangi kalian, serta menjalankan kewajiban untuk memenuhi perjanjian dengan orang-orang kafir sampai perjanjian itu selesai; maka akan terjadi fitnah dan kerusakan di muka bumi yang mengandung mudharat yang sangat besar bagi kalian akibat kelemahan kalian, yang mengakibatkan kekalahan dalam menghadapi musuh-musuh, dan hilangnya penegakan syariat yang hanya dapat ditegakkan dengan saling tolong-menolong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَالَّذِينَ كَفَرُوا۟ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۚ (apun orang-orang yang kafir, sebagian mereka menjadi pelindung bagi sebagian yang lain) Ayat ini mengandung dorongan bagi kaum muslimin agar tidak menjadi penolong dan pelindung orang-orang kafir. إِلَّا تَفْعَلُوهُ(Jika kamu (hai para muslimin) tidak melaksanakan apa yang telah diperintahkan Allah itu) Yakni tidak melaksanakan tolong menolong dan saling melindungi orang-orang beriman sesuai dengan penjelasan yang telah disebutkan tadi, serta tidak meninggalkan untuk tidak menjadi penolong dan pelindung orang-orang kafir. تَكُن فِتْنَةٌ فِى الْأَرْضِ وَفَسَادٌ كَبِيرٌ (niscaya akan terjadi kekacauan di muka bumi dan kerusakan yang besar) Yakni kerusakan besar di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73 Adapun orang-orang yang kafir, sebagian mereka menjadi pelindung bagi sebagian yang lain. Maka mereka tidak akan menolong orang mukmin. Jika kamu hai para muslimin tidak melaksanakan apa yang telah diperintahkan Allah itu, niscaya akan terjadi kekacauan di muka bumi dan kelemahan Islam serta kerusakan yang besar pada agama dan dunia. Seorang laki-laki berkata: Akankah kami mewariskan peranakan kami kepada kaum musyrik? Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang kafir itu, sebagian mereka menjadi penolong bagi sebagian yang lain. Jika kalian tidak melaksanakan apa yang telah diperintahkan Allah itu} jika kalian tidak mendukung orang-orang mukmin dan tidak memusuhi orang-orang kafir {niscaya akan terjadi bencana} bencana bagi orang-orang mukmin {di bumi dan kerusakan yang besar} kerusakan yang sangat luas dalam urusan agama dan di dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Manakala Allah menyatakan akad muwalah di antara orang-orang Mukmin, Dia menyatakan bahwa orang-orang kafir yang dihimpun oleh kekufuran, sebagian dari mereka adalah wali bagi sebagian yang lain, maka tidak ada yang mengangkat mereka menjadi wali kecuali orang-orang kafir yang sama dengan mereka. FirmanNYa , “Jika kamu (hai kaum Muslimin) tidak melaksanakan,” yakni berwala’ (bersikap loyal) kepada orang-orang Mukmin dan berbara’ (anti dan berlepas diri) dari orang-orang kafir, di mana kamu berwala’ kepada mereka semua atau berbara’ dari mereka semua, atau kamu berwala’ kepada orang-orang kafir dan berbara’ dari orang-orang Mukmin, “niscaya akan terjadi kekacauan di muka bumi dan kerusakan yang besar.” Hal itu menimbulkan dampak negative yang tak berbatas: bercampurnya kebenaran dengan kebatilan, Mukmin dengan kafir, lenyapnya banyak ibadah besar seperti jihad, hijrah, dan tujuan-tujuan syariat yang lain yang bisa lenyap jika orang-orang Mukmin tidak mengangkat orang-orang Mukmin sebagai wali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 73: Ada yang menafsirkan, “saling melindungi” di sini dengan saling tolong-menolong dan mewarisi, oleh karena itu tidak ada waris-mewarisi antara kamu dengan mereka (orang-orang kafir). Yang dimaksud dengan apa yang telah diperintahkan Allah itu adalah keharusan adanya persaudaraan yang teguh antara kaum muslimin, berwala’ (mencintai) dengan mereka, saling tolong-menolong, dan berbara’ (berlepas diri) terhadap orang-orang kafir. Dengan menguatnya kekafiran dan kemaksiatan serta melemahnya Islam dan ketaatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 73",
    "description": "Adapun orang-orang yang kafir, sebagian mereka menjadi pelindung sebagian yang lain, yakni satu sama lain tolong-menolong dalam kebatilan dan bersekongkol untuk memusuhi kalian. Jika kamu tidak melaksanakan apa yang telah diperintahkan Allah untuk saling melindungi dan bahu-membahu dalam membela serta meninggikan agama Allah, pada satu sisi, dan tidak melakukan hubungan yang intensif dengan orang-orang kafir yang memusuhi kalian, pada sisi lain, niscaya akan terjadi kekacauan yang dahsyat di bumi dan kerusakan yang besar antara lain bocornya rahasia dan tercerai-berainya barisan kaum muslimin. ' ayat sebelumnya menyinggung tentang kaum muhajirin dan ansar, sedang ayat ini menjelaskan kedudukan mereka, yaitu bahwa orangorang yang beriman dan berhijrah serta berjihad di jalan Allah, yakni kaum muhajirin, dan orang-orang yang memberi tempat kediaman dan memberi pertolongan kepada orang muhajirin demi tegaknya kebenaran dan agama Allah, yakni kaum ansar, maka mereka itulah orang yang benar-benar beriman. Mereka memperoleh ampunan dan rezeki yang mulia berupa anugerah yang bermacam-macam baik di dunia maupun di akhirat."
  }
]