[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman kepada Allah dan RasulNya, dan mereka meninggalkan negri mereka, bermaksud mendatangi negeri islam, atau negeri yang memungkinkan mereka untuk melakasanakn ibadah kepada tuhan mereka di sana, dan berjihad untuk meninggikan kalimat Allah dan orang-orang yang menolong saudara-saudara mereka dari kaum muhajirin dan memberikan tempat tinggal serta berbagi dengan mereka dengan harta dan dukungan, mereka itulah orang-orang mukmin sejati yang sebenarnya. Bagi mereka ampunan terhadap dosa-dosa mereka dan rizki baik lagi luas di surga na’im."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Orang-orang yang beriman kepada Allah dan berhijrah di jalan-Nya, dan orang-orang yang menampung dan menolong orang-orang yang berhijrah di jalan Allah itu, mereka semua adalah orang-orang yang memiliki iman yang sejati. Dan balasan dari Allah untuk mereka ialah ampunan atas dosa-dosa mereka dan rezeki yang mulia dari sisi-Nya, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Setelah menyebutkan kewajiban saling tolong-menolong antara kaum Muhajirin dan Anshor, Allah melanjutkan dengan memberi pujian bagi mereka, Allah berfirman: orang-orang Muhajirin dan Anshor adalah orang-orang yang benar dan sempurna imannya, tidak seperti orang beriman yang belum berhijrah dan masih tinggal di negeri orang-orang musyrik dan orang-orang yang tidak ikut memerangi musuh kaum muslimin. Kemudian Allah menjanjikan bagi mereka balasan yang baik dengan berfirman: Mereka akan mendapatkan ampunan yang sempurna dari Tuhan mereka dengan menghapus kesalahan-kesalahan yang telah mereka perbuat dan memberi mereka rezeki yang mulia di akhirat, sebab mereka telah meninggalkan keluarga dan tanah kelahiran, mengerahkan jiwa dan harta, berpaling dari segala kenikmatan duniawi, dan mengamalkan apa yang dapat mendekatkan mereka kepada Tuhan mereka di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. أُو۟لٰٓئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا ۚ (mereka itulah orang-orang yang benar-benar beriman) Yakni yang sempurna dalam imannya. لَّهُم(Mereka memperoleh) Dari sisi Allah. مَّغْفِرَةٌ (ampunan) Atas dosa-dosa mereka kelak di akhirat. وَرِزْقٌ كَرِيمٌ (dan rezeki (nikmat) yang mulia) Dan bagi mereka rezeki yang mulia, yang bersih dari kotoran, serta baik lagi nikmat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74 Dan orang-orang yang beriman kepada Allah dan rasul-Nya, dan berhijrah dari negeri mereka untuk keselamatan mereka dan agama mereka, serta berjihad untuk meninggikan kalimat Allah serta agama, dan orang yang berhijrah ke Madinah, serta orang-orang yang memberi tempat kediaman dan memberi pertolongan kepada orang-orang muhajirin, yaitu kaum Anshor mak mereka itulah orang-orang yang benar-benar beriman. Mereka memperoleh ampunan dan rezeki nikmat yang mulia di surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang beriman, berhijrah, dan berjihad di jalan Allah, serta orang-orang yang memberi tempat tinggal dan memberi pertolongan, mereka itulah orang-orang mukmin yang sebenarnya. Bagi mereka ampunan dan rezeki yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat-ayat di atas menyebutkan akad muwalah di antara orang-orang Mukmin dari MUhajirin dan Anshar. Dan ayat-ayat berikut ini menjelaskan pujian dan janji pahala bagi mereka. 74. “Dan orang-orang yang beriman dan berhijrah serta berjihad pada jalan Allah, dan orang-orang yang memberi tempat kediaman dan memberi pertolongan (kepada orang-orang MUhajirin), mereka itulah orang-orang yang benar-benar beriman.” Yaitu orang-orang Muhajirin dan Anshar, mereka itulah orang-orang yang “benar-benar beriman,” karena mereka membenarkan iman mereka dengan hijrah, menolong, berwala’ kepada sebagian yang lain, dan jihad mereka melawan orang-orang kafir dan munafik. “Mereka memperoleh ampunan”, dari Allah yang menghapus dosa-dosa mereka dan menghilangkan kesalahan mereka, “dan (mereka mendapatkan) rizki (nikmat) yang mulia.” Yakni, kebaikan yang banyak dari Rabb Yang MUlia di Surga kenikmatan, dan bisa jadi mereka mendapatkan pahala dunia yang membuat mereka berbahagia dan hidup tenteram."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 74: Ayat 72 menerangkan akad saling tolong menolong dan bersaudara antara kaum muhajirin dan anshar, maka pada ayat ini menyebutkan pujian untuk mereka. Karena mereka membenarkan iman mereka dengan melakukan hijrah, tolong-menolong antara yang satu dengan yang lain, dan berjihad melawan musuh-musuh mereka yang terdiri dari kaum kafir dan orang-orang munafik. Yang menghapuskan kesalahan mereka. Di surga, dan terkadang mereka memperoleh pahala yang disegerakan yang menyejukkan pandangan mereka dan menenteramkan hati mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 74",
    "description": "Ayat sebelumnya menyinggung tentang kaum muhajirin dan ansar, sedang ayat ini menjelaskan kedudukan mereka, yaitu bahwa orangorang yang beriman dan berhijrah serta berjihad di jalan Allah, yakni kaum muhajirin, dan orang-orang yang memberi tempat kediaman dan memberi pertolongan kepada orang muhajirin demi tegaknya kebenaran dan agama Allah, yakni kaum ansar, maka mereka itulah orang yang benar-benar beriman. Mereka memperoleh ampunan dan rezeki yang mulia berupa anugerah yang bermacam-macam baik di dunia maupun di akhirat. Dan orang-orang yang beriman setelah kaum muslim awal yang berhijrah itu, yang kemudian akhirnya mereka berhijrah sesudah melewati waktu yang cukup lama dan berjihad bersamamu, maka mereka termasuk golonganmu, yaitu memiliki kedudukan yang sama menyangkut hak dan kewajiban. Apalagi di antara kaum muslim itu ada orang-orang yang mempunyai hubungan kerabat, maka adanya hubungan kekerabatan itu sebagiannya lebih berhak terhadap sesamanya daripada yang bukan kerabat, menurut kitab Allah, dalam hal perlindungan, kasih sayang, pertolongan, dan warisan. Sungguh, Allah maha mengetahui segala sesuatu."
  }
]