[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang beriman setelah kaum muhajirin dan Anshar, mereka berhijrah dan berjihad bersama kalian di jalan Allah, maka mereka itu termasuk dari golongan kalian (wahai kaum mukminin); mereka mendapatkan hak yang sama dengan yang kalian terima dan mereka menanggung kewajiban yang sama dengan yang menjadi tanggungan kalian. Dan orang-orang yang saling memiliki hubungan kekerabatan, sebagian mereka lebih berhak kepada yang lain dalam urusan warisan yang ada di dalam hukum Allah dibandingkan orang-orang muslim pada umumnya. Sesungguhnya Allah maha mengetahui segala sesuatu, mengetahui apa-apa yang bermaslahat bagi hamba hambaNya seperti penetapan hak mewarisi bagi sebagian dari sebagian yang lain yang terkait hubungan kerabat dan pernasaban, bukan saling mewarisi atas dasar sumpah, dan hubungan lainya, yang dahulu terjadi pada permulaan perkembangan islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Adapun orang-orang yang beriman sesudah imannya orang-orang yang mula-mula memeluk Islam dari kalangan Muhajirin dan Ansar, lalu berhijrah dari negeri kafir ke negeri Islam, dan berjuang di jalan Allah untuk menjunjung tinggi kalimat Allah dan menjatuhkan simbol-simbol orang-orang kafir, mereka itu adalah bagian dari kalian, wahai orang-orang mukmin. Mereka memiliki hak dan kewajiban yang sama seperti kalian. Dan orang-orang yang memiliki hubungan kekerabatan dalam hukum Allah lebih berhak atas harta warisan kerabatnya daripada hubungan waris-mewarisi yang disebabkan oleh persaudaraan iman dan hijrah yang pernah ada sebelumnya. Sesungguhnya Allah Maha Mengetahui segala sesuatu. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Dia mengetahui apa yang terbaik bagi hamba-hamba-Nya, maka Dia mensyariatkannya untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Adapun orang-orang yang beriman dan berhijrah setelah hijrah yang pertama, kemudian mereka berhijrah dan berjihad bersama kalian memerangi musuh-musuh; maka mereka adalah bagian dari kalian, sehingga keutamaan mereka sama seperti kaum Muhajirin dan Anshor, begitu juga dalam hal saling tolong-menolong dan balasan yang dijanjikan bagi mereka. Akan tetapi hubungan kekeluargaan lebih utama daripada kaum Muhajirin dan Anshar yang bukan keluarga dalam hal saling tolong-menolong dan mewarisi harta di negeri hijrah pada masa itu dan masa selanjutnya. Ini sebagai hukum Allah yang telah ditetapkan atas hamba-hamba-Nya yang beriman. Dan Allah mewajibkan mereka untuk menyambung silaturahim dan memberi wasiat kepada kedua orang tua dan kerabat dekat. Allah mensyariatkan bagi kalian hukum-hukum tentang hubungan dengan orang-orang secara umum atau secara khusus dan tentang perjanjian-perjanjian, sesuai dengan ilmu-Nya yang luas yang meliputi segala kemaslahatan bagi kalian secara agama atau keduniaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَالَّذِينَ ءَامَنُوا۟ مِنۢ بَعْدُ وَهَاجَرُوا۟ وَجٰهَدُوا۟ مَعَكُمْ (Dan orang-orang yang beriman sesudah itu kemudian berhijrah serta berjihad bersamamu) Yakni setelah turunnya ayat-ayat ini. فَأُو۟لٰٓئِكَ مِنكُمْ ۚ( maka orang-orang itu termasuk golonganmu) Yakni termasuk dari orang-orang Muhajirin dan Anshar dalam hak mereka untuk mendapatkan perlindungan dan pertolongan, kesempurnaan iman, ampunan, serta rezeki yang mulia. وَأُو۟لُوا۟ الْأَرْحَامِ(Orang-orang yang mempunyai hubungan kerabat itu) Yakni para kerabat, yang mencakup kerabat dekat maupun jauh. بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ فِى كِتٰبِ اللهِ ۗ( sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) di dalam kitab Allah) Yakni dalam ketetapan Allah. Dan masuk dalam hal ini adalah hak untuk mendapatkan warisan sebagai hal yang paling utama karena terdapat sebab yang melazimkannya, yaitu kekerabatan. Ibnu Abbas berkata: Rasulullah mempersaudarakan para sahabatnya dan menjadikan mereka saling waris mewarisi, sampai turun ayat وأولو الأرحام بعضهم أولى ببعض (Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya) sehingga mereka meninggalkan hukum ini dan hanya menjadikan hubungan darah sebagai sebab waris mewarisi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75 Dan orang-orang yang beriman kepada Allah dan rasul-Nya kemudian berhijrah dari negeri kafir setelah ada perjanjian Huadibiyah pada tahun keenam, serta berjihad bersamamu maka orang-orang itu termasuk golonganmu juga. Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya daripada yang bukan kerabat di dalam kitab Allah. Sesungguhnya Allah Maha Mengetahui segala sesuatu. Dari Allah-lah pemindahan perintah hijrah menjadi perintah untuk menyambung silaturrahim, dan pentingnya kerabat dalam surat Annisa. Ada seorang laki-laki yang berjanji kepada seorang laki-laki. Aku akan mewarisimu jika engkau mewarisiku dengan bersumpah. Maka turunlah ayat dan orang-orang yang memiliki hubungan silaturrahmi. Ayat ini telah dinaskh dengan ayat hijrah dan ayat mempererat persaudaraan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman setelah itu, berhijrah, dan berjihad bersama kalian, maka mereka itu termasuk (golongan) kalian. Orang-orang yang mempunyai hubungan kerabat} memiliki hubungan kerabat {itu sebagiannya lebih berhak bagi sebagian yang lain menurut kitab} hukum {Allah. Sesungguhnya Allah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Begitu pula orang-orang yang datang sesudah para Muhajirin dan Anshar tersebut dari kalangan orang-orang yang mengikuti mereka dengan baik, dia beriman, berhijrah dan berjihad di jalan Allah, “maka orang-orang itu termasuk golonganmu (juga).” Untuk mereka apa yang menjadi hakmu, atas mereka apa yang menjadi kewajibanmu. Inilah muwalah imaniyah (loyalitas keimanan) yang mana di awal Islam ia memiliki pengaruh dan dampak positif yang sangat besar, sampai-sampai Nabi mempersaudarakan di antara orang-orang Muhajirin dengan orang-orang Anshar dengan persaudaraan yang khusus, selain persaudaraan iman yang umum, bahkan mereka saling mewarisi satu sama lain dengan persaudaraan tersebut. Lalu Allah menurunkan, “orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) di dalam kitab Allah,” maka yang mewarisi hanyalah kerabatnya dari Ashabah dan Ashabul Furudh, jika tidak ada, maka kerabat terdekatnya dari Dzawil Arham, sebagiamana hal itu di tujukan oleh keumunan ayat yang mulia. FirmanNya, “Di dalam kitab Allah.” Yakni, di dalam hukum dan syariatNya. “Sesungguhnya Allah Mengetahui Segala Sesuatu.” Yang diantaranya adalah keadaanymu, yang mana Allah memberlakukan syariat-syariat agamanya yang cocok dan sesuai denganNya. Selesai tafsir surat Al-Anfal. Segala puji bagi Allah dan segala karunia hanya dariNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 75: Setelah kaum muhajrin dan anshar, yang mengikuti mereka dengan kebaikan; beriman, berhijrah dan berjihad di jalan Allah, mereka pun sama akan memperoleh apa yang diperoleh generasi sebelum mereka, dan mereka memiliki kewajiban yang sama dengan generasi sebelum mereka. Wahai kaum muhajirin dan anshar. Maksudnya yang menjadi dasar waris-mewarisi dalam Islam adalah hubungan kerabat, bukan hubungan persaudaraan keagamaan sebagaimana yang terjadi antara muhajirin dan anshar pada permulaan Islam. Thayalisi meriwayatkan dari Ibnu Abbas ia berkata, “Rasulullah shallallahu 'alaihi wa sallam mempersaudarakan para sahabatnya dan sebagian mereka saling mewarisi, sampai turun ayat, “Wa ulul arhaami ba’dhuhum awlaa biba’dhin fii kitaabillah” (Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat)), maka mereka meninggalkan hal itu (waris-mewarisi karena persaudaraan) dan saling mewarisi karena nasab. (Hadits ini diriwayatkan pula oleh Thabrani. Haitsami dalam Majma’uz Zawaa’id juz 7 hal. 28 berkata, “Para perawinya adalah para perawi kitab shahih.”) Oleh karena itu, tidak ada yang menjadi ahli waris bagi seseorang selain kerabatnya, yang terdiri dari As-habul Furudh dan ‘Ashabah. Jika mereka tidak ada, maka yang mewarisinya adalah kerabat terdekat mereka dari kalangan Dzawul Arham sebagaimana ditunjukkan oleh ayat ini. Kata-kata “Menurut kitab Allah” adalah menurut hukum dan syari’at-Nya. Selesai tafsir surat Al Anfaal dengan pertolongan Allah, wal hamdulillah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 75",
    "description": "Dan orang-orang yang beriman setelah kaum muslim awal yang berhijrah itu, yang kemudian akhirnya mereka berhijrah sesudah melewati waktu yang cukup lama dan berjihad bersamamu, maka mereka termasuk golonganmu, yaitu memiliki kedudukan yang sama menyangkut hak dan kewajiban. Apalagi di antara kaum muslim itu ada orang-orang yang mempunyai hubungan kerabat, maka adanya hubungan kekerabatan itu sebagiannya lebih berhak terhadap sesamanya daripada yang bukan kerabat, menurut kitab Allah, dalam hal perlindungan, kasih sayang, pertolongan, dan warisan. Sungguh, Allah maha mengetahui segala sesuatu. Rasulullah telah melakukan beberapa perjanjian dengan kaum musyrik mekah, antara lain perjanjian agar kaum muslim tidak dihalangi untuk melaksanakan umrah, perjanjian untuk tidak melakukan perang di bulan-bulan haram (bulan-bulan mulia), dan perjanjian-perjanjian damai dengan kabilah-kabilah arab sampai waktu tertentu. Namun, pada akhirnya mereka merusak perjanjian tersebut. Maka, dengan turunnya surah at-taubah atau bara'ah ini, kaum muslim diperintahkan untuk tidak melakukan hubungan lagi dengan mereka. Karena itu, inilah pernyataan pemutusan hubungan dari Allah dan rasul-Nya kepada orang-orang musyrik yang kamu telah mengadakan perjanjian dengan mereka, namun mereka merusak perjanjian tersebut. 2."
  }
]