[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Supaya Allah memuliakan islam dan para pemeluknya serta melenyapkan kesyirikan dan para pembelanya, walaupun kaum musyrikin membencinya hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah hendak mengukuhkan kebenaran dengan memberikan kemenangan kepada agama Islam dan para pemeluknya. Yaitu dengan cara memperlihatkan bukti-bukti yang menunjukkan kebenarannya. Dan Allah -Subḥānahu- hendak melenyapkan kebatilan dengan cara memperlihatkan bukti-bukti yang menunjukkan kebatilannya, walaupun orang-orang musyrik tidak menyukai hal itu, namun Allah tetap memperlihatkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. لِيُحِقَّ الْحَقَّ (agar Allah menetapkan yang hak) Untuk meneguhkan agama Islam di muka bumi dan meninggikan kemuliaannya. وَيُبْطِلَ الْبٰطِلَ(dan membatalkan yang batil) Yakni menghapus kesyirikan hingga sirna keberadaannya. وَلَوْ كَرِهَ الْمُجْرِمُونَ(walaupun orang-orang yang berdosa (musyrik) itu tidak menyukainya) Yakni orang-orang musyrik Quraisy, atau seluruh orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8 Agar Allah menetapkan yang hak (Islam) dan meninggikannya dan membatalkan yang batil (syirik) walaupun orang-orang yang berdosa (musyrik) dari golongan Qurays dan orang-orang kafir itu tidak menyukainya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Allah menetapkan yang benar} menampakkan dan meninggikan Islam {dan menghilangkan yang bathil} meniadakan dan menghapus kekufuran {walaupun para pendosa itu tidak suka} orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “agar Allah menetapkan yang haq (islam)” dengan bukti bukti dan argument argument yang kuat yang menunjukan kebenarannya dan keabsahannya ”dan membatalkan yang batil (syirik)” dengan bukti bukti dan argumen argument kuat atas kebatilannya. ”walaupun orang orang yang berdosa (musyrik) itu tidak menyukainya” Allah tidak memperdulikan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 8: Allah tidak peduli meskipun mereka tidak menyukainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 8",
    "description": "Juga, agar Allah memperkuat yang hak, kebenaran yang sempurna, yakni agama islam dan menghilangkan yang batil, yaitu syirik dan segala hal yang bertentangan dengan nilai-nilai islam, walaupun orang-orang yang berdosa, kaum musyrik dan musuh-Musuh islam itu tidak menyukainya. Begitulah kemenangan diraih oleh umat islam berkat pertolongan Allah. Kemenangan dalam peperangan itu melibatkan para malaikat. Para sahabat yang terlibat dalam perang tersebut diperintah; ingatlah ketika kamu nabi Muhammad memohon pertolongan kepada tuhanmu dengan diamini pasukan kaum muslim, supaya menganugerahkan kemenangan dalam perang badar, lalu diperkenankan-Nya bagimu seraya menyampaikan kepada seluruh anggota pasukan kaum muslim melalui dirimu bahwa, sungguh, aku akan mendatangkan bala bantuan kepadamu dengan seribu malaikat yang datang berturut-turut untuk mendukung dan terlibat perang bersama kamu."
  }
]