[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah oleh kalian nikmat Allah yang tercurah pada kalian pada hari perang Badar, ketika kalian meminta kemenangan atas musuh kalian, kemudian Allah mengabulkan doa kalian, sembari berfirman, ”Sesungguhnya Aku akan membantu kalian dengan seribu pasukan malaikat dari langit, yang sebagian akan menyusul sebagian lainnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan ingatlah pada hari perang Badar tatkala kalian meminta pertolongan kepada Allah agar kalian dapat mengalahkan musuh kalian, kemudian Allah mengabulkan permintaan kalian -wahai kaum mukminin- dengan mengirimkan bala bantuan yang berkekuatan seribu malaikat yang datang berbondong-bondong."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "Disini Allah menjelaskan sebagian kenikmatan yang telah Allah berikan kepada orang-orang beriman pada Perang Badar, yaitu dengan menolong dan memenangkan mereka. 9. Allah berfirman kepada mereka: \"Hai orang-orang beriman yang mengikuti Perang Badar, Ingatlah kenikmatan Allah yang telah diberikan kepada kalian ketika kalian akan menghadapi musuh, kemudian kalian sangat berharap kepada Allah agar menolong kalian. Ketika itu Rasulullah berdoa dan kalian mengamininya, kemudian Allah mengabulkan doa tersebut. Ini merupakan karunia dan rahmat Allah bagi kalian. Dan salah satu bentuk dari pengabulan doa itu adalah Aku mengabarkan kepada kalian melalui lisan Rasulullah bahwa Aku akan menolong kalian dengan seribu malaikat yang turun dengan berduyun-duyun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِذْ تَسْتَغِيثُونَ رَبَّكُمْ ((Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu) Setelah mereka mengetahui bahwa mereka harus memerangi pasukan perang kafir Quraisy sebagaimana yang diperintahkan Allah kepada mereka dan setelah melihat besarnya jumlah musuh mereka serta sedikitnya jumlah mereka maka mereka memohon pertolongan dari Allah. Ketika Rasulullah melihat hal itu, beliau kemudian menghadap kiblat dan mengangkat kedua tangannya lalu mulai bermunajat kepada Tuhannya: “Yaa Allah, tepatilah apa yang Engkau janjikan kepadakku, Yaa Allah, berikanlah apa yang Engkau janjikan kepadaku, Yaa Allah, jika Engkau membinasakan pasukan orang-orang Islam ini niscaya Engkau tidak akan disembah lagi di muka bumi ini”. فَاسْتَجَابَ لَكُمْ أَنِّى مُمِدُّكُم بِأَلْفٍ مِّنَ الْمَلٰٓئِكَةِ (lalu diperkenankan-Nya bagimu: “Sesungguhnya Aku akan mendatangkan bala bantuan kepada kamu dengan seribu malaikat) Yakni pasukan dari malaikat yang berperang bersama kalian melawan orang-orang musyrik. مُرْدِفِينَ (yang datang berturut-turut) Yakni Allah mengirim seribu malaikat, kemudian menambahnya menjadi tiga ribu, kemudian menjadikannya lima ribu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "9-10 1 ). Doa yang tulus dari hati yang tunduk adalah merupakan senjata yang ampuh atas izin Allah : { إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ } \"(Ingatlah), ketika kamu memohon pertolongan kepada Tuhanmu, lalu diperkenankan-Nya bagimu\". Ibnu Taimiyah berkata : \"Hati yang tulus dan doa yang baik adalah pasukan yang tidak dapat terkalahkan\". 2 ). Pada peristiwa perang Badr senjata dan iman saling berpelukan dengan sangat erat, Rasulullah sebagai panglima mempersiapkan bala tentaranya, mengatur strategi peperangan, dan memilih lokasi peperangan, dan mengangkat semangat para sahabatnya, kemudian beliau menghadap tuhannya dengan hati yang tunduk, memohon turunya pertolongan dan kemenangan, sampai akhirnya terwujudlah keinginan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9 Ingatlah, sebagaimana kalian tahu bahwa memerangi kelompok tentara Qurays itu suatu keharusan, dan ketika kamu memohon pertolongan kepada Tuhanmu, lalu Dia mengabulkannya bagimu. Allah mengijabah doa dan permintaanmu bahwa akan ditolong oleh seribu malaikat yang akan memerangi orang-orang musyrik dengan berbaris-baris di depan para tentara. Ayat ini turun ketika Nabi berdoa kepada Tuhannya dengan berkata: Ya Allah anugerahkanlah apa yang telah Engkau janjikan, berikan kepada kami apa yang Engkau janjikan. Jika Engkau membinasakan para tentara Islam ini maka bisa jadi tidak ada yang menyembah-Mu di bumi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika kalian memohon pertolongan kepada Tuhan kalian} kalian memohon bantuan dari Allah agar ditolong dari musuh kalian {lalu Dia mengabulkannya untu kalian. “Sesungguhnya Aku akan mendatangkan bala bantuan kepada kalian dengan seribu malaikat yang datang berturut-turut.”} berturut-turut sebagian dengan sebagian lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. yakni ingatlah nikmat Allah kepadamu ketika kamu hampir bertemu dengan musuhmu, kamu memohon pertolongan dan kemenangan kepada Rabbmu, ”lalu diperkenankanNya bagimu” Allah menolongmu dengan beberapa perkara, diantaranya adalah bahwa Allah menghadirkan bala bantuan kepadamu, ”dengan seribu malaikat yang datang berturut turut” yakni sebagian datang dengan disusul oleh yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Anfal ayat 9: Imam Ahmad meriwayatkan dari Umar bin Khattab radhiyallahu 'anhu, ia berkata, “Ketika tiba perang Badar, Rasulullah shallallahu 'alaihi wa sallam melihat para sahabatnya yang jumlahnya tiga rauts orang lebih, dan melihat kaum musyrik yang jumlahnya seribu orang lebih. Maka Nabi shallallahu 'alaihi wa sallam menghadap kiblat dan mengangkat kedua tangannya, ketika itu Beliau memakai selendang dan sarung. Beliau berdoa, “Ya Allah, di mana janji yang Engkau janjikan kepadaku? Ya Allah penuhilah janji-Mu kepadaku. Ya Allah, jika Engkau binasakan sekelompok kaum muslimin ini, maka Engkau tidak akan disembah di bumi selamanya.” Beliau senantiasa meminta bantuan kepada Tuhannya Azza wa Jalla dan berdoa sehingga selendangnya jatuh, lalu Abu Bakar mendatanginya, mengambil selendangnya dan menaruh kembali padanya serta memeluknya dari belakang. Abu Bakar berkata, “Wahai Nabi Allah, cukuplah permohonanmu kepada Tuhanmu, dan Dia akan memenuhi janji-Nya kepadamu.” Maka Allah menurunkan ayat, “Idz tastaghiitsuuna…dst.” Hadits ini diriwayatkan pula oleh Muslim, Tirmidzi, dan Al Hafizh menyandarkannya kepada Abu Dawud , ia berkata, “Dishahihkan oleh Ali bin Al Madini.” Disebutkan pula oleh Ibnu Abi Hatim dan Ibnu Jarir. Agar Dia memberikan kemenangan kepadamu. Kemudian dibantu-Nya lagi dengan tiga ribu malaikat, dan kemudian lima ribu malaikat sebagaimana disebutkan dalam surat Ali Imran ayat 124-125."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Anfal Ayat 9",
    "description": "Begitulah kemenangan diraih oleh umat islam berkat pertolongan Allah. Kemenangan dalam peperangan itu melibatkan para malaikat. Para sahabat yang terlibat dalam perang tersebut diperintah; ingatlah ketika kamu nabi Muhammad memohon pertolongan kepada tuhanmu dengan diamini pasukan kaum muslim, supaya menganugerahkan kemenangan dalam perang badar, lalu diperkenankan-Nya bagimu seraya menyampaikan kepada seluruh anggota pasukan kaum muslim melalui dirimu bahwa, sungguh, aku akan mendatangkan bala bantuan kepadamu dengan seribu malaikat yang datang berturut-turut untuk mendukung dan terlibat perang bersama kamu. Meski berita keterlibatan malaikat sangat menggembirakan, tetapi jangan menduga bantuan pasukan malaikat itu adalah sebab kemenangan. Dan tidaklah Allah menjadikannya, yakni pemberian bala bantuan itu melainkan sebagai kabar gembira berupa kemenangan bagi kamu kaum muslim agar hatimu menjadi tenteram karenanya dan terus maju. Dan kemenangan itu hanyalah dari sisi Allah, bukan dari kekuatan pasukanmu dan atau bantuan malaikat. Kemenangan hanya diraih dengan restu dan kehendak Allah. Sungguh, Allah mahaperkasa, tidak dapat dikalahkan oleh siapa pun, mahabijaksana, dalam menetapkan segala urusan sebagaimana mestinya sesuai dengan ilmu-Nya yang meliputi segala sesuatu"
  }
]