[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan langit yang terdiri dari orbit-orbit matahari, bulan dan sebagainya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-7. Allah melaknat orang-orang yang membangun parit-parit -di Yaman sebelum Nabi Muhammad diutus sebagai Rasul- dengan menjauhkan mereka dari rahmat-Nya. Mereka menggali tanah yang luas kemudian menyalakannya dengan api yang membara untuk membakar orang-orang yang beriman kepada Allah, sedangkan mereka duduk di sekitar api itu sambil menyaksikan orang-orang beriman diazab dan dibakar. Allah menegaskan laknat ini dengan empat sumpah: bersumpah dengan langit yang memiliki bintang-bintang dan orbit-orbitnya, dengan hari kiamat yang Allah janjikan untuk mengumpulkan seluruh makhluk, dengan orang yang menjadi saksi, dan dengan orang yang disaksikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالسَّمَآءِ ذَاتِ الْبُرُوجِ (Demi langit yang mempunyai gugusan bintang) Yakni gugusan bintang yang berjumlah dua belas bagi dua belas bintang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad dari Abu Hurairah radliyallahu ‘anhu: Bahwa Rasul SAW membaca surat AL Buruj dan Ath Thariq ketika masuk akhir waktu Isya. 1. Allah bersumpah atas langit yang mempunyai tempat bagi bintang-bintang. Yaitu 12 gugusan bintang (buruj) dan 12 gugusan bintang (kaukab). Salah satunya adalah matahari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi langit yang mempunyai gugusan bintang} Aku bersumpah demi tempat-tempat edar matahari dan bulan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 “Demi langit yang mempunyai gugusan bintang,” yakni memiliki posisi-posisi (garis-garis edar) yang mencakup tempat matahari, bulan, bintang yang tersusun rapi dalam garis edarnya yang tertata secara sempurna dan rapi yang menunjukkan sempurnaNya kuasa, rahmat, dan luasnya ilmu, serta kebijaksanaan Allah. “Dan demi hari yang dijanjikan,” yaitu Hari Kiamat yang dijanjikan oleh Allah akan dikumpulkannya semua manusia di dalamnya dan digabungkan dari yang pertama hingga yang akhir, yang jauh dan yang dekat. Allah tidak mungkin merubah atau memungkiri janji. “Dan yang menyaksikan dan yang disaksikan,” ini mencakup seluruh orang yang memiliki sifat tersebut. Yakni yang memandang dan yang dipandang, yang hadir dan yang duhadirkan, yang melihat dan yang dilihat. Obyek sumpahnya adalah tanda-tanda kebesaran Allah yang jelas dan hikmahnya yang terang serta rahmatNya yang luas yang terkandung dalam sumpah ini. Ada yang berpendapat bahwa obyek sumpah adalah FirmanNya;"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada pagian surah ini beberapa ayat diturukan kepada Rasulullah ﷺ sebagai penghibur baginya dan bagi para kaum muslimin yang dimana pada saat itu mereka dalam kepungan siksaan dari para kaum kuffar dan musyrikin, Allah ﷻ menjelaskan dalam surah ini bahwasanya beberapa kaum sebelum mereka yang juga merupakan orang-orang yang beriman kepada Allah ﷻ telah mengalami siksaan dan fitnah bahkan jauh lebih kejam dari apa yang kaum musimin alami saat itu, maka kesabaranlah yang lebih pantas mereka lakukan dan sesungguhnya balasan yang lebih besar akan diraih oleh orang-orang yang bertaqwa kepada Allah ﷻ. Dalam surah ini juga Allah ﷻ mengabarkan kepada kaum kufar quraisy tentang kekejaman kaum-kaum kuffar sebelum mereka yang telah mendustakan Rasul-Rasul mereka seperti FIr'aun dan tsamud dan apa yang mereka alami setelah kekejaman itu berlalu, sungguh surah ini sangatlah agung . { وَالسَّمَاءِ } Demi langit, Allah bersumpah demi langit yang darinya manusia mengambil pelajaran dan hikmah dengan kehendak-Nya. { ذَاتِ الْبُرُوجِ } Yaitu langit yang memiliki orbit-orbit ( menara ) yang dilalui oleh matahari dan bulan sebanyak 12 orbit, setiap orbit dilewati matahari sebanyak satu kali dalam sebulan, dan bulan melewati 12 orbit ini dalam sebulan. Dalam riwayat lain dikatakan : yaitu langit yang memiliki gugusan bintang-bintang, dikatakan buruj ( menara ) dengan dua sebab : Pertama : didalamnya tempat penjagaan langit dari gangguan syaithon, seperti benteng-benteng penjaga yang ada didunia, dan kedua : sebagai hiasan bagi langit, Allah berfirman : { وَلَقَدْ زَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ } ( Sesungguhnya Kami telah menghiasi langit yang dekat dengan bintang-bintang ) [ Al Mulk : 5 ] , { إِنَّا زَيَّنَّا السَّمَاءَ الدُّنْيَا بِزِينَةٍ الْكَوَاكِبِ , وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍ } ( Sesungguhnya Kami telah menghias langit yang terdekat dengan hiasan, yaitu bintang-bintang , Dan telah memeliharanya (sebenar-benarnya) dari setiap syaitan yang sangat durhaka ) [ As Saffat : 6-7 ] dengan menara-menara itu Allah ﷻ menjadikannya tempat penjagaan langit dan sebagai hiasan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالسَّمَاءِ ذَاتِ الْبُرُوجِ “” Huruf wau di sini adalah huruf qasam (untuk mengungkapkan sumpah). Yakni Allah Ta’ala bersumpah dengan langit {ذَاتِ الْبُرُوجِ} Maknanya: Yang mempunyai gugusan bintang. Sedangkan الْبُرُوجِ [al-Buruj] adalah bentuk jamak dari بُرْجٌ [Burjun] yang artinya kumpulan banyak dari bintang-bintang, disebut dengan Buruj [yang berarti menara dalam bahasa arab] karena tingga dan jauh keatasnya dia juga karena kejelasannya. Sedang gugusan bintang menurut para pakar perbintangan berjumlahnya ada dua belas rasi yang terkumpul dalam sebuah uacapan seorang pujangga arab: حملٌ فثور فجوزاء ... فسرطان فأسدٌ سنبلة ميزان فعقربٌ قوسٌ فجدي وكـ ... ذا دلو وذي آخرها الحيتان Aries Tuarus Gemini Cancer Leo virgo libra Scorpio Sigitarius kemudian carpicorn, Dan juga aquarius dan yang terakhir Pisces. Itulah keduabelas rasi bintang, tiga rasi muncul saat musim semi, tiga rasi mucul saat musim panas, tiga ras mucul saat musim gugur dan tiga rasi muncul saat musim dingin. Maka Allah disini bersumpah dengan langit yang memiliki gugusan-gugusan bintang. Allah Ta’ala boleh bersumpah dengan apapun yang Dia kehendaki dari ciptaan-Nya. Sedangkina kita tidak boleh bersumpah kecuai dangan nama Allah, dengan nama-nama Allah lain-Nya dan dengan sifat-sifat-Nya, dan kita tidak bersumpah dengan sesuatu dari makhluk-makhluknya, sebagaimana Nabi Shallallaahu ‘alaiohi wa sallam bersabda: مَنْ كَانَ حَالِفاً فَلْيَحْلِفْ بِاللهِ أَوْ لِيَصْمُتْ “Barang siapa yang bersumpah maka bersumpahlah dengan Nama Allah atau diam” (1) Dan berdasarkan sabda Nabi ‘Alahissholaatu wassalaam: مَنْ حَلَفَ بِغَيْرِ اللهِ فَقَدْ كَفَرَ أَوْ أَشْرَكَ “Barang siapa yang bersumpah maka bersumpahlah dengan (nama) Allah atau diam” (2) (1) Dikeluarkan Bukhari (2679) dan Muslim (1646) dari hadits Abdullah Bin Umar radhiyallaahu ‘ahnuma. (2) Dikeluarkan Tirmiziy (1535) dari hadits Ibnu Umar Radhiyallaahu ‘anhaa dinyatakan shahih al-Albaniy dalam shahih al-Jami’ (6204)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 1: 1-3. Allah memulai dalam surat ini dengan banyak sumpah. Allah bersumpah dengan gugusan bintang-bintang yang besar, dan ia ada dua belas gugusan, dan ia merupakan tempat beredarnya bulan yang pengetahuan bagi pemilik tempat bercocok tanam, (untuk mengetahui) musim-musim bertani, menanam, dan memanen buah-buahan. Begitu juga penggembala kambing dan unta di padang pasir, dimana mereka (penggembala) akan mengetahui tahun musiman. Musim panas, semi, dingin dan gugur. Kemudian bersumpah dengan hari mauw’ud, yaitu hari kiamat. Dan bersumpah dengan yang menyaksikan dan disaksikan (dari makhluk). Telah berselisih para ahli tafsir tentang penafsiran yang menyaksikan dan disaksikan. Mereka (ahli tafsir) menyebutkan dengan banyak pendapat, ada yang mengatakan : Yaitu orang yang menyaksikan hari jumat dan yang disaksikan pada hari arafah, ada juga yang mengatakan yang menyaksikan adalah Muhammad ﷺ dan yang disaksikan adalah hari perhitungan. Kesimpulannya dengan mengumpulkan pendapat-pendapat (ahli tafsir) adalah setiap orang yang menyaksikan dia juga disaksikan, sebagaimana pendapat syaikh Sa’di."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang mempunyai posisi-posisi; termasuk pula posisi-posisi matahari dan bulan, bintang yang teratur berjalannya dengan sangat tertib. Ini semua menunjukkan sempurnanya kekuasaan Allah Ta’ala, rahmat-Nya, luasnya ilmu-Nya dan kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 1",
    "description": "1-3. Allah bersumpah demi tiga hal yang luar biasa, baik kejadian maupun prosesnya. Demi langit luas yang mempunyai gugusan bintang atau orbit-orbit bintang ketika beredar di angkasa, yang menjadi penanda kekuasaan Allah yang tidak terbatas. Dan demi hari yang dijanjikan. Itulah hari kiamat, kebangkitan, dan perhitungan yang pasti datang dengan segala kejadian dan kerepotan yang luar biasa di dalamnya. Demi orang yang menyaksikan hari yang dijanjikan itu dan kejadian-kejadian mengerikan dan mencengangkan yang disaksikan oleh mereka pada hari itu"
  }
]