[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang membakar orang-orang yang beriman, laki laki dan perempuan, agar mereka bisa memalingkan orang-orang beriman itu dari agama Allah kemudian mereka tidak bertaubat,bagi mereka diakhirat azab jahanam,bagi mereka azab yang berat dan membakar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya orang-orang yang menyiksa kaum mukminin dan mukminat dengan api untuk memalingkan mereka dari keimanan kepada Allah semata kemudian mereka tidak bertobat kepada Allah atas dosa-dosa mereka, maka bagi mereka pada hari Kiamat siksa Jahanam dan siksa api yang membakar mereka sebagai balasan atas perbuatan mereka membakar kaum mukminin dengan api."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Orang-orang yang menyiksa orang-orang beriman kemudian tidak bertaubat kepada Allah, maka Allah akan mengazab mereka di neraka Jahannam yang membakar mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِنَّ الَّذِينَ فَتَنُوا۟ الْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ (Sesungguhnya orang-orang yang mendatangkan cobaan kepada orang-orang yang mukmin laki-laki dan perempuan) Yakni mereka membakar orang-orang beriman dengan api dan tidak memberi mereka pilihan kecuali agar mereka kembali kafir kepada Allah, sehingga mereka menyiksa orang-orang beriman itu agar meninggalkan agama mereka. ثُمَّ لَمْ يَتُوبُوا۟( kemudian mereka tidak bertaubat) Yakni bertaubat dari perbuatan buruk mereka dan berhenti dari kekafiran dan penyiksaan mereka. وَلَهُمْ عَذَابُ الْحَرِيقِ (dan bagi mereka azab (neraka) yang membakar) Akibat mereka membakar orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1) . Salah seorang da'i berkata : \"Aku melihat salah seorang penyanyi masyhur yang sangat berpengaruh dikalangan pemuda dan pemudi, aku kemudian memutuskan untuk tidak meninggalkannya kecuali aku telah menasihatinya, maka aku pun memberi salam kepadanya, dan Allah mengilhamkan kepadaku untuk menyampaikan di telinganya ayat : { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ } , kemudian aku pun beranjak pergi, dan Demi Allah setelah beberapa berlalu tidak begitu lama aku membaca saru berita tentang taubatnya sang penyanyi pada sebuah surat kabar, begitu indahnya nasihat dengan al-Qur'an ketika menemukan pilihan yang baik dan hati sadar ! 2) . Al-Hasan berkata : \"Perhatikanlah kepada kebaikan yang ditawarkan oleh ayat ini, mereka yang membunuh wali Allah dan orang-orang bertaqwa kepada Allah, tetapi Allah dengan ayat ini mengajak mereka kepada taubat\" 3) . Janganlah kamu berputus asa dari taubat : { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا } perhatikanlah ayat ini, begitu luas toleransi yang Allah berikan kepada hamba-Nya, orang-orang kafir itu menyiksa wali-wali Allah, tetapi Allah datang kepada mereka dengan peluang ampunan jika mereka bertaubat kepada-Nya, hal ini dimaksudkan pada kata : { ثُمَّ لَمْ يَتُوبُوا } . 4) . Orang-orang yang menyiksa kaum mukminin didunia dengan membakar mereka dalam parit yang berisi penuh dengan bara api mereka juga akan disiksa dengan siksaan yang serupa, bahkan siksaan yang ditimpakan kepada mereka akan lebih pedih, yaitu siksaan neraka Jahannam { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ } mereka membakar orang-orang beriman didunia, maka di akhirat mereka akan mendapat siksaan yang jauh lebih pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya orang-orang yang menyiksa orang-orang yang beriman dengan siksaan dan membakarnya agar mereka mau meninggalkan agama mereka. Mereka-pun tidak mau bertobat atas kesalahan mereka, akan mendapatkan azab neraka Jahannam atas kekufuran mereka dan perbuatan mereka yang membakar orang-orang mukmin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya, orang-orang yang menimpakan cobaan} menyiksa dan mambakar {orang-orang mukmin laki-laki dan perempuan, lalu mereka tidak bertaubat, bagi mereka itu azab Jahanam dan bagi mereka itu azab yang membakar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 10 Kemudian Allah memberi janji serta menawarkan taubat pada mereka seraya berfirman, “Sesungguhnya orang-orang yang mendatangkan cobaan kepada orang-orang Mukmin lakl-laki dan perempuan kemudian mereka tidak bertaubat, maka bagi mereka azab Jahanam dan bagi mereka azab (neraka) yang membakar,” yakni, siksaan dahsyat yang membakar. Al-Hasan berkata, “Perhatikanlah kemuliaan dan kedermawanan ini, meraka membunuh para kekasihNya dan orang-orang yang taat kepadaNya, tapi Allah tetap menyeru mereka untuk bertaubat.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ membari peringatan kepada mereka yang melakukan kekejaman itu : { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ } { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ } Sesungguhnya orang-orang yang menganiaya kaum mukminin, dan kata ( فَتَنُوا ) berasal dari kata ( الفِتْنَة ) berarti : ujian atau cobaan, orang-orang kuffar itu menguji kaum mukminin apakah mereka ingin keluar dari agama mereka atau justru sebaliknya, dan para mukminin itu tidak ingin meninggalkan dan membebaskan keimanannya kepada Allah ﷻ , tiada lagi bagi mereka jalan keluar selain sabar atas musibah dan cobaan itu, dan pada hakikatnya setiap mukmin akan dicoba dan diuji keminanannya, Allah ﷻ berfirman : { أَحَسِبَ النَّاسُ أَنْ يُتْرَكُوا أَنْ يَقُولُوا آمَنَّا وَهُمْ لَا يُفْتَنُونَ } ( Apakah manusia itu mengira bahwa mereka dibiarkan (saja) mengatakan: “Kami telah beriman”, sedang mereka tidak diuji lagi? ) [ Al-Ankabut : 2 ] mereka akan diuji dan apabila mereka sabar diatas keimanan maka mereka termasuk orang-orang yang dipercaya keimanannya, dan apabila mereka keluar dan membebaskan keimanan itu maka sesungguhnya mereka berada dalam kebinasaan. Dan Allah menimpakan suatu cobaan kepada hamba-Nya agar nampak siapakah diantara mereka yang benar perkataannya dan siapa yang berdusta, agar nampak diantara mereka yang beriman dengan sesungghnya keimanan kemudian Allah ﷻ membalasnya dengan kebaikan yang lebih besar, dan kepada orang-orang kafir siksaan dan azab neraka. Dan sesungguhnya apa yang terjadi di alam semesta ini tidak ada yang sia-sia, dan tidak pergi begitu saja, dan tidak satupun peristiwa yang terjadi dikehidupan dunia ini yang terbebas dari pengawasan Allah ﷻ , meskipun orang-orang kuffar menghindar dan terus menerus berua kerusakan dan kemaksiatan dimuka bumi sesungguhnya amalan mereka tercatat dan tersimpan baik dan mereka akan dibangkitkan kembali dan akan mempertanggung jawabkan perbuatan itu dan balasan yang pantas bagi mereka akan berlaku, sekali-kali sangkaan mereka terhadap hari pembalasan yang tidak akan terjadi adalah sia-sia, Allah ﷻ berfirman : { أَمْ حَسِبَ الَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ أَنْ يَسْبِقُونَا ۚ سَاءَ مَا يَحْكُمُونَ } ( Ataukah orang-orang yang mengerjakan kejahatan itu mengira bahwa mereka akan luput (dari azab) Kami? Amatlah buruk apa yang mereka tetapkan itu. ) [ Al-Ankabut : 4 ]. Sebagian orang mengatakan : kenapa orang-orang kuffar bebas melakukan apapun yang mereka inginkan, sedangkan orang-orang mukmin selalu ditimpa dengan keburukan yang orang-orang kuffar perbuat, dan para kuffar tidak pernah terjadi pada diri mereka timpaan musibah. ? Maka kami mengatakan : sesungguhnya mereka akan merasakan kesusahan seperti yang sebagian mukmin rasakan dan itu harus mereka alami, akan tetapi musibah atau kesusahan itu belum diberlakukan bagi mereka didunia karena sesungguhnya balasan yang akan mereka terima lebih besar dan lebih dahsyat, dan pastinya akan lebih panjang masanya, Allah ﷻ berfirman : { وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ ۚ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ } ( Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak ) [ Ibrahim : 42 ]. walaupun kemaksiatan orang-orang kafir diabaikan didunia akan tetapi balasan bagi mereka menunggu di hari kiamat. Dan orang-orang beriman sesungguhnya amalan dan sabar serta keistiqomahan mereka diatas agama Allah tidak akan sia-sia, karena sesungguhnya ganjaran bagi mereka telah Allah siapkan di hari akhir nanti. { إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ } Sesungguhnya orang-orang ( para pemilik parit ) yang menganiaya orang-orang beriman, { وَالْمُؤْمِنَاتِ } serta para perempuan-perempuan yang beriman, karena diantara orang-orang yang dianiaya itu bersama mereka sejumlah wanita mukminah yang ikut disiksa juga, diantaranya adalah seorang mukminah bersama bayinya yang ketika sampai ditepi parit sebelum akhirnya dilemparkan kedalam bara api itu gemataran dan ketakutan, maka berkatalah bayi ibu itu : wahai ibuku bersabarlah sesungguhnya kamu berada diatas kebenaran. { ثُمَّ لَمْ يَتُوبُوا } Kita perhatikan bagaimana Allah memberikan kepada hambanya kesempatan untuk bertaubat sebesar apapun dosa yang mereka perbuat, jikalau sekiranya pemilik parit yang kejam itu bertaubat kepada Allah ﷻ niscaya Allah ﷻ akan menerima taubatnya, sbesar apapun dosa seorang hamba Allah ﷻ akan menerima taubatnya jika dia meninggalkan kemaksiatan itu, karena sesungguhnya Allah ﷻ maha penerima taubat. { فَلَهُمْ عَذَابُ جَهَنَّمَ } Jika mereka tidak bertaubat kepada Allah ﷻ , maka bagi mereka azab neraka jahannam yang sangat pedih, sesungguhnya api neraka jauh lebih panas dibandingkan dengan api yang mereka buat di parit itu, api yang mereka buat hanya sesaat akan mati, sedangkan api neraka tidak akan berhenti baranya dan akan terus menyala selamanya, dan panasnya jauh lebih panas dibandingkan dengan api yang ada didunia. { وَلَهُمْ عَذَابُ الْحَرِيقِ } Bagi mereka azab yang membakar sekujur tubuh mereka, dan mereka akan merasakan kepedihan yang sangat pedih seperti yang dirasakan oleh orang-orang mukmin rasakan ketika dibakar di parit yang berisi api yang membakar tubuh mereka, dan kata ( جَهَنَّمَ ) dan ( الْحَرِيقِ ) adalah dua nama dari sejumlah nama-nama neraka yang ada, dan inilah balasan bagi para pemilik parit yang berisi api yang membakar orang-orang mukmin itu. { ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ } Pada ayat ini dapat difahami bahwasanya orang-orang yang berbuat dosa kemudian dia bertaubat kepada Allah ﷻ sebelum ajal menjemputnya Allah ﷻ akan menerima taubatnya, dan dapat difahami pula bahwasa tidak semestinya seseorang di jatuhkan kepadanya hukum sebagai penghuni neraka meskipun dia berbuat dosa, karena tidak diketahui bagaimana hidupnya berakhir, boleh saja dia bertaubat sebelum ajalnya datang dan surga berhak atasnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Para ulama mengatakan: فَتَنُوا \"(orang-orang yang) mendatangkan cobaan” maknanya: Membakar sebagaimana Allah Ta’ala berfirman: يَوْمَ هُمْ عَلَى النَّارِ يُفْتَنُونَ (13) ذُوقُوا فِتْنَتَكُمْ هَذَا الَّذِي كُنْتُمْ بِهِ تَسْتَعْجِلُونَ “(Hari pembalasan itu) ialah pada hari ketika mereka diazab di atas api neraka.\"Rasakanlah azabmu itu. Inilah azab yang dulu kamu minta untuk disegerakan ” (QS. Adz-Dzariyat: 13-14) Mereka telah membakar orang-orang mukimin baik yang laki-laki mau pun yang perempuan ke dalam api. Dikatakan juga: Menimpakan cobaan kepada mereka. Maknanya: menghalangi mereka dari agama mereka. Yang benar: Bahwa makna ayat tersebut mencakup keduanya, karena kita perlu tahu bahwa al-Quran al-Karim memiliki makna yang lebih luas dari pemahan kita, bahwa bagaimana pun tingkat kecerdasan dan kepintaran kita, kita tidak akan mampu menjangkau seluruh ilmunya. Sebuah kaedah dalam tafsir mengatakan bahwa: Apabila ayat memiliki dua kemungkinan makna yang tidak ada penguat yang menguatkan salah satunya dari makna yang lain, juga tidak saling bertentangan maka maknanya bisa dicakupkan untuk kedua makna tersebut, maka kita katakan: Mereka (orang-orang kafir) meimpakan cobaan kepada orang-orang mukmin dengan menghalangi mereka dari agama mereka juga menimpakan cobaan dengan membakar dengan api. ثُمَّ لَمْ يَتُوبُوا Maknanya: Mereka tidak kembali kepada Allah dengan meninggalkan kemaksiatan menuju ketaatan kepada-Nya فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ \"maka bagi mereka azab Jahannam dan bagi mereka azab (neraka) yang membakar. ” Karena mereka telah membakar wali-wali Allah, maka mereka memperoleh balasan seperti apa yang telah mereka perbuat sebagai balasan yang sesuai. Alangkah jauhnya perbedaan antara api dunia dan api akhirat, sungguh api akhirat 99 kali lipat lebih dahsyat dari api dunia. Pelajaran-pelajar pada ayat-ayat ini: Bahwa terkadang Allah subhaanahu wa Ta’ala memberikan kekuasan kepada musuh-musuh-Nya terhadap wali-wali-Nya, maka jangan merasa aneh jika Allah memberikan kekuasaan orang-orang kafir terhadap orang orang mukmin, lalu mereka membunuh dan membakar orang-orang mukmin, mereka juga merampas kehormatannya, jangan merasa aneh. Maka sungguh Allah Ta’ala memiliki hikmah di balik itu. Orang-orang beriman yang tertimpa cobaan mempunyai pahala yang besar di sisi Allah, dan orang-orang kafir yang melampaui batas akan Allah subhaanahu wa Ta’ala penuhi mereka (dengan dosa) dan mengistidraaj (membiarkan mereka dalam dosa) tanpa mereka sadari. Dan orang-orang muslim yang masih hidup akan memperoleh pelajaran dari yang menimpa saudara-saudaranya. Misalnya kita mendengar yang terjadi berupa penindasan besar-besaran, penidasan terhadap kehormatan, perampasan harta benda, anak-anak dan orang lanjut usia kelaparan, kita medengarkan berita-berita yang membuat kita menangis. Maka kita katakan: Subhaanallaah! Penindasan macam apa yang Allah kuasakan kepada orang-orang muslim? Kita katakan: Wahai saudaraku jangan merasa heran, Allah subhaanahu Wa Ta’ala telah memberikan kita banyak contoh dari orang-orang sebelum kita, mereka membakar orang-orang mukmin. Mereka yang telah menjajah saudara-saudara kita di negeri orang-orang mukmin, ini akan meninggikan derajat orang-orang yang tertimpa cobaan itu, menghapus dosa-dosa mereka dan itu juga menjadi pelajaran bagi orang-orang yang masih hidup, itu juga sebagai tipu daya bagi orang-orang kafir sehingga mereka mampu berkuasa, hingga nantinya Allah ‘Azza Wa Jalla akan mengazab mereka dengan azab Yang Maha Perkasa lagi Maha kuasa. Dalam ayat-ayat tersebut juga terdapat pelajaran-pelajaran: Bahwa orang-orang kafir itu tidaklah menyiksa orang-orang mukmin karena kesalahan melainkan karena satu perkara yaitu karena mereka beriman kepada Allah yang Maha Perkasa lahi Maha terpuji. Dan ini bukanlah kesalahan, tetapi ini adalah kebenaran, dan siapa pun yang mengingkarinya maka dialah yang harusnya diingkari. Kita memohaon kepada Allah Subhaanahu Wa Ta’ala agar menolong orang-orag islam di semua tempat, dan melindungi kita dari keburukan musuh-musuh kita, dan menjadikan tipu daya mereka berada di leher merekam sesungguhya Dia maha kuasa atas segala sesuatu. Ayat ini juga mengandung isyarat bahwa taubat akan menggugurkan dosa-dosa sebelumnya. Akan tetapi taubat tidak akan menjadi taubat nasuha yang diterima di sisi Allah kecuali jika terpenuhi lima syarat: Pertama: Ikhlas karena Allah ‘Azza Wa Jalla, yaitu yang mendorong seorang insan untuk bertaubat adalah karena takut kepada Allah ‘Azza Wa Jalla, dan berharap pahada dari-Nya. Karena terkada seseorang bartauat tujuannya agar dipuji manusia, atau dalam rangka agar terhindar dari celaan manusia, atau agar memperoleh kedudukan yang ingin ia capai, atau karena ingin memperoleh harta, semua itu tidak akan diterima taubatnya, karena taubat wajib atas dasar keikhlasan, sedangkan orang yang menginginkan dunia dari amalannya maka sesungguhnya Allah Ta’al telah berfirman dalam kitab-Nya: مَنْ كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لَا يُبْخَسُونَ (15) أُولَئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الْآخِرَةِ إِلَّا النَّارُ “Barangsiapa yang menghendaki kehidupan dunia dan perhiasannya, niscaya Kami berikan kepada mereka balasan pekerjaan mereka di dunia dengan sempurna dan mereka di dunia itu tidak akan dirugikan.Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka ” (Qs. Hud: 15-16) Kedua: Di antara syarat taubat nasuha adalah menyesali dosa yang telah diperbuat maksudnya jangan sampai seorang insan merasa seakan akan tidak berdosa, tidak menyesal tidak juga bersedih. Ia harus menyesal, jika ia mengingat kebesan Allah menyesal, bagaimana mungkin saya bermaksiat kepada Rabb ku, pada Dialah yang menciptakanku, yang memberi rejekiku dan memberiku petunjuk, ia menyesal. Ketiga: Berlepas dari dosa. Maka tidak akan sah taubat jika masih terus-menerus mengulang dosa, karena orang yang bertaubat adalah orang yang kembali. Maka jika da seseorang yang mengatakan: Aku memohon ampunan dan bertaubat kepada Allah dari memakan riba, tetapi ia masih tetap melakukan transaksi ribawi maka taubatnya tidak sah. Atau jika mengatakan: Aku memohin ampunan kepada Allah dari ghibah. Ghibah adalah engkau menyebut saudaramu dengan sesuatu yang ia tidak sukai. Tapi di setiap majlis ia selalu mengghibah orang lain maka taubatnya tidak sah, bagaimana taubatnya itu sah sedangkan ia masih terus-menerus dalam kemaksiatan. Dia mesti berlepas. Dan jika ia hendak bertaubat dari mengamil harta orang lain, ia telah mencuri, dan mengambil harta orang lain dengan menipu dan berbuat curang maka taubatya tidak akan sah kecuali jika ia mengembalikan harta-harta yang telah ia ambil kepada pemiliknya. Taruh kata ada seseorang yang mengubah batas-batasan tanahnya melampaui batasan tanah milik tetangganya, kemudian ia mengatakan: Aku bertaubat. Maka kita katakan kepadanya: Kembalikan lagi tanda-tanda batasan sebagaimana mestinya, jika tidak maka taubatmu tidak akan diterima, karena dia harus berlepas dari dosa yang ia taubat darinya. Syarat keempat: Menancapkan tekad yang sempurna untuk tidak lagi mengulang dosanya itu. Jika ia bertaubat sedangkan dalam dirinya jika ada kesempatan untuk melakukannya dia pasti melakukannya lagi maka sungguh taubatnya ini tidak diterima. Namun ia mesti menancapkan tekad yang kuat untuk tidak megulanginya lagi. Kelima: Taubatnya dilakukan pada waktu diterimanya taubat, karena ada waktu-waktu tertentu yang taubat tidak akan diterima, itu ada dalam dua keadaan: Pertama: Jika kematian sudah menghampirinya, maka taubatnya tidak akan diterima, sebagaimana Allah Tabaraka wa Ta’ala berfirman: وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّى إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ “Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan: \"Sesungguhnya saya bertaubat sekarang ”(QS. An-Nisa: 18) Setelah kematian di depan matanya, dan menyaksikan azab barulah berkata: Aku bertaubat. Maka ini tidak akan bermanfaat. Contoh nyata dalam pembahasan ini: Ketika fir’aun sedang ditenggelamkan, ia berkata: Aku beriman kepada yang diimani oleh Bani Israil, maksudnya beriman kepada Allah, ia tidak mengatakan: Aku beriman kepada Allah, ini bentuk perendahan bagi dirinya karena ia telah memerangi Bani Israil karena mereka beriman kepada Allah, sedangkan sekarang ia berkata: Aku neriman kepada yang mereka imani, seakan-akan ia menjadi pengikut bani Israil sampai seperti itu kerendahannya. Walau pun begitu tetap dikatakan kepadanya: apakah baru sekarang kamu bertaubat, apakah baru sekarang kamu beriman kepada yang diimani Bani Israil, apa baru sekarang, sedangkan kamu sebelumnya bermaksiat dan kamu dahulu termasung orang-orang yang berbuat kerusakan. Dengan demikian, apabila kematian telah datang, maka taubat tidak diterima, maka sudah semestinya untuk segera bertaubat, karena anda tidak akan tau kapankah kematian akan menghampirimu. Bukankah anda tahu ada sebagian orang yang tidur di atas kasurnya dalam keadaan sehat dan afiat, kemudian ia dibawa dari kasurnya ke tempat pemandian jenazahnya?! Bukankah kamu tahu sebagian orang ada yang duduk di kursi kerjanya untuk bekerja kemudia ia dibawa dari kursinya itu menuju tempat pemandian jenazahnya?! Semua ini nyata, oleh karena itu, haruslah bersegera bertaubat sebelum pintu-pintunya tertutup. Keadaan kedua: Apabila matahari terbit dari barat, sesungguhnya apabila matahari terbit dari barat kemudian orang-orang melihatnya mereka akan beriman seketika, karena Allah Ta’ala berfirman: يَوْمَ يَأْتِي بَعْضُ آيَاتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا “Pada hari datangnya sebagian ayat-ayat dari Rabbmu, tidaklah bermanfaat lagi iman seseorang kepada dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya. ”(QS. Al-An’am: 158) Yang dimaksudkan dengan sebagian ayat-ayat itu adalah terbitnya matahari dari barat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 10: Ketahuilah wahai manusia ! Bahwasanya yang mengadzab dan membakar mereka (orang-orang yang beriman) baik laki-laki maupun perempuan dengan api, akan menjadi sebab fitnah bagi agama mereka (kaum muslimin), kemudian mereka tidak mau kembali dari kekufurannya dan ke-thaghutannya (kepada islam), maka mereka akan diadzab dengan adzab jahannam (dan) wajahnya menghitam karena sebab kekafirannya dan bersamaan dengan kejahatannya yang besar. Maka jika mereka bertaubat, Allah akan masukkan mereka termasuk golongan yang dirahmati, dan ini merupakan kelembutan yang datang dari Allah, keadilan-Nya dan kemuliaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengancam mereka dan menawarkan mereka untuk bertobat. Al Hasan rahimahullah berkata, “Lihatlah kepada kemuliaan dan kemurahan ini; mereka membuuh para wali-Nya dan orang-orang yang menaati-Nya, tetapi Dia (Allah) mengajak mereka bertobat.” Yang dimaksud dengan mendatangkan cobaan adalah seperti menyiksa, mendatangkan bencana, membunuh dan sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 10",
    "description": "Sungguh, orang-orang yang mendatangkan cobaan kepada orang-orang yang mukmin laki-laki dan perempuan dengan menghadapkan mereka pada pilihan mempertahankan keimanan atau disiksa dalam api yang membara, lalu mereka tidak bertobat dari kekejian mereka, kemudian melakukan amal saleh sebagai tanda tobat mereka, maka mereka akan mendapat azab jahanam dan mereka akan mendapat azab neraka yang membakar. Allah menyediakan bagi mereka azab dari jenis yang sama dengan apa yang mereka timpakan kepada kaum beriman, namun kadarnya lebih hebat. 11. Sungguh, orang-orang yang beriman dengan kukuh dan membawanya hingga mati, dan mengerjakan kebajikan baik secara ritual maupun sosial, mereka akan mendapat taman-taman surga yang mengalir di bawahnya sungai-sungai yang jernih, indah, dan menyejukkan hati. Itulah kemenangan yang agung; anugerah yang Allah khususkan bagi orang yang taat kepada-Nya."
  }
]