[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang orang yang membenarkan Allah dan rasul NYA,serta beramal shalih, bagi mereka surge-surga yang di bawah istana-istana dan kebun-kebunnya mengalir sungai-sungai. itu adalah kemenangan besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sesungguhnya orang-orang yang beriman kepada Allah dan mengerjakan amal saleh, bagi mereka Surga-surga yang di bawah istana dan pepohonannya mengalir sungai-sungai. Balasan yang diberikan kepada mereka ini merupakan kemenangan besar, tidak ada lagi kemenangan yang setara dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Orang-orang beriman yang melaksanakan ketaatan kepada Allah akan mendapat surga-surga yang di bawah pepohonan dan istana-istananya terdapat sungai-sungai air tawar yang mengalir. Kedudukan yang tinggi itu merupakan kemenangan yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Adapun orang-orang yang beriman kepada Allah, Rasul-Nya, dan hari akhir. Kemudian mereka mengerjakan amal kebaikan yang Allah perintahkan. Pada hari kiamat, mereka akan diberi balasan surga yang di bawahnya dialiri sungai-sungai dan ada kebun-kebun. Itulah keberuntungan yang agung yang tidak diperuntukkan untuk orang-orang selain mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dan beramal shalih, mereka itu akan mendapat surga yang mengalir di bawahnya sungai-sungai. Itulah kemenangan yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11 Setelah menjelaskan hukuman orang-orang zhalim, selanjutnya Allah menyebutkan pahala orang-orang yang beriman, “Sesungguhnya orang-orang yang beriman,” dengan hati mereka, “dan mengerjakan amal-amal yang shalih,” dengan anggota badan mereka, “bagi mereka surga yang mengalir di bawahnya sungai-sungai; itulah keberuntungan yang besar” yang akan mereka peroleh dan keberuntungan mendapatkan ridha Allah dan tempat kemuliaan dariNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah menyebutkan gambaran balasan bagi orang-orang kafir, Allah ﷻ kemudian menyebutkan dalam ayat ini gambaran balasan atau ganjaran bagi orang-orang yang beriman kepada Allah ﷻ yang semuanya adalah kenikmatan yang tidak pernah ada serupanya didunia, Allah ﷻ berfirman : { إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ ذَٰلِكَ الْفَوْزُ الْكَبِيرُ } , perhatikanlah perbedaan diantara dua golongan manusia ini, orang-orang kafir itu mendapatkan balasan yang jauh lebih buruk dan lebih menyengsarakan hidup mereka, dan orang-orang beriman bagi mereka balasan yang penuh dengan kenikmatan yang jauh lebih besar. Dan sebagaimana yang diketahui bahwasanya kualitas amal itu berdasarkan keimanan seseorang, dan definisi iman adalah : menyatakannya dengan lisan, dan meyakninya dengan hati, serta mengerjakannya dengan anggota badan, keimanan itu bertambah dengan ketaatan, dan akan berkurang dengan kemaksiatan, kenapa amal disandingkan dengan iman, padahal amal seseorang terganung imannya, itu dikarenakan pentingnya amal sesorang dalam menentukan nasib hidupnya pada hari kiamat, sama halnya dengan apa yang Allah ﷻ katakan di ayat lain : { مَنْ كَانَ عَدُوًّا لِلَّهِ وَمَلَائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ فَإِنَّ اللَّهَ عَدُوٌّ لِلْكَافِرِينَ } ( Barang siapa yang menjadi musuh Allah, malaikat-malaikat-Nya, rasul-rasul-Nya, Jibril dan Mikail, maka sesungguhnya Allah adalah musuh orang-orang kafir. ) [ Al-Baqarah : 98 ], dalam ayat ini secara khusus Jibril dan Mikail disebutkan padahal keduanya adalah bagian daripada Malaikat pada umumnya, akan tetapi kedua Malaikat ini memiliki kedudukan khusus diantara para Malaikat lainnya, juga dalam Ayat lain Allah berfirman : { حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَىٰ وَقُومُوا لِلَّهِ قَانِتِينَ } ( Peliharalah semua shalat(mu), dan (peliharalah) shalat wusthaa. Berdirilah untuk Allah (dalam shalatmu) dengan khusyu’ ) [ Al-Baqarah : 238 ], bukankah shalat wusthaa itu bagian daripada shalat-shalat lainnya, tapi kenapa penyebutannya dikhususkan dalam ayat ini ? itu karena keutamaan kedudukan khusus yang ada pada shalat ini. { لَهُمْ جَنَّاتٌ } Bagi mereka surga-surga yang jumlahnya tidak diketahui kecuali Allah saja yang mengetahuinya, mereka pun tidak tidak tinggal didalamnya hanya sementara, tetapi mereka akan tinggal didalam surga-surga itu selamanya mereka kekal didalamnya, Allah ﷻ berfirman : { لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ } ( Mereka tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan daripadanya ) [ Al-Hijr : 48 ], mereka tidak hawatir kematian akan kembali menimpa mereka, tidak ada sakit dan tidak pula penyakit didalam surga itu, mereka sama sekali tidak takut jika kesedihan dan kegalauan akan menimpa mereka, mereka tidak akan pernah saling mencela satu sama lainnya, tidak ada kebencian diantara mereka, mereka tidak akan menjadi tua sampai selamanya, karena sesungguhnya semua itu tiak ada disurga, dan tentunya kenikmatan yang mereka rasakan tidak akan pernah habis. { لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ } Pada kenikmatan itu ada kenikmatan lain yang mengiasi kebahagiaan mereka, yaitu melihat kepada indahnya sungai-sungai yang mengalir disurga itu, karena melihat kepada air yang mengalir disungai-sungai itu adalah suatu kenikmatan tersendiri bagi kedua mata. Sungai-sungai apakah yang dijanjikan untuk penghui surga itu ? apakah seperti sungai-sungai yang ada di dunia ? tentu tidak, sungai-sungai itu terdiri dari jenis-jenis yang berbeda, seperti sungai-sungai madu, sungai-sungai khamar, sungai-sungai susu, dan sungai-sungai yang rasanya tidak akan pernah berubah, sungai-sungai itu tidak ada samanya dengan sungai-sungai didunia. { ذَٰلِكَ الْفَوْزُ الْكَبِيرُ } Itulah yang akan diperoleh orang-orang beriman kepada Allah balasan atas kesabaran mereka terhadap ujian dan cobaan yang kerap menimpa mereka didunia, mereka menang setelah cobaan silih berganti menimpa, dan kemenangan itu tidak akan diraih kecuali dengan ujian dan cobaan yang banyak serta sabar yang kuat dalam menghadapinya, mereka menjadi pemenang, sedangkan orang-orang kuffar akan menjadi orang-orang yang rugi, para pemilik parit itu akan rugi dan celaka selamaya. { ذَٰلِكَ الْفَوْزُ الْكَبِيرُ } Kemenangan yang mereka raih adalah kemenangan yang besar, yakni keselamatan dari fitnah akhir zaman dan dari siksaan pada hari kiamat, bukan kemenangan dengan meraih dirham ataupun dinar seperti yang terjadi didunia, bahkan kemenangan itu lebih besar yang wujudnya anya Allah ﷻ yang mengetahuinya. Dia Allah ﷻ yang kebaikan dan pemberian-Nya tidak terbatas kepada seluruh hamba-Nya dan kepada mukminin jangan lah kamu sekedar mengharap dari-Nya pemberian, tetapi takutlah kepada-Nya karena sesungguhnya azabnya sangatlah pedih, sebagaimana Dia juga pemberi ampun yang balasan dan rahmat-Nya sangat luas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Setelah menyebutkan hukuman bagi orang-orang jahat, Allah menyebutkan pahala bagi orang-orang yang beriman, inilah metode Al-Quran dalam memotivasi dan memperingatkan. Al-Quran-al-Karim adalah matsani, yang menyebutkan makna-makna beserta pembandingnya. Di dalamnya disebutkan azab penduduk neraka lalu disebutkan juga kenikmatan penduduk surga , disebutkan sifat-sifat orang beriman juga sufat sifat orang-orang kafir, agar seorang insan berjalan menuju Allah dengan rasa takut dan rasa berharap, sehingga ia menyadari nikmat Allah kepadanya berupa nikmat islam, dan semakin bertambah semangatnya dalam melakukan ketaatan kepada Allah, dan mengetahui kebijaksanaan Allah Ta’ala dengan adanya orang-orang kafir yang jahat itu sehingga ia pun semakin tambah berhati-hati dari kekufuran. إِنَّ الَّذِينَ آمَنُوا “Sesungguhnya orang-orang yang beriman ” Mereka adalah orang-orang yang beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya dan kepada hari akhir, juka kepada qada dan qadar, baik dan buruknya, Maka sesungguhnya inilah keimana sebagaimana yagn dijelaskan oleh Nabi shallallaahu ‘alaih wa sallam ketika ditanya oleh Jibril tentang iman, belia bersabda: أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ اْلآخِرِ، وَالْقَدَرِ خَيْرِهِ وَشَرِّهِ “Engkau beriman kepada Allah,malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya dan kepada hari akhir, juka kepada qadar, baik dan buruknya ”(1) Sedangkan firman-Nya وَعَمِلُوا الصَّالِحَاتِ “dan mengerjakan amal-amal yang saleh ” Maksudnya: Mereka telah mengerjakan amal-amal yang saleh. Sedangkan amal-amal yang saleh adalah yang dibangun di atas keikhlasan kepada Allah dan mengikuti syari’at Allah. Maka siapa saja yang beramal yang ia menyukutukan Allah dengan selain-Nya, maka amalan tertolak, sebagai mana sabda Nabi shallallaahu ‘alaihi wa sallam, yang baliau riwayatkan dari Rabnyabahwa Dia berfirman: أَنَا أَغْنَى الشُّرَكَاءِ عَنِ الشِّرْكِ مَنْ عَمِلَ عَمَلاً أَشْرَكَ فِيْهِ مَعِي غَيْرِي تَرَكْتُهُ وَشِرْكَهُ “Saya tidak butuh orang-orang yang syirik dari kesyirikan, maka siaa saja yang bermal suatu amalah yang ia menyekutukan ku dengan selaiku maka aku tinggalkan dia dan juga kesyirikannya ” (2) Adapun mengikuti dimaksudkan dengan mengikuti Rasulullah shallallahu ‘alaihi wa sallam, maka sesungguhnya barang siapa yang beramal dengan amalan tidak didasari syari’at Allah amaka amalnya itu batal juga tertolak, sebagaiamana sabda Nabi shallallaahu ‘alaihi wa sallam: مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ “ Barang siapa yang beramal dengan amalah yang tidak ada perintah dari kami maka itu tertolak”(3) Atas dasar itu, maka ibadah orang yang riya, ia beribadah kepada Allah tetapi ingin dipandang oleh manusia, dengan menampakkan ibadah sehingga orang-orang melihatnya lalu memujinya, sedangkan dia juga tidak ingin mendekatkan diri kepada manusia, ia tetap ingin mendekatkan dirj kepada Allah, tetapi ia ingin dipuji manusia atas perbuatan mendekatkan diri kepada Allah dan ibadahnya itu , maka orang seperti ini adalah muraii (orang yang riya) amalannya tertolak juga.begitu juga orang yang berbicara berupa quran atau dzikr dan mengeraskan suaranya agar didengarkan oleh manusia sehingga ia dipuji atas dzikrnya kepada Allah, ini juga orang yang riya, amalannya ditolak, karena ia telah menyekutukan Allah dengan yang lain-Nya (dalam ibadah). Ia ingin dipuji orang-orang atas ibadahnya kepada Allah, adapun beribadah untuk manusia maka dia adalah orang musyrik dengan kesyirikan akbar (terbesar), yakni (seperti) jika ia solat di hadapan sesorang dalam rangka mengagungkannya, bukan untuk Allah, ia ruku’ dan sujud untuk seseorang, maka dia adalah orang yang musrik dengan kesyirikan akbar yang mengeluarkan dari agama islam. Dan siapa saja yang membuat-buat kebid’ahan yang bukan dari agama Allah seperti jika mengharuskan ucapan dzikir-dzikir tertentu pada waktu tertentu, maka ini tidak akan diterima darinya. Meskipun ia berdzikir kepada Allah dengan tasbih, tahmid, takbir dan tahlil namun ia membuatnya dengan cara yang tidak ada sumbernya dari sunnah (contoh Nabi shallallaahu ‘alaihi wa sallam) maka ini tidak akan diteriman di sisi Allah ‘Azza Wa Jalla, karena dia telah beramal dengan amalan yang tidak ada perintah Allah dan Rasul-Nya. Yang terpenting adalah bahwa Allah mensyaratkan keimanan dengan disertai amal saleh. Dengan demikian, kita tahu bahwa tidak selayaknya bagi kita selalu terfokus dengan akidah, kemudian kita mengatakan: Kami di atas akidah islam, di atas ini, di atas begini, dan tidak menyebutkan amal, karena mencukupkan akidah saja tidak cukup, harus disertai dengan amalan, maka selayaknya ketika anda mengatakan kami berada di atas akidah islam anda juga mengatakan: dan kami beramal saleh, karena Allah selalu menyandingkan antara iman yang mencakup akidah dengan amal saleh, sehingga seorang insan tidak kosong dari amal saleh. Adapun jika sekedar akidah saja maka itu tidak akan bermanfaat, seandainya seorang insan mengatakan: Saya beriman kepada Allah tetapi ia tidak beramal maka mana (bukti) keimanannya kepada Allah? Oleh karenanya pendapat yang rajih dari pendapat-pedapat para ulama bahwa orang yang meninggalkan shalat kafir keluar dari agama islam, kami telah menjelaskan dalil-dalilnya dalam sebuah buku kecil, tidak perlu diulangi penjelasannya di sini. لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ذَلِكَ الْفَوْزُ الْكَبِيرُ :”bagi mereka surga yang mengalir di bawahnya sungai-sungai; ” Maknanya: bagi mereka dari sisi Allah mendapatkan surga yang mengalir di bawahnya sungai-sungai, itu semua diperoleh setelah hari kebangkitan, sesugguhnya mereka akan memasuki surga surga yang di dalamnya terdapat kenikmatan yang tidak pernah dipandang mata, tidak pernah didengar telinga dan tidak pernah terbersit dibenak manusia. Oleh karena itu Allah Ta’ala berfirman: فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّةِ أَعْيُنٍ جَزَاءً بِمَا كَانُوا يَعْمَلُونَ “Tak seorangpun mengetahui berbagai nikmat yang tersembunyi, yang indah dipandang sebagai balasan bagi mereka, atas apa yang mereka kerjakan. ” (QS. As-Sajdah: 17) Allah Ta’ala juga berfirman dalam hadits qudsi: أَعدَدْتُ لِعِبَادِي الصَّالِحِيْنَ مَا لَا عَينَ رَأتْ وَلَا أُذُنَ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بَشَرٍ \"Aku menyiapkan untuk hamba-hamba-Ku yang saleh apa-apa yang tidak pernah dipandang mata, tidak didengar telinga tidak pula perneh terbersit di hati manusia” (4) karena di dalamnya terdapat kenikmatan yang tidak pernah tergambar di benak manusia. Allah Ta’ala menyebutkan bahwa di surga terpat pohon kurma, buah delima, buah-buahan, daging burung, madu, susu, air dan khamer, tetapi hakikat-hakikat itu semua tidak sama seperti apa-apa yang ada di dunia selamanya, karena kalau saja itu semua serupa dengan apa-apa yang ada di dunia, kita juga mengetahui apa yang tersembunyi bagi kita dari itu, tetapi itu semua jauh lebih besar dan lebih baik dari yang kita bayangkan. Buah delima meski kita tahu makna buah delima dan kita tahu bentuknya, tah rasanya dan memiliki biji-biji tertentu, tetapi tidaklah sama buah delima yang ada di akhirat dengan ini, yang di akhirat jauh lebih agung, baik dari sisi bentuk, warna juga dari sisi rasanya sebagai mana diucapkan oleh Ibnu Abbas radhiyallaahu ‘anhuma: “ Tidak ada sesuatu di dunia ini yang ada di surga nanti melainkan hanya sekedar nama-namanya saja ” adapun hakikat-hakikatnya maka itu tidak diketahui Firman Allah Ta’ala: تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ \"Yang mengalir di bawahnya sungai-sungai” Para ulama mengatakan: Di bawahnya maknanya: di bawah pepohonan dan istana-istananya, jika tidak begitu, sungai-sungai itu terletak di atas teras bagian atas, sungai-sungai tersebut sebagaimana dalam hadits-hadits tidak membutuhkan saluran dan tidak memerlukan adanya parit-parit, dalam menjelaskan sifat sungai-sungai tersebut Imam Ibnul Qayim mengatakan dalam Nuniyahnya: أَنْهَارُهَا فِي غَيْرِ أُخْدُوْدٍ جَرَتْ سُبْحَانَ مُمْسِكِهَا عَنِ الْفَيْضَانِ Sungai-sungainya tanpa parit ia mengalir. Maha suci yang menahannya (yaitu Allah) dari banjir. Sungai-sungai yang kita kenal membutuhkan lubang aliran atau parit yang mencegah melubernya air ke kanan dan kekiri, tetapi disurga nanti tidak lagi membutuhkan parit, ia akan engalir sesuai kehendak manusia: Yakni ia akan mengarahkan alirannya sesuai kehendaknya tanpa galian tanpa membuat parit. Dan sungai sungai dalam ayat ini juga ayat-ayat lainnya banyak, dijelaskan secara global. Tetapi dijelaskan secara rinci pada surat qital (perang) yaitu surat Muhammad, Allah berfirman: مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى “(Apakah) perumpamaan surga yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tidak berubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring ”(QS. Muhammad: 15) ذَلِكَ الْفَوْزُ الْكَبِيرُ \"itulah kemenangan yang besar.” yang dimaksud adalah memperoleh surga dan segala kenikmatannya adalah keberuntungan yang besar. Yakni: dengannya keselamatan dari segala ketakutan dan memperoleh segala yang dicari, karena kemenangan adalah perwujudan dari diperolehnya sesuatu yang dicari dan hilangnya yang dibenci. Surga pun demikian, di dalamnya terdapat sesuatu yang dicari dan telah hilang semua segala yang ditakuti, penduduknya tidak akan menjumpai kematian, tidak akan sakit, tidak gundah dan tidak akan mendapat kesulitan. (1) Dikeluarkan Bukhari (50) dan Muslim (9) dari hadits Umar Radhiyallaahu ‘anhu (2) Dikeluarkan Muslim (2985) dari hadits Umar Radhiyallaahu ‘anhu (3) Dikeluarkan Muslim (1718) dari hadits Aisyah Radhiyallaahu ‘anha (4) Dikeluarkan Bukhari (3244) dan Muslim (2824) dari hadits Abu Hurairah Radhiyallaahu ‘anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 11: Ketahuilah juga bahwa mereka yang menetapkan ke-esaan Allah dalam ibadah dan amalan yang shalih, mereka memiliki kebun-kebun (di surga) yang mengalir di bawah pepohonannya sungai-sungai. Dan inilah kemenangan besar yang didapatkan oleh mereka. Dan dapat disaksikan di belahan dunia semisal Bosnia, Herzegovina dan Andalus, ketika berkuasanya kekufuran, mereka (orang-orang kafir) membunuh beberapa manusia yang tidak berdosa kecuali muslimin (mereka bunuh semua). Kami memohon kepada Allah untuk mengembalikan kemulian dan cahaya bagi islam dan kaum muslimin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan hukuman untuk orang-orang yang zalim, maka Dia menyebutkan pahala orang-orang mukmin. Dengan hati mereka. Dengan anggota badan mereka. Karena mereka memperoleh keridhaan Allah dan surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 11",
    "description": "Sungguh, orang-orang yang beriman dengan kukuh dan membawanya hingga mati, dan mengerjakan kebajikan baik secara ritual maupun sosial, mereka akan mendapat taman-taman surga yang mengalir di bawahnya sungai-sungai yang jernih, indah, dan menyejukkan hati. Itulah kemenangan yang agung; anugerah yang Allah khususkan bagi orang yang taat kepada-Nya. 12. Allah mahaperkasa dan mahakuasa. Dia pasti akan merealisasikan janji dan ancamannya. Sungguh, azab tuhanmu yang diancamkan-Nya kepada para pendurhaka sangat keras dan pedih."
  }
]