[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-16. Sesungguhnya hukuman dan adzab dari Tuhan-Mu dikarenakan permusuhan mereka sangatlah besar dan keras. Sesungguhnya Allah lah yang memulai penciptaan dan mengulanginya. Dia maha pengampun bagi siapa yang bertaubat, sangat cinta dan sayang kepada wali wali NYA, Pemilik arasy, Maha mulia,yang keutamaan dan kemuliaanNYA mencapai puncaknya, Maha melakukan apa yang dia inginkan,tidak ada sesuatupun yang dapat menolak saat Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya siksa Rabbmu -wahai Rasul- atas orang yang zalim -meski kadang ditangguhkan sebentar- sungguh sangat keras."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-16. Hai Rasulullah, Sungguh balasan Tuhanmu kepada para musuh-Nya sangat berat. Allah yang akan memulai siksaan bagi orang-orang kafir di dunia, dan mengulangi siksaan itu di akhirat. Allah Pemilik ‘arsy yang merupakan makhluk paling bersar, Dia selalu melakukan apa yang Dia kehendaki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ (Sesungguhnya azab Tuhanmu benar-benar keras) Yakni azab bagi orang-orang yang angkuh dan zalim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sesungguhnya azab Tuhanmu itu sangat dahsyat dan pedih, maksudnya bahwa Allah akan mengazab orang-orang kafir dengan azab yang berlipat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya azab} siksaan {Tuhanmu sangat keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 12 “Sesungguhnya azab Rabbmu benar-benar keras,” yakni hukumanNya untuk orang-orang berdosa besar amatlah keras. Allah mengintai orang-orang zhalim. Allah berfirman, “Dan begitulah azab Rabbmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zhalim. Sesungguhnya azabNya itu adalah sangat pedih lagi keras.” (Hud: 102)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّ بَطْشَ رَبِّكَ } Sesungguhnya azab tuhanmu { لَشَدِيدٌ } sangatlah pedih, maka jagnlah kamu lalai dari ancaman-Nya, dan Allah telah menyeimbangkan penyebutan ayat-ayat Al-Qur'an tentang ancaman dari azab dan ayat-ayat Al-Qur'an tentang balasan dan ganjaran bagi orang-orang yang beriman kepada-Nya, agar orang-orang beriman menyeimbangkan dirinya pada ketaatan kepada Allah dan takut akan azab yang dijanjikan bagi pelaku kemaksiatan dan kekafiran, jika mereka takut kepada Allah dengan meninggal semua kebathilan, dan mengharap keridhoan dari Allah dengan melakukan segala amalan kebaikan, maka seseorang tidak hanya bersandar pada harapan seperti yang dilakukan oleh kelompok \"murji'ah\", dan tidak pula seorang hamba bersandar hanya pada rasa takut yang ada dalam dirinya sebagaimana yang diyakini oleh kaum \"khawarij\", akan tetapi seorang hamba harus menyeimbangkan antara rasa takut dan harapannya kepada Allah ﷻ . { إِنَّ بَطْشَ رَبِّكَ } kata \" البَطْشُ \" berarti : azab atau siksaan { لَشَدِيدٌ } yang sangat keras atau pedih, tapi kepedihannya tidak tidak diketahui oleh siapun kecuali Allah ﷻ , Allah ﷻ berfirman : { وَكَذَٰلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَىٰ وَهِيَ ظَالِمَةٌ ۚ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ } ( Dan begitulah azab Tuhanmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zalim. Sesungguhnya azab-Nya itu adalah sangat pedih lagi keras. ) [ Hud : 102 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala befirman: إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ “Sesungguhnya azab Rabbmu benar-benar keras. ” Yaitu: Hukuman-Nya, sedangkan keras adalah kuat, sebagaimana Allah TA’ala berfirman: اعْلَمُوا أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ وَأَنَّ اللَّهَ غَفُورٌ رَحِيمٌ “Ketahuilah, bahwa sesungguhnya Allah amat berat siksa-Nya dan bahwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.”(QS. Al-Maidah: 98) ِAzab Allah adalah hukuman dan siksa-Nya keras lagi besar, namun diperuntukkan bagi orang yang behak mendapatkannya, ada pun orang yang tidak berhak mendapatkannya maka sesungguhnya rahmat Allah Ta’ala lebih luas, betapa banyaknya Allah memaafkan dosa-dosa, betapa seringnya Allah menutupi aib-aib, betapa banyaknya Allah menahan balasan (siksa), betapa banyaknya Allah memberikan banyak nikmat, tetapi jika Allah telah mengazab orang yang zalim maka ia tidak akan melepasnya sebagaimana Nabi ‘alaihissholaatu wassalaam: «إِنَّ اللهَ لَيُمْلِي لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يَفْلَتْهُ» ، \"Sesungguhnya Allah benar-benar memenuhi (dosa) bagi penzalim sampai hingga Dia mengazabnya tidak akan melepaskannya\" Kemudian beliau membaca sebuah ayat: {وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهِيَ ظَاِلِمَةٌ إِنَّ أَخْذَهُ أَلِيْمٌ شَدِيْدٌ \"Dan begitulah azab Tuhanmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zalim. Sesungguhnya azab-Nya itu adalah sangat pedih lagi keras. \" (QS. Hud: 102) (1) Atas dasar itu maka kita katakan: بَطْشَ رَبِّكَ“siksa Rabbmu” Maknanya: Bagi orang orang yang berhak mendapatkan siksa. Ada pun orang yang tidak berhak mendapatkan azab-Nya maka Allah akan memperlakukannya dengan rahmat, kedermawanan dan kesantunan. Dan Rahmat Allah mendahului amarah-Nya. (1) Dikeluarkan Bukhari (4686) dan Muslim (2583) dari hadits Abu Musa al-Asy’ariy Radhiyallaahu ‘anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 12: 12-16. Ketahuilah wahai Nabi Allah, bahwasanya Allah memutuskan untuk memusuhi dari orang-orang yang kejam dan kufur, untuk tujuan menampakkan ke Maha Kuatan-Nya dan Ketegasan-Nya. Kemudian ketahuilah wahai Nabi Allah, bahwasanya Allah, Ia hanya sendirian dalam penciptaan dari kondisi sebelumnya yang tidak ada (wujud), kemudian Allah matikan (mereka), lalu kami hidupkan kembali; Dan Ia Allah Maha Pengampun. Mengampuni bagi siapa yang bertaubat dari hamba-Nya dan Ia Maha Pengasih, Yang Lemah Lembut kepada kekasih-Nya yang dicintai-Nya dengan cinta yang sangat. Dia adalah pemilik arsy yang mulia, yang ia (arsy) adalah makhluk yang paling besar. Dan Allah adalah Al Majid (Yang Sempurna), tinggi (di atas seluruh makhluk). Dan Ia berbuat sekendak-Nya. Dan jika Ia menghendaki sesuatu maka jadilah ia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada para pelaku kejahatan dan dosa-dosa besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 12",
    "description": "Allah mahaperkasa dan mahakuasa. Dia pasti akan merealisasikan janji dan ancamannya. Sungguh, azab tuhanmu yang diancamkan-Nya kepada para pendurhaka sangat keras dan pedih. 13. Sungguh, dialah yang mampu memulai penciptaan apa pun, kemudian mematikannya dan dia pula yang menghidupkannya kembali seperti semula dengan sangat mudah."
  }
]