[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-16. Sesungguhnya hukuman dan adzab dari Tuhan-Mu dikarenakan permusuhan mereka sangatlah besar dan keras. Sesungguhnya Allah lah yang memulai penciptaan dan mengulanginya. Dia maha pengampun bagi siapa yang bertaubat, sangat cinta dan sayang kepada wali wali NYA, Pemilik arasy, Maha mulia,yang keutamaan dan kemuliaanNYA mencapai puncaknya, Maha melakukan apa yang dia inginkan,tidak ada sesuatupun yang dapat menolak saat Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Sesungguhnya Dia lah yang memulai penciptaan dan siksaan serta yang mengulanginya kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. إِنَّهُۥ هُوَ يُبْدِئُ وَيُعِيدُ (Sesungguhnya Dialah Yang menciptakan (makhluk) dari permulaan dan menghidupkannya (kembali)) Yakni menciptakan makhluk-Nya di dunia dan membangkitkan mereka setelah kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sesungguhnya, Allah-lah yang menciptakan awal segala sesuatu dan Allah Maha Kuasa untuk menghidupkannya kembali setelah kematian mereka ketika hari kiamat tiba"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Dialah yang memulai (penciptaan) dan yang mengembalikan (hidup)} memulai penciptaan dan mengembalikannya lagi setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 13 “Sesungguhnys Dia-lah yang menciptakan (makhluk) dari permulaan dan menghidupkannya (kembali),” yakni, Dia sendiri yang memulai ciptaan dan mengembalikannya lagi , tidak ada satu pun yang menyertainya dalam hal itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِنَّهُ } Sesungguhnya Dialah Allah, { هُوَ يُبْدِئُ وَيُعِيدُ } Dialah yang memulai penciptaan didunia kemudian Dia pulalah yang akan mengembalikannya pada hari akhir tiba dengan terjadinya hari kebangkitan dan berkumpulnya seluruh manusia dipadang mahsyar, Allah ﷻ berfirman : { وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ الْمَثَلُ الْأَعْلَىٰ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ } ( Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya. Dan bagi-Nya-lah sifat yang Maha Tinggi di langit dan di bumi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana. ) [ Ar Rum : 27 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّهُ هُوَ يُبْدِئُ وَيُعِيدُ “Sesungguhnya Dialah Yang menciptakan (makhluk) dari permulaan dan menghidupkannya (kembali). ” Yakni: Bahwa perintah kembal pada-Nya baik memulainya dan pengembaliannya. Ini selaras dengan firman Allah Ta’ala: وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيْدُهُ “Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali ” Dialah yang memulai segala sesuatu, dan kepada-Nya berakhirnya segala sesuatu, segala sesuatu seluruhnya bermula dari-Nya dan kembali kepada-Nya. Penciptaannya dari Allah dan kembali kepada Allah, segala ketentuan syari’at dari Allah dan kepada Allah, segala perkara dari Allah dan kembali kepada Allah, oelh kerenanya Allah berfirman: يُبْدِئُ \"memulai” di sini Allah tidak menyebutka apa yang Dia mulai, dengan begitu maka maknanya, Allah telah memulai segala sesuatu, dan mengembalikan segala sesuatu, segala perkara di tangan-Nya ‘Azza Wa Jalla. Maka sadarilah wahai hamba dari mana asalmu, anda berasal dari ketiadaan, dan sadarilah tempat berakhir dan tujuanmua, bahwa tujuanmu (berakir) kepada Allah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 13: 12-16. Ketahuilah wahai Nabi Allah, bahwasanya Allah memutuskan untuk memusuhi dari orang-orang yang kejam dan kufur, untuk tujuan menampakkan ke Maha Kuatan-Nya dan Ketegasan-Nya. Kemudian ketahuilah wahai Nabi Allah, bahwasanya Allah, Ia hanya sendirian dalam penciptaan dari kondisi sebelumnya yang tidak ada (wujud), kemudian Allah matikan (mereka), lalu kami hidupkan kembali; Dan Ia Allah Maha Pengampun. Mengampuni bagi siapa yang bertaubat dari hamba-Nya dan Ia Maha Pengasih, Yang Lemah Lembut kepada kekasih-Nya yang dicintai-Nya dengan cinta yang sangat. Dia adalah pemilik arsy yang mulia, yang ia (arsy) adalah makhluk yang paling besar. Dan Allah adalah Al Majid (Yang Sempurna), tinggi (di atas seluruh makhluk). Dan Ia berbuat sekendak-Nya. Dan jika Ia menghendaki sesuatu maka jadilah ia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 13",
    "description": "Sungguh, dialah yang mampu memulai penciptaan apa pun, kemudian mematikannya dan dia pula yang menghidupkannya kembali seperti semula dengan sangat mudah. 14. Azab Allah sangat pedih, tetapi rahmat dan ampunan-Nya juga mahaluas. Dan dialah yang maha pengampun bagi mereka yang bertobat, maha pengasih bagi makhluk-Nya."
  }
]