[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-16. Sesungguhnya hukuman dan adzab dari Tuhan-Mu dikarenakan permusuhan mereka sangatlah besar dan keras. Sesungguhnya Allah lah yang memulai penciptaan dan mengulanginya. Dia maha pengampun bagi siapa yang bertaubat, sangat cinta dan sayang kepada wali wali NYA, Pemilik arasy, Maha mulia,yang keutamaan dan kemuliaanNYA mencapai puncaknya, Maha melakukan apa yang dia inginkan,tidak ada sesuatupun yang dapat menolak saat Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan Dia Maha Pengampun atas dosa-dosa orang yang bertobat dari para hamba-Nya dan Dia mencintai para penolong-Nya dari kalangan orang-orang yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَهُوَ الْغَفُورُ الْوَدُودُ (Dialah Yang Maha Pengampun lagi Maha Pengasih) Yakni Maha Mengampuni dosa-dosa hamba-Nya yang beriman, dan tidak menyingkap aib mereka itu; serta Maha Pengasih kepada kekasih-kekasih-Nya yang taat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Allah Maha Suci yang Ampunan-Nya sangat luas untuk hamba-hamba-Nya yang senantiasa bertaubat, dan Allah mencintai mereka yang senantiasa bertaubat. Allah yang menciptakan ‘Arsy dan penguasa sekaligus pemiliknya. Allah Maha Agung Maha Mulia dalam dzat dan sifat-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Yang Maha Pengampun lagi Maha Pengasih} mengasihi para waliNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 14 “Dia-lah Yang Maha Pengampun,” yang mengampuni seluruh dosa bagi yang bertaubat dan yang memaafkan kesalahan-kesalahan bagi yang memohon ampunan dan kembali, “lagi Maha Pengasih,” yang dicintai oleh para kekasihNya, tidak ada satu pun yang menyamaiNya, sebagaimana tidak ada sesuatu pun yang menyamaiNya dalam sifat-sifat keluhuran, keindahan, makna-makna, dan perbuatan-perbuatan, maka kecintaan terhadapNya di dalam hati hamba-hamba yang istimewa mengikuti kecintaan yang tidak sama dengan kecintaan terhadap apa pun. Karena itu, cinta terhadap Allah merupakan pangkal ibadah. Itulah cinta yang tidak didahului oleh cinta-cinta lain. Bila yang lain tidak mengikuti cinta itu, maka cinta tersebut adalah siksaan bagi pemiliknya. Dia-lah yang Maha Mengasihi yang mencintai para kekasihNya. Sebagaimana disebutkan dalam Firman Allah yang lain, “Allah mencintai mereka dan mereka pun mencintaiNya.” (Al-Ma’idah: 54) Kasih sayang adalah cinta yang tulus Dalam hal ini terdapat rahasia yang lembut, karena Allah menyandingkan kasih sayang dengan ampunan agar hal itu menunjukkan bahwa orang-orang yang berdosa bila bertaubat dan kembali pada Allah, maka dosa-dosa mereka akan diampuni dan disayangi. Tidak dikatakan pada mereka bahwa dosa-dosa mereka diampuni atau kasih sayang kembali lagi pada mereka sebagaimana diucapkan sebagian orang yang keliru. Tapi Allah bergembira dengan taubatnya hamba pada saat bertaubat melebihi gembiranya seseorang terhadap hewan tunggangannya, di mana di atas kendaraan itu terdapat makanan, minuman, dan keperluannya, lalu kendaraan itu hilang di tengah padang pasir, hingga dia berputus asa darinya kemudian dia berbaring di bawah naungan pohon seraya menanti kematian, ketika dia berada pada kondisi seperti itu, tiba-tiba hewan tunggangannya tersebut berada di dekat kepalanya lalu dia memegang talinya. Allah lebih senang atas taubatnya hamba melebihi gembiranya orang tersebut pada kendaraannya. Ini adalah kegembiraan terbesar yang dapat dirasakan (manusia). Maka segala puja, puji, dan tulusnya cinta hanya untuk Allah semata, yang kebaikanNya amat besar dan melimpah, serta pemberianNya yang luas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "وَهُوَ الْغَفُورُ الْوَدُودُ \"Dialah Yang Maha Pengampun lagi Maha Pengasih, ” Al-Ghafiur maknanya adalah yang Maha memiliki ampunan, sedangkan al-Maghfirah (ampunan) adalah menutup dan memaafkan dosa. Ampunan di sini bukan sekedar menutupi dosa saja, tetapi menutupi dosa juga tidak membalas atas dosa sebagai mana datang dalam sebuah hadits yang shahih : إِنَّ اللهَ يَخْلُوُ بِعَبْدِهِ الْمُؤْمِنِ يَوْمَ الْقِيَامَةِ وَيُقّرِّرُهُ بِذُنُوْبِهِ حَتَّى يُقَرِّبُهَا وَيَعْتَرِفُ فَيَقُوْلُ اللهَ عَزَّ وَجّلَّ: قَدْ سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ “ Sesungguhnya Allah akan berdua-duaan dengan hamba-Nya yang beriman di hari kiamat dan mengikrarkan (mengingatkan) akan dosa-dosanya sehiingga ia didekatkan dengan dosa-dosanya itu dan mengakuinya, maka Allah ‘Azza Wa Jalla berfirman: Aku telah menutupinya di dunia dan aku telah mengampuninya untukmu pada hari ini ”(1) Diceritakan bahwa Bani Israil dahulu apa bila salah seorang dari mereka melakukan suatu dosa ia akan mendapatinya tertulis di puntu rumahnya sebagai celaan dan hinaan. Tetapi kita segala puji bagi Allah, Allah telah menutupinya untuk kita, maka hendaknya kita bertaubat dan memohon ampunan kepada Allah dari dosa, sehingga dampak-dampaknya menghilang, oleh karenanya Allah berfirman: وَهُوَ الْغَفُورُ \"Dialah Maha Pengampun” maknanya: Yang menutupi dan mengampuni dosa-dosa hamba-hamba-Nya. الْوَدُودُ “Maha Penyayang” Diambil dari kata اَلْوُدّ [al-Wudd] yang bermakna tulusnya kecintaan, Maka Allah ‘Azza Wa Jalla itu al-Wadud, sedangkan makna al-Wadud: Yang dicintai dan yang mencintai, kata ini mencakup dua makna tersebut. Allah Tabaaraka Wa Ta’ala berfirman: يَا أَيُّهَا الَّذِينَ آمَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَأْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُ “Hai orang-orang yang beriman, barangsiapa di antara kamu yang murtad dari agamanya, maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintai-Nya ” (QS. Al-Maidah: 54) Allah Jalla Wa ‘Alaa adalah yang mencintai, mencintai amalan-amalan, mencintai orang-orang (tertentu) mencintai tempat-tempat, Dia pun dicintai wali-wali-Nya: قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ “Katakanlah: \"Jika kalian (benar-benar) mencintai Allah, ikutilah aku, niscaya Allah mencitai kalian”(QS. Ali Imran: 31) Semakin seorang insan itu lebih mengikuti Rasulullah shallallaahu ‘alaihi wa sallam maka ia akan lebih dicintai Allah. Allah Jalla Wa ‘Alaa yang mencintai Dia juga dicintai, Dia mencintai amal-amal dan orang-orang yang beramal, mencintai orang-orang, maksudnya bahwa kecintaan terkadang terkait dengan orang tertentu, contohnya seperti dalam sabda Rasulullah ‘alaihishsholaatu wassalaam saat perang khaibar: ََلأُعْطِيَنَّ الرَّايَةَ غَداً رَجُلاً يُحِبُّ اللهَ وَرَسُوْلَهُ، وَيُحِبُّهُ اللهُ وَرَسُولُهُ “Aku benar-benar akan menyerahkan panji ini esok hari kepada seseorang yang mencintai Allah dan Rasul-Nya, Allah dan Rasul-Nya pun mencintainya ” Maka orang-orang bermalam kemudian di pagi harinya mereka pergi kepada Rasulullah shallallahu ‘alaihi wa sallam, mereka semua berharap menjadi orang yang diserahkan panji tersebut. Lalu Rasulullah bertanya: أَيْنَ عَلِيُّ بْنُ أَبِيْ طَالِبٍ“Dimana Ali Bin Abi Thalib? Orang-orang menjawab: Kedua matanya sakit, maka beliau menyurh untuk memanggilkannya. Ali datang lalu Rasululllah shallallaahu ‘alaihi wa sallam meludahi kedua matanya, maka ia sembuh seketika seakan-akan dia tidak sakit, kemudian Rasulullah shallallaahu ‘alaihi wa sallam menyerahkan panji itu kepadanya, lalu berkata: اُنْفُذْ عَلَى رِسْلِكَ حَتَّى تَنْزِلَ بِسَاحَتِهِمْ ثُمَّ ادْعُهُمْ إِلَى الْإِسْلَامِ “Berjalanlah dengan tenang hingga engkau tiba di halaman mereka kemudian serulah mereka kepada islam”(2) Penggalan yang menjadi dalil adalah sabdanya: يُحِبُّ اللهَ وَرَسُوْلَهُ، وَيُحِبُّهُ اللهُ وَرَسُولُهُ “yang mencintai Allah dan Rasul-Nya, Allah dan Rasul-Nya pun mencintainya ” Dalah hadits ini ada penetapan bahwa Allah mencintai seorang person tertentu yaitu Ali Bin Abi Thalib. Suatu ketika Nabi shallallaahu ‘alaihi wa sallam mengutus seseorang memimpin kelompok kecil pasukan, saat menjadi imam, orang ini senantiasa menutup bacaannya dengan Qul Huwallaahu ahad ketika pulang, mereka menceritakan hal itu kepada Nabi shallallaahu ‘alaihi wa sallam, kerena perbuatannya itu -menutup bacaan dengan surat al-ikhlas- tidak diketahui. Maka Rasulullaah shallallaahu ‘alaihi wa sallam bersabda: سَلُوْهُ لِأَيِّ شَيْءٍ كَانَ يَصْنَعُ ذَلِكَ “Tanya dia, untuk apa ia melakukannya? Lalu mereka menanyakannya. Ia menjawab: Karena surat itu terdapat penyebutan sifat Allah dan aku cinta membacanya. Maka Nabi shallallaahu ‘alaihi wa sallam bersabda: أَخْبِرُوْهُ أَنَّ اللهَ يُحِبُّهُ “Beritahulah dia bahwa Allah mencintainya” (3) Kecintaan di dalam hadits ini terkait dengan seorang person tertentu yang Allah cintai. Terkadang juga kecintaan Allah terdapat pada orang-orang tertentu yang memiliki sifat-sifat (tertentu) seperti إِنَّ اللهَ يُحِبُّ الْمُتَّقِيْنَ “Sesungguhnya Allah menyukai orang-orang yang bertakwa ” (QS. At-Taubah: 4) إِنَّ اللهَ يُحِبُّ الْمُحْسِنِيْنَ “sesungguhnya Allah menyukai orang-orang yang berbuat baik. ”(QS. Al-Baqarah: 195) إِنَّ اللهَ يُحِبُّ الَّذِيْنَ يُقَاتِلُوْنَ فِي سَبِيْلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوْصٌ “Sesungguhnya Allah menyukai orang yang berperang dijalan-Nya dalam barisan yang teratur seakan-akan mereka seperti suatu bangunan yang tersusun kokoh. ”(QS. As-Shaf: 4) Kecintaan ini bukan kepada seorang person tertentu tetapi kecintaan disini tertuju pada seorang yang memeliki kriteria sifat. Allah Subhaanahu Wa Ta’ala juga mencintai tempat-tempat: أَحَبُّ الْبُقَاعِ إِلَى اللهِ مَسَاجِدُهَا “Tempat yang palimg Allah cintai adalah masjid-masjidnya” (4) Nabi ‘alaihissholaatu wassalaam juga menberitakan bahwa kota mekah adalah tempat yang paling Allah cintai (5) kecintaan di sini terkait dengan tempat-tempat, dengan demikian bahwa Allah mencintai dan dicintai oleh karenanya Allah berfirman: وَهُوَ الْغَفُورُ الْوَدُودُ \"Dialah Yang Maha Pengampun lagi Maha Pengasih, ” (1) Dikeluarkan Bukhari (2441) dan Muslim (2768) dari hadits Abdullah Bin Umar Radhiyallaahu ‘anhuma (2) Dikeluarkan Bukhari (4210) dan Muslim (2406) dari hadits Sahl Bin Sa’ad Radhiyallaahu ‘anhu (3) Dikeluarkan Bukhari (7375) dan Muslim (813) dari hadits Aisyah Radhiyallaahu ‘anha (4) Dikeluarkan Muslim (672) dari hadits Abu Hurairah Radhiyallaahu ‘anhu (5) Dikeluarkan Tirmidzi (3925) dan Ibnu Majah (3108) dari hadits Adi Bin Hamraa radhiyallaahu ‘anhu, dan dinyatakan shahih oleh al-Albani dalam shahihul-Jami’ (7089)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَهُوَ الْغَفُورُ } Dia Maha pengampun bagi siapa yang bertaubat dan memohon ampun kepada-Nya, { الْوَدُودُ } Dan dengan ampunan-Nya Dia juga sangat mencintai hamba yang bertaubat, Sesungguhnya Allah sangat gembira dengan taubat hamba-Nya ketika ia bertaubat pada-Nya melebihi kegembiraan seseorang di antara kalian yang berada di atas kendaraannya dan berada di suatu tanah yang luas (padang pasir), kemudian hewan yang ditungganginya lari meninggalkannya. Padahal di hewan tunggangannya itu ada perbekalan makan dan minumnya. Sehingga ia pun menjadi putus asa. Kemudian ia mendatangi sebuah pohon dan tidur berbaring di bawah naungannya dalam keadaan hati yang telah berputus asa. Tiba-tiba ketika ia dalam keadaan seperti itu, kendaraannya tampak berdiri di sisinya, lalu ia mengambil ikatnya. Karena sangat gembiranya, maka ia berkata, ‘Ya Allah, Engkau adalah hambaku dan aku adalah Rabb-Mu.’ Ia telah salah mengucapkan karena sangat gembiranya. Dan diantara manusia jika kamu berbuat salah kepadanya kemudian dia memaafkan kesalahan itu belum tentu dia akan menyukaimu kembali, maka kamu akan merasakan keganjalan dihati walaupun kesalahan itu telah dimaafkan, sedangkan Allah ﷻ maha pengampun dosa seorang hamba dan mencintai hamba itu pula."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 14: 12-16. Ketahuilah wahai Nabi Allah, bahwasanya Allah memutuskan untuk memusuhi dari orang-orang yang kejam dan kufur, untuk tujuan menampakkan ke Maha Kuatan-Nya dan Ketegasan-Nya. Kemudian ketahuilah wahai Nabi Allah, bahwasanya Allah, Ia hanya sendirian dalam penciptaan dari kondisi sebelumnya yang tidak ada (wujud), kemudian Allah matikan (mereka), lalu kami hidupkan kembali; Dan Ia Allah Maha Pengampun. Mengampuni bagi siapa yang bertaubat dari hamba-Nya dan Ia Maha Pengasih, Yang Lemah Lembut kepada kekasih-Nya yang dicintai-Nya dengan cinta yang sangat. Dia adalah pemilik arsy yang mulia, yang ia (arsy) adalah makhluk yang paling besar. Dan Allah adalah Al Majid (Yang Sempurna), tinggi (di atas seluruh makhluk). Dan Ia berbuat sekendak-Nya. Dan jika Ia menghendaki sesuatu maka jadilah ia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengampuni semua dosa bagi orang yang bertobat kepada-Nya serta memaafkan kesalahan bagi orang yang meminta ampunan kepada-Nya dan kembali. Ibnu Abbas berkata, “Dia Al Habiib (yang dicintai).” Ada yang berpendapat, bahwa Al Waduud adalah, Yang cinta kepada orang yang bertobat dan kembali kepada-Nya. Syaikh As Sa’diy berkata, “Dia dicintai oleh para pecintanya dengan kecintaan yang tidak diserupai oleh sesuatu pun. Sebagaimana tidak ada sesuatu yang menyerupai-Nya dalam sifat-sifat keagungan dan keindahan, makna dan perbuatan, maka kecintaan-Nya di hati makhluk pilihan-Nya mengikuti hal itu, tidak diserupai oleh sesuatu pun di antara macam-macam kecintaan. Oleh karena itu, kecintaan kepada-Nya merupakan pokok ibadah, ia adalah kecintaan yang mendahului semua kecintaan dan mengalahkannya, jika yang lain tidak mengikutinya (kecintaan-Nya), maka yang demikian menjadi azab bagi pemiliknya. Dia adalah Al Waduud; yang cinta kepada para kekasih-Nya sebagaimana firman-Nya Ta’ala, “Allah mencintai mereka dan mereka pun mencintai-Nya.” (Terj. Al Maa’idah: 54) Dan mahabbah adalah kecintaan yang murni. Dalam ayat ini terdapat rahasia yang halus karena disertakan Al Waduud dengan Al Ghafuur untuk menunjukkan bahwa orang-orang yang berdosa ketika mereka bertobat kepada Allah dan kembali, maka Dia akan mengampuni dosa mereka dan akan mencintai mereka. Tidaklah dikatakan, bahkan hanya diampuni dosa mereka dan tidak dikembalikan kecintaan (Allah kepada mereka) seperti yang dikatakan sebagian orang yang keliru. Bahkan Allah lebih berbahagia dengan tobat hamba-Nya ketika bertobat daripada seorang yang berkendaraan unta dengan makanan, minuman dan segala yang dibutuhkan di atasnya, lalu hewan itu hilang di tengah padang sahara yang dapat membuatnya binasa, ia pun berputus asa darinya dan tidur dalam naungan sebuah pohon sambil menunggu kematiannya, tetapi ketika ia dalam keadaan seperti itu, tiba-tiba hewannya berada di dekat kepalanya, ia pun segera memegang talinya. Maka Allah Subhaanahu wa Ta'aala lebih gembira dengan tobat seorang hamba daripada orang itu ketika menemukan kembali hewan kendaraannya, padahal itu adalah kegembiraan yang paling besar yang bisa dilakukannya. Maka segala pujian, sanjungan dan kecintaan yang tulus bagi Allah, alangkah besar dan banyak kebaikan-Nya dan alangkah banyak ihsan serta alangkah luas pemberian-Nya!”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 14",
    "description": "Azab Allah sangat pedih, tetapi rahmat dan ampunan-Nya juga mahaluas. Dan dialah yang maha pengampun bagi mereka yang bertobat, maha pengasih bagi makhluk-Nya. 15. Dialah yang memiliki 'arsy, singgasana yang agung dan kerajaan yang mahabesar, lagi mahamulia di atas semua makhluk-Nya."
  }
]