[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-16. Sesungguhnya hukuman dan adzab dari Tuhan-Mu dikarenakan permusuhan mereka sangatlah besar dan keras. Sesungguhnya Allah lah yang memulai penciptaan dan mengulanginya. Dia maha pengampun bagi siapa yang bertaubat, sangat cinta dan sayang kepada wali wali NYA, Pemilik arasy, Maha mulia,yang keutamaan dan kemuliaanNYA mencapai puncaknya, Maha melakukan apa yang dia inginkan,tidak ada sesuatupun yang dapat menolak saat Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Pemilik Arasy yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. ذُو الْعَرْشِ (yang mempunyai ‘Arsy) Yakni Allah adalah pemilik ‘arsy yang besar. Sedangkan makna (المجيد) yakni Maha Pemurah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Allah Maha Suci yang Ampunan-Nya sangat luas untuk hamba-hamba-Nya yang senantiasa bertaubat, dan Allah mencintai mereka yang senantiasa bertaubat. Allah yang menciptakan ‘Arsy dan penguasa sekaligus pemiliknya. Allah Maha Agung Maha Mulia dalam dzat dan sifat-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pemilik ʻArsy lagi Maha mulia} Maha Agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 15 “Yang memiliki Arasy, lagi Mahamulia,” yakni mempunyai Arasy yang agung yang diantara keagunganNya, Arasy meliputi langit, bumi dan al-Kursi, yang semuanya bila dibandingkan dengan Arasy adalah bagaikan selingkar gelang yang ditaruh pada tanah luas yang lapang. Allah menyebut Arasy secara khusus karena keagungannya, karena Arasy adalah makhluk istimewa yang berada dekat denganNya. Dan menurut bacaan kasrah, kata “lagi mulia,” adalah berarti sifat bagi Arasy sedangkan berdasarkan bacaan dhammah, kata-kata tersebut adala sifat Allah. Mulia adalah luas dan agungnya sifat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ ذُو الْعَرْشِ } Dialah Allah ﷻ pemilik 'Arsy, apakah itu 'Arsy ? 'Arsy pada makna asalnya adalah singgasana yang diduduki oleh para raja-raja diistananya, seperti yang Allah katakan dalam Al-Qur'an tentang kerajaan ratu balqis : { وَلَهَا عَرْشٌ عَظِيمٌ } ( serta mempunyai singgasana yang besar ) [ An Naml : 23 ] , di ayat lain dikatakan : { وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ } ( Dan ia menaikkan kedua ibu-bapanya ke atas singgasana ) [ Yusuf : 100 ] . Dan Allah ﷻ memiliki singgasana-Nya sendiri diatas semua makhluk-Nya, dan singgasana itu adalah makhluk-Nya yang paling besar, diatas singgasana itulah Allah ﷻ berdiam diri mengatur kehidupan alam semesta, dan sifat-sifat berdiam dirinya Allah ﷻ diatas singgasana-Nya adalah sesuai dengan keagungan-Nya, dan singgasana itu seluas langit dan bumi. { الْمَجِيدُ } Sifat yang menjelaskan bahwa singgasana itu sangatlah Mulia, juga sifat yang menjelaskan bahwa singgasana itu benar-benar sangat Agung. Dalam riwayat lain dikatakan bahwasanya kata { الْمَجِيدُ } adalah sifat dan salah satu dari nama-nama Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah menjelaskan keagungan-Nya dan kesempurnaan kuasa-Nya dalam firman-Nya: ذُوْ الْعَرْشِ Maknanya: Yang mempunyai arsy. Sedangkan Arsy adalah sesuatu yang Allah ‘Azza Wa Jalla tinggi beristiwa di atasnya. Ia adalah makhluk teragung, terbesar dan terluas. Terdapat sebuah atsar yang menjelaskan bahwa tujuh langit dan tujuh bumi jika dibandingkan kursi (Allah) bagai cincin yang dilemparkan ke padang pasir dan besarnya arsy jika dibandingkan dengan kursi maka seperti besar padang pasir jika dibandingkan dengan cincin (1). Sedangkan cincin adalah logam kecil yang di lemparkan ke tengah padang pasir, besar cincin tidak ada apa-apanya dibanding luasnya padang pasir, dan besarnya arsy dibandingkan kursi seperti perbandingan luasnya padang pasir dengan cincin logamitu, dengan begitu luas arsy tidak ada seorang pun yang menjangkaunya. Saat ini kita menyaksikan pada makhluk-makhluk terdapat perbedaan yang jauh pada bentung-bentuknya. Ada seseorang yang pernah memperlihatkan kepadaku gambaran bentuk matari dan bumi, maka aku dapati bahwa bumi ini jika dibandingkan dengan matahari seperti sebuah titik di atas piring luas dan besar, dan besarnya sama sekali tidak sebanding dengan matahari, jika demikian jauh perbandingannya pada hal-hal yang bisa disaksikan melalui teleskop dan alat lainnya maka bagaimana dengan hal-hal lainnya yang tidak bisa kita jangkau?! Karena hal-hal yang tidak terjangkau oleh kita lebih besar daripada apa-apa yang dapat kita saksikan. Allah Taala berfirman: وَمَا أُوْتِيْتُمْ مِنَ الْعِلْمِ إِلَّا قَلِيْلاً “dan tidaklah kamu diberi pengetahuan melainkan sedikit ”(QS. Al-Isra: 85) Kesimpulannya: Bahwa arsy adalah atap seluruh makhluk, Arsy yang agung yang Ar-Raahmaan (Allah) Jalla Wa ‘Ala tinggi beristiwa di atasnya sebagaimana Allah Ta’ala berfirman: “(Allah) Yang Maha Pemurah Yang bersemayam di atas 'Arsy. ”(QS. Thaha: 5) Firman-Nya : الْمَجِيدُ [Al-Majiidu]”Mulia” terdapat dua cara membaca yaitu dibaca al-Majiidu dan al-Majiidi, jika dibaca dengan cara yang pertama maka kata ini menjadi sifat bagi arsy sendangkan jika dibaca dengan cara yang kedua maka kata ini menjadi sifat bagi Rabb Azza Wa Jalla, kedua bacaan ini benar, Arsy memiliki sifat majid (Mulia) Allah pun memiliki sifat mulia, kita juga saat tasyahhud (dalam shalat) mengucapkan : Innaka Hamiidun majiid (Sesungguhnya Engkau Maha Terpuji Lagi Maha Mulia) (1) Dikeluarkan oleh Ibnu Hibban dalam shahihnya (361) dan Abu Nu’aim dalam al-Hilyah (1/166-167) dari hadits Abu Dzar al-Ghifari radhiyallaahu ‘anhu dinyatakan shahih oleh Al-Albaniy dalam mukhtasharul ‘uluw (hlm: 75)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 15: 12-16. Ketahuilah wahai Nabi Allah, bahwasanya Allah memutuskan untuk memusuhi dari orang-orang yang kejam dan kufur, untuk tujuan menampakkan ke Maha Kuatan-Nya dan Ketegasan-Nya. Kemudian ketahuilah wahai Nabi Allah, bahwasanya Allah, Ia hanya sendirian dalam penciptaan dari kondisi sebelumnya yang tidak ada (wujud), kemudian Allah matikan (mereka), lalu kami hidupkan kembali; Dan Ia Allah Maha Pengampun. Mengampuni bagi siapa yang bertaubat dari hamba-Nya dan Ia Maha Pengasih, Yang Lemah Lembut kepada kekasih-Nya yang dicintai-Nya dengan cinta yang sangat. Dia adalah pemilik arsy yang mulia, yang ia (arsy) adalah makhluk yang paling besar. Dan Allah adalah Al Majid (Yang Sempurna), tinggi (di atas seluruh makhluk). Dan Ia berbuat sekendak-Nya. Dan jika Ia menghendaki sesuatu maka jadilah ia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Pemilik ‘Arsy yang besar yang di antara kebesarannya adalah adalah bahwa ‘Arsy itu meliputi langit, bumi dan kursi. Kursi dibanding ‘Arsy tidak lain seperti gelang besi yang diletakkan di padang pasir yang luas di bumi sebagaimana sabda Rasulullah shallallahu 'alaihi wa sallam yang diriwayatkan oleh Ibnu Abi Syaibah dalam kitab ‘Al ‘Arsy. Allah Subhaanahu wa Ta'aala menyebutkan ‘Arsy secara khusus karena besarnya dan karena ia merupakan makhluk paling khusus yang dekat dengan-Nya. Hal ini jika kata majiid huruf terakhirnya dibaca kasrah sehingga menjadi sifat bagi ‘Arsy itu, tetapi jika dibaca dhammah, maka majiid adalah sifat bagi Allah Subhaanahu wa Ta'aala. Arti majiid adalah luasnya sifat dan agungnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 15",
    "description": "Dialah yang memiliki 'arsy, singgasana yang agung dan kerajaan yang mahabesar, lagi mahamulia di atas semua makhluk-Nya. 16. Dia mahakuasa berbuat apa yang dia kehendaki. Jika dia berkehendak mengazab orang kafir atau menganugerahkan nikmat kepada orang beriman, tidak ada yang mampu menahan kehendak-Nya tersebut."
  }
]