[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-16. Sesungguhnya hukuman dan adzab dari Tuhan-Mu dikarenakan permusuhan mereka sangatlah besar dan keras. Sesungguhnya Allah lah yang memulai penciptaan dan mengulanginya. Dia maha pengampun bagi siapa yang bertaubat, sangat cinta dan sayang kepada wali wali NYA, Pemilik arasy, Maha mulia,yang keutamaan dan kemuliaanNYA mencapai puncaknya, Maha melakukan apa yang dia inginkan,tidak ada sesuatupun yang dapat menolak saat Allah menghendakinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Mahakuasa untuk berbuat apa yang diinginkan-Nya berupa memaafkan dosa-dosa orang yang dikehendaki-Nya dan menyiksa orang yang dikehendaki-Nya, tidak ada yang memaksa-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Allah Maha Kuasa melakukan sesuatu apapun yang Dia kehendaki, Maha memutuskan/menetapkan, dan Maha Memberi Balasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha kuasa berbuat apa saja yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 16 “Mahakuasa berbuat apa yang dikehendakiNya,” yakni bila menghendaki sesuatu, Dia melakukannya dan bila menghendaki sesuatu, Allah berfirman padanya, “Jadilah,” maka jadilah sesuatu itu. Tidak ada sesuatu pun yang Mahakuasa berbuat apa yang dikehendakinya selain Allah, karena seluruh makhluk bila menginginkan sesuatu, pasti keinginannya itu dibantu atau bisa terhalang, sedangkan Allah tidak memiliki pembantu untuk kehendakNya dan tidak ada yang dapat menghalangi keinginanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ فَعَّالٌ } Dia Maha kuasa untuk melakukan { لِمَا يُرِيدُ } apapun yang Dia inginkan, dan tidak satupun yang mampu melemahkan dan menggagalkan rencana-Nya, Allah ﷻ berfirman : { إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ } ( Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya: “Jadilah!” maka terjadilah ia. ) [ Yaa Siin : 82 ], apapun yang Allah ﷻ ingin lakukan Dia mampu dan kuasa atas hal itu, berbeda dengan makhluk, mereka banyak membayangkan keinginannya, akan tetapi tidak semua keinginan itu mampu mereka wujudkan. Dan Allah ﷻ jika menginginkan sesuatu Dia mampu melakukan dan semuanya, itulah perbedaan antara hamba dan Tuhannya, karena sesungguhnya manusia itu pada hakikatnya lemah dan tidak memiliki kekuatan kecuali Allah ﷻ yang memberikan kekuatan baginya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَعَّالٌ لِمَا يُرِيدُ \"Maha Kuasa berbuat apa yang dikehendaki-Nya ” Ini adalah pensifatan bagi Allah Ta’ala bahwa Dia Maka Kuasa berbuat apa pun yang dikehendaki-Nya, Maka segala sesuatu yang Allah kehendaki maka Dia akan melakukannya dan tidak akan ada yang bisa menghalangi-Nya. Karena kepunyaan-Nyalah kerajaan langit dan bumi, dan tidak ada seorang pun yang menghalangi perbuatan-Nya yang Dia kehendaki di kerajaan-Nya. Ini seperti firman Allah ta’ala: وَيُضِلُّ اللَّهُ الظَّالِمِينَ وَيَفْعَلُ اللَّهُ مَا يَشَاء “dan Allah menyesatkan orang-orang yang zalim dan memperbuat apa yang Dia kehendaki. ” (QS. Ibrahim: 27) Semua manusia, bagaimana pun mereka berencana mereka tidak akan kuasa melakukan sesuai dengan kehendak mereka, bahkan terkadang mereka menginginkan sesuatu dengan keinginan yang kuat, tetapi jika Allah tidak ingin mewujud terjadi pada mereka maka Allah akan memalingkan dan menghalangi mereka dari itu. Antara mereka dan rencana mereka akan ada penghalang. Sedangkan Rabb Tabaaraka Wa Ta’ala dia Maha Kuasa berbuat sesuai kehendak-Nya, jika menginginkan sesuatu maka Dia akan mengatkan kun fayakuun jadilah maka akan jadi seketika. Dalam Ayat yang mulia ini terdapat penetapan adanya kehendak Allah dengan kehendak yang sempurna pada makhluk-Nya, dan pada apa-apa yang berkaitan dengan perbuatan-perbuatan makhluk, maka perbuatan manusia itu tidak akan terwujud kecuali atas kehendak Allah, sebagaimana Allah subhaanahu wa Ta’ala berfirman: لِمَنْ شَاءَ مِنْكُمْ أَنْ يَسْتَقِيمَ*وَمَا تَشَاءُونَ إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ \"Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Tuhan semesta alam.”(QS. At-Takwiir: 29) Pada ayat ini Allah Subhaanahu menjelaskan bahwa kehendak hamba-hamba terikat dengan kehendak-Nya subhaanahu sebagaimana Allah Ta’ala berfirman: وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِنْ بَعْدِهِمْ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَكِنِ اخْتَلَفُوا فَمِنْهُمْ مَنْ آمَنَ وَمِنْهُمْ مَنْ كَفَرَ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلُوا وَلَكِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ “Dan kalau Allah menghendaki, niscaya tidaklah berbunuh-bunuhan orang-orang (yang datang) sesudah rasul-rasul itu, sesudah datang kepada mereka beberapa macam keterangan, akan tetapi mereka berselisih, maka ada di antara mereka yang beriman dan ada (pula) di antara mereka yang kafir. Seandainya Allah menghendaki, tidaklah mereka berbunuh-bunuhan. Akan tetapi Allah berbuat apa yang dikehendaki-Nya. ”(QS. Al-Baqarah: 253) Kehendak Allah mencakup apa-apa yang menjadi perbuatan-Nya, dan apa-apa yang menjadi perbuatan hamba-hamba-Nya, saya beri contoh untukmu tentang ini: Anda saya berbicara dengan pembicaraan saya ini, atau pembicaraan lainnya atau juga dengan pembicaraan sebelumnya, maka semua ucapan saya itu dapat terucap dengan kehendak Allah, sendainya Allah berkehendak untuk saya tidak berbicara maka saya tidak akan kuasa untuk berbicara, dan jika Allah menghendaki saya berbicara, saya bisa berbicara, hati saya pun terdorong untuk berbicara, oleh karenanya Allah Subhaanahu wa Ta’ala berfirman: فَعَّالٌ لِمَا يُرِيدُ \"Maha Kuasa berbuat apa yang dikehendaki-Nya ”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 16: 12-16. Ketahuilah wahai Nabi Allah, bahwasanya Allah memutuskan untuk memusuhi dari orang-orang yang kejam dan kufur, untuk tujuan menampakkan ke Maha Kuatan-Nya dan Ketegasan-Nya. Kemudian ketahuilah wahai Nabi Allah, bahwasanya Allah, Ia hanya sendirian dalam penciptaan dari kondisi sebelumnya yang tidak ada (wujud), kemudian Allah matikan (mereka), lalu kami hidupkan kembali; Dan Ia Allah Maha Pengampun. Mengampuni bagi siapa yang bertaubat dari hamba-Nya dan Ia Maha Pengasih, Yang Lemah Lembut kepada kekasih-Nya yang dicintai-Nya dengan cinta yang sangat. Dia adalah pemilik arsy yang mulia, yang ia (arsy) adalah makhluk yang paling besar. Dan Allah adalah Al Majid (Yang Sempurna), tinggi (di atas seluruh makhluk). Dan Ia berbuat sekendak-Nya. Dan jika Ia menghendaki sesuatu maka jadilah ia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apabila Dia menghendaki sesuatu, maka Dia berkuasa melakukannya. Jika Dia menginginkan sesuatu, maka Dia hanya berfirman, “Terjadilah.” Maka terjadilah hal itu. Adapun makhluk, jika mereka menghendaki sesuatu, maka terhadap kehendaknya itu butuh pembantunya dan ada penghalangnya, sedangkan Allah Subhaanahu wa Ta'aala tidak ada yang membantu untuk melaksanakan kehendak-Nya dan tidak ada yang menghalangi kehendak-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 16",
    "description": "Dia mahakuasa berbuat apa yang dia kehendaki. Jika dia berkehendak mengazab orang kafir atau menganugerahkan nikmat kepada orang beriman, tidak ada yang mampu menahan kehendak-Nya tersebut. 17. Allah menceritakan kisah fir'aun dan kaum Samud untuk menenteramkan hati nabi yang mengalami tekanan hebat dari kaum kafir mekah. Wahai nabi Muhammad, sudahkah sampai kepadamu berita tentang bala tentara penentang, ."
  }
]