[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-22. Apakah kamu sudah mendengar (wahai rasul), kabar orang orang kafir yang mendustakan nabi nabi mereka? Yaitu Fir’aun dan Tsamud dan azab serta hukuman yang menimpa mereka,tetapi mereka tidak mengambil pelajaran darinya, Sebaliknya orang orang kafir itu selalu dalam pendustaan secara berkesinambungan, seperti itulah orang-orang sebelum mereka. Allah meliputi mereka secara pengetahuan dan kekuasaan, tidak ada yang samar bagiNYA dari amal perbuatan mereka sedikitpun. Dan al-Qur’an bukan sebagaimana yang diklaim oleh orang-orang musyrik bahwa ia adalah syair dan sihir, lalu mereka mendustakannya, sebaliknya ia adalah al-qur’an yang agung lagi mulia, Di lauhil mahfuzh, tidak tersentuh perubahan dan penyelewengan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Apakah telah datangkah kepadamu -wahai Rasul- berita tentang bala tentara yang berkumpul untuk memerangi dan mencegah kebenaran?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-22. Hai Rasulullah, apakah telah sampai kepadamu kabar tentang sekumpulan orang yang berjumlah sangat banyak yang bersiap untuk memerangi para rasul dan dakwah mereka; yaitu Fir’aun dan kaumnya yang mendustakan Nabi Musa, dan kabilah Tsamud yang mendustakan Nabi Shalih? Kabar itu telah sampai kepadamu, akan tetapi orang-orang yang mengingkari risalahmu itu lebih mendustakanmu daripada pendustaan umat sebelum mereka terhadap rasul mereka. Allah Maha Melihat mereka dan tipu daya mereka, mereka tidak akan dapat berlari dari azab-Nya. Al-Qur’an bukanlah syair atau sihir sebagaimana kedustaan kalian; namun ia merupakan kitab yang mulia, terjaga dari segala kekurangan, dan tercantum dalam lauhul mahfuzh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. هَلْ أَتَىٰكَ حَدِيثُ الْجُنُودِ (Sudahkah datang kepadamu berita kaum-kaum penentang) Yakni hai Muhammad, telah datang kepadamu kisah orang-orang yang kafir dan yang mendustakan para nabi mereka serta yang mengerahkan pasukan untuk membunuh para nabi itu. Dan yang dimaksud dengan berita mereka adalah kisah tentang siksaan Allah bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Wahai Rasul, apakah kalian sudah mengetahui kabar tentang kaum yang memerangi dan membunuh nabinya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah sudah sampai kepada kalian berita tentang bala tentara} kabar tentang kumpulan orang-orang kafir yang berkumpul menentang para nabi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-18 Kemudian Allah menyebutkan sebagian perbuatanNya yang menunjukkan kebenaran risalah yang dibawa oleh para rasulNya seraya berfirman, “Sudahkah datang kepadamu berita kaum-kaum penentang, (yaitu kaum) Fir’aun dan (kaum) Tsamud,” dan bagaimana mereka mendustakan para rasul? Allah menjadikan mereka dalam golongan orang-orang yang dibinasakan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ berkata kepada Nabi-Nya ﷺ dan kepada orang-orang beriman sebagai penghibur bagi mereka atas keburukan yang dilakukan oleh kafir quraisy kepada mereka : { هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ } Sungguh telah datang kepadamu kabar tentang bala tentara yang besar didalam Al-Qur'an, dan siapakah mereka itu ? dia adalah Fir'aun kepalanya para pembangkang dan pedusta agama Allah yang menyatakan ketuhanan atas dirinya, lalu apa yang Allah ﷻ telah perbuat atasnya ? Allah ﷻ meneggelamkannya beserta bala tentara yang dia pimpin untuk memusnahkan kaum mukminin dibawah kepemimpinan Nabi Musa, kekuatan mereka seketika tumbang di tengah lautan yang dalam,. Dan bala tentara yang lain ada kaum tsamud, yaitu ummat Nabi Shalih, mereka adalah penduduk perkampungan hijr yang terletak disebelah utara kota Hijaz, atau sebelah utara Yaman, dan kampung itu letaknya disebuah lembah perkampungan yang sangat jauh dari perkotaan, kaum ini tinggal di wilayah yang cukup baik yang penuh dengan tanaman dan pohon kurma yang sangat luas, mereka adalah kaum yang sangat kuat yang terkenal dengan rumah-rumah mereka yang merupakan hasil pahatan mereka sendiri pada gunung batu. Seagaimana yang Allah ﷻ abadikan tentang mereka dalam Al-Qur'an : { فَتِلْكَ بُيُوتُهُمْ خَاوِيَةً بِمَا ظَلَمُوا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَعْلَمُونَ } ( Maka itulah rumah-rumah mereka dalam keadaan runtuh disebabkan kezaliman mereka. Sesungguhnya pada yang demikian itu (terdapat) pelajaran bagi kaum yang mengetahui. ) [ An-Naml : 52 ], rumah-rumah kaum tsamud masih tersisa sampai saat ini walaupun bagunannya sudah tidak sempurna dan Allah ﷻ menjadikannya sebagai pelajaran dan hikmah bagi ummat manusi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah Ta’ala berfirman: هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ “Sudahkah datang kepadamu berita kaum-kaum penentang, ” Yang diajak bicaara dalam ayat ini adalah Rasulullah shallallaahu ‘alaihi wasallam, atau setipa orang yang dapat dijadikan sebagai orang yang diajak bicara. Istifham (kalimat tanya) di sini untuk emmberi peringatan, karena jika sesuatu ucapan disertai istifham maka orang akan lebih banyak perhatian. الْجُنُودِ [al-Junuud] adalah bentuk jamak dari جُنْدٌ [Jundun], disebutkan secara tidak jelas namun dijelaskan dengan firman-Nya : فِرْعَوْنَ وَثَمُودَ \"(yaitu kaum) Fir'aun dan (kaum) Tsamud? ”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 17: 17-20. Allah berkata kepada Nabi-Nya : Apakah telah sampai kepadamu wahai Rasul atas kabar kufur dank eras kepalanya mereka kaum penentang, dan apa yang mereka terima dari adzab dan hukuman ?. Mereka adalah Fir’aun dan Tsamud, yang pertama ditimpakan adzab dan siksaan. Dengan itu pula kafir Mekkah yang terus menerus berdusta maka, siksaan atasnya. Dan ketika engkau (Muhammad ﷺ) datang, mereka (orang kafir) tidak menganggap kekafirannya sebelumnya. Kemudian Allah jelaskan bahwa Allah mencakup mereka dengan ilmu-Nya dan ke Maha Kuasaan-Nya. Dan mereka (orang-orang kafir) terkepung, tidak luput dari Allah dan tidak pula membuat-Nya lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan di antara tindakan-Nya yang menunjukkan benarnya apa yang dibawa para rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 17",
    "description": "Allah menceritakan kisah fir'aun dan kaum Samud untuk menenteramkan hati nabi yang mengalami tekanan hebat dari kaum kafir mekah. Wahai nabi Muhammad, sudahkah sampai kepadamu berita tentang bala tentara penentang, 18. Yaitu fir'aun, penguasa mesir penindas bani israil pada masanya, dan kaum Samud, para pendurhaka terhadap nabi saleh' fir'aun dan tentaranya ditenggelamkan di laut merah, sedangkan kaum Samud dihancurkan dengan sambaran petir."
  }
]