[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-22. Apakah kamu sudah mendengar (wahai rasul), kabar orang orang kafir yang mendustakan nabi nabi mereka? Yaitu Fir’aun dan Tsamud dan azab serta hukuman yang menimpa mereka,tetapi mereka tidak mengambil pelajaran darinya, Sebaliknya orang orang kafir itu selalu dalam pendustaan secara berkesinambungan, seperti itulah orang-orang sebelum mereka. Allah meliputi mereka secara pengetahuan dan kekuasaan, tidak ada yang samar bagiNYA dari amal perbuatan mereka sedikitpun. Dan al-Qur’an bukan sebagaimana yang diklaim oleh orang-orang musyrik bahwa ia adalah syair dan sihir, lalu mereka mendustakannya, sebaliknya ia adalah al-qur’an yang agung lagi mulia, Di lauhil mahfuzh, tidak tersentuh perubahan dan penyelewengan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Yaitu Fir'aun dan kaum Ṡamūd, kaumnya Nabi Ṣāleḥ -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Mereka adalah tentara yang memerangi para rasul, mereka adalah tentara Fir’aun dan pengikutnya di Mesir. Juga kaum Tsamud kaum nabi Sholih. Maksudnya adalah untuk mengambil pelajaran dari apa yang terjadi atas kekufuran dan pembangkangan mereka., yang pada akhirnya mereka ditimpa azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(bala tentara) Fir‘aun dan Tsamud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-18 Kemudian Allah menyebutkan sebagian perbuatanNya yang menunjukkan kebenaran risalah yang dibawa oleh para rasulNya seraya berfirman, “Sudahkah datang kepadamu berita kaum-kaum penentang, (yaitu kaum) Fir’aun dan (kaum) Tsamud,” dan bagaimana mereka mendustakan para rasul? Allah menjadikan mereka dalam golongan orang-orang yang dibinasakan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu kaum yang kepada mereka Allah ﷻ mengutus Nabi-Nya Shalih 'alaihissalam, Nabi yang mengajak mereka kepada Tauhid, akan tetapi mereka menolak untuk menyatakan keimanan kepada Allah ﷻ, bahkan mereka meminta kepada Shalih 'alaihissalam untuk memperlihatkan suatu mukjizat yang dengannya mereka bisa beriman... tidak cukupkah dengan wahyu yang Allah ﷻ turunkan ? tapi mereka hanya menginginkan mukjizat lain yang dapat dilihat oleh mata mereka sendiri, yaitu mukizat yang dapat membuktikan akan kebenaran pekataan Shalh 'alaihissalam, maka Allah ﷻ kemudian mengirimkan kepada seekor unta, unta itu adalah unta yang ajaib, unta itu hanya minum air sekali dalam sehari akan tetapi air susunya cukup untuk minum seluruh kaum tsamud dalam sehari, Allah ﷻ berfirman : { قَالَ هَٰذِهِ نَاقَةٌ لَهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ } ( Shaleh menjawab: “Ini seekor unta betina, ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu. ) [ Asy Syu'ara' : 155 ], akan tetapi mereka tetap saja tidak beriman walaupun mukjizat Nabi shalih yang ada pada unta ini telah mereka saksikan sendiri, maka ketika itupun suara keras ditimpakan kepada mereka sebagai azab atas pembangkangan yang mereka lakukan, Allah berfirman : { إِنَّا أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً فَكَانُوا كَهَشِيمِ الْمُحْتَظِرِ } ( Sesungguhnya Kami menimpakan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti rumput kering (yang dikumpulkan oleh) yang punya kandang binatang. ) [ Al-Qomar : 31 ] sebagai pelajaran bagi manusia setelah mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Yakni: Apakah telah datang berita mereka kepadamu? Jawabannya: Ya Beritanya telah datang kepada Kami. AllahSubhaanahu wa Ta’alaa telah menceritakannya kepada kita tentang fir’aun dan kaum tsamud, yang mengandung pelajaran bagi yang memiliki hati atau yang mendengarkannya sedangkan ia pun menyaksikannya. Kisah fir’aun telah Allah jelaskan dalam ayat-ayat yang banyak di beberapa surat, sebagai pembuka sebelum disebutkan Musa Alaihissalaam, sebagai mana diketahui juga bahwa Musa ‘alaihissalaam diutus kepada Bani Israil. Allah Subhaanahu wa T’ala juga menceritakan Rasulullaah shallallaahu ‘alaihi wa sallam kisah-kisah Musa Alaihissalaam tidak seperti kisah nabi lainnya. Karena Nabi shallallaahu ‘alaihi wa sallam akan pergi berhijrah ke Madinah yang terdapat tiga suku yahudi. Maka Nabi shallallaahu ‘alaihi wa sallam mengetahui banyak sekali berita tentang mereka tujuannya agar beliau benar-benar siap untuk berdialog dan menyanggah mereka dengan kebenaran, sehingga tidak ada perkara mereka yang tersembunyi sedikit pun dari beliau. Sedangkan Fir’aun adalah raja mesir, apa firaun adalah sebutan bagi seorang raja yang bernama firaun atau penyebutan bagi raja mesir yang kafir? Di antara ulama ada yang mengatakan: Bahwa dia adalah nama panggilan seseorang. Yaitu bahwa orang yang Nabi Musa shallallaahu ‘alaihi wa sallam diutus kepadanya bernama fir’aun, sebagian ulama lainnya berpendapat bahwa fir’aun adalah sebutan bagi semua raja mesir yang kafir, sebagaimana disebut kisra bagi semua raja persia, hiraqla bagi semua raja romawi dab Najasi bagi semua raja habasyah, dan sebagainya. Fir’aun ini adalah raja yang angkuh, penentang lagi sombong, ia mengaku-ngaku sebagai tuhan, sebagaimana Allah Ta’ala berfirman: أَنَا رَبُّكُمُ الْأَعْلَى “Akulah tuhanmu yang paling tinggi ”(QS. An-Nazi’at: 24) Ia pun juga mengaku-ngaku berhak disembah ketika dia berkata: مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي “aku tidak mengetahui sesembahan bagimu selain aku. ”(QS. AL-Qashahs: 38) Ia mengejek Musa ‘alaihissalaam juga menhina tanda-tanda (mukjizat)nya bahkan menantangnya, ia berkata secara lantang kepada Musa di depan mukanya: إِنِّي لَأَظُنُّكَ يَا مُوسَى مَسْحُوراً “\"Sesungguhnya aku sangka kamu, hai Musa, seorang yang kena sihir ”(QS. Al-Isra: 101) Ia juga berbangga-banggaan di hadapan Musa dan kaumnya, ia berkata pada mereka: وَنَادَى فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي أَفَلا تُبْصِرُونَ* أَمْ أَنَا خَيْرٌ مِنْ هَذَا الَّذِي هُوَ مَهِينٌ وَلا يَكَادُ يُبِينُ *فَلَوْلا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِنْ ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلائِكَةُ مُقْتَرِنِينَ “Dan Fir'aun berseru kepada kaumnya (seraya) berkata: \"Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku dan (bukankah) sungai-sungai ini mengalir di bawahku; maka apakah kamu tidak melihat(nya)? Bukankah aku lebih baik dari orang yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?Mengapa tidak dipakaikan kepadanya gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya? “(QS. Az-Zukhruf: 51-53) Maka apa hasilnya? Hasilnya adalah ia kufur kepada Musa, dengan mengumpulkan orang-orang khusus untuk membuat tipu daya, mereka adalah penyihir-penyihir. Ketika penyihir-penyihir itu mengumpulkan semua kemampuan sihirnya, mereka datang untuk melawan Musa ‘alaihissalaam, di mana Musa ‘alaihissalaam datang membawa tanda-tanda (mukjizat) yang menyerupai sihir, namun sebenarnya bukanlah sihir, sebenarnya itu adalah tanda-tanda kekuasaan Allah ‘Azza Wa Jalla. Yaitu dia meletakan tongkat yang ia bawa ke tanah maka jadilah seekor ular yang berjalan, dan ia mengumpulkan penyihir-penyihir itu di tempat yang rata: فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِثْلِهِ فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِداً لا نُخْلِفُهُ نَحْنُ وَلا أَنْتَ مَكَاناً سُوَىً “Dan kamipun pasti akan mendatangkan (pula) kepadamu sihir semacam itu, maka buatlah suatu waktu untuk pertemuan antara kami dan kamu, yang kami tidak akan menyalahinya dan tidak (pula) kamu di suatu tempat yang pertengahan (letaknya). ”(QS. Toha: 58) Maksudnya di tempat yang luas rata sehingga dapat disaksikan oleh orang banyak yang menyaksikan atraksi sihir dan keahlian penyihir-penyihir. Lalu Musa berkata kepada mereka: قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ وَأَنْ يُحْشَرَ النَّاسُ ضُحىً “Berkata Musa: \"Waktu untuk pertemuan (kami dengan) kamu itu ialah di hari zinah (perhiasan) dan hendaklah dikumpulkan manusia pada waktu matahari sepenggalahan naik ”(QS. Thoha: 59) Hari Zinah adalah ahari raya mereka, yaitu hari dimana banyak orang yang berkumpul untuk saling mengucapkan salam satu sama lain. Mereka berkumpul di waktu yang ditentukan dan tempat yang disepakati, mereka mengumpulkan orang-orang di waktu duha (pagi) awal waktu siang. Para penyihir itu melemparkan tongkat dan tali yang mereka bawa dengan tangan mereka, orang-orang yang hadir pun tersihir sehingga mereka berkhayal seolah-olah tongkat dan tali tersebut seperti ular yang berjalan, seketika timbulah dala hati Musa rasa takut, karena ia menyaksikan perkara besar dan tipu daya yang besar. Allah ‘Azza Wa jalla pun mewahyukan kepada Musa agar ia melemparkan tongkatnya. Maka Musa melemparkan tongkatnya, maka tongkat Musa yang menjadi ular itu menelan pertunjukkan penyihir-penyihir itu. Seketika itu juga. Penyihir-penyihir itu menyadari bahwa yang dibawa Musa adalah kebenaran dan bukan sihir, karena jikalau Musa benar-benar penyihir maka tidak mungkin ia dapat mengalahkan mereka dengan sihirnya. Maka penyihir-penyihir itu langsung beriman kepada Musa ‘alaihissalaam, dan kafir kepada Fir’aun yang melampaui batas, mereka mengatakan : آمَنَّا بِرَبِّ الْعَالَمِينَ “Kami Beriman kepada Rabb alam semesta” (QS. Asy-Syu’ara: 47) Mereka berhenti di hadapan wajah firaun, mereka menentangnya dan mereka berpaling darinya. Kesudahan itu Allah menenggelamkan Fir’aun di air yang dulunya ia berbangga-bangga dengannya kemarin. Sedangkan kaum Tsamud: Allah Ta’ala telah memberikan mereka kuasa dan kekeuatan sampai sampai mereka mengukir gunung-gunung yang mereka jadikan rumah-rumah dengan giat dan membangun datarannya menjadi istana-istana, ketika mereka mendustakan rasulnya, Nabi Shaleh ‘alaihissalaam, maka Allah membinasakan mereka dengan guncangan dan petir (suara yang memekakkan telinga), mereka binasa seketika juga, mereka pun menjadi mayat-mayat di kampung-kampung mereka. Terdapat dua faedah dari kisah fir’aun dan Tsamud: Pertama: Menghibur dan meneguhkan Nabi shallallaahu ‘alaihi wa sallam, san yang menolong rasul-rasul-Nya sebelumnya maka ia akan ditolong dan dimenangkan. Tidak diragukan lagi bahwa ini akan mengokohkan tekad dan membangkitkan semangat dalam berdakwah kepada Allah dalam menyamkaikan risah-Nya. Faedah yang kedua: Ancaman dan peringatan keras kepada kaum Quraisy yang telah mendustakan Rasulullah shallallaahu ‘alaihi wa sallam, dan berusaha menentangnya, dan mereka bukanlah orang-orang yang lebih kuat daripada Firaun dan Tsamud, walau pun mereka kuat, mereka tetap tertimpa kebinasaan dan kalimat azab terwujud pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 18: 17-20. Allah berkata kepada Nabi-Nya : Apakah telah sampai kepadamu wahai Rasul atas kabar kufur dank eras kepalanya mereka kaum penentang, dan apa yang mereka terima dari adzab dan hukuman ?. Mereka adalah Fir’aun dan Tsamud, yang pertama ditimpakan adzab dan siksaan. Dengan itu pula kafir Mekkah yang terus menerus berdusta maka, siksaan atasnya. Dan ketika engkau (Muhammad ﷺ) datang, mereka (orang kafir) tidak menganggap kekafirannya sebelumnya. Kemudian Allah jelaskan bahwa Allah mencakup mereka dengan ilmu-Nya dan ke Maha Kuasaan-Nya. Dan mereka (orang-orang kafir) terkepung, tidak luput dari Allah dan tidak pula membuat-Nya lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan peringatan bagi orang yang kafir kepada Nabi shallallahu 'alaihi wa sallam dan kepada Al Qur’an agar mereka mengambil pelajaran dari binasanya Fir’aun dan Tsamud."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 18",
    "description": "Yaitu fir'aun, penguasa mesir penindas bani israil pada masanya, dan kaum Samud, para pendurhaka terhadap nabi saleh' fir'aun dan tentaranya ditenggelamkan di laut merah, sedangkan kaum Samud dihancurkan dengan sambaran petir. 19. Wahai nabi Muhammad, bersabarlah engkau atas keingkaran kaummu sebagaimana nabi musa dan nabi saleh. Memang, orang-orang kafir dari kaummu itu keras kepala dan selalu mendustakan kebenaran yang kamu tunjukkan kepada mereka."
  }
]