[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-22. Apakah kamu sudah mendengar (wahai rasul), kabar orang orang kafir yang mendustakan nabi nabi mereka? Yaitu Fir’aun dan Tsamud dan azab serta hukuman yang menimpa mereka,tetapi mereka tidak mengambil pelajaran darinya, Sebaliknya orang orang kafir itu selalu dalam pendustaan secara berkesinambungan, seperti itulah orang-orang sebelum mereka. Allah meliputi mereka secara pengetahuan dan kekuasaan, tidak ada yang samar bagiNYA dari amal perbuatan mereka sedikitpun. Dan al-Qur’an bukan sebagaimana yang diklaim oleh orang-orang musyrik bahwa ia adalah syair dan sihir, lalu mereka mendustakannya, sebaliknya ia adalah al-qur’an yang agung lagi mulia, Di lauhil mahfuzh, tidak tersentuh perubahan dan penyelewengan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Yang menghalangi mereka untuk beriman bukan karena berita tentang orang-orang yang mendustakan dan kehancuran yang menimpa orang-orang tersebut tidak sampai kepada mereka, tetapi mereka mendustakan apa yang dibawa oleh Rasul karena mengikuti hawa nafsu mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. بَلِ الَّذِينَ كَفَرُوا۟ فِى تَكْذِيبٍ (Sesungguhnya orang-orang kafir selalu mendustakan) Yakni orang-orang Arab yang musyrik itu sangat mendustakanmu dan mendustakan apa yang kamu bawa, serta mereka tidak mengambil pelajaran dari orang-orang kafir sebelum mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Bahkan, orang-orang kafir Arab itu sangat mendustai kenabianmu dan kebenaran Alquran. Mereka tidak pernah mengambil pelajaran dari kaum kafir sebelum mereka. Ungkapan Bal berfungsi membantah sebab kedustaan mereka dan menetapkan apa yang benar. Maksudnya bahwa keadaan orang-orang kafir Quraiys itu lebih mengherankan dari pada keadaan pendahulu mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tetapi orang-orang kafir selalu mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 19 “Sesungguhnya orang-orang kafir selalu mendustakan,” yakni, mereka senantiasa mendustakan dan membangkang. Berbagai tanda-tanda kebesaran tidak berguna bagi mereka dan berbagai petuah tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bahkan orang-orang kafir itu mendustakan Rasul-rasul yang diutus kepada mereka, mereka mendustakan ayat-ayat tentang ancaman azab bagi pendusta ayat Allah ﷻ . { بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ } Orang-orang kafir itu mendustakan apa yang para Rasul bawakan kepada mereka dari ayat-ayat Allah, ayat-ayat Allah itu tidak membuat mereka beriman, bahkan pembangkangan yang semakin menjadi yang mereka tunjukkan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemdian Allah subhaanahu berfirman: بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ “Sesungguhnya orang-orang kafir selalu mendustakan, ” Maknanya: Sesunguhnya mereka orang-orang yang kufur kepada Muhammad shallallaahu ‘alaihi wa sallam mereka dalam pendustaan, seakan-akan mereka tenggelam dalam pendustaan, pendustaan meliputi (jiwa) mereka dari segala sisi, makna ini lebih mendalam dibandingkan dengan jika dikatakan: ( بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُون ) Sesungguhnya orang-orang kafir itu mendustakan (QS. Al-Insyqaq: 22), dalam konteks ayat ini damun terkadang dalam konteks lain, يُكَذِّبُون \"mendustakan” maknanya bisa lebih mendalam. Karena terkadang AL-quran datang dengan dua susunan kata yang berbeda (dalam beberapa ayat) dan setiap keduanya bisa bermakna lebih mendalam di setiap tempat (surat) yang berbeda. Orang-orang kafir di sini mencakup setiap orang yang kafir kepada Allah dan Rasul-Nya baik itu dair kalangan orang-ornag musyrik maupun yahudi dan nasrani, itu dikarenakan yahudi dan nasrani saat ini, setelah diutusnya Nabi shallallaahu ‘alaihi wa sallam tidaklah di atas agama yang diridhai Allah, agama-agama mereka tidak bermanfaat bagi mereka, kerena Nabi shallallaahu ‘alaihi wa sallam adalah penutup para nabi, maka siapa saja yang tidak beriman kepadanya maka dia tidak memperoleh apa pun dari agamanya, bahkan orang yang tidak beriman kepada satu rasul saja maka ia telah kafir juga kepada semua rasul, misalnya orang yang tidak beriman bahwa Nuh adalah seorang Rasul, walau pun ia beriaman kepada rasul-rasul selainnya maka ia telah mendustakan rasul-rasul yang lain juga. Dalilnya adalah firman Allah Ta’ala: كَذَّبَتْ قَوْمُ نُوحٍ الْمُرْسَلِينَ “Kaum Nuh telah mendustakan para rasul. ”(QS. Asy-Syu’ara: 105) dalam ayat ini Allah Ta’ala menjelaskan bahwa qaum Nuh mendustakan beberapa rasul padahal mereka belum berjumpa kecuali denga rasul mereka, yaitu Nuh ‘alaihissalaam, begitu juga orang yang mendustakan Muhammad maka ia juga telah mendustakan rasul-rasul dan nabi-nabi Allah lainnya. Jika yahudi mengaku-ngaku di atas agama dan mereka mengikuti taurat yang dibawa oleh Musa, maka kita katakan kepada mereka: Mereka adalah orang-orang kafir juga kepada Musa ‘alaihissalaam, kafir juga kepada taurah, dan jika orang-orang nasrani yang sekara menamamai diri mereka dengan pengikut al-masih mengaku bahwa mereka beriman kepada Isa ‘alaihissalam, maka kita katakan kepada mereka, kalian kafir kepada Isa karena kalian kafir kepada Muhammad ‘alaihissholaatu wassalaam. Anehnya, orang-orang yahudi dan orang-orang nasrani mereka semua kafir (tidak mengakui kerasulan) Muhammad ‘alaihissholaatu wassalaam padahal mereka semua telah mendapatkannya tertulis di kitab mereka, taurat dan injil, bahwa Muhammad memerintahkan mereka kepada kebaikan dan melarang mereka dari kemungkaran, dan menghalalkan yang baik-baik juga mengharamkan yang buruk bagi mereka, dan meringankan beban mereka juga belenggu-belenggu yang membebani meraka, mereka semua mengenal Muhammad seperti mereka mengenali anak-anak mereka. Tetapi penentangan keangkuhan dan iri telah menghalangi mereka untuk beriman kepada Muhammad ‘alaihissholaatu wassalaam: وَدَّ كَثِيْرٌ مِنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّوْنَكُمْ مِنْ بَعْدِ إِيْمَانِكُمْ كُفَّاراً حَسَداً مِنْ عِنْدِ أَنْفُسِهِمْ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ “Sebahagian besar Ahli Kitab menginginkan agar mereka dapat mengembalikan kamu kepada kekafiran setelah kamu beriman, karena dengki yang (timbul) dari diri mereka sendiri, setelah nyata bagi mereka kebenaran ”(QS. Al-Baqoroh: 109) Kesimpulannya: Bahwa firman Allah Ta’ala: بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ “Sesungguhnya orang-orang kafir selalu mendustakan, ” Mencakup semua yang kufur kepada Muhammad shallallaahu ‘alaihi wa sallam termasuk Yahudi dan Nasrani, oleh karena itu Nabi shallallaah ‘alaihi wa sallam bersabda: “Demi Allah yang jiwa Muhammad di tangan-Nya tidaklah mendengar tentangku dari umat ini (umat dakwah) baik yahudi mau pun nasrani kemudian dia tidak beriman kepada yang aku datang dengannya (berupa wahyu) melainkan ia menjadi penghuni neraka ”(1) (1) Dikeluarkan Muslim (153) dari hadits Abu Hurairah radhiyallaahu ‘anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 19: 17-20. Allah berkata kepada Nabi-Nya : Apakah telah sampai kepadamu wahai Rasul atas kabar kufur dank eras kepalanya mereka kaum penentang, dan apa yang mereka terima dari adzab dan hukuman ?. Mereka adalah Fir’aun dan Tsamud, yang pertama ditimpakan adzab dan siksaan. Dengan itu pula kafir Mekkah yang terus menerus berdusta maka, siksaan atasnya. Dan ketika engkau (Muhammad ﷺ) datang, mereka (orang kafir) tidak menganggap kekafirannya sebelumnya. Kemudian Allah jelaskan bahwa Allah mencakup mereka dengan ilmu-Nya dan ke Maha Kuasaan-Nya. Dan mereka (orang-orang kafir) terkepung, tidak luput dari Allah dan tidak pula membuat-Nya lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Semua ayat tidak berguna bagi mereka dan semua nasihat tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 19",
    "description": "Wahai nabi Muhammad, bersabarlah engkau atas keingkaran kaummu sebagaimana nabi musa dan nabi saleh. Memang, orang-orang kafir dari kaummu itu keras kepala dan selalu mendustakan kebenaran yang kamu tunjukkan kepada mereka. 20. Mereka mendustakanmu seakan mereka tidak takut pada azab dan murka Allah, padahal Allah mengepung dari belakang mereka sehingga mereka tidak akan bisa lolos. Dia mengetahui apa saja yang mereka perbuat. Tidak ada tempat lari bagi mereka dari siksa Allah. Karena itu, janganlah engkau bersedih atas kekafiran mereka."
  }
]