[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan hari Kiamat yang pada Hari itu Allah berjanji untuk mengumpulkan seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَالْيَوْمِ الْمَوْعُودِ (dan hari yang dijanjikan) Yakni hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah bersumpah demi hari yang Allah janjikan akan datang dan pada waktu itu amal perbuatan mereka akan dihitung dan dibalas, yaitu hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi hari yang dijanjikan} Aku bersumpah demi hari kiamat yang dijanjikan kejadiannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 “Demi langit yang mempunyai gugusan bintang,” yakni memiliki posisi-posisi (garis-garis edar) yang mencakup tempat matahari, bulan, bintang yang tersusun rapi dalam garis edarnya yang tertata secara sempurna dan rapi yang menunjukkan sempurnaNya kuasa, rahmat, dan luasnya ilmu, serta kebijaksanaan Allah. “Dan demi hari yang dijanjikan,” yaitu Hari Kiamat yang dijanjikan oleh Allah akan dikumpulkannya semua manusia di dalamnya dan digabungkan dari yang pertama hingga yang akhir, yang jauh dan yang dekat. Allah tidak mungkin merubah atau memungkiri janji. “Dan yang menyaksikan dan yang disaksikan,” ini mencakup seluruh orang yang memiliki sifat tersebut. Yakni yang memandang dan yang dipandang, yang hadir dan yang duhadirkan, yang melihat dan yang dilihat. Obyek sumpahnya adalah tanda-tanda kebesaran Allah yang jelas dan hikmahnya yang terang serta rahmatNya yang luas yang terkandung dalam sumpah ini. Ada yang berpendapat bahwa obyek sumpah adalah FirmanNya;"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Allah ﷻ bersumpah demi hari yang dijanjikan, yaitu hari kiamat yang Allah janjikan kepada hamba-hamba Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah Ta’ala berfirman : وَالْيَوْمِ الْمَوْعُودِ “\"dan hari yang dijanjikan\", Hari yang dijanjikan adalah hari kiamat. Allah Ta’ala berjanji dengan hari kiamat dan menjelaskannya dalam kitab-Nya, dan Allah menguatkannya dengan bukti-bukti akal yang menunjukkan bahwa kiamat pasti akan terjadi, sebagaimana Allah Ta’alab berfirman: كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيْدُهُ وَعْداً عَلَيْنَا إنَّا كُنَّا فَاعِلِيْنَ “Sebagaimana Kami telah memulai panciptaan pertama begitulah Kami akan mengulanginya. Itulah suatu janji yang pasti Kami tepati; sesungguhnya Kamilah yang akan melaksanakannya.” (QS. Al-Anbiya: 104)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 2: 1-3. Allah memulai dalam surat ini dengan banyak sumpah. Allah bersumpah dengan gugusan bintang-bintang yang besar, dan ia ada dua belas gugusan, dan ia merupakan tempat beredarnya bulan yang pengetahuan bagi pemilik tempat bercocok tanam, (untuk mengetahui) musim-musim bertani, menanam, dan memanen buah-buahan. Begitu juga penggembala kambing dan unta di padang pasir, dimana mereka (penggembala) akan mengetahui tahun musiman. Musim panas, semi, dingin dan gugur. Kemudian bersumpah dengan hari mauw’ud, yaitu hari kiamat. Dan bersumpah dengan yang menyaksikan dan disaksikan (dari makhluk). Telah berselisih para ahli tafsir tentang penafsiran yang menyaksikan dan disaksikan. Mereka (ahli tafsir) menyebutkan dengan banyak pendapat, ada yang mengatakan : Yaitu orang yang menyaksikan hari jumat dan yang disaksikan pada hari arafah, ada juga yang mengatakan yang menyaksikan adalah Muhammad ﷺ dan yang disaksikan adalah hari perhitungan. Kesimpulannya dengan mengumpulkan pendapat-pendapat (ahli tafsir) adalah setiap orang yang menyaksikan dia juga disaksikan, sebagaimana pendapat syaikh Sa’di."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kiamat, hari dimana Allah Subhaanahu wa Ta'aala berjanji akan mengumpulkan semua makhluk, yang dahulu maupun yang terakhir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 2",
    "description": "1-3. Allah bersumpah demi tiga hal yang luar biasa, baik kejadian maupun prosesnya. Demi langit luas yang mempunyai gugusan bintang atau orbit-orbit bintang ketika beredar di angkasa, yang menjadi penanda kekuasaan Allah yang tidak terbatas. Dan demi hari yang dijanjikan. Itulah hari kiamat, kebangkitan, dan perhitungan yang pasti datang dengan segala kejadian dan kerepotan yang luar biasa di dalamnya. Demi orang yang menyaksikan hari yang dijanjikan itu dan kejadian-kejadian mengerikan dan mencengangkan yang disaksikan oleh mereka pada hari itu"
  }
]