[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-22. Apakah kamu sudah mendengar (wahai rasul), kabar orang orang kafir yang mendustakan nabi nabi mereka? Yaitu Fir’aun dan Tsamud dan azab serta hukuman yang menimpa mereka,tetapi mereka tidak mengambil pelajaran darinya, Sebaliknya orang orang kafir itu selalu dalam pendustaan secara berkesinambungan, seperti itulah orang-orang sebelum mereka. Allah meliputi mereka secara pengetahuan dan kekuasaan, tidak ada yang samar bagiNYA dari amal perbuatan mereka sedikitpun. Dan al-Qur’an bukan sebagaimana yang diklaim oleh orang-orang musyrik bahwa ia adalah syair dan sihir, lalu mereka mendustakannya, sebaliknya ia adalah al-qur’an yang agung lagi mulia, Di lauhil mahfuzh, tidak tersentuh perubahan dan penyelewengan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan Allah mengetahui dengan pasti amal perbuatan mereka dengan rinci, tidak ada sesuatu pun yang luput dari-Nya dan Dia akan membalas mereka atas perbuatan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَاللَّـهُ مِن وَرَآئِهِم مُّحِيطٌۢ (padahal Allah mengepung mereka dari belakang mereka) Yakni Allah mampu menimpakan kepada mereka apa yang telah menimpa orang-orang kafir sebelum mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Keadaan saudara-saudara kita yang saat ini sedang tertimpa musibah di berbagai belahan dunia meminta kita untuk terus memohon kepada Allah dan lebih mendekatkan diri kepada-Nya agar mereka terbebas dari musibah-musibah itu, dan agar Allah membalas semua perbuatan musuh-musuh agama ini dengan siksaan yang jauh lebih besar, karena sekuat apapun kekuatan yang mereka miliki tidak ada bandingnya dengan dengan kekuatan yang dimiliki oleh Allah, bukankah kita telah membaca firman Allah dalam al-Qur'an : { إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ , إِنَّهُ هُوَ يُبْدِئُ وَيُعِيدُ , وَهُوَ الْغَفُورُ الْوَدُودُ , ذُو الْعَرْشِ الْمَجِيدُ , فَعَّالٌ لِّمَا يُرِيدُ , هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ , فِرْعَوْنَ وَثَمُودَ , بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ , وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ } kalua dengan ayat ini belum memberikan kita kekuatan dalam hati untuk kita angkat dalam doa, lalu dengan apa lagi ? maka hendaklah kita memohon kepada Allah untuk kemenangan saudara-saudara kita disetiap shalat dan doa-doa yang kita panjatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Padahal Allah telah mengepung mereka, dan Allah berkuasa berbuat apapun kepada mereka, mereka tidak akan bisa lolos. Mereka berada dalam genggaman dan kekuasaan Allah. Allah akan mengazab mereka seperti para pendahulu mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Allah mengepung dari belakang mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 20 “Padahal Allah mengepung mereka dari belakang mereka,” Allah meliputi mereka secara ilmu dan kekuatan. Sama seperti FirmanNya, “Sesungguhnya Rabbmu benar-benar mengintai.” (Al-Fajr: 14). Di dalamnya terdapat ancaman keras bagi orang-orang kafir dari siksaan Allah dimana mereka berada di dalam genggaman dan di bawah pengaturanNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Allah ﷻ telah mengepung mereka, Allah ﷻ sama sekali tidak pernah lengah dari mengawasai mereka, akan tetapi mereka tetap saja mendustakan padahal ancaman itu berada didepan mereka, tidak satupun kelakuan orang-orang kafir terlepas dari pengawasan Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ “padahal Allah meliputi mereka dari belakang mereka. ” Yakni: Bahwa Allah meliputi mereka dari segala sisi, tidak ada yang luput dari Allah, baik dari ilmu, kekuasaan dan juga hukuman-Nya. Tetapi Alla ‘Azza Wa Jalla terkadang Allah membiarkan yang zalim (memperbanyak dosanya) hingga Allah mengazabnya dan tidak membiarkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 20: 17-20. Allah berkata kepada Nabi-Nya : Apakah telah sampai kepadamu wahai Rasul atas kabar kufur dan keras kepalanya mereka kaum penentang, dan apa yang mereka terima dari adzab dan hukuman ?. Mereka adalah Fir’aun dan Tsamud, yang pertama ditimpakan adzab dan siksaan. Dengan itu pula kafir Mekkah yang terus menerus berdusta maka, siksaan atasnya. Dan ketika engkau (Muhammad ﷺ) datang, mereka (orang kafir) tidak menganggap kekafirannya sebelumnya. Kemudian Allah jelaskan bahwa Allah mencakup mereka dengan ilmu-Nya dan ke Maha Kuasaan-Nya. Dan mereka (orang-orang kafir) terkepung, tidak luput dari Allah dan tidak pula membuat-Nya lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, mereka tidak dapat lolos dari kekuasaan Allah, karena ilmu dan kekuasaan-Nya meliputi mereka. Dalam ayat ini terdapat ancaman keras kepada orang-orang kafir dengan siksaan dari Allah Yang menguasai mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 20",
    "description": "Mereka mendustakanmu seakan mereka tidak takut pada azab dan murka Allah, padahal Allah mengepung dari belakang mereka sehingga mereka tidak akan bisa lolos. Dia mengetahui apa saja yang mereka perbuat. Tidak ada tempat lari bagi mereka dari siksa Allah. Karena itu, janganlah engkau bersedih atas kekafiran mereka. 21. Bahkan yang didustakan oleh kaummu yang kafir itu ialah Al-Qur'an yang mulia, yang tinggi kedudukannya di antara kitab-kitab suci lain, kalam tuhan yang mahaagung. Betapapun didustakan dan dianggap sebagai kumpulan dongeng orang kuno oleh kaummu yang kafir itu, Al-Qur'an tetap tidak ternodai kemuliaannya."
  }
]