[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-22. Apakah kamu sudah mendengar (wahai rasul), kabar orang orang kafir yang mendustakan nabi nabi mereka? Yaitu Fir’aun dan Tsamud dan azab serta hukuman yang menimpa mereka,tetapi mereka tidak mengambil pelajaran darinya, Sebaliknya orang orang kafir itu selalu dalam pendustaan secara berkesinambungan, seperti itulah orang-orang sebelum mereka. Allah meliputi mereka secara pengetahuan dan kekuasaan, tidak ada yang samar bagiNYA dari amal perbuatan mereka sedikitpun. Dan al-Qur’an bukan sebagaimana yang diklaim oleh orang-orang musyrik bahwa ia adalah syair dan sihir, lalu mereka mendustakannya, sebaliknya ia adalah al-qur’an yang agung lagi mulia, Di lauhil mahfuzh, tidak tersentuh perubahan dan penyelewengan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan Al-Qur`ān itu bukanlah syair dan bukan pula sajak sebagaimana dikatakan oleh para pendusta, justru ia adalah Al-Qur`ān yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. بَلْ هُوَ قُرْءَانٌ مَّجِيدٌ (Bahkan yang didustakan mereka itu ialah Al Quran yang mulia) Yakni sangat mulia dan membawa berkah, dan ia bukan seperti yang dituduhkan orang-orang kafir bahwa itu adalah syair, perdukunan, dan sihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Bahkan Alquran ini adalah kitab yang mulia agung dang diagungkan. Tidak seperti yang mereka kira bahwa Alquran hanyalah susunan syair, atau sihir, atau hanya ramalan belaka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan Al-Qur’an yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 21-22 “Bahkan yang didustakan mereka itu ialah al-Qur’an yang mulia,” yakni, luas dan agung maknanya dan banyak kebaikan serta ilmunya, “yang tersimpan dalam Lauhul Mahfudz,” yang terjaga dari perubahan, penambahan, dan pengurangan dan terpelihara dari setan. Itulah Lauhul Mahfudz tempat Allah menegaskan sesuatu. Hal ini menunjukkan kemuliaan, kekuatan, dan tingginya derajat al-Qur’an di sisi Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ بَلْ هُوَ } Apa yang telah dibawaka oleh Muhammad { قُرْآنٌ مَجِيدٌ } adalah Qur'an yang diagugkan, yaitu wahyu yang merupakan syari'at dari Allah ﷻ Tuhan semesta alam, bukan kitab yang dengan orang-orang bodoh berdusta, dan sesungguhnya Al-Qur'an itu dijaga dan lindungi oleh pemiliknya : { إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ } ( Sesungguhnya Kami-lah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya. ) [ Al-Hijr : 9 ] . Tidak siapapun yang boleh mempermainkannya, atau sekedar menambahkan atau mengurangi dari apa yang telah ditetapkan didalamnya. Itulah Al-Qur'an yang merupakan salah satu nikmat Allah yang paling besar bagi manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "بَلْ هُوَ قُرْآنٌ مَجِيدٌ فِي لَوْحٍ مَحْفُوظٍ“Bahkan yang didustakan mereka itu ialah Al Quran yang mulia, yang (tersimpan) dalam Lauh Mahfuzh. ” Maknanya: Bahwa yang dibawa oleh Rasul ‘alaihissolaatu wassalaam adalah قُرْآنٌ مَجِيدٌ “quran yang mulia” Maknanya: memiliki keagungan dan kemuliaan. AL-Quran di sifati dengan mulia tidak berarti sekedar Al-Quran saja yang mulia, tatapi disamping Al-Quran mulia, yang membawanya lalu menegakan kewajibannya berupa membaca dengan sebenar-benar bacaan, maka orang-orang yang seperti ini pun mendapatkan kemuliaan, keagungan dan kedudukan yang tinggi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 21: 21-22. Kemudian Allah tutup surat ini dengan penjelasan atas mereka yang mendustakan Al Qur’an, (padahal ia) terjaga dari perubahan, dan tertulis di Lauh Al Mahfudz dan sebagai ummul kitab di sisi Allah. Allah menafikan apa yang mereka tuduhkan kepada Al Qur’an, mereka katakan : Al Qur’an adalah syair dan ia adalah dongeng-dongeng belaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni luas maknanya, banyak kebaikannya dan pengetahuannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 21",
    "description": "Bahkan yang didustakan oleh kaummu yang kafir itu ialah Al-Qur'an yang mulia, yang tinggi kedudukannya di antara kitab-kitab suci lain, kalam tuhan yang mahaagung. Betapapun didustakan dan dianggap sebagai kumpulan dongeng orang kuno oleh kaummu yang kafir itu, Al-Qur'an tetap tidak ternodai kemuliaannya. 22. Itulah kitab suci yang tersimpan dalam tempat yang terjaga, lauh mahf'z. Itulah tempat paling rahasia yang tidak diketahui hakikatnya oleh manusia. Di dalamnya terdapat detail peristiwa-peristiwa yang terjadi di alam semesta. Tempat ini terjaga dari setan yang berusaha mengintai dan mencari tahu isinya."
  }
]