[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan segala yang menyaksikan seperti Nabi atas umatnya dan yang disaksikan seperti umat atas Nabinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَشَاهِدٍ (dan yang menyaksikan) Yakni makhluk-makhluk yang menjadi saksi pada hari itu. وَمَشْهُودٍ (dan yang disaksikan) Yakni apa yang dipersaksikan para saksi atas orang-orang berdosa yang melakukan kejahatan terhadap para saksi itu sendiri, mereka adalah orang-orang yang terbunuh di jalan Allah, sebagaimana kisah ashabul ukhdud yang akan disebutkan. Dan Allah juga akan menjadi saksi atas orang-orang berdosa itu sebagaimana yang akan disebutkan setelahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Demi setiap orang yang menyaksiakan amal orang lain pada hari kiamat. Juga demi mereka yang semua amal perbuatannya ditampakkan, termasuk Rasul dan umat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi yang menyaksikan dan yang disaksikan} Aku bersumpah demi setiap saksi yang memberi kesaksian dan setiap orang yang disaksikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-3 “Demi langit yang mempunyai gugusan bintang,” yakni memiliki posisi-posisi (garis-garis edar) yang mencakup tempat matahari, bulan, bintang yang tersusun rapi dalam garis edarnya yang tertata secara sempurna dan rapi yang menunjukkan sempurnaNya kuasa, rahmat, dan luasnya ilmu, serta kebijaksanaan Allah. “Dan demi hari yang dijanjikan,” yaitu Hari Kiamat yang dijanjikan oleh Allah akan dikumpulkannya semua manusia di dalamnya dan digabungkan dari yang pertama hingga yang akhir, yang jauh dan yang dekat. Allah tidak mungkin merubah atau memungkiri janji. “Dan yang menyaksikan dan yang disaksikan,” ini mencakup seluruh orang yang memiliki sifat tersebut. Yakni yang memandang dan yang dipandang, yang hadir dan yang duhadirkan, yang melihat dan yang dilihat. Obyek sumpahnya adalah tanda-tanda kebesaran Allah yang jelas dan hikmahnya yang terang serta rahmatNya yang luas yang terkandung dalam sumpah ini. Ada yang berpendapat bahwa obyek sumpah adalah FirmanNya;"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Allah ﷻ juga bersumpa dengan saksi dan dengan siapa yang disaksikan, inilah sumpah ketiga dalam surah ini, dan jawaban dari sumpah-sumpah ini pada ayat-ayat selanjutnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَشَاهِدٍ وَمَشْهُوْدٍ “dan yang menyaksikan dan yang disaksikan.” Para Ulama Tafsir menyebutkan yang dimaksudkan dari yang menyaksikan dan yang disaksikan pada ayat ini menjadi beberapa pendapat yang dapat dikumpulkan: Bahwa Allah bersumpah dangan semua yang menyaksikan dan semua yang disaksikan. Dan menyaksikan banyak, di antaranya adalah Muhammad Rasulullah shallallaahu ‘alaihi wasallam akan bersaksi atas kita sebagaimana Allah Ta’ala berfirman: وَجِئْنَا بِكَ عَلَى هَؤُلاءِ شَهِيداً “dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu).”(QS. An-Nisa: 41) Di antara saksi juga adalah ummat ini akan menjadi saksi atas semua manusia: وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ “Dan demikian (pula) Kami telah menjadikan kamu (umat Islam), umat yang adil dan pilihan agar kamu menjadi saksi atas (perbuatan) manusia”(QS. Al-Baqarah: 143) Anggota tubuh manusia akan menjadi saksi bagi pemiliknya dari apa yang telah diperbuat berupa kebaikan dan keburukan sebagaimana Allah Ta’ala berfirman: يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُمْ بِمَا كَانُوا يَعْمَلُونَ “pada hari (ketika), lidah, tangan dan kaki mereka menjadi saksi atas mereka terhadap apa yang dahulu mereka kerjakan.” (QS. An-Nur:24) Di antara saksi juga adalah para malaikat, mereka akan menjadi saksi pada hari kiamat. Dan semua yang menjadi saksi dengan kebenaran maka ia termasuk dalam firman-Nya وَشَاهِدٍ \"yang menyaksikan\" Sedangkan al-Masyhud [yang disaksikan] adalah hari kiamat dan hal-hal yang mengiringinya berupa kejadian-kejadian besar yang mengerikan sebagaimana Allah Ta’ala berfirman: ذَلِكَ يَوْمٌ مَجْمُوْعٌ لَهُ النَّاسُ وَذَلِكَ يَوْمٌ مَشْهُوْدٌ “Hari kiamat itu adalah suatu hari yang semua manusia dikumpulkan untuk (menghadapi)nya, dan hari itu adalah suatu hari yang disaksikan (oleh segala makhluk).”(QS. Hud: 103) Maka Allah di sini bersumpah dengan semua yang menyaksikan juga semua yang menjadi saksi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 3: 1-3. Allah memulai dalam surat ini dengan banyak sumpah. Allah bersumpah dengan gugusan bintang-bintang yang besar, dan ia ada dua belas gugusan, dan ia merupakan tempat beredarnya bulan yang pengetahuan bagi pemilik tempat bercocok tanam, (untuk mengetahui) musim-musim bertani, menanam, dan memanen buah-buahan. Begitu juga penggembala kambing dan unta di padang pasir, dimana mereka (penggembala) akan mengetahui tahun musiman. Musim panas, semi, dingin dan gugur. Kemudian bersumpah dengan hari mauw’ud, yaitu hari kiamat. Dan bersumpah dengan yang menyaksikan dan disaksikan (dari makhluk). Telah berselisih para ahli tafsir tentang penafsiran yang menyaksikan dan disaksikan. Mereka (ahli tafsir) menyebutkan dengan banyak pendapat, ada yang mengatakan : Yaitu orang yang menyaksikan hari jumat dan yang disaksikan pada hari arafah, ada juga yang mengatakan yang menyaksikan adalah Muhammad ﷺ dan yang disaksikan adalah hari perhitungan. Kesimpulannya dengan mengumpulkan pendapat-pendapat (ahli tafsir) adalah setiap orang yang menyaksikan dia juga disaksikan, sebagaimana pendapat syaikh Sa’di."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Jum’at. Yaitu hari ‘Arafah. Menurut Syaikh As Sa’diy, bahwa termasuk ke dalam ayat ini, yang melihat dan yang dilihat, yang hadir dan yang dihadiri. Isi sumpahnya adalah apa yang dikandung dalam sumpah ini berupa tanda-tanda kekuasaan Allah yang besar, hikmah-hikmah-Nya yang jelas dan rahmat-Nya yang luas. Ada pula yang berpendapat, bahwa isi sumpahnya adalah firman Allah Ta’ala, “Binasalah orang-orang yang membuat parit.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 3",
    "description": "1-3. Allah bersumpah demi tiga hal yang luar biasa, baik kejadian maupun prosesnya. Demi langit luas yang mempunyai gugusan bintang atau orbit-orbit bintang ketika beredar di angkasa, yang menjadi penanda kekuasaan Allah yang tidak terbatas. Dan demi hari yang dijanjikan. Itulah hari kiamat, kebangkitan, dan perhitungan yang pasti datang dengan segala kejadian dan kerepotan yang luar biasa di dalamnya. Demi orang yang menyaksikan hari yang dijanjikan itu dan kejadian-kejadian mengerikan dan mencengangkan yang disaksikan oleh mereka pada hari itu. 4. Allah melaknat penguasa kafir dari najr'n, sebuah wilayah di yaman saat ini, yang berbuat keji terhadap kaum beriman. Terlaknat dan binasalah orang-orang yang membuat parit untuk dijadikan ladang pembantaian terhadap kaum beriman yang tidak mau murtad. Merekalah para pembesar najran di yaman."
  }
]