[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dilaknat orang-orang yang telah membelah (membuat parit) di bumi dengan belahan yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. قُتِلَ أَصْحٰبُ الْأُخْدُودِ (Binasa dan terlaknatlah orang-orang yang membuat parit) Mereka adalah seorang raja dari orang-orang kafir dengan para tentaranya. Ketika sebagian rakyatnya beriman, raja itu kemudian membuat parit dan mengisinya dengan nyala api kemudian orang-orang yang beriman itu mereka lemparkan ke dalam api tersebut, sedangkan raja dan tentaranya melihat mereka terbakar. Kisah lengkapnya dapat dirujuk pada kitab shahih Muslim juz 4 hal. 2299."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Terlaknatlah para pembuat parit, yaitu pembesar Najran dan Yaman. Mereka adalah kaum kafir yang membakar kelompok orang mukmin dalam sebuah parit di negeri Yaman. Mereka adalah kaum Nasrani Najran, yang sebelumnya mereka mempercayai bahwa Tuhan itu satu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{binasalah} terlaknatlah {orang-orang yang membuat parit} membuat parit yang besar di bumi untuk membakar orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 4-9 “Telah dibinasakan orang-orang yang membuat parit.” Ini adalah doa kebinasaan atas mereka. Parit adalah lubang yang dibuat di dalam tanah. Orang-orang yang membuat parit adalah orang-orang kafir dan di tengah-tengah mereka terdapat segolongan orang-orang yang beriman. Mereka mengajak orang-orang yang beriman agar masuk ke dalam agama mereka, tapi orang-orang beriman tidak mau. Kemudian orang-orang kafir membuat parit di tanah. Mereka menyalakan api di parit itu. Mereka duduk di sekeliling parit itu. Mereka menguji orang-orang yang beriman dan mendekatkan mereka ke parit. Yang menerima ajakan mereka akan dilepaskan, sedangkan yang terus beriman dilemparkan ke dalam api. Ini adalah puncak perang melawan Allah dan golonganNya, orang-orang yang beriman. Karena itu, Allah melaknat, membinasakan, dan mengancam mereka, “Telah dibinasakan orang-orang yang membuat parit.” Kemudian Allah menjelaskan parit yang dimaksud denagn FirmanNya, “Yang berapi (dinyalakan dengan) kayu bakar, ketika mereka duduk di sekitarnya, sedang mereka menyaksikan apa yang mereka perbuat terhadap orang-orang yang beriman.” Ini adalah puncak kesombongan dan kerasnya hati, karena mereka menyatukan antara kufur terhadap tanda-tanda kebesaran Allah, menentangnya, memerangi, dan menyiksa orang-orang beriman dengan siksaan seperti ini yang memiriskan hati, yang disatukan dengan hadirnya mereka pada saat orang-orang beriman dilemparkan ke dalam parit berapi. Padahal mereka tidaklah menyiksa orang-orang beriman kecuali karena kondisi yang membuat mereka terpuji dan karenanya mereka berbahagia, karena mereka, “beriman kepada Allah yang Mahaperkasa lagi Maha Terpuji,” yakni yang memiliki keperkasaan, yang dengan keperkasaan itu Dia memaksa segala sesuatu. Dia Terpuji dalam perkataan, perbuatan, dan sifat-sifatNya. “Yang mempunyai kerajaan langit dan bumi,” sebagai pencipta dan yang disembah, serta manusia yang diperlakukan sesuai kehendakNya. “Dan Allah Maha Menyaksikan segala sesuatu,” secara pengetahuan, pendengaran, dan penglihatan. Apakah mereka yang membangkang itu tidak merasa takut pada Allah bila menyiksa mereka? Atau apakah mereka tidak tahu bahwa mereka semua adalah milik Allah? Tidak ada seorang pun yang berkuasa atas yang lain tanpa izin dari Allah. Ataukah mereka tidak tahu bahwa Allah Maha Melihat amal perbuatan mereka dan akan membalasnya? Sekali-kali tidak, sesungguhnya orang-orang kafir berada dalam tipuan, sedangkan orang bodoh berada dalam kebutaan dan tersesat dari jalan yang lurus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ قُتِلَ } Terbunuhlah, dalam hal ini dapat dimaknai : Terlaknatlah { أَصْحَابُ الْأُخْدُودِ } para pemilik parit ( lubang ), Allah melaknat mereka, dan siapakah mereka pemilik parit itu ? { أَصْحَابُ الْأُخْدُودِ } Mereka adalah para pembuat parit itu ( lubang yang digali ditnah ), mereka menggalinya kemudian menyalakan api didalamnya, kemudian para pemilik parit itu datang bersama kaum muslimin dengan paksaan agar mereka murtad atau keluar dari keimanan mereka kepada Allah, akan tetapi kaum muslimin itu enggan menuruti keinginan mereka dan akhirnya mereka membakar kaum mu'minin hidup-hidup didalam lubang parit itu, para penggali parit itu pun melihat kaum mu'minin hangus terbakar. Perbedaan pendapat diantara ulama mengenai keberadaan para pemilik parit itu ? Dalam riwayat dikatakan : bahwasanya mereka itu berasal dari bani isra'il, dikatakan juga : bahwasanya mereka adalah kaum yang berasal dari negri Yaman, yang dipimpin oleh seorang penguasa kafir dan kejam terhadap kaum mu'minin di negri itu, mereka ingin dari kaum mu'minin itu menggalkan agama mereka, akan tetapi mereka menolak dan digalilah sebuah parit ata lubang besar untuk membakar kaum mu'minin"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "قُتِلَ أَصْحَابُ الْأُخْدُودِ “Binasa dan terlaknatlah orang-orang yang membuat parit,” Penggalan kalimat pada ayat ini adalah jawab dari sumpah tadi. قُتِلَ maknanya binasa dikatakan juga bahwa maknanya adalah laknat. Yang berarti dilemparkan dan dijauhkan dari rahmat Allah أَصْحَابُ الْأُخْدُودِ [As-Habul Ukhdud (para pemilik parit)] mereka adalah sekelompok kaum yang kafir yang membakar orang –orang mukmin dengan api. Datang beberapa kisah tentang kaum tersebut, di antara mereka ada di negeri syam dan di antaranya ada yang dari yamn. Maksudnya adalah orang-orang kafir itu yang berusa untuk mengeluarkan orang-orang mukmin dari agama mereka. Namun mereka gagal sehingga mereka menggali parit yang membentang di tanah seperti sungai, mereka mengumpulkan kayu bakar yang banyak lalu mereka membakar orang-rang beriman dengan apinya wal-‘iyadzu billaah, oleh karenaya Allah Befirman: النَّارِ ذَاتِ الْوَقُودِ “yang berapi (dinyalakan dengan) kayu bakar,” Maknanya adalah parit-parit itu adalah parit api النَّارِ ذَاتِ الْوَقُودِ “dinyalakan” Yaitu: kayu bakar yang banyak dan api yang berkobar"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 4: Kemudian datang pada ayat ini jawaban dari sumpah (pada ayat sebelumnya), maka Allah berkata : Allah membinasakan penggali (pembuat) parit yang mereka membuat lubang (celah) panjang di bumi dan menjadikannya banyak lubang. Mereka menyalakan api di dalamnya untuk membakar orang-orang yang beriman. Kemudian Allah menceritakan bahwa api ini menyala-nyala yang dinyalakan dengan kayu bakar yang banyak. Dak kisah para penggali parit ini dikisahkan imam muslim di dalam shahihnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Katsir berkata, “(Ayat) ini merupakan berita tentang orang-orang kafir yang mendatangi orang-orang yang beriman kepada Allah ‘Azza wa Jalla di dekat mereka, mereka memaksa orang-orang yang beriman agar murtad dari agamanya, namun mereka menolak, maka mereka (orang-orang kafir) membuat parit di bumi dan menyalakan api di dalamnya serta menyiapkan kayu bakar untuk menyalakannya, lalu mereka meminta orang-orang yang beriman (untuk murtad), namun mereka (orang-orang yang beriman) menolak, maka dimasukkanlah mereka ke dalamnya.” Hal ini merupakan sikap mengadakan perlawanan kepada Allah dan golongan-Nya yaitu kaum mukmin. Oleh karennya, Allah Subhaanahu wa Ta'aala melaknat dan membinasakan mereka serta mengancam mereka. Dia berfirman, “Binasalah orang-orang yang membuat parit.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 4",
    "description": "Allah melaknat penguasa kafir dari najr'n, sebuah wilayah di yaman saat ini, yang berbuat keji terhadap kaum beriman. Terlaknat dan binasalah orang-orang yang membuat parit untuk dijadikan ladang pembantaian terhadap kaum beriman yang tidak mau murtad. Merekalah para pembesar najran di yaman. 5. Mereka membuat parit yang berapi dan dinyalakan dengan kayu bakar hingga membara untuk membakar kaum beriman."
  }
]