[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan mereka duduk-duduk di sekitar parit yang dipenuhi api itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِذْ هُمْ عَلَيْهَا قُعُودٌ (ketika mereka duduk di sekitarnya) Yakni mereka terlaknat ketika mereka melihat api tersebut sambil duduk di kursi di atas parit itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6. Api yang mempunyai nyala yang dahsyat yang membakar apa yang ada di atasnya. Ketika mereka diletakkan di tepi parit yang apinya menyala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika itu mereka duduk di sekitarnya} mereka duduk di sisi api untuk menyiksa orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 4-9 “Telah dibinasakan orang-orang yang membuat parit.” Ini adalah doa kebinasaan atas mereka. Parit adalah lubang yang dibuat di dalam tanah. Orang-orang yang membuat parit adalah orang-orang kafir dan di tengah-tengah mereka terdapat segolongan orang-orang yang beriman. Mereka mengajak orang-orang yang beriman agar masuk ke dalam agama mereka, tapi orang-orang beriman tidak mau. Kemudian orang-orang kafir membuat parit di tanah. Mereka menyalakan api di parit itu. Mereka duduk di sekeliling parit itu. Mereka menguji orang-orang yang beriman dan mendekatkan mereka ke parit. Yang menerima ajakan mereka akan dilepaskan, sedangkan yang terus beriman dilemparkan ke dalam api. Ini adalah puncak perang melawan Allah dan golonganNya, orang-orang yang beriman. Karena itu, Allah melaknat, membinasakan, dan mengancam mereka, “Telah dibinasakan orang-orang yang membuat parit.” Kemudian Allah menjelaskan parit yang dimaksud denagn FirmanNya, “Yang berapi (dinyalakan dengan) kayu bakar, ketika mereka duduk di sekitarnya, sedang mereka menyaksikan apa yang mereka perbuat terhadap orang-orang yang beriman.” Ini adalah puncak kesombongan dan kerasnya hati, karena mereka menyatukan antara kufur terhadap tanda-tanda kebesaran Allah, menentangnya, memerangi, dan menyiksa orang-orang beriman dengan siksaan seperti ini yang memiriskan hati, yang disatukan dengan hadirnya mereka pada saat orang-orang beriman dilemparkan ke dalam parit berapi. Padahal mereka tidaklah menyiksa orang-orang beriman kecuali karena kondisi yang membuat mereka terpuji dan karenanya mereka berbahagia, karena mereka, “beriman kepada Allah yang Mahaperkasa lagi Maha Terpuji,” yakni yang memiliki keperkasaan, yang dengan keperkasaan itu Dia memaksa segala sesuatu. Dia Terpuji dalam perkataan, perbuatan, dan sifat-sifatNya. “Yang mempunyai kerajaan langit dan bumi,” sebagai pencipta dan yang disembah, serta manusia yang diperlakukan sesuai kehendakNya. “Dan Allah Maha Menyaksikan segala sesuatu,” secara pengetahuan, pendengaran, dan penglihatan. Apakah mereka yang membangkang itu tidak merasa takut pada Allah bila menyiksa mereka? Atau apakah mereka tidak tahu bahwa mereka semua adalah milik Allah? Tidak ada seorang pun yang berkuasa atas yang lain tanpa izin dari Allah. Ataukah mereka tidak tahu bahwa Allah Maha Melihat amal perbuatan mereka dan akan membalasnya? Sekali-kali tidak, sesungguhnya orang-orang kafir berada dalam tipuan, sedangkan orang bodoh berada dalam kebutaan dan tersesat dari jalan yang lurus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِذْ } Dalam kaidah tata bahasa Arab adalah sebagi zhorof yang menandakan kejadian pada waktu yang telah lampau, { هُمْ عَلَيْهَا قُعُودٌ } Yakni : penguasa kejam saat itu bersama kaumnya duduk ditepi parit saat orang-orang mukmi itu mereka siksa dengan bara api."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذْ هُمْ عَلَيْهَا قُعُوْدٌ “ketika mereka duduk di sekitarnya,” Yakni: Orang-orang yang menggali parit-parit yang melemparkan orang-orang mukmin kedalamnya, dahulu wa’iyadzu billah memiliki kekuatan dan keangkuhan, mereka memandang kepada api itu yang membakar manusia sedangkan mereka duduk-duduk di sekitarnya di atas dipan dipan mereka tertawa seakan-akan tidak terjadi apapun. Ini adalah termasuk keangkuhan yaitu seorang manusia melihat ada manusia yang terbakar api sedangkan ia hanya duduk di atas sofanya, ia bercanda ria dan tidak peduli."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 6: 5-6. Allah menjelaskan mereka para pendosa (yang menyiksa mukmin) sambil duduk-duduk di sekitar api yang besar yang menyala-nyala. Mereka mengawasi orang-orang beriman sambil mengadzabnya dengan api; Maka Allah lah yang akan menghalangi orang-orang kafir (dari surga-Nya) dan akan menjebloskan mereka kedalam neraka, kemudian orang-orang mukmin (yang akan) menyaksikan mereka ketika dijebloskan. Dan ia (orang kafir) kufur namun bergembira atas kekufurannya, dan Allah mengabaikan mereka (ketika mereka disiksa oleh-Nya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 6",
    "description": "Penguasa kafir itu menyiksa dan membantai kaum beriman di parit berapi tersebut. Peristiwa memilukan itu terjadi ketika mereka duduk di sekitarnya untuk menyaksikan kekejian mereka. 7. Penguasa kafir dan prajuritnya itu duduk-duduk di sekitar parit, sedang mereka menyaksikan dan menikmati kekejiaan macam apa pun yang mereka perbuat terhadap orang-orang mukmin. Satu per satu orang beriman dipaksa untuk murtad. Bila menolak, mereka akan dilemparkan ke parit berapi tersebut. Inilah salah satu pelanggaran hak asasi manusia terbesar dalam sejarah keagamaan di dunia."
  }
]