[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-9. Allah bersumpah dengan langit yang memiliki orbit orbit yang dilewati oleh beredarnya matahari dan rembulan, Dan juga dengan hari kiamat yang Allah janjikan kepada manusia akan mengumpulkan mereka padanya, Dengan saksi yang bersaksi dan yang disaksikan. Allah bersumpah dengan apa yang dia kehendaki dari makhluk-makhlukNYA, adapun makhluk, mereka tidak boleh bersumpah dengan selain Allah, karena bersumpah dengan selain Allah adalah syirik, Bahwa dilaknat orang-orang yang membuat parit-parit besar di bumi untuk menyiksa orang orang beriman, Mereka menyalakan api yang besar pada parit-parit itu, Manakala mereka duduk ditepi parit-parit dan tidak meninggalkannya. Mereka hadir menyaksikan apa yang mereka lakukan terhadap orang-orang beriman, berupa hukuman dan siksaan. Mereka itu tidak menyiksa orang orang beriman dengan siksa yang berat itu kecuali karena orang-orang beriman itu beriman kepada Allah yang maha perkasa yang tidak terkalahkan, maha terpuji dalam perkataan,perbuatan dan sifat sifatNYA, Pemilik langit dan bum, dan Allah maha menyaksikan segala sesuatu,tidak ada sesuatu pun yang samar bagi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Mereka merupakan saksi atas penyiksaan dan kekejaman yang mereka lakukan terhadap orang-orang yang beriman karena kehadiran mereka pada peristiwa itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِالْمُؤْمِنِينَ (sedang mereka pada apa yang mereka perbuat terhadap orang-orang yang beriman) Yakni yang memasukkan orang-orang beriman agar keluar dari agama mereka. شُهُودٌ (menyaksikan) Yakni menyaksikan diri mereka sendiri pada hari kiamat atas apa yang telah mereka lakukan. Kemudian lidah, tangan, dan kaki mereka akan bersaksi atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sedang mereka pun bersaksi di hadapan Allah atas apa yang mereka lakukan terhadap kaum mukmin, dengan membakar mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itu menyaksikan} menghadiri {apa yang mereka perbuat terhadap orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 4-9 “Telah dibinasakan orang-orang yang membuat parit.” Ini adalah doa kebinasaan atas mereka. Parit adalah lubang yang dibuat di dalam tanah. Orang-orang yang membuat parit adalah orang-orang kafir dan di tengah-tengah mereka terdapat segolongan orang-orang yang beriman. Mereka mengajak orang-orang yang beriman agar masuk ke dalam agama mereka, tapi orang-orang beriman tidak mau. Kemudian orang-orang kafir membuat parit di tanah. Mereka menyalakan api di parit itu. Mereka duduk di sekeliling parit itu. Mereka menguji orang-orang yang beriman dan mendekatkan mereka ke parit. Yang menerima ajakan mereka akan dilepaskan, sedangkan yang terus beriman dilemparkan ke dalam api. Ini adalah puncak perang melawan Allah dan golonganNya, orang-orang yang beriman. Karena itu, Allah melaknat, membinasakan, dan mengancam mereka, “Telah dibinasakan orang-orang yang membuat parit.” Kemudian Allah menjelaskan parit yang dimaksud denagn FirmanNya, “Yang berapi (dinyalakan dengan) kayu bakar, ketika mereka duduk di sekitarnya, sedang mereka menyaksikan apa yang mereka perbuat terhadap orang-orang yang beriman.” Ini adalah puncak kesombongan dan kerasnya hati, karena mereka menyatukan antara kufur terhadap tanda-tanda kebesaran Allah, menentangnya, memerangi, dan menyiksa orang-orang beriman dengan siksaan seperti ini yang memiriskan hati, yang disatukan dengan hadirnya mereka pada saat orang-orang beriman dilemparkan ke dalam parit berapi. Padahal mereka tidaklah menyiksa orang-orang beriman kecuali karena kondisi yang membuat mereka terpuji dan karenanya mereka berbahagia, karena mereka, “beriman kepada Allah yang Mahaperkasa lagi Maha Terpuji,” yakni yang memiliki keperkasaan, yang dengan keperkasaan itu Dia memaksa segala sesuatu. Dia Terpuji dalam perkataan, perbuatan, dan sifat-sifatNya. “Yang mempunyai kerajaan langit dan bumi,” sebagai pencipta dan yang disembah, serta manusia yang diperlakukan sesuai kehendakNya. “Dan Allah Maha Menyaksikan segala sesuatu,” secara pengetahuan, pendengaran, dan penglihatan. Apakah mereka yang membangkang itu tidak merasa takut pada Allah bila menyiksa mereka? Atau apakah mereka tidak tahu bahwa mereka semua adalah milik Allah? Tidak ada seorang pun yang berkuasa atas yang lain tanpa izin dari Allah. Ataukah mereka tidak tahu bahwa Allah Maha Melihat amal perbuatan mereka dan akan membalasnya? Sekali-kali tidak, sesungguhnya orang-orang kafir berada dalam tipuan, sedangkan orang bodoh berada dalam kebutaan dan tersesat dari jalan yang lurus."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka duduk menyaksikan siksaan yang mereka timpakan kepada orang-orang beriman."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَهُمْ عَلَى مَا يَفْعَلُوْنَ بِالْمُؤْمِنِيْنَ شُهُوْدٌ “sedang mereka menyaksikan apa yang mereka perbuat terhadap orang-orang yang beriman.” Maknanya: Mereka tidak menghilang (pergi) saat mereka melakukan perbuatan ini kepada kaum mukminin. Oleh karena itu mereka berhak mendapat ancaman ini, bahkan mereka berhak memperoleh hukuman ini yaitu Allah membinasakan mereka, melaknat, melempar dan menjauhkan mereka dari Rahmat-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Buruj ayat 7: 7-9. Mereka orang-orang kafir menyaksikan atas apa yang mereka perbuat kepada orang-orang mukmin. Mereka orang-orang mukmin tidak mengingkari dan tidak pula mencela mereka (orang-orang kafir) kecuali mereka membenarkan (janji) Allah yang terpuji terhadap setiap keadaan (yang menimpa mereka), dimana Allah yang memiliki kerajaan baik di langit maupun di bumi, Ia berkuasa atas keduanya dengan apa yang Ia kehendaki, dan menghukumi sesuai dengan apa yang Ia inginkan, dan Allah menjadi saksi atas segala sesuatu. Tidak akan tersembunyi akan kelakuan mereka para thaghut (yang melampaui batas), yang dzalim dengan siapa yang beriman kepada Allah dan yang mengikuti petunjuk-Nya. Itulah kejahatan mereka dan dosa mereka (yang menghabisi) siapa yang tunduk dan beriman kepada Allah. Seperti inilah pertimbangan mereka (orang-orang fasiq), mereka menginginkan sifat terpuji dan kebaikan (dari orang-orang beriman) menjadi sebuah keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu memasukkan orang-orang mukmin ke dalam api jika mereka tidak mau murtad dari agamanya. Mereka yang menyiksa orang-orang mukmin ini telah menggabung antara kafir kepada ayat-ayat Allah, menentangnya, memerangi para wali-Nya serta menyiksa mereka dengan siksaan itu, ditambah lagi dengan tidak adanya rasa kasihan dalam hati mereka, sampai-sampai mereka menyaksikan penyiksaan yang kejam itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Buruj Ayat 7",
    "description": "Penguasa kafir dan prajuritnya itu duduk-duduk di sekitar parit, sedang mereka menyaksikan dan menikmati kekejiaan macam apa pun yang mereka perbuat terhadap orang-orang mukmin. Satu per satu orang beriman dipaksa untuk murtad. Bila menolak, mereka akan dilemparkan ke parit berapi tersebut. Inilah salah satu pelanggaran hak asasi manusia terbesar dalam sejarah keagamaan di dunia. 8. Dan mereka yang kafir dan zalim tersebut menyiksa dan membantai orang-orang mukmin itu hanya karena orang-orang mukmin itu beriman kepada Allah yang mahaperkasa, maha terpuji."
  }
]