[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Allah bersumpah dengan waktu fajar, Juga dengan 10 malam pertama bulan dzulhijjah dan apa yang dengannya ia dimuliakan, Juga dengan segala apa yang genap dan ganjil, Dan dengan malam bila ia hadir dengan kegelapannya, Tidakkah sumpah sumpah diatas mengandung nasihat yang cukup bagi pemilik akal?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah Yang Mahasuci bersumpah dengan fajar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Allah bersumpah demi waktu fajar, yaitu waktu munculnya cahaya matahari yang menjadi salah satu peristiwa yang menunjukkan kekuasaan Allah dalam mengatur alam semesta dengan perhitungan yang detail. Waktu fajar adalah waktu yang diberkahi, sebagai waktu orang-orang beriman mulai bangkit dari tidur untuk memulai kembali kehidupan setelah kematian sementara, yang kemudian dilanjutkan dengan mendirikan shalat. Adapun sepuluh malam yang dimaksud adalah sepuluh hari pertama bulan Dzulhijjah yang merupakan waktu pelaksanaan ibadah haji. Ini merupakan hari-hari yang diberkahi sebagaimana disebutkan dalam banyak riwayat yang shahih. Pada hari-hari ini orang-orang beriman menjalankan ibadah dan ketaatan. Sedangkan ‘Syaf’u’ yakni sesuatu yang genap, yaitu hari penyembelihan (10 Dzulhijjah). Sedangkan ‘Watr’ yakni suatu bilangan ganjil, yaitu hari Arafah (9 Dzulhijjah). Dan Allah bersumpah demi malam jika berlalu dan mulai hilang kegelapannya hingga lenyap seluruhnya oleh sinar pada siang hari. Wantu malam bergerak sesuai dengan perhitungan yang telah Allah tetapkan, dan ini merupakan salah satu peristiwa yang menunjukkan kekuasaan Allah dan keluarbiasaan ciptaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالْفَجْرِ (Demi fajar) Allah bersumpah dengan waktu fajar karena itu adalah waktu terpecahnya kegelapan oleh siang hari. Mujahid berpendapat: yang dimaksud adalah waktu fajar pada hari 10 Dzulhijjah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Mahasuci dzat yang memuliakan ummat ini, dan membuka baginya dengan tangan nabinya yang penuh kasih sayang pintu-pintu keutamaan dan kemuliaan yang banyak, dan tidaklah suatu kaum melakukan suatu amalan yang besar dan amalan tersebut tidak diberikan kepada kaum lainnya melainkan Allah telah menjadikan suatu amalan untuk mengalahkan kaum lainnya, atau mendahulukan kaum tersebut diatas kaum lainnya, sehingga setiap kaum berada diatas keutamaan yang sama. 2 ) . Diantara sebab penyebutan ayat : { وَلَيَالٍ عَشْرٍ } yaitu 10 hari yang telah dikenal oleh orang-orang yang telah mendengarkan tentangnya, yang dikenal dengan hari yang sepuluh, dan dalam penyebutannya bukan dengan ( الليالي العشر ) karena penyebutan lafazh ini dengan tanwin adalah pengagungan untuknya, dan tidaklah hari-hari dalam satu tahun 10 hari yang agung berturut-turut seperti 10 hari dzulhijjah yang didalamnya kaum muslimin menunaikan ibadah haji, ihram, masuknya kaum muslim dari berbagai belahan dunia ke kota Makkah, thowaf, yaum tarwiyah pada hari kedelapan, dan wukuf di arafah pada hari kesembilan, dan pada hari kesepuluh hari qurban. 3 ) . Pada sepuluh hari inilah dahulu para sahabat memanfaatkan dengan sebaik-baiknya untuk memperbanyak ibadah, dan dialah 10 hari yang paling utama secara muthlak, karena pada hari itu berbagai keutamaan dan amalan-amalan yang besar berkumpul, yang pada hari-hari lainnya keutamaan tersebut tidak ada; seperti shalat, puasa dan sedekah, dan berkumpulnya kaum muslimin pada hari itu tidak sama dengan perkumpulan mereka pada hari-hari lainnya, dan diantara amalan yang paling besar pada hari itu adalah haji ke baitullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Annasai – seperti di riwayat sebelumnya – dari Jabir berkata: Kerika Mu’adz sholat, datanglah pemuda yang bermakmum kepadanya, Mu’adz memanjangkan bacaan sholatnya. Sehingga makmum itu sholat sendiri di salah satu pojok masjid dan memisahkan diri. Lalu Mu’adz memarahinya dengan berkata, “Munafik.” Sehingga disampaikanlah kabar ini kepada Rasul. Maka pemuda itu bertanya kepada Rasul SAW: Wahai Rasul, saya baru makmu sholat dengan Mu’adz. Kemudian dia memanjangkan bacaan suratnya. Kemudian saya memutuskan untuk memisahkan diri dari jamaah, dan sholat di pojok masjid, karena saya menali unta betina saya.” Rasul menjawab: “Wahai Mu’adz, apakah kamu sudah menjadi pembuat fitnah? Mengapa, tidak kamu baca sabbih isma rabbika al a’la, atau wasy syamsi wa dluhaha, atau wal fajr, atau wal lail idza yaghsya saja?” 1-2. Aku (Allah) bersumpah demi matahari: Matahari yang terbit setiap hari. Waktu dimana kegelapan beranjak dari malam. Dan demi 10 malam bulan Dzulhijjah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi waktu fajar} Aku bersumpah demi waktu fajar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Zahirnya, apa yang disumpahkan itulah yang menjadi obyek sumpah. Hal ini boleh dan lazim digunakan bila obyek sumpah berupa sesuatu yang zahir dan penting. Dan seperti itu juga dalam ayat ini. Allah bersumpah dengan waktu fajar, yaitu penghujung malam dan permulaan siang. Karena di waktu akhir malam dan permulaan siang terdapat tanda-tanda kebesaran Allah yang mengatur seluruh hal, yang menunjukkan kekuasaanNya yang sempurna. Dialah yang mengatur seluruh hal, yang hanya kepadaNya-lah ibadah layak ditunaikan. Di saat fajar, terdapat shalat utama lagi diagungkan yang baik untuk dijadikan sebagai obyek sumpah oleh Allah. Karena itu, setelahnya Allah bersumpah dengan sepuluh malam yang menurut pendapat yang benar adalah sepuluh malam di bulan Ramadhan atau sepuluh hari di bulan Dzulhijjah. Karena malam-malam tersebut mencakup hari-hari mulia, yang di dalamnya berlaku berbagai macam ibadah dan dan pendekatan diri yang tidak terdapat pada waktu lain. Pada sepuluh malam terakhir bulan Ramadhan terdapat malam lailatul qadar, yaitu malam yang lebih baik dari seribu bulan dan pada siang harinya terdapat puasa di akhir akhir bulan Ramadhan yang merupakan salah satu rukun Islam yang agung. Pada sepuluh hari di bulan Dzulhijjah terdapat wuquf di Arafah yang pada saat itu Allah memberikan ampunan kepada para hambaNya yang membuat setan sedih. Setan tidak terlihat lebih hina dan kalah melebihi kehinaan dan kekalahannya di hari Arafah karena banyaknya malaikat dan rahmat yang turun dari Allah untuk para hambaNya. Pada hari itu, kebanyakan kegiatan haji dan umrah dilakukan. Semua itu adalah hal-hal agung yang berhak dijadikan sumpah oleh Allah. “Dan demi malam bila berlalu,” yakni saat berlalu dan menurunkan kegelapannya atas manusia sehingga mereka menjadi tenang, nyaman, dan tentram sebagai rahmat dan hikmah dari Allah. “Pada yang demikian itu,” yang disebutkan sebelumnya, “terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal,” yakni untuk orang yang berakal sehat. Ya, sebagian dari hal itu cukup bagi orang-orang yang memiliki akal atau mendengar sebagai yang menyaksikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada permulaan surah ini Allah ﷻ memulainya dengan beberapa sumpah yang diulang penyebutannya, Allah ﷻ bersumpah dengan ayat-ayat kauniyah-Nya, hal itu mengisyaratkan kepada keagungan, kekuasaan, hikmat, dan haknya Allah ﷻ atas peribadatan hanya kepada-Nya tanpa adanya persekutuan selain dari-Nya ﷻ , adapun penyebutan sumpah yang berulang adalah kehendak Allah ﷻ yang dengan apapun dari makhluk-Nya Dia ingin bersumpah, sedangkan makhluk tidak berhak bagi mereka bersumpah dengan selain Allah ﷻ , karena bersumpah dengan selain Allah ﷻ adalah kesyirikan dan kekufuran, seperti yang dikutip dalam sebuah hadits Nabi ﷺ bersabda : (( من حلف بغير الله فقد كفر أو أشرك )) \" Barangsiapa yang bersumpah dengan menyebut selain Allah, maka ia telah berbuat kekafiran atau kemusyrikan \" Diriwayatkan oleh Imam Turmudzi, dan ia nyatakan hadits ini hasan, dan oleh Al-Hakim hadits ini shoheh. { وَالْفَجْرِ } Demi waktu Fajr, dan maksud dari waktu Fajr adalah : waktu terbitnya matahari di awal siang hari, dinamakan \"fajr\" dari kata \"infijar\" ( meledak / melepas ) yakni melepasa diri dari kegelapan malam, itulah sebabnya waktu ini dinamakan \"fajr\" , yaitu awal waktu dari siang hari, sebagaimana yang tertulis dalam firman Allah : { وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ } ( dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar ) [ Al-Baqarah : 187 ] , dan saat itu pula waktu diwajibkannya shalat subuh, dalam ayat lain Allah ﷻ berfirman : { وَقُرْآنَ الْفَجْرِ } ( dan (dirikanlah pula shalat) subuh ) [ Al-Isra' : 78 ] . Allah bersumpah dengan waktu fajar karena darinya manusia mengambil pelajaran dan ibroh, dan juga merupakan dalil akan kekuasaan Allah, maha suci Allah ﷻ dengan segala kekuasaan-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالْفَجْرِ (1) وَلَيَالٍ عَشْرٍ (2) وَالشَّفْعِ وَالْوَتْرِ (3) وَاللَّيْلِ إِذَا يَسْرِ \" Demi fajar, dan malam yang sepuluh, dan yang genap dan yang ganjil, dan malam bila berlalu.\" Semua ini adalah sumpah-sumpah, atas ana fajar, Malam yang sepuluh, yang genap dan yang ganjil dan malam apabila berlalu, lima hal Allah Ta'ala bersumpah dengannya. Pertama: fajar, dia adalah cahaya yang mencul dari ujung ufuk timur sebelum terbitnya matahari, jangka waktu antara munculnya fajar dengan terbitnya matahari adalah antara satu jam tga puluh dua menit hingga satu jam tujuh belas menit, perbedaannya tergantung perbedaan musim-musim, terkadang waktunya lebih panjang hingga terbitnya matahari dan terkadang lebih cepat tergantung musim-musimnya. Fajar ada dua: Fajar shadiq dan fajar kazib, fajar yang dimaksudkan dalam ayat ini adalah fajar shadiq. Perbedaan fajar shadiq dengan fajar kazib ada tiga sisi: Pertama: Fajar kazib bentuknya ke atas langit, bukan muncul secara luas tetapi dia memanjang, sedangkan fajar shadik membantang dari selatan ke utara. Perbedaan kedua: Fajar shadiq tidak ada gelap malah setelah kemunculannya, bahkan akan semakin terang hingga matahari terbit, ada pun fajar kazib akan datang gelap malam setelah kemunculannya, oleh karenanya disebut kazib (bohong), karena ia akan menghilang. Perbedaan ketiga: Fajar shadik bersambung dengan munculnyta cahaya ufuk, sedangkan di antara fajar kazib dengan shadiq ada kegelapan, tiga perbedaan ini diketahui oleh manusia jika mereka berada di tanah yang datar, sedangkan di kota-kota mereka tidak akan tahu karena cahaya-cahaya lampu menghalangi tanda-tanda etrsebut. Allah bersumpah dengan fajar karena ia dalah permbulaan waktu siang, yaitu berfirmdahnya kegelapan kepada cahaya fajar yang bersinar, Allah bersumpah dengan fajar kerena tidak ada yang mampu mendatangkannya kecuali Allah 'Azza Wa Jalla, sebagaimana Allah Tabaaraka Wa Ta'ala: قُلْ أَرَأَيْتُمْ إِنْ جَعَلَ اللَّهُ عَلَيْكُمُ اللَّيْلَ سَرْمَدًا إِلَى يَوْمِ الْقِيَامَةِ مَنْ إِلَهٌ غَيْرُ اللَّهِ يَأْتِيكُمْ بِضِيَاءٍ أَفَلَا تَسْمَعُونَ \" Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?\"(QS. Al-Qashahs: 71) Allah bersumpah dengan fajar karena ia berkaitan dengan hokum-hukum shari'at, seperti: Mualainya puasa orang yang berpuasa, karena orang yang puasa saat mucul fajar, ia wajib menahan pembatal puasa jika puasanya yang wajib atau yang sunnah, jika ia ingin menyempurnakan puasanya. Terkait juga dengan ,asuknya waktu sholat fajar (subuh), keduanya adalah hokum syari'at yang besar, dan yang paling penting adalah masuknya waktu shalat. Maksudnya: Kewajiban untuk memperhatikan waktu fajar karena masuknya waktu shalat lebih banyak daripada perhatian kita terhadap waktu dimulainya menahan saat puasa, karena saat menahan dari pembatal-pembatal puasa seandainya kita salah menentukan waktu maka kita tetapkan bahwa waktunya masih malam (belum masuk), sedangkan dalam shalat seandainya kita salah dan kita shalat sebelum masuk waktu fajar maka kita tidak bisa menetapkan pada asalnya (belum masuk waktu) karena asalahnya adalah masih tetap pada malam dan belum masuk waktu shalat, kerenanya andai ada seseorang yang shalat subuh satu menit sebelum tiba waktunya maka shalatnya adalah nafilah (sunnah) dan ia belum terlepas dari tanggungan wajibnya shalat. Dari sinilah kami menyeru anda untuk memperhatika masalah ini, yakni memperhatikan masuknya waktu shalat subh, karena banyak para muazin yang azan sebelum masuknya waktu shalat, ini adalah kesalahan, karena azan sebelum memasuki waktu shalat tidak disyari'atkan, berdasarkan sabada Nabi shallallaahu 'alaihi wa sallam: إِذَا حَضَرَتِ الصَّلَاةُ فَلْيُأَذِّنْ لَكُمْ أَحَدُكُمْ \"Jika shalat tiba maka hendaknya salah seorang kalian mengumandangkan azan\"(1) datangnya shalat adalah saat memasuki waktunya, maka jika ada seseorang yang azan sebelum masuknya waktu shalat maka azannya tidak sah, dan wajib menguangnya, sehinggga memperhatikan masuknya waktu fajar sangatlah penting karena untuk memperhatikan masuknya waktu shalat. (1) Dikeluarkan Bukhari (628) dan Muslim (674) dari hadits Malik Bin Huwairits radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 1: 1-4. Allah memulai dalam surat ini dengan sumpah, dimana Allah bersumpah dengan waktu fajar yang terang sinarnya. Allah juga bersumpah dengan waktu malam yang ke sepuluh dzulhijjah. Allah bersumpah dengan bilangan genap dan ganjil pada segala sesuatu. Allah bersumpah dengan malam yang telah pergi (berlalu) kegelapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 1",
    "description": "1-4. Demi fajar, yaitu awal mula terangnya bumi setelah kegelapan malam sirna. Pada waktu ini manusia memulai aktivitasnya. Di balik kemunculan fajar itu pasti ada zat yang mahaperkasa. Demi malam yang sepuluh, yaitu sepuluh hari pertama bulan zulhijah. Mereka yang beramal saleh pada hari-hari tersebut akan mendapat pahala yang sangat agung. Demi yang genap dan yang ganjil dari semua hal. Bisa juga dipahami bahwa yang genap itu adalah makhluk Allah, sedangkan yang ganjil adalah Allah. Dia maha esa dan tanpa bandingan. Allah tidak membutuhkan apa dan siapa pun, sedang makhluk sangat bergantung pada yang lain. Demi malam apabila berlalu dan digantikan siang"
  }
]