[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Juga bagimana Allah berbuat terhadap fir’aun (raja mesir) pemilik bala tentara yang menguatkan kekuasaannya dan mendukung perintahnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Tidakkah kamu perhatikan bagaimana Rabbmu berbuat terhadap Fir’aun yang sebelumnya ia mempunyai bala tentara, untuk menyiksa manusia?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-13. Hai Rasulullah, lihatlah kepada Fir’aun yang memiliki kerajaan yang kuat; dia memiliki pasukan yang tersebar luas untuk membela kerajaannya, pasukan itu bagaikan pasak-pasak baginya. Akan tetapi orang-orang zalim itu melakukan banyak kemaksiatan yang melewati batas terhadap budak-budak mereka, dan jauh dari petunjuk Allah; sehingga mereka selalu berbuat kerusakan dan angkuh terhadap para nabi Allah, dan orang-orang beriman, serta merampas hak-hak orang lain. Inilah yang mengundang kemurkaan Allah. Allah telah menimpa kaum-kaum tersebut dengan azab terberat. Dan makna (سوط) dalam ungkapan orang-orang arab, yakni azab yang paling berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَفِرْعَوْنَ ذِى الْأَوْتَادِ (dan kaum Fir’aun yang mempunyai pasak-pasak(tentara yang banyak)) Yakni piramida yang dibangun oleh raja-raja Fir’aun untuk dipakai sebagai kuburan mereka, mereka memaksa rakyat mereka untuk membangunnya. Pendapat lain mengatakan yang dimaksud dengan (ذي الأوتاد) yakni memiliki banyak tentara yang mempunyai banyak kemah-kemah yang dibangun dengan pasak-pasak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Kaum Tsamud adalah suku Arab zaman dulu, yaitu kaum nabi Sholih. Mereka tinggal di bebatuan antara Syam dan Hijaz. Mereka yang memotong bebatuan dan menjadikannya sebagai rumah. Di batu atau canyon Al qura, yang melewati jalan menuju Syam dari Madinah Munawwaroh. Adapun Fir’aun lebih dari itu, yaitu pemilik bangunan yang besar yang menyerupai gunung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Fir‘aun yang mempunyai pasak-pasak} pasak-pasak untuk menghukum orang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَفِرْعَوْنَ } Kemudian ada Fir'aun Mesir, dan \"Fir'aun\" adalah gelar yang disandangkan kepada raja-raja mesir zaman dahulu, raja-raja trdahulu yang berkuasa di Mesir disebut \"FIr'aun\" , sebagaimana raja Babil disebut \"An Numrud\" , dan raja Habasyah disebut \"An Najasyi\" , dan ada penguasa Yaman yang disebut \"Al Qil\" , dan raja Persia disebut \"Kisra\" , begitu juga dengan penguasa Roma yang disebut \"Kaisar\" , semua gelar-gelar diatas pernah disandangkan kepada raja-raja terdahulu, sebagian gelar itu masih digunakan hingga saat ini, dan diantara raja-raja itu ada \"Fir'aun\" . Fir'aun bukanlah nama orang melainkan gelar atau sebutan khusus untuk para raja-raja yang pernah memimpin Wilayah Mesir pad zaman jahiliyah dan zaman sebelum datangnya Islam, Namun \"Fir'aun\" yang dimaksud dalam ayat ini adalah Fir'aun atau raja Mesir yang kepadanya Nabi Musa - عليه السلام - diutus, seorang raja yang sombong dan mengakui bahwa dirinya adalah tuhan, Allah berfirman dengan mengutip pernyataan Fir'aun : { فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ } ( (Seraya) berkata: “Akulah tuhanmu yang paling tinggi”. ) [ An Nazi'at : 24 ] , di ayat lain Allah menukilkan perkataan \"Fir'aun\" : { وَقَالَ فِرْعَوْنُ يَا أَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُمْ مِنْ إِلَٰهٍ غَيْرِي } ( Dan berkata Fir’aun: “Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku. ) [ Al-Qashash : 38 ] , kekuasaan dan kekuatan lah yang menjadikan dia berbuat demikian. { ذِي الْأَوْتَادِ } Fir'aun yang sombong itu memiliki bala tentara yang sangat besar, disebut sebagai \"أوتاد \" atau pasak, karena tentara-tentara itu telah menobatkan Fir'aun sebagai raja Mesir, sebagaimana mereka mengokohkan rumah-rumah dengan pasak yang kuat, dalam riwayat lain mengatakan : karena jumlah mereka yang begitu besar sehingga sebagian mereka tinggal dalam tenda yang mereka dirikan degan bantuan pasak sebagai penguatnya,, jumlah tentara yang begitu banyak, sampai memenuhi seluruh wilayah Mesir saat itu, dan apakah kekuasaannya itu bermanfaat baginya .. ? sama sekali tidak memberikan manfaat bagi dirinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَفِرْعَوْنَ Firaun adalah raja yang Allah utus kepadanya Nabi Musa 'alaihissholaatu wassalaam, ia telah merendahkan bani Israil, menyembelih anak-anak laki-laki mereka, dan membiarkan hidup anak-anak perempuan mereka. Para ulama berselisih pendapat tentang sebab firaun melakukan perbuatan kejinya itu, mengapa yang dibunuh anak laki-laki dan membiarkan anak perempuan? Sebagian ulama mengatakan: Para peramalnya mengatakan sesungguhnya akan terlahir seorang dari kalangan bani Israil yang akan menyebabkannya binasa, maka dari itu ia membunuh anak laki-laki dan membiarkan anak perempuan. Di antara ulama ada yang mengatakan: Ia melakukan kejahatan itu agar melemahkan bani Israil , karena jika suatu umat dibunuh anak-anak laki-lakinya dan dibiarkan perempuannya kaum tersebut akan melemah tanpa diragukan. Alasan pertama adalah sebab yang diutarakan ahlul-atsar, yang kedua adalah sebab yang diutarakan oleh ulama yang menyandarkan dengan pengamatan akal, namun tidak jauh, jika diterapakan keduanya menjadi sebab perbuatan fir'aun tersebut. Tetapi karena taqdir Allah 'Azza Wa Jalla, lelaki yang menyebabkan kehancuran fir'aun dengan tangannya, terdidik di rumah fir'aun sendiri, Istri fir'aun memungutnya dan merawatnya di rumah fir'aun. Sedangkan fir'aun sombong dan angkuh di bumi, ia berkata kepada kaumnya: أَنَا رَبُّكُمُ الْأَعْلَى \" Akulah tuhanmu yang paling tinggi \"(Qs. An-Nazi'at: 24) dan berkata kepada mereka: مَا عَلِمْتُ لَكُمْ مِنْ إِلَهٍ غَيْرِي \" aku tidak mengetahui tuhan bagimu selain aku. \"(QS. Al-Qashahs: 38), berkata juga: أَمْ أَنَا خَيْرٌ مِنْ هَذَا الَّذِي هُوَ مَهِينٌ \" Bukankah aku lebih baik dari orang yang hina ini \" Maksudnya Nabi Musa. وَلَا يَكَادُ يُبِينُ \" dan yang hampir tidak dapat menjelaskan (perkataannya)? \" Allah Ta'ala berfirman: فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ \" Maka Firaun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. \"(QS. Az-Zukhruf: 54) ia juga berkata kepada kaumnya untuk menetapkan يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَذِهِ الْأَنْهَارُ تَجْرِي مِنْ تَحْتِي أَفَلَا تُبْصِرُونَ \" Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku dan (bukankah) sungai-sungai ini mengalir di bawahku; maka apakah kamu tidak melihat (nya)? \"(QS. Az-Zukhruf: 51) dia berbangga dengan sungai-sungai dan airnya, tapi ia pun ditenggelamkan dengan air. ذِي الْأَوْتَادِ \" yang mempunyai pasak-pasak (tentara yang banyak), \" Maknanya: Memiliki kekuatan, karena tentara-tentaranya bagai pasak yang mneguhkannya, pasak bumi mengikat tali-taki tenda sehingga menetap dan kokoh, Ia mempunya tentara-tentara orang-orang terdahulu, berupa penyihir, peramal dan yang lainnya tetapi Allah lebih tinggi dari segalanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 10: Dan apakah kalian tidak melihat wahai manusia, kepada Fir’aun yang memiliki pasak-pasak yaitu pyramid dan bangunan yang besar dimana penguasanya adalah Fir’aun dan yang sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan ‘pasak-pasak’ di sini dengan tentara-tentara yang mengokohkan kerajaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 10",
    "description": "Dan tidakkah kamu juga memperhatikan azab Allah kepada fir'aun yang mempunyai pasak-pasak' Allah mengazabnya meski ia mampu membangun piramida-piramida yang besar dan mempunyai bala tentara yang banyak. 11. Mereka itulah orang-orang yang berbuat sewenang-wenang dalam negeri dan berbuat zalim melewati batas kemanusiaan."
  }
]