[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Orang-orang yang berkuasa dan berbuat zhalim di negeri negeri Allah, Lalu mereka memperbanyak kerusakan karena kezhaliman mereka, Maka tuhanmu menuangkan azab yang berat kepada mereka. Sesungguhnya tuhanmu (wahai rasul), selalu mengawasi siapa yang mendurhakaiNYa, memberinya tempo sesaat kemudian menyiksanya dengan siksaan dzat yang maha perkasa lagi mahakuasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Semua yang disebutkan itu telah melampaui batas kekejaman dan penganiayan. Masing-masing melampaui batas di negerinya sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. الَّذِينَ طَغَوْا۟ فِى الْبِلٰدِ (yang berbuat sewenang-wenang dalam negeri) Ini adalah sifat kaum Aad, Tsamud, dan Fir’aun. Yakni setiap mereka telah melakukan kezaliman dan kedurhakaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Mereka –kaum ‘Ad, Tsamud dan Fir’aun) adalah kaum menentang dan durhaka di negeri mereka, mereka telah melewati batas dalam berbuat zalim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang berbuat sewenang-wenang} yang melampaui batas dalam berbuat kezaliman dan permusuhan {dalam negeri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kaum 'Ad, Tsamud, dan Fir'aun beserta bala tentranya telah mengingkari ketuhanan dan Keesaan Allah ﷻ di kota-kota mereka, yakni kota-kota yang telah Allah ﷻ hamparkan untuk mereka dengan berbagai kenikmatan didalamnya, mereka telah melampaui batas-batas yang telah Allah ﷻ tetapkan, mereka enggan menyembah Allah ﷻ, bahkan mereka menganiaya hamba-hamba Allah ﷻ yang berman dan bertaqwa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الَّذِينَ طَغَوْا فِي الْبِلَادِ \" yang berbuat sewenang-wenang dalam negeri, \" Thughyan: Melampaui batasan, di antara contohnya adalah firman-Nya Ta'ala: إِنَّا لَمَّا طَغَى الْمَاءُ حَمَلْنَاكُمْ فِي الْجَارِيَةِ \" Sesungguhnya Kami, tatkala air telah naik (sampai ke gunung) Kami bawa (nenek moyang), kamu ke dalam bahtera, \"(QS. Al-Haqqah: 11) Maknanya: Ketika air itu bertambah maka kami membawa kalian ke bahtera, yaitu dengan perahu yang dibuat oleh Nuh 'alaihissholaatu wassalaam, maka makna: طَغَوْا فِي الْبِلَادِ Maknanya: Mereka melampaui batasan mereka, dan menzalimi hamba-hamba Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 11: 11-13. Allah menjelaskan keadaan mereka para pendahulu yang telah disebutkan yaitu dari Ad, Tsamud dan Fir’aun yang telah melampaui batas, sombong dan kekufurannya telah melampaui batas. Mereka adalah orang-orang yang sombong dalam menggunakan kekuasaannya dalam ketidak adilan terhadap hak-hak manusia dan dzalim. Dan itulah (mereka) yang menyebabkan rusaknya negara (mereka). Maka Allah hukum dengan menerunkan bagi mereka adzab yang keras, dan Allah ambil kekuasaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sifat ini tertuju kepada kaum ‘Aad, Tsamud, Fir’aun dan orang-orang yang mengikuti mereka, karena mereka berbuat sewenang-wenang di negeri Allah dan menganggu hamba-hamba Allah baik agama mereka maupun dunia mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 11",
    "description": "Mereka itulah orang-orang yang berbuat sewenang-wenang dalam negeri dan berbuat zalim melewati batas kemanusiaan. 12. Lalu mereka dengan kezalimannya banyak berbuat kerusakan, dosa, dan maksiat dalam negeri itu."
  }
]