[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Orang-orang yang berkuasa dan berbuat zhalim di negeri negeri Allah, Lalu mereka memperbanyak kerusakan karena kezhaliman mereka, Maka tuhanmu menuangkan azab yang berat kepada mereka. Sesungguhnya tuhanmu (wahai rasul), selalu mengawasi siapa yang mendurhakaiNYa, memberinya tempo sesaat kemudian menyiksanya dengan siksaan dzat yang maha perkasa lagi mahakuasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Lalu mereka berbuat banyak kerusakan karena kekufuran dan kemaksiatan yang mereka sebarkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. فَأَكْثَرُوا۟ فِيهَا الْفَسَادَ (lalu mereka berbuat banyak kerusakan dalam negeri itu) Dengan kekafiran dan kemaksiatan kepada Allah serta kezaliman terhadap hamba-hamba Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Di negeri mereka terlalu banyak kerusakan seperti kekufuran, maksiat seperti penyiksaan dan menzalimi sesama manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga banyak berbuat kerusakan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mereka banyak berbuat kerusakan didalamnya dengan kemasiatan dan pelanggaran-pelanggaran syari'at, karena suatu wilayah rusak karena banyaknya kemaksiatan di tempat itu, dan akan membaik dengan ibdah yang dilakukan di tempat itu, Allah berfirman : { وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا } ( Dan janganlah kamu membuat kerusakan di muka bumi, sesudah (Allah) memperbaikinya ) [ Al-A'raf : 52 ] , bagaimana Allah memperbaiki bumi ini ? ,yaitu dengan mengutus kepadnya Rasul dan Nabi-mabi yang menyebarkan kebaian dan kasih sayang, juga dengan diturunkannya kitab suci, dan bumi ini akan rusak dengan kemaksiatan yang berlaku diatasnya, Allah berfirman : { ظَهَرَ الْفَسَادُ فِي الْبَرِّ وَالْبَحْرِ بِمَا كَسَبَتْ أَيْدِي النَّاسِ لِيُذِيقَهُمْ بَعْضَ الَّذِي عَمِلُوا لَعَلَّهُمْ يَرْجِعُونَ } ( Telah nampak kerusakan di darat dan di laut disebabkan karena perbuatan tangan manusi, supay Allah merasakan kepada mereka sebahagian dari (akibat) perbuatan mereka, agar mereka kembali (ke jalan yang benar) ) [ Ar-Rum : 41 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَأَكْثَرُوا فِيهَا الْفَسَادَ \" lalu mereka berbuat banyak kerusakan dalam negeri itu, \" Maknanya: Kerusakan maknawi (berupa kemaksiatan). Kerusakan maknawi akan diiringi oleh kerusakan fisik (seperti terjadi musibah-musibah), dalilnya adalah firman Allah Tabaraka wa Ta'ala: وَلَوْ أَنَّ أَهْلَ الْقُرَى آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِنَ السَّمَاءِ وَالْأَرْضِ وَلَكِنْ كَذَّبُوا فَأَخَذْنَاهُمْ بِمَا كَانُوا يَكْسِبُونَ \" Jika sekiranya penduduk negeri-negeri beriman dan bertakwa, pastilah Kami akan melimpahkan kepada mereka berkah dari langit dan bumi, tetapi mereka mendustakan (ayat-ayat Kami) itu, maka Kami siksa mereka disebabkan perbuatannya. \"(QS. Al-A'raf: 96) Oleh karenanya sebagian Ulama mengatakan tentang makna firman Allah Ta'ala: وَلَا تُفْسِدُوا فِي الْأَرْضِ بَعْدَ إِصْلَاحِهَا \" Dan janganlah kamu membuat kerusakan di muka bumi, sesudah (Allah) memperbaikinya \"(QS. Al-A'raf: 56) Para ulama mengatakan: Jangan merusak bumi dengan kemaksiatan-kemaksiatan, atas dasar itu maka firman Allah : فَأَكْثَرُوا فِيهَا الْفَسَادَ \" lalu mereka berbuat banyak kerusakan dalam negeri itu, \" Maknanya: Kerusakan secara makna, tetapi kerusakan maknawi akan menimbulkan kerusakan fisik, dan ini sudah terjadi pada umat-umat terdahulu, bahwa Allah Ta'ala membinasakan orang-orang yang mendustakan sampai ke akarnya, tetapi Umat ini Allah angkat hukuman tersebut dan menjadikan hukuman itu berupa perselisihan di antara mereka, saling membinasakan satu dengan yang lainnya, atas dasar itulah maka tidak ada perpacahan yang terjadi berupa peperangan di antara sesame mereka, dan saling membinasakan di antara sesama mereka, melainkan disebabkan oleh kemaksiatan-kemaksiatan dan dosa-dosa, dan Allah jadikan mereka saling menjajah, dan ini adalah bentuk hukuman dari Allah Subhaanahu wa Ta'ala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 12: 11-13. Allah menjelaskan keadaan mereka para pendahulu yang telah disebutkan yaitu dari Ad, Tsamud dan Fir’aun yang telah melampaui batas, sombong dan kekufurannya telah melampaui batas. Mereka adalah orang-orang yang sombong dalam menggunakan kekuasaannya dalam ketidak adilan terhadap hak-hak manusia dan dzalim. Dan itulah (mereka) yang menyebabkan rusaknya negara (mereka). Maka Allah hukum dengan menerunkan bagi mereka adzab yang keras, dan Allah ambil kekuasaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu melakukan kekafiran dengan segala macam cabang-cabangnya yang terdiri dari berbagai macam kemaksiatan, memerangi para rasul, menghalangi manusia dari jalan Allah dan lain-lain. Ketika mereka telah melampaui batas bertindak demikian, maka Allah Subhaanahu wa Ta'aala mengazab mereka sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 12",
    "description": "Lalu mereka dengan kezalimannya banyak berbuat kerusakan, dosa, dan maksiat dalam negeri itu. 13. Karena kesewenangan dan kezaliman mereka itu tuhanmu menimpakan cemeti azab kepada mereka. Allah membinasakan kaum 'ad dengan topan yang sangat dingin selama tujuh malam berturut-turut; kaum 'amud dengan suara menggelegar dan petir yang menyambar (lihat:fussilat/41:16; al-h'qqah:/69:6'7); dan fir'aun beserta tentaranya ditenggelamkan di laut merah."
  }
]