[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Orang-orang yang berkuasa dan berbuat zhalim di negeri negeri Allah, Lalu mereka memperbanyak kerusakan karena kezhaliman mereka, Maka tuhanmu menuangkan azab yang berat kepada mereka. Sesungguhnya tuhanmu (wahai rasul), selalu mengawasi siapa yang mendurhakaiNYa, memberinya tempo sesaat kemudian menyiksanya dengan siksaan dzat yang maha perkasa lagi mahakuasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Maka Allah menimpakan kepada mereka siksa-Nya yang pedih dan memusnahkan mereka dari bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ (karena itu Tuhanmu menimpakan kepada mereka cemeti azab) Yakni Allah benar-benar menyiksa mereka dengan azab yang keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Maka Allah menurunkan kepada mereka satu contoh siksa yang sesuai untuk hukuan atas perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Tuhanmu menimpakan} menimpakan {kepada mereka, cemeti azab} bagian azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka tuhanmu menimpakan atas mereka azab yang sangat pedih, mereka dicambuk dengan keras menggunkan cemeti azab, itu didunia, dan azab akhirat akan lebih pedih sikasaannya, penyebabnya adalah : kekafiran yang masih mereka jaga dalam diri, mereka merusak bumi dengan kemaksiatan dan pelanggaran-pelanggaran syari'at, inilah sebab-sebab yang membawa mereka kepada kesengsaraan dan kebinasaan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَصَبَّ عَلَيْهِمْ رَبُّكَ \"\" Ash-Shabb (menuang) diketahui dilakukan dari atas, dan siksa yang datang kepada mereka dari atas dari sisi Allah 'Azza Wa Jalla, سَوْطَ عَذَابٍ \"\" As-sauth adalah cambuk untuk memukul, dan diketahui bahwa memukul dengan cambuk adalah satu bentuk siksaan. Tepapi apakah cambuk yang Allah ta'ala pukulkan kepada kaum 'Ad, tsamud dan fir'aun, apakah cambuk ini adalah cambuk yang kita ketahui, ataukah itu adalah cambuk siksaan yang membinasakan mereka? jawabannya adalah tongkat yang kedua, yaitu tongkat siksaan yang membinasakan dan menghancurkan mereka, kita memohon kepada Allah agar menjadikan kejadian-kejadian umat-umat terdahulu sebagai ibroh bagi kita, yang bisa kita petik pelajaran dan manfaatnya bagi kita, dan kita menjadi orang-orang yang taat kepada Allah 'Azza wa Jalla, tidak melampaui batas, sesuangguh Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 13: 11-13. Allah menjelaskan keadaan mereka para pendahulu yang telah disebutkan yaitu dari Ad, Tsamud dan Fir’aun yang telah melampaui batas, sombong dan kekufurannya telah melampaui batas. Mereka adalah orang-orang yang sombong dalam menggunakan kekuasaannya dalam ketidak adilan terhadap hak-hak manusia dan dzalim. Dan itulah (mereka) yang menyebabkan rusaknya negara (mereka). Maka Allah hukum dengan menerunkan bagi mereka adzab yang keras, dan Allah ambil kekuasaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 13",
    "description": "Karena kesewenangan dan kezaliman mereka itu tuhanmu menimpakan cemeti azab kepada mereka. Allah membinasakan kaum 'ad dengan topan yang sangat dingin selama tujuh malam berturut-turut; kaum 'amud dengan suara menggelegar dan petir yang menyambar (lihat:fussilat/41:16; al-h'qqah:/69:6'7); dan fir'aun beserta tentaranya ditenggelamkan di laut merah. 14. Allah timpakan azab kepada mereka karena sungguh, tuhanmu benar-benar mengawasi gerak gerik dan perilaku mereka. Tidak seorang pun lepas dari pengawasan Allah. Kebinasaan tiga kaum itu hendaknya menjadi pelajaran bagi umat setelahnya, terutama kaum musyrik mekah."
  }
]