[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14. Orang-orang yang berkuasa dan berbuat zhalim di negeri negeri Allah, Lalu mereka memperbanyak kerusakan karena kezhaliman mereka, Maka tuhanmu menuangkan azab yang berat kepada mereka. Sesungguhnya tuhanmu (wahai rasul), selalu mengawasi siapa yang mendurhakaiNYa, memberinya tempo sesaat kemudian menyiksanya dengan siksaan dzat yang maha perkasa lagi mahakuasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sesungguhnya Rabbmu -wahai Rasul- benar-benar memantau dan mengawasi amal perbuatan manusia, untuk memberi balasan bagi yang berbuat baik dengan Surga dan yang berbuat buruk dengan Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Tidak ada amalan orang-orang zalim yang suka berbuat kerusakan itu yang dapat terlewat dari pengetahuan Allah, Dia akan menimpakan azab atas mereka, Dia adalah Tuhanmu hai Muhammad, Dia Maha Kuasa untuk mengazab orang-orang yang mendustakanmu, Maha Kuasa dalam mengawasi amalan setiap orang zalim untuk membalasnya atas kezaliman itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِنَّ رَبَّكَ لَبِالْمِرْصَادِ (sesungguhnya Tuhanmu benar-benar mengawasi) Yakni yang mengawasi segala amalan manusia agar Dia membalas kebaikan bagi orang bagi dan keburukan bagi orang jahat. Al-Hasan berkata: Allah mengawasi seluruh hamba-Nya, tidak ada yang terlewat dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sesungguhnya, Tuhanmu itu wahai Rasul, Maha Mengawasi dan Maha Melihat segala perbuatan hamba-Nya. Maka Dia akan memberi balasan baik perbuatan baik atau buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu benar-benar mengawasi} benar-benar mengawasi amal anak cucu Adam, agar Dia membalasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya tuhanmu benar-benar mengawasi amalan hamba-Nya dan akan membalasnya dengan pahala yang berlipat ganda."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Yang diajak bicara di sini adalah Nabi shallallaahu 'alaihi wa sallam, atau siapa saja yang cocok dijadikan lawan bicara, Allah 'Azza wa Jalla menjelaskan bahwa Dia senantiasa mengintai orang yang melampaui batas dan sombong. Sungguh dengan intaian-Nya, Dia akan menghukum dan menyiksanya. Banyak ayat yang semakna dengan ini dalam al-Quran al-Karim, di antaranya firman Allah Tabaaraka Wa Ta'ala: أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ دَمَّرَ اللَّهُ عَلَيْهِمْ وَلِلْكَافِرِينَ أَمْثَالُهَا \" Maka apakah mereka tidak mengadakan perjalanan di muka bumi sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka; Allah telah menimpakan kebinasaan atas mereka dan orang-orang kafir akan menerima (akibat-akibat) seperti itu. \"(QS. Muhammad: 10) Dan juga seperti perkataan nabi Syu'aib kepada kaumnya: وَيَا قَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِي أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَ قَوْمَ نُوحٍ أَوْ قَوْمَ هُودٍ أَوْ قَوْمَ صَالِحٍ وَمَا قَوْمُ لُوطٍ مِنْكُمْ بِبَعِيدٍ \" Hai kaumku, janganlah hendaknya pertentangan antara aku (dengan kamu) menyebabkan kamu menjadi jahat hingga kamu ditimpa azab seperti yang menimpa kaum Nuh atau kaum Hud atau kaum Saleh, sedang kaum Lut tidak (pula) jauh (tempatnya) dari kamu. \"(QS. Hud: 89) Sunnatullaah (ketentuan Allah) Subhaanahu wa Ta'ala satu kepada orang-orang yang mendustakan rasul-rasul-Nya, dan yang enggan beribadah kepada-Nya, yaitu dengan senantiasa dalam pengintaian siksa-Nya. Ayat ini memberikan faedah berupa ancaman dan peringatan bagi orang sombong, enggan beribadah kepada Allah atau mendustakan berita-Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 14: 14-16. Ketahuilah wahai Nabi Allah, bahwa Rabbmu akan mengawasi manusia di bumi, dan menghitung amalan mereka, dan membalas apa yang mereka kerjakan. Jika baik maka akan dibalas dengan kebaikan, jika buruk maka akan dibalas dengan keburukan. Kemudian Allah memisahkan mereka dengan berkata : Adapun manusia yang lalai dari Rabbnya, jika ia diberikan ujian kemudian diberikan nikmat oleh Allah dan diluaskan rezekinya sebagain pemulian dari Allah, maka mereka berkata : Tuhanku memuliakanku. Dan tidaklah muncul dalam benaknya bahwa telah diberikan ujuan baginya (dan diganti dengan nikmat dll.), dimana rasa syukurnya ? Apakah ia menganggap dan membalas nikmat Allah atasnya ?. Dan adapun jika ia melihat bawa rezekinya tak kunjung tiba kecuali hanya sedikit dan sulit, ia menyangka itu adalah hinaan dari Allah dan pelecehan atas dirinya, kemudian ia mengumpat dan menyalahkan Rabbnya dengan keburukan dan tidaklah ia melakukan kebaikan terhadap Tuhannya, ia absen dari kebaikan dalam kehidupannya yang semuanya adalah ujian dan hanya menimbulkan kerusakan. Dan barangsiapa yang sempir rezekinya, bersabar, dan bergantung (kepada Allah) serta besyukur kepada Allah atas segala sesuatunya, maka ia adalah orang yang berhasil secara hakiki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia mengawasi orang yang mendurhakai-Nya, Dia memberinya tangguh dan selanjutnya menghukumnya dengan hukuman dari Yang memiliki keperkasaan dan kekuasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 14",
    "description": "Allah timpakan azab kepada mereka karena sungguh, tuhanmu benar-benar mengawasi gerak gerik dan perilaku mereka. Tidak seorang pun lepas dari pengawasan Allah. Kebinasaan tiga kaum itu hendaknya menjadi pelajaran bagi umat setelahnya, terutama kaum musyrik mekah. 15. Ayat ini menjelaskan sifat dasar manusia kafir ketika mendapat kebahagiaan dan kesusahan, yakni bergembira berlebihan saat mendapat kenikmatan dan putus asa ketika tertimpa kesulitan. Maka adapun manusia, apabila tuhan mengujinya lalu dia memuliakannya dan memberinya kesenangan serta kenikmatan, baik lahir maupun batin, maka dia berkata, 'tuhanku telah memuliakanku. ' mereka menilai kenikmatan yang diterimanya adalah berkat kemuliaan nya di sisi Allah. Mereka lupa bahwa nikmat itu pada dasarnya salah satu bentuk ujian Allah kepada manusia."
  }
]