[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila manusia diuji oleh Tuhannya dengan memberinya kenikmatan, melapangkan rizkinya, dan membuatnya berada dalam kehidupan yang makmur,maka dia menyangka bahwa hal itu adalah karena kedudukan nya yang mulia disisi tuhannya, dia berkata “tuhanku memuliakanku”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Adapun manusia, di antara tabiatnya bahwa jika Rabbnya mengujinya dan memuliakannya, memberikan kenikmatan kepadanya berupa harta, anak-anak dan kedudukan, ia mengira bahwa hal itu karena kemuliaannya di sisi Allah, maka ia berkata, 'Rabbku telah memuliakanku karena aku berhak mendapatkan kemuliaan dari-Nya.'”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Orang-orang musyrik mengira peringatan Rasulullah bagi mereka tentang azab bukan peringatan yang benar, sebab itu bersebrangan dengan kenikmatan dan kemuliaan yang mereka dapatkan dari Allah. Akan tetapi Allah membantah anggapan mereka dalam firman-Nya: أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُم بِهِۦ مِن مَّالٍ وَبَنِينَ نُسَارِعُ لَهُمْ فِى ٱلْخَيْرَٰتِ ۚ بَل لَّا يَشْعُرُونَ Apakah mereka mengira bahwa harta dan anak-anak yang Kami berikan kepada mereka itu (berarti bahwa), Kami bersegera memberikan kebaikan-kebaikan kepada mereka? Tidak, sebenarnya mereka tidak sadar. (al-Mu’minun: 55-56). Mereka mengira berhak mendapat kenikmatan itu dan merasa keadaan mereka tidak akan berubah; maka Allah menyampaikan kepada Rasulullah hal yang sebenarnya dan menjelaskan kesalahan aggapan orang-orang jahil itu. Dan Allah menyampaikan kepada mereka bahwa keadaan di dunia tidak termasuk balasan atas amal perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. فَأَكْرَمَهُۥ وَنَعَّمَهُۥ (lalu dia dimuliakan-Nya dan diberi-Nya kesenangan) Yakni Allah memuliakan-Nya dengan harta dan keluasan rezeki. فَيَقُولُ رَبِّىٓ أَكْرَمَنِ (maka dia akan berkata: “Tuhanku telah memuliakanku”) Yakni dia menyangka itu semua merupakan kemuliaan, sehingga ia sangat gembira atas apa yang telah ia dapatkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mujahid berkata : \"Manusia menyangka bahwasanya kemuliaan yang Allah berikan kepada hamba-Nya dapat dinilai dari benyaknya harta yang ia miliki, dan sebaliknya kehinaan yang ditimpakan kepada seseorang adalah dengan sedikitnya harta yang ia miliki, tetapi sesungguhnya manusia itu telah bedusta, karena kemuliaan itu hanya dapat diraih dengan ketaatan kepada Allah, dan kehinaan akan menyelimuti kehidupan manusia dengan hilanganya ketaatan kepada sang pencipta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Adapun manusia, jika diuji dan diberi cobaan oleh Tuhannya dengan kekayaan dan kemudahaan, serta kenikmatan berupa kemuliaan dan harta benda, niscaya dia akan berkata: “Tuhanku memuliakanku dengan apa yang diberikan kepadaku dan menjadikanku sebagai orang yang mendapat kemuliaan atas hal itu.” Maknanya yaitu bahwa dia sombong dan lupa bersyukur kepada Allah SWT. Tujuan dari pemberian cobaan itu adalah membuat mereka berinteraksi dengan ujian tersebut dengan baik dan buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun manusia, apabila Tuhan mengujinya} mengujinya {lalu memuliakannya} lalu melapangkan rezekinya {dan memberinya kenikmata} lalu memberi dia kehidupan yang baik {dia berkata,“Tuhanku telah memuliakanku.\""
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-20. Allah mengabarkan tabiat manusia dari segi manusia itu sendiri. Manusia adalah sosok bodoh, zhalim, yang tidak mengetahui resiko berbagai hal. Ia mengira kondisi yang ada padanya akan terus berlanjut dan tidak akan hilang dan mengira bahwa kemuliaan serta kenikmatan Allah yang diberikan di dunia menunjukkan kemuliaannya di sisi Allah,dan ia mengira bila “rizkinya” disempitkan hingga makanannya hanya pas-pasan (tidak lebih), hal itu dikira sebagai penghinaan Allah terhadapnya. Allah menolak dugaan ini seraya berfirman, “sekali-kali tidak (demikian),” yakni tidak semua orang yang Aku beri kenikmatan di dunia adalah orang mulia di sisiKu dan tidak berarti orang yang rizkinya Aku sempitkan adalah orang hina di sisiKu. Kekayaan, kemiskinan, kelapangan, dan kesempitan hanyalah ujian dari Allah pada para manusia, agar Allah mengetahui siapakah yang bersyukur dan bersabar, sehingga Allah bisa memberikan balasan besar atas kesyukuran dan kesabaran itu, sedangkan yang tidak mau bersyukur dan bersabar, akan ditimpakan padanya siksaan yang mengerikan. Di samping itu, ketergantungan harapan seseorang pada keinginannya semata merupakan salah satu tanda lemahnya cita-cita. Karena itu Allah mencela mereka karena tidak memperhatikan kondisi orang lain yang memerlukan bantuan seraya berfirman, “Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,” yang kehilangan ayah dan orang yang mencarikan rizki baginya yang memerlukan pelipur lara dan perlakuan baik. Kalian justru tidak memuliakannya, tapi malah menghinanya. Ini menunjukkan tidak adanya rasa kasih sayang dalam hati kalian dan tidak adanya keinginan dalam kebajikan. “Dan kamu tidak saling mengajak memberi makan orang miskin,” yakni kalian tidak saling mengajak satu sama lain untuk memberi makan orang-orang yang memerlukan dari kalangan fakir miskin. Hal itu dikarenakan ketamakan terhadap dunia dan rasa cinta yang amat bersarang di hati. Karena itu Allah berfirman, “Dan kamu memakan harta pusaka,” yaitu harta yang ditinggalkan “dengan cara mencampur baurkan (yang halal dan yang batil),” yakni dengan segala ketamakan dan tidak menyisakan yang tidak halal sekalipun. Karena itu Allah berfirman, “Dan kamu mencintai harta benda dengan kecintaan yang berlebihan,” yakni dengan sangat. Hal ini senada dengan firman-Nya : “Sesungguhnya kalian (wahai manusia), mementingkan perhiasan dunia atas kenikmatan akhirat. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal. Alam akhirat dengan segala kenikmatan abadi yang ada padanya adalah lebih baik dan lebih kekal daripada dunia.” (qs. Al-A’la:16-17) dan firman-Nya : “Sekali-kali janganlah demikian. Sebenarnya kamu (hai manusia) mencintai kehidupan dunia. dan meninggalkan (kehidupan) akhirat” (QS. Al-Qiyamah : 20-21)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah menjelaskan keadaan manusia, bahwasanya jika ditimpa kepada kebaikan dan kecuckupan harta, dia menganggap bahwa semua itu merupakan kemuliaan dari Allah, dan bahwasnya Allah ridho dengannya. Kebanyakan manusia lalai dan bahwasnya kekayaan dan kenikmatan yang Allah limpahkan kepada adalah karomah, tetapi dia tidak mengetahui bahwa itu adalah ujian dan cobaan dari Alalh untuknya, dan jika dia tidak dendapatkan apa-apa dia mengamngap suatu kelemahan, begitulah manusia dengan keadaannya yang bermacam-macam, dia tidak mengetahui bahwa ini adalah ujian dari Allah, maka jelaslah siapa yang bersyukur dan siapa yang kufur dengan nikmat Allah. Sifat inilah yang banyak didapati diantara manusia, yakni mereka menganggap harta mereka adalah karomah dan bukan ujian dari Tuhannya, sehingga tdak terbetik dalam hati mereka bagaimana ia mensyukuri kenikmatan itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Cobaan dari Allah 'Azza wa Jalla datang berupa kebaikan dan keburukan sebagaimana Allah Ta'ala berfirman: وَنَبْلُوكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً \" Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan (yang sebenar-benarnya).\"(QS. Al-Anbiya: 35) setiap insan akan diberikan cobaan berupa kenikmatan yang dengannya Allah mengujinya apakah ia bersyukur ataukah kufur, dan ditimpa cobaan dengan musibah, apakah ia bersabar atau berkeluh kesah. Kondisi-kondisi manusia akan berputar antara baik dan buruk, antara kebaikan yang serasi dengannya dan ia dimudahkan, dan keburukan yang tidak serasi dengannya dan menyusahkannya, semuanya adalah cobaan dari Allah, sedangkan seorang insan berdasarkan tabiat manusianya yang memiliki sifat dasar zalim dan bodoh, ketika dia diberi ujian, Allah memuliakan dan memberinya kenikmatan ia akan mengatakan: \"Rabbku telah memulaikanku\" maknanya: Bahwa aku memang pantas untuk dimuliakan dan ia tidak mengakui pemberian Allah 'Azza Wa Jalla, ini seperti disebutkan dalam firman Allah Ta'ala: قَالَ إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ عِنْدِي \" Karun berkata: \"Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku\". \"(QS. Al-Qashash: 78) ketika menyebutkan kenikmatan yang Allah berika kepadanya, ia mengatakan : \" Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku \" dan tidak mengakui pemberian Allah, betapa banyak manusia yang kondisinya seperti ini, ketika Allah 'Azza Wa Jalla memuliakan dan memberi mereka kenikmatan, mereka mengatakan: ini adalah kemulian dari Allah untuk kami karena kami memeng pantas mendapatkannya. Andai seorang insan mengatakan: Sesungguhnya Allah memuliakanku dengan kenikmatan ini sebagai bentuk pengakuan atas pemberian-Nya dan ungkapan atas ketikmatan-Nya maka yang demikian ini tidak mengapa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 15: 14-16. Ketahuilah wahai Nabi Allah, bahwa Rabbmu akan mengawasi manusia di bumi, dan menghitung amalan mereka, dan membalas apa yang mereka kerjakan. Jika baik maka akan dibalas dengan kebaikan, jika buruk maka akan dibalas dengan keburukan. Kemudian Allah memisahkan mereka dengan berkata : Adapun manusia yang lalai dari Rabbnya, jika ia diberikan ujian kemudian diberikan nikmat oleh Allah dan diluaskan rezekinya sebagain pemulian dari Allah, maka mereka berkata : Tuhanku memuliakanku. Dan tidaklah muncul dalam benaknya bahwa telah diberikan ujuan baginya (dan diganti dengan nikmat dll.), dimana rasa syukurnya ? Apakah ia menganggap dan membalas nikmat Allah atasnya ?. Dan adapun jika ia melihat bawa rezekinya tak kunjung tiba kecuali hanya sedikit dan sulit, ia menyangka itu adalah hinaan dari Allah dan pelecehan atas dirinya, kemudian ia mengumpat dan menyalahkan Rabbnya dengan keburukan dan tidaklah ia melakukan kebaikan terhadap Tuhannya, ia absen dari kebaikan dalam kehidupannya yang semuanya adalah ujian dan hanya menimbulkan kerusakan. Dan barangsiapa yang sempir rezekinya, bersabar, dan bergantung (kepada Allah) serta besyukur kepada Allah atas segala sesuatunya, maka ia adalah orang yang berhasil secara hakiki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang tabiat manusia dari sisi kemanusiaannya, yaitu bahwa ia (manusia itu) jahil (tidak tahu) dan zalim; ia tidak mengetahui akibat dari sesuatu. Ia mengira, bahwa keadaannya itu akan tetap langgeng dan tidak akan berubah, dan mengira bahwa nikmat yang diberikan Allah kepadanya menunjukkan kemuliaannya di sisi-Nya dan dekat dengan-Nya. Sebaliknya, ketika ia dibatasi rezekinya, menurutnya berarti Allah menghinakannya. Maka pada ayat selanjutnya (ayat ke-17) Allah Subhaanahu wa Ta'aala membantah persangkaan tersebut. Allah Subhaanahu wa Ta'aala menyalahkan orang-orang yang mengatakan bahwa kekayaan itu adalah suatu kemuliaan dan kemiskinan adalah suatu kehinaan seperti yang tersebut pada ayat 15 dan 16, padahal sebenarnya kekayaan dan kemiskinan adalah ujian dari Allah kepada hamba-hamba-Nya. Demikian pula bahwa kemuliaan dan kemiskinan bukanlah tergantung pada kaya atau miskin, bahkan tergantung pada taat (takwa) atau tidaknya seseorang, namun kebanyakan manusia tidak mengerti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 15",
    "description": "Ayat ini menjelaskan sifat dasar manusia kafir ketika mendapat kebahagiaan dan kesusahan, yakni bergembira berlebihan saat mendapat kenikmatan dan putus asa ketika tertimpa kesulitan. Maka adapun manusia, apabila tuhan mengujinya lalu dia memuliakannya dan memberinya kesenangan serta kenikmatan, baik lahir maupun batin, maka dia berkata, 'tuhanku telah memuliakanku. ' mereka menilai kenikmatan yang diterimanya adalah berkat kemuliaan nya di sisi Allah. Mereka lupa bahwa nikmat itu pada dasarnya salah satu bentuk ujian Allah kepada manusia. 16. Namun apabila tuhan mengujinya lalu membatasi rezekinya, maka dia berkata, 'tuhanku telah menghinakanku. ' mereka tidak dapat memahami bahwa kefakiran dan kesusahan bukanla htolok ukur mutlak bagi kehinaan seseorang di mata Allah karena keduanya tidak lain hanyalah cobaan dari Allah."
  }
]