[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Perkaranya tidak sebagaimana yang diduga oleh manusia ini,sebaliknya pemuliaan allah adalah berdasarkan ketaatan kepadaNYA,dan perendahan adalah berdasarkan kemaksiatan kepadaNYA,sementara kalian tidak memuliakan anak yatim yang bapaknya wafat saat dia masih kecil, kalian tidak memperlakukannya dengan baik, Sebagian dari kalian tidak mendorong sebagian lainnya untuk memberi makan orang yang membutuhkan yang tidak memiliki apa yang mencukupinya dalam menutup hajatnya, Kalian makan hak orang lain dalam warisan dengan rakus, Dan kalian mencintai harta secara berlebihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sekali-kali tidak demikian, perkaranya tidak sebagaimana yang digambarkan oleh orang ini bahwa kenikmatan merupakan bukti keridaan Allah atas hamba-Nya dan kesengsaraan adalah bukti kehinaan seorang hamba di hadapan Rabbnya. Justru kenyataanya kalian tidak memuliakan anak yatim dari rezeki yang telah Allah berikan kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Kemudian dalam ayat ini disebutkan bantahan bagi manusia tentang pemahamannya dalam keadaan dan perkataannya ketika sedang senang atau susah. Kalimat yang digunakan dalam ungkapan ayat ini mengarah pada perlakukan orang-orang jahiliyah terhadap orang-orang yang lemah; sebab mereka tidak memperlakukan anak-anak yatim dengan baik, dan menguasai harta yang ditinggalkan orangtua anak-anak itu; bahkan mereka tidak hanya menolak untuk memberi makan dan menginfakkan harta kepada orang yang membutuhkan, namun mereka juga mendorong para pengasuh anak-anak yatim untuk tidak berinfak kepada mereka, sebab orang-orang itu tidak mempedulikan anak-anak yatim tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. كَلَّا ۖ (Sekali-kali tidak (demikian)) Ini merupakan bantahan bagi orang yang berkata demikian pada dua keadaan itu. بَل لَّا تُكْرِمُونَ الْيَتِيمَ (sebenarnya kamu tidak memuliakan anak yatim) Dengan kekayaan yang telah Allah berikan kepada kalian. Seandainya kalian memuliakan anak yatim niscaya kalian akan mendapat kemulian di sisi Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. {Janganlah begitu} untuk mencegah (kalian melakukan) tuduhan yang salah ini, dan juga memindahkan dari sesuatu yang sudah buruk menuju sesuatu yang lebih buruk lagi, karena kalian tidak berbuat baik kepada anak yatim dengan kekayaan kalian, dan kalian juga tidak menganjurkan memberi makan orang-oranga miskin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak} hal itu tidak sesuai yang manusia ini anggapkan {Sebaliknya kalian tidak memuliakan anak yatim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-20. Allah mengabarkan tabiat manusia dari segi manusia itu sendiri. Manusia adalah sosok bodoh, zhalim, yang tidak mengetahui resiko berbagai hal. Ia mengira kondisi yang ada padanya akan terus berlanjut dan tidak akan hilang dan mengira bahwa kemuliaan serta kenikmatan Allah yang diberikan di dunia menunjukkan kemuliaannya di sisi Allah,dan ia mengira bila “rizkinya” disempitkan hingga makanannya hanya pas-pasan (tidak lebih), hal itu dikira sebagai penghinaan Allah terhadapnya. Allah menolak dugaan ini seraya berfirman, “sekali-kali tidak (demikian),” yakni tidak semua orang yang Aku beri kenikmatan di dunia adalah orang mulia di sisiKu dan tidak berarti orang yang rizkinya Aku sempitkan adalah orang hina di sisiKu. Kekayaan, kemiskinan, kelapangan, dan kesempitan hanyalah ujian dari Allah pada para manusia, agar Allah mengetahui siapakah yang bersyukur dan bersabar, sehingga Allah bisa memberikan balasan besar atas kesyukuran dan kesabaran itu, sedangkan yang tidak mau bersyukur dan bersabar, akan ditimpakan padanya siksaan yang mengerikan. Di samping itu, ketergantungan harapan seseorang pada keinginannya semata merupakan salah satu tanda lemahnya cita-cita. Karena itu Allah mencela mereka karena tidak memperhatikan kondisi orang lain yang memerlukan bantuan seraya berfirman, “Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,” yang kehilangan ayah dan orang yang mencarikan rizki baginya yang memerlukan pelipur lara dan perlakuan baik. Kalian justru tidak memuliakannya, tapi malah menghinanya. Ini menunjukkan tidak adanya rasa kasih sayang dalam hati kalian dan tidak adanya keinginan dalam kebajikan. “Dan kamu tidak saling mengajak memberi makan orang miskin,” yakni kalian tidak saling mengajak satu sama lain untuk memberi makan orang-orang yang memerlukan dari kalangan fakir miskin. Hal itu dikarenakan ketamakan terhadap dunia dan rasa cinta yang amat bersarang di hati. Karena itu Allah berfirman, “Dan kamu memakan harta pusaka,” yaitu harta yang ditinggalkan “dengan cara mencampur baurkan (yang halal dan yang batil),” yakni dengan segala ketamakan dan tidak menyisakan yang tidak halal sekalipun. Karena itu Allah berfirman, “Dan kamu mencintai harta benda dengan kecintaan yang berlebihan,” yakni dengan sangat. Hal ini senada dengan firman-Nya : “Sesungguhnya kalian (wahai manusia), mementingkan perhiasan dunia atas kenikmatan akhirat. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal. Alam akhirat dengan segala kenikmatan abadi yang ada padanya adalah lebih baik dan lebih kekal daripada dunia.” (qs. Al-A’la:16-17) dan firman-Nya : “Sekali-kali janganlah demikian. Sebenarnya kamu (hai manusia) mencintai kehidupan dunia. dan meninggalkan (kehidupan) akhirat” (QS. Al-Qiyamah : 20-21)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Perkaranya tidak seperti yang kalian sangka, bahwa kenikmatan itu adalah karomah, dan keterbatasan nikmat adalah penghinaan, semua itu salah dan menyalahi hikmah ketetapan Allah, dan sebenarnya kalian tidak mau memuliakan anak yatim, semua itu masalahnya ada pada manusia itu sendiri, mereka menyombongkan diri dengan kekayaan dan kenikmatan dunia dihadapan orang-orang lemah dan orang miskin, khususnya kepada anak-anak yatim, dan mereka itu butuh dengan uluran tangan orang yang berbuat baik kepadanya, mereka butuh dengan pelukan hangat orang yang berbelas kasihan kepadanya, karena mereka mempunyai hak atas itu semua dari kerabat keluarganya, dan juga dari orang-orang sekitarnya, hak kasih sayang dan kelembutan dan tanggungan hidup."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya, Allah Ta'ala berfirman: كَلَّا \" Sekali-kali tidak (demikian),\" Maksudnya: Dia tidak memberikan apa-apa yang Dia berikan kepadamu karena memuliakanmu, karena kamu berhak, akan tetapi itu adalah karunia dari-Nya , dan Dia tidak menghinakanmu ketika menyempitkan rejekimu tetapi itu adalah buah dari kebijaksanaan dan keadilan-Nya. Kemudian Allah berfirman: بَلْ لَا تُكْرِمُونَ الْيَتِيمَ \" sebenarnya kamu tidak memuliakan anak yatim,\" Maksudnya: Jika Allah 'Azza Wa Jalla memuliakan kaliana dengan kenimatan-kenikmatan dari-Nya kalian tidak akan menyantuni orang orang yang berhak untuk dimuliakan yaitu anak-anak yatim. Yatim dalam ayat ini adalah isim jins (kata benda yang menunjukkan jenis) bukan berarti menunjukan searang yatim saja, tetapi mencakup semua jenis anak-anak yatim. Para ulama mengatakan: Anak yatim adalah anak yang bapaknya meninggal sebelum mencapai usia baligh baik anak laki-laki atau pun perempuan, sedangkan anak yang ibunya meninggal maka tidak disebut anak yatim. Firman Allah Ta'ala: الْيَتِيمَ \"yatim\" mencakup anak yatim yang faqir dan yang kaya, karena selayaknya dia disantuni karena perasaan hatinya pecah disebabkan kematian bapaknya dan yang memenuhi kebutuhan-kebutuhannya, maka Allah berwasiat berbuat baik kepadanya agar kegundahan hati yang menimpanya ini menghilang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 17: 17-20. Ketahuilah oleh kalian bahwa urusannya tidaklah sebagaimana diyakini ia yang diuji (diuji dengan kemuliaan oleh Allah dan kemudian direndahkan); Akan tetapi kalian telah berbuat keburukan, dan kalian tidak memuliakan yatim, dan tidak menganjurkan sebagian dari kalian atas sebagian yang lain untuk memberi makan orang-orang miskin dan memperbaiki kondisi mereka. Kalian memakan harta anak-anak yatim dan perempuan-perempuan lemah yang ditinggalkan ia dalam kondisi kalian makan dengan makanan yang sangat banyak; (Padahal) kalian memiliki keberuntungan yang diberikan oleh Allah yang tidak dimiliki selain kalian. Kalian juga bersemangat mengumpulkan harta dengan sangat, seolah-olah kalian akan kekal (di dunia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak setiap orang yang diberi Allah nikmat berarti mulia di hadapan-Nya, dan tidak setiap orang yang dibatasi rezekinya berarti hina di hadapan-Nya. Bahkan sesungguhnya kaya dan miskin merupakan ujian dari Allah kepada hamba-hamba-Nya agar Dia melihat siap yang bersyukur kepada-Nya ketika mendapatkan nikmat, dan siapa yang bersabar ketika disempitkan rezekinya sehingga Allah akan memberinya pahala yang besar, atau bahkan ia mendapatkan azab karena tidak bersyukur atas nikmat itu dan tidak bersabar ketika disempitkan rezekinya. Di samping itu pula, sibuknya seorang hamba memikirkan kesenangan dirinya saja dan tidak peduli dengan keadaan orang lain yang membutuhkan merupakan perkara yang dicela Allah Subhaanahu wa Ta'aala sebagaimana firman Allah Ta’ala pada lanjutan ayat tersebut. Seperti tidak memberikan hak-haknya dan tidak berbuat baik kepadanya, padahal ia telah kehilangan bapaknya. Hal ini menunjukkan hilangnya sifat rahmat (kasih-sayang) dalam hatimu dan tidak suka kepada kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 17",
    "description": "Sekali-kali tidak demikian. Ketahuilah, kemuliaan seseorang tidak diukur dari kekaya annya dan kehinaan tidak dipandang dari kemiskinannya. Kemulian diukur dari ketaatan dan kehinaan adalah akibat kemaksiatan seseorang kepada Allah. Bahkan kamu tidak memuliakan, menyantuni, mengasihi, dan menolong anak yatim. Kamu biarkan mereka susah, padahal menyantuni mereka adalah amal saleh yang menjanjikan derajat tinggi di sisi Allah. 18. Dan kamu tidak saling mengajak satu sama lain untuk memberi makan orang miskin. Tidak mengajak orang lain untuk berbuat baik juga merupakan tindakan tidak terpuji. Mengajak orang lain berbuat baik adalah tindakan terpuji, apa lagi jika dibarengi dengan melakukannya. Makanan adalah kebutuhan pokok manusia. Memberi makanan fakir miskin, baik muslim atau bukan, adalah suatu bentuk kesalehan sosial yang sangat terpuji (lihat pula: al-ins'n/76: 8)."
  }
]