[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Perkaranya tidak sebagaimana yang diduga oleh manusia ini,sebaliknya pemuliaan allah adalah berdasarkan ketaatan kepadaNYA,dan perendahan adalah berdasarkan kemaksiatan kepadaNYA,sementara kalian tidak memuliakan anak yatim yang bapaknya wafat saat dia masih kecil, kalian tidak memperlakukannya dengan baik, Sebagian dari kalian tidak mendorong sebagian lainnya untuk memberi makan orang yang membutuhkan yang tidak memiliki apa yang mencukupinya dalam menutup hajatnya, Kalian makan hak orang lain dalam warisan dengan rakus, Dan kalian mencintai harta secara berlebihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan kalian memakan hak-hak orang yang lemah dari kalangan wanita dan anak-anak yatim dengan semaunya tanpa mempertimbangkan kehalalannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-20. Orang-orang musyrik itu telah terbiasa merampas hak anak-anak yatim dan orang-orang miskin, mereka mengambilnya secara paksa. Orang-orang zalim itu telah sungguh sangat mencintai harta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَتَأْكُلُونَ التُّرَاثَ (dan kamu memakan harta pusaka) Yakni harta anak yatim, wanita, dan orang-orang lemah. أَكْلًا لَّمًّا(dengan cara mencampur baurkan (yang halal dan yang bathil)) Yakni dengan serakah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kalian memakan harta warisan dengan sangat rakus. Kalian makan semuanya baik yang halal maupun yang haram, seperti mengambil hak para perempuan dan anak-anak. “Al-Lamam” artinya adalah campuran segala sesuatu yang (seharusnya) terpisah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kalian memakan harta warisan} harta warisan {dengan cara mencampur baurkan} berlebihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-20. Allah mengabarkan tabiat manusia dari segi manusia itu sendiri. Manusia adalah sosok bodoh, zhalim, yang tidak mengetahui resiko berbagai hal. Ia mengira kondisi yang ada padanya akan terus berlanjut dan tidak akan hilang dan mengira bahwa kemuliaan serta kenikmatan Allah yang diberikan di dunia menunjukkan kemuliaannya di sisi Allah,dan ia mengira bila “rizkinya” disempitkan hingga makanannya hanya pas-pasan (tidak lebih), hal itu dikira sebagai penghinaan Allah terhadapnya. Allah menolak dugaan ini seraya berfirman, “sekali-kali tidak (demikian),” yakni tidak semua orang yang Aku beri kenikmatan di dunia adalah orang mulia di sisiKu dan tidak berarti orang yang rizkinya Aku sempitkan adalah orang hina di sisiKu. Kekayaan, kemiskinan, kelapangan, dan kesempitan hanyalah ujian dari Allah pada para manusia, agar Allah mengetahui siapakah yang bersyukur dan bersabar, sehingga Allah bisa memberikan balasan besar atas kesyukuran dan kesabaran itu, sedangkan yang tidak mau bersyukur dan bersabar, akan ditimpakan padanya siksaan yang mengerikan. Di samping itu, ketergantungan harapan seseorang pada keinginannya semata merupakan salah satu tanda lemahnya cita-cita. Karena itu Allah mencela mereka karena tidak memperhatikan kondisi orang lain yang memerlukan bantuan seraya berfirman, “Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,” yang kehilangan ayah dan orang yang mencarikan rizki baginya yang memerlukan pelipur lara dan perlakuan baik. Kalian justru tidak memuliakannya, tapi malah menghinanya. Ini menunjukkan tidak adanya rasa kasih sayang dalam hati kalian dan tidak adanya keinginan dalam kebajikan. “Dan kamu tidak saling mengajak memberi makan orang miskin,” yakni kalian tidak saling mengajak satu sama lain untuk memberi makan orang-orang yang memerlukan dari kalangan fakir miskin. Hal itu dikarenakan ketamakan terhadap dunia dan rasa cinta yang amat bersarang di hati. Karena itu Allah berfirman, “Dan kamu memakan harta pusaka,” yaitu harta yang ditinggalkan “dengan cara mencampur baurkan (yang halal dan yang batil),” yakni dengan segala ketamakan dan tidak menyisakan yang tidak halal sekalipun. Karena itu Allah berfirman, “Dan kamu mencintai harta benda dengan kecintaan yang berlebihan,” yakni dengan sangat. Hal ini senada dengan firman-Nya : “Sesungguhnya kalian (wahai manusia), mementingkan perhiasan dunia atas kenikmatan akhirat. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal. Alam akhirat dengan segala kenikmatan abadi yang ada padanya adalah lebih baik dan lebih kekal daripada dunia.” (qs. Al-A’la:16-17) dan firman-Nya : “Sekali-kali janganlah demikian. Sebenarnya kamu (hai manusia) mencintai kehidupan dunia. dan meninggalkan (kehidupan) akhirat” (QS. Al-Qiyamah : 20-21)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَتَأْكُلُونَ التُّرَاثَ أَكْلًا لَمًّا \" dan kamu memakan harta pusaka dengan cara mencampur baurkan (yang halal dan yang batil)\" At-Turats: adalah harta yang Allah wariskan (berikan) kepada seorang hamba, baik itu diwariskan dari orang meninggal, atau dari jual beli atau dari bekerja, atau keluar dari rumah mengais rejeki denga mencari rerumputan dan kayu bakar atau yang lainnya. Warisan adalah yang diwariskan oleh manusia atau yang Allah wariskan kepada seorang insan berupa harta, Anak-anak adam memakannya dengan berlebihan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 19: 17-20. Ketahuilah oleh kalian bahwa urusannya tidaklah sebagaimana diyakini ia yang diuji (diuji dengan kemuliaan oleh Allah dan kemudian direndahkan); Akan tetapi kalian telah berbuat keburukan, dan kalian tidak memuliakan yatim, dan tidak menganjurkan sebagian dari kalian atas sebagian yang lain untuk memberi makan orang-orang miskin dan memperbaiki kondisi mereka. Kalian memakan harta anak-anak yatim dan perempuan-perempuan lemah yang ditinggalkan ia dalam kondisi kalian makan dengan makanan yang sangat banyak; (Padahal) kalian memiliki keberuntungan yang diberikan oleh Allah yang tidak dimiliki selain kalian. Kalian juga bersemangat mengumpulkan harta dengan sangat, seolah-olah kalian akan kekal (di dunia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak menyisakan sedikit pun darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 19",
    "description": "Kamu tidak berbuat baik kepada anak yatim dan orang miskin, sedangkan kamu justru memakan harta warisan dengan cara mencampur baurkan yang halal dengan yang haram. Harta warisan adalah hak ahli waris tertentu. Merampas harta warisan yang menjadi hak orang lain adalah perbuatan zalim. 20. Dan tidak hanya itu, kamu juga mencintai harta dengan kecintaan yang berlebihan. Kecintaan berlebih seseorang terhadap harta menjadikan motivasi hidupnya semata untuk mengumpul'kan harta, tidak peduli halal atau haram. Di sisi lain, dia akan menjadi kikir dan tidak mau peduli kepada sesama. Perilaku ini akan menjerumuskannya ke neraka."
  }
]