[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Allah bersumpah dengan waktu fajar, Juga dengan 10 malam pertama bulan dzulhijjah dan apa yang dengannya ia dimuliakan, Juga dengan segala apa yang genap dan ganjil, Dan dengan malam bila ia hadir dengan kegelapannya, Tidakkah sumpah sumpah diatas mengandung nasihat yang cukup bagi pemilik akal?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan sepuluh malam pertama pada bulan Zulhijah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَلَيَالٍ عَشْرٍ (dan malam yang sepuluh) Yakni sepuluh malam pertama pada bulan Dzulhijjah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Mahasuci dzat yang memuliakan ummat ini, dan membuka baginya dengan tangan nabinya yang penuh kasih sayang pintu-pintu keutamaan dan kemuliaan yang banyak, dan tidaklah suatu kaum melakukan suatu amalan yang besar dan amalan tersebut tidak diberikan kepada kaum lainnya melainkan Allah telah menjadikan suatu amalan untuk mengalahkan kaum lainnya, atau mendahulukan kaum tersebut diatas kaum lainnya, sehingga setiap kaum berada diatas keutamaan yang sama. 2 ) . Diantara sebab penyebutan ayat : { وَلَيَالٍ عَشْرٍ } yaitu 10 hari yang telah dikenal oleh orang-orang yang telah mendengarkan tentangnya, yang dikenal dengan hari yang sepuluh, dan dalam penyebutannya bukan dengan ( الليالي العشر ) karena penyebutan lafazh ini dengan tanwin adalah pengagungan untuknya, dan tidaklah hari-hari dalam satu tahun 10 hari yang agung berturut-turut seperti 10 hari dzulhijjah yang didalamnya kaum muslimin menunaikan ibadah haji, ihram, masuknya kaum muslim dari berbagai belahan dunia ke kota Makkah, thowaf, yaum tarwiyah pada hari kedelapan, dan wukuf di arafah pada hari kesembilan, dan pada hari kesepuluh hari qurban. 3 ) . Pada sepuluh hari inilah dahulu para sahabat memanfaatkan dengan sebaik-baiknya untuk memperbanyak ibadah, dan dialah 10 hari yang paling utama secara muthlak, karena pada hari itu berbagai keutamaan dan amalan-amalan yang besar berkumpul, yang pada hari-hari lainnya keutamaan tersebut tidak ada; seperti shalat, puasa dan sedekah, dan berkumpulnya kaum muslimin pada hari itu tidak sama dengan perkumpulan mereka pada hari-hari lainnya, dan diantara amalan yang paling besar pada hari itu adalah haji ke baitullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku (Allah) bersumpah demi matahari: Matahari yang terbit setiap hari. Waktu dimana kegelapan beranjak dari malam. Dan demi 10 malam bulan Dzulhijjah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi malam yang sepuluh} Aku bersumpah demi sepuluh malam pertama dari bulan Dzulhijjah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Zahirnya, apa yang disumpahkan itulah yang menjadi obyek sumpah. Hal ini boleh dan lazim digunakan bila obyek sumpah berupa sesuatu yang zahir dan penting. Dan seperti itu juga dalam ayat ini. Allah bersumpah dengan waktu fajar, yaitu penghujung malam dan permulaan siang. Karena di waktu akhir malam dan permulaan siang terdapat tanda-tanda kebesaran Allah yang mengatur seluruh hal, yang menunjukkan kekuasaanNya yang sempurna. Dialah yang mengatur seluruh hal, yang hanya kepadaNya-lah ibadah layak ditunaikan. Di saat fajar, terdapat shalat utama lagi diagungkan yang baik untuk dijadikan sebagai obyek sumpah oleh Allah. Karena itu, setelahnya Allah bersumpah dengan sepuluh malam yang menurut pendapat yang benar adalah sepuluh malam di bulan Ramadhan atau sepuluh hari di bulan Dzulhijjah. Karena malam-malam tersebut mencakup hari-hari mulia, yang di dalamnya berlaku berbagai macam ibadah dan dan pendekatan diri yang tidak terdapat pada waktu lain. Pada sepuluh malam terakhir bulan Ramadhan terdapat malam lailatul qadar, yaitu malam yang lebih baik dari seribu bulan dan pada siang harinya terdapat puasa di akhir akhir bulan Ramadhan yang merupakan salah satu rukun Islam yang agung. Pada sepuluh hari di bulan Dzulhijjah terdapat wuquf di Arafah yang pada saat itu Allah memberikan ampunan kepada para hambaNya yang membuat setan sedih. Setan tidak terlihat lebih hina dan kalah melebihi kehinaan dan kekalahannya di hari Arafah karena banyaknya malaikat dan rahmat yang turun dari Allah untuk para hambaNya. Pada hari itu, kebanyakan kegiatan haji dan umrah dilakukan. Semua itu adalah hal-hal agung yang berhak dijadikan sumpah oleh Allah. “Dan demi malam bila berlalu,” yakni saat berlalu dan menurunkan kegelapannya atas manusia sehingga mereka menjadi tenang, nyaman, dan tentram sebagai rahmat dan hikmah dari Allah. “Pada yang demikian itu,” yang disebutkan sebelumnya, “terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal,” yakni untuk orang yang berakal sehat. Ya, sebagian dari hal itu cukup bagi orang-orang yang memiliki akal atau mendengar sebagai yang menyaksikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Juga dengan 10 malam, maksud dari 10 malam ini ulama berselisih dalam beberapa pendapat, tapi pendapat yang paling masyhur adalah : 10 malam pertama bulan dzul hijjah, dan pendapat lain mengatakan : yaitu 10 malam terakhir bulan ramadhan, akan tetapi pendapat yang paling kuat adalah : 10 malam pertama bulan dzul hijjah, yaitu 10 malam yang id agungkan. Rasulullah ﷺ bersabda : (( مَا مِنْ أَيَّامٍ الْعَمَلُ الصَّالِحُ فِيهِا أَحَبُّ إِلَى اللَّهِ عَزَّوَجَلَّ مِنْ هَذِهِ الأَيَّامِ، يَعْنِيْ أَيَّامَ الْعَشْرِ، قَالُوا: يَا رَسُولَ اللَّهِ وَلاَ الْجِهَادُ فِى سَبِيلِ اللَّهِ ؟ قَالَ: “وَلاَ الْجِهَادُ فِى سَبِيلِ اللَّهِ إِلاَّ رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَىْءٍ )) “Tidak ada hari dimana suatu amal shalih lebih di cintai Allah melebihi amal shalih yang dilakukan di hari-hari ini (yakni sepuluh hari pertama Dzulhijjah)”. Para sahabat bertanya,”Wahai Rasulullah, termasuk lebih utama dari jihad di jalan Allah?” Nabi ٍShallallahu ‘alaihi wa sallam bersabda, “Termasuk lebih utama dibanding jihad di jalan Allah, kecuali orang yang keluar dengan jiwa dan hartanya (kemedan jihad) dan tidak ada satu pun yang kembali (ia mati syahid)” [ Diriwayatkan oleh Imam Bukhori : 969 , Abu Daud : 2438 , dan Turmudzi : 757 , dari hadits Ibnu Abbas -Radhiyallahu'ahuma-. Hari yang 10 itu adalah hari yang sangat mulia dan agung, amalan orang-orang beriman pada hari itu memiliki nilai yang sangat tinggi disisi Allah ﷻ , amalan shalih orang-orang beriman akan digandakan pahalanya oleh Allah ﷻ , amalan-amaln shalih yang dilakukan pada hari-hari itu adalah amalan yang paling dicintai oleh Allah ﷻ , dan salah satu amalan yang paling penting pada hari itu adalah : berdzikir menyebut nama Allah ﷻ , serta mengagungkan-Nya dengan memperbanyak takbir kepada Allah ﷻ , dan ketika 10 hari itu tiba orang-orang mukmin bersegera untuk memulai amalan tersebut, yaitu dengan bertakbir,dan berdzikir kepada Allah ﷻ , serta bertahlil mengkhususkan hari-hari itu dengan memperbanyak amalan-amalan tersebut, dan agar mereka membesarkan suara-suara mereka dengan dzikir ini dijalan-jalan umum dan dirumah-rumah. Dan diantara amalan-amalan lain yang dianjurkan untuk dilakukan adalah : berpuasa di 10 hari itu, dan dalil tetang itu telah diriwayatkan dari Rasulullah ﷺ , dan juga : puasa itu termasuk dari amalan shalih yang disunnah di 10 hari dzul hijjah ini. Diantara 10 hari itu ada hari kesembilan yang dikenal dengan \"hari 'arafah\" , yang pada hari itu sangat dianjurkan bagi muslim yang tidak sedang menunaikan ibadaha haji untuk berpuasa, pahala dari puasa hari itu adalah digugukannya dosa-dosa selama satu tahun sebelumnya, dan pada kesepuluh adalah hari yang agung bagi ummat islam, yaitu hari haji yang paling agung hari \"ieduladha\" , sungguh sangat banyak kebaikan dan kemuliaan yang ada di 10 hari pertama bulan dzul hijjah ini. oleh karena itu Allah ﷻ bersumpah dengannya. { وَلَيَالٍ عَشْرٍ } Sepuluh hari beserta malamnya, adalah musim kebaikan yang sangat berharga bagi orang-orang beriman yang memanfaatkannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَيَالٍ عَشْرٍ \" dan malam yang sepuluh,\" Ada yang berpendapat bahwa maksud malam yang sepuluh adalah sepuluh hari bulan dzulhijjah, hari-hari di sini disebutkan dengan malam-malam karena bahasa arab luas, terkadang malam-malam disebutkan untuk mengungkapkan hari-hari begitu pun sebaliknya. Ada yang mengatakan: Maksud dari malam yang sepuluh adalah sepuluh malam terakhir di bulan ramadhan. Adapun jika ditinjau dengan pendapat yang pertama, yang mengatakan maksud sepuluh malam tersebut adalah sepuluh hari di awal bulan dzulhijjah, karena hari-hari tersebut adalah hari-hari yang banyak keutamaannya, Nabi shallallaahu 'alaihi wa sallam bersabda tentangnya: مَا مِنْ أَيَّامٍ العَمَلُ الصَّالِحُ فِيهِنَّ أَحَبُّ إِلَى اللهِ مِنْ هَذِهِ الأَيَّامِ العَشْرِ ، فَقَالُوا : يَا رَسُولَ اللهِ ، وَلاَ الجِهَادُ فِي سَبِيلِ اللهِ ؟ فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : وَلاَ الجِهَادُ فِي سَبِيلِ اللهِ ، إِلاَّ رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَيْءٍ \"Tidak ada hari-hari, yang amal saleh di dalamnya lebih Allah cintai dari hari-hari sepuluh ini, maka para sahabat bertanya: Ya Rasulullaah, tidak, walaupun jihad di jalan Allah? Rasulullaah shallallaahu 'alaihi wa sallam menjawab: Tidak, walaupun jiha di jalan Allah kecuali seseorang yang keluar dengan jiwa danhartanya lalu ia tidak pulang dengan apa pun \" (1) Sedangkan yang mengatakan bahwa yang dimaksud dengan malam-malam sepuluh tersebut adalah malam sepuluh terakhir bulan ramadhan, maka mereka mengatakan: Bahwa pada dasarnya malam-malam itu adalah bermakna malam-malam bukan hari-hari. Mereka juga mengatakan bahwa malam-malam sepuluh terakhit pada bulam ramadhan di dalamnya terdapat malam lailatul qadar yang mana Allah berfirman tentangnya: \"Malam tersebut lebih baik dari seribu bulan\" Allah Juga berfirman: إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ (3) فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ \"sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan. Pada malam itu dijelaskan segala urusan yang penuh hikmah,\" (QS. Ad-Dukhan: 3-4) pendapat ini lebih kuat dibandingkan pendapat yang pertama, meskipun pendapat pertama adalah pendapatnya jumhur ulama, namun lafaz pada ayat itu tidak memenuhi makna pendapat jumhur, namun lafaznya lebih menguatkan pendapat yang mengatakan bahwa malam-malam itu adalah sepuluh malam terakhir ramadhan, Allah bersumpah dengannya karena kemuliaannya, karena di dalamnya terdapat lailatul-qadar, dan juga dikerenakan kaum muslimin menutup bulan ramadhan dengan malam-malam tersebut, yang mana bulan tersebut adalah waktu dijalankannya salah satu kewajiban di antara kewajiban dan rukun islam, oleh karenanya Allah bersumpah dengan malam-malam tersebut. (1) dikeluarkan Bukhari (969) dari daits Ibnu Abbas radhiyallaahu 'anha"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 2: 1-4. Allah memulai dalam surat ini dengan sumpah, dimana Allah bersumpah dengan waktu fajar yang terang sinarnya. Allah juga bersumpah dengan waktu malam yang ke sepuluh dzulhijjah. Allah bersumpah dengan bilangan genap dan ganjil pada segala sesuatu. Allah bersumpah dengan malam yang telah pergi (berlalu) kegelapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 2",
    "description": "1-4. Demi fajar, yaitu awal mula terangnya bumi setelah kegelapan malam sirna. Pada waktu ini manusia memulai aktivitasnya. Di balik kemunculan fajar itu pasti ada zat yang mahaperkasa. Demi malam yang sepuluh, yaitu sepuluh hari pertama bulan zulhijah. Mereka yang beramal saleh pada hari-hari tersebut akan mendapat pahala yang sangat agung. Demi yang genap dan yang ganjil dari semua hal. Bisa juga dipahami bahwa yang genap itu adalah makhluk Allah, sedangkan yang ganjil adalah Allah. Dia maha esa dan tanpa bandingan. Allah tidak membutuhkan apa dan siapa pun, sedang makhluk sangat bergantung pada yang lain. Demi malam apabila berlalu dan digantikan siang"
  }
]