[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-20. Perkaranya tidak sebagaimana yang diduga oleh manusia ini,sebaliknya pemuliaan allah adalah berdasarkan ketaatan kepadaNYA,dan perendahan adalah berdasarkan kemaksiatan kepadaNYA,sementara kalian tidak memuliakan anak yatim yang bapaknya wafat saat dia masih kecil, kalian tidak memperlakukannya dengan baik, Sebagian dari kalian tidak mendorong sebagian lainnya untuk memberi makan orang yang membutuhkan yang tidak memiliki apa yang mencukupinya dalam menutup hajatnya, Kalian makan hak orang lain dalam warisan dengan rakus, Dan kalian mencintai harta secara berlebihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan kalian sangat menyukai harta lalu kalian kikir untuk menginfakkannya di jalan Allah karena sangat menggandrunginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Kalian sangat mencintai harta benda. {Janganlah begitu} : Tahanlah diri kalian dari hal ini. Ketika bumi diguncangkan berkali-kali, yaitu diguncangkan sampai setiap bangunan di atasnya hancur sehingga menjadi rata dengan tanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mencintai harta dengan kecintaan yang berlebihan} berlebihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-20. Allah mengabarkan tabiat manusia dari segi manusia itu sendiri. Manusia adalah sosok bodoh, zhalim, yang tidak mengetahui resiko berbagai hal. Ia mengira kondisi yang ada padanya akan terus berlanjut dan tidak akan hilang dan mengira bahwa kemuliaan serta kenikmatan Allah yang diberikan di dunia menunjukkan kemuliaannya di sisi Allah,dan ia mengira bila “rizkinya” disempitkan hingga makanannya hanya pas-pasan (tidak lebih), hal itu dikira sebagai penghinaan Allah terhadapnya. Allah menolak dugaan ini seraya berfirman, “sekali-kali tidak (demikian),” yakni tidak semua orang yang Aku beri kenikmatan di dunia adalah orang mulia di sisiKu dan tidak berarti orang yang rizkinya Aku sempitkan adalah orang hina di sisiKu. Kekayaan, kemiskinan, kelapangan, dan kesempitan hanyalah ujian dari Allah pada para manusia, agar Allah mengetahui siapakah yang bersyukur dan bersabar, sehingga Allah bisa memberikan balasan besar atas kesyukuran dan kesabaran itu, sedangkan yang tidak mau bersyukur dan bersabar, akan ditimpakan padanya siksaan yang mengerikan. Di samping itu, ketergantungan harapan seseorang pada keinginannya semata merupakan salah satu tanda lemahnya cita-cita. Karena itu Allah mencela mereka karena tidak memperhatikan kondisi orang lain yang memerlukan bantuan seraya berfirman, “Sekali-kali tidak (demikian), sebenarnya kamu tidak memuliakan anak yatim,” yang kehilangan ayah dan orang yang mencarikan rizki baginya yang memerlukan pelipur lara dan perlakuan baik. Kalian justru tidak memuliakannya, tapi malah menghinanya. Ini menunjukkan tidak adanya rasa kasih sayang dalam hati kalian dan tidak adanya keinginan dalam kebajikan. “Dan kamu tidak saling mengajak memberi makan orang miskin,” yakni kalian tidak saling mengajak satu sama lain untuk memberi makan orang-orang yang memerlukan dari kalangan fakir miskin. Hal itu dikarenakan ketamakan terhadap dunia dan rasa cinta yang amat bersarang di hati. Karena itu Allah berfirman, “Dan kamu memakan harta pusaka,” yaitu harta yang ditinggalkan “dengan cara mencampur baurkan (yang halal dan yang batil),” yakni dengan segala ketamakan dan tidak menyisakan yang tidak halal sekalipun. Karena itu Allah berfirman, “Dan kamu mencintai harta benda dengan kecintaan yang berlebihan,” yakni dengan sangat. Hal ini senada dengan firman-Nya : “Sesungguhnya kalian (wahai manusia), mementingkan perhiasan dunia atas kenikmatan akhirat. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal. Alam akhirat dengan segala kenikmatan abadi yang ada padanya adalah lebih baik dan lebih kekal daripada dunia.” (qs. Al-A’la:16-17) dan firman-Nya : “Sekali-kali janganlah demikian. Sebenarnya kamu (hai manusia) mencintai kehidupan dunia. dan meninggalkan (kehidupan) akhirat” (QS. Al-Qiyamah : 20-21)"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Mencintai sesuatu dengan berlebihan adalah tabiat manusia, apatahlagi kecintaan kepada harta, Allah berfirman : { وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ } ( Dan sesungguhnya dia sangat bakhil karena cintanya kepada harta ) [ Al-'Adiyat : 8 ] cinta kepada harta adalah tabiat manusia, akan tetapi hal itu tidak boleh menjadi sebab dia mengambil harta itu dengan cara yang tidak benar, atau menghalanginya dari mengeluarkan harta hak orang miskin. Naluri insan mencintai kekayaan adalah hal biasa dikalangan orang-orang awam, tetapi hal itu dapat membahayakan keimanan dan ketaqwaannya, adapun mencintainya dengan cinta yang biasa-biasa saja dan hal itu tidak menyebabkan dirinya mengambil harta dengan cara yang tidak benar, maka hal itu tidak menjadi masalah yang besar, begitu banyak dikalangan masyarakat pada umumnya, dikarenakan cintanya kepada harta secara berlebihan sehingga menyebabkan hilangnya rasa peduli kepada orang miskin dan anak yatim, maka perkara inilah yang dilarang oleh agama."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Sedangkan berkaitan dengan harta, Allah berfirman: وَتُحِبُّونَ الْمَالَ حُبًّا جَمًّا \" dan kamu mencintai harta benda dengan kecintaan yang berlebihan.\" Maknanya: Jumlah besar, inilah tabi'at manusia, tetapi keimanan memiliki dampak-dampaknya. Terkadang manusia karena keimanannya ia tidak memperhatikan hartanya, jika datang kepadanya maka ia bersyukur dan mengeluarkannya sesuai yang diwajibkan kepadanya, dan jika hartanya pergi ia tidak memperhatikannya, namun tabi'at manusia pada dasarnya sebagai mana Allah 'Azza Wa Jalla sifati dalam dua ayat tersebut"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 20: 17-20. Ketahuilah oleh kalian bahwa urusannya tidaklah sebagaimana diyakini ia yang diuji (diuji dengan kemuliaan oleh Allah dan kemudian direndahkan); Akan tetapi kalian telah berbuat keburukan, dan kalian tidak memuliakan yatim, dan tidak menganjurkan sebagian dari kalian atas sebagian yang lain untuk memberi makan orang-orang miskin dan memperbaiki kondisi mereka. Kalian memakan harta anak-anak yatim dan perempuan-perempuan lemah yang ditinggalkan ia dalam kondisi kalian makan dengan makanan yang sangat banyak; (Padahal) kalian memiliki keberuntungan yang diberikan oleh Allah yang tidak dimiliki selain kalian. Kalian juga bersemangat mengumpulkan harta dengan sangat, seolah-olah kalian akan kekal (di dunia)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 20",
    "description": "20. Dan tidak hanya itu, kamu juga mencintai harta dengan kecintaan yang berlebihan. Kecintaan berlebih seseorang terhadap harta menjadikan motivasi hidupnya semata untuk mengumpul'kan harta, tidak peduli halal atau haram. Di sisi lain, dia akan menjadi kikir dan tidak mau peduli kepada sesama. Perilaku ini akan menjerumuskannya ke neraka. 21-24. Sekali-kali tidak! janganlah kamu berbuat demikian. Apabila bumi diguncangkan berturut-turut, memuntahkan isinya, hancur lebur, kemudian muncul bumi yang sama sekali baru, dan setelah itu datanglah tuhanmu dengan cara yang tidak diketahui hakikatnya sama sekali oleh manusia; dan malaikat menunggu perintah tuhan sambil berbaris-baris penuh kepatuhan. Dan pada hari itu diperlihatkan neraka jahanam kepada orang kafir agar mereka melihat dengan mata kepada sendiri apa yang dahulu mereka ingkari. Ketika semua itu terjadi, maka pada hari itu sadarlah manusia yang ingkar atas kealpaannya, tetapi tidak berguna lagi baginya kesadaran itu. Kesempatan untuk bertobat sudah tiada. Kini tiba saatnya untuk menghitung dan mempertanggungjawabkan perbuatan mereka. Betapa besar penyesalan orang kafir pada hari itu. Dia berkata dengan penuh kesadaran, 'alangkah baiknya sekiranya di dunia dahulu aku beriman dan mengerjakan amal saleh untuk kenyamanan hidupku di akhirat ini. ' penyesalan itu sudah tidak berguna. Maka, berbahagialah kini orang yang membekali diri di dunia dengan iman dan amal saleh."
  }
]