[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Sepatutnya keadaan kalian seperti ini. bila bumi diguncang, sebagian menghancurkan sebagian lainnya. Dan tuhanmu datang untuk menetapkan keputusan diantara makhluk NYA,sedangkan para malaikat berbaris."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Tidak sepatutnya perbuatan kalian seperti ini. Jika bumi telah digerakkan dengan keras dan diguncang gempa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Ini merupakan cercaan terhadap kejahatan-kejahatan tersebut yang akan mendapat perhitungan pada hari kiamat. Pada hari itu bumi benar-benar akan dihancurkan, gunung-gunung akan saling berhantaman sehingga akan luluh lantak, setiap bagiannya akan berhamburan akibat goncangan yang Allah ciptakan. Kemudian bumi akan menjadi hamparan luas, tidak ada sedikitpun gundukan pada permukaannya. Pada hari itu Allah akan datang untuk memberi keputusan di antara para hamba, dan para malaikat yang bersamanya akan membentuk barisan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. كَلَّآ (Jangan (berbuat demikian)) Yakni perbuatan ini tidak pantas kalian lakukan. إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا (Apabila bumi digoncangkan berturut-turut) Yakni digoncang berkali-kali. Atau dihancurkan gunung-gunungnya hingga menjadi rata."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "21-22 . Seorang alim berkata : Telah menceritakan kepadaku salah seorang ikhwah, bahwasanya sebuah keluarga yang didalamnya ada tiga orang anak bersaudara, anak yang paling besar adalah seorang hafidz al-Qur'an dan berbicara dengan bahasa yang fasih, pada suatu ketika anak itu sedang bermain kemudian ibunya membuka siaran radio, dan ketika itu radio sedang menyiarkan rekaman murottal al-Qur'an surah al-Fajr, seketika sang ibu terkejut tatkala melihat anaknya meninggalkan permainan yang sedang ia sibuk dengannya, sang anak kemudian berdiam diri memfokuskan pendengarannya kepada murottal al-Qur'an itu, sedangkan saudara-saudaranya yang lain masih asyik bermain dengan mainan mereka, karena terkejut sang ibu pun bertanya kepada anaknya : \"kenapa kamu berhenti bermain wahai anakkau ?\" sang anak kemudian berkata :\"aku merasa seakan-akan sedang melayang diudara, dan tatkala aku mendengar firman Allah : { كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا } seketika aku pun takut dan merinding."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Kalian sangat mencintai harta benda. {Janganlah begitu} : Tahanlah diri kalian dari hal ini. Ketika bumi diguncangkan berkali-kali, yaitu diguncangkan sampai setiap bangunan di atasnya hancur sehingga menjadi rata dengan tanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jangan sekali-kali begitu. Apabila bumi diguncangkan} diguncangkan {dengan guncangan berturut-turut} guncangan demi guncangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Jangan (berbuat demikian),” yakni, tidaklah semua harta yang kalian cintai dan semua kenikmatan yang kalian perlombakan akan kekal bersama kalian. Tapi di hadapan kalian terdapat hari besar dan huru-hara hebat yang menggoncangkan bumi dan gunung hingga dibuat menjadi hamparan yang datar, yang tidak ada yang curam ke bawah dan tidak pula menjulang tinggi. Kemudian Allah datang untuk memberi putusan di antara para hambaNYa di dalam naungan awan dan datanglah para malaikat mulia, seluruh penghuni langit “berbaris-baris,” yakni rapi baris demi baris. Setiap langit mendatangkan para malaikatnya secara berbaris-baris, yang meliputi semua yang berada di bawah mereka. Barisan-barisan ini adalah barisan penuh ketundukan dan merendah pada Yang Maharaja lagi Mahaperkasa. “Dan pada hari itu diperlihatkan Neraka Jahanam,” digiring oleh para malaikat dengan belenggu. Bila semua hal ini terjadi, “pada hari itu ingatlah manusia,” akan kebaikan dan keburukan yang pernah dilakukan, “akan tetapi mengingat itu tidak berguna lagi baginya,” sudah terlambat dan waktunya sudah hilang. “Dia mengatakan,” seraya menyesali apa yang telah disia-siakan di sisi Allah, “Alangkah baiknya kiranya aku dahulu mengerjakan (amal shalih) untuk hidupku ini,” yang kekal dengan amal baik. Sebagaimana Firman Allah : seraya berkata: “Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul”. Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku)” (QS. Al-Furqon : 27-28). Dalam ayat ini terdapat petunjuk bahwa kehidupan yang layak dicari kesempurnaannya dan layak dicari kenikmatannya uang sempurna adalah kehidupan di dalam negeri abadi, karena itu adalah negeri yang kekal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah menjelaskan bagaimana akhir dari kehidupan dunia yang didalamnya akan terjadi berbagai macam peristiwa hebat, berpindahnya kehidupan dunia menuju kehidupan akhirat, agar manusia ingat kepada peristiwa-peristiwa dahsyat itu, sehingga mereka tidak terjerumus ke dalam sifat-sifat buruk yang telah disebutkan, dan lalai dari mengingat akhirat, harta telah menjauhkan mereka dari mengingat akhirat, kecintaan mereka kepada dunia menjadi sebab jatuhnya iman mereka kepada kehinaan dunia. { كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا } Dan waspadalah kalian, ketika bumi ini digucangkan secara berturut-turut, gunung-gunung akan beterbangan dan mengekuarkan isi perutnya, ketika bumi ini diguncangkan dengan guncangan yang sekeras-kerasnya, maka semua yang ada diatasnya akan hancur lebur berantakan, semua yang hidup diatasnya akan binasa, gunung-gunung yang berterbangan akan saling bertabrakan dan hancur. { كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا } Bumi diguncangkan berkali-kali, dan bukan hanya sekali guncangan, guncangan setelah guncangan yang dahsyat, Allah berfriman : { وَيَسْأَلُونَكَ عَنِ الْجِبَالِ فَقُلْ يَنْسِفُهَا رَبِّي نَسْفًا , فَيَذَرُهَا قَاعًا صَفْصَفًا , لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا } ( Dan mereka bertanya kepadamu tentang gunung-gunung, maka katakanlah: “Tuhanku akan menghancurkannya (di hari kiamat) sehancur-hancurnya, , Maka Dia akan menjadikan (bekas) gunung-gunung itu datar sama sekali , Tidak ada sedikitpun kamu lihat padanya tempat yang rendah dan yang tinggi-tinggi ) [ Thaha : 105-107 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Jangan (berbuat demikian). Apabila bumi digoncangkan berturut-turut, dan datanglah Tuhanmu; sedang malaikat berbaris-baris, dan pada hari itu diperlihatkan neraka Jahanam; dan pada hari itu ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya. \" Allah Subhaanahu Wa Ta'ala memberikan peringatan kepada manusia akan kedatangan hari kiamat, إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا \" Apabila bumi digoncangkan berturut-turut \" sehingga tidak terlihat ada yang bengkok dan menjorok, gunung-gunung digoncangkan, bagunan-bagunannya, pepohonannya, bumi akan dibentangkan bagai karpet yang terbentang, semua manusia akan berada di atasnya di satu tempat, akan terdengan seorang penyeru, dan akan dibentangkan pandangan mata. Pada hari itu يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّى لَهُ الذِّكْرَى (23) يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي \" ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya.Dia mengatakan: \"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.\" Tetapi kesempatan itu sudah terlewati, karena ketika kita di dunia adalah kesempatan untuk beramal, waktu untuk kesempatan, seseorang bisa memanfaatkannya selama menetap di dalamnya, sebagaimana orang mumin dari keluarga fir'aum: يَا قَوْمِ إِنَّمَا هَذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ \" Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara) dan sesungguhnya akhirat itulah negeri yang kekal.\"(QS. Ghafir: 39) Kenikmatan yang dinikmati manusia sebagaimana seorang yang berada dlam perjalanan menikmati perbekalan safar sampai berakhir safarnya. Begitulah dunia. Ambilah pelajaran untuk kedepan dari apa telah terjadi. Segala yang sudah berlalu terlewati begitu saja seperti sesaat di siang hari, seakan-akan kita sekarang ini diciptakan, begitu juga yang akan datang, akan kita lewati dengan sepatnya, perjalan hidup akan berakhir di tempat yang lain, bukan tenpat menetap kemudian akan ke alam kubur, meski demikian, alam kubur bukanlah tempat menetap, sebagaiamana Allah Ta'ala berfirman: أَلْهَاكُمُ التَّكَاثُرُ (1) حَتَّى زُرْتُمُ الْمَقَابِرَ \" Bermegah-megahan telah melalaikan kamu, sampai kamu masuk ke dalam kubur.\"(QS. At-Takutsur: 1-2) Ada seorang arab badui yang mendengar seseorang membaca ayat ini maka ia berkata: Demi Allah, tidaklah seorang pengunjung akan menetap terus, pasti akan berpisah dengan tempat ini, ini adalah kesimpulan maknya yang kuat dan pemahaman yang baik, yang di dukung oleh ayat-ayat yang banyak, yang jelas menunjukkan demikian seperti firman Allah Ta'ala: ثُمَّ إِنَّكُمْ بَعْدَ ذَلِكَ لَمَيِّتُونَ (15) ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ \" Kemudian, sesudah itu, sesungguhnya kamu sekalian benar-benar akan mati. Kemudian, sesungguhnya kamu sekalian akan dibangkitkan (dari kuburmu) di hari kiamat.\"(QS. Al-Mu'minun: 15-16) Jangan (berbuat demikian). Apabila bumi digoncangkan berturut-turut, dan datanglah Tuhanmu; sedang malaikat berbaris-baris, dan pada hari itu diperlihatkan neraka Jahanam; dan pada hari itu ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya. \" Allah Subhaanahu Wa Ta'ala memberikan peringatan kepada manusia akan kedatangan hari kiamat, إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا \" Apabila bumi digoncangkan berturut-turut \" sehingga tidak terlihat ada yang bengkok dan menjorok, gunung-gunung digoncangkan, bagunan-bagunannya, pepohonannya, bumi akan dibentangkan bagai karpet yang terbentang, semua manusia akan berada di atasnya di satu tempat, akan terdengan seorang penyeru, dan akan dibentangkan pandangan mata. Pada hari itu يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّى لَهُ الذِّكْرَى (23) يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي \" ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya.Dia mengatakan: \"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.\" Tetapi kesempatan itu sudah terlewati, karena ketika kita di dunia adalah kesempatan untuk beramal, waktu untuk kesempatan, seseorang bisa memanfaatkannya selama menetap di dalamnya, sebagaimana orang mumin dari keluarga fir'aum: يَا قَوْمِ إِنَّمَا هَذِهِ الْحَيَاةُ الدُّنْيَا مَتَاعٌ وَإِنَّ الْآخِرَةَ هِيَ دَارُ الْقَرَارِ \" Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara) dan sesungguhnya akhirat itulah negeri yang kekal.\"(QS. Ghafir: 39) Kenikmatan yang dinikmati manusia sebagaimana seorang yang berada dlam perjalanan menikmati perbekalan safar sampai berakhir safarnya. Begitulah dunia. Ambilah pelajaran untuk kedepan dari apa telah terjadi. Segala yang sudah berlalu terlewati begitu saja seperti sesaat di siang hari, seakan-akan kita sekarang ini diciptakan, begitu juga yang akan datang, akan kita lewati dengan sepatnya, perjalan hidup akan berakhir di tempat yang lain, bukan tenpat menetap kemudian akan ke alam kubur, meski demikian, alam kubur bukanlah tempat menetap, sebagaiamana Allah Ta'ala berfirman: أَلْهَاكُمُ التَّكَاثُرُ (1) حَتَّى زُرْتُمُ الْمَقَابِرَ \" Bermegah-megahan telah melalaikan kamu, sampai kamu masuk ke dalam kubur.\"(QS. At-Takutsur: 1-2) Ada seorang arab badui yang mendengar seseorang membaca ayat ini maka ia berkata: Demi Allah, tidaklah seorang pengunjung akan menetap terus, pasti akan berpisah dengan tempat ini, ini adalah kesimpulan maknya yang kuat dan pemahaman yang baik, yang di dukung oleh ayat-ayat yang banyak, yang jelas menunjukkan demikian seperti firman Allah Ta'ala: ثُمَّ إِنَّكُمْ بَعْدَ ذَلِكَ لَمَيِّتُونَ (15) ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ \" Kemudian, sesudah itu, sesungguhnya kamu sekalian benar-benar akan mati. Kemudian, sesungguhnya kamu sekalian akan dibangkitkan (dari kuburmu) di hari kiamat.\"(QS. Al-Mu'minun: 15-16)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 21: 21-22. Allah menegur mereka orang-orang kafir dengan mengatakan : Jika kalian bersikap keras wahai orang-orang kafir atas kekufuran kalian dan atas amalan-amalan buruk ini, maka tunggulah hari kiamat, yaitu hari yang bumi akan bergerak dengan gerakan yang dahsyat dan dengan gempa yang dahsyat. Allah akan datang (pada hari itu) sesuai dengan dzat-Nya, kemuliaannya-Nya dan kebesaran-Nya. Malaikat akan datang bershaf-shaf sebagai pengagungan kepada-Nya. وَجَآءَ رَبُّكَ disini terdapat firqah (kelompok) seperti Asyairah, Mu’tazilah dan selain keduanya menakwilkan sebagian sifat Allah, diantaranya adalah sifat datang Allah. Mereka (Asyairah, dll.) mengatakan : وَجَآءَ رَبُّكَ maksudnya adalah datang perintah-Nya. Adapun Ahlussunnah wal Jama’ah menetapkan atas setiap apa yang Allah tetapkan atas diri-Nya dan apa yang ditetapkan oleh Rasul ﷺ dalam sunnahnya; Dengan tanpa mengubah, menafikan, menyerupakan, dan menyamakan dengan makhluk. Sifat datang telah diketahui maknanya, diimani, dan ditetapkan (oleh Ahlussunnah). Ahlussunnah mengatakan bahwa sifat datangnya Allah sebagaimana yang mencocoki dengan kebesaran-Nya, tidak dapat dimengerti bagaimananya dan tata cara (turun-Nya), sebagaimana tidaklah diketahui bagaimana Dzat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidaklah semua harta yang kamu cintai itu akan kekal, bahkan di hadapanmu ada hari yang agung dan peristiwa yang dahsyat dimana bumi dan gunung diratakan sehingga menjadi rata tanpa ada tempat tinggi dan tanpa ada tempat rendah. Sehingga semua bangunan di atasnya hancur luluh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 21",
    "description": "21-24. Sekali-kali tidak! janganlah kamu berbuat demikian. Apabila bumi diguncangkan berturut-turut, memuntahkan isinya, hancur lebur, kemudian muncul bumi yang sama sekali baru, dan setelah itu datanglah tuhanmu dengan cara yang tidak diketahui hakikatnya sama sekali oleh manusia; dan malaikat menunggu perintah tuhan sambil berbaris-baris penuh kepatuhan. Dan pada hari itu diperlihatkan neraka jahanam kepada orang kafir agar mereka melihat dengan mata kepada sendiri apa yang dahulu mereka ingkari. Ketika semua itu terjadi, maka pada hari itu sadarlah manusia yang ingkar atas kealpaannya, tetapi tidak berguna lagi baginya kesadaran itu. Kesempatan untuk bertobat sudah tiada. Kini tiba saatnya untuk menghitung dan mempertanggungjawabkan perbuatan mereka. Betapa besar penyesalan orang kafir pada hari itu. Dia berkata dengan penuh kesadaran, 'alangkah baiknya sekiranya di dunia dahulu aku beriman dan mengerjakan amal saleh untuk kenyamanan hidupku di akhirat ini. ' penyesalan itu sudah tidak berguna. Maka, berbahagialah kini orang yang membekali diri di dunia dengan iman dan amal saleh"
  }
]