[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Sepatutnya keadaan kalian seperti ini. bila bumi diguncang, sebagian menghancurkan sebagian lainnya. Dan tuhanmu datang untuk menetapkan keputusan diantara makhluk NYA,sedangkan para malaikat berbaris."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Lalu Rabbmu -wahai Rasul- datang untuk memvonis perkara di antara hamba-hamba-Nya, dan datang pula Malaikat dengan berbaris rapi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَجَآءَ رَبُّكَ (dan datanglah Tuhanmu) Untuk memutuskan perkara di antara hamba-hamba-Nya. وَالْمَلَكُ صَفًّا صَفًّا(sedang malaikat berbaris-baris) Yakni malaikat datang bershaf-shaf."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "21-22 . Seorang alim berkata : Telah menceritakan kepadaku salah seorang ikhwah, bahwasanya sebuah keluarga yang didalamnya ada tiga orang anak bersaudara, anak yang paling besar adalah seorang hafidz al-Qur'an dan berbicara dengan bahasa yang fasih, pada suatu ketika anak itu sedang bermain kemudian ibunya membuka siaran radio, dan ketika itu radio sedang menyiarkan rekaman murottal al-Qur'an surah al-Fajr, seketika sang ibu terkejut tatkala melihat anaknya meninggalkan permainan yang sedang ia sibuk dengannya, sang anak kemudian berdiam diri memfokuskan pendengarannya kepada murottal al-Qur'an itu, sedangkan saudara-saudaranya yang lain masih asyik bermain dengan mainan mereka, karena terkejut sang ibu pun bertanya kepada anaknya : \"kenapa kamu berhenti bermain wahai anakkau ?\" sang anak kemudian berkata :\"aku merasa seakan-akan sedang melayang diudara, dan tatkala aku mendengar firman Allah : { كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا } seketika aku pun takut dan merinding."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Datanglah perintah Tuhanmu dan takdirNya yang tidak dapat diubah, (Perintahnya datang) diiringi para malaikat terpilih (yang berjejer) dalam barisan-barisan atau berbaris sesuai posisi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhanmu datang} Tuhanmu datan untuk menentukan keputusan di antara ciptaanNya {juga para malaikat} para malaikat {yang berbaris-baris} baris demi baris"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Jangan (berbuat demikian),” yakni, tidaklah semua harta yang kalian cintai dan semua kenikmatan yang kalian perlombakan akan kekal bersama kalian. Tapi di hadapan kalian terdapat hari besar dan huru-hara hebat yang menggoncangkan bumi dan gunung hingga dibuat menjadi hamparan yang datar, yang tidak ada yang curam ke bawah dan tidak pula menjulang tinggi. Kemudian Allah datang untuk memberi putusan di antara para hambaNYa di dalam naungan awan dan datanglah para malaikat mulia, seluruh penghuni langit “berbaris-baris,” yakni rapi baris demi baris. Setiap langit mendatangkan para malaikatnya secara berbaris-baris, yang meliputi semua yang berada di bawah mereka. Barisan-barisan ini adalah barisan penuh ketundukan dan merendah pada Yang Maharaja lagi Mahaperkasa. “Dan pada hari itu diperlihatkan Neraka Jahanam,” digiring oleh para malaikat dengan belenggu. Bila semua hal ini terjadi, “pada hari itu ingatlah manusia,” akan kebaikan dan keburukan yang pernah dilakukan, “akan tetapi mengingat itu tidak berguna lagi baginya,” sudah terlambat dan waktunya sudah hilang. “Dia mengatakan,” seraya menyesali apa yang telah disia-siakan di sisi Allah, “Alangkah baiknya kiranya aku dahulu mengerjakan (amal shalih) untuk hidupku ini,” yang kekal dengan amal baik. Sebagaimana Firman Allah : seraya berkata: “Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul”. Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku)” (QS. Al-Furqon : 27-28). Dalam ayat ini terdapat petunjuk bahwa kehidupan yang layak dicari kesempurnaannya dan layak dicari kenikmatannya uang sempurna adalah kehidupan di dalam negeri abadi, karena itu adalah negeri yang kekal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَجَاءَ رَبُّكَ } Dan tuhanmu akan datang dengan dzat-Nya, Dia datang dengan cara yang sesuai dengan keagungan-Nya, dia akan datang pada hari kiamat untuk menghakimi setiap hamba-Nya, dan itu ketika seluruh manusia telah dibangkitkandari kuburnya dan dikumpulkan di padang mahsyar, Semua manusia dikumpulkan mulai dari manusia pertama, hingga manusia yang terakhir. Setiap manusia akan dibangkitkan dari kuburnya untuk menghadapi hari kiamat dan dihisab amal perbuatannya selama di dunia. Bagaimanakah kondisi kita pada hari itu? Dari ‘Aisyah radhiyallahu ‘anha, Rasulullah shallallahu ‘alaihi wa sallam bersabda: “Manusia akan dikumpulkan pada hari Kiamat dalam keadaan tidak beralas kaki, tidak berpakaian dan belum dikhitan.” (HR. Muslim) Seluruh umat manusia, termasuk para nabi dan rasul, dibangkitkan kemudian digiring menghadap Allah di padang Mahsyar dalam keadaan telanjang, tanpa alas kaki, dan tidak dikhitan. Keadaan ini menunjukkan bahwa manusia itu fakir, miskin dan lemah dihadapan Allah. Rasulullah pun juga bersabda pada hadistnya bahwa manusia akan digiring sesuai dengan amal perbuatannya, “Sesungguhnya kalian akan dikumpulkan (ke Padang Mahsyar) dalam keadaan berjalan, dan (ada juga yang) berkendaraan, serta (ada juga yang) diseret di atas wajah-wajah kalian.” (HR. Tirmidzi). Pada hari itu manusia akan merasakan terik matahari yang didekatkan jaraknya hingga 1 mil sehingga mereka berkeringat. Di antara mereka ada yang keringatnya sampai kedua mata kakinya. Ada yang sampai kedua lututnya, dan ada yang sampai pinggangnya, serta ada yang tenggelam dalam keringatnya sesuai dengan amal perbuatannya di dunia. Hari dikumpulkannya manusia di padang mahsyar juga merupakan hari penghisaban amal, hari dimana amal manusia diperhitungkan. Pada hari itu manusia akan dibagi menjadi beberapa kelompok. Pertama, kelompok kaum mukmin yang masuk surga tanpa hisab dan tanpa azab, kelompok ini adalah mereka yang tidak minta diruqyah, dan tidak meramal nasib serta bertawakal kepada Allah. Kedua, kelompok yang dihisab dengan mudah. Merekalah orang yang diberi catatan amal dari sebelah kanannya. Kepada mereka hanya diperlihatkan catatan amal mereka, lalu dimaafkan. Seperti yang diceritakan pada hadist Bukhari, “Sesungguhnya Allah akan mendekatkan orang mukmin, lalu Dia meletakkan tirai-Nya dan menutupinya (dari keramaian), Dia berfirman, “Kamu kenal dosa ini? Kamu kenal dosa ini? Ia menjawab, “Ya, wahai Tuhanku” sehingga apabila ia telah mengakui dosa-dosanya dan merasakan bahwa dirinya akan binasa, Allah berfirman,”Aku telah menutupi dosamu di dunia dan Aku akan mengampuninya pada hari ini.” Maka ia diberikan catatan amal kebaikannya. Sedangkan orang-orang kafir dan munafik, maka para saksi berkata (di hadapan seluruh makhluk), “Merekalah orang-orang yang mendustakan Tuhan mereka. Ingatlah! Sesungguhnya laknat Allah ditimpakan kepada orang-orang yang zalim.” (HR. Bukhari) Ketiga, kelompok yang dihisab dengan berat, manusia dalam kelompok ini meruupakan manusia yang amal keburukannya lebih banyak daripada kebaikannya. Merekalah orang yang diberi catatan amal dari sebelah kirinya. Allah berfirman, “Adapun orang yang diberikan kepadanya kitabnya dari sebelah kirinya, maka dia berkata, “Wahai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini). Dan aku tidak mengetahui apa hisab terhadap diriku.–Wahai kiranya kematian itulah yang menyelesaikan segala sesuatu. Hartaku sekali-kali tidak memberi manfaat kepadaku. Telah hilang kekuasaanku dariku.” (QS. Al Haaqqah: 25-29) Begitulah kondisi manusia di padang mahsyar seperti yang digambarkan oleh hadist-hadist Rasulullah shallallahu ‘alaihi wa sallam. Semoga kita dapat termasuk dalam kelompok yang mulia, Aamiin. { وَالْمَلَكُ صَفًّا صَفًّا } Dan para Malaikat akan datang dengan bershaf-shaf mengikuti tuhannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah subhaanahu wa Ta'ala menyebutkan yang tejadi pada hari ini, Allah berfirman وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا \"\" Maknanya: Barisan demi barisan, وَجَاءَ رَبُّكَ \"\" Kedatangan ini adalah kedatangan Allah 'Azza Wa Jalla, karena fi'il (kata kerja) disandarkan kepada Allah, dan semua fi'I; yang disandarkan kepada Allah maka ia berdiri (ada) pada diri-Nya bukan pada yang lainnya. Ini adalah sebuah kaedah dalam bahasa Arab, dan ini jyg kaedah dalam memahami nama-nama dan sifat-sifat Allah, segala apa yang disandarkan Allah (berupa nama dan sifat) kepada diri-Nya maka itu kepunyaan-Nya bukan yang lain-Nya. Berdasarkan kaedah ini maka yang datang di sini adalah Allah 'Azza wa Jalla. Tidak seperti yang selewengkan oleh para ahlu ta'thil, yang mana mereka mengatakan: Ini adalah kedatang perkara Allah. Pemahaman seperti ini adalah mengeluarkan kalam (pembicaraan) dari makna yang zahir tanpa dalil. Sedangkan akidah yang kita yakini adalah menjalankan ucapan Allah dan Rasul-Nya shallallaahu 'alaihi wasallam sesuai yang zahir, dan tidak menyelewengkannya, dan kita katakana: Sesungguhnya Allah Ta'ala yang datang pada hari kiamat, Dialah sendiri yang datang. Namun bagaimana bentuk kedatangan Allah? Inilah yang tidak kita miliki ilmu tentangnya dan bagaimana caranya Allah datang? Pertanyaan tentang hal semacam ini adalah bid'ah sebagaimana dikatakan Imam Malik rahimahullah ketika beliau ditanya berkaitan dengan firman Allah ta'ala: \"Ar-Rahman (Allah) beristiwa di atas arsy\"(QS. Thoha: 5) Imam Malik menundukkankepalanya hingga bercucuran keringat karena dahsyatnya pertanyaan tersebut di dalam hatinya, karena itu adalah pertanyaan besar, pertanyaan emnyimpang, pertanyaan ahli bid'ah yang menginginkan keburukan, kemudia beliau mengangkat kepalanya, lalu berkata: \" Istiwa (maknanya) tidak asing, kaif (bagaimana cara dan bentuknya) tidak dapat dibayangkan,, mengimaninya adalah kewajiban dan bertanya tentangnya adalah bid'ah\" penggalan yang menjadi bukti adalah perkataan beliau: \" Bertanya tentangnya adalah bid'ah \" Ambilah pelajaran dari sini pada semua sifat Allah, jika ada yang bertanya kepada kita: Sesungguhnya Allah berfirman: لِمَا خَلَقْتُ بِيَدَيَّ \"yang kuciptakan dengan kedua tangan-Ku\"(QS. Shaf: 75) Maksudnya: Adam, bagaiaman penciptaannya dengan tangan-Nya? Kita jawab: Ini adalah pertanyaan bid'ah, ia mengatakan lagi: Saya ingin ilmu, saya tidak suka jika ada yang tersembunyi sediikit saja dari sifat-sifat Tuhanku, maka saya ingin tahu bagaimana penciptaan-Nya? Kita katakana kepadanya: Kami akan bertanya kepadamu dengan pertanyaan-pertanyaan yang mudah, siapakan yang lebih bersemangat dalam ilmu anda ataukan para sahabat radhiyallaahu 'anhum? Bisa menjawab: Ya, atau pun menjawab: tidak. Diprediksikan ia akan menjawab: Tidak. Apakah orang yang ditanya olehmu lebih tahu tentang gambaran kaifiyah sifat-sifat Allah 'Azza Wa Jalla ataukah Rasuk 'alaihissholaatu wassalaam? Ia pasti menjawab: Rasul, jika begitu maka para sahabat lebih semangat dalam menuntut ilmu, sedangkan orang yang ditanya dalam pertanyaan saya tadi (rasul) lebih tahu dari orang yang sedang engkau tanya (saya) walaupun begitu, para sahabat tidak bertanya kepadanya, karena mereka berpegang teguh pada adab bersama Rasulullah shallallaahu 'alaihi wa sallam, mereka berkata dalam hati mereka, atau bahkan dengan lisan-lisan mereka: Sungguh Allah lebih mulia dan lebih agung dari sekedar apa yang terlintas di pemahaman-pemahaman dan akal-akal kita berkaitan dengan gambaran sifat-sifat-Nya, Allah 'azza wa Jalla berkata dalam kitab-Nya berkaitan dengan perkara-perkara yang masuk akal: وَلَا يُحِيطُونَ بِهِ عِلْمًا \"sedang ilmu mereka tidak dapat meliputi ilmu-Nya.\"(QS. Thoha: 110) dan dalam perkara-perkara yang dijangkai panca indra: لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يُدْرِكُ الْأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ \" Dia tidak dapat dicapai oleh penglihatan mata, sedang Dia dapat melihat segala penglihatan itu dan Dialah Yang Maha Halus lagi Maha Mengetahui.\"(QS. Al-An'aam: 103) Lalu kita katakan: Wahai saudaraku, peganglah adab, jangan bertanya bagaimana cara Allah menciptakan Adam dengan tangan-Nya! Sesungguhnya oertanyaan ini adalah bid'ah. Begitupun sifat Allah yang lainnya, seandainya ditanya, bagaimana mata Allah 'Azza Wa Jalla? Kita katakana kepadanya: pertanyaan ini adalah bid'ah. Jika bertanya bagaiamana bentuk tangan Allah 'Azza Wa Jalla: maka kita katakana: Pertanyaan ini adalah bid'ah, hendaknya kamu beradab, dan tidak bertanya tentang bagaimana sifat-sifat Allah 'Azza Wa Jalla, ketika Allah berfirman dalam ayat yang mulia: وَجَاءَ رَبُّكَ \"dan datanglah Rabbmu\" kemudian bertanya bagaimana datang-Nya? Kita katakana: Ini bid'ah, peganglah kaedah ini, setiap orang yang yang bertanyak bagaimana sifat-sifat Allah maka dia mubtadi' yang menyimpang, dia bertanya sesuatu yang tidak mungkin dijangkau. Sikap kita kepada ayat semisal ayat ini: \"\" kita beriman bahwa Allah akan datang, tetapi dengan cara bagaimana? Wallaahu a'lam. Dalilnya adalah firman Allah Ta'ala: لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ \" Tidak ada sesuatu pun yang serupa dengan Dia, dan Dia-lah Yang Maha Mendengar lagi Maha Melihat. \"(QS, Asy-Syura: 11) Maka, kita mengetahui peniadaan dan tidak mengetahui dengan penetapan sifat itu, maksudnya kita mengetahui bahwa Allah tidak mungkin datang sebagaimana kedatangan manusia, tetaoi kita tidak menetapkan bagaimana (separti apa) bentuk datangnya Allah, inilah kewajiban kita. Firman-Nya: al-Malaku: aliflam di sini menunjukkan umum, maksudnya: meliputi semua malaikat, berdatangan, turun dan meliputi manusia, malaikat dari langit dunia turun, lalu malaikat langit kedua turun, dan begitu seterusnya, mereka meliputi semua manusia, menampakkan keagungan, dengan bigutu, sesungguhnya mereka semua tidak akan mampu lari kekanan dan kekiri, tetapi ini adalah menampakkan keagungan Allah dan gentingnya pada hari bersar ini, para malaikat akan meliputi seluruh makhluk. Hari ini adalah hari yang dipersaksikan, malaikat,manusia jin dan segala hewan-hewan akan menyaksikannya: وَإِذَا الْوُحُوشُ حُشِرَتْ \" dan apabila binatang-binatang liar dikumpulkan, \"(QS. At-Takwir: 5) Hari tersebut adalah hari yang agung, tidak bisa kita bayangkan saat ini, karena hari tersebut lebih besar dari yang kita bayangkan sekali pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 22: 21-22. Allah menegur mereka orang-orang kafir dengan mengatakan : Jika kalian bersikap keras wahai orang-orang kafir atas kekufuran kalian dan atas amalan-amalan buruk ini, maka tunggulah hari kiamat, yaitu hari yang bumi akan bergerak dengan gerakan yang dahsyat dan dengan gempa yang dahsyat. Allah akan datang (pada hari itu) sesuai dengan dzat-Nya, kemuliaannya-Nya dan kebesaran-Nya. Malaikat akan datang bershaf-shaf sebagai pengagungan kepada-Nya. وَجَآءَ رَبُّكَ disini terdapat firqah (kelompok) seperti Asyairah, Mu’tazilah dan selain keduanya menakwilkan sebagian sifat Allah, diantaranya adalah sifat datang Allah. Mereka (Asyairah, dll.) mengatakan : وَجَآءَ رَبُّكَ maksudnya adalah datang perintah-Nya. Adapun Ahlussunnah wal Jama’ah menetapkan atas setiap apa yang Allah tetapkan atas diri-Nya dan apa yang ditetapkan oleh Rasul ﷺ dalam sunnahnya; Dengan tanpa mengubah, menafikan, menyerupakan, dan menyamakan dengan makhluk. Sifat datang telah diketahui maknanya, diimani, dan ditetapkan (oleh Ahlussunnah). Ahlussunnah mengatakan bahwa sifat datangnya Allah sebagaimana yang mencocoki dengan kebesaran-Nya, tidak dapat dimengerti bagaimananya dan tata cara (turun-Nya), sebagaimana tidaklah diketahui bagaimana Dzat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala akan datang pada hari Kiamat untuk menyelesaikan permasalahan di antara hamba-hamba-Nya dalam naungan awan, namun kita tidak mengetahui bagaimana datangnya (mengimaninya wajib dan menanyakannya adalah bid’ah), wallahu a’lam. Demikian pula para malaikat dari setiap langit akan datang satu shaf-satu shaf dan mengepung manusia. Berbarisnya mereka ini adalah berbaris dengan sikap tunduk dan merendahkan diri kepada Allah Subhaanahu wa Ta'aala Raja Yang Mahaperkasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 22",
    "description": "21-24. Sekali-kali tidak! janganlah kamu berbuat demikian. Apabila bumi diguncangkan berturut-turut, memuntahkan isinya, hancur lebur, kemudian muncul bumi yang sama sekali baru, dan setelah itu datanglah tuhanmu dengan cara yang tidak diketahui hakikatnya sama sekali oleh manusia; dan malaikat menunggu perintah tuhan sambil berbaris-baris penuh kepatuhan. Dan pada hari itu diperlihatkan neraka jahanam kepada orang kafir agar mereka melihat dengan mata kepada sendiri apa yang dahulu mereka ingkari. Ketika semua itu terjadi, maka pada hari itu sadarlah manusia yang ingkar atas kealpaannya, tetapi tidak berguna lagi baginya kesadaran itu. Kesempatan untuk bertobat sudah tiada. Kini tiba saatnya untuk menghitung dan mempertanggungjawabkan perbuatan mereka. Betapa besar penyesalan orang kafir pada hari itu. Dia berkata dengan penuh kesadaran, 'alangkah baiknya sekiranya di dunia dahulu aku beriman dan mengerjakan amal saleh untuk kenyamanan hidupku di akhirat ini. ' penyesalan itu sudah tidak berguna. Maka, berbahagialah kini orang yang membekali diri di dunia dengan iman dan amal saleh"
  }
]