[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Pada hari besar itu neraka jahanam didatangkan. hari itu orang kafir sadar dan bertaubat. tetapi bagaimana kesadaran dan taubatnya bermanfaat baginya sementara di dunia ia melalaikannya dan waktunya telah berlalu? Dia berkata “seandainya didunia aku telah melakukan amal-amal yang bermanfaat bagiku di akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Lalu didatangkan pada hari itu Neraka Jahanam yang mempunyai tujuh puluh ribu kekang, pada setiap kekang ada tujuh puluh ribu malaikat yang mengendalikannya. Pada hari itu manusia ingat apa yang telah mereka lalaikan di sisi Allah, tapi bagaimana mungkin ingatan itu bisa berguna bagi mereka di hari itu, karena hari itu adalah hari Pembalasan, bukan Hari beramal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Pada hari yang sulit itu para malaikat akan mendatangkan neraka Jahannam dan pintu-pintunya akan dibuka. Pada saat yang sulit itu, orang yang zalim akan teringat kemaksiatan-kemaksiatannya, dia ingin mengungkapkan pertaubatan, namun bagaimana dia dapat melakukannya? Sungguh pertaubatan itu tidak lagi berguna baginya. Kemudian kamu dapat melihatnya mengulang-ulang ucapan penyesalan: “Betapa menyesalnya aku, seandainya saja aku melakukan amalan-amalan shalih di dunia sebelum aku mati, agar di kehidupan akhirat yang kekal aku dapat hidup dengan selamat dari azab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَجِا۟ىٓءَ يَوْمَئِذٍۭ بِجَهَنَّمَ ۚ (Dan pada hari itu diperlihatkan neraka Jahannam) Yakni neraka ditarik oleh para malaikat dengan tali kekang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Neraka Jahanam didatangkan dan ditampakkan pada hari itu, untuk mengingatkan manusia tentang perbuatan mereka yang melampaui batas dan kemaksiatan mereka di dunia. Dari sisi mana mereka dapat mengambil manfaat dari pengingat itu, sedangkan waktu telah berlalu. Itu adalah istifham (pertanyaan) yang menunjukkan makna nafi (negasi), jadi pengingat dan taubat sudah tidak berlaku bagi dia pada hari itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan pada hari itu neraka Jahanam didatangkan, lalu manusia pada hari itu sadar} lalu orang-orang kafir mengambil pelajaran {Akan tetapi, bagaimana bisa kesadaran itu bermanfaat baginya} bagaimana peringatan dan pelajaran itu berguna baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Jangan (berbuat demikian),” yakni, tidaklah semua harta yang kalian cintai dan semua kenikmatan yang kalian perlombakan akan kekal bersama kalian. Tapi di hadapan kalian terdapat hari besar dan huru-hara hebat yang menggoncangkan bumi dan gunung hingga dibuat menjadi hamparan yang datar, yang tidak ada yang curam ke bawah dan tidak pula menjulang tinggi. Kemudian Allah datang untuk memberi putusan di antara para hambaNYa di dalam naungan awan dan datanglah para malaikat mulia, seluruh penghuni langit “berbaris-baris,” yakni rapi baris demi baris. Setiap langit mendatangkan para malaikatnya secara berbaris-baris, yang meliputi semua yang berada di bawah mereka. Barisan-barisan ini adalah barisan penuh ketundukan dan merendah pada Yang Maharaja lagi Mahaperkasa. “Dan pada hari itu diperlihatkan Neraka Jahanam,” digiring oleh para malaikat dengan belenggu. Bila semua hal ini terjadi, “pada hari itu ingatlah manusia,” akan kebaikan dan keburukan yang pernah dilakukan, “akan tetapi mengingat itu tidak berguna lagi baginya,” sudah terlambat dan waktunya sudah hilang. “Dia mengatakan,” seraya menyesali apa yang telah disia-siakan di sisi Allah, “Alangkah baiknya kiranya aku dahulu mengerjakan (amal shalih) untuk hidupku ini,” yang kekal dengan amal baik. Sebagaimana Firman Allah : seraya berkata: “Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul”. Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab(ku)” (QS. Al-Furqon : 27-28). Dalam ayat ini terdapat petunjuk bahwa kehidupan yang layak dicari kesempurnaannya dan layak dicari kenikmatannya uang sempurna adalah kehidupan di dalam negeri abadi, karena itu adalah negeri yang kekal."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ ۚ} Dan pada hari itu neraka akan didatangkan dihadapan Allah, Rasulullah Saw. pernah bersabda: Neraka Jahanam pada hari itu di datangkan dengan tujuh puluh ribu kendali yang masing-masing kendali dipegang oleh tujuh puluh ribu malaikat yang menariknya. [ Diriwyatkan oleh Imam Muslim ] , neraka itu didatangkan dan disaksikan oleh seluruh manusia, Allah berfirman : { لَتَرَوُنَّ الْجَحِيمَ , ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ } ( Niscaya kamu benar-benar akan melihat neraka Jahiim, , Dan sesungguhnya kamu benar-benar akan melihatnya dengan ‘ainul yaqin. ) [ At Takatsur : 6-7 ] , dan Allah juga berfirman : { وَبُرِّزَتِ الْجَحِيمُ لِمَنْ يَرَىٰ } ( Dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat. ) [ An Nazi'at : 36 ]. { يَوْمَئِذٍ يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّىٰ لَهُ الذِّكْرَىٰ } Dan pada hari itu pula manusia akan mengingat seluruh amalnya, ketika mereka mengingat apa yang telah diperbuat didunia dari kemaksiatan, mereka pun menginginkan kehidupan dunia itu kembali dan beramal shalih, akan tetapi hal itu tidak mungkin terjadi, dan tidak ada yang menjadi penolong bagi setiap jiwa kecuali amalannya, akan tetapi mengingat amalan pada hari itu tidak lagi bermanfaat, dan hanya dia dengan tuhannya yang akan berurusan mengenai dirinya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Perkara yang ketiga: Dan di antara yang menjadi peringatan pada hari ini setelah kit amengetahui perkara pertama yaitu datangnya Allah, kemudiannya barisan-barisan para malaikat, Allah berfirman: وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ يَوْمَئِذٍ يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّى لَهُ الذِّكْرَى \" dan pada hari itu dihadirkan neraka Jahanam;\" Pada ayat ini tidak disebutkan siapakah yang hadir, tetapi dalam hadits-hadits dijelaskan bahwa neraka akan didatangkan dengan diikat dengan tujuh puluh tali, di setiap talinya, dipegang oleh tujuh puluh ribu malaikat, bagaimana menurut anda kekuatan malaikat> kekuatan yang tidak seperti kekuatan manusia, dan tidak seperti kekuatan jin, tetapi kekuatan malaikat jauh lebih besar. Oleh karena itu, mana kala jin Ifrit berkata kepada Sulaiman: أَنَا آتِيكَ بِهِ \"\" Singgasana ratu Balqis قَبْلَ أَنْ تَقُومَ مِنْ مَقَامِكَ وَإِنِّي عَلَيْهِ لَقَوِيٌّ أَمِينٌ (39) قَالَ الَّذِي عِنْدَهُ عِلْمٌ مِنَ الْكِتَابِ أَنَا آتِيكَ بِهِ قَبْلَ أَنْ يَرْتَدَّ إِلَيْكَ طَرْفُكَ فَلَمَّا رَآهُ مُسْتَقِرًّا عِنْدَهُ \" sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat untuk membawanya lagi dapat dipercaya\" Berkatalah seorang yang mempunyai ilmu dari Al Kitab: \"Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip\". Maka tatkala Sulaiman melihat singgasana itu terletak di hadapannya,\"(QS. An-Naml: 39-40) Para Ulama mengatakan: Karena laki-laki ini berdoa kepada Allah, maka malaikat membawakan singgasana tersebut dari yaman dan didatangkan ke hadapan Sulaiman di syam. Kekuatan malaikat sangat besar, mereka menarik neraka dengan tujuh puluh ribu tali, setiap tali dipegang oleh tujuh puluh ribu malaikat, maka Nampak bahwa neraka itu besar. Apabila neraka melihat penduduknya dari tempat yang jauh, mereka akan mendengarnya dengan amarah dan teriakan, tidak seperti teriakan burung burung dan mesin, tapi teriakan yang memutus jantung كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ سَأَلَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ نَذِيرٌ \". Setiap kali dilemparkan ke dalamnya sekumpulan (orang-orang kafir). Penjaga-penjaga (neraka itu) bertanya kepada mereka: \"Apakah belum pernah datang kepada kamu (di dunia) seorang pemberi peringatan?\"\"(QS. Al-Mulk: 8) Allah 'Azza Wa Jalla juga berfirman : تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ \" hampir-hampir (neraka) itu terpecah-pecah lantaran marah \" terpecah karena sangat marah kepada penduduknya, oleh kerenanya Allah memberikan peringatan kepada kita darinya, tiga perkara tersebut, semuanya adalah peringatan: Kedatangan Rabb Jalla Jalaaluhu, barisan malaikat, yang ketiga dihadirkan neraka jahannam. يَوْمَئِذٍ يَتَذَكَّرُ الْإِنْسَانُ وَأَنَّى لَهُ الذِّكْرَى \" dan pada hari itu diperlihatkan neraka Jahanam; dan pada hari itu ingatlah manusia akan tetapi tidak berguna lagi mengingat itu baginya.\" Maksudnya, apabila Allah datang pada hari kiamat, dan para malaikat datang dengan barisan demi barisan, lalu ,eliputi semua makhluk kemudian terjari kejadian-kejadian ang menggentingkan dan mengejutkan semua manusia akan sadar bahwa Allah telah janji akan kedatangan hari ini, dan Allah telah memberitakannya melalui perantara para Rasul shallallaahu 'alaihi wa sallam, mereka telah memberi peringatan dan mewanti-wanti. Tetapi orang yang sudah dipastikan akan memperoleh azab maka dia enggan untuk beriman, walau pun semua ayat datang kepadanya, saat itu juga ia akan sadar, tapi Allah 'Azza Wa Jalla berfirman: وَأَنَّى لَهُ الذِّكْرَى \" akan tetapi tidak berguna lagi mengingat itu baginya.\" Di mana manfaat mengingat hari tersebut saat hari tersebut ketika dia telah melihat secara yakin kejadian yang telah dikabarkan kepadanya? Mengapa dahulu tidak mengambil pelajaran, sekarang sudah tidak ada kesempatan lagi?! Keimanan karena sudah menyaksikan secara langsung tidak akan bermanfaat, karena semua manusia pasti akan beriman meyakini apa yang ia saksikan langsung. Keimanan yang bermanfaat adalah keimanan kepada hal yang ghaib الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ \"orang-orang yang beriman kepada yang ghaib\"(QS. Al-baqarah: 3) Dia membenarkan berita yang disampaikan oleh rasul-rasul tentang Allah 'Azza Wa Jalla dan hari akhir, pada hari tersebut manusia akan sadar, tetapi Allah 'Azza Wa Jalla mengatakan: وَأَنَّى لَهُ الذِّكْرَى \" akan tetapi tidak berguna lagi mengingat itu baginya.\"Maknanya: Jauh tidak mungkin kesadarannya bermanfaat baginya, ketika dia sudah menyaksikan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 23: 23-24. Pada hari yang besar itu didatangkan api jahannam, malaikat mengalirkan api jahannam ditempat yang dapat disaksikan dan membuat hati (yang melihat) merasa takut. Pada saat itu juga orang kafir mengingat (amalan) baik dan buruk atas apa yang telah lalu (yang ia kerjakan di dunia), dan mengingat apa yang para Nabi dan Rasul janjikan akan hari kebangkitan, pembalasan, dan hisab. Dan ingatan (mereka) tidaklah ada manfaatnya pada hari kiamat. Karena sungguh telah berlalu waktu beramal dan telah datang waktu hisab, ia (orang kafir) berkata (dengan penyesalan) : Seandainya saja aku di dunia (berjuang) dengan apa yang bermanfaat bagiku di akhirat, yaitu dengan beriman dan beramal shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rasulullah shallallahu 'alaihi wa sallam bersabda: يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَا “Neraka Jahanam didatangkan pada hari itu dengan keadaannya mempunyai 70.000 kekang (tarikan), masing-masing kekang ditarik oleh tujuh puluh ribu malaikat.” (HR. Muslim)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 23",
    "description": "21-24. Sekali-kali tidak! janganlah kamu berbuat demikian. Apabila bumi diguncangkan berturut-turut, memuntahkan isinya, hancur lebur, kemudian muncul bumi yang sama sekali baru, dan setelah itu datanglah tuhanmu dengan cara yang tidak diketahui hakikatnya sama sekali oleh manusia; dan malaikat menunggu perintah tuhan sambil berbaris-baris penuh kepatuhan. Dan pada hari itu diperlihatkan neraka jahanam kepada orang kafir agar mereka melihat dengan mata kepada sendiri apa yang dahulu mereka ingkari. Ketika semua itu terjadi, maka pada hari itu sadarlah manusia yang ingkar atas kealpaannya, tetapi tidak berguna lagi baginya kesadaran itu. Kesempatan untuk bertobat sudah tiada. Kini tiba saatnya untuk menghitung dan mempertanggungjawabkan perbuatan mereka. Betapa besar penyesalan orang kafir pada hari itu. Dia berkata dengan penuh kesadaran, 'alangkah baiknya sekiranya di dunia dahulu aku beriman dan mengerjakan amal saleh untuk kenyamanan hidupku di akhirat ini. ' penyesalan itu sudah tidak berguna. Maka, berbahagialah kini orang yang membekali diri di dunia dengan iman dan amal saleh"
  }
]