[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Pada hari yang sulit itu tidak ada seorng pun yang mampu dan sanggup menyiksa seperti azab Allah terhadap siapa yang mendurhakaiNYA, tidak ada seorang pun yang mampu membelenggu NYA, tidak ada seorangpun yang menandingiNYA dalam hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Pada hari itu tidak ada seorangpun yang menyiksa seperti siksaan Allah, karena siksa Allah lebih pedih dan lebih kekal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Pada saat yang menakutkan itu manusia akan mengingat apa yang tercantum dalam kitab catatan amalannya. Sungguh tidak akan ada orang yang mampu memberi azab seperti azab yang diberikan Allah kepada orang kafir yang menyelisihi perintah-Nya; dan tidak akan ada orang yang mampu mengikat dengan belenggu seperti ikatan-Nya terhadap mereka untuk digiring ke dalam neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. فَيَوْمَئِذٍ لَّا يُعَذِّبُ عَذَابَهُۥٓ أَحَدٌ (Maka pada hari itu tiada seorangpun yang menyiksa seperti siksa-Nya) Yakni tidak ada yang dapat menyiksa seperti siksaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Pada hari itu, tidak ada satupun yang dapat melindungi orang kafir dari siksa kecuali Allah dan tidak ada yang dapat menyerupai kepedihan siksa atas dirinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu tidak ada seorang pun yang mampu mengazab seperti azabNya} tidak ada satu pun yang bisa memberi azab seperti azab Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Maka pada hari itu tiada seorangpun menyiksa seperti siksaNya” bagi orang yang melalaikan hari itu dan melupakan amal untuk hari itu, “dan tiada seorang pun yang mengikat seperti ikatanNya,” karena mereka diikat dengan belenggu dari api neraka dan diseret di atas wajah mereka ke dalam neraka yang membara kemudian mereka dijadikan bara api di dalam neraka. Inilah balasan orang-orang yang durjana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan pada hari itu juga sesorang tidak diazab dengan azab seperti azab orang lain, azab yang pedih yang belum pernah dirasakan oleh orang-orang sebelumnya, siksaan yang tidak dapat disebutkan sifat-sifat dari siksaan itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Orang ini mengatakan: يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي \" Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.\" Ia berangan-angan tetapi tidak terwujud وَأَنَّى لَهُ الذِّكْرَى \" akan tetapi tidak berguna lagi mengingat itu baginya.\" Allah Ta'ala berfirman: فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ (25) وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ \" Maka pada hari itu tiada seorang pun yang menyiksa seperti siksa-Nya, dan tiada seorang pun yang mengikat seperti ikatan-Nya.\" Pada ayat tersebut terdapat dua car abaca, pertama: فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ (25) وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ Maknanya: Tidak ada yang menyiksa seperti siksaan Allah seorang pun, siksa Allahlah yang terkejam, tidak ada pengkat yang lebih kuat seorangpun, ikatan Allah lah yang terkuat, car abaca kedua: لَا يُعَذَّبُ عَذَابَه أَحَدٌ وَلَا يُوْثَقُ وَثَاقَهُ أَحَدٌ \"\" Maknanya: Pada hari tersebut, tidak ada seorang pun yang diazab semisal azab laki-laki tersebut, dan tidak ada seorang pun diikat seperti ikatan itu. Dan diketahui bahwa orang kafir ini, tidak diazab seorang pun semisal azabnya pada hari itu, karena ia akan dilemparkan kepada penduduk neraka dalam keadaan sangat dahaga, mereka melihat neraka seakan-akan fatamorgana. Fatamorgana adalah sesuatu yang Nampak oleh seseorang pada hari-hari musim panas, saat panas menyengat di tanah sehingga terlihat menyerupai air, mereka melihat neraka seakan-akan fatamorgana sedangkan mereka dalam kondisi kehausan, mereka bergerombolan bersegera mendatangi neraka, mereka ingin apa? Mereka ingin minum, ketika mereka sudah sampai, pintu-pintu neraka pun dibuka, para penjaga neraka pun berkata kepada mereka: أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَذَا \" Apakah belum pernah datang kepadamu rasul-rasul di antaramu yang membacakan kepadamu ayat-ayat Tuhanmu dan memperingatkan kepadamu akan pertemuan dengan hari ini? \" (QS. Az-Zumar: 71) Hujjah telah tegak kepada kalian, para penjaga neraka mencela mereka sebelum mereka memasukinya, celaan adalah siksaan yang menyakiti hati dan jiwa, sebelum mereka merasakan sakitnya neraka, dan di neraka mereka akan dicela oleh Allah 'Azza Wa Jalla, dengan celaan yang lebih menyakitkan dari celaan tersebut, mereka mengatakan: رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ (106) رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ \" \"Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, dan adalah kami orang-orang yang sesat. Ya Tuhan kami, keluarkanlah kami daripadanya (dan kembalikanlah kami ke dunia), maka jika kami kembali (juga kepada kekafiran), sesungguhnya kami adalah orang-orang yang zalim. \"(QS. Al-Mu'minun: 106107) Allah Ta'ala berfirman, sedangkan Dialah yang paling maha penyayang: اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ \" Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" Lebih mengena penghinaan اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ \" Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.\" Dikatakan oleh yang paling pengasih, Maka siapa lagi yang mengasihi jika Mahapengasih tidak mau mengasihi?! Tidak aka nada pengasih bagi mereka. Nabi shallallaahu 'alaihi wa sallam mengabarkan bahwa siksa paling ringan bagi penduduk neraka yaitu orang yang mengenakan dua sandal yang mendidihkan otaknya(1). Kedua sandal di bawah badan sedangkan otak di paling atas, jika saja anggota badan yang paling tinggi mendidih maka anggota badan yang tengah tentu lebih panas, semoga Allah melindungi kami dan anda dari neraka. فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ (25) وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ \" Maka pada hari itu tiada seorang pun yang menyiksa seperti siksa-Nya, dan tiada seorang pun yang mengikat seperti ikatan-Nya.\" Karena mereka, wal'iyaadzu billaah diikat ثُمَّ فِي سِلْسِلَةٍ ذَرْعُهَا سَبْعُونَ ذِرَاعًا فَاسْلُكُوهُ \"Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta.(QS. Al-Haqqah: 32) Masukkanlah mereka ke ikatan rantai ini, yang mendidihkan tangan-tangan mereka semoga Allah menyelamatkan kita, tidak ada seorang pun saat ini yang bisa membayangkan yang menimpa mereka berupa tekanan, kesengsaraan dan siksaan. Oleh karenanya, hendaknya manusia mempersiapkan sebelum mengatakan يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي (24) فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ (25) وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ \"\"Alangkah baiknya kiranya aku dahulu mengerjakan (amal saleh) untuk hidupku ini.\" Maka pada hari itu tiada seorang pun yang menyiksa seperti siksa-Nya, dan tiada seorang pun yang mengikat seperti ikatan-Nya.\" (1) Dikeluarkan oleh Muslim dari hadits Ibnu Abbas radhiyallaahu 'anhuma"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 25: 25-26. Pada hari itu tidak ada yang diadzab oleh Allah (di dunia) sebagaimana adzab bagi orang kafir, tidak juga pernah ada (manusia di dunia) dibelenggu kemudian diberikan minum dari api dan diberikan rasa haus sebagaimana orang kafir rasakan; Dengan kata lain, adzab bagi mereka adalah adzab yang diberikan hingga sampai derajat manusia lebih mengingkan mati (ketimbang di adzab)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang yang meremehkan hari itu dan tidak beramal untuk menghadapinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 25",
    "description": "Maka pada hari itu tidak ada seorang pun yang mengazab seperti azab-Nya yang adil. Azab Allah mahadahsyat. Orang yang menerima azab Allah pada hari itu akan merasa sebagai orang yang paling sengsara. 26. Dan tidak ada seorang pun yang mengikat seperti ikatan-Nya. Ikatan Allah sangat kukuh dan kuat. Tidak ada kekuatan yang mampu mengendurkan ikatan itu, apalagi melepaskannya."
  }
]