[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Pada hari yang sulit itu tidak ada seorng pun yang mampu dan sanggup menyiksa seperti azab Allah terhadap siapa yang mendurhakaiNYA, tidak ada seorang pun yang mampu membelenggu NYA, tidak ada seorangpun yang menandingiNYA dalam hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan tidak ada yang mengikat dengan rantai seperti ikatan Allah bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَلَا يُوثِقُ وَثَاقَهُۥٓ أَحَدٌ (dan tiada seorangpun yang mengikat seperti ikatan-Nya) Dan orang kafir tidak dibelenggu dengan rantai seperti belenggu yang Allah lakukan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Tidak ada yang bisa menandingi ikatan atas dirinya yang menggunakan rantai-rantai. “Isim dhamir” pada kata {‘Adzabahu} dan {watsaqahu} merujuk kepada orang kafir. Watsaq atau Itsaq artinya adalah ikatan, dan arti kedua {Itsaq} adalah yang dimaksud dalam ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada seorang pun juga yang mampu mengikat seperti ikatanNya} tidak ada satupun yang bisa mengikat suatu ikatan dan belenggu seperti ikatan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. “Maka pada hari itu tiada seorangpun menyiksa seperti siksaNya” bagi orang yang melalaikan hari itu dan melupakan amal untuk hari itu, “dan tiada seorang pun yang mengikat seperti ikatanNya,” karena mereka diikat dengan belenggu dari api neraka dan diseret di atas wajah mereka ke dalam neraka yang membara kemudian mereka dijadikan bara api di dalam neraka. Inilah balasan orang-orang yang durjana."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Orang-orang kafir akan diikat dengan ikatan yang paling kuat, ikatan yang belum pernah dan tidak akan pernah ada yang mengikat sekuat ikatan itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir ayat 25"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 26: 25-26. Pada hari itu tidak ada yang diadzab oleh Allah (di dunia) sebagaimana adzab bagi orang kafir, tidak juga pernah ada (manusia di dunia) dibelenggu kemudian diberikan minum dari api dan diberikan rasa haus sebagaimana orang kafir rasakan; Dengan kata lain, adzab bagi mereka adalah adzab yang diberikan hingga sampai derajat manusia lebih mengingkan mati (ketimbang di adzab)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka diikat dengan rantai dan diseret di atas mukanya ke dalam air yang sangat panas kemudian dibakar dalam api (lihat surah Az Zumar: 71-72). Ini adalah balasan bagi orang-orang yang berdosa, adapun orang yang merasa tenang kepada Allah, beriman kepada-Nya dan membenarkan rasul-rasul-Nya, maka akan dikatakan kepadanya, “Wahai jiwa yang tenang!”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 26",
    "description": "Dan tidak ada seorang pun yang mengikat seperti ikatan-Nya. Ikatan Allah sangat kukuh dan kuat. Tidak ada kekuatan yang mampu mengendurkan ikatan itu, apalagi melepaskannya. 27. Allah berfirman kepada manusia yang beriman dan beramal saleh, 'wahai jiwa yang tenang, tenteram, damai, dan tidak takut apa pun serta tidak merasa sedih karena apa pun."
  }
]