[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-30. Wahai jiwa yang tenang dengan zikir dan iman kepada Allah, dan juga tenang dengan apa yang Allah siapakan bagi orang orang yang beriman,yaitu nikmat surga, Pulanglah kepada tuhanmu dalam keadaan ridha dengan pemuliaan dari Allah kepadamu,dan Allah telah meridhaimu, Masuklah kedalam robongan hamba-hamba Allah yang shalih, Masuklah kedalam surgaku bersama mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kembalilah ke haribaan Rabbmu dengan hati yang rida dengan pahala yang sempurna yang kamu dapatkan, dan juga dalam keadaan diridai oleh-Nya karena perbuatan salehmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. ارْجِعِىٓ إِلَىٰ رَبِّكِ رَاضِيَةً (Kembalilah kepada Tuhanmu dengan hati yang puas) Puas dengan pahala yang Allah berikan kepadamu. مَّرْضِيَّةً (lagi diridhai-Nya) Diridhai di sisi-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "27-29 1 ). Barangsiapa yang tidak menentramkan hatinya di dunia dengan syari'at Allah dan ketaatan kepada-Nya, maka dia tidak akan merasakan ketentraman di akhirat, dan tidak pula akan mendengarkan panggilan yang agung dan mulia itu : { يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ , ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَرْضِيَّةً , فَادْخُلِي فِي عِبَادِي , وَادْخُلِي جَنَّتِي } , tenangkanlah hati di dunia, maka kamu akan merasakan ketenangan yang jauh lebih damai di akhirat nanti. 2 ) . { فَادْخُلِي فِي عِبَادِي , وَادْخُلِي جَنَّتِي } Perhatikan dua ayat ini, tahukan Anda rahasia dibalik didahulukannya ayat { فَادْخُلِي فِي عِبَادِي } sebelum ayat { وَادْخُلِي جَنَّتِي } , yaitu ketika di dunia Allah mengajak setiap jiwa untuk mendekatkan diri dan menghamba hanya kepada-Nya yang hal itu merupakan salah satu nikmat Allah yang paling besar atas hamba-hamba Nya, lalu bagiamana jika Allah mengajak hamba-Nya untuk masuk kedalam surga dengan jaminan segala kenikmatan yang jauh lebih besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. “Kembalilah ke haribaan Tuhanmu dan muliakanlah Dia dengan meridhai imbalan (dariNya), dan Allah akan meridhai amal shalihmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kembalilah kepada Tuhanmu dengan ridha dan diridhai} ridha terhadap apa yang diberikan, dan diridhai di sisi Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-30. Sedangkan orang yang beriman kepada Allah dan merasa tenang dengan keimanan tersebut, serta membenarkan para rasulNya, maka dikatakan padanya, “Hai jiwa yang tenang,” dengan mengingat Allah dan damai pada cintaNya, yang matanya sejuk karena Allah, “kembalilah kepada Rabbmu,” yang merawatmu dengan nikmatNya dan menyempurnakan kebaikanNYa padamu hingga kau menjadi salah satu wali dan kekasihNya, “dengan hati yang puas lagi diridhaiNya,” yakni senang pada Allah dan pada pahala yang Allah memuliakan dirinya dengannya. Allah pun senang padanya. “Maka masuklah ke dalam golongan hamba-hambaKu dan masuklah ke dalam surgaKu,” ini dialog dengan ruh pada Hari KIamat, pada saat digiring dan pada saat ajal menjelang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ ارْجِعِي إِلَىٰ رَبِّكِ } Pulanglah wahai jiwa yang tenang kepada tuhanmu yang menciptakan, { رَاضِيَةً مَرْضِيَّةً } dan kamu akan puas dengan balasan yang dijanjikan untukmu, dan kamu akan ridho kepada tuhanmu, dan tatkala kematian menjemputnya panggilan ini pun di sebutkan kepadanya, begitupun ketika ia dibangkitkan dari kuburnya, dan saat sekarat jiwa-jiwa itu juga tetap dalam ketenangan karena ada Malaikat yang menjaganya, { تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ } ( maka malaikat akan turun kepada mereka dengan mengatakan: “Janganlah kamu takut dan janganlah merasa sedih; dan gembirakanlah mereka dengan jannah yang telah dijanjikan Allah kepadamu”.) [ Fussilat : 30 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir ayat 27"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 28: 27-28. Kemudian Allah memerintahkan jiwa manusia yang suci, bersih, tenang dengan janji Allah untuk kembali kepada Rabbnya dengan kondisi ridha dengan sumpah Allah baginya berupa balasan dan pahala, dan ia diridhai oleh-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang telah mengurus dan mendidikmu dengan nikmat-Nya serta melimpahkan ihsan-Nya kepadamu sehingga kamu termasuk wali-Nya. Kepada Allah dan karena pahala yang diberikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 28",
    "description": "Kembalilah kepada tuhanmu yang telah menciptakanmu dan mendidikmu, dengan hati yang rida atas pahala dan nikmat yang Allah siapkan untukmu, dan di ridai-Nya karena Allah telah menerima amalan salehmu. 29-30. Maka kini masuklah ke dalam golongan hamba-hamba-ku yang saleh, seperti para nabi, orang yang jujur, pecinta kebenaran, dan syuhada. Dan masuklah bersama mereka ke dalam surga-ku yang telah aku persiapkan untukmu, surga yang penuh kenikmatan. KekAllah di sana selama-lamanya. Terima dan nikmatilah anugerah-ku yang agung ini."
  }
]