[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Allah bersumpah dengan waktu fajar, Juga dengan 10 malam pertama bulan dzulhijjah dan apa yang dengannya ia dimuliakan, Juga dengan segala apa yang genap dan ganjil, Dan dengan malam bila ia hadir dengan kegelapannya, Tidakkah sumpah sumpah diatas mengandung nasihat yang cukup bagi pemilik akal?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan bersumpah dengan segala sesuatu yang berpasangan maupun yang sendirian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَالشَّفْعِ وَالْوَتْرِ (dan yang genap dan yang ganjil) Makna (الشفع) yakni genap, sedangkan (الوتر) adalah ganjil dalam segala sesuatu. Pendapat lain mengatakan: (الشفع) adalah dua hari tasyriq pertama yang diperbolehkan bagi orang yang berhaji untuk menyegerakan melempar jumrah pada hari itu. sedangkan (الوتر) yakni hari tasyriq ketiga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Demi bilangan genap dan ganjil dari segala sesuatu. Demi malam apabila telah lenyap. Dan jawaban dari sumpah ini ditiadakan atau muqaddar dikira-kirakan: Maka orang-orang kafir akan benar-benar diazab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi yang genap dan yang ganjil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Zahirnya, apa yang disumpahkan itulah yang menjadi obyek sumpah. Hal ini boleh dan lazim digunakan bila obyek sumpah berupa sesuatu yang zahir dan penting. Dan seperti itu juga dalam ayat ini. Allah bersumpah dengan waktu fajar, yaitu penghujung malam dan permulaan siang. Karena di waktu akhir malam dan permulaan siang terdapat tanda-tanda kebesaran Allah yang mengatur seluruh hal, yang menunjukkan kekuasaanNya yang sempurna. Dialah yang mengatur seluruh hal, yang hanya kepadaNya-lah ibadah layak ditunaikan. Di saat fajar, terdapat shalat utama lagi diagungkan yang baik untuk dijadikan sebagai obyek sumpah oleh Allah. Karena itu, setelahnya Allah bersumpah dengan sepuluh malam yang menurut pendapat yang benar adalah sepuluh malam di bulan Ramadhan atau sepuluh hari di bulan Dzulhijjah. Karena malam-malam tersebut mencakup hari-hari mulia, yang di dalamnya berlaku berbagai macam ibadah dan dan pendekatan diri yang tidak terdapat pada waktu lain. Pada sepuluh malam terakhir bulan Ramadhan terdapat malam lailatul qadar, yaitu malam yang lebih baik dari seribu bulan dan pada siang harinya terdapat puasa di akhir akhir bulan Ramadhan yang merupakan salah satu rukun Islam yang agung. Pada sepuluh hari di bulan Dzulhijjah terdapat wuquf di Arafah yang pada saat itu Allah memberikan ampunan kepada para hambaNya yang membuat setan sedih. Setan tidak terlihat lebih hina dan kalah melebihi kehinaan dan kekalahannya di hari Arafah karena banyaknya malaikat dan rahmat yang turun dari Allah untuk para hambaNya. Pada hari itu, kebanyakan kegiatan haji dan umrah dilakukan. Semua itu adalah hal-hal agung yang berhak dijadikan sumpah oleh Allah. “Dan demi malam bila berlalu,” yakni saat berlalu dan menurunkan kegelapannya atas manusia sehingga mereka menjadi tenang, nyaman, dan tentram sebagai rahmat dan hikmah dari Allah. “Pada yang demikian itu,” yang disebutkan sebelumnya, “terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal,” yakni untuk orang yang berakal sehat. Ya, sebagian dari hal itu cukup bagi orang-orang yang memiliki akal atau mendengar sebagai yang menyaksikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada sumpah yang ketiga ini Allah ﷻ bersumpah { وَالشَّفْعِ } dengan yang genap yaitu : dua, empat, enam, delapan, sepuluh, dan Dia ﷻ juga bersumpah { وَالْوَتْرِ } dengan yang ganjil yaitu : satu, tiga, lima, tujuh, sembilan. Dan maksud dari yang ganjil di ayat ini adalah : Allah ﷻ , karena sesungguhnya Dia adalah yang satu, sedangkan yang dimaksud dengan yang genap di ayat ini adalah : makhluk ciptaan-Nya, mereka genap karena makhluk seluruhnya adalah berpasangan : manusia berpasangan antara laki-laki dan perempuan, hewan bersangan antara jantan dan betina, begitupun dengan tumbuhan ada yang jantan dan ada yang betina, makhluk seluruhnya adalah genap, sedangkan yang ganjil adalah Allah ﷻ yang satu. Adapun penyebutan ( الْوَتْرِ ) setiap orang berbeda dalam hal ini , ada yang membecanya dengan harokat kasroh pada huruf ( ِو ) \"witri\" , dan ada yang membacanya dengan harokat fathah pada huruf ( و ) \"watri\" , akan tetapi makna dari perbedaan itu sama."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dan firman Allah وَالشَّفْعِ وَالْوَتْرِ \" dan yang genap dan yang ganjil,\" DikatakanL: maksudnya adalah seluruh makhluk, karena makhluk bisa berjumlah genap dan bisa ganjil, Allah 'Azza Wa Jalla berfirman: وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ \" Dan segala sesuatu Kami ciptakan berpasang-pasangan \"(QS. Adz-Dzariyat: 49) maksudnya juga ibadah-ibadah karena bisa berjumlah genap dan ganjil, maka maksud dari genap dan ganjil disini adalah segala sesuatu yang tercipta dengan jumlah genap dan ganjil dan segala yang disyari'atkan dengan jumlah genap dan ganji, dikatakan juga: yang dimaksudkan dengan genap adalah semua makhluk dan yang dimaksudkan dengan ganjil adalah Allah 'Azza Wa Jalla. Dan ketahuilah bahwa firman Allah وَالْوَتْرِ \"\" pada lafaz ini tercapat dua model bacaan yang benar: Al-Witr dan al-Watr, yakni jika anda membaca wasy-Syaf'I wal watr, ini benar. Dan jika anda membaca was-syaf'I wal witr ini pun benar juga, oleh karenanya para ulama mengatakan: asy-Syaf'u Genap adalah makhluk karena semua makhluk terdiri dari dua unsur (berpangan) وَمِنْ كُلِّ شَيْءٍ خَلَقْنَا زَوْجَيْنِ \" Dan segala sesuatu Kami ciptakan berpasang-pasangan \" sedangkan al-Watr atau al-Witr (ganjil) adalah Allah, berdasarkan sabda Nabi shallallaahu 'alaihi wa sallam: إِنَّ اللهَ وِتْرٌ يُحِبُّ الْوِتْرَ \" Sesungguhnya Allah ganjil (esa) dan mencintai ganjil\"(1) Jika ayat bisa dimaknai dengan kedua makna tersebut tanpa ada pertentangan antara keduanya maka keduanya bisa menjadi makna ayat tersebut. Ini adalah kaedah dalam ilmu tafsir bahwa jika sebuah ayat memiliki kemuingkinan dua makna, satu dengan lainnya tidak saling bertentangan maka makna ayat tersebut dibawa dengan kedua makna itu. (1) Dikeluarkan Bukhari (6410) dan Muslum (2677) dari hadits Abu Hurairah radhiyallaahu 'anhu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 3: 1-4. Allah memulai dalam surat ini dengan sumpah, dimana Allah bersumpah dengan waktu fajar yang terang sinarnya. Allah juga bersumpah dengan waktu malam yang ke sepuluh dzulhijjah. Allah bersumpah dengan bilangan genap dan ganjil pada segala sesuatu. Allah bersumpah dengan malam yang telah pergi (berlalu) kegelapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 3",
    "description": "1-4. Demi fajar, yaitu awal mula terangnya bumi setelah kegelapan malam sirna. Pada waktu ini manusia memulai aktivitasnya. Di balik kemunculan fajar itu pasti ada zat yang mahaperkasa. Demi malam yang sepuluh, yaitu sepuluh hari pertama bulan zulhijah. Mereka yang beramal saleh pada hari-hari tersebut akan mendapat pahala yang sangat agung. Demi yang genap dan yang ganjil dari semua hal. Bisa juga dipahami bahwa yang genap itu adalah makhluk Allah, sedangkan yang ganjil adalah Allah. Dia maha esa dan tanpa bandingan. Allah tidak membutuhkan apa dan siapa pun, sedang makhluk sangat bergantung pada yang lain. Demi malam apabila berlalu dan digantikan siang"
  }
]