[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-30. Wahai jiwa yang tenang dengan zikir dan iman kepada Allah, dan juga tenang dengan apa yang Allah siapakan bagi orang orang yang beriman,yaitu nikmat surga, Pulanglah kepada tuhanmu dalam keadaan ridha dengan pemuliaan dari Allah kepadamu,dan Allah telah meridhaimu, Masuklah kedalam robongan hamba-hamba Allah yang shalih, Masuklah kedalam surgaku bersama mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Masuklah bersama mereka ke dalam surga-Ku yang Aku siapkan untuk mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَادْخُلِى جَنَّتِى (masuklah ke dalam surga-Ku) Yakni masuklah bersama mereka. Ini merupakan kemuliaan yang tidak ada tandingannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Masuklah ke dalam surgaKu yang sangat luas bersama mereka. Ibnu Abu Hatim dari Buraidah tentang firmanNya: {Ya Ayyatuhan Nafsu} [27] berkata: “Ayat ini diturunkan untuk Hamzah” sedangkan Ibnu Abbas berkata: ”Ayat ini diturunkan untuk Utsman ketika membeli sumur Ruma untuk memberi minum orang-orang muslim”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan masuklah ke dalam surgaKu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-30. Sedangkan orang yang beriman kepada Allah dan merasa tenang dengan keimanan tersebut, serta membenarkan para rasulNya, maka dikatakan padanya, “Hai jiwa yang tenang,” dengan mengingat Allah dan damai pada cintaNya, yang matanya sejuk karena Allah, “kembalilah kepada Rabbmu,” yang merawatmu dengan nikmatNya dan menyempurnakan kebaikanNYa padamu hingga kau menjadi salah satu wali dan kekasihNya, “dengan hati yang puas lagi diridhaiNya,” yakni senang pada Allah dan pada pahala yang Allah memuliakan dirinya dengannya. Allah pun senang padanya. “Maka masuklah ke dalam golongan hamba-hambaKu dan masuklah ke dalam surgaKu,” ini dialog dengan ruh pada Hari KIamat, pada saat digiring dan pada saat ajal menjelang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tatkala orang kafir ditampakkan bagi mereka api neraka, maka orang-orang yang beriman itu dipanggil dan dimasukkan kedalam surga, begitulah perbedaan antara kedua golongan ini. Dikatakana dalam riwayat lain, bahwa maksud dari فادخلي في عبادي yakni : wahai jiwa-jiwa ( ruh ) yang tenang masuklah kembali kedalam tubuh hamba-hambaku yang beriman, setelah berpisah dalam kematian, maka sekarang masuklah kembali ketubuh-tubuhmu yag dulu ketika didunia kamu membersmainya dalam ketaatan kepada Allah. Ada jiwa yang penuh dengan keburukan dan kesengsaraan, dan jiwa yang berdosa kemudian bertaubat dan mendapat pengampunan, dan ada jiwa yang selalu tenang dengan keimanan dan ketaqwaan kepada Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir ayat 29"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 30: 29-30. Kemudian Allah perintahkan jiwa yang tenang ini untuk masuk kedalam surga bersamaan dengan siapa yang masuk bersamanya dari kalangan hamba Allah yang bertakwa dan kemudian bersenang-senang dengan apa yang tidak pernah dilihat oleh mata, didengar dengan telinga dan dipahami dengan hati manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ucapan ini ditujukan kepada ruh orang mukmin pada hari Kiamat dan ditujukan pula kepadanya ketika ia mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 30",
    "description": "29-30. Maka kini masuklah ke dalam golongan hamba-hamba-ku yang saleh, seperti para nabi, orang yang jujur, pecinta kebenaran, dan syuhada. Dan masuklah bersama mereka ke dalam surga-ku yang telah aku persiapkan untukmu, surga yang penuh kenikmatan. KekAllah di sana selama-lamanya. Terima dan nikmatilah anugerah-ku yang agung ini. 1-3. Aku bersumpah dengan negeri ini, yakni kota mekah, kota kelahiran nabi dan kota suci umat islam. Dan engkau, wahai nabi, bertempat tinggal di negeri mekah ini, membuatnya bertambah mulia. Dan demi pertalian bapak dan anaknya, demi adam dan anak cucunya. Manusia dengan kehendak Allah mengalami siklus dari kanak-kanak menuju dewasa, berkeluarga, beranak pinak, dan berakhir dengan kematian. Inilah fenomena kehidupan yang perlu direnungi."
  }
]