[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Allah bersumpah dengan waktu fajar, Juga dengan 10 malam pertama bulan dzulhijjah dan apa yang dengannya ia dimuliakan, Juga dengan segala apa yang genap dan ganjil, Dan dengan malam bila ia hadir dengan kegelapannya, Tidakkah sumpah sumpah diatas mengandung nasihat yang cukup bagi pemilik akal?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Apakah pada makhluk-makhluk yang telah disebutkan itu terdapat sumpah yang bisa memuaskan orang yang berakal?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dahulu ketika orang berakal jika mendengar sumpah yang kuat maka sumpah itu dapat menjadikannya berhenti dari kebebalan, karena dia mengetahui bahwa yang bersumpah ini telah mengatakan hal yang benar dalam sumpahnya. Maka barangsiapa yang memiliki akal yang sehat, dia akan mengetahui bahwa apa yang Allah jadikan sumpah ini mengandung tanda-tanda kekuasaan Allah, Dia berhak untuk menjadikan hal-hal tersebut sebagai sumpah untuk menunjukkan siapa yang menjadi Pengaturnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. هَلْ فِى ذٰلِكَ قَسَمٌ لِّذِى حِجْرٍ (Pada yang demikian itu terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal) Makna (الحجر) yakni akal. Maka barangsiapa yang memiliki akal niscaya ia akan mengetahui bahwa segala sesuatu yang dipakai Allah sebagai sumpah memang layak untuk dipakai untuk itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Pada permulaan surah ini Allah mengatakan : { هَلْ فِي ذَٰلِكَ قَسَمٌ لِذِي حِجْرٍ } pada kata \"al-Hijr\" dalam ayat ini bermakna \"al-'Aqlu\" , maka kesimpulan yang dapat menarik perhatian orang-orang adalah : bahwasanya al-Qur'an ini berbicara kepada orang-orang yang berakal sehat, oleh karena itu tidak ada benturan antara hukum-hukum dan petunjuk yang berasal dari al-Qur'an dengan hukum-hukum yang di cerna oleh akal, bahkan akal yang sehat akan selalu mengikut kepada al-Qur'an dan membenarkan segala hukum yang berasal darinya, dalam hal ini al-Qur'an juga memberikan penguatan : { لقومٍ يَعْقِلُن } bahwasanya al-Qur'an ini diturunkan untuk kaum yang berakal, { لعلهم يتفكرون } . 2 ) . Akal juga disebut \"Hijr\" yang makna asalnya adalah larangan atau melarang, karena sesungguhnya akal yang sehat melarang dan menghalangi tuannya dari segala hal-hal yang tidak baik dan tidak sesuai dengannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Adakah sumpah-sumpah ini ada yang dapat diterima oleh orang-orang yang berakal bahwa apa yang dijadikan sumpah oleh Allah itu adalah sesuatu yang besar dan haq untuk dijadikan sumpah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah pada yang demikian itu terdapat sumpah} sumpah yang diterima {bagi orang yang berakal} orang yang berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Zahirnya, apa yang disumpahkan itulah yang menjadi obyek sumpah. Hal ini boleh dan lazim digunakan bila obyek sumpah berupa sesuatu yang zahir dan penting. Dan seperti itu juga dalam ayat ini. Allah bersumpah dengan waktu fajar, yaitu penghujung malam dan permulaan siang. Karena di waktu akhir malam dan permulaan siang terdapat tanda-tanda kebesaran Allah yang mengatur seluruh hal, yang menunjukkan kekuasaanNya yang sempurna. Dialah yang mengatur seluruh hal, yang hanya kepadaNya-lah ibadah layak ditunaikan. Di saat fajar, terdapat shalat utama lagi diagungkan yang baik untuk dijadikan sebagai obyek sumpah oleh Allah. Karena itu, setelahnya Allah bersumpah dengan sepuluh malam yang menurut pendapat yang benar adalah sepuluh malam di bulan Ramadhan atau sepuluh hari di bulan Dzulhijjah. Karena malam-malam tersebut mencakup hari-hari mulia, yang di dalamnya berlaku berbagai macam ibadah dan dan pendekatan diri yang tidak terdapat pada waktu lain. Pada sepuluh malam terakhir bulan Ramadhan terdapat malam lailatul qadar, yaitu malam yang lebih baik dari seribu bulan dan pada siang harinya terdapat puasa di akhir akhir bulan Ramadhan yang merupakan salah satu rukun Islam yang agung. Pada sepuluh hari di bulan Dzulhijjah terdapat wuquf di Arafah yang pada saat itu Allah memberikan ampunan kepada para hambaNya yang membuat setan sedih. Setan tidak terlihat lebih hina dan kalah melebihi kehinaan dan kekalahannya di hari Arafah karena banyaknya malaikat dan rahmat yang turun dari Allah untuk para hambaNya. Pada hari itu, kebanyakan kegiatan haji dan umrah dilakukan. Semua itu adalah hal-hal agung yang berhak dijadikan sumpah oleh Allah. “Dan demi malam bila berlalu,” yakni saat berlalu dan menurunkan kegelapannya atas manusia sehingga mereka menjadi tenang, nyaman, dan tentram sebagai rahmat dan hikmah dari Allah. “Pada yang demikian itu,” yang disebutkan sebelumnya, “terdapat sumpah (yang dapat diterima) oleh orang-orang yang berakal,” yakni untuk orang yang berakal sehat. Ya, sebagian dari hal itu cukup bagi orang-orang yang memiliki akal atau mendengar sebagai yang menyaksikan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Apakah dari apa yang telah disebutkan di ayat-ayat diatas yang Allah ﷻ bersumpah dengannya { قَسَمٌ لِذِي حِجْرٍ } ada sumpah yang berguna bagi orang-orang yang berakal, apakah sumpah itu dapat diterima oleh mereka dan memikirkan keajaiban-keajaiban yang ada padanya ?, { حِجْرٍ } berarti : العقل ( akal ) , karena sesungguhnya akal yang sehat mampu mencerna dan memahami ayat-ayat tersebut dan menerimanya. Sedangkan orang yang tidak memliki akal yang sehat dia mampu memahami ayat tersebut akan tetapi tidak mengimaninya, maka keberadaannya seperti dengan ketiadaannya, dia tidak dapat mengambi manfaat dari amalan yag dia kerjakan, ayat-ayat Allah yang dia famahami tidak bermanfaat baginya tanpa keimanan yang nyata. Kata \"ٍحِجْر\" yang makna asalnya adalah : larangan dapat diartikan menjadi \"عقل\" ( akal ) karena akal mampu menjaga pemiliknya dari hal-hal yang tidak pantas baginya, dan akan menghantarkan pemiliknya kepada sesuatu yang menjadi kemaslahatan dan kebaikan baginya, dan akal itu mampu membelenggu pemiliknya dari kelakuan-kelakuan dan ucapan-ucapan yang buruk yang sama sekali tidak bermanfaat bagi dirinya, bahkan didalamnya hanya mengandung keburukan dan kehinaan, dan akal adalah suatu nikmat yang sangat besar yang Allah ﷻ anguerahkan kepada hamba-hamba Nya, dan kereka akal juga lah yang membedakan antara manusia dan binatang, dan orang yang tidak waras menjadi buruk keadaannya karena akalnya yang telah diangkat dari dalam dirinya, dengan akal ini kita dapat memahami dan merasakan betapa besarnya nikmat Allah ﷻ kepada hamba-Nya, dan dengannya pula kita mampu mengetahui keburukan pada sesuatu apapun, kalian dapat mengetahui nikmat Allah ﷻ dengan akal ini yang dengannya pula kalian terjaga dari kesesatan dan pemikiran-pemikiran yang merusak, semua itu adalah nikmat Allah ﷻ yang sangat besar. Akalh adalah salah satu nikmat yang paling besar yang Allah ﷻ berikan kepada hamba-Nya, oleh karena itu Allah ﷻ memerintahkan untuk menjaga akal yang sehat ini dari segala pelencengan, dan dari segala sesuatu yang memabukkan yang menyebabkan akal itu hilang dan tidak terkendali, karena dengan hilangnya akal yang disebabkan oleh sesuatu yang memabukkan akan menyebabkan dijatuhkannya hukuman cambuk sebanyak 80 kali cambukan kepada pemilik akal tersebut, dan hal ini menjadi syariat islam untuk kemaslahatan diri sendiri agar setiap jiwa kembali kepada fitrohnya yang suci, dan agar pelaku merasakan akibat dari maksiat itu sendiri, agar mereka mengetahui dan menyedari betapa berharganya akal yang sehat itu,. Sama halnya dengan narkoba dan sabu-sabu bahkan ini lebih besar dampaknya yang dapat merubah sifat manusia yang sesungguhnya menjadi seperti binatang yang tidak berakal, sehingga hidupnya menjadi suram penuh dengan kesengsaraan dan kehancuran. Begitupun dengan bahan-bahan perusak lainnya seperti rokok dan qat yang dapat menjadi penyebab rusaknya akal yang sehat, semua itu menjadi penyebab hilangnya semangat hidup dari diri manusia, sehingga pekrjaannya pun terbengkalai dan semuanya akan berantakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 5: Setelah sumpah-sumpah ini, Allah berkata : Apakah di dalam penyebutan atas segala sesuatu (sumpah) ini ridha bagi orang-orang yang berpikir dan berakal ? Adapun jawaban bagi sumpah (di ayat sebelumnya) dihapus yang hakikatnya adalah : Allah bersumpah atas diri-siri kalian bahwa orang-orang kafir akan diadzab dengan sebab mereka kokoh diatas kekufuran mereka dan kosong dari keimanan kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ya, pada sebagainnya saja sudah cukup bagi yang mempunyai hati atau yang menggunakan pendengarannya, sedang dia menyaksikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 5",
    "description": "Adakah pada yang demikian itu terdapat sumpah yang dapat diterima bagi orang-orang yang berakal' bagi mereka sumpah-sumpah tersebut sangat menggugah. Mereka tergugah untuk memikirkannya secara mendalam karena sumpah itu menunjukkan kekuasaan Allah dan anugerah-Nya yang besar bagi manusia. 6. Tidakkah engkau, wahai rasul dan kaum musyrik, memperhatikan dan merenungkan dengan pikiran jernih bagaimana tuhanmu berbuat terhadap kaum 'ad' Allah mengazab mereka karena telah berbuat durhaka, meski mereka memiliki kekuatan yang luar biasa."
  }
]