[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Tidakkah kamu perhatikan (wahai rasul), bagaimana yang dilakukan oleh Tuhanmu terhadap kaum ‘Ad, Kabilah Iram, pemilik kekuatan dan bangunan yang terjungjung diatas pilar-pilar, Yang bangunan sepertinya belum pernah didirikan di negeri negeri lain,begitu pula dalam hal kebesaran jasmani mereka dan kekuatan tenaga mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Apakah kamu -wahai Rasul- tidak memperhatikan bagaimana Rabbmu memperlakukan kaum 'Ād, umat Nabi Hūd -'alaihissalām-, tatkala mereka mendustakan Rasul mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-8. Ini merupakan isi dari sumpah tersebut, dan maksudnya adalah: Sungguh Tuhanmu -hai Muhammad- akan mengirim azab kepada orang yang mendustakanmu, sebagaimana telah mengirim azab kepada kaum ‘Ad, Tsamud, dan Fir’aun. Allah memberi peneguhan bagi Rasulullah dan memberi peringatan bagi orang-orang yang menentang; karena apa yang telah Allah lakukan terhadap umat-umat tersebut merupakan pelajaran dan peringatan bagi mereka. Tidakkah kamu mengetahui kisah umat-umat ini dan apa yang telah Allah perbuat terhadap kaum ‘Ad yang merupakan kabilah Iram yang memiliki bangunan-bangunan yang kokoh, dan Allah belum pernah menciptakan kaum yang memiliki kekuatan dan kejayaan seperti mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Wahai Nabi, apakah kamu belum tahu bagaimana Tuhanmu memperlakukan kaum ‘Ad (yang pertama), yaitu kaum Nabi Hud yang diazab dengan sambaran angin ribut? Apakah akan dibelakukan juga kepada umatmu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah kamu memperhatikan bagaimana Tuhanmu berbuat terhadap kaum ‘Ad"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Tidakkah kamu memperhatikan bagaimana tuhanmu memperlakukan kaum 'Ad ? , kaum 'Ad adalah suku masyarakat dari anak-anak Adam yang datang setelah masa Nabi Nuh - عليه السلام - dan Nabi mereka adalah Hud - عليه السلام - , mereka bermukim di sebelah timur semenanjung Arab di tanah Ahqaf, yaitu daerah perkebunan, daerah yang memiliki kualitas tanah dan udara yang baik, pada wilayah ini banyak kebaikan yang Allah karuniakan kepada penduduknya, serta tubuh-tubuh penduduk wilayah ini sangat kuat, Allah ﷻ berfirman tentang mereka : { إِذْ جَعَلَكُمْ خُلَفَاءَ مِنْ بَعْدِ قَوْمِ نُوحٍ وَزَادَكُمْ فِي الْخَلْقِ بَسْطَةً } ( Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). ) [ Al-A'raf : 69 ] , tubuh mereka kuat dan besar, dan diantara anak Adam mereka lah yang paling kuat dan paling tinggi badannya, sampai ketika Nabi Hud - عليه السلام - menyampaikan peringatan kepada mereka, mereka pun berkata : { وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً } mereka berkata dengan maksud menentang : \"siapakah yang lebih kuat dari kami ? \" , tidak ada rasa takut yang kami simpan, kami adalah orang-orang yang paling kuat, kemudian Allah ﷻ berfirman : { أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً ۖ وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ } ( Dan apakah mereka itu tidak memperhatikan bahwa Allah Yang menciptakan mereka adalah lebih besar kekuatan-Nya daripada mereka? Dan adalah mereka mengingkari tanda-tanda (kekuatan) Kami. ) , lalu dengan apa Allah membinasakan mereka ? Allah membinasakan mereka dengan sesuatu yang paling lembut, yaitu angin, Allah ﷻ berfirman : { فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَخْزَىٰ ۖ وَهُمْ لَا يُنْصَرُونَ } ( Maka Kami meniupkan angin yang amat gemuruh kepada mereka dalam beberapa hari yang sial, karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia. Dan Sesungguhnya siksa akhirat lebih menghinakan sedang mereka tidak diberi pertolongan. ) [ Fussilat : 15, 16 ] , kemana kekuatan mereka ketika angin itu datang ? angin itu mengangkat mereka dari bumi dan menghampaskan mereka dengan sangat kuat, kekuatan yang mereka miliki sama sekali tidak dapat membantu dari terpaan angin itu, kekuatan yang mereka gunakan untuk menentang Nabi Allah tidak dapat menyelamatkan mereka sendiri, akan tetapi jikalau saja kekuatan itu dipakai untuk ketaatan kepada Allah ﷻ kekuatan itu akan sangat bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Yang diajak bicara di sini adalah semua yang kitab ini diperuntukkan baginya yaitu semua manusia bahkan jin pun juga termasuk. Tidakkah engkau melihat wahai yang di ajak bicara: أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِعَادٍ (6) إِرَمَ ذَاتِ الْعِمَادِ \" Apakah kamu tidak memperhatikan bagaimana Tuhanmu berbuat terhadap kaum Ad?, (yaitu) penduduk Iram yang mempunyai bangunan-bangunan yang tinggi, \" bagaimana Allah telah memperlakukan mereka? Kaum Aad adalah sebuah suku yang teerkenal di selatan jazirah arab, Allah mengutus Nabi Hud 'alaihissholaatu wassalaam kepada mereka, Nabi Hud menyampaikan risalah kepada mereka tetapi mereka enggan dan membangkang, mereka mengatakan: Siapakah yang lebih kuat dari kami, Allah Ta'ala berfirman: أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ \" Dan apakah mereka itu tidak memperhatikan bahwa Allah yang menciptakan mereka adalah lebih besar kekuatan-Nya dari mereka? Dan adalah mereka mengingkari tanda-tanda (kekuatan) Kami.\" (QS. Fushilat: 15) Mereka berbangga-bangga dengan kekuatan mereka, tetapi Allah menjelaskan bahwa mereka itu lemah di hadapan kekuatan Allah, oleh karenanya Allah berfirman: أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ (15) فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَخْزَى وَهُمْ لَا يُنْصَرُونَ \" bahwa Allah yang menciptakan mereka adalah lebih besar kekuatan-Nya dari mereka? Dan adalah mereka mengingkari tanda-tanda (kekuatan) Kami. Maka Kami meniupkan angin yang amat gemuruh kepada mereka dalam beberapa hari yang sial, karena Kami hendak merasakan kepada mereka itu siksaan yang menghinakan dalam kehidupan dunia. Dan sesungguhnya siksaan akhirat lebih menghinakan sedang mereka tidak diberi pertolongan.\" (QS. Fishilat: 15-16) Yang Allah lakukan kapada Kaum Aad adalah Dia mengirimkan angin yang membinasakan, yang Allah tiupkan kepada mereka selama tujuh malam delapan hari terus menerus, kaum tersebut bergelimpangan tewas di dalamnya, seakan-akan mereka seperti tunggul-tunggul pohon kurma yang telah lapuk, sehingga mereka tidak terlihat lagi melainkan yang tersisa hanyalah tempatitnggal-tempattinggal mereka. Istifham (kalimat tanya) ini yang Allah jadikan sebagai penarik perhatian kepada perbuatan mereka tujuannya adalah agar diambil pelajaran, yakni ambillah pelajaran wahai yang mendustakan Rasul Muhammad shallallaahu 'alaihi wa sallam dari mereka, bagaimana mereka ditimpa azab, Allah Ta'ala berfirman: : وَمَا هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ \" dan siksaan itu tiadalah jauh dari orang-orang yang zalim.\"(QS. Hud: 83)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 6: 6-8. Allah mengabarkan dengan persaksian atas apa yang diturunkan-Nya dari adzab bagi orang-orang yang terdahulu yang musyrik, Allah berkata : Apakah kalian tidak melihat wahai manusia, atas apa yang Allah perbuat terhadap kaum Ad ?. Dan Ad adalah kaum yang tinggal di kota Iram yang memiliki kerajaan dan benteng-benteng (tinggi). Dan Allah jelaskan bahwa kota ini tidak pernah diciptakan di negeri manapun yang semisal dengannya. Ad adalah masyarakat Ar Ramilah yang terletak di Ar Rubu’ Al Khali, antara Hadramaut dan Najran di arah timur Jazirah Arab. Nabi mereka adalah Hud. Syaikh Al Bassam ditanya ketika mengajar di Masjidil Haram pada tanggal 23/2/1418 H; Apa itu Iram yang memiliki bangunan tinggi ? Syaikh menjawab : Ia adalah negara Ad, kaumnya Hud ia terletak di Ar Rubu’ Al Khali yang dekat dengan Hadramaut dan Al Ahqaf itulah yang disebut An Nufud atau Ar Rimal yang menyerupai dengan gunung tinggi yang meliuk-liuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan hati dan penglihatanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 6",
    "description": "Tidakkah engkau, wahai rasul dan kaum musyrik, memperhatikan dan merenungkan dengan pikiran jernih bagaimana tuhanmu berbuat terhadap kaum 'ad' Allah mengazab mereka karena telah berbuat durhaka, meski mereka memiliki kekuatan yang luar biasa. 7. Allah hancurkan kaum 'ad, yaitu penduduk kota iram yang mempunyai bangunan-bangunan yang tinggi dan bentuk fisik yang kuat."
  }
]