[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Tidakkah kamu perhatikan (wahai rasul), bagaimana yang dilakukan oleh Tuhanmu terhadap kaum ‘Ad, Kabilah Iram, pemilik kekuatan dan bangunan yang terjungjung diatas pilar-pilar, Yang bangunan sepertinya belum pernah didirikan di negeri negeri lain,begitu pula dalam hal kebesaran jasmani mereka dan kekuatan tenaga mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Kabilah 'Ād dinisbahkan kepada kakek mereka Iram, yang mempunyai postur tinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِرَمَ ذَاتِ الْعِمَادِ ((yaitu) penduduk Iram yang mempunyai bangunan-bangunan yang tinggi) Iram merupakan nama lain dari kaum ‘Aad. Terdapat pendapat mengatakan bahwa ia adalah kakek mereka. Pendapat lain mengatakan itu adalah nama pemukiman mereka, yaitu kota Damaskus atau kota lain yang ada di Ahqaf yang memiliki tiang-tiang tinggi dan berpahat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Kaum ‘Ad penduduk kota Iram, nama lain dari kaum ‘Ad. Yang mempunyai bangunan-bangunan yang tinggi, penghuni kemah-kemah yang tinggi. Ini adalah ungkapan ironi untuk orang-orang yang membanggakan kekayaan mereka di tanah Al ‘aisy yang rumah mereka terbuat dari pasir yang berada di tanah Ahqaf antara Oman dan Hadromaut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "penduduk Iram} suku Iram, julukan yang dinisbahkan karena kesungguhan mereka {yang mempunyai bangunan-bangunan yang tinggi} tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Penduduk 'Ad yang dinisbatkan kepada kakek mereka yang bernama \"Iram\" , dalam riwayat dikatan : Iram adalah nama kota yang mereka tinggali. { إِرَمَ ذَاتِ الْعِمَادِ } Yaitu penduduk yang memiliki banyak bangunan-bangunan tinggi, ini jika \"Iram\" ditafsirkan sebagai nama kota, { إِرَمَ ذَاتِ الْعِمَادِ } yaitu kaum yang memiliki kekuatan yang sangat besar, dan makna yang satu ini jika \"Iram\" ditafsirkan sebagai penisbatan kepada kakek mereka, akan tetapi makna yang paling kuat dan paling rojih adalah : bahwasanya makna \"Iram\" disini sebagai sifat yang dinisbatkan kepada penduduk itu, dan bukan kepada kota yang mereka tempati, sedangkan maksud dari tiang-tiang adalah kekuatan yang mereka miliki yang dengannya mereka bersandar dan menyombongkan diri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman Allah: [Iram] ini adalah nama sebuah suku, dikatakan juga: Nama sebuah kampung, dikatakan juga selain itu, tapi sama saja baik itu nama bagi suatu suku atau sebuah tempat, sungguh Allah telah menimpakan siksa kepada mereka dengan azab yang besar padahal mereka adalah orang-orang yang kuat. Firman Allah: ذَاتِ الْعِمَادِ (7) الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ \" yang mempunyai bangunan-bangunan yang tinggi, yang belum pernah diciptakan (suatu kota) seperti itu, di negeri-negeri lain,\" Maksudnya adalah orang-orang yang memiliki bagunan-bangunan yang tinggi lagi kuat الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ Yang tidak pernah dibangun seperti iitu di negeri-negeri lain, karena bagunan-bangunan itu kuat dan kokoh, inilah yang telah menipu mereka sehingga mereka mengatakan: Siapa yang lebih kuat dari kami? Dalam firman-Nya: الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ \" yang belum pernah diciptakan (suatu kota) seperti itu, di negeri-negeri lain,\" padahal yang membangunnya adalah manusia, ini adalah dalil bahwa manusia pun bisa disifati dengan menciptakan, sehingga boleh dikatakan : Menciptakan ini, di antara contohnya adalah sebagaimana Nabi 'alaihissholaatu awassalaam tentang para pelukis: يُقَالُ لَهُمْ: اَحيُوْا مَا خَلَقْتُمْ \"Akan dikatakan kepada mereka: Hidupkanlah gambar-gambar yang telah kalian ciptakan\"(1) Akan tetapi penciptaan yang dinisbatkan kepada makhluk tidaklah sama dengan penciptaan yang dinisbatkan kepada Allah, penciptaan yang disandarkan kepada Allah adalah penciptaan dari ketiadaan, ini tidak ada yang mampu seorang pun. Sedangkan penciptaan yang disandarkan kepada selain Allah maka itu hanya sekedar merubah bentuk saja. Saya akan beri contohnya kepada kalian: Pintu ini terbuat dari kayu, dan yang menciptakan kayu adalah Allah, dan manusia tidak mungkin melakukannya, namun manusia mampu mengubah dari kayu dan rantingnya menjadi pintu-pintu dan kursi-kursi dan semisalnya, maka dari itu penciptaan yang disandarkankan kepada makhluk tidaklah sama seperti yang disandarkan kepada Khaliq (Allah Sang Mahapencipta), karena penciptaan yang disandarkan kepada Khaliq adalah penciptaan dari ketiadaan, ini tidak ada seorang pun yang mampu, sedangkan yang disandarkan kepada makhluk hanyalah sekedar merubah dari suatu bentuk ke bentuk yang berbeda, sedangkan mengubah zat-zat sesuatu. Mengubah emas menjadi perak atau mengubah perak menjadi besi maka ini mustahil kecuali bagi Allah saja tidak ada sekutu bagi-Nya. (1) Dikeluarkan Bukhari (2105) dan Muslim (2107) dari hadits Aisyah Radhiyallaahu 'anhaa"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 7: 6-8. Allah mengabarkan dengan persaksian atas apa yang diturunkan-Nya dari adzab bagi orang-orang yang terdahulu yang musyrik, Allah berkata : Apakah kalian tidak melihat wahai manusia, atas apa yang Allah perbuat terhadap kaum Ad ?. Dan Ad adalah kaum yang tinggal di kota Iram yang memiliki kerajaan dan benteng-benteng (tinggi). Dan Allah jelaskan bahwa kota ini tidak pernah diciptakan di negeri manapun yang semisal dengannya. Ad adalah masyarakat Ar Ramilah yang terletak di Ar Rubu’ Al Khali, antara Hadramaut dan Najran di arah timur Jazirah Arab. Nabi mereka adalah Hud. Syaikh Al Bassam ditanya ketika mengajar di Masjidil Haram pada tanggal 23/2/1418 H; Apa itu Iram yang memiliki bangunan tinggi ? Syaikh menjawab : Ia adalah negara Ad, kaumnya Hud ia terletak di Ar Rubu’ Al Khali yang dekat dengan Hadramaut dan Al Ahqaf itulah yang disebut An Nufud atau Ar Rimal yang menyerupai dengan gunung tinggi yang meliuk-liuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Iram ialah ibukota kaum 'Aad."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 7",
    "description": "Allah hancurkan kaum 'ad, yaitu penduduk kota iram yang mempunyai bangunan-bangunan yang tinggi dan bentuk fisik yang kuat. 8. Itulah kota dengan bangunan-bangunan megah yang pada masanya belum pernah dibangun seperti itu megahnya di negeri-negeri lain."
  }
]