[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Tidakkah kamu perhatikan (wahai rasul), bagaimana yang dilakukan oleh Tuhanmu terhadap kaum ‘Ad, Kabilah Iram, pemilik kekuatan dan bangunan yang terjungjung diatas pilar-pilar, Yang bangunan sepertinya belum pernah didirikan di negeri negeri lain,begitu pula dalam hal kebesaran jasmani mereka dan kekuatan tenaga mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Yang Allah tidak menciptakan yang semisalnya di negeri-negeri lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. الَّتِى لَمْ يُخْلَقْ مِثْلُهَا فِى الْبِلٰدِ (yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain) Yakni belum pernah dibangun sebelumnya kota yang memiliki bangunan yang begitu kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Kekokohan, kekuatan, dan panjang bangunan semisal itu belum pernah dijumpai di negeri lain. Sehingga mereka pernah berkata: “Adakah yang lebih kuat dari kami?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang sebelumnya tidak pernah dibangun seperti itu di negeri-negeri lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ الَّتِي لَمْ يُخْلَقْ مِثْلُهَا } Yang belum pernah ada kaum yang memiliki kekuatan seperti mereka { فِي الْبِلَادِ } di negri-negri lain, oleh karena itu mereka menyomongkan diri dengan kekuatan yang ada pada mereka, akan tetapi apakah kekuatan itu bermanfaat bagi mereka ? tidak, bahkan mereka binasa, dan tidak mampu mengandalkan kekuatan untuk menghindar dari azab Allah ﷻ ."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 8: 6-8. Allah mengabarkan dengan persaksian atas apa yang diturunkan-Nya dari adzab bagi orang-orang yang terdahulu yang musyrik, Allah berkata : Apakah kalian tidak melihat wahai manusia, atas apa yang Allah perbuat terhadap kaum Ad ?. Dan Ad adalah kaum yang tinggal di kota Iram yang memiliki kerajaan dan benteng-benteng (tinggi). Dan Allah jelaskan bahwa kota ini tidak pernah diciptakan di negeri manapun yang semisal dengannya. Ad adalah masyarakat Ar Ramilah yang terletak di Ar Rubu’ Al Khali, antara Hadramaut dan Najran di arah timur Jazirah Arab. Nabi mereka adalah Hud. Syaikh Al Bassam ditanya ketika mengajar di Masjidil Haram pada tanggal 23/2/1418 H; Apa itu Iram yang memiliki bangunan tinggi ? Syaikh menjawab : Ia adalah negara Ad, kaumnya Hud ia terletak di Ar Rubu’ Al Khali yang dekat dengan Hadramaut dan Al Ahqaf itulah yang disebut An Nufud atau Ar Rimal yang menyerupai dengan gunung tinggi yang meliuk-liuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 8",
    "description": "Itulah kota dengan bangunan-bangunan megah yang pada masanya belum pernah dibangun seperti itu megahnya di negeri-negeri lain. 9. Dan tidakkah kamu perhatikan pula azab yang telah Allah timpakan atas kaum 'amud yang memotong dan memahat batu-batu besar di lembah untuk dijadikan kediaman mereka'."
  }
]