[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Juga bagaimana Allah berbuat terhadap Tsamud, kaum nabi Shaleh yang memotong batu-batu besar di lembah dan membangunan rumah rumah darinya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan tidakkah kamu memperhatikan bagaimana Rabbmu berbuat terhadap Ṡamūd, kaum Nabi Ṣāleḥ -'alaihissalām-, mereka memahat bebatuan pegunungan dan menjadikannya sebagai tempat tinggal di Hijr."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Kemudian disebutkan beberapa contoh kebinasaan orang-orang terdahulu yang sombong: Adapun kaum Tsamud, mereka adalah kaum yang dapat memotong batu besar dan melubanginya, kemudian menjadikannya rumah-rumah yang terletak di antara pegunungan di lembah Qira. Ini merupakan tanda kemampuan dan kekuatan mereka yang besar untuk melakukan pekerjaan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَثَمُودَ الَّذِينَ جَابُوا۟ الصَّخْرَ بِالْوَادِ (dan kaum Tsamud yang memotong batu-batu besar di lembah) Mereka dahulu memahat gunung-gunung dan melubanginya untuk digunakan sebagai rumah mereka. Dan lembah mereka adalah lembah Hijr atau lembah Qira yang terletak di jalan menuju Syam dari kota Madinah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Kaum Tsamud adalah suku Arab zaman dulu, yaitu kaum nabi Sholih. Mereka tinggal di bebatuan antara Syam dan Hijaz. Mereka yang memotong bebatuan dan menjadikannya sebagai rumah. Di batu atau canyon Al qura, yang melewati jalan menuju Syam dari Madinah Munawwaroh. Adapun Fir’aun lebih dari itu, yaitu pemilik bangunan yang besar yang menyerupai gunung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kaum Tsamud yang memotong} memotong {batu-batu besar} bebatuan gunung {di lembah} di lembah negeri sebelah barat laut semenanjung Arab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-14. Allah berfirman, “Apakah kamu tidak memperhatikan,” dengan hati dan pandanganmu, “bagaimana Rabbmu berbuat” terhadap umat-umat yang melampaui batas itu, kaum ‘Ad, “(yaitu) penduduk Iram,” kabilah terkenal di Yaman, angkuh, dan sombong, “yang belum pernah dibangun (suatu kota) seperti itu, di negeri-negeri lain,” yakni di seluruh negeri-negeri lain dari segi kekuatan dan kekokohan. Sebagaimana dikatakan kepada mereka oelah nabi mereka Hud alaihi salam “Dan ingatlah oleh kamu sekalian di waktu Allah menjadikan kamu sebagai pengganti-pengganti (yang berkuasa) sesudah lenyapnya kaum Nuh, dan Tuhan telah melebihkan kekuatan tubuh dan perawakanmu (daripada kaum Nuh itu). Maka ingatlah nikmat-nikmat Allah supaya kamu mendapat keberuntungan. (QS. Al-A’rof :68) “Dan kaum tsamud yang memotong batu-batu yang besar di lembah,” yakni di lembah negeri. Dengan kekuatan, mereka memahat batu-batu besar dan dijadikan sebagai tempat tinggal. “Dan kaum Fir’aun yang mempunyai pasak-pasak (tentara yang banyak),” yakni yang memiliki tentara yang mengokohkan kekuasaannya seperti halnya pasak yang memperkokoh dan apa pun yang dipertahankan. “Yang berbuat sewenang-wenang dalam negerinya.” Sifat ini kembali pada kaum ‘Ad, Tsamud, Fir’aun, dan orang-orang yang mengikuti jejak mereka. Mereka berlaku melampaui batas di atas bumi Allah dan menyiksa hamba-hamba Allah dalam agama dan dunia mereka. Karena itu Allah berfirman, “Lalu mereka berbuat banyak kerusakan dalam negeri itu,” yaitu dengan melakukan kekufuran dan berbagai cabangnya dari berbagai jenis kemaksiatan, serta berusaha memerangi para Rasul dan menghalangi manusia dari jalan Allah. Ketika mereka telah mencapai puncak pembangkangan yang mengharuskan mereka binasa, Allah menimpakan siksa dan mengirimkan cambuk siksaNya. “Sesungguhnya Rabbmu benar-benar mengawasi,” bagi siapa pun yang mendurhakaiNya. Allah sedikit memberinya tangguhan, dan setelah itu akan menyiksanya dengan siksaan Dzat yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan kaum yang kedua adalah : Kaum Tsamud, nama ini dinisbatkan kepada kakek mereka bernama Tsamud, penduduk kaum Tsamud dulunya bermukim di wilayah \"Hijr\" sebelah utara Jazirah Arab, atau sebelah utara wilayah Hijaz, pemukiman mereka terletak di kaki dataran tinggi, yang juga dikenal dengan nama \"Madain Shalih\" , kota ini dulunya adalah daerah yang subur, pohon kurma, kebun-kebun sayur memenuhi wilayah perkampungan mereka, mereka juga orang-orang yang kuat, kaum Tsamud terkenal dengan kehebatan mereka dalam memotong dan memahat gunung-gunung batu, mereka menjadikan gunung-gunung itu sebagai tempat tinggal, dan peninggalan mereka msih tersisa sampai saat ini, Allah - عز ول - berfirman tentang mereka : { فَتِلْكَ بُيُوتُهُمْ خَاوِيَةً بِمَا ظَلَمُوا ۗ إِنَّ فِي ذَٰلِكَ لَآيَةً لِقَوْمٍ يَعْلَمُونَ } ( Maka itulah rumah-rumah mereka dalam keadaan runtuh disebabkan kezaliman mereka. Sesungguhnya pada yang demikian itu (terdapat) pelajaran bagi kaum yang mengetahui. ) [ An-Naml : 52 ] , di ayat lain Allah berfirman : { وَكَمْ أَهْلَكْنَا مِنْ قَرْيَةٍ بَطِرَتْ مَعِيشَتَهَا ۖ فَتِلْكَ مَسَاكِنُهُمْ لَمْ تُسْكَنْ مِنْ بَعْدِهِمْ إِلَّا قَلِيلًا ۖ وَكُنَّا نَحْنُ الْوَارِثِينَ } ( Dan berapa banyaknya (penduduk) negeri yang telah Kami binasakan, yang sudah bersenang-senang dalam kehidupannya; maka itulah tempat kediaman mereka yang tiada di diami (lagi) sesudah mereka, kecuali sebahagian kecil. Dan Kami adalah Pewaris(nya) ) [ Al-Qashash : 58 ] , Allah membiarkan bangunan-bangunan itu tetap kokoh hingga saat ini agar menjadi pelajar bagi kaum-kaum setelah mereka, dan menyaksikan sisa-sisa bangunan itu bukan untuk kebangaan seperti yang dikatakan oleh orang-orang bodoh, bahwa inilah peradaban, inilah kemajuan, mereka melihat bangunan-bangunan tua itu sebagai pengagungan terhadapnya, padahal itu adalah kesalahan, bukankah bangunan-bangunan kuat itu tidak memberi manfaat bagi mereka, bahkan dengannya mereka membanggakan diri dan berlaku sombong dihadapan Allah ﷻ , dan mereka adalah kaum penyembah berhala, tatkala Allah ﷻ mengutus kepada mereka Nabi Shalih - عليه السلا - risalahnya, kaum Tsamud itu mendustakan apa yang dibawakan oleh Nabi Shalih, bahkan sampai pada tingkat pembangkangan mereka yang paling tinggi, yaitu dengan mengancam Nabi Shalih - عليه السلام - akan dibunuh, mereka kemudian meminta kepada Nabi Shalih untuk mendatangkan kepada mereka satu bukti atau mukjizat yang membuktikan bahwa beliau adalah seorang Rasul utusan Allah ﷻ , maka Nabi Shalih - عليه السلام - aysa izin Allah beliau mendatangkan sekor unta betina, sebagaimana yang diabdaikan dalam Al-Qur'an : { وَآتَيْنَا ثَمُودَ النَّاقَةَ مُبْصِرَةً فَظَلَمُوا بِهَا } ( Dan telah Kami berikan kepada Tsamud unta betina itu (sebagai mukjizat) yang dapat dilihat, tetapi mereka menganiaya unta betina itu ) [ Al-Isra' : 59 ] , Nabi Shalih mendatangkan seokor unta betina yang jenisnya berbeda dengan jenis-jenis unta lainnya yang ada pada saat itu . Namun apa yang dihadirkan oleh Nabi Shalih belum mereka nggap sebagai mukizat, Allah datangkan dihadapan mereka suatu bukti tetapi mereka tidak mau mengimaninya, karena maksud dan tujuan mereka menanyakan hal itu bukan kebaikan, mereka hanya ingin menantang Nabi Shalih dengan keyakinan yang ada dalam diri mereka bahwa Nabi Shalih tidak akan mampu berbuat demikian, tetapi atas izin Allah Nabi Shalih mampu membuktikan, Akan tetapi mereka tetap pada kekafiran yang akan membinasakan mereka, dan pada suatu ketika mereka berniat jahat kepada unta itu, maka Nabi Shalih pun melarang dan menentang kejahatan itu, namun mereka tetap saja bersikeras untuk melakukan kejahatn itu, Allah berfirman tentang peristiwa pembangkangan mereka : { قَالَ هَٰذِهِ نَاقَةٌ لَهَا شِرْبٌ وَلَكُمْ شِرْبُ يَوْمٍ مَعْلُومٍ , وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابُ يَوْمٍ عَظِيمٍ , فَعَقَرُوهَا فَأَصْبَحُوا نَادِمِينَ , فَأَخَذَهُمُ الْعَذَابُ } ( Shaleh menjawab: “Ini seekor unta betina, ia mempunyai giliran untuk mendapatkan air, dan kamu mempunyai giliran pula untuk mendapatkan air di hari yang tertentu , Dan janganlah kamu sentuh unta betina itu dengan sesuatu kejahatan, yang menyebabkan kamu akan ditimpa oleh azab hari yang besar” , Kemudian mereka membunuhnya, lalu mereka menjadi menyesal , Maka mereka ditimpa azab ) [ Asy Syuara' : 155 - 158 ] , mereka membangkang, maka azab lah ditimpakan kepada kaum itu. Semua pwristiwa di atas menjadi peringatan bagi ummat Nabi Muhammad, dan jika ummat Muhammad juga berlaku seperti yang kaum-kaum sebelumnya lakukan, maka Allah juga akan berbuat seperti yang Dia perbuat kepada kaum-kaum itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah berfirman: وَثَمُودَ الَّذِينَ جَابُوا الصَّخْرَ بِالْوَادِ \" dan kaum Tsamud yang memotong batu-batu besar di lembah,\" Tsamud adalah kaumnya Nabi Saleh, tempat tinggal mereka dikenal hingga saat ini, sebagaimana Allah Ta'ala berfirman: وَلَقَدْ كَذَّبَ أَصْحَابُ الْحِجْرِ الْمُرْسَلِين \" Dan sesungguhnya penduduk-penduduk kota Al Hijr telah mendustakan rasul-rasul,\"(QS. Al-Hijr: 80) dalam Surat Alif lam raa, Allah menyebutkan bahwa dahulu Tsamud berada di negeri hijr, itu adalah daerah yang terkenal, Nabi shallallaahu 'alaihi wa sallam pernah melewatinya ketika hendak ke tabuk dengan cepat-cepat dan menyembunyikan kepalanya, dan bersabda: لَا تَدْخُلُوا عَلَى هَؤُلاَءِ الْقَوْمِ الْمُعَذَّبِينَ إِلّاَ أَنْ تَكُوْنَ بَاكِينَ, فَإِن لَمْ تَكُوْنُوْا بَاكِيْنَ فَلَا تَدْخُلُوْا عَلَيْهِمْ: أَنْ يُصِيبَكُمْ مِثْلُ مَا أَصَابَكُمْ \"janganlah kalian memasuki daerah qaum yang diazab kecuali dalam keadaan menangis, jika kalian tidak dalam keadaan menangis maka janganlah memasuki mereka, kalian bisa tertimpa azab seperti yang telah menimpa mereka\" (1) Mereka adalah suatu kaum yang Allah berikan kekuatan lebih sehingga mereka mampu memahat gunung-gunung dan bebatuanbesar yang mereka jadikan rumah-rumah. Oleh karenanya Allah berfirman: جَابُوا الصَّخْرَ بِالْوَادِ \" memotong batu-batu besar di lembah,\" Maksudnya: Lembah Tsamud, ini juga lembah terkenal, mereka juga Allah menimpakan tmpaan berupa azab dan siksa di mana dikatakan kepada mereka: Bersenang-senanglah kalian di kampung kalian selama tiga hari, kemudian setelah itu kalian akan ditimpa dengan suara gemuruh yang keras dan guncangan, sehingga mereka menjadi bangkai di kempung mereka. Maka hendaknya kita mengambil pelajaran dari kondisi mereka yang tempat kembalinya menuju kebinasaan dan kehancuran, dan perlu diketahui bahwa umat ini tidak akan dibinasakan sebagaimana umat-umat terdahulu dengan azab yang menyeluruh, Sesungguhnya Nabi shallaahu 'alaihi wa sallam telah meminta kepada Allah agar tidak membinasakan mereka dengan dengan azab menyeluruh, tapi umat ini akan binasa dengan Allah menjadikan permusuhan datang di antara mereka, maka terjadilah peperangan dan saling bunuh di antara mereka, sehingga kebinasaan itu terjadi dengan tangan sebagian mereka terhadap yang lainnya, tidak dengan azab yang turun dari langit sebagaimana Allah Ta'ala melakukannya terhadap umat-umat terdahulu. Oleh karenanya wajib bagi kita menjauhi fitnah-fitnah baik yang terlihat mau pun yang tersebunyi, dan menjauhi semua yang memancing manusia terhadap yang lainnya, dan senantiasa berkomitmen untuk selalu tenang, dan menjauhi dari berita katanya begini dan begitu dan tidak banyak bertanya, karena itu semua termasuk yang nabi shallallahu alaihi wa salam larang, betapa banyak satu kalimat membuat terhunusnya pedang-pedang yang menebas . maka wajib hukumnya menjauhi fitnah-fitnah, dan umat senantiasa bersatu dan saling menyintai, setiap orang dituntut untuk mentoleransi saudaranya jika ia melihat suatu yang ia benci dari saudaranya. (1) Dikeluarkan Bukhari (433) dan Muslim (2980) dari hadits Abdullah Bin Umar Radhiyallaahu 'anhuma"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Fajr ayat 9: Apakah kalian juga tidak melihat wahai manusia, kepada Tsamud yang mereka memotong batu-batu keras dan mengukir pegunungan di lembah yang terletak di pedesaan yang kemudian mereka menjadikannya rumah-rumah dan kuburan (bagi mayit-mayit mereka). Dan Tsamud terletak di bagian kiri Jazirah Arab untuk jalan ketika (manusia) berhaji menuju ke Mekkah, yaitu lembah desa yang dinamakan Al Hajar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lembah ini terletak di bagian utara Jazirah Arab antara kota Madinah dan Syam. Mereka memotong-motong batu gunung untuk membangun gedung-gedung tempat tinggal mereka dan ada pula yang melubangi gunung-gunung untuk tempat tinggal mereka dan tempat berlindung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Fajr Ayat 9",
    "description": "Dan tidakkah kamu perhatikan pula azab yang telah Allah timpakan atas kaum 'amud yang memotong dan memahat batu-batu besar di lembah untuk dijadikan kediaman mereka'10. Dan tidakkah kamu juga memperhatikan azab Allah kepada fir'aun yang mempunyai pasak-pasak' Allah mengazabnya meski ia mampu membangun piramida-piramida yang besar dan mempunyai bala tentara yang banyak."
  }
]