[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali setan yang mencuri pendengaran terhadap pembicaraan yang dia dengar dari langit, lalu dia menyampaikannya kepada setan yang ada di bawahnya, lalu yang dibawahnya tersebut menyampaikan pada yang dibawahnya lagi, dan terkadang dia sudah terkena lemparan bola api sebelum dia menyampaikannya dan terkadang pula dia telah menyampaikan dengan takdir Allah sebelum dia terkena lemparan bola api, lalu dia membawanya ke dukun-dukun dan mereka pun mencampurnya dengan sertaus kedustaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Kecuali sebagian dari setan yang mendengar selentingan, yaitu kalimat yang beredar di antara para malaikat dan menjadi perbincangan mereka, yang ilmu tentangnya belum sampai ke penduduk bumi. Lalu satu bola api akan memburunya hingga kemudian membakarnya. Dan mungkin saja dia telah menyampaikan kalimat tersebut kepada saudara-saudaranya sebelum bola api mengenainya lalu mereka menyampaikannya kepada dukun-dukun, kemudian para dukun itu membumbuinya dengan seratus kebohongan tambahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِلَّا مَنْ خَطِفَ الْخَطْفَةَ (akan tetapi barangsiapa (di antara mereka) yang mencuri-curi (pembicaraan)) Yakni salah satu setan mencuri-curi pembicaraan yang terjadi di antara para malaikat tentang apa yang akan terjadi yang belum diketahui oleh penduduk bumi. فَأَتْبَعَهُۥ شِهَابٌ ثَاقِبٌ(maka ia dikejar oleh suluh api yang cemerlang) Yakni bintang cemerlang yang akan membakarnya, yang terkadang tidak mengenai setan itu sehingga ia mampu menyampaikan kepada para dukun berita yang telah ia curi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Akan tetapi salah satu golongan setan mencuri berita di tengah perundingan malaikat yaitu menguping pembicaraan mereka, maka dia akan dikejar bintang bercahaya yang kemudian membakarnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali yang menyambar pembicaraan dengan sekali sambar} mencuri satu percakapan para malaikat dengan sekali sambaran {maka ia dikejar} dikejar {oleh bintang yang menyala} yang bersinar lagi menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. kalau saja Allah tidak mengecualikan, niscaya hal itu menjadi dalil yang membuktikan bahwasannya setan-setan itu tidak akan dapat mendengar apa pun sama sekali. Akan tetapi Dia berfirman, ”akan tetapi barangsiapa yang mencuri (pendengaran)” maksudnya, kecuali siapa diantara setan-setan pembangkang itu yang mengambil secara rahasia dan mencuri satu kata, “maka ia dikejar oleh suluh api yang cemerlang,” kadang ia dapat menghanguskannya sebelum setan itu menyampaikannya kepada para sekutunya sehingga berita dari langit pun terputus (terjaga), dan kadang ia sempat menyampaikannya sebelum suluh api itu menghanguskannya Pada saat itulah setan-setan itu menambah kalimat yang dicuri itu dengan seratus dusta, mereka mempropagandakannya disebabkan satu kata yang berhasil ia curi dari langit."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 10: Adapun para setan yang berusa menyambar dengan cepat kabar dari para malaikat, maka ia akan di ikuti oleh panah-panah yang akan membinasakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalau Allah Subhaanahu wa Ta'aala tidak mengecualikan tentu yang demikian merupakan dalil bahwa mereka tidak dapat mendengar berita itu sama sekali. Yakni meteor. Maksud yang menyala adalah yang membakar, melubangi atau merusak. Terkadang meteor itu mengenai mereka sebelum mereka sampaikan kepada kawan-kawan mereka, dan terkadang mereka telah menyampaikan suatu perkataan atau berita kepada kawan-kawannya, termasuk dari kalangan manusia, yang terdiri dari para dukun dan peramal. Oleh karena itulah terkadang apa yang mereka (para dukun dan para normal) sampaikan itu benar karena berita yang disampaikan setan-setan itu, namun mereka mencampur berita yang benar itu dengan seratus kedustaan, dan dengan satu berita itu mereka lariskan kedustaan itu di tengah-tengah manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 10",
    "description": "Setan-setan itu tidak dapat mendengar pembicaraan para malaikat, kecuali setan yang berhasil mencuri pembicaraan dengan cepat, maka ia dikejar oleh bintang yang menyala sehingga mereka pun terbakar. 11. Usai menjelaskan bukti-bukti kekuasaan-Nya di alam raya, Allah beralih membuktikan kuasa-Nya dalam menciptakan manusia. Wahai nabi Muhammad, maka tanyakanlah kepada mereka yang musyrik, 'apakah penciptaan mereka yang lebih sulit ataukah apa yang telah kami ciptakan itu yakni malaikat, langit, dan bumi seisinya'' sesungguhnya kami telah menciptakan nabi adam, yaitu nenek moyang mereka dari tanah liat."
  }
]