[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "99-100 Ibrahim berkata ”sesunggunya aku berhiijrah kepada tuhanku dari negeri kaumku ke tempat dimana aku bisa beribadah kepada tuhanku. Sesungguhya dia akan menunjukan kebaikan kepadaku dalam agama dan duniawiku. wahi tuhanku, berilah aku anak yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Ya Rabbi! Berilah aku anak yang saleh sebagai pendukungku dan pengganti dari kaumku di negeri asing.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. رَبِّ هَبْ لِى مِنَ الصّٰلِحِينَ (Ya Tuhanku, anugrahkanlah kepadaku (seorang anak) yang termasuk orang-orang yang saleh) Yakni anak yang shalih yang membahtuku dalam ketaatan kepada-Mu dan menghiburku di negeri yang asing."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Di Syam, Ibrahim berdoa kepada Tuhannya seraya berkata: “Tuhan, berilah Aku anak shalih yang selalu menaatiMu, menjalankan agamaMu dan mendukungku sungguh-sungguh menaatiMu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Ya Tuhanku, anugerahkanlah kepadaku (keturunan) yang termasuk orang-orang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Ya Rabbku anugerahkanlah kepadaku,” seorang anak yang “termasuk orang-orang shalih.” Ini beliau lakukan ketika sudah skeptic dari kaumnya dan beliau telah melihat tidak adanya kebaikan pada mereka. Maka beliau berdoa kepada AAllah agar dianugerahi seorang anak yang shalih yang dijadikan bermanfaat oleh Allah di waktu beliau masih hidup dan sepeninggalnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 100: Pada saat itu Ibrahim hanyalah seorang diri tidak memiliki anak; Maka dia berdoa kepada Allah agar memberikan rezeki seorang anak yang shalih untuk membantu menyebarkan agama Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Beliau sampai ke negeri yang suci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 100",
    "description": "100. Setelah menjelaskan dialog nabi ibrahim dengan kaumnya yang ingkar, pada ayat berikut Allah beralih mengisahkan dialog nabi ibrahim dengan putranya, isma'il, tentang perintah Allah. Dia berdoa kepada Allah, 'ya tuhanku, anugerahkanlah kepadaku seorang anak yang termasuk golongan orang yang saleh dan taat menjalankan perintah-Mu dan membela agama-Mu. '101. Kami kabulkan doa nabi ibrahim tersebut, maka kami beri kabar gembira kepadanya dengan kelahiran seorang anak yang sangat sabar, cerdas, dan santun. Dialah ismail."
  }
]