[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami mengabulkan doanya dan kami memberikan kabar gembira dengan kelahiran seorang anak yang sangat bijak, yakni saat dia dewasa yaitu ismail."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Maka Kami menjawab doanya, Kami memberinya kabar gembira yang membahagiakannya, Kami memberinya kabar gembira dengan kelahiran seorang anak yang bakal menjadi dewasa dan menjadi penyantun. Anak itu adalah Ismail -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Maka Allah mengabulkan doanya, merealisasikan keinginannya, dan memberinya kabar gembira berupa keturunan yang mulia dan sabar yang bernama Ismail."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. فَبَشَّرْنٰهُ بِغُلٰمٍ حَلِيمٍ (Maka Kami beri dia khabar gembira dengan seorang anak yang amat sabar) Yakni setelah dia dewasa dan menjadi orang yang penyabar. Ini merupakan kabar gembira bagi Ibrahim yang menunjukkan bahwa ia akan dikaruniai anak laki-laki dan anak itu akan hidup sampai usia dewasa dan bersifat penyabar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Lalu Kami memberiNya kabar gembira tentang anak laki-laki yang besar dan sangat pengertian, yaitu Ismail AS dan dialah yang dijadikan kurban karena Ishaq dikabarkan setelahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Kami memberi kabar gembira kepadanya dengan seorang anak yang sangat santun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Lalu Allah mengabulkannya dan berfirman, “Maka Kami beri dia kabar gembira dengan seorang anak yang amat sabar.” Anak itu adalah Ismail, dan tidak ada keraguan tentang itu, sebab sesudah itu disebutkan berita gembira dengan kedatangan Ishaq, dank arena Allah menginformasikan tentang kabar vgembira untuknya akan kehadiran Ishaq, “Maka Kami sampaikan kepadanya berita gembira tentang (kelahiran) Ishak dan dari Ishak (akan lahir putranya) Yakub.” (Hud:71). Ini menunjukkan bahwa Ishaq bukanlah anak yang dijadikan kurban; dan Allah menyifati Ismail dengan al-hilm yang mengandung arti sabar, budi pekerti yang luhur, lapang dada, dan memaafkan orang yang berbuat salah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 101: Allah mengabulkan doanya dengan mengkaruniai seorang anak yang lembut dan memiliki akhlak yang baik, yaitu dengan karunia seorang Ismail."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud ayat tersebut ialah Nabi Ismail ‘alaihis salam, karena Allah Subhaanahu wa Ta'aala memberikan kabar gembira lagi setelah Nabi Ismail dengan Nabi Ishaq dari istrinya Sarah. Nabi Ismail disebut sebagai anak yang halim, artinya sangat sabar, akhlaknya mulia, dadanya lapang dan suka memaafkan kesalahan orang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 101",
    "description": "101. Kami kabulkan doa nabi ibrahim tersebut, maka kami beri kabar gembira kepadanya dengan kelahiran seorang anak yang sangat sabar, cerdas, dan santun. Dialah ismail. 102. Maka ketika anak itu sampai pada usia sanggup berusaha bersamanya, nabi ibrahim berkata, 'wahai anakku! sesungguhnya aku bermimpi bahwa aku dalam mimpiku itu diperintah oleh Allah untuk menyembelihmu. Maka pikirkanlah bagaimana pendapatmu!' dengan penuh kepasrahan kepada Allah dan ketaatan pada ayahnya, dia menjawab, 'wahai ayahku! lakukanlah apa yang diperintahkan oleh Allah kepadamu; insya Allah engkau akan mendapatiku termasuk orang yang sabar dalam melaksanakan perintah-Nya. '."
  }
]