[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manakala ismail mulai besar dan berjalan bersama ayahnya, ayahnya berkata kepadanya ”sesunggunya aku bermimpi menyembelihmu apa pendapatmu? dan mimpi para nabi adalah haq maka ismail menjawab dengan meraih ridha tuhannya dan berbakti kepada bapaknya serta membantunya untuk menaati Allah “lakukanlah apa yang diperintahkan oleh Allah, sembelihlah aku, engkau akan melihatku insya Allah sebagai orang yang sabar, taat dan hanya berharap pahala dari Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Tatkala Ismail menjadi pemuda, usahanya mencapai usaha bapaknya, bapaknya Ibrahim bermimpi, dan mimpi para Nabi adalah wahyu. Ibrahim menyampaikan kandungan mimpinya kepada anaknya, “Anakku! Sesungguhnya aku bermimpi menyembelihmu, maka pikirkanlah apa pendapatmu tentangnya.” Ismail menjawab kata-kata bapaknya, “Bapakku! Lakukanlah apa yang Allah perintahkan kepadamu, yaitu menyembelihku, engkau akan mendapati diriku termasuk orang-orang yang sabar, yang rela menerima hukum Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Ketika Ismail telah beranjak dewasa dan mulai tampak bantuan dan pertolongannya bagi Ibrahim, Ibrahim berkata kepadanya: “Wahai anakku, aku melihat dalam mimpi, aku menyembelihmu. Bagaimana menurutmu tentang mimpi ini?” Maka Ismail menjawab dengan jawaban yang menyejukkan hati, memudahkan urusan Ibrahim, diridhai Tuhannya, dan menunjukkan baktinya kepada Ibrahim; ia berkata: “Laksanakanlah apa yang engkau lihat dan kerjakan ketaatan yang diperintahkan kepadamu; insyaallah engkau akan mendapatiku sebagai anak yang sabar, taat, dan ridha.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. فَلَمَّا بَلَغَ مَعَهُ السَّعْىَ (Maka tatkala anak itu sampai (pada umur sanggup) berusaha bersama-sama Ibrahim) Yakni setelah dia mulai dewasa dan mampu melakukan pekerjaan yang biasa dilakukan Ibrahim. Imam Muqatil berpendapat: yakni ketika Ibrahim berjalan dengan anaknya. Dan imam al-Farra’ berpendapat: ketika itu dia berumur 13 tahun. قَالَ يٰبُنَىَّ إِنِّىٓ أَرَىٰ فِى الْمَنَامِ أَنِّىٓ أَذْبَحُكَ(Ibrahim berkata: “Hai anakku sesungguhnya aku melihat dalam mimpi bahwa aku menyembelihmu) Yakni Ibrahim diperintahkan untuk menyembelih anaknya, Ismail. Ibrahim diberi kabar bahwa dia akan dikaruniai anak yang penyabar dan anak itu akan disembelih. Kemudian Allah berfirman: وَبَشَّرْنٰهُ بِإِسْحٰقَ نَبِيًّا مِّنَ الصّٰلِحِينَ “Dan Kami beri dia kabar gembira dengan (kelahiran) Ishaq seorang nabi yang termasuk orang-orang yang saleh.” Namun dalam kitab Taurat yang telah dirubah disebutkan “sembelihlah anak pertamamu dan anak satu-satunya, Ishaq.” Kata ‘Ishaq’ di sini merupakan tambahan dan pemalsuan yang dilakukan oleh orang-orang Yahudi pada kitab Taurat, sebab Ishaq bukanlah anak pertama Ibrahim dan bukan pula anak satu-satunya, namun yang memiliki sifat seperti itu adalah Ismail, dan dalam kitab Taurat sendiri disebutkan hal itu. Dan setelah Ibrahim merelakan anaknya untuk disembelih dan mentaati perintah Allah, maka Allah mengaruniakan kepadanya anak yang lain yaitu Ishaq. فَانظُرْ مَاذَا تَرَىٰ ۚ( Maka fikirkanlah apa pendapatmu!”) Ibrahim meminta pendapat dari Ismail agar mengerahui tingkat kesabarannya dalam menjalankan perintah Allah, sebab mimpi para nabi adalah wahyu dari Allah dan menjalankannya hukumnya wajib. قَالَ يٰٓأَبَتِ افْعَلْ مَا تُؤْمَرُ ۖ( Ia menjawab: “Hai bapakku, kerjakanlah apa yang diperintahkan kepadamu) Yakni lakukanlah apa yang diwahyukan kepadamu untuk menyembelihku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Saat dia mencapai umur yang memungkinkan untuk bekerja bersama ayahnya, Ibrahim berkata: “Wahai anakku, sesungguhnya dalam mimpi aku melihat (penglihatan para nabi itu pasti benar dan merupakan wakyu) bahwa aku sedang menyembelihmu, lalu bagaimana pendapatmu tentang penglihatan itu”. Anaknya berkata kepadanya: “Wahai ayah, kerjakanlah dan tunaikanlah apa yang diperintahkan kepadamu.Aku akan sabar atas perintah Allah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan anak yang sangat santun ketika dewasa, yaitu Ismail AS {Ketika anak itu sampai pada umur dia sanggup bekerja} maka ketika Ismail remaja dan menyadari usaha Ibrahim {Dia berkata} Ibrahim berkata kepada anaknya {“Wahai anakku, sesungguhnya aku bermimpi bahwa aku menyembelihmu. Pikirkanlah apa pendapatmu” Dia menjawab} Anaknya berkata kepadanya {“Wahai ayahku, lakukanlah apa yang diperintahkan kepadamu. Insyaallah kamu akan mendapatiku termasuk orang-orang sabar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. “Maka tatkala anak sampai (pada umur sanggup) berusaha bersama-samanya,” maksudnya, sampai pada umur mampu berusaha bersama Ibrahim dan sudah mencapai usia yang pada umumnya, usi ayang sangat disaayang oleh kedua orangtuanya, di mana beban mengurusinya sudah tidak ada dan masa usia bergunannya telah datang, maka Nabi Ibrahim berkata kepadanya, “Hai anakku, sesungguhnya aku melihat dalam mimpi bahwa aku menyembelihmu.” Maksudnya, aku telah melihat dalam tidur dan bermimpi bahwa Allah memerintahku menyembelihmu. Mimpi para nabi itu adalah wahyu. “Maka pikirkanlah apa pendapatmu!” Karena perintah Allah itu harus dilaksanakan, maka Nabi Ismail berkata dengan sabar, mengharap pahala, rela kepada TUhaannya, dan berbakti kepada ayahnya, “Hai bapakku, kerjakanlah apa yang diperintahkan kepadamu; insyaa allah kamu akan mendapatiku termaasuk oranag-orang yang sabar.” Nabi Ismail menyampaikan kepada ayahnya bahwasanya ia memanatapkan dirinya unttuk sabar, dan ia menyertaakan kehendak Allah padanya, sebab tidak akan terjadi sesuatu tanpa kehendak Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 102: Maka ketika Ismail tumbuh remaja, Ibrahim bermimpi : Wahai anakku, aku bermimpi untuk menyembelihmu, apa pendapatmu ? Maka berkata Ismail :Wahai bapakku lakukanlah apa yang Allah perintahkan jangan ragu, maka engkau akan mendapatiku menjadi orang yang sabar (Insya Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dan mimpi para nabi adalah hak (benar) dan merupakan wahyu. Beliau bermusyawarah dengan anaknya agar anaknya dapat menerima dan tunduk kepada perintah itu. Dengan sikap sabar dan mengharap pahala dari Allah, mencari keridhaan-Nya dan berbakti kepada kedua orang tuanya. Nabi Ismail memberitahukan bapaknya bahwa ia siap bersabar, dan ia sertakan kalimat insya Allah, karena sesuatu tidaklah terjadi tanpa kehendak Allah ‘Azza wa Jalla."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 102",
    "description": "102. Maka ketika anak itu sampai pada usia sanggup berusaha bersamanya, nabi ibrahim berkata, 'wahai anakku! sesungguhnya aku bermimpi bahwa aku dalam mimpiku itu diperintah oleh Allah untuk menyembelihmu. Maka pikirkanlah bagaimana pendapatmu!' dengan penuh kepasrahan kepada Allah dan ketaatan pada ayahnya, dia menjawab, 'wahai ayahku! lakukanlah apa yang diperintahkan oleh Allah kepadamu; insya Allah engkau akan mendapatiku termasuk orang yang sabar dalam melaksanakan perintah-Nya. '103-106. Maka ketika keduanya telah berserah diri, patuh, dan bertawakal kepada Allah, dia pun membaringkan anaknya atas pelipis-Nya ke tanah agar tidak melihat wajah anaknya saat dia menyembelihnya. Nabi ibrahim berbuat demikian supaya keteguhan hatinya dalam melaksanakan perintah Allah tidak terganggu. Ketika pisaunya dia ayunkan, lalu kami panggil dia dari arah bukit, 'wahai ibrahim! sungguh, engkau telah membenarkan mimpi itu sebagai perintah Allah yang wajib engkau laksanakan. ' sungguh, demikianlah tugas yang membutuhkan kesabaran dan pengorbanan tinggi. Kami akan memberi balasan kepada orang-orang yang berbuat baik dan ikhlas dalam beramal. Sesungguhnya perintah ini benar-benar suatu ujian yang nyata dari Allah untuk menguji keimanan dan ketaatan hamba terhadap perintah-Nya."
  }
]