[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika keduanya berserah diri kepada perintah Allah dan tunduk kepadanya, Ibrahim memiringkan anaknya kesampingnya (dan dia ada disis bahunya) diatas tanah untuk menyembelihnya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Manakala keduanya patuh dan tunduk kepada Allah, Ibrahim membaringkan putranya di atas sisi keningnya untuk melaksanakan perintah Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Karena mimpi para nabi merupakan hal yang benar, maka Ibrahim dan Ismail berserah diri kepada perintah Allah dengan penuh keimanan. Kemudian Ibrahim meletakkan dahi Ismail di atas tanah dan benar-benar akan menyembelihnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. فَلَمَّآ أَسْلَمَا (Tatkala keduanya telah berserah diri) Yakni setelah keduanya berserah diri kepada perintah Allah dan mentaati-Nya serta menyerahkan urusan mereka berdua kepada Allah. Yakni salah satunya menyerahkan dirinya kepada Allah dan yang satu lagi menyerahkan anaknya kepada Allah. وَتَلَّهُۥ لِلْجَبِينِ(dan Ibrahim membaringkan anaknya atas pelipis(nya)) Yakni menelungkupkan wajah anaknya di atas tanah agar Ibrahim tidak melihat dari anaknya apa yang dapat melemahkan hatinya. Tempat yang hendak digunakan untuk menyembelih Ismail adalah tempat penyembelihan yang ada di Mina di sisi tempat melempar jumrah. Dan pendapat lain mengatakan tempatnya adalah di negeri Syam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Saat ayah dan anak menyerah dan pasrah atas perintah dan ketaatan kepada Allah, Ibrahim membaringkan dan menidurkan Ismail di sisinya sehingga salah satu pundaknya di permukaan tanah supaya dia (Ibrahim) tidak melihat wajahnya (Ismail) sehingga tidak merasa kasihan kepadanya. Demikian itu di tempat pengorbanan yang berada di Mina saat melempar jumrah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika keduanya telah berserah diri} berserah diri kepada perintah Allah dan tunduk kepadaNya {dan dia meletakkan pelipis anaknya di atas gundukan} Ibrahim meletakkannya di atas gundukan tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. “Tatkala keduanya telah berserah diri,” maksudnya, Nabi Ibrahim dan Nabi Ismail; di mana Nabi Ibrahim sudah bertekad menyembelih anaknya, buah hatinya, sebgia kepaatuhan kepada perintah Rabbny dan tkaut terhadap siksanNya, sedangkan sang anak telah memantapkan dirinya untuk sabar dan taat kepada Rabbnya, sudah menjadi ringan baginya dan demikian pula keridhaan ayahnya, “dan ia membringkan anakny di atas pelipis,” maksudnya, Nabi Ibrhim pun membaringkan Ismail di atas pelipisnya untuk menyembelihnya, dan ia pun mengalihkan mukanya agar tidak melihat wajah anaknya saat penyembelihan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 103: Ketika Ibrahim dan Ismail berserah diri atas perintah Allah, Ibrahim meletakkan Ismail di hadapannya untuk di baringkan yang kemudian disembelih dengan sebilah pisau, maka tidak tersembelih, dia mengetahui akan kasih sayang Allah dengan ditebus menjadi kambing."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tunduk kepada perintah Allah dan Nabi Ibrahim sudah bertekad menyembelih anaknya yang menjadi buah hatinya karena memenuhi perintah Allah dan takut kepada siksa-Nya, sedangkan anaknya juga telah siap untuk bersabar. Untuk menidurkannya dan Beliau alihkan muka anaknya agar Beliau tidak melihatnya ketika hendak menyembelihnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 103",
    "description": "103-106. Maka ketika keduanya telah berserah diri, patuh, dan bertawakal kepada Allah, dia pun membaringkan anaknya atas pelipis-Nya ke tanah agar tidak melihat wajah anaknya saat dia menyembelihnya. Nabi ibrahim berbuat demikian supaya keteguhan hatinya dalam melaksanakan perintah Allah tidak terganggu. Ketika pisaunya dia ayunkan, lalu kami panggil dia dari arah bukit, 'wahai ibrahim! sungguh, engkau telah membenarkan mimpi itu sebagai perintah Allah yang wajib engkau laksanakan. ' sungguh, demikianlah tugas yang membutuhkan kesabaran dan pengorbanan tinggi. Kami akan memberi balasan kepada orang-orang yang berbuat baik dan ikhlas dalam beramal. Sesungguhnya perintah ini benar-benar suatu ujian yang nyata dari Allah untuk menguji keimanan dan ketaatan hamba terhadap perintah-Nya"
  }
]