[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "104-105 lalu Kami memanggil Ibrahim dalam keadaan yang sangat sulit tersebut, ”wahai Ibrahim, kamu telah melakukan apa yang aku perintahkan kepadamu dan kamu telah membenarkan mimpimu. sesungguhnya Kami membalas orang-orang yang berbuat baik sepertimu sebagaimana Kami membalasmu atas pembenaranmu, sehingga Kami menyelamatkan mereka dari kesuliatn-kesulitan di dunia daan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Kami memanggil Ibrahim yang hendak melaksanakan perintah Allah untuk menyembelih anaknya, “Wahai Ibrahim!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104-105. Maka Kami menyeru Ibrahim di saat yang sulit itu: “Hai Ibrahim, kamu telah melaksanakan dan membenarkan mimpi itu dengan bersegera mentaatinya, begitu pula dengan anakmu. Sebagaimana Kami membalas ketaatanmu dengan mengeluarkanmu dari hal sulit ini dan menyelamatkan anakmu dari penyembelihan; Kami juga akan membalas dan menyelamatkan orang-orang baik dengan menyelamatkan mereka dari kesulitan di dunia dan di akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104-105. قَدْ صَدَّقْتَ الرُّءْيَآ ۚ وَنٰدَيْنٰهُ أَن يٰٓإِبْرٰهِيمُ (Dan Kami panggillah dia: “Hai Ibrahim, sesungguhnya kamu telah membenarkan mimpi itu) Terdapat pendapat mengatakan bahwa ketika Ibrahim telah membaringkan Ismail untuk menyembelihnya, ia diseru dari arah gunung “hai Ibrahim, kamu telah membenarkan mimpi itu.” Ibrahim dianggap telah membenarkan mimpi itu meski baru berniat melaksanakannya dan belum melakukan penyembelihan, sebab ia telah melakukan apa yang dapat ia lakukan. إِنَّا كَذٰلِكَ نَجْزِى الْمُحْسِنِينَ (sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik) Dengan menyelamatkan mereka dari kesulitan dan ujian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Kami memanggilnya dari arah gunung “Wahai Ibrahim”. {An} itu adalah “An Tafsiriyyah” yang menunjukkan bahwa sesuatu setelahnya adalah sesuatu yang mengandung banyak penafsiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami memanggil dia,“Wahai Ibrahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104-105. “Dan Kami panggillah dia,” pada saat yang menegangkan dan perkara yang sangat mengerikan itu, “Hai Ibrahaim, sesungguhnya kamu telah membenarkan mimpi itu.” Maksudnya, sesungguhnya kamu telah melakukan apa yang telah diperintahkan padamu, maka sesungguhnya kamu telah meneguhkan dirimu atas perintah itu dan kamu telah melakukan segala sesuatunya, dan tidak ada yang tersisa selain menekankan pisau pada lehernya, “SEsungguuhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat ihsan” dalam beribadah kepada Kami, yang lebih mengutamakan keridhaan Kami atas kehendak nafsu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 104: 104-105. Kemudian Allah menyeru Ibrahim, dan berkata kepadanya : Sungguh benar mimpimu wahai Ibrahim, engkau bergegas mengerjakan apa yang Aku perintahkan, Kami sangat senang dan Kami permudah atas urusan tersebut. Kami balas dengan segala kebaikan karena sebab bergegasnya engkau dari apa yang telah Kami perintahkan, meskipun padanya terdapat ujian dan kesulitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 104",
    "description": "103-106. Maka ketika keduanya telah berserah diri, patuh, dan bertawakal kepada Allah, dia pun membaringkan anaknya atas pelipis-Nya ke tanah agar tidak melihat wajah anaknya saat dia menyembelihnya. Nabi ibrahim berbuat demikian supaya keteguhan hatinya dalam melaksanakan perintah Allah tidak terganggu. Ketika pisaunya dia ayunkan, lalu kami panggil dia dari arah bukit, 'wahai ibrahim! sungguh, engkau telah membenarkan mimpi itu sebagai perintah Allah yang wajib engkau laksanakan. ' sungguh, demikianlah tugas yang membutuhkan kesabaran dan pengorbanan tinggi. Kami akan memberi balasan kepada orang-orang yang berbuat baik dan ikhlas dalam beramal. Sesungguhnya perintah ini benar-benar suatu ujian yang nyata dari Allah untuk menguji keimanan dan ketaatan hamba terhadap perintah-Nya"
  }
]