[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "104-105 lalu Kami memanggil Ibrahim dalam keadaan yang sangat sulit tersebut, ”wahai Ibrahim, kamu telah melakukan apa yang aku perintahkan kepadamu dan kamu telah membenarkan mimpimu. sesungguhnya Kami membalas orang-orang yang berbuat baik sepertimu sebagaimana Kami membalasmu atas pembenaranmu, sehingga Kami menyelamatkan mereka dari kesuliatn-kesulitan di dunia daan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Kamu telah merealisasikan mimpimu dengan tekad kuatmu untuk menyembelih anakmu. Sebagaimana Kami membalasmu dengan membebaskanmu dari ujian yang berat ini, Kami juga membalas orang-orang yang berbuat baik dengan menyelamatkan mereka dari ujian dan cobaan.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Sungguh kamu telah menyelesaikan apa yang diperintahkan kepadamu dalam mimpi itu dengan bertekad kuat untuk menunaikannya dan mempercayainya hanya dengan tekad. Jika saja tidak mengorbankannya, Sebagaimana membalas dan membebaskanmu dari penderitaan., Kami juga akan membalas orang-orang yang baik terhadap diri mereka dengan menjalankan perintah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kamu telah membenarkan} membenarkan {mimpi itu” Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104-105. “Dan Kami panggillah dia,” pada saat yang menegangkan dan perkara yang sangat mengerikan itu, “Hai Ibrahaim, sesungguhnya kamu telah membenarkan mimpi itu.” Maksudnya, sesungguhnya kamu telah melakukan apa yang telah diperintahkan padamu, maka sesungguhnya kamu telah meneguhkan dirimu atas perintah itu dan kamu telah melakukan segala sesuatunya, dan tidak ada yang tersisa selain menekankan pisau pada lehernya, “SEsungguuhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat ihsan” dalam beribadah kepada Kami, yang lebih mengutamakan keridhaan Kami atas kehendak nafsu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 105: 104-105. Kemudian Allah menyeru Ibrahim, dan berkata kepadanya : Sungguh benar mimpimu wahai Ibrahim, engkau bergegas mengerjakan apa yang Aku perintahkan, Kami sangat senang dan Kami permudah atas urusan tersebut. Kami balas dengan segala kebaikan karena sebab bergegasnya engkau dari apa yang telah Kami perintahkan, meskipun padanya terdapat ujian dan kesulitan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan membenarkan mimpi ialah mempercayai bahwa mimpi itu benar dari Allah Subhaanahu wa Ta'aala dan melaksanakannya. Yakni dalam beribadah kepada Allah dan mengutamakan keridhaan-Nya daripada keinginan hawa nafsunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 105",
    "description": "103-106. Maka ketika keduanya telah berserah diri, patuh, dan bertawakal kepada Allah, dia pun membaringkan anaknya atas pelipis-Nya ke tanah agar tidak melihat wajah anaknya saat dia menyembelihnya. Nabi ibrahim berbuat demikian supaya keteguhan hatinya dalam melaksanakan perintah Allah tidak terganggu. Ketika pisaunya dia ayunkan, lalu kami panggil dia dari arah bukit, 'wahai ibrahim! sungguh, engkau telah membenarkan mimpi itu sebagai perintah Allah yang wajib engkau laksanakan. ' sungguh, demikianlah tugas yang membutuhkan kesabaran dan pengorbanan tinggi. Kami akan memberi balasan kepada orang-orang yang berbuat baik dan ikhlas dalam beramal. Sesungguhnya perintah ini benar-benar suatu ujian yang nyata dari Allah untuk menguji keimanan dan ketaatan hamba terhadap perintah-Nya"
  }
]