[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya perintah untuk menyembelih anakmu adalah ujian yang berat yang telah membuktikan kebenaran imanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Sesungguhnya ini adalah ujian yang benar-benar nyata, Ibrahim lulus di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Sungguh perintah untuk menyembelih anakmu merupakan ujian berat yang banyak manusia tidak mampu melaksanakannya; dan ketaatanmu itu menjelaskan kebenaran imanmu dan kekuatan keyakinanmu kepada Tuhanmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. إِنَّ هٰذَا لَهُوَ الْبَلٰٓؤُا۟ الْمُبِينُ (Sesungguhnya ini benar-benar suatu ujian yang nyata) Yakni sungguh ini adalah ujian yang menampakkan keberhasilan Ibrahim dalam melewatinya, yang mana Allah telah menguji ketaatannya dengan memerintahkannya untuk menyembelih anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Sesungguhnya pengorbanan yang diperintahkan kepadanya ini adalah ujian nyata yang berhasil dijalani Ibrahim dan ujian yang membedakan orang ikhlas dengan yang lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini benar-benar suatu ujian yang nyata} ujian yang nyata dimana Allah mengujinya untuk menyembelih anaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. “Sesungguhnya ini,” yang Kami ujikan terhadap Ibrahim, ini “benar-benar suatu ujian yang nyata,” yang sangat jelas, yang dengannya ketulusan Ibrahim, kesempurnaan cintanya kepada Rabbnya, dan kesetiaannya menjadi Nampak jelas. Karena, ketika Allah menganugerahkan Ismail kepada Ibrahim, dia sangat mencintainya, padahal dia adalah khalilurrahman (orang yang sangat-sangat dicintai Allah). Kata khullah (Khalil) adalah tinkat tertinggi dalam kecintaan, dan ia sepenuhnya tercurahkan, tidak dapat dicampuri apa pun, dan berkonsekuensi bahwa seluruh bagian kalbu terpaut kepada sang mahbub (kekasih). Tatkala salah satu bagian dari bagian-bagian hatinya terpaut (tergantung, terkonsentrasi) kepada putranya, Ismail, maka Allah hendak memurnikan cintanya dan menguji untuk menyembelih orang yang kecintaan kepadanya telah mengusik kecintaan kepada Rabbnya. Tatkala Ibrahim telah mementingkan cinta Allah dan mengutamakannya atas hawa naafsunya serta telah berbulat hati untuk menyembelihnya dan pengusik cinta kepada Rabbnya telah hilang dari dalam kalbunya, maka penyembelihan menjadi tidak ada artinya, maka dari itu Allah berfirman, “Sesungguhnya ini benar-benar cobaan yang nyata.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 106: Allah mensifati perintah penyembelihan Ibrahim kepada anaknya dengan ujian yang besar, yang tidak akan dapat dibebankan (ujian tersebut) kecuali kepada pemilih keyakinan yang besar, dan telah berhasil Ibrahim melewati ujian tersebut, oleh sebab itu dia berhak mendapatkan kemuliaan yang agung, dan Allah jadikan setelahnya anak keturunannya menjadi para Nabi beserta cucu-cucunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, dengan ujian tersebut jelaslah kebersihan Nabi Ibrahim ‘alaihis salam, sempurnanya cintanya kepada Tuhannya. Hal itu, karena ketika Allah menganugerahkan Nabi Ismail ‘alaihis salam kepadanya, maka Nabi Ibrahim sangat cinta sekali kepada anaknya, sedangkan Beliau adalah kekasih Allah, dan kekasih adalah kecintaan paling tinggi yang tidak menerima adanya keikutsertaan. Saat hati Nabi Ibrahim terpaut oleh cinta kepada anaknya, Allah Subhaanahu wa Ta'aala hendak membersihkan cinta Nabi Ibrahim dan menguji sejauh mana cintanya kepada Allah, maka Allah memerintahkan Ibrahim menyembelih anaknya yang Beliau cintai karena berbenturan dengan kecintaan kepada Tuhannya. Ketika ternyata, Beliau lebih mengutamakan kecintaan Allah dan mengedepankannya di atas hawa nafsunya, dan telah bertekad menyembelih puteranya, maka penyembelihan tidak ada lagi faedahnya, karena sudah jelas cintanya kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 106",
    "description": "103-106. Maka ketika keduanya telah berserah diri, patuh, dan bertawakal kepada Allah, dia pun membaringkan anaknya atas pelipis-Nya ke tanah agar tidak melihat wajah anaknya saat dia menyembelihnya. Nabi ibrahim berbuat demikian supaya keteguhan hatinya dalam melaksanakan perintah Allah tidak terganggu. Ketika pisaunya dia ayunkan, lalu kami panggil dia dari arah bukit, 'wahai ibrahim! sungguh, engkau telah membenarkan mimpi itu sebagai perintah Allah yang wajib engkau laksanakan. ' sungguh, demikianlah tugas yang membutuhkan kesabaran dan pengorbanan tinggi. Kami akan memberi balasan kepada orang-orang yang berbuat baik dan ikhlas dalam beramal. Sesungguhnya perintah ini benar-benar suatu ujian yang nyata dari Allah untuk menguji keimanan dan ketaatan hamba terhadap perintah-Nya. 107-111. Dan ketika nabi ibrahim dan anaknya membuktikan kete-guhan dan ketulusan mereka dalam menerima ujian Allah, kami tebus anak itu dengan seekor domba sembelihan yang besar. Dan karena kepa-tuhannya pula kami abadikan untuk nabi ibrahim buah tutur yang indah dan pujian yang baik di kalangan orang-orang yang datang kemudian hingga akhir zaman (lihat pula: surah asy-syu'ar'/26: 84). Kepadanya kami sampaikan pula ucapan 'selamat sejahtera bagi nabi ibrahim' sebagai penghargaan kepadanya. Demikianlah imbalan itu kami berikan kepadanya, dan kami akan memberi balasan kepada orang-orang yang berbuat baik dengan imbalan pahala di sisi kami. Sungguh, dia termasuk hamba-hamba kami yang beriman, jujur, patuh, dan ikhlas dalam melaksanakan perintah kami."
  }
]