[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menyelamatkan ismail dan Kami menggantinya dengan seekor domba yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Kami mengganti Ismail dengan domba besar yang disembelih sebagai gantinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Kami menyelamatkan anakmu, dan mengganti sembelihannya dengan domba yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَفَدَيْنٰهُ بِذِبْحٍ عَظِيمٍ (Dan Kami tebus anak itu dengan seekor sembelihan yang besar) Allah menurunkan kambing yang besar yang kemudian disembelih oleh Ibrahim sebagai ganti dari penyembelihan anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Kami tebus Ismail dengan hewan yang berbadan besar dan gemuk yang selanjutnya akan dijadikan kurban. Kurban itu sesuai bebannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menebusnya dengan hewan sembelihan} dengan domba {yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. “Dan Kami tebus anak itu dengan seekor sembelihan yang besar.” Maksudnya, maka gantinya adalah sembelihan berupa domba yang sangat besar, disembelih oleh Ibrahim. Sembelihan ini menjadi agung (besar) dilihat dari sudut sebagai ganti Ismail dan dilihat dari sudut keberadaannya sebagai salah satu bentuk ibadah yang sangat mulia, serta dilihat dari sudut keberadaannya sebagai kurban dan sunnah hingga Hari KIamat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 107: Dan yang paling nampak akan karunia Allah atas Ibrahim dan Ismail, yaitu ketika akan disembelih, maka digantikan dengan kambing, yang menggantikan Ismail."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah nyata kesabaran dan ketaatan Ibrahim dan Ismail ‘alaihimas salam, maka Allah melarang menyembelih Ismail dan untuk melanjutkan korban, Allah menggantinya dengan seekor sembelihan (kambing). Peristiwa ini menjadi dasar disyariatkannya Qurban yang dilakukan pada hari raya haji. Kambing tersebut dikatakan ‘azhim (besar) karena sebagai tebusan bagi Ismail, dan karena dalam ibadah yang agung, yaitu ibadah kurban, dan karena ia menjadi sebuah sunnah yang berlaku sepanjang zaman sampai hari Kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 107",
    "description": "107-111. Dan ketika nabi ibrahim dan anaknya membuktikan kete-guhan dan ketulusan mereka dalam menerima ujian Allah, kami tebus anak itu dengan seekor domba sembelihan yang besar. Dan karena kepa-tuhannya pula kami abadikan untuk nabi ibrahim buah tutur yang indah dan pujian yang baik di kalangan orang-orang yang datang kemudian hingga akhir zaman (lihat pula: surah asy-syu'ar'/26: 84). Kepadanya kami sampaikan pula ucapan 'selamat sejahtera bagi nabi ibrahim' sebagai penghargaan kepadanya. Demikianlah imbalan itu kami berikan kepadanya, dan kami akan memberi balasan kepada orang-orang yang berbuat baik dengan imbalan pahala di sisi kami. Sungguh, dia termasuk hamba-hamba kami yang beriman, jujur, patuh, dan ikhlas dalam melaksanakan perintah kami"
  }
]