[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami menyisakan sanjungan yang baik bagi Ibrahim pada umat-umat sesudahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Kami mencatatkan bagi Ibrahim sanjungan yang baik pada umat-umat yang datang kemudian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Dan Kami tetapkan bagi Ibrahim dan Ismail pujian baik yang tetap ada pada umat-umat setelahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108-109. سَلٰمٌ عَلَىٰٓ إِبْرٰهِيمَ وَتَرَكْنَا عَلَيْهِ فِى الْاٰخِرِينَ (Kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian) Yakni pada umat-umat yang datang setelahnya. Dan makna (السلام) yakni pujian yang baik, atau ucapan “’alaihissalam”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Kami abadikan pujian baik untuk Ibrahim di generasi-generasi selanjutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mengabadikan untuknya (pujian) pada orang-orang yang datang kemudian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108-109. “Kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian, ‘kesejahteraan dilimpahkan atas Ibrahim’.” Maksudnya, Kami abadikan untuknya pujian sejati pada orang-orang yang datang kemudian sebagaimana terjadi pada orang-orang terdahulu. Maka, setiap waktu sepeninggalnya, ia selalu dicintai, dimuliakan, dan dipuji, “KEsejahteraan dilimpahkan atas Ibrahim.” Maksudnya, salam hormat untuknya. Ini sama dengan FirmanNYa, “Katakanlah: \"Segala puji bagi Allah dan kesejahteraan atas hamba-hamba-Nya yang dipilih-Nya. Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan Dia?\" (An-Naml:59)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 108: 108-109. Allah mengabarkan bahwa umat setelah Ibrahim menyanjungnya, memberikan shalawat padanya dan pujian baginya dengan pujian di awal dan di akhir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Ibrahim rela dikucilkan oleh kaumnya karena mencari keridhaan Allah, sampai Beliau berhijrah dan telah teruji keimanannya, maka Allah Subhaanahu wa Ta'aala membalas Beliau di dunia dan akhirat dengan balasan yang besar. Contoh balasan yang Allah berikan untuknya di dunia adalah tidak ada satu waktu pun berlalu sepeninggal Nabi Ibrahim kecuali Beliau dimuliakan, dipuji, disebut kebaikannya dan dikenang oleh manusia setelahnya sampai sekarang dan seterusnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 108",
    "description": "107-111. Dan ketika nabi ibrahim dan anaknya membuktikan kete-guhan dan ketulusan mereka dalam menerima ujian Allah, kami tebus anak itu dengan seekor domba sembelihan yang besar. Dan karena kepa-tuhannya pula kami abadikan untuk nabi ibrahim buah tutur yang indah dan pujian yang baik di kalangan orang-orang yang datang kemudian hingga akhir zaman (lihat pula: surah asy-syu'ar'/26: 84). Kepadanya kami sampaikan pula ucapan 'selamat sejahtera bagi nabi ibrahim' sebagai penghargaan kepadanya. Demikianlah imbalan itu kami berikan kepadanya, dan kami akan memberi balasan kepada orang-orang yang berbuat baik dengan imbalan pahala di sisi kami. Sungguh, dia termasuk hamba-hamba kami yang beriman, jujur, patuh, dan ikhlas dalam melaksanakan perintah kami"
  }
]