[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagai penghormatan untuk Ibrahim disisi Allah dan doa kebaikan untuknya agar selamat dari segala celaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Sebagai penghormatan dari Allah baginya, doa keselamatan dari segala musibah dan penyakit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109-111. Keselamatan yang diberkahi bagi Ibrahim dari sisi Allah. Sebagaimana Kami membalas Ibrahim atas ketaatannya dalam melaksanakan perintah Kami, demikian pula Kami akan membalas hamba-hamba Kami yang berbuat baik. Sungguh Ibrahim termasuk orang-orang beriman yang ikhlas dan menyempurnakan hak peribadatan dan ketaatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Salam dari Kami untuk Ibrahim. Pujian baik dan indah pula dari manusia dipersembahkan untuknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Semoga kesejahteraan atas Ibrahim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108-109. “Kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian, ‘kesejahteraan dilimpahkan atas Ibrahim’.” Maksudnya, Kami abadikan untuknya pujian sejati pada orang-orang yang datang kemudian sebagaimana terjadi pada orang-orang terdahulu. Maka, setiap waktu sepeninggalnya, ia selalu dicintai, dimuliakan, dan dipuji, “KEsejahteraan dilimpahkan atas Ibrahim.” Maksudnya, salam hormat untuknya. Ini sama dengan FirmanNYa, “Katakanlah: \"Segala puji bagi Allah dan kesejahteraan atas hamba-hamba-Nya yang dipilih-Nya. Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan Dia?\" (An-Naml:59)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 109: 108-109. Allah mengabarkan bahwa umat setelah Ibrahim menyanjungnya, memberikan shalawat padanya dan pujian baginya dengan pujian di awal dan di akhir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 109",
    "description": "107-111. Dan ketika nabi ibrahim dan anaknya membuktikan kete-guhan dan ketulusan mereka dalam menerima ujian Allah, kami tebus anak itu dengan seekor domba sembelihan yang besar. Dan karena kepa-tuhannya pula kami abadikan untuk nabi ibrahim buah tutur yang indah dan pujian yang baik di kalangan orang-orang yang datang kemudian hingga akhir zaman (lihat pula: surah asy-syu'ar'/26: 84). Kepadanya kami sampaikan pula ucapan 'selamat sejahtera bagi nabi ibrahim' sebagai penghargaan kepadanya. Demikianlah imbalan itu kami berikan kepadanya, dan kami akan memberi balasan kepada orang-orang yang berbuat baik dengan imbalan pahala di sisi kami. Sungguh, dia termasuk hamba-hamba kami yang beriman, jujur, patuh, dan ikhlas dalam melaksanakan perintah kami"
  }
]