[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "tanyakanlah (wahai rasul) kepada orang-orang yang mengingkari kebangkitan kembali itu ”apakah penciptaan mereka itu lebih sulit daripada penciptaan makhluk-makhluk yang lainnya yang telah kami ciptakan? Sesungguhnya kami menciptakan bapak mereka, adam dari tanah liat yang sebagiannya lengket dengan sebagian yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Tanyakanlah -wahai Rasul- kepada orang-orang kafir yang mengingkari kebangkitan, apakah mereka itu lebih kuat penciptaan, lebih kuat jasad dan lebih kokoh anggota tubuhnya dibandingkan orang-orang yang Kami ciptakan di langit dan di bumi dan Malaikat-Malaikat? Sesungguhnya Kami menciptakan mereka dari lumpur kental, bagaimana mereka bisa mengingkari kebangkitan, sementara mereka diciptakan dari makhluk yang lemah, yaitu lumpur kental?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Hai Rasulullah, tanyakanlah kepada kaummu yang mendustakan agama dan mengingkari hari kebangkitan: “Manakah lebih sulit, penciptaan kalian atau penciptaan langit, bumi, dan seisinya, serta seluruh makhluk lainnya?” Tidak diragukan lagi, bahwa jawabannya adalah penciptaan langit, bumi, dan seisinya lebih sulit daripada penciptaan manusia. Allah menciptakan manusia yang pertama -Nabi Adam- dari tanah yang lengket pada tangan karena begitu lemah; maka bagaimana manusia yang lemah asal usulnya ini mengingkari hari kebangkitan?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَاسْتَفْتِهِمْ أَهُمْ أَشَدُّ خَلْقًا أَم مَّنْ خَلَقْنَآ ۚ (Maka tanyakanlah kepada mereka (musyrik Mekah): “Apakah mereka yang lebih kukuh kejadiannya ataukah apa yang telah Kami ciptakan itu?”) Yakni tanyakanlah orang-orang kafir yang mengingkari hari kebangkitan, apakah mereka lebih susah diciptakan dan lebih kuat tubuhnya serta lebih besar badannya, atau langit, bumi, dan para malaikat yang telah Kami ciptakan? إِنَّا خَلَقْنٰهُم مِّن طِينٍ لَّازِبٍۭ (Sesungguhnya Kami telah menciptakan mereka dari tanah liat) Makna (اللازب) yakni tanah yang lengket di tangan. Yakni bagaimana mereka menganggap mustahil hari kebangkitan padahal mereka hanya tercipta dari sesuatu yang lemah seperti ini? Padahal itu tidak diingkari oleh makhluk yang lebih kuat, lebih besar, dan lebih sempurna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Maka tanyakanlah wahai rasulallah kepada orang-orang musyrik yang mengingkari hari kebangkitan itu apakah mereka memiliki jasad paling kuat dan merupakan ciptaan paling bijaksana ataukah ciptaan kami dari golongan malaikat dan penduduk langit dan bumi? Sesungguhnya kami telah menciptakan ayah mereka, Adam dari tanah liat yang lengket dengan tangan. Pertanyaan itu sebagai bentuk pemberitahuan atau bahkan ejekan. Ucapan adalah cara awal untuk mengajak menuju Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka, tanyakanlah kepada mereka} maka tanyakanlah kepada penduduk Mekkah {“Apakah mereka lebih sulit penciptaannya atau ciptaan (lain) yang telah Kami ciptakan” Sesungguhnya Kami telah menciptakan mereka dari tanah liat} yang lengket"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. setelah Allah menjelaskan makhuk-makhluk agung tersebut, Dia berfirman, ”maka tanyakanlah kepada mereka,” maksudnya, tanyakanlah (olehmu wahai Muhammad) kepada orang-orang yang mengingkari penciptaan sesudah mereka setelah kematiannya “apakah mereka lebih kukuh kejadiannya?” yakni, dalam pengadaan setelah kematian mereka, menjadi makhluk yang lebih kuat dan lebih berat, ”ataukah apa yang telah kami ciptakan,” diantara makhluk-makhluk ini? Maka mereka harus mengakui (meyakini) bahwa penciptaan langit dan umi itu lebih besar dari pada manusia. Maka mestilah mereka mengakui adanya kebangkitan. Bahkan kalau mereka kembali kepada diri mereka, sendiri dan merenungkannya, tentu mereka mengetahui bahwa permulaan penciptaan mereka dari tanah liat lebih sulit –saat direnungkan- daripada penciptaan mereka kembali sesudah mereka mati. Maka dari itu Allah berfirman “sesungguhnya kami telah menciptakan mereka dari tanah liat.” Maksudnya,yang sangat kuat lagi keras. Ini seperti dalam firman Allah : ”dan sesungguhnya kami telah menciptakan manusia (adam) dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk” (al-hijr:26)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 11: Maka wahai Nabi ﷺ jika segala sesuatu telah bersaksi bahwa Allah saja Tuhan Yang Kuasa; Maka tanyakan kepada orang-orang yang ingkar akan kebangkitan : Apakah jasad-jasad mereka lebih kuat daripada para makhluk ini yang Allah telah ciptakan ? Kemudian kabarkan kepada mereka bahwa Allah yang menciptakan bapak mereka Adam dari tanah yang bersatu sebagian atas sebagaian yang lain, dan ini adalah petunjuk bawasanya Allah Maha Kuasa dan atas lemahnya mereka, maka mengapa mereka mengingkari pengembalian atas jasad mereka ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang penciptaan makhluk-makhluk yang besar, seperti langit, bumi, malaikat, dsb. maka Allah Subhaanahu wa Ta'aala memerintahkan bertanya kepada orang-orang yang mengingkari kebangkitan setelah mati agar mereka mengakuinya atau sebagai celaan bagi mereka. Setelah mati. Yaitu malaikat, langit, bumi dan lain-lain. Tentu mereka akan mengakui, bahwa penciptaan langit dan bumi lebih besar daripada penciptaan manusia. Hal ini seharusnya membuat mereka mengakui adanya kebangkitan setelah mati, bahkan kalau seandainya mereka merenungkan keadaan diri mereka, tentu mereka akan mengetahui bahwa awal penciptaan mereka adalah dari tanah liat, di mana hal ini lebih sulit dibayangkan daripada penciptaan kembali setelah sebelumnya pernah ada dan masih tersisa sebagian tulangnya. Yaitu nenek moyang mereka, Adam ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 11",
    "description": "Usai menjelaskan bukti-bukti kekuasaan-Nya di alam raya, Allah beralih membuktikan kuasa-Nya dalam menciptakan manusia. Wahai nabi Muhammad, maka tanyakanlah kepada mereka yang musyrik, 'apakah penciptaan mereka yang lebih sulit ataukah apa yang telah kami ciptakan itu yakni malaikat, langit, dan bumi seisinya'' sesungguhnya kami telah menciptakan nabi adam, yaitu nenek moyang mereka dari tanah liat. 12. Wahai nabi Muhammad, bahkan engkau menjadi heran atas keingkaran mereka terhadap risalahmu, hari kebangkitan, dan kekuasaan Allah, dan mereka menghinakan engkau karena keherananmu itu dan mereka pun menyepelekan hari kebangkitan."
  }
]