[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sebagimana Kami memberikan balasan baik bagi Ibrahim karena ketaatannya kepada Kami dan melaksanakan perintah Kami, begitu pula Kami membalas orang-orang yang berbuat baik dari hamba-hamba Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Sebagaimana Kami membalas Ibrahim dengan balasan ini, Kami membalas orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Sebagaimana membalasmu dengan balasan ini, Kami akan membalas orang-orang yang baik kepada diri sendiri dengan menaati Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. “Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik,” dalam beribadah kepada Allah dan bergaul dengan sesame manusia, yaitu Kami membebaskan mereka dari berbagai kesempitan, serta kesudahan, dan pujian yang baik Kami berikan kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 110: Allah mengabarkan dengan balasan yang semisal dengan Ibrahim ini, Kami juga akan berikan balasan yang serupa bagi siapa yang baik dalam keimanan dan ketakwaan. Ini adalah kabar gembira bagi orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dalam beribadah maupun dalam bergaul dengan manusia, di mana ia berusaha memilih yang terbaik untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 110",
    "description": "107-111. Dan ketika nabi ibrahim dan anaknya membuktikan kete-guhan dan ketulusan mereka dalam menerima ujian Allah, kami tebus anak itu dengan seekor domba sembelihan yang besar. Dan karena kepa-tuhannya pula kami abadikan untuk nabi ibrahim buah tutur yang indah dan pujian yang baik di kalangan orang-orang yang datang kemudian hingga akhir zaman (lihat pula: surah asy-syu'ar'/26: 84). Kepadanya kami sampaikan pula ucapan 'selamat sejahtera bagi nabi ibrahim' sebagai penghargaan kepadanya. Demikianlah imbalan itu kami berikan kepadanya, dan kami akan memberi balasan kepada orang-orang yang berbuat baik dengan imbalan pahala di sisi kami. Sungguh, dia termasuk hamba-hamba kami yang beriman, jujur, patuh, dan ikhlas dalam melaksanakan perintah kami"
  }
]