[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menyampaikan berita gembira kepada ibraahim bahwa Kami menjadiakn ishaq putranya sebagai nabi di kalangan orang-orang shaih, sebagai balasan untuknya atas kesabarannya dan kerelaannya menerima perintah tuhannya dan ketaatan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Kami memberinya kabar gembira berupa anak kedua yang menjadi seorang nabi dan hamba yang saleh, dia adalah Isḥāq, sebagai balasan atas ketaatannya kepada Allah dalam menyembelih putra semata wayangnya Ismail."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Dan Kami kabarkan kepada Ibrahim tentang kehadiran anak yang lain baginya yang bernama Ishaq, dia akan menjadi seorang nabi yang shalih; sebagai balasan atas kesabaran dan keridhaannya terhadap perintah Tuhannya, dan ketaatan kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. وَبَشَّرْنٰهُ بِإِسْحٰقَ نَبِيًّا مِّنَ الصّٰلِحِينَ (Dan Kami beri dia kabar gembira dengan (kelahiran) Ishaq seorang nabi yang termasuk orang-orang yang saleh) Yakni Allah memberinya kabar gembira dengan anak lagi yang akan menjadi seorang nabi sebagai balasan atas ketaatannya kepada Allah dalam menjalankan perintah untuk menyembelih anak satu-satunya ketika itu, Ismail."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Kami memberikan kabar gembira kepada Ibrahim tentang anak lainnya, yaitu Ishaq yang akan menjadi nabi dan ditakdirkan termasuk orang-orang shalih. Ini adalah dalil bahwa yang dikurbankan adalah satu-satunya anak laki-laki pertama, yaitu Ismail."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah memberinya kabar gembira tentang Ishaq, seorang nabi yang termasuk orang-orang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. “Dan Kami beri dia kabar gembira dengan Ishaq sebagai seorang nabi yang termasuk orang-orang yang shalih.” Ini adalah berita gembira kedua mengenai akan dilahirkannya Ishaq, yang dibelakangnya adalah Ya’qub. Jadi, Ibrahim telah diberi kabar gembira dengan keberadaannya, kelangsungannya dan keberadaan anak keturunannya serta keberadaannya sebagai seorang nabi yang termasuk orang-orang shalih. Itu semua adalah kabar gembira yang beragam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 112: Kemudian Allah menyempurnakan nikmat-Nya kepada Ibrahim dengan kabar gembira lahirnya anak (yang lain) yaitu Ishaq, dan Allah jadikan sebagai Nabi yang shalih serta memberkahi keduanya dengan keturunan yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah kabar gembira yang kedua untuk Nabi Ibrahim, yaitu kabar gembira atas kelahiran Ishaq dari istrinya Sarah, di mana dari Ishaq akan lahir seorang nabi juga, yaitu Ya’qub."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 112",
    "description": "112-113. Dan di samping buah tutur dan pujian yang indah bagi nabi ibrahim sepanjang masa, kami beri pula dia kabar gembira melalui malaikat dengan kelahiran putra keduanya, yaitu nabi ishak. Kelak dia juga menjadi seorang nabi yang termasuk golongan orang-orang yang saleh dan berilmu (lihat pula: surah h'd/11: 69'73 dan a'-''riy't/51: 24'30). Dan demikianlah kami limpahkan keberkahan kepadanya dan kepada nabi ishak dengan nikmat kenabian. Dan di antara keturunan keduanya ada yang berbuat baik, menaati perintah Allah, dan menyeru ke jalan yang benar sehingga diangkat oleh Allah menjadi nabi dan rasul, dan ada pula dari keturunannya yang terang-terangan berbuat zalim terhadap dirinya sendiri dengan mengingkari nikmat Allah dan berbuat kerusakan sehingga Allah menurunkan kepada mereka azab yang sa-ngat pedih"
  }
]