[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan Kami menurunkan keberkahan kepada mereka berdua. Dan diantara anak keturunan mereka berdua ada yang taat kepada tuhannya berbuat baik untuk dirinya, namun ada juga yang zhalim secara nyata dengan kekafiran dan kemaksiatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Kami menurunkan keberkahan dari Kami kepadanya dan kepada anaknya Isḥāq. Kami melimpahkan kenikmatan kepada mereka, di antaranya memperbanyak anak turunan keduanya, dan dari anak turunan keduanya ada orang yang berbuat baik dengan menaati Rabbnya, ada juga yang menzalimi dirinya dengan kekufuran dan berbuat kemaksiatan, kezaliman yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Dan Kami menurunkan keberkahan kepada Ibrahim dan Ishaq dalam urusan agama dan dunianya; dan Kami jadikan pada keturunan mereka berdua terdapat orang yang beriman kepada Tuhannya dan terdapat pula yang menzalimi dirinya sendiri dengan kekafiran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَبٰرَكْنَا عَلَيْهِ وَعَلَىٰٓ إِسْحٰقَ ۚ (Kami limpahkan keberkatan atasnya dan atas Ishaq) Yakni dengan kenikmatan yang berturut-turut dari Allah kepada mereka berdua. Pendapat lain mengatakan maknanya adalah Kami perbanyak keturunan dari keduanya. وَمِن ذُرِّيَّتِهِمَا مُحْسِنٌ وَظَالِمٌ لِّنَفْسِهِۦ مُبِينٌ (Dan diantara anak cucunya ada yang berbuat baik dan ada (pula) yang Zalim terhadap dirinya sendiri dengan nyata) Allah menjelaskan bahwa menjadi keturunan dari silsilah orang-orang yang mulia dan diberkahi ini tidak dapat memberi manfaat bagi mereka, karena yang dapat bermanfaat bagi mereka adalah amalan mereka sendiri, dan bukan dengan silsilah nenek moyang mereka. Dan orang-orang Yahudi dan Nasrani meskipun berasal dari keturunan nabi Ishaq namun mereka tetap juga terjerumus dalam kesesatan yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Kami memberkati Ibrahim dan Ishaq dengan menambahkan nikmat dan kami jadikan banyak nabi dari keturunannya, seperti Ayub AS dan Syu’aib AS. Di antara anak turun mereka ada yang mukmin dan ada yang kafir, berbuat maksiat, menzalimi diri sendiri, menampakkan kezaliman dan menunjukkan kekufuran. Ini adalah dalil bahwa nasab tidak berpengaruh dalam pemberian petunjuk dan kesesatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami melimpahkan keberkahan kepadanya dan Ishaq. Sebagian keturunan keduanya ada yang berbuat baik dan ada yang menzalimi diri sendiri dengan jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. “Kami limpahkan keberkatan atasnya dan atas Ishaq.” Yakni, Kami turunkan kepada keduanya berkah yang berupa perkembangan dan pertambahan ilmu mereka berdua, amal, dan anak keturunannya. Dari anak keturunan dua nabi inilah Allah menyebarkan tiga umat besar, yaitu UMat Arab yang berasal dari anak keturunan Nabi Ismail, UMat Bani Israil dan Umat Romawi dari anak keturunan Nabi Ishaq. “Dan di antara anak cucu mereka berdua ada yang baik da nada pula yang zhalim terhadap dirinya sendiri dengan nyata.” Maksudnya, di antara mereka ada yang shalih da nada yang jahat, ada yang adil da nada yang zhalim, yang kezhalimannya sangat jelas melalui kekafiran dan kesyirikannya. Ini bisa jadi sebagai bagian dari pencegahan terhadap pandangan keliru, karena tatkala Allah mengatakan, “Kami limpahkan keberkahan atasnya dan atas Ishaq,” maka berarti berkah itu harus tetap ada pada anak keturunannya, dan di antara kesempurnaan berkah itu adalah keberadaan semua anak keturunannya sebagai orang-orang yang berbuat baik. Maka Allah mengabarkan bahwa di antara mereka ada yang baik da nada yang zhalim. Wallohu a’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 113: Allah mengabarkan bahwasanya di antara anak keturunan Ibrahim dan Ishaq ada yang berbuat baik pada dirinya sendiri dengan ketaatan dan ada pula yang berbuat dzalim dengan kufur dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan menjadikan para nabi kebanyakan berasal dari keturunannya. Menurut Syaikh As Sa’diy, berkah di sini adalah dengan bertambah ilmu, amal dan keturunan. Oleh karena itu, Allah menyebarkan dari keduanya 3 bangsa yang besar, yaitu bangsa Arab dari keturunan Ismail, bangsa Bani Israil dan bangsa Romawi dari keturunan Ishaq. Yakni yang mukmin. Yakni yang kafir. Menurut Syaikh As Sa’diy, mungkin saja kalimat, “Dan di antara keturunan keduanya ada yang berbuat baik dan ada (pula) yang terang-terangan berbuat zalim terhadap dirinya sendiri.” untuk menerangkan firman-Nya, “Dan Kami limpahkan keberkahan kepadanya dan kepada Ishaq.” di mana jika diturunkan berkah, maka anak keturunannya menjadi orang-orang yang baik semua, maka dengan lanjutan ayat ini “Dan Kami limpahkan keberkahan kepadanya dan kepada Ishaq.” Allah Subhaanahu wa Ta'aala menrangkan, bahwa tidak semuanya baik, bahkan di antara mereka ada yang berbuat baik dan ada yang berbuat zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 113",
    "description": "112-113. Dan di samping buah tutur dan pujian yang indah bagi nabi ibrahim sepanjang masa, kami beri pula dia kabar gembira melalui malaikat dengan kelahiran putra keduanya, yaitu nabi ishak. Kelak dia juga menjadi seorang nabi yang termasuk golongan orang-orang yang saleh dan berilmu (lihat pula: surah h'd/11: 69'73 dan a'-''riy't/51: 24'30). Dan demikianlah kami limpahkan keberkahan kepadanya dan kepada nabi ishak dengan nikmat kenabian. Dan di antara keturunan keduanya ada yang berbuat baik, menaati perintah Allah, dan menyeru ke jalan yang benar sehingga diangkat oleh Allah menjadi nabi dan rasul, dan ada pula dari keturunannya yang terang-terangan berbuat zalim terhadap dirinya sendiri dengan mengingkari nikmat Allah dan berbuat kerusakan sehingga Allah menurunkan kepada mereka azab yang sa-ngat pedih. 114. Dan kenikmatan serta keberkahan sungguh merupakan janji Allah bagi orang-orang yang berbuat kebajikan. Sebagaimana karunia itu kami berikan kepada nabi ibrahim dan putra-putranya, kami telah melimpahkan pula nikmat yang besar kepada nabi musa dan nabi harun. Kami jadikan keduanya rasul dan kami dukung mereka untuk membebaskan bani israil dari perbudakan fir'aun dan mengembalikan me-reka ke negeri asalnya."
  }
]