[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "114-115 Dan sungguh Kami telah melimpahkan kenabian dan kerasaulan kepada musa dan harun, Kami menyelamatkan mereka berdua dari kaum mereka dari tenggelam dan Kami mengentaskan mereka dari penghambaan dan kehinaan yang menimpa mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Sungguh Kami telah memberi Musa dan saudaranya Harun kenabian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114-118. Sungguh Kami telah memberi Musa dan Harun berbagai bentuk kenikmatan keduniaan dan keagamaan; dan yang paling mulia adalah kenimatan kenabian dan risalah. Dan Kami menyelamatkan mereka berdua dan Bani Israil yang beriman dari tenggelam, kehinaan, dan pembunuhan anak-anak lelaki mereka. Kami menyelamatkan mereka dari Fir’aun dan kaumnya -sungguh mereka telah mendapatkan pertolongan dan kemuliaan atas musuh-musuh mereka-. Dan Kami memberi Musa dan Harun kitab Taurat yang jelas hukum-hukum dan penjelasannya; dan Kami tunjukkan kepada mereka jalan lurus yang dapat mengantarkan kepada Allah, yaitu agama Islam yang Allah jadikan sebagai agama seluruh nabi dan rasul; “Agama di sisi Allah hanyalah Islam.” [Ali Imran: 19]. Agama yang menunjukkan penyerahan diri kepada Allah dalam penyembahan-Nya dan ketaatan kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Sungguh Kami melimpahkan nikmat kenabian kepada Musa dan Harun. Selain itu adalah manfaat keagamaan dan keduniawian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kezaliman yang tampak {Sungguh Kami benar-benar telah melimpahkan nikmat kepada Musa dan Harun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114-122. Allah mengingatkan karuniaNya kepada dua hamba dan kedua rasulNya, yaitu Nabi Musa dan Nabi Harun, keduanya adalah putra Imran. Yaitu karunia berupa kenabian, kerasulan, dan berdakwah kepada Allah, serta keselamatan keduanya dan kaumnya, dari mush mereka, yaitu Firaun beserta kemenanngan mereka atasnya, hingga Allah menenggelamkannya sedangkan mereka melihatnya. Dan juga diturunkannya al-Kitab yang menjelaskan, yaitu Taurat yang di dalamnya terdapat aturan-aturan, nasihat-nasihat, dan penjelasan tentang segala sesuatu, dan bahwa sesungguhnya Allah telah membimbing mereka berdua kepada jalan yang lurus, yaitu dengan menetapkan satu agama untuk mereka yang penuh dengan aturan-aturan (hukum), syariat-syariat yang bijak yang dapat mengantarkan kepada Allah, dan Allah juga membimbing mereka berdua untuk mengamalkannya. “Dan Kami abadikan untuk keduanya di kalangan orang-orang yang datang kemudian, (yaitu) ‘Kesejahteraan dilimpahkan atas Musa dan Harun’.” Maksudnya, Kami telah mengabadikan untuk mereka berdua pujian yang baik dan ucapan selamat di kalangan orang-orang yang datang kemudian, dan lebih-lebih di kalangan orang-orang yang terdahulu. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya keduanya termasuk hamba-hamba Kami yang beriman.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 114: Allah mengabarkan bahwa Dia memberikan nikmat kepada Musa dan Harun dengan nikmat yang besar, dan di antara nikmat yang besar atas kenikmatan yang Allah berikan adalah nikmat kenabian dan kerisalahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepada hamba dan Rasul-Nya, yaitu Musa dan Harun dengan kenabian dan kerasulan, nikmat berdakwah kepada Allah, diselamatkan-Nya keduanya dan kaumnya dari Fir’aun serta dimenangkan-Nya mereka berdua dan kaumnya sehingga Allah Subhaanahu wa Ta'aala menenggelamkan Fir’aun dan para pengikutnya sedangkan mereka menyaksikan. Demikian pula Allah Subhaanahu wa Ta'aala telah menurunkan kepada keduanya kitab yang jelas (Taurat) yang di dalamnya mengandung hukum-hukum dan nasehat serta rincian segala sesuatu, dan bahwa Allah Subhaanahu wa Ta'aala menunjukkan keduanya jalan yang lurus serta menetapkan syariat bagi keduanya dan bagi kaumnya, di mana syariat tersebut adalah syariat yang lurus yang dapat menyampaikan kepada Allah dan kepada surga-Nya serta mengaruniakan keduanya menempuh syariat tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 114",
    "description": "114. Dan kenikmatan serta keberkahan sungguh merupakan janji Allah bagi orang-orang yang berbuat kebajikan. Sebagaimana karunia itu kami berikan kepada nabi ibrahim dan putra-putranya, kami telah melimpahkan pula nikmat yang besar kepada nabi musa dan nabi harun. Kami jadikan keduanya rasul dan kami dukung mereka untuk membebaskan bani israil dari perbudakan fir'aun dan mengembalikan me-reka ke negeri asalnya. 115-120. Selain itu, kami beri mereka enam kenikmatan lain. Kami selamatkan keduanya dan kaumnya dari fir'aun yang menindas, memperbudak, dan membunuh bayi laki-laki mereka agar keturunan me-reka punah. Dan kami tolong mereka dari kejaran fir'aun dan tentaranya sehingga jadilah mereka orang-orang yang menang, selamat, dan kembali ke negeri asal mereka dengan merdeka."
  }
]