[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "114-115 Dan sungguh Kami telah melimpahkan kenabian dan kerasaulan kepada musa dan harun, Kami menyelamatkan mereka berdua dari kaum mereka dari tenggelam dan Kami mengentaskan mereka dari penghambaan dan kehinaan yang menimpa mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Kami menyelamatkan keduanya dan kaum keduanya, Bani Israil, dari perbudakan Fir'aun dan dari penenggelaman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. وَنَجَّيْنٰهُمَا وَقَوْمَهُمَا مِنَ الْكَرْبِ الْعَظِيمِ (Dan Kami selamatkan keduanya dan kaumnya dari bencana yang besar) Yakni dari perbudakan yang dilakukan Fir’aun terhadap mereka. Pendapat lain mengatakan yakni tenggelamnya Fir’aun dan kaumnya yang membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Kami menolong mereka beserta berdua kaumnya dari azab tenggelam dan keunggulan atas Fir’aun yang memperbudah Bani Israil dan itu merupakan Kesedihan yang sangat dahsyat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menyelamatkan keduanya dan kaumnya dari bencana yang besar} kesedihan yang berat, yaitu mereka telah diperbudak oleh Fir’aun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114-122. Allah mengingatkan karuniaNya kepada dua hamba dan kedua rasulNya, yaitu Nabi Musa dan Nabi Harun, keduanya adalah putra Imran. Yaitu karunia berupa kenabian, kerasulan, dan berdakwah kepada Allah, serta keselamatan keduanya dan kaumnya, dari mush mereka, yaitu Firaun beserta kemenanngan mereka atasnya, hingga Allah menenggelamkannya sedangkan mereka melihatnya. Dan juga diturunkannya al-Kitab yang menjelaskan, yaitu Taurat yang di dalamnya terdapat aturan-aturan, nasihat-nasihat, dan penjelasan tentang segala sesuatu, dan bahwa sesungguhnya Allah telah membimbing mereka berdua kepada jalan yang lurus, yaitu dengan menetapkan satu agama untuk mereka yang penuh dengan aturan-aturan (hukum), syariat-syariat yang bijak yang dapat mengantarkan kepada Allah, dan Allah juga membimbing mereka berdua untuk mengamalkannya. “Dan Kami abadikan untuk keduanya di kalangan orang-orang yang datang kemudian, (yaitu) ‘Kesejahteraan dilimpahkan atas Musa dan Harun’.” Maksudnya, Kami telah mengabadikan untuk mereka berdua pujian yang baik dan ucapan selamat di kalangan orang-orang yang datang kemudian, dan lebih-lebih di kalangan orang-orang yang terdahulu. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya keduanya termasuk hamba-hamba Kami yang beriman.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 115: Dan di antara nikmat yang di dapatkan Musa dan Harun adalah diselamatkannya keduanya beserta kaumnya dari tenggelam (di laut merah), Allah jadikan Fir’aun jauh dari mereka, dan juga dari dibunuhnya anak-anak mereka yang laki-laki serta anak-anak perempuan yang hidup untuk berkhidmat di rumah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Bani Israil. Yakni dari perbudakan kepada Fir’aun atau dari penenggelaman Fir’aun dan pengikutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 115",
    "description": "115-120. Selain itu, kami beri mereka enam kenikmatan lain. Kami selamatkan keduanya dan kaumnya dari fir'aun yang menindas, memperbudak, dan membunuh bayi laki-laki mereka agar keturunan me-reka punah. Dan kami tolong mereka dari kejaran fir'aun dan tentaranya sehingga jadilah mereka orang-orang yang menang, selamat, dan kembali ke negeri asal mereka dengan merdeka"
  }
]