[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "117-119 dan Kami memberikan mereka berdua taurat yang jelas membimbing keduanya ke jalan yang lurus yang tidak bengkok yaitu islam, agama Allah yang dengannya dia mengutus nabi-nabinya, dan Kami mengabadikan sanjungan yang bagus dan nama mulia untuk mereka berdua pada orang-orang yang datang setelah mereka berdua’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Dan Kami memberi Musa dan saudaranya Harun Taurat sebuah kitab dari sisi Allah, yang jelas tidak ada kesamaran padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. وَءَاتَيْنٰهُمَا الْكِتٰبَ الْمُسْتَبِينَ (Dan Kami berikan kepada keduanya kitab yang sangat jelas) Yang dimaksud dengan (الكتاب) adalah kitab Taurat. Dan (المستبين) yakni yang jelas dan nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Dan Kami memberi mereka kitab yang jelas dan nyata yaitu Taurat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menganugerahkan kepada keduanya kitab yang sangat jelas} kitab yang jelas dalam penyampaiannya, yaitu Taurat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114-122. Allah mengingatkan karuniaNya kepada dua hamba dan kedua rasulNya, yaitu Nabi Musa dan Nabi Harun, keduanya adalah putra Imran. Yaitu karunia berupa kenabian, kerasulan, dan berdakwah kepada Allah, serta keselamatan keduanya dan kaumnya, dari mush mereka, yaitu Firaun beserta kemenanngan mereka atasnya, hingga Allah menenggelamkannya sedangkan mereka melihatnya. Dan juga diturunkannya al-Kitab yang menjelaskan, yaitu Taurat yang di dalamnya terdapat aturan-aturan, nasihat-nasihat, dan penjelasan tentang segala sesuatu, dan bahwa sesungguhnya Allah telah membimbing mereka berdua kepada jalan yang lurus, yaitu dengan menetapkan satu agama untuk mereka yang penuh dengan aturan-aturan (hukum), syariat-syariat yang bijak yang dapat mengantarkan kepada Allah, dan Allah juga membimbing mereka berdua untuk mengamalkannya. “Dan Kami abadikan untuk keduanya di kalangan orang-orang yang datang kemudian, (yaitu) ‘Kesejahteraan dilimpahkan atas Musa dan Harun’.” Maksudnya, Kami telah mengabadikan untuk mereka berdua pujian yang baik dan ucapan selamat di kalangan orang-orang yang datang kemudian, dan lebih-lebih di kalangan orang-orang yang terdahulu. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya keduanya termasuk hamba-hamba Kami yang beriman.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 117: Allah mengabarkan pula, dari sebagian nikmat yang telah Allah berikan kepada Musa dan Harun adalah diturunkannya kepada keduanya kitab sebagai penjelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sangat jelas batasan dan hukum-hukumnya, yaitu kitab Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 117",
    "description": "115-120. Selain itu, kami beri mereka enam kenikmatan lain. Kami selamatkan keduanya dan kaumnya dari fir'aun yang menindas, memperbudak, dan membunuh bayi laki-laki mereka agar keturunan me-reka punah. Dan kami tolong mereka dari kejaran fir'aun dan tentaranya sehingga jadilah mereka orang-orang yang menang, selamat, dan kembali ke negeri asal mereka dengan merdeka"
  }
]