[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan kamu (wahai rasul) merasa heran dengan pengingkaran mereka terhadap kebangkitan, dan yang lebih mengherankan dari pengingkaran mereka tersebut adalah bahwa mereka memperolok-olokmu dan menghina ucapanmu,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sungguh kamu -wahai Rasul- kagum kepada kodrat Allah dan pengaturan-Nya terhadap urusan-urusan makhluk-Nya. Kamu juga heran dengan pendustaan kaum musyrikin terhadap Kebangkitan. Begitu kuatnya pendustaan kaum musyrikin tentang Kebangkitan, maka mereka selalu melecehkan apa yang kamu katakan tentangnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Hai Rasulullah, kamu terheran oleh keingkaran dan pendustaan mereka terhadap hari kebangkitan, karena itu sungguh mengherankan. Dan yang lebih buruk dari keingkaran mereka adalah mereka juga menghinamu dan menghina dakwahmu. Mereka tidak hanya ingkar tapi juga melakukan penghinaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. بَلْ عَجِبْتَ (Bahkan kamu menjadi heran) hai Muhammad, Bahkan kamu heran dari kekuasaan Allah. وَيَسْخَرُونَ(dan mereka menghinakan kamu) Akibat keherananmu. Atau mereka menghinamu karena mempercayai hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Wahai Nabi bahkan kamu heran dengan pendustaan mereka terhadapmu dan pengingkaran mereka terhadap hari kebangkitan dan kekuasaan Allah SWT. Mereka mengolok-olok ajakanmu. (Bal) adalah untuk berpindah dari satu tujuan pembicaraan ke pembacaraan lain. Maknanya adalah Jangan meminta kepada mereka wahai Nabi karena sesungguhnya mereka itu para penentang. Lihatlah saja perbedaan antara kamu dan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bahkan kamu heran dan mereka selalu menghinamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Bahkan kamu menjadi heran” wahai rasul, atau wahai manusia, kepada pendustaan orang yang mendustakan kebangkitan, setelah kamu memperlihatkan kepada mereka ayat-ayat (tanda-tanda, bukti) yang luar biasa dan dalil-dalil yang lurus itu. Ini benar-benar sangat aneh dan mengherankan, sebab ia sudah termasuk hal yang tidak diingkari lagi, “dan” lebih mengherankan dari keingkaran mereka dan lebih kentara lagi, adalah bahwa mereka “menghinakan” orang yang datang dengan membawa berita tentang kebangkitan. Tidak cukup bagi mereka hanya sekedar mengingkari, hingga mereka tambah dengan memperolok-olokkan perkataan yang haq."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 12: 12-17. Bahkan engkau juga merasa aneh wahai Nabi atas pengingkaran mereka kaummu akan kebangkitan, keanehan dari mereka yang mengolok-olokmu atas apa yang telah engkau kabarkan kepada mereka dari hari kebangkitan dan pembalasan. Maka jika engkau telah mengkabarkan kepada mereka, mereka tidak mengambil manfaat. Maka jika mereka melihat bukti-bukti kemukjizatanmu, mereka mengolok-olokmu dan sombong. Kemudian mereka berkata dengan sombong : Tidaklah yang telah datangkan darimu wahai Muhammad kecuali hanyalah sihir yang nyata. Kemudian mereka berkata mengomentari atas hari kebangkitan dan pembalasan dengan berkata : Apakah jika kami telah mati dan menjadi jasad, kemudia tinggallah tulang-belulang yang berantakan, maka apakah kami akan dibangkitan untuk kali yang lain ??, dan juga apakah bapak-bapak kami juga akan dibangkitkan yang mereka semua telah mati sebelum kami ??"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bahwa engkau wahai Rasul dan manusia yang berpikir cerdas pasti akan heran terhadap pendustaan orang-orang kafir terhadap kebangkitan padahal telah jelas bukti dan dalilnya baik secara naqli maupun ‘aqli (akal) yang seharusnya tidak menerima lagi adanya pengingkaran. Lebih mengherankan lagi ketika mereka menghinakan orang yang memberitakan tentang kebangkitan. Mereka tidak cukup sampai mengingkari bahkan ditambah dengan menghinakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 12",
    "description": "Wahai nabi Muhammad, bahkan engkau menjadi heran atas keingkaran mereka terhadap risalahmu, hari kebangkitan, dan kekuasaan Allah, dan mereka menghinakan engkau karena keherananmu itu dan mereka pun menyepelekan hari kebangkitan. 13. Dan apabila mereka diberi peringatan sebagaimana yang dijelaskan dalam Al-Qur'an, mereka tidak mengindahkannya, bahkan berpaling darinya."
  }
]