[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "120-122 sebagai penghormatan pada musa dan harun dari sisi Allah, pujian dan doa kebaikan untuk mereka berdua agar selamat dari segala aib, sebagaimana Kami membalas mereka dengan kebaiakan, Kami juga membalas orang-orang yang berbuat baik dari hamba-hamba Kami yang mengikhlaskan diri bagi Kami dengan membenarkan, beriman, dan beramal. sesungguhnya musa dan harun termasuk hamba-hamba Kami yang mendalam imannya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Sebagaimana Kami membalas Musa dan Harun dengan balasan yang baik ini, Kami juga membalas orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121-122. Seperti halnya balasan yang baik itu, Kami juga akan membalas orang-orang yang baik dan taat kepada Allah SWT. Sesungguhnya mereka berdua (Musa dan Harun) termasuk hamba-hamba Kami yang beriman dan ikhlas)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114-122. Allah mengingatkan karuniaNya kepada dua hamba dan kedua rasulNya, yaitu Nabi Musa dan Nabi Harun, keduanya adalah putra Imran. Yaitu karunia berupa kenabian, kerasulan, dan berdakwah kepada Allah, serta keselamatan keduanya dan kaumnya, dari mush mereka, yaitu Firaun beserta kemenanngan mereka atasnya, hingga Allah menenggelamkannya sedangkan mereka melihatnya. Dan juga diturunkannya al-Kitab yang menjelaskan, yaitu Taurat yang di dalamnya terdapat aturan-aturan, nasihat-nasihat, dan penjelasan tentang segala sesuatu, dan bahwa sesungguhnya Allah telah membimbing mereka berdua kepada jalan yang lurus, yaitu dengan menetapkan satu agama untuk mereka yang penuh dengan aturan-aturan (hukum), syariat-syariat yang bijak yang dapat mengantarkan kepada Allah, dan Allah juga membimbing mereka berdua untuk mengamalkannya. “Dan Kami abadikan untuk keduanya di kalangan orang-orang yang datang kemudian, (yaitu) ‘Kesejahteraan dilimpahkan atas Musa dan Harun’.” Maksudnya, Kami telah mengabadikan untuk mereka berdua pujian yang baik dan ucapan selamat di kalangan orang-orang yang datang kemudian, dan lebih-lebih di kalangan orang-orang yang terdahulu. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya keduanya termasuk hamba-hamba Kami yang beriman.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 121: Allah mengabarkan dengan balasan yang semisal dengan Musa dan Harun ini, Kami juga akan berikan balasan yang serupa bagi siapa yang baik dalam keimanan dan ketakwaan. Ini adalah kabar gembira bagi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 121",
    "description": "121-122. Demikianlah kami memberi balasan kepada orang-orang yang berbuat baik, rela berkorban, dan sabar dalam memperjuangkan ajaran tauhid. Karena keteguhan dan kesabaran mereka, sungguh keduanya termasuk hamba-hamba kami yang beriman dengan tulus"
  }
]