[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "123-126 dan sesungguhnya hamba Kami ilyas termasuk orang-orang yang Kami muliakan dengan kenabian dan kerasulan, tatkala dia berkata kepada kaumnya bani israil ”bertakwalah kalian kepada Allah semata dan takutlah kepadaNya jangan menyekutukan selainNya denganNya. bagaimana kalian menyembah berhala yang lemah lagi makhluk dan kalian meninggalkan sebaik-baik pencipta yang disifati dengan sifat-sifat terbaik dan paling sempurna, lalu kalian tidak menyembahNya? Allah adalah tuhan kalian yang menciptakan kalian dan menciptakan nenek moyang kalian yang telah berlalu sebelum kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Ketika dia berkata kepada kaumnya yang dia diutus kepada mereka, Bani Israil, “Wahai kaumku! Mengapa kalian tidak bertakwa kepada Allah dengan melaksanakan perintah-perintah-Nya yang di antaranya adalah Tauhid dan meninggalkan larangan-larangan-Nya yang salah satunya adalah syirik?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. إِذْ قَالَ لِقَوْمِهِۦٓ أَلَا تَتَّقُونَ ((ingatlah) ketika ia berkata kepada kaumnya: “Mengapa kamu tidak bertakwa?) Yakni apakah kalian telah bertakwa kepada Allah dan menyembah-Nya, serta meninggalkan kemusyrikan dan kemaksiatan yang dilarang Allah bagi kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124. Saat berkata kepada kaumnya: “Kenapa kalian tidak bertakwa kepada Allah, menyembah hanya kepadaNya serta meninggalkan kesyirikan dan kemaksiatan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia berkata kepada kaumnya,“Mengapa kalian tidak bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123-132. Allah memuji hamba dan RasulNya, Nabi Ilyas, dengan kenabian, kerasulan, dan dakwah kepada Allah, dan Allah memerintahkan kepadanya dan kaumnya supaya bertakwa dan hanya beribadah (menyembah) kepada Allah saja, dan melarang mereka menyembah berhala yang mereka miliki yang disebut Ba’l, dan juga melarang mereka mengabaikan ibadah kepada Allah yang telah menciptakan manusia dan telah menyempurnakan penciptaan mereka, menumbuhkan mereka dengan sebaik-baik pertumbuhan, serta mencurahkan kepada mereka berbagai nikmat lahir maupun batin. Bagaimana kalian bisa meninggalkan ibadah kepada TUhan yang seperti itu kedudukanNya, lalu beralih kepada penyembahan kepada berhala yang sama sekali tidak dapat membahayakan, tidak pula berguna, tidak menciptakan, tidak memberi rizki, bahkan tidak dapat ataupun berbicara. Tindakan ini merupakan kesesatan, kedunguan, dan kebodohan yang paling besar! “Maka mereka mendustakannya,” mengenai apa yang beliau serukan kepada mereka, mereka tidak mau tunduk kepadanya. Maka Allah berfirman mengancam mereka, “karena itu mereka akan diseret,” yaitu, pada Hari Kiamat ke dalam azab. Allah tidak menyebutkan siksaan duniawi mereka. “Kecuali hamba-hamba Allah yang diberi keikhlasan,” yaitu orang-orang yang diberi keikhlasan oleh Allah dan diberi karunia mengikuti Nabi mereka, maka mereka tidak akan diseret ke dalam azab, melainkan mereka akan memperoleh pahala yang berlipat ganda dari Allah. “Dan Kami abadikan untuknya,” maksudnya, untuk Ilyas, “di kalangan orang-orang yang datang kemudian,” yaitu berupa pujian yang baik, “Kesejahteraan dilimpahkan atas ILyas,” sebagai salam hormat dari Allah dan dari hamba-hambaNya kepadanya. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya dia termasuk hamba-hamba Kami yang beriman.” Allah memujinya sebagaimana Dia telah memuji saudara-saudaranya, para nabi yang lain. Semoga shalawat dan salam Allah curahkan kepada mereka semua."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 124: Allah mengabarkan bahwasanya Ilyas berkata kepada kaumnya: Mengapa kalian tidak takut dan bertakwa kepada Allah dan janganlah kalian menyekutukan Allah. Dan Ilyas bin Yasin adalah anak keturunan dari Harun saudara Musa, dan Allah telah mengutusnya kepada negeri Ba’labak, yaitu suatu negeri yang terkenal di Syam dengan nama ini sampai sekarang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 124",
    "description": "124-126. Ingatlah ketika dia berkata kepada kaumnya, 'mengapa kamu tidak bertakwa, mengesakan, dan menaati perintah Allah' dialah tuhan yang telah menciptakan kamu. Patutkah kamu menyembah ba'l, seonggok benda mati yang tidak bisa memberi manfaat dan menolak malapetaka, dan kamu tinggalkan sebaik-baik pencipta yang ciptaannya tidak bisa ditandingi oleh siapa pun' pencipta itu adalah Allah, tuhanmu dan tuhan nenek moyangmu yang terdahulu, yaitu nabi ibrahim, ismail, ishak, yakub, yusuf, musa, harun, dan lainnya. '124-126"
  }
]