[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "129-132 kemudian Kami menjadikan bagi Ilyas sebuah sanjungan yang baik pada umat-umat setelahnya, sebagao penghormatan dari Allah, dan sanjungan bagi Ilyas. Dan sebagaimana kami membalas Ilyas dengan balasan yang baik atas ketaatannya, Kami pun akan mebalas orang-orang yang berbuat baik diantara hamba-hamba Kami yang beriman. Sesungguhnya dia termasuk dianta hamba-hamba Kami yang beriman dan mengikhlaskan bagiNya dengan mengamalkan perintah-perintahNya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Sebagaimana Kami membalas Ilyas dengan balasan yang baik ini, Kami juga membalas orang-orang yang berbuat baik dari orang-orang yang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131-132. Seperti halnya balasan baik itu, Kami juga akan membalas setiap orang yang memperbaiki amalnya kepada Allah SWT, karena sesungguhnya termasuk hamba-hamba Kami yang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123-132. Allah memuji hamba dan RasulNya, Nabi Ilyas, dengan kenabian, kerasulan, dan dakwah kepada Allah, dan Allah memerintahkan kepadanya dan kaumnya supaya bertakwa dan hanya beribadah (menyembah) kepada Allah saja, dan melarang mereka menyembah berhala yang mereka miliki yang disebut Ba’l, dan juga melarang mereka mengabaikan ibadah kepada Allah yang telah menciptakan manusia dan telah menyempurnakan penciptaan mereka, menumbuhkan mereka dengan sebaik-baik pertumbuhan, serta mencurahkan kepada mereka berbagai nikmat lahir maupun batin. Bagaimana kalian bisa meninggalkan ibadah kepada TUhan yang seperti itu kedudukanNya, lalu beralih kepada penyembahan kepada berhala yang sama sekali tidak dapat membahayakan, tidak pula berguna, tidak menciptakan, tidak memberi rizki, bahkan tidak dapat ataupun berbicara. Tindakan ini merupakan kesesatan, kedunguan, dan kebodohan yang paling besar! “Maka mereka mendustakannya,” mengenai apa yang beliau serukan kepada mereka, mereka tidak mau tunduk kepadanya. Maka Allah berfirman mengancam mereka, “karena itu mereka akan diseret,” yaitu, pada Hari Kiamat ke dalam azab. Allah tidak menyebutkan siksaan duniawi mereka. “Kecuali hamba-hamba Allah yang diberi keikhlasan,” yaitu orang-orang yang diberi keikhlasan oleh Allah dan diberi karunia mengikuti Nabi mereka, maka mereka tidak akan diseret ke dalam azab, melainkan mereka akan memperoleh pahala yang berlipat ganda dari Allah. “Dan Kami abadikan untuknya,” maksudnya, untuk Ilyas, “di kalangan orang-orang yang datang kemudian,” yaitu berupa pujian yang baik, “Kesejahteraan dilimpahkan atas ILyas,” sebagai salam hormat dari Allah dan dari hamba-hambaNya kepadanya. “SEsungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik. Sesungguhnya dia termasuk hamba-hamba Kami yang beriman.” Allah memujinya sebagaimana Dia telah memuji saudara-saudaranya, para nabi yang lain. Semoga shalawat dan salam Allah curahkan kepada mereka semua."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 131: 129-132. Allah mengabarkan dengan balasan yang semisal dengan Ilyas ini, Kami juga akan berikan balasan yang serupa bagi siapa yang baik dalam keimanan dan ketakwaan. Ini adalah kabar gembira bagi orang-orang yang beriman. Allah juga mengabarkan bahwa Ilyas adalah seorang hamba yang memiliki keimanan yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 131",
    "description": "129-132. Dan karena kesabaran serta ketabahannya dalam menyampaikan agama tauhid, kami abadikan untuk nabi ilyas suatu pujian yang mulia di kalangan orang-orang yang datang kemudian. Dan kami ucapkan pula kepadanya, 'selamat sejahtera bagi ilyas, ' yakni namanya selalu disebut di kalangan semua makhluk. Demikianlah kami memberi balasan kepada orang-orang yang berbuat baik, taat dan sabar dalam memperjuangkan penegakan agama tauhid. Sungguh, dia benar-benar termasuk hamba-hamba kami yang beriman, yang jujur dalam keimanannya, dan ikhlas dalam melaksanakan perintah Allah"
  }
]