[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "133-135 dan sesungguhnya Kami telah memilih hamba Kami luth, lalu Kami menjadikannya para rasul, saat Kami menyelamatkannya dan keluarganya dari azab. kecuali seorang wanita tua, yaitu istrinya dia binasa bersama kaumnya yang binasa karena kekafirannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Ingatlah ketika Kami menyelamatkannya dan semua keluarganya dari azab yang diturunkan atas kaumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "134. Saat Kami menyelamatkannya dan semua keluarganya yang mengimani risalahnya dari kehancuran dan kebinasaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Kami telah menyelamatkan dia dan pengikutnya semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133-138. Ini adalah pujian dari Allah kepada hamba dan RasulNya, Nabi LUth, yaitu pujian dengan kenabian, kerasulan, menyeru kaumnya kepada Allah dan melarang mereka melakukan syirik dan mengerjakan perbuatan keji. Oleh karena mereka tidak berhenti, maka Allah hanya menyelamatkan Nabi Luth dan keluarganya semuanya. Mereka berangkat di malam hari hingga mereka selamat, “kecuali seorang perempuan tua bersama-sama orang yang tinggal,” yang diam lagi disiksa. Dia adalah adalah istri Nabi Luth yang tidak mau menganut agama suaminya. “Kemudian Kami binasakan orang-orang yang lain,” yaitu Kami balik negeri mereka sehingga bagian atas menjadi bagian bawahnya dan Kami hujani mereka dengan bebatuan sijjil yang sangat lebat hingga mereka binasa dan musnah. “Dan sesungguhnya kamu benar-benar akan melalui mereka,” maksudnya, melalui perkampungan kaum Nabi Luth, “di waktu pagi dan di waktu malam.” Maksudnya, pada waktu-waktu tersebut di mana kalian sering pulang pergi melintasi dan melaluinya, sehingga tidak bisa diragukan lagi. “Maka apakah kamu tidak memikirkan,” ayat-ayat dan berbagai pelajaran, dan kalian tidak menjauhi perbuatan-perbuatan yang dapat menimbulkan kebinasaan?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 134: 134-136. Ingatlah wahai Nabi Allah pada hari ketika Allah menyelamatkan Luth dan keluarganya dari adzab, kecuali istrinya yang sudah tua yang juga celaka bersama orang-orang yang celaka, karena sebab pengingkarannya yang kemudian Allah membinasakannya dengan adzab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 134",
    "description": "133-136. Bila nabi-nabi yang disebutkan sebelumnya berasal dari garis keturunan nabi ibrahim, nabi berikut ini merupakan anak paman nabi ibrahim yang berjuang bersamanya dalam menyampaikan risa-lah Allah. Dialah nabi lut. Dan sungguh, nabi lut benar-benar termasuk salah seorang yang Allah pilih menjadi rasul untuk berdakwah kepada penduduk sodom. Ingatlah ketika kami telah menyelamatkan dia, keluarganya yang beriman, dan pengikutnya semua dari azab Allah, kecuali seorang perempuan tua, yaitu istrinya. Kami sisakan perempuan tua yang kafir itu bersama-sama orang yang tinggal di kota tersebut. Kemudian, kami binasakan orang-orang yang lain yang tetap tinggal di kota itu akibat penolakan mereka terhadap ajakan nabi lut untuk menempuh jalan yang benar"
  }
]