[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Kami membinasakan orang-orang yang tersisa yang mendustakan dari kaumnya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Kemudian Kami membinasakan yang tersisa dari kaumnya yang mendustakannya dan tidak membenarkan apa yang dia bawa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Kamudian Kami membinasakan sisa dari kaum Luth, yaitu orang-orang yang kafir dan mendustakan, dengan kebinasaan yang keras dan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. ثُمَّ دَمَّرْنَا الْاٰخَرِينَ (Kemudian Kami binasakan orang-orang yang lain) Yakni Kami binasakan sisa orang dari kaumnya, yaitu orang-orang yang tidak beriman kepada Luth."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "135-136. Kecuali perempuan tua, yaitu istri Luth yang masih bersama orang-orang yang tersisa menerima azab. Lalu Kami menghancurkan orang-orang kafir dari kaum lain dengan azab yang sangat dahsyat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami membinasakan} Kami membinasakan {yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133-138. Ini adalah pujian dari Allah kepada hamba dan RasulNya, Nabi LUth, yaitu pujian dengan kenabian, kerasulan, menyeru kaumnya kepada Allah dan melarang mereka melakukan syirik dan mengerjakan perbuatan keji. Oleh karena mereka tidak berhenti, maka Allah hanya menyelamatkan Nabi Luth dan keluarganya semuanya. Mereka berangkat di malam hari hingga mereka selamat, “kecuali seorang perempuan tua bersama-sama orang yang tinggal,” yang diam lagi disiksa. Dia adalah adalah istri Nabi Luth yang tidak mau menganut agama suaminya. “Kemudian Kami binasakan orang-orang yang lain,” yaitu Kami balik negeri mereka sehingga bagian atas menjadi bagian bawahnya dan Kami hujani mereka dengan bebatuan sijjil yang sangat lebat hingga mereka binasa dan musnah. “Dan sesungguhnya kamu benar-benar akan melalui mereka,” maksudnya, melalui perkampungan kaum Nabi Luth, “di waktu pagi dan di waktu malam.” Maksudnya, pada waktu-waktu tersebut di mana kalian sering pulang pergi melintasi dan melaluinya, sehingga tidak bisa diragukan lagi. “Maka apakah kamu tidak memikirkan,” ayat-ayat dan berbagai pelajaran, dan kalian tidak menjauhi perbuatan-perbuatan yang dapat menimbulkan kebinasaan?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 136: 134-136. Ingatlah wahai Nabi Allah pada hari ketika Allah menyelamatkan Luth dan keluarganya dari adzab, kecuali istrinya yang sudah tua yang juga celaka bersama orang-orang yang celaka, karena sebab pengingkarannya yang kemudian Allah membinasakannya dengan adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang tinggal di kota Sodom yang tidak ikut bersama Luth ‘alaihis salam. Allah balikkan negeri mereka dan melempari mereka dengan batu secara bertubi-tubi dari tanah yang keras sehingga mereka semua mati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 136",
    "description": "133-136. Bila nabi-nabi yang disebutkan sebelumnya berasal dari garis keturunan nabi ibrahim, nabi berikut ini merupakan anak paman nabi ibrahim yang berjuang bersamanya dalam menyampaikan risa-lah Allah. Dialah nabi lut. Dan sungguh, nabi lut benar-benar termasuk salah seorang yang Allah pilih menjadi rasul untuk berdakwah kepada penduduk sodom. Ingatlah ketika kami telah menyelamatkan dia, keluarganya yang beriman, dan pengikutnya semua dari azab Allah, kecuali seorang perempuan tua, yaitu istrinya. Kami sisakan perempuan tua yang kafir itu bersama-sama orang yang tinggal di kota tersebut. Kemudian, kami binasakan orang-orang yang lain yang tetap tinggal di kota itu akibat penolakan mereka terhadap ajakan nabi lut untuk menempuh jalan yang benar. 137-138. Dan sesungguhnya kamu, wahai penduduk mekah, benar-benar akan melalui sisa-sisa reruntuhan rumah-rumah mereka dalam perjalan-an dagangmu ke syam pada waktu pagi dan pada waktu malam. Maka, mengapa kamu tidak mengerti dan memikirkan azab yang telah mereka terima akibat kekafiran mereka' Allah memberimu kesempatan menyaksikan peninggalan kaum yang durhaka itu agar kamu beriman dan takut akan azab-Nya."
  }
]