[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "137-138 Sesungguhnya kalian orang makkah benar-benar melewati kampung-kampung kaum luth dan sisa-sisanya dalam perjalanan safar kalian di waktu pagi dan kalian juga melewatinya di waktu malam, maka mengapa kalian tidak merenungkannya, sehingga kalian merasa takut ditimpa seperti apa yang telah menipa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "137. Kalian -wahai penduduk Makkah- pasti akan melewati negeri mereka dalam perjalanan kalian ke Syam di waktu pagi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "137-138. Hai para penduduk Makkah, sungguh kalian telah melewati tempat tinggal mereka saat kalian bepergian, sehingga kalian dapat menyaksikan bekas-bekas kebinasaan dan azab mereka, baik itu pada siang, malam, pagi, maupun sore hari. Tidakkah kalian memikirkannya dan mengambil ibrah darinya? Dan tidakkah kalian takut tertimpa azab yang menimpa mereka sehingga kalian binasa seperti kebinasaan mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "137. وَإِنَّكُمْ لَتَمُرُّونَ عَلَيْهِم مُّصْبِحِينَ (Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi) Kalimat ini ditujukan bagi penduduk Makkah. Yakni kalian melewati di pagi dan malam hari rumah-rumah mereka yang di sana terdapat bekas-bekas azab ketika kalian pergi ke negeri Syam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "137. Wahai orang-orang musyrik Mekah, sesungguhnya kalian sungguh akan melewati tempat-tempat dan jejak-jejak mereka dalam perjalanan dan perdagangan kalian menuju Syam di waktu pagi dan siang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kalian benar-benar akan melintasi (bekas-bekas) mereka} jejak dan tempat tinggal mereka {pada waktu pagi} waktu pagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133-138. Ini adalah pujian dari Allah kepada hamba dan RasulNya, Nabi LUth, yaitu pujian dengan kenabian, kerasulan, menyeru kaumnya kepada Allah dan melarang mereka melakukan syirik dan mengerjakan perbuatan keji. Oleh karena mereka tidak berhenti, maka Allah hanya menyelamatkan Nabi Luth dan keluarganya semuanya. Mereka berangkat di malam hari hingga mereka selamat, “kecuali seorang perempuan tua bersama-sama orang yang tinggal,” yang diam lagi disiksa. Dia adalah adalah istri Nabi Luth yang tidak mau menganut agama suaminya. “Kemudian Kami binasakan orang-orang yang lain,” yaitu Kami balik negeri mereka sehingga bagian atas menjadi bagian bawahnya dan Kami hujani mereka dengan bebatuan sijjil yang sangat lebat hingga mereka binasa dan musnah. “Dan sesungguhnya kamu benar-benar akan melalui mereka,” maksudnya, melalui perkampungan kaum Nabi Luth, “di waktu pagi dan di waktu malam.” Maksudnya, pada waktu-waktu tersebut di mana kalian sering pulang pergi melintasi dan melaluinya, sehingga tidak bisa diragukan lagi. “Maka apakah kamu tidak memikirkan,” ayat-ayat dan berbagai pelajaran, dan kalian tidak menjauhi perbuatan-perbuatan yang dapat menimbulkan kebinasaan?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 137: 137-138. Allah menegur penduduk Mekkah dan selain dari mereka agar mereka safar ke daerah Luth di waktu pagi dan sore, dan agar supaya melihat bagaimana Allah menjadikan terbalik (posisi atas mereka menjadi dibawah), dan Allah hujani mereka dengan batu-batuan sebagai adzab bagi mereka. Maka apakah kalian wahai manusia tidak mengambil pelajaran atas keadaan umat ini, dan keadaaan mereka yang celaka dan teradzab; Maka takutlah kalian akan hal itu menimpa diri kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dalam safar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 137",
    "description": "137-138. Dan sesungguhnya kamu, wahai penduduk mekah, benar-benar akan melalui sisa-sisa reruntuhan rumah-rumah mereka dalam perjalan-an dagangmu ke syam pada waktu pagi dan pada waktu malam. Maka, mengapa kamu tidak mengerti dan memikirkan azab yang telah mereka terima akibat kekafiran mereka' Allah memberimu kesempatan menyaksikan peninggalan kaum yang durhaka itu agar kamu beriman dan takut akan azab-Nya"
  }
]