[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "139-140 Sesungguhya Kami memilih hamba Kami yunus dan menjadikannya termasuk para rasul, saat dia berlari meninggalkan kaumnya dalam keadaan marah kepada kaumnya lalu dia ikut ke sebuah kapal yang sarat dengan penumpang dan barang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Sesungguhnya hamba Kami Yunus termasuk rasul Allah yang diutus kepada kaum mereka untuk menyampaikan kabar gembira dan memberi peringatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139-140. Sungguh Yunus merupakan salah satu hamba yang Kami muliakan dengan kenabian dan kerasulan untuk memberi hidayah kepada kaumnya. Maka ingatlah kisahnya, ketika dia pergi meninggalkan negerinya karena kemarahannya terhadap kaumnya yang mendustakan. Kemudian dia menaiki perahu yang penuh dengan menumpang dan barang-barang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139. Sesungguhnya Yunus bin Matta termasuk nabi-nabi Bani Israil. Dia adalah Dzun Nun yang termasuk golongan para nabi yang diutus kepada kaumnya penduduk Ninawa. Dia mengajak mereka untuk mengesakan Allah dan meninggalkan penyembahan berhala."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Yunus benar-benar termasuk para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139. Ini adalah satu pujian dari Allah terhadap hamba dan RasulNya, Yunus bin Matta, sebagaimana Dia telah memuji saudara-saudaranya, para nabi yang lain semuanya dengan kenabian, kerasulan, dan berdakwah kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 139: 139-142. Allah mengabarkan bahwa Dia memilih Yunus dan menjadikan utusan-Nya. Ia adalah Yunus bin Matta yang Allah utus kepada penduduk Nainawa, yang ia adalah desa di pinggiran (Dijalah) sungai Tigris di Irak. Yunus menyeru kaumnya untuk beriman kepada Allah dan mereka mendustakan dan mengolok-olok Yunus. Maka keyika yunus putus asa akan keimanan mereka, dan meyakini bahwa adzab cocok untuk mereka, Yunus meninggalkan mereka dan melarikan diri dan tidak menunggu perintah Allah; Ketika Yunus sampai di lautan, ia mendapati kapal, ia menaikinya yang kemudian kapal tersebut terhempas ombak yang kemudian Yunus terhempas ke lautan dan ditelah ikan paus besar, sebagai hukuman dari Allah karena sebab meninggalkan kaumnya dan pergi dengan tanpa izin dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah pujian Allah Subhaanahu wa Ta'aala kepada hamba dan Rasul-Nya yunus bin Mata ‘alaihis salam sebagaimana Dia memuji saudara-saudaranya dari kalangan para rasul dengan kenabian dan kerasulan serta berdakwah kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 139",
    "description": "139. Usai menceritakan perjuangan dakwah nabi lut yang bukan berasal dari bani israil, Allah kembali menuturkan dakwah nabi dari bani israil, nabi yunus. Dan sungguh, yunus benar-benar termasuk salah seorang rasul yang Allah utus untuk menyampaikan risalah kepada penduduk ninawa (sekarang wilayah irak) agar menyembah Allah dan meninggalkan berhala sesembahan mereka. 140-144. Ingatlah ketika dia lari dan pergi meninggalkan kaumnya padahal Allah tidak memperkenankan kepergiannya, lalu dia naik ke kapal yang penuh dengan muatan hingga hampir tenggelam. Melihat kondisi ini kemudian para penumpang melakukan pengundian, di mana dia ikut diundi untuk menentukan penumpang yang kalah dan harus diceburkan ke laut. Ternyata dia termasuk orang-orang yang kalah dalam undian itu. Maka dia pun diceburkan hingga dia ditelan oleh ikan besar dalam keadaan tercela karena meninggalkan kaumnya tanpa izin Allah."
  }
]