[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kapal itu kemudian dikepung oleh ombak-ombak yang besar maka para penumpangnya melakukan undian untuk meringankan beban kapal karena takut tengelam, maka yunus termasuk pada orang-orang yang kalah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Bahtera hampir tenggelam karena kepenuhan, maka para penumpang mengadakan undian untuk membuang sebagian penumpangnya, karena dikhawatirkan bahtera akan karam disebabkan penumpangnya yang melebihi kapasitas, ternyata Yunus termasuk orang-orang yang keluar namanya dalam undian, sehingga merekapun membuangnya ke laut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141-142. Ketika datang angin besar dan ombak menerpa perahu itu hingga hampir tenggelam, maka para penumpangnya melakukan undian untuk melempar sebagian dari mereka ke laut, agar mereka yang di atas perahu dapat selamat karena beban perahu telah berkurang. Dan saat itu, Yunus termasuk orang-orang yang harus dilempar ke laut. Ketika dia dilempar, dia ditelan oleh ikan paus besar. Ikan itu datang untuk memberinya pelajaran karena keluar dari negerinya tanpa seizin Tuhannya dan karena kemarahannya terhadap kaumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "141. فَسَاهَمَ (kemudian ia ikut berundi) Yakni para penumpang kapal mengadakan undian untuk menentukan siapa yang akan dilemparkan ke laut agar kapal itu tidak tenggelam. فَكَانَ مِنَ الْمُدْحَضِينَ (lalu dia termasuk orang-orang yang kalah dalam undian) Sehingga ia dilempar ke laut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141. Maka Yunus dan penumpang perahu melakukan pengundian saat perahu akan tenggelam, lalu mereka akan melemparkan sebagian ke dalam laut karena takut tenggelam, kemudian dia (Yunus) termasuk orang yang kalah dalam undian sehingga dia dilempar ke dalam laut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kemudian dia ikut serta} kemudian penghuni bahtera membuat undian {maka dia termasuk orang-orang yang kalah} orang yang kalah dalam undian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141. Setelah ia berangkat bersama yang lainnya, sedangkan kapal itu sangat sarat (penuh muatan), dan keberatan hingga para awak kapal harus membuang sebagian dari para penumpang ke laut, seolah-olah mereka sudah tidak menemukan suatu keistimewaan pada siapa pun dalam masalah ini. Untuk itu mereka melakukan undian terhadap para penumpang, maka siapa yang terkena undian dan kalah, ia harus dibuang ke laut sebagai perlakuan adil dari para awak kapal. Apabila Allah menghendaki suatu perkara, maka Dia mempermudah segala sebab-sebbanya. Setelah mereka melakukan pengundian, maka undian itu pun jatuh kepada Nabi Yunus “lalu dia termasuk orang-orang yang kalah untuk undian,” maksudnya: kalah. Dan beliau pun diceburkan ke laut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 141: 139-142. Allah mengabarkan bahwa Dia memilih Yunus dan menjadikan utusan-Nya. Ia adalah Yunus bin Matta yang Allah utus kepada penduduk Nainawa, yang ia adalah desa di pinggiran (Dijalah) sungai Tigris di Irak. Yunus menyeru kaumnya untuk beriman kepada Allah dan mereka mendustakan dan mengolok-olok Yunus. Maka keyika yunus putus asa akan keimanan mereka, dan meyakini bahwa adzab cocok untuk mereka, Yunus meninggalkan mereka dan melarikan diri dan tidak menunggu perintah Allah; Ketika Yunus sampai di lautan, ia mendapati kapal, ia menaikinya yang kemudian kapal tersebut terhempas ombak yang kemudian Yunus terhempas ke lautan dan ditelah ikan paus besar, sebagai hukuman dari Allah karena sebab meninggalkan kaumnya dan pergi dengan tanpa izin dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Undian itu diadakan karena muatan kapal itu sangat penuh. Jika tidak dikurangi mungkin akan tenggelam. Dipilih jalan undian, karena mereka (para penumpang) melihat tidak ada yang berhak untuk dijatuhkan dari kapal, maka yang adil adalah dilakukan undian. Ketika itu, kapal tersebut digoyang oleh gelombang dari berbagai penjuru dan hampir saja tenggelam, para penumpang pun melakukan undian, di mana jika undian itu jatuh kepadanya, maka dialah yang harus melempar dirinya ke laut agar beban kapal menjadi ringan. Ternyata undian jatuh kepada Yunus ‘alaihis salam dan hal itu dilakukan sebanyak tiga kali namun tetap saja undian jatuh kepadanya, sedangkan para penumpang merasa berat jika Beliau melemparkan dirinya ke laut, maka Yunus segera melepaskan bajunya untuk melemparkan dirinya ke laut, lalu Allah memerintahkan ikan besar dari laut hijau mendatangi Yunus dan menelannya, namun tidak sampai mengunyah daging dan mematahkan tulangnya, ikan besar itu pun datang dan menelan Nabi Yunus ‘alaihis salam, lalu membawanya mengelilingi lautan. Ketika Yunus telah berada di perut ikan itu, ia mengira bahwa ia telah mati, namun ketika ia gerakkan kepala, kaki dan ujung-ujung tubuhnya ternyata ia masih hidup, maka ia berdiri dan shalat di perut ikan itu sambil berdoa, yang di antara doanya adalah, “Yaa Rabbi, aku telah menjadikan masjid untuk-Mu di sebuah tempat (dalam perut ikan) yang tidak dijangkau manusia.” Para ulama berselisih tentang berapa lama Beliau tinggal di dalam perut ikan. Menurut Qatadah, tiga hari. Menurut Abu Ja’far Ash Shaadiq, tujuh hari, sedangkan menurut Abu Malik, empat puluh hari. Mujahid berkata dari Asy Sya’biy, “Ia ditelan di waktu Duha dan dimuntahkan di waktu sore.” Wallahu a’lam. (lihat Al Mishbaahul Muniir fii Tahdziib Tafsir Ibnu Katsir hal. 1164)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 141",
    "description": "140-144. Ingatlah ketika dia lari dan pergi meninggalkan kaumnya padahal Allah tidak memperkenankan kepergiannya, lalu dia naik ke kapal yang penuh dengan muatan hingga hampir tenggelam. Melihat kondisi ini kemudian para penumpang melakukan pengundian, di mana dia ikut diundi untuk menentukan penumpang yang kalah dan harus diceburkan ke laut. Ternyata dia termasuk orang-orang yang kalah dalam undian itu. Maka dia pun diceburkan hingga dia ditelan oleh ikan besar dalam keadaan tercela karena meninggalkan kaumnya tanpa izin Allah"
  }
]