[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka yunus di buang ke laut lalu seekor ikan besar menelannya dan dia telah melakukan sesuatu yang karenanya dia disalahkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "142. Ketika mereka telah melemparkannya ke laut, ikan besar menyambutnya lalu menelannya. Dia (Yunus) melakukan sesuatu yang salah, dia pergi meninggalkan kaumnya tanpa restu Rabbnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "142. فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ (Maka ia ditelan oleh ikan besar dalam keadaan tercela) Yakni ketika ia dilempar ke laut, lalu ia ditelan oleh ikan paus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "142. Lalu dia ditelan oleh paus. Dia datang dengan celaan yang diterima olehnya karena pergi ke laut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudiaan dia ditelan} Kemudian dia ditelan {oleh ikan besar dalam keadaan tercela} datang dengan sesuatu yang membuatnya tercela"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "142. “Maka ia ditelan oleh ikan yang besar dalam keadaan,” yakni pada saat ia ditelan, “tercela.” Maksudnya, tercela sebagai yang melakukan perbuatan yang menyebabkannya dicela, yaitu merasa jengkel hingga TUhannya marah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 142: 139-142. Allah mengabarkan bahwa Dia memilih Yunus dan menjadikan utusan-Nya. Ia adalah Yunus bin Matta yang Allah utus kepada penduduk Nainawa, yang ia adalah desa di pinggiran (Dijalah) sungai Tigris di Irak. Yunus menyeru kaumnya untuk beriman kepada Allah dan mereka mendustakan dan mengolok-olok Yunus. Maka keyika yunus putus asa akan keimanan mereka, dan meyakini bahwa adzab cocok untuk mereka, Yunus meninggalkan mereka dan melarikan diri dan tidak menunggu perintah Allah; Ketika Yunus sampai di lautan, ia mendapati kapal, ia menaikinya yang kemudian kapal tersebut terhempas ombak yang kemudian Yunus terhempas ke lautan dan ditelah ikan paus besar, sebagai hukuman dari Allah karena sebab meninggalkan kaumnya dan pergi dengan tanpa izin dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebab Yunus tercela ialah karena dia lari meninggalkan kaumnya tanpa izin Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 142",
    "description": "140-144. Ingatlah ketika dia lari dan pergi meninggalkan kaumnya padahal Allah tidak memperkenankan kepergiannya, lalu dia naik ke kapal yang penuh dengan muatan hingga hampir tenggelam. Melihat kondisi ini kemudian para penumpang melakukan pengundian, di mana dia ikut diundi untuk menentukan penumpang yang kalah dan harus diceburkan ke laut. Ternyata dia termasuk orang-orang yang kalah dalam undian itu. Maka dia pun diceburkan hingga dia ditelan oleh ikan besar dalam keadaan tercela karena meninggalkan kaumnya tanpa izin Allah"
  }
]