[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "143-144 kalau bukan karena banyaknya ibadah dan amal shalih yang telah dia lakukan sebelum dia dimakan ikan besar tersebut, dan juga tasbihnya saat dia berada di dalam perut ikan tersebut dengan mengucapkan لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ niscaya yunus akan berdiam diri dalam perut ikan dan perut itu akan menjadi kuburnya sampai hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Seandainya Yunus bukan termasuk orang-orang yang banyak mengingat Allah sebelum apa yang terjadi padanya, dan seandainya bukan karena tasbihnya di perut ikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "133-134. Kalalulah dia bukan termasuk orang-orang yang banyak berzikir kepada Allah selama hidupnya dan selama dia di dalam perut ikan paus, niscaya dia akan tetap di dalam perut ikan itu hingga hari kiamat, dan perut ikan itu akan menjadi tempat kuburnya. Akan tetapi dia adalah orang yang mengesakan Tuhannya dan senantiasa bertasbih kepada-Nya serta memohon ampun atas dosanya dengan bermunajat:"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. فَلَوْلَآ أَنَّهُۥ كَانَ مِنَ الْمُسَبِّحِينَ (Maka kalau sekiranya dia tidak termasuk orang-orang yang banyak mengingat Allah) Yakni termasuk orang yang banyak berzikir kepada Allah, atau orang yang banyak berdoa kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143. Kalaulah tidak karena dia termasuk orang-orang yang banyak mengingat Allah dengan bertasbih di sepanjang umurnya dan dalam perut ikan paus"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya dia bukan golongan orang yang banyak bertasbih} orang-orang yang selalu ingat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143-144. “Maka kalau sekiranya dia tidak termasuk orang-orang yang banyak bertasbih,” maksudnya, pada waktu-waktu sebelumnya banyak melakukan ibadah kepada Rabbnya, bertasbih dan bertahmid kepadaNya, dan ketika berada di dalam perut ikan paus itu, dimana dia berdoa dengan mengucapkan, \"Bahwa tidak ada Tuhan (yang berhak disembah) selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim.\" (Al-Anbiya:87) (Kalau tidak), “niscaya ia akan tetap tinggal di perut ikan itu sampai hari berbangkit.” Maksudnya, niscaya perut ikan itu menjadi kuburannya, akan tetapi disebabkan tasbih (menyucikan Allah) dan ibadahnya kepada Allah, maka ia diselamatkan oleh Allah, dan demikianlah Allah menyelamatkan orang-orang beriman di kala mereka terjatuh dalam kesempitan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 143: 143-148. Allah mengabarkan bahwa Yunus adalah hamba yang terus menerus beribadah dan beramal shalih sebelum ia ditelan oleh ikan paus; Dia juga hamba yang senantiasa bertasbih setelah ditelan ikan paus. Maka kalu saja bukan karena amalan shalihnya, sungguh dia akan terus berada di dalam perut ikan paus sampai hari kiamat. Dan tasbih yang senantiasa Yunus ucapkan dalam perut paus adalah Laa Ilaha Illa Anta Subhanaka Inni Kuntu Minadzdzalimin. Karena sebab karunia Allah, kemudian atas amalan shalihnya, Allah mengabulkan doanya dan Allah memerintahkan ikan paus tersebut untuk memuntahkan Yunus di pesisir pantai, dan ia dalam kondisi sakit yang sangat, karena sebab Yunus lelah dan menderita di dalam perut paus dan kemudian Allah melindunginya dari cahaya matahari dengan menumbuhkan pohon untuk menaungi Yunus sebagai pelindung di atas tubunya. Ketika Yunus telah sehat, Allah kembalikan dia kepada kaumnya dimana jumlah kaumnya semakin bertambah lebih dari seribu orang, dan mereka semua menyesal dan bertaubat; Mereka semua membenarkan Yunus (kerisalahannya) dan beramal dengan apa yang datang darinya, oleh karena ini Allah memberikan kenikmatan di kehidupan mereka di dunia dengan berbagai macam kenikmatan, dan mereka semua tetap di atas kepemimpinan Yunus sampai ajal menemui mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Adh Dhahhak bin Qais, Abul ‘Aliyah, Wahb bin Munabbih, Qatadah dan lainnya, bahwa maksud ayat tersebut adalah kalau bukan karena amal (saleh)nya di saat lapang. Hal ini sesuai dengan hadits Ibnu Abbas yang berbunyi, “Ta’arraf ilallah fir rakhaa’ ya’rifka fisy syiddah.”(Kenalilah Allah di waktu lapang, maka Dia akan mengenalimu di waktu susah.”) diriwayatkan oleh Ahmad. Adapun menurut Sa’id bin Jubair dan lainnya, bahwa maksud “Maka sekiranya dia tidak termasuk orang yang banyak berdzikr (bertasbih) kepada Allah” adalah firman-Nya, “Dan (ingatlah kisah) Dzun Nun (Yunus), ketika ia pergi dalam keadaan marah, lalu ia menyangka bahwa Kami tidak akan mempersempitnya (menyulitkannya), maka ia menyeru dalam keadaan yang sangat gelap, “Tidak ada Tuhan yang berhak disembah selain Engkau. Mahasuci Engkau, Sesungguhnya aku adalah termasuk orang-orang yang zalim.\" (terj. Al Anbiya’: 87) Menurut Syaikh As Sa’diy, kalau bukan karena di waktu yang lalu ia banyak beribadah kepada Tuhannya, bertasbih dan memuji-Nya, ditambah lagi ucapannya ketika berada di perut ikan, “Tidak ada Tuhan yang berhak disembah selain Engkau. Mahasuci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 143",
    "description": "140-144. Ingatlah ketika dia lari dan pergi meninggalkan kaumnya padahal Allah tidak memperkenankan kepergiannya, lalu dia naik ke kapal yang penuh dengan muatan hingga hampir tenggelam. Melihat kondisi ini kemudian para penumpang melakukan pengundian, di mana dia ikut diundi untuk menentukan penumpang yang kalah dan harus diceburkan ke laut. Ternyata dia termasuk orang-orang yang kalah dalam undian itu. Maka dia pun diceburkan hingga dia ditelan oleh ikan besar dalam keadaan tercela karena meninggalkan kaumnya tanpa izin Allah"
  }
]