[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu Kami mengeluarkannya dari perut ikan, dan Kami melemparkannnya ke sebuah daerah yang tidak berpohon dan tidak memiliki bangunan dalam keadaan lemah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Kami melemparkan Yunus dari perut ikan ke daratan yang kosong, tidak ada pepohonan dan tidak ada bangunan, Yunus dalam keadaan lemah karena tingga beberapa waktu di dalam perut ikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "135. Maka Allah mengabulkan doanya, dengan melemparkannya dari perut ikan paus ke pantai yang tandus, tidak terdapat pepohonan maupun bangunan, saatdia dalam keadaan lemah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. فَنَبَذْنٰهُ بِالْعَرَآءِ وَهُوَ سَقِيمٌ (Kemudian Kami lemparkan dia ke daerah yang tandus, sedang ia dalam keadaan sakit) Allah memerintahkan ikan paus itu untuk mengeluarkan Yunus, maka ia melemparkan Yunus dari mulutnya, sehingga dia keluar dalam keadaan sakit, yakni kulitnya mengalami kerusakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145. Kemudian Kami mengeluarkannya dari perut paus ke daratan pantai yang tidak ditumbuhi pepohonan dan tanaman sedangkan dia dalam keadaan lemah dan sakit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami melemparkannya} lalu Kami melemparkannya dari mulut ikan {ke daratan yang tandus} daratan yang tidak ada pohon dan bangunan {dan dia dalam keadaan sakit} lemah tubuhnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145. “Kemudian Kami lemparkan dia ke daerah yang tandus,” dengan dilemparkan oleh ikan paus itu dari dalam perutnya ke tanah yang tandus, yaitu tanah yang kosong lagi tidak ada siapa-siapa pun, bahkan bisa jadi kosong dari pepohonan dan naungan, “sedang ia dalam keadaan sakit.” Maksudnya, ia menderita sakit karena terkurung lama di dalam perut ikan paus hingga seperti anak burung yang baru menetas dari telur."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 145: 143-148. Allah mengabarkan bahwa Yunus adalah hamba yang terus menerus beribadah dan beramal shalih sebelum ia ditelan oleh ikan paus; Dia juga hamba yang senantiasa bertasbih setelah ditelan ikan paus. Maka kalu saja bukan karena amalan shalihnya, sungguh dia akan terus berada di dalam perut ikan paus sampai hari kiamat. Dan tasbih yang senantiasa Yunus ucapkan dalam perut paus adalah Laa Ilaha Illa Anta Subhanaka Inni Kuntu Minadzdzalimin. Karena sebab karunia Allah, kemudian atas amalan shalihnya, Allah mengabulkan doanya dan Allah memerintahkan ikan paus tersebut untuk memuntahkan Yunus di pesisir pantai, dan ia dalam kondisi sakit yang sangat, karena sebab Yunus lelah dan menderita di dalam perut paus dan kemudian Allah melindunginya dari cahaya matahari dengan menumbuhkan pohon untuk menaungi Yunus sebagai pelindung di atas tubunya. Ketika Yunus telah sehat, Allah kembalikan dia kepada kaumnya dimana jumlah kaumnya semakin bertambah lebih dari seribu orang, dan mereka semua menyesal dan bertaubat; Mereka semua membenarkan Yunus (kerisalahannya) dan beramal dengan apa yang datang darinya, oleh karena ini Allah memberikan kenikmatan di kehidupan mereka di dunia dengan berbagai macam kenikmatan, dan mereka semua tetap di atas kepemimpinan Yunus sampai ajal menemui mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dataran yang sepi, tidak ada manusia, pohon maupun tempat berteduh. Yakni disebabkan berada dalam perut ikan sehingga seperti anak burung yang baru dikeluarkan dari telur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 145",
    "description": "145-146. Setelah nabi yunus beberapa lama berada di dalam perut ikan dalam kondisi gelap, sempit, dan sesak nafas, kemudian kami keluarkan dan lemparkan dia ke daratan yang tandus tanpa pepohonan di sana, sedang dia dalam keadaan sakit dan tidak berdaya. Dengan kemurahan-ku, untuk dia kami tumbuhkan sebatang pohon dari jenis labu sebagai makanan yang segar, lezat, dan bergizi sehingga kekuatan dan kesehatannya berangsur pulih"
  }
]