[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan Kami menumbuhkan untuknya pohon labu yang memayunginya dan bermanfaat baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. Kami menumbuhkan di tanah yang kosong tersebut sebuah pohon labu yang memayunginya dan dia memakan dari buahnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "146. Dan Kami menumbuhkan baginya tanaman labu untuk menaunginya dari sinar matahari dan melindunginya dari serangga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. وَأَنۢبَتْنَا عَلَيْهِ شَجَرَةً مِّن يَقْطِينٍ (Dan Kami tumbuhkan untuk dia sebatang pohon dari jenis labu) Yakni pohon labu yang dia gunakan untuk berteduh sampai ototnya kembali menguat dan rambutnya kembali tumbuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146. Lalu Kami tumbuhkan di atasnya pohon yang memayunginya. Itu adalah pohon labu sehingga dia pulih dan kuat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami menumbuhkan untuknya tanaman sejenis labu} labu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "146. “Dan Kami tumbuhkan untuknya sebatang pohon dari jenis labu,” yang menaunginya dengan naungannya yang rindang, sebab naungannya sejuk dan tidak dihinggapi oleh lalat. Ini adalah bagian dari kasih sayang dan kebaikan dari Allah kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 146: 143-148. Allah mengabarkan bahwa Yunus adalah hamba yang terus menerus beribadah dan beramal shalih sebelum ia ditelan oleh ikan paus; Dia juga hamba yang senantiasa bertasbih setelah ditelan ikan paus. Maka kalu saja bukan karena amalan shalihnya, sungguh dia akan terus berada di dalam perut ikan paus sampai hari kiamat. Dan tasbih yang senantiasa Yunus ucapkan dalam perut paus adalah Laa Ilaha Illa Anta Subhanaka Inni Kuntu Minadzdzalimin. Karena sebab karunia Allah, kemudian atas amalan shalihnya, Allah mengabulkan doanya dan Allah memerintahkan ikan paus tersebut untuk memuntahkan Yunus di pesisir pantai, dan ia dalam kondisi sakit yang sangat, karena sebab Yunus lelah dan menderita di dalam perut paus dan kemudian Allah melindunginya dari cahaya matahari dengan menumbuhkan pohon untuk menaungi Yunus sebagai pelindung di atas tubunya. Ketika Yunus telah sehat, Allah kembalikan dia kepada kaumnya dimana jumlah kaumnya semakin bertambah lebih dari seribu orang, dan mereka semua menyesal dan bertaubat; Mereka semua membenarkan Yunus (kerisalahannya) dan beramal dengan apa yang datang darinya, oleh karena ini Allah memberikan kenikmatan di kehidupan mereka di dunia dengan berbagai macam kenikmatan, dan mereka semua tetap di atas kepemimpinan Yunus sampai ajal menemui mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini termasuk kelembutan Allah dan kebaikan-Nya kepadanya, demikian juga pengutusan-Nya kepada 100.000 orang atau lebih, Beliau mendakwahi mereka kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 146",
    "description": "145-146. Setelah nabi yunus beberapa lama berada di dalam perut ikan dalam kondisi gelap, sempit, dan sesak nafas, kemudian kami keluarkan dan lemparkan dia ke daratan yang tandus tanpa pepohonan di sana, sedang dia dalam keadaan sakit dan tidak berdaya. Dengan kemurahan-ku, untuk dia kami tumbuhkan sebatang pohon dari jenis labu sebagai makanan yang segar, lezat, dan bergizi sehingga kekuatan dan kesehatannya berangsur pulih. 147-148. Dan setelah pulih, kami utus dia kembali kepada kaumnya yang saat itu berjumlah seratus ribu orang atau lebih. Kedatangannya disambut gembira karena mereka menunggu seorang rasul yang membim-bing mereka menuju keimanan. Mereka sadar bahwa Allah dengan kasih sayang-Nya telah menyelamatkan mereka dari azab yang tampak di depan mata, sehingga mereka benar-benar beriman kepada Allah de-ngan tulus. Karena itu kami anugerahkan kenikmatan hidup kepada mereka hingga waktu tertentu, yaitu akhir hayat mereka. Anugerah semacam ini hanya Allah karuniakan kepada umat nabi yunus (lihat pula: surah y'nus/10: 98)."
  }
]