[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "147-148 dan Kami mengutusnya pada kaumnya yang berjumlah seratus ribu bahkan lebih dari itu mereka membenarkannya dan melaksanakan apa yang dibawanya, maka Kami memberikan kenikmatan hidup kepada mereka sampai tiba saat ajal mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Mereka beriman dan membenarkannya, maka Allah memberi mereka kesempatan hidup di dunia sampai masa ajal mereka yang telah ditentukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Ketika dia mendatangi kaumnya, mereka beriman kepadanya dan menjalankan seruannya. Maka Kami memberi mereka kenikmatan pada kehidupan mereka hingga sampai ajal yang telah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. فَـَٔامَنُوا۟ فَمَتَّعْنٰهُمْ إِلَىٰ حِينٍ (Lalu mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu yang tertentu) Mereka beriman setelah menyaksikan tanda-tanda kenabiannya. Maka Allah memberi mereka kenikmatan di dunia sampai ajal mereka datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148. Mereka beriman kepada Allah sebagai Tuhan yang Maha Esa dan merespon dakwahnya (Yunus). Maka Kami membuat mereka bisa menikmati kenikmatan dunia sampai berakhirnya ajal mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau bahkan lebih {lalu mereka beriman. Maka Kami memberi kenikmatan hidup kepada mereka hingga waktu tertentu} Lalu Kami membiarkan mereka hidup merasakan kenikmatan sampai berakhirnya ajal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147-148. Kemudian Allah memberikan kasih sayang lagi padanya dalam bentuk yang lain dan mengaruniakan kepadanya suatu karunia yang sangat besar, yaitu Dia mengutusnya “kepada seratus ribu,” orang manusia “atau lebih” dari itu. Artinya, mereka kalau tidak lebih dari itu, maka tidak kurang dari itu. Yunus pun mengajak mereka kepada Allah, “Lalu mereka beriman,” sehingga mereka menjadi timbangan kebaikan-kebaikan Nabi Yunus, karena beliaulah yang mengajak mereka. “Karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu yang tertentu.” Allah menjauhkan azab dari mereka setelah faktor-faktornya sudah ada semua. Allah berfirman, “Dan mengapa tidak ada (penduduk) suatu kota yang beriman, lalu imannya itu bermanfaat kepadanya selain kaum Yunus? Tatkala mereka (kaum Yunus itu), beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia, dan Kami beri kesenangan kepada mereka sampai kepada waktu yang tertentu.” (Yunus:98)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 148: 143-148. Allah mengabarkan bahwa Yunus adalah hamba yang terus menerus beribadah dan beramal shalih sebelum ia ditelan oleh ikan paus; Dia juga hamba yang senantiasa bertasbih setelah ditelan ikan paus. Maka kalu saja bukan karena amalan shalihnya, sungguh dia akan terus berada di dalam perut ikan paus sampai hari kiamat. Dan tasbih yang senantiasa Yunus ucapkan dalam perut paus adalah Laa Ilaha Illa Anta Subhanaka Inni Kuntu Minadzdzalimin. Karena sebab karunia Allah, kemudian atas amalan shalihnya, Allah mengabulkan doanya dan Allah memerintahkan ikan paus tersebut untuk memuntahkan Yunus di pesisir pantai, dan ia dalam kondisi sakit yang sangat, karena sebab Yunus lelah dan menderita di dalam perut paus dan kemudian Allah melindunginya dari cahaya matahari dengan menumbuhkan pohon untuk menaungi Yunus sebagai pelindung di atas tubunya. Ketika Yunus telah sehat, Allah kembalikan dia kepada kaumnya dimana jumlah kaumnya semakin bertambah lebih dari seribu orang, dan mereka semua menyesal dan bertaubat; Mereka semua membenarkan Yunus (kerisalahannya) dan beramal dengan apa yang datang darinya, oleh karena ini Allah memberikan kenikmatan di kehidupan mereka di dunia dengan berbagai macam kenikmatan, dan mereka semua tetap di atas kepemimpinan Yunus sampai ajal menemui mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika menyaksikan azab. Dengan dihindarkan-Nya azab dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 148",
    "description": "147-148. Dan setelah pulih, kami utus dia kembali kepada kaumnya yang saat itu berjumlah seratus ribu orang atau lebih. Kedatangannya disambut gembira karena mereka menunggu seorang rasul yang membim-bing mereka menuju keimanan. Mereka sadar bahwa Allah dengan kasih sayang-Nya telah menyelamatkan mereka dari azab yang tampak di depan mata, sehingga mereka benar-benar beriman kepada Allah de-ngan tulus. Karena itu kami anugerahkan kenikmatan hidup kepada mereka hingga waktu tertentu, yaitu akhir hayat mereka. Anugerah semacam ini hanya Allah karuniakan kepada umat nabi yunus (lihat pula: surah y'nus/10: 98). 149-150. Kisah para nabi ini menjadi pelajaran bagi generasi sesudahnya. Mereka, seperti halnya nabi Muhammad, diutus untuk menyampaikan risalah tauhid kepada umatnya, mengajak mereka untuk mengesakan Allah dan menyucikan Allah dari hal-hal yang tidak patut. Maka tanyakanlah, wahai nabi Muhammad, kepada mereka yang ingkar dari umatmu, apakah mereka menisbatkan anak-anak perempuan itu untuk tuhanmu sedangkan untuk mereka sendiri mereka memilih anak-anak laki-laki' atau tanyakanlah kepada mereka apakah kami menciptakan malaikat-malaikat sebagai hamba Allah berupa makhluk berjenis kelamin perempuan, sedangkan mereka menyaksikan hal itu' sungguh, mere-ka akan diminta pertanggungjawaban di akhirat atas tuduhan mereka itu (lihat pula: surah az-zukhruf/43: 19)."
  }
]