[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka tanyakanlah (wahai rasul) kepada kaummu, bagaimana mereka menjadikan anak perempuan untuk Allah padahal mereka sendiri tidak menyukainya, dan mereka menjadikan anak laki-laki untuk mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Tanyakanlah -wahai Muhammad- kepada orang-orang musyrikin dengan nada pengingkaran, “Apakah kalian menjadikan anak-anak perempuan bagi Allah padahal kalian sendiri membenci mereka dan kalian menjadikan anak-anak lelaki yang kalian sukai bagi kalian? Pembagian macam apa ini?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149. Hai Rasulullah, tanyakanlah kepada orang-orang kafir Quraisy sebagai teguran dan olokan bagi mereka; mengapa mereka menjadikan bagi Allah anak-anak perempuan yang tidak mereka sukai, sedangkan mereka menjadikan bagi diri mereka anak-anak perempuan yang mereka sukai?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "149. فَاسْتَفْتِهِمْ (Tanyakanlah kepada mereka) Yakni tanyakanlah kepada mereka hai Muhammad. أَلِرَبِّكَ الْبَنَاتُ وَلَهُمُ الْبَنُونَ (“Apakah untuk Tuhanmu anak-anak perempuan dan untuk mereka anak laki-laki) Yakni bagaimana mereka menjadikan bagi Allah anak dari jenis yang lebih lemah yaitu perempuan jika memang Allah memiliki anak sebagaimana yang mereka katakan? Sedangkan mereka menginginkan anak dari jenis yang lebih kuat yaitu laki-laki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149. Wahai Nabi, tanyakanlah dan minatalah kabar dari mereka, apakah untuk Tuhanmu itu puteri-puteri, yaitu para malaikat sebagaimana yang mereka asumsikan bahwa mereka (malaikat) adalah puteri Allah dan mereka (jenis perempuan) adalah jenis paling rendah di antara dua jenis (laki-laki dan perempuan). Adapun untuk mereka adalah putera yaitu jenis paling tinggi di antara dua jenis."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{tanyakanlah mereka} tanyakanlah wahai Muhammad kepada penduduk Mekkah {“Apakah untuk Tuhanmu anak-anak perempuan, sedangkan untuk mereka anak-anak laki-laki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149. Allah berfirman kepada NabiNya, Muhammad, “Tanyaknalah kepada mereka.” Maksudnya, tanyakanlah kepada orang-orang yang mempersekutukan Allah dengan yang lainnya, yaitu kepada mereka yang menyembah para malaikat dan mereka meyakini bahwa para malaikat adalah putri-putri Allah! Mereka benar-benar telah memadukan nkesyirikan kepada Allah dengan menyifatinya dengan hal-hal yang sangat tidak layak dengan keagunganNya. “Apakah untuk Rabbmu anak-anak perempuan dan untuk mereka anak laki-laki?” maksudnya, ini adalah pembagian yang sangat curang dan perkataan zhalim, dilihat dari sudut pandang mereka menetapkan anak bagi Allah, dan juga dari sudut mereka menetapkan bagian yang paling buruk dan paling nista untukNya, yaitu anak-anak perempuan, yang mereka sendiri tidak meridhainya untuk diri mereka sendiri, sebagaimana Allah firmankan di dalam ayat yang lain, “Dan mereka menetapkan bagi Allah anak-anak perempuan. Maha Suci Allah, sedang untuk mereka sendiri (mereka tetapkan) apa yang mereka sukai (yaitu anak-anak laki-laki).” (An-Nahl:57). Dan dari sudut lain, mereka menetapkan para malaikat sebagai putri-putri Allah dan mereka menetapkan demikian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 149: 149-153. Allah memerintahkan Nabi-Nya ﷺ agar bertanya kepada mereka orang-orang kafir : Sejak kapan Allah memiliki anak perempuan sedangkan mereka menjadikan anak-anak laki-laki nisbat pada diri mereka? Karena sebab pertanyaan tersebut mereka berkata : Sesungguhnya para malaikat adalah anak-anak perempuan Allah. Kemudian Nabi Allah perintahkan untuk bertanya kepada mereka : Apakah mereka pada saat diciptakannya para malaikat, mereka semua hadir ?. Kemudian Allah menjelaskan bahwa mereka adalah pembohong atas klaim-klaim mereka bahwa Allah memiliki anak. Ketauilah bahwa mereka semua adalah pembohong. Kemudian Nabi ﷺ diperintahkan untuk bertanya kepada mereka : Apakah Allah lebih memilih anak-anak perempuan dibandingkan anak-anak laki-laki ?! Darimana kalian tahu akan hal itu wahai orang-orang yang menyekutukan Allah?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada kaum musyrik yang menyembah malaikat dan menganggap bahwa mereka adalah puteri-puteri Allah. Mereka menggabung antara berbuat syirk dan menyifati Allah dengan sifat yang tidak layak dengan kebesaran-Nya. Orang musyrikin mengatakan bahwa Allah mempunyai anak-anak perempuan (malaikat), padahal mereka sendiri menganggap hina anak perempuan itu. Jelas yang demikian adalah pembagian yang tidak adil dan ucapan yang zalim, yaitu karena mereka menjadikan bagian yang terburuk, yaitu anak perempuan untuk Allah, sedangkan mereka tidak ridha jika bagian itu untuk mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 149",
    "description": "149-150. Kisah para nabi ini menjadi pelajaran bagi generasi sesudahnya. Mereka, seperti halnya nabi Muhammad, diutus untuk menyampaikan risalah tauhid kepada umatnya, mengajak mereka untuk mengesakan Allah dan menyucikan Allah dari hal-hal yang tidak patut. Maka tanyakanlah, wahai nabi Muhammad, kepada mereka yang ingkar dari umatmu, apakah mereka menisbatkan anak-anak perempuan itu untuk tuhanmu sedangkan untuk mereka sendiri mereka memilih anak-anak laki-laki' atau tanyakanlah kepada mereka apakah kami menciptakan malaikat-malaikat sebagai hamba Allah berupa makhluk berjenis kelamin perempuan, sedangkan mereka menyaksikan hal itu' sungguh, mere-ka akan diminta pertanggungjawaban di akhirat atas tuduhan mereka itu (lihat pula: surah az-zukhruf/43: 19)"
  }
]