[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "tanyakanlah kepada mereka “apakah Kami menciptakan para malaikat sebagai perempuan-perempuan dan mereka hadir saat itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Bagaimana mereka berani berkata bahwa malaikat adalah anak-anak perempuan Allah sementara mereka tidak menyaksikan penciptaan mereka dan tidak menghadirinya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "150. Dan tanyakanlah kepada mereka; apakah Kami menciptakan para malaikat berjenis kelamin perempuan, dan mereka menyaksikan proses penciptaan mereka sehingga mereka dapat mengetahui hakikat para malaikat itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. أَمْ خَلَقْنَا الْمَلٰٓئِكَةَ إِنٰثًا وَهُمْ شٰهِدُونَ (atau apakah Kami menciptakan malaikat-malaikat berupa perempuan dan mereka menyaksikan(nya)?) Kemudian Allah berpindah dari pertanyaan pertama menuju pertanyaan yang lebih menusuk, yaitu: bagaimana mereka menganggap para malaikat itu perempuan padahal mereka belum pernah melihat penciptaan malaikat? Padahal menganggap para malaikat itu adalah perempuan adalah hal yang tidak dapat dijangkau oleh akal sehingga mereka dapat merujukkannya kepada akal mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150. Atau bagaimana bisa mereka menganggap malaikat itu perempuan, sedangkan mereka tidak hadir saat kami menciptakan (malaikat) bagi mereka? Syahidun maknanya adalah mereka hadir. Maknanya yang demikian itu tidak mungkin diketahui kecuali hanya dengan melihatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau Kami menciptakan malaikat-malaikat berupa perempuan, sedangkan mereka menyaksikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150. Allah berfirman dalam menjelaskan kedustaan mereka, “Atau apakah Kami menciptakan malaikat-malaikat berupa perempuan dan mereka menyaksikan,” penciptaan mereka. Artinya, kenyataannya tidak demikian, karena mereka sesungguhnya sama sekali tidak menyaksikan penciptaan para malaikat. Maka hal ini membuktikan bahwa mereka mengatakan perkataan tersebut tanpa landasan ilmu, melainkan perbuatan mengada-ada terhadap Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 150: 149-153. Allah memerintahkan Nabi-Nya ﷺ agar bertanya kepada mereka orang-orang kafir : Sejak kapan Allah memiliki anak perempuan sedangkan mereka menjadikan anak-anak laki-laki nisbat pada diri mereka? Karena sebab pertanyaan tersebut mereka berkata : Sesungguhnya para malaikat adalah anak-anak perempuan Allah. Kemudian Nabi Allah perintahkan untuk bertanya kepada mereka : Apakah mereka pada saat diciptakannya para malaikat, mereka semua hadir ?. Kemudian Allah menjelaskan bahwa mereka adalah pembohong atas klaim-klaim mereka bahwa Allah memiliki anak. Ketauilah bahwa mereka semua adalah pembohong. Kemudian Nabi ﷺ diperintahkan untuk bertanya kepada mereka : Apakah Allah lebih memilih anak-anak perempuan dibandingkan anak-anak laki-laki ?! Darimana kalian tahu akan hal itu wahai orang-orang yang menyekutukan Allah?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bahkan tidak demikian. Mereka sendiri juga tidak menyaksikan penciptaan malaikat, oleh karena itu ucapan mereka menunjukkan bahwa mereka berkata-kata tanpa ilmu, bahkan berdusta atas nama Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 150",
    "description": "149-150. Kisah para nabi ini menjadi pelajaran bagi generasi sesudahnya. Mereka, seperti halnya nabi Muhammad, diutus untuk menyampaikan risalah tauhid kepada umatnya, mengajak mereka untuk mengesakan Allah dan menyucikan Allah dari hal-hal yang tidak patut. Maka tanyakanlah, wahai nabi Muhammad, kepada mereka yang ingkar dari umatmu, apakah mereka menisbatkan anak-anak perempuan itu untuk tuhanmu sedangkan untuk mereka sendiri mereka memilih anak-anak laki-laki' atau tanyakanlah kepada mereka apakah kami menciptakan malaikat-malaikat sebagai hamba Allah berupa makhluk berjenis kelamin perempuan, sedangkan mereka menyaksikan hal itu' sungguh, mere-ka akan diminta pertanggungjawaban di akhirat atas tuduhan mereka itu (lihat pula: surah az-zukhruf/43: 19). 151-153. Wahai nabi Muhammad, ingatlah sesungguhnya di antara kebo-hongannya yang lain adalah bahwa mereka benar-benar mengatakan, 'Allah mempunyai anak. ' mahasuci Allah. Tiada sekutu bagi-Nya. Dia tidak beranak dan tidak pula diperanakkan. Dan sungguh, mereka benar-benar pendusta karena tuduhan mereka tidak berdasar sama sekali. Apakah untuk diri-Nya sendiri dia lebih memilih anak-anak perempuan daripada anak-anak laki-laki' mereka menuduh para malaikat sebagai anak-anak perempuan Allah."
  }
]