[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "151-152 dan sesungguhnya diantara kebohongan mereka adalah ucapan mereka ”Allah melahirkan anak” sesungguhnya mereka benar-benar orang yang berdusta karena mereka berkata apa yang tidak mereka ketahui."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "152. pasti berani menisbahkan anak kepada Allah. Dan sesungguhnya mereka benar-benar dusta terkait apa yang mereka katakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "152. Allah beranak (saat mereka beranggapan bahwa malaikat adalah puteri-puteri Allah). Sesungguhnya mereka itu berdusta dalam ucapannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Allah mempunyai anak” Sesungguhnya mereka benar-benar pendusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151-157. Maka dari itu Allah berfirman, “Ketahuilah bahwa sesungguhnya mereka dengan kebohongannya,” yakni dengan kedustaan yang sangat jelas, “mereka benar-benar mengatakan, ‘Allah beranak.’ Dan sesungguhnya mereka benar-benar orang yang berdusta.” “Apakah Dia memilih,” yakni, mengutamakan “anak-anak perempuan daripada anak laki-laki. Apakah yang terjadi padamu? Bagaimana kamu menetapkan” keputusan yang sangat zhalim ini? Sebab, kalau saja kalian memikirkannya, tentun kalian tidak akan mengatakan perkataan demikian. “Atau apakah kamu mempunyai bukti yang nyata.” Maksudnya, argument yang jelas atas perkataan kalian ini dari suatu Kitab atau dari seorang Rasul. Semua ini tidak pernah terjadi! Maka dari itu Allah berfirman, “Maka bawalah kitabmu jika kamu memang orang-orang yang benar,” sebab sesungguhnya orang yang mengatakan suatu perkataan yang tidak berdasarkan bukti syar’I adalah pendusta yang sengaja, atau orang yang mengatakan sesuatu terhadap Allah tanpa dasar ilmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 152: 149-153. Allah memerintahkan Nabi-Nya ﷺ agar bertanya kepada mereka orang-orang kafir : Sejak kapan Allah memiliki anak perempuan sedangkan mereka menjadikan anak-anak laki-laki nisbat pada diri mereka? Karena sebab pertanyaan tersebut mereka berkata : Sesungguhnya para malaikat adalah anak-anak perempuan Allah. Kemudian Nabi Allah perintahkan untuk bertanya kepada mereka : Apakah mereka pada saat diciptakannya para malaikat, mereka semua hadir ?. Kemudian Allah menjelaskan bahwa mereka adalah pembohong atas klaim-klaim mereka bahwa Allah memiliki anak. Ketauilah bahwa mereka semua adalah pembohong. Kemudian Nabi ﷺ diperintahkan untuk bertanya kepada mereka : Apakah Allah lebih memilih anak-anak perempuan dibandingkan anak-anak laki-laki ?! Darimana kalian tahu akan hal itu wahai orang-orang yang menyekutukan Allah?!."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 152",
    "description": "151-153. Wahai nabi Muhammad, ingatlah sesungguhnya di antara kebo-hongannya yang lain adalah bahwa mereka benar-benar mengatakan, 'Allah mempunyai anak. ' mahasuci Allah. Tiada sekutu bagi-Nya. Dia tidak beranak dan tidak pula diperanakkan. Dan sungguh, mereka benar-benar pendusta karena tuduhan mereka tidak berdasar sama sekali. Apakah untuk diri-Nya sendiri dia lebih memilih anak-anak perempuan daripada anak-anak laki-laki' mereka menuduh para malaikat sebagai anak-anak perempuan Allah"
  }
]