[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian memiliki hujjah yang nyata atas kebohongan dan perkataan kalian itu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "156. Apakah kalian mempunyai hujah yang nyata atau bukti yang jelas berupa kitab atau rasul?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "156. أَمْ لَكُمْ سُلْطٰنٌ مُّبِينٌ (Atau apakah kamu mempunyai bukti yang nyata?) Yakni hujjah yang jelas dan terang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "156-157. Atau kalian memiliki hujjah jelas tentang ucapan kalian. Maka datangkanlah kitab yang menguatkan ucapan kalian, jika kalian memang orang-orang yang benar ucapannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ataukah kalian mempunyai bukti yang jelas} bukti yang jelas bahwa Allah mempunyai anak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151-157. Maka dari itu Allah berfirman, “Ketahuilah bahwa sesungguhnya mereka dengan kebohongannya,” yakni dengan kedustaan yang sangat jelas, “mereka benar-benar mengatakan, ‘Allah beranak.’ Dan sesungguhnya mereka benar-benar orang yang berdusta.” “Apakah Dia memilih,” yakni, mengutamakan “anak-anak perempuan daripada anak laki-laki. Apakah yang terjadi padamu? Bagaimana kamu menetapkan” keputusan yang sangat zhalim ini? Sebab, kalau saja kalian memikirkannya, tentun kalian tidak akan mengatakan perkataan demikian. “Atau apakah kamu mempunyai bukti yang nyata.” Maksudnya, argument yang jelas atas perkataan kalian ini dari suatu Kitab atau dari seorang Rasul. Semua ini tidak pernah terjadi! Maka dari itu Allah berfirman, “Maka bawalah kitabmu jika kamu memang orang-orang yang benar,” sebab sesungguhnya orang yang mengatakan suatu perkataan yang tidak berdasarkan bukti syar’I adalah pendusta yang sengaja, atau orang yang mengatakan sesuatu terhadap Allah tanpa dasar ilmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 156: 154-157. Katakan kepada mereka wahai Nabi Allah : Apa yang menjadikan kalian menghukumi dengan ketentuan yang buruk semisal ini ? Tidakkah kalian berakal dan mampu membedakan apa yang kalian ucapkan atasnya ? Maka jika kalian adalah orang-orang yang benar dengan apa yang kalian katakan, maka kalian harus memiliki bukti; Maka datangkan dari kitab suci yang menetapkan atas ucapan ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dari kitab maupun rasul. Ternyata tidak ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 156",
    "description": "154-157. Wahai nabi Muhammad, katakanlah kepada mereka, 'me-ngapa kamu beranggapan buruk seperti ini kepada Allah' bagaimana kamu bisa menetapkan bahwa Allah memilih anak perempuan, padahal kamu sendiri tidak menyukainya' maka, mengapa kamu tidak memikirkan bagaimana jika Allah memiliki anak' dia mahakuasa dan maha esa dalam menciptakan dan mengaturnya alam semesta. Ataukah kamu mem'punyai bukti yang jelas atas kebenaran prasangka burukmu itu' jika demikian adanya maka bawalah kitabmu ke hadapan kami dan tunjukkanlah bukti yang membenarkan pernyataanmu jika kamu memang orang yang benar"
  }
]