[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu juga menetapkan nasab dan kekerabatan antara Allah dengan para malaikat, dan sungguh malaikat itu mengetahui bahwa orang-orang musyrik akan dihadirkan untuk di azab di hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Orang-orang musyrikin menetapkan nasab antara Allah dengan malaikat ketika mereka menyatakan bahwa para malaikat adalah anak perempuan Allah. Dan para malaikat sudah mengetahui bahwa Allah akan menghadirkan orang-orang musyrik untuk dihisab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "158. Orang-orang musyrik juga mengatakan kebatilan yang lain, ketika mereka menetapkan hubungan nasab antara Allah dengan jin, dan para malaikat merupakan anak-anak perempuan Allah dari golongan jin. Sungguh para malaikat dan jin telah mengetahui bahwa orang-orang musyrik itu akan diseret ke dalam azab neraka pada hari kiamat akibat kekafiran dan kedustaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. وَجَعَلُوا۟ بَيْنَهُۥ وَبَيْنَ الْجِنَّةِ نَسَبًا ۚ (Dan mereka adakan (hubungan) nasab antara Allah dan antara jin) Makna (الجنة) yakni para jin. Dan orang-orang yang mengatakan bahwa Allah memiliki hubungan nasab dengan para jin adalah orang-orang dari kaum Kinanah dan Khuza’ah. Mereka berkata bahwa Allah datang melamar kepada para pemimpin jin, lalu mereka menikahkan-Nya dengan putri-putri dari pemimpin para jin. Maha Suci Allah dari apa yang mereka katakan. وَلَقَدْ عَلِمَتِ الْجِنَّةُ إِنَّهُمْ لَمُحْضَرُونَ(Dan sesungguhnya jin mengetahui bahwa mereka benar-benar akan diseret (ke neraka)) Terdapat pendapat mengatakan bahwa yang dimaksud adalah para jin mengetahui Allah akan mendatangkan mereka untuk menghisab mereka. Seandainya Allah memiliki hubungan nasab dengan mereka niscaya Allah tidak akan mendatangkan mereka untuk itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158. Mereka para musyrikin menganggap Allah dan malaikta itu memiliki suatu hubungan nasab. Mereka mengklaim bahwa malaikat itu adalah anak-anak perempuan Allah. Mereka menyebut malaikat dengan jinnah karena mereka tidak dapat dilihat oelh mata (hubungan nasab). Malaikat telah tahu bahwa orang-orang kafir itu akan diseret ke dalam azab neraka. Ibnu Abbas mengatakan: “Ayat ini turun untuk tiga orang Qurays, Sulaim, Khuza’ah dan Juhainah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjadikan nasab antara Dia} antara Allah {dan jin} malaikat {Sungguh, jin} malaikatt {benar-benar telah mengetahui bahwa mereka pasti akan dihadirkan} sesungguhnya orang-orang musyrik akan dihadirkan menuju azab pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "158. Orang-orang yang mempersekutukan Allah itu menetapkan adanya hubungan nasab antara Allah dengan jin, di mana mereka beranggapan bahwa sesungguhnya para malaikat adalah putri-putri Allah dan sesungguhnya ibu-ibu mereka adalah jin-jin perempuan! Padahal jin-jin itu nanti, sebagaimana telah diketahui akan dihadirkan ke hadapan Allah akan diberikan pembalasan. Jadi, mereka adalah hamba-hamba yang hina-dina. Kalau saja ada hubungan nasab antara Allah dengan mereka tentu mereka tidak diperlakukan demikian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 158: 158-159. Kemudian orang-orang musyrik menyandarkan kejahatan yang lain atas nama Allah; Dimana mereka menjadikan antara para jin dan Allah memiliki hubungan nasab, dan sungguh engkau telah mengetahui bahwasanya para jin dan orang-orang musyrik akan dihadirkan untuk dibalas (amalannya), dan akan diberdirikan di hadapan Allah untuk ditampakan semua amalan dan dihisab. Maha Tinggi Allah, dan Maha Suci atas apa yang telah mereka sifati yang bahwasanya Allah memiliki anak perempuan (yaitu para malaikat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kaum musyrik mengadakan (hubungan) nasab (keluarga) antara Allah dan jin, yaitu dalam sangkaan mereka bahwa malaikat adalah puteri-puteri Allah dan bahwa ibu mereka (para malaikat) adalah jin-jin mulia, padahal jin itu sendiri mengakui bahwa mereka akan dihadapkan kepada Allah untuk menerma balasan-Nya, mereka (jin-jin) itu adalah hamba-hamba yang hina. Jika memang mereka ada hubungan nasab dengan Allah, tentu mereka tidak seperti itu. Di antara mufassir ada juga yang mengartikan jinnah di sini dengan malaikat. Kaum musyrik mengadakan hubungan nasab antara Allah dengan jinnah adalah ketika mereka mengatakan, bahwa malaikat adalah puteri-puteri Allah. Jika jinnah di ayat ini ditafsirkan dengan malaikat, maka berarti kata “mereka” pada lanjutan ayatnya kembali kepada orang-orang yang mengatakan bahwa malaikat adalah puteri-puteri Allah. Yakni mereka yang mengatakan demikian akan diseret ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 158",
    "description": "158-160. Dan mereka juga menganggap bahwa Allah mengadakan hubungan nasab antara dia dan jin. Alangkah buruk anggapan tersebut, dan sungguh jin yang menyesatkan manusia telah mengetahui bahwa mereka pasti akan diseret ke neraka. Mahasuci dan mahamulia Allah dari apa yang mereka sifatkan. Dia suci dari segala sifat-sifat yang menyamai makhluk-Nya. Mereka yang menyematkan sifat-sifat tersebut kepada Allah akan diseret ke neraka. Demikianlah, kecuali hamba-hamba Allah yang dipilih; mereka disucikan dari dosa karena menyembah Allah de-ngan ikhlas dan tidak mempunyai pandangan salah tentang-Nya"
  }
]