[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maha suci Allah dari segala perkara yang tidak layak untukNya dari sifat-sifat yang disandangkan oleh orang-orang kafir kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. Mahasuci Allah lagi Mahatinggi dari apa yang disifatkan oleh kaum musyrikin kepada-Nya, yang tidak layak dengan keagungan-Nya, berupa anak, sekutu dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "159-160. Maha Suci Allah dari segala yang tidak layak bagi-Nya, dari sifat yang disematkan bagi-Nya oleh orang-orang kafir. Adapun orang-orang beriman, mereka akan menyucikan Allah dari sifat yang disematkan orang-orang zalim bagi-Nya, sebab orang-orang beriman itu mengetahui hak, kedudukan, dan keagungan Allah, sehingga mereka tidak menetapkan sifat bagi-Nya melainkan sifat yang Dia sematkan bagi diri-Nya sendiri dan yang disematkan oleh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159. Maha Suci Allah dari segala apapun yang mereka persifatkan kepada Allah bahwa Allah mempunyai putera, atau dari segala yang mereka dustakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha suci Allah} Maha suci dan Maha bersih Allah {dari apa yang mereka sifatkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159-160. “Mahasuci Allah” Yang Maharaja lagi Mahaagung, Mahasempurna lagi Maha Penyantun dari apa-apa yang diungkapkan oleh kaum musyrikin berupa segala ungkapan yang menyebabkan kekafiran dan kemusyrikan mereka; “kecuali hamba-hamba Allah yang diberi keikhlasan,” di mana Allah tidak mencurahkan diriNya dari apa yang mereka sifatkan bagiNya, karena mereka tidak menyifatiNya kecuali dengan apa-apa yang pantas dengan keagunganNya, maka dari itu mereka menjadi orang-orang yang dinugerahi keikhlasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 159: 158-159. Kemudian orang-orang musyrik menyandarkan kejahatan yang lain atas nama Allah; Dimana mereka menjadikan antara para jin dan Allah memiliki hubungan nasab, dan sungguh engkau telah mengetahui bahwasanya para jin dan orang-orang musyrik akan dihadirkan untuk dibalas (amalannya), dan akan diberdirikan di hadapan Allah untuk ditampakan semua amalan dan dihisab. Maha Tinggi Allah, dan Maha Suci atas apa yang telah mereka sifati yang bahwasanya Allah memiliki anak perempuan (yaitu para malaikat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menyifatkan bahwa Allah mempunyai anak, Mahasuci Allah dari penyifatan mereka itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 159",
    "description": "158-160. Dan mereka juga menganggap bahwa Allah mengadakan hubungan nasab antara dia dan jin. Alangkah buruk anggapan tersebut, dan sungguh jin yang menyesatkan manusia telah mengetahui bahwa mereka pasti akan diseret ke neraka. Mahasuci dan mahamulia Allah dari apa yang mereka sifatkan. Dia suci dari segala sifat-sifat yang menyamai makhluk-Nya. Mereka yang menyematkan sifat-sifat tersebut kepada Allah akan diseret ke neraka. Demikianlah, kecuali hamba-hamba Allah yang dipilih; mereka disucikan dari dosa karena menyembah Allah de-ngan ikhlas dan tidak mempunyai pandangan salah tentang-Nya"
  }
]