[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-17. Mereka berkata ”apa yang kau bawa ini hanyalah sihir yang nyata lagi jelas”. Apakah apabila kami telah mati dan kami menjadi tanah tulang-tulang telah lapuk, kami akan dibangkitkan dari kubur kami dalam keadaan hidup, apakah leluhur-leluhur kami yang dulu juga dibangkitkan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Apakah bila kami sudah mati dan menjadi tanah dan tinggal tulang belulang yang hancur luluh, apakah kita akan dibangkitkan sesudahnya dalam keadaan hidup? Ini benar-benar tidak mungkin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Apakah jika kami mati menjadi tanah dan menyisakan potongan-potongan tulang, kami akan dihidupkan lagi?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kami telah mati, lalu menjadi tanah dan tulang-belulang, apakah kami benar-benar akan dibangkitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16-17. Dan di antara yang aneh juga adalah mereka mengkiaskan (menganalogikan) kekuasaan Rabb Pencipta langit dan bumi ini dengan kekuasaan manusia yang sangat rapuh dari segala sisinya. Mereka berkata dengan nada mengingkari dan menganggap tidak mungkin akan terjadi, “Apakah apabila kami telah mati dan telah menjadi tanah serta menjadi tulang, apakah benar-benar kami akan dibangkitkan. Dan apakah bapak-bapak kami yang telah terdahulu (juga demikian)?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 16: 12-17. Bahkan engkau juga merasa aneh wahai Nabi atas pengingkaran mereka kaummu akan kebangkitan, keanehan dari mereka yang mengolok-olokmu atas apa yang telah engkau kabarkan kepada mereka dari hari kebangkitan dan pembalasan. Maka jika engkau telah mengkabarkan kepada mereka, mereka tidak mengambil manfaat. Maka jika mereka melihat bukti-bukti kemukjizatanmu, mereka mengolok-olokmu dan sombong. Kemudian mereka berkata dengan sombong : Tidaklah yang telah datangkan darimu wahai Muhammad kecuali hanyalah sihir yang nyata. Kemudian mereka berkata mengomentari atas hari kebangkitan dan pembalasan dengan berkata : Apakah jika kami telah mati dan menjadi jasad, kemudia tinggallah tulang-belulang yang berantakan, maka apakah kami akan dibangkitan untuk kali yang lain ??, dan juga apakah bapak-bapak kami juga akan dibangkitkan yang mereka semua telah mati sebelum kami ??"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk hal yang mengherankan pula adalah pengqiyasan mereka antara kemampuan Allah Yang menciptakan langit dan bumi dengan kemampuan manusia yang memiliki kekurangan dari berbagai sisi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 16",
    "description": "Mereka berkata pula, 'apabila kami telah mati dan jasad-jasad kami telah berubah menjadi tanah dan tulang-belulang yang lapuk dan hancur, apakah benar kami akan dibangkitkan kembali seperti semula'17. Dan apakah nenek moyang kami yang telah terdahulu mati akan dibangkitkan pula''."
  }
]