[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi hamba-hamba Allah yang ikhlas dalam beribadah kepadanya tidak menyipatinya kecuali dengan apa yang layak bagi keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "160. Kecuali hamba-hamba Allah yang terpilih, sesungguhnya mereka tidak menyebut Allah kecuali dengan apa yang layak bagi-Nya, yaitu sifat-sifat keagungan dan kesempurnaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160. Kecuali hamba-hamba Allah yang telah Dia pilih, mereka senantiasa mensucikan Allah dari segala yang mereka persifatkan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali hamba-hamba Allah yang ikhlas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159-160. “Mahasuci Allah” Yang Maharaja lagi Mahaagung, Mahasempurna lagi Maha Penyantun dari apa-apa yang diungkapkan oleh kaum musyrikin berupa segala ungkapan yang menyebabkan kekafiran dan kemusyrikan mereka; “kecuali hamba-hamba Allah yang diberi keikhlasan,” di mana Allah tidak mencurahkan diriNya dari apa yang mereka sifatkan bagiNya, karena mereka tidak menyifatiNya kecuali dengan apa-apa yang pantas dengan keagunganNya, maka dari itu mereka menjadi orang-orang yang dinugerahi keikhlasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 160: Dikecualikan oleh Allah hamba-Nya yang ikhlas yang beriman, karena mereka tidak mensifati Allah kecuali dengan apa yang pantas bagi-Nya, mereka menamakan Allah dengan apa yang Allah namai atas diri-Nya sendiri, begitu juga sifat-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengatakan, bahwa yang dimaksud hamba Allah di sini ialah golongan jin yang beriman. Ada pula yang menafsirkan dengan manusia yang beriman. Yakni mereka menyucikan Alah dari sifat yang tidak layak bagi-Nya yang disifatkan oleh orang-orang musyrik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 160",
    "description": "158-160. Dan mereka juga menganggap bahwa Allah mengadakan hubungan nasab antara dia dan jin. Alangkah buruk anggapan tersebut, dan sungguh jin yang menyesatkan manusia telah mengetahui bahwa mereka pasti akan diseret ke neraka. Mahasuci dan mahamulia Allah dari apa yang mereka sifatkan. Dia suci dari segala sifat-sifat yang menyamai makhluk-Nya. Mereka yang menyematkan sifat-sifat tersebut kepada Allah akan diseret ke neraka. Demikianlah, kecuali hamba-hamba Allah yang dipilih; mereka disucikan dari dosa karena menyembah Allah de-ngan ikhlas dan tidak mempunyai pandangan salah tentang-Nya. 161-163. Maka ketahuilah wahai orang-orang musyrik, sesungguhnya kamu dan apa yang kamu sembah itu, yaitu patung dan berhala, serta segala upayamu untuk menyesatkan orang lain, tidak akan dapat menyesatkan seseorang terhadap Allah, kecuali menyesatkan orang-orang yang telah ditetapkan akan masuk ke neraka jahim akibat langgeng dalam kekafirannya. Sementara itu, orang yang menempuh jalan kebenaran akan selamat dari tipu daya setan sehingga selamat dari siksa neraka."
  }
]