[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "161-163 maka sesungguhnya kalian (wahai orang-orang yang menyekutukan Allah) dan tuhan-tuhan yang kalian sembah selain Allah itu, tidak mampu menyesatkan siapapun kecuali siapa yang telah Allah swt takdirkan untuk masuk kedalam neraka jahanam karena kekafiran dan kezhalimannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Sesungguhnya kalian -wahai kaum musyrikin- dan apa yang kalian sembah selain Allah"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "161-163. Hai orang-orang yang menyekutukan Allah, kalian dan yang kalian sembah selain Allah berupa berhala, setan, dan lainnya tidak akan mampu menyesatkan seorangpun dari agama Allah, melainkan hanya orang yang Allah tetapkan baginya untuk masuk neraka dengan kekafiran, kezaliman, dan kesesatannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "161-163. مَآ أَنتُمْ عَلَيْهِ بِفٰتِنِينَ إِلَّا مَنْ هُوَ صَالِ الْجَحِيمِ فَإِنَّكُمْ وَمَا تَعْبُدُونَ (Maka sesungguhnya kamu dan apa-apa yang kamu sembah itu Sekali-kali tidak dapat menyesatkan (seseorang) terhadap Allah kecuali orang-orang yang akan masuk neraka yang menyala) Yakni kalian dan tuhan-tuhan yang kalian sembah selain Allah tidak menyesatkan siapapun kecuali orang yang telah ditakdirkan Allah untuk memasiki neraka, dan mereka adalah orang-orang yang terus menerus melakukan kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161. – 163. Wahai kalian orang-orang musyrik beserta berhala sesembahan kalian itu, tidak akan pernah bisa membuat siapapun sesat juga tidak akan pernah bisa merusak seseorangpun dengan bujukan kalian. Kecuali orang-orang yang telah ditetapkan Allah bahwa tempat tinggalnya kelak adalah di neraka yang menyala. Mereka adalah orang-orang yang tetap kekeh dalam kekafiran, dan mereka yang selalu meremehkan neraka. Maknanya adalah bahwa kalian wahai orang kafir dan para setan kalian tidak akan pernah bisa merusak hamba-hamba Allah yang saleh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sesungguhnya kalian dan apa yang kalian sembah itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "161-163. Maksudnya, sesungguhnya kalian, wahai orang-orang musyrik dan juga apa-apa yang kalian sembah selain Allah, tidak akan mampu memperdayakan dan menyesatkan seseorang kecuali orang yang telah ditetapkan Allah sebagai penghuni neraka yang menyala-nyala, yang padanya berlaku takdir illahi. Maksud dari ini semua adalah menjelaskan ketidak-berdayaan mereka dan ketidak-berdayaan sembahan-sembahan mereka untuk melakukan penyesatan terhadap seseorang, dan menjelaskan kemahasempurnaan kekuasaan Allah. Artinya, Maka janganlah kalian berambisi untuk menyesatkan hamba-hamba Allah yang disucikan dan golonganNya yang beruntung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 161: 161-163. Ketahuilah wahai orang-orang yang musyrik, bahwasanya kalian dan yang kalian jadikan sembahan selain Allah dari seluruh tuhan-tuhan yang bathil tidak satupun akan mampu melenyapkan agama Allah atau membuat umat islam jatuh dalam kesesatan kecuali orang-orang yang Allah takdirkan tempat kembalinya di neraka jahannam, yang mereka menggantikan agama mereka dengan kekufuran dan kesesatan setelah sampai para Rasul bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 161",
    "description": "161-163. Maka ketahuilah wahai orang-orang musyrik, sesungguhnya kamu dan apa yang kamu sembah itu, yaitu patung dan berhala, serta segala upayamu untuk menyesatkan orang lain, tidak akan dapat menyesatkan seseorang terhadap Allah, kecuali menyesatkan orang-orang yang telah ditetapkan akan masuk ke neraka jahim akibat langgeng dalam kekafirannya. Sementara itu, orang yang menempuh jalan kebenaran akan selamat dari tipu daya setan sehingga selamat dari siksa neraka"
  }
]