[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "164-166 Para malaikat berkata ”tidak seorangpun dari kami kecuali dia memiliki tempat yang sudah diketahui di langit, sesungguhnya kami berdiri berbaris dalam beribadah kepada Allah dan menaatiNya dan sesungguhnya kami menyucikan Allah dari segala yang tidak layak bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "164. Para malaikat menjelaskan ubudiyah mereka kepada Allah dan kebebasan mereka dari klaim kaum musyrikin dengan mengatakan,\"Ttidak satu pun dari kami kecuali mempunyai kedudukan yang jelas dalam urusan ibadah dan ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "164-166. Para malaikat berkata: “Tidak ada satupun dari kami melainkan memiliki kedudukan tertentu. Kami tunduk kepada Allah, berdiri berbaris untuk menyembah dan mentaati Allah; dan kami menyucikan-Nya dari segala sifat yang tidak layak bagi keagungan dan kebesaran-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "164. وَمَا مِنَّآ إِلَّا لَهُۥ مَقَامٌ مَّعْلُومٌ (Tiada seorangpun di antara kami (malaikat) melainkan mempunyai kedudukan yang tertentu) Ini merupakan firman Allah yang menceritakan apa yang dikatakan para malaikat; yakni tidaklah kami para malaikat melainkan telah memiliki kedudukan yang telah ditetapkan dalam beribadah kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "164. Para malaikat mengatakan: “Masing-masing dari kami ini tak terkecuali telah mempunyai kedudukan tertentu di langit untuk beribadah kepada Allah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Tidak satu pun di antara kami, kecuali masing-masing mempunyai kedudukan tertentu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164-166. Di sini terdapat penjelasan tentang kebenaran para malaikat dari apa yang dikatakan oleh kaum musyrikin tentang mereka, dan bahwasanya mereka adalah juga hamba-hamba Allah yang tidak pernah mendurhakaiNya sekejap mata pun. Tiada seorang pun di antara mereka melainkan mempunyai kedudukan dan tugas mengatur yang telah diperintahkan oleh Allah kepadanya, ia tidak akan melampaui atau melanggarnya, dan mereka juga sama sekali tidak mempunyai hak perintah. “Dan sesungguhnya kami benar-benar bershaf-shaf,” dalam menaati Allah dan berbakti kepadaNya. “Dan sesungguhnya kami benar-benar bertasbih,” menyucikan Allah dari apa-apa yang tidak pantas bagiNya. Kalau sedemikian adanya maka bagaimana mereka pantas menjadi sekutu-sekutu bagi Allah? Mahasuci Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 164: 164-166. Ketahuilah bahwa para malaikat ketaatan mereka kepada Allah sempurna, maka katakan kepada mereka : Tidaklah para malaikat kecuali memiliki kedudukan yang diketahui sebagai hamba Allah dan mentaati perintah-perintah-Nya, dan sesungguhan kami semua (kata malaikat) bershaf-shaf dalam ketaatan kepada Allah dan beribadah kepada-Nya, dan kami semua bertasbih kepada Allah, mensucikan-Nya atas apa yang tidak sesuai dengan kemuliaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di sini Allah Subhaanahu wa Ta'aala sebutkan perkataan malaikat Jibril ‘alaihis salam kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam ayat ini dijelaskan bahwa para malaikat berlepas diri dari apa yang dikatakan kaum musyrik tentang mereka, dan bahwa mereka adalah hamba-hamba Allah, tidak pernah bermaksiat meskipun sekejap mata. Yakni masing-masing mereka mempunyai kedudukan dan tugas yang diperintahkan Alllah, di mana ia tidak melampaui kedudukan dan tugas itu, dan mereka tidak memiliki kekuasaan apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 164",
    "description": "164-166. Malaikat bukanlah anak-anak perempuan Allah sebagaimana tuduhan orang musyrik. Mereka hanyalah hamba-hamba Allah yang patuh pada perintah-Nya. Malaikat berkata, 'dan tidak satu pun di antara kami melainkan masing-masing mempunyai kedudukan tertentu dalam melaksanakan tugas dan mengabdi kepada Allah, dan sesungguhnya kami selalu teratur dalam barisan untuk melaksanakan perintah-Nya. Dan sungguh, kami benar-benar terus bertasbih, menyucikan dan mengagungkan asma-Nya dari sifat-sifat yang tidak layak bagi-Nya"
  }
]