[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "164-166 Para malaikat berkata ”tidak seorangpun dari kami kecuali dia memiliki tempat yang sudah diketahui di langit, sesungguhnya kami berdiri berbaris dalam beribadah kepada Allah dan menaatiNya dan sesungguhnya kami menyucikan Allah dari segala yang tidak layak bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165 - 166. Sesungguhnya kami -para malaikat- berdiri berbaris dengan rapi dalam beribadah dan menaati Allah. Sesungguhnya kami menyucikan Allah dari apa yang tidak layak bagi-Nya dalam sifat-sifat dan atribut-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "166. وَإِنَّا لَنَحْنُ الْمُسَبِّحُونَ (Dan sesungguhnya kami benar-benar bertasbih) Yakni kami bertasbih dengan lisan kami dan dalam shalat kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165. – 166. Sesungguhnya kami ini adalah yang terpilih dalam barisan-barisan untuk menunaikan ketaatan. Kami senantiasa bertasbih kepada Allah dari segala yang tidak patut bagi-Nya. Dulu, manusia shalat dengan menyebar, tidak dalam barisan, sehingga Allah menurunkan ayat: “Sesungguhnya kami benar-benar bershaf-shaf.” Sehingga Nabi memerintahkan mereka shalat dengan shaf atau dalam barisan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kamilah yang benar-benar terus bertasbih} yang menyucikan Allah dari setiap hal yang tidak sesuai denganNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164-166. Di sini terdapat penjelasan tentang kebenaran para malaikat dari apa yang dikatakan oleh kaum musyrikin tentang mereka, dan bahwasanya mereka adalah juga hamba-hamba Allah yang tidak pernah mendurhakaiNya sekejap mata pun. Tiada seorang pun di antara mereka melainkan mempunyai kedudukan dan tugas mengatur yang telah diperintahkan oleh Allah kepadanya, ia tidak akan melampaui atau melanggarnya, dan mereka juga sama sekali tidak mempunyai hak perintah. “Dan sesungguhnya kami benar-benar bershaf-shaf,” dalam menaati Allah dan berbakti kepadaNya. “Dan sesungguhnya kami benar-benar bertasbih,” menyucikan Allah dari apa-apa yang tidak pantas bagiNya. Kalau sedemikian adanya maka bagaimana mereka pantas menjadi sekutu-sekutu bagi Allah? Mahasuci Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 166: 164-166. Ketahuilah bahwa para malaikat ketaatan mereka kepada Allah sempurna, maka katakan kepada mereka : Tidaklah para malaikat kecuali memiliki kedudukan yang diketahui sebagai hamba Allah dan mentaati perintah-perintah-Nya, dan sesungguhan kami semua (kata malaikat) bershaf-shaf dalam ketaatan kepada Allah dan beribadah kepada-Nya, dan kami semua bertasbih kepada Allah, mensucikan-Nya atas apa yang tidak sesuai dengan kemuliaan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, menyucikan-Nya dari segala sifat yang tidak layak bagi-Nya. Oleh karena itu, bagaimana mereka pantas menjadi sekutu bagi Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 166",
    "description": "164-166. Malaikat bukanlah anak-anak perempuan Allah sebagaimana tuduhan orang musyrik. Mereka hanyalah hamba-hamba Allah yang patuh pada perintah-Nya. Malaikat berkata, 'dan tidak satu pun di antara kami melainkan masing-masing mempunyai kedudukan tertentu dalam melaksanakan tugas dan mengabdi kepada Allah, dan sesungguhnya kami selalu teratur dalam barisan untuk melaksanakan perintah-Nya. Dan sungguh, kami benar-benar terus bertasbih, menyucikan dan mengagungkan asma-Nya dari sifat-sifat yang tidak layak bagi-Nya. 167-170. Orang-orang kafir selalu mencari pembenaran atas keka-firan mereka, tidak terkecuali mereka yang hidup sebelum nabi Muhammad. Dan sesungguhnya mereka benar-benar pernah berkata, 'sekiranya di sisi kami ada sebuah kitab dari Allah yang dibawa oleh seorang rasul sebagaimana taurat dan injil yang diturunkan kepada orang-orang dahulu, tentu kami akan menjadi hamba Allah yang disucikan dari dosa. Kami akan beriman kepada Allah, beribadah dengan ikhlas, dan tidak akan mengingkari syariat yang diturunkan kepada kami. ' tetapi, setelah Allah menurunkan Al-Qur'an kepada mereka sebagai pedoman untuk meraih kebahagiaan dunia dan akhirat, ternyata mereka mengingkarinya (lihat pula: surah f''ir/35: 42), maka kelak mereka akan mengetahui akibat keingkaran mereka itu."
  }
]