[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "167-169 Dan sesungguhnya orang-orang kafir makkah benar-benar berkata sebelum engkau diutus (wahai rasul), ”seandainya kami dikirimi kitab-kitab dan nabi-nabi yang telah dikirimkan kepada orang-orang sebelum Kami, niscaya kami menjadi hamba-hamba Allah yang benar-benar beriman, mengikhlaskan beribadah kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167 - 170. Sesungguhnya orang-orang musyrikin dari penduduk Makkah berkata sebelum Muhammad -ṣallallāhu 'alaihi wa sallam- diutus, “Seandainya kami memiliki kitab dari kitab-kitab terdahulu seperti Taurat, tentunya kami sudah mengikhlaskan ibadah kepada Allah.” Mereka berdusta terkait hal ini. Muhammad -ṣallallāhu 'alaihi wa sallam- telah datang kepada mereka, namun mereka malah kafir kepadanya. Mereka akan mengetahui apa yang mereka tunggu-tunggu, yaitu azab yang keras pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. لَكُنَّا عِبَادَ اللهِ الْمُخْلَصِينَ (benar-benar kami akan jadi hamba Allah yang dibersihkan (dari dosa)”) Yakni niscaya kami akan memurnikan ibadah hanya kepada-Nya dan kami tidak akan mengingkari-Nya. Lalu Nabi Muhammad datang kepada mereka dengan membawa al- Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169. Maka kami pasti menjadi hamba-hamba Allah yang tulus dalam beribadah kepada Allah, serta tidak melanggar syariat Allah seperti mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{niscaya kami akan menjadi hamba-hamba Allah yang ikhlas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "167-170. Allah mengabarkan bahwa kaum musyrikin itu akan menampakkan angan-angan dan mengatakan, kalau saja datang kepada kami pelajaran dan kitab seperti yang telah datang kepada orang-orang yang terdahulu, tentu kami pasti mengikhlaskan ibadah hanya kepada Allah, bahkan kami pasti menjadi orang-orang yang tulus dengan sebenar-benarnya. Sesungguhnya mereka adalah dusta dalam hal ini, karena sesungguhnya kitab yang paling utama telah datang kepada mereka, namun mereka mengingkarinya. Maka dengan demikian dapat diketahui bahwa mereka adalah orang-orang yang membangkang terhadap kebenaran. “Maka kelak mereka akan mengetahui” azab yang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 169: 167-170. Allah mengabarkan bahwasanya orang-orang musyrik arab mereka berkata : Kalau sekiranya datang kepada kami kitab dan para utusan sebagaimana orang-orang yang terdahulu, sungguh kami akan menjadi hamba Allah untuk metauhidkan-Nya serta mengikhlaskan dalam setiap ibadah. Maka ketika datang kepada mereka harapan sebagaimana yang mereka inginkan, mereka kafir dan mendustakannya, serta menolaknya; Mereka semua akan mengetahui akibat dari perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 169",
    "description": "167-170. Orang-orang kafir selalu mencari pembenaran atas keka-firan mereka, tidak terkecuali mereka yang hidup sebelum nabi Muhammad. Dan sesungguhnya mereka benar-benar pernah berkata, 'sekiranya di sisi kami ada sebuah kitab dari Allah yang dibawa oleh seorang rasul sebagaimana taurat dan injil yang diturunkan kepada orang-orang dahulu, tentu kami akan menjadi hamba Allah yang disucikan dari dosa. Kami akan beriman kepada Allah, beribadah dengan ikhlas, dan tidak akan mengingkari syariat yang diturunkan kepada kami. ' tetapi, setelah Allah menurunkan Al-Qur'an kepada mereka sebagai pedoman untuk meraih kebahagiaan dunia dan akhirat, ternyata mereka mengingkarinya (lihat pula: surah f''ir/35: 42), maka kelak mereka akan mengetahui akibat keingkaran mereka itu"
  }
]