[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Namun ketika telah datang kepada mereka berita orang-orang terdahulu dan ilmu orang-orang terakhir, dan kitab paling sempurna dan rasul yang paling utama, yaitu Muhammad saw, mereka kafir kepadanya, maka mereka akan mengetahui azab apa yang akan mereka terima di akhirat,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167 - 170. Sesungguhnya orang-orang musyrikin dari penduduk Makkah berkata sebelum Muhammad -ṣallallāhu 'alaihi wa sallam- diutus, “Seandainya kami memiliki kitab dari kitab-kitab terdahulu seperti Taurat, tentunya kami sudah mengikhlaskan ibadah kepada Allah.” Mereka berdusta terkait hal ini. Muhammad -ṣallallāhu 'alaihi wa sallam- telah datang kepada mereka, namun mereka malah kafir kepadanya. Mereka akan mengetahui apa yang mereka tunggu-tunggu, yaitu azab yang keras pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "170. Akan tetapi ketika datang kepada mereka ilmu yang telah mendatangi umat-umat terdahulu dengan diutusnya Nabi Muhammad dan diturunkannya al-Qur’an sebagaimana yang mereka inginkan, mereka malah mengingkari semua itu. Mereka akan mengetahui akibat dari kekafiran mereka terhadap Allah dan rasulnya, berupa azab di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. فَكَفَرُوا۟ بِهِۦ ۖ فَسَوْفَ يَعْلَمُونَ (Tetapi mereka mengingkarinya (Al Quran); maka kelak mereka akan mengetahui) Yakni mengetahui akibat kekafiran mereka dan kesudahannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170. Tetapi ketika Alquran disampaikan kepada mereka mengingkari lantas mengingkarinya. Kelak mereka akan mengetahui akibat atas kekafiran mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka mengingkarinya} kitab tersebut {Maka kelak mereka akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "167-170. Allah mengabarkan bahwa kaum musyrikin itu akan menampakkan angan-angan dan mengatakan, kalau saja datang kepada kami pelajaran dan kitab seperti yang telah datang kepada orang-orang yang terdahulu, tentu kami pasti mengikhlaskan ibadah hanya kepada Allah, bahkan kami pasti menjadi orang-orang yang tulus dengan sebenar-benarnya. Sesungguhnya mereka adalah dusta dalam hal ini, karena sesungguhnya kitab yang paling utama telah datang kepada mereka, namun mereka mengingkarinya. Maka dengan demikian dapat diketahui bahwa mereka adalah orang-orang yang membangkang terhadap kebenaran. “Maka kelak mereka akan mengetahui” azab yang menimpa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 170: 167-170. Allah mengabarkan bahwasanya orang-orang musyrik arab mereka berkata : Kalau sekiranya datang kepada kami kitab dan para utusan sebagaimana orang-orang yang terdahulu, sungguh kami akan menjadi hamba Allah untuk metauhidkan-Nya serta mengikhlaskan dalam setiap ibadah. Maka ketika datang kepada mereka harapan sebagaimana yang mereka inginkan, mereka kafir dan mendustakannya, serta menolaknya; Mereka semua akan mengetahui akibat dari perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 170",
    "description": "167-170. Orang-orang kafir selalu mencari pembenaran atas keka-firan mereka, tidak terkecuali mereka yang hidup sebelum nabi Muhammad. Dan sesungguhnya mereka benar-benar pernah berkata, 'sekiranya di sisi kami ada sebuah kitab dari Allah yang dibawa oleh seorang rasul sebagaimana taurat dan injil yang diturunkan kepada orang-orang dahulu, tentu kami akan menjadi hamba Allah yang disucikan dari dosa. Kami akan beriman kepada Allah, beribadah dengan ikhlas, dan tidak akan mengingkari syariat yang diturunkan kepada kami. ' tetapi, setelah Allah menurunkan Al-Qur'an kepada mereka sebagai pedoman untuk meraih kebahagiaan dunia dan akhirat, ternyata mereka mengingkarinya (lihat pula: surah f''ir/35: 42), maka kelak mereka akan mengetahui akibat keingkaran mereka itu. 171-173. Sekalipun para rasul menghadapi rintangan berat dalam dakwahnya, pada akhirnya kebenaran akan menang, sesuai janji Allah. Dan sungguh, janji kami telah tetap sejak semula bagi hamba-hamba kami yang menjadi rasul, yaitu bahwa mereka itu pasti akan mendapat pertolong-an dari Allah. Dan benarlah, sesungguhnya bala tentara kami, para rasul dan pengikut mereka, itulah yang pasti menang karena telah membela agama Allah (lihat pula: surah g'fir/40: 51)."
  }
]