[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "171-173 Dan sungguh kalimat (ketetapan) Kami telah mendahului, yaitu ketetapan yang tidak akan tertolak, untuk hamba-hamba Kami para utusan, bahwa mereka akan mendapatkan kemenangan atas musuh-musuh mereka dengan hujjah dan kekuatan, dan bahwa bala tentara Kami, para mujahidin di jalan Kami, adalah orang-orang yang menang atas musuh-musuh mereka disetiap kesempatan dengan melihat kepada akibat dan akhir kehidupan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "171 - 173. Sungguh, ketetapan Kami untuk rasul-rasul Kami telah diputuskan sebelumnya bahwa mereka pasti akan ditolong menghadapi musuh-musuh mereka dengan hujah dan kekuatan yang Allah berikan kepada mereka. Dan bahwa sesungguhnya kemenangan akan diberikan kepada tentara kami yang berjuang di jalan Allah agar kalimat Allah adalah yang tertinggi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "171-173. Sungguh telah ditetapkan kalimat dan keputusan Kami yang tidak mungkin berubah, bahwa para rasul Kami adalah orang-orang yang akan mendapat pertolongan dalam menghadapi para musuh mereka dengan hujjah yang jelas dan kekuatan yang besar; dan pasukan Kami yang berjihad di jalan Kami adalah orang-orang yang mendapat kemenangan dalam melawan musuh mereka pada setiap pertempuran dari sisi kesudahannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "171. Janji Kami kepada hamba Kami yaitu para nabi dan rasul, juga para pengikutnya ungguh telah pasti di Lauh Mahfudh bahwa mereka akan mendapat pertolongan dan naungan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh janji Kami benar-benar telah tetap bagi hamba-hamba Kami yang menjadi rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171-179. Dan mereka juga jangan mengira bahwa mereka di dunia akan menang, sebab ketetapan Allah sudah ditetapkan, tidak akan bisa ditolak dan tidak pula bisa diselisihi, bagi hamba-hambaNYa, para rasul dan bala tentaranya yang beruntung, adalah bahwa merekalah yang mendapatkan pertolongan dari Rabb mereka dengan pertolongan yang sangat besar, di mana mereka dapat menegakkan agamaNya. Ini adalah suatu berita gembira yang sangat agung bagi siapa saja yang menyifatkan dirinya sebagai tentara Allah, yaitu orang-orang yang kepribadiannya lurus (konsisten) dan berperang (berjihad) bersama pemimpin yang memerintahkan untuk memerangi kaum musyrikin, maka dialah yang akan menang lagi mendapat pertolongan. Kemudian Allah memerintah RasulNya supaya berpaling dari orang-orang yang bersikap keras kepala dan tidak mau menerima kebenaran. Sesungguhunya yang tersisa hanyalah menunggu turunnya azab yang akan menimpa mereka. Maka dari itu Allah berfirman, “Dan lihatlah mereka , maka kelak mereka akan melihat,” orang-orang yang akan ditimpa azab, sebab ia pasti menimpa mereka. “Maka apabila siksaan itu turun di halaman mereka.” Artinya, menimpa mereka dan dekat dari mereka, “maka amat buruklah pagi hari yang dialami oleh orang-orang yang di peringatkan itu.” Sebab, ia adalah pagi hari yang penuh keburukan, siksaan, dan pemusnahan. Kemudian Allah mengulangi perintah berpaling dari mereka dan mengancam mereka dengan azab yang akan menimpa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 171: 171-173. Allah menghibur Nabi ﷺ dengan berkata : Telah lalu ucapan kami yang kami tidak menggantinya maupun menyelisihinya, bahwasanya sungguh bagi utusan-utusan kami, hamba-hamba kami, dan yang mengikuti mereka akan mendapatkan pertolongan, kemenangan dan kejayaan dari orang-orang yang mencela mereka, begitu juga bagi tentara kami yang berjihad di jalan Allah mentaati perintah Allah; Mereka adalah para pemenang, dengan kemenangan yang besar atas segala kondisi, mungkin mereka menang dengan pertolongan tau menang dengan syahid yang Allah terima amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Demikian pula, janganlah orang-orang kafir mengira bahwa mereka yang akan menang di dunia, bahkan Allah telah menetapkan, bahwa kemenangan itu akan diraih oleh hamba-hamba-Nya yang beriman, yang terdiri dari para rasul dan pengikut-pengikutnya. Mereka nanti akan dapat menegakkan agamanya. Ayat ini merupakan kabar gembira bagi mereka yang menjadi tentara Allah yang keadaannya lurus di atas syariat-Nya dan berperang di jalan-Nya, bahwa nanti mereka akan menang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 171",
    "description": "171-173. Sekalipun para rasul menghadapi rintangan berat dalam dakwahnya, pada akhirnya kebenaran akan menang, sesuai janji Allah. Dan sungguh, janji kami telah tetap sejak semula bagi hamba-hamba kami yang menjadi rasul, yaitu bahwa mereka itu pasti akan mendapat pertolong-an dari Allah. Dan benarlah, sesungguhnya bala tentara kami, para rasul dan pengikut mereka, itulah yang pasti menang karena telah membela agama Allah (lihat pula: surah g'fir/40: 51)"
  }
]