[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "174-175 Maka berpalinglah (wahi rasul) dari orang-orang yang menentang dan tidak menerima kebenaran sehingga waktu yang Aku berikan kepada mereka habis dan perintah Allah yang berisi azab tiba. lihatlah dan perhatikanlah azab apa yang akan menimpa mereka akibat penyelisihan mereka terhadapmu? mereka akan melihat azab Allah yang akan turun menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Lihatlah kepada mereka manakala azab turun menimpa mereka, maka mereka akan membuka mata mereka pada saat hal itu tidak lagi berguna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "175. وَأَبْصِرْهُمْ (Dan lihatlah mereka) Yakni jika mereka telah ditimpa oleh azab berupa terbunuh dalam perang atau tertawan. فَسَوْفَ يُبْصِرُونَ (maka kelak mereka akan melihat (azab itu)) Saat penglihatan tidak lagi bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "175. Lihatlah ketika mereka menerima dan merasakan azab Allah. Mereka akan melihat akibat atas kekufuran mereka dan akan menerima akibat perbuatan buruk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lihatlah mereka} lihatlah mereka ketika datang azab kepada mereka {Lalu kelak mereka akan melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171-179. Dan mereka juga jangan mengira bahwa mereka di dunia akan menang, sebab ketetapan Allah sudah ditetapkan, tidak akan bisa ditolak dan tidak pula bisa diselisihi, bagi hamba-hambaNYa, para rasul dan bala tentaranya yang beruntung, adalah bahwa merekalah yang mendapatkan pertolongan dari Rabb mereka dengan pertolongan yang sangat besar, di mana mereka dapat menegakkan agamaNya. Ini adalah suatu berita gembira yang sangat agung bagi siapa saja yang menyifatkan dirinya sebagai tentara Allah, yaitu orang-orang yang kepribadiannya lurus (konsisten) dan berperang (berjihad) bersama pemimpin yang memerintahkan untuk memerangi kaum musyrikin, maka dialah yang akan menang lagi mendapat pertolongan. Kemudian Allah memerintah RasulNya supaya berpaling dari orang-orang yang bersikap keras kepala dan tidak mau menerima kebenaran. Sesungguhunya yang tersisa hanyalah menunggu turunnya azab yang akan menimpa mereka. Maka dari itu Allah berfirman, “Dan lihatlah mereka , maka kelak mereka akan melihat,” orang-orang yang akan ditimpa azab, sebab ia pasti menimpa mereka. “Maka apabila siksaan itu turun di halaman mereka.” Artinya, menimpa mereka dan dekat dari mereka, “maka amat buruklah pagi hari yang dialami oleh orang-orang yang di peringatkan itu.” Sebab, ia adalah pagi hari yang penuh keburukan, siksaan, dan pemusnahan. Kemudian Allah mengulangi perintah berpaling dari mereka dan mengancam mereka dengan azab yang akan menimpa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 175: 174-175. Allah memerintahkan Nabi Muhammad ﷺ agar berpaling dari orang-orang yang mendustakan dan sombong dalam waktu yang ditentukan, mereka akan melihat adzab yang layak ditimpakan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ketika azab turun kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 175",
    "description": "174-176. Wahai nabi Muhammad, demikianlah janji Allah. Maka berpalinglah engkau dari mereka yang musyrik itu sampai waktu tertentu, yaitu waktu datangnya azab bagi mereka di dunia atau datangnya du-kungan Allah yang menguatkan dan memenangkanmu atas mereka. Dan perlihatkanlah kepada mereka gambaran azab yang akan Allah timpakan kepada orang-orang yang ingkar, maka kelak mereka akan melihat dan merasakan azab itu. Setelah engkau laksanakan perintah Allah tersebut, maka perhatikanlah apakah mereka merasa takut atau bergeming seraya meminta kepadamu, dengan nada mengejek, agar azab kami disegerakan menimpa mereka"
  }
]