[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "176-177 apakah mereka meminta kepadamu (wahai rasul) disegerakanya azab Kami atas mereka? bila azab Kami turun kepada mereka, maka seburuk-buruk waktu pagi adalah waktu pagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "176. Apakah orang-orang musyrikin itu meminta disegerakannya azab Allah?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "176-179. Hai Rasulullah, apakah mereka menuntutmu agar menyegerakan azab Kami bagi mereka?! Tidak perlu mereka menganggap itu tidak mungkin. Dan azab Kami jika telah menimpa oarng-orang yang mendustakan maka itu akan menjadi seburuk-buruk hari mereka. Maka berpalinglah dari mereka hingga Allah menurunkan azab-Nya bagi mereka, dan tunggulah hari itu; mereka pasti akan menyaksikannya azab yang menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "176. أَفَبِعَذَابِنَا يَسْتَعْجِلُونَ (Maka apakah mereka meminta supaya siksa Kami disegerakan?) Akibat besarnya pendustaan mereka hingga mereka berkata: “kapan azab ini akan datang?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "176. Apakah mereka semua ingin azab segera diturunkan untuk mereka dengan mengatakan: “Kapan azab yang dimaksud itu akan turun, atau kapan hari akhirat itu akan datang?” Itulah ancaman untuk mereka. Mereka berkata: “Wahai Muhammad, tunjukkanlah kepada kami azab yang engkau ancamkan kepada kami. Segerakan saja itu untuk kami ini.” Sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah mereka meminta agar azab Kami disegerakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171-179. Dan mereka juga jangan mengira bahwa mereka di dunia akan menang, sebab ketetapan Allah sudah ditetapkan, tidak akan bisa ditolak dan tidak pula bisa diselisihi, bagi hamba-hambaNYa, para rasul dan bala tentaranya yang beruntung, adalah bahwa merekalah yang mendapatkan pertolongan dari Rabb mereka dengan pertolongan yang sangat besar, di mana mereka dapat menegakkan agamaNya. Ini adalah suatu berita gembira yang sangat agung bagi siapa saja yang menyifatkan dirinya sebagai tentara Allah, yaitu orang-orang yang kepribadiannya lurus (konsisten) dan berperang (berjihad) bersama pemimpin yang memerintahkan untuk memerangi kaum musyrikin, maka dialah yang akan menang lagi mendapat pertolongan. Kemudian Allah memerintah RasulNya supaya berpaling dari orang-orang yang bersikap keras kepala dan tidak mau menerima kebenaran. Sesungguhunya yang tersisa hanyalah menunggu turunnya azab yang akan menimpa mereka. Maka dari itu Allah berfirman, “Dan lihatlah mereka , maka kelak mereka akan melihat,” orang-orang yang akan ditimpa azab, sebab ia pasti menimpa mereka. “Maka apabila siksaan itu turun di halaman mereka.” Artinya, menimpa mereka dan dekat dari mereka, “maka amat buruklah pagi hari yang dialami oleh orang-orang yang di peringatkan itu.” Sebab, ia adalah pagi hari yang penuh keburukan, siksaan, dan pemusnahan. Kemudian Allah mengulangi perintah berpaling dari mereka dan mengancam mereka dengan azab yang akan menimpa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 176: 176-177. Allah bertanya dengan pertanyaan yang merendahkan : Apakah dengan adzab kami mereka ingin disegerakan bagi mereka para pendusta dan orang-orang yang sombong ?! Karena sesungguhnya jika Allah menurunkannya, maka pagi mereka akan menjadi pagi yang buruk bagi mereka, karena sebab mereka berkata : Wahai Muhammad perlihatkan padaku adzab agar kami ketakutan dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka (orang-orang musyrik) bertanya sambil mengolok-olok tentang kapan turunnya azab, maka Allah Subhaanahu wa Ta'aala berfirman mengancam mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 176",
    "description": "174-176. Wahai nabi Muhammad, demikianlah janji Allah. Maka berpalinglah engkau dari mereka yang musyrik itu sampai waktu tertentu, yaitu waktu datangnya azab bagi mereka di dunia atau datangnya du-kungan Allah yang menguatkan dan memenangkanmu atas mereka. Dan perlihatkanlah kepada mereka gambaran azab yang akan Allah timpakan kepada orang-orang yang ingkar, maka kelak mereka akan melihat dan merasakan azab itu. Setelah engkau laksanakan perintah Allah tersebut, maka perhatikanlah apakah mereka merasa takut atau bergeming seraya meminta kepadamu, dengan nada mengejek, agar azab kami disegerakan menimpa mereka. 177-179. Maka sungguh, apabila azab itu benar-benar turun di halaman atau pekarangan rumah mereka, maka sangat buruklah pagi hari tersebut bagi orang-orang yang diperingatkan itu. Mereka menyaksikan azab itu tetapi tidak mampu menyelamatkan diri dan harta mereka. Itulah hari kekalahan mereka. Dan jika mereka tetap angkuh dan sombong setelah engkau peringatkan, berpalinglah engkau dari mereka sampai waktu tertentu ketika mereka menerima azab Allah. Dan perlihatkanlah kembali gambaran azab itu kepada mereka, maka kelak mereka benar-benar akan melihat azab itu datang akibat kekafiran mereka."
  }
]