[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "178-179 Dan berpalinglah dari mereka sampai Allah menetapkan azbNya atas mereka, dan lihatlah mereka pasti mereka akan melihat azab dan siksaan yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "179. Lihatlah! Dan mereka juga akan melihat azab dan hukuman Allah yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "178 – 179. Berpalinglah dari mereka sampai suatu waktu/sebentar, dan lihatlah apa yang akan terjadi pada mereka. Mereka akan melihat akibat kekufuran mereka sendiri. Peringatan ini diulangi sebagai penekanan. Ayat 174 ‘sampai suatu saat’ sampai turunnya azab yang dijanjikan itu di dunia. Adapun ayat ini maksud dari ‘sampai suatu waktu’ adalah turunnya azab di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lihatlah kelak mereka akan melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171-179. Dan mereka juga jangan mengira bahwa mereka di dunia akan menang, sebab ketetapan Allah sudah ditetapkan, tidak akan bisa ditolak dan tidak pula bisa diselisihi, bagi hamba-hambaNYa, para rasul dan bala tentaranya yang beruntung, adalah bahwa merekalah yang mendapatkan pertolongan dari Rabb mereka dengan pertolongan yang sangat besar, di mana mereka dapat menegakkan agamaNya. Ini adalah suatu berita gembira yang sangat agung bagi siapa saja yang menyifatkan dirinya sebagai tentara Allah, yaitu orang-orang yang kepribadiannya lurus (konsisten) dan berperang (berjihad) bersama pemimpin yang memerintahkan untuk memerangi kaum musyrikin, maka dialah yang akan menang lagi mendapat pertolongan. Kemudian Allah memerintah RasulNya supaya berpaling dari orang-orang yang bersikap keras kepala dan tidak mau menerima kebenaran. Sesungguhunya yang tersisa hanyalah menunggu turunnya azab yang akan menimpa mereka. Maka dari itu Allah berfirman, “Dan lihatlah mereka , maka kelak mereka akan melihat,” orang-orang yang akan ditimpa azab, sebab ia pasti menimpa mereka. “Maka apabila siksaan itu turun di halaman mereka.” Artinya, menimpa mereka dan dekat dari mereka, “maka amat buruklah pagi hari yang dialami oleh orang-orang yang di peringatkan itu.” Sebab, ia adalah pagi hari yang penuh keburukan, siksaan, dan pemusnahan. Kemudian Allah mengulangi perintah berpaling dari mereka dan mengancam mereka dengan azab yang akan menimpa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 179: 178-179. Kemudian Allah mengulangi yang semisal dengan ayat 174-175). Allah memerintahkan Nabi Muhammad ﷺ agar berpaling dari orang-orang yang mendustakan dan sombong dalam waktu yang ditentukan, mereka akan melihat adzab yang layak ditimpakan kepada mereka. Ini semua sebelum diizinkan oleh Allah untuk berperang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diulanginya kalimat ini untuk menguatkan ancaman kepada mereka dan untuk menghibur Nabi shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 179",
    "description": "177-179. Maka sungguh, apabila azab itu benar-benar turun di halaman atau pekarangan rumah mereka, maka sangat buruklah pagi hari tersebut bagi orang-orang yang diperingatkan itu. Mereka menyaksikan azab itu tetapi tidak mampu menyelamatkan diri dan harta mereka. Itulah hari kekalahan mereka. Dan jika mereka tetap angkuh dan sombong setelah engkau peringatkan, berpalinglah engkau dari mereka sampai waktu tertentu ketika mereka menerima azab Allah. Dan perlihatkanlah kembali gambaran azab itu kepada mereka, maka kelak mereka benar-benar akan melihat azab itu datang akibat kekafiran mereka. 180-182. Mahasuci tuhanmu, pemilik kemuliaan yang hakiki, tuhan yang mahaperkasa lagi suci dari sifat tidak baik yang mereka katakan dan nisbatkan kepada-Nya. Dan Allah menyampaikan ucapan selamat sejahtera bagi para rasul pembawa risalah. Dan ungkapan yang pantas ditujukan kepada Allah adalah pengakuan bahwa segala puji hanya layak bagi Allah tuhan seluruh alam. Dia mahakuasa, maha esa, dan mahaperkasa. Dia menolong hamba-Nya yang berhak dan menyiksa siapa saja yang menentang risalah-Nya. []."
  }
]