[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah kepada mereka (wahai rasul), ”ya kalian pasti dibangkitkan dalam keadaan hina dina.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Katakanlah -wahai Rasul- untuk menjawab mereka, “Benar, kalian dibangkitkan sesudah jasad kalian menjadi tanah dan tinggal tulang-tulang yang lapuk, demikian juga nenek moyang kalian terdahulu, kalian semuanya akan dibangkitkan dalam keadaan hina dina.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-20. Hai Rasulullah, katakanlah kepada mereka: “Benar, kalian akan dibangkitkan setelah kematian dalam keadaan tunduk terhina. Kebangkitan kalian hanya membutuhkan satu tiupan saja dari malaikat, kemudian semua makhluk akan berdiri dan saling menatap, dan menyaksikan kengerian hari kiamat. Ketika itu mereka akan mengetahui kebenaran sesungguhnya dan mengakuinya; mereka akan berkata: “Binasa dan merugilah kita, ini merupakan hari pembalasan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قُلْ نَعَمْ وَأَنتُمْ دٰخِرُونَ (Katakanlah: “Ya, dan kamu akan terhina”) Benar, kalian semua akan dibangkitkan dalam keadaan rendah dan terhina."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. Apakah bapak-bapak kami terdahulu juga akan dibangkitkan bersama kami?! Wahai Rasulallah, katakanlah kepada mereka: “Betul, kalian semua akan dibangkitkan dan kalian akan menjadi orang-orang yang kecil dan rendah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah “Iya, dan kalian akan terhina”} rendah dan hina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Setelah sedemikian rupa puncak sikap yang mereka miliki, maka Allah memerintah RasulNya agar menjawab mereka dengan jawaban yang mengandung pemberian ancaman (menakut-nakuti) terhadap mereka, seraya berfirman, “Katakanlah, ‘Ya’,” kalian dan bapak-bapak kalian terdahulu akan dibangkitkan, “dan kamu akan terhina,” nista lagi tercela, kalian tidak bisa bertahan dan kalian tidak sulit bagi kukuasaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 18: 18-19. Katakan kepada mereka wahai Nabi : Betul, semuanya akan dibangkitkan setelah kematian kalian dan kalian akan terhina. Ketahuilah bahwasanya hari kebangkitan yang kalian ingkari ini tidak membutuhkan secara langsung dari Allah, maka cukup dengan sekali tiupan maka kalian akan bangkit menunggu atas keputusan kalian di padang mahsyar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kamu dan nenek moyang kamu akan dibangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 18",
    "description": "Wahai nabi Muhammad, katakanlah kepada mereka, 'ya, Allah akan membangkitkan seluruh umat manusia, dan kamu akan dibangkitkan di hadapan-Nya dalam keadaan rendah dan terhina. '19. Membangkitkan makhluk yang sudah mati bukanlah hal yang sulit bagi Allah. Maka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja, yaitu tiupan sangkakala israfil, maka seketika itu pula mereka melihatnya. Mereka akan menyaksikan betapa dahsyat hari kiamat dan azab Allah."
  }
]