[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Segala puji bagi Allah di dunia dan akhirat. Dialah yang berhak atas itu semata tiada sekutu bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "182. Segala pujian adalah milik Allah -Subḥānahu wa Ta'ālā-. Dia lah yang berhak mendapatkannya. Dia lah Rabb alam semesta seluruhnya, tidak ada yang berhak disembah selain-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "182. وَالْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ (Dan segala puji bagi Allah Tuhan seru sekalian alam) Yang telah mengutus para rasul-Nya bagi seluruh alam sebagai pemberi berita gembira dan peringatan. Pendapat lain mengatakan bahwa pujian bagi Allah ini adalah atas kebinasaan orang-orang musyrik dan pertolongan yang diberikan kepada para rasul serta atas segala kenikmatan yang telah diberikan kepada seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "182. Segala puji dan rasa syukur atas Allah Tuhan semua makhluk Yang telah memberi pertolongan kepada rasul-Nya dan membinasakan orang-orang kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "180-182. Setelah Allah menyebutkan di dalam Surat ini banyak sekali perkataan-perkataan mereka yang sangat keji yang mereka lontarkan terhadapNya, maka Allah menyucikan diriNya dari perkataan-perkataan keji itu, seraya berfirman, “Mahasuci Rabbmu,” artinya, Mahabebas dan Mahatinggi Dia “Rabb Yang mempunyai keperkasaan,” Yang tidak bisa dikalahkan, maka dari itu Dia menundukkan segala sesuatu, dan suci dari segala keburukan yang mereka sandangkan terhadapNya; “dan kesejahteraan dilimpahkan atas para rasul,” karena keselamatan mereka dari dosa-dosa dan noda-noda dan selamatnya apa yang mereka sandangkan terhadap Pencipta langit dan bumi. “Dan segala puji bagi Allah Rabb sekalian alam.” Alif dan lam (“al” pada al-hamdu) bermakna meliputi (lil istighraq). Artinmya, seluruh bentuk pujian dari berbagai sifat yang sempurna lagi agung dan perbuatan-perbuatan yang dengannya Dia mengatur semesta alam ini, melimpahkan berbagai nikmat kepada mereka, serta mengendalikan mereka dalam segala gerak dan diam mereka dan dalam seluruh kondisi mereka. Semua itu adalah milik Allah. Jadi, Dia-lah Yang Maha Qudus (suci) dari segala kekurangan, Yang Terpuji dengan segala kesempurnaan, Yang Dicintai lagi DIagungkan. Para RasulNya sejahtera dan diucapkan selamat (salam sejahtera) atas mereka, dan bagi siapa yang mengikuti mereka dalam hal ini, maka dia memperoleh kesejahtearaan di dunia dan akhirat, sedangkan bagi musuh mereka adalah kebinasaan dan bencana di dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 182: 180-182. Setelah Allah menyebutkan pengingkaran orang-orang musyrik dan kafir; Allah menutup surat ini dengan mensucikan diri-Nya dari apa yang telah mereka katakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Alif lam dalam kata “Al hamdu\" adalah untuk menunjukkan istighraq (menyeluruh). Oleh karena itu diartikan “segala puji” yang demikian karena sifat-Nya yang sempurna dan agung, perbuatan-Nya mengatur alam semesta, dan pelimpahan-Nya nikmat kepada mereka serta menghindarkan mereka dari bencana. Dia Mahasuci dari kekurangan, Maha Terpuji dalam setiap keadaan, yang berhak dicintai dan diagungkan, dan para rasul-Nya adalah orang-orang yang sejahtera dan mendapatkan salam/kesejahteraan, dan orang-orang yang mengikuti mereka akan memperoleh kesejahteraan pula di dunia dan di akhirat. Sebaliknya, bagi mereka yang memusuhinya akan memperoleh kebinasaan dan kehancuran di dunia dan di akhirat. Atas kemenangan mereka (para rasul dan pengikutnya) dan binasanya orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 182",
    "description": "180-182. Mahasuci tuhanmu, pemilik kemuliaan yang hakiki, tuhan yang mahaperkasa lagi suci dari sifat tidak baik yang mereka katakan dan nisbatkan kepada-Nya. Dan Allah menyampaikan ucapan selamat sejahtera bagi para rasul pembawa risalah. Dan ungkapan yang pantas ditujukan kepada Allah adalah pengakuan bahwa segala puji hanya layak bagi Allah tuhan seluruh alam. Dia mahakuasa, maha esa, dan mahaperkasa. Dia menolong hamba-Nya yang berhak dan menyiksa siapa saja yang menentang risalah-Nya. []1. Pada ayat terakhir surah a'-''ff't Allah menjelaskan perjuangan rasulullah dan sahabat dalam menegakkan ajaran tauhid. Meski mendapat tantangan besar, tetapi dengan kesabaran dan kegigihan me-reka akhirnya memperoleh kemenangan. Tema itu dilanjutkan dengan pembicaraan pada awal surah ini yang menegaskan bahwa upaya orang kafir menghalangi tersebarnya ajaran tauhid pasti berakhir dengan kehancuran."
  }
]