[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sesungguhnya ia hanya sekali tiupan dan mereka pun berdiri dari kubur mereka menyaksikan kengerian hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Hanya dengan sekali tiupan sangkakala (tiupan kedua), mereka semuanya melihat kengerian hari Kiamat, menantikan apa yang akan Allah lakukan terhadap mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَإِنَّمَا هِىَ زَجْرَةٌ وٰحِدَةٌ (Maka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja) Yakni tiupan sangkakala untuk membangkitkan para makhluk. فَإِذَا هُمْ يَنظُرُونَ (maka tiba-tiba mereka meIihatnya) Yakni mereka melihat azab yang akan Allah berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sesungguhnya pembangkitan itu hanya butuh satu suara yaitu tiupan kedua dari sangkakala oleh malaikat Israfil. Saat itu mereka akan melihat kiamat dan azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kebangkitan itu hanya dengan satu teriakan} satu tiupan {Maka seketika itu mereka melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “Maka sesungguhnya ia hanya satu teriakan saja” yang ditiupkan oleh Israfil pada sangkakala, “maka tiba-tiba mereka” dibangkitkan dari kuburannya, “mereka melihat,” sebagaimana penciptaan mereka semula, mereka dibangkitkan dengan seluruh bagian-bagiannya dalam keadaan kaki telanjang, badan telanjang, dan tidak bersunat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 19: 18-19. Katakan kepada mereka wahai Nabi : Betul, semuanya akan dibangkitkan setelah kematian kalian dan kalian akan terhina. Ketahuilah bahwasanya hari kebangkitan yang kalian ingkari ini tidak membutuhkan secara langsung dari Allah, maka cukup dengan sekali tiupan maka kalian akan bangkit menunggu atas keputusan kalian di padang mahsyar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan tiupan sangkakala oleh malaikat Israfil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 19",
    "description": "Membangkitkan makhluk yang sudah mati bukanlah hal yang sulit bagi Allah. Maka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja, yaitu tiupan sangkakala israfil, maka seketika itu pula mereka melihatnya. Mereka akan menyaksikan betapa dahsyat hari kiamat dan azab Allah. 20. Bisa saja orang-orang musyrik dan kafir itu mengingkari hari kebangkitan, tetapi mereka pasti akan menyesalinya di akhirat nanti. Dan mereka berkata, 'alangkah celaka kami! kiranya inilah hari pembalasan itu, di mana amal perbuatan kita akan diperhitungkan. '."
  }
]