[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan malaikat-maliakatNya yang beribadah dengan berbaris-baris sangat rapi, Allah bersumpah juga dengan malaikat-malaikat yang menggiring awan dengan perintah Allah, Allah bersumpah juga dengan malaikat-malaikat yang melantunkan dzkir kepada Allah dan firmanNya. Bahwa sesungguhnya sesembahan kalian (wahai manusia) adalah esa, tidak ada sekutu bagiNya, maka ikhlaskanlah ibadah dan ketaatan hanya kepadaNya. Allah swt bersumpah dengan makhlukNya yang Dia kehendaki. Adapun makhluk, dia hanya boleh bersumpah dengan nama Allah saja, karena sumpah dengan nama selain Allah adalah syirik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah bersumpah dengan para malaikat yang menggiring awan dan membawanya ke arah yang Allah kehendaki untuk turun hujan di sana."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. فَالزّٰجِرٰتِ (dan demi (rombongan) yang melarang) Yakni para malaikat yang mengarahkan awan. Dikatakan: زجرت الإبل والغنم (unta dan kambing itu kamu arahkan), yakni jika kamu mengarahkannya dengan suaramu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku bersumpah demi para malaikat yang berbaris-baris di langit untuk beribadah dan menunggu perintah Tuhannya. Lalu malaikat yang mengendalikan awan, yaitu mengendarainya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{demi (malaikat) yang mencegah dengan sungguh-sungguh} Aku bersumpah demi malaikat yang mengendalikan awan dan menggiringnya sesuai perintah Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4 ini sumpah dari Allah dengan malaikat-malaikatNya yang mulia dalam kondisi ibadah mereka dan pengaturan yang mereka jalankan berdasarkan izin Rabbnya, dalam menegaskan uluhiyah dan rububiyahNya, seraya berfirman, “demi rombongan yang bershaf-shaf dengan sebenar-benarnya,” maksudnya, berbaris dalam mengabdi kepada Rabbnya. Mereka adalah para malaikat. “dan demi rombongan yang melarang dengan sebenar-benarnya,” mereka adalah para malaikat yang menahan awan dan lain-lain berdasarkan perintah Allah. “dan demi rombongan yang membacakan pelajaran,” mereka adalah para malaikat yang membacakan firman Allah oleh karena mereka selalu tunduk kepada Rabbnya dan beribadahlah di dalam pengabdian kepadaNya dan mereka tidak pernah mendurhakaiNya sekejap matapun, maka Allah bersumpah dengan mereka menegaskan uluhiyahNya, seraya berfirman “sesungguhnya sesembahanmu benar-benar Esa,” Dia tidak mempunyai sekutu di dalam status sebagai tuhan yang berhak disembah, maka dari itu ikhlaskanlah rasa cinta, takut dan harapan, serta segala bentuk ibadah kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 2: 1-4. Allah bersumpah dala permulaan surat ini dengan bersumpah dengan para malaikat, Allah berkata : Aku bersumpah dengan para malaikat yang bershaf-shaf dalam beribadah dan ketika taat atas Tuhan mereka dalam barisan-barisan yang besar sebagaimana barisan-barisan orang yang shalat. Aku bersumpah dengan malaikat yang menggiring awan agar turun hujan sebagaiamana yang diperintahkan kepada mereka. Aku bersumpah dengan malaikat yang menjadikan dan membacakan Al Qur’an yang terus menerus dengan tanpa mereka-reka. Bahwasanya Tuhanmu wahai manusia, adalah Tuhan yang satu tidak ada sekutu bagi-Nya, maka ikhlaskanlah olehmu dalam peribadatan dan tinggalkanlah sesembahan-sesembahan ini yang berbentuk maupun tidak memiliki bentuk yang engkau sembah selain Allah. Allah bersumpah sekehendak-Nya atas makhluk-Nya, adapun untuk makhluk, maka tidak dibenarkan bersumpah dengan sesuatupun selain Allah, karena sumpah kepada selain Allah adalah kesyirikan, yaitu sebagian dari syirik yang kecil dimana tidak mengeluarkan dari islam, akan tetapi yang bersumpah dalam bahaya yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu para malaikat yang mengarahkan awan atau lainnya ke tempat yang dikehendaki Allah. Disebutkan dalam sebuah hadits: عَنِ ابْنِ عَبَّاسٍ قَالَ أَقْبَلَتْ يَهُودُ إِلَى النَّبِيِّ صَلَّى اللَّهم عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا أَبَا الْقَاسِمِ أَخْبِرْنَا عَنِ الرَّعْدِ مَا هُوَ قَالَ مَلَكٌ مِنَ الْمَلَائِكَةِ مُوَكَّلٌ بِالسَّحَابِ مَعَهُ مَخَارِيقُ مِنْ نَارٍ يَسُوقُ بِهَا السَّحَابَ حَيْثُ شَاءَ اللَّهُ فَقَالُوا فَمَا هَذَا الصَّوْتُ الَّذِي نَسْمَعُ قَالَ زَجْرُهُ بِالسَّحَابِ إِذَا زَجَرَهُ حَتَّى يَنْتَهِيَ إِلَى حَيْثُ أُمِرَ فَقَالُوْا صَدَقْتَ Dari Ibnu Abbas ia berkata, “Pernah datang beberapa orang yahudi kepada Nabi shallallahu 'alaihi wa sallam dan berkata, “Wahai Abul Qaasim, beritahukanlah kami tentang guruh! Apa sebenarnya dia?” Beliau menjawab: “Dia adalah salah satu malaikat Allah yang ditugaskan mengurus awan mendung, di tangannnya ada beberapa sabetan dari api, digiringnya awan dengan sabetan itu ke tempat yang Allah kehendaki.” Mereka bertanya lagi, “Lalu apa suara yang kami dengar ini?” Beliau menjawab, “Pengarahannya kepada awan ketika dia menggiringnya sampai tiba ke tempat yang diperintahkan.” Orang-orang Yahudi berkata, “Engkau benar.” (HR. Tirmidzi, dishahihkan oleh Syaikh Al Albani dalam Shahih At Tirmidzi 3/262 dan Ash Shahiihah no. 1872)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 2",
    "description": "Demi rombongan malaikat yang mencegah dengan sungguh-sungguh pelaku tindakan menyimpang, dalam rangka menegakkan aturan dan keseimbangan alam;3. Demi rombongan malaikat yang membacakan ayat-ayat yang berisi peringatan dan pelajaran yang agung, ."
  }
]