[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata, ”celaka kami, ini adalah hari perhitungan amal dan pembalasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang musyrikin yang mendustakan kebangkitan berkata, “Betapa celaka kita! Ini adalah hari pembalasan saat Allah membalas hamba-hamba-Nya atas amal perbuatan yang mereka lakukan di dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَقَالُوا۟ يٰوَيْلَنَا هٰذَا يَوْمُ الدِّينِ (Dan mereka berkata: “Aduhai celakalah kita!” Inilah hari pembalasan) Di sini kita akan dibalas atas kekafiran dan pendustaan terhadap para rasul yang telah kita lakukan. Maka para malaikat menjawab perkataan mereka: هٰذَا يَوْمُ الْفَصْلِ الَّذِى كُنتُم بِهِۦ تُكَذِّبُون"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Orang-orang musyrik yang mendustaakaan hari kiamat saat itu berkata: “Celakalah kami di hari pembalasan ini, yaitu hari perhitungan dan hari pembalasan yang mana kami dibalas sesuai amal perbuatan kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Celakalah kami} Celakalah kami {inilah hari pembalasan”} hari perhitungan dan pembalasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Dan pada saat itu mereka menampakkan penyesalan, kehinaan, dan kerugian, dan mereka mengucapkan kecelakaan, “Dan mereka berkata, ‘Aduhai celakalah kita.’ Inilah Hari pembalasan,” maka mereka mengakui apa yang dahulu di dunia mereka olok-olokkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 20: 20-21. Maka ketika mereka sampai di nereka (bagi orang-orang yang mengingkari), mereka akan berkata : Celaka bagi kami, ini adalah hari kebangkitan dan balasan yang hakiki!! Maka dikatakan kepada mereka :Ini adalah hari dimana Allah memisahkan di antara para hamba-Nya, ini adalah hari kebangkitan yang kalian telah dustakan dan juga ingkari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka dibangkitkan dalam keadaan telanjang, tanpa beralas kaki dan belum disunat, dan ketika itu mereka menampakkan penyesalannya dan memberitahukan kesengsaraannya. Ketika itu, mereka mengakui sesuatu yang dahulu ketika di dunia mereka perolok-olokkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 20",
    "description": "Bisa saja orang-orang musyrik dan kafir itu mengingkari hari kebangkitan, tetapi mereka pasti akan menyesalinya di akhirat nanti. Dan mereka berkata, 'alangkah celaka kami! kiranya inilah hari pembalasan itu, di mana amal perbuatan kita akan diperhitungkan. '21. Dikatakan kepada mereka, 'inilah hari keputusan yang dahulu kamu dustakan. Pada hari ini Allah akan memberi keputusan dan balasan atas semua keingkaranmu. '."
  }
]