[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dikatakan kepada mereka ”ini adalah hari keputusan diantara manusia dengan keadilan yang dulu kalian dustakan dan kalian ingkari di dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka dikatakan kepada mereka, “Ini adalah hari keputusan di antara hamba-hamba yang dulu kalian ingkari dan dustakan di dunia.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Maka akan dikatakan kepada mereka: “Ini merupakan hari diputuskan perkara antar makhluk dengan adil, hari yang dahulu kalian dustakan di dunia. Pada hari ini akan ditetapkan apa yang berhak kalian dapatkan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. هٰذَا يَوْمُ الْفَصْلِ الَّذِى كُنتُم بِهِۦ تُكَذِّبُونَ (Inilah hari keputusan yang kamu selalu mendustakannya) Yakni hari pemisahan dan penetapan. Sebab hari itu memisahkan antara orang yang baik dari orang yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Para malaikat berkata: “Ini adalah hari penghakiman dan penentuan keputusan antara para makhluk serta hari terpisahnya orang baik dari orang buruk yang kalian dustakan di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Inilah hari keputusan} hari pemberian keputusan di antara para makhluk {yang dahulu kalian dustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Lalu dikatakan kepada mereka, “Inilah hari keputusan” di antara manusia tentang urusan yang bersangkutan dengan TUhan mereka, yaitu berupa hak-hak dan juga di antara sesama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 21: 20-21. Maka ketika mereka sampai di nereka (bagi orang-orang yang mengingkari), mereka akan berkata : Celaka bagi kami, ini adalah hari kebangkitan dan balasan yang hakiki!! Maka dikatakan kepada mereka :Ini adalah hari dimana Allah memisahkan di antara para hamba-Nya, ini adalah hari kebangkitan yang kalian telah dustakan dan juga ingkari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hari keputusan maksudnya hari Allah Subhaanahu wa Ta'aala memberi keputusan terhadap masalah yang diperselisihkan manusia dan memberikan pembalasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 21",
    "description": "Dikatakan kepada mereka, 'inilah hari keputusan yang dahulu kamu dustakan. Pada hari ini Allah akan memberi keputusan dan balasan atas semua keingkaranmu. '22. Allah menurunkan perintah kepada malaikat, 'kumpulkanlah orang-orang yang berbuat zalim kepada dirinya dengan berbuat syirik beserta teman sejawat mereka yang menjerumuskan ke dalam kekafiran, dan bawalah serta apa yang dahulu mereka sembah, yaitu patung dan sesembahan lainnya."
  }
]