[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-24. Dan dikatakan kepada para malaikat, ”kumpulkan orang-orang yang kafir kepada Allah dan sekutu-sekutu mereka berikut tuhan-tuhan yang mereka sembah selain Allah, giringlah mereka semuanya dengan keras ke neraka jahanam, tahanlah mereka sebelum mereka sampai ke jahanam, karena mereka akan ditanya tentang amal perbuatan mereka dan perkataan-perkataan yang mereka ucapkan di dunia sebagai pengingkaran dan perendahan terhada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22-23. Kepada para Malaikat dikatakan pada hari itu, “Kumpulkanlah orang-orang musyrikin dengan kesyirikan mereka dan orang-orang yang semisal dengan mereka, yang mendukung mereka dalam mendustakan Kebangkitan, termasuk apa yang mereka sembah selain Allah berupa berhala-berhala. Tunjukkanlah kepada mereka jalan menuju Neraka dan giringlah mereka ke sana, karena Neraka adalah tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesembahan mereka selain Allah. Maka tunjukkanlah dan perkenalkanlah mereka kepada jalan menuju neraka dan giringlah mereka untuk memasukinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Selain Allah. Lalu tunjukkanlah kepada mereka} lalu tunjukkanlah dan giringlah mereka {ke jalan} jalan {menuju neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22-23. Maksudnya, apabila mereka telah berkumpul di Hari Kiamat kelak, mereka melihat dengan mata kepala apa yang dahulu mereka dustakan dan mereka melihat apa yang mereka perolok-olokkan, maka mereka diperintah supaya ke neraka yang pernah mereka dustakan itu, seraya dikatakan, “Kumpulkanlah orang-orang yang zhalim” terhadap diri mereka sendiri dengan melakukan kekafiran, syirik, dan berbagai maksiat, “bersama pasangan-pasangan (teman sejawat) mereka” yakni yang perbuatannya sejenis dengan mereka . semuanya dikumpulkan dengan orang-orang yang amal perbuatannya sejenis, “dan sembahan-sembahan yang selalu mereka sembah selain Allah,” seperti patung-patung dan para sekutu yang mereka klaim; kumpulkanlah mereka semua dan tunjukkanlah mereka “jalan ke neraka.” Maksudnya, halaulah mereka dengan keras menuju Neraka Jahanam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 23: 22-23. Kemudian Allah memerintahkan para malaikat untuk mengumpulkan mereka yang kafir dengan yang serupa dengan mereka; Maka penyembah berhala dengan penyembah berhala, pencuri dengan pencuri, pezina dengan pezina, yahudi dengan yahudi, nasrani dengan nasrani yang mereka mengklain bahwa Isa anak Allah. Inilah, mereka dikumpulkan dengan tuhan-tuhan mereka yang di dunia mereka sembah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni giringlah mereka ke arah neraka, namun sebelum masuk ke dalamnya mereka ditahan dan ditanya sebagaimana dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 23",
    "description": "Bawalah serta apa yang orang-orang musyrik itu sembah selain Allah, lalu tunjukkanlah kepada mereka jalan ke neraka dan giringlah mereka masuk ke dalamnya. '24. Allah memerintah malaikat, 'tahanlah mereka di tempat pemberhentian, sesungguhnya mereka akan ditanya tentang kebohongan dan dosa yang telah mereka lakukan di dunia. '."
  }
]