[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "22-24. Dan dikatakan kepada para malaikat, ”kumpulkan orang-orang yang kafir kepada Allah dan sekutu-sekutu mereka berikut tuhan-tuhan yang mereka sembah selain Allah, giringlah mereka semuanya dengan keras ke neraka jahanam, tahanlah mereka sebelum mereka sampai ke jahanam, karena mereka akan ditanya tentang amal perbuatan mereka dan perkataan-perkataan yang mereka ucapkan di dunia sebagai pengingkaran dan perendahan terhada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Tahanlah mereka untuk menghadapi hisab sebelum masuk Neraka, karena mereka akan ditanya, kemudian giringlah mereka ke Neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَقِفُوهُمْ ۖ إِنَّهُم مَّسْـُٔولُونَ (Dan tahanlah mereka (di tempat perhentian) karena sesungguhnya mereka akan ditanya) Yakni hentikanlah mereka untuk dihisab, kemudian arahkanlah mereka ke neraka setelah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Tahanlah mereka di tempat pemberhentian sampai mereka ditanya tentang kemaksiatan dan dosa-dosa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tahanlah mereka} tahanlah mereka untuk dihisab di sisi jalan itu {Sesungguhnya mereka akan ditanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Dan “ setelah dipastikan keputusan terhadap mereka, yaitu ke neraka dan mereka mengetahui bahwa mereka adalah termasuk para penghuni negeri kesengsaraan, maka dikatakan, “Tahanlah mereka” sebelum kalian mengantar mereka ke Jahanam, “karena sesungguhnya mereka akan ditanya” tentang kedustaan yang mereka lakukan di dunia, agar kedok mereka tampak di hadapan seluruh orang-orang yang menyaksikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 24: Allah memerintahkan para malaikat menahan orang-orang kafir sebelum memasukkan mereka ke dalam neraka, karena sebab mereka akan ditanya permasalahan yang membuat mereka menyesal dan mencela serta terhina atas apa yang mereka perbuat di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang berpendapat, bahwa mereka dihentikan di dekat shirath (jembatan yang dibentangkan di atas neraka Jahanam). Di antara mufassir ada yang berpendapat, bahwa mereka akan ditanya tentang semua ucapan dan amal mereka atau tentang Laailaahaillallah atau tentang hal yang mereka ada-adakan sewaktu di dunia agar tampak jelas kedustaan mereka di hadapan manusia. Namun dalam sebuah hadits disebutkan: لَا تَزُولُ قَدَمَا عَبْدٍ يَوْمَ الْقِيَامَةِ حَتَّى يُسْأَلَ عَنْ عُمُرِهِ فِيمَا أَفْنَاهُ وَعَنْ عِلْمِهِ فِيمَ فَعَلَ وَعَنْ مَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَعَنْ جِسْمِهِ فِيمَ أَبْلَاهُ “Tidak akan bergeser dua telapak kaki seorang hamba pada hari Kiamat sampai ia ditanya tentang umurnya untuk apa ia habiskan? Tentang ilmunya, apa saja yang telah ia kerjakan? Tentang hartanya, dari mana ia memperolehnya dan ke mana ia infakkan? Dan tentang badannya untuk hal apa ia korbankan? (HR. Tirmidzi dari Ibnu Mas’ud, dihasankan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 7299)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 24",
    "description": "Allah memerintah malaikat, 'tahanlah mereka di tempat pemberhentian, sesungguhnya mereka akan ditanya tentang kebohongan dan dosa yang telah mereka lakukan di dunia. '25. Orang-orang musyrik itu ditanya, 'mengapa kamu pada hari ini tidak saling tolong-menolong sesama kamu sebagaimana kamu saling bahu-membahu dalam berbuat ingkar''."
  }
]