[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepada mereka sebagai pengingkaran, ”mengapa sebagian dari kalian tidak menolong sebagian yang lain?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dikatakan kepada mereka sebagai celaan terhadap mereka, “Mengapa sebagian dari kalian tidak menolong sebagian yang lain sebagaimana di dunia kalian saling menolong ,dan kalian juga menyatakan bahwa berhala-berhala kalian akan menolong kalian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. مَا لَكُمْ لَا تَنَاصَرُونَ (Kenapa kamu tidak tolong menolong?) Yakni akan dikatakan kepada mereka: “mengapa kalian tidak saling menolong seperti dulu kalian di dunia?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Kenapa kalian tidak saling menolong satu sama lain yang dapat membebaskan dari siksa sebagaimana kalian di dunia?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Mengapa kalian tidak tolong-menolong} kalian tidak saling menolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Lalu dikatakan kepada mereka, “Kenapa kamu tidak tolong-menolong?” maksudnya, apa gerangan yang telah terjadi pada kalian hari ini, dan apa yang telah menyebabkan kalian tidak menolong sebagian yang lain, sebagian kalian tidak menyelamatkan sebagian yang lain setelah kalian dahulun di dunia mengklaim bahwa sembahan-sembahan kalian akan mencegah kalian dari azab, menyelamatkan kalian atau memberikan syafaatnya kepada kalian dari sisi Allah?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 25: 25-26. Dikatakan kepada mereka orang-orang kafir dengan perendahan : Mengapa kalian tidak menolong satu sama lain? Sebagaimana kalian saling tolong menolong ketika di dunia, akan tetapi kalian pada hari ini menjadi orang yang rendah, tunduk, dan lemah untuk menolong diri-diri kalian. Sungguh kalian pada hari ini menjadi orang yang tak berdaya atas apa yang Allah perintahkan, dan tidak akan kalian menjadi orang-orang yang dapat menerjang aturan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu dikatakan kepada mereka sebagai celaan. Yakni seperti keadaan kamu dengan kawanmu ketika di dunia. Atau maksudnya, mengapa sesembahan kamu tidak menolongmu padahal kamu ketika di dunia menyangka bahwa sesembahan tersebut dapat menghindarkan kamu dari azab. Tampaknya mereka tidak mampu menjawab karena diri mereka telah diliputi oleh kehinaan dan kerendahan dan mereka sudah menyerah kepada azab neraka sambil berputus asa, sehingga tidak dapat berbicara apa-apa. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Bahkan mereka pada hari itu menyerah (kepada keputusan Allah).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 25",
    "description": "Orang-orang musyrik itu ditanya, 'mengapa kamu pada hari ini tidak saling tolong-menolong sesama kamu sebagaimana kamu saling bahu-membahu dalam berbuat ingkar''26. Pada hari keputusan itu mereka tidak dapat saling membantu. Bahkan, mereka pada hari itu menyerah dan patuh pada keputusan Allah."
  }
]