[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebaliknya pada hari itu mereka tunduk kepada keputusan Allah, tidak menyelisihinya dan tidak menyimpang darinya, mereka tidak mampu menolong diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sebaliknya pada hari itu mereka tunduk kepada perintah Allah dalam kehinaan. Sebagian mereka tidak menolong sebagian yang lain karena mereka memang tidak mampu dan tidak punya jalan untuk itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. بَلْ هُمُ الْيَوْمَ مُسْتَسْلِمُونَ (Bahkan mereka pada hari itu menyerah diri) Sebab mereka tidak dapat lagi mencari jalan keluar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Bahkan pada hari itu mereka memasrahkan diri kepada perintah Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bahkan mereka pada hari itu menyerah} tunduk dan merendah pada perintah Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Seakan-akan mereka tidak bisa menjawab pertanyaan ini, sebab mereka diliputi oleh kehinaan dan kenistaan; dan mereka pun berserah diri untuk menerima azab neraka, mereka tunduk, hina, dan putus asa, dan mereka tidak bisa berbicara. Maka dari itu Allah berfirman, “Bahkan mereka pada hari itu menyerahkan diri.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 26: 25-26. Dikatakan kepada mereka orang-orang kafir dengan perendahan : Mengapa kalian tidak menolong satu sama lain? Sebagaimana kalian saling tolong menolong ketika di dunia, akan tetapi kalian pada hari ini menjadi orang yang rendah, tunduk, dan lemah untuk menolong diri-diri kalian. Sungguh kalian pada hari ini menjadi orang yang tak berdaya atas apa yang Allah perintahkan, dan tidak akan kalian menjadi orang-orang yang dapat menerjang aturan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 26",
    "description": "Pada hari keputusan itu mereka tidak dapat saling membantu. Bahkan, mereka pada hari itu menyerah dan patuh pada keputusan Allah. 27. Pada hari keputusan itu orang kafir dan musyrik tunduk menerima putusan Allah. Mereka saling bertengkar satu dengan lainnya. Dan sebagian mereka menghadap kepada sebagian yang lain, saling berbantah-bantahan dan menyalahkan."
  }
]