[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagian dari orang-orang kafir memandang sebagian yang lain mereka saling mendebat dan saling menyalahkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sebagian dari mereka menghadap sebagian lainnya untuk saling menyalahkan dan melempar tanggung jawab pada saat semua itu tidak lagi berguna sama sekali bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Sebagian orang kafir mendatangi sebagian pemimpin orang kafir untuk menuntut dan saling menyalahkan atas kesesatan yang dahulu mereka perbuat dan azab yang mereka dapatkan; mereka saling melempar tanggungjawab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Mereka berhadap hadapan satu sama lain, saling menyalahkan dan bertengkar. Mereka saling bertanya untuk mengejek dan mencaci"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagian mereka menghadap kepada sebagian lain dengan saling bertanya} mereka saling mencela dan berbantah-bantahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28. Setelah mereka dikumpulkan, juga teman-teman sejawat mereka serta sembahan-sembahannya dan mereka telah digiring ke jalan neraka serta ditahan lalu ditanya dan mereka tidak dapat menjawab, maka mereka menghadap kepada sesame mereka, lalu sebagian mereka mencela sebagian yang lain atas penyesalan dan kesesatan mereka. Maka para pengikut berkata kepada pemimpinnya, “Sesungguhnya kamulah yang datang kepada kami dari kanan,” maksudnya, dengan kekuatan dan kekuasaan hingga kalian dapat menyesatkan kami; kalau saja bukan karena kalian, tentu kami menjadi orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 27: 27-28. Sebagian dari mereka saling berdebat satu sama lain dan berkata : Sungguh kalian datang kepada kami dengan rasa aman, sedangkan kami merasa merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah mereka dikumpulkan bersama kawan mereka dan sesembahan mereka, serta digiring ke neraka, lalu mereka dihentikan dan ditanya, namun tidak mampu menjawab, maka sebagian mereka menghadap kepada sebagian yang lain dan saling menyalahkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 27",
    "description": "Pada hari keputusan itu orang kafir dan musyrik tunduk menerima putusan Allah. Mereka saling bertengkar satu dengan lainnya. Dan sebagian mereka menghadap kepada sebagian yang lain, saling berbantah-bantahan dan menyalahkan. 28. Sesungguhnya para pengikut di antara mereka berkata kepada para pemimpinnya, 'kamulah yang dahulu datang kepada kami dari kanan, yakni arah yang kami sangka membawa kebaikan. Kamu justru datang membawa tipu muslihat yang melenakan dan mengaku sebagai pihak yang benar. '."
  }
]