[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "28-29. Para pengikut berkata kepada orang-orang yang diikuti “sesungguhnya kalian mendatangi kami dari arah agama dan kebenaran, lalu kalian meminta kami untuk meremehkan perkara syariat, kalian membuat kami menjauh darinya, kalian menghiasi kesesatan kepada kami.” Lalu orang-orang yang diikuti itu menjawab kepada orang-orang yang mengikuti “perkaranya tidak seperti yang kalian sangka, karena sebenarnya hati kalian sudah mengingkari iman dan menerima kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Para pengikut berkata kepada panutan mereka, “Sesungguhnya kalian -wahai para tokoh kami- mendekati kami melalui agama dan kebenaran, lalu kalian menghiasi kekufuran, perbuatan syirik kepada Allah dan perbuatan maksiat. Kalian membuat kami menjauh dari kebenaran yang dibawa oleh para rasul dari sisi Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Para pengikut berkata kepada para pemimpin: “Dahulu kalian mendatangi kami dengan jalan agama, kebenaran, dan kekuatan. Kalian meminta kami untuk tidak mempedulikan agama dan meniggalkannya, dan menghiasi kesesatan dan kemaksiatan kepada kami, sehingga kami terjerumus di dalamnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قَالُوٓا۟ إِنَّكُمْ كُنتُمْ تَأْتُونَنَا عَنِ الْيَمِينِ (Pengikut-pengikut mereka berkata (kepada pemimpin-pemimpin mereka): “Sesungguhnya kamulah yang datang kepada kami dan kanan) Yakni kalian memperdaya kami bahwa agama dan kebenaran merupakan apa yang kalian sesatkan kami kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Para pengikut mereka berkata kepada para pemipin: “Kalian mendatangi dengan martabat yang kuat, lalu membawa kami menuju kekufuran. Sesungguhnya kalian menyesatkan kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata} para pengikut berkata kepada para pemimpinnya {“Sesungguhnya kalian selalu mendatangi kami dari arah kanan} dalam urusan agama, lalu kalian membuat terasa indah suatu kebathilan untuk kami, dan membuat kami lari dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28. Setelah mereka dikumpulkan, juga teman-teman sejawat mereka serta sembahan-sembahannya dan mereka telah digiring ke jalan neraka serta ditahan lalu ditanya dan mereka tidak dapat menjawab, maka mereka menghadap kepada sesame mereka, lalu sebagian mereka mencela sebagian yang lain atas penyesalan dan kesesatan mereka. Maka para pengikut berkata kepada pemimpinnya, “Sesungguhnya kamulah yang datang kepada kami dari kanan,” maksudnya, dengan kekuatan dan kekuasaan hingga kalian dapat menyesatkan kami; kalau saja bukan karena kalian, tentu kami menjadi orang-orang yang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 28: 27-28. Sebagian dari mereka saling berdebat satu sama lain dan berkata : Sungguh kalian datang kepada kami dengan rasa aman, sedangkan kami merasa merugi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, para pemimpin itu menyesatkan para pengikutnya dengan tipu muslihat yang mengikat hati seakan-akan mereka berada di atas yang benar sehingga mereka (para pengikut) mengikutinya. Atau bisa juga maksudnya, bahwa para pemimpin itu datang kepada para pengikutnya dengan kekuatan lalu mereka (para pengikut) mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 28",
    "description": "Sesungguhnya para pengikut di antara mereka berkata kepada para pemimpinnya, 'kamulah yang dahulu datang kepada kami dari kanan, yakni arah yang kami sangka membawa kebaikan. Kamu justru datang membawa tipu muslihat yang melenakan dan mengaku sebagai pihak yang benar. '29. Para pemimpin mereka enggan disalahkan. Mereka menjawab, 'tidak, bahkan kamu sendiri-lah yang sejak dahulu tidak ingin menjadi orang mukmin."
  }
]