[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami sendiri tidak memiliki hujjah atau kekuatan atas kalian sehingga kami menghalang-halangi kalian dari iman, justru kalian (wahai orang-orang musyrik) adalah kaum yang melampaui batas dari jalan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Kami (para panutan) tidak memiliki kekuasaan dan wewenang atas kalian sehingga kami bisa menjerumuskan kalian ke dalam kekufuran, kesyirikan dan kemaksiatan, sebaliknya kalian sendiri adalah orang-orang yang melampaui batas dalam urusan kekufuran dan kesesatan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. “Dan kami tidak memiliki kuasa atas kalian untuk memaksa kalian, tidak pula memiliki bukti untuk membujuk kalian. Akan tetapi kalian memang sudah merupakan orang-orang yang zalim dan pembuat dosa; kalian telah memiliki keinginan untuk bermaksiat dan menjadi kafir, oleh sebab itu kalian mau menerima dan mengikuti kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَمَا كَانَ لَنَا عَلَيْكُم مِّن سُلْطٰنٍۭ ۖ (Dan sekali-kali kami tidak berkuasa terhadapmu) Yakni kami tidak memaksa kalian untuk mengikuti kami dalam kekafiran. بَلْ كُنتُمْ قَوْمًا طٰغِينَ(bahkan kamulah kaum yang melampaui batas) Yakni benar-benar dalam kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kami juga tidak memerintah dan memaksa kalian. Akan tetapi kalian memang kaum yang memilih kekufuran dan kezalimannya melampaui batas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami sedikit pun tidak berkuasa terhadap kalian} berkuasa dan unggul sehingga kami bisa memaksa kalian untuk menjadi pengikut kami {bahkan kalian adalah kaum yang melampaui batas} melampaui batas dalam kekufuran dan kesesatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-32. “Mereka menjawab” kepada mereka, “Sebenarnya kamulah yang tidak mau beriman.” Maksudnya, kalian tetap sebagai orang-orang musyrik sebagaimana kalian adalah orang-orang musyrik, lalu apa yang mengutamakan kalian atas kami?! Apa pula yang mengharuskan kami tercela?! “Dan” sesungguhnya “sekali-kali kami tidak berkuasa terhadapmu,” artinya, kami tidak memiliki kekuasaan untuk memaksa kalian memilih kekafiran, “bahkan kamulah kaum yang melampaui batas,” kalian melampaui batas, “maka pastilah terhadap kita,” berlaku terhadap kami dan kalian, “putusan Rabb kita; sesungguhnya kita akan merasakan,” azab. Maksudnya, sudah pasti menimpa kami keputusan Rabb kita dan hukumNYa, kami dan kalian akan merasakan azab dan sama-sama di dalam hukuman. “Maka” karena itu, “kami telah menyesatkan kamu, sesungguhnya kami adalah orang-orang yang sesat.” Maksudnya, kami telah mengajak kalian kepada jalan hidup yang kami anut, yaitu kesesatan, lalu kalian memenuhi seruan kami, maka kalian jangan mencela kami, tetapi celalah diri kalian sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 30: 29-30. Maka para pengikut mereka membantah : Urusannya tidak sebagaimana kalian klaim, akan tetapi kalian yang melarang kami beriman dan lebih memilih di atas kekufuran dan maksiat. Bahkan kalian adalah kaum yang pada diri kalian terdapat keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk memaksamu mengikuti kami. Yakni sesat seperti kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 30",
    "description": "Sedangkan kami tidak berkuasa apalagi memaksa terhadapmu, bahkan kamu sendiri yang memilih menjadi kaum yang melampaui batas dalam kesesatanmu. 31. Maka, sebagai balasan atas kekafiran dan kedurhakaan kita bersama, pantas bila putusan dan azab tuhan menimpa kita; dan pasti kita semua akan merasakan azab itu."
  }
]