[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka kita semuanya pasti mendapatkan ancaman tuhan kita, kita sama-sama akan merasakan azab, kami dengan kalian, akibat dari apa yang telah kita lakukan berupa dosa-dosa dan kemaksiatan-kemaksiatan kita di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Maka ancaman Allah berlaku untuk kami dan untuk kalian dalam firman-Nya, “Aku pasti akan memenuhi Jahanam denganmu dan orang-orang yang mengikutimu seluruhnya.” (Ṣād: 85). Kemudian kami pasti merasakan -tanpa diragukan lagi- apa yang telah Rabb kami ancamkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-32. Kemudian para pemimpin itu melanjutkan ucapannya kepada para pengikut: “Maka kita sama-sama berhak mendapat ancaman Tuhan kita, kita pasti akan merasakan azab akibat pendustaan dan kemaksiatan yang dulu kita lakukan di kehidupan dunia. Kami telah menyesatkan kalian dari agama Allah dan keimanan, dan kami telah menghiasi kebatilan bagi kalian. Kami telah tersesat sebelum kalian sehingga kami binasa akibat kesesatan itu, dan kami membinasakan kalian bersamaan dengan kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. فَحَقَّ عَلَيْنَا قَوْلُ رَبِّنَآ ۖ إِنَّا لَذَآئِقُونَ (Maka pastilah putusan (azab) Tuhan kita menimpa atas kita; sesungguhnya kita akan merasakan (azab itu)) Yakni telah diputuskan bagi kita ketetapan Tuhan kita. Yang mereka maksud adalah firman Allah: لأملأن جهنم منك وممن تبهك منهم أجمعين “Sesungguhnya Aku pasti akan memenuhi neraka Jahannam dengan jenis kamu dan dengan orang-orang yang mengikuti kamu di antara mereka kesemuanya.” (Sad:85) Maka kita pasti akan merasakan apa yang Dia janjikan bagi kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Sehingga kita semua harus menerima penghakiman Tuhan dengan siksaan. Ungkapan itu ada di ayat {La amla anna jahannama minal jinnati wannaasi ajma’iin} [QS: As-Sajdah 32/13]. Sesungguhnya kami semua adalah orang-orang yang merasakan azab akibat kekufuran dan kemaksiatan kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka putusan Tuhan benar-benar menimpa kita} pasti menimpa kita semua {Sungguh kita akan merasakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-32. “Mereka menjawab” kepada mereka, “Sebenarnya kamulah yang tidak mau beriman.” Maksudnya, kalian tetap sebagai orang-orang musyrik sebagaimana kalian adalah orang-orang musyrik, lalu apa yang mengutamakan kalian atas kami?! Apa pula yang mengharuskan kami tercela?! “Dan” sesungguhnya “sekali-kali kami tidak berkuasa terhadapmu,” artinya, kami tidak memiliki kekuasaan untuk memaksa kalian memilih kekafiran, “bahkan kamulah kaum yang melampaui batas,” kalian melampaui batas, “maka pastilah terhadap kita,” berlaku terhadap kami dan kalian, “putusan Rabb kita; sesungguhnya kita akan merasakan,” azab. Maksudnya, sudah pasti menimpa kami keputusan Rabb kita dan hukumNYa, kami dan kalian akan merasakan azab dan sama-sama di dalam hukuman. “Maka” karena itu, “kami telah menyesatkan kamu, sesungguhnya kami adalah orang-orang yang sesat.” Maksudnya, kami telah mengajak kalian kepada jalan hidup yang kami anut, yaitu kesesatan, lalu kalian memenuhi seruan kami, maka kalian jangan mencela kami, tetapi celalah diri kalian sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 31: 31-32. Berkata pengikut dan yang diikuti : Maka kami semua berhak untuk mendapatkan adzab Allah, kami dan kalian untuk sama-sama merasakan adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Putusan Allah Subhaanahu wa Ta'aala adalah firman-Nya, “Sungguh, Aku akan memenuhi neraka Jahanam dengan jin dan manusia (yang durhaka) semuanya.” (terj. Huud: 119)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 31",
    "description": "Maka, sebagai balasan atas kekafiran dan kedurhakaan kita bersama, pantas bila putusan dan azab tuhan menimpa kita; dan pasti kita semua akan merasakan azab itu. 32. Maka, kami telah menyesatkan kamu dengan mengajakmu menyekutukan Allah. Sesungguhnya kami sendiri adalah orang-orang yang sesat dan kamu pun rela mengikuti ajakan sesat kami. '."
  }
]