[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya para pengikut dan orang-orang yang diikuti sama-sama merasakan azab di hari kiamat, sebagaimana di dunia mereka sama-sama bermaksiat kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Sesungguhnya orang-orang yang mengikuti dan orang-orang yang diikuti sama-sama berserikat dalam azab pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Para pemimpin dan pengikut sama-sama akan mendapat azab pada hari kiamat, sebagaimana mereka di dunia sama-sama dalam kesesatan; akan tetapi sebagaimana firman Allah: وَلَن يَنفَعَكُمُ ٱلْيَوْمَ إِذ ظَّلَمْتُمْ أَنَّكُمْ فِى ٱلْعَذَابِ مُشْتَرِكُونَ (Harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu di hari itu karena kamu telah menganiaya (dirimu sendiri). Sesungguhnya kamu bersekutu dalam azab itu. (az- Zukhruf: 39). Jika tingkat azab mereka berbeda sesuai dengan kejahatan yang mereka lakukan, maka tidak berarti lagi kebersamaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. فَإِنَّهُمْ يَوْمَئِذٍ فِى الْعَذَابِ مُشْتَرِكُونَ (Maka sesungguhnya mereka pada hari itu bersama-sama dalam azab) Yakni orang yang mengikuti dan diikuti sama-sama berada dalam azab, sebagaimana mereka dahulu sama-sama dalam kesesatan; dan mereka tidak dapat saling menolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Sesungguhnya para pengikut dan orang yang diikuti itu pada hari kiamat itu bersama-sama diazab, sebagaimana mereka bersama-sama berada dalam kesesatan. Ini adalah salah satu firman Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka pada hari itu merasakan azab bersama-sama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Allah berfirman, “Maka sesungguhnya mereka pada hari itu,” maksudnya, pada Hari KIamat, “bersama-sama dalam azab,” sekalipun berbeda-beda kadar azab mereka tergantung kepada dosa kejahatan mereka, sebagaimana dahulu mereka sama-sama di dunia dalam kekafiran, maka sama-sama pula mereka di akhirat dalam merasakan balasannya. Maka dari itu Allah berfirman, “Sesungguhnya demikianlah Kami berbuat terhadap orang-orang yang berbuat jahat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 33: 33-36. Maka setelah mereka berdebat, Allah mengatakan bahwa mereka semua tempatnya di neraka jahannam, ini semua sebagai balasan orang-orang yang bermaksiat yang membeolehkan menerobos aturan-aturan Allah. Allah menjelaskan di antara kejahatan mereka yang di adzab adalah ketika dikatakan kepada mereka tiada Tuhan yang berhak diibadahi dengan benar mereka berlaku sombong dan sombong pula kepada yang telah datang utusan kepada mereka. Mereka berkata dengan sombong : Apakah kami harus meninggalkan tuhan-tuhan kami yang telah kami ibadahi dengan sebab laki-laki penyair, gila yang tidak dapat dipahami ucapannya ??! Yang mereka maksud adalah Rasulullah ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun tingkatan azabnya berbeda-beda sesuai besarnya dosa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 33",
    "description": "Maka sesungguhnya mereka, baik para pemimpin maupun pengikut, pada hari itu bersama-sama merasakan azab sebagaimana mereka bersekutu dalam kesesatan. 34. Sungguh, demikianlah ketetapan kami dalam memperlakukan dan memutuskan hukuman terhadap orang-orang yang berbuat dosa."
  }
]