[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya beginilah kami berbuat terhadap orang orang yang memilih untuk bermaksiat kepada Allah di dunia daripada menaatiNya sehingga kami menimpakan azab kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sebagaimana Kami menimpakan azab kepada mereka, Kami juga menimpakannya kepada para penjahat selain mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Demikianlah Kami memperlakukan orang-orang yang bermaksiat dan mendustakan, yang lebih memilih kekafiran dari pada keimanan ketika di dunia, maka Kami menimpakan mereka azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. بَلْ جَآءَ بِالْحَقِّ (Sebenarnya dia (Muhammad) telah datang membawa kebenaran) Yakni dengan membawa al-Qur’an yang mengandung tauhid, kabar gembira, dan ancaman. وَصَدَّقَ الْمُرْسَلِينَ (dan membenarkan rasul-rasul (sebelumnya)) Atas apa yang telah mereka bawa seperti tauhid, ancaman, dan keberadaan kehidupan akhirat. Dia tidak menyelisihi mereka dan tidak datang dengan hal yang belum didatangkan oleh rasul-rasul sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-35. Tindakan seperti itulah yang kami berlakukan untuk orang-orang musyrik yang memilih kekufuran selain orang-orang yang disebutkan sebelumnya. Sesungguhnya saat dikatakan kepada mereka, ucapkanlah “Tiada Tuhan selain Allah”, maka mereka enggan mengucapkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya demikianlah Kami memperlakukan orang-orang yang berbuat dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Allah berfirman, “Maka sesungguhnya mereka pada hari itu,” maksudnya, pada Hari KIamat, “bersama-sama dalam azab,” sekalipun berbeda-beda kadar azab mereka tergantung kepada dosa kejahatan mereka, sebagaimana dahulu mereka sama-sama di dunia dalam kekafiran, maka sama-sama pula mereka di akhirat dalam merasakan balasannya. Maka dari itu Allah berfirman, “Sesungguhnya demikianlah Kami berbuat terhadap orang-orang yang berbuat jahat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 34: 33-36. Maka setelah mereka berdebat, Allah mengatakan bahwa mereka semua tempatnya di neraka jahannam, ini semua sebagai balasan orang-orang yang bermaksiat yang membeolehkan menerobos aturan-aturan Allah. Allah menjelaskan di antara kejahatan mereka yang di adzab adalah ketika dikatakan kepada mereka tiada Tuhan yang berhak diibadahi dengan benar mereka berlaku sombong dan sombong pula kepada yang telah datang utusan kepada mereka. Mereka berkata dengan sombong : Apakah kami harus meninggalkan tuhan-tuhan kami yang telah kami ibadahi dengan sebab laki-laki penyair, gila yang tidak dapat dipahami ucapannya ??! Yang mereka maksud adalah Rasulullah ﷺ."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 34",
    "description": "Sungguh, demikianlah ketetapan kami dalam memperlakukan dan memutuskan hukuman terhadap orang-orang yang berbuat dosa. 35. Sungguh, dahulu apabila dikatakan kepada mereka untuk membenarkan kalimat 'l' il'ha illall'h' dengan mengakui keesaan Allah, mereka justru menentang sambil menyombongkan diri, ."
  }
]