[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu di dunia, bila dikatakan kepada mereka, ”laa ilaaha illalah” dan mereka diajak kepadanya dan diminta untuk meninggalkan apa yang bertentangan dengannya, mereka menyombongkan diri di depannya dan di depan orang yang membawanya kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Orang-orang musyrikin itu, manakala dikatakan kepada mereka, \"Lā ilāha illallāh\", diajak untuk mengamalkan konsekuensinya dan meninggalkan apa yang menyelisihinya, mereka menolak untuk menjawab ajakan tersebut dan menolak tunduk kepadanya karena menyombongkan diri dari kebenaran dan merasa tinggi hati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Sebab azab yang Kami timpakan kepada mereka adalah karena saat dikatakan kepada mereka ketika di dunia: “Katakanlah, ‘Laailaaha illaallah’ sebagai pengakuan atas keesaan Allah semata.” Maka mereka enggan mengatakan itu dan mendustakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33-36. Maka setelah mereka berdebat, Allah mengatakan bahwa mereka semua tempatnya di neraka jahannam, ini semua sebagai balasan orang-orang yang bermaksiat yang membeolehkan menerobos aturan-aturan Allah. Allah menjelaskan di antara kejahatan mereka yang di adzab adalah ketika dikatakan kepada mereka tiada Tuhan yang berhak diibadahi dengan benar mereka berlaku sombong dan sombong pula kepada yang telah datang utusan kepada mereka. Mereka berkata dengan sombong : Apakah kami harus meninggalkan tuhan-tuhan kami yang telah kami ibadahi dengan sebab laki-laki penyair, gila yang tidak dapat dipahami ucapannya ??! Yang mereka maksud adalah Rasulullah ﷺ."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya dahulu apabila dikatakan kepada mereka,“ Tidak ada Tuhan yang wajib disembah selain Allah” mereka menyombongkan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. Kemudian Allah menjelaskan bahwa kejahatan mereka telah sampai pada puncaknya dan melampaui batas puncaknya, seraya berfirman, “Sesungguhnya mereka dahulu apabila dikatakan kepada mereka, ‘La ilaha illallah’,” lalu diserukan kepadanya dan mereka diperintah supaya meninggalkan penyembahan kepada selain DIa, “mereka menyombongkan diri,” darinya dan terhadap orang yang datang membawanya. “Dan mereka berkata” dengan maksud menentangnya, “Apakah sesungguhnya kami harus meninggalkan sesembahan-sesembahan kami” yang tetap kami sembah dan juga oleh bapak-bapak kami hanya karena perkataan “seorang penyair gila?” yang mereka maksud adalah Nabi Muhammad. Mereka tidak cukup hanya berpaling darinya (semoga Allah mengazab mereka) dan tidak pula hanya mendustakan hingga mereka mencapnya dengan hukum yang paling zhalim serta menjadikannya sebagai seorang penyair yang gila, padahal mereka mengetahui bahwa beliau tidak mengenal syair dan para penyair, tidak pula cirinya dan ciri mereka. Dan sesungguhnya beliau adalah manusia yang paling berakal dan paling lurus cara pandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 35: (Sesungguhnya mereka) yaitu orang-orang tersebut; dialamatkan kepada mereka karena berdasarkan penjelasan selanjutnya yaitu (dahulu apabila dikatakan kepada mereka, \"Laa Ilaaha Illallaah\") Tiada Tuhan melainkan Allah, (mereka menyombongkan diri.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian Allah Subhaanahu wa Ta'aala menyebutkan perbuatan buruk mereka, di mana perbuatan tersebut sudah terlampaui buruk. Terhadap kalimat Laailaahaillallah dan terhadap orang yang datang membawa dan menyerukan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 35",
    "description": "Sungguh, dahulu apabila dikatakan kepada mereka untuk membenarkan kalimat 'l' il'ha illall'h' dengan mengakui keesaan Allah, mereka justru menentang sambil menyombongkan diri, 36. Dan ketika diajak untuk menyembah dan mengesakan Allah, mereka berkata, 'apakah kami harus meninggalkan sesembahan kami hanya karena seorang penyair gila''."
  }
]