[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata “apakah kami harus meninggalkan ibadah kepada tuhan-tuhan kami hanya karena ucapan seorang penyair gila? maksud mereka adalah rasululallah saw."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Mereka berkata menyodorkan hujah kekufuran mereka, “Apakah kami harus meninggalkan tuhan-tuhan yang kami sembah karena ucapan seorang penyair gila?” Maksud mereka adalah Rasulullah -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan mereka juga mengingkari ajakan untuk mengesakan Allah dengan berkata: “Apakah kami harus meninggalkan berhala-berhala kami demi menuruti perkataan seorang penyair gila dan tidak berakal?!” -yang mereka maksud adalah Nabi Muhammad-. Mereka tidak hanya mendustakannya namun juga menyebutnya dengan hal yang tidak layak baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Orang-orang musyrik pemuja berhala itu akan berkata: “Bagaimana bisa kami meninggalkan peribadatan kepada Tuhan kami hanya karena ucapan penyair gila?” Maksud mereka adalah Nabi SAW. Allah SWT menghinakan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Apakah kami harus meninggalkan sesembahan kami karena seorang penyair gila”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. Kemudian Allah menjelaskan bahwa kejahatan mereka telah sampai pada puncaknya dan melampaui batas puncaknya, seraya berfirman, “Sesungguhnya mereka dahulu apabila dikatakan kepada mereka, ‘La ilaha illallah’,” lalu diserukan kepadanya dan mereka diperintah supaya meninggalkan penyembahan kepada selain DIa, “mereka menyombongkan diri,” darinya dan terhadap orang yang datang membawanya. “Dan mereka berkata” dengan maksud menentangnya, “Apakah sesungguhnya kami harus meninggalkan sesembahan-sesembahan kami” yang tetap kami sembah dan juga oleh bapak-bapak kami hanya karena perkataan “seorang penyair gila?” yang mereka maksud adalah Nabi Muhammad. Mereka tidak cukup hanya berpaling darinya (semoga Allah mengazab mereka) dan tidak pula hanya mendustakan hingga mereka mencapnya dengan hukum yang paling zhalim serta menjadikannya sebagai seorang penyair yang gila, padahal mereka mengetahui bahwa beliau tidak mengenal syair dan para penyair, tidak pula cirinya dan ciri mereka. Dan sesungguhnya beliau adalah manusia yang paling berakal dan paling lurus cara pandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 36: 33-36. Maka setelah mereka berdebat, Allah mengatakan bahwa mereka semua tempatnya di neraka jahannam, ini semua sebagai balasan orang-orang yang bermaksiat yang membeolehkan menerobos aturan-aturan Allah. Allah menjelaskan di antara kejahatan mereka yang di adzab adalah ketika dikatakan kepada mereka tiada Tuhan yang berhak diibadahi dengan benar mereka berlaku sombong dan sombong pula kepada yang telah datang utusan kepada mereka. Mereka berkata dengan sombong : Apakah kami harus meninggalkan tuhan-tuhan kami yang telah kami ibadahi dengan sebab laki-laki penyair, gila yang tidak dapat dipahami ucapannya ??! Yang mereka maksud adalah Rasulullah ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan maksud menentangnya. Mereka tidak hanya berpaling dan mendustakan, bahkan menilai Beliau dengan penilaian yang terlampaui zalim, padahal mereka mengetahui bahwa Beliau tidak mengenal syair dan para penyair, dan Beliau adalah manusia yang paling cerdas dan paling jauh pandangannya. Tidak perlu jauh-jauh buktinya, ketika mereka berselisih tentang siapa yang berhak menaruh kembali hajar aswad, sampai mereka hampir bertikai, maka Beliau shallallahu 'alaihi wa sallam memberikan usulan yang tepat yang diterima oleh semua kalangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 36",
    "description": "Dan ketika diajak untuk menyembah dan mengesakan Allah, mereka berkata, 'apakah kami harus meninggalkan sesembahan kami hanya karena seorang penyair gila''37. Mereka menuduh nabi Muhammad sebagai penyair gila, padahal dia datang kepada mereka dengan membawa kebenaran dan membenarkan rasul-rasul sebelumnya."
  }
]