[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka dusta, Muhammad tidak seperti yang mereka katakan, sebaliknya dia datang dengan membawa al-qur’an dan tauhid, membenarkan para rasul berkaitan dengan apa-apa yang mereka kabarkan berupa syariat dan tauhid kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Sungguh mereka telah melakukan kebohongan besar. Rasulullah -ṣallallāhu 'alaihi wa sallam- bukan orang gila dan bukan seorang penyair, akan tetapi beliau datang membawa Al-Qur`ān yang mengajak kepada pengesaan Allah dan mengikuti Rasul-Nya. Beliau membenarkan para rasul terlaot apa yang mereka bawa dari sisi Allah yaitu Tauhid dan penetapan kebangkitan, beliau tidak menyelisihi mereka sedikit pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Mereka lelah berdusta; Muhammad bukanlah seperti yang mereka katakan, namun dia adalah orang yang berkata benar dan datang membawa kebenaran berupa al-Qur’an dan as-Sunnah beserta kandungannya berupa tauhid dan keimanan serta pembenaran atas apa yang dikatakan para rasul sebelumnya mengenai Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. بَلْ جَآءَ بِالْحَقِّ (Sebenarnya dia (Muhammad) telah datang membawa kebenaran) Yakni dengan membawa al-Qur’an yang mengandung tauhid, kabar gembira, dan ancaman. وَصَدَّقَ الْمُرْسَلِينَ (dan membenarkan rasul-rasul (sebelumnya)) Atas apa yang telah mereka bawa seperti tauhid, ancaman, dan keberadaan kehidupan akhirat. Dia tidak menyelisihi mereka dan tidak datang dengan hal yang belum didatangkan oleh rasul-rasul sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Akan tetapi Nabi ini membawa kebenaran yang kokoh dan bukti bukti yaitu Al-Qur’an dan ketauhidan. Dia juga menguatkan para nabi (terdahulu) dan tidak menentang asal ajaran mereka sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Padahal dia datang dengan membawa kebenaran dan membenarkan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Maka dari itu Allah berfirman mematahkan perkataan mereka, “Sebenarnya dia telah datang” maksudnya, Nabi Muhammad, “membawa kebenaran,” maksudnya, kedatangannya benar dan apa yang dibawanya juga benar, yaitu syariat dan Kitab Suci adalah haq, “dan membenarkan rasul-rasul,” maksudnya, kedatangannya membenarkan para rasul sebelumnya. Kalau saja tidak ada kedatangan dan diutusnya beliau sebagai rasul, maka para rasul itu bukan orang-orang yang jujur. Jadi, beliau adalah tanda dan mukjizat bagi setiap rasul sebelumnya, sebab mereka telah menginformasikan dan memberitakan akan kedatangan beliau, dan Allah telah mengambil janji dan sumpah mereka, yaitu jika beliau kelak datang kepada mereka, niscaya mereka kaan beriman kepadanya dan akan membelanya. Para rasul itu mengambil sumpah itu pada umat-umat mereka. Maka setelah beliau datang, tampaklah kebenaran para rasul sebelumnya dan menjadi nyata pula kedustaan orang-orang yang menyalahi para rasul itu. Kalau saja tidak ditakdirkan kedatangannya padahal para rasul itu telah memberitakannya, maka hal itu menjadi boomerang bagi kejujuran mereka. Dan beliau juga membenarkan para rasul, artinya beliau datang dengan membawa apa yang telah dibawa oleh mereka dan beliau menyeru kepada apa yang telah diserukan mereka. Beliau beriman kepada mereka dan beliau mengabarkan tentang shahihnya risalah (kerasulan), kenabian, dan syariat mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 37: 37-39. Akan tetapi ketahuilah wahai orang-orang musyrik bahwa Nabi ﷺ telah datang dengan kebenaran, dan telah dibenarkan oleh seluruh orang-orang yang telah diutus, dan dakwah seluruh utusan tersebut adalah menyeru kepada Tiada Tuhan Yang Berhak di Ibadahi Dengan Benar Selain Allah. Ketahuilah bahwa sungguh kalian akan merasakan adzab yang pedih, karena sebab kalian kufur, mendustakan Rasul ﷺ, mengolok-olok, dzalim serta bermaksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, Allah Subhaanahu wa Ta'aala membantah mereka dengan firman-Nya di atas. Kedatangan Beliau adalah hak, syariat dan kitab yang Beliau bawa adalah hak (benar). Rasul-rasul sebelumnya telah memberitakan tentang kedatangan Beliau kepada umatnya dan memerintahkan umatnya mengikuti Beliau, maka kedatangan Beliau membenarkan berita rasul-rasul sebelumnya. Tidak hanya itu, ajaran yang Beliau bawa ushul(dasar)nya sama seperti yang mereka (para rasul) bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 37",
    "description": "Mereka menuduh nabi Muhammad sebagai penyair gila, padahal dia datang kepada mereka dengan membawa kebenaran dan membenarkan rasul-rasul sebelumnya. 38. Wahai kaum musyrik, sungguh kamu pasti akan merasakan azab yang pedih di neraka akibat kekafiran, kesesatan, dan perlawananmu terhadap Allah dan rasul-Nya."
  }
]