[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di akhirt kalian tidak dibalas kecuali akibat kemaksiatan yang telah kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Kalian wahai -orang-orang musyrikin- tidak dibalas kecuali atas apa yang kalian perbuat di dunia berupa kekufuran kepada dan berbagai kelakuan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Hai orang-orang musyrik, azab yang kalian dapatkan di akhirat merupakan balasan atas kekafiran dan pendustaan kalian di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَمَا تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ (Dan kamu tidak diberi pembalasan melainkan terhadap kejahatan yang telah kamu kerjakan) Berupa kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Kalian tidak dibalas di akhirat kecuali sesuai amal perbuatan yang kalian lakukan di dunia berupa kemaksiatan dan dosa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian tidak diberi balasan, kecuali terhadap apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-39. OLeh karena perkataan mereka yang dahulu “Sesungguhnya kita akan merasakan,” yang merupakan perkataan yang berasal dari mereka, bisa berarti benar atau lainnya, maka Allah mengabarkan tentang perkataan pamungkas yang tidak mengandung makna selain kejujuran dan keyakinan, yaitu informasi yang berasal dari Allah, seraya berfirman, “Sesungguhnya kamu pasti akan merasakan azab yang pedih,” artinya, yang sangat menyakitkan, “Dan kamu tidak diberi pembalasan” di dalam penimpaan azab yang sangat pedih itu “melainkan terhadap kejahatan yang telah kamu kerjakan.” Jadi, Kami tidak menzhalimi kalian, melainkan sesungguhnya Kami berlaku adil terhadap kalian. Oleh karena lafazh sapaan (khithab) ini umum, padahal yang dimaksud adalah orang-orang musyrik, maka Allah memperkecualikan orang-orang beriman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 39: 37-39. Akan tetapi ketahuilah wahai orang-orang musyrik bahwa Nabi ﷺ telah datang dengan kebenaran, dan telah dibenarkan oleh seluruh orang-orang yang telah diutus, dan dakwah seluruh utusan tersebut adalah menyeru kepada Tiada Tuhan Yang Berhak di Ibadahi Dengan Benar Selain Allah. Ketahuilah bahwa sungguh kalian akan merasakan adzab yang pedih, karena sebab kalian kufur, mendustakan Rasul ﷺ, mengolok-olok, dzalim serta bermaksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami tidaklah menzalimimu, akan tetapi berbuat adil terhadap kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 39",
    "description": "Itulah azab bagimu, wahai kaum musyrik, dan kamu tidak diberi ba-lasan dan azab di akhirat melainkan sebagai balasan terhadap kejahatan apa saja yang telah kamu kerjakan. Allah tidak menzalimimu sedikit pun. 40. Demikianlah siksa pedih yang Allah siapkan bagi orang-orang musyrik, tetapi hamba-hamba Allah yang dibersihkan dari dosa, ."
  }
]