[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-43 Kecuali hamba-hamba Allah swt yang mengikhlasakn ibadah kepadaNya, maka Allah memberikan rahmat khusus dan murni kepada mereka. mereka adalah orang-orang yang selamat dari azab yang pedih. Orang-orang yang ikhlas itu mendapatkan rizki yang sudah diketahui yang mengalir selamanya di surga, rizki tersebut adalah buah-buahan yang bermcam-macam, mereka dimuliakan dari Allah di surga yang penuh dengan kenikmatan yang langgeng."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Akan tetapi hamba-hamba Allah yang beriman yang Allah pilih untuk beribadah kepada-Nya dan mereka mengikhlaskan ibadah kepada Allah, mereka itulah orang-orang yang selamat dari azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-43. Adapun hamba-hamba Allah yang ikhlas dalam menyembah dan mentaati-Nya, akan Allah beri mereka rahmat dan pertolongan-Nya; Allah akan menyelamatkan mereka dari azab dan memasukkan mereka ke dalam surga, memenuhi mereka dengan rezeki yang indah dilihat, nikmat rasanya, dan harum aromanya dari berbagai jenis buah-buahan. Dan segala hal di surga yang dapat di makan adalah sebagai kenikmatan dengan dibarengi kemuliaan dari Allah; sehingga mereka mendapat kenikmatan secara lahir dan batin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِلَّا عِبَادَ اللهِ الْمُخْلَصِينَ (tetapi hamba-hamba Allah yang dibersihkan (dari dosa)) Yakni orang-orang yang diistimewakan Allah dengan mentaati dan mengesakan-Nya tidak akan merasakan azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Namun hamba-hamba Allah yang ikhlas menyembah hanya kepadaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali hamba-hamba Allah yang terpilih} orang-orang yang dimurnikan oleh Allah untuk taat kepadaNya dan mereka memurnikan ibadah mereka hanya kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah berfirman, “Kecuali hamba Allah yang diberi keikhlasan,” maka mereka tidak akan merasakan azab yang pedih, sebab mereka telah mengikhlaskan amal kepada Allah, maka dari itu Allah tulus kepada mereka dan mengistimewakan mereka dengan rahmatNya dan mengaruniakan kepada mereka kelembutanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 40: 40-43. Adapun hamba Allah yang ikhlas yang mereka mengikhlaskan agama mereka kepada Allah, mereka tidak akan merasakan adzab ini, bahkan mereka akan diberikan rezeki yang besar yang tiada terputus, dan mereka akan mendapatkan buah-buahan untuk dimakan di dalam surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka tidak mendapatkan azab yang pedih itu, karena mereka mengikhlaskan amal karena Allah, maka Allah membersihkannya (dari dosa), mengistimewakan mereka dengan rahmat-Nya dan memberikan kepemurahan-Nya dengan kelembutan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 40",
    "description": "Demikianlah siksa pedih yang Allah siapkan bagi orang-orang musyrik, tetapi hamba-hamba Allah yang dibersihkan dari dosa, 41. Mereka itu memperoleh rezeki yang sudah ditentukan tanpa henti, ."
  }
]