[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-43 Kecuali hamba-hamba Allah swt yang mengikhlasakn ibadah kepadaNya, maka Allah memberikan rahmat khusus dan murni kepada mereka. mereka adalah orang-orang yang selamat dari azab yang pedih. Orang-orang yang ikhlas itu mendapatkan rizki yang sudah diketahui yang mengalir selamanya di surga, rizki tersebut adalah buah-buahan yang bermcam-macam, mereka dimuliakan dari Allah di surga yang penuh dengan kenikmatan yang langgeng."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Hamba-hamba Allah yang ikhlas itu, bagi mereka rezeki dari Allah untuk mereka, rezeki yang diketahui baik, nikmat dan langgeng."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. أُو۟لٰٓئِكَ لَهُمْ رِزْقٌ مَّعْلُومٌ (Mereka itu memperoleh rezeki yang tertentu) Bagi mereka rezeki yang diberikan Allah yang kebaikan dan kenikmatan serta kekekalannya dalam surga sudah menjadi hal yang jelas; yakni mereka akan diberi kenikmatan itu pada pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Bagi mereka itu di surga ada rejeki khusus berupa keabadian, keteraturan dan kenyamanan yang benar-benar bermanfaat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{mereka itu memperoleh rezeki yang sudah ditentukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. “Mereka itu memperoleh rizki yang tertentu,” artinya, tidak semu, melainkan ia adalah rizki yang sangat agung lagi besar yang tidak semu keadaannya dan tidak dapat dibayangkan hakikatnya. Lalu Allah memperjelasnya dengan FirmanNya, “Yaitu buah-buahan,” dari semua jenis buah-buahan yang sangat disenangi oleh jiwa karena kelezatan, warna, dan rasanya. “Dan mereka adalah orang-orang yang dimuliakan,” bukan dihinakan lagi dicela, melainkan diagungkan, dimuliakan dan dihormati. Satu sama lain memuliakan dan mereka pun dimuliakan oleh para malaikat yang mulia, mereka masuk menjumpainya dari semua pintu, dan para malaikat juga mengucapkan selamat atas diraihnya pahala yang paling menyenangkan, dan mengaruniakan kepada mereka berbagai macam karamah berupa kenikmatan hati, ruh, dan badan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 41: 40-43. Adapun hamba Allah yang ikhlas yang mereka mengikhlaskan agama mereka kepada Allah, mereka tidak akan merasakan adzab ini, bahkan mereka akan diberikan rezeki yang besar yang tiada terputus, dan mereka akan mendapatkan buah-buahan untuk dimakan di dalam surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak tersembunyi. Rezeki tersebut sangat besar dan tidak samar keadaannya, namun tidak tercapai hakikatnya. Kemudian rezeki tersebut diterangkan dengan ayat berikutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 41",
    "description": "Mereka itu memperoleh rezeki yang sudah ditentukan tanpa henti, 42. Yaitu buah-buahan yang beraneka ragam dan rasa. Dan mereka itulah orang yang dimuliakan di sisi Allah."
  }
]