[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-43 Kecuali hamba-hamba Allah swt yang mengikhlasakn ibadah kepadaNya, maka Allah memberikan rahmat khusus dan murni kepada mereka. mereka adalah orang-orang yang selamat dari azab yang pedih. Orang-orang yang ikhlas itu mendapatkan rizki yang sudah diketahui yang mengalir selamanya di surga, rizki tersebut adalah buah-buahan yang bermcam-macam, mereka dimuliakan dari Allah di surga yang penuh dengan kenikmatan yang langgeng."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Di antara rezeki tersebut adalah buah-buahan terlezat yang mereka makan dan inginkan, lebih dari itu mereka dimuliakan dengan derajat-derajat yang tinggi dan dengan melihat ke wajah Allah yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. فَوٰكِهُ ۖ (yaitu buah-buahan) Yakni segala jenis buah-buahan, sebab itu adalah makanan yang paling baik dan paling disukai oleh mereka. وَهُم مُّكْرَمُونَ(Dan mereka adalah orang-orang yang dimuliakan) Yakni bagi mereka kemualiaan yang besar dari Allah dengan diangkat kedudukan mereka di sisi-Nya, serta diberi kesempatan untuk mendengar firman-Nya dan menjumpai-Nya di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Rejeki itu adalah buah-buahan yang beragam. Mereka sangat dimuliakan di sisi Allah dan derajat mereka diangkat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yaitu buah-buahan. Mereka adalah orang-orang yang dimuliakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41-42. “Mereka itu memperoleh rizki yang tertentu,” artinya, tidak semu, melainkan ia adalah rizki yang sangat agung lagi besar yang tidak semu keadaannya dan tidak dapat dibayangkan hakikatnya. Lalu Allah memperjelasnya dengan FirmanNya, “Yaitu buah-buahan,” dari semua jenis buah-buahan yang sangat disenangi oleh jiwa karena kelezatan, warna, dan rasanya. “Dan mereka adalah orang-orang yang dimuliakan,” bukan dihinakan lagi dicela, melainkan diagungkan, dimuliakan dan dihormati. Satu sama lain memuliakan dan mereka pun dimuliakan oleh para malaikat yang mulia, mereka masuk menjumpainya dari semua pintu, dan para malaikat juga mengucapkan selamat atas diraihnya pahala yang paling menyenangkan, dan mengaruniakan kepada mereka berbagai macam karamah berupa kenikmatan hati, ruh, dan badan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 42: 40-43. Adapun hamba Allah yang ikhlas yang mereka mengikhlaskan agama mereka kepada Allah, mereka tidak akan merasakan adzab ini, bahkan mereka akan diberikan rezeki yang besar yang tiada terputus, dan mereka akan mendapatkan buah-buahan untuk dimakan di dalam surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Buah-buahan itu dimakan untuk bersenang-senang bukan untuk menjaga kesehatan, karena penghuni surga tidak perlu menjaga kesehatannya, di mana jasad mereka diciptakan untuk kekekalan. Yakni tidak dihinakan dan direndahkan, bahkan dimuliakan, dibesarkan dan dihormati baik antara sesama mereka maupun oleh malaikat, di mana para malaikat masuk menemui mereka dari setiap pintu serta mengucapkan salam. Demikian juga Tuhan mereka memuliakan mereka dan melimpahkan berbagai kemuliaan, berupa kenikmatan bagi hati, ruh maupun badan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 42",
    "description": "Yaitu buah-buahan yang beraneka ragam dan rasa. Dan mereka itulah orang yang dimuliakan di sisi Allah. 43. Mereka dimuliakan di dalam surga-surga yang penuh kenikmatan dan diiringi kegembiraan."
  }
]