[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "40-43 Kecuali hamba-hamba Allah swt yang mengikhlasakn ibadah kepadaNya, maka Allah memberikan rahmat khusus dan murni kepada mereka. mereka adalah orang-orang yang selamat dari azab yang pedih. Orang-orang yang ikhlas itu mendapatkan rizki yang sudah diketahui yang mengalir selamanya di surga, rizki tersebut adalah buah-buahan yang bermcam-macam, mereka dimuliakan dari Allah di surga yang penuh dengan kenikmatan yang langgeng."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Mereka mendapatkan semua itu di surga-surga kenikmatan yang kekal abadi tidak pernah terhenti dan terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43-44. Mereka duduk di atas dipan-dipan sembari bersandar di atasnya. Mereka saling melihat wajah satu sama lain dengan bahagia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di dalam surga-surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Di dalam surge-surga yang penuh nikmat,” yakni, surge-surga yang kekhasannya adalah kenikmatan dan cirinya adalah kesenangan. Yang demikian itu karena surge-surga itu berisi apa-apa yang belum pernah dilihat mata, tidak pula didengar oleh telinga, ataupun terlintas pada hati seorang manusia, dan ia bersih dari segala yang bisa merusak kenikmatannya dari hal-hal yang dapat mencemari dan mengotorinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 43: 40-43. Adapun hamba Allah yang ikhlas yang mereka mengikhlaskan agama mereka kepada Allah, mereka tidak akan merasakan adzab ini, bahkan mereka akan diberikan rezeki yang besar yang tiada terputus, dan mereka akan mendapatkan buah-buahan untuk dimakan di dalam surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni di dalam surga yang kenikmatan dan kesenangan menjadi sifatnya karena mencakup semua itu, di mana di dalamnya terdapat kenikmatan yang belum pernah terlihat oleh mata, belum pernah terdengar oleh telinga dan belum pernah terlintas di hati manusia, dan selamat dari segala yang mengurangi kenikmatannya. Dalam ayat ini Allah Subhaanahu wa Ta'aala sebutkan balasan secara garis besar untuk penghuni surga, dan pada ayat selanjutnya, Allah sebutkan balasannya secara rinci agar jiwa menjadi rindu untuk memperolehnya dan membuatnya semangat mengejarnya, berbeda jika hanya disebutkan secara garis besar, tentu semangatnya kurang karena masih belum jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 43",
    "description": "Mereka dimuliakan di dalam surga-surga yang penuh kenikmatan dan diiringi kegembiraan. 44. Mereka duduk berhadap-hadapan di atas dipan-dipan sambil bercengkerama."
  }
]