[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44 Dan diantara pemuliaan Allah kepada mereka dan pemuliaan sebagian dari mereka kepada sebagian yang lain adalah bahwa mereka akan berada di atas ranjang-ranjang dengan saling berhadap-hadapan di antara mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Mereka duduk nyaman di atas ranjang-ranjang yang saling hadapan, sebagian melihat sebagian lainnya, mereka berbahagia karena berjumpa dengan saudaranya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Dan bagian dari kemuliaan dan tambahan kenikmatan dari Tuhan mereka adalah mereka duduk berhadap-hadapan di atas dipan-dipan sebagai bentuk rasa kasih sayang dan persaudaraan di antara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. عَلَىٰ سُرُرٍ (di atas takhta-takhta kebesaran) Yakni dipan-dipan yang mereka gunakan untuk bersandar. مُّتَقٰبِلِينَ (berhadap-hadapan) Mereka saling berhadapan, dan setiap mereka merasa senang dengan pertemuan dengan saudaranya, dan mereka tidak saling memalingkan muka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43-44. Mereka duduk di atas dipan-dipan sembari bersandar di atasnya. Mereka saling melihat wajah satu sama lain dengan bahagia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Mereka duduk) di atas dipan-dipan dengan berhadap-hadapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Di antara kemuliaan mereka di sisi Rabb mereka dan saling hormat-menghormati satu sama lain di antara mereka adalah bahwa mereka berada di atas “tahta-tahta kebesaran,” yaitu tempat-tempat duduk yang tinggi yang terhias dengan berbagai macam kain yang termewah yang sangat indah. Mereka bersandar di atasnya dengan penuh kebahagiaan, ketenangan, dan kegembiraan, “berhadap-hadapan” di antara sesame mereka. Hati dan rasa cinta mereka sudah menjadi tulus di antara sesame mereka dan mereka bersenang-senang dengan berkumpulnya sesame mereka. Sebab sesungguhnya saling berhadapannya wajah mereka menunjukkan saling berhadapannya hati mereka dan saling menghormati satu sama lain di antara mereka. Tidak ada seorang pun yang membelakangi atau menjadikannya di samping. Bahkan termasuk kesempurnaan kebahagiaan dan etika adalah apa yang ditunjukkan oleh posisi saling berhadapan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 44: 44-49. Dan di antara sebagian dari pemuliaan Allah bagi mereka di surga, mereka duduk di tempat-tempat yang tinggi yang penuh keindahan, yang mereka dapat melihat satu sama lain. Pemuliaan Allah yang lainnya adalah adanya minuman yang beredar di antara mereka dari sungai khamr yang mengalir di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk di antara kemuliaan mereka di sisi Tuhan mereka dan pemuliaan antara sesama mereka adalah bahwa mereka berada di atas dipan-dipan, yaitu tempat duduk yang tinggi yang dihias dengan kain-kain yang mewah lagi indah dan mereka bersandar di atasnya sambil bersantai dan bergembira. Menghadapnya mereka satu sama lain menunjukkan bahwa hati mereka juga bersatu (tidak bermusuhan) dan memiliki sopan santun terhadap yang lain, mereka tidak saling membelakangi atau mengenyampingkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 44",
    "description": "Mereka duduk berhadap-hadapan di atas dipan-dipan sambil bercengkerama. 45. Dalam keadaan demikian, kepada mereka diedarkan gelas yang berisi air khamar dari mata air surga."
  }
]