[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-47 Gelas-gelas khamar dibawa berkeliling di majelis-majelis mereka dari sungai-sungai yang mengalir, mereka tidak khawatir akan terputus (habis) putih warnanya, rasanya nikmat, tidak membahayakan jasmani dan akal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Tidak seperti khamar dunia, ia tidak melenyapkan akal karena mabuk, tidak membuat peminumnya pusing, peminumnya selamat jasad dan akalnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. لَا فِيهَا غَوْلٌ (Tidak ada dalam khamar itu alkohol) Yakni khamr itu tidak merusak akal mereka sehingga tidak menghilangkan kesadaran. وَلَا هُمْ عَنْهَا يُنزَفُونَ(dan mereka tiada mabuk karenanya) Allah menghilangkan keburukan dari khamr yang ada di surga, tidak seperti khamr di dunia yang menyembabkan pusing dan mabuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dalam khamr ini tidak ada bahan alkohol yang dapat menghilangkan akal sehingga mereka tidak mabuk karenanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada di dalamnya sesuatu yang membahayakan dan mereka tidak mabuk karenanya} mereka tidak merasakan sakit perut dan tidak kehilangan akal karena meminumnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-47. “Diedarkan kepada mereka gelas yang berisi khamar dari sungai yang mengalir.” Maksudnya, anak-anak yang selalu siap membantu mereka selalu hadir membawakan minuman lezat dengan gelas-gelas yang sangat indah dipandang yang berisikan ar-rahiq al-makhtum yang beraroma minyak kasturi. Ia adalah gelas-gelas penuh dengan khamar. Khamar tersebut berbeda dengan khamar yang ada di dunia ini dari segala sisinya. Sebab, warnanya saja “putih bersih” yang merupakan warna terbaik, dan rasanya “sedap bagi orang-orang yang minum,” dirasakan kelezatannya oleh orang yang meminumnya pada saat dimimun dan sesudahnya; dan ia bebas dari unsur-unsur yang dapat menghilangkan kesadaran akal dan tidak memabukkan serta tidak menghabiskan harta pemiliknya, tidak ada rasa pusing dan teler karenanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 47: 44-49. Dan di antara sebagian dari pemuliaan Allah bagi mereka di surga, mereka duduk di tempat-tempat yang tinggi yang penuh keindahan, yang mereka dapat melihat satu sama lain. Pemuliaan Allah yang lainnya adalah adanya minuman yang beredar di antara mereka dari sungai khamr yang mengalir di surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 47",
    "description": "Tidak ada di dalamnya unsur yang memabukkan sebagaimana khamar dunia dan mereka tidak mabuk karenanya. 48. Dan di sisi mereka ada bidadari-bidadari yang bermata indah dan membatasi pandangannya hanya kepada pasangannya."
  }
]