[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-49 Di majelis mereka terdapat bidadari-bidadari yang suci, mereka tidak melihat kecuali kepada suami-suami mereka, bermata indah, seolah-olah mereka adalah telur yang terjaga yang belum tersentuh tangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Di Surga mereka mendapatkan istri-istri yang suci, pandangan mata mereka tidak menoleh kecuali kepada suami-suami mereka, mata mereka bening indah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-49. Dan di sisi para penduduk surga terdapat bidadari-bidadari yang memiliki mata yang indah, jernih seperti mutiara yang tersimpan di dalam kerangnya, putih yang terlindungi dari sentuhan tangan; dan mereka tidak memandang melainkan kepada suami-suami mereka karena mereka menjada kehormatan dan pemalu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَعِندَهُمْ قٰصِرٰتُ الطَّرْفِ (Di sisi mereka ada bidadari-bidadari yang tidak liar pandangannya) Yakni wanita-wanita yang hanya memandang suami-suaminya. عِينٌ(dan jelita matanya) Yakni mereka memiliki mata yang indah dan jelita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Bagi mereka di surga itu bidadari-bidadari sopan. Mereka membatasi pandangan mereka hanya kepada suami-suami mereka, tidak kepada yang lainnya serta matanya indah karena lebar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di sisi mereka ada (bidadari) membatasi pandangan} perempuan-perempuan suci yang membatasi pandangan pasangannya {dan bermata indah} memiliki mata indah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Setelah Allah menjelaskan makanan, minuman, dan tempat-tempat duduk mereka, di mana kebanyakan kenikmatan dan rinciannya sudah masuk dalam FirmanNya, “surge-surga yang penuh kenikmatan,” namun hal-hal tersebut dirincikan agar diketahui lalu dirindukan oleh jiwa manusia, maka Allah kemudian istri-istri mereka seraya berfirman, “Di sisi-sisi mereka ada bidadari-bidadari yang tidak liar pandangannya.” Maksudnya, di sisi para penghuni negeri kenikmatan itu di tempat-tempat dekat (sekitar) mereka ada bidadari-bidadari cantik jelita nan sempurna lagi tidak liar pandangan matanya, baik karena pandangan matanya hanya dibatasi kepada suaminya saja karena sangat menjaga kesuciannya dan tidak melampaui kepada selain suaminya, atau karena ketampanan suami dan kesempurnaannya hingga di surge itu ia tidak mencari selain dia, dan tidak suka kecuali kepadanya, atau juga karena dia mmapu membatasi pandangan suaminya hanya kepada dirinya saja, dan hal ini membuktikan kesempurnaan dan kecantikannya yang luar biasa yang membuat pandangan sang suami hanya terpaku kepadanya saja. Dan tidak liarnya pandangan mata juga menunjukkan pada tidak liarnya jiwa dan rasa kasih saying kepadanya. Kedua makna di atas sangat mungkin dan keduanya shahih. Semua ini menunjukkan ketampanan kaum lelaki dan kejelitaan wanita di dalam surge dan kecintaan satu sama lainnya dengan cinta yang membuatnya tidak berkeinginan kepada yang lain dan betapa sangat terpeliharanya kehormatan mereka semuanya, dan bahwasanya tidak ada rasa hasad (iri hati), rasa saling membenci, ataupun rasa permusuhan di sana. Hal itu terjadi karena tidak adanya faktor-faktor penyebabnya. “Dan jelita matanya.” Maksudnya, jelita dan molek matanya, sedap dilihat, “seakan-akan mereka,” yakni, bidadari-bidadari itu “adalah telur yang tersimpan dengan baik,” maksudnya, tertutup, karena kecantikan dan kebeningannya, dan warna kulit mereka adalah warna kulit yang terindah dan merona, tidak ada cacat ataupun noda."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 48: 44-49. Dan di antara sebagian dari pemuliaan Allah bagi mereka di surga, mereka duduk di tempat-tempat yang tinggi yang penuh keindahan, yang mereka dapat melihat satu sama lain. Pemuliaan Allah yang lainnya adalah adanya minuman yang beredar di antara mereka dari sungai khamr yang mengalir di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada suami mereka, yang demikian bisa karena sifat iffah (menjaga diri) yang tinggi dari mereka dan bisa juga karena gantengnya suami mereka, sehingga bidadari ini tidak meminta di surga selain meminta suaminya itu dan tidak cinta kecuali kepadanya. Bisa juga maksudnya bahwa bidadari itu membuat pandangan suami tercurah hanya kepadanya karena demikian cantiknya. Semua makna ini adalah benar, dan hal ini menunjukkan ganteng dan cantiknya penghuni surga, baik laki-laki maupun wanitanya dan saling cinta satu sama lain, dan cinta itu hanya tertuju kepada istri atau suaminya masing-masing; tidak kepada selainnya karena tingginya rasa ‘iffah mereka, dan bahwa di sana tidak ada yang iri serta tidak saling membenci, karena memang tidak ada sebab-sebabnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 48",
    "description": "Dan di sisi mereka ada bidadari-bidadari yang bermata indah dan membatasi pandangannya hanya kepada pasangannya. 49. Bidadari-bidadari itu sangat elok, seakan-akan mereka adalah telur yang tersimpan dan terjaga dengan baik dari tangan-tangan yang hendak menyentuh."
  }
]