[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48-49 Di majelis mereka terdapat bidadari-bidadari yang suci, mereka tidak melihat kecuali kepada suami-suami mereka, bermata indah, seolah-olah mereka adalah telur yang terjaga yang belum tersentuh tangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Kulit mereka putih kekuning-kuningan seperti telur burung, terjaga tidak terjamah oleh tangan siapapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. كَأَنَّهُنَّ بَيْضٌ مَّكْنُونٌ (seakan-akan mereka adalah telur (burung unta) yang tersimpan dengan baik) Allah menyerupakannya dengan telur burung unta karena induk unta yang melindungi telur itu dengan bulunya dari angin dan debu, sehingga warnanya menjadi putih kekuningan, dan ini adalah warna yang paling indah bagi wanita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Seakan-akan mereka memiliki warna bening layaknya telur burung onta yang tertutup bulu sehingga terhindar dari hembusan angin dan debu serta terlindung dan terpelihara dari genggaman tangan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seakan-akan (kulit) mereka seperti telur yang tersimpan} yang tersimpan dan belum pernah dipegang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48-49. Setelah Allah menjelaskan makanan, minuman, dan tempat-tempat duduk mereka, di mana kebanyakan kenikmatan dan rinciannya sudah masuk dalam FirmanNya, “surge-surga yang penuh kenikmatan,” namun hal-hal tersebut dirincikan agar diketahui lalu dirindukan oleh jiwa manusia, maka Allah kemudian istri-istri mereka seraya berfirman, “Di sisi-sisi mereka ada bidadari-bidadari yang tidak liar pandangannya.” Maksudnya, di sisi para penghuni negeri kenikmatan itu di tempat-tempat dekat (sekitar) mereka ada bidadari-bidadari cantik jelita nan sempurna lagi tidak liar pandangan matanya, baik karena pandangan matanya hanya dibatasi kepada suaminya saja karena sangat menjaga kesuciannya dan tidak melampaui kepada selain suaminya, atau karena ketampanan suami dan kesempurnaannya hingga di surge itu ia tidak mencari selain dia, dan tidak suka kecuali kepadanya, atau juga karena dia mmapu membatasi pandangan suaminya hanya kepada dirinya saja, dan hal ini membuktikan kesempurnaan dan kecantikannya yang luar biasa yang membuat pandangan sang suami hanya terpaku kepadanya saja. Dan tidak liarnya pandangan mata juga menunjukkan pada tidak liarnya jiwa dan rasa kasih saying kepadanya. Kedua makna di atas sangat mungkin dan keduanya shahih. Semua ini menunjukkan ketampanan kaum lelaki dan kejelitaan wanita di dalam surge dan kecintaan satu sama lainnya dengan cinta yang membuatnya tidak berkeinginan kepada yang lain dan betapa sangat terpeliharanya kehormatan mereka semuanya, dan bahwasanya tidak ada rasa hasad (iri hati), rasa saling membenci, ataupun rasa permusuhan di sana. Hal itu terjadi karena tidak adanya faktor-faktor penyebabnya. “Dan jelita matanya.” Maksudnya, jelita dan molek matanya, sedap dilihat, “seakan-akan mereka,” yakni, bidadari-bidadari itu “adalah telur yang tersimpan dengan baik,” maksudnya, tertutup, karena kecantikan dan kebeningannya, dan warna kulit mereka adalah warna kulit yang terindah dan merona, tidak ada cacat ataupun noda."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 49: 44-49. Dan di antara sebagian dari pemuliaan Allah bagi mereka di surga, mereka duduk di tempat-tempat yang tinggi yang penuh keindahan, yang mereka dapat melihat satu sama lain. Pemuliaan Allah yang lainnya adalah adanya minuman yang beredar di antara mereka dari sungai khamr yang mengalir di surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena indah, bersih dan cantiknya mereka, dan kulitnya pun putih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 49",
    "description": "Bidadari-bidadari itu sangat elok, seakan-akan mereka adalah telur yang tersimpan dan terjaga dengan baik dari tangan-tangan yang hendak menyentuh. 50. Para penghuni surga itu bertelekan di atas dipan, lalu mereka berhadap-hadapan satu sama lain sambil bercakap-cakap dan menceritakan keadaan mereka di dunia."
  }
]