[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah pencipta langit dan bumi dan apa yang ada dianatra keduanya, pengatur matahari pada tempat-tempat terbit dan terbenamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Rabb langit, Rabb bumi, Rabb apa yang ada di antara langit dan bumi, Rabb matahari di tempat terbit dan terbenamnya sepanjang tahun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Tuhan Yang Esa itu adalah Pencipta langit dan bumi serta seisinya dan apa yang ada di antaranya, Dia yang mengaturnya, mengatur matahari ketika di barat dan di timur. Semua itu merupakan tanda kekuasaan dan keesaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَرَبُّ الْمَشٰرِقِ (dan Tuhan tempat-tempat terbit matahari) Dan matahari setiap harinya memiliki tempat terbit dan tempat terbenam sesuai dengan jumlah hari pada satu tahun, setiap hari ia terbit dari satu tempat dan juga terbenam pada satu tempat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Pencipta, penguasa dan pengatur langit dan bumi serta Tuhan tempat terbitnya bintang. Maknanya tempat tnggelamnya juga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhan langit dan bumi serta apa yang ada di antara keduanya dan Tuhan tempat terbitnya matahari} terbitnya matahari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Rabb langit dan bumi dan apa yang ada di antara keduanya dan Rabb tempat-tempat terbit matahari,” maksudnya, Dia-lah pencipta semua makhluk ini, pemberi Rizki dan pengaturnya. Sebagaimana tiada sekutu bagiNya di dalam rububiyahNya ini, maka tiada sekutu pula bagiNya di dalam uluhiyahNya. Banyak sekali Allah mengukuhkan tauhid uluhiyah dengan tauhid rububiyah, sebab tauhid rububiyah menunjukan kepada tauhid uluhiyah; dan tauhid rububiyah juga telah diakui oleh orang-orang musyrik dalam ibadah, maka dari itu Allah menuntut mereka dengan apa yang mereka akui atas apa yang mereka ingkari. Dalam ayat ini, secara khusus Allah menyebutkan al-masyariq (tempat terbit matahari) karena dilalahnya kepada maghrib (tempat terbenamnya); atau karena dia merupakan tempat-tempat terbitnya bintang-bintang yang akan Dia sebutkan berikut. Maka dari itu Dia berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 5: Ketahuilah wahai manusia, bahwasanya Tuhan ini (Allah) adalah pencipta langit dan bumi, dan pencipta apa yang di antara keduanya, pencipta timurnya matahari dan baratnya; Dia adalah raja dari raja-raja yang ada. Allah mengumpulkan antara timur dan barat karena setiap harinya matahari selalu berputar di antar timur dan barat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena Dia Rabbul ‘alamin (Pencipta, Pengatur, Penguasa dan Pemberi rezeki terhadap alam semesta), maka tidak ada yang berhak disembah selain Dia. Allah Subhaanahu wa Ta'aala sering menggunakan rububiyyah-Nya untuk menunjukkan keberhakan-Nya diibadahi karena memang rububiyyah-Nya menghendaki dan menunjukkan demikian, dan lagi kaum musyrik juga mengakui rububiyyah(kepengaturan)-Nya terhadap alam semesta yang seharusnya membuat mereka beribadah hanya kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 5",
    "description": "Dialah tuhan yang menciptakan langit dan bumi dan apa yang berada di antara keduanya dan tuhan yang menciptakan tempat-tempat terbitnya matahari, bulan, bintang, planet, dan benda langit lainnya. 6. Sesungguhnya kami telah menghias langit dunia yang terdekat dengan bumi dengan hiasan bintang-bintang dan planet-planet yang begitu indah."
  }
]