[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-51 Sebagian mereka menghadap ke sebagain yang lain, bertanya tentang keadaan mereka di dunia dan apa yang mereka rasakan di sana serta apa yang Allah limpahkan berupa nikmat kepada mereka di surga, dan ini adalah dianatara bentuk kenikmatan yang sempurna. Seorang penghuni surga berkata ”Dulu di dunia aku meiliki teman akrab”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Sebagian penghuni Surga menghadap kepada sebagian lainnya, mereka saling bertanya tentang masa lalu mereka di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Para penduduk surga saling berhadap-hadapan dan berbincang tentang apa yang terjadi pada mereka ketika di dunia, dan tentang kenikmatan yang Allah berikan kepada mereka di surga. Dan perbincangan dengan orang yang sejalan merupakan kenikmatan yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Maka penduduk surga itu saling berhadapan untuk bertanya tentang keadaan mereka ketika di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagian mereka menghadap} sebagian penghuni surga menghadap {sebagian lain sembari saling bertanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-59. Setelah Allah menjelaskan kenikmatan mereka dan puncak kebahagiaan mereka dengan berbagai makanan, minuman, istri-istri yang cantik jelita, dan tempat-tempat duduk yang baik, maka Allah menjelaskan percakapan dan dialog di antara mereka tentang masalah masalah yang sudah berlalu, dan bahwasanya mereka terus dalam perbincangan dan saling bercakap-cakap hingga hal itu menyebabkan salah seorang di antara mereka berkata, “sesungguhnya aku dahulu mempunyai seorang teman” di dunia, ia mengingkari kehidupan setelah mati, dan ia mencelaku karena aku membenarkannya. dan ia mengatakan, “Apakah kamu sungguh sungguh termasuk orang orang yang membenarkan? apakah bila kita telah mati dan kita telah menjadi tanah dan tulang belulang, apakah sesungguhnya kita benar benar diberi pembalasan,?” maksudnya, apakah kita akan diberi balasan atas amal perbuatan kita?! Artinya, bagaimana kamu membenarkan perkara yang tidak mungkin ini, yang benar benar sangat aneh ini!? Yaitu, apabila kita telah tercabik cabik dan menjadi tanah dan tulang belulang kita akan dibangkitkan dan dihidukan kembali, lalu kita dihisab dan diberi pembalasan sesuai dengan amal perbuatan kita? seorang penghuni surge ini berkata kepada rekan rekannya, inilah kisah dan berita dariku dengan temanku, dan aku tetap dan terus beriman lagi meyakini, sedangkan dia tetap dan terus mendustakan lagi mengingkari kebangkitan, hingga kita mati lalu kita dibangkitkan, dan kemudian aku sampai kepada apa yang kalian lihat sekarang berupa berbagai kenikmatan yang telah diinformasikan oleh para rasul, sedangkan dia sudah tidak diragukan lagi telah sampai ada azab. Maka apakah “kalian mau meninjau “ supaya kita bisa melihatnya hingga kita makin merasa senang dan bahagia dengan apa yang sedang rasakan ini, dan agar itu benar benar menjadi pandangan dengan kasat mata!? Nampaknya bahwa di antara perihal keadaan para penghuni surge dan kebahagiaan sebagian dengan sebagian yang lain, adalah bahwa mereka pun pergi mengikutinya untuk meninjau temannya. ”Maka ia meninjau” dan melihat temannya tersebut “di tengah tengah mereka yang menyala nyala.” Maksudnya, di tengah tengah azab dan siksaannya. Azab benar benar telah mengelilinginya. Lalu orang itu berkata seraya mencela temannya atas keadaannya dan bersyukur kepada Allah atas karuniaNya, Karena telah menyelamatkan dirinya dari tipu muslihat temannya, “Demi Allah, sesungguhnya kamu benar benar hampir mencelakakanku.” Maksudnya, engkau hampir membinasakanku disebabkan kerancuan-kerancuan pemikiran yang kamu masukkan kepadaku berdasarkan anggapanmu. “JIkalau tidak karena nikmat Rabbku,” kepadaku dengan meneguhkan pendirianku pada Islam, “pastilah aku termasuk orang-orang yang diseret” di dalam azab bersamamu. “Maka apakah kita tidak akan mati melainkan hanya kematian kita yang pertama saja, dan kita tidak akan disiksa?” maksudnya, orang yang beriman itu berkata kepadanya dengan membanggakan nikmat Allah kepada para penghuni surge dengan kekal abadi dan selamat dari azab. Ini adalah bentuk kalimat Tanya yang bermakna pengukuhan dan penetapan. Dan FirmanNya, “Lalu sebagian mereka menghadap kepada sebagian yang lain sambil bercakap-cakap,” ma’mul (objek) dalam kalimat ini dihapus, sedangkan konteksnya adalah kelezatan dan kesenangan. Maka ini menunjukkan bahwa mereka bila membicarakannya dan juga tentang masalah-masalah yang diperselisihkan serta rumit. Sebagaimana sudah dimakhlumi bahwa kelezatan para ahli ilmu adalah dengan memperbincangkan ilmu dan membahasnya melebihi kelezatan-kelezatan yang terjadi dalam perbincangan masalah dunia. Di sisi ini, di dalam surge, mereka mempunyai bagian yang sangat besar, mereka dapat menyingkap berbagai kenyataan-kenyataan ilmiah di dalam surge yang tidak mungkin di ungkapkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 50: Mereka di surga saling bercakap-cakap satu sama lainnya, dan menyebutkan tentang peristiwa-peristiwa ketika di dunia, dan nikmat dari Allah yang menyelamatkan mereka dari neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang kenikmatan yang mereka peroleh dan sempurnanya kegembiraan mereka karena memperoleh makanan, minuman, bidadari dan tempat duduk yang indah, maka Allah Subhaanahu wa Ta'aala menyebutkan perbincangan mereka tentang berbagai perkara yang terjadi di masa lalu, sampai pembicaraan itu berlanjut membicarakan tentang kawannya dahulu ketika di dunia yang mengingkari kebangkitan dan pernah mencelanya karena keimanannya kepada kebangkitan. Tentang hal yang telah berlalu ketika di dunia. Menurut Syaikh As Sa’diy, dibuang objeknya (sesuatu yang ditanyakan), sedangkan keadaannya dalam keadaan senang dan gembira, menunjukkan bahwa mereka saling bertanya-tanya tentang sesuatu yang enak dibicarakan serta masalah-masalah yang terjadi perselisihan atau masih musykil. Sudah menjadi maklum, bahwa kesenangan ahli ilmu adalah bertanya tentang ilmu dan mengkajinya, bahkan lebih nikmat daripada pembicaraan tentang dunia, dan ketika itu mereka mengetahui berbagai hakikat ilmiyyah di surga yang tidak mungkin diungkapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 50",
    "description": "Para penghuni surga itu bertelekan di atas dipan, lalu mereka berhadap-hadapan satu sama lain sambil bercakap-cakap dan menceritakan keadaan mereka di dunia. 51. Berkatalah salah seorang di antara mereka, 'sesungguhnya aku di dunia dahulu pernah mempunyai seorang teman dekat, ."
  }
]