[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-51 Sebagian mereka menghadap ke sebagain yang lain, bertanya tentang keadaan mereka di dunia dan apa yang mereka rasakan di sana serta apa yang Allah limpahkan berupa nikmat kepada mereka di surga, dan ini adalah dianatara bentuk kenikmatan yang sempurna. Seorang penghuni surga berkata ”Dulu di dunia aku meiliki teman akrab”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Seseorang dari orang-orang Mukmin berkata, \"Dulu aku punya seorang teman yang mengingkari kebangkitan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-53. Salah satu dari mereka berkata: “Dahulu di dunia aku memiliki teman yang mengingkari hari kebangkitan, kemudian dia berkata kepadaku, ‘bagaimana kamu dapat percaya dengan hari kebangkitan yang mustahil akan terjadi? Dan sungguh tidak masuk akal, bagaimana jika kita mati dan menjadi tanah maka kita akan dihidupkan kembali dan mempertanggungjawabkan perbuatan kita?’”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. قَالَ قَآئِلٌ مِّنْهُمْ إِنِّى كَانَ لِى قَرِينٌ (Berkatalah salah seorang di antara mereka: “Sesungguhnya aku dahulu (di dunia) mempunyai seorang teman) Yakni temanku di dunia dahulu yang kafir dan ingkar terhadap hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Salah satu dari mereka berkata: “Aku memiliki seorang teman di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Salah seorang di antara mereka} di antara penghuni surga {berkata,“Sesungguhnya aku dahulu pernah mempunyai seorang teman} teman dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-59. Setelah Allah menjelaskan kenikmatan mereka dan puncak kebahagiaan mereka dengan berbagai makanan, minuman, istri-istri yang cantik jelita, dan tempat-tempat duduk yang baik, maka Allah menjelaskan percakapan dan dialog di antara mereka tentang masalah masalah yang sudah berlalu, dan bahwasanya mereka terus dalam perbincangan dan saling bercakap-cakap hingga hal itu menyebabkan salah seorang di antara mereka berkata, “sesungguhnya aku dahulu mempunyai seorang teman” di dunia, ia mengingkari kehidupan setelah mati, dan ia mencelaku karena aku membenarkannya. dan ia mengatakan, “Apakah kamu sungguh sungguh termasuk orang orang yang membenarkan? apakah bila kita telah mati dan kita telah menjadi tanah dan tulang belulang, apakah sesungguhnya kita benar benar diberi pembalasan,?” maksudnya, apakah kita akan diberi balasan atas amal perbuatan kita?! Artinya, bagaimana kamu membenarkan perkara yang tidak mungkin ini, yang benar benar sangat aneh ini!? Yaitu, apabila kita telah tercabik cabik dan menjadi tanah dan tulang belulang kita akan dibangkitkan dan dihidukan kembali, lalu kita dihisab dan diberi pembalasan sesuai dengan amal perbuatan kita? seorang penghuni surge ini berkata kepada rekan rekannya, inilah kisah dan berita dariku dengan temanku, dan aku tetap dan terus beriman lagi meyakini, sedangkan dia tetap dan terus mendustakan lagi mengingkari kebangkitan, hingga kita mati lalu kita dibangkitkan, dan kemudian aku sampai kepada apa yang kalian lihat sekarang berupa berbagai kenikmatan yang telah diinformasikan oleh para rasul, sedangkan dia sudah tidak diragukan lagi telah sampai ada azab. Maka apakah “kalian mau meninjau “ supaya kita bisa melihatnya hingga kita makin merasa senang dan bahagia dengan apa yang sedang rasakan ini, dan agar itu benar benar menjadi pandangan dengan kasat mata!? Nampaknya bahwa di antara perihal keadaan para penghuni surge dan kebahagiaan sebagian dengan sebagian yang lain, adalah bahwa mereka pun pergi mengikutinya untuk meninjau temannya. ”Maka ia meninjau” dan melihat temannya tersebut “di tengah tengah mereka yang menyala nyala.” Maksudnya, di tengah tengah azab dan siksaannya. Azab benar benar telah mengelilinginya. Lalu orang itu berkata seraya mencela temannya atas keadaannya dan bersyukur kepada Allah atas karuniaNya, Karena telah menyelamatkan dirinya dari tipu muslihat temannya, “Demi Allah, sesungguhnya kamu benar benar hampir mencelakakanku.” Maksudnya, engkau hampir membinasakanku disebabkan kerancuan-kerancuan pemikiran yang kamu masukkan kepadaku berdasarkan anggapanmu. “JIkalau tidak karena nikmat Rabbku,” kepadaku dengan meneguhkan pendirianku pada Islam, “pastilah aku termasuk orang-orang yang diseret” di dalam azab bersamamu. “Maka apakah kita tidak akan mati melainkan hanya kematian kita yang pertama saja, dan kita tidak akan disiksa?” maksudnya, orang yang beriman itu berkata kepadanya dengan membanggakan nikmat Allah kepada para penghuni surge dengan kekal abadi dan selamat dari azab. Ini adalah bentuk kalimat Tanya yang bermakna pengukuhan dan penetapan. Dan FirmanNya, “Lalu sebagian mereka menghadap kepada sebagian yang lain sambil bercakap-cakap,” ma’mul (objek) dalam kalimat ini dihapus, sedangkan konteksnya adalah kelezatan dan kesenangan. Maka ini menunjukkan bahwa mereka bila membicarakannya dan juga tentang masalah-masalah yang diperselisihkan serta rumit. Sebagaimana sudah dimakhlumi bahwa kelezatan para ahli ilmu adalah dengan memperbincangkan ilmu dan membahasnya melebihi kelezatan-kelezatan yang terjadi dalam perbincangan masalah dunia. Di sisi ini, di dalam surge, mereka mempunyai bagian yang sangat besar, mereka dapat menyingkap berbagai kenyataan-kenyataan ilmiah di dalam surge yang tidak mungkin di ungkapkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 51: Mereka di surga mendengar, meminum dengan kenikmatan-kenikmatan yang tidak di dapati di dunia. Berkata salah seorang di antara mereka : Dengarlah wahai teman-temanku, aku dahulu memiliki teman yang selalu bersamaku dan duduk bersamaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 51",
    "description": "Berkatalah salah seorang di antara mereka, 'sesungguhnya aku di dunia dahulu pernah mempunyai seorang teman dekat, 52. Yang berkata kepadaku dengan penuh keingkaran, 'apakah sesungguhnya kamu termasuk orang-orang yang membenarkan adanya hari kebangkitan pada hari kiamat nanti'."
  }
]