[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-57 Orang mukmin itu berkata kepada temannya yang mengingkari kebangkitan “hampir-hampir saja kamu mencelakakanku dengan menghalang-halangiku dari iman sekiranya aku patuh kepadamu. kalau tidak ada karunia dari tuhanku dengan memberiku hidayah kepada iman dan peneguhanNya terhadapku diatasnya, niscaya aku termasuk orang-orang yang dimasukkan ke dalam azab bersamamu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dia berkata, “Demi Allah, kamu wahai rekanku, kamu hampir mencelakakanku dengan masuk Neraka gara-gara kamu mengajakku kepada kekufuran dan pengingkaran terhadap Kebangkitan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Maka orang beriman itu berkata kepadanya: “Sungguh kamu hampir saja membinasakanku dengan godaanmu dan ajakanmu untuk ingkar dan mendustakan hari kebangkitan. Kalaulah bukan karena karunia dan rahmat Tuhanku dengan memberiku hidayah dan meneguhkanku di atas keimanan, niscaya aku termasuk orang yang tinggal bersamamu di neraka dan merasakan siksaannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. قَالَ تَاللهِ إِن كِدتَّ لَتُرْدِينِ (Ia berkata (pula): “Demi Allah, sesungguhnya kamu benar-benar hampir mencelakakanku) Yakni hampir saja kamu membinasakanku dengan kesesatan. Pendapat lain mengatakan yakni hampir saja kamu menjerumuskanku ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Dengan mengejek, orang mukmin itu berkata kepada temannya atas apa yang dilihatnya: “Demi Allah, aku mengira bahwa kamu akan menghancurkanku dengan membujukku dan menempatkanku dalam neraka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Demi Allah, kamu hampir} sungguh kamu hampir saja {mencelakakanku} membinasakanku jika aku menaatimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50-59. Setelah Allah menjelaskan kenikmatan mereka dan puncak kebahagiaan mereka dengan berbagai makanan, minuman, istri-istri yang cantik jelita, dan tempat-tempat duduk yang baik, maka Allah menjelaskan percakapan dan dialog di antara mereka tentang masalah masalah yang sudah berlalu, dan bahwasanya mereka terus dalam perbincangan dan saling bercakap-cakap hingga hal itu menyebabkan salah seorang di antara mereka berkata, “sesungguhnya aku dahulu mempunyai seorang teman” di dunia, ia mengingkari kehidupan setelah mati, dan ia mencelaku karena aku membenarkannya. dan ia mengatakan, “Apakah kamu sungguh sungguh termasuk orang orang yang membenarkan? apakah bila kita telah mati dan kita telah menjadi tanah dan tulang belulang, apakah sesungguhnya kita benar benar diberi pembalasan,?” maksudnya, apakah kita akan diberi balasan atas amal perbuatan kita?! Artinya, bagaimana kamu membenarkan perkara yang tidak mungkin ini, yang benar benar sangat aneh ini!? Yaitu, apabila kita telah tercabik cabik dan menjadi tanah dan tulang belulang kita akan dibangkitkan dan dihidukan kembali, lalu kita dihisab dan diberi pembalasan sesuai dengan amal perbuatan kita? seorang penghuni surge ini berkata kepada rekan rekannya, inilah kisah dan berita dariku dengan temanku, dan aku tetap dan terus beriman lagi meyakini, sedangkan dia tetap dan terus mendustakan lagi mengingkari kebangkitan, hingga kita mati lalu kita dibangkitkan, dan kemudian aku sampai kepada apa yang kalian lihat sekarang berupa berbagai kenikmatan yang telah diinformasikan oleh para rasul, sedangkan dia sudah tidak diragukan lagi telah sampai ada azab. Maka apakah “kalian mau meninjau “ supaya kita bisa melihatnya hingga kita makin merasa senang dan bahagia dengan apa yang sedang rasakan ini, dan agar itu benar benar menjadi pandangan dengan kasat mata!? Nampaknya bahwa di antara perihal keadaan para penghuni surge dan kebahagiaan sebagian dengan sebagian yang lain, adalah bahwa mereka pun pergi mengikutinya untuk meninjau temannya. ”Maka ia meninjau” dan melihat temannya tersebut “di tengah tengah mereka yang menyala nyala.” Maksudnya, di tengah tengah azab dan siksaannya. Azab benar benar telah mengelilinginya. Lalu orang itu berkata seraya mencela temannya atas keadaannya dan bersyukur kepada Allah atas karuniaNya, Karena telah menyelamatkan dirinya dari tipu muslihat temannya, “Demi Allah, sesungguhnya kamu benar benar hampir mencelakakanku.” Maksudnya, engkau hampir membinasakanku disebabkan kerancuan-kerancuan pemikiran yang kamu masukkan kepadaku berdasarkan anggapanmu. “JIkalau tidak karena nikmat Rabbku,” kepadaku dengan meneguhkan pendirianku pada Islam, “pastilah aku termasuk orang-orang yang diseret” di dalam azab bersamamu. “Maka apakah kita tidak akan mati melainkan hanya kematian kita yang pertama saja, dan kita tidak akan disiksa?” maksudnya, orang yang beriman itu berkata kepadanya dengan membanggakan nikmat Allah kepada para penghuni surge dengan kekal abadi dan selamat dari azab. Ini adalah bentuk kalimat Tanya yang bermakna pengukuhan dan penetapan. Dan FirmanNya, “Lalu sebagian mereka menghadap kepada sebagian yang lain sambil bercakap-cakap,” ma’mul (objek) dalam kalimat ini dihapus, sedangkan konteksnya adalah kelezatan dan kesenangan. Maka ini menunjukkan bahwa mereka bila membicarakannya dan juga tentang masalah-masalah yang diperselisihkan serta rumit. Sebagaimana sudah dimakhlumi bahwa kelezatan para ahli ilmu adalah dengan memperbincangkan ilmu dan membahasnya melebihi kelezatan-kelezatan yang terjadi dalam perbincangan masalah dunia. Di sisi ini, di dalam surge, mereka mempunyai bagian yang sangat besar, mereka dapat menyingkap berbagai kenyataan-kenyataan ilmiah di dalam surge yang tidak mungkin di ungkapkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 56: 54-57. Dan di ujung pembicaraan mereka, ia meminta teman-temannya ketika di surga, untuk melihat temannya ketika bersamanya di dunia yang ia berada di pertengahan neraka, yang akirnya (temannya tersebut) terhina dan tercela atas sangkaan buruknya terhadap Allah, Ia berkata : Sungguh hampir-hampir aku celaka, kalau saja Allah tidak memberikan kepadaku kenikmatan dan karunia, serta kekokohan di atas kebenaran maka aku tidak akan bisa melewati kebathilan, yang aku diseru kepadanya saat itu; Dan sungguh aku akan mendapatkan adzab bersamanya dengan dimasukkannya ke dalam neraka yang pedih karena sebab kufurnya ia (temanku) dan pengingkarannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mencela keadaan kawannya dan sambil bersyukur kepada Allah atas nikmat-Nya yang menyelelamatkannya dari tipu daya kawannya. Dengan melemparkan berbagai syubhat kepadaku agar aku mengikutimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 56",
    "description": "Dia pun berkata kepada temannya yang diazab itu, 'demi Allah, engkau hampir saja mencelakakanku dengan bujuk rayumu, 57. Dan sekiranya bukan karena rahmat dan nikmat tuhanku, yakni iman dan hidayah dari-Nya, pastilah aku termasuk orang-orang yang diseret ke neraka bersamamu."
  }
]