[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami menghiasi langit dengan perhiasan, yaitu bintang-bintang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya Kami menghiasi langit terdekat ke bumi dengan suatu perhiasan yang indah, yaitu bintang-bintang yang tampak di penglihatan seperti mutiara yang berkilau."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. -Dengan keagungan dan kekuasaan Kami- Kami menghiasi langit dunia dengan bintang-bintang dan planet-planet yang dapat dilihat manusia, dan Kami menjaganya dengan lemparan api dari setan yang membangkang dan enggan mentaati Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّا زَيَّنَّا السَّمَآءَ الدُّنْيَا (Sesungguhnya Kami telah menghias langit yang terdekat) Yaitu langit yang paling dekat dengan bumi. بِزِينَةٍ الْكَوَاكِبِ(dengan hiasan, yaitu bintang-bintang) Yakni Kami indahkan langit dunia bagi pandangan manusia dengan hiasan yang indah berupa bintang-bintang, sebab bintang-bintang itu bagaikan permata yang berkilau bagi orang yang memandangnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya Kami menghiasi langit dunia, yaitu langit terdekat dari bumi dengan hiasan yang menarik berupa planet-planet atau bintang-bintang yang bersinar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah menghiasi langit dunia dengan hiasan bintang-bintang} bintang-bintang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-9. “sesungguhnya Kami telah menghias langit dunia (yang terdekat) dengan hiasan bintang-bintang, dan telah memeliharanya dari setiap setan yang sangat durhaka, setan-setan itu tidak dapat mendengar pembicaraan para malaikat,” Allah menjelaskan dua faidah besar berikut ini berkaitan dengan bintang-bintang: Petama, adalah keberadaannya sebagai perhiasan langit, sebab kalau tidak ada bintang, niscaya langit ini akan menjadi gelap gulita, tidak memilki cahaya. Maka Allah menjadikan bintang sebagai hiasan didalamnya agar segenap penjurunya terang dan bentuknya menjadi indah serta bisa dijadikan sebagai pedoman (petunjuk arah) dalam kegelapan darat dan lautan serta banyak terdapat maslahat besar lain darinya. Kedua, menjaga langit dari segala setan pembangkang yang dengan pembangkangannya sampai kepada al-mala’il’ala, yaitu para malaikat. Apabila setan-setan itu berusaha mencuri informasi dengan menguping, maka para malaikat melemparnya dengan suluh api yang cemerlang “dari segala penjuru” untuk mengusir dan menghalau mereka supaya tidak mendengar apa yang dikatakan oleh para malaikat tersebut. “dan bagi mereka siksaan yang kekal,” maksudnya, yang terus menerus, yang telah dipersiapkan untuk mereka karena pembangkaannya dari ketaatan kepada Allah, Rabb mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 6: 6-7. Allah mengabarkan bahwasanya perhiasan langit dunia adalah lebih dekat kepada langit bumi, yang dengan bintang-bintang ini menjadikan bumi bercahaya yang berkilauan di malam hari, sebagai petunjuk bagi perjalanan kalian dari satu tempat ke tempat yang lain. Allah kemudian mengabarkan bahwasanya Dia menjaga langit dari setan yang jauh dari ketaatan dan rahmat Allah, oleh karenya bintang-bintang ini berpindah-pindah sebagai panah-panah yang dilesatkan kepada setan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini dan setelahnya Allah Subhaanahu wa Ta'aala menyebutkan dua faedah diciptakan-Nya bintang: 1. Untuk menghias langit dan meneranginya, karena jika tidak ada bintang, maka langit menjadi gelap, maka dengan diciptakan-Nya bintang, penjuru-penjuru langit menjadi terang, tampak indah dan dapat dipakai sebagai penunjuk jalan di kegelepan malam serta maslahat lainnya. 2. Untuk menjaga langit dari setiap setan yang durhaka, di mana saking durhakanya sampai memberanikan diri untuk mencuri berita dari para malaikat, dan jika hendak mendengarnya, mereka dilempari meteor yang menyala dari segala penjuru untuk mengusir mereka dan menjauhkan mereka agar tidak mendengarkan berita dari para malaikat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 6",
    "description": "Sesungguhnya kami telah menghias langit dunia yang terdekat dengan bumi dengan hiasan bintang-bintang dan planet-planet yang begitu indah. 7. Dan kami telah menjadikan bintang-bintang itu sebagai pelindung langit yang menjaganya dari setiap setan yang durhaka yang hendak mencuri dengar kabar-kabar masa depan."
  }
]