[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "58-60 apakah benar kami diberi kenikatan dan dikekalkan sehingga kami tidak akan mati kecuali kematian kami yang pertama di dunia dan kami tidak akan disiksa setelah kami masuk surga? sesungguhnya kenikmatan yang kami dapatkan ini merupakan kemenangan yang besar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Sesungguhnya balasan yang diberikan oleh Rabb kita, yaitu masuk Surga, kekal di dalamnya dan keselamatan dari api neraka, ini benar-benar kemenangan yang besar yang tidak ada tandingannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Sungguh kenikmatan yang kita rasakan di surga ini merupakan kemenangan yang besar dan kejayaan yang kekal. Dan demi balasan mulia yang seperti itu hendaklah manusia beramal dan bersungguh-sungguh di dunia, agar dapat meraih kenikmatan itu di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Sesungguhnya yang didapatkan oleh penduduk surga berupa kenikmatan, keabadian, dan keamanan dari azab itu adalah kemenangan akhir yang tidak dapat dihitung nilainya dan tidak bisa digambarkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya ini benar-benar kemenangan yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. SEtelah Allah menjelaskan kenikmatan surge dan menguraikannya dengan uraian yang sangat indah, maka kemudian DIa memujinya dan merangsang orang-orang yang beramal shalih dan memacu mereka supaya beramal unttuk meraihnya, seraya berfirman, “SEsunggunya ini benar-benar kemenangan yang besar,” yang dengannya mereka bisa memperoleh segala kebaikan yang diinginkan dan didambakan oleh jiwa, dan dengannya segala yang berbahaya dan tidak disuka akan tertolak. Maka apakah ada lagi kemenangan yang dicari di atas itu, ataukah itu puncak dari segala tujuan daana akhir dari segala harapan, di mana ridha dari Rabb Penguasa langit dan bumi menyelimuti mereka, kenikmatan mengenalNya, sangat berbahagia karena bisa melihatNYa, dan sangat menikmati FirmanNya?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 60: 60-61. Kemudian dia berkata dengan gembira : Ketahuilah bahwa kenikmatan yang kami peroleh ini sungguh kemenangan yang hakiki dan pencapaian yang besar. Dan permisalan tempat kembali (neraka bagi kafir) dan kemenangan ini, yaitu dengan beramal atas orang-orang yang beramal dengan bersungguh-sungguh ketika di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kenikmatan di surga dan menyifatinya dengan sifat-sifat yang indah, memujinya dan membuat manusia rindu kepadanya serta mendorong untuk beramal, maka Dia berfirman, “Sungguh, ini benar-benar kemenangan yang agung.” Yakni dengannya semua kebaikan diperoleh, demikian pula apa saja yang diinginkan oleh jiwa, dan dengannya semua yang dikhawatirkan serta hal yang tidak diinginkan terhindar. Oleh karena itu, kemenangan apa lagi yang lebih agung daripadanya? Bukankah ia merupakan puncak cita-cita dan akhir dari tujuan, di mana Tuhan Pencipta langit dan bumi telah menaruh rasa ridha kepada mereka, dan mereka pun bergembira karena dekat dengan-Nya, merasakan nikmat dengan mengenal-Nya dan merasa senang melihat-Nya serta bergembira karena mendengar firman-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 60",
    "description": "Sungguh kenikmatan surga ini benar-benar kemenangan yang agung, keberuntungan yang besar, dan kebahagiaan abadi. 61. Untuk memperoleh kemenangan dan kebahagiaan serupa ini, hendaklah beramal orang-orang yang mampu beramal semasa hidup di dunia."
  }
]