[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Untuk kenikmatan yang sempurna seperti ini, kekekalan yang langgeng dan kemenangan besar ini lah hendaklah orang-orang yang beramal di dunia beramal untuknya, agar di akhirat mereka sampai kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Untuk mendapatkan balasan yang agung inilah hendaknya orang-orang yang beramal melakukan amalannya. Sungguh ini adalah bisnis yang menguntungkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. لِمِثْلِ هٰذَا فَلْيَعْمَلِ الْعٰمِلُونَ (Untuk kemenangan serupa ini hendaklah berusaha orang-orang yang bekerja”) Sebab ini merupakan perniagaan yang menguntungkan. Dan bukan bekerja demi kehidupan dunia yang fana."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Untuk mencapai tujuan agung yang serupa ini maka hendaklah mereka beramal (untuk akhirat) bukan beramal untuk dunia yang fana"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk yang seperti ini, hendaklah orang-orang yang mampu beramal itu beramal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “UNtuk hal seperti inilah hendaknya beramal orang-orang yang beramal.” Itulah yang lebih berhak untuk mendapat curahan infak apa-apa yang termahal sekalipun, dan yang lebih utama untuk disingsingkan lengan baju oleh orang-orang yang berpengetahuan lagi beruntung. Sungguh puncak segala kerugian adalah berlalunya waktu bagi orang yang serius, sedangkan ia dalam keadaan tidak sibuk dengan amal yang bisa mendekatkannya kepada negeri kebahagiaan ini. Maka bagaimana seseorang rela berjalan dengan dosa-dosa menuju negeri kebinasaan?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 61: 60-61. Kemudian dia berkata dengan gembira : Ketahuilah bahwa kenikmatan yang kami peroleh ini sungguh kemenangan yang hakiki dan pencapaian yang besar. Dan permisalan tempat kembali (neraka bagi kafir) dan kemenangan ini, yaitu dengan beramal atas orang-orang yang beramal dengan bersungguh-sungguh ketika di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia lebih berhak untuk diberikan sesuatu yang paling berharga dan diseriusi oleh orang-orang yang berakal, dan kerugian yang besar ketika waktu berlalu begitu saja tanpa diisi dengan amal yang dapat memasukkannya ke surga, lalu bagaimana dengan orang yang mengisi hidupnya dengan dosa-dosa, maka semoga Allah melindungi kita darinya, amin yaa Rabbal ‘aalamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 61",
    "description": "Untuk memperoleh kemenangan dan kebahagiaan serupa ini, hendaklah beramal orang-orang yang mampu beramal semasa hidup di dunia. 62. Apakah makanan surga itu hidangan yang lebih baik bagi ahli surga, ataukah pohon zaqqum yang pahit dan berbau tidak sedap'."
  }
]