[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kenikmatan surga yang telah disebutkan di atas lebih baik sebagai karunia dan pemberian dari Allah ataukah pohon zaqqum yang busuk lagi menjijikan sebagi makanan penduduk neraka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Apakah nikmat tersebut, yang Allah siapkan bagi para hamba yang dipilih Allah untuk menaati-Nya, lebih baik dan lebih utama kedudukan dan kemuliaannya ataukah pohon zaqqūm yang terkutuk di dalam Al-Qur`ān yang merupakan makanan orang-orang kafir yang tidak menggemukkan ataupun mengenyangkan dari lapar?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Apakah surga yang telah disebutkan kenikmatannya yang sempurna dan kekal itu merupakan pemberian yang lebih baik, atau pohon Zaqqum yang terlaknat yang merupakan makanan bagi penghuni neraka? Jawabannya tidak diragukan lagi, bahwa makanan penduduk surga lebih baik daripada makanan penghuni neraka. Akan tetapi maksud dari pertanyaan ini adalah sebagai olokan bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. أَذٰلِكَ خَيْرٌ نُّزُلًا ((Makanan surga) itukah hidangan yang lebih baik) Yakni sebagai jamuan dan penghormatan bagi mereka. أَمْ شَجَرَةُ الزَّقُّومِ (ataukah pohon zaqqum) Yakni pohon yang berbuah pahit sekali, dan penghuni neraka akan dipaksa untuk memakannya sebab itu adalah hidangan dan jamuan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Apakah yang disebutkan terkait penduduk surga itu kemuliaan dan penjamuaannya lebih baik ataukah pohon yang disiapkah untuk penduduk neraka yang memiliki buah pahit dan berbau tidak enak yang menjadi tempat dan penjamuan mereka?! Buah yang serupa tumbuh di daerah Arab bernama Tihamah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah hal itu} apakah kenikmatan surga itu {lebih baik kedudukannya} kedudukan dan kemuliaannya {ataukah pohon zaqum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Apakah itu yang lebih baik,” yakni kenikmatan yang telah Kami uraikan untuk para penghuni surge tadi lebih baik, ataukah azab yang ada di dalam Neraka Jahim dengan segala macam siksaannya? Makanan yang mana dari keduanya yang lebih utama? Makanan yang dijelaskan yang ada di dalam surge “ataukah” makanan para penghuni neraka, yaitu “pohon zaqqum.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 62: 62-63. Allah memerintahkan Nabi-Nya ﷺ untuk bertanya kepada orang-orang kafir : Apakah kenikmatan yang diberikan oleh ahlo surga itu baik, ataukah pohon zaqum yang buruk, yang terlaknat yang ia adalah makanan dari ahli neraka (yang baik)? Kemudian Allah menjelaskan bahwa pohon ini dijadikan oleh Allah buruk, adzab bagi orang-orang kafir yang dzalim; Karena sebab mereka mengingkari kekuasaan Allah untuk mengeluarkan pohon di pertengahan nereka. Dan Maha Suci Allah yang tidak ada melemahkan-Nya di bumi maupun di langit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Zaqqum adalah jenis pohon yang pahit dan tidak enak rasa buahnya yang tumbuh di neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 62",
    "description": "Apakah makanan surga itu hidangan yang lebih baik bagi ahli surga, ataukah pohon zaqqum yang pahit dan berbau tidak sedap'63. Sungguh, kami menjadikannya, yakni pohon zaqqum itu, makanan penduduk neraka sebagai azab bagi orang-orang zalim."
  }
]