[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-68 sesungguhnya ia pohon zaqqum itu adalah pohon yang tumbuh di dasar jahanam, buahnya sangat buruk apabila dipandang, seolah-olah ia adalah kepala-kepala setan bila ia demikian maka jangan bertanya lagi setelah ini rasanya. sesungguhnya orang-orang musyrik itu pasti makan dari pohon tersebut, yang akan memenuhi perut-perut mereka, kemudian setelah mereka memakannya mereka akan minum minuman yang campur aduk (keruh), buruk lagi sangat panas, kemudian setelah azab ini dikembalikan kepada azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Sesungguhnya pohon zaqqūm adalah pohon yang akarnya busuk, ia adalah pohon yang tumbuh di dasar api neraka Jahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. إِنَّهَا شَجَرَةٌ تَخْرُجُ فِىٓ أَصْلِ الْجَحِيمِ (Sesungguhnya dia adalah sebatang pohon yang ke luar dan dasar neraka yang menyala) Yakni tumbuh dari dasar neraka, dan cabang-cabangnya menjulur ke tingkat-tingkat neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Itu adalah pohon yang tumbuh di dasar neraka dan cabang-cabangnya menjulang ke bagian-bagian bawah neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya itu adalah pohon yang keluar} yang muncul {dari dasar} dasar {neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63-66. “Sesungguhnya Kami menjadikannya sebagai fitnah,” maksudnya, sebagai azab dan hukuman, “bagi orang-orang yang zhalim,” terhadap diri mereka sendiri dengan melakukan kekafiran dan berbagai maksiat. “Sesungguhnya ia adalah sebatang pohon yang keluar dari dasar Neraka Jahim,” artinya, dari tengah-tengahnya. Inilah tempat asal keluarnya dan tempat mulanya, yaitu tempat terburuk dan terbusuk. Dan seburuk-buruk tempat tumbuh menunjukkan sangat buruk dan hinanya tanaman itu. Maka dari itu Allah mengingatkan akan keburukannya dengan menjelaskan dari mana asal tumbuhnya dan dengan menyebutkan salah satu ciri buahnya, yaitu seperti kepala setan-setan. Maka janganlah kamu menanyakan sesudah itu tentang rasa dan reaksinya di dalam rongga dan perut mereka. Tidak ada jalan pelarian bagi mereka darinya dan tidak pula ada tempat melepaskan diri. Maka dari itu Allah berfirman, “Maka sesungguhnya mereka benar-benar memakan sebagian dari buah pohon itu, maka mereka memenuhi perutnya dengannya.” Inilah hidangan para penghuni neraka, dan seburuk-buruk hidangan adalah hidangan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 64: 64-67. Allah mengabarkan bahwa pohon ini tumbuh di pertengahan neraka, dan buahnya adalah sesuatu yang buruk, sampai-sampai mirip dengan kepala-kepala setan. Kemudian Allah mengabarkan penghukuman bagi ahli neraka atas makanan bagi mereka yaitu dengan buah ini, yang mereka kelaparan sehingga memakan buah ini hingga perut mereka penuh dengan buah ini, kemudian minum dengan air yang mendidih yang bercampur dengan sesuatu yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 64",
    "description": "Sungguh, itu adalah pohon yang keluar dari dasar neraka jahim. Dahan pohon itu menjulur hingga dasar jurang neraka. 65. Mayangnya sangat buruk dan menyeramkan seperti kepala-kepala setan."
  }
]