[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-68 sesungguhnya ia pohon zaqqum itu adalah pohon yang tumbuh di dasar jahanam, buahnya sangat buruk apabila dipandang, seolah-olah ia adalah kepala-kepala setan bila ia demikian maka jangan bertanya lagi setelah ini rasanya. sesungguhnya orang-orang musyrik itu pasti makan dari pohon tersebut, yang akan memenuhi perut-perut mereka, kemudian setelah mereka memakannya mereka akan minum minuman yang campur aduk (keruh), buruk lagi sangat panas, kemudian setelah azab ini dikembalikan kepada azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Buah yang dihasilkannya sangat memuakkan pemandangan, ia seperti kepala setan. Buruknya pemandangan menunjukkan buruknya kandungan di dalamnya. Ini artinya bahwa buahnya terasa sangat busuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. طَلْعُهَا كَأَنَّهُۥ رُءُوسُ الشَّيٰطِينِ (mayangnya seperti kepala syaitan-syaitan) Yakni buah dan isinya sangat buruk bentuknya seakan-akan itu adalah kepala setan. Allah menyerupakan hal yang nampak dengan hal yang tidak nampak untuk menunjukkan keburukan yang sangat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Buahnya menyerupai mayang kurma. Bentuknya yang buruk dan jelek layaknya kepala setan. Menurut budaya Arab yang menyerupakan setiap sesuatu yang buruk dengan wujud setan dan setiap kebaikan dengan wujud malaikat. Mayang adalah hal pertama yang tumbuh dari buah kurma."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mayangnya} buahnya {seperti kepala-kepala setan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63-66. “Sesungguhnya Kami menjadikannya sebagai fitnah,” maksudnya, sebagai azab dan hukuman, “bagi orang-orang yang zhalim,” terhadap diri mereka sendiri dengan melakukan kekafiran dan berbagai maksiat. “Sesungguhnya ia adalah sebatang pohon yang keluar dari dasar Neraka Jahim,” artinya, dari tengah-tengahnya. Inilah tempat asal keluarnya dan tempat mulanya, yaitu tempat terburuk dan terbusuk. Dan seburuk-buruk tempat tumbuh menunjukkan sangat buruk dan hinanya tanaman itu. Maka dari itu Allah mengingatkan akan keburukannya dengan menjelaskan dari mana asal tumbuhnya dan dengan menyebutkan salah satu ciri buahnya, yaitu seperti kepala setan-setan. Maka janganlah kamu menanyakan sesudah itu tentang rasa dan reaksinya di dalam rongga dan perut mereka. Tidak ada jalan pelarian bagi mereka darinya dan tidak pula ada tempat melepaskan diri. Maka dari itu Allah berfirman, “Maka sesungguhnya mereka benar-benar memakan sebagian dari buah pohon itu, maka mereka memenuhi perutnya dengannya.” Inilah hidangan para penghuni neraka, dan seburuk-buruk hidangan adalah hidangan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 65: 64-67. Allah mengabarkan bahwa pohon ini tumbuh di pertengahan neraka, dan buahnya adalah sesuatu yang buruk, sampai-sampai mirip dengan kepala-kepala setan. Kemudian Allah mengabarkan penghukuman bagi ahli neraka atas makanan bagi mereka yaitu dengan buah ini, yang mereka kelaparan sehingga memakan buah ini hingga perut mereka penuh dengan buah ini, kemudian minum dengan air yang mendidih yang bercampur dengan sesuatu yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika demikian, maka tentang rasanya tidak perlu ditanyakan lagi, demikian juga akibat yang menimpa perut mereka setelah memakannya, di mana tidak ada lagi pilihan lain selain memakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 65",
    "description": "Mayangnya sangat buruk dan menyeramkan seperti kepala-kepala setan. 66. Pohon zaqqum itulah makanan para penghuni neraka. Maka sungguh, mereka benar-benar memakan sebagian darinya dan mereka memenuhi perutnya dengan buahnya karena tidak ada makanan lain bagi mereka di sana."
  }
]