[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-68 sesungguhnya ia pohon zaqqum itu adalah pohon yang tumbuh di dasar jahanam, buahnya sangat buruk apabila dipandang, seolah-olah ia adalah kepala-kepala setan bila ia demikian maka jangan bertanya lagi setelah ini rasanya. sesungguhnya orang-orang musyrik itu pasti makan dari pohon tersebut, yang akan memenuhi perut-perut mereka, kemudian setelah mereka memakannya mereka akan minum minuman yang campur aduk (keruh), buruk lagi sangat panas, kemudian setelah azab ini dikembalikan kepada azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Sesudah mereka memakanya, mereka minum minuman yang sangat busuk dan mendidih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. ثُمَّ إِنَّ لَهُمْ عَلَيْهَا (Kemudian sesudah makan buah pohon zaqqum itu pasti mereka mendapat minuman) Yakni setelah mereka memakan buah pohon itu. لَشَوْبًا مِّنْ حَمِيمٍ(yang bercampur dengan air yang sangat panas) Makanan mereka adalah campuran dari pohon itu dengan air panas agar azab itu semakin menyiksa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Kemudian bagi mereka usai makan buah dari pohon itu minuman yang tercampur ath-to’am yaitu air panas yang bercampur nanah (air yang berbau busuk) yang disebutkan dalam ayat {Illa hamiiman wa ghassaaqaa} [QS An-Naba’ 78/25]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bagi mereka itu} setelah makan dari sebagian pohon itu {minuman yang dicampur dengan air yang sangat panas} minuman yang dicampur dengan air yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Kemudian Allah menjelaskan minuman mereka seraya berfirman, “Kemudian sesungguhnya bagi mereka sesudah itu” sesudah menyantap hidangan itu “pasti mereka mendapat minuman yang bercampur dengan air yang sangat panas,” artinya, air panas yang telah mencapai puncak kepanasannya (mendidih), sebagaimana FirmanNya dalam ayat lain, “Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.” (Al-Kahfi:29), dan juga FirmanNya, “dan diberi minuman dengan air yang mendidih sehingga memotong-motong ususnya?” (Muhammad:15)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 67: 64-67. Allah mengabarkan bahwa pohon ini tumbuh di pertengahan neraka, dan buahnya adalah sesuatu yang buruk, sampai-sampai mirip dengan kepala-kepala setan. Kemudian Allah mengabarkan penghukuman bagi ahli neraka atas makanan bagi mereka yaitu dengan buah ini, yang mereka kelaparan sehingga memakan buah ini hingga perut mereka penuh dengan buah ini, kemudian minum dengan air yang mendidih yang bercampur dengan sesuatu yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal seperti firman Allah Subhaanahu wa Ta'aala di ayat yang lain, “Dan diberi minuman dengan air yang mendidih sehingga memotong ususnya?” (Terj. Muhammad: 15), dan firman Allah Ta’ala, “Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka.” (Terj. Al Kahfi: 29)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 67",
    "description": "Kemudian sungguh, setelah makan buah zaqqum yang pahit itu mereka mendapat minuman yang dicampur dengan air yang sangat panas hingga merusak pencernaan (lihat pula: surah mu'ammad/47: 15). 68. Kemudian, sudah pasti tempat kembali mereka adalah ke neraka jahim untuk selama-lamanya."
  }
]