[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "64-68 sesungguhnya ia pohon zaqqum itu adalah pohon yang tumbuh di dasar jahanam, buahnya sangat buruk apabila dipandang, seolah-olah ia adalah kepala-kepala setan bila ia demikian maka jangan bertanya lagi setelah ini rasanya. sesungguhnya orang-orang musyrik itu pasti makan dari pohon tersebut, yang akan memenuhi perut-perut mereka, kemudian setelah mereka memakannya mereka akan minum minuman yang campur aduk (keruh), buruk lagi sangat panas, kemudian setelah azab ini dikembalikan kepada azab api neraka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Kemudian sesudah itu tempat kembali mereka adalah azab Jahim, mereka berpindah dari satu azab ke azab lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. ثُمَّ إِنَّ مَرْجِعَهُمْ لَإِلَى الْجَحِيمِ(Kemudian sesungguhnya tempat kembali mereka benar-benar ke neraka Jahim) Yakni tempat kembali mereka setelah minum air panas dan makan buah Zaqqum adalah ke neraka, sebab mereka sebelumnya diangkat untuk meminum air panas kemudian dikembalikan ke neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68-69. Kemudian sesungguhnya tempat kembali mereka usai memakan dan meminum air panas itu adalah bagian bawah neraka. Sesungguhnya mereka mendapati leluhur mereka, lalu mengikutinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian tempat kembali mereka} tempat kembali mereka {pasti ke neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Kemudian sesungguhnya tempat kembali mereka,” yakni tempat tinggal, diam, dan tempat berteduh mereka “benar-benar ke Neraka Jahim,” agar merasakan sebagian dari azabnya yang sangat dahsyat dan panasnya yang sangat berat, yang kesengsaraannya tidak ada yang melebihinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 68: Allah mengabarkan bahwa tempat kembali bagi mereka orang-orang kafir adalah di neraka yang mereka tetap di sana setelah perut mereka kenyang dengan makan dan minum dari sesuatu yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat istirahat mereka setelah meminum air mendidih itu. Agar mereka merasakan azabnya yang pedih dan panas yang dahsyat, di mana tidak ada kesengsaraan yang melebihinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 68",
    "description": "Kemudian, sudah pasti tempat kembali mereka adalah ke neraka jahim untuk selama-lamanya. 69. Orang-orang kafir itu pantas mendapat sengsara dan siksa yang pedih di neraka karena sesungguhnya mereka di dunia dahulu mendapati nenek moyang mereka dalam keadaan sesat dan menyimpang dari ajaran agama para rasul, ."
  }
]