[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70 Sesungguhnya mereka mendapatkan leluhur mereka di atas kesyirikan dan kesesatan, lalu merekapun bersegera mengikuti mereka di atas itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Sesungguhnya orang-orang kafir itu mendapati nenek moyang mereka orang-orang yang tersesat dari jalan petunjuk, maka mereka mengikuti nenek moyang mereka karena taklid tanpa hujah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69-70. Mereka mendapati nenek moyang mereka dalam kesyirikan dan kesesatan, sehingga mereka mengikuti mereka tanpa memiliki bukti kebenaran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. إِنَّهُمْ أَلْفَوْا۟ (Karena sesungguhnya mereka mendapati) Yakni mereka menemui. ءَابَآءَهُمْ ضَآلِّينَ(bapak-bapak mereka dalam Keadaaan sesat) Yakni mereka mendapati mereka dalam keadaan tersebut, sehingga mereka mengikuti mereka kesesatan tanpa ada alasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68-69. Kemudian sesungguhnya tempat kembali mereka usai memakan dan meminum air panas itu adalah bagian bawah neraka. Sesungguhnya mereka mendapati leluhur mereka, lalu mengikutinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya mereka mendapati} mendapati {nenek moyang mereka dalam keadaan sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-73. SEakan-akan dikatakan, Apa yang telah mengantarkan kalian ke negeri ini? Maka Allah berfirman, “Karena sesungguhnya mereka mendapati,” menemukan “bapak-bapak mereka dalam keadaan sesat. Lalu mereka sangat tergesa-gesa mengikuti jejak mereka itu,” maksudnya, mereka segera turut melakukan kesesatan, tanpa menoleh kepada apa yang diserukan oleh para rasul dan tidak pula kepada apa-apa yang telah diwanti-wantikan oleh kitab-kitab suci, serta tidak pula kepada perkataan orang-orang yang memberikan nasihat. Bahkan mereka menentangnya dengan mengatakan, “\"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\" (Az-Zukhruf:22). “Dan sesungguhnya telah sesat sebelum mereka,” maksudnya, sebelum orang-orang yang menjadi alamat pembicaraan, “sebagian besar dari orang-orang yang dahulu,” sedikit sekali dari mereka yang beriman dan mengambil petunjuk. “Dan sesungguhnya telah Kami utus pemberi-pemberi peringatan di kalangan mereka,” yakni, yang mengingatkan mereka dari kesesatan, “maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.” Kesudahan mereka adalah kebinasaan, kehinaan, dan kenistaan. Maka hendaklah mereka waspada kalau masih tetap harus dalam kesesatannya, akan ditimpa seperti apa yang telah menimpa orang-orang terdahulu tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 69: 69-70. Allah mengabarkan bahwa orang-orang kafir tidak menjadi (langsung) sesat pada saat mereka didakwahkan, akan tetapi mereka menolak dakwah sehingga tersesat karena masih terdapat ketaklidan (taklid buta) dan mengikuti atas mereka yang kafir (dari pendahulunya) yang kemudian mereka menyerang dakwah untuk mentauhudkan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saakan-akan ada pertanyaan, “Apa yang membuat mereka sampai ke tempat itu?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 69",
    "description": "Orang-orang kafir itu pantas mendapat sengsara dan siksa yang pedih di neraka karena sesungguhnya mereka di dunia dahulu mendapati nenek moyang mereka dalam keadaan sesat dan menyimpang dari ajaran agama para rasul, 70. Lalu mereka tergesa-gesa mengikuti jejak nenek moyang mereka tanpa berpikir dan merenung untuk mencari tahu kebenarannya."
  }
]