[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70 Sesungguhnya mereka mendapatkan leluhur mereka di atas kesyirikan dan kesesatan, lalu merekapun bersegera mengikuti mereka di atas itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Mereka menelusuri jejak nenek moyang mereka dalam kesesatan dengan semangat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. فَهُمْ عَلَىٰٓ ءَاثٰرِهِمْ يُهْرَعُونَ (Lalu mereka sangat tergesa-gesa mengikuti jejak orang-orang tua mereka itu) Yakni mereka bersegara dalam mengikuti nenek moyang mereka seakan-akan mereka dipaksa untuk mengikuti mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Mereka berada di jalan para leluhur itu dan mengikutinya dengan sangat cepat seakan-akan gelisah untuk mengikuti mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tergesa-gesa} bergegas {mengikuti jejak (nenek moyang) mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-73. SEakan-akan dikatakan, Apa yang telah mengantarkan kalian ke negeri ini? Maka Allah berfirman, “Karena sesungguhnya mereka mendapati,” menemukan “bapak-bapak mereka dalam keadaan sesat. Lalu mereka sangat tergesa-gesa mengikuti jejak mereka itu,” maksudnya, mereka segera turut melakukan kesesatan, tanpa menoleh kepada apa yang diserukan oleh para rasul dan tidak pula kepada apa-apa yang telah diwanti-wantikan oleh kitab-kitab suci, serta tidak pula kepada perkataan orang-orang yang memberikan nasihat. Bahkan mereka menentangnya dengan mengatakan, “\"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\" (Az-Zukhruf:22). “Dan sesungguhnya telah sesat sebelum mereka,” maksudnya, sebelum orang-orang yang menjadi alamat pembicaraan, “sebagian besar dari orang-orang yang dahulu,” sedikit sekali dari mereka yang beriman dan mengambil petunjuk. “Dan sesungguhnya telah Kami utus pemberi-pemberi peringatan di kalangan mereka,” yakni, yang mengingatkan mereka dari kesesatan, “maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.” Kesudahan mereka adalah kebinasaan, kehinaan, dan kenistaan. Maka hendaklah mereka waspada kalau masih tetap harus dalam kesesatannya, akan ditimpa seperti apa yang telah menimpa orang-orang terdahulu tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 70: 69-70. Allah mengabarkan bahwa orang-orang kafir tidak menjadi (langsung) sesat pada saat mereka didakwahkan, akan tetapi mereka menolak dakwah sehingga tersesat karena masih terdapat ketaklidan (taklid buta) dan mengikuti atas mereka yang kafir (dari pendahulunya) yang kemudian mereka menyerang dakwah untuk mentauhudkan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tergesa-gesa dalam kesesatan, tidak menengok ajakan para rasul dan peringatan kitab-kitab, serta tidak memperhatikan ucapan para penasehat, bahkan mereka bantah dengan kata-kata mereka, “Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak-jejak mereka\" (lihat Az Zukhruf: 23)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 70",
    "description": "Lalu mereka tergesa-gesa mengikuti jejak nenek moyang mereka tanpa berpikir dan merenung untuk mencari tahu kebenarannya. 71. Orang-orang kafir itu, tidak terkecuali kafir mekah, mendapati nenek moyang mereka sesat dan mereka dengan serta-merta mengikuti kesesatan tersebut. Dan sungguh, sebelum mereka telah sesat dari hidayah Allah sebagian besar dari orang-orang yang dahulu, ."
  }
]