[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kebanyakan umat-umat sebelum umatmu (wahai rasul) juga telah tersesat dari kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Sungguh telah tersesat sebelum mereka kebanyakan dari orang-orang terdahulu. Kaummu -wahai Rasul- bukan orang pertama yang tersesat dari umat manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Hai Muhammad, Sungguh mayoritas umat sebelummu telah tersesat dari kebenaran dan petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Sunggah banyak umat sebelum kamu yang tersesat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh sebelum mereka, sebagian besar dari orang-orang yang dahulu telah tersesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-73. SEakan-akan dikatakan, Apa yang telah mengantarkan kalian ke negeri ini? Maka Allah berfirman, “Karena sesungguhnya mereka mendapati,” menemukan “bapak-bapak mereka dalam keadaan sesat. Lalu mereka sangat tergesa-gesa mengikuti jejak mereka itu,” maksudnya, mereka segera turut melakukan kesesatan, tanpa menoleh kepada apa yang diserukan oleh para rasul dan tidak pula kepada apa-apa yang telah diwanti-wantikan oleh kitab-kitab suci, serta tidak pula kepada perkataan orang-orang yang memberikan nasihat. Bahkan mereka menentangnya dengan mengatakan, “\"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\" (Az-Zukhruf:22). “Dan sesungguhnya telah sesat sebelum mereka,” maksudnya, sebelum orang-orang yang menjadi alamat pembicaraan, “sebagian besar dari orang-orang yang dahulu,” sedikit sekali dari mereka yang beriman dan mengambil petunjuk. “Dan sesungguhnya telah Kami utus pemberi-pemberi peringatan di kalangan mereka,” yakni, yang mengingatkan mereka dari kesesatan, “maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.” Kesudahan mereka adalah kebinasaan, kehinaan, dan kenistaan. Maka hendaklah mereka waspada kalau masih tetap harus dalam kesesatannya, akan ditimpa seperti apa yang telah menimpa orang-orang terdahulu tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 71: Allah menyebutkan bahwa kaummu wahai Nabi Allah, mereka tidak menjadikan sesuatu yang mengada-ada kecuali telah ada manusia sebelumnya yang tersesat yang mana mereka telah di utus rasul kepada mereka, yang menyeru kepada keimanan dan tauhid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedikit sekali di antara mereka yang beriman dan mendapat petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 71",
    "description": "Orang-orang kafir itu, tidak terkecuali kafir mekah, mendapati nenek moyang mereka sesat dan mereka dengan serta-merta mengikuti kesesatan tersebut. Dan sungguh, sebelum mereka telah sesat dari hidayah Allah sebagian besar dari orang-orang yang dahulu, 72. Dan sungguh, kami telah mengutus para rasul pemberi peringatan di kalangan mereka tentang ancaman murka dan siksa Allah, namun mereka mendustakannya."
  }
]