[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus para utusan kepada umat-umat tersebut, para utusan itu memperingatkan mereka terhadap azab Allah namun mereka mengingkarinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Sungguh Kami telah mengutus kepada umat-umat terdahulu para rasul yang memperingatkan mereka dari azab Allah, tetapi mereka kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Dan sungguh Kami telah mengutus banyak rasul kepada umat-umat tersebut untuk memperingatkan mereka dari azab Allah, akan tetapi mereka tetap di dalam kesesatan mereka dan mengingkari para rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Sungguh kami telah mengutus para rasul kepada umat-umat terdahulu dengan memperingatkan mereka tentang azab namun mereka tetap kafir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus pemberi peringatan di kalangan mereka} para rasul yang memperingatkan mereka tentang azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-73. SEakan-akan dikatakan, Apa yang telah mengantarkan kalian ke negeri ini? Maka Allah berfirman, “Karena sesungguhnya mereka mendapati,” menemukan “bapak-bapak mereka dalam keadaan sesat. Lalu mereka sangat tergesa-gesa mengikuti jejak mereka itu,” maksudnya, mereka segera turut melakukan kesesatan, tanpa menoleh kepada apa yang diserukan oleh para rasul dan tidak pula kepada apa-apa yang telah diwanti-wantikan oleh kitab-kitab suci, serta tidak pula kepada perkataan orang-orang yang memberikan nasihat. Bahkan mereka menentangnya dengan mengatakan, “\"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\" (Az-Zukhruf:22). “Dan sesungguhnya telah sesat sebelum mereka,” maksudnya, sebelum orang-orang yang menjadi alamat pembicaraan, “sebagian besar dari orang-orang yang dahulu,” sedikit sekali dari mereka yang beriman dan mengambil petunjuk. “Dan sesungguhnya telah Kami utus pemberi-pemberi peringatan di kalangan mereka,” yakni, yang mengingatkan mereka dari kesesatan, “maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.” Kesudahan mereka adalah kebinasaan, kehinaan, dan kenistaan. Maka hendaklah mereka waspada kalau masih tetap harus dalam kesesatannya, akan ditimpa seperti apa yang telah menimpa orang-orang terdahulu tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 72: 72-73. Allah mengabarkan bahwa Dia mengutus Rasul pada umat-umat sebelumnya sebagai pemberi peringatan, yang memperingatkan mereka dari kesyririkan dan kesesatan, dan mereka tidak menerima peringatan tersebut, maka perhatikanlah wahai Nabi bagaimana kesudahan dari penolakan mereka akan dakwah rasul mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengingatkan sesatnya jalan mereka dan akan menjerumuskan mereka ke neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 72",
    "description": "Dan sungguh, kami telah mengutus para rasul pemberi peringatan di kalangan mereka tentang ancaman murka dan siksa Allah, namun mereka mendustakannya. 73. Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu ketika mendustakan para rasul."
  }
]