[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali hamba-hamba Allah yang Allah selamatkan dan Allah khususkan dengan rahmatNya karena keikhlasan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Kecuali orang-orang yang Allah pilih untuk beriman kepada-Nya, sesungguhnya mereka adalah orang-orang yang selamat dari azab yang merupakan akhir dari hidup orang-orang kafir yang mendustakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. إِلَّا عِبَادَ اللهِ الْمُخْلَصِينَ (Tetapi hamba-hamba Allah yang bersihkan (dari dosa tidak akan diazab)) Yakni kecuali orang yang dipilih Allah dengan taufik-Nya untuk beriman dan mengesakan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Kecuali orang-orang yang ikhlas dalam beribadah dan menaati Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali hamba-hamba Allah yang terpilih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Oleh karena tidak semua orang yang diberi peringatan itu sesat, bahkan di antara mereka ada yang beriman dan mengikhlaskan ketaatan kepada Allah, maka mereka dikecualikan oleh Allah dari kebinasaan, seraya berfirman, “Kecuali hamba-hamba Allah yang diberi keikhlasan,” maksudnya, orang-orang yang disucikan oleh Allah dan diistimewakan dengan rahmatNya karena ketulusan mereka. Maka kesudahan mereka adalah menjadi terpuji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 74: Allah mengecualikan adzab bagi hamba-hamba Allah yang ikhlas yang mereka Allah berikan kemudahan dalam beramal shalih dan kemudian ikhlas atas amalan tersebut; Mereka berhasil dari kecelakaan dan dari api nereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena semua yang diberi peringatan itu tidak seluruhnya sesat, bahkan di antara mereka ada yang beriman dan berbuat ikhlas, maka Allah kecualikan mereka dari azab. Mereka ini adalah orang-orang mukmin, Allah bersihkan mereka dan mengistimewakan dengan rahmat-Nya karena keikhlasan mereka sehingga akhir kesudahan mereka adalah kebahagiaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 74",
    "description": "Mereka dibinasakan oleh Allah, kecuali hamba-hamba Allah yang di-sucikan dari dosa. Mereka diselamatkan dari siksa dengan rahmat Allah karena mengikuti ajakan para rasul dan meminta ampunan atas kesa-lahan mereka. 75. Bukti penghancuran para pendurhaka dan penyelamatan hamba-hamba Allah yang saleh tampak pada kisah nabi nuh dan kaumnya. Dan sungguh, nuh telah berdoa kepada kami perihal kaumnya yang membangkang, maka sungguh kamilah sebaik-baik yang memperkenankan doa."
  }
]