[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nabi Kami, nuh berseru kepada Kami, dan Kami pasti akan menolongnya atas kaumnya. dan Kami adalah sebaik-baik yang mengabulkan do’anya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Nabi Kami Nuh -'alaihissalām- berdoa kepada Kami manakala dia berdoa atas kaumnya yang mendustakannya, maka sebaik-baik yang menjawab doanya adalah Kami, Kami bergegas menjawab doanya atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Sungguh Nabi Nuh telah menyeru dan berdoa kepada Kami agar Kami menolongnya dalam menghadapi kaumnya setelah mereka ingkar dan berpaling dari dakwahnya; dia berkata: “Ya Tuhanku, sungguh aku telah dikalahkan, maka tolonglah aku dan segera kabulkan doaku untuk melawan kaumku, Engkau adalah sebaik-baik pengabul doa dan penolong kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. فَلَنِعْمَ الْمُجِيبُونَ (maka sesungguhnya sebaik-baik yang memperkenankan (adalah Kami)) Yang dimaksud adalah bahwa Nuh berdoa kepada Tuhannya agar mengazab kaumnya setelah mereka mendurhakainya, maka Allah mengabulkan doanya dan membinasakan kaumnya dengan banjir bandang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Sungguh Nuh telah berdoa dan meminta bantuan kepada Kami saat putus asa dengan kaumnya, lalu kami mengabulkan doanya dan membinasakan kaumnya dengan banjir bandang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Nuh benar-benar telah berdoa kepada Kami dan sungguh Kamilah sebaik-baik yang memperkenankan doa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82. Allah mengabarkan tentang hamba dan RasulNya, yaitu Nuh rasul pertama, yaitu bahwasanya ketika beliau mengajak kaumnya kepada Allah dalam jangka waktu yang sangat panjang, namun seruan Nuh hanya makin menambah mereka makin jauh, dan Nuh pun telah berdoa kepada Rabbnya seraya mengatakan, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.“ (Nuh:26). Dan ia juga berkata, “Lut berdoa: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\". (Al-ankabut:30). Lalu Allah mengabulkan doanya dan Allah memuji DiriNya seraya berfirman, “maka sesungguhnya (Kami adalah) sebaik-baik yang memperkenankan,” bagi orang-orang yang berdoa dan mendengarkan doa dan sikap merendahkan diri mereka kepadaNya. Allah mengabulkan doa Nabi Nuh sesuai dengan apa yang beliau mohon. Allah menyelamatkannya dan keluarganya dari bencana yang sangat besar dan menenggelamkan seluruh orang-orang kafir dan menyisakan anak keturunannya yang kemudian menjadi pengganti silih berganti, sehingga seluruh manusia (yang ada saat ini) berasal dari keturunan nabi Nuh. Dan Allah menjadikan pujian yang baik dan berlanjut bagi Nabi Nuh hingga zaman manusia-manusia yang terakhir datang. Yang demikian itu karena dia adalah orang yang ihsan dalam beribadah kepada Sang Pencipta dan muhsin (berbuat baik) kepada sesame manusia. Inilah Sunnah Allah pada orang-orang yang berbuat ihsan, yaitu menebarkan pujian baik bagi mereka menurut kadar ihsan (kebaikan) mereka. Dan FirmanNya, “Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.,” menunjukkan bahwa iman merupakan kedudukan manusia yang tertinggi, ia mencakup seluruh syariat-syariat agama, prinsip-prinsip dan cabang-cabangnya, karena Allah memuji manusia-manusia pilihanNya karena imannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 75: 75-76. Allah mengabarkan bahwa awal pertama dari rasul adalah Nuh yang menyeru kepada Allah agar membinasakan kaumnya yang kafir dan agar tidak menyisakannya satu pun; Karena sebab dakwah Nuh panjang dan mereka tidak mau menerimanya. Maka Allah mengabulkannya, dan memberikan keselamatan baginya serta keluarganya dan orang-orang yang beriman dari ditenggelamkannya mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah menyebutkan beberapa contoh kesudahan yang menimpa orang-orang yang mendustakan. Allah Subhaanahu wa Ta'aala memberitahukan tentang hamba dan Rasul-Nya Nuh ‘alaihis salam seorang rasul pertama, yaitu ketika ia telah berdakwah kepada kaumnya dalam waktu yang cukup lama (950 tahun), namun seruan Beliau hanya menambah mereka jauh dari kebenaran, sehingga ia berdoa kepada Tuhannya. Yaitu dengan doanya, “Ya Rabbi, sesungguhnya aku telah dikalahkan, maka tolonglah aku.” (lihat Al Qamar: 10).Yakni ia berdoa kepada Kami untuk kebinasaan kaumnya, maka Kami binasakan mereka dengan ditenggelamkan. Lalu Allah memuji Diri-Nya dengan firman-Nya di atas, “Maka sungguh, Kamilah sebaik-baik yang memperkenankan doa.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 75",
    "description": "Bukti penghancuran para pendurhaka dan penyelamatan hamba-hamba Allah yang saleh tampak pada kisah nabi nuh dan kaumnya. Dan sungguh, nuh telah berdoa kepada kami perihal kaumnya yang membangkang, maka sungguh kamilah sebaik-baik yang memperkenankan doa. 76. Kami telah menyelamatkan dia dan pengikutnya dari bencana yang besar, yaitu banjir yang sangat dahsyat."
  }
]