[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menjadikan anak keturunan nuh adalah orang-orang yang tersisa setelah tenggelamnya kaumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Kami menyelamatkan keluarganya dan para pengikutnya yang beriman saja. Selain mereka dari kaumnya yang kafir, Kami tenggelamkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Dan Kami jadikan keturunan Nabi Nuh menjadi orang-orang yang tersisa di muka bumi setelah kaumnya tenggelam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَجَعَلْنَا ذُرِّيَّتَهُۥ هُمُ الْبَاقِينَ (Dan Kami jadikan anak cucunya orang-orang yang melanjutkan keturunan) Yakni hanya mereka yang tersisa, sebab Allah telah membinasakan orang-orang kafir setelah Nuh berdoa untuk itu sehingga tidak ada yang tersisa dari mereka. Sedangkan orang-orang yang beriman yang ikut bersama Nuh di kapal telah meninggal sehingga tidak tersisa kecuali anak keturunan Nuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Kami menyisakan keturunan Nuh agar berketurunan sampai hari kiamat, yaitu 3 anak: Sem, Ham, dan Yafet. Maknanya orang-orang mukmin yang menaiki perahu berserta nabi Nuh itu mati, begitu juga keturunannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tenggelam dengan banjir bandang {Kami menjadikan keturunannya} keturunan Nuh AS {orang-orang yang bertahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82. Allah mengabarkan tentang hamba dan RasulNya, yaitu Nuh rasul pertama, yaitu bahwasanya ketika beliau mengajak kaumnya kepada Allah dalam jangka waktu yang sangat panjang, namun seruan Nuh hanya makin menambah mereka makin jauh, dan Nuh pun telah berdoa kepada Rabbnya seraya mengatakan, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.“ (Nuh:26). Dan ia juga berkata, “Lut berdoa: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\". (Al-ankabut:30). Lalu Allah mengabulkan doanya dan Allah memuji DiriNya seraya berfirman, “maka sesungguhnya (Kami adalah) sebaik-baik yang memperkenankan,” bagi orang-orang yang berdoa dan mendengarkan doa dan sikap merendahkan diri mereka kepadaNya. Allah mengabulkan doa Nabi Nuh sesuai dengan apa yang beliau mohon. Allah menyelamatkannya dan keluarganya dari bencana yang sangat besar dan menenggelamkan seluruh orang-orang kafir dan menyisakan anak keturunannya yang kemudian menjadi pengganti silih berganti, sehingga seluruh manusia (yang ada saat ini) berasal dari keturunan nabi Nuh. Dan Allah menjadikan pujian yang baik dan berlanjut bagi Nabi Nuh hingga zaman manusia-manusia yang terakhir datang. Yang demikian itu karena dia adalah orang yang ihsan dalam beribadah kepada Sang Pencipta dan muhsin (berbuat baik) kepada sesame manusia. Inilah Sunnah Allah pada orang-orang yang berbuat ihsan, yaitu menebarkan pujian baik bagi mereka menurut kadar ihsan (kebaikan) mereka. Dan FirmanNya, “Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.,” menunjukkan bahwa iman merupakan kedudukan manusia yang tertinggi, ia mencakup seluruh syariat-syariat agama, prinsip-prinsip dan cabang-cabangnya, karena Allah memuji manusia-manusia pilihanNya karena imannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 77: Allah mengabarkan, bahwasanya Dia menjadikan anak keturunan dari Nuh tersisa; Karena sebab kebinasaan tersebut secara umum adalah mereka yang ada di dataran, di kecualikan Nuh dan anak keturunannya (yang di atas bahtera), maka yang naik bersama Nuh dari orang-orang yang beriman (selamat), adapun yang tidak dikatakan bahwa mereka semuanya mati tanpa meninggalkan anak keturunan setelahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, selanjutnya manusia berasal dari keturunannya, dan Beliau mempunyai tiga anak; Saam yang menjadi bapak bangsa Arab, Persia dan Romawi, Haam sebagai bapak orang-orang Sudan (hitam), dan Yafits sebagai bapak bangsa Turki, Khazar (bangsa yang bermata sipit), dan Ya’juj-Ma’juj."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 77",
    "description": "Dan kami muliakan nabi nuh dengan men-jadikan anak cucunya orang-orang yang melanjutkan keturunan setelah peristiwa banjir itu surut. 78. Dan kami abadikan untuk nabi nuh pujian yang bagus dan buah tutur yang indah di kalangan orang-orang yang datang kemudian."
  }
]