[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jaminan keamanan bagi nuh dan keselamatan untuknya, sehingga dia tidak disebut-sebut dengan keburukan di kalangan orang-orang yang datang sesudahnya, sebaliknya generasi-generasi sesudahnya akan menyanjungnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Keamanan dan keselamatan untuk Nuh -'alaihissalām- sehingga tidak ada kata-kata buruk yang ditujukan pada beliau dari umat-umat setelahnya, sebaliknya sanjungan dan nama yang baik akan terus mengalir untuk beliau."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Keamanan dan keselamatan bagi Nabi Nuh dari Allah dan manusia yang lain, sehingga dia tidak disebutkan keburukan padanya; namun dia akan dipuji oleh umat dan generasi setelahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. سَلٰمٌ عَلَىٰ نُوحٍ (Kesejahteraan dilimpahkan atas Nuh) Yakni mereka akan memujinya dengan pujian yang baik serta mendoakannya agar mendapat kebaikan dan rahmat; dan jika mereka menyebutnya mereka mengatakan Nuh ‘alaihissalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Mereka semua menyampaikan salam kepadanya, Maknanya mereka memberinya pujian yang baik dan seluruh penghuni berbagai alam mendoakannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Kesejahteraan atas Nuh di semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82. Allah mengabarkan tentang hamba dan RasulNya, yaitu Nuh rasul pertama, yaitu bahwasanya ketika beliau mengajak kaumnya kepada Allah dalam jangka waktu yang sangat panjang, namun seruan Nuh hanya makin menambah mereka makin jauh, dan Nuh pun telah berdoa kepada Rabbnya seraya mengatakan, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.“ (Nuh:26). Dan ia juga berkata, “Lut berdoa: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\". (Al-ankabut:30). Lalu Allah mengabulkan doanya dan Allah memuji DiriNya seraya berfirman, “maka sesungguhnya (Kami adalah) sebaik-baik yang memperkenankan,” bagi orang-orang yang berdoa dan mendengarkan doa dan sikap merendahkan diri mereka kepadaNya. Allah mengabulkan doa Nabi Nuh sesuai dengan apa yang beliau mohon. Allah menyelamatkannya dan keluarganya dari bencana yang sangat besar dan menenggelamkan seluruh orang-orang kafir dan menyisakan anak keturunannya yang kemudian menjadi pengganti silih berganti, sehingga seluruh manusia (yang ada saat ini) berasal dari keturunan nabi Nuh. Dan Allah menjadikan pujian yang baik dan berlanjut bagi Nabi Nuh hingga zaman manusia-manusia yang terakhir datang. Yang demikian itu karena dia adalah orang yang ihsan dalam beribadah kepada Sang Pencipta dan muhsin (berbuat baik) kepada sesame manusia. Inilah Sunnah Allah pada orang-orang yang berbuat ihsan, yaitu menebarkan pujian baik bagi mereka menurut kadar ihsan (kebaikan) mereka. Dan FirmanNya, “Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.,” menunjukkan bahwa iman merupakan kedudukan manusia yang tertinggi, ia mencakup seluruh syariat-syariat agama, prinsip-prinsip dan cabang-cabangnya, karena Allah memuji manusia-manusia pilihanNya karena imannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 79: Allah berkata : Keselamatan dan pujian atas Nuh di awal dan di akhir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 79",
    "description": "Kesejahteraan kami limpahkan atas nuh di seluruh alam. 80. Sungguh, demikianlah imbalan itu kami berikan kepada nabi nuh, dan kami pun akan memberi balasan dan imbalan kepada orang-orang yang berbuat baik."
  }
]