[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Setan-setan tidak mampu sampai ke al-mala al’la yaitu langit dan para malaikat yang ada di sana, untuk mendengar perbincangan mereka saat mereka membicarakan wahyu Allah swt tetang syariat dan takdirNya, setan-setan itu di lempari api-api dari segala penjuru agar mereka tidak bisa mendengar, dan diakhirat nanti mereka akan mendapatkan siksa abadi yang sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Para setan itu tidak sanggup mendengar perbincangan para malaikat di langit manakala mereka membicarakan wahyu Rabb mereka di antara mereka, baik wahyu syariat mapun wahyu takdir. Para setan itu dilempari dengan bola-bola api dari segala penjuru."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-10. Setan-setan itu tidak akan mampu menuju para malaikat yang ada di langit lapisan atas untuk mendengar apa yang mereka katakan tentang syariat, perintah, dan ketetapan yang Allah wahyukan kepada mereka. Sebab mereka telah dilempar dengan kobaran api dari segala penjuru, untuk menjaga langit dari mereka dan mengusir mereka agar tidak mendengar perkataan yang ada di langit. Dan di akhirat mereka akan mendapat azab yang kekal dan menyakitkan. Dan setan-setan yang mencuri perbincangan dari langit dengan sembunyi-sembunyi akan dilempari kobaran api, sehingga mereka akan terbakar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8-9. لَّا يَسَّمَّعُونَ إِلَى الْمَلَإِ الْأَعْلَىٰ (syaitan syaitan itu tidak dapat mendengar-dengarkan (pembicaraan) para malaikat) Makan (الملأ الأعلى) yakni penduduk langit dunia dan langit setelahnya; setan tidak dapat mencuri-curi pembicaraan mereka, sebab ia akan dilempar dengan meteor. وَيُقْذَفُونَ مِن كُلِّ جَانِبٍ دُحُورًا ۖ( dan mereka dilempari dari segala penjuru Untuk mengusir mereka) Yakni setan-setan dilempar dengan meteor dari segala penjuru langit apabila mereka hendak naik untuk mencuri pembicaraan, untuk mengusir mereka dari yang mereka inginkan. وَلَهُمْ عَذَابٌ وَاصِبٌ (dan bagi mereka siksaan yang kekal) Yakni azab yang tak ada henti. Pendapat lain mengatakan maknanya adalah azab yang sangat menyakitkan. Dan ini adalah azab di akhirat selain azab bagi mereka di dunia dengan berupa lemparan meteor."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sehingga mereka tidak bisa menguping berita dari malaikat paling tinggi, yaitu malaikat-malaikat agung yang ada di langit. Mereka dilempari dengan meteor yang menyala-nyala dari tiap sudut langit jika mereka mencoba menguping."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak dapat mendengar para malaikat yang tinggi} penghuni langit dunia dan langit di atasnya {dan mereka dilempari} dan mereka dilempar dengan api yang menyala {dari segala penjuru"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-9. “sesungguhnya Kami telah menghias langit dunia (yang terdekat) dengan hiasan bintang-bintang, dan telah memeliharanya dari setiap setan yang sangat durhaka, setan-setan itu tidak dapat mendengar pembicaraan para malaikat,” Allah menjelaskan dua faidah besar berikut ini berkaitan dengan bintang-bintang: Petama, adalah keberadaannya sebagai perhiasan langit, sebab kalau tidak ada bintang, niscaya langit ini akan menjadi gelap gulita, tidak memilki cahaya. Maka Allah menjadikan bintang sebagai hiasan didalamnya agar segenap penjurunya terang dan bentuknya menjadi indah serta bisa dijadikan sebagai pedoman (petunjuk arah) dalam kegelapan darat dan lautan serta banyak terdapat maslahat besar lain darinya. Kedua, menjaga langit dari segala setan pembangkang yang dengan pembangkangannya sampai kepada al-mala’il’ala, yaitu para malaikat. Apabila setan-setan itu berusaha mencuri informasi dengan menguping, maka para malaikat melemparnya dengan suluh api yang cemerlang “dari segala penjuru” untuk mengusir dan menghalau mereka supaya tidak mendengar apa yang dikatakan oleh para malaikat tersebut. “dan bagi mereka siksaan yang kekal,” maksudnya, yang terus menerus, yang telah dipersiapkan untuk mereka karena pembangkaannya dari ketaatan kepada Allah, Rabb mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 8: 8-9. Para setan ini yang mencoba untuk mendengarkan berita dari langit ke langit, mereka akan dilempari dengan panah-panah yang terbakar yang panah-panah tersebut terdapat di berbagai sisi langit. Kemudian Allah menjelaskan bahwa setan-setan ini akan terusir dengan panah-panah ini karena terhalau, terserang dan terbakar, dan mereka para setan di akhrat akan mendapatkan adzab yang pedih yang menunggu mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan meteor."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 8",
    "description": "Dengan adanya penjagaan ketat terhadap setan-setan durhaka itu, mereka tidak dapat mendengar pembicaraan para malaikat yang akan menyampaikan wahyu kepada rasul-Nya. Dan mereka dilempari dengan benda langit yang menyala dari segala penjuru sehingga mereka tidak bisa menambah atau mengurangi wahyu yang akan diturunkan. 9. Kami lemparkan benda langit ke arah setan-setan durhaka itu untuk mengusir mereka dan mereka pun kelak akan mendapat azab yang kekal dan pedih di akhirat."
  }
]