[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seperti balasan untuk nuh itulah kami akan membalas hamba-hamba kami yang berbuat kebaikan dengan menaati Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Kami memberi balasan bagi orang-orang yang berbuat baik dalam beribadah dan menaati Allah semata dengan balasan yang sama dengan yang Kami berikan kepada Nuh -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-82. Demikianlah Kami membalas hamba yang melakukan yang terbaik dalam mentaati dan menjalankan perintah Kami. Sungguh Nabi Nuh benar-benar termasuk hamba-hamba Kami yang beriman dan beramal dengan ikhlas; oleh sebab itu Kami menyelamatkan dan memuliakannya, dan Kami tenggelamkan musuh-musuhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Balasan baik yang kami berikan kepadanya itu juga kami berikan kepada orang-orang baik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82. Allah mengabarkan tentang hamba dan RasulNya, yaitu Nuh rasul pertama, yaitu bahwasanya ketika beliau mengajak kaumnya kepada Allah dalam jangka waktu yang sangat panjang, namun seruan Nuh hanya makin menambah mereka makin jauh, dan Nuh pun telah berdoa kepada Rabbnya seraya mengatakan, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.“ (Nuh:26). Dan ia juga berkata, “Lut berdoa: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\". (Al-ankabut:30). Lalu Allah mengabulkan doanya dan Allah memuji DiriNya seraya berfirman, “maka sesungguhnya (Kami adalah) sebaik-baik yang memperkenankan,” bagi orang-orang yang berdoa dan mendengarkan doa dan sikap merendahkan diri mereka kepadaNya. Allah mengabulkan doa Nabi Nuh sesuai dengan apa yang beliau mohon. Allah menyelamatkannya dan keluarganya dari bencana yang sangat besar dan menenggelamkan seluruh orang-orang kafir dan menyisakan anak keturunannya yang kemudian menjadi pengganti silih berganti, sehingga seluruh manusia (yang ada saat ini) berasal dari keturunan nabi Nuh. Dan Allah menjadikan pujian yang baik dan berlanjut bagi Nabi Nuh hingga zaman manusia-manusia yang terakhir datang. Yang demikian itu karena dia adalah orang yang ihsan dalam beribadah kepada Sang Pencipta dan muhsin (berbuat baik) kepada sesame manusia. Inilah Sunnah Allah pada orang-orang yang berbuat ihsan, yaitu menebarkan pujian baik bagi mereka menurut kadar ihsan (kebaikan) mereka. Dan FirmanNya, “Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.,” menunjukkan bahwa iman merupakan kedudukan manusia yang tertinggi, ia mencakup seluruh syariat-syariat agama, prinsip-prinsip dan cabang-cabangnya, karena Allah memuji manusia-manusia pilihanNya karena imannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 80: Allah mengabarkan bahwa balasan yang baik bagi Nuh adalah sebagai balasan atas keimanan dan ketakwaan, dan ini merupakan kabar gembira bagi orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Balasan Allah Subhaanahu wa Ta'aala kepada Nuh ‘alaihis salam di atas, seperti diselamatkan dari bencana yang besar dan mengabadikan pujian yang baik untuknya di kalangan orang-orang yang datang kemudian serta balasan yang akan ia peroleh di akhirat adalah karena ia termasuk orang-orang yang berbuat ihsan, dia berbuat ihsan dalam beribadah kepada Allah dan berbuat ihsan kepada manusia, dan inilah sunnatullah kepada orang-orang yang berbuat ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 80",
    "description": "Sungguh, demikianlah imbalan itu kami berikan kepada nabi nuh, dan kami pun akan memberi balasan dan imbalan kepada orang-orang yang berbuat baik. 81. Nabi nuh adalah orang yang berbuat baik karena sungguh, dia termasuk di antara hamba-hamba kami yang beriman, jujur, dan ikhlas."
  }
]