[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami menenggelamkan kaumnya yang lain yang mendustakan dengan banjir bandang, sehingga tidak tersisa seorangpun dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Kemudian Kami menenggelamkan sisanya dengan badai topan yang Kami kirimkan kepada mereka, sehingga tidak tersisa seorang pun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Lalu Kami menenggelamkan dan menghancurkan orang-orang kafir dari kaumnya yang lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami menenggelamkan yang lain} orang-orang kafir dari umatnya yang tertinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-82. Allah mengabarkan tentang hamba dan RasulNya, yaitu Nuh rasul pertama, yaitu bahwasanya ketika beliau mengajak kaumnya kepada Allah dalam jangka waktu yang sangat panjang, namun seruan Nuh hanya makin menambah mereka makin jauh, dan Nuh pun telah berdoa kepada Rabbnya seraya mengatakan, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.“ (Nuh:26). Dan ia juga berkata, “Lut berdoa: \"Ya Tuhanku, tolonglah aku (dengan menimpakan azab) atas kaum yang berbuat kerusakan itu\". (Al-ankabut:30). Lalu Allah mengabulkan doanya dan Allah memuji DiriNya seraya berfirman, “maka sesungguhnya (Kami adalah) sebaik-baik yang memperkenankan,” bagi orang-orang yang berdoa dan mendengarkan doa dan sikap merendahkan diri mereka kepadaNya. Allah mengabulkan doa Nabi Nuh sesuai dengan apa yang beliau mohon. Allah menyelamatkannya dan keluarganya dari bencana yang sangat besar dan menenggelamkan seluruh orang-orang kafir dan menyisakan anak keturunannya yang kemudian menjadi pengganti silih berganti, sehingga seluruh manusia (yang ada saat ini) berasal dari keturunan nabi Nuh. Dan Allah menjadikan pujian yang baik dan berlanjut bagi Nabi Nuh hingga zaman manusia-manusia yang terakhir datang. Yang demikian itu karena dia adalah orang yang ihsan dalam beribadah kepada Sang Pencipta dan muhsin (berbuat baik) kepada sesame manusia. Inilah Sunnah Allah pada orang-orang yang berbuat ihsan, yaitu menebarkan pujian baik bagi mereka menurut kadar ihsan (kebaikan) mereka. Dan FirmanNya, “Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.,” menunjukkan bahwa iman merupakan kedudukan manusia yang tertinggi, ia mencakup seluruh syariat-syariat agama, prinsip-prinsip dan cabang-cabangnya, karena Allah memuji manusia-manusia pilihanNya karena imannya tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 82: Allah mengabarkan bahwa Dia menenggelamkan para pendusta dan pencela dari kaum Nuh; Dimana mereka ditenggelamkan dalam banjir bandang, dan tidak tersisa dari mereka satupun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kaumnya yang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 82",
    "description": "Kemudian kami tenggelamkan yang lain akibat kekafiran mereka. 83. Di antara para rasul yang kami utus kepada umat terdahulu adalah nabi ibrahim. Dan sungguh, nabi ibrahim adalah termasuk golongannya, yaitu penerus ajaran dan agama nabi nuh."
  }
]