[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-87 Diantara pengikut nuh yang berjalan diatas manhaj dan agamanya adalah nabiyullah Ibrahim, saat dia datang kepada tuhannya dengan membawa hati yang bersih dari segala akidah sesat dan akhlak tercela saat dia berkata kepada bapaknya dan kaumnya dengan penuh pengingkaran “apa yang kalian sebah selain Allah itu? apakah kalian ingin menyembah tuhan-tuhan buatan dan meninggalkan ibadah kepada Allah yang berhak untuk disembah semata? lalu apa dugaan kalian terhadap apa yang akan dilakukan oleh raabbul alamin bila kalian menyekutukannNya dengan menyembah selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Sesungguhnya Ibrahim termasuk seagama dengan Nuh yang sejalan dengannya dalam menyerukan pengesaan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83-84. Dan orang yang termasuk penolong Nabi Nuh atas agamanya adalah Nabi Ibrahim, ketika dia datang dan memenuhi seruan Allah dengan hati yang bersih dan suci dari segala kepercayaan batil dan akhlak tercela."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَإِنَّ مِن شِيعَتِهِۦ لَإِبْرٰهِيمَ (Dan sesungguhnya Ibrahim benar-benar termasuk golongannya (Nuh)) Yakni Ibrahim termasuk pemeluk agamanya serta sama-sama menjalankan dakwah kepada Allah serta mengajak kepada keimanan dan mengesakan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Sesungguhnya di antara orang yang mengikuti jalannya, memiliki dasar agama, keimanan dan ilmu tauhid yang sama, yaitu Ibrahim AS, sang sahabat."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-84. Maksudnya, sesungguhnya termasuk golongan Nabi Nuh, dan orang yang sejalan dengannya dalam kenabian, kerasulan, menyeru manusia kepada Allah, dan dikabulkan doanya, adalah Nabi Ibrahim al-Khalil, “ketika datang kepada Tuhannya dengan hati yang suci,” dari syirik, syubhat, dan syahwat yang merupakan penghalang untuk memandang yang haq dan mengamalkannya. Apabila hati seorang manusia sudah suci, maka ia suci (selamat) dari segala keburukan dan ia pun pasti meraih segala kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 83: Allah menyebutkan siapa yang mengikuti perjalanan Nuh dan menempuk jalannya dalam istiqamah dan dakwah, dia yaitu Ibrahim. Sebab ia (Ibrahim) mengikuti jalan Nuh dalam kenabian, karena Ibrahim bersungguh-sungguh (berdakwah) kepada kaumnya dan menjumpai penderitaan dan celaan sebagaimana Nuh, dan dia bersabar sebagaimana sabarnya Nuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Nabi Ibrahim ‘alaihis salam termasuk golongan Nabi Nuh ‘alaihis salam dalam keimanan kepada Allah dan pokok-pokok agama meskipun jarak zaman antara keduanya berjauhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 83",
    "description": "Di antara para rasul yang kami utus kepada umat terdahulu adalah nabi ibrahim. Dan sungguh, nabi ibrahim adalah termasuk golongannya, yaitu penerus ajaran dan agama nabi nuh. 84. Nabi ibrahim adalah kekasih Allah. Ingatlah ketika dia datang kepada tuhannya dengan hati yang suci bersih dari keyakinan batil dan akhlak tercela sehingga dalam hatinya hanya ada ketaatan dan kecintaan kepada Allah."
  }
]