[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-87 Diantara pengikut nuh yang berjalan diatas manhaj dan agamanya adalah nabiyullah Ibrahim, saat dia datang kepada tuhannya dengan membawa hati yang bersih dari segala akidah sesat dan akhlak tercela saat dia berkata kepada bapaknya dan kaumnya dengan penuh pengingkaran “apa yang kalian sebah selain Allah itu? apakah kalian ingin menyembah tuhan-tuhan buatan dan meninggalkan ibadah kepada Allah yang berhak untuk disembah semata? lalu apa dugaan kalian terhadap apa yang akan dilakukan oleh raabbul alamin bila kalian menyekutukannNya dengan menyembah selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Ingatlah ketika dia datang kepada Rabbnya dengan membawa hati yang bersih dari syirik, tulus kepada Allah dalam menasihati makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. إِذْ جَآءَ رَبَّهُۥ بِقَلْبٍ سَلِيمٍ ((lngatlah) ketika ia datang kepada Tuhannya dengan hati yang suci) Hati yang suci yakni hati yang bersih dan dibersihkan dari kemusyrikan dan keraguan yang selalu menasehati hamba-hamba lainnya untuk menuju jalan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Wahai Nabi, ingatlah saat Ibrahim mendekati Tuhannya untuk beribadah dan menaatinya dengan hati yang ikhlas dan bersih dari kesyirikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika dia datang kepada Tuhannya dengan hati yang suci} suci dari kemusyrikan dan keragu-raguan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83-84. Maksudnya, sesungguhnya termasuk golongan Nabi Nuh, dan orang yang sejalan dengannya dalam kenabian, kerasulan, menyeru manusia kepada Allah, dan dikabulkan doanya, adalah Nabi Ibrahim al-Khalil, “ketika datang kepada Tuhannya dengan hati yang suci,” dari syirik, syubhat, dan syahwat yang merupakan penghalang untuk memandang yang haq dan mengamalkannya. Apabila hati seorang manusia sudah suci, maka ia suci (selamat) dari segala keburukan dan ia pun pasti meraih segala kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 84: Sebutkanlah wahai Nabi Allah, ketika datang Ibrahim dengan hati yang selamat dari kesyirikan dan keraguan, yang dia menjadi peringatan untuk kaumnya, yang mereka di dalam kesyirikan dan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya ialah mengikhlaskan hatinya kepada Allah dengan sesungguhnya, atau maksudnya datang kepada Allah dengan hati yang selamat dari syirk, syak (keraguan), syubhat dan syahwat yang menghalangi untuk memandang jernih kebenaran serta mengamalkannya. Jika hati seorang hamba sudah bersih dan baik, maka otomatis anggota badannya pun bersih dan baik. Oleh karena itulah, Beliau menasihati manusia karena Allah dan ia mulai dengan orang yang terdekatnya, yaitu bapaknya kemudian kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 84",
    "description": "Nabi ibrahim adalah kekasih Allah. Ingatlah ketika dia datang kepada tuhannya dengan hati yang suci bersih dari keyakinan batil dan akhlak tercela sehingga dalam hatinya hanya ada ketaatan dan kecintaan kepada Allah. 85. Ingatlah ketika dia dengan maksud mengingatkan berkata kepada , 'apakah yang kamu sembah itu'."
  }
]