[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-87 Diantara pengikut nuh yang berjalan diatas manhaj dan agamanya adalah nabiyullah Ibrahim, saat dia datang kepada tuhannya dengan membawa hati yang bersih dari segala akidah sesat dan akhlak tercela saat dia berkata kepada bapaknya dan kaumnya dengan penuh pengingkaran “apa yang kalian sebah selain Allah itu? apakah kalian ingin menyembah tuhan-tuhan buatan dan meninggalkan ibadah kepada Allah yang berhak untuk disembah semata? lalu apa dugaan kalian terhadap apa yang akan dilakukan oleh raabbul alamin bila kalian menyekutukannNya dengan menyembah selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Ketika dia berkata kepada bapaknya dan kaumnya yang musyrikin menyalahkan perbuatan mereka, “Apa yang kalian sembah selain Allah ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85-87. Saat dia berkata kepada ayah dan kaumnya: “Tuhan-tuhan apa yang kalian sembah selain Allah dengan penuh kedustaan ini? Kemudian kalian berpaling dari menyembah Allah, sedangkan hanya Dia yang berhak disembah. Bagaimana anggapan kalian terhadap Allah, Tuhan semesta alam, sedangkan kalian telah menyembah selain Dia? Apakah Dia tidak akan mengazab kalian?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Ketika berkata dengan nada menegur kepada ayah dan kaumnya karena mereka menyembah berhala: “Apakah yang kalian sembah?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika dia berkata kepada ayahnya dan kaumnya,“Apa yang kalian sembah itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85-87. Di antara kesuciannya adalah ia suci dari sifat curang dan dengki terhadap manusia dan dari sifat-sifat (akhlak) yang buruk lainnya. Maka dari itu beliau telah berhasil menasehati manusia karena Allah, dan ia mulai dari ayahnya dan kaumnya. Allah berfirman, “ketika ia berkata kepada bapaknya dan kaumnya, ‘Apakah yang kamu sembah itu?’” ini adalah bentuk pertanyaan dengan maksud mengingkari dan mengukuhkan hujjah (argument) kepada mereka. “Apakah kamu menghendaki sembahan-sembahan selain Allah dengan jalan berbohong?” maksudnya, apakah kalian menyembah selain tuhan-tuhan secara dusta, padahal mereka bukan Tuhan dan ia tidak pantas disembah?! “Maka apakah anggapanmu terhadap Rabb semesta alam,” kalau DIa bertindak terhadap kalian, sedangkan kalian telah menyembah selain DIa?! Ini adalah suatu peringatan keras bagi mereka akan balasan dengan azab jika mereka terus melakukan kesyirikan! Kekurangan (kelemahan) apa yang kalian duga terhadap Allah Tuhan semesta alam hingga kalian menjadikan tandingan dan sekutu bagiNYa?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 85: Berilah peringatan wahai Nabi Allah akan hari ketika Ibrahim berkata kepada bapaknya dan kaumnya dengan rasa heran, dan meningkari mereka : Apa ini yang kalian sembah selain Allah, dan memalingkan ibadah kepada-Nya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pertanyaan ini maksudnya adalah mengingkari dan membuat mereka menerima hujjah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 85",
    "description": "Ingatlah ketika dia dengan maksud mengingatkan berkata kepada , 'apakah yang kamu sembah itu'86. Apakah kamu menghendaki kebohongan dengan sesembahan selain Allah itu sehingga kamu menganggap benar apa yang kamu lakukan'"
  }
]