[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-87 Diantara pengikut nuh yang berjalan diatas manhaj dan agamanya adalah nabiyullah Ibrahim, saat dia datang kepada tuhannya dengan membawa hati yang bersih dari segala akidah sesat dan akhlak tercela saat dia berkata kepada bapaknya dan kaumnya dengan penuh pengingkaran “apa yang kalian sebah selain Allah itu? apakah kalian ingin menyembah tuhan-tuhan buatan dan meninggalkan ibadah kepada Allah yang berhak untuk disembah semata? lalu apa dugaan kalian terhadap apa yang akan dilakukan oleh raabbul alamin bila kalian menyekutukannNya dengan menyembah selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Wahai kaumku! Apa anggapan kalian terhadap Allah Rabb alam semesta jika kalian menghadap kepada-Nya sementara kalian menyembah selain-Nya? Menurut kalian, apa yang akan Dia lakukan terhadap kalian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. فَمَا ظَنُّكُم بِرَبِّ الْعٰلَمِينَ (Maka apakah anggapanmu terhadap Tuhan semesta alam?”) Yakni jika kalian telah menghadap-Nya dalam keadaan kalian menyembah selain-Nya, bagaimana menurut kalian, apa yang akan Dia lakukan terhadap kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Apakah anggapan kalian tentang Tuhan semesta alam saat bertemu denganNya sedangkan kalian menyembah selainNya? Apakah kalian akan menganggap bahwa Dia pencipta kalian?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bagaimana anggapanmu terhadap Tuhan semesta alam”} Maka apa anggapanmu tentang Tuhan semesta alam yang menciptakan kalian, ketika kalian menemuiNya sedangkan kalian menyembaah kepaada selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85-87. Di antara kesuciannya adalah ia suci dari sifat curang dan dengki terhadap manusia dan dari sifat-sifat (akhlak) yang buruk lainnya. Maka dari itu beliau telah berhasil menasehati manusia karena Allah, dan ia mulai dari ayahnya dan kaumnya. Allah berfirman, “ketika ia berkata kepada bapaknya dan kaumnya, ‘Apakah yang kamu sembah itu?’” ini adalah bentuk pertanyaan dengan maksud mengingkari dan mengukuhkan hujjah (argument) kepada mereka. “Apakah kamu menghendaki sembahan-sembahan selain Allah dengan jalan berbohong?” maksudnya, apakah kalian menyembah selain tuhan-tuhan secara dusta, padahal mereka bukan Tuhan dan ia tidak pantas disembah?! “Maka apakah anggapanmu terhadap Rabb semesta alam,” kalau DIa bertindak terhadap kalian, sedangkan kalian telah menyembah selain DIa?! Ini adalah suatu peringatan keras bagi mereka akan balasan dengan azab jika mereka terus melakukan kesyirikan! Kekurangan (kelemahan) apa yang kalian duga terhadap Allah Tuhan semesta alam hingga kalian menjadikan tandingan dan sekutu bagiNYa?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 87: Ibrahim berakata kepada mereka dengan pengingkaran : Apa sangkaan kalian kepada Allah jika kalian telah memalingkan peribadatan kepada selain-Nya? Tidak diragukan lagi bahwa Dia akan menghisab kalian dengan hisab yang sulit, dan mengadzab kalian dengan adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bagaimana anggapanmu jika kamu menemui-Nya sedangkan kamu menyembah selain-Nya, apa yang akan Dia lakukan terhadapmu, atau apa anggapanmu tentang tindakan yang akan dilakukan Tuhan semesta alam terhadapmu karena kamu menyembah selain-Nya? Ini merupakan kalimat untuk menakut-nakuti mereka dengan siksaan jika mereka tetap di atas perbuatan syirknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 87",
    "description": "Hanya Allah yang patut disembah. Maka, bagaimana anggapanmu terhadap tuhan seluruh alam jika kalian mengingkari-Nya, bahkan menyembah selain dia'88. Demikianlah nabi ibrahim mengingatkan ayah dan kaumnya agar meninggalkan kemusyrikan, lalu dia memandang sekilas ke bintang-bintang untuk berpikir, ."
  }
]