[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-90 Lalu Ibrahim memandang sepintas ke bintang-bintang dimana kaumnya memang menyembahnya, seraya memikirkan alasan yang akan disodorkan kepada kaumnya agar tidak berangkat bersama mereka menghadiri hari raya mereka, ”saya sakit” ini adalah ungkapan kias darinya, maka merekapun meningggalkannya di belakang mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Ibrahim memandang ke bintang sejenak untuk memikirkan taktik melepaskan diri agar tidak berangkat bersama kaumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88-89. Kemudian Ibrahim menatap bintang-bintang di langit sebagaimana kebiasaan kaumnya melakukan itu; dia menghayati dan menjadikan bintang-bintang itu sebagai tanda berbagai kejadian, kemudian dia mengajukan uzur kepada kaumnya untuk tidak ikut pergi ke perayaan mereka: “Aku sedang sakit, sehingga aku tidak akan ikut pergi.” Maka kaumnya meninggalkannya dan pergi ke kerayaan tanpa dirinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88-89. فَقَالَ إِنِّى سَقِيم فَنَظَرَ نَظْرَةً فِى النُّجُومِ (Lalu ia memandang sekali pandang ke bintang-bintang. Kemudian ia berkata: “Sesungguhnya aku sakit”) Dikatakan bahwa mereka dahulu mempelajari ilmu perbintangan, sehingga Ibrahim berinteraksi dengan hal itu agar mereka tidak mengingkarinya. Hal ini karena Ibrahim ingin membuat rencana untuk membuat bukti bagi mereka bahwa berhala-berhala itu bukanlah tuhan, sebab mereka di keesokan harinya harus pergi merayakan hari raya, dan Ibrahim tidak ingin mengikutinya sehingga dia beralasan sedang sakit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88-89. Lalu dia memandang bintang-bintang dengan berangan-angan dan berpikir mendalam untuk mereka bahwa dia sedang melamunkan bintang dan sedang sakit sehingga dia tidak keluar bersama mereka untuk merayakan hari raya. Kenyataannya bahwa dia sakit hati karena bersedih atas kekufuran mereka kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia memandang sekilas ke arah bintang-bintang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-93. Lalu, Nabi Ibrahim hendak menghancurkan patung-patung mereka, dan beliau mampu menghabisinya. Maka beliau pun mengambil kesempatan pada saat mereka lalai, tatkala mereka pergi menuju salah satu hari raya mereka, dan Ibrahim pun turut keluar bersama mereka, “Lalu ia memandang sekali pandang ke bintang-bintang, kemudian ia berkata, ‘Sesungguhnya aku sakit’.” Di dalam sebuah hadits shahih disebutkan, “Ibrahim tidak pernah berdusta kecuali tiga kali dusta saja, yaitu: ketika berkata, ‘SEsungguhnya aku sakit’, ketika berkata, ‘SEsungguhnya itu dilakukan oleh patung yang paling besar ini’, dan ketika berkata tentang istrinya, “Dia adalah saudara perempuanku’.” Maksudnya adalah bahwa Nabi Ibrahim tidak ikut serta bersama mereka dengan maksud supaya bisa menghancurkan berhala-berhala mereka. Maka dari itu, “mereka berpaling dari padanya dengan membelakang.” Dan tatkala beliau menemukan kesempatan, “ia pergi dengan diam-diam kepada berhala-berhala mereka,” maksudnya, segera pergi kepadanya secara sembunyi-bunyi dan penuh kehati-hatian, “Lalu ia berkata” dengan nada mengejeknya, “Apakah kamu tidak makan? Kenapa kamu tidak berbicara?” artinya, bagaimana ia layak disembah padahal ia lebih lemah daripada hewan-hewan yang bisa makan dan berbicara; sedangkan berhala-berhala ini adalah benda mati yang tidak makan dan tidak pula bisa berbicara? “Lalu dihadapinya berhala-berhala itu sambil memukul-mukulnya dengan kuat dank eras hingga menjadi hancur, kecuali berhala yang terbesar milik mereka (dibiarkannya) agar mereka kembali kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 88: Kemudian Ibrahim memandang ke arah bintang dengan penuh heran, bahwasanya bintang tersebut memiliki pengaruh sebagaimana yang kaumnya yakini, dan dia berpikir untuk mencari cara agar dapat memiliki udzur untuk tidak datang dalam perayaan mereka; Dimana mereka mengundang untuk hadir dalam perayaan mereka dan kemudian Ibrahim (berencana) ingin mengosongkan sesembahan-sesembahan mereka dan mengancurkannya (ketika kaumnya hadir dalam satu perayaan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kaum Nabi Ibrahim adalah orang-orang yang biasa mempelajari ilmu nujum, maka pada suatu hari mereka keluar mendatangi tempat mereka berhari raya dan meninggalkan makanannya di dekat patung-patung sambil bertabarruk (ngalap berkah) dari patung-patung itu, di mana jika mereka kembali, maka mereka akan makan makanan itu. Ketika mereka hendak keluar, mereka berpapasan dengan Nabi Ibrahim dan berkata kepadanya, “Keluarlah bersama kami.” Lalu Nabi Ibrahim memandang sekilas ke bintang dan berkata, “Sesungguhnya aku sakit,” dengan maksud agar ia tetap di situ untuk melaksanakan rencananya menghancurkan sesembahan mereka. Dalam sebuah hadits yang shahih disebutkan, bahwa Nabi Ibrahim ‘alaihis salam tidaklah berdusta kecuali dalam tiga keadaan; dua di antaranya dilakukan karena Allah ‘Azza wa Jalla, yaitu ucapannya, “Sesungguhnya saya sakit,” ucapannya, “Bahkan patung yang besar inilah yang melakukannya (yang menghancurkannya),” dan ucapannya tentang istrinya, “Sesungguhnya dia saudariku.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 88",
    "description": "Demikianlah nabi ibrahim mengingatkan ayah dan kaumnya agar meninggalkan kemusyrikan, lalu dia memandang sekilas ke bintang-bintang untuk berpikir, 89. Kemudian dia menemukan alasan untuk tidak pergi bersama kaumnya dalam acara perayaan, lalu dia berkata, 'sesungguhnya aku sakit. '."
  }
]