[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Setan-setan tidak mampu sampai ke al-mala al’la yaitu langit dan para malaikat yang ada di sana, untuk mendengar perbincangan mereka saat mereka membicarakan wahyu Allah swt tetang syariat dan takdirNya, setan-setan itu di lempari api-api dari segala penjuru agar mereka tidak bisa mendengar, dan diakhirat nanti mereka akan mendapatkan siksa abadi yang sangat menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Mereka diusir dan dihalau agar tidak mendengar pembicaraan para malaikat, dan bagi mereka di Akhirat azab yang menyakitkan serta abadi tidak terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Mereka ditolak sejauh-jauhnya. Dan bagi mereka itu azab abadi yang tak terputus-putus di akhirat, atau azab yang sangat pedih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk mengusir mereka} untuk mengusir dan menjauhkan mereka dari mendengarnya {Bagi mereka azab yang kekal} yang kekal lagi menyakitkan tanpa henti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-9. “sesungguhnya Kami telah menghias langit dunia (yang terdekat) dengan hiasan bintang-bintang, dan telah memeliharanya dari setiap setan yang sangat durhaka, setan-setan itu tidak dapat mendengar pembicaraan para malaikat,” Allah menjelaskan dua faidah besar berikut ini berkaitan dengan bintang-bintang: Petama, adalah keberadaannya sebagai perhiasan langit, sebab kalau tidak ada bintang, niscaya langit ini akan menjadi gelap gulita, tidak memilki cahaya. Maka Allah menjadikan bintang sebagai hiasan didalamnya agar segenap penjurunya terang dan bentuknya menjadi indah serta bisa dijadikan sebagai pedoman (petunjuk arah) dalam kegelapan darat dan lautan serta banyak terdapat maslahat besar lain darinya. Kedua, menjaga langit dari segala setan pembangkang yang dengan pembangkangannya sampai kepada al-mala’il’ala, yaitu para malaikat. Apabila setan-setan itu berusaha mencuri informasi dengan menguping, maka para malaikat melemparnya dengan suluh api yang cemerlang “dari segala penjuru” untuk mengusir dan menghalau mereka supaya tidak mendengar apa yang dikatakan oleh para malaikat tersebut. “dan bagi mereka siksaan yang kekal,” maksudnya, yang terus menerus, yang telah dipersiapkan untuk mereka karena pembangkaannya dari ketaatan kepada Allah, Rabb mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 9: 8-9. Para setan ini yang mencoba untuk mendengarkan berita dari langit ke langit, mereka akan dilempari dengan panah-panah yang terbakar yang panah-panah tersebut terdapat di berbagai sisi langit. Kemudian Allah menjelaskan bahwa setan-setan ini akan terusir dengan panah-panah ini karena terhalau, terserang dan terbakar, dan mereka para setan di akhrat akan mendapatkan adzab yang pedih yang menunggu mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 9",
    "description": "Kami lemparkan benda langit ke arah setan-setan durhaka itu untuk mengusir mereka dan mereka pun kelak akan mendapat azab yang kekal dan pedih di akhirat. 10. Setan-setan itu tidak dapat mendengar pembicaraan para malaikat, kecuali setan yang berhasil mencuri pembicaraan dengan cepat, maka ia dikejar oleh bintang yang menyala sehingga mereka pun terbakar."
  }
]