[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "89-90 Lalu Ibrahim memandang sepintas ke bintang-bintang dimana kaumnya memang menyembahnya, seraya memikirkan alasan yang akan disodorkan kepada kaumnya agar tidak berangkat bersama mereka menghadiri hari raya mereka, ”saya sakit” ini adalah ungkapan kias darinya, maka merekapun meningggalkannya di belakang mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Mereka meninggalkannya di belakang mereka dan mereka pun berangkat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90-92. Kemudian Ibrahim segera pergi ke tempat berhala-berhala milik kaumnya, dan dia berkata untuk menghina berhala-berhala itu dan penyembahnya: “Mengapa kalian tidak memakan makanan yang dipersembahkan para penyembah kalian? Mengapa kalian tidak berbicara dan menjawab pertanyaanku?” Ini merupakan penegasan bahwa berhala-berhala itu tidak dapat mendatangkan manfaat dan mudharat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. فَتَوَلَّوْا۟ عَنْهُ مُدْبِرِينَ (Lalu mereka berpaling daripadanya dengan membelakang) Mereka meninggalkannya lalu mereka pergi ke hari raya mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90-91. Lalu mereka meninggalkannya dan pergi untuk merayakan hari raya mereka. Kemudian dengan sembunyi-sembunyi, dia menghampiri berhala-berhala mereka yang di sisinya telah disediakan makanan. Lalu dia berkata sembari mengejek dan mengolok-olok: “Apakah kalian tidak memakan makanan yang telah disediakan untuk kalian ini?” Namun mereka tidak berkata apapun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka berpaling} berpaling {darinya seraya meninggalkannya} berpaling pergi menuju hari raya mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-93. Lalu, Nabi Ibrahim hendak menghancurkan patung-patung mereka, dan beliau mampu menghabisinya. Maka beliau pun mengambil kesempatan pada saat mereka lalai, tatkala mereka pergi menuju salah satu hari raya mereka, dan Ibrahim pun turut keluar bersama mereka, “Lalu ia memandang sekali pandang ke bintang-bintang, kemudian ia berkata, ‘Sesungguhnya aku sakit’.” Di dalam sebuah hadits shahih disebutkan, “Ibrahim tidak pernah berdusta kecuali tiga kali dusta saja, yaitu: ketika berkata, ‘SEsungguhnya aku sakit’, ketika berkata, ‘SEsungguhnya itu dilakukan oleh patung yang paling besar ini’, dan ketika berkata tentang istrinya, “Dia adalah saudara perempuanku’.” Maksudnya adalah bahwa Nabi Ibrahim tidak ikut serta bersama mereka dengan maksud supaya bisa menghancurkan berhala-berhala mereka. Maka dari itu, “mereka berpaling dari padanya dengan membelakang.” Dan tatkala beliau menemukan kesempatan, “ia pergi dengan diam-diam kepada berhala-berhala mereka,” maksudnya, segera pergi kepadanya secara sembunyi-bunyi dan penuh kehati-hatian, “Lalu ia berkata” dengan nada mengejeknya, “Apakah kamu tidak makan? Kenapa kamu tidak berbicara?” artinya, bagaimana ia layak disembah padahal ia lebih lemah daripada hewan-hewan yang bisa makan dan berbicara; sedangkan berhala-berhala ini adalah benda mati yang tidak makan dan tidak pula bisa berbicara? “Lalu dihadapinya berhala-berhala itu sambil memukul-mukulnya dengan kuat dank eras hingga menjadi hancur, kecuali berhala yang terbesar milik mereka (dibiarkannya) agar mereka kembali kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 90: Kemudian Allah menjelaskan bahwa Ibrahim ditinggalkan sendirian dan mereka semua keluar menghadiri perayaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saat itulah Beliau menemukan kesempatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 90",
    "description": "Mendengar jawaban nabi ibrahim, lalu mereka berpaling dari dia dan pergi meninggalkannya menuju tempat perayaan sesat itu berlangsung. 91. Tidak lama kemudian dia, yakni nabi ibrahim, pergi dengan diam-diam kepada berhala-berhala mereka; lalu dia berkata kepadanya dengan nada mengejek 'mengapa kamu tidak makan sajian yang mereka sediakan untukmu'."
  }
]