[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "91-92 Maka Ibrahim segera mendatangi berhala-berhala kaumnya, Ibrahim berkata menghinanya “mengapa kalian tidak makan makanan-makanan yang disuguhkan oleh penjaga-penjaga kalian? mengapa kalian diam saja dan tidak menjawab orang yang bertanya kepada kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Maka Ibrahim mendatangi berhala-berhala yang mereka sembah selain Allah. Dia mencibir berhala-berhala tersebut, “Mengapa kalian tidak menyantap makanan yang dibuat oleh para pemuja kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. فَرَاغَ إِلَىٰٓ ءَالِهَتِهِمْ (Kemudian ia pergi dengan diam-diam kepada berhala-berhala mereka) Ia berbelok untuk menuju berhala-berhala itu. فَقَالَ أَلَا تَأْكُلُونَ (lalu ia berkata: “Apakah kamu tidak makan?) Yakni Ibrahim berkata kepada berhala-berhala yang dia tuju itu untuk mengolok-olok mereka: “tidakkah kalian makan?” yakni makanan yang biasa kaumnya berikan untuk berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90-91. Lalu mereka meninggalkannya dan pergi untuk merayakan hari raya mereka. Kemudian dengan sembunyi-sembunyi, dia menghampiri berhala-berhala mereka yang di sisinya telah disediakan makanan. Lalu dia berkata sembari mengejek dan mengolok-olok: “Apakah kalian tidak memakan makanan yang telah disediakan untuk kalian ini?” Namun mereka tidak berkata apapun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia menuju ke tuhan-tuhan mereka} lalu dia pergi bergegas dengan diam-diam menuju berhala-berhala mereka {lalu berkata,“Apakah kalian tidak makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-93. Lalu, Nabi Ibrahim hendak menghancurkan patung-patung mereka, dan beliau mampu menghabisinya. Maka beliau pun mengambil kesempatan pada saat mereka lalai, tatkala mereka pergi menuju salah satu hari raya mereka, dan Ibrahim pun turut keluar bersama mereka, “Lalu ia memandang sekali pandang ke bintang-bintang, kemudian ia berkata, ‘Sesungguhnya aku sakit’.” Di dalam sebuah hadits shahih disebutkan, “Ibrahim tidak pernah berdusta kecuali tiga kali dusta saja, yaitu: ketika berkata, ‘SEsungguhnya aku sakit’, ketika berkata, ‘SEsungguhnya itu dilakukan oleh patung yang paling besar ini’, dan ketika berkata tentang istrinya, “Dia adalah saudara perempuanku’.” Maksudnya adalah bahwa Nabi Ibrahim tidak ikut serta bersama mereka dengan maksud supaya bisa menghancurkan berhala-berhala mereka. Maka dari itu, “mereka berpaling dari padanya dengan membelakang.” Dan tatkala beliau menemukan kesempatan, “ia pergi dengan diam-diam kepada berhala-berhala mereka,” maksudnya, segera pergi kepadanya secara sembunyi-bunyi dan penuh kehati-hatian, “Lalu ia berkata” dengan nada mengejeknya, “Apakah kamu tidak makan? Kenapa kamu tidak berbicara?” artinya, bagaimana ia layak disembah padahal ia lebih lemah daripada hewan-hewan yang bisa makan dan berbicara; sedangkan berhala-berhala ini adalah benda mati yang tidak makan dan tidak pula bisa berbicara? “Lalu dihadapinya berhala-berhala itu sambil memukul-mukulnya dengan kuat dank eras hingga menjadi hancur, kecuali berhala yang terbesar milik mereka (dibiarkannya) agar mereka kembali kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 91: Kemudian Ibrahim mengambil kampak dan kemudian bergegas keluar menuju sesembahan-sesembahan dan tuhan-tuhan mereka dan mengambil mereka seraya berkata : Apakah kalian tidak makan wahai berhala-berhala, dengan makanan ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud Ibrahim dengan perkataan itu, ialah mengejek berhala-berhala itu, karena di dekat berhala itu banyak diletakkan makanan-makanan yang enak sebagai sajian-sajian (sesajen)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 91",
    "description": "Tidak lama kemudian dia, yakni nabi ibrahim, pergi dengan diam-diam kepada berhala-berhala mereka; lalu dia berkata kepadanya dengan nada mengejek 'mengapa kamu tidak makan sajian yang mereka sediakan untukmu'92. Mengapa kamu tidak menjawab sepatah kata pun''."
  }
]