[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "91-92 Maka Ibrahim segera mendatangi berhala-berhala kaumnya, Ibrahim berkata menghinanya “mengapa kalian tidak makan makanan-makanan yang disuguhkan oleh penjaga-penjaga kalian? mengapa kalian diam saja dan tidak menjawab orang yang bertanya kepada kalian?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Mengapa kalian tidak berkata-kata, tidak menjawab siapa yang bertanya kepada kalian? Apakah (benda) seperti ini disembah selain Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. مَا لَكُمْ لَا تَنطِقُونَ (Kenapa kamu tidak menjawab?”) Ibrahim telah mengetahui bahwa berhala-berhala itu hanyalah benda mati yang tidak dapat berbicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92-93. Kenapa kalian tidak makan (makan itu) dan menjawab aku? Lalu dia mendekati dan memukul mereka dengan sangat keras kemudian menghancurkan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kamu tidak berbicara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-93. Lalu, Nabi Ibrahim hendak menghancurkan patung-patung mereka, dan beliau mampu menghabisinya. Maka beliau pun mengambil kesempatan pada saat mereka lalai, tatkala mereka pergi menuju salah satu hari raya mereka, dan Ibrahim pun turut keluar bersama mereka, “Lalu ia memandang sekali pandang ke bintang-bintang, kemudian ia berkata, ‘Sesungguhnya aku sakit’.” Di dalam sebuah hadits shahih disebutkan, “Ibrahim tidak pernah berdusta kecuali tiga kali dusta saja, yaitu: ketika berkata, ‘SEsungguhnya aku sakit’, ketika berkata, ‘SEsungguhnya itu dilakukan oleh patung yang paling besar ini’, dan ketika berkata tentang istrinya, “Dia adalah saudara perempuanku’.” Maksudnya adalah bahwa Nabi Ibrahim tidak ikut serta bersama mereka dengan maksud supaya bisa menghancurkan berhala-berhala mereka. Maka dari itu, “mereka berpaling dari padanya dengan membelakang.” Dan tatkala beliau menemukan kesempatan, “ia pergi dengan diam-diam kepada berhala-berhala mereka,” maksudnya, segera pergi kepadanya secara sembunyi-bunyi dan penuh kehati-hatian, “Lalu ia berkata” dengan nada mengejeknya, “Apakah kamu tidak makan? Kenapa kamu tidak berbicara?” artinya, bagaimana ia layak disembah padahal ia lebih lemah daripada hewan-hewan yang bisa makan dan berbicara; sedangkan berhala-berhala ini adalah benda mati yang tidak makan dan tidak pula bisa berbicara? “Lalu dihadapinya berhala-berhala itu sambil memukul-mukulnya dengan kuat dank eras hingga menjadi hancur, kecuali berhala yang terbesar milik mereka (dibiarkannya) agar mereka kembali kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 92: Kemudian dia berkata : Mengapa kalian tidak dapat bicara dan menjawab pertanyaanku? Ibrahim mengetahui bahwa mereka (sesembahan-sesembahan tersebut) tidak dapat menjawab, dia (Ibrahim) melakukan hal itu untuk mencemooh kebiasaan kaumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika demikian sangat tidak layak sekali sesembahan seperti ini disembah, di mana ia lebih lemah daripada hewan yang masih bisa makan dan bersuara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 92",
    "description": "Mengapa kamu tidak menjawab sepatah kata pun''93. Lalu dihadapinya berhala-berhala itu sambil memukulnya dengan ta-ngan kanannya hingga hancur."
  }
]