[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "95-96 maka Ibrahim menghadapi mereka dengan penuh keteguhan Ibrahim berkata ”bagaimana kalian menyembah berhala yang kalian pahat sendiri dan kalian buat dengan tangan kalian sendiri, lalu kalian meninggalkan penyembahan kepada tuhan kalian yang telah menciptakan kalian dan menciptakan amal perbuatan kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Padahal Allah -Subḥānahu- yang menciptakan kalian dan menciptakan perbuatan kalian, di antaranya adalah perbuatan kalian membuat berhala-berhala ini. Dia lah yang berhak untuk disembah semata dan tidak disekutukan dengan selain-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. وَاللهُ خَلَقَكُمْ وَمَا تَعْمَلُونَ (Padahal Allah-lah yang menciptakan kamu dan apa yang kamu perbuat itu”) Serta Allah secara umum menciptakan apa yang kalian buat, termasuk berhala-berhala yang kalian pahat. Sehingga yang dimaksud dengan “yang kalian perbuat” adalah pembuatan dan pemahatan dan lainnya yang mereka lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94-95-96. Para penyembah berhala itu bergegas mendatanginya saat mengetahui kejadian itu. Kemudian dengan mengejek, Ibrahim berkata kepada mereka: “Apakah kalian akan menyembah berhala-berhala yang kalian ukir sendiri? Allahlah yang menciptakan kalian dan benda yang kalian buat. Maka menyembahlah hanya kepadaNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Padahal Allahlah yang menciptakan kalian dan apa yang kalian buat itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94-96. “Kemudian kaumnya datang kepadanya dengan bergegas,” maksudnya, segera dan terburu-buru, mereka hendak menghajar beliau setelah mereka mencarinya. Dan “Mereka berkata: \"Siapakah yang melakukan perbuatan ini terhadap tuhan-tuhan kami, sesungguhnya dia termasuk orang-orang yang lalim\". (Al-Anbiya:59). Lalu dikatakan kepada mereka, “Mereka berkata: \"Kami dengar ada seorang pemuda yang mencela berhala-berhala ini yang bernama Ibrahim\". (al-Anbiyaa:60). Dan Ibrahim berkata, “Demi Allah, sesungguhnya aku akan melakukan tipu daya terhadap berhala-berhalamu sesudah kamu pergi meninggalkannya” (Al-Anbiya:57). Mereka pun mencela dan memaki Ibrahim, lalu Nabi Ibrahaim menjawab, “Ibrahim menjawab: \"Sebenarnya patung yang besar itulah yang melakukannya, maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara\".Maka mereka telah kembali kepada kesadaran mereka dan lalu berkata: \"Sesungguhnya kamu sekalian adalah orang-orang yang menganiaya (diri sendiri)\",kemudian kepala mereka jadi tertunduk (lalu berkata): \"Sesungguhnya kamu (hai Ibrahim) telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara\". Ibrahim berkata: \"Maka mengapakah kamu menyembah selain Allah sesuatu yang tidak dapat memberi manfaat sedikit pun dan tidak (pula) memberi mudarat kepada kamu?\" (Al-Anbiya:63-66). Sedangkan di sini (dalam surat ash-shaaffat) ini Ibrahim mengatakan, “Apakah kamu menyembah patung-patung yang kamu pahat,” dengan tangan kalian sendiri dan kalian membuatnya. Bagaimana kalian menyembahnya padahal kalian sendiri yang membuat mereka dan kalian meninggalkan keikhlasan (ketulusan ibadah) kepada Allah yang “menciptaakan kamu dan apa yang kamu perbuat itu?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 96: Kemudian Ibrahim berkata : Tinggalkan semua itu, dan sembahlah Allah yang menciptakan kalian dan amalan-amalan kalian!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni maka sembahlah Dia. Ayat ini juga menunjukan, bahwa amal manusia juga makhluk ciptaan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 96",
    "description": "Mengapa kamu tidak menyembah Allah, padahal Allah-lah yang menciptakan kamu dan apa yang kamu perbuat itu''97. Kaum yang kafir itu kalah dalam beradu argumen dengan nabi ibrahim, kemudian mereka berkata, 'buatlah bangunan perapian untuk kita membakar-Nya; lalu lemparkan dia ke dalam api yang menyala-Nyala itu. '."
  }
]