[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Manakala hujjah telah tegak atas mereka, merekapun menggunakan kekuatan, mereka berkata, ”bangunkanlah untuknya sebuah bangunan, isilah dengan kayu bakar lalu lemparkanlah dia kedalamnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Ketika mereka kalah dalam menghadapi hujah Ibrahim, maka mereka pun menggunakan kekerasan. Mereka bermusyawarah di antara mereka tentang apa yang hendak mereka perbuat terhadap Ibrahim. Mereka berkata, “Dirikanlah suatu bangunan, isilah dengan kayu bakar, kemudian bakarlah, lalu campakkanlah dia ke dalamnya. “"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Maka mereka bersepakat untuk menyiksanya; mereka berkata: “buatlah bangunan dan penuhilah dengan kayu bakar, lalu bakarlah kayu itu dan masukkanlah Ibrahim ke dalamnya.” Mereka memakai cara kekerasan seperti itu merupakan bukti lemahnya hujjah mereka dalam menjawab hujjah Ibrahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. قَالُوا۟ ابْنُوا۟ لَهُۥ بُنْيٰنًا فَأَلْقُوهُ فِى الْجَحِيمِ (Mereka berkata: “Dirikanlah suatu bangunan untuk (membakar) Ibrahim; lalu lemparkanlah dia ke dalam api yang menyala-nyala itu”) Mereka saling berunding untuk membangun bangunan dari batu untuk mereka isi dengan kayu bakar yang mereka nyalakan agar mereka dapat melempar Ibrahim ke dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Sembari berdiskusi tentang peristiwa yang terjadi di antara mereka itu, kaum Ibrahim berkata: “Dirikanlah untuknya bangunan yang terbuat dari batu, lalu isilah dengan kayu bakar dan nyalakanlah api, kemudian lemparkanlah dia ke dalamnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Buatlah bangunan untuknya, lalu lemparkan dia ke dalam api"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98. “Mereka berkata, ‘Dirikanlah suatu bangunan untuk Ibrahim’,” yang sangat tinggi kemudian nyalakan api di atasnya. “Lalu lemparkanlah dia dalam api yang menyala-nyala itu,” sebagai balasan atas perbuatannya menghancurkan berhala-berhala mereka; dan mereka pun hendak “melakukan tipu muslihat kepadanya” yaitu membunuhnya dengan pembunuhan yang paling keji, “maka Kami jadikan mereka orang-orang yang hina”; Allah mengembalikan tipu muslihat mereka ke leher mereka sendiri dan Allah jadikan api itu dingin dan keselamatan bagi Nabi Ibrahim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 97: Maka ketika selesai Ibrahim memberikan hujjah kepada mereka dan mengalahkan mereka; Maka berkata sebagian atas sebagian yang lain : Tegakkan bangunan yang tinggi, dan nyalakan api yang besar, kemudian lemparkan dia ke dalam api yang besar itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu mereka taruh kayu bakar di bawahnya serta mereka nyalakan api. Ketika api telah membesar, maka mereka lemparkan Nabi Ibrahim ke dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 97",
    "description": "Kaum yang kafir itu kalah dalam beradu argumen dengan nabi ibrahim, kemudian mereka berkata, 'buatlah bangunan perapian untuk kita membakar-Nya; lalu lemparkan dia ke dalam api yang menyala-Nyala itu. '98. Maka mereka bermaksud memperdayainya dengan cara membakar-Nya, namun Allah menyelamatkan dia dari kobaran api, lalu kami jadikan mereka orang-orang yang hina dan kalah."
  }
]