[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Ibrahim hendak membuat rencaan jahat untuk membinasakan Ibrahim, maka kami menjadikan mereka orang-orang yang kalah, Allah menggagalkan rencana jahat mereka dan menjadikan api itu dingin dan menjadi keselamatan bagi Ibrahim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Kaum Ibrahim bermaksud berbuat jahat terhadapnya dengan membakarnya agar mereka bisa berlepas darinya, maka Kami menggagalkan kejahatan mereka manakala Kami menjadikan api dingin dan selamat bagi Ibrahim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Kaum Nabi Ibrahim membuat tipu daya dengan membakar dan membunuhnya. Maka Allah membalas tipu daya mereka itu dengan menyelamatkan Ibrahim dari siksaan mereka dengan membuat api yang mereka nyalakan menjadi dingin dan tidak membahayakan Ibrahim, sehingga mereka merasakan kekecewaan dan kekalahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. فَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنٰهُمُ الْأَسْفَلِينَ (Mereka hendak melakukan tipu muslihat kepadanya, maka Kami jadikan mereka orang-orang yang hina) Yakni setelah Ibrahim dilemparkan ke dalam api itu ternyata api itu menjadi dingin dan tidak berbahaya baginya dan sama sekali tidak menyakitinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Mereka ingin melemparkannya ke dalam api yang berbahaya itu. Lalu Kami membuat mereka tunduk dengan mengeluarkannya dari api itu dalam keadaan selamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bermaksud melakukan tipu daya} rencana dan muslihat untuk membinasakan {untuknya} Ibrahim {lalu Kami menjadikan mereka orang-orang yang hina} yang ditaklukkan dan dikalahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97-98. “Mereka berkata, ‘Dirikanlah suatu bangunan untuk Ibrahim’,” yang sangat tinggi kemudian nyalakan api di atasnya. “Lalu lemparkanlah dia dalam api yang menyala-nyala itu,” sebagai balasan atas perbuatannya menghancurkan berhala-berhala mereka; dan mereka pun hendak “melakukan tipu muslihat kepadanya” yaitu membunuhnya dengan pembunuhan yang paling keji, “maka Kami jadikan mereka orang-orang yang hina”; Allah mengembalikan tipu muslihat mereka ke leher mereka sendiri dan Allah jadikan api itu dingin dan keselamatan bagi Nabi Ibrahim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 98: Mereka menginginkan keburukan dan kebinasaan kepada Ibrahim, Allah menyelamatkan dia dari panas apinya, dan Allah jadikan kaumnya terhina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Allah menggagalkan tipu daya mereka untuk membunuh kekasih-Nya dengan pembunuhan yang sadis, dan menjadikan api itu dingin, sehingga Nabi Ibrahim keluar dari api itu dengan selamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 98",
    "description": "Maka mereka bermaksud memperdayainya dengan cara membakar-Nya, namun Allah menyelamatkan dia dari kobaran api, lalu kami jadikan mereka orang-orang yang hina dan kalah. 99. Nabi ibrahim selamat dari upaya pembunuhan oleh kaumnya, dan dia berkata, 'sesungguhnya aku harus pergi berhijrah menuju tempat yang memungkinkan aku mendekatkan diri kepada tuhanku dan mengajak umatku menuju tauhid. Dia pasti akan memberi petunjuk kepadaku dan orang-orang yang mengikuti jalan kebenaran. Ayat ini menganjurkan berhijrah dari suatu tempat ketika dakwah dan pengamalan agama mendapat tekanan dan penindasan."
  }
]