[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "99-100 Ibrahim berkata ”sesunggunya aku berhiijrah kepada tuhanku dari negeri kaumku ke tempat dimana aku bisa beribadah kepada tuhanku. Sesungguhya dia akan menunjukan kebaikan kepadaku dalam agama dan duniawiku. wahi tuhanku, berilah aku anak yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Ibrahim berkata, “Sesungguhnya aku berhijrah kepada Rabbku meninggalkan negeri kaumku agar aku bisa beribadah kepada-Nya, Rabbku akan menunjukkanku kepada jalan kebaikan di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99-100. Nabi Ibrahim menyampaikan keinginannya: “Aku akan berhijrah dari negeri kaumku menuju tempat yang dapat aku gunakan untuk menyembah Tuhanku dengan leluasa dan tenang. Ya Tuhanku, berilah aku petunjuk kepada kebaikan dunia dan akhirat, dan kepada tempat berhijrah yang diberkahi, serta karuniailah aku keturunan yang shalih yang menghilangkan kesendirianku, membantuku saat aku di tempat pengasingan, dan ikut bersamaku menyembah Engkau.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَقَالَ إِنِّى ذَاهِبٌ إِلَىٰ رَبِّى (Dan Ibrahim berkata: “Sesungguhnya aku pergi menghadap kepada Tuhanku, dan Dia akan memberi petunjuk kepadaku) Yakni aku akan berhijrah dari negeri kaumku yang telah melakukan berbagai hal demi berhala-berhala itu dan karena kekafiran kepada Allah dan pendustaan terhadap para rasul, menuju tempat yang Allah perintahkan kepadaku untuk pindah, atau menuju tempat yang dapat menjadikanku bebas menyembah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Ibrahim berkata: “Sesungguhnya aku pergi ke tempat yang diperintahkan oleh Tuhanku, yaitu Syam. Sesungguhnya Dia akan membimbingku menuju tempat yang mengandung kebenaran agamaku, memungkinkan aku untuk menyembahNya dan memperoleh sesuatu yang diridhaiNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Ibrahim berkata {“Sesungguhnya aku akan pergi kepada Tuhanku} pindah dari negeri kaumku menuju tempat dimana aku bisa tenang menyembah Tuhanku {Dia akan memberiku petunjuk”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. “Dan” setelah mereka melakukan tindakan tersebut, dan Nabi Ibrahim telah menegakkan argument (hujjah) terhadap mereka, serta telah memberikan alasan, “dia berkata, ‘Sesungguhnya aku pergi menghadap kepada Rabbku’.” Maksudnya, berhijrah kepadaNya, menuju daerah yang penuh berkah, yaitu negeri Syam, “Dia akan memberi petunjuk kepadaku,” Dia akan menunjukkan kepadaku apa yang menjadi kebaikan bagiku dalam urusan agama dan duniaku. Dalam ayat yang lain Nabi Ibrahim berkata, “Dan aku akan menjauhkan diri dari padamu dan dari apa yang kamu seru selain Allah, dan aku akan berdoa kepada Tuhanku, mudah-mudahan aku tidak akan kecewa dengan berdoa kepada Tuhanku\". (Maryam: 48)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat As-Saffat ayat 99: Setelah Allah meyelamatkan Ibrahim dari musuh-musuhnya, Ibrahim berkata : Sesungguhnya aku adalah orang yang melakukan perjalanan dari negeri kaumku muju kepada apa yang Tuhanku perintahkan untuk menampakkan syiar-syiar agamaku dengan kebebasan, dan Tuhanku akan memberikan kepadaku petunjuk untuk kebaikan agama dan diriku. Maka Allah memberikan petunjuk untuk menuju ke negeri Syam yang penuh berkah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah keluar dari api itu dan setelah menegakkan hujjah kepada mereka. Maksudnya, berhijrah kepada-Nya dari negeri kafir menuju negeri, di mana Beliau dapat beribadah kepada Allah dan berdakwah, yaitu Syam. Beliau lakukan hijrah setelah melihat bahwa kaumnya tidak dapat lagi diharapkan keimanannya dan tidak melihat kebaikan pada mereka. Yakni menunjukkan aku kepada sesuatu yang di sana terdapat kebaikan bagiku baik bagi agamaku maupun duniaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat As-Saffat Ayat 99",
    "description": "Nabi ibrahim selamat dari upaya pembunuhan oleh kaumnya, dan dia berkata, 'sesungguhnya aku harus pergi berhijrah menuju tempat yang memungkinkan aku mendekatkan diri kepada tuhanku dan mengajak umatku menuju tauhid. Dia pasti akan memberi petunjuk kepadaku dan orang-orang yang mengikuti jalan kebenaran. Ayat ini menganjurkan berhijrah dari suatu tempat ketika dakwah dan pengamalan agama mendapat tekanan dan penindasan. 100. Setelah menjelaskan dialog nabi ibrahim dengan kaumnya yang ingkar, pada ayat berikut Allah beralih mengisahkan dialog nabi ibrahim dengan putranya, isma'il, tentang perintah Allah. Dia berdoa kepada Allah, 'ya tuhanku, anugerahkanlah kepadaku seorang anak yang termasuk golongan orang yang saleh dan taat menjalankan perintah-Mu dan membela agama-Mu. '."
  }
]