[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan bintang-bintang bila ia terbenam, (bahwa) Muhammad tidak menyimpang dari jalan hidayah dan kebenaran, tidak keluar dari jalan lurus, sebaliknya dia berada di puncak istiqamah, keseimbangan dan kelurusan, ucapannya tidak keluar dari hawa nafsu. Al-quran dan as-Sunnah tidak lain kecuali wahyu dari allah kepada NabiNya,Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah -Subḥānahu- bersumpah dengan bintang ketika jatuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-11. Allah bersumpah demi bintang ketika jatuh dan cahayanya redup; sungguh Nabi Muhammad tidak menyelisihi kebenaran dan tidak terpengaruh kesesatan, namun dia adalah pemimpin para pemberi hidayah. Dia tidak berbicara berdasarkan hawa nafsu, namun yang dikatakannya adalah wahyu dari Allah. Nabi Muhammad mendapat pengajaran dari malaikat yang sangat kuat, yaitu malaikat Jibril yang memiliki kekuatan dan akhlak yang mulia. Malaikat Jibril menampakkan diri dengan rupa yang sesungguhnya pada ufuk tempat terbitnya matahari, kemudian Jibril mendekati Nabi Muhammad untuk menyampaikan wahyu, sehingga jarak antara dirinya dengan Rasulullah sekitar dua hasta atau kurang dari itu. maka Allah menyampaikan wahyu kepada Nabi Muhammad melalui perantara malaikat Jibril. Hati Nabi Muhammad tidak mengingkari apa yang dilihat oleh mata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالنَّجْمِ إِذَا هَوَىٰ (Demi bintang ketika terbenam) Allah bersumpah dengan bintang yang hendak terbenam, seakan-akan Allah mengisyaratkan bahwa terbenamnya bintang itu menunjukkan bahwa ia tidak layak untuk disembah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Bukhari, Imam Muslim dan lainnya dari Ibnu Mas’ud berkata: “Surah pertama yang mengandung ayat sajdah adalah {Wan Najm}, maka bersujudlah Rasulallah SAW, lalu semua orang ikut bersujud kecuali seorang laki-laki yang aku lihat tengah mengambil segenggam tanah lalu ikut bersujud, kemudian setelah itu aku melihatnya terbunuh dalam keadaan kafir, dia adalah Umaiyah bin Khalaf” 1. Aku bersumpah demi bintang (jenis bintang) yang jatuh dan hilang cahayanya pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi bintang ketika terbenam} Aku bersumpah demi bintang kejora ketika jatuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah bersumpah dengan bintang pada saat terbenam yaitu ketika bergeser dari ufuk pada akhir malam di saat malam akan beranjak dan siang akan menjelang, karena pada yang demikian itu terdapat tanda-tanda kebesaran Allah yang mengharuskan untuk dijadikan sebagai sumpah. Pendapat yang benar, kata ‘annajmu’ adalah isim jenis yang mencakup seluruh bintang. Allah bersumpah dengan bintang untuk menunjukkan kebenaran yang diberikan oleh Rasulullah sebagai wahyu ilahi, karena di dalamnya terdapat kondisional yang menakjubkan, karena Allah menjadikan bintang sebagai perhiasan langit, begitu juga dengan wahyu dan pengaruh-pengaruhnya dijadikan perhiasan untuk bumi. Andai tidak ada ilmu yang diwarisi dari para nabi, tentu manusia berada dalam kegelapan melebihi gelapnya malam yang pekat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 1: 1-4. Allah mengawali surat ini dengan bersumpah dengan bintang-bintang di langit yang menukik karena terbenam. Kemudian datang jawaban atas sumpah yang mengabarkan bahwa sahabat kalian ini (Muhammad) wahai orang-orang Quraisy, tidaklah menyimpang dari jalan yang lurus, dan tidak juga berkeyakinan bathil selamanya. Sesungguhnya Muhammad tidaklah berbicara dengan hawa nafsu, dan juga pendapatnya sendiri atas apa yang disampaikannya kepada kalian dari kerisalahan. Sungguh dia tidak berbicara kecuali atas dasar wahyu yang Allah wahyukan kepadanya. Berkata Asy Syanqiti penulis Adhwaul Bayan, ketika mengajarkan kepada kami tafsir di kuliah syariah : Bintang yang Allah bersumpah atasnya adalah ungkapan atas turunnya Al Qur’an; Karena Al Qur’an turun secara berangsur-angsur kepada Nabi ﷺ. Dengan ini maka maknanya adalah : Sesungguhnya Allah bersumpah dengan ungkapan turunnya Al Qur’an yang diturunkan malaikat kepada Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala bersumpah dengan bintang ketika terbenam di ufuk di akhir malam ketika malam pergi dan siang datang. Hal itu, karena di sana terdapat ayat-ayat Allah yang besar. Allah Subhaanahu wa Ta'aala bersumpah dengan bintang untuk menerangkan kebenaran yang dibawa Rasulullah shallallahu 'alaihi wa sallam berupa wahyu ilahi karena di sana terdapat persesuaian yang menakjubkan. Allah Subhaanahu wa Ta'aala menjadikan bintang-bintang sebagai hiasan bagi langit, demikian pula wahyu dan atsar(pengaruh)nya sebagai hiasan bagi bumi. Jika tidak ada ilmu yang diwariskan dari para nabi, tentu manusia berada dalam kegelapan, bahkan lebih gelap dari malam yang kelam. Isi sumpah itu adalah membersihkan Nabi Muhammad shallallahu 'alaihi wa sallam dari tuduhan sesat dalam ilmunya dan dalam niatnya, dimana hal ini menghendaki Beliau sebagai orang yang mendapat petunjuk dalam ilmunya dan memberi petunjuk yang baik niatnya serta memberikan sikap nush-h (tulus) kepada umatnya; berbeda dengan orang-sesat yang sesat; yang rusak ilmu dan niatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 1",
    "description": "Surah at-t'r diakhiri dengan perintah untuk bertasbih dan memuji Allah setiap saat, terutama pagi. Pada surah an-najm ini Allah memulai dengan bersumpah demi bintang. Demi bintang yang bertebaran di angkasa ketika hendak terbenam akibat terbitnya matahari di ufuk timur dengan sinarnya yang kuat. 2. Sesungguhnya kawanmu yang sangat kamu kenal kejujurannya, yaitu nabi Muhammad, tidak sesat dalam perilakunya saat menyampaikan dakwah dan tidak pula keliru dalam ucapan-ucapan yang disampaikannya."
  }
]