[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Hati Muhammad tidak mendustakan apa yang telah dilihat oleh matanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11-12. أَفَتُمٰرُونَهُۥ عَلَىٰ مَا يَرَىٰ مَا كَذَبَ الْفُؤَادُ مَا رَأَىٰٓ (Hatinya tidak mendustakan apa yang telah dilihatnya. Maka apakah kaum (musyrik Mekah) hendak membantahnya tentang apa yang telah dilihatnya?) Yakni hati Nabi Muhammad benar sehingga matanya lebih benar lagi, dan itulah yang biasa terjadi pada manusia. Nabi Muhammad telah melihat Jibril dengan mata kepalanya sendiri, lalu mengapa kalian membantah apa yang dilihatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Hati Nabi SAW tidak mengingkari apa yang dilihat oleh penglihatannya, yaitu wujud Jibril AS"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hatinya tidak mendustakan apa yang telah dilihatnya} hati nabi Muhammad SAW tidak mendustakan apa yang dia lihat dengan penglihatannya berupa bentuk Jibril AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-12. “Hatinya tidak mendustakan apa yang telah dilihatnya,” yakni, hati dan pandangan Rasulullah sepakat terhadap wahyu yang disampaikan oleh Allah kepadanya. Pendengaran, penglihatan, dan hati Rasulullah sama. Dan ini menunjukkan sempurnanya wahyu yang disampaikan Allah kepadaNya. Rasulullah menerimanya secara langsung, yang tidak ada keraguan dan syubhat di dalamnya. Hati Rasulullah tidak mendustakan yang dilihat oleh matanya dan Rasulullah tidak meragukan hal itu. Kemungkinan lain maksud yang dilihat Rasulullah itu adalah peristiwa yang dilihat pada malam Isra’ berupa tanda-tanda kebesaran Allah yang agung. Rasulullah meyakini secara benar dengan hati dan penglihatannya. Inilah penafsiran yang benar dalam ayat ini. Ada yang mengatakan bahwa yang dimaksud adalah Rasulullah melihat Rabbnya pada malam Isra’ serta berbicara denganNya. Ini adalah penafsiran yang dipilih oleh banyak ulama. Atas dalil ini mereka menegaskan bahwa Rasulullah pernah melihat Rabbnya pada saat di dunia. Namun pendapat yang benar adalah pendapat pertama, yaitu yang dimaksud adalah Jibril, sebagaimana ditunjukkan oleh konteks ayat, Muhammad melihat Jibril dalam wujud aslinya, di mana Rasulullah pernah dua kali melihat dalam wujud asli, pertama pada saat di ufuk tinggi dan kedua di atas langit ketujuh pada saat malam Isra’ bersama Rasulullah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 11: 10-12. Jibril menyampaikan kepada Nabi ﷺ atas apa yang Allah berikan tugas kepadanya untuk menyampaikan Al Qur’an dan petunjuk serta cahaya. Allah tidak memperjelas mewahyukan kepada Muhammad ﷺ karena Allah memuliakannya, karena ketidakjelasan datang dengan tujuan meninggikan dan memuliakan. Dan ketika Nabi ﷺ melihat Jibril dalam betuk aslinya maka Jibril meyakinkan hatinya dan menjadikan hatinya membenarkan; Karena tidaklah Nabi ﷺ melihat dengan matanya, kecuali hatinya juga membenarkannya. Kemudian Allah mengarahkan pembicaraan kepada orang-orang musyrik, dengan berkata dengan nada merendahkan : Apakah mereka mendebatmu dan saling berselisih atas apa yang Allah perlihatkan pada pandanganmu ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni hati Rasulullah shallallahu 'alaihi wa sallam sejalan dengan penglihatannya terhadap wahyu yang diwahyukan Allah kepadanya, sejalan pendengaran, hati dan penglihatannya. Hal ini menunjukkan sempurnanya wahyu yang Allah wahyukan kepada Beliau dan bahwa Beliau menerimanya dengan penerimaan yang tidak ada keraguan lagi; hatinya tidak mendustakan apa yang dilihat matanya serta tidak ragu-ragu terhadapnya. Bisa juga maksudnya, apa yang Beliau shallallahu 'alaihi wa sallam lihat pada malam isra’ berupa ayat-ayat Allah yang besar, dan bahwa Beliau meyakininya dengan sepenuh hati. Apa yang Beliau lihat adalah malaikat Jibril ‘alaihis salam sebagaimana yang ditunjukkan susunan ayat di atas, dan bahwa Muhammad shallallahu 'alaihi wa sallam melihat malaikat Jibril dalam rupa aslinya dua kali; pertama di ufuk yang tinggi di bawah langit dunia sebagaimana telah disebutkan, dan kedua di atas langit yang ketujuh pada malam ketika Rasulullah shallallahu 'alaihi wa sallam diisra’kan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 11",
    "description": "Hatinya, yaitu hati nabi Muhammad, meyakini dan tidak mendusta-kan atau mengingkari apa yang telah dilihatnya dengan mata kepalanya sendiri. 12. Maka, wahai kaum musyrik, apakah kamu dan orang yang meragukannya hendak membantahnya tentang apa, yaitu jibril, yang telah dilihatnya itu'."
  }
]