[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-18. Apakah kalian mendustakan Muhammad dan mendebatnya atas apa yang dia lihat dan dia saksikan dari tanda-tanda kebesaran Tuhannya? Sungguh Muhammad telah melihat Jibril dalam wujud aslinya sebagaimana Allah menciptakannya pada kesempatan yang lain di Sidratul Muntaha (pohon Nabq) di langit ketujuh, di mana apa yang naik dari bumi berhenti padanya, apa yang turun dari atasnya terparkir disana. Di sana ada Surga Ma’wa yang dijanjikan kepada orang-orang yang bertakwa. Saat Sidratul Muntaha dikelilingi sesuatu yang agung atas perintah Allah, hanya Allah semata yang tahu sifatnya. Nabi adalah orang yang sangat teguh hatinya dan sangat taat, maka pandangan beliau tidak menengok ke kanan dan ke kiri, tidak melibihi apa yang diizinkan untuk dilihatnya. Muhammad telah melihat malam Mi’raj itu tanda-tanda besar Tuhannya yang menunjukkan KuasaNya dan keagunganNya, yang diantaranya adalah surga, neraka, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Di Sidratul Muntaha, yaitu pohon yang besar sekali berada di langit ketujuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. عِندَ سِدْرَةِ الْمُنتَهَىٰ ((yaitu) di Sidratil Muntaha) Pohon sidr ini berada di langit ke enam, sebagaimana disebutkan dalam hadits shahih. Terdapat pendapat mengatakan bahwa pohon ini merupakan batas terakhir yang diketahui oleh makhluk, adapun setelahnya tidak ada yang dapat mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Di sisi pohon Sadr (Allah paling tahu tentang hakikat pohon itu) di tempat paling tinggi di langit, yaitu di langit ke-enam sebagaimana disebutkan dalam hadits shahih. Al-Muntaha adalah tempat pemberhentian. Dikatakan: “Disanalah batas pengetahuan para makhluk”. Di sampingnya ada surga yang mana ruh-ruh orang-orang mukmin yang bertakwa bersemayam disana"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{di sisi Sidratul muntah} pohon di langit ke tujuh dimana berhenti di sana sesuatu yang dinaikkan dari bumi dan sesuatu yang diturunkan dari atas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. Karena itulah Allah berfirman, “Dan sungguh Muhammad telah melihat JIbril itu (dalam rupanya yang asli) pada waktu yang lain,” artinya, Nabi Muhammad melihat Jibril lagi ketika turun menghampirinya “(yaitu) di Sidratul Muntaha,” yaitu sebuah pohon yang sangat besar berada di atas langit ketujuh, disebut demikian karena di tempat itulah semua yang naik dari bumi berhenti dan dari situlah wahyu Allah turun. Atau karena disitulah batas akhir ilmu seluruh makhluk, artinya karena keberadaannya di atas langit dan bumi, di situlah batas akhir ilmu atau karena hal lainnya, wallahu a’lam. Nabi Muhammad melihat Jibril di tempat itu, disitulah tempat bersemayamnya ruh yang suci dan indah, yang tidak bisa didekati setan dan ruh-ruh keji lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 14: 13-16. Allah mengabarkan bahwa Nabi melihat Jibril kedua kalinya dalam bentuk aslinya ketika di isra’ kan. Adapun Setelah itu Nabi ﷺ hanya melihat dalam bentuk manusia agar lebih manusiawi dan mengurangi rasa takut. Kemudian Allah menjelaskan bahwa Nabi ﷺ melihat Jibril ketika di Sidratul Muntaha, dan Sidratul Muntaha adalah pohon yang sangat besar yang bertempat di atasnya langit yang ketujuh. Di sisi pohon itu terdapat surga yang sebagai tempat (terkumpulnya) seluruh kenikmatan. Pohon besar ini diliputi (atas perintah Allah) dengan sesuatu yang besar, yang tidak mengetahui gambaran (hakikinya) kecuali hanya Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sidratul Muntaha adalah pohon bidara yang sangat besar, di atas langit ke-7, yang telah dikunjungi Nabi shallallahu 'alaihi wa sallam ketika mi'raj. Disebut Sidratul Muntaha karena sampai ke sanalah ujungnya segala yang naik dari bumi, wallahu a’lam. Nabi Muhammad shallallahu 'alaihi wa sallam melihat malaikat Jibril di tempat itu, dimana tempat itu adalah tempat ruh-ruh yang tinggi yang bersih dan indah yang tidak didekati oleh setan serta ruh jahat lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 14",
    "description": "13-14. Dan sungguh, dia, yaitu nabi Muhammad, telah melihatnya, yakni jibril, dalam rupanya yang asli pada waktu yang lain, yaitu di sidratul muntah' saat mikraj. 15. Di dekatnya, yakni dekat sidratul muntah', ada surga yang menjadi tempat tinggal."
  }
]