[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-18. Apakah kalian mendustakan Muhammad dan mendebatnya atas apa yang dia lihat dan dia saksikan dari tanda-tanda kebesaran Tuhannya? Sungguh Muhammad telah melihat Jibril dalam wujud aslinya sebagaimana Allah menciptakannya pada kesempatan yang lain di Sidratul Muntaha (pohon Nabq) di langit ketujuh, di mana apa yang naik dari bumi berhenti padanya, apa yang turun dari atasnya terparkir disana. Di sana ada Surga Ma’wa yang dijanjikan kepada orang-orang yang bertakwa. Saat Sidratul Muntaha dikelilingi sesuatu yang agung atas perintah Allah, hanya Allah semata yang tahu sifatnya. Nabi adalah orang yang sangat teguh hatinya dan sangat taat, maka pandangan beliau tidak menengok ke kanan dan ke kiri, tidak melibihi apa yang diizinkan untuk dilihatnya. Muhammad telah melihat malam Mi’raj itu tanda-tanda besar Tuhannya yang menunjukkan KuasaNya dan keagunganNya, yang diantaranya adalah surga, neraka, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Di sebelah pohon ini terdapat Surga Al-Ma`wa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. عِندَهَا جَنَّةُ الْمَأْوَىٰٓ (Di dekatnya ada surga tempat tinggal) Dinamakan dengan (جنة المأوى) kerena ruh-ruh orang beriman akan kembali kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. Di sisi pohon Sadr (Allah paling tahu tentang hakikat pohon itu) di tempat paling tinggi di langit, yaitu di langit ke-enam sebagaimana disebutkan dalam hadits shahih. Al-Muntaha adalah tempat pemberhentian. Dikatakan: “Disanalah batas pengetahuan para makhluk”. Di sampingnya ada surga yang mana ruh-ruh orang-orang mukmin yang bertakwa bersemayam disana"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di dekatnya ada surga tempat tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Di dekat pohon itu terdapat “surga tempat tinggal,” yaitu surga yang mencakup seluruh kenikmatan yang menjadi tempat terakhir seluruh angan, dikehendaki oleh seluruh keinginan dan di mana seluruh keinginan berada di surga itu. Hal ini menunjukkan bahwa surga itu berada di tempat yang tertinggi dan berada di atas tujuh langit."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 15: 13-16. Allah mengabarkan bahwa Nabi melihat Jibril kedua kalinya dalam bentuk aslinya ketika di isra’ kan. Adapun Setelah itu Nabi ﷺ hanya melihat dalam bentuk manusia agar lebih manusiawi dan mengurangi rasa takut. Kemudian Allah menjelaskan bahwa Nabi ﷺ melihat Jibril ketika di Sidratul Muntaha, dan Sidratul Muntaha adalah pohon yang sangat besar yang bertempat di atasnya langit yang ketujuh. Di sisi pohon itu terdapat surga yang sebagai tempat (terkumpulnya) seluruh kenikmatan. Pohon besar ini diliputi (atas perintah Allah) dengan sesuatu yang besar, yang tidak mengetahui gambaran (hakikinya) kecuali hanya Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni surga yang mencakup semua kenikmatan, dimana tempat tersebut adalah tempat kembali segala cita-cita dan harapan dan tempat dimana para malaikat, ruh para syuhada’ dan orang-orang yang bertakwa kembali kepadanya. Ayat ini menunjukkan bahwa surga berada di tempat yang paling tinggi; di atas langit yang ketujuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 15",
    "description": "Di dekatnya, yakni dekat sidratul muntah', ada surga yang menjadi tempat tinggal. 16. Nabi Muhammad melihat jibril ketika sidratul muntah' diliputi oleh sesuatu yang indah yang meliputinya dan memperlihatkan keagungan tuhan."
  }
]