[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-18. Apakah kalian mendustakan Muhammad dan mendebatnya atas apa yang dia lihat dan dia saksikan dari tanda-tanda kebesaran Tuhannya? Sungguh Muhammad telah melihat Jibril dalam wujud aslinya sebagaimana Allah menciptakannya pada kesempatan yang lain di Sidratul Muntaha (pohon Nabq) di langit ketujuh, di mana apa yang naik dari bumi berhenti padanya, apa yang turun dari atasnya terparkir disana. Di sana ada Surga Ma’wa yang dijanjikan kepada orang-orang yang bertakwa. Saat Sidratul Muntaha dikelilingi sesuatu yang agung atas perintah Allah, hanya Allah semata yang tahu sifatnya. Nabi adalah orang yang sangat teguh hatinya dan sangat taat, maka pandangan beliau tidak menengok ke kanan dan ke kiri, tidak melibihi apa yang diizinkan untuk dilihatnya. Muhammad telah melihat malam Mi’raj itu tanda-tanda besar Tuhannya yang menunjukkan KuasaNya dan keagunganNya, yang diantaranya adalah surga, neraka, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Ketika Sidratul Muntaha diliputi oleh hal yang agung dari perintah Allah, yang tidak diketahui hakikatnya kecuali oleh Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَىٰ (ketika Sidratil Muntaha diliputi oleh sesuatu yang meliputinya) Terdapat pendapat mengatakan bahwa pohon itu diliputi oleh belalang yang tercipta dari emas. Pendapat lain mengatakan, ia diliputi oleh para malaikat. Dan pendapat lain mengatakan bahwa ia diliputi oleh urusan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16-17. Saat pohon Sidrah itu diliputi oleh makhluk-makhluk yang meliputinya, tidak ada yang mengetahuinya kecuali Allah. Penglihatan Rasulallah tidak berpaling dari apa yang dilihatnya dan tidak mampu melampauinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Sidratul muntaha dilingkupi oleh sesuatu yang melingkupinya} Sidratul muntaha diselimuti oleh sesuatu yang menyelimutinya dengan perintah Allah, yaitu sesuatu yang tidak diketahui esensinya kecuali Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “Ketika Sidratil Muntaha diliputi oleh sesuatu yang meliputinya,” yakni Sidratil Muntaha itu diliputi oleh sesuatu yang agung yang sifatnya tidak diketahui siapa pun kecuali oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 16: 13-16. Allah mengabarkan bahwa Nabi melihat Jibril kedua kalinya dalam bentuk aslinya ketika di isra’ kan. Adapun Setelah itu Nabi ﷺ hanya melihat dalam bentuk manusia agar lebih manusiawi dan mengurangi rasa takut. Kemudian Allah menjelaskan bahwa Nabi ﷺ melihat Jibril ketika di Sidratul Muntaha, dan Sidratul Muntaha adalah pohon yang sangat besar yang bertempat di atasnya langit yang ketujuh. Di sisi pohon itu terdapat surga yang sebagai tempat (terkumpulnya) seluruh kenikmatan. Pohon besar ini diliputi (atas perintah Allah) dengan sesuatu yang besar, yang tidak mengetahui gambaran (hakikinya) kecuali hanya Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 16",
    "description": "Nabi Muhammad melihat jibril ketika sidratul muntah' diliputi oleh sesuatu yang indah yang meliputinya dan memperlihatkan keagungan tuhan. 17. Karena keindahan yang dilihat oleh nabi Muhammad itu, penglihatannya tidak menyimpang dari yang dilihatnya itu dan tidak pula melampauinya."
  }
]