[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-18. Apakah kalian mendustakan Muhammad dan mendebatnya atas apa yang dia lihat dan dia saksikan dari tanda-tanda kebesaran Tuhannya? Sungguh Muhammad telah melihat Jibril dalam wujud aslinya sebagaimana Allah menciptakannya pada kesempatan yang lain di Sidratul Muntaha (pohon Nabq) di langit ketujuh, di mana apa yang naik dari bumi berhenti padanya, apa yang turun dari atasnya terparkir disana. Di sana ada Surga Ma’wa yang dijanjikan kepada orang-orang yang bertakwa. Saat Sidratul Muntaha dikelilingi sesuatu yang agung atas perintah Allah, hanya Allah semata yang tahu sifatnya. Nabi adalah orang yang sangat teguh hatinya dan sangat taat, maka pandangan beliau tidak menengok ke kanan dan ke kiri, tidak melibihi apa yang diizinkan untuk dilihatnya. Muhammad telah melihat malam Mi’raj itu tanda-tanda besar Tuhannya yang menunjukkan KuasaNya dan keagunganNya, yang diantaranya adalah surga, neraka, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Mata beliau tidak menoleh ke kiri atau ke kanan serta tidak melampaui yang sudah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. مَا زَاغَ الْبَصَرُ (Penglihatannya (muhammad) tidak berpaling dari yang dilihatnya itu) Yakni penglihatan Rasulullah tidak berpaling dari apa yang dia lihat. وَمَا طَغَىٰ (dan tidak (pula) melampauinya) Yakni tidak menembus apa yang dia lihat. Karena itu adalah penglihatan mata biasa, bukan sebuah pandangan yang menipu mata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16-17. Saat pohon Sidrah itu diliputi oleh makhluk-makhluk yang meliputinya, tidak ada yang mengetahuinya kecuali Allah. Penglihatan Rasulallah tidak berpaling dari apa yang dilihatnya dan tidak mampu melampauinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Penglihatannya tidak menyimpang} penglihatan nabi Muhammad SAW tidak berpaling ke kanan dan tidak pula ke kiri {dan tidak melampaui} tidak melampaui sesuatu yang diperintahkan untuk bisa dilihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “Penglihatannya (Muhammad) tidak berpaling, “ artinya tidak berpaling ke kiri dan ke kanan dari fokusnya, “dan tidak pula melampauinya,” artinya pandangan beliau tidak melewatinya. Ini adalah sempurnanya etika Rasulullah, berdiri di tempat yang telah disiapkan Allah, tidak bergeser dan tidak nelampauinya. Ini merupakan etika agung yang paling sempurna yang mengungguli akhlak seluruh manusia, baik yang pertama maupun yang terakhir. Kekeliruan dalam hal ini ada dua kemungkinan; pertama karena seorang hamba tidak menunaikan perintah Allah atau menunaikannya namun tidak sempurna dengan cara bermalas-malasan atau secara berlebihan, dan kemungkinan kedua adalah karena melampaui batas, baik ke kanan maupun ke kiri. Semua hal ini tidak terdapat pada diri Rasulullah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 17: 17-18. Allah menjelaskan atas kondisi Nabi ﷺ terdiam dan takjub, Allah mengabarkan bahwa Nabi ﷺ tetap dalam pandangannya dan tidak memalingkan penglihatannya sesuai dengan apa yang Allah perintahkan kepadanya, maksudnya adalah menetapkan (tidak memalingkan) pandangannya dengan penglihatan secara hakiki. Allah menjelaskan bahwa Nabi melihat malam isra’ sebagai bukti yang agung, yang menunjukkan kekuasaan Allah dan keagungan-Nya; Dimana Nabi melihat langit, bertemu dengan para Nabi, melihat surga dan neraka dan ditampakkan atas segala sesuatu yang banyak sebagai bukti di antara bukti-bukti kekuasaan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penglihatan Beliau tidak menyimpang ke kanan atau ke kiri dari maksud yang diinginkan. Ini termasuk sempurnanya adab Nabi Muhammad shallallahu 'alaihi wa sallam, dimana Allah menempatkan kepada Beliau tempat yang Allah tempatkan; tidak kurang darinya dan tidak melewatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 17",
    "description": "Karena keindahan yang dilihat oleh nabi Muhammad itu, penglihatannya tidak menyimpang dari yang dilihatnya itu dan tidak pula melampauinya. 18. Sungguh, pada saat itu dia, yakni nabi Muhammad, telah melihat sebagian tanda-tanda keagungan dan kemuliaan tuhannya yang paling besar."
  }
]