[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-18. Apakah kalian mendustakan Muhammad dan mendebatnya atas apa yang dia lihat dan dia saksikan dari tanda-tanda kebesaran Tuhannya? Sungguh Muhammad telah melihat Jibril dalam wujud aslinya sebagaimana Allah menciptakannya pada kesempatan yang lain di Sidratul Muntaha (pohon Nabq) di langit ketujuh, di mana apa yang naik dari bumi berhenti padanya, apa yang turun dari atasnya terparkir disana. Di sana ada Surga Ma’wa yang dijanjikan kepada orang-orang yang bertakwa. Saat Sidratul Muntaha dikelilingi sesuatu yang agung atas perintah Allah, hanya Allah semata yang tahu sifatnya. Nabi adalah orang yang sangat teguh hatinya dan sangat taat, maka pandangan beliau tidak menengok ke kanan dan ke kiri, tidak melibihi apa yang diizinkan untuk dilihatnya. Muhammad telah melihat malam Mi’raj itu tanda-tanda besar Tuhannya yang menunjukkan KuasaNya dan keagunganNya, yang diantaranya adalah surga, neraka, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sungguh Muhammad -ṣallallāhu 'alaihi wa sallam- telah melihat sebagian dari tanda-tanda Rabbnya yang agung pada malam beliau dimi'rajkan yang menunjukkan kekuasaan-Nya; beliau melihat Surga, melihat Neraka dan selain keduanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. لَقَدْ رَأَىٰ مِنْ ءَايٰتِ رَبِّهِ الْكُبْرَىٰٓ (Sesungguhnya dia telah melihat sebahagian tanda-tanda (kekuasaan) Tuhannya yang paling besar) Yakni Rasulullah telah melihat pada malam itu ayat-ayat Allah yang agung yang tidak dapat dijelaskan sifatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sungguh Nabi SAW pada malam Isra’ Mi’raj melihat sebagian tanda-tanda Tuhannya yang Maha Agung yang mana tidak dapat digambarkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh dia benar-benar telah melihat} nabi Muhammad SAW pada malam Isra’ Mi’raj {sebagian tanda-tanda Tuhannya yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “Sungguh dia telah melihat sebagian tanda-tanda (kekuasaan) Rabbnya yang paling besar,” berupa surga, neraka, dan hal-hal lain yang dilihat Nabi pada malam Isra’."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 18: 17-18. Allah menjelaskan atas kondisi Nabi ﷺ terdiam dan takjub, Allah mengabarkan bahwa Nabi ﷺ tetap dalam pandangannya dan tidak memalingkan penglihatannya sesuai dengan apa yang Allah perintahkan kepadanya, maksudnya adalah menetapkan (tidak memalingkan) pandangannya dengan penglihatan secara hakiki. Allah menjelaskan bahwa Nabi melihat malam isra’ sebagai bukti yang agung, yang menunjukkan kekuasaan Allah dan keagungan-Nya; Dimana Nabi melihat langit, bertemu dengan para Nabi, melihat surga dan neraka dan ditampakkan atas segala sesuatu yang banyak sebagai bukti di antara bukti-bukti kekuasaan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Eperti surga, neraka dan perkara-perkara lain yang dilihat Nabi Muhammad shallallahu 'alaihi wa sallam pada malam israa’-mi’raj."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 18",
    "description": "Sungguh, pada saat itu dia, yakni nabi Muhammad, telah melihat sebagian tanda-tanda keagungan dan kemuliaan tuhannya yang paling besar. 19-20. Bila ayat-ayat yang lalu menjelaskan keteguhan sikap nabi Muhammad dan kelurusan jalan yang ditempuhnya, maka pada ayat-ayat ini Allah menerangkan kecaman terhadap orang kafir yang tetap me-nyembah berhala. Wahai orang musyrik, maka apakah patut kamu menganggap al-l'ta dan al-'uzz', dan man't, yang merupakan berhala ketiga yang kemudian kamu anggap sebagai anak perempuan Allah'."
  }
]