[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Apakah kalian (wahai orang-orang musyrik) memperhatikan tuhan-tuhan yang kalian sembah: al-Lata, al-Uzza dan yang ketiga lainnya adalah Manat; apakah mereka bisa mendatangkan manfaat atau mudarat sehingga mereka menjadi sekutu-sekutu bagi Allah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Maka apakah kalian -wahai orang-orang musyrik- melihat berhala-berhala yang kalian sembah selain Allah; Al-Lāta, Al-Uzzā,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-23. Hai orang-orang musyrik, sampaikan kepada kami tentang tiga tuhan yang kalian sembah; yaitu al-Laata, al-Uzza, dan al-Manaah; apakah tuhan-tuhan kalian itu mampu mendatangkan kebaikan atau mencegah keburukan? Mengapa kalian menisbahkan anak laki-laki yang kalian sukai itu bagi kalian, dan menisbahkan anak perempuan yang kalian anggap lebih rendah derajatnya itu bagi Allah? Sungguh itu adalah pembagian yang zalim. Dan berhala-berhala kalian itu hanyalah sebatas nama-nama saja yang kalian dan nenek moyang kalian buat, tanpa ada wujud hakikatnya; Allah sama sekali tidak menurunkan bukti tentang nama-nama itu. Apa yang kalian sembah itu hanyalah sesuatu yang kalian anggap sebagai tuhan dan sesuatu yang kalian sukai karena godaan dari setan. Sungguh kebenaran dari al-Qur’an telah sampai kepada mereka melalui perantara Nabi Muhammad."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. أَفَرَءَيْتُمُ اللّٰتَ (Maka apakah patut kamu (hai orang-orang musyrik) menganggap al Lata) Al-Laata adalah nama patung perempuan, yang diambil dari kata ‘Allah’. وَالْعُزَّىٰ( dan al Uzza) Mujahid mengatakan al-Uzza adalah sebuah pohon yang disembah oleh suku Ghathafan. Rasulullah telah mengutus Khalid bin Walid untuk memotong pohon tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19-20. Apa kemudian kalian (masih) menganggap keberadaan Latta, yaitu berhala yang telah turun temurun disembah di Thaif dan Uzza, berhala suku Ghatfan, yaitu berhala pohon yang terbuat dari batang pohon kurma, dan Manat, yaitu berhala batu milik Bani Hudzail dan kabilah Khuza’ah. {Ats-Tsalitsatil Ukhra} adalah dua kata sifat yang digunakan untuk menegaskan celaan pada mereka. Al-Ukhra diletakkan di akhir untuk di kira-kirakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah patut kalian menganggap Lata dan ‘Uzza"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. Setelah Allah menyebutkan petunjuk dan agama yang benar yang dibawa Muhammad serta perintah untuk beribadah kepadaNya dan mengesakanNya, selanjutnya Allah menyebutkan kebatilan jalan orang-orang musyrik, berupa penyembahan terhadap patung dan berhala yang tidak memiliki kesempurnaan sifat dan juga tidak bisa mendatangkan manfaat serta mara bahaya, sesembahan-sesembahan tersebut hanya nama yang tidak memiliki makna yang dikatakan oleh orang-orang musyrik dan nenek moyang mereka yang bodoh dan sesat, mereka membuat-buat nama-nama batil yang seharusnya tidak berhak. Mereka menipu diri mereka sendiri dan juga orang lain berupa kesesatan. Sesembahan-sesembahan dengan kondisi seperti ini sama sekali tidak berhak disembah. Sekutu-sekutu Allah yang mereka beri nama seperti itu menurut pengakuan mereka bersumber dari sifat-sifatnya. Mereka memberi nama Latta yang berasal dari kata ‘Al-ilaah’ (yang merupakan nama Allah) yang berhak untuk disembah. Nama Uzza berasal dari kata ‘al-Aziz’ yang bermakna Yang Mahaperkasa. Nama Manat berasal dari kata al-Mannan yang bermakna Yang Maha Pemberi, dengan maksud menentang nama-nama Allah serta menyekutukan Allah dengan nama-nama itu. Sebenarnya, nama-nama sesembahan tersebut tidak memiliki makna. Siapa saja yang memiliki akal walaupun sedikit bisa mengetahui kebatilan sifat-sifat yang terdapat pada sesembahan-sesembahan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 19: 19-20. Allah mencela kepada orang-orang kafir yang mereka beribadah kepada berhala-berhala, dimana berhala-berhala tersebut tidak memudharatkan dan tidak memberi manfaat, dan mereka menjadikan berhala-berhala itu sekutu bagi Allah, yang mereka juga tahu akan keagungan Allah. Al Lata adalah nama yang diambil dari nama Allah, yang dulunya ia memiliki kelompok. Adapun Al Uzza, berkata Mujahid : Adalah pohon yang terletak di Ghathafan, yang mereka ibadahi. Kemudian Rasulullah ﷺ mengutus Khalid bin Walid untuk mencabut dari akarnya. Adapun Manat adalah berhala yang telah diancurkan, pada saat itu orang-orang Mekkah mengibadahinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala mentazkiyah (menjelaskan kebersihan) apa yang dibawa Nabi Muhammad shallallahu 'alaihi wa sallam berupa petunjuk dan agama yang benar serta perintah untuk beribadah kepada Allah Subhaanahu wa Ta'aala dan mengeesakan-Nya, maka Allah menyebutkan batilnya apa yang dipegang kaum musyrik yang menyembah sesuatu yang tidak memiliki sifat kesempurnaan sedikit pun, tidak mampu memberikan manfaat dan tidak mampu menimpakan madharat (bahaya), tetapi hanya sekedar nama-nama yang kosong dari makna yang diberi nama oleh orang-orang musyrik yang tidak tahu lagi tersesat sehingga mereka tertipu dan orang lain pun ikut tertipu dengannya. Berhala-berhala yang mereka (kaum musyrik) beri nama dengan nama-nama ini (Laata, Uzza dan Manaat) berasal dari kata Ilaah (bagi Laata), ‘Aziz (bagi ‘Uzza) dan Mannan (bagi Manaat) sebagai sikap ilhaad (penyimpangan) terhadap nama-nama Allah dan menjadikan mereka sebagai sekutu bagi-Nya, Subhaanallah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 19",
    "description": "19-20. Bila ayat-ayat yang lalu menjelaskan keteguhan sikap nabi Muhammad dan kelurusan jalan yang ditempuhnya, maka pada ayat-ayat ini Allah menerangkan kecaman terhadap orang kafir yang tetap me-nyembah berhala. Wahai orang musyrik, maka apakah patut kamu menganggap al-l'ta dan al-'uzz', dan man't, yang merupakan berhala ketiga yang kemudian kamu anggap sebagai anak perempuan Allah'19-20"
  }
]