[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan bintang-bintang bila ia terbenam, (bahwa) Muhammad tidak menyimpang dari jalan hidayah dan kebenaran, tidak keluar dari jalan lurus, sebaliknya dia berada di puncak istiqamah, keseimbangan dan kelurusan, ucapannya tidak keluar dari hawa nafsu. Al-quran dan as-Sunnah tidak lain kecuali wahyu dari allah kepada NabiNya,Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Muhammad Rasulullah -ṣallallāhu 'alaihi wa sallam- itu tidak tersesat dari jalan hidayah dan tidak pula ia berbuat keliru, akan tetapi ia berada dalam kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مَا ضَلَّ صَاحِبُكُمْ (kawanmu (Muhammad) tidak sesat) Yakni Muhammad tidaklah tersesat dari kebenaran ketika ia datang membawa al-Qu’ran kepada kalian. وَمَا غَوَىٰ( dan tidak pula keliru) Yakni dia tidak menjadi sesat dan tidak mengucapkan hal yang batil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Muhammad tidak meninggalkan kebenaran jalan hidayah. Tidak pula dia menjadi pengikut hawa nafsu. Maknanya tidak berkeyakinan terhadap kebatilan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sahabat kalian tidak sesat} nabi Muhammad SAW tidak menyimpang dari jalan kebenaran {dan tidak keliru} dan tidak menjadi orang yang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Tujuan sumpah pada ayat ini adalah penyucian untuk Rasulullah dari kesesatan dalam ilmu dan tujuannya, karena Rasulullah adalah orang yang mendapat petunjuk dalam ilmunya, berniat baik dan pemberi nasihat untuk manusia. Lain halnya dengan orang-orang sesat yang ilmunya rusak dan niatnya buruk, Allah berfirman, “Kawanmu,” agar mereka ingat kejujuran dan petunjuk yang ada pada Nabi Muhammad, dan perihal tentang Muhammad tidak samar bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 2: 1-4. Allah mengawali surat ini dengan bersumpah dengan bintang-bintang di langit yang menukik karena terbenam. Kemudian datang jawaban atas sumpah yang mengabarkan bahwa sahabat kalian ini (Muhammad) wahai orang-orang Quraisy, tidaklah menyimpang dari jalan yang lurus, dan tidak juga berkeyakinan bathil selamanya. Sesungguhnya Muhammad tidaklah berbicara dengan hawa nafsu, dan juga pendapatnya sendiri atas apa yang disampaikannya kepada kalian dari kerisalahan. Sungguh dia tidak berbicara kecuali atas dasar wahyu yang Allah wahyukan kepadanya. Berkata Asy Syanqiti penulis Adhwaul Bayan, ketika mengajarkan kepada kami tafsir di kuliah syariah : Bintang yang Allah bersumpah atasnya adalah ungkapan atas turunnya Al Qur’an; Karena Al Qur’an turun secara berangsur-angsur kepada Nabi ﷺ. Dengan ini maka maknanya adalah : Sesungguhnya Allah bersumpah dengan ungkapan turunnya Al Qur’an yang diturunkan malaikat kepada Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan kata “kawanmu” untuk mengingatkan mereka, bahwa mereka telah mengenal keadaan dan pribadi Beliau yang penuh dengan kejujuran dan petunjuk, dan bahwa keadaan Beliau tidak samar bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 2",
    "description": "Sesungguhnya kawanmu yang sangat kamu kenal kejujurannya, yaitu nabi Muhammad, tidak sesat dalam perilakunya saat menyampaikan dakwah dan tidak pula keliru dalam ucapan-ucapan yang disampaikannya. 3. Apa saja yang dilakukan oleh nabi Muhammad merupakan perintah tuhannya, dan tidaklah pula yang diucapkannya itu, yaitu ayat-ayat Al-Qur'an, merupakan perkataan kosong dan menurut keinginannya saja."
  }
]