[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-20. Apakah kalian (wahai orang-orang musyrik) memperhatikan tuhan-tuhan yang kalian sembah: al-Lata, al-Uzza dan yang ketiga lainnya adalah Manat; apakah mereka bisa mendatangkan manfaat atau mudarat sehingga mereka menjadi sekutu-sekutu bagi Allah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. dan Manāt, berhala ketiga yang lain dari berhala-berhala kalian. Kabarkan kepadaku adakah mereka mempunyai kemampuan untuk memberi manfaat atau mudarat kepada kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَمَنَوٰةَ (dan Manah) Manah adalah patung perempuan yang disembah oleh suku ‘Aus dan Khazraj yang terletak di antara kota Makkah dan Madinah. Allah menyebutnya dengan kalimat: الثَّالِثَةَ الْأُخْرَىٰٓ( yang ketiga, yang paling terkemudian) sebagai penghinaan bagi patung ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19-20. Apa kemudian kalian (masih) menganggap keberadaan Latta, yaitu berhala yang telah turun temurun disembah di Thaif dan Uzza, berhala suku Ghatfan, yaitu berhala pohon yang terbuat dari batang pohon kurma, dan Manat, yaitu berhala batu milik Bani Hudzail dan kabilah Khuza’ah. {Ats-Tsalitsatil Ukhra} adalah dua kata sifat yang digunakan untuk menegaskan celaan pada mereka. Al-Ukhra diletakkan di akhir untuk di kira-kirakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serta Manah yang merupakan (berhala) ketiga lainnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. Setelah Allah menyebutkan petunjuk dan agama yang benar yang dibawa Muhammad serta perintah untuk beribadah kepadaNya dan mengesakanNya, selanjutnya Allah menyebutkan kebatilan jalan orang-orang musyrik, berupa penyembahan terhadap patung dan berhala yang tidak memiliki kesempurnaan sifat dan juga tidak bisa mendatangkan manfaat serta mara bahaya, sesembahan-sesembahan tersebut hanya nama yang tidak memiliki makna yang dikatakan oleh orang-orang musyrik dan nenek moyang mereka yang bodoh dan sesat, mereka membuat-buat nama-nama batil yang seharusnya tidak berhak. Mereka menipu diri mereka sendiri dan juga orang lain berupa kesesatan. Sesembahan-sesembahan dengan kondisi seperti ini sama sekali tidak berhak disembah. Sekutu-sekutu Allah yang mereka beri nama seperti itu menurut pengakuan mereka bersumber dari sifat-sifatnya. Mereka memberi nama Latta yang berasal dari kata ‘Al-ilaah’ (yang merupakan nama Allah) yang berhak untuk disembah. Nama Uzza berasal dari kata ‘al-Aziz’ yang bermakna Yang Mahaperkasa. Nama Manat berasal dari kata al-Mannan yang bermakna Yang Maha Pemberi, dengan maksud menentang nama-nama Allah serta menyekutukan Allah dengan nama-nama itu. Sebenarnya, nama-nama sesembahan tersebut tidak memiliki makna. Siapa saja yang memiliki akal walaupun sedikit bisa mengetahui kebatilan sifat-sifat yang terdapat pada sesembahan-sesembahan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 20: 19-20. Allah mencela kepada orang-orang kafir yang mereka beribadah kepada berhala-berhala, dimana berhala-berhala tersebut tidak memudharatkan dan tidak memberi manfaat, dan mereka menjadikan berhala-berhala itu sekutu bagi Allah, yang mereka juga tahu akan keagungan Allah. Al Lata adalah nama yang diambil dari nama Allah, yang dulunya ia memiliki kelompok. Adapun Al Uzza, berkata Mujahid : Adalah pohon yang terletak di Ghathafan, yang mereka ibadahi. Kemudian Rasulullah ﷺ mengutus Khalid bin Walid untuk mencabut dari akarnya. Adapun Manat adalah berhala yang telah diancurkan, pada saat itu orang-orang Mekkah mengibadahinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Lata, Al Uzza dan Manah adalah nama berhala-berhala yang disembah orang Arab Jahiliyah dan dianggapnya sebagai perantara antara mereka dengan Allah dan dianggap sebagai anak-anak perempuan Allah, Subhaanallah (Mahasuci Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 20",
    "description": "19-20. Bila ayat-ayat yang lalu menjelaskan keteguhan sikap nabi Muhammad dan kelurusan jalan yang ditempuhnya, maka pada ayat-ayat ini Allah menerangkan kecaman terhadap orang kafir yang tetap me-nyembah berhala. Wahai orang musyrik, maka apakah patut kamu menganggap al-l'ta dan al-'uzz', dan man't, yang merupakan berhala ketiga yang kemudian kamu anggap sebagai anak perempuan Allah'21. Apakah pantas bila kamu memilih untuk kamu sendiri anak yang laki-laki dan untuk-Nya kamu memilihkan anak yang perempuan, sedangkan kamu sendiri benci dan marah bila mendapatkan anak perempuan'."
  }
]