[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Apakah kalian menjadikan anak lelaki yang kalian harapkan untuk diri kalian lalu kalian menjadikan anak perempuan kepada Allah, padahal kalian sendiri tidak menerimanya untuk diri kalian? Jika demikian, maka itu adalah sebuah pembagian yang curang. Berhala-berhala itu hanya nama, yang sedikit pun tidak memiliki sifat kesempurnaan. Ia hanya nama-nama yang kalian dan leluhur kalian berikan sesuai dengan hawa nafsu kalian yang batil, Allah tidak menurunkan bukti yang membenarkan klaim kalian tentangnya. Orang-orang musyrik itu tidak mengikuti kecuali dugaan dan hawa nafsu mereka yang menyimpang dari fitrah yang selamat. Sungguh telah datang kepada mereka dari Tuhan mereka melalui Nabi, apa-apa yang mengandung hidayah bagi mereka, tetapi mereka tidak mau mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Ataukah bagi kalian -wahai orang-orang musyrik- anak laki-laki yang kalian sukai, sementara bagi Allah -Subḥānahu- anak perempuan yang tidak kalian sukai?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21-22. تِلْكَ إِذًا قِسْمَةٌ ضِيزَىٰٓ أَلَكُمُ الذَّكَرُ وَلَهُ الْأُنثَىٰ (Apakah (patut) untuk kamu (anak) laki-laki dan untuk Allah (anak) perempuan? Yang demikian itu tentulah suatu pembagian yang tidak adil) Yakni katakanlah kepadaku tentang tuhan-tuhan yang kalian jadikan sebagai anak-anak perempuan Allah. Mengapa kalian memberikan Allah anak yang kalian benci, sedangkan kalian sendiri mengaharapkan akan laki-laki? Ini merupakan pembagian yang zalim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Bagaimana bisa kalian menganggap wahai orang-orang musyrik bahwa kalian memiliki anak laki-laki dan Allah memiliki anak perempuan yang tidak kalian ridhai untuk diri kalian?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah (pantas) bagi kalian (anak) laki-laki dan bagiNya (anak) perempuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Apakah (patut) untuk kamu (anak) laki-laki dan untuk Allah (anak) perempuan?” artinya, kalian menganggap Allah memiliki anak-anak perempuan berdasarkan dugaan kalian sedangkan kalian menganggap memiliki anak-anak lelaki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 21: 21-22. Allah mencela mereka orang-orang musyrik yang mereka masih memiliki macam porsi kecintaan (kepada berhala-berhala mereka) dan menganggap sebagai anak perempuan Allah, adapun kepada Allah mereka menjadikan Allah sesuatu yang buruk pada porsi yang lain, mereka mengklaim bahwa Allah memiliki anak perempuan, sedangkan anak-anak mereka yang perempuan mereka hinakan. Ketahuilah wahai orang-orang musyrik bahwa pembagian ini menyelisihi, asing dan dzalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 21",
    "description": "Apakah pantas bila kamu memilih untuk kamu sendiri anak yang laki-laki dan untuk-Nya kamu memilihkan anak yang perempuan, sedangkan kamu sendiri benci dan marah bila mendapatkan anak perempuan'22. Keinginan yang demikian itu tentulah merupakan suatu pembagian yang tidak adil untuk dihubungkan dengan Allah."
  }
]