[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Apakah kalian menjadikan anak lelaki yang kalian harapkan untuk diri kalian lalu kalian menjadikan anak perempuan kepada Allah, padahal kalian sendiri tidak menerimanya untuk diri kalian? Jika demikian, maka itu adalah sebuah pembagian yang curang. Berhala-berhala itu hanya nama, yang sedikit pun tidak memiliki sifat kesempurnaan. Ia hanya nama-nama yang kalian dan leluhur kalian berikan sesuai dengan hawa nafsu kalian yang batil, Allah tidak menurunkan bukti yang membenarkan klaim kalian tentangnya. Orang-orang musyrik itu tidak mengikuti kecuali dugaan dan hawa nafsu mereka yang menyimpang dari fitrah yang selamat. Sungguh telah datang kepada mereka dari Tuhan mereka melalui Nabi, apa-apa yang mengandung hidayah bagi mereka, tetapi mereka tidak mau mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Pembagian yang kalian lakukan berdasarkan hawa nafsu kalian itu adalah pembagian yang tidak adil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Yang demikian itu adalah pembagian yang rendah dan zalim, yaitu dengan menjadikan anak perempuan untuk Allah dan anak laki-laki untuk kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu adalah suatu pembagian yang tidak adil} tidak adil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Yang demikian itu tentulah suatu pembagian yang tidak adil,” yakni, zhalim. Kezhaliman apa yang lebih besar daripada pembagian yang melebihkan bagian makhluk melebihi bagian Khalik? Mahatinggi Allah dari ucapan mereka, karena tinggi hati dan sikap sombong mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 22: 21-22. Allah mencela mereka orang-orang musyrik yang mereka masih memiliki macam porsi kecintaan (kepada berhala-berhala mereka) dan menganggap sebagai anak perempuan Allah, adapun kepada Allah mereka menjadikan Allah sesuatu yang buruk pada porsi yang lain, mereka mengklaim bahwa Allah memiliki anak perempuan, sedangkan anak-anak mereka yang perempuan mereka hinakan. Ketahuilah wahai orang-orang musyrik bahwa pembagian ini menyelisihi, asing dan dzalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pembagian apa yang lebih zalim daripada pembagian yang menghendaki diutamakannya makhluk di atas Khaliq (Pencipta)? Mahasuci dan Mahatinggi Allah dari perkataan mereka itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 22",
    "description": "Keinginan yang demikian itu tentulah merupakan suatu pembagian yang tidak adil untuk dihubungkan dengan Allah. 23. Wahai kaum musyrik, sesungguhnya berhala-berhala yang kamu sembah itu tidak lain hanyalah nama-nama belaka, yang tidak memiliki sifat ketuhanan dan karenanya tidak layak disembah. Kamulah pada masa ini dan nenek moyangmu pada masa lalu yang mengada-adakan nama mereka, sedang Allah tidak menurunkan suatu keterangan apa pun terkait ketuhanannya sehingga kamu tidak punya alasan untuk menyembah-Nya. Sesungguhnya mereka, yaitu kaum musyrik, hanya mengikuti dugaan yang tidak berdasar dan apa yang diingini oleh keinginannya. Padahal sungguh, telah datang petunjuk yang benar dari tuhan mereka. Andai saja mereka mau memahami dan menerimanya."
  }
]