[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-23. Apakah kalian menjadikan anak lelaki yang kalian harapkan untuk diri kalian lalu kalian menjadikan anak perempuan kepada Allah, padahal kalian sendiri tidak menerimanya untuk diri kalian? Jika demikian, maka itu adalah sebuah pembagian yang curang. Berhala-berhala itu hanya nama, yang sedikit pun tidak memiliki sifat kesempurnaan. Ia hanya nama-nama yang kalian dan leluhur kalian berikan sesuai dengan hawa nafsu kalian yang batil, Allah tidak menurunkan bukti yang membenarkan klaim kalian tentangnya. Orang-orang musyrik itu tidak mengikuti kecuali dugaan dan hawa nafsu mereka yang menyimpang dari fitrah yang selamat. Sungguh telah datang kepada mereka dari Tuhan mereka melalui Nabi, apa-apa yang mengandung hidayah bagi mereka, tetapi mereka tidak mau mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Berhala-berhala ini tidak lain hanyalah nama-nama yang tidak mempunyai arti. Ia tidak mempunyai bagian dari sifat-sifat ketuhanan, kalian dan bapak-bapak kalian menamakannya hanya dari diri kalian, Allah tidak menurunkan keterangan tentang hal itu. Orang-orang musyrik tidak lain hanyalah mengikuti prasangka dalam keyakinan mereka dan apa yang diinginkan oleh hawa nafsu mereka dari apa yang dijadikan indah oleh setan-setan di dalam hati mereka, dan sungguh telah datang kepada mereka petunjuk dari Rabb mereka melalui lisan Nabi-Nya, akan tetapi mereka tidak mengambil petunjuk itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِنْ هِىَ إِلَّآ أَسْمَآءٌ سَمَّيْتُمُوهَآ أَنتُمْ وَءَابَآؤُكُم (tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengadakannya) Sebab berhala-berhala itu tidak dapat melihat dan mendengar, tidak dapat memahami dan berfikir, serta tidak dapat memberi manfaat atau mudharat. Itu hanyalah nama-nama yang kalian dan nenek moyang kalian sebut sebagai tuhan-tuhan, dan tidak memiliki sifat ketuhanan sedikitpun, orang yang akhir mengikuti orang sebelumnya dan anak-anak mengikuti bapak-bapak mereka. مَّآ أَنزَلَ اللهُ بِهَا مِن سُلْطٰنٍ ۚ( Allah tidak menurunkan suatu keteranganpun untuk (menyembah)nya) Yakni tanpa ada hujjah yang dapat mereka gunakan sebagai bukti bahwa itu adalah tuhan-tuhan yang sesungguhnya. إِن يَتَّبِعُونَ إِلَّا الظَّنَّ(Mereka tidak lain hanyalah mengikuti sangkaan-sangkaan) Dan prasangka tidak membuktikan kebenaran sedikitpun. وَمَا تَهْوَى الْأَنفُسُ ۖ( dan apa yang diingini oleh hawa nafsu mereka) Yakni yang diinginkan oleh hawa nafsu tanpa memandang kebenaran yang wajib diikuti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Berhala-berhala ini tidak lain hanyalah nama-nama yang kalian dan leluhur kalian sebut sebagai Tuhan. Allah tidak menurunkan dalil dan bukti untuk menyembah berhala-berhala itu. Apa yang mereka ikuti dalam menyembah berhala-berhala itu tidak lain kecuali anggapan yang tidak berdasarkan dalil dan hanya menuruti hawa nafsu saja. Sungguh telah datang kepada mereka bukti yang nyata dari Tuhan mereka yaitu Rasulallah dan Al-Qur’an yang menunjukkan bahwa yang layak disembah hanya Allah, namun mereka tidak berhenti dari kesyirikan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Berhala) itu tidak lain hanyalah nama-nama yang kalian dan nenek moyang kalian buat. Allah tidak menurunkan suatu keterangan} dalil {apa pun untuknya. Mereka tidak lain hanya mengikuti dugaan dan apa yang diinginkan oleh hawa nafsu. Sungguh benar-benar telah datang kepada mereka petunjuk dari Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman, “Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengada-adakannya, Allah tidak menurunkan suatu keterangan pun untuk (menyembah) nya,” berupa hujjah dan bukti atas kebenaran pandangan kalian. Semua hal yang tidak diturunkan keterangannya oleh Allah adalah batil, rusak dan tidak boleh dijadikan sebagai anutan. Sebenarnya mereka sendiri pun tidak mengikuti bukti yang mereka yakini sebagai pendapat. Pendorong mereka mengucapkan perkataan itu hanyalah dugaan keliru, kebodohan hina, dan hawa nafsu mereka yang menginginkan kesyirikan dan bid’ah yang sesuai dengan kemauan mereka. Nyatanya, mereka tidak memiliki motif untuk mengikuti prasangka selain karena tidak adanya ilmu dan petunjuk. Karena itulah Allah berfirman, “Dan sungguh telah datang petunjuk kepada mereka dari Rabb mereka,” yakni yang menunjukkan mereka dalam masalah tauhid, kenabian serta seluruh hal yang dibutuhkan oleh manusia; semuanya telah dijelaskan oleh Allah dengan jelas, dan tujuannya pun telah ditunjukkan dengan menegakkan berbagai dalil serta bukti nyata yang mewajibkan mereka dan lainnya untuk mengikuti sehingga tidak tersisa satu alasan pun bagi seseorang setelah penjelasan dan bukti nyata itu diberikan. Karena jalan yang mereka tempuh itu berujung pada penurutan praduga dan berakhir dengan kesengsaraan abadi serta azab yang kekal, maka tetap berada dalam kondisi seperti ini menjadikannya orang yang paling bodoh dan zhalim."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 23: Kemudian Allah kembali menjelaskan hakikat berhala yang mereka ibadahi, Allah mengabarkan bahwa berhala-berhala itu tidak memiliki sifat-sifat yang sempurna, berhala-berhala itu hanyalah nama-nama yang kalian berikan kepada mereka wahai orang-orang musyrik yang kalian dan nenek moyangmu berikan nama kepada berhala-berhala tersebut. Dan di sisi kalian tidak ada hujjah dan bukti atas klaim kalian, bahkan tidaklah kalian mengikuti kecuali hanyalah sangkaan belaka dan hawa nafsu sesat kalian, bersamaan dengan itu kalian mendatangkan sesuatu yang buruk dari lisan-lisan kalian di atas lisan Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam menyembahnya, bukan di atas ilmu, keterangan dan petunjuk. Yang telah dihias oleh setan, berupa syirk dan bid’ah-bid’ah yang sejalan dengan hawa nafsu mereka. Melalui lisan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam yang diperkuat dengan dalil dan bukti yang qath’i (pasti); yang menerangkan kepada mereka ‘aqidah yang benar dan segala tuntutan yang dibutuhkan hamba, dimana Allah Subhaanahu wa Ta'aala telah menerangkannya secara jelas dan gamblang, namun mereka tetap saja tidak mau mengikuti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 23",
    "description": "Wahai kaum musyrik, sesungguhnya berhala-berhala yang kamu sembah itu tidak lain hanyalah nama-nama belaka, yang tidak memiliki sifat ketuhanan dan karenanya tidak layak disembah. Kamulah pada masa ini dan nenek moyangmu pada masa lalu yang mengada-adakan nama mereka, sedang Allah tidak menurunkan suatu keterangan apa pun terkait ketuhanannya sehingga kamu tidak punya alasan untuk menyembah-Nya. Sesungguhnya mereka, yaitu kaum musyrik, hanya mengikuti dugaan yang tidak berdasar dan apa yang diingini oleh keinginannya. Padahal sungguh, telah datang petunjuk yang benar dari tuhan mereka. Andai saja mereka mau memahami dan menerimanya. 24-25. Kaum musyrik mestinya menerima petunjuk Allah dan mendapatkan keselamatan atau apakah manusia yang musyrik itu akan mendapat segala yang dicita-citakannya, yaitu yang terkait dengan harta, kedudukan, dan kesenangan hidup' tidak! mereka hanya makhluk yang telah ditetapkan oleh Allah, maka sesungguhnya milik Allahlah kehidupan akhirat yang abadi dan kehidupan dunia yang fana."
  }
]