[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-25. Manusia tidak mendapat apa yang diangan-angankannya, yaitu syafaat dari tuhan-tuhan batil atau lainnya yang diinginkan oleh hawa nafsunya. Hanya milik Allah-lah urusan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Apakah manusia mendapatkan apa yang diangankan berupa syafaat berhala-berhala itu di sisi Allah?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-26. Manusia tidak selalu dapat meraih apa yang dia inginkan, sehingga dia mengharap syafaat dari berhala-berhala. Padahal segalanya merupakan milik Allah; perkara dunia dan akhirat adalah milik-Nya. Dan banyak dari para malaikat yang mulia yang ada di tujuh langit tidak dapat memberi syafaat kepada seorangpun melainkan dengan izin Allah bagi orang yang Dia kehendaki dan ridhai untuk mendapat syafaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَمْ لِلْإِنسٰنِ مَا تَمَنَّىٰ (Atau apakah manusia akan mendapat segala yang dicita-citakannya?) Allah membantah mereka bahwa mereka berhala-berhala mereka dapat memberi mereka manfaat atau syafaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Apakah setiap manusia itu berharap bahwa berhala-berhala itu akan memberikan pertolongan kepada mereka? Kenyataannya tidak sesuai yang mereka cita-citakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah manusia akan mendapat segala yang diinginkan} orang kafir tidak akan mendapatkan apa yang dia harapkan berupa pertolongan dari para berhala itU"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24-25. Meski demikian, mereka tetap berangan-angan dan menipu diri mereka sendiri. Karena itulah Allah mengingkari dugaan mereka yang mengira angan-angan itu akan dicapai, mereka berdusta dalam hal ini, Allah berfirman, “Atau apakah manusia akan mendapat segala yang dicita-citakanNya? (Tidak), maka hanya bagi Allah kehidupan akhirat dan kehidupan dunia.” Allah memberikan sebagian jatah dunia dan akhirat pada orang yang dikehendaki dan mencegahnya dari orang yang dikehendaki. Tidak berdasarkan angan-angan dan hawa nafsu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 24: 24-25. Apakah manusia yang kafir menyangkan bahwa mereka akan mendapatkan angan-angan dan segala sesuatu yang mereka inginkan ?! Dengan hanya angan-angan belaka ?! Dan di antara angan-angan orang musyrik bahwa mereka menyangkan bahwa tuhan-tuhan mereka yang bathil akan memberikan sesuatu kepada mereka. Sekali-kali tidak, karena segala sesuatunya hanyalah ada di tangan Allah semata. Allah memiliki urusan akhirat yang lebih utama, Allah mencintai manusia sesuai keinginan-Nya, dengan rahmat dan karunia-Nya, dan menahan segala sesuatu sesuai kehendak-Nya dengan hikmat dan sifat adil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika sudah jelas bahwa apa yang dipegang oleh kaum musyrik adalah dugaan dan bukan ilmu, dimana hal ini berakibat kepada kesengsaraan abadi dan azab yang kekal, maka tetap berada di atasnya merupakan kedunguan yang sangat dalam dan kezaliman yang paling batil. Namun anehnya, mereka (kaum musyrik) malah memiliki banyak angan-angan dan tertipu olehnya. Oleh karena itulah, dalam ayat di atas Allah Subhaanahu wa Ta'aala mengingkari orang yang merasa akan mendapatkan apa yang diangan-angankan itu dan bahwa mereka dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 24",
    "description": "24-25. Kaum musyrik mestinya menerima petunjuk Allah dan mendapatkan keselamatan atau apakah manusia yang musyrik itu akan mendapat segala yang dicita-citakannya, yaitu yang terkait dengan harta, kedudukan, dan kesenangan hidup' tidak! mereka hanya makhluk yang telah ditetapkan oleh Allah, maka sesungguhnya milik Allahlah kehidupan akhirat yang abadi dan kehidupan dunia yang fana"
  }
]