[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Banyak malaikat di langit dengan kedudukan mereka yang tinggi, syafaat mereka tidak berguna sama sekali kecuali sesudah Allah izinkan mereka untuk memberi syafaat dan meridhai siapa yang diberi syafaat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Berapa banyak malaikat di langit yang syafaat mereka tidak berguna sedikitpun seandainya mereka ingin memberikan syafaat kepada seseorang kecuali setelah Allah mengizinkan sebagian mereka memberi syafaat untuk orang yang dikehendaki-Nya dan Allah meridai orang yang diberi syafaat itu. Allah tidak akan memberi izin bagi yang menjadikan sekutu selain Allah untuk memberi syafaat, dan tidak meridai orang yang diberi syafaat yang menyembahnya selain menyembah Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَكَم مِّن مَّلَكٍ فِى السَّمٰوٰتِ لَا تُغْنِى شَفٰعَتُهُمْ شَيْـًٔا (Dan berapa banyaknya malaikat di langit, syafa’at mereka sedikitpun tidak berguna) Jika malaikat yang mulia dan banyak beribadah tidak mampu memberi syafaat kecuali bagi yang diizinkan Allah, maka bagaimana benda mati yang tidak dapat berfikir itu dapat memberi syafaat? إِلَّا مِنۢ بَعْدِ أَن يَأْذَنَ اللهُ(kecuali sesudah Allah mengijinkan) Yakni mengizinkan mereka untuk memberi syafaat. لِمَن يَشَآءُ(bagi orang yang dikehendaki) Yakni bagi orang yang dikehendaki-Nya untuk mendapat syafaat. وَيَرْضَىٰٓ( dan diridhai (Nya)) Untuk mendapat syafaat, yaitu orang yang mentauhidkan Allah. Sedangkan orang-orang musyrik tidak akan mendapat syafaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Malaikat yang sangat banyak di langit itu (untuk menunjukkan tingginya kedudukan mereka) tidak berguna sedikitpun syafaatnya kepada seseorang kecuali setelah mendapatkan ijin memberi syafaat bagi orang yang dikehendaki oleh Allah, maka mereka akan memberikan syafaat untuknya. Allah meridhai orang-orang yang ikhlas dalam ucapan dan perbuatannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak malaikat} banyak malaikat {di langit yang tidak berguna} tidak berguna {syafaat mereka sedikit pun, kecuali setelah Allah mengizinkannya bagi siapa saja yang Dia kehendaki dan Dia ridhai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah berfirman mengingkari orang yang menyembah selainNya seperti malaikat dan lainnya, di mana orang itu mengira bahwa sesembahan selain Allah itu bisa membawa manfaat dan memberinya syafa’at baginya di sisi Allah pada Hari Kiamat. “Dan berapa banyaknya malaikat di langit,” yakni para malaikat yang didekatkan (kepada Allah) dan malaikat mulia, “syafa’at mereka sedikitpun tidak berguna ,” artinya, sesembahan selain Allah yang dimintai, diharapkan, dan dijadikan tempat bergantung tidak memberinya manfaat, “kecuali sesudah Allah mengizinkan bagi orang yang dikehendaki dan diridhai (Nya).” Artinya, harus memenuhi dua syarat; izin Allah dalam memberi syafa’at dan keridhaanNya terhadap orang yang diberi syafa’at. Sebagaimana diketahui bahwa amalan itu tidak bisa diterima kecuali yang dilakukan karena Allah semata dan sesuai dengan ketentuan syariat. Karena itu orang-orang musyrik tidak mendapatkan bagian syafa’at semau orang yang bisa memberi syafa’at, karena mereka sendiri yang menutup diri sendiri untuk mendapatkan rahmat dari Allah yang Maha pemberi rahmat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 26: Allah mengabarkan bahwa kebanyakan dari Malaikat yang mereka beribadah kepada Allah malam dan siang; Bersamaan dengan kedudukan mereka yang tinggi, mereka tidak dapat memberikan syafaat sama sekali; Kecuali jika Allah meridhai yang diberi syafaat, dan mengizinkan untuk memberi syafaat. Maka jika demikian keadaan para malaikat di sisi Allah, maka bagaimana mungkin bagi berhala-berhala yang benda mati, tanpa ruh dan juga kehidupan memiliki syafaat. Begitu juga para kekasih Allah, atau yang lebih tinggi kedudukannya dari mereka, dan pada ayat ini menetapkan bahwa syafaat itu bersyarat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala mengingkari orang yang menyembah selain-Nya baik berupa malaikat maupun selainnya dan menyangka bahwa sembahannya itu bermanfaat baginya dan dapat memberinya syafaat di sisi Allah Subhaanahu wa Ta'aala pada hari Kiamat. Oleh karena itu, syafaat hanyalah akan diberikan setelah terpenuhi dua syarat: - Izin dari Allah Subhaanahu wa Ta'aala untuk memberi syafaat - Ridha Allah Subhaanahu wa Ta'aala kepada orang yang diberi syafaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 26",
    "description": "Berapa banyak manusia dengan kemampuan luar biasa nyatanya tidak dapat menggapai keinginannya, dan berapa banyak pula malaikat yang suci dan berkedudukan mulia di langit, tetapi syafa'at dan pertolongan mereka sedikit pun tidak berguna bagi makhluk lain, kecuali apabila Allah Yang Mahakuasa telah mengizinkan mereka untuk memberi syafa'at bagi siapa yang Dia kehendaki dan Dia ridai karena amal saleh dan keta'atannya.27. Sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat, yaitu orang musyrik penyembah berhala, mereka benar-benar menamakan para malaikat dan menyifati mereka dengan nama dan sifat pe-rempuan. Selanjutnya, mereka mengatakan bahwa para malaikat itu adalah putri-putri Allah."
  }
]