[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Sesungguhnya orang-orang yang tidak membenarkan kehidupan akhirat dari orang-orang kafir Arab dan tidak beramal untuknya, memberi nama para malaikat dengan nama perempuan, karena mereka menyangka dengan kebodohan mereka, bahwa para malaikat adalah wanita, dan bahwa mereka adalah anak-anak perempuan Allah. Mereka tidak punya bukti yang shahih yang membenarkan ucapan mereka. Mereka tidak mengikuti kecuali dugaan yang tidak berguna sedikit pun, ia sama sekali tidak akan menjadi kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sesungguhnya orang-orang yang tidak beriman kepada hari kebangkitan di alam Akhirat benar-benar menamakan para malaikat dengan nama-nama perempuan karena mereka meyakini bahwa malaikat adalah anak-anak perempuan Allah. Mahatinggi Allah dari ucapan mereka setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-30. Orang-orang kafir yang mendustakan adanya kehidupan akhirat itu menyebut para malaikat dengan sebutan perempuan, dengan mengatakan: “Mereka adalah anak-anak perempuan Allah.” Kebohongan mereka itu tidak berlandaskan dalil yang benar, mereka hanya menuruti prasangka yang salah. Sungguh prasangka batil semacam ini tidaklah sama dengan kebenaran. Hai Rasulullah, biarkanlah orang-orang musyrik yang berpaling dari al-Qur’an dan hanya menghadap syahwat dunia saja itu. Kesesatan yang jauh itulah ilmu yang mampu mereka dapatkan. Sungguh Tuhanmu Maha Mengetahui orang yang menempuh jalan kesesatan, dan Dia Maha Mengetahui orang yang menempuh jalan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ لَيُسَمُّونَ الْمَلٰٓئِكَةَ تَسْمِيَةَ الْأُنثَىٰ (Sesungguhnya orang-orang yang tiada beriman kepada kehidupan akhirat, mereka benar-benar menamakan malaikat itu dengan nama perempuan) Mereka mengatakan bahwa para malaikat itu adalah anak-anak perempuan Allah; mereka menganggap para malaikat adalah perempuan-perempuan, dan mereka diberi nama dengan nama-nama perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Sesungguhnya orang-orang musyrik yang tidak beriman kepada akhirat itu menamai setiap malaikat dengan penamaan perempuan. Mereka menggambarkan bahwa malaikat-malaikat itu anak-anak perempuan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat benar-benar menamai para malaikat itu dengan nama perempuaN} dengan penamaan perempuan ketika mereka berkata,”Sesungguhnya mereka adalah anak-anak perempuan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Maksudnya, orang-orang yang menyekutukan Allah dan mendustakan para rasulNya adalah mereka yang tidak beriman pada Hari Akhir. Karena tidak beriman dengan Hari Akhir itulah mereka melakukan tindakan pembangkangan dengan mengucapkan perkataan dan tindakan yang menantang Allah dan RasulNya. Di antara perkataan yang mereka ucapkan, “Malaikat adalah anak perempuan Allah.” Mereka tidak memahasucikan Rabb mereka dari memiliki anak serta tidak memuliakan para malaikat karena disebut sebagai anak perempuan. Sebenarnya, mereka tidak memiliki ilmu tentang Allah tentang RasulNya bahkan fitrah dan akal sehat pun tidak menunjukkan seperti itu, justru ilmu secara keseluruhan menunjukkan kekeliruan pernyataan mereka. Allah Mahasuci dari memiliki anak dan pendamping, karena Allah adalah Maha Esa dan Tunggal, satu-satunya tempat bergantung seluruh makhluk, yang tidak beranak dan diperanakkan, tidak ada sekutu bagiNya, para malaikat adalah hamba-hamba Allah yang mulia yang mendekatkan diri kepada Allah, yang senantiasa melayani Allah. “dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.”–At-Tahrim:6-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 27: 27-28. Allah menyebutkan bahwa orang-orang kafir yang tidak membenarkan akan akhirat, sungguh mereka menamakan para malaikat dengan nama perempuan. Mereka berkata : Para malaikat adalah anak-anak perempuan Allah. Mereka menamakan masing-masing dari malaikat dengan nama-nama perempuan dan mensifatkan dengan sifat perempuan. Kemudian Allah menjelaskan, bahwa mereka yang tidak beriman dengan negeri akhirat, mereka tidak memiliki pengetahuan atas apa yang mereka ucapkan; Mereka tidak menyaksikan bagaimana penciptaan malaikat, Allah juga tidak mendatangkan hujjah dan bukti-bukti kepada (ucapan) mereka. Tidaklah mereka mendasari ucapannya kecuali atas dasar sangkaan belaka tanpa hujjah, dan tidak ada kebenaran sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang yang menyekutukan Allah lagi mendustakan Rasul-Nya yang tidak beriman kepada akhirat, karena mereka tidak beriman kepada akhirat, maka mereka berani melakukan tindakan yang menentang Allah dan Rasul-Nya baik yang berupa ucapan maupun yang berupa perbuatan. Yang berupa ucapan seperti mengatakan bahwa para malaikat adalah puteri Allah, subhaanallah. Mereka tidak membersihkan Allah dari sifat melahirkan dan tidak memuliakan para malaikat sehingga menamai mereka dengan anak-anak perempuan, padahal mereka tidak memiliki ilmu baik berasal dari Allah maupun dari Rasul-Nya, dan tidak pula didukung oleh fitrah dan akal. Bahkan ilmu malah menunjukkan sebaliknya, yaitu bahwa Allah Subhaanahu wa Ta'aala tidak beranak dan tidak pula diperanakkan, dan bagaimana Dia mempunyai anak sedangkan Dia tidak mempunyai istri, bahkan Dia Mahaesa, Tuhan yang bergantung kepada-Nya segala sesuatu, Dia tidak beranak dan tidak pula diperanakkan dan tidak ada seorang pun yang setara dengan Dia. Sedangkan para malaikat-Nya, mereka adalah makhluk-Nya yang mulia yang didekatkan dengan Allah yang selalu menjalankan perintah-Nya dan tidak mendurhakai-Nya. Oleh karena itu, tidak ada yang dijadikan dasar oleh orang-orang musyrik dalam ucapan dan tindakan mereka selain mengikuti dugaan dan sangkaan yang tidak membuahkan sedikit pun kebenaran, karena kebenaran harus ada keyakinan dan hal itu hanya dapat dihasilkan dari dalil-dalil yang qath’i (pasti) dan bukti-bukti yang jelas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 27",
    "description": "Sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat, yaitu orang musyrik penyembah berhala, mereka benar-benar menamakan para malaikat dan menyifati mereka dengan nama dan sifat pe-rempuan. Selanjutnya, mereka mengatakan bahwa para malaikat itu adalah putri-putri Allah. 28. Orang-orang musyrik itu hanya menuruti keinginannya saat me-Nyatakan bahwa para malaikat itu adalah putri-putri Allah, dan mereka tidak mempunyai ilmu yang mendasari keyakinannya tentang hal itu. Mereka tidak lain hanyalah mengikuti dugaan yang hanya berdasar hawa nafsu, dan sesungguhnya dugaan yang tidak didukung kenyataan atau ilmu itu tidak berfaedah sedikit pun terhadap kebenaran. Karena itu, dugaan demikian tidak dapat dijadikan sebagai dasar dalam keyakinan agama."
  }
]