[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Sesungguhnya orang-orang yang tidak membenarkan kehidupan akhirat dari orang-orang kafir Arab dan tidak beramal untuknya, memberi nama para malaikat dengan nama perempuan, karena mereka menyangka dengan kebodohan mereka, bahwa para malaikat adalah wanita, dan bahwa mereka adalah anak-anak perempuan Allah. Mereka tidak punya bukti yang shahih yang membenarkan ucapan mereka. Mereka tidak mengikuti kecuali dugaan yang tidak berguna sedikit pun, ia sama sekali tidak akan menjadi kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Penamaan mereka dengan anak-anak perempuan sama sekali tidak berdasarkan kepada pengetahuan, mereka tidak mengikuti kecuali hanya sekedar prasangka saja, dan sesungguhnya prasangka itu sama sekali tidak berguna untuk mencapai kebenaran sehingga didudukkan pada tempatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Tidaklah ucapan mereka ini merupakan dalil yang benar. Apa yang mereka percayai tentang penggambaran feminitas ini kecuali hanya bayangan dan khayalan saja. Sesungguhnya anggapan yang batil atau khayalan itu tidak dapat mengubah sedikitpun kebenaran dan tidak dapat menggantikan posisinya selamanya. Al-Haqqu disini adalah pengetahuan yang sudah pasti, yaitu ilmu yang sudah pasti diyakini dan tidak dapat diubah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak mempunyai pengetahuan tentang itu. Mereka tidak lain hanyalah mengikuti dugaan dan sesungguhnya dugaan itu tidak berguna} tidak bermanfaat {sedikit pun terhadap kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Orang-orang musyrik dalam mengikuti pandangan buruk itu berdasarkan dugaan yang sama sekali tidak berguna bagi kebenaran, karena kebenaran itu harus yakin bersumber dari dalil-dalil qath’I (tak terbantahkan) serta bukti-bukti jelas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 28: 27-28. Allah menyebutkan bahwa orang-orang kafir yang tidak membenarkan akan akhirat, sungguh mereka menamakan para malaikat dengan nama perempuan. Mereka berkata : Para malaikat adalah anak-anak perempuan Allah. Mereka menamakan masing-masing dari malaikat dengan nama-nama perempuan dan mensifatkan dengan sifat perempuan. Kemudian Allah menjelaskan, bahwa mereka yang tidak beriman dengan negeri akhirat, mereka tidak memiliki pengetahuan atas apa yang mereka ucapkan; Mereka tidak menyaksikan bagaimana penciptaan malaikat, Allah juga tidak mendatangkan hujjah dan bukti-bukti kepada (ucapan) mereka. Tidaklah mereka mendasari ucapannya kecuali atas dasar sangkaan belaka tanpa hujjah, dan tidak ada kebenaran sama sekali."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 28",
    "description": "Orang-orang musyrik itu hanya menuruti keinginannya saat me-Nyatakan bahwa para malaikat itu adalah putri-putri Allah, dan mereka tidak mempunyai ilmu yang mendasari keyakinannya tentang hal itu. Mereka tidak lain hanyalah mengikuti dugaan yang hanya berdasar hawa nafsu, dan sesungguhnya dugaan yang tidak didukung kenyataan atau ilmu itu tidak berfaedah sedikit pun terhadap kebenaran. Karena itu, dugaan demikian tidak dapat dijadikan sebagai dasar dalam keyakinan agama. 29. Wahai nabi Muhammad, jika orang-orang musyrik enggan meng-ikuti ajakanmu dan bersikeras menyembah berhala, maka tinggalkanlah orang yang berpaling dari peringatan kami itu, dan ketahuilah bahwa dia hanya mengingini kehidupan dunia yang bersifat sementara seraya menolak kepastian hari akhirat."
  }
]