[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Maka berpalinglah dari orang yang berpaling dari peringatan Kami, yaitu al-Quran, dan dia tidak ingin kecuali kehidupan dunia. Apa yang mereka pegang itu adalah ujung ilmu mereka dan tujuan mereka. Sesungguhnya Tuhanmu lebih tahu tentang siapa yang menyimpang dari jalan petunjuk, sebagaimana Dia jauh lebih tahu tentang siapa yang mendapatkan petunjuk dan mengambil jalan islam. Di sini terkandung peringatan keras terhadap para pendurhaka yang menolak beramal sesuai dengan al-Quran dan Sunnah Rasulullah, yang mendahulukan hawa nafsu dan harta dunia dibanding akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Maka berpalinglah -wahai Rasul- dari orang yang berpaling dari mengingat Allah dan tidak mengindahkannya, dan tidak menginginkan kecuali hanya kehidupan dunia dan dia tidak berbuat untuk Akhiratnya, karena dia tidak mengimaninya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَأَعْرِضْ عَن مَّن تَوَلَّىٰ عَن ذِكْرِنَا (Maka berpalinglah (hai Muhammad) dari orang yang berpaling dari peringatan Kami) Yakni tinggalkanlah orang yang berpaling dari al-Qur’an atau dari peringatan Allah. Janganlah kamu berdebat dengan mereka, sebab kamu telah menyampaikan kepada mereka apa yang diperintahkan kepadamu untuk menyampaikannya, dan kewajibanmu hanya menyampaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Menjauhlah wahai Nabi dari orang yang menjauhi Al-Qur’an atau berdzikir kepada Allah, hindari perdebatan dengannya, sedangkan kamu menyampaikan kepadanya risalah Tuhannya. Kenyataannya dia lebih bahagia dengan dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berpalinglah dari orang yang berpaling dari peringatan Kami dan hanya menginginkan kehidupan dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Mengingat inilah kebiasaan orang-orang tersebut, mereka tidak memiliki tujuan untuk mengikuti kebenaran tapi tujuan dan maksud mereka adalah keinginan hawa nafsu, karena itu, Allah memerintahkan RasulNya agar berpaling dari orang yang berpaling dari mengingat al-Quran, yaitu peringatan yang bijaksana dan al-Quran yang agung serta berita mulia. Berpalinglah dari ilmu yang hanya mencari keduniaan dan inilah puncak keinginannya. Sebagaimana yang diketahui, setiap orang tidak akan mengerjakan sesuatu kecuali untuk sesuatu yang diinginkannya, hanya saja usaha mereka itu hanya terbatas pada dunia dan hawa nafsu keduniaan; bagaimana pun cara mendapatkannya mereka akan menempuh cara itu. Cara apa saja yang bisa mendapatkan keduniaan, mereka langsung memperebutkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 29: 29-30. Allah memerintahkan Nabi-Nya untuk mengingkari mereka orang-orang yang sombong dari keimanan dan dari mengikuti Al Qur’an. Mereka tidak menginginkan untuk berpegang teguh dengan Al Qur’an dengan menyombongkan diri kecuali karena mereka mengikuti syahwat mereka dan berharap atas kepentingan dunia. Ini tujuan dari urusan mereka, dan angan-angan tertinggi mereka. Dan ketahuilah wahai Nabi Allah, bahwasanya Rabbmu Maha Mengetahui siapa yang tersesat dari jalan-Nya dan siapa yang mengikuti hawa nafsunya, dan siapa yang mementingkan dunianya akan akhiratnya. Dialah Allah yang mengetahui petunjuk yang lurus dan benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana yang disebutkan di atas seperti itulah kebiasaan mereka, yakni tidak ada tujuan mereka untuk mengikuti kebenaran, bahkan tujuan mereka hanyalah mengikuti apa yang diingini keinginan mereka, maka Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk berpaling dari orang-orang yang berpaling dari peringatan-Nya; peringatan yang merupakan peringatan yang bijaksana, Al Qur’anul ‘Azhiim dan berita yang mulia. Mereka berpaling dari ilmu yang bermanfaat dan tidak menginginkan selain kehidupan dunia. Inilah kadar atau batas ilmu dan keinginan mereka. Sudah menjadi maklum, bahwa seseorang tidaklah mengerjakan selain yang dia inginkan. Oleh karena yang diinginkan hanyalah kehidupan dunia, maka usaha mereka hanya terbatas pada kehidupan dunia, kenikmatan dan kesenangannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 29",
    "description": "Wahai nabi Muhammad, jika orang-orang musyrik enggan meng-ikuti ajakanmu dan bersikeras menyembah berhala, maka tinggalkanlah orang yang berpaling dari peringatan kami itu, dan ketahuilah bahwa dia hanya mengingini kehidupan dunia yang bersifat sementara seraya menolak kepastian hari akhirat. 30. Itulah, yaitu berpalingnya mereka dari kebenaran dan kecenderungan pada kenikmatan hidup duniawi, kadar ilmu mereka. Sungguh, tuhanmu yang selalu membimbing dan menunjukimu, dia lebih mengetahui siapa yang lebih memilih kekafiran dengan mengikuti potensi fuj'r, sehingga tersesat dari jalan-Nya dan dia pula yang mengetahui siapa di antara manu-sia yang memilih ketaatan dengan selalu mengikuti potensi takwanya sehingga ia selalu mendapat petunjuk ke jalan yang benar dan diridai-Nya."
  }
]