[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "29-30. Maka berpalinglah dari orang yang berpaling dari peringatan Kami, yaitu al-Quran, dan dia tidak ingin kecuali kehidupan dunia. Apa yang mereka pegang itu adalah ujung ilmu mereka dan tujuan mereka. Sesungguhnya Tuhanmu lebih tahu tentang siapa yang menyimpang dari jalan petunjuk, sebagaimana Dia jauh lebih tahu tentang siapa yang mendapatkan petunjuk dan mengambil jalan islam. Di sini terkandung peringatan keras terhadap para pendurhaka yang menolak beramal sesuai dengan al-Quran dan Sunnah Rasulullah, yang mendahulukan hawa nafsu dan harta dunia dibanding akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Hal yang dikatakan oleh orang-orang musyrik itu -yaitu memberi nama malaikat dengan nama-nama perempuan- adalah batas pengetahuan mereka karena mereka adalah orang-orang bodoh, tidak sampai kepada ilmu yang pasti. Sesungguhnya Rabbmu -wahai Rasul- paling mengetahui orang-orang yang melenceng dari jalan kebenaran dan Dia paling mengetahui siapa yang mendapat hidayah ke jalan kebenaran, tidak ada sesuatupun yang luput dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. ذٰلِكَ مَبْلَغُهُم مِّنَ الْعِلْمِ ۚ (Itulah sejauh-jauh pengetahuan mereka) Yakni keinginan mereka terhadap kehidupan dunia semata merupakan ujung pengetahuan mereka. Mereka tidak peduli sama sekali terhadap urusan agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Usaha mengejar dunia dan perhiasannya itu adalah tujuan yang mereka capai dengan pengetahuannya. Sesungguhnya Tuhanmu wahai nabi lebih mengetahui tentang orang yang menyimpang dari agamaNya yang haqq. Allah SWt juga lebih mengetahui orang yang mendapat petunjuk menuju kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah kadar pengetahuan mereka} akhir pengetahuan mereka {Sesungguhnya Tuhanmulah yang lebih mengetahui siapa yang tersesat dari jalanNya dan Dialah yang mengetahui siapa yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Itulah sejauh-jauh pengetahuan mereka,” artinya, itulah puncak dan tujuan ilmu mereka. Sedangkan orang-orang yang beriman terhadap Hari Akhir yang dibenarkan oleh orang-orang yang berakal, maka keinginan mereka tertuju pada negeri akhirat, ilmu mereka adalah ilmu yang paling baik dan mulia, itulah ilmu yang bersumber dari kitab Allah dan Sunnah RasulNya. Allah mengetahui siapa saja yang berhak mendapatkan hidayah sehingga akan diberi petunjuk, Allah juga mengetahui siapa yang tidak berhak mendapatkan hidayah sehingga urusannya akan diserahkan padanya dan akan direndahkan hingga tersesat dari jalan Allah. Karena itulah Allah berfirman, “Sesungguhnya Rabbmu, Dia-lah yang psling mengetahui siapa yang tersesat dari jalanNya dan Dia pulalah yang paling mengetahui siapa yang mendapat petunjuk.” Allah meletakkan karuniaNya pada tempat yang laik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 30: 29-30. Allah memerintahkan Nabi-Nya untuk mengingkari mereka orang-orang yang sombong dari keimanan dan dari mengikuti Al Qur’an. Mereka tidak menginginkan untuk berpegang teguh dengan Al Qur’an dengan menyombongkan diri kecuali karena mereka mengikuti syahwat mereka dan berharap atas kepentingan dunia. Ini tujuan dari urusan mereka, dan angan-angan tertinggi mereka. Dan ketahuilah wahai Nabi Allah, bahwasanya Rabbmu Maha Mengetahui siapa yang tersesat dari jalan-Nya dan siapa yang mengikuti hawa nafsunya, dan siapa yang mementingkan dunianya akan akhiratnya. Dialah Allah yang mengetahui petunjuk yang lurus dan benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni inilah batas ilmu dan tujuan mereka, sehingga mereka lebih mengutamakan dunia daripada akhirat. Adapun orang-orang yang beriman kepada akhirat, maka harapan mereka tertuju kepada akhirat, ilmu mereka adalah ilmu yang paling utama dan paling mulia, yaitu ilmu yang diambil dari Kitabullah dan sunnah Rasul-Nya shallallahu 'alaihi wa sallam, dan Allah Subhaanahu wa Ta'aala mengetahui siapa yang berhak memperoleh hidayah sehingga diberi-Nya hidayah dengan orang yang tidak berhak mendapatkannya sehingga Allah Subhaanahu wa Ta'aala serahkan kepada dirinya sendiri dan menelantarkannya, maka jadilah ia sebagai orang yang tersesat dari jalan Allah. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Sungguh, Tuhanmu, Dia lebih mengetahui siapa yang tersesat dari jalan-Nya dan Dia pula yang lebih mengetahui siapa yang mendapat petunjuk.” Maka Dia meletakkan karunia-Nya ke tempat yang Dia ketahui bahwa ia layak memperolehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 30",
    "description": "Itulah, yaitu berpalingnya mereka dari kebenaran dan kecenderungan pada kenikmatan hidup duniawi, kadar ilmu mereka. Sungguh, tuhanmu yang selalu membimbing dan menunjukimu, dia lebih mengetahui siapa yang lebih memilih kekafiran dengan mengikuti potensi fuj'r, sehingga tersesat dari jalan-Nya dan dia pula yang mengetahui siapa di antara manu-sia yang memilih ketaatan dengan selalu mengikuti potensi takwanya sehingga ia selalu mendapat petunjuk ke jalan yang benar dan diridai-Nya. 31. Menolak anggapan bahwa orang yang sesat dan ingkar itu seolah-olah di luar pengetahuan Allah, ditegaskan bahwa semua sifat kesempurnaan itu ada pada zat-Nya. Dan hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Dia yang menciptakan semua makhluk dan yang mengaturnya sesuai kehendak-Nya. Bisa saja dia membuat semua ma-nusia beriman, tetapi dia tidak menginginkannya karena dia telah membekali mereka dengan akal, petunjuk, dan kebebasan memilih. Dengan demikian, dia akan memberi balasan dan hukuman kepada orang-orang yang berbuat jahat sesuai dengan apa yang telah mereka kerjakan dan dia akan memberi balasan dan anugerah kepada orang-orang yang berbuat baik dengan pahala yang lebih baik, yaitu surga dengan segala kenikmatan dan keindahannya."
  }
]