[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-32. Hanya milik Allah-lah kerajaan langit dan bumi. Allah hendak membalas orang-orang yang berbuat buruk dengan menghukum mereka atas apa yang mereka lakukan dengan keburukan dan membalas orang-orang yang berbuat baik dengan surga. Mereka adalah orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji kecuali lamam, yaitu dosa-dosa kecil yang pelakunya tidak melakukannya terus menerus, atau melakukannya sesekali saja. Dosa kecil seperti ini, apabila pelakunya melakukan kewajiban-kewajban dan meninggalkan larangan-larangan, akan diampuni dan ditutupi oleh Allah bagi pelakunya. Sesungguhnya Tuhanmu Mahaluas ampunanNya, Dia lebih mengetahui tentang keadaan kalian saat Dia menciptakan bapak kalian, yaitu Adam, dari tanah, dan saat kalian dalam bentuk janin di Rahim ibu kalian. Maka jangan menyucikan diri kalian, menyanjung dan memujinya dengan ketakwaan, karena Dia lebih tahu siapa yang menjaga dirinya dari hukumanNYa dari hamba-hambaNya, lalu tidak berbuat maksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan hanya milik Allah sajalah apa yang ada di langit dan milik-Nya apa yang ada di bumi baik dari sisi kekuasaan, penciptaan dan pengaturan, agar Allah membalas orang-orang yang melakukan perbuatan buruk di dunia dengan siksa yang pantas bagi mereka dan membalas orang-orang beriman yang melakukan kebaikan dengan Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31-32. Milik Allah kerajaan yang ada di tujuh langit dan bumi. Dan kesudahan urusan pada hamba, adalah Allah akan membalas hamba yang melakukan keburukan dengan siksa neraka dan dan membalas hamba yang melakukan kebaikan dengan surga. Dan orang-orang baik adalah mereka yang menjauhi dosa-dosa besar dan kejahatan-kejahatan yang mengandung hukuman had; adapun dosa-dosa kecil, maka Allah akan mengampuninya. Allah Maha Luas ampunan-Nya bagi para hamba, dan Dia lebih mengetahui keadaan kalian daripada diri kalian sendiri sebelum kalian diciptakan, ketika kalian masih berupa janin di dalam perut ibu kalian. Maka janganlah kalian memuji diri kalian sendiri, karena Allah lebih mengetahui siapa yang takut dari siksaan-Nya dan mengharap pahala-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. لِيَجْزِىَ الَّذِينَ أَسٰٓـُٔوا۟ بِمَا عَمِلُوا۟ (supaya Dia memberi balasan kepada orang-orang yang berbuat jahat terhadap apa yang telah mereka kerjakan) Yakni kesudahan bagi para makhluk yang terdapat orang baik dan orang jahat adalah Allah akan membalas mereka sesuai dengan amalannya masing-masing. Atau maknanya adalah tinggalkanlah dari orang yang berpaling, sebab Allah akan membalas orang yang berbuat buruk dan orang yang berbuat baik, karena kamu telah menyampaikan risalah yang diberikan kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Milik Allah itu segala yang ada di langit dan Bumi. Dialah yang Maha Pencipta, Maha Merajai lagi Maha Mengatur (apa yang ada) di dalamnya. Konsekuensi yang didapat oleh makhluk, yaitu Allah akan membalas tiap-tiap orang yang berbuat keburukan dan yang berbuat kebaikan sesuai perbuatannya. Bagi rang yang berbuat keburukan yang berdosa itu neraka dan bagi orang baik yang taat itu surga, dan itulah pahala yang baik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah apa yang ada di langit dan yang ada di bumi. Dia akan memberi balasan kepada orang-orang yang berbuat jahat sesuai dengan apa yang telah mereka kerjakan dan Dia akan membalas orang-orang yang berbuat baik dengan yang lebih baik} dengan surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Allah mengabarkan bahwa Dia adalah Pemilik kerajaan, hanya Dia sendiri yang menguasai dunia dan akhirat, semua yang ada di dunia dan di akhirat adalah kepunyaanNya. Allah memberlakukan kepemilikanNYa layaknya Raja Agung memperlakukan budak dan hamba sahayanya. kekuasaanNya berlaku pada mereka, berlaku secara cepat, Allah memerintah dan melarang mereka serta memberi balasan atas apa yang diperintahkan dan apa yang dilarang dari mereka. Allah memberikan pahala bagi orang yang taat dan menyiksa orang yang durhaka. “Dia memberi balasan kepada orang-orang yang berbuat jahat,” yang melakukan amalan-amalan kekufuran dan kemaksiatan-kemaksiatan yang lebih rendah, dan karena mereka mengerjakan amalan-amalan buruk, maka mereka mendapatkan siksaan yang mengerikan, “dan memberi balasan kepada orang-orang yang berbuat baik,” berupa ibadah kepada Allah dan berbuat baik terhadap makhluk Allah dengan berbagai tindakan yang membawa manfaat, “dengan pahala yang lebih baik,” yaitu dengan kondisi yang lebih baik di dunia dan di akhirat, di mana yang terbesar dan paling mulia adalah keridhaan Rabb mereka serta meraih surga dan segala kenikmatan yang ada di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 31: Allah menjelaskan akan apa yang menunjukkan atas kerajaan-Nya atas segala sesuatu, Allah berkata : Allah sajalah Raja bagi apa yang ada di langit dan di bumi; Dia akan membalas pada hari kiamat bagi mereka yang buruk amalannya yang berhak untuk diadzab, dan membalas bagi mereka yang berhak untuk mendapatkan surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia Pemilik kerajaan, Dia sendiri yang memiliki dunia dan akhirat, dan bahwa semua yang ada di langit maupun di bumi adalah milik Allah, Dia bertindak kepada yang ada di sana seperti tindakan Raja Yang Agung kepada hamba dan milik-Nya, Dia memberlakukan padanya qadar-Nya, memberlakukan syariat-Nya, memerintah dan melarang dan akan memberikan balasan terhadap apa yang diperintah-Nya dan apa yang dilarang-Nya, Dia akan memberi balasan kepada orang yang taat dan menghukum orang yang bermaksiat, Dia akan memberikan balasan kepada orang yang yang berbuat jahat seperti berbuat kekafiran dan kemaksiatan yang berada di bawahnya sesuai kejahatan yang mereka kerjakan dengan hukuman yang besar. Yakni berbuat ihsan dalam beribadah kepada Allah dan berbuat baik kepada makhluk Allah dengan memberikan berbagai manfaat. Syaikh As Sa’diy menafsirkan Al Husnaa dengan keadaan yang baik di dunia dan akhirat, dan yang paling besarnya adalah mendapatkan keridhaan Allah serta memperoleh surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 31",
    "description": "Menolak anggapan bahwa orang yang sesat dan ingkar itu seolah-olah di luar pengetahuan Allah, ditegaskan bahwa semua sifat kesempurnaan itu ada pada zat-Nya. Dan hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Dia yang menciptakan semua makhluk dan yang mengaturnya sesuai kehendak-Nya. Bisa saja dia membuat semua ma-nusia beriman, tetapi dia tidak menginginkannya karena dia telah membekali mereka dengan akal, petunjuk, dan kebebasan memilih. Dengan demikian, dia akan memberi balasan dan hukuman kepada orang-orang yang berbuat jahat sesuai dengan apa yang telah mereka kerjakan dan dia akan memberi balasan dan anugerah kepada orang-orang yang berbuat baik dengan pahala yang lebih baik, yaitu surga dengan segala kenikmatan dan keindahannya. 32. Orang-orang yang akan mendapat anugerah dan kebaikan adalah mereka yang sungguh-sungguh menjauhi dosa-dosa besar yang disebut secara khusus ancamannya, dan perbuatan keji yang dicela oleh akal dan tabiat manusia. Semua itu ada hukumannya, kecuali kesalahan-kesalahan kecil yang dilakukan sesekali dan tanpa sengaja. Sungguh, pengampunan atas dosa kecil itu karena tuhanmu mahaluas ampunan-Nya. Dia pun akan mengampuni dosa besar bila pelakunya bertobat dengan tulus. Janganlah kamu bangga karena telah berbuat baik. Sesungguhnya dia mengetahui tentang keadaan kamu, bahkan sejak dia menjadikan kamu dari tanah lalu ketika kamu masih janin dalam perut ibumu yang berproses sesuai tahapannya. Maka dengan pengampunan dan pahala itu, janganlah kamu menganggap dirimu suci dengan memuji diri dan membanggakan amal-amalmu. Sungguh, dia yang paling mengetahui tentang orang yang bertakwa dan benar-benar suci."
  }
]