[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31-32. Hanya milik Allah-lah kerajaan langit dan bumi. Allah hendak membalas orang-orang yang berbuat buruk dengan menghukum mereka atas apa yang mereka lakukan dengan keburukan dan membalas orang-orang yang berbuat baik dengan surga. Mereka adalah orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji kecuali lamam, yaitu dosa-dosa kecil yang pelakunya tidak melakukannya terus menerus, atau melakukannya sesekali saja. Dosa kecil seperti ini, apabila pelakunya melakukan kewajiban-kewajban dan meninggalkan larangan-larangan, akan diampuni dan ditutupi oleh Allah bagi pelakunya. Sesungguhnya Tuhanmu Mahaluas ampunanNya, Dia lebih mengetahui tentang keadaan kalian saat Dia menciptakan bapak kalian, yaitu Adam, dari tanah, dan saat kalian dalam bentuk janin di Rahim ibu kalian. Maka jangan menyucikan diri kalian, menyanjung dan memujinya dengan ketakwaan, karena Dia lebih tahu siapa yang menjaga dirinya dari hukumanNYa dari hamba-hambaNya, lalu tidak berbuat maksiat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Yaitu orang-orang yang menjauhi dosa-dosa besar dan maksiat-maksiat yang buruk kecuali dosa-dosa kecil, karena yang ini diampuni dengan meninggalkan dosa-dosa besar dan memperbanyak ketaatan. Sesungguhnya Rabbmu -wahai Rasul- Maha luas ampunan-Nya, Dia mengampuni dosa hamba-hamba-Nya saat mereka bertobat darinya dan Dia -Subḥānahu- paling mengerti kondisi kalian dan keadaan kalian saat menciptakan bapak kalian, Adam dari tanah, dan saat kalian berada di perut ibu-ibu kalian, diciptakan dari satu bentuk ke bentuk lain, tidak ada sesuatu pun dari itu yang luput dari Allah. Maka janganlah kalian menganggap diri kalian suci dengan memuji dirinya dan memuji ketakwaannya, karena Allah-lah yang paling mengetahui siapa yang paling bertakwa kepada-Nya dengan menjalankan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. الَّذِينَ يَجْتَنِبُونَ كَبٰٓئِرَ الْإِثْمِ (orang-orang yang menjauhi dosa-dosa besar) Yakni orang-orang yang berbuat baik adalah orang-orang yang menjauhi dosa-dosa besar. Dan dosa besar adalah segala dosa yang diancamkan neraka bagi pelakunya. وَالْفَوٰحِشَ(dan perbuatan keji) Seperti zina dan kemusyrikan. Pendapat lain mengatakan bahwa dosa besar adalah segala dosa yang diancamkan neraka bagi pelakunya, sedangkan perbuatan keji adalah segala dosa yang terdapat hukuman had bagi pelakunya. إِلَّا اللَّمَمَ ۚ( yang selain dari kesalahan-kesalahan kecil) Yakni dosa-dosa kecil. Terdapat pendapat mengatakan, yang dimaksud adalah dosa yang lebih ringan dari zina, seperti mencium, melirik, dan melihat. إِنَّ رَبَّكَ وٰسِعُ الْمَغْفِرَةِ ۚ( Sesungguhnya Tuhanmu maha luas ampunan-Nya) Yakni dosa-dosa kecil itu meski tidak termasuk dosa yang diancam dengan neraka, namun tetap saja merupakan dosa. Namun Allah akan mengampuninya dan menghapusnya dengan keluasan rahmat dan ampunan-Nya, selama pelakunya menghindari dosa-dosa besar. هُوَ أَعْلَمُ بِكُمْ إِذْ أَنشَأَكُم مِّنَ الْأَرْضِ(Dan Dia lebih mengetahui (tentang keadaan)mu ketika Dia menjadikan kamu dari tanah) Yakni Allah menciptakan kalian dari tanah dalam cakupan penciptaan bapak kalian, Adam; karena Allah menciptakannya dari tanah, sehingga Allah mengetahui asal penciptaan kalian. وَإِذْ أَنتُمْ أَجِنَّةٌ(dan ketika kamu masih janin) Yakni Allah juga lebih mengetahui keadaan kalian ketika kalian masih berupa janin. Dan janin adalah anak yang masih ada di dalam perut. فِى بُطُونِ أُمَّهٰتِكُمْ ۖ( dalam perut ibumu) Yakni ketika itu Allah telah mengetahui bahwa kalian pasti akan melakukan dosa-dosa kecil. فَلَا تُزَكُّوٓا۟ أَنفُسَكُمْ ۖ( maka janganlah kamu mengatakan dirimu suci) Yakni janganlah kalian mengaku suci dari dosa-dosa, dan janganlah kalian memuji diri kalian bahwa kalian dapat perlepas diri dari dosa-dosa bahkan dari dosa-dosa kecil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Orang-orang baik tersebut adalah orang-orang yang menjauhi dosa-dosa besar, yaitu setiap dosa yang dijanjikan oleh Allah balasan neraka, seperti syirik, menjauhi perbuatan-perbuatan keji, yaitu setiap dosa akibat melanggar batas-batas hukum Allah, seperti pembunuhan yang disengaja, perzinaan, pencemaran nama baik, perampokan, dan minum minuman keras, kecuali dosa sepintas, yaitu dosa-dosa kecil seperti cium (jauh), kedipan mata, dan melihat sesuatu yang haram. Kesalahan-kesalahan kecil itu diampuni oleh Allah. Sesungguhnya Tuhanmu itu Maha Pengampun dosa-dosa, Dzat yang paling mengetahui kalian dan keadaan kalian ketika menciptakan kalian dari tanah bumi dalam penciptaan leluhur kalian, Adam dan ketika kalian berupa janin dalam rahim-rahim ibu, -Al-Janin adalah anak yang masih dalam kandungan ibunya- Maka jaganlah kalian memuji diri kalian sendiri dan beranggapan sebagai orang paling suci dari dosa. Dialah Dzat yang paling mengetahui orang yang menunaikan perintah-perintahnya dan menjauhi kemaksiatan. Al-Wahidi, Ath-Thabrani dan lainnya dari Tsabit bin Harits berkata: “Kaum Yahudi berkata saat gagal mendapatkan anak: ”dia jujur”, kemudian Nabi SAW tiba dan bersabda: “Yahudi itu telah berdusta, tidak ada satupun makhluk yang diciptakan oleh Allah dalam kandungan ibunya kecuali dia hanya tahu bahwa dia merasa sedih atau senang” kemudian Allah menurunkan ayat ini saat peristiwa itu {Huwa A’lamu …..}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) orang-orang yang menjauhi dosa-dosa besar dan perbuatan keji} hal-hal buruk dari kemaksiatan {kecuali hanya melakukan dosa-dosa kecil} dosa-dosa kecil {Sesungguhnya Tuhanmu Maha luas ampunanNya. Dia lebih mengetahui kalian sejak Dia menciptakan kalian dari tanah dan ketika kalian berupa janin dalam perut ibu kalian. Maka janganlah menganggap suci diri kalian} maka janganlah terlalu memuji dan menyanjung diri kalian dengan ketakwaan {Dia lebih mengetahui siapa saja yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Kemudian Allah menyebutkan sifat-sifat mereka seraya berfirman, “(Yaitu) orang yang menjauhi dosa-dosa besar dan perbuatan keji,” yakni mereka mengerjakan perintah Allah berupa berbagai kewajiban yang jika ditinggalkan termasuk dosa besar, dan mereka menjauhi keharaman besar seperti zina, minum minuman keras, memakan hasil riba, membunuh dan dosa-dosa besar lainnya, “yang selain dari kesalahan-kesalahan kecil,” yakni, dosa-dosa kecil yang tidak dilakukan secara terus menerus atau dosa kecil yang dicela oleh yang bersangkutan secara berkali-kali, dengan catatan jarang dan sedikit. Melakukan hal itu tidak serta merta membuat pelakunya termasuk dalam golongan orang-orang yang keluar dari golongan orang-orang yang berbuat baik, karena melaksanakan kewajiban dan menjauhi keharaman itu berada di bawah ampunan Allah yang meliputi segala sesuatu, karena itulah Allah berfirman, “SEsungguhnya Rabbmu Mahaluas ampunanNya.” Andai bukan karena ampunanNya, maka seluruh negeri dan manusia akan binasa, andai bukan pemaafan dan kesabaranNya, tentu langit akan runtuh menimpa bumi dan tentu Dia tidak membiarkan satu hewan pun hidup. Allah berfirman, “Dan Dia lebih mengetahui (tentang keadaan) mu ketika Dia menjadikan kamu dari tanah dan ketika kamu masih janin dalam perut ibumu.” Artinya, Allah mengetahui semua kondisi kalian serta kelemahan yang dijadikan pada diri kalian dan sifat penentangan terhadap berbagai perintah Allah pada kalian, karena banyaknya faktor pendorong untuk berbuat berbagai hal-hal haram serta banyaknya faktor penarik untuk itu, serta tidak adanya penghalang yang kuat. Kelemahan itu jelas ada dan terlihat pada diri kalian ketika kalian dikeluarkan oleh Allah dari perut bumi dan ketika kalian berada di perut ibu kalian, sifat lemah itu tetap saja ada pada diri kalian meski Allah telah memberikan kalian kekuatan untuk menunaikan perintahNya, namun sifat lemah tetap saja lekat pada diri kalian meski Allah telah memberikan kalian kekuatan untuk menunaikan perintahNya, namun sifat lemah tetap saja lekat pada diri kalian. Karena Allah mengetahui kondisi kalian seperti ini, sesuailah hikmah ilahi dan kemurahan rabbani untuk meliputi kalian dengan rahmat dan ampunan dan kebaikanNya. Allah melenyapkan berbagai kejahatan dan dosa dari diri kalian khususnya bagi seorang hamba yang bertujuan mencari keridhaanNYa di seluruh waktunya dan seluruh usahanya yang mendekatkannya kepada Rabb di seluruh waktu, melarikan diri dari dosa yang bisa membawa murka Rabb kemudian terlepas darinya sedikit demi sedikit, karena Allah Yang paling Mulia, paling menyayangi para hambaNYa melebihi kasih sayang seorang ayah terhadap anaknya. Karena itu orang seperti ini pasti berada dekat ampunan Rabbnya dan Allah akan senantiasa mengabulkan permintaannya di setiap waktu. Karena itulah Allah berfirman, “Maka janganlah kamu mengatakan dirimu suci,” artinya kalian menceritakan kesucian diri kalian kepada orang-orang dengan maksud memuji diri kalian sendiri di hadapan mereka, “Dia-lah Yang paling mengetahui tentang orang yang bertakwa,” karena takwa itu bertempat di hati dan Allah lah yang mengetahuinya serta membalas kebaikan dan ketakwaan yang ada dalam hati, sedangkan manusia sama sekali tidak berguna bagi kalian dari siksaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 32: Allah menjelaskan di antara sifat-sifat mereka mereka yang baik amalannya, bahwasanya mereka : Menyingkirkan dan menjauhi dari dosa-dosa besar dan maksiat, dan menjauhi dari keburukan semisal zina dan selainnya. Kemudian Allah mengecualikan mereka yang terjatuh ke dalam dosa kecil yang pelakunya tidak terus menerus melakukan dosa tersebut, atau melakukan dosa kecil tersebut sekali atau dua kali, yang jarang dan sedikit; Maka dengan kondisinya yang demikian seorang hamba tidak keluar dari golongan orang-orang yang ikhlas. Maka barangsiapa yang melakukan kewajibannya dengan meninggalkan dosa tersebut dan meninggalkan dosa-dosa besar dan keburukan yang haram maka semuanya tergantung dari ampunan Allah yang Maha Luas atas segala sesuatu. Dialah Allah yang Maha Mengetahui kalian dan kondisi kalian, yang Dialah pencipta bapak kalian yang berasal dari tanah. Dialah yang Maha Mengetahui kalian dan kondisi kalian sewaktu di dalam perut-perut ibu-ibu kalian, yang kemudian kalian dilahirkan dengan sebab Allah Maha Melihat keadaan, ucapan dan perbuatan kalian, maka janganlah kalian memuji diri-diri kalian sendiri, dan janganlah mensucikan diri-diri kalian di hadapan manusia dan menampakkan zakat-zakat kalian atas dasar ingin pujian. Sungguh Allah Maha Tahu siapa yang bertakwa dan menjauhi maksiat. Pada ayat ini tahdzir atas sombong dengan amalan, ganjaran dan nasab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sifat mereka yang berbuat baik itu. Yaitu mereka yang mengerjakan perintah-perintah Allah berupa yang wajib-wajib, dimana meninggalkannya termasuk dosa besar, dan mereka meninggalkan dosa-dosa besar. Dosa besar adalah perbuatan yang dilarang Allah dan Rasul-Nya, di mana perbuatan tersebut ada hadnya (hukumannya) di dunia, atau adanya ancaman berupa azab dan kemurkaan di akhirat atau adanya laknat terhadap pelakunya. Contoh dosa besar adalah zina, meminum minuman keras, memakan riba, membunuh, dsb. Pengecualian di sini adalah istitsna’ munqathi’ yang berarti “tetapi”, maksudnya tetapi dosa-dosa kecil, Dia ampuni karena mereka menjauhi dosa-dosa besar. Rasulullah shallallahu 'alaihi wa sallam bersabda: « الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ مَا بَيْنَهُنَّ إِذَا اجْتَنَبَ الْكَبَائِرَ » . “Shalat yang lima waktu, shalat Jum’at yang satu ke shalat Jum’at berikutnya dan puasa Ramadhan yang satu ke puasa Ramadhan yang selanjutnya menghapuskan dosa-dosa yang ada di antara keduanya apabila ia menjauhi dosa-dosa besar.” (HR. Muslim) Tentunya dosa-dosa kecil ini tidak dilakukan terus menerus karena laa shaghiirata ma’al istimraar (bukan dosa kecil kalau dilakukan terus menerus), tetapi ia lakukan sesekali atau jarang-jarang dan sedikit. Dosa-dosa kecil seperti ini tidak mengeluarkan seseorang dari tergolong sebagai orang-orang yang berbuat baik, karena dosa-dosa kecil ini bersamaan dengan mengerjakan kewajiban dan menjauhi larangan berada di bawah ampunan Allah yang meliputi segala sesuatu. Faedah: Dosa kecil bisa menjadi besar apabila dilakukan terus-menerus, meremehkannya, bangga dalam mengerjakannya ataupun terang-terangan melakukannya. Kalau tidak ada ampunan-Nya tentu negeri dan hamba akan binasa, kalau tidak ada maaf-Nya dan santun-Nya tentu langit jatuh menimpa bumi dan tentu tidak ada lagi makhluk bergerak yang hidup di bumi. Yakni bapak kamu (Adam). Allah Subhaanahu wa Ta'aala lebih mengetahui keadaan kamu semua dan keadaan ketika kamu diciptakan-Nya seperti sifat lemah dan loyo untuk melaksanakan perintah Allah, banyaknya pendorong untuk mengerjakan sebagian perkara yang diharamkan dan tidak ada penghalang yang kuat untuk menghalangimu melakukan larangan-Nya. Kelemahan ada dan terlihat pada dirimu ketika Dia menciptakan kamu dari tanah dan ketika kamu berada dalam perut ibumu, dan hal itu tetap terus ada pada dirimu meskipun Allah Subhaanahu wa Ta'aala telah mewujudkan kekuatan pada dirimu untuk melaksanakan perintah-Nya, tetapi kelemahan itu senantiasa ada pada dirimu. Oleh karena pengetahuan-Nya terhadap keadaanmu ini, maka tepat sekali kebijaksanaan-Nya dan kemurahan-Nya Dia melimpahkan rahmat-Nya, ampunan-Nya, dan maaf-Nya, melimpahkan kepada kamu ihsan-Nya serta menyingkirkan berbagai dosa, terlebih jika seorang hamba maksud atau tujuannya adalah mencari keridhaan Allah Subhaanahu wa Ta'aala di setiap waktu, berusaha mendekatkan diri kepada-Nya di setiap saat, berlari dari dosa lalu kemudian terjatuh ke dalam kesalahan, maka Allah Subhaanahu wa Ta'aala Dialah Tuhan Yang Paling Pemurah dan Paling Penyayang, Dia lebih sayang kepada hamba-Nya daripada seorang ibu kepada anaknya. Oleh karena itu, hal semisal ini dekat dengan ampunan Tuhannya dan Allah Subhaanahu wa Ta'aala akan memenuhinya dalam semua keadaannya. Yakni jangan kamu puji dirimu karena ujub (berbangga diri), adapun dengan maksud mengakui nikmat, maka hal itu adalah baik. Atau maksudnya, jangan kamu beritahukan kepada manusia kebersihan dirimu dengan cara memujinya. Hal itu, karena takwa tempatnya di hati. Allah yang mengetaui isi hati yang akan memberikan balasan terhadap apa yang ada di dalamnya baik atau buruk, adapun manusia tidaklah berguna bagimu sedikit pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 32",
    "description": "Orang-orang yang akan mendapat anugerah dan kebaikan adalah mereka yang sungguh-sungguh menjauhi dosa-dosa besar yang disebut secara khusus ancamannya, dan perbuatan keji yang dicela oleh akal dan tabiat manusia. Semua itu ada hukumannya, kecuali kesalahan-kesalahan kecil yang dilakukan sesekali dan tanpa sengaja. Sungguh, pengampunan atas dosa kecil itu karena tuhanmu mahaluas ampunan-Nya. Dia pun akan mengampuni dosa besar bila pelakunya bertobat dengan tulus. Janganlah kamu bangga karena telah berbuat baik. Sesungguhnya dia mengetahui tentang keadaan kamu, bahkan sejak dia menjadikan kamu dari tanah lalu ketika kamu masih janin dalam perut ibumu yang berproses sesuai tahapannya. Maka dengan pengampunan dan pahala itu, janganlah kamu menganggap dirimu suci dengan memuji diri dan membanggakan amal-amalmu. Sungguh, dia yang paling mengetahui tentang orang yang bertakwa dan benar-benar suci. 33. Dalam sebuah riwayat disebutkan bahwa al-wal'd bin al-Mug'rah yang telah memeluk islam kembali murtad akibat celaan teman-teman-Nya ajakan mereka untuk kembali pada kemusyrikan. Wahai nabi Muhammad, maka tidakkah engkau melihat orang yang berpaling dan menolak ajaran yang engkau sampaikan padahal sebelum itu dia telah menerimanya'."
  }
]