[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-34. Tidakkah kamu (wahai Rasul) memperhatikan orang yang berpaling dari ketaatan kepada Allah dan Dia hanya memberi sedikit dari hartanya, kemudian menghentikan pemberian dan kebaikannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Maka apakah kamu melihat keburukan orang yang berpaling dari Islam setelah ia dekat darinya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-37. Hai Rasulullah, apakah kamu melihat betapa buruknya orang yang diperintahkan untuk menyembah Tuhannya namun dia enggan melakukannya, dan hanya menginfakkan sedikit hartanya kemudian dia tidak lagi berinfak karena kebakhilan dan keengganannya? Apakah dia memiliki ilmu ghaib sehingga dapat mengetahui dengan pasti bahwa yang dia lakukan itu benar? Ataukah dia belum pernah mendengar perkara-perkara besar yang ada dalam Taurat yang diturunkan kepada Musa, dan dalam suhuf Ibrahim yang senantiasa menunaikan perintah-perintah Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. أَفَرَءَيْتَ الَّذِى تَوَلَّىٰ (Maka apakah kamu melihat orang yang berpaling (dari Al-Quran)?) Yakni berpaling dari kebaikan dan enggan mengikuti kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Kabarkanlah kepadaku wahai nabi tentang orang yang menolak mengikuti kebenaran dan Islam usai dia bingung tentang apa yang dia ikuti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah kamu tidak melihat orang yang berpaling} berpaling dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Alah berfirman bahwa apakah engkau mengetahui kondisi orang yang diperintah untuk menyembah Rabbnya dan mengesakanNya kemudian berpaling darinya? Meski jiwanya mengizinkan pada sebagian hal kecil, tapi hal itu tidak berlangsung lama, ia akan bersifat bakhil dan menahan hartanya. Kebaikan bukanlah sifat dan wataknya, tapi wataknya adalah berpaling dari ketaatan dan tidak tetap dalam mengerjakan kebaikan. Meski demikian, ia mengatakan bahwa dirinya bersih dan menempatkan dirinya pada posisi yang tidak sesuai dengan yang disebutkan Allah, “Apakah dia mempunyai pengetahuan tentang yang ghaib sehingga dia mengetahui (apa yang dikatakan),” apakah ia mengetahui hal ghaib sehingga bisa memberitahukannya? Atau apakah itu hanya perkataan yang diada-adakan atas (nama) Allah dengan sembrono yang merangkum dua hal terlarang, yaitu menjelek-jelekkan diri dan menyuci-sucikan diri sebagaimana yang terjadi, karena ia sendiri mengetahui bahwa ia tidak mempunyai pengetahuan tentang hal ghaib. Andai pun ia mampu mengaku-aku hal itu, maka pemberitahuan ghaib yang berada di tangan Rasulullah, al-Ma’shum, menunjukkan hal sebaliknya dan itulah bukti atas kebatilan pengakuannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 33: 33-34. Apakah engkau melihat wahai Nabi Allah keadaan yang sungguh mengherankan bagi siapa yang menolak dari islam dan yang dia memberi namun dalam jumlah yang sedikit dari hartanya, kemudian berhenti dari memberi dan terputus dari kebaikan yang ditujukan bagi orang-orang fakir ? Manusia itulah yang berjalan kemudian bertemu dengan tanah yang tandus, atau tanah bebatuan dan kemudian berhenti dari perjalanannya. Maksudnya di sini adalah Al Walid bin Mughirah, dimana ia berpikiri tentang islam dan tahu bahwasanya islam adalah agama yang benar, namun kemudian dia justru memuji kekafirannya dan berkata : Apakah engkau akan meninggalkan para pembesar-pembesar pendahulumu ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidakkah engkau melihat buruknya keadaan orang yang diperintahkan beribadah kepada Tuhannya dan mentauhidkan-Nya tetapi dia malah berpaling dari itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 33",
    "description": "Dalam sebuah riwayat disebutkan bahwa al-wal'd bin al-Mug'rah yang telah memeluk islam kembali murtad akibat celaan teman-teman-Nya ajakan mereka untuk kembali pada kemusyrikan. Wahai nabi Muhammad, maka tidakkah engkau melihat orang yang berpaling dan menolak ajaran yang engkau sampaikan padahal sebelum itu dia telah menerimanya'34. Orang yang berpaling itu juga bersifat tercela, dan dia memberikan sedikit dari apa yang dijanjikan, lalu menahan sisanya dan tidak mau memberi lagi."
  }
]