[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-34. Tidakkah kamu (wahai Rasul) memperhatikan orang yang berpaling dari ketaatan kepada Allah dan Dia hanya memberi sedikit dari hartanya, kemudian menghentikan pemberian dan kebaikannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan memberikan sedikit dari hartanya kemudian ia menahannya? Karena sifat kikir telah menjadi tabiatnya, meski demikian ia menganggap dirinya suci."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَأَكْدَىٰٓ (dan tidak mau memberi lagi?) Dikatakan (أكدى الرجل) jika seseorang sangat sedikit kebaikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Orang yang memberi sedikit dari hartanya, lalu memutus dan mencukupkan pemberian itu. Kalimat itu sebagai sindiran untuk berhentinya suatu pemberian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia memberikan sedikit, lalu menahan sisanya} tidak mau memberi karena kikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Alah berfirman bahwa apakah engkau mengetahui kondisi orang yang diperintah untuk menyembah Rabbnya dan mengesakanNya kemudian berpaling darinya? Meski jiwanya mengizinkan pada sebagian hal kecil, tapi hal itu tidak berlangsung lama, ia akan bersifat bakhil dan menahan hartanya. Kebaikan bukanlah sifat dan wataknya, tapi wataknya adalah berpaling dari ketaatan dan tidak tetap dalam mengerjakan kebaikan. Meski demikian, ia mengatakan bahwa dirinya bersih dan menempatkan dirinya pada posisi yang tidak sesuai dengan yang disebutkan Allah, “Apakah dia mempunyai pengetahuan tentang yang ghaib sehingga dia mengetahui (apa yang dikatakan),” apakah ia mengetahui hal ghaib sehingga bisa memberitahukannya? Atau apakah itu hanya perkataan yang diada-adakan atas (nama) Allah dengan sembrono yang merangkum dua hal terlarang, yaitu menjelek-jelekkan diri dan menyuci-sucikan diri sebagaimana yang terjadi, karena ia sendiri mengetahui bahwa ia tidak mempunyai pengetahuan tentang hal ghaib. Andai pun ia mampu mengaku-aku hal itu, maka pemberitahuan ghaib yang berada di tangan Rasulullah, al-Ma’shum, menunjukkan hal sebaliknya dan itulah bukti atas kebatilan pengakuannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 34: 33-34. Apakah engkau melihat wahai Nabi Allah keadaan yang sungguh mengherankan bagi siapa yang menolak dari islam dan yang dia memberi namun dalam jumlah yang sedikit dari hartanya, kemudian berhenti dari memberi dan terputus dari kebaikan yang ditujukan bagi orang-orang fakir ? Manusia itulah yang berjalan kemudian bertemu dengan tanah yang tandus, atau tanah bebatuan dan kemudian berhenti dari perjalanannya. Maksudnya di sini adalah Al Walid bin Mughirah, dimana ia berpikiri tentang islam dan tahu bahwasanya islam adalah agama yang benar, namun kemudian dia justru memuji kekafirannya dan berkata : Apakah engkau akan meninggalkan para pembesar-pembesar pendahulumu ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jika dia melapangkan dirinya untuk sesuatu yang sedikit, namun keadaannya tidak selalu demikian, bahkan setelahnya ia akan bakhil kembali. Kebaikan tidak menjadi tabiatnya, bahkan tabiatnya berpaling dari ketaatan, tidak tetap di atas perkara ma’ruf, namun ia malah mentazkiyah (menganggap bersih) dirinya dan menempatkan dirinya pada tempat yang Allah tidak tempatkan padanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 34",
    "description": "Orang yang berpaling itu juga bersifat tercela, dan dia memberikan sedikit dari apa yang dijanjikan, lalu menahan sisanya dan tidak mau memberi lagi. 35. Apakah dia merasa bahwa hanya dia yang mempunyai ilmu tentang yang gaib sehingga dia dapat melihat dan mengetahui kemaslahatan dan apa yang mendorongnya untuk berpaling dari kebenaran dan kikir dalam bersedekah'."
  }
]