[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang menghentikan kebaikannya ini punya ilmu ghaib bahwa apa yang ada ditangannya akan habis sehingga dia menghentikan kebaikannya, di mana dia melihatnya dengan mata kepalanya? sama sekali tidak demikian, karena dia menahan dirinya dari bersedekah serta tidak memberikan harta dan kebaikannya, adalah hanya karena bakhil dan kikir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Apakah di sisinya ada ilmu tentang yang gaib lalu dia melihat dan berbicara tentang yang gaib itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَعِندَهُۥ عِلْمُ الْغَيْبِ فَهُوَ يَرَىٰٓ (Apakah dia mempunyai pengetahuan tentang yang ghaib, sehingga dia mengetahui (apa yang dikatakan)?) Yakni apakah pada orang yang memiliki sedikit kebaikan itu terdapat ilmu tentang hal yang ghaib, yaitu tentang azab?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Apakah dia memiliki pengetahuan tentang sesuatu yang ghaib, sehingga dia dapat meminta orang selainnya (sahabatnya) memikul azab akhirat? Dia adalah Walid bin Mughirah dan sahabat-sahabatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah dia mempunyai pengetahuan tentang yang ghaib, sehingga dia dapat melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Alah berfirman bahwa apakah engkau mengetahui kondisi orang yang diperintah untuk menyembah Rabbnya dan mengesakanNya kemudian berpaling darinya? Meski jiwanya mengizinkan pada sebagian hal kecil, tapi hal itu tidak berlangsung lama, ia akan bersifat bakhil dan menahan hartanya. Kebaikan bukanlah sifat dan wataknya, tapi wataknya adalah berpaling dari ketaatan dan tidak tetap dalam mengerjakan kebaikan. Meski demikian, ia mengatakan bahwa dirinya bersih dan menempatkan dirinya pada posisi yang tidak sesuai dengan yang disebutkan Allah, “Apakah dia mempunyai pengetahuan tentang yang ghaib sehingga dia mengetahui (apa yang dikatakan),” apakah ia mengetahui hal ghaib sehingga bisa memberitahukannya? Atau apakah itu hanya perkataan yang diada-adakan atas (nama) Allah dengan sembrono yang merangkum dua hal terlarang, yaitu menjelek-jelekkan diri dan menyuci-sucikan diri sebagaimana yang terjadi, karena ia sendiri mengetahui bahwa ia tidak mempunyai pengetahuan tentang hal ghaib. Andai pun ia mampu mengaku-aku hal itu, maka pemberitahuan ghaib yang berada di tangan Rasulullah, al-Ma’shum, menunjukkan hal sebaliknya dan itulah bukti atas kebatilan pengakuannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 35: Kemudian Allah berkata : Apakah ditampakkan kepada manusia ini, (yang dia menahan dari berinfak) atas ilmu ghaib sehingga mengetahui apa yang di tangannya sehingga tidak bersedia lagi untuk berinfak, dan apakah dia mengetahui bahwa selain dirinya telah mendapatkan adzab ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga dia menyangka, bahwa ada orang lain yang memikul azab yang ditanggungnya. Atau maksudnya, apakah ia mengetahui yang gaib, lalu dia memberitahukannya atau dia berkata mengada-ada terhadap Allah, bersikap berani dengan menggabung antara bersikap buruk dan mentazkiyah dirinya. Sudah menjadi maklum, bahwa dia tidak memiliki pengetahuan terhadap yang gaib, dan bahwa jika ia mengaku mengetahuinya, tetapi berita-berita yang qath’i yang termasuk perkara gaib yang diberitahukan kepada Nabi shallallahu 'alaihi wa sallam ternyata tidak seperti yang dinyatakannya, dan hal ini menunjukkan kebatilannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 35",
    "description": "Apakah dia merasa bahwa hanya dia yang mempunyai ilmu tentang yang gaib sehingga dia dapat melihat dan mengetahui kemaslahatan dan apa yang mendorongnya untuk berpaling dari kebenaran dan kikir dalam bersedekah'36-37. Ingkar dan kikir merupakan sifat tercela dan dia telah mendapat tuntunan untuk menghindarinya. Apakah dia memang ingkar ataukah belum diberitakan kepadanya apa yang ada dalam lembaran-lembaran kitab suci yang diwahyukan kepada nabi musa' dan apakah dia juga mengingkari tuntunan wahyu yang terdapat pada lembaran-lembaran yang diwahyukan kepada nabi ibrahim yang selalu menyempurnakan janji kepada Allah'."
  }
]