[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Apakah dia belum memberi tahu tentang apa yang ada pada lembaran-lembaran Taurat dan shuhuf Ibrahim yang memenuhi apa yang diperintahkan kepadanya dan menyampaikannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Ataukah dia hanya mengada-ada atas nama Allah? Ataukah orang yang mengada-ada atas nama Allah ini belum diberitahu apa yang ada pada lembaran-lembaran pertama yang diturunkan kepada Musa,"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Ataukah belum dikabarkan (kepadanya) apa yang ada dalam lembaran-lembaran Taurat, yang terpilih untuk didekati dan dipelajari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah belum diberitakan} belum dikabarkan {kepadanya apa yang ada dalam lembaran-lembaran Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. “Ataukah belum diberitakan” kepada orang yang mengaku itu, “apa yang ada dalam lembaran-lembaran Ibrahim yang selalu menyempurnakan janji,” yakni, menunaikan semua ujian yang dibebankan Allah kepadanya serta perintah-perintah syariat, pokok, dan cabang Agama."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 36: 36-37. Allah berkata : Apakah belum sampai kabar orang yang menyeru dengan apa yang ada di dalam Taurat yang diturunkan Allah kepada musa, atau dengan apa yang datang dari lembaran-lembaran Ibrahim yang sempurna atas perintah Allah ?!!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada orang yang mengaku itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 36",
    "description": "36-37. Ingkar dan kikir merupakan sifat tercela dan dia telah mendapat tuntunan untuk menghindarinya. Apakah dia memang ingkar ataukah belum diberitakan kepadanya apa yang ada dalam lembaran-lembaran kitab suci yang diwahyukan kepada nabi musa' dan apakah dia juga mengingkari tuntunan wahyu yang terdapat pada lembaran-lembaran yang diwahyukan kepada nabi ibrahim yang selalu menyempurnakan janji kepada Allah'36-37"
  }
]