[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Yaitu bahwa seseorang tidak dihukum karena dosa orang lain, dan dosa seseorang tidak dipikul oleh orang lain. Seseorang tidak mendapatkan pahala kecuali apa yang diusahakannya untuk dirinya sesuai kesanggupannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Bahwa seseorang tidak dibebani dengan dosa orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-44. Kitab-kitab ini mengandung berita-berita besar yang disebutkan dalam 17 ayat berikut: Bahwa seseorang tidak akan disiksa akibat dosa orang lain, manusia tidak akan mendapat pahala melainkan atas kebaikan yang dia lakukan, dan apa yang dia lakukan akan tercatat di buku amalannya, kemudian dia akan dibalas atas kebaikan atau keburukan sekecil apapun yang telah dia kerjakan dengan balasan yang sempurna. Dan seluruh makhluk akan kembali kepada Tuhanmu, Dialah yang menjadikan tertawa orang yang kesenangan dan kebahagiaan, dan Dia yang menjadikan menangis orang yang Dia kehendaki di dunia dan di akhirat dengan kegundahan dan azab. Dan hanya Dia yang mematikan orang hidup dan menghidupkan orang mati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. أَلَّا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ((yaitu) bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain) Yakni seseorang tidak akan menanggung dosa orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37-38. Dan apa yang ada dalam suhuf Ibrahim yang telah sempurna segala yang diperintahkan. Salah satu yang terkandung dalam suhuf itu adalah bahwa satu jiwa tidak akan memikul dosa jiwa lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahwa seseorang yang berdosa tidak akan memikul} bahwa orang yang berdosa tidak akan menanggung {dosa orang lain} dosa orang laiN"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-41. Terdapat berbagai hukum dalam lembaran-lembaran itu, di antara yang terpenting adalah yang disebutkan Allah dalam FirmanNYa, “(yaitu) bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain, dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya.” Artinya, setiap orang akan menanggung akibat amalannya, baik maupun buruk. Setiap orang tidak akan mendapatkan balasan apa pun dari amalan orang lain dan tidak menanggung dosa siapa pun. “dan bahwasanya usahanya itu kelak akan diperlihatkan (kepadanya),” yakni di akhirat, dan kebaikan akan dipisahkan dari keburukan, “kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna,” yaitu yang mencakup seluruh amal; amalan baik dibalas baik dan amalan buruk dibalas buruk. Balasan adil uang membuat semua manusia mengakuinya dan memuji Allah atas keadilanNya bahkan penghuni neraka sekalipun pada saat dimasukkan ke dalam neraka, tapi hatinya penuh pujian terhadap Rabb mereka serta mengakui kesempurnaan hikmah Nya dan marah terhadap diri mereka sendiri. Mereka mengetahui bahwa yang menyebabkan mereka masuk ke dalam tempat kembali yang paling buruk adalah diri mereka sendiri. Ada yang mengambil dalil dari Firman Allah, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” dengan berpendapat bahwa amal kebaikan yang mendekatkan diri kepada Allah tidak boleh dihadiahkan kepada orang yang masih hidup maupun yang sudah meninggal. Menurut mereka, karena Allah berfirman, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” sampainya usaha orang lain pada seseorang menafikan ayat ini. Cara pengambilan dalil ini perlu dikaji ulang, karena ayat ini menunjukkan, seseorang tidak akan mendapatkan apa pun selain yang telah dikerjakan sendiri, ini memang benar dan tidak perlu diperdebatkan, namun ayat ini tidak menunjukkan bahwa seseorang tidak mendapatkan manfaat dari hasil usaha orang lain jika yang bersangkutan menghadiahkannya pada yang lain. Sama seperti harta, seseorang tidak memiliki harta selain yang dimiliki, hal itu tidak mengharuskan yang bersangkutan tidak memiliki harta yang diberikan oleh orang lain kepadanya di samping harta yang dimilikinya itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 38: 38-39. Allah menjelaskan apa isi dai lembaran-lembaran itu : Ketahuilah bahwa seseorang yang berdosa tidak akan memikul dosa orang lain, dan bahwasanya manusia kecuali akan dibalas atas usaha dan amalannya; Maka anak-anaknya dan amalan-amalan, serta lain-lainnya termasuk dari usahanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 38",
    "description": "Di antara ajaran dalam lembaran-lembaran kitab suci itu adalah bahwa seseorang yang berdosa karena perbuatan dan keingkarannya tidak akan memikul dosa orang lain dan tidak mendapat manfaat dari perbuat-an baik orang lain. 39-40. Dan diajarkan pula dalam lembaran-lembaran kitab suci itu bahwa manusia hanya memperoleh apa yang telah diusahakannya, dan usahanya yang baik atau buruk tidak akan dihilangkan. Semua itu kelak akan diperlihatkan kepadanya sehingga ia dapat berbangga dengan kebaikannya dan malu dengan amal buruknya."
  }
]