[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-39. Yaitu bahwa seseorang tidak dihukum karena dosa orang lain, dan dosa seseorang tidak dipikul oleh orang lain. Seseorang tidak mendapatkan pahala kecuali apa yang diusahakannya untuk dirinya sesuai kesanggupannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan bahwa seseorang tidak mendapat pahala kecuali pahala amalnya yang telah ia kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَأَن لَّيْسَ لِلْإِنسٰنِ إِلَّا مَا سَعَىٰ (dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya) Yakni tidak ada yang dia dapatkan melainkan pahala dan balasan dari amal perbuatannya sendiri, dan dia tidak berhak mendapat balasan amal yang tidak dia lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Tidak ada bagi manusia kecuali usaha yang dipilihnya. Maknanya yaitu kecuali balasan atas perbuatannya di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahwa manusia hanya memperoleh apa yang telah dia usahakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-41. Terdapat berbagai hukum dalam lembaran-lembaran itu, di antara yang terpenting adalah yang disebutkan Allah dalam FirmanNYa, “(yaitu) bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain, dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya.” Artinya, setiap orang akan menanggung akibat amalannya, baik maupun buruk. Setiap orang tidak akan mendapatkan balasan apa pun dari amalan orang lain dan tidak menanggung dosa siapa pun. “dan bahwasanya usahanya itu kelak akan diperlihatkan (kepadanya),” yakni di akhirat, dan kebaikan akan dipisahkan dari keburukan, “kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna,” yaitu yang mencakup seluruh amal; amalan baik dibalas baik dan amalan buruk dibalas buruk. Balasan adil uang membuat semua manusia mengakuinya dan memuji Allah atas keadilanNya bahkan penghuni neraka sekalipun pada saat dimasukkan ke dalam neraka, tapi hatinya penuh pujian terhadap Rabb mereka serta mengakui kesempurnaan hikmah Nya dan marah terhadap diri mereka sendiri. Mereka mengetahui bahwa yang menyebabkan mereka masuk ke dalam tempat kembali yang paling buruk adalah diri mereka sendiri. Ada yang mengambil dalil dari Firman Allah, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” dengan berpendapat bahwa amal kebaikan yang mendekatkan diri kepada Allah tidak boleh dihadiahkan kepada orang yang masih hidup maupun yang sudah meninggal. Menurut mereka, karena Allah berfirman, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” sampainya usaha orang lain pada seseorang menafikan ayat ini. Cara pengambilan dalil ini perlu dikaji ulang, karena ayat ini menunjukkan, seseorang tidak akan mendapatkan apa pun selain yang telah dikerjakan sendiri, ini memang benar dan tidak perlu diperdebatkan, namun ayat ini tidak menunjukkan bahwa seseorang tidak mendapatkan manfaat dari hasil usaha orang lain jika yang bersangkutan menghadiahkannya pada yang lain. Sama seperti harta, seseorang tidak memiliki harta selain yang dimiliki, hal itu tidak mengharuskan yang bersangkutan tidak memiliki harta yang diberikan oleh orang lain kepadanya di samping harta yang dimilikinya itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 39: 38-39. Allah menjelaskan apa isi dai lembaran-lembaran itu : Ketahuilah bahwa seseorang yang berdosa tidak akan memikul dosa orang lain, dan bahwasanya manusia kecuali akan dibalas atas usaha dan amalannya; Maka anak-anaknya dan amalan-amalan, serta lain-lainnya termasuk dari usahanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, setiap orang yang beramal, maka untuknya amalnya itu baik atau buruk, dia tidak mendapatkan amal dan usaha orang lain sedikit pun serta tidak akan memikul dosa orang lain. Sebagian ulama berdalih dengan ayat ini untuk menerangkan bahwa semua ibadah tidak bisa dihadiahkan kepada orang-orang yang masih hidup maupun yang sudah mati, karena Allah Subhaanahu wa Ta'aala berfirman, “Dan bahwa manusia hanya memperoleh apa yang telah diusahakannya.” Oleh karena itu, sampainya usaha orang lain kepadanya bertentangan dengan ayat ini. Namun menurut Syaikh As Sa’diy, “Pendalilan ini perlu ditinjau kembali, karena ayat hanyalah menunjukkan bahwa seseorang tidaklah mendapatkan selain yang ia kerjakan sendiri. Ini jelas tidak ada khilaf, namun di ayat itu tidak ada dalil yang menunjukkan bahwa tidak bermanfaat untuknya usaha orang lain jika orang lain menghadiahkan untuknya sebagaimana seseorang tidaklah memiliki harta selain yang ada dalam kepemilikannya dan yang ada pada tangannya, namun hal ini tidak berarti bahwa ia tidak dapat memiliki apa yang dihibahkan orang lain dari harta miliknya. Faedah: Ada beberapa amal yang bermanfaat bagi si mati, di antaranya: 1. Doa orang muslim untuknya (lihat surah Al Hasyr: 10), Rasulullah shallallahu 'alaihi wa sallam juga bersabda: « دَعْوَةُ الْمَرْءِ الْمُسْلِمِ لأَخِيهِ بِظَهْرِ الْغَيْبِ مُسْتَجَابَةٌ عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ كُلَّمَا دَعَا لأَخِيهِ بِخَيْرٍ قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ آمِينَ وَلَكَ بِمِثْلٍ » . “Doa orang muslim untuk saudaranya tanpa di hadapannya adalah mustajab. Di dekatnya ada malaikat yang diserahkan (untuknya). Setiap kali ia mendoakan kebaikan untuk saudaranya, maka malaikat yang diserahkan untuknya berkata, “Amin (artinya: kabulkanlah ya Allah),” dan kamu memperoleh hal yang sama.” (HR. Muslim) 2. Penunaian terhadap nadzarnya yang belum sempat dikerjakan baik puasa atau lainnya. Rasulullah shallallahu 'alaihi wa sallam bersabda: عَنِ ابْنِ عَبَّاسٍ - رضى الله عنهما - : أَنَّ سَعْدَ بْنَ عُبَادَةَ - رضى الله عنه - اسْتَفْتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ : إِنَّ أُمِّى مَاتَتْ وَعَلَيْهَا نَذْرٌ . فَقَالَ :« اقْضِهِ عَنْهَا » . Dari Ibnu Abbas radhiyallahu 'anhuma, bahwa Sa’ad bin ‘Ubadah radhiyallahu 'anhu pernah meminta fatwa kepada Rasulullah shallallahu 'alaihi wa sallam, maka Beliau bersabda, “Sesungguhnya ibuku wafat sedangkan dia punya nadzar (yang belum sempat ditunaikan)?” Maka Beliau bersabda, “Tunaikanlah untuknya.” (HR. Bukhari dan Muslim) Hadits ini juga menunjukkan bolehnya sedekah dari (atas nama) si mati, dan bahwa hal itu akan bermanfaat baginya yaitu dengan sampainya pahala sedekah kepadanya, terlebih jika yang melakukannya anaknya (lihat Fathul Bari dalam syarah hadits ini). 3. Sedekah jariyah/yang mengalir (seperti waqaf) 4. Ilmu yang bermanfaat 5. Doa anak saleh untuk orang tuanya. Rasulullah shallallahu 'alaihi wa sallam bersabda: إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ إِلاَّ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ “Apabila anak Adam meninggal, maka terputuslah seluruh amalnya kecuali tiga; sedekah jariyah, ilmu yang dimanfaatkan atau anak shalih yang mendoakan (orang tua)nya.” (HR. Muslim) إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَرْفَعُ الدَّرَجَةَ لِلْعَبْدِ الصَّالِحِ فِي الْجَنَّةِ فَيَقُولُ يَا رَبِّ أَنَّى لِي هَذِهِ فَيَقُولُ بِاسْتِغْفَارِ وَلَدِكَ لَكَ “Sesungguhnya Allah ‘Azza wa Jalla benar-benar meninggikan derajat untuk seorang hamba yang saleh di surga, lalu ia berkata, “Yaa Rabbi, dari mana aku mendapatkan hal ini?” Allah berfirman, “Karena permintaan ampunan dari anakmu untukmu.” (Hadits hasan, diriwayatkan oleh Ahmad) 6. Peninggalannya yang baik. Rasulullah shallallahu 'alaihi wa sallam bersabda: إِنَّ مِمَّا يَلْحَقُ الْمُؤْمِنَ مِنْ عَمَلِهِ وَ حَسَنَاتِهِ بَعْدَ مَوْتِهِ عِلْمًا نَشَرَهُ وَ وَلَدًا صَالِحًا تَرَكَهُ وَ مُصْحَفًا وَرَّثَهُ أَوْ مَسْجِدًا بَنَاهُ أَوْ بَيْتًا لِابْنِ السَّبِيْلِ بَنَاهُ أَوْ نَهْرًا أَجْرَاهُ أَوْ صَدَقَةً أَخْرَجَهَا مِنْ مَالِهِ فِي صِحَّتِهِ وَ حَيَاتِهِ تَلْحَقُهُ مِنْ بَعْدِ مَوْتِهِ \"Sesungguhnya di antara amalan dan kebaikan yang akan sampai kepada seorang mukmin setelah wafatnya adalah ilmu yang disebarkannya, anak saleh yang ditinggalkanya, mushaf Al Qur'an yang diwariskannya, masjid yang dibangunnya, rumah untuk Ibnussabil yang didirikannya, sungai yang dialirkannya, sedekah yang dikeluarkan dari hartanya di waktu sehat dan sewaktu hidupnya. Semua itu akan sampai kepadanya setelah meninggalnya.\" (HR. Ibnu Majah dan Baihaqi, lihat Shahihul Jaami' no. 2231) Imam As Suyuthiy membuatkan sya’ir menyebutkan hal-hal yang bermanfaat bagi seseorang setelah meninggalnya sbb: اِذَا مَاتَ ابْنُ ادَمَ يَجْرِي عَلَيْهِ مِنْ فِعَالٍ غَيْرِ عَشْرٍ عُلُوْمٍ بَثَّهَا وَدُعَاءِ نَجْلٍ وَغَرْسِ النَّخْلِ وَالصَّدَقَاتُ تَجْرِي وَرَاثَةِ مُصْحَفٍ وَرِبَاطُ ثَغْرٍ وَحَفْرِ الْبِئْرِ أَوْ إِجْرَاءِ نَهْرٍ وَبَيْتٍ لْلْغَرِيْبِ بَنَاهُ يَأْوِى إلَِيْهِ أَوْ بِنَاءِ مَحَلِّ ذِكْرٍ \"Apabila cucu Adam meninggal, maka mengalirlah kepadanya sepuluh perkara;, Ilmu yang disebarkannya, doa anak saleh, pohon kurma yang ditanamnya serta sedekahnya yang mengalir, Mushaf yang diwariskan dan menjaga perbatasan, Menggali sumur, mengalirkan sungai, rumah untuk musafir yang dibangunnya atau membangun tempat ibadah.\" 7. Menjaga perbatasan negeri yang dikhawatirkan adanya serangan musuh (Ribath). Rasulullah shallallahu 'alaihi wa sallam bersabda: « رِبَاطُ يَوْمٍ وَلَيْلَةٍ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ وَإِنْ مَاتَ جَرَى عَلَيْهِ عَمَلُهُ الَّذِى كَانَ يَعْمَلُهُ وَأُجْرِىَ عَلَيْهِ رِزْقُهُ وَأَمِنَ الْفَتَّانَ » “Ribath sehari semalam lebih baik daripada puasa sebulan dengan qiyamullail, dan jika ia meninggal, maka amal yang dikerjakannya akan mengalir untuknya dan dialirkan rezekinya serta aman dari penguji kubur (aman dari fitnah kubur).” (HR. Muslim, Tirmidzi dan Nasa’i) 8. Tanaman yang ditanamnya. Rasulullah shallallahu 'alaihi wa sallam bersabda: « مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا إِلاَّ كَانَ مَا أُكِلَ مِنْهُ لَهُ صَدَقَةٌ وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَةٌ وَمَا أَكَلَ السَّبُعُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ وَمَا أَكَلَتِ الطَّيْرُ فَهُوَ لَهُ صَدَقَةً وَلاَ يَرْزَؤُهُ أَحَدٌ إِلاَّ كَانَ لَهُ صَدَقَةٌ » . “Tidak ada seorang muslim yang menanam suatu tanaman kecuali yang dimakan darinya adalah sedekah baginya, yang dicuri darinya adalah sedekah baginya, yang dimakan binatang buas darinya adalah sedekah dan yang dimakan burung adalah sedekah, dan tidak dikurangi oleh seorang pun kecuali menjadi sedekah baginya.” (HR. Muslim) 9. Menggali kubur untuk orang yang mati. Rasulullah shallallahu 'alaihi wa sallam bersabda: مَنْ غَسَّلَ مَيِّتًا فَكَتَمَ عَلَيْهِ غُفِرَ لَهُ أَرْبَعِيْنَ مَرَّةً ، وَمَنْ كَفَنَ مَيِّتًا كَسَاهُ اللهُ مِنَ السُّنْدُسِ ، وَإِسْتَبْرَقِ الْجَنَّةِ ، وَمَنْ حَفَرَ لِمَيِّتٍ قَبْرًا فَأَجَنَّهُ فِيْهِ أُجْرِيَ لَهُ مِنَ الْأَجْرِ كَأَجْرِ مَسْكَنٍ أَسْكَنَهُ إِلَى يَوْمِ الْقِيَامَةِ “Barang siapa yang memandikan mayit, lalu ia menyembunyikan (cacat)nya, maka akan diampuni dosanya sebanyak empat puluh kali. Barang siapa yang mengkafani mayit, maka Allah akan memakaikan pakaian dari sutera tipis dan sutera tebal dari surga, dan barang siapa menggalikan kuburan untuk si mati, lalu ia menguburkannya, maka akan dialirkan pahala untuknya seperti pahala tempat yang ia buatkan sampai hari Kiamat.” (HR. Hakim, ia berkata, “Hadits ini shahih sesuai syarat Muslim,” dan disepakati oleh Adz Dzahabi) 10. Mencontohkan sunnah Rasulullah shallallahu 'alaihi wa sallam. Rasulullah shallallahu 'alaihi wa sallam bersabda: مَنْ سَنَّ فِى الإِسْلاَمِ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا بَعْدَهُ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَىْءٌ وَمَنْ سَنَّ فِى الإِسْلاَمِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أَوْزَارِهِمْ شَىْءٌ » . “Barang siapa mencontohkan dalam Islam contoh yang baik, maka ia akan mendapatkan pahalanya dan pahala orang yang mengamalkan setelahnya. Barang siapa yang mencontohkan sunnah yang buruk (seperti mencontohkan bid’ah), maka ia akan menanggung dosanya dan dosa orang yang mengamalkan setelahnya tanpa dikurangi sedikit pun dari dosa-dosa mereka.” (HR. Muslim: 2351)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 39",
    "description": "39-40. Dan diajarkan pula dalam lembaran-lembaran kitab suci itu bahwa manusia hanya memperoleh apa yang telah diusahakannya, dan usahanya yang baik atau buruk tidak akan dihilangkan. Semua itu kelak akan diperlihatkan kepadanya sehingga ia dapat berbangga dengan kebaikannya dan malu dengan amal buruknya"
  }
]