[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Allah bersumpah dengan bintang-bintang bila ia terbenam, (bahwa) Muhammad tidak menyimpang dari jalan hidayah dan kebenaran, tidak keluar dari jalan lurus, sebaliknya dia berada di puncak istiqamah, keseimbangan dan kelurusan, ucapannya tidak keluar dari hawa nafsu. Al-quran dan as-Sunnah tidak lain kecuali wahyu dari allah kepada NabiNya,Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Al-Qur`ān ini tidak lain adalah wahyu yang diwahyukan Allah kepadanya melalui Jibril -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنْ هُوَ إِلَّا وَحْىٌ يُوحَىٰ (Ucapannya itu tiada lain hanyalah wahyu yang diwahyukan (kepadanya)) Yakni yang dia ucapkan adalah wahyu yang diturunkan Allah kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Al-Quran ini tidak lain hanyalah wahyu yang diwahyukan Allah kepadanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Al-Qur’an itu) tidak lain} Al-Qur’an itu tidak lain {kecuali wahyu yang disampaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3-4. “Dan tiadalah yang diucapkannya itu (al-Quran) menurut kemauan hawa nafsunya,” yakni ucapannya bukanlah berdasarkan hawa nafsunya. “Ucapannya itu tiada lain hanyalah wahyu yang disampaikan padanya berupa hidayah, takwa dalam dirinya dan pada yang lain. Hal ini menunjukkan bahwa -Sunnah (hadist) adalah wahyu dari Allah untuk RasulNya, sebagaimana yang disebutkan dalam firman Allah: “Dan (juga karena) Allah telah menurunkan Kitab dan hikmah kepadamu,” -An-Nisa:113 Dan sesungguhnya Muhammad terjaga dari kesalahan terhadap apa yang disampaikan dari Allah dan dari syariat, sebab perkataan beliau tidak bersumber dari hawa nafsu, namun bersumber dari wahyu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 4: 1-4. Allah mengawali surat ini dengan bersumpah dengan bintang-bintang di langit yang menukik karena terbenam. Kemudian datang jawaban atas sumpah yang mengabarkan bahwa sahabat kalian ini (Muhammad) wahai orang-orang Quraisy, tidaklah menyimpang dari jalan yang lurus, dan tidak juga berkeyakinan bathil selamanya. Sesungguhnya Muhammad tidaklah berbicara dengan hawa nafsu, dan juga pendapatnya sendiri atas apa yang disampaikannya kepada kalian dari kerisalahan. Sungguh dia tidak berbicara kecuali atas dasar wahyu yang Allah wahyukan kepadanya. Berkata Asy Syanqiti penulis Adhwaul Bayan, ketika mengajarkan kepada kami tafsir di kuliah syariah : Bintang yang Allah bersumpah atasnya adalah ungkapan atas turunnya Al Qur’an; Karena Al Qur’an turun secara berangsur-angsur kepada Nabi ﷺ. Dengan ini maka maknanya adalah : Sesungguhnya Allah bersumpah dengan ungkapan turunnya Al Qur’an yang diturunkan malaikat kepada Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang ia ikuti selain wahyu yang diwahyukan Allah kepadanya. Ayat ini menunjukkan bahwa As Sunnah termasuk wahyu Allah kepada Rasul-Nya shallallahu 'alaihi wa sallam sebagaimana firman Allah ‘Azza wa Jalla, “Dan (juga karena) Allah telah menurunkan kitab dan hikmah kepadamu,...” (Terj. An Nisaa’: 113), dan bahwa Beliau ma’shum dalam hal yang Beliau sampaikan dari Allah, karena ucapannya tidak keluar dari keinginannya, tetapi dari wahyu yang diwahyukan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 4",
    "description": "Al-qur'an yang disampaikannya tidak lain adalah wahyu Allah yang diwahyukan kepadanya. 5-6. Wahyu yang diterimanya diajarkan kepadanya oleh jibril, malaikat yang sangat kuat, yang mempunyai keteguhan sangat hebat; maka ia menampakkan diri kepada nabi Muhammad dengan rupa yang asli, yakni bagus dan perkasa."
  }
]