[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Kemudian manusia dibalas atas usahanya dengan balasan yang sempurna untuk seluruh amalnya. Sesungguhnya hanya kepada Tuhanmu (wahai Rasul) tempat kembali seluruh makhluk di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Kemudian pahala amalnya itu diberikan secara sempurna tanpa dikurangi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. ثُمَّ يُجْزَىٰهُ (Kemudian akan diberi balasan kepadanya) Yakni perbuatan seseorang akan dibalas. الْجَزَآءَ الْأَوْفَىٰ( dengan balasan yang paling sempurna) Yakni dengan balasan penuh tanpa pengurangan sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Lalu dia dibalas atas semua perbuatannya dengan balasan yang sempurna. Ayat-ayat ini (33-41) diturunkan untuk Walid bin Mughirah yang memberikan harta kepada sebagian orang-orang musyrik untuk memikul dosa-dosanya kepada Allah SWT. Dia memberikan sebaian yang dijanjikan lalu sisanya tidak diberikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kemudian dia akan diberi balasan atas itu} manusia akan diberi balasan atas amalnya itu {dengan balasan yang paling sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-41. Terdapat berbagai hukum dalam lembaran-lembaran itu, di antara yang terpenting adalah yang disebutkan Allah dalam FirmanNYa, “(yaitu) bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain, dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya.” Artinya, setiap orang akan menanggung akibat amalannya, baik maupun buruk. Setiap orang tidak akan mendapatkan balasan apa pun dari amalan orang lain dan tidak menanggung dosa siapa pun. “dan bahwasanya usahanya itu kelak akan diperlihatkan (kepadanya),” yakni di akhirat, dan kebaikan akan dipisahkan dari keburukan, “kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna,” yaitu yang mencakup seluruh amal; amalan baik dibalas baik dan amalan buruk dibalas buruk. Balasan adil uang membuat semua manusia mengakuinya dan memuji Allah atas keadilanNya bahkan penghuni neraka sekalipun pada saat dimasukkan ke dalam neraka, tapi hatinya penuh pujian terhadap Rabb mereka serta mengakui kesempurnaan hikmah Nya dan marah terhadap diri mereka sendiri. Mereka mengetahui bahwa yang menyebabkan mereka masuk ke dalam tempat kembali yang paling buruk adalah diri mereka sendiri. Ada yang mengambil dalil dari Firman Allah, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” dengan berpendapat bahwa amal kebaikan yang mendekatkan diri kepada Allah tidak boleh dihadiahkan kepada orang yang masih hidup maupun yang sudah meninggal. Menurut mereka, karena Allah berfirman, “Dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya,” sampainya usaha orang lain pada seseorang menafikan ayat ini. Cara pengambilan dalil ini perlu dikaji ulang, karena ayat ini menunjukkan, seseorang tidak akan mendapatkan apa pun selain yang telah dikerjakan sendiri, ini memang benar dan tidak perlu diperdebatkan, namun ayat ini tidak menunjukkan bahwa seseorang tidak mendapatkan manfaat dari hasil usaha orang lain jika yang bersangkutan menghadiahkannya pada yang lain. Sama seperti harta, seseorang tidak memiliki harta selain yang dimiliki, hal itu tidak mengharuskan yang bersangkutan tidak memiliki harta yang diberikan oleh orang lain kepadanya di samping harta yang dimilikinya itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 41: 40-41. Allah menjelaskan bahwa manusia akan melihat dan memandang usahanya sendiri-sendiri di hari kiamat. Kemudian Allah akan menghisab dan membalas mereka dengan sesempuna-sempurnanya balasan; Jika baik maka akan dibalas dengan kebaikan, jika buruk maka akan dibalas dengan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang baik dengan Al Husna (yang terbaik), dan yang buruk dengan yang buruk, sedangkan yang bercampur maka disesuaikan dengan keadaannya sebagai balasan yang ihsan dan adil, dimana semuanya merasakan kepuasan dan Allah berhak mendapatkan segala puji terhadapnya, sehingga penghuni neraka masuk ke neraka sedangkan hati mereka penuh dengan pujian terhadap Tuhan mereka serta mengakui kebijaksanaan-Nya dan mereka marah kepada diri mereka sendiri, dan bahwa merekalah yang membuat diri mereka masuk ke tempat yang buruk itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 41",
    "description": "41-42. Kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna. Amal yang baik akan mendapat balasan yang berlipat ganda, dan amal yang buruk akan dibalas sesuai kadar keburukannya. Dan selain itu, disebutkan pula dalam lembaran-lembaran kitab suci itu bahwa sesungguhnya hanya kepada tuhanmu permulaan dan kesudahan segala sesuatu"
  }
]