[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Kemudian manusia dibalas atas usahanya dengan balasan yang sempurna untuk seluruh amalnya. Sesungguhnya hanya kepada Tuhanmu (wahai Rasul) tempat kembali seluruh makhluk di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Dan bahwa kepada Rabbmu -wahai Rasul- tempat kembali para hamba dan tujuan mereka setelah kematian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَأَنَّ إِلَىٰ رَبِّكَ الْمُنتَهَىٰ (dan bahwasanya kepada Tuhanmulah kesudahan (segala sesuatu)) Yakni tempat kembali hanya kepada Allah, kemudian mereka akan dibalas sesuai dengan amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Sesungguhnya kepada Tuhanmulah tempat kembali paling akhir setelah kematian pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang paling sempurna dan penuh {bahwa sesungguhnya kepada Tuhanmulah kesudahan itu} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah berfirman, “Dan bahwasanya kepada Rabbmu-lah kesudahan (segala sesuatu),” artinya kepadaNya segala urusan berakhir dan kepadaNya-lah segala sesuatu akan kembali, tidak terkecuali manusia yang akan kembali kepada Allah dengan cara dibangkitkan. Kepada Allah lah segala hal berakhir, kepadaNya berakhir ilmu, hikmah, rahmat, dan seluruh kesempurnaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 42: 42-44. Allah mengabarkan bahwasanya Allah sajalah pemilik urusan yang tertinggi pada hari kiamat, dan kepada-Nya lah kembali segala sesuatu dan makhluk dengan dibangkitkan dan diadili. Allahlah yang menjadikan orang tertawa dan gembira dengan kemaun-Nya, dan bersedih dan menangis sesuai dengan keinginan-Nya, dan menjadikan manusia mampu atas hal tersebut; Semuanya itu dengan rahmat dan karunia-Nya dan dengan hikmah dan keadilan dari-Nya. Allah sajalah yang mematikan dan menghidupkan di dunia, dan Dia sajalah yang mematikan, menghidupkan dan membangkitkan dari kubur-kubur manusia pada hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tempat kembali mereka setelah mati adalah kepada Allah Subhaanahu wa Ta'aala, lalu Dia akan memberikan balasan kepada mereka. Kepada-Nyalah segala sesuatu dan semua makhluk kembali. Kepada-Nya berpulang pengetahuan, hikmah-hikmah, rahmat dan seluruh kesempurnaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 42",
    "description": "41-42. Kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna. Amal yang baik akan mendapat balasan yang berlipat ganda, dan amal yang buruk akan dibalas sesuai kadar keburukannya. Dan selain itu, disebutkan pula dalam lembaran-lembaran kitab suci itu bahwa sesungguhnya hanya kepada tuhanmu permulaan dan kesudahan segala sesuatu. 43-44. Dan selain itu, diterangkan pula dalam lembaran-lembaran kitab suci itu bahwa sesungguhnya dialah yang mahakuasa yang telah menjadikan orang tertawa dan menangis serta menciptakan faktor-faktor yang menyebabkannya, dan sesungguhnya dia pula yang mematikan dan menghidupkan ciptaan-Nya."
  }
]