[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah membuat tertawa siapa yang Dia kehendaki dan membuat menangis siapa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan bahwasanya Dia menggembirakan orang yang dikehendaki-Nya dengan menjadikannya tertawa, dan membuat sedih orang yang dikehendaki-Nya dengan membuatnya menangis."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَأَنَّهُۥ هُوَ أَضْحَكَ وَأَبْكَىٰ (dan bahwasanya Dialah yang menjadikan orang tertawa dan menangis) Yakni Allah menjadikan penduduk surga tertawa dan menjadikan penduduk neraka menangis. Atau Allah menjadikan tertawa orang yang Dia kehendaki di dunia dengan menjadikannya senang, dan Allah menjadikan menangis orang yang Dia kehendaki dengan menjadikannya sedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Sesungguhnya Allah SWT menciptakan sebab-sebab tertawa dan menangis. Ayat ini diturunkan untuk kaum yang suka tertawa di dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahwa sesungguhnya Dialah yang menjadikan tertawa dan menangis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dan bahwasanya Dia-lah yang menjadikan orang tertawa dan menangis.” Dia-lah yang membuat sebab-sebab tertawa dan sebab-sebab menangis, yaitu kebaikan, keburukan, kesenangan, kebahagiaan, duka, dan kesedihan. Dan Allah memiliki hikmah yang tinggi dalam hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 43: 42-44. Allah mengabarkan bahwasanya Allah sajalah pemilik urusan yang tertinggi pada hari kiamat, dan kepada-Nya lah kembali segala sesuatu dan makhluk dengan dibangkitkan dan diadili. Allahlah yang menjadikan orang tertawa dan gembira dengan kemaun-Nya, dan bersedih dan menangis sesuai dengan keinginan-Nya, dan menjadikan manusia mampu atas hal tersebut; Semuanya itu dengan rahmat dan karunia-Nya dan dengan hikmah dan keadilan dari-Nya. Allah sajalah yang mematikan dan menghidupkan di dunia, dan Dia sajalah yang mematikan, menghidupkan dan membangkitkan dari kubur-kubur manusia pada hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Dialah yang mengadakan sebab tertawa, sebab menangis, dan Dia memiliki hikmah dalam hal itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 43",
    "description": "43-44. Dan selain itu, diterangkan pula dalam lembaran-lembaran kitab suci itu bahwa sesungguhnya dialah yang mahakuasa yang telah menjadikan orang tertawa dan menangis serta menciptakan faktor-faktor yang menyebabkannya, dan sesungguhnya dia pula yang mematikan dan menghidupkan ciptaan-Nya"
  }
]