[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Dan bahwasanya Allah-lah Yang menciptakan pasangan lelaki dan wanita, baik dari manusia maupun binatang, dari setetes air yang dimasukkan ke Rahim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan bahwasanya Dia menciptakan dua jenis; laki-laki dan perempuan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-49. Dan Dia yang menciptakan pasangan laki-laki dan perempuan -baik itu manusia atau hewan- dari air mani yang memancar ke dalam rahim. Dan sungguh Dia yang membangkitkan makhluk setelah kematiannya, Dia yang menjadikan kaya dan berkuasa makhluk-Nya yang Dia kehendaki dan Dia yang menjadikan para makhluk merasa puas dan ridha dengan rezeki mereka; dan Dia adalah Tuhannya bintang yang bersinar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَأَنَّهُۥ خَلَقَ الزَّوْجَيْنِ الذَّكَرَ وَالْأُنثَىٰ (dan bahwasanya Dialah yang menciptakan berpasang-pasangan pria dan wanita) Yakni dari setiap manusia atau hewan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Sesungguhnya Allah Azza wa Jalla menciptakan (hubungan) suami-istri, yaitu jantan dan betina dari golongan manusia dan hewan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Dialah yang menciptakan pasangan} pasangan {laki-laki dan perempuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. “Dan bahwasanya Dia-lah yang menciptakan berpasang-pasangan,” ditafsirkan oleh FIrmanNYa, “Laki-laki dan perempuan.” Ini adalah isim jenis yang mencakup seluruh makhluk hidup, baik yang bisa berbicara (manusia) maupun binatang, Dia semata yang menciptakannya “dari air mani apabila dipancarkan.” Ini merupakan dalil paling besar yang menunjukkan KuasaNya, dan hanya Dia semata yang memiliki keperkasaan yang besar yang telah menciptakan makhluk hidup, baik yang besar maupun yang kecil berasal dari air mani lemah dan hina, kemudian Allah mengembangkan dan menyempurnakannya hingga mencapai kesempurnaan, kemudian menjadi manusia yang menuju tempat tertinggi di dalam golongan orang-orang atas menuju kondisi yang paling rendah dalam golongan orang-orang yang paling rendah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 45: 45-49. Allah menjelaskan bahwa Dialah yang menciptakan laki-laki dan perempuan dan mewujudkan keduanya dari ketiadaan. Dan Allah menjelaskan bahwa Dialah yang menjadikan keduanya laki dan perempuan (manusia, hewan, dan jin) dari air mani yang dicurahkan ke dalam rahim dan tersembur ke dalamnya. Allah menjelaskan bahwa Dialah yang mengembalikan ciptaan-Nya untuk kedua kalinya pada hari kebangkitan; Agar untuk dibalas dengan apa yang berhak bagi mereka. Allah menjelaskan bahwa Dia Maha Kaya atas segala sesuatu dari hamba-Nya, dan menjadikan miskin bagi siapa yang dikehendaki oleh-Nya di antara mereka. Allah menjelaskan bahwa Dialah Tuhan bintang syi’ra yang telah dikenal, ia adalah bintang yang diibadahi pada masa jahiliyyah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk pula dari jenis hewan, ada jantan dan ada betina."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 45",
    "description": "45-46. Dan disebutkan pula dalam suhuf nabi ibrahim dan musa bahwa sesungguhnya dialah yang menciptakan pasangan laki-laki dan perempuan, jantan dan betina, dari mani apabila dipancarkan, yang selanjutnya pencipaan itu melalui proses yang telah ditetapkan"
  }
]