[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-46. Dan bahwasanya Allah-lah Yang menciptakan pasangan lelaki dan wanita, baik dari manusia maupun binatang, dari setetes air yang dimasukkan ke Rahim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dari air mani jika diletakkan di dalam rahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. مِن نُّطْفَةٍ (dari air mani) Makna (النطفة) adalah air yang sedikit. إِذَا تُمْنَىٰ( apabila dipancarkan) Yakni ketika dimasukkan ke dalam rahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Dia menciptakan keduanya dari air mani, yaitu air yang dialirkan dalam rahim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari mani ketika dipancarkan} dipancarkan dalam rahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45-46. “Dan bahwasanya Dia-lah yang menciptakan berpasang-pasangan,” ditafsirkan oleh FIrmanNYa, “Laki-laki dan perempuan.” Ini adalah isim jenis yang mencakup seluruh makhluk hidup, baik yang bisa berbicara (manusia) maupun binatang, Dia semata yang menciptakannya “dari air mani apabila dipancarkan.” Ini merupakan dalil paling besar yang menunjukkan KuasaNya, dan hanya Dia semata yang memiliki keperkasaan yang besar yang telah menciptakan makhluk hidup, baik yang besar maupun yang kecil berasal dari air mani lemah dan hina, kemudian Allah mengembangkan dan menyempurnakannya hingga mencapai kesempurnaan, kemudian menjadi manusia yang menuju tempat tertinggi di dalam golongan orang-orang atas menuju kondisi yang paling rendah dalam golongan orang-orang yang paling rendah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 46: 45-49. Allah menjelaskan bahwa Dialah yang menciptakan laki-laki dan perempuan dan mewujudkan keduanya dari ketiadaan. Dan Allah menjelaskan bahwa Dialah yang menjadikan keduanya laki dan perempuan (manusia, hewan, dan jin) dari air mani yang dicurahkan ke dalam rahim dan tersembur ke dalamnya. Allah menjelaskan bahwa Dialah yang mengembalikan ciptaan-Nya untuk kedua kalinya pada hari kebangkitan; Agar untuk dibalas dengan apa yang berhak bagi mereka. Allah menjelaskan bahwa Dia Maha Kaya atas segala sesuatu dari hamba-Nya, dan menjadikan miskin bagi siapa yang dikehendaki oleh-Nya di antara mereka. Allah menjelaskan bahwa Dialah Tuhan bintang syi’ra yang telah dikenal, ia adalah bintang yang diibadahi pada masa jahiliyyah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam rahim. Hal ini termasuk dalil terbesar yang menunjukkan sempurnanya kekuasaan Allah dan sendirinya Dia dengan keperkasaan, Dia mengadakan makhluk hidup yang kecil maupun besar dari air mani yang lemah dan hina, lalu Dia mengembangkannya dan menyempurnakannya sampai menjadi dewasa dan mencapai usianya. Selanjutnya, untuk manusia, maka ada yang naik kedudukannya di tempat yang paling tinggi (surga) dan ada pula yang turun kedudukannya ke tempat yang paling bawah (neraka). Oleh karena itu, Dia (Allah) berdalih dengan permulaan terhadap penciptaan kembali, Dia berfirman, “Dan sesungguhnya Dialah yang menetapkan penciptaan yang lain (kebangkitan setelah mati),”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 46",
    "description": "45-46. Dan disebutkan pula dalam suhuf nabi ibrahim dan musa bahwa sesungguhnya dialah yang menciptakan pasangan laki-laki dan perempuan, jantan dan betina, dari mani apabila dipancarkan, yang selanjutnya pencipaan itu melalui proses yang telah ditetapkan. 47-48. Dan dalam kedua suhuf itu juga diterangkan bahwa sesungguhnya dialah yang menetapkan penciptaan yang lain, yaitu pembangkitan manusia dari kematian mereka pada hari kebangkitan, dan disebutkan pula bahwa sesungguhnya dialah yang memberikan kepada semua makhluk kekayaan serta kepuasan hati dari kegiatan yang diusahakan dan memberikan kecukupan atas apa yang disimpan."
  }
]