[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bahwa Tuhanmu-lah (wahai Rasul) Yang kuasa Mengembalikan penciptaan mereka sesudah kematian mereka, yaitu kehidupan baru di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan bahwasanya Dia lah yang mengembalikan penciptaan keduanya setelah kematian keduanya untuk kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَأَنَّ عَلَيْهِ النَّشْأَةَ الْأُخْرَى (Dan bahwasanya Dialah yang menetapkan kejadian yang lain) Yakni Allah mengembalikan ruh ke jasadnya saat hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Sesungguhnya Allah SWT sudah menyiapkan kehidupan lain sekali lagi setlah hari pembangkitan. Pembangkitan lain yaitu pembangkitan dari kubur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahwa sesungguhnya Dialah yang menetapkan penciptaan yang lain} kehidupan setelah mati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Atas penjelasan itulah Allah berdalil atas pengembalian makhluk dengan permulaan ciptaan seraya berfirman, “Dan bahwasanya Dia-lah yang menetapkan kejadian yang lain (kebangkitan sesudah mati),” manusia akan dikembalikan dari alam kubur kemudian dikumpulkan pada Hari Akhir untuk diberi balasan atas kebaikan dan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 47: 45-49. Allah menjelaskan bahwa Dialah yang menciptakan laki-laki dan perempuan dan mewujudkan keduanya dari ketiadaan. Dan Allah menjelaskan bahwa Dialah yang menjadikan keduanya laki dan perempuan (manusia, hewan, dan jin) dari air mani yang dicurahkan ke dalam rahim dan tersembur ke dalamnya. Allah menjelaskan bahwa Dialah yang mengembalikan ciptaan-Nya untuk kedua kalinya pada hari kebangkitan; Agar untuk dibalas dengan apa yang berhak bagi mereka. Allah menjelaskan bahwa Dia Maha Kaya atas segala sesuatu dari hamba-Nya, dan menjadikan miskin bagi siapa yang dikehendaki oleh-Nya di antara mereka. Allah menjelaskan bahwa Dialah Tuhan bintang syi’ra yang telah dikenal, ia adalah bintang yang diibadahi pada masa jahiliyyah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia yang mengeluarkan manusia dari alam kubur, mengumpulkan mereka dan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 47",
    "description": "47-48. Dan dalam kedua suhuf itu juga diterangkan bahwa sesungguhnya dialah yang menetapkan penciptaan yang lain, yaitu pembangkitan manusia dari kematian mereka pada hari kebangkitan, dan disebutkan pula bahwa sesungguhnya dialah yang memberikan kepada semua makhluk kekayaan serta kepuasan hati dari kegiatan yang diusahakan dan memberikan kecukupan atas apa yang disimpan"
  }
]