[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang membuat kaya siapa yang Dia kehendaki dari makhlukNya dengan harta, membuat mereka memilikinya, dan membuat mereka ridha dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan bahwasanya Dia menjadikan kaya orang yang dikehendaki-Nya dengan manjadikannya memiliki harta, dan Dia memberikan harta yang digunakan manusia untuk mencukupi diri mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَأَنَّهُۥ هُوَ أَغْنَىٰ وَأَقْنَىٰ (dan bahwasanya Dia yang memberikan kekayaan dan memberikan kecukupan) Yakni Allah memberi sebagian manusia harta yang mencukupinya sehingga ia tidak perlu meminta-minta, dan Allah memberi sebagian manusia lainnya harta yang melimpah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Sesungguhnya Dia memberikan kekayaan pada sebagian hambaNya dan memberikan kefakiran pada sebagian lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya Dialah yang menganugerahkan kekayaan dan kecukupan} kecukupan terhadap apa yang diberi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Dan bahwasanya Dia yang memberikan kekayaan dan memberikan kecukupan,” artinya, memberi kecukupan pada manusia dengan cara memberi kemudahan dalam penghidupan yang bersumber dari perdagangan dan berbagai jenis pekerjaan lain, “dan memberikan kecukupan,” artinya memberi manfaat pada para hambaNya dari berbagai jenis harta sehingga dengan harta itu mereka dapat memiliki berbagai macam benda dan ini merupakan salah saru rahmatNya. Allah memberitahukan bahwa seluruh nikmat berasal dariNya dan hal ini mengharuskan manusia untuk bersyukur padaNya dan menyembahNya semata, yang tidak ada sekutu bagiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 48: 45-49. Allah menjelaskan bahwa Dialah yang menciptakan laki-laki dan perempuan dan mewujudkan keduanya dari ketiadaan. Dan Allah menjelaskan bahwa Dialah yang menjadikan keduanya laki dan perempuan (manusia, hewan, dan jin) dari air mani yang dicurahkan ke dalam rahim dan tersembur ke dalamnya. Allah menjelaskan bahwa Dialah yang mengembalikan ciptaan-Nya untuk kedua kalinya pada hari kebangkitan; Agar untuk dibalas dengan apa yang berhak bagi mereka. Allah menjelaskan bahwa Dia Maha Kaya atas segala sesuatu dari hamba-Nya, dan menjadikan miskin bagi siapa yang dikehendaki oleh-Nya di antara mereka. Allah menjelaskan bahwa Dialah Tuhan bintang syi’ra yang telah dikenal, ia adalah bintang yang diibadahi pada masa jahiliyyah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia memberikan kekayaan kepada hamba dengan memudahkan penghidupan mereka baik dengan berdagang, berbisnis maupun dengan keterampilan yang Allah berikan kepada mereka, dan Dia pula yang memberikan faedah kepada hamba-hamba-Nya dengan harta yang bermacam-macam sehingga mereka memilikinya dan memiliki banyak barang. Ini termasuk nikmat Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya, yaitu bahwa semua nikmat berasal dari-Nya. Hal ini mengharuskan semua hamba untuk bersyukur kepada-Nya dan beribadah hanya kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 48",
    "description": "47-48. Dan dalam kedua suhuf itu juga diterangkan bahwa sesungguhnya dialah yang menetapkan penciptaan yang lain, yaitu pembangkitan manusia dari kematian mereka pada hari kebangkitan, dan disebutkan pula bahwa sesungguhnya dialah yang memberikan kepada semua makhluk kekayaan serta kepuasan hati dari kegiatan yang diusahakan dan memberikan kecukupan atas apa yang disimpan. 49. Dan selain itu, dalam kedua suhuf itu juga disebutkan bahwa sesungguhnya dialah tuhan yang menciptakan, memiliki, dan mengendalikan bintang syi'ra, bintang sembahan orang arab pada masa jahiliah."
  }
]