[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Juga bahwasanya Allah adalah Tuhan Pemilik Syi’ra, bintang yang bersinar, yang mana sebagian orang-orang jahiliyah menyembahnya selain Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan bahwasanya Dia adalah pemilik Asy-Syi'ra, bintang yang disembah oleh sebagian orang musyrik bersama penyembahan terhadap Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَأَنَّهُۥ هُوَ رَبُّ الشِّعْرَىٰ (dan bahwasanya Dialah yang Tuhan (yang memiliki) bintang syi’ra) Syi’ra adalah bintang yang terletak di belakang gugusan bintang gemini yang disembah oleh suku Khuza’ah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Dialah Tuhan yang memiliki bintang Syi’ra, yaitu bintang yang bersinar di belakang. Orang-orang yang terputus (dari RahmatNya) menyembah bintang itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bahwa sesungguhnya Dialah Tuhan bintang Syi‘ra} bintang sebelum rasi bintang Jauza’ yang disembah oleh satu golongan dari orang Arab selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “Dan bahwasanya Dia-lah Rabb (yang memiliki) binatang syi’ra,” binatang yang lazim disebut asy-syu’raa al-‘ubur yang diberi nama mirzam. Allah menyebut binatang itu secara khusus padahal Dia adalah Rabb pemilik segala sesuatu adalah karena binatang tersebut disembah di masa jahiliyah. Allah memberitahukan bahwa jenis binatang yang disembah orang-orang musyrik itu dimiliki, diatur, dan diciptakan, lantas bagaimana bisa dijadikan sesembahan bersama Allah?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 49: 45-49. Allah menjelaskan bahwa Dialah yang menciptakan laki-laki dan perempuan dan mewujudkan keduanya dari ketiadaan. Dan Allah menjelaskan bahwa Dialah yang menjadikan keduanya laki dan perempuan (manusia, hewan, dan jin) dari air mani yang dicurahkan ke dalam rahim dan tersembur ke dalamnya. Allah menjelaskan bahwa Dialah yang mengembalikan ciptaan-Nya untuk kedua kalinya pada hari kebangkitan; Agar untuk dibalas dengan apa yang berhak bagi mereka. Allah menjelaskan bahwa Dia Maha Kaya atas segala sesuatu dari hamba-Nya, dan menjadikan miskin bagi siapa yang dikehendaki oleh-Nya di antara mereka. Allah menjelaskan bahwa Dialah Tuhan bintang syi’ra yang telah dikenal, ia adalah bintang yang diibadahi pada masa jahiliyyah selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bintang Syi'ra ialah bintang yang disembah oleh orang-orang Arab pada masa jahiliyah. Allah Subhaanahu wa Ta'aala menerangkan, bahwa apa yang disembah kaum musyrikin itu diatur Allah dan diciptakan-Nya. Oleh karena itu, mengapa ia dijadikan sesembahan selain Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 49",
    "description": "Dan selain itu, dalam kedua suhuf itu juga disebutkan bahwa sesungguhnya dialah tuhan yang menciptakan, memiliki, dan mengendalikan bintang syi'ra, bintang sembahan orang arab pada masa jahiliah. 50-51. Setelah menjelaskan ajaran dan tuntunan Allah dalam suhuf nabi ibrahim dan musa, pada ayat ini Allah menyebut azab yang telah ditimpakan-Nya kepada umat-umat masa lalu. Dan diterangkan bahwa sesungguhnya dialah yang telah membinasakan umat nabi hud, yakni kaum 'ad pada zaman dahulu kala, dan Allah pula yang telah membinasakan kaum samud, umat nabi saleh. Karena kafir, mereka semua dibinasakan dan tidak seorang pun yang ditinggalkan-Nya dalam keadaan hidup."
  }
]