[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-11. Yang mengajari Muhammad adalah malaikat yang mempunyai kekuatan besar, pemilik penampilan yang baik, yaitu Jibril, yang duduk dan Nampak terlihat oleh Rasulullah dalam wujud aslinya di ufuk tertinggi, yaitu ufuk matahari saat ia terbit, kemudian Jibril mendekat kepada Rasulullah, dia semakin mendekat, sehingga kedekatannya sedekat dua busur panah atau lebih dekat lagi. Lalu Allah mewahyukan kepada hambaNya, Muhammad apa yang Dia wahyukan melalui Jibril. Hati Muhammad tidak mendustakan apa yang dia lihat dan saksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Diajarkan kepadanya oleh Malaikat yang sangat kuat, yaitu Jibril -'alaihissalām-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. عَلَّمَهُۥ شَدِيدُ الْقُوَىٰ (yang diajarkan kepadanya oleh (Jibril) yang sangat kuat) Yakni dia diajari oleh Jibril yang memiliki kekuatan yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dia diajar oleh Jibril yang sangat kuat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang diajarkan kepadanya oleh (malaikat) yang sangat kuat} malaikat yang sangat kuat yaitu Jibril AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Selanjutnya Allah memberitahu malaikat yang menyampaikan kepada Rasulullah, yaitu malaikat Jibril, yang merupakan malaikat paling utama, kuat, dan sempurna. Allah berfirman, “Ia diajari oleh (Jibril) yang sangat kuat,” artinya, turun membawa wahyu untuk Rasulullah, yang sangat kuat, baik secara lahir maupun batin, kuat untuk melaksanakan perintah Allah, kuat untuk menyampaikan wahyu kepada Rasulullah, serta menjaganya dari pencurian setan atau menjaga agar setan tidak memasukkan sesuatu ke dalam wahyu, dan inilah cara Allah menjaga wahyuNya yang diturunkan bersama malaikat kuat lagi terpecaya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 5: 5-9. Allah mengabarkan bahwa yang mengajarkan Al Qur’an ini kepada Muhammad adalah Jibril yang di antara sifatnya adalah sangat kuat, yang memiliki pandangan yang baik, dan yang nampak dan berada di atas (ufuk langit) dalam bentuk yang hakiki (asli), sebagaimana betuk asli yang Allah ciptakan. Dia di atas langit, dan langit penuh karena besarnya dirinya, ini adalah ru’yah awal dari Nabi ﷺ. Kemudian Jibril mendekat kepada Nabi ﷺ di gua hira, dan semakin mendekat hingga berjarak dua busur panah atau lebih dekat daripada itu kepada Nabi ﷺ, akan tetapi dalam bentuk manusia; Sebab ketika dalam bentuk (asli) di ufuk langit, tidak terbayang bisa masuk ke dalam gua hira. Dan malaikat memiliki kemampuan merubah dirinya dalam bentuk manusia, sebagaimana dilakukan oleh para malaikat yang diberikan tugas untuk membinasakan kaum Luth, ketika Nabi Ibrahim berziarah (menuju kaum Luth) bersama para malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan yang mengajarkan Rasulullah shallallahu 'alaihi wa sallam, yaitu malaikat Jibril ‘alaihis salam; malaikat yang paling utama, paling mulia, paling kuat dan paling sempurna. Yakni sangat kuat fisik maupun batinnya, kuat melaksanakan perintah Allah, kuat menyampaikan wahyu kepada Rasulullah shallallahu 'alaihi wa sallam dan kuat menjaganya dari disentuh oleh setan serta dimasukkan oleh setan sesuatu yang bukan darinya. Hal ini juga termasuk penjagaan Allah Subhaanahu wa Ta'aala terhadap wahyu-Nya, yaitu dengan mengutus malaikat yang kuat lagi amanah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 5",
    "description": "5-6. Wahyu yang diterimanya diajarkan kepadanya oleh jibril, malaikat yang sangat kuat, yang mempunyai keteguhan sangat hebat; maka ia menampakkan diri kepada nabi Muhammad dengan rupa yang asli, yakni bagus dan perkasa"
  }
]