[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-54. Dan bahwasanya Allah membinasakan Ad yang pertama, yaitu kaum Hud, dan juga membinasakan Tsamud, yaitu kaum Shaleh, juga tidak menyisakan seorang pun dari mereka, dan sebelum mereka, Allah membinasakan kaum Nuh; mereka itu lebih Bengal dan lebih kafir dari orang-orang yang datang sesudah mereka. Kota kaum Luth dibalik oleh Allah, Allah menjadikan bagian atasnya menjadi bagian bawah, lalu Allah menumpahkan apa yang Dia tumpahkan, yaitu bebatuan yang turun terus-menerus seperti hujan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan bahwasanya Dia telah menghancurkan kaum 'Ād yang pertama, mereka adalah kaum nabi Hūd tatkala mereka tetap pada kekufuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50-54. Dan Dia yang menghancurkan kaum ‘Ad yang merupakan kaum Nabi Hud, dan yang membinasakan kaum Tsamud yang merupakan kaum Nabi Shalih; sehingga tidak ada seorangpun dari mereka yang tersisa. Dan Dia yang membinasakan kaum Nabi Nuh sebelum kebinasaan kaum ‘Ad dan Tsamud, mereka adalah kaum yang lebih kuat dan lebih jahat daripada kaum setelah mereka. Dan Dia yang membinasakan penduduk negeri Madyan yang merupakan kaum Nabi Luth, dengan menjadikan negeri itu terbalik, sehingga penduduknya tertimpa berbagai azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَأَنَّهُۥٓ أَهْلَكَ عَادًا الْأُولَىٰ (dan bahwasanya Dia telah membinasakan kaum ‘Aad yang pertama) Yakni kaum yang pertama dibinasakan setelah kaum Nuh. Pendapat lain mengatakan bahwa ‘Aad yang pertama adalah kaum Nabi Huud, sedangkan ‘Aad yang kedua adalah kaum Tsamud/Iram."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Sesungguhnya Allah SWT menghancurkan kaum ‘Aad yang pertama, yaitu kaum nabi Hud. Itulah umat pertama yang dihancurkan setelah umat nabi Nuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sesungguhnya Dialah yang telah membinasakan kaum ‘Ad yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Dan bahwasanya Dia telah membinasakan kaum ‘Ad yang pertama,” mereka adalah kaum nabi Hud yang dibinasakan ketika mendustakan Hud dengan angin ribut dan kencang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 50: 50-55. Allah mengabarkan bahwa Dialah yang membinasakan umat-umat yang mendustakan para Nabi mereka, maka Dia membinasakan Ad, kaum Hud, Tsamud, dan kaum Shalih. Allah binasakan mereka semua dan tidak menyisakan satupun di antara mereka. Dan Allah membinasakan sebelum kaum Tsamud, yaitu kaum Nuh; Dan Allah tenggelamkan dengan banjir bandang. Sungguh mereka adalah kebanyakan dari kaum yang melanggar aturan-aturan Allah, dan kebanyakan adalah mengagungkan kesyirikan dan mendustakan (kerisalahan). Itulah yang Allah binasakan dari penduduk suatu negeri, yaitu (juga) negeri-negeri kaum Luth, Allah memerintahkan Jibril untuk mengangat tinggi negeri tersebut, kemudian dibalikkan dan dijatuhkan ke tanah, maka dijadikanlah bawah mereka menjadi atas mereka. Kemudian Allah menimpakan adzab yaitu batu yang ditimpakan kepada mereka, dan mengadzab dengan berbagai adzab pedih yang tidak mungkin untuk disifati secara sempurna, tidak juga menyelamatkan atas umat-umat yang telah disebutkan, kecuali bagi Rasul-Rasul mereka dan yang beriman kepada Allah. Allah menyebutkan manusia yang dengan nikmatnya Allah berikan kepada mereka. Allah juga menjelaskan bahwa nikmat dari Allah dan pemberian-Nya adalah sangat besar, sempurna dan lain-lain. Maka dari itu dengan apalagi wahai manusia kalian bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka (kaum ‘Aad) mendustakan Nabi Hud ‘alaihis salam, maka Allah membinasakan mereka dengan angin yang sangat dingin lagi sangat kencang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 50",
    "description": "50-51. Setelah menjelaskan ajaran dan tuntunan Allah dalam suhuf nabi ibrahim dan musa, pada ayat ini Allah menyebut azab yang telah ditimpakan-Nya kepada umat-umat masa lalu. Dan diterangkan bahwa sesungguhnya dialah yang telah membinasakan umat nabi hud, yakni kaum 'ad pada zaman dahulu kala, dan Allah pula yang telah membinasakan kaum samud, umat nabi saleh. Karena kafir, mereka semua dibinasakan dan tidak seorang pun yang ditinggalkan-Nya dalam keadaan hidup"
  }
]