[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-54. Dan bahwasanya Allah membinasakan Ad yang pertama, yaitu kaum Hud, dan juga membinasakan Tsamud, yaitu kaum Shaleh, juga tidak menyisakan seorang pun dari mereka, dan sebelum mereka, Allah membinasakan kaum Nuh; mereka itu lebih Bengal dan lebih kafir dari orang-orang yang datang sesudah mereka. Kota kaum Luth dibalik oleh Allah, Allah menjadikan bagian atasnya menjadi bagian bawah, lalu Allah menumpahkan apa yang Dia tumpahkan, yaitu bebatuan yang turun terus-menerus seperti hujan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan menghancurkan Ṡamūd, kaum Nabi Ṡāleḥ, sehingga Dia tidak menyisakan seorangpun dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَثَمُودَا۟ فَمَآ أَبْقَىٰ (dan kaum Tsamud. Maka tidak seorangpun yang ditinggalkan-Nya (hidup)) Yakni Allah membinaskan kaum Tsamud sebagaimana telah membinasakan kaum ‘Aad, sehingga tidak ada yang tersisa satupun dari kaum Tsamud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Dan menghancurkan kaum Tsamud, yaitu kaum nabi Shalih. Dia tidak menyisakan satupun orang dari kaum itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kaum Tsamud. Sehingga tidak ada yang Dia sisakan} sehingga tidak ada seorang pun yang tersisa dari mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan kaum Tsamud,” kaum nabi Shaleh, dimana beliau diutus Allah untuk kaum Tsamud kemudian mereka mendustakan beliau, kemudian Allah mengirimkan unta pada mereka sebagai tanda kebesaran Allah, mereka pun menyembelihnya dan mendustakannya kemudian Allah membinasakan mereka. “Maka tidak seorang pun yang ditinggalkanNya (hidup),” tidak seorang pun yang tersisa, semuanya dibinasakan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 51: 50-55. Allah mengabarkan bahwa Dialah yang membinasakan umat-umat yang mendustakan para Nabi mereka, maka Dia membinasakan Ad, kaum Hud, Tsamud, dan kaum Shalih. Allah binasakan mereka semua dan tidak menyisakan satupun di antara mereka. Dan Allah membinasakan sebelum kaum Tsamud, yaitu kaum Nuh; Dan Allah tenggelamkan dengan banjir bandang. Sungguh mereka adalah kebanyakan dari kaum yang melanggar aturan-aturan Allah, dan kebanyakan adalah mengagungkan kesyirikan dan mendustakan (kerisalahan). Itulah yang Allah binasakan dari penduduk suatu negeri, yaitu (juga) negeri-negeri kaum Luth, Allah memerintahkan Jibril untuk mengangat tinggi negeri tersebut, kemudian dibalikkan dan dijatuhkan ke tanah, maka dijadikanlah bawah mereka menjadi atas mereka. Kemudian Allah menimpakan adzab yaitu batu yang ditimpakan kepada mereka, dan mengadzab dengan berbagai adzab pedih yang tidak mungkin untuk disifati secara sempurna, tidak juga menyelamatkan atas umat-umat yang telah disebutkan, kecuali bagi Rasul-Rasul mereka dan yang beriman kepada Allah. Allah menyebutkan manusia yang dengan nikmatnya Allah berikan kepada mereka. Allah juga menjelaskan bahwa nikmat dari Allah dan pemberian-Nya adalah sangat besar, sempurna dan lain-lain. Maka dari itu dengan apalagi wahai manusia kalian bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika Allah Subhaanahu wa Ta'aala mengutus Nabi Shalih ‘alaihis salam kepada mereka, maka mereka mendustakannya, lalu Allah Subhaanahu wa Ta'aala mendatangkan mukjizat kepada Beliau berupa unta betina, tetapi mereka malah membunuhnya, maka Allah Subhaanahu wa Ta'aala juga membinasakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 51",
    "description": "50-51. Setelah menjelaskan ajaran dan tuntunan Allah dalam suhuf nabi ibrahim dan musa, pada ayat ini Allah menyebut azab yang telah ditimpakan-Nya kepada umat-umat masa lalu. Dan diterangkan bahwa sesungguhnya dialah yang telah membinasakan umat nabi hud, yakni kaum 'ad pada zaman dahulu kala, dan Allah pula yang telah membinasakan kaum samud, umat nabi saleh. Karena kafir, mereka semua dibinasakan dan tidak seorang pun yang ditinggalkan-Nya dalam keadaan hidup. 52. Dan karena keingkarannya pula kaum nabi nuh dibinasakan sebelum itu. Sungguh, mereka adalah orang-orang yang paling zalim dan paling durhaka dibanding kedua umat sebelumnya, 'ad dan samud."
  }
]