[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-54. Dan bahwasanya Allah membinasakan Ad yang pertama, yaitu kaum Hud, dan juga membinasakan Tsamud, yaitu kaum Shaleh, juga tidak menyisakan seorang pun dari mereka, dan sebelum mereka, Allah membinasakan kaum Nuh; mereka itu lebih Bengal dan lebih kafir dari orang-orang yang datang sesudah mereka. Kota kaum Luth dibalik oleh Allah, Allah menjadikan bagian atasnya menjadi bagian bawah, lalu Allah menumpahkan apa yang Dia tumpahkan, yaitu bebatuan yang turun terus-menerus seperti hujan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan menghancurkan kaum Nabi Nūḥ sebelum kaum 'Ād dan Ṡamūd, sesungguhnya kaum Nabi Nūḥ lebih zalim dan lebih melampaui batas dari kaum 'Ād dan Ṡamūd, karena Nūḥ tinggal bersama kaumnya selama seribu tahun kurang lima puluh tahun, menyeru mereka untuk mentauhidkan Allah, akan tetapi mereka tidak mengindahkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Dia juga menghancurkan kaum Nuh sebelum menghancurkan kaum ‘Aad dan Tsamud. Sesungguhnya kaum ‘Aad dan Tsamud itu sangat zalim dan sewenang-wenang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan kaum Nuh sebelum itu. Sesungguhnya mereka adalah orang-orang yang lebih zalim dan lebih durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Dan kaum Nuh sebelum itu. Sesungguhnya mereka adalah orang-orang yang paling zhalim dan paling durhaka,” dari umat-umat itu, tetapi Allah membinasakan dan menenggelamkan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 52: 50-55. Allah mengabarkan bahwa Dialah yang membinasakan umat-umat yang mendustakan para Nabi mereka, maka Dia membinasakan Ad, kaum Hud, Tsamud, dan kaum Shalih. Allah binasakan mereka semua dan tidak menyisakan satupun di antara mereka. Dan Allah membinasakan sebelum kaum Tsamud, yaitu kaum Nuh; Dan Allah tenggelamkan dengan banjir bandang. Sungguh mereka adalah kebanyakan dari kaum yang melanggar aturan-aturan Allah, dan kebanyakan adalah mengagungkan kesyirikan dan mendustakan (kerisalahan). Itulah yang Allah binasakan dari penduduk suatu negeri, yaitu (juga) negeri-negeri kaum Luth, Allah memerintahkan Jibril untuk mengangat tinggi negeri tersebut, kemudian dibalikkan dan dijatuhkan ke tanah, maka dijadikanlah bawah mereka menjadi atas mereka. Kemudian Allah menimpakan adzab yaitu batu yang ditimpakan kepada mereka, dan mengadzab dengan berbagai adzab pedih yang tidak mungkin untuk disifati secara sempurna, tidak juga menyelamatkan atas umat-umat yang telah disebutkan, kecuali bagi Rasul-Rasul mereka dan yang beriman kepada Allah. Allah menyebutkan manusia yang dengan nikmatnya Allah berikan kepada mereka. Allah juga menjelaskan bahwa nikmat dari Allah dan pemberian-Nya adalah sangat besar, sempurna dan lain-lain. Maka dari itu dengan apalagi wahai manusia kalian bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sebelum kaum ‘Aad dan Tsamud, Dia juga membinasakan mereka. Yakni daripada kaum ‘Aad dan Tsamud, karena Nabi Nuh ‘alaihis salam tinggal di tengah-tengah mereka selama 950 tahun, namun mereka tidak juga beriman, ditambah lagi dengan menyakiti Beliau baik dengan ucapan maupun dengan perbuatan, maka Allah Subhaanahu wa Ta'aala membinasakan mereka dan menenggelamkan mereka dalam banjir besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 52",
    "description": "Dan karena keingkarannya pula kaum nabi nuh dibinasakan sebelum itu. Sungguh, mereka adalah orang-orang yang paling zalim dan paling durhaka dibanding kedua umat sebelumnya, 'ad dan samud. 53-54. Itulah kisah umat yang durhaka kepada nabinya, dan selain mereka hukuman Allah yang berupa prahara angin telah meruntuhkan negeri kaum nabi lut yang ingkar dan menolak ajarannya, lalu dengan angin tersebut Allah menimbuni negeri itu dengan puing-puing dan bebatuan yang menimpanya."
  }
]