[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "50-54. Dan bahwasanya Allah membinasakan Ad yang pertama, yaitu kaum Hud, dan juga membinasakan Tsamud, yaitu kaum Shaleh, juga tidak menyisakan seorang pun dari mereka, dan sebelum mereka, Allah membinasakan kaum Nuh; mereka itu lebih Bengal dan lebih kafir dari orang-orang yang datang sesudah mereka. Kota kaum Luth dibalik oleh Allah, Allah menjadikan bagian atasnya menjadi bagian bawah, lalu Allah menumpahkan apa yang Dia tumpahkan, yaitu bebatuan yang turun terus-menerus seperti hujan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan negeri-negeri kaum Lūṭ, diangkat oleh Allah ke langit kemudian dijatuhkan kembali ke bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَالْمُؤْتَفِكَةَ أَهْوَىٰ (dan negeri-negeri kaum Luth yang telah dihancurkan Allah) Makna (المؤتفكة) adalah negeri-negeri yang dihuni kaum Luth; dinamakan dengan (المؤتفكة) karena negeri-negeri itu dibalik, bagian bawahnya dibalik menjadi bagian atasnya, dan Jibril membanting negeri-negeri itu setelah mengangkatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Dia juga menghancurkan Mu’tafikah, yaitu negeri kaum Luth. Daerah itu dinamakan seperti itu karena negeri itu dibalik orang mereka sehingga sesuatu yang seharusnya diletakkan di tempat tinggi ke tempat yang rendah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lebih durhaka kepada Allah {dan meruntuhkan} menjatuhkan setelah diangkat ke langit {negeri yang dijungkir balikkan} negeri kaum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53-54. “Dan negeri-negeri kaum Luth,” mereka adalah kaum Nabi Luth, “yang telah dihancurkan Allah.” Allah menimpakan azab yang belum pernah ditimpakan pada seorang pun dari seluruh alam, bumi mereka dibalik, yang atas dijadikan bawah dan yang bawah dijadikan atas, mereka dihujani batu dari neraka, karena itu Allah berfirman, “Lalu Allah menimpakan atas negeri itu azab besar yang menimpanya,” yaitu ditimpa azab pedih dan berat, sesuatu yang besar dan tidak mungkin bisa digambarkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 53: 50-55. Allah mengabarkan bahwa Dialah yang membinasakan umat-umat yang mendustakan para Nabi mereka, maka Dia membinasakan Ad, kaum Hud, Tsamud, dan kaum Shalih. Allah binasakan mereka semua dan tidak menyisakan satupun di antara mereka. Dan Allah membinasakan sebelum kaum Tsamud, yaitu kaum Nuh; Dan Allah tenggelamkan dengan banjir bandang. Sungguh mereka adalah kebanyakan dari kaum yang melanggar aturan-aturan Allah, dan kebanyakan adalah mengagungkan kesyirikan dan mendustakan (kerisalahan). Itulah yang Allah binasakan dari penduduk suatu negeri, yaitu (juga) negeri-negeri kaum Luth, Allah memerintahkan Jibril untuk mengangat tinggi negeri tersebut, kemudian dibalikkan dan dijatuhkan ke tanah, maka dijadikanlah bawah mereka menjadi atas mereka. Kemudian Allah menimpakan adzab yaitu batu yang ditimpakan kepada mereka, dan mengadzab dengan berbagai adzab pedih yang tidak mungkin untuk disifati secara sempurna, tidak juga menyelamatkan atas umat-umat yang telah disebutkan, kecuali bagi Rasul-Rasul mereka dan yang beriman kepada Allah. Allah menyebutkan manusia yang dengan nikmatnya Allah berikan kepada mereka. Allah juga menjelaskan bahwa nikmat dari Allah dan pemberian-Nya adalah sangat besar, sempurna dan lain-lain. Maka dari itu dengan apalagi wahai manusia kalian bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni telah dijatuhkan-Nya dalam keadaan terbalik setelah diangkat ke atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 53",
    "description": "53-54. Itulah kisah umat yang durhaka kepada nabinya, dan selain mereka hukuman Allah yang berupa prahara angin telah meruntuhkan negeri kaum nabi lut yang ingkar dan menolak ajarannya, lalu dengan angin tersebut Allah menimbuni negeri itu dengan puing-puing dan bebatuan yang menimpanya"
  }
]