[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55. Maka nikmat Tuhanmu yang manakah (wahai manusia yang mendustakan) yang kamu ragukan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Maka dengan bukti-bukti Rabbmu yang menunjukkan kekuasaan-Nya yang mana kamu menentang wahai manusia sehingga kamu tidak mengambil pelajaran darinya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Maka kenikmatan dari Allah yang mana yang kamu ragukan dan kamu sangkal?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَبِأَىِّ ءَالَآءِ رَبِّكَ تَتَمَارَىٰ (Maka terhadap nikmat Tuhanmu yang manakah kamu ragu-ragu?) Yakni kenikmatan dari Tuhanmu yang kamu ragukan hai manusia yang mendustakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Maka nikmat Tuhan manakah yang kamu ragukan wahai manusia pendusta?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Dia menutup negeri itu dengan bebatuan yang meutupinya {Maka nikmat Tuhanmu yang mana} nikmat Tuhanmu {yang masih kamu ragukan} yang kamu ragukan dan kamu bantah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Maka terhadap nikmat Rabbmu yang manakah kamu ragu-ragu,” artinya nikmat dan karunia Allah yang mana yang kalian ragukan wahai manusia? Nikmat-nikmat Allah itu nyata dan tidak diragukan dari berbagai sisi. Tidak ada satu nikmat pun yang dimiliki seorang hamba melainkan berasal dari Allah dan tidak ada yang menolak siksa kecuali Allah semata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 55: 50-55. Allah mengabarkan bahwa Dialah yang membinasakan umat-umat yang mendustakan para Nabi mereka, maka Dia membinasakan Ad, kaum Hud, Tsamud, dan kaum Shalih. Allah binasakan mereka semua dan tidak menyisakan satupun di antara mereka. Dan Allah membinasakan sebelum kaum Tsamud, yaitu kaum Nuh; Dan Allah tenggelamkan dengan banjir bandang. Sungguh mereka adalah kebanyakan dari kaum yang melanggar aturan-aturan Allah, dan kebanyakan adalah mengagungkan kesyirikan dan mendustakan (kerisalahan). Itulah yang Allah binasakan dari penduduk suatu negeri, yaitu (juga) negeri-negeri kaum Luth, Allah memerintahkan Jibril untuk mengangat tinggi negeri tersebut, kemudian dibalikkan dan dijatuhkan ke tanah, maka dijadikanlah bawah mereka menjadi atas mereka. Kemudian Allah menimpakan adzab yaitu batu yang ditimpakan kepada mereka, dan mengadzab dengan berbagai adzab pedih yang tidak mungkin untuk disifati secara sempurna, tidak juga menyelamatkan atas umat-umat yang telah disebutkan, kecuali bagi Rasul-Rasul mereka dan yang beriman kepada Allah. Allah menyebutkan manusia yang dengan nikmatnya Allah berikan kepada mereka. Allah juga menjelaskan bahwa nikmat dari Allah dan pemberian-Nya adalah sangat besar, sempurna dan lain-lain. Maka dari itu dengan apalagi wahai manusia kalian bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, nikmat dan karunia Allah yang mana wahai manusia yang kamu ragukan? Karena nikmat Allah jelas bagimu dan tidak diragukan lagi, dimana tidak ada satu pun nikmat kecuali dari-Nya dan tidak ada yang menghindarkan bencana kecuali Dia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 55",
    "description": "Kehancuran umat-umat pengingkar pada masa lalu merupakan peringatan dari Allah untuk generasi sekarang dan mendatang. Merupakan salah satu bentuk nikmat-Nya bagaimana umat pada masa kini dapat mengambil pelajaran dan lebih berhati-hati dalam kehidupannya. Wahai manusia, jika umat-umat itu mendapat hukuman karena keingkaran mereka, maka terhadap nikmat tuhanmu yang manakah yang masih kamu ragukan sehingga kamu mengingkarinya'56. Wahai manusia, nabi Muhammad ini adalah salah seorang pemberi peringatan yang diamanati untuk mengingatkan kamu dan ia termasuk di antara para pemberi peringatan yang telah terdahulu."
  }
]