[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56. Ini, Muhammad adalah pemberi peringatan dengan kebenaran yang dengannya para nabi sebelumnya juga memberikan peringatan, dan dia bukan rasul pertama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Ini adalah seorang Rasul yang diutus kepada kalian dari jenis rasul-rasul yang terdahulu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-58. Al-Qur’an yang didatangkan Nabi Muhammad ini merupakan peringatan bagi kalian agar kalian tidak tertimpa apa yang telah menimpa umat-umat yang mendustakan para rasul dari Tuhan mereka. Telah dekat waktu kedatangan hari kiamat, tidak ada yang dapat mencegahnya kecuali Allah Semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. هٰذَا نَذِيرٌ مِّنَ النُّذُرِ الْأُولَىٰٓ (Ini (Muhammad) adalah seorang pemberi peringatan di antara pemberi-pemberi peringatan yang terdahulu) Yakni Muhammad ini adalah seorang Rasul yang diutus kepada kalian sebagaimana para rasul sebelumnya, dia memberi kalian peringatakan seperti para rasul itu memperingatkan kaum mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Al-Quran dan Rasul ini adalah pengingat azab Allah sebagaimana rasul-rasul sebelumnya. Sesungguhnya dia memperingatkan kalian sebagaimana rasul-rasul sebelumnya memberi peringatan pada kaumnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ini adalah salah seorang pemberi peringatan di antara para pemberi peringatan yang terdahulu} Nabi Muhammad ini adalah rasul di antara para rasul yang terdahulu sebelumnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. “Ini (Muhammad) adalah seorang pemberi peringatan di antara pemberi-pemberi peringatan yang telah terdahulu.” Artinya, rasul dari kaum Quraisy marga Hasyim, Muhammad bin Abdullah ini bukan rasul pertama, tapi sebelumnya telah ada para rasul. Mereka sama menyerukan dakwah yang diserukan oleh Muhammad bin Abdullah, lantas mengapa kalian mengingkari risalah yang dibawanya? Bukankah Muhammad bin Abdullah telah datang membawa al-Quran yang tidakl terdapat kebatilan di depan dan di belakangnya, diturunkan dari Allah Yang Mahabijaksana bdan Terpuji? Bukankah Allah telah membinasakan orang yang mendustakan rasul-rasul sebelumnya? Lantas apa kiranya yang bisa menghalangi siksaan untuk orang-orang yang mendustakan Nabi Muhammad, pemimpin para rasul, imam orang-orang yang bertakwa, dan pemimpin penghuni syurga yang wajahnya bercahaya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 56: 56-58. Ketahuilah wahai manusia bahwasanya Muhammad ﷺ adalah utusan yang diutus Allah sebagaimana diutusnya Nabi yang mereka semua Allah kirimkan untuk manusia. Allah menjelaskan bahwa zaman telah tiba masanya (kiamat), dan tidak ada yang menahannya selain Allah, sebagaimana tidak mengetahui waktu terjadinya satupun di antar manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Muhammad shallallahu 'alaihi wa sallam bukanlah rasul yang baru, bahkan sebelumnya telah didahului oleh rasul-rasul, dimana dakwah mereka sama seperti yang didakwahkan Beliau. Oleh karena itu, atas dasar apa kamu mengingkari risalahnya dan menolak dakwahnya? Bukankah akhlaknya adalah akhlak yang paling mulia dan bukankah seruannya adalah seruan kepada setiap kebaikan dan larangan terhadap semua keburukan? Bukankah dia telah datang membawa Al Qur’an yang tidak dimasuki kebatilan baik dari depan maupun belakang? Bukankah Allah Subhaanahu wa Ta'aala telah membinasakan orang-orang yang mendustakan para rasul yang diutus sebelumnya? Dengan demikian, apa yang menghalangi azab turun menimpa orang-orang yang mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam pemimpin para rasul dan imam orang-orang yang bertakwa?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 56",
    "description": "Wahai manusia, nabi Muhammad ini adalah salah seorang pemberi peringatan yang diamanati untuk mengingatkan kamu dan ia termasuk di antara para pemberi peringatan yang telah terdahulu. 57-58. Di antara peringatan nabi Muhammad adalah kepastian akan datangnya hari kiamat yang semakin hari semakin dekat. Sesuatu yang dekat, yaitu hari kiamat, kedatangannya telah makin mendekat dan tidak ada seorang pun yang akan dapat mengungkapkan kapan hari itu tiba, selain Allah yang telah menetapkannya sejak zaman azali."
  }
]