[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57-58. Hari Kiamat sudah dekat, waktunya tidak lama lagi, tidak ada seorang pun yang dapat menolaknya selain Allah. Dan tidak ada yang mengetahui waktunya kecuali Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Tidak ada penahan yang bisa menahannya dan tidak ada yang tahu kejadiannya selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. لَيْسَ لَهَا مِن دُونِ اللهِ كَاشِفَةٌ (Tidak ada yang akan menyatakan terjadinya hari itu selain Allah) Yakni tidak ada yang mampu menghilangkan kengerian hari kiamat selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58-59. Tidak ada yang mampu mencegah kejadiannya. Apakah Al-Quran ini mengejutkan keingkaran dan pendustaan kalian padanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang akan dapat mengungkapkan selain Allah} orang yang bisa menolak dan menyingkap pengetahuan tentang itu selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “Tidak ada yang akan menyatakan terjadinya hari itu selain Allah,” yaitu ketika kiamat datang dan siksaan yang dijanjikan tiba. Kemudian Allah mengancam mereka yang mengingkari risalah Nabi Muhammad dan mendustakan al-Quran seraya berfirman,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 58: 56-58. Ketahuilah wahai manusia bahwasanya Muhammad ﷺ adalah utusan yang diutus Allah sebagaimana diutusnya Nabi yang mereka semua Allah kirimkan untuk manusia. Allah menjelaskan bahwa zaman telah tiba masanya (kiamat), dan tidak ada yang menahannya selain Allah, sebagaimana tidak mengetahui waktu terjadinya satupun di antar manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 58",
    "description": "57-58. Di antara peringatan nabi Muhammad adalah kepastian akan datangnya hari kiamat yang semakin hari semakin dekat. Sesuatu yang dekat, yaitu hari kiamat, kedatangannya telah makin mendekat dan tidak ada seorang pun yang akan dapat mengungkapkan kapan hari itu tiba, selain Allah yang telah menetapkannya sejak zaman azali. 59-60. Wahai kaum kafir, bila kiamat memang akan datang, maka apakah kamu masih merasa heran terhadap pemberitaan ini, lalu menolak kebenarannya' dan tidak hanya menolaknya, kamu bahkan terus menertawakan berita ini dan tidak menangis sebagaimana orang yang sepenuhnya percaya dan takut karena merasa belum cukup bekal untuk menghadapi hari itu."
  }
]