[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-11. Yang mengajari Muhammad adalah malaikat yang mempunyai kekuatan besar, pemilik penampilan yang baik, yaitu Jibril, yang duduk dan Nampak terlihat oleh Rasulullah dalam wujud aslinya di ufuk tertinggi, yaitu ufuk matahari saat ia terbit, kemudian Jibril mendekat kepada Rasulullah, dia semakin mendekat, sehingga kedekatannya sedekat dua busur panah atau lebih dekat lagi. Lalu Allah mewahyukan kepada hambaNya, Muhammad apa yang Dia wahyukan melalui Jibril. Hati Muhammad tidak mendustakan apa yang dia lihat dan saksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Jibril -'alaihissalām- mempunyai bentuk yang sempurna. Ia menampakkan diri di hadapan Nabi -ṣallallāhu 'alaihi wa sallam- dalam bentuk aslinya yang diciptakan oleh Allah untuknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. ذُو مِرَّةٍ (yang mempunyai akal yang cerdas) Makna (المرة) yakni kekuatan dan tubuh yang kekar. Pendapat lain mengatakan maknanya adalah memiliki akal yang kuat. فَاسْتَوَىٰ (dan (Jibril itu) menampakkan diri dengan rupa yang asli) Yakni Jibril menampakkan rupa aslinya ketika pertama kali mendatangi Rasulullah untuk menyampaikan wahyu, tubuhnya yang besar menutupi seluruh ufuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Yang sangat kuat di antara para makhluk, atau memiliki akal yang cerdas dan pandangan yang tajam. Kemudian Jibril menunjukkan wujud aslinya yang diciptakan oleh Allah SWT saat dia mendatangi nabi SAW dengan membawa wahyu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{lagi mempunyai keteguhan} memiliki pandangan yang baik {Lalu dia menampakkan diri dengan bentuk asli} lalu dia menampakkan dengan sempurna bentuk asli yang diciptakan oleh Allah SWT kepada Rasulullah SAW"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Yang mempunyai akal yang cerdas,” yakni memiliki kekuatan, akhlak yang baik, dan keelokan lahir batin, “dan dia menampakkan diri dengan rupa yang asli,” yakni Jibril"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 6: 5-9. Allah mengabarkan bahwa yang mengajarkan Al Qur’an ini kepada Muhammad adalah Jibril yang di antara sifatnya adalah sangat kuat, yang memiliki pandangan yang baik, dan yang nampak dan berada di atas (ufuk langit) dalam bentuk yang hakiki (asli), sebagaimana betuk asli yang Allah ciptakan. Dia di atas langit, dan langit penuh karena besarnya dirinya, ini adalah ru’yah awal dari Nabi ﷺ. Kemudian Jibril mendekat kepada Nabi ﷺ di gua hira, dan semakin mendekat hingga berjarak dua busur panah atau lebih dekat daripada itu kepada Nabi ﷺ, akan tetapi dalam bentuk manusia; Sebab ketika dalam bentuk (asli) di ufuk langit, tidak terbayang bisa masuk ke dalam gua hira. Dan malaikat memiliki kemampuan merubah dirinya dalam bentuk manusia, sebagaimana dilakukan oleh para malaikat yang diberikan tugas untuk membinasakan kaum Luth, ketika Nabi Ibrahim berziarah (menuju kaum Luth) bersama para malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang menafsirkan dengan ‘kekuatan’, dan dengan ‘fisik yang indah.’"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 6",
    "description": "5-6. Wahyu yang diterimanya diajarkan kepadanya oleh jibril, malaikat yang sangat kuat, yang mempunyai keteguhan sangat hebat; maka ia menampakkan diri kepada nabi Muhammad dengan rupa yang asli, yakni bagus dan perkasa. 7-8. Sedang dia, yaitu jibril, pada saat itu berada di ufuk langit yang tinggi. Kemudian dia mendekat ke arah nabi Muhammad, lalu turun sehingga bertambah dekat lagi."
  }
]