[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "59-62. Maka apakah kalian (wahai orang-orang Musyrik) heran terhadap kebenaran al-Quran ini dan kalian menertawakannya sebagai penghinaan dan perendahan, kalian tidak menangis karena takut terhadap ancamannya, kalian terus lalai dan berpaling darinya? Karena itu, bersujudlah kepada Allah, ikhlaskanlah ibadah hanya kepadaNya, dan serahkanlah segala urusan kalian kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Sementara kalian lalai darinya, tidak memperhatikannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَأَنتُمْ سٰمِدُونَ (Sedang kamu melengahkan(nya)?) Yakni kalian mengangkat kepala kalian dengan sombong. Pendapat lain mengatakan maknanya adalah melalaikannya dengan berbagai hal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60-61. Kalian tertawa mengejek, tidak menangis sedih atas apa yang kaiian lalaikan. Kalian adalah orang-orang yang paling lupa dan menolak sesuatu yang diperintahkan untuk kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kalian lengah} lengah lagi berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “Sedang kamu melengahkan (nya),” artinya kalian melalaikannya dan tidak merenungkannya. Ini dikarenakan sedikitnya akal dan agama kalian, sebbab andaikan kalian menyembah Allah dan mencari ridhaNya di segala kondisi, tentu kalian tidak seperti ini,sebuah kondisi yang dipandang rendah oleh orang-orang yang berakal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 61: 59-62. Allah mengingkari orang-orang musyrik dengan keheranan atas Al Qur’an dan celan-celaan mereka kepada Al Qur’an serta penolakan mereka. Mereka tertawa dengan sombong dan mengejek ketika mendengarnya. Sudah selayaknya mereka untuk menangisi dengan perasaan takut dari ancaman-Nya yang menanti mereka. Allah menjelaskan bahwa mereka meninggalkan kepedulian akan Al Qur’an ini, karena sebab mereka lalai karena kekayaan dan kesenagan mereka. Allah memerintahkan mereka orang-orang musyrik agar meninggalkan kekufuran dan kesesatan, dan agar mereka bersujud kepada Allah dengan memuliakan-Nya, dan mengibadahi-Nya dengan ikhlas dengan tauhid dan mengesakan-Nya dengan hanya beribadah kepada-Nya saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni lalai dan lengah dari mentadabburinya. Hal ini karena lemahnya akal dan agama mereka, kalau sekiranya mereka beribadah kepada Allah dan mencari keridhaan-Nya tentu mereka tidak seperti ini keadaannya, dimana keadaan tersebut adalah keadaan yang dibenci oleh orang-orang yang berakal. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Maka bersujudlah kepada Allah dan sembahlah (Dia).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 61",
    "description": "61-62. Wahai kaum kafir, saat sedang menertawakan berita tentang kiamat itu kamu berada dalam keadaan lengah dan lalai dari kedatangannya dan siksa di dalamnya. Maka, demi keselamatanmu bersujudlah kepada Allah, patuhi ajaran-Nya, dan sembahlah dia secara tulus, baik dengan ibadah yang diwajibkan maupun yang dianjurkan"
  }
]