[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-11. Yang mengajari Muhammad adalah malaikat yang mempunyai kekuatan besar, pemilik penampilan yang baik, yaitu Jibril, yang duduk dan Nampak terlihat oleh Rasulullah dalam wujud aslinya di ufuk tertinggi, yaitu ufuk matahari saat ia terbit, kemudian Jibril mendekat kepada Rasulullah, dia semakin mendekat, sehingga kedekatannya sedekat dua busur panah atau lebih dekat lagi. Lalu Allah mewahyukan kepada hambaNya, Muhammad apa yang Dia wahyukan melalui Jibril. Hati Muhammad tidak mendustakan apa yang dia lihat dan saksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan dia berada di ufuk yang tinggi dari langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Jibril berada di sudut langit yang tinggi. Maknanya yaitu sudut yang sangat tinggi untuk dilihat di langit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{ketika dia berada di ufuk yang tinggi} di ufuk matahari ketika terbit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Sedang dia berada di ufuk yang tinggi,” yaitu berada di ufuk langit di atas bumi, itulah tempat bersemayamnya ruh yang tidak bisa dicapai dan tidak mungkin bagi setan untuk sampai kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 7: 5-9. Allah mengabarkan bahwa yang mengajarkan Al Qur’an ini kepada Muhammad adalah Jibril yang di antara sifatnya adalah sangat kuat, yang memiliki pandangan yang baik, dan yang nampak dan berada di atas (ufuk langit) dalam bentuk yang hakiki (asli), sebagaimana betuk asli yang Allah ciptakan. Dia di atas langit, dan langit penuh karena besarnya dirinya, ini adalah ru’yah awal dari Nabi ﷺ. Kemudian Jibril mendekat kepada Nabi ﷺ di gua hira, dan semakin mendekat hingga berjarak dua busur panah atau lebih dekat daripada itu kepada Nabi ﷺ, akan tetapi dalam bentuk manusia; Sebab ketika dalam bentuk (asli) di ufuk langit, tidak terbayang bisa masuk ke dalam gua hira. Dan malaikat memiliki kemampuan merubah dirinya dalam bentuk manusia, sebagaimana dilakukan oleh para malaikat yang diberikan tugas untuk membinasakan kaum Luth, ketika Nabi Ibrahim berziarah (menuju kaum Luth) bersama para malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ufuk/ujung langit yang tinggi pula dari bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 7",
    "description": "7-8. Sedang dia, yaitu jibril, pada saat itu berada di ufuk langit yang tinggi. Kemudian dia mendekat ke arah nabi Muhammad, lalu turun sehingga bertambah dekat lagi"
  }
]