[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-11. Yang mengajari Muhammad adalah malaikat yang mempunyai kekuatan besar, pemilik penampilan yang baik, yaitu Jibril, yang duduk dan Nampak terlihat oleh Rasulullah dalam wujud aslinya di ufuk tertinggi, yaitu ufuk matahari saat ia terbit, kemudian Jibril mendekat kepada Rasulullah, dia semakin mendekat, sehingga kedekatannya sedekat dua busur panah atau lebih dekat lagi. Lalu Allah mewahyukan kepada hambaNya, Muhammad apa yang Dia wahyukan melalui Jibril. Hati Muhammad tidak mendustakan apa yang dia lihat dan saksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Jarak kedekatan antara Jibril dengan Nabi sekitar dua busur panah atau lebih dekat lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَكَانَ قَابَ قَوْسَيْنِ(maka jadilah dia dekat (pada Muhammad sejarak) dua ujung busur panah) Yakni berjarak dua busur panah. Makna (القاب) yakni jarak antara pegangan busur sampai ke ujungnya. Yakni jarak antara Jibril dengan Nabi Muhammad ketika itu adalah sekitar jarak dua busur panah. أَوْ أَدْنَىٰ( atau lebih dekat (lagi)) Atau kurang dari itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kedekatan Jibril dengan Nabi itu seumpama jarak dua ujung busur panah, yaitu dua lengan atau bahkan lebih dekat dari itu. Al-Qaabu artinya adalah jumlah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sehingga jaraknya dua busur panah} sehingga jaraknya dengan nabi Muhammad itu seukuran dua busur panah {atau lebih dekat} bahkan lebih dekat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Maka jadilah ia,” yakni, jarak dekatnya dengan Muhammad, “(sejarak) dua ujung busur panah,” yakni seukuran antara dua ujung busur panah, “atau lebih dekat (lagi),” artinya lebih dekat dari dua ujung busur panah. Ini menunjukkan sempurnanya penyampaian risalah kepada Rasulullah secara langsung, tidak ada perantara antara Rasulullah dengan malaikat Jibril."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Najm ayat 9: 5-9. Allah mengabarkan bahwa yang mengajarkan Al Qur’an ini kepada Muhammad adalah Jibril yang di antara sifatnya adalah sangat kuat, yang memiliki pandangan yang baik, dan yang nampak dan berada di atas (ufuk langit) dalam bentuk yang hakiki (asli), sebagaimana betuk asli yang Allah ciptakan. Dia di atas langit, dan langit penuh karena besarnya dirinya, ini adalah ru’yah awal dari Nabi ﷺ. Kemudian Jibril mendekat kepada Nabi ﷺ di gua hira, dan semakin mendekat hingga berjarak dua busur panah atau lebih dekat daripada itu kepada Nabi ﷺ, akan tetapi dalam bentuk manusia; Sebab ketika dalam bentuk (asli) di ufuk langit, tidak terbayang bisa masuk ke dalam gua hira. Dan malaikat memiliki kemampuan merubah dirinya dalam bentuk manusia, sebagaimana dilakukan oleh para malaikat yang diberikan tugas untuk membinasakan kaum Luth, ketika Nabi Ibrahim berziarah (menuju kaum Luth) bersama para malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini menunjukkan tidak ada lagi perantara antara malaikat Jibril ‘alaihis salam dengan Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Najm Ayat 9",
    "description": "Jibril semakin mendekat sehingga jaraknya dari nabi Muhammad sekitar dua busur panah atau bahkan lebih dekat lagi. 10. Lalu disampaikan oleh-Nya wahyu secara cepat dan rahasia kepada hamba-Nya, yaitu nabi Muhammad, apa yang telah diwahyukan oleh Allah."
  }
]