[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai orang yang berkemul dengan banjunya (maksudnya Nabi -ṣallallāhu 'alaihi wa sallam-)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-5. Surat ini dimulai dengan seruan kepada Nabi Muhammad: Wahai orang yang tertutup selimut, bangunlah dari tempat tidurmu untuk memberi peringatan kepada manusia, dan memberi kabar gembira dan pelajaran dengan risalah yang kamu terima; agungkanlah Tuhanmu semata yang telah menciptakan dan mengutusmu; bersihkanlah dirimu dari segala yang mengundang kemurkaan Allah, dan sucikanlah pakaianmu dari segala najis; jauhilah berhala dan patung-patung yang disembah dan diagungkan; serta jauhi segala perkataan dan perbuatan yang buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا الْمُدَّثِّرُ (Hai orang yang berkemul) Hai orang yang berselimut dengan bajunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Bukhari dari jabir bahwasannya beliau berkata: Awalnya yang diklaim sebagai ayat yang turun pertama kali adalah Ya ayyuhal muddatstsir, namun para ulama’ kemudian membantahnya. Sehingga ditetapkan bahwa ayat yang pertama kali turun adalah iqra’ bismi rabbika... 1. Wahai Nabi yang berselimut setelah menerima wahyu dari Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang yang berselimut} yang tertutup dengan pakaiannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Telah dijelaskan sebelumnya bahwa al-Muzammil dan al-Mudatsir maknanya sama. Allah memerintahkan RasulNya untuk bersungguh-sungguh dalam beribadah menyembah Allah dengan ibadah-ibadah pendek dan panjang. Dalam surat sebelumnya dijelaskan perintah Allah untuk ibadah-ibadah utama yang pendek pada RasulNya serta perintah bersabar terhadap gangguan kaumnya, dan dalam surat ini Allah memerintahkannya untuk memberitahukan seruannya dan tegas menyampaikan peringatan. Allah berfirman, “Bangunlah,” yakni dengan sungguh-sungguh dan giat, “lalu berilah peringatan” kepada manusia dengan perkataan dan perbuatan yang bisa menyampaikan pada tujuan serta menjelaskan kondisi apa-apa yang diperingatkan darinya agar hal itu lebih mendorong untuk ditinggalkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 1: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Yahya bin Abi Katsir, (ia berkata): Aku bertanya kepada Abu Salamah bin Abdurrahman tentang surah yang pertama turun dari Al Qur’an, ia menjawab, “Yaa ayyuhal muddatstsir.” Aku berkata, “Orang-orang mengatakan ‘Iqra’ bismirabbikalladzii khalaq’.” Abu Salamah menjawab, “Aku telah bertanya kepada Jabir bin Abdullah radhiyallahu 'anhuma tentang hal itu dan berkata seperti yang kamu katakan, lalu Jabir menjawab, “Aku tidak akan menyampaikan kepadamu kecuali yang disampaikan Rasulullah shallallahu 'alaihi wa sallam kepada kami, Beliau bersabda, “Aku berdiam di gua Hira’, setelah selesai berdiam, aku turun lalu dipanggil, maka aku melihat ke sebelah kanan, namun aku tidak melihat apa-apa dan aku melihat ke sebelah kiri, namun aku tidak melihat apa-apa, dan aku melihat ke depanku, namun aku tidak melihat apa-apa dan aku melihat ke belakangku, namun aku tidak melihat apa-apa, maka aku angkat kepalaku ternyata aku melihat sesuatu, kemudian aku mendatangi Khadijah dan berkata, “Selimutilah aku dan tuangkanlah air dingin kepadaku.” Beliau berkata lagi, “Selimutilah aku dan tuangkanlah air dingin kepadaku.” Maka turunlah ayat, “Yaa ayyuhal muddatstsir—Qum fa andzir.” Catatan: Al Haafizh Ibnu Katsir berkata dalam kitab tafsirnya, “Jabir bin Abdullah menyelisihi Jumhur (mayoritas ulama) pada perkataannya, “Sesungguhnya surah yang pertama kali turun adalah Al Muddatstsir.” Jumhur berpendapat, bahwa surah yang pertama kali turun dari Al Qur’an adalah surah Iqra’ (Al ‘Alaq).” Selanjutnya Ibnu Katsir menyebutkan hadits yang terdapat dalam Shahih Bukhari dan Muslim ia berkata, “Imam Muslim meriwayatkan dari jalan ‘Uqail dari Ibnu Syihab dari Abu Salamah ia berkata: Jabir bin Abdullah memberitahukan kepadaku bahwa ia mendengar Rasulullah shallallahu 'alaihi wa sallam menceritakan tentang terputusnya wahyu, Beliau bersabda dalam haditsnya, “Ketika aku berjalan, tiba-tiba aku mendengar suara dari langit, lalu aku angkat kepalaku ke arah langit, ternyata ada malaikat yang pernah datang kepadaku di gua Hira’ sedang duduk di atas kursi antara langit dan bumi, aku pun merasa takut terhadapnya sehingga aku jatuh ke tanah, lalu aku pulang ke istriku, maka aku katakan, “Selimutilah aku, selimutilah aku.” Maka Allah Subhaanahu wa Ta'aala menurunkan ayat, “Yaa ayyuhal muddatstsir—Qum fa andzir.” Sampai firman-Nya, “Fahjur.” Abu Salamah berkata, “Ar Rujz (perkara keji) adalah berhala-berhala.” Selanjutnya wahyu pun sering datang dan turun berturut-turut.” Ini adalah lafaz Bukhari, dan susunan ini yang mahfuzh dimana hal ini menunjukkan bahwa wahyu telah turun sebelumnya berdasarkan sabda Beliau, “Ternyata ada malaikat yang pernah datang kepadaku di gua Hira.” Yaitu malaikat Jibril ketika datang menemui Beliau membawa firman-Nya, “Bacalah dengan (menyebut) nama Tuhanmu yang Menciptakan,-- Dia telah menciptakan manusia dari segumpal darah.-- Bacalah, dan Tuhanmulah yang Maha pemurah,-- Yang mengajar (manusia) dengan perantaran kalam--Dia mengajar kepada manusia apa yang tidak diketahuinya.” (Terj. Al ‘Alaq: 1-5) Kemudian terjadilah fatrah (terputusnya wahyu), setelahnya kemudian malaikat turun (kembali).” Muzzammil dan muddatstsir artinya sama, yaitu berselimut. Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam untuk sungguh-sungguh beribadah baik yang manfaatnya untuk pribadi maupun untuk pribadi dan orang lain (seperti dakwah). Sebelumnya (di surah Al Muzzammil) telah disebutkan perintah kepada Beliau untuk mengerjakan ibadah yang utama untuk pribadi yaitu shalat malam dan bersabar terhadap gangguan kaumnya, dan di di surah ini Allah Subhaanahu wa Ta'aala memerintahkan Beliau untuk melakukan dakwah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 1",
    "description": "1-2. Di akhir surah al-Muzammil berisi berita gembira bagi yang berbuat kebajikan, di awal surah ini berisi perintah untuk bersemangat menyeru kepada kebajikan. Wahai orang yang berkemul atau berselimut yakni nabi Muhammad! bangunlah dengan sungguh-sungguh dan penuh semangat, lalu berilah peringatan!1-2"
  }
]