[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-10. Ketika sangkakala telah ditiup dengan tiupan kebangkitan, hari itu adalah waktu yang sulit bagi orang-orang kafir, tidak mudah bagi mereka untuk menghadapi perhitungan amal dan kengerian lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Bagi orang-orang kafir terhadap Allah dan Rasul-Nya, tidaklah mudah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Hari itu adalah benar-benar hari yang penuh huru-hara dan kesulitan bagi orang kafir, tidak ada kemudahan sedikitpun bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{tidak mudah bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-10. Yaitu bila sangkakala ditiup untuk bangkit dari kubur, semua manusia dikumpulkan untuk dibangkitkan, “maka waktu itu adalah waktu (datangnya) hari yang sulit,” karena banyaknya huru hara dan kedahsyatannya, “bagi orang-orang kafir lagi tidak mudah,” karena mereka telah putus asa dari berbagai kebaikan dan yakin akan binasa. Kontekstualnya, hari itu mudah bagi orang-orang yang beriman sebagaimana yang difirmankan Allah, “Orang-orang kafir berkata, ‘Ini adalah hari yang sulit’.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 10: 8-10. Allah menyebutkan dari sisi hari kiamat, Allah berkata : Maka jika telah ditiup wahai Nabi Allah, yaitu ditiupnya sangkakala, yaitu tiupan kebangkitan, maka ia termasuk tiupan yang kedua, dimana setelahnya akan ada pembalasan dan hisab. Ketahuilah, pada hari itu akan menjadi hari yang sulit bagi orang-orang kafir dan para pengingkar agama Allah, tidaklah mudah bagi mereka dan apa yang setelahnya, dan sebagian dari rahmat Allah kepada hambanya yang beriman, Allah berkata : عَلَى ٱلْكَـٰفِرِينَ غَيْرُ يَسِيرٍۢ, artinya : Bagi orang-orang kafir tidaklah mudah; Pada ayat ini terdapat kelembutan dan keramahan dengan sebab kondisi hari kiamat akan dimudahkan bagi orang-orang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena banyak penderitaannya. Hal ini menunjukkan bahwa yang demikian mudah bagi orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 10",
    "description": "8-10. Kesulitan dalam dakwah tidaklah seberapa, akan ada saat yang lebih sulit lagi, maka apabila sangkakala ditiup yaitu hari kiamat telah tiba, maka itulah hari yang serba sulit, bagi siapa saja. Terlebih bagi orang-orang kafir yaitu yang keras kepala mengingkari kebenaran, pada hari itu tidak mudah, keadaannya akan diliputi kesulitan yang dahsyat. 11-13. Di antara tokoh pendurhaka yang menjadi latar belakang turunnya ayat-ayat ini dan akan mengalami kesulitan pada hari kiamat adalah al-walid bin al-Mugirah. Terhadap tokoh ini dan siapa saja yang perilakunya sama dengan al-walid, maka Allah menegaskan demikian, biarkanlah aku yang bertindak terhadap orang yang aku sendiri telah menciptakannya, tanpa bantuan dari siapa pun. Penciptaan manusia pastilah melibatkan kedua orang tua, namun pada ayat ini peran itu dinafikan karena menunjukkan ancaman yang serius terhadap yang durhaka. Dan orang tersebut juga aku berikan baginya kekayaan yang melimpah melalui sebab-sebab yang telah ditetapkan, dan juga anugerah berupa anak-anak yang selalu bersamanya, ."
  }
]