[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-17. Biarkanlah Aku (wahai Rasul) menangani orang yang Aku ciptakan dalam rahim ibunya sendirian, tidak berharta dan tidak beranak, lalu Aku memberinya harta melimpah dan lapang dan anak-anak yang hadir bersamanya di Makkah yang tidak meninggalkannya, Aku memudahkan baginya sebab-sebab kemudahan sedemikian rupa, kemudian sesudah semua itu, dia masih berharap Aku menambah harta dan anak-anaknya, padahal dia kafir kepadaKu. Perkaranya tidak seperti yang dikira oleh orang durjana penuh dosa ini, Aku tidak akan menambahnya, karena dia adalah penentang dan pendusta al-Quran dan hujjah-hujjah Allah atas makhlukNya, Aku akan membebaninya dengan siksaan yang melelahkan dan berat, yang tidak ada keringanan sesudahnya. Yang dimaksud dengan ancaman ini adalah al-Walid bin al-Mughirah, laki-laki penentang kebenaran, penentang Allah dan RasulNya dengan mengumumkan peperangan terhadap keduanya. Ini merupakan balasan setiap orang yang menentang dan mencampakkan kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan Aku lapangkan baginya urusan kehidupan, rezeki dan anak dengan seluas-luasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَمَهَّدتُّ لَهُۥ تَمْهِيدًا (dan Ku-lapangkan baginya (rezeki dan kekuasaan) dengan selapang-lapangnya) Yakni Aku lapangkan baginya penghidupan, umur yang panjang, dan kekuasaan di kaum Quraisy."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14-15. .Aku juga telah melapangkan kehidupan bagi mereka, Aku berikan pangkat dan derajat. Kemudian dia tamak terhadap harta dan anak yang telah Kuberikan padanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Aku memberinya kelapangan seluas-luasnya} dan Aku melapangkan baginya penghidupan seluas-luasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-30. Ayat-ayat ini turun berkenaan dengan al-Walid bin al-Mughirah yang sengit menentang kebenaran, yang menantang Allah dan RasulNya dengan peperangan dan menyelisihi. Allah amat mencelanya dengan celaan yang tidak pernah dialamatkan pada yang lain. Ini adalah balasan bagi semua orang yang menentang dan mencampakkan kebenaran. Orang seperti ini pasti mendapatkan kehinaan di dunia dan siksaan akhirat jauh lebih menghinakan. Allah berfirman, “Biarkanlah Aku bertindak terhadap orang yang Aku telah menciptakannya sendirian,” yakni yang Aku ciptakan sendirian tanpa harta, keluarga, dan lainnya yang senantiasa Aku jaga dan Aku beri. Aku jadikan, “baginya harta benda yang banyak,” yakni harta yang berlimpah, “dan” Aku jadikan untuknya :anak-anak,” yakni anak-anak lelaki, “yang selalu berasama dia,” yaitu selalu ada bersamanya. Dengan anak-anak itu ia bersenang-senang, dengan mereka juga ia memenuhi kebutuhannya dan mendapatkan pertolongan, “dan Ku-lapangkan baginya (rizki dan kekuasaan) dengan selapang-lapangnya,” yakni Aku berikan padanya dinia dan sebab-sebabnya ketika semua keinginannya terpenuhi dan semua yang dikehendaki diperoleh. “Kemudian,” dengan berbagai nikmat dan pemberian ini, “dia ingin sekali supaya Aku menambahnya,” yakni ia ingin untuk mendapatkan nikmat akhirat sebagaimana ia mendapatkan kenikmatan dunia. “Sekali-kali tidak (akan Aku tambah),” yakni tidak seperti yang ia dambakan, tapi sebaliknya justru berseberangan dengan apa yang diinginkan. Hal itu “karena sesungguhnya dia menentang ayat-ayat Kami (al-Quran).” Ia mengetahui (kebenaran)nya, tapi kemudian ia tidak mau tunduk padanya. Ayat-ayat mengajaknya pada kebenaran tapi ia tidak mau tunduk padanya. Ia tidak hanya cukup berpaling dari ayat-ayat al-Quran, tapi ia memeranginya dan berusaha untuk membatalkannya. Karena itulah Allah berfirman tentangnya, “sesungguhnya dia telah memikirkan,” dalam dirinya, “Dan menetapkan (apa yang ditetapkannya),” apa yang di pikirannya agar bisa mengucapkan perkataan yang membatalkan al-Quran, “maka celakalah dia! Bagaimanakah dia menetapkan, kemudian ia memikirkan suatu hal yang berada di luar kemampuannya dan berharap bisa mendapatkan sesuatu yang tidak bisa didapatkan oleh dia sendiri dan orang-orang sepertinya. “kemudian dia memikirkan” perkataannya. “Sesudah itu dia bermasam muka dan merengut,” pada wajah dan penampilan luarnya sebagai sikap lari dari kebenaran dan membencinya. “Kemudian dia berpaling (dari kebenaran) dan menyombongkan diri,” sebagai akibat dari usaha pikiran, tindakan, dan perkataannya. “Lalu dia berkata, ‘(al-Quran) ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu), ini tidak lain hanyalah perkataan manusia’,” yakni, bukan Firman Allah, tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan orang-orang buruk dan keji yang diucapkan oleh pendusta dan penyihir. Celakalah dia, alangkah jauhnya dia dari kebenaran dan dan alangkah dekatnya dia dengan kerugian dan kecelakaan. Bagaimana terlintas di otak dan terbayang oleh nurani siapa pun orang yang menyatakan Firman paling luhur dan agung, Firman Rabb Yang Mahamulia, Luhur dan Agung menyerupai perkataan makhluk-makhluk yang miskin dan serba kurang? Atau bagaimanakah si pendusta lagi pembangkang ini berani mengungkapkan sifat seperti itu pada Firman Allah? Tidak ada yang berhak di dapatkan melainkan azab yang dahsyat. Karena itu Allah berfirman, “Aku akan memasukannya ke dalam Saqar, tahukah kamu apa (Neraka) Saqar itu, Saqar itu tidak meninggalkan dan tidak membiarkan,” yakni tidak meninggalkan kedahsyatan maupun orang yang disiksa sedikit pun kecuali pasti mengenainya, “(Neraka Saqar) adalah pembakar kulit manusia,” membakar mereka dalam siksaan dan membuat mereka gemetar karena amat panas. “Di atasnya ada sembilan belas (malaikat penjaga),” dari kalangan malaikat yang menjaganya. Mereka kejam dan bengis. Mereka tidak mendurhakai Allah terhadap apa yang diperintahkan dan mereka melakukan apa yang diperintahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 14: 11-18. Allah mengabarkan dengan kisah kesesatan dank eras kepalanya Al Walid bin Mughirah, Allah berkata : Tinggalkan wahai Nabi Allah bagi orang celaka ini, engkau akan melihat balasan baginya. Akulah semata-mata yang menciptakannya di perut ibunya, Aku jadikan dia memiliki harta yang banyak, begitu juga anak yang banyak, dan Aku jadikan orang-orang hadir di sisinya ketika di Mekkah untuk dirinya mencari rezeki dan tidak Aku cerai beraikan mereka, Aku juga hamparkan kehidupan dan kedudukan, dan Aku berikan keamanan dari dunia dan sebab-sebabnya, kemudian dia dengan semuanya itu meminta tambahan dengan berharap tambahan yang banyak beriringan dengan kekufurannya. Tidak, Aku tidak akan memberikan tambahan sesuatupun, karena dia adalah orang yang menentang ayat-ayat Kami, dan mendustakannya setelah diberikan kepadanya agar yakin karena ayat-ayat tersebut adalah jujur dan benar, sebagaimana Allah berfirman : فَإِنَّهُمْ لَا يُكَذِّبُونَكَ وَلَـٰكِنَّ ٱلظَّـٰلِمِينَ بِـَٔايَـٰتِ ٱللَّهِ يَجْحَدُونَ, yang artinya : karena mereka sebenarnya bukan mendustakan kamu, akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah. {Al An’am : 33}; Bahkan Aku akan akhiri nikmat yang Aku berikan kepadanya dan tidak akan Aku memberikannya lagi selamanya. Sungguh Kami akan membebaninya dengan cobaan yaitu dari adzab yang Kami timpakan, yang ia tidak akan sanggup menahannya. Agar supaya dia berpikir dan merenungi urusan yang dibawa oleh Nabi ﷺ dan Al Qur’an Al Karim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga ia memperoleh apa yang dia inginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 14",
    "description": "14-16. Ayat ini melanjutkan uraian tentang keistimewaan yang diberikan Allah kepada al-walid bin al-Mugirah. Dan di samping itu aku berikan baginya kelapangan hidup seluas-luasnya. Kemudian dia juga berharap ingin sekali agar aku menambahnya dengan bentuk anugerah lainnya, bahkan kalau bisa diberikan surga. Aneka nikmat yang dianugerahkan kepadanya mestinya dia syukuri dengan berbuat baik, ternyata malah membangkang maka tidak bisa terpenuhi keinginannya! sesungguhnya dia telah menentang ayat-ayat kami yakni Al-Qur'an"
  }
]