[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Bangkit dan peringatilah dari siksa Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. قُمْ فَأَنذِرْ (bangunlah, lalu berilah peringatan) Bangun dan berikanlah peringatan kepada penduduk Makkah terhadap azab yang akan menimpa mereka jika mereka tidak mau beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Bangkitlah dan waspadalah dari azab Allah untuk orang-orang yang tidak beriman kepada risalahmu. Diriwayatkan dari Bukhari Muslim dari Jabir berkata: Nabi SAW bersabda Aku berdiam diri di gua Hira’, setelah selesai aku pun beranjak keluar dan tiba-tiba aku mendengar seseorang memanggilku. Maka akupun menoleh ke sebelah kananku, namun aku tidak melihat siapapun, ke sebelah kiri juga tidak ada siapapun, juga di arah belakang tidak ada siapapun. Lalu aku mengangkat kepalaku, dan ternyata aku melihat sesuatu di atas langit, dan aku mendapati malaikat yang mendatangiku di gua Hira’. Kemudian aku kembali, dan aku berkata, selimuti aku. Maka turunlah ayat ini. Ya ayyuhal muddatstsir qum fa andzir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{bangunlah, lalu berilah peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. Telah dijelaskan sebelumnya bahwa al-Muzammil dan al-Mudatsir maknanya sama. Allah memerintahkan RasulNya untuk bersungguh-sungguh dalam beribadah menyembah Allah dengan ibadah-ibadah pendek dan panjang. Dalam surat sebelumnya dijelaskan perintah Allah untuk ibadah-ibadah utama yang pendek pada RasulNya serta perintah bersabar terhadap gangguan kaumnya, dan dalam surat ini Allah memerintahkannya untuk memberitahukan seruannya dan tegas menyampaikan peringatan. Allah berfirman, “Bangunlah,” yakni dengan sungguh-sungguh dan giat, “lalu berilah peringatan” kepada manusia dengan perkataan dan perbuatan yang bisa menyampaikan pada tujuan serta menjelaskan kondisi apa-apa yang diperingatkan darinya agar hal itu lebih mendorong untuk ditinggalkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 2: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni peringatkanlah penduduk Mekkah dengan neraka jika mereka tidak beriman. Menurut Syaikh Muhammad bin Abdul Wahhab dalam Al Ushul Ats Tsalaatsah adalah memperingatkan manusia terhadap syirk (agar menjauhinya) dan mengajak kepada tauhid (beribadah hanya kepada Allah Subhaanahu wa Ta'aala)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 2",
    "description": "1-2. Di akhir surah al-Muzammil berisi berita gembira bagi yang berbuat kebajikan, di awal surah ini berisi perintah untuk bersemangat menyeru kepada kebajikan. Wahai orang yang berkemul atau berselimut yakni nabi Muhammad! bangunlah dengan sungguh-sungguh dan penuh semangat, lalu berilah peringatan!3-4. Dalam menyampaikan dakwah pastilah akan banyak rintangan, maka hal itu tidak perlu merisaukan hatimu wahai nabi. Ikutilah petunjuk-ku, pertama, agar tetap tegar dan tidak pudar semangatmu, agungkanlah tuhanmu, dan kedua, untuk menunjang dakwahmu, bersihkanlah pakaianmu."
  }
]