[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-25. Dia dilaknat dan karena itu dia berhak mendapat kebinasaan. Bagaimana dia menyiapkan celaan itu dalam dirinya? Kemudian dilaknat juga, kemudian dia merenungkan tentang apa yang dia siapkan dan susun demi mencela al-Quran, kemudian dia mengernyitkan wajahnya, dia cemberut dan bermuka sangat masam, karena segala cara terasa sempit, dia tidak menemukan celaan yang pas untuk dia arahkan kepada Al-Quran, akhirnya dia berkata tentang al-Quran, “Apa yang diucapkan oleh Muhammad hanya sihir yang dia dapatkan dari orang-orang terdahulu, ia hanya perkataan manusia yang Muhammad pelajari dari mereka kemudian Muhammad mengakuinya dari sisi Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Kemudian ia melihat kembali dan memikirkan apa yang telah diucapkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. ثُمَّ نَظَرَ (kemudian dia memikirkan) Yakni memikirkan tentang apa yang akan dia jadikan untuk menentang al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Dia terlaknat atas yang diperkirakan. Ungkapan ini diulang sebagai doa atas besarnya laknat dan hinaan terhadap apa yang mereka rencanakan. Juga atas apa yang mereka pelajari dari Alquran untuk tujuan fitnah dan membantah kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian dia memikirkan} menyiapkan pandangan dan memikirkan apa yang dikatakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-30. Ayat-ayat ini turun berkenaan dengan al-Walid bin al-Mughirah yang sengit menentang kebenaran, yang menantang Allah dan RasulNya dengan peperangan dan menyelisihi. Allah amat mencelanya dengan celaan yang tidak pernah dialamatkan pada yang lain. Ini adalah balasan bagi semua orang yang menentang dan mencampakkan kebenaran. Orang seperti ini pasti mendapatkan kehinaan di dunia dan siksaan akhirat jauh lebih menghinakan. Allah berfirman, “Biarkanlah Aku bertindak terhadap orang yang Aku telah menciptakannya sendirian,” yakni yang Aku ciptakan sendirian tanpa harta, keluarga, dan lainnya yang senantiasa Aku jaga dan Aku beri. Aku jadikan, “baginya harta benda yang banyak,” yakni harta yang berlimpah, “dan” Aku jadikan untuknya :anak-anak,” yakni anak-anak lelaki, “yang selalu berasama dia,” yaitu selalu ada bersamanya. Dengan anak-anak itu ia bersenang-senang, dengan mereka juga ia memenuhi kebutuhannya dan mendapatkan pertolongan, “dan Ku-lapangkan baginya (rizki dan kekuasaan) dengan selapang-lapangnya,” yakni Aku berikan padanya dinia dan sebab-sebabnya ketika semua keinginannya terpenuhi dan semua yang dikehendaki diperoleh. “Kemudian,” dengan berbagai nikmat dan pemberian ini, “dia ingin sekali supaya Aku menambahnya,” yakni ia ingin untuk mendapatkan nikmat akhirat sebagaimana ia mendapatkan kenikmatan dunia. “Sekali-kali tidak (akan Aku tambah),” yakni tidak seperti yang ia dambakan, tapi sebaliknya justru berseberangan dengan apa yang diinginkan. Hal itu “karena sesungguhnya dia menentang ayat-ayat Kami (al-Quran).” Ia mengetahui (kebenaran)nya, tapi kemudian ia tidak mau tunduk padanya. Ayat-ayat mengajaknya pada kebenaran tapi ia tidak mau tunduk padanya. Ia tidak hanya cukup berpaling dari ayat-ayat al-Quran, tapi ia memeranginya dan berusaha untuk membatalkannya. Karena itulah Allah berfirman tentangnya, “sesungguhnya dia telah memikirkan,” dalam dirinya, “Dan menetapkan (apa yang ditetapkannya),” apa yang di pikirannya agar bisa mengucapkan perkataan yang membatalkan al-Quran, “maka celakalah dia! Bagaimanakah dia menetapkan, kemudian ia memikirkan suatu hal yang berada di luar kemampuannya dan berharap bisa mendapatkan sesuatu yang tidak bisa didapatkan oleh dia sendiri dan orang-orang sepertinya. “kemudian dia memikirkan” perkataannya. “Sesudah itu dia bermasam muka dan merengut,” pada wajah dan penampilan luarnya sebagai sikap lari dari kebenaran dan membencinya. “Kemudian dia berpaling (dari kebenaran) dan menyombongkan diri,” sebagai akibat dari usaha pikiran, tindakan, dan perkataannya. “Lalu dia berkata, ‘(al-Quran) ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu), ini tidak lain hanyalah perkataan manusia’,” yakni, bukan Firman Allah, tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan orang-orang buruk dan keji yang diucapkan oleh pendusta dan penyihir. Celakalah dia, alangkah jauhnya dia dari kebenaran dan dan alangkah dekatnya dia dengan kerugian dan kecelakaan. Bagaimana terlintas di otak dan terbayang oleh nurani siapa pun orang yang menyatakan Firman paling luhur dan agung, Firman Rabb Yang Mahamulia, Luhur dan Agung menyerupai perkataan makhluk-makhluk yang miskin dan serba kurang? Atau bagaimanakah si pendusta lagi pembangkang ini berani mengungkapkan sifat seperti itu pada Firman Allah? Tidak ada yang berhak di dapatkan melainkan azab yang dahsyat. Karena itu Allah berfirman, “Aku akan memasukannya ke dalam Saqar, tahukah kamu apa (Neraka) Saqar itu, Saqar itu tidak meninggalkan dan tidak membiarkan,” yakni tidak meninggalkan kedahsyatan maupun orang yang disiksa sedikit pun kecuali pasti mengenainya, “(Neraka Saqar) adalah pembakar kulit manusia,” membakar mereka dalam siksaan dan membuat mereka gemetar karena amat panas. “Di atasnya ada sembilan belas (malaikat penjaga),” dari kalangan malaikat yang menjaganya. Mereka kejam dan bengis. Mereka tidak mendurhakai Allah terhadap apa yang diperintahkan dan mereka melakukan apa yang diperintahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 21: 21-23. Kemudian ia memperhatikan apa yang diucapkan di dalam Al Qur’an, dan dengan apa dia akan mencela Al Qur’an. Lalu ia bermuka masam dan berubah menjadi sesak dadanya karena terbongkar tipuannya, serta tidak dapat mencari celaan untuk mencela Al Qur’an. Kemudian ia berkilah dan mengingkari atas keimanan dan tauhid kemudian sombong dari perkataan yang benar, dan dari kebenaran Al Qur’an. Dan firman Allah : ثُمَّ نَظَرَ, ini adalah ayat yang terpendek di dalam Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tentang ucapannya atau pencacatannya terhadap Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 21",
    "description": "21-25. Ayat-ayat ini merupakan kelanjutan dari gejolak hati dan pikir-an tokoh sentral dari surah ini. Kemudian dia merenung memikirkan bagaimana cara melecehkan Al-Qur'an, lalu sesudah itu dia berwajah masam dan cemberut, karena dia tidak menemukan celah untuk melecehkannya, kemudian dia berpaling dari kebenaran yang sebenarnya dia ketahui dan akui, dan menyombongkan diri, dengan congkaknya lalu dia berkata, 'Al-Qur'an ini hanyalah sihir yang dipelajari dari orang-orang dahulu. Ini hanyalah perkataan manusia bukan firman Allah. '21-25"
  }
]