[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "26-30. Aku akan memasukannya ke dalam Neraka Jahanam agar dia merasakan panasnya dan terbakar oleh apinya. Adakah yang memberitahumu apa itu Jahanam? Ia tidak meninggalkan daging dan tidak membiarkan tulang kecuali ia membakarnya, ia juga merubah kulit, menghitamkan warnanya, dan membakarnya, yang mengurusinya dan mengazab penghuninya adalah 19 malaikat dari para malaikat Zabaniyah yang keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Aku akan memasukkan orang kafir ini ke dalam salah satu tingkatan Neraka, yaitu Neraka Saqar, agar ia merasakan panasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-29. Dalam ayat ini dijelaskan azab yang akan didapatkan orang yang angkuh dan pembangkang ini; dia akan dimasukkan ke dalam neraka Jahannam. ‘Saqar’ adalah salah satu sebutan neraka Jahannam, atau salah satu jurangnya. Dan pertanyaan mengenai saqar ini untuk menunjukkan kengeriannya dan menambah peringatan terhadapnya. Apakah kamu mengetahui hakikat saqar ini? Ia tidak akan menyisakan daging dan tulang orang yang memasukinya; dan karena begitu besarnya, ia dapat terlihat dari tempat yang sangat jauh dengan menampakkan kengeriannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. سَأُصْلِيهِ سَقَرَ (Aku akan memasukkannya ke dalam (neraka) Saqar) Yakni Aku akan memasukkannya ke dalam neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26-27. Akan Aku (Allah) masukkan dia ke dalam neraka Saqar, apakah engkau tahu apa itu Saqar?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku akan memasukkannya ke dalam neraka Saqar} Aku akan memasukkannya ke dalam neraka Jahanam, agar dia masuk pada panasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-30. Ayat-ayat ini turun berkenaan dengan al-Walid bin al-Mughirah yang sengit menentang kebenaran, yang menantang Allah dan RasulNya dengan peperangan dan menyelisihi. Allah amat mencelanya dengan celaan yang tidak pernah dialamatkan pada yang lain. Ini adalah balasan bagi semua orang yang menentang dan mencampakkan kebenaran. Orang seperti ini pasti mendapatkan kehinaan di dunia dan siksaan akhirat jauh lebih menghinakan. Allah berfirman, “Biarkanlah Aku bertindak terhadap orang yang Aku telah menciptakannya sendirian,” yakni yang Aku ciptakan sendirian tanpa harta, keluarga, dan lainnya yang senantiasa Aku jaga dan Aku beri. Aku jadikan, “baginya harta benda yang banyak,” yakni harta yang berlimpah, “dan” Aku jadikan untuknya :anak-anak,” yakni anak-anak lelaki, “yang selalu berasama dia,” yaitu selalu ada bersamanya. Dengan anak-anak itu ia bersenang-senang, dengan mereka juga ia memenuhi kebutuhannya dan mendapatkan pertolongan, “dan Ku-lapangkan baginya (rizki dan kekuasaan) dengan selapang-lapangnya,” yakni Aku berikan padanya dinia dan sebab-sebabnya ketika semua keinginannya terpenuhi dan semua yang dikehendaki diperoleh. “Kemudian,” dengan berbagai nikmat dan pemberian ini, “dia ingin sekali supaya Aku menambahnya,” yakni ia ingin untuk mendapatkan nikmat akhirat sebagaimana ia mendapatkan kenikmatan dunia. “Sekali-kali tidak (akan Aku tambah),” yakni tidak seperti yang ia dambakan, tapi sebaliknya justru berseberangan dengan apa yang diinginkan. Hal itu “karena sesungguhnya dia menentang ayat-ayat Kami (al-Quran).” Ia mengetahui (kebenaran)nya, tapi kemudian ia tidak mau tunduk padanya. Ayat-ayat mengajaknya pada kebenaran tapi ia tidak mau tunduk padanya. Ia tidak hanya cukup berpaling dari ayat-ayat al-Quran, tapi ia memeranginya dan berusaha untuk membatalkannya. Karena itulah Allah berfirman tentangnya, “sesungguhnya dia telah memikirkan,” dalam dirinya, “Dan menetapkan (apa yang ditetapkannya),” apa yang di pikirannya agar bisa mengucapkan perkataan yang membatalkan al-Quran, “maka celakalah dia! Bagaimanakah dia menetapkan, kemudian ia memikirkan suatu hal yang berada di luar kemampuannya dan berharap bisa mendapatkan sesuatu yang tidak bisa didapatkan oleh dia sendiri dan orang-orang sepertinya. “kemudian dia memikirkan” perkataannya. “Sesudah itu dia bermasam muka dan merengut,” pada wajah dan penampilan luarnya sebagai sikap lari dari kebenaran dan membencinya. “Kemudian dia berpaling (dari kebenaran) dan menyombongkan diri,” sebagai akibat dari usaha pikiran, tindakan, dan perkataannya. “Lalu dia berkata, ‘(al-Quran) ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu), ini tidak lain hanyalah perkataan manusia’,” yakni, bukan Firman Allah, tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan manusia. Di samping itu bukan perkataan manusia terbaik tapi perkataan orang-orang buruk dan keji yang diucapkan oleh pendusta dan penyihir. Celakalah dia, alangkah jauhnya dia dari kebenaran dan dan alangkah dekatnya dia dengan kerugian dan kecelakaan. Bagaimana terlintas di otak dan terbayang oleh nurani siapa pun orang yang menyatakan Firman paling luhur dan agung, Firman Rabb Yang Mahamulia, Luhur dan Agung menyerupai perkataan makhluk-makhluk yang miskin dan serba kurang? Atau bagaimanakah si pendusta lagi pembangkang ini berani mengungkapkan sifat seperti itu pada Firman Allah? Tidak ada yang berhak di dapatkan melainkan azab yang dahsyat. Karena itu Allah berfirman, “Aku akan memasukannya ke dalam Saqar, tahukah kamu apa (Neraka) Saqar itu, Saqar itu tidak meninggalkan dan tidak membiarkan,” yakni tidak meninggalkan kedahsyatan maupun orang yang disiksa sedikit pun kecuali pasti mengenainya, “(Neraka Saqar) adalah pembakar kulit manusia,” membakar mereka dalam siksaan dan membuat mereka gemetar karena amat panas. “Di atasnya ada sembilan belas (malaikat penjaga),” dari kalangan malaikat yang menjaganya. Mereka kejam dan bengis. Mereka tidak mendurhakai Allah terhadap apa yang diperintahkan dan mereka melakukan apa yang diperintahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 26: 26-30. Kemudian datanglah adzab yang keras pada orang pendosa ini yang angkuh karena sebab apa yang dituduhkannya kepada Muhammad dan Al Qur’an; Allah mengabarkan bahwasanya ia akan dijebloskan ke dalam neraka yang menyala-nyala api dan adzabnya. Dan apakah engkau tahu wahai Muhammad apa itu neraka jahannam ?! Ketahuilah bahwa tidaklah yang masuk dan ditinggalkan di dalamnya kecuali akan dibakar olehnya dan disiksa keras, kemudian (setelah disiksa) dikembalikan lagi sebagaimana merasakan adzab dengan kali yang lain. Neraka ini akan menghitamkan dan membakar manusia yang di dalamnya, dan akan merubah warna kulitnya, dan di dalamnya ada Sembilan belas malaikat penjaga yang bengis, kejam yang mereka tidak pernah bermaksiat kepada Allah dengan apa yang Allah perintahkan pada mereka, dan mereka berbuat sebagaimana yang diperintahkan kepada mereka. Saqar adalah nama diantara nama-nama neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saqar adalah salah satu nama neraka Jahannam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 26",
    "description": "26-30. Sebagai akibat dari kedurhakaan yang dilakukan oleh al-walid dan siapa pun, sebagaimana diuraikan oleh ayat-ayat yang lalu, maka ia disiksa dan puncaknya dijelaskan pada ayat-ayat ini. Kelak, aku akan menyiksanya dengan memasukkannya ke dalam neraka saqar, dan tahukah kamu apa neraka saqar itu' saqar itu tidak meninggalkan atau menyisakan, semua anggota tubuhnya akan diliputi siksa dan tidak membiarkan mati, sehingga terbebas dari azab. Saqar itu adalah yang menghanguskan kulit manusia. Di atas neraka saqar ada sembilan belas malaikat penjaga, yang siap siaga mengawasi penghuninya"
  }
]