[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31. Kami tidak menjadikan para penjaga neraka kecuali dari para malaikat yang keras, dan Kami tidak menjadikan jumlah tersebut kecuali sebagai ujian bagi orang-orang yang kafir kepada Allah, agar orang-orang yang diberi kitab, yaitu Yahudi dan Nasrani, yakin bahwa apa yang tertulis di dalam al-Quran tentang penunggu Jahanam itu adalah haq, karena ia sama dengan apa yang ada di dalam kitab-kitab mereka, dan orang-orang beriman semakin bertambah pembenaran mereka kepada Allah dan rasulNya dan pengamalan mereka terhadap syariatNya. Hal itu tidak diragukan oleh orang-orang yang diberi kitab, yaitu Yahudi dan Nasrani, dan orang-orang yang beriman kepada Allah dan rasulNya. Dan agar orang-orang yang memendam kemunafikan di dalam hati mereka dan orang-orang kafir berkata, “Apa maksud Allah dengan angka yang aneh ini?” dengan seperti apa yang disebutkan ini, Allah menyesatkan siapa yang hendak Dia sesatkan, dan memberi petunjuk siapa yang ingin Dia beri petunjuk. Tidak ada yang tahu bala tentara Tuhanmu, yang di antra mereka adalah malaikat, kecuali hanya Allah semata. Dan neraka hanyalah peringatan dan nasihat bagi manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan tidaklah Kami menjadikan penjaga Neraka itu melainkan dari jenis Malaikat. Tidak ada manusia yang mampu melawan mereka. Abu Jahal telah berdusta tatkala berkata bahwa dia dan kaumnya mampu untuk mengalahkan Malaikat lalu mereka keluar dari Neraka. Dan tidaklah Kami jadikan bilangan mereka melainkan sebagai ujian bagi orang-orang yang kafir terhadap Allah agar mereka mengatakan apa yang mereka katakan lalu siksaan mereka akan dilipatgandakan.Agar orang-orang Yahudi yang diberi Kitab Taurat dan orang-orang Nasrani yang diberi Injil menjadi yakin saat Al-Qur`ān diturunkan dengan membenarkan apa yang ada di dalam dua Kitab mereka; agar orang-orang yang beriman semakin bertambah keimanannya apabila Ahlul kitab sepakat dengan mereka; dan orang-orang Yahudi, Nasrani dan orang-orang yang beriman tidak ragu-ragu; dan agar orang-orang masih ragu-ragu dalam keimanannya beserta orang-orang kafir berkata, \"Apa yang dikehendaki Allah dengan bilangan yang aneh ini?\" Kesesatan orang yang mengingkari bilangan ini dan petunjuk bagi orang yang membenarkan bilangan ini, adalah permisalan bahwa Allah menyesatkan orang yang Dia kehendaki untuk disesatkan dan Allah memberi petunjuk orang yang Dia kehendaki untuk mendapat petunjuk. Dan tidak ada yang mengetahui tentara Rabbmu karena jumlahnya yang banyak selain Allah -Subḥānahu-. Dan agar hal itu diketahui oleh Abu Jahal yang berkata, “Apakah Muhammad tidak punya penolong kecuali hanya sembilan belas?” Sebagai bentuk merendahkan dan mendustakan. Dan tidaklah Neraka itu melainkan peringatan bagi manusia, dengannya manusia mengetahui keagungan Allah -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Allah menjadikan para malaikat penanggungjawab perkara azab di neraka; para malaikat ini sangat kejam, dan keras dalam mengazab. Penyampaian jumlah para malaikat ini sebagai ujian bagi para makhluk; sehingga para ahli kitab menjadi yakin terhadap kebenaran Rasulullah karena hal ini sesuai dengan kitab-kitab yang diturunkan sebelumnya; dan menambah keimanan dan keteguhan orang-orang beriman di atas kebenaran, karena mereka selalu membenarkan segala hal ghaib yang Allah sampaikan, dan jika para ahli kitab-pun membenarkan berita ini maka itu akan semakin memperkuat keyakinan. Sedangkan orang-orang kafir, munafik, dan yang lemah imannya; maka mereka akan mengingkari kabar yang Allah sampaikan ini, dan merasa terheran dengannya. Maka disebutkan bantahan bagi mereka bahwa Allah Maha Mengetahui siapa yang layak mendapat hidayah, sehingga Dia akan memberinya hidayah dan memudahkan jalannya; dan Allah Maha Mengetahui siapa yang layak tersesat, sehingga Dia akan membiarkannya setelah menjelaskan baginya hujjah dan bukti-bukti kebenaran. Kemudian Allah menjelaskan bahwa hanya Dia yang mengetahui segala yang berhubungan dengan tentara-Nya dari golongan malaikat dan lainnya; tentang jumlah, kekuatan, jenis, dan tugas mereka. Dan Allah telah menyampaikan kepada seluruh makhluk-Nya tentang neraka, ciri-cirinya, dan kengeriannya, agar mereka menjadikannya peringatan dan pelajaran, serta menjalankan amalan yang dapat menyelamatkan darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَمَا جَعَلْنَآ أَصْحٰبَ النَّارِ إِلَّا مَلٰٓئِكَةً ۙ (Dan tiada Kami jadikan penjaga neraka itu melainkan dari malaikat) Ketika turun ayat عَلَيْهَا تِسْعَةَ عَشَرَ. Abu jahal berkata: “apakah Muhammad tidak memiliki pembantu kecuali sembilan belas saja? Apakah seratus orang dari kalian tidak dapat mengalahkan satu malaikat itu kemudian kalian dapat keluar dari neraka?” Maka turunlah ayat: وَمَا جَعَلْنَآ أَصْحٰبَ النَّارِ إِلَّا مَلٰٓئِكَةً yakni siapakah yang mampu mengalahkan malaikat, sedangkan mereka adalah makhluk Allah yang paling taat dalam menjalankan perintah-Nya serta memiliki kekuatan yang paling besar? وَمَا جَعَلْنَا عِدَّتَهُمْ إِلَّا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟( dan tidaklah Kami menjadikan bilangan mereka itu melainkan untuk jadi cobaan bagi orang-orang kafir) Yakni Kami jadikan jumlah malaikat itu sebagai ujian dan penyesat bagi orang-orang kafir, sehingga mereka dapat berkata sesuka hati mereka, agar azab mereka dilipat gandakan agar dan kemurkaan Allah semakin besar terhadap mereka. لِيَسْتَيْقِنَ الَّذِينَ أُوتُوا۟ الْكِتٰبَ(supaya orang-orang yang diberi Al-Kitab menjadi yakin) Yakni orang-orang Yahudi dan Nasrani, sebab jumlah malaikat penjaga neraka dalam al-Qur’an sesuai dengan jumlah yang disebutkan dalam kitab mereka. وَيَزْدَادَ الَّذِينَ ءَامَنُوٓا۟ إِيمٰنًا ۙ( dan supaya orang yang beriman bertambah imannya) Yakni setelah mereka melihat Ahli Kitab membenarkan mereka dalam hal ini. وَلِيَقُولَ الَّذِينَ فِى قُلُوبِهِم مَّرَضٌ(dan supaya orang-orang yang di dalam hatinya ada penyakit) Yakni orang-orang munafik. وَالْكٰفِرُونَ(dan orang-orang kafir) Dari penduduk Makkah dan lainnya. مَاذَآ أَرَادَ اللَّـهُ بِهٰذَا مَثَلًا ۚ(“Apakah yang dikehendaki Allah dengan bilangan ini sebagai suatu perumpamaan?”) Yakni apa yang dikehendaki Allah dengan jumlah yang asing ini. وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ ۚ( Dan tidak ada yang mengetahui tentara Tuhanmu melainkan Dia sendiri) Yakni para malaikat penjaga neraka itu meskipun hanya sembilan belas, namun mereka memiliki pembantu dan pasukan yang tidak ada yang mengetahui jumlahnya kecuali Allah. وَمَا هِىَ إِلَّا ذِكْرَىٰ لِلْبَشَرِ(Dan Saqar itu tiada lain hanyalah peringatan bagi manusia) Yakni tidaklah neraka dan jumlah malaikat menjaganya itu melainkan peringatan dan pelajaran bagi alam semesta, agar mereka mengetahui kesempurnaan kuasa Allah dan Dia tidak butuh pembantu atau penolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Kami tidak menjadikan penjaga yang menjaga berlangsungnya penyiksaan di neraka itu kecuali malaikat-malaikat yang kasar dan keras. Mereka tidak akan bisa dilawan. Kami tidak menyebutkan jumlah malaikat penjaga itu kecuali untuk menguji orang kafir agar mereka menampakkan sikapnya atas itu. Sehingga mereka akan berkata: Mengapa jumlahnya ada 19 malaikat, juga untuk menjelaskan dan menunjukkan kepada Yahudi dan Nasrani tentang kebenaran Alquran. Juga untuk membenarkan kenabian Muhammad SAW bahwa apa yang Nabi sampaikan sesuai dengan kebenaran Alquran. Agar kadar keimanan orang mukmin bertambah. Orang yang diberi kitab dan orang mukmin agar semakin bertambah keimanan dan keyakinan mereka terhadap agama dan jumlah penjaga Saqar. Juga agar orang-orang yang di hatinya penuh keraguan dan kemunafikan yaitu munafik Madinah, dan kafir musyrik Qurays berkata: Apa yang Allah kehendaki dengan jumlah penjaga Saqar ini, apa maksud dari ketidakmasukakalan ini? Sebagaimana mereka orang munafik dan musyrik telah tersesat dan disesatkan, Allah juga akan membuat sesat orang yang Allah kehendaki dengan menjauhkan mereka dari petunjuk, atas pembangkangan mereka. Allah juga akan memberi petunjuk kepada mereka yang dikehendaki agar mereka mempersiapkan bekal kebaikan. Tidak ada yang tahu kadar kekuatan para penjaga Saqar kecuali Allah. Semua pendiskripsian tentang Saqar ini tidak lain sebagai pelajaran dan peringatan bagi manusia. Ibnu Ishaq dan Qatadah berkata: Suatu hari Abu Jahal berkata: Wahai kaum Qurays, Muhammad telah mengklaim bahwa kelak penjaga neraka dimana kalian disiksa di dalamnya berjumlah 19 penjaga. Sedangkan kalian adalah suku dengan jumlah terbanyak. Apakah masih tidak sanggup 100 pemuda dari kalin menghadapi 1 penjaga neraka?” Sehingga Allah menurunkan ayat “Kami tidak menjadikan penjaga Saqar itu kecuali dari malaikat...”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menjadikan para penjaga neraka} penjaga neraka {kecuali para malaikat dan Kami tidak menentukan bilangan mereka itu} jumlah mereka {kecuali sebagai cobaan} ujian {bagi orang-orang kafir. Agar orang-orang yang diberi kitab} orang-orang Yahudi dan Nasrani {menjadi yakin, orang yang beriman bertambah imannya, dan orang-orang yang diberi kitab dan orang-orang mukmin itu tidak ragu-ragu} tidak ragu {serta orang-orang yang di dalam hatinya ada penyakit} kemunafikan {dan orang-orang kafir (berkata,)“Apakah yang dikehendaki Allah dengan ini sebagai suatu perumpamaan”} Apakah yang dikehendaki Allah dengan bilangan yang asing ini sebagai perumpamaan yang asing {Demikianlah Allah membiarkan sesat siapa saja yang Dia kehendaki dan memberi petunjuk kepada siapa saja yang Dia kehendaki. Tidak ada yang mengetahui bala tentara Tuhanmu kecuali Dia sendiri. (Neraka) itu tidak lain} neraka itu tidak lain {kecuali peringatan} peringatan {bagi manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. “Dan tiada Kami jadikan penjaga neraka itu melainkan dari malaikat,” karena mereka kokoh dan kuat, “dan tidaklah Kami menjadikan bilangan mereka itu melainkan untuk menjadi cobaan bagi orang-orang kafir.” Kemungkinan yang dimaksudkan adalah kecuali untuk menyiksa mereka di akhirat dan untuk menambahkan azab mereka. Azab juga disebut fitnah sebagaimana Allah berfirman, “pada hari itu mereke diazab di dalam nereka” -Adz-Dzariyat:13- Kemungkinan lain yang dimaksudkan adalah sesungguhnya berita yang Kami sampaikan kepadamu tentang jumlah mereka itu tidak lain supaya Kami mengetahui siapa yang membenarkan dan siapa yang mendustakan. Hal ini ditunjukkan oleh ayat selanjutnya, “Supaya orang-orang yang diberi al-Kitab yakin dan supaya orang yang beriman bertambah imannya dan supaya orang-orang yang diberi al-Kitab dan orang-orang Mukmin itu tidak ragu-ragu,” yakni agar keraguan hilang dari mereka. Tujuan-tujuan agung ini diperhatikan oleh mereka yang berakal. Tujuan-tujuan yang dimaksudkan adalah usaha untuk yakin dan bertambah iman di setiap waktu dan dalam berbagai permasalahan-permasalahan Agama dan menagkal keraguan dan dugaan-dugaan keliru yang menghadang kebenaran, menjadikan wahyu yang diturunkan Allah pada RasulNya sebagai pewujud tujuan-tujuan agung ini dan untuk membedakan manakah orang-orang yang benar dan orang-orang yang berdusta. Karena itu Allah berfirman, “Dan supaya berkata orang-orang yang di dalam hatinya ada penyakit,” yakni ragu, syubhat, dan nifak, “dan orang-orang kafir (mengatakan), ‘ Apakah yang dikehendaki Allah dengan bilangan ini sebagai perumpaan’.” Perkataan ini diucapkan karena ragu dan kekufuran mereka terhadap tanda-tanda kebesaran Allah. Keduanya adalah petunjuk Allah bagi siapa saja yang disesatkan Allah. Karena itu Allah berfirman, “Demikianlah Allah menyesatkan orang-orang yang dikehendakiNya dan memberi petunjuk kepada siapa yang dikehendakiNya.” Maka siapa pun yang diberi petunjuk oleh Allah, Allah menjadikan wahyu yang diturunkan pada RasulNya sebagai penambah penderitaan baginya, sebagai kegamangan dan kegelapan baginya. Berita yang diwahyukan Allah kepada RasulNya wajib diterima, karena “tidak ada yang mengetahui tentara Rabbmu melainkan Dia sendiri,” dari kalangan malaikat dan lainnya. Karena kalian tidak mengetahui tentaraNya dan kalian diberitahu mengenai itu oleh Dzat Yang Maha Mengetahui lagi melihat, kalian harus membenarkan beritaNya tanpa ragu. “Dan Saqar itu tiada lain hanyalah peringatan bagi manusia,” yakni dan tidaklah nasihat dan peringatan ini dimaksudkan untuk kesia-siaan dan main-main, tapi dimaksudkan sebagai peringatan bagi manusia terhadap apa pun yang berguna bagi mereka sehingga mereka melaksanakannya dan sebagai peringatan terhadap apa pun yang membahayakan mereka sehingga mereka tinggalkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 31: Allah mengabarkan bahwa Dia tidaklah menjadikan penjaga neraka, kecuali dari golongan malaikat yang keras, kejam dan bengis. Dan tidaklah Allah menjadikan jumlah para malaikat penjaga neraka sembilan belas malaikat kecuali ada hikmahnya dan sebagai ujian bagi orang-orang kafir yang berlipat-lipat ganda adzab bagi mereka, karena sebab mereka mendustakan dan mengolok-olok. Semakin bertambah kemarahan Allah atas mereka jika mereka tidak segera bertaubat, dan agar supaya mereka ahli kitab bertambah pembenarannya dan keyakinannya akan agama yang haq ini (islam) yang mereka akan mendapati penjelasannya di dalam Al Qur’an yang berkesesuaian dengan apa yang ada di dalama Taurat dan Injil. Dan agar supaya mereka bertambah (yaitu orang-orang beriman), bersama dengan keimanannya ketika mereka melihat bahwa Al Qur’an berkesesuaian dengan kitab-kitab yang diturunkan Allah sebelumnya. (Sehingga) tidak ada keraguan bagi ahli kitab dan orang-orang yang beriman akan hal itu. Berkata orang-orang yang mengingkari dan yang bersama dengan mereka yaitu orang-orang munafik, yang di hati mereka ada penyakit : Apa yang Allah inginkan dari jumlah (penjaga neraka) yang asing dan sedikit ini ? Dan perkataan yang semisal dengan ini, yang Allah sesatkan siapa yang dikehendaki-Nya dengan hikmah dan keadilan dari-Nya, dan Allah juga memberikan petunjuk bagi siapa yang dikehendakinya dengan kasih sayang dan sifat adil-Nya. Tidaklah satupun yang mengetahui jumlah dan jenis bala tentara-Nya kecuali hanya Allah, dan tidaklah neraka ini dan para penjaganya kecuali sebagai pengingat dan nasihat bagi manusia yang beriman kepada Allah, mentauhidkan-Nya dan menjauhi dari adzab-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka tidak dapat dikalahkan karena kuatnya mereka. Sehingga mereka berkata, “Mengapa jumlahnya sembilan belas?” Agar diketahui siapa yang membenarkan dan siapa yang mendustakannya. Atau maksud ‘sebagai cobaan’ adalah sebagai azab dan hukuman bagi orang-orang kafir. Karena sembilan belas jumlah malaikat itu sesuai dengan yang disebutkan dalam kitab mereka, dan ketika mereka mendapatkan kesamaan, maka bertambahlah keyakinan mereka. Yang demikian karena orang-orang mukmin setiap kali diturunkan ayat kepada mereka, maka mereka mengimani dan membenarkannya sehingga iman mereka bertambah. Tentang jumlah malaikat yang menjaga itu. Atau maksudnya, agar keragu-raguan dan syak hilang dari mereka. Inilah tujuan yang agung yang diperhatikan sekali oleh orang-orang yang berakal, yaitu berusaha agar keyakinan mereka bertambah,. Demikian pula iman mereka di setiap waktu. Yaitu penyakit syak (keragu-raguan), syubhat dan kemunafikan. Dalam keadaan bingung dan ragu serta kafir kepada ayat-ayat Allah. Seperti orang yang mengingkari jumlah itu. Seperti halnya orang yang membenarkan jumlah itu. Atau maksudnya, bahwa orang yang diberi petunjuk oleh Allah Subhaanahu wa Ta'aala, maka Dia jadikan apa yang diturunkan-Nya kepada rasul-Nya sebagai rahmat baginya, penambah iman dan agamanya. Sebaliknya orang yang disesatkan-Nya, maka Dia jadikan apa yang diturunkan-Nya kepada Rasul-Nya sebagai penambah kesengsaraan dan kebingungan. Dengan demikian, kita wajib menerima apa yang Allah dan Rasul-Nya beritakan meskipun kita belum mengetahui hikmahnya. Yakni tidak ada yang mengetahui jumlah tentara Allah (seperti jumlah malaikat) selain Dia Subhaanahu wa Ta'aala. Jika kamu tidak mengetahui jumlah tentara-Nya, maka apabila Dia Yang Maha Mengetahui lagi Mahateliti memberitakan, hendaknya kamu membenarkan berita-Nya tanpa meragukan lagi. Bisa juga maksudnya, bahwa peringatan yang disebutkan itu maksudnya bukanlah main-main, bahkan maksudnya adalah agar manusia dapat menyadari apa yang bermanfaat bagi mereka sehingga mereka melakukannya dan menyadari apa yang membahayakannya sehingga mereka meninggalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 31",
    "description": "Mendengar penjaga saqar ada sembilan belas, mereka menduga sembilan belas orang, kaum musyrik dengan angkuhnya menyatakan akan mengalahkan sembilan belas penjaga tersebut. Dan yang kami jadikan penjaga neraka itu hanya dari malaikat yang sangat kuat lagi kasar serta patuh kepada Allah, dan kami menentukan bilangan mereka yang sembilan belas itu hanya sebagai cobaan yang dapat menyebabkan kesesatan bagi orang-orang kafir yang menganggap sepele jumlah tersebut, di sisi lain agar orang-orang yang diberi kitab menjadi yakin karena bilangan tersebut sesuai dengan apa yang termaktub dalam kitab suci mereka, dan agar orang yang beriman bertambah imannya, agar orang-orang yang diberi kitab dan orang-orang mukmin itu tidak ragu-ragu. Dan agar orang-orang yang di dalam hatinya ada penyakit dan orang-orang kafir berkata, , 'apakah yang dikehendaki Allah dengan bilangan ini sebagai suatu perumpamaan'' demikianlah Allah membiarkan sesat orang-orang yang dia kehendaki dan memberi petunjuk kepada orang-orang yang dia kehendaki. Dan tidak ada yang mengetahui bala tentara tuhanmu kecuali dia sendiri. Dan saqar itu tidak lain hanyalah peringatan bagi manusia. 32-37. Untuk menafikan dugaan orang-orang kafir tentang kemampuan mereka menghadapi penjaga-penjaga neraka, atau untuk mengancam dan menghardik mereka yang memperolok-olokkan bilangan itu, maka Allah berfirman, sekali-kali tidak! aku bersumpah demi bulan, dan demi malam ketika telah berlalu, dan demi subuh apabila mulai terang, sesungguhnya saqar itu adalah salah satu bencana yang sangat besar, sebagai ancaman yang mengerikan dan sekaligus sebagai peringatan bagi manusia, yaitu bagi siapa di antara kamu yang ingin maju meraih kebajikan atau mundur sehingga enggan untuk meraihnya."
  }
]