[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-37. Perkaranya tidak seperti yang mereka katakan, berupa pendustaan kepada Rasulullah tentang apa yang beliau bawa. Allah bersumpah dengan rembulan, dengan malam ketika ia pergi dan berlalu, juga dengan Shubuh saat ia bersinar dan terbelah, sesungguhnya neraka merupakan salah satu perkara besar, sebagai peringatan dan ancaman bagi manusia, bagi siapa di antara kalian ingin mendekatkan dirinya kepada Tuhannya dengan melaksanakan ketaatan atau mundur dengan tidak melakukan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sebagai ancaman dan untuk menakut-nakuti manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36-37. Neraka menjadi peringatan bagi manusia, bagi siapa saja yang menginginkan peningkatan amal baik dan iman, atau justru terjerumus dalam keburukan dan kekufuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sebagai peringatan} peringatan bagi manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-37. Obyek yang disumpahkan Allah adalah FirmanNya, “Sesungguhnya Saqar itu adalah salah satu bencana yang amat besar,” yaitu sesungguhnya neraka adalah salah satu bencana besar dan penting. Karena Kami telah memberitahukannya kepada kalian dan kalian mengetahuinya, maka siapa saja di antara kalian yang mau, silahkan melaksanakan amalan yang mendekatkannya pada Allah dan mendekatkan pada keridhaanNya serta memasukannya pada negeri kemuliaanNya. Dan siapa yang mau, silahkan mengesampingkan tujuan penciptaannya dan apa pun yang dicintai dan diridhai Allah dan sebaliknya mengerjakan kemaksiatan-kemaksiatan dan mendekatkannya pada Neraka Jahanam, sebagaimana yang disebutkan dalam Firman Allah, “ Dan katakanlah: \"Kebenaran itu datangnya dari Tuhanmu; maka barangsiapa yang ingin (beriman) hendaklah ia beriman, dan barangsiapa yang ingin (kafir) biarlah ia kafir\". Sesungguhnya Kami telah sediakan bagi orang orang zalim itu neraka, yang gejolaknya mengepung mereka. Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.”- Al-kahfi:29-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 36: 32-37. Sekali-kali tidak, tidaklah urusannya sebagaimana kalian sangka wahai orang-orang musyrik, yaitu tidak mungkin di antara mampu menaklukkan para penjaga neraka jahannam; Aku bersumpah dengan bulan jika sinarnya menyinari alam, dengan malam jika muncul dan pergi dan dengan subuh jika matahari telah naik; Sungguh jahannam termasuk salah satu ujian dan musibah yang besar, dimana Allah menjadikan sebagai peringatan bagi siapa dari seorang hamba yang bersegera agar lolos darinya, yaitu dengan mentauhidkan Allah dan taat kepada-Nya, kemudian mengerjakan apa yang diperintahkan, dan menjauhi larangan-Nya; Atau bagi hamba yang menganggap remeh (dari peringatan jahannam) dan kemudian dia celaka karena sebab kesyirikan dan maksiat. Sungguh setiap apa yang terjadi di hari kiamat termasuk kondisi yang dahsyat, terhina yang memasukinya karena dahsyatnya segala keadaannya dan panas apinya yang menyambar-nyambar, yang cahaya apinya menyala siang dan malam, dan bahan bakaranya adalah manusia dan batu-batuan. Dan firman Allah : لِمَن شَآءَ, sebagai bantahan kepada jabariyyah yang mereka berkata : Sesungguhnya seorang hamba dikuasai dan tidak memiliki kehendak apapun baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 36",
    "description": "32-37. Untuk menafikan dugaan orang-orang kafir tentang kemampuan mereka menghadapi penjaga-penjaga neraka, atau untuk mengancam dan menghardik mereka yang memperolok-olokkan bilangan itu, maka Allah berfirman, sekali-kali tidak! aku bersumpah demi bulan, dan demi malam ketika telah berlalu, dan demi subuh apabila mulai terang, sesungguhnya saqar itu adalah salah satu bencana yang sangat besar, sebagai ancaman yang mengerikan dan sekaligus sebagai peringatan bagi manusia, yaitu bagi siapa di antara kamu yang ingin maju meraih kebajikan atau mundur sehingga enggan untuk meraihnya"
  }
]