[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-47. Setiap jiwa tergadai dan tergantung dengan apa yang diusahakannya, baik berupa kebaikan atau keburukan, ia tidak bebas sebelum menunaikan kewajiban dan hukuman yang harus dijalaninya, kecuali orang-orang Muslim yang ikhlas dari golongan kanan yang telah membebaskan leher mereka dengan ketaatan, mereka di dalam surga-surga yang sifatnya tidak dijangkau (oleh nalar). Sebagian bertanya kepada sebagian yang lain tentang orang-orang kafir yang berbuat jahat terhadap diri mereka sendiri, “Apa yang membuat kalian masuk ke dalam Neraka Jahanam dan membuat kalian merasakan panasnya?” para penjahat itu menjawab, “Di dunia kami tidak termasuk orang-orang yang mendirikan shalat, kami tidak bersedekah dan berbuat baik kepada fakir miskin, kami berbincang dalam kebatilan bersama orang-orang yang tersesat dan menyimpang, kami mendustakan hari hisab dan balasan, hingga kematian datang kepada kami sementara kami dalam kesesatan dan penyimpangan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Setiap jiwa bertanggung jawab atas segala perbuatan yang dilakukannya, bisa jadi amal perbuatan itu menjerumuskannya dan bisa jadi amal perbuatan itu menyelamatkannya dari kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38-39. Allah menyampaikan bahwa seluruh manusia akan mendapat siksaan atas dosa-dosa mereka dan terhalang dari kenikmatan pada hari kiamat akibat kekafiran dan kesesatan mereka. Sedangkan orang-orang beriman akan memasuki surga dan tidak terhalang darinya berkat amal kebaikan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ رَهِينَةٌ (Tiap-tiap diri bertanggung jawab atas apa yang telah diperbuatnya) Yakni dirinya tersandra oleh amal perbuatannya, bisa jadi amalannya akan menyelamatkannya atau akan membinasakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38-39. Setiap jiwa akan dimintai pertanggungjawaban di hadapan Allah atas ilmu yang dia miliki. Baik akan selamat ataupun akan binasa, kecuali golongan kanan yaitu mereka yang amal catatannya diberikan dari sisi kanan, mereka adalah golongan orang mukmin. Mereka tidak membebani jiwa mereka dengan dosa, mereka telah menyelamatkan jiwanya dengan berbagai perbuatan baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Setiap orang atas apa yang diusahakan itu bertanggung jawab} menanggung apa yang dikerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-48. “Tiap-tiap diri bertanggung jawab atas apa yang telah diperbuatnya,” atas perbuatan-perbuatan buruk dan jelek. Ia bertanggung jawab atasnya. Perbuatan buruknya mengharuskannya dibelenggu di lehernya dan mengharuskannya mendapatkan azab, “kecuali golongan kanan,” karena sesungguhnya mereka tidak tergadai tapi mereka terlepas dan bergembira, “berada di dalam surga, mereka tanya menanya, tentang (keadaan) orang-orang yang berdosa,” yakni berada di dalam surga, mereka mendapatkan semua yang mereka inginkan. Sempurnalah kenyamanan dan keamanan hingga mereka saling berhadap-hadapan dan bertanya satu sama lain, dan percakapan mereka sampai pada pertanyaan tentang orang-orang yang berdosa, bagaimana keadaan mereka, apakah mereka telah mendapatkan apa yang diancamkan Allah pada mereka? Sebagian mereka berkata kepada yang lain, apakah kalian melihat mereka? Mereka pun melihat orang-orang berdosa berada di tengah-tengah Neraka Jahim dalam keadaan tersiksa. Para penduduk surga bertanya pada mereka, “Apakah yang memasukkan kamu ke dalam Saqar (neraka),” yakni apa yang membuatmu masuk ke dalamnya, karena dosa apa kalian mendapatkan neraka? Mereka menjawab, “Kami dahulu tidak termasuk orang-orang yang mengerjakan shalat, dan kami tidak (pula) memberi makan orang miskin,” tidak ada keikhlasan untuk Allah Yang disembah, tidak memberi kebaikan dan manfaat bagi orang yang membutuhkan, “dan kami membicarakan yang batil, bersama dengan orang-orang yang membicarakannya,” yakni kami membicarakan yang batil dan kami jadikan sebagai pembantah kebenaran, “dan kami mendustakan Hari Pembalasan,” Inilah pengaruh dari pembicaraan tentang kebatilan; yaitu mendustakan kebenaran, dan siapakah yang berhak dari Yang Maha Haq pada hari itu? Tempat balasan amal perbuatan dan tegaknya kerajaan Allah dan hukumNya yang adil pada seluruh makhluk. Dan Kami terus menerus berada di atas langkah batil ini, “hingga datang kepada kami kematian.” ‘alyaqiin’ dalam ayat bermakna kematian. Pada saat mereka mati di atas kekufuran, berbagai usaha tidak berguna kala itu dan pintu harapan tertutup di hadapan wajah mereka, “maka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberikan syafaat,” karena orang-orang yang memberi syafaat hanya bisa memberi pada orang yang diridhai Allah, sedangkan orang-orang kafir itu, perbuatannya tidak diridhai Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 38: 38-47. Allah mengabarkan bahwa setiap diri pada hari kiamat akan mempertanggung jawabkan apa yang ia lakukan di sisi Allah; Entah itu dari amalan-amalan shalih atau yang selainnya, dan dari apa yang Allah telah wajibkan dari urusan ketauhidan seorang hamba dan ibadah. Adapun orang yang beriman dan jujur dengan keimanannya, mereka akan memiliki bukti dari amalan-amalan shalih mereka, mereka berada di kebun-kebun, dan tempat tinggal yang nyaman. Mereka di surga saling bertanya tentang kondisi orang-orang kafir, dan mereka bertanya-tanya sebelum mereka melihat orang-orang kafir di neraka; Ketika mereka (orang-orang mukmin) melihat mereka, mereka orang mukmin bertanya kepada orang-orang kafir dengan nada merendahkan dan menghina : Siapa yang memasukkan kalian ke dalam jahannam ? Dan mereka menjawab dengan terhina dan tertunduk : Sungguh akibat yang buruk menetap di tempat ini, sesungguhnya kami dahulu di dunia tidak mengerjakan shalat, dan kami tidak meyakini akan kewajibannya, kami juga tidak pernah bersedekah kepada orang-orang faqir dan miskin. Kami hobi membicarakan keburukan bersama orang-orang buruk, kami juga mendustakan hari perhitungan dan pembalasan sampai datang kematian pada kami, kemudian kami mati dalam kondisi tersesat dan di atas kemungkaran. Dan sekarang kami menyaksikan dengan mata-mata kami sendiri akan kebenaran itu yang dulu kami dustakan dan ingkari; Maka, apakah kami dapat kembali ke dunia sehingga kami dapat menjadi orang-orang yang ikhlas ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu perbuatannya yang buruk, ia terikat dengan perbuatannya itu dan telah dikalungkan ke lehernya serta berhak masuk neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 38",
    "description": "38-39. Ayat-ayat berikut merupakan pernyataan kepada manusia seluruhnya dalam kaitan dengan kebebasan memilih yang telah ditegaskan pada ayat-ayat sebelumnya. Manusia mau maju meraih kebaikan atau mundur yang jelas setiap orang bertanggung jawab atas apa yang telah dilakukannya masing-masing, kecuali golongan kanan golongan inilah yang meraih keberuntungan karena memilih yang baik"
  }
]