[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan sucikanlah dirimu dari dosa-dosa serta bersihkanlah bajumu dari najis."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَثِيَابَكَ فَطَهِّرْ (dan pakaianmu bersihkanlah) Allah memerintahkannya untuk membersihkan pakaiannya dan menjaga pakaian itu dari hal-hal najis. Qatadah mengatakan: yakni bersihkanlah jiwamu dari dosa-dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sucikan pakaianmu dari berbagai najis, dan sucikan batinmu dari berbagai penyakit hati"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan pakaianmu, bersihkanlah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan pakaianmu bersihkanlah.” Kemungkinan yang dimaksud dengan pakaian adalah seluruh perbuatan Rasulullah dan maksud membersihkannya adalah memurnikannya, tulus melaksanakannya, dilakukan secara sempurna dan menafikannya dari berbagai hal yang bisa membatalkan, merusak, dan mengurangi pahalanya, seperti syirik, riya’, nifak, ujub, takabur, lalai dan lain sebagainya yang diperintahkan untuk ditinggalkan dalam beribadah menyembah Allah. Perintah ini juga mencakup perintah untuk menyucikan baju dari najis karena hal itu adalah termasuk salah satu penyempurna kebersihan amal, khususnya dsalam Shalat sebagaimana yang dinyatakan oleh kebanyakan ulama bahwa menghilangkan najis merupakan salah satu syarat shalat. Bisa juga yang dimaksud dengan baju adalah baju yang kita kenal. Artinya, Rasulullah diperintahkan untuk menyucikannya dari seluruh najis di seluruh waktu, khususnya ketika masuk waktu Shalat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 4: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud pakaian di sini bisa semua amal, yaitu dengan membersihkan dan memurnikan amal itu dan melakukannya secara sempurna, serta membersihkannya dari segala yang membatalkan dan mengurangi amal itu baik berupa syirk, nifak, ‘ujub (bangga diri), takabbur (sombong), lalai dsb. yang seorang hamba diperintahkan untuk menjauhinya dalam beribadah kepada-Nya. Bisa juga maksud pakaian di sini adalah pakaian hakiki, yaitu dengan membersihkannya dari najis, dimana membersihkannya termasuk salah satu syarat shalat dan bahwa seseorang diperintahkan membersihkan pakaiannya dari semua najis di setiap waktu, terlebih ketika masuk ke dalam shalat. Jika seseorang diperintahkan membersihkan zhahir (bagian luar), maka diperintahkan pula membersihkan batin dari noda dosa dan maksiat dengan istighfar dan tobat, dan bahwa bersihnya zhahir termasuk penyempurna bersihnya batin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 4",
    "description": "3-4. Dalam menyampaikan dakwah pastilah akan banyak rintangan, maka hal itu tidak perlu merisaukan hatimu wahai nabi. Ikutilah petunjuk-ku, pertama, agar tetap tegar dan tidak pudar semangatmu, agungkanlah tuhanmu, dan kedua, untuk menunjang dakwahmu, bersihkanlah pakaianmu. 5-7. Dan petunjuk yang ketiga adalah, tinggalkanlah segala perbuatan yang keji seperti penyembahan berhala, betapa pun banyak yang melakukan. Petunjuk yang keempat, dan janganlah engkau, wahai nabi Muhammad, memberi yaitu usahamu dalam berdakwah dengan maksud untuk mendapatkan imbalan duniawi dari manusia. Dengan demikian engkau akan memperoleh balasan dari Allah, yang lebih banyak. Petunjuk terakhir, kelima, larangan memperoleh imbalan dapat menimbulkan kesulitan maka apabila menghadapi kesulitan ayat ini memberi petunjuk, dan hanya karena tuhanmu, maka bersabarlah, pasti engkau akan berhasil dalam dakwahmu."
  }
]