[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "48. Syafaat para pemberi syafaat dari kalangan para malaikat, para dan lainnya tidak bermanfaat bagi mereka, karena syafaat hanyalah untuk orang yang Allah ridhai dan Allah mengizinkan pemberi syafaat untuk memberinya syafaat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Maka pada hari Kiamat tidak bermanfaat bagi mereka syafaat dari pemberi syafaat baik kalangan Malaikat, para Nabi dan orang-orang saleh, karena di antara syarat diterimanya syafaat adalah keridaan Allah terhadap orang yang diberi syafaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48-49. Maka setelah itu, tidak ada yang dapat memberi pertolongan kepada mereka, sekalipun malaikat, nabi ataupun orang shaleh. Bukankah mereka adalah orang-orang yang menolak dan membangkan terhadap petunjuk dan peringatan Al-quran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberi syafaat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-48. “Tiap-tiap diri bertanggung jawab atas apa yang telah diperbuatnya,” atas perbuatan-perbuatan buruk dan jelek. Ia bertanggung jawab atasnya. Perbuatan buruknya mengharuskannya dibelenggu di lehernya dan mengharuskannya mendapatkan azab, “kecuali golongan kanan,” karena sesungguhnya mereka tidak tergadai tapi mereka terlepas dan bergembira, “berada di dalam surga, mereka tanya menanya, tentang (keadaan) orang-orang yang berdosa,” yakni berada di dalam surga, mereka mendapatkan semua yang mereka inginkan. Sempurnalah kenyamanan dan keamanan hingga mereka saling berhadap-hadapan dan bertanya satu sama lain, dan percakapan mereka sampai pada pertanyaan tentang orang-orang yang berdosa, bagaimana keadaan mereka, apakah mereka telah mendapatkan apa yang diancamkan Allah pada mereka? Sebagian mereka berkata kepada yang lain, apakah kalian melihat mereka? Mereka pun melihat orang-orang berdosa berada di tengah-tengah Neraka Jahim dalam keadaan tersiksa. Para penduduk surga bertanya pada mereka, “Apakah yang memasukkan kamu ke dalam Saqar (neraka),” yakni apa yang membuatmu masuk ke dalamnya, karena dosa apa kalian mendapatkan neraka? Mereka menjawab, “Kami dahulu tidak termasuk orang-orang yang mengerjakan shalat, dan kami tidak (pula) memberi makan orang miskin,” tidak ada keikhlasan untuk Allah Yang disembah, tidak memberi kebaikan dan manfaat bagi orang yang membutuhkan, “dan kami membicarakan yang batil, bersama dengan orang-orang yang membicarakannya,” yakni kami membicarakan yang batil dan kami jadikan sebagai pembantah kebenaran, “dan kami mendustakan Hari Pembalasan,” Inilah pengaruh dari pembicaraan tentang kebatilan; yaitu mendustakan kebenaran, dan siapakah yang berhak dari Yang Maha Haq pada hari itu? Tempat balasan amal perbuatan dan tegaknya kerajaan Allah dan hukumNya yang adil pada seluruh makhluk. Dan Kami terus menerus berada di atas langkah batil ini, “hingga datang kepada kami kematian.” ‘alyaqiin’ dalam ayat bermakna kematian. Pada saat mereka mati di atas kekufuran, berbagai usaha tidak berguna kala itu dan pintu harapan tertutup di hadapan wajah mereka, “maka tidak berguna lagi bagi mereka syafaat dari orang-orang yang memberikan syafaat,” karena orang-orang yang memberi syafaat hanya bisa memberi pada orang yang diridhai Allah, sedangkan orang-orang kafir itu, perbuatannya tidak diridhai Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 48: Allah mengabarkan bahwa mereka orang-orang kafir pada hari kiamat tidak ada yang memberikan syafaat kepada mereka untuk selamat dari adzab Allah. Dan telah diketahui bahwa tidak ada seorangpun yang diizinkan untuk memberi syafaat kepada mereka pelaku kesyirikan dan kekafiran. Dan bergunanya syafaat bagi mukmin yang bermaksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti para malaikat, para nabi dan orang-orang saleh, karena mereka tidaklah memberi syafaat kecuali kepada orang yang diridhai Allah, sedangkan amal mereka tidak diridhai Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 48",
    "description": "Kedurhakaan yang mereka lakukan berlanjut sampai kematian datang, maka mereka berharap kiranya mendapat syafaat atau pertolongan dari siapa saja. Maka Allah menegaskan, tidak berguna lagi bagi mereka syafaat pertolongan dari orang-orang yang memberikan syafaat seandainya dimungkinkan. 49-51. Konsekuensi yang akan dialami di akhirat sudah mereka ketahui, maka ayat ini mengecam para pendurhaka tersebut. Lalu mengapa mereka orang-orang kafir, berpaling dari peringatan Allah yakni Al-Qur'an dan juga tuntunan yang disampaikan rasulullah, seakan-akan mereka keledai liar yang lari terkejut, lari dari singa."
  }
]