[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan tinggalkanlah penyembahan terhadap berhala-berhala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَالرُّجْزَ فَاهْجُرْ (dan perbuatan dosa tinggalkanlah) Yakni tinggalkanlah segala patung dan berhala, dan janganlah kamu menyembahnya, karena itu merupakan sebab turunnya azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Tinggalkanlah semua bisikan setan, tinggalkan perbuatan dosa. Dosa adalah sebab turunnya azab, maka jangan kau menyembah mereka (setan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala yang keji} berhala-berhala itu {tinggalkanlah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Bila Rasulullah diperintahkan untuk menyucikan lahiriah, maka kesucian lahiriah adalah bagian dari kesempurnaan kesucian batin. “Dan perbuatan dosa (menyembah berhala) tinggalkanlah.” Kemungkinan yang dimaksud dengan ‘al-rujzu’ adalah patung dan berhala yang disembah di samping menyembah Allah. Allah memerintahkan Rasulullah untuk meninggalkannya dan melepaskan diri darinya dan dari segala sesuatu yang dinisbatkan padanya, baik berupa perkataan maupun perbuatan. Dan kemungkinan yang dimaksud dengan ‘al-rujzu’ adalah seluruh perbuatan buruk, baik yang lahir maupun yang batin. Sehingga perintah ini adalah perintah bagi Rasulullah untuk meninggalkan seluruh dosa, baik yang kecil maupun yang besar, baik yang lahir maupun yang batin, dan dalam hal ini termasuk syirik dan dosa-dosa lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 5: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ar Rujz di sini bisa maksudnya berhala, sehingga Beliau diperintahkan untuk tetap selalu meninggalkan menyembah berhala. Bisa juga maksud Ar Rujz di sini adalah semua amal dan ucapan yang buruk sehingga Beliau diperintahkan untuk meninggalkan dosa-dosa baik yang kecil maupun besar, yang tampak maupun yang tersembunyi, termasuk pula syirk dan dosa-dosa di bawahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 5",
    "description": "5-7. Dan petunjuk yang ketiga adalah, tinggalkanlah segala perbuatan yang keji seperti penyembahan berhala, betapa pun banyak yang melakukan. Petunjuk yang keempat, dan janganlah engkau, wahai nabi Muhammad, memberi yaitu usahamu dalam berdakwah dengan maksud untuk mendapatkan imbalan duniawi dari manusia. Dengan demikian engkau akan memperoleh balasan dari Allah, yang lebih banyak. Petunjuk terakhir, kelima, larangan memperoleh imbalan dapat menimbulkan kesulitan maka apabila menghadapi kesulitan ayat ini memberi petunjuk, dan hanya karena tuhanmu, maka bersabarlah, pasti engkau akan berhasil dalam dakwahmu"
  }
]