[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-51. Mengapa orang-orang musyrik itu berpaling dari al-Quran yang berisi nasihat-nasihat? Mereka seperti keledai liar yang memberontak dan berlari dari singa buas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Seolah-olah mereka saat berpaling dan lari dari Al-Qur`ān itu bagaikan keledai liar yang sangat kuat merontanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. كَأَنَّهُمْ حُمُرٌ مُّسْتَنفِرَةٌ (seakan-akan mereka itu keledai liar yang lari terkejut) Yakni seperti keledai yang menakut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50-51. Mereka seperti keledai liar, yang lari terbirit-birit dan ketakutan dari kejaran singa yang menakutkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{seakan-akan mereka keledai liar} kuda yang bersandar {yang terkejut} terkejut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-53. Saat Allah menjelaskan akibat orang-orang yang menentang dan menjelaskan apa yang Allah lakukan pada mereka, Allah melanjutkannya dengan celaan terhadap orang-orang yang ada seraya berfirman, “Maka mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah),” menghalangi dan melalaikannya, “seakan-akan mereka itu,” karena amat kencangnya lari dari kebenaran “keledai liar yang lari terkejut,” yakni keledai liar lari, yang masing-masing membuat lari yang lain sehingga lari mereka semakin kencang, “lari dari singa,” yakni dari pemburu, pemanah yang menginginkannya atau dari singa dan lainnya. Ini adalah cara berpaling dari kebenaran yang paling dahsyat. Di samping lari dan berpaling seperti ini, mereka mengklaim beberapa hal besar, “masing-masing” dari mereka “berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka,” turun dari langit padanya dan mengklaim bahwa tidak akan ada yang tunduk kepada kebenaran kecuali dengan lembaran-lembaran itu. Mereka berdusta. Andai pun seluruh tanda-tanda kebesaran Allah tiba, niscaya mereka tidak akan beriman hingga mereka mendapatkan siksaan yang pedih. Sebab mereka telah kedatangan tanda-tanda kebesaran Allah yang jelas yang menjelaskan kebenaran. Andai pada diri mereka terdapat kebaikan, pasti mereka beriman, karena itu Allah berfirman, “Sekali-kali tidak,” yakni Kami tidak memberi apa yang mereka inginkan, mereka hanya ingin memperlemah dengan permintaan itu, “bahkan sebenarnya mereka tidak takut kepada negeri akhirat,” sebab andai mereka takut pada Hari Akhirat, tentu apa yang menimpa mereka tidak berlaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 50: 49-51. Allah berkata dengan takjub akan kegigihannya di atas kekafiran mereka : Kenapa kalian berpaling dari Al Qur’an wahai orang-orang musyrik dan yang terkandung di dalamnya dari nasihat-nasihat dan peringatan yang terpapar (jelas). Kemudian Allah menjelaskan sifat keras kepalanya mereka dan kekafiran mereka atas kebenaran, serta berpalingnya mereka dari Muhammad ﷺ dan agamanya, mereka mirip dengan keledai yang terkejut ketika melihat singa, ia lari dan ketakutan. Dan qaswaroh adalah nama di antara nama-nama singa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 50",
    "description": "49-51. Konsekuensi yang akan dialami di akhirat sudah mereka ketahui, maka ayat ini mengecam para pendurhaka tersebut. Lalu mengapa mereka orang-orang kafir, berpaling dari peringatan Allah yakni Al-Qur'an dan juga tuntunan yang disampaikan rasulullah, seakan-akan mereka keledai liar yang lari terkejut, lari dari singa"
  }
]