[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "52-53. Setiap orang dari kaum musyrikin itu berharap agar Allah menurunkan sebuah kitab yang terbuka dari langit sebagaimana Allah telah menurunkannya kepada Muhammad. Perkaranya tidak seperti yang mereka duga, sebaliknya mereka tidak takut kepada akhirat, tidak membenarkan kebangkitan dan pembalasan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Bahkan masing-masing dari orang-orang musyrik itu ingin di atas kepala mereka ada kitab terbuka yang mengabarkan bahwa Muhammad adalah utusan dari Allah. Hal itu bukan dikarenakan sedikitnya bukti dan hujah, akan tetapi dikarenakan kekeraskepalaan dan kesombongan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. kekafiran dan kebebalan orang-orang musyrik itu sampai-sampai membuat tiap-tiap mereka meminta kitab dari Allah yang khusus ditujukan kepadanya dan memintanya untuk beriman. Sungguh hal itu tidak akan terjadi, karena mereka memang bukanlah orang-orang yang beriman kepada Allah dan hari akhir, dan tidak takut dari azab pada hari tersebut; oleh sebab itu mereka berani untuk meminta hal yang demikian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. بَلْ يُرِيدُ كُلُّ امْرِئٍ مِّنْهُمْ أَن يُؤْتَىٰ صُحُفًا مُّنَشَّرَةً (Bahkan tiap-tiap orang dari mereka berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka) Para ahli tafsir mengatakan bahwa orang-orang kafir Quraisy berkata kepada Nabi Muhammad: “Hendaklah besok ada kitab yang terbuka dari Allah di sisi kepala kami yang menyatakan bahwa kamu adalah Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Namun, justru setiap orang musyrik menginginkan agar mereka mendapat kitab khusus untuk mereka sebagai pembenaran dan penetapan tentang kerasulanmu. As Siddi berkata: Mereka orang-orang musyrik berkata, jika Muhammad memang benar, maka seharusnya Muhammad menjadikan lembaran bagi kami semua yang dapat menyelamatkan kami dari siksa neraka. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bahkan, setiap orang dari mereka ingin diberi lembaran-lembaran} kitab {yang terbuka} terbuka lagi terbaca"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-53. Saat Allah menjelaskan akibat orang-orang yang menentang dan menjelaskan apa yang Allah lakukan pada mereka, Allah melanjutkannya dengan celaan terhadap orang-orang yang ada seraya berfirman, “Maka mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah),” menghalangi dan melalaikannya, “seakan-akan mereka itu,” karena amat kencangnya lari dari kebenaran “keledai liar yang lari terkejut,” yakni keledai liar lari, yang masing-masing membuat lari yang lain sehingga lari mereka semakin kencang, “lari dari singa,” yakni dari pemburu, pemanah yang menginginkannya atau dari singa dan lainnya. Ini adalah cara berpaling dari kebenaran yang paling dahsyat. Di samping lari dan berpaling seperti ini, mereka mengklaim beberapa hal besar, “masing-masing” dari mereka “berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka,” turun dari langit padanya dan mengklaim bahwa tidak akan ada yang tunduk kepada kebenaran kecuali dengan lembaran-lembaran itu. Mereka berdusta. Andai pun seluruh tanda-tanda kebesaran Allah tiba, niscaya mereka tidak akan beriman hingga mereka mendapatkan siksaan yang pedih. Sebab mereka telah kedatangan tanda-tanda kebesaran Allah yang jelas yang menjelaskan kebenaran. Andai pada diri mereka terdapat kebaikan, pasti mereka beriman, karena itu Allah berfirman, “Sekali-kali tidak,” yakni Kami tidak memberi apa yang mereka inginkan, mereka hanya ingin memperlemah dengan permintaan itu, “bahkan sebenarnya mereka tidak takut kepada negeri akhirat,” sebab andai mereka takut pada Hari Akhirat, tentu apa yang menimpa mereka tidak berlaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 52: 52-53. Allah menjelaskan bahwa mereka orang-orang pendusta, mereka menginginkan (karena sebab hasad dan ketidak relaannya) agar Allah menurunkan pada setiap dari mereka kitab sucu yang khusus, diturunkan dari langit yang dituliskan di dalamnya bahwa Muhammad ﷺ adalah utusan-Nya, sebagaimana Allah menurunkan kitab-Nya kepada Nabi-Nya ﷺ. Akan tetapi sangat jauh mereka mendapatkan derajat kenabian. Ketahuilah wahai orang-orang yang mendustakan, bahwa urusannya tidak sebagaimana yang kalian klaim; Akan tetapi yang benar adalah kalian adalah kaum yang tidak mengetahui akhirat, juga tidak membenarkan hari kebangkitan dan pembalasan serta hisab. Dan tuntutan kalian ini mengada-ngada atas nama Pemilik Risalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di samping mereka menjauhi kebenaran, mereka juga menuntut tuntutan-tuntutan yang besar. Yang turun dari langit, sebagaimana ucapan mereka, Kami sekali-kali tidak akan mempercayaimu sehingga engkau turunkan atas kami sebuah kitab yang bisa kami baca.” (lihat surah Al Israa’: 93) Mereka menyangka, bahwa dengan cara seperti itu, mereka akan beriman dan tunduk kepada kebenaran, padahal mereka berdusta, karena meskipun setiap ayat datang kepada mereka, mereka tetap saja tidak beriman sampai mereka melihat azab yang pedih. Kalau sekiranya, dalam diri mereka terdapat kebaikan, tentu mereka akan beriman karena tidak ada satu pun rasul kecuali telah membawa bukti terhadap kebenarannya yang biasanya diimani oleh manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 52",
    "description": "Setelah digambarkan sikap lahiriah para pendurhaka yang lari kebingungan bagaikan keledai, kini dilukiskan tentang keadaan batin mereka. Bahkan yang lebih aneh lagi setiap orang dari mereka ingin agar diberikan kepadanya lembaran-lembaran kitab yang terbuka dari tuhan. 53-55. Sebagai tanggapan atas usul dan keinginan mereka tersebut, ayat ini menegaskan, sekali-kali tidak! sebenarnya mereka tidak takut kepada siksa akhirat. Kalau sikap mereka tetap seperti itu maka sekali-kali tidak! sesungguhnya Al-Qur'an itu benar-benar suatu peringatan. Maka barangsiapa menghendaki, tentu dia mengambil pelajaran darinya, karena fungsi utama Al-Qur'an di antaranya adalah sebagai peringatan bagi manusia."
  }
]