[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "52-53. Setiap orang dari kaum musyrikin itu berharap agar Allah menurunkan sebuah kitab yang terbuka dari langit sebagaimana Allah telah menurunkannya kepada Muhammad. Perkaranya tidak seperti yang mereka duga, sebaliknya mereka tidak takut kepada akhirat, tidak membenarkan kebangkitan dan pembalasan amal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Perkaranya bukan demikian, akan tetapi penyebab mereka tetap bergelimang dalam kesesatan mereka adalah bahwa mereka tidak beriman kepada siksa akhirat, maka mereka tetap pada kekufuran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Tidak! Ungkapan untuk menolak dan mencela permintaan mereka yang keras kepala terhadap ayat-ayat atau mukjizat Alquran. Bahkan (bal: ungkapan untuk menegaskan kekeraskepalaan mereka mengenai perbuatan mereka sehingga mereka diazab) bukankah mereka sendiri yang mengingkari kebenaran kehidupan akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekali-kali tidak Sebenarnya mereka tidak takut pada akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49-53. Saat Allah menjelaskan akibat orang-orang yang menentang dan menjelaskan apa yang Allah lakukan pada mereka, Allah melanjutkannya dengan celaan terhadap orang-orang yang ada seraya berfirman, “Maka mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah),” menghalangi dan melalaikannya, “seakan-akan mereka itu,” karena amat kencangnya lari dari kebenaran “keledai liar yang lari terkejut,” yakni keledai liar lari, yang masing-masing membuat lari yang lain sehingga lari mereka semakin kencang, “lari dari singa,” yakni dari pemburu, pemanah yang menginginkannya atau dari singa dan lainnya. Ini adalah cara berpaling dari kebenaran yang paling dahsyat. Di samping lari dan berpaling seperti ini, mereka mengklaim beberapa hal besar, “masing-masing” dari mereka “berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka,” turun dari langit padanya dan mengklaim bahwa tidak akan ada yang tunduk kepada kebenaran kecuali dengan lembaran-lembaran itu. Mereka berdusta. Andai pun seluruh tanda-tanda kebesaran Allah tiba, niscaya mereka tidak akan beriman hingga mereka mendapatkan siksaan yang pedih. Sebab mereka telah kedatangan tanda-tanda kebesaran Allah yang jelas yang menjelaskan kebenaran. Andai pada diri mereka terdapat kebaikan, pasti mereka beriman, karena itu Allah berfirman, “Sekali-kali tidak,” yakni Kami tidak memberi apa yang mereka inginkan, mereka hanya ingin memperlemah dengan permintaan itu, “bahkan sebenarnya mereka tidak takut kepada negeri akhirat,” sebab andai mereka takut pada Hari Akhirat, tentu apa yang menimpa mereka tidak berlaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 53: 52-53. Allah menjelaskan bahwa mereka orang-orang pendusta, mereka menginginkan (karena sebab hasad dan ketidak relaannya) agar Allah menurunkan pada setiap dari mereka kitab sucu yang khusus, diturunkan dari langit yang dituliskan di dalamnya bahwa Muhammad ﷺ adalah utusan-Nya, sebagaimana Allah menurunkan kitab-Nya kepada Nabi-Nya ﷺ. Akan tetapi sangat jauh mereka mendapatkan derajat kenabian. Ketahuilah wahai orang-orang yang mendustakan, bahwa urusannya tidak sebagaimana yang kalian klaim; Akan tetapi yang benar adalah kalian adalah kaum yang tidak mengetahui akhirat, juga tidak membenarkan hari kebangkitan dan pembalasan serta hisab. Dan tuntutan kalian ini mengada-ngada atas nama Pemilik Risalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai penolakan terhadap keinginan mereka agar diturunkan kitab langsung dari langit, karena maksud mereka hanyalah untuk melemahkan bukan untuk mencari dan mengikuti kebenaran. Kalau sekiranya mereka takut kepada akhirat, tentu mereka tidak akan berkata dan berbuat seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 53",
    "description": "53-55. Sebagai tanggapan atas usul dan keinginan mereka tersebut, ayat ini menegaskan, sekali-kali tidak! sebenarnya mereka tidak takut kepada siksa akhirat. Kalau sikap mereka tetap seperti itu maka sekali-kali tidak! sesungguhnya Al-Qur'an itu benar-benar suatu peringatan. Maka barangsiapa menghendaki, tentu dia mengambil pelajaran darinya, karena fungsi utama Al-Qur'an di antaranya adalah sebagai peringatan bagi manusia"
  }
]