[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-56. Benar, sesungguhnya al-Quran adalah nasihat mendalam yang cukup untuk menasihati mereka. Barangsiapa menginginkan nasihat, tentu dia akan mengambilnya dan mengambil manfaat dari petunjuknya. Dan mereka tidak akan mengambil nasihat darinya kecuali bila Allah menghendaki petunjuk untuk mereka. Allah patut untuk ditaati dan ditakwai, serta patut mengampuni siapa yang beriman dan menaatiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Maka barangsiapa ingin membaca Al-Qur`ān dan mendapatkan nasihatnya, maka ia membacanya dan mengambil nasihat dengannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Barang siapa yang menghendaki mengambil pelajaran darinya, maka dia akan membacanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa yang berkehendak tentu mengambil pelajaran darinya} mengambil pelajaran darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-56. “Sekali-kali tidak demikian halnya. Sesungguhnya al-Quran itu adalah peringatan.” Kata ganti dalam ayat ini kemungkinan merujuk kepada surat atau segala sesuatu yang terdapat dalam nasihay ini. “Maka barangsiapa menghendaki, niscaya dia mengambil pelajaran darinya (al-Quran),” karena al-Quran telah menjelaskan jalan lurus dan petunjuk. “Dan mereka tidak akan mengambil pelajaran darinya kecuali (jika) Allah menghendakinya,” karena sesungguhnya kehendak Allah berlaku secara umum. Tidak ada satu kejadian pun, baik kecil atau besar yang luput dari kehendak Allah. Di sini terdapat bantahan bagi Qadariyah yang memasukkan perbuatan manusia di bawah kehendak Allah sekaligus sebagai bantahan bagi Jabariyah yang mengira bahwa manusia tidak memiliki kehendak dan perbuatan secara hakiki, tapi semuanya dipaksa untuk dilakukan. Dalam ayat ini Allah menegaskan adanya kehendak hakiki dan nyata bagi manusia. Allah menjadikan kehendak manusia sebagai pengikut kehendakNya. “Dia (Allah) adalah Rabb Yang patut (kita) bertakwa kepadaNya dan berhak memberi ampun,” yakni Dia patut ditakuti dan disembah, karena hanya Dia-lah Tuhan yang sepatutnya disembah dan patut untuk memberi ampunan pada siapa saja yang bertakwa padaNya dan mencari ridhaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 55: 54-56. Ketahuilah wahai manusia, sungguh kebenaran bahwa Al Qur’an ini adalah peringatan dan nasihat yang sempurna untuk memuliakan kalian. Maka barangsiapa yang menginginkan keselamatan, terimalah ayat-ayat Allah, dan pergunakan sebagai jalan hidayah dan petunjuk, akan tetapi semua ini tidaklah dapat diterima dan sempurna kecuali dengan kehendak Allah. Dan sungguh ketika Allah telah menghendaki, maka Ia jadikan mereka orang-orang yang terpilih, kemudian dipilihlah mereka di atas kesesatan setelah mendapat petunjuk. Kemudian Allah menjelaskan bahwa Dialah yang berhak ditaati dan yang berhak untuk diminta ampunan. Dan telah terbuka pintu bagi orang-orang yang bertaubat, yang mereka meminta kepada Allah ampunan dan kasih sayang; Dan Allah menyambut orang-orang yang bertakwa dan beriman. Adapun, orang-orang yang menolak dan memerangi para Rasul-Nya, maka mereka adalah orang-orang yang telah Allah jadikan hati-hati mereka memiliki tabiat demikian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena Allah Subhaanahu wa Ta'aala telah menerangkan jalan dan dalilnya kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 55",
    "description": "53-55. Sebagai tanggapan atas usul dan keinginan mereka tersebut, ayat ini menegaskan, sekali-kali tidak! sebenarnya mereka tidak takut kepada siksa akhirat. Kalau sikap mereka tetap seperti itu maka sekali-kali tidak! sesungguhnya Al-Qur'an itu benar-benar suatu peringatan. Maka barangsiapa menghendaki, tentu dia mengambil pelajaran darinya, karena fungsi utama Al-Qur'an di antaranya adalah sebagai peringatan bagi manusia. 56. Ayat sebelumnya dapat menimbulkan kesan bahwa manusia memiliki kebebasan mutlak, maka ayat ini menegaskan bahwa, dan mereka tidak akan mengambil pelajaran dari Al-Qur'an kecuali jika Allah menghendakinya. Dialah tuhan yang patut kita bertakwa kepada-Nya dengan melaksanakan segala perintah-Nya dan menjauhi larangan-Nya, dan dia juga yang berhak memberi ampunan kepada siapa pun yang dikehendaki-Nya."
  }
]