[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-56. Benar, sesungguhnya al-Quran adalah nasihat mendalam yang cukup untuk menasihati mereka. Barangsiapa menginginkan nasihat, tentu dia akan mengambilnya dan mengambil manfaat dari petunjuknya. Dan mereka tidak akan mengambil nasihat darinya kecuali bila Allah menghendaki petunjuk untuk mereka. Allah patut untuk ditaati dan ditakwai, serta patut mengampuni siapa yang beriman dan menaatiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan tidaklah mendapat pelajaran dari Al-Qur`ān kecuali orang-orang yang dikehendaki Allah untuk mendapatkan pelajaran darinya. Allah -Subḥānahu- adalah Żat yang patut untuk kita bertakwa kepada-Nya dengan menaati berbagai perintah-Nya dan menjauhi segala larangan-Nya, dan Dia adalah Żat Yang berhak mengampuni dosa hamba-hamba-Nya jika mereka bertobat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَمَا يَذْكُرُونَ إِلَّآ أَن يَشَآءَ اللَّـهُ ۚ (Dan mereka tidak akan mengambil pelajaran daripadanya kecuali (jika) Allah menghendakinya) Yakni kecuali jika Allah menghendaki petunjuk bagi mereka. هُوَ أَهْلُ التَّقْوَىٰ (Dia (Allah) adalah Tuhan Yang patut (kita) bertakwa kepada-Nya) Yakni Allah layak untuk ditakuti oleh orang-orang bertakwa dengan tidak bermaksiat kepada-Nya dan dengan melakukan berbagai ketaatan untuk-Nya. وَأَهْلُ الْمَغْفِرَةِ (dan berhak memberi ampun) Yakni Allah layak memberi ampunan bagi orang-orang beriman atas dosa-dosa yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Tidak akan ada siapapun yang bisa mengambil pelajaran dari Alquran kecuali atas kehendak Allah, Dia-lah yang berkuasa atas itu. Sehingga dari pelajaran Alquran itu, sehingga seseorang bisa menjaga diri dalam ketaatan dan meninggalkan perbuatan maksiat kepada Allah. Juga bagi orang mukmin dan ahli taubat berhak mendapat ampunan atas dosa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak akan mengambil pelajaran} mereka tidak mengambil pelajaran {darinya, kecuali Allah menghendakinya. Dialah yang patut (kita) bertakwa kepadaNya} yang berhak untuk kita bertakwa dan taat kepadaNya {dan yang berhak memberi ampunan} dan berhak memgampuni orang yang bertaubat di antara para hambaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54-56. “Sekali-kali tidak demikian halnya. Sesungguhnya al-Quran itu adalah peringatan.” Kata ganti dalam ayat ini kemungkinan merujuk kepada surat atau segala sesuatu yang terdapat dalam nasihay ini. “Maka barangsiapa menghendaki, niscaya dia mengambil pelajaran darinya (al-Quran),” karena al-Quran telah menjelaskan jalan lurus dan petunjuk. “Dan mereka tidak akan mengambil pelajaran darinya kecuali (jika) Allah menghendakinya,” karena sesungguhnya kehendak Allah berlaku secara umum. Tidak ada satu kejadian pun, baik kecil atau besar yang luput dari kehendak Allah. Di sini terdapat bantahan bagi Qadariyah yang memasukkan perbuatan manusia di bawah kehendak Allah sekaligus sebagai bantahan bagi Jabariyah yang mengira bahwa manusia tidak memiliki kehendak dan perbuatan secara hakiki, tapi semuanya dipaksa untuk dilakukan. Dalam ayat ini Allah menegaskan adanya kehendak hakiki dan nyata bagi manusia. Allah menjadikan kehendak manusia sebagai pengikut kehendakNya. “Dia (Allah) adalah Rabb Yang patut (kita) bertakwa kepadaNya dan berhak memberi ampun,” yakni Dia patut ditakuti dan disembah, karena hanya Dia-lah Tuhan yang sepatutnya disembah dan patut untuk memberi ampunan pada siapa saja yang bertakwa padaNya dan mencari ridhaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 56: 54-56. Ketahuilah wahai manusia, sungguh kebenaran bahwa Al Qur’an ini adalah peringatan dan nasihat yang sempurna untuk memuliakan kalian. Maka barangsiapa yang menginginkan keselamatan, terimalah ayat-ayat Allah, dan pergunakan sebagai jalan hidayah dan petunjuk, akan tetapi semua ini tidaklah dapat diterima dan sempurna kecuali dengan kehendak Allah. Dan sungguh ketika Allah telah menghendaki, maka Ia jadikan mereka orang-orang yang terpilih, kemudian dipilihlah mereka di atas kesesatan setelah mendapat petunjuk. Kemudian Allah menjelaskan bahwa Dialah yang berhak ditaati dan yang berhak untuk diminta ampunan. Dan telah terbuka pintu bagi orang-orang yang bertaubat, yang mereka meminta kepada Allah ampunan dan kasih sayang; Dan Allah menyambut orang-orang yang bertakwa dan beriman. Adapun, orang-orang yang menolak dan memerangi para Rasul-Nya, maka mereka adalah orang-orang yang telah Allah jadikan hati-hati mereka memiliki tabiat demikian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang demikian karena kehendak Allah berlaku dan merata di alam semesta, dimana tidak ada sesuatu pun yang terjadi kecuali dengan kehendak-Nya. Dalam ayat ini dan sebelumnya terdapat bantahan terhadap golongan Qadariyyah yang mengatakan bahwa manusia bebas berkehendak dan tidak ada yang berkuasa terhadapnya, dan terdapat bantahan terhadap Jabariyyah yang mengatakan bahwa manusia tidak memiliki kehendak, maka di ayat di atas Allah Subhaanahu wa Ta'aala menetapkan kehendak bagi manusia secara hakiki dan menjadikan hal tersebut mengikuti kehendak Allah Subhaanahu wa Ta'aala. Yakni berhak untuk ditujukan takwa dan diibadahi karena Dia adalah Tuhan yang tidak ada yang berhak disembah selain Dia. Bagi orang-orang yang bertakwa dan mengikuti keridhaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 56",
    "description": "Ayat sebelumnya dapat menimbulkan kesan bahwa manusia memiliki kebebasan mutlak, maka ayat ini menegaskan bahwa, dan mereka tidak akan mengambil pelajaran dari Al-Qur'an kecuali jika Allah menghendakinya. Dialah tuhan yang patut kita bertakwa kepada-Nya dengan melaksanakan segala perintah-Nya dan menjauhi larangan-Nya, dan dia juga yang berhak memberi ampunan kepada siapa pun yang dikehendaki-Nya. 1-2. Akhir surah al-Muddasir menguraikan tentang kiamat serta betapa mengerikannya peristiwa itu, namun kaum pendurhaka mendustakannya. Segala argumen sudah dipaparkan, kalau mereka tetap tidak beriman, maka ayat ini menunjukkan Allah, tidak akan meladeni mereka lagi. Aku bersumpah dengan kepastian hari kiamat karena semuanya sudah jelas, dan aku juga bersumpah dengan jiwa yang selalu menyesali dirinya sendiri. Sungguh manusia pasti akan dibangkitkan."
  }
]