[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan janganlah engkau pamrih terhadap Rabbmu dengan merasa telah banyak amal salehmu!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Janganlah kamu menganggap harta, upaya, ilmu, dan dakwah yang telah kamu kerahkan itu telah banyak; namun pandanglah itu masih sedikit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَلَا تَمْنُن تَسْتَكْثِرُ (dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak) Yakni janganlah kamu merasa berjasa bagi Tuhanmu karena telah mengemban kenabian, seperti orang yang menganggap banyak apa yang dipiikulnya karena kecemburuan terhadap apa yang dipikul orang lain. Pendapat lain mengatakan: yakni jika kamu memberi suatu pemberian kepada seseorang maka berikanlah karena mengharap ridha Allah, dan janganlah kamu merasa lebih tinggi karena pemberianmu terhadap orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Janganlah kamu (Muhammad) bermaksud memberikan sesuatu untuk mengharapkan balasan lebih banyak, namun berikan sesuatu dengan hanya mengharap ridha Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah memberi (agar) memperoleh yang lebih banyak} Janganlah memberi sesuatu agar diberi lebih banyak dari itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak,” yaitu janganlah engkau berharap pada manusia atas nikmat-nikmat dunia dan akhirat yang kau berikan sehingga kau meminta lebih atas pemberian itu dan kau melihat adanya keutamaan dirimu atas mereka. Tapi berbuat baiklah kepada manusia selagi kau mampu, lupakanlah kebaikanmu kepada mereka dan harapkan pahalamu dari Allah dan sikapilah orang yang kau perlakukan baik dan yang lain secara sama. Ada yang menyatakan bahwa maknanya, janganlah engkau memberi apa pun pada seseorang, dan engkau ingin orang itu memberi balasan lebih banyak untukmu, dan berarti ini khusus untuk Nabi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 6: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni janganlah engkau memberikan kepada manusia nikmat agar nikmat yang engkau miliki bertambah banyak, dan engkau merasa bahwa engkau telah berbuat baik kepada mereka atau punya jasa kepada mereka, bahkan berbuat ihsanlah kepada manusia sesuai kemampuanmu dan lupakanlah ihsanmu kepada mereka dan janganlah kamu meminta upahnya kecuali dari Allah Subhaanahu wa Ta'aala dan jadikanlah orang yang engkau berikan ihsan dan orang yang selainnya dalam keadaan sama. Ada pula yang mengatakan, bahwa maksudnya adalah janganlah engkau memberikan sesuatu kepada seorang pun dengan maksud agar orang itu membalasmu dengan yang lebih banyak dari yang engkau berikan. sehingga hal ini khusus untuk Nabi shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 6",
    "description": "5-7. Dan petunjuk yang ketiga adalah, tinggalkanlah segala perbuatan yang keji seperti penyembahan berhala, betapa pun banyak yang melakukan. Petunjuk yang keempat, dan janganlah engkau, wahai nabi Muhammad, memberi yaitu usahamu dalam berdakwah dengan maksud untuk mendapatkan imbalan duniawi dari manusia. Dengan demikian engkau akan memperoleh balasan dari Allah, yang lebih banyak. Petunjuk terakhir, kelima, larangan memperoleh imbalan dapat menimbulkan kesulitan maka apabila menghadapi kesulitan ayat ini memberi petunjuk, dan hanya karena tuhanmu, maka bersabarlah, pasti engkau akan berhasil dalam dakwahmu"
  }
]