[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-7. Wahai orang yang menyelimuti dirinya dengan kain selimutnya, bangkitlah dari tempat tidurmu, lalu peringatkanlah manusia dari azab Allah, khususkanlah Tuhanmu dengan pengagungan, tauhid dan ibadah, sucikanlah pakaianmu dari najis-najis, karena kesucian lahir termasuk kesempurnaan kesucian batin. Teruslah menjauhi patung dan berhala serta amal-amal syirik seluruhnya, jangan mendekatinya, jangan memberi sesuatu agar kamu mendapatkan lebih banyak. Dan demi meraih ridha Tuhanmu, bersabarlah kamu dalam menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan bersabarlah karena Allah terhadap halangan yang engkau dapati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Dan demi keridhaan Allah, maka bersabarlah dalam menanggung kesulitan, bersabarlah saat mendengar, melihat, dan mendapat gangguan dari kaummu akibat dakwah menuju tauhid dan hidayah yang kamu sampaikan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَلِرَبِّكَ فَاصْبِرْ (Dan untuk (memenuhi perintah) Tuhanmu, bersabarlah) Yakni kamu dibebani dengan urusan yang besar, sehingga orang-orang Arab dan lainnya akan memarangimu, maka bersabarlah dalam menjalaninya karena Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Bersabarlah dalam menjalankan perintah dan risalah dari Allah, dan jangan putus asa oleh perkataan orang-orang musyrik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Karena Tuhanmu, bersabarlah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Dan untuk (memenuhi perintah) Rabbmu, bersabarlah,” dan berharaplah pahala Allah dengan kesabaranmu itu dan niatkanlah untuk Allah. Rasulullah melaksanakan perintah Rabbnya dan bersegera menunaikannya. Rasulullah memberikan peringatan pada manusia dan menjelaskan tuntutan-tuntutan ilahi pada mereka disertai dengan ayat-ayat yang jelas. Rasulullah mengagungkan Allah dan menyeru manusia agar mengagungkanNya, membersihkan perbuatan-perbuatan lahir dan batin dari segala keburukan, meninggalkan segala sesuatu yang disembah selain Allah dan yang disembah bersama Allah berupa patung dan keburukan beserta para penganutnya. Rasulullah memiliki pemberian agung pada manusia setelah karunia Allah tanpa mengharapkan balasan atau kata terima kasih dari mereka. Rasulullah bersabar demi Rabbnya dengan kesabaran paling sempurna, bersabar dalam melakukan ketaatan, bersabar dalam meninggalkan kemaksiatan, bersabar atas takdirNya yang menyakitkan, hingga Rasulullah mengungguli para rasul lain yang juga memiliki keteguhan hati. Semoga saja kesejahteraan dan keselamatan selalu tercurah bagi beliau dan seluruh sahabat beliau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muddatstsir ayat 7: 1-7. Surat ini dimulai dengan pemberian tanggung jawab kepada Nabi ﷺ untuk bangkit berdakwah dan menyampaikan dengan sungguh-sungguh. Dan Allah membuka surat ini panggilan lembut dan ramah kepada Nabi ﷺ sebagaimana pembukaan dalam surat Al Muzzammil, Allah berkata : Wahai orang yang tertutup atau berselimut di tempat tidurnya, berdirilah dari tempat tidurmu dan peringatkan manusia dari adzab Allah jika masih tetap dalam kesyrikan mereka, kemudian agungkan Tuhanmu dengan tauhid dan ibadah, sucikan pakaianmu dari najis dan kotoran; Maka jika selesai bersuci secara dzahir maka sempurnakan dengan bersuci secara bathin, kemudian tetaplah untuk meninggalkan sesembahan-sesembahan itu dan patung-patung serta beramal dari semua amalan-amalan kesyirikan dan berlepas dirilah dari sesembahan-sesembahan itu dan dari para penyembahnya. Dan janganlah kamu memberi dengan berharap mendapat balasan dari manusia, yaitu dari nasihat-nasihat dan petunjuk-petunjuk yang kamu berikan kepada mereka (dan kamu berharap) banyak balasan dari mereka. Jadikanlah amalanmu ikhlas karena wajah Allah, jangan engkau menginginkan satupun balasan dan ucapan terima kasih (dari mereka). Bersabarlah atas tanggung jawab/beban dan perintah-perintah yang Allah bebankan dengannya; Bersabarlah sampai melebihi orang-orang yang bersabar, begitu juga dengan amalan shalih, janganlah berharap lebih dari manusia, karena sebab karunia Allah (kepadamu) jauh lebih banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap menjalankan perintah dan menjauhi larangan, dan haraplah pahala dan keridhaan Allah dengan kesabaranmu itu. Maka Rasulullah shallallahu 'alaihi wa sallam melaksanakan perintah Tuhannya, segera melakukannya dan memberikan peringatan kepada manusia serta menerangkan kepada mereka semua tuntutan ilahi dengan ayat-ayat yang jelas, Beliau juga mengagungkan Allah Ta’ala dan mengajak manusia untuk mengagungkan-Nya, dan Beliau bersihkan amal Beliau baik yang tampak maupun yang tersembunyi dari semua keburukan serta menjauhi semua yang dapat menjauhikan diri dari Allah Subhaanahu wa Ta'aala seperti patung dan para penyembahnya, keburukan dan para pelakunya. Beliau memiliki jasa terhadap manusia setelah nikmat Allah tanpa menuntut balasan dan rasa syukur dari mereka, Beliau juga bersabar karena Allah dengan sabar yang sangat sempurna; Beliau sabar dalam menjalankan perintah Allah, sabar dalam menjauhi larangan Allah dan terhadap taqdir Allah yang pedih sehingga Beliau melebihi para rasul ulul ‘azmi yang lain, maka semoga shalawat Allah dan salam dilimpahkan kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muddatstsir Ayat 7",
    "description": "5-7. Dan petunjuk yang ketiga adalah, tinggalkanlah segala perbuatan yang keji seperti penyembahan berhala, betapa pun banyak yang melakukan. Petunjuk yang keempat, dan janganlah engkau, wahai nabi Muhammad, memberi yaitu usahamu dalam berdakwah dengan maksud untuk mendapatkan imbalan duniawi dari manusia. Dengan demikian engkau akan memperoleh balasan dari Allah, yang lebih banyak. Petunjuk terakhir, kelima, larangan memperoleh imbalan dapat menimbulkan kesulitan maka apabila menghadapi kesulitan ayat ini memberi petunjuk, dan hanya karena tuhanmu, maka bersabarlah, pasti engkau akan berhasil dalam dakwahmu. 8-10. Kesulitan dalam dakwah tidaklah seberapa, akan ada saat yang lebih sulit lagi, maka apabila sangkakala ditiup yaitu hari kiamat telah tiba, maka itulah hari yang serba sulit, bagi siapa saja. Terlebih bagi orang-orang kafir yaitu yang keras kepala mengingkari kebenaran, pada hari itu tidak mudah, keadaannya akan diliputi kesulitan yang dahsyat."
  }
]