[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(alif lam ra). keterangan tentang huruf-huruf terputus-putus seperti ini telah berlalu pada permulaan surat al-baqarah. ini adalah ayat-ayat kitab yang mukhkam (jelas) yang sudah Allah terangkan dan jelaskan kepada para hambaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah. Ayat-ayat yang dibaca di surah ini merupakan ayat-ayat Al-Qur`ān yang muhkam (pasti), akurat, dan berisi hikmah dan hukum."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an. Ayat-ayat yang agung ini merupakan ayat-ayat al-Qur’an yang mengandung hikmah dan penjelasan hukum-hukum."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الٓر ۚ (Alif laam raa) Penjelasan tentang huruf-huruf ini telah disebutkan pada awal surat al-Baqarah. تِلْكَ(Inilah) Yakni ayat-ayat yang terdapat dalam surat ini. ءَايٰتُ الْكِتٰبِ(ayat-ayat Al kitab) Yakni al-Qur’an. الْحَكِيمِ(yang mengandung hikmah) Yakni mengandung penjelasan tentang halal, haram, had, dan hukum-hukum lainnya. Pendapat lain mengatakan, yakni mengandung hikmah. Dan pendapat lain mengatakan, yakni yang menetapkan hukum, sebagaimana firman Allah: وأنزل معهم الكتاب بالحق ليحكم بين الناس فيما اختلفوا فيه “dan Allah menurunkan bersama mereka Kitab dengan benar, untuk memberi keputusan di antara manusia tentang perkara yang mereka perselisihkan”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Alif lam Ra’. Huruf terakhir dilafalkan dengan disukun sebagaimana huruf-huruf abjad dilafalkan, yaitu Alif lam ra’. Huruf-huruf yang digunakan untuk menantang dan meneguhkah Al-Qur’an sekalipun lafadz-lafadznya terdiri dari huruf-huruf dari bahasa yang dilafalkan dan dituliskan bangsa Arab. Ayat yang diwahyukan itu adalah ayat-ayat Al-Qur’an yang menentukan hukum tentang halal-haram, batasan-batasan dan hukum"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Rā. Itulah ayat-ayat Kitab yang penuh hikmah} yang memberi hikmah dalam lafadz dan maknanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman, “Alif lam ra. Inilah ayat-ayat al-Quran yang mengandung hikmah.” Ia adalah al-Quran yang berisi hikmah dan hukum, ayat-ayatNya menunjukkan hakikat-hakikat iman, larangan-larangan dan perintah-perintah syari yang wajib diterima dengan kerelaan dan sambutan serta ketundukan oleh seluruh umat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 1: Yang penuh hikmah dan hukum, di mana ayat-ayat-Nya menunjukkan hakikat iman, perintah dan larangan, yang semua umat wajib menerimanya dengan sikap ridha dan menerima. Namun demikian, kebanyakan manusia berpaling darinya sehingga mereka tidak mengetahui yang akhirnya mereka merasa heran jika ada manusia yang diberi wahyu oleh Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 1",
    "description": "Alif lam ra. Hanya Allah yang mengetahui secara pasti makna huruf-huruf yang menjadi pembuka surah-surah dalam Al-Qur'an. Inilah ayatayat Al-Qur'an yang keseluruhannya penuh hikmah, yakni petunjuk yang hak dan terbaik bagi semua umat manusia. Apabila petunjuk tersebut diperhatikan dan dijalankan, maka akan mendatangkan kemaslahatan dan menghindarkan keburukan. Oleh karena itu, pantaskah manusia menjadi heran bahwa kami memberi wahyu, yakni memberi informasi dan tuntunan agama secara pasti, cepat, dan berbentuk rahasia, kepada seorang laki-laki di antara mereka, yakni nabi Muhammad yang dikenal sangat jujur sehingga mendapat gelar al-amin. Melalui wahyu tersebut kami perintahkan kepadanya: berilah peringatan kepada manusia bahwa hari pembalasan itu pasti datang dan orang yang jahat akan disiksa karena kejahatannya, dan gembirakanlah orang-orang beriman yang mengerjakan amal saleh, bahwa mereka mempunyai kedudukan yang tinggi, yakni kemuliaan di sisi tuhan kelak di akhirat. Setelah mendengar dan menyaksikan ayat-ayat Al-Qur'an yang disampaikan oleh nabi Muhammad ternyata sangat mempesona, maka orang-orang kafir berkata, orang ini, yakni nabi Muhammad, benar-benar pesihir yang nyata, dan yang dibawanya adalah sihir, sehingga membuat orang-orang terpesona dan mengikuti seruannya. Demikianlah sifat angkuh orang-orang yang tidak mau mengakui bahwa Al-Qur'an adalah wahyu dari Allah."
  }
]