[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Doa mereka di dalam surga berupa tasbih ”subhanakallahuma” dan penghormatan Allah dan para malaikat bagi mereka, dan juga ucapan selamat antar mereka di dalam surga adalah ucapan “salam”. Dan penutup doa mereka adalah ucapan mereka ”alhamdulillahirabbil ‘alamin”. Artinya, rasa syukur dan pujian hanya bagi Allah, pencipta makhluk-makhluk dan pendidik mereka dengan nikmat-nikmatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Doa yang mereka panjatkan di dalam Surga ialah ucapan yang mensucikan Allah. Sedangkan ucapan salam yang diucapkan oleh Allah dan para Malaikat serta mereka ucapkan satu sama lain ialah \"Salam\". Dan penutup doa mereka ialah pujian kepada Allah, Tuhan segenap makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. دَعْوَىٰهُمْ فِيهَا (Do’a mereka di dalamnya) Yakni doa dan seruan mereka di dalam surga. سُبْحٰنَكَ اللَّـهُمَّ(ialah: “Subhanakallahumma”) Yakni doa yang mereka panjatkan di dalam surga merupakan tasbih kepada Allah. وَتَحِيَّتُهُمْ فِيهَا سَلٰمٌ ۚ( dan salam penghormatan mereka ialah: “Salam”) Yakni ucapan salam kepada sesama mereka. Atau ucapan salam Allah bagi mereka. Atau ucapan salam malaikat bagi mereka. وَءَاخِرُ دَعْوَىٰهُمْ أَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ(Dan penutup doa mereka ialah: “Alhamdulilaahi Rabbil ‘aalamin”) Yakni penutup doa mereka yang berupa tasbih adalah ucapan “Alhamdulilaahi Rabbil ‘aalamin” (segala puju bagi Allah Tuhan semesta alam)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Doa-doa mereka saat bermunajat kepada Allah di surga adalah bertasbih kepada Allah (menyucikanNya dari sesuatu yang tidak sesuai dengan keagunganNya) dan menyucikanNya. Dan salam penghormatan mereka dari Tuhan dan para malaikat adalah “Salaam (semoga sejahtera)” Dan penutup doa mereka yang berupa tasbih itu adalah “Alhamdulillahi rabbil ‘aalamin alladzi an’amana bi hadzihil khatimatil hamidah minar ridwan wal jannah (Segala puji bagi Tuhan semesta alam yang memberi nikmat kepada kami dengan akhir yang terpuji berupa keridhaan dan surga)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Doa mereka di dalamnya} doa mereka di surga {adalah “Maha suci Engkau, ya Tuhan kami” penghormatan mereka di dalamnya adalah salam, dan doa penutup mereka} doa penutup mereka {adalah “segala puji bagi Allah, Tuhan semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Doa mereka di dalamnya ialah, ‘Subahanakallahumma’, maksudnya ibadah mereka di dalamnya kepada Allah yang pertama adalah tasbih dan menyucikan Allah dari kekurangan, dan yang terakhir adalah tahmid kepada Allah. Beban taklif gugur dari mereka di alam pembalasan. Yang tersisa bagi mereka adalah kenikmatan yang sempurna, yang lebih lezat bagi mereka daripada makanan yang lezat yaitu dzikrullah yang dengannya hati menjadi tenang, dan ruh menjadi bahagia. Ia bagi mereka sama dengan bernafas tanpa usaha dan kesulitan. “Dan,” adapun penghormatan mereka dalam perkara di antara mereka pada saat saling berkunjung dan bertemu adalah salam, yaitu ucapan yang bebas dari dosa dan hal yang tak berguna yang disifati bahwa ia adalah “salam”. Ada yang menafsirkan Firman Allah, “Doa mereka di dalamnya ialah, ‘Subhanakallahumma’… dan seterusnya,” bahwa jika penduduk Surga menginginkan makanan, minuman dan lain-lain lalu mereka mengucapkan subhanakallahumma, maka ia dihadirkan saat itu juga, jika mereka selesai, maka mereka mengucapkan, “Segala puji hanya bagi Allah Rabb alam semesta.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 10: Maksudnya puja dan puji mereka kepada Allah adalah ucapan “Subhaanakallahumma”. Ada pula yang menafsirkan, bahwa permintaan mereka kepada apa yang mereka inginkan di surga adalah dengan mengucapkan, “Subhaanakallahumma,” lalu permintaan mereka langsung ada di hadapan. Setelah selesai, mereka mengucapkan “Al Hamdulillahi Rabbil ‘aalamiin.” Ada pula yang menafsirkan, bahwa ibadah mereka di sana karena Allah, diawali dengan tasbih dan diakhiri dengan tahmid. Ketika itu semua beban telah gugur dari mereka, yang ada adalah kelezatan yang paling sempurna, yang lebih lezat dari makanan yang lezat, yaitu dzikrullah, di mana dengannya hati mereka tenang. Hal itu bagi mereka seperti bernafas tanpa ada beban sedikit pun. Penghormatan antara sesama mereka ketika bertemu dan berkunjung adalah salam; ucapan yang selamat dari ucapan sia-sia dan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 10",
    "description": "Sebagai gambaran dari keindahan dan kenyamanan kehidupan di dalam surga adalah setiap kata dan kalimat yang terucap tiada lain hanya pujian atas kebesaran Allah. Doa yang mereka ucapkan di dalamnya ialah, subha'nakalla'humma mahasuci engkau, ya tuhan kami, dan salam penghormatan kepada mereka dari Allah, malaikat dan sesama penghuni surga ialah, sala'm, semoga keselamatan yang sempurna selalu menyertai kamu. Dan penutup doa mereka ialah, al-hamdu lilla'hi rabbil 'a'lamin segala puji bagi Allah tuhan pemelihara seluruh alam. Setelah dijelaskan pada ayat sebelumnya bahwa Allah mahasuci dari segala kekurangan, mahasempurna dengan segala ciptaan-Nya, mahaadil dalam memberikan hukuman atau pahala, lalu dijelaskan pada ayat ini bahwa dia maha terpuji karena tidak segera menghukum orang yang durhaka sebagaimana permintaan mereka agar Allah menyegerakan siksa. Mereka diberi kesempatan untuk kembali kepada tuntunan Al-Qur'an. Dan kalau Allah menyegerakan keburukan, sebagai hukuman atas perbuatan jahat bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pasti diakhiri umur mereka, yakni dibinasakan. Namun kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan kami, yakni tidak percaya pada hari kiamat dalam keadaan bingung dan tetap berada di dalam kesesatan mereka sesuai kemauan mereka."
  }
]