[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah satu jiwa beriman kepada Allah, kecuali dengan izin Allah dan taufikNya.Maka janganlah kamu memaksakan diri dalam urusan itu, sebab sesungguhnya nasib mereka tergantung kepada Allah. Dan Allah akan menjatuhkan siksaaan dan kehinaan pada orang-orang yang tidak mau memahami perintah dan laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Dan tidak sepatutnya seseorang beriman atas kemauannya sendiri, melainkan dengan izin Allah. Jadi iman tidak akan terjadi tanpa kehendak Allah. Maka janganlah engkau terlalu berduka terhadap mereka. Dan Allah menimpakan azab dan kehinaan kepada orang-orang yang tidak memahami hujah-hujah-Nya, perintah-perintah-Nya dan larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Tidak ada orang yang beriman kecuali atas kehendak Allah. Dan Allah akan menimpakan azab dan kehinaan bagi orang-orang yang enggan mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. وَمَا كَانَ لِنَفْسٍ أَن تُؤْمِنَ إِلَّا بِإِذْنِ اللهِ ۚ (Dan tidak ada seorangpun akan beriman kecuali dengan izin Allah) Yakni tidak ada seorangpun yang teguh dan istiqamah dalam keimanannya kepada Allah kecuali dengan izin-Nya, karena sesuatu tidak mungkin terjadi tanpa kehendak-Nya. وَيَجْعَلُ الرِّجْسَ عَلَى الَّذِينَ لَا يَعْقِلُونَ(dan Allah menimpakan kemurkaan kepada orang-orang yang tidak mempergunakan akalnya) makna kemurkaan disini yakni azab, atau perbuatan hina yang menjadi sebab turunnya azab kepada orang-orang kafir yang tidak mau memahami hujjah-hujjah Allah dan tidak mau memikirkan ayat-ayat-Nya serta tidak mau memahami dalil-dalil yang ditegakkan atas mereka; dan contoh dari hal ini adalah mereka tidak mau memahami bahwa keimanan dan petunjuk hanya di tangan Allah, oleh sebab itu mereka tidak memohon kepada-Nya agar memberi mereka petunjuk menuju jalan yang lurus sehingga mereka tetap dalam kemurkaan dan kehinaan dan berhak mendapat kemarahan Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100 Tidak ada seorangpun bisa beriman kecuali atas kehendak dan pertolongan Allah. Tidak ada yang terjadi tanpa kehendakNya dan kami tidak mampu menunjukkan orang kepada jalannya. Sesungguhnya hal itu dikembalikan kepada Allah SWT. Allah menimpakan azab-Nya atas orang-orang yang tidak berpikir tentang ayat-ayatNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak} tidak sepatutnya {seseorang itu akan beriman, kecuali dengan izin Allah} dengan kehendak Allah {dan Dia menimpakan azab} azab {kepada orang-orang yang tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Dan tidak ada seorang pun yang akan beriman melainkan dengan izin Allah”, dengan kehendak dan keinginanNya qadariyah dan syar’iyyah. Siapa pun makhluk yang layak untuk itu, yang mana iman tumbuh padanya maka Allah memberinya hidayah dan taufik. “Dan Allah menimpakan azab “, kesesatan dan keburukan “kepada orang-orang yang tidak mempergunakan akalnya”, untuk memikirkan perintah-perintah dan larangan-larangan Allah, tidak mempedulikan nasiaht-nasihat dan wasiat-wasiatNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 100: Yakni dengan iradah dan kehendak-Nya serta izinnya yang bersifat qadari (terhadap alam semesta) lagi syar’i (sesuai syari’at-Nya). Oleh karena itu, jika di antara makhluk ada yang siap menerimanya, maka iman akan tumbuh dalam dirinya, kemudian Allah akan memberinya taufiq dan hidayah-Nya. Untuk mentadabburi ayat-ayat Allah Ta’ala, memperhatikan nasehat dan pelajaran-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 100",
    "description": "Keimanan tidak bisa dipaksakan, tetapi harus atas dasar kerelaan, dan tidak seorang pun akan beriman kecuali dengan izin Allah, dan Allah menimpakan azab, yakni berupa kekufuran yang berakibat pada kekotoran jiwa dan kegoncangan hati kepada orang yang tidak mengerti, yakni tidak mempergunakan akalnya untuk memikirkan petunjuk-Nya, sehingga tidak bisa melihat dan menerima kebenaran. Setelah dijelaskan pada ayat sebelumnya bahwa Allah akan menimpakan azab kepada orang yang tidak mau mempergunakan akalnya, lalu pada ayat ini Allah memerintahkan kepada nabi Muhammad, katakanlah kepada mereka, perhatikanlah ciptaan Allah, yaitu apa saja yang ada di langit dan di bumi! jika mereka mau menggunakan akal mereka untuk memikirkan tanda-tanda kebesaran dan kekuasaan Allah, tentu mereka sudah beriman. Namun mereka enggan melakukannya, sehingga tidaklah bermanfaat tanda-tanda kebesaran Allah dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman, karena mereka menutup hati mereka untuk menerima kebenaran."
  }
]