[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaummu, ”berpikirlah dan ambillah pelajaran dari apa yang ada di langit dan di bumi yang berisi tanda-tanda kuasa Allah yang nyata.” Akan tetapi, tanda-tanda kekuasaan, pelajaran-pelajaran, dan rasul-rasul yang memberi peringatan kepada hamba-hamba Allah terhadap siksaanNya, tidak memberikan manfaat bagi kaum yang tidak mengimani apapun dari perkara-perkara tersebut karena sikap berpaling dan penentangan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang bertanya kepadamu tentang ayat-ayat Allah, \"Renungkanlah tanda-tanda yang ada di langit dan bumi yang menunjukkan keesaan dan kekuasaan Allah.\" Tidak ada gunanya menurunkan ayat-ayat, hujah-hujah dan mengutus para Rasul kepada orang-orang yang tidak memiliki kesiapan untuk beriman, karena mereka bersikeras mempertahankan kekafiran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Allah memerintahkan rasul-Nya agar menyuruh orang-orang kafir memperhatikan ayat-ayat kauniyah yang ada di langit berupa kebesaran dan keluasannya, dan yang ada di bumi berupa kenikmatan-kenikmatannya, yang semua ini menunjukkan keesaan Sang Pencipta. Akan tetapi ayat-ayat yang agung ini dan para rasul yang memperingatkan dari azab Allah tidak berguna bagi orang-orang yang mendustakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. قُلِ انظُرُوا۟ مَاذَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۚ (Katakanlah: “Perhatikanlah apa yaag ada di langit dan di bumi) Yakni coba pahami dan ambillah pelajaran dari makhluk-makhluk yang menunjukkan kepada Sang Pencipta dan kepada keesaan dan kesempurnaan kuasa-Nya. وَمَا تُغْنِى الْاٰيٰتُ وَالنُّذُرُ(Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan) Yakni tidak bermanfaat bagi mereka turunnya ayat-ayat dan diutusnya para rasul. عَن قَوْمٍ لَّا يُؤْمِنُونَ(bagi orang-orang yang tidak beriman”) Dalam ilmu Allah mereka adalah orang-orang yang memang tidak pernah beriman. Dan barangsiapa dalam keadaan seperti ini maka tidak akan bermanfaat bagi mereka apapun dan tidak akan ada seorangpun yang dapat menghilangkan kekafiran dari mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seorang syaikh berkata : tidak terhitung betapa banyak pertanyaan menghampiriku dan aku hanya berdiri di hadapanya terlihat bingung. Tidakkah kamu melihat begitu banyak orang-orang memberikan peringatan namun respon untuknya begitu lemah dan terlihat dianggap remeh. Oleh karena itu aku takut jika saja jawaban yang tepat adalah : { وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ } \"Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman\". 2 ). Suatu ketika terjadi terjadi pembatalan penerbangan yang telah dijadwalkan, yang jumlahnya ribuan penerbangan dari berbagai maskapai! ratusan juta dolar uang melayang dengan sia-sia, apa sebabnya ? hanya dikarekana abu fulkanik yang menutupi kota dan bukan filaknikya secara langsung! Lalu bagaimana jika yang terjadi adalah meluapnya vulkanik dan lava yang amat sangat panas itu?!. Itu hanya satu derajat dari panasnya api neraka, dan ini adalah kekuatan dari makhluq ciptaan Allah, maka bagaimana dengan kekuatan dzat yang menciptakannya? Akan tetapi : { وَمَا تُغْنِي الْآيَاتُ وَالنُّذُرُ عَنْ قَوْمٍ لَا يُؤْمِنُونَ } \"Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101 Wahai Rasul, katakanlah kepada orang-orang kafir: “Perhatikanlah apa yang ada di langit dan bumi berupa keajaiban makhluk yang menunjukkan pada keberadan, keesaan dan kekuasaan Allah.Tidaklah bermanfaat tanda-tanda, bukti, dan rasul-rasul yang memberi peringatan itu mencegah azab bagi kaum yang teguh atas kekufuran dan iman mereka juga tidak bisa diharapkan dalam ilmu Allah SWT”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Perhatikanlah apa saja yang ada di langit dan di bumi” Tidaklah berguna} tidaklah bermaanfaat {tanda-tanda dan peringatan-peringatan itu dari kaum} dan para rasul dari kaum {yang tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Allah mengajak hamba-hambaNya agar melihat sesuatu yang ada di langit dan di bumi, maksudnya adalah melihat dengan merenungkan, memikirkan dan mengambil pelajaran terhadap apa yang ada padanya dana pa yang dikandungnya, karena di dalamnya terdapat tanda-tanda bagi kaum yang beriman dan pelajaran bagi kaum yang meyakini. Ia menunjukkan bahwa hanyalah Allah semata yang disembah, yang dipuji, Pemilik keagungan dan kebesaran, dan Pemilik Asma’ dan Shifat yang agung. “Tidaklah bermanfaat tanda kekuasaan Allah dan rasul-rasul yang memberi peringatan bagi orang-orang yang tidak beriman.” Mereka tidak mengambil manfaat dari ayat-ayat Allah karena mereka berpaling dan menyombongkan diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 101: Allah Subhaanahu wa Ta'aala mengajak hamba-hamba-Nya memperhatikan apa yang ada di langit dan di bumi. Memperhatikan di sini adalah dengan memikirkan, merenungi, mengambil pelajaran serta menyimpulkan apa yang ada di dalamnya, karena di sana terdapat ayat-ayat bagi kaum yang beriman serta pelajaran bagi orang-orang yang yakin, di mana semuanya menunjukkan bahwa Allah saja yang berhak disembah, yang Maha Terpuji, Pemilik kebesaran dan kemuliaan, serta memiliki nama-nama dan sifat yang agung. Karena mereka berpaling lagi menentang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 101",
    "description": "Setelah dijelaskan pada ayat sebelumnya bahwa Allah akan menimpakan azab kepada orang yang tidak mau mempergunakan akalnya, lalu pada ayat ini Allah memerintahkan kepada nabi Muhammad, katakanlah kepada mereka, perhatikanlah ciptaan Allah, yaitu apa saja yang ada di langit dan di bumi! jika mereka mau menggunakan akal mereka untuk memikirkan tanda-tanda kebesaran dan kekuasaan Allah, tentu mereka sudah beriman. Namun mereka enggan melakukannya, sehingga tidaklah bermanfaat tanda-tanda kebesaran Allah dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman, karena mereka menutup hati mereka untuk menerima kebenaran. Kalau keberadaan tanda-tanda kebesaran Allah di langit dan di bumi serta diutusnya para rasul tidak juga menjadikan mereka beriman, maka mereka tidak menunggu-nunggu kecuali kejadian-kejadian yang sama dengan kejadian-kejadian masa lalu, yakni azab yang menimpa orangorang terdahulu sebelum mereka. Katakanlah, wahai nabi Muhammad maka tunggulah kedatangan azab itu, sesungguhnya aku pun termasuk orang yang menunggu bersama kamu untuk menyaksikan ketetapan Allah itu menimpa kamu."
  }
]