[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah mereka itu menunggu, kecuali sekedar satu haru yang mereka akan menyaksikan langsung sikasaan Allah seperti hari-hari para pendahulu mereka yang mendustakan yang telah berlalu sebelum mereka. Katakanlah kepada mereka (wahai rasul), ”maka tungggulah siksaan Allah, sesungguhnya aku bersama kalian termasuk orang-orang yang menunggu siksaan atas kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Maka orang-orang kafir itu tidak menunggu apa-apa selain kejadian-kejadian seperti yang ditimpakan oleh Allah kepada orang-orang kafir sebelum mereka. Katakanlah -wahai Rasul- kepada mereka, \"Tunggulah azab Allah. Sesungguhnya aku -bersama kalian- juga sedang menunggu janji Tuhanku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Tidaklah orang-orang musyrik itu menunggu melainkan menunggu hari mereka menyaksikan azab Allah, sebagaimana hari terjadinya azab yang menimpa orang-orang sebelum mereka. Katakanlah kepada mereka: “Tunggulah azab Allah, karena aku juga menunggu bersama kalian kebinasaan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. فَهَلْ يَنتَظِرُونَ إِلَّا مِثْلَ أَيَّامِ الَّذِينَ خَلَوْا۟ مِن قَبْلِهِمْ ۚ (Mereka tidak menunggu-nunggu kecuali (kejadian-kejadian) yang sama dengan kejadian-kejadian (yang menimpa) orang-orang yang telah terdahulu sebelum mereka) Yakni tidaklah menunggu orang-orang kafir yang ada pada zaman Nabi Muhammad kecuali azab-azab Allah seperti yang ditimpakan atas orang-orang kafir sebelum mereka. Para nabi dahulu telah mengancam orang-orang kafir di zaman mereka dengan hari-hari yang dipenuhi dengan berbagai azab, namun mereka mendustakan para nabi dan terus menerus dalam kekafiran sampai Allah menurunkan azab kepada mereka. فَانتَظِرُوٓا۟ (Maka tunggulah) Yakni tunggulah janji Tuhan kalian. إِنِّى مَعَكُم مِّنَ الْمُنتَظِرِينَ (sesungguhnya akupun termasuk orang-orang yang menunggu bersama kamu) Menunggu janji Tuhanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102 Mereka, orang-orang musyrik yang kafir lagi menentang Nabi SAW tidak menunggu-nunggu kecuali peristiwa yang sama dengan peristiwa yang menimpa kaum kafir terdahulu sebelum mereka yang mendustakan rasul mereka dan berpegang pada kekufuran. Maka tunggulah janji Tuhan kalian, sesungguhnya akupun termasuk orang-orang yang menunggu janji dan ketentuanNya bersama kamu”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak menunggu} maka para pendusta itu tidak menunggu {kecuali seperti hari-hari} kejadian-kejadian {orang-orang terdahulu} yang telah lalu {sebelum mereka. Katakanlah,“Maka tunggulah, Sesungguhnya aku termasuk orang-orang yang menunggu bersama kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-103. “Tidaklah mereka menunggu-nunggu melainkan (kejadian-kejadian) yang sama dengan kejadian-kejadian (yang menimpa) ornag-orang yang telah terdahulu sebelum mereka.” Maksudnya, tidaklah orang-orang yang tidak beriman itu menunggu-nunggu ayat-ayat Allah setelah ia jelas melainkan seperti orang-orang yang berlalu sebelum mereka yaitu hari-hari kebinasaan dan azab, karena mereka melakukan yang mereka lakukan dan Sunnatullah berlaku untuk orang-orang terdahulu dan yang datang berikutnya. “Katakanlah, ‘Maka tunggulah, sesungguhnya aku pun termasuk orang-orang yang menunggu bersama kamu’.” Kamu akan mengetahui siapa yang akan mendapatkan akhir yang baik dan keselamatan di dunia dan akhirat. Ia hanya untuk para Rasul dan pengikut-pengikutnya. Oleh karena itu, Dia berfirman, “Kemudian Kami selamatkan rasul-rasul Kami dan orang-orang yang beriman”, dari kesulitan dan marabahaya dunia dan akhirat. “Demikianlah menjadi kewajiban atas Kami”, yang Kami wajibkan atas Diri Kamu “menyelamatkan orang-orang yang beriman.” Allah membela orang-orang yang beriman, berdasarkan keimanan yang dimiliki oleh seorang hamba, maka tercapailah keselamatan untuknya dari marabahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 102: Yakni orang-orang yang tidak beriman kepada ayat-ayat Allah setelah jelasnya tidaklah menunggu selain kebinasaan dan hukuman, karena mereka telah melakukan hal yang sama dengan generasi sebelum mereka yang dibinasakan, dan sunnatullah berlaku baik terhadap orang-orang terdahulu maupun yang datang kemudian. Yakni kamu akan mengetahui siapakah yang akan memperoleh kesudahan yang baik, dan memperoleh keselamatan di dunia dan akhirat. Sudah tentu akan yang akan memperolehnya adalah rasul dan pengikutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 102",
    "description": "Kalau keberadaan tanda-tanda kebesaran Allah di langit dan di bumi serta diutusnya para rasul tidak juga menjadikan mereka beriman, maka mereka tidak menunggu-nunggu kecuali kejadian-kejadian yang sama dengan kejadian-kejadian masa lalu, yakni azab yang menimpa orangorang terdahulu sebelum mereka. Katakanlah, wahai nabi Muhammad maka tunggulah kedatangan azab itu, sesungguhnya aku pun termasuk orang yang menunggu bersama kamu untuk menyaksikan ketetapan Allah itu menimpa kamu. Ketika ketetapan itu datang, kami siksa orang-orang yang durhaka itu, kemudian kami selamatkan rasul-rasul kami dan orang-orang yang beriman, demikianlah ketetapan kami, yakni menjadi kewajiban kami menyelamatkan dan memberikan kemenangan kepada orang yang beriman dan menghukum orang-orang yang durhaka."
  }
]