[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami menyelamatkan rasul-rasul kami dan orang-orang beriman yang bersama mereka. Sebagaimana kami telah menyelamatkan mereka, Kami juga menyelamatkan kamu wahai rasul, dan orang-orang yang beriman kepadamu sebagai bentuk karunia dan rahmat dari kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Kemudian Kami menjatuhkan hukuman kepada mereka, dan Kami selamatkan rasul-rasul Kami, dan Kami selamatkan juga orang-orang yang beriman bersama mereka. Maka mereka tidak tersentuh azab yang menimpa kaum mereka. Dan sebagaimana Kami telah menyelamatkan para Rasul dan orang-orang yang beriman bersama mereka, Kami pun akan menyelamatkan Rasulullah dan orang-orang yang beriman bersamanya dengan penyelamatan yang benar-benar menjadi tanggung jawab Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Kemudian Kami selamatkan Nabi Muhammad dan orang-orang beriman yang bersamanya, sebagaimana Kami selamatkan para rasul terdahulu. Demikianlah dengan karunia Kami, Kami selamatkan kamu dan orang-orang beriman yang bersamamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103 Kemudian Kami selamatkan rasul-rasul Kami dan orang-orang yang beriman kepada Kami dari azab dan Kami binasakan umat-umat yang zalim. demikianlah menjadi kewajiban atas Kami menyelamatkan orang-orang yang beriman kepada Nabi Muhammad SAW dari azab kami terhadap orang kafir, sebagaimana Kami telah menyelamatkan para rasul dan orang-orang yang beriman kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami menyelamatkan rasul-rasul Kami dan orang-orang yang beriman. Demikianlah menjadi ketentuan} keharusan {Kami untuk menyelamatkan orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-103. “Tidaklah mereka menunggu-nunggu melainkan (kejadian-kejadian) yang sama dengan kejadian-kejadian (yang menimpa) ornag-orang yang telah terdahulu sebelum mereka.” Maksudnya, tidaklah orang-orang yang tidak beriman itu menunggu-nunggu ayat-ayat Allah setelah ia jelas melainkan seperti orang-orang yang berlalu sebelum mereka yaitu hari-hari kebinasaan dan azab, karena mereka melakukan yang mereka lakukan dan Sunnatullah berlaku untuk orang-orang terdahulu dan yang datang berikutnya. “Katakanlah, ‘Maka tunggulah, sesungguhnya aku pun termasuk orang-orang yang menunggu bersama kamu’.” Kamu akan mengetahui siapa yang akan mendapatkan akhir yang baik dan keselamatan di dunia dan akhirat. Ia hanya untuk para Rasul dan pengikut-pengikutnya. Oleh karena itu, Dia berfirman, “Kemudian Kami selamatkan rasul-rasul Kami dan orang-orang yang beriman”, dari kesulitan dan marabahaya dunia dan akhirat. “Demikianlah menjadi kewajiban atas Kami”, yang Kami wajibkan atas Diri Kamu “menyelamatkan orang-orang yang beriman.” Allah membela orang-orang yang beriman, berdasarkan keimanan yang dimiliki oleh seorang hamba, maka tercapailah keselamatan untuknya dari marabahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 103: Dari azab yang turun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 103",
    "description": "Ketika ketetapan itu datang, kami siksa orang-orang yang durhaka itu, kemudian kami selamatkan rasul-rasul kami dan orang-orang yang beriman, demikianlah ketetapan kami, yakni menjadi kewajiban kami menyelamatkan dan memberikan kemenangan kepada orang yang beriman dan menghukum orang-orang yang durhaka. Setelah dijelaskan pada ayat yang lalu bahwa Allah akan menyelamatkan dan memberikan kemenangan kepada orang-orang yang beriman, lalu pada ayat ini diperintahkan, katakanlah wahai nabi Muhammad, wahai manusia! jika kamu masih dalam keraguraguan tentang kebenaran agamaku, maka ketahuilah bahwa aku tidak menyembah apa pun yang kamu sembah selain Allah, karena aku tahu hal itu adalah sesat dan sembahan kamu tidak dapat menolak madarat juga tidak bisa mendatangkan manfaat, tetapi aku menyembah Allah yang akan mematikan kamu, dan aku telah diperintah agar termasuk dalam golongan orang yang beriman yang mantap imannya,"
  }
]