[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada sekalain manusia, ”bila kalian masih dalam keraguan terhadap kebenaran agamaku yang aku mendakwahi kalian kepadanya, yaitu islam, dan termasuk keteghuhan dan istiqamahku, sedang kalin berharap mengalihkan aku darinya, maka sesunggguhnya aku tidak beribadah dalam kondisi apapun kepada apa-apa yang kalian sembah dari berhala-berhala dan patung-patung yang kalian jadikan tuhan-tuhan. Akan tetapi, aku hanya beribadah kepaada Allah, Dzat yang mematikan kalian dan mencabut ruh-ruh kalian. Dan aku diperintahkan untuk menjadi orang-orang yang beriman kepadaNya dan melaksanakan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Katakanlah -wahai Rasul-, \"Wahai manusia! Jika kalian ragu terhadap agama yang kuserukan kepada kalian, yaitu agama tauhid, maka aku benar-benar yakin tentang kesesatan agama kalian, sehingga aku tidak mau mengikutinya. Maka aku tidak akan menyembah apa-apa yang kalian sembah selain Allah. Tetapi aku menyembah Allah yang mematikan kalian dan menyuruhku menjadi orang yang memurnikan agama hanya kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104-106. Allah memerintahkan rasul-Nya dalam lima ayat yang akan disebutkan ini agar menyampaikan kepada jin dan manusia beberapa hal yang besar: Jika kalian ragu terhadap agama Islam yang aku dakwahkan ini, maka aku sama sekali tidak meragukannya, bahkan aku benar-benar yakin bahwa ia adalah agama yang benar. Ketehuilah bahwa aku berlepas diri dari berhala-berhala kalian, sehingga aku tidak menyembahnya; akan tetapi aku menyembah Dzat yang kehidupan dan kematian kalian ada di tangan-Nya. Aku diperintahkan untuk menjadi termasuk orang-orang beriman dan untuk istiqamah dan teguh di atas agama ini. Allah melarangku menjadi termasuk orang-orang musyrik dan menyembah selain Allah sesuatu yang tidak dapat memberi manfaat atau mudharat kepadaku jika aku menyembahnya atau tidak menyembahnya. Seandainya jika aku melanggar perintah dan larangan ini, maka aku termasuk orang-orang yang menzalimi diri sendiri, karena kesyirikan merupakan kezaliman yang paling besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. قُلْ يٰٓأَيُّهَا النَّاسُ إِن كُنتُمْ فِى شَكٍّ مِّن دِينِى (Katakanlah: “Hai manusia, jika kamu masih dalam keragu-raguan tentang agamaku) Yaitu agama yang menjadikan peribadatan hanya kepada Allah semata tanpa menyekutukan-Nya, dan juga jika kalian tidak memahami hakikat agama ini, maka ketahuilah bahwa aku berlepas diri dari agama-agama yang kalian anut. فَلَآ أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِن دُونِ اللهِ (maka (ketahuilah) aku tidak menyembah apa yang kamu sembah selain Allah) Dalam keadaan apapun itu. وَلٰكِنْ أَعْبُدُ اللهَ الَّذِى يَتَوَفَّىٰكُمْ ۖ (tetapi aku menyembah Allah yang akan mematikan kamu) Kemudian akan menyiksa kalian dengan siksaan yang berat. وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُؤْمِنِينَ(dan aku telah diperintah supaya termasuk orang-orang yang beriman) Dan aku mengikhlaskan diri dalam menyembah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104 Katakanlah wahai rasul: “Hai manusia, jika kamu masih dalam keragu-raguan tentang kebenaran agamaku taitu menyembah hanya kepada Allah dan tiada sekutu bagiNya, maka ketahuilah aku berlepas dari agama kalian sehingga tidak menyembah yang kamu sembah selain Allah berupa berhala, tetapi aku menyembah Allah yang akan mematikan dan menghidupkan kamu dan juga aku yang telah diperintah supaya termasuk golongan orang-orang yang beriman terhadap apa yang datang dari Allah”,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai manusia, jika kalian masih dalam keraguan tentang agamaku, aku tidak menyembah apa yang kalian sembah selain Allah, aku menyembah Allah yang akan mematikan kalian} mematikan kalian {dan aku diperintah agar aku termasuk golongan orang-orang mukmin.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Allah berfirman kepada NabiNya, Muhammad Sayyidul Mursalin, Imamul Muttaqin dan Khairul Muqinin, “katakanlah, ‘Hai Manusia, jika kamu masih dalam keragu-raguan tentang agamaku,” yakni dalam kebimbangan dan kerancuan, maka aku tidak akan ragu darinya bahkan aku mempunyai ilmu yang yakin bahwa Ia adalah kebenaran, dan sesuatu yang kamu sembah selain Allah adalah batil, dan dalam hal itu aku memiliki bukti-bukti kuat dan alasan-alasan yang jelas. Oleh karena itu, dia berkata, “Maka (ketahuilah) aku tidak menyembah yang kalian sembah selain Allah,” dalam bentuk berhala-berhala, sekutu-sekutu dan lain-lain, karena ia tidak menciptakan, tidak memberi rizki dan tidak mengatur perkara apa pun, ia hanya makhluk yang diatur yang padanya tidak terdapat sesuatu yang menjadikannya berhak untuk disembah. “Tetapi aku menyembah Allah yang akan mematikan kamu.” Dia-lah Allah yang menciptakanmu, Dia pula yang mematikanmu kemudian membangkitkanmu untuk membalas perbuatanmu, Dia-lah yang berhak untuk disembah, dilaksnakan shalat untuknya, dipatuhi dan disujudi. “Dan aku telah diperintah supaya termasuk orang-orang yang beriman.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 104: Ketika itu kata-kata ini ditujukan kepada penduduk Mekah. Yakni aku tidak ragu-ragu terhadapnya, bahkan aku memiliki ilmu yang yakin, bahwa ia merupakan kebenaran, dan apa yang kamu sembah selain Allah adalah batil, dan aku memiliki dalil dan bukti terhadapnya. Allah Subhaanahu wa Ta'aala yang menciptakan kamu, Dia pula yang mematikan kamu, kemudian akan membangkitkan kamu untuk memberi balasan terhadap amalmu. Oleh karenanya, Dialah yang berhak disembah dan diibadati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 104",
    "description": "Etelah dijelaskan pada ayat yang lalu bahwa Allah akan menyelamatkan dan memberikan kemenangan kepada orang-orang yang beriman, lalu pada ayat ini diperintahkan, katakanlah wahai nabi Muhammad, wahai manusia! jika kamu masih dalam keraguraguan tentang kebenaran agamaku, maka ketahuilah bahwa aku tidak menyembah apa pun yang kamu sembah selain Allah, karena aku tahu hal itu adalah sesat dan sembahan kamu tidak dapat menolak madarat juga tidak bisa mendatangkan manfaat, tetapi aku menyembah Allah yang akan mematikan kamu, dan aku telah diperintah agar termasuk dalam golongan orang yang beriman yang mantap imannya, dan aku telah diperintah dengan firman-Nya: hadapkanlah wajahmu kepada agama dengan tulus tanpa keraguan sedikit pun, dan ikhlas tanpa ada paksaan dari siapa pun, dan jangan sekali-kali engkau termasuk orang yang musyri."
  }
]