[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tegakkanlah dirimu (wahai rasul) di atas islam, dengan selalu lurus di atasnya, tidak condong ke ajaran yahudi dan nasrani ataupun penyembahan kepada selainNya. Dan janganlah kamu termasuk orang-orang yang mempersekutukan dalam peribadahan kepada tuhannya dengan tuhan-tuhan dan tandingan-tandingan, karena akibatnya kamu akan menjadi bagian dari orang-orang yang binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dia juga menyuruhku memegang teguh agama yang benar ini dan mempertahankannya dengan sekuat tenaga serta berpaling dari agama-agama lainnya. Dan Dia melarangku menjadi orang yang menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ (dan (aku telah diperintah): “Hadapkanlah mukamu kepada agama) Allah memerintahkan beliau untuk beristiqamah dan teguh dalam beragama serta tidak goyah sedikitpun. Allah mengungkapkan dengan kata ‘muka’ karena ia adalah anggota tubuh yang paling mulia. حَنِيفًا(dengan tulus) Yang tidak condong kepada agama apapun kecuali kepada agama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105 Aku telah diperintah agar beristiqamah dan teguh agama dengan beribadah dan berdoa dan berpaling dari agama-agama lain lalu menghadap agama Islam serta supaya aku tidak termasuk orang-orang yang menyekutukan Allah dengan Tuhan lain, sehingga aku dibinasakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Hadapkanlah wajahmu kepada agama} tetaplah pada agama Islam dan teguhlah pada agama itu {dengan lurus} berpaling dari agama-agama yang bathil {dan jangan sekali-kali kamu termasuk orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. “Dan (aku telah diperintah), ‘Hadapkanlah mukamu kepada agama dengan tulus dan ikhlas.” Maksudnya, ikhlaskanlah perbuatanmu lahir dan batin untuk Allah, tegakkanlah seluruh syariat agama “dengan tulus dan ikhlas” menghadapkan diri kepada Allah dan berpaling dari selainNya. “Dan janganlah kamu termasuk orang-orang yang musyrik”, jangan seperti keadaan mereka dan jangan bersama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 105: Yakni ikhlaskanlah amalmu yang nampak maupun yang tersembunyi karena Allah dan kerjakanlah ajaran agama sambil menghadapkan hati kepada Allah dan berpaling terhadap selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 105",
    "description": "Dan aku telah diperintah dengan firman-Nya: hadapkanlah wajahmu kepada agama dengan tulus tanpa keraguan sedikit pun, dan ikhlas tanpa ada paksaan dari siapa pun, dan jangan sekali-kali engkau termasuk orang yang musyridan jangan engkau menyembah selain Allah, sesuatu yang tidak memberi manfaat kepadamu walau kamu menyembahnya dan tidak pula memberi bencana kepadamu jika kamu tidak menyembahnya, sebab jika engkau lakukan itu, maka sesungguhnya engkau termasuk orang-orang zalim."
  }
]