[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu (wahai rasul), menyeru selain Allah sesuatupun dari patung-patung dan berhala-berhala, karena sesungguhnya mereka tidak dapat mendatangkan manfaat dan tidak dapat memberikan mudarat. Kemudian bila kamu melakukannya dan menyerunya selain Allah, maka sesungguhnya kamu termasuk orang-orang yang mempersekutukan Allah, yang berbuat aniaya kepada diri mereka melalui perbuatan syirik dan maksiat.” Ayat ini walaupun khitobnya untuk rosululloh akan tetapi ayat ini juga umum untuk umatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Dan janganlah engkau -wahai Rasul- menyembah tuhan selain Allah, baik berupa patung, berhala atau lainnya yang tidak dapat mendatangkan manfaat dan mudarat untukmu. Karena jika engkau menyembahnya maka engkau termasuk orang-orang zalim yang mencederai hak Allah dan hak mereka sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. وَلَا تَدْعُ مِن دُونِ اللهِ (Dan janganlah kamu menyembah selain Allah) Berupa berhala-berhala dan sekutu-sekutu. مَا لَا يَنفَعُكَ وَلَا يَضُرُّكَ ۖ(yang tidak memberi manfaat dan tidak (pula) memberi mudharat kepadamu) Dengan suatu manfaat atau mudharat apapun ketika kalian menyembahnya. Dan menyembah sesuatu yang tidak mampu mendatangkan manfaat dan tidak mampu memberi mudharat adalah perbuatan sia-sia yang tidak mungkin dilakukan orang yang berakal. فَإِن فَعَلْتَ(sebab jika kamu berbuat) Yakni menyembah berhala-berhala itu. فَإِنَّكَ إِذًا مِّنَ الظّٰلِمِينَ (maka sesungguhnya kamu kalau begitu termasuk orang-orang yang zalim) Zalim kepada diri mereka sendiri. Berangsiapa yang menyembah orang mati atau benda mati yang tidak dapat mendatangkan manfaat dan tidak mampu menolak mudharat adalah perbuatan syirik kepada Allah yang harus dijauhi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106 Aku dicegah agar tidak menyembah apa-apa selain Allah yang tidak bermanfaat jika disembah dan tidak pula memberi mudharat jika ditinggalkaan; sebab jika aku berbuat yang demikian, maka sesungguhnya aku tergolong orang-orang yang zalim terhadap diri sendiri, karena kesyirikan adalah kezaliman terbesar”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menyembah selain Allah, sesuatu yang tidak memberi manfaat kepadamu dan tidak memberi mudarat kepadamu, maka jika kamu melakukannya, sesungguhnya kamu termasuk orang-orang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. “Dan janganlah kamu menyembah apa-apa yang tidak memberi manfaat dan tidak (pula) memberi mudarat kepadamu selain Allah.” Ini adalah sifat setiap makhluk. Ia tidak mendatangkan manfaat dan mudarat. Dzat yang melakukan itu hanyalah Allah. “Sebab jika kamu berbuat (yang demikian) itu”, yakni kamu beribadah kepada selain Allah yang tidak mendatangkan manfaat dan mudarat untukmu, “maka sesungguhnya kamu kalau begitu termasuk orang-orang yang zhalim.” Maksudnya, yang merugikan dirinya sendiri dengan mencelakakannya. Kezhaliman ini adalah kesyirikan, sebagaimana Firman Allah, \"sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar\".\"(Luqman:13). Jika sebaik-baik makhluk seandainya dia beribadah kepada selain Allah bersama Allah, maka dia termasuk orang-orang zhalim lagi musyrik, maka bagaimana dengan selainnya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 106: Jika kamu menyembahnya. Jika kamu tidak menyembahnya. Inilah sifat yang ada pada sesembahan selain Allah yang menunjukkan tidak berhaknya untuk disembah. Yakni orang yang mencelakakan dirinya sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 106",
    "description": "Dan jangan engkau menyembah selain Allah, sesuatu yang tidak memberi manfaat kepadamu walau kamu menyembahnya dan tidak pula memberi bencana kepadamu jika kamu tidak menyembahnya, sebab jika engkau lakukan itu, maka sesungguhnya engkau termasuk orang-orang zalim. Dan jika Allah menimpakan suatu bencana kepadamu, seperti penyakit, kesedihan, dan cobaan lainnya, maka tidak ada yang dapat menghilangkannya darimu kecuali dia. Dan jika Allah menghendaki kebaikan bagi kamu, seperti kesehatan, kesenangan, kebahagiaan, dan lain-lain, maka tidak ada yang dapat menolak dan menghalangi karunia-Nya tersebut sampai kepadamu. Dia memberikan kebaikan kepada siapa saja yang dia kehendaki di antara hamba-hamba-Nya. Dia maha pengampun atas dosa orang yang bertobat, maha penyayang dengan limpahan berbagai rahmat walau hamba-Nya masih banyak berbuat maksiat."
  }
]