[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila Allah menimpakan padamu (wahai rasul), sebuah kesulitan atau bencana, maka tidak ada yang kuasa menghilangkannya kecuali Allah, . Dan kalau Dia menghendaki kehidupan nyaman bagimu atau kenikmatan, tidak ada seorangpun yang dapat menghambatnya darimu. Allah menimpakan kesenangan dan kesulitan kepada orang yang Dia kehendaki dari hamba-hambaNYa. Dan Dia mahapengampun terhadap dosa-dosa orang yang bertaubat kepadaNya lagi mahapenyayang terhadap orang yang beriman dan taat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Jika Allah mengujimu -wahai Rasul- dengan ujian tertentu dan engkau minta agar ujian itu disingkirkan darimu maka tidak ada yang dapat menyingkirkannya kecuali Allah. Dan jika Dia menghendaki kemakmuran untukmu maka tidak ada seorangpun yang dapat menolak anugerah-Nya. Dia memberikan anugerah-Nya kepada siapa saja yang Dia kehendaki di antara hamba-hamba-Nya. Tidak ada seorangpun yang dapat memaksakan kehendaknya kepada Allah. Dia Maha Menerima tobat dari hamba-hamba-Nya lagi Maha Pengasih kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Jika Allah menimpakan keburukan kepadamu, maka tidak ada yang dapat menghilangkannya kecuali Dia. Dan jika Dia menghendaki untuk memberimu kenikmatan, maka tidak ada yang dapat menghalanginya darimu. Allah memberi kenikmatan dan karunia-Nya kepada hamba-hamba-Nya yang Dia kehendaki. Allah Maha Pengampun bagi orang-orang yang bertaubat, dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَإِن يَمْسَسْكَ اللهُ بِضُرٍّ (Jika Allah menimpakan sesuatu kemudharatan kepadamu) Yakni Allah adalah Dzat yang memberi manfaat dan mudharat. Jika Allah menimpakan kemudharatan kepada hamba-Nya maka tidak ada yang dapat menghilangkannya kecuali Dia, tidak akan ada yang mampu menolaknya siapapun itu, kecuali Allah semata. وَإِن يُرِدْكَ بِخَيْرٍ فَلَا رَآدَّ لِفَضْلِهِۦ ۚ( Dan jika Allah menghendaki kebaikan bagi kamu, maka tak ada yang dapat menolak kurnia-Nya) Yaknii tidak ada yang dapat menghalanginya. Segala kebaikan dari Allah merupakan karunia dan kemurahan-Nya, bukan karena hak orang yang diberi yang wajib ditunaikan Allah, dan bagian dari karunia-Nya adalah Allah menciptakan makhluk-Nya, kemudian membaguskan rupanya, dan menempatkan mereka di bumi; dan termasuk karunianya pula hidayah yang diberikan kepada seseorang, serta kenabian yang diistimewakan bagi Nabi Muhammad yang merupakan karunia Allah yang tidak dapat dihalangi oleh siapapun. يُصِيبُ بِه(Dia memberikan kebaikan itu) Dengan karunia dan kemurahan-Nya. ۦ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۚ( kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya) Yang hanya disebabkan Allah hendak memilih mereka (bukan karena hak mereka yang wajib Allah tunaikan). وَهُوَ الْغَفُورُ الرَّحِيمُ(dan Dialah Yang Maha Pengampun lagi Maha Penyayang) Dan termasuk hal yang diampuni oleh Allah adalah ketidakmampuan hamba-hamba-Nya dalam menghitung segala kenikmatan yang diberikan oleh-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Betapa banyak orang yang menyangka bahwa ayat ini berbicara tentang kebaikan yang nampak saja, padahal kebaikan yang dapat dirasakan oleh seorang hamba bisa saja dengan satu keadaan sulit yang ia hadapai; yakni sebagai penghapusan dosa baginya, dan kasih sayang Allah untuknya : { وَهُوَ الْغَفُورُ الرَّحِيمُ } \"dan Dialah Yang Maha Pengampun lagi Maha Penyayang\" karena apapun yang di berikan oleh Allah adalah kebaikan untuk hamba-hamba Nya, sebagaimana yang diriwayatkan dalam hadits shahih (( عَجَبًا لأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ )) \"Sungguh menakjubkan keadaan seorang mukmin. Seluruhnya urusannya itu baik\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107 Jika Allah menimpakan suatu kemudharatan kepadamu yaitu keburukan berupa sakit atau kefakiran, maka tidak ada yang dapat menghilangkannya kecuali Dia yang menurunkannya. Dan jika Allah menghendaki kebaikan bagi kamu berupa nikmat dan kebahagiaan, maka tak ada yang dapat menolak karunia-Nya. Dia Maha Pengampun lagi Maha Pengasih bagi hamba-hamba-Nya yang mau bertaubat. Maka tunduklah kepadaNya dengan berbuat taat dan hindarilah kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menimpakan kepadamu} menimpakan kepadamu {kemudharatan} penderitaan dan ujian {maka tidak ada yang dapat mengangkatnya} tidak ada yang mencegahnya {kecuali Dia dan jika Dia menghendaki kebaikan bagimu} dengan kesejahteraan dan kelapangan {maka tidak ada yang dapat menolak} maka tidak ada yang bisa mencegah {karuniaNya. Dia memberikannya kepada siapa saja yang Dia kehendaki di antara hamba-hambaNya. Dialah Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. Ini termasuk dalil paling besar bahwa hanya Allah semata yang berhak untuk disembah karena Dia yang mendatangkan manfaat dan mudarat, yang memberi dan yang tidak memberi, yang mana jika ada kesulitan menimpa seperti kemiskinan, penyakit dan lain-lain “maka tidak ada yang dapat menghilangkannya kecuali Dia.” Karena jika seluruh makhluk berkumpul untuk memberi manfaat, maka mereka tidak akan dapat memberi manfaat kecuali apa yang telah ditulis oleh Allah, jika mereka hendak memudaratkan seseorang maka mereka tidak akan mampu melakukannya jika Allah tidak berkehendak. Oleh karena itu, Allah berfirman, “Dan jika Allah menghendaki kebaikan bagimu, maka taka da yang dapat menolak karuniaNya.” Maksudnya, tak seorang pun makhluk mampu menolak kebaikan dan karuniaNya sebagaimana FirmanNya, \"Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorangpun yang sanggup melepaskannya sesudah itu. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.\"(Fathir:2). “Dia memberikan kebaikan itu kepada siapa yang dikehendakiNya di antara hamba-hambaNYa.” Maksudnya, Dia menkhususkan rahmatNya kepada hamba-hambaNya yang dikehendakiNya, dan Allah adalah pemilik karunia yang agung. “Dan Dia-lah Yang Maha Pengampun”, terhadap seluruh kesalahan, yang memberi taufik kepada hamba-hambaNya kepada sebab-sebab ampunanNya kemudian jika hamba tersebut melakukannya, maka Dia mengampuni dosa-dosanya yang besar dan yang kecil. “Lagi Maha Penyayang.” Yang rahmatNya meliputi segala sesuatu, kemurahanNya dirasakan oleh semua yang ada di mana tidak ada yang tidak memerlukan kebaikanNya sedetik pun. Jika seorang hamba mengetahui dengan dalil yang kuat bahwa hanya Allah Pemberi segala nikmat, pengangkat segala kesulitan, Pemberi kebaikan, Penolak kesengsaraan dan marabahaya dan bahwa tidak seorang pun makhluk yang memiliki sedikit pun dari semua itu kecuali apa yang Allah titipkan melalui tanganNya, maka dia pasti memastikan bahwa Allah-lah yang haq dan sesuatu yang selainNya adalah batil. Oleh karena itu, ketika Dia menjelaskan dalil yang jelas, maka Dia berfirman setelahNya,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 107: Dalam ayat ini diterangkan dalil yang kuat yang menunjukkan bahwa yang berhak disembah hanyalah Allah, karena Allah yang memberikan manfaat dan berkuasa menimpakan bencana, Dia yang memberi dan yang berkuasa menghalangi. Dia adalah Tuhan di mana tidak ada yang sanggup menghilangkan bencana selain Dia. Jika semua penduduk bumi berkumpul untuk memberikan manfaat, maka mereka tidak akan dapat memberikannya kecuali sesuai yang telah ditetapkan Allah. Demikian juga jika semua orang berniat untuk menimpakan bencana, maka mereka tidak dapat menimpakannya kecuali jika dikehendaki Allah. Seperti kefakiran dan penyakit. Dia mengampuni semua dosa, Dia yang memberi taufik kepada hamba-Nya untuk mendatangi sebab-sebab untuk diampuni, kemudian apabila telah dilakukan, maka Allah Subhaanahu wa Ta'aala akan mengampuni dosa-dosanya yang besar maupun yang kecil. Rahmat-Nya meliputi segala sesuatu, kepemurahan-Nya mengena kepada semua yang ada, di mana semua makhluk tidak merasa cukup, bahkan selalu membutuhkan ihsan-Nya. Jika seorang hamba mengetahui berdasarkan keterang-keterangan di atas, bahwa Allah yang memberikan berbagai kenikmatan dan Dia yang mampu menghilangkan bencana, maka jelaslah bahwa Allah adalah Tuhan yang sebenarnya, dan bahwa apa yang mereka sembah selain-Nya adalah batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 107",
    "description": "Dan jika Allah menimpakan suatu bencana kepadamu, seperti penyakit, kesedihan, dan cobaan lainnya, maka tidak ada yang dapat menghilangkannya darimu kecuali dia. Dan jika Allah menghendaki kebaikan bagi kamu, seperti kesehatan, kesenangan, kebahagiaan, dan lain-lain, maka tidak ada yang dapat menolak dan menghalangi karunia-Nya tersebut sampai kepadamu. Dia memberikan kebaikan kepada siapa saja yang dia kehendaki di antara hamba-hamba-Nya. Dia maha pengampun atas dosa orang yang bertobat, maha penyayang dengan limpahan berbagai rahmat walau hamba-Nya masih banyak berbuat maksiat. Katakanlah wahai nabi Muhammad, wahai manusia! sungguh telah datang kepadamu kebenaran, yakni Al-Qur'an, dari tuhanmu, sebab itu barang siapa mendapat petunjuk, yakni beriman kepada nabi Muhammad dan mengikuti petunjuk Al-Qur'an, maka sebenarnya petunjuk itu untuk kebaikan dirinya sendiri. Dan barang siapa memilih sesat, yakni ingkar kepada nabi Muhammad dan Al-Qur'an, maka sesungguhnya kesesatannya itu akan mencelakakan dirinya sendiri. Dan aku bukanlah pemelihara, pengurus dan penjamin dirimu secara terus-menerus. Aku hanyalah seorang utusan yang mengajak kamu beriman kepada Allah. Dia, Allah yang akan memutuskan segala sesuatu."
  }
]