[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada sekalian manusia, ”sesungguhnya telah datang kepada kalian seorang utusan Allah dengan membawa al-qu’an, yang di dalamya terdapat penjelasan hidayah bagi kalian. Maka barangsiapa mendapat petunjuk melalui hidayah Allah, maka buah amal baiknya kembali kepada dirinya sendiri. Dan barangsiapa menyimpang dari kebenaran dan bertahan diatas kesesatan, maka kesesatannya dan mudaratnya menjadi tanggungannya sendiri. Dan aku tidak diperintah mengurusi kalian sehingga kalian beriman. Sesungguhnya aku hanyalah seorang utusan penyampai yang menyampaikan kepada kalian risalah yang aku diutus dengannya.’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Katakanlah -wahai Rasul-, \"Wahai manusia! Telah datang kepada kalian Al-Qur`ān yang diturunkan dari Tuhan kalian. Barangsiapa yang mengikuti petunjuk dan beriman kepada-Nya, maka manfaatnya akan kembali kepada dirinya sendiri. Karena Allah tidak membutuhkan ketaatan hamba-hamba-Nya. Dan barangsiapa yang tersesat maka dampak dari kesesatannya akan kembali kepada dirinya sendiri. Karena Allah tidak pernah dirugikan oleh kedurhakaan hamba-hamba-Nya. Dan aku bukanlah orang yang bertugas mengawasi dan menghitung amal perbuatan kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Hai Rasulullah, katakanlah kepada seluruh manusia: “Rasul Allah telah datang kepada kalian dengan membawa al-Qur’an yang agung; maka barangsiapa yang mendapat petunjuk dengan hukum-hukum dan hikmah-hikmahnya, maka manfaatnya akan kembali pada dirinya sendiri. Dan barangsiapa yang tersesat dan berpaling dari kebenaran, maka mudharatnya akan kembali kepada dirinya sendiri juga. Aku bukanlah orang yang bertugas mengawasi perbuatan kalian dan membuat perhitungan terhadap perbuatan tersebut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِى لِنَفْسِهِۦ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ (sebab itu barangsiapa yang mendapat petunjuk maka sesungguhnya (petunjuk itu) untuk kebaikan dirinya sendiri. Dan barangsiapa yang sesat, maka sesungguhnya kesesatannya itu mencelakakan dirinya sendiri) Yakni manfaat petunjuk yang ia dapatkan hanya bagi dirinya sendiri, dan akibat buruk dari kekafirannya hanya bagi dirinya pula, tidak ditanggung orang lain. Dan Allah tidak membutuhkan ketaatan atau kekafiran mereka sedikitpun. وَمَآ أَنَا۠ عَلَيْكُم بِوَكِيلٍ(Dan aku bukanlah seorang penjaga terhadap dirimu) Yakni bukanlah seorang penjaga yang menjaga dan mengawasi perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108 Katakanlah Wahai Rasul: “Hai manusia, penduduk Mekah dan sekitarnya, sesungguhnya teIah datang kepadamu kebenaran dari kitab Al Quran dari Tuhanmu, sebab itu barangsiapa yang mendapat petunjuk dengan masuk Islam dan mengimani Al-Qur’an maka sesungguhnya petunjuk itu untuk kebaikan dirinya sendiri dan musibah kesesatannya juga kembali kepadanya. Dan aku tidak mempunyai kuasa untuk menjadikan kalian beriman dan mencegah kalian dari kekufuran, melainkan hanya pembawa berita gembira dan peringatan”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Wahai manusia, sungguh telah datang kepada kalian kebenaran} Al-Qur’an {dari Tuhan kalian. Maka siapa saja yang mendapatkan petunjuk, maka sesungguhnya petunjuknya itu untuk dirinya sendiri. Siapa saja yang tersesat, maka sesungguhnya kesesatannya itu untuk dirinya sendiri. Aku bukanlah penanggung jawab kalian”} pengawas yang pengawasi pekerjaan-pekerjaan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Maksudnya, “Katakanlah”, hai Rasul ketika bukti telah jelas, “Hai manusia, sesungguhnya telah datang kepadamu kebenaran (alQuran) dari Rabbmu.” Yakni berita yang benar yang didukung dengan bukti-bukti yang tidak ada keraguan padanya sedikit pun dalam bentuk apa pun yang hadir kepadamu dari Rabbmu, yang merupakan salah bentuk tarbiyahNya yang besar bagi kalian, bahwa Dia menurunkan al-Quran ini, yang berisi penjelasan tentang segala sesuatu. Di dalamnya terkandung hukum-hukum dan tuntutan-tuntutan Ilahiyah, akhlak yang diridhai yang membuktikan besarnya nikmat pengaturan dan perhatianNya kepadamu. Sesungguhnya telah jelas jalan yang benar daripada jalan yang sesat, tak tersisa syubhat bagi seorang pun. “Sebab itu barangsiapa yang mendapat petunjuk”, dengan hidayah Allah, dengan mengetahui kebenaran, memahaminya dan mementingkannya di atas selainnya maka ia untuk dirinya. Allah Mahakaya terhadap hamba-hambaNya, dan buah amal perbuatannya kembali kepadanya. “Dan barangsiapa yang sesat”, dari petunjuk yaitu berpaling dari ilmu tentang kebenaran, memahaminya dan mementingkannya di atas selainnya maka ia untuk dirinya. Allah Mahakaya terhadap hamba-hambaNya, dan buah amal perbuatannya kembali kepadanya. “Dan barangsiapa yang sesat”, dari petunjuk yaitu dengan berpaling dari ilmu tentang kebenaran atau dari mengamalkannya, “maka sesungguhnya kesesatannya itu mencelakakan dirinya sendiri. “Dan aku bukanlah seorang penjaga terhadap dirimu.” Aku menjaga dan menghisab amalmu, aku hanyalah seorang pemberi peringatan yang nyata, dan Allah-lah yang menjagamu, pikirkanlah untuk dirimu sendiri selama kamu masih dalam tempo penangguhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 108: Yakni dengan mengetahui kebenaran, mengamalkannya, mengutamakannya, maka yang demikian untuk kebaikan dirinya, Alah Subhaanahu wa Ta'aala tidak butuh terhadapnya, bahkan sebenarnya buah dari amal mereka kembali kepada mereka. Dengan tidak mengetahui kebenaran atau tidak mau mengamalkannya. Dan Allah tidaklah rugi, bahkan yang rugi adalah orang yang sesat itu. Yakni pembelihara amalmu dan yang menjumlahkannya, sehingga aku harus memaksa kamu mengikuti petunjuk. Aku hanyalah pemberi peringatan yang jelas. Allah yang memperhatikan kamu, oleh karena itu perhatikanlah dirimu dalam waktu pemberian tangguh ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 108",
    "description": "Katakanlah wahai nabi Muhammad, wahai manusia! sungguh telah datang kepadamu kebenaran, yakni Al-Qur'an, dari tuhanmu, sebab itu barang siapa mendapat petunjuk, yakni beriman kepada nabi Muhammad dan mengikuti petunjuk Al-Qur'an, maka sebenarnya petunjuk itu untuk kebaikan dirinya sendiri. Dan barang siapa memilih sesat, yakni ingkar kepada nabi Muhammad dan Al-Qur'an, maka sesungguhnya kesesatannya itu akan mencelakakan dirinya sendiri. Dan aku bukanlah pemelihara, pengurus dan penjamin dirimu secara terus-menerus. Aku hanyalah seorang utusan yang mengajak kamu beriman kepada Allah. Dia, Allah yang akan memutuskan segala sesuatu. Dan ikutilah wahai nabi Muhammad, apa yang diwahyukan kepadamu, dan bersabarlah dalam menyampaikan wahyu walau banyak cobaan dan rintangan, hingga Allah memberi keputusan. Dialah hakim yang terbaik dalam setiap keputusan yang ditetapkan."
  }
]