[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Allah menyegerakan bagi manusia pengabulan doa mereka dalam keburukan, sebagaimana Dia menyegerakan pengabulan permintaan mereka dalam kebaikan, pastilah mereka akan binasa. Maka kami biarkan orang-orang yang tidak takut terhadap siksaan kami dan tidak meyakini kebangkitan dan dikumpulkannya mereka kembali, berkubang dalam penentangan dan kesombongan, dimana mereka terus ragu-ragu dan bingung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Seandainya Allah -Subḥānahu- segera mengabulkan doa jahat yang diucapkan oleh manusia untuk kebinasaan diri mereka sendiri, anak-anak dan harta benda mereka ketika mereka marah, sebagaimana Allah mengabulkan doa baik mereka, niscaya mereka sudah binasa. Akan tetapi Allah memberikan tenggang waktu kepada mereka. Maka Allah membiarkan orang-orang yang tidak menunggu perjumpaan dengan-Nya, karena mereka tidak takut terhadap hukuman-Nya dan tidak mengharapkan ganjaran-Nya, Allah membiarkan mereka mondar-mandir dalam kebingungan dan kebimbangan terhadap hari penghitungan amal (Hari Kiamat)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Salah satu bentuk kelembutan Allah kepada hamba-hamba-Nya adalah dengan tidak segera mengabulkan doa buruk yang mereka panjatkan, tidak seperti ketika mereka berdoa untuk kebaikan. Seandainya Allah menyegerakan pengabulan doa itu, niscaya mereka akan binasa dalam waktu singkat. Maka dari itu Allah membiarkan orang-orang yang mendustakan hari kebangkitan, berkubang dalam pembangkangan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَلَوْ يُعَجِّلُ اللهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُم بِالْخَيْر (Dan kalau sekiranya Allah menyegerakan kejahatan bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan) Yakni seandainya Allah menyegerakan siksaan bagi manusia seperti harapan mereka untuk menyegerakan pahala dan kebaikan. لَقُضِىَ إِلَيْهِمْ أَجَلُهُمْ ۖ( pastilah diakhiri umur mereka) Yakni mereka akan mati. Pendapat lain mengatakan, makna ayat ini adalah: seandainya Allah memperlakukan manusia dalam mengabulkan doa mereka tentang keburukan bagi diri, harta, dan keluarga mereka sebagaimana harapan mereka untuk diperlakukan dalam pengabulan doa baik mereka niscaya Allah telah membinasakan mereka. Sebab banyak sekali manusia yang berdoa agar dirinya mati, atau agar orang lain mati, dan berharap agar itu disegerakan. Namun Allah tidak menyegerakan keburukan tersebut karena kelembutan dan rahmat-Nya yang Maha Luas. Sebagaimana doa yang dipanjatkan oleh penduduk Makkah: “Ya Allah, jika betul (Al Quran) ini, dialah yang benar dari sisi Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih”. Dan Allah tidak mengabulkan doa mereka berkat hikmah-Nya yang telah ditetapkan bagi mereka yaitu masuknya mereka ke dalam agama Islam. فِى طُغْيٰنِهِمْ يَعْمَهُونَ(bergelimangan di dalam kesesatan mereka) Yakni Kami membiarkan mereka kebingungan dalam kesesatan, keangkuhan, dan ketidakmauan mereka untuk menerima kebenaran. Mereka mengatakan: seandainya al-Qur’an itu benar, maka kami telah berdoa kepada Allah agar menghujani kami dengan batu, dan karena Allah tidak melakukan itu maka kami tahu bahwa al-Qur’an bukanlah sesuatu yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan jika Allah mempercepat keburukan atau hukuman bagi manusia sebagaimana yang mereka minta layaknya meminta kebaikan dan pahala dengan cepat, niscaya mereka telah dibinasakan dan mati, sehingga Kami membiarkan orang-orang yang tidak berharap bertemu Kami, mengingkari hari kebangkitan dan penghisaban itu bingung dan bimbang atas kedurhakaan, pengingkaran, keangkuhan dan penolakan mereka terhadap kebenaran. Dan mereka tidak ditunjukkan kepada kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menyegerakan keburukan bagi manusia suatu keburukan} mengabulkan doa mereka tentang keburukan {sebagaimana permintaan mereka untuk disegerakan suatu kebaikan} sebagai mereka meminta untuk disegerakan ketika mereka berdoa tentang kebaikan {sungguh sudah diakhiri ajal mereka} sungguh mereka semua akan dibinasakan {namun Kami biarkan} Kami biarkan {orang-orang yang tidak mengharapkan pertemuan dengan Kami terombang-ambing dalam kesesatan mereka} terombang-ambing dalam kebingungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Ini termasuk kasih sayang dan kebaikan Allah kepada hamba-hambaNYa bahwa seandainya Dia menyegerakan keburukan dan hukuman kepada mereka jika mereka melakukan sebab-sebabnya sebagaimana Dia menyegerakan kebaikan kepada mereka jika mereka melakukan sebab-sebabnya “pastilah diakhiri umur mereka.” Yakni hukuman itu akan membinasakan mereka, akan tetapi Allah memberi tempo kepada mereka dan tidak melalaikan mereka, Dia memaafkan banyak hak-hakNya, seandainya Dia menghukum manusia karena kezhalimannya, pastilah Dia tidak membiarkan seorang pun di muka bumi, termasuk dalam hal ini adalah bahwa seorang hamba jika dia marah kepada anak-anaknya atau keluarganya atau hartanya bisa saja dia mendokan tidak baik yang mungkin saja jika dikabulkan pastilah mereka binasa, dan hal itu sangat merugikannya, akan tetapi Allah Mahabijaksana dan Mahalembut. FirmanNya, “Maka Kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan Kami,” yakni tidak beriman kepada akhirat, oleh karena itu dia tidak bersiap-siap untuknya dan melakukan apa yang menyelamatkan mereka dari azab Allah. FirmanNya “bingung di dalam kesesatan mereka”, yakni kebatilan di mana mereka melebihi batas-batas kebenaran. “bingung”, mondar-mandir kebingungan, tidak mengetahui jalan, tidak dibimbing kepada jalan yang lurus. Hal itu sebagai hukuman kepada mereka atas kezhaliman dan kekufuran mereka kepada ayat-ayat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 11: Ayat ini turun ketika kaum musyrik meminta disegerakan azab. Dan tidak akan diundur-undur. Hal ini termasuk kelembutan Allah dan ihsan-Nya kepada hamba-hamba-Nya, yakni jika sekiranya Allah menyegerakan kepada mereka keburukan karena mereka telah melakukan sebab-sebabnya dan segera menimpakan hukuman karena hal itu sebagaimana disegerakan-Nya kebaikan ketika mereka mengerjakan sebab-sebabnya, tentu mereka akan dimusnakan dengan azab, akan tetapi Allah Subhaanahu wa Ta'aala menundanya, memaafkan sebagian besar di antara hak-hak-Nya yang diremehkan. Kalau sekiranya Alah langsung menghukum manusia disebabkan kezalimannya, maka tidak ada seorang pun yang masih hidup. Termasuk dalam hal ini, seorang hamba ketika marah kepada anak-anaknya, istrinya dan hartanya, terkadang mendoakan keburukan kepada mereka yang seandainya dikabulkan oleh Allah tentu keluarga dan hartanya binasa, dan tentu akan merugikannya, akan tetapi Dia Maha Penyantun lagi Mahabijaksana sehingga tidak dikabulkan-Nya. Yakni tidak beriman kepada akhirat. Oleh karenanya, mereka tidak bersiap-siap untuknya dan tidak mengerjakan amalan yang menyelamatkan mereka dari azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 11",
    "description": "Setelah dijelaskan pada ayat sebelumnya bahwa Allah mahasuci dari segala kekurangan, mahasempurna dengan segala ciptaan-Nya, mahaadil dalam memberikan hukuman atau pahala, lalu dijelaskan pada ayat ini bahwa dia maha terpuji karena tidak segera menghukum orang yang durhaka sebagaimana permintaan mereka agar Allah menyegerakan siksa. Mereka diberi kesempatan untuk kembali kepada tuntunan Al-Qur'an. Dan kalau Allah menyegerakan keburukan, sebagai hukuman atas perbuatan jahat bagi manusia seperti permintaan mereka untuk menyegerakan kebaikan, pasti diakhiri umur mereka, yakni dibinasakan. Namun kami biarkan orang-orang yang tidak mengharapkan pertemuan dengan kami, yakni tidak percaya pada hari kiamat dalam keadaan bingung dan tetap berada di dalam kesesatan mereka sesuai kemauan mereka. Ayat ini masih menjelaskan tentang sifat-sifat buruk manusia, yaitu tidak bersyukur ketika mendapat anugerah atau nikmat. Dan apabila manusia ditimpa bahaya akibat ulah mereka sendiri, dia berdoa kepada kami dengan memuji dan mengakui keagungan Allah dalam keadaan berbaring, duduk atau berdiri, yakni terus berdoa tiada henti dalam segala situasi, tetapi setelah kami hilangkan bahaya itu darinya, dia kembali ke jalan yang sesat, seolah-olah dia tidak pernah berdoa kepada kami untuk menghilangkan bahaya yang telah menimpanya. Demikianlah dijadikan terasa indah bagi orang-orang yang melampaui batas apa yang mereka kerjakan berupa kedurhakaan."
  }
]