[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila manusia ditimpa kesulitan hidup, dia meminta pertolongan kepada Kami untuk menyingkirkannya dalam keadaan berbaring, duduk atau berdiri, tergantung dengan keadaan saat kesengsaraan itu menimpanya. Tatkala kami telah mengangkat kesulitan yang menimpanya, dia kembali berada di atas cara kehidupannya semula sebelum kesulitan melandanya dan lupa akan kesulitan dan musibah yang dia alami, dan tidak bersyukur kepada tuhannya yang telah menghilangkan darinya mara bahaya yang telah menimpanya. Dan sebagaimana telah dihiasi (oleh setan) bagi orang tersebut untuk terus-menerus melakukan pengingkaran dan penentangan setelah Allah menyingkirkan mara bahaya yang ada pada dirinya, begitu pula telah dihiasai (oleh setan) bagi orang-orang yang berbuat melampaui batas dalam melakukan kedustaan atas nama Allah dan para nabiNya atas apa yang mereka perbuat dari berbagai bentuk maksiat kepada Allah dan perbuatan syirik kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Apabila orang yang melampaui batas itu menderita sakit atau mengalami situasi yang buruk, ia berdoa kepada Kami seraya merendahkan dan menundukkan dirinya, sambil berbaring, duduk atau berdiri, dengan harapan bahwa kesulitan yang sedang dihadapinya itu dihilangkan. Kemudian setelah Kami mengabulkan doanya dan menghilangkan kesulitan yang dihadapinya, ia kembali seperti sedia kala, seolah-olah ia tidak pernah memanjatkan doa kepada Kami untuk dihilangkan kesulitannya. Sebagaimana orang yang berpaling dari kebenaran itu tergoda untuk mempertahankan kesesatannya, begitu pula orang-orang yang melampuai batas dengan kekafirannya pun tergoda untuk mempertahankan kekafiran dan kemaksiatan mereka dan tidak mau meninggalkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Jika Allah menguji manusia dengan sesuatu yang buruk, mereka akan selalu berdoa kepadanya dalam setiap keadaan agar keburukan itu segera hilang, baik itu ketika mereka berbaring, duduk, maupun ketika berdiri. Namun ketika Allah mengabulkan doa mereka, mereka tetap melakukan kemaksiatan dan melupakan ujian buruk yang menimpa mereka, seakan-akan mereka tidak pernah berdoa kepada Allah agar menghilangkan keburukan tersebut. Sebagaimana kekafiran dihiasi bagi seseorang agar tetap melakukannya, dihiasi pula dosa-dosa yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. دَعَانَا لِجَنۢبِهِۦٓ (dia berdoa kepada Kami dalam keadaan berbaring) Yakni dengan berbarik. أَوْ قَاعِدًا أَوْ قَآئِمًا(duduk atau berdiri) Seakan-akan ia berkata: kami berdoa kepadamu dalam segala keadaan. فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُۥ مَرَّ كَأَن لَّمْ يَدْعُنَآ إِلَىٰ ضُرٍّ مَّسَّهُۥ (tetapi setelah Kami hilangkan bahaya itu daripadanya, dia (kembali) melalui (jalannya yang sesat), seolah-olah dia tidak pernah berdoa kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya) Yakni ia kembali menempuh jalan sebagaimana ketika ia belum ditimpa bahaya dan melupakan doa dan ketundukan mereka yang bertekat untuk tidak mengulangi perbuatan buruk mereka, bahkan seakan-akan ia tidak pernah memanjatkan doa tersebut. Perbuatan ini banyak juga dilakukan oleh orang-orang Islam; lidah mereka menjadi banyak mengucapkan doa ketika mereka ditimpa apa yang mereka benci, dan saat Allah mengangkat hal itu mereka lalai kembali dan lupa akan kewajiban mereka untuk bersyukur atas dikabulkannya doa mereka dan diangkatnya musibah mereka. –Ya Allah, berilah kepada kami taufik untuk mensyukuri nikmat-Mu, dan ingatkanlah kami keadaan-keadaan yang telah Engkau karuniakan kepada kami dengan dikabulkannya doa kami agar kami dapat memperbanyak syukur kepada-Mu, dan sungguh Engkau tidak butuh terhadap rasa syukur kami, namun kami-lah yang membutuhkannya— كَذٰلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُوا۟ يَعْمَلُونَ(Begitulah orang-orang yang melampaui batas itu memandang baik apa yang selalu mereka kerjakan) Yakni memandang baik keberpalingan mereka dari doa, dan lalai dari syukur, serta bergelimang dengan syahwat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Tatkala seorang kafir ditimpa penderitaan berupa penyakit, kefakiran, dan suatu bahaya, maka dia akan berdoa kepada Kami agar dihilangkan marabahaya tersebut dari dirinya di setiap keadaannya dengan bersandar, duduk dan berdiri (hal ini menunjukkan kebingungan dan kegelisahannya yang besar). Ketika Kami menghilangkan marabahaya dan kepayahan tersebut dari dirinya, nisaya dia kembali kepada jalan yang dia tempuh, yaitu kekufuran dan melupakan kondisi kepayahan dan musibahnya, seakan-akan dia tidak berdoa kepada Kami untuk mengangkat marabahaya yang menimpanya. Seperti halnya dia digiring untuk durhaka ketika sehat, orang-orang musyrik dan kafir yang melampaui batas juga digiring agar tidak mau berdoa dan sibuk untuk berbuat maksiat dan mengikuti syahwat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila manusia ditimpa} ditimpa {kesusahan, dia berdoa kepada Kami dalam keadaan berbaring} berbaring di atas pembaringannya {duduk atau berdiri. Ketika Kami angkat} Kami hilangkan {kesusahan itu darinya, dia berlalu} dia kembali ke jalannya yang semula {seolah-olah tidak pernah berdoa kepada Kami untuk kesusahan yang telah menimpanya. Demikianlah, dihiasi bagi orang-orang yang melampaui batas itu} orang-orang yang melampaui batas kekufuran dan kemaksiatan {apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Ini adalah penjelasan tentang tabiat dasar manusia, bahwa jika ditimpa kesulitan berupa penyakit atau musibah, maka dia bersungguh-sungguh berdoa, memohon kepada Allah di setiap keadaannya dalam keadaan berdiri, duduk dan berbaring, dia terus menerus berdoa agar Allah mengangkat kesulitannya. “Tetapi tatkala Kami hilangkan bahaya itu darinya, dia (kembali) melalui (jalannya yang sesat), seolah-olah dia tidak pernah berdoa kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya.” Maksudnya terus dalam kelalaiannya, berpaling dari Rabbnya seolah-olah dia tidak ditimpa kesulitan yang telah Allah hilangkan. Kezhaliman mana yang lebih besar daripada ini? Dia meminta kepada Rabbnya agar mewujudkan maksudnya, lalu ketika Dia memberikannya, maka hamba itu tidak memperhatikan hak Rabbnya seolah-olah Rabbnya tidak memiliki hak atasnya. Ini adalah bentuk pemberian rasa indah dari setan, dia menjadikan apa yang buruk dan busuk menurut akal dan fitrah sebagai sesuatu yang baik. “Begitulah dijadikan terasa indah bagi orang-orang yang melampaui batas itu”, yaitu yang melanggar aturan-aturan Allah, apa yang selalu mereka kerjakan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 12: Ayat ini memberitakan tentang tabi’at manusia dari sisi keadaannya sebagai manusia, di mana apabila dia ditimpa bahaya seperti sakit, musibah, ia sungguh-sungguh dalam berdoa dan meminta kepada Allah dengan sangat dalam semua keadaannya agar Dia menyingkirkan bahaya itu. Seperti halnya orang-orang musyrik. Misalnya penyakit dan kemiskinan. Yakni dalam setiap keadaan. Dia berpaling di saat lapang dan lupa bahwa ketika ditimpa musibah, dia berdoa kepada Allah agar dihilangkan musibah itu, kemudian dikabulkan-Nya. Demikianlah setan menghiasi sikap itu kepada mereka, dihiasnya menjadi indah sesuatu yang secara akal dan fitrah sebagai perkara buruk. Orang-orang musyrik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 12",
    "description": "Ayat ini masih menjelaskan tentang sifat-sifat buruk manusia, yaitu tidak bersyukur ketika mendapat anugerah atau nikmat. Dan apabila manusia ditimpa bahaya akibat ulah mereka sendiri, dia berdoa kepada kami dengan memuji dan mengakui keagungan Allah dalam keadaan berbaring, duduk atau berdiri, yakni terus berdoa tiada henti dalam segala situasi, tetapi setelah kami hilangkan bahaya itu darinya, dia kembali ke jalan yang sesat, seolah-olah dia tidak pernah berdoa kepada kami untuk menghilangkan bahaya yang telah menimpanya. Demikianlah dijadikan terasa indah bagi orang-orang yang melampaui batas apa yang mereka kerjakan berupa kedurhakaan. Setelah dijelaskan bahwa di antara sifat buruk manusia adalah suka tergesa-gesa dan tidak bersyukur, lalu pada ayat ini disebutkan berbagai azab yang ditimpakan kepada orang-orang yang zalim. Dan sungguh, kami telah membinasakan secara menyeluruh atau mendatangkan azab berupa kerusakan dan kehancuran beberapa generasi umat-umat sebelum kamu, yakni kaum kafir mekah yang semasa dengan rasulullah, ketika mereka berbuat zalim, padahal para rasul mereka telah datang membawa keterangan-keterangan baik berupa mukjizat yang bersifat inderawi maupun yang tertera di dalam kitab suci, tetapi mereka sama sekali tidak mau beriman. Demikianlah kami memberi balasan kepada orang-orang yang berbuat dosa."
  }
]