[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami telah membinasakan umat-umat yang dahulu mendustakan utusan-utusan Allah sebelum kalian (wahai orang-orang yang menyekutukan tuhannya), ketika mereka berbuat kesyirikan, dan datang kepada mereka rasul-rasul mereka dari sisi Allah dengan membawa mukjizat-mukjizat yang nyata dan hujjah-hujjah yang menerangkan kebenaran rasul yang membawanya, namun umat-umat itu yang telah kami biansakan, tidak mau beriman dan membenarkan rasul-rasul mereka. Akibatnya, mereka pantas mendapatkan kebinsaan. Dan dengan bentuk pembinasaan seperti itu, kami akan memberi balasan setiap orang yang berbuat dosa lagi melampaui batas-batas Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan kami benar-benar telah membinasakan umat-umat sebelum kalian -wahai orang-orang musyrik- karena mereka mendustakan Rasul-rasul mereka dan gemar berbuat maksiat. Sungguh telah datang kepada mereka Rasul-rasul mereka yang Kami utus kepada mereka dengan membawa bukti-bukti dan dalil-dalil yang jelas dan nyata menunjukkan bahwa ajaran yang mereka bawa benar-benar berasal dari Tuhan mereka. Namun mereka tidak tertarik untuk beriman karena mereka tidak memiliki kesiapan untuk beriman. Maka Allah pun menghinakan mereka dan tidak membimbing mereka ke jalan iman. Dan sebagaimana kami telah memberikan balasan kepada umat-umat yang zalim itu, kami pun akan memberikan balasan kepada orang-orang semacam itu kapanpun dan di manapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Sungguh umat-umat yang mendustakan para rasul sebelumnya telah dibinasakan. Para rasul mereka telah mendatangi mereka dengan bukti-bukti yang jelas dan mukjizat-mukjizat yang nyata, yang menunjukkan kebenaran para rasul tersebut; namun mereka tetap tidak beriman. Demikianlah kebinasaan yang Kami jadikan balasan bagi orang-orang yang banyak melakukan dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَلَقَدْ أَهْلَكْنَا الْقُرُونَ مِن قَبْلِكُمْ (Dan sesungguhnya Kami telah membinasakan umat-umat sebelum kamu) Umat-umat terdahulu telah Kami binasakan ketika melakukan kezaliman dengan mendustakan dan menentang para Rasul serta tenggelam dalam kemaksiatan. وَجَآءَتْهُمْ رُسُلُهُم بِالْبَيِّنٰتِ (padahal rasul-rasul mereka telah datang kepada mereka dengan membawa keterangan-keterangan yang nyata) Yakni para Rasul telah datang kepada mereka dengan membawa ayat-ayat yang jelas yang menunjukkan kebenaran mereka. وَمَا كَانُوا۟ لِيُؤْمِنُوا۟ ۚ( tetapi mereka sekali-kali tidak hendak beriman) Yakni mereka tidak layak untuk beriman karena mereka tidak menghendakinya dan kelembutan telah dicabut dari diri mereka. كَذٰلِكَ نَجْزِى الْقَوْمَ الْمُجْرِمِينَ(Demikianlah Kami memberi pembalasan kepada orang-orang yang berbuat dosa) Dan ini merupakan ancaman keras bagi orang-orang kafir Makkah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Sungguh Kami telah membinasakan umat-umat terdahulu sebelum kalian, wahai penduduk Mekah, ketika mereka menzalimi diri sendiri dengan mendustakan rasul dan terjerumus dalam kemaksiatan. Dan telah datang kepada mereka para rasul yang diutus kepada mereka dengan membawa mukjizat dan ayat-ayat yang menjelaskan kebenaran mereka. Mereka tidak benar-benar beriman kepada para rasul. Seperti halnya balasan terhadap mereka berupa kehancuran akibat kekufuran dan pendustaan terhadap rasul itulah Kami akan membalas kaum kafir. Ini adalah peringatan berat bagi orang-orang kafir Mekah dan sekitarnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah membinasakan beberapa generasi} umat-umat {sebelum kalian ketika mereka berbuat zalim, padahal telah datang kepada mereka para rasul mereka dengan bukti-bukti yang nyata} bukti-bukti yang nyata {Mereka sama sekali tidak beriman. Demikian itu Kami memberi balasan} Kami menghukum dan membinasakan {kaum yang berbuat dosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Allah memberitahukan bahwa Dia membinasakan umat-umat yang telah lampau karena kezhaliman dan kekufuran mereka setelah datangnya keterangan yang jelas kepada mereka melalui tangan para rasul untuk menjelaskan kebenaran, tetapi mereka menolak tunduk kepadanya dan tidak beriman, maka Allah menurunkan siksanya yang tidak bisa ditolak yang menimpa semua pendosa yang berani melanggar batasan-batasan Allah. Ini adalah sunnatullah pada seluruh umat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Yunus ayat 13: Dengan melakukan kekafiran, kesyrikkan dan kezaliman. Yang menunjukkan kebenaran mereka, seperti mukjizat, namun mereka tidak mau tunduk dan beriman. Sebagaimana Kami binasakan umat-umat sebelum mereka. Yakni orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Yunus Ayat 13",
    "description": "Setelah dijelaskan bahwa di antara sifat buruk manusia adalah suka tergesa-gesa dan tidak bersyukur, lalu pada ayat ini disebutkan berbagai azab yang ditimpakan kepada orang-orang yang zalim. Dan sungguh, kami telah membinasakan secara menyeluruh atau mendatangkan azab berupa kerusakan dan kehancuran beberapa generasi umat-umat sebelum kamu, yakni kaum kafir mekah yang semasa dengan rasulullah, ketika mereka berbuat zalim, padahal para rasul mereka telah datang membawa keterangan-keterangan baik berupa mukjizat yang bersifat inderawi maupun yang tertera di dalam kitab suci, tetapi mereka sama sekali tidak mau beriman. Demikianlah kami memberi balasan kepada orang-orang yang berbuat dosa. Kemudian kami jadikan kamu, seluruh manusia, sebagai penggantipengganti mereka untuk menjadi pemimpin di bumi setelah mereka binasa, untuk kami lihat bagaimana kamu berbuat, kebaikan atau keburukan. Allah akan memberi pahala orang yang berbuat baik dan menghukum orang yang yang berbuat jahat."
  }
]